{
  "video_id": "-MUvGf11b5U",
  "text": "and I'll be looking at verses 12 down through verse number 30. If you've noticed in the bulletin, I've titled the message this evening, Joseph in the Pit. And of course, if we're familiar with the account of Joseph, as many of us would be, we understand it's in the passage here that he ends up in a pit before being sold into slavery. I trust that as we look at the passage of Scripture and seek to make application in our own lives that God will help us to draw closer to him. In our previous message from the book of Genesis, we learned of Joseph's two dreams and how he then shared those dreams with his family. We read of the response, in particular, the response of the brothers, and we'd say that it was less than desirable when the brothers, according to Genesis 37, in verse number 8, it says that they hated him yet the more for his dreams and for his words. Now remember, before he ever shared his dreams with his brothers, the Bible said that they hated him and could not speak peaceably unto him. And after hearing the dreams and what he said, they understood what was being revealed. They hated him yet the more. We find that as we look at the passage before us this evening, it begins in verse number 12, when the Bible simply says this, and his brethren went to feed their father's flock in Shechem. Now, the time that would pass between Joseph revealing the dreams to his brothers and the response and what have you, and the brothers departing to go to Shechem is unknown. We don't know how much time takes place between verse 11 and 12. It does not seem that there'd be a great amount of time that takes place, but there's some time that takes place, and we find that they depart in order to go feed their father's flock there in Shechem. We're not sure as to the exact reason, but it seems clear as you look at the text of Scripture. It's obvious that Joseph did not travel with his brethren for this particular task. No, Joseph remained in Hebron with his father. It's kind of interesting as you begin to think about Joseph staying there with his father. He's sent out, of course, and we understand that according to verse number 14. But I want you to think about the name of the city, Hebron, depending on how you want to say it. That word means association. And it really carries with it the idea of fellowship. And I want you to think just for a moment as Joseph, and we understand his position within the family. We've already read of the dysfunction, and we've talked about those things, and we've understood that Joseph is the favored son, the favorite. He's been given this coat of many colors and all of these things, but we find that he's there, and he stays in Hebron, and he's there, and he's having this fellowship with his father. And you think about the boys that have left, and you see what's going on, and no doubt with all that would take place in the home life of Joseph, it was probably a pretty peaceful situation. The brothers that hated him, the brothers that could not speak peaceably unto him, they were gone, and they were taking care of the flock. And he's there, and his father's there, and there's a fellowship that's taking place. And we find that according to our text of Scripture, that Israel's dad comes and speaks to Joseph. Notice the Bible tells us in verse number 13, And Israel said unto Joseph, Do not by brethren feed the flock in Shechem. Come, and I will send thee unto them. And he said to him, Here am I. And he, that's Jacob, said to him, Joseph, Go, I pray thee, see whether it be well with thy brethren, and well with the flocks, and bring me word again. So he sent him out of the vale of Hebron, and he came to Shechem. Verse 15 says, A certain man found him, and, behold, he, Joseph, he was wandering in the field. The man asked him, saying, What seekest thou? He said, I seek my brethren. Tell me, I pray thee, where they feed their flocks. The man said, They are departed hence, for I heard them say, Let us go to Dothan. And Joseph went after his brethren, and found them in Dothan. So we look at the passage of Scripture this evening, and we'll go down through verse number 30. In fact, we'll even make mention of verse 36. But I want you to notice this evening, if you are taking notes, number one, the concern of Jacob. We find that in verses 12 through 17, we read of Joseph's departure, but we find that the real reason that Joseph is sent on this task is because of the concern that Jacob has. Now, the source of the concern, the reason that Jacob has this concern, is certainly open to our understanding, debating, if you will. I believe that there's at least two very prominent reasons that could lead to Jacob being concerned. One could be that their expected return date had been missed. And they were gone longer than they were expected to be away for, and that could be reason for Jacob to be concerned. They do not have technology in this time like we have today. Some of us today were able to just send a quick note and find out, hey, what's going on, and we get a delay. You know, hey, I got caught up with this, that, or the other, and it's going to be a little bit of time. But do you remember back in the day, like, you know, 20 years ago when you didn't have that technology, and people would be standing at the door waiting for a loved one that was traveling and just anxiously waiting for their arrival? I remember as a child when we would travel from North Carolina up to New Jersey to visit with my grandparents, and I remember my grandparents waiting anxiously and patiently, my grandfather at least, by anxiously awaiting the arrival of our family. And some of you can relate to that and you can understand. And so Jacob has a measure of concern. Maybe it's because the boys have not returned at the appointed time. I believe that another reason that would lead Jacob to being concerned, thus sending Joseph, is because he understood, he was aware of the behavior of his boys. And certainly these boys could get themselves in trouble. And he was aware of their behavior, he was aware of how they acted and what they did, and perhaps it was a situation where Jacob was concerned about the boys because, I'm not sure what their behavior may have led to, what kind of trouble they might be in. And so we find that Jacob, and whether you have other ideas as to why it is that he's concerned, but we know that the Bible says that he calls Joseph to him and he says in verse 13, come and I will send thee unto them. And he said to him, here am I. And so when I think about the concern of Jacob, we see in the text of scripture that this concern on the part of Jacob leads to a mission for Joseph. This concern of Jacob leads to a mission for Joseph. And I want you to notice, as we see the response of Joseph, the Bible says at the end of verse number 13, that he simply responds by saying, here am I. Here am I. Now we notice that Joseph understands what Jacob is going to send him to do. The very boys that cannot speak peaceably unto him, the brothers that hate him, Joseph is being given this assignment from his father to go and to check on them. The Bible tells us, again, remember he was in Hebron. He's there having fellowship with his father. The brothers are not there. There's a measure of peace and maybe safety, if you will. And he says, here am I. And here's what Jacob says to him in verse 14. Go, I pray thee, see whether it be well with thy brethren and well with the flocks and bring me word again. So he sent him out of the vale of Hebron and he came to Shechem. And I want you to think about this passage of Scripture from the perspective we see the concern, but as we know the mission that's been assigned to Joseph and we know that his response is one that is immediate. He immediately responds in obedience to the command, to the mission that's been given to him. This particular response is not only immediate, but it's complete. I want you to notice that in verse number 15, the Bible says that a certain man found him and behold, he was wandering in the field. And so what happens? Well, he goes, he's leaving as he was assigned to do so. He's told to go to Shechem. Now Shechem is about a 60-mile journey from where he is. Now again, I mentioned this morning about the journey of Elijah being a hundred miles or so from Cherith over to Zarephath. And you think about a 60-mile journey, again, much more complicated than a 60-mile journey for us today. We think about the 60-mile journey that he'd go on and you think about some of the dangers and so on and so forth. In fact, even as you would think about the story that the brothers give to dad about the supposed demise of Joseph and it's being believable, the fact of the matter is that this was potentially some dangerous territory to travel. We find that the Bible says that he's wandering in the field. So what's he doing? He doesn't find them. They're not there. They're not in Shechem, the place where Jacob thought they would be. He didn't just turn around and go home. This wasn't a half-hearted effort. This wasn't a matter of obedience of checking the box, like, okay, well, I went and I just couldn't find them. Right? You ever tell your kids to clean the room? They come back and they say, clean the room! Like, there's no way you cleaned your room that fast. It's just not possible. Right? You understand what I'm saying? And then what happens? You go in there and you, don't open the closet! closet, right? Don't look under the bed. Why? Because it's not a full job. See, I see in Joseph here that even though the task that was assigned would be a task that personally, and I think if you'd be honest this evening, that you wouldn't want to do this. Why would you want to go find the boys, your brothers, that hate you, that want to kill you, that can't speak peaceably unto you. But Joseph goes. He's obedient. He finds as he's wandering there that there's some man that asks him saying, what seekest thou? He said, I seek my brethren. Tell me, I pray thee, where they feed the flock. And the Bible tells us that the man replied and said that they've departed from hence. And I heard them say, let us go to Dothan. And Joseph went after his brethren and found them in Dothan. That's an additional twelve mile journey. Seventy-two miles. It's a long journey. And Joseph takes this journey and he responds to the mission that was assigned again. The concern of Jacob led to a mission for Joseph. And we understand the physical nature of the relationship between Joseph and Jacob and his brothers. And we understand what's taking place here contextually, historically. And I want you to think this evening, if we could make spiritual application here, I wonder how it is that we respond to our Father when He gives us a mission. When God gives us a task to do, when God gives us a mission, how do we respond? Do we respond in obedience? Do we respond immediately? Do we, do we do it wholeheartedly? Do we do it to the, to the manner in which we ought to do it as far as all in, a hundred percent? Do you understand what I'm saying? Not just a, oh yeah, I did that, and it'd just be a half-hearted type of effort. We find in the text of Scripture that, yes, this is an account that's provided to us that's in a historical account, but we find that there's, the Bible's been given to us and we obviously can take application. And I think about the response of Joseph here in verse 13 when he says, here am I. Hold your place here in terms of Isaiah, and I know that you're familiar with Isaiah, but I want you to read it with me in Isaiah chapter number six this evening. And I want you to consider that this account that is given to us in the book of Isaiah, of the call of Isaiah, the commission of Isaiah. Now remember, Joseph says, here am I. And we find that as we come to the book of Isaiah in the sixth chapter, that it's the year that King Uzziah died, and Isaiah says that he saw also the Lord sitting upon a throne high and lifted up, and his train filled the temple. What a sight Isaiah six provides us with into the throne room of heaven. We find that he hears the angel singing, holy, holy, holy, and we notice all that's taking place, and then after the interaction, we're not taking the entire time to look at all these verses, but I want you to notice that Isaiah hears the voice of the Lord in verse number eight, and the voice of the Lord he hears saying, whom shall I send and who will go for us? Then said I, what does it say? Here am I. Here am I, send me. We don't see in Genesis 37 that Joseph says, here am I, send me, but I think it could be easily understood that that's what he was saying. Why? Well because Jacob says, come and I will send thee unto them. And Joseph says, here am I. You know that reveals to me a complete submission to his father. It's a complete submission to his father. Now I understand historical context. I understand what's taking place, and we could talk about relationships and what have you, but I want to make the spiritual application this evening, and I wonder this evening do we have that complete submission to our heavenly father? That when our heavenly father gives us a task, a mission, that it is met with immediate obedience, here am I. I'll go. I'll do. I'll say. I'll be. Here am I. Complete submission. Complete surrender. That's a good place to be in our lives. So often in our lives if we're not careful, we're going to hold certain parts back for us. And we think that we can manage this part or manage that part and we can, no, no, no. We learn in life it's so much better if we just let God have His way. We live in that condition of absolute surrender. And here in our text of Scripture, I do not want us to miss it this evening that Joseph was completely submitted and surrendered to his father. And by way of spiritual application this evening, I hope that each and every one of us could say, it's a personal evaluation that we need to make. Am I completely surrendered and submitted to the will of my father? If I say that I am, I don't know where he's going to send me. It's okay, because he'll be with you and he'll use you. And it will be worth it. Back to the historical account, as we continue in our text of Scripture, we begin looking through, beginning in verse number 18 there, we see number two, if you're taking notes, not only the concern of Jacob, but number two, we see the conspiracy of the brothers, the conspiracy of the brothers. Notice the Bible says, it begins in verse number 18, and when they saw him afar off, even before he came near unto them, they conspired against him to slay him. Wow. They saw him from afar. How do you think they saw him from afar? I think that coat of many colors had a big part. And then being able to easily identify who it was that was making their way toward him, them. We find that it was obvious that there's Joseph, he's coming over here. And I want you to notice as you look at the text of Scripture, I want you to, in your sanctified imagination, as you look at the passage and try to hear the tone, if you will, of the brothers, the Bible says that even before he came near unto them, they conspired against him to slay him. And notice what they say in verse number 19, they said one to another, behold, this dreamer cometh. Think they're still upset about the dreams? Sure they are. Fresh on their mind. And the Bible says, come now therefore, and let us slay him and cast him into some pit, and we will say, some evil beast hath devoured him, and we shall see what will become of his dreams. I mean, can you hear the tone of the voice of the brothers? Evil. We've heard these dreams, behold, this dreamer cometh. Let's see what's going to become of his dreams. Here's what we're going to do. We've got this plan. We see their evil hearts. The conspiracy to kill him and to throw him into a pit. They even went through such lengths of developing a plan to cover their actions, where they say in verse number 20 that we will say, some evil beast hath devoured him, and we shall see what will become of his dreams. We find that that's exactly what happens. They give that story to Jacob at the end of the text of Scripture. We'll look at that next Sunday evening. But we find that this plan, as they develop this plan, they develop a cover story. How are we going to cover this up? What are we going to say? Reuben steps in. He hears of what's taking place, and he offers an alternative. We find that the alternative is given in verse 21. It says, And Reuben heard it, and he delivered him out of their hands, and said, Let us not kill him. And Reuben said unto them, Shed no blood, but cast him into this pit that is in the wilderness, and lay no hand upon him, that ye might rid him out of their hands, to deliver him to his father again. So he didn't really stand up to his brothers like he should have. He offers an alternative plan, and we find that he's going to then try to come behind the scenes, if you will, and deliver Joseph back to his father. And it says then in verse 23, And it came to pass, when Joseph was coming to his brethren, he's not even to them yet. All of this is happening. I mean, he's just approaching them. By the way, why did Jacob want him to go find out? He wanted to bring him word again. I think Jacob wanted his sons to come back to Hebron. They had departed. They had left the place of association or fellowship, and he wanted the brothers to come back, and he sends Joseph to go. And before Joseph even enters into their presence, they have this plan devised on how they're going to get rid of Joseph. The Bible says in verse 23 that they stripped Joseph out of his coat, his coat of many colors that was on him. They took him and cast him into a pit. The pit was empty. There was no water in it. I want you to think about verse 23 and 24. Can you imagine Joseph coming? He's just being obedient. It was not the idea, the thought of Joseph, of, hey, dad, the brothers, they haven't been back for a little while, and should I go and check on them? No. This was the plan of his father. His father sent him... on this mission and he goes and he's there and as soon as he arrives, can you imagine as he's met by these boys that grab him and they tear this coat off of him and they throw him into a pit. Man, it's terrible. The place where he finds his brothers is called Dothan. It's believed that this particular city was known as having two wells and perhaps it's one of those wells that became this pit where it's dry because wells sometimes dry up. We find that the Bible specifically tells us, I want you to notice verse 24 and 25 where they took him and they cast him into a pit. The pit was empty, there was no water in it. And then the very next statement says, and they sat down to eat bread. Does that just baffle your mind? They sat down to eat bread, their brother. Came on a mission in obedience to dad. They strip him of his clothes and they cast him in a pit. As they cast him in a pit, they simply sit down to eat bread. Talk about cold hearted, cruel. What depravity. The Bible says they sat down to eat according to verse number 25. And there's a final twist that is given to us with regard to the conspiracy. For they lift up their eyes and they looked and behold a company of the Ishmaelites came from Gilead with their camels bearing spicery and balm and myrrh going to carry it down to Egypt. Judah is the second brother that's named specifically. Reuben in verse 21, now Judah in verse 26. Notice what he says to his brothers. What profit is it if we slay our brother and conceal his blood? Come and let us sell him to the Ishmaelites and let not our hand be upon him for he is our brother in our flesh. And his brethren were content. Why kill him when we can sell him? Because if we kill him, we don't really get anything. But if we sell him, then we can make something. This is terrible. Joseph was then sold, the Bible tells us in verse 28. Then there passed by Midianites, merchant men and they drew and lifted up Joseph out of the pit and sold Joseph to the Ishmaelites for 20 pieces of silver. And they, the Ishmaelites, brought Joseph there to Egypt. I want you to see what's happening as you look at this text of scripture. And think about the price that was put on Joseph's head. 20 pieces of silver. How many brothers? 10. Yeah, two pieces of silver each. Two pieces of silver each. And you know what else they got? A guilty conscience for years. Hold your place here in Genesis 37 and just turn over a few pages of Genesis 42. And I want you to see what they lived with for years. In Genesis chapter 42, we'll get to this text of scripture in, I don't know, a few months, hopefully not. It'd be sooner than that. But in Genesis chapter 42, it's the record of the brothers first coming to Egypt because of the famine. We find that they encounter some difficulties and what have you. It would seem as you look at the text of scripture, there's about 20 years that had passed from when he was sold, Joseph, into slavery and when his brothers come. The Bible tells us in verse 21 that after they encountered some of this difficulty, and we won't get into all of what they dealt with. We'll get to it as we get to this particular chapter. But I want to draw your attention to what the Bible says in verse 21. And they said one to another, we are verily guilty concerning our brother in that we saw the anguish of his soul when he besought us and we would not hear. Therefore, is this distress come upon us? Seems like it's about 20 years as you do the calculations and follow the timeline here in the book of Genesis. That two pieces of silver was long gone. That two pieces of silver was long gone. They had a guilty conscience. The hardships came and immediately, you know what their immediate response was? We're guilty concerning our brother. We're guilty concerning our brother. And we find here that as we look at this text of scripture and we see what's taking place, the Bible tells us that they say that we saw the anguish of his soul and he besought us and we would not hear. Again, the text in Genesis 37 says they threw him into a pit and they sat down to eat. But here years later, it's as if they could hear his voice when he was calling out, seeing his face. We come back to Genesis 37. We see the concern, the conspiracy. I want you to see the confusion of Joseph, number three. The confusion of Joseph. The Bible tells us in verse 28 that he sold for 20 pieces of silver. Reuben then returns according to verse number 29 and the Bible says that he returned to the pit and behold, Joseph was not in the pit and he rent his clothes and returned unto his brethren and said, the child is not nigh, whither shall I go? I don't know, the Bible doesn't tell us where Reuben went during this transaction that took place when they sold Joseph into slavery. But the Bible tells us that Midianites sold him into Egypt unto Potiphar, an officer of Pharaoh's in verse number 36 and captain of the guard. Joseph is now on his way to Egypt as a slave. We find that as the mission began, as the instruction was given from Jacob, notice it says in verse number 14, he said to him, go, I pray thee, see whether it be well with thy brethren and with thy flock and notice where he says, and bring me word again. You know, I think Jacob had the expectation that Joseph was gonna return. I think Joseph had the expectation that he's gonna return. But now here is Joseph after being sold into slavery, after all that he's experienced, being in the pit and then taken out, the brother saying, hey, listen, he's our brother. Can you imagine hearing your brother say? He's our brother. Well, I mean, what good does it do if we kill him? Let's just go ahead and sell him into slavery. I think there's gotta be confusion. The part of Joseph is he's traveling now this long, dreary road to Egypt as a slave. I wonder this evening what questions might flood your mind given the circumstances of Genesis 37. What kind of questions will we ask? Would we ask, why is this happening? Probably some of us would. If we'd be honest tonight, some of us would probably say, why is this happening? Maybe some of us would ask this question, what's gonna happen when I get to Egypt? I didn't know anybody in Egypt. Different land, different people, different culture. Who's gonna purchase me? What's gonna happen? Can you imagine? I mean, I begin to think about the process of Joseph and the confusion and we find that Genesis 42 and verse 21 tells us that Joseph besought his brothers. Now, I'm not sure as you look at Genesis 42 and 21, we mentioned it just a moment ago, but when the Bible says that they were guilty concerning our brother in that we saw the anguish of his soul when he besought us and we would not hear. Therefore, this distress come upon us. Now, could it be that Joseph besought his brothers while he was being thrown into the pit? Sure. Could it be that during the negotiations with the Ishmaelites as he's gonna be sold into slavery that he's pleading with his brothers? Why are you doing this? Don't sell me to these people. Could you imagine? The Bible says that they saw the anguish of his soul and when he besought us and we find that Joseph is here and while he's in the pit and while they're negotiating with the Ishmaelites, I think that he's confused about these events. What's going on? What's gonna happen? We find as we read already in verse 36 of Genesis 37 that Joseph arrives in Egypt and the Bible tells us that he's purchased by Potiphar. Now, for us this evening, most of us tonight, if I were to put most of us on the spot and have you come stand up here and say what happens next in the life of Joseph, give me just a five-step overview, you would quickly get to the palace part of Joseph. Joseph doesn't know that at this point. know at this point what the future holds, what's going to happen. As we begin to think about Joseph, and we notice what's happening, and we see the events as they unfold, the book of Psalms in the 90th chapter gives us this truth concerning our lives, and I want you to turn there quickly, Psalm 90, I want you to look at what the Bible says in verse number 9, look at just a couple of verses here. The Bible tells us in Psalm 90 in verse number 9, for all our days are passed away in thy wrath. Notice what it says, we spend our years as a tale that is told. The Bible says in verse number 10, the days of our years are threescore years and ten, for by reason of strength they be fourscore years, yet is their strength, labor, and sorrow for to soon cut off and we fly away. So verse 12 says teach us to number our days that we may apply our hearts unto wisdom. I want you to notice the end of verse number 9 where the Bible says that we spend our years as a tale that is told. For us this evening we have the privilege of reading the story of Joseph, the account that God has given us. The tale, if you look at this verse of Psalm 99, we spend our years as a tale that is told. We're reading Joseph's story, the account of his life. And I want you to understand that at this particular time in Joseph's life that there are some events that have taken place that could certainly lead to confusion. No doubt there are times in your lives, in my life, in your life, when things seem to take what we might call an unexpected turn. They're happen. You say, I didn't see this coming, I didn't know that was going to happen, I didn't think these people were going to treat me this way, or I didn't, an unexpected turn. And the question that we must ask ourselves and when that happens in our life, and we'll note this as we continue to study the life of Joseph, is that when that moment comes and maybe you're in that kind of a moment this evening, when that unexpected rises and comes in your life, we must learn to rest and to trust in our Heavenly Father, knowing that He's a plan for our life. We may not know what the plan is, in fact we may not be able to see beyond right here to even think about there's a plan. It's amazing to me when you look at the entire account of the book of Genesis of the life, the days of Joseph, that when he reveals his identity to his brothers, he says, God sent me before you to preserve life. He says it again in Genesis 50 after Jacob dies because the brothers think, okay, Joseph's been nice to us because dad was alive and so on and so forth and now we're really going to get what we deserve. And Joseph says, no, no, no, in Genesis chapter 50 it's such a powerful truth that we see in the text of Scripture where he says to his brothers in verse number 19, and Joseph said to them, fear not, for am I in the place of God, but as for you, you thought evil against me, but God meant it unto good to bring to pass as it is this day to save much people alive. That perspective of Joseph is precious and it's one that we need to have. You say, well, you don't know what that person did to me. Did you just read what I read in Genesis 37? If anyone honestly could get a pass, I think Joseph would be near the top of the list. Do you understand what I mean by saying that? Like if somebody could get a pass for, Joseph, you know what, we understand, I mean, it was just really tough what happened and I understand that, no, he kept his eyes on the Lord. Remember we talked about being at Bethel, the place of God, the house of God? He was there. And Joseph, he had developed that character, he had known something about the truth of Jehovah God and serving God, and we'll see this as we continue to study through his life and understand what's been revealed to us in the pages of Scripture through the account of Joseph, but I want you to understand this evening that there are times in your life that you might be confused of what's going on. You can be there. But in that moment of confusion, never stop trusting God because God is greater. God is greater. But these people, God is greater. But did you hear, God is greater? You can go on the internet, you can watch conspiracy theory stuff until you're dead, honestly. Crazy. Ultimately, God is in control. God is in control. God is in control. As I look at Genesis 37 and I think about that truth in Psalm 90 that we spend our days of the tale that is told, there are times in the story of our lives, the record of our lives that somebody else might have seemingly had the pen. The brothers, they're the ones kind of calling the shots here in Genesis 37. They're the ones that have taken Joseph and thrown him in the pit and they're the ones that make the decision that we're going to sell him into slavery. Joseph's just at their whim, seemingly having no control. But ultimately, God sent me before you. That's Joseph's testimony and that is powerful. If we could just get to that point in our lives, honestly, where we let God be God and we recognize that these things, God is sovereign, God is in control, God has a plan, God has a purpose. Listen, what would happen? How would we read the account in Joseph, excuse me, in Genesis if Joseph just went ahead and forsook everything that he knew about God and just gave up on life and said, this isn't fair? You know when people say life isn't fair today? Seems like you can hear it all the time, right? Life isn't fair. Life isn't fair. How would you read the rest of Genesis if Joseph responded that way? Joseph just quit living a righteous life because he had some hard times. I don't think you'd read of Joseph ending up in the palace. Do you? I don't think so. We see that he kept his eyes on the Lord. This evening, two points of application. Number one, Joseph was given a mission by his father. Joseph's response to that mission reveals to us his complete submission and surrender to the plan of his dad. This evening, you and I have a heavenly father. He has a mission for us, he has a plan for us, he has a purpose for our lives. How is it that we respond to him? Do we respond immediately with complete submission and surrender? Lord, here's my life. Do what you want to do. Have thine own way, Lord. My life, Lord, is yours to control. Why? I've been bought with a price. Number two, your life might take an unexpected turn. In fact, I think all of us, as we live, we can think of times when our life did take an unexpected turn. And don't think that the last one is the last one. There may be other unexpected turns that lie ahead. But we find that in those moments, we must keep our eyes on Jesus and we must trust him to know that he always does what's best. He knows what's right. I trust that this evening we'd be challenged by this account from the life of Joseph. We see the historical aspect of it, but oh, let's take application and let's respond as we should. Father, we love you. We thank you for loving us. Thank you for the truth of your word. Thank you for the record that you've given us, Lord, here of the life of Joseph. And as we think about his life at this particular time and these events that unfold, we understand that there could certainly be a measure of confusion. He besought his brothers, the Bible tells us. They saw the anguish on his face. But at times in our lives, if we'd be honest, we just don't understand maybe all that's going on. God, I pray that you'd help us tonight to trust you. You'd help us to know how great you are and to know the plan that you have for us. God, to know that you do all things well. I pray that we would be in complete submission. surrender to you and to your will, that we'd simply say, here am I. Lord, we thank you for this record and testimony. I pray that you'd just work in our hearts now. We'll thank you for every decision that's made, for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano. Maybe God spoke to your heart this evening and maybe you just want to come and maybe you're in the midst of an unexpected turn, something that's transpired, you just don't understand. Say, God, I don't understand right now, but I'm trusting you. I'm believing you. Maybe this evening if you're honest in your evaluation, you're not completely submitted and surrendered to the will of your heavenly Father. Maybe you need to come this evening and get that taken care of and fully surrender. As Kimberly plays, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.0,
      "text": " and I'll be looking at verses 12 down through verse number 30."
    },
    {
      "id": 1,
      "start": 5.0,
      "end": 8.0,
      "text": " If you've noticed in the bulletin, I've titled the message this evening,"
    },
    {
      "id": 2,
      "start": 8.0,
      "end": 11.0,
      "text": " Joseph in the Pit."
    },
    {
      "id": 3,
      "start": 11.0,
      "end": 14.0,
      "text": " And of course, if we're familiar with the account of Joseph,"
    },
    {
      "id": 4,
      "start": 14.0,
      "end": 17.0,
      "text": " as many of us would be, we understand it's in the passage here"
    },
    {
      "id": 5,
      "start": 17.0,
      "end": 21.0,
      "text": " that he ends up in a pit before being sold into slavery."
    },
    {
      "id": 6,
      "start": 21.0,
      "end": 24.0,
      "text": " I trust that as we look at the passage of Scripture"
    },
    {
      "id": 7,
      "start": 24.0,
      "end": 27.0,
      "text": " and seek to make application in our own lives that God will help us"
    },
    {
      "id": 8,
      "start": 28.0,
      "end": 30.0,
      "text": " to draw closer to him."
    },
    {
      "id": 9,
      "start": 30.0,
      "end": 33.0,
      "text": " In our previous message from the book of Genesis,"
    },
    {
      "id": 10,
      "start": 33.0,
      "end": 37.0,
      "text": " we learned of Joseph's two dreams and how he then shared"
    },
    {
      "id": 11,
      "start": 37.0,
      "end": 39.0,
      "text": " those dreams with his family."
    },
    {
      "id": 12,
      "start": 39.0,
      "end": 43.0,
      "text": " We read of the response, in particular, the response of the brothers,"
    },
    {
      "id": 13,
      "start": 43.0,
      "end": 46.0,
      "text": " and we'd say that it was less than desirable when the brothers,"
    },
    {
      "id": 14,
      "start": 46.0,
      "end": 49.0,
      "text": " according to Genesis 37, in verse number 8, it says that"
    },
    {
      "id": 15,
      "start": 49.0,
      "end": 53.0,
      "text": " they hated him yet the more for his dreams and for his words."
    },
    {
      "id": 16,
      "start": 53.0,
      "end": 57.0,
      "text": " Now remember, before he ever shared his dreams with his brothers,"
    },
    {
      "id": 17,
      "start": 57.0,
      "end": 62.0,
      "text": " the Bible said that they hated him and could not speak peaceably unto him."
    },
    {
      "id": 18,
      "start": 62.0,
      "end": 65.0,
      "text": " And after hearing the dreams and what he said,"
    },
    {
      "id": 19,
      "start": 65.0,
      "end": 67.0,
      "text": " they understood what was being revealed."
    },
    {
      "id": 20,
      "start": 67.0,
      "end": 69.0,
      "text": " They hated him yet the more."
    },
    {
      "id": 21,
      "start": 69.0,
      "end": 73.0,
      "text": " We find that as we look at the passage before us this evening,"
    },
    {
      "id": 22,
      "start": 73.0,
      "end": 76.0,
      "text": " it begins in verse number 12, when the Bible simply says this,"
    },
    {
      "id": 23,
      "start": 76.0,
      "end": 81.0,
      "text": " and his brethren went to feed their father's flock in Shechem."
    },
    {
      "id": 24,
      "start": 81.0,
      "end": 87.0,
      "text": " Now, the time that would pass between Joseph revealing the dreams"
    },
    {
      "id": 25,
      "start": 87.0,
      "end": 90.0,
      "text": " to his brothers and the response and what have you,"
    },
    {
      "id": 26,
      "start": 90.0,
      "end": 92.0,
      "text": " and the brothers departing to go to Shechem is unknown."
    },
    {
      "id": 27,
      "start": 92.0,
      "end": 97.0,
      "text": " We don't know how much time takes place between verse 11 and 12."
    },
    {
      "id": 28,
      "start": 97.0,
      "end": 101.0,
      "text": " It does not seem that there'd be a great amount of time that takes place,"
    },
    {
      "id": 29,
      "start": 101.0,
      "end": 104.0,
      "text": " but there's some time that takes place, and we find that they depart"
    },
    {
      "id": 30,
      "start": 104.0,
      "end": 107.0,
      "text": " in order to go feed their father's flock there in Shechem."
    },
    {
      "id": 31,
      "start": 107.0,
      "end": 110.0,
      "text": " We're not sure as to the exact reason, but it seems clear"
    },
    {
      "id": 32,
      "start": 110.0,
      "end": 112.0,
      "text": " as you look at the text of Scripture."
    },
    {
      "id": 33,
      "start": 112.0,
      "end": 117.0,
      "text": " It's obvious that Joseph did not travel with his brethren for this particular task."
    },
    {
      "id": 34,
      "start": 117.0,
      "end": 121.0,
      "text": " No, Joseph remained in Hebron with his father."
    },
    {
      "id": 35,
      "start": 121.0,
      "end": 124.0,
      "text": " It's kind of interesting as you begin to think about Joseph staying there"
    },
    {
      "id": 36,
      "start": 124.0,
      "end": 126.0,
      "text": " with his father."
    },
    {
      "id": 37,
      "start": 126.0,
      "end": 129.0,
      "text": " He's sent out, of course, and we understand that according to verse number 14."
    },
    {
      "id": 38,
      "start": 129.0,
      "end": 133.0,
      "text": " But I want you to think about the name of the city, Hebron,"
    },
    {
      "id": 39,
      "start": 133.0,
      "end": 135.0,
      "text": " depending on how you want to say it."
    },
    {
      "id": 40,
      "start": 136.0,
      "end": 139.0,
      "text": " That word means association."
    },
    {
      "id": 41,
      "start": 139.0,
      "end": 144.0,
      "text": " And it really carries with it the idea of fellowship."
    },
    {
      "id": 42,
      "start": 144.0,
      "end": 147.0,
      "text": " And I want you to think just for a moment as Joseph,"
    },
    {
      "id": 43,
      "start": 147.0,
      "end": 149.0,
      "text": " and we understand his position within the family."
    },
    {
      "id": 44,
      "start": 149.0,
      "end": 153.0,
      "text": " We've already read of the dysfunction, and we've talked about those things,"
    },
    {
      "id": 45,
      "start": 153.0,
      "end": 157.0,
      "text": " and we've understood that Joseph is the favored son, the favorite."
    },
    {
      "id": 46,
      "start": 157.0,
      "end": 160.0,
      "text": " He's been given this coat of many colors and all of these things,"
    },
    {
      "id": 47,
      "start": 160.0,
      "end": 164.0,
      "text": " but we find that he's there, and he stays in Hebron,"
    },
    {
      "id": 48,
      "start": 164.0,
      "end": 170.0,
      "text": " and he's there, and he's having this fellowship with his father."
    },
    {
      "id": 49,
      "start": 170.0,
      "end": 174.0,
      "text": " And you think about the boys that have left, and you see what's going on,"
    },
    {
      "id": 50,
      "start": 174.0,
      "end": 180.0,
      "text": " and no doubt with all that would take place in the home life of Joseph,"
    },
    {
      "id": 51,
      "start": 180.0,
      "end": 184.0,
      "text": " it was probably a pretty peaceful situation."
    },
    {
      "id": 52,
      "start": 184.0,
      "end": 188.0,
      "text": " The brothers that hated him, the brothers that could not speak peaceably unto him,"
    },
    {
      "id": 53,
      "start": 188.0,
      "end": 192.0,
      "text": " they were gone, and they were taking care of the flock."
    },
    {
      "id": 54,
      "start": 192.0,
      "end": 197.0,
      "text": " And he's there, and his father's there, and there's a fellowship that's taking place."
    },
    {
      "id": 55,
      "start": 197.0,
      "end": 200.0,
      "text": " And we find that according to our text of Scripture,"
    },
    {
      "id": 56,
      "start": 200.0,
      "end": 203.0,
      "text": " that Israel's dad comes and speaks to Joseph."
    },
    {
      "id": 57,
      "start": 203.0,
      "end": 206.0,
      "text": " Notice the Bible tells us in verse number 13,"
    },
    {
      "id": 58,
      "start": 206.0,
      "end": 208.0,
      "text": " And Israel said unto Joseph,"
    },
    {
      "id": 59,
      "start": 208.0,
      "end": 211.0,
      "text": " Do not by brethren feed the flock in Shechem."
    },
    {
      "id": 60,
      "start": 211.0,
      "end": 214.0,
      "text": " Come, and I will send thee unto them."
    },
    {
      "id": 61,
      "start": 214.0,
      "end": 217.0,
      "text": " And he said to him, Here am I."
    },
    {
      "id": 62,
      "start": 217.0,
      "end": 220.0,
      "text": " And he, that's Jacob, said to him, Joseph,"
    },
    {
      "id": 63,
      "start": 220.0,
      "end": 225.0,
      "text": " Go, I pray thee, see whether it be well with thy brethren,"
    },
    {
      "id": 64,
      "start": 225.0,
      "end": 228.0,
      "text": " and well with the flocks, and bring me word again."
    },
    {
      "id": 65,
      "start": 228.0,
      "end": 231.0,
      "text": " So he sent him out of the vale of Hebron,"
    },
    {
      "id": 66,
      "start": 231.0,
      "end": 234.0,
      "text": " and he came to Shechem."
    },
    {
      "id": 67,
      "start": 234.0,
      "end": 236.0,
      "text": " Verse 15 says, A certain man found him,"
    },
    {
      "id": 68,
      "start": 236.0,
      "end": 240.0,
      "text": " and, behold, he, Joseph, he was wandering in the field."
    },
    {
      "id": 69,
      "start": 240.0,
      "end": 243.0,
      "text": " The man asked him, saying, What seekest thou?"
    },
    {
      "id": 70,
      "start": 243.0,
      "end": 245.0,
      "text": " He said, I seek my brethren."
    },
    {
      "id": 71,
      "start": 245.0,
      "end": 248.0,
      "text": " Tell me, I pray thee, where they feed their flocks."
    },
    {
      "id": 72,
      "start": 248.0,
      "end": 250.0,
      "text": " The man said, They are departed hence,"
    },
    {
      "id": 73,
      "start": 250.0,
      "end": 252.0,
      "text": " for I heard them say, Let us go to Dothan."
    },
    {
      "id": 74,
      "start": 252.0,
      "end": 254.0,
      "text": " And Joseph went after his brethren,"
    },
    {
      "id": 75,
      "start": 254.0,
      "end": 257.0,
      "text": " and found them in Dothan."
    },
    {
      "id": 76,
      "start": 257.0,
      "end": 259.0,
      "text": " So we look at the passage of Scripture this evening,"
    },
    {
      "id": 77,
      "start": 259.0,
      "end": 261.0,
      "text": " and we'll go down through verse number 30."
    },
    {
      "id": 78,
      "start": 261.0,
      "end": 263.0,
      "text": " In fact, we'll even make mention of verse 36."
    },
    {
      "id": 79,
      "start": 263.0,
      "end": 265.0,
      "text": " But I want you to notice this evening,"
    },
    {
      "id": 80,
      "start": 265.0,
      "end": 268.0,
      "text": " if you are taking notes, number one, the concern of Jacob."
    },
    {
      "id": 81,
      "start": 268.0,
      "end": 270.0,
      "text": " We find that in verses 12 through 17,"
    },
    {
      "id": 82,
      "start": 270.0,
      "end": 272.0,
      "text": " we read of Joseph's departure,"
    },
    {
      "id": 83,
      "start": 272.0,
      "end": 274.0,
      "text": " but we find that the real reason"
    },
    {
      "id": 84,
      "start": 274.0,
      "end": 276.0,
      "text": " that Joseph is sent on this task"
    },
    {
      "id": 85,
      "start": 276.0,
      "end": 279.0,
      "text": " is because of the concern that Jacob has."
    },
    {
      "id": 86,
      "start": 279.0,
      "end": 282.0,
      "text": " Now, the source of the concern,"
    },
    {
      "id": 87,
      "start": 282.0,
      "end": 285.0,
      "text": " the reason that Jacob has this concern,"
    },
    {
      "id": 88,
      "start": 285.0,
      "end": 288.0,
      "text": " is certainly open to our understanding,"
    },
    {
      "id": 89,
      "start": 288.0,
      "end": 290.0,
      "text": " debating, if you will."
    },
    {
      "id": 90,
      "start": 290.0,
      "end": 292.0,
      "text": " I believe that there's at least two very prominent reasons"
    },
    {
      "id": 91,
      "start": 292.0,
      "end": 294.0,
      "text": " that could lead to Jacob being concerned."
    },
    {
      "id": 92,
      "start": 294.0,
      "end": 298.0,
      "text": " One could be that their expected return date had been missed."
    },
    {
      "id": 93,
      "start": 298.0,
      "end": 300.0,
      "text": " And they were gone longer"
    },
    {
      "id": 94,
      "start": 300.0,
      "end": 303.0,
      "text": " than they were expected to be away for,"
    },
    {
      "id": 95,
      "start": 303.0,
      "end": 306.0,
      "text": " and that could be reason for Jacob to be concerned."
    },
    {
      "id": 96,
      "start": 306.0,
      "end": 310.0,
      "text": " They do not have technology in this time like we have today."
    },
    {
      "id": 97,
      "start": 310.0,
      "end": 313.0,
      "text": " Some of us today were able to just send a quick note"
    },
    {
      "id": 98,
      "start": 313.0,
      "end": 315.0,
      "text": " and find out, hey, what's going on, and we get a delay."
    },
    {
      "id": 99,
      "start": 315.0,
      "end": 318.0,
      "text": " You know, hey, I got caught up with this, that, or the other,"
    },
    {
      "id": 100,
      "start": 318.0,
      "end": 320.0,
      "text": " and it's going to be a little bit of time."
    },
    {
      "id": 101,
      "start": 320.0,
      "end": 322.0,
      "text": " But do you remember back in the day, like, you know,"
    },
    {
      "id": 102,
      "start": 322.0,
      "end": 324.0,
      "text": " 20 years ago when you didn't have that technology,"
    },
    {
      "id": 103,
      "start": 324.0,
      "end": 326.0,
      "text": " and people would be standing at the door"
    },
    {
      "id": 104,
      "start": 326.0,
      "end": 328.0,
      "text": " waiting for a loved one that was traveling"
    },
    {
      "id": 105,
      "start": 328.0,
      "end": 332.0,
      "text": " and just anxiously waiting for their arrival?"
    },
    {
      "id": 106,
      "start": 332.0,
      "end": 334.0,
      "text": " I remember as a child when we would travel"
    },
    {
      "id": 107,
      "start": 334.0,
      "end": 336.0,
      "text": " from North Carolina up to New Jersey"
    },
    {
      "id": 108,
      "start": 336.0,
      "end": 338.0,
      "text": " to visit with my grandparents,"
    },
    {
      "id": 109,
      "start": 338.0,
      "end": 340.0,
      "text": " and I remember my grandparents waiting anxiously"
    },
    {
      "id": 110,
      "start": 340.0,
      "end": 343.0,
      "text": " and patiently, my grandfather at least,"
    },
    {
      "id": 111,
      "start": 343.0,
      "end": 348.0,
      "text": " by anxiously awaiting the arrival of our family."
    },
    {
      "id": 112,
      "start": 348.0,
      "end": 350.0,
      "text": " And some of you can relate to that and you can understand."
    },
    {
      "id": 113,
      "start": 350.0,
      "end": 352.0,
      "text": " And so Jacob has a measure of concern."
    },
    {
      "id": 114,
      "start": 352.0,
      "end": 354.0,
      "text": " Maybe it's because the boys have not returned"
    },
    {
      "id": 115,
      "start": 354.0,
      "end": 356.0,
      "text": " at the appointed time."
    },
    {
      "id": 116,
      "start": 356.0,
      "end": 358.0,
      "text": " I believe that another reason that would lead Jacob"
    },
    {
      "id": 117,
      "start": 358.0,
      "end": 361.0,
      "text": " to being concerned, thus sending Joseph,"
    },
    {
      "id": 118,
      "start": 361.0,
      "end": 363.0,
      "text": " is because he understood,"
    },
    {
      "id": 119,
      "start": 363.0,
      "end": 367.0,
      "text": " he was aware of the behavior of his boys."
    },
    {
      "id": 120,
      "start": 367.0,
      "end": 372.0,
      "text": " And certainly these boys could get themselves in trouble."
    },
    {
      "id": 121,
      "start": 372.0,
      "end": 374.0,
      "text": " And he was aware of their behavior,"
    },
    {
      "id": 122,
      "start": 374.0,
      "end": 377.0,
      "text": " he was aware of how they acted and what they did,"
    },
    {
      "id": 123,
      "start": 377.0,
      "end": 381.0,
      "text": " and perhaps it was a situation where Jacob was concerned"
    },
    {
      "id": 124,
      "start": 381.0,
      "end": 383.0,
      "text": " about the boys because,"
    },
    {
      "id": 125,
      "start": 383.0,
      "end": 386.0,
      "text": " I'm not sure what their behavior may have led to,"
    },
    {
      "id": 126,
      "start": 386.0,
      "end": 390.0,
      "text": " what kind of trouble they might be in."
    },
    {
      "id": 127,
      "start": 390.0,
      "end": 391.0,
      "text": " And so we find that Jacob,"
    },
    {
      "id": 128,
      "start": 391.0,
      "end": 393.0,
      "text": " and whether you have other ideas"
    },
    {
      "id": 129,
      "start": 393.0,
      "end": 395.0,
      "text": " as to why it is that he's concerned,"
    },
    {
      "id": 130,
      "start": 395.0,
      "end": 399.0,
      "text": " but we know that the Bible says that he calls Joseph to him"
    },
    {
      "id": 131,
      "start": 399.0,
      "end": 401.0,
      "text": " and he says in verse 13,"
    },
    {
      "id": 132,
      "start": 401.0,
      "end": 404.0,
      "text": " come and I will send thee unto them."
    },
    {
      "id": 133,
      "start": 404.0,
      "end": 406.0,
      "text": " And he said to him, here am I."
    },
    {
      "id": 134,
      "start": 406.0,
      "end": 408.0,
      "text": " And so when I think about the concern of Jacob,"
    },
    {
      "id": 135,
      "start": 408.0,
      "end": 410.0,
      "text": " we see in the text of scripture"
    },
    {
      "id": 136,
      "start": 410.0,
      "end": 413.0,
      "text": " that this concern on the part of Jacob"
    },
    {
      "id": 137,
      "start": 413.0,
      "end": 417.0,
      "text": " leads to a mission for Joseph."
    },
    {
      "id": 138,
      "start": 417.0,
      "end": 422.0,
      "text": " This concern of Jacob leads to a mission for Joseph."
    },
    {
      "id": 139,
      "start": 422.0,
      "end": 423.0,
      "text": " And I want you to notice,"
    },
    {
      "id": 140,
      "start": 423.0,
      "end": 426.0,
      "text": " as we see the response of Joseph,"
    },
    {
      "id": 141,
      "start": 426.0,
      "end": 428.0,
      "text": " the Bible says at the end of verse number 13,"
    },
    {
      "id": 142,
      "start": 428.0,
      "end": 432.0,
      "text": " that he simply responds by saying, here am I."
    },
    {
      "id": 143,
      "start": 432.0,
      "end": 434.0,
      "text": " Here am I."
    },
    {
      "id": 144,
      "start": 434.0,
      "end": 439.0,
      "text": " Now we notice that Joseph understands"
    },
    {
      "id": 145,
      "start": 439.0,
      "end": 443.0,
      "text": " what Jacob is going to send him to do."
    },
    {
      "id": 146,
      "start": 443.0,
      "end": 446.0,
      "text": " The very boys that cannot speak peaceably unto him,"
    },
    {
      "id": 147,
      "start": 446.0,
      "end": 448.0,
      "text": " the brothers that hate him,"
    },
    {
      "id": 148,
      "start": 448.0,
      "end": 453.0,
      "text": " Joseph is being given this assignment from his father"
    },
    {
      "id": 149,
      "start": 453.0,
      "end": 456.0,
      "text": " to go and to check on them."
    },
    {
      "id": 150,
      "start": 456.0,
      "end": 460.0,
      "text": " The Bible tells us, again, remember he was in Hebron."
    },
    {
      "id": 151,
      "start": 460.0,
      "end": 463.0,
      "text": " He's there having fellowship with his father."
    },
    {
      "id": 152,
      "start": 463.0,
      "end": 466.0,
      "text": " The brothers are not there."
    },
    {
      "id": 153,
      "start": 466.0,
      "end": 470.0,
      "text": " There's a measure of peace and maybe safety, if you will."
    },
    {
      "id": 154,
      "start": 470.0,
      "end": 472.0,
      "text": " And he says, here am I."
    },
    {
      "id": 155,
      "start": 472.0,
      "end": 474.0,
      "text": " And here's what Jacob says to him in verse 14."
    },
    {
      "id": 156,
      "start": 474.0,
      "end": 477.0,
      "text": " Go, I pray thee, see whether it be well with thy brethren"
    },
    {
      "id": 157,
      "start": 477.0,
      "end": 480.0,
      "text": " and well with the flocks and bring me word again."
    },
    {
      "id": 158,
      "start": 480.0,
      "end": 482.0,
      "text": " So he sent him out of the vale of Hebron"
    },
    {
      "id": 159,
      "start": 482.0,
      "end": 484.0,
      "text": " and he came to Shechem."
    },
    {
      "id": 160,
      "start": 484.0,
      "end": 487.0,
      "text": " And I want you to think about this passage of Scripture"
    },
    {
      "id": 161,
      "start": 487.0,
      "end": 489.0,
      "text": " from the perspective we see the concern,"
    },
    {
      "id": 162,
      "start": 489.0,
      "end": 493.0,
      "text": " but as we know the mission that's been assigned to Joseph"
    },
    {
      "id": 163,
      "start": 493.0,
      "end": 498.0,
      "text": " and we know that his response is one that is immediate."
    },
    {
      "id": 164,
      "start": 498.0,
      "end": 503.0,
      "text": " He immediately responds in obedience to the command,"
    },
    {
      "id": 165,
      "start": 503.0,
      "end": 505.0,
      "text": " to the mission that's been given to him."
    },
    {
      "id": 166,
      "start": 505.0,
      "end": 509.0,
      "text": " This particular response is not only immediate,"
    },
    {
      "id": 167,
      "start": 509.0,
      "end": 511.0,
      "text": " but it's complete."
    },
    {
      "id": 168,
      "start": 511.0,
      "end": 513.0,
      "text": " I want you to notice that in verse number 15,"
    },
    {
      "id": 169,
      "start": 513.0,
      "end": 515.0,
      "text": " the Bible says that a certain man found him"
    },
    {
      "id": 170,
      "start": 515.0,
      "end": 519.0,
      "text": " and behold, he was wandering in the field."
    },
    {
      "id": 171,
      "start": 519.0,
      "end": 520.0,
      "text": " And so what happens?"
    },
    {
      "id": 172,
      "start": 520.0,
      "end": 523.0,
      "text": " Well, he goes, he's leaving as he was assigned to do so."
    },
    {
      "id": 173,
      "start": 523.0,
      "end": 525.0,
      "text": " He's told to go to Shechem."
    },
    {
      "id": 174,
      "start": 525.0,
      "end": 529.0,
      "text": " Now Shechem is about a 60-mile journey from where he is."
    },
    {
      "id": 175,
      "start": 529.0,
      "end": 531.0,
      "text": " Now again, I mentioned this morning about the journey of Elijah"
    },
    {
      "id": 176,
      "start": 531.0,
      "end": 535.0,
      "text": " being a hundred miles or so from Cherith over to Zarephath."
    },
    {
      "id": 177,
      "start": 535.0,
      "end": 537.0,
      "text": " And you think about a 60-mile journey,"
    },
    {
      "id": 178,
      "start": 537.0,
      "end": 540.0,
      "text": " again, much more complicated than a 60-mile journey"
    },
    {
      "id": 179,
      "start": 540.0,
      "end": 541.0,
      "text": " for us today."
    },
    {
      "id": 180,
      "start": 541.0,
      "end": 544.0,
      "text": " We think about the 60-mile journey that he'd go on"
    },
    {
      "id": 181,
      "start": 544.0,
      "end": 545.0,
      "text": " and you think about some of the dangers"
    },
    {
      "id": 182,
      "start": 545.0,
      "end": 546.0,
      "text": " and so on and so forth."
    },
    {
      "id": 183,
      "start": 546.0,
      "end": 549.0,
      "text": " In fact, even as you would think about the story"
    },
    {
      "id": 184,
      "start": 549.0,
      "end": 551.0,
      "text": " that the brothers give to dad"
    },
    {
      "id": 185,
      "start": 551.0,
      "end": 555.0,
      "text": " about the supposed demise of Joseph"
    },
    {
      "id": 186,
      "start": 555.0,
      "end": 556.0,
      "text": " and it's being believable,"
    },
    {
      "id": 187,
      "start": 556.0,
      "end": 559.0,
      "text": " the fact of the matter is that this was potentially"
    },
    {
      "id": 188,
      "start": 559.0,
      "end": 564.0,
      "text": " some dangerous territory to travel."
    },
    {
      "id": 189,
      "start": 564.0,
      "end": 566.0,
      "text": " We find that the Bible says that he's wandering in the field."
    },
    {
      "id": 190,
      "start": 566.0,
      "end": 567.0,
      "text": " So what's he doing?"
    },
    {
      "id": 191,
      "start": 567.0,
      "end": 568.0,
      "text": " He doesn't find them."
    },
    {
      "id": 192,
      "start": 568.0,
      "end": 569.0,
      "text": " They're not there."
    },
    {
      "id": 193,
      "start": 569.0,
      "end": 570.0,
      "text": " They're not in Shechem,"
    },
    {
      "id": 194,
      "start": 570.0,
      "end": 574.0,
      "text": " the place where Jacob thought they would be."
    },
    {
      "id": 195,
      "start": 574.0,
      "end": 576.0,
      "text": " He didn't just turn around and go home."
    },
    {
      "id": 196,
      "start": 576.0,
      "end": 578.0,
      "text": " This wasn't a half-hearted effort."
    },
    {
      "id": 197,
      "start": 578.0,
      "end": 582.0,
      "text": " This wasn't a matter of obedience of checking the box,"
    },
    {
      "id": 198,
      "start": 582.0,
      "end": 585.0,
      "text": " like, okay, well, I went and I just couldn't find them."
    },
    {
      "id": 199,
      "start": 585.0,
      "end": 586.0,
      "text": " Right?"
    },
    {
      "id": 200,
      "start": 586.0,
      "end": 588.0,
      "text": " You ever tell your kids to clean the room?"
    },
    {
      "id": 201,
      "start": 588.0,
      "end": 589.0,
      "text": " They come back and they say,"
    },
    {
      "id": 202,
      "start": 589.0,
      "end": 590.0,
      "text": " clean the room!"
    },
    {
      "id": 203,
      "start": 590.0,
      "end": 593.0,
      "text": " Like, there's no way you cleaned your room that fast."
    },
    {
      "id": 204,
      "start": 593.0,
      "end": 594.0,
      "text": " It's just not possible."
    },
    {
      "id": 205,
      "start": 594.0,
      "end": 595.0,
      "text": " Right?"
    },
    {
      "id": 206,
      "start": 595.0,
      "end": 597.0,
      "text": " You understand what I'm saying?"
    },
    {
      "id": 207,
      "start": 597.0,
      "end": 598.0,
      "text": " And then what happens?"
    },
    {
      "id": 208,
      "start": 598.0,
      "end": 599.0,
      "text": " You go in there and you,"
    },
    {
      "id": 209,
      "start": 599.0,
      "end": 600.0,
      "text": " don't open the closet!"
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 606.2399997711182,
      "text": " closet, right? Don't look under the bed. Why? Because it's not a full job. See, I see in"
    },
    {
      "id": 1,
      "start": 606.2399997711182,
      "end": 614.039999961853,
      "text": " Joseph here that even though the task that was assigned would be a task that personally,"
    },
    {
      "id": 2,
      "start": 614.039999961853,
      "end": 617.920000076294,
      "text": " and I think if you'd be honest this evening, that you wouldn't want to do this. Why would"
    },
    {
      "id": 3,
      "start": 617.920000076294,
      "end": 623.1599998474121,
      "text": " you want to go find the boys, your brothers, that hate you, that want to kill you, that"
    },
    {
      "id": 4,
      "start": 623.1599998474121,
      "end": 632.6800003051758,
      "text": " can't speak peaceably unto you. But Joseph goes. He's obedient. He finds as he's wandering"
    },
    {
      "id": 5,
      "start": 632.6800003051758,
      "end": 636.9599990844727,
      "text": " there that there's some man that asks him saying, what seekest thou? He said, I seek"
    },
    {
      "id": 6,
      "start": 636.9599990844727,
      "end": 641.1199989318848,
      "text": " my brethren. Tell me, I pray thee, where they feed the flock. And the Bible tells us that"
    },
    {
      "id": 7,
      "start": 641.1199989318848,
      "end": 645.8800010681152,
      "text": " the man replied and said that they've departed from hence. And I heard them say, let us go"
    },
    {
      "id": 8,
      "start": 645.8800010681152,
      "end": 650.7599983215332,
      "text": " to Dothan. And Joseph went after his brethren and found them in Dothan. That's an additional"
    },
    {
      "id": 9,
      "start": 650.7599983215332,
      "end": 658.4799995422363,
      "text": " twelve mile journey. Seventy-two miles. It's a long journey. And Joseph takes this journey"
    },
    {
      "id": 10,
      "start": 658.4799995422363,
      "end": 666.3600006103516,
      "text": " and he responds to the mission that was assigned again. The concern of Jacob led to a mission"
    },
    {
      "id": 11,
      "start": 666.3600006103516,
      "end": 671.9199981689453,
      "text": " for Joseph. And we understand the physical nature of the relationship between Joseph"
    },
    {
      "id": 12,
      "start": 671.9199981689453,
      "end": 677.5999984741211,
      "text": " and Jacob and his brothers. And we understand what's taking place here contextually, historically."
    },
    {
      "id": 13,
      "start": 677.5999984741211,
      "end": 682.120002746582,
      "text": " And I want you to think this evening, if we could make spiritual application here,"
    },
    {
      "id": 14,
      "start": 682.120002746582,
      "end": 688.2200012207031,
      "text": " I wonder how it is that we respond to our Father when He gives us a mission. When God"
    },
    {
      "id": 15,
      "start": 688.2200012207031,
      "end": 696.1999969482422,
      "text": " gives us a task to do, when God gives us a mission, how do we respond? Do we respond"
    },
    {
      "id": 16,
      "start": 696.1999969482422,
      "end": 703.4000015258789,
      "text": " in obedience? Do we respond immediately? Do we, do we do it wholeheartedly? Do we do it"
    },
    {
      "id": 17,
      "start": 703.4000015258789,
      "end": 711.8399963378906,
      "text": " to the, to the manner in which we ought to do it as far as all in, a hundred percent?"
    },
    {
      "id": 18,
      "start": 711.8399963378906,
      "end": 717.3199996948242,
      "text": " Do you understand what I'm saying? Not just a, oh yeah, I did that, and it'd just be a"
    },
    {
      "id": 19,
      "start": 717.3199996948242,
      "end": 724.8399963378906,
      "text": " half-hearted type of effort. We find in the text of Scripture that, yes, this is an account"
    },
    {
      "id": 20,
      "start": 724.8399963378906,
      "end": 729.0599975585938,
      "text": " that's provided to us that's in a historical account, but we find that there's, the Bible's"
    },
    {
      "id": 21,
      "start": 729.0599975585938,
      "end": 733.9199981689453,
      "text": " been given to us and we obviously can take application. And I think about the response"
    },
    {
      "id": 22,
      "start": 733.9199981689453,
      "end": 739.3000030517578,
      "text": " of Joseph here in verse 13 when he says, here am I. Hold your place here in terms of Isaiah,"
    },
    {
      "id": 23,
      "start": 739.3000030517578,
      "end": 743.1799926757812,
      "text": " and I know that you're familiar with Isaiah, but I want you to read it with me in Isaiah"
    },
    {
      "id": 24,
      "start": 743.1799926757812,
      "end": 748.8200073242188,
      "text": " chapter number six this evening. And I want you to consider that this account that is"
    },
    {
      "id": 25,
      "start": 748.8200073242188,
      "end": 753.6999969482422,
      "text": " given to us in the book of Isaiah, of the call of Isaiah, the commission of Isaiah."
    },
    {
      "id": 26,
      "start": 753.6999969482422,
      "end": 759.8200073242188,
      "text": " Now remember, Joseph says, here am I. And we find that as we come to the book of Isaiah"
    },
    {
      "id": 27,
      "start": 759.8200073242188,
      "end": 766.4600067138672,
      "text": " in the sixth chapter, that it's the year that King Uzziah died, and Isaiah says that he"
    },
    {
      "id": 28,
      "start": 766.4600067138672,
      "end": 772.8600006103516,
      "text": " saw also the Lord sitting upon a throne high and lifted up, and his train filled the temple."
    },
    {
      "id": 29,
      "start": 772.8600006103516,
      "end": 777.6999969482422,
      "text": " What a sight Isaiah six provides us with into the throne room of heaven. We find that he"
    },
    {
      "id": 30,
      "start": 777.6999969482422,
      "end": 784.8200073242188,
      "text": " hears the angel singing, holy, holy, holy, and we notice all that's taking place, and"
    },
    {
      "id": 31,
      "start": 784.8200073242188,
      "end": 789.1399993896484,
      "text": " then after the interaction, we're not taking the entire time to look at all these verses,"
    },
    {
      "id": 32,
      "start": 789.1399993896484,
      "end": 793.6999969482422,
      "text": " but I want you to notice that Isaiah hears the voice of the Lord in verse number eight,"
    },
    {
      "id": 33,
      "start": 793.6999969482422,
      "end": 797.7400054931641,
      "text": " and the voice of the Lord he hears saying, whom shall I send and who will go for us?"
    },
    {
      "id": 34,
      "start": 797.7400054931641,
      "end": 807.2200012207031,
      "text": " Then said I, what does it say? Here am I. Here am I, send me. We don't see in Genesis"
    },
    {
      "id": 35,
      "start": 807.2200012207031,
      "end": 816.1399993896484,
      "text": " 37 that Joseph says, here am I, send me, but I think it could be easily understood"
    },
    {
      "id": 36,
      "start": 816.1399993896484,
      "end": 823.5800018310547,
      "text": " that that's what he was saying. Why? Well because Jacob says, come and I will send thee"
    },
    {
      "id": 37,
      "start": 823.5800018310547,
      "end": 831.4199981689453,
      "text": " unto them. And Joseph says, here am I. You know that reveals to me a complete submission"
    },
    {
      "id": 38,
      "start": 831.4199981689453,
      "end": 838.2200012207031,
      "text": " to his father. It's a complete submission to his father. Now I understand historical"
    },
    {
      "id": 39,
      "start": 838.2200012207031,
      "end": 842.2599945068359,
      "text": " context. I understand what's taking place, and we could talk about relationships and"
    },
    {
      "id": 40,
      "start": 842.2599945068359,
      "end": 847.3800048828125,
      "text": " what have you, but I want to make the spiritual application this evening, and I wonder this"
    },
    {
      "id": 41,
      "start": 847.3800048828125,
      "end": 853.5399932861328,
      "text": " evening do we have that complete submission to our heavenly father? That when our heavenly"
    },
    {
      "id": 42,
      "start": 853.5399932861328,
      "end": 863.4200134277344,
      "text": " father gives us a task, a mission, that it is met with immediate obedience, here am I."
    },
    {
      "id": 43,
      "start": 863.4200134277344,
      "end": 872.739990234375,
      "text": " I'll go. I'll do. I'll say. I'll be. Here am I. Complete submission. Complete surrender."
    },
    {
      "id": 44,
      "start": 872.739990234375,
      "end": 878.3399963378906,
      "text": " That's a good place to be in our lives. So often in our lives if we're not careful, we're"
    },
    {
      "id": 45,
      "start": 878.8599853515625,
      "end": 885.6199951171875,
      "text": " going to hold certain parts back for us. And we think that we can manage this part or manage"
    },
    {
      "id": 46,
      "start": 885.6199951171875,
      "end": 891.7799987792969,
      "text": " that part and we can, no, no, no. We learn in life it's so much better if we just let"
    },
    {
      "id": 47,
      "start": 891.7799987792969,
      "end": 899.0199890136719,
      "text": " God have His way. We live in that condition of absolute surrender. And here in our text"
    },
    {
      "id": 48,
      "start": 899.0199890136719,
      "end": 906.6600036621094,
      "text": " of Scripture, I do not want us to miss it this evening that Joseph was completely submitted"
    },
    {
      "id": 49,
      "start": 906.6600036621094,
      "end": 912.4599914550781,
      "text": " and surrendered to his father. And by way of spiritual application this evening, I hope"
    },
    {
      "id": 50,
      "start": 912.4599914550781,
      "end": 918.260009765625,
      "text": " that each and every one of us could say, it's a personal evaluation that we need to make."
    },
    {
      "id": 51,
      "start": 918.260009765625,
      "end": 926.7000122070312,
      "text": " Am I completely surrendered and submitted to the will of my father? If I say that I"
    },
    {
      "id": 52,
      "start": 926.7000122070312,
      "end": 933.3399963378906,
      "text": " am, I don't know where he's going to send me. It's okay, because he'll be with you and"
    },
    {
      "id": 53,
      "start": 933.3399963378906,
      "end": 940.739990234375,
      "text": " he'll use you. And it will be worth it. Back to the historical account, as we continue"
    },
    {
      "id": 54,
      "start": 940.739990234375,
      "end": 945.6600036621094,
      "text": " in our text of Scripture, we begin looking through, beginning in verse number 18 there,"
    },
    {
      "id": 55,
      "start": 945.6600036621094,
      "end": 948.8200073242188,
      "text": " we see number two, if you're taking notes, not only the concern of Jacob, but number"
    },
    {
      "id": 56,
      "start": 948.8200073242188,
      "end": 953.2999877929688,
      "text": " two, we see the conspiracy of the brothers, the conspiracy of the brothers. Notice the"
    },
    {
      "id": 57,
      "start": 953.2999877929688,
      "end": 961.4200134277344,
      "text": " Bible says, it begins in verse number 18, and when they saw him afar off, even before"
    },
    {
      "id": 58,
      "start": 961.5,
      "end": 970.9800109863281,
      "text": " he came near unto them, they conspired against him to slay him. Wow. They saw him from afar."
    },
    {
      "id": 59,
      "start": 970.9800109863281,
      "end": 976.3399963378906,
      "text": " How do you think they saw him from afar? I think that coat of many colors had a big part."
    },
    {
      "id": 60,
      "start": 976.3399963378906,
      "end": 982.4200134277344,
      "text": " And then being able to easily identify who it was that was making their way toward him,"
    },
    {
      "id": 61,
      "start": 982.4200134277344,
      "end": 987.5599975585938,
      "text": " them. We find that it was obvious that there's Joseph, he's coming over here. And I want"
    },
    {
      "id": 62,
      "start": 987.6000061035156,
      "end": 992.7999877929688,
      "text": " you to notice as you look at the text of Scripture, I want you to, in your sanctified imagination,"
    },
    {
      "id": 63,
      "start": 992.7999877929688,
      "end": 998.0,
      "text": " as you look at the passage and try to hear the tone, if you will, of the brothers, the"
    },
    {
      "id": 64,
      "start": 998.0,
      "end": 1003.6799926757812,
      "text": " Bible says that even before he came near unto them, they conspired against him to slay him."
    },
    {
      "id": 65,
      "start": 1003.6799926757812,
      "end": 1008.9599914550781,
      "text": " And notice what they say in verse number 19, they said one to another, behold, this dreamer"
    },
    {
      "id": 66,
      "start": 1009.3599853515625,
      "end": 1016.1600036621094,
      "text": " cometh. Think they're still upset about the dreams? Sure they are. Fresh on their mind."
    },
    {
      "id": 67,
      "start": 1016.1600036621094,
      "end": 1024.3999938964844,
      "text": " And the Bible says, come now therefore, and let us slay him and cast him into some pit,"
    },
    {
      "id": 68,
      "start": 1024.3999938964844,
      "end": 1031.4800109863281,
      "text": " and we will say, some evil beast hath devoured him, and we shall see what will become of his"
    },
    {
      "id": 69,
      "start": 1031.4800109863281,
      "end": 1041.0799865722656,
      "text": " dreams. I mean, can you hear the tone of the voice of the brothers? Evil. We've heard these"
    },
    {
      "id": 70,
      "start": 1041.0799865722656,
      "end": 1045.0799865722656,
      "text": " dreams, behold, this dreamer cometh. Let's see what's going to become of his dreams."
    },
    {
      "id": 71,
      "start": 1045.0799865722656,
      "end": 1054.6000061035156,
      "text": " Here's what we're going to do. We've got this plan. We see their evil hearts. The conspiracy"
    },
    {
      "id": 72,
      "start": 1054.6000061035156,
      "end": 1060.3599853515625,
      "text": " to kill him and to throw him into a pit. They even went through such lengths of developing"
    },
    {
      "id": 73,
      "start": 1060.3599853515625,
      "end": 1066.760009765625,
      "text": " a plan to cover their actions, where they say in verse number 20 that we will say, some"
    },
    {
      "id": 74,
      "start": 1066.760009765625,
      "end": 1070.9599914550781,
      "text": " evil beast hath devoured him, and we shall see what will become of his dreams. We find"
    },
    {
      "id": 75,
      "start": 1070.9599914550781,
      "end": 1075.8800048828125,
      "text": " that that's exactly what happens. They give that story to Jacob at the end of the text"
    },
    {
      "id": 76,
      "start": 1075.8800048828125,
      "end": 1080.9599914550781,
      "text": " of Scripture. We'll look at that next Sunday evening. But we find that this plan, as they"
    },
    {
      "id": 77,
      "start": 1080.9599914550781,
      "end": 1087.1600036621094,
      "text": " develop this plan, they develop a cover story. How are we going to cover this up? What are"
    },
    {
      "id": 78,
      "start": 1087.1600036621094,
      "end": 1094.8399963378906,
      "text": " we going to say? Reuben steps in. He hears of what's taking place, and he offers an alternative."
    },
    {
      "id": 79,
      "start": 1094.8399963378906,
      "end": 1098.9200134277344,
      "text": " We find that the alternative is given in verse 21. It says, And Reuben heard it, and he delivered"
    },
    {
      "id": 80,
      "start": 1098.9200134277344,
      "end": 1105.2799987792969,
      "text": " him out of their hands, and said, Let us not kill him. And Reuben said unto them, Shed"
    },
    {
      "id": 81,
      "start": 1105.2799987792969,
      "end": 1110.2000122070312,
      "text": " no blood, but cast him into this pit that is in the wilderness, and lay no hand upon"
    },
    {
      "id": 82,
      "start": 1110.2000122070312,
      "end": 1115.6799926757812,
      "text": " him, that ye might rid him out of their hands, to deliver him to his father again. So he"
    },
    {
      "id": 83,
      "start": 1115.6799926757812,
      "end": 1122.3599853515625,
      "text": " didn't really stand up to his brothers like he should have. He offers an alternative plan,"
    },
    {
      "id": 84,
      "start": 1122.3599853515625,
      "end": 1127.4000244140625,
      "text": " and we find that he's going to then try to come behind the scenes, if you will, and deliver"
    },
    {
      "id": 85,
      "start": 1127.4000244140625,
      "end": 1132.760009765625,
      "text": " Joseph back to his father. And it says then in verse 23, And it came to pass, when Joseph"
    },
    {
      "id": 86,
      "start": 1132.760009765625,
      "end": 1138.0,
      "text": " was coming to his brethren, he's not even to them yet. All of this is happening. I mean,"
    },
    {
      "id": 87,
      "start": 1138.0,
      "end": 1143.2000122070312,
      "text": " he's just approaching them. By the way, why did Jacob want him to go find out? He wanted"
    },
    {
      "id": 88,
      "start": 1143.2000122070312,
      "end": 1150.2000122070312,
      "text": " to bring him word again. I think Jacob wanted his sons to come back to Hebron. They had"
    },
    {
      "id": 89,
      "start": 1150.2000122070312,
      "end": 1154.719970703125,
      "text": " departed. They had left the place of association or fellowship, and he wanted the brothers"
    },
    {
      "id": 90,
      "start": 1154.719970703125,
      "end": 1160.9600219726562,
      "text": " to come back, and he sends Joseph to go. And before Joseph even enters into their presence,"
    },
    {
      "id": 91,
      "start": 1160.9600219726562,
      "end": 1168.52001953125,
      "text": " they have this plan devised on how they're going to get rid of Joseph. The Bible says"
    },
    {
      "id": 92,
      "start": 1168.52001953125,
      "end": 1174.219970703125,
      "text": " in verse 23 that they stripped Joseph out of his coat, his coat of many colors that"
    },
    {
      "id": 93,
      "start": 1174.219970703125,
      "end": 1180.2000122070312,
      "text": " was on him. They took him and cast him into a pit. The pit was empty. There was no water"
    },
    {
      "id": 94,
      "start": 1180.2000122070312,
      "end": 1185.3800048828125,
      "text": " in it. I want you to think about verse 23 and 24. Can you imagine Joseph coming? He's"
    },
    {
      "id": 95,
      "start": 1185.3800048828125,
      "end": 1193.52001953125,
      "text": " just being obedient. It was not the idea, the thought of Joseph, of, hey, dad, the brothers,"
    },
    {
      "id": 96,
      "start": 1193.52001953125,
      "end": 1196.97998046875,
      "text": " they haven't been back for a little while, and should I go and check on them? No. This"
    },
    {
      "id": 97,
      "start": 1196.97998046875,
      "end": 1200.02001953125,
      "text": " was the plan of his father. His father sent him..."
    },
    {
      "id": 0,
      "start": 1200.02001953125,
      "end": 1202.6600196361542,
      "text": " on this mission and he goes and he's there"
    },
    {
      "id": 1,
      "start": 1202.6600196361542,
      "end": 1204.5000195503235,
      "text": " and as soon as he arrives, can you imagine"
    },
    {
      "id": 2,
      "start": 1204.5000195503235,
      "end": 1206.5400195121765,
      "text": " as he's met by these boys that grab him"
    },
    {
      "id": 3,
      "start": 1206.5400195121765,
      "end": 1208.2200193405151,
      "text": " and they tear this coat off of him"
    },
    {
      "id": 4,
      "start": 1208.2200193405151,
      "end": 1210.860019683838,
      "text": " and they throw him into a pit."
    },
    {
      "id": 5,
      "start": 1210.860019683838,
      "end": 1212.3400192260742,
      "text": " Man, it's terrible."
    },
    {
      "id": 6,
      "start": 1216.5000190734863,
      "end": 1219.100019454956,
      "text": " The place where he finds his brothers is called Dothan."
    },
    {
      "id": 7,
      "start": 1219.100019454956,
      "end": 1222.1600189208984,
      "text": " It's believed that this particular city"
    },
    {
      "id": 8,
      "start": 1222.1600189208984,
      "end": 1224.9600200653076,
      "text": " was known as having two wells"
    },
    {
      "id": 9,
      "start": 1224.9600200653076,
      "end": 1226.9200191497803,
      "text": " and perhaps it's one of those wells"
    },
    {
      "id": 10,
      "start": 1226.9200191497803,
      "end": 1229.5600204467773,
      "text": " that became this pit where it's dry"
    },
    {
      "id": 11,
      "start": 1229.600019454956,
      "end": 1232.2400207519531,
      "text": " because wells sometimes dry up."
    },
    {
      "id": 12,
      "start": 1233.3000183105469,
      "end": 1235.6000213623047,
      "text": " We find that the Bible specifically tells us,"
    },
    {
      "id": 13,
      "start": 1235.6000213623047,
      "end": 1239.0000190734863,
      "text": " I want you to notice verse 24 and 25"
    },
    {
      "id": 14,
      "start": 1240.2800178527832,
      "end": 1243.360019683838,
      "text": " where they took him and they cast him into a pit."
    },
    {
      "id": 15,
      "start": 1243.360019683838,
      "end": 1246.5600204467773,
      "text": " The pit was empty, there was no water in it."
    },
    {
      "id": 16,
      "start": 1246.5600204467773,
      "end": 1247.960018157959,
      "text": " And then the very next statement says,"
    },
    {
      "id": 17,
      "start": 1247.960018157959,
      "end": 1251.460018157959,
      "text": " and they sat down to eat bread."
    },
    {
      "id": 18,
      "start": 1252.7200202941895,
      "end": 1254.5000190734863,
      "text": " Does that just baffle your mind?"
    },
    {
      "id": 19,
      "start": 1254.5000190734863,
      "end": 1259.5000190734863,
      "text": " They sat down to eat bread, their brother."
    },
    {
      "id": 20,
      "start": 1264.5000228881836,
      "end": 1268.8000183105469,
      "text": " Came on a mission in obedience to dad."
    },
    {
      "id": 21,
      "start": 1269.9400177001953,
      "end": 1273.7000198364258,
      "text": " They strip him of his clothes and they cast him in a pit."
    },
    {
      "id": 22,
      "start": 1273.7000198364258,
      "end": 1275.0000228881836,
      "text": " As they cast him in a pit,"
    },
    {
      "id": 23,
      "start": 1275.0000228881836,
      "end": 1278.8800201416016,
      "text": " they simply sit down to eat bread."
    },
    {
      "id": 24,
      "start": 1278.8800201416016,
      "end": 1281.7200164794922,
      "text": " Talk about cold hearted, cruel."
    },
    {
      "id": 25,
      "start": 1285.4600219726562,
      "end": 1287.7000198364258,
      "text": " What depravity."
    },
    {
      "id": 26,
      "start": 1289.7000198364258,
      "end": 1291.3000183105469,
      "text": " The Bible says they sat down to eat"
    },
    {
      "id": 27,
      "start": 1291.3000183105469,
      "end": 1294.52001953125,
      "text": " according to verse number 25."
    },
    {
      "id": 28,
      "start": 1294.52001953125,
      "end": 1296.7000198364258,
      "text": " And there's a final twist that is given to us"
    },
    {
      "id": 29,
      "start": 1296.7000198364258,
      "end": 1298.7200164794922,
      "text": " with regard to the conspiracy."
    },
    {
      "id": 30,
      "start": 1300.1800231933594,
      "end": 1302.140022277832,
      "text": " For they lift up their eyes and they looked"
    },
    {
      "id": 31,
      "start": 1302.140022277832,
      "end": 1304.2000198364258,
      "text": " and behold a company of the Ishmaelites"
    },
    {
      "id": 32,
      "start": 1304.2000198364258,
      "end": 1306.2200164794922,
      "text": " came from Gilead with their camels"
    },
    {
      "id": 33,
      "start": 1306.2200164794922,
      "end": 1309.140022277832,
      "text": " bearing spicery and balm and myrrh"
    },
    {
      "id": 34,
      "start": 1309.140022277832,
      "end": 1311.140022277832,
      "text": " going to carry it down to Egypt."
    },
    {
      "id": 35,
      "start": 1312.140022277832,
      "end": 1316.5400161743164,
      "text": " Judah is the second brother that's named specifically."
    },
    {
      "id": 36,
      "start": 1316.5400161743164,
      "end": 1320.140022277832,
      "text": " Reuben in verse 21, now Judah in verse 26."
    },
    {
      "id": 37,
      "start": 1320.140022277832,
      "end": 1322.2600173950195,
      "text": " Notice what he says to his brothers."
    },
    {
      "id": 38,
      "start": 1322.2600173950195,
      "end": 1324.9400177001953,
      "text": " What profit is it if we slay our brother"
    },
    {
      "id": 39,
      "start": 1324.9400177001953,
      "end": 1326.5000228881836,
      "text": " and conceal his blood?"
    },
    {
      "id": 40,
      "start": 1326.5000228881836,
      "end": 1329.4600219726562,
      "text": " Come and let us sell him to the Ishmaelites"
    },
    {
      "id": 41,
      "start": 1329.4600219726562,
      "end": 1331.780014038086,
      "text": " and let not our hand be upon him"
    },
    {
      "id": 42,
      "start": 1331.780014038086,
      "end": 1334.780014038086,
      "text": " for he is our brother in our flesh."
    },
    {
      "id": 43,
      "start": 1334.780014038086,
      "end": 1336.3800201416016,
      "text": " And his brethren were content."
    },
    {
      "id": 44,
      "start": 1337.3000183105469,
      "end": 1339.7400207519531,
      "text": " Why kill him when we can sell him?"
    },
    {
      "id": 45,
      "start": 1341.4200134277344,
      "end": 1344.9800262451172,
      "text": " Because if we kill him, we don't really get anything."
    },
    {
      "id": 46,
      "start": 1344.9800262451172,
      "end": 1348.3000183105469,
      "text": " But if we sell him, then we can make something."
    },
    {
      "id": 47,
      "start": 1349.3400268554688,
      "end": 1350.7400207519531,
      "text": " This is terrible."
    },
    {
      "id": 48,
      "start": 1354.1000213623047,
      "end": 1356.8600158691406,
      "text": " Joseph was then sold, the Bible tells us in verse 28."
    },
    {
      "id": 49,
      "start": 1356.8600158691406,
      "end": 1359.1400146484375,
      "text": " Then there passed by Midianites, merchant men"
    },
    {
      "id": 50,
      "start": 1359.1400146484375,
      "end": 1361.7000122070312,
      "text": " and they drew and lifted up Joseph out of the pit"
    },
    {
      "id": 51,
      "start": 1361.7000122070312,
      "end": 1365.7000122070312,
      "text": " and sold Joseph to the Ishmaelites for 20 pieces of silver."
    },
    {
      "id": 52,
      "start": 1366.7400207519531,
      "end": 1371.1000213623047,
      "text": " And they, the Ishmaelites, brought Joseph there to Egypt."
    },
    {
      "id": 53,
      "start": 1371.540023803711,
      "end": 1373.4600219726562,
      "text": " I want you to see what's happening"
    },
    {
      "id": 54,
      "start": 1373.4600219726562,
      "end": 1375.3000183105469,
      "text": " as you look at this text of scripture."
    },
    {
      "id": 55,
      "start": 1375.3000183105469,
      "end": 1378.5800170898438,
      "text": " And think about the price that was put on Joseph's head."
    },
    {
      "id": 56,
      "start": 1378.5800170898438,
      "end": 1380.02001953125,
      "text": " 20 pieces of silver."
    },
    {
      "id": 57,
      "start": 1380.02001953125,
      "end": 1381.6200256347656,
      "text": " How many brothers?"
    },
    {
      "id": 58,
      "start": 1381.6200256347656,
      "end": 1382.4600219726562,
      "text": " 10."
    },
    {
      "id": 59,
      "start": 1383.500015258789,
      "end": 1385.1800231933594,
      "text": " Yeah, two pieces of silver each."
    },
    {
      "id": 60,
      "start": 1386.540023803711,
      "end": 1388.540023803711,
      "text": " Two pieces of silver each."
    },
    {
      "id": 61,
      "start": 1388.540023803711,
      "end": 1390.3000183105469,
      "text": " And you know what else they got?"
    },
    {
      "id": 62,
      "start": 1390.3000183105469,
      "end": 1393.9000244140625,
      "text": " A guilty conscience for years."
    },
    {
      "id": 63,
      "start": 1393.9000244140625,
      "end": 1395.3800201416016,
      "text": " Hold your place here in Genesis 37"
    },
    {
      "id": 64,
      "start": 1395.3800201416016,
      "end": 1397.7200164794922,
      "text": " and just turn over a few pages of Genesis 42."
    },
    {
      "id": 65,
      "start": 1398.7200164794922,
      "end": 1403.52001953125,
      "text": " And I want you to see what they lived with for years."
    },
    {
      "id": 66,
      "start": 1406.1600189208984,
      "end": 1407.9200134277344,
      "text": " In Genesis chapter 42,"
    },
    {
      "id": 67,
      "start": 1409.9200134277344,
      "end": 1412.3600158691406,
      "text": " we'll get to this text of scripture in,"
    },
    {
      "id": 68,
      "start": 1412.3600158691406,
      "end": 1414.7200164794922,
      "text": " I don't know, a few months, hopefully not."
    },
    {
      "id": 69,
      "start": 1414.7200164794922,
      "end": 1416.040023803711,
      "text": " It'd be sooner than that."
    },
    {
      "id": 70,
      "start": 1416.040023803711,
      "end": 1419.4800262451172,
      "text": " But in Genesis chapter 42, it's the record"
    },
    {
      "id": 71,
      "start": 1419.4800262451172,
      "end": 1422.7000122070312,
      "text": " of the brothers first coming to Egypt because of the famine."
    },
    {
      "id": 72,
      "start": 1423.7000122070312,
      "end": 1428.6200256347656,
      "text": " We find that they encounter some difficulties"
    },
    {
      "id": 73,
      "start": 1428.6200256347656,
      "end": 1429.4600219726562,
      "text": " and what have you."
    },
    {
      "id": 74,
      "start": 1429.4600219726562,
      "end": 1431.4200134277344,
      "text": " It would seem as you look at the text of scripture,"
    },
    {
      "id": 75,
      "start": 1431.4200134277344,
      "end": 1435.3000183105469,
      "text": " there's about 20 years that had passed"
    },
    {
      "id": 76,
      "start": 1435.3000183105469,
      "end": 1437.6600189208984,
      "text": " from when he was sold, Joseph, into slavery"
    },
    {
      "id": 77,
      "start": 1437.6600189208984,
      "end": 1439.0600128173828,
      "text": " and when his brothers come."
    },
    {
      "id": 78,
      "start": 1440.3800201416016,
      "end": 1443.8600158691406,
      "text": " The Bible tells us in verse 21"
    },
    {
      "id": 79,
      "start": 1443.8600158691406,
      "end": 1446.4600219726562,
      "text": " that after they encountered some of this difficulty,"
    },
    {
      "id": 80,
      "start": 1446.4600219726562,
      "end": 1448.260025024414,
      "text": " and we won't get into all of what they dealt with."
    },
    {
      "id": 81,
      "start": 1448.260025024414,
      "end": 1450.4200134277344,
      "text": " We'll get to it as we get to this particular chapter."
    },
    {
      "id": 82,
      "start": 1450.4200134277344,
      "end": 1452.1800231933594,
      "text": " But I want to draw your attention"
    },
    {
      "id": 83,
      "start": 1452.2200164794922,
      "end": 1453.6600189208984,
      "text": " to what the Bible says in verse 21."
    },
    {
      "id": 84,
      "start": 1453.6600189208984,
      "end": 1455.9800262451172,
      "text": " And they said one to another,"
    },
    {
      "id": 85,
      "start": 1455.9800262451172,
      "end": 1459.02001953125,
      "text": " we are verily guilty concerning our brother"
    },
    {
      "id": 86,
      "start": 1459.9400329589844,
      "end": 1463.02001953125,
      "text": " in that we saw the anguish of his soul"
    },
    {
      "id": 87,
      "start": 1463.02001953125,
      "end": 1466.9400329589844,
      "text": " when he besought us and we would not hear."
    },
    {
      "id": 88,
      "start": 1466.9400329589844,
      "end": 1471.9000244140625,
      "text": " Therefore, is this distress come upon us?"
    },
    {
      "id": 89,
      "start": 1471.9000244140625,
      "end": 1475.7000122070312,
      "text": " Seems like it's about 20 years as you do the calculations"
    },
    {
      "id": 90,
      "start": 1475.7000122070312,
      "end": 1480.7000122070312,
      "text": " and follow the timeline here in the book of Genesis."
    },
    {
      "id": 91,
      "start": 1480.7000122070312,
      "end": 1482.9400329589844,
      "text": " That two pieces of silver was long gone."
    },
    {
      "id": 92,
      "start": 1484.7400207519531,
      "end": 1487.5400085449219,
      "text": " That two pieces of silver was long gone."
    },
    {
      "id": 93,
      "start": 1487.5400085449219,
      "end": 1489.02001953125,
      "text": " They had a guilty conscience."
    },
    {
      "id": 94,
      "start": 1490.3000183105469,
      "end": 1493.3000183105469,
      "text": " The hardships came and immediately,"
    },
    {
      "id": 95,
      "start": 1493.3000183105469,
      "end": 1495.9800109863281,
      "text": " you know what their immediate response was?"
    },
    {
      "id": 96,
      "start": 1495.9800109863281,
      "end": 1498.9600219726562,
      "text": " We're guilty concerning our brother."
    },
    {
      "id": 97,
      "start": 1498.9600219726562,
      "end": 1501.7400207519531,
      "text": " We're guilty concerning our brother."
    },
    {
      "id": 98,
      "start": 1501.7400207519531,
      "end": 1505.3400268554688,
      "text": " And we find here that as we look at this text of scripture"
    },
    {
      "id": 99,
      "start": 1505.3400268554688,
      "end": 1507.5000305175781,
      "text": " and we see what's taking place,"
    },
    {
      "id": 100,
      "start": 1507.5000305175781,
      "end": 1509.6600341796875,
      "text": " the Bible tells us that they say"
    },
    {
      "id": 101,
      "start": 1509.6600341796875,
      "end": 1512.3400268554688,
      "text": " that we saw the anguish of his soul"
    },
    {
      "id": 102,
      "start": 1512.3400268554688,
      "end": 1514.5800170898438,
      "text": " and he besought us and we would not hear."
    },
    {
      "id": 103,
      "start": 1514.5800170898438,
      "end": 1516.9800109863281,
      "text": " Again, the text in Genesis 37 says"
    },
    {
      "id": 104,
      "start": 1516.9800109863281,
      "end": 1520.0600280761719,
      "text": " they threw him into a pit and they sat down to eat."
    },
    {
      "id": 105,
      "start": 1525.1800231933594,
      "end": 1526.9800109863281,
      "text": " But here years later,"
    },
    {
      "id": 106,
      "start": 1528.7000122070312,
      "end": 1531.5400085449219,
      "text": " it's as if they could hear his voice"
    },
    {
      "id": 107,
      "start": 1531.5400085449219,
      "end": 1534.9400329589844,
      "text": " when he was calling out, seeing his face."
    },
    {
      "id": 108,
      "start": 1535.5800170898438,
      "end": 1539.7400207519531,
      "text": " We come back to Genesis 37."
    },
    {
      "id": 109,
      "start": 1541.0000305175781,
      "end": 1543.5800170898438,
      "text": " We see the concern, the conspiracy."
    },
    {
      "id": 110,
      "start": 1543.5800170898438,
      "end": 1547.3000183105469,
      "text": " I want you to see the confusion of Joseph, number three."
    },
    {
      "id": 111,
      "start": 1547.3000183105469,
      "end": 1549.5800170898438,
      "text": " The confusion of Joseph."
    },
    {
      "id": 112,
      "start": 1549.5800170898438,
      "end": 1551.0600280761719,
      "text": " The Bible tells us in verse 28"
    },
    {
      "id": 113,
      "start": 1551.0600280761719,
      "end": 1555.1400146484375,
      "text": " that he sold for 20 pieces of silver."
    },
    {
      "id": 114,
      "start": 1555.1400146484375,
      "end": 1557.5800170898438,
      "text": " Reuben then returns according to verse number 29"
    },
    {
      "id": 115,
      "start": 1557.5800170898438,
      "end": 1560.1800231933594,
      "text": " and the Bible says that he returned to the pit"
    },
    {
      "id": 116,
      "start": 1560.1800231933594,
      "end": 1561.780029296875,
      "text": " and behold, Joseph was not in the pit"
    },
    {
      "id": 117,
      "start": 1561.780029296875,
      "end": 1563.9000244140625,
      "text": " and he rent his clothes and returned unto his brethren"
    },
    {
      "id": 118,
      "start": 1563.9000244140625,
      "end": 1566.7400207519531,
      "text": " and said, the child is not nigh, whither shall I go?"
    },
    {
      "id": 119,
      "start": 1566.7400207519531,
      "end": 1568.9800109863281,
      "text": " I don't know, the Bible doesn't tell us"
    },
    {
      "id": 120,
      "start": 1568.9800109863281,
      "end": 1571.260009765625,
      "text": " where Reuben went during this transaction"
    },
    {
      "id": 121,
      "start": 1571.260009765625,
      "end": 1575.7400207519531,
      "text": " that took place when they sold Joseph into slavery."
    },
    {
      "id": 122,
      "start": 1575.7400207519531,
      "end": 1577.8600158691406,
      "text": " But the Bible tells us that Midianites sold him"
    },
    {
      "id": 123,
      "start": 1577.8600158691406,
      "end": 1580.7400207519531,
      "text": " into Egypt unto Potiphar, an officer of Pharaoh's"
    },
    {
      "id": 124,
      "start": 1580.7400207519531,
      "end": 1584.4600219726562,
      "text": " in verse number 36 and captain of the guard."
    },
    {
      "id": 125,
      "start": 1584.4600219726562,
      "end": 1588.4200134277344,
      "text": " Joseph is now on his way to Egypt as a slave."
    },
    {
      "id": 126,
      "start": 1589.6200256347656,
      "end": 1593.4000244140625,
      "text": " We find that as the mission began,"
    },
    {
      "id": 127,
      "start": 1594.2400207519531,
      "end": 1596.3600158691406,
      "text": " as the instruction was given from Jacob,"
    },
    {
      "id": 128,
      "start": 1596.3600158691406,
      "end": 1598.8400268554688,
      "text": " notice it says in verse number 14,"
    },
    {
      "id": 129,
      "start": 1599.760009765625,
      "end": 1601.4000244140625,
      "text": " he said to him, go, I pray thee,"
    },
    {
      "id": 130,
      "start": 1601.4000244140625,
      "end": 1603.8400268554688,
      "text": " see whether it be well with thy brethren and with thy flock"
    },
    {
      "id": 131,
      "start": 1603.8400268554688,
      "end": 1607.1200256347656,
      "text": " and notice where he says, and bring me word again."
    },
    {
      "id": 132,
      "start": 1608.4000244140625,
      "end": 1610.3200073242188,
      "text": " You know, I think Jacob had the expectation"
    },
    {
      "id": 133,
      "start": 1610.3200073242188,
      "end": 1611.780029296875,
      "text": " that Joseph was gonna return."
    },
    {
      "id": 134,
      "start": 1612.8800048828125,
      "end": 1616.7200317382812,
      "text": " I think Joseph had the expectation that he's gonna return."
    },
    {
      "id": 135,
      "start": 1617.6400146484375,
      "end": 1621.280029296875,
      "text": " But now here is Joseph after being sold into slavery,"
    },
    {
      "id": 136,
      "start": 1621.280029296875,
      "end": 1623.6400146484375,
      "text": " after all that he's experienced, being in the pit"
    },
    {
      "id": 137,
      "start": 1623.6400146484375,
      "end": 1625.2400207519531,
      "text": " and then taken out, the brother saying,"
    },
    {
      "id": 138,
      "start": 1625.2400207519531,
      "end": 1626.4400329589844,
      "text": " hey, listen, he's our brother."
    },
    {
      "id": 139,
      "start": 1626.4400329589844,
      "end": 1629.4400329589844,
      "text": " Can you imagine hearing your brother say?"
    },
    {
      "id": 140,
      "start": 1629.4400329589844,
      "end": 1630.5600280761719,
      "text": " He's our brother."
    },
    {
      "id": 141,
      "start": 1630.5600280761719,
      "end": 1633.3000183105469,
      "text": " Well, I mean, what good does it do if we kill him?"
    },
    {
      "id": 142,
      "start": 1633.3000183105469,
      "end": 1635.760009765625,
      "text": " Let's just go ahead and sell him into slavery."
    },
    {
      "id": 143,
      "start": 1639.1200256347656,
      "end": 1641.2200317382812,
      "text": " I think there's gotta be confusion."
    },
    {
      "id": 144,
      "start": 1641.2200317382812,
      "end": 1644.1200256347656,
      "text": " The part of Joseph is he's traveling now"
    },
    {
      "id": 145,
      "start": 1644.1200256347656,
      "end": 1649.1200256347656,
      "text": " this long, dreary road to Egypt as a slave."
    },
    {
      "id": 146,
      "start": 1649.9800109863281,
      "end": 1654.9800109863281,
      "text": " I wonder this evening what questions might flood your mind"
    },
    {
      "id": 147,
      "start": 1655.4400329589844,
      "end": 1658.1200256347656,
      "text": " given the circumstances of Genesis 37."
    },
    {
      "id": 148,
      "start": 1659.8000183105469,
      "end": 1661.8400268554688,
      "text": " What kind of questions will we ask?"
    },
    {
      "id": 149,
      "start": 1661.8400268554688,
      "end": 1664.4000244140625,
      "text": " Would we ask, why is this happening?"
    },
    {
      "id": 150,
      "start": 1666.1200256347656,
      "end": 1667.3200073242188,
      "text": " Probably some of us would."
    },
    {
      "id": 151,
      "start": 1667.3200073242188,
      "end": 1668.4400329589844,
      "text": " If we'd be honest tonight,"
    },
    {
      "id": 152,
      "start": 1668.4400329589844,
      "end": 1671.4000244140625,
      "text": " some of us would probably say, why is this happening?"
    },
    {
      "id": 153,
      "start": 1672.6400146484375,
      "end": 1675.3600158691406,
      "text": " Maybe some of us would ask this question,"
    },
    {
      "id": 154,
      "start": 1675.3600158691406,
      "end": 1677.3600158691406,
      "text": " what's gonna happen when I get to Egypt?"
    },
    {
      "id": 155,
      "start": 1678.280029296875,
      "end": 1679.8800048828125,
      "text": " I didn't know anybody in Egypt."
    },
    {
      "id": 156,
      "start": 1681.2000122070312,
      "end": 1683.8400268554688,
      "text": " Different land, different people, different culture."
    },
    {
      "id": 157,
      "start": 1686.6000061035156,
      "end": 1688.6400146484375,
      "text": " Who's gonna purchase me?"
    },
    {
      "id": 158,
      "start": 1688.6400146484375,
      "end": 1689.4800109863281,
      "text": " What's gonna happen?"
    },
    {
      "id": 159,
      "start": 1689.4800109863281,
      "end": 1690.6800231933594,
      "text": " Can you imagine?"
    },
    {
      "id": 160,
      "start": 1690.6800231933594,
      "end": 1695.6800231933594,
      "text": " I mean, I begin to think about the process of Joseph"
    },
    {
      "id": 161,
      "start": 1695.8000183105469,
      "end": 1700.4800109863281,
      "text": " and the confusion and we find that Genesis 42 and verse 21"
    },
    {
      "id": 162,
      "start": 1700.4800109863281,
      "end": 1704.280029296875,
      "text": " tells us that Joseph besought his brothers."
    },
    {
      "id": 163,
      "start": 1704.280029296875,
      "end": 1707.1200256347656,
      "text": " Now, I'm not sure as you look at Genesis 42 and 21,"
    },
    {
      "id": 164,
      "start": 1707.8800048828125,
      "end": 1708.7200317382812,
      "text": " we mentioned it just a moment ago,"
    },
    {
      "id": 165,
      "start": 1708.7200317382812,
      "end": 1710.9200134277344,
      "text": " but when the Bible says that they were guilty"
    },
    {
      "id": 166,
      "start": 1710.9200134277344,
      "end": 1714.8400268554688,
      "text": " concerning our brother in that we saw the anguish of his soul"
    },
    {
      "id": 167,
      "start": 1714.8400268554688,
      "end": 1719.0,
      "text": " when he besought us and we would not hear."
    },
    {
      "id": 168,
      "start": 1719.0,
      "end": 1721.2000122070312,
      "text": " Therefore, this distress come upon us."
    },
    {
      "id": 169,
      "start": 1721.2000122070312,
      "end": 1725.3800048828125,
      "text": " Now, could it be that Joseph besought his brothers"
    },
    {
      "id": 170,
      "start": 1725.3800048828125,
      "end": 1727.4800415039062,
      "text": " while he was being thrown into the pit?"
    },
    {
      "id": 171,
      "start": 1727.4800415039062,
      "end": 1728.3200073242188,
      "text": " Sure."
    },
    {
      "id": 172,
      "start": 1729.5599975585938,
      "end": 1731.9600219726562,
      "text": " Could it be that during the negotiations"
    },
    {
      "id": 173,
      "start": 1731.9600219726562,
      "end": 1734.6799926757812,
      "text": " with the Ishmaelites as he's gonna be sold into slavery"
    },
    {
      "id": 174,
      "start": 1734.6799926757812,
      "end": 1737.6799926757812,
      "text": " that he's pleading with his brothers?"
    },
    {
      "id": 175,
      "start": 1737.6799926757812,
      "end": 1740.0400390625,
      "text": " Why are you doing this?"
    },
    {
      "id": 176,
      "start": 1740.0400390625,
      "end": 1741.7200317382812,
      "text": " Don't sell me to these people."
    },
    {
      "id": 177,
      "start": 1741.7200317382812,
      "end": 1743.300048828125,
      "text": " Could you imagine?"
    },
    {
      "id": 178,
      "start": 1743.300048828125,
      "end": 1746.1199951171875,
      "text": " The Bible says that they saw the anguish of his soul"
    },
    {
      "id": 179,
      "start": 1746.1199951171875,
      "end": 1751.1199951171875,
      "text": " and when he besought us and we find that Joseph is here"
    },
    {
      "id": 180,
      "start": 1752.0,
      "end": 1753.9800415039062,
      "text": " and while he's in the pit"
    },
    {
      "id": 181,
      "start": 1753.9800415039062,
      "end": 1756.239990234375,
      "text": " and while they're negotiating with the Ishmaelites,"
    },
    {
      "id": 182,
      "start": 1756.239990234375,
      "end": 1761.1199951171875,
      "text": " I think that he's confused about these events."
    },
    {
      "id": 183,
      "start": 1761.1199951171875,
      "end": 1762.280029296875,
      "text": " What's going on?"
    },
    {
      "id": 184,
      "start": 1762.280029296875,
      "end": 1763.3800048828125,
      "text": " What's gonna happen?"
    },
    {
      "id": 185,
      "start": 1764.3800048828125,
      "end": 1767.739990234375,
      "text": " We find as we read already in verse 36 of Genesis 37"
    },
    {
      "id": 186,
      "start": 1767.739990234375,
      "end": 1770.1000366210938,
      "text": " that Joseph arrives in Egypt"
    },
    {
      "id": 187,
      "start": 1771.3400268554688,
      "end": 1774.5,
      "text": " and the Bible tells us that he's purchased by Potiphar."
    },
    {
      "id": 188,
      "start": 1774.5,
      "end": 1778.4200439453125,
      "text": " Now, for us this evening, most of us tonight,"
    },
    {
      "id": 189,
      "start": 1778.4200439453125,
      "end": 1781.4200439453125,
      "text": " if I were to put most of us on the spot"
    },
    {
      "id": 190,
      "start": 1781.4200439453125,
      "end": 1782.7000122070312,
      "text": " and have you come stand up here and say"
    },
    {
      "id": 191,
      "start": 1782.7000122070312,
      "end": 1784.9400024414062,
      "text": " what happens next in the life of Joseph,"
    },
    {
      "id": 192,
      "start": 1784.9400024414062,
      "end": 1789.8200073242188,
      "text": " give me just a five-step overview,"
    },
    {
      "id": 193,
      "start": 1789.8600463867188,
      "end": 1793.52001953125,
      "text": " you would quickly get to the palace part of Joseph."
    },
    {
      "id": 194,
      "start": 1795.7000122070312,
      "end": 1797.6600341796875,
      "text": " Joseph doesn't know that at this point."
    },
    {
      "id": 0,
      "start": 1797.6600341796875,
      "end": 1802.9800343513489,
      "text": " know at this point what the future holds, what's going to happen."
    },
    {
      "id": 1,
      "start": 1802.9800343513489,
      "end": 1809.3600339889526,
      "text": " As we begin to think about Joseph, and we notice what's happening, and we see the events"
    },
    {
      "id": 2,
      "start": 1809.3600339889526,
      "end": 1818.280035018921,
      "text": " as they unfold, the book of Psalms in the 90th chapter gives us this truth concerning"
    },
    {
      "id": 3,
      "start": 1818.280035018921,
      "end": 1825.8200340270996,
      "text": " our lives, and I want you to turn there quickly, Psalm 90, I want you to look at what the Bible"
    },
    {
      "id": 4,
      "start": 1825.8200340270996,
      "end": 1834.1000328063965,
      "text": " says in verse number 9, look at just a couple of verses here."
    },
    {
      "id": 5,
      "start": 1834.1000328063965,
      "end": 1839.8800354003906,
      "text": " The Bible tells us in Psalm 90 in verse number 9, for all our days are passed away in thy"
    },
    {
      "id": 6,
      "start": 1839.8800354003906,
      "end": 1840.8800354003906,
      "text": " wrath."
    },
    {
      "id": 7,
      "start": 1840.8800354003906,
      "end": 1848.0000343322754,
      "text": " Notice what it says, we spend our years as a tale that is told."
    },
    {
      "id": 8,
      "start": 1848.0000343322754,
      "end": 1852.0400352478027,
      "text": " The Bible says in verse number 10, the days of our years are threescore years and ten,"
    },
    {
      "id": 9,
      "start": 1852.0400352478027,
      "end": 1856.4000358581543,
      "text": " for by reason of strength they be fourscore years, yet is their strength, labor, and sorrow"
    },
    {
      "id": 10,
      "start": 1856.4000358581543,
      "end": 1859.6000328063965,
      "text": " for to soon cut off and we fly away."
    },
    {
      "id": 11,
      "start": 1859.6000328063965,
      "end": 1863.680030822754,
      "text": " So verse 12 says teach us to number our days that we may apply our hearts unto wisdom."
    },
    {
      "id": 12,
      "start": 1863.680030822754,
      "end": 1869.1200332641602,
      "text": " I want you to notice the end of verse number 9 where the Bible says that we spend our years"
    },
    {
      "id": 13,
      "start": 1869.1200332641602,
      "end": 1871.8800354003906,
      "text": " as a tale that is told."
    },
    {
      "id": 14,
      "start": 1871.8800354003906,
      "end": 1877.9600372314453,
      "text": " For us this evening we have the privilege of reading the story of Joseph, the account"
    },
    {
      "id": 15,
      "start": 1877.9600372314453,
      "end": 1879.8400344848633,
      "text": " that God has given us."
    },
    {
      "id": 16,
      "start": 1879.8400344848633,
      "end": 1885.9600372314453,
      "text": " The tale, if you look at this verse of Psalm 99, we spend our years as a tale that is told."
    },
    {
      "id": 17,
      "start": 1885.9600372314453,
      "end": 1893.4800338745117,
      "text": " We're reading Joseph's story, the account of his life."
    },
    {
      "id": 18,
      "start": 1893.4800338745117,
      "end": 1897.4400329589844,
      "text": " And I want you to understand that at this particular time in Joseph's life that there"
    },
    {
      "id": 19,
      "start": 1897.4400329589844,
      "end": 1903.0000305175781,
      "text": " are some events that have taken place that could certainly lead to confusion."
    },
    {
      "id": 20,
      "start": 1903.0000305175781,
      "end": 1910.2000350952148,
      "text": " No doubt there are times in your lives, in my life, in your life, when things seem to"
    },
    {
      "id": 21,
      "start": 1910.2000350952148,
      "end": 1913.6000366210938,
      "text": " take what we might call an unexpected turn."
    },
    {
      "id": 22,
      "start": 1913.6000366210938,
      "end": 1914.6000366210938,
      "text": " They're happen."
    },
    {
      "id": 23,
      "start": 1914.6000366210938,
      "end": 1921.0800323486328,
      "text": " You say, I didn't see this coming, I didn't know that was going to happen, I didn't think"
    },
    {
      "id": 24,
      "start": 1921.0800323486328,
      "end": 1926.9200286865234,
      "text": " these people were going to treat me this way, or I didn't, an unexpected turn."
    },
    {
      "id": 25,
      "start": 1926.9200286865234,
      "end": 1931.4000396728516,
      "text": " And the question that we must ask ourselves and when that happens in our life, and we'll"
    },
    {
      "id": 26,
      "start": 1931.4000396728516,
      "end": 1937.3600311279297,
      "text": " note this as we continue to study the life of Joseph, is that when that moment comes"
    },
    {
      "id": 27,
      "start": 1937.3600311279297,
      "end": 1944.0400390625,
      "text": " and maybe you're in that kind of a moment this evening, when that unexpected rises and"
    },
    {
      "id": 28,
      "start": 1944.0400390625,
      "end": 1951.8800354003906,
      "text": " comes in your life, we must learn to rest and to trust in our Heavenly Father, knowing"
    },
    {
      "id": 29,
      "start": 1951.8800354003906,
      "end": 1954.3600311279297,
      "text": " that He's a plan for our life."
    },
    {
      "id": 30,
      "start": 1954.3600311279297,
      "end": 1960.280029296875,
      "text": " We may not know what the plan is, in fact we may not be able to see beyond right here"
    },
    {
      "id": 31,
      "start": 1960.280029296875,
      "end": 1964.6000366210938,
      "text": " to even think about there's a plan."
    },
    {
      "id": 32,
      "start": 1964.6000366210938,
      "end": 1970.5600280761719,
      "text": " It's amazing to me when you look at the entire account of the book of Genesis of the life,"
    },
    {
      "id": 33,
      "start": 1970.5600280761719,
      "end": 1981.0800323486328,
      "text": " the days of Joseph, that when he reveals his identity to his brothers, he says, God sent"
    },
    {
      "id": 34,
      "start": 1981.0800323486328,
      "end": 1986.8400268554688,
      "text": " me before you to preserve life."
    },
    {
      "id": 35,
      "start": 1986.8400268554688,
      "end": 1992.280029296875,
      "text": " He says it again in Genesis 50 after Jacob dies because the brothers think, okay, Joseph's"
    },
    {
      "id": 36,
      "start": 1992.280029296875,
      "end": 1995.800033569336,
      "text": " been nice to us because dad was alive and so on and so forth and now we're really going"
    },
    {
      "id": 37,
      "start": 1995.800033569336,
      "end": 1997.6000366210938,
      "text": " to get what we deserve."
    },
    {
      "id": 38,
      "start": 1997.6000366210938,
      "end": 2003.1800384521484,
      "text": " And Joseph says, no, no, no, in Genesis chapter 50 it's such a powerful truth that we see"
    },
    {
      "id": 39,
      "start": 2003.1800384521484,
      "end": 2007.8400268554688,
      "text": " in the text of Scripture where he says to his brothers in verse number 19, and Joseph"
    },
    {
      "id": 40,
      "start": 2007.8400268554688,
      "end": 2016.2400360107422,
      "text": " said to them, fear not, for am I in the place of God, but as for you, you thought evil against"
    },
    {
      "id": 41,
      "start": 2016.6400299072266,
      "end": 2022.9200286865234,
      "text": " me, but God meant it unto good to bring to pass as it is this day to save much people"
    },
    {
      "id": 42,
      "start": 2022.9200286865234,
      "end": 2028.280029296875,
      "text": " alive."
    },
    {
      "id": 43,
      "start": 2028.280029296875,
      "end": 2035.280029296875,
      "text": " That perspective of Joseph is precious and it's one that we need to have."
    },
    {
      "id": 44,
      "start": 2035.280029296875,
      "end": 2039.9600372314453,
      "text": " You say, well, you don't know what that person did to me."
    },
    {
      "id": 45,
      "start": 2039.9600372314453,
      "end": 2044.520034790039,
      "text": " Did you just read what I read in Genesis 37?"
    },
    {
      "id": 46,
      "start": 2044.520034790039,
      "end": 2051.4400329589844,
      "text": " If anyone honestly could get a pass, I think Joseph would be near the top of the list."
    },
    {
      "id": 47,
      "start": 2051.4400329589844,
      "end": 2055.52001953125,
      "text": " Do you understand what I mean by saying that?"
    },
    {
      "id": 48,
      "start": 2055.52001953125,
      "end": 2059.560028076172,
      "text": " Like if somebody could get a pass for, Joseph, you know what, we understand, I mean, it was"
    },
    {
      "id": 49,
      "start": 2059.560028076172,
      "end": 2067.8800354003906,
      "text": " just really tough what happened and I understand that, no, he kept his eyes on the Lord."
    },
    {
      "id": 50,
      "start": 2067.8800354003906,
      "end": 2073.000030517578,
      "text": " Remember we talked about being at Bethel, the place of God, the house of God?"
    },
    {
      "id": 51,
      "start": 2073.000030517578,
      "end": 2075.6400451660156,
      "text": " He was there."
    },
    {
      "id": 52,
      "start": 2075.6400451660156,
      "end": 2080.8400268554688,
      "text": " And Joseph, he had developed that character, he had known something about the truth of"
    },
    {
      "id": 53,
      "start": 2080.8400268554688,
      "end": 2085.2000427246094,
      "text": " Jehovah God and serving God, and we'll see this as we continue to study through his life"
    },
    {
      "id": 54,
      "start": 2085.2000427246094,
      "end": 2089.9600219726562,
      "text": " and understand what's been revealed to us in the pages of Scripture through the account"
    },
    {
      "id": 55,
      "start": 2089.9600219726562,
      "end": 2094.4400329589844,
      "text": " of Joseph, but I want you to understand this evening that there are times in your life"
    },
    {
      "id": 56,
      "start": 2094.4400329589844,
      "end": 2099.9600219726562,
      "text": " that you might be confused of what's going on."
    },
    {
      "id": 57,
      "start": 2099.9600219726562,
      "end": 2103.1600341796875,
      "text": " You can be there."
    },
    {
      "id": 58,
      "start": 2103.1600341796875,
      "end": 2112.760040283203,
      "text": " But in that moment of confusion, never stop trusting God because God is greater."
    },
    {
      "id": 59,
      "start": 2112.760040283203,
      "end": 2115.2000427246094,
      "text": " God is greater."
    },
    {
      "id": 60,
      "start": 2115.2000427246094,
      "end": 2118.2000427246094,
      "text": " But these people, God is greater."
    },
    {
      "id": 61,
      "start": 2118.2000427246094,
      "end": 2121.4800415039062,
      "text": " But did you hear, God is greater?"
    },
    {
      "id": 62,
      "start": 2121.4800415039062,
      "end": 2125.8400268554688,
      "text": " You can go on the internet, you can watch conspiracy theory stuff until you're dead,"
    },
    {
      "id": 63,
      "start": 2125.8400268554688,
      "end": 2126.8400268554688,
      "text": " honestly."
    },
    {
      "id": 64,
      "start": 2126.8400268554688,
      "end": 2127.8400268554688,
      "text": " Crazy."
    },
    {
      "id": 65,
      "start": 2128.7200317382812,
      "end": 2131.4800415039062,
      "text": " Ultimately, God is in control."
    },
    {
      "id": 66,
      "start": 2131.4800415039062,
      "end": 2133.3600463867188,
      "text": " God is in control."
    },
    {
      "id": 67,
      "start": 2133.3600463867188,
      "end": 2135.6800231933594,
      "text": " God is in control."
    },
    {
      "id": 68,
      "start": 2135.6800231933594,
      "end": 2139.8400268554688,
      "text": " As I look at Genesis 37 and I think about that truth in Psalm 90 that we spend our days"
    },
    {
      "id": 69,
      "start": 2139.8400268554688,
      "end": 2147.9600219726562,
      "text": " of the tale that is told, there are times in the story of our lives, the record of our"
    },
    {
      "id": 70,
      "start": 2147.9600219726562,
      "end": 2155.760040283203,
      "text": " lives that somebody else might have seemingly had the pen."
    },
    {
      "id": 71,
      "start": 2155.760040283203,
      "end": 2160.3600463867188,
      "text": " The brothers, they're the ones kind of calling the shots here in Genesis 37."
    },
    {
      "id": 72,
      "start": 2160.3600463867188,
      "end": 2163.000030517578,
      "text": " They're the ones that have taken Joseph and thrown him in the pit and they're the ones"
    },
    {
      "id": 73,
      "start": 2163.000030517578,
      "end": 2167.7200317382812,
      "text": " that make the decision that we're going to sell him into slavery."
    },
    {
      "id": 74,
      "start": 2167.7200317382812,
      "end": 2173.9200439453125,
      "text": " Joseph's just at their whim, seemingly having no control."
    },
    {
      "id": 75,
      "start": 2173.9200439453125,
      "end": 2179.280029296875,
      "text": " But ultimately, God sent me before you."
    },
    {
      "id": 76,
      "start": 2179.280029296875,
      "end": 2183.6000366210938,
      "text": " That's Joseph's testimony and that is powerful."
    },
    {
      "id": 77,
      "start": 2183.6000366210938,
      "end": 2191.4400329589844,
      "text": " If we could just get to that point in our lives, honestly, where we let God be God and"
    },
    {
      "id": 78,
      "start": 2191.4400329589844,
      "end": 2198.560028076172,
      "text": " we recognize that these things, God is sovereign, God is in control, God has a plan, God has"
    },
    {
      "id": 79,
      "start": 2198.560028076172,
      "end": 2199.560028076172,
      "text": " a purpose."
    },
    {
      "id": 80,
      "start": 2199.560028076172,
      "end": 2201.560028076172,
      "text": " Listen, what would happen?"
    },
    {
      "id": 81,
      "start": 2201.560028076172,
      "end": 2208.4400329589844,
      "text": " How would we read the account in Joseph, excuse me, in Genesis if Joseph just went ahead and"
    },
    {
      "id": 82,
      "start": 2208.4400329589844,
      "end": 2214.000030517578,
      "text": " forsook everything that he knew about God and just gave up on life and said, this isn't"
    },
    {
      "id": 83,
      "start": 2214.000030517578,
      "end": 2215.000030517578,
      "text": " fair?"
    },
    {
      "id": 84,
      "start": 2215.000030517578,
      "end": 2218.8400268554688,
      "text": " You know when people say life isn't fair today?"
    },
    {
      "id": 85,
      "start": 2218.8400268554688,
      "end": 2221.240020751953,
      "text": " Seems like you can hear it all the time, right?"
    },
    {
      "id": 86,
      "start": 2221.240020751953,
      "end": 2222.4400329589844,
      "text": " Life isn't fair."
    },
    {
      "id": 87,
      "start": 2222.4400329589844,
      "end": 2226.9600219726562,
      "text": " Life isn't fair."
    },
    {
      "id": 88,
      "start": 2226.9600219726562,
      "end": 2232.6000366210938,
      "text": " How would you read the rest of Genesis if Joseph responded that way?"
    },
    {
      "id": 89,
      "start": 2232.6000366210938,
      "end": 2239.8800354003906,
      "text": " Joseph just quit living a righteous life because he had some hard times."
    },
    {
      "id": 90,
      "start": 2239.8800354003906,
      "end": 2244.4800415039062,
      "text": " I don't think you'd read of Joseph ending up in the palace."
    },
    {
      "id": 91,
      "start": 2244.4800415039062,
      "end": 2245.4800415039062,
      "text": " Do you?"
    },
    {
      "id": 92,
      "start": 2245.4800415039062,
      "end": 2248.000030517578,
      "text": " I don't think so."
    },
    {
      "id": 93,
      "start": 2248.000030517578,
      "end": 2250.4400329589844,
      "text": " We see that he kept his eyes on the Lord."
    },
    {
      "id": 94,
      "start": 2250.4400329589844,
      "end": 2253.0400390625,
      "text": " This evening, two points of application."
    },
    {
      "id": 95,
      "start": 2253.0400390625,
      "end": 2259.8800354003906,
      "text": " Number one, Joseph was given a mission by his father."
    },
    {
      "id": 96,
      "start": 2259.8800354003906,
      "end": 2264.760040283203,
      "text": " Joseph's response to that mission reveals to us his complete submission and surrender"
    },
    {
      "id": 97,
      "start": 2264.760040283203,
      "end": 2267.1200256347656,
      "text": " to the plan of his dad."
    },
    {
      "id": 98,
      "start": 2267.1200256347656,
      "end": 2269.6400451660156,
      "text": " This evening, you and I have a heavenly father."
    },
    {
      "id": 99,
      "start": 2269.6400451660156,
      "end": 2276.3600463867188,
      "text": " He has a mission for us, he has a plan for us, he has a purpose for our lives."
    },
    {
      "id": 100,
      "start": 2276.3600463867188,
      "end": 2278.280029296875,
      "text": " How is it that we respond to him?"
    },
    {
      "id": 101,
      "start": 2278.280029296875,
      "end": 2283.080047607422,
      "text": " Do we respond immediately with complete submission and surrender?"
    },
    {
      "id": 102,
      "start": 2283.080047607422,
      "end": 2285.2000427246094,
      "text": " Lord, here's my life."
    },
    {
      "id": 103,
      "start": 2285.2000427246094,
      "end": 2287.7200317382812,
      "text": " Do what you want to do."
    },
    {
      "id": 104,
      "start": 2287.7200317382812,
      "end": 2290.7200317382812,
      "text": " Have thine own way, Lord."
    },
    {
      "id": 105,
      "start": 2290.7200317382812,
      "end": 2294.320037841797,
      "text": " My life, Lord, is yours to control."
    },
    {
      "id": 106,
      "start": 2294.320037841797,
      "end": 2295.320037841797,
      "text": " Why?"
    },
    {
      "id": 107,
      "start": 2295.320037841797,
      "end": 2299.080047607422,
      "text": " I've been bought with a price."
    },
    {
      "id": 108,
      "start": 2299.080047607422,
      "end": 2302.4000244140625,
      "text": " Number two, your life might take an unexpected turn."
    },
    {
      "id": 109,
      "start": 2302.4000244140625,
      "end": 2310.0400390625,
      "text": " In fact, I think all of us, as we live, we can think of times when our life did take"
    },
    {
      "id": 110,
      "start": 2310.0400390625,
      "end": 2312.6000366210938,
      "text": " an unexpected turn."
    },
    {
      "id": 111,
      "start": 2312.6000366210938,
      "end": 2317.1200561523438,
      "text": " And don't think that the last one is the last one."
    },
    {
      "id": 112,
      "start": 2317.1200561523438,
      "end": 2321.9600219726562,
      "text": " There may be other unexpected turns that lie ahead."
    },
    {
      "id": 113,
      "start": 2321.9600219726562,
      "end": 2328.1200561523438,
      "text": " But we find that in those moments, we must keep our eyes on Jesus and we must trust him"
    },
    {
      "id": 114,
      "start": 2328.1200561523438,
      "end": 2332.2000122070312,
      "text": " to know that he always does what's best."
    },
    {
      "id": 115,
      "start": 2332.2000122070312,
      "end": 2334.1600341796875,
      "text": " He knows what's right."
    },
    {
      "id": 116,
      "start": 2334.1600341796875,
      "end": 2339.56005859375,
      "text": " I trust that this evening we'd be challenged by this account from the life of Joseph."
    },
    {
      "id": 117,
      "start": 2339.56005859375,
      "end": 2345.6800537109375,
      "text": " We see the historical aspect of it, but oh, let's take application and let's respond as"
    },
    {
      "id": 118,
      "start": 2345.6800537109375,
      "end": 2346.6800537109375,
      "text": " we should."
    },
    {
      "id": 119,
      "start": 2347.2400512695312,
      "end": 2348.2400512695312,
      "text": " Father, we love you."
    },
    {
      "id": 120,
      "start": 2348.2400512695312,
      "end": 2349.3600463867188,
      "text": " We thank you for loving us."
    },
    {
      "id": 121,
      "start": 2349.3600463867188,
      "end": 2352.5800170898438,
      "text": " Thank you for the truth of your word."
    },
    {
      "id": 122,
      "start": 2352.5800170898438,
      "end": 2357.2400512695312,
      "text": " Thank you for the record that you've given us, Lord, here of the life of Joseph."
    },
    {
      "id": 123,
      "start": 2357.2400512695312,
      "end": 2364.3600463867188,
      "text": " And as we think about his life at this particular time and these events that unfold, we understand"
    },
    {
      "id": 124,
      "start": 2364.3600463867188,
      "end": 2367.56005859375,
      "text": " that there could certainly be a measure of confusion."
    },
    {
      "id": 125,
      "start": 2367.56005859375,
      "end": 2370.9200439453125,
      "text": " He besought his brothers, the Bible tells us."
    },
    {
      "id": 126,
      "start": 2370.9200439453125,
      "end": 2373.3200073242188,
      "text": " They saw the anguish on his face."
    },
    {
      "id": 127,
      "start": 2374.3200073242188,
      "end": 2378.0000610351562,
      "text": " But at times in our lives, if we'd be honest, we just don't understand maybe all that's"
    },
    {
      "id": 128,
      "start": 2378.0000610351562,
      "end": 2379.4000244140625,
      "text": " going on."
    },
    {
      "id": 129,
      "start": 2379.4000244140625,
      "end": 2384.4400634765625,
      "text": " God, I pray that you'd help us tonight to trust you."
    },
    {
      "id": 130,
      "start": 2384.4400634765625,
      "end": 2389.4800415039062,
      "text": " You'd help us to know how great you are and to know the plan that you have for us."
    },
    {
      "id": 131,
      "start": 2389.4800415039062,
      "end": 2394.0800170898438,
      "text": " God, to know that you do all things well."
    },
    {
      "id": 132,
      "start": 2394.0800170898438,
      "end": 2397.6400146484375,
      "text": " I pray that we would be in complete submission."
    },
    {
      "id": 0,
      "start": 2397.6400146484375,
      "end": 2408.2200145721436,
      "text": " surrender to you and to your will, that we'd simply say, here am I. Lord, we thank you"
    },
    {
      "id": 1,
      "start": 2408.2200145721436,
      "end": 2413.2200145721436,
      "text": " for this record and testimony. I pray that you'd just work in our hearts now. We'll"
    },
    {
      "id": 2,
      "start": 2413.2200145721436,
      "end": 2416.660015106201,
      "text": " thank you for every decision that's made, for it's in Christ's name we pray. Would"
    },
    {
      "id": 3,
      "start": 2416.660015106201,
      "end": 2419.780014038086,
      "text": " you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly"
    },
    {
      "id": 4,
      "start": 2419.780014038086,
      "end": 2423.9800148010254,
      "text": " on the piano. Maybe God spoke to your heart this evening and maybe you just want to come"
    },
    {
      "id": 5,
      "start": 2423.9800148010254,
      "end": 2428.7200145721436,
      "text": " and maybe you're in the midst of an unexpected turn, something that's transpired, you just"
    },
    {
      "id": 6,
      "start": 2428.7200145721436,
      "end": 2435.160015106201,
      "text": " don't understand. Say, God, I don't understand right now, but I'm trusting you. I'm believing"
    },
    {
      "id": 7,
      "start": 2435.160015106201,
      "end": 2441.560012817383,
      "text": " you. Maybe this evening if you're honest in your evaluation, you're not completely submitted"
    },
    {
      "id": 8,
      "start": 2441.560012817383,
      "end": 2447.120014190674,
      "text": " and surrendered to the will of your heavenly Father. Maybe you need to come this evening"
    },
    {
      "id": 9,
      "start": 2447.120014190674,
      "end": 2454.3000144958496,
      "text": " and get that taken care of and fully surrender. As Kimberly plays, the altar is open."
    }
  ],
  "processed_at": "2025-04-16T08:12:08.106614"
}