{
  "video_id": "0OKb7phALh4",
  "text": "up the 7th chapter of the book of 2 Kings and if you're looking here, of course we've been looking in this chapter for the last couple of weeks and you'll be remembering with me as we've studied through the life of Elisha that in chapter number 6 God gives us the record of how the Syrians had successfully besieged the city of Samaria. In fact the inhabitants of Samaria were desperate. The picture that we see in the end of 2 Kings chapter number 6 would reveal to us that they were hopeless and they were helpless and we find that we enter into the 7th chapter of the book of 2 Kings and in chapter number 7 the text reveals to us, it starts with this great prophecy from Elisha and we see the declaration of Elisha and he says, Hear ye the word of the Lord, thus saith the Lord, and I mean the prophecy is given and it's a prophecy of provision and what a blessing to see the confidence and the content in which is given to us with regard to this prophecy. Of course as we studied last week, the text of scripture then follows the lives of these four leprous men and as you read about those four leprous men, remember they go through that process of if we stay here we're going to die, if we go to Samaria there's no food there so we're probably going to die, but there's this potential that we can go to the Syrians and they might show us kindness and we might live, they might kill us and so the only hope of survival in their minds as they went through the process of determining the decision that they would make, they determined that they would go and they would fall into the Syrians. Of course you'll remember that they get to the camp and there's no Syrians and the Lord had been working and the Lord had allowed the Syrians to hear this noise and he allowed them to hear a noise of chariots, a noise of horses, it was a great host of noise that these soldiers, these warriors heard and they concluded that the king of Israel had hired the Hittites and the kings of Egypt to come upon them and so they fled and we find that these leprous men, as we concluded last week, they said, we do not well. Today is a day of good tidings and we hold our peace and so they went back to the city of Samaria and that's where we pick up this evening. We find in our text of Scripture, we'll be looking at verses 11 through 20, I want you to notice verse number 16 and we'll read all of the text as we get through the message this evening, but notice with me in verse number 16 the Bible says, and the people went out and spoiled the tents of the Syrians. So a measure of fine flour was sold for a shekel and two measures of barley for a shekel according to the word of the Lord. If you're taking notes this evening, I've simply titled the message from verse number 16, they spoiled the tents of the Syrians. They being the inhabitants of Samaria, the children of Israel, they spoiled the tents of the Syrians. As we look at our text of Scripture and work through the passage this evening, notice with me first of all the doubt of the king. In verse number 11, remember those four leprous men returned and they began to share tidings about what it was that they had encountered and the Bible says he called the porters and they told it to the king's house within. Notice verse number 12, and the king arose in the night and said unto his servants, I will now show you what the Syrians have done to us. They know that we be hungry, therefore they gone out of the camp to hide themselves in the field saying, when they come out of the city, we shall catch them alive and get into the city. And one of his servants answered and said, let some take, I pray thee, five of the horses that remain, which are left in the city. By the way, when you see that there are five of the horses that remain, obviously there weren't a large number of horses that were there. This siege that the Syrians had laid upon Samaria was just met with grave consequences. It continues and says, behold, they are as all the multitude of Israel that are left in it. Behold, I say, they are even as all the multitude of the Israelites that are consumed, and let us send and see. When we think about the doubt of the king, we find first of all that he received the message from these four leprous men. He received the message. The Bible tells us in verse number 11 that when these, in verse number 10, when these four leprous men came, they called him to the port of the city and they told him. What did they tell the port of the city? Well, according to verse number 10, they told this man, we came to the camp of the Syrians and behold, there was no man there, neither voice of man, but horses tied and asses tied and the tents as they were. And so the Bible reveals to us in verse number 11 that he called the porters and they told it to the king's house within, and then it tells us that the king arose in the night and said unto his servants. And so we find, according to verses 10 through 12, that the king received the message. He received this faith, this good tidings. That's how these four leprous men referred to it. They said, this is a day of good tidings. And what good news it was. I mean, could you imagine being there in Samaria, we've gone through the sixth chapter already and we've dealt with the severity of this situation and the fact that they had nothing and they had turned to cannibalism. I mean, it was a terrible, terrible situation. And now these four leprous men bring these good tidings and the king receives the message, but he did not believe. He did not believe. The Bible tells us that he concluded that really what was going on is the Syrians had set a trap. And he says, here, I'm going to tell you what's going on. He tells them in verse number 12 that he said unto his servants, I will now show you what the Syrians have done to us. They know that we be hungry, therefore are they gone out of the camp to hide themselves in the field saying when they come out of the city, we shall catch them alive and get into the city. So he believed that there was a trap that had been set, that the Syrians had devised this plan. They knew that they had been successful at causing the city of Samaria to be without and these inhabitants were hungry and they said, so here's what we'll do. We're going to go hide and then they'll come out of the city and we'll then be able to take the city. And that was the conclusion that the king reached. We find, however, that there were some servants, the Bible says in verse number 13, that there were some servants there and one of them answered the king and he really was pleading with the king. And he says at the very end of the text, verse number 13, let us send and see. Let us at least go and investigate the claim that's been made by these four leprous men. I mean, we have heard these good tidings and the king concluded something entirely different and yet there's this servant really, I believe, that's pleading with the king and he's saying, let's just send a few messengers and let them go and see. And the king finally gives in. The king, according to verse number 14, he gives in and he sends out these messengers to go verify the situation. It says, then took, therefore, two chariot horses and the king sent after the host of the Syrians saying, go and see. Now I'm not sure if you can put your mind into each character throughout the passage of Scripture that we deal with and looking at how the king was feeling and kind of put yourself in his shoes and trying to evaluate the situation, put yourself in the servant's shoes that's pleading to send some messengers. But now think about being one of the messengers. You've heard the report from the four leprous men. Perhaps you're aware of what they've concluded and what they've brought as these good tidings, but you've also heard what the king said. And so you don't know what you're going to find. You're going out and you go and see. And so we find in these first few verses of the text before us this evening, the doubt of the king. And we find as we move forward through the passage, the discovery of the messengers. And the Bible tells us that they were given this responsibility to go and see. And in verse number 15, it tells us, and they went after them unto Jordan. Notice what the Bible says, and lo, all the way was full of garments and vessels, which the Syrians had cast away in their haste. And the messengers returned and told the king. So I want you to think about these messengers. And as they went, and the Bible tells us that the entire way, all the way, it was full of garments and vessels. Now remember, those four leprous men, the Bible tells us in verse number eight that when they went out, they were at the uttermost part of the camp. They went into one tent, they did eat and drink, carried then silver and gold and raiment and went and hid it. Came again and entered into another tent and carried then also and went and hid it. And so we find that these messengers are now sent on this mission. They have their marching orders, if you will, go and see, find out, verify that this claim is really true. The king has his doubt, but then we find the discovery of these men, these messengers that go out. They find that it's full of garments and vessels. There are no Syrians to be seen. We know because we're reading the written, recorded Word of God. that the Syrians fled because of what we mentioned in verse number six that the Lord caused them to hear this great noise. And they fled and they left everything. What was God doing? God was fulfilling the prophecy that He had given by the prophet Elisha. We know that God is able to do all things. He works in a number of different ways. We find that it's interesting as you study the scriptures and you study the various accounts that God gives us that God doesn't always work in the same way every time. But God always works. And we find here that God is working and these messengers they find all of these things. They find all of the substance. They find it just as the leper said. And we find that the Bible tells us at the end of verse number 15 that the messengers returned and told the king. Now I'd like to see the face of the king when these messengers returned with their verifying this claim of these leprous men. And they come back. I'm assuming that they come back with a level of excitement. I'm assuming that they come back with a readiness of going and spoiling because we find that as we read in verse number 16 this fulfilled prophecy, it's recorded in verse 16 and again in verse number 18, we find the fulfillment of the prophecy. The Bible says, and the people went out. Now these people were hungry. They had been dealing with this being besieged by the Syrians. And we find that they went out and notice it says they spoiled the tents of the Syrians. And then notice what it says. So a measure of fine flour was sold for a shekel and two measures of barley for a shekel. And then notice this phrase at the end of verse number 16, according to the word of the Lord. You remember that it was Elisha that stood up in verse number one. We said in the beginning even of our message this evening that this prophecy of provision, it was a detailed prophecy. We find that he, Elisha, stood up and said, hear ye the word of the Lord, thus saith the Lord. Notice tomorrow. Thus, he says, about this time shall a measure of fine flour be sold for a shekel and two measures of barley for a shekel in the gate of Samaria. How did Elisha know that? Because God informed him. See, we serve the God that is eternal. He is, of course, he transcends time. He knows the end from the beginning. And so this prophecy of provision that was given, we can see that it could be given with exact details as to what was going to happen. What was going to take place? It was going to be this measure, as we find here, of fine flour for a shekel and two measures of barley for a shekel. When was it going to happen? Tomorrow, about this time. Where was it going to happen? At the gate of Samaria. And we find that the very details in which God had given to Elisha, Elisha would speak those details and it comes to pass according to the Word of the Lord. This encourages us because we know that God always does what God says he will do. In fact, a prophet, as you would study the Scriptures, if they would prophesy and it did not come to pass, it was kind of a bad deal for them. They'd be put to death. But we know that Elisha is a true prophet of God, and he's speaking the Word of God, and he stands up with a level of confidence. We mentioned that when we studied the prophecy a couple of weeks ago, and we spoke about the confidence that Elisha had. And see, the reality today is that we have the complete canon of Scripture. We have truth that God has given us with regard to these last days in which we're living. We have truth that God has given us with regard to eschatology and the last days and the things that are going to still come to pass. We have the truth that Jesus Christ said, I will come again, and we can be very confident about that. We don't have to kind of, well, I think, no, he said he's gonna come again, and we believe him. Why? Because he always does what he says he's going to do. We can read throughout the pages of Scripture, and we can see fulfilled prophecy after fulfilled prophecy. We can see it in the life and ministry of the Lord Jesus Christ, and he gave his very word that he's coming again. I am understanding the Word of God to teach that the rapture is imminent. I mean, it could happen at any moment. We sing songs such as, listen for the trumpet, Jesus is coming again, and we are absolutely assured of this truth. We understand that after that there will be a tribulation, seven years. There will be judgment that will be poured out upon the earth. We read about all of those judgments throughout the book of Revelation. There will be a judgment seat of Christ. There will be a marriage supper of the Lamb. There will be a great white throne. There will be all of eternity. We can be sure of it. We can be confident of it. Why? Because God's given us his Word, and we can, well, you remember there were scoffers in those days. Peter deals with that in 2 Peter chapter number 3 when he speaks specifically about the return of the Lord Jesus Christ, and it tells us in 2 Peter chapter number 3, in verse number 3, in fact, knowing this verse, that there shall come in the last days scoffers walking after their own lust. And what is it that they're going to say? Well, according to verse number 4, where is the promise of his coming? You know what that tells me? They've heard that Jesus is going to come, but they don't believe it. They're scoffers. They're mockers. We find that they use their faulty logic. They are willingly ignorant according to verse number 5, but we find that the answer comes, the Lord is not slack concerning his promise, as some men count slackness. But as longsuffering to us were not willing that any should perish, but that all should come to repentance. In verse number 9, it says in verse number 10, the day of the Lord will come as a thief in the night. I mean, it's certain. It's absolutely positive, and we can have confidence. When we place our faith and trust in the truth of this book, we can have absolute confidence in what God says, knowing that it will come to pass. We find that Elisha makes this declaration, and we find that this prophecy is recorded, and it comes to pass according to the word of the Lord. Notice in verse number 18, and it came to pass as the man of God had spoken to the king, saying, two measures of barley for a shekel and a measure of fine flour for a shekel shall be tomorrow about this time in the gate of Samaria, and that's exactly what happened. And here's what's happening, is there's the rehearsing, if you will, of the prophecy there in verse number 18, that this was going to happen. And what happens now is God is going to remind us of that one servant that was kind of mocking and scoffing at the prophecy of Elisha, that prophecy of provision, and so we move from the doubt of the king to the discovery of the messengers, and then notice with me number three, the death of the servant. The death of the servant. We read in verse number 17 that the Bible says that the king appointed the Lord on whose hand he leaned to have the charge of the gate. The people trod upon him in the gate, and he died, as the man of God had said, who spake when the king came down to him. Do you remember what he said? It's recorded again for us in verse number 19, and the Lord answered the man of God. Elisha stands up, and he makes that prophecy. He delivers the the word of the Lord, and this man responds to Elisha and says, as we read in verse number 19, behold, if the Lord should make windows in heaven, might such a thing be. And he, that's Elisha, said unto this servant, behold, thou shalt see it with thine eyes, but shalt not eat thereof. And so it fell out unto him, for the people trod upon him in the gate, and he died. Now, we mentioned a few weeks ago as we studied verses 1 and 2 of 2 Kings 7, and we dealt with the way in which this man replied to Elisha, and we mentioned that it was evident that he was coming with an attitude of being a scoffer, at mocking the man of God, and we understand that because of the demise of this man, what happens. We find that Elisha announced that this man would, he would see it with his eyes, but that he would not taste it, he would not eat it, he would not have the privilege of partaking of that sustenance, that substance that would be found, as they would spoil the tents of the Syrians. They said that it was going to be specific, a measure of fine flour for a shekel, two measures of barley for a shekel. He told him the time, tomorrow about this time, and he told him where, at the gate of Samaria. And it's interesting because the king appointed the Lord, according to verse number 17, on whose hand he leaned, to have the charge what? Of the gate. Well that's where all the stuff was happening. I mean, these people are hungry. Can you see? I mean, you ever been out Black Friday shopping? It's insane, right? People trying to run people over to get something. Well, this was, I mean, this was... is that times 1,000 probably, because what you're seeing is a bunch of people that have been starving and they're hopeless and helpless, and now there's substance. Now there's something that's available. And we find that the Bible tells us that the people trod upon Him in the gate and He died. It's tragic what happened to this man. We find this scoffer, this one that was mocking the prophecy of Elisha. Oh, really, Elisha? I mean, do you not know what's going on? I understand that that's not what the Scriptures say, but I get in my mind's eye as I see the words of this man and I see the end of this man. We find that he says, if the Lord would make windows in heaven, might this thing be? He's mocking. He's a scoffer. We find the death of the servant. As we look through the passage of Scripture and we end, we can rejoice in understanding that the Lord provided just as He said He would. Remember, it was at the end of chapter 6. The Bible tells us in v. 33, and while He yet talked with them, behold, the messenger came down unto Him and He said, behold, this evil is of the Lord. What should I wait for the Lord any longer? The king didn't want to wait any longer. Elisha says, tomorrow, about this time, here's what's going to happen. We find that God fulfilled. God did exactly what He said He would. It's unusual how He accomplished His will. I mean, can you imagine a mighty army, the Syrians, being scared away because of a noise that they heard? God calls them to hear a noise. I mean, it was serious. God provided. See, I like, as we look through the Scriptures and even as we examine our own lives, it's so encouraging when we have the opportunity to see God work in such a way that it can only be that God did it. See, there was no way possible that the inhabitants of Samaria, these hopeless and helpless, these desperate individuals, there was no way that they could bring this to pass on their own. And yet, God worked. And see, our God is able to do as we often quote Ephesians 3 in verse number 20, exceeding abundantly above all that we ask or think. The king doubted. But what was being communicated to him from those four leprous men to the porter to his home was that God had worked. And see, today, God still works. God's still on His throne. God's still eternal. He's still omnipotent. He's still able. We find that God works in very specific ways and He works in ways in which He alone would be glorified. We see it throughout all of the Scripture. And oh, we can rest assured this evening that God will always do what God said He will do. And I am so thankful that as we read a passage of Scripture in the life of Elisha and we see what's taking place to reference what we said in the very beginning, Elisha didn't have to be so concerned with how God was going to do it. He just needed to know that it was God who said He would do it. And we focus on who, not how. Remember, it was Paul that was there shipwrecked in Acts 27 and we referenced that passage of Scripture a few weeks ago. And I mean, it was a bad situation. Uruk-Hidem was upon them, that terrible storm. They were wishing for the day. They had not seen the moon, the sun, the stars in a number of days. All hope was gone that they would be saved. And yet God came and delivered a message to Paul. What does Paul say? I believe God. I don't need to know how God's gonna spare us, but I just know that God is, because God said that He would. Our God is able. And we need to focus on who, not how. So often I think we get kinda twisted up, if you will, because we're always trying to figure out how God's gonna do something, instead of just understanding that God can do it however He wants to do it. And most times He does it in a way that only He will be glorified. Father, we love You. We thank You for loving us. Thank You for Thy Word, the truth contained therein. We pray, Lord, that You would help us to be encouraged this evening, to be reminded once again that You always do what You say You will do, even as we quickly reviewed some promises that You've given us concerning the end times and looking at some of these things that we know will soon come to pass. Lord, I pray that You would help us to have a level of confidence in knowing that You will do what You said You will do. Father, I pray that You would work in and through our lives, that You would work in such a way that You alone would be glorified. Each one within our congregation has unique circumstances and unique situations in which they're dealing with. And God, we pray that You'd be glorified in each of our lives. We thank You that You hear and answer prayer. We thank You that You are the Lord God Almighty. We pray that You'd bless our time of prayer. We thank You for the privilege. We pray that as we here at the church house pray together, I pray that our season of prayer would be sweet. Lord, I pray for each family, each individual that's tuned in to watch this evening. Lord, I pray that as we conclude the live stream, that they would spend time in prayer at home. Lord, that You would work as only You can. We know that You have given us the privilege of prayer. We know the power of prayer. I pray, Lord, that we would honor You and show our dependence upon Thee as we seek Your face in prayer. We'll give You honor and glory for all that You'll do. We do ask that You would bless the AWANA meetings. I thank You for each of our teachers and workers who have been faithful to continue in seeking to encourage and influence these young people. I pray, God, that You'd bless them, encourage them, give them sweet times of fellowship and encouragement on the phones. And Lord, we'll thank You for what You'll do there. For it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.71999979019165,
      "text": " up the 7th chapter of the book of 2 Kings and if you're looking here, of course we've"
    },
    {
      "id": 1,
      "start": 5.71999979019165,
      "end": 10.199999809265137,
      "text": " been looking in this chapter for the last couple of weeks and you'll be remembering"
    },
    {
      "id": 2,
      "start": 10.199999809265137,
      "end": 15.5600004196167,
      "text": " with me as we've studied through the life of Elisha that in chapter number 6 God gives"
    },
    {
      "id": 3,
      "start": 15.5600004196167,
      "end": 21.639999389648438,
      "text": " us the record of how the Syrians had successfully besieged the city of Samaria."
    },
    {
      "id": 4,
      "start": 21.639999389648438,
      "end": 25.15999984741211,
      "text": " In fact the inhabitants of Samaria were desperate."
    },
    {
      "id": 5,
      "start": 25.15999984741211,
      "end": 29.8799991607666,
      "text": " The picture that we see in the end of 2 Kings chapter number 6 would reveal to us that they"
    },
    {
      "id": 6,
      "start": 29.8799991607666,
      "end": 37.15999984741211,
      "text": " were hopeless and they were helpless and we find that we enter into the 7th chapter"
    },
    {
      "id": 7,
      "start": 37.15999984741211,
      "end": 42.41999816894531,
      "text": " of the book of 2 Kings and in chapter number 7 the text reveals to us, it starts with this"
    },
    {
      "id": 8,
      "start": 42.41999816894531,
      "end": 49.119998931884766,
      "text": " great prophecy from Elisha and we see the declaration of Elisha and he says,"
    },
    {
      "id": 9,
      "start": 49.119998931884766,
      "end": 52.13999938964844,
      "text": " Hear ye the word of the Lord, thus saith the Lord,"
    },
    {
      "id": 10,
      "start": 52.13999938964844,
      "end": 57.63999938964844,
      "text": " and I mean the prophecy is given and it's a prophecy of provision and what a blessing"
    },
    {
      "id": 11,
      "start": 57.63999938964844,
      "end": 66.27999877929688,
      "text": " to see the confidence and the content in which is given to us with regard to this"
    },
    {
      "id": 12,
      "start": 66.27999877929688,
      "end": 67.27999877929688,
      "text": " prophecy."
    },
    {
      "id": 13,
      "start": 67.27999877929688,
      "end": 72.58000183105469,
      "text": " Of course as we studied last week, the text of scripture then follows the lives of these"
    },
    {
      "id": 14,
      "start": 72.58000183105469,
      "end": 77.12000274658203,
      "text": " four leprous men and as you read about those four leprous men, remember they go through"
    },
    {
      "id": 15,
      "start": 77.12000274658203,
      "end": 82.19999694824219,
      "text": " that process of if we stay here we're going to die, if we go to Samaria there's no food"
    },
    {
      "id": 16,
      "start": 82.19999694824219,
      "end": 86.16000366210938,
      "text": " there so we're probably going to die, but there's this potential that we can go to the"
    },
    {
      "id": 17,
      "start": 86.16000366210938,
      "end": 92.0,
      "text": " Syrians and they might show us kindness and we might live, they might kill us and so the"
    },
    {
      "id": 18,
      "start": 92.0,
      "end": 99.95999908447266,
      "text": " only hope of survival in their minds as they went through the process of determining the"
    },
    {
      "id": 19,
      "start": 99.95999908447266,
      "end": 103.63999938964844,
      "text": " decision that they would make, they determined that they would go and they would fall into"
    },
    {
      "id": 20,
      "start": 103.63999938964844,
      "end": 104.63999938964844,
      "text": " the Syrians."
    },
    {
      "id": 21,
      "start": 104.63999938964844,
      "end": 110.33999633789062,
      "text": " Of course you'll remember that they get to the camp and there's no Syrians and the Lord"
    },
    {
      "id": 22,
      "start": 110.33999633789062,
      "end": 116.81999969482422,
      "text": " had been working and the Lord had allowed the Syrians to hear this noise and he allowed"
    },
    {
      "id": 23,
      "start": 116.81999969482422,
      "end": 122.18000030517578,
      "text": " them to hear a noise of chariots, a noise of horses, it was a great host of noise that"
    },
    {
      "id": 24,
      "start": 122.18000030517578,
      "end": 129.4600067138672,
      "text": " these soldiers, these warriors heard and they concluded that the king of Israel had hired"
    },
    {
      "id": 25,
      "start": 129.4600067138672,
      "end": 136.33999633789062,
      "text": " the Hittites and the kings of Egypt to come upon them and so they fled and we find that"
    },
    {
      "id": 26,
      "start": 136.33999633789062,
      "end": 142.6199951171875,
      "text": " these leprous men, as we concluded last week, they said, we do not well."
    },
    {
      "id": 27,
      "start": 142.6199951171875,
      "end": 148.66000366210938,
      "text": " Today is a day of good tidings and we hold our peace and so they went back to the city"
    },
    {
      "id": 28,
      "start": 148.66000366210938,
      "end": 151.5399932861328,
      "text": " of Samaria and that's where we pick up this evening."
    },
    {
      "id": 29,
      "start": 151.5399932861328,
      "end": 155.05999755859375,
      "text": " We find in our text of Scripture, we'll be looking at verses 11 through 20, I want you"
    },
    {
      "id": 30,
      "start": 155.05999755859375,
      "end": 159.25999450683594,
      "text": " to notice verse number 16 and we'll read all of the text as we get through the message"
    },
    {
      "id": 31,
      "start": 159.25999450683594,
      "end": 163.89999389648438,
      "text": " this evening, but notice with me in verse number 16 the Bible says, and the people went"
    },
    {
      "id": 32,
      "start": 163.89999389648438,
      "end": 168.17999267578125,
      "text": " out and spoiled the tents of the Syrians."
    },
    {
      "id": 33,
      "start": 168.17999267578125,
      "end": 173.89999389648438,
      "text": " So a measure of fine flour was sold for a shekel and two measures of barley for a shekel"
    },
    {
      "id": 34,
      "start": 173.89999389648438,
      "end": 177.63999938964844,
      "text": " according to the word of the Lord."
    },
    {
      "id": 35,
      "start": 177.63999938964844,
      "end": 181.89999389648438,
      "text": " If you're taking notes this evening, I've simply titled the message from verse number"
    },
    {
      "id": 36,
      "start": 181.89999389648438,
      "end": 186.89999389648438,
      "text": " 16, they spoiled the tents of the Syrians."
    },
    {
      "id": 37,
      "start": 186.89999389648438,
      "end": 192.47999572753906,
      "text": " They being the inhabitants of Samaria, the children of Israel, they spoiled the tents"
    },
    {
      "id": 38,
      "start": 192.55999755859375,
      "end": 193.9199981689453,
      "text": " of the Syrians."
    },
    {
      "id": 39,
      "start": 193.9199981689453,
      "end": 197.44000244140625,
      "text": " As we look at our text of Scripture and work through the passage this evening, notice with"
    },
    {
      "id": 40,
      "start": 197.44000244140625,
      "end": 200.4600067138672,
      "text": " me first of all the doubt of the king."
    },
    {
      "id": 41,
      "start": 200.4600067138672,
      "end": 205.60000610351562,
      "text": " In verse number 11, remember those four leprous men returned and they began to share tidings"
    },
    {
      "id": 42,
      "start": 205.60000610351562,
      "end": 210.0399932861328,
      "text": " about what it was that they had encountered and the Bible says he called the porters and"
    },
    {
      "id": 43,
      "start": 210.0399932861328,
      "end": 212.55999755859375,
      "text": " they told it to the king's house within."
    },
    {
      "id": 44,
      "start": 212.55999755859375,
      "end": 216.55999755859375,
      "text": " Notice verse number 12, and the king arose in the night and said unto his servants, I"
    },
    {
      "id": 45,
      "start": 216.55999755859375,
      "end": 219.72000122070312,
      "text": " will now show you what the Syrians have done to us."
    },
    {
      "id": 46,
      "start": 219.72000122070312,
      "end": 224.47999572753906,
      "text": " They know that we be hungry, therefore they gone out of the camp to hide themselves in"
    },
    {
      "id": 47,
      "start": 224.47999572753906,
      "end": 229.44000244140625,
      "text": " the field saying, when they come out of the city, we shall catch them alive and get into"
    },
    {
      "id": 48,
      "start": 229.44000244140625,
      "end": 231.0,
      "text": " the city."
    },
    {
      "id": 49,
      "start": 231.0,
      "end": 235.72000122070312,
      "text": " And one of his servants answered and said, let some take, I pray thee, five of the horses"
    },
    {
      "id": 50,
      "start": 235.72000122070312,
      "end": 238.0399932861328,
      "text": " that remain, which are left in the city."
    },
    {
      "id": 51,
      "start": 238.0399932861328,
      "end": 241.32000732421875,
      "text": " By the way, when you see that there are five of the horses that remain, obviously there"
    },
    {
      "id": 52,
      "start": 241.32000732421875,
      "end": 243.36000061035156,
      "text": " weren't a large number of horses that were there."
    },
    {
      "id": 53,
      "start": 243.36000061035156,
      "end": 250.39999389648438,
      "text": " This siege that the Syrians had laid upon Samaria was just met with grave consequences."
    },
    {
      "id": 54,
      "start": 250.39999389648438,
      "end": 254.32000732421875,
      "text": " It continues and says, behold, they are as all the multitude of Israel that are left"
    },
    {
      "id": 55,
      "start": 254.32000732421875,
      "end": 255.32000732421875,
      "text": " in it."
    },
    {
      "id": 56,
      "start": 255.32000732421875,
      "end": 259.9599914550781,
      "text": " Behold, I say, they are even as all the multitude of the Israelites that are consumed, and let"
    },
    {
      "id": 57,
      "start": 259.9599914550781,
      "end": 262.0799865722656,
      "text": " us send and see."
    },
    {
      "id": 58,
      "start": 262.0799865722656,
      "end": 266.0400085449219,
      "text": " When we think about the doubt of the king, we find first of all that he received the"
    },
    {
      "id": 59,
      "start": 266.0400085449219,
      "end": 268.6000061035156,
      "text": " message from these four leprous men."
    },
    {
      "id": 60,
      "start": 268.6000061035156,
      "end": 269.760009765625,
      "text": " He received the message."
    },
    {
      "id": 61,
      "start": 269.760009765625,
      "end": 274.9599914550781,
      "text": " The Bible tells us in verse number 11 that when these, in verse number 10, when these"
    },
    {
      "id": 62,
      "start": 274.9599914550781,
      "end": 279.67999267578125,
      "text": " four leprous men came, they called him to the port of the city and they told him."
    },
    {
      "id": 63,
      "start": 279.67999267578125,
      "end": 281.20001220703125,
      "text": " What did they tell the port of the city?"
    },
    {
      "id": 64,
      "start": 281.20001220703125,
      "end": 286.9599914550781,
      "text": " Well, according to verse number 10, they told this man, we came to the camp of the Syrians"
    },
    {
      "id": 65,
      "start": 286.9599914550781,
      "end": 292.6400146484375,
      "text": " and behold, there was no man there, neither voice of man, but horses tied and asses tied"
    },
    {
      "id": 66,
      "start": 292.6400146484375,
      "end": 295.4800109863281,
      "text": " and the tents as they were."
    },
    {
      "id": 67,
      "start": 295.4800109863281,
      "end": 301.3999938964844,
      "text": " And so the Bible reveals to us in verse number 11 that he called the porters and they told"
    },
    {
      "id": 68,
      "start": 301.3999938964844,
      "end": 306.5199890136719,
      "text": " it to the king's house within, and then it tells us that the king arose in the night"
    },
    {
      "id": 69,
      "start": 306.5199890136719,
      "end": 308.55999755859375,
      "text": " and said unto his servants."
    },
    {
      "id": 70,
      "start": 308.55999755859375,
      "end": 315.6400146484375,
      "text": " And so we find, according to verses 10 through 12, that the king received the message."
    },
    {
      "id": 71,
      "start": 315.6400146484375,
      "end": 319.6400146484375,
      "text": " He received this faith, this good tidings."
    },
    {
      "id": 72,
      "start": 319.6400146484375,
      "end": 322.2799987792969,
      "text": " That's how these four leprous men referred to it."
    },
    {
      "id": 73,
      "start": 322.2799987792969,
      "end": 325.55999755859375,
      "text": " They said, this is a day of good tidings."
    },
    {
      "id": 74,
      "start": 325.55999755859375,
      "end": 326.9200134277344,
      "text": " And what good news it was."
    },
    {
      "id": 75,
      "start": 326.9200134277344,
      "end": 331.760009765625,
      "text": " I mean, could you imagine being there in Samaria, we've gone through the sixth chapter already"
    },
    {
      "id": 76,
      "start": 331.760009765625,
      "end": 338.1600036621094,
      "text": " and we've dealt with the severity of this situation and the fact that they had nothing"
    },
    {
      "id": 77,
      "start": 338.1600036621094,
      "end": 340.0799865722656,
      "text": " and they had turned to cannibalism."
    },
    {
      "id": 78,
      "start": 340.0799865722656,
      "end": 344.3599853515625,
      "text": " I mean, it was a terrible, terrible situation."
    },
    {
      "id": 79,
      "start": 344.3599853515625,
      "end": 351.4800109863281,
      "text": " And now these four leprous men bring these good tidings and the king receives the message,"
    },
    {
      "id": 80,
      "start": 351.4800109863281,
      "end": 353.55999755859375,
      "text": " but he did not believe."
    },
    {
      "id": 81,
      "start": 353.55999755859375,
      "end": 355.1600036621094,
      "text": " He did not believe."
    },
    {
      "id": 82,
      "start": 355.1600036621094,
      "end": 360.8399963378906,
      "text": " The Bible tells us that he concluded that really what was going on is the Syrians had"
    },
    {
      "id": 83,
      "start": 360.8399963378906,
      "end": 361.8399963378906,
      "text": " set a trap."
    },
    {
      "id": 84,
      "start": 361.8399963378906,
      "end": 364.5199890136719,
      "text": " And he says, here, I'm going to tell you what's going on."
    },
    {
      "id": 85,
      "start": 364.5199890136719,
      "end": 369.0,
      "text": " He tells them in verse number 12 that he said unto his servants, I will now show you what"
    },
    {
      "id": 86,
      "start": 369.0,
      "end": 372.5199890136719,
      "text": " the Syrians have done to us."
    },
    {
      "id": 87,
      "start": 372.5199890136719,
      "end": 378.4800109863281,
      "text": " They know that we be hungry, therefore are they gone out of the camp to hide themselves"
    },
    {
      "id": 88,
      "start": 378.4800109863281,
      "end": 384.0799865722656,
      "text": " in the field saying when they come out of the city, we shall catch them alive and get"
    },
    {
      "id": 89,
      "start": 384.0799865722656,
      "end": 385.3999938964844,
      "text": " into the city."
    },
    {
      "id": 90,
      "start": 385.3999938964844,
      "end": 389.55999755859375,
      "text": " So he believed that there was a trap that had been set, that the Syrians had devised"
    },
    {
      "id": 91,
      "start": 389.55999755859375,
      "end": 390.55999755859375,
      "text": " this plan."
    },
    {
      "id": 92,
      "start": 390.55999755859375,
      "end": 395.3800048828125,
      "text": " They knew that they had been successful at causing the city of Samaria to be without"
    },
    {
      "id": 93,
      "start": 395.3800048828125,
      "end": 399.32000732421875,
      "text": " and these inhabitants were hungry and they said, so here's what we'll do."
    },
    {
      "id": 94,
      "start": 399.32000732421875,
      "end": 403.6000061035156,
      "text": " We're going to go hide and then they'll come out of the city and we'll then be able to"
    },
    {
      "id": 95,
      "start": 403.6000061035156,
      "end": 405.0400085449219,
      "text": " take the city."
    },
    {
      "id": 96,
      "start": 405.0400085449219,
      "end": 407.8399963378906,
      "text": " And that was the conclusion that the king reached."
    },
    {
      "id": 97,
      "start": 407.8399963378906,
      "end": 413.1600036621094,
      "text": " We find, however, that there were some servants, the Bible says in verse number 13, that there"
    },
    {
      "id": 98,
      "start": 413.1600036621094,
      "end": 418.3999938964844,
      "text": " were some servants there and one of them answered the king and he really was pleading with the"
    },
    {
      "id": 99,
      "start": 418.3999938964844,
      "end": 420.0799865722656,
      "text": " king."
    },
    {
      "id": 100,
      "start": 420.0799865722656,
      "end": 427.1199951171875,
      "text": " And he says at the very end of the text, verse number 13, let us send and see."
    },
    {
      "id": 101,
      "start": 427.1199951171875,
      "end": 433.20001220703125,
      "text": " Let us at least go and investigate the claim that's been made by these four leprous men."
    },
    {
      "id": 102,
      "start": 433.2799987792969,
      "end": 440.2799987792969,
      "text": " I mean, we have heard these good tidings and the king concluded something entirely different"
    },
    {
      "id": 103,
      "start": 440.2799987792969,
      "end": 445.67999267578125,
      "text": " and yet there's this servant really, I believe, that's pleading with the king and he's saying,"
    },
    {
      "id": 104,
      "start": 445.67999267578125,
      "end": 449.8399963378906,
      "text": " let's just send a few messengers and let them go and see."
    },
    {
      "id": 105,
      "start": 449.8399963378906,
      "end": 451.9599914550781,
      "text": " And the king finally gives in."
    },
    {
      "id": 106,
      "start": 451.9599914550781,
      "end": 456.79998779296875,
      "text": " The king, according to verse number 14, he gives in and he sends out these messengers"
    },
    {
      "id": 107,
      "start": 456.79998779296875,
      "end": 458.9200134277344,
      "text": " to go verify the situation."
    },
    {
      "id": 108,
      "start": 458.9200134277344,
      "end": 464.0400085449219,
      "text": " It says, then took, therefore, two chariot horses and the king sent after the host of"
    },
    {
      "id": 109,
      "start": 464.0400085449219,
      "end": 467.9200134277344,
      "text": " the Syrians saying, go and see."
    },
    {
      "id": 110,
      "start": 467.9200134277344,
      "end": 474.9200134277344,
      "text": " Now I'm not sure if you can put your mind into each character throughout the passage"
    },
    {
      "id": 111,
      "start": 474.9200134277344,
      "end": 479.29998779296875,
      "text": " of Scripture that we deal with and looking at how the king was feeling and kind of put"
    },
    {
      "id": 112,
      "start": 479.29998779296875,
      "end": 484.7200012207031,
      "text": " yourself in his shoes and trying to evaluate the situation, put yourself in the servant's"
    },
    {
      "id": 113,
      "start": 484.7200012207031,
      "end": 487.8800048828125,
      "text": " shoes that's pleading to send some messengers."
    },
    {
      "id": 114,
      "start": 487.8800048828125,
      "end": 490.3599853515625,
      "text": " But now think about being one of the messengers."
    },
    {
      "id": 115,
      "start": 490.3599853515625,
      "end": 493.67999267578125,
      "text": " You've heard the report from the four leprous men."
    },
    {
      "id": 116,
      "start": 493.67999267578125,
      "end": 498.1600036621094,
      "text": " Perhaps you're aware of what they've concluded and what they've brought as these good tidings,"
    },
    {
      "id": 117,
      "start": 498.1600036621094,
      "end": 501.0799865722656,
      "text": " but you've also heard what the king said."
    },
    {
      "id": 118,
      "start": 501.0799865722656,
      "end": 502.67999267578125,
      "text": " And so you don't know what you're going to find."
    },
    {
      "id": 119,
      "start": 502.67999267578125,
      "end": 505.5199890136719,
      "text": " You're going out and you go and see."
    },
    {
      "id": 120,
      "start": 505.5199890136719,
      "end": 510.239990234375,
      "text": " And so we find in these first few verses of the text before us this evening, the doubt"
    },
    {
      "id": 121,
      "start": 510.239990234375,
      "end": 511.8399963378906,
      "text": " of the king."
    },
    {
      "id": 122,
      "start": 511.8399963378906,
      "end": 517.7000122070312,
      "text": " And we find as we move forward through the passage, the discovery of the messengers."
    },
    {
      "id": 123,
      "start": 518.52001953125,
      "end": 522.3800048828125,
      "text": " And the Bible tells us that they were given this responsibility to go and see."
    },
    {
      "id": 124,
      "start": 522.3800048828125,
      "end": 527.260009765625,
      "text": " And in verse number 15, it tells us, and they went after them unto Jordan."
    },
    {
      "id": 125,
      "start": 527.260009765625,
      "end": 536.219970703125,
      "text": " Notice what the Bible says, and lo, all the way was full of garments and vessels, which"
    },
    {
      "id": 126,
      "start": 536.219970703125,
      "end": 539.8200073242188,
      "text": " the Syrians had cast away in their haste."
    },
    {
      "id": 127,
      "start": 539.8200073242188,
      "end": 542.739990234375,
      "text": " And the messengers returned and told the king."
    },
    {
      "id": 128,
      "start": 542.739990234375,
      "end": 545.219970703125,
      "text": " So I want you to think about these messengers."
    },
    {
      "id": 129,
      "start": 545.219970703125,
      "end": 550.02001953125,
      "text": " And as they went, and the Bible tells us that the entire way, all the way, it was full"
    },
    {
      "id": 130,
      "start": 550.02001953125,
      "end": 551.8599853515625,
      "text": " of garments and vessels."
    },
    {
      "id": 131,
      "start": 551.8599853515625,
      "end": 557.8599853515625,
      "text": " Now remember, those four leprous men, the Bible tells us in verse number eight that"
    },
    {
      "id": 132,
      "start": 557.8599853515625,
      "end": 560.9400024414062,
      "text": " when they went out, they were at the uttermost part of the camp."
    },
    {
      "id": 133,
      "start": 560.9400024414062,
      "end": 566.1400146484375,
      "text": " They went into one tent, they did eat and drink, carried then silver and gold and raiment"
    },
    {
      "id": 134,
      "start": 566.1400146484375,
      "end": 567.8599853515625,
      "text": " and went and hid it."
    },
    {
      "id": 135,
      "start": 567.8599853515625,
      "end": 571.97998046875,
      "text": " Came again and entered into another tent and carried then also and went and hid it."
    },
    {
      "id": 136,
      "start": 571.97998046875,
      "end": 575.8200073242188,
      "text": " And so we find that these messengers are now sent on this mission."
    },
    {
      "id": 137,
      "start": 575.8200073242188,
      "end": 582.5399780273438,
      "text": " They have their marching orders, if you will, go and see, find out, verify that this claim"
    },
    {
      "id": 138,
      "start": 582.5399780273438,
      "end": 584.0999755859375,
      "text": " is really true."
    },
    {
      "id": 139,
      "start": 584.0999755859375,
      "end": 589.9400024414062,
      "text": " The king has his doubt, but then we find the discovery of these men, these messengers that"
    },
    {
      "id": 140,
      "start": 589.9400024414062,
      "end": 590.9400024414062,
      "text": " go out."
    },
    {
      "id": 141,
      "start": 590.9400024414062,
      "end": 593.3800048828125,
      "text": " They find that it's full of garments and vessels."
    },
    {
      "id": 142,
      "start": 593.3800048828125,
      "end": 595.9000244140625,
      "text": " There are no Syrians to be seen."
    },
    {
      "id": 143,
      "start": 595.9000244140625,
      "end": 600.219970703125,
      "text": " We know because we're reading the written, recorded Word of God."
    },
    {
      "id": 0,
      "start": 600.219970703125,
      "end": 605.4399704933167,
      "text": " that the Syrians fled because of what we mentioned in verse number six that the"
    },
    {
      "id": 1,
      "start": 605.4399704933167,
      "end": 609.5999708175659,
      "text": " Lord caused them to hear this great noise. And they fled and they left"
    },
    {
      "id": 2,
      "start": 609.5999708175659,
      "end": 613.5199708938599,
      "text": " everything. What was God doing? God was fulfilling the prophecy that He had"
    },
    {
      "id": 3,
      "start": 613.5199708938599,
      "end": 619.719970703125,
      "text": " given by the prophet Elisha. We know that God is able to do all things. He works in"
    },
    {
      "id": 4,
      "start": 619.719970703125,
      "end": 623.2799701690674,
      "text": " a number of different ways. We find that it's interesting as you study the"
    },
    {
      "id": 5,
      "start": 623.2799701690674,
      "end": 628.1199703216553,
      "text": " scriptures and you study the various accounts that God gives us that God"
    },
    {
      "id": 6,
      "start": 628.1199703216553,
      "end": 634.4999694824219,
      "text": " doesn't always work in the same way every time. But God always works. And we"
    },
    {
      "id": 7,
      "start": 634.4999694824219,
      "end": 640.4999694824219,
      "text": " find here that God is working and these messengers they find all of these"
    },
    {
      "id": 8,
      "start": 640.4999694824219,
      "end": 645.9399719238281,
      "text": " things. They find all of the substance. They find it just as the leper said. And"
    },
    {
      "id": 9,
      "start": 645.9399719238281,
      "end": 650.1999702453613,
      "text": " we find that the Bible tells us at the end of verse number 15 that the"
    },
    {
      "id": 10,
      "start": 650.1999702453613,
      "end": 657.4999694824219,
      "text": " messengers returned and told the king. Now I'd like to see the face of the king"
    },
    {
      "id": 11,
      "start": 657.5599708557129,
      "end": 663.9199714660645,
      "text": " when these messengers returned with their verifying this claim of"
    },
    {
      "id": 12,
      "start": 663.9199714660645,
      "end": 667.8799743652344,
      "text": " these leprous men. And they come back. I'm assuming that they come back with a"
    },
    {
      "id": 13,
      "start": 667.8799743652344,
      "end": 674.1599731445312,
      "text": " level of excitement. I'm assuming that they come back with a readiness of going"
    },
    {
      "id": 14,
      "start": 674.1599731445312,
      "end": 679.4799728393555,
      "text": " and spoiling because we find that as we read in verse number 16 this fulfilled"
    },
    {
      "id": 15,
      "start": 679.4799728393555,
      "end": 684.4799728393555,
      "text": " prophecy, it's recorded in verse 16 and again in verse number 18, we find the"
    },
    {
      "id": 16,
      "start": 684.4999694824219,
      "end": 689.219970703125,
      "text": " fulfillment of the prophecy. The Bible says, and the people went out. Now these"
    },
    {
      "id": 17,
      "start": 689.219970703125,
      "end": 695.339973449707,
      "text": " people were hungry. They had been dealing with this being besieged by the Syrians."
    },
    {
      "id": 18,
      "start": 695.339973449707,
      "end": 700.4999694824219,
      "text": " And we find that they went out and notice it says they spoiled the tents of"
    },
    {
      "id": 19,
      "start": 700.4999694824219,
      "end": 707.8999710083008,
      "text": " the Syrians. And then notice what it says. So a measure of fine flour was sold for"
    },
    {
      "id": 20,
      "start": 707.8999710083008,
      "end": 714.2999725341797,
      "text": " a shekel and two measures of barley for a shekel. And then notice this phrase"
    },
    {
      "id": 21,
      "start": 714.2999725341797,
      "end": 720.4799728393555,
      "text": " at the end of verse number 16, according to the word of the Lord. You remember"
    },
    {
      "id": 22,
      "start": 720.4799728393555,
      "end": 724.1199722290039,
      "text": " that it was Elisha that stood up in verse number one. We said in the"
    },
    {
      "id": 23,
      "start": 724.1199722290039,
      "end": 729.1199645996094,
      "text": " beginning even of our message this evening that this prophecy of provision,"
    },
    {
      "id": 24,
      "start": 729.1199645996094,
      "end": 736.2399749755859,
      "text": " it was a detailed prophecy. We find that he, Elisha, stood up and said, hear ye the"
    },
    {
      "id": 25,
      "start": 736.2399749755859,
      "end": 742.9799652099609,
      "text": " word of the Lord, thus saith the Lord. Notice tomorrow. Thus, he says, about this"
    },
    {
      "id": 26,
      "start": 742.9799652099609,
      "end": 748.8599700927734,
      "text": " time shall a measure of fine flour be sold for a shekel and two measures of"
    },
    {
      "id": 27,
      "start": 748.8599700927734,
      "end": 754.4799652099609,
      "text": " barley for a shekel in the gate of Samaria. How did Elisha know that?"
    },
    {
      "id": 28,
      "start": 754.4799652099609,
      "end": 761.3199768066406,
      "text": " Because God informed him. See, we serve the God that is eternal. He is, of course, he"
    },
    {
      "id": 29,
      "start": 761.3199768066406,
      "end": 766.1999664306641,
      "text": " transcends time. He knows the end from the beginning. And so this prophecy of"
    },
    {
      "id": 30,
      "start": 766.1999664306641,
      "end": 772.0399780273438,
      "text": " provision that was given, we can see that it could be given with exact details as"
    },
    {
      "id": 31,
      "start": 772.0599670410156,
      "end": 776.2999725341797,
      "text": " to what was going to happen. What was going to take place? It was going to be"
    },
    {
      "id": 32,
      "start": 776.2999725341797,
      "end": 781.9399719238281,
      "text": " this measure, as we find here, of fine flour for a shekel and two measures of"
    },
    {
      "id": 33,
      "start": 781.9399719238281,
      "end": 786.3799743652344,
      "text": " barley for a shekel. When was it going to happen? Tomorrow, about this time. Where"
    },
    {
      "id": 34,
      "start": 786.3799743652344,
      "end": 791.2599639892578,
      "text": " was it going to happen? At the gate of Samaria. And we find that the very"
    },
    {
      "id": 35,
      "start": 791.2599639892578,
      "end": 797.4599761962891,
      "text": " details in which God had given to Elisha, Elisha would speak those details and it"
    },
    {
      "id": 36,
      "start": 797.4799652099609,
      "end": 802.6799774169922,
      "text": " comes to pass according to the Word of the Lord. This encourages us because we"
    },
    {
      "id": 37,
      "start": 802.6799774169922,
      "end": 808.7399749755859,
      "text": " know that God always does what God says he will do. In fact, a prophet, as you"
    },
    {
      "id": 38,
      "start": 808.7399749755859,
      "end": 813.8399658203125,
      "text": " would study the Scriptures, if they would prophesy and it did not come to pass, it"
    },
    {
      "id": 39,
      "start": 813.8399658203125,
      "end": 818.6399688720703,
      "text": " was kind of a bad deal for them. They'd be put to death. But we know that Elisha"
    },
    {
      "id": 40,
      "start": 818.6399688720703,
      "end": 824.8399658203125,
      "text": " is a true prophet of God, and he's speaking the Word of God, and he stands"
    },
    {
      "id": 41,
      "start": 824.9799652099609,
      "end": 828.4599761962891,
      "text": " up with a level of confidence. We mentioned that when we studied the"
    },
    {
      "id": 42,
      "start": 828.4599761962891,
      "end": 833.8399658203125,
      "text": " prophecy a couple of weeks ago, and we spoke about the confidence that Elisha"
    },
    {
      "id": 43,
      "start": 833.8399658203125,
      "end": 839.9799652099609,
      "text": " had. And see, the reality today is that we have the complete canon of Scripture. We"
    },
    {
      "id": 44,
      "start": 839.9799652099609,
      "end": 844.8199768066406,
      "text": " have truth that God has given us with regard to these last days in which we're"
    },
    {
      "id": 45,
      "start": 844.8199768066406,
      "end": 849.4399719238281,
      "text": " living. We have truth that God has given us with regard to eschatology and the"
    },
    {
      "id": 46,
      "start": 849.4399719238281,
      "end": 854.0999755859375,
      "text": " last days and the things that are going to still come to pass. We have the truth"
    },
    {
      "id": 47,
      "start": 854.0999755859375,
      "end": 859.4399719238281,
      "text": " that Jesus Christ said, I will come again, and we can be very confident about"
    },
    {
      "id": 48,
      "start": 859.4399719238281,
      "end": 864.8799743652344,
      "text": " that. We don't have to kind of, well, I think, no, he said he's gonna come again,"
    },
    {
      "id": 49,
      "start": 864.8799743652344,
      "end": 870.2399597167969,
      "text": " and we believe him. Why? Because he always does what he says he's going to do. We"
    },
    {
      "id": 50,
      "start": 870.2399597167969,
      "end": 873.7999572753906,
      "text": " can read throughout the pages of Scripture, and we can see fulfilled"
    },
    {
      "id": 51,
      "start": 873.7999572753906,
      "end": 878.4399719238281,
      "text": " prophecy after fulfilled prophecy. We can see it in the life and ministry of the"
    },
    {
      "id": 52,
      "start": 878.4399719238281,
      "end": 882.719970703125,
      "text": " Lord Jesus Christ, and he gave his very word that he's coming again. I am"
    },
    {
      "id": 53,
      "start": 882.7399597167969,
      "end": 887.8199768066406,
      "text": " understanding the Word of God to teach that the rapture is imminent. I mean, it"
    },
    {
      "id": 54,
      "start": 887.8199768066406,
      "end": 893.3999633789062,
      "text": " could happen at any moment. We sing songs such as, listen for the trumpet, Jesus is"
    },
    {
      "id": 55,
      "start": 893.3999633789062,
      "end": 898.4999694824219,
      "text": " coming again, and we are absolutely assured of this truth. We understand that"
    },
    {
      "id": 56,
      "start": 898.4999694824219,
      "end": 903.1399841308594,
      "text": " after that there will be a tribulation, seven years. There will be judgment that"
    },
    {
      "id": 57,
      "start": 903.1399841308594,
      "end": 907.219970703125,
      "text": " will be poured out upon the earth. We read about all of those judgments"
    },
    {
      "id": 58,
      "start": 907.219970703125,
      "end": 912.1799621582031,
      "text": " throughout the book of Revelation. There will be a judgment seat of Christ. There"
    },
    {
      "id": 59,
      "start": 912.1999816894531,
      "end": 917.3599853515625,
      "text": " will be a marriage supper of the Lamb. There will be a great white throne. There"
    },
    {
      "id": 60,
      "start": 917.3599853515625,
      "end": 922.3199768066406,
      "text": " will be all of eternity. We can be sure of it. We can be confident of it. Why?"
    },
    {
      "id": 61,
      "start": 922.3199768066406,
      "end": 928.6799621582031,
      "text": " Because God's given us his Word, and we can, well, you remember there were"
    },
    {
      "id": 62,
      "start": 928.6799621582031,
      "end": 933.8799743652344,
      "text": " scoffers in those days. Peter deals with that in 2 Peter chapter number 3 when he"
    },
    {
      "id": 63,
      "start": 933.8799743652344,
      "end": 939.0399780273438,
      "text": " speaks specifically about the return of the Lord Jesus Christ, and it tells us in"
    },
    {
      "id": 64,
      "start": 939.0399780273438,
      "end": 943.8999633789062,
      "text": " 2 Peter chapter number 3, in verse number 3, in fact, knowing this verse,"
    },
    {
      "id": 65,
      "start": 943.8999633789062,
      "end": 948.6999816894531,
      "text": " that there shall come in the last days scoffers walking after their own lust."
    },
    {
      "id": 66,
      "start": 948.6999816894531,
      "end": 952.3799743652344,
      "text": " And what is it that they're going to say? Well, according to verse number 4, where"
    },
    {
      "id": 67,
      "start": 952.3799743652344,
      "end": 957.4999694824219,
      "text": " is the promise of his coming? You know what that tells me? They've heard that"
    },
    {
      "id": 68,
      "start": 957.4999694824219,
      "end": 963.3399658203125,
      "text": " Jesus is going to come, but they don't believe it. They're scoffers. They're"
    },
    {
      "id": 69,
      "start": 963.3999633789062,
      "end": 970.5599670410156,
      "text": " mockers. We find that they use their faulty logic. They are willingly ignorant"
    },
    {
      "id": 70,
      "start": 970.5599670410156,
      "end": 976.8399658203125,
      "text": " according to verse number 5, but we find that the answer comes, the Lord is not"
    },
    {
      "id": 71,
      "start": 976.8399658203125,
      "end": 981.3999633789062,
      "text": " slack concerning his promise, as some men count slackness. But as longsuffering to"
    },
    {
      "id": 72,
      "start": 981.3999633789062,
      "end": 984.3599853515625,
      "text": " us were not willing that any should perish, but that all should come to"
    },
    {
      "id": 73,
      "start": 984.3599853515625,
      "end": 989.1599731445312,
      "text": " repentance. In verse number 9, it says in verse number 10, the day of the Lord will"
    },
    {
      "id": 74,
      "start": 989.219970703125,
      "end": 995.0199584960938,
      "text": " come as a thief in the night. I mean, it's certain. It's absolutely positive, and we"
    },
    {
      "id": 75,
      "start": 995.0199584960938,
      "end": 999.7399597167969,
      "text": " can have confidence. When we place our faith and trust in the truth of this"
    },
    {
      "id": 76,
      "start": 999.7399597167969,
      "end": 1005.6999816894531,
      "text": " book, we can have absolute confidence in what God says, knowing that it will come"
    },
    {
      "id": 77,
      "start": 1005.6999816894531,
      "end": 1011.97998046875,
      "text": " to pass. We find that Elisha makes this declaration, and we find that this"
    },
    {
      "id": 78,
      "start": 1011.97998046875,
      "end": 1016.8199768066406,
      "text": " prophecy is recorded, and it comes to pass according to the word of the Lord."
    },
    {
      "id": 79,
      "start": 1016.8399658203125,
      "end": 1021.3799743652344,
      "text": " Notice in verse number 18, and it came to pass as the man of God had spoken to the"
    },
    {
      "id": 80,
      "start": 1021.3799743652344,
      "end": 1025.5199584960938,
      "text": " king, saying, two measures of barley for a shekel and a measure of fine flour for"
    },
    {
      "id": 81,
      "start": 1025.5199584960938,
      "end": 1030.47998046875,
      "text": " a shekel shall be tomorrow about this time in the gate of Samaria, and that's"
    },
    {
      "id": 82,
      "start": 1030.47998046875,
      "end": 1034.1999816894531,
      "text": " exactly what happened. And here's what's happening, is there's the rehearsing, if"
    },
    {
      "id": 83,
      "start": 1034.1999816894531,
      "end": 1039.1199645996094,
      "text": " you will, of the prophecy there in verse number 18, that this was going to happen."
    },
    {
      "id": 84,
      "start": 1039.1199645996094,
      "end": 1046.2399597167969,
      "text": " And what happens now is God is going to remind us of that one servant that"
    },
    {
      "id": 85,
      "start": 1046.2599792480469,
      "end": 1052.47998046875,
      "text": " was kind of mocking and scoffing at the prophecy of Elisha, that prophecy of"
    },
    {
      "id": 86,
      "start": 1052.47998046875,
      "end": 1056.6799621582031,
      "text": " provision, and so we move from the doubt of the king to the discovery of the"
    },
    {
      "id": 87,
      "start": 1056.6799621582031,
      "end": 1060.8199768066406,
      "text": " messengers, and then notice with me number three, the death of the servant."
    },
    {
      "id": 88,
      "start": 1060.8199768066406,
      "end": 1064.9399719238281,
      "text": " The death of the servant. We read in verse number 17 that the Bible says that"
    },
    {
      "id": 89,
      "start": 1064.9399719238281,
      "end": 1069.97998046875,
      "text": " the king appointed the Lord on whose hand he leaned"
    },
    {
      "id": 90,
      "start": 1069.97998046875,
      "end": 1074.5799560546875,
      "text": " to have the charge of the gate. The people trod upon him in the gate, and he"
    },
    {
      "id": 91,
      "start": 1074.6399841308594,
      "end": 1080.0399780273438,
      "text": " died, as the man of God had said, who spake when the king came down to him. Do"
    },
    {
      "id": 92,
      "start": 1080.0399780273438,
      "end": 1083.4599609375,
      "text": " you remember what he said? It's recorded again for us in verse number 19, and the"
    },
    {
      "id": 93,
      "start": 1083.4599609375,
      "end": 1087.9599609375,
      "text": " Lord answered the man of God. Elisha stands up, and he makes that prophecy. He"
    },
    {
      "id": 94,
      "start": 1087.9599609375,
      "end": 1095.2799682617188,
      "text": " delivers the the word of the Lord, and this man responds to Elisha and says, as"
    },
    {
      "id": 95,
      "start": 1095.2799682617188,
      "end": 1102.8599853515625,
      "text": " we read in verse number 19, behold, if the Lord should make windows in heaven, might"
    },
    {
      "id": 96,
      "start": 1102.8599853515625,
      "end": 1111.5599670410156,
      "text": " such a thing be. And he, that's Elisha, said unto this servant, behold, thou"
    },
    {
      "id": 97,
      "start": 1111.5599670410156,
      "end": 1119.1599731445312,
      "text": " shalt see it with thine eyes, but shalt not eat thereof. And so it fell out unto"
    },
    {
      "id": 98,
      "start": 1119.1599731445312,
      "end": 1126.1199951171875,
      "text": " him, for the people trod upon him in the gate, and he died. Now, we mentioned a few"
    },
    {
      "id": 99,
      "start": 1126.1199951171875,
      "end": 1131.3599853515625,
      "text": " weeks ago as we studied verses 1 and 2 of 2 Kings 7, and we dealt with the way"
    },
    {
      "id": 100,
      "start": 1131.3599853515625,
      "end": 1136.7799682617188,
      "text": " in which this man replied to Elisha, and we mentioned that it was evident that he"
    },
    {
      "id": 101,
      "start": 1136.7799682617188,
      "end": 1143.4199829101562,
      "text": " was coming with an attitude of being a scoffer, at mocking the man of God, and we"
    },
    {
      "id": 102,
      "start": 1143.4199829101562,
      "end": 1148.4599609375,
      "text": " understand that because of the demise of this man, what happens. We find that"
    },
    {
      "id": 103,
      "start": 1148.4599609375,
      "end": 1154.0999755859375,
      "text": " Elisha announced that this man would, he would see it with his eyes, but that he"
    },
    {
      "id": 104,
      "start": 1154.0999755859375,
      "end": 1159.1799926757812,
      "text": " would not taste it, he would not eat it, he would not have the privilege of"
    },
    {
      "id": 105,
      "start": 1159.1799926757812,
      "end": 1164.43994140625,
      "text": " partaking of that sustenance, that substance that would be found, as they"
    },
    {
      "id": 106,
      "start": 1164.43994140625,
      "end": 1170.3999633789062,
      "text": " would spoil the tents of the Syrians. They said that it was going to be"
    },
    {
      "id": 107,
      "start": 1170.3999633789062,
      "end": 1174.3199462890625,
      "text": " specific, a measure of fine flour for a shekel, two measures of barley for a"
    },
    {
      "id": 108,
      "start": 1174.3199462890625,
      "end": 1178.1599731445312,
      "text": " shekel. He told him the time, tomorrow about this time, and he told him where,"
    },
    {
      "id": 109,
      "start": 1178.1599731445312,
      "end": 1181.9599609375,
      "text": " at the gate of Samaria. And it's interesting because the king appointed"
    },
    {
      "id": 110,
      "start": 1181.9599609375,
      "end": 1186.3199462890625,
      "text": " the Lord, according to verse number 17, on whose hand he leaned, to have the charge"
    },
    {
      "id": 111,
      "start": 1186.5799560546875,
      "end": 1190.2999877929688,
      "text": " what? Of the gate. Well that's where all the stuff was happening. I mean, these"
    },
    {
      "id": 112,
      "start": 1190.2999877929688,
      "end": 1194.0999755859375,
      "text": " people are hungry. Can you see? I mean, you ever been out Black Friday shopping?"
    },
    {
      "id": 113,
      "start": 1194.0999755859375,
      "end": 1198.2999877929688,
      "text": " It's insane, right? People trying to run people over to get something. Well,"
    },
    {
      "id": 114,
      "start": 1198.2999877929688,
      "end": 1202.1799926757812,
      "text": " this was, I mean, this was..."
    },
    {
      "id": 0,
      "start": 1202.1799926757812,
      "end": 1205.6799926757812,
      "text": " is that times 1,000 probably,"
    },
    {
      "id": 1,
      "start": 1205.6799926757812,
      "end": 1207.1399927139282,
      "text": " because what you're seeing"
    },
    {
      "id": 2,
      "start": 1207.1399927139282,
      "end": 1209.5999927520752,
      "text": " is a bunch of people that have been starving"
    },
    {
      "id": 3,
      "start": 1209.5999927520752,
      "end": 1211.3399925231934,
      "text": " and they're hopeless and helpless,"
    },
    {
      "id": 4,
      "start": 1211.3399925231934,
      "end": 1212.8399925231934,
      "text": " and now there's substance."
    },
    {
      "id": 5,
      "start": 1212.8399925231934,
      "end": 1214.7999925613403,
      "text": " Now there's something that's available."
    },
    {
      "id": 6,
      "start": 1214.7999925613403,
      "end": 1216.7199926376343,
      "text": " And we find that the Bible tells us"
    },
    {
      "id": 7,
      "start": 1216.7199926376343,
      "end": 1220.6799926757812,
      "text": " that the people trod upon Him in the gate"
    },
    {
      "id": 8,
      "start": 1220.6799926757812,
      "end": 1222.939992904663,
      "text": " and He died."
    },
    {
      "id": 9,
      "start": 1222.939992904663,
      "end": 1226.6799926757812,
      "text": " It's tragic what happened to this man."
    },
    {
      "id": 10,
      "start": 1226.6799926757812,
      "end": 1229.6799926757812,
      "text": " We find this scoffer,"
    },
    {
      "id": 11,
      "start": 1229.6799926757812,
      "end": 1235.0999908447266,
      "text": " this one that was mocking the prophecy of Elisha."
    },
    {
      "id": 12,
      "start": 1235.0999908447266,
      "end": 1237.0599937438965,
      "text": " Oh, really, Elisha?"
    },
    {
      "id": 13,
      "start": 1237.0599937438965,
      "end": 1239.0199928283691,
      "text": " I mean, do you not know what's going on?"
    },
    {
      "id": 14,
      "start": 1239.0199928283691,
      "end": 1241.5999908447266,
      "text": " I understand that that's not what the Scriptures say,"
    },
    {
      "id": 15,
      "start": 1241.5999908447266,
      "end": 1243.7199935913086,
      "text": " but I get in my mind's eye"
    },
    {
      "id": 16,
      "start": 1243.7199935913086,
      "end": 1246.3399925231934,
      "text": " as I see the words of this man"
    },
    {
      "id": 17,
      "start": 1246.3399925231934,
      "end": 1249.0599937438965,
      "text": " and I see the end of this man."
    },
    {
      "id": 18,
      "start": 1249.0599937438965,
      "end": 1250.7199935913086,
      "text": " We find that he says,"
    },
    {
      "id": 19,
      "start": 1250.7199935913086,
      "end": 1252.8799934387207,
      "text": " if the Lord would make windows in heaven,"
    },
    {
      "id": 20,
      "start": 1252.8799934387207,
      "end": 1254.0599937438965,
      "text": " might this thing be?"
    },
    {
      "id": 21,
      "start": 1254.0599937438965,
      "end": 1257.9399909973145,
      "text": " He's mocking. He's a scoffer."
    },
    {
      "id": 22,
      "start": 1257.9799919128418,
      "end": 1260.7799911499023,
      "text": " We find the death of the servant."
    },
    {
      "id": 23,
      "start": 1260.7799911499023,
      "end": 1262.8199920654297,
      "text": " As we look through the passage of Scripture"
    },
    {
      "id": 24,
      "start": 1262.8199920654297,
      "end": 1264.9799919128418,
      "text": " and we end, we can rejoice in understanding"
    },
    {
      "id": 25,
      "start": 1264.9799919128418,
      "end": 1269.239990234375,
      "text": " that the Lord provided just as He said He would."
    },
    {
      "id": 26,
      "start": 1269.239990234375,
      "end": 1273.3199920654297,
      "text": " Remember, it was at the end of chapter 6."
    },
    {
      "id": 27,
      "start": 1273.3199920654297,
      "end": 1275.2799911499023,
      "text": " The Bible tells us in v. 33,"
    },
    {
      "id": 28,
      "start": 1275.2799911499023,
      "end": 1276.979995727539,
      "text": " and while He yet talked with them,"
    },
    {
      "id": 29,
      "start": 1276.979995727539,
      "end": 1278.9399948120117,
      "text": " behold, the messenger came down unto Him"
    },
    {
      "id": 30,
      "start": 1278.9399948120117,
      "end": 1281.7799911499023,
      "text": " and He said, behold, this evil is of the Lord."
    },
    {
      "id": 31,
      "start": 1281.7799911499023,
      "end": 1284.5199890136719,
      "text": " What should I wait for the Lord any longer?"
    },
    {
      "id": 32,
      "start": 1284.5199890136719,
      "end": 1287.1599960327148,
      "text": " The king didn't want to wait any longer."
    },
    {
      "id": 33,
      "start": 1287.1999893188477,
      "end": 1290.1599960327148,
      "text": " Elisha says, tomorrow, about this time,"
    },
    {
      "id": 34,
      "start": 1290.1599960327148,
      "end": 1292.6999893188477,
      "text": " here's what's going to happen."
    },
    {
      "id": 35,
      "start": 1292.6999893188477,
      "end": 1295.0399932861328,
      "text": " We find that God fulfilled."
    },
    {
      "id": 36,
      "start": 1295.0399932861328,
      "end": 1300.239990234375,
      "text": " God did exactly what He said He would."
    },
    {
      "id": 37,
      "start": 1300.239990234375,
      "end": 1304.4199905395508,
      "text": " It's unusual how He accomplished His will."
    },
    {
      "id": 38,
      "start": 1304.4199905395508,
      "end": 1307.1599960327148,
      "text": " I mean, can you imagine a mighty army,"
    },
    {
      "id": 39,
      "start": 1307.1599960327148,
      "end": 1309.8799896240234,
      "text": " the Syrians, being scared away"
    },
    {
      "id": 40,
      "start": 1309.8799896240234,
      "end": 1312.1599960327148,
      "text": " because of a noise that they heard?"
    },
    {
      "id": 41,
      "start": 1312.1599960327148,
      "end": 1313.4999923706055,
      "text": " God calls them to hear a noise."
    },
    {
      "id": 42,
      "start": 1313.4999923706055,
      "end": 1315.5799942016602,
      "text": " I mean, it was serious."
    },
    {
      "id": 43,
      "start": 1315.6199951171875,
      "end": 1317.4199905395508,
      "text": " God provided."
    },
    {
      "id": 44,
      "start": 1317.4199905395508,
      "end": 1320.5399932861328,
      "text": " See, I like, as we look through the Scriptures"
    },
    {
      "id": 45,
      "start": 1320.5399932861328,
      "end": 1322.6599960327148,
      "text": " and even as we examine our own lives,"
    },
    {
      "id": 46,
      "start": 1322.6599960327148,
      "end": 1324.9999923706055,
      "text": " it's so encouraging when we have the opportunity"
    },
    {
      "id": 47,
      "start": 1324.9999923706055,
      "end": 1327.8799896240234,
      "text": " to see God work in such a way"
    },
    {
      "id": 48,
      "start": 1327.8799896240234,
      "end": 1331.4599914550781,
      "text": " that it can only be that God did it."
    },
    {
      "id": 49,
      "start": 1331.4599914550781,
      "end": 1334.2999877929688,
      "text": " See, there was no way possible"
    },
    {
      "id": 50,
      "start": 1334.2999877929688,
      "end": 1336.2999877929688,
      "text": " that the inhabitants of Samaria,"
    },
    {
      "id": 51,
      "start": 1336.2999877929688,
      "end": 1338.6599884033203,
      "text": " these hopeless and helpless,"
    },
    {
      "id": 52,
      "start": 1338.6599884033203,
      "end": 1340.7999877929688,
      "text": " these desperate individuals,"
    },
    {
      "id": 53,
      "start": 1340.7999877929688,
      "end": 1342.3799896240234,
      "text": " there was no way that they could bring this"
    },
    {
      "id": 54,
      "start": 1342.3799896240234,
      "end": 1344.6599884033203,
      "text": " to pass on their own."
    },
    {
      "id": 55,
      "start": 1344.6599884033203,
      "end": 1346.5399932861328,
      "text": " And yet, God worked."
    },
    {
      "id": 56,
      "start": 1346.5399932861328,
      "end": 1347.9199981689453,
      "text": " And see, our God is able to do"
    },
    {
      "id": 57,
      "start": 1347.9199981689453,
      "end": 1349.6599884033203,
      "text": " as we often quote Ephesians 3"
    },
    {
      "id": 58,
      "start": 1349.6599884033203,
      "end": 1350.5399932861328,
      "text": " in verse number 20,"
    },
    {
      "id": 59,
      "start": 1350.5399932861328,
      "end": 1353.5,
      "text": " exceeding abundantly above all that we ask or think."
    },
    {
      "id": 60,
      "start": 1353.5,
      "end": 1356.1599884033203,
      "text": " The king doubted."
    },
    {
      "id": 61,
      "start": 1356.1599884033203,
      "end": 1360.0799865722656,
      "text": " But what was being communicated to him"
    },
    {
      "id": 62,
      "start": 1360.0799865722656,
      "end": 1362.1599884033203,
      "text": " from those four leprous men to the porter"
    },
    {
      "id": 63,
      "start": 1362.1599884033203,
      "end": 1366.2999877929688,
      "text": " to his home was that God had worked."
    },
    {
      "id": 64,
      "start": 1366.2999877929688,
      "end": 1369.6999969482422,
      "text": " And see, today, God still works."
    },
    {
      "id": 65,
      "start": 1369.6999969482422,
      "end": 1371.239990234375,
      "text": " God's still on His throne."
    },
    {
      "id": 66,
      "start": 1371.239990234375,
      "end": 1372.5399932861328,
      "text": " God's still eternal."
    },
    {
      "id": 67,
      "start": 1372.5399932861328,
      "end": 1373.739990234375,
      "text": " He's still omnipotent."
    },
    {
      "id": 68,
      "start": 1373.739990234375,
      "end": 1375.3199920654297,
      "text": " He's still able."
    },
    {
      "id": 69,
      "start": 1375.3199920654297,
      "end": 1379.0399932861328,
      "text": " We find that God works in very specific ways"
    },
    {
      "id": 70,
      "start": 1379.0399932861328,
      "end": 1381.1199951171875,
      "text": " and He works in ways in which He alone"
    },
    {
      "id": 71,
      "start": 1381.1199951171875,
      "end": 1382.8999938964844,
      "text": " would be glorified."
    },
    {
      "id": 72,
      "start": 1382.8999938964844,
      "end": 1385.5399932861328,
      "text": " We see it throughout all of the Scripture."
    },
    {
      "id": 73,
      "start": 1385.5399932861328,
      "end": 1388.8999938964844,
      "text": " And oh, we can rest assured this evening"
    },
    {
      "id": 74,
      "start": 1388.8999938964844,
      "end": 1392.2799987792969,
      "text": " that God will always do what God said He will do."
    },
    {
      "id": 75,
      "start": 1392.2799987792969,
      "end": 1394.0799865722656,
      "text": " And I am so thankful that as we read"
    },
    {
      "id": 76,
      "start": 1394.0799865722656,
      "end": 1396.8199920654297,
      "text": " a passage of Scripture in the life of Elisha"
    },
    {
      "id": 77,
      "start": 1396.8199920654297,
      "end": 1398.1199951171875,
      "text": " and we see what's taking place"
    },
    {
      "id": 78,
      "start": 1398.1199951171875,
      "end": 1400.3199920654297,
      "text": " to reference what we said in the very beginning,"
    },
    {
      "id": 79,
      "start": 1400.3199920654297,
      "end": 1402.0799865722656,
      "text": " Elisha didn't have to be so concerned"
    },
    {
      "id": 80,
      "start": 1402.1199951171875,
      "end": 1404.239990234375,
      "text": " with how God was going to do it."
    },
    {
      "id": 81,
      "start": 1404.239990234375,
      "end": 1406.2799987792969,
      "text": " He just needed to know that it was God"
    },
    {
      "id": 82,
      "start": 1406.2799987792969,
      "end": 1408.1599884033203,
      "text": " who said He would do it."
    },
    {
      "id": 83,
      "start": 1408.1599884033203,
      "end": 1411.6999969482422,
      "text": " And we focus on who, not how."
    },
    {
      "id": 84,
      "start": 1411.6999969482422,
      "end": 1414.4199981689453,
      "text": " Remember, it was Paul that was there shipwrecked"
    },
    {
      "id": 85,
      "start": 1414.4199981689453,
      "end": 1417.6199951171875,
      "text": " in Acts 27 and we referenced that passage"
    },
    {
      "id": 86,
      "start": 1417.6199951171875,
      "end": 1419.2799987792969,
      "text": " of Scripture a few weeks ago."
    },
    {
      "id": 87,
      "start": 1419.2799987792969,
      "end": 1422.1599884033203,
      "text": " And I mean, it was a bad situation."
    },
    {
      "id": 88,
      "start": 1422.1599884033203,
      "end": 1425.6999969482422,
      "text": " Uruk-Hidem was upon them, that terrible storm."
    },
    {
      "id": 89,
      "start": 1425.6999969482422,
      "end": 1427.5399932861328,
      "text": " They were wishing for the day."
    },
    {
      "id": 90,
      "start": 1427.5399932861328,
      "end": 1429.4199981689453,
      "text": " They had not seen the moon, the sun,"
    },
    {
      "id": 91,
      "start": 1429.4199981689453,
      "end": 1431.1599884033203,
      "text": " the stars in a number of days."
    },
    {
      "id": 92,
      "start": 1431.1999969482422,
      "end": 1433.739990234375,
      "text": " All hope was gone that they would be saved."
    },
    {
      "id": 93,
      "start": 1434.8999938964844,
      "end": 1439.0,
      "text": " And yet God came and delivered a message to Paul."
    },
    {
      "id": 94,
      "start": 1439.0,
      "end": 1440.3599853515625,
      "text": " What does Paul say?"
    },
    {
      "id": 95,
      "start": 1440.3599853515625,
      "end": 1442.1599884033203,
      "text": " I believe God."
    },
    {
      "id": 96,
      "start": 1442.1599884033203,
      "end": 1445.3999938964844,
      "text": " I don't need to know how God's gonna spare us,"
    },
    {
      "id": 97,
      "start": 1445.3999938964844,
      "end": 1447.479995727539,
      "text": " but I just know that God is,"
    },
    {
      "id": 98,
      "start": 1447.479995727539,
      "end": 1449.739990234375,
      "text": " because God said that He would."
    },
    {
      "id": 99,
      "start": 1449.739990234375,
      "end": 1451.4399871826172,
      "text": " Our God is able."
    },
    {
      "id": 100,
      "start": 1451.4399871826172,
      "end": 1454.6599884033203,
      "text": " And we need to focus on who, not how."
    },
    {
      "id": 101,
      "start": 1454.6599884033203,
      "end": 1458.0399932861328,
      "text": " So often I think we get kinda twisted up, if you will,"
    },
    {
      "id": 102,
      "start": 1458.0399932861328,
      "end": 1459.239990234375,
      "text": " because we're always trying to figure out"
    },
    {
      "id": 103,
      "start": 1459.239990234375,
      "end": 1461.2799987792969,
      "text": " how God's gonna do something,"
    },
    {
      "id": 104,
      "start": 1461.2799987792969,
      "end": 1463.3599853515625,
      "text": " instead of just understanding that God can do it"
    },
    {
      "id": 105,
      "start": 1463.3599853515625,
      "end": 1465.2799987792969,
      "text": " however He wants to do it."
    },
    {
      "id": 106,
      "start": 1465.2799987792969,
      "end": 1467.1199951171875,
      "text": " And most times He does it in a way"
    },
    {
      "id": 107,
      "start": 1467.1199951171875,
      "end": 1470.1600036621094,
      "text": " that only He will be glorified."
    },
    {
      "id": 108,
      "start": 1470.1600036621094,
      "end": 1471.0799865722656,
      "text": " Father, we love You."
    },
    {
      "id": 109,
      "start": 1471.0799865722656,
      "end": 1472.8999938964844,
      "text": " We thank You for loving us."
    },
    {
      "id": 110,
      "start": 1472.8999938964844,
      "end": 1476.9400024414062,
      "text": " Thank You for Thy Word, the truth contained therein."
    },
    {
      "id": 111,
      "start": 1476.9400024414062,
      "end": 1479.1600036621094,
      "text": " We pray, Lord, that You would help us"
    },
    {
      "id": 112,
      "start": 1479.1600036621094,
      "end": 1480.6600036621094,
      "text": " to be encouraged this evening,"
    },
    {
      "id": 113,
      "start": 1480.6600036621094,
      "end": 1483.0799865722656,
      "text": " to be reminded once again that You always do"
    },
    {
      "id": 114,
      "start": 1483.0799865722656,
      "end": 1484.7799987792969,
      "text": " what You say You will do,"
    },
    {
      "id": 115,
      "start": 1484.7799987792969,
      "end": 1489.0799865722656,
      "text": " even as we quickly reviewed some promises"
    },
    {
      "id": 116,
      "start": 1489.0799865722656,
      "end": 1491.3399963378906,
      "text": " that You've given us concerning the end times"
    },
    {
      "id": 117,
      "start": 1491.3399963378906,
      "end": 1494.239990234375,
      "text": " and looking at some of these things that we know"
    },
    {
      "id": 118,
      "start": 1494.239990234375,
      "end": 1495.5,
      "text": " will soon come to pass."
    },
    {
      "id": 119,
      "start": 1495.5,
      "end": 1497.5,
      "text": " Lord, I pray that You would help us"
    },
    {
      "id": 120,
      "start": 1497.5,
      "end": 1499.1600036621094,
      "text": " to have a level of confidence"
    },
    {
      "id": 121,
      "start": 1499.1600036621094,
      "end": 1503.4199829101562,
      "text": " in knowing that You will do what You said You will do."
    },
    {
      "id": 122,
      "start": 1503.4199829101562,
      "end": 1507.0399780273438,
      "text": " Father, I pray that You would work in and through our lives,"
    },
    {
      "id": 123,
      "start": 1507.0399780273438,
      "end": 1508.5399780273438,
      "text": " that You would work in such a way"
    },
    {
      "id": 124,
      "start": 1508.5399780273438,
      "end": 1510.8399963378906,
      "text": " that You alone would be glorified."
    },
    {
      "id": 125,
      "start": 1510.8399963378906,
      "end": 1513.0399780273438,
      "text": " Each one within our congregation"
    },
    {
      "id": 126,
      "start": 1513.0399780273438,
      "end": 1516.5,
      "text": " has unique circumstances and unique situations"
    },
    {
      "id": 127,
      "start": 1516.5,
      "end": 1517.7599792480469,
      "text": " in which they're dealing with."
    },
    {
      "id": 128,
      "start": 1517.7999877929688,
      "end": 1520.3800048828125,
      "text": " And God, we pray that You'd be glorified"
    },
    {
      "id": 129,
      "start": 1520.3800048828125,
      "end": 1522.1399841308594,
      "text": " in each of our lives."
    },
    {
      "id": 130,
      "start": 1522.1399841308594,
      "end": 1524.1799926757812,
      "text": " We thank You that You hear and answer prayer."
    },
    {
      "id": 131,
      "start": 1524.1799926757812,
      "end": 1527.3399963378906,
      "text": " We thank You that You are the Lord God Almighty."
    },
    {
      "id": 132,
      "start": 1527.3399963378906,
      "end": 1529.1000061035156,
      "text": " We pray that You'd bless our time of prayer."
    },
    {
      "id": 133,
      "start": 1529.1000061035156,
      "end": 1531.2999877929688,
      "text": " We thank You for the privilege."
    },
    {
      "id": 134,
      "start": 1531.2999877929688,
      "end": 1535.1000061035156,
      "text": " We pray that as we here at the church house pray together,"
    },
    {
      "id": 135,
      "start": 1535.1000061035156,
      "end": 1537.7599792480469,
      "text": " I pray that our season of prayer would be sweet."
    },
    {
      "id": 136,
      "start": 1537.7599792480469,
      "end": 1539.2599792480469,
      "text": " Lord, I pray for each family,"
    },
    {
      "id": 137,
      "start": 1539.2599792480469,
      "end": 1542.3399963378906,
      "text": " each individual that's tuned in to watch this evening."
    },
    {
      "id": 138,
      "start": 1542.3399963378906,
      "end": 1544.97998046875,
      "text": " Lord, I pray that as we conclude the live stream,"
    },
    {
      "id": 139,
      "start": 1544.97998046875,
      "end": 1547.6399841308594,
      "text": " that they would spend time in prayer at home."
    },
    {
      "id": 140,
      "start": 1547.6399841308594,
      "end": 1551.7200012207031,
      "text": " Lord, that You would work as only You can."
    },
    {
      "id": 141,
      "start": 1551.7200012207031,
      "end": 1555.9400024414062,
      "text": " We know that You have given us the privilege of prayer."
    },
    {
      "id": 142,
      "start": 1555.9400024414062,
      "end": 1558.47998046875,
      "text": " We know the power of prayer."
    },
    {
      "id": 143,
      "start": 1558.47998046875,
      "end": 1561.1399841308594,
      "text": " I pray, Lord, that we would honor You"
    },
    {
      "id": 144,
      "start": 1561.1399841308594,
      "end": 1563.7799987792969,
      "text": " and show our dependence upon Thee"
    },
    {
      "id": 145,
      "start": 1563.7799987792969,
      "end": 1566.2200012207031,
      "text": " as we seek Your face in prayer."
    },
    {
      "id": 146,
      "start": 1566.2200012207031,
      "end": 1568.3599853515625,
      "text": " We'll give You honor and glory for all that You'll do."
    },
    {
      "id": 147,
      "start": 1568.3599853515625,
      "end": 1571.2200012207031,
      "text": " We do ask that You would bless the AWANA meetings."
    },
    {
      "id": 148,
      "start": 1571.2200012207031,
      "end": 1573.47998046875,
      "text": " I thank You for each of our teachers and workers"
    },
    {
      "id": 149,
      "start": 1573.47998046875,
      "end": 1576.97998046875,
      "text": " who have been faithful to continue"
    },
    {
      "id": 150,
      "start": 1576.97998046875,
      "end": 1580.8599853515625,
      "text": " in seeking to encourage and influence these young people."
    },
    {
      "id": 151,
      "start": 1580.8599853515625,
      "end": 1583.2799987792969,
      "text": " I pray, God, that You'd bless them, encourage them,"
    },
    {
      "id": 152,
      "start": 1583.2799987792969,
      "end": 1586.239990234375,
      "text": " give them sweet times of fellowship"
    },
    {
      "id": 153,
      "start": 1586.239990234375,
      "end": 1588.1600036621094,
      "text": " and encouragement on the phones."
    },
    {
      "id": 154,
      "start": 1588.1600036621094,
      "end": 1590.5599975585938,
      "text": " And Lord, we'll thank You for what You'll do there."
    },
    {
      "id": 155,
      "start": 1590.5599975585938,
      "end": 1593.3599853515625,
      "text": " For it's in Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T19:58:11.651459"
}