{
  "video_id": "1_NCe9SHoA0",
  "text": "But before we get there, I'm going to be reading a passage from John 17. And so perhaps you want to start in John chapter number 17. And I'm going to read our text from 1 John. But then I'm going to immediately go to the book of John in the 17th chapter. Of course, we know that God has used the human penman for this book that we're studying here on Sunday mornings. The book of 1 John with our theme from this book in verse number 7 of chapter 1. If we walk in the light as he is in the light, our theme is walking in the light. And so thankful for the truth that God has given us already through this book of 1 John. Last week on Sunday morning, we looked at verses 12 through 14. And we noted the three groups of people that are identified and written to. The little children, the young men, and the fathers. And as we looked at that passage of scripture, we made note as to the particulars that were mentioned with regard to them. And we understand that the young men were said to have overcome the wicked one because of the spiritual strength received from the word of God. And I'm so thankful for God's word and for the truth of God's word. And the way in which his word will give us the strength that we need as we continue through the book of 1 John. And this morning, looking at verses 15 through 17, we find that the passage begins with what I'll refer to as a stern warning. For those who are being addressed, and he begins by saying this, Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him. For all that is in the world, the lust of the flesh and the lust of the eyes and the pride of life is not of the Father, but is of the world. The world passeth away in the lust thereof, but he that doeth the will of God abideth forever. We think about this stern warning that is issued under the inspiration of the Holy Spirit of God by the Apostle John to those in whom he is writing. But I'm mindful, as I mentioned, that John chapter number 17 records for us just moments before the Lord Jesus Christ would go to the cross of Calvary. The Bible begins in John 17 and verse number 11, and it says this, And now I am no more in the world, but these are in the world. So I want you to pay attention as we read through and notice this word world that is used so often. It says, And I come to thee, Holy Father, keep through thine own name those whom thou hast given me, that they may be one as we are. While I was with them in the world, I kept them in thy name. Those that thou gavest me I have kept, and none of them is lost, but the son of perdition, that the Scripture might be fulfilled. Verse 13, And now come I to thee, in these things I speak in the world, that they might have my joy fulfilled in themselves. I have given them thy word, and the world hath hated them, because they are not of the world, even as I am not of the world. I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil. They are not of the world, even as I am not of the world. Sanctify them through thy truth, thy word is truth. As thou hast sent me into the world, even so have I also sent them into the world. And for their sakes I sanctified myself, that they also might be sanctified through the truth. As we notice in these verses of Scripture from John 17, many times the Lord Jesus Christ is referring to the world. And he says this, that he's given us his word in verse 14, And the world hateth them, hath hated them, why? Because they are not of the world, even as I am not of the world. Now he says this in verse 15, I pray not that thou shouldest take them out of the world. No doubt as believers there have been times in our lives where we thought, man, it'd be just great if we could go to heaven, amen, and leave this old world. But God did not ordain it that at the time of salvation we would immediately leave this world to go to our heavenly home, our eternal abode. But he ordained it that he would leave us here for the purpose of being his representatives, his witnesses. And he says in verse 15, I pray not that thou shouldest take them out of the world, but that thou shouldest keep them, notice, from the evil. And then he says this in verse number 18, as thou hast sent me into the world, even so have I also sent them into the world. And we think about this truth that is revealed to us in John 17 and coupled with what we read in 1 John chapter number 2, and we are immediately confronted with a real difficulty that the child of God will face in his life with the world, the world in which we live. Now, when God speaks of the world, we understand that he speaks of creation as the world. That's not what he's speaking about here in 1 John chapter number 2. When he speaks of the world, there are times in which he speaks about the people. For God so loved the world, right? When he talks about in 1 John 2, in verse number 2, and he is the propitiation for our sins and not for ours only, but also for the sins of the whole world. He's talking about the people. That's not what he's speaking about in 1 John 2 and verse number 15 when he says, love not the world. He's not talking about the creation. He's not talking about the people. He's talking about the world system. And the Bible tells us that the God of this world, the little g, the God of this world is Satan himself, and he's speaking about this world system in which we live. As believers, we must acknowledge that this world is not my home. Aren't you thankful for that? That this world system and the way in which it operates and the way in which it's controlled, that this is not my home, that this is not all there is for us. That's a blessing. My citizenship is in heaven. Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims. I'm not home, but I'm heading home. Isn't that a blessing? And so this morning as we look at this portion of Scripture in 1 John 2 in verses 15 through 17, I've simply titled the message this morning, love not the world. I want you to notice with me as we begin this morning the progression of worldliness, the progression of worldliness. We find here that he says, love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him in verse number 15. As we think about this progression of worldliness, we find that this term, speaking about believers and their interaction with the world, is used throughout a number of portions of Scripture. We'll review several of those this morning as we consider this progression of worldliness. But at the onset of the message this morning, I want us to be mindful of this wonderful truth that God gives us in the book of Ephesians, and I hope that it will help us as we begin here in Ephesians 2 to help develop and understand this progression and how we combat it. Notice in Ephesians chapter number 2, we must remember this truth that prior to salvation, we walked according to the course of this world. Notice in Ephesians 2 in verse number 1, it says, He made us alive. That's salvation. And I'm so thankful. Yes, I was dead in my trespasses and in my sins, but he hath quickened me by his great mercy and by his grace. It says in verse number 2, notice this, wherein in time past ye walked according to the course of this world. Notice this, according to the prince of the power of the air, the spirit that now worketh in the children of disobedience. Notice in verse number 3, among whom also we all had our conversation in times past, in the lust of our flesh, fulfilling the desires of the flesh and of the mind, and were by nature the children of wrath, even as others. We begin to understand this truth this morning when we consider the progression of worldliness. The reality is that prior to salvation, according to verses 2 and 3, we all had our conversation in this world, and we all walked according to the course of this world. We were fulfilling the lust of this world. We were lost, and we were on our way to a Christless eternity. And the reality is that as we understand that that is our past, if you've been born again this morning, if you've trusted the Lord Jesus Christ as your personal Savior, if you could sing that song that we started out with this morning, that I'm saved by the blood of the crucified one, now I am saved and I am in the world, but I'm not of the world. And we understand what's happening and what God gives us in His Word with regard to all of this transpiring and this great battle that takes place. So here's what happens. I was walking after the course of this world. Now I'm saved. I have a new nature. Jesus now is my Savior, and the Holy Spirit of God indwells me. I'm heaven-bound, and He's left me here for the purpose of being His witness, His representative. And He says that we're in the world, but we're not of the world. But my flesh and your flesh still remains. Correct? And so here's what happens, the enemy is constantly, constantly trying to allure us and to taint us by this world. He knows that we had our course in time past, and we walked according to the course of this world. And so he understands that truth, but now as believers and we consider this truth of the progression of worldliness, we are mindful that John says, love not the world, neither the things that are in the world. I don't believe that it first starts with loving the world. That allure, that Satan is trying to tempt us and trying to taint us and pull us in. James 4 and verse number 4 tells us that we're not to be a friend of the world. Notice what the Bible says in James chapter number 4 and verse number 4, when we think about these truths and consider the progression this morning of worldliness by way of really getting into this passage in 1 John, notice the Bible says this in James 4 and verse number 4, ye adulterers and adulteresses, know ye not that the friendship of the world is enmity with God, whosoever therefore will be a friend of the world is the enemy of God. You say, pastor, that's strong language, that's Bible. When he says ye adulterers and adulteresses, I immediately, my mind races back to the book of Hosea, to the prophets of Israel when they were prophesying and they were preaching and proclaiming that they, the nation had left and they followed after idols and they were guilty of this spiritual adultery. We find here that God says that we're not to have friendship with the world because friendship with the world is enmity with God. And he says, whosoever therefore will be a friend of the world is the enemy of God. I don't want to be God's enemy, amen? And so it begins with this friendship and we find that the Bible tells us, look back a few passages or a few pages in James 1 and verse number 27, notice what he says here, pure religion and undefiled before God and the Father is this, to visit the fatherless and widows in their affliction, notice what he says, and to keep himself unspotted from the world. You know what happens when I begin to be a friend of the world? I begin to be spotted by the world. So I have no friendship with the world so that I can keep myself unspotted from the world, James 1 and verse number 27, and we find that we then come to 1 John 2 where we see that the Bible says, love not the world, neither the things that are in the world. See that love doesn't happen overnight. It's not something that just immediately takes place. There's this progression of worldliness and the reality is that the enemy wants you to be worldly, the enemy wants me to be worldly so that we could be at odds with God so that we can be ineffective in the purpose in which God has left us here. God has left us here to be different. We're not to be like the world. We're not to love the world. He tells us, love not the world. Do you remember Demas? The Bible tells us of Demas, that he hath forsaken me, what does it say? Having loved this present world. In Romans chapter number 12, we read of that great truth in verses 1 and 2 where Paul gives this really a culmination of the book of Romans and he comes to this 12th chapter and he says, I beseech you therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service, and then he says this, and be not conformed to this world, but be transformed, how? By the renewing of your mind that you may prove what is that good and acceptable and perfect will of God. How do I prevent this progression? We'll look at some things here in just a moment that I hope will be a blessing to you and will help us as we consider this progression of worldliness, but I want you to be mindful of this, if I could use an illustration quickly from the book of Genesis. Notice back in Genesis chapter number 13, I'll say this, Lot didn't end up in Sodom overnight. Lot didn't end up in Sodom overnight. The Bible tells us in Genesis chapter number 13, in verse number 12, but even if you think about the context in the book of Genesis, it tells us in chapter 13 and verse number 7, there was a strife there between the herdmen of Abram's cattle and the herdmen of Lot's cattle, and the Bible tells us that the Canaanite and the Perizzite dwelt in the land at that time, according to Genesis 13 and verse number 7. Abram says that there should be no strife, and the instruction is given with regard to where they would go and how they would depart, and it tells us in verse number 12 of Genesis 13 that Abram dwelt in the land of Canaan, but it says this, that Lot dwelt in the cities of the plain, but notice this phrase, he pitched his tent towards Sodom. He pitched his tent towards Sodom. He's not in Sodom. He's just pitched his tent towards Sodom. The Bible tells us, if you consider the progression in chapter number 14, of course you read of the battle that takes place and how Abram is going to deliver Lot, but notice what the Bible tells us about this great battle. It tells us in verse number 12 of Genesis 14, and they took Lot, Abram's brother's son. Notice this phrase, who dwelt in Sodom, and his goods, and departed, and so Lot was now, in Genesis 13, he had pitched his tent towards Sodom, but now in Genesis chapter 14 and verse number 12, the Bible tells us that he dwelt in Sodom. As you continue through the book of Genesis, you come to the 19th chapter, and you find something very interesting in the first verse. Of course, in chapter 18, God had revealed to Abraham that he was going to destroy Sodom and Gomorrah because of their wickedness, but the Bible tells us that these angels come to the city of Sodom, and even in Genesis 19 and verse number 1, and I want you to notice that the Bible says that Lot sat in the gate of Sodom. He had some level of influence and some level of responsibility, perhaps even being a judge in the city at some level, and the Bible tells us that they, as these two angels came into the city, that Lot sat in the gate. He sat in the gate of Sodom. He didn't get there overnight. He pitched his tent towards Sodom. There was a progression. He dwelt in Sodom, and then now he's sitting in the gate of Sodom. We begin to think about the progression of worldliness this morning, and we find where John says in 1 John 2, love not the world, neither the things that are in the world. Notice what he says, if any man love the world, the love of the Father is not in him. Again, strong language. God is being very direct and very strong with regard to this situation, and we must understand that the enemy, again, is constantly trying to allure us by the things of this world, the glitter and the shiny and all of the things of this world. We begin to consider the progression, but now I want you to notice as we continue to make progress through this passage of Scripture, number two this morning, the pitfalls to avoid. I'm thankful for verse number 16. God gives us here in this verse of Scripture some pitfalls to avoid. Notice what he says, for all that is in the world, and then he lists these three things, the lust of the flesh and the lust of the eyes and the pride of life is not of the Father, but is of the world. Notice he begins with the lust of the flesh, that materialism, that consumerism, and is it not true that we live in a society, in a culture where there is a great lust of the flesh? It's amazing when you think about our society and you think about our culture, obviously as a nation we're in crazy amounts of debt, but the population of America, for the most part, and I'm thankful that there are some that aren't bound by this, but there are many that are in great depths of debt because of this materialism, because of this consumerism, because of this lust of the flesh, and we find that the enemy often uses, as you think about the connection between the lust of the flesh and then the second point that he brings up, the lust of the eyes. How often the enemy uses the eye gate. You think about the marketing industry and all of their creativity and all of their approach to try to get you and to get me, to get our society to think that we absolutely need whatever this thing is that they're marketing, and that we just flat out cannot live life without it. You think about this world system and you think about the lust of the flesh, the lust of the eyes, he then mentions the pride of life, understanding this morning that pride is at the very center of sin in general as we speak about the danger of pride, the deception of pride, the destruction of pride. And we understand this morning that as you look at these three pitfalls that are mentioned, the lust of the flesh, the lust of the eyes, the pride of life, and we think about the truth that he gives us at the end of the verse, he says, this is not of the Father, but is of the world. It's of the world. Turn back to the book of Genesis once again. We were in Genesis looking at this… progression, but I want you to go to Genesis 3, a familiar portion of Scripture for many of us this morning, and we know this as being the account in which the Bible records for us the fall of man when sin entered into the world. And I want you to see that in this very passage of Scripture, that the lust of the flesh, the lust of the eyes, and the pride of life is all contained. We find that here oftentimes as we look at this passage of Scripture, perhaps we are mindful of what takes place and we're familiar with the account, but we must recognize this morning that the enemy still uses the same approach. The lust of the flesh, the lust of the eyes, and the pride of life. Notice in verse number one, now the serpent was more subtle than any beast of the field which the Lord God had made. And he said unto the woman, Yea, hath God said, Ye shall not eat of every tree of the garden. And the woman said unto the serpent, We may eat of the fruit of the trees of the garden, but of the fruit of the tree which is in the midst of the garden, God hath said, Ye shall not eat of it, neither shall ye touch it, lest ye die. And the serpent said unto the woman, Ye shall not surely die. For God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall be as gods, knowing good and evil. Notice this in verse number six. And when the woman saw that the tree was good for food, we see the lust of the flesh. Oftentimes we think about the lust of the flesh, we are immediately thinking of sensuality and sexual desires, and certainly there's truth in the Word of God about fleeing fornication and fleeing youthful lust and all of that truth. You see here that the lust of the flesh for Eve was that it was good for food. She saw it, the Bible tells us, notice it continues and says that it was pleasant to the eyes. It was pleasant to the eyes. The lust of the flesh, the lust of the eyes. But notice this as the verse continues, that it was pleasant to the eyes and a tree to be desired why, to make one wise. So what did she do? She took of the fruit thereof and did eat, and gave also unto her husband with her, and he did eat. The eyes of them both were open, and they knew that they were naked, and they sewed fig leaves together and made themselves aprons. We're familiar with all that takes place here with the judgment and all that God does and how at the end of the passage He provides for them a coat of skins and the grace and mercy of God that is displayed there, but we find here in verse number 6 exactly what we find in 1 John 2 and verse number 16 when He tells us there's some pitfalls to avoid. The lust of the flesh, the lust of the eyes, the pride of life, and we see these possessions in position. If we could note that this morning and we can see here in the life of Eve where then all three are active in verse number 6, the lust of the flesh, the lust of the eyes, and the pride of life, and the enemy continues to use the same playbook. And it's so sad that he uses the same playbook and there are still countless people that become casualties. The allure, the pitfalls to avoid. The question that I ask if I'm going to mention the pitfalls that are given to us here in verse number 16, the lust of the flesh, the lust of the eyes, and the pride of life, I'd ask the question, how can I avoid these pitfalls? Is it even possible that I can avoid these pitfalls? The answer is yes. Five simple thoughts, really six simple thoughts this morning on how we can avoid these pitfalls. Number one, and this might be a little bit too basic, but I would say it's necessary, we avoid them first by knowing what they are. If I don't know what they are, it's going to be hard for me to avoid them. But when I know that He tells me it's the lust of the flesh, the lust of the eyes, and the pride of life, all that is in the world, and He sums them up in these three statements, then I know what these pitfalls are, and God, with God's help and by God's grace, and having a knowledge of them, I can avoid them. Notice this, I believe that we must put on the whole armor of God. We're familiar with the passage of Scripture in Ephesians chapter number 6 that we're to be strong in the Lord and the power of His might, that we're to put on the whole armor of God. And when He goes through and He begins to list for us what those pieces of armor are, we do not have time this morning to develop all of that, but it's necessary for us daily to put on that whole armor of God. Because we understand that that enemy, our enemy, he's going to shoot those fiery darts. And we find that we put on that whole armor of God, I'd say this, as Paul recorded for us there in the book of Philippians, how that he learned contentment, number three, of how to avoid these pitfalls, knowing what they are, number one, number two, putting on the whole armor of God, number three, by learning contentment, by learning contentment. The apostle Paul says this in the book of Philippians with regard to the subject matter of contentment, and what a blessing to think about this truth. He says, not that I speak in respect of want, notice, for I have learned in whatsoever state I am therewith to be content. I've always, as I look at this passage of Scripture, I've always focused and really considered the importance of that phrase when he says, for I have learned. You know, in our most basic state, we are not content people. We're not. You think about the nation of Israel. How many times were they complaining and murmuring? What was that indicative of? It was indicative of their discontentment. They didn't like what God had provided for them. They're eating manna and they're saying, my soul loatheth, I hate this manna. We have nothing to eat. God miraculously was providing this. They were complaining and complaining and complaining. Complaining is the result of discontent. We find that we must learn contentment. Paul continues and says, I know both how to be abased and I know how to abound. Everywhere and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. God knows what we need, doesn't He? And He's capable of providing for us. You remember that familiar Psalm, Psalm 23, the Lord is my shepherd. What does He say? I shall not want. I shall not want. The Lord is a good shepherd, amen? He provides for us. And what a blessing. We must learn contentment. I would say this, we must seek the Lord Jesus Christ. Notice in Colossians 3, we studied this portion of Scripture last year as we studied through the book of Colossians, but these first few verses of Colossians 3 are so powerful. When the Bible says this, if you then be risen with Christ, seek those things which are above. Where Christ sitteth on the right hand of God, set your affection on things above, not on things of the earth. And as I do this, as I understand that I'm in the world but I'm not of the world, when I understand and I'm so consumed with the Lord Jesus Christ and I'm looking to Him, I'm seeking those things which are above, I'm setting my affection on things above, not on things of the earth, oh, the things of this world aren't going to matter as much. Right? The reproach of the enemy, the lust of the flesh and the lust of the eyes and the pride of life, it's not going to be as impactful because I've set my affection on things above. I got my eyes on the Lord Jesus Christ. I'd say this, that we must be clothed with humility. We must be clothed with humility. Peter says in 1 Peter chapter 5, and we know that both James and Peter mention the truth of God resisting the proud but giving grace to the humble. But I want you to notice what Peter says in 1 Peter chapter 5, in verse number 5, he says, likewise ye younger, submit yourselves unto the elder, yea, all of you be subject one to another. Notice what he says, and be clothed with humility, for God resisteth the proud and giveth grace to the humble. Humble yourselves therefore unto the mighty hand of God that He may exalt you in due time. The enemy wants us to get so focused upon this world and so consumed with the things of this world that we're more concerned about our position and our possessions here and give less thought to what our eternal life is going to be. I've mentioned before, and I understand there's a whole industry that's wrapped around it, and I'm not suggesting that we should not have any emphasis or focus upon planning for retirement and being mindful of those things. And I believe that there's wisdom in that. But I find that in our society today that far too many have spent more time in doing retirement planning and estate planning than they ever give thought of eternity. And let me say this, retirement is not guaranteed. Some of you are retired. You say, man, I've been retired. John tells me all the time, retirement's great. It's like Saturday every day. But the reality is this, retirement's not guaranteed. You know people that never made it to retirement, correct? Eternity is guaranteed. Eternity is guaranteed. Again, I'm not suggesting that we not consider retirement planning and estate planning, but I'm saying there ought to be a balance. Let me say this, number six, we think about how to avoid these pitfalls. I would say this, by the renewing of your mind. Remember what he said as we read that portion of Scripture in Romans 12, in verse number two, he says, be not conformed to this world, but be ye transformed by the renewing of your mind. You think about what Paul said in Philippians chapter number four with regard to the thought of God's people. He says, finally, brethren, what sort of things are true, what sort of things are honest, what sort of things are just, what sort of things are pure, what sort of things are lovely, what sort of things are of good report? If there be any virtue and if there be any praise, think on these things. He tells us that we're to bring every thought into the captivity, unto the obedience of Christ. And oh, if we'd understand the battle for our mind, and when we have our mind and we have our affection set on things above, as we find in Colossians chapter number three, how that will enable us and help us to avoid the pitfalls. We've mentioned the progression of worldliness and we understand the friendship of the world and being spotted by the world and loving the world and then being conformed to this world. And so we don't want that as the people of God, we have been saved and Jesus said that he left us in this world, but we're not of the world and we're to be his representatives. And we understand that the enemy is constantly trying to allure us and pull us back because he knows that in time past, prior to your salvation, prior to my salvation, every one of us walked according to the course of this world. And so we're familiar with this world system. Those that were saved later in life are more familiar with this world system. It's always tragic to me when those that were saved early in life feel like their testimony is not as important or not as powerful because, oh, how God has delivered you from some really, really terrible things. And oh, how my heart breaks when young people feel like they need to go out and experience the world. Let me tell you this, the world is never going to satisfy you. The world will always leave you wanting, always. The world does not satisfy. The lust of the flesh and the lust of the eyes and the pride of life, it's never fulfilled. It's never satisfied. There's always something else and something more, and go further. Jesus, on the other hand, he satisfies, amen? He satisfies. And I'm so thankful for that. And so we see the progression. We understand that there are some pitfalls to avoid. And I hope this morning that we would take note of those, how we can avoid these things. What are some things I can do in my life so that I can avoid these pitfalls because God's warned me about them? And the reality is that there's record of people in the Word of God that forsook because they love this world. I don't want to be there. So how do I avoid it? Number three this morning, finally, I'd say this. As you continue through the passage, you come to verse number 17, I would say that there's a promise to embrace. It's really a twofold promise that is given to us here, and I hope that this twofold promise that is given to us would cause us to be encouraged. Notice what the Bible says. It begins by telling us this, and the world passeth away and the lust thereof. This world is going to pass away. The world system, listen, there are times in which we look at and we understand when the Bible tells us, why do the heathen rage, right? And you look at Psalm 2 and you understand how the kings of the earth, they set themselves against the Lord. And you look at all that's taking place and you understand this world system in which we're living and we're operating, and you find that in this world system there are some that would try to get us to think that this world system has some level of permanence. But no, the world system, we have the promise of God Almighty that this world passeth away and the lust thereof. I'd say this, this world system is just temporary. It's just temporary. I understand that at times it seems like there's some level of permanence to it, and you sort of see some things that are taking place, and it could bother us, it could cause us to have worry and concern. But oh, how we must run to the Scriptures and how we must just comfort ourselves with regard to the great promises that God has given us. I said this several weeks ago. I believe that it's worth repeating, there are many today that are looking at our society and they're saying something like this, the world is falling apart. And I understand when people use that terminology, but I'd say this, it's falling in place. When we look at the prophecy that God has given us and we look at all that's taking place in our world, we see things falling right in place, and God is King, amen? He is King of kings and Lord of lords. The Lord God omnipotent reigneth. I was reading this morning in reading where the Bible was saying repetitively, the Lord reigneth, and I'm so thankful that He's in control. The promise for you, the promise for me, as we live in this world system, that we understand this world is not my home. This world system is just temporary. It's going to pass away. And the lust thereof, notice what He says, and I want to focus on this for the last several minutes this morning, but He that doeth the will of God abideth forever. He that doeth the will of God abideth forever. As we think about this individual that is mentioned here, really individuals if you could use it in the plural sense, the one that is going to do the will of God, the one that is going to obey the voice of God, the one that is overcoming, the one that is knowing the Father, the one that is seeking, has set their affection on things above, not on things of the earth. The one that we find in 2 Corinthians chapter number 4 while Paul says, while we look not at these things which are temporal, these things that just pass away, but our focus is on those things that are eternal. And we have that eternal focus and we understand that we're doing the will of God and we're seeking to please God. We don't fit into this world system, because we're in the world, but we're not of the world. And as we try to fit into the world system, then we become really sideways in our walk with God. We find here this morning that He says, He that doeth the will of God abideth forever. Abideth forever. I'm thankful as a child of God that the second death has no power over me and that I will forever be with my Lord. Isn't that precious? He that doeth the will of God abideth forever. We understand that as we look at this passage of Scripture that it's quite evident and quite clear that loving the world is not the will of the Father. Amen? Isn't that abundantly clear? He says in verse number 15, for if any man loved the world, the love of the Father's not in him. He says in verse number 16 that all of this, the lust of the flesh, the lust of the eyes and the pride of life, it's not of the Father, but it's of the world. So obviously, loving the world, the world system, is not the will of God. Walking in the light is the will of God. Wouldn't you agree? He says that we walk in the light as He is in the light. That we're walking with Him, we're enjoying that fellowship with Him, we're abiding in Him, we're loving our brethren, we're growing in grace and knowledge of our Lord and Savior Jesus Christ, we're being sanctified, set apart. That is God's will. Remember at the end of Romans 12 in verse number 2, it says that we might prove what is that good and acceptable and perfect will of God. But we have to be renewed by the transforming of our mind. We're not to be conformed to this world. I'm mindful this morning of what the songwriter said. It's a song that we don't often sing. It's a song, however, that you will often hear played for invitation. That song is, Turn Your Eyes Upon Jesus. And think about these words at the chorus of that song. And the songwriter said, turn your eyes upon Jesus, look full in His wonderful face. And then it says this, and the things of earth will grow strangely dim in the light of His glory and grace. The songwriter hit the nail on the head, right? I understand that songs aren't inspired Scripture, but the songwriter, by reading the inspired Scripture and by meditating upon the truth of God's Word, got it right. And the reality is that we must turn our eyes upon Jesus, get our eyes off of this old world and the world system and the things of this world, and we get our eyes on Jesus, and we look not partially, not partly, but we look fully in His wonderful face. face and we just get consumed with Jesus. It bothers me when people say that you could become too heavenly minded to be of any good earthly of any earthly value. I just don't find that to be true because we're to be consumed with our Lord and the reality is that as we're walking with Him and we're abiding in Him and we're worshiping Him, then guess what? We're going to be doing His will. He's going to be leading us directly into the paths that He wants us into to be His representatives and to be His spokespeople and to bring honor and glory to His name. How is it that my Father is glorified and Johnny says that you bear much fruit, right? That's how that's our Father's glorified. One way in which He's glorified. And so we find that we look a fool in His wonderful face is what the songwriter says and just get consumed with Jesus. He says the things of this world, oh there are many things of this world. I love how it says we'll grow strangely dim because so often it's the glitter and glamour of the world that catches our attention. That many have fallen prey to and have become casualties. But the songwriter said when I've turned my eyes upon Jesus and I'm looking fully in His wonderful face, then the things of this world grow strangely dim in the light of what? His glory and grace. This morning, it's a stern warning, love not the world. The reality is that it doesn't happen overnight. There's a progression. Being a friend of the world, being spotted by the world, loving the world, being conformed to this world. We want to avoid, there are pitfalls to avoid. The lust of the flesh, the lust of the eyes, the pride of life. God will give us the ability to avoid those pitfalls. I'm thankful that He's told us what they are. As we take heed to the Scripture and we put on the whole armor of God and we set our affection on things above, we're clothed with humility and all those things that we mentioned, that we can avoid those pitfalls and we ought to rejoice in that promise and embrace it. That the world passeth away in the lust thereof. But he that doeth the will of God abideth forever. Let us determine this morning and agree with what God said. I'm in the world but I'm not of the world. This world is not my home, the songwriter said, I'm just a passing through. I'm a pilgrim and a stranger and I don't want to get sideways in my walk with God because of the things of this world. I want to have my full attention on the Lord. Love not the world. The enemy continues to use the same thing today, the same playbook that he used in Genesis chapter number 3. The lust of the flesh, the lust of the eyes, and the pride of life. Oh, that God would help us so that we would overcome. Amen? Let's pray. Father, we love You. We thank You for loving us. Thank You for the Word of God. Stern warning this morning from this passage of Scripture, but how I rejoice in the warnings that You give us in Your Word. God, I pray that You'd help us to avoid these pitfalls, to be mindful of the fact that the enemy is seeking through one, really a combination of all three of these, the lust of the flesh, the lust of the eyes, and the pride of life to taint us, to cause us to be worldly, to come to that place where we love this world. God, I pray that You'd help us to set our affection on things above. God, that You'd help us to do as the songwriter said and to turn our eyes upon Jesus. Help us to think more of the permanence of Him that doeth the will of God abideth forever than the passing away of this world's system, the temporary nature of this world in which we live. We do thank You for the opportunity to be Your representatives. I thank You that You've given us Your Word. And as we understand that we're in this world but You've given us this precious book, the Word of God, to arm us, to enable us to be victorious. Perhaps this morning there's someone that's struggling with worldliness. I pray that You would use Your Word, Your Spirit would work in their heart and life, they'd respond. Maybe this morning there's some folks that need to just come and be encouraged, be reminded of that daily, weekly attack and recommit their focus to You, Lord. Maybe there's one that's not sure of heaven. Lord, today would You reveal to them their need for salvation. I trust that You've worked and moved and we pray that You'd have Your will and way in these few moments of invitation. We'll give You the honor and glory for all that You'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.0,
      "text": " But before we get there, I'm going to be reading a passage from John 17."
    },
    {
      "id": 1,
      "start": 4.0,
      "end": 8.0,
      "text": " And so perhaps you want to start in John chapter number 17."
    },
    {
      "id": 2,
      "start": 8.0,
      "end": 11.0,
      "text": " And I'm going to read our text from 1 John."
    },
    {
      "id": 3,
      "start": 11.0,
      "end": 16.0,
      "text": " But then I'm going to immediately go to the book of John in the 17th chapter."
    },
    {
      "id": 4,
      "start": 16.0,
      "end": 21.0,
      "text": " Of course, we know that God has used the human penman for this book that we're studying here on Sunday mornings."
    },
    {
      "id": 5,
      "start": 21.0,
      "end": 26.0,
      "text": " The book of 1 John with our theme from this book in verse number 7 of chapter 1."
    },
    {
      "id": 6,
      "start": 26.0,
      "end": 30.0,
      "text": " If we walk in the light as he is in the light, our theme is walking in the light."
    },
    {
      "id": 7,
      "start": 30.0,
      "end": 37.0,
      "text": " And so thankful for the truth that God has given us already through this book of 1 John."
    },
    {
      "id": 8,
      "start": 37.0,
      "end": 40.0,
      "text": " Last week on Sunday morning, we looked at verses 12 through 14."
    },
    {
      "id": 9,
      "start": 40.0,
      "end": 45.0,
      "text": " And we noted the three groups of people that are identified and written to."
    },
    {
      "id": 10,
      "start": 45.0,
      "end": 49.0,
      "text": " The little children, the young men, and the fathers."
    },
    {
      "id": 11,
      "start": 49.0,
      "end": 55.0,
      "text": " And as we looked at that passage of scripture, we made note as to the particulars that were mentioned with regard to them."
    },
    {
      "id": 12,
      "start": 55.0,
      "end": 63.0,
      "text": " And we understand that the young men were said to have overcome the wicked one because of the spiritual strength received from the word of God."
    },
    {
      "id": 13,
      "start": 63.0,
      "end": 68.0,
      "text": " And I'm so thankful for God's word and for the truth of God's word."
    },
    {
      "id": 14,
      "start": 68.0,
      "end": 74.0,
      "text": " And the way in which his word will give us the strength that we need as we continue through the book of 1 John."
    },
    {
      "id": 15,
      "start": 74.0,
      "end": 82.0,
      "text": " And this morning, looking at verses 15 through 17, we find that the passage begins with what I'll refer to as a stern warning."
    },
    {
      "id": 16,
      "start": 83.0,
      "end": 87.0,
      "text": " For those who are being addressed, and he begins by saying this,"
    },
    {
      "id": 17,
      "start": 87.0,
      "end": 93.0,
      "text": " Love not the world, neither the things that are in the world."
    },
    {
      "id": 18,
      "start": 93.0,
      "end": 98.0,
      "text": " If any man love the world, the love of the Father is not in him."
    },
    {
      "id": 19,
      "start": 98.0,
      "end": 106.0,
      "text": " For all that is in the world, the lust of the flesh and the lust of the eyes and the pride of life is not of the Father, but is of the world."
    },
    {
      "id": 20,
      "start": 106.0,
      "end": 113.0,
      "text": " The world passeth away in the lust thereof, but he that doeth the will of God abideth forever."
    },
    {
      "id": 21,
      "start": 113.0,
      "end": 120.0,
      "text": " We think about this stern warning that is issued under the inspiration of the Holy Spirit of God by the Apostle John to those in whom he is writing."
    },
    {
      "id": 22,
      "start": 120.0,
      "end": 129.0,
      "text": " But I'm mindful, as I mentioned, that John chapter number 17 records for us just moments before the Lord Jesus Christ would go to the cross of Calvary."
    },
    {
      "id": 23,
      "start": 130.0,
      "end": 134.0,
      "text": " The Bible begins in John 17 and verse number 11, and it says this,"
    },
    {
      "id": 24,
      "start": 134.0,
      "end": 140.0,
      "text": " And now I am no more in the world, but these are in the world."
    },
    {
      "id": 25,
      "start": 140.0,
      "end": 145.0,
      "text": " So I want you to pay attention as we read through and notice this word world that is used so often."
    },
    {
      "id": 26,
      "start": 145.0,
      "end": 154.0,
      "text": " It says, And I come to thee, Holy Father, keep through thine own name those whom thou hast given me, that they may be one as we are."
    },
    {
      "id": 27,
      "start": 154.0,
      "end": 158.0,
      "text": " While I was with them in the world, I kept them in thy name."
    },
    {
      "id": 28,
      "start": 158.0,
      "end": 165.0,
      "text": " Those that thou gavest me I have kept, and none of them is lost, but the son of perdition, that the Scripture might be fulfilled."
    },
    {
      "id": 29,
      "start": 165.0,
      "end": 176.0,
      "text": " Verse 13, And now come I to thee, in these things I speak in the world, that they might have my joy fulfilled in themselves."
    },
    {
      "id": 30,
      "start": 177.0,
      "end": 188.0,
      "text": " I have given them thy word, and the world hath hated them, because they are not of the world, even as I am not of the world."
    },
    {
      "id": 31,
      "start": 188.0,
      "end": 195.0,
      "text": " I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil."
    },
    {
      "id": 32,
      "start": 195.0,
      "end": 198.0,
      "text": " They are not of the world, even as I am not of the world."
    },
    {
      "id": 33,
      "start": 198.0,
      "end": 203.0,
      "text": " Sanctify them through thy truth, thy word is truth."
    },
    {
      "id": 34,
      "start": 203.0,
      "end": 209.0,
      "text": " As thou hast sent me into the world, even so have I also sent them into the world."
    },
    {
      "id": 35,
      "start": 209.0,
      "end": 216.0,
      "text": " And for their sakes I sanctified myself, that they also might be sanctified through the truth."
    },
    {
      "id": 36,
      "start": 216.0,
      "end": 225.0,
      "text": " As we notice in these verses of Scripture from John 17, many times the Lord Jesus Christ is referring to the world."
    },
    {
      "id": 37,
      "start": 225.0,
      "end": 230.0,
      "text": " And he says this, that he's given us his word in verse 14,"
    },
    {
      "id": 38,
      "start": 230.0,
      "end": 237.0,
      "text": " And the world hateth them, hath hated them, why? Because they are not of the world, even as I am not of the world."
    },
    {
      "id": 39,
      "start": 237.0,
      "end": 242.0,
      "text": " Now he says this in verse 15, I pray not that thou shouldest take them out of the world."
    },
    {
      "id": 40,
      "start": 242.0,
      "end": 251.0,
      "text": " No doubt as believers there have been times in our lives where we thought, man, it'd be just great if we could go to heaven, amen, and leave this old world."
    },
    {
      "id": 41,
      "start": 251.0,
      "end": 261.0,
      "text": " But God did not ordain it that at the time of salvation we would immediately leave this world to go to our heavenly home, our eternal abode."
    },
    {
      "id": 42,
      "start": 261.0,
      "end": 268.0,
      "text": " But he ordained it that he would leave us here for the purpose of being his representatives, his witnesses."
    },
    {
      "id": 43,
      "start": 268.0,
      "end": 277.0,
      "text": " And he says in verse 15, I pray not that thou shouldest take them out of the world, but that thou shouldest keep them, notice, from the evil."
    },
    {
      "id": 44,
      "start": 277.0,
      "end": 286.0,
      "text": " And then he says this in verse number 18, as thou hast sent me into the world, even so have I also sent them into the world."
    },
    {
      "id": 45,
      "start": 286.0,
      "end": 293.0,
      "text": " And we think about this truth that is revealed to us in John 17 and coupled with what we read in 1 John chapter number 2,"
    },
    {
      "id": 46,
      "start": 293.0,
      "end": 304.0,
      "text": " and we are immediately confronted with a real difficulty that the child of God will face in his life with the world, the world in which we live."
    },
    {
      "id": 47,
      "start": 304.0,
      "end": 310.0,
      "text": " Now, when God speaks of the world, we understand that he speaks of creation as the world."
    },
    {
      "id": 48,
      "start": 310.0,
      "end": 313.0,
      "text": " That's not what he's speaking about here in 1 John chapter number 2."
    },
    {
      "id": 49,
      "start": 313.0,
      "end": 316.0,
      "text": " When he speaks of the world, there are times in which he speaks about the people."
    },
    {
      "id": 50,
      "start": 316.0,
      "end": 320.0,
      "text": " For God so loved the world, right?"
    },
    {
      "id": 51,
      "start": 320.0,
      "end": 330.0,
      "text": " When he talks about in 1 John 2, in verse number 2, and he is the propitiation for our sins and not for ours only, but also for the sins of the whole world."
    },
    {
      "id": 52,
      "start": 330.0,
      "end": 332.0,
      "text": " He's talking about the people."
    },
    {
      "id": 53,
      "start": 332.0,
      "end": 336.0,
      "text": " That's not what he's speaking about in 1 John 2 and verse number 15 when he says, love not the world."
    },
    {
      "id": 54,
      "start": 336.0,
      "end": 339.0,
      "text": " He's not talking about the creation."
    },
    {
      "id": 55,
      "start": 339.0,
      "end": 341.0,
      "text": " He's not talking about the people."
    },
    {
      "id": 56,
      "start": 341.0,
      "end": 344.0,
      "text": " He's talking about the world system."
    },
    {
      "id": 57,
      "start": 344.0,
      "end": 350.0,
      "text": " And the Bible tells us that the God of this world, the little g, the God of this world is Satan himself,"
    },
    {
      "id": 58,
      "start": 350.0,
      "end": 354.0,
      "text": " and he's speaking about this world system in which we live."
    },
    {
      "id": 59,
      "start": 354.0,
      "end": 359.0,
      "text": " As believers, we must acknowledge that this world is not my home."
    },
    {
      "id": 60,
      "start": 359.0,
      "end": 360.0,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 61,
      "start": 360.0,
      "end": 365.0,
      "text": " That this world system and the way in which it operates and the way in which it's controlled,"
    },
    {
      "id": 62,
      "start": 365.0,
      "end": 371.0,
      "text": " that this is not my home, that this is not all there is for us."
    },
    {
      "id": 63,
      "start": 371.0,
      "end": 373.0,
      "text": " That's a blessing."
    },
    {
      "id": 64,
      "start": 373.0,
      "end": 377.0,
      "text": " My citizenship is in heaven."
    },
    {
      "id": 65,
      "start": 377.0,
      "end": 383.0,
      "text": " Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims."
    },
    {
      "id": 66,
      "start": 383.0,
      "end": 385.0,
      "text": " I'm not home, but I'm heading home."
    },
    {
      "id": 67,
      "start": 385.0,
      "end": 387.0,
      "text": " Isn't that a blessing?"
    },
    {
      "id": 68,
      "start": 387.0,
      "end": 392.0,
      "text": " And so this morning as we look at this portion of Scripture in 1 John 2 in verses 15 through 17,"
    },
    {
      "id": 69,
      "start": 392.0,
      "end": 397.0,
      "text": " I've simply titled the message this morning, love not the world."
    },
    {
      "id": 70,
      "start": 397.0,
      "end": 402.0,
      "text": " I want you to notice with me as we begin this morning the progression of worldliness,"
    },
    {
      "id": 71,
      "start": 402.0,
      "end": 404.0,
      "text": " the progression of worldliness."
    },
    {
      "id": 72,
      "start": 404.0,
      "end": 409.0,
      "text": " We find here that he says, love not the world, neither the things that are in the world."
    },
    {
      "id": 73,
      "start": 409.0,
      "end": 414.0,
      "text": " If any man love the world, the love of the Father is not in him in verse number 15."
    },
    {
      "id": 74,
      "start": 414.0,
      "end": 418.0,
      "text": " As we think about this progression of worldliness, we find that this term,"
    },
    {
      "id": 75,
      "start": 418.0,
      "end": 421.0,
      "text": " speaking about believers and their interaction with the world,"
    },
    {
      "id": 76,
      "start": 421.0,
      "end": 424.0,
      "text": " is used throughout a number of portions of Scripture."
    },
    {
      "id": 77,
      "start": 424.0,
      "end": 429.0,
      "text": " We'll review several of those this morning as we consider this progression of worldliness."
    },
    {
      "id": 78,
      "start": 429.0,
      "end": 431.0,
      "text": " But at the onset of the message this morning,"
    },
    {
      "id": 79,
      "start": 431.0,
      "end": 436.0,
      "text": " I want us to be mindful of this wonderful truth that God gives us in the book of Ephesians,"
    },
    {
      "id": 80,
      "start": 436.0,
      "end": 440.0,
      "text": " and I hope that it will help us as we begin here in Ephesians 2"
    },
    {
      "id": 81,
      "start": 440.0,
      "end": 445.0,
      "text": " to help develop and understand this progression and how we combat it."
    },
    {
      "id": 82,
      "start": 445.0,
      "end": 448.0,
      "text": " Notice in Ephesians chapter number 2,"
    },
    {
      "id": 83,
      "start": 448.0,
      "end": 452.0,
      "text": " we must remember this truth that prior to salvation,"
    },
    {
      "id": 84,
      "start": 452.0,
      "end": 457.0,
      "text": " we walked according to the course of this world."
    },
    {
      "id": 85,
      "start": 457.0,
      "end": 459.0,
      "text": " Notice in Ephesians 2 in verse number 1, it says,"
    },
    {
      "id": 86,
      "start": 464.0,
      "end": 466.0,
      "text": " He made us alive."
    },
    {
      "id": 87,
      "start": 466.0,
      "end": 467.0,
      "text": " That's salvation."
    },
    {
      "id": 88,
      "start": 467.0,
      "end": 468.0,
      "text": " And I'm so thankful."
    },
    {
      "id": 89,
      "start": 468.0,
      "end": 472.0,
      "text": " Yes, I was dead in my trespasses and in my sins,"
    },
    {
      "id": 90,
      "start": 472.0,
      "end": 476.0,
      "text": " but he hath quickened me by his great mercy and by his grace."
    },
    {
      "id": 91,
      "start": 476.0,
      "end": 478.0,
      "text": " It says in verse number 2, notice this,"
    },
    {
      "id": 92,
      "start": 478.0,
      "end": 486.0,
      "text": " wherein in time past ye walked according to the course of this world."
    },
    {
      "id": 93,
      "start": 486.0,
      "end": 492.0,
      "text": " Notice this, according to the prince of the power of the air,"
    },
    {
      "id": 94,
      "start": 492.0,
      "end": 496.0,
      "text": " the spirit that now worketh in the children of disobedience."
    },
    {
      "id": 95,
      "start": 496.0,
      "end": 503.0,
      "text": " Notice in verse number 3, among whom also we all had our conversation in times past,"
    },
    {
      "id": 96,
      "start": 503.0,
      "end": 508.0,
      "text": " in the lust of our flesh, fulfilling the desires of the flesh and of the mind,"
    },
    {
      "id": 97,
      "start": 508.0,
      "end": 513.0,
      "text": " and were by nature the children of wrath, even as others."
    },
    {
      "id": 98,
      "start": 513.0,
      "end": 518.0,
      "text": " We begin to understand this truth this morning when we consider the progression of worldliness."
    },
    {
      "id": 99,
      "start": 518.0,
      "end": 523.0,
      "text": " The reality is that prior to salvation, according to verses 2 and 3,"
    },
    {
      "id": 100,
      "start": 523.0,
      "end": 526.0,
      "text": " we all had our conversation in this world,"
    },
    {
      "id": 101,
      "start": 526.0,
      "end": 530.0,
      "text": " and we all walked according to the course of this world."
    },
    {
      "id": 102,
      "start": 530.0,
      "end": 533.0,
      "text": " We were fulfilling the lust of this world."
    },
    {
      "id": 103,
      "start": 533.0,
      "end": 537.0,
      "text": " We were lost, and we were on our way to a Christless eternity."
    },
    {
      "id": 104,
      "start": 537.0,
      "end": 542.0,
      "text": " And the reality is that as we understand that that is our past,"
    },
    {
      "id": 105,
      "start": 542.0,
      "end": 547.0,
      "text": " if you've been born again this morning, if you've trusted the Lord Jesus Christ as your personal Savior,"
    },
    {
      "id": 106,
      "start": 547.0,
      "end": 550.0,
      "text": " if you could sing that song that we started out with this morning,"
    },
    {
      "id": 107,
      "start": 550.0,
      "end": 554.0,
      "text": " that I'm saved by the blood of the crucified one,"
    },
    {
      "id": 108,
      "start": 554.0,
      "end": 561.0,
      "text": " now I am saved and I am in the world, but I'm not of the world."
    },
    {
      "id": 109,
      "start": 561.0,
      "end": 565.0,
      "text": " And we understand what's happening and what God gives us in His Word"
    },
    {
      "id": 110,
      "start": 565.0,
      "end": 572.0,
      "text": " with regard to all of this transpiring and this great battle that takes place."
    },
    {
      "id": 111,
      "start": 572.0,
      "end": 577.0,
      "text": " So here's what happens. I was walking after the course of this world."
    },
    {
      "id": 112,
      "start": 577.0,
      "end": 580.0,
      "text": " Now I'm saved. I have a new nature."
    },
    {
      "id": 113,
      "start": 580.0,
      "end": 586.0,
      "text": " Jesus now is my Savior, and the Holy Spirit of God indwells me."
    },
    {
      "id": 114,
      "start": 586.0,
      "end": 592.0,
      "text": " I'm heaven-bound, and He's left me here for the purpose of being His witness, His representative."
    },
    {
      "id": 115,
      "start": 592.0,
      "end": 596.0,
      "text": " And He says that we're in the world, but we're not of the world."
    },
    {
      "id": 116,
      "start": 596.0,
      "end": 600.0,
      "text": " But my flesh and your flesh still remains. Correct?"
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 608.7799997329712,
      "text": " And so here's what happens, the enemy is constantly, constantly trying to allure us"
    },
    {
      "id": 1,
      "start": 608.7799997329712,
      "end": 612.3400001525879,
      "text": " and to taint us by this world."
    },
    {
      "id": 2,
      "start": 612.3400001525879,
      "end": 620.0200004577637,
      "text": " He knows that we had our course in time past, and we walked according to the course of this"
    },
    {
      "id": 3,
      "start": 620.0200004577637,
      "end": 621.0200004577637,
      "text": " world."
    },
    {
      "id": 4,
      "start": 621.0200004577637,
      "end": 627.5400009155273,
      "text": " And so he understands that truth, but now as believers and we consider this truth of"
    },
    {
      "id": 5,
      "start": 627.5400009155273,
      "end": 634.7000007629395,
      "text": " the progression of worldliness, we are mindful that John says, love not the world, neither"
    },
    {
      "id": 6,
      "start": 634.7000007629395,
      "end": 635.9799995422363,
      "text": " the things that are in the world."
    },
    {
      "id": 7,
      "start": 635.9799995422363,
      "end": 640.5,
      "text": " I don't believe that it first starts with loving the world."
    },
    {
      "id": 8,
      "start": 640.5,
      "end": 646.4199981689453,
      "text": " That allure, that Satan is trying to tempt us and trying to taint us and pull us in."
    },
    {
      "id": 9,
      "start": 646.4199981689453,
      "end": 651.9799995422363,
      "text": " James 4 and verse number 4 tells us that we're not to be a friend of the world."
    },
    {
      "id": 10,
      "start": 651.9799995422363,
      "end": 656.0400009155273,
      "text": " Notice what the Bible says in James chapter number 4 and verse number 4, when we think"
    },
    {
      "id": 11,
      "start": 656.0400009155273,
      "end": 662.0400009155273,
      "text": " about these truths and consider the progression this morning of worldliness by way of really"
    },
    {
      "id": 12,
      "start": 662.0400009155273,
      "end": 667.7600021362305,
      "text": " getting into this passage in 1 John, notice the Bible says this in James 4 and verse number"
    },
    {
      "id": 13,
      "start": 667.7600021362305,
      "end": 674.7600021362305,
      "text": " 4, ye adulterers and adulteresses, know ye not that the friendship of the world is enmity"
    },
    {
      "id": 14,
      "start": 674.7600021362305,
      "end": 681.3399963378906,
      "text": " with God, whosoever therefore will be a friend of the world is the enemy of God."
    },
    {
      "id": 15,
      "start": 681.3399963378906,
      "end": 684.9800033569336,
      "text": " You say, pastor, that's strong language, that's Bible."
    },
    {
      "id": 16,
      "start": 684.9800033569336,
      "end": 691.379997253418,
      "text": " When he says ye adulterers and adulteresses, I immediately, my mind races back to the book"
    },
    {
      "id": 17,
      "start": 691.379997253418,
      "end": 697.5199966430664,
      "text": " of Hosea, to the prophets of Israel when they were prophesying and they were preaching and"
    },
    {
      "id": 18,
      "start": 697.5199966430664,
      "end": 704.4599990844727,
      "text": " proclaiming that they, the nation had left and they followed after idols and they were"
    },
    {
      "id": 19,
      "start": 704.4599990844727,
      "end": 709.6999969482422,
      "text": " guilty of this spiritual adultery."
    },
    {
      "id": 20,
      "start": 709.6999969482422,
      "end": 715.8199996948242,
      "text": " We find here that God says that we're not to have friendship with the world because"
    },
    {
      "id": 21,
      "start": 715.8199996948242,
      "end": 719.0599975585938,
      "text": " friendship with the world is enmity with God."
    },
    {
      "id": 22,
      "start": 719.0599975585938,
      "end": 723.9400024414062,
      "text": " And he says, whosoever therefore will be a friend of the world is the enemy of God."
    },
    {
      "id": 23,
      "start": 723.9400024414062,
      "end": 727.4400024414062,
      "text": " I don't want to be God's enemy, amen?"
    },
    {
      "id": 24,
      "start": 727.4400024414062,
      "end": 732.5,
      "text": " And so it begins with this friendship and we find that the Bible tells us, look back"
    },
    {
      "id": 25,
      "start": 732.5,
      "end": 737.9799957275391,
      "text": " a few passages or a few pages in James 1 and verse number 27, notice what he says here,"
    },
    {
      "id": 26,
      "start": 737.9799957275391,
      "end": 742.1000061035156,
      "text": " pure religion and undefiled before God and the Father is this, to visit the fatherless"
    },
    {
      "id": 27,
      "start": 742.1000061035156,
      "end": 749.1399993896484,
      "text": " and widows in their affliction, notice what he says, and to keep himself unspotted from"
    },
    {
      "id": 28,
      "start": 749.1399993896484,
      "end": 751.0200042724609,
      "text": " the world."
    },
    {
      "id": 29,
      "start": 751.0200042724609,
      "end": 753.4199981689453,
      "text": " You know what happens when I begin to be a friend of the world?"
    },
    {
      "id": 30,
      "start": 753.4199981689453,
      "end": 756.5800018310547,
      "text": " I begin to be spotted by the world."
    },
    {
      "id": 31,
      "start": 756.5800018310547,
      "end": 761.8999938964844,
      "text": " So I have no friendship with the world so that I can keep myself unspotted from the"
    },
    {
      "id": 32,
      "start": 761.8999938964844,
      "end": 766.8999938964844,
      "text": " world, James 1 and verse number 27, and we find that we then come to 1 John 2 where we"
    },
    {
      "id": 33,
      "start": 766.8999938964844,
      "end": 772.2599945068359,
      "text": " see that the Bible says, love not the world, neither the things that are in the world."
    },
    {
      "id": 34,
      "start": 772.2599945068359,
      "end": 774.4799957275391,
      "text": " See that love doesn't happen overnight."
    },
    {
      "id": 35,
      "start": 774.4799957275391,
      "end": 776.6600036621094,
      "text": " It's not something that just immediately takes place."
    },
    {
      "id": 36,
      "start": 776.6600036621094,
      "end": 781.2200012207031,
      "text": " There's this progression of worldliness and the reality is that the enemy wants you to"
    },
    {
      "id": 37,
      "start": 781.2200012207031,
      "end": 785.2200012207031,
      "text": " be worldly, the enemy wants me to be worldly so that we could be at odds with God so that"
    },
    {
      "id": 38,
      "start": 785.2200012207031,
      "end": 790.1600036621094,
      "text": " we can be ineffective in the purpose in which God has left us here."
    },
    {
      "id": 39,
      "start": 790.1600036621094,
      "end": 792.6399993896484,
      "text": " God has left us here to be different."
    },
    {
      "id": 40,
      "start": 792.6399993896484,
      "end": 794.7400054931641,
      "text": " We're not to be like the world."
    },
    {
      "id": 41,
      "start": 794.7400054931641,
      "end": 796.3200073242188,
      "text": " We're not to love the world."
    },
    {
      "id": 42,
      "start": 796.3200073242188,
      "end": 797.6799926757812,
      "text": " He tells us, love not the world."
    },
    {
      "id": 43,
      "start": 797.6799926757812,
      "end": 799.6000061035156,
      "text": " Do you remember Demas?"
    },
    {
      "id": 44,
      "start": 799.6000061035156,
      "end": 803.3200073242188,
      "text": " The Bible tells us of Demas, that he hath forsaken me, what does it say?"
    },
    {
      "id": 45,
      "start": 803.3200073242188,
      "end": 806.5599975585938,
      "text": " Having loved this present world."
    },
    {
      "id": 46,
      "start": 806.5599975585938,
      "end": 812.6000061035156,
      "text": " In Romans chapter number 12, we read of that great truth in verses 1 and 2 where Paul gives"
    },
    {
      "id": 47,
      "start": 812.6000061035156,
      "end": 818.5200042724609,
      "text": " this really a culmination of the book of Romans and he comes to this 12th chapter and he says,"
    },
    {
      "id": 48,
      "start": 818.5200042724609,
      "end": 823.3200073242188,
      "text": " I beseech you therefore, brethren, by the mercies of God, that you present your bodies"
    },
    {
      "id": 49,
      "start": 823.3200073242188,
      "end": 828.3600006103516,
      "text": " a living sacrifice, holy, acceptable unto God, which is your reasonable service, and"
    },
    {
      "id": 50,
      "start": 828.3600006103516,
      "end": 835.6799926757812,
      "text": " then he says this, and be not conformed to this world, but be transformed, how?"
    },
    {
      "id": 51,
      "start": 835.6799926757812,
      "end": 841.5200042724609,
      "text": " By the renewing of your mind that you may prove what is that good and acceptable and"
    },
    {
      "id": 52,
      "start": 841.5200042724609,
      "end": 845.5800018310547,
      "text": " perfect will of God."
    },
    {
      "id": 53,
      "start": 845.5800018310547,
      "end": 847.8399963378906,
      "text": " How do I prevent this progression?"
    },
    {
      "id": 54,
      "start": 847.8399963378906,
      "end": 851.4400024414062,
      "text": " We'll look at some things here in just a moment that I hope will be a blessing to you and"
    },
    {
      "id": 55,
      "start": 851.4400024414062,
      "end": 856.6000061035156,
      "text": " will help us as we consider this progression of worldliness, but I want you to be mindful"
    },
    {
      "id": 56,
      "start": 856.6000061035156,
      "end": 861.3200073242188,
      "text": " of this, if I could use an illustration quickly from the book of Genesis."
    },
    {
      "id": 57,
      "start": 861.3200073242188,
      "end": 867.2799987792969,
      "text": " Notice back in Genesis chapter number 13, I'll say this, Lot didn't end up in Sodom"
    },
    {
      "id": 58,
      "start": 867.2799987792969,
      "end": 869.9200134277344,
      "text": " overnight."
    },
    {
      "id": 59,
      "start": 869.9200134277344,
      "end": 872.4400024414062,
      "text": " Lot didn't end up in Sodom overnight."
    },
    {
      "id": 60,
      "start": 872.4400024414062,
      "end": 877.0,
      "text": " The Bible tells us in Genesis chapter number 13, in verse number 12, but even if you think"
    },
    {
      "id": 61,
      "start": 877.0,
      "end": 881.7999877929688,
      "text": " about the context in the book of Genesis, it tells us in chapter 13 and verse number"
    },
    {
      "id": 62,
      "start": 881.7999877929688,
      "end": 886.3599853515625,
      "text": " 7, there was a strife there between the herdmen of Abram's cattle and the herdmen of Lot's"
    },
    {
      "id": 63,
      "start": 886.3599853515625,
      "end": 890.6000061035156,
      "text": " cattle, and the Bible tells us that the Canaanite and the Perizzite dwelt in the land at that"
    },
    {
      "id": 64,
      "start": 890.6000061035156,
      "end": 895.760009765625,
      "text": " time, according to Genesis 13 and verse number 7."
    },
    {
      "id": 65,
      "start": 895.760009765625,
      "end": 901.239990234375,
      "text": " Abram says that there should be no strife, and the instruction is given with regard to"
    },
    {
      "id": 66,
      "start": 901.239990234375,
      "end": 906.3599853515625,
      "text": " where they would go and how they would depart, and it tells us in verse number 12 of Genesis"
    },
    {
      "id": 67,
      "start": 906.3599853515625,
      "end": 911.8200073242188,
      "text": " 13 that Abram dwelt in the land of Canaan, but it says this, that Lot dwelt in the cities"
    },
    {
      "id": 68,
      "start": 911.8200073242188,
      "end": 919.1199951171875,
      "text": " of the plain, but notice this phrase, he pitched his tent towards Sodom."
    },
    {
      "id": 69,
      "start": 919.1199951171875,
      "end": 920.760009765625,
      "text": " He pitched his tent towards Sodom."
    },
    {
      "id": 70,
      "start": 920.760009765625,
      "end": 922.7999877929688,
      "text": " He's not in Sodom."
    },
    {
      "id": 71,
      "start": 922.7999877929688,
      "end": 925.5599975585938,
      "text": " He's just pitched his tent towards Sodom."
    },
    {
      "id": 72,
      "start": 925.5599975585938,
      "end": 931.0799865722656,
      "text": " The Bible tells us, if you consider the progression in chapter number 14, of course you read of"
    },
    {
      "id": 73,
      "start": 931.0799865722656,
      "end": 936.2799987792969,
      "text": " the battle that takes place and how Abram is going to deliver Lot, but notice what the"
    },
    {
      "id": 74,
      "start": 936.2799987792969,
      "end": 939.1600036621094,
      "text": " Bible tells us about this great battle."
    },
    {
      "id": 75,
      "start": 939.1600036621094,
      "end": 946.3999938964844,
      "text": " It tells us in verse number 12 of Genesis 14, and they took Lot, Abram's brother's son."
    },
    {
      "id": 76,
      "start": 946.3999938964844,
      "end": 955.6000061035156,
      "text": " Notice this phrase, who dwelt in Sodom, and his goods, and departed, and so Lot was now,"
    },
    {
      "id": 77,
      "start": 955.6000061035156,
      "end": 960.760009765625,
      "text": " in Genesis 13, he had pitched his tent towards Sodom, but now in Genesis chapter 14 and verse"
    },
    {
      "id": 78,
      "start": 960.760009765625,
      "end": 966.0,
      "text": " number 12, the Bible tells us that he dwelt in Sodom."
    },
    {
      "id": 79,
      "start": 966.0,
      "end": 969.9200134277344,
      "text": " As you continue through the book of Genesis, you come to the 19th chapter, and you find"
    },
    {
      "id": 80,
      "start": 969.9200134277344,
      "end": 972.0,
      "text": " something very interesting in the first verse."
    },
    {
      "id": 81,
      "start": 972.0,
      "end": 976.6000061035156,
      "text": " Of course, in chapter 18, God had revealed to Abraham that he was going to destroy Sodom"
    },
    {
      "id": 82,
      "start": 976.6000061035156,
      "end": 980.760009765625,
      "text": " and Gomorrah because of their wickedness, but the Bible tells us that these angels come"
    },
    {
      "id": 83,
      "start": 980.760009765625,
      "end": 985.5199890136719,
      "text": " to the city of Sodom, and even in Genesis 19 and verse number 1, and I want you to notice"
    },
    {
      "id": 84,
      "start": 985.5199890136719,
      "end": 990.4800109863281,
      "text": " that the Bible says that Lot sat in the gate of Sodom."
    },
    {
      "id": 85,
      "start": 990.4800109863281,
      "end": 996.3200073242188,
      "text": " He had some level of influence and some level of responsibility, perhaps even being a judge"
    },
    {
      "id": 86,
      "start": 996.3200073242188,
      "end": 1001.3599853515625,
      "text": " in the city at some level, and the Bible tells us that they, as these two angels came into"
    },
    {
      "id": 87,
      "start": 1001.3599853515625,
      "end": 1004.7200012207031,
      "text": " the city, that Lot sat in the gate."
    },
    {
      "id": 88,
      "start": 1004.7200012207031,
      "end": 1007.3999938964844,
      "text": " He sat in the gate of Sodom."
    },
    {
      "id": 89,
      "start": 1007.3999938964844,
      "end": 1010.3599853515625,
      "text": " He didn't get there overnight."
    },
    {
      "id": 90,
      "start": 1010.3599853515625,
      "end": 1012.2799987792969,
      "text": " He pitched his tent towards Sodom."
    },
    {
      "id": 91,
      "start": 1012.2799987792969,
      "end": 1013.9200134277344,
      "text": " There was a progression."
    },
    {
      "id": 92,
      "start": 1013.9200134277344,
      "end": 1019.1199951171875,
      "text": " He dwelt in Sodom, and then now he's sitting in the gate of Sodom."
    },
    {
      "id": 93,
      "start": 1019.760009765625,
      "end": 1024.7999877929688,
      "text": " We begin to think about the progression of worldliness this morning, and we find where"
    },
    {
      "id": 94,
      "start": 1024.7999877929688,
      "end": 1033.6400146484375,
      "text": " John says in 1 John 2, love not the world, neither the things that are in the world."
    },
    {
      "id": 95,
      "start": 1033.6400146484375,
      "end": 1038.9599914550781,
      "text": " Notice what he says, if any man love the world, the love of the Father is not in him."
    },
    {
      "id": 96,
      "start": 1038.9599914550781,
      "end": 1041.760009765625,
      "text": " Again, strong language."
    },
    {
      "id": 97,
      "start": 1041.760009765625,
      "end": 1047.7200012207031,
      "text": " God is being very direct and very strong with regard to this situation, and we must understand"
    },
    {
      "id": 98,
      "start": 1048.5199890136719,
      "end": 1054.239990234375,
      "text": " that the enemy, again, is constantly trying to allure us by the things of this world,"
    },
    {
      "id": 99,
      "start": 1054.239990234375,
      "end": 1059.4400024414062,
      "text": " the glitter and the shiny and all of the things of this world."
    },
    {
      "id": 100,
      "start": 1059.4400024414062,
      "end": 1063.0,
      "text": " We begin to consider the progression, but now I want you to notice as we continue to"
    },
    {
      "id": 101,
      "start": 1063.0,
      "end": 1068.8800048828125,
      "text": " make progress through this passage of Scripture, number two this morning, the pitfalls to avoid."
    },
    {
      "id": 102,
      "start": 1068.8800048828125,
      "end": 1070.9200134277344,
      "text": " I'm thankful for verse number 16."
    },
    {
      "id": 103,
      "start": 1070.9200134277344,
      "end": 1075.8800048828125,
      "text": " God gives us here in this verse of Scripture some pitfalls to avoid."
    },
    {
      "id": 104,
      "start": 1075.8800048828125,
      "end": 1080.5599975585938,
      "text": " Notice what he says, for all that is in the world, and then he lists these three things,"
    },
    {
      "id": 105,
      "start": 1080.5599975585938,
      "end": 1086.7200012207031,
      "text": " the lust of the flesh and the lust of the eyes and the pride of life is not of the Father,"
    },
    {
      "id": 106,
      "start": 1086.7200012207031,
      "end": 1090.0799865722656,
      "text": " but is of the world."
    },
    {
      "id": 107,
      "start": 1090.0799865722656,
      "end": 1095.0,
      "text": " Notice he begins with the lust of the flesh, that materialism, that consumerism, and is"
    },
    {
      "id": 108,
      "start": 1095.0,
      "end": 1100.6000061035156,
      "text": " it not true that we live in a society, in a culture where there is a great lust of the"
    },
    {
      "id": 109,
      "start": 1100.6000061035156,
      "end": 1101.6000061035156,
      "text": " flesh?"
    },
    {
      "id": 110,
      "start": 1102.1199951171875,
      "end": 1106.239990234375,
      "text": " It's amazing when you think about our society and you think about our culture, obviously"
    },
    {
      "id": 111,
      "start": 1106.239990234375,
      "end": 1111.8399963378906,
      "text": " as a nation we're in crazy amounts of debt, but the population of America, for the most"
    },
    {
      "id": 112,
      "start": 1111.8399963378906,
      "end": 1116.5399780273438,
      "text": " part, and I'm thankful that there are some that aren't bound by this, but there are many"
    },
    {
      "id": 113,
      "start": 1116.5399780273438,
      "end": 1123.8400268554688,
      "text": " that are in great depths of debt because of this materialism, because of this consumerism,"
    },
    {
      "id": 114,
      "start": 1123.8400268554688,
      "end": 1129.3599853515625,
      "text": " because of this lust of the flesh, and we find that the enemy often uses, as you think"
    },
    {
      "id": 115,
      "start": 1129.3599853515625,
      "end": 1132.52001953125,
      "text": " about the connection between the lust of the flesh and then the second point that he"
    },
    {
      "id": 116,
      "start": 1132.52001953125,
      "end": 1135.1199951171875,
      "text": " brings up, the lust of the eyes."
    },
    {
      "id": 117,
      "start": 1135.1199951171875,
      "end": 1137.6799926757812,
      "text": " How often the enemy uses the eye gate."
    },
    {
      "id": 118,
      "start": 1137.6799926757812,
      "end": 1145.3599853515625,
      "text": " You think about the marketing industry and all of their creativity and all of their approach"
    },
    {
      "id": 119,
      "start": 1145.3599853515625,
      "end": 1151.9199829101562,
      "text": " to try to get you and to get me, to get our society to think that we absolutely need whatever"
    },
    {
      "id": 120,
      "start": 1151.9199829101562,
      "end": 1157.1199951171875,
      "text": " this thing is that they're marketing, and that we just flat out cannot live life without"
    },
    {
      "id": 121,
      "start": 1157.1199951171875,
      "end": 1160.1599731445312,
      "text": " it."
    },
    {
      "id": 122,
      "start": 1160.1599731445312,
      "end": 1164.8400268554688,
      "text": " You think about this world system and you think about the lust of the flesh, the lust"
    },
    {
      "id": 123,
      "start": 1164.8400268554688,
      "end": 1170.3200073242188,
      "text": " of the eyes, he then mentions the pride of life, understanding this morning that pride"
    },
    {
      "id": 124,
      "start": 1170.3200073242188,
      "end": 1176.4400024414062,
      "text": " is at the very center of sin in general as we speak about the danger of pride, the deception"
    },
    {
      "id": 125,
      "start": 1176.4400024414062,
      "end": 1179.52001953125,
      "text": " of pride, the destruction of pride."
    },
    {
      "id": 126,
      "start": 1179.52001953125,
      "end": 1184.3200073242188,
      "text": " And we understand this morning that as you look at these three pitfalls that are mentioned,"
    },
    {
      "id": 127,
      "start": 1184.3200073242188,
      "end": 1189.0399780273438,
      "text": " the lust of the flesh, the lust of the eyes, the pride of life, and we think about the"
    },
    {
      "id": 128,
      "start": 1189.0399780273438,
      "end": 1193.8800048828125,
      "text": " truth that he gives us at the end of the verse, he says, this is not of the Father, but is"
    },
    {
      "id": 129,
      "start": 1193.8800048828125,
      "end": 1194.8800048828125,
      "text": " of the world."
    },
    {
      "id": 130,
      "start": 1194.8800048828125,
      "end": 1195.8800048828125,
      "text": " It's of the world."
    },
    {
      "id": 131,
      "start": 1195.8800048828125,
      "end": 1198.239990234375,
      "text": " Turn back to the book of Genesis once again."
    },
    {
      "id": 132,
      "start": 1198.239990234375,
      "end": 1200.0,
      "text": " We were in Genesis looking at this…"
    },
    {
      "id": 0,
      "start": 1200.0,
      "end": 1204.4800000190735,
      "text": " progression, but I want you to go to Genesis 3, a familiar portion of Scripture for many"
    },
    {
      "id": 1,
      "start": 1204.4800000190735,
      "end": 1208.960000038147,
      "text": " of us this morning, and we know this as being the account in which the Bible records for"
    },
    {
      "id": 2,
      "start": 1208.960000038147,
      "end": 1213.960000038147,
      "text": " us the fall of man when sin entered into the world."
    },
    {
      "id": 3,
      "start": 1213.960000038147,
      "end": 1218.2800006866455,
      "text": " And I want you to see that in this very passage of Scripture, that the lust of the flesh,"
    },
    {
      "id": 4,
      "start": 1218.2800006866455,
      "end": 1222.2399997711182,
      "text": " the lust of the eyes, and the pride of life is all contained."
    },
    {
      "id": 5,
      "start": 1222.2399997711182,
      "end": 1229.0400009155273,
      "text": " We find that here oftentimes as we look at this passage of Scripture, perhaps we are"
    },
    {
      "id": 6,
      "start": 1229.0400009155273,
      "end": 1234.6399993896484,
      "text": " mindful of what takes place and we're familiar with the account, but we must recognize this"
    },
    {
      "id": 7,
      "start": 1234.6399993896484,
      "end": 1239.159999847412,
      "text": " morning that the enemy still uses the same approach."
    },
    {
      "id": 8,
      "start": 1239.159999847412,
      "end": 1244.3199996948242,
      "text": " The lust of the flesh, the lust of the eyes, and the pride of life."
    },
    {
      "id": 9,
      "start": 1244.3199996948242,
      "end": 1248.2799987792969,
      "text": " Notice in verse number one, now the serpent was more subtle than any beast of the field"
    },
    {
      "id": 10,
      "start": 1248.2799987792969,
      "end": 1250.159999847412,
      "text": " which the Lord God had made."
    },
    {
      "id": 11,
      "start": 1250.159999847412,
      "end": 1255.3600006103516,
      "text": " And he said unto the woman, Yea, hath God said, Ye shall not eat of every tree of the"
    },
    {
      "id": 12,
      "start": 1255.3600006103516,
      "end": 1256.3600006103516,
      "text": " garden."
    },
    {
      "id": 13,
      "start": 1256.3600006103516,
      "end": 1260.400001525879,
      "text": " And the woman said unto the serpent, We may eat of the fruit of the trees of the garden,"
    },
    {
      "id": 14,
      "start": 1260.400001525879,
      "end": 1264.3600006103516,
      "text": " but of the fruit of the tree which is in the midst of the garden, God hath said, Ye shall"
    },
    {
      "id": 15,
      "start": 1264.3600006103516,
      "end": 1267.379997253418,
      "text": " not eat of it, neither shall ye touch it, lest ye die."
    },
    {
      "id": 16,
      "start": 1267.379997253418,
      "end": 1272.4800033569336,
      "text": " And the serpent said unto the woman, Ye shall not surely die."
    },
    {
      "id": 17,
      "start": 1272.4800033569336,
      "end": 1277.4800033569336,
      "text": " For God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall"
    },
    {
      "id": 18,
      "start": 1277.4800033569336,
      "end": 1279.879997253418,
      "text": " be as gods, knowing good and evil."
    },
    {
      "id": 19,
      "start": 1279.879997253418,
      "end": 1283.3600006103516,
      "text": " Notice this in verse number six."
    },
    {
      "id": 20,
      "start": 1283.3600006103516,
      "end": 1292.7200012207031,
      "text": " And when the woman saw that the tree was good for food, we see the lust of the flesh."
    },
    {
      "id": 21,
      "start": 1292.7200012207031,
      "end": 1297.1399993896484,
      "text": " Oftentimes we think about the lust of the flesh, we are immediately thinking of sensuality"
    },
    {
      "id": 22,
      "start": 1297.1399993896484,
      "end": 1302.8000030517578,
      "text": " and sexual desires, and certainly there's truth in the Word of God about fleeing fornication"
    },
    {
      "id": 23,
      "start": 1302.8000030517578,
      "end": 1305.8399963378906,
      "text": " and fleeing youthful lust and all of that truth."
    },
    {
      "id": 24,
      "start": 1305.9199981689453,
      "end": 1311.3199996948242,
      "text": " You see here that the lust of the flesh for Eve was that it was good for food."
    },
    {
      "id": 25,
      "start": 1311.3199996948242,
      "end": 1316.5599975585938,
      "text": " She saw it, the Bible tells us, notice it continues and says that it was pleasant to"
    },
    {
      "id": 26,
      "start": 1316.5599975585938,
      "end": 1317.5599975585938,
      "text": " the eyes."
    },
    {
      "id": 27,
      "start": 1317.5599975585938,
      "end": 1320.2399978637695,
      "text": " It was pleasant to the eyes."
    },
    {
      "id": 28,
      "start": 1320.2399978637695,
      "end": 1323.6399993896484,
      "text": " The lust of the flesh, the lust of the eyes."
    },
    {
      "id": 29,
      "start": 1323.6399993896484,
      "end": 1329.8000030517578,
      "text": " But notice this as the verse continues, that it was pleasant to the eyes and a tree to"
    },
    {
      "id": 30,
      "start": 1329.8000030517578,
      "end": 1336.479995727539,
      "text": " be desired why, to make one wise."
    },
    {
      "id": 31,
      "start": 1336.479995727539,
      "end": 1337.479995727539,
      "text": " So what did she do?"
    },
    {
      "id": 32,
      "start": 1337.479995727539,
      "end": 1342.0,
      "text": " She took of the fruit thereof and did eat, and gave also unto her husband with her, and"
    },
    {
      "id": 33,
      "start": 1342.0,
      "end": 1343.6799926757812,
      "text": " he did eat."
    },
    {
      "id": 34,
      "start": 1343.6799926757812,
      "end": 1347.1600036621094,
      "text": " The eyes of them both were open, and they knew that they were naked, and they sewed"
    },
    {
      "id": 35,
      "start": 1347.1600036621094,
      "end": 1349.9600067138672,
      "text": " fig leaves together and made themselves aprons."
    },
    {
      "id": 36,
      "start": 1349.9600067138672,
      "end": 1354.1600036621094,
      "text": " We're familiar with all that takes place here with the judgment and all that God does and"
    },
    {
      "id": 37,
      "start": 1354.1600036621094,
      "end": 1358.9199981689453,
      "text": " how at the end of the passage He provides for them a coat of skins and the grace and"
    },
    {
      "id": 38,
      "start": 1358.9199981689453,
      "end": 1363.6399993896484,
      "text": " mercy of God that is displayed there, but we find here in verse number 6 exactly what"
    },
    {
      "id": 39,
      "start": 1363.6399993896484,
      "end": 1368.759994506836,
      "text": " we find in 1 John 2 and verse number 16 when He tells us there's some pitfalls to avoid."
    },
    {
      "id": 40,
      "start": 1368.759994506836,
      "end": 1374.8800048828125,
      "text": " The lust of the flesh, the lust of the eyes, the pride of life, and we see these possessions"
    },
    {
      "id": 41,
      "start": 1374.8800048828125,
      "end": 1375.8800048828125,
      "text": " in position."
    },
    {
      "id": 42,
      "start": 1375.8800048828125,
      "end": 1380.0800018310547,
      "text": " If we could note that this morning and we can see here in the life of Eve where then"
    },
    {
      "id": 43,
      "start": 1380.0800018310547,
      "end": 1384.479995727539,
      "text": " all three are active in verse number 6, the lust of the flesh, the lust of the eyes, and"
    },
    {
      "id": 44,
      "start": 1384.479995727539,
      "end": 1391.240005493164,
      "text": " the pride of life, and the enemy continues to use the same playbook."
    },
    {
      "id": 45,
      "start": 1391.240005493164,
      "end": 1398.1999969482422,
      "text": " And it's so sad that he uses the same playbook and there are still countless people that"
    },
    {
      "id": 46,
      "start": 1398.1999969482422,
      "end": 1401.3399963378906,
      "text": " become casualties."
    },
    {
      "id": 47,
      "start": 1401.3399963378906,
      "end": 1404.0800018310547,
      "text": " The allure, the pitfalls to avoid."
    },
    {
      "id": 48,
      "start": 1404.0800018310547,
      "end": 1408.6000061035156,
      "text": " The question that I ask if I'm going to mention the pitfalls that are given to us here in"
    },
    {
      "id": 49,
      "start": 1408.6000061035156,
      "end": 1412.520004272461,
      "text": " verse number 16, the lust of the flesh, the lust of the eyes, and the pride of life, I'd"
    },
    {
      "id": 50,
      "start": 1412.520004272461,
      "end": 1415.520004272461,
      "text": " ask the question, how can I avoid these pitfalls?"
    },
    {
      "id": 51,
      "start": 1415.520004272461,
      "end": 1418.4400024414062,
      "text": " Is it even possible that I can avoid these pitfalls?"
    },
    {
      "id": 52,
      "start": 1418.4400024414062,
      "end": 1421.240005493164,
      "text": " The answer is yes."
    },
    {
      "id": 53,
      "start": 1421.240005493164,
      "end": 1426.520004272461,
      "text": " Five simple thoughts, really six simple thoughts this morning on how we can avoid these pitfalls."
    },
    {
      "id": 54,
      "start": 1426.520004272461,
      "end": 1431.8600006103516,
      "text": " Number one, and this might be a little bit too basic, but I would say it's necessary,"
    },
    {
      "id": 55,
      "start": 1431.8600006103516,
      "end": 1434.1999969482422,
      "text": " we avoid them first by knowing what they are."
    },
    {
      "id": 56,
      "start": 1434.1999969482422,
      "end": 1438.2799987792969,
      "text": " If I don't know what they are, it's going to be hard for me to avoid them."
    },
    {
      "id": 57,
      "start": 1438.2799987792969,
      "end": 1441.6399993896484,
      "text": " But when I know that He tells me it's the lust of the flesh, the lust of the eyes, and"
    },
    {
      "id": 58,
      "start": 1441.6399993896484,
      "end": 1446.8399963378906,
      "text": " the pride of life, all that is in the world, and He sums them up in these three statements,"
    },
    {
      "id": 59,
      "start": 1446.8399963378906,
      "end": 1453.3399963378906,
      "text": " then I know what these pitfalls are, and God, with God's help and by God's grace, and having"
    },
    {
      "id": 60,
      "start": 1453.3399963378906,
      "end": 1455.8000030517578,
      "text": " a knowledge of them, I can avoid them."
    },
    {
      "id": 61,
      "start": 1455.8000030517578,
      "end": 1459.4800109863281,
      "text": " Notice this, I believe that we must put on the whole armor of God."
    },
    {
      "id": 62,
      "start": 1459.4800109863281,
      "end": 1462.9200134277344,
      "text": " We're familiar with the passage of Scripture in Ephesians chapter number 6 that we're to"
    },
    {
      "id": 63,
      "start": 1462.9200134277344,
      "end": 1467.2799987792969,
      "text": " be strong in the Lord and the power of His might, that we're to put on the whole armor"
    },
    {
      "id": 64,
      "start": 1467.2799987792969,
      "end": 1468.2799987792969,
      "text": " of God."
    },
    {
      "id": 65,
      "start": 1468.2799987792969,
      "end": 1472.1199951171875,
      "text": " And when He goes through and He begins to list for us what those pieces of armor are,"
    },
    {
      "id": 66,
      "start": 1472.1199951171875,
      "end": 1476.8399963378906,
      "text": " we do not have time this morning to develop all of that, but it's necessary for us daily"
    },
    {
      "id": 67,
      "start": 1476.8399963378906,
      "end": 1480.7200012207031,
      "text": " to put on that whole armor of God."
    },
    {
      "id": 68,
      "start": 1480.7200012207031,
      "end": 1488.8399963378906,
      "text": " Because we understand that that enemy, our enemy, he's going to shoot those fiery darts."
    },
    {
      "id": 69,
      "start": 1488.8399963378906,
      "end": 1494.3200073242188,
      "text": " And we find that we put on that whole armor of God, I'd say this, as Paul recorded for"
    },
    {
      "id": 70,
      "start": 1494.3200073242188,
      "end": 1500.0799865722656,
      "text": " us there in the book of Philippians, how that he learned contentment, number three,"
    },
    {
      "id": 71,
      "start": 1500.0799865722656,
      "end": 1503.4400024414062,
      "text": " of how to avoid these pitfalls, knowing what they are, number one, number two, putting"
    },
    {
      "id": 72,
      "start": 1503.4400024414062,
      "end": 1509.5599975585938,
      "text": " on the whole armor of God, number three, by learning contentment, by learning contentment."
    },
    {
      "id": 73,
      "start": 1509.5599975585938,
      "end": 1514.1199951171875,
      "text": " The apostle Paul says this in the book of Philippians with regard to the subject matter"
    },
    {
      "id": 74,
      "start": 1514.1199951171875,
      "end": 1518.1199951171875,
      "text": " of contentment, and what a blessing to think about this truth."
    },
    {
      "id": 75,
      "start": 1518.1199951171875,
      "end": 1523.7999877929688,
      "text": " He says, not that I speak in respect of want, notice, for I have learned in whatsoever state"
    },
    {
      "id": 76,
      "start": 1523.7999877929688,
      "end": 1526.6799926757812,
      "text": " I am therewith to be content."
    },
    {
      "id": 77,
      "start": 1526.6799926757812,
      "end": 1530.6799926757812,
      "text": " I've always, as I look at this passage of Scripture, I've always focused and really"
    },
    {
      "id": 78,
      "start": 1530.6799926757812,
      "end": 1537.7999877929688,
      "text": " considered the importance of that phrase when he says, for I have learned."
    },
    {
      "id": 79,
      "start": 1537.7999877929688,
      "end": 1544.760009765625,
      "text": " You know, in our most basic state, we are not content people."
    },
    {
      "id": 80,
      "start": 1544.760009765625,
      "end": 1547.1600036621094,
      "text": " We're not."
    },
    {
      "id": 81,
      "start": 1547.1600036621094,
      "end": 1548.5199890136719,
      "text": " You think about the nation of Israel."
    },
    {
      "id": 82,
      "start": 1548.5199890136719,
      "end": 1550.4400024414062,
      "text": " How many times were they complaining and murmuring?"
    },
    {
      "id": 83,
      "start": 1550.4400024414062,
      "end": 1552.0400085449219,
      "text": " What was that indicative of?"
    },
    {
      "id": 84,
      "start": 1552.0400085449219,
      "end": 1555.239990234375,
      "text": " It was indicative of their discontentment."
    },
    {
      "id": 85,
      "start": 1555.239990234375,
      "end": 1558.239990234375,
      "text": " They didn't like what God had provided for them."
    },
    {
      "id": 86,
      "start": 1558.239990234375,
      "end": 1562.3999938964844,
      "text": " They're eating manna and they're saying, my soul loatheth, I hate this manna."
    },
    {
      "id": 87,
      "start": 1562.3999938964844,
      "end": 1564.2000122070312,
      "text": " We have nothing to eat."
    },
    {
      "id": 88,
      "start": 1564.2000122070312,
      "end": 1569.1199951171875,
      "text": " God miraculously was providing this."
    },
    {
      "id": 89,
      "start": 1569.1199951171875,
      "end": 1572.7200012207031,
      "text": " They were complaining and complaining and complaining."
    },
    {
      "id": 90,
      "start": 1572.7200012207031,
      "end": 1577.9599914550781,
      "text": " Complaining is the result of discontent."
    },
    {
      "id": 91,
      "start": 1577.9599914550781,
      "end": 1580.8800048828125,
      "text": " We find that we must learn contentment."
    },
    {
      "id": 92,
      "start": 1580.8800048828125,
      "end": 1586.4400024414062,
      "text": " Paul continues and says, I know both how to be abased and I know how to abound."
    },
    {
      "id": 93,
      "start": 1586.4400024414062,
      "end": 1590.3599853515625,
      "text": " Everywhere and in all things I am instructed both to be full and to be hungry, both to"
    },
    {
      "id": 94,
      "start": 1590.3599853515625,
      "end": 1593.6400146484375,
      "text": " abound and to suffer need."
    },
    {
      "id": 95,
      "start": 1593.6400146484375,
      "end": 1596.6799926757812,
      "text": " God knows what we need, doesn't He?"
    },
    {
      "id": 96,
      "start": 1596.6799926757812,
      "end": 1599.9599914550781,
      "text": " And He's capable of providing for us."
    },
    {
      "id": 97,
      "start": 1599.9599914550781,
      "end": 1604.5599975585938,
      "text": " You remember that familiar Psalm, Psalm 23, the Lord is my shepherd."
    },
    {
      "id": 98,
      "start": 1604.5599975585938,
      "end": 1605.6000061035156,
      "text": " What does He say?"
    },
    {
      "id": 99,
      "start": 1605.6000061035156,
      "end": 1610.1199951171875,
      "text": " I shall not want."
    },
    {
      "id": 100,
      "start": 1610.1199951171875,
      "end": 1612.7200012207031,
      "text": " I shall not want."
    },
    {
      "id": 101,
      "start": 1612.7200012207031,
      "end": 1615.9599914550781,
      "text": " The Lord is a good shepherd, amen?"
    },
    {
      "id": 102,
      "start": 1615.9599914550781,
      "end": 1618.0400085449219,
      "text": " He provides for us."
    },
    {
      "id": 103,
      "start": 1618.0400085449219,
      "end": 1619.0400085449219,
      "text": " And what a blessing."
    },
    {
      "id": 104,
      "start": 1619.0400085449219,
      "end": 1620.1600036621094,
      "text": " We must learn contentment."
    },
    {
      "id": 105,
      "start": 1620.1600036621094,
      "end": 1623.2799987792969,
      "text": " I would say this, we must seek the Lord Jesus Christ."
    },
    {
      "id": 106,
      "start": 1623.2799987792969,
      "end": 1627.6799926757812,
      "text": " Notice in Colossians 3, we studied this portion of Scripture last year as we studied through"
    },
    {
      "id": 107,
      "start": 1627.6799926757812,
      "end": 1633.6400146484375,
      "text": " the book of Colossians, but these first few verses of Colossians 3 are so powerful."
    },
    {
      "id": 108,
      "start": 1633.6400146484375,
      "end": 1639.3200073242188,
      "text": " When the Bible says this, if you then be risen with Christ, seek those things which are above."
    },
    {
      "id": 109,
      "start": 1639.3200073242188,
      "end": 1644.4400024414062,
      "text": " Where Christ sitteth on the right hand of God, set your affection on things above, not"
    },
    {
      "id": 110,
      "start": 1644.4400024414062,
      "end": 1646.7999877929688,
      "text": " on things of the earth."
    },
    {
      "id": 111,
      "start": 1646.7999877929688,
      "end": 1651.3200073242188,
      "text": " And as I do this, as I understand that I'm in the world but I'm not of the world, when"
    },
    {
      "id": 112,
      "start": 1651.3200073242188,
      "end": 1657.1199951171875,
      "text": " I understand and I'm so consumed with the Lord Jesus Christ and I'm looking to Him,"
    },
    {
      "id": 113,
      "start": 1657.1199951171875,
      "end": 1662.5599975585938,
      "text": " I'm seeking those things which are above, I'm setting my affection on things above,"
    },
    {
      "id": 114,
      "start": 1662.5599975585938,
      "end": 1667.3200073242188,
      "text": " not on things of the earth, oh, the things of this world aren't going to matter as much."
    },
    {
      "id": 115,
      "start": 1667.3200073242188,
      "end": 1668.3200073242188,
      "text": " Right?"
    },
    {
      "id": 116,
      "start": 1668.3200073242188,
      "end": 1672.3999938964844,
      "text": " The reproach of the enemy, the lust of the flesh and the lust of the eyes and the pride"
    },
    {
      "id": 117,
      "start": 1672.3999938964844,
      "end": 1678.2000122070312,
      "text": " of life, it's not going to be as impactful because I've set my affection on things above."
    },
    {
      "id": 118,
      "start": 1678.2000122070312,
      "end": 1682.7999877929688,
      "text": " I got my eyes on the Lord Jesus Christ."
    },
    {
      "id": 119,
      "start": 1682.7999877929688,
      "end": 1685.9599914550781,
      "text": " I'd say this, that we must be clothed with humility."
    },
    {
      "id": 120,
      "start": 1685.9599914550781,
      "end": 1688.7999877929688,
      "text": " We must be clothed with humility."
    },
    {
      "id": 121,
      "start": 1688.7999877929688,
      "end": 1695.0199890136719,
      "text": " Peter says in 1 Peter chapter 5, and we know that both James and Peter mention the truth"
    },
    {
      "id": 122,
      "start": 1695.0199890136719,
      "end": 1698.5400085449219,
      "text": " of God resisting the proud but giving grace to the humble."
    },
    {
      "id": 123,
      "start": 1698.5400085449219,
      "end": 1703.2999877929688,
      "text": " But I want you to notice what Peter says in 1 Peter chapter 5, in verse number 5, he says,"
    },
    {
      "id": 124,
      "start": 1703.2999877929688,
      "end": 1707.1799926757812,
      "text": " likewise ye younger, submit yourselves unto the elder, yea, all of you be subject one"
    },
    {
      "id": 125,
      "start": 1707.1799926757812,
      "end": 1708.260009765625,
      "text": " to another."
    },
    {
      "id": 126,
      "start": 1708.260009765625,
      "end": 1714.1400146484375,
      "text": " Notice what he says, and be clothed with humility, for God resisteth the proud and giveth grace"
    },
    {
      "id": 127,
      "start": 1714.1400146484375,
      "end": 1715.4199829101562,
      "text": " to the humble."
    },
    {
      "id": 128,
      "start": 1715.4199829101562,
      "end": 1724.0999755859375,
      "text": " Humble yourselves therefore unto the mighty hand of God that He may exalt you in due time."
    },
    {
      "id": 129,
      "start": 1724.1799926757812,
      "end": 1729.02001953125,
      "text": " The enemy wants us to get so focused upon this world and so consumed with the things"
    },
    {
      "id": 130,
      "start": 1729.02001953125,
      "end": 1734.02001953125,
      "text": " of this world that we're more concerned about our position and our possessions here and"
    },
    {
      "id": 131,
      "start": 1734.02001953125,
      "end": 1740.2999877929688,
      "text": " give less thought to what our eternal life is going to be."
    },
    {
      "id": 132,
      "start": 1740.2999877929688,
      "end": 1745.5800170898438,
      "text": " I've mentioned before, and I understand there's a whole industry that's wrapped around it,"
    },
    {
      "id": 133,
      "start": 1745.5800170898438,
      "end": 1751.3800048828125,
      "text": " and I'm not suggesting that we should not have any emphasis or focus upon planning for"
    },
    {
      "id": 134,
      "start": 1751.3800048828125,
      "end": 1753.5399780273438,
      "text": " retirement and being mindful of those things."
    },
    {
      "id": 135,
      "start": 1753.5399780273438,
      "end": 1755.5,
      "text": " And I believe that there's wisdom in that."
    },
    {
      "id": 136,
      "start": 1755.5,
      "end": 1760.4199829101562,
      "text": " But I find that in our society today that far too many have spent more time in doing"
    },
    {
      "id": 137,
      "start": 1760.4199829101562,
      "end": 1766.260009765625,
      "text": " retirement planning and estate planning than they ever give thought of eternity."
    },
    {
      "id": 138,
      "start": 1766.260009765625,
      "end": 1770.6199951171875,
      "text": " And let me say this, retirement is not guaranteed."
    },
    {
      "id": 139,
      "start": 1770.6199951171875,
      "end": 1771.6199951171875,
      "text": " Some of you are retired."
    },
    {
      "id": 140,
      "start": 1771.6199951171875,
      "end": 1773.5,
      "text": " You say, man, I've been retired."
    },
    {
      "id": 141,
      "start": 1773.5,
      "end": 1775.2999877929688,
      "text": " John tells me all the time, retirement's great."
    },
    {
      "id": 142,
      "start": 1775.2999877929688,
      "end": 1779.0999755859375,
      "text": " It's like Saturday every day."
    },
    {
      "id": 143,
      "start": 1779.0999755859375,
      "end": 1783.97998046875,
      "text": " But the reality is this, retirement's not guaranteed."
    },
    {
      "id": 144,
      "start": 1783.97998046875,
      "end": 1790.1799926757812,
      "text": " You know people that never made it to retirement, correct?"
    },
    {
      "id": 145,
      "start": 1790.1799926757812,
      "end": 1792.4600219726562,
      "text": " Eternity is guaranteed."
    },
    {
      "id": 146,
      "start": 1792.4600219726562,
      "end": 1793.4600219726562,
      "text": " Eternity is guaranteed."
    },
    {
      "id": 147,
      "start": 1793.4600219726562,
      "end": 1797.780029296875,
      "text": " Again, I'm not suggesting that we not consider retirement planning and estate planning, but"
    },
    {
      "id": 148,
      "start": 1797.780029296875,
      "end": 1799.260009765625,
      "text": " I'm saying there ought to be a balance."
    },
    {
      "id": 0,
      "start": 1799.260009765625,
      "end": 1804.6600098609924,
      "text": " Let me say this, number six, we think about how to avoid these pitfalls."
    },
    {
      "id": 1,
      "start": 1804.6600098609924,
      "end": 1808.5800094604492,
      "text": " I would say this, by the renewing of your mind."
    },
    {
      "id": 2,
      "start": 1808.5800094604492,
      "end": 1812.340009689331,
      "text": " Remember what he said as we read that portion of Scripture in Romans 12, in verse number"
    },
    {
      "id": 3,
      "start": 1812.340009689331,
      "end": 1816.8200092315674,
      "text": " two, he says, be not conformed to this world, but be ye transformed by the renewing of your"
    },
    {
      "id": 4,
      "start": 1816.8200092315674,
      "end": 1817.8200092315674,
      "text": " mind."
    },
    {
      "id": 5,
      "start": 1817.8200092315674,
      "end": 1822.4600105285645,
      "text": " You think about what Paul said in Philippians chapter number four with regard to the thought"
    },
    {
      "id": 6,
      "start": 1822.4600105285645,
      "end": 1824.1400089263916,
      "text": " of God's people."
    },
    {
      "id": 7,
      "start": 1824.1400089263916,
      "end": 1827.8200092315674,
      "text": " He says, finally, brethren, what sort of things are true, what sort of things are honest,"
    },
    {
      "id": 8,
      "start": 1827.8200092315674,
      "end": 1831.420009613037,
      "text": " what sort of things are just, what sort of things are pure, what sort of things are lovely,"
    },
    {
      "id": 9,
      "start": 1831.420009613037,
      "end": 1833.1800079345703,
      "text": " what sort of things are of good report?"
    },
    {
      "id": 10,
      "start": 1833.1800079345703,
      "end": 1837.820011138916,
      "text": " If there be any virtue and if there be any praise, think on these things."
    },
    {
      "id": 11,
      "start": 1837.820011138916,
      "end": 1843.1800079345703,
      "text": " He tells us that we're to bring every thought into the captivity, unto the obedience of"
    },
    {
      "id": 12,
      "start": 1843.1800079345703,
      "end": 1844.1800079345703,
      "text": " Christ."
    },
    {
      "id": 13,
      "start": 1844.1800079345703,
      "end": 1850.6200103759766,
      "text": " And oh, if we'd understand the battle for our mind, and when we have our mind and we"
    },
    {
      "id": 14,
      "start": 1850.6200103759766,
      "end": 1856.9000091552734,
      "text": " have our affection set on things above, as we find in Colossians chapter number three,"
    },
    {
      "id": 15,
      "start": 1856.9000091552734,
      "end": 1861.660011291504,
      "text": " how that will enable us and help us to avoid the pitfalls."
    },
    {
      "id": 16,
      "start": 1861.660011291504,
      "end": 1867.5000076293945,
      "text": " We've mentioned the progression of worldliness and we understand the friendship of the world"
    },
    {
      "id": 17,
      "start": 1867.5000076293945,
      "end": 1871.260009765625,
      "text": " and being spotted by the world and loving the world and then being conformed to this"
    },
    {
      "id": 18,
      "start": 1871.260009765625,
      "end": 1872.260009765625,
      "text": " world."
    },
    {
      "id": 19,
      "start": 1872.260009765625,
      "end": 1876.9800109863281,
      "text": " And so we don't want that as the people of God, we have been saved and Jesus said that"
    },
    {
      "id": 20,
      "start": 1876.9800109863281,
      "end": 1882.140007019043,
      "text": " he left us in this world, but we're not of the world and we're to be his representatives."
    },
    {
      "id": 21,
      "start": 1882.140007019043,
      "end": 1886.9800109863281,
      "text": " And we understand that the enemy is constantly trying to allure us and pull us back because"
    },
    {
      "id": 22,
      "start": 1886.9800109863281,
      "end": 1892.660011291504,
      "text": " he knows that in time past, prior to your salvation, prior to my salvation, every one"
    },
    {
      "id": 23,
      "start": 1892.660011291504,
      "end": 1897.5000076293945,
      "text": " of us walked according to the course of this world."
    },
    {
      "id": 24,
      "start": 1897.5000076293945,
      "end": 1901.5400085449219,
      "text": " And so we're familiar with this world system."
    },
    {
      "id": 25,
      "start": 1901.5400085449219,
      "end": 1905.4200134277344,
      "text": " Those that were saved later in life are more familiar with this world system."
    },
    {
      "id": 26,
      "start": 1905.4200134277344,
      "end": 1912.1800079345703,
      "text": " It's always tragic to me when those that were saved early in life feel like their testimony"
    },
    {
      "id": 27,
      "start": 1912.1800079345703,
      "end": 1919.2200088500977,
      "text": " is not as important or not as powerful because, oh, how God has delivered you from some really,"
    },
    {
      "id": 28,
      "start": 1919.2200088500977,
      "end": 1923.5400085449219,
      "text": " really terrible things."
    },
    {
      "id": 29,
      "start": 1923.5400085449219,
      "end": 1928.4600067138672,
      "text": " And oh, how my heart breaks when young people feel like they need to go out and experience"
    },
    {
      "id": 30,
      "start": 1928.4600067138672,
      "end": 1929.4600067138672,
      "text": " the world."
    },
    {
      "id": 31,
      "start": 1929.4600067138672,
      "end": 1934.1600036621094,
      "text": " Let me tell you this, the world is never going to satisfy you."
    },
    {
      "id": 32,
      "start": 1934.1600036621094,
      "end": 1939.760009765625,
      "text": " The world will always leave you wanting, always."
    },
    {
      "id": 33,
      "start": 1939.760009765625,
      "end": 1942.9600067138672,
      "text": " The world does not satisfy."
    },
    {
      "id": 34,
      "start": 1942.9600067138672,
      "end": 1948.6000061035156,
      "text": " The lust of the flesh and the lust of the eyes and the pride of life, it's never fulfilled."
    },
    {
      "id": 35,
      "start": 1948.6000061035156,
      "end": 1951.280014038086,
      "text": " It's never satisfied."
    },
    {
      "id": 36,
      "start": 1951.280014038086,
      "end": 1955.9200134277344,
      "text": " There's always something else and something more, and go further."
    },
    {
      "id": 37,
      "start": 1955.9200134277344,
      "end": 1960.4800109863281,
      "text": " Jesus, on the other hand, he satisfies, amen?"
    },
    {
      "id": 38,
      "start": 1960.4800109863281,
      "end": 1962.4000091552734,
      "text": " He satisfies."
    },
    {
      "id": 39,
      "start": 1962.4000091552734,
      "end": 1964.8400115966797,
      "text": " And I'm so thankful for that."
    },
    {
      "id": 40,
      "start": 1964.8400115966797,
      "end": 1966.4000091552734,
      "text": " And so we see the progression."
    },
    {
      "id": 41,
      "start": 1966.4000091552734,
      "end": 1969.1200103759766,
      "text": " We understand that there are some pitfalls to avoid."
    },
    {
      "id": 42,
      "start": 1969.1200103759766,
      "end": 1974.4800109863281,
      "text": " And I hope this morning that we would take note of those, how we can avoid these things."
    },
    {
      "id": 43,
      "start": 1974.4800109863281,
      "end": 1978.6800079345703,
      "text": " What are some things I can do in my life so that I can avoid these pitfalls because God's"
    },
    {
      "id": 44,
      "start": 1978.6800079345703,
      "end": 1980.3600158691406,
      "text": " warned me about them?"
    },
    {
      "id": 45,
      "start": 1980.3600158691406,
      "end": 1985.8400115966797,
      "text": " And the reality is that there's record of people in the Word of God that forsook because"
    },
    {
      "id": 46,
      "start": 1985.8400115966797,
      "end": 1988.1600036621094,
      "text": " they love this world."
    },
    {
      "id": 47,
      "start": 1988.1600036621094,
      "end": 1990.760009765625,
      "text": " I don't want to be there."
    },
    {
      "id": 48,
      "start": 1990.760009765625,
      "end": 1992.5400085449219,
      "text": " So how do I avoid it?"
    },
    {
      "id": 49,
      "start": 1992.5400085449219,
      "end": 1995.4400024414062,
      "text": " Number three this morning, finally, I'd say this."
    },
    {
      "id": 50,
      "start": 1995.4400024414062,
      "end": 1999.4400024414062,
      "text": " As you continue through the passage, you come to verse number 17, I would say that there's"
    },
    {
      "id": 51,
      "start": 1999.4400024414062,
      "end": 2001.1600036621094,
      "text": " a promise to embrace."
    },
    {
      "id": 52,
      "start": 2001.1600036621094,
      "end": 2006.520004272461,
      "text": " It's really a twofold promise that is given to us here, and I hope that this twofold promise"
    },
    {
      "id": 53,
      "start": 2006.520004272461,
      "end": 2009.7200164794922,
      "text": " that is given to us would cause us to be encouraged."
    },
    {
      "id": 54,
      "start": 2009.7200164794922,
      "end": 2011.3000030517578,
      "text": " Notice what the Bible says."
    },
    {
      "id": 55,
      "start": 2011.3000030517578,
      "end": 2018.2200164794922,
      "text": " It begins by telling us this, and the world passeth away and the lust thereof."
    },
    {
      "id": 56,
      "start": 2018.2200164794922,
      "end": 2020.000015258789,
      "text": " This world is going to pass away."
    },
    {
      "id": 57,
      "start": 2020.000015258789,
      "end": 2025.8800048828125,
      "text": " The world system, listen, there are times in which we look at and we understand when"
    },
    {
      "id": 58,
      "start": 2025.8800048828125,
      "end": 2029.3200073242188,
      "text": " the Bible tells us, why do the heathen rage, right?"
    },
    {
      "id": 59,
      "start": 2029.3200073242188,
      "end": 2034.2000122070312,
      "text": " And you look at Psalm 2 and you understand how the kings of the earth, they set themselves"
    },
    {
      "id": 60,
      "start": 2034.2000122070312,
      "end": 2035.6800079345703,
      "text": " against the Lord."
    },
    {
      "id": 61,
      "start": 2035.6800079345703,
      "end": 2040.520004272461,
      "text": " And you look at all that's taking place and you understand this world system in which"
    },
    {
      "id": 62,
      "start": 2040.520004272461,
      "end": 2045.1600036621094,
      "text": " we're living and we're operating, and you find that in this world system there are some"
    },
    {
      "id": 63,
      "start": 2045.3600158691406,
      "end": 2051.000015258789,
      "text": " that would try to get us to think that this world system has some level of permanence."
    },
    {
      "id": 64,
      "start": 2051.000015258789,
      "end": 2060.6000061035156,
      "text": " But no, the world system, we have the promise of God Almighty that this world passeth away"
    },
    {
      "id": 65,
      "start": 2060.6000061035156,
      "end": 2062.279998779297,
      "text": " and the lust thereof."
    },
    {
      "id": 66,
      "start": 2062.279998779297,
      "end": 2067.1199951171875,
      "text": " I'd say this, this world system is just temporary."
    },
    {
      "id": 67,
      "start": 2067.1199951171875,
      "end": 2070.240020751953,
      "text": " It's just temporary."
    },
    {
      "id": 68,
      "start": 2070.240020751953,
      "end": 2075.1199951171875,
      "text": " I understand that at times it seems like there's some level of permanence to it, and you sort"
    },
    {
      "id": 69,
      "start": 2075.1199951171875,
      "end": 2079.4000244140625,
      "text": " of see some things that are taking place, and it could bother us, it could cause us"
    },
    {
      "id": 70,
      "start": 2079.4000244140625,
      "end": 2081.800018310547,
      "text": " to have worry and concern."
    },
    {
      "id": 71,
      "start": 2081.800018310547,
      "end": 2087.8399963378906,
      "text": " But oh, how we must run to the Scriptures and how we must just comfort ourselves with"
    },
    {
      "id": 72,
      "start": 2087.8399963378906,
      "end": 2092.4000244140625,
      "text": " regard to the great promises that God has given us."
    },
    {
      "id": 73,
      "start": 2092.4000244140625,
      "end": 2094.240020751953,
      "text": " I said this several weeks ago."
    },
    {
      "id": 74,
      "start": 2094.240020751953,
      "end": 2098.3200073242188,
      "text": " I believe that it's worth repeating, there are many today that are looking at our society"
    },
    {
      "id": 75,
      "start": 2098.3200073242188,
      "end": 2102.6400146484375,
      "text": " and they're saying something like this, the world is falling apart."
    },
    {
      "id": 76,
      "start": 2102.6400146484375,
      "end": 2109.4000244140625,
      "text": " And I understand when people use that terminology, but I'd say this, it's falling in place."
    },
    {
      "id": 77,
      "start": 2109.4000244140625,
      "end": 2113.480010986328,
      "text": " When we look at the prophecy that God has given us and we look at all that's taking"
    },
    {
      "id": 78,
      "start": 2113.480010986328,
      "end": 2121.3200073242188,
      "text": " place in our world, we see things falling right in place, and God is King, amen?"
    },
    {
      "id": 79,
      "start": 2121.3200073242188,
      "end": 2123.3200073242188,
      "text": " He is King of kings and Lord of lords."
    },
    {
      "id": 80,
      "start": 2123.3200073242188,
      "end": 2125.1199951171875,
      "text": " The Lord God omnipotent reigneth."
    },
    {
      "id": 81,
      "start": 2125.1199951171875,
      "end": 2131.3200073242188,
      "text": " I was reading this morning in reading where the Bible was saying repetitively, the Lord"
    },
    {
      "id": 82,
      "start": 2131.3200073242188,
      "end": 2137.1600036621094,
      "text": " reigneth, and I'm so thankful that He's in control."
    },
    {
      "id": 83,
      "start": 2137.1600036621094,
      "end": 2143.1600036621094,
      "text": " The promise for you, the promise for me, as we live in this world system, that we understand"
    },
    {
      "id": 84,
      "start": 2143.1600036621094,
      "end": 2144.8800048828125,
      "text": " this world is not my home."
    },
    {
      "id": 85,
      "start": 2144.8800048828125,
      "end": 2147.1199951171875,
      "text": " This world system is just temporary."
    },
    {
      "id": 86,
      "start": 2147.1199951171875,
      "end": 2149.5599975585938,
      "text": " It's going to pass away."
    },
    {
      "id": 87,
      "start": 2149.5599975585938,
      "end": 2155.1600036621094,
      "text": " And the lust thereof, notice what He says, and I want to focus on this for the last several"
    },
    {
      "id": 88,
      "start": 2155.1600036621094,
      "end": 2163.4000244140625,
      "text": " minutes this morning, but He that doeth the will of God abideth forever."
    },
    {
      "id": 89,
      "start": 2163.4000244140625,
      "end": 2168.040008544922,
      "text": " He that doeth the will of God abideth forever."
    },
    {
      "id": 90,
      "start": 2168.040008544922,
      "end": 2172.760009765625,
      "text": " As we think about this individual that is mentioned here, really individuals if you"
    },
    {
      "id": 91,
      "start": 2172.760009765625,
      "end": 2177.6000061035156,
      "text": " could use it in the plural sense, the one that is going to do the will of God, the one"
    },
    {
      "id": 92,
      "start": 2177.6000061035156,
      "end": 2183.6800231933594,
      "text": " that is going to obey the voice of God, the one that is overcoming, the one that is knowing"
    },
    {
      "id": 93,
      "start": 2183.6800231933594,
      "end": 2189.040008544922,
      "text": " the Father, the one that is seeking, has set their affection on things above, not on"
    },
    {
      "id": 94,
      "start": 2189.040008544922,
      "end": 2190.040008544922,
      "text": " things of the earth."
    },
    {
      "id": 95,
      "start": 2190.040008544922,
      "end": 2194.5599975585938,
      "text": " The one that we find in 2 Corinthians chapter number 4 while Paul says, while we look not"
    },
    {
      "id": 96,
      "start": 2194.5599975585938,
      "end": 2198.8800048828125,
      "text": " at these things which are temporal, these things that just pass away, but our focus"
    },
    {
      "id": 97,
      "start": 2198.8800048828125,
      "end": 2201.4400024414062,
      "text": " is on those things that are eternal."
    },
    {
      "id": 98,
      "start": 2201.4400024414062,
      "end": 2206.9200134277344,
      "text": " And we have that eternal focus and we understand that we're doing the will of God and we're"
    },
    {
      "id": 99,
      "start": 2206.9200134277344,
      "end": 2209.0800170898438,
      "text": " seeking to please God."
    },
    {
      "id": 100,
      "start": 2209.0800170898438,
      "end": 2214.8800048828125,
      "text": " We don't fit into this world system, because we're in the world, but we're not of the"
    },
    {
      "id": 101,
      "start": 2214.8800048828125,
      "end": 2215.8800048828125,
      "text": " world."
    },
    {
      "id": 102,
      "start": 2215.8800048828125,
      "end": 2221.9200134277344,
      "text": " And as we try to fit into the world system, then we become really sideways in our walk"
    },
    {
      "id": 103,
      "start": 2221.9200134277344,
      "end": 2224.4000244140625,
      "text": " with God."
    },
    {
      "id": 104,
      "start": 2224.4000244140625,
      "end": 2230.8800048828125,
      "text": " We find here this morning that He says, He that doeth the will of God abideth forever."
    },
    {
      "id": 105,
      "start": 2230.8800048828125,
      "end": 2233.3200073242188,
      "text": " Abideth forever."
    },
    {
      "id": 106,
      "start": 2233.3200073242188,
      "end": 2241.9600219726562,
      "text": " I'm thankful as a child of God that the second death has no power over me and that I will"
    },
    {
      "id": 107,
      "start": 2241.9600219726562,
      "end": 2243.760009765625,
      "text": " forever be with my Lord."
    },
    {
      "id": 108,
      "start": 2243.760009765625,
      "end": 2245.760009765625,
      "text": " Isn't that precious?"
    },
    {
      "id": 109,
      "start": 2245.760009765625,
      "end": 2249.7000122070312,
      "text": " He that doeth the will of God abideth forever."
    },
    {
      "id": 110,
      "start": 2249.7000122070312,
      "end": 2254.0800170898438,
      "text": " We understand that as we look at this passage of Scripture that it's quite evident and quite"
    },
    {
      "id": 111,
      "start": 2254.0800170898438,
      "end": 2258.6000061035156,
      "text": " clear that loving the world is not the will of the Father."
    },
    {
      "id": 112,
      "start": 2258.6000061035156,
      "end": 2259.6000061035156,
      "text": " Amen?"
    },
    {
      "id": 113,
      "start": 2259.6000061035156,
      "end": 2261.2000122070312,
      "text": " Isn't that abundantly clear?"
    },
    {
      "id": 114,
      "start": 2261.2000122070312,
      "end": 2264.5599975585938,
      "text": " He says in verse number 15, for if any man loved the world, the love of the Father's"
    },
    {
      "id": 115,
      "start": 2264.5599975585938,
      "end": 2265.980010986328,
      "text": " not in him."
    },
    {
      "id": 116,
      "start": 2265.980010986328,
      "end": 2270.279998779297,
      "text": " He says in verse number 16 that all of this, the lust of the flesh, the lust of the eyes"
    },
    {
      "id": 117,
      "start": 2270.279998779297,
      "end": 2274.240020751953,
      "text": " and the pride of life, it's not of the Father, but it's of the world."
    },
    {
      "id": 118,
      "start": 2274.240020751953,
      "end": 2282.5800170898438,
      "text": " So obviously, loving the world, the world system, is not the will of God."
    },
    {
      "id": 119,
      "start": 2282.5800170898438,
      "end": 2285.1600036621094,
      "text": " Walking in the light is the will of God."
    },
    {
      "id": 120,
      "start": 2285.1600036621094,
      "end": 2287.52001953125,
      "text": " Wouldn't you agree?"
    },
    {
      "id": 121,
      "start": 2287.52001953125,
      "end": 2290.5599975585938,
      "text": " He says that we walk in the light as He is in the light."
    },
    {
      "id": 122,
      "start": 2290.5599975585938,
      "end": 2294.760009765625,
      "text": " That we're walking with Him, we're enjoying that fellowship with Him, we're abiding in"
    },
    {
      "id": 123,
      "start": 2294.760009765625,
      "end": 2300.0,
      "text": " Him, we're loving our brethren, we're growing in grace and knowledge of our Lord and Savior"
    },
    {
      "id": 124,
      "start": 2300.0,
      "end": 2303.3600158691406,
      "text": " Jesus Christ, we're being sanctified, set apart."
    },
    {
      "id": 125,
      "start": 2303.3600158691406,
      "end": 2305.5599975585938,
      "text": " That is God's will."
    },
    {
      "id": 126,
      "start": 2305.5599975585938,
      "end": 2310.9200134277344,
      "text": " Remember at the end of Romans 12 in verse number 2, it says that we might prove what"
    },
    {
      "id": 127,
      "start": 2310.9200134277344,
      "end": 2316.280029296875,
      "text": " is that good and acceptable and perfect will of God."
    },
    {
      "id": 128,
      "start": 2316.280029296875,
      "end": 2319.0,
      "text": " But we have to be renewed by the transforming of our mind."
    },
    {
      "id": 129,
      "start": 2319.0,
      "end": 2321.8400268554688,
      "text": " We're not to be conformed to this world."
    },
    {
      "id": 130,
      "start": 2321.8400268554688,
      "end": 2325.8400268554688,
      "text": " I'm mindful this morning of what the songwriter said."
    },
    {
      "id": 131,
      "start": 2325.8400268554688,
      "end": 2329.47998046875,
      "text": " It's a song that we don't often sing."
    },
    {
      "id": 132,
      "start": 2329.47998046875,
      "end": 2336.8800048828125,
      "text": " It's a song, however, that you will often hear played for invitation."
    },
    {
      "id": 133,
      "start": 2336.8800048828125,
      "end": 2341.52001953125,
      "text": " That song is, Turn Your Eyes Upon Jesus."
    },
    {
      "id": 134,
      "start": 2341.52001953125,
      "end": 2345.7200317382812,
      "text": " And think about these words at the chorus of that song."
    },
    {
      "id": 135,
      "start": 2345.7200317382812,
      "end": 2354.47998046875,
      "text": " And the songwriter said, turn your eyes upon Jesus, look full in His wonderful face."
    },
    {
      "id": 136,
      "start": 2354.47998046875,
      "end": 2365.0400390625,
      "text": " And then it says this, and the things of earth will grow strangely dim in the light of His"
    },
    {
      "id": 137,
      "start": 2365.0400390625,
      "end": 2368.2000122070312,
      "text": " glory and grace."
    },
    {
      "id": 138,
      "start": 2368.2000122070312,
      "end": 2371.8800048828125,
      "text": " The songwriter hit the nail on the head, right?"
    },
    {
      "id": 139,
      "start": 2372.4000244140625,
      "end": 2378.1199951171875,
      "text": " I understand that songs aren't inspired Scripture, but the songwriter, by reading the inspired"
    },
    {
      "id": 140,
      "start": 2378.1199951171875,
      "end": 2384.52001953125,
      "text": " Scripture and by meditating upon the truth of God's Word, got it right."
    },
    {
      "id": 141,
      "start": 2384.52001953125,
      "end": 2390.0800170898438,
      "text": " And the reality is that we must turn our eyes upon Jesus, get our eyes off of this old world"
    },
    {
      "id": 142,
      "start": 2390.0800170898438,
      "end": 2394.6799926757812,
      "text": " and the world system and the things of this world, and we get our eyes on Jesus, and we"
    },
    {
      "id": 143,
      "start": 2394.6799926757812,
      "end": 2399.3599853515625,
      "text": " look not partially, not partly, but we look fully in His wonderful face."
    },
    {
      "id": 0,
      "start": 2399.3599853515625,
      "end": 2409.379985809326,
      "text": " face and we just get consumed with Jesus. It bothers me when people say that you"
    },
    {
      "id": 1,
      "start": 2409.379985809326,
      "end": 2414.7799854278564,
      "text": " could become too heavenly minded to be of any good earthly of any earthly"
    },
    {
      "id": 2,
      "start": 2414.7799854278564,
      "end": 2420.89998626709,
      "text": " value. I just don't find that to be true because we're to be consumed with our"
    },
    {
      "id": 3,
      "start": 2420.89998626709,
      "end": 2425.579984664917,
      "text": " Lord and the reality is that as we're walking with Him and we're abiding in"
    },
    {
      "id": 4,
      "start": 2425.579984664917,
      "end": 2430.079984664917,
      "text": " Him and we're worshiping Him, then guess what? We're going to be doing His"
    },
    {
      "id": 5,
      "start": 2430.079984664917,
      "end": 2434.559986114502,
      "text": " will. He's going to be leading us directly into the paths that He wants us"
    },
    {
      "id": 6,
      "start": 2434.559986114502,
      "end": 2439.719985961914,
      "text": " into to be His representatives and to be His spokespeople and to bring honor and"
    },
    {
      "id": 7,
      "start": 2439.719985961914,
      "end": 2445.839984893799,
      "text": " glory to His name. How is it that my Father is glorified and Johnny says that"
    },
    {
      "id": 8,
      "start": 2445.839984893799,
      "end": 2451.439987182617,
      "text": " you bear much fruit, right? That's how that's our Father's glorified. One way in"
    },
    {
      "id": 9,
      "start": 2451.4599838256836,
      "end": 2456.499984741211,
      "text": " which He's glorified. And so we find that we look a fool in His wonderful face is"
    },
    {
      "id": 10,
      "start": 2456.499984741211,
      "end": 2461.939987182617,
      "text": " what the songwriter says and just get consumed with Jesus. He says the things"
    },
    {
      "id": 11,
      "start": 2461.939987182617,
      "end": 2468.019989013672,
      "text": " of this world, oh there are many things of this world. I love how it says we'll"
    },
    {
      "id": 12,
      "start": 2468.019989013672,
      "end": 2473.4599838256836,
      "text": " grow strangely dim because so often it's the glitter and glamour of the world"
    },
    {
      "id": 13,
      "start": 2473.4599838256836,
      "end": 2480.2599868774414,
      "text": " that catches our attention. That many have fallen prey to and have become"
    },
    {
      "id": 14,
      "start": 2480.279983520508,
      "end": 2485.199981689453,
      "text": " casualties. But the songwriter said when I've turned my eyes upon Jesus and I'm"
    },
    {
      "id": 15,
      "start": 2485.199981689453,
      "end": 2490.879981994629,
      "text": " looking fully in His wonderful face, then the things of this world grow strangely"
    },
    {
      "id": 16,
      "start": 2490.879981994629,
      "end": 2500.2399826049805,
      "text": " dim in the light of what? His glory and grace. This morning, it's a stern warning,"
    },
    {
      "id": 17,
      "start": 2500.2399826049805,
      "end": 2506.2399826049805,
      "text": " love not the world. The reality is that it doesn't happen overnight. There's a"
    },
    {
      "id": 18,
      "start": 2506.2399826049805,
      "end": 2513.699981689453,
      "text": " progression. Being a friend of the world, being spotted by the world, loving the"
    },
    {
      "id": 19,
      "start": 2513.699981689453,
      "end": 2519.9799880981445,
      "text": " world, being conformed to this world. We want to avoid, there are pitfalls to avoid."
    },
    {
      "id": 20,
      "start": 2519.9799880981445,
      "end": 2527.4199829101562,
      "text": " The lust of the flesh, the lust of the eyes, the pride of life. God will give us"
    },
    {
      "id": 21,
      "start": 2527.4199829101562,
      "end": 2530.8599853515625,
      "text": " the ability to avoid those pitfalls. I'm thankful that He's told us what they are."
    },
    {
      "id": 22,
      "start": 2530.9199829101562,
      "end": 2537.0799865722656,
      "text": " As we take heed to the Scripture and we put on the whole armor of God and we set"
    },
    {
      "id": 23,
      "start": 2537.0799865722656,
      "end": 2540.0799865722656,
      "text": " our affection on things above, we're clothed with humility and all those"
    },
    {
      "id": 24,
      "start": 2540.0799865722656,
      "end": 2544.1199798583984,
      "text": " things that we mentioned, that we can avoid those pitfalls and we ought to"
    },
    {
      "id": 25,
      "start": 2544.1199798583984,
      "end": 2549.999984741211,
      "text": " rejoice in that promise and embrace it. That the world passeth away in the lust"
    },
    {
      "id": 26,
      "start": 2549.999984741211,
      "end": 2556.3599853515625,
      "text": " thereof. But he that doeth the will of God abideth forever. Let us determine"
    },
    {
      "id": 27,
      "start": 2556.5399780273438,
      "end": 2561.3999786376953,
      "text": " this morning and agree with what God said. I'm in the world but I'm not of the"
    },
    {
      "id": 28,
      "start": 2561.3999786376953,
      "end": 2564.97998046875,
      "text": " world. This world is not my home, the songwriter said, I'm just a passing"
    },
    {
      "id": 29,
      "start": 2564.97998046875,
      "end": 2572.199981689453,
      "text": " through. I'm a pilgrim and a stranger and I don't want to get sideways in"
    },
    {
      "id": 30,
      "start": 2572.199981689453,
      "end": 2576.8199920654297,
      "text": " my walk with God because of the things of this world. I want to have my full"
    },
    {
      "id": 31,
      "start": 2576.8199920654297,
      "end": 2583.739990234375,
      "text": " attention on the Lord. Love not the world. The enemy continues to use the same"
    },
    {
      "id": 32,
      "start": 2583.8399810791016,
      "end": 2589.97998046875,
      "text": " thing today, the same playbook that he used in Genesis chapter number 3. The"
    },
    {
      "id": 33,
      "start": 2589.97998046875,
      "end": 2595.3199920654297,
      "text": " lust of the flesh, the lust of the eyes, and the pride of life. Oh, that God would"
    },
    {
      "id": 34,
      "start": 2595.3199920654297,
      "end": 2600.8999786376953,
      "text": " help us so that we would overcome. Amen? Let's pray. Father, we love You. We thank"
    },
    {
      "id": 35,
      "start": 2600.8999786376953,
      "end": 2605.8199920654297,
      "text": " You for loving us. Thank You for the Word of God. Stern warning this morning from"
    },
    {
      "id": 36,
      "start": 2605.8199920654297,
      "end": 2610.199981689453,
      "text": " this passage of Scripture, but how I rejoice in the warnings that You give us"
    },
    {
      "id": 37,
      "start": 2610.199981689453,
      "end": 2620.47998046875,
      "text": " in Your Word. God, I pray that You'd help us to avoid these pitfalls, to be"
    },
    {
      "id": 38,
      "start": 2620.47998046875,
      "end": 2628.999984741211,
      "text": " mindful of the fact that the enemy is seeking through one, really a combination"
    },
    {
      "id": 39,
      "start": 2628.999984741211,
      "end": 2633.1199798583984,
      "text": " of all three of these, the lust of the flesh, the lust of the eyes, and the pride"
    },
    {
      "id": 40,
      "start": 2633.1199798583984,
      "end": 2640.0999908447266,
      "text": " of life to taint us, to cause us to be worldly, to come to that place where we"
    },
    {
      "id": 41,
      "start": 2640.0999908447266,
      "end": 2645.5999908447266,
      "text": " love this world. God, I pray that You'd help us to set our affection on things"
    },
    {
      "id": 42,
      "start": 2645.5999908447266,
      "end": 2652.959991455078,
      "text": " above. God, that You'd help us to do as the songwriter said and to turn our eyes"
    },
    {
      "id": 43,
      "start": 2652.959991455078,
      "end": 2660.5999755859375,
      "text": " upon Jesus. Help us to think more of the permanence of Him that doeth the will of"
    },
    {
      "id": 44,
      "start": 2660.5999755859375,
      "end": 2667.239990234375,
      "text": " God abideth forever than the passing away of this world's system, the temporary"
    },
    {
      "id": 45,
      "start": 2667.239990234375,
      "end": 2674.1199951171875,
      "text": " nature of this world in which we live. We do thank You for the opportunity to be"
    },
    {
      "id": 46,
      "start": 2674.1199951171875,
      "end": 2683.1199951171875,
      "text": " Your representatives. I thank You that You've given us Your Word. And as we"
    },
    {
      "id": 47,
      "start": 2683.1199951171875,
      "end": 2688.1199951171875,
      "text": " understand that we're in this world but You've given us this precious book, the"
    },
    {
      "id": 48,
      "start": 2688.1199951171875,
      "end": 2696.1599731445312,
      "text": " Word of God, to arm us, to enable us to be victorious. Perhaps this morning there's"
    },
    {
      "id": 49,
      "start": 2696.1599731445312,
      "end": 2701.5599975585938,
      "text": " someone that's struggling with worldliness. I pray that You would use Your Word, Your"
    },
    {
      "id": 50,
      "start": 2701.5599975585938,
      "end": 2707.0,
      "text": " Spirit would work in their heart and life, they'd respond. Maybe this morning there's"
    },
    {
      "id": 51,
      "start": 2707.0,
      "end": 2718.0399780273438,
      "text": " some folks that need to just come and be encouraged, be reminded of that daily,"
    },
    {
      "id": 52,
      "start": 2718.0399780273438,
      "end": 2725.279998779297,
      "text": " weekly attack and recommit their focus to You, Lord. Maybe there's one that's not"
    },
    {
      "id": 53,
      "start": 2725.279998779297,
      "end": 2733.6399841308594,
      "text": " sure of heaven. Lord, today would You reveal to them their need for salvation. I trust"
    },
    {
      "id": 54,
      "start": 2733.6399841308594,
      "end": 2736.719970703125,
      "text": " that You've worked and moved and we pray that You'd have Your will and way in these"
    },
    {
      "id": 55,
      "start": 2736.719970703125,
      "end": 2740.9199829101562,
      "text": " few moments of invitation. We'll give You the honor and glory for all that You'll"
    },
    {
      "id": 56,
      "start": 2740.9199829101562,
      "end": 2742.759979248047,
      "text": " do. For it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T16:29:38.218579"
}