{
  "video_id": "20HHrsvLvZg",
  "text": "passage of scripture that you would expect on the Sunday before Christmas. I do trust that the message, however, will be a blessing to you as we consider this statement that is made by the Lord Jesus Christ in this familiar passage of scripture in John 4, when Jesus has interaction with the woman at the well. And we're familiar with that passage in John 4, and I do trust it'll be a blessing to you. During this time of year, the Christmas season, we understand that it is common in our culture, and in many cultures, for that matter, to exchange gifts. Unfortunately, for some, that has become a primary focus. And we see that we, of course, live in a society in which we have just bombarded with advertisements from really successful marketing, a successful marketing industry, and we find that many times they're showing us, and they're preparing, and they're trying to get you to get this particular gift, and they make you, after watching all of their advertisements, think that you simply can't live life without whatever that item is. And they're very successful. You have children that just need this particular item, whatever the hot item is for any particular year, and we understand the society in which we live in. And we find, however, that really, the holiday that we would celebrate during this time of year in our society has really become over-commercialized. And we find that they estimate, in America, annually, over the last couple of years, and expectations for this year, that somewhere between 800 and $900 billion will be spent. That's a lot of money. And we understand the hustle and bustle. We understand people asking us, sometimes strangers, we don't even know who they are, and they ask us, have you finished your Christmas shopping? Did you get all of your gifts? Are they wrapped? Are they this? And so on and so forth. And it's a common thing that we deal with during this time of year. It is true, when you read the passage of Scripture in Matthew chapter number two, that when the wise men worshiped the Lord Jesus Christ, that they presented unto him gifts. Gold, frankincense, and myrrh. And we're familiar with that passage of Scripture in Matthew two. We do understand, however, that those gifts that were presented were significant and symbolic. They dealt with the deity of Christ, the purity of Christ, and ultimately the death of Christ. And we understand, even as we did not sing it this year, but a song that is often sang during the Christmas season, Born to Die. And we understand that even through the gifts that were presented, not only showing the deity and purity of Christ, but the death of the Lord Jesus Christ. And we know that it's through his death, his substitutionary atonement on the cross of Calvary, that we can even have any hope of eternal life. We understand that he bled and died. He was buried in that borrowed tomb, and he rose, conquering sin, death, and the grave. And how wonderful that is. As we come to John chapter number four, there's a statement that is made from Jesus in this interaction. And we won't look at the entirety of the chapter. We'll just kind of pick our way through. But I want you to notice in John four, in verse number four, Jesus says to his disciples, and we know that they're traveling there, and the Word of God tells us that it says this, and he must needs go through Samaria. And it tells us in verse number six, now Jacob's well was there. Jesus therefore being wearied with his journey sat thus on the well, and it was about the sixth hour. There cometh a woman of Samaria to draw water. Jesus saith unto her, give me to drink. For his disciples were gone away unto the city to buy meat. Then saith the woman of Samaria unto him, how is it that thou, being a Jew, askest drink of me? Which I'm a woman of Samaria. For the Jews have no dealings with the Samaritans. But notice here in verse number 10, as Jesus responds to this woman at the well, he answered and said unto her, if thou knewest the gift of God, and who it is that saith to thee, give me to drink, thou wouldest have asked of him, and he would have given thee living water. I wanna draw your attention to that phrase in verse number 10, when Jesus says, if thou knewest the gift of God. If thou knewest the gift of God. So often we have people today that are running around buying gifts and wrapping gifts and presenting gifts, but they do not know of the greatest gift that's ever been given. And here as Jesus is interacting with this woman at the well, he says, if thou knewest the gift of God, and who it is that saith to thee, he is Messiah, he is Christ, he is the God in flesh, and he's having this interaction with this woman at the well. We'll read some of it as we continue through the message this morning. But he says that if you knew the gift of God, and you knew who it was that saith to thee, give me to drink, thou wouldest have asked of him, and he would have given thee living water. New life through Christ. And we understand and we'll use as our title for the message this morning, if thou knewest the gift of God. As you study the Scriptures, you'll find that in Romans chapter number six and verse number 23, the Word of God describes the gift of God this way. In Romans six and verse number 23, it begins on really a negative note if you will, but it's a note that is necessary nonetheless. The Bible says in Romans six and verse number 23, for the wages of sin is death. And we understand that to be the case. We understand the Bible tells us in Romans three that there's none that doeth good. We understand the Bible tells us that all of our good works in the book of Isaiah are as filthy rags. And we understand that the wages of sin is death. All men are sinners. The penalty for sin is death, but you notice the great conjunction in Romans six and verse number 23, the Bible says, but the gift of God is eternal life through Jesus Christ, our Lord. I want you to consider the statement in John four in verse number 10, when Jesus says to the woman at the well, if thou knewest the gift of God. And we understand here in Romans six in verse number 23, when the word of God tells us that the gift of God is eternal life through Jesus Christ, our Lord. I want you this morning, if you're taking notes, first of all, to consider His gift to me. Consider His gift to me. And I'm so thankful for the gift of God, which is eternal life through Jesus Christ, our Lord. I'm thankful this morning to know that my sins have been forgiven, not by anything that I've done, but all because of what Jesus Christ did on the cross of Calvary. And because of His substitutionary atonement, because of His glorious resurrection, we can stand redeemed, understanding that we've been forgiven, that we have been the recipients of the gift of God, which is eternal life. This morning, when I consider the gift of God, and I consider His gift to me, I would say this morning that His gift is truly the greatest gift. It is the perfect gift. So many people run around in this society in the hustle and bustle, and you get emails just like I do. You only have so many days, and you missed the shipping window, and you got a this, and so on and so forth, and people are looking for that perfect gift. And all the while, they're ignorant, they're unaware of the gift of God. They're not knowing this morning the subject matter in which we're dealing with. They're not confident in their eternal security, because they don't know the gift of God. They're like that woman at the well that came to simply draw water and had no idea that she was gonna meet Jesus on that particular day. And Jesus said, if thou knewest the gift of God. Let me give you some truth about this gift of God. I would say this, His gift to me is beyond description. You ever receive a gift, and you try to describe it to someone, and you try to explain it, and perhaps in our society today, we understand with advancements in technology that we just can FaceTime people, and we can video message people, and we can show them, and we can let them see it, and so on and so forth. But if you would entertain me just for a few moments, when I was a kid, that technology didn't exist. Yes, I'm not that old, but the technology didn't exist, amen? And I remember as a child, I remember getting on the phone with my grandparents on Christmas Day, and I remember having conversations with them, and something that they would commonly ask on Christmas morning would be this question, what did you get for Christmas? And you understand that for many of those years, I was not saved, and I did not know the gift of God that we're speaking about this morning. My grandparents were lost, I was lost, my family was lost. We didn't know anything about the gift of God. We didn't understand the truth that we're dealing with this morning. And I remember trying as a young child to describe the gift that I received to my grandparents. And I would try to describe it. Well, the gift of God is beyond description. The reality is that the Bible tells us, if you turn over to the book of 2 Corinthians in chapter number nine, and we'll look at this verse a couple of times this morning, in fact, it's a simple verse of Scripture, but I want you to think about what the Word of God says when we consider the description, and the fact that His gift to me is beyond. description. The Bible says this in 2nd Corinthians 9 and verse number 15, thanks be unto God for his unspeakable gift. As much as we try to describe the gift of God which is eternal life, as much as we try to exalt the Lord Jesus Christ through understanding this gift, the reality is that we do not have a full comprehension of all that is contained within this gift of God which is eternal life. It's a precious gift. And we think about the the truth in 2nd Corinthians 9 for his unspeakable gift. If I could begin to describe to you this gift of God which is eternal life, and I know that I'm speaking to many that have received Christ as their Savior this morning, but as we would begin to describe that gift of God that he has given me eternal life, but we understand that it's it's so much more than just eternal life. I mean he's given us abundant life, he's given us all things that pertain unto life and godliness, he's blessed us with all spiritual blessings in heavenly places, he's given us promises that are precious, and he promises to be with us and to guide us and lead us. It's amazing. He said I'm your shepherd. You think about the truth of Psalm 23 and you do not have to take the time to turn there, but it's an amazing truth where the psalmist ends that psalm by saying surely goodness and mercy shall follow me all the days of my life and I will dwell in the house of the Lord forever. I want you to understand this morning that the truth of the last statement of the 23rd Psalm is directly related to the first statement of the 23rd Psalm. He cannot have the confidence that he will dwell in the house of the Lord forever if first the Lord is not my shepherd. But because the Lord is my shepherd, because I understand who he is to me, I can say I will dwell in the house of the Lord forever. Oh this gift of God is precious. I understand it's beyond description, the gift was purchased with the precious blood of Jesus Christ. If you purchase a gift, you have to pay for that gift, right? That's how it works. You don't just go to the clerk at the store and say well my kid really wants this. All right, I mean that's fine, it's X number of dollars and you say well I don't have that. Well you can't have the item. I mean we understand that, it's real simple. In this gift that God has for me, his gift for me, when he says to the woman at the well, if thou knewest the gift of God, we understand that this gift that he speaks of, this gift of eternal life, it was purchased with his own precious blood. The value is beyond anything that we could even begin to consider. In fact, when you consider this morning the truth of 1 Peter, take a moment and turn to 1 Peter chapter number 1, we understand here that God gives us great truth with regard to the price for our salvation, the price for this gift that has been provided. And you understand that as we consider his gift to me this morning and we understand what blessed truth it is that he would pay for that gift with his precious blood. Let me say this, he didn't simply make a down payment for the gift. He paid for it in full. Aren't you thankful for that? I remember back in the day, I don't even know if they still have it today, lay away, but I remember back in the day my grandmother on my mom's side, she would like to shop at Kmart and Kmart had blue light specials and they also had lay away. Some of you say, I don't even know what Kmart is. It's okay. And it's Walmart but really bad. That's the best way I could describe it. That's why they don't exist anymore. But the reality is that I remember my grandmother putting things on lay away. Some of you remember lay away, some of you have no idea what we're talking about, but stick with me just for a moment. It's my understanding I've never personally put anything on lay away, but I was with my grandmother when she did on a number of occasions. Dad, didn't she like Kmart and lay away? Man, she loved it. I'm being serious. And she'd go in there and guess what? When she put those items in there, she'd have put some kind of down payment. Right? But she couldn't take the items. They kept the items. Right? That's how it worked. And then you'd go back and you make another payment. And you go back and you make another payment and eventually, you guys don't know about lay away? Mike and Elizabeth, you can't be that young. They're sitting here going, what? You guys know about lay away? Some of you know about lay away. Come on. Amen? Come on. I'm not that old. Good night. Eventually, you paid off and then you get to take the product. God didn't just make a down payment for your salvation. He paid for it all. Amen? He says here in 1 Peter 1 in verse 17, and if you call on the Father, who without respect of persons judgeth according to every man's work, past the time of your sojourning here in fear, for as much as you know, that ye were not redeemed with corruptible things as silver and gold from your vain conversation received by tradition from your fathers. Now, we understand that he says, listen, the redemption that we enjoy being saved, having this gift of God which is eternal life, it wasn't paid for with silver and gold. Notice verse 19, but with the precious blood of Christ as of a lamb without blemish and without spot, who verily was for ordained before the foundation of the world, but was manifest in these last times for you, who by him do believe in God that raised him up from the dead and gave him glory that your faith and hope might be in God. We're redeemed with the precious blood of Christ, the price, the price that was paid. Listen, you cannot buy the gift of God. It's already been bought by him with his blood. And we understand this morning that this gift that we're speaking of, his gift to me, this gift of eternal life, that it's beyond description. It says, but thanks be to God for his unspeakable gift. We think about his gift being purchased with the precious blood of Christ that we're redeemed, that we're forgiven through the blood. The Old Testament, the types all throughout the Old Testament of the blood, of the blood, of the blood. You go to the tabernacle and you find that as soon as you would enter into the tabernacle, and there's only one way to enter into the tabernacle, and the first piece of furniture that you'd come to is the brazen altar. Why? Because a sacrifice was required. Blood had to be shed. You find that if you go prior to that and you begin to look all the way back into the garden, you understand that after sin entered into the world, after Adam and Eve sinned and their eyes were opened, what's the first thing that they did? They recognized that they were naked and they put fig leaves to try to cover their nakedness. Correct? What did God say? It's not satisfactory. That's not sufficient. And therefore an animal had to be killed. I would argue a lamb had to be killed so that coats of skin could be provided for Adam and Eve while showing them that the blood was required. The works of your hands are not sufficient, but the blood is required. And from that point all the way through, you find how that it was a picture. You notice with the offerings of Cain and Abel, you notice with the truth of Abraham and others, with believing God and the truth of the Passover and the blood and how it all pointed to Messiah. And now He's come and He paid. He went to that cross. He shed His precious blood. That's how our gift was paid for. He says in John, it is finished. It's paid for, paid in full. The gift, not only the unspeakable gift, not only that it's been purchased with His precious blood, but I want you to consider this this morning, His gift is available to all. His gift is available to all. We're living in a time right now where they're talking about supply chain issues, right? We've been hearing about it for a long time in the news and trying to get you to go spend your money now so that you can get whatever that item is because the supply chain issues and it's not going to be available and so on and so forth. And whatever those hot items are that are the most popular gifts of the year, you can find that sometimes they're just not available. There are times in which you can't find that gift that Johnny or Susie really wants and as a parent you so desire perhaps to be able to get that gift for them, but it's just simply not available, out of stock, coming soon. I want you to understand that this gift that we're speaking of this morning, when Jesus says to the woman at the well, if thou knewest the gift of God, this gift is available to all. It's available to every single person. The Bible tells us in Romans 1 and verse number 16, when Paul is declaring this great truth, he says I am not ashamed of the gospel of Christ. Why? For it is the power of God unto salvation to everyone that believeth, to the Jew first and also to the Greek.\" We understand that the Word of God teaches us in Romans 10 in verse number 13, for whosoever shall call upon the name of the Lord shall be saved. In 2 Peter chapter number 3, the Bible tells us that our God is not willing that any should perish, but that all should come to repentance. When He went to that cruel cross, see, He was born to die, and we think about gifts and exchanging of gifts, but the greatest gift, the most perfect gift, is this gift of God, which is eternal life. And Jesus says to the woman at the well, if thou knewest the gift of God, if you knew it. You've got to understand that in John chapter 4, if you've held your place there, or if not, turn back there and notice what is happening here. It says here, when we think about this truth of it being available, understand that in verse number 9, there's some input that is given how that she says that she's a woman of Samaria and that the Jews and the Samaritans, they have no dealings one with another. There was great prejudice and there was great length of effort that would go forth by a Jewish person to avoid Samaria, to avoid this region, to go around this region. There was no dealings with one another, but Jesus, the Bible says He must needs go through Samaria. And we find that when He says to her, if thou knewest the gift of God, notice in verse number 10 again, and who it is that saith to thee, give me to drink, thou wouldest have asked of Him. And what does it say? And He would have given thee living water. It's not that you ask and He says, I'm sorry, it's not for you. That'd be tragic. But the gift is available. The gift is available to all people. And for that, we rejoice. This gift that we're speaking of this morning, you understand that you cannot buy this gift. There's no place that you can go to buy this gift. There's no work that you can do. There's no sum of money that you can give. There's nothing that you can do to earn this gift. You can't buy it. You can't earn it. You can't work for it. There's just nothing. You must simply receive this gift. In fact, many today in our society have been led astray into thinking by many of the world religions that you can work your way to heaven. In fact, many of the world religions today would teach that you just need to do certain works and do certain things, and by that you will earn your salvation. In fact, as we interact with people, as we go throughout our days, our weeks, and we speak to people about the Lord, and we are to ask people, I've done this on a number of occasions in my life, when I've said to someone, sir, ma'am, are you sure of heaven? If you were to die today, would you go to heaven? Sometimes people would say, no way. Other times people say, absolutely, I've trust that Christ is my Savior. Many times, however, people say, I hope so. I want to. What are you basing it on? Well, I'm being the best person I can be. I'm doing the best I can do. Can I tell you, that's not good enough. Again, I referenced Isaiah earlier, but all of our good works are as filthy rags as what Isaiah says. In Romans chapter number four, the Bible speaks to us about this very truth with regard to this gift, and I'm so thankful that it's a gift. I cannot work for it. I cannot earn it. I must simply receive it. It says, what shall we say then that Abraham, our father, as pertaining to the flesh, hath found? For if Abraham were justified by works, he hath whereof to glory, but not before God. If you think about this truth in verse number two, when it says, he hath whereof to glory, remember the truth of Ephesians 2, 8, 9, for by grace are you saved through faith, and that not of yourselves is the gift of God, not of works, lest any man should boast. If we could work our way to heaven, then it would give us reason to glory, reason to boast. But God says no, what saith the Scripture in verse number three, for what saith the Scripture, Abraham believed God, and it was counted unto him for righteousness. Now to him that worketh is the reward not reckoned of grace, but of debt, but our God is a debtor to no man. Amen? We cannot earn this gift. We must simply receive this gift. So this morning, I would simply ask this question as we consider His gift to me, have you received the gift? Have you personally understood that you are a sinner and that Christ is the only Savior? Have you understood this truth that is being revealed to us this morning through John 4, that God has a gift for us and that this gift is eternal life through Jesus Christ our Lord. It's a precious gift that was paid for with His blood. There's nothing you can do to earn it. It's available to all people. You must simply receive it. The question this morning is, have you received the gift of God? Have you been born again? Have you trusted Christ as your Savior? Can I tell you this? He won't force you to receive the gift. In fact, you can reject the gift. I used to be able to say that I've never had anyone reject a gift that I tried to give them, but just recently I had someone reject a gift. And you wouldn't know who they are, and it was just a token of appreciation. I was trying to be a kind individual, and I extended a gift to someone, and it really wasn't anything of any great monetary value. It was just a small token of appreciation. Within just a few minutes, the person said, I don't want this. I can't take this. And they gave it back to me. Until that event, just recently, I'd never had anyone reject a gift that I tried to give them. It's pretty customary that we receive a gift. And God says, I have a gift for you. Will you receive it? Or will you reject it? Now this morning, I know that I'm talking to many that have already received the gift. And we know this gift of God that is spoken of in John chapter number 4. And this morning when we speak about this idea when he says, if thou knewest the gift of God and I consider his gift to me, I want you to consider number 2 this morning, I want you to consider my gift to him. What's my gift to him? And understand, when I deal with this truth this morning, my gift to him is not to try to get his gift to me. My gift to him is not to try to keep his gift that he's given me. My gift to him is out of gratitude for what he's done for me. And we understand that as we go through the Scriptures that there is a response that we find littered throughout the New Testament, the Old Testament as well, how that the people of God as they've received this gift, how they respond by thanking God, by praising God, by living for God, because they understand this gift. I've said this before from this pulpit. The reality is that if we could lose the gift, if we could lose the salvation, we would have lost it the day we got it. I know, there's no way I can keep it the same way I can't earn it. Amen? I'm kept by the power of God. But what's my gift back to him? Number 1, I would say this, it's my praise. My praise. Is he not worthy of our praise? When we understand the gift that he's given to us, when we understand this gift of God, which is eternal life, we ought to lift our voice and praise him and thank him. 2 Corinthians 9 and verse 15 said, but thanks be to God for his unspeakable gift. I'm thanking him and I'm praising him. Why? Because I understand that he's given me this gift. I couldn't earn it, I couldn't work for it, I'm without hope, I'm dead in my sins and my trespasses. I am hopeless and I am helpless, but God in his grace and his mercy, he says, I have a gift for you. And what's my gift back to him? I praise him. I praise him. Consider Hebrews 13. Turn over there if you will and consider Hebrews 13 and what the word of God says with regard to our praise for our God. We of course could go to the book of Psalms and we could read many passages of Scripture in the book of Psalms with regard to our praise and lifting our voice and praising our God and the fact that he is worthy of our praise. And here in Hebrews 13 and verse number 15, the Bible speaks here about the praise of his people. By him, therefore, let us offer the sacrifice of praise to God. How often? Continually. That is the fruit of our lips giving thanks to his name. He is worthy of our praise. And this morning, when I praise my God, I'm lifting him up, I'm exalting him, I'm magnifying him. Let God be magnified. Let God be exalted. And I'm speaking about his gift. Remember there's not a place for us to glory or for us to boast because it's not by works, it's not by our merit. It's all because of his glory. grace and His mercy, and so therefore He alone is the one that receives the glory. He alone is the one that receives the praise. When someone were to ask me the question, are you sure of heaven, it's not in any glory in myself that I say, yep, I know I'm going to heaven because I've done this and I'm this and so on and so forth. No, I know I'm going to heaven because Jesus Christ died for me. He paid my debt. He was buried and He rose again. He conquered sin, death, and the grave, and He saved my soul, and I want to praise Him. I want to lift up my voice and give thanks to God for His gift. Is it not customary in our society to thank people for gifts? You receive a gift, someone says thank you, right? Sometimes we give a gift to someone and we receive a thank-you card. Do you give a thank-you card for the thank-you card? I mean, no, it's not customary, but you understand what I'm saying, right? We understand what it is to express gratitude for a gift. Well, if this greatest gift, this gift of God, which is eternal life, has been freely given to us and we've understood, listen, I'm thankful that I do not live in a place, I'm thankful that I've been exposed to the truth of the gospel, that I know the gift of God, and for you this morning that are under the sound of my voice, whether you're here locally or you're watching via live stream, you now know the gift of God is eternal life through Jesus Christ our Lord. You may have entered into this building, you may have clicked on that link on the internet, and you may not have known what the gift of God is in this sense, and understanding what the Scripture said, but now you know. And as we receive that gift and we say, I no longer I'm gonna try to work for this thing because I understand that I can't, He gives us a rest in our salvation, and it's a blessed thing, and we ought to lift our voice and praise Him. And as we praise Him and as we lift Him up and exalt Him and we speak of our Savior, we're influencing others. Let me say this, not only my gift to Him is my praise, but it's my life. It's my life. I'm mindful of the truth of Romans 12, and it's a familiar verse of Scripture, really two verses of Scripture, Romans 12 verses 1 and 2. Many of us are familiar with this passage of Scripture. If you were to take the whole of the book of Romans and really just divide it up into a few sections and understand the indictment against mankind that all have sinned and come short of the glory of God. There's none righteous, no not one. We find those truths in the book of Romans in the third chapter. If you're to look in the fifth chapter and understand that sin entered into this world by one man, by Adam, and sin has passed upon all men, death has passed upon all men, excuse me, for all have sinned. We look at the truth of Romans 5 that by one man's transgression all have been influenced, but by the gift of one, speaking of the price that was paid on the cross of Calvary by the Lord Jesus Christ, all men now freely can receive this gift. Romans 6, we looked at verse 23 earlier, the wages of sin is death, the gift of God is eternal life. Romans 10, for whosoever shall call upon the name of the Lord shall be saved. So we understand our condition that we were hopeless and helpless for all have sinned and come short of the glory of God. There's none righteous, no not one, but we understand that Jesus died for us and he paid the price for us so that we could have eternal life. We've accepted him, we've called upon him, we've received this gift, and now we come to Romans 12 and Paul says, I beseech you therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice, wholly acceptable unto God, which is your reasonable service. Be not conformed to this world, but be transformed by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. I said often a couple of years ago we preached through the book of Ephesians on Sunday morning. The theme is somewhat evident in the book of Colossians as well. We speak about in the book of Ephesians, there's very clear distinction in that book between the first section and the second section. In the first section of the book of Ephesians, it specifically is dealing with our standing before God, the fact that we've been saved, that we've received this gift that I'm speaking of this morning. The second section of the book of Ephesians clearly deals with our service for our Lord. Because I'm saved, I walk in wisdom, I walk in truth, and all of these truths that are given to us at the latter part of the book of Ephesians. And we understand, and I said this often, that I do not, that the truth of Ephesians is not that Paul is saying, walk in wisdom or walk worthy so that you can get saved or so that you can stay saved. No, the matter of salvation has already been established. Our standing is already sure, and because of that, I now serve my God. I offer to him my praise, but I offer to him my life. Remember the truth. Turn over. I sign every card that I sign. 2 Corinthians chapter number 5, in verse number 15, if you've received a card, a letter, an email from me, you see 2 Corinthians 5.15 in my signature every time I write something. And in 2 Corinthians chapter number 5, in verse number 14, the Bible says that the love of Christ constraineth us, because we thus judge that if one died for all, then we're all dead. And notice verse number 15, in that he died for all. Remember, we said the gift is available. It's available to all. He died for all, that they which live, I've been saved, I've been born again, it says that they which live should not henceforth live unto themselves, but unto him which died for them and rose again. We sing the song, Living for Jesus. You know, if you're not saved, you can't live for Jesus. You can't. But because I've been saved, I want to offer him my life. Paul says, this is your reasonable service, that we present our bodies a living sacrifice. Again, it's not so that we can be saved, it's not so that we can stay saved, it's the result of us being saved and understanding this gift that we have received. What glory, what blessing. I would say this as we turn back to John chapter number 4, nearing the end of the thought this morning, and as we turn back to John chapter number 4, and I think about my praise in my life, and I notice in this text of Scripture that both of those things are evident in this life of this woman that is mentioned here by her witness, when I know the gift of God, I must share this gift with others. When I truly understand, remember, he says in verse number 10, the beginning of their interaction, if thou knewest the gift of God. The reality is that at this point, she didn't know the gift of God, correct? She didn't know it, but it's about to be revealed to her. She didn't know what the gift was. He said, if you knew what it was, you would have asked me, and I would have given to thee living water. The woman saith, in verse number 11, Sir, thou hast nothing to draw with. The well is deep. From whence then hast thou that living water? And art thou greater than our father Jacob? Yes, absolutely, he is God. Which gave us the well, and drank there of himself, and his children, and his cattle. Jesus answered and said unto her, whosoever drinketh of this water shall thirst again. Did she understand that? Yeah, that's why she was there that day. She needed more water. Notice verse number 14, but whosoever drinketh of the water that I shall give him shall never thirst, but the water that I shall give him shall be in him a well of water springing up into everlasting life. He's speaking about that living water that he mentioned in verse number 10. He's speaking about salvation, and of course her response immediately in verse number 15, Sir, give me this water that I thirst not, neither come hither to draw. She didn't fully understand the gift yet. She was still thinking on the natural plane. She was still thinking physically. She was not understanding the spiritual truth that God was giving her, this gift of God as eternal life, as we found in Romans 6, and she says, listen, I don't want to have to keep coming back to this well. She's thinking on that physical plane. Notice Jesus, in order to help her understand her sinful condition, her need for this spiritual water, this living water that he's speaking of, he says in verse number 16, go call thy husband and come hither. The woman answered and said, I have no husband. Jesus said unto her, thou hast well said, I have no husband, for thou hast had five husbands, and he whom thou now hast is not thy husband, and that sayest thou truly. Notice her response, Sir, I perceive that thou art a prophet. He's greater than a prophet. He's God. He's God. She says, our fathers worshiped in this mountain, and ye say that in Jerusalem is the place where men ought to worship. Jesus saith unto her, woman, believe me, the hour cometh when ye shall neither in this mountain nor yet at Jerusalem worship the Father. Ye worship, ye know not. What? know what we worship, notice this, for salvation is of the Jews. What does he mean by that? It was through the, of course we understand through the messianic prophecies, we've been studying the book of Genesis, and as God called Abraham and the Jewish nation, the Hebrew nation, that Christ would come through that line, and we understand that salvation is of the Jews. But the hour cometh, verse 23, and now is when the true worshippers shall worship the Father in spirit and in truth, for the Father seeketh such to worship him. God is a spirit. They that worship him must worship him in spirit and in truth. Notice what she says. It's, now she's understanding the gift of God. Because it says in verse number 25, the woman saith unto him, I know that Messiah is cometh, which is called Christ. When he is come, he will tell us all things. And Jesus saith unto her, I that speak unto thee am he. Wow. Wow. She's met Messiah. Jesus must needs go through Samaria, and we find that, she says, that as he's dealing with her and drilling down and dealing with the spiritual issues at hand, she says, I know that Messiah is cometh, which is called Christ. And he says, I am he. I that speak unto thee am he. The disciples return. Remember back in verse number 8, they tell us that the disciples were gone away into the city to buy meat, and so Jesus is there with this woman. The disciples are off running some errands, if you will, getting the supplies that were needed. The Bible tells us that they marveled that he talked to the woman in verse number 27. But I want you to notice in verse 28 that the woman then left her water pot and went her way into the city, and saith to the men, Come, see a man which told me all things that ever I did. Is not this the Christ? She now understands this gift. Not only does she understand the gift, but she wants to share the gift. Isn't that natural? This morning, for many of us, I started the message by saying, what's his gift to me? What would I consider his gift to me? And we considered it, and we looked at a number of truths within the Word of God, and for many of us this morning, we can say, I received that gift. But here, when this woman that in the beginning of the passage did not know the gift of God, if thou knewest the gift of God, she didn't know it, now as her eyes have been opened, as Jesus deals with her, she now has her eyes opened, and she says, Is not this the Christ? We find that she goes back and she tells them, and it says, as you look and skip down in verse number 39, and many of the Samaritans of the city believed on him for the saying of the woman, which testified he told me all that ever I did. So when the Samaritans were come unto him, they besought him that he would tarry with them, and he abode there two days. So notice the scene, she leaves from getting water, and she runs back to the city, and she tells these people, she announces this experience that she's had, and this interaction that she's had with Christ, with the Messiah, and the Bible tells us that many of the Samaritans believed on him for the saying of the woman, according to verse number 39, and then a great multitude come to him, he mentions about that, in verses 34 through 37, about the multitude that were coming, and he says that as they come, they ask him, they beseech him, that he would tarry there, and he stayed there for two days. And I want you to notice verses 41 and 42. It says that many more believed because of his own word, and said unto the woman, Now we believe, not because of thy saying, for we have heard him ourselves, and know that this indeed is indeed the Christ, the Savior of the world. We sang this morning, joy to the world, the Savior is come. He has come. And as we understand this gift of God, Galatians chapter number 4, you don't need to turn there, but in Galatians 4, in verse number 4, the Bible says, when the fullness of the time was come, God sent forth his Son, made of a woman, made under the law. What was the purpose of sending his Son? To redeem them that were under the law, that we might receive the adoption of sons. How did he redeem us? Through his substitutionary atonement. The gift of God that we're speaking of this morning, this gift that's been made available to us, and as we understand this gift, and as we've received this gift, then we ought to have the desire to give him our praise, to give him our life, to lift up our voice and testify of him. In John chapter number 1, John the Baptist is preaching, and the Lord Jesus Christ walks by, and John the Baptist says, behold the Lamb of God. The Bible tells us that a couple of those two disciples of John the Baptist, they followed after Jesus, and Jesus said, what seek ye? And they say, where dwellest thou? And he said, come and see. And the Bible says that in verse number 40, one of the two which heard John speak and followed him was Andrew, Simon Peter's brother. He first findeth his own brother Simon and saith unto him, we have found the Messiah, which is being interpreted, the Christ. And I want you to notice this phrase in verse number 42, and he brought him to Jesus. This morning, if thou knewest the gift of God, we consider his gift to us, it's eternal life. This morning, if you've not received the gift of eternal life, I would say to you this morning, would you receive the gift of God? It's available. He's paid for it. He makes it available to all people. Today is the day of salvation. Today is the day of salvation. We know not what's on the morrow, according to Proverbs 27. What is your life? It's a vapor that appeareth for a little time and then vanisheth away. And this morning, if you're not sure of heaven, if you've not received the gift of God, which is eternal life, this Christmas season, why don't you receive the greatest gift, the perfect gift, the gift of God, which is eternal life. This morning, if you've already received that gift, what's our gift in return to him? How are we praising him? Are we lifting his name? Are we exalting him the way that we should? Have we given him our lives? Not to earn our salvation, not to keep it. We can't earn it or keep it. But because of what he's done for us, have we offered him our lives? How's our testimony? Who are we bringing to Jesus? Who are we saying, let me tell you about this gift, this gift of God. Let me tell you what he did for you, or what he did for me and what he can do for you. Let me tell you how he changed my life and how he can change your life too, if thou knewest the gift of God. Maybe this morning, someone entered into this meeting place not knowing the gift of God, but now you know it. Would you receive it? It's available. He's already paid for it. You say, what do I have to do? Just receive it. Just receive it. I hope that you wouldn't reject it because God loves you so much and he wants you to be saved. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the Word of God. We're thankful that you sent your son, the Lord Jesus Christ, born of a virgin. We're thankful that you sent your son to this world, to this sin-cursed world, so he could live a sinless, perfect life, so he could make the atonement for our sin, pay the price so that we could be redeemed. We're thankful this morning for this unspeakable gift. That this gift has been paid for, paid in full, with the precious blood of Jesus Christ, proven through his glorious resurrection. I'm thankful that it's available. Lord, if there'd be one this morning, maybe there's several. Here locally, tuned in via live stream, they entered this meeting time the same way that that woman at the well, not knowing the gift of God. He said, if you knew it, you'd ask for it and I'd give it to you. This morning, he is the Savior of the world. He's my Savior. He wants to be your Savior. If you're not sure of heaven this morning, Lord, would you work with the Holy Spirit, convict and convince of sin and of Christ's righteousness and of judgment to come? For those that have already received the gift of God this morning, would you help us to live for Jesus? Help us to live for you. You. Help us to praise You. Help us to surrender our lives. Help us to testify and bring others to Jesus, because we understand this wonderful gift and we want the world to know that Jesus saves. We pray that You'd move work as only You can in this time of invitation. We'll give You the honor and glory for all that You'll do, for it's in Christ's name we pray. Would You stand with me? God, eyes are closed. The conclusion of our services, we have a time of invitation. We invite you to respond to the preaching of the Word of God. As the Holy Spirit of God has moved in your heart and your life, we ask that you'd respond. No one's looking around, we'd never embarrass you. Kimberly will play quietly on the piano, and as she does, the altar's open. If you're not sure of heaven, we'd love to take a Bible and show you how you can know for sure that heaven's your home. If you want to just come and thank Him for this unspeakable gift, perhaps you just want to praise His name and offer your life to Him, or bring others to Jesus. However it is that the Lord may have spoken to your heart this morning, the altar is open as Kimberly plays.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 1.899999976158142,
      "text": " passage of scripture that you would expect"
    },
    {
      "id": 1,
      "start": 1.899999976158142,
      "end": 4.079999923706055,
      "text": " on the Sunday before Christmas."
    },
    {
      "id": 2,
      "start": 4.079999923706055,
      "end": 5.71999979019165,
      "text": " I do trust that the message, however,"
    },
    {
      "id": 3,
      "start": 5.71999979019165,
      "end": 9.0,
      "text": " will be a blessing to you as we consider this statement"
    },
    {
      "id": 4,
      "start": 9.0,
      "end": 11.119999885559082,
      "text": " that is made by the Lord Jesus Christ"
    },
    {
      "id": 5,
      "start": 11.119999885559082,
      "end": 14.15999984741211,
      "text": " in this familiar passage of scripture in John 4,"
    },
    {
      "id": 6,
      "start": 14.15999984741211,
      "end": 17.959999084472656,
      "text": " when Jesus has interaction with the woman at the well."
    },
    {
      "id": 7,
      "start": 17.959999084472656,
      "end": 20.959999084472656,
      "text": " And we're familiar with that passage in John 4,"
    },
    {
      "id": 8,
      "start": 20.959999084472656,
      "end": 23.239999771118164,
      "text": " and I do trust it'll be a blessing to you."
    },
    {
      "id": 9,
      "start": 23.239999771118164,
      "end": 26.079999923706055,
      "text": " During this time of year, the Christmas season,"
    },
    {
      "id": 10,
      "start": 26.079999923706055,
      "end": 29.260000228881836,
      "text": " we understand that it is common in our culture,"
    },
    {
      "id": 11,
      "start": 29.260000228881836,
      "end": 33.70000076293945,
      "text": " and in many cultures, for that matter, to exchange gifts."
    },
    {
      "id": 12,
      "start": 33.70000076293945,
      "end": 38.70000076293945,
      "text": " Unfortunately, for some, that has become a primary focus."
    },
    {
      "id": 13,
      "start": 38.900001525878906,
      "end": 41.619998931884766,
      "text": " And we see that we, of course, live in a society"
    },
    {
      "id": 14,
      "start": 41.619998931884766,
      "end": 46.380001068115234,
      "text": " in which we have just bombarded with advertisements"
    },
    {
      "id": 15,
      "start": 46.380001068115234,
      "end": 48.459999084472656,
      "text": " from really successful marketing,"
    },
    {
      "id": 16,
      "start": 48.459999084472656,
      "end": 51.380001068115234,
      "text": " a successful marketing industry,"
    },
    {
      "id": 17,
      "start": 51.380001068115234,
      "end": 54.619998931884766,
      "text": " and we find that many times they're showing us,"
    },
    {
      "id": 18,
      "start": 54.619998931884766,
      "end": 56.7400016784668,
      "text": " and they're preparing, and they're trying to get you"
    },
    {
      "id": 19,
      "start": 56.7400016784668,
      "end": 60.900001525878906,
      "text": " to get this particular gift, and they make you,"
    },
    {
      "id": 20,
      "start": 60.900001525878906,
      "end": 63.34000015258789,
      "text": " after watching all of their advertisements,"
    },
    {
      "id": 21,
      "start": 63.34000015258789,
      "end": 65.41999816894531,
      "text": " think that you simply can't live life"
    },
    {
      "id": 22,
      "start": 65.41999816894531,
      "end": 67.41999816894531,
      "text": " without whatever that item is."
    },
    {
      "id": 23,
      "start": 67.41999816894531,
      "end": 69.18000030517578,
      "text": " And they're very successful."
    },
    {
      "id": 24,
      "start": 69.18000030517578,
      "end": 73.26000213623047,
      "text": " You have children that just need this particular item,"
    },
    {
      "id": 25,
      "start": 73.26000213623047,
      "end": 76.0999984741211,
      "text": " whatever the hot item is for any particular year,"
    },
    {
      "id": 26,
      "start": 76.0999984741211,
      "end": 79.45999908447266,
      "text": " and we understand the society in which we live in."
    },
    {
      "id": 27,
      "start": 79.45999908447266,
      "end": 81.54000091552734,
      "text": " And we find, however, that really,"
    },
    {
      "id": 28,
      "start": 81.54000091552734,
      "end": 83.73999786376953,
      "text": " the holiday that we would celebrate"
    },
    {
      "id": 29,
      "start": 83.73999786376953,
      "end": 86.22000122070312,
      "text": " during this time of year in our society"
    },
    {
      "id": 30,
      "start": 86.22000122070312,
      "end": 88.86000061035156,
      "text": " has really become over-commercialized."
    },
    {
      "id": 31,
      "start": 88.86000061035156,
      "end": 92.66000366210938,
      "text": " And we find that they estimate, in America,"
    },
    {
      "id": 32,
      "start": 92.66000366210938,
      "end": 94.45999908447266,
      "text": " annually, over the last couple of years,"
    },
    {
      "id": 33,
      "start": 94.45999908447266,
      "end": 96.66000366210938,
      "text": " and expectations for this year,"
    },
    {
      "id": 34,
      "start": 96.66000366210938,
      "end": 101.22000122070312,
      "text": " that somewhere between 800 and $900 billion will be spent."
    },
    {
      "id": 35,
      "start": 101.22000122070312,
      "end": 102.58000183105469,
      "text": " That's a lot of money."
    },
    {
      "id": 36,
      "start": 102.58000183105469,
      "end": 105.66000366210938,
      "text": " And we understand the hustle and bustle."
    },
    {
      "id": 37,
      "start": 105.66000366210938,
      "end": 108.54000091552734,
      "text": " We understand people asking us, sometimes strangers,"
    },
    {
      "id": 38,
      "start": 108.54000091552734,
      "end": 109.9000015258789,
      "text": " we don't even know who they are,"
    },
    {
      "id": 39,
      "start": 109.9000015258789,
      "end": 110.73999786376953,
      "text": " and they ask us,"
    },
    {
      "id": 40,
      "start": 110.73999786376953,
      "end": 112.18000030517578,
      "text": " have you finished your Christmas shopping?"
    },
    {
      "id": 41,
      "start": 112.18000030517578,
      "end": 113.31999969482422,
      "text": " Did you get all of your gifts?"
    },
    {
      "id": 42,
      "start": 113.31999969482422,
      "end": 114.16000366210938,
      "text": " Are they wrapped?"
    },
    {
      "id": 43,
      "start": 114.16000366210938,
      "end": 114.9800033569336,
      "text": " Are they this?"
    },
    {
      "id": 44,
      "start": 114.9800033569336,
      "end": 116.0999984741211,
      "text": " And so on and so forth."
    },
    {
      "id": 45,
      "start": 116.9800033569336,
      "end": 119.22000122070312,
      "text": " And it's a common thing that we deal with"
    },
    {
      "id": 46,
      "start": 119.22000122070312,
      "end": 120.30000305175781,
      "text": " during this time of year."
    },
    {
      "id": 47,
      "start": 120.30000305175781,
      "end": 122.9000015258789,
      "text": " It is true, when you read the passage of Scripture"
    },
    {
      "id": 48,
      "start": 122.9000015258789,
      "end": 124.58000183105469,
      "text": " in Matthew chapter number two,"
    },
    {
      "id": 49,
      "start": 124.58000183105469,
      "end": 127.81999969482422,
      "text": " that when the wise men worshiped the Lord Jesus Christ,"
    },
    {
      "id": 50,
      "start": 127.81999969482422,
      "end": 130.5399932861328,
      "text": " that they presented unto him gifts."
    },
    {
      "id": 51,
      "start": 130.5399932861328,
      "end": 133.4600067138672,
      "text": " Gold, frankincense, and myrrh."
    },
    {
      "id": 52,
      "start": 133.4600067138672,
      "end": 135.5,
      "text": " And we're familiar with that passage of Scripture"
    },
    {
      "id": 53,
      "start": 135.5,
      "end": 136.5800018310547,
      "text": " in Matthew two."
    },
    {
      "id": 54,
      "start": 136.5800018310547,
      "end": 138.13999938964844,
      "text": " We do understand, however,"
    },
    {
      "id": 55,
      "start": 138.13999938964844,
      "end": 140.02000427246094,
      "text": " that those gifts that were presented"
    },
    {
      "id": 56,
      "start": 140.02000427246094,
      "end": 143.17999267578125,
      "text": " were significant and symbolic."
    },
    {
      "id": 57,
      "start": 143.17999267578125,
      "end": 145.02000427246094,
      "text": " They dealt with the deity of Christ,"
    },
    {
      "id": 58,
      "start": 145.02000427246094,
      "end": 146.5,
      "text": " the purity of Christ,"
    },
    {
      "id": 59,
      "start": 146.5,
      "end": 148.97999572753906,
      "text": " and ultimately the death of Christ."
    },
    {
      "id": 60,
      "start": 148.97999572753906,
      "end": 151.89999389648438,
      "text": " And we understand, even as we did not sing it this year,"
    },
    {
      "id": 61,
      "start": 151.89999389648438,
      "end": 155.10000610351562,
      "text": " but a song that is often sang during the Christmas season,"
    },
    {
      "id": 62,
      "start": 155.10000610351562,
      "end": 157.4600067138672,
      "text": " Born to Die."
    },
    {
      "id": 63,
      "start": 157.4600067138672,
      "end": 159.8000030517578,
      "text": " And we understand that even through the gifts"
    },
    {
      "id": 64,
      "start": 159.8000030517578,
      "end": 160.75999450683594,
      "text": " that were presented,"
    },
    {
      "id": 65,
      "start": 160.75999450683594,
      "end": 163.72000122070312,
      "text": " not only showing the deity and purity of Christ,"
    },
    {
      "id": 66,
      "start": 163.72000122070312,
      "end": 166.22000122070312,
      "text": " but the death of the Lord Jesus Christ."
    },
    {
      "id": 67,
      "start": 166.22000122070312,
      "end": 168.17999267578125,
      "text": " And we know that it's through his death,"
    },
    {
      "id": 68,
      "start": 168.17999267578125,
      "end": 171.6199951171875,
      "text": " his substitutionary atonement on the cross of Calvary,"
    },
    {
      "id": 69,
      "start": 171.6199951171875,
      "end": 175.33999633789062,
      "text": " that we can even have any hope of eternal life."
    },
    {
      "id": 70,
      "start": 175.33999633789062,
      "end": 177.6199951171875,
      "text": " We understand that he bled and died."
    },
    {
      "id": 71,
      "start": 177.6199951171875,
      "end": 179.5,
      "text": " He was buried in that borrowed tomb,"
    },
    {
      "id": 72,
      "start": 179.5,
      "end": 182.02000427246094,
      "text": " and he rose, conquering sin, death, and the grave."
    },
    {
      "id": 73,
      "start": 182.02000427246094,
      "end": 184.6199951171875,
      "text": " And how wonderful that is."
    },
    {
      "id": 74,
      "start": 184.6199951171875,
      "end": 186.97999572753906,
      "text": " As we come to John chapter number four,"
    },
    {
      "id": 75,
      "start": 186.97999572753906,
      "end": 189.5,
      "text": " there's a statement that is made from Jesus"
    },
    {
      "id": 76,
      "start": 189.5,
      "end": 190.5800018310547,
      "text": " in this interaction."
    },
    {
      "id": 77,
      "start": 190.5800018310547,
      "end": 192.94000244140625,
      "text": " And we won't look at the entirety of the chapter."
    },
    {
      "id": 78,
      "start": 192.94000244140625,
      "end": 194.8000030517578,
      "text": " We'll just kind of pick our way through."
    },
    {
      "id": 79,
      "start": 194.8000030517578,
      "end": 197.6999969482422,
      "text": " But I want you to notice in John four, in verse number four,"
    },
    {
      "id": 80,
      "start": 197.6999969482422,
      "end": 199.82000732421875,
      "text": " Jesus says to his disciples,"
    },
    {
      "id": 81,
      "start": 199.82000732421875,
      "end": 202.22000122070312,
      "text": " and we know that they're traveling there,"
    },
    {
      "id": 82,
      "start": 202.22000122070312,
      "end": 204.6999969482422,
      "text": " and the Word of God tells us that it says this,"
    },
    {
      "id": 83,
      "start": 204.6999969482422,
      "end": 208.4199981689453,
      "text": " and he must needs go through Samaria."
    },
    {
      "id": 84,
      "start": 208.4199981689453,
      "end": 210.10000610351562,
      "text": " And it tells us in verse number six,"
    },
    {
      "id": 85,
      "start": 210.10000610351562,
      "end": 211.6999969482422,
      "text": " now Jacob's well was there."
    },
    {
      "id": 86,
      "start": 211.6999969482422,
      "end": 214.25999450683594,
      "text": " Jesus therefore being wearied with his journey"
    },
    {
      "id": 87,
      "start": 214.25999450683594,
      "end": 216.13999938964844,
      "text": " sat thus on the well,"
    },
    {
      "id": 88,
      "start": 216.13999938964844,
      "end": 218.4199981689453,
      "text": " and it was about the sixth hour."
    },
    {
      "id": 89,
      "start": 218.4199981689453,
      "end": 221.3800048828125,
      "text": " There cometh a woman of Samaria to draw water."
    },
    {
      "id": 90,
      "start": 221.3800048828125,
      "end": 223.25999450683594,
      "text": " Jesus saith unto her,"
    },
    {
      "id": 91,
      "start": 223.25999450683594,
      "end": 226.13999938964844,
      "text": " give me to drink."
    },
    {
      "id": 92,
      "start": 226.13999938964844,
      "end": 229.74000549316406,
      "text": " For his disciples were gone away unto the city to buy meat."
    },
    {
      "id": 93,
      "start": 230.5399932861328,
      "end": 232.66000366210938,
      "text": " Then saith the woman of Samaria unto him,"
    },
    {
      "id": 94,
      "start": 232.66000366210938,
      "end": 235.97999572753906,
      "text": " how is it that thou, being a Jew,"
    },
    {
      "id": 95,
      "start": 235.97999572753906,
      "end": 238.4199981689453,
      "text": " askest drink of me?"
    },
    {
      "id": 96,
      "start": 238.4199981689453,
      "end": 240.5800018310547,
      "text": " Which I'm a woman of Samaria."
    },
    {
      "id": 97,
      "start": 240.5800018310547,
      "end": 244.74000549316406,
      "text": " For the Jews have no dealings with the Samaritans."
    },
    {
      "id": 98,
      "start": 244.74000549316406,
      "end": 246.10000610351562,
      "text": " But notice here in verse number 10,"
    },
    {
      "id": 99,
      "start": 246.10000610351562,
      "end": 249.86000061035156,
      "text": " as Jesus responds to this woman at the well,"
    },
    {
      "id": 100,
      "start": 249.86000061035156,
      "end": 251.6999969482422,
      "text": " he answered and said unto her,"
    },
    {
      "id": 101,
      "start": 251.6999969482422,
      "end": 255.5,
      "text": " if thou knewest the gift of God,"
    },
    {
      "id": 102,
      "start": 255.5,
      "end": 257.9800109863281,
      "text": " and who it is that saith to thee,"
    },
    {
      "id": 103,
      "start": 257.9800109863281,
      "end": 259.70001220703125,
      "text": " give me to drink,"
    },
    {
      "id": 104,
      "start": 259.70001220703125,
      "end": 262.4200134277344,
      "text": " thou wouldest have asked of him,"
    },
    {
      "id": 105,
      "start": 262.4200134277344,
      "end": 266.82000732421875,
      "text": " and he would have given thee living water."
    },
    {
      "id": 106,
      "start": 266.82000732421875,
      "end": 268.8999938964844,
      "text": " I wanna draw your attention to that phrase"
    },
    {
      "id": 107,
      "start": 268.8999938964844,
      "end": 270.4200134277344,
      "text": " in verse number 10,"
    },
    {
      "id": 108,
      "start": 270.4200134277344,
      "end": 274.8999938964844,
      "text": " when Jesus says, if thou knewest the gift of God."
    },
    {
      "id": 109,
      "start": 274.8999938964844,
      "end": 277.3399963378906,
      "text": " If thou knewest the gift of God."
    },
    {
      "id": 110,
      "start": 277.3399963378906,
      "end": 279.1000061035156,
      "text": " So often we have people today"
    },
    {
      "id": 111,
      "start": 279.1000061035156,
      "end": 281.3399963378906,
      "text": " that are running around buying gifts"
    },
    {
      "id": 112,
      "start": 281.3399963378906,
      "end": 283.6600036621094,
      "text": " and wrapping gifts and presenting gifts,"
    },
    {
      "id": 113,
      "start": 283.6600036621094,
      "end": 286.05999755859375,
      "text": " but they do not know of the greatest gift"
    },
    {
      "id": 114,
      "start": 286.05999755859375,
      "end": 287.5,
      "text": " that's ever been given."
    },
    {
      "id": 115,
      "start": 287.5,
      "end": 289.5400085449219,
      "text": " And here as Jesus is interacting"
    },
    {
      "id": 116,
      "start": 289.5400085449219,
      "end": 291.1000061035156,
      "text": " with this woman at the well,"
    },
    {
      "id": 117,
      "start": 291.1000061035156,
      "end": 294.8599853515625,
      "text": " he says, if thou knewest the gift of God,"
    },
    {
      "id": 118,
      "start": 294.8599853515625,
      "end": 296.82000732421875,
      "text": " and who it is that saith to thee,"
    },
    {
      "id": 119,
      "start": 296.82000732421875,
      "end": 299.260009765625,
      "text": " he is Messiah, he is Christ,"
    },
    {
      "id": 120,
      "start": 299.260009765625,
      "end": 301.6600036621094,
      "text": " he is the God in flesh,"
    },
    {
      "id": 121,
      "start": 301.6600036621094,
      "end": 303.5,
      "text": " and he's having this interaction"
    },
    {
      "id": 122,
      "start": 303.5,
      "end": 304.8599853515625,
      "text": " with this woman at the well."
    },
    {
      "id": 123,
      "start": 304.8599853515625,
      "end": 306.3800048828125,
      "text": " We'll read some of it as we continue"
    },
    {
      "id": 124,
      "start": 306.3800048828125,
      "end": 307.8999938964844,
      "text": " through the message this morning."
    },
    {
      "id": 125,
      "start": 307.8999938964844,
      "end": 310.4599914550781,
      "text": " But he says that if you knew the gift of God,"
    },
    {
      "id": 126,
      "start": 310.4599914550781,
      "end": 312.4599914550781,
      "text": " and you knew who it was that saith to thee,"
    },
    {
      "id": 127,
      "start": 312.4599914550781,
      "end": 313.6199951171875,
      "text": " give me to drink,"
    },
    {
      "id": 128,
      "start": 313.6199951171875,
      "end": 316.5400085449219,
      "text": " thou wouldest have asked of him,"
    },
    {
      "id": 129,
      "start": 316.5799865722656,
      "end": 321.0199890136719,
      "text": " and he would have given thee living water."
    },
    {
      "id": 130,
      "start": 321.0199890136719,
      "end": 323.7799987792969,
      "text": " New life through Christ."
    },
    {
      "id": 131,
      "start": 323.7799987792969,
      "end": 325.9800109863281,
      "text": " And we understand and we'll use as our title"
    },
    {
      "id": 132,
      "start": 325.9800109863281,
      "end": 327.1400146484375,
      "text": " for the message this morning,"
    },
    {
      "id": 133,
      "start": 327.1400146484375,
      "end": 330.4200134277344,
      "text": " if thou knewest the gift of God."
    },
    {
      "id": 134,
      "start": 330.4200134277344,
      "end": 331.5799865722656,
      "text": " As you study the Scriptures,"
    },
    {
      "id": 135,
      "start": 331.5799865722656,
      "end": 333.9800109863281,
      "text": " you'll find that in Romans chapter number six"
    },
    {
      "id": 136,
      "start": 333.9800109863281,
      "end": 335.5,
      "text": " and verse number 23,"
    },
    {
      "id": 137,
      "start": 335.5,
      "end": 339.3800048828125,
      "text": " the Word of God describes the gift of God this way."
    },
    {
      "id": 138,
      "start": 339.3800048828125,
      "end": 341.94000244140625,
      "text": " In Romans six and verse number 23,"
    },
    {
      "id": 139,
      "start": 341.94000244140625,
      "end": 345.4200134277344,
      "text": " it begins on really a negative note if you will,"
    },
    {
      "id": 140,
      "start": 345.4599914550781,
      "end": 348.8599853515625,
      "text": " but it's a note that is necessary nonetheless."
    },
    {
      "id": 141,
      "start": 348.8599853515625,
      "end": 351.3399963378906,
      "text": " The Bible says in Romans six and verse number 23,"
    },
    {
      "id": 142,
      "start": 351.3399963378906,
      "end": 354.9800109863281,
      "text": " for the wages of sin is death."
    },
    {
      "id": 143,
      "start": 354.9800109863281,
      "end": 356.6199951171875,
      "text": " And we understand that to be the case."
    },
    {
      "id": 144,
      "start": 356.6199951171875,
      "end": 359.1400146484375,
      "text": " We understand the Bible tells us in Romans three"
    },
    {
      "id": 145,
      "start": 359.1400146484375,
      "end": 361.260009765625,
      "text": " that there's none that doeth good."
    },
    {
      "id": 146,
      "start": 361.260009765625,
      "end": 363.1400146484375,
      "text": " We understand the Bible tells us"
    },
    {
      "id": 147,
      "start": 363.1400146484375,
      "end": 365.8599853515625,
      "text": " that all of our good works in the book of Isaiah"
    },
    {
      "id": 148,
      "start": 365.8599853515625,
      "end": 367.2200012207031,
      "text": " are as filthy rags."
    },
    {
      "id": 149,
      "start": 367.2200012207031,
      "end": 371.29998779296875,
      "text": " And we understand that the wages of sin is death."
    },
    {
      "id": 150,
      "start": 371.29998779296875,
      "end": 373.70001220703125,
      "text": " All men are sinners."
    },
    {
      "id": 151,
      "start": 373.739990234375,
      "end": 375.5799865722656,
      "text": " The penalty for sin is death,"
    },
    {
      "id": 152,
      "start": 375.5799865722656,
      "end": 378.1000061035156,
      "text": " but you notice the great conjunction"
    },
    {
      "id": 153,
      "start": 378.1000061035156,
      "end": 380.3800048828125,
      "text": " in Romans six and verse number 23,"
    },
    {
      "id": 154,
      "start": 380.3800048828125,
      "end": 381.2200012207031,
      "text": " the Bible says,"
    },
    {
      "id": 155,
      "start": 381.2200012207031,
      "end": 386.2200012207031,
      "text": " but the gift of God is eternal life"
    },
    {
      "id": 156,
      "start": 388.4200134277344,
      "end": 391.7799987792969,
      "text": " through Jesus Christ, our Lord."
    },
    {
      "id": 157,
      "start": 391.7799987792969,
      "end": 395.82000732421875,
      "text": " I want you to consider the statement in John four"
    },
    {
      "id": 158,
      "start": 395.82000732421875,
      "end": 397.2200012207031,
      "text": " in verse number 10,"
    },
    {
      "id": 159,
      "start": 397.2200012207031,
      "end": 399.70001220703125,
      "text": " when Jesus says to the woman at the well,"
    },
    {
      "id": 160,
      "start": 399.70001220703125,
      "end": 402.9800109863281,
      "text": " if thou knewest the gift of God."
    },
    {
      "id": 161,
      "start": 402.9800109863281,
      "end": 406.5799865722656,
      "text": " And we understand here in Romans six in verse number 23,"
    },
    {
      "id": 162,
      "start": 406.5799865722656,
      "end": 408.260009765625,
      "text": " when the word of God tells us"
    },
    {
      "id": 163,
      "start": 408.260009765625,
      "end": 413.05999755859375,
      "text": " that the gift of God is eternal life"
    },
    {
      "id": 164,
      "start": 413.05999755859375,
      "end": 415.8999938964844,
      "text": " through Jesus Christ, our Lord."
    },
    {
      "id": 165,
      "start": 415.8999938964844,
      "end": 416.7799987792969,
      "text": " I want you this morning,"
    },
    {
      "id": 166,
      "start": 416.7799987792969,
      "end": 417.6600036621094,
      "text": " if you're taking notes,"
    },
    {
      "id": 167,
      "start": 417.6600036621094,
      "end": 421.3800048828125,
      "text": " first of all, to consider His gift to me."
    },
    {
      "id": 168,
      "start": 421.3800048828125,
      "end": 423.0199890136719,
      "text": " Consider His gift to me."
    },
    {
      "id": 169,
      "start": 423.0199890136719,
      "end": 425.0199890136719,
      "text": " And I'm so thankful for the gift of God,"
    },
    {
      "id": 170,
      "start": 425.0199890136719,
      "end": 428.1000061035156,
      "text": " which is eternal life through Jesus Christ, our Lord."
    },
    {
      "id": 171,
      "start": 428.1000061035156,
      "end": 429.82000732421875,
      "text": " I'm thankful this morning to know"
    },
    {
      "id": 172,
      "start": 429.82000732421875,
      "end": 431.760009765625,
      "text": " that my sins have been forgiven,"
    },
    {
      "id": 173,
      "start": 431.760009765625,
      "end": 433.32000732421875,
      "text": " not by anything that I've done,"
    },
    {
      "id": 174,
      "start": 433.32000732421875,
      "end": 435.2799987792969,
      "text": " but all because of what Jesus Christ did"
    },
    {
      "id": 175,
      "start": 435.2799987792969,
      "end": 436.760009765625,
      "text": " on the cross of Calvary."
    },
    {
      "id": 176,
      "start": 436.760009765625,
      "end": 439.1600036621094,
      "text": " And because of His substitutionary atonement,"
    },
    {
      "id": 177,
      "start": 439.1600036621094,
      "end": 441.3999938964844,
      "text": " because of His glorious resurrection,"
    },
    {
      "id": 178,
      "start": 441.3999938964844,
      "end": 443.44000244140625,
      "text": " we can stand redeemed,"
    },
    {
      "id": 179,
      "start": 443.44000244140625,
      "end": 445.6000061035156,
      "text": " understanding that we've been forgiven,"
    },
    {
      "id": 180,
      "start": 445.6000061035156,
      "end": 449.20001220703125,
      "text": " that we have been the recipients of the gift of God,"
    },
    {
      "id": 181,
      "start": 449.20001220703125,
      "end": 450.8399963378906,
      "text": " which is eternal life."
    },
    {
      "id": 182,
      "start": 450.8399963378906,
      "end": 453.9599914550781,
      "text": " This morning, when I consider the gift of God,"
    },
    {
      "id": 183,
      "start": 453.9599914550781,
      "end": 456.0799865722656,
      "text": " and I consider His gift to me,"
    },
    {
      "id": 184,
      "start": 456.0799865722656,
      "end": 457.55999755859375,
      "text": " I would say this morning"
    },
    {
      "id": 185,
      "start": 457.55999755859375,
      "end": 460.6000061035156,
      "text": " that His gift is truly the greatest gift."
    },
    {
      "id": 186,
      "start": 460.6000061035156,
      "end": 463.0,
      "text": " It is the perfect gift."
    },
    {
      "id": 187,
      "start": 463.0,
      "end": 466.3999938964844,
      "text": " So many people run around in this society"
    },
    {
      "id": 188,
      "start": 466.3999938964844,
      "end": 467.6400146484375,
      "text": " in the hustle and bustle,"
    },
    {
      "id": 189,
      "start": 467.6400146484375,
      "end": 469.6199951171875,
      "text": " and you get emails just like I do."
    },
    {
      "id": 190,
      "start": 469.6199951171875,
      "end": 470.8800048828125,
      "text": " You only have so many days,"
    },
    {
      "id": 191,
      "start": 470.8800048828125,
      "end": 472.29998779296875,
      "text": " and you missed the shipping window,"
    },
    {
      "id": 192,
      "start": 472.29998779296875,
      "end": 474.0400085449219,
      "text": " and you got a this, and so on and so forth,"
    },
    {
      "id": 193,
      "start": 474.0400085449219,
      "end": 477.3999938964844,
      "text": " and people are looking for that perfect gift."
    },
    {
      "id": 194,
      "start": 477.3999938964844,
      "end": 479.4800109863281,
      "text": " And all the while, they're ignorant,"
    },
    {
      "id": 195,
      "start": 479.4800109863281,
      "end": 482.260009765625,
      "text": " they're unaware of the gift of God."
    },
    {
      "id": 196,
      "start": 483.5,
      "end": 486.1600036621094,
      "text": " They're not knowing this morning"
    },
    {
      "id": 197,
      "start": 486.1600036621094,
      "end": 488.2200012207031,
      "text": " the subject matter in which we're dealing with."
    },
    {
      "id": 198,
      "start": 488.2200012207031,
      "end": 491.5,
      "text": " They're not confident in their eternal security,"
    },
    {
      "id": 199,
      "start": 491.5,
      "end": 493.4599914550781,
      "text": " because they don't know the gift of God."
    },
    {
      "id": 200,
      "start": 493.4599914550781,
      "end": 495.2200012207031,
      "text": " They're like that woman at the well"
    },
    {
      "id": 201,
      "start": 495.2200012207031,
      "end": 497.5,
      "text": " that came to simply draw water"
    },
    {
      "id": 202,
      "start": 497.5,
      "end": 500.3399963378906,
      "text": " and had no idea that she was gonna meet Jesus"
    },
    {
      "id": 203,
      "start": 500.3399963378906,
      "end": 502.3399963378906,
      "text": " on that particular day."
    },
    {
      "id": 204,
      "start": 502.3399963378906,
      "end": 505.1199951171875,
      "text": " And Jesus said, if thou knewest the gift of God."
    },
    {
      "id": 205,
      "start": 505.1199951171875,
      "end": 508.8999938964844,
      "text": " Let me give you some truth about this gift of God."
    },
    {
      "id": 206,
      "start": 508.8999938964844,
      "end": 513.219970703125,
      "text": " I would say this, His gift to me is beyond description."
    },
    {
      "id": 207,
      "start": 513.219970703125,
      "end": 514.3800048828125,
      "text": " You ever receive a gift,"
    },
    {
      "id": 208,
      "start": 514.3800048828125,
      "end": 516.5,
      "text": " and you try to describe it to someone,"
    },
    {
      "id": 209,
      "start": 516.5,
      "end": 517.8200073242188,
      "text": " and you try to explain it,"
    },
    {
      "id": 210,
      "start": 518.3800048828125,
      "end": 519.5,
      "text": " and perhaps in our society today,"
    },
    {
      "id": 211,
      "start": 519.5,
      "end": 522.0599975585938,
      "text": " we understand with advancements in technology"
    },
    {
      "id": 212,
      "start": 522.0599975585938,
      "end": 523.739990234375,
      "text": " that we just can FaceTime people,"
    },
    {
      "id": 213,
      "start": 523.739990234375,
      "end": 525.6599731445312,
      "text": " and we can video message people,"
    },
    {
      "id": 214,
      "start": 525.6599731445312,
      "end": 527.8200073242188,
      "text": " and we can show them, and we can let them see it,"
    },
    {
      "id": 215,
      "start": 527.8200073242188,
      "end": 528.7000122070312,
      "text": " and so on and so forth."
    },
    {
      "id": 216,
      "start": 528.7000122070312,
      "end": 531.1799926757812,
      "text": " But if you would entertain me just for a few moments,"
    },
    {
      "id": 217,
      "start": 531.1799926757812,
      "end": 534.6199951171875,
      "text": " when I was a kid, that technology didn't exist."
    },
    {
      "id": 218,
      "start": 534.6199951171875,
      "end": 536.260009765625,
      "text": " Yes, I'm not that old,"
    },
    {
      "id": 219,
      "start": 536.260009765625,
      "end": 538.3800048828125,
      "text": " but the technology didn't exist, amen?"
    },
    {
      "id": 220,
      "start": 538.3800048828125,
      "end": 540.4000244140625,
      "text": " And I remember as a child,"
    },
    {
      "id": 221,
      "start": 540.4000244140625,
      "end": 542.0999755859375,
      "text": " I remember getting on the phone"
    },
    {
      "id": 222,
      "start": 542.0999755859375,
      "end": 544.1400146484375,
      "text": " with my grandparents on Christmas Day,"
    },
    {
      "id": 223,
      "start": 544.1400146484375,
      "end": 547.1400146484375,
      "text": " and I remember having conversations with them,"
    },
    {
      "id": 224,
      "start": 547.1400146484375,
      "end": 549.1799926757812,
      "text": " and something that they would commonly ask"
    },
    {
      "id": 225,
      "start": 549.1799926757812,
      "end": 551.5399780273438,
      "text": " on Christmas morning would be this question,"
    },
    {
      "id": 226,
      "start": 551.5399780273438,
      "end": 553.8599853515625,
      "text": " what did you get for Christmas?"
    },
    {
      "id": 227,
      "start": 553.8599853515625,
      "end": 556.6199951171875,
      "text": " And you understand that for many of those years,"
    },
    {
      "id": 228,
      "start": 556.6199951171875,
      "end": 559.8599853515625,
      "text": " I was not saved, and I did not know the gift of God"
    },
    {
      "id": 229,
      "start": 559.8599853515625,
      "end": 561.5999755859375,
      "text": " that we're speaking about this morning."
    },
    {
      "id": 230,
      "start": 561.5999755859375,
      "end": 564.97998046875,
      "text": " My grandparents were lost, I was lost, my family was lost."
    },
    {
      "id": 231,
      "start": 564.97998046875,
      "end": 567.8599853515625,
      "text": " We didn't know anything about the gift of God."
    },
    {
      "id": 232,
      "start": 567.8599853515625,
      "end": 569.219970703125,
      "text": " We didn't understand the truth"
    },
    {
      "id": 233,
      "start": 569.219970703125,
      "end": 570.780029296875,
      "text": " that we're dealing with this morning."
    },
    {
      "id": 234,
      "start": 570.780029296875,
      "end": 573.5,
      "text": " And I remember trying as a young child"
    },
    {
      "id": 235,
      "start": 573.5399780273438,
      "end": 578.5399780273438,
      "text": " to describe the gift that I received to my grandparents."
    },
    {
      "id": 236,
      "start": 578.6599731445312,
      "end": 579.8200073242188,
      "text": " And I would try to describe it."
    },
    {
      "id": 237,
      "start": 579.8200073242188,
      "end": 583.3400268554688,
      "text": " Well, the gift of God is beyond description."
    },
    {
      "id": 238,
      "start": 583.3400268554688,
      "end": 585.3599853515625,
      "text": " The reality is that the Bible tells us,"
    },
    {
      "id": 239,
      "start": 585.3599853515625,
      "end": 587.02001953125,
      "text": " if you turn over to the book of 2 Corinthians"
    },
    {
      "id": 240,
      "start": 587.02001953125,
      "end": 588.3800048828125,
      "text": " in chapter number nine,"
    },
    {
      "id": 241,
      "start": 588.3800048828125,
      "end": 590.780029296875,
      "text": " and we'll look at this verse a couple of times this morning,"
    },
    {
      "id": 242,
      "start": 590.780029296875,
      "end": 593.260009765625,
      "text": " in fact, it's a simple verse of Scripture,"
    },
    {
      "id": 243,
      "start": 593.260009765625,
      "end": 595.7000122070312,
      "text": " but I want you to think about what the Word of God says"
    },
    {
      "id": 244,
      "start": 595.7000122070312,
      "end": 597.780029296875,
      "text": " when we consider the description,"
    },
    {
      "id": 245,
      "start": 597.780029296875,
      "end": 600.2999877929688,
      "text": " and the fact that His gift to me is beyond."
    },
    {
      "id": 0,
      "start": 600.2999877929688,
      "end": 605.5599880218506,
      "text": " description. The Bible says this in 2nd Corinthians 9 and verse number 15,"
    },
    {
      "id": 1,
      "start": 605.5599880218506,
      "end": 614.4399881362915,
      "text": " thanks be unto God for his unspeakable gift. As much as we try to describe the"
    },
    {
      "id": 2,
      "start": 614.4399881362915,
      "end": 620.0399875640869,
      "text": " gift of God which is eternal life, as much as we try to exalt the Lord Jesus"
    },
    {
      "id": 3,
      "start": 620.0399875640869,
      "end": 624.5199871063232,
      "text": " Christ through understanding this gift, the reality is that we do not have a"
    },
    {
      "id": 4,
      "start": 624.5199871063232,
      "end": 629.9999885559082,
      "text": " full comprehension of all that is contained within this gift of God which"
    },
    {
      "id": 5,
      "start": 629.9999885559082,
      "end": 635.4799880981445,
      "text": " is eternal life. It's a precious gift. And we think about the the truth in"
    },
    {
      "id": 6,
      "start": 635.4799880981445,
      "end": 642.8799896240234,
      "text": " 2nd Corinthians 9 for his unspeakable gift. If I could begin to describe to you"
    },
    {
      "id": 7,
      "start": 642.8799896240234,
      "end": 647.0399894714355,
      "text": " this gift of God which is eternal life, and I know that I'm speaking to many"
    },
    {
      "id": 8,
      "start": 647.0399894714355,
      "end": 650.5799865722656,
      "text": " that have received Christ as their Savior this morning, but as we would"
    },
    {
      "id": 9,
      "start": 650.5799865722656,
      "end": 655.3999862670898,
      "text": " begin to describe that gift of God that he has given me eternal life, but we"
    },
    {
      "id": 10,
      "start": 655.3999862670898,
      "end": 658.9199867248535,
      "text": " understand that it's it's so much more than just eternal life. I mean he's"
    },
    {
      "id": 11,
      "start": 658.9199867248535,
      "end": 663.679988861084,
      "text": " given us abundant life, he's given us all things that pertain unto life and"
    },
    {
      "id": 12,
      "start": 663.679988861084,
      "end": 667.7599868774414,
      "text": " godliness, he's blessed us with all spiritual blessings in heavenly places,"
    },
    {
      "id": 13,
      "start": 667.7599868774414,
      "end": 672.6799850463867,
      "text": " he's given us promises that are precious, and he promises to be with us and to"
    },
    {
      "id": 14,
      "start": 672.6799850463867,
      "end": 678.3999862670898,
      "text": " guide us and lead us. It's amazing. He said I'm your shepherd. You think about"
    },
    {
      "id": 15,
      "start": 678.3999862670898,
      "end": 682.8399887084961,
      "text": " the truth of Psalm 23 and you do not have to take the time to turn there, but"
    },
    {
      "id": 16,
      "start": 682.8399887084961,
      "end": 687.8799896240234,
      "text": " it's an amazing truth where the psalmist ends that psalm by saying surely goodness"
    },
    {
      "id": 17,
      "start": 687.8799896240234,
      "end": 693.6399841308594,
      "text": " and mercy shall follow me all the days of my life and I will dwell in the house"
    },
    {
      "id": 18,
      "start": 693.6399841308594,
      "end": 699.3599853515625,
      "text": " of the Lord forever. I want you to understand this morning that the truth"
    },
    {
      "id": 19,
      "start": 699.3599853515625,
      "end": 704.4399871826172,
      "text": " of the last statement of the 23rd Psalm is directly related to the first"
    },
    {
      "id": 20,
      "start": 704.4399871826172,
      "end": 709.1999893188477,
      "text": " statement of the 23rd Psalm. He cannot have the confidence that he will dwell"
    },
    {
      "id": 21,
      "start": 709.1999893188477,
      "end": 714.9199905395508,
      "text": " in the house of the Lord forever if first the Lord is not my shepherd. But"
    },
    {
      "id": 22,
      "start": 714.9199905395508,
      "end": 721.4799880981445,
      "text": " because the Lord is my shepherd, because I understand who he is to me, I can say I"
    },
    {
      "id": 23,
      "start": 721.4799880981445,
      "end": 727.119987487793,
      "text": " will dwell in the house of the Lord forever. Oh this gift of God is precious."
    },
    {
      "id": 24,
      "start": 727.119987487793,
      "end": 732.5199890136719,
      "text": " I understand it's beyond description, the gift was purchased with the precious"
    },
    {
      "id": 25,
      "start": 732.5199890136719,
      "end": 738.7999877929688,
      "text": " blood of Jesus Christ. If you purchase a gift, you have to pay for that gift, right?"
    },
    {
      "id": 26,
      "start": 738.7999877929688,
      "end": 742.1999816894531,
      "text": " That's how it works. You don't just go to the clerk at the store and say well my"
    },
    {
      "id": 27,
      "start": 742.1999816894531,
      "end": 747.1999816894531,
      "text": " kid really wants this. All right, I mean that's fine, it's X number of dollars and"
    },
    {
      "id": 28,
      "start": 747.1999816894531,
      "end": 751.3199920654297,
      "text": " you say well I don't have that. Well you can't have the item. I mean we understand"
    },
    {
      "id": 29,
      "start": 751.3199920654297,
      "end": 757.47998046875,
      "text": " that, it's real simple. In this gift that God has for me, his gift for me, when he"
    },
    {
      "id": 30,
      "start": 757.47998046875,
      "end": 762.4399871826172,
      "text": " says to the woman at the well, if thou knewest the gift of God, we understand"
    },
    {
      "id": 31,
      "start": 762.4399871826172,
      "end": 767.239990234375,
      "text": " that this gift that he speaks of, this gift of eternal life, it was purchased"
    },
    {
      "id": 32,
      "start": 767.3599853515625,
      "end": 774.0399932861328,
      "text": " with his own precious blood. The value is beyond anything that we could even begin"
    },
    {
      "id": 33,
      "start": 774.0399932861328,
      "end": 780.7599945068359,
      "text": " to consider. In fact, when you consider this morning the truth of 1 Peter, take a"
    },
    {
      "id": 34,
      "start": 780.7599945068359,
      "end": 786.47998046875,
      "text": " moment and turn to 1 Peter chapter number 1, we understand here that God"
    },
    {
      "id": 35,
      "start": 786.47998046875,
      "end": 793.3999938964844,
      "text": " gives us great truth with regard to the price for our salvation, the price for"
    },
    {
      "id": 36,
      "start": 793.4399871826172,
      "end": 798.9599914550781,
      "text": " this gift that has been provided. And you understand that as we consider his gift"
    },
    {
      "id": 37,
      "start": 798.9599914550781,
      "end": 804.239990234375,
      "text": " to me this morning and we understand what blessed truth it is that he would"
    },
    {
      "id": 38,
      "start": 804.239990234375,
      "end": 808.8399810791016,
      "text": " pay for that gift with his precious blood. Let me say this, he didn't simply"
    },
    {
      "id": 39,
      "start": 808.8399810791016,
      "end": 813.5199890136719,
      "text": " make a down payment for the gift. He paid for it in full. Aren't you thankful for"
    },
    {
      "id": 40,
      "start": 813.5199890136719,
      "end": 817.47998046875,
      "text": " that? I remember back in the day, I don't even know if they still have it today, lay"
    },
    {
      "id": 41,
      "start": 817.47998046875,
      "end": 821.8399810791016,
      "text": " away, but I remember back in the day my grandmother on my mom's side, she would"
    },
    {
      "id": 42,
      "start": 821.8399810791016,
      "end": 825.5999908447266,
      "text": " like to shop at Kmart and Kmart had blue light specials and they also had lay"
    },
    {
      "id": 43,
      "start": 825.5999908447266,
      "end": 830.0799865722656,
      "text": " away. Some of you say, I don't even know what Kmart is. It's okay. And it's"
    },
    {
      "id": 44,
      "start": 830.0799865722656,
      "end": 833.6799926757812,
      "text": " Walmart but really bad. That's the best way I could describe it. That's why"
    },
    {
      "id": 45,
      "start": 833.6799926757812,
      "end": 838.5599822998047,
      "text": " they don't exist anymore. But the reality is that I remember my grandmother putting"
    },
    {
      "id": 46,
      "start": 838.5599822998047,
      "end": 843.4399871826172,
      "text": " things on lay away. Some of you remember lay away, some of you have no"
    },
    {
      "id": 47,
      "start": 843.4399871826172,
      "end": 847.6799926757812,
      "text": " idea what we're talking about, but stick with me just for a moment. It's my"
    },
    {
      "id": 48,
      "start": 847.6799926757812,
      "end": 850.9599914550781,
      "text": " understanding I've never personally put anything on lay away, but I was with my"
    },
    {
      "id": 49,
      "start": 850.9599914550781,
      "end": 855.4399871826172,
      "text": " grandmother when she did on a number of occasions. Dad, didn't she like Kmart and"
    },
    {
      "id": 50,
      "start": 855.4399871826172,
      "end": 860.9599914550781,
      "text": " lay away? Man, she loved it. I'm being serious. And she'd go in there and guess"
    },
    {
      "id": 51,
      "start": 860.9599914550781,
      "end": 864.5599975585938,
      "text": " what? When she put those items in there, she'd have put some kind of down payment."
    },
    {
      "id": 52,
      "start": 864.5599975585938,
      "end": 871.6799926757812,
      "text": " Right? But she couldn't take the items. They kept the items. Right? That's how it"
    },
    {
      "id": 53,
      "start": 871.6799926757812,
      "end": 876.4400024414062,
      "text": " worked. And then you'd go back and you make another payment. And you go back and"
    },
    {
      "id": 54,
      "start": 876.4400024414062,
      "end": 880.1999816894531,
      "text": " you make another payment and eventually, you guys don't know about lay away? Mike"
    },
    {
      "id": 55,
      "start": 880.1999816894531,
      "end": 887.3199768066406,
      "text": " and Elizabeth, you can't be that young. They're sitting here going, what? You guys"
    },
    {
      "id": 56,
      "start": 887.3199768066406,
      "end": 892.5999755859375,
      "text": " know about lay away? Some of you know about lay away. Come on. Amen? Come on. I'm"
    },
    {
      "id": 57,
      "start": 892.5999755859375,
      "end": 902.6399841308594,
      "text": " not that old. Good night. Eventually, you paid off and then you get to take the"
    },
    {
      "id": 58,
      "start": 902.6399841308594,
      "end": 910.6399841308594,
      "text": " product. God didn't just make a down payment for your salvation. He paid for"
    },
    {
      "id": 59,
      "start": 910.6399841308594,
      "end": 917.2799987792969,
      "text": " it all. Amen? He says here in 1 Peter 1 in verse 17,"
    },
    {
      "id": 60,
      "start": 917.2799987792969,
      "end": 921.6399841308594,
      "text": " and if you call on the Father, who without respect of persons judgeth"
    },
    {
      "id": 61,
      "start": 921.6399841308594,
      "end": 926.3599853515625,
      "text": " according to every man's work, past the time of your sojourning here in fear, for"
    },
    {
      "id": 62,
      "start": 926.3599853515625,
      "end": 932.0,
      "text": " as much as you know, that ye were not redeemed with corruptible things as"
    },
    {
      "id": 63,
      "start": 932.0,
      "end": 937.6799926757812,
      "text": " silver and gold from your vain conversation received by tradition from"
    },
    {
      "id": 64,
      "start": 937.6799926757812,
      "end": 942.0799865722656,
      "text": " your fathers. Now, we understand that he says, listen, the redemption that we enjoy"
    },
    {
      "id": 65,
      "start": 942.0799865722656,
      "end": 946.47998046875,
      "text": " being saved, having this gift of God which is eternal life, it wasn't paid for"
    },
    {
      "id": 66,
      "start": 946.47998046875,
      "end": 955.1599731445312,
      "text": " with silver and gold. Notice verse 19, but with the precious blood of Christ as of a"
    },
    {
      "id": 67,
      "start": 955.1599731445312,
      "end": 960.5199890136719,
      "text": " lamb without blemish and without spot, who verily was for ordained before the"
    },
    {
      "id": 68,
      "start": 960.5199890136719,
      "end": 965.6799926757812,
      "text": " foundation of the world, but was manifest in these last times for you, who by him"
    },
    {
      "id": 69,
      "start": 965.6799926757812,
      "end": 970.1599731445312,
      "text": " do believe in God that raised him up from the dead and gave him glory that"
    },
    {
      "id": 70,
      "start": 970.1599731445312,
      "end": 977.2799987792969,
      "text": " your faith and hope might be in God. We're redeemed with the precious blood"
    },
    {
      "id": 71,
      "start": 977.2799987792969,
      "end": 984.1599731445312,
      "text": " of Christ, the price, the price that was paid. Listen, you cannot buy the gift of"
    },
    {
      "id": 72,
      "start": 984.1599731445312,
      "end": 990.3199768066406,
      "text": " God. It's already been bought by him with his blood. And we understand this"
    },
    {
      "id": 73,
      "start": 990.3199768066406,
      "end": 995.3999938964844,
      "text": " morning that this gift that we're speaking of, his gift to me, this gift of"
    },
    {
      "id": 74,
      "start": 995.3999938964844,
      "end": 999.3999938964844,
      "text": " eternal life, that it's beyond description. It says, but thanks be to God"
    },
    {
      "id": 75,
      "start": 999.3999938964844,
      "end": 1004.0799865722656,
      "text": " for his unspeakable gift. We think about his gift being purchased with the"
    },
    {
      "id": 76,
      "start": 1004.0799865722656,
      "end": 1009.2799987792969,
      "text": " precious blood of Christ that we're redeemed, that we're forgiven through the"
    },
    {
      "id": 77,
      "start": 1009.2799987792969,
      "end": 1015.5999755859375,
      "text": " blood. The Old Testament, the types all throughout the Old Testament of"
    },
    {
      "id": 78,
      "start": 1015.5999755859375,
      "end": 1020.7200012207031,
      "text": " the blood, of the blood, of the blood. You go to the tabernacle and you find that"
    },
    {
      "id": 79,
      "start": 1020.7200012207031,
      "end": 1023.7200012207031,
      "text": " as soon as you would enter into the tabernacle, and there's only one way to"
    },
    {
      "id": 80,
      "start": 1023.7200012207031,
      "end": 1027.5599975585938,
      "text": " enter into the tabernacle, and the first piece of furniture that you'd come to is"
    },
    {
      "id": 81,
      "start": 1027.5599975585938,
      "end": 1032.8799743652344,
      "text": " the brazen altar. Why? Because a sacrifice was required. Blood had to be"
    },
    {
      "id": 82,
      "start": 1032.8799743652344,
      "end": 1037.6399841308594,
      "text": " shed. You find that if you go prior to that and you begin to look all the way"
    },
    {
      "id": 83,
      "start": 1037.7999877929688,
      "end": 1043.0,
      "text": " back into the garden, you understand that after sin entered into the world, after"
    },
    {
      "id": 84,
      "start": 1043.0,
      "end": 1047.5599975585938,
      "text": " Adam and Eve sinned and their eyes were opened, what's the first thing that they"
    },
    {
      "id": 85,
      "start": 1047.5599975585938,
      "end": 1052.1999816894531,
      "text": " did? They recognized that they were naked and they put fig leaves to try to cover"
    },
    {
      "id": 86,
      "start": 1052.1999816894531,
      "end": 1059.0399780273438,
      "text": " their nakedness. Correct? What did God say? It's not satisfactory. That's not"
    },
    {
      "id": 87,
      "start": 1059.0399780273438,
      "end": 1064.6399841308594,
      "text": " sufficient. And therefore an animal had to be killed. I would argue a lamb had to"
    },
    {
      "id": 88,
      "start": 1064.6399841308594,
      "end": 1071.8799743652344,
      "text": " be killed so that coats of skin could be provided for Adam and Eve while showing"
    },
    {
      "id": 89,
      "start": 1071.8799743652344,
      "end": 1078.5199890136719,
      "text": " them that the blood was required. The works of your hands are not sufficient,"
    },
    {
      "id": 90,
      "start": 1078.5199890136719,
      "end": 1085.3999938964844,
      "text": " but the blood is required. And from that point all the way through, you find how"
    },
    {
      "id": 91,
      "start": 1085.3999938964844,
      "end": 1090.47998046875,
      "text": " that it was a picture. You notice with the offerings of Cain and Abel, you"
    },
    {
      "id": 92,
      "start": 1090.47998046875,
      "end": 1097.8399963378906,
      "text": " notice with the truth of Abraham and others, with believing God and the"
    },
    {
      "id": 93,
      "start": 1097.8399963378906,
      "end": 1105.47998046875,
      "text": " truth of the Passover and the blood and how it all pointed to Messiah. And now"
    },
    {
      "id": 94,
      "start": 1105.47998046875,
      "end": 1112.5999755859375,
      "text": " He's come and He paid. He went to that cross. He shed His precious blood. That's"
    },
    {
      "id": 95,
      "start": 1113.1599731445312,
      "end": 1125.5199584960938,
      "text": " how our gift was paid for. He says in John, it is finished. It's paid for, paid"
    },
    {
      "id": 96,
      "start": 1125.5199584960938,
      "end": 1134.239990234375,
      "text": " in full. The gift, not only the unspeakable gift, not only that it's been purchased"
    },
    {
      "id": 97,
      "start": 1134.239990234375,
      "end": 1138.3999633789062,
      "text": " with His precious blood, but I want you to consider this this morning, His gift is"
    },
    {
      "id": 98,
      "start": 1138.3999633789062,
      "end": 1145.0800170898438,
      "text": " available to all. His gift is available to all. We're living in a time right now"
    },
    {
      "id": 99,
      "start": 1145.0800170898438,
      "end": 1147.8800048828125,
      "text": " where they're talking about supply chain issues, right? We've been hearing about"
    },
    {
      "id": 100,
      "start": 1147.8800048828125,
      "end": 1151.8800048828125,
      "text": " it for a long time in the news and trying to get you to go spend your money"
    },
    {
      "id": 101,
      "start": 1151.8800048828125,
      "end": 1156.3200073242188,
      "text": " now so that you can get whatever that item is because the supply chain issues"
    },
    {
      "id": 102,
      "start": 1156.3200073242188,
      "end": 1159.3999633789062,
      "text": " and it's not going to be available and so on and so forth. And whatever those"
    },
    {
      "id": 103,
      "start": 1159.3999633789062,
      "end": 1163.9199829101562,
      "text": " hot items are that are the most popular gifts of the year, you can find that"
    },
    {
      "id": 104,
      "start": 1163.9199829101562,
      "end": 1168.0,
      "text": " sometimes they're just not available. There are times in which you can't find"
    },
    {
      "id": 105,
      "start": 1168.0,
      "end": 1172.6400146484375,
      "text": " that gift that Johnny or Susie really wants and as a parent you so desire"
    },
    {
      "id": 106,
      "start": 1172.6400146484375,
      "end": 1177.3200073242188,
      "text": " perhaps to be able to get that gift for them, but it's just simply not available, out"
    },
    {
      "id": 107,
      "start": 1177.3200073242188,
      "end": 1183.719970703125,
      "text": " of stock, coming soon. I want you to understand that this gift that we're"
    },
    {
      "id": 108,
      "start": 1183.719970703125,
      "end": 1187.3999633789062,
      "text": " speaking of this morning, when Jesus says to the woman at the well, if thou"
    },
    {
      "id": 109,
      "start": 1187.3999633789062,
      "end": 1192.5199584960938,
      "text": " knewest the gift of God, this gift is available to all. It's available to every"
    },
    {
      "id": 110,
      "start": 1192.5199584960938,
      "end": 1197.4400024414062,
      "text": " single person. The Bible tells us in Romans 1 and verse number 16, when Paul"
    },
    {
      "id": 111,
      "start": 1197.4400024414062,
      "end": 1202.6400146484375,
      "text": " is declaring this great truth, he says"
    },
    {
      "id": 0,
      "start": 1202.6400146484375,
      "end": 1205.120014667511,
      "text": " I am not ashamed of the gospel of Christ."
    },
    {
      "id": 1,
      "start": 1205.120014667511,
      "end": 1206.120014667511,
      "text": " Why?"
    },
    {
      "id": 2,
      "start": 1206.120014667511,
      "end": 1209.7600145339966,
      "text": " For it is the power of God unto salvation to everyone that believeth, to the Jew first"
    },
    {
      "id": 3,
      "start": 1209.7600145339966,
      "end": 1212.4400148391724,
      "text": " and also to the Greek.\""
    },
    {
      "id": 4,
      "start": 1212.4400148391724,
      "end": 1218.6000146865845,
      "text": " We understand that the Word of God teaches us in Romans 10 in verse number 13, for whosoever"
    },
    {
      "id": 5,
      "start": 1218.6000146865845,
      "end": 1225.0800151824951,
      "text": " shall call upon the name of the Lord shall be saved."
    },
    {
      "id": 6,
      "start": 1225.0800151824951,
      "end": 1229.9600143432617,
      "text": " In 2 Peter chapter number 3, the Bible tells us that our God is not willing that any should"
    },
    {
      "id": 7,
      "start": 1229.9600143432617,
      "end": 1234.0800151824951,
      "text": " perish, but that all should come to repentance."
    },
    {
      "id": 8,
      "start": 1234.0800151824951,
      "end": 1239.2000160217285,
      "text": " When He went to that cruel cross, see, He was born to die, and we think about gifts"
    },
    {
      "id": 9,
      "start": 1239.2000160217285,
      "end": 1244.840015411377,
      "text": " and exchanging of gifts, but the greatest gift, the most perfect gift, is this gift"
    },
    {
      "id": 10,
      "start": 1244.840015411377,
      "end": 1247.6400146484375,
      "text": " of God, which is eternal life."
    },
    {
      "id": 11,
      "start": 1247.6400146484375,
      "end": 1254.4800148010254,
      "text": " And Jesus says to the woman at the well, if thou knewest the gift of God, if you knew"
    },
    {
      "id": 12,
      "start": 1254.4800148010254,
      "end": 1255.4800148010254,
      "text": " it."
    },
    {
      "id": 13,
      "start": 1255.4800148010254,
      "end": 1260.3600158691406,
      "text": " You've got to understand that in John chapter 4, if you've held your place there, or if"
    },
    {
      "id": 14,
      "start": 1260.3600158691406,
      "end": 1263.8800163269043,
      "text": " not, turn back there and notice what is happening here."
    },
    {
      "id": 15,
      "start": 1263.8800163269043,
      "end": 1268.400016784668,
      "text": " It says here, when we think about this truth of it being available, understand that in"
    },
    {
      "id": 16,
      "start": 1268.400016784668,
      "end": 1272.9600143432617,
      "text": " verse number 9, there's some input that is given how that she says that she's a woman"
    },
    {
      "id": 17,
      "start": 1272.9600143432617,
      "end": 1276.9600143432617,
      "text": " of Samaria and that the Jews and the Samaritans, they have no dealings one with another."
    },
    {
      "id": 18,
      "start": 1276.9600143432617,
      "end": 1283.8400115966797,
      "text": " There was great prejudice and there was great length of effort that would go forth by a"
    },
    {
      "id": 19,
      "start": 1284.0800170898438,
      "end": 1289.8400115966797,
      "text": " Jewish person to avoid Samaria, to avoid this region, to go around this region."
    },
    {
      "id": 20,
      "start": 1289.8400115966797,
      "end": 1295.000015258789,
      "text": " There was no dealings with one another, but Jesus, the Bible says He must needs go through"
    },
    {
      "id": 21,
      "start": 1295.000015258789,
      "end": 1296.000015258789,
      "text": " Samaria."
    },
    {
      "id": 22,
      "start": 1296.000015258789,
      "end": 1301.120018005371,
      "text": " And we find that when He says to her, if thou knewest the gift of God, notice in verse number"
    },
    {
      "id": 23,
      "start": 1301.120018005371,
      "end": 1306.2000122070312,
      "text": " 10 again, and who it is that saith to thee, give me to drink, thou wouldest have asked"
    },
    {
      "id": 24,
      "start": 1306.2000122070312,
      "end": 1307.4400177001953,
      "text": " of Him."
    },
    {
      "id": 25,
      "start": 1307.4400177001953,
      "end": 1308.8000183105469,
      "text": " And what does it say?"
    },
    {
      "id": 26,
      "start": 1308.8000183105469,
      "end": 1314.120018005371,
      "text": " And He would have given thee living water."
    },
    {
      "id": 27,
      "start": 1314.120018005371,
      "end": 1318.7200164794922,
      "text": " It's not that you ask and He says, I'm sorry, it's not for you."
    },
    {
      "id": 28,
      "start": 1318.7200164794922,
      "end": 1322.0400161743164,
      "text": " That'd be tragic."
    },
    {
      "id": 29,
      "start": 1322.0400161743164,
      "end": 1324.2600173950195,
      "text": " But the gift is available."
    },
    {
      "id": 30,
      "start": 1324.2600173950195,
      "end": 1326.880012512207,
      "text": " The gift is available to all people."
    },
    {
      "id": 31,
      "start": 1326.880012512207,
      "end": 1328.6000137329102,
      "text": " And for that, we rejoice."
    },
    {
      "id": 32,
      "start": 1328.6000137329102,
      "end": 1333.6400146484375,
      "text": " This gift that we're speaking of this morning, you understand that you cannot buy this gift."
    },
    {
      "id": 33,
      "start": 1333.6400146484375,
      "end": 1336.6400146484375,
      "text": " There's no place that you can go to buy this gift."
    },
    {
      "id": 34,
      "start": 1336.6400146484375,
      "end": 1337.9200134277344,
      "text": " There's no work that you can do."
    },
    {
      "id": 35,
      "start": 1337.9200134277344,
      "end": 1339.5600128173828,
      "text": " There's no sum of money that you can give."
    },
    {
      "id": 36,
      "start": 1339.5600128173828,
      "end": 1343.6800079345703,
      "text": " There's nothing that you can do to earn this gift."
    },
    {
      "id": 37,
      "start": 1343.6800079345703,
      "end": 1344.7200164794922,
      "text": " You can't buy it."
    },
    {
      "id": 38,
      "start": 1344.7200164794922,
      "end": 1346.4400177001953,
      "text": " You can't earn it."
    },
    {
      "id": 39,
      "start": 1346.4400177001953,
      "end": 1349.000015258789,
      "text": " You can't work for it."
    },
    {
      "id": 40,
      "start": 1349.000015258789,
      "end": 1350.000015258789,
      "text": " There's just nothing."
    },
    {
      "id": 41,
      "start": 1350.000015258789,
      "end": 1353.5600128173828,
      "text": " You must simply receive this gift."
    },
    {
      "id": 42,
      "start": 1353.5600128173828,
      "end": 1361.3600158691406,
      "text": " In fact, many today in our society have been led astray into thinking by many of the world"
    },
    {
      "id": 43,
      "start": 1361.3600158691406,
      "end": 1365.0800170898438,
      "text": " religions that you can work your way to heaven."
    },
    {
      "id": 44,
      "start": 1365.0800170898438,
      "end": 1371.0400085449219,
      "text": " In fact, many of the world religions today would teach that you just need to do certain"
    },
    {
      "id": 45,
      "start": 1371.0400085449219,
      "end": 1376.9200134277344,
      "text": " works and do certain things, and by that you will earn your salvation."
    },
    {
      "id": 46,
      "start": 1376.9200134277344,
      "end": 1382.2400207519531,
      "text": " In fact, as we interact with people, as we go throughout our days, our weeks, and we"
    },
    {
      "id": 47,
      "start": 1382.2400207519531,
      "end": 1385.9600219726562,
      "text": " speak to people about the Lord, and we are to ask people, I've done this on a number"
    },
    {
      "id": 48,
      "start": 1385.9600219726562,
      "end": 1390.5600128173828,
      "text": " of occasions in my life, when I've said to someone, sir, ma'am, are you sure of heaven?"
    },
    {
      "id": 49,
      "start": 1390.5600128173828,
      "end": 1394.8800201416016,
      "text": " If you were to die today, would you go to heaven?"
    },
    {
      "id": 50,
      "start": 1394.8800201416016,
      "end": 1397.000015258789,
      "text": " Sometimes people would say, no way."
    },
    {
      "id": 51,
      "start": 1397.000015258789,
      "end": 1401.4400177001953,
      "text": " Other times people say, absolutely, I've trust that Christ is my Savior."
    },
    {
      "id": 52,
      "start": 1401.4400177001953,
      "end": 1404.2400207519531,
      "text": " Many times, however, people say, I hope so."
    },
    {
      "id": 53,
      "start": 1404.2400207519531,
      "end": 1405.2400207519531,
      "text": " I want to."
    },
    {
      "id": 54,
      "start": 1405.2400207519531,
      "end": 1407.9200134277344,
      "text": " What are you basing it on?"
    },
    {
      "id": 55,
      "start": 1407.9200134277344,
      "end": 1410.6800079345703,
      "text": " Well, I'm being the best person I can be."
    },
    {
      "id": 56,
      "start": 1410.6800079345703,
      "end": 1412.3200073242188,
      "text": " I'm doing the best I can do."
    },
    {
      "id": 57,
      "start": 1412.3200073242188,
      "end": 1415.3600158691406,
      "text": " Can I tell you, that's not good enough."
    },
    {
      "id": 58,
      "start": 1415.3600158691406,
      "end": 1420.0800170898438,
      "text": " Again, I referenced Isaiah earlier, but all of our good works are as filthy rags as what"
    },
    {
      "id": 59,
      "start": 1420.0800170898438,
      "end": 1421.9600219726562,
      "text": " Isaiah says."
    },
    {
      "id": 60,
      "start": 1421.9600219726562,
      "end": 1427.52001953125,
      "text": " In Romans chapter number four, the Bible speaks to us about this very truth with regard to"
    },
    {
      "id": 61,
      "start": 1427.52001953125,
      "end": 1430.9600219726562,
      "text": " this gift, and I'm so thankful that it's a gift."
    },
    {
      "id": 62,
      "start": 1430.9600219726562,
      "end": 1432.4800109863281,
      "text": " I cannot work for it."
    },
    {
      "id": 63,
      "start": 1432.4800109863281,
      "end": 1433.8800201416016,
      "text": " I cannot earn it."
    },
    {
      "id": 64,
      "start": 1433.8800201416016,
      "end": 1437.000015258789,
      "text": " I must simply receive it."
    },
    {
      "id": 65,
      "start": 1437.000015258789,
      "end": 1442.1600189208984,
      "text": " It says, what shall we say then that Abraham, our father, as pertaining to the flesh, hath"
    },
    {
      "id": 66,
      "start": 1442.1600189208984,
      "end": 1443.1600189208984,
      "text": " found?"
    },
    {
      "id": 67,
      "start": 1443.1600189208984,
      "end": 1450.2400207519531,
      "text": " For if Abraham were justified by works, he hath whereof to glory, but not before God."
    },
    {
      "id": 68,
      "start": 1450.2400207519531,
      "end": 1454.8400115966797,
      "text": " If you think about this truth in verse number two, when it says, he hath whereof to glory,"
    },
    {
      "id": 69,
      "start": 1454.8400115966797,
      "end": 1458.4000091552734,
      "text": " remember the truth of Ephesians 2, 8, 9, for by grace are you saved through faith, and"
    },
    {
      "id": 70,
      "start": 1458.4000091552734,
      "end": 1464.6400146484375,
      "text": " that not of yourselves is the gift of God, not of works, lest any man should boast."
    },
    {
      "id": 71,
      "start": 1464.6400146484375,
      "end": 1469.760009765625,
      "text": " If we could work our way to heaven, then it would give us reason to glory, reason to boast."
    },
    {
      "id": 72,
      "start": 1469.760009765625,
      "end": 1474.6000061035156,
      "text": " But God says no, what saith the Scripture in verse number three, for what saith the"
    },
    {
      "id": 73,
      "start": 1474.6000061035156,
      "end": 1479.8400268554688,
      "text": " Scripture, Abraham believed God, and it was counted unto him for righteousness."
    },
    {
      "id": 74,
      "start": 1479.8400268554688,
      "end": 1485.1600036621094,
      "text": " Now to him that worketh is the reward not reckoned of grace, but of debt, but our God"
    },
    {
      "id": 75,
      "start": 1485.1600036621094,
      "end": 1487.4400024414062,
      "text": " is a debtor to no man."
    },
    {
      "id": 76,
      "start": 1487.4400024414062,
      "end": 1488.6000061035156,
      "text": " Amen?"
    },
    {
      "id": 77,
      "start": 1488.6000061035156,
      "end": 1490.8800048828125,
      "text": " We cannot earn this gift."
    },
    {
      "id": 78,
      "start": 1490.8800048828125,
      "end": 1493.6800231933594,
      "text": " We must simply receive this gift."
    },
    {
      "id": 79,
      "start": 1493.6800231933594,
      "end": 1499.3200073242188,
      "text": " So this morning, I would simply ask this question as we consider His gift to me, have you received"
    },
    {
      "id": 80,
      "start": 1499.3200073242188,
      "end": 1500.8800048828125,
      "text": " the gift?"
    },
    {
      "id": 81,
      "start": 1500.8800048828125,
      "end": 1506.280029296875,
      "text": " Have you personally understood that you are a sinner and that Christ is the only Savior?"
    },
    {
      "id": 82,
      "start": 1506.280029296875,
      "end": 1510.8000183105469,
      "text": " Have you understood this truth that is being revealed to us this morning through John 4,"
    },
    {
      "id": 83,
      "start": 1510.8000183105469,
      "end": 1517.4000244140625,
      "text": " that God has a gift for us and that this gift is eternal life through Jesus Christ our Lord."
    },
    {
      "id": 84,
      "start": 1517.4000244140625,
      "end": 1521.1600036621094,
      "text": " It's a precious gift that was paid for with His blood."
    },
    {
      "id": 85,
      "start": 1521.1600036621094,
      "end": 1522.8800048828125,
      "text": " There's nothing you can do to earn it."
    },
    {
      "id": 86,
      "start": 1522.8800048828125,
      "end": 1524.9000244140625,
      "text": " It's available to all people."
    },
    {
      "id": 87,
      "start": 1524.9000244140625,
      "end": 1527.280029296875,
      "text": " You must simply receive it."
    },
    {
      "id": 88,
      "start": 1527.280029296875,
      "end": 1530.9600219726562,
      "text": " The question this morning is, have you received the gift of God?"
    },
    {
      "id": 89,
      "start": 1530.9600219726562,
      "end": 1532.1600036621094,
      "text": " Have you been born again?"
    },
    {
      "id": 90,
      "start": 1532.1600036621094,
      "end": 1534.52001953125,
      "text": " Have you trusted Christ as your Savior?"
    },
    {
      "id": 91,
      "start": 1534.52001953125,
      "end": 1535.52001953125,
      "text": " Can I tell you this?"
    },
    {
      "id": 92,
      "start": 1535.52001953125,
      "end": 1537.6400146484375,
      "text": " He won't force you to receive the gift."
    },
    {
      "id": 93,
      "start": 1537.6400146484375,
      "end": 1542.6000061035156,
      "text": " In fact, you can reject the gift."
    },
    {
      "id": 94,
      "start": 1542.6000061035156,
      "end": 1547.8400268554688,
      "text": " I used to be able to say that I've never had anyone reject a gift that I tried to give"
    },
    {
      "id": 95,
      "start": 1547.8400268554688,
      "end": 1554.0800170898438,
      "text": " them, but just recently I had someone reject a gift."
    },
    {
      "id": 96,
      "start": 1554.0800170898438,
      "end": 1559.0800170898438,
      "text": " And you wouldn't know who they are, and it was just a token of appreciation."
    },
    {
      "id": 97,
      "start": 1559.0800170898438,
      "end": 1564.280029296875,
      "text": " I was trying to be a kind individual, and I extended a gift to someone, and it really"
    },
    {
      "id": 98,
      "start": 1564.280029296875,
      "end": 1567.4000244140625,
      "text": " wasn't anything of any great monetary value."
    },
    {
      "id": 99,
      "start": 1567.4000244140625,
      "end": 1572.280029296875,
      "text": " It was just a small token of appreciation."
    },
    {
      "id": 100,
      "start": 1572.280029296875,
      "end": 1575.6800231933594,
      "text": " Within just a few minutes, the person said, I don't want this."
    },
    {
      "id": 101,
      "start": 1575.6800231933594,
      "end": 1577.3600158691406,
      "text": " I can't take this."
    },
    {
      "id": 102,
      "start": 1577.3600158691406,
      "end": 1581.280029296875,
      "text": " And they gave it back to me."
    },
    {
      "id": 103,
      "start": 1581.280029296875,
      "end": 1584.8800048828125,
      "text": " Until that event, just recently, I'd never had anyone reject a gift that I tried to give"
    },
    {
      "id": 104,
      "start": 1584.8800048828125,
      "end": 1585.8800048828125,
      "text": " them."
    },
    {
      "id": 105,
      "start": 1585.8800048828125,
      "end": 1589.760009765625,
      "text": " It's pretty customary that we receive a gift."
    },
    {
      "id": 106,
      "start": 1589.760009765625,
      "end": 1591.4400024414062,
      "text": " And God says, I have a gift for you."
    },
    {
      "id": 107,
      "start": 1591.4400024414062,
      "end": 1593.5600280761719,
      "text": " Will you receive it?"
    },
    {
      "id": 108,
      "start": 1593.5600280761719,
      "end": 1595.3200073242188,
      "text": " Or will you reject it?"
    },
    {
      "id": 109,
      "start": 1595.3200073242188,
      "end": 1599.7000122070312,
      "text": " Now this morning, I know that I'm talking to many that have already received the gift."
    },
    {
      "id": 110,
      "start": 1599.7000122070312,
      "end": 1605.280029296875,
      "text": " And we know this gift of God that is spoken of in John chapter number 4."
    },
    {
      "id": 111,
      "start": 1605.280029296875,
      "end": 1609.8800048828125,
      "text": " And this morning when we speak about this idea when he says, if thou knewest the gift"
    },
    {
      "id": 112,
      "start": 1609.8800048828125,
      "end": 1615.4000244140625,
      "text": " of God and I consider his gift to me, I want you to consider number 2 this morning, I"
    },
    {
      "id": 113,
      "start": 1615.4000244140625,
      "end": 1619.8800048828125,
      "text": " want you to consider my gift to him."
    },
    {
      "id": 114,
      "start": 1619.8800048828125,
      "end": 1621.6000061035156,
      "text": " What's my gift to him?"
    },
    {
      "id": 115,
      "start": 1621.6000061035156,
      "end": 1629.3600158691406,
      "text": " And understand, when I deal with this truth this morning, my gift to him is not to try"
    },
    {
      "id": 116,
      "start": 1629.3600158691406,
      "end": 1633.0,
      "text": " to get his gift to me."
    },
    {
      "id": 117,
      "start": 1633.0,
      "end": 1638.2400207519531,
      "text": " My gift to him is not to try to keep his gift that he's given me."
    },
    {
      "id": 118,
      "start": 1638.2400207519531,
      "end": 1643.1200256347656,
      "text": " My gift to him is out of gratitude for what he's done for me."
    },
    {
      "id": 119,
      "start": 1643.1200256347656,
      "end": 1647.280029296875,
      "text": " And we understand that as we go through the Scriptures that there is a response that we"
    },
    {
      "id": 120,
      "start": 1647.280029296875,
      "end": 1652.6400146484375,
      "text": " find littered throughout the New Testament, the Old Testament as well, how that the people"
    },
    {
      "id": 121,
      "start": 1652.6400146484375,
      "end": 1658.8000183105469,
      "text": " of God as they've received this gift, how they respond by thanking God, by praising"
    },
    {
      "id": 122,
      "start": 1658.8000183105469,
      "end": 1663.280029296875,
      "text": " God, by living for God, because they understand this gift."
    },
    {
      "id": 123,
      "start": 1663.280029296875,
      "end": 1665.7200012207031,
      "text": " I've said this before from this pulpit."
    },
    {
      "id": 124,
      "start": 1665.7200012207031,
      "end": 1670.4800109863281,
      "text": " The reality is that if we could lose the gift, if we could lose the salvation, we would"
    },
    {
      "id": 125,
      "start": 1670.4800109863281,
      "end": 1675.6800231933594,
      "text": " have lost it the day we got it."
    },
    {
      "id": 126,
      "start": 1675.6800231933594,
      "end": 1680.0400085449219,
      "text": " I know, there's no way I can keep it the same way I can't earn it."
    },
    {
      "id": 127,
      "start": 1680.0400085449219,
      "end": 1681.0400085449219,
      "text": " Amen?"
    },
    {
      "id": 128,
      "start": 1681.0400085449219,
      "end": 1685.0400085449219,
      "text": " I'm kept by the power of God."
    },
    {
      "id": 129,
      "start": 1685.0400085449219,
      "end": 1687.52001953125,
      "text": " But what's my gift back to him?"
    },
    {
      "id": 130,
      "start": 1687.52001953125,
      "end": 1690.8400268554688,
      "text": " Number 1, I would say this, it's my praise."
    },
    {
      "id": 131,
      "start": 1690.8400268554688,
      "end": 1692.0400085449219,
      "text": " My praise."
    },
    {
      "id": 132,
      "start": 1692.0400085449219,
      "end": 1694.4000244140625,
      "text": " Is he not worthy of our praise?"
    },
    {
      "id": 133,
      "start": 1694.4000244140625,
      "end": 1699.4400024414062,
      "text": " When we understand the gift that he's given to us, when we understand this gift of God,"
    },
    {
      "id": 134,
      "start": 1699.4400024414062,
      "end": 1703.6800231933594,
      "text": " which is eternal life, we ought to lift our voice and praise him and thank him."
    },
    {
      "id": 135,
      "start": 1703.6800231933594,
      "end": 1708.4800109863281,
      "text": " 2 Corinthians 9 and verse 15 said, but thanks be to God for his unspeakable gift."
    },
    {
      "id": 136,
      "start": 1708.4800109863281,
      "end": 1710.760009765625,
      "text": " I'm thanking him and I'm praising him."
    },
    {
      "id": 137,
      "start": 1710.760009765625,
      "end": 1711.760009765625,
      "text": " Why?"
    },
    {
      "id": 138,
      "start": 1711.760009765625,
      "end": 1714.2400207519531,
      "text": " Because I understand that he's given me this gift."
    },
    {
      "id": 139,
      "start": 1714.2400207519531,
      "end": 1720.4400024414062,
      "text": " I couldn't earn it, I couldn't work for it, I'm without hope, I'm dead in my sins and"
    },
    {
      "id": 140,
      "start": 1720.4400024414062,
      "end": 1721.4400024414062,
      "text": " my trespasses."
    },
    {
      "id": 141,
      "start": 1721.4800415039062,
      "end": 1727.4800415039062,
      "text": " I am hopeless and I am helpless, but God in his grace and his mercy, he says, I have a"
    },
    {
      "id": 142,
      "start": 1727.4800415039062,
      "end": 1729.4000244140625,
      "text": " gift for you."
    },
    {
      "id": 143,
      "start": 1729.4000244140625,
      "end": 1730.6000366210938,
      "text": " And what's my gift back to him?"
    },
    {
      "id": 144,
      "start": 1730.6000366210938,
      "end": 1731.6000366210938,
      "text": " I praise him."
    },
    {
      "id": 145,
      "start": 1731.6000366210938,
      "end": 1733.1600341796875,
      "text": " I praise him."
    },
    {
      "id": 146,
      "start": 1733.1600341796875,
      "end": 1734.1600341796875,
      "text": " Consider Hebrews 13."
    },
    {
      "id": 147,
      "start": 1734.1600341796875,
      "end": 1740.2000122070312,
      "text": " Turn over there if you will and consider Hebrews 13 and what the word of God says with regard"
    },
    {
      "id": 148,
      "start": 1740.2000122070312,
      "end": 1743.0400390625,
      "text": " to our praise for our God."
    },
    {
      "id": 149,
      "start": 1743.0400390625,
      "end": 1747.9600219726562,
      "text": " We of course could go to the book of Psalms and we could read many passages of Scripture"
    },
    {
      "id": 150,
      "start": 1747.9600219726562,
      "end": 1751.9600219726562,
      "text": " in the book of Psalms with regard to our praise and lifting our voice and praising"
    },
    {
      "id": 151,
      "start": 1751.9600219726562,
      "end": 1755.7999877929688,
      "text": " our God and the fact that he is worthy of our praise."
    },
    {
      "id": 152,
      "start": 1755.7999877929688,
      "end": 1761.4400024414062,
      "text": " And here in Hebrews 13 and verse number 15, the Bible speaks here about the praise of"
    },
    {
      "id": 153,
      "start": 1761.4400024414062,
      "end": 1762.4400024414062,
      "text": " his people."
    },
    {
      "id": 154,
      "start": 1762.4400024414062,
      "end": 1768.760009765625,
      "text": " By him, therefore, let us offer the sacrifice of praise to God."
    },
    {
      "id": 155,
      "start": 1768.760009765625,
      "end": 1770.5599975585938,
      "text": " How often?"
    },
    {
      "id": 156,
      "start": 1770.5599975585938,
      "end": 1772.1600341796875,
      "text": " Continually."
    },
    {
      "id": 157,
      "start": 1772.1600341796875,
      "end": 1779.0,
      "text": " That is the fruit of our lips giving thanks to his name."
    },
    {
      "id": 158,
      "start": 1779.0,
      "end": 1780.6799926757812,
      "text": " He is worthy of our praise."
    },
    {
      "id": 159,
      "start": 1780.6799926757812,
      "end": 1787.3599853515625,
      "text": " And this morning, when I praise my God, I'm lifting him up, I'm exalting him, I'm magnifying"
    },
    {
      "id": 160,
      "start": 1787.3599853515625,
      "end": 1788.3599853515625,
      "text": " him."
    },
    {
      "id": 161,
      "start": 1788.3599853515625,
      "end": 1789.4800415039062,
      "text": " Let God be magnified."
    },
    {
      "id": 162,
      "start": 1789.4800415039062,
      "end": 1791.1600341796875,
      "text": " Let God be exalted."
    },
    {
      "id": 163,
      "start": 1791.1600341796875,
      "end": 1793.52001953125,
      "text": " And I'm speaking about his gift."
    },
    {
      "id": 164,
      "start": 1793.52001953125,
      "end": 1799.52001953125,
      "text": " Remember there's not a place for us to glory or for us to boast because it's not by works,"
    },
    {
      "id": 165,
      "start": 1799.52001953125,
      "end": 1801.6600341796875,
      "text": " it's not by our merit."
    },
    {
      "id": 166,
      "start": 1801.6600341796875,
      "end": 1802.9400024414062,
      "text": " It's all because of his glory."
    },
    {
      "id": 0,
      "start": 1802.9400024414062,
      "end": 1807.6200022697449,
      "text": " grace and His mercy, and so therefore He alone is the one that receives the glory."
    },
    {
      "id": 1,
      "start": 1807.6200022697449,
      "end": 1812.240002632141,
      "text": " He alone is the one that receives the praise. When someone were to ask me the"
    },
    {
      "id": 2,
      "start": 1812.240002632141,
      "end": 1816.4200019836426,
      "text": " question, are you sure of heaven, it's not in any glory in myself that I say, yep, I"
    },
    {
      "id": 3,
      "start": 1816.4200019836426,
      "end": 1819.900001525879,
      "text": " know I'm going to heaven because I've done this and I'm this and so on and so"
    },
    {
      "id": 4,
      "start": 1819.900001525879,
      "end": 1824.1000022888184,
      "text": " forth. No, I know I'm going to heaven because Jesus Christ died for me. He"
    },
    {
      "id": 5,
      "start": 1824.1000022888184,
      "end": 1829.3000030517578,
      "text": " paid my debt. He was buried and He rose again. He conquered sin, death, and the"
    },
    {
      "id": 6,
      "start": 1829.3000030517578,
      "end": 1834.700002670288,
      "text": " grave, and He saved my soul, and I want to praise Him. I want to lift up my voice"
    },
    {
      "id": 7,
      "start": 1834.700002670288,
      "end": 1842.7800025939941,
      "text": " and give thanks to God for His gift. Is it not customary in our society to thank"
    },
    {
      "id": 8,
      "start": 1842.7800025939941,
      "end": 1853.0000038146973,
      "text": " people for gifts? You receive a gift, someone says thank you, right? Sometimes"
    },
    {
      "id": 9,
      "start": 1853.0000038146973,
      "end": 1858.7400016784668,
      "text": " we give a gift to someone and we receive a thank-you card. Do you give a thank-you"
    },
    {
      "id": 10,
      "start": 1858.7800025939941,
      "end": 1864.5400009155273,
      "text": " card for the thank-you card? I mean, no, it's not customary, but you understand"
    },
    {
      "id": 11,
      "start": 1864.5400009155273,
      "end": 1870.7000045776367,
      "text": " what I'm saying, right? We understand what it is to express gratitude for a gift."
    },
    {
      "id": 12,
      "start": 1870.7000045776367,
      "end": 1877.900001525879,
      "text": " Well, if this greatest gift, this gift of God, which is eternal life, has been"
    },
    {
      "id": 13,
      "start": 1877.900001525879,
      "end": 1882.9800033569336,
      "text": " freely given to us and we've understood, listen, I'm thankful that I do not live"
    },
    {
      "id": 14,
      "start": 1882.9800033569336,
      "end": 1886.7000045776367,
      "text": " in a place, I'm thankful that I've been exposed to the truth of the gospel, that"
    },
    {
      "id": 15,
      "start": 1886.7000045776367,
      "end": 1890.740005493164,
      "text": " I know the gift of God, and for you this morning that are under the sound of my"
    },
    {
      "id": 16,
      "start": 1890.740005493164,
      "end": 1894.3800048828125,
      "text": " voice, whether you're here locally or you're watching via live stream, you now"
    },
    {
      "id": 17,
      "start": 1894.3800048828125,
      "end": 1899.7799987792969,
      "text": " know the gift of God is eternal life through Jesus Christ our Lord. You may"
    },
    {
      "id": 18,
      "start": 1899.7799987792969,
      "end": 1903.7799987792969,
      "text": " have entered into this building, you may have clicked on that link on the"
    },
    {
      "id": 19,
      "start": 1903.7799987792969,
      "end": 1908.020004272461,
      "text": " internet, and you may not have known what the gift of God is in this"
    },
    {
      "id": 20,
      "start": 1908.020004272461,
      "end": 1914.740005493164,
      "text": " sense, and understanding what the Scripture said, but now you know. And as"
    },
    {
      "id": 21,
      "start": 1914.740005493164,
      "end": 1918.5800018310547,
      "text": " we receive that gift and we say, I no longer I'm gonna try to work for this"
    },
    {
      "id": 22,
      "start": 1918.5800018310547,
      "end": 1924.0600051879883,
      "text": " thing because I understand that I can't, He gives us a rest in our salvation, and"
    },
    {
      "id": 23,
      "start": 1924.0600051879883,
      "end": 1929.3400039672852,
      "text": " it's a blessed thing, and we ought to lift our voice and praise Him. And as we"
    },
    {
      "id": 24,
      "start": 1929.3400039672852,
      "end": 1933.4600067138672,
      "text": " praise Him and as we lift Him up and exalt Him and we speak of our Savior,"
    },
    {
      "id": 25,
      "start": 1933.4600067138672,
      "end": 1939.1800079345703,
      "text": " we're influencing others. Let me say this, not only my gift to Him is my praise, but"
    },
    {
      "id": 26,
      "start": 1939.1800079345703,
      "end": 1946.1399993896484,
      "text": " it's my life. It's my life. I'm mindful of the truth of Romans 12, and it's a"
    },
    {
      "id": 27,
      "start": 1946.1399993896484,
      "end": 1949.9400024414062,
      "text": " familiar verse of Scripture, really two verses of Scripture, Romans 12 verses 1"
    },
    {
      "id": 28,
      "start": 1949.9400024414062,
      "end": 1953.979995727539,
      "text": " and 2. Many of us are familiar with this passage of Scripture. If you were to take"
    },
    {
      "id": 29,
      "start": 1953.979995727539,
      "end": 1958.3800048828125,
      "text": " the whole of the book of Romans and really just divide it up into a few"
    },
    {
      "id": 30,
      "start": 1958.3800048828125,
      "end": 1963.6600036621094,
      "text": " sections and understand the indictment against mankind that all have sinned and"
    },
    {
      "id": 31,
      "start": 1963.6600036621094,
      "end": 1969.1000061035156,
      "text": " come short of the glory of God. There's none righteous, no not one. We find"
    },
    {
      "id": 32,
      "start": 1969.1000061035156,
      "end": 1973.0599975585938,
      "text": " those truths in the book of Romans in the third chapter. If you're to look in"
    },
    {
      "id": 33,
      "start": 1973.0599975585938,
      "end": 1978.1000061035156,
      "text": " the fifth chapter and understand that sin entered into this world by one man,"
    },
    {
      "id": 34,
      "start": 1978.1000061035156,
      "end": 1983.260009765625,
      "text": " by Adam, and sin has passed upon all men, death has passed upon all men, excuse me,"
    },
    {
      "id": 35,
      "start": 1983.260009765625,
      "end": 1989.979995727539,
      "text": " for all have sinned. We look at the truth of Romans 5 that by one man's"
    },
    {
      "id": 36,
      "start": 1989.979995727539,
      "end": 1994.979995727539,
      "text": " transgression all have been influenced, but by the gift of one, speaking of the"
    },
    {
      "id": 37,
      "start": 1995.8200073242188,
      "end": 2000.9400024414062,
      "text": " price that was paid on the cross of Calvary by the Lord Jesus Christ, all men"
    },
    {
      "id": 38,
      "start": 2000.9400024414062,
      "end": 2006.6999969482422,
      "text": " now freely can receive this gift. Romans 6, we looked at verse 23 earlier, the"
    },
    {
      "id": 39,
      "start": 2006.6999969482422,
      "end": 2011.5400085449219,
      "text": " wages of sin is death, the gift of God is eternal life. Romans 10, for whosoever"
    },
    {
      "id": 40,
      "start": 2011.5400085449219,
      "end": 2016.5800018310547,
      "text": " shall call upon the name of the Lord shall be saved. So we understand our"
    },
    {
      "id": 41,
      "start": 2016.5800018310547,
      "end": 2019.9400024414062,
      "text": " condition that we were hopeless and helpless for all have sinned and come"
    },
    {
      "id": 42,
      "start": 2019.9400024414062,
      "end": 2023.740005493164,
      "text": " short of the glory of God. There's none righteous, no not one, but we understand"
    },
    {
      "id": 43,
      "start": 2023.740005493164,
      "end": 2027.8600006103516,
      "text": " that Jesus died for us and he paid the price for us so that we could have"
    },
    {
      "id": 44,
      "start": 2027.8600006103516,
      "end": 2032.5400085449219,
      "text": " eternal life. We've accepted him, we've called upon him, we've received this"
    },
    {
      "id": 45,
      "start": 2032.5400085449219,
      "end": 2037.6600036621094,
      "text": " gift, and now we come to Romans 12 and Paul says, I beseech you therefore,"
    },
    {
      "id": 46,
      "start": 2037.6600036621094,
      "end": 2044.260009765625,
      "text": " brethren, by the mercies of God, that you present your bodies a living sacrifice,"
    },
    {
      "id": 47,
      "start": 2044.260009765625,
      "end": 2050.779998779297,
      "text": " wholly acceptable unto God, which is your reasonable service. Be not conformed to"
    },
    {
      "id": 48,
      "start": 2050.779998779297,
      "end": 2054.5,
      "text": " this world, but be transformed by the renewing of your mind, that you may"
    },
    {
      "id": 49,
      "start": 2054.5,
      "end": 2060.6199951171875,
      "text": " prove what is that good and acceptable and perfect will of God. I said often a"
    },
    {
      "id": 50,
      "start": 2060.6199951171875,
      "end": 2064.1400146484375,
      "text": " couple of years ago we preached through the book of Ephesians on Sunday morning."
    },
    {
      "id": 51,
      "start": 2064.1400146484375,
      "end": 2070.5,
      "text": " The theme is somewhat evident in the book of Colossians as well. We speak"
    },
    {
      "id": 52,
      "start": 2070.5,
      "end": 2074.1799926757812,
      "text": " about in the book of Ephesians, there's very clear distinction in that book"
    },
    {
      "id": 53,
      "start": 2074.1799926757812,
      "end": 2078.5,
      "text": " between the first section and the second section. In the first section of the book"
    },
    {
      "id": 54,
      "start": 2078.5,
      "end": 2083.8200073242188,
      "text": " of Ephesians, it specifically is dealing with our standing before God, the fact"
    },
    {
      "id": 55,
      "start": 2083.8200073242188,
      "end": 2086.7000122070312,
      "text": " that we've been saved, that we've received this gift that I'm speaking of"
    },
    {
      "id": 56,
      "start": 2086.7000122070312,
      "end": 2092.8200073242188,
      "text": " this morning. The second section of the book of Ephesians clearly deals with our"
    },
    {
      "id": 57,
      "start": 2092.8200073242188,
      "end": 2101.3800048828125,
      "text": " service for our Lord. Because I'm saved, I walk in wisdom, I walk in truth, and all"
    },
    {
      "id": 58,
      "start": 2101.3800048828125,
      "end": 2105.220001220703,
      "text": " of these truths that are given to us at the latter part of the book of"
    },
    {
      "id": 59,
      "start": 2105.220001220703,
      "end": 2111.260009765625,
      "text": " Ephesians. And we understand, and I said this often, that I do not, that the truth"
    },
    {
      "id": 60,
      "start": 2111.260009765625,
      "end": 2116.9400024414062,
      "text": " of Ephesians is not that Paul is saying, walk in wisdom or walk worthy so that"
    },
    {
      "id": 61,
      "start": 2116.9400024414062,
      "end": 2121.1799926757812,
      "text": " you can get saved or so that you can stay saved. No, the matter of salvation"
    },
    {
      "id": 62,
      "start": 2121.1799926757812,
      "end": 2127.9400024414062,
      "text": " has already been established. Our standing is already sure, and because of"
    },
    {
      "id": 63,
      "start": 2127.9400024414062,
      "end": 2135.8999938964844,
      "text": " that, I now serve my God. I offer to him my praise, but I offer to him my life."
    },
    {
      "id": 64,
      "start": 2135.8999938964844,
      "end": 2140.739990234375,
      "text": " Remember the truth. Turn over. I sign every card that I sign. 2 Corinthians"
    },
    {
      "id": 65,
      "start": 2140.739990234375,
      "end": 2145.5,
      "text": " chapter number 5, in verse number 15, if you've received a card, a letter, an email"
    },
    {
      "id": 66,
      "start": 2145.5,
      "end": 2150.5,
      "text": " from me, you see 2 Corinthians 5.15 in my signature every time I write"
    },
    {
      "id": 67,
      "start": 2150.5,
      "end": 2156.3399963378906,
      "text": " something. And in 2 Corinthians chapter number 5, in verse number 14, the Bible"
    },
    {
      "id": 68,
      "start": 2156.3399963378906,
      "end": 2159.7000122070312,
      "text": " says that the love of Christ constraineth us, because we thus judge"
    },
    {
      "id": 69,
      "start": 2159.7000122070312,
      "end": 2164.8600158691406,
      "text": " that if one died for all, then we're all dead. And notice verse number 15, in that"
    },
    {
      "id": 70,
      "start": 2164.8600158691406,
      "end": 2171.3399963378906,
      "text": " he died for all. Remember, we said the gift is available. It's available to all."
    },
    {
      "id": 71,
      "start": 2171.3399963378906,
      "end": 2177.2999877929688,
      "text": " He died for all, that they which live, I've been saved, I've been born again, it"
    },
    {
      "id": 72,
      "start": 2177.2999877929688,
      "end": 2182.7000122070312,
      "text": " says that they which live should not henceforth live unto themselves, but unto"
    },
    {
      "id": 73,
      "start": 2182.7000122070312,
      "end": 2188.7000122070312,
      "text": " him which died for them and rose again. We sing the song, Living for Jesus. You"
    },
    {
      "id": 74,
      "start": 2188.7000122070312,
      "end": 2194.260009765625,
      "text": " know, if you're not saved, you can't live for Jesus. You can't. But because I've"
    },
    {
      "id": 75,
      "start": 2194.260009765625,
      "end": 2199.220001220703,
      "text": " been saved, I want to offer him my life. Paul says, this is your reasonable service,"
    },
    {
      "id": 76,
      "start": 2199.220001220703,
      "end": 2204.0599975585938,
      "text": " that we present our bodies a living sacrifice. Again, it's not so that we can"
    },
    {
      "id": 77,
      "start": 2204.0599975585938,
      "end": 2208.8200073242188,
      "text": " be saved, it's not so that we can stay saved, it's the result of us being saved"
    },
    {
      "id": 78,
      "start": 2208.980010986328,
      "end": 2214.779998779297,
      "text": " and understanding this gift that we have received. What glory, what blessing. I"
    },
    {
      "id": 79,
      "start": 2214.779998779297,
      "end": 2221.9400024414062,
      "text": " would say this as we turn back to John chapter number 4, nearing the end of the"
    },
    {
      "id": 80,
      "start": 2221.9400024414062,
      "end": 2226.8200073242188,
      "text": " thought this morning, and as we turn back to John chapter number 4, and I think"
    },
    {
      "id": 81,
      "start": 2226.8200073242188,
      "end": 2231.0599975585938,
      "text": " about my praise in my life, and I notice in this text of Scripture that both of"
    },
    {
      "id": 82,
      "start": 2231.0599975585938,
      "end": 2237.6199951171875,
      "text": " those things are evident in this life of this woman that is mentioned here by her"
    },
    {
      "id": 83,
      "start": 2237.7000122070312,
      "end": 2244.6600036621094,
      "text": " witness, when I know the gift of God, I must share this gift with others. When I"
    },
    {
      "id": 84,
      "start": 2244.6600036621094,
      "end": 2248.220001220703,
      "text": " truly understand, remember, he says in verse number 10, the beginning of their"
    },
    {
      "id": 85,
      "start": 2248.220001220703,
      "end": 2253.8200073242188,
      "text": " interaction, if thou knewest the gift of God. The reality is that at this point,"
    },
    {
      "id": 86,
      "start": 2253.8200073242188,
      "end": 2260.5,
      "text": " she didn't know the gift of God, correct? She didn't know it, but it's about to be"
    },
    {
      "id": 87,
      "start": 2260.5,
      "end": 2266.5,
      "text": " revealed to her. She didn't know what the gift was. He said, if you knew what it was,"
    },
    {
      "id": 88,
      "start": 2266.5,
      "end": 2270.7000122070312,
      "text": " you would have asked me, and I would have given to thee living water. The woman"
    },
    {
      "id": 89,
      "start": 2270.7000122070312,
      "end": 2275.8600158691406,
      "text": " saith, in verse number 11, Sir, thou hast nothing to draw with. The well is deep."
    },
    {
      "id": 90,
      "start": 2275.8600158691406,
      "end": 2281.6199951171875,
      "text": " From whence then hast thou that living water? And art thou greater than our"
    },
    {
      "id": 91,
      "start": 2281.6199951171875,
      "end": 2288.1000061035156,
      "text": " father Jacob? Yes, absolutely, he is God. Which gave us the well, and drank there"
    },
    {
      "id": 92,
      "start": 2288.1000061035156,
      "end": 2291.6199951171875,
      "text": " of himself, and his children, and his cattle. Jesus answered and said unto her,"
    },
    {
      "id": 93,
      "start": 2291.6199951171875,
      "end": 2295.980010986328,
      "text": " whosoever drinketh of this water shall thirst again. Did she understand that?"
    },
    {
      "id": 94,
      "start": 2295.980010986328,
      "end": 2300.4200134277344,
      "text": " Yeah, that's why she was there that day. She needed more water. Notice verse"
    },
    {
      "id": 95,
      "start": 2300.4200134277344,
      "end": 2306.019989013672,
      "text": " number 14, but whosoever drinketh of the water that I shall give him shall never"
    },
    {
      "id": 96,
      "start": 2306.019989013672,
      "end": 2310.1400146484375,
      "text": " thirst, but the water that I shall give him shall be in him a well of water"
    },
    {
      "id": 97,
      "start": 2310.1400146484375,
      "end": 2314.8600158691406,
      "text": " springing up into everlasting life. He's speaking about that living water that he"
    },
    {
      "id": 98,
      "start": 2314.8600158691406,
      "end": 2318.9000244140625,
      "text": " mentioned in verse number 10. He's speaking about salvation, and of course"
    },
    {
      "id": 99,
      "start": 2318.9000244140625,
      "end": 2324.3400268554688,
      "text": " her response immediately in verse number 15, Sir, give me this water that I thirst"
    },
    {
      "id": 100,
      "start": 2324.3400268554688,
      "end": 2329.0599975585938,
      "text": " not, neither come hither to draw. She didn't fully understand the gift yet. She"
    },
    {
      "id": 101,
      "start": 2329.0599975585938,
      "end": 2333.2999877929688,
      "text": " was still thinking on the natural plane. She was still thinking physically. She"
    },
    {
      "id": 102,
      "start": 2333.2999877929688,
      "end": 2338.5800170898438,
      "text": " was not understanding the spiritual truth that God was giving her, this gift"
    },
    {
      "id": 103,
      "start": 2338.5800170898438,
      "end": 2343.1400146484375,
      "text": " of God as eternal life, as we found in Romans 6, and she says, listen, I don't"
    },
    {
      "id": 104,
      "start": 2343.1400146484375,
      "end": 2346.97998046875,
      "text": " want to have to keep coming back to this well. She's thinking on that physical"
    },
    {
      "id": 105,
      "start": 2346.97998046875,
      "end": 2352.8200073242188,
      "text": " plane. Notice Jesus, in order to help her understand her sinful condition, her"
    },
    {
      "id": 106,
      "start": 2352.8200073242188,
      "end": 2357.5800170898438,
      "text": " need for this spiritual water, this living water that he's speaking of, he"
    },
    {
      "id": 107,
      "start": 2357.5800170898438,
      "end": 2361.4199829101562,
      "text": " says in verse number 16, go call thy husband and come hither. The woman"
    },
    {
      "id": 108,
      "start": 2361.4199829101562,
      "end": 2365.0800170898438,
      "text": " answered and said, I have no husband. Jesus said unto her, thou hast well said, I have"
    },
    {
      "id": 109,
      "start": 2365.0800170898438,
      "end": 2369.739990234375,
      "text": " no husband, for thou hast had five husbands, and he whom thou now hast is"
    },
    {
      "id": 110,
      "start": 2369.739990234375,
      "end": 2376.780029296875,
      "text": " not thy husband, and that sayest thou truly. Notice her response, Sir, I perceive"
    },
    {
      "id": 111,
      "start": 2376.8200073242188,
      "end": 2386.2200317382812,
      "text": " that thou art a prophet. He's greater than a prophet. He's God. He's God. She"
    },
    {
      "id": 112,
      "start": 2386.2200317382812,
      "end": 2390.02001953125,
      "text": " says, our fathers worshiped in this mountain, and ye say that in Jerusalem is"
    },
    {
      "id": 113,
      "start": 2390.02001953125,
      "end": 2394.8200073242188,
      "text": " the place where men ought to worship. Jesus saith unto her, woman, believe"
    },
    {
      "id": 114,
      "start": 2394.8200073242188,
      "end": 2399.739990234375,
      "text": " me, the hour cometh when ye shall neither in this mountain nor yet at Jerusalem"
    },
    {
      "id": 115,
      "start": 2399.739990234375,
      "end": 2404.7000122070312,
      "text": " worship the Father. Ye worship, ye know not. What?"
    },
    {
      "id": 0,
      "start": 2404.7000122070312,
      "end": 2409.1000123023987,
      "text": " know what we worship, notice this, for salvation is of the Jews. What does he mean by that?"
    },
    {
      "id": 1,
      "start": 2409.1000123023987,
      "end": 2413.9000120162964,
      "text": " It was through the, of course we understand through the messianic prophecies, we've been"
    },
    {
      "id": 2,
      "start": 2413.9000120162964,
      "end": 2419.500012397766,
      "text": " studying the book of Genesis, and as God called Abraham and the Jewish nation, the Hebrew"
    },
    {
      "id": 3,
      "start": 2419.500012397766,
      "end": 2427.500011444092,
      "text": " nation, that Christ would come through that line, and we understand that salvation is"
    },
    {
      "id": 4,
      "start": 2427.500011444092,
      "end": 2432.300012588501,
      "text": " of the Jews. But the hour cometh, verse 23, and now is when the true worshippers shall"
    },
    {
      "id": 5,
      "start": 2432.300012588501,
      "end": 2437.500011444092,
      "text": " worship the Father in spirit and in truth, for the Father seeketh such to worship him."
    },
    {
      "id": 6,
      "start": 2437.500011444092,
      "end": 2442.060012817383,
      "text": " God is a spirit. They that worship him must worship him in spirit and in truth. Notice"
    },
    {
      "id": 7,
      "start": 2442.060012817383,
      "end": 2447.7000122070312,
      "text": " what she says. It's, now she's understanding the gift of God. Because it says in verse"
    },
    {
      "id": 8,
      "start": 2447.7000122070312,
      "end": 2454.4200134277344,
      "text": " number 25, the woman saith unto him, I know that Messiah is cometh, which is called Christ."
    },
    {
      "id": 9,
      "start": 2454.4200134277344,
      "end": 2461.540012359619,
      "text": " When he is come, he will tell us all things. And Jesus saith unto her, I that speak unto"
    },
    {
      "id": 10,
      "start": 2461.540012359619,
      "end": 2472.3000106811523,
      "text": " thee am he. Wow. Wow. She's met Messiah. Jesus must needs go through Samaria, and"
    },
    {
      "id": 11,
      "start": 2472.3000106811523,
      "end": 2479.3000106811523,
      "text": " we find that, she says, that as he's dealing with her and drilling down and dealing with"
    },
    {
      "id": 12,
      "start": 2479.3000106811523,
      "end": 2484.940010070801,
      "text": " the spiritual issues at hand, she says, I know that Messiah is cometh, which is called"
    },
    {
      "id": 13,
      "start": 2484.940010070801,
      "end": 2493.2200088500977,
      "text": " Christ. And he says, I am he. I that speak unto thee am he."
    },
    {
      "id": 14,
      "start": 2493.2200088500977,
      "end": 2497.380012512207,
      "text": " The disciples return. Remember back in verse number 8, they tell us that the disciples"
    },
    {
      "id": 15,
      "start": 2497.380012512207,
      "end": 2500.7400131225586,
      "text": " were gone away into the city to buy meat, and so Jesus is there with this woman. The"
    },
    {
      "id": 16,
      "start": 2500.7400131225586,
      "end": 2506.060012817383,
      "text": " disciples are off running some errands, if you will, getting the supplies that were needed."
    },
    {
      "id": 17,
      "start": 2506.060012817383,
      "end": 2510.780014038086,
      "text": " The Bible tells us that they marveled that he talked to the woman in verse number 27."
    },
    {
      "id": 18,
      "start": 2510.780014038086,
      "end": 2514.7400131225586,
      "text": " But I want you to notice in verse 28 that the woman then left her water pot and went"
    },
    {
      "id": 19,
      "start": 2514.7400131225586,
      "end": 2521.060012817383,
      "text": " her way into the city, and saith to the men, Come, see a man which told me all things that"
    },
    {
      "id": 20,
      "start": 2521.060012817383,
      "end": 2530.980010986328,
      "text": " ever I did. Is not this the Christ? She now understands this gift. Not only does she understand"
    },
    {
      "id": 21,
      "start": 2530.980010986328,
      "end": 2536.500015258789,
      "text": " the gift, but she wants to share the gift. Isn't that natural?"
    },
    {
      "id": 22,
      "start": 2536.500015258789,
      "end": 2541.500015258789,
      "text": " This morning, for many of us, I started the message by saying, what's his gift to me?"
    },
    {
      "id": 23,
      "start": 2541.500015258789,
      "end": 2544.260009765625,
      "text": " What would I consider his gift to me? And we considered it, and we looked at a number"
    },
    {
      "id": 24,
      "start": 2544.260009765625,
      "end": 2548.8200073242188,
      "text": " of truths within the Word of God, and for many of us this morning, we can say, I received"
    },
    {
      "id": 25,
      "start": 2548.8200073242188,
      "end": 2556.220016479492,
      "text": " that gift. But here, when this woman that in the beginning of the passage did not know"
    },
    {
      "id": 26,
      "start": 2556.220016479492,
      "end": 2562.3800048828125,
      "text": " the gift of God, if thou knewest the gift of God, she didn't know it, now as her eyes"
    },
    {
      "id": 27,
      "start": 2562.3800048828125,
      "end": 2569.060012817383,
      "text": " have been opened, as Jesus deals with her, she now has her eyes opened, and she says,"
    },
    {
      "id": 28,
      "start": 2569.1000061035156,
      "end": 2577.220016479492,
      "text": " Is not this the Christ? We find that she goes back and she tells them, and it says, as you"
    },
    {
      "id": 29,
      "start": 2577.220016479492,
      "end": 2587.300018310547,
      "text": " look and skip down in verse number 39, and many of the Samaritans of the city believed"
    },
    {
      "id": 30,
      "start": 2587.300018310547,
      "end": 2593.6600189208984,
      "text": " on him for the saying of the woman, which testified he told me all that ever I did."
    },
    {
      "id": 31,
      "start": 2593.6600189208984,
      "end": 2597.500015258789,
      "text": " So when the Samaritans were come unto him, they besought him that he would tarry with"
    },
    {
      "id": 32,
      "start": 2597.500015258789,
      "end": 2603.060012817383,
      "text": " them, and he abode there two days. So notice the scene, she leaves from getting water,"
    },
    {
      "id": 33,
      "start": 2603.060012817383,
      "end": 2608.220016479492,
      "text": " and she runs back to the city, and she tells these people, she announces this experience"
    },
    {
      "id": 34,
      "start": 2608.220016479492,
      "end": 2612.8200073242188,
      "text": " that she's had, and this interaction that she's had with Christ, with the Messiah, and"
    },
    {
      "id": 35,
      "start": 2612.8200073242188,
      "end": 2616.8600158691406,
      "text": " the Bible tells us that many of the Samaritans believed on him for the saying of the woman,"
    },
    {
      "id": 36,
      "start": 2616.8600158691406,
      "end": 2622.3400115966797,
      "text": " according to verse number 39, and then a great multitude come to him, he mentions about that,"
    },
    {
      "id": 37,
      "start": 2622.500015258789,
      "end": 2628.3400115966797,
      "text": " in verses 34 through 37, about the multitude that were coming, and he says that as they come,"
    },
    {
      "id": 38,
      "start": 2628.3400115966797,
      "end": 2632.8600158691406,
      "text": " they ask him, they beseech him, that he would tarry there, and he stayed there for two days."
    },
    {
      "id": 39,
      "start": 2632.8600158691406,
      "end": 2639.980010986328,
      "text": " And I want you to notice verses 41 and 42. It says that many more believed because of his own word,"
    },
    {
      "id": 40,
      "start": 2639.980010986328,
      "end": 2646.460006713867,
      "text": " and said unto the woman, Now we believe, not because of thy saying, for we have heard him"
    },
    {
      "id": 41,
      "start": 2646.460006713867,
      "end": 2655.8200073242188,
      "text": " ourselves, and know that this indeed is indeed the Christ, the Savior of the world. We sang this"
    },
    {
      "id": 42,
      "start": 2655.8200073242188,
      "end": 2663.0599975585938,
      "text": " morning, joy to the world, the Savior is come. He has come. And as we understand this gift of God,"
    },
    {
      "id": 43,
      "start": 2663.0599975585938,
      "end": 2669.300018310547,
      "text": " Galatians chapter number 4, you don't need to turn there, but in Galatians 4, in verse number 4,"
    },
    {
      "id": 44,
      "start": 2669.300018310547,
      "end": 2675.7000122070312,
      "text": " the Bible says, when the fullness of the time was come, God sent forth his Son, made of a woman,"
    },
    {
      "id": 45,
      "start": 2675.7000122070312,
      "end": 2682.3800048828125,
      "text": " made under the law. What was the purpose of sending his Son? To redeem them that were under"
    },
    {
      "id": 46,
      "start": 2682.3800048828125,
      "end": 2689.1000061035156,
      "text": " the law, that we might receive the adoption of sons. How did he redeem us? Through his substitutionary"
    },
    {
      "id": 47,
      "start": 2689.1000061035156,
      "end": 2695.4600219726562,
      "text": " atonement. The gift of God that we're speaking of this morning, this gift that's been made"
    },
    {
      "id": 48,
      "start": 2695.4600219726562,
      "end": 2701.6200256347656,
      "text": " available to us, and as we understand this gift, and as we've received this gift, then we ought to"
    },
    {
      "id": 49,
      "start": 2701.6200256347656,
      "end": 2709.8600158691406,
      "text": " have the desire to give him our praise, to give him our life, to lift up our voice and testify of"
    },
    {
      "id": 50,
      "start": 2709.8600158691406,
      "end": 2722.1800231933594,
      "text": " him. In John chapter number 1, John the Baptist is preaching, and the Lord Jesus Christ walks by,"
    },
    {
      "id": 51,
      "start": 2722.1800231933594,
      "end": 2729.3800048828125,
      "text": " and John the Baptist says, behold the Lamb of God. The Bible tells us that a couple of those"
    },
    {
      "id": 52,
      "start": 2729.3800048828125,
      "end": 2735.0599975585938,
      "text": " two disciples of John the Baptist, they followed after Jesus, and Jesus said, what seek ye? And"
    },
    {
      "id": 53,
      "start": 2735.0599975585938,
      "end": 2744.0599975585938,
      "text": " they say, where dwellest thou? And he said, come and see. And the Bible says that in verse number"
    },
    {
      "id": 54,
      "start": 2744.0599975585938,
      "end": 2748.540008544922,
      "text": " 40, one of the two which heard John speak and followed him was Andrew, Simon Peter's brother."
    },
    {
      "id": 55,
      "start": 2748.540008544922,
      "end": 2755.6200256347656,
      "text": " He first findeth his own brother Simon and saith unto him, we have found the Messiah, which is"
    },
    {
      "id": 56,
      "start": 2755.6200256347656,
      "end": 2761.260009765625,
      "text": " being interpreted, the Christ. And I want you to notice this phrase in verse number 42, and he"
    },
    {
      "id": 57,
      "start": 2761.260009765625,
      "end": 2773.8600158691406,
      "text": " brought him to Jesus. This morning, if thou knewest the gift of God, we consider his gift to us, it's"
    },
    {
      "id": 58,
      "start": 2773.8600158691406,
      "end": 2780.02001953125,
      "text": " eternal life. This morning, if you've not received the gift of eternal life, I would say to you this"
    },
    {
      "id": 59,
      "start": 2780.02001953125,
      "end": 2787.3400268554688,
      "text": " morning, would you receive the gift of God? It's available. He's paid for it. He makes it available"
    },
    {
      "id": 60,
      "start": 2787.3400268554688,
      "end": 2797.7000122070312,
      "text": " to all people. Today is the day of salvation. Today is the day of salvation. We know not what's"
    },
    {
      "id": 61,
      "start": 2797.7000122070312,
      "end": 2802.740020751953,
      "text": " on the morrow, according to Proverbs 27. What is your life? It's a vapor that appeareth for a little"
    },
    {
      "id": 62,
      "start": 2802.740020751953,
      "end": 2808.5800170898438,
      "text": " time and then vanisheth away. And this morning, if you're not sure of heaven, if you've not received"
    },
    {
      "id": 63,
      "start": 2808.6600036621094,
      "end": 2814.6600036621094,
      "text": " the gift of God, which is eternal life, this Christmas season, why don't you receive the"
    },
    {
      "id": 64,
      "start": 2814.6600036621094,
      "end": 2824.8200073242188,
      "text": " greatest gift, the perfect gift, the gift of God, which is eternal life. This morning, if you've"
    },
    {
      "id": 65,
      "start": 2824.8200073242188,
      "end": 2831.7000122070312,
      "text": " already received that gift, what's our gift in return to him? How are we praising him? Are we"
    },
    {
      "id": 66,
      "start": 2831.7000122070312,
      "end": 2838.5800170898438,
      "text": " lifting his name? Are we exalting him the way that we should? Have we given him our lives? Not"
    },
    {
      "id": 67,
      "start": 2838.5800170898438,
      "end": 2843.3400268554688,
      "text": " to earn our salvation, not to keep it. We can't earn it or keep it. But because of what he's done"
    },
    {
      "id": 68,
      "start": 2843.3400268554688,
      "end": 2851.1000061035156,
      "text": " for us, have we offered him our lives? How's our testimony? Who are we bringing to Jesus? Who are"
    },
    {
      "id": 69,
      "start": 2851.1000061035156,
      "end": 2859.02001953125,
      "text": " we saying, let me tell you about this gift, this gift of God. Let me tell you what he did for you,"
    },
    {
      "id": 70,
      "start": 2859.4200134277344,
      "end": 2864.4600219726562,
      "text": " or what he did for me and what he can do for you. Let me tell you how he changed my life"
    },
    {
      "id": 71,
      "start": 2865.9000244140625,
      "end": 2871.8200073242188,
      "text": " and how he can change your life too, if thou knewest the gift of God. Maybe this morning,"
    },
    {
      "id": 72,
      "start": 2871.8200073242188,
      "end": 2877.980010986328,
      "text": " someone entered into this meeting place not knowing the gift of God, but now you know it."
    },
    {
      "id": 73,
      "start": 2879.740020751953,
      "end": 2885.6600036621094,
      "text": " Would you receive it? It's available. He's already paid for it. You say, what do I have to do? Just"
    },
    {
      "id": 74,
      "start": 2885.6600036621094,
      "end": 2893.3400268554688,
      "text": " receive it. Just receive it. I hope that you wouldn't reject it because God loves you so much"
    },
    {
      "id": 75,
      "start": 2894.3800048828125,
      "end": 2898.4600219726562,
      "text": " and he wants you to be saved. Let's pray together. Father, we love you."
    },
    {
      "id": 76,
      "start": 2899.5,
      "end": 2903.1800231933594,
      "text": " We thank you for loving us. We thank you for the Word of God."
    },
    {
      "id": 77,
      "start": 2905.3400268554688,
      "end": 2912.3800048828125,
      "text": " We're thankful that you sent your son, the Lord Jesus Christ, born of a virgin."
    },
    {
      "id": 78,
      "start": 2915.980010986328,
      "end": 2922.780029296875,
      "text": " We're thankful that you sent your son to this world, to this sin-cursed world,"
    },
    {
      "id": 79,
      "start": 2923.9800415039062,
      "end": 2930.2200317382812,
      "text": " so he could live a sinless, perfect life, so he could make the atonement for our sin,"
    },
    {
      "id": 80,
      "start": 2931.5,
      "end": 2938.7000122070312,
      "text": " pay the price so that we could be redeemed. We're thankful this morning for this unspeakable gift."
    },
    {
      "id": 81,
      "start": 2939.5800170898438,
      "end": 2946.3800048828125,
      "text": " That this gift has been paid for, paid in full, with the precious blood of Jesus Christ, proven"
    },
    {
      "id": 82,
      "start": 2947.3400268554688,
      "end": 2954.5400390625,
      "text": " through his glorious resurrection. I'm thankful that it's available. Lord,"
    },
    {
      "id": 83,
      "start": 2954.5400390625,
      "end": 2961.5,
      "text": " if there'd be one this morning, maybe there's several. Here locally, tuned in via live stream,"
    },
    {
      "id": 84,
      "start": 2963.6600341796875,
      "end": 2967.8200073242188,
      "text": " they entered this meeting time the same way that that woman at the well, not knowing the gift of"
    },
    {
      "id": 85,
      "start": 2968.780029296875,
      "end": 2973.260009765625,
      "text": " God. He said, if you knew it, you'd ask for it and I'd give it to you."
    },
    {
      "id": 86,
      "start": 2975.6600341796875,
      "end": 2977.739990234375,
      "text": " This morning, he is the Savior of the world."
    },
    {
      "id": 87,
      "start": 2979.8200073242188,
      "end": 2986.2200317382812,
      "text": " He's my Savior. He wants to be your Savior. If you're not sure of heaven this morning,"
    },
    {
      "id": 88,
      "start": 2986.2200317382812,
      "end": 2987.9000244140625,
      "text": " Lord, would you work with the Holy Spirit,"
    },
    {
      "id": 89,
      "start": 2990.5400390625,
      "end": 2994.7000122070312,
      "text": " convict and convince of sin and of Christ's righteousness and of judgment to come?"
    },
    {
      "id": 90,
      "start": 2997.8200073242188,
      "end": 3000.5400390625,
      "text": " For those that have already received the gift of God this morning,"
    },
    {
      "id": 91,
      "start": 3001.6600341796875,
      "end": 3004.5400390625,
      "text": " would you help us to live for Jesus? Help us to live for you."
    },
    {
      "id": 0,
      "start": 3004.5400390625,
      "end": 3006.2400391101837,
      "text": " You."
    },
    {
      "id": 1,
      "start": 3006.2400391101837,
      "end": 3008.2800390720367,
      "text": " Help us to praise You."
    },
    {
      "id": 2,
      "start": 3008.2800390720367,
      "end": 3012.240038871765,
      "text": " Help us to surrender our lives."
    },
    {
      "id": 3,
      "start": 3012.240038871765,
      "end": 3017.880039215088,
      "text": " Help us to testify and bring others to Jesus, because we understand this wonderful gift"
    },
    {
      "id": 4,
      "start": 3017.880039215088,
      "end": 3023.2400398254395,
      "text": " and we want the world to know that Jesus saves."
    },
    {
      "id": 5,
      "start": 3023.2400398254395,
      "end": 3028.0800399780273,
      "text": " We pray that You'd move work as only You can in this time of invitation."
    },
    {
      "id": 6,
      "start": 3028.0800399780273,
      "end": 3031.880039215088,
      "text": " We'll give You the honor and glory for all that You'll do, for it's in Christ's name"
    },
    {
      "id": 7,
      "start": 3031.880039215088,
      "end": 3032.880039215088,
      "text": " we pray."
    },
    {
      "id": 8,
      "start": 3032.880039215088,
      "end": 3033.880039215088,
      "text": " Would You stand with me?"
    },
    {
      "id": 9,
      "start": 3033.880039215088,
      "end": 3036.1600399017334,
      "text": " God, eyes are closed."
    },
    {
      "id": 10,
      "start": 3036.1600399017334,
      "end": 3041.600040435791,
      "text": " The conclusion of our services, we have a time of invitation."
    },
    {
      "id": 11,
      "start": 3041.600040435791,
      "end": 3045.5600395202637,
      "text": " We invite you to respond to the preaching of the Word of God."
    },
    {
      "id": 12,
      "start": 3045.5600395202637,
      "end": 3051.0400390625,
      "text": " As the Holy Spirit of God has moved in your heart and your life, we ask that you'd respond."
    },
    {
      "id": 13,
      "start": 3051.0400390625,
      "end": 3055.2400398254395,
      "text": " No one's looking around, we'd never embarrass you."
    },
    {
      "id": 14,
      "start": 3055.2400398254395,
      "end": 3058.800037384033,
      "text": " Kimberly will play quietly on the piano, and as she does, the altar's open."
    },
    {
      "id": 15,
      "start": 3058.800037384033,
      "end": 3062.0400390625,
      "text": " If you're not sure of heaven, we'd love to take a Bible and show you how you can know"
    },
    {
      "id": 16,
      "start": 3062.1600379943848,
      "end": 3063.6800384521484,
      "text": " for sure that heaven's your home."
    },
    {
      "id": 17,
      "start": 3063.6800384521484,
      "end": 3071.6800384521484,
      "text": " If you want to just come and thank Him for this unspeakable gift, perhaps you just want"
    },
    {
      "id": 18,
      "start": 3071.6800384521484,
      "end": 3078.0000381469727,
      "text": " to praise His name and offer your life to Him, or bring others to Jesus."
    },
    {
      "id": 19,
      "start": 3078.0000381469727,
      "end": 3081.0400390625,
      "text": " However it is that the Lord may have spoken to your heart this morning, the altar is open"
    },
    {
      "id": 20,
      "start": 3081.0400390625,
      "end": 3082.2000427246094,
      "text": " as Kimberly plays."
    }
  ],
  "processed_at": "2025-04-17T01:24:52.956151"
}