{
  "video_id": "2cDKZaPlI5s",
  "text": "That was just free tonight, amen, just an addendum to the song. Genesis chapter 41, we're going to finish this chapter tonight. And someone misunderstood me this morning and thought I was finishing the life of Joseph tonight. But just chapter 41, just this section of the life of Joseph. And we got lots of chapters left here through the end of the book of Genesis chapter 50. But we look at Genesis chapter 41, we spent a few weeks in this particular chapter. It is a lengthy chapter, it's 57 verses, and a lot of things happen. I mean, it is a chapter that is filled with information. And if you think about the life of Joseph and where we've been the last couple of weeks as we've studied through Genesis 41, we find that those first seven years after Joseph is promoted, we'll give him the title this evening as Prime Minister over Egypt, if we could use that terminology tonight. And I understand the Bible doesn't say that, it says that he's second in charge, second in command. But if we could use that terminology, he's set in that place. Pharaoh had made him ruler over all the land of Egypt. And as Joseph is promoted to that place, that position of Prime Minister, we find that those first seven years after he reaches that place, that position, are described for us in verse 29 of Genesis 41 as being great plenty. Notice what the Bible says. Behold, there come seven years, not just seven years of plenty, but the Bible says seven years of great plenty. And throughout all the land of Egypt, I believe that for those seven years of great plenty, they reaped a harvest that was unlike anything they had ever experienced in their lives. I believe that as they were going through and reaping during those seven years, there were probably comments that would be made of, man, we've never had a harvest like this before, and so on and so forth. And there's seven years of great plenty. We find that during those seven years, they are filled with a number of changes in the life of Joseph. Remember, when we started Genesis 41, he's in prison. He interprets the dream, he's placed in that position, and the seven years begin. And we spoke about those seven years of great plenty last week. And so we see that Joseph, just in Genesis 41, he has a new position. I would say that he has a new home, a palace, a new place to live. He is no longer there in the prison house. He has a new wife, and he has two new sons. And we spoke about those sons last week, and as we looked at the names of those sons, and we talked about being fruitful in the land of affliction. And even in the midst of affliction, we can have that fruitfulness that Joseph describes, and it requires that we forget some things, and then we see how God has blessed. In addition to all of this, all of these changes in Genesis 41, Joseph had the great responsibility to prepare the nation for those seven years of famine that would be, according to verse number 30 and 31, very grievous and would consume the land. Notice we read in verse 29 that those seven years, they would be of great plenty throughout all the land of Egypt. But then notice in verse 30 of Genesis 41, it says, And there shall arise after them seven years of famine, and all the plenty, notice what it says, shall be forgotten in the land of Egypt. And the famine shall, notice it says, consume the land. The plenty shall not be known in the land by reason of the famine following, for it shall be very grievous. And of course, God had given Joseph the wisdom that was necessary in order to give counsel to Pharaoh with regard to what to do because of this dream that had been interpreted. And as we kind of skip into our passage this evening, and we begin to think about the plan that God had given Joseph, we would see that as God gave Joseph that great wisdom, that his plan was effective. We are told that Joseph went throughout all the land. In verse number 49, it tells us that he laid up that food. In fact, at the end of verse number 45, it says that Joseph went out over all the land of Egypt. At the end of verse number 46, it says that he, Joseph, went out from the presence of Pharaoh and went throughout all the land of Egypt. And it was during those seven plenteous years, those years that were described in verse number 29 as being great plenty, that Joseph went out and he gathered up, according to verse number 48, all the food of the seven years which were in the land of Egypt. And he laid up the food in the cities, the food of the field, which was round about every city, laid he up in the same. And verse 49 tells us, and Joseph gathered corn as the sand of the sea very much until he left numbering, for it was without number. In these great days of plenty, Joseph was faithful to do what God had revealed to him. He was faithful to complete the task that he had been entrusted with by Pharaoh on storing up during those seven years. Remember, God had given Joseph the wisdom to be able to provide that counsel as to what should take place during those seven years of great plenty. According to verse number 34, they were to take up 20% of that which was produced during those years of great plenty and store it so that they would have food during the famine. We find that this plan was effective. Why was it effective? Well, because it was God's plan and God had revealed it to Joseph. And the effectiveness of the plan is seen throughout the portion of Scripture. But we see that those days of great plenty ended. And as we enter into our text of Scripture this evening, in verse number 53, notice what the Bible says, and we'll look at verse 53 down through the end of the chapter. The Bible says, and the seven years of plenteousness that was in the land of Egypt were ended. They were ended. And it says in verse number 54, and the seven years of dearth began to come. According as Joseph had said, the dearth was in all lands, but in all the lands of Egypt there was bread. When all the land of Egypt was famished, the people cried to Pharaoh for bread, and Pharaoh said unto all the Egyptians, Go unto Joseph, what he saith to you, do. And the famine was over all the face of the earth, and Joseph opened all the storehouses and sold unto the Egyptians, and the famine waxed sore in the land of Egypt, and all countries came unto Egypt to Joseph for to buy corn, because the famine was so sore in all lands. I've titled the message from verse number 54 this evening, the seven years of dearth began. The seven years of dearth began. We notice as we conclude the chapter, I just read the verses, but God reveals to us really in verse 56 and verse number 57, how this circumstance, this great famine that was upon the land, that was described as being very grievous, that would consume the land, that God reveals to us how this would be the catalyst, if you will, that would eventually bring Jacob and his family into the land of Egypt. Because the Bible says that all countries, verse 57, came into Egypt to Joseph for to buy corn, because the famine was so sore, notice, in all lands. Now, it's kind of interesting, if you look at the end of verse number 57, before we get into the message this evening, notice that little word, so. We're familiar with that when we read John 3, 16, for God so loved the world. And you think about the impact when God is explaining to us the terribleness, if you will, of this famine. This is because the famine was so sore in all lands. As you enter into the 42nd chapter, you find that the Bible tells us that Jacob saw that there was corn in Egypt. And again, God would use this circumstance as really a catalyst that would eventually bring Jacob and his family into the land of Egypt. And it's a time in which Joseph eventually would reveal his person, his identity to his brothers, and he would say this, God sent me before you for what purpose? To preserve life. And God was using Joseph in this land of affliction, as he refers to it in verse number 52, but God was using him and God had a purpose. And I want you to think about these seven years of famine, and as we've looked at the title, the seven years of dearth began. Consider just a couple of things with me this evening. Number one, I want you to consider with me the cry of the people. The cry of the people. As we notice in verse number 55 of our text of Scripture, the Bible gives us a description. It's a dim description. The Bible had told us, and we spent some time looking and reminding ourselves of what we've studied throughout this 41st chapter already, but we find that the Bible told us in verse number 30 that those years of famine would rise, and then notice what it says in verse number 30, and all the plenty, notice what it says, shall be forgotten. Now think about that, because during those seven years of great plenty, as it's described in verse 29, I believe again that many were saying, we've never had a harvest like this, but then when that great famine comes, those years of great plenty are forgotten. And why are they forgotten? Well, because it's severe, it's grievous, it's going to consume the land. It's amazing what people will do when they have no food. It's amazing what people will do when there's no food. And we find that as we look at the cry of the people, notice what God tells us in verse number 55, and when all the land of Egypt, what does it say, was famished, was famished. Sometimes our children will say, I'm starving. You ever hear your kids say that? Maybe some of you wives, you've heard your husband say, I'm starving. And you're like, you could... live for days without eating, right? Like, you are not starving, you're okay. I'm going to die, I'm so hungry. No, we've never probably truly experienced that. But the reality is that God tells us here that the land, and it says all the land of Egypt, was famished. And it reveals to us as we think about that statement in verse number 55, as we enter into this portion of scripture, it reveals to us that this famine was so severe that it had an immediate impact. I mean, when those, can you imagine, and God is in this, right? See, our God is the creator. This idea of mother nature, no, no, God's in control of everything. God's the one that sends the rain, God's the one that withholds the rain. In fact, for the children of Israel, they were told that God would send the rain as a blessing, and that God would withhold the rain as judgment. Amen? And often, as you look throughout the scriptures, you find that times, periods of drought and famine, were the direct result of God's divine judgment upon his people. And so God brings this famine. He had revealed it, of course, in his grace and his mercy, through this dream that Pharaoh has, and Joseph is able to interpret and give the counsel, but this particular famine had an immediate and severe impact. The land, it says all the land of Egypt was famished, and then notice the Bible says that the people, the people of Egypt, they cried to Pharaoh for bread. Over the next several weeks, as we study throughout the next several portions of scripture in the book of Genesis, we'll see to what extent people will go when they're hungry, what they will be willing to sell, and what they will be willing to do, and in order to be able to get some food. It's no doubt in my mind, it's going to be quite easy when things happen during the tribulation time, and they say, well, you're going to need to have this mark right here if you want to have some food, if you want to be able to buy, sell, or trade. It's going to be very, people are going to line up and say, where do you want to put it? Which hand? Where out of my forehead? I mean, I'll take it, I'll have it in all three places. I mean, people will really be that way. They'll be ready to do it, and we find here this evening, as we continue, and again, over the next several weeks, we continue to look throughout the portions of scripture here in the book of Genesis to see the depth of how this famine impacted the people, but the people cried to Pharaoh for bread. I want you to think about this just for a moment. As we think about the cry of the people, you know, in times of crisis, I believe that this here was a time of crisis for the Egyptians. It was a time of crisis not only for the Egyptians, but we find that for all of the world, because it affected not just Egypt, but all countries were impacted because of this famine. In fact, in verse 56, it says, and the famine was over all the face of the earth. And we find that as this famine would impact, it was a time of great crisis, and you find that in a time of crisis that people need direction. People need direction in time of crisis. People become desperate in time of crisis. We think about time of crisis, and we see it here in this portion of scripture, and we see the response of the people, and I wonder tonight, as we understand that the people cry, and they cry to Pharaoh for bread, I wonder this evening in time of great distress, in time of crisis, in time of great difficulty, to whom do we look? To whom do we cry? Because we find that here, the Bible tells us that these folks, that they cried, the people cried to Pharaoh for bread. They were desperate. They were in need. They were famished. They were hungry. Times of great desperation led them to a place where they were crying out to Pharaoh. As we look at the text of scripture, we not only see the cry of the people, but we see, number two, the counsel of Pharaoh. The counsel of Pharaoh. I want you to notice, and we're going to spend the remainder of our time here on looking at the response of Pharaoh and what takes place. The Bible says, and Pharaoh said unto all the Egyptians, notice what he says, notice the counsel that Pharaoh gives, go unto Joseph, what he saith to you, do. Now I want you to think about Pharaoh. He is the, he's the man in charge. Joseph is second in command. Pharaoh is the man in charge, and the people cry unto Pharaoh and say, give us bread. They're desperate. They're pleading. They're crying for some help, and Pharaoh says, go to Joseph. And whatever Joseph says, what he saith to you, do. Now we have to back up, and I know this is review, but remember that back in verse number 33, after Joseph interpreted the dream, Joseph begins to give this action plan, if you will, to Pharaoh. And here's what he says, now therefore let Pharaoh look out a man, discreet and wise, and send him over the land of Egypt. Let Pharaoh do this, and let him appoint officers over the land, and take up the fifth part of the land of Egypt in the seven plenteous years. We're not going to read all of it, but we find that Joseph is providing this counsel and instruction, and Pharaoh concludes in verse number 38, he says to his servants, can we find such a one as this is, a man in whom the Spirit of God is. And we find that Joseph is given this place of, of power, of position. We mentioned last week how that Joseph was given a new name, and he was given that new name, and we mentioned that, and that Pharaoh gave him that name, and the name is recorded for us. Notice in verse number 42, and Pharaoh took off his ring from his hand, and put it upon Joseph's hand, and arrayed him in vestures of fine linen, and put a gold chain about his neck, and he made him to ride in the second chariot which he had. And they cried before him, bow the knee, and he made him ruler over all the land of Egypt. And Pharaoh said unto Joseph, I am Pharaoh, without thee shall no man lift up his hand or foot in all the land of Egypt. And Pharaoh called Joseph's name Zaphnath-Paneah, and he gave him to wife Asenath. But we mentioned last week in verse number 45, as you see that name, and again there's some level of debate with regard to what that name really means, and there's some debate and discussion amongst theologians and Jewish rabbis with regard to that, but really it seems that the most likely interpretation of what that name means is God speaks and he lives. God speaks and he lives, or and he giveth life. And you think about what Pharaoh was recognizing in giving that name to Joseph. He could have named him whatever he wanted to name him. And because of what had transpired, we find that Pharaoh gives that name, and Joseph is now in this position, and when the people come and they cry there to Pharaoh for help, and they cry because they want bread, this time of great difficulty, this time of when the land is famished, and they cry for bread, and Pharaoh says, go unto Joseph. What he saith to you, do. Now this evening as we look at this portion of Scripture, and I don't always go this route, but you find in the Bible there's a lot of types, typologies. And I believe that it's important this evening that we look at this and see the typology that the Lord is giving us. We see the interpretation, when we talk about hermeneutics and interpreting Scripture, we see that at face value this is an event that happened in the land of Egypt. This famine was real, the people were famished, the people had no bread, and they cry out for help, and Pharaoh says, go to Joseph. And that's truly what happens, but there's typologies in the Bible. And I believe this evening as we look at this portion of Scripture, and I want you to consider this with me, we'll make some application in our own lives, but I want you to know and consider with me that Egypt and Pharaoh are really types, and they represent the world and its system. You understand that the world has a system. The Bible says that we're to be not conformed to this world, but to be transformed by the renewing of our mind, that we may prove what is that good and acceptable and perfect will of God in Romans chapter number 12. And we find that Egypt and Pharaoh, as you study through the Old Testament, as you look into the typologies and you read into even the New Testament, how that it's a picture, a type of the world and the world system. The world still is in existence. The Bible tells us this, love not the world, neither the things that are in the world, right? And the world fadeth away, it passeth away. We understand that in 1 John chapter number 2. And so we find this evening that Egypt and Pharaoh, and we find that Pharaoh is the one that's addressed. And so these people that are famished, these people that are in great distress, this time of great crisis when people are desperate and they're looking for direction, they're looking for leadership, where do they go? Well, they go to Pharaoh. It makes sense. You know what Pharaoh says? I can't help you. In essence, what Pharaoh says is, I can't help you. Go to Joseph. There was nothing that he could do. Joseph is a type of the Lord Jesus Christ. Now understand this evening, he's not the Lord Jesus Christ. He's simply a type of the Lord Jesus Christ. And as we study, we have the opportunity through these types and typologies in the Old Testament, you have opportunity to see these glimpses and to see these truths. And we find this evening that Joseph is a type of the Lord. And so we find this evening that if Egypt and Pharaoh represent the world and its system, and Joseph represents or is a type of the Lord Jesus Christ, and we begin to make application from this portion of Scripture tonight in our lives, understand tonight that you're going to face times of crisis. You're gonna face times of great difficulty, of distress, of being overwhelmed, and needing direction, and desiring for someone to provide for something that you have need of. And the question, as we mentioned in that first point, the cry of the people, to whom do we look? To whom do we go? Notice what happens if you think about God's people. Turn to the book of Isaiah, if you will, and go to Isaiah chapter number 30. We're gonna look at a couple of passages here in the book of Isaiah, and then we're gonna go to the New Testament and make some final application this evening. But I want you to consider, as we look at this historical event, this recorded event that took place in the life of Joseph, but how it applies for us tonight in our own lives. In Isaiah chapter number 30, the Bible says this in verse number 1, Isaiah 30 and verse number 1, Woe to the rebellious children, saith the Lord, that take counsel, but then notice these words, but not of me. But take counsel, but not of me. And that cover with a covering, but not of my spirit, that they may add sin to sin. Notice verse number 2, that walk to go down into where? Egypt. It's a picture of what? It's a type of what? The world and the world system. And then notice this last phrase, and have not asked at my mouth. Can you imagine? It's just to strengthen themselves in the strength of who? Pharaoh. And to trust in the shadow of Egypt. So who is Isaiah prophesying to? He's prophesying to God's people. To the children of Israel. He's prophesying to them. And he's saying, woe to the rebellious children. Why is this woe being given? And understand that it says, saith the Lord. Isaiah is the human prophet, but he's delivering the message that God has given. And he says that you're taking counsel, but not of me. And then he provides further insight as to what they were really doing and how they were operating, so that they couldn't say, what are you talking about? We're not taking counsel. No, here's what you're doing. You're running down to Egypt. To the world. And then notice what he says, and this is so powerful in my mind, and I hope that we grasp the concept this evening. It says this, and have not asked at my mouth. I said this this morning as I was preaching on the subject of prayer. I said it's a wonderful truth to know that God hears and answers prayer. But to know that he hears and answers prayer and not pray, just doesn't make sense. It's of no help. Would you agree? God hears and answers prayer, but I don't pray. Well, that doesn't even make sense. And here the Bible says that the people of God, the children, the rebellious children as they're described here, that they have not asked at my mouth. What if they just would have asked for counsel? What if they just would have sought the face of God? What if they would have desired wisdom and counsel from God instead of from the world? Listen, you understand this evening, the world's not going to give you counsel that's going to align with this book. The world is not going to provide you with counsel that is going to align with what thus saith the Lord. In fact, if you go to the world for counsel, many times their counsel is going to be contrary to what you find in God's Word. Why? For the natural man receiveth not the things of the Spirit of God. For there are foolishness unto him, neither can he know them. Why? Because they are spiritually discerned, 1 Corinthians 2. And we find here that God is sent in this indictment against his people because they're taking counsel but not from God. They're running down to Egypt, or walking to go down into Egypt, but have not asked of My mouth. God says ask. And what? Ye shall receive. Is that not a promise? He says ye have not because ye ask not. Right? Is that what He says? Is that Bible? And we find here this evening that He says that you've not asked of My mouth to strengthen themselves. Notice where it says, in the strength of Pharaoh. Now this is amazing to me because I think about the children of Israel. We have the Bible and we can read back and we can understand all that happened with the Exodus and so on and so forth. And I understand the Exodus is after what we've read in Genesis 41 this evening but Isaiah is after the Exodus. So I think it's fair that we could say that the children of Israel were aware of what happened during the Exodus. The children of God during the time of Isaiah's prophecy were aware of the Exodus. They were aware of the plagues. They could read the Psalms. They could read the book of Exodus. They could be aware of what God did. And let me ask you this. Who had more power? God or Pharaoh? Was it abundantly clear? So clear that even the magicians of Egypt said this is the finger of God. They asked Pharaoh, do you not see that the land is devastated? I mean how long are you going to allow these people to be a snare unto us? God made it abundantly clear and abundantly obvious that He is the one that has all power. That He has more power than Pharaoh. Would you agree? But look at verse number 2. These people that would have known that, it says to strengthen themselves in the strength of Pharaoh. Why do we want Pharaoh's strength? If Pharaoh's strength is inferior to God's strength, why do we want Pharaoh's strength? Do you understand? But this is what they're doing. It says at the end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not. You know the verses, right? And we find here this evening that they are going to seek to be strengthened by the strength of Pharaoh who is inferior to God Almighty and God had made it abundantly clear and demonstrated that truth. And then they're going to trust in the shadow of Egypt. That's a sad commentary, is it not? I mean, what a sad, sad indictment against the children of Israel here. And we find that we are to abide. You don't need to turn there, but I'm mindful this evening of the truth of Psalm 91. He that dwelleth in the secret place of the Most High shall abide under the shadow of the Almighty. Not the shadow of Pharaoh of Egypt, but of the shadow of the Almighty. I will say to the Lord, He is my refuge and my fortress. My God, in Him will I trust. Wow. If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help and stay on horses and trust in chariots. Why are they trusting in chariots? Because there aren't any. And in horsemen, because why? They're very strong. But they look not unto the Holy One of Israel, neither seek the Lord. Verse 2, yet He also is wise and will bring evil and will not call back His words, but will rise against the house of the evildoers and against the help of them that work iniquity. Now the Egyptians, notice what God says here in verse number 3. Now the Egyptians are men and not God, and their horses flesh and not spirit. When the Lord shall stretch out His hand, both he that helpeth shall fall and he that is hopin' shall fall down and they shall fail together. He says, woe to them that go down to Egypt for help. They look not unto the Holy One of Israel, neither seek the Lord. The psalmist says in Psalm 121, we used it as a theme verse a couple of years ago. I will lift up mine eyes into the hills from whence cometh my help. My help cometh from the Lord, which made heaven and earth. And so if we know the book of Hebrews in the 13th chapter says, the Lord is my helper. Aren't you thankful for that? What a blessing. And the little group that I was in this morning, I didn't offer a whole lot in the Sunday school time when we sat around the table. I asked some questions to try to promote some thinking, but I really didn't help them fill out some things. But one of the words that was on the list, the table that I was with in Sunday school this morning under the letter H was helper. He's my helper. And there are a bunch of little kids at our table. And I was excited to hear them put together and to have that idea. Joseph was there and Holly and I, and then some younger children there. And what a blessing. Listen, God is my helper. I don't need to run down to Egypt for help. And let me say this to you this evening, and I'm saying this to myself as well. And you understand, I said this when I prayed this morning. Listen, when I preach messages, God gets to deal with me all week as I prepare, and then he gets to deal with me again when I deliver. So I get it twice every time you get it once, amen? And that's just the way it works. And actually, it's probably more than twice because the preparation time is over and over and over, and so on and so forth. But understand with me this evening that if this was true of the children of Israel in Isaiah's day, you cannot tell me that it's still not true of God's people today. That there are times in your life and in my life when we go to the world and the world system for help and for counsel and never even ask for help. God, we're guilty. We may not want to admit it. We may not want to acknowledge this evening. We may not, we might've put that facade on of nope, I've never done that, pastor. But the reality is that we're all guilty, just like the children of Israel were guilty in Isaiah's day. There are times in our lives when we do, we don't even ask the Lord. We don't even, as it said in there, in chapter 30 and verse number two, they have not asked at my mouth. There are times that we've simply not even sought the Lord, but we've sought the counsel, the help, the direction of the world. And we see here this evening that this prophet Isaiah gives these indictments and we put all of this together and think about the truth back there in Genesis chapter 41, and we'll be in the New Testament in just a moment and finish the message, but in Genesis chapter 41, I want to remind you of the counsel once again. Remember the people, because all the land was famished, the people cried to Pharaoh for bread. And Pharaoh sent out all the Egyptians going to Joseph, what do you say if you do? Pharaoh wasn't able to offer any help. He sends them to Joseph. Joseph, as I mentioned a moment ago, is a type, a picture of the Lord Jesus Christ. And it's very amazing to me that here in Genesis chapter 41 and verse number 55, that here's what the Bible says, go unto Joseph. This is what Pharaoh says to the Egyptians, go unto Joseph and notice what he saith to you, do. Now, contextually, historically, what's going to happen is Joseph's gonna say, you want some bread? All right, here's what you do. You gotta give me this and I'll give you some bread and so on and so forth. Eventually they get the land and so on and so forth, and we'll study that over the next several weeks. So what he saith to you do, you want food? There's the source, you go to him and whatever he says, that's what happens, right? But I want you to think about Joseph being a type and a picture of the Lord Jesus Christ. Whatsoever he saith to you, do. There's a athletic company that coined the phrase, just do it. No doubt you've heard that at some point over your life. When you think about this phrase, what he saith to you do, it reminds me of the Lord Jesus Christ in John chapter two. Turn to the book of John, if you will, the gospel of John. Of course, John chapter number one announces with, I mean, just great authority, the person of the Lord Jesus Christ and that he is God in flesh. I mean, what a powerful, powerful introduction that we receive in the gospel of John in the first chapter. And we come to the second chapter, and we find that this is the first miracle of the Lord Jesus Christ. In verse 11, it says, this beginning of miracles did Jesus in Cana of Galilee. And we find that in this particular text of scripture, and I'm not gonna take the time to deal with the entirety of the miracle and what have you, but I wanna hone in on verse number five and look at that phrase that Mary, the mother of Jesus says to those servants that are gathered together to provide some assistance, if you will. And we find that it's very similar to what Pharaoh says to the people of Egypt. And here's what the mother of Jesus, Mary says, notice in verse number five, his mother saith unto the servants, whatsoever he saith unto you, do it. Whatsoever he saith unto you, do it. You know, the reality is sometimes we just have a hard time with that because we wanna do things our way. We wanna do things the way we wanna do things. We've heard another way, we've heard, maybe we've gotten counsel from some other source and what have you, but we find that even, listen, I sat in my office 11 years ago, no one here would even know the person that I was speaking to. And it was a mess of a situation, all sorts of crazy stuff, stuff I never even had thought happened. I'll be honest with you. I thought, what in the world? I'm sitting in my office, I'm like, is this real? Like, seriously? I didn't even know stuff like this happened. It was absolutely amazing. And I said, here's the, and they were trying to tell me how right they were with God and all this stuff. It was crazy. And I said, well, let me just ask you this. Are you doing everything God's telling you to do? Oh, yeah. I said, no, like whatsoever he sayeth, you do it. Oh, yeah, all of it. The guy was just lying straight out of his teeth, right? But the reality is that for us as God's people, we go to God for counsel and whatsoever he sayeth, we do it. You say, but it doesn't make sense. No, no, God's way doesn't always make sense. And let me say this, God's way doesn't have to make sense. Amen? Sometimes, and listen, those of us that are more logical and what have you and have that analytical type of a mind, sometimes we struggle with that, why? Because we want things to make sense. And God's ways are not our ways. Amen? And God says, do it. And this evening, when we think about the time of crisis, the time of great difficulty, the time of great distress, to whom do we go? To whom do we cry? See, we see what happened in Genesis 41 when those seven years of dearth began. It was immediate and severe. We find that the people, they cried out, and I understand why they cried out. They cried out to Pharaoh. And Pharaoh and Ensign said, I can't help you. Go to Joseph, and whatsoever he sayeth, do it. What he sayeth to you, do. If we look at these types this evening, for us in 2023, almost 2024 now, we have times of crisis and difficulty. To whom do we flee? To whom do we go? Don't go to Egypt. Don't go to the world. The world doesn't have anything to offer you. Go to God. Seek God. And whatever God says, do it. Do it. You know that we do not have to pray about what God has revealed for us to do in his word. You know what I mean by that? When God tells us to do something, we don't say, well, you know, I'm gonna pray about that. When God says that we're to rejoice in everything, give thanks for this will of God and Christ Jesus concerning you, I'm gonna pray about that. No, no, no, just do it. Amen? You don't have to pray about whether you're gonna, you don't have to pray about whether you're gonna give. You don't have to pray whether you're gonna go to church. You don't have to pray. We're commanded to do those things. We don't pray about the commands. Does that make sense? We just do them. We just obey. And God will bless. See, God's way is not always our way. But you know what God wants us to do? He wants us to trust him. He is the almighty. He is the one that spoke everything into existence. He is the one that saved your soul. You understand that there's nothing you can do tonight to get to heaven on your own. We all agree on that. There's nothing we can do to get to heaven on our own. We need Jesus. Would you agree? But you know what happens sometimes for living tomorrow? We think, I got this. I can handle tomorrow. I mean, I can't handle eternity, but I can handle tomorrow. I can handle this week. And we live independently of God. And that just makes zero sense. Listen, if you can trust him with your eternal destiny, you can trust him with your tomorrow. Amen? If you can trust him with your eternal destiny, you can trust him with tomorrow. Whatsoever he sayeth unto you, do it. To whom do we cry? To whom do we go in times of crisis? We all face them. We all have times of great difficulty. And I hope tonight that we run to the cross. that we run to the Lord Jesus Christ and we say, Lord, help me. You ever read Psalm 12? Help, Lord. That's how it begins. You know, sometimes that's all we can pray. Help, Lord. I just need help and I know that you're the helper and you said that you would give us help. Aren't you so thankful that we have a wonderful Savior and He offers to give us the counsel, the direction that we need. He's our shepherd and as our shepherd, He takes good care of His sheep. Let's pray this evening. Father, we love You. We thank You for loving us. We thank You for Your Word, the truth contained therein. I pray that even as we look at this historical event, this time in Egypt when Joseph is there and this famine begins and the land is famished, Lord, I pray that tonight as we can understand the historical context of this event that we also would be able to make application in our lives. Lord, I pray that You'd help us tonight to run to You in times of difficulty, of great need, of great distress, times of crisis. Help us, Lord, not to run to the world, the world system. Help us, Lord, to trust You, to obey You. I pray that You'd help us, Lord, to be doers of the Word and not hearers only. Help us to have a heart of surrender and submission to You and to Your Word. I pray that in these few moments of invitation that You'd have Your will and way that You would move and work in hearts and lives as only You can. We'll thank You for what You'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.0,
      "text": " That was just free tonight, amen, just an addendum to the song."
    },
    {
      "id": 1,
      "start": 4.0,
      "end": 7.0,
      "text": " Genesis chapter 41, we're going to finish this chapter tonight."
    },
    {
      "id": 2,
      "start": 7.0,
      "end": 12.0,
      "text": " And someone misunderstood me this morning and thought I was finishing the life of Joseph tonight."
    },
    {
      "id": 3,
      "start": 12.0,
      "end": 16.0,
      "text": " But just chapter 41, just this section of the life of Joseph."
    },
    {
      "id": 4,
      "start": 16.0,
      "end": 22.0,
      "text": " And we got lots of chapters left here through the end of the book of Genesis chapter 50."
    },
    {
      "id": 5,
      "start": 22.0,
      "end": 26.0,
      "text": " But we look at Genesis chapter 41, we spent a few weeks in this particular chapter."
    },
    {
      "id": 6,
      "start": 26.0,
      "end": 31.0,
      "text": " It is a lengthy chapter, it's 57 verses, and a lot of things happen."
    },
    {
      "id": 7,
      "start": 31.0,
      "end": 36.0,
      "text": " I mean, it is a chapter that is filled with information."
    },
    {
      "id": 8,
      "start": 36.0,
      "end": 42.0,
      "text": " And if you think about the life of Joseph and where we've been the last couple of weeks as we've studied through Genesis 41,"
    },
    {
      "id": 9,
      "start": 42.0,
      "end": 46.0,
      "text": " we find that those first seven years after Joseph is promoted,"
    },
    {
      "id": 10,
      "start": 46.0,
      "end": 52.0,
      "text": " we'll give him the title this evening as Prime Minister over Egypt, if we could use that terminology tonight."
    },
    {
      "id": 11,
      "start": 52.0,
      "end": 56.0,
      "text": " And I understand the Bible doesn't say that, it says that he's second in charge, second in command."
    },
    {
      "id": 12,
      "start": 56.0,
      "end": 59.0,
      "text": " But if we could use that terminology, he's set in that place."
    },
    {
      "id": 13,
      "start": 59.0,
      "end": 63.0,
      "text": " Pharaoh had made him ruler over all the land of Egypt."
    },
    {
      "id": 14,
      "start": 63.0,
      "end": 68.0,
      "text": " And as Joseph is promoted to that place, that position of Prime Minister,"
    },
    {
      "id": 15,
      "start": 68.0,
      "end": 74.0,
      "text": " we find that those first seven years after he reaches that place, that position,"
    },
    {
      "id": 16,
      "start": 74.0,
      "end": 80.0,
      "text": " are described for us in verse 29 of Genesis 41 as being great plenty."
    },
    {
      "id": 17,
      "start": 80.0,
      "end": 81.0,
      "text": " Notice what the Bible says."
    },
    {
      "id": 18,
      "start": 81.0,
      "end": 86.0,
      "text": " Behold, there come seven years, not just seven years of plenty,"
    },
    {
      "id": 19,
      "start": 86.0,
      "end": 90.0,
      "text": " but the Bible says seven years of great plenty."
    },
    {
      "id": 20,
      "start": 90.0,
      "end": 97.0,
      "text": " And throughout all the land of Egypt, I believe that for those seven years of great plenty,"
    },
    {
      "id": 21,
      "start": 97.0,
      "end": 102.0,
      "text": " they reaped a harvest that was unlike anything they had ever experienced in their lives."
    },
    {
      "id": 22,
      "start": 102.0,
      "end": 107.0,
      "text": " I believe that as they were going through and reaping during those seven years,"
    },
    {
      "id": 23,
      "start": 107.0,
      "end": 110.0,
      "text": " there were probably comments that would be made of,"
    },
    {
      "id": 24,
      "start": 110.0,
      "end": 114.0,
      "text": " man, we've never had a harvest like this before, and so on and so forth."
    },
    {
      "id": 25,
      "start": 114.0,
      "end": 117.0,
      "text": " And there's seven years of great plenty."
    },
    {
      "id": 26,
      "start": 117.0,
      "end": 124.0,
      "text": " We find that during those seven years, they are filled with a number of changes in the life of Joseph."
    },
    {
      "id": 27,
      "start": 124.0,
      "end": 128.0,
      "text": " Remember, when we started Genesis 41, he's in prison."
    },
    {
      "id": 28,
      "start": 128.0,
      "end": 132.0,
      "text": " He interprets the dream, he's placed in that position, and the seven years begin."
    },
    {
      "id": 29,
      "start": 133.0,
      "end": 137.0,
      "text": " And we spoke about those seven years of great plenty last week."
    },
    {
      "id": 30,
      "start": 137.0,
      "end": 142.0,
      "text": " And so we see that Joseph, just in Genesis 41, he has a new position."
    },
    {
      "id": 31,
      "start": 142.0,
      "end": 146.0,
      "text": " I would say that he has a new home, a palace, a new place to live."
    },
    {
      "id": 32,
      "start": 146.0,
      "end": 149.0,
      "text": " He is no longer there in the prison house."
    },
    {
      "id": 33,
      "start": 149.0,
      "end": 153.0,
      "text": " He has a new wife, and he has two new sons."
    },
    {
      "id": 34,
      "start": 153.0,
      "end": 158.0,
      "text": " And we spoke about those sons last week, and as we looked at the names of those sons,"
    },
    {
      "id": 35,
      "start": 158.0,
      "end": 162.0,
      "text": " and we talked about being fruitful in the land of affliction."
    },
    {
      "id": 36,
      "start": 162.0,
      "end": 168.0,
      "text": " And even in the midst of affliction, we can have that fruitfulness that Joseph describes,"
    },
    {
      "id": 37,
      "start": 168.0,
      "end": 174.0,
      "text": " and it requires that we forget some things, and then we see how God has blessed."
    },
    {
      "id": 38,
      "start": 174.0,
      "end": 179.0,
      "text": " In addition to all of this, all of these changes in Genesis 41,"
    },
    {
      "id": 39,
      "start": 179.0,
      "end": 185.0,
      "text": " Joseph had the great responsibility to prepare the nation for those seven years of famine"
    },
    {
      "id": 40,
      "start": 185.0,
      "end": 191.0,
      "text": " that would be, according to verse number 30 and 31, very grievous and would consume the land."
    },
    {
      "id": 41,
      "start": 191.0,
      "end": 198.0,
      "text": " Notice we read in verse 29 that those seven years, they would be of great plenty throughout all the land of Egypt."
    },
    {
      "id": 42,
      "start": 198.0,
      "end": 201.0,
      "text": " But then notice in verse 30 of Genesis 41, it says,"
    },
    {
      "id": 43,
      "start": 201.0,
      "end": 206.0,
      "text": " And there shall arise after them seven years of famine, and all the plenty,"
    },
    {
      "id": 44,
      "start": 206.0,
      "end": 210.0,
      "text": " notice what it says, shall be forgotten in the land of Egypt."
    },
    {
      "id": 45,
      "start": 210.0,
      "end": 214.0,
      "text": " And the famine shall, notice it says, consume the land."
    },
    {
      "id": 46,
      "start": 214.0,
      "end": 219.0,
      "text": " The plenty shall not be known in the land by reason of the famine following,"
    },
    {
      "id": 47,
      "start": 219.0,
      "end": 222.0,
      "text": " for it shall be very grievous."
    },
    {
      "id": 48,
      "start": 222.0,
      "end": 228.0,
      "text": " And of course, God had given Joseph the wisdom that was necessary in order to give counsel to Pharaoh"
    },
    {
      "id": 49,
      "start": 228.0,
      "end": 232.0,
      "text": " with regard to what to do because of this dream that had been interpreted."
    },
    {
      "id": 50,
      "start": 232.0,
      "end": 236.0,
      "text": " And as we kind of skip into our passage this evening,"
    },
    {
      "id": 51,
      "start": 236.0,
      "end": 240.0,
      "text": " and we begin to think about the plan that God had given Joseph,"
    },
    {
      "id": 52,
      "start": 240.0,
      "end": 246.0,
      "text": " we would see that as God gave Joseph that great wisdom, that his plan was effective."
    },
    {
      "id": 53,
      "start": 246.0,
      "end": 249.0,
      "text": " We are told that Joseph went throughout all the land."
    },
    {
      "id": 54,
      "start": 249.0,
      "end": 256.0,
      "text": " In verse number 49, it tells us that he laid up that food."
    },
    {
      "id": 55,
      "start": 256.0,
      "end": 261.0,
      "text": " In fact, at the end of verse number 45, it says that Joseph went out over all the land of Egypt."
    },
    {
      "id": 56,
      "start": 261.0,
      "end": 266.0,
      "text": " At the end of verse number 46, it says that he, Joseph, went out from the presence of Pharaoh"
    },
    {
      "id": 57,
      "start": 266.0,
      "end": 268.0,
      "text": " and went throughout all the land of Egypt."
    },
    {
      "id": 58,
      "start": 268.0,
      "end": 271.0,
      "text": " And it was during those seven plenteous years,"
    },
    {
      "id": 59,
      "start": 271.0,
      "end": 275.0,
      "text": " those years that were described in verse number 29 as being great plenty,"
    },
    {
      "id": 60,
      "start": 275.0,
      "end": 280.0,
      "text": " that Joseph went out and he gathered up, according to verse number 48,"
    },
    {
      "id": 61,
      "start": 280.0,
      "end": 283.0,
      "text": " all the food of the seven years which were in the land of Egypt."
    },
    {
      "id": 62,
      "start": 283.0,
      "end": 287.0,
      "text": " And he laid up the food in the cities, the food of the field, which was round about every city,"
    },
    {
      "id": 63,
      "start": 287.0,
      "end": 289.0,
      "text": " laid he up in the same."
    },
    {
      "id": 64,
      "start": 289.0,
      "end": 294.0,
      "text": " And verse 49 tells us, and Joseph gathered corn as the sand of the sea very much"
    },
    {
      "id": 65,
      "start": 294.0,
      "end": 298.0,
      "text": " until he left numbering, for it was without number."
    },
    {
      "id": 66,
      "start": 298.0,
      "end": 304.0,
      "text": " In these great days of plenty, Joseph was faithful to do what God had revealed to him."
    },
    {
      "id": 67,
      "start": 304.0,
      "end": 309.0,
      "text": " He was faithful to complete the task that he had been entrusted with by Pharaoh"
    },
    {
      "id": 68,
      "start": 309.0,
      "end": 311.0,
      "text": " on storing up during those seven years."
    },
    {
      "id": 69,
      "start": 311.0,
      "end": 317.0,
      "text": " Remember, God had given Joseph the wisdom to be able to provide that counsel"
    },
    {
      "id": 70,
      "start": 317.0,
      "end": 321.0,
      "text": " as to what should take place during those seven years of great plenty."
    },
    {
      "id": 71,
      "start": 321.0,
      "end": 326.0,
      "text": " According to verse number 34, they were to take up 20% of that which was produced"
    },
    {
      "id": 72,
      "start": 326.0,
      "end": 332.0,
      "text": " during those years of great plenty and store it so that they would have food during the famine."
    },
    {
      "id": 73,
      "start": 332.0,
      "end": 336.0,
      "text": " We find that this plan was effective. Why was it effective?"
    },
    {
      "id": 74,
      "start": 336.0,
      "end": 340.0,
      "text": " Well, because it was God's plan and God had revealed it to Joseph."
    },
    {
      "id": 75,
      "start": 340.0,
      "end": 344.0,
      "text": " And the effectiveness of the plan is seen throughout the portion of Scripture."
    },
    {
      "id": 76,
      "start": 344.0,
      "end": 348.0,
      "text": " But we see that those days of great plenty ended."
    },
    {
      "id": 77,
      "start": 348.0,
      "end": 352.0,
      "text": " And as we enter into our text of Scripture this evening, in verse number 53,"
    },
    {
      "id": 78,
      "start": 352.0,
      "end": 356.0,
      "text": " notice what the Bible says, and we'll look at verse 53 down through the end of the chapter."
    },
    {
      "id": 79,
      "start": 356.0,
      "end": 363.0,
      "text": " The Bible says, and the seven years of plenteousness that was in the land of Egypt were ended."
    },
    {
      "id": 80,
      "start": 363.0,
      "end": 365.0,
      "text": " They were ended."
    },
    {
      "id": 81,
      "start": 365.0,
      "end": 372.0,
      "text": " And it says in verse number 54, and the seven years of dearth began to come."
    },
    {
      "id": 82,
      "start": 372.0,
      "end": 380.0,
      "text": " According as Joseph had said, the dearth was in all lands, but in all the lands of Egypt there was bread."
    },
    {
      "id": 83,
      "start": 380.0,
      "end": 384.0,
      "text": " When all the land of Egypt was famished, the people cried to Pharaoh for bread,"
    },
    {
      "id": 84,
      "start": 384.0,
      "end": 390.0,
      "text": " and Pharaoh said unto all the Egyptians, Go unto Joseph, what he saith to you, do."
    },
    {
      "id": 85,
      "start": 390.0,
      "end": 394.0,
      "text": " And the famine was over all the face of the earth, and Joseph opened all the storehouses"
    },
    {
      "id": 86,
      "start": 394.0,
      "end": 398.0,
      "text": " and sold unto the Egyptians, and the famine waxed sore in the land of Egypt,"
    },
    {
      "id": 87,
      "start": 398.0,
      "end": 402.0,
      "text": " and all countries came unto Egypt to Joseph for to buy corn,"
    },
    {
      "id": 88,
      "start": 402.0,
      "end": 406.0,
      "text": " because the famine was so sore in all lands."
    },
    {
      "id": 89,
      "start": 406.0,
      "end": 412.0,
      "text": " I've titled the message from verse number 54 this evening, the seven years of dearth began."
    },
    {
      "id": 90,
      "start": 412.0,
      "end": 414.0,
      "text": " The seven years of dearth began."
    },
    {
      "id": 91,
      "start": 414.0,
      "end": 417.0,
      "text": " We notice as we conclude the chapter, I just read the verses,"
    },
    {
      "id": 92,
      "start": 417.0,
      "end": 421.0,
      "text": " but God reveals to us really in verse 56 and verse number 57,"
    },
    {
      "id": 93,
      "start": 421.0,
      "end": 425.0,
      "text": " how this circumstance, this great famine that was upon the land,"
    },
    {
      "id": 94,
      "start": 425.0,
      "end": 430.0,
      "text": " that was described as being very grievous, that would consume the land,"
    },
    {
      "id": 95,
      "start": 430.0,
      "end": 435.0,
      "text": " that God reveals to us how this would be the catalyst, if you will,"
    },
    {
      "id": 96,
      "start": 435.0,
      "end": 440.0,
      "text": " that would eventually bring Jacob and his family into the land of Egypt."
    },
    {
      "id": 97,
      "start": 440.0,
      "end": 446.0,
      "text": " Because the Bible says that all countries, verse 57, came into Egypt to Joseph for to buy corn,"
    },
    {
      "id": 98,
      "start": 446.0,
      "end": 450.0,
      "text": " because the famine was so sore, notice, in all lands."
    },
    {
      "id": 99,
      "start": 451.0,
      "end": 454.0,
      "text": " Now, it's kind of interesting, if you look at the end of verse number 57,"
    },
    {
      "id": 100,
      "start": 454.0,
      "end": 458.0,
      "text": " before we get into the message this evening, notice that little word, so."
    },
    {
      "id": 101,
      "start": 458.0,
      "end": 460.0,
      "text": " We're familiar with that when we read John 3, 16,"
    },
    {
      "id": 102,
      "start": 460.0,
      "end": 463.0,
      "text": " for God so loved the world."
    },
    {
      "id": 103,
      "start": 463.0,
      "end": 466.0,
      "text": " And you think about the impact when God is explaining to us"
    },
    {
      "id": 104,
      "start": 466.0,
      "end": 470.0,
      "text": " the terribleness, if you will, of this famine."
    },
    {
      "id": 105,
      "start": 470.0,
      "end": 475.0,
      "text": " This is because the famine was so sore in all lands."
    },
    {
      "id": 106,
      "start": 475.0,
      "end": 478.0,
      "text": " As you enter into the 42nd chapter, you find that the Bible tells us"
    },
    {
      "id": 107,
      "start": 478.0,
      "end": 481.0,
      "text": " that Jacob saw that there was corn in Egypt."
    },
    {
      "id": 108,
      "start": 481.0,
      "end": 484.0,
      "text": " And again, God would use this circumstance as really a catalyst"
    },
    {
      "id": 109,
      "start": 484.0,
      "end": 488.0,
      "text": " that would eventually bring Jacob and his family into the land of Egypt."
    },
    {
      "id": 110,
      "start": 488.0,
      "end": 492.0,
      "text": " And it's a time in which Joseph eventually would reveal his person,"
    },
    {
      "id": 111,
      "start": 492.0,
      "end": 495.0,
      "text": " his identity to his brothers, and he would say this,"
    },
    {
      "id": 112,
      "start": 495.0,
      "end": 501.0,
      "text": " God sent me before you for what purpose? To preserve life."
    },
    {
      "id": 113,
      "start": 501.0,
      "end": 506.0,
      "text": " And God was using Joseph in this land of affliction, as he refers to it in verse number 52,"
    },
    {
      "id": 114,
      "start": 506.0,
      "end": 509.0,
      "text": " but God was using him and God had a purpose."
    },
    {
      "id": 115,
      "start": 509.0,
      "end": 512.0,
      "text": " And I want you to think about these seven years of famine,"
    },
    {
      "id": 116,
      "start": 512.0,
      "end": 515.0,
      "text": " and as we've looked at the title, the seven years of dearth began."
    },
    {
      "id": 117,
      "start": 515.0,
      "end": 518.0,
      "text": " Consider just a couple of things with me this evening."
    },
    {
      "id": 118,
      "start": 518.0,
      "end": 521.0,
      "text": " Number one, I want you to consider with me the cry of the people."
    },
    {
      "id": 119,
      "start": 521.0,
      "end": 522.0,
      "text": " The cry of the people."
    },
    {
      "id": 120,
      "start": 522.0,
      "end": 525.0,
      "text": " As we notice in verse number 55 of our text of Scripture,"
    },
    {
      "id": 121,
      "start": 525.0,
      "end": 528.0,
      "text": " the Bible gives us a description. It's a dim description."
    },
    {
      "id": 122,
      "start": 528.0,
      "end": 531.0,
      "text": " The Bible had told us, and we spent some time looking"
    },
    {
      "id": 123,
      "start": 531.0,
      "end": 536.0,
      "text": " and reminding ourselves of what we've studied throughout this 41st chapter already,"
    },
    {
      "id": 124,
      "start": 536.0,
      "end": 539.0,
      "text": " but we find that the Bible told us in verse number 30"
    },
    {
      "id": 125,
      "start": 539.0,
      "end": 544.0,
      "text": " that those years of famine would rise, and then notice what it says in verse number 30,"
    },
    {
      "id": 126,
      "start": 544.0,
      "end": 548.0,
      "text": " and all the plenty, notice what it says, shall be forgotten."
    },
    {
      "id": 127,
      "start": 548.0,
      "end": 552.0,
      "text": " Now think about that, because during those seven years of great plenty,"
    },
    {
      "id": 128,
      "start": 552.0,
      "end": 556.0,
      "text": " as it's described in verse 29, I believe again that many were saying,"
    },
    {
      "id": 129,
      "start": 556.0,
      "end": 560.0,
      "text": " we've never had a harvest like this, but then when that great famine comes,"
    },
    {
      "id": 130,
      "start": 560.0,
      "end": 565.0,
      "text": " those years of great plenty are forgotten."
    },
    {
      "id": 131,
      "start": 565.0,
      "end": 569.0,
      "text": " And why are they forgotten? Well, because it's severe, it's grievous,"
    },
    {
      "id": 132,
      "start": 569.0,
      "end": 571.0,
      "text": " it's going to consume the land."
    },
    {
      "id": 133,
      "start": 571.0,
      "end": 576.0,
      "text": " It's amazing what people will do when they have no food."
    },
    {
      "id": 134,
      "start": 576.0,
      "end": 580.0,
      "text": " It's amazing what people will do when there's no food."
    },
    {
      "id": 135,
      "start": 580.0,
      "end": 585.0,
      "text": " And we find that as we look at the cry of the people, notice what God tells us in verse number 55,"
    },
    {
      "id": 136,
      "start": 585.0,
      "end": 591.0,
      "text": " and when all the land of Egypt, what does it say, was famished, was famished."
    },
    {
      "id": 137,
      "start": 591.0,
      "end": 594.0,
      "text": " Sometimes our children will say, I'm starving."
    },
    {
      "id": 138,
      "start": 594.0,
      "end": 596.0,
      "text": " You ever hear your kids say that?"
    },
    {
      "id": 139,
      "start": 596.0,
      "end": 599.0,
      "text": " Maybe some of you wives, you've heard your husband say, I'm starving."
    },
    {
      "id": 140,
      "start": 599.0,
      "end": 600.0,
      "text": " And you're like, you could..."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 605.7600002288818,
      "text": " live for days without eating, right? Like, you are not starving, you're okay. I'm going to die,"
    },
    {
      "id": 1,
      "start": 605.7600002288818,
      "end": 611.8400001525879,
      "text": " I'm so hungry. No, we've never probably truly experienced that. But the reality is that God"
    },
    {
      "id": 2,
      "start": 611.8400001525879,
      "end": 619.6800003051758,
      "text": " tells us here that the land, and it says all the land of Egypt, was famished. And it reveals to us"
    },
    {
      "id": 3,
      "start": 619.6800003051758,
      "end": 624.8799991607666,
      "text": " as we think about that statement in verse number 55, as we enter into this portion of scripture,"
    },
    {
      "id": 4,
      "start": 624.8799991607666,
      "end": 633.5999984741211,
      "text": " it reveals to us that this famine was so severe that it had an immediate impact. I mean, when"
    },
    {
      "id": 5,
      "start": 633.5999984741211,
      "end": 640.6399993896484,
      "text": " those, can you imagine, and God is in this, right? See, our God is the creator. This idea of mother"
    },
    {
      "id": 6,
      "start": 640.6399993896484,
      "end": 645.1199989318848,
      "text": " nature, no, no, God's in control of everything. God's the one that sends the rain, God's the one"
    },
    {
      "id": 7,
      "start": 645.1199989318848,
      "end": 650.9599990844727,
      "text": " that withholds the rain. In fact, for the children of Israel, they were told that God would send the"
    },
    {
      "id": 8,
      "start": 650.9599990844727,
      "end": 658.0800018310547,
      "text": " rain as a blessing, and that God would withhold the rain as judgment. Amen? And often, as you look"
    },
    {
      "id": 9,
      "start": 658.0800018310547,
      "end": 664.9599990844727,
      "text": " throughout the scriptures, you find that times, periods of drought and famine, were the direct"
    },
    {
      "id": 10,
      "start": 664.9599990844727,
      "end": 672.4800033569336,
      "text": " result of God's divine judgment upon his people. And so God brings this famine. He had revealed it,"
    },
    {
      "id": 11,
      "start": 672.4800033569336,
      "end": 677.1999969482422,
      "text": " of course, in his grace and his mercy, through this dream that Pharaoh has, and Joseph is able"
    },
    {
      "id": 12,
      "start": 677.1999969482422,
      "end": 683.5999984741211,
      "text": " to interpret and give the counsel, but this particular famine had an immediate and severe"
    },
    {
      "id": 13,
      "start": 683.5999984741211,
      "end": 690.4000015258789,
      "text": " impact. The land, it says all the land of Egypt was famished, and then notice the Bible says that"
    },
    {
      "id": 14,
      "start": 690.4000015258789,
      "end": 699.5199966430664,
      "text": " the people, the people of Egypt, they cried to Pharaoh for bread. Over the next several weeks,"
    },
    {
      "id": 15,
      "start": 699.5199966430664,
      "end": 704.0800018310547,
      "text": " as we study throughout the next several portions of scripture in the book of Genesis, we'll see"
    },
    {
      "id": 16,
      "start": 704.0800018310547,
      "end": 710.0,
      "text": " to what extent people will go when they're hungry, what they will be willing to sell, and what they"
    },
    {
      "id": 17,
      "start": 710.0,
      "end": 715.6800003051758,
      "text": " will be willing to do, and in order to be able to get some food. It's no doubt in my mind, it's going"
    },
    {
      "id": 18,
      "start": 715.6800003051758,
      "end": 721.1999969482422,
      "text": " to be quite easy when things happen during the tribulation time, and they say, well, you're going"
    },
    {
      "id": 19,
      "start": 721.1999969482422,
      "end": 725.1999969482422,
      "text": " to need to have this mark right here if you want to have some food, if you want to be able to buy,"
    },
    {
      "id": 20,
      "start": 725.1999969482422,
      "end": 728.5599975585938,
      "text": " sell, or trade. It's going to be very, people are going to line up and say, where do you want to put"
    },
    {
      "id": 21,
      "start": 728.5599975585938,
      "end": 733.0399932861328,
      "text": " it? Which hand? Where out of my forehead? I mean, I'll take it, I'll have it in all three places. I"
    },
    {
      "id": 22,
      "start": 733.0399932861328,
      "end": 738.5599975585938,
      "text": " mean, people will really be that way. They'll be ready to do it, and we find here this evening, as"
    },
    {
      "id": 23,
      "start": 738.5599975585938,
      "end": 742.8000030517578,
      "text": " we continue, and again, over the next several weeks, we continue to look throughout the portions of"
    },
    {
      "id": 24,
      "start": 742.8000030517578,
      "end": 749.9199981689453,
      "text": " scripture here in the book of Genesis to see the depth of how this famine impacted the people,"
    },
    {
      "id": 25,
      "start": 749.9199981689453,
      "end": 755.7599945068359,
      "text": " but the people cried to Pharaoh for bread. I want you to think about this just for a moment. As we"
    },
    {
      "id": 26,
      "start": 755.7599945068359,
      "end": 760.3200073242188,
      "text": " think about the cry of the people, you know, in times of crisis, I believe that this here was a"
    },
    {
      "id": 27,
      "start": 760.3200073242188,
      "end": 764.8000030517578,
      "text": " time of crisis for the Egyptians. It was a time of crisis not only for the Egyptians, but we find"
    },
    {
      "id": 28,
      "start": 764.8000030517578,
      "end": 771.1999969482422,
      "text": " that for all of the world, because it affected not just Egypt, but all countries were impacted"
    },
    {
      "id": 29,
      "start": 771.1999969482422,
      "end": 776.8000030517578,
      "text": " because of this famine. In fact, in verse 56, it says, and the famine was over all the face of the earth."
    },
    {
      "id": 30,
      "start": 777.4400024414062,
      "end": 782.7200012207031,
      "text": " And we find that as this famine would impact, it was a time of great crisis, and you find that in a"
    },
    {
      "id": 31,
      "start": 782.7200012207031,
      "end": 790.5599975585938,
      "text": " time of crisis that people need direction. People need direction in time of crisis. People become"
    },
    {
      "id": 32,
      "start": 790.5599975585938,
      "end": 801.8399963378906,
      "text": " desperate in time of crisis. We think about time of crisis, and we see it here in this portion of"
    },
    {
      "id": 33,
      "start": 801.8399963378906,
      "end": 807.5200042724609,
      "text": " scripture, and we see the response of the people, and I wonder tonight, as we understand that the"
    },
    {
      "id": 34,
      "start": 807.5200042724609,
      "end": 813.1199951171875,
      "text": " people cry, and they cry to Pharaoh for bread, I wonder this evening in time of great distress,"
    },
    {
      "id": 35,
      "start": 813.1199951171875,
      "end": 818.5599975585938,
      "text": " in time of crisis, in time of great difficulty, to whom do we look? To whom do we cry?"
    },
    {
      "id": 36,
      "start": 820.8800048828125,
      "end": 827.0399932861328,
      "text": " Because we find that here, the Bible tells us that these folks, that they cried, the people cried"
    },
    {
      "id": 37,
      "start": 827.0399932861328,
      "end": 834.3999938964844,
      "text": " to Pharaoh for bread. They were desperate. They were in need. They were famished. They were hungry."
    },
    {
      "id": 38,
      "start": 835.3600006103516,
      "end": 842.0,
      "text": " Times of great desperation led them to a place where they were crying out to Pharaoh. As we look"
    },
    {
      "id": 39,
      "start": 842.0,
      "end": 846.7200012207031,
      "text": " at the text of scripture, we not only see the cry of the people, but we see, number two, the counsel"
    },
    {
      "id": 40,
      "start": 846.7200012207031,
      "end": 850.8000030517578,
      "text": " of Pharaoh. The counsel of Pharaoh. I want you to notice, and we're going to spend the remainder of"
    },
    {
      "id": 41,
      "start": 850.8000030517578,
      "end": 855.0399932861328,
      "text": " our time here on looking at the response of Pharaoh and what takes place. The Bible says,"
    },
    {
      "id": 42,
      "start": 855.0399932861328,
      "end": 860.1600036621094,
      "text": " and Pharaoh said unto all the Egyptians, notice what he says, notice the counsel that Pharaoh gives,"
    },
    {
      "id": 43,
      "start": 860.8800048828125,
      "end": 869.2000122070312,
      "text": " go unto Joseph, what he saith to you, do. Now I want you to think about Pharaoh. He is the,"
    },
    {
      "id": 44,
      "start": 869.8399963378906,
      "end": 877.0400085449219,
      "text": " he's the man in charge. Joseph is second in command. Pharaoh is the man in charge, and the"
    },
    {
      "id": 45,
      "start": 877.0400085449219,
      "end": 883.2799987792969,
      "text": " people cry unto Pharaoh and say, give us bread. They're desperate. They're pleading. They're"
    },
    {
      "id": 46,
      "start": 883.2799987792969,
      "end": 890.239990234375,
      "text": " crying for some help, and Pharaoh says, go to Joseph. And whatever Joseph says, what he saith to"
    },
    {
      "id": 47,
      "start": 890.239990234375,
      "end": 896.0799865722656,
      "text": " you, do. Now we have to back up, and I know this is review, but remember that back in verse number"
    },
    {
      "id": 48,
      "start": 896.0799865722656,
      "end": 902.8800048828125,
      "text": " 33, after Joseph interpreted the dream, Joseph begins to give this action plan, if you will,"
    },
    {
      "id": 49,
      "start": 902.8800048828125,
      "end": 907.6000061035156,
      "text": " to Pharaoh. And here's what he says, now therefore let Pharaoh look out a man, discreet and wise,"
    },
    {
      "id": 50,
      "start": 907.6000061035156,
      "end": 912.3999938964844,
      "text": " and send him over the land of Egypt. Let Pharaoh do this, and let him appoint officers over the"
    },
    {
      "id": 51,
      "start": 912.3999938964844,
      "end": 916.1600036621094,
      "text": " land, and take up the fifth part of the land of Egypt in the seven plenteous years. We're not"
    },
    {
      "id": 52,
      "start": 916.1600036621094,
      "end": 922.4800109863281,
      "text": " going to read all of it, but we find that Joseph is providing this counsel and instruction, and"
    },
    {
      "id": 53,
      "start": 922.4800109863281,
      "end": 929.8399963378906,
      "text": " Pharaoh concludes in verse number 38, he says to his servants, can we find such a one as this is,"
    },
    {
      "id": 54,
      "start": 930.5599975585938,
      "end": 939.2000122070312,
      "text": " a man in whom the Spirit of God is. And we find that Joseph is given this place of,"
    },
    {
      "id": 55,
      "start": 940.0,
      "end": 947.3599853515625,
      "text": " of power, of position. We mentioned last week how that Joseph was given a new name, and he was given"
    },
    {
      "id": 56,
      "start": 947.3599853515625,
      "end": 953.8399963378906,
      "text": " that new name, and we mentioned that, and that Pharaoh gave him that name, and the name is"
    },
    {
      "id": 57,
      "start": 953.8399963378906,
      "end": 958.3200073242188,
      "text": " recorded for us. Notice in verse number 42, and Pharaoh took off his ring from his hand, and put"
    },
    {
      "id": 58,
      "start": 958.3200073242188,
      "end": 964.0,
      "text": " it upon Joseph's hand, and arrayed him in vestures of fine linen, and put a gold chain about his neck,"
    },
    {
      "id": 59,
      "start": 964.0,
      "end": 968.3999938964844,
      "text": " and he made him to ride in the second chariot which he had. And they cried before him, bow the"
    },
    {
      "id": 60,
      "start": 968.3999938964844,
      "end": 974.0,
      "text": " knee, and he made him ruler over all the land of Egypt. And Pharaoh said unto Joseph, I am Pharaoh,"
    },
    {
      "id": 61,
      "start": 974.0,
      "end": 978.9599914550781,
      "text": " without thee shall no man lift up his hand or foot in all the land of Egypt. And Pharaoh called"
    },
    {
      "id": 62,
      "start": 978.9599914550781,
      "end": 984.4800109863281,
      "text": " Joseph's name Zaphnath-Paneah, and he gave him to wife Asenath. But we mentioned last week in"
    },
    {
      "id": 63,
      "start": 984.4800109863281,
      "end": 989.1199951171875,
      "text": " verse number 45, as you see that name, and again there's some level of debate with regard to what"
    },
    {
      "id": 64,
      "start": 989.1199951171875,
      "end": 996.239990234375,
      "text": " that name really means, and there's some debate and discussion amongst theologians and Jewish"
    },
    {
      "id": 65,
      "start": 996.239990234375,
      "end": 1003.2000122070312,
      "text": " rabbis with regard to that, but really it seems that the most likely interpretation of what that"
    },
    {
      "id": 66,
      "start": 1003.2000122070312,
      "end": 1011.5199890136719,
      "text": " name means is God speaks and he lives. God speaks and he lives, or and he giveth life. And you think"
    },
    {
      "id": 67,
      "start": 1011.5199890136719,
      "end": 1017.0400085449219,
      "text": " about what Pharaoh was recognizing in giving that name to Joseph. He could have named him whatever"
    },
    {
      "id": 68,
      "start": 1017.0400085449219,
      "end": 1024.239990234375,
      "text": " he wanted to name him. And because of what had transpired, we find that Pharaoh gives that name,"
    },
    {
      "id": 69,
      "start": 1024.239990234375,
      "end": 1032.4800109863281,
      "text": " and Joseph is now in this position, and when the people come and they cry there to Pharaoh for help,"
    },
    {
      "id": 70,
      "start": 1032.4800109863281,
      "end": 1039.2799987792969,
      "text": " and they cry because they want bread, this time of great difficulty, this time of when the land"
    },
    {
      "id": 71,
      "start": 1039.2799987792969,
      "end": 1048.4800109863281,
      "text": " is famished, and they cry for bread, and Pharaoh says, go unto Joseph. What he saith to you, do."
    },
    {
      "id": 72,
      "start": 1048.9599914550781,
      "end": 1054.1600036621094,
      "text": " Now this evening as we look at this portion of Scripture, and I don't always go this route,"
    },
    {
      "id": 73,
      "start": 1054.1600036621094,
      "end": 1060.5599975585938,
      "text": " but you find in the Bible there's a lot of types, typologies. And I believe that it's important"
    },
    {
      "id": 74,
      "start": 1060.5599975585938,
      "end": 1065.760009765625,
      "text": " this evening that we look at this and see the typology that the Lord is giving us. We see"
    },
    {
      "id": 75,
      "start": 1065.760009765625,
      "end": 1070.0799865722656,
      "text": " the interpretation, when we talk about hermeneutics and interpreting Scripture,"
    },
    {
      "id": 76,
      "start": 1070.0799865722656,
      "end": 1075.6799926757812,
      "text": " we see that at face value this is an event that happened in the land of Egypt. This famine was"
    },
    {
      "id": 77,
      "start": 1076.6400146484375,
      "end": 1082.6400146484375,
      "text": " real, the people were famished, the people had no bread, and they cry out for help, and Pharaoh says,"
    },
    {
      "id": 78,
      "start": 1082.6400146484375,
      "end": 1089.6000061035156,
      "text": " go to Joseph. And that's truly what happens, but there's typologies in the Bible. And I believe"
    },
    {
      "id": 79,
      "start": 1089.6000061035156,
      "end": 1092.9599914550781,
      "text": " this evening as we look at this portion of Scripture, and I want you to consider this with"
    },
    {
      "id": 80,
      "start": 1092.9599914550781,
      "end": 1097.9200134277344,
      "text": " me, we'll make some application in our own lives, but I want you to know and consider with me that"
    },
    {
      "id": 81,
      "start": 1098.0,
      "end": 1105.9200134277344,
      "text": " Egypt and Pharaoh are really types, and they represent the world and its system. You understand"
    },
    {
      "id": 82,
      "start": 1105.9200134277344,
      "end": 1112.4000244140625,
      "text": " that the world has a system. The Bible says that we're to be not conformed to this world,"
    },
    {
      "id": 83,
      "start": 1112.4000244140625,
      "end": 1116.0,
      "text": " but to be transformed by the renewing of our mind, that we may prove what is that good and"
    },
    {
      "id": 84,
      "start": 1116.0,
      "end": 1122.0,
      "text": " acceptable and perfect will of God in Romans chapter number 12. And we find that Egypt and"
    },
    {
      "id": 85,
      "start": 1122.0,
      "end": 1128.0,
      "text": " Pharaoh, as you study through the Old Testament, as you look into the typologies and you read into"
    },
    {
      "id": 86,
      "start": 1128.0,
      "end": 1134.1599731445312,
      "text": " even the New Testament, how that it's a picture, a type of the world and the world system. The world"
    },
    {
      "id": 87,
      "start": 1134.1599731445312,
      "end": 1138.3200073242188,
      "text": " still is in existence. The Bible tells us this, love not the world, neither the things that are"
    },
    {
      "id": 88,
      "start": 1138.3200073242188,
      "end": 1143.280029296875,
      "text": " in the world, right? And the world fadeth away, it passeth away. We understand that in 1 John chapter"
    },
    {
      "id": 89,
      "start": 1143.280029296875,
      "end": 1149.2000122070312,
      "text": " number 2. And so we find this evening that Egypt and Pharaoh, and we find that Pharaoh is the one"
    },
    {
      "id": 90,
      "start": 1149.2000122070312,
      "end": 1153.9199829101562,
      "text": " that's addressed. And so these people that are famished, these people that are in great distress,"
    },
    {
      "id": 91,
      "start": 1153.9199829101562,
      "end": 1158.239990234375,
      "text": " this time of great crisis when people are desperate and they're looking for direction,"
    },
    {
      "id": 92,
      "start": 1158.239990234375,
      "end": 1161.6799926757812,
      "text": " they're looking for leadership, where do they go? Well, they go to Pharaoh. It makes sense."
    },
    {
      "id": 93,
      "start": 1163.280029296875,
      "end": 1170.4000244140625,
      "text": " You know what Pharaoh says? I can't help you. In essence, what Pharaoh says is, I can't help you."
    },
    {
      "id": 94,
      "start": 1171.3599853515625,
      "end": 1179.9199829101562,
      "text": " Go to Joseph. There was nothing that he could do. Joseph is a type of the Lord Jesus Christ."
    },
    {
      "id": 95,
      "start": 1181.2000122070312,
      "end": 1186.5599975585938,
      "text": " Now understand this evening, he's not the Lord Jesus Christ. He's simply a type of the Lord"
    },
    {
      "id": 96,
      "start": 1186.5599975585938,
      "end": 1192.0800170898438,
      "text": " Jesus Christ. And as we study, we have the opportunity through these types and typologies"
    },
    {
      "id": 97,
      "start": 1192.0800170898438,
      "end": 1196.1599731445312,
      "text": " in the Old Testament, you have opportunity to see these glimpses and to see these truths."
    },
    {
      "id": 98,
      "start": 1196.1599731445312,
      "end": 1199.9199829101562,
      "text": " And we find this evening that Joseph is a type of the Lord."
    },
    {
      "id": 0,
      "start": 1199.9199829101562,
      "end": 1204.9199829101562,
      "text": " And so we find this evening that if Egypt and Pharaoh represent the world and its system,"
    },
    {
      "id": 1,
      "start": 1204.9199829101562,
      "end": 1208.9199829101562,
      "text": " and Joseph represents or is a type of the Lord Jesus Christ,"
    },
    {
      "id": 2,
      "start": 1208.9199829101562,
      "end": 1213.9199829101562,
      "text": " and we begin to make application from this portion of Scripture tonight in our lives,"
    },
    {
      "id": 3,
      "start": 1213.9199829101562,
      "end": 1217.9199829101562,
      "text": " understand tonight that you're going to face times of crisis."
    },
    {
      "id": 4,
      "start": 1217.9199829101562,
      "end": 1222.9199829101562,
      "text": " You're gonna face times of great difficulty, of distress, of being overwhelmed,"
    },
    {
      "id": 5,
      "start": 1222.9199829101562,
      "end": 1227.9199829101562,
      "text": " and needing direction, and desiring for someone to provide for something"
    },
    {
      "id": 6,
      "start": 1227.9199829101562,
      "end": 1229.9199829101562,
      "text": " that you have need of."
    },
    {
      "id": 7,
      "start": 1229.9199829101562,
      "end": 1233.9199829101562,
      "text": " And the question, as we mentioned in that first point, the cry of the people,"
    },
    {
      "id": 8,
      "start": 1233.9199829101562,
      "end": 1236.9199829101562,
      "text": " to whom do we look? To whom do we go?"
    },
    {
      "id": 9,
      "start": 1236.9199829101562,
      "end": 1238.9199829101562,
      "text": " Notice what happens if you think about God's people."
    },
    {
      "id": 10,
      "start": 1238.9199829101562,
      "end": 1242.9199829101562,
      "text": " Turn to the book of Isaiah, if you will, and go to Isaiah chapter number 30."
    },
    {
      "id": 11,
      "start": 1242.9199829101562,
      "end": 1245.9199829101562,
      "text": " We're gonna look at a couple of passages here in the book of Isaiah,"
    },
    {
      "id": 12,
      "start": 1245.9199829101562,
      "end": 1249.9199829101562,
      "text": " and then we're gonna go to the New Testament and make some final application this evening."
    },
    {
      "id": 13,
      "start": 1249.9199829101562,
      "end": 1253.9199829101562,
      "text": " But I want you to consider, as we look at this historical event,"
    },
    {
      "id": 14,
      "start": 1253.9199829101562,
      "end": 1258.9199829101562,
      "text": " this recorded event that took place in the life of Joseph,"
    },
    {
      "id": 15,
      "start": 1258.9199829101562,
      "end": 1263.9199829101562,
      "text": " but how it applies for us tonight in our own lives."
    },
    {
      "id": 16,
      "start": 1263.9199829101562,
      "end": 1269.9199829101562,
      "text": " In Isaiah chapter number 30,"
    },
    {
      "id": 17,
      "start": 1269.9199829101562,
      "end": 1275.9199829101562,
      "text": " the Bible says this in verse number 1, Isaiah 30 and verse number 1,"
    },
    {
      "id": 18,
      "start": 1275.9199829101562,
      "end": 1280.9199829101562,
      "text": " Woe to the rebellious children, saith the Lord,"
    },
    {
      "id": 19,
      "start": 1280.9199829101562,
      "end": 1287.9199829101562,
      "text": " that take counsel, but then notice these words, but not of me."
    },
    {
      "id": 20,
      "start": 1287.9199829101562,
      "end": 1291.9199829101562,
      "text": " But take counsel, but not of me."
    },
    {
      "id": 21,
      "start": 1291.9199829101562,
      "end": 1296.9199829101562,
      "text": " And that cover with a covering, but not of my spirit,"
    },
    {
      "id": 22,
      "start": 1296.9199829101562,
      "end": 1300.9199829101562,
      "text": " that they may add sin to sin."
    },
    {
      "id": 23,
      "start": 1300.9199829101562,
      "end": 1304.9199829101562,
      "text": " Notice verse number 2, that walk to go down into where?"
    },
    {
      "id": 24,
      "start": 1304.9199829101562,
      "end": 1307.9199829101562,
      "text": " Egypt. It's a picture of what? It's a type of what?"
    },
    {
      "id": 25,
      "start": 1307.9199829101562,
      "end": 1310.9199829101562,
      "text": " The world and the world system."
    },
    {
      "id": 26,
      "start": 1310.9199829101562,
      "end": 1317.9199829101562,
      "text": " And then notice this last phrase, and have not asked at my mouth."
    },
    {
      "id": 27,
      "start": 1317.9199829101562,
      "end": 1322.9199829101562,
      "text": " Can you imagine? It's just to strengthen themselves in the strength of who?"
    },
    {
      "id": 28,
      "start": 1322.9199829101562,
      "end": 1324.9199829101562,
      "text": " Pharaoh."
    },
    {
      "id": 29,
      "start": 1324.9199829101562,
      "end": 1328.9199829101562,
      "text": " And to trust in the shadow of Egypt."
    },
    {
      "id": 30,
      "start": 1328.9199829101562,
      "end": 1333.9199829101562,
      "text": " So who is Isaiah prophesying to? He's prophesying to God's people."
    },
    {
      "id": 31,
      "start": 1333.9199829101562,
      "end": 1337.9199829101562,
      "text": " To the children of Israel. He's prophesying to them."
    },
    {
      "id": 32,
      "start": 1337.9199829101562,
      "end": 1341.9199829101562,
      "text": " And he's saying, woe to the rebellious children."
    },
    {
      "id": 33,
      "start": 1341.9199829101562,
      "end": 1345.9199829101562,
      "text": " Why is this woe being given? And understand that it says, saith the Lord."
    },
    {
      "id": 34,
      "start": 1345.9199829101562,
      "end": 1350.9199829101562,
      "text": " Isaiah is the human prophet, but he's delivering the message that God has given."
    },
    {
      "id": 35,
      "start": 1350.9199829101562,
      "end": 1354.9199829101562,
      "text": " And he says that you're taking counsel, but not of me."
    },
    {
      "id": 36,
      "start": 1354.9199829101562,
      "end": 1358.9199829101562,
      "text": " And then he provides further insight as to what they were really doing"
    },
    {
      "id": 37,
      "start": 1358.9199829101562,
      "end": 1361.9199829101562,
      "text": " and how they were operating, so that they couldn't say,"
    },
    {
      "id": 38,
      "start": 1361.9199829101562,
      "end": 1364.9199829101562,
      "text": " what are you talking about? We're not taking counsel. No, here's what you're doing."
    },
    {
      "id": 39,
      "start": 1364.9199829101562,
      "end": 1368.9199829101562,
      "text": " You're running down to Egypt."
    },
    {
      "id": 40,
      "start": 1368.9199829101562,
      "end": 1370.9199829101562,
      "text": " To the world."
    },
    {
      "id": 41,
      "start": 1370.9199829101562,
      "end": 1375.9199829101562,
      "text": " And then notice what he says, and this is so powerful in my mind,"
    },
    {
      "id": 42,
      "start": 1375.9199829101562,
      "end": 1378.9199829101562,
      "text": " and I hope that we grasp the concept this evening."
    },
    {
      "id": 43,
      "start": 1378.9199829101562,
      "end": 1383.9199829101562,
      "text": " It says this, and have not asked at my mouth."
    },
    {
      "id": 44,
      "start": 1383.9199829101562,
      "end": 1387.9199829101562,
      "text": " I said this this morning as I was preaching on the subject of prayer."
    },
    {
      "id": 45,
      "start": 1387.9199829101562,
      "end": 1392.9199829101562,
      "text": " I said it's a wonderful truth to know that God hears and answers prayer."
    },
    {
      "id": 46,
      "start": 1392.9199829101562,
      "end": 1397.9199829101562,
      "text": " But to know that he hears and answers prayer and not pray,"
    },
    {
      "id": 47,
      "start": 1397.9199829101562,
      "end": 1400.9199829101562,
      "text": " just doesn't make sense."
    },
    {
      "id": 48,
      "start": 1400.9199829101562,
      "end": 1403.9199829101562,
      "text": " It's of no help. Would you agree?"
    },
    {
      "id": 49,
      "start": 1403.9199829101562,
      "end": 1406.9199829101562,
      "text": " God hears and answers prayer, but I don't pray."
    },
    {
      "id": 50,
      "start": 1406.9199829101562,
      "end": 1409.9199829101562,
      "text": " Well, that doesn't even make sense."
    },
    {
      "id": 51,
      "start": 1409.9199829101562,
      "end": 1412.9199829101562,
      "text": " And here the Bible says that the people of God,"
    },
    {
      "id": 52,
      "start": 1412.9199829101562,
      "end": 1415.9199829101562,
      "text": " the children, the rebellious children as they're described here,"
    },
    {
      "id": 53,
      "start": 1415.9199829101562,
      "end": 1419.9199829101562,
      "text": " that they have not asked at my mouth."
    },
    {
      "id": 54,
      "start": 1419.9199829101562,
      "end": 1422.9199829101562,
      "text": " What if they just would have asked for counsel?"
    },
    {
      "id": 55,
      "start": 1422.9199829101562,
      "end": 1425.9199829101562,
      "text": " What if they just would have sought the face of God?"
    },
    {
      "id": 56,
      "start": 1425.9199829101562,
      "end": 1429.9199829101562,
      "text": " What if they would have desired wisdom and counsel"
    },
    {
      "id": 57,
      "start": 1429.9199829101562,
      "end": 1432.9199829101562,
      "text": " from God instead of from the world?"
    },
    {
      "id": 58,
      "start": 1432.9199829101562,
      "end": 1435.9199829101562,
      "text": " Listen, you understand this evening, the world's not going to give you counsel"
    },
    {
      "id": 59,
      "start": 1435.9199829101562,
      "end": 1437.9199829101562,
      "text": " that's going to align with this book."
    },
    {
      "id": 60,
      "start": 1437.9199829101562,
      "end": 1440.9199829101562,
      "text": " The world is not going to provide you with counsel"
    },
    {
      "id": 61,
      "start": 1440.9199829101562,
      "end": 1444.9199829101562,
      "text": " that is going to align with what thus saith the Lord."
    },
    {
      "id": 62,
      "start": 1444.9199829101562,
      "end": 1447.9199829101562,
      "text": " In fact, if you go to the world for counsel,"
    },
    {
      "id": 63,
      "start": 1447.9199829101562,
      "end": 1450.9199829101562,
      "text": " many times their counsel is going to be contrary"
    },
    {
      "id": 64,
      "start": 1450.9199829101562,
      "end": 1453.9199829101562,
      "text": " to what you find in God's Word."
    },
    {
      "id": 65,
      "start": 1453.9199829101562,
      "end": 1456.9199829101562,
      "text": " Why? For the natural man receiveth not the things of the Spirit of God."
    },
    {
      "id": 66,
      "start": 1456.9199829101562,
      "end": 1459.9199829101562,
      "text": " For there are foolishness unto him, neither can he know them."
    },
    {
      "id": 67,
      "start": 1459.9199829101562,
      "end": 1462.9199829101562,
      "text": " Why? Because they are spiritually discerned, 1 Corinthians 2."
    },
    {
      "id": 68,
      "start": 1462.9199829101562,
      "end": 1467.9199829101562,
      "text": " And we find here that God is sent in this indictment against his people"
    },
    {
      "id": 69,
      "start": 1467.9199829101562,
      "end": 1471.9199829101562,
      "text": " because they're taking counsel but not from God."
    },
    {
      "id": 70,
      "start": 1471.9199829101562,
      "end": 1475.9199829101562,
      "text": " They're running down to Egypt, or walking to go down into Egypt,"
    },
    {
      "id": 71,
      "start": 1475.9199829101562,
      "end": 1478.9199829101562,
      "text": " but have not asked of My mouth."
    },
    {
      "id": 72,
      "start": 1478.9199829101562,
      "end": 1481.9199829101562,
      "text": " God says ask. And what?"
    },
    {
      "id": 73,
      "start": 1481.9199829101562,
      "end": 1484.9199829101562,
      "text": " Ye shall receive."
    },
    {
      "id": 74,
      "start": 1484.9199829101562,
      "end": 1486.9199829101562,
      "text": " Is that not a promise?"
    },
    {
      "id": 75,
      "start": 1486.9199829101562,
      "end": 1489.9199829101562,
      "text": " He says ye have not"
    },
    {
      "id": 76,
      "start": 1489.9199829101562,
      "end": 1492.9199829101562,
      "text": " because ye ask not."
    },
    {
      "id": 77,
      "start": 1492.9199829101562,
      "end": 1495.9199829101562,
      "text": " Right? Is that what He says? Is that Bible?"
    },
    {
      "id": 78,
      "start": 1495.9199829101562,
      "end": 1498.9199829101562,
      "text": " And we find here this evening that He says that you've not asked of My mouth"
    },
    {
      "id": 79,
      "start": 1498.9199829101562,
      "end": 1501.9199829101562,
      "text": " to strengthen themselves. Notice where it says,"
    },
    {
      "id": 80,
      "start": 1501.9199829101562,
      "end": 1504.9199829101562,
      "text": " in the strength of Pharaoh. Now this is amazing to me"
    },
    {
      "id": 81,
      "start": 1504.9199829101562,
      "end": 1507.9199829101562,
      "text": " because I think about the children of Israel."
    },
    {
      "id": 82,
      "start": 1507.9199829101562,
      "end": 1510.9199829101562,
      "text": " We have the Bible and we can read back"
    },
    {
      "id": 83,
      "start": 1510.9199829101562,
      "end": 1513.9199829101562,
      "text": " and we can understand all that happened with the Exodus"
    },
    {
      "id": 84,
      "start": 1513.9199829101562,
      "end": 1516.9199829101562,
      "text": " and so on and so forth. And I understand the Exodus is"
    },
    {
      "id": 85,
      "start": 1516.9199829101562,
      "end": 1519.9199829101562,
      "text": " after what we've read in Genesis 41 this evening"
    },
    {
      "id": 86,
      "start": 1519.9199829101562,
      "end": 1522.9199829101562,
      "text": " but Isaiah is after the Exodus."
    },
    {
      "id": 87,
      "start": 1522.9199829101562,
      "end": 1525.9199829101562,
      "text": " So I think it's fair that we could say that the children of Israel"
    },
    {
      "id": 88,
      "start": 1525.9199829101562,
      "end": 1529.9199829101562,
      "text": " were aware of what happened during the Exodus."
    },
    {
      "id": 89,
      "start": 1529.9199829101562,
      "end": 1533.9199829101562,
      "text": " The children of God during the time of Isaiah's prophecy"
    },
    {
      "id": 90,
      "start": 1533.9199829101562,
      "end": 1536.9199829101562,
      "text": " were aware of the Exodus. They were aware of the plagues."
    },
    {
      "id": 91,
      "start": 1536.9199829101562,
      "end": 1540.9199829101562,
      "text": " They could read the Psalms. They could read the book of Exodus."
    },
    {
      "id": 92,
      "start": 1540.9199829101562,
      "end": 1543.9199829101562,
      "text": " They could be aware of what God did."
    },
    {
      "id": 93,
      "start": 1543.9199829101562,
      "end": 1547.9199829101562,
      "text": " And let me ask you this. Who had more power?"
    },
    {
      "id": 94,
      "start": 1547.9199829101562,
      "end": 1550.9199829101562,
      "text": " God or Pharaoh?"
    },
    {
      "id": 95,
      "start": 1550.9199829101562,
      "end": 1553.9199829101562,
      "text": " Was it abundantly clear?"
    },
    {
      "id": 96,
      "start": 1553.9199829101562,
      "end": 1559.9199829101562,
      "text": " So clear that even the magicians of Egypt"
    },
    {
      "id": 97,
      "start": 1559.9199829101562,
      "end": 1564.9199829101562,
      "text": " said this is the finger of God."
    },
    {
      "id": 98,
      "start": 1564.9199829101562,
      "end": 1567.9199829101562,
      "text": " They asked Pharaoh, do you not see"
    },
    {
      "id": 99,
      "start": 1567.9199829101562,
      "end": 1570.9199829101562,
      "text": " that the land is devastated? I mean how long"
    },
    {
      "id": 100,
      "start": 1570.9199829101562,
      "end": 1574.9199829101562,
      "text": " are you going to allow these people to be a snare unto us?"
    },
    {
      "id": 101,
      "start": 1574.9199829101562,
      "end": 1577.9199829101562,
      "text": " God made it abundantly clear and abundantly obvious"
    },
    {
      "id": 102,
      "start": 1577.9199829101562,
      "end": 1580.9199829101562,
      "text": " that He is the one that has all power."
    },
    {
      "id": 103,
      "start": 1580.9199829101562,
      "end": 1584.9199829101562,
      "text": " That He has more power than Pharaoh."
    },
    {
      "id": 104,
      "start": 1584.9199829101562,
      "end": 1587.9199829101562,
      "text": " Would you agree? But look at verse number 2."
    },
    {
      "id": 105,
      "start": 1587.9199829101562,
      "end": 1590.9199829101562,
      "text": " These people that would have known that, it says"
    },
    {
      "id": 106,
      "start": 1590.9199829101562,
      "end": 1597.9199829101562,
      "text": " to strengthen themselves in the strength of Pharaoh."
    },
    {
      "id": 107,
      "start": 1597.9199829101562,
      "end": 1600.9199829101562,
      "text": " Why do we want Pharaoh's strength?"
    },
    {
      "id": 108,
      "start": 1600.9199829101562,
      "end": 1603.9199829101562,
      "text": " If Pharaoh's strength is inferior"
    },
    {
      "id": 109,
      "start": 1603.9199829101562,
      "end": 1606.9199829101562,
      "text": " to God's strength,"
    },
    {
      "id": 110,
      "start": 1606.9199829101562,
      "end": 1608.9199829101562,
      "text": " why do we want Pharaoh's strength?"
    },
    {
      "id": 111,
      "start": 1608.9199829101562,
      "end": 1612.9199829101562,
      "text": " Do you understand? But this is what they're doing."
    },
    {
      "id": 112,
      "start": 1612.9199829101562,
      "end": 1614.9199829101562,
      "text": " It says at the end of verse number 2,"
    },
    {
      "id": 113,
      "start": 1614.9199829101562,
      "end": 1620.9199829101562,
      "text": " and to trust in the shadow of Egypt."
    },
    {
      "id": 114,
      "start": 1620.9199829101562,
      "end": 1623.9199829101562,
      "text": " The world."
    },
    {
      "id": 115,
      "start": 1623.9199829101562,
      "end": 1626.9199829101562,
      "text": " Trust in the Lord."
    },
    {
      "id": 116,
      "start": 1626.9199829101562,
      "end": 1629.9199829101562,
      "text": " Right? Proverbs 3 verse number 5 and 6."
    },
    {
      "id": 117,
      "start": 1629.9199829101562,
      "end": 1632.9199829101562,
      "text": " With all thine heart and lean not."
    },
    {
      "id": 118,
      "start": 1632.9199829101562,
      "end": 1635.9199829101562,
      "text": " You know the verses, right?"
    },
    {
      "id": 119,
      "start": 1635.9199829101562,
      "end": 1638.9199829101562,
      "text": " And we find here this evening that they are going to"
    },
    {
      "id": 120,
      "start": 1638.9199829101562,
      "end": 1642.9199829101562,
      "text": " seek to be strengthened by the strength of Pharaoh"
    },
    {
      "id": 121,
      "start": 1642.9199829101562,
      "end": 1644.9199829101562,
      "text": " who is inferior to God Almighty"
    },
    {
      "id": 122,
      "start": 1644.9199829101562,
      "end": 1646.9199829101562,
      "text": " and God had made it abundantly clear"
    },
    {
      "id": 123,
      "start": 1646.9199829101562,
      "end": 1648.9199829101562,
      "text": " and demonstrated that truth."
    },
    {
      "id": 124,
      "start": 1648.9199829101562,
      "end": 1650.9199829101562,
      "text": " And then they're going to trust"
    },
    {
      "id": 125,
      "start": 1650.9199829101562,
      "end": 1653.9199829101562,
      "text": " in the shadow of Egypt."
    },
    {
      "id": 126,
      "start": 1653.9199829101562,
      "end": 1656.9199829101562,
      "text": " That's a sad commentary, is it not?"
    },
    {
      "id": 127,
      "start": 1656.9199829101562,
      "end": 1659.9199829101562,
      "text": " I mean, what a sad, sad indictment"
    },
    {
      "id": 128,
      "start": 1659.9199829101562,
      "end": 1661.9199829101562,
      "text": " against the children of Israel here."
    },
    {
      "id": 129,
      "start": 1661.9199829101562,
      "end": 1664.9199829101562,
      "text": " And we find that we are to abide."
    },
    {
      "id": 130,
      "start": 1664.9199829101562,
      "end": 1666.9199829101562,
      "text": " You don't need to turn there,"
    },
    {
      "id": 131,
      "start": 1666.9199829101562,
      "end": 1669.9199829101562,
      "text": " but I'm mindful this evening of the truth of Psalm 91."
    },
    {
      "id": 132,
      "start": 1669.9199829101562,
      "end": 1672.9199829101562,
      "text": " He that dwelleth in the secret place of the Most High"
    },
    {
      "id": 133,
      "start": 1672.9199829101562,
      "end": 1676.9199829101562,
      "text": " shall abide under the shadow of the Almighty."
    },
    {
      "id": 134,
      "start": 1676.9199829101562,
      "end": 1679.9199829101562,
      "text": " Not the shadow of Pharaoh of Egypt,"
    },
    {
      "id": 135,
      "start": 1679.9199829101562,
      "end": 1681.9199829101562,
      "text": " but of the shadow of the Almighty."
    },
    {
      "id": 136,
      "start": 1681.9199829101562,
      "end": 1685.9199829101562,
      "text": " I will say to the Lord, He is my refuge and my fortress."
    },
    {
      "id": 137,
      "start": 1685.9199829101562,
      "end": 1689.9199829101562,
      "text": " My God, in Him will I trust."
    },
    {
      "id": 138,
      "start": 1689.9199829101562,
      "end": 1691.9199829101562,
      "text": " Wow."
    },
    {
      "id": 139,
      "start": 1691.9199829101562,
      "end": 1693.9199829101562,
      "text": " If we know the Lord,"
    },
    {
      "id": 140,
      "start": 1693.9199829101562,
      "end": 1697.9199829101562,
      "text": " why are we going to run to Egypt?"
    },
    {
      "id": 141,
      "start": 1697.9199829101562,
      "end": 1700.9199829101562,
      "text": " Look at Isaiah 31."
    },
    {
      "id": 142,
      "start": 1700.9199829101562,
      "end": 1704.9199829101562,
      "text": " We see the indictment in Isaiah 30,"
    },
    {
      "id": 143,
      "start": 1704.9199829101562,
      "end": 1708.9199829101562,
      "text": " but we see it continue in chapter 31."
    },
    {
      "id": 144,
      "start": 1708.9199829101562,
      "end": 1711.9199829101562,
      "text": " Woe to them, verse number 1,"
    },
    {
      "id": 145,
      "start": 1711.9199829101562,
      "end": 1715.9199829101562,
      "text": " that go down to Egypt for help"
    },
    {
      "id": 146,
      "start": 1715.9199829101562,
      "end": 1718.9199829101562,
      "text": " and stay on horses and trust in chariots."
    },
    {
      "id": 147,
      "start": 1718.9199829101562,
      "end": 1720.9199829101562,
      "text": " Why are they trusting in chariots?"
    },
    {
      "id": 148,
      "start": 1720.9199829101562,
      "end": 1722.9199829101562,
      "text": " Because there aren't any."
    },
    {
      "id": 149,
      "start": 1722.9199829101562,
      "end": 1724.9199829101562,
      "text": " And in horsemen, because why?"
    },
    {
      "id": 150,
      "start": 1724.9199829101562,
      "end": 1726.9199829101562,
      "text": " They're very strong."
    },
    {
      "id": 151,
      "start": 1726.9199829101562,
      "end": 1732.9199829101562,
      "text": " But they look not unto the Holy One of Israel,"
    },
    {
      "id": 152,
      "start": 1732.9199829101562,
      "end": 1736.9199829101562,
      "text": " neither seek the Lord."
    },
    {
      "id": 153,
      "start": 1736.9199829101562,
      "end": 1739.9199829101562,
      "text": " Verse 2, yet He also is wise and will bring evil"
    },
    {
      "id": 154,
      "start": 1739.9199829101562,
      "end": 1741.9199829101562,
      "text": " and will not call back His words,"
    },
    {
      "id": 155,
      "start": 1741.9199829101562,
      "end": 1744.9199829101562,
      "text": " but will rise against the house of the evildoers"
    },
    {
      "id": 156,
      "start": 1744.9199829101562,
      "end": 1746.9199829101562,
      "text": " and against the help of them that work iniquity."
    },
    {
      "id": 157,
      "start": 1746.9199829101562,
      "end": 1749.9199829101562,
      "text": " Now the Egyptians, notice what God says here"
    },
    {
      "id": 158,
      "start": 1749.9199829101562,
      "end": 1750.9199829101562,
      "text": " in verse number 3."
    },
    {
      "id": 159,
      "start": 1750.9199829101562,
      "end": 1757.9199829101562,
      "text": " Now the Egyptians are men and not God,"
    },
    {
      "id": 160,
      "start": 1757.9199829101562,
      "end": 1762.9199829101562,
      "text": " and their horses flesh and not spirit."
    },
    {
      "id": 161,
      "start": 1762.9199829101562,
      "end": 1765.9199829101562,
      "text": " When the Lord shall stretch out His hand,"
    },
    {
      "id": 162,
      "start": 1765.9199829101562,
      "end": 1767.9199829101562,
      "text": " both he that helpeth shall fall"
    },
    {
      "id": 163,
      "start": 1767.9199829101562,
      "end": 1769.9199829101562,
      "text": " and he that is hopin' shall fall down"
    },
    {
      "id": 164,
      "start": 1769.9199829101562,
      "end": 1772.9199829101562,
      "text": " and they shall fail together."
    },
    {
      "id": 165,
      "start": 1772.9199829101562,
      "end": 1775.9199829101562,
      "text": " He says, woe to them that go down to Egypt for help."
    },
    {
      "id": 166,
      "start": 1775.9199829101562,
      "end": 1778.9199829101562,
      "text": " They look not unto the Holy One of Israel,"
    },
    {
      "id": 167,
      "start": 1778.9199829101562,
      "end": 1781.9199829101562,
      "text": " neither seek the Lord."
    },
    {
      "id": 168,
      "start": 1781.9199829101562,
      "end": 1783.9199829101562,
      "text": " The psalmist says in Psalm 121,"
    },
    {
      "id": 169,
      "start": 1783.9199829101562,
      "end": 1785.9199829101562,
      "text": " we used it as a theme verse a couple of years ago."
    },
    {
      "id": 170,
      "start": 1785.9199829101562,
      "end": 1787.9199829101562,
      "text": " I will lift up mine eyes into the hills"
    },
    {
      "id": 171,
      "start": 1787.9199829101562,
      "end": 1789.9199829101562,
      "text": " from whence cometh my help."
    },
    {
      "id": 172,
      "start": 1789.9199829101562,
      "end": 1792.9199829101562,
      "text": " My help cometh from the Lord,"
    },
    {
      "id": 173,
      "start": 1792.9199829101562,
      "end": 1796.9199829101562,
      "text": " which made heaven and earth."
    },
    {
      "id": 174,
      "start": 1796.9199829101562,
      "end": 1799.9199829101562,
      "text": " And so if we know the book of Hebrews"
    },
    {
      "id": 0,
      "start": 1799.9199829101562,
      "end": 1802.8199830055237,
      "text": " in the 13th chapter says, the Lord is my helper."
    },
    {
      "id": 1,
      "start": 1803.9999828338623,
      "end": 1805.1199827194214,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 2,
      "start": 1805.1199827194214,
      "end": 1806.6599826812744,
      "text": " What a blessing."
    },
    {
      "id": 3,
      "start": 1806.6599826812744,
      "end": 1808.3599824905396,
      "text": " And the little group that I was in this morning,"
    },
    {
      "id": 4,
      "start": 1808.3599824905396,
      "end": 1810.9999828338623,
      "text": " I didn't offer a whole lot in the Sunday school time"
    },
    {
      "id": 5,
      "start": 1810.9999828338623,
      "end": 1812.0399827957153,
      "text": " when we sat around the table."
    },
    {
      "id": 6,
      "start": 1812.0399827957153,
      "end": 1814.979983329773,
      "text": " I asked some questions to try to promote some thinking,"
    },
    {
      "id": 7,
      "start": 1814.979983329773,
      "end": 1818.0399837493896,
      "text": " but I really didn't help them fill out some things."
    },
    {
      "id": 8,
      "start": 1818.0399837493896,
      "end": 1820.5599822998047,
      "text": " But one of the words that was on the list,"
    },
    {
      "id": 9,
      "start": 1820.5599822998047,
      "end": 1822.9199829101562,
      "text": " the table that I was with in Sunday school this morning"
    },
    {
      "id": 10,
      "start": 1822.9199829101562,
      "end": 1825.3999824523926,
      "text": " under the letter H was helper."
    },
    {
      "id": 11,
      "start": 1825.3999824523926,
      "end": 1826.8999824523926,
      "text": " He's my helper."
    },
    {
      "id": 12,
      "start": 1826.8999824523926,
      "end": 1829.1199836730957,
      "text": " And there are a bunch of little kids at our table."
    },
    {
      "id": 13,
      "start": 1829.1199836730957,
      "end": 1831.599983215332,
      "text": " And I was excited to hear them put together"
    },
    {
      "id": 14,
      "start": 1831.599983215332,
      "end": 1832.599983215332,
      "text": " and to have that idea."
    },
    {
      "id": 15,
      "start": 1832.599983215332,
      "end": 1834.2799835205078,
      "text": " Joseph was there and Holly and I,"
    },
    {
      "id": 16,
      "start": 1834.2799835205078,
      "end": 1836.9199829101562,
      "text": " and then some younger children there."
    },
    {
      "id": 17,
      "start": 1836.9199829101562,
      "end": 1838.3599815368652,
      "text": " And what a blessing."
    },
    {
      "id": 18,
      "start": 1838.3599815368652,
      "end": 1840.1999816894531,
      "text": " Listen, God is my helper."
    },
    {
      "id": 19,
      "start": 1840.1999816894531,
      "end": 1842.8199844360352,
      "text": " I don't need to run down to Egypt for help."
    },
    {
      "id": 20,
      "start": 1844.3999824523926,
      "end": 1846.0799827575684,
      "text": " And let me say this to you this evening,"
    },
    {
      "id": 21,
      "start": 1846.0799827575684,
      "end": 1847.9599838256836,
      "text": " and I'm saying this to myself as well."
    },
    {
      "id": 22,
      "start": 1847.9599838256836,
      "end": 1850.1999816894531,
      "text": " And you understand, I said this when I prayed this morning."
    },
    {
      "id": 23,
      "start": 1850.1999816894531,
      "end": 1851.7199821472168,
      "text": " Listen, when I preach messages,"
    },
    {
      "id": 24,
      "start": 1851.7199821472168,
      "end": 1854.159984588623,
      "text": " God gets to deal with me all week as I prepare,"
    },
    {
      "id": 25,
      "start": 1854.159984588623,
      "end": 1856.1999816894531,
      "text": " and then he gets to deal with me again when I deliver."
    },
    {
      "id": 26,
      "start": 1856.1999816894531,
      "end": 1858.9199829101562,
      "text": " So I get it twice every time you get it once, amen?"
    },
    {
      "id": 27,
      "start": 1859.599983215332,
      "end": 1860.43998336792,
      "text": " And that's just the way it works."
    },
    {
      "id": 28,
      "start": 1860.43998336792,
      "end": 1861.9599838256836,
      "text": " And actually, it's probably more than twice"
    },
    {
      "id": 29,
      "start": 1861.9599838256836,
      "end": 1864.5599822998047,
      "text": " because the preparation time is over and over and over,"
    },
    {
      "id": 30,
      "start": 1864.5599822998047,
      "end": 1866.0799865722656,
      "text": " and so on and so forth."
    },
    {
      "id": 31,
      "start": 1866.0799865722656,
      "end": 1867.9399795532227,
      "text": " But understand with me this evening"
    },
    {
      "id": 32,
      "start": 1867.9399795532227,
      "end": 1870.3999862670898,
      "text": " that if this was true of the children of Israel"
    },
    {
      "id": 33,
      "start": 1870.3999862670898,
      "end": 1872.999984741211,
      "text": " in Isaiah's day, you cannot tell me"
    },
    {
      "id": 34,
      "start": 1872.999984741211,
      "end": 1876.5199813842773,
      "text": " that it's still not true of God's people today."
    },
    {
      "id": 35,
      "start": 1876.5199813842773,
      "end": 1879.7999801635742,
      "text": " That there are times in your life and in my life"
    },
    {
      "id": 36,
      "start": 1879.7999801635742,
      "end": 1883.8399810791016,
      "text": " when we go to the world and the world system"
    },
    {
      "id": 37,
      "start": 1883.8399810791016,
      "end": 1888.8399810791016,
      "text": " for help and for counsel and never even ask for help."
    },
    {
      "id": 38,
      "start": 1888.999984741211,
      "end": 1892.2399826049805,
      "text": " God, we're guilty."
    },
    {
      "id": 39,
      "start": 1892.2399826049805,
      "end": 1894.0799865722656,
      "text": " We may not want to admit it."
    },
    {
      "id": 40,
      "start": 1894.0799865722656,
      "end": 1896.719985961914,
      "text": " We may not want to acknowledge this evening."
    },
    {
      "id": 41,
      "start": 1896.719985961914,
      "end": 1898.9599838256836,
      "text": " We may not, we might've put that facade on"
    },
    {
      "id": 42,
      "start": 1898.9599838256836,
      "end": 1902.1599807739258,
      "text": " of nope, I've never done that, pastor."
    },
    {
      "id": 43,
      "start": 1902.1599807739258,
      "end": 1904.2399826049805,
      "text": " But the reality is that we're all guilty,"
    },
    {
      "id": 44,
      "start": 1904.2399826049805,
      "end": 1908.3999862670898,
      "text": " just like the children of Israel were guilty in Isaiah's day."
    },
    {
      "id": 45,
      "start": 1908.3999862670898,
      "end": 1911.4399795532227,
      "text": " There are times in our lives when we do,"
    },
    {
      "id": 46,
      "start": 1911.4399795532227,
      "end": 1914.2399826049805,
      "text": " we don't even ask the Lord."
    },
    {
      "id": 47,
      "start": 1916.0799865722656,
      "end": 1917.719985961914,
      "text": " We don't even, as it said in there,"
    },
    {
      "id": 48,
      "start": 1917.719985961914,
      "end": 1919.3999862670898,
      "text": " in chapter 30 and verse number two,"
    },
    {
      "id": 49,
      "start": 1919.3999862670898,
      "end": 1923.0399856567383,
      "text": " they have not asked at my mouth."
    },
    {
      "id": 50,
      "start": 1923.0399856567383,
      "end": 1926.2799835205078,
      "text": " There are times that we've simply not even sought the Lord,"
    },
    {
      "id": 51,
      "start": 1927.97998046875,
      "end": 1931.2799835205078,
      "text": " but we've sought the counsel, the help,"
    },
    {
      "id": 52,
      "start": 1931.2799835205078,
      "end": 1934.0399780273438,
      "text": " the direction of the world."
    },
    {
      "id": 53,
      "start": 1935.7599792480469,
      "end": 1939.7999877929688,
      "text": " And we see here this evening that this prophet Isaiah"
    },
    {
      "id": 54,
      "start": 1939.7999877929688,
      "end": 1944.1199798583984,
      "text": " gives these indictments and we put all of this together"
    },
    {
      "id": 55,
      "start": 1944.1199798583984,
      "end": 1946.5599822998047,
      "text": " and think about the truth back there"
    },
    {
      "id": 56,
      "start": 1946.5599822998047,
      "end": 1950.6399841308594,
      "text": " in Genesis chapter 41, and we'll be in the New Testament"
    },
    {
      "id": 57,
      "start": 1950.6399841308594,
      "end": 1952.1199798583984,
      "text": " in just a moment and finish the message,"
    },
    {
      "id": 58,
      "start": 1952.1199798583984,
      "end": 1953.959976196289,
      "text": " but in Genesis chapter 41,"
    },
    {
      "id": 59,
      "start": 1953.959976196289,
      "end": 1955.8399810791016,
      "text": " I want to remind you of the counsel once again."
    },
    {
      "id": 60,
      "start": 1955.8399810791016,
      "end": 1960.1999816894531,
      "text": " Remember the people, because all the land was famished,"
    },
    {
      "id": 61,
      "start": 1960.1999816894531,
      "end": 1962.7999877929688,
      "text": " the people cried to Pharaoh for bread."
    },
    {
      "id": 62,
      "start": 1962.7999877929688,
      "end": 1966.47998046875,
      "text": " And Pharaoh sent out all the Egyptians going to Joseph,"
    },
    {
      "id": 63,
      "start": 1966.47998046875,
      "end": 1967.8399810791016,
      "text": " what do you say if you do?"
    },
    {
      "id": 64,
      "start": 1969.1199798583984,
      "end": 1971.9399871826172,
      "text": " Pharaoh wasn't able to offer any help."
    },
    {
      "id": 65,
      "start": 1971.9399871826172,
      "end": 1973.0799865722656,
      "text": " He sends them to Joseph."
    },
    {
      "id": 66,
      "start": 1973.0799865722656,
      "end": 1975.5199890136719,
      "text": " Joseph, as I mentioned a moment ago,"
    },
    {
      "id": 67,
      "start": 1975.5199890136719,
      "end": 1978.5999755859375,
      "text": " is a type, a picture of the Lord Jesus Christ."
    },
    {
      "id": 68,
      "start": 1978.5999755859375,
      "end": 1981.959976196289,
      "text": " And it's very amazing to me that here in Genesis chapter 41"
    },
    {
      "id": 69,
      "start": 1981.959976196289,
      "end": 1984.7999877929688,
      "text": " and verse number 55, that here's what the Bible says,"
    },
    {
      "id": 70,
      "start": 1984.7999877929688,
      "end": 1986.1199798583984,
      "text": " go unto Joseph."
    },
    {
      "id": 71,
      "start": 1986.1199798583984,
      "end": 1987.97998046875,
      "text": " This is what Pharaoh says to the Egyptians,"
    },
    {
      "id": 72,
      "start": 1987.97998046875,
      "end": 1992.97998046875,
      "text": " go unto Joseph and notice what he saith to you, do."
    },
    {
      "id": 73,
      "start": 1994.5599822998047,
      "end": 1997.959976196289,
      "text": " Now, contextually, historically, what's going to happen"
    },
    {
      "id": 74,
      "start": 1997.959976196289,
      "end": 1999.7999877929688,
      "text": " is Joseph's gonna say, you want some bread?"
    },
    {
      "id": 75,
      "start": 1999.7999877929688,
      "end": 2000.6399841308594,
      "text": " All right, here's what you do."
    },
    {
      "id": 76,
      "start": 2000.6399841308594,
      "end": 2002.1999816894531,
      "text": " You gotta give me this and I'll give you some bread"
    },
    {
      "id": 77,
      "start": 2002.1999816894531,
      "end": 2003.0399780273438,
      "text": " and so on and so forth."
    },
    {
      "id": 78,
      "start": 2003.0399780273438,
      "end": 2004.9199829101562,
      "text": " Eventually they get the land and so on and so forth,"
    },
    {
      "id": 79,
      "start": 2005.3199768066406,
      "end": 2008.0799865722656,
      "text": " and we'll study that over the next several weeks."
    },
    {
      "id": 80,
      "start": 2008.0799865722656,
      "end": 2010.3999786376953,
      "text": " So what he saith to you do, you want food?"
    },
    {
      "id": 81,
      "start": 2010.3999786376953,
      "end": 2012.5999755859375,
      "text": " There's the source, you go to him and whatever he says,"
    },
    {
      "id": 82,
      "start": 2012.5999755859375,
      "end": 2014.1199798583984,
      "text": " that's what happens, right?"
    },
    {
      "id": 83,
      "start": 2015.0799865722656,
      "end": 2017.47998046875,
      "text": " But I want you to think about Joseph being a type"
    },
    {
      "id": 84,
      "start": 2017.47998046875,
      "end": 2019.4399871826172,
      "text": " and a picture of the Lord Jesus Christ."
    },
    {
      "id": 85,
      "start": 2021.7999877929688,
      "end": 2024.5999755859375,
      "text": " Whatsoever he saith to you, do."
    },
    {
      "id": 86,
      "start": 2026.2799835205078,
      "end": 2031.2799835205078,
      "text": " There's a athletic company that coined the phrase,"
    },
    {
      "id": 87,
      "start": 2031.2799835205078,
      "end": 2032.5199890136719,
      "text": " just do it."
    },
    {
      "id": 88,
      "start": 2032.5199890136719,
      "end": 2034.499984741211,
      "text": " No doubt you've heard that at some point"
    },
    {
      "id": 89,
      "start": 2035.1199798583984,
      "end": 2036.3799896240234,
      "text": " over your life."
    },
    {
      "id": 90,
      "start": 2037.2599792480469,
      "end": 2042.2599792480469,
      "text": " When you think about this phrase, what he saith to you do,"
    },
    {
      "id": 91,
      "start": 2042.6399841308594,
      "end": 2046.3399810791016,
      "text": " it reminds me of the Lord Jesus Christ in John chapter two."
    },
    {
      "id": 92,
      "start": 2046.3399810791016,
      "end": 2049.2999877929688,
      "text": " Turn to the book of John, if you will, the gospel of John."
    },
    {
      "id": 93,
      "start": 2050.6599884033203,
      "end": 2053.5799865722656,
      "text": " Of course, John chapter number one announces with,"
    },
    {
      "id": 94,
      "start": 2053.5799865722656,
      "end": 2058.2999877929688,
      "text": " I mean, just great authority,"
    },
    {
      "id": 95,
      "start": 2058.2999877929688,
      "end": 2060.8599853515625,
      "text": " the person of the Lord Jesus Christ"
    },
    {
      "id": 96,
      "start": 2060.8599853515625,
      "end": 2063.0999755859375,
      "text": " and that he is God in flesh."
    },
    {
      "id": 97,
      "start": 2063.5399780273438,
      "end": 2067.019989013672,
      "text": " I mean, what a powerful, powerful introduction"
    },
    {
      "id": 98,
      "start": 2067.019989013672,
      "end": 2069.8199768066406,
      "text": " that we receive in the gospel of John in the first chapter."
    },
    {
      "id": 99,
      "start": 2069.8199768066406,
      "end": 2071.7799682617188,
      "text": " And we come to the second chapter,"
    },
    {
      "id": 100,
      "start": 2071.7799682617188,
      "end": 2074.219970703125,
      "text": " and we find that this is the first miracle"
    },
    {
      "id": 101,
      "start": 2074.219970703125,
      "end": 2075.6599731445312,
      "text": " of the Lord Jesus Christ."
    },
    {
      "id": 102,
      "start": 2075.6599731445312,
      "end": 2077.97998046875,
      "text": " In verse 11, it says, this beginning of miracles"
    },
    {
      "id": 103,
      "start": 2077.97998046875,
      "end": 2080.239990234375,
      "text": " did Jesus in Cana of Galilee."
    },
    {
      "id": 104,
      "start": 2080.239990234375,
      "end": 2084.1799926757812,
      "text": " And we find that in this particular text of scripture,"
    },
    {
      "id": 105,
      "start": 2084.1799926757812,
      "end": 2086.499969482422,
      "text": " and I'm not gonna take the time to deal with the entirety"
    },
    {
      "id": 106,
      "start": 2086.499969482422,
      "end": 2088.5399780273438,
      "text": " of the miracle and what have you,"
    },
    {
      "id": 107,
      "start": 2088.5399780273438,
      "end": 2090.8599853515625,
      "text": " but I wanna hone in on verse number five"
    },
    {
      "id": 108,
      "start": 2090.8599853515625,
      "end": 2095.0999755859375,
      "text": " and look at that phrase that Mary, the mother of Jesus says"
    },
    {
      "id": 109,
      "start": 2095.0999755859375,
      "end": 2099.2999877929688,
      "text": " to those servants that are gathered together"
    },
    {
      "id": 110,
      "start": 2099.2999877929688,
      "end": 2101.8199768066406,
      "text": " to provide some assistance, if you will."
    },
    {
      "id": 111,
      "start": 2101.8199768066406,
      "end": 2105.0599975585938,
      "text": " And we find that it's very similar"
    },
    {
      "id": 112,
      "start": 2105.0599975585938,
      "end": 2108.6599731445312,
      "text": " to what Pharaoh says to the people of Egypt."
    },
    {
      "id": 113,
      "start": 2108.6599731445312,
      "end": 2112.6199951171875,
      "text": " And here's what the mother of Jesus, Mary says,"
    },
    {
      "id": 114,
      "start": 2112.6199951171875,
      "end": 2115.1399841308594,
      "text": " notice in verse number five,"
    },
    {
      "id": 115,
      "start": 2115.1399841308594,
      "end": 2117.3399963378906,
      "text": " his mother saith unto the servants,"
    },
    {
      "id": 116,
      "start": 2118.2999877929688,
      "end": 2123.2999877929688,
      "text": " whatsoever he saith unto you, do it."
    },
    {
      "id": 117,
      "start": 2124.97998046875,
      "end": 2127.739990234375,
      "text": " Whatsoever he saith unto you, do it."
    },
    {
      "id": 118,
      "start": 2128.8199768066406,
      "end": 2130.259979248047,
      "text": " You know, the reality is sometimes"
    },
    {
      "id": 119,
      "start": 2130.259979248047,
      "end": 2132.7799682617188,
      "text": " we just have a hard time with that"
    },
    {
      "id": 120,
      "start": 2132.7799682617188,
      "end": 2134.5399780273438,
      "text": " because we wanna do things our way."
    },
    {
      "id": 121,
      "start": 2135.8599853515625,
      "end": 2140.2799682617188,
      "text": " We wanna do things the way we wanna do things."
    },
    {
      "id": 122,
      "start": 2140.2799682617188,
      "end": 2141.8199768066406,
      "text": " We've heard another way, we've heard,"
    },
    {
      "id": 123,
      "start": 2141.8199768066406,
      "end": 2143.7799682617188,
      "text": " maybe we've gotten counsel from some other source"
    },
    {
      "id": 124,
      "start": 2143.7799682617188,
      "end": 2146.0599975585938,
      "text": " and what have you, but we find that even,"
    },
    {
      "id": 125,
      "start": 2146.0599975585938,
      "end": 2148.1799926757812,
      "text": " listen, I sat in my office 11 years ago,"
    },
    {
      "id": 126,
      "start": 2148.1799926757812,
      "end": 2149.5399780273438,
      "text": " no one here would even know the person"
    },
    {
      "id": 127,
      "start": 2149.5399780273438,
      "end": 2150.5799865722656,
      "text": " that I was speaking to."
    },
    {
      "id": 128,
      "start": 2150.5799865722656,
      "end": 2152.499969482422,
      "text": " And it was a mess of a situation,"
    },
    {
      "id": 129,
      "start": 2152.499969482422,
      "end": 2154.0999755859375,
      "text": " all sorts of crazy stuff, stuff"
    },
    {
      "id": 130,
      "start": 2154.0999755859375,
      "end": 2156.97998046875,
      "text": " I never even had thought happened."
    },
    {
      "id": 131,
      "start": 2156.97998046875,
      "end": 2158.8599853515625,
      "text": " I'll be honest with you."
    },
    {
      "id": 132,
      "start": 2158.8599853515625,
      "end": 2159.699981689453,
      "text": " I thought, what in the world?"
    },
    {
      "id": 133,
      "start": 2159.699981689453,
      "end": 2161.8599853515625,
      "text": " I'm sitting in my office, I'm like, is this real?"
    },
    {
      "id": 134,
      "start": 2161.8599853515625,
      "end": 2162.739990234375,
      "text": " Like, seriously?"
    },
    {
      "id": 135,
      "start": 2162.739990234375,
      "end": 2165.0599975585938,
      "text": " I didn't even know stuff like this happened."
    },
    {
      "id": 136,
      "start": 2165.0599975585938,
      "end": 2166.3799743652344,
      "text": " It was absolutely amazing."
    },
    {
      "id": 137,
      "start": 2168.219970703125,
      "end": 2170.1399841308594,
      "text": " And I said, here's the, and they were trying to tell me"
    },
    {
      "id": 138,
      "start": 2170.1399841308594,
      "end": 2171.8999938964844,
      "text": " how right they were with God and all this stuff."
    },
    {
      "id": 139,
      "start": 2171.8999938964844,
      "end": 2172.739990234375,
      "text": " It was crazy."
    },
    {
      "id": 140,
      "start": 2173.7799682617188,
      "end": 2175.5399780273438,
      "text": " And I said, well, let me just ask you this."
    },
    {
      "id": 141,
      "start": 2175.939971923828,
      "end": 2177.8999938964844,
      "text": " Are you doing everything God's telling you to do?"
    },
    {
      "id": 142,
      "start": 2177.8999938964844,
      "end": 2179.499969482422,
      "text": " Oh, yeah."
    },
    {
      "id": 143,
      "start": 2179.499969482422,
      "end": 2182.0999755859375,
      "text": " I said, no, like whatsoever he sayeth, you do it."
    },
    {
      "id": 144,
      "start": 2182.0999755859375,
      "end": 2184.459991455078,
      "text": " Oh, yeah, all of it."
    },
    {
      "id": 145,
      "start": 2184.459991455078,
      "end": 2187.459991455078,
      "text": " The guy was just lying straight out of his teeth, right?"
    },
    {
      "id": 146,
      "start": 2187.459991455078,
      "end": 2190.0599975585938,
      "text": " But the reality is that for us as God's people,"
    },
    {
      "id": 147,
      "start": 2191.259979248047,
      "end": 2195.4199829101562,
      "text": " we go to God for counsel and whatsoever he sayeth, we do it."
    },
    {
      "id": 148,
      "start": 2195.4199829101562,
      "end": 2196.5399780273438,
      "text": " You say, but it doesn't make sense."
    },
    {
      "id": 149,
      "start": 2196.5399780273438,
      "end": 2199.5399780273438,
      "text": " No, no, God's way doesn't always make sense."
    },
    {
      "id": 150,
      "start": 2199.5399780273438,
      "end": 2203.7799682617188,
      "text": " And let me say this, God's way doesn't have to make sense."
    },
    {
      "id": 151,
      "start": 2203.7799682617188,
      "end": 2204.6199951171875,
      "text": " Amen?"
    },
    {
      "id": 152,
      "start": 2204.6199951171875,
      "end": 2207.499969482422,
      "text": " Sometimes, and listen, those of us that are more logical"
    },
    {
      "id": 153,
      "start": 2207.499969482422,
      "end": 2211.6199951171875,
      "text": " and what have you and have that analytical type of a mind,"
    },
    {
      "id": 154,
      "start": 2211.6199951171875,
      "end": 2213.699981689453,
      "text": " sometimes we struggle with that, why?"
    },
    {
      "id": 155,
      "start": 2213.699981689453,
      "end": 2215.97998046875,
      "text": " Because we want things to make sense."
    },
    {
      "id": 156,
      "start": 2216.8199768066406,
      "end": 2219.699981689453,
      "text": " And God's ways are not our ways."
    },
    {
      "id": 157,
      "start": 2219.699981689453,
      "end": 2220.8199768066406,
      "text": " Amen?"
    },
    {
      "id": 158,
      "start": 2220.8199768066406,
      "end": 2224.4199829101562,
      "text": " And God says, do it."
    },
    {
      "id": 159,
      "start": 2224.4199829101562,
      "end": 2227.5799865722656,
      "text": " And this evening, when we think about the time of crisis,"
    },
    {
      "id": 160,
      "start": 2227.5799865722656,
      "end": 2231.8599853515625,
      "text": " the time of great difficulty, the time of great distress,"
    },
    {
      "id": 161,
      "start": 2231.8599853515625,
      "end": 2233.759979248047,
      "text": " to whom do we go?"
    },
    {
      "id": 162,
      "start": 2233.759979248047,
      "end": 2235.0399780273438,
      "text": " To whom do we cry?"
    },
    {
      "id": 163,
      "start": 2236.1199951171875,
      "end": 2238.519989013672,
      "text": " See, we see what happened in Genesis 41"
    },
    {
      "id": 164,
      "start": 2239.759979248047,
      "end": 2242.519989013672,
      "text": " when those seven years of dearth began."
    },
    {
      "id": 165,
      "start": 2242.519989013672,
      "end": 2244.3199768066406,
      "text": " It was immediate and severe."
    },
    {
      "id": 166,
      "start": 2246.1599731445312,
      "end": 2248.959991455078,
      "text": " We find that the people, they cried out,"
    },
    {
      "id": 167,
      "start": 2248.959991455078,
      "end": 2251.5999755859375,
      "text": " and I understand why they cried out."
    },
    {
      "id": 168,
      "start": 2251.5999755859375,
      "end": 2252.8999938964844,
      "text": " They cried out to Pharaoh."
    },
    {
      "id": 169,
      "start": 2253.7999877929688,
      "end": 2255.5999755859375,
      "text": " And Pharaoh and Ensign said, I can't help you."
    },
    {
      "id": 170,
      "start": 2255.5999755859375,
      "end": 2257.8999938964844,
      "text": " Go to Joseph, and whatsoever he sayeth, do it."
    },
    {
      "id": 171,
      "start": 2259.6399841308594,
      "end": 2261.0399780273438,
      "text": " What he sayeth to you, do."
    },
    {
      "id": 172,
      "start": 2262.0399780273438,
      "end": 2264.6399841308594,
      "text": " If we look at these types this evening,"
    },
    {
      "id": 173,
      "start": 2265.6399841308594,
      "end": 2269.6399841308594,
      "text": " for us in 2023, almost 2024 now,"
    },
    {
      "id": 174,
      "start": 2269.6399841308594,
      "end": 2271.8799743652344,
      "text": " we have times of crisis and difficulty."
    },
    {
      "id": 175,
      "start": 2271.8799743652344,
      "end": 2272.8199768066406,
      "text": " To whom do we flee?"
    },
    {
      "id": 176,
      "start": 2272.8199768066406,
      "end": 2273.959991455078,
      "text": " To whom do we go?"
    },
    {
      "id": 177,
      "start": 2275.0799865722656,
      "end": 2276.6399841308594,
      "text": " Don't go to Egypt."
    },
    {
      "id": 178,
      "start": 2276.6399841308594,
      "end": 2277.8999938964844,
      "text": " Don't go to the world."
    },
    {
      "id": 179,
      "start": 2278.759979248047,
      "end": 2281.1599731445312,
      "text": " The world doesn't have anything to offer you."
    },
    {
      "id": 180,
      "start": 2282.8399963378906,
      "end": 2284.47998046875,
      "text": " Go to God."
    },
    {
      "id": 181,
      "start": 2284.47998046875,
      "end": 2286.519989013672,
      "text": " Seek God."
    },
    {
      "id": 182,
      "start": 2286.519989013672,
      "end": 2289.7999877929688,
      "text": " And whatever God says, do it."
    },
    {
      "id": 183,
      "start": 2290.759979248047,
      "end": 2292.239990234375,
      "text": " Do it."
    },
    {
      "id": 184,
      "start": 2292.239990234375,
      "end": 2294.1599731445312,
      "text": " You know that we do not have to pray"
    },
    {
      "id": 185,
      "start": 2294.1599731445312,
      "end": 2297.8799743652344,
      "text": " about what God has revealed for us to do in his word."
    },
    {
      "id": 186,
      "start": 2297.8799743652344,
      "end": 2298.959991455078,
      "text": " You know what I mean by that?"
    },
    {
      "id": 187,
      "start": 2298.959991455078,
      "end": 2300.5999755859375,
      "text": " When God tells us to do something,"
    },
    {
      "id": 188,
      "start": 2300.5999755859375,
      "end": 2303.239990234375,
      "text": " we don't say, well, you know, I'm gonna pray about that."
    },
    {
      "id": 189,
      "start": 2303.239990234375,
      "end": 2305.1599731445312,
      "text": " When God says that we're to rejoice in everything,"
    },
    {
      "id": 190,
      "start": 2305.1599731445312,
      "end": 2306.8599853515625,
      "text": " give thanks for this will of God and Christ Jesus"
    },
    {
      "id": 191,
      "start": 2306.8599853515625,
      "end": 2308.959991455078,
      "text": " concerning you, I'm gonna pray about that."
    },
    {
      "id": 192,
      "start": 2308.959991455078,
      "end": 2311.0599975585938,
      "text": " No, no, no, just do it."
    },
    {
      "id": 193,
      "start": 2311.0599975585938,
      "end": 2311.97998046875,
      "text": " Amen?"
    },
    {
      "id": 194,
      "start": 2311.97998046875,
      "end": 2313.3999633789062,
      "text": " You don't have to pray about whether you're gonna,"
    },
    {
      "id": 195,
      "start": 2313.3999633789062,
      "end": 2314.760009765625,
      "text": " you don't have to pray about whether you're gonna give."
    },
    {
      "id": 196,
      "start": 2314.760009765625,
      "end": 2316.5999755859375,
      "text": " You don't have to pray whether you're gonna go to church."
    },
    {
      "id": 197,
      "start": 2316.5999755859375,
      "end": 2317.5599975585938,
      "text": " You don't have to pray."
    },
    {
      "id": 198,
      "start": 2317.5599975585938,
      "end": 2319.3599853515625,
      "text": " We're commanded to do those things."
    },
    {
      "id": 199,
      "start": 2319.719970703125,
      "end": 2321.2000122070312,
      "text": " We don't pray about the commands."
    },
    {
      "id": 200,
      "start": 2321.2000122070312,
      "end": 2322.3599853515625,
      "text": " Does that make sense?"
    },
    {
      "id": 201,
      "start": 2322.3599853515625,
      "end": 2323.760009765625,
      "text": " We just do them."
    },
    {
      "id": 202,
      "start": 2323.760009765625,
      "end": 2324.9199829101562,
      "text": " We just obey."
    },
    {
      "id": 203,
      "start": 2325.8800048828125,
      "end": 2327.3200073242188,
      "text": " And God will bless."
    },
    {
      "id": 204,
      "start": 2328.3999633789062,
      "end": 2330.5199584960938,
      "text": " See, God's way is not always our way."
    },
    {
      "id": 205,
      "start": 2330.5199584960938,
      "end": 2331.5199584960938,
      "text": " But you know what God wants us to do?"
    },
    {
      "id": 206,
      "start": 2331.5199584960938,
      "end": 2332.9400024414062,
      "text": " He wants us to trust him."
    },
    {
      "id": 207,
      "start": 2334.3599853515625,
      "end": 2335.6799926757812,
      "text": " He is the almighty."
    },
    {
      "id": 208,
      "start": 2337.1599731445312,
      "end": 2339.3599853515625,
      "text": " He is the one that spoke everything into existence."
    },
    {
      "id": 209,
      "start": 2339.3599853515625,
      "end": 2341.8999633789062,
      "text": " He is the one that saved your soul."
    },
    {
      "id": 210,
      "start": 2341.8999633789062,
      "end": 2343.7799682617188,
      "text": " You understand that there's nothing you can do tonight"
    },
    {
      "id": 211,
      "start": 2343.7799682617188,
      "end": 2346.0399780273438,
      "text": " to get to heaven on your own."
    },
    {
      "id": 212,
      "start": 2346.0399780273438,
      "end": 2347.4400024414062,
      "text": " We all agree on that."
    },
    {
      "id": 213,
      "start": 2347.4400024414062,
      "end": 2349.6399536132812,
      "text": " There's nothing we can do to get to heaven on our own."
    },
    {
      "id": 214,
      "start": 2349.6399536132812,
      "end": 2352.3599853515625,
      "text": " We need Jesus."
    },
    {
      "id": 215,
      "start": 2352.3599853515625,
      "end": 2353.2000122070312,
      "text": " Would you agree?"
    },
    {
      "id": 216,
      "start": 2354.760009765625,
      "end": 2358.1599731445312,
      "text": " But you know what happens sometimes for living tomorrow?"
    },
    {
      "id": 217,
      "start": 2358.1599731445312,
      "end": 2359.5799560546875,
      "text": " We think, I got this."
    },
    {
      "id": 218,
      "start": 2360.7999877929688,
      "end": 2361.8999633789062,
      "text": " I can handle tomorrow."
    },
    {
      "id": 219,
      "start": 2361.8999633789062,
      "end": 2364.3200073242188,
      "text": " I mean, I can't handle eternity,"
    },
    {
      "id": 220,
      "start": 2364.3200073242188,
      "end": 2365.6399536132812,
      "text": " but I can handle tomorrow."
    },
    {
      "id": 221,
      "start": 2365.6399536132812,
      "end": 2367.5999755859375,
      "text": " I can handle this week."
    },
    {
      "id": 222,
      "start": 2367.5999755859375,
      "end": 2370.5199584960938,
      "text": " And we live independently of God."
    },
    {
      "id": 223,
      "start": 2371.3999633789062,
      "end": 2374.1199951171875,
      "text": " And that just makes zero sense."
    },
    {
      "id": 224,
      "start": 2374.1199951171875,
      "end": 2377.6799926757812,
      "text": " Listen, if you can trust him with your eternal destiny,"
    },
    {
      "id": 225,
      "start": 2377.6799926757812,
      "end": 2380.0399780273438,
      "text": " you can trust him with your tomorrow."
    },
    {
      "id": 226,
      "start": 2380.0399780273438,
      "end": 2381.3599853515625,
      "text": " Amen?"
    },
    {
      "id": 227,
      "start": 2381.3599853515625,
      "end": 2383.5599975585938,
      "text": " If you can trust him with your eternal destiny,"
    },
    {
      "id": 228,
      "start": 2383.5599975585938,
      "end": 2387.239990234375,
      "text": " you can trust him with tomorrow."
    },
    {
      "id": 229,
      "start": 2387.239990234375,
      "end": 2389.8399658203125,
      "text": " Whatsoever he sayeth unto you, do it."
    },
    {
      "id": 230,
      "start": 2389.8399658203125,
      "end": 2391.1599731445312,
      "text": " To whom do we cry?"
    },
    {
      "id": 231,
      "start": 2391.1599731445312,
      "end": 2393.8800048828125,
      "text": " To whom do we go in times of crisis?"
    },
    {
      "id": 232,
      "start": 2393.8800048828125,
      "end": 2394.8399658203125,
      "text": " We all face them."
    },
    {
      "id": 233,
      "start": 2394.8399658203125,
      "end": 2396.9199829101562,
      "text": " We all have times of great difficulty."
    },
    {
      "id": 234,
      "start": 2396.9199829101562,
      "end": 2400.1199951171875,
      "text": " And I hope tonight that we run to the cross."
    },
    {
      "id": 0,
      "start": 2400.1199951171875,
      "end": 2404.1199951171875,
      "text": " that we run to the Lord Jesus Christ and we say,"
    },
    {
      "id": 1,
      "start": 2404.1199951171875,
      "end": 2408.1199951171875,
      "text": " Lord, help me. You ever read Psalm 12?"
    },
    {
      "id": 2,
      "start": 2408.1199951171875,
      "end": 2412.1199951171875,
      "text": " Help, Lord. That's how it begins. You know, sometimes that's all we can pray."
    },
    {
      "id": 3,
      "start": 2412.1199951171875,
      "end": 2416.1199951171875,
      "text": " Help, Lord. I just need help and I know that you're the helper"
    },
    {
      "id": 4,
      "start": 2416.1199951171875,
      "end": 2420.1199951171875,
      "text": " and you said that you would give us help. Aren't you so thankful"
    },
    {
      "id": 5,
      "start": 2420.1199951171875,
      "end": 2424.1199951171875,
      "text": " that we have a wonderful Savior and He offers to give us"
    },
    {
      "id": 6,
      "start": 2424.1199951171875,
      "end": 2428.1199951171875,
      "text": " the counsel, the direction that we need. He's our"
    },
    {
      "id": 7,
      "start": 2428.1199951171875,
      "end": 2432.1199951171875,
      "text": " shepherd and as our shepherd, He takes good care"
    },
    {
      "id": 8,
      "start": 2432.1199951171875,
      "end": 2436.1199951171875,
      "text": " of His sheep. Let's pray this evening. Father, we love You."
    },
    {
      "id": 9,
      "start": 2436.1199951171875,
      "end": 2440.1199951171875,
      "text": " We thank You for loving us. We thank You for Your Word, the truth contained therein."
    },
    {
      "id": 10,
      "start": 2440.1199951171875,
      "end": 2444.1199951171875,
      "text": " I pray that even as we look at this historical event,"
    },
    {
      "id": 11,
      "start": 2444.1199951171875,
      "end": 2448.1199951171875,
      "text": " this time in Egypt"
    },
    {
      "id": 12,
      "start": 2448.1199951171875,
      "end": 2452.1199951171875,
      "text": " when Joseph is there and this famine begins"
    },
    {
      "id": 13,
      "start": 2452.1199951171875,
      "end": 2456.1199951171875,
      "text": " and the land is famished,"
    },
    {
      "id": 14,
      "start": 2456.1199951171875,
      "end": 2460.1199951171875,
      "text": " Lord, I pray that tonight as we can understand"
    },
    {
      "id": 15,
      "start": 2460.1199951171875,
      "end": 2464.1199951171875,
      "text": " the historical context of this event that we also"
    },
    {
      "id": 16,
      "start": 2464.1199951171875,
      "end": 2468.1199951171875,
      "text": " would be able to make application in our lives. Lord,"
    },
    {
      "id": 17,
      "start": 2468.1199951171875,
      "end": 2472.1199951171875,
      "text": " I pray that You'd help us tonight"
    },
    {
      "id": 18,
      "start": 2472.1199951171875,
      "end": 2476.1199951171875,
      "text": " to run to You in times of difficulty, of great"
    },
    {
      "id": 19,
      "start": 2476.1199951171875,
      "end": 2480.1199951171875,
      "text": " need, of great distress, times of crisis."
    },
    {
      "id": 20,
      "start": 2480.1199951171875,
      "end": 2484.1199951171875,
      "text": " Help us, Lord, not to run to the world, the world"
    },
    {
      "id": 21,
      "start": 2484.1199951171875,
      "end": 2488.1199951171875,
      "text": " system. Help us, Lord, to trust You,"
    },
    {
      "id": 22,
      "start": 2488.1199951171875,
      "end": 2492.1199951171875,
      "text": " to obey You. I pray that You'd help us, Lord,"
    },
    {
      "id": 23,
      "start": 2492.1199951171875,
      "end": 2496.1199951171875,
      "text": " to be doers of the Word and not hearers only. Help us to have a heart"
    },
    {
      "id": 24,
      "start": 2496.1199951171875,
      "end": 2500.1199951171875,
      "text": " of surrender and submission to You and to Your"
    },
    {
      "id": 25,
      "start": 2500.1199951171875,
      "end": 2504.1199951171875,
      "text": " Word. I pray that in these few moments of invitation that You'd have Your will and way"
    },
    {
      "id": 26,
      "start": 2504.1199951171875,
      "end": 2508.1199951171875,
      "text": " that You would move and work in hearts and lives as only You can. We'll thank You for"
    },
    {
      "id": 27,
      "start": 2508.1199951171875,
      "end": 2510.1199951171875,
      "text": " what You'll do. For it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-15T10:59:43.156614"
}