{
  "video_id": "42h9U6tWfAA",
  "text": "number four, 1 John chapter number four, and the title of our message you've seen in the bulletin on the back of the bulletin comes from the middle of verse number four. And I'll say this, the phrase from verse number four that we'll use as our title this morning is a phrase of Scripture that is often quoted, often referred to as it should be. The Bible says in the middle of verse number four, greater is he that is in you than he that is in the world. And we often quote and reference that truth of 1 John 4 in verse number four. And I'm so thankful for this truth in verse number four, as we started the fourth chapter of the book of 1 John, as we're studying through this book, last week, we noticed that there was a twofold exhortation to begin the fourth chapter of the book of 1 John. And that twofold exhortation, it started first by telling us this, believe not every spirit. And we found that we were given this truth from John as the false teachers, of course, were active and working. And John says to these believers that he's writing to, believe not every spirit. And then he says this, try the spirits. And he gives us the instruction on how we try the spirits to determine whether they are of God. He tells us that many false prophets have gone out into the world, and hereby know ye the Spirit of God. Every spirit that confesseth that Jesus Christ has come in the flesh is of God. And the contrast in verse number three, and every spirit that confesseth not that Jesus Christ has come in the flesh is not of God. And this is that spirit of antichrist, whereof ye have heard that it should come, and even now already is it in the world. And we find that these false teachers, they continue even to this very day to peddle their false doctrine. But we've been provided, as we study the Word of God, we've been provided with everything necessary to not only expose, but to overcome the false teachers, to overcome the false doctrine. Now, we find that the Spirit of truth indwells every believer, as we studied, as we referenced back to the book of John last week, we understand that Jesus said that He would send the Spirit of truth, and when He, the Spirit of truth, has come, that He will lead you into all truth. And for that, we ought to rejoice. And then He says this, thy word is truth, amen? And what a joy to understand this morning that God has given us everything that we need in order to expose and overcome the false teaching that continues to be prevalent even still today. We find that God has given us the authoritative, preserved, perfect Word of God, and every Word of God is pure. And we find that as we have the Spirit of God leading us into all truth, and we have the Word of God, that we are able to determine the truth and expose the error. Our God has blessed us with all spiritual blessings. He's given us all things that pertain unto life and godliness. We are equipped, God has equipped us to not be defeated by false teachers, but to overcome false teaching. And we ought to rejoice in that. We ought to be thankful for that this morning. And so we preach this message this morning, greater is He that is in you. Greater is He that is in you. Notice in verse number four, the text of Scripture continues, and John, under the inspiration of the Holy Spirit of God, says to these believers, ye are of God, little children, and have overcome them because greater is He that is in you than He that is in the world. They are of the world, therefore speak they of the world, and the world heareth them. We are of God. He that knoweth God heareth us. He that is not of God heareth not us. Hereby know we the Spirit of truth and the Spirit of error. Listen, there is the Holy Spirit of God, the third person of the Godhead, that is the Spirit of truth. But there is a Spirit of error. And we see that the enemy, the Satan, the enemy of God's people, the enemy of God Himself, that Spirit of error, the Spirit of antichrist that we read of in verse number three, it says at the end of the verse, of verse number three, even now already is it in the world. This morning, if you're taking notes, I want you to first notice what was recognized. Notice what is recognized in verse number four. As we begin reading this portion of this passage of Scripture, we find that John once again will refer to those that he's writing to. He says, you're of God, and he refers to them as little children. We read that back in the second chapter as well. But I want you to notice this phrase right at the beginning of verse number four. He says, and have overcome them. What is recognized by John under the inspiration of the Holy Spirit of God as he's writing to these believers, he is saying to them that ye have overcome them. And I want you to just think about this recognition for just a moment, and I want you to understand that contextually, as we look at the verse of Scripture, that the warning that had been given with regard to false teachers in the previous text of Scripture, that John is now recognizing that these recipients of this book, they had overcome the false teachers. They had not been overcome by the false teachers, no rather, they had overcome the false teachers. We find that these individuals that John is writing to, they had not been led astray. Aren't you thankful for that? The Bible tells us in the book of 2 Peter, in chapter number two, turn over there if you will, when we think about these false teachers and their desire, we looked at in the second chapter how the desire of these false teachers is to lead astray, to lead away. We look back in 2 Peter, notice how Peter words it here, but there were false prophets also among the people, even as there shall be false teachers among you, who privily shall bring in damnable heresies, even denying the Lord that bought them, and bring upon themselves swift destruction. Notice this in verse number two, and many shall follow their pernicious ways. You ever see how sometimes it seems like these false teachers, these false cults, they have a large following, they seem that they have a majority of people, and there are times in which, if we're not careful, that we may look at the size of a crowd and we might come to the conclusion that because of the size of the crowd, they may be right, they must be right, because look at how many people are following them. But the reality is that the Bible tells us Jesus, in fact, said broad was the road, the way that leads to destruction. Amen? Narrow. And we find here that as we look at the verse of Scripture in verse number two of 2 Peter chapter number two, that Peter says, many shall follow their pernicious ways. Remember, the Antichrist, or that spirit of Antichrist, we know that there will be an Antichrist, but the spirit of Antichrist is already working, and we find that the attack of the enemy, the desire of the enemy, is to blind people from truth, to keep them in darkness. That's 2 Corinthians chapter number four, and there are many that would follow their pernicious ways. Notice the end of verse number two. By reason of whom the way of truth shall be evil spoken of, and through covetousness shall they with feigned words make merchandise of you, whose judgment now of a long time lingereth not, and their damnation slumbereth not. What John is recognizing here in 1 John 4, in verse number four, when he makes the statement and have overcome them, them as the false teachers, and he's saying, listen, I've written this to you and I'm writing this to you and I'm encouraging and exhorting you to not believe every spirit, to try the spirits, to be aware of the false teachers, to understand their activity and their desire, but I'm rejoicing because why? You have overcome them. You've not been led astray. You've not been deceived. Listen to the truth of Ephesians 4, in verse number 14, when Paul is writing to the church in Ephesus and he's speaking there to these believers about those that were tossed to and fro. He says this in verse 14, that we henceforth be no more children tossed to and fro and carried about with every wind of doctrine by the slight of men and cunning craftiness. Notice what he says, whereby they lay in wait to deceive. Notice that John is writing to, he says that you've overcome them. You've not been deceived. It doesn't mean that you will never be deceived. I believe that as he's writing to them, he's saying you've not been deceived. Listen, I don't like being deceived. Do you? I do not like being deceived. I don't like being lied to. Just tell me the truth. Amen? Are you that way too? Just tell me the truth. Eventually, it's going to be found out anyway, right? Just tell me the truth. Don't lie to me. Don't deceive me. I don't want to be deceived. He wants to deceive. He's a liar, John 8, the father of it, right? And we find that here as we look at the text of Scripture, that John is recognizing that they've overcome them. They've not been led astray. They've not been deceived. They've not been seduced. In 1 John 2, in verse 26, he says of these false teachers, these many antichrists that he refers to in verse 18 of 1 John 2, in verse 26, he says, these things have I written unto you concerning them that seduce you. That is their desire. That is what they desire to do. teachers still exist, their false teaching is still prevalent in the society in which we live this morning, it's so necessary that we as the people of God guard against and are aware of false teaching that is prevalent, and that we know this book, that we study to show ourselves approved unto God, a workman that needeth not to be ashamed, rightly dividing the word of truth, that we search the Scriptures, that we know the Scriptures, that we are solid and grounded, and we find that John is saying, you've overcome them, these believers, they had been victorious, it was not because there were no false teachers, it was because they were walking in truth, it was because they had followed the instruction that had been given, the existence of false teachers this morning does not guarantee their triumph, and I'm thankful for that. Listen, there are false teachers that exist, but their existence does not guarantee their triumph. We can be victorious. We can look at this passage of Scripture and we can find that John is recognizing, he says to these believers, ye are of God, my little children, and have overcome them. What a joy. No doubt as John would write under the inspiration of the Holy Spirit of God, and as he would give this truth to these believers and he would recognize that they had overcome, I'm mindful of the statement in 3 John in verse number 4 when it says, I have no greater joy than to hear that my children walk in truth. No greater joy than to hear that my children walk in truth. Listen, John was not going to eradicate the false teachers. Amen? He wasn't going to eradicate them by himself, but what he could do is he could give instruction, and he could give warning. We find that God has given us the instruction and the warning and he's, yes, the false teachers exist, he told us, he made us aware of the fact, as we read in 2 Peter chapter number 2, Peter says, listen, there were false prophets and there will be false teachers. But what do we do about that? Do we just lay down and let them have victory? No, no, their existence does not guarantee their triumph. As we look at the text of Scripture, we notice what is recognized, but I notice how these believers are reminded. They're reminded of great truth. As we finish up the fourth verse of Scripture, we find that the Word of God continues. Notice in verse 4, it says, you're of God, little children, and have overcome them. And I want you to notice that next word, because that word is important. For we find that John, under the inspiration of the Holy Spirit of God, is going to remind these believers why it was that they had overcome these false teachers, that he was going to remind them, these people, these recipients of this letter for us this morning as it's been preserved for us and we are so thankful for the truth of the preservation of Scripture, it is necessary for us as the people of God to be reminded of some things. In fact, Paul would tell Timothy that what makes you a good minister is if you remind the believers, those that you're ministering to. Peter says it this way, I'm going to stir up your minds by putting you in remembrance. Though you know these things, these are not new things to you, you know them, but I'm going to remind you. How many times do we find that in the Old Testament, the people of God, they simply forgot. They forgot, they need to be reminded. The psalmist in Psalm 119 says, I will not forget. Think about the depth of that statement and how if we're going to make such a statement that I'm not going to forget, we better be in this book and we better be receiving it regularly and continually. Why? So that we do not forget. And we find that John, under the inspiration of the Holy Spirit of God, was going to remind the people of God. What was it that he was going to remind them? He was going to remind them that the victory that they had experienced was not a result of themselves. The victory that they were enjoying, the victory that they had over these false teachers was not about themselves, it was about the one living in them. And we need to be reminded of that this morning because the Bible says, year of God, little children, and have overcome them because greater is he that is in you than he that is in the world. What was it that caused these people to triumph, that caused them for John to be able to say that you've overcome them, the because is given, the reason is revealed to us, and John is reminding them it's because the one within you is greater than the one that's without. The enemy, the spirit of error that is mentioned at the end of verse number six, we find that I'm so thankful that he is the one that's within me, the Holy Spirit of God, the Spirit of Truth, the Comforter, that he indwells every believer at the moment of salvation, and he is the third person of the Godhead. He is God, and the Bible says that he indwells us, and because of the indwelling Holy Spirit of God, and because of the abiding of the Word of God within us, we can have the victory, and we can understand, listen, it's not about us. It's about Christ in us, the hope of glory. Notice what was said in 1 John chapter 2. Turn back, if you will, just a page or two, and I want you to notice in verses 12 through 14, as John is writing to these believers, and notice what he says in verse number 12 of 1 John chapter number 2. He says this, I write unto you little children, because your sins are forgiven you for his name's sake. Isn't it wonderful to know that you've been forgiven? I mention as I preach through this passage of Scripture in 1 John chapter number 2, that when we first get saved, really the only thing I really understood was that I was forgiven. I didn't understand all that I understand today about salvation and all that God did for me at that moment of salvation, but I understood that he promised to forgive me. He promised to save me. It continues, I write unto you fathers, because you have known him that is from the beginning. I write unto you young men, because you have overcome the wicked one. I write unto you little children, because you have known the Father. Notice in verse number 14, I have written unto you fathers, because you have known him that is from the beginning. I have written unto you young men, notice this, because you're strong, and the word of God abideth in you, and you have overcome the wicked one. He was not speaking about a physical strength in verse number 14. He was speaking about a spiritual strength. He was not saying that they had overcome the wicked one because of some physical strength, because of some time spent in a gym by following some protocol. No, he says that you've overcome. You're strong. Why? Because the word of God abideth in you. Be strong in the Lord, the power of his might. That's what Paul says to the believers in Ephesus in Ephesians chapter number six. We think about that spiritual strength. There's such an emphasis and such a focus in our society in which we live of the physical. There's so much time invested in the physical realm, and dealing with physical strength, and physical stature, and so on and so forth, and having that strength. And I understand it, and I see where we are in our society, but the reality is that the people of God… Listen, the Bible says bodily exercise profiteth little. There is a profit to bodily exercise. But I want you to understand this morning that we must make it serious, and we must make a priority of our spiritual strength. There is no way that any child of God should spend more time at a gym working on their physique than they do working on their spiritual strength. Amen? Come on. Help me this morning. Seriously. I'm for it. I've been trying to take care of some things physically, but the reality is that if I spend more time at the gym physically and less time in God's Word, that's not going to profit me. Amen? And we must understand this morning there are people that would never miss a day working out physically but think nothing about skipping reading the Bible. Think nothing about skipping church. Think nothing about… Do you understand what I'm saying this morning? Listen, that's when we become overcome because we're not strong spiritually. Physical strength is not what wins the battle in a spiritual battle. We wrestle not against flesh and blood but against spiritual wickedness in high places. The weapons of our warfare are not carnal. They're spiritual. The pulling down of strongholds. This morning as we think about this truth and we understand what these believers are being reminded of, I'm thankful that John recognized that they have overcome them, but understand this morning that just because they had victory at that moment does not mean that the enemy, that the false teacher, is going to pack up and go somewhere else. They're just going to try to come in a different door. They're just going to kind of come… Do you understand what I'm saying this morning? Because the false teachers, they are persistent. Our enemy is relentless. You read in the Old Testament about the way in which the enemy worked against the children of Israel. You read about how the enemy tried to destroy the Messianic line, and you read all of those instances. You understand. Listen, it's not just that Haman… hated Mordecai. If we're not careful, we read the book of Esther and we just think it's about some guy that hated some other guy. But it was Satan that was influencing Haman to destroy all of the Jews. Why? So that Messiah couldn't come. We see the broader picture. We understand the spiritual warfare that we're engaged in. And the enemy, we can be victorious today, but if we start thinking about, I was able to get that victory, then all of a sudden, what happened to Uzziah when he was strong? He was lifted up with pride. The Bible says this of Uzziah, that he was marvelously helped till he was strong. I want you to think about that statement. He was marvelously helped till he was strong. Oh, that God would help us to recognize that we need Him. We need Him. We sang this morning, stand up, stand up for Jesus. The songwriter said in that song, the arm of flesh will fail you. We sang it this morning. And we find that here as we look at this truth, the believers that John is writing to, he says to them in the second chapter, you are strong and you have overcome. Why? Because the Word of God abideth in you. In the third chapter, in verse number 24, John reminded them at the end of the verse, and hereby we know that He abideth in us by the Spirit which He hath given us. And so we have the Spirit of God that indwells us. We have the Word of God that is to be within us. And we must be reminded this morning that if we are going to overcome them, it is going to be because of those two things. Because of the Spirit of God and the Word of God. This morning, we must see that here in verses 5 and 6, He gives us the contrast. He speaks about they and we. In verse number 5, He says, they are of the world, therefore speak they of the world and the world heareth them. They're of the world. But we, we are of God. We are of God. And he that knoweth God heareth us. He that is not of God heareth not us. Hereby, by this, know we the Spirit of truth and the Spirit of error. This is a serious situation for these believers in the first century, but it continues to be a serious situation for us today. As I mentioned several weeks ago, false teaching is so prevalent in our society. It's not that false teaching is more prevalent today perhaps than it's ever been, but I would say it this way, it's more available. It's more at your fingertips right now than it ever has been. Listen, technology, if used properly, is a wonderful thing. But I'm going to tell you this morning that you get on that computer and you start typing stuff in Google, and Google has their search results and all that they do in providing you with some type of response, and I want you to know there's a lot of false teachers out there in cyber world. They got all kinds of things that they could spin. And we must understand this morning that God didn't say to us that we are going to overcome Him by a Google search. No. No. By the Word of God. Listen, I'm thankful for the theologians that went before us. How many of you have ever used a concordance before? I'm thankful for a concordance, but you're saying that Strong like sat down and wrote all that stuff. Can you imagine? I'm thankful for his labor. Every time I use a Strong's concordance, man, I am thankful for his labor. The time, the diligence. But I want you to understand, listen, I know many times people reference about commentaries. I have commentaries in my office, but I want you to know this morning that the greatest commentary on the Bible is the Bible. Listen, I need to know the Bible more than I need to know the commentary, because a commentary is only going to tell you what some person says about the Scriptures, right? And yet we find that God gives us the Word of God. I'm not suggesting that you should not have any commentary. I'm just suggesting that you ought to get into the Word of God. We ought to pray and ask God, teach us thy Word, lead me into truth, help me to understand this. But what happens with things being so readily available, sometimes we just rush and let somebody else's labor in their work kind of take care of our answer, our question, what have you. But the reality this morning is that we need to know the Word of God. And John is reminding these believers. He recognizes that they had been victorious. He recognizes that they had overcome them, but he reminds them, let me remind you why you have victory. Let me remind you why you overcame them. It's because greater is He that is in you than he that is in the world. This recognition and reminder leads me to a third thought this morning. And that is this, that we should consider how we should rejoice this morning. The existence of false teachers, the activity of Satan should not cause the people of God to fret, nor should it cause us to live in discouragement. Why? Why would we fret? Why would we live in discouragement? And this morning, as we think about the truth that God has given us, the reminder in this passage of Scripture, it starts with this two-fold exhortation. But we find that there's a group of believers that had been victorious, and John is reminding them why they had victory. And for us this morning, we find that even as these people should have rejoiced, that we too should rejoice in knowing that the activity and the existence of these false teachers, it should not cause us to wave some white flag of surrender. It should not cause us to live in discouragement. It should not cause us to say, well, I can't engage anybody with the Bible because I'm just not going to be able to answer their questions. No! We have truth. And truth is powerful. And we must not fret. We must not live lives of discouragement. We must not go hide somewhere and say, even so, come Lord Jesus. Listen, I want Jesus to come. I'm ready. I'm listening for the trumpet. Amen? Tim was playing the trumpet over here this morning when I'm over in Sunday school, and he was just kind of warming up, and I'm like, one day, we're going to hear that for real. Amen? And listen, the trumpet of God is going to sound. The dead in Christ shall rise, and we are going to be with Jesus forevermore. But I want you to understand that right now, we look at all of the society in which we're living and we look at the false teaching and we hear of these false prophets and we read of their peddling of their doctrine. Listen, they have more courage and they have more wherewithal to go out and peddle their false doctrine than most of God's people do to peddle the truth. Right? It's sad. The existence of false teachers should not cause us to be discouraged. I shouldn't sit over in a corner and just wring my hands, what are we going to do with these false teachers? No, God gave us truth. We're not prideful about it, we're not arrogant about it, we're not self-sufficient with regard to that. No, we're Christ-dependent. So, we have the truth. I don't have to fear. Sometimes we get all kinds of worked up over, well, they have a degree in this and they have a degree in that, and I'm not going to be able to answer their question, and they can use words that I never even heard of before, and just give the Bible. Notice in 1 Corinthians, I was going to turn here, but go over to 1 Corinthians just quickly. By the way, Romans chapter number 1 says, professing themselves to be wise, they became fools. Notice in 1 Corinthians chapter number 1, notice the Bible says this in verse number 18, for the preaching of the cross is to them that perish foolishness, but unto us which are saved it is the power of God. Verse number 23, we preach Christ crucified unto the Jews, the stumbling block, unto the Greeks foolishness, but unto them which are called, both Jews and Greeks, Christ, the power of God and the wisdom of God. Why? Because the foolishness of God is wiser than men, and the weakness of God is stronger than men. Look at verse number 26, for you see your calling brethren, how that not many wise men after the flesh, not many mighty, not many noble are called, but God hath chosen the foolish things of the world to confound the wise, and God hath chosen the weak things of the world to confound the things which are mighty, and base things of the world and things which are despised hath God chosen, yea, and things which are not to bring to naught things that are, why, that no flesh should glory in his presence. Our sufficiency is of Christ. We find that he says, but of him, in verse number. 30, are ye in Christ Jesus, who of God has made unto us wisdom and righteousness and sanctification and redemption, that according as it is written, he that glorieth, let him glory in the Lord.\" You know what God said in James 1? If any man lack wisdom, let him ask of God, who giveth all men liberally and upbraideth not. Listen, He's going to give us real wisdom. He is the all-wise God, omniscience. And He says, as the all-wise God, He says, hey, if you lack wisdom, you just ask me and I'll give you wisdom. Isn't that wonderful? There's a contrast in the second chapter of the book of 1 Corinthians in verses 6 and 7 between worldly wisdom and godly wisdom. Notice what it says in verse number 6. It says, how be it we speak wisdom among them that are perfect, yet not the wisdom of this world, nor of the princes of this world that come to nought, but we speak the wisdom of God in a mystery, even the hidden wisdom, which God ordained before the world unto our glory. This morning, we should rejoice in having truth. We should rejoice in the fact that greater is He that is in me than he that is in the world. The Holy Spirit of God indwells me. He guides me into all truth. He enables me. He is greater. We find this morning that we are more than conquerors, that we are on the winning side. And so often when we think about false teaching and we think about all of these cults and isms and so on and so forth, we can get all kinds of sideways and begin to think, how can I answer their questions? How can I engage in conversation? Let us not be discouraged, but let us rejoice because we know God, and God is able to give us the victory. God has equipped us as we look to the Word of God, as we take the truth of God's Word and we see those that are going around and giving these false doctrines and these false teachings, we find this morning that we have the truth. By the truth, the Word of God tells us in the book of Proverbs, sell it not. And this morning, as I think about those that would be identified as being false teachers, those cults that we have in our own land, we think about how they go around with great confidence, teaching their false doctrine. And yet for some reason, we as Christians, sometimes we just kind of keep our mouth shut. What are we going to say? How are we going to respond? What are we going to do? We have truth. You understand this morning that I believe that some of the most dangerous false teaching that exists today is that of humanism, Darwinian evolution. If you think about humanism, listen, they actually of themselves, if you look at their writings and such, they consider humanism a religion. We find this morning that these humanists, that they try to bring God down, exalt man. And you think about humanism, and you think about Darwinian evolution, and we think about those things that are being dealt with. Think about what our children are being taught in school today. Think about how they're taking and just twisting such basic revealed truth that is just naturally…I mean the natural man can understand some of the basic truth, and yet they twist it. They're teaching a false teaching, these false teachers, they're peddling their false doctrine. They're denying the existence of God. They're turning the grace of God into lasciviousness, and they're doing it boldly. They're doing it boldly. They're standing up. And sometimes, have you listened to people in recent days? And here's something that I listen to some of these people in recent days, and I'm like surely they did not hear what they just said. Have you thought that way too? There's no way their ears just heard what came out of their mouth. God's turned them over to a reprobate mind, according to Romans 1. But they're giving that false teaching, and they're giving it with boldness. They're corrupting a future generation. Some of the most basic things of life, of biology, right? Simple stuff. We're not going to call a mother a mother anymore, it's going to be a birthing parent? What? I'm not going to keep going down the path, but you understand what we're dealing with today. And they are corrupting the minds of young people. But I want you to understand what their objective is. Their endgame objective is that they can deny the existence of God. That's where it ends. This is not just, well, you know, we're going to agree to disagree and let them just kind of... No. They have an endgame. And their endgame is denying the existence of God, and if they can be successful in that, if they can teach these young people that there's no God, there's no authority, then guess what? First of all, people aren't going to get saved, and it's just going to get worse and worse and worse. Right? Denying the existence of God. If there's no God, then I become my own authority, right? There's no God, I don't need a Savior, God didn't create... Why do you think evolution has such a primary place in our society today? They want to deny the existence of God. God didn't create, so we take away the truth of Genesis, and then it undermines the entirety of God's Word. If God is not the Creator, if God did not create you, if Adam did not sin, if we are not born with a sin nature, you don't need a Redeemer. That's the endgame. But my Bible tells me that God is the Creator. My Bible tells me that He created everything out of nothing. Amen? My God tells me that Adam was put into a perfect place, a perfect environment, and he was given the instruction from God, and he and Eve, of course, they broke the commandment that God had given, and we find that sin entered into the world. But God knew it, because before the foundation of the world, Jesus is the Lamb of God that is slain before the foundation of the world. Thus, John the Baptist is able to see as Jesus comes on the scene, and he says, Behold, the Lamb of God, which taketh away the sin of the world. The one that's been prophesied of, the one that the prophets speak of, He has now come. This morning, we must rejoice in knowing the truth, and we must not think that we have to hide in a corner. That we have to, it's kind of interesting, we live in a society today that preaches tolerance, but they're the most intolerant group of people. I would say as Bible-believing Christians that we're tolerant people. Why? You can believe whatever you want to believe, but you're accountable for it. You believe there's no God? That's between you and God. I'd like to tell you the truth, but you're free to believe it. We're not going to make you convert to our belief, but you know what they're trying to do? They're trying to force their beliefs on you. I don't force my belief on anybody. If I go and knock on somebody's door, and they say, I'm not interested, I don't stick my foot in the door, I don't insist on them listening to me, I say, have a nice day. Would you take some time to read this? I'm not forcing my belief on anybody, but they want to force their belief on you. Think about this. Acts, if you will. Acts 4. I'll close with this this morning. We see what John recognized, that they had overcome them. We see how John reminded them that their victory was the result of greater is He that is in you than he which is in the world. They should rejoice, and we should rejoice, and the existence of false teachers does not guarantee their triumph. In fact, we are more than conquerors. We are on the winning side. As I mentioned a moment ago, we as the people of God should not fret because of their existence. We should not live in discouragement. We find that we are to be filled with the Holy Spirit of God, that we are to pray as they did. I asked you to turn to Acts 4, and I'll be there in just a moment, but we're to pray as they prayed that God would give us boldness, and they would speak the Word of God with boldness. We find it at the end of Acts 4, but I want you to see specifically with what we're dealing with as these religious leaders in Acts 4 would call people. Peter onto the carpet, so to speak, to give answer as to what had taken place with the miracle of chapter 3. And the Bible says this in v. 7, and when they had set them in the midst, they asked, by what power or by what name have you done this? Then Peter, and I want you to notice this statement, filled with the Holy Ghost. It is absolutely key. It is absolutely imperative. We read it in Acts 7. When you think about Stephen and him preaching and before he was martyred, it says in v. 55 of Acts 7, but he being full of the Holy Ghost. Listen, if we're not filled with the Spirit of God, we're in trouble. But he, Peter, filled with the Holy Ghost, said unto them, ye rulers of the people and elders of Israel, if we this day be examined of the good deed done to the impotent man, by what means he is made whole, be it known unto you all, and to all the people of Israel, that by the name of Jesus Christ of Nazareth, whom ye crucified, whom God raised from the dead, even by Him doth this man stand here before you whole. This is the stone which was set at naught of you builders, which has become the head of the corner. Neither is there salvation in any other. For there's none other name under heaven given among men whereby we must be saved. Now that's a great, great sermon. Call it a sermonette, just a few verses, amen? He preaches longer sermons later, and before, because Acts 2 is a little bit longer too. But I want you to notice that when he gets done answering their question, it says in verse number 13, now when they saw the boldness of Peter and John and perceived that they were unlearned and ignorant men, they marveled. And they took knowledge of them and noticed the last statement that they had been with Jesus. Listen, we don't need to be so worried about how am I gonna answer the PhD? I don't have a PhD. How am I gonna answer them? I just need to spend time with Jesus, amen? I just need to get in the book. We had lunch last week with, I'm gonna pick on you just for a minute, Michael. We had lunch, is it okay? Okay, he said sure. No, I'm just kidding. So we had lunch with them last Sunday. And Michael says, now, he asks this question first. You guys been reading the Constitution lately? Huh, no, not been reading the Constitution lately, sorry. He's a lawyer, right? So he says, have you read the Constitution lately? Nope, haven't read it lately. He says, so here's for some Constitution trivia. I'm like, are you kidding me, man? I lose, can I call a friend? Like, what am I gonna do, right? And he asks some obscure question and then admitted that he had just figured it out just recently. I'm like, you've been in law school and all this stuff? Listen, I'm not gonna try to debate Michael on law. I'm never gonna win. But as his pastor, I better be able to teach him the Word of God. Amen? Listen, I don't have to go out and fight toe to toe with somebody of some false whatever and what their level of biology and this learning and so on and so forth. No, no, I just need to spend time with Jesus and with His Word. Amen? And sometimes we get intimidated. If I have to debate Michael in law, I'm intimidated. I'm just being honest with you. But if we're gonna talk about the Word of God, we spend time with Jesus, we search the Scriptures, we study to show ourselves approved unto God. I don't have all the answers, but I know God does. And I'm gonna go to His book and I'm gonna be filled with the Spirit of God. These guys in Acts 4, they said, we perceive that these are unlearned and ignorant men, but they've been with Jesus. I wonder how many people would be able to say when they encounter you, they've been with Jesus. They've been with Jesus. Oh, that God would help us. Listen, this morning, the existence of false teachers shouldn't discourage us. God told us they're gonna be here. He told us how we can expose them and overcome them. And we need to simply abide in Him. Let this book abide in us. Walk in the Spirit, be filled with the Spirit of God, and understand and always remember, greater is He that is in you than he that is in the world. God, I need wisdom. He said, yes, child, I will give it to you. And I'll give it to you liberally. Let's pray. Father, we love you. Thank you for loving us. Thank you for the Word of God. I pray this morning that you would help us to engage our society, our culture, with the truth of thy Word. God, we've kept silent for too long. Forgive us. Though we often quote and refer to the truth of 1 John 4, 4, at times, if we'd be honest, we don't live like greater is He that is in us than he that is in the world. God, I pray that you'd help us to be filled with the Spirit of God, to walk in boldness, to preach thy Word with boldness. Help us to engage our culture with the truth of thy Word. Give us wisdom, oh God. I pray this morning that you'd move and work in hearts as only you can. Help us to rejoice for the truth. Help us to never forget, always remember that any victory that we may have is all because of you. For greater is he that is in you than he that is in the world. I pray that you'd move and work, seal every decision, and we'll thank you for it.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.239999771118164,
      "text": " number four, 1 John chapter number four, and the title of our message you've seen in the"
    },
    {
      "id": 1,
      "start": 5.239999771118164,
      "end": 9.0,
      "text": " bulletin on the back of the bulletin comes from the middle of verse number four."
    },
    {
      "id": 2,
      "start": 9.0,
      "end": 14.5600004196167,
      "text": " And I'll say this, the phrase from verse number four that we'll use as our title this morning"
    },
    {
      "id": 3,
      "start": 14.5600004196167,
      "end": 20.68000030517578,
      "text": " is a phrase of Scripture that is often quoted, often referred to as it should be."
    },
    {
      "id": 4,
      "start": 20.68000030517578,
      "end": 25.68000030517578,
      "text": " The Bible says in the middle of verse number four, greater is he that is in you than he"
    },
    {
      "id": 5,
      "start": 25.68000030517578,
      "end": 27.639999389648438,
      "text": " that is in the world."
    },
    {
      "id": 6,
      "start": 27.639999389648438,
      "end": 34.459999084472656,
      "text": " And we often quote and reference that truth of 1 John 4 in verse number four."
    },
    {
      "id": 7,
      "start": 34.459999084472656,
      "end": 39.79999923706055,
      "text": " And I'm so thankful for this truth in verse number four, as we started the fourth chapter"
    },
    {
      "id": 8,
      "start": 39.79999923706055,
      "end": 43.79999923706055,
      "text": " of the book of 1 John, as we're studying through this book, last week, we noticed that there"
    },
    {
      "id": 9,
      "start": 43.79999923706055,
      "end": 49.79999923706055,
      "text": " was a twofold exhortation to begin the fourth chapter of the book of 1 John."
    },
    {
      "id": 10,
      "start": 49.79999923706055,
      "end": 57.279998779296875,
      "text": " And that twofold exhortation, it started first by telling us this, believe not every spirit."
    },
    {
      "id": 11,
      "start": 57.720001220703125,
      "end": 63.400001525878906,
      "text": " And we found that we were given this truth from John as the false teachers, of course,"
    },
    {
      "id": 12,
      "start": 63.400001525878906,
      "end": 65.4800033569336,
      "text": " were active and working."
    },
    {
      "id": 13,
      "start": 65.4800033569336,
      "end": 70.08000183105469,
      "text": " And John says to these believers that he's writing to, believe not every spirit."
    },
    {
      "id": 14,
      "start": 70.08000183105469,
      "end": 73.58000183105469,
      "text": " And then he says this, try the spirits."
    },
    {
      "id": 15,
      "start": 73.58000183105469,
      "end": 77.45999908447266,
      "text": " And he gives us the instruction on how we try the spirits to determine whether they"
    },
    {
      "id": 16,
      "start": 77.45999908447266,
      "end": 78.68000030517578,
      "text": " are of God."
    },
    {
      "id": 17,
      "start": 78.68000030517578,
      "end": 82.95999908447266,
      "text": " He tells us that many false prophets have gone out into the world, and hereby know ye"
    },
    {
      "id": 18,
      "start": 82.95999908447266,
      "end": 84.95999908447266,
      "text": " the Spirit of God."
    },
    {
      "id": 19,
      "start": 84.95999908447266,
      "end": 89.19999694824219,
      "text": " Every spirit that confesseth that Jesus Christ has come in the flesh is of God."
    },
    {
      "id": 20,
      "start": 89.19999694824219,
      "end": 93.33999633789062,
      "text": " And the contrast in verse number three, and every spirit that confesseth not that Jesus"
    },
    {
      "id": 21,
      "start": 93.33999633789062,
      "end": 96.63999938964844,
      "text": " Christ has come in the flesh is not of God."
    },
    {
      "id": 22,
      "start": 96.63999938964844,
      "end": 102.4000015258789,
      "text": " And this is that spirit of antichrist, whereof ye have heard that it should come, and even"
    },
    {
      "id": 23,
      "start": 102.4000015258789,
      "end": 106.31999969482422,
      "text": " now already is it in the world."
    },
    {
      "id": 24,
      "start": 106.31999969482422,
      "end": 112.4800033569336,
      "text": " And we find that these false teachers, they continue even to this very day to peddle their"
    },
    {
      "id": 25,
      "start": 112.4800033569336,
      "end": 113.9800033569336,
      "text": " false doctrine."
    },
    {
      "id": 26,
      "start": 113.9800033569336,
      "end": 118.18000030517578,
      "text": " But we've been provided, as we study the Word of God, we've been provided with everything"
    },
    {
      "id": 27,
      "start": 118.18000030517578,
      "end": 125.33999633789062,
      "text": " necessary to not only expose, but to overcome the false teachers, to overcome the false"
    },
    {
      "id": 28,
      "start": 125.33999633789062,
      "end": 126.33999633789062,
      "text": " doctrine."
    },
    {
      "id": 29,
      "start": 126.33999633789062,
      "end": 131.1199951171875,
      "text": " Now, we find that the Spirit of truth indwells every believer, as we studied, as we referenced"
    },
    {
      "id": 30,
      "start": 131.1199951171875,
      "end": 135.5800018310547,
      "text": " back to the book of John last week, we understand that Jesus said that He would send the Spirit"
    },
    {
      "id": 31,
      "start": 135.5800018310547,
      "end": 142.4199981689453,
      "text": " of truth, and when He, the Spirit of truth, has come, that He will lead you into all truth."
    },
    {
      "id": 32,
      "start": 142.4199981689453,
      "end": 144.02000427246094,
      "text": " And for that, we ought to rejoice."
    },
    {
      "id": 33,
      "start": 144.02000427246094,
      "end": 147.66000366210938,
      "text": " And then He says this, thy word is truth, amen?"
    },
    {
      "id": 34,
      "start": 147.66000366210938,
      "end": 154.33999633789062,
      "text": " And what a joy to understand this morning that God has given us everything that we need"
    },
    {
      "id": 35,
      "start": 154.33999633789062,
      "end": 161.22000122070312,
      "text": " in order to expose and overcome the false teaching that continues to be prevalent even"
    },
    {
      "id": 36,
      "start": 161.22000122070312,
      "end": 163.17999267578125,
      "text": " still today."
    },
    {
      "id": 37,
      "start": 163.17999267578125,
      "end": 169.3800048828125,
      "text": " We find that God has given us the authoritative, preserved, perfect Word of God, and every"
    },
    {
      "id": 38,
      "start": 169.3800048828125,
      "end": 171.05999755859375,
      "text": " Word of God is pure."
    },
    {
      "id": 39,
      "start": 171.05999755859375,
      "end": 176.17999267578125,
      "text": " And we find that as we have the Spirit of God leading us into all truth, and we have"
    },
    {
      "id": 40,
      "start": 176.17999267578125,
      "end": 183.9199981689453,
      "text": " the Word of God, that we are able to determine the truth and expose the error."
    },
    {
      "id": 41,
      "start": 183.9199981689453,
      "end": 186.89999389648438,
      "text": " Our God has blessed us with all spiritual blessings."
    },
    {
      "id": 42,
      "start": 186.89999389648438,
      "end": 191.66000366210938,
      "text": " He's given us all things that pertain unto life and godliness."
    },
    {
      "id": 43,
      "start": 191.66000366210938,
      "end": 198.74000549316406,
      "text": " We are equipped, God has equipped us to not be defeated by false teachers, but to overcome"
    },
    {
      "id": 44,
      "start": 199.10000610351562,
      "end": 200.10000610351562,
      "text": " false teaching."
    },
    {
      "id": 45,
      "start": 200.10000610351562,
      "end": 201.10000610351562,
      "text": " And we ought to rejoice in that."
    },
    {
      "id": 46,
      "start": 201.10000610351562,
      "end": 203.33999633789062,
      "text": " We ought to be thankful for that this morning."
    },
    {
      "id": 47,
      "start": 203.33999633789062,
      "end": 207.67999267578125,
      "text": " And so we preach this message this morning, greater is He that is in you."
    },
    {
      "id": 48,
      "start": 207.67999267578125,
      "end": 209.25999450683594,
      "text": " Greater is He that is in you."
    },
    {
      "id": 49,
      "start": 209.25999450683594,
      "end": 213.6199951171875,
      "text": " Notice in verse number four, the text of Scripture continues, and John, under the inspiration"
    },
    {
      "id": 50,
      "start": 213.6199951171875,
      "end": 221.66000366210938,
      "text": " of the Holy Spirit of God, says to these believers, ye are of God, little children, and have overcome"
    },
    {
      "id": 51,
      "start": 221.66000366210938,
      "end": 227.5399932861328,
      "text": " them because greater is He that is in you than He that is in the world."
    },
    {
      "id": 52,
      "start": 227.5399932861328,
      "end": 234.5800018310547,
      "text": " They are of the world, therefore speak they of the world, and the world heareth them."
    },
    {
      "id": 53,
      "start": 234.5800018310547,
      "end": 236.4600067138672,
      "text": " We are of God."
    },
    {
      "id": 54,
      "start": 236.4600067138672,
      "end": 239.10000610351562,
      "text": " He that knoweth God heareth us."
    },
    {
      "id": 55,
      "start": 239.10000610351562,
      "end": 242.6199951171875,
      "text": " He that is not of God heareth not us."
    },
    {
      "id": 56,
      "start": 242.6199951171875,
      "end": 248.4199981689453,
      "text": " Hereby know we the Spirit of truth and the Spirit of error."
    },
    {
      "id": 57,
      "start": 248.4199981689453,
      "end": 254.4600067138672,
      "text": " Listen, there is the Holy Spirit of God, the third person of the Godhead, that is the Spirit"
    },
    {
      "id": 58,
      "start": 254.4600067138672,
      "end": 255.6999969482422,
      "text": " of truth."
    },
    {
      "id": 59,
      "start": 255.86000061035156,
      "end": 257.8599853515625,
      "text": " But there is a Spirit of error."
    },
    {
      "id": 60,
      "start": 257.8599853515625,
      "end": 265.7799987792969,
      "text": " And we see that the enemy, the Satan, the enemy of God's people, the enemy of God Himself,"
    },
    {
      "id": 61,
      "start": 265.7799987792969,
      "end": 271.05999755859375,
      "text": " that Spirit of error, the Spirit of antichrist that we read of in verse number three, it"
    },
    {
      "id": 62,
      "start": 271.05999755859375,
      "end": 277.9200134277344,
      "text": " says at the end of the verse, of verse number three, even now already is it in the world."
    },
    {
      "id": 63,
      "start": 277.9200134277344,
      "end": 281.8800048828125,
      "text": " This morning, if you're taking notes, I want you to first notice what was recognized."
    },
    {
      "id": 64,
      "start": 281.8800048828125,
      "end": 284.55999755859375,
      "text": " Notice what is recognized in verse number four."
    },
    {
      "id": 65,
      "start": 284.55999755859375,
      "end": 290.0400085449219,
      "text": " As we begin reading this portion of this passage of Scripture, we find that John once again"
    },
    {
      "id": 66,
      "start": 290.0400085449219,
      "end": 291.8800048828125,
      "text": " will refer to those that he's writing to."
    },
    {
      "id": 67,
      "start": 291.8800048828125,
      "end": 294.8999938964844,
      "text": " He says, you're of God, and he refers to them as little children."
    },
    {
      "id": 68,
      "start": 294.8999938964844,
      "end": 297.5,
      "text": " We read that back in the second chapter as well."
    },
    {
      "id": 69,
      "start": 297.5,
      "end": 301.1199951171875,
      "text": " But I want you to notice this phrase right at the beginning of verse number four."
    },
    {
      "id": 70,
      "start": 301.1199951171875,
      "end": 306.239990234375,
      "text": " He says, and have overcome them."
    },
    {
      "id": 71,
      "start": 306.239990234375,
      "end": 310.7200012207031,
      "text": " What is recognized by John under the inspiration of the Holy Spirit of God as he's writing"
    },
    {
      "id": 72,
      "start": 310.760009765625,
      "end": 315.8800048828125,
      "text": " to these believers, he is saying to them that ye have overcome them."
    },
    {
      "id": 73,
      "start": 315.8800048828125,
      "end": 320.0400085449219,
      "text": " And I want you to just think about this recognition for just a moment, and I want you to understand"
    },
    {
      "id": 74,
      "start": 320.0400085449219,
      "end": 324.6400146484375,
      "text": " that contextually, as we look at the verse of Scripture, that the warning that had been"
    },
    {
      "id": 75,
      "start": 324.6400146484375,
      "end": 330.20001220703125,
      "text": " given with regard to false teachers in the previous text of Scripture, that John is now"
    },
    {
      "id": 76,
      "start": 330.20001220703125,
      "end": 337.1600036621094,
      "text": " recognizing that these recipients of this book, they had overcome the false teachers."
    },
    {
      "id": 77,
      "start": 337.1600036621094,
      "end": 343.5400085449219,
      "text": " They had not been overcome by the false teachers, no rather, they had overcome the false teachers."
    },
    {
      "id": 78,
      "start": 343.5400085449219,
      "end": 349.3999938964844,
      "text": " We find that these individuals that John is writing to, they had not been led astray."
    },
    {
      "id": 79,
      "start": 349.3999938964844,
      "end": 351.0,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 80,
      "start": 351.0,
      "end": 354.5199890136719,
      "text": " The Bible tells us in the book of 2 Peter, in chapter number two, turn over there if"
    },
    {
      "id": 81,
      "start": 354.5199890136719,
      "end": 359.1199951171875,
      "text": " you will, when we think about these false teachers and their desire, we looked at in"
    },
    {
      "id": 82,
      "start": 359.1199951171875,
      "end": 365.20001220703125,
      "text": " the second chapter how the desire of these false teachers is to lead astray, to lead"
    },
    {
      "id": 83,
      "start": 365.20001220703125,
      "end": 366.20001220703125,
      "text": " away."
    },
    {
      "id": 84,
      "start": 366.239990234375,
      "end": 372.0,
      "text": " We look back in 2 Peter, notice how Peter words it here, but there were false prophets"
    },
    {
      "id": 85,
      "start": 372.0,
      "end": 379.20001220703125,
      "text": " also among the people, even as there shall be false teachers among you, who privily shall"
    },
    {
      "id": 86,
      "start": 379.20001220703125,
      "end": 384.79998779296875,
      "text": " bring in damnable heresies, even denying the Lord that bought them, and bring upon themselves"
    },
    {
      "id": 87,
      "start": 384.79998779296875,
      "end": 386.0799865722656,
      "text": " swift destruction."
    },
    {
      "id": 88,
      "start": 386.0799865722656,
      "end": 392.0799865722656,
      "text": " Notice this in verse number two, and many shall follow their pernicious ways."
    },
    {
      "id": 89,
      "start": 392.0799865722656,
      "end": 396.0400085449219,
      "text": " You ever see how sometimes it seems like these false teachers, these false cults, they have"
    },
    {
      "id": 90,
      "start": 396.0400085449219,
      "end": 401.1199951171875,
      "text": " a large following, they seem that they have a majority of people, and there are times"
    },
    {
      "id": 91,
      "start": 401.1199951171875,
      "end": 405.4800109863281,
      "text": " in which, if we're not careful, that we may look at the size of a crowd and we might come"
    },
    {
      "id": 92,
      "start": 405.4800109863281,
      "end": 409.9599914550781,
      "text": " to the conclusion that because of the size of the crowd, they may be right, they must"
    },
    {
      "id": 93,
      "start": 409.9599914550781,
      "end": 413.6000061035156,
      "text": " be right, because look at how many people are following them."
    },
    {
      "id": 94,
      "start": 413.6000061035156,
      "end": 417.6000061035156,
      "text": " But the reality is that the Bible tells us Jesus, in fact, said broad was the road, the"
    },
    {
      "id": 95,
      "start": 417.6000061035156,
      "end": 419.6000061035156,
      "text": " way that leads to destruction."
    },
    {
      "id": 96,
      "start": 419.6000061035156,
      "end": 420.6000061035156,
      "text": " Amen?"
    },
    {
      "id": 97,
      "start": 420.6000061035156,
      "end": 421.6000061035156,
      "text": " Narrow."
    },
    {
      "id": 98,
      "start": 421.6000061035156,
      "end": 426.79998779296875,
      "text": " And we find here that as we look at the verse of Scripture in verse number two of 2 Peter"
    },
    {
      "id": 99,
      "start": 426.79998779296875,
      "end": 432.0400085449219,
      "text": " chapter number two, that Peter says, many shall follow their pernicious ways."
    },
    {
      "id": 100,
      "start": 432.0400085449219,
      "end": 436.79998779296875,
      "text": " Remember, the Antichrist, or that spirit of Antichrist, we know that there will be an"
    },
    {
      "id": 101,
      "start": 436.79998779296875,
      "end": 441.6400146484375,
      "text": " Antichrist, but the spirit of Antichrist is already working, and we find that the attack"
    },
    {
      "id": 102,
      "start": 441.6400146484375,
      "end": 447.8399963378906,
      "text": " of the enemy, the desire of the enemy, is to blind people from truth, to keep them in"
    },
    {
      "id": 103,
      "start": 447.8399963378906,
      "end": 448.8399963378906,
      "text": " darkness."
    },
    {
      "id": 104,
      "start": 449.0799865722656,
      "end": 452.67999267578125,
      "text": " That's 2 Corinthians chapter number four, and there are many that would follow their"
    },
    {
      "id": 105,
      "start": 452.67999267578125,
      "end": 453.67999267578125,
      "text": " pernicious ways."
    },
    {
      "id": 106,
      "start": 453.67999267578125,
      "end": 455.1199951171875,
      "text": " Notice the end of verse number two."
    },
    {
      "id": 107,
      "start": 455.1199951171875,
      "end": 461.9200134277344,
      "text": " By reason of whom the way of truth shall be evil spoken of, and through covetousness shall"
    },
    {
      "id": 108,
      "start": 461.9200134277344,
      "end": 468.1600036621094,
      "text": " they with feigned words make merchandise of you, whose judgment now of a long time lingereth"
    },
    {
      "id": 109,
      "start": 468.1600036621094,
      "end": 472.239990234375,
      "text": " not, and their damnation slumbereth not."
    },
    {
      "id": 110,
      "start": 472.239990234375,
      "end": 477.7200012207031,
      "text": " What John is recognizing here in 1 John 4, in verse number four, when he makes the statement"
    },
    {
      "id": 111,
      "start": 478.0400085449219,
      "end": 484.79998779296875,
      "text": " and have overcome them, them as the false teachers, and he's saying, listen, I've written"
    },
    {
      "id": 112,
      "start": 484.79998779296875,
      "end": 490.0,
      "text": " this to you and I'm writing this to you and I'm encouraging and exhorting you to not believe"
    },
    {
      "id": 113,
      "start": 490.0,
      "end": 495.1600036621094,
      "text": " every spirit, to try the spirits, to be aware of the false teachers, to understand their"
    },
    {
      "id": 114,
      "start": 495.1600036621094,
      "end": 500.3599853515625,
      "text": " activity and their desire, but I'm rejoicing because why?"
    },
    {
      "id": 115,
      "start": 500.3599853515625,
      "end": 502.32000732421875,
      "text": " You have overcome them."
    },
    {
      "id": 116,
      "start": 502.32000732421875,
      "end": 504.0,
      "text": " You've not been led astray."
    },
    {
      "id": 117,
      "start": 504.0,
      "end": 505.7799987792969,
      "text": " You've not been deceived."
    },
    {
      "id": 118,
      "start": 505.7799987792969,
      "end": 510.5,
      "text": " Listen to the truth of Ephesians 4, in verse number 14, when Paul is writing to the church"
    },
    {
      "id": 119,
      "start": 510.5,
      "end": 516.4199829101562,
      "text": " in Ephesus and he's speaking there to these believers about those that were tossed to"
    },
    {
      "id": 120,
      "start": 516.4199829101562,
      "end": 517.5,
      "text": " and fro."
    },
    {
      "id": 121,
      "start": 517.5,
      "end": 522.4600219726562,
      "text": " He says this in verse 14, that we henceforth be no more children tossed to and fro and"
    },
    {
      "id": 122,
      "start": 522.4600219726562,
      "end": 527.8599853515625,
      "text": " carried about with every wind of doctrine by the slight of men and cunning craftiness."
    },
    {
      "id": 123,
      "start": 527.8599853515625,
      "end": 533.6599731445312,
      "text": " Notice what he says, whereby they lay in wait to deceive."
    },
    {
      "id": 124,
      "start": 533.6599731445312,
      "end": 538.5,
      "text": " Notice that John is writing to, he says that you've overcome them."
    },
    {
      "id": 125,
      "start": 538.5,
      "end": 539.5399780273438,
      "text": " You've not been deceived."
    },
    {
      "id": 126,
      "start": 539.5399780273438,
      "end": 541.8200073242188,
      "text": " It doesn't mean that you will never be deceived."
    },
    {
      "id": 127,
      "start": 541.8200073242188,
      "end": 544.780029296875,
      "text": " I believe that as he's writing to them, he's saying you've not been deceived."
    },
    {
      "id": 128,
      "start": 544.780029296875,
      "end": 547.5,
      "text": " Listen, I don't like being deceived."
    },
    {
      "id": 129,
      "start": 547.5,
      "end": 548.780029296875,
      "text": " Do you?"
    },
    {
      "id": 130,
      "start": 548.780029296875,
      "end": 549.9400024414062,
      "text": " I do not like being deceived."
    },
    {
      "id": 131,
      "start": 549.9400024414062,
      "end": 551.7999877929688,
      "text": " I don't like being lied to."
    },
    {
      "id": 132,
      "start": 551.7999877929688,
      "end": 552.7999877929688,
      "text": " Just tell me the truth."
    },
    {
      "id": 133,
      "start": 552.7999877929688,
      "end": 553.7999877929688,
      "text": " Amen?"
    },
    {
      "id": 134,
      "start": 553.7999877929688,
      "end": 554.7999877929688,
      "text": " Are you that way too?"
    },
    {
      "id": 135,
      "start": 554.7999877929688,
      "end": 555.7999877929688,
      "text": " Just tell me the truth."
    },
    {
      "id": 136,
      "start": 555.7999877929688,
      "end": 558.0599975585938,
      "text": " Eventually, it's going to be found out anyway, right?"
    },
    {
      "id": 137,
      "start": 558.0599975585938,
      "end": 559.0599975585938,
      "text": " Just tell me the truth."
    },
    {
      "id": 138,
      "start": 559.0599975585938,
      "end": 560.0599975585938,
      "text": " Don't lie to me."
    },
    {
      "id": 139,
      "start": 560.0599975585938,
      "end": 561.0599975585938,
      "text": " Don't deceive me."
    },
    {
      "id": 140,
      "start": 561.0599975585938,
      "end": 562.0599975585938,
      "text": " I don't want to be deceived."
    },
    {
      "id": 141,
      "start": 562.0599975585938,
      "end": 563.780029296875,
      "text": " He wants to deceive."
    },
    {
      "id": 142,
      "start": 563.780029296875,
      "end": 567.260009765625,
      "text": " He's a liar, John 8, the father of it, right?"
    },
    {
      "id": 143,
      "start": 567.260009765625,
      "end": 572.9400024414062,
      "text": " And we find that here as we look at the text of Scripture, that John is recognizing that"
    },
    {
      "id": 144,
      "start": 572.9400024414062,
      "end": 574.4199829101562,
      "text": " they've overcome them."
    },
    {
      "id": 145,
      "start": 574.4199829101562,
      "end": 575.9000244140625,
      "text": " They've not been led astray."
    },
    {
      "id": 146,
      "start": 575.9000244140625,
      "end": 577.0599975585938,
      "text": " They've not been deceived."
    },
    {
      "id": 147,
      "start": 577.0599975585938,
      "end": 578.3400268554688,
      "text": " They've not been seduced."
    },
    {
      "id": 148,
      "start": 578.3400268554688,
      "end": 585.260009765625,
      "text": " In 1 John 2, in verse 26, he says of these false teachers, these many antichrists that"
    },
    {
      "id": 149,
      "start": 585.260009765625,
      "end": 590.6199951171875,
      "text": " he refers to in verse 18 of 1 John 2, in verse 26, he says, these things have I written"
    },
    {
      "id": 150,
      "start": 590.6199951171875,
      "end": 593.9400024414062,
      "text": " unto you concerning them that seduce you."
    },
    {
      "id": 151,
      "start": 593.9400024414062,
      "end": 595.6199951171875,
      "text": " That is their desire."
    },
    {
      "id": 152,
      "start": 595.6199951171875,
      "end": 599.8599853515625,
      "text": " That is what they desire to do."
    },
    {
      "id": 0,
      "start": 599.8599853515625,
      "end": 604.5599851608276,
      "text": " teachers still exist, their false teaching is still prevalent in the society in which"
    },
    {
      "id": 1,
      "start": 604.5599851608276,
      "end": 610.0799856185913,
      "text": " we live this morning, it's so necessary that we as the people of God guard against"
    },
    {
      "id": 2,
      "start": 610.0799856185913,
      "end": 617.079984664917,
      "text": " and are aware of false teaching that is prevalent, and that we know this book, that we study"
    },
    {
      "id": 3,
      "start": 617.079984664917,
      "end": 622.6799850463867,
      "text": " to show ourselves approved unto God, a workman that needeth not to be ashamed, rightly dividing"
    },
    {
      "id": 4,
      "start": 622.6799850463867,
      "end": 628.4399852752686,
      "text": " the word of truth, that we search the Scriptures, that we know the Scriptures, that we are solid"
    },
    {
      "id": 5,
      "start": 628.4399852752686,
      "end": 635.9599838256836,
      "text": " and grounded, and we find that John is saying, you've overcome them, these believers, they"
    },
    {
      "id": 6,
      "start": 635.9599838256836,
      "end": 644.1999855041504,
      "text": " had been victorious, it was not because there were no false teachers, it was because they"
    },
    {
      "id": 7,
      "start": 644.1999855041504,
      "end": 650.6799850463867,
      "text": " were walking in truth, it was because they had followed the instruction that had been"
    },
    {
      "id": 8,
      "start": 650.6799850463867,
      "end": 658.6799850463867,
      "text": " given, the existence of false teachers this morning does not guarantee their triumph,"
    },
    {
      "id": 9,
      "start": 658.6799850463867,
      "end": 663.7199859619141,
      "text": " and I'm thankful for that. Listen, there are false teachers that exist, but their existence"
    },
    {
      "id": 10,
      "start": 663.7199859619141,
      "end": 671.9599838256836,
      "text": " does not guarantee their triumph. We can be victorious. We can look at this passage of"
    },
    {
      "id": 11,
      "start": 671.9599838256836,
      "end": 677.8799819946289,
      "text": " Scripture and we can find that John is recognizing, he says to these believers, ye are of God,"
    },
    {
      "id": 12,
      "start": 677.8799819946289,
      "end": 688.7599868774414,
      "text": " my little children, and have overcome them. What a joy. No doubt as John would write under"
    },
    {
      "id": 13,
      "start": 688.7599868774414,
      "end": 694.599983215332,
      "text": " the inspiration of the Holy Spirit of God, and as he would give this truth to these believers"
    },
    {
      "id": 14,
      "start": 694.599983215332,
      "end": 699.4799880981445,
      "text": " and he would recognize that they had overcome, I'm mindful of the statement in 3 John in"
    },
    {
      "id": 15,
      "start": 699.4799880981445,
      "end": 705.5599822998047,
      "text": " verse number 4 when it says, I have no greater joy than to hear that my children walk in"
    },
    {
      "id": 16,
      "start": 705.5599822998047,
      "end": 712.6799850463867,
      "text": " truth. No greater joy than to hear that my children walk in truth. Listen, John was not"
    },
    {
      "id": 17,
      "start": 712.6799850463867,
      "end": 718.9199829101562,
      "text": " going to eradicate the false teachers. Amen? He wasn't going to eradicate them by himself,"
    },
    {
      "id": 18,
      "start": 718.9199829101562,
      "end": 724.3599853515625,
      "text": " but what he could do is he could give instruction, and he could give warning. We find that God"
    },
    {
      "id": 19,
      "start": 724.3599853515625,
      "end": 728.6799926757812,
      "text": " has given us the instruction and the warning and he's, yes, the false teachers exist,"
    },
    {
      "id": 20,
      "start": 728.6799926757812,
      "end": 733.239990234375,
      "text": " he told us, he made us aware of the fact, as we read in 2 Peter chapter number 2, Peter"
    },
    {
      "id": 21,
      "start": 733.239990234375,
      "end": 739.7199859619141,
      "text": " says, listen, there were false prophets and there will be false teachers. But what do we do about"
    },
    {
      "id": 22,
      "start": 739.7199859619141,
      "end": 744.9999847412109,
      "text": " that? Do we just lay down and let them have victory? No, no, their existence does not guarantee"
    },
    {
      "id": 23,
      "start": 744.9999847412109,
      "end": 751.8799896240234,
      "text": " their triumph. As we look at the text of Scripture, we notice what is recognized, but I notice"
    },
    {
      "id": 24,
      "start": 751.8799896240234,
      "end": 758.1999816894531,
      "text": " how these believers are reminded. They're reminded of great truth. As we finish up the fourth verse"
    },
    {
      "id": 25,
      "start": 758.1999816894531,
      "end": 762.5999908447266,
      "text": " of Scripture, we find that the Word of God continues. Notice in verse 4, it says, you're of"
    },
    {
      "id": 26,
      "start": 762.5999908447266,
      "end": 767.6399841308594,
      "text": " God, little children, and have overcome them. And I want you to notice that next word, because"
    },
    {
      "id": 27,
      "start": 769.1599884033203,
      "end": 773.9599914550781,
      "text": " that word is important. For we find that John, under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 28,
      "start": 773.9599914550781,
      "end": 780.3599853515625,
      "text": " is going to remind these believers why it was that they had overcome these false teachers,"
    },
    {
      "id": 29,
      "start": 780.3599853515625,
      "end": 785.9599914550781,
      "text": " that he was going to remind them, these people, these recipients of this letter for us this"
    },
    {
      "id": 30,
      "start": 785.9599914550781,
      "end": 790.9199829101562,
      "text": " morning as it's been preserved for us and we are so thankful for the truth of the preservation of"
    },
    {
      "id": 31,
      "start": 790.9199829101562,
      "end": 797.8799896240234,
      "text": " Scripture, it is necessary for us as the people of God to be reminded of some things. In fact,"
    },
    {
      "id": 32,
      "start": 797.8799896240234,
      "end": 803.3199920654297,
      "text": " Paul would tell Timothy that what makes you a good minister is if you remind the believers,"
    },
    {
      "id": 33,
      "start": 803.3199920654297,
      "end": 808.4399871826172,
      "text": " those that you're ministering to. Peter says it this way, I'm going to stir up your minds by"
    },
    {
      "id": 34,
      "start": 808.4399871826172,
      "end": 814.5999908447266,
      "text": " putting you in remembrance. Though you know these things, these are not new things to you, you know"
    },
    {
      "id": 35,
      "start": 814.5999908447266,
      "end": 819.7199859619141,
      "text": " them, but I'm going to remind you. How many times do we find that in the Old Testament, the people"
    },
    {
      "id": 36,
      "start": 819.7199859619141,
      "end": 827.6399841308594,
      "text": " of God, they simply forgot. They forgot, they need to be reminded. The psalmist in Psalm 119 says,"
    },
    {
      "id": 37,
      "start": 827.6399841308594,
      "end": 834.4399871826172,
      "text": " I will not forget. Think about the depth of that statement and how if we're going to make such a"
    },
    {
      "id": 38,
      "start": 834.4399871826172,
      "end": 839.3199920654297,
      "text": " statement that I'm not going to forget, we better be in this book and we better be receiving it"
    },
    {
      "id": 39,
      "start": 839.3199920654297,
      "end": 844.9999847412109,
      "text": " regularly and continually. Why? So that we do not forget. And we find that John, under the"
    },
    {
      "id": 40,
      "start": 844.9999847412109,
      "end": 849.239990234375,
      "text": " inspiration of the Holy Spirit of God, was going to remind the people of God. What was it that he"
    },
    {
      "id": 41,
      "start": 849.239990234375,
      "end": 854.1999816894531,
      "text": " was going to remind them? He was going to remind them that the victory that they had experienced"
    },
    {
      "id": 42,
      "start": 854.1999816894531,
      "end": 861.239990234375,
      "text": " was not a result of themselves. The victory that they were enjoying, the victory that they had over"
    },
    {
      "id": 43,
      "start": 861.239990234375,
      "end": 867.47998046875,
      "text": " these false teachers was not about themselves, it was about the one living in them. And we need to"
    },
    {
      "id": 44,
      "start": 867.47998046875,
      "end": 874.0399780273438,
      "text": " be reminded of that this morning because the Bible says, year of God, little children, and have"
    },
    {
      "id": 45,
      "start": 874.0399780273438,
      "end": 885.7999877929688,
      "text": " overcome them because greater is he that is in you than he that is in the world. What was it that"
    },
    {
      "id": 46,
      "start": 885.7999877929688,
      "end": 891.47998046875,
      "text": " caused these people to triumph, that caused them for John to be able to say that you've overcome"
    },
    {
      "id": 47,
      "start": 891.47998046875,
      "end": 898.1199951171875,
      "text": " them, the because is given, the reason is revealed to us, and John is reminding them it's because the"
    },
    {
      "id": 48,
      "start": 898.1199951171875,
      "end": 905.719970703125,
      "text": " one within you is greater than the one that's without. The enemy, the spirit of error that is"
    },
    {
      "id": 49,
      "start": 905.719970703125,
      "end": 911.47998046875,
      "text": " mentioned at the end of verse number six, we find that I'm so thankful that he is the one that's"
    },
    {
      "id": 50,
      "start": 911.47998046875,
      "end": 916.8399963378906,
      "text": " within me, the Holy Spirit of God, the Spirit of Truth, the Comforter, that he indwells every"
    },
    {
      "id": 51,
      "start": 916.8399963378906,
      "end": 922.2799987792969,
      "text": " believer at the moment of salvation, and he is the third person of the Godhead. He is God,"
    },
    {
      "id": 52,
      "start": 922.2799987792969,
      "end": 928.5999755859375,
      "text": " and the Bible says that he indwells us, and because of the indwelling Holy Spirit of God,"
    },
    {
      "id": 53,
      "start": 928.5999755859375,
      "end": 934.5999755859375,
      "text": " and because of the abiding of the Word of God within us, we can have the victory,"
    },
    {
      "id": 54,
      "start": 934.5999755859375,
      "end": 942.5199890136719,
      "text": " and we can understand, listen, it's not about us. It's about Christ in us, the hope of glory."
    },
    {
      "id": 55,
      "start": 943.1599731445312,
      "end": 947.0,
      "text": " Notice what was said in 1 John chapter 2. Turn back, if you will, just a page or two,"
    },
    {
      "id": 56,
      "start": 947.0,
      "end": 952.3599853515625,
      "text": " and I want you to notice in verses 12 through 14, as John is writing to these believers,"
    },
    {
      "id": 57,
      "start": 952.3599853515625,
      "end": 958.5999755859375,
      "text": " and notice what he says in verse number 12 of 1 John chapter number 2. He says this,"
    },
    {
      "id": 58,
      "start": 958.5999755859375,
      "end": 963.0,
      "text": " I write unto you little children, because your sins are forgiven you for his name's sake."
    },
    {
      "id": 59,
      "start": 963.7999877929688,
      "end": 969.0,
      "text": " Isn't it wonderful to know that you've been forgiven? I mention as I preach through this"
    },
    {
      "id": 60,
      "start": 969.0,
      "end": 973.7999877929688,
      "text": " passage of Scripture in 1 John chapter number 2, that when we first get saved, really the only"
    },
    {
      "id": 61,
      "start": 973.7999877929688,
      "end": 978.5199890136719,
      "text": " thing I really understood was that I was forgiven. I didn't understand all that I understand today"
    },
    {
      "id": 62,
      "start": 978.5199890136719,
      "end": 983.1599731445312,
      "text": " about salvation and all that God did for me at that moment of salvation, but I understood that"
    },
    {
      "id": 63,
      "start": 983.1599731445312,
      "end": 988.5199890136719,
      "text": " he promised to forgive me. He promised to save me. It continues, I write unto you fathers,"
    },
    {
      "id": 64,
      "start": 988.5199890136719,
      "end": 992.3599853515625,
      "text": " because you have known him that is from the beginning. I write unto you young men, because"
    },
    {
      "id": 65,
      "start": 992.3599853515625,
      "end": 996.5199890136719,
      "text": " you have overcome the wicked one. I write unto you little children, because you have known the"
    },
    {
      "id": 66,
      "start": 996.5199890136719,
      "end": 1001.3199768066406,
      "text": " Father. Notice in verse number 14, I have written unto you fathers, because you have known him that"
    },
    {
      "id": 67,
      "start": 1001.3199768066406,
      "end": 1005.0,
      "text": " is from the beginning. I have written unto you young men, notice this, because you're strong,"
    },
    {
      "id": 68,
      "start": 1005.719970703125,
      "end": 1012.3599853515625,
      "text": " and the word of God abideth in you, and you have overcome the wicked one. He was not speaking about"
    },
    {
      "id": 69,
      "start": 1012.3599853515625,
      "end": 1017.0,
      "text": " a physical strength in verse number 14. He was speaking about a spiritual strength. He was not"
    },
    {
      "id": 70,
      "start": 1017.0,
      "end": 1022.3599853515625,
      "text": " saying that they had overcome the wicked one because of some physical strength, because of"
    },
    {
      "id": 71,
      "start": 1022.3599853515625,
      "end": 1027.7999877929688,
      "text": " some time spent in a gym by following some protocol. No, he says that you've overcome."
    },
    {
      "id": 72,
      "start": 1027.7999877929688,
      "end": 1035.239990234375,
      "text": " You're strong. Why? Because the word of God abideth in you. Be strong in the Lord, the power of his"
    },
    {
      "id": 73,
      "start": 1035.239990234375,
      "end": 1040.1999816894531,
      "text": " might. That's what Paul says to the believers in Ephesus in Ephesians chapter number six."
    },
    {
      "id": 74,
      "start": 1040.1999816894531,
      "end": 1046.6799926757812,
      "text": " We think about that spiritual strength. There's such an emphasis and such a focus in our society"
    },
    {
      "id": 75,
      "start": 1046.6799926757812,
      "end": 1054.6799926757812,
      "text": " in which we live of the physical. There's so much time invested in the physical realm, and"
    },
    {
      "id": 76,
      "start": 1054.6799926757812,
      "end": 1060.3599853515625,
      "text": " dealing with physical strength, and physical stature, and so on and so forth, and having that"
    },
    {
      "id": 77,
      "start": 1060.3599853515625,
      "end": 1064.7599792480469,
      "text": " strength. And I understand it, and I see where we are in our society, but the reality is that the"
    },
    {
      "id": 78,
      "start": 1064.7599792480469,
      "end": 1070.0399780273438,
      "text": " people of God… Listen, the Bible says bodily exercise profiteth little. There is a profit to"
    },
    {
      "id": 79,
      "start": 1070.0399780273438,
      "end": 1076.3599853515625,
      "text": " bodily exercise. But I want you to understand this morning that we must make it serious,"
    },
    {
      "id": 80,
      "start": 1076.3599853515625,
      "end": 1083.0,
      "text": " and we must make a priority of our spiritual strength. There is no way that any child of"
    },
    {
      "id": 81,
      "start": 1083.0,
      "end": 1088.2799987792969,
      "text": " God should spend more time at a gym working on their physique than they do working on their"
    },
    {
      "id": 82,
      "start": 1088.2799987792969,
      "end": 1095.9599914550781,
      "text": " spiritual strength. Amen? Come on. Help me this morning. Seriously. I'm for it. I've been trying"
    },
    {
      "id": 83,
      "start": 1096.6799926757812,
      "end": 1101.3199768066406,
      "text": " to take care of some things physically, but the reality is that if I spend more time at the gym"
    },
    {
      "id": 84,
      "start": 1101.3199768066406,
      "end": 1108.9199829101562,
      "text": " physically and less time in God's Word, that's not going to profit me. Amen? And we must understand"
    },
    {
      "id": 85,
      "start": 1108.9199829101562,
      "end": 1114.760009765625,
      "text": " this morning there are people that would never miss a day working out physically but think nothing"
    },
    {
      "id": 86,
      "start": 1114.760009765625,
      "end": 1121.0,
      "text": " about skipping reading the Bible. Think nothing about skipping church. Think nothing about… Do"
    },
    {
      "id": 87,
      "start": 1121.0,
      "end": 1125.47998046875,
      "text": " you understand what I'm saying this morning? Listen, that's when we become overcome"
    },
    {
      "id": 88,
      "start": 1127.47998046875,
      "end": 1133.239990234375,
      "text": " because we're not strong spiritually. Physical strength is not what wins the battle in a"
    },
    {
      "id": 89,
      "start": 1133.239990234375,
      "end": 1141.47998046875,
      "text": " spiritual battle. We wrestle not against flesh and blood but against spiritual wickedness in high"
    },
    {
      "id": 90,
      "start": 1141.47998046875,
      "end": 1152.2799682617188,
      "text": " places. The weapons of our warfare are not carnal. They're spiritual. The pulling down of"
    },
    {
      "id": 91,
      "start": 1152.2799682617188,
      "end": 1159.6400146484375,
      "text": " strongholds. This morning as we think about this truth and we understand what these believers are"
    },
    {
      "id": 92,
      "start": 1159.6400146484375,
      "end": 1164.0399780273438,
      "text": " being reminded of, I'm thankful that John recognized that they have overcome them,"
    },
    {
      "id": 93,
      "start": 1164.0399780273438,
      "end": 1169.47998046875,
      "text": " but understand this morning that just because they had victory at that moment does not mean"
    },
    {
      "id": 94,
      "start": 1169.47998046875,
      "end": 1173.47998046875,
      "text": " that the enemy, that the false teacher, is going to pack up and go somewhere else."
    },
    {
      "id": 95,
      "start": 1174.2799682617188,
      "end": 1178.5199584960938,
      "text": " They're just going to try to come in a different door. They're just going to kind of come… Do you"
    },
    {
      "id": 96,
      "start": 1178.5199584960938,
      "end": 1184.8399658203125,
      "text": " understand what I'm saying this morning? Because the false teachers, they are persistent. Our enemy"
    },
    {
      "id": 97,
      "start": 1184.8399658203125,
      "end": 1190.1199951171875,
      "text": " is relentless. You read in the Old Testament about the way in which the enemy worked against"
    },
    {
      "id": 98,
      "start": 1190.1199951171875,
      "end": 1195.719970703125,
      "text": " the children of Israel. You read about how the enemy tried to destroy the Messianic line,"
    },
    {
      "id": 99,
      "start": 1195.719970703125,
      "end": 1199.719970703125,
      "text": " and you read all of those instances. You understand. Listen, it's not just that Haman…"
    },
    {
      "id": 0,
      "start": 1199.719970703125,
      "end": 1202.4799706935883,
      "text": " hated Mordecai."
    },
    {
      "id": 1,
      "start": 1202.4799706935883,
      "end": 1205.6599707603455,
      "text": " If we're not careful, we read the book of Esther and we just think it's about some guy"
    },
    {
      "id": 2,
      "start": 1205.6599707603455,
      "end": 1208.4799709320068,
      "text": " that hated some other guy."
    },
    {
      "id": 3,
      "start": 1208.4799709320068,
      "end": 1213.1599702835083,
      "text": " But it was Satan that was influencing Haman to destroy all of the Jews."
    },
    {
      "id": 4,
      "start": 1213.1599702835083,
      "end": 1214.1599702835083,
      "text": " Why?"
    },
    {
      "id": 5,
      "start": 1214.1599702835083,
      "end": 1217.0399703979492,
      "text": " So that Messiah couldn't come."
    },
    {
      "id": 6,
      "start": 1217.0399703979492,
      "end": 1219.6599712371826,
      "text": " We see the broader picture."
    },
    {
      "id": 7,
      "start": 1219.6599712371826,
      "end": 1224.0399703979492,
      "text": " We understand the spiritual warfare that we're engaged in."
    },
    {
      "id": 8,
      "start": 1224.0399703979492,
      "end": 1230.3199710845947,
      "text": " And the enemy, we can be victorious today, but if we start thinking about, I was able"
    },
    {
      "id": 9,
      "start": 1230.3199710845947,
      "end": 1236.559970855713,
      "text": " to get that victory, then all of a sudden, what happened to Uzziah when he was strong?"
    },
    {
      "id": 10,
      "start": 1236.559970855713,
      "end": 1239.8399696350098,
      "text": " He was lifted up with pride."
    },
    {
      "id": 11,
      "start": 1239.8399696350098,
      "end": 1248.119972229004,
      "text": " The Bible says this of Uzziah, that he was marvelously helped till he was strong."
    },
    {
      "id": 12,
      "start": 1248.119972229004,
      "end": 1251.7999725341797,
      "text": " I want you to think about that statement."
    },
    {
      "id": 13,
      "start": 1251.7999725341797,
      "end": 1256.279972076416,
      "text": " He was marvelously helped till he was strong."
    },
    {
      "id": 14,
      "start": 1256.279972076416,
      "end": 1261.119972229004,
      "text": " Oh, that God would help us to recognize that we need Him."
    },
    {
      "id": 15,
      "start": 1261.119972229004,
      "end": 1262.9799690246582,
      "text": " We need Him."
    },
    {
      "id": 16,
      "start": 1262.9799690246582,
      "end": 1266.2799682617188,
      "text": " We sang this morning, stand up, stand up for Jesus."
    },
    {
      "id": 17,
      "start": 1266.2799682617188,
      "end": 1271.099967956543,
      "text": " The songwriter said in that song, the arm of flesh will fail you."
    },
    {
      "id": 18,
      "start": 1271.099967956543,
      "end": 1273.719970703125,
      "text": " We sang it this morning."
    },
    {
      "id": 19,
      "start": 1273.719970703125,
      "end": 1279.619972229004,
      "text": " And we find that here as we look at this truth, the believers that John is writing to, he"
    },
    {
      "id": 20,
      "start": 1279.619972229004,
      "end": 1283.5799713134766,
      "text": " says to them in the second chapter, you are strong and you have overcome."
    },
    {
      "id": 21,
      "start": 1283.5799713134766,
      "end": 1284.5799713134766,
      "text": " Why?"
    },
    {
      "id": 22,
      "start": 1284.5799713134766,
      "end": 1286.2599716186523,
      "text": " Because the Word of God abideth in you."
    },
    {
      "id": 23,
      "start": 1286.2599716186523,
      "end": 1291.0199737548828,
      "text": " In the third chapter, in verse number 24, John reminded them at the end of the verse,"
    },
    {
      "id": 24,
      "start": 1291.0199737548828,
      "end": 1295.4199676513672,
      "text": " and hereby we know that He abideth in us by the Spirit which He hath given us."
    },
    {
      "id": 25,
      "start": 1295.4199676513672,
      "end": 1298.6999740600586,
      "text": " And so we have the Spirit of God that indwells us."
    },
    {
      "id": 26,
      "start": 1298.6999740600586,
      "end": 1304.3799743652344,
      "text": " We have the Word of God that is to be within us."
    },
    {
      "id": 27,
      "start": 1304.3799743652344,
      "end": 1309.9399719238281,
      "text": " And we must be reminded this morning that if we are going to overcome them, it is going"
    },
    {
      "id": 28,
      "start": 1309.9399719238281,
      "end": 1312.8599700927734,
      "text": " to be because of those two things."
    },
    {
      "id": 29,
      "start": 1312.8599700927734,
      "end": 1316.339973449707,
      "text": " Because of the Spirit of God and the Word of God."
    },
    {
      "id": 30,
      "start": 1316.339973449707,
      "end": 1321.719970703125,
      "text": " This morning, we must see that here in verses 5 and 6, He gives us the contrast."
    },
    {
      "id": 31,
      "start": 1321.719970703125,
      "end": 1324.2999725341797,
      "text": " He speaks about they and we."
    },
    {
      "id": 32,
      "start": 1324.2999725341797,
      "end": 1330.4199676513672,
      "text": " In verse number 5, He says, they are of the world, therefore speak they of the world and"
    },
    {
      "id": 33,
      "start": 1330.4199676513672,
      "end": 1332.8999633789062,
      "text": " the world heareth them."
    },
    {
      "id": 34,
      "start": 1332.8999633789062,
      "end": 1337.3799743652344,
      "text": " They're of the world."
    },
    {
      "id": 35,
      "start": 1337.3799743652344,
      "end": 1340.6599731445312,
      "text": " But we, we are of God."
    },
    {
      "id": 36,
      "start": 1340.6599731445312,
      "end": 1342.2599639892578,
      "text": " We are of God."
    },
    {
      "id": 37,
      "start": 1342.2599639892578,
      "end": 1345.3799743652344,
      "text": " And he that knoweth God heareth us."
    },
    {
      "id": 38,
      "start": 1345.3799743652344,
      "end": 1348.0199737548828,
      "text": " He that is not of God heareth not us."
    },
    {
      "id": 39,
      "start": 1348.0199737548828,
      "end": 1355.8599700927734,
      "text": " Hereby, by this, know we the Spirit of truth and the Spirit of error."
    },
    {
      "id": 40,
      "start": 1355.8599700927734,
      "end": 1361.1799774169922,
      "text": " This is a serious situation for these believers in the first century, but it continues to"
    },
    {
      "id": 41,
      "start": 1361.1799774169922,
      "end": 1364.219970703125,
      "text": " be a serious situation for us today."
    },
    {
      "id": 42,
      "start": 1364.219970703125,
      "end": 1371.739974975586,
      "text": " As I mentioned several weeks ago, false teaching is so prevalent in our society."
    },
    {
      "id": 43,
      "start": 1371.739974975586,
      "end": 1376.5399780273438,
      "text": " It's not that false teaching is more prevalent today perhaps than it's ever been, but I would"
    },
    {
      "id": 44,
      "start": 1376.5399780273438,
      "end": 1380.0999755859375,
      "text": " say it this way, it's more available."
    },
    {
      "id": 45,
      "start": 1380.0999755859375,
      "end": 1384.1399688720703,
      "text": " It's more at your fingertips right now than it ever has been."
    },
    {
      "id": 46,
      "start": 1384.1399688720703,
      "end": 1389.5399780273438,
      "text": " Listen, technology, if used properly, is a wonderful thing."
    },
    {
      "id": 47,
      "start": 1389.5399780273438,
      "end": 1392.6599731445312,
      "text": " But I'm going to tell you this morning that you get on that computer and you start typing"
    },
    {
      "id": 48,
      "start": 1392.6599731445312,
      "end": 1399.699966430664,
      "text": " stuff in Google, and Google has their search results and all that they do in providing"
    },
    {
      "id": 49,
      "start": 1399.699966430664,
      "end": 1403.1199645996094,
      "text": " you with some type of response, and I want you to know there's a lot of false teachers"
    },
    {
      "id": 50,
      "start": 1403.1199645996094,
      "end": 1406.1399688720703,
      "text": " out there in cyber world."
    },
    {
      "id": 51,
      "start": 1406.1399688720703,
      "end": 1410.0199737548828,
      "text": " They got all kinds of things that they could spin."
    },
    {
      "id": 52,
      "start": 1410.0199737548828,
      "end": 1415.4199676513672,
      "text": " And we must understand this morning that God didn't say to us that we are going to overcome"
    },
    {
      "id": 53,
      "start": 1415.4199676513672,
      "end": 1417.0999755859375,
      "text": " Him by a Google search."
    },
    {
      "id": 54,
      "start": 1417.0999755859375,
      "end": 1418.0999755859375,
      "text": " No."
    },
    {
      "id": 55,
      "start": 1418.1399688720703,
      "end": 1419.1399688720703,
      "text": " No."
    },
    {
      "id": 56,
      "start": 1419.1399688720703,
      "end": 1420.1399688720703,
      "text": " By the Word of God."
    },
    {
      "id": 57,
      "start": 1420.1399688720703,
      "end": 1423.0599670410156,
      "text": " Listen, I'm thankful for the theologians that went before us."
    },
    {
      "id": 58,
      "start": 1423.0599670410156,
      "end": 1427.1399688720703,
      "text": " How many of you have ever used a concordance before?"
    },
    {
      "id": 59,
      "start": 1427.1399688720703,
      "end": 1432.2599639892578,
      "text": " I'm thankful for a concordance, but you're saying that Strong like sat down and wrote"
    },
    {
      "id": 60,
      "start": 1432.2599639892578,
      "end": 1433.2599639892578,
      "text": " all that stuff."
    },
    {
      "id": 61,
      "start": 1433.2599639892578,
      "end": 1434.2599639892578,
      "text": " Can you imagine?"
    },
    {
      "id": 62,
      "start": 1434.2599639892578,
      "end": 1437.6599731445312,
      "text": " I'm thankful for his labor."
    },
    {
      "id": 63,
      "start": 1437.6599731445312,
      "end": 1442.0599670410156,
      "text": " Every time I use a Strong's concordance, man, I am thankful for his labor."
    },
    {
      "id": 64,
      "start": 1442.0599670410156,
      "end": 1445.739974975586,
      "text": " The time, the diligence."
    },
    {
      "id": 65,
      "start": 1445.739974975586,
      "end": 1452.1799774169922,
      "text": " But I want you to understand, listen, I know many times people reference about commentaries."
    },
    {
      "id": 66,
      "start": 1452.1799774169922,
      "end": 1455.8199768066406,
      "text": " I have commentaries in my office, but I want you to know this morning that the greatest"
    },
    {
      "id": 67,
      "start": 1455.8199768066406,
      "end": 1457.8999633789062,
      "text": " commentary on the Bible is the Bible."
    },
    {
      "id": 68,
      "start": 1457.8999633789062,
      "end": 1463.97998046875,
      "text": " Listen, I need to know the Bible more than I need to know the commentary, because a commentary"
    },
    {
      "id": 69,
      "start": 1463.97998046875,
      "end": 1468.9399719238281,
      "text": " is only going to tell you what some person says about the Scriptures, right?"
    },
    {
      "id": 70,
      "start": 1468.9399719238281,
      "end": 1472.0599670410156,
      "text": " And yet we find that God gives us the Word of God."
    },
    {
      "id": 71,
      "start": 1472.0599670410156,
      "end": 1475.0599670410156,
      "text": " I'm not suggesting that you should not have any commentary."
    },
    {
      "id": 72,
      "start": 1475.0599670410156,
      "end": 1478.8999633789062,
      "text": " I'm just suggesting that you ought to get into the Word of God."
    },
    {
      "id": 73,
      "start": 1478.8999633789062,
      "end": 1485.0999755859375,
      "text": " We ought to pray and ask God, teach us thy Word, lead me into truth, help me to understand"
    },
    {
      "id": 74,
      "start": 1485.0999755859375,
      "end": 1486.0999755859375,
      "text": " this."
    },
    {
      "id": 75,
      "start": 1486.0999755859375,
      "end": 1489.8599853515625,
      "text": " But what happens with things being so readily available, sometimes we just rush and let"
    },
    {
      "id": 76,
      "start": 1489.8599853515625,
      "end": 1495.6199645996094,
      "text": " somebody else's labor in their work kind of take care of our answer, our question, what"
    },
    {
      "id": 77,
      "start": 1495.6199645996094,
      "end": 1496.6199645996094,
      "text": " have you."
    },
    {
      "id": 78,
      "start": 1496.6199645996094,
      "end": 1501.0599670410156,
      "text": " But the reality this morning is that we need to know the Word of God."
    },
    {
      "id": 79,
      "start": 1501.0599670410156,
      "end": 1503.2999572753906,
      "text": " And John is reminding these believers."
    },
    {
      "id": 80,
      "start": 1503.2999572753906,
      "end": 1506.8199768066406,
      "text": " He recognizes that they had been victorious."
    },
    {
      "id": 81,
      "start": 1506.8199768066406,
      "end": 1514.1399841308594,
      "text": " He recognizes that they had overcome them, but he reminds them, let me remind you why"
    },
    {
      "id": 82,
      "start": 1514.1399841308594,
      "end": 1515.8599853515625,
      "text": " you have victory."
    },
    {
      "id": 83,
      "start": 1515.8599853515625,
      "end": 1519.0199584960938,
      "text": " Let me remind you why you overcame them."
    },
    {
      "id": 84,
      "start": 1519.0199584960938,
      "end": 1527.5799560546875,
      "text": " It's because greater is He that is in you than he that is in the world."
    },
    {
      "id": 85,
      "start": 1527.5799560546875,
      "end": 1533.0599670410156,
      "text": " This recognition and reminder leads me to a third thought this morning."
    },
    {
      "id": 86,
      "start": 1533.0599670410156,
      "end": 1538.6599731445312,
      "text": " And that is this, that we should consider how we should rejoice this morning."
    },
    {
      "id": 87,
      "start": 1538.6599731445312,
      "end": 1545.8999633789062,
      "text": " The existence of false teachers, the activity of Satan should not cause the people of God"
    },
    {
      "id": 88,
      "start": 1545.8999633789062,
      "end": 1550.8599853515625,
      "text": " to fret, nor should it cause us to live in discouragement."
    },
    {
      "id": 89,
      "start": 1550.8599853515625,
      "end": 1553.1799621582031,
      "text": " Why?"
    },
    {
      "id": 90,
      "start": 1553.1799621582031,
      "end": 1554.2799682617188,
      "text": " Why would we fret?"
    },
    {
      "id": 91,
      "start": 1554.2799682617188,
      "end": 1557.4199829101562,
      "text": " Why would we live in discouragement?"
    },
    {
      "id": 92,
      "start": 1558.2599792480469,
      "end": 1563.5399780273438,
      "text": " And this morning, as we think about the truth that God has given us, the reminder in this"
    },
    {
      "id": 93,
      "start": 1563.5399780273438,
      "end": 1567.6599731445312,
      "text": " passage of Scripture, it starts with this two-fold exhortation."
    },
    {
      "id": 94,
      "start": 1567.6599731445312,
      "end": 1573.6599731445312,
      "text": " But we find that there's a group of believers that had been victorious, and John is reminding"
    },
    {
      "id": 95,
      "start": 1573.6599731445312,
      "end": 1575.3399658203125,
      "text": " them why they had victory."
    },
    {
      "id": 96,
      "start": 1575.3399658203125,
      "end": 1579.97998046875,
      "text": " And for us this morning, we find that even as these people should have rejoiced, that"
    },
    {
      "id": 97,
      "start": 1579.97998046875,
      "end": 1585.97998046875,
      "text": " we too should rejoice in knowing that the activity and the existence of these false"
    },
    {
      "id": 98,
      "start": 1585.97998046875,
      "end": 1590.47998046875,
      "text": " teachers, it should not cause us to wave some white flag of surrender."
    },
    {
      "id": 99,
      "start": 1590.47998046875,
      "end": 1593.219970703125,
      "text": " It should not cause us to live in discouragement."
    },
    {
      "id": 100,
      "start": 1593.219970703125,
      "end": 1596.97998046875,
      "text": " It should not cause us to say, well, I can't engage anybody with the Bible because I'm"
    },
    {
      "id": 101,
      "start": 1596.97998046875,
      "end": 1599.0999755859375,
      "text": " just not going to be able to answer their questions."
    },
    {
      "id": 102,
      "start": 1599.0999755859375,
      "end": 1600.0999755859375,
      "text": " No!"
    },
    {
      "id": 103,
      "start": 1600.0999755859375,
      "end": 1603.0199584960938,
      "text": " We have truth."
    },
    {
      "id": 104,
      "start": 1603.0199584960938,
      "end": 1606.0199584960938,
      "text": " And truth is powerful."
    },
    {
      "id": 105,
      "start": 1606.0199584960938,
      "end": 1607.5999755859375,
      "text": " And we must not fret."
    },
    {
      "id": 106,
      "start": 1607.5999755859375,
      "end": 1610.1399841308594,
      "text": " We must not live lives of discouragement."
    },
    {
      "id": 107,
      "start": 1610.1399841308594,
      "end": 1614.5399780273438,
      "text": " We must not go hide somewhere and say, even so, come Lord Jesus."
    },
    {
      "id": 108,
      "start": 1614.5399780273438,
      "end": 1617.4199829101562,
      "text": " Listen, I want Jesus to come."
    },
    {
      "id": 109,
      "start": 1617.4199829101562,
      "end": 1618.4199829101562,
      "text": " I'm ready."
    },
    {
      "id": 110,
      "start": 1618.4199829101562,
      "end": 1619.8999633789062,
      "text": " I'm listening for the trumpet."
    },
    {
      "id": 111,
      "start": 1619.8999633789062,
      "end": 1620.8999633789062,
      "text": " Amen?"
    },
    {
      "id": 112,
      "start": 1620.8999633789062,
      "end": 1624.6599731445312,
      "text": " Tim was playing the trumpet over here this morning when I'm over in Sunday school, and"
    },
    {
      "id": 113,
      "start": 1624.6599731445312,
      "end": 1628.6999816894531,
      "text": " he was just kind of warming up, and I'm like, one day, we're going to hear that for real."
    },
    {
      "id": 114,
      "start": 1628.6999816894531,
      "end": 1629.6999816894531,
      "text": " Amen?"
    },
    {
      "id": 115,
      "start": 1629.6999816894531,
      "end": 1632.0999755859375,
      "text": " And listen, the trumpet of God is going to sound."
    },
    {
      "id": 116,
      "start": 1632.0999755859375,
      "end": 1638.5599670410156,
      "text": " The dead in Christ shall rise, and we are going to be with Jesus forevermore."
    },
    {
      "id": 117,
      "start": 1638.5599670410156,
      "end": 1643.1799621582031,
      "text": " But I want you to understand that right now, we look at all of the society in which we're"
    },
    {
      "id": 118,
      "start": 1643.1799621582031,
      "end": 1648.1399841308594,
      "text": " living and we look at the false teaching and we hear of these false prophets and we"
    },
    {
      "id": 119,
      "start": 1648.1399841308594,
      "end": 1650.7799682617188,
      "text": " read of their peddling of their doctrine."
    },
    {
      "id": 120,
      "start": 1650.7799682617188,
      "end": 1656.1799621582031,
      "text": " Listen, they have more courage and they have more wherewithal to go out and peddle their"
    },
    {
      "id": 121,
      "start": 1656.1799621582031,
      "end": 1661.6599731445312,
      "text": " false doctrine than most of God's people do to peddle the truth."
    },
    {
      "id": 122,
      "start": 1661.6599731445312,
      "end": 1663.3799743652344,
      "text": " Right?"
    },
    {
      "id": 123,
      "start": 1663.3799743652344,
      "end": 1666.219970703125,
      "text": " It's sad."
    },
    {
      "id": 124,
      "start": 1666.219970703125,
      "end": 1670.8199768066406,
      "text": " The existence of false teachers should not cause us to be discouraged."
    },
    {
      "id": 125,
      "start": 1670.8199768066406,
      "end": 1673.7799682617188,
      "text": " I shouldn't sit over in a corner and just wring my hands, what are we going to do with"
    },
    {
      "id": 126,
      "start": 1673.7799682617188,
      "end": 1675.6599731445312,
      "text": " these false teachers?"
    },
    {
      "id": 127,
      "start": 1675.6599731445312,
      "end": 1679.0599670410156,
      "text": " No, God gave us truth."
    },
    {
      "id": 128,
      "start": 1679.0599670410156,
      "end": 1685.6599731445312,
      "text": " We're not prideful about it, we're not arrogant about it, we're not self-sufficient with regard"
    },
    {
      "id": 129,
      "start": 1685.6599731445312,
      "end": 1686.6599731445312,
      "text": " to that."
    },
    {
      "id": 130,
      "start": 1686.6599731445312,
      "end": 1687.6599731445312,
      "text": " No, we're Christ-dependent."
    },
    {
      "id": 131,
      "start": 1687.6599731445312,
      "end": 1690.0999755859375,
      "text": " So, we have the truth."
    },
    {
      "id": 132,
      "start": 1690.0999755859375,
      "end": 1693.1399841308594,
      "text": " I don't have to fear."
    },
    {
      "id": 133,
      "start": 1693.1399841308594,
      "end": 1697.4599609375,
      "text": " Sometimes we get all kinds of worked up over, well, they have a degree in this and they"
    },
    {
      "id": 134,
      "start": 1697.4599609375,
      "end": 1700.6199645996094,
      "text": " have a degree in that, and I'm not going to be able to answer their question, and they"
    },
    {
      "id": 135,
      "start": 1700.6199645996094,
      "end": 1708.2599792480469,
      "text": " can use words that I never even heard of before, and just give the Bible."
    },
    {
      "id": 136,
      "start": 1708.2599792480469,
      "end": 1713.0199584960938,
      "text": " Notice in 1 Corinthians, I was going to turn here, but go over to 1 Corinthians just quickly."
    },
    {
      "id": 137,
      "start": 1713.0199584960938,
      "end": 1716.0999755859375,
      "text": " By the way, Romans chapter number 1 says, professing themselves to be wise, they became"
    },
    {
      "id": 138,
      "start": 1716.0999755859375,
      "end": 1718.8599853515625,
      "text": " fools."
    },
    {
      "id": 139,
      "start": 1718.8599853515625,
      "end": 1732.219970703125,
      "text": " Notice in 1 Corinthians chapter number 1, notice the Bible says this in verse number"
    },
    {
      "id": 140,
      "start": 1732.219970703125,
      "end": 1736.4599609375,
      "text": " 18, for the preaching of the cross is to them that perish foolishness, but unto us which"
    },
    {
      "id": 141,
      "start": 1736.4599609375,
      "end": 1740.6599731445312,
      "text": " are saved it is the power of God."
    },
    {
      "id": 142,
      "start": 1740.6599731445312,
      "end": 1745.0599975585938,
      "text": " Verse number 23, we preach Christ crucified unto the Jews, the stumbling block, unto the"
    },
    {
      "id": 143,
      "start": 1745.0599975585938,
      "end": 1749.4199829101562,
      "text": " Greeks foolishness, but unto them which are called, both Jews and Greeks, Christ, the"
    },
    {
      "id": 144,
      "start": 1749.4199829101562,
      "end": 1751.5799560546875,
      "text": " power of God and the wisdom of God."
    },
    {
      "id": 145,
      "start": 1751.5799560546875,
      "end": 1752.5799560546875,
      "text": " Why?"
    },
    {
      "id": 146,
      "start": 1752.5799560546875,
      "end": 1761.5399780273438,
      "text": " Because the foolishness of God is wiser than men, and the weakness of God is stronger than"
    },
    {
      "id": 147,
      "start": 1761.5399780273438,
      "end": 1763.739990234375,
      "text": " men."
    },
    {
      "id": 148,
      "start": 1763.739990234375,
      "end": 1768.5,
      "text": " Look at verse number 26, for you see your calling brethren, how that not many wise men"
    },
    {
      "id": 149,
      "start": 1768.5,
      "end": 1773.0999755859375,
      "text": " after the flesh, not many mighty, not many noble are called, but God hath chosen the"
    },
    {
      "id": 150,
      "start": 1773.1399536132812,
      "end": 1777.739990234375,
      "text": " foolish things of the world to confound the wise, and God hath chosen the weak things"
    },
    {
      "id": 151,
      "start": 1777.739990234375,
      "end": 1781.5799560546875,
      "text": " of the world to confound the things which are mighty, and base things of the world and"
    },
    {
      "id": 152,
      "start": 1781.5799560546875,
      "end": 1786.1399536132812,
      "text": " things which are despised hath God chosen, yea, and things which are not to bring to"
    },
    {
      "id": 153,
      "start": 1786.1399536132812,
      "end": 1793.6599731445312,
      "text": " naught things that are, why, that no flesh should glory in his presence."
    },
    {
      "id": 154,
      "start": 1793.6599731445312,
      "end": 1797.219970703125,
      "text": " Our sufficiency is of Christ."
    },
    {
      "id": 155,
      "start": 1797.219970703125,
      "end": 1799.7799682617188,
      "text": " We find that he says, but of him, in verse number."
    },
    {
      "id": 0,
      "start": 1799.7799682617188,
      "end": 1805.1599683761597,
      "text": " 30, are ye in Christ Jesus, who of God has made unto us wisdom and righteousness and"
    },
    {
      "id": 1,
      "start": 1805.1599683761597,
      "end": 1810.8399686813354,
      "text": " sanctification and redemption, that according as it is written, he that glorieth, let him"
    },
    {
      "id": 2,
      "start": 1810.8399686813354,
      "end": 1814.519968032837,
      "text": " glory in the Lord.\""
    },
    {
      "id": 3,
      "start": 1814.519968032837,
      "end": 1817.679967880249,
      "text": " You know what God said in James 1?"
    },
    {
      "id": 4,
      "start": 1817.679967880249,
      "end": 1823.4799690246582,
      "text": " If any man lack wisdom, let him ask of God, who giveth all men liberally and upbraideth"
    },
    {
      "id": 5,
      "start": 1823.4799690246582,
      "end": 1824.4799690246582,
      "text": " not."
    },
    {
      "id": 6,
      "start": 1824.4799690246582,
      "end": 1827.7199687957764,
      "text": " Listen, He's going to give us real wisdom."
    },
    {
      "id": 7,
      "start": 1827.7199687957764,
      "end": 1832.1199684143066,
      "text": " He is the all-wise God, omniscience."
    },
    {
      "id": 8,
      "start": 1832.1199684143066,
      "end": 1837.5199699401855,
      "text": " And He says, as the all-wise God, He says, hey, if you lack wisdom, you just ask me and"
    },
    {
      "id": 9,
      "start": 1837.5199699401855,
      "end": 1838.5199699401855,
      "text": " I'll give you wisdom."
    },
    {
      "id": 10,
      "start": 1838.5199699401855,
      "end": 1840.5199699401855,
      "text": " Isn't that wonderful?"
    },
    {
      "id": 11,
      "start": 1840.5199699401855,
      "end": 1844.7999687194824,
      "text": " There's a contrast in the second chapter of the book of 1 Corinthians in verses 6 and"
    },
    {
      "id": 12,
      "start": 1844.7999687194824,
      "end": 1847.2399673461914,
      "text": " 7 between worldly wisdom and godly wisdom."
    },
    {
      "id": 13,
      "start": 1847.2399673461914,
      "end": 1849.4799690246582,
      "text": " Notice what it says in verse number 6."
    },
    {
      "id": 14,
      "start": 1849.4799690246582,
      "end": 1854.6799697875977,
      "text": " It says, how be it we speak wisdom among them that are perfect, yet not the wisdom of this"
    },
    {
      "id": 15,
      "start": 1854.6799697875977,
      "end": 1860.7199668884277,
      "text": " world, nor of the princes of this world that come to nought, but we speak the wisdom of"
    },
    {
      "id": 16,
      "start": 1860.7199668884277,
      "end": 1868.319969177246,
      "text": " God in a mystery, even the hidden wisdom, which God ordained before the world unto our"
    },
    {
      "id": 17,
      "start": 1868.319969177246,
      "end": 1870.0399703979492,
      "text": " glory."
    },
    {
      "id": 18,
      "start": 1870.0399703979492,
      "end": 1874.5199661254883,
      "text": " This morning, we should rejoice in having truth."
    },
    {
      "id": 19,
      "start": 1874.5199661254883,
      "end": 1879.3599700927734,
      "text": " We should rejoice in the fact that greater is He that is in me than he that is in the"
    },
    {
      "id": 20,
      "start": 1879.3599700927734,
      "end": 1880.3599700927734,
      "text": " world."
    },
    {
      "id": 21,
      "start": 1880.3599700927734,
      "end": 1882.479965209961,
      "text": " The Holy Spirit of God indwells me."
    },
    {
      "id": 22,
      "start": 1882.479965209961,
      "end": 1884.1599655151367,
      "text": " He guides me into all truth."
    },
    {
      "id": 23,
      "start": 1884.1599655151367,
      "end": 1885.319969177246,
      "text": " He enables me."
    },
    {
      "id": 24,
      "start": 1885.319969177246,
      "end": 1886.5199661254883,
      "text": " He is greater."
    },
    {
      "id": 25,
      "start": 1886.5199661254883,
      "end": 1893.0799713134766,
      "text": " We find this morning that we are more than conquerors, that we are on the winning side."
    },
    {
      "id": 26,
      "start": 1893.0799713134766,
      "end": 1898.319969177246,
      "text": " And so often when we think about false teaching and we think about all of these cults and"
    },
    {
      "id": 27,
      "start": 1898.319969177246,
      "end": 1903.6399688720703,
      "text": " isms and so on and so forth, we can get all kinds of sideways and begin to think, how"
    },
    {
      "id": 28,
      "start": 1903.6399688720703,
      "end": 1905.3399658203125,
      "text": " can I answer their questions?"
    },
    {
      "id": 29,
      "start": 1905.3399658203125,
      "end": 1910.0399703979492,
      "text": " How can I engage in conversation?"
    },
    {
      "id": 30,
      "start": 1910.0399703979492,
      "end": 1919.7999649047852,
      "text": " Let us not be discouraged, but let us rejoice because we know God, and God is able to give"
    },
    {
      "id": 31,
      "start": 1919.7999649047852,
      "end": 1922.0399703979492,
      "text": " us the victory."
    },
    {
      "id": 32,
      "start": 1922.0399703979492,
      "end": 1927.719970703125,
      "text": " God has equipped us as we look to the Word of God, as we take the truth of God's Word"
    },
    {
      "id": 33,
      "start": 1927.719970703125,
      "end": 1933.719970703125,
      "text": " and we see those that are going around and giving these false doctrines and these false"
    },
    {
      "id": 34,
      "start": 1933.719970703125,
      "end": 1940.0799713134766,
      "text": " teachings, we find this morning that we have the truth."
    },
    {
      "id": 35,
      "start": 1940.0799713134766,
      "end": 1945.1199645996094,
      "text": " By the truth, the Word of God tells us in the book of Proverbs, sell it not."
    },
    {
      "id": 36,
      "start": 1945.1199645996094,
      "end": 1954.479965209961,
      "text": " And this morning, as I think about those that would be identified as being false teachers,"
    },
    {
      "id": 37,
      "start": 1954.479965209961,
      "end": 1961.8399658203125,
      "text": " those cults that we have in our own land, we think about how they go around with great"
    },
    {
      "id": 38,
      "start": 1961.9599609375,
      "end": 1968.3599700927734,
      "text": " confidence, teaching their false doctrine."
    },
    {
      "id": 39,
      "start": 1968.3599700927734,
      "end": 1974.5999755859375,
      "text": " And yet for some reason, we as Christians, sometimes we just kind of keep our mouth shut."
    },
    {
      "id": 40,
      "start": 1974.5999755859375,
      "end": 1976.719970703125,
      "text": " What are we going to say?"
    },
    {
      "id": 41,
      "start": 1976.719970703125,
      "end": 1977.719970703125,
      "text": " How are we going to respond?"
    },
    {
      "id": 42,
      "start": 1977.719970703125,
      "end": 1978.719970703125,
      "text": " What are we going to do?"
    },
    {
      "id": 43,
      "start": 1978.719970703125,
      "end": 1979.719970703125,
      "text": " We have truth."
    },
    {
      "id": 44,
      "start": 1979.719970703125,
      "end": 1989.3999633789062,
      "text": " You understand this morning that I believe that some of the most dangerous false teaching"
    },
    {
      "id": 45,
      "start": 1989.3999633789062,
      "end": 1995.479965209961,
      "text": " that exists today is that of humanism, Darwinian evolution."
    },
    {
      "id": 46,
      "start": 1995.479965209961,
      "end": 2002.8399658203125,
      "text": " If you think about humanism, listen, they actually of themselves, if you look at their"
    },
    {
      "id": 47,
      "start": 2002.8399658203125,
      "end": 2010.7999725341797,
      "text": " writings and such, they consider humanism a religion."
    },
    {
      "id": 48,
      "start": 2010.7999725341797,
      "end": 2020.719970703125,
      "text": " We find this morning that these humanists, that they try to bring God down, exalt man."
    },
    {
      "id": 49,
      "start": 2020.719970703125,
      "end": 2024.719970703125,
      "text": " And you think about humanism, and you think about Darwinian evolution, and we think about"
    },
    {
      "id": 50,
      "start": 2024.719970703125,
      "end": 2026.1199645996094,
      "text": " those things that are being dealt with."
    },
    {
      "id": 51,
      "start": 2026.1199645996094,
      "end": 2031.739974975586,
      "text": " Think about what our children are being taught in school today."
    },
    {
      "id": 52,
      "start": 2031.739974975586,
      "end": 2042.9399719238281,
      "text": " Think about how they're taking and just twisting such basic revealed truth that is just naturally…I"
    },
    {
      "id": 53,
      "start": 2042.9399719238281,
      "end": 2051.8199615478516,
      "text": " mean the natural man can understand some of the basic truth, and yet they twist it."
    },
    {
      "id": 54,
      "start": 2051.8199615478516,
      "end": 2060.5399780273438,
      "text": " They're teaching a false teaching, these false teachers, they're peddling their false doctrine."
    },
    {
      "id": 55,
      "start": 2060.5399780273438,
      "end": 2064.2999572753906,
      "text": " They're denying the existence of God."
    },
    {
      "id": 56,
      "start": 2064.2999572753906,
      "end": 2072.2999572753906,
      "text": " They're turning the grace of God into lasciviousness, and they're doing it boldly."
    },
    {
      "id": 57,
      "start": 2072.2999572753906,
      "end": 2075.97998046875,
      "text": " They're doing it boldly."
    },
    {
      "id": 58,
      "start": 2075.97998046875,
      "end": 2076.97998046875,
      "text": " They're standing up."
    },
    {
      "id": 59,
      "start": 2076.97998046875,
      "end": 2081.3399658203125,
      "text": " And sometimes, have you listened to people in recent days?"
    },
    {
      "id": 60,
      "start": 2081.3399658203125,
      "end": 2085.0999755859375,
      "text": " And here's something that I listen to some of these people in recent days, and I'm like"
    },
    {
      "id": 61,
      "start": 2085.0999755859375,
      "end": 2088.1399536132812,
      "text": " surely they did not hear what they just said."
    },
    {
      "id": 62,
      "start": 2088.1399536132812,
      "end": 2090.3399658203125,
      "text": " Have you thought that way too?"
    },
    {
      "id": 63,
      "start": 2090.3399658203125,
      "end": 2099.6199645996094,
      "text": " There's no way their ears just heard what came out of their mouth."
    },
    {
      "id": 64,
      "start": 2099.6199645996094,
      "end": 2105.179962158203,
      "text": " God's turned them over to a reprobate mind, according to Romans 1."
    },
    {
      "id": 65,
      "start": 2105.179962158203,
      "end": 2111.499969482422,
      "text": " But they're giving that false teaching, and they're giving it with boldness."
    },
    {
      "id": 66,
      "start": 2111.499969482422,
      "end": 2115.259979248047,
      "text": " They're corrupting a future generation."
    },
    {
      "id": 67,
      "start": 2115.259979248047,
      "end": 2126.4599609375,
      "text": " Some of the most basic things of life, of biology, right?"
    },
    {
      "id": 68,
      "start": 2126.4599609375,
      "end": 2127.97998046875,
      "text": " Simple stuff."
    },
    {
      "id": 69,
      "start": 2127.97998046875,
      "end": 2135.3399658203125,
      "text": " We're not going to call a mother a mother anymore, it's going to be a birthing parent?"
    },
    {
      "id": 70,
      "start": 2135.3399658203125,
      "end": 2138.8999633789062,
      "text": " What?"
    },
    {
      "id": 71,
      "start": 2138.8999633789062,
      "end": 2141.939971923828,
      "text": " I'm not going to keep going down the path, but you understand what we're dealing with"
    },
    {
      "id": 72,
      "start": 2141.939971923828,
      "end": 2142.939971923828,
      "text": " today."
    },
    {
      "id": 73,
      "start": 2142.939971923828,
      "end": 2145.6599731445312,
      "text": " And they are corrupting the minds of young people."
    },
    {
      "id": 74,
      "start": 2145.6599731445312,
      "end": 2148.97998046875,
      "text": " But I want you to understand what their objective is."
    },
    {
      "id": 75,
      "start": 2148.97998046875,
      "end": 2155.1399536132812,
      "text": " Their endgame objective is that they can deny the existence of God."
    },
    {
      "id": 76,
      "start": 2155.1399536132812,
      "end": 2158.0999755859375,
      "text": " That's where it ends."
    },
    {
      "id": 77,
      "start": 2158.0999755859375,
      "end": 2161.3799743652344,
      "text": " This is not just, well, you know, we're going to agree to disagree and let them just kind"
    },
    {
      "id": 78,
      "start": 2161.3799743652344,
      "end": 2162.3799743652344,
      "text": " of..."
    },
    {
      "id": 79,
      "start": 2162.3799743652344,
      "end": 2163.3799743652344,
      "text": " No."
    },
    {
      "id": 80,
      "start": 2163.3799743652344,
      "end": 2165.0599670410156,
      "text": " They have an endgame."
    },
    {
      "id": 81,
      "start": 2165.0599670410156,
      "end": 2169.97998046875,
      "text": " And their endgame is denying the existence of God, and if they can be successful in that,"
    },
    {
      "id": 82,
      "start": 2169.97998046875,
      "end": 2174.6199645996094,
      "text": " if they can teach these young people that there's no God, there's no authority, then"
    },
    {
      "id": 83,
      "start": 2174.6199645996094,
      "end": 2175.6199645996094,
      "text": " guess what?"
    },
    {
      "id": 84,
      "start": 2175.6199645996094,
      "end": 2177.759979248047,
      "text": " First of all, people aren't going to get saved, and it's just going to get worse and worse"
    },
    {
      "id": 85,
      "start": 2177.759979248047,
      "end": 2178.759979248047,
      "text": " and worse."
    },
    {
      "id": 86,
      "start": 2178.759979248047,
      "end": 2179.759979248047,
      "text": " Right?"
    },
    {
      "id": 87,
      "start": 2179.759979248047,
      "end": 2181.8199768066406,
      "text": " Denying the existence of God."
    },
    {
      "id": 88,
      "start": 2181.8199768066406,
      "end": 2186.179962158203,
      "text": " If there's no God, then I become my own authority, right?"
    },
    {
      "id": 89,
      "start": 2186.179962158203,
      "end": 2189.8999633789062,
      "text": " There's no God, I don't need a Savior, God didn't create..."
    },
    {
      "id": 90,
      "start": 2189.8999633789062,
      "end": 2194.0199584960938,
      "text": " Why do you think evolution has such a primary place in our society today?"
    },
    {
      "id": 91,
      "start": 2194.0199584960938,
      "end": 2197.0599670410156,
      "text": " They want to deny the existence of God."
    },
    {
      "id": 92,
      "start": 2197.0599670410156,
      "end": 2202.7799682617188,
      "text": " God didn't create, so we take away the truth of Genesis, and then it undermines the entirety"
    },
    {
      "id": 93,
      "start": 2202.7799682617188,
      "end": 2204.499969482422,
      "text": " of God's Word."
    },
    {
      "id": 94,
      "start": 2204.499969482422,
      "end": 2209.5399780273438,
      "text": " If God is not the Creator, if God did not create you, if Adam did not sin, if we are"
    },
    {
      "id": 95,
      "start": 2209.5399780273438,
      "end": 2213.4199829101562,
      "text": " not born with a sin nature, you don't need a Redeemer."
    },
    {
      "id": 96,
      "start": 2213.4199829101562,
      "end": 2215.3599548339844,
      "text": " That's the endgame."
    },
    {
      "id": 97,
      "start": 2215.3599548339844,
      "end": 2217.939971923828,
      "text": " But my Bible tells me that God is the Creator."
    },
    {
      "id": 98,
      "start": 2217.939971923828,
      "end": 2221.0999755859375,
      "text": " My Bible tells me that He created everything out of nothing."
    },
    {
      "id": 99,
      "start": 2221.0999755859375,
      "end": 2222.239959716797,
      "text": " Amen?"
    },
    {
      "id": 100,
      "start": 2222.239959716797,
      "end": 2228.1199645996094,
      "text": " My God tells me that Adam was put into a perfect place, a perfect environment, and"
    },
    {
      "id": 101,
      "start": 2228.1199645996094,
      "end": 2236.199981689453,
      "text": " he was given the instruction from God, and he and Eve, of course, they broke the commandment"
    },
    {
      "id": 102,
      "start": 2236.199981689453,
      "end": 2241.6399536132812,
      "text": " that God had given, and we find that sin entered into the world."
    },
    {
      "id": 103,
      "start": 2241.6399536132812,
      "end": 2247.5199584960938,
      "text": " But God knew it, because before the foundation of the world, Jesus is the Lamb of God that"
    },
    {
      "id": 104,
      "start": 2247.5199584960938,
      "end": 2249.719970703125,
      "text": " is slain before the foundation of the world."
    },
    {
      "id": 105,
      "start": 2250.199981689453,
      "end": 2253.6399536132812,
      "text": " Thus, John the Baptist is able to see as Jesus comes on the scene, and he says,"
    },
    {
      "id": 106,
      "start": 2253.6399536132812,
      "end": 2258.0399780273438,
      "text": " Behold, the Lamb of God, which taketh away the sin of the world."
    },
    {
      "id": 107,
      "start": 2258.0399780273438,
      "end": 2263.3599548339844,
      "text": " The one that's been prophesied of, the one that the prophets speak of, He has now come."
    },
    {
      "id": 108,
      "start": 2263.3599548339844,
      "end": 2268.679962158203,
      "text": " This morning, we must rejoice in knowing the truth, and we must not think that we have"
    },
    {
      "id": 109,
      "start": 2268.679962158203,
      "end": 2271.1599731445312,
      "text": " to hide in a corner."
    },
    {
      "id": 110,
      "start": 2271.1599731445312,
      "end": 2277.1599731445312,
      "text": " That we have to, it's kind of interesting, we live in a society today that preaches tolerance,"
    },
    {
      "id": 111,
      "start": 2277.1599731445312,
      "end": 2283.5999755859375,
      "text": " but they're the most intolerant group of people."
    },
    {
      "id": 112,
      "start": 2283.5999755859375,
      "end": 2286.6399536132812,
      "text": " I would say as Bible-believing Christians that we're tolerant people."
    },
    {
      "id": 113,
      "start": 2286.6399536132812,
      "end": 2287.6399536132812,
      "text": " Why?"
    },
    {
      "id": 114,
      "start": 2287.6399536132812,
      "end": 2291.5199584960938,
      "text": " You can believe whatever you want to believe, but you're accountable for it."
    },
    {
      "id": 115,
      "start": 2291.5199584960938,
      "end": 2293.3599548339844,
      "text": " You believe there's no God?"
    },
    {
      "id": 116,
      "start": 2293.3599548339844,
      "end": 2295.439971923828,
      "text": " That's between you and God."
    },
    {
      "id": 117,
      "start": 2295.439971923828,
      "end": 2298.0799560546875,
      "text": " I'd like to tell you the truth, but you're free to believe it."
    },
    {
      "id": 118,
      "start": 2298.0799560546875,
      "end": 2302.3999633789062,
      "text": " We're not going to make you convert to our belief, but you know what they're trying to"
    },
    {
      "id": 119,
      "start": 2302.3999633789062,
      "end": 2303.3999633789062,
      "text": " do?"
    },
    {
      "id": 120,
      "start": 2303.3999633789062,
      "end": 2308.0599670410156,
      "text": " They're trying to force their beliefs on you."
    },
    {
      "id": 121,
      "start": 2308.0599670410156,
      "end": 2309.759979248047,
      "text": " I don't force my belief on anybody."
    },
    {
      "id": 122,
      "start": 2309.759979248047,
      "end": 2314.5999755859375,
      "text": " If I go and knock on somebody's door, and they say, I'm not interested, I don't stick"
    },
    {
      "id": 123,
      "start": 2314.5999755859375,
      "end": 2320.6799926757812,
      "text": " my foot in the door, I don't insist on them listening to me, I say, have a nice day."
    },
    {
      "id": 124,
      "start": 2320.6799926757812,
      "end": 2323.1199951171875,
      "text": " Would you take some time to read this?"
    },
    {
      "id": 125,
      "start": 2323.1199951171875,
      "end": 2329.3599853515625,
      "text": " I'm not forcing my belief on anybody, but they want to force their belief on you."
    },
    {
      "id": 126,
      "start": 2329.3599853515625,
      "end": 2330.3599853515625,
      "text": " Think about this."
    },
    {
      "id": 127,
      "start": 2330.5199584960938,
      "end": 2332.5199584960938,
      "text": " Acts, if you will."
    },
    {
      "id": 128,
      "start": 2332.5199584960938,
      "end": 2333.5199584960938,
      "text": " Acts 4."
    },
    {
      "id": 129,
      "start": 2333.5199584960938,
      "end": 2340.47998046875,
      "text": " I'll close with this this morning."
    },
    {
      "id": 130,
      "start": 2340.47998046875,
      "end": 2344.9199829101562,
      "text": " We see what John recognized, that they had overcome them."
    },
    {
      "id": 131,
      "start": 2344.9199829101562,
      "end": 2352.1599731445312,
      "text": " We see how John reminded them that their victory was the result of greater is He that is in"
    },
    {
      "id": 132,
      "start": 2352.1599731445312,
      "end": 2355.8799438476562,
      "text": " you than he which is in the world."
    },
    {
      "id": 133,
      "start": 2355.8799438476562,
      "end": 2362.0399780273438,
      "text": " They should rejoice, and we should rejoice, and the existence of false teachers does not"
    },
    {
      "id": 134,
      "start": 2362.0399780273438,
      "end": 2363.6399536132812,
      "text": " guarantee their triumph."
    },
    {
      "id": 135,
      "start": 2363.6399536132812,
      "end": 2366.8799438476562,
      "text": " In fact, we are more than conquerors."
    },
    {
      "id": 136,
      "start": 2366.8799438476562,
      "end": 2369.2799682617188,
      "text": " We are on the winning side."
    },
    {
      "id": 137,
      "start": 2369.2799682617188,
      "end": 2373.739990234375,
      "text": " As I mentioned a moment ago, we as the people of God should not fret because of their existence."
    },
    {
      "id": 138,
      "start": 2373.739990234375,
      "end": 2376.43994140625,
      "text": " We should not live in discouragement."
    },
    {
      "id": 139,
      "start": 2376.43994140625,
      "end": 2381.0199584960938,
      "text": " We find that we are to be filled with the Holy Spirit of God, that we are to pray as"
    },
    {
      "id": 140,
      "start": 2381.0199584960938,
      "end": 2382.0199584960938,
      "text": " they did."
    },
    {
      "id": 141,
      "start": 2382.0199584960938,
      "end": 2384.43994140625,
      "text": " I asked you to turn to Acts 4, and I'll be there in just a moment, but we're to pray"
    },
    {
      "id": 142,
      "start": 2384.7599487304688,
      "end": 2390.7599487304688,
      "text": " as they prayed that God would give us boldness, and they would speak the Word of God with"
    },
    {
      "id": 143,
      "start": 2390.7599487304688,
      "end": 2391.7599487304688,
      "text": " boldness."
    },
    {
      "id": 144,
      "start": 2391.7599487304688,
      "end": 2395.8399658203125,
      "text": " We find it at the end of Acts 4, but I want you to see specifically with what we're dealing"
    },
    {
      "id": 145,
      "start": 2395.8399658203125,
      "end": 2399.8399658203125,
      "text": " with as these religious leaders in Acts 4 would call people."
    },
    {
      "id": 0,
      "start": 2399.8399658203125,
      "end": 2402.1599657535553,
      "text": " Peter onto the carpet, so to speak,"
    },
    {
      "id": 1,
      "start": 2402.1599657535553,
      "end": 2404.4199657440186,
      "text": " to give answer as to what had taken place"
    },
    {
      "id": 2,
      "start": 2404.4199657440186,
      "end": 2406.399965763092,
      "text": " with the miracle of chapter 3."
    },
    {
      "id": 3,
      "start": 2406.399965763092,
      "end": 2408.6199655532837,
      "text": " And the Bible says this in v. 7,"
    },
    {
      "id": 4,
      "start": 2408.6199655532837,
      "end": 2411.5999660491943,
      "text": " and when they had set them in the midst,"
    },
    {
      "id": 5,
      "start": 2411.5999660491943,
      "end": 2414.5599660873413,
      "text": " they asked, by what power or by what name"
    },
    {
      "id": 6,
      "start": 2414.5599660873413,
      "end": 2415.959966659546,
      "text": " have you done this?"
    },
    {
      "id": 7,
      "start": 2415.959966659546,
      "end": 2418.8399658203125,
      "text": " Then Peter, and I want you to notice this statement,"
    },
    {
      "id": 8,
      "start": 2418.8399658203125,
      "end": 2422.899965286255,
      "text": " filled with the Holy Ghost."
    },
    {
      "id": 9,
      "start": 2422.899965286255,
      "end": 2424.7599658966064,
      "text": " It is absolutely key."
    },
    {
      "id": 10,
      "start": 2424.7599658966064,
      "end": 2426.7599658966064,
      "text": " It is absolutely imperative."
    },
    {
      "id": 11,
      "start": 2426.7599658966064,
      "end": 2429.039966583252,
      "text": " We read it in Acts 7."
    },
    {
      "id": 12,
      "start": 2429.1599655151367,
      "end": 2431.359966278076,
      "text": " When you think about Stephen and him preaching"
    },
    {
      "id": 13,
      "start": 2431.359966278076,
      "end": 2433.199966430664,
      "text": " and before he was martyred,"
    },
    {
      "id": 14,
      "start": 2433.199966430664,
      "end": 2435.6799659729004,
      "text": " it says in v. 55 of Acts 7,"
    },
    {
      "id": 15,
      "start": 2435.6799659729004,
      "end": 2439.1599655151367,
      "text": " but he being full of the Holy Ghost."
    },
    {
      "id": 16,
      "start": 2439.1599655151367,
      "end": 2442.0799674987793,
      "text": " Listen, if we're not filled with the Spirit of God,"
    },
    {
      "id": 17,
      "start": 2442.0799674987793,
      "end": 2442.9999656677246,
      "text": " we're in trouble."
    },
    {
      "id": 18,
      "start": 2444.319965362549,
      "end": 2447.359966278076,
      "text": " But he, Peter, filled with the Holy Ghost,"
    },
    {
      "id": 19,
      "start": 2447.359966278076,
      "end": 2450.3999671936035,
      "text": " said unto them, ye rulers of the people"
    },
    {
      "id": 20,
      "start": 2450.3999671936035,
      "end": 2452.199966430664,
      "text": " and elders of Israel,"
    },
    {
      "id": 21,
      "start": 2453.1599655151367,
      "end": 2456.2399673461914,
      "text": " if we this day be examined of the good deed"
    },
    {
      "id": 22,
      "start": 2456.2399673461914,
      "end": 2457.6599655151367,
      "text": " done to the impotent man,"
    },
    {
      "id": 23,
      "start": 2457.6599655151367,
      "end": 2459.6199645996094,
      "text": " by what means he is made whole,"
    },
    {
      "id": 24,
      "start": 2459.6199645996094,
      "end": 2460.9399642944336,
      "text": " be it known unto you all,"
    },
    {
      "id": 25,
      "start": 2460.9399642944336,
      "end": 2462.819965362549,
      "text": " and to all the people of Israel,"
    },
    {
      "id": 26,
      "start": 2462.819965362549,
      "end": 2466.0199661254883,
      "text": " that by the name of Jesus Christ of Nazareth,"
    },
    {
      "id": 27,
      "start": 2466.0199661254883,
      "end": 2467.579963684082,
      "text": " whom ye crucified,"
    },
    {
      "id": 28,
      "start": 2467.579963684082,
      "end": 2469.419967651367,
      "text": " whom God raised from the dead,"
    },
    {
      "id": 29,
      "start": 2469.419967651367,
      "end": 2474.0599670410156,
      "text": " even by Him doth this man stand here before you whole."
    },
    {
      "id": 30,
      "start": 2474.0599670410156,
      "end": 2476.419967651367,
      "text": " This is the stone which was set at naught"
    },
    {
      "id": 31,
      "start": 2476.419967651367,
      "end": 2477.259963989258,
      "text": " of you builders,"
    },
    {
      "id": 32,
      "start": 2477.259963989258,
      "end": 2480.0199661254883,
      "text": " which has become the head of the corner."
    },
    {
      "id": 33,
      "start": 2480.0199661254883,
      "end": 2482.859962463379,
      "text": " Neither is there salvation in any other."
    },
    {
      "id": 34,
      "start": 2482.859962463379,
      "end": 2484.699966430664,
      "text": " For there's none other name under heaven"
    },
    {
      "id": 35,
      "start": 2484.699966430664,
      "end": 2487.6399688720703,
      "text": " given among men whereby we must be saved."
    },
    {
      "id": 36,
      "start": 2488.479965209961,
      "end": 2490.7199630737305,
      "text": " Now that's a great, great sermon."
    },
    {
      "id": 37,
      "start": 2490.7199630737305,
      "end": 2493.599967956543,
      "text": " Call it a sermonette, just a few verses, amen?"
    },
    {
      "id": 38,
      "start": 2493.599967956543,
      "end": 2495.979965209961,
      "text": " He preaches longer sermons later,"
    },
    {
      "id": 39,
      "start": 2495.979965209961,
      "end": 2498.2199630737305,
      "text": " and before, because Acts 2 is a little bit longer too."
    },
    {
      "id": 40,
      "start": 2498.2199630737305,
      "end": 2499.87996673584,
      "text": " But I want you to notice"
    },
    {
      "id": 41,
      "start": 2499.87996673584,
      "end": 2502.7799682617188,
      "text": " that when he gets done answering their question,"
    },
    {
      "id": 42,
      "start": 2505.2799682617188,
      "end": 2506.759963989258,
      "text": " it says in verse number 13,"
    },
    {
      "id": 43,
      "start": 2506.759963989258,
      "end": 2511.759963989258,
      "text": " now when they saw the boldness of Peter and John"
    },
    {
      "id": 44,
      "start": 2512.759963989258,
      "end": 2517.759963989258,
      "text": " and perceived that they were unlearned and ignorant men,"
    },
    {
      "id": 45,
      "start": 2520.759963989258,
      "end": 2521.799964904785,
      "text": " they marveled."
    },
    {
      "id": 46,
      "start": 2523.759963989258,
      "end": 2525.179962158203,
      "text": " And they took knowledge of them"
    },
    {
      "id": 47,
      "start": 2525.179962158203,
      "end": 2527.479965209961,
      "text": " and noticed the last statement"
    },
    {
      "id": 48,
      "start": 2527.479965209961,
      "end": 2531.499969482422,
      "text": " that they had been with Jesus."
    },
    {
      "id": 49,
      "start": 2532.759963989258,
      "end": 2536.1599731445312,
      "text": " Listen, we don't need to be so worried"
    },
    {
      "id": 50,
      "start": 2536.1599731445312,
      "end": 2539.1199645996094,
      "text": " about how am I gonna answer the PhD?"
    },
    {
      "id": 51,
      "start": 2540.2799682617188,
      "end": 2541.3599700927734,
      "text": " I don't have a PhD."
    },
    {
      "id": 52,
      "start": 2541.919967651367,
      "end": 2542.759963989258,
      "text": " How am I gonna answer them?"
    },
    {
      "id": 53,
      "start": 2542.759963989258,
      "end": 2546.679962158203,
      "text": " I just need to spend time with Jesus, amen?"
    },
    {
      "id": 54,
      "start": 2546.679962158203,
      "end": 2548.3199615478516,
      "text": " I just need to get in the book."
    },
    {
      "id": 55,
      "start": 2549.679962158203,
      "end": 2551.2799682617188,
      "text": " We had lunch last week with,"
    },
    {
      "id": 56,
      "start": 2551.2799682617188,
      "end": 2553.3799591064453,
      "text": " I'm gonna pick on you just for a minute, Michael."
    },
    {
      "id": 57,
      "start": 2553.3799591064453,
      "end": 2554.8799591064453,
      "text": " We had lunch, is it okay?"
    },
    {
      "id": 58,
      "start": 2554.8799591064453,
      "end": 2556.3599700927734,
      "text": " Okay, he said sure."
    },
    {
      "id": 59,
      "start": 2556.3599700927734,
      "end": 2557.239959716797,
      "text": " No, I'm just kidding."
    },
    {
      "id": 60,
      "start": 2557.239959716797,
      "end": 2559.1399688720703,
      "text": " So we had lunch with them last Sunday."
    },
    {
      "id": 61,
      "start": 2560.1199645996094,
      "end": 2561.259963989258,
      "text": " And Michael says,"
    },
    {
      "id": 62,
      "start": 2563.6599731445312,
      "end": 2566.199966430664,
      "text": " now, he asks this question first."
    },
    {
      "id": 63,
      "start": 2566.199966430664,
      "end": 2568.3999633789062,
      "text": " You guys been reading the Constitution lately?"
    },
    {
      "id": 64,
      "start": 2568.679962158203,
      "end": 2572.0799713134766,
      "text": " Huh, no, not been reading the Constitution lately, sorry."
    },
    {
      "id": 65,
      "start": 2572.0799713134766,
      "end": 2573.1199645996094,
      "text": " He's a lawyer, right?"
    },
    {
      "id": 66,
      "start": 2573.1199645996094,
      "end": 2574.5999603271484,
      "text": " So he says, have you read the Constitution lately?"
    },
    {
      "id": 67,
      "start": 2574.5999603271484,
      "end": 2576.0399627685547,
      "text": " Nope, haven't read it lately."
    },
    {
      "id": 68,
      "start": 2577.239959716797,
      "end": 2580.239959716797,
      "text": " He says, so here's for some Constitution trivia."
    },
    {
      "id": 69,
      "start": 2580.239959716797,
      "end": 2581.999969482422,
      "text": " I'm like, are you kidding me, man?"
    },
    {
      "id": 70,
      "start": 2582.979965209961,
      "end": 2584.8799591064453,
      "text": " I lose, can I call a friend?"
    },
    {
      "id": 71,
      "start": 2584.8799591064453,
      "end": 2587.5199584960938,
      "text": " Like, what am I gonna do, right?"
    },
    {
      "id": 72,
      "start": 2587.5199584960938,
      "end": 2591.1599731445312,
      "text": " And he asks some obscure question"
    },
    {
      "id": 73,
      "start": 2591.1599731445312,
      "end": 2593.439971923828,
      "text": " and then admitted that he had just figured it out"
    },
    {
      "id": 74,
      "start": 2593.439971923828,
      "end": 2594.8399658203125,
      "text": " just recently."
    },
    {
      "id": 75,
      "start": 2594.8399658203125,
      "end": 2596.5599670410156,
      "text": " I'm like, you've been in law school and all this stuff?"
    },
    {
      "id": 76,
      "start": 2596.5599670410156,
      "end": 2600.999969482422,
      "text": " Listen, I'm not gonna try to debate Michael on law."
    },
    {
      "id": 77,
      "start": 2602.1599731445312,
      "end": 2603.3999633789062,
      "text": " I'm never gonna win."
    },
    {
      "id": 78,
      "start": 2605.7999725341797,
      "end": 2606.7799682617188,
      "text": " But as his pastor,"
    },
    {
      "id": 79,
      "start": 2606.7799682617188,
      "end": 2608.8799591064453,
      "text": " I better be able to teach him the Word of God."
    },
    {
      "id": 80,
      "start": 2610.3599700927734,
      "end": 2611.3999633789062,
      "text": " Amen?"
    },
    {
      "id": 81,
      "start": 2611.3999633789062,
      "end": 2614.239959716797,
      "text": " Listen, I don't have to go out and fight toe to toe"
    },
    {
      "id": 82,
      "start": 2614.239959716797,
      "end": 2617.1599731445312,
      "text": " with somebody of some false whatever"
    },
    {
      "id": 83,
      "start": 2617.1599731445312,
      "end": 2619.7799682617188,
      "text": " and what their level of biology"
    },
    {
      "id": 84,
      "start": 2619.7799682617188,
      "end": 2621.719970703125,
      "text": " and this learning and so on and so forth."
    },
    {
      "id": 85,
      "start": 2621.719970703125,
      "end": 2623.5199584960938,
      "text": " No, no, I just need to spend time with Jesus"
    },
    {
      "id": 86,
      "start": 2623.5199584960938,
      "end": 2624.419967651367,
      "text": " and with His Word."
    },
    {
      "id": 87,
      "start": 2626.5999603271484,
      "end": 2627.679962158203,
      "text": " Amen?"
    },
    {
      "id": 88,
      "start": 2627.679962158203,
      "end": 2630.999969482422,
      "text": " And sometimes we get intimidated."
    },
    {
      "id": 89,
      "start": 2630.999969482422,
      "end": 2634.1599731445312,
      "text": " If I have to debate Michael in law, I'm intimidated."
    },
    {
      "id": 90,
      "start": 2635.1199645996094,
      "end": 2636.679962158203,
      "text": " I'm just being honest with you."
    },
    {
      "id": 91,
      "start": 2638.8799591064453,
      "end": 2640.8799591064453,
      "text": " But if we're gonna talk about the Word of God,"
    },
    {
      "id": 92,
      "start": 2642.439971923828,
      "end": 2645.239959716797,
      "text": " we spend time with Jesus, we search the Scriptures,"
    },
    {
      "id": 93,
      "start": 2645.239959716797,
      "end": 2647.5399627685547,
      "text": " we study to show ourselves approved unto God."
    },
    {
      "id": 94,
      "start": 2648.419967651367,
      "end": 2651.479965209961,
      "text": " I don't have all the answers, but I know God does."
    },
    {
      "id": 95,
      "start": 2651.479965209961,
      "end": 2652.5599670410156,
      "text": " And I'm gonna go to His book"
    },
    {
      "id": 96,
      "start": 2652.5599670410156,
      "end": 2655.3599700927734,
      "text": " and I'm gonna be filled with the Spirit of God."
    },
    {
      "id": 97,
      "start": 2657.239959716797,
      "end": 2659.47998046875,
      "text": " These guys in Acts 4, they said,"
    },
    {
      "id": 98,
      "start": 2660.679962158203,
      "end": 2663.5599670410156,
      "text": " we perceive that these are unlearned and ignorant men,"
    },
    {
      "id": 99,
      "start": 2665.999969482422,
      "end": 2667.759979248047,
      "text": " but they've been with Jesus."
    },
    {
      "id": 100,
      "start": 2668.7999572753906,
      "end": 2672.439971923828,
      "text": " I wonder how many people would be able to say"
    },
    {
      "id": 101,
      "start": 2673.719970703125,
      "end": 2677.999969482422,
      "text": " when they encounter you, they've been with Jesus."
    },
    {
      "id": 102,
      "start": 2678.999969482422,
      "end": 2681.239959716797,
      "text": " They've been with Jesus."
    },
    {
      "id": 103,
      "start": 2681.239959716797,
      "end": 2683.8799743652344,
      "text": " Oh, that God would help us."
    },
    {
      "id": 104,
      "start": 2683.8799743652344,
      "end": 2684.999969482422,
      "text": " Listen, this morning,"
    },
    {
      "id": 105,
      "start": 2685.8799743652344,
      "end": 2689.2799682617188,
      "text": " the existence of false teachers shouldn't discourage us."
    },
    {
      "id": 106,
      "start": 2689.2799682617188,
      "end": 2690.97998046875,
      "text": " God told us they're gonna be here."
    },
    {
      "id": 107,
      "start": 2691.8799743652344,
      "end": 2695.1599731445312,
      "text": " He told us how we can expose them and overcome them."
    },
    {
      "id": 108,
      "start": 2695.1599731445312,
      "end": 2697.939971923828,
      "text": " And we need to simply abide in Him."
    },
    {
      "id": 109,
      "start": 2697.939971923828,
      "end": 2701.179962158203,
      "text": " Let this book abide in us."
    },
    {
      "id": 110,
      "start": 2701.179962158203,
      "end": 2705.0999755859375,
      "text": " Walk in the Spirit, be filled with the Spirit of God,"
    },
    {
      "id": 111,
      "start": 2705.0999755859375,
      "end": 2708.3199768066406,
      "text": " and understand and always remember,"
    },
    {
      "id": 112,
      "start": 2708.3199768066406,
      "end": 2713.3199768066406,
      "text": " greater is He that is in you than he that is in the world."
    },
    {
      "id": 113,
      "start": 2713.7999572753906,
      "end": 2715.47998046875,
      "text": " God, I need wisdom."
    },
    {
      "id": 114,
      "start": 2715.47998046875,
      "end": 2719.1599731445312,
      "text": " He said, yes, child, I will give it to you."
    },
    {
      "id": 115,
      "start": 2720.3199768066406,
      "end": 2722.9599609375,
      "text": " And I'll give it to you liberally."
    },
    {
      "id": 116,
      "start": 2722.9599609375,
      "end": 2723.7999572753906,
      "text": " Let's pray."
    },
    {
      "id": 117,
      "start": 2723.7999572753906,
      "end": 2724.6199645996094,
      "text": " Father, we love you."
    },
    {
      "id": 118,
      "start": 2725.5199584960938,
      "end": 2727.3999633789062,
      "text": " Thank you for loving us."
    },
    {
      "id": 119,
      "start": 2727.3999633789062,
      "end": 2729.7999572753906,
      "text": " Thank you for the Word of God."
    },
    {
      "id": 120,
      "start": 2729.7999572753906,
      "end": 2732.1599731445312,
      "text": " I pray this morning that you would help us"
    },
    {
      "id": 121,
      "start": 2735.679962158203,
      "end": 2739.2799682617188,
      "text": " to engage our society, our culture,"
    },
    {
      "id": 122,
      "start": 2740.3999633789062,
      "end": 2742.1199645996094,
      "text": " with the truth of thy Word."
    },
    {
      "id": 123,
      "start": 2742.8799743652344,
      "end": 2745.439971923828,
      "text": " God, we've kept silent for too long."
    },
    {
      "id": 124,
      "start": 2745.439971923828,
      "end": 2746.6199645996094,
      "text": " Forgive us."
    },
    {
      "id": 125,
      "start": 2749.919952392578,
      "end": 2752.3599548339844,
      "text": " Though we often quote and refer to the truth"
    },
    {
      "id": 126,
      "start": 2752.3599548339844,
      "end": 2756.2799682617188,
      "text": " of 1 John 4, 4, at times, if we'd be honest,"
    },
    {
      "id": 127,
      "start": 2756.2799682617188,
      "end": 2761.2799682617188,
      "text": " we don't live like greater is He that is in us"
    },
    {
      "id": 128,
      "start": 2761.5599670410156,
      "end": 2763.0599670410156,
      "text": " than he that is in the world."
    },
    {
      "id": 129,
      "start": 2764.199951171875,
      "end": 2765.439971923828,
      "text": " God, I pray that you'd help us"
    },
    {
      "id": 130,
      "start": 2765.439971923828,
      "end": 2767.3999633789062,
      "text": " to be filled with the Spirit of God,"
    },
    {
      "id": 131,
      "start": 2767.3999633789062,
      "end": 2771.1199645996094,
      "text": " to walk in boldness, to preach thy Word with boldness."
    },
    {
      "id": 132,
      "start": 2772.8399658203125,
      "end": 2776.759979248047,
      "text": " Help us to engage our culture with the truth of thy Word."
    },
    {
      "id": 133,
      "start": 2776.759979248047,
      "end": 2778.499969482422,
      "text": " Give us wisdom, oh God."
    },
    {
      "id": 134,
      "start": 2780.759979248047,
      "end": 2783.1599731445312,
      "text": " I pray this morning that you'd move and work in hearts"
    },
    {
      "id": 135,
      "start": 2783.1599731445312,
      "end": 2784.239959716797,
      "text": " as only you can."
    },
    {
      "id": 136,
      "start": 2785.2799682617188,
      "end": 2787.499969482422,
      "text": " Help us to rejoice for the truth."
    },
    {
      "id": 137,
      "start": 2789.419952392578,
      "end": 2793.0399780273438,
      "text": " Help us to never forget, always remember"
    },
    {
      "id": 138,
      "start": 2797.47998046875,
      "end": 2800.5799560546875,
      "text": " that any victory that we may have is all because of you."
    },
    {
      "id": 139,
      "start": 2801.5799560546875,
      "end": 2804.0599670410156,
      "text": " For greater is he that is in you"
    },
    {
      "id": 140,
      "start": 2804.0599670410156,
      "end": 2805.499969482422,
      "text": " than he that is in the world."
    },
    {
      "id": 141,
      "start": 2806.3799743652344,
      "end": 2808.5399780273438,
      "text": " I pray that you'd move and work, seal every decision,"
    },
    {
      "id": 142,
      "start": 2808.5399780273438,
      "end": 2809.739959716797,
      "text": " and we'll thank you for it."
    }
  ],
  "processed_at": "2025-04-16T13:53:56.782387"
}