{
  "video_id": "4BBfiBe_jzw",
  "text": "times throughout this psalm, Psalm 119, that the psalmist actually cries out, teach me. And one of the things that he asked the Lord to teach him over and over is to teach him his statutes. And we started with verse number 12, blessed art thou, O Lord, teach me thy statutes. What a great plea, what a great desire, a desire that each of us ought to have and adopt. And we've dealt with all of that groundwork, and we've gone through several things with regard to having a teachable spirit and promoting learning in our lives and so on and so forth, the purpose for learning. And last week, we looked at lessons from history. We looked at the portion of Scripture there in 1 Corinthians 10 and the way in which the Apostle Paul, as he was ministering to the church in Corinth, used historical events to teach them lessons. And of course, we find not only there in the book of 1 Corinthians, but also in the book of Romans, that we are taught that the word of God, those things that were written aforetime, speaking of the Old Testament, were written for our admonition for our learning. And of course, as they're writing to New Testament believers there, we now have the entire complete canon of Scripture for which we're very thankful. This evening, we'll begin, as we look last week, lessons from history. This evening, we'll begin looking at a number of classrooms. I'll refer to them as classrooms as we go through the next several weeks of lessons. And as I mentioned several weeks ago, the reality is that God will use a variety of methods to teach His children. He doesn't always use the same method. He doesn't always use the same classroom. That's how I'll use that phraseology. And so, we must come to the place. I believe this is important and foundational for us to understand. And it's this truth. We must come to the place in our lives that we trust Him to utilize the right method at the right time. Amen? We come to the place in our lives where we recognize, where we trust Him fully to utilize the right method at the right time. God knows what we need more than we do. Amen? He knows what I need. He knows what you need. He knows better than we do. Sometimes we might think, well, I'm signing up to go into the classroom of, and you'll be able to fill in the blank as we go through a number of these over the next several Wednesdays. But this evening, the classroom that I'm going to deal with, I believe, is a classroom that is rarely desired, but often necessary. There are some lessons, some principles, some truths, some realities about our God that can only be learned in this classroom that we're going to deal with tonight, and I've titled the message, The Classroom of Affliction. The classroom of affliction. It's not a desired classroom. It really isn't. But I'm telling you this evening, from personal experience, from looking at the truth of God's Word, that at times in our lives, and God knows when those times are, it is a necessary classroom. And when we learn to accept that, I'll make some statements at the end of the lesson tonight that I hope will be a help to each of us and to have that right perspective with regard to understanding that God knows best, and He knows what we need when we need it. Some virtues are only seen in affliction. To be afflicted, well, the definition of affliction is the state of being afflicted, a state of pain, distress, or grief. To be afflicted is to be affected with continued or often repeated pain, either of body or mind, suffering, grief, or distress of any kind, according to the 1828 Noah Webster's Dictionary. And so as we think about these definitions of affliction and we think about this classroom of affliction that at times God will use, I want you to consider first of all this evening the testimony of the psalmist. Here in Psalm 119, we mention that the verse that we started out with to begin our study on Wednesday evening, seven weeks ago, with this mini-series of teach me was verse number 12, when he said, Blessed art thou, O Lord, teach me thy statutes. But I want to draw your attention this evening to this classroom of affliction in verse number 71. In verse number 71 of Psalm 119, I want you to notice what the psalmist says. He says, It is good for me that I have been afflicted, that I might learn thy statutes. What was his prayer specifically? His prayer specifically was teach me thy statutes, right? It's repeated throughout Psalm 119. I won't take the time this evening to look at every reference in Psalm 119 that says teach me thy statutes, but there's a number of them. And as we consider how that specifically he's praying and he's desiring, he's saying, Lord, teach me thy statutes. He then reveals to us in verse number 71, that it is good for me that I have been afflicted. Why? That I might learn thy statutes. So his desire, his plea to God is, Lord, teach me thy statutes. And at times the psalmist recognizes it's preserved for us to help us recognize as well, that at times God will use the classroom of affliction so that we too might learn his statutes. And as we think about the testimony of the psalmist, we see, we know his perspective here in verse number 71. Notice he says, It is good for me that I have been afflicted. Oftentimes when we're in the classroom of affliction, if we're not careful, we'll despise that classroom. We'll look for every opportunity to get out of that classroom. I don't like this classroom, and we may miss the lesson that God has for us. But we know the perspective here of the psalmist when he says, It is good for me, it is good for me that I have been afflicted. That's a perspective that we need to adopt in our lives. As we note the perspective, we also note the result. He says that he learns the statutes. He says that I may learn, that I might, excuse me, learn thy statutes. And so God uses the classroom of affliction. We see it in the life of the psalmist here, and we know in verse 71. I want you to back up just a few verses, and I want you to see what he says in verse number 67, how he speaks about the past and the present. He says this, Before I was afflicted, notice what he says, I went astray. But then notice the end of verse 67, But now have I kept thy word. What changed? The classroom of affliction, right? Because he says in verse 67, he says, I went astray, but now I've kept thy word. And the difference, the change was the affliction, because he says, Before I was afflicted, I went astray. And what a blessing to think about the way in which God will help us to learn in the classroom of affliction. Again, it's a classroom that often we don't desire to go to, but again, as we understand, and I made the point of stressing it by way of introduction, that we must learn that God knows best, and that God knows when we need to experience, that we need to learn a lesson that will be best taught in the classroom of affliction. It may not be that we'll learn that lesson in any other classroom. It may not be that we'll learn of that attribute and of the nature of our God in any other classroom. And so God wants us to grow, He wants us to learn, and the psalmist has this plea, the psalmist has this desire, and God is answering his prayer through affliction. And you say, Really? Yeah. And he recognized that it was an answer to prayer, because he says, It is good for me that I have been afflicted, that I might learn thy statutes. God, you answered my prayer, you answered my plea, you answered my desire to teach me thy statutes by taking me through the classroom of affliction. What a great perspective, what a great testimony. We see the testimony of the psalmist, I want you to consider the testimony of the Apostle Paul. Turn to the book of 2 Corinthians, if you will, and I want to note a couple of passages here in the book of 2 Corinthians as we note the testimony of Paul with regard to this classroom of affliction. In 2 Corinthians chapter number 4, we note that Paul is going to rehearse some things with regard to some of his experiences and some of the things in which he dealt with, and he's going to make this list a whole lot longer. In chapter number 11, he goes through all of the things that he suffered. But here in chapter number 4, he's speaking, and he says this in verse number 8, we are troubled on every side, yet not distressed. We are perplexed, but not in despair. Verse 9, persecuted but not forsaken, cast down but not destroyed. Notice what he says in verse number 10 of 2 Corinthians 4, always bearing about in the body the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body. And I want you to skip down and look at verse number 16. It says, for which cause we faint not, but though our outward man perish, yet the inward man is renewed day by day. And so, he's described for us a little bit here of some of what he's dealt with and some of the circumstances in which he faces. And then I want you to, again, note the perspective in verse number 17. Notice what Paul says, for our light affliction, which is but for a moment. Now, just pause there. We'll read the rest of the verse in just a moment, but I want you to really get a hold of the perspective of the Apostle Paul, because he says, as he's describing the affliction, he describes it as being a light affliction, and he describes it as being but for a moment. And no doubt, when we're in the classroom of affliction, there are times in which we would not describe it as being light or being brief, right? And yet, the Apostle Paul, and we know, and I mentioned already that in 2 Corinthians 11, and we don't have time to read all of it, but in 2 Corinthians chapter number 11, really beginning in verse number 21 and going down through verse number 28, he really lists all the things that he dealt with and all of the things that he suffered, but yet the Apostle Paul, because of this perspective, he can look at the affliction that he dealt with and he can refer to it as being a light affliction that is but for a moment. Why is it that he would say it's for a moment? Well, because in light of eternity, it truly is but a moment. Peter ends, as he's writing to the believers that are suffering and they're dealing with great adversity, and as he's writing to these people that have been suffering and they've been dealing with these things and so on and so forth, and he says this in 1 Peter 5 and verse number 10, he says, But the God of all grace, who hath caught us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, establish, strengthen, settle you. To him be glory and dominion forever and ever. Amen. It's interesting because he says that he hath caught us unto his eternal glory, and then he says, after that you have suffered a while. We don't know how long a while is, but we know this one thing, it's not forever. Amen. It's a lot shorter than eternity. And so when we think about the perspective, and he says it's a light affliction and it's just for a moment, which is but for a moment, notice what he says. Notice what the affliction produces. Notice what the perspective is here. He says at the end of verse number 17 here in 2 Corinthians 4, worketh for us a far more exceeding and eternal weight of glory. Isn't that good? When you think about this classroom of affliction, you think about the psalmist, and he says, it is good for me that I've been afflicted, that I might learn thy statutes. And here the apostle Paul, he says that our light affliction, which is but for a moment, notice it worketh for us a far more exceeding and eternal weight of glory. Notice, turn over to chapter number 12, if you will, here, 2 Corinthians, and I want you to notice we're familiar with the passage of Scripture, and often we quote part of verse number 9 when it says, my grace is sufficient for thee. But I want you to look at the entirety here very briefly. In verse number 7, the Bible says that Paul is sharing his testimony and says, lest I should be exalted above measure through the abundance of the revelations. Notice, there was given to me a thorn in the flesh, the messenger of Satan to buffet me, lest I should be exalted above measure. Notice what Paul says about this thing. He says, for this thing I besought the Lord thrice, that it might depart from me. What's Paul saying? I wasn't enjoying this, right? So I asked the Lord on three separate occasions. Remember, we used the example on Sunday morning of Paul being a man of prayer. Paul, right after his conversion, God says to Ananias, you're going to go into the city, you're going to go on the street, you're going to find one by the name of Saul, and he's praying. And that was the start of his prayer life, and we see it throughout his life. He is a man of prayer. He constantly encouraged others by telling them that he's praying for them. He constantly asked others to pray for him, and here he speaks specifically about praying, and he begged, he besought the Lord on three separate occasions that it might depart from me. But notice what God says. He, God, said unto me, my grace is sufficient for thee, for my strength is made perfect in weakness. Can I tell you, let me finish reading. It says, most gladly therefore will I rather glory in my infirmities that the power of Christ may rest upon me. Therefore, I take pleasure in infirmities, in reproaches, in necessities, in persecutions, in distresses for Christ's sake. For when I am weak, then am I strong. Let me ask you, do you think Paul learned something through this time of affliction in his life? Sure he did. He learned that God's grace is sufficient. He learned that God's response to him seeking the face of God on these three occasions and saying, Lord, let this thing depart from me. And God says, my grace is sufficient. And he tells them that my strength is made perfect in weakness. Sometimes we don't like the feeling, the position of being weak, or feeling weak. We feel vulnerable. But the reality is that Paul responds to this lesson that he learned. He responds to this truth that he's given because of this affliction. He says, most gladly therefore will I rather glory in my infirmities. Why? That the power of Christ may rest upon me. Christ in me, the hope of glory. Amen? We're to be strong in the power of His might. We find here that he then concludes, and quite honestly, as you read verse number 10 of 2 Corinthians 12, your mind just seeking to wrap around this perspective and asking the Lord to help us to get to this place in our lives where we too could echo the words and say, therefore I take pleasure in infirmities, in reproaches, in necessities, in persecution, in distresses for Christ's sake. Why? Because when I am weak, then am I strong. It's the strength of Christ. And Paul learned this lesson, and what valuable lesson it is for him. It was for him, but it is for us as well as we consider tonight this classroom of affliction. I want to draw your attention to Psalm 34. I mentioned this a couple of Sundays ago in our Sunday school class when we looked at that truth from Psalm 62 and verse number 8, but I want you to notice in Psalm 34 in closing this evening, in Psalm 34, of course, David is rejoicing, he's blessing the Lord, he's speaking of his personal experiences and deliverances, and then he speaks about the righteous as he goes through the passage. But I want you to notice in verse number 19 that he says, many are the afflictions are the afflictions of the righteous. He says this, but the Lord delivers him out of them all. And we can carry that truth and that promise, and we can rejoice in that. And we can understand that many are the afflictions of the righteous, and that when those afflictions come in your life and in my life, that God has a purpose in them, that God has a purpose for them. Listen, our God is in control of all things, and our God is a good God. He's a gracious God. He's a loving God. And when we understand that He loves us and He cares about us and He's invited us to enter into His presence, He said to us, cast your care upon me, for I care for you. And you say, well, then why would He let me deal with afflictions? Because He wants to teach us some lessons. And some lessons are only going to be learned in the classroom of affliction. I'm going to read to you two quotes in closing this evening. One, I don't agree with either one of these guys on everything theologically, but I think that the quotes that they made in reference to this subject are powerful. Martin Luther said this, I never knew the meaning of God's Word until I came into affliction. I have always found it, affliction, one of my best schoolmasters. Wow, that's powerful. Spurgeon said this, very little is to be learned without affliction. If we would be scholars, we must be sufferers. God's commands are best read with eyes wet with tears. That's powerful. These two men, again, I don't agree with everything theologically, but those are powerful statements from their walk with Christ and their experience in the classroom of affliction and saying that, I've learned just as the psalmist said that it was good for me to be afflicted because then I learned thy statutes, that I've learned that this classroom of affliction, this is one of my best schoolmasters. I realize that this classroom may not be our favorite. However, I hope we learn to trust our loving Lord and appreciate His use of this classroom in our lives. For then, we will learn the lessons that He desires to teach us. I'm glad that it's not the only classroom that the Lord has. Amen? There are other classrooms, but there are seasons in our life that God says, for this season, this is the classroom, the classroom of affliction. And when we learn to trust our loving Lord and learn to understand that He has a plan and a purpose for that classroom in our lives, then we can learn the lessons that He has for us in that classroom. By the way, as a side note, it's a classroom that I desire to learn in quickly. I don't say that just to be facetious. I'm being honest. It's a classroom that I desire. If God has that classroom for me, I want to learn the lesson as quickly as possible. But here's what I've learned. When I despise the classroom of affliction, I spend more time in the classroom of affliction. Right? What happens in school when you fail a class? You get to repeat the class. You get to repeat the class. I know nowadays they have some policies and whatever that change some of that, but I remember when I was going through school, you failed a class, you'd repeat the class. Why? Because there were some lessons, there were some principles that you had to learn before you went on. Right? And by the way, just by pushing somebody to the next class doesn't really do any favors for them because they're always behind. Right? It's always a challenge for them. And so, until those principles are learned, you do not get to go to the next grade, to the next class, to the next... Right? And God has this classroom of affliction. He says, these are some lessons that I want you to learn. And I want to come to the place in my life, and I hope tonight as we've spent just a few minutes looking at this classroom of affliction, that you too would want to come to the place in your life where we learn to appreciate the classroom of affliction, just as the psalmist did, just as Paul did. And we say, Lord, teach me thy statutes. And I understand sometimes in praying that prayer, you may use the classroom of affliction. Help me not to despise it. Help me to know and to trust that you know best, and you know what classroom I need to learn what lesson. Amen? Let's pray. Father, we love you. We thank you so much for loving us. And we know that you're in control of everything, and you have a purpose for everything. Perhaps tonight there's one that's in the classroom of affliction. They know it. Maybe they know the lesson that you're teaching them. Maybe they're so uncertain as to the lesson that you're teaching them. Perhaps even someone has despised the classroom of affliction. God, I pray that you'd help us. I'm thankful this isn't the only classroom that you have for us. But we do recognize as we study your Word that this is a classroom that you have for us. At times that you know best, you'll send us to this classroom of affliction. And I pray that in those times that we would trust you fully and wholly, and know that you have a purpose, and help us to learn those lessons. Help us to draw closer to thee. Help us to trust you more. I pray that you'd bless our time of prayer. We thank you for the privilege of corporate prayer. I pray that you'd bless the remainder of our service. For it's in Christ's name we pray. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.639999866485596,
      "text": " times throughout this psalm, Psalm 119, that the psalmist actually cries out,"
    },
    {
      "id": 1,
      "start": 6.639999866485596,
      "end": 11.119999885559082,
      "text": " teach me. And one of the things that he asked the Lord to teach him"
    },
    {
      "id": 2,
      "start": 12.0,
      "end": 17.920000076293945,
      "text": " over and over is to teach him his statutes. And we started with verse number 12,"
    },
    {
      "id": 3,
      "start": 17.920000076293945,
      "end": 24.559999465942383,
      "text": " blessed art thou, O Lord, teach me thy statutes. What a great plea, what a great desire,"
    },
    {
      "id": 4,
      "start": 24.559999465942383,
      "end": 29.200000762939453,
      "text": " a desire that each of us ought to have and adopt. And we've dealt with all of that groundwork,"
    },
    {
      "id": 5,
      "start": 29.200000762939453,
      "end": 34.63999938964844,
      "text": " and we've gone through several things with regard to having a teachable spirit and promoting"
    },
    {
      "id": 6,
      "start": 34.63999938964844,
      "end": 38.2400016784668,
      "text": " learning in our lives and so on and so forth, the purpose for learning."
    },
    {
      "id": 7,
      "start": 38.2400016784668,
      "end": 43.040000915527344,
      "text": " And last week, we looked at lessons from history. We looked at the portion of Scripture there in"
    },
    {
      "id": 8,
      "start": 43.040000915527344,
      "end": 47.91999816894531,
      "text": " 1 Corinthians 10 and the way in which the Apostle Paul, as he was ministering to the church in"
    },
    {
      "id": 9,
      "start": 47.91999816894531,
      "end": 55.36000061035156,
      "text": " Corinth, used historical events to teach them lessons. And of course, we find not only there"
    },
    {
      "id": 10,
      "start": 55.36000061035156,
      "end": 59.279998779296875,
      "text": " in the book of 1 Corinthians, but also in the book of Romans, that we are taught that the word"
    },
    {
      "id": 11,
      "start": 59.279998779296875,
      "end": 64.23999786376953,
      "text": " of God, those things that were written aforetime, speaking of the Old Testament, were written for"
    },
    {
      "id": 12,
      "start": 64.23999786376953,
      "end": 69.5999984741211,
      "text": " our admonition for our learning. And of course, as they're writing to New Testament believers there,"
    },
    {
      "id": 13,
      "start": 69.5999984741211,
      "end": 74.55999755859375,
      "text": " we now have the entire complete canon of Scripture for which we're very thankful."
    },
    {
      "id": 14,
      "start": 74.55999755859375,
      "end": 80.16000366210938,
      "text": " This evening, we'll begin, as we look last week, lessons from history. This evening, we'll begin"
    },
    {
      "id": 15,
      "start": 80.16000366210938,
      "end": 85.68000030517578,
      "text": " looking at a number of classrooms. I'll refer to them as classrooms as we go through the next"
    },
    {
      "id": 16,
      "start": 85.68000030517578,
      "end": 91.12000274658203,
      "text": " several weeks of lessons. And as I mentioned several weeks ago, the reality is that God will"
    },
    {
      "id": 17,
      "start": 91.12000274658203,
      "end": 97.12000274658203,
      "text": " use a variety of methods to teach His children. He doesn't always use the same method. He doesn't"
    },
    {
      "id": 18,
      "start": 97.12000274658203,
      "end": 101.91999816894531,
      "text": " always use the same classroom. That's how I'll use that phraseology. And so, we must come to"
    },
    {
      "id": 19,
      "start": 101.91999816894531,
      "end": 106.4000015258789,
      "text": " the place. I believe this is important and foundational for us to understand. And it's"
    },
    {
      "id": 20,
      "start": 106.4000015258789,
      "end": 114.80000305175781,
      "text": " this truth. We must come to the place in our lives that we trust Him to utilize the right method"
    },
    {
      "id": 21,
      "start": 114.80000305175781,
      "end": 122.0,
      "text": " at the right time. Amen? We come to the place in our lives where we recognize, where we trust Him"
    },
    {
      "id": 22,
      "start": 122.55999755859375,
      "end": 131.60000610351562,
      "text": " fully to utilize the right method at the right time. God knows what we need more than we do."
    },
    {
      "id": 23,
      "start": 132.24000549316406,
      "end": 138.16000366210938,
      "text": " Amen? He knows what I need. He knows what you need. He knows better than we do. Sometimes we"
    },
    {
      "id": 24,
      "start": 138.16000366210938,
      "end": 143.0399932861328,
      "text": " might think, well, I'm signing up to go into the classroom of, and you'll be able to fill in the"
    },
    {
      "id": 25,
      "start": 143.0399932861328,
      "end": 147.67999267578125,
      "text": " blank as we go through a number of these over the next several Wednesdays. But this evening,"
    },
    {
      "id": 26,
      "start": 147.67999267578125,
      "end": 153.83999633789062,
      "text": " the classroom that I'm going to deal with, I believe, is a classroom that is rarely desired,"
    },
    {
      "id": 27,
      "start": 154.63999938964844,
      "end": 165.0399932861328,
      "text": " but often necessary. There are some lessons, some principles, some truths, some realities"
    },
    {
      "id": 28,
      "start": 165.0399932861328,
      "end": 170.32000732421875,
      "text": " about our God that can only be learned in this classroom that we're going to deal with tonight,"
    },
    {
      "id": 29,
      "start": 170.32000732421875,
      "end": 176.9600067138672,
      "text": " and I've titled the message, The Classroom of Affliction. The classroom of affliction."
    },
    {
      "id": 30,
      "start": 176.9600067138672,
      "end": 182.63999938964844,
      "text": " It's not a desired classroom. It really isn't. But I'm telling you this evening,"
    },
    {
      "id": 31,
      "start": 182.63999938964844,
      "end": 188.0,
      "text": " from personal experience, from looking at the truth of God's Word, that at times in our lives,"
    },
    {
      "id": 32,
      "start": 188.0,
      "end": 195.36000061035156,
      "text": " and God knows when those times are, it is a necessary classroom. And when we learn to accept"
    },
    {
      "id": 33,
      "start": 195.36000061035156,
      "end": 199.36000061035156,
      "text": " that, I'll make some statements at the end of the lesson tonight that I hope will be a help to each"
    },
    {
      "id": 34,
      "start": 199.36000061035156,
      "end": 205.52000427246094,
      "text": " of us and to have that right perspective with regard to understanding that God knows best,"
    },
    {
      "id": 35,
      "start": 205.52000427246094,
      "end": 210.24000549316406,
      "text": " and He knows what we need when we need it. Some virtues are only seen in affliction."
    },
    {
      "id": 36,
      "start": 211.0399932861328,
      "end": 215.52000427246094,
      "text": " To be afflicted, well, the definition of affliction is the state of being afflicted,"
    },
    {
      "id": 37,
      "start": 215.52000427246094,
      "end": 221.44000244140625,
      "text": " a state of pain, distress, or grief. To be afflicted is to be affected with continued or"
    },
    {
      "id": 38,
      "start": 221.44000244140625,
      "end": 227.44000244140625,
      "text": " often repeated pain, either of body or mind, suffering, grief, or distress of any kind,"
    },
    {
      "id": 39,
      "start": 227.44000244140625,
      "end": 232.9600067138672,
      "text": " according to the 1828 Noah Webster's Dictionary. And so as we think about these definitions of"
    },
    {
      "id": 40,
      "start": 232.9600067138672,
      "end": 237.1999969482422,
      "text": " affliction and we think about this classroom of affliction that at times God will use,"
    },
    {
      "id": 41,
      "start": 237.1999969482422,
      "end": 243.1199951171875,
      "text": " I want you to consider first of all this evening the testimony of the psalmist. Here in Psalm 119,"
    },
    {
      "id": 42,
      "start": 243.1199951171875,
      "end": 247.27999877929688,
      "text": " we mention that the verse that we started out with to begin our study on Wednesday evening,"
    },
    {
      "id": 43,
      "start": 247.27999877929688,
      "end": 253.44000244140625,
      "text": " seven weeks ago, with this mini-series of teach me was verse number 12, when he said,"
    },
    {
      "id": 44,
      "start": 253.44000244140625,
      "end": 259.44000244140625,
      "text": " Blessed art thou, O Lord, teach me thy statutes. But I want to draw your attention this evening"
    },
    {
      "id": 45,
      "start": 259.44000244140625,
      "end": 266.0,
      "text": " to this classroom of affliction in verse number 71. In verse number 71 of Psalm 119, I want you"
    },
    {
      "id": 46,
      "start": 266.0,
      "end": 271.67999267578125,
      "text": " to notice what the psalmist says. He says, It is good for me that I have been afflicted,"
    },
    {
      "id": 47,
      "start": 273.1199951171875,
      "end": 281.5199890136719,
      "text": " that I might learn thy statutes. What was his prayer specifically? His prayer specifically was"
    },
    {
      "id": 48,
      "start": 281.5199890136719,
      "end": 287.3599853515625,
      "text": " teach me thy statutes, right? It's repeated throughout Psalm 119. I won't take the time"
    },
    {
      "id": 49,
      "start": 287.3599853515625,
      "end": 291.9200134277344,
      "text": " this evening to look at every reference in Psalm 119 that says teach me thy statutes,"
    },
    {
      "id": 50,
      "start": 291.9200134277344,
      "end": 296.79998779296875,
      "text": " but there's a number of them. And as we consider how that specifically he's praying and he's"
    },
    {
      "id": 51,
      "start": 296.79998779296875,
      "end": 304.4800109863281,
      "text": " desiring, he's saying, Lord, teach me thy statutes. He then reveals to us in verse number 71, that it"
    },
    {
      "id": 52,
      "start": 304.4800109863281,
      "end": 312.3999938964844,
      "text": " is good for me that I have been afflicted. Why? That I might learn thy statutes. So his desire,"
    },
    {
      "id": 53,
      "start": 312.3999938964844,
      "end": 320.7200012207031,
      "text": " his plea to God is, Lord, teach me thy statutes. And at times the psalmist recognizes it's preserved"
    },
    {
      "id": 54,
      "start": 320.7200012207031,
      "end": 327.5199890136719,
      "text": " for us to help us recognize as well, that at times God will use the classroom of affliction"
    },
    {
      "id": 55,
      "start": 328.239990234375,
      "end": 335.44000244140625,
      "text": " so that we too might learn his statutes. And as we think about the testimony of the psalmist,"
    },
    {
      "id": 56,
      "start": 335.44000244140625,
      "end": 341.6000061035156,
      "text": " we see, we know his perspective here in verse number 71. Notice he says, It is good for me"
    },
    {
      "id": 57,
      "start": 342.1600036621094,
      "end": 347.3599853515625,
      "text": " that I have been afflicted. Oftentimes when we're in the classroom of affliction, if we're not"
    },
    {
      "id": 58,
      "start": 347.3599853515625,
      "end": 352.7200012207031,
      "text": " careful, we'll despise that classroom. We'll look for every opportunity to get out of that"
    },
    {
      "id": 59,
      "start": 352.7200012207031,
      "end": 358.32000732421875,
      "text": " classroom. I don't like this classroom, and we may miss the lesson that God has for us."
    },
    {
      "id": 60,
      "start": 358.32000732421875,
      "end": 366.32000732421875,
      "text": " But we know the perspective here of the psalmist when he says, It is good for me,"
    },
    {
      "id": 61,
      "start": 367.0400085449219,
      "end": 373.760009765625,
      "text": " it is good for me that I have been afflicted. That's a perspective that we need to adopt in"
    },
    {
      "id": 62,
      "start": 373.760009765625,
      "end": 380.32000732421875,
      "text": " our lives. As we note the perspective, we also note the result. He says that he learns the"
    },
    {
      "id": 63,
      "start": 380.32000732421875,
      "end": 387.0400085449219,
      "text": " statutes. He says that I may learn, that I might, excuse me, learn thy statutes. And so God uses the"
    },
    {
      "id": 64,
      "start": 387.0400085449219,
      "end": 391.5199890136719,
      "text": " classroom of affliction. We see it in the life of the psalmist here, and we know in verse 71."
    },
    {
      "id": 65,
      "start": 391.5199890136719,
      "end": 396.7200012207031,
      "text": " I want you to back up just a few verses, and I want you to see what he says in verse number 67,"
    },
    {
      "id": 66,
      "start": 396.7200012207031,
      "end": 402.0,
      "text": " how he speaks about the past and the present. He says this, Before I was afflicted,"
    },
    {
      "id": 67,
      "start": 402.0,
      "end": 411.67999267578125,
      "text": " notice what he says, I went astray. But then notice the end of verse 67, But now have I kept"
    },
    {
      "id": 68,
      "start": 412.32000732421875,
      "end": 419.760009765625,
      "text": " thy word. What changed? The classroom of affliction, right? Because he says in verse 67,"
    },
    {
      "id": 69,
      "start": 419.760009765625,
      "end": 426.6400146484375,
      "text": " he says, I went astray, but now I've kept thy word. And the difference, the change was the"
    },
    {
      "id": 70,
      "start": 426.6400146484375,
      "end": 432.1600036621094,
      "text": " affliction, because he says, Before I was afflicted, I went astray. And what a blessing"
    },
    {
      "id": 71,
      "start": 432.1600036621094,
      "end": 438.7200012207031,
      "text": " to think about the way in which God will help us to learn in the classroom of affliction."
    },
    {
      "id": 72,
      "start": 439.2799987792969,
      "end": 444.1600036621094,
      "text": " Again, it's a classroom that often we don't desire to go to, but again, as we understand,"
    },
    {
      "id": 73,
      "start": 444.1600036621094,
      "end": 450.55999755859375,
      "text": " and I made the point of stressing it by way of introduction, that we must learn that God knows"
    },
    {
      "id": 74,
      "start": 450.55999755859375,
      "end": 457.2799987792969,
      "text": " best, and that God knows when we need to experience, that we need to learn a lesson"
    },
    {
      "id": 75,
      "start": 457.2799987792969,
      "end": 465.2799987792969,
      "text": " that will be best taught in the classroom of affliction. It may not be that we'll learn that"
    },
    {
      "id": 76,
      "start": 465.2799987792969,
      "end": 471.8399963378906,
      "text": " lesson in any other classroom. It may not be that we'll learn of that attribute and of the nature"
    },
    {
      "id": 77,
      "start": 471.8399963378906,
      "end": 477.2799987792969,
      "text": " of our God in any other classroom. And so God wants us to grow, He wants us to learn, and the"
    },
    {
      "id": 78,
      "start": 477.2799987792969,
      "end": 482.7200012207031,
      "text": " psalmist has this plea, the psalmist has this desire, and God is answering his prayer through"
    },
    {
      "id": 79,
      "start": 482.7200012207031,
      "end": 489.44000244140625,
      "text": " affliction. And you say, Really? Yeah. And he recognized that it was an answer to prayer,"
    },
    {
      "id": 80,
      "start": 489.44000244140625,
      "end": 496.6400146484375,
      "text": " because he says, It is good for me that I have been afflicted, that I might learn thy statutes."
    },
    {
      "id": 81,
      "start": 496.6400146484375,
      "end": 503.8399963378906,
      "text": " God, you answered my prayer, you answered my plea, you answered my desire to teach me thy statutes"
    },
    {
      "id": 82,
      "start": 503.8399963378906,
      "end": 510.32000732421875,
      "text": " by taking me through the classroom of affliction. What a great perspective, what a great testimony."
    },
    {
      "id": 83,
      "start": 510.32000732421875,
      "end": 514.47998046875,
      "text": " We see the testimony of the psalmist, I want you to consider the testimony of the Apostle Paul. Turn"
    },
    {
      "id": 84,
      "start": 514.47998046875,
      "end": 518.8800048828125,
      "text": " to the book of 2 Corinthians, if you will, and I want to note a couple of passages here in the book"
    },
    {
      "id": 85,
      "start": 518.8800048828125,
      "end": 526.47998046875,
      "text": " of 2 Corinthians as we note the testimony of Paul with regard to this classroom of affliction."
    },
    {
      "id": 86,
      "start": 526.47998046875,
      "end": 532.1599731445312,
      "text": " In 2 Corinthians chapter number 4, we note that Paul is going to rehearse some things with regard"
    },
    {
      "id": 87,
      "start": 532.1599731445312,
      "end": 538.5599975585938,
      "text": " to some of his experiences and some of the things in which he dealt with, and he's going to make"
    },
    {
      "id": 88,
      "start": 538.5599975585938,
      "end": 545.280029296875,
      "text": " this list a whole lot longer. In chapter number 11, he goes through all of the things that he"
    },
    {
      "id": 89,
      "start": 545.280029296875,
      "end": 551.1199951171875,
      "text": " suffered. But here in chapter number 4, he's speaking, and he says this in verse number 8,"
    },
    {
      "id": 90,
      "start": 551.1199951171875,
      "end": 558.47998046875,
      "text": " we are troubled on every side, yet not distressed. We are perplexed, but not in despair. Verse 9,"
    },
    {
      "id": 91,
      "start": 558.47998046875,
      "end": 566.47998046875,
      "text": " persecuted but not forsaken, cast down but not destroyed. Notice what he says in verse number 10"
    },
    {
      "id": 92,
      "start": 566.47998046875,
      "end": 572.3200073242188,
      "text": " of 2 Corinthians 4, always bearing about in the body the dying of the Lord Jesus,"
    },
    {
      "id": 93,
      "start": 572.3200073242188,
      "end": 579.52001953125,
      "text": " that the life also of Jesus might be made manifest in our body. And I want you to skip down and look"
    },
    {
      "id": 94,
      "start": 579.52001953125,
      "end": 585.280029296875,
      "text": " at verse number 16. It says, for which cause we faint not, but though our outward man perish,"
    },
    {
      "id": 95,
      "start": 585.280029296875,
      "end": 591.2000122070312,
      "text": " yet the inward man is renewed day by day. And so, he's described for us a little bit here of"
    },
    {
      "id": 96,
      "start": 591.2000122070312,
      "end": 596.5599975585938,
      "text": " some of what he's dealt with and some of the circumstances in which he faces. And then I want"
    },
    {
      "id": 97,
      "start": 596.5599975585938,
      "end": 604.4000244140625,
      "text": " you to, again, note the perspective in verse number 17. Notice what Paul says, for our light"
    },
    {
      "id": 98,
      "start": 605.280029296875,
      "end": 612.4000244140625,
      "text": " affliction, which is but for a moment. Now, just pause there. We'll read the rest of the"
    },
    {
      "id": 99,
      "start": 612.4000244140625,
      "end": 617.760009765625,
      "text": " verse in just a moment, but I want you to really get a hold of the perspective of the Apostle Paul,"
    },
    {
      "id": 100,
      "start": 617.760009765625,
      "end": 625.1199951171875,
      "text": " because he says, as he's describing the affliction, he describes it as being a light affliction,"
    },
    {
      "id": 101,
      "start": 625.1199951171875,
      "end": 630.5599975585938,
      "text": " and he describes it as being but for a moment. And no doubt, when we're in the classroom of"
    },
    {
      "id": 102,
      "start": 630.5599975585938,
      "end": 635.760009765625,
      "text": " affliction, there are times in which we would not describe it as being light or being brief,"
    },
    {
      "id": 103,
      "start": 636.719970703125,
      "end": 642.7999877929688,
      "text": " right? And yet, the Apostle Paul, and we know, and I mentioned already that in 2 Corinthians 11,"
    },
    {
      "id": 104,
      "start": 642.7999877929688,
      "end": 646.6400146484375,
      "text": " and we don't have time to read all of it, but in 2 Corinthians chapter number 11,"
    },
    {
      "id": 105,
      "start": 646.6400146484375,
      "end": 652.0800170898438,
      "text": " really beginning in verse number 21 and going down through verse number 28, he really lists all the"
    },
    {
      "id": 106,
      "start": 652.0800170898438,
      "end": 657.3599853515625,
      "text": " things that he dealt with and all of the things that he suffered, but yet the Apostle Paul, because"
    },
    {
      "id": 107,
      "start": 657.3599853515625,
      "end": 663.4400024414062,
      "text": " of this perspective, he can look at the affliction that he dealt with and he can refer to it as being"
    },
    {
      "id": 108,
      "start": 663.4400024414062,
      "end": 669.2000122070312,
      "text": " a light affliction that is but for a moment. Why is it that he would say it's for a moment? Well,"
    },
    {
      "id": 109,
      "start": 669.2000122070312,
      "end": 676.5599975585938,
      "text": " because in light of eternity, it truly is but a moment. Peter ends, as he's writing to the"
    },
    {
      "id": 110,
      "start": 676.5599975585938,
      "end": 682.0800170898438,
      "text": " believers that are suffering and they're dealing with great adversity, and as he's writing to these"
    },
    {
      "id": 111,
      "start": 682.0800170898438,
      "end": 689.2000122070312,
      "text": " people that have been suffering and they've been dealing with these things and so on and so forth,"
    },
    {
      "id": 112,
      "start": 689.2000122070312,
      "end": 692.9600219726562,
      "text": " and he says this in 1 Peter 5 and verse number 10, he says,"
    },
    {
      "id": 113,
      "start": 692.9600219726562,
      "end": 697.2000122070312,
      "text": " But the God of all grace, who hath caught us unto his eternal glory by Christ Jesus,"
    },
    {
      "id": 114,
      "start": 697.760009765625,
      "end": 703.52001953125,
      "text": " after that ye have suffered a while, make you perfect, establish, strengthen, settle you."
    },
    {
      "id": 115,
      "start": 704.1599731445312,
      "end": 708.7999877929688,
      "text": " To him be glory and dominion forever and ever. Amen. It's interesting because he says that he"
    },
    {
      "id": 116,
      "start": 708.7999877929688,
      "end": 715.5999755859375,
      "text": " hath caught us unto his eternal glory, and then he says, after that you have suffered a while."
    },
    {
      "id": 117,
      "start": 715.5999755859375,
      "end": 722.239990234375,
      "text": " We don't know how long a while is, but we know this one thing, it's not forever. Amen. It's a"
    },
    {
      "id": 118,
      "start": 722.239990234375,
      "end": 728.8800048828125,
      "text": " lot shorter than eternity. And so when we think about the perspective, and he says it's a light"
    },
    {
      "id": 119,
      "start": 728.8800048828125,
      "end": 735.280029296875,
      "text": " affliction and it's just for a moment, which is but for a moment, notice what he says. Notice"
    },
    {
      "id": 120,
      "start": 735.280029296875,
      "end": 739.8400268554688,
      "text": " what the affliction produces. Notice what the perspective is here. He says at the end of verse"
    },
    {
      "id": 121,
      "start": 739.8400268554688,
      "end": 753.280029296875,
      "text": " number 17 here in 2 Corinthians 4, worketh for us a far more exceeding and eternal weight of glory."
    },
    {
      "id": 122,
      "start": 754.1599731445312,
      "end": 758.5599975585938,
      "text": " Isn't that good? When you think about this classroom of affliction, you think about the"
    },
    {
      "id": 123,
      "start": 758.5599975585938,
      "end": 764.47998046875,
      "text": " psalmist, and he says, it is good for me that I've been afflicted, that I might learn thy statutes."
    },
    {
      "id": 124,
      "start": 764.47998046875,
      "end": 769.1199951171875,
      "text": " And here the apostle Paul, he says that our light affliction, which is but for a moment,"
    },
    {
      "id": 125,
      "start": 769.1199951171875,
      "end": 778.3200073242188,
      "text": " notice it worketh for us a far more exceeding and eternal weight of glory. Notice, turn over"
    },
    {
      "id": 126,
      "start": 778.3200073242188,
      "end": 782.239990234375,
      "text": " to chapter number 12, if you will, here, 2 Corinthians, and I want you to notice we're"
    },
    {
      "id": 127,
      "start": 782.239990234375,
      "end": 786.7999877929688,
      "text": " familiar with the passage of Scripture, and often we quote part of verse number 9 when it says,"
    },
    {
      "id": 128,
      "start": 786.7999877929688,
      "end": 792.0,
      "text": " my grace is sufficient for thee. But I want you to look at the entirety here very briefly. In verse"
    },
    {
      "id": 129,
      "start": 792.0,
      "end": 797.0399780273438,
      "text": " number 7, the Bible says that Paul is sharing his testimony and says, lest I should be exalted"
    },
    {
      "id": 130,
      "start": 797.0399780273438,
      "end": 802.9600219726562,
      "text": " above measure through the abundance of the revelations. Notice, there was given to me a"
    },
    {
      "id": 131,
      "start": 802.9600219726562,
      "end": 811.0399780273438,
      "text": " thorn in the flesh, the messenger of Satan to buffet me, lest I should be exalted above measure."
    },
    {
      "id": 132,
      "start": 811.0399780273438,
      "end": 816.6400146484375,
      "text": " Notice what Paul says about this thing. He says, for this thing I besought the Lord thrice,"
    },
    {
      "id": 133,
      "start": 817.2000122070312,
      "end": 824.719970703125,
      "text": " that it might depart from me. What's Paul saying? I wasn't enjoying this, right? So I asked the Lord"
    },
    {
      "id": 134,
      "start": 824.719970703125,
      "end": 829.4400024414062,
      "text": " on three separate occasions. Remember, we used the example on Sunday morning of Paul being a man"
    },
    {
      "id": 135,
      "start": 829.4400024414062,
      "end": 836.0,
      "text": " of prayer. Paul, right after his conversion, God says to Ananias, you're going to go into the city,"
    },
    {
      "id": 136,
      "start": 836.0,
      "end": 839.760009765625,
      "text": " you're going to go on the street, you're going to find one by the name of Saul, and he's praying."
    },
    {
      "id": 137,
      "start": 839.760009765625,
      "end": 845.5999755859375,
      "text": " And that was the start of his prayer life, and we see it throughout his life. He is a man of prayer."
    },
    {
      "id": 138,
      "start": 845.5999755859375,
      "end": 851.52001953125,
      "text": " He constantly encouraged others by telling them that he's praying for them. He constantly asked"
    },
    {
      "id": 139,
      "start": 851.52001953125,
      "end": 856.719970703125,
      "text": " others to pray for him, and here he speaks specifically about praying, and he begged,"
    },
    {
      "id": 140,
      "start": 856.719970703125,
      "end": 862.239990234375,
      "text": " he besought the Lord on three separate occasions that it might depart from me. But notice what God"
    },
    {
      "id": 141,
      "start": 862.239990234375,
      "end": 871.3599853515625,
      "text": " says. He, God, said unto me, my grace is sufficient for thee, for my strength is made perfect"
    },
    {
      "id": 142,
      "start": 872.0800170898438,
      "end": 878.0,
      "text": " in weakness. Can I tell you, let me finish reading. It says, most gladly therefore"
    },
    {
      "id": 143,
      "start": 878.719970703125,
      "end": 887.5999755859375,
      "text": " will I rather glory in my infirmities that the power of Christ may rest upon me. Therefore,"
    },
    {
      "id": 144,
      "start": 889.0399780273438,
      "end": 896.47998046875,
      "text": " I take pleasure in infirmities, in reproaches, in necessities, in persecutions,"
    },
    {
      "id": 145,
      "start": 897.2000122070312,
      "end": 904.6400146484375,
      "text": " in distresses for Christ's sake. For when I am weak, then am I strong. Let me ask you,"
    },
    {
      "id": 146,
      "start": 904.6400146484375,
      "end": 912.0,
      "text": " do you think Paul learned something through this time of affliction in his life? Sure he did."
    },
    {
      "id": 147,
      "start": 913.52001953125,
      "end": 920.3200073242188,
      "text": " He learned that God's grace is sufficient. He learned that God's response to him seeking the"
    },
    {
      "id": 148,
      "start": 920.3200073242188,
      "end": 927.1199951171875,
      "text": " face of God on these three occasions and saying, Lord, let this thing depart from me. And God says,"
    },
    {
      "id": 149,
      "start": 927.1199951171875,
      "end": 934.6400146484375,
      "text": " my grace is sufficient. And he tells them that my strength is made perfect in weakness."
    },
    {
      "id": 150,
      "start": 936.1599731445312,
      "end": 943.5999755859375,
      "text": " Sometimes we don't like the feeling, the position of being weak, or feeling weak. We feel vulnerable."
    },
    {
      "id": 151,
      "start": 943.5999755859375,
      "end": 950.6400146484375,
      "text": " But the reality is that Paul responds to this lesson that he learned. He responds to this truth"
    },
    {
      "id": 152,
      "start": 950.6400146484375,
      "end": 957.1199951171875,
      "text": " that he's given because of this affliction. He says, most gladly therefore will I rather"
    },
    {
      "id": 153,
      "start": 957.1199951171875,
      "end": 966.4000244140625,
      "text": " glory in my infirmities. Why? That the power of Christ may rest upon me. Christ in me,"
    },
    {
      "id": 154,
      "start": 966.4000244140625,
      "end": 974.4000244140625,
      "text": " the hope of glory. Amen? We're to be strong in the power of His might. We find here that"
    },
    {
      "id": 155,
      "start": 974.4000244140625,
      "end": 979.2000122070312,
      "text": " he then concludes, and quite honestly, as you read verse number 10 of 2 Corinthians 12,"
    },
    {
      "id": 156,
      "start": 979.760009765625,
      "end": 985.280029296875,
      "text": " your mind just seeking to wrap around this perspective and asking the Lord to help us to"
    },
    {
      "id": 157,
      "start": 985.280029296875,
      "end": 991.280029296875,
      "text": " get to this place in our lives where we too could echo the words and say, therefore I take pleasure"
    },
    {
      "id": 158,
      "start": 992.0800170898438,
      "end": 1000.1599731445312,
      "text": " in infirmities, in reproaches, in necessities, in persecution, in distresses for Christ's sake. Why?"
    },
    {
      "id": 159,
      "start": 1000.9600219726562,
      "end": 1008.9600219726562,
      "text": " Because when I am weak, then am I strong. It's the strength of Christ. And Paul learned this"
    },
    {
      "id": 160,
      "start": 1008.9600219726562,
      "end": 1016.8800048828125,
      "text": " lesson, and what valuable lesson it is for him. It was for him, but it is for us as well as we"
    },
    {
      "id": 161,
      "start": 1016.8800048828125,
      "end": 1023.2000122070312,
      "text": " consider tonight this classroom of affliction. I want to draw your attention to Psalm 34. I"
    },
    {
      "id": 162,
      "start": 1023.2000122070312,
      "end": 1028.47998046875,
      "text": " mentioned this a couple of Sundays ago in our Sunday school class when we looked at that truth"
    },
    {
      "id": 163,
      "start": 1028.6400146484375,
      "end": 1035.3599853515625,
      "text": " from Psalm 62 and verse number 8, but I want you to notice in Psalm 34 in closing this evening,"
    },
    {
      "id": 164,
      "start": 1038.0,
      "end": 1044.6400146484375,
      "text": " in Psalm 34, of course, David is rejoicing, he's blessing the Lord, he's speaking of his"
    },
    {
      "id": 165,
      "start": 1044.6400146484375,
      "end": 1050.4000244140625,
      "text": " personal experiences and deliverances, and then he speaks about the righteous as he goes through"
    },
    {
      "id": 166,
      "start": 1050.4000244140625,
      "end": 1056.3199462890625,
      "text": " the passage. But I want you to notice in verse number 19 that he says, many are the afflictions"
    },
    {
      "id": 167,
      "start": 1056.47998046875,
      "end": 1062.0,
      "text": " are the afflictions of the righteous. He says this, but the Lord delivers him out of them all."
    },
    {
      "id": 168,
      "start": 1062.800048828125,
      "end": 1067.199951171875,
      "text": " And we can carry that truth and that promise, and we can rejoice in that."
    },
    {
      "id": 169,
      "start": 1067.199951171875,
      "end": 1072.239990234375,
      "text": " And we can understand that many are the afflictions of the righteous, and that when those"
    },
    {
      "id": 170,
      "start": 1072.239990234375,
      "end": 1079.199951171875,
      "text": " afflictions come in your life and in my life, that God has a purpose in them, that God has a purpose"
    },
    {
      "id": 171,
      "start": 1079.199951171875,
      "end": 1086.9599609375,
      "text": " for them. Listen, our God is in control of all things, and our God is a good God. He's a gracious"
    },
    {
      "id": 172,
      "start": 1086.9599609375,
      "end": 1092.9599609375,
      "text": " God. He's a loving God. And when we understand that He loves us and He cares about us and"
    },
    {
      "id": 173,
      "start": 1092.9599609375,
      "end": 1098.239990234375,
      "text": " He's invited us to enter into His presence, He said to us, cast your care upon me, for I care"
    },
    {
      "id": 174,
      "start": 1098.239990234375,
      "end": 1103.43994140625,
      "text": " for you. And you say, well, then why would He let me deal with afflictions? Because He wants to teach"
    },
    {
      "id": 175,
      "start": 1103.43994140625,
      "end": 1111.9200439453125,
      "text": " us some lessons. And some lessons are only going to be learned in the classroom of affliction."
    },
    {
      "id": 176,
      "start": 1113.0400390625,
      "end": 1118.3199462890625,
      "text": " I'm going to read to you two quotes in closing this evening. One, I don't agree with either"
    },
    {
      "id": 177,
      "start": 1118.3199462890625,
      "end": 1123.3599853515625,
      "text": " one of these guys on everything theologically, but I think that the quotes that they made in"
    },
    {
      "id": 178,
      "start": 1123.3599853515625,
      "end": 1131.199951171875,
      "text": " reference to this subject are powerful. Martin Luther said this, I never knew the meaning of"
    },
    {
      "id": 179,
      "start": 1131.199951171875,
      "end": 1140.8800048828125,
      "text": " God's Word until I came into affliction. I have always found it, affliction, one of my best"
    },
    {
      "id": 180,
      "start": 1140.8800048828125,
      "end": 1152.8800048828125,
      "text": " schoolmasters. Wow, that's powerful. Spurgeon said this, very little is to be learned without affliction."
    },
    {
      "id": 181,
      "start": 1153.0400390625,
      "end": 1165.760009765625,
      "text": " If we would be scholars, we must be sufferers. God's commands are best read with eyes wet with"
    },
    {
      "id": 182,
      "start": 1165.760009765625,
      "end": 1173.52001953125,
      "text": " tears. That's powerful. These two men, again, I don't agree with everything theologically,"
    },
    {
      "id": 183,
      "start": 1173.52001953125,
      "end": 1180.0799560546875,
      "text": " but those are powerful statements from their walk with Christ and their experience in the"
    },
    {
      "id": 184,
      "start": 1180.0799560546875,
      "end": 1185.760009765625,
      "text": " classroom of affliction and saying that, I've learned just as the psalmist said that it was"
    },
    {
      "id": 185,
      "start": 1185.760009765625,
      "end": 1191.3599853515625,
      "text": " good for me to be afflicted because then I learned thy statutes, that I've learned that"
    },
    {
      "id": 186,
      "start": 1191.3599853515625,
      "end": 1199.0400390625,
      "text": " this classroom of affliction, this is one of my best schoolmasters. I realize that this classroom"
    },
    {
      "id": 187,
      "start": 1199.0400390625,
      "end": 1208.800048828125,
      "text": " may not be our favorite. However, I hope we learn to trust our loving Lord and appreciate His use"
    },
    {
      "id": 188,
      "start": 1209.52001953125,
      "end": 1218.0799560546875,
      "text": " of this classroom in our lives. For then, we will learn the lessons that He desires to teach us."
    },
    {
      "id": 189,
      "start": 1219.280029296875,
      "end": 1224.9599609375,
      "text": " I'm glad that it's not the only classroom that the Lord has. Amen? There are other classrooms,"
    },
    {
      "id": 190,
      "start": 1225.8399658203125,
      "end": 1229.0400390625,
      "text": " but there are seasons in our life that God says,"
    },
    {
      "id": 191,
      "start": 1231.0400390625,
      "end": 1237.52001953125,
      "text": " for this season, this is the classroom, the classroom of affliction. And when we learn to"
    },
    {
      "id": 192,
      "start": 1237.5999755859375,
      "end": 1246.719970703125,
      "text": " trust our loving Lord and learn to understand that He has a plan and a purpose for that classroom"
    },
    {
      "id": 193,
      "start": 1246.719970703125,
      "end": 1255.52001953125,
      "text": " in our lives, then we can learn the lessons that He has for us in that classroom. By the way,"
    },
    {
      "id": 194,
      "start": 1256.4000244140625,
      "end": 1260.56005859375,
      "text": " as a side note, it's a classroom that I desire to learn in quickly."
    },
    {
      "id": 195,
      "start": 1260.719970703125,
      "end": 1267.5999755859375,
      "text": " I don't say that just to be facetious. I'm being honest. It's a classroom that I desire. If God has"
    },
    {
      "id": 196,
      "start": 1267.5999755859375,
      "end": 1272.56005859375,
      "text": " that classroom for me, I want to learn the lesson as quickly as possible. But here's what I've"
    },
    {
      "id": 197,
      "start": 1272.56005859375,
      "end": 1279.43994140625,
      "text": " learned. When I despise the classroom of affliction, I spend more time in the classroom"
    },
    {
      "id": 198,
      "start": 1279.43994140625,
      "end": 1288.0799560546875,
      "text": " of affliction. Right? What happens in school when you fail a class? You get to repeat the class."
    },
    {
      "id": 199,
      "start": 1288.3199462890625,
      "end": 1295.280029296875,
      "text": " You get to repeat the class. I know nowadays they have some policies and whatever that change some"
    },
    {
      "id": 200,
      "start": 1295.280029296875,
      "end": 1300.0799560546875,
      "text": " of that, but I remember when I was going through school, you failed a class, you'd repeat the class."
    },
    {
      "id": 201,
      "start": 1301.6800537109375,
      "end": 1306.0,
      "text": " Why? Because there were some lessons, there were some principles that you had to learn before you"
    },
    {
      "id": 202,
      "start": 1306.0,
      "end": 1311.5999755859375,
      "text": " went on. Right? And by the way, just by pushing somebody to the next class doesn't really do any"
    },
    {
      "id": 203,
      "start": 1311.5999755859375,
      "end": 1318.800048828125,
      "text": " favors for them because they're always behind. Right? It's always a challenge for them. And so,"
    },
    {
      "id": 204,
      "start": 1318.800048828125,
      "end": 1324.6400146484375,
      "text": " until those principles are learned, you do not get to go to the next grade, to the next class,"
    },
    {
      "id": 205,
      "start": 1324.6400146484375,
      "end": 1330.4000244140625,
      "text": " to the next... Right? And God has this classroom of affliction. He says, these are some lessons"
    },
    {
      "id": 206,
      "start": 1330.4000244140625,
      "end": 1335.5999755859375,
      "text": " that I want you to learn. And I want to come to the place in my life, and I hope tonight as we've"
    },
    {
      "id": 207,
      "start": 1335.5999755859375,
      "end": 1340.1600341796875,
      "text": " spent just a few minutes looking at this classroom of affliction, that you too would want to come to"
    },
    {
      "id": 208,
      "start": 1340.1600341796875,
      "end": 1346.0,
      "text": " the place in your life where we learn to appreciate the classroom of affliction, just as the psalmist"
    },
    {
      "id": 209,
      "start": 1346.0,
      "end": 1351.5999755859375,
      "text": " did, just as Paul did. And we say, Lord, teach me thy statutes. And I understand sometimes in praying"
    },
    {
      "id": 210,
      "start": 1351.5999755859375,
      "end": 1358.47998046875,
      "text": " that prayer, you may use the classroom of affliction. Help me not to despise it. Help me to know"
    },
    {
      "id": 211,
      "start": 1359.199951171875,
      "end": 1367.280029296875,
      "text": " and to trust that you know best, and you know what classroom I need to learn what lesson."
    },
    {
      "id": 212,
      "start": 1368.0,
      "end": 1374.6400146484375,
      "text": " Amen? Let's pray. Father, we love you. We thank you so much for loving us. And we know that"
    },
    {
      "id": 213,
      "start": 1378.9599609375,
      "end": 1382.0799560546875,
      "text": " you're in control of everything, and you have a purpose for everything."
    },
    {
      "id": 214,
      "start": 1383.8399658203125,
      "end": 1389.3599853515625,
      "text": " Perhaps tonight there's one that's in the classroom of affliction. They know it."
    },
    {
      "id": 215,
      "start": 1392.0,
      "end": 1394.0799560546875,
      "text": " Maybe they know the lesson that you're teaching them."
    },
    {
      "id": 216,
      "start": 1394.6400146484375,
      "end": 1397.5999755859375,
      "text": " Maybe they're so uncertain as to the lesson that you're teaching them."
    },
    {
      "id": 217,
      "start": 1400.0799560546875,
      "end": 1407.1199951171875,
      "text": " Perhaps even someone has despised the classroom of affliction. God, I pray that you'd help us."
    },
    {
      "id": 218,
      "start": 1408.239990234375,
      "end": 1411.1199951171875,
      "text": " I'm thankful this isn't the only classroom that you have for us."
    },
    {
      "id": 219,
      "start": 1412.6400146484375,
      "end": 1417.1199951171875,
      "text": " But we do recognize as we study your Word that this is a classroom that you have for us."
    },
    {
      "id": 220,
      "start": 1417.760009765625,
      "end": 1425.3599853515625,
      "text": " At times that you know best, you'll send us to this classroom of affliction."
    },
    {
      "id": 221,
      "start": 1426.56005859375,
      "end": 1430.719970703125,
      "text": " And I pray that in those times that we would trust you fully and wholly,"
    },
    {
      "id": 222,
      "start": 1431.8399658203125,
      "end": 1435.9200439453125,
      "text": " and know that you have a purpose, and help us to learn those lessons."
    },
    {
      "id": 223,
      "start": 1437.43994140625,
      "end": 1445.280029296875,
      "text": " Help us to draw closer to thee. Help us to trust you more. I pray that you'd bless our time of"
    },
    {
      "id": 224,
      "start": 1445.760009765625,
      "end": 1451.280029296875,
      "text": " prayer. We thank you for the privilege of corporate prayer. I pray that you'd bless"
    },
    {
      "id": 225,
      "start": 1451.280029296875,
      "end": 1456.56005859375,
      "text": " the remainder of our service. For it's in Christ's name we pray. Amen."
    }
  ],
  "processed_at": "2025-04-16T16:07:53.811323"
}