{
  "video_id": "4L7zninfmhA",
  "text": "This is a springboard verse into our Bible study this evening, and for the last several weeks we've been dealing with the subject matter of teach me. And throughout the book of Psalms in particular, you find the plea of the psalmist when he says teach me. And what a great desire I find in that plea, a stated desire to learn, and what a blessing it is to learn of him, amen? He's extended to us an invitation that we can come and learn of him. We understand that he has given us the Holy Spirit of God. One of the ministries of the Holy Spirit is our divine teacher, and I am so thankful that we serve the Lord God. He's given us a precious book, and he teaches us his word. When you think about that plea, teach me, we discussed, we considered the subject matter of the purpose for learning, and really we looked at two purposes for learning. And we said this, that one of the purposes for learning is application. I learn so that I can apply the truth that I've been taught. And we find that that is a biblical truth all throughout the Scriptures. We see the importance of hearing and learning for the purpose of doing. We understand, we quote often James 1 and verse 22, that we're to be doers of the word and not hearers only. And that is a principle that is taught throughout the word of God. We found that one of the purposes, the second purpose that we studied was that of dissemination of truth. I apply truth, but then I have the responsibility of giving truth. And we really looked at Ezra, we looked at the statement the Lord Jesus Christ made during his Sermon on the Mount, but Ezra, the Bible tells us, was a ready scribe, and he prepared his heart to seek the law of the Lord, and to do it, and to teach in Israel statutes and judgments. We find that in Ezra 7 and verse number 10. And we find that Ezra had a desire to learn the truth of God's word so that he could do it, the application of truth, and so that he could teach in Israel statutes and judgments, the dissemination of truth. And what a blessing to understand those two purposes for learning. Of course, I mentioned it was not an exhaustive list, but two thoughts for us with regard to why we should take and say, as the psalmist did, teach me. Last week, we studied the importance of having a teachable spirit. And we looked at Acts 8, we looked at that passage of Scripture, and we said, what does a teachable spirit look like? It begins with humility. And if I want to be taught, if I'm going to be a good student and learn the truth, I must have humility. How many people have failed to learn because of pride? And the reality is that pride hinders learning, but humility promotes learning. It allows for that teaching to take place. And if we're going to have a teachable spirit, it's seen through humility. We also mentioned the desire. Remember the eunuch there in Acts 8? He responded to Philip, how can I, except some man should guide me? That's the humility. But then he desired Philip to come up and to teach him. And what a blessing. When we think about that teachable spirit, we asked ourselves this question as we would evaluate our own lives, do I have a teachable spirit? Am I teachable? Sometimes in life, we no doubt have had periods of time where we've sought to teach somebody that wasn't teachable, or someone sought to teach us and we weren't teachable, and we know how frustrating that can be. And what a blessing and what a great opportunity for us to be in a place where we have a teachable spirit. This evening, as we continue to consider this subject matter of teach me, really, I've thought about it from this perspective. When the psalmist says, teach me, when you and I adopt that desire and we make that same plea to God, what is it that we desire to learn? Lord, teach me, but teach me what? What is it that we should desire to learn? And as we think about this, if you're taking notes, I've simply titled the lesson that what should I desire to learn? And you think about this. Someone came to me recently, and it's kind of an interesting conversation, and it really kind of was something that God brought back to my mind as I was preparing for the lesson this evening. Someone came to me recently and said, would you teach me how to be a pastor? Okay, what do you mean by that? What aspect of pastoring are you interested in learning? Are you interested in the public aspect of pastoring? Are you interested in the private aspect of pastoring? You're interested in knowing how to interact with people? Are you interested in knowing how to develop sermons? Are you interested in knowing how to deal with the administration part of being a pastor? There's so many different aspects, and so in order for me to understand the request, I had to have a little bit more of information to understand what they meant by that question, by that inquiry. When I say, Lord, teach me, what is it that I want them to teach me? Notice in Psalm 27 and in verse number 11, and really this evening we're using this as a springboard. I mentioned that already. If you are taking notes, I want you to consider some recorded requests. God gives us in His Word some recorded requests, some things that the psalmist specifically says, Lord, teach me this. We'll look at a couple of other examples within the scriptures. So look at this one in Psalm 27 and verse number 11. Teach me Thy way, O Lord, and lead me in a plain path because of mine enemies. Oh, man, I need to know the way that God has for me, amen? And the plan, the path that God has laid before us, in fact, in Psalm 25 and verse number 4, he uses that phraseology that God would teach him, Thy paths. He says in Psalm 25 and verse number 4, show me Thy ways, O Lord, teach me Thy paths. I'm so thankful that God provides leadership and direction in the lives of His children. We understand in the Old Testament, you think about the wilderness wanderings. They had the pillar of cloud by day and the pillar of fire by night, and how it provided direction for the people of God as they wandered, and when the pillar of cloud or the pillar of fire stopped, they stopped, and that's where they set up camp. And then, as the pillar moved, indicating the presence of God moving, they would follow. And today, we have the Word of God, we have the Spirit of God, and we say to God, teach me Thy way, teach me Thy paths, show me the ways in which I ought to go. We find that this is one of these recorded requests that we find within the Word of God. The psalmist says in Psalm 119 a number of times, we'll just look at one of the references, but there's a number of times in Psalm 119, six times actually, that the psalmist says, teach me Thy statutes. We know that Psalm 119 is a psalm that is dedicated to the Word of God, and much information given with regard to the love that the psalmist has for the Word of God, the place that the Word of God has in the life of the psalmist, what the Word of God does for the psalmist. And we could study through the portion of Scripture and be helped immensely, but we find that in verse number 26, the Bible says this, it says in verse number 12 as well, but look in verse number 26, I have declared my ways and thou heardest me, teach me thy statutes. As we look through Psalm 119, we find that the psalmist uses the word thy statutes, or the phrase, thy statutes, thy word, thy judgments, he uses these phraseologies, thy law, to refer to the Word of God. What a great request, Lord, teach me this book, teach me thy word. I want to have an understanding. He says this in verse number 18, open thou mine eyes, that I may behold wondrous things out of thy law. What a great prayer, what a great request to learn the Word of God. In Psalm 119, in verse number 66, notice the psalmist makes this request as we consider these recorded requests, he says, teach me good judgment and knowledge, for I have believed thy commandments. Good judgment and knowledge is the request that is mentioned by the psalmist here in verse number 66. I think about the situation there with Solomon, when God appeared to Solomon, and He said to Solomon, ask what I shall give thee, and what did Solomon request? Wisdom. Wisdom. God, give me wisdom to lead this great people, your people. Give me wisdom. The Word of God tells us that God granted that request. God gave Solomon wisdom, in fact, he's the wisest man according to the Scriptures, and we find that that request was granted. In Psalm 143, notice if you turn over several chapters, in Psalm 143, the Word of God tells us in verse number 10 that there's another recorded request here, and what a blessing as we think about this truth, as we would ask the Lord to teach us His ways and His path, His statutes, we find here that the Bible says this in Psalm 143 in verse number 10, teach me to do thy will. For thou art my God, thy spirit is good, lead me into the land of uprightness. Think about that, teach me to do thy will. You know, the reality is that we can know something but not do it. We can have an understanding of something but not apply it. And here, the psalmist, the request of David in Psalm 143 is teach me to do thy will. Yes, God, reveal Your will to me, reveal Your plan to me, but teach me to do it. Not just to know it. What a sad thing to know what God wants us to do but then sit on the sidelines and not  it, right? We're to do what He's given us to do. Think about this. We'll kind of, Psalm 90, if you turn back, I know we're kind of going back and forth here, but I just want to share some of these recorded requests, and perhaps we could adopt some of these for ourselves this evening. In Psalm 90 and verse number 12, this is a psalm that is attributed to Moses, and the Bible tells us this. It's a verse that we're familiar with, actually, Psalm 90 and verse number 12. Notice this, so teach us what? Teach us to number our days. Teach us to number our days that we may apply our hearts unto wisdom. Lord, teach us to number our days. Are we not keenly aware of the brevity of life? As we study the Word of God, as we study the Scriptures, we understand the Bible tells us that our life is but a vapor that appears for a little time and then vanisheth away. And the reality is that we ought to pray and ask God to teach us, as the psalm tells us in Psalm 90 and verse number 12, teach us, Lord, to number our days. Help us that we may apply our hearts unto wisdom. The New Testament tells us that we're to redeem the time and that we are stewards of that which God has blessed us with. I think about the request that is made in Judges chapter number 13, and this is a request that is made, and a request that every parent ought to make. And here in this passage of Scripture, we find that the angel of God had appeared and had let the couple know that they were going to have a child, and Manoah wasn't there, but then he's there. And the Bible tells us in Judges 13 and verse number 8, notice the request at the end of the verse, it says, then Manoah entreated the Lord and said, O my Lord, let the man of God, which thou didst send, come again unto us, notice this, and teach us what we shall do unto the child that shall be born. I remember when Holly told me that she was expecting Juliana, and I remember that thought that overcame me of, am I ready to be a father? Am I ready for this role that now I have to fulfill? And I was very much aware of the fact that I needed God to help me to understand how to parent and what to do, and Manoah makes this great request. We're familiar with the request of the disciples in Luke chapter number 11. We won't turn there for sake of time, but in Luke chapter number 11, the disciples come to the Lord Jesus Christ, and they say, Lord, teach us to pray. Teach us to pray. That's a good request, is it not? Teach us to pray. I did a series on that on Wednesday evenings last year, and I said this when we had that series, that of all the things the disciples could have asked the Lord to teach them, the only thing that we have recorded within the Word of God that they requested was teach us to pray. Teach us to pray. And oh, that God would teach us to pray. Teach us to pray. So, we think about some of these recorded requests, and I would encourage you to do some Bible study and to consider some other portions of Scripture that we see where the people of God prayed and asked God specifically, teach me this. It's important that we would have that teachable spirit. It's important that we desire to be taught, that we might learn the Word of God, learn the truths of God, but the reality is that when we put some specific nature to that request, it helps us to go into a particular area. So, we think about these recorded requests, perhaps this evening, if you're taking notes number two, I want you to consider some relevant recommendations. I'm going to give you some recommendations this evening as to what it is that we should say, Lord, teach me. Teach me. Teach me what? What is it that you want me to teach you? Someone comes to you and says, they've observed you and say, would you teach me? What are you going to say? What do you want me to teach you, right? What is it that you would like to learn? What is it that you'd like for me to teach you? Now, someone comes to me and asks me to teach them certain things. I'm not capable of teaching certain things because I don't know how to do them, but we know that we serve the Lord God Almighty. He's given us this precious book, and He's able to teach us. Let me give you this recommendation. Number one, we should desire that God would teach us who He is, who He is. You know, today we live in a society in which many people have a misunderstanding of who God is. They do not understand the God of the Bible. They do not know His nature nor His character. There are people that sit within churches all across this land that do not know the God of the Bible. They've allowed for the culture. They've allowed for Hollywood. They've allowed for politics. They've allowed for all sorts of people to influence them with regard to who God is. But God's given us this precious book, and He has revealed to us His nature, and He's revealed to us who He is. Paul said this, probably from our perspective, one of the greatest Christians that ever walked upon the face of the earth. He said that I may know Him. Now, think about that. In Philippians 3 and verse number 10, he's in prison awaiting his execution, and he says that I may know Him. He wants to know God in a greater way. He wants to know God in a more intimate way. And when we understand this tonight, what an important aspect that we'd say, Lord, teach me who You are. Teach me Your attributes. Teach me Your nature. Because the reality is that when we understand in a greater way who our God is, it increases our faith. It helps us to trust Him. It helps us to walk in obedience to Him. Why? Because we know who He is. When we begin to go to the Word of God, and we begin to seek the Word of God with regard to some of these other areas in which I'll mention this evening, the reality is if we don't first know who God is, it can trouble the findings that we discover with regard to other areas of our lives, with regard to pleasing Him, because we do not understand how much He loves us and how He has our best interest in mind. See, God knows us. God formed us. Let me say this. He knows what's best for us. Amen? You believe that tonight? I believe that with all my heart. I sat across the table from someone a few years ago, and they said, well, preacher, let me just tell you this. God wants me to be happy. And then they said this, and this makes me happy. Well, I got a whole bucket load of verses that teach us that we're not supposed to do this, and so this can't be in connection with what you understand. Here's the problem with that individual. They didn't understand the love of God. They didn't understand who God was. They had this misconception that God loves me and God wants me to be happy, and so therefore, if this behavior or this activity makes me happy, then by default, God must be okay with it. It's not the truth of God's Word. Amen? And when we understand who God is and we understand that God as the Creator has given us truth that will help us know how we're to live our lives and how we can please Him, and when we come to those portions and passages of Scripture that God is giving us that instruction, when we have that understanding of who He is and how much He loves us, it helps us to submit to it and to learn what He's trying to teach us. And so first, we ought to pray that God would teach us who He is. As I've mentioned before, many of us have some understanding of who God is, but can I tell you this? His greatness is unsearchable, according to Psalm 145. I'll stand with anyone and say, I know that the Lord is great. He is. He's a great God. He's revealed His greatness to me. I stand in awe of who He is, but I'd say this, I only scratch the surface of understanding the infinite God. My finite mind cannot fully comprehend the infinite God, and neither can yours. Amen? So, we ought to daily say, Lord, teach me who You are. Help me to understand in a greater way Your attributes and Your nature. Let me say this, when I ask God to teach us His plan, what is God's plan? We mentioned about the recorded request of Thy paths and Thy way, but I think about this, when we, as the people of God living in 2022, that we say, what is Your plan, God? What is Your plan for today? We know that He has established the church. It is His establishment. It is the organism that God has chosen to use in this period of history, and the church is not man's idea. It's not the result of Constantine or anyone else. It is God's plan. It is God's idea. And God is the head of the church, and He has a plan for His church. And so, we understand, we say, God, what is Your plan for today? What is Your plan for today with the church? What is Your plan? God has given us in His Word His plan for reaching this world with the gospel of Jesus Christ. So often, we neglect to just simply go to the Word of God and say, okay, what is God's plan? Okay, here's what God's plan is. Let's do it, right? Remember the truth of Psalm 143 and verse number 10, teach me to do Thy will. Sometimes we like to just sit around and have seminars talking about what we already know needs to be done instead of just doing it. And I want to know what God's plan is for today. How about God's plan for the future? What's God's plan for the future? He's given us prophecy. I'm thankful for the prophecy that He's given us. We cannot neglect today for the purpose of studying prophecy, but there should be a balance. But as we study prophecy, it helps us to understand God's plan and what God's timeline is and what His timetable is and what are the next events and what is it that's going to happen. And we think about that truth of prophecy, and I'm thankful that our God is Alpha and Omega, that He knows the end from the beginning, and that He can give us in this recorded book His plan for the ages. Amen? And what a blessing that is. I say, God, I want to know your plan. Let me say this. If I think about this relevant request or recommendation, a relevant recommendation, I would say not only knowing who God is and knowing what God's plan is, but let me say this. What is my place within God's plan? God, what is my place within your plan? I understand, God, that you have a plan. I understand that your plan is to use the local church, and God, I understand that I am part of the local church. What's your plan for me? What is my place within your plan? I believe tonight that we all have a place within God's plan. Amen? If God didn't have a place for you within His plan, you wouldn't be here still. Amen? But if you're living and you're breathing, and you are, because you're here tonight, the reality is that God has a place for you within His plan. You say, well, I don't know what my place is. That's why we say, Lord, teach me your place, my place within your plan, and we ask God to show us. Listen, the Word of God teaches us in 1 Peter chapter number 4 that every man has received a spiritual gift. The Bible teaches us the book of 1 Corinthians. If you look through chapters really 12 through 15 and look at those portions of Scripture, you find that the Word of God teaches us that the Spirit equips and gifts every believer as He will. And the Bible tells us that He equips us spiritually for the purpose of edification, for the purpose of the church. The Word of God likens the church to a body, and every member is of importance. I'm thankful that I have a left hand and a right hand. I'm thankful that I have a thumb on each of my hands. I'm thankful that I got ears and eyes. It'd be a terrible thing if we had four eyes or four ears and none of the other, right? I mean, you think about the truth, and here's the reality when you look at what Paul says to the believers in Corinth. He says, listen, the eye can't say to the...and you understand what he's saying, listen, I'm of more importance than you are. No, every member has its purpose and its place. And God has uniquely designed the human body, but He's also uniquely designed the church, and He builds His church. You remember Bezalel in the Old Testament? Bezalel was the man that God particularly, specifically equipped, not only to perform the work of getting things ready for the tabernacle, but also to teach others. It was Moses that received all of the instruction, the pattern that was to be followed, but it was Bezalel that God had specifically equipped for doing that work, Bezalel and Aholiab. And you look at that, and you see what God did and how God blessed. You say, God, what is my place within your plan? What is my involvement within the church? The Bible tells us in Philippians 1, in verse number 27, that we are to strive together for the faith of the gospel. Striving together. We understand that we are laborers, co-laborers, one with another, we're co-laborers with God. Remember what Paul said? He said, who then is Paul? Who is Apollos? Some plant, some water, but God gives the increase. What is my place within the church? What is my involvement in the local church? What is my involvement within the Great Commission? If the Great Commission has been given, and God's Great Commission, His last words to the church remain our marching orders today, what part of fulfilling the Great Commission am I fulfilling? What involvement do I have in fulfilling the Great Commission? If this is God's program, if this is God's plan, and God is teaching me what His plan is for today, I say, God, what's my place in that plan? I want to be involved in what God's doing in the world, amen? And God chose that He uses people. Aren't you thankful for that? He said, I'm going to use people, human beings, my children. I'm going to equip them. They are my workmanship created in Christ Jesus. I'm going to equip them, I'm going to enable them, and then I'm going to bless them for doing what I've told them to do. That's a good deal, amen? He equips us, He enables us, and then He blesses us. It's amazing. God, what's my place within Your plan? Let me say this in closing this evening. I would say that we could pray and ask God to teach me, teach me how I can please Him. You know, 1 Corinthians chapter number 10 tells us of some Old Testament biblical accounts where the Bible says that with many of them, God was not well-pleased. I do not desire that it would be said of my life, and I do not desire that it would be said of your life, that God is not well-pleased, amen? I want to please Him, I want to please Him. The first part of Proverbs 16 and verse number 7 says, when a man's ways please the Lord, when a man's ways please the Lord. I want my ways to please God, but how am I going to know? In the book of Ephesians in chapter 5 and verse number 10, God says this, as Paul is writing to those believers in Ephesus, he says, proving what is acceptable unto the Lord. Lord, teach me how to please You. Teach me how to live my life in such a way that it is pleasing in Your sight. That's a great prayer request, that's a great teach-me request, that's a, I believe, a relevant recommendation that we take in our lives today, and we say, Lord, teach me how I can please You. Can I say this, and I'm not going to look at any verses of Scripture, I'm just going to go quickly through it this evening in closing, but the reality is that if you want to know how to be a husband, go to this book, amen? You want to know how to be a wife? Go to this book. You want to know how to be a parent? Go to this book. You want to know how to be a child? I know we don't have any children in here, but for our children, one of the first verses we taught our children to memorize, children, obey your parents in the Lord, amen? It's Bible. I'm trying to teach them, why? Because when they please their parents, they're pleasing God, amen? Honor thy father and mother. Teach the first commandment with promise, amen? So you want to know how to be a good child? You better get in the book. You better get in the Word of God. Think about this. Personally, if I want to be a good pastor, the Word of God teaches me how to be a pastor. The Word of God teaches and talks about being a good minister, and it qualifies it. If you do this, then you're a good minister, all right? I want to be a good pastor. I want to please God as a pastor. The place that He's called me within His plan, I want to be a good pastor. How do I do that? Well, He says, feed the flock of God. Yes, sir, I'm going to do my best to feed the flock of God. I'm going to study and prepare and pray and seek to deliver to the best of my ability and with God's help, the Word of God. Why? Because that's my responsibility. You want to be a good church member? The Word of God teaches us how to be a good church member. Titus chapter number 2, go through it. The aged men, they're supposed to do this. The aged women, they're supposed to do this. You look at God's Word teaches us. You want to be a good church member? Go to the book. Go to the Word of God. God teach me to be a good church member. God teach me to be a good pastor. Teach me to be a good neighbor. Teach me to be a good friend, a co-worker, an employee, an employer. All of these things are found within the Word of God. God, I'm having a hard time at work. Teach me how to, right? It works. And when we add some qualifiers, if you will, to this desire of teach me, and really that's my desire this evening, to help us just think of what is it that we're saying, Lord, teach me. We're going to look at over the next several weeks of how God teaches His children. God uses a variety of classrooms. And sometimes those classrooms aren't always easy, but God uses a variety of classrooms to teach His children. And as He teaches us, that's why I've often said over the years that the reality is that we need to be careful that we understand that God can always deliver us from everything that we face. At times, however, God is more interested in developing us than in delivering us. It doesn't mean He can't deliver us. It just means He wants to develop us. And sometimes when we go through a trial and we go through a circumstance, an adversity, a problem in our lives, instead of us praying, God, deliver me from this, perhaps we should pray, God, teach me what You want to teach me through this. Help me, Lord, to learn that even in this difficulty that You're real and that You have a plan. Teach me.  teaching us that His grace is sufficient, right? Is that what Paul said? He besought the Lord thrice, and God said, Paul, my grace is sufficient for thee. Amen? God's grace is sufficient. We find this evening we could speak about a whole host of things, areas of our lives, but tonight I hope that as we would consider this thought, teach me, that we would say, what are some things, what should I desire to learn? Teach me. Teach me what? Lord, teach me who you are. I want to know you in a more intimate way. I want to know you in a greater way. I want to stand in awe of who you are. God, teach me what your plan is. Why did you leave us here? What's your plan for today? How do I fit within your plan? What is my place within your plan, God? And then, God, how can I please you with my life? Because I want to hear, well done, thou good and faithful servant. Don't you? I want to hear that. I want to be pleasing in God's sight. I want God to be pleased with me. Think about these words, and I'll close with this. Paul says this in 2 Timothy 2, as he's writing to Timothy, his son in the faith. In 2 Timothy 2, in verse 4, he says, No man that werth entangleth himself with the affairs of this life, that he may please him who hath chosen him to be a soldier. You know who chose us to be a soldier? The Lord. Amen? He talks about being a good soldier in verse 3, but the reality is that we want to please him. I want to please him. Some of you have been in the military. I grew up around the military, and there's an aspect of desiring to please, humanly speaking, a superior ranking official. When you have inspection, I remember my dad spending hours preparing for inspections, and I remember as a kid thinking, Dad, why can't you do this? Why can't you do that? Why can't we go play? Why can't we what? Why do you have to get ready for this inspection? Because some commanding officer somewhere was going to come and inspect them, and they wanted to be pleasing, right? They didn't want to have problems and difficulties. He didn't want to. So he put in the time to make sure that he could stand in that formation and go through that inspection. Oh, think about it from a heavenly perspective. We have a great God. We have a great God. He saved us, changed our lives. Oh, I want to please him with my life. If you want to please him, this book will tell you how you can please him, and it will provide you with warnings of things not to do that will displease him. Those are of equal importance. Amen? Paul says, I warn you. I warn you why? Because I love you. God's warnings are for our benefits. Amen? And what a great God we serve. Teach me. Teach me what? What is it that I should desire to learn? I hope this evening that we have a host of things that we can add to our prayer list of, God, teach me. Teach me these things. Let's pray together. Father, we love you. We thank you for loving us. We thank you that you are the divine teacher, and I pray that you'd help us, God, to be desirous of learning, that we'd have that teachable spirit, that, God, we'd pray specifically of things that we desire that you'd teach us. Help us to please you with our lives. Bless our time of prayer. Thank you for the privilege. Pray that you would bless, and we'll thank you for it. In Christ's name we pray. Amen. Draw your attention to the back of our prayer bulletin, as we do each and every week.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.420000076293945,
      "text": " This is a springboard verse into our Bible study this evening, and for the last several"
    },
    {
      "id": 1,
      "start": 4.420000076293945,
      "end": 7.860000133514404,
      "text": " weeks we've been dealing with the subject matter of teach me."
    },
    {
      "id": 2,
      "start": 7.860000133514404,
      "end": 13.4399995803833,
      "text": " And throughout the book of Psalms in particular, you find the plea of the psalmist when he"
    },
    {
      "id": 3,
      "start": 13.4399995803833,
      "end": 15.5,
      "text": " says teach me."
    },
    {
      "id": 4,
      "start": 15.5,
      "end": 22.239999771118164,
      "text": " And what a great desire I find in that plea, a stated desire to learn, and what a blessing"
    },
    {
      "id": 5,
      "start": 22.239999771118164,
      "end": 24.959999084472656,
      "text": " it is to learn of him, amen?"
    },
    {
      "id": 6,
      "start": 24.959999084472656,
      "end": 29.200000762939453,
      "text": " He's extended to us an invitation that we can come and learn of him."
    },
    {
      "id": 7,
      "start": 29.200000762939453,
      "end": 33.31999969482422,
      "text": " We understand that he has given us the Holy Spirit of God."
    },
    {
      "id": 8,
      "start": 33.31999969482422,
      "end": 37.560001373291016,
      "text": " One of the ministries of the Holy Spirit is our divine teacher, and I am so thankful that"
    },
    {
      "id": 9,
      "start": 37.560001373291016,
      "end": 39.31999969482422,
      "text": " we serve the Lord God."
    },
    {
      "id": 10,
      "start": 39.31999969482422,
      "end": 43.0,
      "text": " He's given us a precious book, and he teaches us his word."
    },
    {
      "id": 11,
      "start": 43.0,
      "end": 49.040000915527344,
      "text": " When you think about that plea, teach me, we discussed, we considered the subject matter"
    },
    {
      "id": 12,
      "start": 49.040000915527344,
      "end": 54.47999954223633,
      "text": " of the purpose for learning, and really we looked at two purposes for learning."
    },
    {
      "id": 13,
      "start": 54.47999954223633,
      "end": 58.68000030517578,
      "text": " And we said this, that one of the purposes for learning is application."
    },
    {
      "id": 14,
      "start": 58.68000030517578,
      "end": 63.08000183105469,
      "text": " I learn so that I can apply the truth that I've been taught."
    },
    {
      "id": 15,
      "start": 63.08000183105469,
      "end": 66.80000305175781,
      "text": " And we find that that is a biblical truth all throughout the Scriptures."
    },
    {
      "id": 16,
      "start": 66.80000305175781,
      "end": 71.16000366210938,
      "text": " We see the importance of hearing and learning for the purpose of doing."
    },
    {
      "id": 17,
      "start": 71.16000366210938,
      "end": 76.4000015258789,
      "text": " We understand, we quote often James 1 and verse 22, that we're to be doers of the word"
    },
    {
      "id": 18,
      "start": 76.4000015258789,
      "end": 78.12000274658203,
      "text": " and not hearers only."
    },
    {
      "id": 19,
      "start": 78.12000274658203,
      "end": 81.37999725341797,
      "text": " And that is a principle that is taught throughout the word of God."
    },
    {
      "id": 20,
      "start": 81.37999725341797,
      "end": 87.94000244140625,
      "text": " We found that one of the purposes, the second purpose that we studied was that of dissemination"
    },
    {
      "id": 21,
      "start": 87.94000244140625,
      "end": 88.94000244140625,
      "text": " of truth."
    },
    {
      "id": 22,
      "start": 88.94000244140625,
      "end": 93.37999725341797,
      "text": " I apply truth, but then I have the responsibility of giving truth."
    },
    {
      "id": 23,
      "start": 93.37999725341797,
      "end": 97.37999725341797,
      "text": " And we really looked at Ezra, we looked at the statement the Lord Jesus Christ made during"
    },
    {
      "id": 24,
      "start": 97.37999725341797,
      "end": 102.91999816894531,
      "text": " his Sermon on the Mount, but Ezra, the Bible tells us, was a ready scribe, and he prepared"
    },
    {
      "id": 25,
      "start": 102.91999816894531,
      "end": 109.9000015258789,
      "text": " his heart to seek the law of the Lord, and to do it, and to teach in Israel statutes"
    },
    {
      "id": 26,
      "start": 109.9000015258789,
      "end": 110.9000015258789,
      "text": " and judgments."
    },
    {
      "id": 27,
      "start": 110.9000015258789,
      "end": 113.13999938964844,
      "text": " We find that in Ezra 7 and verse number 10."
    },
    {
      "id": 28,
      "start": 113.13999938964844,
      "end": 119.0999984741211,
      "text": " And we find that Ezra had a desire to learn the truth of God's word so that he could do"
    },
    {
      "id": 29,
      "start": 119.0999984741211,
      "end": 124.9800033569336,
      "text": " it, the application of truth, and so that he could teach in Israel statutes and judgments,"
    },
    {
      "id": 30,
      "start": 124.9800033569336,
      "end": 126.4800033569336,
      "text": " the dissemination of truth."
    },
    {
      "id": 31,
      "start": 126.4800033569336,
      "end": 130.77999877929688,
      "text": " And what a blessing to understand those two purposes for learning."
    },
    {
      "id": 32,
      "start": 130.77999877929688,
      "end": 135.3000030517578,
      "text": " Of course, I mentioned it was not an exhaustive list, but two thoughts for us with regard"
    },
    {
      "id": 33,
      "start": 135.3000030517578,
      "end": 140.94000244140625,
      "text": " to why we should take and say, as the psalmist did, teach me."
    },
    {
      "id": 34,
      "start": 140.94000244140625,
      "end": 145.86000061035156,
      "text": " Last week, we studied the importance of having a teachable spirit."
    },
    {
      "id": 35,
      "start": 145.86000061035156,
      "end": 150.05999755859375,
      "text": " And we looked at Acts 8, we looked at that passage of Scripture, and we said, what does"
    },
    {
      "id": 36,
      "start": 150.05999755859375,
      "end": 151.86000061035156,
      "text": " a teachable spirit look like?"
    },
    {
      "id": 37,
      "start": 151.86000061035156,
      "end": 154.0800018310547,
      "text": " It begins with humility."
    },
    {
      "id": 38,
      "start": 154.0800018310547,
      "end": 160.17999267578125,
      "text": " And if I want to be taught, if I'm going to be a good student and learn the truth, I must"
    },
    {
      "id": 39,
      "start": 160.17999267578125,
      "end": 161.94000244140625,
      "text": " have humility."
    },
    {
      "id": 40,
      "start": 161.94000244140625,
      "end": 165.82000732421875,
      "text": " How many people have failed to learn because of pride?"
    },
    {
      "id": 41,
      "start": 165.82000732421875,
      "end": 171.82000732421875,
      "text": " And the reality is that pride hinders learning, but humility promotes learning."
    },
    {
      "id": 42,
      "start": 171.82000732421875,
      "end": 174.94000244140625,
      "text": " It allows for that teaching to take place."
    },
    {
      "id": 43,
      "start": 174.94000244140625,
      "end": 178.33999633789062,
      "text": " And if we're going to have a teachable spirit, it's seen through humility."
    },
    {
      "id": 44,
      "start": 178.33999633789062,
      "end": 180.4600067138672,
      "text": " We also mentioned the desire."
    },
    {
      "id": 45,
      "start": 180.4600067138672,
      "end": 183.3000030517578,
      "text": " Remember the eunuch there in Acts 8?"
    },
    {
      "id": 46,
      "start": 183.3000030517578,
      "end": 188.74000549316406,
      "text": " He responded to Philip, how can I, except some man should guide me?"
    },
    {
      "id": 47,
      "start": 188.74000549316406,
      "end": 189.74000549316406,
      "text": " That's the humility."
    },
    {
      "id": 48,
      "start": 189.74000549316406,
      "end": 193.5399932861328,
      "text": " But then he desired Philip to come up and to teach him."
    },
    {
      "id": 49,
      "start": 193.5399932861328,
      "end": 194.5399932861328,
      "text": " And what a blessing."
    },
    {
      "id": 50,
      "start": 194.5399932861328,
      "end": 198.3800048828125,
      "text": " When we think about that teachable spirit, we asked ourselves this question as we would"
    },
    {
      "id": 51,
      "start": 198.3800048828125,
      "end": 203.33999633789062,
      "text": " evaluate our own lives, do I have a teachable spirit?"
    },
    {
      "id": 52,
      "start": 203.33999633789062,
      "end": 205.6999969482422,
      "text": " Am I teachable?"
    },
    {
      "id": 53,
      "start": 205.6999969482422,
      "end": 210.72000122070312,
      "text": " Sometimes in life, we no doubt have had periods of time where we've sought to teach somebody"
    },
    {
      "id": 54,
      "start": 210.72000122070312,
      "end": 215.10000610351562,
      "text": " that wasn't teachable, or someone sought to teach us and we weren't teachable, and we"
    },
    {
      "id": 55,
      "start": 215.10000610351562,
      "end": 217.6999969482422,
      "text": " know how frustrating that can be."
    },
    {
      "id": 56,
      "start": 217.6999969482422,
      "end": 222.77999877929688,
      "text": " And what a blessing and what a great opportunity for us to be in a place where we have a teachable"
    },
    {
      "id": 57,
      "start": 222.77999877929688,
      "end": 224.24000549316406,
      "text": " spirit."
    },
    {
      "id": 58,
      "start": 224.24000549316406,
      "end": 230.0,
      "text": " This evening, as we continue to consider this subject matter of teach me, really, I've thought"
    },
    {
      "id": 59,
      "start": 230.0,
      "end": 231.9199981689453,
      "text": " about it from this perspective."
    },
    {
      "id": 60,
      "start": 231.9199981689453,
      "end": 237.1199951171875,
      "text": " When the psalmist says, teach me, when you and I adopt that desire and we make that same"
    },
    {
      "id": 61,
      "start": 237.1199951171875,
      "end": 241.32000732421875,
      "text": " plea to God, what is it that we desire to learn?"
    },
    {
      "id": 62,
      "start": 241.32000732421875,
      "end": 244.6999969482422,
      "text": " Lord, teach me, but teach me what?"
    },
    {
      "id": 63,
      "start": 244.6999969482422,
      "end": 247.9199981689453,
      "text": " What is it that we should desire to learn?"
    },
    {
      "id": 64,
      "start": 247.9199981689453,
      "end": 252.0800018310547,
      "text": " And as we think about this, if you're taking notes, I've simply titled the lesson that"
    },
    {
      "id": 65,
      "start": 252.32000732421875,
      "end": 254.75999450683594,
      "text": " what should I desire to learn?"
    },
    {
      "id": 66,
      "start": 254.75999450683594,
      "end": 255.9600067138672,
      "text": " And you think about this."
    },
    {
      "id": 67,
      "start": 255.9600067138672,
      "end": 259.6400146484375,
      "text": " Someone came to me recently, and it's kind of an interesting conversation, and it really"
    },
    {
      "id": 68,
      "start": 259.6400146484375,
      "end": 264.2200012207031,
      "text": " kind of was something that God brought back to my mind as I was preparing for the lesson"
    },
    {
      "id": 69,
      "start": 264.2200012207031,
      "end": 265.5199890136719,
      "text": " this evening."
    },
    {
      "id": 70,
      "start": 265.5199890136719,
      "end": 270.3599853515625,
      "text": " Someone came to me recently and said, would you teach me how to be a pastor?"
    },
    {
      "id": 71,
      "start": 270.3599853515625,
      "end": 273.760009765625,
      "text": " Okay, what do you mean by that?"
    },
    {
      "id": 72,
      "start": 273.760009765625,
      "end": 278.44000244140625,
      "text": " What aspect of pastoring are you interested in learning?"
    },
    {
      "id": 73,
      "start": 278.44000244140625,
      "end": 281.20001220703125,
      "text": " Are you interested in the public aspect of pastoring?"
    },
    {
      "id": 74,
      "start": 281.32000732421875,
      "end": 284.3599853515625,
      "text": " Are you interested in the private aspect of pastoring?"
    },
    {
      "id": 75,
      "start": 284.3599853515625,
      "end": 287.2799987792969,
      "text": " You're interested in knowing how to interact with people?"
    },
    {
      "id": 76,
      "start": 287.2799987792969,
      "end": 289.1600036621094,
      "text": " Are you interested in knowing how to develop sermons?"
    },
    {
      "id": 77,
      "start": 289.1600036621094,
      "end": 293.32000732421875,
      "text": " Are you interested in knowing how to deal with the administration part of being a pastor?"
    },
    {
      "id": 78,
      "start": 293.32000732421875,
      "end": 298.760009765625,
      "text": " There's so many different aspects, and so in order for me to understand the request,"
    },
    {
      "id": 79,
      "start": 298.760009765625,
      "end": 304.7200012207031,
      "text": " I had to have a little bit more of information to understand what they meant by that question,"
    },
    {
      "id": 80,
      "start": 304.7200012207031,
      "end": 306.79998779296875,
      "text": " by that inquiry."
    },
    {
      "id": 81,
      "start": 306.79998779296875,
      "end": 310.8800048828125,
      "text": " When I say, Lord, teach me, what is it that I want them to teach me?"
    },
    {
      "id": 82,
      "start": 311.3599853515625,
      "end": 315.1600036621094,
      "text": " Notice in Psalm 27 and in verse number 11, and really this evening we're using this as"
    },
    {
      "id": 83,
      "start": 315.1600036621094,
      "end": 316.1600036621094,
      "text": " a springboard."
    },
    {
      "id": 84,
      "start": 316.1600036621094,
      "end": 317.239990234375,
      "text": " I mentioned that already."
    },
    {
      "id": 85,
      "start": 317.239990234375,
      "end": 320.8800048828125,
      "text": " If you are taking notes, I want you to consider some recorded requests."
    },
    {
      "id": 86,
      "start": 320.8800048828125,
      "end": 326.8800048828125,
      "text": " God gives us in His Word some recorded requests, some things that the psalmist specifically"
    },
    {
      "id": 87,
      "start": 326.8800048828125,
      "end": 328.79998779296875,
      "text": " says, Lord, teach me this."
    },
    {
      "id": 88,
      "start": 328.79998779296875,
      "end": 332.1199951171875,
      "text": " We'll look at a couple of other examples within the scriptures."
    },
    {
      "id": 89,
      "start": 332.1199951171875,
      "end": 335.9599914550781,
      "text": " So look at this one in Psalm 27 and verse number 11."
    },
    {
      "id": 90,
      "start": 335.9599914550781,
      "end": 344.7200012207031,
      "text": " Teach me Thy way, O Lord, and lead me in a plain path because of mine enemies."
    },
    {
      "id": 91,
      "start": 344.7200012207031,
      "end": 348.79998779296875,
      "text": " Oh, man, I need to know the way that God has for me, amen?"
    },
    {
      "id": 92,
      "start": 348.79998779296875,
      "end": 354.4800109863281,
      "text": " And the plan, the path that God has laid before us, in fact, in Psalm 25 and verse number"
    },
    {
      "id": 93,
      "start": 354.4800109863281,
      "end": 359.6400146484375,
      "text": " 4, he uses that phraseology that God would teach him, Thy paths."
    },
    {
      "id": 94,
      "start": 359.6400146484375,
      "end": 367.239990234375,
      "text": " He says in Psalm 25 and verse number 4, show me Thy ways, O Lord, teach me Thy paths."
    },
    {
      "id": 95,
      "start": 367.239990234375,
      "end": 372.239990234375,
      "text": " I'm so thankful that God provides leadership and direction in the lives of His children."
    },
    {
      "id": 96,
      "start": 372.239990234375,
      "end": 375.7200012207031,
      "text": " We understand in the Old Testament, you think about the wilderness wanderings."
    },
    {
      "id": 97,
      "start": 375.7200012207031,
      "end": 380.67999267578125,
      "text": " They had the pillar of cloud by day and the pillar of fire by night, and how it provided"
    },
    {
      "id": 98,
      "start": 380.67999267578125,
      "end": 386.0,
      "text": " direction for the people of God as they wandered, and when the pillar of cloud or the pillar"
    },
    {
      "id": 99,
      "start": 386.0,
      "end": 388.9800109863281,
      "text": " of fire stopped, they stopped, and that's where they set up camp."
    },
    {
      "id": 100,
      "start": 389.32000732421875,
      "end": 394.1400146484375,
      "text": " And then, as the pillar moved, indicating the presence of God moving, they would follow."
    },
    {
      "id": 101,
      "start": 394.1400146484375,
      "end": 399.1400146484375,
      "text": " And today, we have the Word of God, we have the Spirit of God, and we say to God, teach"
    },
    {
      "id": 102,
      "start": 399.1400146484375,
      "end": 405.0799865722656,
      "text": " me Thy way, teach me Thy paths, show me the ways in which I ought to go."
    },
    {
      "id": 103,
      "start": 405.0799865722656,
      "end": 410.739990234375,
      "text": " We find that this is one of these recorded requests that we find within the Word of God."
    },
    {
      "id": 104,
      "start": 410.739990234375,
      "end": 416.17999267578125,
      "text": " The psalmist says in Psalm 119 a number of times, we'll just look at one of the references,"
    },
    {
      "id": 105,
      "start": 416.4200134277344,
      "end": 421.82000732421875,
      "text": " but there's a number of times in Psalm 119, six times actually, that the psalmist says,"
    },
    {
      "id": 106,
      "start": 421.82000732421875,
      "end": 423.5400085449219,
      "text": " teach me Thy statutes."
    },
    {
      "id": 107,
      "start": 423.5400085449219,
      "end": 429.3399963378906,
      "text": " We know that Psalm 119 is a psalm that is dedicated to the Word of God, and much information"
    },
    {
      "id": 108,
      "start": 429.3399963378906,
      "end": 434.94000244140625,
      "text": " given with regard to the love that the psalmist has for the Word of God, the place that the"
    },
    {
      "id": 109,
      "start": 434.94000244140625,
      "end": 439.5799865722656,
      "text": " Word of God has in the life of the psalmist, what the Word of God does for the psalmist."
    },
    {
      "id": 110,
      "start": 439.5799865722656,
      "end": 443.6199951171875,
      "text": " And we could study through the portion of Scripture and be helped immensely, but we"
    },
    {
      "id": 111,
      "start": 443.6199951171875,
      "end": 448.05999755859375,
      "text": " find that in verse number 26, the Bible says this, it says in verse number 12 as well,"
    },
    {
      "id": 112,
      "start": 448.05999755859375,
      "end": 453.8599853515625,
      "text": " but look in verse number 26, I have declared my ways and thou heardest me, teach me thy"
    },
    {
      "id": 113,
      "start": 453.8599853515625,
      "end": 454.8599853515625,
      "text": " statutes."
    },
    {
      "id": 114,
      "start": 454.8599853515625,
      "end": 460.3800048828125,
      "text": " As we look through Psalm 119, we find that the psalmist uses the word thy statutes, or"
    },
    {
      "id": 115,
      "start": 460.3800048828125,
      "end": 469.7799987792969,
      "text": " the phrase, thy statutes, thy word, thy judgments, he uses these phraseologies, thy law, to refer"
    },
    {
      "id": 116,
      "start": 469.7799987792969,
      "end": 471.9800109863281,
      "text": " to the Word of God."
    },
    {
      "id": 117,
      "start": 471.9800109863281,
      "end": 476.1400146484375,
      "text": " What a great request, Lord, teach me this book, teach me thy word."
    },
    {
      "id": 118,
      "start": 476.1400146484375,
      "end": 478.7799987792969,
      "text": " I want to have an understanding."
    },
    {
      "id": 119,
      "start": 478.7799987792969,
      "end": 484.0,
      "text": " He says this in verse number 18, open thou mine eyes, that I may behold wondrous things"
    },
    {
      "id": 120,
      "start": 484.0,
      "end": 485.0,
      "text": " out of thy law."
    },
    {
      "id": 121,
      "start": 485.0,
      "end": 489.70001220703125,
      "text": " What a great prayer, what a great request to learn the Word of God."
    },
    {
      "id": 122,
      "start": 489.70001220703125,
      "end": 495.1400146484375,
      "text": " In Psalm 119, in verse number 66, notice the psalmist makes this request as we consider"
    },
    {
      "id": 123,
      "start": 495.1400146484375,
      "end": 501.6600036621094,
      "text": " these recorded requests, he says, teach me good judgment and knowledge, for I have believed"
    },
    {
      "id": 124,
      "start": 501.6600036621094,
      "end": 503.5,
      "text": " thy commandments."
    },
    {
      "id": 125,
      "start": 503.5,
      "end": 508.2200012207031,
      "text": " Good judgment and knowledge is the request that is mentioned by the psalmist here in"
    },
    {
      "id": 126,
      "start": 508.2200012207031,
      "end": 509.5,
      "text": " verse number 66."
    },
    {
      "id": 127,
      "start": 509.5,
      "end": 516.780029296875,
      "text": " I think about the situation there with Solomon, when God appeared to Solomon, and He said"
    },
    {
      "id": 128,
      "start": 516.780029296875,
      "end": 520.780029296875,
      "text": " to Solomon, ask what I shall give thee, and what did Solomon request?"
    },
    {
      "id": 129,
      "start": 520.780029296875,
      "end": 521.780029296875,
      "text": " Wisdom."
    },
    {
      "id": 130,
      "start": 521.780029296875,
      "end": 522.780029296875,
      "text": " Wisdom."
    },
    {
      "id": 131,
      "start": 522.780029296875,
      "end": 527.6599731445312,
      "text": " God, give me wisdom to lead this great people, your people."
    },
    {
      "id": 132,
      "start": 527.6599731445312,
      "end": 529.2999877929688,
      "text": " Give me wisdom."
    },
    {
      "id": 133,
      "start": 529.4600219726562,
      "end": 532.4199829101562,
      "text": " The Word of God tells us that God granted that request."
    },
    {
      "id": 134,
      "start": 532.4199829101562,
      "end": 537.6599731445312,
      "text": " God gave Solomon wisdom, in fact, he's the wisest man according to the Scriptures, and"
    },
    {
      "id": 135,
      "start": 537.6599731445312,
      "end": 540.5,
      "text": " we find that that request was granted."
    },
    {
      "id": 136,
      "start": 540.5,
      "end": 547.8200073242188,
      "text": " In Psalm 143, notice if you turn over several chapters, in Psalm 143, the Word of God tells"
    },
    {
      "id": 137,
      "start": 547.8200073242188,
      "end": 553.0999755859375,
      "text": " us in verse number 10 that there's another recorded request here, and what a blessing"
    },
    {
      "id": 138,
      "start": 553.0999755859375,
      "end": 557.8599853515625,
      "text": " as we think about this truth, as we would ask the Lord to teach us His ways and His"
    },
    {
      "id": 139,
      "start": 557.8599853515625,
      "end": 562.9000244140625,
      "text": " path, His statutes, we find here that the Bible says this in Psalm 143 in verse number"
    },
    {
      "id": 140,
      "start": 562.9000244140625,
      "end": 567.780029296875,
      "text": " 10, teach me to do thy will."
    },
    {
      "id": 141,
      "start": 567.780029296875,
      "end": 572.5,
      "text": " For thou art my God, thy spirit is good, lead me into the land of uprightness."
    },
    {
      "id": 142,
      "start": 572.5,
      "end": 574.8599853515625,
      "text": " Think about that, teach me to do thy will."
    },
    {
      "id": 143,
      "start": 574.8599853515625,
      "end": 579.1599731445312,
      "text": " You know, the reality is that we can know something but not do it."
    },
    {
      "id": 144,
      "start": 579.1599731445312,
      "end": 582.780029296875,
      "text": " We can have an understanding of something but not apply it."
    },
    {
      "id": 145,
      "start": 582.780029296875,
      "end": 589.780029296875,
      "text": " And here, the psalmist, the request of David in Psalm 143 is teach me to do thy will."
    },
    {
      "id": 146,
      "start": 589.780029296875,
      "end": 595.02001953125,
      "text": " Yes, God, reveal Your will to me, reveal Your plan to me, but teach me to do it."
    },
    {
      "id": 147,
      "start": 595.02001953125,
      "end": 596.3400268554688,
      "text": " Not just to know it."
    },
    {
      "id": 148,
      "start": 596.3400268554688,
      "end": 599.9000244140625,
      "text": " What a sad thing to know what God wants us to do but then sit on the sidelines and not"
    },
    {
      "id": 149,
      "start": 599.9000244140625,
      "end": 599.9000244140625,
      "text": ""
    },
    {
      "id": 0,
      "start": 599.9000244140625,
      "end": 607.6600246429443,
      "text": " it, right? We're to do what He's given us to do. Think about this. We'll kind of, Psalm 90, if you"
    },
    {
      "id": 1,
      "start": 607.6600246429443,
      "end": 610.7800245285034,
      "text": " turn back, I know we're kind of going back and forth here, but I just want to share some of these"
    },
    {
      "id": 2,
      "start": 610.7800245285034,
      "end": 617.5800247192383,
      "text": " recorded requests, and perhaps we could adopt some of these for ourselves this evening. In Psalm 90"
    },
    {
      "id": 3,
      "start": 617.5800247192383,
      "end": 625.0200252532959,
      "text": " and verse number 12, this is a psalm that is attributed to Moses, and the Bible tells us this."
    },
    {
      "id": 4,
      "start": 625.0200252532959,
      "end": 629.0200252532959,
      "text": " It's a verse that we're familiar with, actually, Psalm 90 and verse number 12. Notice this,"
    },
    {
      "id": 5,
      "start": 629.0200252532959,
      "end": 636.9400253295898,
      "text": " so teach us what? Teach us to number our days. Teach us to number our days that we may apply our"
    },
    {
      "id": 6,
      "start": 636.9400253295898,
      "end": 645.4200248718262,
      "text": " hearts unto wisdom. Lord, teach us to number our days. Are we not keenly aware of the brevity of"
    },
    {
      "id": 7,
      "start": 645.4200248718262,
      "end": 650.700023651123,
      "text": " life? As we study the Word of God, as we study the Scriptures, we understand the Bible tells us"
    },
    {
      "id": 8,
      "start": 650.700023651123,
      "end": 655.0200233459473,
      "text": " that our life is but a vapor that appears for a little time and then vanisheth away."
    },
    {
      "id": 9,
      "start": 655.0200233459473,
      "end": 660.6200256347656,
      "text": " And the reality is that we ought to pray and ask God to teach us, as the psalm tells us in Psalm 90"
    },
    {
      "id": 10,
      "start": 660.6200256347656,
      "end": 666.5400238037109,
      "text": " and verse number 12, teach us, Lord, to number our days. Help us that we may apply our hearts"
    },
    {
      "id": 11,
      "start": 666.5400238037109,
      "end": 673.5000228881836,
      "text": " unto wisdom. The New Testament tells us that we're to redeem the time and that we are stewards of"
    },
    {
      "id": 12,
      "start": 673.5000228881836,
      "end": 680.7000274658203,
      "text": " that which God has blessed us with. I think about the request that is made in Judges chapter number"
    },
    {
      "id": 13,
      "start": 680.7000274658203,
      "end": 690.2200241088867,
      "text": " 13, and this is a request that is made, and a request that every parent ought to make. And"
    },
    {
      "id": 14,
      "start": 690.2200241088867,
      "end": 697.5000228881836,
      "text": " here in this passage of Scripture, we find that the angel of God had appeared and had let the"
    },
    {
      "id": 15,
      "start": 697.5000228881836,
      "end": 703.1800231933594,
      "text": " couple know that they were going to have a child, and Manoah wasn't there, but then he's"
    },
    {
      "id": 16,
      "start": 703.1800231933594,
      "end": 709.9000244140625,
      "text": " there. And the Bible tells us in Judges 13 and verse number 8, notice the request at the end of"
    },
    {
      "id": 17,
      "start": 709.9000244140625,
      "end": 715.9000244140625,
      "text": " the verse, it says, then Manoah entreated the Lord and said, O my Lord, let the man of God,"
    },
    {
      "id": 18,
      "start": 715.9000244140625,
      "end": 722.3000259399414,
      "text": " which thou didst send, come again unto us, notice this, and teach us what we shall do unto the child"
    },
    {
      "id": 19,
      "start": 722.3000259399414,
      "end": 730.3000183105469,
      "text": " that shall be born. I remember when Holly told me that she was expecting Juliana, and I remember"
    },
    {
      "id": 20,
      "start": 730.3000183105469,
      "end": 738.0600280761719,
      "text": " that thought that overcame me of, am I ready to be a father? Am I ready for this role that now"
    },
    {
      "id": 21,
      "start": 738.8600311279297,
      "end": 745.7400207519531,
      "text": " I have to fulfill? And I was very much aware of the fact that I needed God to help me to understand"
    },
    {
      "id": 22,
      "start": 745.7400207519531,
      "end": 751.5800170898438,
      "text": " how to parent and what to do, and Manoah makes this great request. We're familiar with the"
    },
    {
      "id": 23,
      "start": 751.5800170898438,
      "end": 757.1000213623047,
      "text": " request of the disciples in Luke chapter number 11. We won't turn there for sake of time,"
    },
    {
      "id": 24,
      "start": 757.7400207519531,
      "end": 763.02001953125,
      "text": " but in Luke chapter number 11, the disciples come to the Lord Jesus Christ, and they say, Lord,"
    },
    {
      "id": 25,
      "start": 763.8200225830078,
      "end": 771.1800231933594,
      "text": " teach us to pray. Teach us to pray. That's a good request, is it not? Teach us to pray."
    },
    {
      "id": 26,
      "start": 771.9000244140625,
      "end": 777.8200225830078,
      "text": " I did a series on that on Wednesday evenings last year, and I said this when we had that series,"
    },
    {
      "id": 27,
      "start": 777.8200225830078,
      "end": 781.5800170898438,
      "text": " that of all the things the disciples could have asked the Lord to teach them,"
    },
    {
      "id": 28,
      "start": 782.2200317382812,
      "end": 786.3800201416016,
      "text": " the only thing that we have recorded within the Word of God that they requested was teach us"
    },
    {
      "id": 29,
      "start": 786.9400177001953,
      "end": 793.9800262451172,
      "text": " to pray. Teach us to pray. And oh, that God would teach us to pray. Teach us to pray."
    },
    {
      "id": 30,
      "start": 793.9800262451172,
      "end": 798.3800201416016,
      "text": " So, we think about some of these recorded requests, and I would encourage you to do"
    },
    {
      "id": 31,
      "start": 798.3800201416016,
      "end": 804.2200317382812,
      "text": " some Bible study and to consider some other portions of Scripture that we see where the"
    },
    {
      "id": 32,
      "start": 804.2200317382812,
      "end": 810.1400299072266,
      "text": " people of God prayed and asked God specifically, teach me this. It's important that we would have"
    },
    {
      "id": 33,
      "start": 810.1400299072266,
      "end": 815.02001953125,
      "text": " that teachable spirit. It's important that we desire to be taught, that we might learn the"
    },
    {
      "id": 34,
      "start": 815.02001953125,
      "end": 822.5400238037109,
      "text": " Word of God, learn the truths of God, but the reality is that when we put some specific nature"
    },
    {
      "id": 35,
      "start": 822.5400238037109,
      "end": 827.5800170898438,
      "text": " to that request, it helps us to go into a particular area. So, we think about these"
    },
    {
      "id": 36,
      "start": 827.5800170898438,
      "end": 832.1400299072266,
      "text": " recorded requests, perhaps this evening, if you're taking notes number two, I want you to consider"
    },
    {
      "id": 37,
      "start": 832.1400299072266,
      "end": 836.3000183105469,
      "text": " some relevant recommendations. I'm going to give you some recommendations this evening"
    },
    {
      "id": 38,
      "start": 836.3000183105469,
      "end": 842.5400238037109,
      "text": " as to what it is that we should say, Lord, teach me. Teach me. Teach me what? What is it that you"
    },
    {
      "id": 39,
      "start": 842.5400238037109,
      "end": 847.7400207519531,
      "text": " want me to teach you? Someone comes to you and says, they've observed you and say, would you teach me?"
    },
    {
      "id": 40,
      "start": 847.7400207519531,
      "end": 851.6600189208984,
      "text": " What are you going to say? What do you want me to teach you, right? What is it that you would like"
    },
    {
      "id": 41,
      "start": 851.6600189208984,
      "end": 855.8200225830078,
      "text": " to learn? What is it that you'd like for me to teach you? Now, someone comes to me and asks me"
    },
    {
      "id": 42,
      "start": 855.8200225830078,
      "end": 860.3000183105469,
      "text": " to teach them certain things. I'm not capable of teaching certain things because I don't know how"
    },
    {
      "id": 43,
      "start": 860.3000183105469,
      "end": 865.6600341796875,
      "text": " to do them, but we know that we serve the Lord God Almighty. He's given us this precious book,"
    },
    {
      "id": 44,
      "start": 865.6600341796875,
      "end": 871.3400268554688,
      "text": " and He's able to teach us. Let me give you this recommendation. Number one, we should desire that"
    },
    {
      "id": 45,
      "start": 871.3400268554688,
      "end": 878.2200317382812,
      "text": " God would teach us who He is, who He is. You know, today we live in a society in which many people"
    },
    {
      "id": 46,
      "start": 878.2200317382812,
      "end": 884.0600280761719,
      "text": " have a misunderstanding of who God is. They do not understand the God of the Bible. They do not know"
    },
    {
      "id": 47,
      "start": 884.0600280761719,
      "end": 888.9400329589844,
      "text": " His nature nor His character. There are people that sit within churches all across this land"
    },
    {
      "id": 48,
      "start": 888.9400329589844,
      "end": 895.8200378417969,
      "text": " that do not know the God of the Bible. They've allowed for the culture. They've allowed for"
    },
    {
      "id": 49,
      "start": 895.8200378417969,
      "end": 901.8200378417969,
      "text": " Hollywood. They've allowed for politics. They've allowed for all sorts of people to influence them"
    },
    {
      "id": 50,
      "start": 901.8200378417969,
      "end": 907.6600341796875,
      "text": " with regard to who God is. But God's given us this precious book, and He has revealed to us His"
    },
    {
      "id": 51,
      "start": 907.6600341796875,
      "end": 913.8200378417969,
      "text": " nature, and He's revealed to us who He is. Paul said this, probably from our perspective, one of"
    },
    {
      "id": 52,
      "start": 913.8200378417969,
      "end": 918.8600158691406,
      "text": " the greatest Christians that ever walked upon the face of the earth. He said that I may know Him."
    },
    {
      "id": 53,
      "start": 918.8600158691406,
      "end": 923.7400207519531,
      "text": " Now, think about that. In Philippians 3 and verse number 10, he's in prison awaiting his execution,"
    },
    {
      "id": 54,
      "start": 923.7400207519531,
      "end": 929.9800109863281,
      "text": " and he says that I may know Him. He wants to know God in a greater way. He wants to know God in a"
    },
    {
      "id": 55,
      "start": 929.9800109863281,
      "end": 936.1400146484375,
      "text": " more intimate way. And when we understand this tonight, what an important aspect that we'd say,"
    },
    {
      "id": 56,
      "start": 936.1400146484375,
      "end": 943.3400268554688,
      "text": " Lord, teach me who You are. Teach me Your attributes. Teach me Your nature. Because the reality is that"
    },
    {
      "id": 57,
      "start": 943.3400268554688,
      "end": 950.8600158691406,
      "text": " when we understand in a greater way who our God is, it increases our faith. It helps us to trust Him."
    },
    {
      "id": 58,
      "start": 950.8600158691406,
      "end": 957.260009765625,
      "text": " It helps us to walk in obedience to Him. Why? Because we know who He is. When we begin to go to"
    },
    {
      "id": 59,
      "start": 957.260009765625,
      "end": 962.780029296875,
      "text": " the Word of God, and we begin to seek the Word of God with regard to some of these other areas in"
    },
    {
      "id": 60,
      "start": 962.780029296875,
      "end": 969.260009765625,
      "text": " which I'll mention this evening, the reality is if we don't first know who God is, it can trouble"
    },
    {
      "id": 61,
      "start": 970.1400146484375,
      "end": 976.0600280761719,
      "text": " the findings that we discover with regard to other areas of our lives, with regard to pleasing Him,"
    },
    {
      "id": 62,
      "start": 976.0600280761719,
      "end": 982.1400146484375,
      "text": " because we do not understand how much He loves us and how He has our best interest in mind. See,"
    },
    {
      "id": 63,
      "start": 982.1400146484375,
      "end": 988.7000122070312,
      "text": " God knows us. God formed us. Let me say this. He knows what's best for us. Amen? You believe that"
    },
    {
      "id": 64,
      "start": 988.7000122070312,
      "end": 994.2200317382812,
      "text": " tonight? I believe that with all my heart. I sat across the table from someone a few years ago,"
    },
    {
      "id": 65,
      "start": 994.2200317382812,
      "end": 998.8600158691406,
      "text": " and they said, well, preacher, let me just tell you this. God wants me to be happy."
    },
    {
      "id": 66,
      "start": 998.8600158691406,
      "end": 1010.8600158691406,
      "text": " And then they said this, and this makes me happy. Well, I got a whole bucket load of verses that"
    },
    {
      "id": 67,
      "start": 1010.8600158691406,
      "end": 1018.1400146484375,
      "text": " teach us that we're not supposed to do this, and so this can't be in connection with what you"
    },
    {
      "id": 68,
      "start": 1018.1400146484375,
      "end": 1022.6200256347656,
      "text": " understand. Here's the problem with that individual. They didn't understand the love of God."
    },
    {
      "id": 69,
      "start": 1022.6200256347656,
      "end": 1029.6600341796875,
      "text": " They didn't understand who God was. They had this misconception that God loves me and God wants me"
    },
    {
      "id": 70,
      "start": 1029.6600341796875,
      "end": 1036.2200317382812,
      "text": " to be happy, and so therefore, if this behavior or this activity makes me happy, then by default,"
    },
    {
      "id": 71,
      "start": 1036.2200317382812,
      "end": 1045.260009765625,
      "text": " God must be okay with it. It's not the truth of God's Word. Amen? And when we understand who God"
    },
    {
      "id": 72,
      "start": 1045.260009765625,
      "end": 1052.3800354003906,
      "text": " is and we understand that God as the Creator has given us truth that will help us know how we're"
    },
    {
      "id": 73,
      "start": 1052.3800354003906,
      "end": 1057.9000244140625,
      "text": " to live our lives and how we can please Him, and when we come to those portions and passages of"
    },
    {
      "id": 74,
      "start": 1057.9000244140625,
      "end": 1063.9000244140625,
      "text": " Scripture that God is giving us that instruction, when we have that understanding of who He is and"
    },
    {
      "id": 75,
      "start": 1063.9000244140625,
      "end": 1070.3000183105469,
      "text": " how much He loves us, it helps us to submit to it and to learn what He's trying to teach us."
    },
    {
      "id": 76,
      "start": 1070.3000183105469,
      "end": 1075.260009765625,
      "text": " And so first, we ought to pray that God would teach us who He is. As I've mentioned before,"
    },
    {
      "id": 77,
      "start": 1075.9000244140625,
      "end": 1080.5400390625,
      "text": " many of us have some understanding of who God is, but can I tell you this? His greatness is"
    },
    {
      "id": 78,
      "start": 1080.5400390625,
      "end": 1086.3800354003906,
      "text": " unsearchable, according to Psalm 145. I'll stand with anyone and say, I know that the Lord is great."
    },
    {
      "id": 79,
      "start": 1086.3800354003906,
      "end": 1091.260009765625,
      "text": " He is. He's a great God. He's revealed His greatness to me. I stand in awe of who He is,"
    },
    {
      "id": 80,
      "start": 1091.9800109863281,
      "end": 1095.9800109863281,
      "text": " but I'd say this, I only scratch the surface of understanding the infinite God."
    },
    {
      "id": 81,
      "start": 1096.8600158691406,
      "end": 1104.3000183105469,
      "text": " My finite mind cannot fully comprehend the infinite God, and neither can yours. Amen? So,"
    },
    {
      "id": 82,
      "start": 1104.3000183105469,
      "end": 1110.4600219726562,
      "text": " we ought to daily say, Lord, teach me who You are. Help me to understand in a greater way"
    },
    {
      "id": 83,
      "start": 1111.4200134277344,
      "end": 1117.5,
      "text": " Your attributes and Your nature. Let me say this, when I ask God to teach us His plan,"
    },
    {
      "id": 84,
      "start": 1117.5,
      "end": 1123.260009765625,
      "text": " what is God's plan? We mentioned about the recorded request of Thy paths and Thy way,"
    },
    {
      "id": 85,
      "start": 1123.260009765625,
      "end": 1129.5800170898438,
      "text": " but I think about this, when we, as the people of God living in 2022, that we say, what is Your plan,"
    },
    {
      "id": 86,
      "start": 1129.5800170898438,
      "end": 1136.8600463867188,
      "text": " God? What is Your plan for today? We know that He has established the church. It is His"
    },
    {
      "id": 87,
      "start": 1136.8600463867188,
      "end": 1144.6199951171875,
      "text": " establishment. It is the organism that God has chosen to use in this period of history,"
    },
    {
      "id": 88,
      "start": 1144.6199951171875,
      "end": 1151.1000366210938,
      "text": " and the church is not man's idea. It's not the result of Constantine or anyone else. It is"
    },
    {
      "id": 89,
      "start": 1151.1000366210938,
      "end": 1159.1000366210938,
      "text": " God's plan. It is God's idea. And God is the head of the church, and He has a plan for His church."
    },
    {
      "id": 90,
      "start": 1159.1800537109375,
      "end": 1164.2200317382812,
      "text": " And so, we understand, we say, God, what is Your plan for today? What is Your plan for today with"
    },
    {
      "id": 91,
      "start": 1164.2200317382812,
      "end": 1172.0599975585938,
      "text": " the church? What is Your plan? God has given us in His Word His plan for reaching this world with"
    },
    {
      "id": 92,
      "start": 1172.0599975585938,
      "end": 1179.1800537109375,
      "text": " the gospel of Jesus Christ. So often, we neglect to just simply go to the Word of God and say,"
    },
    {
      "id": 93,
      "start": 1179.1800537109375,
      "end": 1184.8600463867188,
      "text": " okay, what is God's plan? Okay, here's what God's plan is. Let's do it, right? Remember the truth"
    },
    {
      "id": 94,
      "start": 1184.8600463867188,
      "end": 1190.300048828125,
      "text": " of Psalm 143 and verse number 10, teach me to do Thy will. Sometimes we like to just sit around"
    },
    {
      "id": 95,
      "start": 1190.300048828125,
      "end": 1194.4600219726562,
      "text": " and have seminars talking about what we already know needs to be done instead of just doing it."
    },
    {
      "id": 96,
      "start": 1196.1400146484375,
      "end": 1199.7400512695312,
      "text": " And I want to know what God's plan is for today."
    },
    {
      "id": 0,
      "start": 1199.7400512695312,
      "end": 1202.8200511932373,
      "text": " How about God's plan for the future?"
    },
    {
      "id": 1,
      "start": 1202.8200511932373,
      "end": 1205.460051059723,
      "text": " What's God's plan for the future?"
    },
    {
      "id": 2,
      "start": 1205.460051059723,
      "end": 1207.3000512123108,
      "text": " He's given us prophecy."
    },
    {
      "id": 3,
      "start": 1207.3000512123108,
      "end": 1210.340051651001,
      "text": " I'm thankful for the prophecy that He's given us."
    },
    {
      "id": 4,
      "start": 1210.340051651001,
      "end": 1216.5400505065918,
      "text": " We cannot neglect today for the purpose of studying prophecy, but there should be a balance."
    },
    {
      "id": 5,
      "start": 1216.5400505065918,
      "end": 1222.7400512695312,
      "text": " But as we study prophecy, it helps us to understand God's plan and what God's timeline is and"
    },
    {
      "id": 6,
      "start": 1222.7400512695312,
      "end": 1227.0200519561768,
      "text": " what His timetable is and what are the next events and what is it that's going to happen."
    },
    {
      "id": 7,
      "start": 1227.0200519561768,
      "end": 1231.9000511169434,
      "text": " And we think about that truth of prophecy, and I'm thankful that our God is Alpha and"
    },
    {
      "id": 8,
      "start": 1231.9000511169434,
      "end": 1238.260051727295,
      "text": " Omega, that He knows the end from the beginning, and that He can give us in this recorded book"
    },
    {
      "id": 9,
      "start": 1238.260051727295,
      "end": 1241.1000518798828,
      "text": " His plan for the ages."
    },
    {
      "id": 10,
      "start": 1241.1000518798828,
      "end": 1242.3400497436523,
      "text": " Amen?"
    },
    {
      "id": 11,
      "start": 1242.3400497436523,
      "end": 1243.980052947998,
      "text": " And what a blessing that is."
    },
    {
      "id": 12,
      "start": 1243.980052947998,
      "end": 1245.5800514221191,
      "text": " I say, God, I want to know your plan."
    },
    {
      "id": 13,
      "start": 1245.5800514221191,
      "end": 1247.980052947998,
      "text": " Let me say this."
    },
    {
      "id": 14,
      "start": 1247.980052947998,
      "end": 1252.7400512695312,
      "text": " If I think about this relevant request or recommendation, a relevant recommendation,"
    },
    {
      "id": 15,
      "start": 1252.7400512695312,
      "end": 1256.4600524902344,
      "text": " I would say not only knowing who God is and knowing what God's plan is, but let me say"
    },
    {
      "id": 16,
      "start": 1256.4600524902344,
      "end": 1257.4600524902344,
      "text": " this."
    },
    {
      "id": 17,
      "start": 1257.4600524902344,
      "end": 1259.9000511169434,
      "text": " What is my place within God's plan?"
    },
    {
      "id": 18,
      "start": 1259.9000511169434,
      "end": 1263.5800514221191,
      "text": " God, what is my place within your plan?"
    },
    {
      "id": 19,
      "start": 1263.5800514221191,
      "end": 1265.9000549316406,
      "text": " I understand, God, that you have a plan."
    },
    {
      "id": 20,
      "start": 1265.9000549316406,
      "end": 1270.820053100586,
      "text": " I understand that your plan is to use the local church, and God, I understand that I"
    },
    {
      "id": 21,
      "start": 1270.820053100586,
      "end": 1272.3800506591797,
      "text": " am part of the local church."
    },
    {
      "id": 22,
      "start": 1272.3800506591797,
      "end": 1274.4600524902344,
      "text": " What's your plan for me?"
    },
    {
      "id": 23,
      "start": 1274.4600524902344,
      "end": 1277.8600540161133,
      "text": " What is my place within your plan?"
    },
    {
      "id": 24,
      "start": 1277.8600540161133,
      "end": 1281.5000534057617,
      "text": " I believe tonight that we all have a place within God's plan."
    },
    {
      "id": 25,
      "start": 1281.5000534057617,
      "end": 1282.5000534057617,
      "text": " Amen?"
    },
    {
      "id": 26,
      "start": 1282.540054321289,
      "end": 1286.3800506591797,
      "text": " If God didn't have a place for you within His plan, you wouldn't be here still."
    },
    {
      "id": 27,
      "start": 1286.3800506591797,
      "end": 1287.3800506591797,
      "text": " Amen?"
    },
    {
      "id": 28,
      "start": 1287.3800506591797,
      "end": 1292.4600524902344,
      "text": " But if you're living and you're breathing, and you are, because you're here tonight,"
    },
    {
      "id": 29,
      "start": 1292.4600524902344,
      "end": 1297.5000534057617,
      "text": " the reality is that God has a place for you within His plan."
    },
    {
      "id": 30,
      "start": 1297.5000534057617,
      "end": 1299.300048828125,
      "text": " You say, well, I don't know what my place is."
    },
    {
      "id": 31,
      "start": 1299.300048828125,
      "end": 1305.540054321289,
      "text": " That's why we say, Lord, teach me your place, my place within your plan, and we ask God"
    },
    {
      "id": 32,
      "start": 1305.540054321289,
      "end": 1306.540054321289,
      "text": " to show us."
    },
    {
      "id": 33,
      "start": 1306.540054321289,
      "end": 1312.6200485229492,
      "text": " Listen, the Word of God teaches us in 1 Peter chapter number 4 that every man has received"
    },
    {
      "id": 34,
      "start": 1312.6200485229492,
      "end": 1314.4600524902344,
      "text": " a spiritual gift."
    },
    {
      "id": 35,
      "start": 1314.4600524902344,
      "end": 1316.3400497436523,
      "text": " The Bible teaches us the book of 1 Corinthians."
    },
    {
      "id": 36,
      "start": 1316.3400497436523,
      "end": 1320.800048828125,
      "text": " If you look through chapters really 12 through 15 and look at those portions of Scripture,"
    },
    {
      "id": 37,
      "start": 1320.800048828125,
      "end": 1326.9000549316406,
      "text": " you find that the Word of God teaches us that the Spirit equips and gifts every believer"
    },
    {
      "id": 38,
      "start": 1326.9000549316406,
      "end": 1328.4800567626953,
      "text": " as He will."
    },
    {
      "id": 39,
      "start": 1328.4800567626953,
      "end": 1335.1600494384766,
      "text": " And the Bible tells us that He equips us spiritually for the purpose of edification, for the purpose"
    },
    {
      "id": 40,
      "start": 1335.1600494384766,
      "end": 1336.6600494384766,
      "text": " of the church."
    },
    {
      "id": 41,
      "start": 1336.6600494384766,
      "end": 1343.1200561523438,
      "text": " The Word of God likens the church to a body, and every member is of importance."
    },
    {
      "id": 42,
      "start": 1343.1200561523438,
      "end": 1346.4800567626953,
      "text": " I'm thankful that I have a left hand and a right hand."
    },
    {
      "id": 43,
      "start": 1346.4800567626953,
      "end": 1349.4800567626953,
      "text": " I'm thankful that I have a thumb on each of my hands."
    },
    {
      "id": 44,
      "start": 1349.4800567626953,
      "end": 1351.5200500488281,
      "text": " I'm thankful that I got ears and eyes."
    },
    {
      "id": 45,
      "start": 1351.5200500488281,
      "end": 1355.9200439453125,
      "text": " It'd be a terrible thing if we had four eyes or four ears and none of the other, right?"
    },
    {
      "id": 46,
      "start": 1355.9200439453125,
      "end": 1360.56005859375,
      "text": " I mean, you think about the truth, and here's the reality when you look at what Paul says"
    },
    {
      "id": 47,
      "start": 1360.56005859375,
      "end": 1362.0000457763672,
      "text": " to the believers in Corinth."
    },
    {
      "id": 48,
      "start": 1362.0000457763672,
      "end": 1367.040054321289,
      "text": " He says, listen, the eye can't say to the...and you understand what he's saying, listen, I'm"
    },
    {
      "id": 49,
      "start": 1367.040054321289,
      "end": 1368.56005859375,
      "text": " of more importance than you are."
    },
    {
      "id": 50,
      "start": 1368.56005859375,
      "end": 1372.7600555419922,
      "text": " No, every member has its purpose and its place."
    },
    {
      "id": 51,
      "start": 1372.7600555419922,
      "end": 1380.7200469970703,
      "text": " And God has uniquely designed the human body, but He's also uniquely designed the church,"
    },
    {
      "id": 52,
      "start": 1380.7200469970703,
      "end": 1382.7200469970703,
      "text": " and He builds His church."
    },
    {
      "id": 53,
      "start": 1382.7200469970703,
      "end": 1385.4400482177734,
      "text": " You remember Bezalel in the Old Testament?"
    },
    {
      "id": 54,
      "start": 1385.4400482177734,
      "end": 1391.9200439453125,
      "text": " Bezalel was the man that God particularly, specifically equipped, not only to perform"
    },
    {
      "id": 55,
      "start": 1391.9200439453125,
      "end": 1397.280044555664,
      "text": " the work of getting things ready for the tabernacle, but also to teach others."
    },
    {
      "id": 56,
      "start": 1397.280044555664,
      "end": 1401.9600524902344,
      "text": " It was Moses that received all of the instruction, the pattern that was to be followed, but it"
    },
    {
      "id": 57,
      "start": 1401.9600524902344,
      "end": 1408.06005859375,
      "text": " was Bezalel that God had specifically equipped for doing that work, Bezalel and Aholiab."
    },
    {
      "id": 58,
      "start": 1408.06005859375,
      "end": 1411.5200500488281,
      "text": " And you look at that, and you see what God did and how God blessed."
    },
    {
      "id": 59,
      "start": 1411.5200500488281,
      "end": 1414.9000549316406,
      "text": " You say, God, what is my place within your plan?"
    },
    {
      "id": 60,
      "start": 1414.9000549316406,
      "end": 1416.7600555419922,
      "text": " What is my involvement within the church?"
    },
    {
      "id": 61,
      "start": 1416.7600555419922,
      "end": 1423.3600463867188,
      "text": " The Bible tells us in Philippians 1, in verse number 27, that we are to strive together"
    },
    {
      "id": 62,
      "start": 1423.3600463867188,
      "end": 1425.9600524902344,
      "text": " for the faith of the gospel."
    },
    {
      "id": 63,
      "start": 1425.9600524902344,
      "end": 1426.9600524902344,
      "text": " Striving together."
    },
    {
      "id": 64,
      "start": 1426.9600524902344,
      "end": 1433.4800567626953,
      "text": " We understand that we are laborers, co-laborers, one with another, we're co-laborers with God."
    },
    {
      "id": 65,
      "start": 1433.4800567626953,
      "end": 1435.800048828125,
      "text": " Remember what Paul said?"
    },
    {
      "id": 66,
      "start": 1435.800048828125,
      "end": 1437.06005859375,
      "text": " He said, who then is Paul?"
    },
    {
      "id": 67,
      "start": 1437.06005859375,
      "end": 1439.5200500488281,
      "text": " Who is Apollos?"
    },
    {
      "id": 68,
      "start": 1439.5200500488281,
      "end": 1443.1200561523438,
      "text": " Some plant, some water, but God gives the increase."
    },
    {
      "id": 69,
      "start": 1443.1200561523438,
      "end": 1445.7200469970703,
      "text": " What is my place within the church?"
    },
    {
      "id": 70,
      "start": 1445.7200469970703,
      "end": 1448.7600555419922,
      "text": " What is my involvement in the local church?"
    },
    {
      "id": 71,
      "start": 1448.7600555419922,
      "end": 1452.280044555664,
      "text": " What is my involvement within the Great Commission?"
    },
    {
      "id": 72,
      "start": 1452.280044555664,
      "end": 1457.0400390625,
      "text": " If the Great Commission has been given, and God's Great Commission, His last words to"
    },
    {
      "id": 73,
      "start": 1457.0400390625,
      "end": 1463.1600646972656,
      "text": " the church remain our marching orders today, what part of fulfilling the Great Commission"
    },
    {
      "id": 74,
      "start": 1463.1600646972656,
      "end": 1465.4600524902344,
      "text": " am I fulfilling?"
    },
    {
      "id": 75,
      "start": 1465.4600524902344,
      "end": 1468.9600524902344,
      "text": " What involvement do I have in fulfilling the Great Commission?"
    },
    {
      "id": 76,
      "start": 1468.9600524902344,
      "end": 1474.5200500488281,
      "text": " If this is God's program, if this is God's plan, and God is teaching me what His plan"
    },
    {
      "id": 77,
      "start": 1474.5200500488281,
      "end": 1478.0400390625,
      "text": " is for today, I say, God, what's my place in that plan?"
    },
    {
      "id": 78,
      "start": 1478.0400390625,
      "end": 1481.800048828125,
      "text": " I want to be involved in what God's doing in the world, amen?"
    },
    {
      "id": 79,
      "start": 1481.800048828125,
      "end": 1484.3200378417969,
      "text": " And God chose that He uses people."
    },
    {
      "id": 80,
      "start": 1484.3200378417969,
      "end": 1487.2000427246094,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 81,
      "start": 1487.2000427246094,
      "end": 1492.5200500488281,
      "text": " He said, I'm going to use people, human beings, my children."
    },
    {
      "id": 82,
      "start": 1492.5200500488281,
      "end": 1494.2600402832031,
      "text": " I'm going to equip them."
    },
    {
      "id": 83,
      "start": 1494.2600402832031,
      "end": 1498.2800598144531,
      "text": " They are my workmanship created in Christ Jesus."
    },
    {
      "id": 84,
      "start": 1498.2800598144531,
      "end": 1503.3400573730469,
      "text": " I'm going to equip them, I'm going to enable them, and then I'm going to bless them for"
    },
    {
      "id": 85,
      "start": 1503.3400573730469,
      "end": 1506.0000610351562,
      "text": " doing what I've told them to do."
    },
    {
      "id": 86,
      "start": 1506.0000610351562,
      "end": 1508.7200622558594,
      "text": " That's a good deal, amen?"
    },
    {
      "id": 87,
      "start": 1508.7200622558594,
      "end": 1511.6400451660156,
      "text": " He equips us, He enables us, and then He blesses us."
    },
    {
      "id": 88,
      "start": 1511.6400451660156,
      "end": 1512.9600524902344,
      "text": " It's amazing."
    },
    {
      "id": 89,
      "start": 1512.9600524902344,
      "end": 1516.6000366210938,
      "text": " God, what's my place within Your plan?"
    },
    {
      "id": 90,
      "start": 1516.6000366210938,
      "end": 1519.8800659179688,
      "text": " Let me say this in closing this evening."
    },
    {
      "id": 91,
      "start": 1519.8800659179688,
      "end": 1526.2800598144531,
      "text": " I would say that we could pray and ask God to teach me, teach me how I can please Him."
    },
    {
      "id": 92,
      "start": 1526.2800598144531,
      "end": 1531.0000610351562,
      "text": " You know, 1 Corinthians chapter number 10 tells us of some Old Testament biblical accounts"
    },
    {
      "id": 93,
      "start": 1531.0000610351562,
      "end": 1536.2600402832031,
      "text": " where the Bible says that with many of them, God was not well-pleased."
    },
    {
      "id": 94,
      "start": 1536.2600402832031,
      "end": 1539.7600402832031,
      "text": " I do not desire that it would be said of my life, and I do not desire that it would be"
    },
    {
      "id": 95,
      "start": 1539.7600402832031,
      "end": 1544.0800476074219,
      "text": " said of your life, that God is not well-pleased, amen?"
    },
    {
      "id": 96,
      "start": 1544.0800476074219,
      "end": 1547.3600463867188,
      "text": " I want to please Him, I want to please Him."
    },
    {
      "id": 97,
      "start": 1547.3600463867188,
      "end": 1554.7600402832031,
      "text": " The first part of Proverbs 16 and verse number 7 says, when a man's ways please the Lord,"
    },
    {
      "id": 98,
      "start": 1554.7600402832031,
      "end": 1558.7600402832031,
      "text": " when a man's ways please the Lord."
    },
    {
      "id": 99,
      "start": 1558.7600402832031,
      "end": 1564.7600402832031,
      "text": " I want my ways to please God, but how am I going to know?"
    },
    {
      "id": 100,
      "start": 1564.7600402832031,
      "end": 1570.1200561523438,
      "text": " In the book of Ephesians in chapter 5 and verse number 10, God says this, as Paul is"
    },
    {
      "id": 101,
      "start": 1570.1200561523438,
      "end": 1575.9600524902344,
      "text": " writing to those believers in Ephesus, he says, proving what is acceptable unto the"
    },
    {
      "id": 102,
      "start": 1575.9600524902344,
      "end": 1576.9600524902344,
      "text": " Lord."
    },
    {
      "id": 103,
      "start": 1576.9600524902344,
      "end": 1580.9600524902344,
      "text": " Lord, teach me how to please You."
    },
    {
      "id": 104,
      "start": 1580.9600524902344,
      "end": 1586.1600646972656,
      "text": " Teach me how to live my life in such a way that it is pleasing in Your sight."
    },
    {
      "id": 105,
      "start": 1586.1600646972656,
      "end": 1591.6000366210938,
      "text": " That's a great prayer request, that's a great teach-me request, that's a, I believe, a relevant"
    },
    {
      "id": 106,
      "start": 1591.6000366210938,
      "end": 1596.2800598144531,
      "text": " recommendation that we take in our lives today, and we say, Lord, teach me how I can please"
    },
    {
      "id": 107,
      "start": 1596.2800598144531,
      "end": 1597.2800598144531,
      "text": " You."
    },
    {
      "id": 108,
      "start": 1597.2800598144531,
      "end": 1599.5200500488281,
      "text": " Can I say this, and I'm not going to look at any verses of Scripture, I'm just going"
    },
    {
      "id": 109,
      "start": 1599.5200500488281,
      "end": 1604.6400451660156,
      "text": " to go quickly through it this evening in closing, but the reality is that if you want to know"
    },
    {
      "id": 110,
      "start": 1604.6400451660156,
      "end": 1610.4000549316406,
      "text": " how to be a husband, go to this book, amen?"
    },
    {
      "id": 111,
      "start": 1610.4000549316406,
      "end": 1611.6800537109375,
      "text": " You want to know how to be a wife?"
    },
    {
      "id": 112,
      "start": 1611.6800537109375,
      "end": 1613.6000366210938,
      "text": " Go to this book."
    },
    {
      "id": 113,
      "start": 1613.6000366210938,
      "end": 1615.1600646972656,
      "text": " You want to know how to be a parent?"
    },
    {
      "id": 114,
      "start": 1615.1600646972656,
      "end": 1617.0800476074219,
      "text": " Go to this book."
    },
    {
      "id": 115,
      "start": 1617.0800476074219,
      "end": 1618.0800476074219,
      "text": " You want to know how to be a child?"
    },
    {
      "id": 116,
      "start": 1618.0800476074219,
      "end": 1621.5400390625,
      "text": " I know we don't have any children in here, but for our children, one of the first verses"
    },
    {
      "id": 117,
      "start": 1621.5400390625,
      "end": 1628.0400390625,
      "text": " we taught our children to memorize, children, obey your parents in the Lord, amen?"
    },
    {
      "id": 118,
      "start": 1628.0400390625,
      "end": 1629.0400390625,
      "text": " It's Bible."
    },
    {
      "id": 119,
      "start": 1629.0400390625,
      "end": 1630.800048828125,
      "text": " I'm trying to teach them, why?"
    },
    {
      "id": 120,
      "start": 1630.800048828125,
      "end": 1635.56005859375,
      "text": " Because when they please their parents, they're pleasing God, amen?"
    },
    {
      "id": 121,
      "start": 1635.56005859375,
      "end": 1637.3200378417969,
      "text": " Honor thy father and mother."
    },
    {
      "id": 122,
      "start": 1637.3200378417969,
      "end": 1640.9600524902344,
      "text": " Teach the first commandment with promise, amen?"
    },
    {
      "id": 123,
      "start": 1640.9600524902344,
      "end": 1642.3200378417969,
      "text": " So you want to know how to be a good child?"
    },
    {
      "id": 124,
      "start": 1642.3200378417969,
      "end": 1643.3200378417969,
      "text": " You better get in the book."
    },
    {
      "id": 125,
      "start": 1643.3200378417969,
      "end": 1644.7200622558594,
      "text": " You better get in the Word of God."
    },
    {
      "id": 126,
      "start": 1644.7200622558594,
      "end": 1645.7200622558594,
      "text": " Think about this."
    },
    {
      "id": 127,
      "start": 1645.7200622558594,
      "end": 1650.9600524902344,
      "text": " Personally, if I want to be a good pastor, the Word of God teaches me how to be a pastor."
    },
    {
      "id": 128,
      "start": 1650.9600524902344,
      "end": 1655.5200500488281,
      "text": " The Word of God teaches and talks about being a good minister, and it qualifies it."
    },
    {
      "id": 129,
      "start": 1655.5200500488281,
      "end": 1658.6400451660156,
      "text": " If you do this, then you're a good minister, all right?"
    },
    {
      "id": 130,
      "start": 1658.6400451660156,
      "end": 1659.6800537109375,
      "text": " I want to be a good pastor."
    },
    {
      "id": 131,
      "start": 1659.6800537109375,
      "end": 1662.1000366210938,
      "text": " I want to please God as a pastor."
    },
    {
      "id": 132,
      "start": 1662.1000366210938,
      "end": 1666.9200439453125,
      "text": " The place that He's called me within His plan, I want to be a good pastor."
    },
    {
      "id": 133,
      "start": 1667.5200500488281,
      "end": 1668.5200500488281,
      "text": " How do I do that?"
    },
    {
      "id": 134,
      "start": 1668.5200500488281,
      "end": 1669.5200500488281,
      "text": " Well, He says, feed the flock of God."
    },
    {
      "id": 135,
      "start": 1669.5200500488281,
      "end": 1673.0000610351562,
      "text": " Yes, sir, I'm going to do my best to feed the flock of God."
    },
    {
      "id": 136,
      "start": 1673.0000610351562,
      "end": 1677.9200439453125,
      "text": " I'm going to study and prepare and pray and seek to deliver to the best of my ability"
    },
    {
      "id": 137,
      "start": 1677.9200439453125,
      "end": 1680.6400451660156,
      "text": " and with God's help, the Word of God."
    },
    {
      "id": 138,
      "start": 1680.6400451660156,
      "end": 1681.6400451660156,
      "text": " Why?"
    },
    {
      "id": 139,
      "start": 1681.6400451660156,
      "end": 1682.6400451660156,
      "text": " Because that's my responsibility."
    },
    {
      "id": 140,
      "start": 1682.6400451660156,
      "end": 1686.4400634765625,
      "text": " You want to be a good church member?"
    },
    {
      "id": 141,
      "start": 1686.4400634765625,
      "end": 1691.6000366210938,
      "text": " The Word of God teaches us how to be a good church member."
    },
    {
      "id": 142,
      "start": 1691.6000366210938,
      "end": 1693.7600402832031,
      "text": " Titus chapter number 2, go through it."
    },
    {
      "id": 143,
      "start": 1693.7600402832031,
      "end": 1695.5200500488281,
      "text": " The aged men, they're supposed to do this."
    },
    {
      "id": 144,
      "start": 1695.5200500488281,
      "end": 1697.6000366210938,
      "text": " The aged women, they're supposed to do this."
    },
    {
      "id": 145,
      "start": 1697.6000366210938,
      "end": 1699.6400451660156,
      "text": " You look at God's Word teaches us."
    },
    {
      "id": 146,
      "start": 1699.6400451660156,
      "end": 1701.8800659179688,
      "text": " You want to be a good church member?"
    },
    {
      "id": 147,
      "start": 1701.8800659179688,
      "end": 1702.8800659179688,
      "text": " Go to the book."
    },
    {
      "id": 148,
      "start": 1702.8800659179688,
      "end": 1703.9600524902344,
      "text": " Go to the Word of God."
    },
    {
      "id": 149,
      "start": 1703.9600524902344,
      "end": 1706.3600463867188,
      "text": " God teach me to be a good church member."
    },
    {
      "id": 150,
      "start": 1706.3600463867188,
      "end": 1708.4000549316406,
      "text": " God teach me to be a good pastor."
    },
    {
      "id": 151,
      "start": 1708.4000549316406,
      "end": 1710.0800476074219,
      "text": " Teach me to be a good neighbor."
    },
    {
      "id": 152,
      "start": 1710.0800476074219,
      "end": 1714.4000244140625,
      "text": " Teach me to be a good friend, a co-worker, an employee, an employer."
    },
    {
      "id": 153,
      "start": 1714.4000244140625,
      "end": 1717.280029296875,
      "text": " All of these things are found within the Word of God."
    },
    {
      "id": 154,
      "start": 1717.280029296875,
      "end": 1720.6000366210938,
      "text": " God, I'm having a hard time at work."
    },
    {
      "id": 155,
      "start": 1720.6000366210938,
      "end": 1723.9200439453125,
      "text": " Teach me how to, right?"
    },
    {
      "id": 156,
      "start": 1723.9200439453125,
      "end": 1726.0000610351562,
      "text": " It works."
    },
    {
      "id": 157,
      "start": 1726.0000610351562,
      "end": 1731.5200805664062,
      "text": " And when we add some qualifiers, if you will, to this desire of teach me, and really that's"
    },
    {
      "id": 158,
      "start": 1731.5200805664062,
      "end": 1736.280029296875,
      "text": " my desire this evening, to help us just think of what is it that we're saying, Lord, teach"
    },
    {
      "id": 159,
      "start": 1736.280029296875,
      "end": 1737.56005859375,
      "text": " me."
    },
    {
      "id": 160,
      "start": 1737.56005859375,
      "end": 1741.9200439453125,
      "text": " We're going to look at over the next several weeks of how God teaches His children."
    },
    {
      "id": 161,
      "start": 1741.9200439453125,
      "end": 1745.280029296875,
      "text": " God uses a variety of classrooms."
    },
    {
      "id": 162,
      "start": 1745.280029296875,
      "end": 1749.9800415039062,
      "text": " And sometimes those classrooms aren't always easy, but God uses a variety of classrooms"
    },
    {
      "id": 163,
      "start": 1750.3600463867188,
      "end": 1751.7400512695312,
      "text": " to teach His children."
    },
    {
      "id": 164,
      "start": 1751.7400512695312,
      "end": 1756.3400268554688,
      "text": " And as He teaches us, that's why I've often said over the years that the reality is that"
    },
    {
      "id": 165,
      "start": 1756.3400268554688,
      "end": 1761.9000244140625,
      "text": " we need to be careful that we understand that God can always deliver us from everything"
    },
    {
      "id": 166,
      "start": 1761.9000244140625,
      "end": 1764.4800415039062,
      "text": " that we face."
    },
    {
      "id": 167,
      "start": 1764.4800415039062,
      "end": 1772.1000366210938,
      "text": " At times, however, God is more interested in developing us than in delivering us."
    },
    {
      "id": 168,
      "start": 1772.1000366210938,
      "end": 1774.8600463867188,
      "text": " It doesn't mean He can't deliver us."
    },
    {
      "id": 169,
      "start": 1774.8600463867188,
      "end": 1777.3800659179688,
      "text": " It just means He wants to develop us."
    },
    {
      "id": 170,
      "start": 1777.3800659179688,
      "end": 1781.4600219726562,
      "text": " And sometimes when we go through a trial and we go through a circumstance, an adversity,"
    },
    {
      "id": 171,
      "start": 1781.4600219726562,
      "end": 1786.820068359375,
      "text": " a problem in our lives, instead of us praying, God, deliver me from this, perhaps we should"
    },
    {
      "id": 172,
      "start": 1786.820068359375,
      "end": 1791.820068359375,
      "text": " pray, God, teach me what You want to teach me through this."
    },
    {
      "id": 173,
      "start": 1791.820068359375,
      "end": 1797.300048828125,
      "text": " Help me, Lord, to learn that even in this difficulty that You're real and that You have"
    },
    {
      "id": 174,
      "start": 1797.300048828125,
      "end": 1798.6600341796875,
      "text": " a plan."
    },
    {
      "id": 175,
      "start": 1798.6600341796875,
      "end": 1799.6600341796875,
      "text": " Teach me."
    },
    {
      "id": 176,
      "start": 1799.6600341796875,
      "end": 1799.6600341796875,
      "text": ""
    },
    {
      "id": 0,
      "start": 1799.6600341796875,
      "end": 1805.9800343513489,
      "text": " teaching us that His grace is sufficient, right? Is that what Paul said? He besought"
    },
    {
      "id": 1,
      "start": 1805.9800343513489,
      "end": 1811.9800338745117,
      "text": " the Lord thrice, and God said, Paul, my grace is sufficient for thee. Amen? God's grace"
    },
    {
      "id": 2,
      "start": 1811.9800338745117,
      "end": 1820.360034942627,
      "text": " is sufficient. We find this evening we could speak about a whole host of things, areas"
    },
    {
      "id": 3,
      "start": 1820.360034942627,
      "end": 1826.7000350952148,
      "text": " of our lives, but tonight I hope that as we would consider this thought, teach me, that"
    },
    {
      "id": 4,
      "start": 1826.7000350952148,
      "end": 1832.3800354003906,
      "text": " we would say, what are some things, what should I desire to learn? Teach me. Teach me what?"
    },
    {
      "id": 5,
      "start": 1832.3800354003906,
      "end": 1838.3800354003906,
      "text": " Lord, teach me who you are. I want to know you in a more intimate way. I want to know"
    },
    {
      "id": 6,
      "start": 1838.3800354003906,
      "end": 1845.300033569336,
      "text": " you in a greater way. I want to stand in awe of who you are. God, teach me what your plan"
    },
    {
      "id": 7,
      "start": 1845.300033569336,
      "end": 1855.3400344848633,
      "text": " is. Why did you leave us here? What's your plan for today? How do I fit within your plan?"
    },
    {
      "id": 8,
      "start": 1855.3400344848633,
      "end": 1862.2200355529785,
      "text": " What is my place within your plan, God? And then, God, how can I please you with my life?"
    },
    {
      "id": 9,
      "start": 1862.2200355529785,
      "end": 1867.420036315918,
      "text": " Because I want to hear, well done, thou good and faithful servant. Don't you? I want to"
    },
    {
      "id": 10,
      "start": 1867.420036315918,
      "end": 1874.8800354003906,
      "text": " hear that. I want to be pleasing in God's sight. I want God to be pleased with me. Think"
    },
    {
      "id": 11,
      "start": 1874.8800354003906,
      "end": 1881.3200378417969,
      "text": " about these words, and I'll close with this. Paul says this in 2 Timothy 2, as he's writing"
    },
    {
      "id": 12,
      "start": 1881.3200378417969,
      "end": 1887.5600357055664,
      "text": " to Timothy, his son in the faith. In 2 Timothy 2, in verse 4, he says,"
    },
    {
      "id": 13,
      "start": 1887.5600357055664,
      "end": 1892.4400329589844,
      "text": " No man that werth entangleth himself with the affairs of this life, that he may please"
    },
    {
      "id": 14,
      "start": 1892.4400329589844,
      "end": 1899.5800323486328,
      "text": " him who hath chosen him to be a soldier. You know who chose us to be a soldier? The Lord."
    },
    {
      "id": 15,
      "start": 1899.5800323486328,
      "end": 1905.2400360107422,
      "text": " Amen? He talks about being a good soldier in verse 3, but the reality is that we want"
    },
    {
      "id": 16,
      "start": 1905.2400360107422,
      "end": 1909.8800354003906,
      "text": " to please him. I want to please him. Some of you have been in the military. I grew up"
    },
    {
      "id": 17,
      "start": 1909.8800354003906,
      "end": 1917.2800369262695,
      "text": " around the military, and there's an aspect of desiring to please, humanly speaking, a"
    },
    {
      "id": 18,
      "start": 1917.2800369262695,
      "end": 1924.1200332641602,
      "text": " superior ranking official. When you have inspection, I remember my dad spending hours preparing"
    },
    {
      "id": 19,
      "start": 1924.1200332641602,
      "end": 1928.520034790039,
      "text": " for inspections, and I remember as a kid thinking, Dad, why can't you do this? Why can't you"
    },
    {
      "id": 20,
      "start": 1928.520034790039,
      "end": 1931.7600402832031,
      "text": " do that? Why can't we go play? Why can't we what? Why do you have to get ready for this"
    },
    {
      "id": 21,
      "start": 1931.7600402832031,
      "end": 1937.0000305175781,
      "text": " inspection? Because some commanding officer somewhere was going to come and inspect them,"
    },
    {
      "id": 22,
      "start": 1937.0000305175781,
      "end": 1941.8800354003906,
      "text": " and they wanted to be pleasing, right? They didn't want to have problems and difficulties."
    },
    {
      "id": 23,
      "start": 1941.8800354003906,
      "end": 1947.020034790039,
      "text": " He didn't want to. So he put in the time to make sure that he could stand in that formation"
    },
    {
      "id": 24,
      "start": 1947.020034790039,
      "end": 1952.3200378417969,
      "text": " and go through that inspection. Oh, think about it from a heavenly perspective. We have"
    },
    {
      "id": 25,
      "start": 1952.3200378417969,
      "end": 1960.520034790039,
      "text": " a great God. We have a great God. He saved us, changed our lives. Oh, I want to please"
    },
    {
      "id": 26,
      "start": 1960.520034790039,
      "end": 1966.0000305175781,
      "text": " him with my life. If you want to please him, this book will tell you how you can please"
    },
    {
      "id": 27,
      "start": 1966.0000305175781,
      "end": 1972.8400268554688,
      "text": " him, and it will provide you with warnings of things not to do that will displease him."
    },
    {
      "id": 28,
      "start": 1972.8400268554688,
      "end": 1977.6800384521484,
      "text": " Those are of equal importance. Amen? Paul says, I warn you. I warn you why? Because"
    },
    {
      "id": 29,
      "start": 1977.6800384521484,
      "end": 1985.3600311279297,
      "text": " I love you. God's warnings are for our benefits. Amen? And what a great God we serve. Teach"
    },
    {
      "id": 30,
      "start": 1985.3600311279297,
      "end": 1989.7600402832031,
      "text": " me. Teach me what? What is it that I should desire to learn? I hope this evening that"
    },
    {
      "id": 31,
      "start": 1989.7600402832031,
      "end": 1997.800033569336,
      "text": " we have a host of things that we can add to our prayer list of, God, teach me. Teach"
    },
    {
      "id": 32,
      "start": 1997.800033569336,
      "end": 2003.1600341796875,
      "text": " me these things. Let's pray together. Father, we love you. We thank you for loving us. We"
    },
    {
      "id": 33,
      "start": 2003.1600341796875,
      "end": 2010.280029296875,
      "text": " thank you that you are the divine teacher, and I pray that you'd help us, God, to be"
    },
    {
      "id": 34,
      "start": 2010.280029296875,
      "end": 2019.4000396728516,
      "text": " desirous of learning, that we'd have that teachable spirit, that, God, we'd pray specifically"
    },
    {
      "id": 35,
      "start": 2019.4000396728516,
      "end": 2024.4800415039062,
      "text": " of things that we desire that you'd teach us. Help us to please you with our lives."
    },
    {
      "id": 36,
      "start": 2024.4800415039062,
      "end": 2028.9600372314453,
      "text": " Bless our time of prayer. Thank you for the privilege. Pray that you would bless, and"
    },
    {
      "id": 37,
      "start": 2028.9600372314453,
      "end": 2032.7200317382812,
      "text": " we'll thank you for it. In Christ's name we pray. Amen."
    },
    {
      "id": 38,
      "start": 2032.7200317382812,
      "end": 2035.6000366210938,
      "text": " Draw your attention to the back of our prayer bulletin, as we do each and every week."
    }
  ],
  "processed_at": "2025-04-17T00:04:37.346874"
}