{
  "video_id": "4vUlrsA0Z_s",
  "text": "Chapter number nine, Genesis chapter number nine this evening, and we'll be finishing up Genesis chapter nine, looking at verses 18 through 29 this evening will be our text of scripture. And if you're taking notes, I've titled the message this evening, Noah's final days. And it's kind of interesting because I'll title the message Noah's final days, and it's only a few verses of scripture, but it covers about 350 years. And so it's kind of ironic, but that is the passage that is before us here as we get back to the book of Genesis. We've been studying the book of Genesis. Of course, we've taken off several weeks now with some other subjects that we've been dealing with. And this is our 32nd lesson, believe it or not, through the book of Genesis. I've thoroughly enjoyed the study, and we've been going at it for a lengthy period of time. We first met Noah back in Genesis chapter number six, in the midst of great wickedness. And the Bible tells us that Noah was a just man and perfect in his generations. And then the Bible tells us this, that Noah walked with God. What a great testimony. We think about the testimony of Noah, and we think about all of the things that were going on as God describes for us in Genesis chapter number six. We find that Noah walked with God, and we find that the Bible tells us that Noah found grace in the eyes of the Lord. We find that God begins to reveal to Noah the plan that God has to destroy the earth and to destroy the inhabitants of the earth. And we find that in verse number 13, in fact, of Genesis chapter number six, God speaks directly to Noah and informs him. He says, the end of all flesh has come before me, for the earth is filled with violence through them. And behold, I will destroy them with the earth. He then tells him this. We see the grace of God in verse number 14, make thee an ark of gopher wood, room shalt thou make in the ark, and shalt pitch it within and without with pitch. And God gives him the instruction. We find that we have noted on several occasions, and we've studied through these portions, Genesis six through eight, and we've studied the great flood, and we've studied the life of Noah, and we have noted the obedience of Noah. How he obeyed the Lord, how he did what God told him to do. And what a blessing. In our last study from the book of Genesis, we actually studied the first half of chapter number nine. There's a net up here that's about to drive me crazy. And so I don't know where the fly went, but if the fly would get the net, I'd be happy. And in any case, in Genesis chapter number nine, verses one through 17, we dealt with the Noahic covenant. And that was in our last study from the book of Genesis this evening. As we complete the ninth chapter, we'll see the summary that is given to us with regard to Noah's final days. Notice in verse number 18 of Genesis nine, the Bible says, and the sons of Noah that went forth of the ark were Shem and Ham and Japheth. And Ham is the father of Canaan. These are the three sons of Noah. Notice this, and of them was the whole earth overspread. We'll get through the entirety of the chapter this evening, but let's begin and take some notes. Notice number one, the replenishing of the earth. In verses 18 and 19, as we break down this passage of scripture, we see an important truth that is given to us. The important truth that is given to us is with regard to the replenishing of the earth. And we find that the Bible says at the end of verse number 19, and of them, who is them? It's the three sons of Noah, Noah and his wife, his three sons, Shem, Ham, and Japheth. And we see that the Bible says of them was the whole earth overspread. Now we understand as we've studied here over the last several lessons from the book of Genesis and studying in chapter six through eight, we understand that God has given us the record of the Noah flood, the global flood. We understand that it's global in nature. It was not just a local flood, it was a global flood. In fact, as we looked at the Noahic covenant and we discussed the various aspects of the covenant that God gave in the first 17 verses here of Genesis chapter number nine, we understood again the fact that it was a global flood. Now understand with me, there are some that would seek to promote this idea that there are other groups of people on the face of the earth that were somehow sheltered from the flood and part of the replenishing of the earth, and there were pockets of population in various parts of the earth. Can I tell you very firmly that that is not biblically based? And we must understand that we approach these things biblically. The Bible must be our guide, and we understand that God gave us very specific things. Let's go back to Genesis chapter number six, and I want to just walk through these three chapters and just point out a few verses of scripture along the way to help us understand. It was in Genesis chapter number six, we read verse 13, let me read verse number seven to you. The Bible says in Genesis six and verse number seven, and the Lord said, I will destroy man whom I have created from the face of the earth, both man and beast and the creeping thing and the fowls of the air, for it repenteth me that I have made them. And so we find that in Genesis chapter number six, verse number seven and verse number 13, both give us the announcement of this judgment that was impending. We find that in Genesis chapter number seven, that the Bible tells us in verse number seven, and Noah went in. What did he go in? He went in the ark. Not only did Noah go in, but it says, and his sons and his wife and his son's wives with him into the ark because of the waters of the flood. Let's skip down and look at verse number 13. The Bible says in the self same day entered Noah and Shem and Ham and Japheth and the sons of Noah and Noah's wife and the three wives of his sons with them into the ark. God gives us a record of the human beings that entered the ark. There were eight. In fact, if you look at the new Testament, the Bible talks about the eight persons referring to Noah, his wife, his three sons, and their wives. These eight entered into the ark. We find that in, as you skip down to verse number 21 of Genesis chapter number seven, the Bible says, and all flesh died that moved upon the earth, both of fowl and of cattle of beast and of every creeping thing that creepeth upon the earth. What's it say? And every man, verse 23, notice the Bible says in every living substance was destroyed, which was upon the face of the ground, both man and cattle and the creeping things and the fowl of the heaven, and they were destroyed from the earth. And Noah only remained alive in they that were with him in the ark. Aren't you glad that God gave us a record of who went into the ark? He didn't leave it for our speculation. He didn't leave it for some theologians or from some whoever group of people to sit around and say, well, let's think about how big the ark was and let's think about how many could have fit on it. And this, no, the Bible tells us who went on the ark. And so we find that as we look here in the passage of scripture in chapter six, seven, eight, of course, is when the ark, when the waters were assuaged and when the ark rested and when Noah came off the ark and you find that it was Noah and his wife and his sons and their wives notice in verse number 18 of chapter number eight, actually back up to verse number 15. And God spake unto Noah saying, go forth of the ark, thou and thy wife and thy sons and thy son's wives with thee. So they all survived during the time on the ark. It tells us in verse number 18 and Noah went forth and his sons and his wife and his son's wives with him. And as we move into chapter number nine, we find the Bible says in verse number one, and God blessed Noah and his sons and said unto them, be fruitful and multiply and replenish the earth. And so as we look at this entrance or the beginning of this passage of scripture that we're studying this evening and looking at verses 18 and 19, the Bible repeats to us again who the sons of Noah are that went forth of the ark. And the Bible very clearly teaches us that of them was the whole earth over spread. And so we find biblically speaking, the human race traces its lineage back to Noah, Shem, Ham, and Japheth. Of course, they go back to Adam, right? The first man. We read of that, of course, in Genesis one, when God said, let us make man in our own image. And of course, we understand and we've studied that in the past. Notice what the Bible tells us in Acts chapter number 17, in verse number 26, Paul is here in this situation and he is going, of course, to Athens and he's preaching there. And we find that he saw a city that was wholly given to idolatry. And these people that served idols, they had a whole grove of them, if you will. And we find that Paul mentioned that as he went through, he noticed that there was one with the inscription to the unknown God. And Paul says that you worship him ignorantly. And then he says this, him declare I unto you. And then we begin noticing what Paul declares of this God, the Lord God, Jehovah, in verse number 24 of Acts 17, it says, God that made the world and all things therein, seeing that he is Lord of heaven and earth, dwelleth not in temples made with hands. Neither is worship with men's hands as though he needed anything, seeing he giveth to all life and breath and all things. And hath made of one blood all nations of men, for to dwell on all the face of the earth, and hath determined the times before appointed, and the bounds of their habitation.\" And so we find that Paul is preaching to these idol worshipers, these individuals in Athens that had this plurality of gods, and he says you have this one altar that has this inscription to the unknown God, Him declare I unto you, and he begins to share with the fact that he's creator, and then he deals with the fact of course of the human race being of one blood, and we see that very plainly in the Bible. We find the Bible record is accurate, and it is to be of course giving, it provides for us a biblical worldview. Notice as we continue back in Genesis chapter number nine, not only the replenishing of the earth, but notice the drunkenness of Noah. I'll be honest with you, it's a sad portion of Scripture when we read these verses of Scripture. We find the the wonderful way in which we first were introduced to Noah, as I've mentioned already by way of introduction back in Genesis chapter number six, and now we come here to Genesis chapter number nine, and the Bible tells us in verse number 20, and Noah began to be in husbandmen, and he planted a vineyard. And so the Bible begins to share with us some things with regard to the occupation of Noah, to the life of Noah. Again, there's just a few verses of Scripture that capture a lengthy period of history. As you get to the end of the text of Scripture, the Bible tells us in verse 28 that Noah lived after the flood three hundred and fifty years. So obviously God is not providing us with a diary of Noah's life, of all of the events and all of the things that had transpired, but we find here that God is sharing this singular event that took place in the life of Noah, and we find that as he shares this event, he tells us that Noah had this occupation. He began to be in husbandmen, he planted a vineyard. Notice in verse 21, and he drank of the wine and was drunken. The Bible tells us this at the end of verse 21, and he was uncovered within his tent. Really, we could note the shame of Noah in verse number 21. I do not believe for a moment of time that Noah intended for this to be the result of what he did. In fact, as we often would speak about alcohol and we would deal with, you know, wine and alcoholic beverage and that sort of thing, and we look at the biblical context, we can always find within the context of whether the wine is an alcoholic wine or if it's the the fruit of the vine, and we can always determine that contextually as to what takes place. Here, very specifically, the Bible says that he was drunken. It's obviously alcoholic wine in its nature, and then as we see the result, it says that he was uncovered within his tent. There's shame that's associated with this activity that God describes for us here in verse 21. Notice as we come to verse number 22 that God gives us the record of the actions of Ham. Of course, Noah has three sons, Shem, Ham, and Japheth, and we notice here that the Bible tells us specifically about Ham. It tells us this, that Ham—notice this again—the father of Canaan. Now, we saw this back in verse number 18 when the Bible says the sons of Noah that went forth of the ark were Shem and Ham and Japheth, and then it says this, and Ham is the father of Canaan. We come to verse number 22, and it says, and Ham the father of Canaan. Do you think God wants us to understand something about lineage? He wants us to understand something about the genealogy here, and he mentions twice within just a few verses of Scripture that Ham is the father of Canaan. We'll get to that in just a few moments, but it is important to make that note. It then continues to say this in verse number 22, that Ham saw the nakedness of his father and told his two brethren without. I will be honest with you, theologians have argued the point for generations as to what this means that Ham did. The Bible doesn't tell specifically what Ham did. The Bible simply reveals to us that he saw his father's nakedness and that he told his two brethren. He did not seek to cover as Shem and Japheth will, and we'll notice that in the next passage of Scripture and the next verse of Scripture, but we find that he, Ham, went in and he saw it, and then he went and told his brethren. Shem and Japheth. We find that upon hearing the news of what had taken place, of the shame, if you will, of Noah as he's in the tent after he had drunk in this wine, that the Bible tells us that Shem and Japheth, in verse number 23, that they took a garment. Notice what the Bible says, and they laid it upon both their shoulders and went backward and covered the nakedness of their father, and their faces were backward and they saw not their father's nakedness. We find that these two boys, they find the entrance to the tent, we'll pretend that it's here, and they get here side by side and they put a, the Bible tells us here in verse number 22, excuse me, 23, they put a garment upon their shoulders and they walked backwards into the tent to cover the nakedness of their father so that they did not see it. We find that there was a difference in action between what the Bible records for us of Ham and what the Bible records for us with regard to Shem and Japheth, and we find that the Bible then tells us that Noah awoke in verse number 24. He woke from his wine, and the Bible says that he knew what his younger son had done unto him. He was aware of that which had transpired, he was aware of what had taken place when he was within his tent. We find that he then, as he has this understanding of the events, God records for us in verses 25 through 27, if you're taking notes, number three, the prophecy of Noah. As we look at the prophecy of Noah, we break down these verses of Scripture in verses 25 through 27, it actually becomes a little bit clearer as to what happens not only here in Genesis 9, but you'll be familiar with this taking place later in the life of Jacob. Remember when he calls all of his boys around in Genesis chapter number 49, and he's going to give the blessings to all of his sons, and he goes through and he lists each of the sons and he speaks about them and so on and so forth, and we find here that as Noah, the prophecy of Noah is recorded for us in verses 25 through 27. Now it begins in verse number 25 with dealing, and here's what it says, and he said, Cursed be Canaan, a servant of servants shall he be unto his brethren. We understand that as this prophecy of Noah is recorded for us here in verses 25 through 27, that it begins with a curse. We'll find that there's a blessing and an enlargement that is mentioned in verses 26 and 27, but it begins with this curse. It says, Cursed be Canaan. Notice again, if we go back into the text of Scripture, that we've made note that the Bible says that Ham is the father of Canaan, that Ham is the one that went in and saw the nakedness of his father. He saw the shame. Noah was aware of what had taken place. He knew what his younger son had done unto him, and it says, Cursed be Canaan. You understand that the curse that is mentioned here in chapter number 9 and verse number 25 is not on all of the descendants of Ham, rather upon the descendants of Canaan. It's important for us to note that. There are some, by the way, that have misapplied and misgiven the interpretation of this passage of Scripture to say something that it does not say. Notice, he says, Cursed be Canaan, and he says this, A servant of servants shall he be unto his brethren. It's interesting, at the end of verse number 26 and at the end of verse number 27, it says, And Canaan shall be his servant. And Canaan shall be a servant. Can I tell you that the Canaanites were known for their wickedness and their immorality. As you study the Scriptures and begin to see all that transpires, as you begin to see the interactions between the children of Israel and the Canaanites, in fact, even within the book of Genesis, you see references to the Canaanites, you see they are known for their wickedness and their immorality. We find that in Genesis chapter number 10, turn over there if you will and look at verses 15 through 19, it's important for us to note this because the Bible says, Cursed be Canaan, and we find that in Genesis 10 verses 15 through 19 that God provides us with a list of the descendants of Canaan. Again, this prophecy of Noah is not on all of the descendants of Ham, it's simply on the Canaanites. Notice in verse number 15 of Genesis 10, And Canaan begat Sidon his firstborn in Heth, and the Jebusite, and the Amorite, and the Gergesite, and the Hivite, and the Archite, and the Sinite, and the Arvidite, and the Zemurite, and the Hamathite, and afterward were the families of the Canaanites spread abroad. Verse 19, And the border of the Canaanites was from Sidon as thou goest to Gerir, unto Gaza, as thou goest unto Sodom, and Gomorrah, and Admah, and Zeboiim, even unto Lasha.\" In fact, as you read the book of Joshua, as we've been studying the book of Joshua, you'll note many of those places and many of those names are found within the context of the book of Joshua. We find here that, as we would think about this curse that's been placed upon Canaan, this prophecy more than a curse, and we think about it as a prophecy in the sense of, yes, it says, curse it be Canaan, we understand that, but what we find that is happening is Noah is giving this prophecy with regard to the descendants, the wickedness that he saw in Ham, he would see it fully gone in Canaan, his son. And we find that in Genesis chapter 15, let's take a walk through some scripture here and look at some things with regard to the Canaanites. In Genesis chapter number 15, we often look at the passage of scripture and we deal with this wonderful promise of the Abrahamic covenant, and what a great promise it is, what a great truth of God's Word, and we think about the covenant, we've mentioned, even as we've studied through the book of Hebrews, that the promise is of a land and of a seed, right? Abraham never actually possessed the land that was promised. We find that the seed that was promised, he did have that son from he and Sarah, Isaac, and we find here that the Bible tells us in chapter number 15 and verse number 16, notice what God says, let me back up to verse number 12, and when the sun was going down, a deep sleep fell upon Abram, and lo and horror of great darkness fell upon him. And he said unto Abram, know of a surety that thy seed shall be a stranger in a land that is not theirs, and shall serve them, and they shall afflict them four hundred years. And also that nation whom they shall serve will I judge, and afterward shall they come out with great substance. Knowing the entirety of scripture, does this not sound familiar to you, as to the time in which the children of Israel would spend in Egypt, and they of course would be delivered after the tenth plague, the death of the firstborn, the Passover, and they would come out with great substance. But notice in verse 15, and thou shalt go to thy fathers in peace, thou shalt be buried in a good old age, but in the fourth generation they shall come hither again, notice, for the iniquity of the Amorites is not yet full. And we find here in verse number 16, as God would use this phraseology of the iniquity of the Amorites, what he's meaning is all of the Canaanite tribes that were in that region. And we'd understand as he's speaking about all of the Canaanite tribes that are within that region, again, as you look at the sons of Canaan, and you look and you notate the names that are given there in Genesis chapter number 10, you find that many of them occupied that land when the children of Israel, led by Joshua, would come in to inhabit the land. Now what happened? We know that God gave the commandment that they were to go in and they were to conquer the land, right? That's what they were told to do. They were to go in and they were to conquer the land and then inhabit the land. The question that we'd ask is, did they destroy all the Canaanites? The answer is no, they did not. Look over, if you will, at Joshua chapter number 16 and notice what God shows us here in the portion of Scripture. Now remember, this prophecy of Noah back in Genesis chapter number 9, he says, Notice, a servant of servants shall he be unto his brethren. In Joshua chapter number 16, in verse number 10, notice what the Bible says. This is speaking of the lot for the inheritance of the children of Joseph, Ephraim, specifically dealing with the tribe of Ephraim, the Ephraimites. It says this in verse number 10, and they drave not out the Canaanites that dwelt in Gezer. Notice, but the Canaanites dwell among the Ephraimites unto this day, and what does it say? And serve under tribute. And serve under tribute. What did he say? A servant of servants. Chapter 17, notice in verse number 12, the Bible says here, speaking of the half-tribe of Manasseh, yet the children of Manasseh could not drive out the inhabitants of those cities, but the Canaanites would dwell in that land. Yet it came to pass when the children of Israel were waxen strong that they put the Canaanites to tribute, but did not utterly drive them out. We find that the descendants of Ham, specifically being the father of Canaan and dealing with this prophecy, he says, cursed be Canaan a servant of servants shall he be unto his brethren, and we see exactly that coming to pass in the book of Joshua. In fact, if you turn to the book of Judges in the first chapter, notice what God records for us here. Again, recording some of what we just read in Joshua 16 and 17, notice how the writer notes it here in Judges 1. Judges chapter number 1, beginning in verse number 27, it says, neither did Manasseh drive out the inhabitants of Bethshean and her towns, nor Panach and her towns, nor the inhabitants of Dor and her towns, nor the inhabitants of Iblim and her towns, nor the inhabitants of Megiddo and her towns, but the Canaanites would dwell in that land. Verse 28, and it came to pass when Israel was strong that they put the Canaanites to tribute, but did not, and did not, excuse me, utterly drive them out. Neither did Ephraim drive out the Canaanites that dwelt in Gizir, but the Canaanites dwelt in Gizir among them. Neither did Zebulun drive out the inhabitants of Kitron, nor the inhabitants of Nahalal, but the Canaanites dwell among them and became tributaries. Neither did Asher drive out the inhabitants of Akot, nor the inhabitants of Zidon, nor of Elab, nor of Exib, nor of Helba, nor of Aphic, nor of Reho, but the Asherites dwelt among the Canaanites, the inhabitants of the land, for they did not drive them out. Neither did Naphtali drive out the inhabitants of Beth Shemesh, nor the inhabitants of Beth Anath, but it says he dwelt among the Canaanites, the inhabitants of the land. Nevertheless, the inhabitants of Beth Shemesh and of Beth Anath became tributaries unto them. We find that the Bible tells us in verse number 34, and the Amorites forced the children of Dan into the mountain, for they would not suffer them to come down to the valley, but the Amorites would dwell in Mount Heres and Ajalon, and then shelled them, and the hand of the house of Joseph prevailed, so they became tributaries. And the coast of the Amorites was from the going up to Acribim, from the rock and upward. You notice several times within the passage in Judges chapter number 1, the Bible mentions the Canaanites dwelling there and being under tribute, being servants. They would have this thing of paying taxes and what have you, and really it became this idea, it's very interesting, the Bible says that when Israel was strong, that they put the Canaanites to tribute. In fact, you'll find various interactions throughout the the Old Testament with regard to this people group, the Canaanites as they're referred to as, but you find that when Israel was strong, they would put them to tribute, they would be a servant of servants. In 1 Kings chapter number 9, we'll finish up with this particular passage of Scripture dealing with this first aspect of the prophecy of Noah. In 1 Kings chapter number 9, in verses 20 and 21. In 1 Kings 9, now think about this, the amount of time that has passed, we go all the way now to the time of Solomon, and it tells us in the beginning of the passage in verse number 1, and it came to pass when Solomon had finished the building of the house of the Lord, and the king's house, and all Solomon's desire, which he was pleased to do. Now, that's a long period of time from Genesis chapter number 9, and this prophecy of Noah. We see the entrance into the land, and the way in which the Canaanites became servants, and they were under tribute, and we've read all of those things, and we now fast forward through the period of the judges, and we get through the period of course of Saul reigning as king, and David reigning as king, and now we find that Solomon is king, he's built the temple. The Bible tells us here in the passage of Scripture some things about Tyre, and so on and so forth, but look in verse number 20, the Bible says, and all the people that were left of the Amorites, Hittites, Perizzites, Hivites, and Jebusites, which were not of the children of Israel, their children that were left after them in the land, whom the children of Israel also were not able utterly to destroy, upon those did Solomon levy a tribute of bond service unto this day. And so we find that this prophecy of Noah that is given to us in Genesis chapter number 9, as we trace a course throughout this portion of Old Testament biblical history, we see that it came to pass just as God said it would, through this prophecy that Noah made here in Genesis chapter 9, verse 25, with regard to the Canaanites. Again, it's important that we understand that he's not speaking about all of the descendants of Ham. In fact, as you get into Genesis chapter 9, verse 25, we see that he's speaking about the descendants of Ham. to chapter number 10 and you begin to read about the sons of Ham, you start reading in chapter number six, excuse me, in verse number six about the sons of Ham, Cush and Mithraim and Put and Canaan. Canaan wasn't his only son, it was his youngest son and it was the one in which this curse would be upon that they would be again a prophecy that they would be servants of servants unto his brethren. Notice as we move forward through the prophecy we come back to Genesis chapter 9 and we look to verse number 26 and the Bible says this, and he said, Noah again continuing to speak, he said, blessed be the Lord God of Shem and Canaan shall be his servant. He says blessed be the Lord God of Shem. It's interesting for we would mention the fact that of course the Jews are Semitic and they come through the line of Shem and we would find that this would be the Messianic line as we speak of. Now, we understand the blessing when we would consider that truth, amen, and we would understand the blessing. Remember, even as he would give that blessing to Abraham and he would talk about the seed and we find the fulfillment in Galatians very plainly that Paul speaks about the seed, singular, he didn't say seeds, he said seed, this is Christ, and he mentions how that we are the descendants of Abraham, how? Through faith. And we find the blessing that is here, blessed be the Lord God of Shem, dealing with the fact that the Jews are Semitic, the Messianic line is no doubt in view within the prophecy that is recorded here in verse number 26. We then come to verse number 27 and we find the Bible continues and says, God shall enlarge Japheth and he shall dwell in the tents of Shem and Canaan shall be his servant. We've dealt with the subject of Canaan in each of these situations. It's interesting that we find here when he speaks about Japheth, he says God shall enlarge Japheth. And we can think about and consider the territorial ways in which the descendants of Japheth went, so on and so forth, and it's kind of an interesting study. In fact, if you wanted to study all of these lines and kind of see where all of these groups of people went and so on and so forth, because we do understand that of them was the whole earth overspread. And so that's a lot of land, the whole earth, there's just eight people, and of course when we come to Genesis chapter 11 in the Tower of Babel and we see the disbursement of the people and all that that takes place, and we find that this prophecy with regard to Japheth, that God shall enlarge Japheth, but notice this aspect, the Bible says, and he shall dwell in the tents of Shem. It's interesting because we really know through this phraseology at the middle there of verse number 27 that the spiritual blessings upon Japheth would come through the God of Shem. Why? Because that's the Messianic line, that's the Lord God, that's our Messiah, and of course we look at this prophecy in verses 25, 26, and 27, and in fact, again, you could study various things and you could go through all sorts of things to see the way in which throughout history these particular descendants have gone to different places, but what a blessing to understand the way in which God is using this prophecy of Noah and we can see the fulfillment of it. Again, as we look at this passage of Scripture, we see not only the replenishing of the earth, the drunkenness of Noah, the prophecy of Noah, but then we see the death of Noah. Finally, this evening, number four, if you're taking notes, verses 28 and 29, the Bible says this, and Noah lived after the flood 350 years, and all the days of Noah were 950 years, and he died. That's pretty good age, amen? 950. Man. Now, it's interesting as we know what's taking place because really as we begin to understand the time frame, if you will, that Noah and his wife and his boys and their wives, they came off the ark in chapter number 8. Remember we said this, at the end of chapter number 8, the Bible tells us that Noah built an altar unto the Lord. What did he do? He offered burnt offerings on the altar. First things first, the first matter of business was worship. They worship the Lord, they make these offerings, and then we find that God comes and speaks to Noah, he blesses Noah and his kids, he gives them direction with regard to the replenishing of the earth, and he gives the Noahic covenant, and then we find in just these few verses of Scripture, the entirety of those 350 years wrapped up for us. Now, again, the Bible tells us that Noah was 950 years old and he died. Now, it's interesting that we would understand the age of Noah being mentioned here. It's approximate, and there's some different Bible scholars of yesteryear, of what have you, that have given chronological dates to events in the Scriptures, but roughly speaking, at this particular time in history, the earth was just over 2,000 years old from creation, and so you think about Noah being 950 years old and the earth only being created for a little over 2,000 years. When I say a little over, like 2004, 2006, somewhere in that ballpark, number of years since the earth had been created, but Noah was alive for 950 of them. That's almost half of the known human history at that point that Noah was alive for, and we think about it being summarized for us here in just these few verses of Scripture, and God is giving to us, helping us to see this prophecy of Noah, and again, as we've mentioned throughout the book of Genesis, as we begin to study the foundational nature of these really first 11 chapters of the book of Genesis and how foundational they are for understanding the entirety of Scripture. If you did not have these chapters and these verses and you did not understand some of these things, it would be challenging to have proper interpretation of the balance of Scripture. We find that it's these first 11 chapters that are so often under attack by those that do not have a biblical worldview that would like to destroy those that have a biblical worldview. They want to cast doubt as to the historical accuracy of these things. They want to provide various interpretations as to what these things mean, but we find that God has given us the Word that He has given us. He, in His wisdom, has given us exactly what He has given us, and as we study it and begin to interpret the history from the foundation of God's Word, we are able to come to proper conclusions. It is interesting to note this truth this evening as we think about kind of coming to this end point, if you will, in the book of Genesis. We find that in chapter number 10, of course, the genealogies are provided. We see the sons of Japheth, of Ham, of Shem, and really the entirety of the chapter is given to the genealogies. We then come to chapter number 11 with the Tower of Babel, and at that point we're kind of then going to start dealing with Abraham and going forward into the book of Genesis. And as we think about the foundation, we come to the end of chapter number 10 and look at the death of Noah, and we think about all of these things that have happened, all of these things that we've studied, and we begin to have this biblical worldview, we understand some of, or really all of, we have the understanding of what God is giving us in the New Testament and with His plan as a whole. We have so many people running around today that do not have a biblical worldview that are trying to provide solutions for the world's problems. The solutions for the world's problems are not going to come from something outside of God's Word, and we've had such a move away from the Bible in our nation in the last several generations, away from the Bible, away from God, away from the principles of God, and we've introduced all sorts of other thoughts and mindsets and ideologies that are out there that are permeating the minds of people today that are not going to adequately provide solutions to the problems that we deal with. In fact, as you look at the way in which the account of these first chapters of Genesis are being attacked, what is it, what is the the biggest way in which they attack? There's no creator, right? This teaching of evolution, this idea of humanism that really comes out of the teaching of Darwinianism and understanding all of their ideologies with regard to undermining the authority of God. Can I tell you that if there is no God, that there is no creator, that there's no purpose? We're just some random chance. That's not true. God has created us. God has given us a purpose. God has given us a plan, and God has recorded these things for us, and we find that as we look to the Scriptures and we look to the Word of God that we... We must ensure that our mindset is biblical, that our worldview is biblical. There are people... I had someone come to me a couple of years ago now, no one from our church, but someone came to me that had a solid, what I thought, a solid Bible foundation. And they came to me and they said, do you really think there only had to be one Adam or could there have been many Adams? And they began to ask about the replenishing of the earth after the flood, they began to provide these ideas about various groups of people in various regions of the world. And I simply said, sir, you got to look at the Bible, but how do you know it's true? And what has happened is they began to get attacked and attacked and attacked, and the attack upon the foundation of God's Word, began to mess with the thought process, begin to introduce various ideas and thoughts with regard to human history. But we find that God has given us the truth that He has given us for a purpose. Why did God decide, and I'm not questioning Him, I'm not saying it in this way to question Him, but we look at this and we say, in 350 years, to summarize the life of Noah in verses 18 through 29, why is this the content? Why is it that God takes note to tell us, and of them was the whole earth overspread? He wants us to understand the way in which the earth was replenished. He wants us to understand that all mankind was killed during the flood, and all men and every living being, they were all killed, they were destroyed. He told us specifically who got on the ark. He told us specifically who got off the ark. Why did He tell us about this event? Why did He tell us about the prophecy? Begin to see the way in which God is unfolding the future events that would happen and how we can look here and see this and begin to interpret properly future events that take place. And it's so important that we understand that. I mean, think about it this morning when we mentioned about the order of Melchizedek. I was chatting with someone after the service. The reality is that the truth of coming to that messianic psalm in Psalm 110 and thinking about this promise of this one that would come, Messiah, and as the prophecy would be given there, and they would be very familiar with it as they would understand here in Psalm 110 in verse number 4, where the Bible tells us, the Lord hath sworn and will not repent. Notice that terminology. The Lord hath sworn and will not repent, and then it says, thou art a priest forever after the order of Melchizedek. And then they think about Melchizedek, Melchizedek, where do we know that name from? I'm not sure that they would say that, but maybe for us. And they go back to Genesis 14 and they just look at a couple of verses of Scripture and they just, man, how does this all come to pass? We see now living in this day and living and looking back historically, we see how, and Holly and I were talking this afternoon, like the peel of the onion kind of coming off, the wrapping of the present coming off in the presentation. We find this such is the case with this prophecy of Noah recorded in these few verses of Scripture. It helps us to have a proper understanding of all that takes place. You know, there are a lot of people that take the approach that Ham was cursed. It doesn't say that Ham was cursed. It says cursed be Canaan. Amen? They try to make application to certain ethnicities with regard to that curse that is mentioned in Genesis chapter number nine. They were Canaanites that dwell in the land of Canaan, okay? They were servants of servants. We looked at the passages of Scripture, and so we don't have to come up with some hypothesis of what does this mean and how does this all work out. No, we can go to the Scriptures and we can trace what the Scriptures tell us and we can see the fulfillment of the prophecy. And I'm thankful that God in His wisdom provided us with the record that He provided us with because He knows exactly what we need. And we need to be biblical. Amen? We really do. We need to return to the Bible. We need to be biblical people. We need to be in the place where we think and act biblically. There's so many ideas that are being thrown out in our world today, and it's so dangerous for our young people to kind of get caught up in some of these ideologies and some of these... I mean, listen, they package them neatly and they make it sound really good. I say, hold on a minute. Is it biblical? Because first and foremost, we must have a biblical worldview, and everything will then flow out of that. Genesis chapter 9 records for us the final days of Noah. Let's pray. Father, we love You. We thank You for loving us. Thank You for the Word of God, the truth contained therein. We thank You for the opportunity to study Thy Word. Lord, we thank You for allowing us to have the Bible preserved in our language. We thank You for Your wisdom that's been displayed throughout the book of Genesis. We've seen Your power and Your wisdom on display. God, I pray that You would help us to be biblical. Lord, to think and act biblically, to consider those things that would be presented to us and take them through the filter of Your Word. Lord, help us not to be deceived by those things that are going on in our society today. We thank You for Your Word. We thank You for loving us. We pray that You'd give us a good week. Lord, help us to honor You and glorify You. We think of those that are traveling, pray that You'd keep them safe. Lord, help us to be the salt of the earth and the light of the world. We'll thank You for it. In Christ's name we pray. Would you stand with me?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.320000171661377,
      "text": " Chapter number nine, Genesis chapter number nine this evening, and we'll be finishing"
    },
    {
      "id": 1,
      "start": 4.320000171661377,
      "end": 8.520000457763672,
      "text": " up Genesis chapter nine, looking at verses 18 through 29 this evening will be our text"
    },
    {
      "id": 2,
      "start": 8.520000457763672,
      "end": 10.079999923706055,
      "text": " of scripture."
    },
    {
      "id": 3,
      "start": 10.079999923706055,
      "end": 17.239999771118164,
      "text": " And if you're taking notes, I've titled the message this evening, Noah's final days."
    },
    {
      "id": 4,
      "start": 17.239999771118164,
      "end": 21.719999313354492,
      "text": " And it's kind of interesting because I'll title the message Noah's final days, and it's"
    },
    {
      "id": 5,
      "start": 21.719999313354492,
      "end": 26.899999618530273,
      "text": " only a few verses of scripture, but it covers about 350 years."
    },
    {
      "id": 6,
      "start": 26.899999618530273,
      "end": 32.779998779296875,
      "text": " And so it's kind of ironic, but that is the passage that is before us here as we get back"
    },
    {
      "id": 7,
      "start": 32.779998779296875,
      "end": 34.060001373291016,
      "text": " to the book of Genesis."
    },
    {
      "id": 8,
      "start": 34.060001373291016,
      "end": 35.2599983215332,
      "text": " We've been studying the book of Genesis."
    },
    {
      "id": 9,
      "start": 35.2599983215332,
      "end": 40.02000045776367,
      "text": " Of course, we've taken off several weeks now with some other subjects that we've been dealing"
    },
    {
      "id": 10,
      "start": 40.02000045776367,
      "end": 41.02000045776367,
      "text": " with."
    },
    {
      "id": 11,
      "start": 41.02000045776367,
      "end": 45.18000030517578,
      "text": " And this is our 32nd lesson, believe it or not, through the book of Genesis."
    },
    {
      "id": 12,
      "start": 45.18000030517578,
      "end": 50.060001373291016,
      "text": " I've thoroughly enjoyed the study, and we've been going at it for a lengthy period of time."
    },
    {
      "id": 13,
      "start": 50.060001373291016,
      "end": 54.97999954223633,
      "text": " We first met Noah back in Genesis chapter number six, in the midst of great wickedness."
    },
    {
      "id": 14,
      "start": 54.97999954223633,
      "end": 60.34000015258789,
      "text": " And the Bible tells us that Noah was a just man and perfect in his generations."
    },
    {
      "id": 15,
      "start": 60.34000015258789,
      "end": 64.33999633789062,
      "text": " And then the Bible tells us this, that Noah walked with God."
    },
    {
      "id": 16,
      "start": 64.33999633789062,
      "end": 66.33999633789062,
      "text": " What a great testimony."
    },
    {
      "id": 17,
      "start": 66.33999633789062,
      "end": 70.0199966430664,
      "text": " We think about the testimony of Noah, and we think about all of the things that were"
    },
    {
      "id": 18,
      "start": 70.0199966430664,
      "end": 74.0199966430664,
      "text": " going on as God describes for us in Genesis chapter number six."
    },
    {
      "id": 19,
      "start": 74.0199966430664,
      "end": 78.9000015258789,
      "text": " We find that Noah walked with God, and we find that the Bible tells us that Noah found"
    },
    {
      "id": 20,
      "start": 78.9000015258789,
      "end": 81.9800033569336,
      "text": " grace in the eyes of the Lord."
    },
    {
      "id": 21,
      "start": 81.9800033569336,
      "end": 88.0199966430664,
      "text": " We find that God begins to reveal to Noah the plan that God has to destroy the earth"
    },
    {
      "id": 22,
      "start": 88.0199966430664,
      "end": 90.81999969482422,
      "text": " and to destroy the inhabitants of the earth."
    },
    {
      "id": 23,
      "start": 90.81999969482422,
      "end": 95.9800033569336,
      "text": " And we find that in verse number 13, in fact, of Genesis chapter number six, God speaks"
    },
    {
      "id": 24,
      "start": 95.9800033569336,
      "end": 98.05999755859375,
      "text": " directly to Noah and informs him."
    },
    {
      "id": 25,
      "start": 98.05999755859375,
      "end": 102.86000061035156,
      "text": " He says, the end of all flesh has come before me, for the earth is filled with violence"
    },
    {
      "id": 26,
      "start": 102.86000061035156,
      "end": 103.86000061035156,
      "text": " through them."
    },
    {
      "id": 27,
      "start": 103.86000061035156,
      "end": 107.81999969482422,
      "text": " And behold, I will destroy them with the earth."
    },
    {
      "id": 28,
      "start": 107.81999969482422,
      "end": 108.94000244140625,
      "text": " He then tells him this."
    },
    {
      "id": 29,
      "start": 108.94000244140625,
      "end": 115.0999984741211,
      "text": " We see the grace of God in verse number 14, make thee an ark of gopher wood, room shalt"
    },
    {
      "id": 30,
      "start": 115.0999984741211,
      "end": 120.45999908447266,
      "text": " thou make in the ark, and shalt pitch it within and without with pitch."
    },
    {
      "id": 31,
      "start": 120.45999908447266,
      "end": 122.5,
      "text": " And God gives him the instruction."
    },
    {
      "id": 32,
      "start": 122.5,
      "end": 127.94000244140625,
      "text": " We find that we have noted on several occasions, and we've studied through these portions,"
    },
    {
      "id": 33,
      "start": 127.94000244140625,
      "end": 133.10000610351562,
      "text": " Genesis six through eight, and we've studied the great flood, and we've studied the life"
    },
    {
      "id": 34,
      "start": 133.10000610351562,
      "end": 136.89999389648438,
      "text": " of Noah, and we have noted the obedience of Noah."
    },
    {
      "id": 35,
      "start": 136.89999389648438,
      "end": 141.13999938964844,
      "text": " How he obeyed the Lord, how he did what God told him to do."
    },
    {
      "id": 36,
      "start": 141.13999938964844,
      "end": 142.13999938964844,
      "text": " And what a blessing."
    },
    {
      "id": 37,
      "start": 142.13999938964844,
      "end": 146.82000732421875,
      "text": " In our last study from the book of Genesis, we actually studied the first half of chapter"
    },
    {
      "id": 38,
      "start": 146.82000732421875,
      "end": 147.82000732421875,
      "text": " number nine."
    },
    {
      "id": 39,
      "start": 147.82000732421875,
      "end": 150.89999389648438,
      "text": " There's a net up here that's about to drive me crazy."
    },
    {
      "id": 40,
      "start": 150.89999389648438,
      "end": 155.10000610351562,
      "text": " And so I don't know where the fly went, but if the fly would get the net, I'd be happy."
    },
    {
      "id": 41,
      "start": 155.10000610351562,
      "end": 159.77999877929688,
      "text": " And in any case, in Genesis chapter number nine, verses one through 17, we dealt with"
    },
    {
      "id": 42,
      "start": 159.77999877929688,
      "end": 161.5399932861328,
      "text": " the Noahic covenant."
    },
    {
      "id": 43,
      "start": 161.5399932861328,
      "end": 165.36000061035156,
      "text": " And that was in our last study from the book of Genesis this evening."
    },
    {
      "id": 44,
      "start": 165.36000061035156,
      "end": 170.63999938964844,
      "text": " As we complete the ninth chapter, we'll see the summary that is given to us with regard"
    },
    {
      "id": 45,
      "start": 170.63999938964844,
      "end": 172.36000061035156,
      "text": " to Noah's final days."
    },
    {
      "id": 46,
      "start": 172.36000061035156,
      "end": 176.32000732421875,
      "text": " Notice in verse number 18 of Genesis nine, the Bible says, and the sons of Noah that"
    },
    {
      "id": 47,
      "start": 176.32000732421875,
      "end": 179.32000732421875,
      "text": " went forth of the ark were Shem and Ham and Japheth."
    },
    {
      "id": 48,
      "start": 179.32000732421875,
      "end": 182.0399932861328,
      "text": " And Ham is the father of Canaan."
    },
    {
      "id": 49,
      "start": 182.0399932861328,
      "end": 184.1199951171875,
      "text": " These are the three sons of Noah."
    },
    {
      "id": 50,
      "start": 184.1199951171875,
      "end": 189.27999877929688,
      "text": " Notice this, and of them was the whole earth overspread."
    },
    {
      "id": 51,
      "start": 189.27999877929688,
      "end": 193.9600067138672,
      "text": " We'll get through the entirety of the chapter this evening, but let's begin and take some"
    },
    {
      "id": 52,
      "start": 193.9600067138672,
      "end": 194.9600067138672,
      "text": " notes."
    },
    {
      "id": 53,
      "start": 195.9600067138672,
      "end": 199.0800018310547,
      "text": " Notice number one, the replenishing of the earth."
    },
    {
      "id": 54,
      "start": 199.0800018310547,
      "end": 203.8000030517578,
      "text": " In verses 18 and 19, as we break down this passage of scripture, we see an important"
    },
    {
      "id": 55,
      "start": 203.8000030517578,
      "end": 205.83999633789062,
      "text": " truth that is given to us."
    },
    {
      "id": 56,
      "start": 205.83999633789062,
      "end": 209.8000030517578,
      "text": " The important truth that is given to us is with regard to the replenishing of the earth."
    },
    {
      "id": 57,
      "start": 209.8000030517578,
      "end": 214.47999572753906,
      "text": " And we find that the Bible says at the end of verse number 19, and of them, who is them?"
    },
    {
      "id": 58,
      "start": 214.47999572753906,
      "end": 220.47999572753906,
      "text": " It's the three sons of Noah, Noah and his wife, his three sons, Shem, Ham, and Japheth."
    },
    {
      "id": 59,
      "start": 220.47999572753906,
      "end": 227.8000030517578,
      "text": " And we see that the Bible says of them was the whole earth overspread."
    },
    {
      "id": 60,
      "start": 227.8000030517578,
      "end": 233.44000244140625,
      "text": " Now we understand as we've studied here over the last several lessons from the book of"
    },
    {
      "id": 61,
      "start": 233.44000244140625,
      "end": 238.24000549316406,
      "text": " Genesis and studying in chapter six through eight, we understand that God has given us"
    },
    {
      "id": 62,
      "start": 238.24000549316406,
      "end": 242.44000244140625,
      "text": " the record of the Noah flood, the global flood."
    },
    {
      "id": 63,
      "start": 242.44000244140625,
      "end": 245.0,
      "text": " We understand that it's global in nature."
    },
    {
      "id": 64,
      "start": 245.0,
      "end": 248.0800018310547,
      "text": " It was not just a local flood, it was a global flood."
    },
    {
      "id": 65,
      "start": 248.0800018310547,
      "end": 254.0800018310547,
      "text": " In fact, as we looked at the Noahic covenant and we discussed the various aspects of the"
    },
    {
      "id": 66,
      "start": 254.0800018310547,
      "end": 259.3599853515625,
      "text": " covenant that God gave in the first 17 verses here of Genesis chapter number nine, we understood"
    },
    {
      "id": 67,
      "start": 259.3599853515625,
      "end": 262.7200012207031,
      "text": " again the fact that it was a global flood."
    },
    {
      "id": 68,
      "start": 262.7200012207031,
      "end": 268.79998779296875,
      "text": " Now understand with me, there are some that would seek to promote this idea that there"
    },
    {
      "id": 69,
      "start": 268.79998779296875,
      "end": 275.0,
      "text": " are other groups of people on the face of the earth that were somehow sheltered from"
    },
    {
      "id": 70,
      "start": 275.0,
      "end": 281.239990234375,
      "text": " the flood and part of the replenishing of the earth, and there were pockets of population"
    },
    {
      "id": 71,
      "start": 281.239990234375,
      "end": 283.05999755859375,
      "text": " in various parts of the earth."
    },
    {
      "id": 72,
      "start": 283.05999755859375,
      "end": 288.79998779296875,
      "text": " Can I tell you very firmly that that is not biblically based?"
    },
    {
      "id": 73,
      "start": 288.79998779296875,
      "end": 292.6400146484375,
      "text": " And we must understand that we approach these things biblically."
    },
    {
      "id": 74,
      "start": 292.6400146484375,
      "end": 299.79998779296875,
      "text": " The Bible must be our guide, and we understand that God gave us very specific things."
    },
    {
      "id": 75,
      "start": 299.79998779296875,
      "end": 303.55999755859375,
      "text": " Let's go back to Genesis chapter number six, and I want to just walk through these three"
    },
    {
      "id": 76,
      "start": 303.55999755859375,
      "end": 309.7200012207031,
      "text": " chapters and just point out a few verses of scripture along the way to help us understand."
    },
    {
      "id": 77,
      "start": 309.7200012207031,
      "end": 313.9599914550781,
      "text": " It was in Genesis chapter number six, we read verse 13, let me read verse number seven to"
    },
    {
      "id": 78,
      "start": 313.9599914550781,
      "end": 314.9599914550781,
      "text": " you."
    },
    {
      "id": 79,
      "start": 314.9599914550781,
      "end": 319.4800109863281,
      "text": " The Bible says in Genesis six and verse number seven, and the Lord said, I will destroy man"
    },
    {
      "id": 80,
      "start": 319.4800109863281,
      "end": 325.260009765625,
      "text": " whom I have created from the face of the earth, both man and beast and the creeping thing"
    },
    {
      "id": 81,
      "start": 325.260009765625,
      "end": 330.0400085449219,
      "text": " and the fowls of the air, for it repenteth me that I have made them."
    },
    {
      "id": 82,
      "start": 330.0400085449219,
      "end": 334.79998779296875,
      "text": " And so we find that in Genesis chapter number six, verse number seven and verse number 13,"
    },
    {
      "id": 83,
      "start": 334.79998779296875,
      "end": 339.0400085449219,
      "text": " both give us the announcement of this judgment that was impending."
    },
    {
      "id": 84,
      "start": 339.0400085449219,
      "end": 344.6000061035156,
      "text": " We find that in Genesis chapter number seven, that the Bible tells us in verse number seven,"
    },
    {
      "id": 85,
      "start": 344.6000061035156,
      "end": 346.20001220703125,
      "text": " and Noah went in."
    },
    {
      "id": 86,
      "start": 346.20001220703125,
      "end": 347.20001220703125,
      "text": " What did he go in?"
    },
    {
      "id": 87,
      "start": 347.20001220703125,
      "end": 349.760009765625,
      "text": " He went in the ark."
    },
    {
      "id": 88,
      "start": 349.760009765625,
      "end": 354.9599914550781,
      "text": " Not only did Noah go in, but it says, and his sons and his wife and his son's wives"
    },
    {
      "id": 89,
      "start": 354.9599914550781,
      "end": 359.0,
      "text": " with him into the ark because of the waters of the flood."
    },
    {
      "id": 90,
      "start": 359.0,
      "end": 361.20001220703125,
      "text": " Let's skip down and look at verse number 13."
    },
    {
      "id": 91,
      "start": 361.20001220703125,
      "end": 366.20001220703125,
      "text": " The Bible says in the self same day entered Noah and Shem and Ham and Japheth and the"
    },
    {
      "id": 92,
      "start": 366.20001220703125,
      "end": 374.239990234375,
      "text": " sons of Noah and Noah's wife and the three wives of his sons with them into the ark."
    },
    {
      "id": 93,
      "start": 374.239990234375,
      "end": 378.6400146484375,
      "text": " God gives us a record of the human beings that entered the ark."
    },
    {
      "id": 94,
      "start": 378.6400146484375,
      "end": 379.6400146484375,
      "text": " There were eight."
    },
    {
      "id": 95,
      "start": 379.6400146484375,
      "end": 384.739990234375,
      "text": " In fact, if you look at the new Testament, the Bible talks about the eight persons referring"
    },
    {
      "id": 96,
      "start": 384.739990234375,
      "end": 388.239990234375,
      "text": " to Noah, his wife, his three sons, and their wives."
    },
    {
      "id": 97,
      "start": 388.239990234375,
      "end": 390.29998779296875,
      "text": " These eight entered into the ark."
    },
    {
      "id": 98,
      "start": 390.29998779296875,
      "end": 395.20001220703125,
      "text": " We find that in, as you skip down to verse number 21 of Genesis chapter number seven,"
    },
    {
      "id": 99,
      "start": 395.20001220703125,
      "end": 402.3999938964844,
      "text": " the Bible says, and all flesh died that moved upon the earth, both of fowl and of cattle"
    },
    {
      "id": 100,
      "start": 402.3999938964844,
      "end": 405.760009765625,
      "text": " of beast and of every creeping thing that creepeth upon the earth."
    },
    {
      "id": 101,
      "start": 405.760009765625,
      "end": 406.9599914550781,
      "text": " What's it say?"
    },
    {
      "id": 102,
      "start": 406.9599914550781,
      "end": 412.9200134277344,
      "text": " And every man, verse 23, notice the Bible says in every living substance was destroyed,"
    },
    {
      "id": 103,
      "start": 412.9200134277344,
      "end": 417.7200012207031,
      "text": " which was upon the face of the ground, both man and cattle and the creeping things and"
    },
    {
      "id": 104,
      "start": 417.7200012207031,
      "end": 421.9599914550781,
      "text": " the fowl of the heaven, and they were destroyed from the earth."
    },
    {
      "id": 105,
      "start": 421.9599914550781,
      "end": 427.55999755859375,
      "text": " And Noah only remained alive in they that were with him in the ark."
    },
    {
      "id": 106,
      "start": 427.55999755859375,
      "end": 431.44000244140625,
      "text": " Aren't you glad that God gave us a record of who went into the ark?"
    },
    {
      "id": 107,
      "start": 431.44000244140625,
      "end": 433.5,
      "text": " He didn't leave it for our speculation."
    },
    {
      "id": 108,
      "start": 433.5,
      "end": 438.32000732421875,
      "text": " He didn't leave it for some theologians or from some whoever group of people to sit around"
    },
    {
      "id": 109,
      "start": 438.32000732421875,
      "end": 442.2799987792969,
      "text": " and say, well, let's think about how big the ark was and let's think about how many could"
    },
    {
      "id": 110,
      "start": 442.2799987792969,
      "end": 443.2799987792969,
      "text": " have fit on it."
    },
    {
      "id": 111,
      "start": 443.2799987792969,
      "end": 447.6000061035156,
      "text": " And this, no, the Bible tells us who went on the ark."
    },
    {
      "id": 112,
      "start": 447.6000061035156,
      "end": 453.0799865722656,
      "text": " And so we find that as we look here in the passage of scripture in chapter six, seven,"
    },
    {
      "id": 113,
      "start": 453.0799865722656,
      "end": 458.0400085449219,
      "text": " eight, of course, is when the ark, when the waters were assuaged and when the ark rested"
    },
    {
      "id": 114,
      "start": 458.0400085449219,
      "end": 463.20001220703125,
      "text": " and when Noah came off the ark and you find that it was Noah and his wife and his sons"
    },
    {
      "id": 115,
      "start": 463.20001220703125,
      "end": 468.0400085449219,
      "text": " and their wives notice in verse number 18 of chapter number eight, actually back up"
    },
    {
      "id": 116,
      "start": 468.0400085449219,
      "end": 469.5199890136719,
      "text": " to verse number 15."
    },
    {
      "id": 117,
      "start": 469.5199890136719,
      "end": 475.0,
      "text": " And God spake unto Noah saying, go forth of the ark, thou and thy wife and thy sons and"
    },
    {
      "id": 118,
      "start": 475.0,
      "end": 477.760009765625,
      "text": " thy son's wives with thee."
    },
    {
      "id": 119,
      "start": 477.760009765625,
      "end": 480.6199951171875,
      "text": " So they all survived during the time on the ark."
    },
    {
      "id": 120,
      "start": 480.6199951171875,
      "end": 485.4800109863281,
      "text": " It tells us in verse number 18 and Noah went forth and his sons and his wife and his son's"
    },
    {
      "id": 121,
      "start": 485.4800109863281,
      "end": 487.3800048828125,
      "text": " wives with him."
    },
    {
      "id": 122,
      "start": 487.3800048828125,
      "end": 491.79998779296875,
      "text": " And as we move into chapter number nine, we find the Bible says in verse number one, and"
    },
    {
      "id": 123,
      "start": 491.79998779296875,
      "end": 495.9200134277344,
      "text": " God blessed Noah and his sons and said unto them, be fruitful and multiply and replenish"
    },
    {
      "id": 124,
      "start": 495.9200134277344,
      "end": 496.9200134277344,
      "text": " the earth."
    },
    {
      "id": 125,
      "start": 496.9200134277344,
      "end": 501.67999267578125,
      "text": " And so as we look at this entrance or the beginning of this passage of scripture that"
    },
    {
      "id": 126,
      "start": 501.67999267578125,
      "end": 506.2799987792969,
      "text": " we're studying this evening and looking at verses 18 and 19, the Bible repeats to us"
    },
    {
      "id": 127,
      "start": 506.2799987792969,
      "end": 510.5199890136719,
      "text": " again who the sons of Noah are that went forth of the ark."
    },
    {
      "id": 128,
      "start": 510.5199890136719,
      "end": 517.6400146484375,
      "text": " And the Bible very clearly teaches us that of them was the whole earth over spread."
    },
    {
      "id": 129,
      "start": 517.6400146484375,
      "end": 523.4400024414062,
      "text": " And so we find biblically speaking, the human race traces its lineage back to Noah, Shem,"
    },
    {
      "id": 130,
      "start": 523.4400024414062,
      "end": 524.6400146484375,
      "text": " Ham, and Japheth."
    },
    {
      "id": 131,
      "start": 524.6400146484375,
      "end": 528.1599731445312,
      "text": " Of course, they go back to Adam, right?"
    },
    {
      "id": 132,
      "start": 528.1599731445312,
      "end": 529.8200073242188,
      "text": " The first man."
    },
    {
      "id": 133,
      "start": 529.8200073242188,
      "end": 534.6199951171875,
      "text": " We read of that, of course, in Genesis one, when God said, let us make man in our own"
    },
    {
      "id": 134,
      "start": 534.6199951171875,
      "end": 535.6199951171875,
      "text": " image."
    },
    {
      "id": 135,
      "start": 535.6199951171875,
      "end": 538.8599853515625,
      "text": " And of course, we understand and we've studied that in the past."
    },
    {
      "id": 136,
      "start": 538.8599853515625,
      "end": 545.0599975585938,
      "text": " Notice what the Bible tells us in Acts chapter number 17, in verse number 26, Paul is here"
    },
    {
      "id": 137,
      "start": 545.0599975585938,
      "end": 550.260009765625,
      "text": " in this situation and he is going, of course, to Athens and he's preaching there."
    },
    {
      "id": 138,
      "start": 550.260009765625,
      "end": 555.2999877929688,
      "text": " And we find that he saw a city that was wholly given to idolatry."
    },
    {
      "id": 139,
      "start": 555.2999877929688,
      "end": 560.9000244140625,
      "text": " And these people that served idols, they had a whole grove of them, if you will."
    },
    {
      "id": 140,
      "start": 560.9000244140625,
      "end": 565.280029296875,
      "text": " And we find that Paul mentioned that as he went through, he noticed that there was one"
    },
    {
      "id": 141,
      "start": 565.280029296875,
      "end": 569.1400146484375,
      "text": " with the inscription to the unknown God."
    },
    {
      "id": 142,
      "start": 569.1400146484375,
      "end": 573.9400024414062,
      "text": " And Paul says that you worship him ignorantly."
    },
    {
      "id": 143,
      "start": 573.9400024414062,
      "end": 577.7000122070312,
      "text": " And then he says this, him declare I unto you."
    },
    {
      "id": 144,
      "start": 577.7000122070312,
      "end": 583.02001953125,
      "text": " And then we begin noticing what Paul declares of this God, the Lord God, Jehovah, in verse"
    },
    {
      "id": 145,
      "start": 583.02001953125,
      "end": 590.1799926757812,
      "text": " number 24 of Acts 17, it says, God that made the world and all things therein, seeing that"
    },
    {
      "id": 146,
      "start": 590.1799926757812,
      "end": 595.4600219726562,
      "text": " he is Lord of heaven and earth, dwelleth not in temples made with hands."
    },
    {
      "id": 147,
      "start": 595.4600219726562,
      "end": 600.02001953125,
      "text": " Neither is worship with men's hands as though he needed anything, seeing he giveth to all"
    },
    {
      "id": 0,
      "start": 600.02001953125,
      "end": 605.8400197029114,
      "text": " life and breath and all things. And hath made of one blood all nations of men, for"
    },
    {
      "id": 1,
      "start": 605.8400197029114,
      "end": 610.52001953125,
      "text": " to dwell on all the face of the earth, and hath determined the times before"
    },
    {
      "id": 2,
      "start": 610.52001953125,
      "end": 616.2000198364258,
      "text": " appointed, and the bounds of their habitation.\" And so we find that Paul is"
    },
    {
      "id": 3,
      "start": 616.2000198364258,
      "end": 622.6800193786621,
      "text": " preaching to these idol worshipers, these individuals in Athens that had"
    },
    {
      "id": 4,
      "start": 622.6800193786621,
      "end": 627.5000190734863,
      "text": " this plurality of gods, and he says you have this one altar that has this"
    },
    {
      "id": 5,
      "start": 627.5000190734863,
      "end": 632.3800201416016,
      "text": " inscription to the unknown God, Him declare I unto you, and he begins to"
    },
    {
      "id": 6,
      "start": 632.3800201416016,
      "end": 637.1400184631348,
      "text": " share with the fact that he's creator, and then he deals with the fact of course"
    },
    {
      "id": 7,
      "start": 637.1400184631348,
      "end": 643.1400184631348,
      "text": " of the human race being of one blood, and we see that very plainly in the Bible. We"
    },
    {
      "id": 8,
      "start": 643.1400184631348,
      "end": 649.3400192260742,
      "text": " find the Bible record is accurate, and it is to be of course giving, it provides"
    },
    {
      "id": 9,
      "start": 649.3400192260742,
      "end": 654.2600212097168,
      "text": " for us a biblical worldview. Notice as we continue back in Genesis chapter number"
    },
    {
      "id": 10,
      "start": 654.2600212097168,
      "end": 658.3400192260742,
      "text": " nine, not only the replenishing of the earth, but notice the drunkenness of Noah."
    },
    {
      "id": 11,
      "start": 658.3400192260742,
      "end": 661.6600189208984,
      "text": " I'll be honest with you, it's a sad portion of Scripture when we read these"
    },
    {
      "id": 12,
      "start": 661.6600189208984,
      "end": 666.4200210571289,
      "text": " verses of Scripture. We find the the wonderful way in which we first were"
    },
    {
      "id": 13,
      "start": 666.4200210571289,
      "end": 671.140022277832,
      "text": " introduced to Noah, as I've mentioned already by way of introduction back in"
    },
    {
      "id": 14,
      "start": 671.140022277832,
      "end": 674.6600189208984,
      "text": " Genesis chapter number six, and now we come here to Genesis chapter number nine,"
    },
    {
      "id": 15,
      "start": 674.6600189208984,
      "end": 679.3800201416016,
      "text": " and the Bible tells us in verse number 20, and Noah began to be in husbandmen,"
    },
    {
      "id": 16,
      "start": 679.3800201416016,
      "end": 683.5400161743164,
      "text": " and he planted a vineyard. And so the Bible begins to share with us some"
    },
    {
      "id": 17,
      "start": 683.5400161743164,
      "end": 689.5000228881836,
      "text": " things with regard to the occupation of Noah, to the life of Noah. Again, there's"
    },
    {
      "id": 18,
      "start": 689.5000228881836,
      "end": 694.140022277832,
      "text": " just a few verses of Scripture that capture a lengthy period of history. As"
    },
    {
      "id": 19,
      "start": 694.140022277832,
      "end": 698.1000213623047,
      "text": " you get to the end of the text of Scripture, the Bible tells us in verse"
    },
    {
      "id": 20,
      "start": 698.1000213623047,
      "end": 704.0600204467773,
      "text": " 28 that Noah lived after the flood three hundred and fifty years. So obviously God"
    },
    {
      "id": 21,
      "start": 704.0600204467773,
      "end": 709.1800231933594,
      "text": " is not providing us with a diary of Noah's life, of all of the events and all"
    },
    {
      "id": 22,
      "start": 709.1800231933594,
      "end": 713.3800201416016,
      "text": " of the things that had transpired, but we find here that God is sharing this"
    },
    {
      "id": 23,
      "start": 713.3800201416016,
      "end": 718.2200164794922,
      "text": " singular event that took place in the life of Noah, and we find that as he"
    },
    {
      "id": 24,
      "start": 718.2200164794922,
      "end": 724.2200164794922,
      "text": " shares this event, he tells us that Noah had this occupation. He began to"
    },
    {
      "id": 25,
      "start": 724.2200164794922,
      "end": 728.2200164794922,
      "text": " be in husbandmen, he planted a vineyard. Notice in verse 21, and he drank of the"
    },
    {
      "id": 26,
      "start": 728.2200164794922,
      "end": 733.9000244140625,
      "text": " wine and was drunken. The Bible tells us this at the end of verse 21, and he was"
    },
    {
      "id": 27,
      "start": 733.9000244140625,
      "end": 741.02001953125,
      "text": " uncovered within his tent. Really, we could note the shame of Noah in verse"
    },
    {
      "id": 28,
      "start": 741.02001953125,
      "end": 747.6600189208984,
      "text": " number 21. I do not believe for a moment of time that Noah intended for this to"
    },
    {
      "id": 29,
      "start": 747.6600189208984,
      "end": 754.1800231933594,
      "text": " be the result of what he did. In fact, as we often would speak about alcohol and"
    },
    {
      "id": 30,
      "start": 754.1800231933594,
      "end": 759.1000213623047,
      "text": " we would deal with, you know, wine and alcoholic beverage and that sort of"
    },
    {
      "id": 31,
      "start": 759.1000213623047,
      "end": 763.3800201416016,
      "text": " thing, and we look at the biblical context, we can always find within the"
    },
    {
      "id": 32,
      "start": 763.3800201416016,
      "end": 769.9800262451172,
      "text": " context of whether the wine is an alcoholic wine or if it's the the fruit"
    },
    {
      "id": 33,
      "start": 769.9800262451172,
      "end": 774.8200225830078,
      "text": " of the vine, and we can always determine that contextually as to what takes"
    },
    {
      "id": 34,
      "start": 774.8200225830078,
      "end": 778.8200225830078,
      "text": " place. Here, very specifically, the Bible says that he was drunken. It's obviously"
    },
    {
      "id": 35,
      "start": 778.8200225830078,
      "end": 783.7800140380859,
      "text": " alcoholic wine in its nature, and then as we see the result, it says that he was"
    },
    {
      "id": 36,
      "start": 783.7800140380859,
      "end": 789.6600189208984,
      "text": " uncovered within his tent. There's shame that's associated with this activity"
    },
    {
      "id": 37,
      "start": 789.6600189208984,
      "end": 795.7000122070312,
      "text": " that God describes for us here in verse 21. Notice as we come to verse number 22"
    },
    {
      "id": 38,
      "start": 795.7800140380859,
      "end": 802.1000213623047,
      "text": " that God gives us the record of the actions of Ham. Of course, Noah has three"
    },
    {
      "id": 39,
      "start": 802.1000213623047,
      "end": 807.5800170898438,
      "text": " sons, Shem, Ham, and Japheth, and we notice here that the Bible tells us specifically"
    },
    {
      "id": 40,
      "start": 807.5800170898438,
      "end": 814.3800201416016,
      "text": " about Ham. It tells us this, that Ham—notice this again—the father of Canaan. Now, we"
    },
    {
      "id": 41,
      "start": 814.3800201416016,
      "end": 817.8600158691406,
      "text": " saw this back in verse number 18 when the Bible says the sons of Noah that went"
    },
    {
      "id": 42,
      "start": 817.8600158691406,
      "end": 823.1800231933594,
      "text": " forth of the ark were Shem and Ham and Japheth, and then it says this, and Ham is"
    },
    {
      "id": 43,
      "start": 823.1800231933594,
      "end": 829.4200134277344,
      "text": " the father of Canaan. We come to verse number 22, and it says, and Ham the father"
    },
    {
      "id": 44,
      "start": 829.4200134277344,
      "end": 833.7000122070312,
      "text": " of Canaan. Do you think God wants us to understand something about lineage? He"
    },
    {
      "id": 45,
      "start": 833.7000122070312,
      "end": 838.5000152587891,
      "text": " wants us to understand something about the genealogy here, and he mentions twice"
    },
    {
      "id": 46,
      "start": 838.5000152587891,
      "end": 843.0400238037109,
      "text": " within just a few verses of Scripture that Ham is the father of Canaan. We'll"
    },
    {
      "id": 47,
      "start": 843.0400238037109,
      "end": 847.3800201416016,
      "text": " get to that in just a few moments, but it is important to make that note. It then"
    },
    {
      "id": 48,
      "start": 847.3800201416016,
      "end": 851.9800262451172,
      "text": " continues to say this in verse number 22, that Ham saw the nakedness of his"
    },
    {
      "id": 49,
      "start": 851.9800262451172,
      "end": 857.5000305175781,
      "text": " father and told his two brethren without. I will be honest with you,"
    },
    {
      "id": 50,
      "start": 857.5000305175781,
      "end": 862.0600280761719,
      "text": " theologians have argued the point for generations as to what this means that"
    },
    {
      "id": 51,
      "start": 862.0600280761719,
      "end": 866.3400268554688,
      "text": " Ham did. The Bible doesn't tell specifically what Ham did. The Bible"
    },
    {
      "id": 52,
      "start": 866.3400268554688,
      "end": 871.7200317382812,
      "text": " simply reveals to us that he saw his father's nakedness and that he told his"
    },
    {
      "id": 53,
      "start": 871.7200317382812,
      "end": 877.3000183105469,
      "text": " two brethren. He did not seek to cover as Shem and Japheth will, and we'll notice"
    },
    {
      "id": 54,
      "start": 877.3000183105469,
      "end": 880.3800048828125,
      "text": " that in the next passage of Scripture and the next verse of Scripture, but we"
    },
    {
      "id": 55,
      "start": 880.4200134277344,
      "end": 887.02001953125,
      "text": " find that he, Ham, went in and he saw it, and then he went and told his brethren."
    },
    {
      "id": 56,
      "start": 887.02001953125,
      "end": 893.1800231933594,
      "text": " Shem and Japheth. We find that upon hearing the news of what had taken place,"
    },
    {
      "id": 57,
      "start": 893.1800231933594,
      "end": 899.4200134277344,
      "text": " of the shame, if you will, of Noah as he's in the tent after he had drunk in this"
    },
    {
      "id": 58,
      "start": 899.4200134277344,
      "end": 904.2200317382812,
      "text": " wine, that the Bible tells us that Shem and Japheth, in verse number 23, that they"
    },
    {
      "id": 59,
      "start": 904.2200317382812,
      "end": 908.2200317382812,
      "text": " took a garment. Notice what the Bible says, and they laid it upon both their"
    },
    {
      "id": 60,
      "start": 908.2200317382812,
      "end": 914.6600341796875,
      "text": " shoulders and went backward and covered the nakedness of their father, and their"
    },
    {
      "id": 61,
      "start": 914.6600341796875,
      "end": 920.4200134277344,
      "text": " faces were backward and they saw not their father's nakedness. We find that"
    },
    {
      "id": 62,
      "start": 920.4200134277344,
      "end": 925.8600158691406,
      "text": " these two boys, they find the entrance to the tent, we'll pretend that it's"
    },
    {
      "id": 63,
      "start": 925.8600158691406,
      "end": 931.5400085449219,
      "text": " here, and they get here side by side and they put a, the Bible tells us here in"
    },
    {
      "id": 64,
      "start": 931.5400085449219,
      "end": 936.5000305175781,
      "text": " verse number 22, excuse me, 23, they put a garment upon their shoulders and they"
    },
    {
      "id": 65,
      "start": 936.5800170898438,
      "end": 941.4200134277344,
      "text": " walked backwards into the tent to cover the nakedness of their father so that"
    },
    {
      "id": 66,
      "start": 941.4200134277344,
      "end": 949.8200073242188,
      "text": " they did not see it. We find that there was a difference in action between what"
    },
    {
      "id": 67,
      "start": 949.8200073242188,
      "end": 954.4200134277344,
      "text": " the Bible records for us of Ham and what the Bible records for us with regard to"
    },
    {
      "id": 68,
      "start": 954.4200134277344,
      "end": 958.6600341796875,
      "text": " Shem and Japheth, and we find that the Bible then tells us that Noah awoke in"
    },
    {
      "id": 69,
      "start": 958.6600341796875,
      "end": 965.1000061035156,
      "text": " verse number 24. He woke from his wine, and the Bible says that he knew what his"
    },
    {
      "id": 70,
      "start": 965.1000061035156,
      "end": 971.4600219726562,
      "text": " younger son had done unto him. He was aware of that which had transpired, he"
    },
    {
      "id": 71,
      "start": 971.4600219726562,
      "end": 978.6600341796875,
      "text": " was aware of what had taken place when he was within his tent. We find that he"
    },
    {
      "id": 72,
      "start": 978.6600341796875,
      "end": 985.8600158691406,
      "text": " then, as he has this understanding of the events, God records for us in verses 25"
    },
    {
      "id": 73,
      "start": 985.8600158691406,
      "end": 991.6600341796875,
      "text": " through 27, if you're taking notes, number three, the prophecy of Noah. As we look at"
    },
    {
      "id": 74,
      "start": 991.6600341796875,
      "end": 995.4600219726562,
      "text": " the prophecy of Noah, we break down these verses of Scripture in verses 25"
    },
    {
      "id": 75,
      "start": 995.4600219726562,
      "end": 999.780029296875,
      "text": " through 27, it actually becomes a little bit clearer as to what happens not only"
    },
    {
      "id": 76,
      "start": 999.780029296875,
      "end": 1005.8200073242188,
      "text": " here in Genesis 9, but you'll be familiar with this taking place later in the life"
    },
    {
      "id": 77,
      "start": 1005.8200073242188,
      "end": 1009.9800109863281,
      "text": " of Jacob. Remember when he calls all of his boys around in Genesis chapter"
    },
    {
      "id": 78,
      "start": 1009.9800109863281,
      "end": 1013.8200073242188,
      "text": " number 49, and he's going to give the blessings to all of his sons, and he goes"
    },
    {
      "id": 79,
      "start": 1013.8200073242188,
      "end": 1018.5400085449219,
      "text": " through and he lists each of the sons and he speaks about them and so on and so"
    },
    {
      "id": 80,
      "start": 1018.5400085449219,
      "end": 1023.9000244140625,
      "text": " forth, and we find here that as Noah, the prophecy of Noah is recorded for us in"
    },
    {
      "id": 81,
      "start": 1023.9000244140625,
      "end": 1030.3400268554688,
      "text": " verses 25 through 27. Now it begins in verse number 25 with dealing, and here's"
    },
    {
      "id": 82,
      "start": 1030.3400268554688,
      "end": 1039.9000244140625,
      "text": " what it says, and he said, Cursed be Canaan, a servant of servants shall he be"
    },
    {
      "id": 83,
      "start": 1039.9000244140625,
      "end": 1047.5800170898438,
      "text": " unto his brethren. We understand that as this prophecy of Noah is recorded for us"
    },
    {
      "id": 84,
      "start": 1047.5800170898438,
      "end": 1053.4200134277344,
      "text": " here in verses 25 through 27, that it begins with a curse. We'll find that"
    },
    {
      "id": 85,
      "start": 1053.4200134277344,
      "end": 1056.9800109863281,
      "text": " there's a blessing and an enlargement that is mentioned in verses 26 and 27,"
    },
    {
      "id": 86,
      "start": 1056.9800109863281,
      "end": 1061.5400085449219,
      "text": " but it begins with this curse. It says, Cursed be Canaan. Notice again, if we go"
    },
    {
      "id": 87,
      "start": 1061.5400085449219,
      "end": 1065.2200317382812,
      "text": " back into the text of Scripture, that we've made note that the Bible says that"
    },
    {
      "id": 88,
      "start": 1065.2200317382812,
      "end": 1070.8200073242188,
      "text": " Ham is the father of Canaan, that Ham is the one that went in and saw the"
    },
    {
      "id": 89,
      "start": 1070.8200073242188,
      "end": 1075.5400085449219,
      "text": " nakedness of his father. He saw the shame. Noah was aware of what had taken place."
    },
    {
      "id": 90,
      "start": 1075.6600341796875,
      "end": 1079.8600158691406,
      "text": " He knew what his younger son had done unto him, and it says, Cursed be Canaan."
    },
    {
      "id": 91,
      "start": 1079.8600158691406,
      "end": 1084.6600341796875,
      "text": " You understand that the curse that is mentioned here in chapter number 9"
    },
    {
      "id": 92,
      "start": 1084.6600341796875,
      "end": 1091.9600219726562,
      "text": " and verse number 25 is not on all of the descendants of Ham, rather upon the"
    },
    {
      "id": 93,
      "start": 1091.9600219726562,
      "end": 1096.7000122070312,
      "text": " descendants of Canaan. It's important for us to note that. There are some, by the"
    },
    {
      "id": 94,
      "start": 1096.7000122070312,
      "end": 1102.6600341796875,
      "text": " way, that have misapplied and misgiven the interpretation of this passage of"
    },
    {
      "id": 95,
      "start": 1102.6600341796875,
      "end": 1110.3000183105469,
      "text": " Scripture to say something that it does not say. Notice, he says, Cursed be Canaan,"
    },
    {
      "id": 96,
      "start": 1110.3000183105469,
      "end": 1114.5,
      "text": " and he says this, A servant of servants shall he be unto his brethren. It's"
    },
    {
      "id": 97,
      "start": 1114.5,
      "end": 1118.0599975585938,
      "text": " interesting, at the end of verse number 26 and at the end of verse number 27, it"
    },
    {
      "id": 98,
      "start": 1118.0599975585938,
      "end": 1124.1799926757812,
      "text": " says, And Canaan shall be his servant. And Canaan shall be a servant. Can I tell"
    },
    {
      "id": 99,
      "start": 1124.1799926757812,
      "end": 1127.6600341796875,
      "text": " you that the Canaanites were known for their wickedness and their"
    },
    {
      "id": 100,
      "start": 1127.6600341796875,
      "end": 1133.3400268554688,
      "text": " immorality. As you study the Scriptures and begin to see all that transpires, as"
    },
    {
      "id": 101,
      "start": 1133.3400268554688,
      "end": 1136.02001953125,
      "text": " you begin to see the interactions between the children of Israel and the"
    },
    {
      "id": 102,
      "start": 1136.02001953125,
      "end": 1139.9400024414062,
      "text": " Canaanites, in fact, even within the book of Genesis, you see references to the"
    },
    {
      "id": 103,
      "start": 1139.9400024414062,
      "end": 1144.9000244140625,
      "text": " Canaanites, you see they are known for their wickedness and their"
    },
    {
      "id": 104,
      "start": 1144.9000244140625,
      "end": 1149.1799926757812,
      "text": " immorality. We find that in Genesis chapter number 10, turn over there if you"
    },
    {
      "id": 105,
      "start": 1149.1799926757812,
      "end": 1153.1400146484375,
      "text": " will and look at verses 15 through 19, it's important for us to note this"
    },
    {
      "id": 106,
      "start": 1153.1400146484375,
      "end": 1157.9000244140625,
      "text": " because the Bible says, Cursed be Canaan, and we find that in Genesis 10 verses"
    },
    {
      "id": 107,
      "start": 1157.9000244140625,
      "end": 1163.6199951171875,
      "text": " 15 through 19 that God provides us with a list of the descendants of Canaan."
    },
    {
      "id": 108,
      "start": 1163.6199951171875,
      "end": 1170.5400390625,
      "text": " Again, this prophecy of Noah is not on all of the descendants of Ham, it's"
    },
    {
      "id": 109,
      "start": 1170.5400390625,
      "end": 1177.1400146484375,
      "text": " simply on the Canaanites. Notice in verse number 15 of Genesis 10, And Canaan"
    },
    {
      "id": 110,
      "start": 1177.1400146484375,
      "end": 1183.7000122070312,
      "text": " begat Sidon his firstborn in Heth, and the Jebusite, and the Amorite, and the"
    },
    {
      "id": 111,
      "start": 1183.7000122070312,
      "end": 1189.9800415039062,
      "text": " Gergesite, and the Hivite, and the Archite, and the Sinite, and the Arvidite, and the"
    },
    {
      "id": 112,
      "start": 1189.9800415039062,
      "end": 1195.1400146484375,
      "text": " Zemurite, and the Hamathite, and afterward were the families of the Canaanites"
    },
    {
      "id": 113,
      "start": 1195.1400146484375,
      "end": 1202.0599975585938,
      "text": " spread abroad. Verse 19, And the border of the Canaanites was from Sidon"
    },
    {
      "id": 0,
      "start": 1202.0599975585938,
      "end": 1207.8599977493286,
      "text": " as thou goest to Gerir, unto Gaza, as thou goest unto Sodom, and Gomorrah, and"
    },
    {
      "id": 1,
      "start": 1207.8599977493286,
      "end": 1213.9399976730347,
      "text": " Admah, and Zeboiim, even unto Lasha.\" In fact, as you read the book of Joshua, as"
    },
    {
      "id": 2,
      "start": 1213.9399976730347,
      "end": 1218.379997253418,
      "text": " we've been studying the book of Joshua, you'll note many of those places and"
    },
    {
      "id": 3,
      "start": 1218.379997253418,
      "end": 1224.6199970245361,
      "text": " many of those names are found within the context of the book of Joshua. We find"
    },
    {
      "id": 4,
      "start": 1224.6199970245361,
      "end": 1228.6399974822998,
      "text": " here that, as we would think about this curse that's been placed upon Canaan,"
    },
    {
      "id": 5,
      "start": 1228.6399974822998,
      "end": 1234.03999710083,
      "text": " this prophecy more than a curse, and we think about it as a prophecy in the"
    },
    {
      "id": 6,
      "start": 1234.03999710083,
      "end": 1239.9199981689453,
      "text": " sense of, yes, it says, curse it be Canaan, we understand that, but what we find that"
    },
    {
      "id": 7,
      "start": 1239.9199981689453,
      "end": 1244.5199966430664,
      "text": " is happening is Noah is giving this prophecy with regard to the descendants,"
    },
    {
      "id": 8,
      "start": 1244.5199966430664,
      "end": 1251.1199989318848,
      "text": " the wickedness that he saw in Ham, he would see it fully"
    },
    {
      "id": 9,
      "start": 1251.1199989318848,
      "end": 1257.1999969482422,
      "text": " gone in Canaan, his son. And we find that in Genesis chapter 15, let's take a"
    },
    {
      "id": 10,
      "start": 1257.1999969482422,
      "end": 1260.8399963378906,
      "text": " walk through some scripture here and look at some things with regard to the"
    },
    {
      "id": 11,
      "start": 1260.8399963378906,
      "end": 1266.3199996948242,
      "text": " Canaanites. In Genesis chapter number 15, we often look at the passage of"
    },
    {
      "id": 12,
      "start": 1266.3199996948242,
      "end": 1270.6399993896484,
      "text": " scripture and we deal with this wonderful promise of the Abrahamic"
    },
    {
      "id": 13,
      "start": 1270.6399993896484,
      "end": 1275.7200012207031,
      "text": " covenant, and what a great promise it is, what a great truth of God's Word, and we"
    },
    {
      "id": 14,
      "start": 1275.7200012207031,
      "end": 1279.1399993896484,
      "text": " think about the covenant, we've mentioned, even as we've studied through the book"
    },
    {
      "id": 15,
      "start": 1279.1399993896484,
      "end": 1286.0,
      "text": " of Hebrews, that the promise is of a land and of a seed, right? Abraham never"
    },
    {
      "id": 16,
      "start": 1286.0799942016602,
      "end": 1292.479995727539,
      "text": " actually possessed the land that was promised. We find that the seed that"
    },
    {
      "id": 17,
      "start": 1292.479995727539,
      "end": 1298.759994506836,
      "text": " was promised, he did have that son from he and Sarah, Isaac, and we find here that"
    },
    {
      "id": 18,
      "start": 1298.759994506836,
      "end": 1303.0400009155273,
      "text": " the Bible tells us in chapter number 15 and verse number 16, notice what God"
    },
    {
      "id": 19,
      "start": 1303.0400009155273,
      "end": 1308.379997253418,
      "text": " says, let me back up to verse number 12, and when the sun was going down, a deep"
    },
    {
      "id": 20,
      "start": 1308.379997253418,
      "end": 1313.0,
      "text": " sleep fell upon Abram, and lo and horror of great darkness fell upon him. And he"
    },
    {
      "id": 21,
      "start": 1313.0,
      "end": 1316.5599975585938,
      "text": " said unto Abram, know of a surety that thy seed shall be a stranger in a land"
    },
    {
      "id": 22,
      "start": 1316.5599975585938,
      "end": 1320.759994506836,
      "text": " that is not theirs, and shall serve them, and they shall afflict them four hundred"
    },
    {
      "id": 23,
      "start": 1320.759994506836,
      "end": 1326.479995727539,
      "text": " years. And also that nation whom they shall serve will I judge, and afterward"
    },
    {
      "id": 24,
      "start": 1326.479995727539,
      "end": 1331.1600036621094,
      "text": " shall they come out with great substance. Knowing the entirety of scripture, does"
    },
    {
      "id": 25,
      "start": 1331.1600036621094,
      "end": 1335.0800018310547,
      "text": " this not sound familiar to you, as to the time in which the children of Israel"
    },
    {
      "id": 26,
      "start": 1335.0800018310547,
      "end": 1340.7200012207031,
      "text": " would spend in Egypt, and they of course would be delivered after the tenth plague,"
    },
    {
      "id": 27,
      "start": 1340.759994506836,
      "end": 1344.479995727539,
      "text": " the death of the firstborn, the Passover, and they would come out with great"
    },
    {
      "id": 28,
      "start": 1344.479995727539,
      "end": 1348.3999938964844,
      "text": " substance. But notice in verse 15, and thou shalt go to thy fathers in peace,"
    },
    {
      "id": 29,
      "start": 1348.3999938964844,
      "end": 1352.479995727539,
      "text": " thou shalt be buried in a good old age, but in the fourth generation they shall"
    },
    {
      "id": 30,
      "start": 1352.479995727539,
      "end": 1358.0800018310547,
      "text": " come hither again, notice, for the iniquity of the Amorites is not yet full."
    },
    {
      "id": 31,
      "start": 1358.0800018310547,
      "end": 1364.9599914550781,
      "text": " And we find here in verse number 16, as God would use this phraseology of the"
    },
    {
      "id": 32,
      "start": 1364.9599914550781,
      "end": 1370.0,
      "text": " iniquity of the Amorites, what he's meaning is all of the Canaanite tribes"
    },
    {
      "id": 33,
      "start": 1370.0,
      "end": 1374.1600036621094,
      "text": " that were in that region. And we'd understand as he's speaking about all of"
    },
    {
      "id": 34,
      "start": 1374.1600036621094,
      "end": 1377.6399993896484,
      "text": " the Canaanite tribes that are within that region, again, as you look at the"
    },
    {
      "id": 35,
      "start": 1377.6399993896484,
      "end": 1381.8800048828125,
      "text": " sons of Canaan, and you look and you notate the names that are given there in"
    },
    {
      "id": 36,
      "start": 1381.8800048828125,
      "end": 1387.8800048828125,
      "text": " Genesis chapter number 10, you find that many of them occupied that land when the"
    },
    {
      "id": 37,
      "start": 1387.8800048828125,
      "end": 1392.239990234375,
      "text": " children of Israel, led by Joshua, would come in to inhabit the land. Now what"
    },
    {
      "id": 38,
      "start": 1392.239990234375,
      "end": 1396.479995727539,
      "text": " happened? We know that God gave the commandment that they were to go in and"
    },
    {
      "id": 39,
      "start": 1396.479995727539,
      "end": 1399.759994506836,
      "text": " they were to conquer the land, right? That's what they were told to do. They"
    },
    {
      "id": 40,
      "start": 1399.759994506836,
      "end": 1404.4400024414062,
      "text": " were to go in and they were to conquer the land and then inhabit the land. The"
    },
    {
      "id": 41,
      "start": 1404.4400024414062,
      "end": 1408.1600036621094,
      "text": " question that we'd ask is, did they destroy all the Canaanites? The answer is"
    },
    {
      "id": 42,
      "start": 1408.1600036621094,
      "end": 1414.3999938964844,
      "text": " no, they did not. Look over, if you will, at Joshua chapter number 16 and notice"
    },
    {
      "id": 43,
      "start": 1414.3999938964844,
      "end": 1420.520004272461,
      "text": " what God shows us here in the portion of Scripture. Now remember, this prophecy of"
    },
    {
      "id": 44,
      "start": 1420.520004272461,
      "end": 1424.1999969482422,
      "text": " Noah back in Genesis chapter number 9, he says,"
    },
    {
      "id": 45,
      "start": 1425.1999969482422,
      "end": 1432.8399963378906,
      "text": " Notice, a servant of servants shall he be unto his brethren. In Joshua"
    },
    {
      "id": 46,
      "start": 1432.8399963378906,
      "end": 1438.9599914550781,
      "text": " chapter number 16, in verse number 10, notice what the Bible says. This is"
    },
    {
      "id": 47,
      "start": 1438.9599914550781,
      "end": 1443.3999938964844,
      "text": " speaking of the lot for the inheritance of the children of Joseph, Ephraim,"
    },
    {
      "id": 48,
      "start": 1443.3999938964844,
      "end": 1447.9599914550781,
      "text": " specifically dealing with the tribe of Ephraim, the Ephraimites. It says this in"
    },
    {
      "id": 49,
      "start": 1447.9599914550781,
      "end": 1453.8000030517578,
      "text": " verse number 10, and they drave not out the Canaanites that dwelt in Gezer."
    },
    {
      "id": 50,
      "start": 1453.8000030517578,
      "end": 1461.1199951171875,
      "text": " Notice, but the Canaanites dwell among the Ephraimites unto this day, and what"
    },
    {
      "id": 51,
      "start": 1461.1199951171875,
      "end": 1468.1199951171875,
      "text": " does it say? And serve under tribute. And serve under tribute. What did he say? A"
    },
    {
      "id": 52,
      "start": 1468.1199951171875,
      "end": 1475.0400085449219,
      "text": " servant of servants. Chapter 17, notice in verse number 12, the Bible says here,"
    },
    {
      "id": 53,
      "start": 1475.1199951171875,
      "end": 1479.3999938964844,
      "text": " speaking of the half-tribe of Manasseh, yet the children of Manasseh could not"
    },
    {
      "id": 54,
      "start": 1479.3999938964844,
      "end": 1483.9599914550781,
      "text": " drive out the inhabitants of those cities, but the Canaanites would dwell in"
    },
    {
      "id": 55,
      "start": 1483.9599914550781,
      "end": 1488.239990234375,
      "text": " that land. Yet it came to pass when the children of Israel were waxen strong"
    },
    {
      "id": 56,
      "start": 1488.239990234375,
      "end": 1496.6799926757812,
      "text": " that they put the Canaanites to tribute, but did not utterly drive them out. We"
    },
    {
      "id": 57,
      "start": 1496.6799926757812,
      "end": 1504.3200073242188,
      "text": " find that the descendants of Ham, specifically being the father of Canaan"
    },
    {
      "id": 58,
      "start": 1504.3200073242188,
      "end": 1510.2000122070312,
      "text": " and dealing with this prophecy, he says, cursed be Canaan a servant of servants"
    },
    {
      "id": 59,
      "start": 1510.2000122070312,
      "end": 1516.0,
      "text": " shall he be unto his brethren, and we see exactly that coming to pass in the book"
    },
    {
      "id": 60,
      "start": 1516.0,
      "end": 1520.239990234375,
      "text": " of Joshua. In fact, if you turn to the book of Judges in the first chapter,"
    },
    {
      "id": 61,
      "start": 1520.239990234375,
      "end": 1525.5599975585938,
      "text": " notice what God records for us here. Again, recording some of what we just"
    },
    {
      "id": 62,
      "start": 1525.5599975585938,
      "end": 1532.8399963378906,
      "text": " read in Joshua 16 and 17, notice how the writer notes it here in Judges 1. Judges"
    },
    {
      "id": 63,
      "start": 1532.8399963378906,
      "end": 1536.4400024414062,
      "text": " chapter number 1, beginning in verse number 27, it says, neither did Manasseh"
    },
    {
      "id": 64,
      "start": 1536.4400024414062,
      "end": 1541.1600036621094,
      "text": " drive out the inhabitants of Bethshean and her towns, nor Panach and her towns,"
    },
    {
      "id": 65,
      "start": 1541.1600036621094,
      "end": 1545.7200012207031,
      "text": " nor the inhabitants of Dor and her towns, nor the inhabitants of Iblim and her"
    },
    {
      "id": 66,
      "start": 1545.7200012207031,
      "end": 1550.3599853515625,
      "text": " towns, nor the inhabitants of Megiddo and her towns, but the Canaanites would dwell"
    },
    {
      "id": 67,
      "start": 1550.3599853515625,
      "end": 1554.7200012207031,
      "text": " in that land. Verse 28, and it came to pass when Israel was strong that they"
    },
    {
      "id": 68,
      "start": 1554.7200012207031,
      "end": 1559.4800109863281,
      "text": " put the Canaanites to tribute, but did not, and did not, excuse me, utterly drive"
    },
    {
      "id": 69,
      "start": 1559.6399841308594,
      "end": 1563.3200073242188,
      "text": " them out. Neither did Ephraim drive out the Canaanites that dwelt in Gizir, but"
    },
    {
      "id": 70,
      "start": 1563.3200073242188,
      "end": 1567.3999938964844,
      "text": " the Canaanites dwelt in Gizir among them. Neither did Zebulun drive out the"
    },
    {
      "id": 71,
      "start": 1567.3999938964844,
      "end": 1571.5199890136719,
      "text": " inhabitants of Kitron, nor the inhabitants of Nahalal, but the Canaanites"
    },
    {
      "id": 72,
      "start": 1571.5199890136719,
      "end": 1576.3200073242188,
      "text": " dwell among them and became tributaries. Neither did Asher drive out the"
    },
    {
      "id": 73,
      "start": 1576.3200073242188,
      "end": 1582.5199890136719,
      "text": " inhabitants of Akot, nor the inhabitants of Zidon, nor of Elab, nor of Exib, nor of"
    },
    {
      "id": 74,
      "start": 1582.5199890136719,
      "end": 1588.6000061035156,
      "text": " Helba, nor of Aphic, nor of Reho, but the Asherites dwelt among the Canaanites, the"
    },
    {
      "id": 75,
      "start": 1588.6000061035156,
      "end": 1593.0799865722656,
      "text": " inhabitants of the land, for they did not drive them out. Neither did Naphtali"
    },
    {
      "id": 76,
      "start": 1593.0799865722656,
      "end": 1596.8800048828125,
      "text": " drive out the inhabitants of Beth Shemesh, nor the inhabitants of Beth"
    },
    {
      "id": 77,
      "start": 1596.8800048828125,
      "end": 1601.7200012207031,
      "text": " Anath, but it says he dwelt among the Canaanites, the inhabitants of the"
    },
    {
      "id": 78,
      "start": 1601.7200012207031,
      "end": 1605.9599914550781,
      "text": " land. Nevertheless, the inhabitants of Beth Shemesh and of Beth Anath became"
    },
    {
      "id": 79,
      "start": 1605.9599914550781,
      "end": 1611.3999938964844,
      "text": " tributaries unto them. We find that the Bible tells us in verse number 34, and"
    },
    {
      "id": 80,
      "start": 1611.3999938964844,
      "end": 1615.0400085449219,
      "text": " the Amorites forced the children of Dan into the mountain, for they would not"
    },
    {
      "id": 81,
      "start": 1615.0400085449219,
      "end": 1618.4400024414062,
      "text": " suffer them to come down to the valley, but the Amorites would dwell in Mount"
    },
    {
      "id": 82,
      "start": 1618.5599975585938,
      "end": 1623.4800109863281,
      "text": " Heres and Ajalon, and then shelled them, and the hand of the house of Joseph"
    },
    {
      "id": 83,
      "start": 1623.4800109863281,
      "end": 1629.1600036621094,
      "text": " prevailed, so they became tributaries. And the coast of the Amorites was from the"
    },
    {
      "id": 84,
      "start": 1629.1600036621094,
      "end": 1634.4800109863281,
      "text": " going up to Acribim, from the rock and upward. You notice several times within"
    },
    {
      "id": 85,
      "start": 1634.4800109863281,
      "end": 1638.5199890136719,
      "text": " the passage in Judges chapter number 1, the Bible mentions the Canaanites"
    },
    {
      "id": 86,
      "start": 1638.5199890136719,
      "end": 1643.9599914550781,
      "text": " dwelling there and being under tribute, being servants. They would have this"
    },
    {
      "id": 87,
      "start": 1643.9599914550781,
      "end": 1648.3200073242188,
      "text": " thing of paying taxes and what have you, and really it became this idea, it's very"
    },
    {
      "id": 88,
      "start": 1648.3200073242188,
      "end": 1652.2799987792969,
      "text": " interesting, the Bible says that when Israel was strong, that they put the"
    },
    {
      "id": 89,
      "start": 1652.2799987792969,
      "end": 1657.0400085449219,
      "text": " Canaanites to tribute. In fact, you'll find various interactions throughout the"
    },
    {
      "id": 90,
      "start": 1657.0400085449219,
      "end": 1661.3599853515625,
      "text": " the Old Testament with regard to this people group, the Canaanites as they're"
    },
    {
      "id": 91,
      "start": 1661.3599853515625,
      "end": 1665.2799987792969,
      "text": " referred to as, but you find that when Israel was strong, they would put them"
    },
    {
      "id": 92,
      "start": 1665.2799987792969,
      "end": 1670.6799926757812,
      "text": " to tribute, they would be a servant of servants. In 1 Kings chapter number 9,"
    },
    {
      "id": 93,
      "start": 1670.6799926757812,
      "end": 1675.1199951171875,
      "text": " we'll finish up with this particular passage of Scripture dealing with this"
    },
    {
      "id": 94,
      "start": 1675.1600036621094,
      "end": 1681.4800109863281,
      "text": " first aspect of the prophecy of Noah. In 1 Kings chapter number 9, in verses 20"
    },
    {
      "id": 95,
      "start": 1681.4800109863281,
      "end": 1694.3999938964844,
      "text": " and 21. In 1 Kings 9, now think about this, the amount of time that has passed, we go"
    },
    {
      "id": 96,
      "start": 1694.3999938964844,
      "end": 1699.6000061035156,
      "text": " all the way now to the time of Solomon, and it tells us in the beginning of the"
    },
    {
      "id": 97,
      "start": 1699.6000061035156,
      "end": 1703.6799926757812,
      "text": " passage in verse number 1, and it came to pass when Solomon had finished the"
    },
    {
      "id": 98,
      "start": 1703.6799926757812,
      "end": 1707.2799987792969,
      "text": " building of the house of the Lord, and the king's house, and all Solomon's"
    },
    {
      "id": 99,
      "start": 1707.2799987792969,
      "end": 1711.6799926757812,
      "text": " desire, which he was pleased to do. Now, that's a long period of time from"
    },
    {
      "id": 100,
      "start": 1711.6799926757812,
      "end": 1717.52001953125,
      "text": " Genesis chapter number 9, and this prophecy of Noah. We see the entrance"
    },
    {
      "id": 101,
      "start": 1717.52001953125,
      "end": 1721.2000122070312,
      "text": " into the land, and the way in which the Canaanites became servants, and they were"
    },
    {
      "id": 102,
      "start": 1721.2000122070312,
      "end": 1725.4000244140625,
      "text": " under tribute, and we've read all of those things, and we now fast forward through"
    },
    {
      "id": 103,
      "start": 1725.4000244140625,
      "end": 1730.6799926757812,
      "text": " the period of the judges, and we get through the period of course of Saul"
    },
    {
      "id": 104,
      "start": 1730.760009765625,
      "end": 1735.7999877929688,
      "text": " reigning as king, and David reigning as king, and now we find that Solomon is"
    },
    {
      "id": 105,
      "start": 1735.7999877929688,
      "end": 1740.52001953125,
      "text": " king, he's built the temple. The Bible tells us here in the passage of Scripture"
    },
    {
      "id": 106,
      "start": 1740.52001953125,
      "end": 1744.7999877929688,
      "text": " some things about Tyre, and so on and so forth, but look in verse number 20, the"
    },
    {
      "id": 107,
      "start": 1744.7999877929688,
      "end": 1748.3200073242188,
      "text": " Bible says, and all the people that were left of the Amorites, Hittites, Perizzites,"
    },
    {
      "id": 108,
      "start": 1748.3200073242188,
      "end": 1753.5999755859375,
      "text": " Hivites, and Jebusites, which were not of the children of Israel, their children"
    },
    {
      "id": 109,
      "start": 1753.5999755859375,
      "end": 1757.8800048828125,
      "text": " that were left after them in the land, whom the children of Israel also were"
    },
    {
      "id": 110,
      "start": 1757.8800048828125,
      "end": 1764.760009765625,
      "text": " not able utterly to destroy, upon those did Solomon levy a tribute of bond"
    },
    {
      "id": 111,
      "start": 1764.760009765625,
      "end": 1773.3200073242188,
      "text": " service unto this day. And so we find that this prophecy of Noah that is given"
    },
    {
      "id": 112,
      "start": 1773.3200073242188,
      "end": 1779.6799926757812,
      "text": " to us in Genesis chapter number 9, as we trace a course throughout this portion"
    },
    {
      "id": 113,
      "start": 1779.6799926757812,
      "end": 1785.47998046875,
      "text": " of Old Testament biblical history, we see that it came to pass just as God said it"
    },
    {
      "id": 114,
      "start": 1785.52001953125,
      "end": 1791.52001953125,
      "text": " would, through this prophecy that Noah made here in Genesis chapter 9, verse 25,"
    },
    {
      "id": 115,
      "start": 1791.52001953125,
      "end": 1797.719970703125,
      "text": " with regard to the Canaanites. Again, it's important that we understand that he's"
    },
    {
      "id": 116,
      "start": 1797.719970703125,
      "end": 1801.9600219726562,
      "text": " not speaking about all of the descendants of Ham. In fact, as you get"
    },
    {
      "id": 117,
      "start": 1801.9600219726562,
      "end": 1804.4600219726562,
      "text": " into Genesis chapter 9, verse 25, we see that he's speaking about the descendants of Ham."
    },
    {
      "id": 0,
      "start": 1804.4600219726562,
      "end": 1808.120022058487,
      "text": " to chapter number 10 and you begin to read about the sons of Ham, you start"
    },
    {
      "id": 1,
      "start": 1808.120022058487,
      "end": 1812.3200221061707,
      "text": " reading in chapter number six, excuse me, in verse number six about the sons of"
    },
    {
      "id": 2,
      "start": 1812.3200221061707,
      "end": 1818.1600217819214,
      "text": " Ham, Cush and Mithraim and Put and Canaan. Canaan wasn't his only son, it was his"
    },
    {
      "id": 3,
      "start": 1818.1600217819214,
      "end": 1822.5200214385986,
      "text": " youngest son and it was the one in which this curse would be upon that they would"
    },
    {
      "id": 4,
      "start": 1822.5200214385986,
      "end": 1828.7600212097168,
      "text": " be again a prophecy that they would be servants of servants unto his brethren."
    },
    {
      "id": 5,
      "start": 1828.7600212097168,
      "end": 1832.8000221252441,
      "text": " Notice as we move forward through the prophecy we come back to Genesis chapter"
    },
    {
      "id": 6,
      "start": 1832.8000221252441,
      "end": 1838.4400215148926,
      "text": " 9 and we look to verse number 26 and the Bible says this, and he said, Noah"
    },
    {
      "id": 7,
      "start": 1838.4400215148926,
      "end": 1843.48002243042,
      "text": " again continuing to speak, he said, blessed be the Lord God of Shem and"
    },
    {
      "id": 8,
      "start": 1843.48002243042,
      "end": 1850.4000205993652,
      "text": " Canaan shall be his servant. He says blessed be the Lord God of Shem. It's"
    },
    {
      "id": 9,
      "start": 1850.4000205993652,
      "end": 1855.0000228881836,
      "text": " interesting for we would mention the fact that of course the Jews are"
    },
    {
      "id": 10,
      "start": 1855.0000228881836,
      "end": 1860.4400215148926,
      "text": " Semitic and they come through the line of Shem and we would find that this"
    },
    {
      "id": 11,
      "start": 1860.4400215148926,
      "end": 1866.080020904541,
      "text": " would be the Messianic line as we speak of. Now, we understand the blessing when"
    },
    {
      "id": 12,
      "start": 1866.080020904541,
      "end": 1869.640022277832,
      "text": " we would consider that truth, amen, and we would understand the blessing."
    },
    {
      "id": 13,
      "start": 1869.640022277832,
      "end": 1873.6000213623047,
      "text": " Remember, even as he would give that blessing to Abraham and he would talk"
    },
    {
      "id": 14,
      "start": 1873.6000213623047,
      "end": 1878.4400253295898,
      "text": " about the seed and we find the fulfillment in Galatians very plainly"
    },
    {
      "id": 15,
      "start": 1878.4400253295898,
      "end": 1884.0000228881836,
      "text": " that Paul speaks about the seed, singular, he didn't say seeds, he said seed, this is"
    },
    {
      "id": 16,
      "start": 1884.0000228881836,
      "end": 1889.4800186157227,
      "text": " Christ, and he mentions how that we are the descendants of Abraham, how? Through"
    },
    {
      "id": 17,
      "start": 1889.4800186157227,
      "end": 1896.4000244140625,
      "text": " faith. And we find the blessing that is here, blessed be the Lord God of Shem,"
    },
    {
      "id": 18,
      "start": 1896.4000244140625,
      "end": 1901.4800186157227,
      "text": " dealing with the fact that the Jews are Semitic, the Messianic line is no doubt"
    },
    {
      "id": 19,
      "start": 1901.4800186157227,
      "end": 1907.7200241088867,
      "text": " in view within the prophecy that is recorded here in verse number 26. We then"
    },
    {
      "id": 20,
      "start": 1907.7200241088867,
      "end": 1913.4800186157227,
      "text": " come to verse number 27 and we find the Bible continues and says, God shall"
    },
    {
      "id": 21,
      "start": 1913.4800186157227,
      "end": 1919.0000228881836,
      "text": " enlarge Japheth and he shall dwell in the tents of Shem and Canaan shall be"
    },
    {
      "id": 22,
      "start": 1919.0000228881836,
      "end": 1923.640022277832,
      "text": " his servant. We've dealt with the subject of Canaan in each of these situations. It's"
    },
    {
      "id": 23,
      "start": 1923.640022277832,
      "end": 1927.52001953125,
      "text": " interesting that we find here when he speaks about Japheth, he says God shall"
    },
    {
      "id": 24,
      "start": 1927.52001953125,
      "end": 1934.1200256347656,
      "text": " enlarge Japheth. And we can think about and consider the territorial ways in"
    },
    {
      "id": 25,
      "start": 1934.1200256347656,
      "end": 1938.2000274658203,
      "text": " which the descendants of Japheth went, so on and so forth, and it's kind of an"
    },
    {
      "id": 26,
      "start": 1938.2000274658203,
      "end": 1941.6000213623047,
      "text": " interesting study. In fact, if you wanted to study all of these lines and kind of"
    },
    {
      "id": 27,
      "start": 1941.6000213623047,
      "end": 1946.6800231933594,
      "text": " see where all of these groups of people went and so on and so forth, because we"
    },
    {
      "id": 28,
      "start": 1946.6800231933594,
      "end": 1952.6400146484375,
      "text": " do understand that of them was the whole earth overspread. And so that's a"
    },
    {
      "id": 29,
      "start": 1952.6400146484375,
      "end": 1957.52001953125,
      "text": " lot of land, the whole earth, there's just eight people, and of course when we come"
    },
    {
      "id": 30,
      "start": 1957.52001953125,
      "end": 1962.6000213623047,
      "text": " to Genesis chapter 11 in the Tower of Babel and we see the disbursement of the"
    },
    {
      "id": 31,
      "start": 1962.6000213623047,
      "end": 1967.52001953125,
      "text": " people and all that that takes place, and we find that this prophecy with regard"
    },
    {
      "id": 32,
      "start": 1967.52001953125,
      "end": 1971.9600219726562,
      "text": " to Japheth, that God shall enlarge Japheth, but notice this aspect, the Bible"
    },
    {
      "id": 33,
      "start": 1971.9600219726562,
      "end": 1977.7200164794922,
      "text": " says, and he shall dwell in the tents of Shem. It's interesting because we really"
    },
    {
      "id": 34,
      "start": 1977.7200164794922,
      "end": 1983.3600158691406,
      "text": " know through this phraseology at the middle there of verse number 27 that the"
    },
    {
      "id": 35,
      "start": 1983.3600158691406,
      "end": 1988.6000213623047,
      "text": " spiritual blessings upon Japheth would come through the God of Shem. Why?"
    },
    {
      "id": 36,
      "start": 1988.6000213623047,
      "end": 1993.4400177001953,
      "text": " Because that's the Messianic line, that's the Lord God, that's our"
    },
    {
      "id": 37,
      "start": 1993.5600280761719,
      "end": 2000.6400146484375,
      "text": " Messiah, and of course we look at this prophecy in verses 25, 26, and 27, and in"
    },
    {
      "id": 38,
      "start": 2000.6400146484375,
      "end": 2004.0800170898438,
      "text": " fact, again, you could study various things and you could go through all"
    },
    {
      "id": 39,
      "start": 2004.0800170898438,
      "end": 2009.8400268554688,
      "text": " sorts of things to see the way in which throughout history these particular"
    },
    {
      "id": 40,
      "start": 2009.8400268554688,
      "end": 2015.040023803711,
      "text": " descendants have gone to different places, but what a blessing to understand"
    },
    {
      "id": 41,
      "start": 2015.040023803711,
      "end": 2021.3400268554688,
      "text": " the way in which God is using this prophecy of Noah and we can see the"
    },
    {
      "id": 42,
      "start": 2021.3400268554688,
      "end": 2025.9000244140625,
      "text": " fulfillment of it. Again, as we look at this passage of Scripture, we see not"
    },
    {
      "id": 43,
      "start": 2025.9000244140625,
      "end": 2029.9800262451172,
      "text": " only the replenishing of the earth, the drunkenness of Noah, the prophecy of Noah,"
    },
    {
      "id": 44,
      "start": 2029.9800262451172,
      "end": 2033.9400177001953,
      "text": " but then we see the death of Noah. Finally, this evening, number four, if"
    },
    {
      "id": 45,
      "start": 2033.9400177001953,
      "end": 2038.3800201416016,
      "text": " you're taking notes, verses 28 and 29, the Bible says this, and Noah lived after the"
    },
    {
      "id": 46,
      "start": 2038.3800201416016,
      "end": 2047.4600219726562,
      "text": " flood 350 years, and all the days of Noah were 950 years, and he died. That's pretty"
    },
    {
      "id": 47,
      "start": 2047.500015258789,
      "end": 2054.300018310547,
      "text": " good age, amen? 950. Man. Now, it's interesting as we know what's taking"
    },
    {
      "id": 48,
      "start": 2054.300018310547,
      "end": 2059.260025024414,
      "text": " place because really as we begin to understand the time frame, if you will,"
    },
    {
      "id": 49,
      "start": 2059.260025024414,
      "end": 2065.1800231933594,
      "text": " that Noah and his wife and his boys and their wives, they came off the ark in"
    },
    {
      "id": 50,
      "start": 2065.1800231933594,
      "end": 2069.260009765625,
      "text": " chapter number 8. Remember we said this, at the end of chapter number 8, the Bible"
    },
    {
      "id": 51,
      "start": 2069.260009765625,
      "end": 2072.740020751953,
      "text": " tells us that Noah built an altar unto the Lord. What did he do? He offered burnt"
    },
    {
      "id": 52,
      "start": 2072.740020751953,
      "end": 2076.8200073242188,
      "text": " offerings on the altar. First things first, the first matter of business was"
    },
    {
      "id": 53,
      "start": 2076.8200073242188,
      "end": 2080.9400329589844,
      "text": " worship. They worship the Lord, they make these offerings, and then we find that"
    },
    {
      "id": 54,
      "start": 2080.9400329589844,
      "end": 2085.3800354003906,
      "text": " God comes and speaks to Noah, he blesses Noah and his kids, he gives them"
    },
    {
      "id": 55,
      "start": 2085.3800354003906,
      "end": 2089.260009765625,
      "text": " direction with regard to the replenishing of the earth, and he gives"
    },
    {
      "id": 56,
      "start": 2089.260009765625,
      "end": 2094.980010986328,
      "text": " the Noahic covenant, and then we find in just these few verses of Scripture, the"
    },
    {
      "id": 57,
      "start": 2094.980010986328,
      "end": 2102.3400268554688,
      "text": " entirety of those 350 years wrapped up for us. Now, again, the Bible tells us"
    },
    {
      "id": 58,
      "start": 2102.3400268554688,
      "end": 2107.6600341796875,
      "text": " that Noah was 950 years old and he died. Now, it's interesting that we would"
    },
    {
      "id": 59,
      "start": 2107.6600341796875,
      "end": 2113.540008544922,
      "text": " understand the age of Noah being mentioned here. It's approximate, and"
    },
    {
      "id": 60,
      "start": 2113.540008544922,
      "end": 2118.7000122070312,
      "text": " there's some different Bible scholars of yesteryear, of what have you, that have"
    },
    {
      "id": 61,
      "start": 2118.7000122070312,
      "end": 2124.2200317382812,
      "text": " given chronological dates to events in the Scriptures, but roughly speaking, at"
    },
    {
      "id": 62,
      "start": 2124.2200317382812,
      "end": 2129.5800170898438,
      "text": " this particular time in history, the earth was just over 2,000 years old from"
    },
    {
      "id": 63,
      "start": 2129.5800170898438,
      "end": 2135.6200256347656,
      "text": " creation, and so you think about Noah being 950 years old and the earth only"
    },
    {
      "id": 64,
      "start": 2135.6200256347656,
      "end": 2139.9000244140625,
      "text": " being created for a little over 2,000 years. When I say a little over, like 2004,"
    },
    {
      "id": 65,
      "start": 2139.9000244140625,
      "end": 2144.300018310547,
      "text": " 2006, somewhere in that ballpark, number of years since the earth had been"
    },
    {
      "id": 66,
      "start": 2144.300018310547,
      "end": 2150.1800231933594,
      "text": " created, but Noah was alive for 950 of them. That's almost half of the known"
    },
    {
      "id": 67,
      "start": 2150.1800231933594,
      "end": 2155.740020751953,
      "text": " human history at that point that Noah was alive for, and we think about it"
    },
    {
      "id": 68,
      "start": 2155.740020751953,
      "end": 2160.500030517578,
      "text": " being summarized for us here in just these few verses of Scripture, and God is"
    },
    {
      "id": 69,
      "start": 2160.500030517578,
      "end": 2165.980010986328,
      "text": " giving to us, helping us to see this prophecy of Noah, and again, as we've"
    },
    {
      "id": 70,
      "start": 2165.980010986328,
      "end": 2169.980010986328,
      "text": " mentioned throughout the book of Genesis, as we begin to study the"
    },
    {
      "id": 71,
      "start": 2169.980010986328,
      "end": 2175.300018310547,
      "text": " foundational nature of these really first 11 chapters of the book of"
    },
    {
      "id": 72,
      "start": 2175.300018310547,
      "end": 2179.540008544922,
      "text": " Genesis and how foundational they are for understanding the entirety of"
    },
    {
      "id": 73,
      "start": 2179.540008544922,
      "end": 2185.3800354003906,
      "text": " Scripture. If you did not have these chapters and these verses and you did"
    },
    {
      "id": 74,
      "start": 2185.3800354003906,
      "end": 2189.7000122070312,
      "text": " not understand some of these things, it would be challenging to have proper"
    },
    {
      "id": 75,
      "start": 2189.7000122070312,
      "end": 2195.6600341796875,
      "text": " interpretation of the balance of Scripture. We find that it's these first"
    },
    {
      "id": 76,
      "start": 2195.6600341796875,
      "end": 2201.8600158691406,
      "text": " 11 chapters that are so often under attack by those that do not have a"
    },
    {
      "id": 77,
      "start": 2201.8600158691406,
      "end": 2206.9000244140625,
      "text": " biblical worldview that would like to destroy those that have a biblical"
    },
    {
      "id": 78,
      "start": 2206.9000244140625,
      "end": 2212.260009765625,
      "text": " worldview. They want to cast doubt as to the historical accuracy of these things."
    },
    {
      "id": 79,
      "start": 2212.4200134277344,
      "end": 2216.4200134277344,
      "text": " They want to provide various interpretations as to what these things"
    },
    {
      "id": 80,
      "start": 2216.4200134277344,
      "end": 2222.300018310547,
      "text": " mean, but we find that God has given us the Word that He has given us. He, in His"
    },
    {
      "id": 81,
      "start": 2222.300018310547,
      "end": 2228.7000122070312,
      "text": " wisdom, has given us exactly what He has given us, and as we study it and begin to"
    },
    {
      "id": 82,
      "start": 2228.7000122070312,
      "end": 2234.2200317382812,
      "text": " interpret the history from the foundation of God's Word, we are able to"
    },
    {
      "id": 83,
      "start": 2234.2200317382812,
      "end": 2238.7000122070312,
      "text": " come to proper conclusions. It is interesting to note this truth this"
    },
    {
      "id": 84,
      "start": 2238.780029296875,
      "end": 2244.300018310547,
      "text": " evening as we think about kind of coming to this end point, if you will, in the"
    },
    {
      "id": 85,
      "start": 2244.300018310547,
      "end": 2249.02001953125,
      "text": " book of Genesis. We find that in chapter number 10, of course, the genealogies are"
    },
    {
      "id": 86,
      "start": 2249.02001953125,
      "end": 2254.5800170898438,
      "text": " provided. We see the sons of Japheth, of Ham, of Shem, and really the entirety of"
    },
    {
      "id": 87,
      "start": 2254.5800170898438,
      "end": 2258.6200256347656,
      "text": " the chapter is given to the genealogies. We then come to chapter number 11 with"
    },
    {
      "id": 88,
      "start": 2258.6200256347656,
      "end": 2263.3800354003906,
      "text": " the Tower of Babel, and at that point we're kind of then going to start"
    },
    {
      "id": 89,
      "start": 2263.3800354003906,
      "end": 2268.4600219726562,
      "text": " dealing with Abraham and going forward into the book of Genesis. And as we think"
    },
    {
      "id": 90,
      "start": 2268.4600219726562,
      "end": 2273.1800231933594,
      "text": " about the foundation, we come to the end of chapter number 10 and look at the"
    },
    {
      "id": 91,
      "start": 2273.1800231933594,
      "end": 2277.6200256347656,
      "text": " death of Noah, and we think about all of these things that have happened, all of"
    },
    {
      "id": 92,
      "start": 2277.6200256347656,
      "end": 2282.6200256347656,
      "text": " these things that we've studied, and we begin to have this biblical worldview, we"
    },
    {
      "id": 93,
      "start": 2282.6200256347656,
      "end": 2288.5800170898438,
      "text": " understand some of, or really all of, we have the understanding of what God is"
    },
    {
      "id": 94,
      "start": 2288.5800170898438,
      "end": 2296.780029296875,
      "text": " giving us in the New Testament and with His plan as a whole. We have so many"
    },
    {
      "id": 95,
      "start": 2296.8200073242188,
      "end": 2301.8200073242188,
      "text": " people running around today that do not have a biblical worldview that are"
    },
    {
      "id": 96,
      "start": 2301.8200073242188,
      "end": 2307.4600219726562,
      "text": " trying to provide solutions for the world's problems. The solutions for the"
    },
    {
      "id": 97,
      "start": 2307.4600219726562,
      "end": 2314.060028076172,
      "text": " world's problems are not going to come from something outside of God's Word, and"
    },
    {
      "id": 98,
      "start": 2314.060028076172,
      "end": 2322.2200317382812,
      "text": " we've had such a move away from the Bible in our nation in the last several"
    },
    {
      "id": 99,
      "start": 2322.3400268554688,
      "end": 2327.4600219726562,
      "text": " generations, away from the Bible, away from God, away from the principles of God,"
    },
    {
      "id": 100,
      "start": 2327.4600219726562,
      "end": 2333.6600341796875,
      "text": " and we've introduced all sorts of other thoughts and mindsets and ideologies"
    },
    {
      "id": 101,
      "start": 2333.6600341796875,
      "end": 2339.0599975585938,
      "text": " that are out there that are permeating the minds of people today that"
    },
    {
      "id": 102,
      "start": 2339.0599975585938,
      "end": 2343.3800048828125,
      "text": " are not going to adequately provide solutions to the problems that we deal"
    },
    {
      "id": 103,
      "start": 2343.3800048828125,
      "end": 2349.9000244140625,
      "text": " with. In fact, as you look at the way in which the account of these first"
    },
    {
      "id": 104,
      "start": 2349.9400024414062,
      "end": 2355.1000366210938,
      "text": " chapters of Genesis are being attacked, what is it, what is the the biggest way"
    },
    {
      "id": 105,
      "start": 2355.1000366210938,
      "end": 2361.5800170898438,
      "text": " in which they attack? There's no creator, right? This teaching of evolution,"
    },
    {
      "id": 106,
      "start": 2361.5800170898438,
      "end": 2369.1400146484375,
      "text": " this idea of humanism that really comes out of the teaching of Darwinianism and"
    },
    {
      "id": 107,
      "start": 2369.1400146484375,
      "end": 2375.02001953125,
      "text": " understanding all of their ideologies with regard to undermining the authority"
    },
    {
      "id": 108,
      "start": 2375.02001953125,
      "end": 2381.7000122070312,
      "text": " of God. Can I tell you that if there is no God, that there is no creator, that"
    },
    {
      "id": 109,
      "start": 2381.7000122070312,
      "end": 2391.2200317382812,
      "text": " there's no purpose? We're just some random chance. That's not true. God has"
    },
    {
      "id": 110,
      "start": 2391.2200317382812,
      "end": 2397.7400512695312,
      "text": " created us. God has given us a purpose. God has given us a plan, and God has"
    },
    {
      "id": 111,
      "start": 2397.7400512695312,
      "end": 2402.780029296875,
      "text": " recorded these things for us, and we find that as we look to the Scriptures and we"
    },
    {
      "id": 112,
      "start": 2402.780029296875,
      "end": 2406.7000122070312,
      "text": " look to the Word of God that we..."
    },
    {
      "id": 0,
      "start": 2406.7000122070312,
      "end": 2411.8200120925903,
      "text": " We must ensure that our mindset is biblical, that our worldview is biblical."
    },
    {
      "id": 1,
      "start": 2411.8200120925903,
      "end": 2412.8200120925903,
      "text": " There are people..."
    },
    {
      "id": 2,
      "start": 2412.8200120925903,
      "end": 2417.620012283325,
      "text": " I had someone come to me a couple of years ago now, no one from our church, but someone"
    },
    {
      "id": 3,
      "start": 2417.620012283325,
      "end": 2423.7000122070312,
      "text": " came to me that had a solid, what I thought, a solid Bible foundation."
    },
    {
      "id": 4,
      "start": 2423.7000122070312,
      "end": 2427.9200115203857,
      "text": " And they came to me and they said, do you really think there only had to be one Adam"
    },
    {
      "id": 5,
      "start": 2427.9200115203857,
      "end": 2431.9800128936768,
      "text": " or could there have been many Adams?"
    },
    {
      "id": 6,
      "start": 2431.9800128936768,
      "end": 2439.1400108337402,
      "text": " And they began to ask about the replenishing of the earth after the flood, they began to"
    },
    {
      "id": 7,
      "start": 2439.1400108337402,
      "end": 2447.2600135803223,
      "text": " provide these ideas about various groups of people in various regions of the world."
    },
    {
      "id": 8,
      "start": 2447.2600135803223,
      "end": 2452.9000129699707,
      "text": " And I simply said, sir, you got to look at the Bible, but how do you know it's true?"
    },
    {
      "id": 9,
      "start": 2452.9000129699707,
      "end": 2458.4600105285645,
      "text": " And what has happened is they began to get attacked and attacked and attacked, and the"
    },
    {
      "id": 10,
      "start": 2458.4600105285645,
      "end": 2465.1800117492676,
      "text": " attack upon the foundation of God's Word, began to mess with the thought process, begin"
    },
    {
      "id": 11,
      "start": 2465.1800117492676,
      "end": 2471.10001373291,
      "text": " to introduce various ideas and thoughts with regard to human history."
    },
    {
      "id": 12,
      "start": 2471.10001373291,
      "end": 2476.7400131225586,
      "text": " But we find that God has given us the truth that He has given us for a purpose."
    },
    {
      "id": 13,
      "start": 2476.7400131225586,
      "end": 2481.6200103759766,
      "text": " Why did God decide, and I'm not questioning Him, I'm not saying it in this way to question"
    },
    {
      "id": 14,
      "start": 2481.6200103759766,
      "end": 2488.260009765625,
      "text": " Him, but we look at this and we say, in 350 years, to summarize the life of Noah in verses"
    },
    {
      "id": 15,
      "start": 2488.260009765625,
      "end": 2493.8200149536133,
      "text": " 18 through 29, why is this the content?"
    },
    {
      "id": 16,
      "start": 2493.8200149536133,
      "end": 2500.060012817383,
      "text": " Why is it that God takes note to tell us, and of them was the whole earth overspread?"
    },
    {
      "id": 17,
      "start": 2500.060012817383,
      "end": 2504.080009460449,
      "text": " He wants us to understand the way in which the earth was replenished."
    },
    {
      "id": 18,
      "start": 2504.080009460449,
      "end": 2509.580009460449,
      "text": " He wants us to understand that all mankind was killed during the flood, and all men and"
    },
    {
      "id": 19,
      "start": 2509.580009460449,
      "end": 2515.000015258789,
      "text": " every living being, they were all killed, they were destroyed."
    },
    {
      "id": 20,
      "start": 2515.000015258789,
      "end": 2517.760009765625,
      "text": " He told us specifically who got on the ark."
    },
    {
      "id": 21,
      "start": 2517.760009765625,
      "end": 2521.780014038086,
      "text": " He told us specifically who got off the ark."
    },
    {
      "id": 22,
      "start": 2521.780014038086,
      "end": 2525.3000106811523,
      "text": " Why did He tell us about this event?"
    },
    {
      "id": 23,
      "start": 2525.3000106811523,
      "end": 2528.180015563965,
      "text": " Why did He tell us about the prophecy?"
    },
    {
      "id": 24,
      "start": 2528.180015563965,
      "end": 2534.3400115966797,
      "text": " Begin to see the way in which God is unfolding the future events that would happen and how"
    },
    {
      "id": 25,
      "start": 2534.3400115966797,
      "end": 2541.6200103759766,
      "text": " we can look here and see this and begin to interpret properly future events that take"
    },
    {
      "id": 26,
      "start": 2541.6200103759766,
      "end": 2542.6200103759766,
      "text": " place."
    },
    {
      "id": 27,
      "start": 2542.6200103759766,
      "end": 2544.8200073242188,
      "text": " And it's so important that we understand that."
    },
    {
      "id": 28,
      "start": 2544.8800048828125,
      "end": 2550.240005493164,
      "text": " I mean, think about it this morning when we mentioned about the order of Melchizedek."
    },
    {
      "id": 29,
      "start": 2550.240005493164,
      "end": 2553.3600158691406,
      "text": " I was chatting with someone after the service."
    },
    {
      "id": 30,
      "start": 2553.3600158691406,
      "end": 2560.480010986328,
      "text": " The reality is that the truth of coming to that messianic psalm in Psalm 110 and thinking"
    },
    {
      "id": 31,
      "start": 2560.480010986328,
      "end": 2566.9200134277344,
      "text": " about this promise of this one that would come, Messiah, and as the prophecy would be"
    },
    {
      "id": 32,
      "start": 2566.9200134277344,
      "end": 2572.760009765625,
      "text": " given there, and they would be very familiar with it as they would understand here in Psalm"
    },
    {
      "id": 33,
      "start": 2572.760009765625,
      "end": 2578.9400177001953,
      "text": " 110 in verse number 4, where the Bible tells us, the Lord hath sworn and will not repent."
    },
    {
      "id": 34,
      "start": 2578.9400177001953,
      "end": 2579.9400177001953,
      "text": " Notice that terminology."
    },
    {
      "id": 35,
      "start": 2579.9400177001953,
      "end": 2585.1800079345703,
      "text": " The Lord hath sworn and will not repent, and then it says, thou art a priest forever after"
    },
    {
      "id": 36,
      "start": 2585.1800079345703,
      "end": 2587.52001953125,
      "text": " the order of Melchizedek."
    },
    {
      "id": 37,
      "start": 2587.52001953125,
      "end": 2591.1800079345703,
      "text": " And then they think about Melchizedek, Melchizedek, where do we know that name from?"
    },
    {
      "id": 38,
      "start": 2591.1800079345703,
      "end": 2594.1800079345703,
      "text": " I'm not sure that they would say that, but maybe for us."
    },
    {
      "id": 39,
      "start": 2594.1800079345703,
      "end": 2597.540008544922,
      "text": " And they go back to Genesis 14 and they just look at a couple of verses of Scripture and"
    },
    {
      "id": 40,
      "start": 2597.540008544922,
      "end": 2601.980010986328,
      "text": " they just, man, how does this all come to pass?"
    },
    {
      "id": 41,
      "start": 2601.980010986328,
      "end": 2608.3200073242188,
      "text": " We see now living in this day and living and looking back historically, we see how,"
    },
    {
      "id": 42,
      "start": 2608.3200073242188,
      "end": 2611.720016479492,
      "text": " and Holly and I were talking this afternoon, like the peel of the onion kind of coming"
    },
    {
      "id": 43,
      "start": 2611.720016479492,
      "end": 2617.280014038086,
      "text": " off, the wrapping of the present coming off in the presentation."
    },
    {
      "id": 44,
      "start": 2617.280014038086,
      "end": 2623.6600189208984,
      "text": " We find this such is the case with this prophecy of Noah recorded in these few verses of Scripture."
    },
    {
      "id": 45,
      "start": 2623.6600189208984,
      "end": 2628.480010986328,
      "text": " It helps us to have a proper understanding of all that takes place."
    },
    {
      "id": 46,
      "start": 2628.480010986328,
      "end": 2632.7000122070312,
      "text": " You know, there are a lot of people that take the approach that Ham was cursed."
    },
    {
      "id": 47,
      "start": 2632.7000122070312,
      "end": 2636.1400146484375,
      "text": " It doesn't say that Ham was cursed."
    },
    {
      "id": 48,
      "start": 2636.1400146484375,
      "end": 2638.9400177001953,
      "text": " It says cursed be Canaan."
    },
    {
      "id": 49,
      "start": 2638.9400177001953,
      "end": 2640.6600189208984,
      "text": " Amen?"
    },
    {
      "id": 50,
      "start": 2640.6600189208984,
      "end": 2646.02001953125,
      "text": " They try to make application to certain ethnicities with regard to that curse that is mentioned"
    },
    {
      "id": 51,
      "start": 2646.02001953125,
      "end": 2647.8400115966797,
      "text": " in Genesis chapter number nine."
    },
    {
      "id": 52,
      "start": 2647.8400115966797,
      "end": 2654.3200073242188,
      "text": " They were Canaanites that dwell in the land of Canaan, okay?"
    },
    {
      "id": 53,
      "start": 2654.3200073242188,
      "end": 2656.740005493164,
      "text": " They were servants of servants."
    },
    {
      "id": 54,
      "start": 2656.740005493164,
      "end": 2662.040008544922,
      "text": " We looked at the passages of Scripture, and so we don't have to come up with some hypothesis"
    },
    {
      "id": 55,
      "start": 2662.040008544922,
      "end": 2664.6000061035156,
      "text": " of what does this mean and how does this all work out."
    },
    {
      "id": 56,
      "start": 2664.6000061035156,
      "end": 2670.0800170898438,
      "text": " No, we can go to the Scriptures and we can trace what the Scriptures tell us and we can"
    },
    {
      "id": 57,
      "start": 2670.0800170898438,
      "end": 2672.52001953125,
      "text": " see the fulfillment of the prophecy."
    },
    {
      "id": 58,
      "start": 2672.52001953125,
      "end": 2679.6600036621094,
      "text": " And I'm thankful that God in His wisdom provided us with the record that He provided us with"
    },
    {
      "id": 59,
      "start": 2679.6600036621094,
      "end": 2682.1600036621094,
      "text": " because He knows exactly what we need."
    },
    {
      "id": 60,
      "start": 2682.1600036621094,
      "end": 2683.6800231933594,
      "text": " And we need to be biblical."
    },
    {
      "id": 61,
      "start": 2683.6800231933594,
      "end": 2684.6800231933594,
      "text": " Amen?"
    },
    {
      "id": 62,
      "start": 2684.6800231933594,
      "end": 2685.6800231933594,
      "text": " We really do."
    },
    {
      "id": 63,
      "start": 2685.6800231933594,
      "end": 2688.540008544922,
      "text": " We need to return to the Bible."
    },
    {
      "id": 64,
      "start": 2688.540008544922,
      "end": 2691.1600036621094,
      "text": " We need to be biblical people."
    },
    {
      "id": 65,
      "start": 2691.1600036621094,
      "end": 2696.6600036621094,
      "text": " We need to be in the place where we think and act biblically."
    },
    {
      "id": 66,
      "start": 2696.6600036621094,
      "end": 2702.7000122070312,
      "text": " There's so many ideas that are being thrown out in our world today, and it's so dangerous"
    },
    {
      "id": 67,
      "start": 2702.7000122070312,
      "end": 2707.220001220703,
      "text": " for our young people to kind of get caught up in some of these ideologies and some of"
    },
    {
      "id": 68,
      "start": 2707.220001220703,
      "end": 2708.220001220703,
      "text": " these..."
    },
    {
      "id": 69,
      "start": 2708.220001220703,
      "end": 2711.740020751953,
      "text": " I mean, listen, they package them neatly and they make it sound really good."
    },
    {
      "id": 70,
      "start": 2711.800018310547,
      "end": 2714.1400146484375,
      "text": " I say, hold on a minute."
    },
    {
      "id": 71,
      "start": 2714.1400146484375,
      "end": 2716.1800231933594,
      "text": " Is it biblical?"
    },
    {
      "id": 72,
      "start": 2716.1800231933594,
      "end": 2721.8200073242188,
      "text": " Because first and foremost, we must have a biblical worldview, and everything will then"
    },
    {
      "id": 73,
      "start": 2721.8200073242188,
      "end": 2723.7000122070312,
      "text": " flow out of that."
    },
    {
      "id": 74,
      "start": 2723.7000122070312,
      "end": 2726.980010986328,
      "text": " Genesis chapter 9 records for us the final days of Noah."
    },
    {
      "id": 75,
      "start": 2726.980010986328,
      "end": 2727.980010986328,
      "text": " Let's pray."
    },
    {
      "id": 76,
      "start": 2727.980010986328,
      "end": 2728.980010986328,
      "text": " Father, we love You."
    },
    {
      "id": 77,
      "start": 2728.980010986328,
      "end": 2729.980010986328,
      "text": " We thank You for loving us."
    },
    {
      "id": 78,
      "start": 2729.980010986328,
      "end": 2732.980010986328,
      "text": " Thank You for the Word of God, the truth contained therein."
    },
    {
      "id": 79,
      "start": 2732.980010986328,
      "end": 2735.8200073242188,
      "text": " We thank You for the opportunity to study Thy Word."
    },
    {
      "id": 80,
      "start": 2736.1400146484375,
      "end": 2744.1400146484375,
      "text": " Lord, we thank You for allowing us to have the Bible preserved in our language."
    },
    {
      "id": 81,
      "start": 2744.1400146484375,
      "end": 2748.9000244140625,
      "text": " We thank You for Your wisdom that's been displayed throughout the book of Genesis."
    },
    {
      "id": 82,
      "start": 2748.9000244140625,
      "end": 2753.1800231933594,
      "text": " We've seen Your power and Your wisdom on display."
    },
    {
      "id": 83,
      "start": 2753.1800231933594,
      "end": 2757.8200073242188,
      "text": " God, I pray that You would help us to be biblical."
    },
    {
      "id": 84,
      "start": 2757.8200073242188,
      "end": 2769.540008544922,
      "text": " Lord, to think and act biblically, to consider those things that would be presented to us"
    },
    {
      "id": 85,
      "start": 2769.540008544922,
      "end": 2773.3400268554688,
      "text": " and take them through the filter of Your Word."
    },
    {
      "id": 86,
      "start": 2773.3400268554688,
      "end": 2782.8400268554688,
      "text": " Lord, help us not to be deceived by those things that are going on in our society today."
    },
    {
      "id": 87,
      "start": 2782.8400268554688,
      "end": 2784.4200134277344,
      "text": " We thank You for Your Word."
    },
    {
      "id": 88,
      "start": 2784.4200134277344,
      "end": 2785.6600036621094,
      "text": " We thank You for loving us."
    },
    {
      "id": 89,
      "start": 2785.6600036621094,
      "end": 2787.7000122070312,
      "text": " We pray that You'd give us a good week."
    },
    {
      "id": 90,
      "start": 2787.7000122070312,
      "end": 2790.740020751953,
      "text": " Lord, help us to honor You and glorify You."
    },
    {
      "id": 91,
      "start": 2790.740020751953,
      "end": 2793.9000244140625,
      "text": " We think of those that are traveling, pray that You'd keep them safe."
    },
    {
      "id": 92,
      "start": 2793.9000244140625,
      "end": 2798.9000244140625,
      "text": " Lord, help us to be the salt of the earth and the light of the world."
    },
    {
      "id": 93,
      "start": 2798.9000244140625,
      "end": 2799.9000244140625,
      "text": " We'll thank You for it."
    },
    {
      "id": 94,
      "start": 2799.9000244140625,
      "end": 2800.9000244140625,
      "text": " In Christ's name we pray."
    },
    {
      "id": 95,
      "start": 2800.9000244140625,
      "end": 2801.540008544922,
      "text": " Would you stand with me?"
    }
  ],
  "processed_at": "2025-04-17T16:39:54.794706"
}