{
  "video_id": "59eHWxG90YI",
  "text": "Looking at the names of God, the title of the message, Thy Name is Great, and that was part one. And now this evening, Thy Name is Great, part two. And Brother Jim, sorry I did not give you a note card with that, but it is Thy Name is Great, part two. We'll be looking here at Proverbs 18 and verse number 10 as a springboard again this evening. You'll remember that as we started this study of theology that we began in Jeremiah chapter number 10, and we've used verse number 6 in Jeremiah 10 as really an outline type of a verse for this passage of scripture where the Bible says, For as much as there is none like unto thee, O Lord, thou art great, and thy name is great in might. And so we've had the opportunity as we've studied theology to look at a number of God's attributes and to rejoice in His moral attributes and His natural attributes, and what a joy to have the privilege of knowing the God of the universe and that He has given us His word to reveal Himself to us. As we began looking at the names of God, we've made the note of understanding that God would use a number of names in the Old Testament to call Himself, and as He would use those names, He would be communicating with His people various aspects of His character. And He would, of course, through the use of these names, He would highlight certain aspects of His character, of His attributes, and what a blessing it was for the people of God in the Old Testament as they would receive the truth as God would reveal Himself to them by these names and how it encouraged them and impacted them. And I said this last week, that as we today study the names of God, and we're looking at ten of them, we did five last week and we'll do five this evening, but as we look at these names of God that we have the opportunity just in like manner as those Old Testament saints to be encouraged as we are reminded of who our God is and how He has revealed Himself in Proverbs 18 and verse number 10, the Bible says, the name of the Lord is a strong tower, the righteous runneth into it and is safe. The psalmist said in Psalm 148 and verse number 13, let them praise the name of the Lord, for His name alone is excellent, His glory is above the earth and heaven. In our first study dealing with Thy name is great, we looked at the name of God, Elohim. It's the first name of God that's used in all of the Bible. In Genesis chapter number 1, we find in the beginning God and we find that Elohim, meaning the strong one, and dealing with the fact that He is the Creator and how that is so foundational to understand the whole of Scripture, that He is the Creator. We dealt with the proper name of God, Yahweh or Jehovah, and understanding that He is the self-existent One. In Him is life. People ask that question when you speak about God being the Creator, well, who created God? No one, He is. And He is the self-existent One, Jehovah Yahweh. Adonai, dealing with the fact that He is Lord or Master, He is our strength, and we said this last week, that as our Lord or as our Master, that He rightly deserves our worship and our obedience. El Shaddai, the Lord God Almighty, and how we rejoice in God revealing Himself to Abram as being El Shaddai, the Lord God Almighty. And I said this, after God had revealed Himself in that manner, He then says to Abraham in the next chapter, is anything too hard for the Lord? And what a blessing as we understand that He is the Lord God Almighty, obviously the answer to that question is no, there's nothing too hard for you, you've just revealed yourself to me as being the Lord God Almighty, the Almighty One. And then we looked and finished up with Jehovah Ra, and that means the Lord is my shepherd, we see that in Psalm 23. And of course we noted last week that David, as the sweet psalmist of Israel, is the one that God used to pen Psalm 23, that of course he was a shepherd, but really if you think about it, a lot of the Old Testament saints, they were, or whether they were shepherds or very closely associated with shepherding, they would have had a great understanding of that truth when God says, I am your shepherd, and all that that means, and all that carries with it. This evening, as we continue our study, I want you to turn to the book of Exodus, Exodus chapter number 15, and the sixth name that we'll look at this evening, name of God, is Jehovah Rapha, Jehovah Rapha. And this is given to us here in Exodus chapter number 15. We sang the song this evening, how appropriate, the first song that we sang this evening, When I See the Blood, and of course a reminder of the Passover, and so contextually to find out exactly all that's going on here in the book of Exodus, we find that the plagues have been, all ten of them have been given, and we find that of course the tenth being that of the Passover and the importance of applying the blood, and then of course the children of Israel leave Egypt, and then the 14th chapter records for us the drying up of the Red Sea. They get into chapter 15, and you hear about all of the song of praise for what God did, and not long after their singing praise, they're complaining about the fact that they found no water, and that's contained for us at the end of the 15th chapter of the book of Exodus. And notice with me, as they would complain about finding no water, remember they're at Marah, and they're exactly where God had led them to in verse number 23, it says, When they came to Marah, they could not drink of the waters of Marah, for they were bitter. And so they come to this place, they had no water, then they come to a place where there's water, but they cannot drink the water. The people murmured against Moses, saying, What shall we drink? And the Lord showed them a tree, in verse number 25, and told them that he would make the water sweet, and of course that's what he did. It says at the end of verse number 25 that there he proved them, and of course they had already seen God do amazing things, eyewitnesses of his power, and now we see this once again where God is giving them, revealing to them his power. We find in verse number 26, notice what God says, And said, If thou wilt diligently hearken to the voice of the Lord thy God, and wilt do that which is right in his sight, and wilt give ear to his commandments, and keep all his statutes, I will put none of these diseases upon thee, which I have brought upon the Egyptians. Notice what he says, For I am the Lord that healeth thee. And of course you see again, as I've mentioned last week, that Lord there at the end of verse number 26, and your Bible should be in all caps, it's Jehovah or Yahweh, and so that's where we see Jehovah Rapha, the Lord that heals, and he says, I am the Lord that healeth thee. Now think about the context they're going into, of course we know that they don't enter immediately into the land of promise because of their doubt and their unbelief, and they wander in the wilderness, but God is saying to them, I will put none of these diseases upon thee, which I have brought upon the Egyptians, for I am the Lord that healeth thee. And I want you to think about the impact that that truth, of God revealing himself to his people in this manner by using the name Jehovah Rapha, how that would encourage them when they were aware of diseases, when they were aware of those things, that we serve the Lord God who is able to heal. And we understand that the scriptures would record for us of those that had inquired and asked for God to provide healing, and we find many examples of God doing just that. Why? Because he's the Lord that heals, and he has power over sickness and disease. We see that in the person of Jesus Christ, as you study the gospel records, how that he would, through the miracles, perform many miracles in which he demonstrated this power over sickness and disease. And we as New Testament believers, we have the truth of James 5 when he says, if any are sick, let them pray, knowing that our God is able. He is the Lord that heals. Number seven, Jehovah Jireh. You have to turn back to the book of Genesis in chapter number 22, Jehovah Jireh, it means the Lord will provide. And aren't you thankful for the provision of God? And as we begin to look at our lives and look at how good God has been to us, we would understand that he has provided for us more than we really deserve. And of course, we understand here, contextually, in Genesis chapter number 22, it's the offering of Isaac. And when you think about the offering of Isaac, of course, Abraham and Sarah had been promised a son, and now Abraham has been instructed to get up into a mountain to there offer his son. And Abraham was obedient. Abraham had faith. Abraham said to his son, when Isaac said, where is the lamb for a burnt offering? We find that Abraham replied and said, God will provide himself a lamb for a burnt offering. And he goes through the process and he lays his son upon the altar and he lifts his hand ready to slay his son. And the Bible says in verse number 11, that the angel of the Lord called unto him out of heaven and said, Abraham, Abraham. And he said, hear my. And he said, lay not thine hand upon the lad, neither do thou anything unto him. For now I know. that thou fears God seeing thou has not withheld thy son thine only son for me and Abraham lifted up his eyes and looked and notice what it says and behold behind him a ram caught a thicket by his horns and Abraham went and took the ram and offered him for a burnt offering in the stead of his son and Abraham called the name of that place Jehovah Jireh as it is said to this day in the Mount of the Lord it shall be seen the Lord will provide Abraham experienced this and we sometimes we look at the scriptures and we study the Word of God and we're aware of some of the accounts and we know what happens we sometimes can fail to remember the fact that they were living this moment by moment step by step and Abraham had faith and the book of Hebrews tells us in the 11th chapter that he believed that even if his son were to die there upon the altar that God could raise him up and what faith Abraham had but we find that the Lord provided of course we would understand as we look at Genesis 22 and think about the the type of Messiah who would come of course the Lamb of God that would go of course and go to the cross of Calvary shed his precious blood so that we could have redemption and have of course be reconciled to God and what a blessing that is God the the greatest need of mankind is a Savior the greatest need our greatest need is not an educator our greatest need is not a philosopher our greatest need is not a you to fill in the blank and we don't need someone to come and do these things know where the greatest need for mankind is a Savior and God provided his own son of course God and flesh the Lord Jesus Christ came and went to the cross of Calvary to pay for the sin of mankind and what a blessing that is for us to understand this evening and of course as we think about this passage again understanding the impact that these names would have upon the patriarchs and the people of God as they would read the accounts and they would read the names and they would be aware of the fact that our God provides and how that was to give them a greater level of faith number eight if you're taking notes Jehovah Shalom and of course many of you would know already just from that name that that is the Lord is peace the Lord is peace and look over the book of judges if you will in chapter number six and judges chapter number six and verse number 24 is where we see the use of Jehovah Shalom and of course this is the text of scripture in judges 6 over through judges 8 dealing with the life and and really the ministry of Gideon and Gideon we know several things about Gideon and he was in a position where he needed to have his faith increased he had a task that was assigned to him and as we look at the passage of scripture the the angel had appeared to him and then the angel departed out of his sight in verse number 22 if you pick it up there with me the Bible says when Gideon perceived that he was an angel of the Lord Gideon said alas O Lord God for because I have seen an angel of the face of the Lord excuse me face to face and the Lord said unto him peace be unto thee fear not thou shalt not die and so we understand that there's a level of fear and of course the need for peace and God says the Lord you notice again in verse number 23 of judges 6 that it's all caps Jehovah Yahweh the Bible says the Lord said unto him peace be unto thee and he tells him to fear not thou shalt not die then notice in verse number 24 then Gideon built an altar there unto the Lord and called it Jehovah Shalom unto this day is yet it or for it and is of the Abba's rights and so we find here that as God would say to to Gideon peace be unto thee then Gideon would build an altar which is an appropriate response of worship and he would there call the name of the Lord Jehovah Shalom the God the Lord of peace and I'm so thankful that he is the Lord of peace and we understand the Bible says great peace have they which love thy law and nothing shall offend them in Psalm 119 we find that the Bible speaks in this manner think about this and Isaiah when we think about the the truth of the peace of God and Isaiah 26 and verse number 23 thou will keep him in perfect peace whose mind is stayed on thee because he trusted in thee trust you in the Lord forever for in the Lord Jehovah is everlasting strength not only that strength but that peace and Jehovah Shalom think about all of the Old Testament really if you think about all of the trials and troubles and difficulties and all of the various things that the people of God dealt with to know God is the God of peace the Lord is peace see this evening there are times in which we may have the idea that peace equals the absence of trouble and a lot of times we're kind of programmed to think that way that peace means there's no trouble but the reality is that we can have the peace of God in the midst of great turmoil and trouble because peace is not found in the absence of trouble peace is found in the presence of God and you can find yourself in the midst of all sorts of difficulties I mean do you believe this evening that Daniel had peace when he was in the den of lions sure he did it was the king that had a sleepless night it was not Daniel for the Lord sent his angel to shut the mouths of the lions and he had peace I think about of course it's the New Testament but I think about Peter when he's there in prison and he slept like a baby I mean he slept right between a couple of soldiers and why because he had peace and the Bible tells us again as New Testament believers that he gives us a peace and he describes it as a peace that passeth all understanding let the peace of God rule in your hearts the Bible tells us in the book of Colossians and so we find this evening how that the people of God in dealing with many various opposition adversity all sorts of things going on for them to have the knowledge that God one of his names has been given as Jehovah Shalom that he is the that the Lord is peace remember that again as we kind of look at some of the the truth with regard to the Old Testament into the New Testament and the prophecy of Isaiah with regard to Messiah and the the Lord Jesus Christ and that the Bible tells us about the names of our God the Bible says about the Lord Jesus Christ that his name shall be called Wonderful Counselor the Mighty God the Everlasting Father the Prince of Peace and what a joy to know the peace of God Jehovah Shalom number nine if you're taking notes l alone l Olam excuse me I think I pronounce it wrong the first time l Olam and that is the Everlasting God now we think about l Olam and of course we've already mentioned about some of the attributes the natural attributes of God not only that he's omnipotent and omniscient and omnipresent but the fact that he's immutable and eternal that he has no beginning and no end he is Alpha and Omega that he is he was and he is to come and we understand this evening when we look at this name of God the Everlasting God that we understand that he rules for all of eternity he is the God of eternity in Genesis chapter 21 in verse number 33 it is good for us to know that our God is eternal that that he has no beginning and no end and this text of Scripture here in Genesis chapter 21 the Bible tells us in verse number 33 that it says in Abraham planted a grove in Beersheba and called there on the name of the Lord notice what it says the Everlasting God and what a joy to know this truth of our God notice what it said in Isaiah chapter number 40 and verse number 28 I'll give you a moment to turn there Isaiah chapter number 40 and verse number 28 and as you're turning there I will make mention of truth from the the book of Psalms when the Bible says this in Psalm 90 and verse number 2 before the mountains were brought forth or ever thou has formed the earth and the world even from everlasting to everlasting thou art God here in Isaiah chapter number 40 and really you could read the entire passage of Scripture and be greatly encouraged this evening but I want to pick it up in verse number 28 the Bible says this hast thou not known hast thou not heard that the everlasting God the Lord the creator of the ends of the earth fainteth not neither is weary there is no searching of his understanding he giveth power to the faint to them that have no might he increaseth strength I mean you imagine in two verses of Scripture how encouraged you could be and understanding who our God is that he is everlasting that he is the Lord Jehovah the self-existent one that he is the creator that he doesn't faint he doesn't grow weary aren't you thankful for that this evening and he is the everlasting God and we understand this evening that such, he could make these promises to his people, and his people could have faith in what he was promising. Why? Because he's eternal, he's everlasting. And we understand on this side of Calvary, and looking back at the prophecies of the Old Testament, and seeing the fulfillment of those prophecies, and rejoicing in the fact that our God is eternal, we've often said that the Word of God is relevant today. Why? Because it's written by the God of eternity. It's written by the God who transcends time. It's never going to be outdated, and it doesn't need to be updated. Amen? It's written by the God of the universe, who is eternal. He is the everlasting God. Number 10, El Elyon. El Elyon. We'll go back to Genesis chapter number 14 for this one, and this is one that I preached on a Sunday evening not long ago as we were studying through the book of Genesis, and you'll remember that Abram has a meeting after the defeat of the coalition of forces, and he rescues Lot from being captured, and all that takes place. We find that there were two meetings that Abram has in Genesis 14, and we made the statement as we studied the latter part of this chapter, that it was the king of Sodom that first came out to meet with Abram, but God so orchestrated it so that the God of the universe so orchestrated it so the king of Salem, the king of righteousness, Melchizedek, would come and meet first with Abram, and he meets with Abram before the king of Sodom has an opportunity to meet with Abram, and it's so important that we see in the text of Scripture how that God allowed for the meeting between Abram and the king of Salem, Melchizedek, to take place prior to the meeting with the king of Sodom. Why? Because God was preparing Abram for that meeting that he would have with the king of Sodom, and of course the king of Sodom was offering some things and what have you, and God was going to teach him important lesson through this meeting with Melchizedek. In verse number 18 of Genesis 14, the Bible says that Melchizedek, king of Salem, brought forth bread and wine, notice what it says, and he was the priest of the Most High God. That's El Elyon, and this is the first mention of God in this manner as being the Most High God. The Bible says in verse 19 that he blessed him and said, Blessed be Abram, notice again, of the Most High God, possessor of heaven and earth. Now think about Abram receiving this information, he's understanding this El Elyon, the Most High God, and Melchizedek comes, he's the priest of the Most High God, he gives this blessing, he says, Blessed be Abram, of the Most High God, possessor of heaven and earth. And you begin to see how that God wants us to understand who he is, and as we understand who he is, it prepares us for those things that we'll face on the earth as we live our lives. The Bible says that he blessed, in verse number 20, it says, and blessed be the Most High God, which hath delivered thine enemies into thy hand, and he gave him tithes of all. And then notice in verse 21, now it's the meeting with the king of Sodom, it says, and the king of Sodom said unto Abram, give me the persons and take the goods to thyself. Abram said to the king of Sodom, I have lift up mine hand unto the LORD. LORD is caps in your Bible, correct? It's Jehovah, Yahweh. And then notice what it says, the Most High God, El Elyon. Notice, the possessor of heaven and earth. I understand I said this just a few weeks ago when we studied Genesis chapter number 14, but when you notice the response of Abram to the king of Sodom, in verse number 22, where did he get that from? He got it from his meeting with Melchizedek, the king of Salem. He knew God was, of course he knew many things about God, but as he meets with Melchizedek, and Melchizedek reveals that he is the Most High God, he's the possessor of heaven and earth, and now when Sodom comes and wants to give him some things, wants to enrich him in a certain sense, that Abram is saying, no, no, I've lift up mine hand unto Jehovah God, El Elyon, the Most High God, the one who is the possessor of heaven and earth. I don't need anything from you, king of Sodom, because my God is able. And verse 23, it literally says, that I will not take from a thread even to a shoelatch, and that I will not take anything that is thine, lest thou shouldest say, I have made Abram rich. What a blessing to see how that immediately in the life of Abram, in this particular text of Scripture, the revelation of God through this name, El Elyon, the Most High God, the possessor of heaven and earth, that it had an immediate impact in the life of Abram. And see, that's the the reality this evening for us, the application. We can study the names of God, and it's important for us to know the names of God as we would be students of the Word of God, but it's important that we don't just look at it from a scholarly perspective, that we look at it from a level of intellect and what-have-you of knowing these names and knowing the Hebrew names of God, but that we would truly allow it to impact our living, that we would allow it to have an influence upon our day-by-day activities as we face various trials and difficulties and oppositions and temptations that we face in life, that we are mindful of who we serve and who He is. And what a joy to know that as we study the Word of God, that God, see, God can't be described with just one name. I mean, He transcends us. I've often said to people over the years, and I've said to myself, even as I look at the Word of God and try to study God and have a desire to know Him, and it should lead us to a place that we stand in awe of who He is, but the reality this evening is that as high and as mighty and as powerful as I think God is, as I can comprehend God to be, He's far superior to the what I can even begin to comprehend. His greatness is unsearchable. That's what the Word of God says. Now David declares, I know the Lord is great. And then he also says, but the Lord's greatness is unsearchable. There's no contradiction there. It's just that our finite minds cannot fully comprehend the infinite God. And so what He has done is He has revealed Himself to us, and one of the means by which He is used is the names. And as He has given Himself these names, He's revealing to His people various aspects of His character and His ability, His attributes. Why? So that we'd be encouraged, so that it would help us in this journey of life as we are mindful of who our God is. There's none like Him. As we go back and kind of finish up this study with the truth of Jeremiah 10, I want to remind you again, and we started here, we've used the verse often throughout the study, but I want to remind you of this verse as we close in Jeremiah 10 and verse number 6, when Jeremiah declares, For as much as there is none like unto Thee, O Lord. There's no one like Him. No one like Him. All the false religions of the world, all that they try to serve, there's no one like the Lord God Almighty, Jehovah God. It says, Thou art great, and He is. Oh, He's a good God, and we often speak about the Lord is good, and we should, for the Bible says that He is good. But He's great. His greatness, as I mentioned a moment ago, is unsearchable. The Bible says in Psalm 48, Great is the Lord, and greatly to be praised. And then we have here at the end of verse number 6, And thy name is great in might. Let me remind you, as I said in one of our previous lessons, we think about how great our God is. We study theology. We want to have as our textbook, if you will, for theology, the Word of God, the Bible, the revelation of God to man. We find that as we begin to study theology and understand who God is, as He's revealed Himself, that yes, we stand in awe of Him, and yes, we say that He is great, but we must be mindful of the fact that the Bible says, For this God is our God forever and ever. He will be our guide even unto death. Psalm 48 and verse number 14. I would submit to you this evening that when you know Him as He's revealed Himself to you in His Word, you will agree with the psalmist and you will say that yes, He is great. And you will acknowledge that you want Him to be your guide even unto death. Why? I don't want anyone else being my guide. Right? When I understand who He is, why would I settle for someone else to be my guide? Does that make sense? And the psalmist says, He will be our guide even unto death. We serve a great God, and we are so blessed and so privileged to know the God of heaven. We ought to stand in awe of Him, and we ought to declare His greatness. Let's pray. Father, we love You. We thank You for loving us. We thank You that You have revealed to us in Your Word these names. For just a few moments to be able to study, to reference the names of God, I've been encouraged. And I hope, Lord, that each one that is present, each one that's tuned in via livestream tonight has been encouraged. And I pray that with that encouragement comes some application in our lives, that we would be impacted in our daily lives as to how we face the difficulties and the adversities of life, that we would understand who You are and that You're our God. I pray that You'd help us to be challenged, to stand in awe of who You are, and to declare Thy greatness. There's a world that does not know who You are. It is our responsibility to declare Thy greatness. Lord, I pray that You'd bless our time of prayer. We do thank You for the privilege of prayer. We pray that You'd be honored and glorified through the remainder of our service. For it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.880000114440918,
      "text": " Looking at the names of God, the title of the message, Thy Name is Great, and that was"
    },
    {
      "id": 1,
      "start": 5.880000114440918,
      "end": 6.880000114440918,
      "text": " part one."
    },
    {
      "id": 2,
      "start": 6.880000114440918,
      "end": 9.5600004196167,
      "text": " And now this evening, Thy Name is Great, part two."
    },
    {
      "id": 3,
      "start": 9.5600004196167,
      "end": 15.199999809265137,
      "text": " And Brother Jim, sorry I did not give you a note card with that, but it is Thy Name"
    },
    {
      "id": 4,
      "start": 15.199999809265137,
      "end": 16.600000381469727,
      "text": " is Great, part two."
    },
    {
      "id": 5,
      "start": 16.600000381469727,
      "end": 21.31999969482422,
      "text": " We'll be looking here at Proverbs 18 and verse number 10 as a springboard again this evening."
    },
    {
      "id": 6,
      "start": 21.31999969482422,
      "end": 26.639999389648438,
      "text": " You'll remember that as we started this study of theology that we began in Jeremiah chapter"
    },
    {
      "id": 7,
      "start": 26.639999389648438,
      "end": 32.91999816894531,
      "text": " number 10, and we've used verse number 6 in Jeremiah 10 as really an outline type of"
    },
    {
      "id": 8,
      "start": 32.91999816894531,
      "end": 38.31999969482422,
      "text": " a verse for this passage of scripture where the Bible says, For as much as there is none"
    },
    {
      "id": 9,
      "start": 38.31999969482422,
      "end": 45.599998474121094,
      "text": " like unto thee, O Lord, thou art great, and thy name is great in might."
    },
    {
      "id": 10,
      "start": 45.599998474121094,
      "end": 49.7599983215332,
      "text": " And so we've had the opportunity as we've studied theology to look at a number of God's"
    },
    {
      "id": 11,
      "start": 49.7599983215332,
      "end": 57.040000915527344,
      "text": " attributes and to rejoice in His moral attributes and His natural attributes, and what a joy"
    },
    {
      "id": 12,
      "start": 57.040000915527344,
      "end": 63.31999969482422,
      "text": " to have the privilege of knowing the God of the universe and that He has given us His"
    },
    {
      "id": 13,
      "start": 63.31999969482422,
      "end": 66.08000183105469,
      "text": " word to reveal Himself to us."
    },
    {
      "id": 14,
      "start": 66.08000183105469,
      "end": 72.44000244140625,
      "text": " As we began looking at the names of God, we've made the note of understanding that God would"
    },
    {
      "id": 15,
      "start": 72.44000244140625,
      "end": 78.87999725341797,
      "text": " use a number of names in the Old Testament to call Himself, and as He would use those"
    },
    {
      "id": 16,
      "start": 78.87999725341797,
      "end": 85.31999969482422,
      "text": " names, He would be communicating with His people various aspects of His character."
    },
    {
      "id": 17,
      "start": 85.31999969482422,
      "end": 92.12000274658203,
      "text": " And He would, of course, through the use of these names, He would highlight certain aspects"
    },
    {
      "id": 18,
      "start": 92.12000274658203,
      "end": 98.36000061035156,
      "text": " of His character, of His attributes, and what a blessing it was for the people of God in"
    },
    {
      "id": 19,
      "start": 98.36000061035156,
      "end": 103.44000244140625,
      "text": " the Old Testament as they would receive the truth as God would reveal Himself to them"
    },
    {
      "id": 20,
      "start": 103.44000244140625,
      "end": 106.76000213623047,
      "text": " by these names and how it encouraged them and impacted them."
    },
    {
      "id": 21,
      "start": 106.76000213623047,
      "end": 112.83999633789062,
      "text": " And I said this last week, that as we today study the names of God, and we're looking"
    },
    {
      "id": 22,
      "start": 112.83999633789062,
      "end": 116.55999755859375,
      "text": " at ten of them, we did five last week and we'll do five this evening, but as we look"
    },
    {
      "id": 23,
      "start": 116.55999755859375,
      "end": 122.83999633789062,
      "text": " at these names of God that we have the opportunity just in like manner as those Old Testament"
    },
    {
      "id": 24,
      "start": 122.83999633789062,
      "end": 130.75999450683594,
      "text": " saints to be encouraged as we are reminded of who our God is and how He has revealed"
    },
    {
      "id": 25,
      "start": 130.75999450683594,
      "end": 135.55999755859375,
      "text": " Himself in Proverbs 18 and verse number 10, the Bible says, the name of the Lord is a"
    },
    {
      "id": 26,
      "start": 135.55999755859375,
      "end": 141.44000244140625,
      "text": " strong tower, the righteous runneth into it and is safe."
    },
    {
      "id": 27,
      "start": 141.44000244140625,
      "end": 146.3000030517578,
      "text": " The psalmist said in Psalm 148 and verse number 13, let them praise the name of the Lord,"
    },
    {
      "id": 28,
      "start": 146.3000030517578,
      "end": 153.55999755859375,
      "text": " for His name alone is excellent, His glory is above the earth and heaven."
    },
    {
      "id": 29,
      "start": 153.55999755859375,
      "end": 158.16000366210938,
      "text": " In our first study dealing with Thy name is great, we looked at the name of God, Elohim."
    },
    {
      "id": 30,
      "start": 158.16000366210938,
      "end": 161.1199951171875,
      "text": " It's the first name of God that's used in all of the Bible."
    },
    {
      "id": 31,
      "start": 161.1199951171875,
      "end": 166.83999633789062,
      "text": " In Genesis chapter number 1, we find in the beginning God and we find that Elohim, meaning"
    },
    {
      "id": 32,
      "start": 166.83999633789062,
      "end": 171.16000366210938,
      "text": " the strong one, and dealing with the fact that He is the Creator and how that is so"
    },
    {
      "id": 33,
      "start": 171.16000366210938,
      "end": 177.1199951171875,
      "text": " foundational to understand the whole of Scripture, that He is the Creator."
    },
    {
      "id": 34,
      "start": 177.1199951171875,
      "end": 182.8800048828125,
      "text": " We dealt with the proper name of God, Yahweh or Jehovah, and understanding that He is the"
    },
    {
      "id": 35,
      "start": 182.8800048828125,
      "end": 184.8000030517578,
      "text": " self-existent One."
    },
    {
      "id": 36,
      "start": 184.8000030517578,
      "end": 186.63999938964844,
      "text": " In Him is life."
    },
    {
      "id": 37,
      "start": 186.63999938964844,
      "end": 190.8000030517578,
      "text": " People ask that question when you speak about God being the Creator, well, who created God?"
    },
    {
      "id": 38,
      "start": 190.8000030517578,
      "end": 192.9199981689453,
      "text": " No one, He is."
    },
    {
      "id": 39,
      "start": 192.9199981689453,
      "end": 197.1199951171875,
      "text": " And He is the self-existent One, Jehovah Yahweh."
    },
    {
      "id": 40,
      "start": 197.1199951171875,
      "end": 203.24000549316406,
      "text": " Adonai, dealing with the fact that He is Lord or Master, He is our strength, and we said"
    },
    {
      "id": 41,
      "start": 203.24000549316406,
      "end": 211.0,
      "text": " this last week, that as our Lord or as our Master, that He rightly deserves our worship"
    },
    {
      "id": 42,
      "start": 211.0,
      "end": 212.9199981689453,
      "text": " and our obedience."
    },
    {
      "id": 43,
      "start": 212.9199981689453,
      "end": 220.0,
      "text": " El Shaddai, the Lord God Almighty, and how we rejoice in God revealing Himself to Abram"
    },
    {
      "id": 44,
      "start": 220.0,
      "end": 223.63999938964844,
      "text": " as being El Shaddai, the Lord God Almighty."
    },
    {
      "id": 45,
      "start": 223.63999938964844,
      "end": 229.8800048828125,
      "text": " And I said this, after God had revealed Himself in that manner, He then says to Abraham in"
    },
    {
      "id": 46,
      "start": 229.8800048828125,
      "end": 234.39999389648438,
      "text": " the next chapter, is anything too hard for the Lord?"
    },
    {
      "id": 47,
      "start": 234.39999389648438,
      "end": 239.13999938964844,
      "text": " And what a blessing as we understand that He is the Lord God Almighty, obviously the"
    },
    {
      "id": 48,
      "start": 239.13999938964844,
      "end": 244.0399932861328,
      "text": " answer to that question is no, there's nothing too hard for you, you've just revealed yourself"
    },
    {
      "id": 49,
      "start": 244.0399932861328,
      "end": 248.83999633789062,
      "text": " to me as being the Lord God Almighty, the Almighty One."
    },
    {
      "id": 50,
      "start": 248.83999633789062,
      "end": 255.36000061035156,
      "text": " And then we looked and finished up with Jehovah Ra, and that means the Lord is my shepherd,"
    },
    {
      "id": 51,
      "start": 255.36000061035156,
      "end": 258.5199890136719,
      "text": " we see that in Psalm 23."
    },
    {
      "id": 52,
      "start": 258.5199890136719,
      "end": 264.4800109863281,
      "text": " And of course we noted last week that David, as the sweet psalmist of Israel, is the one"
    },
    {
      "id": 53,
      "start": 264.4800109863281,
      "end": 269.70001220703125,
      "text": " that God used to pen Psalm 23, that of course he was a shepherd, but really if you think"
    },
    {
      "id": 54,
      "start": 269.70001220703125,
      "end": 275.8399963378906,
      "text": " about it, a lot of the Old Testament saints, they were, or whether they were shepherds"
    },
    {
      "id": 55,
      "start": 275.8399963378906,
      "end": 282.55999755859375,
      "text": " or very closely associated with shepherding, they would have had a great understanding"
    },
    {
      "id": 56,
      "start": 282.55999755859375,
      "end": 289.4800109863281,
      "text": " of that truth when God says, I am your shepherd, and all that that means, and all that carries"
    },
    {
      "id": 57,
      "start": 289.4800109863281,
      "end": 290.4800109863281,
      "text": " with it."
    },
    {
      "id": 58,
      "start": 290.4800109863281,
      "end": 293.3599853515625,
      "text": " This evening, as we continue our study, I want you to turn to the book of Exodus, Exodus"
    },
    {
      "id": 59,
      "start": 293.3599853515625,
      "end": 298.67999267578125,
      "text": " chapter number 15, and the sixth name that we'll look at this evening, name of God, is"
    },
    {
      "id": 60,
      "start": 298.67999267578125,
      "end": 302.4800109863281,
      "text": " Jehovah Rapha, Jehovah Rapha."
    },
    {
      "id": 61,
      "start": 302.4800109863281,
      "end": 307.05999755859375,
      "text": " And this is given to us here in Exodus chapter number 15."
    },
    {
      "id": 62,
      "start": 307.05999755859375,
      "end": 311.8800048828125,
      "text": " We sang the song this evening, how appropriate, the first song that we sang this evening,"
    },
    {
      "id": 63,
      "start": 311.8800048828125,
      "end": 316.8599853515625,
      "text": " When I See the Blood, and of course a reminder of the Passover, and so contextually to find"
    },
    {
      "id": 64,
      "start": 316.8599853515625,
      "end": 321.20001220703125,
      "text": " out exactly all that's going on here in the book of Exodus, we find that the plagues have"
    },
    {
      "id": 65,
      "start": 321.20001220703125,
      "end": 326.67999267578125,
      "text": " been, all ten of them have been given, and we find that of course the tenth being that"
    },
    {
      "id": 66,
      "start": 326.67999267578125,
      "end": 331.1600036621094,
      "text": " of the Passover and the importance of applying the blood, and then of course the children"
    },
    {
      "id": 67,
      "start": 331.1600036621094,
      "end": 336.239990234375,
      "text": " of Israel leave Egypt, and then the 14th chapter records for us the drying up of the"
    },
    {
      "id": 68,
      "start": 336.239990234375,
      "end": 337.239990234375,
      "text": " Red Sea."
    },
    {
      "id": 69,
      "start": 337.239990234375,
      "end": 344.3599853515625,
      "text": " They get into chapter 15, and you hear about all of the song of praise for what God did,"
    },
    {
      "id": 70,
      "start": 344.3599853515625,
      "end": 349.3999938964844,
      "text": " and not long after their singing praise, they're complaining about the fact that they found"
    },
    {
      "id": 71,
      "start": 349.3999938964844,
      "end": 354.8800048828125,
      "text": " no water, and that's contained for us at the end of the 15th chapter of the book of Exodus."
    },
    {
      "id": 72,
      "start": 354.8800048828125,
      "end": 359.8800048828125,
      "text": " And notice with me, as they would complain about finding no water, remember they're at"
    },
    {
      "id": 73,
      "start": 359.8800048828125,
      "end": 364.1199951171875,
      "text": " Marah, and they're exactly where God had led them to in verse number 23, it says,"
    },
    {
      "id": 74,
      "start": 364.1199951171875,
      "end": 368.6400146484375,
      "text": " When they came to Marah, they could not drink of the waters of Marah, for they were bitter."
    },
    {
      "id": 75,
      "start": 368.6400146484375,
      "end": 372.44000244140625,
      "text": " And so they come to this place, they had no water, then they come to a place where there's"
    },
    {
      "id": 76,
      "start": 372.44000244140625,
      "end": 374.6400146484375,
      "text": " water, but they cannot drink the water."
    },
    {
      "id": 77,
      "start": 374.6400146484375,
      "end": 377.4800109863281,
      "text": " The people murmured against Moses, saying, What shall we drink?"
    },
    {
      "id": 78,
      "start": 377.4800109863281,
      "end": 381.239990234375,
      "text": " And the Lord showed them a tree, in verse number 25, and told them that he would make"
    },
    {
      "id": 79,
      "start": 381.239990234375,
      "end": 384.8800048828125,
      "text": " the water sweet, and of course that's what he did."
    },
    {
      "id": 80,
      "start": 384.8800048828125,
      "end": 390.6000061035156,
      "text": " It says at the end of verse number 25 that there he proved them, and of course they had"
    },
    {
      "id": 81,
      "start": 390.6000061035156,
      "end": 398.7200012207031,
      "text": " already seen God do amazing things, eyewitnesses of his power, and now we see this once again"
    },
    {
      "id": 82,
      "start": 398.7200012207031,
      "end": 403.239990234375,
      "text": " where God is giving them, revealing to them his power."
    },
    {
      "id": 83,
      "start": 403.239990234375,
      "end": 408.760009765625,
      "text": " We find in verse number 26, notice what God says, And said, If thou wilt diligently hearken"
    },
    {
      "id": 84,
      "start": 408.760009765625,
      "end": 413.44000244140625,
      "text": " to the voice of the Lord thy God, and wilt do that which is right in his sight, and wilt"
    },
    {
      "id": 85,
      "start": 413.44000244140625,
      "end": 419.20001220703125,
      "text": " give ear to his commandments, and keep all his statutes, I will put none of these diseases"
    },
    {
      "id": 86,
      "start": 419.20001220703125,
      "end": 422.8800048828125,
      "text": " upon thee, which I have brought upon the Egyptians."
    },
    {
      "id": 87,
      "start": 422.8800048828125,
      "end": 427.6000061035156,
      "text": " Notice what he says, For I am the Lord that healeth thee."
    },
    {
      "id": 88,
      "start": 427.6000061035156,
      "end": 432.67999267578125,
      "text": " And of course you see again, as I've mentioned last week, that Lord there at the end of verse"
    },
    {
      "id": 89,
      "start": 432.67999267578125,
      "end": 437.9599914550781,
      "text": " number 26, and your Bible should be in all caps, it's Jehovah or Yahweh, and so that's"
    },
    {
      "id": 90,
      "start": 437.9599914550781,
      "end": 443.6400146484375,
      "text": " where we see Jehovah Rapha, the Lord that heals, and he says, I am the Lord that healeth"
    },
    {
      "id": 91,
      "start": 443.6400146484375,
      "end": 444.6400146484375,
      "text": " thee."
    },
    {
      "id": 92,
      "start": 444.6400146484375,
      "end": 448.3800048828125,
      "text": " Now think about the context they're going into, of course we know that they don't enter"
    },
    {
      "id": 93,
      "start": 448.3800048828125,
      "end": 452.20001220703125,
      "text": " immediately into the land of promise because of their doubt and their unbelief, and they"
    },
    {
      "id": 94,
      "start": 452.20001220703125,
      "end": 457.2799987792969,
      "text": " wander in the wilderness, but God is saying to them, I will put none of these diseases"
    },
    {
      "id": 95,
      "start": 457.2799987792969,
      "end": 463.1600036621094,
      "text": " upon thee, which I have brought upon the Egyptians, for I am the Lord that healeth thee."
    },
    {
      "id": 96,
      "start": 463.1600036621094,
      "end": 468.0,
      "text": " And I want you to think about the impact that that truth, of God revealing himself"
    },
    {
      "id": 97,
      "start": 468.0,
      "end": 474.6400146484375,
      "text": " to his people in this manner by using the name Jehovah Rapha, how that would encourage"
    },
    {
      "id": 98,
      "start": 474.6400146484375,
      "end": 479.67999267578125,
      "text": " them when they were aware of diseases, when they were aware of those things, that we serve"
    },
    {
      "id": 99,
      "start": 479.67999267578125,
      "end": 482.32000732421875,
      "text": " the Lord God who is able to heal."
    },
    {
      "id": 100,
      "start": 482.32000732421875,
      "end": 488.8800048828125,
      "text": " And we understand that the scriptures would record for us of those that had inquired and"
    },
    {
      "id": 101,
      "start": 488.8800048828125,
      "end": 494.8399963378906,
      "text": " asked for God to provide healing, and we find many examples of God doing just that."
    },
    {
      "id": 102,
      "start": 494.8399963378906,
      "end": 495.8399963378906,
      "text": " Why?"
    },
    {
      "id": 103,
      "start": 495.8399963378906,
      "end": 499.8800048828125,
      "text": " Because he's the Lord that heals, and he has power over sickness and disease."
    },
    {
      "id": 104,
      "start": 499.8800048828125,
      "end": 504.239990234375,
      "text": " We see that in the person of Jesus Christ, as you study the gospel records, how that"
    },
    {
      "id": 105,
      "start": 504.239990234375,
      "end": 509.0799865722656,
      "text": " he would, through the miracles, perform many miracles in which he demonstrated this power"
    },
    {
      "id": 106,
      "start": 509.0799865722656,
      "end": 510.5199890136719,
      "text": " over sickness and disease."
    },
    {
      "id": 107,
      "start": 510.5199890136719,
      "end": 514.8800048828125,
      "text": " And we as New Testament believers, we have the truth of James 5 when he says, if any"
    },
    {
      "id": 108,
      "start": 514.8800048828125,
      "end": 519.1199951171875,
      "text": " are sick, let them pray, knowing that our God is able."
    },
    {
      "id": 109,
      "start": 519.1199951171875,
      "end": 521.5999755859375,
      "text": " He is the Lord that heals."
    },
    {
      "id": 110,
      "start": 521.5999755859375,
      "end": 524.3599853515625,
      "text": " Number seven, Jehovah Jireh."
    },
    {
      "id": 111,
      "start": 524.3599853515625,
      "end": 529.4400024414062,
      "text": " You have to turn back to the book of Genesis in chapter number 22, Jehovah Jireh, it means"
    },
    {
      "id": 112,
      "start": 529.4400024414062,
      "end": 533.1199951171875,
      "text": " the Lord will provide."
    },
    {
      "id": 113,
      "start": 533.1199951171875,
      "end": 536.760009765625,
      "text": " And aren't you thankful for the provision of God?"
    },
    {
      "id": 114,
      "start": 536.760009765625,
      "end": 543.2000122070312,
      "text": " And as we begin to look at our lives and look at how good God has been to us, we would understand"
    },
    {
      "id": 115,
      "start": 543.6400146484375,
      "end": 548.0800170898438,
      "text": " that he has provided for us more than we really deserve."
    },
    {
      "id": 116,
      "start": 548.0800170898438,
      "end": 553.7000122070312,
      "text": " And of course, we understand here, contextually, in Genesis chapter number 22, it's the offering"
    },
    {
      "id": 117,
      "start": 553.7000122070312,
      "end": 555.239990234375,
      "text": " of Isaac."
    },
    {
      "id": 118,
      "start": 555.239990234375,
      "end": 559.9199829101562,
      "text": " And when you think about the offering of Isaac, of course, Abraham and Sarah had been promised"
    },
    {
      "id": 119,
      "start": 559.9199829101562,
      "end": 565.1599731445312,
      "text": " a son, and now Abraham has been instructed to get up into a mountain to there offer his"
    },
    {
      "id": 120,
      "start": 565.1599731445312,
      "end": 566.3200073242188,
      "text": " son."
    },
    {
      "id": 121,
      "start": 566.3200073242188,
      "end": 568.0800170898438,
      "text": " And Abraham was obedient."
    },
    {
      "id": 122,
      "start": 568.0800170898438,
      "end": 569.239990234375,
      "text": " Abraham had faith."
    },
    {
      "id": 123,
      "start": 569.239990234375,
      "end": 574.5,
      "text": " Abraham said to his son, when Isaac said, where is the lamb for a burnt offering?"
    },
    {
      "id": 124,
      "start": 574.5,
      "end": 580.9199829101562,
      "text": " We find that Abraham replied and said, God will provide himself a lamb for a burnt offering."
    },
    {
      "id": 125,
      "start": 580.9199829101562,
      "end": 585.3599853515625,
      "text": " And he goes through the process and he lays his son upon the altar and he lifts his hand"
    },
    {
      "id": 126,
      "start": 585.3599853515625,
      "end": 587.280029296875,
      "text": " ready to slay his son."
    },
    {
      "id": 127,
      "start": 587.280029296875,
      "end": 591.1799926757812,
      "text": " And the Bible says in verse number 11, that the angel of the Lord called unto him out"
    },
    {
      "id": 128,
      "start": 591.1799926757812,
      "end": 593.5599975585938,
      "text": " of heaven and said, Abraham, Abraham."
    },
    {
      "id": 129,
      "start": 593.5599975585938,
      "end": 595.47998046875,
      "text": " And he said, hear my."
    },
    {
      "id": 130,
      "start": 595.47998046875,
      "end": 599.6400146484375,
      "text": " And he said, lay not thine hand upon the lad, neither do thou anything unto him."
    },
    {
      "id": 131,
      "start": 599.6400146484375,
      "end": 600.3599853515625,
      "text": " For now I know."
    },
    {
      "id": 0,
      "start": 600.3599853515625,
      "end": 605.2399854660034,
      "text": " that thou fears God seeing thou has not withheld thy son thine only son for me"
    },
    {
      "id": 1,
      "start": 605.2399854660034,
      "end": 608.7599849700928,
      "text": " and Abraham lifted up his eyes and looked and notice what it says and"
    },
    {
      "id": 2,
      "start": 608.7599849700928,
      "end": 613.5999851226807,
      "text": " behold behind him a ram caught a thicket by his horns and Abraham went and took"
    },
    {
      "id": 3,
      "start": 613.5999851226807,
      "end": 617.7599849700928,
      "text": " the ram and offered him for a burnt offering in the stead of his son and"
    },
    {
      "id": 4,
      "start": 617.7599849700928,
      "end": 622.8399848937988,
      "text": " Abraham called the name of that place Jehovah Jireh as it is said to this day"
    },
    {
      "id": 5,
      "start": 622.8399848937988,
      "end": 628.639986038208,
      "text": " in the Mount of the Lord it shall be seen the Lord will provide Abraham"
    },
    {
      "id": 6,
      "start": 628.639986038208,
      "end": 632.7999839782715,
      "text": " experienced this and we sometimes we look at the scriptures and we study the"
    },
    {
      "id": 7,
      "start": 632.7999839782715,
      "end": 637.1199836730957,
      "text": " Word of God and we're aware of some of the accounts and we know what happens we"
    },
    {
      "id": 8,
      "start": 637.1199836730957,
      "end": 641.8399848937988,
      "text": " sometimes can fail to remember the fact that they were living this moment by"
    },
    {
      "id": 9,
      "start": 641.8399848937988,
      "end": 646.8399848937988,
      "text": " moment step by step and Abraham had faith and the book of Hebrews tells us"
    },
    {
      "id": 10,
      "start": 646.8399848937988,
      "end": 650.9199867248535,
      "text": " in the 11th chapter that he believed that even if his son were to die there"
    },
    {
      "id": 11,
      "start": 650.9199867248535,
      "end": 655.9599838256836,
      "text": " upon the altar that God could raise him up and what faith Abraham had but we"
    },
    {
      "id": 12,
      "start": 655.9599838256836,
      "end": 660.159984588623,
      "text": " find that the Lord provided of course we would understand as we look at"
    },
    {
      "id": 13,
      "start": 660.159984588623,
      "end": 666.6399841308594,
      "text": " Genesis 22 and think about the the type of Messiah who would come of course the"
    },
    {
      "id": 14,
      "start": 666.6399841308594,
      "end": 672.2799835205078,
      "text": " Lamb of God that would go of course and go to the cross of Calvary shed his"
    },
    {
      "id": 15,
      "start": 672.2799835205078,
      "end": 678.119987487793,
      "text": " precious blood so that we could have redemption and have of course be"
    },
    {
      "id": 16,
      "start": 678.119987487793,
      "end": 683.6799850463867,
      "text": " reconciled to God and what a blessing that is God the the greatest need of"
    },
    {
      "id": 17,
      "start": 683.6799850463867,
      "end": 690.2799835205078,
      "text": " mankind is a Savior the greatest need our greatest need is not an educator our"
    },
    {
      "id": 18,
      "start": 690.2799835205078,
      "end": 694.599983215332,
      "text": " greatest need is not a philosopher our greatest need is not a you to fill in"
    },
    {
      "id": 19,
      "start": 694.599983215332,
      "end": 699.2799835205078,
      "text": " the blank and we don't need someone to come and do these things know where the"
    },
    {
      "id": 20,
      "start": 699.2799835205078,
      "end": 706.5199890136719,
      "text": " greatest need for mankind is a Savior and God provided his own son of course"
    },
    {
      "id": 21,
      "start": 706.5199890136719,
      "end": 711.5199890136719,
      "text": " God and flesh the Lord Jesus Christ came and went to the cross of Calvary to pay"
    },
    {
      "id": 22,
      "start": 711.5199890136719,
      "end": 715.9999847412109,
      "text": " for the sin of mankind and what a blessing that is for us to understand"
    },
    {
      "id": 23,
      "start": 715.9999847412109,
      "end": 721.1599884033203,
      "text": " this evening and of course as we think about this passage again understanding"
    },
    {
      "id": 24,
      "start": 721.1599884033203,
      "end": 725.3199844360352,
      "text": " the impact that these names would have upon the patriarchs and the people of"
    },
    {
      "id": 25,
      "start": 725.3199844360352,
      "end": 730.5599822998047,
      "text": " God as they would read the accounts and they would read the names and they would"
    },
    {
      "id": 26,
      "start": 730.5599822998047,
      "end": 737.7199859619141,
      "text": " be aware of the fact that our God provides and how that was to give them a"
    },
    {
      "id": 27,
      "start": 737.7199859619141,
      "end": 743.7599792480469,
      "text": " greater level of faith number eight if you're taking notes Jehovah Shalom and"
    },
    {
      "id": 28,
      "start": 743.7599792480469,
      "end": 747.5199890136719,
      "text": " of course many of you would know already just from that name that that is the"
    },
    {
      "id": 29,
      "start": 747.5199890136719,
      "end": 753.5199890136719,
      "text": " Lord is peace the Lord is peace and look over the book of judges if you will in"
    },
    {
      "id": 30,
      "start": 753.5199890136719,
      "end": 758.8799896240234,
      "text": " chapter number six and judges chapter number six and verse number 24 is where"
    },
    {
      "id": 31,
      "start": 758.8799896240234,
      "end": 764.9999847412109,
      "text": " we see the use of Jehovah Shalom and of course this is the text of scripture in"
    },
    {
      "id": 32,
      "start": 764.9999847412109,
      "end": 770.4399871826172,
      "text": " judges 6 over through judges 8 dealing with the life and and really the"
    },
    {
      "id": 33,
      "start": 770.4399871826172,
      "end": 775.5199890136719,
      "text": " ministry of Gideon and Gideon we know several things about Gideon and he was"
    },
    {
      "id": 34,
      "start": 775.5199890136719,
      "end": 780.239990234375,
      "text": " in a position where he needed to have his faith increased he had a task that"
    },
    {
      "id": 35,
      "start": 780.239990234375,
      "end": 785.7599792480469,
      "text": " was assigned to him and as we look at the passage of scripture the the angel"
    },
    {
      "id": 36,
      "start": 785.7599792480469,
      "end": 788.5199890136719,
      "text": " had appeared to him and then the angel departed out of his sight in verse"
    },
    {
      "id": 37,
      "start": 788.5199890136719,
      "end": 792.1599884033203,
      "text": " number 22 if you pick it up there with me the Bible says when Gideon perceived"
    },
    {
      "id": 38,
      "start": 792.1599884033203,
      "end": 796.0399780273438,
      "text": " that he was an angel of the Lord Gideon said alas O Lord God for because I have"
    },
    {
      "id": 39,
      "start": 796.0399780273438,
      "end": 800.47998046875,
      "text": " seen an angel of the face of the Lord excuse me face to face and the Lord said"
    },
    {
      "id": 40,
      "start": 800.47998046875,
      "end": 806.4399871826172,
      "text": " unto him peace be unto thee fear not thou shalt not die and so we understand"
    },
    {
      "id": 41,
      "start": 806.4399871826172,
      "end": 811.6799926757812,
      "text": " that there's a level of fear and of course the need for peace and God says"
    },
    {
      "id": 42,
      "start": 811.6799926757812,
      "end": 816.5199890136719,
      "text": " the Lord you notice again in verse number 23 of judges 6 that it's all"
    },
    {
      "id": 43,
      "start": 816.5199890136719,
      "end": 823.239990234375,
      "text": " caps Jehovah Yahweh the Bible says the Lord said unto him peace be unto thee"
    },
    {
      "id": 44,
      "start": 823.239990234375,
      "end": 828.8399810791016,
      "text": " and he tells him to fear not thou shalt not die then notice in verse number 24"
    },
    {
      "id": 45,
      "start": 828.8399810791016,
      "end": 832.9999847412109,
      "text": " then Gideon built an altar there unto the Lord and called it Jehovah Shalom"
    },
    {
      "id": 46,
      "start": 832.9999847412109,
      "end": 839.7199859619141,
      "text": " unto this day is yet it or for it and is of the Abba's rights and so we find here"
    },
    {
      "id": 47,
      "start": 839.7199859619141,
      "end": 847.239990234375,
      "text": " that as God would say to to Gideon peace be unto thee then Gideon would"
    },
    {
      "id": 48,
      "start": 847.239990234375,
      "end": 851.7999877929688,
      "text": " build an altar which is an appropriate response of worship and he would there"
    },
    {
      "id": 49,
      "start": 851.7999877929688,
      "end": 859.5599975585938,
      "text": " call the name of the Lord Jehovah Shalom the God the Lord of peace and I'm so"
    },
    {
      "id": 50,
      "start": 859.5599975585938,
      "end": 864.47998046875,
      "text": " thankful that he is the Lord of peace and we understand the Bible says great"
    },
    {
      "id": 51,
      "start": 864.47998046875,
      "end": 869.3199768066406,
      "text": " peace have they which love thy law and nothing shall offend them in Psalm 119"
    },
    {
      "id": 52,
      "start": 869.3199768066406,
      "end": 875.3999938964844,
      "text": " we find that the Bible speaks in this manner think about this and Isaiah when"
    },
    {
      "id": 53,
      "start": 875.3999938964844,
      "end": 880.3999938964844,
      "text": " we think about the the truth of the peace of God and Isaiah 26 and verse"
    },
    {
      "id": 54,
      "start": 880.3999938964844,
      "end": 886.3599853515625,
      "text": " number 23 thou will keep him in perfect peace whose mind is stayed on thee"
    },
    {
      "id": 55,
      "start": 886.3599853515625,
      "end": 891.7999877929688,
      "text": " because he trusted in thee trust you in the Lord forever for in the Lord Jehovah"
    },
    {
      "id": 56,
      "start": 891.7999877929688,
      "end": 897.8799743652344,
      "text": " is everlasting strength not only that strength but that peace and Jehovah"
    },
    {
      "id": 57,
      "start": 897.8799743652344,
      "end": 901.5599975585938,
      "text": " Shalom think about all of the Old Testament really if you think about all"
    },
    {
      "id": 58,
      "start": 901.5599975585938,
      "end": 905.1199951171875,
      "text": " of the trials and troubles and difficulties and all of the various"
    },
    {
      "id": 59,
      "start": 905.1199951171875,
      "end": 911.3599853515625,
      "text": " things that the people of God dealt with to know God is the God of peace the Lord"
    },
    {
      "id": 60,
      "start": 911.3599853515625,
      "end": 918.2799987792969,
      "text": " is peace see this evening there are times in which we may have the idea that"
    },
    {
      "id": 61,
      "start": 918.2799987792969,
      "end": 923.9199829101562,
      "text": " peace equals the absence of trouble and a lot of times we're kind of programmed"
    },
    {
      "id": 62,
      "start": 923.9199829101562,
      "end": 928.1999816894531,
      "text": " to think that way that peace means there's no trouble but the reality is"
    },
    {
      "id": 63,
      "start": 928.1999816894531,
      "end": 934.5199890136719,
      "text": " that we can have the peace of God in the midst of great turmoil and trouble"
    },
    {
      "id": 64,
      "start": 934.5199890136719,
      "end": 939.3999938964844,
      "text": " because peace is not found in the absence of trouble peace is found in the"
    },
    {
      "id": 65,
      "start": 939.3999938964844,
      "end": 944.719970703125,
      "text": " presence of God and you can find yourself in the midst of all sorts of"
    },
    {
      "id": 66,
      "start": 944.719970703125,
      "end": 949.4399719238281,
      "text": " difficulties I mean do you believe this evening that Daniel had peace when he"
    },
    {
      "id": 67,
      "start": 949.4399719238281,
      "end": 954.1999816894531,
      "text": " was in the den of lions sure he did it was the king that had a sleepless night"
    },
    {
      "id": 68,
      "start": 954.1999816894531,
      "end": 960.0399780273438,
      "text": " it was not Daniel for the Lord sent his angel to shut the mouths of the lions"
    },
    {
      "id": 69,
      "start": 960.0399780273438,
      "end": 964.239990234375,
      "text": " and he had peace I think about of course it's the New Testament but I think about"
    },
    {
      "id": 70,
      "start": 964.239990234375,
      "end": 969.1199951171875,
      "text": " Peter when he's there in prison and he slept like a baby I mean he slept right"
    },
    {
      "id": 71,
      "start": 969.1199951171875,
      "end": 974.1599731445312,
      "text": " between a couple of soldiers and why because he had peace and the Bible tells"
    },
    {
      "id": 72,
      "start": 974.1599731445312,
      "end": 978.47998046875,
      "text": " us again as New Testament believers that he gives us a peace and he"
    },
    {
      "id": 73,
      "start": 978.47998046875,
      "end": 984.0399780273438,
      "text": " describes it as a peace that passeth all understanding let the peace of God rule"
    },
    {
      "id": 74,
      "start": 984.0399780273438,
      "end": 988.4399719238281,
      "text": " in your hearts the Bible tells us in the book of Colossians and so we find this"
    },
    {
      "id": 75,
      "start": 988.4399719238281,
      "end": 995.1599731445312,
      "text": " evening how that the people of God in dealing with many various opposition"
    },
    {
      "id": 76,
      "start": 995.1599731445312,
      "end": 1000.5999755859375,
      "text": " adversity all sorts of things going on for them to have the knowledge that God"
    },
    {
      "id": 77,
      "start": 1000.5999755859375,
      "end": 1006.719970703125,
      "text": " one of his names has been given as Jehovah Shalom that he is the that the"
    },
    {
      "id": 78,
      "start": 1006.719970703125,
      "end": 1014.4399719238281,
      "text": " Lord is peace remember that again as we kind of look at some of the the truth"
    },
    {
      "id": 79,
      "start": 1014.4399719238281,
      "end": 1019.2799987792969,
      "text": " with regard to the Old Testament into the New Testament and the prophecy of"
    },
    {
      "id": 80,
      "start": 1019.2799987792969,
      "end": 1024.8799743652344,
      "text": " Isaiah with regard to Messiah and the the Lord Jesus Christ and that the Bible"
    },
    {
      "id": 81,
      "start": 1024.8799743652344,
      "end": 1031.3599853515625,
      "text": " tells us about the names of our God the Bible says about the Lord Jesus Christ"
    },
    {
      "id": 82,
      "start": 1031.3599853515625,
      "end": 1035.3599853515625,
      "text": " that his name shall be called Wonderful Counselor the Mighty God the Everlasting"
    },
    {
      "id": 83,
      "start": 1035.3599853515625,
      "end": 1042.8399963378906,
      "text": " Father the Prince of Peace and what a joy to know the peace of God Jehovah"
    },
    {
      "id": 84,
      "start": 1042.8399963378906,
      "end": 1048.8799743652344,
      "text": " Shalom number nine if you're taking notes l alone l Olam excuse me I think I"
    },
    {
      "id": 85,
      "start": 1048.8799743652344,
      "end": 1054.719970703125,
      "text": " pronounce it wrong the first time l Olam and that is the Everlasting God now we"
    },
    {
      "id": 86,
      "start": 1054.719970703125,
      "end": 1058.6799926757812,
      "text": " think about l Olam and of course we've already mentioned about some of the"
    },
    {
      "id": 87,
      "start": 1058.6799926757812,
      "end": 1063.3199768066406,
      "text": " attributes the natural attributes of God not only that he's omnipotent and"
    },
    {
      "id": 88,
      "start": 1063.3199768066406,
      "end": 1068.1599731445312,
      "text": " omniscient and omnipresent but the fact that he's immutable and eternal that he"
    },
    {
      "id": 89,
      "start": 1068.1599731445312,
      "end": 1074.0,
      "text": " has no beginning and no end he is Alpha and Omega that he is he was and he is to"
    },
    {
      "id": 90,
      "start": 1074.0,
      "end": 1078.5599975585938,
      "text": " come and we understand this evening when we look at this name of God the"
    },
    {
      "id": 91,
      "start": 1078.5599975585938,
      "end": 1084.1199951171875,
      "text": " Everlasting God that we understand that he rules for all of eternity he is the"
    },
    {
      "id": 92,
      "start": 1084.1199951171875,
      "end": 1090.9599914550781,
      "text": " God of eternity in Genesis chapter 21 in verse number 33 it is good for us to"
    },
    {
      "id": 93,
      "start": 1090.9599914550781,
      "end": 1098.719970703125,
      "text": " know that our God is eternal that that he has no beginning and no end and this"
    },
    {
      "id": 94,
      "start": 1098.719970703125,
      "end": 1103.1599731445312,
      "text": " text of Scripture here in Genesis chapter 21 the Bible tells us in verse"
    },
    {
      "id": 95,
      "start": 1103.1599731445312,
      "end": 1108.5199890136719,
      "text": " number 33 that it says in Abraham planted a grove in Beersheba and called"
    },
    {
      "id": 96,
      "start": 1108.5199890136719,
      "end": 1114.1199951171875,
      "text": " there on the name of the Lord notice what it says the Everlasting God and"
    },
    {
      "id": 97,
      "start": 1114.1199951171875,
      "end": 1119.9599609375,
      "text": " what a joy to know this truth of our God notice what it said in Isaiah chapter"
    },
    {
      "id": 98,
      "start": 1119.9599609375,
      "end": 1125.0,
      "text": " number 40 and verse number 28 I'll give you a moment to turn there Isaiah"
    },
    {
      "id": 99,
      "start": 1125.0,
      "end": 1129.9199829101562,
      "text": " chapter number 40 and verse number 28 and as you're turning there I will make"
    },
    {
      "id": 100,
      "start": 1129.9199829101562,
      "end": 1135.719970703125,
      "text": " mention of truth from the the book of Psalms when the Bible says this in Psalm"
    },
    {
      "id": 101,
      "start": 1135.719970703125,
      "end": 1139.6400146484375,
      "text": " 90 and verse number 2 before the mountains were brought forth or ever"
    },
    {
      "id": 102,
      "start": 1139.6400146484375,
      "end": 1143.8800048828125,
      "text": " thou has formed the earth and the world even from everlasting to everlasting"
    },
    {
      "id": 103,
      "start": 1143.8800048828125,
      "end": 1150.6400146484375,
      "text": " thou art God here in Isaiah chapter number 40 and really you could read the"
    },
    {
      "id": 104,
      "start": 1150.6400146484375,
      "end": 1154.8399658203125,
      "text": " entire passage of Scripture and be greatly encouraged this evening but I"
    },
    {
      "id": 105,
      "start": 1154.8399658203125,
      "end": 1159.0799560546875,
      "text": " want to pick it up in verse number 28 the Bible says this hast thou not known"
    },
    {
      "id": 106,
      "start": 1159.0799560546875,
      "end": 1165.760009765625,
      "text": " hast thou not heard that the everlasting God the Lord the creator of"
    },
    {
      "id": 107,
      "start": 1165.760009765625,
      "end": 1170.5999755859375,
      "text": " the ends of the earth fainteth not neither is weary there is no searching"
    },
    {
      "id": 108,
      "start": 1170.5999755859375,
      "end": 1174.760009765625,
      "text": " of his understanding he giveth power to the faint to them that have no might he"
    },
    {
      "id": 109,
      "start": 1174.760009765625,
      "end": 1179.6400146484375,
      "text": " increaseth strength I mean you imagine in two verses of Scripture how encouraged"
    },
    {
      "id": 110,
      "start": 1179.6400146484375,
      "end": 1185.0399780273438,
      "text": " you could be and understanding who our God is that he is everlasting that he is"
    },
    {
      "id": 111,
      "start": 1185.0399780273438,
      "end": 1191.0,
      "text": " the Lord Jehovah the self-existent one that he is the creator that he doesn't"
    },
    {
      "id": 112,
      "start": 1191.0,
      "end": 1195.8399658203125,
      "text": " faint he doesn't grow weary aren't you thankful for that this evening and he is"
    },
    {
      "id": 113,
      "start": 1195.8399658203125,
      "end": 1202.3200073242188,
      "text": " the everlasting God and we understand this evening that"
    },
    {
      "id": 0,
      "start": 1202.3200073242188,
      "end": 1208.9000072479248,
      "text": " such, he could make these promises to his people, and his people could have faith"
    },
    {
      "id": 1,
      "start": 1208.9000072479248,
      "end": 1214.3800077438354,
      "text": " in what he was promising. Why? Because he's eternal, he's everlasting. And we"
    },
    {
      "id": 2,
      "start": 1214.3800077438354,
      "end": 1220.300006866455,
      "text": " understand on this side of Calvary, and looking back at the prophecies of the"
    },
    {
      "id": 3,
      "start": 1220.300006866455,
      "end": 1223.860008239746,
      "text": " Old Testament, and seeing the fulfillment of those prophecies, and rejoicing in"
    },
    {
      "id": 4,
      "start": 1223.860008239746,
      "end": 1229.1000080108643,
      "text": " the fact that our God is eternal, we've often said that the Word of God is"
    },
    {
      "id": 5,
      "start": 1229.1000080108643,
      "end": 1233.7800064086914,
      "text": " relevant today. Why? Because it's written by the God of eternity. It's written by"
    },
    {
      "id": 6,
      "start": 1233.7800064086914,
      "end": 1239.3800086975098,
      "text": " the God who transcends time. It's never going to be outdated, and it doesn't"
    },
    {
      "id": 7,
      "start": 1239.3800086975098,
      "end": 1245.300006866455,
      "text": " need to be updated. Amen? It's written by the God of the universe, who is eternal."
    },
    {
      "id": 8,
      "start": 1245.300006866455,
      "end": 1252.080005645752,
      "text": " He is the everlasting God. Number 10, El Elyon. El Elyon. We'll go back to"
    },
    {
      "id": 9,
      "start": 1252.080005645752,
      "end": 1257.0200080871582,
      "text": " Genesis chapter number 14 for this one, and this is one that I preached on a"
    },
    {
      "id": 10,
      "start": 1257.0600090026855,
      "end": 1260.8200073242188,
      "text": " Sunday evening not long ago as we were studying through the book of Genesis, and"
    },
    {
      "id": 11,
      "start": 1260.8200073242188,
      "end": 1267.9400100708008,
      "text": " you'll remember that Abram has a meeting after the defeat of the coalition of"
    },
    {
      "id": 12,
      "start": 1267.9400100708008,
      "end": 1273.020004272461,
      "text": " forces, and he rescues Lot from being captured, and all that takes place. We"
    },
    {
      "id": 13,
      "start": 1273.020004272461,
      "end": 1279.4000091552734,
      "text": " find that there were two meetings that Abram has in Genesis 14, and we made the"
    },
    {
      "id": 14,
      "start": 1279.4000091552734,
      "end": 1284.020004272461,
      "text": " statement as we studied the latter part of this chapter, that it was the king of"
    },
    {
      "id": 15,
      "start": 1284.020004272461,
      "end": 1289.9000091552734,
      "text": " Sodom that first came out to meet with Abram, but God so orchestrated it so"
    },
    {
      "id": 16,
      "start": 1289.9000091552734,
      "end": 1294.8200073242188,
      "text": " that the God of the universe so orchestrated it so"
    },
    {
      "id": 17,
      "start": 1294.8200073242188,
      "end": 1300.260009765625,
      "text": " the king of Salem, the king of righteousness, Melchizedek, would come and"
    },
    {
      "id": 18,
      "start": 1300.260009765625,
      "end": 1307.2200088500977,
      "text": " meet first with Abram, and he meets with Abram before the king of Sodom has an"
    },
    {
      "id": 19,
      "start": 1307.2200088500977,
      "end": 1312.0600051879883,
      "text": " opportunity to meet with Abram, and it's so important that we see in the text of"
    },
    {
      "id": 20,
      "start": 1312.0600051879883,
      "end": 1317.8200073242188,
      "text": " Scripture how that God allowed for the meeting between Abram and the king of"
    },
    {
      "id": 21,
      "start": 1317.8200073242188,
      "end": 1323.3000106811523,
      "text": " Salem, Melchizedek, to take place prior to the meeting with the king of Sodom. Why?"
    },
    {
      "id": 22,
      "start": 1323.3000106811523,
      "end": 1328.5600051879883,
      "text": " Because God was preparing Abram for that meeting that he would have with the king"
    },
    {
      "id": 23,
      "start": 1328.5600051879883,
      "end": 1332.9000091552734,
      "text": " of Sodom, and of course the king of Sodom was offering some things and what have"
    },
    {
      "id": 24,
      "start": 1332.9000091552734,
      "end": 1338.8600006103516,
      "text": " you, and God was going to teach him important lesson through this meeting"
    },
    {
      "id": 25,
      "start": 1338.8600006103516,
      "end": 1344.3000030517578,
      "text": " with Melchizedek. In verse number 18 of Genesis 14, the Bible says that Melchizedek,"
    },
    {
      "id": 26,
      "start": 1344.3000030517578,
      "end": 1349.9400024414062,
      "text": " king of Salem, brought forth bread and wine, notice what it says, and he was the"
    },
    {
      "id": 27,
      "start": 1349.9400024414062,
      "end": 1356.740005493164,
      "text": " priest of the Most High God. That's El Elyon, and this is the first mention of"
    },
    {
      "id": 28,
      "start": 1356.740005493164,
      "end": 1362.5800018310547,
      "text": " God in this manner as being the Most High God. The Bible says in verse 19 that"
    },
    {
      "id": 29,
      "start": 1362.5800018310547,
      "end": 1367.3400115966797,
      "text": " he blessed him and said, Blessed be Abram, notice again, of the Most High God,"
    },
    {
      "id": 30,
      "start": 1367.3400115966797,
      "end": 1373.3400115966797,
      "text": " possessor of heaven and earth. Now think about Abram receiving this information,"
    },
    {
      "id": 31,
      "start": 1373.3400115966797,
      "end": 1378.7000122070312,
      "text": " he's understanding this El Elyon, the Most High God, and Melchizedek"
    },
    {
      "id": 32,
      "start": 1378.7000122070312,
      "end": 1383.6200103759766,
      "text": " comes, he's the priest of the Most High God, he gives this"
    },
    {
      "id": 33,
      "start": 1383.6200103759766,
      "end": 1389.260009765625,
      "text": " blessing, he says, Blessed be Abram, of the Most High God, possessor of heaven and"
    },
    {
      "id": 34,
      "start": 1389.260009765625,
      "end": 1396.6200103759766,
      "text": " earth. And you begin to see how that God wants us to understand who he is, and as"
    },
    {
      "id": 35,
      "start": 1396.6200103759766,
      "end": 1401.0600128173828,
      "text": " we understand who he is, it prepares us for those things that we'll face on"
    },
    {
      "id": 36,
      "start": 1401.0600128173828,
      "end": 1406.2200012207031,
      "text": " the earth as we live our lives. The Bible says that he blessed, in verse number 20,"
    },
    {
      "id": 37,
      "start": 1406.2200012207031,
      "end": 1412.4200134277344,
      "text": " it says, and blessed be the Most High God, which hath delivered thine enemies"
    },
    {
      "id": 38,
      "start": 1412.4200134277344,
      "end": 1418.3800048828125,
      "text": " into thy hand, and he gave him tithes of all. And then notice in verse 21, now it's"
    },
    {
      "id": 39,
      "start": 1418.3800048828125,
      "end": 1421.1000061035156,
      "text": " the meeting with the king of Sodom, it says, and the king of Sodom said unto"
    },
    {
      "id": 40,
      "start": 1421.1000061035156,
      "end": 1427.5,
      "text": " Abram, give me the persons and take the goods to thyself. Abram said to the king"
    },
    {
      "id": 41,
      "start": 1427.5,
      "end": 1436.0600128173828,
      "text": " of Sodom, I have lift up mine hand unto the LORD. LORD is caps in your Bible,"
    },
    {
      "id": 42,
      "start": 1436.0600128173828,
      "end": 1444.0600128173828,
      "text": " correct? It's Jehovah, Yahweh. And then notice what it says, the Most High God,"
    },
    {
      "id": 43,
      "start": 1444.0600128173828,
      "end": 1450.8200073242188,
      "text": " El Elyon. Notice, the possessor of heaven and earth. I understand I said this just"
    },
    {
      "id": 44,
      "start": 1450.8200073242188,
      "end": 1454.5800018310547,
      "text": " a few weeks ago when we studied Genesis chapter number 14, but when you notice the"
    },
    {
      "id": 45,
      "start": 1454.5800018310547,
      "end": 1460.02001953125,
      "text": " response of Abram to the king of Sodom, in verse number 22, where did he get that"
    },
    {
      "id": 46,
      "start": 1460.02001953125,
      "end": 1464.5800170898438,
      "text": " from? He got it from his meeting with Melchizedek, the king of Salem. He knew"
    },
    {
      "id": 47,
      "start": 1464.5800170898438,
      "end": 1470.8600158691406,
      "text": " God was, of course he knew many things about God, but as he meets with"
    },
    {
      "id": 48,
      "start": 1470.8600158691406,
      "end": 1475.8600158691406,
      "text": " Melchizedek, and Melchizedek reveals that he is the Most High God, he's the"
    },
    {
      "id": 49,
      "start": 1475.8600158691406,
      "end": 1480.5800170898438,
      "text": " possessor of heaven and earth, and now when Sodom comes and wants to give him"
    },
    {
      "id": 50,
      "start": 1480.5800170898438,
      "end": 1486.6600036621094,
      "text": " some things, wants to enrich him in a certain sense, that Abram is saying, no,"
    },
    {
      "id": 51,
      "start": 1486.6600036621094,
      "end": 1493.3800048828125,
      "text": " no, I've lift up mine hand unto Jehovah God, El Elyon, the Most High God, the one"
    },
    {
      "id": 52,
      "start": 1493.3800048828125,
      "end": 1497.1000061035156,
      "text": " who is the possessor of heaven and earth. I don't need anything from you, king of"
    },
    {
      "id": 53,
      "start": 1497.1000061035156,
      "end": 1503.2200012207031,
      "text": " Sodom, because my God is able. And verse 23, it literally says, that I will"
    },
    {
      "id": 54,
      "start": 1503.2200012207031,
      "end": 1507.5,
      "text": " not take from a thread even to a shoelatch, and that I will not take"
    },
    {
      "id": 55,
      "start": 1507.5,
      "end": 1515.4800109863281,
      "text": " anything that is thine, lest thou shouldest say, I have made Abram rich. What"
    },
    {
      "id": 56,
      "start": 1515.4800109863281,
      "end": 1521.8200073242188,
      "text": " a blessing to see how that immediately in the life of Abram, in this particular"
    },
    {
      "id": 57,
      "start": 1521.8200073242188,
      "end": 1528.2200012207031,
      "text": " text of Scripture, the revelation of God through this name, El Elyon, the Most"
    },
    {
      "id": 58,
      "start": 1528.2200012207031,
      "end": 1533.3800048828125,
      "text": " High God, the possessor of heaven and earth, that it had an immediate impact in"
    },
    {
      "id": 59,
      "start": 1533.3800048828125,
      "end": 1538.0599975585938,
      "text": " the life of Abram. And see, that's the the reality this evening for us, the"
    },
    {
      "id": 60,
      "start": 1538.0599975585938,
      "end": 1542.6199951171875,
      "text": " application. We can study the names of God, and it's important for us to know"
    },
    {
      "id": 61,
      "start": 1542.6199951171875,
      "end": 1546.6600036621094,
      "text": " the names of God as we would be students of the Word of God, but it's important"
    },
    {
      "id": 62,
      "start": 1546.6600036621094,
      "end": 1551.2200012207031,
      "text": " that we don't just look at it from a scholarly perspective, that we look at it"
    },
    {
      "id": 63,
      "start": 1551.2200012207031,
      "end": 1555.5800170898438,
      "text": " from a level of intellect and what-have-you of knowing these names and"
    },
    {
      "id": 64,
      "start": 1555.5800170898438,
      "end": 1560.2200012207031,
      "text": " knowing the Hebrew names of God, but that we would truly allow it to impact our"
    },
    {
      "id": 65,
      "start": 1560.2200012207031,
      "end": 1566.02001953125,
      "text": " living, that we would allow it to have an influence upon our day-by-day"
    },
    {
      "id": 66,
      "start": 1566.02001953125,
      "end": 1572.260009765625,
      "text": " activities as we face various trials and difficulties and oppositions and"
    },
    {
      "id": 67,
      "start": 1572.260009765625,
      "end": 1578.4600219726562,
      "text": " temptations that we face in life, that we are mindful of who we serve and who He"
    },
    {
      "id": 68,
      "start": 1578.4600219726562,
      "end": 1585.1400146484375,
      "text": " is. And what a joy to know that as we study the Word of God, that God, see, God"
    },
    {
      "id": 69,
      "start": 1585.1400146484375,
      "end": 1593.02001953125,
      "text": " can't be described with just one name. I mean, He transcends us. I've often said to"
    },
    {
      "id": 70,
      "start": 1593.02001953125,
      "end": 1596.7000122070312,
      "text": " people over the years, and I've said to myself, even as I look at the Word of God"
    },
    {
      "id": 71,
      "start": 1596.7000122070312,
      "end": 1601.7799987792969,
      "text": " and try to study God and have a desire to know Him, and it should lead us to a"
    },
    {
      "id": 72,
      "start": 1601.7799987792969,
      "end": 1607.1000061035156,
      "text": " place that we stand in awe of who He is, but the reality this evening is that as"
    },
    {
      "id": 73,
      "start": 1607.1000061035156,
      "end": 1612.2200012207031,
      "text": " high and as mighty and as powerful as I think God is, as I can comprehend God to"
    },
    {
      "id": 74,
      "start": 1612.2200012207031,
      "end": 1618.7000122070312,
      "text": " be, He's far superior to the what I can even begin to comprehend. His greatness"
    },
    {
      "id": 75,
      "start": 1618.7000122070312,
      "end": 1623.2200012207031,
      "text": " is unsearchable. That's what the Word of God says. Now David declares, I know the"
    },
    {
      "id": 76,
      "start": 1623.2200012207031,
      "end": 1627.9800109863281,
      "text": " Lord is great. And then he also says, but the Lord's greatness is unsearchable."
    },
    {
      "id": 77,
      "start": 1627.9800109863281,
      "end": 1633.0599975585938,
      "text": " There's no contradiction there. It's just that our finite minds cannot fully"
    },
    {
      "id": 78,
      "start": 1633.0599975585938,
      "end": 1639.4600219726562,
      "text": " comprehend the infinite God. And so what He has done is He has revealed Himself"
    },
    {
      "id": 79,
      "start": 1639.4600219726562,
      "end": 1646.3000183105469,
      "text": " to us, and one of the means by which He is used is the names. And as He has given"
    },
    {
      "id": 80,
      "start": 1646.3000183105469,
      "end": 1651.7000122070312,
      "text": " Himself these names, He's revealing to His people various aspects of His"
    },
    {
      "id": 81,
      "start": 1651.7000122070312,
      "end": 1656.5,
      "text": " character and His ability, His attributes. Why? So that we'd be encouraged, so that"
    },
    {
      "id": 82,
      "start": 1656.5,
      "end": 1663.2200012207031,
      "text": " it would help us in this journey of life as we are mindful of who our God is."
    },
    {
      "id": 83,
      "start": 1664.1799926757812,
      "end": 1670.5,
      "text": " There's none like Him. As we go back and kind of finish up this study with the"
    },
    {
      "id": 84,
      "start": 1670.5,
      "end": 1675.4600219726562,
      "text": " truth of Jeremiah 10, I want to remind you again, and we started here, we've used the"
    },
    {
      "id": 85,
      "start": 1675.4600219726562,
      "end": 1679.3399963378906,
      "text": " verse often throughout the study, but I want to remind you of this verse as we"
    },
    {
      "id": 86,
      "start": 1679.3399963378906,
      "end": 1684.4600219726562,
      "text": " close in Jeremiah 10 and verse number 6, when Jeremiah declares,"
    },
    {
      "id": 87,
      "start": 1684.4600219726562,
      "end": 1695.7000122070312,
      "text": " For as much as there is none like unto Thee, O Lord. There's no one like Him. No one"
    },
    {
      "id": 88,
      "start": 1695.7000122070312,
      "end": 1701.6199951171875,
      "text": " like Him. All the false religions of the world, all that they try to serve, there's"
    },
    {
      "id": 89,
      "start": 1701.6199951171875,
      "end": 1709.9400024414062,
      "text": " no one like the Lord God Almighty, Jehovah God. It says, Thou art great, and"
    },
    {
      "id": 90,
      "start": 1710.5800170898438,
      "end": 1715.6199951171875,
      "text": " He is. Oh, He's a good God, and we often speak about the Lord is good, and we"
    },
    {
      "id": 91,
      "start": 1715.6199951171875,
      "end": 1720.4199829101562,
      "text": " should, for the Bible says that He is good. But He's great. His greatness, as I"
    },
    {
      "id": 92,
      "start": 1720.4199829101562,
      "end": 1724.3400268554688,
      "text": " mentioned a moment ago, is unsearchable. The Bible says in Psalm 48, Great is the"
    },
    {
      "id": 93,
      "start": 1724.3400268554688,
      "end": 1727.780029296875,
      "text": " Lord, and greatly to be praised. And then we have here at the end of verse number"
    },
    {
      "id": 94,
      "start": 1727.780029296875,
      "end": 1734.3800048828125,
      "text": " 6, And thy name is great in might. Let me remind you, as I said in one of our"
    },
    {
      "id": 95,
      "start": 1734.3800048828125,
      "end": 1741.780029296875,
      "text": " previous lessons, we think about how great our God is. We study theology. We"
    },
    {
      "id": 96,
      "start": 1741.780029296875,
      "end": 1748.1799926757812,
      "text": " want to have as our textbook, if you will, for theology, the Word of God, the Bible,"
    },
    {
      "id": 97,
      "start": 1748.1799926757812,
      "end": 1755.9400024414062,
      "text": " the revelation of God to man. We find that as we begin to study theology and"
    },
    {
      "id": 98,
      "start": 1755.9400024414062,
      "end": 1760.5,
      "text": " understand who God is, as He's revealed Himself, that yes, we stand in awe of Him,"
    },
    {
      "id": 99,
      "start": 1760.5,
      "end": 1764.780029296875,
      "text": " and yes, we say that He is great, but we must be mindful of the fact that the"
    },
    {
      "id": 100,
      "start": 1764.780029296875,
      "end": 1773.5800170898438,
      "text": " Bible says, For this God is our God forever and ever. He will be our guide"
    },
    {
      "id": 101,
      "start": 1773.5800170898438,
      "end": 1780.5800170898438,
      "text": " even unto death. Psalm 48 and verse number 14. I would submit to you this"
    },
    {
      "id": 102,
      "start": 1780.5800170898438,
      "end": 1787.3400268554688,
      "text": " evening that when you know Him as He's revealed Himself to you in His Word, you"
    },
    {
      "id": 103,
      "start": 1787.3400268554688,
      "end": 1794.02001953125,
      "text": " will agree with the psalmist and you will say that yes, He is great. And you"
    },
    {
      "id": 104,
      "start": 1794.02001953125,
      "end": 1800.6600341796875,
      "text": " will acknowledge that you want Him to be your guide even unto death. Why? I don't"
    },
    {
      "id": 105,
      "start": 1800.6600341796875,
      "end": 1803.8599853515625,
      "text": " want anyone else being my guide."
    },
    {
      "id": 0,
      "start": 1803.8599853515625,
      "end": 1804.8599853515625,
      "text": " Right?"
    },
    {
      "id": 1,
      "start": 1804.8599853515625,
      "end": 1809.1799855232239,
      "text": " When I understand who He is, why would I settle for someone else to be my guide?"
    },
    {
      "id": 2,
      "start": 1809.1799855232239,
      "end": 1811.6999855041504,
      "text": " Does that make sense?"
    },
    {
      "id": 3,
      "start": 1811.6999855041504,
      "end": 1817.1399850845337,
      "text": " And the psalmist says, He will be our guide even unto death."
    },
    {
      "id": 4,
      "start": 1817.1399850845337,
      "end": 1825.2799854278564,
      "text": " We serve a great God, and we are so blessed and so privileged to know the God of heaven."
    },
    {
      "id": 5,
      "start": 1825.2799854278564,
      "end": 1829.8999862670898,
      "text": " We ought to stand in awe of Him, and we ought to declare His greatness."
    },
    {
      "id": 6,
      "start": 1829.8999862670898,
      "end": 1830.8999862670898,
      "text": " Let's pray."
    },
    {
      "id": 7,
      "start": 1830.8999862670898,
      "end": 1831.8999862670898,
      "text": " Father, we love You."
    },
    {
      "id": 8,
      "start": 1831.8999862670898,
      "end": 1833.4599857330322,
      "text": " We thank You for loving us."
    },
    {
      "id": 9,
      "start": 1833.4599857330322,
      "end": 1840.3799858093262,
      "text": " We thank You that You have revealed to us in Your Word these names."
    },
    {
      "id": 10,
      "start": 1840.3799858093262,
      "end": 1847.499984741211,
      "text": " For just a few moments to be able to study, to reference the names of God, I've been encouraged."
    },
    {
      "id": 11,
      "start": 1847.499984741211,
      "end": 1852.8599853515625,
      "text": " And I hope, Lord, that each one that is present, each one that's tuned in via livestream tonight"
    },
    {
      "id": 12,
      "start": 1852.8599853515625,
      "end": 1855.1399841308594,
      "text": " has been encouraged."
    },
    {
      "id": 13,
      "start": 1855.1399841308594,
      "end": 1860.499984741211,
      "text": " And I pray that with that encouragement comes some application in our lives, that we would"
    },
    {
      "id": 14,
      "start": 1860.499984741211,
      "end": 1866.1799850463867,
      "text": " be impacted in our daily lives as to how we face the difficulties and the adversities"
    },
    {
      "id": 15,
      "start": 1866.1799850463867,
      "end": 1870.6599884033203,
      "text": " of life, that we would understand who You are and that You're our God."
    },
    {
      "id": 16,
      "start": 1870.6599884033203,
      "end": 1876.5399856567383,
      "text": " I pray that You'd help us to be challenged, to stand in awe of who You are, and to declare"
    },
    {
      "id": 17,
      "start": 1876.5399856567383,
      "end": 1878.7799835205078,
      "text": " Thy greatness."
    },
    {
      "id": 18,
      "start": 1878.7799835205078,
      "end": 1882.099983215332,
      "text": " There's a world that does not know who You are."
    },
    {
      "id": 19,
      "start": 1882.099983215332,
      "end": 1885.9799880981445,
      "text": " It is our responsibility to declare Thy greatness."
    },
    {
      "id": 20,
      "start": 1885.9799880981445,
      "end": 1888.719985961914,
      "text": " Lord, I pray that You'd bless our time of prayer."
    },
    {
      "id": 21,
      "start": 1888.719985961914,
      "end": 1891.0799865722656,
      "text": " We do thank You for the privilege of prayer."
    },
    {
      "id": 22,
      "start": 1891.0799865722656,
      "end": 1893.6799850463867,
      "text": " We pray that You'd be honored and glorified through the remainder of our service."
    },
    {
      "id": 23,
      "start": 1893.6799850463867,
      "end": 1899.7599868774414,
      "text": " For it's in Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T11:02:25.462965"
}