{
  "video_id": "5gWVxtcarvc",
  "text": "I read a report one time, I believe it was Spurgeon, it might have been someone else, but I think it was Spurgeon, if I remember correctly, he got to where he was going to preach and he realized when he got there that he left all of his notes behind. And so he turned around and walked back home so he could get all of his notes and then return to the church house so that he could preach. And I, if I walked home, I don't know that it would do anything anyway, because home is right there. And but we'll get through it this evening, Revelation chapter 3, verses 1 through 6, the church in Sardis, and notice the Bible says this beginning in verse number 1, And unto the angel of the church in Sardis write, These things saith he, that hath the seven spirits of God, and the seven stars, I know thy works, that thou hast a name that thou livest, and are dead. Be watchful, and strengthen the things which remain, that are ready to die, for I have not found thy works perfect before God. Remember therefore how thou hast received, and heard, and hold fast, and repent, if therefore thou shalt not watch, I will come on thee as a thief, and thou shalt not know what hour I will come upon thee. Thou hast a few names, even in Sardis, which have not defiled their garments, and they shall walk with me in white, for they are worthy. He that overcometh, the same shall be clothed in white raiment, and I will not blot out his name out of the book of life, but I will confess his name before my Father and before his angels. He that hath an ear, let him hear what the Spirit saith unto the churches. This is the fifth church that is going to be addressed in the book of Revelation as we've been studying through these letters to these local churches. Now remember, as we've looked, starting in chapter two, at the church in Ephesus, and then we moved to the church in Smyrna, Pergamos, Thyatira, we looked at that for two weeks, and now looking at the message to the church in Sardis, we find that each of these churches are local churches that were in existence in the first century, at the time of the writing, and the church is to be the pillar and ground of the truth. We understand that the church is the bride of Christ. It's important that we recognize this evening what a local church is and the purpose that God has given for a local church. The local church is ordained by God. It is God's idea. It is not man's idea. It did not start with Constantine or anyone else. The reality is that the Lord Jesus Christ said, I will build my church, and the gates of hell shall not prevail against it. The Bible says that Christ loved the church and gave Himself for it. The Bible tells us in the book of Acts, in the twentieth chapter, that the Lord Jesus Christ, as Paul is giving the instruction to the leaders, the church leaders of the church at Ephesus, he speaks about how Christ hath bought the church with His own blood. The church is precious. The church is the bride of Christ. The church is to be the pillar and ground of the truth. And we find this evening that God intends for there to be local churches. I believe this evening that every community needs a local church. I believe this evening that, yes, we live in a time in which transportation is much more advanced than it was 50, 100 years ago, and therefore people can drive further distances to get to church. And I also understand living in places where local churches are just not available. We lived for two and a half years in the state of Nevada, and there was not a church like our church for about 75 miles from where we lived. And we had to go to the best church that we could possibly find when we lived there. And it was unfortunate, but that was just the situation. And then I remember hearing about a man that was up in the northwest part of the nation of America, and he was living up in that part, and an evangelist was traveling through, and as he went into a little store, he listened as he went in, and there was a familiar voice over the speakers, and the man that was running the little convenience store gas station was listening to some preaching. And the man had recognized the voice of the individual that was preaching, and he began to inquire, and he said, there's not a place that preaches like this guy is preaching within three hours of where we're standing right now. That's the truth in a lot of places in America. And God intends for a local church, He intends for His church to reach a community, to make a difference. We've often spoken and we've talked about the church in Corinth and how there in Corinth that the responsibility of the believers in Corinth were to influence a community with the gospel of the Lord Jesus Christ, and yet so often as you read through the book of 1st and 2nd Corinthians, especially in 1st Corinthians, you find that the culture in the community was having a greater impact on the church than the church was having on the community. Sardis is located about 30 miles away from Thyatira to the south, and we find that it was a capital of ancient Lydia, and it was known for some real pagan idolatrous worship. And we find that, hey look at that, it updated, praise the Lord, and it was known for some real idolatrous worship and extremely pagan, and this was a place, they said the pagan worship there was extremely vile, and it was a place that needed a local church. But I would argue this evening that every community needs a local church. Every community needs a local church, and as we think about the local church and we think about the impact that the church has to have on the community, we come to this local church in Sardis, and the sad thing is that God really has nothing good to say to the church in Sardis. He'll make a mention as we get through the text this evening that there were, in verse number 4, thou hast a few names even in Sardis which have not defiled their garments. But for the most part, there's not much commending for the church here in Sardis, and that's a sad situation because this community suffered because the church was not shining their light like they should have. We begin to look at this passage of Scripture and thinking about the church in Sardis, and we note their condition as God tells us in verse number 1. Notice what he says, and unto the angel of the church in Sardis, write, These things saith he that hath the seven spirits of God and the seven stars, and he says, I know thy works. That's familiar to each of the letters, to each of the churches. And notice this phrase, that thou hast a name that thou livest and are dead. Wow. Wow. What a statement that the all-knowing God makes about this church. Now as we look at the name that thou livest and are dead, I would say that the evidence did not support the claim. I would say that as you look at this church and these individuals and they say that thou hast a name that thou livest and are dead, remember as we looked at the church at Ephesus in chapter number 2 that the Lord Jesus Christ said in verse number 4 of chapter 2, Nevertheless I have somewhat against thee, what? Because thou hast left thy first love. And we said this when we looked at that portion of Scripture that God knows all things and He reveals all things and it was not possible for the believers in Ephesus to say, oh no, that's not true. Because God was the one that was exposing it. And here in Sardis he says thou hast a name that thou livest and are dead. What we are should impact how we behave. What we are should impact how we behave. Furthermore, how we behave should support what we claim to be. Think about that. We've often mentioned that belief impacts behavior and it's true but behavior reveals belief. How you behave reveals truly what you believe. This evening as we look at this church in Sardis and we look at their condition and we note this first statement that is made in verse number 1 that these individuals as we would look at this claim that thou hast a name that thou livest and are dead. The reality this evening is that the book of 1 John speaks much about some evidences. You say that you and now show me this and let's see this and if you love, you say that you love God but you hate your brethren, you're lying. So the reality this evening is that we could ask the question as we have in other messages is what would the evidence against us support? Would it support our claim? They have a name that thou livest and are dead. It's kind of interesting I believe that as you look at this truth and we understand the local church is made up of individual saved people. The church is not the building. The church is made up of saved individuals that have been baptized that voluntarily joined themselves together for the purpose of fulfilling the great commission. That's how you think about membership in a local church, what a church is. That's why a church is an organism. It's living. It is the body of believers and if this building burned down, if this building was destroyed in some kind of a natural disaster, Fellowship Baptist Church does not cease to exist. to exist, we simply do not have the same building that we once had, because the church is the people. But I want you to understand that we see it even still to this day, like some modern churches, that they allow people to be within the church that haven't had genuine conversion. They're a professor, but not a possessor. A professor, but not a possessor. In fact, I find that we see that a lot in our society today. You hear a lot of people talking about God and various things that they'll say, but you begin to really look at their life. You begin to look for those evidences, those fruits of salvation, the fruit of being born again. And you find many times it's missing. As we begin to think about this phraseology, and there's two thoughts with regard to what the Lord Jesus Christ is saying to this church with regard to its membership and to regard to its people. And again, in verse 4, it talks about thou hast a few names, even in Sardis, which have not defiled their garments. And you begin to look at this. And Ephesians 2, in verse number 1, makes it very plain that prior to salvation, we were dead. We're dead. We're alive physically, but we're dead spiritually. Ephesians 2, in verse 1, and you, hath he quickened who were dead in trespasses and sins. The Bible goes on to talk about the fact in this text of Scripture that we all had our conversation in times past in the lust of our flesh, fulfilling the desires of the flesh and the mind, and were by nature the children of wrath, even as others, but God, who is rich in mercy. For his great love, wherewith he loved us. And then it goes on to talk about salvation, for by grace are you saved through faith. Aren't you thankful? It's not of works, lest any man should boast. It's a gift. And we find here that in this text of Scripture in Revelation 3, in verse number 1, that the Lord Jesus Christ says, thou hast a name that thou livest and are dead. Listen, it's easy for people to say, I'm a Christian today. It's easy for people to say, I'm a Christian. And then you ask them, oh, that's wonderful. Can you tell me what that means? How did you become a Christian? Well, I go to church. Go to church doesn't make anybody a Christian. I was baptized. Being baptized doesn't make anybody a Christian. I took communion. Doesn't make you a Christian. Is that biblical? Doesn't make you a Christian. And the reality is that we know that there's only one way to become a Christian. Only one way. And it's through Jesus Christ. Recognizing that we're sinners and that He is the only Savior and we're turning from our sin and we're turning to Christ. Repentance. And we accept that free gift of eternal life and at that moment we are made alive and we become Christians. And today there's a number of people that will profess, but the question is are they true possessors of eternal life? No doubt we see it again in our society today and it could very well be that the Lord Jesus Christ is saying that even within those that are there, there are some that are not saved. Some that are not saved. Another thought is that it would be that they're void of power, that they're living in sin and they've been influenced by their community and by their culture and therefore they have no power. They're not filled with the power of the Holy Spirit of God as we see in Acts 1 and verse number 8. They're just carnal and just void of any real spiritual impact or influence in their society, their destitute of force and of life that recognizes and is devoted to God. We find this evening that the indictment against the church in Sardis is serious. And it's one in which when you begin reading and you look at verse number 1, you kind of stop in your tracks. You say, wow, this is real serious what the Lord Jesus Christ is saying to this church. Notice, he says in verse number 2 as we continue to think about their condition, we'll also see that verse 2 deals with some of the instruction with regard to what they should do, but notice it says, be watchful and strengthen the things which remain that are ready to die. Notice what he says, for I have not found thy works perfect before God. He says in verse number 1, I know thy works and in verse number 2 he says, I have not found thy works perfect before God. Can I tell you this evening that God knows our works but he also knows our motives. He knows why we do the things that we do. I believe it was Paul Chappell wrote a book, I read it years ago, that was titled Motives Matter. And what great truth and the reality is that we could ask ourselves the question this evening, why do we do the things that we do and what we do is important, no doubt. It's important what we do, but why we do it is more important. Why are we doing it? Are we doing it? Think about the instruction of the Lord Jesus Christ when he's speaking to his disciples and he's giving truth and he talks to them about praying and about giving and he says, when you pray, don't pray like, and he talks about those Pharisees that would pray and they'd try to make these real elaborate prayers and try to make everybody think about how spiritual and how wise they are and God would say this, the Lord Jesus Christ says, they have their reward. What was their reward? It was the applause of man, the praise of man. He says, but when you pray, enter into your closet and your father would see it in secret, he'll reward thee openly. We find that he talks about when you fast, don't walk around, oh, I'm fasting, I don't know, I've been fasting for seven days, I've been fasting, and by the way, that's something I'm going to preach on soon about fasting and something that God just kind of put on my heart and it's a needful thing, but the reality is that Jesus in the same text of scripture says, don't fast like they fast. They have their reward. What is it? The applause of man, the praise of man. When you give, don't give so everyone else can see what you gave so that people can recognize and, oh, if that's what you do, then that's your reward, the applause of man. And see, God knows our hearts. Remember, he talks about the widow that puts in just two mites and he says she gave more than everyone else. Why? Well, everyone else gave out of their abundance, but she gave everything she had. See, God's way is different than our way, and he says to this church in Sardis, I have not found thy works perfect before God. This evening, God knows our works, but he knows our motives. Why are we doing the things that we're doing? Are we doing it simply to have the recognition of man? Are we doing it simply to have the applause of man? Or are we doing it for the glory of Jesus alone? Are we doing it if no one else even knows that we're doing it, if no one else even recognizes, if no one ever gives you a thank you? Are you doing it for God? And it's so important, and he says, I know thy works. And then he says, I have found, I have not found thy works perfect before God. Notice the condition, but then I want you to note the counsel. In verses 2 and 3, there are several things, really five different things that the Lord gives by way of counsel to this local church. By the way, let me say this, counsel is good when it's heated. How often we receive counsel from the word of God. We go to God's word and we seek for answers and for counsel and for direction, but if we walk away and we lean on our own understanding, if we walk away and do our own thing anyway, then it really was kind of pointless. How often people will say, can I counsel with you? And I'm glad to point people in the way of which the Lord says in his word. But counsel is only good if you take heed. It's only good if you take heed. It's only good if you take heed. Dean has a little thing on his, on the finance office wall downstairs that says, really people don't want counsel, they just want their opinion coming out of your mouth. And sometimes you find that to be true, don't you? People just want to hear what they want to hear. And sometimes people will seek counsel from multiple sources until they find what they really want to hear. But here it's the Lord Jesus Christ, the God of the universe that's giving counsel to this local church. I'm thankful that the Bible tells us that, speaking of God's word in Psalm 19, that by these, by God's precepts that thy servant is warned and in keeping of them there is great reward. You know, warnings like counsel are only good if you take heed. beneficial when they're heated. We can put up warning labels, we can put up all court signs, and all sorts of things, but if those warnings are not taken heed to, it does nothing for us. And notice he says, first of all, in verse number two, be watchful, to give strict attention to, to be active. He says, listen, it's almost like kind of a wake up kind of a situation. Be watchful. If you're in the, if you've ever served in the military, you know that they have, in the Navy, at least as far as Evan is concerned, they refer to it as he has watch. And in the Marine Corps, my dad and those that were in the Marines, they would refer to it as having duty, but really it's the same exact thing, having watch. And what is the deal? Well, they're to watch and to be aware of what's taking place and to be alert. And here, the Lord Jesus Christ says, be watchful. Don't be asleep at the wheel. Don't, don't, don't, don't be distracted. Be watchful. He says, number two, strengthen the things that remain to fix, to set fast these things that he spends. He does not specify specifically what those things are, but notice he says, strengthen the things which remain. And then notice the, the added statement that are ready to die. Strengthen the things that remain, that are ready to die. This church was in bad shape. This local church in Sardis was, was not doing what God intended for a local church to do and to be. And he tells them, be watchful. He tells them to strengthen the things which remain. Strengthen the things which remain. He tells them in verse number three, notice he says, remember, remember what? Remember therefore how thou hast received and heard. I love the book of 1 and 2 Peter, the books of 1 and 2 Peter. And specifically, as you begin to, to look at 2 Peter, Peter makes these statements a couple of times in the book where he talks about, he's going to stir the people up by putting them in remembrance. If you begin to think about Peter in 2 Peter making this reference to putting people in remembrance and you couple that with Psalm 119 where the psalmist talks about, I will not forget thy precepts. And you couple that with what Moses tells the children of Israel in the book of Deuteronomy as they're preparing to enter into the land of promise. He says, listen, you're going to come to a land and you're going to have vineyards and you're going to have fields and you're going to have houses and you've not built these and you've not planted these and you're going to benefit from all of this, but beware lest thou forget the Lord. We find that you come to the book of Jeremiah and throughout the book, you find these references, how that the people of God had forgotten their God days without number. We're prone to forget. And God says, remember, remember what? Remember therefore how thou hast received and heard. Every local church that is started, that's a biblical local church, is started on the foundation of Jesus Christ. And we find that a local church, as we could think about Sardis and they're starting there and all that took place. And you can find that a local church has that, again, a biblical, I'm speaking about a proper godly New Testament Bible church. It started on the principles of God's word with Jesus Christ being the foundation, the cornerstone. And you find that that church, if we're not careful, can drift over time, being influenced by the culture, the city, the customs, and so on and so forth. And we find that a church can begin to shift, and you can look at a church and say, that's not how that church started. What went wrong? Sometimes a new pastor comes in, and sometimes a new pastor will come in and take a church in a completely different direction than what the church had been. There are churches today that are, in fact, pastors today that are having these seminars, and I believe it lacks integrity. It's a terrible situation where they're having these seminars on how to take and take a congregation and lead them away from the King James Bible to some other modern version, and how to transition your church from the King James Bible. They have seminars that they're holding. How about you go start your own church that uses a different version of the Bible instead of hijacking the one that uses the right Bible? But the reality is that churches can drift. We can drift, lose our focus, forget our purpose. Why are we here? What did He leave us here to do? What's our purpose? And we find that He says, remember. Remember, therefore, how thou hast received and heard. I think about the Apostle Paul when he's writing to Timothy in 2 Timothy chapter 2, and he's giving him that wonderful instruction that we're so familiar with that really is a model for discipleship, when he says, but the things that thou hast heard of me among many witnesses, the same commit thou to faithful men who shall be able to teach others also. And we find that he's saying the same, not something new, not something different, but the same thing. And it's taking the truth of God's Word from one generation to a next generation and giving them the truth of God's Word so that they can continue and reach their generation with the cause of Christ. And here, the church in Sardis, they had to remember their starting place. They had to remember the truth that they had started upon. And then he says this, and hold fast, and hold fast, take care of, attend to carefully. He said this to the church in Thyatira in verse number 25 of chapter 2. He says, but that which ye have already, hold fast till I come. And then he says this in verse number 3, repent and repent. I want you to think about that truth that Jesus gives here with regard to repent, and we speak about repentance with regard to salvation and the necessity thereof, but you understand that as the people of God, if we fall in this place, if we get off course, if we lose our direction, if we get involved in sin, there's a need for repentance. And we find here that he says to this church, repent. I believe this evening that God exposes the error, and He expects a response. And by the way, I think that's reasonable. It's reasonable that God would expose and then expect a response, that He exposes to the church in Sardis. By the way, it reveals to us His love. It reveals to us His care. It reveals to us His concern for this church that they, He's not just leaving it alone. He's coming, and we look in chapter 2 about Thyatira. Remember, He said, and I gave her space in verse 21 to repent, and she repented not. And God is long-suffering, and I'm so thankful for that this evening. God is gracious, and He's merciful, but He exposes error and expects a response. Look over in the book of Joshua, if you will, and I love the book of Joshua. The book of Joshua gives us, turn to the seventh chapter, if you will, and the book of Joshua gives us really a picture of the victorious Christian life. Yes, the book of Joshua provides for us historical account and record of the children of Israel entering into, conquering, dividing, and inhabiting the land that God had promised to Abraham. And we read through all of the book of Joshua, and we see how God worked miraculously and what God did. But we come to Joshua chapter number seven, and we're told in chapter seven, verse number one, that Israel had sinned. We're told of the truth of what took place, that they trespassed, they committed a trespass in the accursed thing. And what was it that Achan took of the accursed thing? And we find that it was not revealed to Joshua in verse one, as it is to us as the readers of the book of Joshua. We find that after the defeat, that Joshua is all kinds of sideways as to what was going on. And then God reveals to Joshua, notice if you will, in verse number eight, O Lord, what shall I say when Israel turneth their backs before their enemies? For the Canaanites and all the inhabitants of the land shall hear of it and shall environ us, surround us, and cut off our name from the earth. And what wilt thou do unto thy great name? And the Lord said unto Joshua, Get thee up. Wherefore liest thou thus upon thy face? Israel hath sinned. And this is where God is exposing to Joshua, the leader, the sin. And notice what he says, They have also transgressed my covenant, which I commanded them, for they have even taken of the accursed thing and have also stolen and dissembled also, and they have put it even among their own stuff. Therefore, verse number 12, therefore, this is the consequence. Therefore, the children of Israel could not stand before their enemies. At Ai, 36 men lost their lives a few verses earlier. And he said they could not stand against their enemies. Why? Because they were accursed. And then notice what God says at the end of verse number 12. Neither will I be with you anymore. Lord, except ye destroy the accursed from among you.\" That truth of Joshua 7 and verse number 12 is powerful, and it ought to be impactful. God says, I'm exposing this sin, and you better deal with it. And if you don't, I'm not going to be with you anymore. So what do they do? Joshua takes heed. Does he not? Joshua recognizes the importance of what God reveals, and Joshua says, we're going to deal with this thing, and all the people come together, and they come by tribe and by family, and we find that eventually Achan is found out, and Achan is destroyed. You say, well, that's harsh. That's what God commanded. And then they had victory. Then they had victory. We find in Revelation chapter 3 that God exposes to this church their true condition. We'll look in a few weeks at the church of the Laodiceans, as it's called in chapter 3 and verse 14, the church of the people, and we'll read how they say what they think they are, but then God says what they really are. Here for the church in Sardis, God says, here's your real condition, and here's the counsel. Here's your repent. He exposed it, and he expected that there would be a response. We find the condition, the counsel, note the consequences, often we think about consequences, we think about them strictly in a negative sense, but I want to look at it both from a positive and a negative sense this evening, and we find that negative, speaking from the negative perspective, in verse number 3, he says this, remember therefore how thou hast received and heard and hold fast and repent, if therefore thou shalt not watch. So what does he say? If you're not going to take heed to my counsel, because I said be watchful, if you're not going to do what I said to do, if therefore thou shalt not watch, I will come on thee as a thief, and thou shalt not know what hour I will come upon thee. You know what Jesus is saying? He's saying there's going to be judgment. God judges, he's the righteous judge. God corrects, he chastens. The truth of Hebrews and the truth of Proverbs is whom the Lord loveth, he chasteneth. This evening we find that he says, if you're not going to take heed to my counsel, there will be judgment. He says that it will be sudden, he says that it will be certain. Too often today, I fear that people think that they're getting away with something. They're hiding something that no one else knows about. They think they're getting away with it because, well, everything's just kind of going normal and they fail to recognize that God is never okay with sin. God is holy, holy, holy, holy. And I'm thankful that I'm clothed in the righteousness of God, but the reality this evening is that we are to walk and we are to be holy as he is holy. We're to walk in the spirit so that we do not fulfill the lust of the flesh. But I tell you this evening, I'm concerned that people think, oh, I heard what the preacher said, I read what the Bible said, I heard what the Sunday school teacher said, but eh, I'm not going to worry about that. God says there's going to be judgment, it's certain, it'll be sudden. It may not be when you think it's going to be and you take that step and you look around and say, well, nothing happened, so I guess I'm okay. No, don't be deceived. The book of Hebrews talks about sin, it talks about the deceitfulness of sin. Sin is deceitful, it's deceitful. We find that there's the positive aspect in verse number four, thou hast a few names even in Sardis which have not defiled their garments, thankful for a remnant, amen. There's some people there in the midst of all that was going on, now the reality is that they didn't stand up and they weren't making a huge difference, but there were some that had not been defiled by the community, by the corruption, by all that was going on, by all that Christ said about this church, and there were some, we don't know how many, but he says thou hast a few names even in Sardis which have not defiled their garments, and notice what he says, and they shall walk with me in white, for they are worthy. I'm thankful that God keeps a good record, I'm thankful that God knows, and that, listen, I think about Noah, he found grace in the eyes of the Lord. You know if you read Genesis chapter number six and you look and you understand all that's going on in Genesis chapter number six, you find that it was Noah that found grace in the eyes of the Lord. You find that there was great wickedness, God looked and he talked about the depravity of man and the thoughts of their heart were only evil and wicked continually, but Noah found grace in the eyes of the Lord. The reality is that even though we're living in a wicked and perverse generation, we can walk worthy, we can walk right, we can live in such a way that God is pleased, honored, and glorified. I think about the book of Titus in chapter number two and verse number 11 where the Bible says that the grace of God that bringeth salvation hath appeared to all men, teaching us, listen, God's grace teaches us that denying ungodliness and worldly lust, we should live soberly, righteously, and godly in this present world. Why? We're looking for that blessed hope and glorious appearing of our great God and Savior, the Lord Jesus Christ, and we find that we do not have to be influenced by the wickedness and God knows and God is aware of what's taking place. We see in verse number five, he that overcometh, a phrase that's used repeatedly to these churches in the book of Revelation, the same shall be clothed in white raiment and I will not blot out his name out of the book of life, but I will confess his name before my Father and before his angels. I find this evening that from a positive perspective, when we look at verse number five, I do not read this as being a threat, but an assurance. It's not a threat when he says that I will not blot out his name out of the book of life, this is an assurance to these individuals that were not defiled, that were walking worthy, that had this promise and this understanding of what they would receive and it's this assurance. Listen, today when we live in a wicked and perverse generation, sometimes we can become all so overwhelmed with all the things that are around us and we lose sight of glory. We lose sight that one day we will walk with him and we will be with him and we will rule and reign with him and so we find that the Lord Jesus Christ, he's giving this assurance to these that had not yet defiled. They had these few names in Sardis, the reference with regard to the book of life, there's several references here in the book of Revelation as well as other parts of Scripture that speak about the book. Some that refer to the book of life, the Lamb's book of life, the book written in heaven in Luke chapter number 10 that have their names written in heaven, Philippians chapter number And so there's several references to the book of life and to the book in heaven and we find this evening that I'm so thankful that my name is written in the book of life. And it's never going to be removed because it's all because of what Jesus did for me and his righteousness, not my own righteousness and I have this assurance and I need to keep my focus upon the Lord Jesus Christ in eternity. And so this week on Sunday morning as we continue looking through the book of 2 Corinthians in chapter number 4, it ends with Paul speaking about this perspective of not looking at the things which are temporal but at the things which are eternal, how important that is for us. And notice what he says in verse 6, he says it to every church, he that hath an ear, let him hear what the Spirit saith unto the churches. This evening, Revelation 3, 1 through 6 is written to the church in Sardis but it's been preserved in God's word for every local church and it's important that every local church as we read this letter to the church in Sardis that we have ears to hear, that we take heed to the warning, that we recognize this evening the importance of why we exist. First and foremost to bring glory to God. Can I tell you this evening the church in Sardis as a whole, not bringing glory to God. They're not bringing glory to God. Can I tell you, they weren't impacting their community, they just weren't. And this evening when we think about our church, oh that God would help us to bring honor and glory to His name alone and that we would impact our community. unity, that we would recognize the purpose that God has placed us here. Why are we here? Sometimes you might ask yourself that question as in, I should be moving, why am I here? But the reality is God's put us here. And just like every other local church, God has them there for a purpose. God's given to us a purpose. The church in Sardis had failed their Lord. In a real sense, they failed their community. This evening, I don't want to fail my Lord and I don't want to fail my community. There are people in our community that need to hear the truth of the gospel. I shared with you in our annual business meeting a map of our county and listed out for you by zip code the number of residents in our community and our county. Last night we're sitting around the table or in our kitchen and one of the young ladies started singing a part of a song that is Holly's dad's favorite song. Some of you might know it, People Need the Lord. It's true. People need the Lord. And this church in Sardis, they weren't impacting their community. And he that hath an ear, let him hear. Oh that God would use us to make a difference that would bring glory to God. Let's pray. Father we love you. We thank you for loving us. Thank you for your word. God, it's a hard message to the church in Sardis, very direct. But I believe it's a loving message. You correct because you love. You counsel because you love. You expose and expect response. God I pray that this evening you would help us to be obedient, to be good hearers, to be doers. Help us to examine individually and corporately what you've given for us to do. And help us to be faithful. Well thank you for it in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.599999904632568,
      "text": " I read a report one time, I believe it was Spurgeon, it might have been someone else,"
    },
    {
      "id": 1,
      "start": 5.599999904632568,
      "end": 8.920000076293945,
      "text": " but I think it was Spurgeon, if I remember correctly, he got to where he was going to"
    },
    {
      "id": 2,
      "start": 8.920000076293945,
      "end": 13.960000038146973,
      "text": " preach and he realized when he got there that he left all of his notes behind."
    },
    {
      "id": 3,
      "start": 13.960000038146973,
      "end": 17.520000457763672,
      "text": " And so he turned around and walked back home so he could get all of his notes and then"
    },
    {
      "id": 4,
      "start": 17.520000457763672,
      "end": 20.479999542236328,
      "text": " return to the church house so that he could preach."
    },
    {
      "id": 5,
      "start": 20.479999542236328,
      "end": 25.15999984741211,
      "text": " And I, if I walked home, I don't know that it would do anything anyway, because home"
    },
    {
      "id": 6,
      "start": 25.15999984741211,
      "end": 26.920000076293945,
      "text": " is right there."
    },
    {
      "id": 7,
      "start": 26.920000076293945,
      "end": 32.47999954223633,
      "text": " And but we'll get through it this evening, Revelation chapter 3, verses 1 through 6,"
    },
    {
      "id": 8,
      "start": 32.47999954223633,
      "end": 35.959999084472656,
      "text": " the church in Sardis, and notice the Bible says this beginning in verse number 1,"
    },
    {
      "id": 9,
      "start": 35.959999084472656,
      "end": 41.720001220703125,
      "text": " And unto the angel of the church in Sardis write, These things saith he, that hath the"
    },
    {
      "id": 10,
      "start": 41.720001220703125,
      "end": 49.52000045776367,
      "text": " seven spirits of God, and the seven stars, I know thy works, that thou hast a name that"
    },
    {
      "id": 11,
      "start": 49.52000045776367,
      "end": 52.939998626708984,
      "text": " thou livest, and are dead."
    },
    {
      "id": 12,
      "start": 52.939998626708984,
      "end": 58.540000915527344,
      "text": " Be watchful, and strengthen the things which remain, that are ready to die, for I have"
    },
    {
      "id": 13,
      "start": 58.540000915527344,
      "end": 63.380001068115234,
      "text": " not found thy works perfect before God."
    },
    {
      "id": 14,
      "start": 63.380001068115234,
      "end": 69.58000183105469,
      "text": " Remember therefore how thou hast received, and heard, and hold fast, and repent, if therefore"
    },
    {
      "id": 15,
      "start": 69.58000183105469,
      "end": 78.13999938964844,
      "text": " thou shalt not watch, I will come on thee as a thief, and thou shalt not know what hour"
    },
    {
      "id": 16,
      "start": 78.13999938964844,
      "end": 79.86000061035156,
      "text": " I will come upon thee."
    },
    {
      "id": 17,
      "start": 79.86000061035156,
      "end": 84.69999694824219,
      "text": " Thou hast a few names, even in Sardis, which have not defiled their garments, and they"
    },
    {
      "id": 18,
      "start": 84.69999694824219,
      "end": 89.22000122070312,
      "text": " shall walk with me in white, for they are worthy."
    },
    {
      "id": 19,
      "start": 89.22000122070312,
      "end": 93.81999969482422,
      "text": " He that overcometh, the same shall be clothed in white raiment, and I will not blot out"
    },
    {
      "id": 20,
      "start": 93.81999969482422,
      "end": 98.54000091552734,
      "text": " his name out of the book of life, but I will confess his name before my Father and before"
    },
    {
      "id": 21,
      "start": 98.54000091552734,
      "end": 99.54000091552734,
      "text": " his angels."
    },
    {
      "id": 22,
      "start": 99.54000091552734,
      "end": 105.9800033569336,
      "text": " He that hath an ear, let him hear what the Spirit saith unto the churches."
    },
    {
      "id": 23,
      "start": 105.9800033569336,
      "end": 109.0999984741211,
      "text": " This is the fifth church that is going to be addressed in the book of Revelation as"
    },
    {
      "id": 24,
      "start": 109.13999938964844,
      "end": 114.05999755859375,
      "text": " we've been studying through these letters to these local churches."
    },
    {
      "id": 25,
      "start": 114.05999755859375,
      "end": 119.05999755859375,
      "text": " Now remember, as we've looked, starting in chapter two, at the church in Ephesus, and"
    },
    {
      "id": 26,
      "start": 119.05999755859375,
      "end": 124.55999755859375,
      "text": " then we moved to the church in Smyrna, Pergamos, Thyatira, we looked at that for two weeks,"
    },
    {
      "id": 27,
      "start": 124.55999755859375,
      "end": 129.89999389648438,
      "text": " and now looking at the message to the church in Sardis, we find that each of these churches"
    },
    {
      "id": 28,
      "start": 129.89999389648438,
      "end": 135.5399932861328,
      "text": " are local churches that were in existence in the first century, at the time of the writing,"
    },
    {
      "id": 29,
      "start": 135.5399932861328,
      "end": 138.86000061035156,
      "text": " and the church is to be the pillar and ground of the truth."
    },
    {
      "id": 30,
      "start": 139.6199951171875,
      "end": 142.05999755859375,
      "text": " We understand that the church is the bride of Christ."
    },
    {
      "id": 31,
      "start": 142.05999755859375,
      "end": 147.25999450683594,
      "text": " It's important that we recognize this evening what a local church is and the purpose that"
    },
    {
      "id": 32,
      "start": 147.25999450683594,
      "end": 150.3800048828125,
      "text": " God has given for a local church."
    },
    {
      "id": 33,
      "start": 150.3800048828125,
      "end": 152.94000244140625,
      "text": " The local church is ordained by God."
    },
    {
      "id": 34,
      "start": 152.94000244140625,
      "end": 154.67999267578125,
      "text": " It is God's idea."
    },
    {
      "id": 35,
      "start": 154.67999267578125,
      "end": 156.3000030517578,
      "text": " It is not man's idea."
    },
    {
      "id": 36,
      "start": 156.3000030517578,
      "end": 159.5399932861328,
      "text": " It did not start with Constantine or anyone else."
    },
    {
      "id": 37,
      "start": 159.5399932861328,
      "end": 165.5,
      "text": " The reality is that the Lord Jesus Christ said, I will build my church, and the gates"
    },
    {
      "id": 38,
      "start": 165.5,
      "end": 168.6199951171875,
      "text": " of hell shall not prevail against it."
    },
    {
      "id": 39,
      "start": 168.66000366210938,
      "end": 174.25999450683594,
      "text": " The Bible says that Christ loved the church and gave Himself for it."
    },
    {
      "id": 40,
      "start": 174.25999450683594,
      "end": 177.86000061035156,
      "text": " The Bible tells us in the book of Acts, in the twentieth chapter, that the Lord Jesus"
    },
    {
      "id": 41,
      "start": 177.86000061035156,
      "end": 183.66000366210938,
      "text": " Christ, as Paul is giving the instruction to the leaders, the church leaders of the"
    },
    {
      "id": 42,
      "start": 183.66000366210938,
      "end": 189.77999877929688,
      "text": " church at Ephesus, he speaks about how Christ hath bought the church with His own blood."
    },
    {
      "id": 43,
      "start": 189.77999877929688,
      "end": 191.52000427246094,
      "text": " The church is precious."
    },
    {
      "id": 44,
      "start": 191.52000427246094,
      "end": 193.05999755859375,
      "text": " The church is the bride of Christ."
    },
    {
      "id": 45,
      "start": 193.05999755859375,
      "end": 197.97999572753906,
      "text": " The church is to be the pillar and ground of the truth."
    },
    {
      "id": 46,
      "start": 197.97999572753906,
      "end": 203.5399932861328,
      "text": " And we find this evening that God intends for there to be local churches."
    },
    {
      "id": 47,
      "start": 203.5399932861328,
      "end": 207.97999572753906,
      "text": " I believe this evening that every community needs a local church."
    },
    {
      "id": 48,
      "start": 207.97999572753906,
      "end": 213.94000244140625,
      "text": " I believe this evening that, yes, we live in a time in which transportation is much"
    },
    {
      "id": 49,
      "start": 213.94000244140625,
      "end": 220.3000030517578,
      "text": " more advanced than it was 50, 100 years ago, and therefore people can drive further distances"
    },
    {
      "id": 50,
      "start": 220.3000030517578,
      "end": 222.22000122070312,
      "text": " to get to church."
    },
    {
      "id": 51,
      "start": 222.3800048828125,
      "end": 226.82000732421875,
      "text": " And I also understand living in places where local churches are just not available."
    },
    {
      "id": 52,
      "start": 226.82000732421875,
      "end": 232.5,
      "text": " We lived for two and a half years in the state of Nevada, and there was not a church like"
    },
    {
      "id": 53,
      "start": 232.5,
      "end": 237.05999755859375,
      "text": " our church for about 75 miles from where we lived."
    },
    {
      "id": 54,
      "start": 237.05999755859375,
      "end": 242.5800018310547,
      "text": " And we had to go to the best church that we could possibly find when we lived there."
    },
    {
      "id": 55,
      "start": 242.5800018310547,
      "end": 245.5,
      "text": " And it was unfortunate, but that was just the situation."
    },
    {
      "id": 56,
      "start": 245.5,
      "end": 250.86000061035156,
      "text": " And then I remember hearing about a man that was up in the northwest part of the nation"
    },
    {
      "id": 57,
      "start": 250.86000061035156,
      "end": 256.5400085449219,
      "text": " of America, and he was living up in that part, and an evangelist was traveling through,"
    },
    {
      "id": 58,
      "start": 256.5400085449219,
      "end": 261.4200134277344,
      "text": " and as he went into a little store, he listened as he went in, and there was a familiar voice"
    },
    {
      "id": 59,
      "start": 261.4200134277344,
      "end": 266.4200134277344,
      "text": " over the speakers, and the man that was running the little convenience store gas station was"
    },
    {
      "id": 60,
      "start": 266.4200134277344,
      "end": 268.70001220703125,
      "text": " listening to some preaching."
    },
    {
      "id": 61,
      "start": 268.70001220703125,
      "end": 272.3800048828125,
      "text": " And the man had recognized the voice of the individual that was preaching, and he began"
    },
    {
      "id": 62,
      "start": 272.3800048828125,
      "end": 278.3800048828125,
      "text": " to inquire, and he said, there's not a place that preaches like this guy is preaching within"
    },
    {
      "id": 63,
      "start": 278.3800048828125,
      "end": 282.5799865722656,
      "text": " three hours of where we're standing right now."
    },
    {
      "id": 64,
      "start": 282.5799865722656,
      "end": 285.8599853515625,
      "text": " That's the truth in a lot of places in America."
    },
    {
      "id": 65,
      "start": 285.8599853515625,
      "end": 291.94000244140625,
      "text": " And God intends for a local church, He intends for His church to reach a community, to make"
    },
    {
      "id": 66,
      "start": 291.94000244140625,
      "end": 293.4599914550781,
      "text": " a difference."
    },
    {
      "id": 67,
      "start": 293.4599914550781,
      "end": 297.8599853515625,
      "text": " We've often spoken and we've talked about the church in Corinth and how there in Corinth"
    },
    {
      "id": 68,
      "start": 297.8599853515625,
      "end": 304.1400146484375,
      "text": " that the responsibility of the believers in Corinth were to influence a community with"
    },
    {
      "id": 69,
      "start": 304.1400146484375,
      "end": 309.1000061035156,
      "text": " the gospel of the Lord Jesus Christ, and yet so often as you read through the book"
    },
    {
      "id": 70,
      "start": 309.1000061035156,
      "end": 313.739990234375,
      "text": " of 1st and 2nd Corinthians, especially in 1st Corinthians, you find that the culture"
    },
    {
      "id": 71,
      "start": 313.739990234375,
      "end": 318.82000732421875,
      "text": " in the community was having a greater impact on the church than the church was having on"
    },
    {
      "id": 72,
      "start": 318.82000732421875,
      "end": 321.0199890136719,
      "text": " the community."
    },
    {
      "id": 73,
      "start": 321.0199890136719,
      "end": 329.1400146484375,
      "text": " Sardis is located about 30 miles away from Thyatira to the south, and we find that it"
    },
    {
      "id": 74,
      "start": 329.1400146484375,
      "end": 337.67999267578125,
      "text": " was a capital of ancient Lydia, and it was known for some real pagan idolatrous worship."
    },
    {
      "id": 75,
      "start": 337.67999267578125,
      "end": 341.6000061035156,
      "text": " And we find that, hey look at that, it updated, praise the Lord, and it was known for some"
    },
    {
      "id": 76,
      "start": 341.6000061035156,
      "end": 348.5,
      "text": " real idolatrous worship and extremely pagan, and this was a place, they said the pagan"
    },
    {
      "id": 77,
      "start": 348.5,
      "end": 353.739990234375,
      "text": " worship there was extremely vile, and it was a place that needed a local church."
    },
    {
      "id": 78,
      "start": 353.739990234375,
      "end": 359.05999755859375,
      "text": " But I would argue this evening that every community needs a local church."
    },
    {
      "id": 79,
      "start": 359.05999755859375,
      "end": 362.739990234375,
      "text": " Every community needs a local church, and as we think about the local church and we"
    },
    {
      "id": 80,
      "start": 362.739990234375,
      "end": 367.29998779296875,
      "text": " think about the impact that the church has to have on the community, we come to this"
    },
    {
      "id": 81,
      "start": 367.29998779296875,
      "end": 373.29998779296875,
      "text": " local church in Sardis, and the sad thing is that God really has nothing good to say"
    },
    {
      "id": 82,
      "start": 373.29998779296875,
      "end": 375.3399963378906,
      "text": " to the church in Sardis."
    },
    {
      "id": 83,
      "start": 375.3399963378906,
      "end": 379.70001220703125,
      "text": " He'll make a mention as we get through the text this evening that there were, in verse"
    },
    {
      "id": 84,
      "start": 379.70001220703125,
      "end": 385.4200134277344,
      "text": " number 4, thou hast a few names even in Sardis which have not defiled their garments."
    },
    {
      "id": 85,
      "start": 385.4200134277344,
      "end": 392.4200134277344,
      "text": " But for the most part, there's not much commending for the church here in Sardis, and that's"
    },
    {
      "id": 86,
      "start": 392.4200134277344,
      "end": 399.9800109863281,
      "text": " a sad situation because this community suffered because the church was not shining their light"
    },
    {
      "id": 87,
      "start": 399.9800109863281,
      "end": 401.29998779296875,
      "text": " like they should have."
    },
    {
      "id": 88,
      "start": 401.29998779296875,
      "end": 406.2200012207031,
      "text": " We begin to look at this passage of Scripture and thinking about the church in Sardis, and"
    },
    {
      "id": 89,
      "start": 406.2200012207031,
      "end": 409.9800109863281,
      "text": " we note their condition as God tells us in verse number 1."
    },
    {
      "id": 90,
      "start": 409.9800109863281,
      "end": 414.260009765625,
      "text": " Notice what he says, and unto the angel of the church in Sardis, write, These things"
    },
    {
      "id": 91,
      "start": 414.260009765625,
      "end": 419.2200012207031,
      "text": " saith he that hath the seven spirits of God and the seven stars, and he says, I know thy"
    },
    {
      "id": 92,
      "start": 419.2200012207031,
      "end": 420.2200012207031,
      "text": " works."
    },
    {
      "id": 93,
      "start": 420.2200012207031,
      "end": 422.8999938964844,
      "text": " That's familiar to each of the letters, to each of the churches."
    },
    {
      "id": 94,
      "start": 422.8999938964844,
      "end": 431.260009765625,
      "text": " And notice this phrase, that thou hast a name that thou livest and are dead."
    },
    {
      "id": 95,
      "start": 431.260009765625,
      "end": 432.82000732421875,
      "text": " Wow."
    },
    {
      "id": 96,
      "start": 432.82000732421875,
      "end": 435.0199890136719,
      "text": " Wow."
    },
    {
      "id": 97,
      "start": 435.0199890136719,
      "end": 443.4200134277344,
      "text": " What a statement that the all-knowing God makes about this church."
    },
    {
      "id": 98,
      "start": 443.4200134277344,
      "end": 448.70001220703125,
      "text": " Now as we look at the name that thou livest and are dead, I would say that the evidence"
    },
    {
      "id": 99,
      "start": 448.70001220703125,
      "end": 450.70001220703125,
      "text": " did not support the claim."
    },
    {
      "id": 100,
      "start": 450.70001220703125,
      "end": 455.5,
      "text": " I would say that as you look at this church and these individuals and they say that thou"
    },
    {
      "id": 101,
      "start": 455.5,
      "end": 460.8599853515625,
      "text": " hast a name that thou livest and are dead, remember as we looked at the church at Ephesus"
    },
    {
      "id": 102,
      "start": 460.8599853515625,
      "end": 466.1000061035156,
      "text": " in chapter number 2 that the Lord Jesus Christ said in verse number 4 of chapter 2, Nevertheless"
    },
    {
      "id": 103,
      "start": 466.1000061035156,
      "end": 467.7799987792969,
      "text": " I have somewhat against thee, what?"
    },
    {
      "id": 104,
      "start": 467.7799987792969,
      "end": 470.1000061035156,
      "text": " Because thou hast left thy first love."
    },
    {
      "id": 105,
      "start": 470.1000061035156,
      "end": 474.70001220703125,
      "text": " And we said this when we looked at that portion of Scripture that God knows all things and"
    },
    {
      "id": 106,
      "start": 474.70001220703125,
      "end": 480.70001220703125,
      "text": " He reveals all things and it was not possible for the believers in Ephesus to say, oh no,"
    },
    {
      "id": 107,
      "start": 480.70001220703125,
      "end": 482.5199890136719,
      "text": " that's not true."
    },
    {
      "id": 108,
      "start": 482.5199890136719,
      "end": 485.4200134277344,
      "text": " Because God was the one that was exposing it."
    },
    {
      "id": 109,
      "start": 485.4200134277344,
      "end": 491.7799987792969,
      "text": " And here in Sardis he says thou hast a name that thou livest and are dead."
    },
    {
      "id": 110,
      "start": 491.7799987792969,
      "end": 496.6600036621094,
      "text": " What we are should impact how we behave."
    },
    {
      "id": 111,
      "start": 496.6600036621094,
      "end": 500.8599853515625,
      "text": " What we are should impact how we behave."
    },
    {
      "id": 112,
      "start": 500.8599853515625,
      "end": 506.739990234375,
      "text": " Furthermore, how we behave should support what we claim to be."
    },
    {
      "id": 113,
      "start": 506.739990234375,
      "end": 507.739990234375,
      "text": " Think about that."
    },
    {
      "id": 114,
      "start": 507.739990234375,
      "end": 513.6599731445312,
      "text": " We've often mentioned that belief impacts behavior and it's true but behavior reveals"
    },
    {
      "id": 115,
      "start": 513.6599731445312,
      "end": 514.739990234375,
      "text": " belief."
    },
    {
      "id": 116,
      "start": 514.739990234375,
      "end": 519.0,
      "text": " How you behave reveals truly what you believe."
    },
    {
      "id": 117,
      "start": 519.0,
      "end": 523.2999877929688,
      "text": " This evening as we look at this church in Sardis and we look at their condition and"
    },
    {
      "id": 118,
      "start": 523.2999877929688,
      "end": 528.02001953125,
      "text": " we note this first statement that is made in verse number 1 that these individuals as"
    },
    {
      "id": 119,
      "start": 528.02001953125,
      "end": 534.260009765625,
      "text": " we would look at this claim that thou hast a name that thou livest and are dead."
    },
    {
      "id": 120,
      "start": 534.260009765625,
      "end": 539.1799926757812,
      "text": " The reality this evening is that the book of 1 John speaks much about some evidences."
    },
    {
      "id": 121,
      "start": 539.1799926757812,
      "end": 544.5800170898438,
      "text": " You say that you and now show me this and let's see this and if you love, you say that"
    },
    {
      "id": 122,
      "start": 544.5800170898438,
      "end": 550.5,
      "text": " you love God but you hate your brethren, you're lying."
    },
    {
      "id": 123,
      "start": 550.5399780273438,
      "end": 554.8200073242188,
      "text": " So the reality this evening is that we could ask the question as we have in other messages"
    },
    {
      "id": 124,
      "start": 554.8200073242188,
      "end": 558.739990234375,
      "text": " is what would the evidence against us support?"
    },
    {
      "id": 125,
      "start": 558.739990234375,
      "end": 561.02001953125,
      "text": " Would it support our claim?"
    },
    {
      "id": 126,
      "start": 561.02001953125,
      "end": 564.3400268554688,
      "text": " They have a name that thou livest and are dead."
    },
    {
      "id": 127,
      "start": 564.3400268554688,
      "end": 567.5399780273438,
      "text": " It's kind of interesting I believe that as you look at this truth and we understand the"
    },
    {
      "id": 128,
      "start": 567.5399780273438,
      "end": 572.219970703125,
      "text": " local church is made up of individual saved people."
    },
    {
      "id": 129,
      "start": 572.219970703125,
      "end": 573.5,
      "text": " The church is not the building."
    },
    {
      "id": 130,
      "start": 573.5,
      "end": 578.4199829101562,
      "text": " The church is made up of saved individuals that have been baptized that voluntarily joined"
    },
    {
      "id": 131,
      "start": 578.4199829101562,
      "end": 582.0599975585938,
      "text": " themselves together for the purpose of fulfilling the great commission."
    },
    {
      "id": 132,
      "start": 582.0599975585938,
      "end": 586.02001953125,
      "text": " That's how you think about membership in a local church, what a church is."
    },
    {
      "id": 133,
      "start": 586.02001953125,
      "end": 587.5,
      "text": " That's why a church is an organism."
    },
    {
      "id": 134,
      "start": 587.5,
      "end": 588.5599975585938,
      "text": " It's living."
    },
    {
      "id": 135,
      "start": 588.5599975585938,
      "end": 595.3800048828125,
      "text": " It is the body of believers and if this building burned down, if this building was destroyed"
    },
    {
      "id": 136,
      "start": 595.3800048828125,
      "end": 600.02001953125,
      "text": " in some kind of a natural disaster, Fellowship Baptist Church does not cease to exist."
    },
    {
      "id": 0,
      "start": 600.02001953125,
      "end": 606.5000195503235,
      "text": " to exist, we simply do not have the same building that we once had, because the church is the"
    },
    {
      "id": 1,
      "start": 606.5000195503235,
      "end": 611.6200199127197,
      "text": " people. But I want you to understand that we see it even still to this day, like some"
    },
    {
      "id": 2,
      "start": 611.6200199127197,
      "end": 618.1600189208984,
      "text": " modern churches, that they allow people to be within the church that haven't had genuine"
    },
    {
      "id": 3,
      "start": 618.1600189208984,
      "end": 628.940019607544,
      "text": " conversion. They're a professor, but not a possessor. A professor, but not a possessor."
    },
    {
      "id": 4,
      "start": 628.940019607544,
      "end": 632.9000205993652,
      "text": " In fact, I find that we see that a lot in our society today. You hear a lot of people"
    },
    {
      "id": 5,
      "start": 632.9000205993652,
      "end": 638.2000198364258,
      "text": " talking about God and various things that they'll say, but you begin to really look"
    },
    {
      "id": 6,
      "start": 638.2000198364258,
      "end": 643.2200202941895,
      "text": " at their life. You begin to look for those evidences, those fruits of salvation, the"
    },
    {
      "id": 7,
      "start": 643.2200202941895,
      "end": 647.7400207519531,
      "text": " fruit of being born again. And you find many times it's missing."
    },
    {
      "id": 8,
      "start": 647.7400207519531,
      "end": 653.6200180053711,
      "text": " As we begin to think about this phraseology, and there's two thoughts with regard to what"
    },
    {
      "id": 9,
      "start": 653.6200180053711,
      "end": 659.9000205993652,
      "text": " the Lord Jesus Christ is saying to this church with regard to its membership and to regard"
    },
    {
      "id": 10,
      "start": 659.9000205993652,
      "end": 664.5000228881836,
      "text": " to its people. And again, in verse 4, it talks about thou hast a few names, even in Sardis,"
    },
    {
      "id": 11,
      "start": 664.5000228881836,
      "end": 669.2600173950195,
      "text": " which have not defiled their garments. And you begin to look at this. And Ephesians 2,"
    },
    {
      "id": 12,
      "start": 669.2600173950195,
      "end": 677.2600173950195,
      "text": " in verse number 1, makes it very plain that prior to salvation, we were dead. We're dead."
    },
    {
      "id": 13,
      "start": 677.2600173950195,
      "end": 682.5000228881836,
      "text": " We're alive physically, but we're dead spiritually. Ephesians 2, in verse 1, and you, hath he"
    },
    {
      "id": 14,
      "start": 682.5800170898438,
      "end": 689.4600219726562,
      "text": " quickened who were dead in trespasses and sins. The Bible goes on to talk about the"
    },
    {
      "id": 15,
      "start": 689.4600219726562,
      "end": 693.900016784668,
      "text": " fact in this text of Scripture that we all had our conversation in times past in the"
    },
    {
      "id": 16,
      "start": 693.900016784668,
      "end": 698.2200164794922,
      "text": " lust of our flesh, fulfilling the desires of the flesh and the mind, and were by nature"
    },
    {
      "id": 17,
      "start": 698.2200164794922,
      "end": 705.9400177001953,
      "text": " the children of wrath, even as others, but God, who is rich in mercy. For his great love,"
    },
    {
      "id": 18,
      "start": 705.9400177001953,
      "end": 710.4600219726562,
      "text": " wherewith he loved us. And then it goes on to talk about salvation, for by grace are"
    },
    {
      "id": 19,
      "start": 710.4600219726562,
      "end": 716.3000183105469,
      "text": " you saved through faith. Aren't you thankful? It's not of works, lest any man should boast."
    },
    {
      "id": 20,
      "start": 716.3000183105469,
      "end": 722.3400192260742,
      "text": " It's a gift. And we find here that in this text of Scripture in Revelation 3, in verse"
    },
    {
      "id": 21,
      "start": 722.3400192260742,
      "end": 726.2600173950195,
      "text": " number 1, that the Lord Jesus Christ says, thou hast a name that thou livest and are"
    },
    {
      "id": 22,
      "start": 726.2600173950195,
      "end": 733.3800201416016,
      "text": " dead. Listen, it's easy for people to say, I'm a Christian today. It's easy for people"
    },
    {
      "id": 23,
      "start": 733.3800201416016,
      "end": 737.7000122070312,
      "text": " to say, I'm a Christian. And then you ask them, oh, that's wonderful. Can you tell me"
    },
    {
      "id": 24,
      "start": 737.7000122070312,
      "end": 744.4600219726562,
      "text": " what that means? How did you become a Christian? Well, I go to church. Go to church doesn't"
    },
    {
      "id": 25,
      "start": 744.4600219726562,
      "end": 752.8200225830078,
      "text": " make anybody a Christian. I was baptized. Being baptized doesn't make anybody a Christian."
    },
    {
      "id": 26,
      "start": 752.8200225830078,
      "end": 760.0600128173828,
      "text": " I took communion. Doesn't make you a Christian. Is that biblical? Doesn't make you a Christian."
    },
    {
      "id": 27,
      "start": 760.0600128173828,
      "end": 767.5000152587891,
      "text": " And the reality is that we know that there's only one way to become a Christian. Only one"
    },
    {
      "id": 28,
      "start": 767.5000152587891,
      "end": 772.5600128173828,
      "text": " way. And it's through Jesus Christ. Recognizing that we're sinners and that He is the only"
    },
    {
      "id": 29,
      "start": 772.5600128173828,
      "end": 778.1400146484375,
      "text": " Savior and we're turning from our sin and we're turning to Christ. Repentance. And we"
    },
    {
      "id": 30,
      "start": 778.1400146484375,
      "end": 785.6200256347656,
      "text": " accept that free gift of eternal life and at that moment we are made alive and we become"
    },
    {
      "id": 31,
      "start": 785.6200256347656,
      "end": 794.0600128173828,
      "text": " Christians. And today there's a number of people that will profess, but the question"
    },
    {
      "id": 32,
      "start": 794.0600128173828,
      "end": 802.3400268554688,
      "text": " is are they true possessors of eternal life? No doubt we see it again in our society today"
    },
    {
      "id": 33,
      "start": 802.3400268554688,
      "end": 807.7000122070312,
      "text": " and it could very well be that the Lord Jesus Christ is saying that even within those that"
    },
    {
      "id": 34,
      "start": 807.7000122070312,
      "end": 815.9000244140625,
      "text": " are there, there are some that are not saved. Some that are not saved. Another thought is"
    },
    {
      "id": 35,
      "start": 815.9000244140625,
      "end": 820.6200256347656,
      "text": " that it would be that they're void of power, that they're living in sin and they've been"
    },
    {
      "id": 36,
      "start": 820.6200256347656,
      "end": 825.7800140380859,
      "text": " influenced by their community and by their culture and therefore they have no power."
    },
    {
      "id": 37,
      "start": 825.7800140380859,
      "end": 829.4200134277344,
      "text": " They're not filled with the power of the Holy Spirit of God as we see in Acts 1 and verse"
    },
    {
      "id": 38,
      "start": 829.4200134277344,
      "end": 838.1000213623047,
      "text": " number 8. They're just carnal and just void of any real spiritual impact or influence"
    },
    {
      "id": 39,
      "start": 838.1000213623047,
      "end": 845.4200134277344,
      "text": " in their society, their destitute of force and of life that recognizes and is devoted"
    },
    {
      "id": 40,
      "start": 845.4200134277344,
      "end": 854.9400177001953,
      "text": " to God. We find this evening that the indictment against the church in Sardis is serious. And"
    },
    {
      "id": 41,
      "start": 854.9400177001953,
      "end": 860.4200134277344,
      "text": " it's one in which when you begin reading and you look at verse number 1, you kind of stop"
    },
    {
      "id": 42,
      "start": 860.4200134277344,
      "end": 870.1400146484375,
      "text": " in your tracks. You say, wow, this is real serious what the Lord Jesus Christ is saying"
    },
    {
      "id": 43,
      "start": 870.1400146484375,
      "end": 876.1000061035156,
      "text": " to this church. Notice, he says in verse number 2 as we continue to think about their"
    },
    {
      "id": 44,
      "start": 876.1000061035156,
      "end": 882.6600341796875,
      "text": " condition, we'll also see that verse 2 deals with some of the instruction with regard to"
    },
    {
      "id": 45,
      "start": 882.6600341796875,
      "end": 887.4400329589844,
      "text": " what they should do, but notice it says, be watchful and strengthen the things which remain"
    },
    {
      "id": 46,
      "start": 887.4400329589844,
      "end": 893.260009765625,
      "text": " that are ready to die. Notice what he says, for I have not found thy works perfect before"
    },
    {
      "id": 47,
      "start": 893.260009765625,
      "end": 898.6200256347656,
      "text": " God. He says in verse number 1, I know thy works and in verse number 2 he says, I have"
    },
    {
      "id": 48,
      "start": 898.6200256347656,
      "end": 905.6600341796875,
      "text": " not found thy works perfect before God. Can I tell you this evening that God knows our"
    },
    {
      "id": 49,
      "start": 905.6600341796875,
      "end": 913.9000244140625,
      "text": " works but he also knows our motives. He knows why we do the things that we do. I believe"
    },
    {
      "id": 50,
      "start": 913.9000244140625,
      "end": 919.9800109863281,
      "text": " it was Paul Chappell wrote a book, I read it years ago, that was titled Motives Matter."
    },
    {
      "id": 51,
      "start": 919.9800109863281,
      "end": 925.2200317382812,
      "text": " And what great truth and the reality is that we could ask ourselves the question this evening,"
    },
    {
      "id": 52,
      "start": 925.2200317382812,
      "end": 931.3800048828125,
      "text": " why do we do the things that we do and what we do is important, no doubt. It's important"
    },
    {
      "id": 53,
      "start": 931.3800048828125,
      "end": 937.780029296875,
      "text": " what we do, but why we do it is more important. Why are we doing it? Are we doing it? Think"
    },
    {
      "id": 54,
      "start": 937.780029296875,
      "end": 941.6600341796875,
      "text": " about the instruction of the Lord Jesus Christ when he's speaking to his disciples and he's"
    },
    {
      "id": 55,
      "start": 941.6600341796875,
      "end": 946.8600158691406,
      "text": " giving truth and he talks to them about praying and about giving and he says, when you pray,"
    },
    {
      "id": 56,
      "start": 946.8600158691406,
      "end": 951.3800048828125,
      "text": " don't pray like, and he talks about those Pharisees that would pray and they'd try to"
    },
    {
      "id": 57,
      "start": 951.3800048828125,
      "end": 956.9800109863281,
      "text": " make these real elaborate prayers and try to make everybody think about how spiritual"
    },
    {
      "id": 58,
      "start": 956.9800109863281,
      "end": 962.7000122070312,
      "text": " and how wise they are and God would say this, the Lord Jesus Christ says, they have their"
    },
    {
      "id": 59,
      "start": 962.7000122070312,
      "end": 969.8200073242188,
      "text": " reward. What was their reward? It was the applause of man, the praise of man. He says,"
    },
    {
      "id": 60,
      "start": 969.8200073242188,
      "end": 975.1000061035156,
      "text": " but when you pray, enter into your closet and your father would see it in secret, he'll"
    },
    {
      "id": 61,
      "start": 975.1000061035156,
      "end": 980.8200073242188,
      "text": " reward thee openly. We find that he talks about when you fast, don't walk around, oh,"
    },
    {
      "id": 62,
      "start": 980.8200073242188,
      "end": 986.1400146484375,
      "text": " I'm fasting, I don't know, I've been fasting for seven days, I've been fasting, and by"
    },
    {
      "id": 63,
      "start": 986.1400146484375,
      "end": 990.5800170898438,
      "text": " the way, that's something I'm going to preach on soon about fasting and something that God"
    },
    {
      "id": 64,
      "start": 990.5800170898438,
      "end": 996.780029296875,
      "text": " just kind of put on my heart and it's a needful thing, but the reality is that Jesus in the"
    },
    {
      "id": 65,
      "start": 996.780029296875,
      "end": 1003.4200134277344,
      "text": " same text of scripture says, don't fast like they fast. They have their reward. What is"
    },
    {
      "id": 66,
      "start": 1003.4200134277344,
      "end": 1009.9800109863281,
      "text": " it? The applause of man, the praise of man. When you give, don't give so everyone else"
    },
    {
      "id": 67,
      "start": 1010.02001953125,
      "end": 1017.02001953125,
      "text": " can see what you gave so that people can recognize and, oh, if that's what you do, then that's"
    },
    {
      "id": 68,
      "start": 1017.02001953125,
      "end": 1024.6200256347656,
      "text": " your reward, the applause of man. And see, God knows our hearts. Remember, he talks about"
    },
    {
      "id": 69,
      "start": 1024.6200256347656,
      "end": 1031.6200256347656,
      "text": " the widow that puts in just two mites and he says she gave more than everyone else."
    },
    {
      "id": 70,
      "start": 1031.6200256347656,
      "end": 1038.6200256347656,
      "text": " Why? Well, everyone else gave out of their abundance, but she gave everything she had."
    },
    {
      "id": 71,
      "start": 1038.8200073242188,
      "end": 1045.8200073242188,
      "text": " See, God's way is different than our way, and he says to this church in Sardis, I have"
    },
    {
      "id": 72,
      "start": 1046.5800170898438,
      "end": 1053.5800170898438,
      "text": " not found thy works perfect before God. This evening, God knows our works, but he knows"
    },
    {
      "id": 73,
      "start": 1053.9800109863281,
      "end": 1059.9400329589844,
      "text": " our motives. Why are we doing the things that we're doing? Are we doing it simply to have"
    },
    {
      "id": 74,
      "start": 1059.9400329589844,
      "end": 1065.8600158691406,
      "text": " the recognition of man? Are we doing it simply to have the applause of man? Or are we doing"
    },
    {
      "id": 75,
      "start": 1065.9000244140625,
      "end": 1072.9000244140625,
      "text": " it for the glory of Jesus alone? Are we doing it if no one else even knows that we're doing"
    },
    {
      "id": 76,
      "start": 1072.9400329589844,
      "end": 1079.9400329589844,
      "text": " it, if no one else even recognizes, if no one ever gives you a thank you? Are you doing"
    },
    {
      "id": 77,
      "start": 1080.1000061035156,
      "end": 1086.4200134277344,
      "text": " it for God? And it's so important, and he says, I know thy works. And then he says,"
    },
    {
      "id": 78,
      "start": 1086.4200134277344,
      "end": 1092.260009765625,
      "text": " I have found, I have not found thy works perfect before God. Notice the condition, but then"
    },
    {
      "id": 79,
      "start": 1092.260009765625,
      "end": 1097.6200256347656,
      "text": " I want you to note the counsel. In verses 2 and 3, there are several things, really"
    },
    {
      "id": 80,
      "start": 1097.6200256347656,
      "end": 1102.5800170898438,
      "text": " five different things that the Lord gives by way of counsel to this local church. By"
    },
    {
      "id": 81,
      "start": 1102.5800170898438,
      "end": 1109.5800170898438,
      "text": " the way, let me say this, counsel is good when it's heated. How often we receive counsel"
    },
    {
      "id": 82,
      "start": 1111.4200134277344,
      "end": 1118.3400268554688,
      "text": " from the word of God. We go to God's word and we seek for answers and for counsel and"
    },
    {
      "id": 83,
      "start": 1118.3400268554688,
      "end": 1122.8200073242188,
      "text": " for direction, but if we walk away and we lean on our own understanding, if we walk"
    },
    {
      "id": 84,
      "start": 1122.8200073242188,
      "end": 1128.739990234375,
      "text": " away and do our own thing anyway, then it really was kind of pointless. How often people"
    },
    {
      "id": 85,
      "start": 1128.739990234375,
      "end": 1135.7000122070312,
      "text": " will say, can I counsel with you? And I'm glad to point people in the way of which the"
    },
    {
      "id": 86,
      "start": 1135.7000122070312,
      "end": 1142.7000122070312,
      "text": " Lord says in his word. But counsel is only good if you take heed. It's only good if you"
    },
    {
      "id": 87,
      "start": 1143.4600219726562,
      "end": 1150.4600219726562,
      "text": " take heed. It's only good if you take heed. Dean has a little thing on his, on the finance"
    },
    {
      "id": 88,
      "start": 1150.780029296875,
      "end": 1155.6600341796875,
      "text": " office wall downstairs that says, really people don't want counsel, they just want their opinion"
    },
    {
      "id": 89,
      "start": 1155.6600341796875,
      "end": 1161.8200073242188,
      "text": " coming out of your mouth. And sometimes you find that to be true, don't you? People just"
    },
    {
      "id": 90,
      "start": 1161.8200073242188,
      "end": 1168.3800048828125,
      "text": " want to hear what they want to hear. And sometimes people will seek counsel from multiple sources"
    },
    {
      "id": 91,
      "start": 1168.3800048828125,
      "end": 1175.3800048828125,
      "text": " until they find what they really want to hear. But here it's the Lord Jesus Christ,"
    },
    {
      "id": 92,
      "start": 1176.300048828125,
      "end": 1182.02001953125,
      "text": " the God of the universe that's giving counsel to this local church. I'm thankful that the"
    },
    {
      "id": 93,
      "start": 1182.02001953125,
      "end": 1188.9800415039062,
      "text": " Bible tells us that, speaking of God's word in Psalm 19, that by these, by God's precepts"
    },
    {
      "id": 94,
      "start": 1188.9800415039062,
      "end": 1195.9800415039062,
      "text": " that thy servant is warned and in keeping of them there is great reward. You know, warnings"
    },
    {
      "id": 95,
      "start": 1195.9800415039062,
      "end": 1199.9800415039062,
      "text": " like counsel are only good if you take heed."
    },
    {
      "id": 0,
      "start": 1199.9800415039062,
      "end": 1206.0600414276123,
      "text": " beneficial when they're heated. We can put up warning labels, we can put up all court signs,"
    },
    {
      "id": 1,
      "start": 1206.0600414276123,
      "end": 1212.780041694641,
      "text": " and all sorts of things, but if those warnings are not taken heed to, it does nothing for us."
    },
    {
      "id": 2,
      "start": 1213.4200410842896,
      "end": 1219.8200416564941,
      "text": " And notice he says, first of all, in verse number two, be watchful, to give strict attention to,"
    },
    {
      "id": 3,
      "start": 1219.8200416564941,
      "end": 1225.4200420379639,
      "text": " to be active. He says, listen, it's almost like kind of a wake up kind of a situation. Be watchful."
    },
    {
      "id": 4,
      "start": 1225.4200420379639,
      "end": 1228.940040588379,
      "text": " If you're in the, if you've ever served in the military, you know that they have,"
    },
    {
      "id": 5,
      "start": 1228.940040588379,
      "end": 1233.5800399780273,
      "text": " in the Navy, at least as far as Evan is concerned, they refer to it as he has watch. And"
    },
    {
      "id": 6,
      "start": 1233.5800399780273,
      "end": 1237.8200416564941,
      "text": " in the Marine Corps, my dad and those that were in the Marines, they would refer to it as having"
    },
    {
      "id": 7,
      "start": 1237.8200416564941,
      "end": 1241.9000396728516,
      "text": " duty, but really it's the same exact thing, having watch. And what is the deal? Well,"
    },
    {
      "id": 8,
      "start": 1241.9000396728516,
      "end": 1247.1800422668457,
      "text": " they're to watch and to be aware of what's taking place and to be alert. And here,"
    },
    {
      "id": 9,
      "start": 1247.1800422668457,
      "end": 1254.4600410461426,
      "text": " the Lord Jesus Christ says, be watchful. Don't be asleep at the wheel. Don't, don't, don't,"
    },
    {
      "id": 10,
      "start": 1254.4600410461426,
      "end": 1262.7000427246094,
      "text": " don't be distracted. Be watchful. He says, number two, strengthen the things that remain"
    },
    {
      "id": 11,
      "start": 1263.9800415039062,
      "end": 1269.3400421142578,
      "text": " to fix, to set fast these things that he spends. He does not specify specifically"
    },
    {
      "id": 12,
      "start": 1269.3400421142578,
      "end": 1273.1800384521484,
      "text": " what those things are, but notice he says, strengthen the things which remain."
    },
    {
      "id": 13,
      "start": 1273.1800384521484,
      "end": 1276.3800430297852,
      "text": " And then notice the, the added statement that are ready to die."
    },
    {
      "id": 14,
      "start": 1276.940040588379,
      "end": 1285.4200439453125,
      "text": " Strengthen the things that remain, that are ready to die. This church was in bad shape."
    },
    {
      "id": 15,
      "start": 1288.3800430297852,
      "end": 1296.940040588379,
      "text": " This local church in Sardis was, was not doing what God intended for a local church to do and to be."
    },
    {
      "id": 16,
      "start": 1297.9800415039062,
      "end": 1302.6200408935547,
      "text": " And he tells them, be watchful. He tells them to strengthen the things which remain."
    },
    {
      "id": 17,
      "start": 1302.6200408935547,
      "end": 1306.6200408935547,
      "text": " Strengthen the things which remain. He tells them in verse number three, notice he says,"
    },
    {
      "id": 18,
      "start": 1306.6200408935547,
      "end": 1312.940040588379,
      "text": " remember, remember what? Remember therefore how thou hast received and heard."
    },
    {
      "id": 19,
      "start": 1314.6200408935547,
      "end": 1321.9800415039062,
      "text": " I love the book of 1 and 2 Peter, the books of 1 and 2 Peter. And specifically, as you begin to,"
    },
    {
      "id": 20,
      "start": 1321.9800415039062,
      "end": 1328.2200469970703,
      "text": " to look at 2 Peter, Peter makes these statements a couple of times in the book where he talks about,"
    },
    {
      "id": 21,
      "start": 1328.2200469970703,
      "end": 1331.9800415039062,
      "text": " he's going to stir the people up by putting them in remembrance."
    },
    {
      "id": 22,
      "start": 1333.020034790039,
      "end": 1337.7400360107422,
      "text": " If you begin to think about Peter in 2 Peter making this reference to putting people in"
    },
    {
      "id": 23,
      "start": 1337.7400360107422,
      "end": 1343.9000396728516,
      "text": " remembrance and you couple that with Psalm 119 where the psalmist talks about, I will not forget"
    },
    {
      "id": 24,
      "start": 1343.9000396728516,
      "end": 1349.2600402832031,
      "text": " thy precepts. And you couple that with what Moses tells the children of Israel in the book of"
    },
    {
      "id": 25,
      "start": 1349.2600402832031,
      "end": 1353.7400360107422,
      "text": " Deuteronomy as they're preparing to enter into the land of promise. He says, listen, you're going to"
    },
    {
      "id": 26,
      "start": 1353.7400360107422,
      "end": 1357.9800415039062,
      "text": " come to a land and you're going to have vineyards and you're going to have fields and you're going"
    },
    {
      "id": 27,
      "start": 1357.9800415039062,
      "end": 1362.5400390625,
      "text": " to have houses and you've not built these and you've not planted these and you're going to"
    },
    {
      "id": 28,
      "start": 1362.5400390625,
      "end": 1370.060043334961,
      "text": " benefit from all of this, but beware lest thou forget the Lord. We find that you come to the"
    },
    {
      "id": 29,
      "start": 1370.060043334961,
      "end": 1375.5000457763672,
      "text": " book of Jeremiah and throughout the book, you find these references, how that the people of God"
    },
    {
      "id": 30,
      "start": 1375.5000457763672,
      "end": 1383.8200378417969,
      "text": " had forgotten their God days without number. We're prone to forget. And God says, remember,"
    },
    {
      "id": 31,
      "start": 1384.7000427246094,
      "end": 1393.1000366210938,
      "text": " remember what? Remember therefore how thou hast received and heard. Every local church"
    },
    {
      "id": 32,
      "start": 1394.9400482177734,
      "end": 1401.8200378417969,
      "text": " that is started, that's a biblical local church, is started on the foundation of Jesus Christ."
    },
    {
      "id": 33,
      "start": 1403.5800476074219,
      "end": 1408.4600372314453,
      "text": " And we find that a local church, as we could think about Sardis and they're starting there"
    },
    {
      "id": 34,
      "start": 1408.4600372314453,
      "end": 1413.8200378417969,
      "text": " and all that took place. And you can find that a local church has that, again, a biblical,"
    },
    {
      "id": 35,
      "start": 1413.8200378417969,
      "end": 1421.020034790039,
      "text": " I'm speaking about a proper godly New Testament Bible church. It started on the principles of"
    },
    {
      "id": 36,
      "start": 1421.020034790039,
      "end": 1426.5400390625,
      "text": " God's word with Jesus Christ being the foundation, the cornerstone. And you find that that church,"
    },
    {
      "id": 37,
      "start": 1426.5400390625,
      "end": 1434.3800354003906,
      "text": " if we're not careful, can drift over time, being influenced by the culture, the city,"
    },
    {
      "id": 38,
      "start": 1434.3800354003906,
      "end": 1439.1000366210938,
      "text": " the customs, and so on and so forth. And we find that a church can begin to shift,"
    },
    {
      "id": 39,
      "start": 1439.1000366210938,
      "end": 1443.5000457763672,
      "text": " and you can look at a church and say, that's not how that church started."
    },
    {
      "id": 40,
      "start": 1445.020034790039,
      "end": 1450.6200408935547,
      "text": " What went wrong? Sometimes a new pastor comes in, and sometimes a new pastor will come in and"
    },
    {
      "id": 41,
      "start": 1450.6200408935547,
      "end": 1454.8600463867188,
      "text": " take a church in a completely different direction than what the church had been."
    },
    {
      "id": 42,
      "start": 1456.780029296875,
      "end": 1462.1400451660156,
      "text": " There are churches today that are, in fact, pastors today that are having these seminars,"
    },
    {
      "id": 43,
      "start": 1462.1400451660156,
      "end": 1467.9000549316406,
      "text": " and I believe it lacks integrity. It's a terrible situation where they're having these seminars on"
    },
    {
      "id": 44,
      "start": 1467.9000549316406,
      "end": 1474.9400329589844,
      "text": " how to take and take a congregation and lead them away from the King James Bible to some other"
    },
    {
      "id": 45,
      "start": 1474.9400329589844,
      "end": 1483.1800537109375,
      "text": " modern version, and how to transition your church from the King James Bible. They have seminars"
    },
    {
      "id": 46,
      "start": 1483.1800537109375,
      "end": 1489.7400512695312,
      "text": " that they're holding. How about you go start your own church that uses a different version"
    },
    {
      "id": 47,
      "start": 1489.7400512695312,
      "end": 1492.5400390625,
      "text": " of the Bible instead of hijacking the one that uses the right Bible?"
    },
    {
      "id": 48,
      "start": 1496.780029296875,
      "end": 1505.0200500488281,
      "text": " But the reality is that churches can drift. We can drift, lose our focus,"
    },
    {
      "id": 49,
      "start": 1507.1000366210938,
      "end": 1513.0200500488281,
      "text": " forget our purpose. Why are we here? What did He leave us here to do? What's our purpose?"
    },
    {
      "id": 50,
      "start": 1513.2600402832031,
      "end": 1520.3800354003906,
      "text": " And we find that He says, remember. Remember, therefore, how thou hast received and heard."
    },
    {
      "id": 51,
      "start": 1521.9800415039062,
      "end": 1526.4600524902344,
      "text": " I think about the Apostle Paul when he's writing to Timothy in 2 Timothy chapter 2,"
    },
    {
      "id": 52,
      "start": 1526.4600524902344,
      "end": 1530.0600280761719,
      "text": " and he's giving him that wonderful instruction that we're so familiar with that really is a"
    },
    {
      "id": 53,
      "start": 1530.0600280761719,
      "end": 1534.0600280761719,
      "text": " model for discipleship, when he says, but the things that thou hast heard of me among many"
    },
    {
      "id": 54,
      "start": 1534.0600280761719,
      "end": 1539.8200378417969,
      "text": " witnesses, the same commit thou to faithful men who shall be able to teach others also."
    },
    {
      "id": 55,
      "start": 1540.5400390625,
      "end": 1545.6600341796875,
      "text": " And we find that he's saying the same, not something new, not something different,"
    },
    {
      "id": 56,
      "start": 1545.6600341796875,
      "end": 1551.9800415039062,
      "text": " but the same thing. And it's taking the truth of God's Word from one generation"
    },
    {
      "id": 57,
      "start": 1551.9800415039062,
      "end": 1557.9800415039062,
      "text": " to a next generation and giving them the truth of God's Word so that they can continue and reach"
    },
    {
      "id": 58,
      "start": 1557.9800415039062,
      "end": 1563.3400268554688,
      "text": " their generation with the cause of Christ. And here, the church in Sardis, they had to"
    },
    {
      "id": 59,
      "start": 1563.3400268554688,
      "end": 1568.0600280761719,
      "text": " remember their starting place. They had to remember the truth that they had started upon."
    },
    {
      "id": 60,
      "start": 1569.0200500488281,
      "end": 1575.4200439453125,
      "text": " And then he says this, and hold fast, and hold fast, take care of, attend to carefully. He said"
    },
    {
      "id": 61,
      "start": 1575.4200439453125,
      "end": 1580.9400329589844,
      "text": " this to the church in Thyatira in verse number 25 of chapter 2. He says, but that which ye have"
    },
    {
      "id": 62,
      "start": 1580.9400329589844,
      "end": 1591.1000366210938,
      "text": " already, hold fast till I come. And then he says this in verse number 3, repent and repent."
    },
    {
      "id": 63,
      "start": 1592.0600280761719,
      "end": 1598.0600280761719,
      "text": " I want you to think about that truth that Jesus gives here with regard to repent,"
    },
    {
      "id": 64,
      "start": 1598.0600280761719,
      "end": 1602.780029296875,
      "text": " and we speak about repentance with regard to salvation and the necessity thereof,"
    },
    {
      "id": 65,
      "start": 1602.780029296875,
      "end": 1609.2600402832031,
      "text": " but you understand that as the people of God, if we fall in this place, if we get off course,"
    },
    {
      "id": 66,
      "start": 1609.2600402832031,
      "end": 1613.2600402832031,
      "text": " if we lose our direction, if we get involved in sin, there's a need for repentance."
    },
    {
      "id": 67,
      "start": 1614.6200561523438,
      "end": 1620.7000427246094,
      "text": " And we find here that he says to this church, repent. I believe this evening that God exposes"
    },
    {
      "id": 68,
      "start": 1621.0200500488281,
      "end": 1627.9000549316406,
      "text": " the error, and He expects a response. And by the way, I think that's reasonable."
    },
    {
      "id": 69,
      "start": 1629.1800537109375,
      "end": 1637.2600402832031,
      "text": " It's reasonable that God would expose and then expect a response, that He exposes to the church"
    },
    {
      "id": 70,
      "start": 1637.2600402832031,
      "end": 1643.2600402832031,
      "text": " in Sardis. By the way, it reveals to us His love. It reveals to us His care. It reveals to us His"
    },
    {
      "id": 71,
      "start": 1643.2600402832031,
      "end": 1649.5000305175781,
      "text": " concern for this church that they, He's not just leaving it alone. He's coming, and we look in"
    },
    {
      "id": 72,
      "start": 1649.5000305175781,
      "end": 1655.1800537109375,
      "text": " chapter 2 about Thyatira. Remember, He said, and I gave her space in verse 21 to repent, and she"
    },
    {
      "id": 73,
      "start": 1655.1800537109375,
      "end": 1662.300048828125,
      "text": " repented not. And God is long-suffering, and I'm so thankful for that this evening. God is gracious,"
    },
    {
      "id": 74,
      "start": 1662.300048828125,
      "end": 1669.8200378417969,
      "text": " and He's merciful, but He exposes error and expects a response. Look over in the book of"
    },
    {
      "id": 75,
      "start": 1669.8200378417969,
      "end": 1674.5400390625,
      "text": " Joshua, if you will, and I love the book of Joshua. The book of Joshua gives us, turn to the"
    },
    {
      "id": 76,
      "start": 1674.5400390625,
      "end": 1680.0600280761719,
      "text": " seventh chapter, if you will, and the book of Joshua gives us really a picture of the victorious"
    },
    {
      "id": 77,
      "start": 1680.0600280761719,
      "end": 1687.5000305175781,
      "text": " Christian life. Yes, the book of Joshua provides for us historical account and record of the children"
    },
    {
      "id": 78,
      "start": 1687.5000305175781,
      "end": 1693.2600402832031,
      "text": " of Israel entering into, conquering, dividing, and inhabiting the land that God had promised to"
    },
    {
      "id": 79,
      "start": 1693.2600402832031,
      "end": 1698.5400390625,
      "text": " Abraham. And we read through all of the book of Joshua, and we see how God worked miraculously"
    },
    {
      "id": 80,
      "start": 1698.5400390625,
      "end": 1703.2600402832031,
      "text": " and what God did. But we come to Joshua chapter number seven, and we're told in chapter seven,"
    },
    {
      "id": 81,
      "start": 1703.2600402832031,
      "end": 1709.3400268554688,
      "text": " verse number one, that Israel had sinned. We're told of the truth of what took place, that they"
    },
    {
      "id": 82,
      "start": 1709.3400268554688,
      "end": 1715.2600708007812,
      "text": " trespassed, they committed a trespass in the accursed thing. And what was it that Achan took"
    },
    {
      "id": 83,
      "start": 1715.2600708007812,
      "end": 1721.6600341796875,
      "text": " of the accursed thing? And we find that it was not revealed to Joshua in verse one, as it is to us as"
    },
    {
      "id": 84,
      "start": 1721.6600341796875,
      "end": 1727.9800415039062,
      "text": " the readers of the book of Joshua. We find that after the defeat, that Joshua is all kinds of"
    },
    {
      "id": 85,
      "start": 1727.9800415039062,
      "end": 1734.06005859375,
      "text": " sideways as to what was going on. And then God reveals to Joshua, notice if you will, in verse"
    },
    {
      "id": 86,
      "start": 1734.06005859375,
      "end": 1738.5400390625,
      "text": " number eight, O Lord, what shall I say when Israel turneth their backs before their enemies? For the"
    },
    {
      "id": 87,
      "start": 1738.5400390625,
      "end": 1743.1000366210938,
      "text": " Canaanites and all the inhabitants of the land shall hear of it and shall environ us, surround"
    },
    {
      "id": 88,
      "start": 1743.1000366210938,
      "end": 1748.4600219726562,
      "text": " us, and cut off our name from the earth. And what wilt thou do unto thy great name? And the Lord"
    },
    {
      "id": 89,
      "start": 1748.4600219726562,
      "end": 1757.9800415039062,
      "text": " said unto Joshua, Get thee up. Wherefore liest thou thus upon thy face? Israel hath sinned. And"
    },
    {
      "id": 90,
      "start": 1757.9800415039062,
      "end": 1766.3800659179688,
      "text": " this is where God is exposing to Joshua, the leader, the sin. And notice what he says, They have"
    },
    {
      "id": 91,
      "start": 1766.3800659179688,
      "end": 1771.9800415039062,
      "text": " also transgressed my covenant, which I commanded them, for they have even taken of the accursed"
    },
    {
      "id": 92,
      "start": 1771.9800415039062,
      "end": 1777.820068359375,
      "text": " thing and have also stolen and dissembled also, and they have put it even among their own stuff."
    },
    {
      "id": 93,
      "start": 1777.820068359375,
      "end": 1784.06005859375,
      "text": " Therefore, verse number 12, therefore, this is the consequence. Therefore, the children of Israel"
    },
    {
      "id": 94,
      "start": 1784.06005859375,
      "end": 1790.3800659179688,
      "text": " could not stand before their enemies. At Ai, 36 men lost their lives a few verses earlier. And he"
    },
    {
      "id": 95,
      "start": 1790.3800659179688,
      "end": 1793.9000244140625,
      "text": " said they could not stand against their enemies. Why? Because they were accursed. And then notice"
    },
    {
      "id": 96,
      "start": 1793.9000244140625,
      "end": 1799.820068359375,
      "text": " what God says at the end of verse number 12. Neither will I be with you anymore."
    },
    {
      "id": 0,
      "start": 1799.820068359375,
      "end": 1809.280068397522,
      "text": " Lord, except ye destroy the accursed from among you.\""
    },
    {
      "id": 1,
      "start": 1809.280068397522,
      "end": 1817.820068359375,
      "text": " That truth of Joshua 7 and verse number 12 is powerful, and it ought to be impactful."
    },
    {
      "id": 2,
      "start": 1817.820068359375,
      "end": 1822.7800674438477,
      "text": " God says, I'm exposing this sin, and you better deal with it."
    },
    {
      "id": 3,
      "start": 1822.7800674438477,
      "end": 1827.7800674438477,
      "text": " And if you don't, I'm not going to be with you anymore."
    },
    {
      "id": 4,
      "start": 1827.7800674438477,
      "end": 1830.2200679779053,
      "text": " So what do they do?"
    },
    {
      "id": 5,
      "start": 1830.2200679779053,
      "end": 1831.9000701904297,
      "text": " Joshua takes heed."
    },
    {
      "id": 6,
      "start": 1831.9000701904297,
      "end": 1833.3000679016113,
      "text": " Does he not?"
    },
    {
      "id": 7,
      "start": 1833.3000679016113,
      "end": 1837.5400695800781,
      "text": " Joshua recognizes the importance of what God reveals, and Joshua says, we're going to deal"
    },
    {
      "id": 8,
      "start": 1837.5400695800781,
      "end": 1843.1000671386719,
      "text": " with this thing, and all the people come together, and they come by tribe and by family, and"
    },
    {
      "id": 9,
      "start": 1843.1000671386719,
      "end": 1847.5000686645508,
      "text": " we find that eventually Achan is found out, and Achan is destroyed."
    },
    {
      "id": 10,
      "start": 1847.5000686645508,
      "end": 1851.3000679016113,
      "text": " You say, well, that's harsh."
    },
    {
      "id": 11,
      "start": 1851.3000679016113,
      "end": 1854.0200691223145,
      "text": " That's what God commanded."
    },
    {
      "id": 12,
      "start": 1854.0200691223145,
      "end": 1855.8600692749023,
      "text": " And then they had victory."
    },
    {
      "id": 13,
      "start": 1855.8600692749023,
      "end": 1857.5400695800781,
      "text": " Then they had victory."
    },
    {
      "id": 14,
      "start": 1857.5400695800781,
      "end": 1864.0600662231445,
      "text": " We find in Revelation chapter 3 that God exposes to this church their true condition."
    },
    {
      "id": 15,
      "start": 1864.0600662231445,
      "end": 1869.3000717163086,
      "text": " We'll look in a few weeks at the church of the Laodiceans, as it's called in chapter"
    },
    {
      "id": 16,
      "start": 1869.3000717163086,
      "end": 1876.220069885254,
      "text": " 3 and verse 14, the church of the people, and we'll read how they say what they think"
    },
    {
      "id": 17,
      "start": 1876.220069885254,
      "end": 1880.5400695800781,
      "text": " they are, but then God says what they really are."
    },
    {
      "id": 18,
      "start": 1880.5400695800781,
      "end": 1887.0600662231445,
      "text": " Here for the church in Sardis, God says, here's your real condition, and here's the counsel."
    },
    {
      "id": 19,
      "start": 1887.0600662231445,
      "end": 1889.9000701904297,
      "text": " Here's your repent."
    },
    {
      "id": 20,
      "start": 1889.9000701904297,
      "end": 1896.3400650024414,
      "text": " He exposed it, and he expected that there would be a response."
    },
    {
      "id": 21,
      "start": 1896.3400650024414,
      "end": 1900.820068359375,
      "text": " We find the condition, the counsel, note the consequences, often we think about consequences,"
    },
    {
      "id": 22,
      "start": 1900.820068359375,
      "end": 1905.0200653076172,
      "text": " we think about them strictly in a negative sense, but I want to look at it both from"
    },
    {
      "id": 23,
      "start": 1905.0200653076172,
      "end": 1911.0200653076172,
      "text": " a positive and a negative sense this evening, and we find that negative, speaking from the"
    },
    {
      "id": 24,
      "start": 1911.0200653076172,
      "end": 1915.5400695800781,
      "text": " negative perspective, in verse number 3, he says this, remember therefore how thou hast"
    },
    {
      "id": 25,
      "start": 1915.5400695800781,
      "end": 1922.2600708007812,
      "text": " received and heard and hold fast and repent, if therefore thou shalt not watch."
    },
    {
      "id": 26,
      "start": 1922.2600708007812,
      "end": 1923.3000717163086,
      "text": " So what does he say?"
    },
    {
      "id": 27,
      "start": 1923.3000717163086,
      "end": 1927.5800704956055,
      "text": " If you're not going to take heed to my counsel, because I said be watchful, if you're not"
    },
    {
      "id": 28,
      "start": 1927.5800704956055,
      "end": 1934.2200622558594,
      "text": " going to do what I said to do, if therefore thou shalt not watch, I will come on thee"
    },
    {
      "id": 29,
      "start": 1934.2200622558594,
      "end": 1940.1000671386719,
      "text": " as a thief, and thou shalt not know what hour I will come upon thee."
    },
    {
      "id": 30,
      "start": 1940.1000671386719,
      "end": 1941.1000671386719,
      "text": " You know what Jesus is saying?"
    },
    {
      "id": 31,
      "start": 1941.1000671386719,
      "end": 1944.5000610351562,
      "text": " He's saying there's going to be judgment."
    },
    {
      "id": 32,
      "start": 1944.5000610351562,
      "end": 1948.7800750732422,
      "text": " God judges, he's the righteous judge."
    },
    {
      "id": 33,
      "start": 1948.7800750732422,
      "end": 1951.7800750732422,
      "text": " God corrects, he chastens."
    },
    {
      "id": 34,
      "start": 1951.7800750732422,
      "end": 1957.060073852539,
      "text": " The truth of Hebrews and the truth of Proverbs is whom the Lord loveth, he chasteneth."
    },
    {
      "id": 35,
      "start": 1957.060073852539,
      "end": 1961.580062866211,
      "text": " This evening we find that he says, if you're not going to take heed to my counsel, there"
    },
    {
      "id": 36,
      "start": 1961.580062866211,
      "end": 1963.4200744628906,
      "text": " will be judgment."
    },
    {
      "id": 37,
      "start": 1963.4200744628906,
      "end": 1969.5000610351562,
      "text": " He says that it will be sudden, he says that it will be certain."
    },
    {
      "id": 38,
      "start": 1969.5000610351562,
      "end": 1979.7000732421875,
      "text": " Too often today, I fear that people think that they're getting away with something."
    },
    {
      "id": 39,
      "start": 1979.7000732421875,
      "end": 1983.580062866211,
      "text": " They're hiding something that no one else knows about."
    },
    {
      "id": 40,
      "start": 1983.580062866211,
      "end": 1988.8600616455078,
      "text": " They think they're getting away with it because, well, everything's just kind of going normal"
    },
    {
      "id": 41,
      "start": 1988.8600616455078,
      "end": 1998.340072631836,
      "text": " and they fail to recognize that God is never okay with sin."
    },
    {
      "id": 42,
      "start": 1998.340072631836,
      "end": 2004.7400665283203,
      "text": " God is holy, holy, holy, holy."
    },
    {
      "id": 43,
      "start": 2004.7400665283203,
      "end": 2010.0200653076172,
      "text": " And I'm thankful that I'm clothed in the righteousness of God, but the reality this evening is that"
    },
    {
      "id": 44,
      "start": 2010.0200653076172,
      "end": 2014.7800750732422,
      "text": " we are to walk and we are to be holy as he is holy."
    },
    {
      "id": 45,
      "start": 2014.7800750732422,
      "end": 2018.0200653076172,
      "text": " We're to walk in the spirit so that we do not fulfill the lust of the flesh."
    },
    {
      "id": 46,
      "start": 2018.0200653076172,
      "end": 2026.9800720214844,
      "text": " But I tell you this evening, I'm concerned that people think, oh, I heard what the preacher"
    },
    {
      "id": 47,
      "start": 2026.9800720214844,
      "end": 2030.0200653076172,
      "text": " said, I read what the Bible said, I heard what the Sunday school teacher said, but"
    },
    {
      "id": 48,
      "start": 2030.0200653076172,
      "end": 2035.060073852539,
      "text": " eh, I'm not going to worry about that."
    },
    {
      "id": 49,
      "start": 2035.060073852539,
      "end": 2040.820068359375,
      "text": " God says there's going to be judgment, it's certain, it'll be sudden."
    },
    {
      "id": 50,
      "start": 2040.820068359375,
      "end": 2045.0200653076172,
      "text": " It may not be when you think it's going to be and you take that step and you look around"
    },
    {
      "id": 51,
      "start": 2045.0200653076172,
      "end": 2048.340072631836,
      "text": " and say, well, nothing happened, so I guess I'm okay."
    },
    {
      "id": 52,
      "start": 2048.340072631836,
      "end": 2051.340072631836,
      "text": " No, don't be deceived."
    },
    {
      "id": 53,
      "start": 2051.340072631836,
      "end": 2056.2200622558594,
      "text": " The book of Hebrews talks about sin, it talks about the deceitfulness of sin."
    },
    {
      "id": 54,
      "start": 2056.2200622558594,
      "end": 2061.580078125,
      "text": " Sin is deceitful, it's deceitful."
    },
    {
      "id": 55,
      "start": 2061.580078125,
      "end": 2066.9000549316406,
      "text": " We find that there's the positive aspect in verse number four, thou hast a few names even"
    },
    {
      "id": 56,
      "start": 2066.9000549316406,
      "end": 2072.540069580078,
      "text": " in Sardis which have not defiled their garments, thankful for a remnant, amen."
    },
    {
      "id": 57,
      "start": 2072.540069580078,
      "end": 2076.06005859375,
      "text": " There's some people there in the midst of all that was going on, now the reality is"
    },
    {
      "id": 58,
      "start": 2076.06005859375,
      "end": 2081.9000549316406,
      "text": " that they didn't stand up and they weren't making a huge difference, but there were some"
    },
    {
      "id": 59,
      "start": 2081.9000549316406,
      "end": 2087.2600708007812,
      "text": " that had not been defiled by the community, by the corruption, by all that was going on,"
    },
    {
      "id": 60,
      "start": 2087.2600708007812,
      "end": 2093.0200805664062,
      "text": " by all that Christ said about this church, and there were some, we don't know how many,"
    },
    {
      "id": 61,
      "start": 2093.0200805664062,
      "end": 2096.9800720214844,
      "text": " but he says thou hast a few names even in Sardis which have not defiled their garments,"
    },
    {
      "id": 62,
      "start": 2096.9800720214844,
      "end": 2101.4600830078125,
      "text": " and notice what he says, and they shall walk with me in white, for they are worthy."
    },
    {
      "id": 63,
      "start": 2101.4600830078125,
      "end": 2106.5000610351562,
      "text": " I'm thankful that God keeps a good record, I'm thankful that God knows, and that, listen,"
    },
    {
      "id": 64,
      "start": 2106.5000610351562,
      "end": 2109.9800720214844,
      "text": " I think about Noah, he found grace in the eyes of the Lord."
    },
    {
      "id": 65,
      "start": 2109.9800720214844,
      "end": 2114.1800537109375,
      "text": " You know if you read Genesis chapter number six and you look and you understand all that's"
    },
    {
      "id": 66,
      "start": 2114.1800537109375,
      "end": 2118.9000549316406,
      "text": " going on in Genesis chapter number six, you find that it was Noah that found grace in"
    },
    {
      "id": 67,
      "start": 2118.9000549316406,
      "end": 2120.1800537109375,
      "text": " the eyes of the Lord."
    },
    {
      "id": 68,
      "start": 2120.1800537109375,
      "end": 2124.9800720214844,
      "text": " You find that there was great wickedness, God looked and he talked about the depravity"
    },
    {
      "id": 69,
      "start": 2124.9800720214844,
      "end": 2130.340057373047,
      "text": " of man and the thoughts of their heart were only evil and wicked continually, but Noah"
    },
    {
      "id": 70,
      "start": 2130.340057373047,
      "end": 2132.1400756835938,
      "text": " found grace in the eyes of the Lord."
    },
    {
      "id": 71,
      "start": 2132.1400756835938,
      "end": 2137.9800720214844,
      "text": " The reality is that even though we're living in a wicked and perverse generation, we can"
    },
    {
      "id": 72,
      "start": 2137.9800720214844,
      "end": 2144.100067138672,
      "text": " walk worthy, we can walk right, we can live in such a way that God is pleased, honored,"
    },
    {
      "id": 73,
      "start": 2144.100067138672,
      "end": 2145.100067138672,
      "text": " and glorified."
    },
    {
      "id": 74,
      "start": 2145.100067138672,
      "end": 2149.540069580078,
      "text": " I think about the book of Titus in chapter number two and verse number 11 where the Bible"
    },
    {
      "id": 75,
      "start": 2149.540069580078,
      "end": 2155.340057373047,
      "text": " says that the grace of God that bringeth salvation hath appeared to all men, teaching us, listen,"
    },
    {
      "id": 76,
      "start": 2155.340057373047,
      "end": 2162.0200805664062,
      "text": " God's grace teaches us that denying ungodliness and worldly lust, we should live soberly,"
    },
    {
      "id": 77,
      "start": 2162.0200805664062,
      "end": 2165.820068359375,
      "text": " righteously, and godly in this present world."
    },
    {
      "id": 78,
      "start": 2165.820068359375,
      "end": 2166.9800720214844,
      "text": " Why?"
    },
    {
      "id": 79,
      "start": 2166.9800720214844,
      "end": 2171.7400817871094,
      "text": " We're looking for that blessed hope and glorious appearing of our great God and Savior, the"
    },
    {
      "id": 80,
      "start": 2171.7400817871094,
      "end": 2178.9000549316406,
      "text": " Lord Jesus Christ, and we find that we do not have to be influenced by the wickedness"
    },
    {
      "id": 81,
      "start": 2178.9000549316406,
      "end": 2183.300079345703,
      "text": " and God knows and God is aware of what's taking place."
    },
    {
      "id": 82,
      "start": 2183.300079345703,
      "end": 2189.100067138672,
      "text": " We see in verse number five, he that overcometh, a phrase that's used repeatedly to these churches"
    },
    {
      "id": 83,
      "start": 2189.100067138672,
      "end": 2193.6200561523438,
      "text": " in the book of Revelation, the same shall be clothed in white raiment and I will not"
    },
    {
      "id": 84,
      "start": 2193.6200561523438,
      "end": 2198.56005859375,
      "text": " blot out his name out of the book of life, but I will confess his name before my Father"
    },
    {
      "id": 85,
      "start": 2198.56005859375,
      "end": 2200.1400756835938,
      "text": " and before his angels."
    },
    {
      "id": 86,
      "start": 2200.1400756835938,
      "end": 2205.300079345703,
      "text": " I find this evening that from a positive perspective, when we look at verse number five, I do not"
    },
    {
      "id": 87,
      "start": 2205.300079345703,
      "end": 2209.7200622558594,
      "text": " read this as being a threat, but an assurance."
    },
    {
      "id": 88,
      "start": 2209.7200622558594,
      "end": 2213.820068359375,
      "text": " It's not a threat when he says that I will not blot out his name out of the book of life,"
    },
    {
      "id": 89,
      "start": 2213.820068359375,
      "end": 2220.6200561523438,
      "text": " this is an assurance to these individuals that were not defiled, that were walking worthy,"
    },
    {
      "id": 90,
      "start": 2220.6200561523438,
      "end": 2226.1400756835938,
      "text": " that had this promise and this understanding of what they would receive and it's this assurance."
    },
    {
      "id": 91,
      "start": 2226.1400756835938,
      "end": 2230.9400634765625,
      "text": " Listen, today when we live in a wicked and perverse generation, sometimes we can become"
    },
    {
      "id": 92,
      "start": 2230.9400634765625,
      "end": 2238.2200622558594,
      "text": " all so overwhelmed with all the things that are around us and we lose sight of glory."
    },
    {
      "id": 93,
      "start": 2238.2200622558594,
      "end": 2243.6200561523438,
      "text": " We lose sight that one day we will walk with him and we will be with him and we will rule"
    },
    {
      "id": 94,
      "start": 2243.6200561523438,
      "end": 2249.2600708007812,
      "text": " and reign with him and so we find that the Lord Jesus Christ, he's giving this assurance"
    },
    {
      "id": 95,
      "start": 2249.340057373047,
      "end": 2252.6200561523438,
      "text": " to these that had not yet defiled."
    },
    {
      "id": 96,
      "start": 2252.6200561523438,
      "end": 2257.7400817871094,
      "text": " They had these few names in Sardis, the reference with regard to the book of life, there's several"
    },
    {
      "id": 97,
      "start": 2257.7400817871094,
      "end": 2262.5000610351562,
      "text": " references here in the book of Revelation as well as other parts of Scripture that speak"
    },
    {
      "id": 98,
      "start": 2262.5000610351562,
      "end": 2264.3800659179688,
      "text": " about the book."
    },
    {
      "id": 99,
      "start": 2264.3800659179688,
      "end": 2271.0200805664062,
      "text": " Some that refer to the book of life, the Lamb's book of life, the book written in heaven in"
    },
    {
      "id": 100,
      "start": 2271.0200805664062,
      "end": 2276.6600646972656,
      "text": " Luke chapter number 10 that have their names written in heaven, Philippians chapter number"
    },
    {
      "id": 101,
      "start": 2277.100067138672,
      "end": 2283.2600708007812,
      "text": " And so there's several references to the book of life and to the book in heaven and we find"
    },
    {
      "id": 102,
      "start": 2283.2600708007812,
      "end": 2290.5000610351562,
      "text": " this evening that I'm so thankful that my name is written in the book of life."
    },
    {
      "id": 103,
      "start": 2290.5000610351562,
      "end": 2294.9400634765625,
      "text": " And it's never going to be removed because it's all because of what Jesus did for me"
    },
    {
      "id": 104,
      "start": 2294.9400634765625,
      "end": 2300.9000549316406,
      "text": " and his righteousness, not my own righteousness and I have this assurance and I need to keep"
    },
    {
      "id": 105,
      "start": 2300.9000549316406,
      "end": 2305.340057373047,
      "text": " my focus upon the Lord Jesus Christ in eternity."
    },
    {
      "id": 106,
      "start": 2305.3800659179688,
      "end": 2309.300079345703,
      "text": " And so this week on Sunday morning as we continue looking through the book of 2 Corinthians"
    },
    {
      "id": 107,
      "start": 2309.300079345703,
      "end": 2314.9000854492188,
      "text": " in chapter number 4, it ends with Paul speaking about this perspective of not looking at the"
    },
    {
      "id": 108,
      "start": 2314.9000854492188,
      "end": 2320.7000732421875,
      "text": " things which are temporal but at the things which are eternal, how important that is for"
    },
    {
      "id": 109,
      "start": 2320.7000732421875,
      "end": 2321.7000732421875,
      "text": " us."
    },
    {
      "id": 110,
      "start": 2321.7000732421875,
      "end": 2331.9000854492188,
      "text": " And notice what he says in verse 6, he says it to every church, he that hath an ear, let"
    },
    {
      "id": 111,
      "start": 2331.9000854492188,
      "end": 2336.7800903320312,
      "text": " him hear what the Spirit saith unto the churches."
    },
    {
      "id": 112,
      "start": 2336.7800903320312,
      "end": 2343.8600463867188,
      "text": " This evening, Revelation 3, 1 through 6 is written to the church in Sardis but it's been"
    },
    {
      "id": 113,
      "start": 2343.8600463867188,
      "end": 2351.1400756835938,
      "text": " preserved in God's word for every local church and it's important that every local church"
    },
    {
      "id": 114,
      "start": 2351.1400756835938,
      "end": 2359.2600708007812,
      "text": " as we read this letter to the church in Sardis that we have ears to hear, that we take heed"
    },
    {
      "id": 115,
      "start": 2359.300048828125,
      "end": 2366.9400634765625,
      "text": " to the warning, that we recognize this evening the importance of why we exist."
    },
    {
      "id": 116,
      "start": 2366.9400634765625,
      "end": 2369.7800903320312,
      "text": " First and foremost to bring glory to God."
    },
    {
      "id": 117,
      "start": 2369.7800903320312,
      "end": 2376.4200439453125,
      "text": " Can I tell you this evening the church in Sardis as a whole, not bringing glory to God."
    },
    {
      "id": 118,
      "start": 2376.4200439453125,
      "end": 2381.2200927734375,
      "text": " They're not bringing glory to God."
    },
    {
      "id": 119,
      "start": 2381.2200927734375,
      "end": 2389.0200805664062,
      "text": " Can I tell you, they weren't impacting their community, they just weren't."
    },
    {
      "id": 120,
      "start": 2389.0200805664062,
      "end": 2393.9800415039062,
      "text": " And this evening when we think about our church, oh that God would help us to bring"
    },
    {
      "id": 121,
      "start": 2393.9800415039062,
      "end": 2399.9000854492188,
      "text": " honor and glory to His name alone and that we would impact our community."
    },
    {
      "id": 0,
      "start": 2399.9000854492188,
      "end": 2407.9600858688354,
      "text": " unity, that we would recognize the purpose that God has placed us here. Why are we here?"
    },
    {
      "id": 1,
      "start": 2407.9600858688354,
      "end": 2412.760085105896,
      "text": " Sometimes you might ask yourself that question as in, I should be moving, why am I here?"
    },
    {
      "id": 2,
      "start": 2412.760085105896,
      "end": 2420.7600860595703,
      "text": " But the reality is God's put us here. And just like every other local church, God has"
    },
    {
      "id": 3,
      "start": 2420.7600860595703,
      "end": 2426.960084915161,
      "text": " them there for a purpose. God's given to us a purpose. The church in Sardis had failed"
    },
    {
      "id": 4,
      "start": 2426.960084915161,
      "end": 2432.9600868225098,
      "text": " their Lord. In a real sense, they failed their community. This evening, I don't want to fail"
    },
    {
      "id": 5,
      "start": 2432.9600868225098,
      "end": 2438.2600860595703,
      "text": " my Lord and I don't want to fail my community. There are people in our community that need"
    },
    {
      "id": 6,
      "start": 2438.2600860595703,
      "end": 2446.280086517334,
      "text": " to hear the truth of the gospel. I shared with you in our annual business meeting a"
    },
    {
      "id": 7,
      "start": 2446.280086517334,
      "end": 2455.2000846862793,
      "text": " map of our county and listed out for you by zip code the number of residents in our community"
    },
    {
      "id": 8,
      "start": 2455.280086517334,
      "end": 2462.4800872802734,
      "text": " and our county. Last night we're sitting around the table or in our kitchen and one of the"
    },
    {
      "id": 9,
      "start": 2462.4800872802734,
      "end": 2467.4800872802734,
      "text": " young ladies started singing a part of a song that is Holly's dad's favorite song. Some"
    },
    {
      "id": 10,
      "start": 2467.4800872802734,
      "end": 2474.8000869750977,
      "text": " of you might know it, People Need the Lord. It's true. People need the Lord. And this"
    },
    {
      "id": 11,
      "start": 2474.8000869750977,
      "end": 2481.4000854492188,
      "text": " church in Sardis, they weren't impacting their community. And he that hath an ear, let him"
    },
    {
      "id": 12,
      "start": 2481.4000854492188,
      "end": 2488.3600845336914,
      "text": " hear. Oh that God would use us to make a difference that would bring glory to God."
    },
    {
      "id": 13,
      "start": 2488.3600845336914,
      "end": 2494.4000854492188,
      "text": " Let's pray. Father we love you. We thank you for loving us. Thank you for your word. God,"
    },
    {
      "id": 14,
      "start": 2494.4000854492188,
      "end": 2505.2800827026367,
      "text": " it's a hard message to the church in Sardis, very direct. But I believe it's a loving message."
    },
    {
      "id": 15,
      "start": 2505.2800827026367,
      "end": 2515.6400833129883,
      "text": " You correct because you love. You counsel because you love. You expose and expect response."
    },
    {
      "id": 16,
      "start": 2515.6400833129883,
      "end": 2523.2800827026367,
      "text": " God I pray that this evening you would help us to be obedient, to be good hearers, to"
    },
    {
      "id": 17,
      "start": 2523.2800827026367,
      "end": 2530.320083618164,
      "text": " be doers. Help us to examine individually and corporately what you've given for us to"
    },
    {
      "id": 18,
      "start": 2530.320083618164,
      "end": 2534.880081176758,
      "text": " do. And help us to be faithful. Well thank you for it in Christ's name we pray. Would"
    },
    {
      "id": 19,
      "start": 2534.880081176758,
      "end": 2536.9200897216797,
      "text": " you stand with me? Heads are bowed, eyes are closed."
    }
  ],
  "processed_at": "2025-04-14T19:52:05.829792"
}