{
  "video_id": "5h8hCyhAJAM",
  "text": "Chapter 43 and 44, you say, pastor, you're gonna deal with 68 verses tonight. Yes, I am. And last Sunday night, we were here until 12.30 a.m. And so we are in good shape. It is 6.18, amen. And I got plenty of time to get through 68 verses. And some of you say, I am leaving. I am not going to endure that. In all seriousness, with God's help, we will make it through these verses in a timely manner this evening. And in Genesis chapter number 42, we studied several weeks ago. There's been a number of Sunday evenings between our last study in the book of Genesis and this evening. And we had Christmas Eve service and we had our Christmas lunch with an afternoon service. And then we had New Year's Eve service. So it's been almost a month since we've been in the book of Genesis on Sunday evening. But very quickly to remind us of what happened in Genesis 42, it was in that portion of scripture where Joseph's brothers went to Egypt the first time. And as we studied through Genesis chapter number 42, we talked about how God is at work. And we talked about God working locally and God working globally. But we really, we spent just a few minutes on each of those thoughts, really combined just a few minutes. And we focused on the entirety of really the message how God was working personally. And I'm thankful that we serve a God who is the God of the universe. I'm thankful that he is the creator and sustainer of all things, but he is a personal God. And he deals with individuals and he knows us. He knows all about us. He knows your thoughts. He knows everything about you. And he loves you and he pursues you and he's working. And we focused on how God was working personally. We really focused on God's work in the lives of Joseph's brothers. We had understood as you look at Genesis 42 and look at the next several chapters that really it had been at least 20 years since Joseph had last seen his brothers. In that period of time, of course, there were a lot of changes in Joseph's life. And no doubt there were a number of changes there in the lives of his brothers as well. But they were holding on to something that they knew that they really didn't share with anyone. They knew what they did to Joseph. They knew all that had transpired, but of course they allowed dad to believe that some evil beast hath devoured him. And for all those years, Jacob lived thinking that Joseph was dead. And really the brothers almost were able to try to console themselves in a certain way by saying one is not. That's how they continually referred to Joseph as one is not. And we find they come to Egypt. They have no idea that Joseph is the prime minister of Egypt, that he's the one before whom they stand. But Joseph knows their identity. He knows who they are. And we find that as God is working personally in the lives of these boys, of these brethren, I say boys, but really they're men. We find that God is working and their experience in Egypt reminded them of the last encounter that they had with their brother and God was convicting them. God was pursuing them. We find if you would quickly look at Genesis 42 in verse 21, notice what they say in this verse of scripture. They say one to another, we are verily guilty concerning our brother in that we saw the anguish of his soul when he besought us and we would not hear. Notice therefore is this distress come upon us. God was working. I mean, God was zeroing directly in and the lives of these men, of these brothers of Joseph, that event that had taken place over 20 years earlier, they were convicted. They had guilt and they say, this is the reason that we're dealing with this situation. In verse 28 of Genesis 42, the Bible says that he said unto his brethren, my money is restored and lo it is even in my sack and their heart failed them and they were afraid. Notice they said one to another, what is this that God hath done unto us? They get home and they begin to recurse all that had transpired on this first trip to Jacob their father and they let Jacob know what's going on. The Bible says that they had fear, even as they mentioned in verse 28 and they recognized that God was working. Now, I do not know, I cannot tell you definitively how much time passed between the first trip to Egypt and the second trip to Egypt that we're gonna study this evening. In chapters 43 and 44, we have the opportunity to read of the second trip that these brothers take to Egypt. We do not know the period of time. However, what we know is we try to consolidate and figure out exactly what's taking place that the Bible tells us at the end of chapter 41 that the seven years of dearth began to come. So there were seven years of great plenty, the seven years of great dearth or great famine started. And we said this last time that the famine was so intense and so severe that it had an immediate impact. I mean, all the world, the known world comes to Egypt to buy food because there's no food. This is a sore famine. It is a great famine. We know that in chapter number 45 of the book of Genesis that Joseph reveals his identity to his brothers. Now that's gonna be saved for next Sunday night. We'll deal with that in chapter 45 next week. But I do want to know that in the time, in that circumstance when Joseph is revealing his identity, he says in Genesis 45 in verse number six, for these two years hath the famine been in the land. So we know that the famine started at the end of chapter 41. We know that in chapter 45 when Joseph reveals his identity that there's two years into the famine, which is going to be seven years long. And so these two trips happen within those first couple of years of the famine. And we find that as they return back, the brothers, all but Simeon, remember Simeon was apprehended and he stays in Egypt. He's imprisoned there. And we find that all the boys return home with provision for the family. But soon, because of the great famine, that provision would be gone. And there would be need to go back to Egypt. But the brothers understood. I think that in the time that transpired between their return from Egypt and then going back to Egypt, they didn't forget what happened in Egypt. They didn't forget what was going on and how God was convicting them. And they were aware of that. So we come to chapter 43, and the Bible says in verse number one, and the famine was sore in the land. And it came to pass, verse two, when they had eaten up the corn, which they had brought out of Egypt, their father said unto them, go again, buy us a little food. As we look at this portion of scripture and we continue to see how God is continuing to work in the hearts and lives of these brethren of Joseph, we find tonight really three thoughts. And we're gonna focus mainly on chapter 44 this evening. We'll get through chapter 43 and get to chapter 44 to look at how God is dealing with these boys. Let me say this, in chapter 44, at the end of verse number 12, the Bible says in the cup was found in Benjamin's sack. That's what I've titled the message this evening. You've probably seen it on the back of the bulletin already, but the cup was found in Benjamin's sack. Notice in chapter 43, if you're taking notes, number one, we notice the famine. We notice the famine. The famine continues. We know, as we've studied through the life of Joseph, that Joseph was aware after the dream of Pharaoh that there would be seven years of great plenty, and then there would be seven years of great famine. And so we understand as we enter into the text of scripture how God is working and what God is doing and how God was working there in Egypt and God had given Pharaoh that dream and allowed Joseph to interpret the dream, not only to interpret the dream, but to have the wisdom to put a plan in place that would enable not only the Egyptians to be sustained, but really all the world to be sustained. And we find that God was working and God had given much wisdom. And by the way, I'm thankful that that God is my God, that he's my savior, and that he gives us wisdom. He said, if any man lack, let him ask of God, who giveth all men liberally and upbraideth not. Listen, that's a wonderful promise of God's word from James chapter number one, because the reality is that in each of our lives, we lack wisdom. Sometimes we continue to lack wisdom because we don't acknowledge that we lack wisdom and we never ask God. But God, he's the all-wise God. And he gives Joseph great wisdom. And we find that as we enter into the 43rd chapter, we know that the famine's gonna continue. We know that it's gonna be great, grave consequences. And we understand that the sustenance, the provision that was brought back in chapter 42, it's not gonna last the entire time of the famine. What are they gonna do with the provision? They're gonna eat it. How many times you go to the grocery store? We asked Ms. Deanna, she goes every other day, amen. But just joking, and you find, listen, the provision, you only have enough to sustain you for a period of time. And the Bible says in verse number two, that they had eaten up the corn, which they had brought back. out of Egypt. So what does Jacob say? Go again, buy us a little food. It just makes sense, does it not? I mean, there's one place that they're gonna get food, and they need food to survive, and so the instruction is given, understand that as we look here at this text of Scripture and we note the famine, that it was sore in the land. They needed food, but the expectation was known. The brothers knew. In fact, Jacob knew that the only way, the prime minister, they don't know that it's Joseph, the only way that Joseph will entertain them again is if Benjamin comes. Now Jacob is completely opposed to the idea of Benjamin going. Why? Joseph, in his mind, is dead, and now I'm gonna lose Benjamin as well. And so we find that in verse number 3, Judah speaks up. In fact, over the next two chapters as we study through these chapters this evening, we'll see that Judah seemingly is the spokesman for the group of brothers. He's speaking to him saying, here's what he says to his dad, the man did solemnly protest unto us saying, ye shall not see my face except your brother be with you. Now we won't take time to read all of it, but really Jacob has this thought of, why did you tell him you had a brother? And the reality is that the brothers, they had no idea that when Joseph was asking the questions, when he says you're spies and you've come to spy out the land, and he asked about the welfare and the father and so on and so forth, they have no idea the reasoning of the questions and what it's going to lead to. They could not know that Joseph, the prime minister of Egypt, would say Benjamin must come or I will not see you. And so there's this dialogue that takes place and we find that it's pretty clear that the boys say to Jacob, listen, the only way we're going is if Benjamin comes with us. Because it's a waste of a trip for us to go if Benjamin is not with us. He made it abundantly clear, the expectation was known and therefore we must go, but if we must go, we must take Benjamin with us. We find that Jacob gives instruction with regard to preparing a gift to take to the man. Again, they don't know who the man is, but they're gonna take, and you think about the gift that it's mentioned here in verse number 11, the Bible says, and their father Israel said unto them, if it must be so, now do this. Take the best fruits in the land in your vessels. It is a famine. There's like nothing. They're gonna take the very little that they can possibly put together so that they might be able to find grace or in favor in the in the eyes of this man that is in charge and carry down the man a present, a little balm and a little honey, spices and myrrh, nuts and almonds, and take notice, double money. Why double money? Well, when they got home, the first time the money was in their sacks, and so they're trying to do everything they can. Jacob is trying to do everything he can to ensure that they can get food, but I believe most importantly that Benjamin will return. That's his objective. We find that in verse number 13, the Bible says, well let's back to verse 12 and take double money in your hand and the money that was brought again in the mouth of your sacks, carry it again in your hand. Peradventure, it was an oversight. Notice verse 13, Jacob gives in. Take also your brother and arise, go again unto the man. And God Almighty give you mercy before the man. By the way, Jacob knew the Lord. He knew the the God of the universe, and he knew that God could give mercy. And he says, God Almighty give mercy before the man that he may send you, send away your other brother, that's Simeon and Benjamin. If I be bereaved of my children, I am bereaved. Notice they're in a tough spot. I mean, if they don't send Benjamin, they're just gonna die in Canaan. There's no food. There's a great famine. It's soaring the land. They've eaten up all the food. And so they send a present, these few things, and Benjamin. And we find that these ten brothers, they travel to Egypt. Simeon and Joseph are in Egypt, one incarcerated, one the prime minister. And the ten brothers travel. And so we see the famine. We see really the events or circumstances that lead to the second trip. As we notice and continue through chapter 43, in verses 16 through 34, notice with me the feast. The feast. It's very interesting circumstances that take place. The Bible says in verse 15 that the men took that present. They took double money in their hand and Benjamin and rose up and went down to Egypt and stood before Joseph. So they go. They know the process. They've been there once before. They know what they're to do and they stand before Joseph. And notice the Bible says in verse 16 that Joseph saw Benjamin with them. He said to the ruler of the house, of his house, bring these men home and slay and make ready for these men shall dine with me at noon. And the man, it says in verse 17, did as Joseph bade. Joseph had great power. And the man brought the men into Joseph's house. And then notice the phrase in verse 18, and the men were afraid. I don't know all that's going through their mind at this particular time, but I don't think they expect it to be invited to this man's house. And there's a great feast. We won't take the time to read all that is taking place here in chapter 43. You can read it on your own, but understand that as they gather together, that these men that are afraid, they begin to speak. They came near to the steward of Joseph's house in verse number 19 and they communed with him at the door of the house and said, oh sir, we came indeed down at the first time to buy food. Verse 21, it came to pass when we came to the inn that we opened our sacks and behold, every man's money was in the mouth of a sack, our money in full weight. Notice what they say, and we have brought it again in our hand. Just in case we're here because of the money situation, we've already brought it back. I mean, they're concerned. They're afraid. They don't know why they're there. The Bible tells us that they mentioned that they have other money in order to buy the provision. And notice in verse 23, this man that is mentioned the steward of Joseph's house in verse 19, he says to the brothers, peace be to you. Fear not. Your God and the God of your father have given you treasure in your sacks. I had your money and he brought Simeon out unto them. Now the reality is that they did have the money, but they returned the money. Joseph instructed them to do that and we find that they bring Simeon. And then in verse 24, the man brought the men into Joseph's house and they gave them water and they washed their feet and he gave their asses And they made ready the present against Joseph came at noon, for they heard that they should eat bread there. When Joseph came home, they brought him the present which was in their hand into the house. And notice it says, and bowed themselves to him to the earth. Remember the dreams that Joseph had? Begin to see the fulfillment of those dreams in this interaction here. In verse 27, he asked them of their welfare and said, is your father well? The old man of whom you spake, is he yet alive? You know why Joseph's inquiring, it's his dad. He's concerned about the welfare of his father and he inquires and the Bible says in verse 28 that they respond and they say, thy servant our father is in good health, he is yet alive. And they bowed down their heads and made obeisance. Again, the fulfillment of the dreams that we spoke about many weeks ago in Genesis 37. And we find here that that they they bowed down their heads and they made obeisance. In verse 29, he lifted up his eyes and saw his brother Benjamin, his mother's son. This is his only full brother. Remember the the house of Jacob is a is a messed up house. We dealt with all the the children and what have you and all of the the two wives and handmaids and so on and so forth many months ago. And we see that his brother Benjamin is there and he says, is this your younger brother of whom you spake unto me? And notice it's almost as if Joseph could not contain himself. It's as if he shouts out, he says, God be gracious unto thee my son. And then he made haste for his bowels did yearn upon his brother and he saw it were to weep and he entered into his chamber and he wept there. As you look at this account and you see what's happening, you see this feast and and you find how God is continuing to work and as God is using Joseph and orchestrating these circumstances, we find that God is continuing to pursue these brothers and we find that the Bible tells us that that Joseph then comes out after he had wept in his chamber and it says in verse 33 and they sat before him the firstborn according to his birthright and the youngest according to his youth and the men marveled one at another. Can you imagine? I mean put yourself in the situation. There are ten of you and you're seated around the table and you're seated in birth order. I mean God is working. What is going on? How do they? Yeah, it's right. I mean it's perfectly aligned and I begin to think as I study through these portions of Scripture and read these verses and see how God is working. He took and sent messes. Joseph sends them food it says unto them from before him but Benjamin's mess was five times so much as any of theirs. All the youngest brothers and siblings said praise the Lord, amen, because normally they just get the scraps. They don't get very much but here Benjamin, I mean he gets a full portion and it was a time the Bible says that they were merry with him. Now they still don't know who they're dining with. They don't know who they're enjoying this feast with but it's not as bad as they thought it might be. When they were first invited to his house, they're afraid. They don't know what's going on, and they're concerned, and they say, hey, we know that when we left, our money was found in our sack, but we've brought it back. Things kind of progress and kind of enjoying, but it's going to end at some point, and there's got to be a measure of uncertainty and maybe assumption as to what's going to take place, and we find that in verse, as we enter into the 44th chapter, that as we look at what's taking place, it says that he commanded the steward of his house, so this is Joseph making this commandment, and here's what he says. In verse 1 of chapter 44, fill the men's sacks with food, as much as they can carry. Put every man's money in his sack's mouth. Doesn't end there. And put my cup, verse 2, the silver cup. You see the specific? I mean, Joseph's making sure he knows what he's talking about. He says, and put my cup, the silver cup, in the sack's mouth of the youngest, and his corn money. And he did, according to the word that Joseph had spoken, the steward obeyed the commandment of Joseph, without any question, by the way. It's a good lesson all in itself, the importance of obedience. We find that the steward, he obeyed his master. Joseph is the master, and Joseph gave the command, and the servant, this man, he did what he was instructed to do. The Bible says in verse 3, as soon as the morning was light, the men were sent away, they and their asses. Now, at this particular moment, they probably think we're in the clear. I mean, we're leaving. They came, and they were able to succeed, and what their objective was, and they had this meal, there's a famine that's going on, but they had this great feast, and now the morning light comes, and they're going to depart. And the Bible says when they were gone out of the city, in verse number 4, and not yet far off, I mean, they didn't get very far, that Joseph said unto his steward, up, follow after the men. When thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good? Is not this it, in which my Lord drinketh, and whereby indeed he divineth, ye have done evil in so doing? And he, that servant, overtook them, and he spake unto them these same words. Again, we see the obedience of this servant, as we find here in this portion of Scripture, the steward of his house, and we find that as we enter into this 44th chapter, we've spoken about the famine, and we see about the feast, but I want you to see the plea. The plea. And really, it's the plea of Judah. He's the spokesman for the brothers, but we find that as the steward of the house, he overtakes the brothers as they departed from the house of Joseph, and we find that they say unto him, in verse number 7, Wherefore saith my Lord these words, God forbid that thy servant should do according to this thing. Behold the money, which we found in our sacks' mouths, we brought again unto thee out of the land of Canaan. How then should we steal out of thy Lord's house silver or gold? I mean, we're being accused of stealing, no, we didn't do this. In verse number 9, notice what they say, they really, in verse number 9, they were so confident that they suggest what the penalty should be, what the punishment should be, if it's found that they're guilty. With whomsoever thy servants it be found, both let him die, and we also will be my Lord's bondmen. That's pretty serious, is it not? And he said, No, also let it be according unto your words. He with whom it is found shall be my servant, and ye shall be blameless. They said, The one in whom it's found, let him die, and all of us will be your servants. And we find that the steward of the house, he says, No, here's how it's going to work. With whomsoever it's found, that individual will be the servant, everyone else is blameless. And they speedily took down every man of sack to the ground and opened every man of sack. I mean, they're confident. And he searched and began at the eldest and left at the youngest, and the last part of verse 12, we use it as our title, and the cup was found in Benjamin's sack. The cup was found in Benjamin's sack. The Bible says in verse 13 that they rent their clothes, I guess so, I guess so. They rent their clothes and laid at every man his ass and returned to the city. Jude and his brethren came to Joseph's house, for he was yet there, and they fell before him on the ground. Joseph said unto them, What deed is this that ye have done? Wilt ye not that such a man as I can certainly divine? And Judah said, again, Judah, again, as I mentioned earlier, he's the spokesman. We see that he's speaking to Jacob in chapter 43, and he's the one that's speaking on the behalf of the brethren. And it says that he says, What shall we say unto my Lord? What shall we speak? Or how shall we clear ourselves? Notice what he says, God hath found out the iniquity of thy servants. Listen, God always knew. It's not as God found out in the fact that he discovered it, but really that he's making it known. He's exposing their wickedness. We find that God is working, and God is continuing to pursue and to break Judah and the brethren. And we find that as they evaluate, again, the circumstances, even as they did in that first trip, as we studied in chapter 42, they reached the conclusion that God is doing this. God is working. God is dealing with us according to what happened 20 years earlier, at least 20 years earlier. Notice, they say in verse 16, Behold, we are my Lord's servants, both we and he also with whom the cup is found. All of a sudden, they don't want Benjamin to die. And of course, we know that that would be the case with regard to the commitment that was made to Jacob with regard to returning Benjamin safely. And we find that Judah says to Joseph, again, he doesn't know that it's Joseph, but he says that God hath found out the iniquity of thy servants, behold, we are my Lord's servants, both we and he also with whom the cup is found. And he, Joseph, says, God forbid that I should do so. But the man in whose hand the cup is found, he shall be my servant. And as for you, get you up in peace unto your father. In verse number 17, Joseph offers to release everyone but Benjamin, but Judah protests. Judah comes and speaks again to Joseph in protest to this offer that is made as Joseph says that all of you are free to go. Benjamin, he's the one that the cup was found in his sack. He's the one that will remain here as my servant. And Judah, in verse number 18, speaks up once again. The Bible says that he came near unto him and he said, Oh, my Lord, let thy servant, I pray thee, speak a word in my Lord's ears, and let not thine anger burn against thy servant, for thou art even as Pharaoh. Begins to rehearse even from the very first trip. My Lord asked his servants saying, have you a father or a brother? He said unto my Lord, we have a father, an old man, a child of his old age, a little one. His brother is dead, and he alone is left of his mother, and his father loveth him. And thou saidst unto thy servants, bring him down unto me that I may set mine eyes upon him. And we said unto my Lord, the lad cannot leave his father, for if he should leave his father, his father would die. Thou saidst unto thy servants, except your youngest brother come down with you, ye shall see my face no more. It came to pass when we came up unto thy servant, my father, we told him the words of my Lord, and our father said, go again and buy a little food. Verse 26, we said, we cannot go down. If our youngest brother be with us, then will we go down, for we may not see the man's face except our youngest brother be with us. And thy servant, my father, said unto us, ye know that my wife bear me two sons. And the one went out for me, and I said, surely he is torn in pieces, and I saw him not since.\" Judah doesn't know that he's speaking to this one. He doesn't know that he's speaking to Joseph. It might be that, I mean, Joseph is hearing firsthand really what was communicated to Jacob about Joseph's presumed death. It says in verse number 29, and if you take this also from me, and mischief befall him, ye shall bring down my gray hairs with sorrow to the grave. Now therefore, when I come to thy servant, my father, and the lad be not with us, seeing that his life is bound up in the lad's life, it shall come to pass when he seeth that the lad is not with us, that he will die. And thy servants shall bring down the gray hairs. of thy servant our father with sorrow to the grave. For thy servant became surety for the lad unto my father, saying, if I bring him not unto thee, then I shall bear the blame to my father forever. Notice verse 33. Notice what Judah says. Now, therefore, I pray thee, let thy servant abide instead of the lad, a bondman to my Lord, and let the lad go up with his brethren. And then he says this in verse 34, for how shall I go to my father? And the lad be not with me, lest peradventure I see the evil that shall come on my father. Do you see a difference in Judah in chapter 44 versus what you find in previous interaction as they came back to Jacob in chapter number 37, when they began to share with Jacob the fact that they found this coat. They say in verse 32 of Genesis 37, this have we found, know now whether it be thy son's coat or no. And it says in verse 33 of chapter 37 that he knew it. Jacob knew it was the coat that he gave his son and he knew it. And he said, it is my son's coat. An evil beast hath devoured him. Joseph without doubt is rent in pieces. And Jacob run his clothes and put sackcloth upon his loins. He mourned for his son many days. All his sons and his daughters rose up to comfort him, but he refused to be comforted. For he said, for I will go down into the grave into my son mourning thus his father wept for him. But we find in chapter 44, Judah's, there's a change. God's been working. 20 years has passed. Two trips to Egypt. He's in Egypt. He started to leave after a second trip, but then all of these things came. And we find that as Judah is standing there before Joseph and he's really pleading with Joseph and he's pouring out his heart and he's sharing his concern for his father. He's putting himself in a position where he says, how shall I go up to my father in verse 34 and the lad be not with me? Lest peradventure I see the evil that should come on my father. He didn't care about that in chapter 37. He didn't care for a moment in chapter 37, how Jacob would respond to the news, to the belief that Joseph was dead. God was working. God was working. They said, as we looked in chapter 44 in verse 16, God hath found out the iniquity of thy servants. And I believe that in verse 33, it reveals to us as Judah is speaking there, true brokenness. Notice what Judah says in verse 33. Now therefore, I pray thee, let thy servant abide instead of the lad a bondman to my Lord and let the lad go up with his brethren. You know what Judah's saying? I'll take the punishment. Let Benjamin go free. I'll take the punishment. The cup was not found in my sack. It was found in his sack. But pour the punishment, the wrath on me, not on him, let him go. I believe that's a great picture of brokenness. I believe that as we look at this portion of Scripture and we begin to understand how God is working and what God is doing, and again, next week on Sunday evening, we'll deal with chapter 45 and we'll understand how Joseph will reveal his identity as brothers. And I believe that Joseph was a man that was sensitive to God's leading in his life. And after this plea of Judah, after this interaction, we find that Joseph realizes that, and God gave direction that they're broken and now is the time to reveal your identity. But until that time, we find that God was working. I wonder tonight, I ended the last message about a month ago on, I believe it was December 10th, that Sunday evening, and I talked about the fact that God is at work, God is working. He's pursuing, and I asked this question, how is God working in your life? Listen, the reality is that we can't hide anything from God. You know, a lot of people try to hide things from God, but you can't. For 20 years, 20 years, that's a long time. 20 years is a long time. For 20 years, they tried to live life, suppressing what happened with Joseph. They lived for 20 years. They don't wanna talk about it. They don't wanna deal with it. They just wanna suppress it. But God was working. There's so many reasons that God was working with regard to the famine in the land, but one of them, no doubt, is the brokenness of these brothers. And we find that through the events that transpire that these men, they stand there and they recognize because of the events and the circumstances that God is exposing their wickedness. This evening, I'm thankful that heaven is my home. I'm thankful that I'm heaven-bound, but I want you to understand that you and I can live our lives in such a way that displeases God. God is not pleased with wickedness. God is not pleased with sin. God, listen, tonight, we understand our God is a holy God. He is a thrice holy God. And our God, who is a holy God, said to us as his children that we're to be holy, for he is holy. That we're to be holy in all manner of conversation. And we understand that we have a God, we're not gonna ever be perfect. We have a God who promises to forgive when we sin, to be gracious and merciful. We have an advocate with the Father, Jesus Christ the righteous. It's a wonderful Bible truth. I've said this many times in this pulpit that the truth of 1 John 2, that we have an advocate with the Father should cause each of us to rejoice, that he never argues your innocence because you're guilty. He simply says, I paid for it. And if we confess, according to 1 John 1 and verse number 9, he promises to cleanse us and to forgive us. And we find that this evening, there are some that live in this era in which we're living in of Christianity that have this idea that within Christendom, that you can just live however you wanna live and you can do whatever you wanna do. And you're just going to heaven one day and all's going to be fine. Listen, understand that we're to walk worthy. We're to please God. Understand this evening that God knows about sin in your life and in my life. He knew what happened to Joseph. Though they tried to devise a plan and cover it and all that they tried to do, all of the extent that they went through, God knew. And in due time, God exposed. I think as you consider back several messages, when Rachel steals the idols of her father, Jacob says, let them die. He didn't even know that Rachel had them. He had no idea. Her father didn't find the idols because she lied, but God knew that she had the idols. I preached the message that particular text of scripture is what's in your tent. Because you know what's in your tent and God knows what's in your tent. Your spouse might not know what's in your tent. Your parents might not know what's in your tent. Your kids might not know what's in your tent, but God knows and you know. Amen. Notice in Proverbs chapter 30, we'll finish, or chapter 28, we'll finish with this tonight. Our God pursues and our God works because our God is a forgiving God. You understand this evening that as we enter into a relationship with God, he's our father and we're his children, that he wants our fellowship to be right. The reality this evening is that for any one of us that would say, I long to be close to God, he desires more for your closeness than we could ever desire for that closeness. He desires for that fellowship. And he wants, and we sing the song, nothing between my soul and my savior. And the reality is that our God, he's ready to pardon. He's ready to forgive. He's ready to forgive. I hope that you can see in your mind's eye as you consider those truths of our, the character of our God, being ready to pardon and ready to forgive. God is not standing and standing back and saying, nope, I'm not gonna forgive him this time. I'm not gonna do it this time. God is ready to pardon. He's a God that is full of compassion. He's a God who is full of mercy. But the reality is that if we try to cover our sin, we're not gonna prosper. The Bible says here in Proverbs 28 and verse number 13, he that covereth his sins shall prosper. not prosper.\" Can I tell you this evening, you're not going to be the first one to prove that verse wrong. You're just not. Amen? God said, He that covereth his sins shall not prosper. Did you ever study the life of David? Did David try to cover his sin? He went through great length to try to cover his sin. Did he not? I mean, he did really everything within his power to cover his sin. But God knew about his sin. God sent a prophet by the name of Nathan. Nathan tells him a little story. You know what David's response is to that story? Let that man die. Yeah. And Nathan stands there and I can see in my mind's eye the boldness of the prophet of God who said, Thou art the man. But the beautiful thing about David is you look in Psalm 51, he didn't continue to try to cover his sin. He sought the forgiveness of God. In the beginning, he tried to cover his sin. But after the prophet of God comes and exposes it, he gets it right. We see here the Bible says, He that covereth his sins shall not prosper. But notice, whoso confesseth and forsaketh them shall have mercy. I'm thankful for God's mercy. The reality this evening is that all of us have been recipients of God's mercy. Our God is rich in mercy. And we find this evening that we could be on one side or the other of this verse of Scripture. The reality tonight is that every single one of us has sin. Amen? None of us are sinless. Sometimes we might like to think we are. But you're not. And neither am I. So what do we do with our sin? How do we handle our sin? Do we cover it or do we confess it? Because really those are the only two options. And if we cover it, we know that the Bible says we're not going to prosper. But if we confess it, we know that the Bible says that we shall have mercy. Which side of the equation would you like to be on? I'd like to be on the one of receiving mercy. Amen? In Psalm 51, I know that I said that we'd end in Proverbs 28, but in Psalm 51, I won't read the entirety of this Psalm. It's 19 verses. But I want you to see in this portion of Scripture that David, after his sin is exposed and after Nathan stands and says, Thou art the man, he did everything he could to cover it, but God knew. Listen, you're going to drive yourself crazy trying to cover your sin. And you could never do it. You just can't. You say, well, I got the wool pulled over their eyes. My parents don't know. God knows. God knows. My spouse has no idea. God knows. These ten boys, nine of them, well, yeah, ten of them, for twenty years thought nobody knows what we did with Joseph. No one knows. Dad thinks he's dead. He has no idea what happened. God knows. In Psalm 51, the Bible says that David, this is his prayer of repentance, have mercy upon me, O God. What a sweet way to start the prayer. Whoso confesseth shall have mercy. We just read it in Proverbs 28. According to thy lovingkindness, aren't you thankful that our God is merciful, his lovingkindness? According unto the multitude of thy tender mercies, blot out my transgressions. Wash me, notice what he says, throughly from mine iniquity, and cleanse me from my sin. For I acknowledge my transgressions and my sin is ever before me. Against thee, thee only, have I sinned and done this evil in thy sight, that thou mightest be justified when thou speakest and be clear when thou judgest. I don't have time to read the entirety of the psalm. But I want you to understand this evening, as we look at an account in Genesis 43 and 44, you can look at what Joseph did and how he instructed his steward and what have you. God was working. God was pursuing those brothers, those men. And God brought Judah to a place of brokenness. That Judah, he came to the place and said, let Benjamin go, I'll take the punishment. And I just wonder tonight, as we think about that picture of brokenness and we understand that in this same psalm, in Psalm 51, in verse 17, it says, the sacrifices of God are a broken spirit, a broken and a contrite heart, O God, thou wilt not despise. Then in verse 19, shalt thou be pleased with the sacrifices of righteousness with burnt offering and whole burnt offerings, then shall they offer bullocks upon thine altar. You can try to do all kinds of outward things, but if your heart's not right, God's not pleased. You can read it of the nation of Israel, you can read it of Judah. You know what God says to Israel and Judah about their sacrifices? Stop bringing them. Just stop bringing them. You say, but God's the one that instructed them to bring them. Sure He is, with a right heart. He said, you draw nigh to me with your lips, but your heart's far from me. And God said, stop bringing those sacrifices, get your heart right. It's not about going through the motions, it's not about doing outward things. God said, a broken spirit, a broken and a contrite heart. God worked in the lives of those brethren. That second trip to Egypt, it was an important trip. They don't make it back home until after Joseph reveals his identity in chapter 45. We'll look at that next week. But I want you to just think about it tonight. Is there anything between my soul and my Savior? Is there sin in my life? We're all sinners. Are we covering? Are we confessing? Do we understand the equation as Proverbs 28, as I reference it that way tonight? If we're covering, we're not going to prosper. You say, nobody knows. God knows. That ought to convict you. And when you understand His mercy and His loving kindness, it ought to cause you to throw yourself on the altar of God and say, God, have mercy. Against thee and thee only have I sinned and done this wickedness in thy sight. And God said, He'll forgive you and He'll cleanse you. That's a wonderful promise of God's Word. You try to dance around and say, I'm not really the guilty one, I'm innocent, I'm this, I'm that. No, no, no. Just acknowledge your guilt. God already paid for it and He'll forgive. Let's pray. Father, we love You. Thank You for loving us. God, thank You for this passage of Scripture, two chapters, and we see the events and we can look at the account historically. God, I pray for each of us tonight to make some application in our lives. God, I'm not sure tonight how You're working in the hearts of Your people, but God, I pray that You'd have Your will and way. I pray that we'd be humble. Lord, I pray that if there's sin in our lives, that we'd confess it and forsake it. God, if someone's trying to cover, hide their sin, I pray, God, that You would help them to understand the futility of that endeavor. They just wave the white flag of surrender and get their heart right with You. I pray that in these moments of invitation that You'd have Your will and way. We'll thank You for it. Would You stand with me?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.6600000858306885,
      "text": " Chapter 43 and 44, you say, pastor,"
    },
    {
      "id": 1,
      "start": 2.6600000858306885,
      "end": 5.579999923706055,
      "text": " you're gonna deal with 68 verses tonight."
    },
    {
      "id": 2,
      "start": 5.579999923706055,
      "end": 7.260000228881836,
      "text": " Yes, I am."
    },
    {
      "id": 3,
      "start": 7.260000228881836,
      "end": 11.5,
      "text": " And last Sunday night, we were here until 12.30 a.m."
    },
    {
      "id": 4,
      "start": 11.5,
      "end": 13.739999771118164,
      "text": " And so we are in good shape."
    },
    {
      "id": 5,
      "start": 13.739999771118164,
      "end": 15.920000076293945,
      "text": " It is 6.18, amen."
    },
    {
      "id": 6,
      "start": 15.920000076293945,
      "end": 20.040000915527344,
      "text": " And I got plenty of time to get through 68 verses."
    },
    {
      "id": 7,
      "start": 20.040000915527344,
      "end": 22.020000457763672,
      "text": " And some of you say, I am leaving."
    },
    {
      "id": 8,
      "start": 22.020000457763672,
      "end": 24.440000534057617,
      "text": " I am not going to endure that."
    },
    {
      "id": 9,
      "start": 24.440000534057617,
      "end": 26.6200008392334,
      "text": " In all seriousness, with God's help,"
    },
    {
      "id": 10,
      "start": 26.6200008392334,
      "end": 29.15999984741211,
      "text": " we will make it through these verses"
    },
    {
      "id": 11,
      "start": 29.15999984741211,
      "end": 31.719999313354492,
      "text": " in a timely manner this evening."
    },
    {
      "id": 12,
      "start": 31.719999313354492,
      "end": 33.959999084472656,
      "text": " And in Genesis chapter number 42,"
    },
    {
      "id": 13,
      "start": 33.959999084472656,
      "end": 35.5,
      "text": " we studied several weeks ago."
    },
    {
      "id": 14,
      "start": 35.5,
      "end": 37.560001373291016,
      "text": " There's been a number of Sunday evenings"
    },
    {
      "id": 15,
      "start": 37.560001373291016,
      "end": 39.880001068115234,
      "text": " between our last study in the book of Genesis"
    },
    {
      "id": 16,
      "start": 39.880001068115234,
      "end": 41.220001220703125,
      "text": " and this evening."
    },
    {
      "id": 17,
      "start": 41.220001220703125,
      "end": 43.36000061035156,
      "text": " And we had Christmas Eve service"
    },
    {
      "id": 18,
      "start": 43.36000061035156,
      "end": 47.52000045776367,
      "text": " and we had our Christmas lunch with an afternoon service."
    },
    {
      "id": 19,
      "start": 47.52000045776367,
      "end": 48.84000015258789,
      "text": " And then we had New Year's Eve service."
    },
    {
      "id": 20,
      "start": 48.84000015258789,
      "end": 50.36000061035156,
      "text": " So it's been almost a month"
    },
    {
      "id": 21,
      "start": 50.36000061035156,
      "end": 53.560001373291016,
      "text": " since we've been in the book of Genesis on Sunday evening."
    },
    {
      "id": 22,
      "start": 53.58000183105469,
      "end": 55.58000183105469,
      "text": " But very quickly to remind us"
    },
    {
      "id": 23,
      "start": 55.58000183105469,
      "end": 58.18000030517578,
      "text": " of what happened in Genesis 42,"
    },
    {
      "id": 24,
      "start": 58.18000030517578,
      "end": 60.380001068115234,
      "text": " it was in that portion of scripture"
    },
    {
      "id": 25,
      "start": 60.380001068115234,
      "end": 65.37999725341797,
      "text": " where Joseph's brothers went to Egypt the first time."
    },
    {
      "id": 26,
      "start": 65.41999816894531,
      "end": 68.26000213623047,
      "text": " And as we studied through Genesis chapter number 42,"
    },
    {
      "id": 27,
      "start": 68.26000213623047,
      "end": 71.18000030517578,
      "text": " we talked about how God is at work."
    },
    {
      "id": 28,
      "start": 71.18000030517578,
      "end": 73.9000015258789,
      "text": " And we talked about God working locally"
    },
    {
      "id": 29,
      "start": 73.9000015258789,
      "end": 75.94000244140625,
      "text": " and God working globally."
    },
    {
      "id": 30,
      "start": 75.94000244140625,
      "end": 77.83999633789062,
      "text": " But we really, we spent just a few minutes"
    },
    {
      "id": 31,
      "start": 77.83999633789062,
      "end": 78.94000244140625,
      "text": " on each of those thoughts,"
    },
    {
      "id": 32,
      "start": 78.94000244140625,
      "end": 80.66000366210938,
      "text": " really combined just a few minutes."
    },
    {
      "id": 33,
      "start": 80.66000366210938,
      "end": 82.76000213623047,
      "text": " And we focused on the entirety"
    },
    {
      "id": 34,
      "start": 82.77999877929688,
      "end": 86.37999725341797,
      "text": " of really the message how God was working personally."
    },
    {
      "id": 35,
      "start": 86.37999725341797,
      "end": 88.18000030517578,
      "text": " And I'm thankful that we serve a God"
    },
    {
      "id": 36,
      "start": 88.18000030517578,
      "end": 90.37999725341797,
      "text": " who is the God of the universe."
    },
    {
      "id": 37,
      "start": 90.37999725341797,
      "end": 93.4000015258789,
      "text": " I'm thankful that he is the creator"
    },
    {
      "id": 38,
      "start": 93.4000015258789,
      "end": 94.95999908447266,
      "text": " and sustainer of all things,"
    },
    {
      "id": 39,
      "start": 94.95999908447266,
      "end": 97.77999877929688,
      "text": " but he is a personal God."
    },
    {
      "id": 40,
      "start": 97.77999877929688,
      "end": 101.0999984741211,
      "text": " And he deals with individuals and he knows us."
    },
    {
      "id": 41,
      "start": 101.0999984741211,
      "end": 102.5199966430664,
      "text": " He knows all about us."
    },
    {
      "id": 42,
      "start": 102.5199966430664,
      "end": 103.66000366210938,
      "text": " He knows your thoughts."
    },
    {
      "id": 43,
      "start": 103.66000366210938,
      "end": 106.94000244140625,
      "text": " He knows everything about you."
    },
    {
      "id": 44,
      "start": 106.94000244140625,
      "end": 111.63999938964844,
      "text": " And he loves you and he pursues you and he's working."
    },
    {
      "id": 45,
      "start": 111.66000366210938,
      "end": 115.37999725341797,
      "text": " And we focused on how God was working personally."
    },
    {
      "id": 46,
      "start": 115.37999725341797,
      "end": 117.45999908447266,
      "text": " We really focused on God's work"
    },
    {
      "id": 47,
      "start": 117.45999908447266,
      "end": 119.9800033569336,
      "text": " in the lives of Joseph's brothers."
    },
    {
      "id": 48,
      "start": 119.9800033569336,
      "end": 122.77999877929688,
      "text": " We had understood as you look at Genesis 42"
    },
    {
      "id": 49,
      "start": 122.77999877929688,
      "end": 125.18000030517578,
      "text": " and look at the next several chapters"
    },
    {
      "id": 50,
      "start": 125.18000030517578,
      "end": 128.3000030517578,
      "text": " that really it had been at least 20 years"
    },
    {
      "id": 51,
      "start": 128.3000030517578,
      "end": 131.3800048828125,
      "text": " since Joseph had last seen his brothers."
    },
    {
      "id": 52,
      "start": 131.3800048828125,
      "end": 132.97999572753906,
      "text": " In that period of time, of course,"
    },
    {
      "id": 53,
      "start": 132.97999572753906,
      "end": 135.5399932861328,
      "text": " there were a lot of changes in Joseph's life."
    },
    {
      "id": 54,
      "start": 135.5399932861328,
      "end": 137.6999969482422,
      "text": " And no doubt there were a number of changes there"
    },
    {
      "id": 55,
      "start": 137.6999969482422,
      "end": 140.17999267578125,
      "text": " in the lives of his brothers as well."
    },
    {
      "id": 56,
      "start": 140.17999267578125,
      "end": 143.72000122070312,
      "text": " But they were holding on to something that they knew"
    },
    {
      "id": 57,
      "start": 143.72000122070312,
      "end": 145.83999633789062,
      "text": " that they really didn't share with anyone."
    },
    {
      "id": 58,
      "start": 145.83999633789062,
      "end": 148.1199951171875,
      "text": " They knew what they did to Joseph."
    },
    {
      "id": 59,
      "start": 148.1199951171875,
      "end": 151.22000122070312,
      "text": " They knew all that had transpired,"
    },
    {
      "id": 60,
      "start": 151.22000122070312,
      "end": 153.74000549316406,
      "text": " but of course they allowed dad to believe"
    },
    {
      "id": 61,
      "start": 153.74000549316406,
      "end": 156.36000061035156,
      "text": " that some evil beast hath devoured him."
    },
    {
      "id": 62,
      "start": 156.36000061035156,
      "end": 157.67999267578125,
      "text": " And for all those years,"
    },
    {
      "id": 63,
      "start": 157.67999267578125,
      "end": 161.47999572753906,
      "text": " Jacob lived thinking that Joseph was dead."
    },
    {
      "id": 64,
      "start": 161.47999572753906,
      "end": 163.9600067138672,
      "text": " And really the brothers almost were able"
    },
    {
      "id": 65,
      "start": 163.9600067138672,
      "end": 168.13999938964844,
      "text": " to try to console themselves in a certain way"
    },
    {
      "id": 66,
      "start": 168.13999938964844,
      "end": 169.60000610351562,
      "text": " by saying one is not."
    },
    {
      "id": 67,
      "start": 169.6199951171875,
      "end": 172.3800048828125,
      "text": " That's how they continually referred to Joseph"
    },
    {
      "id": 68,
      "start": 172.3800048828125,
      "end": 173.97999572753906,
      "text": " as one is not."
    },
    {
      "id": 69,
      "start": 173.97999572753906,
      "end": 175.39999389648438,
      "text": " And we find they come to Egypt."
    },
    {
      "id": 70,
      "start": 175.39999389648438,
      "end": 177.6199951171875,
      "text": " They have no idea that Joseph"
    },
    {
      "id": 71,
      "start": 177.6199951171875,
      "end": 179.24000549316406,
      "text": " is the prime minister of Egypt,"
    },
    {
      "id": 72,
      "start": 179.24000549316406,
      "end": 181.5399932861328,
      "text": " that he's the one before whom they stand."
    },
    {
      "id": 73,
      "start": 181.5399932861328,
      "end": 184.1199951171875,
      "text": " But Joseph knows their identity."
    },
    {
      "id": 74,
      "start": 184.1199951171875,
      "end": 185.6199951171875,
      "text": " He knows who they are."
    },
    {
      "id": 75,
      "start": 185.6199951171875,
      "end": 188.3800048828125,
      "text": " And we find that as God is working personally"
    },
    {
      "id": 76,
      "start": 188.3800048828125,
      "end": 191.6199951171875,
      "text": " in the lives of these boys, of these brethren,"
    },
    {
      "id": 77,
      "start": 191.6199951171875,
      "end": 194.32000732421875,
      "text": " I say boys, but really they're men."
    },
    {
      "id": 78,
      "start": 194.32000732421875,
      "end": 197.16000366210938,
      "text": " We find that God is working"
    },
    {
      "id": 79,
      "start": 197.17999267578125,
      "end": 201.4199981689453,
      "text": " and their experience in Egypt reminded them"
    },
    {
      "id": 80,
      "start": 201.4199981689453,
      "end": 204.5800018310547,
      "text": " of the last encounter that they had with their brother"
    },
    {
      "id": 81,
      "start": 204.5800018310547,
      "end": 207.4199981689453,
      "text": " and God was convicting them."
    },
    {
      "id": 82,
      "start": 207.4199981689453,
      "end": 209.4199981689453,
      "text": " God was pursuing them."
    },
    {
      "id": 83,
      "start": 209.4199981689453,
      "end": 213.16000366210938,
      "text": " We find if you would quickly look at Genesis 42 in verse 21,"
    },
    {
      "id": 84,
      "start": 213.16000366210938,
      "end": 216.5399932861328,
      "text": " notice what they say in this verse of scripture."
    },
    {
      "id": 85,
      "start": 216.5399932861328,
      "end": 217.86000061035156,
      "text": " They say one to another,"
    },
    {
      "id": 86,
      "start": 217.86000061035156,
      "end": 221.77999877929688,
      "text": " we are verily guilty concerning our brother"
    },
    {
      "id": 87,
      "start": 221.77999877929688,
      "end": 225.02000427246094,
      "text": " in that we saw the anguish of his soul"
    },
    {
      "id": 88,
      "start": 225.02000427246094,
      "end": 228.0800018310547,
      "text": " when he besought us and we would not hear."
    },
    {
      "id": 89,
      "start": 228.0800018310547,
      "end": 233.0800018310547,
      "text": " Notice therefore is this distress come upon us."
    },
    {
      "id": 90,
      "start": 233.77999877929688,
      "end": 234.75999450683594,
      "text": " God was working."
    },
    {
      "id": 91,
      "start": 234.75999450683594,
      "end": 237.8800048828125,
      "text": " I mean, God was zeroing directly in"
    },
    {
      "id": 92,
      "start": 237.8800048828125,
      "end": 241.75999450683594,
      "text": " and the lives of these men, of these brothers of Joseph,"
    },
    {
      "id": 93,
      "start": 241.75999450683594,
      "end": 245.72000122070312,
      "text": " that event that had taken place over 20 years earlier,"
    },
    {
      "id": 94,
      "start": 245.72000122070312,
      "end": 246.94000244140625,
      "text": " they were convicted."
    },
    {
      "id": 95,
      "start": 246.94000244140625,
      "end": 248.82000732421875,
      "text": " They had guilt and they say,"
    },
    {
      "id": 96,
      "start": 248.82000732421875,
      "end": 252.3800048828125,
      "text": " this is the reason that we're dealing with this situation."
    },
    {
      "id": 97,
      "start": 252.3800048828125,
      "end": 254.55999755859375,
      "text": " In verse 28 of Genesis 42,"
    },
    {
      "id": 98,
      "start": 255.05999755859375,
      "end": 256.5,
      "text": " the Bible says that he said unto his brethren,"
    },
    {
      "id": 99,
      "start": 256.5,
      "end": 260.17999267578125,
      "text": " my money is restored and lo it is even in my sack"
    },
    {
      "id": 100,
      "start": 260.17999267578125,
      "end": 263.2200012207031,
      "text": " and their heart failed them and they were afraid."
    },
    {
      "id": 101,
      "start": 263.2200012207031,
      "end": 264.8800048828125,
      "text": " Notice they said one to another,"
    },
    {
      "id": 102,
      "start": 264.8800048828125,
      "end": 269.3399963378906,
      "text": " what is this that God hath done unto us?"
    },
    {
      "id": 103,
      "start": 269.3399963378906,
      "end": 272.6199951171875,
      "text": " They get home and they begin to recurse all"
    },
    {
      "id": 104,
      "start": 272.6199951171875,
      "end": 275.05999755859375,
      "text": " that had transpired on this first trip"
    },
    {
      "id": 105,
      "start": 275.05999755859375,
      "end": 276.70001220703125,
      "text": " to Jacob their father"
    },
    {
      "id": 106,
      "start": 276.70001220703125,
      "end": 278.9800109863281,
      "text": " and they let Jacob know what's going on."
    },
    {
      "id": 107,
      "start": 278.9800109863281,
      "end": 281.0,
      "text": " The Bible says that they had fear,"
    },
    {
      "id": 108,
      "start": 281.0,
      "end": 282.94000244140625,
      "text": " even as they mentioned in verse 28"
    },
    {
      "id": 109,
      "start": 282.9599914550781,
      "end": 285.760009765625,
      "text": " and they recognized that God was working."
    },
    {
      "id": 110,
      "start": 285.760009765625,
      "end": 289.239990234375,
      "text": " Now, I do not know, I cannot tell you definitively"
    },
    {
      "id": 111,
      "start": 289.239990234375,
      "end": 292.760009765625,
      "text": " how much time passed between the first trip to Egypt"
    },
    {
      "id": 112,
      "start": 292.760009765625,
      "end": 294.5400085449219,
      "text": " and the second trip to Egypt"
    },
    {
      "id": 113,
      "start": 294.5400085449219,
      "end": 295.760009765625,
      "text": " that we're gonna study this evening."
    },
    {
      "id": 114,
      "start": 295.760009765625,
      "end": 297.7200012207031,
      "text": " In chapters 43 and 44,"
    },
    {
      "id": 115,
      "start": 297.7200012207031,
      "end": 301.5199890136719,
      "text": " we have the opportunity to read of the second trip"
    },
    {
      "id": 116,
      "start": 301.5199890136719,
      "end": 305.2799987792969,
      "text": " that these brothers take to Egypt."
    },
    {
      "id": 117,
      "start": 305.2799987792969,
      "end": 306.8399963378906,
      "text": " We do not know the period of time."
    },
    {
      "id": 118,
      "start": 306.8399963378906,
      "end": 310.0400085449219,
      "text": " However, what we know is we try to consolidate"
    },
    {
      "id": 119,
      "start": 310.0400085449219,
      "end": 313.05999755859375,
      "text": " and figure out exactly what's taking place"
    },
    {
      "id": 120,
      "start": 313.05999755859375,
      "end": 316.4800109863281,
      "text": " that the Bible tells us at the end of chapter 41"
    },
    {
      "id": 121,
      "start": 316.4800109863281,
      "end": 319.9599914550781,
      "text": " that the seven years of dearth began to come."
    },
    {
      "id": 122,
      "start": 319.9599914550781,
      "end": 322.0799865722656,
      "text": " So there were seven years of great plenty,"
    },
    {
      "id": 123,
      "start": 322.0799865722656,
      "end": 325.9200134277344,
      "text": " the seven years of great dearth or great famine started."
    },
    {
      "id": 124,
      "start": 325.9200134277344,
      "end": 330.5199890136719,
      "text": " And we said this last time that the famine was so intense"
    },
    {
      "id": 125,
      "start": 330.5199890136719,
      "end": 333.9200134277344,
      "text": " and so severe that it had an immediate impact."
    },
    {
      "id": 126,
      "start": 333.9200134277344,
      "end": 336.7200012207031,
      "text": " I mean, all the world, the known world comes to Egypt"
    },
    {
      "id": 127,
      "start": 336.7200012207031,
      "end": 338.8399963378906,
      "text": " to buy food because there's no food."
    },
    {
      "id": 128,
      "start": 338.8399963378906,
      "end": 340.3999938964844,
      "text": " This is a sore famine."
    },
    {
      "id": 129,
      "start": 340.3999938964844,
      "end": 341.82000732421875,
      "text": " It is a great famine."
    },
    {
      "id": 130,
      "start": 341.82000732421875,
      "end": 345.8800048828125,
      "text": " We know that in chapter number 45 of the book of Genesis"
    },
    {
      "id": 131,
      "start": 345.8800048828125,
      "end": 349.4800109863281,
      "text": " that Joseph reveals his identity to his brothers."
    },
    {
      "id": 132,
      "start": 349.4800109863281,
      "end": 351.7200012207031,
      "text": " Now that's gonna be saved for next Sunday night."
    },
    {
      "id": 133,
      "start": 351.7200012207031,
      "end": 354.6400146484375,
      "text": " We'll deal with that in chapter 45 next week."
    },
    {
      "id": 134,
      "start": 354.6400146484375,
      "end": 358.1199951171875,
      "text": " But I do want to know that in the time,"
    },
    {
      "id": 135,
      "start": 358.1199951171875,
      "end": 362.55999755859375,
      "text": " in that circumstance when Joseph is revealing his identity,"
    },
    {
      "id": 136,
      "start": 362.55999755859375,
      "end": 365.20001220703125,
      "text": " he says in Genesis 45 in verse number six,"
    },
    {
      "id": 137,
      "start": 365.2799987792969,
      "end": 370.1199951171875,
      "text": " for these two years hath the famine been in the land."
    },
    {
      "id": 138,
      "start": 370.1199951171875,
      "end": 373.8999938964844,
      "text": " So we know that the famine started at the end of chapter 41."
    },
    {
      "id": 139,
      "start": 373.8999938964844,
      "end": 377.4800109863281,
      "text": " We know that in chapter 45 when Joseph reveals his identity"
    },
    {
      "id": 140,
      "start": 377.4800109863281,
      "end": 380.6000061035156,
      "text": " that there's two years into the famine,"
    },
    {
      "id": 141,
      "start": 380.6000061035156,
      "end": 382.8399963378906,
      "text": " which is going to be seven years long."
    },
    {
      "id": 142,
      "start": 382.8399963378906,
      "end": 385.5199890136719,
      "text": " And so these two trips happen"
    },
    {
      "id": 143,
      "start": 385.5199890136719,
      "end": 388.760009765625,
      "text": " within those first couple of years of the famine."
    },
    {
      "id": 144,
      "start": 388.760009765625,
      "end": 391.55999755859375,
      "text": " And we find that as they return back,"
    },
    {
      "id": 145,
      "start": 391.55999755859375,
      "end": 393.6000061035156,
      "text": " the brothers, all but Simeon,"
    },
    {
      "id": 146,
      "start": 393.6000061035156,
      "end": 397.3999938964844,
      "text": " remember Simeon was apprehended and he stays in Egypt."
    },
    {
      "id": 147,
      "start": 397.3999938964844,
      "end": 398.760009765625,
      "text": " He's imprisoned there."
    },
    {
      "id": 148,
      "start": 398.760009765625,
      "end": 400.760009765625,
      "text": " And we find that all the boys return home"
    },
    {
      "id": 149,
      "start": 400.760009765625,
      "end": 402.8399963378906,
      "text": " with provision for the family."
    },
    {
      "id": 150,
      "start": 404.1600036621094,
      "end": 407.17999267578125,
      "text": " But soon, because of the great famine,"
    },
    {
      "id": 151,
      "start": 407.17999267578125,
      "end": 409.44000244140625,
      "text": " that provision would be gone."
    },
    {
      "id": 152,
      "start": 409.44000244140625,
      "end": 413.5400085449219,
      "text": " And there would be need to go back to Egypt."
    },
    {
      "id": 153,
      "start": 413.5400085449219,
      "end": 415.29998779296875,
      "text": " But the brothers understood."
    },
    {
      "id": 154,
      "start": 415.29998779296875,
      "end": 418.1199951171875,
      "text": " I think that in the time that transpired"
    },
    {
      "id": 155,
      "start": 418.1199951171875,
      "end": 420.6000061035156,
      "text": " between their return from Egypt"
    },
    {
      "id": 156,
      "start": 420.6000061035156,
      "end": 422.3999938964844,
      "text": " and then going back to Egypt,"
    },
    {
      "id": 157,
      "start": 422.3999938964844,
      "end": 424.7200012207031,
      "text": " they didn't forget what happened in Egypt."
    },
    {
      "id": 158,
      "start": 424.7200012207031,
      "end": 427.6000061035156,
      "text": " They didn't forget what was going on"
    },
    {
      "id": 159,
      "start": 427.6000061035156,
      "end": 429.7200012207031,
      "text": " and how God was convicting them."
    },
    {
      "id": 160,
      "start": 429.7200012207031,
      "end": 431.1600036621094,
      "text": " And they were aware of that."
    },
    {
      "id": 161,
      "start": 431.1600036621094,
      "end": 433.2799987792969,
      "text": " So we come to chapter 43,"
    },
    {
      "id": 162,
      "start": 433.2799987792969,
      "end": 434.8800048828125,
      "text": " and the Bible says in verse number one,"
    },
    {
      "id": 163,
      "start": 434.8800048828125,
      "end": 437.7200012207031,
      "text": " and the famine was sore in the land."
    },
    {
      "id": 164,
      "start": 437.7200012207031,
      "end": 439.1199951171875,
      "text": " And it came to pass, verse two,"
    },
    {
      "id": 165,
      "start": 439.1199951171875,
      "end": 440.8399963378906,
      "text": " when they had eaten up the corn,"
    },
    {
      "id": 166,
      "start": 440.8399963378906,
      "end": 442.3399963378906,
      "text": " which they had brought out of Egypt,"
    },
    {
      "id": 167,
      "start": 442.3399963378906,
      "end": 443.44000244140625,
      "text": " their father said unto them,"
    },
    {
      "id": 168,
      "start": 443.44000244140625,
      "end": 447.760009765625,
      "text": " go again, buy us a little food."
    },
    {
      "id": 169,
      "start": 447.760009765625,
      "end": 449.55999755859375,
      "text": " As we look at this portion of scripture"
    },
    {
      "id": 170,
      "start": 449.55999755859375,
      "end": 453.55999755859375,
      "text": " and we continue to see how God is continuing to work"
    },
    {
      "id": 171,
      "start": 453.55999755859375,
      "end": 457.55999755859375,
      "text": " in the hearts and lives of these brethren of Joseph,"
    },
    {
      "id": 172,
      "start": 457.55999755859375,
      "end": 459.79998779296875,
      "text": " we find tonight really three thoughts."
    },
    {
      "id": 173,
      "start": 459.79998779296875,
      "end": 463.5199890136719,
      "text": " And we're gonna focus mainly on chapter 44 this evening."
    },
    {
      "id": 174,
      "start": 463.5199890136719,
      "end": 467.239990234375,
      "text": " We'll get through chapter 43 and get to chapter 44"
    },
    {
      "id": 175,
      "start": 467.239990234375,
      "end": 470.67999267578125,
      "text": " to look at how God is dealing with these boys."
    },
    {
      "id": 176,
      "start": 470.67999267578125,
      "end": 472.4800109863281,
      "text": " Let me say this, in chapter 44,"
    },
    {
      "id": 177,
      "start": 472.4800109863281,
      "end": 473.8800048828125,
      "text": " at the end of verse number 12,"
    },
    {
      "id": 178,
      "start": 473.8800048828125,
      "end": 477.20001220703125,
      "text": " the Bible says in the cup was found in Benjamin's sack."
    },
    {
      "id": 179,
      "start": 477.20001220703125,
      "end": 479.260009765625,
      "text": " That's what I've titled the message this evening."
    },
    {
      "id": 180,
      "start": 479.9599914550781,
      "end": 481.70001220703125,
      "text": " You've probably seen it on the back of the bulletin already,"
    },
    {
      "id": 181,
      "start": 481.70001220703125,
      "end": 485.739990234375,
      "text": " but the cup was found in Benjamin's sack."
    },
    {
      "id": 182,
      "start": 485.739990234375,
      "end": 487.760009765625,
      "text": " Notice in chapter 43, if you're taking notes,"
    },
    {
      "id": 183,
      "start": 487.760009765625,
      "end": 489.7799987792969,
      "text": " number one, we notice the famine."
    },
    {
      "id": 184,
      "start": 489.7799987792969,
      "end": 490.6199951171875,
      "text": " We notice the famine."
    },
    {
      "id": 185,
      "start": 490.6199951171875,
      "end": 491.4599914550781,
      "text": " The famine continues."
    },
    {
      "id": 186,
      "start": 491.4599914550781,
      "end": 494.1400146484375,
      "text": " We know, as we've studied through the life of Joseph,"
    },
    {
      "id": 187,
      "start": 494.1400146484375,
      "end": 497.1400146484375,
      "text": " that Joseph was aware after the dream of Pharaoh"
    },
    {
      "id": 188,
      "start": 497.1400146484375,
      "end": 498.9800109863281,
      "text": " that there would be seven years of great plenty,"
    },
    {
      "id": 189,
      "start": 498.9800109863281,
      "end": 501.32000732421875,
      "text": " and then there would be seven years of great famine."
    },
    {
      "id": 190,
      "start": 501.32000732421875,
      "end": 505.3399963378906,
      "text": " And so we understand as we enter into the text of scripture"
    },
    {
      "id": 191,
      "start": 505.3399963378906,
      "end": 507.6199951171875,
      "text": " how God is working and what God is doing"
    },
    {
      "id": 192,
      "start": 507.6199951171875,
      "end": 510.260009765625,
      "text": " and how God was working there in Egypt"
    },
    {
      "id": 193,
      "start": 510.260009765625,
      "end": 512.3400268554688,
      "text": " and God had given Pharaoh that dream"
    },
    {
      "id": 194,
      "start": 512.3400268554688,
      "end": 514.780029296875,
      "text": " and allowed Joseph to interpret the dream,"
    },
    {
      "id": 195,
      "start": 514.780029296875,
      "end": 516.3400268554688,
      "text": " not only to interpret the dream,"
    },
    {
      "id": 196,
      "start": 516.3400268554688,
      "end": 520.0,
      "text": " but to have the wisdom to put a plan in place"
    },
    {
      "id": 197,
      "start": 520.0,
      "end": 523.7000122070312,
      "text": " that would enable not only the Egyptians to be sustained,"
    },
    {
      "id": 198,
      "start": 523.7000122070312,
      "end": 525.8200073242188,
      "text": " but really all the world to be sustained."
    },
    {
      "id": 199,
      "start": 525.8200073242188,
      "end": 527.5399780273438,
      "text": " And we find that God was working"
    },
    {
      "id": 200,
      "start": 527.5399780273438,
      "end": 529.5399780273438,
      "text": " and God had given much wisdom."
    },
    {
      "id": 201,
      "start": 529.5399780273438,
      "end": 532.780029296875,
      "text": " And by the way, I'm thankful that that God is my God,"
    },
    {
      "id": 202,
      "start": 532.780029296875,
      "end": 536.260009765625,
      "text": " that he's my savior, and that he gives us wisdom."
    },
    {
      "id": 203,
      "start": 536.260009765625,
      "end": 539.3800048828125,
      "text": " He said, if any man lack, let him ask of God,"
    },
    {
      "id": 204,
      "start": 539.3800048828125,
      "end": 541.5800170898438,
      "text": " who giveth all men liberally and upbraideth not."
    },
    {
      "id": 205,
      "start": 541.5800170898438,
      "end": 543.5800170898438,
      "text": " Listen, that's a wonderful promise of God's word"
    },
    {
      "id": 206,
      "start": 543.5800170898438,
      "end": 545.0599975585938,
      "text": " from James chapter number one,"
    },
    {
      "id": 207,
      "start": 545.0599975585938,
      "end": 547.3800048828125,
      "text": " because the reality is that in each of our lives,"
    },
    {
      "id": 208,
      "start": 547.3800048828125,
      "end": 548.6799926757812,
      "text": " we lack wisdom."
    },
    {
      "id": 209,
      "start": 549.8400268554688,
      "end": 551.739990234375,
      "text": " Sometimes we continue to lack wisdom"
    },
    {
      "id": 210,
      "start": 551.739990234375,
      "end": 553.7000122070312,
      "text": " because we don't acknowledge that we lack wisdom"
    },
    {
      "id": 211,
      "start": 553.7000122070312,
      "end": 555.2999877929688,
      "text": " and we never ask God."
    },
    {
      "id": 212,
      "start": 557.1799926757812,
      "end": 559.3800048828125,
      "text": " But God, he's the all-wise God."
    },
    {
      "id": 213,
      "start": 559.3800048828125,
      "end": 561.5,
      "text": " And he gives Joseph great wisdom."
    },
    {
      "id": 214,
      "start": 561.5,
      "end": 564.02001953125,
      "text": " And we find that as we enter into the 43rd chapter,"
    },
    {
      "id": 215,
      "start": 564.02001953125,
      "end": 565.97998046875,
      "text": " we know that the famine's gonna continue."
    },
    {
      "id": 216,
      "start": 566.7000122070312,
      "end": 570.0999755859375,
      "text": " We know that it's gonna be great, grave consequences."
    },
    {
      "id": 217,
      "start": 570.0999755859375,
      "end": 572.3400268554688,
      "text": " And we understand that the sustenance,"
    },
    {
      "id": 218,
      "start": 572.3400268554688,
      "end": 574.9400024414062,
      "text": " the provision that was brought back in chapter 42,"
    },
    {
      "id": 219,
      "start": 574.9400024414062,
      "end": 577.9400024414062,
      "text": " it's not gonna last the entire time of the famine."
    },
    {
      "id": 220,
      "start": 577.9400024414062,
      "end": 579.3400268554688,
      "text": " What are they gonna do with the provision?"
    },
    {
      "id": 221,
      "start": 579.3400268554688,
      "end": 580.5800170898438,
      "text": " They're gonna eat it."
    },
    {
      "id": 222,
      "start": 581.4600219726562,
      "end": 583.1199951171875,
      "text": " How many times you go to the grocery store?"
    },
    {
      "id": 223,
      "start": 583.1199951171875,
      "end": 586.219970703125,
      "text": " We asked Ms. Deanna, she goes every other day, amen."
    },
    {
      "id": 224,
      "start": 586.219970703125,
      "end": 588.1400146484375,
      "text": " But just joking, and you find, listen,"
    },
    {
      "id": 225,
      "start": 588.1400146484375,
      "end": 590.5800170898438,
      "text": " the provision, you only have enough"
    },
    {
      "id": 226,
      "start": 590.5800170898438,
      "end": 592.780029296875,
      "text": " to sustain you for a period of time."
    },
    {
      "id": 227,
      "start": 593.7000122070312,
      "end": 596.219970703125,
      "text": " And the Bible says in verse number two,"
    },
    {
      "id": 228,
      "start": 596.219970703125,
      "end": 599.4199829101562,
      "text": " that they had eaten up the corn,"
    },
    {
      "id": 229,
      "start": 599.4199829101562,
      "end": 600.8200073242188,
      "text": " which they had brought back."
    },
    {
      "id": 0,
      "start": 600.8200073242188,
      "end": 608.5400071144104,
      "text": " out of Egypt. So what does Jacob say? Go again, buy us a little food. It just makes"
    },
    {
      "id": 1,
      "start": 608.5400071144104,
      "end": 613.260006904602,
      "text": " sense, does it not? I mean, there's one place that they're gonna get food, and"
    },
    {
      "id": 2,
      "start": 613.260006904602,
      "end": 618.5400066375732,
      "text": " they need food to survive, and so the instruction is given, understand that as"
    },
    {
      "id": 3,
      "start": 618.5400066375732,
      "end": 621.8600082397461,
      "text": " we look here at this text of Scripture and we note the famine, that it was sore"
    },
    {
      "id": 4,
      "start": 621.8600082397461,
      "end": 626.2600078582764,
      "text": " in the land. They needed food, but the expectation was known. The brothers knew."
    },
    {
      "id": 5,
      "start": 626.2600078582764,
      "end": 633.8200073242188,
      "text": " In fact, Jacob knew that the only way, the prime minister, they don't know that"
    },
    {
      "id": 6,
      "start": 633.8200073242188,
      "end": 638.2200088500977,
      "text": " it's Joseph, the only way that Joseph will entertain them again is if Benjamin"
    },
    {
      "id": 7,
      "start": 638.2200088500977,
      "end": 644.5400085449219,
      "text": " comes. Now Jacob is completely opposed to the idea of Benjamin going. Why? Joseph, in"
    },
    {
      "id": 8,
      "start": 644.5400085449219,
      "end": 650.580005645752,
      "text": " his mind, is dead, and now I'm gonna lose Benjamin as well. And so we find that in"
    },
    {
      "id": 9,
      "start": 650.580005645752,
      "end": 654.3800086975098,
      "text": " verse number 3, Judah speaks up. In fact, over the next two chapters as we study"
    },
    {
      "id": 10,
      "start": 654.3800086975098,
      "end": 657.9400062561035,
      "text": " through these chapters this evening, we'll see that Judah seemingly is the"
    },
    {
      "id": 11,
      "start": 657.9400062561035,
      "end": 661.7400054931641,
      "text": " spokesman for the group of brothers. He's speaking to him saying, here's what he"
    },
    {
      "id": 12,
      "start": 661.7400054931641,
      "end": 666.9400100708008,
      "text": " says to his dad, the man did solemnly protest unto us saying, ye shall not see"
    },
    {
      "id": 13,
      "start": 666.9400100708008,
      "end": 671.3800048828125,
      "text": " my face except your brother be with you. Now we won't take time to read all of it,"
    },
    {
      "id": 14,
      "start": 671.3800048828125,
      "end": 675.7000045776367,
      "text": " but really Jacob has this thought of, why did you tell him you had a brother? And"
    },
    {
      "id": 15,
      "start": 675.7000045776367,
      "end": 681.5400085449219,
      "text": " the reality is that the brothers, they had no idea that when Joseph was asking"
    },
    {
      "id": 16,
      "start": 681.5400085449219,
      "end": 685.140007019043,
      "text": " the questions, when he says you're spies and you've come to spy out the land, and"
    },
    {
      "id": 17,
      "start": 685.140007019043,
      "end": 689.2200088500977,
      "text": " he asked about the welfare and the father and so on and so forth, they have"
    },
    {
      "id": 18,
      "start": 689.2200088500977,
      "end": 695.0200042724609,
      "text": " no idea the reasoning of the questions and what it's going to lead to. They"
    },
    {
      "id": 19,
      "start": 695.0200042724609,
      "end": 699.7000045776367,
      "text": " could not know that Joseph, the prime minister of Egypt, would say Benjamin"
    },
    {
      "id": 20,
      "start": 699.7000045776367,
      "end": 704.260009765625,
      "text": " must come or I will not see you. And so there's this dialogue that takes place"
    },
    {
      "id": 21,
      "start": 704.260009765625,
      "end": 709.4200057983398,
      "text": " and we find that it's pretty clear that the boys say to Jacob, listen, the only"
    },
    {
      "id": 22,
      "start": 709.5000076293945,
      "end": 714.140007019043,
      "text": " way we're going is if Benjamin comes with us. Because it's a waste of a trip"
    },
    {
      "id": 23,
      "start": 714.140007019043,
      "end": 719.8200073242188,
      "text": " for us to go if Benjamin is not with us. He made it abundantly clear, the"
    },
    {
      "id": 24,
      "start": 719.8200073242188,
      "end": 725.6200103759766,
      "text": " expectation was known and therefore we must go, but if we must go, we must"
    },
    {
      "id": 25,
      "start": 725.6200103759766,
      "end": 730.1000061035156,
      "text": " take Benjamin with us. We find that Jacob gives instruction with regard to"
    },
    {
      "id": 26,
      "start": 730.1000061035156,
      "end": 734.9400024414062,
      "text": " preparing a gift to take to the man. Again, they don't know who the man is, but"
    },
    {
      "id": 27,
      "start": 734.9400024414062,
      "end": 737.6200103759766,
      "text": " they're gonna take, and you think about the gift that it's mentioned here in"
    },
    {
      "id": 28,
      "start": 737.6200103759766,
      "end": 741.9000091552734,
      "text": " verse number 11, the Bible says, and their father Israel said unto them, if it"
    },
    {
      "id": 29,
      "start": 741.9000091552734,
      "end": 746.6600036621094,
      "text": " must be so, now do this. Take the best fruits in the land in your vessels. It is"
    },
    {
      "id": 30,
      "start": 746.6600036621094,
      "end": 752.4600067138672,
      "text": " a famine. There's like nothing. They're gonna take the very little that they can"
    },
    {
      "id": 31,
      "start": 752.4600067138672,
      "end": 757.0600128173828,
      "text": " possibly put together so that they might be able to find grace or in favor in the"
    },
    {
      "id": 32,
      "start": 757.0600128173828,
      "end": 763.0200042724609,
      "text": " in the eyes of this man that is in charge and carry down the man a present,"
    },
    {
      "id": 33,
      "start": 763.0200042724609,
      "end": 767.4600067138672,
      "text": " a little balm and a little honey, spices and myrrh, nuts and almonds, and take"
    },
    {
      "id": 34,
      "start": 767.4600067138672,
      "end": 771.7000122070312,
      "text": " notice, double money. Why double money? Well, when they got home, the first time"
    },
    {
      "id": 35,
      "start": 771.7000122070312,
      "end": 776.5400085449219,
      "text": " the money was in their sacks, and so they're trying to do everything they can."
    },
    {
      "id": 36,
      "start": 776.5400085449219,
      "end": 781.260009765625,
      "text": " Jacob is trying to do everything he can to ensure that they can get food, but I"
    },
    {
      "id": 37,
      "start": 781.260009765625,
      "end": 786.9400024414062,
      "text": " believe most importantly that Benjamin will return. That's his objective. We find"
    },
    {
      "id": 38,
      "start": 786.9400024414062,
      "end": 791.0600128173828,
      "text": " that in verse number 13, the Bible says, well let's back to verse 12 and take"
    },
    {
      "id": 39,
      "start": 791.0600128173828,
      "end": 794.0600128173828,
      "text": " double money in your hand and the money that was brought again in the mouth of"
    },
    {
      "id": 40,
      "start": 794.0600128173828,
      "end": 799.1000061035156,
      "text": " your sacks, carry it again in your hand. Peradventure, it was an oversight. Notice"
    },
    {
      "id": 41,
      "start": 799.1000061035156,
      "end": 804.1400146484375,
      "text": " verse 13, Jacob gives in. Take also your brother and arise, go again unto the man."
    },
    {
      "id": 42,
      "start": 804.1400146484375,
      "end": 810.1800079345703,
      "text": " And God Almighty give you mercy before the man. By the way, Jacob knew the Lord."
    },
    {
      "id": 43,
      "start": 810.1800079345703,
      "end": 816.3400115966797,
      "text": " He knew the the God of the universe, and he knew that God could give mercy. And he"
    },
    {
      "id": 44,
      "start": 816.3400115966797,
      "end": 821.9000091552734,
      "text": " says, God Almighty give mercy before the man that he may send you, send away your"
    },
    {
      "id": 45,
      "start": 821.9000091552734,
      "end": 827.7800140380859,
      "text": " other brother, that's Simeon and Benjamin. If I be bereaved of my children, I am"
    },
    {
      "id": 46,
      "start": 827.7800140380859,
      "end": 834.5,
      "text": " bereaved. Notice they're in a tough spot. I mean, if they don't send Benjamin,"
    },
    {
      "id": 47,
      "start": 834.5,
      "end": 839.7400054931641,
      "text": " they're just gonna die in Canaan. There's no food. There's a great famine. It's"
    },
    {
      "id": 48,
      "start": 839.7400054931641,
      "end": 846.8600006103516,
      "text": " soaring the land. They've eaten up all the food. And so they send a present, these"
    },
    {
      "id": 49,
      "start": 846.8600006103516,
      "end": 853.2200012207031,
      "text": " few things, and Benjamin. And we find that these ten brothers, they travel to"
    },
    {
      "id": 50,
      "start": 853.2200012207031,
      "end": 859.6199951171875,
      "text": " Egypt. Simeon and Joseph are in Egypt, one incarcerated, one the prime minister. And"
    },
    {
      "id": 51,
      "start": 859.6199951171875,
      "end": 864.2200012207031,
      "text": " the ten brothers travel. And so we see the famine. We see really the events or"
    },
    {
      "id": 52,
      "start": 864.2200012207031,
      "end": 868.0599975585938,
      "text": " circumstances that lead to the second trip. As we notice and continue through"
    },
    {
      "id": 53,
      "start": 868.0599975585938,
      "end": 874.8999938964844,
      "text": " chapter 43, in verses 16 through 34, notice with me the feast. The feast. It's"
    },
    {
      "id": 54,
      "start": 874.8999938964844,
      "end": 878.4600219726562,
      "text": " very interesting circumstances that take place. The Bible says in verse 15"
    },
    {
      "id": 55,
      "start": 878.4600219726562,
      "end": 882.7000122070312,
      "text": " that the men took that present. They took double money in their hand and Benjamin"
    },
    {
      "id": 56,
      "start": 882.7000122070312,
      "end": 886.3399963378906,
      "text": " and rose up and went down to Egypt and stood before Joseph. So they go. They know"
    },
    {
      "id": 57,
      "start": 886.3399963378906,
      "end": 891.7799987792969,
      "text": " the process. They've been there once before. They know what they're to do and"
    },
    {
      "id": 58,
      "start": 891.7799987792969,
      "end": 896.3800048828125,
      "text": " they stand before Joseph. And notice the Bible says in verse 16 that Joseph saw"
    },
    {
      "id": 59,
      "start": 896.3800048828125,
      "end": 900.9400024414062,
      "text": " Benjamin with them. He said to the ruler of the house, of his house, bring these"
    },
    {
      "id": 60,
      "start": 900.9400024414062,
      "end": 907.1000061035156,
      "text": " men home and slay and make ready for these men shall dine with me at noon."
    },
    {
      "id": 61,
      "start": 907.1000061035156,
      "end": 912.2200012207031,
      "text": " And the man, it says in verse 17, did as Joseph bade. Joseph had great power. And"
    },
    {
      "id": 62,
      "start": 912.2200012207031,
      "end": 916.3800048828125,
      "text": " the man brought the men into Joseph's house. And then notice the phrase in"
    },
    {
      "id": 63,
      "start": 916.3800048828125,
      "end": 920.9800109863281,
      "text": " verse 18, and the men were afraid. I don't know all that's going through their"
    },
    {
      "id": 64,
      "start": 920.9800109863281,
      "end": 925.5,
      "text": " mind at this particular time, but I don't think they expect it to be invited to"
    },
    {
      "id": 65,
      "start": 925.5,
      "end": 929.8600158691406,
      "text": " this man's house. And there's a great feast. We won't take the time to read all"
    },
    {
      "id": 66,
      "start": 929.8600158691406,
      "end": 934.0599975585938,
      "text": " that is taking place here in chapter 43. You can read it on your own, but"
    },
    {
      "id": 67,
      "start": 934.0599975585938,
      "end": 939.5,
      "text": " understand that as they gather together, that these men that are afraid, they"
    },
    {
      "id": 68,
      "start": 939.5,
      "end": 943.4600219726562,
      "text": " begin to speak. They came near to the steward of Joseph's house in verse"
    },
    {
      "id": 69,
      "start": 943.4600219726562,
      "end": 947.3800048828125,
      "text": " number 19 and they communed with him at the door of the house and said, oh sir, we"
    },
    {
      "id": 70,
      "start": 947.3800048828125,
      "end": 951.1799926757812,
      "text": " came indeed down at the first time to buy food. Verse 21, it came to pass when"
    },
    {
      "id": 71,
      "start": 951.1799926757812,
      "end": 955.4600219726562,
      "text": " we came to the inn that we opened our sacks and behold, every man's money was in"
    },
    {
      "id": 72,
      "start": 955.4600219726562,
      "end": 959.1000061035156,
      "text": " the mouth of a sack, our money in full weight. Notice what they say, and we have"
    },
    {
      "id": 73,
      "start": 959.1000061035156,
      "end": 963.8999938964844,
      "text": " brought it again in our hand. Just in case we're here because of the money"
    },
    {
      "id": 74,
      "start": 963.8999938964844,
      "end": 967.8999938964844,
      "text": " situation, we've already brought it back. I mean, they're concerned. They're"
    },
    {
      "id": 75,
      "start": 967.8999938964844,
      "end": 972.3000183105469,
      "text": " afraid. They don't know why they're there. The Bible tells us that they"
    },
    {
      "id": 76,
      "start": 972.3000183105469,
      "end": 976.7799987792969,
      "text": " mentioned that they have other money in order to buy the provision. And notice in"
    },
    {
      "id": 77,
      "start": 976.7799987792969,
      "end": 981.5400085449219,
      "text": " verse 23, this man that is mentioned the steward of Joseph's house in verse 19, he"
    },
    {
      "id": 78,
      "start": 981.5400085449219,
      "end": 987.2200012207031,
      "text": " says to the brothers, peace be to you. Fear not. Your God and the God of your"
    },
    {
      "id": 79,
      "start": 987.260009765625,
      "end": 992.7799987792969,
      "text": " father have given you treasure in your sacks. I had your money and he brought"
    },
    {
      "id": 80,
      "start": 992.7799987792969,
      "end": 997.1799926757812,
      "text": " Simeon out unto them. Now the reality is that they did have the money, but they"
    },
    {
      "id": 81,
      "start": 997.1799926757812,
      "end": 1002.7400207519531,
      "text": " returned the money. Joseph instructed them to do that and we find that they"
    },
    {
      "id": 82,
      "start": 1002.7400207519531,
      "end": 1008.8999938964844,
      "text": " bring Simeon. And then in verse 24, the man brought the men into Joseph's house"
    },
    {
      "id": 83,
      "start": 1008.8999938964844,
      "end": 1012.4600219726562,
      "text": " and they gave them water and they washed their feet and he gave their asses"
    },
    {
      "id": 84,
      "start": 1013.3000183105469,
      "end": 1017.3399963378906,
      "text": " And they made ready the present against Joseph came at noon, for they heard that"
    },
    {
      "id": 85,
      "start": 1017.3399963378906,
      "end": 1022.6600036621094,
      "text": " they should eat bread there. When Joseph came home, they brought him the present"
    },
    {
      "id": 86,
      "start": 1022.6600036621094,
      "end": 1025.8999938964844,
      "text": " which was in their hand into the house. And notice it says, and bowed themselves"
    },
    {
      "id": 87,
      "start": 1025.8999938964844,
      "end": 1030.0599975585938,
      "text": " to him to the earth. Remember the dreams that Joseph had? Begin to see the"
    },
    {
      "id": 88,
      "start": 1030.0599975585938,
      "end": 1034.3000183105469,
      "text": " fulfillment of those dreams in this interaction here. In verse 27, he asked"
    },
    {
      "id": 89,
      "start": 1034.3000183105469,
      "end": 1038.02001953125,
      "text": " them of their welfare and said, is your father well? The old man of whom you"
    },
    {
      "id": 90,
      "start": 1038.02001953125,
      "end": 1043.260009765625,
      "text": " spake, is he yet alive? You know why Joseph's inquiring, it's his dad. He's"
    },
    {
      "id": 91,
      "start": 1043.260009765625,
      "end": 1046.5,
      "text": " concerned about the welfare of his father and he inquires and the Bible"
    },
    {
      "id": 92,
      "start": 1046.5,
      "end": 1050.5800170898438,
      "text": " says in verse 28 that they respond and they say, thy servant our father is in"
    },
    {
      "id": 93,
      "start": 1050.5800170898438,
      "end": 1053.9400024414062,
      "text": " good health, he is yet alive. And they bowed down their heads and made"
    },
    {
      "id": 94,
      "start": 1053.9400024414062,
      "end": 1058.4200134277344,
      "text": " obeisance. Again, the fulfillment of the dreams that we spoke about many weeks"
    },
    {
      "id": 95,
      "start": 1058.4200134277344,
      "end": 1063.3399963378906,
      "text": " ago in Genesis 37. And we find here that that they they bowed down their heads"
    },
    {
      "id": 96,
      "start": 1063.3399963378906,
      "end": 1067.02001953125,
      "text": " and they made obeisance. In verse 29, he lifted up his eyes and saw his brother"
    },
    {
      "id": 97,
      "start": 1067.02001953125,
      "end": 1074.260009765625,
      "text": " Benjamin, his mother's son. This is his only full brother. Remember the the house"
    },
    {
      "id": 98,
      "start": 1074.260009765625,
      "end": 1079.2200012207031,
      "text": " of Jacob is a is a messed up house. We dealt with all the the children and what"
    },
    {
      "id": 99,
      "start": 1079.2200012207031,
      "end": 1083.8600158691406,
      "text": " have you and all of the the two wives and handmaids and so on and so forth"
    },
    {
      "id": 100,
      "start": 1083.8600158691406,
      "end": 1089.3399963378906,
      "text": " many months ago. And we see that his brother Benjamin is there and he says, is"
    },
    {
      "id": 101,
      "start": 1089.3399963378906,
      "end": 1093.6600036621094,
      "text": " this your younger brother of whom you spake unto me? And notice it's almost as"
    },
    {
      "id": 102,
      "start": 1093.6600036621094,
      "end": 1099.260009765625,
      "text": " if Joseph could not contain himself. It's as if he shouts out, he says,"
    },
    {
      "id": 103,
      "start": 1099.260009765625,
      "end": 1104.3800048828125,
      "text": " God be gracious unto thee my son. And then he made haste for his bowels did"
    },
    {
      "id": 104,
      "start": 1104.3800048828125,
      "end": 1107.7799987792969,
      "text": " yearn upon his brother and he saw it were to weep and he entered into his"
    },
    {
      "id": 105,
      "start": 1107.7799987792969,
      "end": 1112.5800170898438,
      "text": " chamber and he wept there. As you look at this account and you see what's"
    },
    {
      "id": 106,
      "start": 1112.5800170898438,
      "end": 1117.739990234375,
      "text": " happening, you see this feast and and you find how God is continuing to work and"
    },
    {
      "id": 107,
      "start": 1117.739990234375,
      "end": 1123.02001953125,
      "text": " as God is using Joseph and orchestrating these circumstances, we find that God is"
    },
    {
      "id": 108,
      "start": 1123.02001953125,
      "end": 1129.02001953125,
      "text": " continuing to pursue these brothers and we find that the Bible tells us that"
    },
    {
      "id": 109,
      "start": 1129.02001953125,
      "end": 1133.5800170898438,
      "text": " that Joseph then comes out after he had wept in his chamber and it says in verse"
    },
    {
      "id": 110,
      "start": 1133.5800170898438,
      "end": 1137.5599975585938,
      "text": " 33 and they sat before him the firstborn according to his birthright and the"
    },
    {
      "id": 111,
      "start": 1137.5599975585938,
      "end": 1141.1400146484375,
      "text": " youngest according to his youth and the men marveled one at another. Can you"
    },
    {
      "id": 112,
      "start": 1141.1400146484375,
      "end": 1146.3400268554688,
      "text": " imagine? I mean put yourself in the situation. There are ten of you and"
    },
    {
      "id": 113,
      "start": 1146.3400268554688,
      "end": 1152.9400024414062,
      "text": " you're seated around the table and you're seated in birth order. I mean God"
    },
    {
      "id": 114,
      "start": 1152.9400024414062,
      "end": 1157.9400024414062,
      "text": " is working. What is going on? How do they? Yeah, it's right. I mean"
    },
    {
      "id": 115,
      "start": 1157.9400024414062,
      "end": 1163.6199951171875,
      "text": " it's perfectly aligned and I begin to think as I study through these"
    },
    {
      "id": 116,
      "start": 1163.6199951171875,
      "end": 1168.5800170898438,
      "text": " portions of Scripture and read these verses and see how God is working. He"
    },
    {
      "id": 117,
      "start": 1168.5800170898438,
      "end": 1172.9400024414062,
      "text": " took and sent messes. Joseph sends them food it says unto them from before him"
    },
    {
      "id": 118,
      "start": 1172.9400024414062,
      "end": 1178.0599975585938,
      "text": " but Benjamin's mess was five times so much as any of theirs. All the youngest"
    },
    {
      "id": 119,
      "start": 1178.0599975585938,
      "end": 1182.0599975585938,
      "text": " brothers and siblings said praise the Lord, amen, because normally they just get"
    },
    {
      "id": 120,
      "start": 1182.0599975585938,
      "end": 1186.6199951171875,
      "text": " the scraps. They don't get very much but here Benjamin, I mean he gets a full"
    },
    {
      "id": 121,
      "start": 1186.6199951171875,
      "end": 1193.4199829101562,
      "text": " portion and it was a time the Bible says that they were merry with him. Now"
    },
    {
      "id": 122,
      "start": 1193.4199829101562,
      "end": 1196.3800048828125,
      "text": " they still don't know who they're dining with. They don't know who they're"
    },
    {
      "id": 123,
      "start": 1196.3800048828125,
      "end": 1202.780029296875,
      "text": " enjoying this feast with but it's not"
    },
    {
      "id": 0,
      "start": 1202.780029296875,
      "end": 1204.460029244423,
      "text": " as bad as they thought it might be."
    },
    {
      "id": 1,
      "start": 1204.460029244423,
      "end": 1206.6800293922424,
      "text": " When they were first invited to his house, they're afraid."
    },
    {
      "id": 2,
      "start": 1206.6800293922424,
      "end": 1210.9200296401978,
      "text": " They don't know what's going on, and they're concerned, and they say, hey, we know that"
    },
    {
      "id": 3,
      "start": 1210.9200296401978,
      "end": 1217.0800294876099,
      "text": " when we left, our money was found in our sack, but we've brought it back."
    },
    {
      "id": 4,
      "start": 1217.0800294876099,
      "end": 1224.0800285339355,
      "text": " Things kind of progress and kind of enjoying, but it's going to end at some point, and there's"
    },
    {
      "id": 5,
      "start": 1224.0800285339355,
      "end": 1230.120029449463,
      "text": " got to be a measure of uncertainty and maybe assumption as to what's going to take place,"
    },
    {
      "id": 6,
      "start": 1230.120029449463,
      "end": 1236.4200286865234,
      "text": " and we find that in verse, as we enter into the 44th chapter, that as we look at what's"
    },
    {
      "id": 7,
      "start": 1236.4200286865234,
      "end": 1242.5000305175781,
      "text": " taking place, it says that he commanded the steward of his house, so this is Joseph making"
    },
    {
      "id": 8,
      "start": 1242.5000305175781,
      "end": 1246.2000274658203,
      "text": " this commandment, and here's what he says."
    },
    {
      "id": 9,
      "start": 1246.2000274658203,
      "end": 1254.9000282287598,
      "text": " In verse 1 of chapter 44, fill the men's sacks with food, as much as they can carry."
    },
    {
      "id": 10,
      "start": 1254.9000282287598,
      "end": 1260.220027923584,
      "text": " Put every man's money in his sack's mouth."
    },
    {
      "id": 11,
      "start": 1260.220027923584,
      "end": 1261.8600311279297,
      "text": " Doesn't end there."
    },
    {
      "id": 12,
      "start": 1261.8600311279297,
      "end": 1266.1600303649902,
      "text": " And put my cup, verse 2, the silver cup."
    },
    {
      "id": 13,
      "start": 1266.1600303649902,
      "end": 1267.160026550293,
      "text": " You see the specific?"
    },
    {
      "id": 14,
      "start": 1267.160026550293,
      "end": 1270.5000305175781,
      "text": " I mean, Joseph's making sure he knows what he's talking about."
    },
    {
      "id": 15,
      "start": 1270.5000305175781,
      "end": 1277.2400283813477,
      "text": " He says, and put my cup, the silver cup, in the sack's mouth of the youngest, and his"
    },
    {
      "id": 16,
      "start": 1277.2400283813477,
      "end": 1278.6200256347656,
      "text": " corn money."
    },
    {
      "id": 17,
      "start": 1278.6200256347656,
      "end": 1282.880027770996,
      "text": " And he did, according to the word that Joseph had spoken, the steward obeyed the commandment"
    },
    {
      "id": 18,
      "start": 1282.880027770996,
      "end": 1285.6000289916992,
      "text": " of Joseph, without any question, by the way."
    },
    {
      "id": 19,
      "start": 1285.6000289916992,
      "end": 1289.1400299072266,
      "text": " It's a good lesson all in itself, the importance of obedience."
    },
    {
      "id": 20,
      "start": 1289.1400299072266,
      "end": 1292.0400314331055,
      "text": " We find that the steward, he obeyed his master."
    },
    {
      "id": 21,
      "start": 1292.0400314331055,
      "end": 1298.7200317382812,
      "text": " Joseph is the master, and Joseph gave the command, and the servant, this man, he did"
    },
    {
      "id": 22,
      "start": 1298.7200317382812,
      "end": 1302.0400314331055,
      "text": " what he was instructed to do."
    },
    {
      "id": 23,
      "start": 1302.0400314331055,
      "end": 1306.8000259399414,
      "text": " The Bible says in verse 3, as soon as the morning was light, the men were sent away,"
    },
    {
      "id": 24,
      "start": 1306.8000259399414,
      "end": 1308.280029296875,
      "text": " they and their asses."
    },
    {
      "id": 25,
      "start": 1308.280029296875,
      "end": 1312.280029296875,
      "text": " Now, at this particular moment, they probably think we're in the clear."
    },
    {
      "id": 26,
      "start": 1312.280029296875,
      "end": 1314.8400268554688,
      "text": " I mean, we're leaving."
    },
    {
      "id": 27,
      "start": 1314.8400268554688,
      "end": 1321.7600326538086,
      "text": " They came, and they were able to succeed, and what their objective was, and they had"
    },
    {
      "id": 28,
      "start": 1321.7600326538086,
      "end": 1326.7200317382812,
      "text": " this meal, there's a famine that's going on, but they had this great feast, and now the"
    },
    {
      "id": 29,
      "start": 1326.7200317382812,
      "end": 1329.5600280761719,
      "text": " morning light comes, and they're going to depart."
    },
    {
      "id": 30,
      "start": 1329.5600280761719,
      "end": 1332.8800354003906,
      "text": " And the Bible says when they were gone out of the city, in verse number 4, and not yet"
    },
    {
      "id": 31,
      "start": 1332.8800354003906,
      "end": 1338.4400329589844,
      "text": " far off, I mean, they didn't get very far, that Joseph said unto his steward, up, follow"
    },
    {
      "id": 32,
      "start": 1338.4400329589844,
      "end": 1339.4400329589844,
      "text": " after the men."
    },
    {
      "id": 33,
      "start": 1339.6800231933594,
      "end": 1346.0000305175781,
      "text": " When thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good?"
    },
    {
      "id": 34,
      "start": 1346.0000305175781,
      "end": 1352.800033569336,
      "text": " Is not this it, in which my Lord drinketh, and whereby indeed he divineth, ye have done"
    },
    {
      "id": 35,
      "start": 1352.800033569336,
      "end": 1355.1600341796875,
      "text": " evil in so doing?"
    },
    {
      "id": 36,
      "start": 1355.1600341796875,
      "end": 1360.9200286865234,
      "text": " And he, that servant, overtook them, and he spake unto them these same words."
    },
    {
      "id": 37,
      "start": 1360.9200286865234,
      "end": 1368.4000244140625,
      "text": " Again, we see the obedience of this servant, as we find here in this portion of Scripture,"
    },
    {
      "id": 38,
      "start": 1368.4000244140625,
      "end": 1373.0800323486328,
      "text": " the steward of his house, and we find that as we enter into this 44th chapter, we've"
    },
    {
      "id": 39,
      "start": 1373.0800323486328,
      "end": 1378.9200286865234,
      "text": " spoken about the famine, and we see about the feast, but I want you to see the plea."
    },
    {
      "id": 40,
      "start": 1378.9200286865234,
      "end": 1379.9200286865234,
      "text": " The plea."
    },
    {
      "id": 41,
      "start": 1379.9200286865234,
      "end": 1382.8400268554688,
      "text": " And really, it's the plea of Judah."
    },
    {
      "id": 42,
      "start": 1382.8400268554688,
      "end": 1387.800033569336,
      "text": " He's the spokesman for the brothers, but we find that as the steward of the house, he"
    },
    {
      "id": 43,
      "start": 1387.800033569336,
      "end": 1394.2400360107422,
      "text": " overtakes the brothers as they departed from the house of Joseph, and we find that they"
    },
    {
      "id": 44,
      "start": 1394.2400360107422,
      "end": 1400.040023803711,
      "text": " say unto him, in verse number 7, Wherefore saith my Lord these words, God forbid that"
    },
    {
      "id": 45,
      "start": 1400.040023803711,
      "end": 1403.0800323486328,
      "text": " thy servant should do according to this thing."
    },
    {
      "id": 46,
      "start": 1403.0800323486328,
      "end": 1406.3200225830078,
      "text": " Behold the money, which we found in our sacks' mouths, we brought again unto thee out of"
    },
    {
      "id": 47,
      "start": 1406.3200225830078,
      "end": 1407.7400360107422,
      "text": " the land of Canaan."
    },
    {
      "id": 48,
      "start": 1407.7400360107422,
      "end": 1412.7200317382812,
      "text": " How then should we steal out of thy Lord's house silver or gold?"
    },
    {
      "id": 49,
      "start": 1412.7200317382812,
      "end": 1417.0800323486328,
      "text": " I mean, we're being accused of stealing, no, we didn't do this."
    },
    {
      "id": 50,
      "start": 1417.0800323486328,
      "end": 1422.0800323486328,
      "text": " In verse number 9, notice what they say, they really, in verse number 9, they were so confident"
    },
    {
      "id": 51,
      "start": 1422.1200256347656,
      "end": 1427.4800262451172,
      "text": " that they suggest what the penalty should be, what the punishment should be, if it's"
    },
    {
      "id": 52,
      "start": 1427.4800262451172,
      "end": 1431.3200225830078,
      "text": " found that they're guilty."
    },
    {
      "id": 53,
      "start": 1431.3200225830078,
      "end": 1438.3200225830078,
      "text": " With whomsoever thy servants it be found, both let him die, and we also will be my Lord's"
    },
    {
      "id": 54,
      "start": 1442.5600280761719,
      "end": 1445.520034790039,
      "text": " bondmen."
    },
    {
      "id": 55,
      "start": 1445.520034790039,
      "end": 1449.9600219726562,
      "text": " That's pretty serious, is it not?"
    },
    {
      "id": 56,
      "start": 1449.9600219726562,
      "end": 1453.8800354003906,
      "text": " And he said, No, also let it be according unto your words."
    },
    {
      "id": 57,
      "start": 1453.8800354003906,
      "end": 1460.0400390625,
      "text": " He with whom it is found shall be my servant, and ye shall be blameless."
    },
    {
      "id": 58,
      "start": 1460.0400390625,
      "end": 1465.6800231933594,
      "text": " They said, The one in whom it's found, let him die, and all of us will be your servants."
    },
    {
      "id": 59,
      "start": 1465.6800231933594,
      "end": 1469.5000305175781,
      "text": " And we find that the steward of the house, he says, No, here's how it's going to work."
    },
    {
      "id": 60,
      "start": 1469.5000305175781,
      "end": 1476.0800170898438,
      "text": " With whomsoever it's found, that individual will be the servant, everyone else is blameless."
    },
    {
      "id": 61,
      "start": 1476.1200256347656,
      "end": 1480.0000305175781,
      "text": " And they speedily took down every man of sack to the ground and opened every man of sack."
    },
    {
      "id": 62,
      "start": 1480.0000305175781,
      "end": 1482.8800354003906,
      "text": " I mean, they're confident."
    },
    {
      "id": 63,
      "start": 1482.8800354003906,
      "end": 1486.5600280761719,
      "text": " And he searched and began at the eldest and left at the youngest, and the last part of"
    },
    {
      "id": 64,
      "start": 1486.5600280761719,
      "end": 1493.5600280761719,
      "text": " verse 12, we use it as our title, and the cup was found in Benjamin's sack."
    },
    {
      "id": 65,
      "start": 1494.6400146484375,
      "end": 1498.280029296875,
      "text": " The cup was found in Benjamin's sack."
    },
    {
      "id": 66,
      "start": 1498.280029296875,
      "end": 1505.280029296875,
      "text": " The Bible says in verse 13 that they rent their clothes, I guess so, I guess so."
    },
    {
      "id": 67,
      "start": 1505.280029296875,
      "end": 1511.4400329589844,
      "text": " They rent their clothes and laid at every man his ass and returned to the city."
    },
    {
      "id": 68,
      "start": 1511.4400329589844,
      "end": 1516.7200317382812,
      "text": " Jude and his brethren came to Joseph's house, for he was yet there, and they fell before"
    },
    {
      "id": 69,
      "start": 1516.7200317382812,
      "end": 1519.6400146484375,
      "text": " him on the ground."
    },
    {
      "id": 70,
      "start": 1519.6400146484375,
      "end": 1522.4800415039062,
      "text": " Joseph said unto them, What deed is this that ye have done?"
    },
    {
      "id": 71,
      "start": 1522.4800415039062,
      "end": 1525.280029296875,
      "text": " Wilt ye not that such a man as I can certainly divine?"
    },
    {
      "id": 72,
      "start": 1525.280029296875,
      "end": 1529.5600280761719,
      "text": " And Judah said, again, Judah, again, as I mentioned earlier, he's the spokesman."
    },
    {
      "id": 73,
      "start": 1529.5600280761719,
      "end": 1534.52001953125,
      "text": " We see that he's speaking to Jacob in chapter 43, and he's the one that's speaking on the"
    },
    {
      "id": 74,
      "start": 1534.52001953125,
      "end": 1536.0800170898438,
      "text": " behalf of the brethren."
    },
    {
      "id": 75,
      "start": 1536.0800170898438,
      "end": 1539.4800415039062,
      "text": " And it says that he says, What shall we say unto my Lord?"
    },
    {
      "id": 76,
      "start": 1539.4800415039062,
      "end": 1540.4800415039062,
      "text": " What shall we speak?"
    },
    {
      "id": 77,
      "start": 1540.4800415039062,
      "end": 1542.2400207519531,
      "text": " Or how shall we clear ourselves?"
    },
    {
      "id": 78,
      "start": 1542.2400207519531,
      "end": 1548.0000305175781,
      "text": " Notice what he says, God hath found out the iniquity of thy servants."
    },
    {
      "id": 79,
      "start": 1548.0000305175781,
      "end": 1550.4400329589844,
      "text": " Listen, God always knew."
    },
    {
      "id": 80,
      "start": 1550.4400329589844,
      "end": 1555.4800415039062,
      "text": " It's not as God found out in the fact that he discovered it, but really that he's making"
    },
    {
      "id": 81,
      "start": 1555.4800415039062,
      "end": 1558.1200256347656,
      "text": " it known."
    },
    {
      "id": 82,
      "start": 1558.1200256347656,
      "end": 1562.2400207519531,
      "text": " He's exposing their wickedness."
    },
    {
      "id": 83,
      "start": 1562.2400207519531,
      "end": 1569.6000366210938,
      "text": " We find that God is working, and God is continuing to pursue and to break Judah and the brethren."
    },
    {
      "id": 84,
      "start": 1569.6000366210938,
      "end": 1574.4800415039062,
      "text": " And we find that as they evaluate, again, the circumstances, even as they did in that"
    },
    {
      "id": 85,
      "start": 1574.4800415039062,
      "end": 1581.3600158691406,
      "text": " first trip, as we studied in chapter 42, they reached the conclusion that God is doing this."
    },
    {
      "id": 86,
      "start": 1581.3600158691406,
      "end": 1583.0800170898438,
      "text": " God is working."
    },
    {
      "id": 87,
      "start": 1583.0800170898438,
      "end": 1592.0000305175781,
      "text": " God is dealing with us according to what happened 20 years earlier, at least 20 years earlier."
    },
    {
      "id": 88,
      "start": 1592.0000305175781,
      "end": 1599.0800170898438,
      "text": " Notice, they say in verse 16, Behold, we are my Lord's servants, both we and he also"
    },
    {
      "id": 89,
      "start": 1599.0800170898438,
      "end": 1600.8000183105469,
      "text": " with whom the cup is found."
    },
    {
      "id": 90,
      "start": 1600.8000183105469,
      "end": 1603.2000427246094,
      "text": " All of a sudden, they don't want Benjamin to die."
    },
    {
      "id": 91,
      "start": 1603.2000427246094,
      "end": 1607.6000366210938,
      "text": " And of course, we know that that would be the case with regard to the commitment that"
    },
    {
      "id": 92,
      "start": 1607.6000366210938,
      "end": 1612.2000427246094,
      "text": " was made to Jacob with regard to returning Benjamin safely."
    },
    {
      "id": 93,
      "start": 1612.2000427246094,
      "end": 1618.2000427246094,
      "text": " And we find that Judah says to Joseph, again, he doesn't know that it's Joseph, but he says"
    },
    {
      "id": 94,
      "start": 1618.2000427246094,
      "end": 1623.4800415039062,
      "text": " that God hath found out the iniquity of thy servants, behold, we are my Lord's servants,"
    },
    {
      "id": 95,
      "start": 1623.4800415039062,
      "end": 1628.52001953125,
      "text": " both we and he also with whom the cup is found."
    },
    {
      "id": 96,
      "start": 1628.52001953125,
      "end": 1632.9200439453125,
      "text": " And he, Joseph, says, God forbid that I should do so."
    },
    {
      "id": 97,
      "start": 1632.9200439453125,
      "end": 1638.3200378417969,
      "text": " But the man in whose hand the cup is found, he shall be my servant."
    },
    {
      "id": 98,
      "start": 1638.3200378417969,
      "end": 1643.8000183105469,
      "text": " And as for you, get you up in peace unto your father."
    },
    {
      "id": 99,
      "start": 1643.8000183105469,
      "end": 1654.5600280761719,
      "text": " In verse number 17, Joseph offers to release everyone but Benjamin, but Judah protests."
    },
    {
      "id": 100,
      "start": 1654.5600280761719,
      "end": 1660.3600158691406,
      "text": " Judah comes and speaks again to Joseph in protest to this offer that is made as Joseph"
    },
    {
      "id": 101,
      "start": 1660.3600158691406,
      "end": 1663.0400390625,
      "text": " says that all of you are free to go."
    },
    {
      "id": 102,
      "start": 1663.0400390625,
      "end": 1667.3200378417969,
      "text": " Benjamin, he's the one that the cup was found in his sack."
    },
    {
      "id": 103,
      "start": 1667.3200378417969,
      "end": 1670.0800170898438,
      "text": " He's the one that will remain here as my servant."
    },
    {
      "id": 104,
      "start": 1670.0800170898438,
      "end": 1674.0000305175781,
      "text": " And Judah, in verse number 18, speaks up once again."
    },
    {
      "id": 105,
      "start": 1674.0000305175781,
      "end": 1678.2400207519531,
      "text": " The Bible says that he came near unto him and he said, Oh, my Lord, let thy servant,"
    },
    {
      "id": 106,
      "start": 1678.2400207519531,
      "end": 1684.4000244140625,
      "text": " I pray thee, speak a word in my Lord's ears, and let not thine anger burn against thy servant,"
    },
    {
      "id": 107,
      "start": 1684.4000244140625,
      "end": 1687.9600219726562,
      "text": " for thou art even as Pharaoh."
    },
    {
      "id": 108,
      "start": 1687.9600219726562,
      "end": 1691.52001953125,
      "text": " Begins to rehearse even from the very first trip."
    },
    {
      "id": 109,
      "start": 1691.52001953125,
      "end": 1695.9600219726562,
      "text": " My Lord asked his servants saying, have you a father or a brother?"
    },
    {
      "id": 110,
      "start": 1695.9600219726562,
      "end": 1700.6000366210938,
      "text": " He said unto my Lord, we have a father, an old man, a child of his old age, a little"
    },
    {
      "id": 111,
      "start": 1700.6000366210938,
      "end": 1701.6000366210938,
      "text": " one."
    },
    {
      "id": 112,
      "start": 1701.6000366210938,
      "end": 1707.5600280761719,
      "text": " His brother is dead, and he alone is left of his mother, and his father loveth him."
    },
    {
      "id": 113,
      "start": 1707.5600280761719,
      "end": 1712.4400329589844,
      "text": " And thou saidst unto thy servants, bring him down unto me that I may set mine eyes upon"
    },
    {
      "id": 114,
      "start": 1712.4400329589844,
      "end": 1713.9600219726562,
      "text": " him."
    },
    {
      "id": 115,
      "start": 1713.9600219726562,
      "end": 1718.2400512695312,
      "text": " And we said unto my Lord, the lad cannot leave his father, for if he should leave his father,"
    },
    {
      "id": 116,
      "start": 1718.2400512695312,
      "end": 1720.4400024414062,
      "text": " his father would die."
    },
    {
      "id": 117,
      "start": 1720.4400024414062,
      "end": 1724.8400268554688,
      "text": " Thou saidst unto thy servants, except your youngest brother come down with you, ye shall"
    },
    {
      "id": 118,
      "start": 1724.8400268554688,
      "end": 1726.56005859375,
      "text": " see my face no more."
    },
    {
      "id": 119,
      "start": 1726.56005859375,
      "end": 1731.8400268554688,
      "text": " It came to pass when we came up unto thy servant, my father, we told him the words of my Lord,"
    },
    {
      "id": 120,
      "start": 1731.8400268554688,
      "end": 1735.3600463867188,
      "text": " and our father said, go again and buy a little food."
    },
    {
      "id": 121,
      "start": 1735.3600463867188,
      "end": 1738.1600341796875,
      "text": " Verse 26, we said, we cannot go down."
    },
    {
      "id": 122,
      "start": 1738.1600341796875,
      "end": 1742.800048828125,
      "text": " If our youngest brother be with us, then will we go down, for we may not see the man's face"
    },
    {
      "id": 123,
      "start": 1742.800048828125,
      "end": 1745.1200561523438,
      "text": " except our youngest brother be with us."
    },
    {
      "id": 124,
      "start": 1745.1200561523438,
      "end": 1750.6800537109375,
      "text": " And thy servant, my father, said unto us, ye know that my wife bear me two sons."
    },
    {
      "id": 125,
      "start": 1750.6800537109375,
      "end": 1755.6800537109375,
      "text": " And the one went out for me, and I said, surely he is torn in pieces, and I saw him"
    },
    {
      "id": 126,
      "start": 1755.6800537109375,
      "end": 1757.2400512695312,
      "text": " not since.\""
    },
    {
      "id": 127,
      "start": 1757.2400512695312,
      "end": 1760.280029296875,
      "text": " Judah doesn't know that he's speaking to this one."
    },
    {
      "id": 128,
      "start": 1760.280029296875,
      "end": 1763.280029296875,
      "text": " He doesn't know that he's speaking to Joseph."
    },
    {
      "id": 129,
      "start": 1763.280029296875,
      "end": 1769.9200439453125,
      "text": " It might be that, I mean, Joseph is hearing firsthand really what was communicated to"
    },
    {
      "id": 130,
      "start": 1769.9200439453125,
      "end": 1775.6000366210938,
      "text": " Jacob about Joseph's presumed death."
    },
    {
      "id": 131,
      "start": 1775.6000366210938,
      "end": 1780.6800537109375,
      "text": " It says in verse number 29, and if you take this also from me, and mischief befall him,"
    },
    {
      "id": 132,
      "start": 1780.6800537109375,
      "end": 1786.52001953125,
      "text": " ye shall bring down my gray hairs with sorrow to the grave."
    },
    {
      "id": 133,
      "start": 1786.52001953125,
      "end": 1791.1200561523438,
      "text": " Now therefore, when I come to thy servant, my father, and the lad be not with us, seeing"
    },
    {
      "id": 134,
      "start": 1791.1200561523438,
      "end": 1795.8800048828125,
      "text": " that his life is bound up in the lad's life, it shall come to pass when he seeth that the"
    },
    {
      "id": 135,
      "start": 1795.8800048828125,
      "end": 1799.52001953125,
      "text": " lad is not with us, that he will die."
    },
    {
      "id": 136,
      "start": 1799.52001953125,
      "end": 1802.8400268554688,
      "text": " And thy servants shall bring down the gray hairs."
    },
    {
      "id": 0,
      "start": 1802.8400268554688,
      "end": 1806.7200269699097,
      "text": " of thy servant our father with sorrow to the grave."
    },
    {
      "id": 1,
      "start": 1806.7200269699097,
      "end": 1809.6800270080566,
      "text": " For thy servant became surety for the lad unto my father,"
    },
    {
      "id": 2,
      "start": 1809.6800270080566,
      "end": 1811.9000272750854,
      "text": " saying, if I bring him not unto thee,"
    },
    {
      "id": 3,
      "start": 1811.9000272750854,
      "end": 1814.780026435852,
      "text": " then I shall bear the blame to my father forever."
    },
    {
      "id": 4,
      "start": 1814.780026435852,
      "end": 1816.5600271224976,
      "text": " Notice verse 33."
    },
    {
      "id": 5,
      "start": 1816.5600271224976,
      "end": 1818.320026397705,
      "text": " Notice what Judah says."
    },
    {
      "id": 6,
      "start": 1818.320026397705,
      "end": 1820.320026397705,
      "text": " Now, therefore, I pray thee,"
    },
    {
      "id": 7,
      "start": 1820.320026397705,
      "end": 1823.320026397705,
      "text": " let thy servant abide instead of the lad,"
    },
    {
      "id": 8,
      "start": 1823.320026397705,
      "end": 1825.5400276184082,
      "text": " a bondman to my Lord,"
    },
    {
      "id": 9,
      "start": 1825.5400276184082,
      "end": 1828.4600276947021,
      "text": " and let the lad go up with his brethren."
    },
    {
      "id": 10,
      "start": 1828.4600276947021,
      "end": 1830.160026550293,
      "text": " And then he says this in verse 34,"
    },
    {
      "id": 11,
      "start": 1830.320026397705,
      "end": 1833.240026473999,
      "text": " for how shall I go to my father?"
    },
    {
      "id": 12,
      "start": 1833.240026473999,
      "end": 1835.2000274658203,
      "text": " And the lad be not with me,"
    },
    {
      "id": 13,
      "start": 1835.2000274658203,
      "end": 1837.9200286865234,
      "text": " lest peradventure I see the evil"
    },
    {
      "id": 14,
      "start": 1837.9200286865234,
      "end": 1841.0000267028809,
      "text": " that shall come on my father."
    },
    {
      "id": 15,
      "start": 1841.0000267028809,
      "end": 1845.100025177002,
      "text": " Do you see a difference in Judah in chapter 44"
    },
    {
      "id": 16,
      "start": 1845.100025177002,
      "end": 1848.8600273132324,
      "text": " versus what you find in previous interaction"
    },
    {
      "id": 17,
      "start": 1848.8600273132324,
      "end": 1853.8600273132324,
      "text": " as they came back to Jacob in chapter number 37,"
    },
    {
      "id": 18,
      "start": 1854.100025177002,
      "end": 1857.0200271606445,
      "text": " when they began to share with Jacob"
    },
    {
      "id": 19,
      "start": 1857.0200271606445,
      "end": 1859.1200256347656,
      "text": " the fact that they found this coat."
    },
    {
      "id": 20,
      "start": 1859.1200256347656,
      "end": 1861.4800262451172,
      "text": " They say in verse 32 of Genesis 37,"
    },
    {
      "id": 21,
      "start": 1861.4800262451172,
      "end": 1862.5600280761719,
      "text": " this have we found,"
    },
    {
      "id": 22,
      "start": 1862.5600280761719,
      "end": 1866.2000274658203,
      "text": " know now whether it be thy son's coat or no."
    },
    {
      "id": 23,
      "start": 1866.2000274658203,
      "end": 1869.5600280761719,
      "text": " And it says in verse 33 of chapter 37 that he knew it."
    },
    {
      "id": 24,
      "start": 1869.5600280761719,
      "end": 1872.3600234985352,
      "text": " Jacob knew it was the coat that he gave his son"
    },
    {
      "id": 25,
      "start": 1872.3600234985352,
      "end": 1873.2200241088867,
      "text": " and he knew it."
    },
    {
      "id": 26,
      "start": 1873.2200241088867,
      "end": 1875.2000274658203,
      "text": " And he said, it is my son's coat."
    },
    {
      "id": 27,
      "start": 1875.2000274658203,
      "end": 1877.0000305175781,
      "text": " An evil beast hath devoured him."
    },
    {
      "id": 28,
      "start": 1877.0000305175781,
      "end": 1880.3600234985352,
      "text": " Joseph without doubt is rent in pieces."
    },
    {
      "id": 29,
      "start": 1880.3600234985352,
      "end": 1883.2000274658203,
      "text": " And Jacob run his clothes and put sackcloth upon his loins."
    },
    {
      "id": 30,
      "start": 1883.2000274658203,
      "end": 1885.0600280761719,
      "text": " He mourned for his son many days."
    },
    {
      "id": 31,
      "start": 1885.0600280761719,
      "end": 1887.2400283813477,
      "text": " All his sons and his daughters rose up to comfort him,"
    },
    {
      "id": 32,
      "start": 1887.2400283813477,
      "end": 1889.0800247192383,
      "text": " but he refused to be comforted."
    },
    {
      "id": 33,
      "start": 1889.9200286865234,
      "end": 1891.040023803711,
      "text": " For he said, for I will go down into the grave"
    },
    {
      "id": 34,
      "start": 1891.040023803711,
      "end": 1894.3200302124023,
      "text": " into my son mourning thus his father wept for him."
    },
    {
      "id": 35,
      "start": 1894.3200302124023,
      "end": 1899.3200302124023,
      "text": " But we find in chapter 44, Judah's, there's a change."
    },
    {
      "id": 36,
      "start": 1900.3200302124023,
      "end": 1902.4400253295898,
      "text": " God's been working."
    },
    {
      "id": 37,
      "start": 1902.4400253295898,
      "end": 1904.8000259399414,
      "text": " 20 years has passed."
    },
    {
      "id": 38,
      "start": 1904.8000259399414,
      "end": 1906.2000274658203,
      "text": " Two trips to Egypt."
    },
    {
      "id": 39,
      "start": 1906.2000274658203,
      "end": 1907.4400253295898,
      "text": " He's in Egypt."
    },
    {
      "id": 40,
      "start": 1907.4400253295898,
      "end": 1909.6800231933594,
      "text": " He started to leave after a second trip,"
    },
    {
      "id": 41,
      "start": 1909.6800231933594,
      "end": 1911.5200271606445,
      "text": " but then all of these things came."
    },
    {
      "id": 42,
      "start": 1911.5200271606445,
      "end": 1914.9200286865234,
      "text": " And we find that as Judah is standing there before Joseph"
    },
    {
      "id": 43,
      "start": 1914.9200286865234,
      "end": 1917.9600296020508,
      "text": " and he's really pleading with Joseph"
    },
    {
      "id": 44,
      "start": 1917.9600296020508,
      "end": 1920.2000274658203,
      "text": " and he's pouring out his heart"
    },
    {
      "id": 45,
      "start": 1920.2000274658203,
      "end": 1922.880027770996,
      "text": " and he's sharing his concern for his father."
    },
    {
      "id": 46,
      "start": 1922.880027770996,
      "end": 1925.4000244140625,
      "text": " He's putting himself in a position where he says,"
    },
    {
      "id": 47,
      "start": 1925.4000244140625,
      "end": 1928.4000244140625,
      "text": " how shall I go up to my father in verse 34"
    },
    {
      "id": 48,
      "start": 1928.4000244140625,
      "end": 1930.040023803711,
      "text": " and the lad be not with me?"
    },
    {
      "id": 49,
      "start": 1930.040023803711,
      "end": 1932.0000305175781,
      "text": " Lest peradventure I see the evil"
    },
    {
      "id": 50,
      "start": 1932.0000305175781,
      "end": 1933.3600311279297,
      "text": " that should come on my father."
    },
    {
      "id": 51,
      "start": 1933.3600311279297,
      "end": 1936.1600341796875,
      "text": " He didn't care about that in chapter 37."
    },
    {
      "id": 52,
      "start": 1936.1600341796875,
      "end": 1938.8400268554688,
      "text": " He didn't care for a moment in chapter 37,"
    },
    {
      "id": 53,
      "start": 1938.8400268554688,
      "end": 1941.1200256347656,
      "text": " how Jacob would respond to the news,"
    },
    {
      "id": 54,
      "start": 1941.1200256347656,
      "end": 1943.8800201416016,
      "text": " to the belief that Joseph was dead."
    },
    {
      "id": 55,
      "start": 1945.2400207519531,
      "end": 1947.280029296875,
      "text": " God was working."
    },
    {
      "id": 56,
      "start": 1947.280029296875,
      "end": 1948.9600219726562,
      "text": " God was working."
    },
    {
      "id": 57,
      "start": 1948.9600219726562,
      "end": 1953.760025024414,
      "text": " They said, as we looked in chapter 44 in verse 16,"
    },
    {
      "id": 58,
      "start": 1953.760025024414,
      "end": 1957.4400329589844,
      "text": " God hath found out the iniquity of thy servants."
    },
    {
      "id": 59,
      "start": 1957.4400329589844,
      "end": 1960.8400268554688,
      "text": " And I believe that in verse 33, it reveals to us"
    },
    {
      "id": 60,
      "start": 1962.0000305175781,
      "end": 1966.800033569336,
      "text": " as Judah is speaking there, true brokenness."
    },
    {
      "id": 61,
      "start": 1966.800033569336,
      "end": 1969.6400299072266,
      "text": " Notice what Judah says in verse 33."
    },
    {
      "id": 62,
      "start": 1969.6400299072266,
      "end": 1974.6400299072266,
      "text": " Now therefore, I pray thee, let thy servant abide"
    },
    {
      "id": 63,
      "start": 1975.0800323486328,
      "end": 1978.2000274658203,
      "text": " instead of the lad a bondman to my Lord"
    },
    {
      "id": 64,
      "start": 1978.2000274658203,
      "end": 1981.4800262451172,
      "text": " and let the lad go up with his brethren."
    },
    {
      "id": 65,
      "start": 1982.5600280761719,
      "end": 1984.0000305175781,
      "text": " You know what Judah's saying?"
    },
    {
      "id": 66,
      "start": 1985.0000305175781,
      "end": 1986.2400207519531,
      "text": " I'll take the punishment."
    },
    {
      "id": 67,
      "start": 1987.8400268554688,
      "end": 1989.1600341796875,
      "text": " Let Benjamin go free."
    },
    {
      "id": 68,
      "start": 1991.2400207519531,
      "end": 1992.4400329589844,
      "text": " I'll take the punishment."
    },
    {
      "id": 69,
      "start": 1992.4400329589844,
      "end": 1995.9200286865234,
      "text": " The cup was not found in my sack."
    },
    {
      "id": 70,
      "start": 1995.9200286865234,
      "end": 1997.4800262451172,
      "text": " It was found in his sack."
    },
    {
      "id": 71,
      "start": 1998.6000213623047,
      "end": 2002.280029296875,
      "text": " But pour the punishment, the wrath on me,"
    },
    {
      "id": 72,
      "start": 2002.280029296875,
      "end": 2004.6400299072266,
      "text": " not on him, let him go."
    },
    {
      "id": 73,
      "start": 2004.6400299072266,
      "end": 2007.9200286865234,
      "text": " I believe that's a great picture of brokenness."
    },
    {
      "id": 74,
      "start": 2007.9200286865234,
      "end": 2010.9200286865234,
      "text": " I believe that as we look at this portion of Scripture"
    },
    {
      "id": 75,
      "start": 2010.9200286865234,
      "end": 2013.9200286865234,
      "text": " and we begin to understand how God is working"
    },
    {
      "id": 76,
      "start": 2013.9200286865234,
      "end": 2016.280029296875,
      "text": " and what God is doing, and again, next week"
    },
    {
      "id": 77,
      "start": 2016.280029296875,
      "end": 2018.4800262451172,
      "text": " on Sunday evening, we'll deal with chapter 45"
    },
    {
      "id": 78,
      "start": 2018.4800262451172,
      "end": 2021.0800323486328,
      "text": " and we'll understand how Joseph will reveal"
    },
    {
      "id": 79,
      "start": 2021.0800323486328,
      "end": 2022.8800201416016,
      "text": " his identity as brothers."
    },
    {
      "id": 80,
      "start": 2022.8800201416016,
      "end": 2025.4000244140625,
      "text": " And I believe that Joseph was a man"
    },
    {
      "id": 81,
      "start": 2025.4000244140625,
      "end": 2027.800033569336,
      "text": " that was sensitive to God's leading in his life."
    },
    {
      "id": 82,
      "start": 2027.800033569336,
      "end": 2032.7200317382812,
      "text": " And after this plea of Judah, after this interaction,"
    },
    {
      "id": 83,
      "start": 2032.7200317382812,
      "end": 2036.280029296875,
      "text": " we find that Joseph realizes that,"
    },
    {
      "id": 84,
      "start": 2036.280029296875,
      "end": 2039.1200256347656,
      "text": " and God gave direction that they're broken"
    },
    {
      "id": 85,
      "start": 2039.1200256347656,
      "end": 2042.760025024414,
      "text": " and now is the time to reveal your identity."
    },
    {
      "id": 86,
      "start": 2042.760025024414,
      "end": 2047.040023803711,
      "text": " But until that time, we find that God was working."
    },
    {
      "id": 87,
      "start": 2047.040023803711,
      "end": 2050.1600341796875,
      "text": " I wonder tonight, I ended the last message"
    },
    {
      "id": 88,
      "start": 2050.1600341796875,
      "end": 2052.9200286865234,
      "text": " about a month ago on, I believe it was December 10th,"
    },
    {
      "id": 89,
      "start": 2052.9200286865234,
      "end": 2055.560028076172,
      "text": " that Sunday evening, and I talked about the fact"
    },
    {
      "id": 90,
      "start": 2055.560028076172,
      "end": 2057.4400329589844,
      "text": " that God is at work, God is working."
    },
    {
      "id": 91,
      "start": 2058.080032348633,
      "end": 2060.000030517578,
      "text": " He's pursuing, and I asked this question,"
    },
    {
      "id": 92,
      "start": 2060.000030517578,
      "end": 2061.9200134277344,
      "text": " how is God working in your life?"
    },
    {
      "id": 93,
      "start": 2063.3600158691406,
      "end": 2066.4800415039062,
      "text": " Listen, the reality is that we can't hide anything from God."
    },
    {
      "id": 94,
      "start": 2067.760040283203,
      "end": 2070.3600158691406,
      "text": " You know, a lot of people try to hide things from God,"
    },
    {
      "id": 95,
      "start": 2072.800018310547,
      "end": 2073.760040283203,
      "text": " but you can't."
    },
    {
      "id": 96,
      "start": 2075.0800170898438,
      "end": 2079.0800170898438,
      "text": " For 20 years, 20 years, that's a long time."
    },
    {
      "id": 97,
      "start": 2079.0800170898438,
      "end": 2080.280029296875,
      "text": " 20 years is a long time."
    },
    {
      "id": 98,
      "start": 2081.4800415039062,
      "end": 2083.6400146484375,
      "text": " For 20 years, they tried to live life,"
    },
    {
      "id": 99,
      "start": 2084.560028076172,
      "end": 2088.6000366210938,
      "text": " suppressing what happened with Joseph."
    },
    {
      "id": 100,
      "start": 2090.1200256347656,
      "end": 2092.000030517578,
      "text": " They lived for 20 years."
    },
    {
      "id": 101,
      "start": 2092.000030517578,
      "end": 2094.000030517578,
      "text": " They don't wanna talk about it."
    },
    {
      "id": 102,
      "start": 2094.000030517578,
      "end": 2095.1200256347656,
      "text": " They don't wanna deal with it."
    },
    {
      "id": 103,
      "start": 2095.1200256347656,
      "end": 2096.52001953125,
      "text": " They just wanna suppress it."
    },
    {
      "id": 104,
      "start": 2098.0800170898438,
      "end": 2099.52001953125,
      "text": " But God was working."
    },
    {
      "id": 105,
      "start": 2099.52001953125,
      "end": 2102.1200256347656,
      "text": " There's so many reasons that God was working"
    },
    {
      "id": 106,
      "start": 2102.1200256347656,
      "end": 2103.9200134277344,
      "text": " with regard to the famine in the land,"
    },
    {
      "id": 107,
      "start": 2103.9200134277344,
      "end": 2105.1600341796875,
      "text": " but one of them, no doubt,"
    },
    {
      "id": 108,
      "start": 2105.1600341796875,
      "end": 2107.0800170898438,
      "text": " is the brokenness of these brothers."
    },
    {
      "id": 109,
      "start": 2108.1200256347656,
      "end": 2110.52001953125,
      "text": " And we find that through the events that transpire"
    },
    {
      "id": 110,
      "start": 2111.000030517578,
      "end": 2114.800018310547,
      "text": " that these men, they stand there and they recognize"
    },
    {
      "id": 111,
      "start": 2114.800018310547,
      "end": 2117.4000244140625,
      "text": " because of the events and the circumstances"
    },
    {
      "id": 112,
      "start": 2117.4000244140625,
      "end": 2121.4800415039062,
      "text": " that God is exposing their wickedness."
    },
    {
      "id": 113,
      "start": 2122.9600219726562,
      "end": 2125.9600219726562,
      "text": " This evening, I'm thankful that heaven is my home."
    },
    {
      "id": 114,
      "start": 2127.8800354003906,
      "end": 2129.9600219726562,
      "text": " I'm thankful that I'm heaven-bound,"
    },
    {
      "id": 115,
      "start": 2129.9600219726562,
      "end": 2131.9200134277344,
      "text": " but I want you to understand that you and I"
    },
    {
      "id": 116,
      "start": 2131.9200134277344,
      "end": 2135.560028076172,
      "text": " can live our lives in such a way that displeases God."
    },
    {
      "id": 117,
      "start": 2137.6800231933594,
      "end": 2140.2000122070312,
      "text": " God is not pleased with wickedness."
    },
    {
      "id": 118,
      "start": 2140.8800354003906,
      "end": 2142.6800231933594,
      "text": " God is not pleased with sin."
    },
    {
      "id": 119,
      "start": 2142.6800231933594,
      "end": 2146.7200317382812,
      "text": " God, listen, tonight, we understand our God is a holy God."
    },
    {
      "id": 120,
      "start": 2147.6000366210938,
      "end": 2149.9200134277344,
      "text": " He is a thrice holy God."
    },
    {
      "id": 121,
      "start": 2149.9200134277344,
      "end": 2152.8400268554688,
      "text": " And our God, who is a holy God,"
    },
    {
      "id": 122,
      "start": 2152.8400268554688,
      "end": 2157.4400329589844,
      "text": " said to us as his children that we're to be holy,"
    },
    {
      "id": 123,
      "start": 2157.4400329589844,
      "end": 2158.52001953125,
      "text": " for he is holy."
    },
    {
      "id": 124,
      "start": 2159.6400146484375,
      "end": 2163.6000366210938,
      "text": " That we're to be holy in all manner of conversation."
    },
    {
      "id": 125,
      "start": 2163.6000366210938,
      "end": 2164.8800354003906,
      "text": " And we understand that we have a God,"
    },
    {
      "id": 126,
      "start": 2164.8800354003906,
      "end": 2166.4800415039062,
      "text": " we're not gonna ever be perfect."
    },
    {
      "id": 127,
      "start": 2166.4800415039062,
      "end": 2170.800018310547,
      "text": " We have a God who promises to forgive when we sin,"
    },
    {
      "id": 128,
      "start": 2170.800018310547,
      "end": 2172.3600158691406,
      "text": " to be gracious and merciful."
    },
    {
      "id": 129,
      "start": 2172.3600158691406,
      "end": 2174.0400390625,
      "text": " We have an advocate with the Father,"
    },
    {
      "id": 130,
      "start": 2174.0400390625,
      "end": 2175.52001953125,
      "text": " Jesus Christ the righteous."
    },
    {
      "id": 131,
      "start": 2175.52001953125,
      "end": 2178.800018310547,
      "text": " It's a wonderful Bible truth."
    },
    {
      "id": 132,
      "start": 2178.800018310547,
      "end": 2180.8400268554688,
      "text": " I've said this many times in this pulpit"
    },
    {
      "id": 133,
      "start": 2180.8400268554688,
      "end": 2183.000030517578,
      "text": " that the truth of 1 John 2,"
    },
    {
      "id": 134,
      "start": 2183.000030517578,
      "end": 2184.8800354003906,
      "text": " that we have an advocate with the Father"
    },
    {
      "id": 135,
      "start": 2184.8800354003906,
      "end": 2186.7200317382812,
      "text": " should cause each of us to rejoice,"
    },
    {
      "id": 136,
      "start": 2186.7200317382812,
      "end": 2191.560028076172,
      "text": " that he never argues your innocence because you're guilty."
    },
    {
      "id": 137,
      "start": 2193.1200256347656,
      "end": 2194.800018310547,
      "text": " He simply says, I paid for it."
    },
    {
      "id": 138,
      "start": 2195.800018310547,
      "end": 2199.6800231933594,
      "text": " And if we confess, according to 1 John 1 and verse number 9,"
    },
    {
      "id": 139,
      "start": 2199.6800231933594,
      "end": 2204.0400390625,
      "text": " he promises to cleanse us and to forgive us."
    },
    {
      "id": 140,
      "start": 2204.0400390625,
      "end": 2205.6400146484375,
      "text": " And we find that this evening,"
    },
    {
      "id": 141,
      "start": 2205.6400146484375,
      "end": 2209.8400268554688,
      "text": " there are some that live in this era"
    },
    {
      "id": 142,
      "start": 2209.8400268554688,
      "end": 2212.1600341796875,
      "text": " in which we're living in of Christianity"
    },
    {
      "id": 143,
      "start": 2212.1600341796875,
      "end": 2215.320037841797,
      "text": " that have this idea that within Christendom,"
    },
    {
      "id": 144,
      "start": 2215.320037841797,
      "end": 2217.320037841797,
      "text": " that you can just live however you wanna live"
    },
    {
      "id": 145,
      "start": 2217.320037841797,
      "end": 2219.0400390625,
      "text": " and you can do whatever you wanna do."
    },
    {
      "id": 146,
      "start": 2219.0400390625,
      "end": 2221.4800415039062,
      "text": " And you're just going to heaven one day"
    },
    {
      "id": 147,
      "start": 2221.4800415039062,
      "end": 2222.9200134277344,
      "text": " and all's going to be fine."
    },
    {
      "id": 148,
      "start": 2222.9200134277344,
      "end": 2226.0800170898438,
      "text": " Listen, understand that we're to walk worthy."
    },
    {
      "id": 149,
      "start": 2226.0800170898438,
      "end": 2227.7200317382812,
      "text": " We're to please God."
    },
    {
      "id": 150,
      "start": 2227.7200317382812,
      "end": 2231.000030517578,
      "text": " Understand this evening that God knows"
    },
    {
      "id": 151,
      "start": 2231.000030517578,
      "end": 2233.4400329589844,
      "text": " about sin in your life and in my life."
    },
    {
      "id": 152,
      "start": 2233.4400329589844,
      "end": 2238.4400329589844,
      "text": " He knew what happened to Joseph."
    },
    {
      "id": 153,
      "start": 2238.52001953125,
      "end": 2241.4400329589844,
      "text": " Though they tried to devise a plan and cover it"
    },
    {
      "id": 154,
      "start": 2241.4400329589844,
      "end": 2242.560028076172,
      "text": " and all that they tried to do,"
    },
    {
      "id": 155,
      "start": 2242.560028076172,
      "end": 2247.4000244140625,
      "text": " all of the extent that they went through, God knew."
    },
    {
      "id": 156,
      "start": 2248.9200134277344,
      "end": 2251.8400268554688,
      "text": " And in due time, God exposed."
    },
    {
      "id": 157,
      "start": 2253.6400146484375,
      "end": 2258.6400146484375,
      "text": " I think as you consider back several messages,"
    },
    {
      "id": 158,
      "start": 2259.6800231933594,
      "end": 2263.8400268554688,
      "text": " when Rachel steals the idols of her father,"
    },
    {
      "id": 159,
      "start": 2266.320037841797,
      "end": 2269.280029296875,
      "text": " Jacob says, let them die."
    },
    {
      "id": 160,
      "start": 2270.4000244140625,
      "end": 2273.1200256347656,
      "text": " He didn't even know that Rachel had them."
    },
    {
      "id": 161,
      "start": 2273.1200256347656,
      "end": 2274.1200256347656,
      "text": " He had no idea."
    },
    {
      "id": 162,
      "start": 2276.4000244140625,
      "end": 2280.52001953125,
      "text": " Her father didn't find the idols because she lied,"
    },
    {
      "id": 163,
      "start": 2280.52001953125,
      "end": 2283.6000366210938,
      "text": " but God knew that she had the idols."
    },
    {
      "id": 164,
      "start": 2283.6000366210938,
      "end": 2286.4800415039062,
      "text": " I preached the message that particular text of scripture"
    },
    {
      "id": 165,
      "start": 2286.4800415039062,
      "end": 2288.4800415039062,
      "text": " is what's in your tent."
    },
    {
      "id": 166,
      "start": 2288.4800415039062,
      "end": 2290.280029296875,
      "text": " Because you know what's in your tent"
    },
    {
      "id": 167,
      "start": 2291.7200317382812,
      "end": 2293.9600219726562,
      "text": " and God knows what's in your tent."
    },
    {
      "id": 168,
      "start": 2293.9600219726562,
      "end": 2296.6400146484375,
      "text": " Your spouse might not know what's in your tent."
    },
    {
      "id": 169,
      "start": 2296.6400146484375,
      "end": 2298.4000244140625,
      "text": " Your parents might not know what's in your tent."
    },
    {
      "id": 170,
      "start": 2298.4000244140625,
      "end": 2300.3600158691406,
      "text": " Your kids might not know what's in your tent,"
    },
    {
      "id": 171,
      "start": 2300.3600158691406,
      "end": 2302.560028076172,
      "text": " but God knows and you know."
    },
    {
      "id": 172,
      "start": 2303.7200317382812,
      "end": 2304.560028076172,
      "text": " Amen."
    },
    {
      "id": 173,
      "start": 2306.0800170898438,
      "end": 2308.0400390625,
      "text": " Notice in Proverbs chapter 30, we'll finish,"
    },
    {
      "id": 174,
      "start": 2308.0400390625,
      "end": 2310.4000244140625,
      "text": " or chapter 28, we'll finish with this tonight."
    },
    {
      "id": 175,
      "start": 2315.9200439453125,
      "end": 2318.9600219726562,
      "text": " Our God pursues and our God works"
    },
    {
      "id": 176,
      "start": 2319.8400268554688,
      "end": 2321.800048828125,
      "text": " because our God is a forgiving God."
    },
    {
      "id": 177,
      "start": 2323.0,
      "end": 2325.2400512695312,
      "text": " You understand this evening"
    },
    {
      "id": 178,
      "start": 2325.2400512695312,
      "end": 2327.6000366210938,
      "text": " that as we enter into a relationship with God,"
    },
    {
      "id": 179,
      "start": 2328.4800415039062,
      "end": 2330.0800170898438,
      "text": " he's our father and we're his children,"
    },
    {
      "id": 180,
      "start": 2330.0800170898438,
      "end": 2332.4000244140625,
      "text": " that he wants our fellowship to be right."
    },
    {
      "id": 181,
      "start": 2333.0,
      "end": 2336.0800170898438,
      "text": " The reality this evening is that for any one of us"
    },
    {
      "id": 182,
      "start": 2336.0800170898438,
      "end": 2338.6800537109375,
      "text": " that would say, I long to be close to God,"
    },
    {
      "id": 183,
      "start": 2338.6800537109375,
      "end": 2341.3200073242188,
      "text": " he desires more for your closeness"
    },
    {
      "id": 184,
      "start": 2341.3200073242188,
      "end": 2343.6400146484375,
      "text": " than we could ever desire for that closeness."
    },
    {
      "id": 185,
      "start": 2345.1600341796875,
      "end": 2347.760009765625,
      "text": " He desires for that fellowship."
    },
    {
      "id": 186,
      "start": 2347.760009765625,
      "end": 2349.4000244140625,
      "text": " And he wants, and we sing the song,"
    },
    {
      "id": 187,
      "start": 2349.4000244140625,
      "end": 2351.52001953125,
      "text": " nothing between my soul and my savior."
    },
    {
      "id": 188,
      "start": 2351.52001953125,
      "end": 2356.2000122070312,
      "text": " And the reality is that our God, he's ready to pardon."
    },
    {
      "id": 189,
      "start": 2356.2000122070312,
      "end": 2358.3200073242188,
      "text": " He's ready to forgive."
    },
    {
      "id": 190,
      "start": 2358.760009765625,
      "end": 2361.0400390625,
      "text": " He's ready to forgive."
    },
    {
      "id": 191,
      "start": 2362.6400146484375,
      "end": 2365.5599975585938,
      "text": " I hope that you can see in your mind's eye"
    },
    {
      "id": 192,
      "start": 2365.5599975585938,
      "end": 2368.280029296875,
      "text": " as you consider those truths of our,"
    },
    {
      "id": 193,
      "start": 2368.280029296875,
      "end": 2369.6000366210938,
      "text": " the character of our God,"
    },
    {
      "id": 194,
      "start": 2369.6000366210938,
      "end": 2371.6000366210938,
      "text": " being ready to pardon and ready to forgive."
    },
    {
      "id": 195,
      "start": 2371.6000366210938,
      "end": 2375.0,
      "text": " God is not standing and standing back and saying,"
    },
    {
      "id": 196,
      "start": 2375.0,
      "end": 2376.4800415039062,
      "text": " nope, I'm not gonna forgive him this time."
    },
    {
      "id": 197,
      "start": 2376.4800415039062,
      "end": 2377.52001953125,
      "text": " I'm not gonna do it this time."
    },
    {
      "id": 198,
      "start": 2377.52001953125,
      "end": 2380.0,
      "text": " God is ready to pardon."
    },
    {
      "id": 199,
      "start": 2380.0,
      "end": 2382.6800537109375,
      "text": " He's a God that is full of compassion."
    },
    {
      "id": 200,
      "start": 2382.6800537109375,
      "end": 2385.4400024414062,
      "text": " He's a God who is full of mercy."
    },
    {
      "id": 201,
      "start": 2385.4400024414062,
      "end": 2389.0800170898438,
      "text": " But the reality is that if we try to cover our sin,"
    },
    {
      "id": 202,
      "start": 2390.6000366210938,
      "end": 2392.6000366210938,
      "text": " we're not gonna prosper."
    },
    {
      "id": 203,
      "start": 2392.6000366210938,
      "end": 2395.5599975585938,
      "text": " The Bible says here in Proverbs 28 and verse number 13,"
    },
    {
      "id": 204,
      "start": 2398.1200561523438,
      "end": 2403.1200561523438,
      "text": " he that covereth his sins shall prosper."
    },
    {
      "id": 0,
      "start": 2403.1200561523438,
      "end": 2411.660056114197,
      "text": " not prosper.\" Can I tell you this evening, you're not going to be the first one to prove"
    },
    {
      "id": 1,
      "start": 2411.660056114197,
      "end": 2423.9800567626953,
      "text": " that verse wrong. You're just not. Amen? God said, He that covereth his sins shall"
    },
    {
      "id": 2,
      "start": 2423.9800567626953,
      "end": 2433.5400562286377,
      "text": " not prosper. Did you ever study the life of David? Did David try to cover his sin?"
    },
    {
      "id": 3,
      "start": 2433.5400562286377,
      "end": 2440.5200576782227,
      "text": " He went through great length to try to cover his sin. Did he not? I mean, he did really"
    },
    {
      "id": 4,
      "start": 2440.5200576782227,
      "end": 2448.3000564575195,
      "text": " everything within his power to cover his sin. But God knew about his sin. God sent a prophet"
    },
    {
      "id": 5,
      "start": 2448.3000564575195,
      "end": 2454.340057373047,
      "text": " by the name of Nathan. Nathan tells him a little story. You know what David's response"
    },
    {
      "id": 6,
      "start": 2454.340057373047,
      "end": 2462.60005569458,
      "text": " is to that story? Let that man die. Yeah. And Nathan stands there and I can see in my"
    },
    {
      "id": 7,
      "start": 2462.60005569458,
      "end": 2471.660057067871,
      "text": " mind's eye the boldness of the prophet of God who said, Thou art the man. But the beautiful"
    },
    {
      "id": 8,
      "start": 2471.660057067871,
      "end": 2478.7000579833984,
      "text": " thing about David is you look in Psalm 51, he didn't continue to try to cover his sin."
    },
    {
      "id": 9,
      "start": 2478.7000579833984,
      "end": 2486.06005859375,
      "text": " He sought the forgiveness of God. In the beginning, he tried to cover his sin. But after the prophet"
    },
    {
      "id": 10,
      "start": 2486.06005859375,
      "end": 2491.780059814453,
      "text": " of God comes and exposes it, he gets it right. We see here the Bible says, He that covereth"
    },
    {
      "id": 11,
      "start": 2491.780059814453,
      "end": 2500.260055541992,
      "text": " his sins shall not prosper. But notice, whoso confesseth and forsaketh them shall have"
    },
    {
      "id": 12,
      "start": 2500.260055541992,
      "end": 2508.56005859375,
      "text": " mercy. I'm thankful for God's mercy. The reality this evening is that all of us have been recipients"
    },
    {
      "id": 13,
      "start": 2508.56005859375,
      "end": 2514.6200561523438,
      "text": " of God's mercy. Our God is rich in mercy. And we find this evening that we could be"
    },
    {
      "id": 14,
      "start": 2514.6200561523438,
      "end": 2520.340057373047,
      "text": " on one side or the other of this verse of Scripture. The reality tonight is that every"
    },
    {
      "id": 15,
      "start": 2520.380058288574,
      "end": 2528.5000534057617,
      "text": " single one of us has sin. Amen? None of us are sinless. Sometimes we might like to think"
    },
    {
      "id": 16,
      "start": 2528.5000534057617,
      "end": 2537.1600494384766,
      "text": " we are. But you're not. And neither am I. So what do we do with our sin? How do we handle"
    },
    {
      "id": 17,
      "start": 2537.1600494384766,
      "end": 2543.540054321289,
      "text": " our sin? Do we cover it or do we confess it? Because really those are the only two options."
    },
    {
      "id": 18,
      "start": 2543.540054321289,
      "end": 2546.6600494384766,
      "text": " And if we cover it, we know that the Bible says we're not going to prosper. But if we"
    },
    {
      "id": 19,
      "start": 2546.6600494384766,
      "end": 2552.9000549316406,
      "text": " confess it, we know that the Bible says that we shall have mercy. Which side of the equation"
    },
    {
      "id": 20,
      "start": 2552.9000549316406,
      "end": 2561.9400634765625,
      "text": " would you like to be on? I'd like to be on the one of receiving mercy. Amen? In Psalm"
    },
    {
      "id": 21,
      "start": 2561.9400634765625,
      "end": 2567.820053100586,
      "text": " 51, I know that I said that we'd end in Proverbs 28, but in Psalm 51, I won't read the entirety"
    },
    {
      "id": 22,
      "start": 2567.820053100586,
      "end": 2574.520050048828,
      "text": " of this Psalm. It's 19 verses. But I want you to see in this portion of Scripture that"
    },
    {
      "id": 23,
      "start": 2574.520050048828,
      "end": 2581.56005859375,
      "text": " David, after his sin is exposed and after Nathan stands and says, Thou art the man,"
    },
    {
      "id": 24,
      "start": 2581.56005859375,
      "end": 2586.520050048828,
      "text": " he did everything he could to cover it, but God knew. Listen, you're going to drive yourself"
    },
    {
      "id": 25,
      "start": 2586.520050048828,
      "end": 2592.320053100586,
      "text": " crazy trying to cover your sin. And you could never do it. You just can't. You say, well,"
    },
    {
      "id": 26,
      "start": 2592.320053100586,
      "end": 2599.9200592041016,
      "text": " I got the wool pulled over their eyes. My parents don't know. God knows. God knows."
    },
    {
      "id": 27,
      "start": 2599.9200592041016,
      "end": 2612.4000549316406,
      "text": " My spouse has no idea. God knows. These ten boys, nine of them, well, yeah, ten of them,"
    },
    {
      "id": 28,
      "start": 2612.4000549316406,
      "end": 2619.1600494384766,
      "text": " for twenty years thought nobody knows what we did with Joseph. No one knows. Dad thinks"
    },
    {
      "id": 29,
      "start": 2619.1600494384766,
      "end": 2628.040054321289,
      "text": " he's dead. He has no idea what happened. God knows. In Psalm 51, the Bible says that David,"
    },
    {
      "id": 30,
      "start": 2628.040054321289,
      "end": 2634.4400634765625,
      "text": " this is his prayer of repentance, have mercy upon me, O God. What a sweet way to start"
    },
    {
      "id": 31,
      "start": 2634.4400634765625,
      "end": 2641.7200622558594,
      "text": " the prayer. Whoso confesseth shall have mercy. We just read it in Proverbs 28. According"
    },
    {
      "id": 32,
      "start": 2641.7200622558594,
      "end": 2648.800048828125,
      "text": " to thy lovingkindness, aren't you thankful that our God is merciful, his lovingkindness?"
    },
    {
      "id": 33,
      "start": 2648.800048828125,
      "end": 2655.520050048828,
      "text": " According unto the multitude of thy tender mercies, blot out my transgressions. Wash"
    },
    {
      "id": 34,
      "start": 2655.600051879883,
      "end": 2663.2000427246094,
      "text": " me, notice what he says, throughly from mine iniquity, and cleanse me from my sin. For"
    },
    {
      "id": 35,
      "start": 2663.2000427246094,
      "end": 2670.040069580078,
      "text": " I acknowledge my transgressions and my sin is ever before me. Against thee, thee only,"
    },
    {
      "id": 36,
      "start": 2670.040069580078,
      "end": 2676.280059814453,
      "text": " have I sinned and done this evil in thy sight, that thou mightest be justified when thou speakest"
    },
    {
      "id": 37,
      "start": 2676.280059814453,
      "end": 2683.040069580078,
      "text": " and be clear when thou judgest. I don't have time to read the entirety of the psalm. But"
    },
    {
      "id": 38,
      "start": 2683.040069580078,
      "end": 2687.8800659179688,
      "text": " I want you to understand this evening, as we look at an account in Genesis 43 and 44,"
    },
    {
      "id": 39,
      "start": 2687.8800659179688,
      "end": 2692.080047607422,
      "text": " you can look at what Joseph did and how he instructed his steward and what have you."
    },
    {
      "id": 40,
      "start": 2692.080047607422,
      "end": 2701.320068359375,
      "text": " God was working. God was pursuing those brothers, those men. And God brought Judah to a place"
    },
    {
      "id": 41,
      "start": 2701.320068359375,
      "end": 2710.1200561523438,
      "text": " of brokenness. That Judah, he came to the place and said, let Benjamin go, I'll take"
    },
    {
      "id": 42,
      "start": 2710.1200561523438,
      "end": 2718.520050048828,
      "text": " the punishment. And I just wonder tonight, as we think about that picture of brokenness"
    },
    {
      "id": 43,
      "start": 2718.520050048828,
      "end": 2723.9600524902344,
      "text": " and we understand that in this same psalm, in Psalm 51, in verse 17, it says, the sacrifices"
    },
    {
      "id": 44,
      "start": 2723.9600524902344,
      "end": 2735.080047607422,
      "text": " of God are a broken spirit, a broken and a contrite heart, O God, thou wilt not despise."
    },
    {
      "id": 45,
      "start": 2735.080047607422,
      "end": 2741.8800659179688,
      "text": " Then in verse 19, shalt thou be pleased with the sacrifices of righteousness with burnt"
    },
    {
      "id": 46,
      "start": 2741.8800659179688,
      "end": 2748.56005859375,
      "text": " offering and whole burnt offerings, then shall they offer bullocks upon thine altar. You"
    },
    {
      "id": 47,
      "start": 2748.56005859375,
      "end": 2755.7600708007812,
      "text": " can try to do all kinds of outward things, but if your heart's not right, God's not pleased."
    },
    {
      "id": 48,
      "start": 2755.7600708007812,
      "end": 2760.1200561523438,
      "text": " You can read it of the nation of Israel, you can read it of Judah. You know what God says"
    },
    {
      "id": 49,
      "start": 2760.1200561523438,
      "end": 2767.7200622558594,
      "text": " to Israel and Judah about their sacrifices? Stop bringing them. Just stop bringing them."
    },
    {
      "id": 50,
      "start": 2767.7200622558594,
      "end": 2772.0000610351562,
      "text": " You say, but God's the one that instructed them to bring them. Sure He is, with a right"
    },
    {
      "id": 51,
      "start": 2772.0000610351562,
      "end": 2779.0000610351562,
      "text": " heart. He said, you draw nigh to me with your lips, but your heart's far from me. And God"
    },
    {
      "id": 52,
      "start": 2779.0000610351562,
      "end": 2783.4800415039062,
      "text": " said, stop bringing those sacrifices, get your heart right. It's not about going through"
    },
    {
      "id": 53,
      "start": 2783.4800415039062,
      "end": 2791.1600646972656,
      "text": " the motions, it's not about doing outward things. God said, a broken spirit, a broken"
    },
    {
      "id": 54,
      "start": 2791.1600646972656,
      "end": 2796.7600708007812,
      "text": " and a contrite heart. God worked in the lives of those brethren."
    },
    {
      "id": 55,
      "start": 2796.7600708007812,
      "end": 2805.0000610351562,
      "text": " That second trip to Egypt, it was an important trip. They don't make it back home until after"
    },
    {
      "id": 56,
      "start": 2805.0000610351562,
      "end": 2809.56005859375,
      "text": " Joseph reveals his identity in chapter 45. We'll look at that next week. But I want you"
    },
    {
      "id": 57,
      "start": 2809.56005859375,
      "end": 2813.9200439453125,
      "text": " to just think about it tonight. Is there anything between my soul and my Savior? Is"
    },
    {
      "id": 58,
      "start": 2813.9200439453125,
      "end": 2821.9600524902344,
      "text": " there sin in my life? We're all sinners. Are we covering? Are we confessing? Do we understand"
    },
    {
      "id": 59,
      "start": 2821.9600524902344,
      "end": 2827.2000427246094,
      "text": " the equation as Proverbs 28, as I reference it that way tonight? If we're covering, we're"
    },
    {
      "id": 60,
      "start": 2827.2000427246094,
      "end": 2835.2000427246094,
      "text": " not going to prosper. You say, nobody knows. God knows. That ought to convict you. And"
    },
    {
      "id": 61,
      "start": 2835.2000427246094,
      "end": 2839.9600524902344,
      "text": " when you understand His mercy and His loving kindness, it ought to cause you to throw yourself"
    },
    {
      "id": 62,
      "start": 2839.9600524902344,
      "end": 2847.2400512695312,
      "text": " on the altar of God and say, God, have mercy. Against thee and thee only have I sinned and"
    },
    {
      "id": 63,
      "start": 2847.2400512695312,
      "end": 2852.1200561523438,
      "text": " done this wickedness in thy sight. And God said, He'll forgive you and He'll cleanse"
    },
    {
      "id": 64,
      "start": 2852.1200561523438,
      "end": 2857.2400512695312,
      "text": " you. That's a wonderful promise of God's Word. You try to dance around and say, I'm not really"
    },
    {
      "id": 65,
      "start": 2857.2400512695312,
      "end": 2864.320068359375,
      "text": " the guilty one, I'm innocent, I'm this, I'm that. No, no, no. Just acknowledge your guilt."
    },
    {
      "id": 66,
      "start": 2864.320068359375,
      "end": 2869.320068359375,
      "text": " God already paid for it and He'll forgive. Let's pray. Father, we love You. Thank You"
    },
    {
      "id": 67,
      "start": 2869.320068359375,
      "end": 2879.280059814453,
      "text": " for loving us. God, thank You for this passage of Scripture, two chapters, and we see the"
    },
    {
      "id": 68,
      "start": 2879.280059814453,
      "end": 2889.4800415039062,
      "text": " events and we can look at the account historically. God, I pray for each of us tonight to make"
    },
    {
      "id": 69,
      "start": 2889.4800415039062,
      "end": 2895.4800415039062,
      "text": " some application in our lives. God, I'm not sure tonight how You're working in the hearts"
    },
    {
      "id": 70,
      "start": 2895.4800415039062,
      "end": 2903.56005859375,
      "text": " of Your people, but God, I pray that You'd have Your will and way. I pray that we'd be"
    },
    {
      "id": 71,
      "start": 2903.56005859375,
      "end": 2911.4400634765625,
      "text": " humble. Lord, I pray that if there's sin in our lives, that we'd confess it and forsake"
    },
    {
      "id": 72,
      "start": 2911.4400634765625,
      "end": 2919.2000732421875,
      "text": " it. God, if someone's trying to cover, hide their sin, I pray, God, that You would help"
    },
    {
      "id": 73,
      "start": 2919.2000732421875,
      "end": 2930.1200561523438,
      "text": " them to understand the futility of that endeavor. They just wave the white flag of surrender"
    },
    {
      "id": 74,
      "start": 2930.1200561523438,
      "end": 2937.8400268554688,
      "text": " and get their heart right with You. I pray that in these moments of invitation that You'd"
    },
    {
      "id": 75,
      "start": 2937.8400268554688,
      "end": 2942.1200561523438,
      "text": " have Your will and way. We'll thank You for it. Would You stand with me?"
    }
  ],
  "processed_at": "2025-04-15T10:03:37.771241"
}