{
  "video_id": "6jkKQL6IlWQ",
  "text": "Genesis chapter number 15, and we have been studying through the book of Genesis for quite a while. I don't know exactly how long I could look in my notes and tell you, this is lesson 43, I know that. And the very first lesson that we had, if I scroll through my notes here, was back on March 10th, 2019. And so we've been going through the book of Genesis, making progress as we've gone through. Of course, we haven't been every single Sunday evening in the book of Genesis. We've taken a few off, but we'll finish up chapter number 15 this evening. And if you think about the 15th chapter of the book of Genesis, you find that there's really a continuation of a dialogue, a meeting, that God gives us a record of between the Lord and Abram. And we find that as we really focused upon the first verse in our first study of Genesis 15, and really the way in which Abram was greeted by the Lord and God told him to fear not. And he said, I am thy shield, thy exceeding great reward. Last Sunday evening, we looked at verses two through six. And in that text of scripture, we dealt with the fact that Abram comes to the Lord and says to me, thou hast given no seed. And of course, we find that God begins to provide a record to Abram and Abram's perspective is revealed to us as he says, here's the problem, here's a potential solution, Eleazar, one that's born in mine house. And God says, no, and he gives him very specific instruction with regard to the promise. And that explanation is provided, and of course, the promise is embraced. As we continue to move through the 15th chapter of the book of Genesis, really, we are given further insight detail with regard to the Abrahamic covenant as we'd often refer to it. And we find that here in this passage of scripture, there's some time that lapsed, not much, but we do see the days that go on. You'll recall from our study last week that it was in verse number five, as the Lord is giving the promise to Abram, he brings him out and he says, look up toward heaven. And he tells him to look at the stars. And so we see it would be evening, he's looking at the stars and we made note of those things. And of course, God gives them the promise with regard to his seed. And then we find in verse number 12, the Bible says when the sun was going down. And so there's another day that is unfolding here throughout this process, this dialogue, this meeting, if you will. And this conversation will continue. And as we look at the passage, I want you to notice the statement in verse number 18, where the Bible says on the same day, the Lord made a covenant with Abram. And so I've titled the message this evening, the Lord made a covenant with Abram. We'll be looking at verses seven down through verse number 21. And as we dig into the passage this evening, I want you to notice with me first of all, what is requested. Notice what is requested as we begin to look at this passage and we see how that in verse number one, God comes and this message is given to Abram in a vision. And then Abram speaks to God and God responds to Abram and so on and so forth. And we find that in verse number six, that as we finished up last week, it says he believed in the Lord and he counted it to him for righteousness. That was of utmost importance as we looked at that verse and seeing the faith of Abram and believing what God said would come to pass. And we find in verse number seven, it says, and he said unto him, I am the Lord that brought thee out of the Ur of the Chaldees to give thee this land to inherit it. And so we find that God is now speaking to Abram again in verse number seven. And he tells him, it's interesting. He says, I am the Lord that brought thee out of the Ur of the Chaldees. And so we'd go all the way back to chapter number 11 and 12 and begin to see that call of Abram that God extends and how Abram would leave the Ur of the Chaldees and he would go on this journey, of course, eventually coming to the place where God had told him to travel to. And we find that he's saying, I am the Lord that brought thee out of the Ur of the Chaldees to give thee this land to inherit it. So as we look at the passage of scripture and we've understood over the last several chapters of studying the life of Abram, that the promise to Abram really is twofold. There's the aspect of the seed and there's the aspect of the land. Last week, we really focused upon the seed portion of the promise. This evening, we'll see that the focus now will shift and not so much be with regard to the seed as much as it is with regard to the land. We see that in verse number seven where God ends that verse of scripture by saying, to give thee this land to inherit it. And he said unto him, excuse me, go back to verse number eight. And he said, this is now Abram talking to the Lord. He says, Lord God, whereby shall I know that I shall inherit it? And so this is what we find when we notice what is requested in verse number eight, Abram is requesting a sign. He is requesting, he says, he hears what God says to thee this land or to give thee this land to inherit it. And in verse number eight, Abram is saying to the Lord, whereby shall I know that I shall inherit it? Now it's interesting because when we're speaking about the seed in our previous message, we find that Abram comes and he says, you've not given me any seed. I understand this promise that's been given. I have no seed. Lo, one born in my house is mine heir. And what does God do? God says, no, that's not the way it's going to work. He tells him in verse number four, this shall not be thine heir, but he that shall come forth out of thine own bow shall be thine heir. And then what does God do? He gives him a, it really goes and gives him this picture of let's go out, look toward the heavens, see the stars. And so as God would give him and tell him to look to the stars, if thou be able to number them, and he said unto him, so shall thy seed be. And so now the same God is saying to Abram, by the way, I've brought you out of the earthy Caldes to give you this land. And Abram saying, okay, what is the sign with regard to the inheritance of the land? And so he's requesting this sign. It is interesting as we find that Paul is writing to the believers in Corinth. And in first Corinthians one and verse 22, he says that the Jews require a sign. And that's interesting as it would go all the way back even to Abram and asking the Lord in this very passage of scripture, of course, many times the Hebrews, Jewish folks, Father Abraham, and they understand their ancestry and so on and so forth. And we find that he's asking, he's requesting this sign. He says, whereby shall I know that I shall inherit it? And so we notice what is requested. I now want you to notice what is required. In verses nine through 11, God is going to give some specific requirements to Abram, specifically in verse number nine. And we see how Abram will respond to that which is required. In verse number nine, God said to Abram, it says, and he said unto him, take me an heifer of three years old and a she goat of three years old and a ram of three years old and a turtle dove and a young pigeon. It is interesting as we look at verse number nine and we begin to consider this evening what is required when this request is made by Abram with regard to this sign. What is it that you'll give me that I know that I shall inherit the land? God gives him some very detailed instruction. He tells him to get an heifer of three years, a she goat of three years, a ram of three years, a turtle dove and a young pigeon. And very detailed, very specific. Our God is a God of order in detail. And we find that throughout the whole of scripture. And we find that the action of Abram in verse number 10 is immediate obedience. We see the detailed instruction followed by the detailed action where the Bible says this in verse number 10, and he took unto him all these. Aren't you thankful for the obedience that we read of in the life of Abram? Our God, we understand as we study the scriptures, there is a principle of obedience throughout the word of God in that our God blesses obedience. And we find here that Abram did as the Lord had commanded him. He took unto him all these. Notice it was not partial obedience. He did not say, well, this will work or I could do it this way. No, Abram gets the detailed instruction. And we find that there's detailed action on the part of Abram, this immediate obedience. It says this, that he divided them in the midst and laid each piece one against another, but the birds he divided he not. And so in your mind's eye, you can see there's some land here. He takes these animals with the heifer, the she goat and the ram. He divides them in half. He lays one over here aside from each other. So as he divides the heifer half here, half here, so on and so forth with the she goat and the ram, the turtle dove and the young pigeon, he did not divide. Now, the significance of this is that this was a common custom of the day for those making a covenant. It's not something that we're accustomed to as believers living in 2020. You've made some agreements with people and I'm guessing you probably never divided some animals and put them apart from one another and so on and so forth. And so we have different means in which we make covenants or agreements one with another today, but this was a very custom, common custom, excuse me, during this particular era. And we find what would happen is the parties that are making this agreement or this covenant, the two parties, they would pass in between those divided animals and as they would pass in between what they were doing is. symbolically, they were saying this is the fate of either party that would break the covenant. In other words, if I make a covenant with you, we go through this common practice, this custom, we go through, we walk through these divided animals. If I then break the covenant, I'm to be cut asunder. That's basically what is being communicated. And so we find that this was a common custom, and it's important that we understand that because as we look at the passage of Scripture and we understand the era in which this is happening, we understand the custom, and then we understand actually what happens in just a few verses in the significance of the covenant based upon the action that is taken. And so it's very important that we understand that. Notice in verse number 11, the Bible says this, and when the fowls came down upon the carcasses, Abram drove them away. And so this was a long process. We find that the Bible says in verse 12, when the sun was going down, and so from the time in which Abram would cut asunder these animals and place them out, no doubt those birds, the scavenger fowls, they would come down and try to eat upon that which had been divided, and Abram would spend the majority of that day driving away those fowls, as the Bible tells us there in verse number 11. As we look here at what's taking place, it's important that we, again, understand the detail in which God is giving us. And we find that this man, Abram, makes this request and then God gives this requirement. The significance of those two things that are mentioned in the beginning of this passage really begin to unfold in an amazing way as we look at the latter portion of Genesis 15. We look at verses 12 through 21, and I would say this, as we've noticed what's requested and required, we now will notice what is revealed. And this is the bulk of the message this evening, as we see the significance of that which God would reveal to Abram during this particular time, and of course being recorded for us in the Word of God, so that we'd understand this Abrahamic covenant. These details are provided to Abram. Notice it says in verse number 12, \"...and when the sun was going down, a deep sleep fell upon Abram, and lo and horror of great darkness fell upon him. And he,\" God, of course, is the he that is being referred to, \"...said unto Abram.\" Now, notice as we look at these verses of Scripture, and we consider that which will be revealed to Abram, we see first of all that God will reveal some truth with regard to the events that would lead to the possession of the land. It goes back to what God said in verse number 7, \"...to give thee this land to inherit it.\" And right, so we find that the the context of what we're dealing with is God has said to Abram, I'm gonna give you this land. Abram says, what is the sign that you're going to give me that I know this? And God is going to lay out the details in these verses of Scripture with regard to his plan. It reveals to us some amazing things with regard to our God. He's omniscient. He knows all things. He's eternal. He knows the end from the beginning. He's going to speak to Abram in these verses of Scripture, just a few verses. He's gonna speak to him about events that would take place centuries later, and he deals with them in detail. Why? Because our God is eternal. He is Alpha and Omega, the the beginning and the end, the first and the last. And so we find here that God begins, as he's gonna speak to Abram in verse number 13, notice what he says, \"...know of a surety.\" Now it's interesting, as we study the Word of God, we understand that God wants us to know some things. He wants us to be aware of what his plan is. He wants us to have confidence in what he has said. We looked at it this morning as we were studying there in 2 Chronicles, in the life of Jehoshaphat, king of Judah, and that great event that is recorded in chapter number 20 with regard to the coalition and all of those things, and how that Jehoshaphat was aware of what God had promised, what God had said, and in simple faith he believed God. See, God wanted Jehoshaphat and others to know what he had told Solomon years earlier, and he's given us his Word this evening, and throughout the Scriptures we understand that God has said that there are some things that we need to know, that we can have confidence in, that we can be sure of. Notice what it says, \"...know of a surety that thy seed shall be a stranger in a land that is not theirs.\" Now it's interesting because now we begin to see the reference to the seed and also to the land. Remember as we dealt with the seed last week, the first aspect of this promise that had been given to Abram, that he gives them the details with regard to the seed, and we followed that throughout the New Testament, the book of Galatians specifically, and now in answering the question with regard to the land, God says to Abram that, \"...thy seed shall be a stranger in a land that is not theirs, and shall serve them, and they shall afflict them four hundred years.\" And so here, as we begin to think about the events that would lead to the possession of the land, God in Genesis chapter number 15 is giving truth to Abram with regard to the Egyptian bondage. Now we understand that's going to happen many years from this event that we see. It's going to be 25 years before Isaac is even born, the promise of the seed. And now we find that hundreds of years are now in view with regard to the possession of the land and some events that would lead to the possession of the land. And so we see the the reference to the Egyptian bondage here in verse number 13. We see in verse number 14, it says this, \"...and also that nation whom they shall serve will I judge, and afterward shall they come out with great substance.\" Now does that sound familiar to you as to what takes place during the Passover, right? And we read about the Passover, the tenth plague. We understand that as the children of Israel were serving there in Egypt, as they were slaves, and there arose that Pharaoh that knew not Joseph, so on and so forth, and we find that God would raise up Moses and Aaron, and they would stand before the Pharaoh, and there were great plagues to demonstrate the power of God. And we find that after that tenth plague, the Passover, that the children of Israel were delivered. Yes, the Egyptians were judged, and they left with great substance. Notice with me, hold your place here in Genesis, and turn to the book of Exodus, if you will, in Exodus chapter number 12. So not only do we see here in Genesis chapter number 15 a reference to the Egyptian bondage, but also to the Exodus. We find in Exodus chapter number 12, excuse me, in Exodus chapter number 12, notice in verse number 40. Let's look in verse number 40. The Bible says this, Now the sojourning of the children of Israel... I'll give you a moment, I hear some pages turning. Verse number 40, Now the sojourning of the children of Israel who dwelt in Egypt was four hundred and thirty years. And it came to pass at the end of the four hundred and thirty years, even the selfsame day, it came to pass that all the hosts of the Lord went out from the land of Egypt. And we find here in Exodus chapter number 12, the reference with regard to the departure. Now you will note, and I think it's of significant importance, because we find in Genesis chapter number 15, in verse number 13, that the years, the number that is used is 400 years, and here in Exodus chapter number 12, the number that is used is 430 years. In fact, if you look at the New Testament, you'll find the book of Acts in chapter number 7, it references 400 years, and the book of Galatians in chapter number 3, it references 430 years. You say, Pastor, why are you telling us all of this? Because here's what happens. Mockers and scoffers want to tell you that there's an error in the Bible. They want to tell you that. And they'll look at something like this and say, is it 400 or 430? Because your Bible says both. The answer is yes. It's both. How is it both? Well, here's the importance, right? Here's what, so some Bible, if you disagree with me, there's a lot of theologians that disagree with what I'm gonna tell you, and I don't, I'm not trying to say that someone's right, wrong. I'm trying to simply give you a Bible answer based upon my own study of the scriptures of what I believe God is giving us in His Word with regard to these years. Some simply just kind of skim over it by saying this, well, 400 is kind of a round number for 430. And they just try to explain it away real easy. Well, if that's okay for you, then fine, but I don't like that answer. Because I believe that every word of God is pure. Amen? And so if God is a God of detail, and He is, then there's some significance between this 400 and this 430. We have a difference of 30 years, and what could that be? I believe specifically that the 400 years is in reference to Isaac, okay? That's the seed, right? Abram has been given the promise with regard to the seed. There's the seed and the land, and God is giving this promise with regard to Isaac, and the time of Isaac, from the time in which he would be weaned until the time of the Exodus, would be 400 years. And we find that... that difference. Notice in verse number 13 again of chapter number 15 of the book of Genesis, he says, \"...know of a surety that thy seed shall be a stranger in a land that is not theirs, and shall serve them, and they shall afflict them four hundred years.\" Again, the reference of seed, I believe, dealing with Isaac. And so from Isaac, if you include from his time of weaning, if you will, to the time of the exodus, there would be that 400 years. And then you look at the 430 years, and you begin to think about Abram himself. And the reality is that Abram had left the Ur of the Chaldees, if you remember, here at this particular time in which Abram is dealing with these things. According to chapter number 12, where the call and the promise was initially given, he was 75 years old. So 75, and then when is Isaac going to be born? Well, Abram's going to be 100. So there's 25 years. The time of weaning obviously is different in our society culture than it was in biblical times, but it's very common for them to say that a time of a child being weaned was five years old. So if you take 25 years from the age of Abram at 75 to the time of 100 when Isaac was born, there's 25 years. The time of weaning being five years, there's your 30 years. The difference between 400 and 430, there's not a discrepancy in the Word of God. The question is, what timeline are we starting? What's the starting point? Is the starting point the time of Isaac, or is the starting point the time of Abram? If it's Abram, it's 430 years. If it's Isaac, it's 400 years. Does that make sense? And so we begin to study the Word of God, we begin to compare Scripture with Scripture, and you find that there is, I believe, an answer in the Word of God with regard to these things. It's interesting because, again, sometimes people just simply try to skim over it, excuse it, and say, well, it's just a round number, so on and so forth. There are other types of examples that we could look to this evening. We won't take the time to do so for the sake of our study here in Genesis 15, but what I would say to you is that there are many scoffers out there that seek to attack the Word of God. This is nothing new. We understand that from the very beginning, in Genesis chapter number 3, that the enemy, Satan, says, yea, hath God said. And he begins to question the authority of God's spoken Word, so no doubt the enemy is going to question the authority of God's written Word. And what does he do? Why do these scoffers attack and try to dig in and tell us that there are errors and discrepancies? I believe that if they can be successful in doing so, that it puts doubt in the mind of the individual to say, how can I know if it's true or not? And ultimately, that's what Satan wants to do. Satan wants to have people come to a place where they say, I can't trust this book. And there are people that you can come in contact with, no doubt, that will laugh at you, will mock when you say that you're a Bible believer, when you say, well, the Bible says, because they have believed, they've been blinded by the enemy, and they believe the lie of the enemy. So I would say this evening, when someone asks me, is it 400 or 430 years? Yes, it depends where the starting point is. And if we're starting with Abram, then it's 430. If we're starting with Isaac, it's 400. And so that's just kind of a side note. It's for free. If you don't like it, you don't have to have it. They gave me some beans at lunch yesterday. I didn't want them. They just kind of took them away, you know. But that's for free this evening. I believe that it's a valid explanation of the Word of God as you study and compare Scripture with Scripture. Notice, so we see these things that are revealed to Abram with regard to the events leading to the possession of the land. There's also events that are going to be revealed, as we're noticing what is revealed, with regard to the death of Abram. Notice what God says in verse number 15, and thou, now he's speaking directly to Abram. He's speaking in verse 13 and 14 about his seed and about the land that they would be a stranger in before they would possess the land, how they would leave during the exodus. In verse 15, he changes attention back to Abram and says, and thou shalt go to thy fathers in peace. Thou shalt be buried in a good old age. So now, Abram is getting, God is speaking directly to Abram with regard to revealing details about his death. If you look over, hold your place here, turn to the book of, excuse me, to chapter 25 in Genesis, and look in chapter 25 in verse number 7, you'll notice that certainly Abram was buried at a good old age. The Bible says in Genesis 25 in verse number 7, and these are the days of the years of Abraham's life, which he lived, and hundred, threescore, and fifteen years. That's 175 years old. That's a good old age. And we understand that as we look here after the flood, and we've made note of this through our study of the book of Genesis, that the patriarchs, obviously, prior to the flood, they had very long lifespans. It begins to decrease, and it decreases pretty rapidly after the flood, and just all of the catastrophic impact to not only the earth and all of the geological things that took place, but also just the environment itself. You get to the end of the book of Genesis, and you read about the death of Joseph, and he lived to be 110 years old. And then eventually you get to where God speaks to Moses about the threescore and ten and so on and so forth, if by reason of strength, fourscore. And here, Abram is given this truth from God with regard to his departure, his death, that he would be buried in a good old age of 175 years. Again, in sight is the fact that our God is eternal, that our God is omniscient, that he's able to give truth to Abram with regard to his own death. Notice with me also that God reveals information to Abram with regard to the judgment upon the inhabitants of the land. We see that in verse number 16. It says, but in the fourth generation they shall come hither again, for the iniquity of the Amorites is not yet full. It's an interesting reference. You begin to look in verses 19 through 21, and you begin to see the other groups of people that are mentioned, the Kenites, the Kenizzites, the Kadmonites, the Hittites, the Perizzites, the Rephaims, the Amorites, the Canaanites, the Gergesites, and the Jebusites. And you find here that the Amorites are mentioned specifically in verse number 16 about this fourth generation, again, this time period in which they would come again. And he says that the iniquity of the Amorites is not yet full. It's interesting because the judgment would come upon the inhabitants of the land. This year, during the shutdown and all that was going on, I taught through the book of Joshua. We had those daily lessons that we sent out. And one reference that I made to you often throughout the book of Joshua is the fact that those inhabitants of the land were being judged because of their wickedness. And God had given warning to his people, to Joshua and the children of Israel, to be careful about their walk with God and their obedience to the revealed Word of God, lest they also be judged. And so we find here that he says that the iniquity of the Amorites is not yet full. In other words, God knew because he's omniscient and he's eternal, he knew the timing of what was going to happen. But really, I believe that as he says it's not yet full, that God had given them some space, if you will, some time to repent. But the inhabitants of the land, they never repented. They continued to go and serve idols and live in their wicked behavior. And we find that they eventually would be judged. And our God, of course, is the judge. And we understand that. He's gracious and he's merciful, but he is the righteous judge. And we understand this evening that as we think about the end times, and we think about the judgments, that as the people of God, if you've been born again, you've trusted Christ as your Savior, that you'll stand at the bema seat of Christ, the judgment seat of Christ. But for those that have not trusted Christ as their Savior, they will stand at the great white throne judgment, as is revealed to us in Revelation chapter number 20. And so here, God is referencing the judgment that would come upon the inhabitants of the land. We can read of all of those events. Of course, after the Exodus and before the conquering of the land, you have the wilderness wanderings. That was never what God's plan was for the nation of Israel. But because of their doubt and unbelief, that generation would die in the wilderness. Now, we get here as we wrap up the 15th chapter of the book of Genesis, we now come to this, what is being revealed with regard to the details of the covenant that God is making with Abram. And so we see that he's revealed several things, and now he's coming back to what the passage started with that we're looking at this evening. When Abram says to God, after God says to give thee this land to inherit it, at the end of verse number 7, that Abram then says, Lord God, whereby shall I know that I shall inherit it? And so God revealed these things to him, and now God is going to give him this sign, and he's going to give us details with regard to the covenant. Notice in verse verse number 17, and it came to pass that when the sun went down and it was dark. We notice that in verse number 12 it says when the sun was going down. Now the Bible tells us in verse number 17 that the sun went down and it was dark. Notice what it says, behold a smoking furnace and a burning lamp that passed between those pieces. What are the pieces? Well those are the animals that had been, God had given that detailed instruction with regard to that which was to be brought as we looked in verse number 9, and heifer of three years old, a she goat of three years old, a ram of three years old, a turtle dove and a young pigeon, and they had been divided and set in the midst, and so the Bible tells us in verse number 17 that passed between those pieces. Now remember I mentioned to you that the common custom of the day was that both parties that were involved in making the covenant or the agreement would pass through those pieces that had been divided. So both parties would pass through signifying that the covenant is being established and symbolically saying if I break the covenant then it is for me to be divided asunder. And so we find here in verse number 17 that the manifestation of God passing through is a smoking furnace and a burning lamp and it says that it passed between those pieces. What's the significance? Well the significance is that this Abrahamic covenant, as we often refer to it as, is an unconditional covenant. This is based upon the goodness, the grace and mercy of God. This covenant that is being made has nothing to do with Abraham, it has everything to do with God. And that's important, it's significant for us to understand that as we think about promises in the Word of God, there are conditional promises and there are unconditional promises. Some of the conditional promises, some of the most common conditional promises are ones that would be categorized as being if-then. If you do this, then God will do this. That's a conditional promise. God's action is a response to our action. If you do this, then this is what God's going to do. In fact, you could read Proverbs chapter number two and you'll see a whole list of them at the beginning of the second chapter of the book of Proverbs. If-then, if-then, you'll read right through it and you'll see a number of them. And so those are scattered, littered throughout the Word of God and we find also there are unconditional promises. This covenant that God has made, the significance of the manifestation of God through this smoking furnace and this burning lamp passing between the pieces would signify for us this evening that this is an unconditional covenant. This is a promise that God is making to Abraham with regard to that which had been promised. Remember, he says, to give thee this land to inherit it and Abram says to God, whereby shall I know that I shall inherit it? And so God then passes through those pieces, the manifestation of such as we've mentioned already, and he passes through. Abram himself, he did not pass through. Why? Because God is the one making the promise. Now, keep that thought and look at a few verses with me in the preceding chapters. Actually, let's read verse 18 and then we'll do that. In the same day, the Lord made a covenant with Abram, saying, unto thy seed have I given this land, from the river of Egypt unto the great river, the river Euphrates, the Kenites and the Kenizzites and the Kadmonites and the Hittites and the Perizzites and the Rephaims and the Amorites and the Canaanites and the Gergesites and the Jebusites. We see in verse number 18 where we received our title for our message this evening that in that same day, the Lord made this covenant with Abram and notice what he said, unto thy seed have I given this land. Abram says to God in verse number eight, God, whereby shall I know that I shall inherit it? What is it? The land, as it's mentioned in verse number seven, to give this land, to give thee this land to inherit it. And so God then answers that request that Abram made at the beginning of our study this evening. He passes through giving Abram the sign that this is the sign, I've made this covenant, this promise with you that I now am telling you I have given this land to your seed. Now it's interesting because now we're speaking in terms that it's already settled. It says unto thee have I given this land. Prior to this verse of Scripture, everything that is spoken of with regard to the land is spoken of in future. I'm going to give this to you. Now he says I have given you this land. Notice with me, turn back if you will to chapter number 12. We did this last week as we looked at the promise with regard to the seed, but look at it now as the passage in Genesis 15 shifts from seed to land. We find in verse number seven of Genesis 12, the Bible says, and the Lord appeared unto Abram and said, unto thy seed will I give this land. That's future, correct? Will I give this land? And there builded he an altar unto the Lord who appeared unto him. Abram then responded to that promise by worshiping the Lord. We see in chapter number 13, look in verse number 15. This is after the division between Abram and Lot. And we know that Lot went toward the plain and pitched his tent towards Sodom. And the Lord then says to Abram in verse number 14, he says this, and the Lord said unto Abram, after that Lot was separated from him, lift up now thine eyes and look from the place where thou art northward and southward and eastward and westward for all the land which thou seest to thee will I give it and to thy seed forever. We see again in verse number 17, it says, arise, walk through the land and the length of it and in the breadth of it, for I will give it unto thee. In chapter number 15, as we started our message this evening in verse number seven, God says to Abram and he said unto him, I am the Lord that brought thee out of Ur of the Chaldees to give thee this land to inherit it. And now Abram says, God, in verse number eight, he's asking for that sign. That's what's requested. Whereby shall I know that I shall inherit it? And God goes through this, what was a common practice, a custom in that particular day in those making covenants and God himself, the manifestation through the smoking furnace and the burning lamp, he passes through those pieces and he says to Abram, unto thy seed have I given this land. What a great promise that God gives to Abram on this particular day. Now we understand the significance of the Abrahamic covenant. We understand that here the specifics are given with regard to the territory. He says there at the end of verse number 18, from the river of Egypt unto the great river, the river Euphrates. He then lists out a number of people groups that are mentioned in verses 19 through 21. And we find this significance with regard to the territory that God has given. As we've looked at this 15th chapter and we dealt with the two aspects of the Abrahamic covenant, we see first of all the seed and we understand the birth of Isaac that would come later on here in the book of Genesis as we begin to read about that miraculous birth and how God was fulfilling the promise that he made to Abram and Sarah. And we see that in chapter number 21. But of course we understand the fullness of that Abrahamic covenant and that promise with regard to the seed is the Lord Jesus. We find that Paul mentions that in the book of Galatians. If you want to take a moment to turn there, we referenced this last week briefly and we'll reference it again this evening. We see in Galatians chapter number 3 that as the reference to Genesis chapter number 15 in verse number 6 is seen in Galatians 3 and verse number 6. The Bible says even as Abraham believed God and it was accounted to him for righteousness. And we find it in verse number 16 of Galatians 3. It says, Now to Abraham and his seed were the promises made. He saith not unto seeds as of many, but as of one, and to thy seed, which is Christ. And so we understood as we studied through the 15th chapter of the book of Genesis over these last few weeks and really over the last few chapters of the book of Genesis that this promise has been given to Abram and it's a seed and it's a land and we focus upon that seed and we see that as Christ. Now you understand as you go from this portion of scripture in Genesis 12 through 15 and look at how God zeros in. Remember he starts in Genesis with creation. He looks at the creation of man, all of the different groups of people. You see the tower of Babel, the spreading of the people and so on and so forth. And then God zeros in upon Abram and the Hebrew people and that will be the direction in which the book of Genesis and really all of scripture begins to travel. There are references that are provided to us with regard to other people groups as they interact with God's people. But why? What's the significance? Well, that's the seed. That's where Messiah would come from. come through the line the messianic line and the significance of all that you read of and you think about the spiritual warfare that were engaged in the spiritual battles that Satan has spent all of those years as recorded in the Old Testament to try to defile and destroy that line so that that Messiah would not be able to come. Why is it that that Haman so hated Mordecai? Was it just because of Mordecai? Why was it that Haman wouldn't be satisfied with simply killing the one that would not bow down? No, he wanted to destroy all the Jews and you see the enemy, Satan, working to try to destroy the promised line, the seed. There's also the significance with regard to the land. God had promised them this land and you find the territorial battles that have taken place not only biblically but even still to this very day. The battles that take place with regard to the land that God promised to his people Israel and you find that throughout the scriptures the the borders of Israel, the children of Israel, they were large and they shrunk and they were all kind of all over the place throughout their history depending on the particular kings and so on and so forth. They never had really reached the fullness of the potential of what God outlines in Genesis chapter number 15. The closest they ever came is during the reign of David and that of Solomon. In fact if you look during the time of Solomon's reign when God had given rest and after the all of those amazing things that had taken place during of course the reign of David and then entering into the reign of Solomon that God had given rest from from those enemies and so on and so forth. But the fullness of this promise with regard to the territory that is described in Genesis 15 and verse number 18 will ultimately be fulfilled during the millennial reign of Christ. And so you begin to see that all the way back in Genesis chapter number 15 how you see so many years of time that are being referenced not only with regard to the people of Israel, the events leading to the possession of the land, the time of Abraham's life of course and his depart his death, but also we see the fullness of the millennial reign of Christ that seed that is mentioned being Christ in Galatians chapter 3 and during the time in which he will physically rule and reign on this earth for a thousand years. Now we're not there yet we've not reached the millennium of course we're going to have the rapture of the church will take place and the Great Tribulation and then the millennial reign of Christ. It will happen and we don't know the time in which it will happen we know that it's at least seven years and a few moments away because there's seven years of tribulation and the return of the Lord could happen at any moment and and that's when that timeline will begin. And so we find that here as we look at this passage of Scripture what an exciting opportunity to see that in the life of Abram that God has given these promises he told her about the seed he took him out he said look up in the stars look toward the heaven if you can number them and he says so shall thy seed be. Then he says by the way I'm the Lord that brought you out of the earth the Chaldees to give thee this land to inherit it and Abram says whereby shall I know that I shall inherit it and God gives them this sign after he reveals these details he gives them this sign by he alone passing through those pieces that were divided showing us the fact that this is an unconditional covenant. These things were not based upon anything that Abram would do anything that he would offer any gifts that he would bring and we understand that salvation for a child of God is all based on the grace and mercy of God and it's important that we wrap up in that fashion this evening. We understand the Bible says for by grace are you saved through faith and that not of yourselves is the gift of God not of works lest any man should boast and we understand this evening that our God is gracious and he is merciful he's full of compassion and he is the Savior of the world and the reality this evening is that as we think about the truth of salvation we ought to rejoice in the fact that it has everything to do with what the Lord Jesus Christ did on the cross of Calvary apart from anything that you could offer why because I can't there's nothing good enough that I could do to earn his merit to earn his salvation it is the gift of God not by not by our works of righteousness the Bible says that the wages of sin is death but the gift of God is eternal life through Jesus Christ our Lord I'm so thankful that Jesus said on the cross of Calvary it is finished he paid for your sin and for my sin he paid for the sin of the world and we find that the truth of salvation the promise that God has given with regard to salvation in like manner to this promise that he gave to Abram in Genesis chapter number 15 it has nothing to do with anything that we would do other than just simply believing and receiving and receive that great promise that he said for whosoever shall call upon the name of the Lord shall be saved I'm so thankful for the truth of salvation this evening as we understand the foundational aspect I understand it was more teachy this evening but as we understand the foundational the the impact of Genesis chapter 15 it will help us to understand the events that take place within the next pages of Scripture not only here in the book of Genesis but throughout the whole of Scripture with regard to this covenant that God made with Abram it is a significant event that helps if we don't fully comprehend and understand this event in Genesis 15 it really hinders us from a proper understanding of future things that will be detailed and dealt with throughout the Word of God and that's why the book of Genesis is so foundational and I believe that's why the book of Genesis is under such great attack because it's so foundational to understanding the whole of Scripture let us pray together father we love you this evening we thank you for loving us we thank you for the Word of God the truth contained therein we thank you for this truth that you gave us in Genesis 15 that sets the firm foundation with regard to your dealings with the the children of Israel with the Hebrews the Jewish race and as we begin to study throughout the rest of this book and even the whole of Scripture and we see just your interactions and your dealings and Lord we thank you for this covenant that was made with Abram on this particular day and in its significance I pray that you would help us to rejoice in the fact that you are eternal and omniscient that you are able to with specific detail lay out events that will happen generations to come even as we see here in the life of Abram because you are eternal and because you are omniscient I pray God that you'd help us to rest in that and help us to find just have our faith increased and to find great encouragement through those truths this evening I pray God that if there's one that has never trusted the Lord Jesus Christ as their personal Savior they do not know for sure if they were denied today that heaven is their home I pray God that they'd understand the truth of salvation redemption through the blood of Christ that Jesus Christ the Son of God went to that cruel cross he suffered and bled and died he was buried in a borrowed tomb and he rose in victory conquering sin death in the grave he said he declared it is finished and I pray this evening that if there's one under the sound of my voice whether they're here present in our auditorium or they're watching online that they never have trusted Christ as their Savior that they would understand the promise of redemption the gift of God which is eternal life through Jesus Christ our Lord and that today is the day of salvation the Bible declares for whosoever shall call upon the name of the Lord shall be saved have your will and way in these moments of invitation and we'll thank you for all that you'll do for it's in Christ's name we pray",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.2799999713897705,
      "text": " Genesis chapter number 15, and we have been studying"
    },
    {
      "id": 1,
      "start": 3.2799999713897705,
      "end": 6.139999866485596,
      "text": " through the book of Genesis for quite a while."
    },
    {
      "id": 2,
      "start": 6.139999866485596,
      "end": 8.960000038146973,
      "text": " I don't know exactly how long I could look in my notes"
    },
    {
      "id": 3,
      "start": 8.960000038146973,
      "end": 11.640000343322754,
      "text": " and tell you, this is lesson 43, I know that."
    },
    {
      "id": 4,
      "start": 11.640000343322754,
      "end": 13.920000076293945,
      "text": " And the very first lesson that we had,"
    },
    {
      "id": 5,
      "start": 13.920000076293945,
      "end": 15.279999732971191,
      "text": " if I scroll through my notes here,"
    },
    {
      "id": 6,
      "start": 15.279999732971191,
      "end": 18.479999542236328,
      "text": " was back on March 10th, 2019."
    },
    {
      "id": 7,
      "start": 18.479999542236328,
      "end": 20.760000228881836,
      "text": " And so we've been going through the book of Genesis,"
    },
    {
      "id": 8,
      "start": 20.760000228881836,
      "end": 22.6200008392334,
      "text": " making progress as we've gone through."
    },
    {
      "id": 9,
      "start": 22.6200008392334,
      "end": 26.440000534057617,
      "text": " Of course, we haven't been every single Sunday evening"
    },
    {
      "id": 10,
      "start": 26.440000534057617,
      "end": 27.440000534057617,
      "text": " in the book of Genesis."
    },
    {
      "id": 11,
      "start": 27.440000534057617,
      "end": 30.100000381469727,
      "text": " We've taken a few off, but we'll finish up"
    },
    {
      "id": 12,
      "start": 30.100000381469727,
      "end": 32.540000915527344,
      "text": " chapter number 15 this evening."
    },
    {
      "id": 13,
      "start": 32.540000915527344,
      "end": 34.400001525878906,
      "text": " And if you think about the 15th chapter"
    },
    {
      "id": 14,
      "start": 34.400001525878906,
      "end": 37.15999984741211,
      "text": " of the book of Genesis, you find that there's really"
    },
    {
      "id": 15,
      "start": 37.15999984741211,
      "end": 40.7599983215332,
      "text": " a continuation of a dialogue, a meeting,"
    },
    {
      "id": 16,
      "start": 40.7599983215332,
      "end": 45.2400016784668,
      "text": " that God gives us a record of between the Lord and Abram."
    },
    {
      "id": 17,
      "start": 45.2400016784668,
      "end": 48.7599983215332,
      "text": " And we find that as we really focused upon the first verse"
    },
    {
      "id": 18,
      "start": 48.7599983215332,
      "end": 50.720001220703125,
      "text": " in our first study of Genesis 15,"
    },
    {
      "id": 19,
      "start": 50.720001220703125,
      "end": 54.400001525878906,
      "text": " and really the way in which Abram was greeted by the Lord"
    },
    {
      "id": 20,
      "start": 54.400001525878906,
      "end": 56.220001220703125,
      "text": " and God told him to fear not."
    },
    {
      "id": 21,
      "start": 56.220001220703125,
      "end": 60.220001220703125,
      "text": " And he said, I am thy shield, thy exceeding great reward."
    },
    {
      "id": 22,
      "start": 60.220001220703125,
      "end": 63.02000045776367,
      "text": " Last Sunday evening, we looked at verses two through six."
    },
    {
      "id": 23,
      "start": 63.02000045776367,
      "end": 65.73999786376953,
      "text": " And in that text of scripture, we dealt with the fact"
    },
    {
      "id": 24,
      "start": 65.73999786376953,
      "end": 68.66000366210938,
      "text": " that Abram comes to the Lord and says to me,"
    },
    {
      "id": 25,
      "start": 68.66000366210938,
      "end": 70.22000122070312,
      "text": " thou hast given no seed."
    },
    {
      "id": 26,
      "start": 70.22000122070312,
      "end": 73.9000015258789,
      "text": " And of course, we find that God begins to provide"
    },
    {
      "id": 27,
      "start": 73.9000015258789,
      "end": 78.22000122070312,
      "text": " a record to Abram and Abram's perspective is revealed to us"
    },
    {
      "id": 28,
      "start": 78.22000122070312,
      "end": 79.62000274658203,
      "text": " as he says, here's the problem,"
    },
    {
      "id": 29,
      "start": 79.62000274658203,
      "end": 81.9800033569336,
      "text": " here's a potential solution, Eleazar,"
    },
    {
      "id": 30,
      "start": 81.9800033569336,
      "end": 83.66000366210938,
      "text": " one that's born in mine house."
    },
    {
      "id": 31,
      "start": 83.66000366210938,
      "end": 85.13999938964844,
      "text": " And God says, no, and he gives him"
    },
    {
      "id": 32,
      "start": 85.13999938964844,
      "end": 88.33999633789062,
      "text": " very specific instruction with regard to the promise."
    },
    {
      "id": 33,
      "start": 88.33999633789062,
      "end": 89.9800033569336,
      "text": " And that explanation is provided,"
    },
    {
      "id": 34,
      "start": 89.9800033569336,
      "end": 91.73999786376953,
      "text": " and of course, the promise is embraced."
    },
    {
      "id": 35,
      "start": 91.73999786376953,
      "end": 94.86000061035156,
      "text": " As we continue to move through the 15th chapter"
    },
    {
      "id": 36,
      "start": 94.86000061035156,
      "end": 96.9000015258789,
      "text": " of the book of Genesis, really,"
    },
    {
      "id": 37,
      "start": 96.9000015258789,
      "end": 99.62000274658203,
      "text": " we are given further insight detail"
    },
    {
      "id": 38,
      "start": 99.62000274658203,
      "end": 101.73999786376953,
      "text": " with regard to the Abrahamic covenant"
    },
    {
      "id": 39,
      "start": 101.73999786376953,
      "end": 103.55999755859375,
      "text": " as we'd often refer to it."
    },
    {
      "id": 40,
      "start": 103.55999755859375,
      "end": 108.26000213623047,
      "text": " And we find that here in this passage of scripture,"
    },
    {
      "id": 41,
      "start": 108.26000213623047,
      "end": 110.5199966430664,
      "text": " there's some time that lapsed, not much,"
    },
    {
      "id": 42,
      "start": 110.5199966430664,
      "end": 112.73999786376953,
      "text": " but we do see the days that go on."
    },
    {
      "id": 43,
      "start": 112.73999786376953,
      "end": 114.5199966430664,
      "text": " You'll recall from our study last week"
    },
    {
      "id": 44,
      "start": 114.87999725341797,
      "end": 116.4000015258789,
      "text": " that it was in verse number five,"
    },
    {
      "id": 45,
      "start": 116.4000015258789,
      "end": 119.63999938964844,
      "text": " as the Lord is giving the promise to Abram,"
    },
    {
      "id": 46,
      "start": 119.63999938964844,
      "end": 122.0,
      "text": " he brings him out and he says, look up toward heaven."
    },
    {
      "id": 47,
      "start": 122.0,
      "end": 123.80000305175781,
      "text": " And he tells him to look at the stars."
    },
    {
      "id": 48,
      "start": 123.80000305175781,
      "end": 125.23999786376953,
      "text": " And so we see it would be evening,"
    },
    {
      "id": 49,
      "start": 125.23999786376953,
      "end": 128.60000610351562,
      "text": " he's looking at the stars and we made note of those things."
    },
    {
      "id": 50,
      "start": 128.60000610351562,
      "end": 131.13999938964844,
      "text": " And of course, God gives them the promise"
    },
    {
      "id": 51,
      "start": 131.13999938964844,
      "end": 132.72000122070312,
      "text": " with regard to his seed."
    },
    {
      "id": 52,
      "start": 132.72000122070312,
      "end": 134.63999938964844,
      "text": " And then we find in verse number 12,"
    },
    {
      "id": 53,
      "start": 134.63999938964844,
      "end": 136.60000610351562,
      "text": " the Bible says when the sun was going down."
    },
    {
      "id": 54,
      "start": 136.60000610351562,
      "end": 139.9199981689453,
      "text": " And so there's another day that is unfolding here"
    },
    {
      "id": 55,
      "start": 139.9199981689453,
      "end": 142.27999877929688,
      "text": " throughout this process, this dialogue,"
    },
    {
      "id": 56,
      "start": 142.27999877929688,
      "end": 143.9600067138672,
      "text": " this meeting, if you will."
    },
    {
      "id": 57,
      "start": 143.9600067138672,
      "end": 146.44000244140625,
      "text": " And this conversation will continue."
    },
    {
      "id": 58,
      "start": 146.44000244140625,
      "end": 147.83999633789062,
      "text": " And as we look at the passage,"
    },
    {
      "id": 59,
      "start": 147.83999633789062,
      "end": 150.27999877929688,
      "text": " I want you to notice the statement in verse number 18,"
    },
    {
      "id": 60,
      "start": 150.27999877929688,
      "end": 152.16000366210938,
      "text": " where the Bible says on the same day,"
    },
    {
      "id": 61,
      "start": 152.16000366210938,
      "end": 155.0800018310547,
      "text": " the Lord made a covenant with Abram."
    },
    {
      "id": 62,
      "start": 155.0800018310547,
      "end": 157.02000427246094,
      "text": " And so I've titled the message this evening,"
    },
    {
      "id": 63,
      "start": 157.02000427246094,
      "end": 159.1999969482422,
      "text": " the Lord made a covenant with Abram."
    },
    {
      "id": 64,
      "start": 159.1999969482422,
      "end": 160.47999572753906,
      "text": " We'll be looking at verses seven"
    },
    {
      "id": 65,
      "start": 160.47999572753906,
      "end": 162.16000366210938,
      "text": " down through verse number 21."
    },
    {
      "id": 66,
      "start": 162.16000366210938,
      "end": 164.32000732421875,
      "text": " And as we dig into the passage this evening,"
    },
    {
      "id": 67,
      "start": 164.32000732421875,
      "end": 166.60000610351562,
      "text": " I want you to notice with me first of all,"
    },
    {
      "id": 68,
      "start": 166.60000610351562,
      "end": 168.0800018310547,
      "text": " what is requested."
    },
    {
      "id": 69,
      "start": 168.0800018310547,
      "end": 171.60000610351562,
      "text": " Notice what is requested as we begin to look at this passage"
    },
    {
      "id": 70,
      "start": 171.60000610351562,
      "end": 173.44000244140625,
      "text": " and we see how that in verse number one,"
    },
    {
      "id": 71,
      "start": 173.44000244140625,
      "end": 177.89999389648438,
      "text": " God comes and this message is given to Abram in a vision."
    },
    {
      "id": 72,
      "start": 177.89999389648438,
      "end": 181.44000244140625,
      "text": " And then Abram speaks to God and God responds to Abram"
    },
    {
      "id": 73,
      "start": 181.44000244140625,
      "end": 182.94000244140625,
      "text": " and so on and so forth."
    },
    {
      "id": 74,
      "start": 182.94000244140625,
      "end": 185.60000610351562,
      "text": " And we find that in verse number six,"
    },
    {
      "id": 75,
      "start": 185.60000610351562,
      "end": 187.8800048828125,
      "text": " that as we finished up last week,"
    },
    {
      "id": 76,
      "start": 187.8800048828125,
      "end": 189.16000366210938,
      "text": " it says he believed in the Lord"
    },
    {
      "id": 77,
      "start": 189.16000366210938,
      "end": 192.72000122070312,
      "text": " and he counted it to him for righteousness."
    },
    {
      "id": 78,
      "start": 192.72000122070312,
      "end": 196.75999450683594,
      "text": " That was of utmost importance as we looked at that verse"
    },
    {
      "id": 79,
      "start": 196.75999450683594,
      "end": 198.75999450683594,
      "text": " and seeing the faith of Abram"
    },
    {
      "id": 80,
      "start": 198.75999450683594,
      "end": 201.36000061035156,
      "text": " and believing what God said would come to pass."
    },
    {
      "id": 81,
      "start": 202.1199951171875,
      "end": 203.67999267578125,
      "text": " And we find in verse number seven, it says,"
    },
    {
      "id": 82,
      "start": 203.67999267578125,
      "end": 206.0,
      "text": " and he said unto him,"
    },
    {
      "id": 83,
      "start": 206.0,
      "end": 210.75999450683594,
      "text": " I am the Lord that brought thee out of the Ur of the Chaldees"
    },
    {
      "id": 84,
      "start": 210.75999450683594,
      "end": 214.24000549316406,
      "text": " to give thee this land to inherit it."
    },
    {
      "id": 85,
      "start": 214.24000549316406,
      "end": 217.24000549316406,
      "text": " And so we find that God is now speaking to Abram again"
    },
    {
      "id": 86,
      "start": 217.24000549316406,
      "end": 218.55999755859375,
      "text": " in verse number seven."
    },
    {
      "id": 87,
      "start": 218.55999755859375,
      "end": 219.9600067138672,
      "text": " And he tells him, it's interesting."
    },
    {
      "id": 88,
      "start": 219.9600067138672,
      "end": 221.8800048828125,
      "text": " He says, I am the Lord that brought thee"
    },
    {
      "id": 89,
      "start": 221.8800048828125,
      "end": 223.1999969482422,
      "text": " out of the Ur of the Chaldees."
    },
    {
      "id": 90,
      "start": 223.1999969482422,
      "end": 226.39999389648438,
      "text": " And so we'd go all the way back to chapter number 11 and 12"
    },
    {
      "id": 91,
      "start": 226.39999389648438,
      "end": 230.1199951171875,
      "text": " and begin to see that call of Abram that God extends"
    },
    {
      "id": 92,
      "start": 230.1999969482422,
      "end": 233.0,
      "text": " and how Abram would leave the Ur of the Chaldees"
    },
    {
      "id": 93,
      "start": 233.0,
      "end": 234.67999267578125,
      "text": " and he would go on this journey, of course,"
    },
    {
      "id": 94,
      "start": 234.67999267578125,
      "end": 236.83999633789062,
      "text": " eventually coming to the place"
    },
    {
      "id": 95,
      "start": 236.83999633789062,
      "end": 239.24000549316406,
      "text": " where God had told him to travel to."
    },
    {
      "id": 96,
      "start": 239.24000549316406,
      "end": 240.44000244140625,
      "text": " And we find that he's saying,"
    },
    {
      "id": 97,
      "start": 240.44000244140625,
      "end": 243.44000244140625,
      "text": " I am the Lord that brought thee out of the Ur of the Chaldees"
    },
    {
      "id": 98,
      "start": 243.44000244140625,
      "end": 247.16000366210938,
      "text": " to give thee this land to inherit it."
    },
    {
      "id": 99,
      "start": 247.16000366210938,
      "end": 248.9199981689453,
      "text": " So as we look at the passage of scripture"
    },
    {
      "id": 100,
      "start": 248.9199981689453,
      "end": 251.47999572753906,
      "text": " and we've understood over the last several chapters"
    },
    {
      "id": 101,
      "start": 251.47999572753906,
      "end": 254.1199951171875,
      "text": " of studying the life of Abram,"
    },
    {
      "id": 102,
      "start": 254.1199951171875,
      "end": 257.0799865722656,
      "text": " that the promise to Abram really is twofold."
    },
    {
      "id": 103,
      "start": 257.0799865722656,
      "end": 259.3999938964844,
      "text": " There's the aspect of the seed"
    },
    {
      "id": 104,
      "start": 259.44000244140625,
      "end": 262.2799987792969,
      "text": " and there's the aspect of the land."
    },
    {
      "id": 105,
      "start": 262.2799987792969,
      "end": 265.0,
      "text": " Last week, we really focused upon"
    },
    {
      "id": 106,
      "start": 265.0,
      "end": 267.5199890136719,
      "text": " the seed portion of the promise."
    },
    {
      "id": 107,
      "start": 267.5199890136719,
      "end": 271.9599914550781,
      "text": " This evening, we'll see that the focus now will shift"
    },
    {
      "id": 108,
      "start": 271.9599914550781,
      "end": 275.0,
      "text": " and not so much be with regard to the seed"
    },
    {
      "id": 109,
      "start": 275.0,
      "end": 277.8399963378906,
      "text": " as much as it is with regard to the land."
    },
    {
      "id": 110,
      "start": 277.8399963378906,
      "end": 279.3999938964844,
      "text": " We see that in verse number seven"
    },
    {
      "id": 111,
      "start": 279.3999938964844,
      "end": 281.79998779296875,
      "text": " where God ends that verse of scripture by saying,"
    },
    {
      "id": 112,
      "start": 281.79998779296875,
      "end": 286.44000244140625,
      "text": " to give thee this land to inherit it."
    },
    {
      "id": 113,
      "start": 286.44000244140625,
      "end": 289.55999755859375,
      "text": " And he said unto him, excuse me,"
    },
    {
      "id": 114,
      "start": 289.55999755859375,
      "end": 290.6000061035156,
      "text": " go back to verse number eight."
    },
    {
      "id": 115,
      "start": 290.6000061035156,
      "end": 294.1199951171875,
      "text": " And he said, this is now Abram talking to the Lord."
    },
    {
      "id": 116,
      "start": 294.1199951171875,
      "end": 297.8399963378906,
      "text": " He says, Lord God, whereby shall I know"
    },
    {
      "id": 117,
      "start": 297.8399963378906,
      "end": 299.79998779296875,
      "text": " that I shall inherit it?"
    },
    {
      "id": 118,
      "start": 299.79998779296875,
      "end": 301.3599853515625,
      "text": " And so this is what we find"
    },
    {
      "id": 119,
      "start": 301.3599853515625,
      "end": 303.79998779296875,
      "text": " when we notice what is requested in verse number eight,"
    },
    {
      "id": 120,
      "start": 303.79998779296875,
      "end": 306.20001220703125,
      "text": " Abram is requesting a sign."
    },
    {
      "id": 121,
      "start": 306.20001220703125,
      "end": 307.5199890136719,
      "text": " He is requesting, he says,"
    },
    {
      "id": 122,
      "start": 307.5199890136719,
      "end": 310.32000732421875,
      "text": " he hears what God says to thee this land"
    },
    {
      "id": 123,
      "start": 310.32000732421875,
      "end": 312.67999267578125,
      "text": " or to give thee this land to inherit it."
    },
    {
      "id": 124,
      "start": 312.67999267578125,
      "end": 316.0,
      "text": " And in verse number eight, Abram is saying to the Lord,"
    },
    {
      "id": 125,
      "start": 316.0,
      "end": 319.6000061035156,
      "text": " whereby shall I know that I shall inherit it?"
    },
    {
      "id": 126,
      "start": 319.6000061035156,
      "end": 321.760009765625,
      "text": " Now it's interesting because when we're speaking"
    },
    {
      "id": 127,
      "start": 321.760009765625,
      "end": 324.32000732421875,
      "text": " about the seed in our previous message,"
    },
    {
      "id": 128,
      "start": 324.32000732421875,
      "end": 326.20001220703125,
      "text": " we find that Abram comes and he says,"
    },
    {
      "id": 129,
      "start": 326.20001220703125,
      "end": 327.7200012207031,
      "text": " you've not given me any seed."
    },
    {
      "id": 130,
      "start": 327.7200012207031,
      "end": 329.8800048828125,
      "text": " I understand this promise that's been given."
    },
    {
      "id": 131,
      "start": 329.8800048828125,
      "end": 331.2799987792969,
      "text": " I have no seed."
    },
    {
      "id": 132,
      "start": 331.2799987792969,
      "end": 333.6400146484375,
      "text": " Lo, one born in my house is mine heir."
    },
    {
      "id": 133,
      "start": 333.6400146484375,
      "end": 334.7200012207031,
      "text": " And what does God do?"
    },
    {
      "id": 134,
      "start": 334.7200012207031,
      "end": 337.4800109863281,
      "text": " God says, no, that's not the way it's going to work."
    },
    {
      "id": 135,
      "start": 337.4800109863281,
      "end": 338.8399963378906,
      "text": " He tells him in verse number four,"
    },
    {
      "id": 136,
      "start": 338.8399963378906,
      "end": 340.79998779296875,
      "text": " this shall not be thine heir,"
    },
    {
      "id": 137,
      "start": 340.79998779296875,
      "end": 343.0799865722656,
      "text": " but he that shall come forth out of thine own bow"
    },
    {
      "id": 138,
      "start": 343.0799865722656,
      "end": 344.2799987792969,
      "text": " shall be thine heir."
    },
    {
      "id": 139,
      "start": 344.2799987792969,
      "end": 345.44000244140625,
      "text": " And then what does God do?"
    },
    {
      "id": 140,
      "start": 345.8399963378906,
      "end": 349.8800048828125,
      "text": " He gives him a, it really goes and gives him this picture"
    },
    {
      "id": 141,
      "start": 349.8800048828125,
      "end": 353.8800048828125,
      "text": " of let's go out, look toward the heavens, see the stars."
    },
    {
      "id": 142,
      "start": 353.8800048828125,
      "end": 357.32000732421875,
      "text": " And so as God would give him and tell him"
    },
    {
      "id": 143,
      "start": 357.32000732421875,
      "end": 359.760009765625,
      "text": " to look to the stars, if thou be able to number them,"
    },
    {
      "id": 144,
      "start": 359.760009765625,
      "end": 364.1199951171875,
      "text": " and he said unto him, so shall thy seed be."
    },
    {
      "id": 145,
      "start": 364.1199951171875,
      "end": 366.9800109863281,
      "text": " And so now the same God is saying to Abram,"
    },
    {
      "id": 146,
      "start": 366.9800109863281,
      "end": 369.3999938964844,
      "text": " by the way, I've brought you out of the earthy Caldes"
    },
    {
      "id": 147,
      "start": 369.3999938964844,
      "end": 370.9599914550781,
      "text": " to give you this land."
    },
    {
      "id": 148,
      "start": 370.9599914550781,
      "end": 373.3599853515625,
      "text": " And Abram saying, okay, what is the sign"
    },
    {
      "id": 149,
      "start": 373.3599853515625,
      "end": 376.3599853515625,
      "text": " with regard to the inheritance of the land?"
    },
    {
      "id": 150,
      "start": 376.3599853515625,
      "end": 378.2799987792969,
      "text": " And so he's requesting this sign."
    },
    {
      "id": 151,
      "start": 378.2799987792969,
      "end": 380.8399963378906,
      "text": " It is interesting as we find that Paul is writing"
    },
    {
      "id": 152,
      "start": 380.8399963378906,
      "end": 382.32000732421875,
      "text": " to the believers in Corinth."
    },
    {
      "id": 153,
      "start": 382.32000732421875,
      "end": 384.2799987792969,
      "text": " And in first Corinthians one and verse 22,"
    },
    {
      "id": 154,
      "start": 384.2799987792969,
      "end": 386.9200134277344,
      "text": " he says that the Jews require a sign."
    },
    {
      "id": 155,
      "start": 386.9200134277344,
      "end": 389.1600036621094,
      "text": " And that's interesting as it would go all the way back"
    },
    {
      "id": 156,
      "start": 389.1600036621094,
      "end": 391.9200134277344,
      "text": " even to Abram and asking the Lord"
    },
    {
      "id": 157,
      "start": 391.9200134277344,
      "end": 394.0400085449219,
      "text": " in this very passage of scripture, of course,"
    },
    {
      "id": 158,
      "start": 394.0400085449219,
      "end": 397.3999938964844,
      "text": " many times the Hebrews, Jewish folks,"
    },
    {
      "id": 159,
      "start": 397.3999938964844,
      "end": 399.8800048828125,
      "text": " Father Abraham, and they understand their ancestry"
    },
    {
      "id": 160,
      "start": 399.8800048828125,
      "end": 401.0,
      "text": " and so on and so forth."
    },
    {
      "id": 161,
      "start": 401.1199951171875,
      "end": 404.7200012207031,
      "text": " And we find that he's asking, he's requesting this sign."
    },
    {
      "id": 162,
      "start": 404.7200012207031,
      "end": 408.239990234375,
      "text": " He says, whereby shall I know that I shall inherit it?"
    },
    {
      "id": 163,
      "start": 408.239990234375,
      "end": 409.9599914550781,
      "text": " And so we notice what is requested."
    },
    {
      "id": 164,
      "start": 409.9599914550781,
      "end": 412.32000732421875,
      "text": " I now want you to notice what is required."
    },
    {
      "id": 165,
      "start": 412.32000732421875,
      "end": 416.5199890136719,
      "text": " In verses nine through 11, God is going to give"
    },
    {
      "id": 166,
      "start": 416.5199890136719,
      "end": 419.0799865722656,
      "text": " some specific requirements to Abram,"
    },
    {
      "id": 167,
      "start": 419.0799865722656,
      "end": 420.2799987792969,
      "text": " specifically in verse number nine."
    },
    {
      "id": 168,
      "start": 420.2799987792969,
      "end": 422.8399963378906,
      "text": " And we see how Abram will respond"
    },
    {
      "id": 169,
      "start": 422.8399963378906,
      "end": 425.0,
      "text": " to that which is required."
    },
    {
      "id": 170,
      "start": 425.0,
      "end": 427.79998779296875,
      "text": " In verse number nine, God said to Abram,"
    },
    {
      "id": 171,
      "start": 427.79998779296875,
      "end": 429.5199890136719,
      "text": " it says, and he said unto him,"
    },
    {
      "id": 172,
      "start": 429.5199890136719,
      "end": 432.1199951171875,
      "text": " take me an heifer of three years old"
    },
    {
      "id": 173,
      "start": 432.1199951171875,
      "end": 434.1600036621094,
      "text": " and a she goat of three years old"
    },
    {
      "id": 174,
      "start": 434.1600036621094,
      "end": 435.79998779296875,
      "text": " and a ram of three years old"
    },
    {
      "id": 175,
      "start": 435.79998779296875,
      "end": 438.9200134277344,
      "text": " and a turtle dove and a young pigeon."
    },
    {
      "id": 176,
      "start": 438.9200134277344,
      "end": 440.9599914550781,
      "text": " It is interesting as we look at verse number nine"
    },
    {
      "id": 177,
      "start": 440.9599914550781,
      "end": 443.55999755859375,
      "text": " and we begin to consider this evening what is required"
    },
    {
      "id": 178,
      "start": 443.55999755859375,
      "end": 447.3599853515625,
      "text": " when this request is made by Abram"
    },
    {
      "id": 179,
      "start": 447.3599853515625,
      "end": 449.3599853515625,
      "text": " with regard to this sign."
    },
    {
      "id": 180,
      "start": 449.3599853515625,
      "end": 450.8399963378906,
      "text": " What is it that you'll give me"
    },
    {
      "id": 181,
      "start": 450.8399963378906,
      "end": 453.8399963378906,
      "text": " that I know that I shall inherit the land?"
    },
    {
      "id": 182,
      "start": 453.8399963378906,
      "end": 457.5199890136719,
      "text": " God gives him some very detailed instruction."
    },
    {
      "id": 183,
      "start": 457.55999755859375,
      "end": 460.239990234375,
      "text": " He tells him to get an heifer of three years,"
    },
    {
      "id": 184,
      "start": 460.239990234375,
      "end": 463.1199951171875,
      "text": " a she goat of three years, a ram of three years,"
    },
    {
      "id": 185,
      "start": 463.1199951171875,
      "end": 465.67999267578125,
      "text": " a turtle dove and a young pigeon."
    },
    {
      "id": 186,
      "start": 465.67999267578125,
      "end": 467.9599914550781,
      "text": " And very detailed, very specific."
    },
    {
      "id": 187,
      "start": 467.9599914550781,
      "end": 471.20001220703125,
      "text": " Our God is a God of order in detail."
    },
    {
      "id": 188,
      "start": 471.20001220703125,
      "end": 473.760009765625,
      "text": " And we find that throughout the whole of scripture."
    },
    {
      "id": 189,
      "start": 473.760009765625,
      "end": 476.7200012207031,
      "text": " And we find that the action of Abram"
    },
    {
      "id": 190,
      "start": 476.7200012207031,
      "end": 480.20001220703125,
      "text": " in verse number 10 is immediate obedience."
    },
    {
      "id": 191,
      "start": 480.20001220703125,
      "end": 481.8399963378906,
      "text": " We see the detailed instruction"
    },
    {
      "id": 192,
      "start": 481.8399963378906,
      "end": 484.0400085449219,
      "text": " followed by the detailed action"
    },
    {
      "id": 193,
      "start": 484.0400085449219,
      "end": 486.0,
      "text": " where the Bible says this in verse number 10,"
    },
    {
      "id": 194,
      "start": 486.0,
      "end": 489.2799987792969,
      "text": " and he took unto him all these."
    },
    {
      "id": 195,
      "start": 489.2799987792969,
      "end": 491.6000061035156,
      "text": " Aren't you thankful for the obedience"
    },
    {
      "id": 196,
      "start": 491.6000061035156,
      "end": 493.7200012207031,
      "text": " that we read of in the life of Abram?"
    },
    {
      "id": 197,
      "start": 493.7200012207031,
      "end": 498.44000244140625,
      "text": " Our God, we understand as we study the scriptures,"
    },
    {
      "id": 198,
      "start": 498.44000244140625,
      "end": 502.3999938964844,
      "text": " there is a principle of obedience throughout the word of God"
    },
    {
      "id": 199,
      "start": 502.3999938964844,
      "end": 504.760009765625,
      "text": " in that our God blesses obedience."
    },
    {
      "id": 200,
      "start": 504.760009765625,
      "end": 506.8399963378906,
      "text": " And we find here that Abram did"
    },
    {
      "id": 201,
      "start": 506.8399963378906,
      "end": 508.67999267578125,
      "text": " as the Lord had commanded him."
    },
    {
      "id": 202,
      "start": 508.67999267578125,
      "end": 510.5199890136719,
      "text": " He took unto him all these."
    },
    {
      "id": 203,
      "start": 510.5199890136719,
      "end": 512.719970703125,
      "text": " Notice it was not partial obedience."
    },
    {
      "id": 204,
      "start": 512.719970703125,
      "end": 516.0399780273438,
      "text": " He did not say, well, this will work"
    },
    {
      "id": 205,
      "start": 516.0399780273438,
      "end": 517.3599853515625,
      "text": " or I could do it this way."
    },
    {
      "id": 206,
      "start": 517.3599853515625,
      "end": 520.3200073242188,
      "text": " No, Abram gets the detailed instruction."
    },
    {
      "id": 207,
      "start": 520.3200073242188,
      "end": 522.4000244140625,
      "text": " And we find that there's detailed action"
    },
    {
      "id": 208,
      "start": 522.4000244140625,
      "end": 525.8400268554688,
      "text": " on the part of Abram, this immediate obedience."
    },
    {
      "id": 209,
      "start": 525.8400268554688,
      "end": 529.0399780273438,
      "text": " It says this, that he divided them in the midst"
    },
    {
      "id": 210,
      "start": 529.0399780273438,
      "end": 531.239990234375,
      "text": " and laid each piece one against another,"
    },
    {
      "id": 211,
      "start": 531.239990234375,
      "end": 533.8800048828125,
      "text": " but the birds he divided he not."
    },
    {
      "id": 212,
      "start": 533.8800048828125,
      "end": 535.0,
      "text": " And so in your mind's eye,"
    },
    {
      "id": 213,
      "start": 535.0,
      "end": 536.5599975585938,
      "text": " you can see there's some land here."
    },
    {
      "id": 214,
      "start": 536.5599975585938,
      "end": 540.280029296875,
      "text": " He takes these animals with the heifer,"
    },
    {
      "id": 215,
      "start": 540.280029296875,
      "end": 541.3599853515625,
      "text": " the she goat and the ram."
    },
    {
      "id": 216,
      "start": 541.4000244140625,
      "end": 542.8800048828125,
      "text": " He divides them in half."
    },
    {
      "id": 217,
      "start": 542.8800048828125,
      "end": 545.760009765625,
      "text": " He lays one over here aside from each other."
    },
    {
      "id": 218,
      "start": 545.760009765625,
      "end": 548.719970703125,
      "text": " So as he divides the heifer half here, half here,"
    },
    {
      "id": 219,
      "start": 548.719970703125,
      "end": 551.1599731445312,
      "text": " so on and so forth with the she goat and the ram,"
    },
    {
      "id": 220,
      "start": 551.1599731445312,
      "end": 553.8400268554688,
      "text": " the turtle dove and the young pigeon, he did not divide."
    },
    {
      "id": 221,
      "start": 553.8400268554688,
      "end": 555.4000244140625,
      "text": " Now, the significance of this"
    },
    {
      "id": 222,
      "start": 555.4000244140625,
      "end": 558.8800048828125,
      "text": " is that this was a common custom of the day"
    },
    {
      "id": 223,
      "start": 558.8800048828125,
      "end": 561.280029296875,
      "text": " for those making a covenant."
    },
    {
      "id": 224,
      "start": 561.280029296875,
      "end": 563.6400146484375,
      "text": " It's not something that we're accustomed to"
    },
    {
      "id": 225,
      "start": 563.6400146484375,
      "end": 567.3599853515625,
      "text": " as believers living in 2020."
    },
    {
      "id": 226,
      "start": 567.3599853515625,
      "end": 569.1199951171875,
      "text": " You've made some agreements with people"
    },
    {
      "id": 227,
      "start": 569.1199951171875,
      "end": 571.9199829101562,
      "text": " and I'm guessing you probably never divided some animals"
    },
    {
      "id": 228,
      "start": 571.9199829101562,
      "end": 574.5999755859375,
      "text": " and put them apart from one another and so on and so forth."
    },
    {
      "id": 229,
      "start": 574.5999755859375,
      "end": 577.5999755859375,
      "text": " And so we have different means in which we make covenants"
    },
    {
      "id": 230,
      "start": 577.5999755859375,
      "end": 579.6400146484375,
      "text": " or agreements one with another today,"
    },
    {
      "id": 231,
      "start": 579.6400146484375,
      "end": 584.1599731445312,
      "text": " but this was a very custom, common custom,"
    },
    {
      "id": 232,
      "start": 584.1599731445312,
      "end": 586.239990234375,
      "text": " excuse me, during this particular era."
    },
    {
      "id": 233,
      "start": 586.239990234375,
      "end": 589.2000122070312,
      "text": " And we find what would happen is the parties"
    },
    {
      "id": 234,
      "start": 589.2000122070312,
      "end": 591.47998046875,
      "text": " that are making this agreement or this covenant,"
    },
    {
      "id": 235,
      "start": 591.47998046875,
      "end": 595.0,
      "text": " the two parties, they would pass in between"
    },
    {
      "id": 236,
      "start": 595.0,
      "end": 598.9199829101562,
      "text": " those divided animals and as they would pass in between"
    },
    {
      "id": 237,
      "start": 598.9199829101562,
      "end": 601.1199951171875,
      "text": " what they were doing is."
    },
    {
      "id": 0,
      "start": 601.1199951171875,
      "end": 606.4799952507019,
      "text": " symbolically, they were saying this is the fate of either party that would"
    },
    {
      "id": 1,
      "start": 606.4799952507019,
      "end": 610.4399948120117,
      "text": " break the covenant. In other words, if I make a covenant with you, we go through"
    },
    {
      "id": 2,
      "start": 610.4399948120117,
      "end": 617.1999950408936,
      "text": " this common practice, this custom, we go through, we walk through these divided"
    },
    {
      "id": 3,
      "start": 617.1999950408936,
      "end": 622.9999942779541,
      "text": " animals. If I then break the covenant, I'm to be cut asunder. That's basically what"
    },
    {
      "id": 4,
      "start": 622.9999942779541,
      "end": 628.1199951171875,
      "text": " is being communicated. And so we find that this was a common custom, and it's"
    },
    {
      "id": 5,
      "start": 628.1199951171875,
      "end": 631.9999942779541,
      "text": " important that we understand that because as we look at the passage of"
    },
    {
      "id": 6,
      "start": 631.9999942779541,
      "end": 637.2799949645996,
      "text": " Scripture and we understand the era in which this is happening, we understand"
    },
    {
      "id": 7,
      "start": 637.2799949645996,
      "end": 641.9599952697754,
      "text": " the custom, and then we understand actually what happens in just a few"
    },
    {
      "id": 8,
      "start": 641.9599952697754,
      "end": 646.5599937438965,
      "text": " verses in the significance of the covenant based upon the action that is"
    },
    {
      "id": 9,
      "start": 646.5599937438965,
      "end": 650.1999969482422,
      "text": " taken. And so it's very important that we understand that. Notice in verse number"
    },
    {
      "id": 10,
      "start": 650.1999969482422,
      "end": 655.5199966430664,
      "text": " 11, the Bible says this, and when the fowls came down upon the carcasses,"
    },
    {
      "id": 11,
      "start": 655.5199966430664,
      "end": 662.1599960327148,
      "text": " Abram drove them away. And so this was a long process. We find that the Bible says"
    },
    {
      "id": 12,
      "start": 662.1599960327148,
      "end": 666.7999954223633,
      "text": " in verse 12, when the sun was going down, and so from the time in which Abram would"
    },
    {
      "id": 13,
      "start": 666.7999954223633,
      "end": 672.1599960327148,
      "text": " cut asunder these animals and place them out, no doubt those"
    },
    {
      "id": 14,
      "start": 672.1599960327148,
      "end": 677.5599975585938,
      "text": " birds, the scavenger fowls, they would come down and try to eat upon that which"
    },
    {
      "id": 15,
      "start": 677.5599975585938,
      "end": 682.1199951171875,
      "text": " had been divided, and Abram would spend the majority of that day driving"
    },
    {
      "id": 16,
      "start": 682.1199951171875,
      "end": 688.0799942016602,
      "text": " away those fowls, as the Bible tells us there in verse number 11. As we look here"
    },
    {
      "id": 17,
      "start": 688.0799942016602,
      "end": 692.6799926757812,
      "text": " at what's taking place, it's important that we, again, understand the detail in"
    },
    {
      "id": 18,
      "start": 692.6799926757812,
      "end": 698.0799942016602,
      "text": " which God is giving us. And we find that this man, Abram, makes this request and"
    },
    {
      "id": 19,
      "start": 698.0799942016602,
      "end": 702.8399963378906,
      "text": " then God gives this requirement. The significance of those two"
    },
    {
      "id": 20,
      "start": 702.8399963378906,
      "end": 707.3999938964844,
      "text": " things that are mentioned in the beginning of this passage really begin"
    },
    {
      "id": 21,
      "start": 707.3999938964844,
      "end": 713.9599914550781,
      "text": " to unfold in an amazing way as we look at the latter portion of Genesis 15. We look"
    },
    {
      "id": 22,
      "start": 713.9599914550781,
      "end": 718.2799987792969,
      "text": " at verses 12 through 21, and I would say this, as we've noticed what's requested"
    },
    {
      "id": 23,
      "start": 718.2799987792969,
      "end": 722.6799926757812,
      "text": " and required, we now will notice what is revealed. And this is the bulk of the"
    },
    {
      "id": 24,
      "start": 722.6799926757812,
      "end": 727.2799987792969,
      "text": " message this evening, as we see the significance of that which God would"
    },
    {
      "id": 25,
      "start": 727.2799987792969,
      "end": 732.4400024414062,
      "text": " reveal to Abram during this particular time, and of course being recorded for us"
    },
    {
      "id": 26,
      "start": 732.4400024414062,
      "end": 737.1199951171875,
      "text": " in the Word of God, so that we'd understand this Abrahamic covenant."
    },
    {
      "id": 27,
      "start": 737.1199951171875,
      "end": 742.1999969482422,
      "text": " These details are provided to Abram. Notice it says in verse number 12,"
    },
    {
      "id": 28,
      "start": 742.1999969482422,
      "end": 745.8799896240234,
      "text": " \"...and when the sun was going down, a deep sleep fell upon Abram, and lo and horror"
    },
    {
      "id": 29,
      "start": 745.8799896240234,
      "end": 751.1999969482422,
      "text": " of great darkness fell upon him. And he,\" God, of course, is the he that is being"
    },
    {
      "id": 30,
      "start": 751.1999969482422,
      "end": 756.3999938964844,
      "text": " referred to, \"...said unto Abram.\" Now, notice as we look at these verses of"
    },
    {
      "id": 31,
      "start": 756.3999938964844,
      "end": 761.7200012207031,
      "text": " Scripture, and we consider that which will be revealed to Abram, we see first"
    },
    {
      "id": 32,
      "start": 761.7200012207031,
      "end": 766.4400024414062,
      "text": " of all that God will reveal some truth with regard to the events that"
    },
    {
      "id": 33,
      "start": 766.4400024414062,
      "end": 772.1599884033203,
      "text": " would lead to the possession of the land. It goes back to what God said in verse"
    },
    {
      "id": 34,
      "start": 772.1599884033203,
      "end": 778.5999908447266,
      "text": " number 7, \"...to give thee this land to inherit it.\" And right, so we find that the"
    },
    {
      "id": 35,
      "start": 778.5999908447266,
      "end": 783.5599975585938,
      "text": " the context of what we're dealing with is God has said to Abram, I'm gonna give"
    },
    {
      "id": 36,
      "start": 783.5599975585938,
      "end": 787.3600006103516,
      "text": " you this land. Abram says, what is the sign that you're going to give me that I"
    },
    {
      "id": 37,
      "start": 787.3600006103516,
      "end": 793.0399932861328,
      "text": " know this? And God is going to lay out the details in these verses of Scripture"
    },
    {
      "id": 38,
      "start": 793.0399932861328,
      "end": 798.3999938964844,
      "text": " with regard to his plan. It reveals to us some amazing things with regard to our"
    },
    {
      "id": 39,
      "start": 798.3999938964844,
      "end": 802.7999877929688,
      "text": " God. He's omniscient. He knows all things. He's eternal. He knows the end from the"
    },
    {
      "id": 40,
      "start": 802.7999877929688,
      "end": 807.2799987792969,
      "text": " beginning. He's going to speak to Abram in these verses of Scripture, just a few"
    },
    {
      "id": 41,
      "start": 807.2799987792969,
      "end": 812.6799926757812,
      "text": " verses. He's gonna speak to him about events that would take place centuries"
    },
    {
      "id": 42,
      "start": 812.6799926757812,
      "end": 818.8799896240234,
      "text": " later, and he deals with them in detail. Why? Because our God is eternal. He is"
    },
    {
      "id": 43,
      "start": 818.8799896240234,
      "end": 823.8799896240234,
      "text": " Alpha and Omega, the the beginning and the end, the first and the last. And so we"
    },
    {
      "id": 44,
      "start": 823.8799896240234,
      "end": 828.7200012207031,
      "text": " find here that God begins, as he's gonna speak to Abram in verse number 13, notice"
    },
    {
      "id": 45,
      "start": 828.7200012207031,
      "end": 834.4799957275391,
      "text": " what he says, \"...know of a surety.\" Now it's interesting, as we study the Word of"
    },
    {
      "id": 46,
      "start": 834.4799957275391,
      "end": 838.0399932861328,
      "text": " God, we understand that God wants us to know some things. He wants us to be aware"
    },
    {
      "id": 47,
      "start": 838.1999969482422,
      "end": 843.3999938964844,
      "text": " of what his plan is. He wants us to have confidence in what he has said. We looked"
    },
    {
      "id": 48,
      "start": 843.3999938964844,
      "end": 847.0,
      "text": " at it this morning as we were studying there in 2 Chronicles, in the life of"
    },
    {
      "id": 49,
      "start": 847.0,
      "end": 851.239990234375,
      "text": " Jehoshaphat, king of Judah, and that great event that is recorded in chapter"
    },
    {
      "id": 50,
      "start": 851.239990234375,
      "end": 855.7999877929688,
      "text": " number 20 with regard to the coalition and all of those things, and how that"
    },
    {
      "id": 51,
      "start": 855.7999877929688,
      "end": 861.3200073242188,
      "text": " Jehoshaphat was aware of what God had promised, what God had said, and in simple"
    },
    {
      "id": 52,
      "start": 861.3200073242188,
      "end": 866.8399963378906,
      "text": " faith he believed God. See, God wanted Jehoshaphat and others to know what he"
    },
    {
      "id": 53,
      "start": 866.8399963378906,
      "end": 871.7999877929688,
      "text": " had told Solomon years earlier, and he's given us his Word this evening, and"
    },
    {
      "id": 54,
      "start": 871.7999877929688,
      "end": 876.1199951171875,
      "text": " throughout the Scriptures we understand that God has said that there are some"
    },
    {
      "id": 55,
      "start": 876.1199951171875,
      "end": 880.47998046875,
      "text": " things that we need to know, that we can have confidence in, that we can be sure"
    },
    {
      "id": 56,
      "start": 880.47998046875,
      "end": 886.1999816894531,
      "text": " of. Notice what it says, \"...know of a surety that thy seed shall be a stranger in a"
    },
    {
      "id": 57,
      "start": 886.1999816894531,
      "end": 890.1600036621094,
      "text": " land that is not theirs.\" Now it's interesting because now we begin to see"
    },
    {
      "id": 58,
      "start": 890.1600036621094,
      "end": 895.47998046875,
      "text": " the reference to the seed and also to the land. Remember as we dealt with the"
    },
    {
      "id": 59,
      "start": 895.47998046875,
      "end": 900.1600036621094,
      "text": " seed last week, the first aspect of this promise that had been given to Abram,"
    },
    {
      "id": 60,
      "start": 900.1600036621094,
      "end": 905.2799987792969,
      "text": " that he gives them the details with regard to the seed, and we followed that"
    },
    {
      "id": 61,
      "start": 905.2799987792969,
      "end": 909.3999938964844,
      "text": " throughout the New Testament, the book of Galatians specifically, and now in"
    },
    {
      "id": 62,
      "start": 909.3999938964844,
      "end": 914.9599914550781,
      "text": " answering the question with regard to the land, God says to Abram that, \"...thy seed"
    },
    {
      "id": 63,
      "start": 914.9599914550781,
      "end": 920.47998046875,
      "text": " shall be a stranger in a land that is not theirs, and shall serve them, and they"
    },
    {
      "id": 64,
      "start": 920.5199890136719,
      "end": 925.1999816894531,
      "text": " shall afflict them four hundred years.\" And so here, as we begin to think about"
    },
    {
      "id": 65,
      "start": 925.1999816894531,
      "end": 930.0799865722656,
      "text": " the events that would lead to the possession of the land, God in Genesis"
    },
    {
      "id": 66,
      "start": 930.0799865722656,
      "end": 935.4400024414062,
      "text": " chapter number 15 is giving truth to Abram with regard to the Egyptian"
    },
    {
      "id": 67,
      "start": 935.4400024414062,
      "end": 939.3999938964844,
      "text": " bondage. Now we understand that's going to happen many years from this event"
    },
    {
      "id": 68,
      "start": 939.3999938964844,
      "end": 944.8399963378906,
      "text": " that we see. It's going to be 25 years before Isaac is even born, the promise"
    },
    {
      "id": 69,
      "start": 944.8399963378906,
      "end": 950.3599853515625,
      "text": " of the seed. And now we find that hundreds of years are now in view with"
    },
    {
      "id": 70,
      "start": 950.3599853515625,
      "end": 954.8800048828125,
      "text": " regard to the possession of the land and some events that would lead to the"
    },
    {
      "id": 71,
      "start": 954.8800048828125,
      "end": 958.8399963378906,
      "text": " possession of the land. And so we see the the reference to the Egyptian bondage"
    },
    {
      "id": 72,
      "start": 958.8399963378906,
      "end": 964.5599975585938,
      "text": " here in verse number 13. We see in verse number 14, it says this, \"...and also that"
    },
    {
      "id": 73,
      "start": 964.5599975585938,
      "end": 971.7999877929688,
      "text": " nation whom they shall serve will I judge, and afterward shall they come out"
    },
    {
      "id": 74,
      "start": 971.8399963378906,
      "end": 976.8399963378906,
      "text": " with great substance.\" Now does that sound familiar to you as to what takes place"
    },
    {
      "id": 75,
      "start": 976.8399963378906,
      "end": 981.5199890136719,
      "text": " during the Passover, right? And we read about the Passover, the tenth plague. We"
    },
    {
      "id": 76,
      "start": 981.5199890136719,
      "end": 986.2799987792969,
      "text": " understand that as the children of Israel were serving there in Egypt, as"
    },
    {
      "id": 77,
      "start": 986.2799987792969,
      "end": 990.6799926757812,
      "text": " they were slaves, and there arose that Pharaoh that knew not Joseph, so on and"
    },
    {
      "id": 78,
      "start": 990.6799926757812,
      "end": 995.3599853515625,
      "text": " so forth, and we find that God would raise up Moses and Aaron, and they would"
    },
    {
      "id": 79,
      "start": 995.3599853515625,
      "end": 999.1600036621094,
      "text": " stand before the Pharaoh, and there were great plagues to demonstrate the power"
    },
    {
      "id": 80,
      "start": 999.1999816894531,
      "end": 1004.5199890136719,
      "text": " of God. And we find that after that tenth plague, the Passover, that the children"
    },
    {
      "id": 81,
      "start": 1004.5199890136719,
      "end": 1009.3599853515625,
      "text": " of Israel were delivered. Yes, the Egyptians were judged, and they left with"
    },
    {
      "id": 82,
      "start": 1009.3599853515625,
      "end": 1013.4400024414062,
      "text": " great substance. Notice with me, hold your place here in Genesis, and turn to the"
    },
    {
      "id": 83,
      "start": 1013.4400024414062,
      "end": 1017.8399963378906,
      "text": " book of Exodus, if you will, in Exodus chapter number 12. So not only do we see"
    },
    {
      "id": 84,
      "start": 1017.8399963378906,
      "end": 1022.6399841308594,
      "text": " here in Genesis chapter number 15 a reference to the Egyptian bondage, but"
    },
    {
      "id": 85,
      "start": 1022.6399841308594,
      "end": 1028.2799987792969,
      "text": " also to the Exodus. We find in Exodus chapter number 12, excuse me,"
    },
    {
      "id": 86,
      "start": 1028.2799987792969,
      "end": 1033.9199829101562,
      "text": " in Exodus chapter number 12, notice in verse number 40. Let's look in verse"
    },
    {
      "id": 87,
      "start": 1033.9199829101562,
      "end": 1035.7200012207031,
      "text": " number 40. The Bible says this,"
    },
    {
      "id": 88,
      "start": 1035.7200012207031,
      "end": 1041.3599853515625,
      "text": " Now the sojourning of the children of Israel... I'll give you a moment, I hear"
    },
    {
      "id": 89,
      "start": 1041.3599853515625,
      "end": 1045.9599914550781,
      "text": " some pages turning. Verse number 40, Now the sojourning of the children of Israel"
    },
    {
      "id": 90,
      "start": 1045.9599914550781,
      "end": 1051.4400024414062,
      "text": " who dwelt in Egypt was four hundred and thirty years. And it came to pass at the"
    },
    {
      "id": 91,
      "start": 1051.4400024414062,
      "end": 1055.8399963378906,
      "text": " end of the four hundred and thirty years, even the selfsame day, it came to pass"
    },
    {
      "id": 92,
      "start": 1055.8399963378906,
      "end": 1062.239990234375,
      "text": " that all the hosts of the Lord went out from the land of Egypt. And we find here"
    },
    {
      "id": 93,
      "start": 1062.239990234375,
      "end": 1066.8399963378906,
      "text": " in Exodus chapter number 12, the reference with regard to the departure."
    },
    {
      "id": 94,
      "start": 1066.8399963378906,
      "end": 1072.0799865722656,
      "text": " Now you will note, and I think it's of significant importance, because we find"
    },
    {
      "id": 95,
      "start": 1072.0799865722656,
      "end": 1077.3999938964844,
      "text": " in Genesis chapter number 15, in verse number 13, that the years, the number that"
    },
    {
      "id": 96,
      "start": 1077.3999938964844,
      "end": 1082.0799865722656,
      "text": " is used is 400 years, and here in Exodus chapter number 12, the number that is"
    },
    {
      "id": 97,
      "start": 1082.0799865722656,
      "end": 1086.4400024414062,
      "text": " used is 430 years. In fact, if you look at the New Testament, you'll find the"
    },
    {
      "id": 98,
      "start": 1086.4400024414062,
      "end": 1090.4400024414062,
      "text": " book of Acts in chapter number 7, it references 400 years, and the book of"
    },
    {
      "id": 99,
      "start": 1090.4400024414062,
      "end": 1095.0400085449219,
      "text": " Galatians in chapter number 3, it references 430 years. You say, Pastor, why"
    },
    {
      "id": 100,
      "start": 1095.0400085449219,
      "end": 1099.0,
      "text": " are you telling us all of this? Because here's what happens."
    },
    {
      "id": 101,
      "start": 1099.0,
      "end": 1104.1600036621094,
      "text": " Mockers and scoffers want to tell you that there's an error in the Bible. They"
    },
    {
      "id": 102,
      "start": 1104.1600036621094,
      "end": 1108.239990234375,
      "text": " want to tell you that. And they'll look at something like this and say, is it 400"
    },
    {
      "id": 103,
      "start": 1108.239990234375,
      "end": 1115.760009765625,
      "text": " or 430? Because your Bible says both. The answer is yes. It's both. How is it both?"
    },
    {
      "id": 104,
      "start": 1115.760009765625,
      "end": 1121.760009765625,
      "text": " Well, here's the importance, right? Here's what, so some Bible, if you"
    },
    {
      "id": 105,
      "start": 1121.760009765625,
      "end": 1124.6799926757812,
      "text": " disagree with me, there's a lot of theologians that disagree with what I'm"
    },
    {
      "id": 106,
      "start": 1124.6799926757812,
      "end": 1129.0800170898438,
      "text": " gonna tell you, and I don't, I'm not trying to say that someone's right, wrong."
    },
    {
      "id": 107,
      "start": 1129.0800170898438,
      "end": 1133.9400024414062,
      "text": " I'm trying to simply give you a Bible answer based upon my own study of the"
    },
    {
      "id": 108,
      "start": 1133.9400024414062,
      "end": 1138.5800170898438,
      "text": " scriptures of what I believe God is giving us in His Word with regard to"
    },
    {
      "id": 109,
      "start": 1138.5800170898438,
      "end": 1147.0599975585938,
      "text": " these years. Some simply just kind of skim over it by saying this, well, 400 is"
    },
    {
      "id": 110,
      "start": 1147.0599975585938,
      "end": 1152.02001953125,
      "text": " kind of a round number for 430. And they just try to explain it away real easy."
    },
    {
      "id": 111,
      "start": 1152.02001953125,
      "end": 1157.1400146484375,
      "text": " Well, if that's okay for you, then fine, but I don't like that answer. Because I"
    },
    {
      "id": 112,
      "start": 1157.1400146484375,
      "end": 1162.9000244140625,
      "text": " believe that every word of God is pure. Amen? And so if God is a God of detail,"
    },
    {
      "id": 113,
      "start": 1162.9000244140625,
      "end": 1168.8200073242188,
      "text": " and He is, then there's some significance between this 400 and this 430. We have a"
    },
    {
      "id": 114,
      "start": 1168.8200073242188,
      "end": 1174.260009765625,
      "text": " difference of 30 years, and what could that be? I believe specifically that the"
    },
    {
      "id": 115,
      "start": 1174.260009765625,
      "end": 1182.8599853515625,
      "text": " 400 years is in reference to Isaac, okay? That's the seed, right? Abram has been"
    },
    {
      "id": 116,
      "start": 1182.8599853515625,
      "end": 1186.7799682617188,
      "text": " given the promise with regard to the seed. There's the seed and the land, and"
    },
    {
      "id": 117,
      "start": 1187.5,
      "end": 1193.5,
      "text": " God is giving this promise with regard to Isaac, and the time of Isaac, from the"
    },
    {
      "id": 118,
      "start": 1193.5,
      "end": 1198.219970703125,
      "text": " time in which he would be weaned until the time of the Exodus, would be 400"
    },
    {
      "id": 119,
      "start": 1198.219970703125,
      "end": 1202.6199951171875,
      "text": " years. And we find that..."
    },
    {
      "id": 0,
      "start": 1202.6199951171875,
      "end": 1208.2999949455261,
      "text": " that difference. Notice in verse number 13 again of chapter number 15 of the book of Genesis,"
    },
    {
      "id": 1,
      "start": 1208.2999949455261,
      "end": 1212.6999950408936,
      "text": " he says, \"...know of a surety that thy seed shall be a stranger in a land that is not theirs,"
    },
    {
      "id": 2,
      "start": 1212.6999950408936,
      "end": 1215.7399950027466,
      "text": " and shall serve them, and they shall afflict them four hundred years.\" Again,"
    },
    {
      "id": 3,
      "start": 1215.7399950027466,
      "end": 1222.1399955749512,
      "text": " the reference of seed, I believe, dealing with Isaac. And so from Isaac, if you include"
    },
    {
      "id": 4,
      "start": 1223.6599960327148,
      "end": 1228.9399948120117,
      "text": " from his time of weaning, if you will, to the time of the exodus, there would be that 400 years."
    },
    {
      "id": 5,
      "start": 1228.9399948120117,
      "end": 1234.6999969482422,
      "text": " And then you look at the 430 years, and you begin to think about Abram himself."
    },
    {
      "id": 6,
      "start": 1235.419994354248,
      "end": 1239.7399940490723,
      "text": " And the reality is that Abram had left the Ur of the Chaldees, if you remember,"
    },
    {
      "id": 7,
      "start": 1240.3799934387207,
      "end": 1245.5799942016602,
      "text": " here at this particular time in which Abram is dealing with these things. According to"
    },
    {
      "id": 8,
      "start": 1245.5799942016602,
      "end": 1253.0199966430664,
      "text": " chapter number 12, where the call and the promise was initially given, he was 75 years old. So 75,"
    },
    {
      "id": 9,
      "start": 1253.0199966430664,
      "end": 1258.2999954223633,
      "text": " and then when is Isaac going to be born? Well, Abram's going to be 100. So there's 25 years."
    },
    {
      "id": 10,
      "start": 1258.9399948120117,
      "end": 1265.979995727539,
      "text": " The time of weaning obviously is different in our society culture than it was in biblical times,"
    },
    {
      "id": 11,
      "start": 1265.979995727539,
      "end": 1271.1799926757812,
      "text": " but it's very common for them to say that a time of a child being weaned was five years old."
    },
    {
      "id": 12,
      "start": 1271.1799926757812,
      "end": 1277.979995727539,
      "text": " So if you take 25 years from the age of Abram at 75 to the time of 100 when Isaac was born,"
    },
    {
      "id": 13,
      "start": 1277.979995727539,
      "end": 1283.8199920654297,
      "text": " there's 25 years. The time of weaning being five years, there's your 30 years. The difference"
    },
    {
      "id": 14,
      "start": 1283.8199920654297,
      "end": 1291.099998474121,
      "text": " between 400 and 430, there's not a discrepancy in the Word of God. The question is, what timeline"
    },
    {
      "id": 15,
      "start": 1291.099998474121,
      "end": 1296.139991760254,
      "text": " are we starting? What's the starting point? Is the starting point the time of Isaac, or is the"
    },
    {
      "id": 16,
      "start": 1296.139991760254,
      "end": 1302.4599914550781,
      "text": " starting point the time of Abram? If it's Abram, it's 430 years. If it's Isaac, it's 400 years."
    },
    {
      "id": 17,
      "start": 1302.4599914550781,
      "end": 1306.379997253418,
      "text": " Does that make sense? And so we begin to study the Word of God, we begin to compare Scripture"
    },
    {
      "id": 18,
      "start": 1306.379997253418,
      "end": 1312.2999954223633,
      "text": " with Scripture, and you find that there is, I believe, an answer in the Word of God with regard"
    },
    {
      "id": 19,
      "start": 1312.2999954223633,
      "end": 1317.3399963378906,
      "text": " to these things. It's interesting because, again, sometimes people just simply try to skim over it,"
    },
    {
      "id": 20,
      "start": 1317.3399963378906,
      "end": 1322.379997253418,
      "text": " excuse it, and say, well, it's just a round number, so on and so forth. There are other"
    },
    {
      "id": 21,
      "start": 1323.259994506836,
      "end": 1328.4599914550781,
      "text": " types of examples that we could look to this evening. We won't take the time to do so"
    },
    {
      "id": 22,
      "start": 1329.1799926757812,
      "end": 1334.7799987792969,
      "text": " for the sake of our study here in Genesis 15, but what I would say to you is that there are"
    },
    {
      "id": 23,
      "start": 1334.7799987792969,
      "end": 1340.8600006103516,
      "text": " many scoffers out there that seek to attack the Word of God. This is nothing new. We understand"
    },
    {
      "id": 24,
      "start": 1340.8600006103516,
      "end": 1345.979995727539,
      "text": " that from the very beginning, in Genesis chapter number 3, that the enemy, Satan, says,"
    },
    {
      "id": 25,
      "start": 1345.979995727539,
      "end": 1354.0599975585938,
      "text": " yea, hath God said. And he begins to question the authority of God's spoken Word, so no doubt the"
    },
    {
      "id": 26,
      "start": 1354.0599975585938,
      "end": 1359.8999938964844,
      "text": " enemy is going to question the authority of God's written Word. And what does he do? Why do"
    },
    {
      "id": 27,
      "start": 1359.8999938964844,
      "end": 1366.6999969482422,
      "text": " these scoffers attack and try to dig in and tell us that there are errors and discrepancies?"
    },
    {
      "id": 28,
      "start": 1366.6999969482422,
      "end": 1372.7799987792969,
      "text": " I believe that if they can be successful in doing so, that it puts doubt in the mind of"
    },
    {
      "id": 29,
      "start": 1372.7799987792969,
      "end": 1379.0199890136719,
      "text": " the individual to say, how can I know if it's true or not? And ultimately, that's what Satan"
    },
    {
      "id": 30,
      "start": 1379.0199890136719,
      "end": 1384.6199951171875,
      "text": " wants to do. Satan wants to have people come to a place where they say, I can't trust this book."
    },
    {
      "id": 31,
      "start": 1386.5399932861328,
      "end": 1392.5399932861328,
      "text": " And there are people that you can come in contact with, no doubt, that will laugh at you, will mock"
    },
    {
      "id": 32,
      "start": 1393.259994506836,
      "end": 1397.739990234375,
      "text": " when you say that you're a Bible believer, when you say, well, the Bible says,"
    },
    {
      "id": 33,
      "start": 1397.739990234375,
      "end": 1403.259994506836,
      "text": " because they have believed, they've been blinded by the enemy, and they believe the lie of the"
    },
    {
      "id": 34,
      "start": 1403.259994506836,
      "end": 1409.5,
      "text": " enemy. So I would say this evening, when someone asks me, is it 400 or 430 years? Yes, it depends"
    },
    {
      "id": 35,
      "start": 1409.5,
      "end": 1414.2200012207031,
      "text": " where the starting point is. And if we're starting with Abram, then it's 430. If we're starting with"
    },
    {
      "id": 36,
      "start": 1414.2200012207031,
      "end": 1419.6599884033203,
      "text": " Isaac, it's 400. And so that's just kind of a side note. It's for free. If you don't like it,"
    },
    {
      "id": 37,
      "start": 1419.6599884033203,
      "end": 1423.6599884033203,
      "text": " you don't have to have it. They gave me some beans at lunch yesterday. I didn't want them."
    },
    {
      "id": 38,
      "start": 1423.6599884033203,
      "end": 1428.0599975585938,
      "text": " They just kind of took them away, you know. But that's for free this evening. I believe that it's"
    },
    {
      "id": 39,
      "start": 1428.0599975585938,
      "end": 1433.259994506836,
      "text": " a valid explanation of the Word of God as you study and compare Scripture with Scripture."
    },
    {
      "id": 40,
      "start": 1433.259994506836,
      "end": 1438.4599914550781,
      "text": " Notice, so we see these things that are revealed to Abram with regard to the events leading to"
    },
    {
      "id": 41,
      "start": 1438.4599914550781,
      "end": 1442.6199951171875,
      "text": " the possession of the land. There's also events that are going to be revealed, as we're noticing"
    },
    {
      "id": 42,
      "start": 1442.6199951171875,
      "end": 1448.6199951171875,
      "text": " what is revealed, with regard to the death of Abram. Notice what God says in verse number 15,"
    },
    {
      "id": 43,
      "start": 1448.6199951171875,
      "end": 1454.0599975585938,
      "text": " and thou, now he's speaking directly to Abram. He's speaking in verse 13 and 14 about his seed"
    },
    {
      "id": 44,
      "start": 1454.0599975585938,
      "end": 1458.3799896240234,
      "text": " and about the land that they would be a stranger in before they would possess the land, how they"
    },
    {
      "id": 45,
      "start": 1458.3799896240234,
      "end": 1463.0199890136719,
      "text": " would leave during the exodus. In verse 15, he changes attention back to Abram and says,"
    },
    {
      "id": 46,
      "start": 1463.0199890136719,
      "end": 1471.3399963378906,
      "text": " and thou shalt go to thy fathers in peace. Thou shalt be buried in a good old age."
    },
    {
      "id": 47,
      "start": 1471.97998046875,
      "end": 1476.5400085449219,
      "text": " So now, Abram is getting, God is speaking directly to Abram with regard to"
    },
    {
      "id": 48,
      "start": 1477.4199829101562,
      "end": 1483.260009765625,
      "text": " revealing details about his death. If you look over, hold your place here, turn to the book of,"
    },
    {
      "id": 49,
      "start": 1483.260009765625,
      "end": 1489.1000061035156,
      "text": " excuse me, to chapter 25 in Genesis, and look in chapter 25 in verse number 7, you'll notice"
    },
    {
      "id": 50,
      "start": 1490.2999877929688,
      "end": 1499.3399963378906,
      "text": " that certainly Abram was buried at a good old age. The Bible says in Genesis 25 in verse number"
    },
    {
      "id": 51,
      "start": 1499.3399963378906,
      "end": 1505.260009765625,
      "text": " 7, and these are the days of the years of Abraham's life, which he lived, and hundred,"
    },
    {
      "id": 52,
      "start": 1505.260009765625,
      "end": 1513.3399963378906,
      "text": " threescore, and fifteen years. That's 175 years old. That's a good old age. And we understand"
    },
    {
      "id": 53,
      "start": 1513.3399963378906,
      "end": 1518.6199951171875,
      "text": " that as we look here after the flood, and we've made note of this through our study of the book"
    },
    {
      "id": 54,
      "start": 1518.6199951171875,
      "end": 1525.3399963378906,
      "text": " of Genesis, that the patriarchs, obviously, prior to the flood, they had very long lifespans."
    },
    {
      "id": 55,
      "start": 1525.97998046875,
      "end": 1532.2999877929688,
      "text": " It begins to decrease, and it decreases pretty rapidly after the flood, and just all of the"
    },
    {
      "id": 56,
      "start": 1532.9400024414062,
      "end": 1539.97998046875,
      "text": " catastrophic impact to not only the earth and all of the geological things that took place,"
    },
    {
      "id": 57,
      "start": 1539.97998046875,
      "end": 1545.739990234375,
      "text": " but also just the environment itself. You get to the end of the book of Genesis, and you read about"
    },
    {
      "id": 58,
      "start": 1545.739990234375,
      "end": 1553.0199890136719,
      "text": " the death of Joseph, and he lived to be 110 years old. And then eventually you get to where God"
    },
    {
      "id": 59,
      "start": 1553.0199890136719,
      "end": 1557.5,
      "text": " speaks to Moses about the threescore and ten and so on and so forth, if by reason of strength,"
    },
    {
      "id": 60,
      "start": 1557.5,
      "end": 1564.2999877929688,
      "text": " fourscore. And here, Abram is given this truth from God with regard to his departure, his death,"
    },
    {
      "id": 61,
      "start": 1564.2999877929688,
      "end": 1572.7799987792969,
      "text": " that he would be buried in a good old age of 175 years. Again, in sight is the fact that our God"
    },
    {
      "id": 62,
      "start": 1572.7799987792969,
      "end": 1579.3399963378906,
      "text": " is eternal, that our God is omniscient, that he's able to give truth to Abram with regard to his own"
    },
    {
      "id": 63,
      "start": 1579.3399963378906,
      "end": 1587.1000061035156,
      "text": " death. Notice with me also that God reveals information to Abram with regard to the judgment"
    },
    {
      "id": 64,
      "start": 1587.1000061035156,
      "end": 1591.1000061035156,
      "text": " upon the inhabitants of the land. We see that in verse number 16. It says,"
    },
    {
      "id": 65,
      "start": 1591.1000061035156,
      "end": 1597.8999938964844,
      "text": " but in the fourth generation they shall come hither again, for the iniquity of the Amorites"
    },
    {
      "id": 66,
      "start": 1597.8999938964844,
      "end": 1603.0199890136719,
      "text": " is not yet full. It's an interesting reference. You begin to look in verses 19 through 21,"
    },
    {
      "id": 67,
      "start": 1603.0199890136719,
      "end": 1607.3399963378906,
      "text": " and you begin to see the other groups of people that are mentioned, the Kenites, the Kenizzites,"
    },
    {
      "id": 68,
      "start": 1607.3399963378906,
      "end": 1612.1399841308594,
      "text": " the Kadmonites, the Hittites, the Perizzites, the Rephaims, the Amorites, the Canaanites,"
    },
    {
      "id": 69,
      "start": 1612.1399841308594,
      "end": 1616.7799987792969,
      "text": " the Gergesites, and the Jebusites. And you find here that the Amorites are mentioned"
    },
    {
      "id": 70,
      "start": 1616.7799987792969,
      "end": 1622.6199951171875,
      "text": " specifically in verse number 16 about this fourth generation, again, this time period in which they"
    },
    {
      "id": 71,
      "start": 1622.6199951171875,
      "end": 1627.97998046875,
      "text": " would come again. And he says that the iniquity of the Amorites is not yet full. It's interesting"
    },
    {
      "id": 72,
      "start": 1627.97998046875,
      "end": 1633.97998046875,
      "text": " because the judgment would come upon the inhabitants of the land. This year, during the"
    },
    {
      "id": 73,
      "start": 1633.97998046875,
      "end": 1640.0599975585938,
      "text": " shutdown and all that was going on, I taught through the book of Joshua. We had those daily"
    },
    {
      "id": 74,
      "start": 1640.0599975585938,
      "end": 1645.1799926757812,
      "text": " lessons that we sent out. And one reference that I made to you often throughout the book of Joshua"
    },
    {
      "id": 75,
      "start": 1645.1799926757812,
      "end": 1650.7799987792969,
      "text": " is the fact that those inhabitants of the land were being judged because of their wickedness."
    },
    {
      "id": 76,
      "start": 1651.4199829101562,
      "end": 1656.1399841308594,
      "text": " And God had given warning to his people, to Joshua and the children of Israel,"
    },
    {
      "id": 77,
      "start": 1657.1000061035156,
      "end": 1663.97998046875,
      "text": " to be careful about their walk with God and their obedience to the revealed Word of God,"
    },
    {
      "id": 78,
      "start": 1663.97998046875,
      "end": 1669.1000061035156,
      "text": " lest they also be judged. And so we find here that he says that the iniquity of the Amorites"
    },
    {
      "id": 79,
      "start": 1669.1000061035156,
      "end": 1674.9400024414062,
      "text": " is not yet full. In other words, God knew because he's omniscient and he's eternal,"
    },
    {
      "id": 80,
      "start": 1674.9400024414062,
      "end": 1680.2999877929688,
      "text": " he knew the timing of what was going to happen. But really, I believe that as he says it's not"
    },
    {
      "id": 81,
      "start": 1680.3800048828125,
      "end": 1685.4199829101562,
      "text": " yet full, that God had given them some space, if you will, some time to repent."
    },
    {
      "id": 82,
      "start": 1686.1399841308594,
      "end": 1694.6999816894531,
      "text": " But the inhabitants of the land, they never repented. They continued to go and serve"
    },
    {
      "id": 83,
      "start": 1694.6999816894531,
      "end": 1700.9400024414062,
      "text": " idols and live in their wicked behavior. And we find that they eventually would be judged. And our"
    },
    {
      "id": 84,
      "start": 1700.9400024414062,
      "end": 1707.6600036621094,
      "text": " God, of course, is the judge. And we understand that. He's gracious and he's merciful, but he is"
    },
    {
      "id": 85,
      "start": 1707.6600036621094,
      "end": 1712.9400024414062,
      "text": " the righteous judge. And we understand this evening that as we think about the end times,"
    },
    {
      "id": 86,
      "start": 1712.9400024414062,
      "end": 1717.5,
      "text": " and we think about the judgments, that as the people of God, if you've been born again,"
    },
    {
      "id": 87,
      "start": 1717.5,
      "end": 1721.739990234375,
      "text": " you've trusted Christ as your Savior, that you'll stand at the bema seat of Christ,"
    },
    {
      "id": 88,
      "start": 1721.739990234375,
      "end": 1726.4600219726562,
      "text": " the judgment seat of Christ. But for those that have not trusted Christ as their Savior,"
    },
    {
      "id": 89,
      "start": 1726.4600219726562,
      "end": 1732.2999877929688,
      "text": " they will stand at the great white throne judgment, as is revealed to us in Revelation chapter number"
    },
    {
      "id": 90,
      "start": 1732.2999877929688,
      "end": 1739.1799926757812,
      "text": " 20. And so here, God is referencing the judgment that would come upon the inhabitants of the land."
    },
    {
      "id": 91,
      "start": 1739.1799926757812,
      "end": 1745.4199829101562,
      "text": " We can read of all of those events. Of course, after the Exodus and before the conquering of the"
    },
    {
      "id": 92,
      "start": 1745.4199829101562,
      "end": 1751.5,
      "text": " land, you have the wilderness wanderings. That was never what God's plan was for the nation of"
    },
    {
      "id": 93,
      "start": 1751.5,
      "end": 1756.1400146484375,
      "text": " Israel. But because of their doubt and unbelief, that generation would die in the wilderness."
    },
    {
      "id": 94,
      "start": 1756.1400146484375,
      "end": 1762.5399780273438,
      "text": " Now, we get here as we wrap up the 15th chapter of the book of Genesis, we now come to this,"
    },
    {
      "id": 95,
      "start": 1762.5399780273438,
      "end": 1767.4199829101562,
      "text": " what is being revealed with regard to the details of the covenant that God is making"
    },
    {
      "id": 96,
      "start": 1767.97998046875,
      "end": 1774.7000122070312,
      "text": " with Abram. And so we see that he's revealed several things, and now he's coming back to what"
    },
    {
      "id": 97,
      "start": 1774.7000122070312,
      "end": 1780.4600219726562,
      "text": " the passage started with that we're looking at this evening. When Abram says to God, after God"
    },
    {
      "id": 98,
      "start": 1780.4600219726562,
      "end": 1786.219970703125,
      "text": " says to give thee this land to inherit it, at the end of verse number 7, that Abram then says,"
    },
    {
      "id": 99,
      "start": 1786.219970703125,
      "end": 1794.6199951171875,
      "text": " Lord God, whereby shall I know that I shall inherit it? And so God revealed these things to"
    },
    {
      "id": 100,
      "start": 1794.6199951171875,
      "end": 1801.3399658203125,
      "text": " him, and now God is going to give him this sign, and he's going to give us details with regard to"
    },
    {
      "id": 101,
      "start": 1801.3399658203125,
      "end": 1802.5399780273438,
      "text": " the covenant. Notice in verse"
    },
    {
      "id": 0,
      "start": 1802.5399780273438,
      "end": 1809.4999780654907,
      "text": " verse number 17, and it came to pass that when the sun went down and it was dark."
    },
    {
      "id": 1,
      "start": 1809.4999780654907,
      "end": 1813.4599781036377,
      "text": " We notice that in verse number 12 it says when the sun was going down."
    },
    {
      "id": 2,
      "start": 1813.4599781036377,
      "end": 1818.1799783706665,
      "text": " Now the Bible tells us in verse number 17 that the sun went down and it was dark."
    },
    {
      "id": 3,
      "start": 1818.1799783706665,
      "end": 1825.2999782562256,
      "text": " Notice what it says, behold a smoking furnace and a burning lamp that passed between those"
    },
    {
      "id": 4,
      "start": 1825.2999782562256,
      "end": 1826.579978942871,
      "text": " pieces."
    },
    {
      "id": 5,
      "start": 1826.579978942871,
      "end": 1827.579978942871,
      "text": " What are the pieces?"
    },
    {
      "id": 6,
      "start": 1828.01997756958,
      "end": 1832.779977798462,
      "text": " Well those are the animals that had been, God had given that detailed instruction with"
    },
    {
      "id": 7,
      "start": 1832.779977798462,
      "end": 1837.799976348877,
      "text": " regard to that which was to be brought as we looked in verse number 9, and heifer of"
    },
    {
      "id": 8,
      "start": 1837.799976348877,
      "end": 1841.7399787902832,
      "text": " three years old, a she goat of three years old, a ram of three years old, a turtle dove"
    },
    {
      "id": 9,
      "start": 1841.7399787902832,
      "end": 1846.5399780273438,
      "text": " and a young pigeon, and they had been divided and set in the midst, and so the Bible tells"
    },
    {
      "id": 10,
      "start": 1846.5399780273438,
      "end": 1851.9399795532227,
      "text": " us in verse number 17 that passed between those pieces."
    },
    {
      "id": 11,
      "start": 1851.9399795532227,
      "end": 1857.5599784851074,
      "text": " Now remember I mentioned to you that the common custom of the day was that both parties that"
    },
    {
      "id": 12,
      "start": 1857.5599784851074,
      "end": 1862.859977722168,
      "text": " were involved in making the covenant or the agreement would pass through those pieces"
    },
    {
      "id": 13,
      "start": 1862.859977722168,
      "end": 1864.579978942871,
      "text": " that had been divided."
    },
    {
      "id": 14,
      "start": 1864.579978942871,
      "end": 1869.5199813842773,
      "text": " So both parties would pass through signifying that the covenant is being established and"
    },
    {
      "id": 15,
      "start": 1869.5199813842773,
      "end": 1876.9199752807617,
      "text": " symbolically saying if I break the covenant then it is for me to be divided asunder."
    },
    {
      "id": 16,
      "start": 1876.9199752807617,
      "end": 1883.6199798583984,
      "text": " And so we find here in verse number 17 that the manifestation of God passing through is"
    },
    {
      "id": 17,
      "start": 1883.6199798583984,
      "end": 1890.1399765014648,
      "text": " a smoking furnace and a burning lamp and it says that it passed between those pieces."
    },
    {
      "id": 18,
      "start": 1890.1399765014648,
      "end": 1891.2999801635742,
      "text": " What's the significance?"
    },
    {
      "id": 19,
      "start": 1891.2999801635742,
      "end": 1897.0999755859375,
      "text": " Well the significance is that this Abrahamic covenant, as we often refer to it as, is an"
    },
    {
      "id": 20,
      "start": 1897.0999755859375,
      "end": 1899.359977722168,
      "text": " unconditional covenant."
    },
    {
      "id": 21,
      "start": 1899.359977722168,
      "end": 1904.239974975586,
      "text": " This is based upon the goodness, the grace and mercy of God."
    },
    {
      "id": 22,
      "start": 1904.239974975586,
      "end": 1910.1199798583984,
      "text": " This covenant that is being made has nothing to do with Abraham, it has everything to do"
    },
    {
      "id": 23,
      "start": 1910.1199798583984,
      "end": 1911.5199813842773,
      "text": " with God."
    },
    {
      "id": 24,
      "start": 1911.5199813842773,
      "end": 1915.2799758911133,
      "text": " And that's important, it's significant for us to understand that as we think about promises"
    },
    {
      "id": 25,
      "start": 1915.2799758911133,
      "end": 1921.4199752807617,
      "text": " in the Word of God, there are conditional promises and there are unconditional promises."
    },
    {
      "id": 26,
      "start": 1921.4199752807617,
      "end": 1925.7999801635742,
      "text": " Some of the conditional promises, some of the most common conditional promises are ones"
    },
    {
      "id": 27,
      "start": 1925.7999801635742,
      "end": 1930.0999755859375,
      "text": " that would be categorized as being if-then."
    },
    {
      "id": 28,
      "start": 1930.0999755859375,
      "end": 1933.219970703125,
      "text": " If you do this, then God will do this."
    },
    {
      "id": 29,
      "start": 1933.219970703125,
      "end": 1935.0399780273438,
      "text": " That's a conditional promise."
    },
    {
      "id": 30,
      "start": 1935.0399780273438,
      "end": 1939.3599853515625,
      "text": " God's action is a response to our action."
    },
    {
      "id": 31,
      "start": 1939.3599853515625,
      "end": 1941.719970703125,
      "text": " If you do this, then this is what God's going to do."
    },
    {
      "id": 32,
      "start": 1941.719970703125,
      "end": 1944.8799743652344,
      "text": " In fact, you could read Proverbs chapter number two and you'll see a whole list of them at"
    },
    {
      "id": 33,
      "start": 1944.8799743652344,
      "end": 1947.3999786376953,
      "text": " the beginning of the second chapter of the book of Proverbs."
    },
    {
      "id": 34,
      "start": 1947.3999786376953,
      "end": 1950.959976196289,
      "text": " If-then, if-then, you'll read right through it and you'll see a number of them."
    },
    {
      "id": 35,
      "start": 1950.959976196289,
      "end": 1955.0799713134766,
      "text": " And so those are scattered, littered throughout the Word of God and we find also there are"
    },
    {
      "id": 36,
      "start": 1955.0799713134766,
      "end": 1956.7599792480469,
      "text": " unconditional promises."
    },
    {
      "id": 37,
      "start": 1956.7599792480469,
      "end": 1963.5999755859375,
      "text": " This covenant that God has made, the significance of the manifestation of God through this smoking"
    },
    {
      "id": 38,
      "start": 1963.5999755859375,
      "end": 1968.719970703125,
      "text": " furnace and this burning lamp passing between the pieces would signify for us this evening"
    },
    {
      "id": 39,
      "start": 1968.719970703125,
      "end": 1970.7599792480469,
      "text": " that this is an unconditional covenant."
    },
    {
      "id": 40,
      "start": 1970.7599792480469,
      "end": 1976.5599822998047,
      "text": " This is a promise that God is making to Abraham with regard to that which had been promised."
    },
    {
      "id": 41,
      "start": 1976.5599822998047,
      "end": 1982.239974975586,
      "text": " Remember, he says, to give thee this land to inherit it and Abram says to God, whereby"
    },
    {
      "id": 42,
      "start": 1982.239974975586,
      "end": 1985.8199768066406,
      "text": " shall I know that I shall inherit it?"
    },
    {
      "id": 43,
      "start": 1985.8199768066406,
      "end": 1990.5999755859375,
      "text": " And so God then passes through those pieces, the manifestation of such as we've mentioned"
    },
    {
      "id": 44,
      "start": 1990.5999755859375,
      "end": 1993.1199798583984,
      "text": " already, and he passes through."
    },
    {
      "id": 45,
      "start": 1993.1199798583984,
      "end": 1995.7599792480469,
      "text": " Abram himself, he did not pass through."
    },
    {
      "id": 46,
      "start": 1995.7599792480469,
      "end": 1996.7599792480469,
      "text": " Why?"
    },
    {
      "id": 47,
      "start": 1996.7599792480469,
      "end": 1997.999984741211,
      "text": " Because God is the one making the promise."
    },
    {
      "id": 48,
      "start": 1998.2799835205078,
      "end": 2002.2799835205078,
      "text": " Now, keep that thought and look at a few verses with me in the preceding chapters."
    },
    {
      "id": 49,
      "start": 2002.2799835205078,
      "end": 2004.719970703125,
      "text": " Actually, let's read verse 18 and then we'll do that."
    },
    {
      "id": 50,
      "start": 2004.719970703125,
      "end": 2013.5599822998047,
      "text": " In the same day, the Lord made a covenant with Abram, saying, unto thy seed have I given"
    },
    {
      "id": 51,
      "start": 2013.5599822998047,
      "end": 2020.3199768066406,
      "text": " this land, from the river of Egypt unto the great river, the river Euphrates, the Kenites"
    },
    {
      "id": 52,
      "start": 2020.3199768066406,
      "end": 2024.459976196289,
      "text": " and the Kenizzites and the Kadmonites and the Hittites and the Perizzites and the Rephaims"
    },
    {
      "id": 53,
      "start": 2024.459976196289,
      "end": 2028.8999786376953,
      "text": " and the Amorites and the Canaanites and the Gergesites and the Jebusites."
    },
    {
      "id": 54,
      "start": 2028.8999786376953,
      "end": 2033.2999725341797,
      "text": " We see in verse number 18 where we received our title for our message this evening that"
    },
    {
      "id": 55,
      "start": 2033.2999725341797,
      "end": 2038.6999816894531,
      "text": " in that same day, the Lord made this covenant with Abram and notice what he said, unto thy"
    },
    {
      "id": 56,
      "start": 2038.6999816894531,
      "end": 2044.0199737548828,
      "text": " seed have I given this land."
    },
    {
      "id": 57,
      "start": 2044.0199737548828,
      "end": 2051.8599853515625,
      "text": " Abram says to God in verse number eight, God, whereby shall I know that I shall inherit"
    },
    {
      "id": 58,
      "start": 2051.8599853515625,
      "end": 2052.97998046875,
      "text": " it?"
    },
    {
      "id": 59,
      "start": 2052.97998046875,
      "end": 2053.97998046875,
      "text": " What is it?"
    },
    {
      "id": 60,
      "start": 2053.97998046875,
      "end": 2059.8599853515625,
      "text": " The land, as it's mentioned in verse number seven, to give this land, to give thee this"
    },
    {
      "id": 61,
      "start": 2059.8599853515625,
      "end": 2061.259979248047,
      "text": " land to inherit it."
    },
    {
      "id": 62,
      "start": 2061.259979248047,
      "end": 2065.3399658203125,
      "text": " And so God then answers that request that Abram made at the beginning of our study this"
    },
    {
      "id": 63,
      "start": 2065.3399658203125,
      "end": 2067.0599670410156,
      "text": " evening."
    },
    {
      "id": 64,
      "start": 2067.0599670410156,
      "end": 2073.97998046875,
      "text": " He passes through giving Abram the sign that this is the sign, I've made this covenant,"
    },
    {
      "id": 65,
      "start": 2073.97998046875,
      "end": 2081.3799743652344,
      "text": " this promise with you that I now am telling you I have given this land to your seed."
    },
    {
      "id": 66,
      "start": 2081.3799743652344,
      "end": 2086.6599731445312,
      "text": " Now it's interesting because now we're speaking in terms that it's already settled."
    },
    {
      "id": 67,
      "start": 2086.6599731445312,
      "end": 2092.4199829101562,
      "text": " It says unto thee have I given this land."
    },
    {
      "id": 68,
      "start": 2092.4199829101562,
      "end": 2097.499969482422,
      "text": " Prior to this verse of Scripture, everything that is spoken of with regard to the land"
    },
    {
      "id": 69,
      "start": 2097.499969482422,
      "end": 2099.7799682617188,
      "text": " is spoken of in future."
    },
    {
      "id": 70,
      "start": 2099.7799682617188,
      "end": 2101.499969482422,
      "text": " I'm going to give this to you."
    },
    {
      "id": 71,
      "start": 2101.499969482422,
      "end": 2104.939971923828,
      "text": " Now he says I have given you this land."
    },
    {
      "id": 72,
      "start": 2104.939971923828,
      "end": 2108.2999877929688,
      "text": " Notice with me, turn back if you will to chapter number 12."
    },
    {
      "id": 73,
      "start": 2108.2999877929688,
      "end": 2112.3399658203125,
      "text": " We did this last week as we looked at the promise with regard to the seed, but look"
    },
    {
      "id": 74,
      "start": 2112.3399658203125,
      "end": 2117.2799682617188,
      "text": " at it now as the passage in Genesis 15 shifts from seed to land."
    },
    {
      "id": 75,
      "start": 2117.2799682617188,
      "end": 2122.5399780273438,
      "text": " We find in verse number seven of Genesis 12, the Bible says, and the Lord appeared unto"
    },
    {
      "id": 76,
      "start": 2122.5399780273438,
      "end": 2129.219970703125,
      "text": " Abram and said, unto thy seed will I give this land."
    },
    {
      "id": 77,
      "start": 2129.219970703125,
      "end": 2130.8199768066406,
      "text": " That's future, correct?"
    },
    {
      "id": 78,
      "start": 2130.8199768066406,
      "end": 2133.0999755859375,
      "text": " Will I give this land?"
    },
    {
      "id": 79,
      "start": 2133.0999755859375,
      "end": 2136.699981689453,
      "text": " And there builded he an altar unto the Lord who appeared unto him."
    },
    {
      "id": 80,
      "start": 2136.699981689453,
      "end": 2140.3199768066406,
      "text": " Abram then responded to that promise by worshiping the Lord."
    },
    {
      "id": 81,
      "start": 2140.3199768066406,
      "end": 2144.6599731445312,
      "text": " We see in chapter number 13, look in verse number 15."
    },
    {
      "id": 82,
      "start": 2144.6599731445312,
      "end": 2148.2999877929688,
      "text": " This is after the division between Abram and Lot."
    },
    {
      "id": 83,
      "start": 2148.2999877929688,
      "end": 2153.499969482422,
      "text": " And we know that Lot went toward the plain and pitched his tent towards Sodom."
    },
    {
      "id": 84,
      "start": 2153.499969482422,
      "end": 2159.259979248047,
      "text": " And the Lord then says to Abram in verse number 14, he says this, and the Lord said unto Abram,"
    },
    {
      "id": 85,
      "start": 2159.259979248047,
      "end": 2162.739990234375,
      "text": " after that Lot was separated from him, lift up now thine eyes and look from the place"
    },
    {
      "id": 86,
      "start": 2162.739990234375,
      "end": 2168.7799682617188,
      "text": " where thou art northward and southward and eastward and westward for all the land which"
    },
    {
      "id": 87,
      "start": 2168.7799682617188,
      "end": 2175.6199645996094,
      "text": " thou seest to thee will I give it and to thy seed forever."
    },
    {
      "id": 88,
      "start": 2175.6199645996094,
      "end": 2179.5799865722656,
      "text": " We see again in verse number 17, it says, arise, walk through the land and the length"
    },
    {
      "id": 89,
      "start": 2179.5799865722656,
      "end": 2184.3399658203125,
      "text": " of it and in the breadth of it, for I will give it unto thee."
    },
    {
      "id": 90,
      "start": 2184.3399658203125,
      "end": 2189.3399658203125,
      "text": " In chapter number 15, as we started our message this evening in verse number seven, God says"
    },
    {
      "id": 91,
      "start": 2189.3399658203125,
      "end": 2196.7799682617188,
      "text": " to Abram and he said unto him, I am the Lord that brought thee out of Ur of the Chaldees"
    },
    {
      "id": 92,
      "start": 2196.7799682617188,
      "end": 2201.699981689453,
      "text": " to give thee this land to inherit it."
    },
    {
      "id": 93,
      "start": 2201.699981689453,
      "end": 2207.2999877929688,
      "text": " And now Abram says, God, in verse number eight, he's asking for that sign."
    },
    {
      "id": 94,
      "start": 2207.2999877929688,
      "end": 2208.2999877929688,
      "text": " That's what's requested."
    },
    {
      "id": 95,
      "start": 2208.2999877929688,
      "end": 2211.459991455078,
      "text": " Whereby shall I know that I shall inherit it?"
    },
    {
      "id": 96,
      "start": 2211.459991455078,
      "end": 2217.3799743652344,
      "text": " And God goes through this, what was a common practice, a custom in that particular day"
    },
    {
      "id": 97,
      "start": 2217.3799743652344,
      "end": 2222.739990234375,
      "text": " in those making covenants and God himself, the manifestation through the smoking furnace"
    },
    {
      "id": 98,
      "start": 2222.739990234375,
      "end": 2229.499969482422,
      "text": " and the burning lamp, he passes through those pieces and he says to Abram, unto thy seed"
    },
    {
      "id": 99,
      "start": 2229.499969482422,
      "end": 2233.1799926757812,
      "text": " have I given this land."
    },
    {
      "id": 100,
      "start": 2233.1799926757812,
      "end": 2237.5799865722656,
      "text": " What a great promise that God gives to Abram on this particular day."
    },
    {
      "id": 101,
      "start": 2237.5799865722656,
      "end": 2240.6599731445312,
      "text": " Now we understand the significance of the Abrahamic covenant."
    },
    {
      "id": 102,
      "start": 2240.6599731445312,
      "end": 2246.4199829101562,
      "text": " We understand that here the specifics are given with regard to the territory."
    },
    {
      "id": 103,
      "start": 2246.459991455078,
      "end": 2251.459991455078,
      "text": " He says there at the end of verse number 18, from the river of Egypt unto the great river,"
    },
    {
      "id": 104,
      "start": 2251.459991455078,
      "end": 2252.8999633789062,
      "text": " the river Euphrates."
    },
    {
      "id": 105,
      "start": 2252.8999633789062,
      "end": 2258.1199645996094,
      "text": " He then lists out a number of people groups that are mentioned in verses 19 through 21."
    },
    {
      "id": 106,
      "start": 2258.1199645996094,
      "end": 2263.5399780273438,
      "text": " And we find this significance with regard to the territory that God has given."
    },
    {
      "id": 107,
      "start": 2263.5399780273438,
      "end": 2269.1799926757812,
      "text": " As we've looked at this 15th chapter and we dealt with the two aspects of the Abrahamic"
    },
    {
      "id": 108,
      "start": 2269.1799926757812,
      "end": 2273.8999633789062,
      "text": " covenant, we see first of all the seed and we understand the birth of Isaac that would"
    },
    {
      "id": 109,
      "start": 2273.8999633789062,
      "end": 2279.939971923828,
      "text": " come later on here in the book of Genesis as we begin to read about that miraculous"
    },
    {
      "id": 110,
      "start": 2279.939971923828,
      "end": 2287.739990234375,
      "text": " birth and how God was fulfilling the promise that he made to Abram and Sarah."
    },
    {
      "id": 111,
      "start": 2287.739990234375,
      "end": 2289.939971923828,
      "text": " And we see that in chapter number 21."
    },
    {
      "id": 112,
      "start": 2289.939971923828,
      "end": 2294.6799926757812,
      "text": " But of course we understand the fullness of that Abrahamic covenant and that promise with"
    },
    {
      "id": 113,
      "start": 2294.6799926757812,
      "end": 2298.3799743652344,
      "text": " regard to the seed is the Lord Jesus."
    },
    {
      "id": 114,
      "start": 2298.3799743652344,
      "end": 2301.2999877929688,
      "text": " We find that Paul mentions that in the book of Galatians."
    },
    {
      "id": 115,
      "start": 2301.2999877929688,
      "end": 2306.1399841308594,
      "text": " If you want to take a moment to turn there, we referenced this last week briefly and we'll"
    },
    {
      "id": 116,
      "start": 2306.1399841308594,
      "end": 2307.699981689453,
      "text": " reference it again this evening."
    },
    {
      "id": 117,
      "start": 2307.699981689453,
      "end": 2314.0599670410156,
      "text": " We see in Galatians chapter number 3 that as the reference to Genesis chapter number"
    },
    {
      "id": 118,
      "start": 2314.0599670410156,
      "end": 2319.0999755859375,
      "text": " 15 in verse number 6 is seen in Galatians 3 and verse number 6."
    },
    {
      "id": 119,
      "start": 2319.0999755859375,
      "end": 2323.6599731445312,
      "text": " The Bible says even as Abraham believed God and it was accounted to him for righteousness."
    },
    {
      "id": 120,
      "start": 2323.6599731445312,
      "end": 2327.9400024414062,
      "text": " And we find it in verse number 16 of Galatians 3."
    },
    {
      "id": 121,
      "start": 2327.9400024414062,
      "end": 2328.9400024414062,
      "text": " It says,"
    },
    {
      "id": 122,
      "start": 2328.9400024414062,
      "end": 2333.2599487304688,
      "text": " Now to Abraham and his seed were the promises made."
    },
    {
      "id": 123,
      "start": 2333.2599487304688,
      "end": 2343.719970703125,
      "text": " He saith not unto seeds as of many, but as of one, and to thy seed, which is Christ."
    },
    {
      "id": 124,
      "start": 2343.719970703125,
      "end": 2347.6199951171875,
      "text": " And so we understood as we studied through the 15th chapter of the book of Genesis over"
    },
    {
      "id": 125,
      "start": 2347.6199951171875,
      "end": 2353.2799682617188,
      "text": " these last few weeks and really over the last few chapters of the book of Genesis that this"
    },
    {
      "id": 126,
      "start": 2353.8999633789062,
      "end": 2358.8800048828125,
      "text": " promise has been given to Abram and it's a seed and it's a land and we focus upon that"
    },
    {
      "id": 127,
      "start": 2358.8800048828125,
      "end": 2360.5999755859375,
      "text": " seed and we see that as Christ."
    },
    {
      "id": 128,
      "start": 2360.5999755859375,
      "end": 2366.7999877929688,
      "text": " Now you understand as you go from this portion of scripture in Genesis 12 through 15 and"
    },
    {
      "id": 129,
      "start": 2366.7999877929688,
      "end": 2368.5999755859375,
      "text": " look at how God zeros in."
    },
    {
      "id": 130,
      "start": 2368.5999755859375,
      "end": 2371.3599853515625,
      "text": " Remember he starts in Genesis with creation."
    },
    {
      "id": 131,
      "start": 2371.3599853515625,
      "end": 2375.5199584960938,
      "text": " He looks at the creation of man, all of the different groups of people."
    },
    {
      "id": 132,
      "start": 2375.5199584960938,
      "end": 2379.3999633789062,
      "text": " You see the tower of Babel, the spreading of the people and so on and so forth."
    },
    {
      "id": 133,
      "start": 2379.3999633789062,
      "end": 2386.1199951171875,
      "text": " And then God zeros in upon Abram and the Hebrew people and that will be the direction"
    },
    {
      "id": 134,
      "start": 2386.1199951171875,
      "end": 2390.2999877929688,
      "text": " in which the book of Genesis and really all of scripture begins to travel."
    },
    {
      "id": 135,
      "start": 2390.2999877929688,
      "end": 2394.97998046875,
      "text": " There are references that are provided to us with regard to other people groups as they"
    },
    {
      "id": 136,
      "start": 2394.97998046875,
      "end": 2397.239990234375,
      "text": " interact with God's people."
    },
    {
      "id": 137,
      "start": 2397.239990234375,
      "end": 2398.239990234375,
      "text": " But why?"
    },
    {
      "id": 138,
      "start": 2398.239990234375,
      "end": 2399.239990234375,
      "text": " What's the significance?"
    },
    {
      "id": 139,
      "start": 2399.239990234375,
      "end": 2400.7599487304688,
      "text": " Well, that's the seed."
    },
    {
      "id": 140,
      "start": 2400.7599487304688,
      "end": 2402.5599975585938,
      "text": " That's where Messiah would come from."
    },
    {
      "id": 0,
      "start": 2402.5599975585938,
      "end": 2408.6199975013733,
      "text": " come through the line the messianic line and the significance of all that you"
    },
    {
      "id": 1,
      "start": 2408.6199975013733,
      "end": 2412.1599979400635,
      "text": " read of and you think about the spiritual warfare that were engaged in"
    },
    {
      "id": 2,
      "start": 2412.1599979400635,
      "end": 2418.599998474121,
      "text": " the spiritual battles that Satan has spent all of those years as recorded in"
    },
    {
      "id": 3,
      "start": 2418.599998474121,
      "end": 2424.1399974823,
      "text": " the Old Testament to try to defile and destroy that line so that that Messiah"
    },
    {
      "id": 4,
      "start": 2424.1399974823,
      "end": 2429.7399978637695,
      "text": " would not be able to come. Why is it that that Haman so hated Mordecai? Was it"
    },
    {
      "id": 5,
      "start": 2429.7399978637695,
      "end": 2433.699996948242,
      "text": " just because of Mordecai? Why was it that Haman wouldn't be satisfied with"
    },
    {
      "id": 6,
      "start": 2433.699996948242,
      "end": 2439.0599975585938,
      "text": " simply killing the one that would not bow down? No, he wanted to destroy all the"
    },
    {
      "id": 7,
      "start": 2439.0599975585938,
      "end": 2446.1799964904785,
      "text": " Jews and you see the enemy, Satan, working to try to destroy the promised line, the"
    },
    {
      "id": 8,
      "start": 2446.1799964904785,
      "end": 2451.099998474121,
      "text": " seed. There's also the significance with regard to the land. God had promised them"
    },
    {
      "id": 9,
      "start": 2451.099998474121,
      "end": 2455.2999992370605,
      "text": " this land and you find the territorial battles that have taken place not only"
    },
    {
      "id": 10,
      "start": 2455.379997253418,
      "end": 2459.8999977111816,
      "text": " biblically but even still to this very day. The battles that take place with"
    },
    {
      "id": 11,
      "start": 2459.8999977111816,
      "end": 2464.7399978637695,
      "text": " regard to the land that God promised to his people Israel and you find that"
    },
    {
      "id": 12,
      "start": 2464.7399978637695,
      "end": 2469.0599975585938,
      "text": " throughout the scriptures the the borders of Israel, the children of"
    },
    {
      "id": 13,
      "start": 2469.0599975585938,
      "end": 2473.259994506836,
      "text": " Israel, they were large and they shrunk and they were all kind of all over the"
    },
    {
      "id": 14,
      "start": 2473.259994506836,
      "end": 2477.4599990844727,
      "text": " place throughout their history depending on the particular kings and so on and so"
    },
    {
      "id": 15,
      "start": 2477.4599990844727,
      "end": 2482.099998474121,
      "text": " forth. They never had really reached the fullness of the potential of what God"
    },
    {
      "id": 16,
      "start": 2482.099998474121,
      "end": 2486.819999694824,
      "text": " outlines in Genesis chapter number 15. The closest they ever came is during the"
    },
    {
      "id": 17,
      "start": 2486.819999694824,
      "end": 2491.779998779297,
      "text": " reign of David and that of Solomon. In fact if you look during the time of"
    },
    {
      "id": 18,
      "start": 2491.779998779297,
      "end": 2497.3399963378906,
      "text": " Solomon's reign when God had given rest and after the all of those amazing"
    },
    {
      "id": 19,
      "start": 2497.3399963378906,
      "end": 2500.6199951171875,
      "text": " things that had taken place during of course the reign of David and then"
    },
    {
      "id": 20,
      "start": 2500.6199951171875,
      "end": 2505.4599990844727,
      "text": " entering into the reign of Solomon that God had given rest from from those"
    },
    {
      "id": 21,
      "start": 2505.4599990844727,
      "end": 2510.57999420166,
      "text": " enemies and so on and so forth. But the fullness of this promise with regard to"
    },
    {
      "id": 22,
      "start": 2510.57999420166,
      "end": 2515.379997253418,
      "text": " the territory that is described in Genesis 15 and verse number 18 will"
    },
    {
      "id": 23,
      "start": 2515.379997253418,
      "end": 2520.4599990844727,
      "text": " ultimately be fulfilled during the millennial reign of Christ. And so you"
    },
    {
      "id": 24,
      "start": 2520.4599990844727,
      "end": 2525.1399993896484,
      "text": " begin to see that all the way back in Genesis chapter number 15 how you see so"
    },
    {
      "id": 25,
      "start": 2525.1399993896484,
      "end": 2531.779998779297,
      "text": " many years of time that are being referenced not only with regard to the"
    },
    {
      "id": 26,
      "start": 2531.779998779297,
      "end": 2536.300003051758,
      "text": " people of Israel, the events leading to the possession of the land, the time of"
    },
    {
      "id": 27,
      "start": 2536.3399963378906,
      "end": 2541.8199920654297,
      "text": " Abraham's life of course and his depart his death, but also we see the fullness"
    },
    {
      "id": 28,
      "start": 2541.8199920654297,
      "end": 2548.1399993896484,
      "text": " of the millennial reign of Christ that seed that is mentioned being Christ in"
    },
    {
      "id": 29,
      "start": 2548.1399993896484,
      "end": 2553.020004272461,
      "text": " Galatians chapter 3 and during the time in which he will physically rule"
    },
    {
      "id": 30,
      "start": 2553.020004272461,
      "end": 2557.8199920654297,
      "text": " and reign on this earth for a thousand years. Now we're not there yet we've not"
    },
    {
      "id": 31,
      "start": 2557.8199920654297,
      "end": 2561.459991455078,
      "text": " reached the millennium of course we're going to have the rapture of the church"
    },
    {
      "id": 32,
      "start": 2561.459991455078,
      "end": 2564.459991455078,
      "text": " will take place and the Great Tribulation and then the millennial reign"
    },
    {
      "id": 33,
      "start": 2564.459991455078,
      "end": 2569.1799926757812,
      "text": " of Christ. It will happen and we don't know the time in which it will happen we"
    },
    {
      "id": 34,
      "start": 2569.1799926757812,
      "end": 2573.259994506836,
      "text": " know that it's at least seven years and a few moments away because there's seven"
    },
    {
      "id": 35,
      "start": 2573.259994506836,
      "end": 2577.0999908447266,
      "text": " years of tribulation and the return of the Lord could happen at any moment and"
    },
    {
      "id": 36,
      "start": 2577.0999908447266,
      "end": 2581.699996948242,
      "text": " and that's when that timeline will begin. And so we find that here as we look at"
    },
    {
      "id": 37,
      "start": 2581.699996948242,
      "end": 2587.0599975585938,
      "text": " this passage of Scripture what an exciting opportunity to see that in the"
    },
    {
      "id": 38,
      "start": 2587.0599975585938,
      "end": 2591.6600036621094,
      "text": " life of Abram that God has given these promises he told her about the seed he"
    },
    {
      "id": 39,
      "start": 2591.6600036621094,
      "end": 2595.1399993896484,
      "text": " took him out he said look up in the stars look toward the heaven if you can"
    },
    {
      "id": 40,
      "start": 2595.1399993896484,
      "end": 2600.8999938964844,
      "text": " number them and he says so shall thy seed be. Then he says by the way I'm the"
    },
    {
      "id": 41,
      "start": 2600.8999938964844,
      "end": 2604.4199981689453,
      "text": " Lord that brought you out of the earth the Chaldees to give thee this land to"
    },
    {
      "id": 42,
      "start": 2604.4199981689453,
      "end": 2610.1399993896484,
      "text": " inherit it and Abram says whereby shall I know that I shall inherit it and God"
    },
    {
      "id": 43,
      "start": 2610.1399993896484,
      "end": 2615.220001220703,
      "text": " gives them this sign after he reveals these details he gives them this sign by"
    },
    {
      "id": 44,
      "start": 2615.220001220703,
      "end": 2620.5800018310547,
      "text": " he alone passing through those pieces that were divided showing us the fact"
    },
    {
      "id": 45,
      "start": 2620.5800018310547,
      "end": 2625.459991455078,
      "text": " that this is an unconditional covenant. These things were not based upon"
    },
    {
      "id": 46,
      "start": 2625.459991455078,
      "end": 2630.0999908447266,
      "text": " anything that Abram would do anything that he would offer any gifts that he"
    },
    {
      "id": 47,
      "start": 2630.0999908447266,
      "end": 2634.739990234375,
      "text": " would bring and we understand that salvation for a child of God is all"
    },
    {
      "id": 48,
      "start": 2634.739990234375,
      "end": 2640.020004272461,
      "text": " based on the grace and mercy of God and it's important that we wrap up in that"
    },
    {
      "id": 49,
      "start": 2640.020004272461,
      "end": 2644.3800048828125,
      "text": " fashion this evening. We understand the Bible says for by grace are you saved"
    },
    {
      "id": 50,
      "start": 2644.3800048828125,
      "end": 2648.0599975585938,
      "text": " through faith and that not of yourselves is the gift of God not of works lest any"
    },
    {
      "id": 51,
      "start": 2648.0999908447266,
      "end": 2652.539993286133,
      "text": " man should boast and we understand this evening that our God is gracious and he"
    },
    {
      "id": 52,
      "start": 2652.539993286133,
      "end": 2656.979995727539,
      "text": " is merciful he's full of compassion and he is the Savior of the world and the"
    },
    {
      "id": 53,
      "start": 2656.979995727539,
      "end": 2661.1000061035156,
      "text": " reality this evening is that as we think about the truth of salvation we ought to"
    },
    {
      "id": 54,
      "start": 2661.1000061035156,
      "end": 2664.459991455078,
      "text": " rejoice in the fact that it has everything to do with what the Lord"
    },
    {
      "id": 55,
      "start": 2664.459991455078,
      "end": 2669.1799926757812,
      "text": " Jesus Christ did on the cross of Calvary apart from anything that you could offer"
    },
    {
      "id": 56,
      "start": 2669.1799926757812,
      "end": 2673.220001220703,
      "text": " why because I can't there's nothing good enough that I could do to earn his"
    },
    {
      "id": 57,
      "start": 2673.220001220703,
      "end": 2680.220001220703,
      "text": " merit to earn his salvation it is the gift of God not by not by our works of"
    },
    {
      "id": 58,
      "start": 2680.220001220703,
      "end": 2684.8200073242188,
      "text": " righteousness the Bible says that the wages of sin is death but the gift of"
    },
    {
      "id": 59,
      "start": 2684.8200073242188,
      "end": 2688.9400024414062,
      "text": " God is eternal life through Jesus Christ our Lord I'm so thankful that Jesus said"
    },
    {
      "id": 60,
      "start": 2688.9400024414062,
      "end": 2694.6199951171875,
      "text": " on the cross of Calvary it is finished he paid for your sin and for my sin he"
    },
    {
      "id": 61,
      "start": 2694.6199951171875,
      "end": 2698.5799865722656,
      "text": " paid for the sin of the world and we find that the truth of salvation the"
    },
    {
      "id": 62,
      "start": 2698.5799865722656,
      "end": 2702.7000122070312,
      "text": " promise that God has given with regard to salvation in like manner to this"
    },
    {
      "id": 63,
      "start": 2702.7000122070312,
      "end": 2706.7000122070312,
      "text": " promise that he gave to Abram in Genesis chapter number 15 it has nothing"
    },
    {
      "id": 64,
      "start": 2706.7000122070312,
      "end": 2710.5,
      "text": " to do with anything that we would do other than just simply believing and"
    },
    {
      "id": 65,
      "start": 2710.5,
      "end": 2714.8999938964844,
      "text": " receiving and receive that great promise that he said for whosoever shall call"
    },
    {
      "id": 66,
      "start": 2714.8999938964844,
      "end": 2720.6199951171875,
      "text": " upon the name of the Lord shall be saved I'm so thankful for the truth of"
    },
    {
      "id": 67,
      "start": 2720.6199951171875,
      "end": 2725.4199829101562,
      "text": " salvation this evening as we understand the foundational aspect I understand it"
    },
    {
      "id": 68,
      "start": 2725.4199829101562,
      "end": 2731.019989013672,
      "text": " was more teachy this evening but as we understand the foundational the the"
    },
    {
      "id": 69,
      "start": 2731.019989013672,
      "end": 2736.980010986328,
      "text": " impact of Genesis chapter 15 it will help us to understand the events that"
    },
    {
      "id": 70,
      "start": 2736.980010986328,
      "end": 2740.6199951171875,
      "text": " take place within the next pages of Scripture not only here in the book of"
    },
    {
      "id": 71,
      "start": 2740.6199951171875,
      "end": 2744.779998779297,
      "text": " Genesis but throughout the whole of Scripture with regard to this covenant"
    },
    {
      "id": 72,
      "start": 2744.779998779297,
      "end": 2751.220001220703,
      "text": " that God made with Abram it is a significant event that helps if we don't"
    },
    {
      "id": 73,
      "start": 2751.220001220703,
      "end": 2756.3399963378906,
      "text": " fully comprehend and understand this event in Genesis 15 it really hinders us"
    },
    {
      "id": 74,
      "start": 2756.3399963378906,
      "end": 2760.8599853515625,
      "text": " from a proper understanding of future things that will be detailed and dealt"
    },
    {
      "id": 75,
      "start": 2760.8599853515625,
      "end": 2764.980010986328,
      "text": " with throughout the Word of God and that's why the book of Genesis is so"
    },
    {
      "id": 76,
      "start": 2764.980010986328,
      "end": 2770.260009765625,
      "text": " foundational and I believe that's why the book of Genesis is under such great"
    },
    {
      "id": 77,
      "start": 2770.260009765625,
      "end": 2776.739990234375,
      "text": " attack because it's so foundational to understanding the whole of Scripture let"
    },
    {
      "id": 78,
      "start": 2776.739990234375,
      "end": 2780.4199829101562,
      "text": " us pray together father we love you this evening we thank you for loving us we"
    },
    {
      "id": 79,
      "start": 2780.4199829101562,
      "end": 2785.4199829101562,
      "text": " thank you for the Word of God the truth contained therein we thank you for this"
    },
    {
      "id": 80,
      "start": 2785.4199829101562,
      "end": 2791.4199829101562,
      "text": " truth that you gave us in Genesis 15 that sets the firm foundation with"
    },
    {
      "id": 81,
      "start": 2791.4199829101562,
      "end": 2796.9400024414062,
      "text": " regard to your dealings with the the children of Israel with the Hebrews the"
    },
    {
      "id": 82,
      "start": 2796.9400024414062,
      "end": 2801.5,
      "text": " Jewish race and as we begin to study throughout the rest of this book and"
    },
    {
      "id": 83,
      "start": 2801.5,
      "end": 2806.0599975585938,
      "text": " even the whole of Scripture and we see just your interactions and your dealings"
    },
    {
      "id": 84,
      "start": 2806.0599975585938,
      "end": 2809.260009765625,
      "text": " and Lord we thank you for this covenant that was made with Abram on this"
    },
    {
      "id": 85,
      "start": 2809.260009765625,
      "end": 2814.8999938964844,
      "text": " particular day and in its significance I pray that you would help us to rejoice"
    },
    {
      "id": 86,
      "start": 2814.8999938964844,
      "end": 2820.2999877929688,
      "text": " in the fact that you are eternal and omniscient that you are able to with"
    },
    {
      "id": 87,
      "start": 2820.2999877929688,
      "end": 2827.019989013672,
      "text": " specific detail lay out events that will happen generations to come even as we"
    },
    {
      "id": 88,
      "start": 2827.019989013672,
      "end": 2831.6600036621094,
      "text": " see here in the life of Abram because you are eternal and because you are"
    },
    {
      "id": 89,
      "start": 2831.6600036621094,
      "end": 2836.980010986328,
      "text": " omniscient I pray God that you'd help us to rest in that and help us to find just"
    },
    {
      "id": 90,
      "start": 2836.980010986328,
      "end": 2841.779998779297,
      "text": " have our faith increased and to find great encouragement through those truths"
    },
    {
      "id": 91,
      "start": 2841.779998779297,
      "end": 2845.4199829101562,
      "text": " this evening I pray God that if there's one that has never trusted the Lord"
    },
    {
      "id": 92,
      "start": 2845.4199829101562,
      "end": 2849.1799926757812,
      "text": " Jesus Christ as their personal Savior they do not know for sure if they were"
    },
    {
      "id": 93,
      "start": 2849.1799926757812,
      "end": 2852.6600036621094,
      "text": " denied today that heaven is their home I pray God that they'd understand the"
    },
    {
      "id": 94,
      "start": 2852.6600036621094,
      "end": 2856.9400024414062,
      "text": " truth of salvation redemption through the blood of Christ that Jesus Christ"
    },
    {
      "id": 95,
      "start": 2856.9400024414062,
      "end": 2861.459991455078,
      "text": " the Son of God went to that cruel cross he suffered and bled and died he was"
    },
    {
      "id": 96,
      "start": 2861.459991455078,
      "end": 2864.980010986328,
      "text": " buried in a borrowed tomb and he rose in victory conquering sin death in the"
    },
    {
      "id": 97,
      "start": 2864.980010986328,
      "end": 2871.3399963378906,
      "text": " grave he said he declared it is finished and I pray this evening that if there's"
    },
    {
      "id": 98,
      "start": 2871.3399963378906,
      "end": 2875.459991455078,
      "text": " one under the sound of my voice whether they're here present in our auditorium"
    },
    {
      "id": 99,
      "start": 2875.459991455078,
      "end": 2879.1000061035156,
      "text": " or they're watching online that they never have trusted Christ as their"
    },
    {
      "id": 100,
      "start": 2879.1000061035156,
      "end": 2883.9400024414062,
      "text": " Savior that they would understand the promise of redemption the gift of God"
    },
    {
      "id": 101,
      "start": 2883.9400024414062,
      "end": 2888.3399963378906,
      "text": " which is eternal life through Jesus Christ our Lord and that today is the"
    },
    {
      "id": 102,
      "start": 2888.3399963378906,
      "end": 2892.220001220703,
      "text": " day of salvation the Bible declares for whosoever shall call upon the name of"
    },
    {
      "id": 103,
      "start": 2892.220001220703,
      "end": 2897.0599975585938,
      "text": " the Lord shall be saved have your will and way in these moments of invitation"
    },
    {
      "id": 104,
      "start": 2897.0599975585938,
      "end": 2899.8599853515625,
      "text": " and we'll thank you for all that you'll do for it's in Christ's name we pray"
    }
  ],
  "processed_at": "2025-04-17T10:11:45.205095"
}