{
  "video_id": "6ujPxedm1ss",
  "text": "and the Old Testament. And this is just gonna be a launching point this evening. And eventually, as we begin here, we will also end here in Jonah chapter number four, verses one and two. And we will continue with our Ask the Pastor series. And I'll be honest, if you look in the bulletin, there's a different series, or title for a message this evening. And that's because I was gonna preach a different Ask the Pastor, but the folks aren't here. And I am not gonna always be able to adjust that, but it happens that I'm able to adjust it for this evening and wanna try to make sure. I didn't wanna be like, well, it's too bad you weren't here, get the recording, sort of a situation. So we'll try to adjust that as we can. So if you've given a question and you know you're gonna be on vacation, would you let me know? And that might help a little bit. But Jonah chapter four, look at verses one and two. If you're familiar with the book of Jonah, of course, we know that Jonah's already been swallowed by the great fish and he's already been spewed out. He's already gone to Nineveh and he's preached. And we come to the fourth chapter. The people of Nineveh have responded in repentance. And it says this in verse number one, but it displeased Jonah exceedingly. And he was very angry. Notice it says, he prayed unto the Lord and said, \"'I pray thee, O Lord, was not this my saying \"'when I was yet in my country? \"'Therefore I fled before unto Tarshish, why? \"'For I knew that thou art a gracious God, \"'and merciful, slow to anger, and of great kindness, \"'and repentest thee of the evil.'\" I wanna preach a message tonight that I've titled from verse number two, I knew that thou art a gracious God. The question that was submitted says this, many skeptics of Christianity say they like the God of the New Testament, but not the God of the Old Testament. How do we, as the people of God, explain the annihilation of whole people groups as being in line with a truly loving and merciful God? And I think it's a great question, one in which you may have been exposed to, where someone will question you with regard to noticing or at least seeming to notice a contradiction between the Old and New Testament. And I believe it's a wonderful question. I hope that you'd bear with me this evening as a preacher friend of mine says, I didn't come to church to get out of church, I came in to get something from church. And I will admit to you at the very beginning, it's gonna be a little bit longer of a message this evening and at least that's what my notes say. And we hope that we'll get through it and hope that it makes sense. But in order to answer the question, I believe it's imperative for us to understand and acknowledge all of God's attributes. And we will not study all of his attributes this evening, but with dealing with the question specifically, with regard to God being loving and merciful and seeing this seeming discrepancy, we also notice that yes, God is loving and God is merciful and we ought to rejoice in that. But at the very same time, we understand that God is righteous and he is just. And as we understand the attributes of God and we understand the character of God as it's been revealed to us in the word of God, we would understand that God's attributes are in perfect harmony. We as people, as human beings, our attributes are not always in perfect harmony. In fact, there are times in which we perhaps had a bad day and we're more on the side of judgment than we are on the side of grace or mercy. And we find that we can fluctuate as human beings, but God is perfect in his attributes and they are harmonious. We find this, it's interesting to me and you don't need to turn there, but in Genesis chapter number 18 and verse number 25, as Abraham is having a conversation with the Lord regarding the pending destruction of Sodom and Gomorrah, we find that in that verse of scripture, Abraham reveals to us and we are given the truth of two very important aspects of our God. Number one is this, God is the judge of all the earth. Number two, he always does what is right. And so we find that Abraham is having this conversation with the Lord and he's finding out about the impending judgment of Sodom and Gomorrah. And Abraham, as he's having this conversation, he reveals two important truths. Number one, God is the judge of all the earth. And number two, he always does what is right. So I believe as we begin starting this message this evening that many of those that would come to a perspective such as what has been asked this evening, I believe that for many of them, obviously I cannot say for all of them, I would never seek to do so because of the individual nature of those that would have this perspective, but for many of them, I believe that perhaps they have approached the Bible incorrectly and incompletely. And why I say that is for this reason, I believe that their approach, many times individual skeptics that would approach the Bible, they have an approach of a critical nature. They approach the Bible by seeking to find fault and criticize, and therefore they reach a faulty conclusion. Why is that? Well, because they just like to look at certain portions of scripture. They look to a certain portion that's going to be in line with what they want, what fits their presupposition, and therefore they're going to seek a passage that they can run to and support what they already think. Now, as the people of God, we understand that our approach to God's word is much different. Our approach to God's word, my approach to God's word, is God is right and I'm in error, right? And so as I come to the word of God, it's God's word that is going to correct and instruct my thinking. And if I approach the word of God at that level, and I approach the word of God with understanding that he is the judge of all the earth, that he always does that which is right, that he is perfect in harmony with regard to his attributes, then my perspective of the word of God is going to be quite different. Let me also say this by way of introduction. The Bible tells us in the book of 1 Corinthians that the natural man receiveth not the things of the spirit of God. Why? Because they are foolishness unto him. They must be spiritually discerned. And so as we go to the word of God and we begin to seek the face of God and looking at God's word, we want to give an honest approach to the word of God. And indeed, there are times in which, as the skeptics would say, as the question gives us this evening, that there are people groups that are destroyed. And there are some that would look at that and say, how could that be in line with a God who's loving and merciful? I hope this evening that after reviewing several examples that we could conclude, even as Jonah concluded there in Jonah 4, that we know that God is gracious. He's gracious. There's a number of other things that are mentioned there in Jonah 4 and verse number two that we'll look at as we end this evening. Let me start here with the Egyptians, if we could. I'm gonna give a number of examples. These examples were not given on the question that was asked but I will give some examples of perhaps what is being referred to and hope that that helps us to answer the question. Turn to Exodus chapter number four, if you will. In Exodus chapter number four, we find that in verses 22 and 23, Moses has been given instruction. He's objected and God has given him the signs, the miracles. And we find that in Exodus chapter four in verse number 22, notice what God says to Moses. He says, and thou shalt say unto Pharaoh, thus saith the Lord, Israel is my son, even my firstborn. And I say unto thee, let my son go, that he may serve me. And if thou refuse to let him go, behold, I will slay thy son, even thy firstborn. I have every belief as we look at this instruction that God gives to Moses in Exodus four in verses 22 and 23. I have every reason to believe that Moses faithfully communicated to Pharaoh what was at stake, that God said to Moses, deliver this message to Pharaoh. If he doesn't let my people go, that I will slay thy son, even thy firstborn. Over the next several chapters, we find the interaction between Moses and Pharaoh. And of course, Aaron is there. And we find that as Moses is interacting with Pharaoh, that in chapter seven through 10, plagues one through nine are recorded for us. As you read about those plagues, you read about the devastation, you read about the destruction of Egypt, you read about how that in Exodus 8 and verse 19, how that the people, the counselors of Pharaoh, they say they recognize that this is the finger of God. We find it in the 10th chapter that the people, the counselors of Pharaoh, they say to Pharaoh, do you not know that our land has been destroyed? And we find that God was revealing Himself to Pharaoh and to the Egyptians. I believe that in so doing, that God was demonstrating a measure of grace, a measure of mercy. Because when Moses first comes to Pharaoh and says, God said, let my people go. Pharaoh says, who's God? And so God begins to reveal Himself and to reveal His power. And everything that God said He would do, He did. In the ninth chapter, which would reveal His power, record for us the seventh plague. I want you to notice that in verse number 19 the Bible says this, Moses of course has received the instruction from God and I believe this is a great picture of God's mercy, of God's love and grace. Notice what he says before the arrival of the seventh plague, send therefore now and gather thy cattle and all that thou hast in the field. For upon every man and beast which shall be found in the field and shall not be brought home, the hail shall come down upon them and they shall die. That's gracious and merciful of God to let them know of what was going to happen. And we find that even after six plagues had already taken place and all that God had demonstrated that particular point, that the response of the people was still mixed. Even though God gave him warning, the Bible tells us in verse number 20 that he that feared the word of the Lord among the servants of Pharaoh made his servants and his cattle flee into the houses. They believed. They responded to the merciful truth that God had given the warning. We find that in verse 21 it says, and he that regarded not the word of the Lord left his servants and his cattle in the field. What happened to them? They died. They died. The plague came just as God said. We find that the scriptures, it's interesting to me and we don't have time to develop each of these truths that we'll look at this evening, but I do want you to understand that the scriptures record for us interaction between Pharaoh and Moses during several of the plagues. And in those interactions you will find that many times Pharaoh makes the request, would you make the plague stop? And God graciously responds to that request and the plague is stayed. But you know it's interesting to me that with regard to the death of the firstborn, there's no request. There's no reference that we find that as God would reveal to, of course, at the end of chapter 10 we find that Pharaoh told Moses to flee, get out of his sight, that in the day that I see your face you're gonna die. And we find that Pharaoh had expelled Moses from his presence, but all the way back as we mentioned in chapter 4 that God had set the consequence. If you don't let my people go, the firstborn is gonna die. And there was no request, there was no interaction between Pharaoh saying, okay Moses how do we avoid that? Just let the people go. Let me say this also, it was the Egyptians that had given the instruction, in fact Pharaoh himself, to kill all of the male children of the children of Israel. They were very known for human sacrifice themselves and so we find that this is a situation in which I believe as you look at the text of Scripture and you honestly evaluate these chapters that provide us the record of the the plagues and the consequence of the death of the firstborn, that God indeed was gracious and merciful. He didn't just come in and wipe them out in just a moment, he came in and revealed himself to them. Who is God? Okay, over the next several plagues you're gonna see who God is. And they still rejected. I believe this evening that Pharaoh had been given light, yet he failed to respond to the light that was given. And in a lack of response or maybe in responding to that light by rejecting the light, we find that he had to deal with the consequences and the nation of Egypt dealt with the consequences. I think about not only the Egyptians but I think about the Amorites. We think about the Amorites, we find that God provides details for us in the Abrahamic Covenant as it's recorded in Genesis chapter 15 and as God would give the Abrahamic Covenant in Genesis chapter 15, not only would he speak about all of the the details with regard to the place and what have you, but he also speaks of the time of the Abrahamic Covenant, the time of entering into the land that was promised. And we find that in Genesis 15 and verse number 16, God says this, but in the fourth generation they shall come hither again. Notice what he says, for the iniquity of the Amorites is not yet full. We read that statement that the iniquity of the Amorites is not yet full. In other words, I believe that God here is demonstrating once again his grace and his mercy. Why? Because he was going to give them time to repent. He was going to give them opportunity to repent before his judgment would come. It's interesting as you go to the book of Joshua, turn to the book of Joshua, if you will, in chapter number 5, because we begin to see some things about the Amorites here in Joshua chapter number 5, and we find that the Amorites in chapter number 5 of the book of Joshua and also in chapter number 10, there's a different response of the Amorites, the king of the Amorites, the kings, excuse me, of the Amorites, versus the response that we see of Rahab in Joshua chapter number 2. Here in Joshua chapter number 5 and verse number 1, notice what the Bible says, and it came to pass when all the kings of the Amorites, which were on the side of Jordan westward, and all the kings of the Canaanites, which were by the sea, heard that the Lord had dried up the waters of Jordan from before the children of Israel until we were passed over, that their heart melted, neither was their spirit in them anymore because of the children of Israel. That's very similar to what we read of Rahab as the spies went, as we read in Joshua chapter number 2, when the spies go into Jericho, and we read about the understanding of Rahab and the people of Jericho, and the Bible tells us in Joshua chapter 2 and verse number 9 that Rahab says to these men, I know that the Lord hath given you the land, and that your terror is fallen upon us, and that all the inhabitants of the land faint because of you. For we have heard how the Lord dried up the water of the Red Sea for you when you came out of Egypt, and what ye did under the two kings of the Amorites that were on the other side, Jordan, Sihon, and Og, whom ye utterly destroyed. By the way, with Sihon in particular, it was asked that they could pass through freely. They did not want to have interaction, but there was a rejection of that. You can go back and read of that in the book of Numbers. Notice it says in verse number, well we won't continue reading, but you remember that Rahab believed that God was going to give the people of Israel the land, and she feared, and there was an agreement that was made. There was a scarlet thread that was hung out, and God through these spies told Rahab that there's safety in the house. Jericho was still destroyed, but Rahab and whoever she had in the house, there was mercy, there was grace. Why? Because of a response. But notice I mentioned in Joshua 5 that these kings of the Amorites, it's also mentioned about the Canaanites here, that they hear about this, but I want you to see what their response is, and really you got to flip over to chapter number 10, and I want you to really see the response of the kings of the Amorites as it's recorded for us in Joshua chapter number 10. In fact, we find that it's in Joshua chapter number 9, the account of the Gibeonites, and if you want to have an add-on to the message from this morning of the way in which the false teachers, the depth of depravity, excuse me, deception, read about the Gibeonites in Joshua chapter number 9. We find that we, after the situation with southern Canaan being destroyed in Joshua 9 and all the victory, that in Joshua chapter number 10, these five kings of the Amorites, as it's mentioned in verse number 5, the king of Jerusalem, the king of Hebron, the king of Jarmut, the king of Lachish, the king of Eglon, they gathered themselves together and went up, they and all their hosts, and encamped before Gibeon and made war against it, and they would soon be defeated. So we find that the Amorites, as it's mentioned because of the reference in Genesis chapter 15, and then here in the book of Joshua, and we read about the fact that they were destroyed, but you think about the mercy and the grace of God even still being understood within the context of their destruction. For Rahab responded in belief, but these kings of the Amorites, they formed a coalition to go into battle. We find that they were ultimately defeated. One that many like to look at is the Amalekites, and turn over the book of 1st Samuel, if you will, and I want you to look here. Of course, this instruction is given in 1st Samuel chapter 15 with regard to the Amalekites, and maybe this is one in which someone had in mind. As you look at the instruction that Samuel would give to Saul, we find that this instruction is given with regard to the Amalekites, and it says in verse number one of 1st Samuel 15, Samuel also said unto Saul, the Lord sent me to anoint thee to be king over his people, over Israel. Now therefore hearken thou unto the voice of the words of the Lord. Thus saith the Lord of hosts. Notice what it says, I remember that which Amalek did to Israel, how he laid wait for him in the way when he came up from Egypt. Now go and smite Amalek, and utterly destroy all that they have, and spare them not, but slay both man and woman, infant and suckling, ox and sheep, camel and ass. There are people that look at verse number three completely out of the context of verse number two, or of Exodus and Deuteronomy, and say, man, God gave the instruction to just annihilate all of them. Notice what he says in verse number two, I remember that which Amalek did to Israel. Well what is it that Amalek did to Israel? Turn back to Exodus chapter number 17. In Exodus chapter number 17, of course we understand that at this particular point they've already left Egypt, they've already crossed the Red Sea, they've already complained about water and about food and about water again, and God has miraculously provided for them. But then we find that as we come to the latter part of Exodus chapter number 17 in verse number 8 the Bible begins to reveal to us this about Amalek and it says then came Amalek and fought with Israel in Rephidim and Moses said unto Joshua choose us out men and go out fight with Amalek Tomorrow I will stand on the top of the hill with the rod of God in mine hand and this is the time in which remember they had to stay up the hands of Moses and as Moses hands were stayed up the children of Israel had victory as they were let down they had defeat We find that in verse number 16 of Exodus 17 the Bible says Because the Lord hath sworn that the Lord will have war with Amalek from generation to generation Now what is it that the Amalekites did? What is it that the king of Amalek did? Well, God gives us more insight to that in the book of Deuteronomy in chapter number 25 in Deuteronomy chapter number 25 God gives us some insight as to the tactics of the Amalekites the behavior of the Amalekites and what they did and God is using Moses here in Deuteronomy to prepare the nation of Israel for entrance into the land and he's going to remind them of This and what it is that they're to do notice. It says in verse 17 of Deuteronomy 25 Remember what Amalek did unto thee by the way? When you were come forth out of Egypt, what is it that he did notice verse 18? How he met thee by the way and smote the hindmost of thee even all that were feeble behind thee when thou was faint and weary and he feared not God That's what he did So therefore verse 19 it shall be when the Lord thy God hath given thee rest from all thine enemies round about in the land Which the Lord thy God giveth thee for an inheritance to possess it that thou shalt blot out the remembrance of Amalek from under heaven Thou shalt not forget it So when read first Samuel 15 apart from Exodus 17 apart from Deuteronomy 25 You can certainly come to a different conclusion You can reach a conclusion that says how could God do that? Well God says I remember what they did and here's what the Consequences here's what's going to happen and we read it in Exodus chapter 17. We read it in Deuteronomy 25 what the details are of The behavior of Amalek and the Amalekites Think about the people of Nineveh. I'm going to use this from a positive perspective toward the book of Jonah if you will I'm trying to use this as a contrast between the the two Aspects in which we're looking at here in the city of Nineveh I believe that as Jonah preaches this message after God got a hold of them in Jonah 3 and verse number 4 The Bible tells us that he began to enter into the city a day's journey and he cried and said yet 40 days in Nineveh shall be overthrown. I Believe with all my heart that Nineveh Including the hundred and twenty thousand children in Nineveh and we get that number from Jonah 4 in verse number 11 After God deals with Jonah and the Gourd and all of that situation He says in verse 11 of chapter 4 and should not I spare Nineveh that great city where there are more than six 64,000 persons that cannot discern between the right hand and their left hand and also much cattle I believe that in 40 days based on the preaching of Jonah in verse number 4 of Jonah 3 that God would have destroyed Nineveh including those hundred and twenty thousand children and He would have destroyed them, but we find that the response of the people of Nineveh Stayed the judgment of God and spared the people Notice in verse number 5 of Jonah chapter number 3 the Bible says so the people of Nineveh believed God They believed God they proclaimed a fast and put on sackcloth from the greatest of them Even to the least of them verse 10. You can read the rest of it later but in verse number 10 It says that God saw their works that they turned from their evil way and God Repented of the evil that he had said that he would do unto them and he did it not. I believe again that God would have Destroyed the city of Nineveh all of the inhabitants including those hundred and twenty thousand children the question that we could ask about the Situation there with Egypt the situation here with Nineveh and you look at two very different situations where God is revealing himself to Pharaoh and to the people of Egypt and the the Magicians they are recognizing as they see these These plagues and these miracles they are recognizing. This is the finger of God But yet there's not a response like we read of in Nineveh There continues to be a refusal to let the people of God go they see the Time in which God allowed for these plagues and all that he does and he reveals his his grace I believe in his mercy to the Egyptians yet. They continue to resist yet for the people of Nineveh They respond with repentance and thus they are spared So as we look at the text of Scripture we look at these examples the the the Egyptians the Amorites the Amalekites the people of Nineveh We see the people of Nineveh have a different outcome than the other three that we've looked at but we find that God. Yes He is just and he is righteous and he is the judge of all the earth This evening we could ask the question would God have been justified in destroying the the people of Egypt Would God have been justified in destroying the the people of Nineveh? Yes One was destroyed and one was spared what was different not God the response of the people And we find this evening that our God is no Respecter of persons and we find that as we look at these examples We again mention how that he says that the iniquity of the Amorites is not yet full you read about the Amalekites and it's Specifically a result of their own behavior and the judgment of God and we find that here God's judgment is seen yes but if you look at it in its Entirety and look at the entirety of the passages and all that goes into it You find that it's not void of God being merciful. It's not void of God giving space for repentance for we see that in Nineveh and Let me say this as we would consider God's judgment and perhaps those that would like to Reach this conclusion and have this perspective of that which was asked this evening Oftentimes they would look at the people groups as being different The the people groups void of Israel right other than Israel Maybe I should say it that way and this evening for just a few minutes I want us to consider God's judgment upon his own people and As we consider God's judgment upon his own people. I believe that it demonstrates God's justice in a very clear way Because God is no respecter of persons and so when God judges these people groups that we speak of and people say look at what God did to This people group or that people group I say yes, he did But do you want to look at what God did in the nation of Israel who were his own people? Why because God is just Right. God is merciful, but God is just think with me turn to look at 2nd Chronicles if you will and 2nd Chronicles chapter number 7 and many times when we speak about 2nd Chronicles chapter number 7 a verse Immediately comes to our mind and that's verse number 14 If my people which are called by my name shall humble themselves and pray and seek my face and turn from their wicked ways Then will I hear from heaven and will forgive their sin and will heal their land. What a great verse But I want you to understand that in 2nd Chronicles chapter number 7 not only does God give that promise We've looked at that as being revival promise But I want you to notice what God says in verses 19 through 22 with regard to his judgment Notice in verse number 19 But if you turn away and forsake my statutes and my commandments Which I have set before you and shall go and serve other gods and worship them Then will I pluck them up by the roots out of my land Which I have given them and this house which I have sanctified for my name will I cast out of my sight and will make? It to be a proverb and a byword among all nations in this house Which is high shall be an astonishment to everyone that passeth by it so that he shall say why hath the Lord done thus? Unto this land and unto this house and it shall be answered Because they forsook the Lord God of their fathers Which brought them forth out of the land of Egypt and laid hold on other gods and worshiped them and served them Therefore hath he brought all this evil upon them If you want to jot down in your notes, I won't take time to read all the verses But look at Psalm 106 verses 35 through 43 You'll see how the psalmist records this very same truth with regard to the judgment of God the justice of God I want you to think about it within the context of the Assyrian captivity and second Kings chapter number seven and I know we're in a lot of places this evening and I Hope that as we look and compare scripture with scripture that we don't want to just take one isolated incident From here or from the Word of God and come to a conclusion First Kings chapter number seven. I think I said second Kings, but it's first Kings chapter number seven seventeen, excuse me First Kings chapter number seventeen and I want you to look here at what the Word of God tells us. I Don't know why I'm in first King it did I say second Kings at first I Said first I said second now, I'm gonna say second again. All right 2 Kings chapter 17, please forgive me. 2 Kings chapter 17, my notes even say 2 Kings 17. But beginning in verse number seven, 2 Kings 17 and verse number seven, I will not have time to read all the way down through verse number 23, but this really records for us the record of the Assyrian captivity of the nation of Israel, the 10 tribes of the north. In verse number seven it says, for so it was that the children of Israel had sinned against the Lord their God, which had brought them up out of the land of Egypt from under the hand of Pharaoh, king of Egypt, and had feared other gods. And notice what it says in verse number 14, notwithstanding they would not hear, but hardened their necks like to the neck of their fathers that did not believe in the Lord God. They rejected his statutes and his covenant that he made with their fathers and his testimonies, which he testified against them. And they followed vanity and became vain and went after the heathen that were around about them, concerning whom the Lord had charged that they should not do like them. And they left all the commandments of the Lord their God and made them molten images, even two calves, and made a grove and worshiped all the host of heaven and served Baal. Notice in verse 18 it says, therefore the Lord was very angry with Israel and removed them out of his sight. There was none left but the tribe of Judah only. And verse number 23 says, until the Lord removed Israel out of his sight, as he had said by all his servants, the prophets, so was Israel carried away out of their own land to Assyria unto this day. They face judgment. They face the justice of God because of their wickedness, because of their behavior. Does it mean that God isn't merciful? Oh no, God is merciful. But they rejected. The Bible told us as we looked at these verses here, it says that they would not hear, that they hardened their necks, that they rejected his statutes, that they left all of his commandments and the judgment of God comes. We read this of the Assyrian captivity. I want you to think about the Babylonian captivity of Judah from the book of Jeremiah, if you will. And I want you to notice, there's some very strong language in the book of Jeremiah that I really hope helps us this evening with regard to this subject that is before us. Because again, there are people that will bring this charge against God, that they will bring this charge as they look at the word of God and they'll say that there's some discrepancy. But I hope that as we look at God's dealings with his own people, the nation of Israel, that we would see very clearly that yes, our God is merciful and gracious, but our God is righteous and just. And his attributes are in perfect harmony. In Jeremiah 11, look at verses 11 through 13. Notice what the word of God says. Therefore, thus saith the Lord, behold, I will bring evil upon them, which they shall not be able to escape. And though they shall cry unto me, I will not hearken unto them. You say, God said that? Yes. God said that. And he's not talking about the Amalekites or the Amorites or the Philistines or the Egyptians or the people of Nineveh. He's talking about his own people, Judah. He says in verse number 12, then shall the cities of Judah and inhabitants of Jerusalem go and cry unto the gods unto whom they offer incense, but they shall not save them at all in the time of their trouble. For according to their number of thy cities were thy gods, O Judah. And according to the number of the streets of Jerusalem, have you set up altars to that shameful thing, even altars to burn incense unto Baal. God says, I'm gonna judge you. He says in verse number 13, I will bring evil upon them that they shall not be able to escape. Notice in Jeremiah chapter 21, turn over several chapters, if you will. You can look at verses one through 10 for sake of time. I just want to look at verses four through six. Jeremiah is responding to Zedekiah. The request had been made that he would inquire of the Lord. Notice in verse two, this is the request. I pray thee of the Lord for us, for Nebuchadnezzar, king of Babylon, maketh war against us. If so be that the Lord will deal with us according to all his wondrous works that he may go up from us. They're wanting God to just intervene into some miraculous way in his wondrous works. And they say, Jeremiah, go inquire the Lord for us and find out if he's gonna show up and deal mightily for us. Jeremiah said unto them, thus shall you say to Zedekiah. Look at verse four. Thus saith the Lord God of Israel. Behold, I will turn back the weapons of war that are in your hands, wherewith you fight against the king of Babylon and against the Chaldeans, which besiege you without the walls. And I will assemble them into the midst of this city. And I myself will fight against you with an outstretched hand and with a strong arm, even in anger and in fury and in great wrath. And I will smite the inhabitants of this city, both man and beast. They shall die of a great pestilence. That's not the answer they were hoping for. But if you read the indictment against Judah in the beginning of the book of Jeremiah, you find that there are people that forgot the Lord, they forsook the Lord and they followed after idols. And God said, you're not listening to my prophets. There's no repentance. Judgment is coming. Did God not send a prophet? Jeremiah's prophesying until he can't talk anymore. And there's just rejection. So guess what happens? Judgment. They're carried away into Babylon. Turn to the book of 2 Chronicles, if you will. 2 Chronicles chapter number 36. I want you to notice here, as it's described to us, the Babylonian captivity. We read there in 2 Kings 17 about the Assyrian captivity. Here in 2 Chronicles 36 and verse number 15, the Bible says this, and the Lord God of their father sent to them by his messengers, rising up at times and sending because he had had compassion on his people and on his dwelling place. God is merciful, he's gracious, but notice what they did. They mocked the messengers of God and despised his words and misused his prophets until the wrath of the Lord rose against his people. Notice the last statement of verse 16, till there was no remedy. Wow. Yeah, God is merciful, but God is just. And it's not just that as you study the Old Testament that there's some people groups outside of Israel that face the judgment of God because of their wickedness, the iniquity of the Amorites. Listen, they were wicked people that served idols and God gave them space to repent, but they repented not. And we find that God, his judgment comes, but his judgment came for the nation of Israel as well. And I believe that that ought to help us to understand the fullness of God's attributes this evening that he is gracious and merciful, but he's righteous and just. The question put a statement with regard to the God of the Old Testament versus the God of the New Testament, that they like the God of the New Testament, but they do not like the God of the Old Testament. I said this that I feel like, and again, not all, but many, have an approach to the Bible that's incorrect and incomplete. Why do I say that? Well, turn to the book of Acts. New Testament, by the way. In Acts 5, you reach a faulty conclusion when you have a faulty approach. If you want your approach to be that God is unjust in the things that he did, you begin to read to that end. If you want to see a distinction between the Old and New Testament, perhaps you ignore certain passages like we'll look at here in the New Testament very quickly as we conclude. We find that there's judgment in the New Testament as well. In Acts 5, we read of Ananias and Sapphira. What was the offense of Ananias and Sapphira? They lied. They lied. Now, sin is sin, right? We see that in the Word of God. But you know, for many people today, I would say many people today on a Sunday in the United States of America that sat in church today, lying is no big deal to them. They don't even think about it. They don't even think twice about lying. If it means that I'm gonna face a consequence that's not pleasant, I mean, people lie all the time. I'm not saying that it's right, it's wrong. But the offense of Ananias and Sapphira is that they lied. The Bible records for us here that Peter actually says to them, listen, when it was your land, you could have kept it. You didn't have to sell it. And when you sold your land and you made your money, you didn't have to give it all. Right? That's what happens. We won't take time to read all of it, but I want you to notice what happens that Peter says that you've conceived this thing in thine heart. You've lied, not unto men at the end of verse number four, but unto God. And Ananias, hearing these words, fell down and gave up the ghost. And great fear came on all them that heard these things. I guess so. Right? I mean, what happens if one of us lied today and you just died? Do you understand what I'm saying? It would impact us. Sapphira, the Bible tells us, it continues. In verse number six, the young man arose, wound him up, and carried him out and buried him. And it was about the space of three hours after when his wife, not knowing what was done, came in. And she's asked the same line of questions. And she says, yep, yay for so much. At the end of verse number eight, then Peter said unto her, how is it that ye have agreed together to tempt the Spirit of the Lord? Behold, the feet of them which have buried thy husband are at the door and shall carry thee out. Then fell she down straightway at his feet and yielded up the ghost. And the young men came in and found her dead and carrying her forth, buried her by her husband. Look at the result in verse number 11. And great fear came upon all the church. and upon as many as heard these things. They lied and they died.\" Is that not judgment? Absolutely. God is just and He is righteous, and the judge of all the earth shall do what's right. Turn to the book of...right here in the book of Acts, turn to the chapter 12. In Acts chapter 12, we read of Herod. You say, well, Herod deserved it. He killed James and he was going to kill Peter. Well, Herod is here at the end of Acts chapter 12, and the Bible says that in verse number 20, and Herod was highly displeased with them of Tyre and Sidon, but they came with one accord to him, and having made Blastas the king's chamberlain their friend, desired peace because their country was nourished by the king's country. And upon a set day Herod arrayed in royal apparel, sat upon his throne and made an oration unto them. The people gave a shout, saying, It is of the voice of God and not of man. And immediately the angel of the Lord smote him, because he gave not God the glory, and he was eaten of worms and gave up the ghost. We're talking about judgment, New Testament, God's judgment, right? And so we begin to look at the Scriptures, and sometimes what happens is we don't see the judgment in the New Testament, maybe in the same light as we see the Old Testament. One of the reasons I believe that to be the case is because God is dealing with Israel as a nation in the Old Testament. He's dealing with the church as a organism in the New Testament, and there's distinction between that. There are many people groups that come against Israel as a nation, and therefore they have the right to protect their borders and all of those things, and they have… the Philistines are constantly coming against the nation of Israel and to fight against them, and the Amorites that set that coalition that we read of in Joshua chapter 10, they're coming against, they set in battle against the city of Gibeon. Why? Because of the agreement that had been made between the Gibeonites and the nation of Israel, and we find that they're defeated. But we see that in the New Testament, God is still a God of just judgment. I want to remind you of 1 Corinthians chapter 11. We have our Lord's Supper table before us, every single service you come in, and as you walk into these doors, one of the first things that you see is up here on the platform area, this Lord's Supper table. It says, This do in remembrance of me. We should be mindful of the fact that as we observe the Lord's Supper, and even as we think about the table of remembrance that is there, and we see those words and we're mindful of the truth of 1 Corinthians chapter 11, we speak about that importance of eating and drinking in a fashion in which we're not eating and drinking unworthily. We let a man examine himself, but I want to remind you what 1 Corinthians 11 and verse number 30 says. Those that would eat and drink unworthily, it says, for this cause many are weak and sickly among you, and many sleep. You understand that word sleep is not, you took a siesta this afternoon. The word sleep means died. They were dead. God's judgment. God's judgment. I would say this, as you look at the churches in the book of Revelation, the churches of Asia, sometimes the judgment is maybe different judgment than what we see in the Old Testament. Maybe it's not that a people group is destroyed, but you know it's sad judgment when God says to the church at Ephesus, If you don't repent, I'm going to remove your candlestick. That's serious. But sometimes what happens is we don't look at that as being judgment, because the reality is that sometimes we go through the motions of church. We don't even know if the Holy Spirit's present, if He's even… We're just going through what we do. We're just on our routine. We're just on our check the box, go to church. But God's judgment, removing His presence, removing the candlestick as it says here in Revelation chapter 2 with dealing with the church at Ephesus. It's interesting as you read the messages to the churches, you find that many times that God says, Repent, or here's the consequence. And this evening we begin to think about some of the judgment that we would see in New Testament Christianity. It might not be the same kind of judgment that we see in the Old Testament with some of these people groups, but nonetheless it's judgment. And there are times that people die a premature death. Why? Because of their carnality, because of their behavior. I think it was D.L. Moody that said this, When God's people are not walking in holiness, that God begins to deal with them. And the first way in which God deals with His people that are not walking in obedience to His Word and walking in holiness, for God said that we're to be holy as He is holy in all manner of conversation. And he said the first form of the way in which God deals with His people is that of conviction. You ever face conviction? What happens when we get convicted? When we hear the preaching of the Word of God, when we read the Word of God in our daily lives, we're reading the Word of God and God begins to convict us. We can respond to that in one of two ways. We can have a soft heart and respond in obedience to the Word of God and we can get right whatever we need to get right. Or, we can harden our hearts. We can quench the Spirit of God. We can grieve the Spirit of God. When we quench and grieve the Spirit of God, that conviction, we just learn how to kind of deal with it. And after a little while, we're not so impacted by the conviction. Someone drew a diagram and explained conviction like a triangle in a sandbox. And eventually, the triangle in the sandbox as it rotates either way, whichever way you want to have it rotate in your mind, eventually after it rotates one complete revolution, that triangle now becomes a circle. And the circle, the triangle will move freely within the circle without any friction from the sand. Do you see it in your mind's eye? Why? Because we've just quenched the Spirit of God. We've grieved the Spirit of God. And so, God deals with conviction. And after conviction, if we don't respond to conviction, you know what God uses? Chastisement. You know why He chastens us? Because He loves us. And there are people that look at the chastisement of the Lord in a wrong way. We say, no, God chastens us because we're His sons, because He loves us. Dale Moody went on to say that if we don't respond to the conviction, we face the chastisement. And if we don't respond to the chastisement, we face a coffin. That's pretty serious. As you look at the Word of God and you look at 1 Corinthians 11, and for this cause, many are sick and weakly among you, and many sleep. Listen, not everyone that's sick is facing the chastisement of God. We understand that biblically. Not every time somebody's sick. But I'm going to tell you what, if I'm sick, I want to... Lord, did I do something like... I want to make sure I'm not sick or weakly because of my disobedience. He says, many sleep. They've died. Premature deaths from a human, from our human perspective. Why? Because they ate and drank unworthily. Listen, in the New Testament, we find that God, He exercises judgment. We read it in Acts 5 with Ananias and Sapphira, in Acts 12 with Herod. Believers in general in 1 Corinthians 11. The churches of Asia that are mentioned in the book of Revelation, specifically there with the church at Ephesus, as we referenced in Revelation 2. And this evening, as we begin to think about our God, I'm so thankful that our God is gracious and merciful. But the writer of Hebrews said that our God is a consuming fire, is a fearful thing to fall in the hands of a living God, an angry God. And you think about His justice and His judgment. I'm thankful that God is gracious and merciful. And we do see His judgment in the Old Testament and the New Testament. Listen, God said of Himself, I'm the same yesterday, today, and forever. Begin to approach the Scriptures with that perspective as we begin to read a passage that seems to contradict from man's perspective what that truth reveals to us, then we better dig in and dig deeper and try to understand what it is that's taking place and what God is recording for us. So, how do we answer the skeptics? I said we'd end with Jonah 4. I already put my Bible away, and so some of you did as well. But look back at Jonah 4. Look back at Jonah chapter 4. You know, from Jonah's perspective, the people of Nineveh deserve judgment. Capital of Assyria, wicked people. They say that the city of Nineveh was lined with stakes that had skulls on them from the people they defeated. It was a wicked place, immoral, ungodly. I think that that Nineveh, Jonah would have been perfectly happy if Nineveh had been destroyed. He'd have been happy about it. That's why he fled. He says in verse number 1, it displeased Jonah exceedingly, and he is very angry. Why? Because God repented the evil that He had said that He would do against them or unto them, and He did it not. Verse number 2, he prayed unto the Lord and said, I pray thee, O Lord, was not this my saying when I was yet in my country? Therefore I fled before unto Tarshish. Why? For I knew that Thou art a gracious God, and merciful. Slow to anger. and of great kindness, and repentest thee of the evil.\" God is gracious, God is merciful, God is slow to anger and of great kindness, and God is just, and God is righteous. When people reject, whether Old Testament or New Testament, when people reject the grace and mercy of God, the light that God gives, judgment is the consequence. And so this evening I hope that that would help us in dealing with some skeptics, taking a more thorough approach to the Word of God, a complete understanding of the passages that often are looked to and attacked and criticized, and say, okay, let's dig in. Why did this happen the way that it did? What was God really revealing? Why did God send ten plagues before nine and then the death of the firstborn? Is that not the grace and mercy of God? Is that not God revealing Himself? Absolutely. But there's a refusal, there's a rejection. We find that throughout the Word of God, He is the judge of all the earth, and He always does what is right. Let's pray. Father, we love You this evening. We thank You for loving us. We thank You for Your precious Word, for the truth that's contained therein. I pray this evening, we've looked at so many passages of Scripture, we've used some examples that some may turn to in order to attack. We've looked at passages that show that You're no respecter of persons, that when Your people rejected You and refused to obey You and turned to idols, they faced Your judgment, severe judgment. We've looked at examples in the New Testament of those that have faced judgment. God, I pray that this evening, as we consider our own lives, that we would determine that we will walk in holiness and that we would walk in obedience to Thy Word. For we do not want to face Your hand of judgment. We'd much rather have Your hand of blessing. And God, I pray that You would continue to enable us to adequately interact with those that we come into contact with, that we'd be ready to give an answer of the hope that lies within us. I pray that as we have a time of invitation that we would respond. Lord, that You do a work in our hearts and lives where You would be glorified, and we'll thank You for it. In Christ's name, would You stand with us?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.2799999713897705,
      "text": " and the Old Testament."
    },
    {
      "id": 1,
      "start": 2.2799999713897705,
      "end": 5.119999885559082,
      "text": " And this is just gonna be a launching point this evening."
    },
    {
      "id": 2,
      "start": 5.119999885559082,
      "end": 7.960000038146973,
      "text": " And eventually, as we begin here,"
    },
    {
      "id": 3,
      "start": 7.960000038146973,
      "end": 11.680000305175781,
      "text": " we will also end here in Jonah chapter number four,"
    },
    {
      "id": 4,
      "start": 11.680000305175781,
      "end": 13.199999809265137,
      "text": " verses one and two."
    },
    {
      "id": 5,
      "start": 13.199999809265137,
      "end": 17.1200008392334,
      "text": " And we will continue with our Ask the Pastor series."
    },
    {
      "id": 6,
      "start": 17.1200008392334,
      "end": 19.65999984741211,
      "text": " And I'll be honest, if you look in the bulletin,"
    },
    {
      "id": 7,
      "start": 19.65999984741211,
      "end": 21.360000610351562,
      "text": " there's a different series,"
    },
    {
      "id": 8,
      "start": 21.360000610351562,
      "end": 23.639999389648438,
      "text": " or title for a message this evening."
    },
    {
      "id": 9,
      "start": 23.639999389648438,
      "end": 25.520000457763672,
      "text": " And that's because I was gonna preach"
    },
    {
      "id": 10,
      "start": 25.520000457763672,
      "end": 28.8799991607666,
      "text": " a different Ask the Pastor, but the folks aren't here."
    },
    {
      "id": 11,
      "start": 28.8799991607666,
      "end": 33.0,
      "text": " And I am not gonna always be able to adjust that,"
    },
    {
      "id": 12,
      "start": 33.0,
      "end": 36.119998931884766,
      "text": " but it happens that I'm able to adjust it for this evening"
    },
    {
      "id": 13,
      "start": 36.119998931884766,
      "end": 38.119998931884766,
      "text": " and wanna try to make sure."
    },
    {
      "id": 14,
      "start": 38.119998931884766,
      "end": 40.20000076293945,
      "text": " I didn't wanna be like, well, it's too bad you weren't here,"
    },
    {
      "id": 15,
      "start": 40.20000076293945,
      "end": 43.13999938964844,
      "text": " get the recording, sort of a situation."
    },
    {
      "id": 16,
      "start": 43.13999938964844,
      "end": 45.84000015258789,
      "text": " So we'll try to adjust that as we can."
    },
    {
      "id": 17,
      "start": 45.84000015258789,
      "end": 47.52000045776367,
      "text": " So if you've given a question"
    },
    {
      "id": 18,
      "start": 47.52000045776367,
      "end": 49.31999969482422,
      "text": " and you know you're gonna be on vacation,"
    },
    {
      "id": 19,
      "start": 49.31999969482422,
      "end": 50.5,
      "text": " would you let me know?"
    },
    {
      "id": 20,
      "start": 50.5,
      "end": 52.29999923706055,
      "text": " And that might help a little bit."
    },
    {
      "id": 21,
      "start": 52.29999923706055,
      "end": 55.439998626708984,
      "text": " But Jonah chapter four, look at verses one and two."
    },
    {
      "id": 22,
      "start": 55.439998626708984,
      "end": 57.52000045776367,
      "text": " If you're familiar with the book of Jonah, of course,"
    },
    {
      "id": 23,
      "start": 57.52000045776367,
      "end": 60.08000183105469,
      "text": " we know that Jonah's already been swallowed"
    },
    {
      "id": 24,
      "start": 60.08000183105469,
      "end": 62.52000045776367,
      "text": " by the great fish and he's already been spewed out."
    },
    {
      "id": 25,
      "start": 62.52000045776367,
      "end": 64.5199966430664,
      "text": " He's already gone to Nineveh and he's preached."
    },
    {
      "id": 26,
      "start": 64.5199966430664,
      "end": 66.95999908447266,
      "text": " And we come to the fourth chapter."
    },
    {
      "id": 27,
      "start": 66.95999908447266,
      "end": 70.08000183105469,
      "text": " The people of Nineveh have responded in repentance."
    },
    {
      "id": 28,
      "start": 70.08000183105469,
      "end": 71.63999938964844,
      "text": " And it says this in verse number one,"
    },
    {
      "id": 29,
      "start": 71.63999938964844,
      "end": 74.76000213623047,
      "text": " but it displeased Jonah exceedingly."
    },
    {
      "id": 30,
      "start": 74.76000213623047,
      "end": 76.08000183105469,
      "text": " And he was very angry."
    },
    {
      "id": 31,
      "start": 77.19999694824219,
      "end": 78.91999816894531,
      "text": " Notice it says, he prayed unto the Lord and said,"
    },
    {
      "id": 32,
      "start": 78.91999816894531,
      "end": 81.36000061035156,
      "text": " \"'I pray thee, O Lord, was not this my saying"
    },
    {
      "id": 33,
      "start": 81.36000061035156,
      "end": 83.27999877929688,
      "text": " \"'when I was yet in my country?"
    },
    {
      "id": 34,
      "start": 83.27999877929688,
      "end": 86.94000244140625,
      "text": " \"'Therefore I fled before unto Tarshish, why?"
    },
    {
      "id": 35,
      "start": 86.94000244140625,
      "end": 91.37999725341797,
      "text": " \"'For I knew that thou art a gracious God,"
    },
    {
      "id": 36,
      "start": 91.37999725341797,
      "end": 96.19999694824219,
      "text": " \"'and merciful, slow to anger, and of great kindness,"
    },
    {
      "id": 37,
      "start": 96.19999694824219,
      "end": 99.66000366210938,
      "text": " \"'and repentest thee of the evil.'\""
    },
    {
      "id": 38,
      "start": 99.66000366210938,
      "end": 100.86000061035156,
      "text": " I wanna preach a message tonight"
    },
    {
      "id": 39,
      "start": 100.86000061035156,
      "end": 103.26000213623047,
      "text": " that I've titled from verse number two,"
    },
    {
      "id": 40,
      "start": 103.26000213623047,
      "end": 107.58000183105469,
      "text": " I knew that thou art a gracious God."
    },
    {
      "id": 41,
      "start": 107.58000183105469,
      "end": 109.62000274658203,
      "text": " The question that was submitted says this,"
    },
    {
      "id": 42,
      "start": 109.62000274658203,
      "end": 112.33999633789062,
      "text": " many skeptics of Christianity say they like the God"
    },
    {
      "id": 43,
      "start": 112.33999633789062,
      "end": 113.94000244140625,
      "text": " of the New Testament,"
    },
    {
      "id": 44,
      "start": 113.94000244140625,
      "end": 116.33999633789062,
      "text": " but not the God of the Old Testament."
    },
    {
      "id": 45,
      "start": 116.33999633789062,
      "end": 118.9800033569336,
      "text": " How do we, as the people of God,"
    },
    {
      "id": 46,
      "start": 118.9800033569336,
      "end": 122.37999725341797,
      "text": " explain the annihilation of whole people groups"
    },
    {
      "id": 47,
      "start": 122.37999725341797,
      "end": 127.37999725341797,
      "text": " as being in line with a truly loving and merciful God?"
    },
    {
      "id": 48,
      "start": 128.25999450683594,
      "end": 129.97999572753906,
      "text": " And I think it's a great question,"
    },
    {
      "id": 49,
      "start": 129.97999572753906,
      "end": 132.66000366210938,
      "text": " one in which you may have been exposed to,"
    },
    {
      "id": 50,
      "start": 132.66000366210938,
      "end": 136.33999633789062,
      "text": " where someone will question you with regard to"
    },
    {
      "id": 51,
      "start": 136.33999633789062,
      "end": 139.94000244140625,
      "text": " noticing or at least seeming to notice a contradiction"
    },
    {
      "id": 52,
      "start": 139.94000244140625,
      "end": 142.05999755859375,
      "text": " between the Old and New Testament."
    },
    {
      "id": 53,
      "start": 142.05999755859375,
      "end": 144.33999633789062,
      "text": " And I believe it's a wonderful question."
    },
    {
      "id": 54,
      "start": 144.33999633789062,
      "end": 146.22000122070312,
      "text": " I hope that you'd bear with me this evening"
    },
    {
      "id": 55,
      "start": 147.05999755859375,
      "end": 147.89999389648438,
      "text": " as a preacher friend of mine says,"
    },
    {
      "id": 56,
      "start": 147.89999389648438,
      "end": 149.5800018310547,
      "text": " I didn't come to church to get out of church,"
    },
    {
      "id": 57,
      "start": 149.5800018310547,
      "end": 151.5800018310547,
      "text": " I came in to get something from church."
    },
    {
      "id": 58,
      "start": 151.5800018310547,
      "end": 153.4600067138672,
      "text": " And I will admit to you at the very beginning,"
    },
    {
      "id": 59,
      "start": 153.4600067138672,
      "end": 156.33999633789062,
      "text": " it's gonna be a little bit longer of a message this evening"
    },
    {
      "id": 60,
      "start": 156.33999633789062,
      "end": 159.05999755859375,
      "text": " and at least that's what my notes say."
    },
    {
      "id": 61,
      "start": 159.05999755859375,
      "end": 160.94000244140625,
      "text": " And we hope that we'll get through it"
    },
    {
      "id": 62,
      "start": 160.94000244140625,
      "end": 162.10000610351562,
      "text": " and hope that it makes sense."
    },
    {
      "id": 63,
      "start": 162.10000610351562,
      "end": 163.82000732421875,
      "text": " But in order to answer the question,"
    },
    {
      "id": 64,
      "start": 163.82000732421875,
      "end": 166.4600067138672,
      "text": " I believe it's imperative for us to understand"
    },
    {
      "id": 65,
      "start": 166.4600067138672,
      "end": 169.5,
      "text": " and acknowledge all of God's attributes."
    },
    {
      "id": 66,
      "start": 169.5,
      "end": 173.4199981689453,
      "text": " And we will not study all of his attributes this evening,"
    },
    {
      "id": 67,
      "start": 173.4199981689453,
      "end": 176.17999267578125,
      "text": " but with dealing with the question specifically,"
    },
    {
      "id": 68,
      "start": 177.02000427246094,
      "end": 179.5,
      "text": " with regard to God being loving and merciful"
    },
    {
      "id": 69,
      "start": 179.5,
      "end": 182.82000732421875,
      "text": " and seeing this seeming discrepancy,"
    },
    {
      "id": 70,
      "start": 182.82000732421875,
      "end": 187.3800048828125,
      "text": " we also notice that yes, God is loving and God is merciful"
    },
    {
      "id": 71,
      "start": 187.3800048828125,
      "end": 189.33999633789062,
      "text": " and we ought to rejoice in that."
    },
    {
      "id": 72,
      "start": 189.33999633789062,
      "end": 190.5399932861328,
      "text": " But at the very same time,"
    },
    {
      "id": 73,
      "start": 190.5399932861328,
      "end": 194.6999969482422,
      "text": " we understand that God is righteous and he is just."
    },
    {
      "id": 74,
      "start": 194.6999969482422,
      "end": 197.02000427246094,
      "text": " And as we understand the attributes of God"
    },
    {
      "id": 75,
      "start": 197.02000427246094,
      "end": 198.77999877929688,
      "text": " and we understand the character of God"
    },
    {
      "id": 76,
      "start": 198.77999877929688,
      "end": 200.94000244140625,
      "text": " as it's been revealed to us in the word of God,"
    },
    {
      "id": 77,
      "start": 200.94000244140625,
      "end": 203.5800018310547,
      "text": " we would understand that God's attributes"
    },
    {
      "id": 78,
      "start": 203.5800018310547,
      "end": 205.82000732421875,
      "text": " are in perfect harmony."
    },
    {
      "id": 79,
      "start": 206.4600067138672,
      "end": 207.94000244140625,
      "text": " We as people, as human beings,"
    },
    {
      "id": 80,
      "start": 207.94000244140625,
      "end": 211.13999938964844,
      "text": " our attributes are not always in perfect harmony."
    },
    {
      "id": 81,
      "start": 211.13999938964844,
      "end": 214.5800018310547,
      "text": " In fact, there are times in which we perhaps had a bad day"
    },
    {
      "id": 82,
      "start": 214.5800018310547,
      "end": 217.13999938964844,
      "text": " and we're more on the side of judgment"
    },
    {
      "id": 83,
      "start": 217.13999938964844,
      "end": 219.3000030517578,
      "text": " than we are on the side of grace or mercy."
    },
    {
      "id": 84,
      "start": 219.3000030517578,
      "end": 222.9199981689453,
      "text": " And we find that we can fluctuate as human beings,"
    },
    {
      "id": 85,
      "start": 222.9199981689453,
      "end": 225.97999572753906,
      "text": " but God is perfect in his attributes"
    },
    {
      "id": 86,
      "start": 225.97999572753906,
      "end": 228.02000427246094,
      "text": " and they are harmonious."
    },
    {
      "id": 87,
      "start": 228.02000427246094,
      "end": 229.94000244140625,
      "text": " We find this, it's interesting to me"
    },
    {
      "id": 88,
      "start": 229.94000244140625,
      "end": 230.94000244140625,
      "text": " and you don't need to turn there,"
    },
    {
      "id": 89,
      "start": 230.94000244140625,
      "end": 234.02000427246094,
      "text": " but in Genesis chapter number 18 and verse number 25,"
    },
    {
      "id": 90,
      "start": 234.02000427246094,
      "end": 236.3000030517578,
      "text": " as Abraham is having a conversation with the Lord"
    },
    {
      "id": 91,
      "start": 236.3000030517578,
      "end": 239.89999389648438,
      "text": " regarding the pending destruction of Sodom and Gomorrah,"
    },
    {
      "id": 92,
      "start": 239.89999389648438,
      "end": 242.6999969482422,
      "text": " we find that in that verse of scripture,"
    },
    {
      "id": 93,
      "start": 243.74000549316406,
      "end": 246.82000732421875,
      "text": " Abraham reveals to us and we are given the truth"
    },
    {
      "id": 94,
      "start": 246.82000732421875,
      "end": 250.22000122070312,
      "text": " of two very important aspects of our God."
    },
    {
      "id": 95,
      "start": 250.22000122070312,
      "end": 254.33999633789062,
      "text": " Number one is this, God is the judge of all the earth."
    },
    {
      "id": 96,
      "start": 255.5399932861328,
      "end": 259.7799987792969,
      "text": " Number two, he always does what is right."
    },
    {
      "id": 97,
      "start": 259.7799987792969,
      "end": 261.5799865722656,
      "text": " And so we find that Abraham"
    },
    {
      "id": 98,
      "start": 261.5799865722656,
      "end": 264.1000061035156,
      "text": " is having this conversation with the Lord"
    },
    {
      "id": 99,
      "start": 264.1000061035156,
      "end": 267.05999755859375,
      "text": " and he's finding out about the impending judgment"
    },
    {
      "id": 100,
      "start": 267.05999755859375,
      "end": 268.5400085449219,
      "text": " of Sodom and Gomorrah."
    },
    {
      "id": 101,
      "start": 268.5400085449219,
      "end": 271.20001220703125,
      "text": " And Abraham, as he's having this conversation,"
    },
    {
      "id": 102,
      "start": 271.20001220703125,
      "end": 272.9800109863281,
      "text": " he reveals two important truths."
    },
    {
      "id": 103,
      "start": 272.9800109863281,
      "end": 275.5400085449219,
      "text": " Number one, God is the judge of all the earth."
    },
    {
      "id": 104,
      "start": 275.5400085449219,
      "end": 279.29998779296875,
      "text": " And number two, he always does what is right."
    },
    {
      "id": 105,
      "start": 279.29998779296875,
      "end": 282.6600036621094,
      "text": " So I believe as we begin starting this message this evening"
    },
    {
      "id": 106,
      "start": 282.6600036621094,
      "end": 285.6400146484375,
      "text": " that many of those that would come to a perspective"
    },
    {
      "id": 107,
      "start": 285.6400146484375,
      "end": 288.5199890136719,
      "text": " such as what has been asked this evening,"
    },
    {
      "id": 108,
      "start": 288.5199890136719,
      "end": 290.6400146484375,
      "text": " I believe that for many of them,"
    },
    {
      "id": 109,
      "start": 290.6400146484375,
      "end": 292.2799987792969,
      "text": " obviously I cannot say for all of them,"
    },
    {
      "id": 110,
      "start": 292.2799987792969,
      "end": 295.7200012207031,
      "text": " I would never seek to do so because of the individual nature"
    },
    {
      "id": 111,
      "start": 295.7200012207031,
      "end": 298.6000061035156,
      "text": " of those that would have this perspective,"
    },
    {
      "id": 112,
      "start": 298.6000061035156,
      "end": 301.4800109863281,
      "text": " but for many of them, I believe that perhaps"
    },
    {
      "id": 113,
      "start": 301.4800109863281,
      "end": 306.4800109863281,
      "text": " they have approached the Bible incorrectly and incompletely."
    },
    {
      "id": 114,
      "start": 306.55999755859375,
      "end": 309.20001220703125,
      "text": " And why I say that is for this reason,"
    },
    {
      "id": 115,
      "start": 309.20001220703125,
      "end": 310.7200012207031,
      "text": " I believe that their approach,"
    },
    {
      "id": 116,
      "start": 310.7200012207031,
      "end": 313.9599914550781,
      "text": " many times individual skeptics"
    },
    {
      "id": 117,
      "start": 313.9599914550781,
      "end": 315.3999938964844,
      "text": " that would approach the Bible,"
    },
    {
      "id": 118,
      "start": 315.3999938964844,
      "end": 318.67999267578125,
      "text": " they have an approach of a critical nature."
    },
    {
      "id": 119,
      "start": 318.67999267578125,
      "end": 321.67999267578125,
      "text": " They approach the Bible by seeking to find fault"
    },
    {
      "id": 120,
      "start": 321.67999267578125,
      "end": 326.6000061035156,
      "text": " and criticize, and therefore they reach a faulty conclusion."
    },
    {
      "id": 121,
      "start": 326.6000061035156,
      "end": 327.55999755859375,
      "text": " Why is that?"
    },
    {
      "id": 122,
      "start": 327.55999755859375,
      "end": 328.8800048828125,
      "text": " Well, because they just like to look"
    },
    {
      "id": 123,
      "start": 328.8800048828125,
      "end": 330.32000732421875,
      "text": " at certain portions of scripture."
    },
    {
      "id": 124,
      "start": 330.32000732421875,
      "end": 333.9599914550781,
      "text": " They look to a certain portion that's going to be in line"
    },
    {
      "id": 125,
      "start": 333.9599914550781,
      "end": 338.0400085449219,
      "text": " with what they want, what fits their presupposition,"
    },
    {
      "id": 126,
      "start": 338.0400085449219,
      "end": 341.20001220703125,
      "text": " and therefore they're going to seek a passage"
    },
    {
      "id": 127,
      "start": 341.20001220703125,
      "end": 345.67999267578125,
      "text": " that they can run to and support what they already think."
    },
    {
      "id": 128,
      "start": 345.67999267578125,
      "end": 347.4800109863281,
      "text": " Now, as the people of God,"
    },
    {
      "id": 129,
      "start": 347.4800109863281,
      "end": 348.8599853515625,
      "text": " we understand that our approach"
    },
    {
      "id": 130,
      "start": 348.8599853515625,
      "end": 350.8999938964844,
      "text": " to God's word is much different."
    },
    {
      "id": 131,
      "start": 350.8999938964844,
      "end": 354.0799865722656,
      "text": " Our approach to God's word, my approach to God's word,"
    },
    {
      "id": 132,
      "start": 354.0799865722656,
      "end": 358.0,
      "text": " is God is right and I'm in error, right?"
    },
    {
      "id": 133,
      "start": 358.0,
      "end": 360.0799865722656,
      "text": " And so as I come to the word of God,"
    },
    {
      "id": 134,
      "start": 360.0799865722656,
      "end": 363.3999938964844,
      "text": " it's God's word that is going to correct"
    },
    {
      "id": 135,
      "start": 363.3999938964844,
      "end": 365.8399963378906,
      "text": " and instruct my thinking."
    },
    {
      "id": 136,
      "start": 365.8399963378906,
      "end": 369.0,
      "text": " And if I approach the word of God at that level,"
    },
    {
      "id": 137,
      "start": 369.0,
      "end": 371.6400146484375,
      "text": " and I approach the word of God with understanding"
    },
    {
      "id": 138,
      "start": 371.6400146484375,
      "end": 373.6400146484375,
      "text": " that he is the judge of all the earth,"
    },
    {
      "id": 139,
      "start": 373.6400146484375,
      "end": 376.4800109863281,
      "text": " that he always does that which is right,"
    },
    {
      "id": 140,
      "start": 376.4800109863281,
      "end": 380.5199890136719,
      "text": " that he is perfect in harmony with regard to his attributes,"
    },
    {
      "id": 141,
      "start": 380.5199890136719,
      "end": 382.6000061035156,
      "text": " then my perspective of the word of God"
    },
    {
      "id": 142,
      "start": 382.6000061035156,
      "end": 384.5199890136719,
      "text": " is going to be quite different."
    },
    {
      "id": 143,
      "start": 384.5199890136719,
      "end": 386.9200134277344,
      "text": " Let me also say this by way of introduction."
    },
    {
      "id": 144,
      "start": 386.9200134277344,
      "end": 388.9800109863281,
      "text": " The Bible tells us in the book of 1 Corinthians"
    },
    {
      "id": 145,
      "start": 388.9800109863281,
      "end": 390.67999267578125,
      "text": " that the natural man receiveth not"
    },
    {
      "id": 146,
      "start": 390.67999267578125,
      "end": 392.4599914550781,
      "text": " the things of the spirit of God."
    },
    {
      "id": 147,
      "start": 392.4599914550781,
      "end": 393.29998779296875,
      "text": " Why?"
    },
    {
      "id": 148,
      "start": 393.29998779296875,
      "end": 395.8399963378906,
      "text": " Because they are foolishness unto him."
    },
    {
      "id": 149,
      "start": 395.8399963378906,
      "end": 399.3599853515625,
      "text": " They must be spiritually discerned."
    },
    {
      "id": 150,
      "start": 399.3599853515625,
      "end": 400.67999267578125,
      "text": " And so as we go to the word of God"
    },
    {
      "id": 151,
      "start": 400.67999267578125,
      "end": 403.0,
      "text": " and we begin to seek the face of God"
    },
    {
      "id": 152,
      "start": 403.0,
      "end": 404.0,
      "text": " and looking at God's word,"
    },
    {
      "id": 153,
      "start": 404.0,
      "end": 407.0,
      "text": " we want to give an honest approach to the word of God."
    },
    {
      "id": 154,
      "start": 407.0,
      "end": 408.8399963378906,
      "text": " And indeed, there are times in which,"
    },
    {
      "id": 155,
      "start": 408.8399963378906,
      "end": 410.0,
      "text": " as the skeptics would say,"
    },
    {
      "id": 156,
      "start": 410.0,
      "end": 412.760009765625,
      "text": " as the question gives us this evening,"
    },
    {
      "id": 157,
      "start": 412.760009765625,
      "end": 415.2200012207031,
      "text": " that there are people groups that are destroyed."
    },
    {
      "id": 158,
      "start": 416.29998779296875,
      "end": 418.20001220703125,
      "text": " And there are some that would look at that and say,"
    },
    {
      "id": 159,
      "start": 418.20001220703125,
      "end": 421.20001220703125,
      "text": " how could that be in line with a God"
    },
    {
      "id": 160,
      "start": 421.20001220703125,
      "end": 424.2799987792969,
      "text": " who's loving and merciful?"
    },
    {
      "id": 161,
      "start": 424.2799987792969,
      "end": 428.44000244140625,
      "text": " I hope this evening that after reviewing several examples"
    },
    {
      "id": 162,
      "start": 428.44000244140625,
      "end": 429.7200012207031,
      "text": " that we could conclude,"
    },
    {
      "id": 163,
      "start": 429.7200012207031,
      "end": 434.4800109863281,
      "text": " even as Jonah concluded there in Jonah 4,"
    },
    {
      "id": 164,
      "start": 434.4800109863281,
      "end": 438.5199890136719,
      "text": " that we know that God is gracious."
    },
    {
      "id": 165,
      "start": 438.5199890136719,
      "end": 439.7200012207031,
      "text": " He's gracious."
    },
    {
      "id": 166,
      "start": 439.7200012207031,
      "end": 440.67999267578125,
      "text": " There's a number of other things"
    },
    {
      "id": 167,
      "start": 440.67999267578125,
      "end": 442.239990234375,
      "text": " that are mentioned there in Jonah 4"
    },
    {
      "id": 168,
      "start": 442.239990234375,
      "end": 443.4800109863281,
      "text": " and verse number two that we'll look at"
    },
    {
      "id": 169,
      "start": 443.4800109863281,
      "end": 444.8399963378906,
      "text": " as we end this evening."
    },
    {
      "id": 170,
      "start": 444.8399963378906,
      "end": 447.8800048828125,
      "text": " Let me start here with the Egyptians, if we could."
    },
    {
      "id": 171,
      "start": 447.8800048828125,
      "end": 449.20001220703125,
      "text": " I'm gonna give a number of examples."
    },
    {
      "id": 172,
      "start": 449.20001220703125,
      "end": 452.1400146484375,
      "text": " These examples were not given on the question that was asked"
    },
    {
      "id": 173,
      "start": 452.1400146484375,
      "end": 453.9200134277344,
      "text": " but I will give some examples"
    },
    {
      "id": 174,
      "start": 453.9200134277344,
      "end": 456.4800109863281,
      "text": " of perhaps what is being referred to"
    },
    {
      "id": 175,
      "start": 456.4800109863281,
      "end": 459.55999755859375,
      "text": " and hope that that helps us to answer the question."
    },
    {
      "id": 176,
      "start": 460.3999938964844,
      "end": 462.6400146484375,
      "text": " Turn to Exodus chapter number four, if you will."
    },
    {
      "id": 177,
      "start": 462.6400146484375,
      "end": 463.9599914550781,
      "text": " In Exodus chapter number four,"
    },
    {
      "id": 178,
      "start": 463.9599914550781,
      "end": 467.0,
      "text": " we find that in verses 22 and 23,"
    },
    {
      "id": 179,
      "start": 467.0,
      "end": 469.0799865722656,
      "text": " Moses has been given instruction."
    },
    {
      "id": 180,
      "start": 469.0799865722656,
      "end": 473.5199890136719,
      "text": " He's objected and God has given him the signs, the miracles."
    },
    {
      "id": 181,
      "start": 473.5199890136719,
      "end": 477.4800109863281,
      "text": " And we find that in Exodus chapter four in verse number 22,"
    },
    {
      "id": 182,
      "start": 477.4800109863281,
      "end": 479.4800109863281,
      "text": " notice what God says to Moses."
    },
    {
      "id": 183,
      "start": 479.4800109863281,
      "end": 482.0,
      "text": " He says, and thou shalt say unto Pharaoh,"
    },
    {
      "id": 184,
      "start": 482.0,
      "end": 486.2799987792969,
      "text": " thus saith the Lord, Israel is my son, even my firstborn."
    },
    {
      "id": 185,
      "start": 486.3599853515625,
      "end": 490.0400085449219,
      "text": " And I say unto thee, let my son go, that he may serve me."
    },
    {
      "id": 186,
      "start": 490.0400085449219,
      "end": 492.760009765625,
      "text": " And if thou refuse to let him go,"
    },
    {
      "id": 187,
      "start": 492.760009765625,
      "end": 497.760009765625,
      "text": " behold, I will slay thy son, even thy firstborn."
    },
    {
      "id": 188,
      "start": 498.2799987792969,
      "end": 502.1600036621094,
      "text": " I have every belief as we look at this instruction"
    },
    {
      "id": 189,
      "start": 502.1600036621094,
      "end": 505.739990234375,
      "text": " that God gives to Moses in Exodus four in verses 22 and 23."
    },
    {
      "id": 190,
      "start": 505.739990234375,
      "end": 507.7200012207031,
      "text": " I have every reason to believe"
    },
    {
      "id": 191,
      "start": 507.7200012207031,
      "end": 511.67999267578125,
      "text": " that Moses faithfully communicated to Pharaoh"
    },
    {
      "id": 192,
      "start": 511.67999267578125,
      "end": 515.6400146484375,
      "text": " what was at stake, that God said to Moses,"
    },
    {
      "id": 193,
      "start": 515.6400146484375,
      "end": 517.47998046875,
      "text": " deliver this message to Pharaoh."
    },
    {
      "id": 194,
      "start": 517.47998046875,
      "end": 519.1199951171875,
      "text": " If he doesn't let my people go,"
    },
    {
      "id": 195,
      "start": 519.1199951171875,
      "end": 523.2000122070312,
      "text": " that I will slay thy son, even thy firstborn."
    },
    {
      "id": 196,
      "start": 523.2000122070312,
      "end": 524.6400146484375,
      "text": " Over the next several chapters,"
    },
    {
      "id": 197,
      "start": 524.6400146484375,
      "end": 528.239990234375,
      "text": " we find the interaction between Moses and Pharaoh."
    },
    {
      "id": 198,
      "start": 528.239990234375,
      "end": 529.6400146484375,
      "text": " And of course, Aaron is there."
    },
    {
      "id": 199,
      "start": 529.6400146484375,
      "end": 532.8400268554688,
      "text": " And we find that as Moses is interacting with Pharaoh,"
    },
    {
      "id": 200,
      "start": 532.8400268554688,
      "end": 534.760009765625,
      "text": " that in chapter seven through 10,"
    },
    {
      "id": 201,
      "start": 534.760009765625,
      "end": 538.4000244140625,
      "text": " plagues one through nine are recorded for us."
    },
    {
      "id": 202,
      "start": 538.4000244140625,
      "end": 539.5599975585938,
      "text": " As you read about those plagues,"
    },
    {
      "id": 203,
      "start": 539.5599975585938,
      "end": 541.3800048828125,
      "text": " you read about the devastation,"
    },
    {
      "id": 204,
      "start": 541.3800048828125,
      "end": 544.1199951171875,
      "text": " you read about the destruction of Egypt,"
    },
    {
      "id": 205,
      "start": 544.1199951171875,
      "end": 547.7999877929688,
      "text": " you read about how that in Exodus 8 and verse 19,"
    },
    {
      "id": 206,
      "start": 547.7999877929688,
      "end": 551.760009765625,
      "text": " how that the people, the counselors of Pharaoh,"
    },
    {
      "id": 207,
      "start": 551.760009765625,
      "end": 556.0,
      "text": " they say they recognize that this is the finger of God."
    },
    {
      "id": 208,
      "start": 556.0,
      "end": 558.52001953125,
      "text": " We find it in the 10th chapter"
    },
    {
      "id": 209,
      "start": 558.52001953125,
      "end": 561.4600219726562,
      "text": " that the people, the counselors of Pharaoh,"
    },
    {
      "id": 210,
      "start": 561.4600219726562,
      "end": 562.9600219726562,
      "text": " they say to Pharaoh,"
    },
    {
      "id": 211,
      "start": 562.9600219726562,
      "end": 567.3599853515625,
      "text": " do you not know that our land has been destroyed?"
    },
    {
      "id": 212,
      "start": 567.3599853515625,
      "end": 571.780029296875,
      "text": " And we find that God was revealing Himself"
    },
    {
      "id": 213,
      "start": 571.780029296875,
      "end": 574.0599975585938,
      "text": " to Pharaoh and to the Egyptians."
    },
    {
      "id": 214,
      "start": 574.9000244140625,
      "end": 575.739990234375,
      "text": " I believe that in so doing,"
    },
    {
      "id": 215,
      "start": 575.739990234375,
      "end": 578.4199829101562,
      "text": " that God was demonstrating a measure of grace,"
    },
    {
      "id": 216,
      "start": 578.4199829101562,
      "end": 580.0599975585938,
      "text": " a measure of mercy."
    },
    {
      "id": 217,
      "start": 580.0599975585938,
      "end": 583.0999755859375,
      "text": " Because when Moses first comes to Pharaoh and says,"
    },
    {
      "id": 218,
      "start": 583.0999755859375,
      "end": 585.260009765625,
      "text": " God said, let my people go."
    },
    {
      "id": 219,
      "start": 585.260009765625,
      "end": 587.0599975585938,
      "text": " Pharaoh says, who's God?"
    },
    {
      "id": 220,
      "start": 588.3800048828125,
      "end": 590.719970703125,
      "text": " And so God begins to reveal Himself"
    },
    {
      "id": 221,
      "start": 590.719970703125,
      "end": 592.3400268554688,
      "text": " and to reveal His power."
    },
    {
      "id": 222,
      "start": 592.3400268554688,
      "end": 596.760009765625,
      "text": " And everything that God said He would do, He did."
    },
    {
      "id": 223,
      "start": 596.760009765625,
      "end": 601.760009765625,
      "text": " In the ninth chapter, which would reveal His power,"
    },
    {
      "id": 0,
      "start": 601.760009765625,
      "end": 606.1600098609924,
      "text": " record for us the seventh plague. I want you to notice that in verse number 19"
    },
    {
      "id": 1,
      "start": 606.1600098609924,
      "end": 610.9600095748901,
      "text": " the Bible says this, Moses of course has received the instruction from God and I"
    },
    {
      "id": 2,
      "start": 610.9600095748901,
      "end": 615.760009765625,
      "text": " believe this is a great picture of God's mercy, of God's love and grace. Notice"
    },
    {
      "id": 3,
      "start": 615.760009765625,
      "end": 620.7200088500977,
      "text": " what he says before the arrival of the seventh plague, send therefore now and"
    },
    {
      "id": 4,
      "start": 620.7200088500977,
      "end": 625.8800106048584,
      "text": " gather thy cattle and all that thou hast in the field. For upon every man and"
    },
    {
      "id": 5,
      "start": 625.8800106048584,
      "end": 629.4400100708008,
      "text": " beast which shall be found in the field and shall not be brought home, the hail"
    },
    {
      "id": 6,
      "start": 629.4400100708008,
      "end": 634.0400085449219,
      "text": " shall come down upon them and they shall die. That's gracious and merciful of God"
    },
    {
      "id": 7,
      "start": 634.0400085449219,
      "end": 638.9200096130371,
      "text": " to let them know of what was going to happen. And we find that even after six"
    },
    {
      "id": 8,
      "start": 638.9200096130371,
      "end": 643.4400100708008,
      "text": " plagues had already taken place and all that God had demonstrated that"
    },
    {
      "id": 9,
      "start": 643.4400100708008,
      "end": 649.0800094604492,
      "text": " particular point, that the response of the people was still mixed. Even though"
    },
    {
      "id": 10,
      "start": 649.0800094604492,
      "end": 652.9600105285645,
      "text": " God gave him warning, the Bible tells us in verse number 20 that he that feared"
    },
    {
      "id": 11,
      "start": 652.9600105285645,
      "end": 656.320011138916,
      "text": " the word of the Lord among the servants of Pharaoh made his servants and his"
    },
    {
      "id": 12,
      "start": 656.320011138916,
      "end": 662.9600105285645,
      "text": " cattle flee into the houses. They believed. They responded to the merciful"
    },
    {
      "id": 13,
      "start": 662.9600105285645,
      "end": 667.880012512207,
      "text": " truth that God had given the warning. We find that in verse 21 it says, and he"
    },
    {
      "id": 14,
      "start": 667.880012512207,
      "end": 671.4800109863281,
      "text": " that regarded not the word of the Lord left his servants and his cattle in the"
    },
    {
      "id": 15,
      "start": 671.4800109863281,
      "end": 676.880012512207,
      "text": " field. What happened to them? They died. They died. The plague came just as God"
    },
    {
      "id": 16,
      "start": 676.880012512207,
      "end": 681.4400100708008,
      "text": " said. We find that the scriptures, it's interesting to me and we don't have time"
    },
    {
      "id": 17,
      "start": 681.4400100708008,
      "end": 686.5600128173828,
      "text": " to develop each of these truths that we'll look at this evening, but I do want"
    },
    {
      "id": 18,
      "start": 686.5600128173828,
      "end": 690.3200073242188,
      "text": " you to understand that the scriptures record for us interaction between Pharaoh"
    },
    {
      "id": 19,
      "start": 690.3200073242188,
      "end": 695.4400100708008,
      "text": " and Moses during several of the plagues. And in those interactions you will find"
    },
    {
      "id": 20,
      "start": 695.4400100708008,
      "end": 699.6800079345703,
      "text": " that many times Pharaoh makes the request, would you make the plague stop?"
    },
    {
      "id": 21,
      "start": 699.6800079345703,
      "end": 708.760009765625,
      "text": " And God graciously responds to that request and the plague is stayed. But you"
    },
    {
      "id": 22,
      "start": 708.760009765625,
      "end": 711.8000106811523,
      "text": " know it's interesting to me that with regard to the death of the firstborn,"
    },
    {
      "id": 23,
      "start": 711.8000106811523,
      "end": 720.0400085449219,
      "text": " there's no request. There's no reference that we find that as God would reveal to,"
    },
    {
      "id": 24,
      "start": 720.0400085449219,
      "end": 725.6800079345703,
      "text": " of course, at the end of chapter 10 we find that Pharaoh told Moses to flee, get"
    },
    {
      "id": 25,
      "start": 725.6800079345703,
      "end": 729.8000030517578,
      "text": " out of his sight, that in the day that I see your face you're gonna die. And we"
    },
    {
      "id": 26,
      "start": 729.8000030517578,
      "end": 733.4800109863281,
      "text": " find that Pharaoh had expelled Moses from his presence, but all the way back"
    },
    {
      "id": 27,
      "start": 733.4800109863281,
      "end": 739.9200134277344,
      "text": " as we mentioned in chapter 4 that God had set the consequence. If you don't"
    },
    {
      "id": 28,
      "start": 739.9200134277344,
      "end": 747.2400054931641,
      "text": " let my people go, the firstborn is gonna die. And there was no request, there was"
    },
    {
      "id": 29,
      "start": 747.2400054931641,
      "end": 752.0400085449219,
      "text": " no interaction between Pharaoh saying, okay Moses how do we avoid that? Just let"
    },
    {
      "id": 30,
      "start": 752.0400085449219,
      "end": 758.3600158691406,
      "text": " the people go. Let me say this also, it was the Egyptians that had given the"
    },
    {
      "id": 31,
      "start": 758.3600158691406,
      "end": 762.6800079345703,
      "text": " instruction, in fact Pharaoh himself, to kill all of the male children of the"
    },
    {
      "id": 32,
      "start": 762.6800079345703,
      "end": 768.8800048828125,
      "text": " children of Israel. They were very known for human sacrifice themselves and so we"
    },
    {
      "id": 33,
      "start": 768.8800048828125,
      "end": 773.3200073242188,
      "text": " find that this is a situation in which I believe as you look at the text of"
    },
    {
      "id": 34,
      "start": 773.3200073242188,
      "end": 778.1200103759766,
      "text": " Scripture and you honestly evaluate these chapters that provide us the"
    },
    {
      "id": 35,
      "start": 778.1200103759766,
      "end": 782.4800109863281,
      "text": " record of the the plagues and the consequence of the death of the"
    },
    {
      "id": 36,
      "start": 782.4800109863281,
      "end": 787.9200134277344,
      "text": " firstborn, that God indeed was gracious and merciful. He didn't just come in and"
    },
    {
      "id": 37,
      "start": 787.9200134277344,
      "end": 793.3200073242188,
      "text": " wipe them out in just a moment, he came in and revealed himself to them. Who is"
    },
    {
      "id": 38,
      "start": 793.3200073242188,
      "end": 799.3200073242188,
      "text": " God? Okay, over the next several plagues you're gonna see who God is. And they"
    },
    {
      "id": 39,
      "start": 799.3200073242188,
      "end": 804.2800140380859,
      "text": " still rejected. I believe this evening that Pharaoh had been given light, yet he"
    },
    {
      "id": 40,
      "start": 804.2800140380859,
      "end": 809.4800109863281,
      "text": " failed to respond to the light that was given. And in a lack of response or maybe"
    },
    {
      "id": 41,
      "start": 809.4800109863281,
      "end": 814.4400024414062,
      "text": " in responding to that light by rejecting the light, we find that he had to deal"
    },
    {
      "id": 42,
      "start": 814.5200042724609,
      "end": 819.2000122070312,
      "text": " with the consequences and the nation of Egypt dealt with the consequences. I"
    },
    {
      "id": 43,
      "start": 819.2000122070312,
      "end": 824.3200073242188,
      "text": " think about not only the Egyptians but I think about the Amorites. We think about"
    },
    {
      "id": 44,
      "start": 824.3200073242188,
      "end": 828.8400115966797,
      "text": " the Amorites, we find that God provides details for us in the Abrahamic"
    },
    {
      "id": 45,
      "start": 828.8400115966797,
      "end": 833.3600158691406,
      "text": " Covenant as it's recorded in Genesis chapter 15 and as God would give the"
    },
    {
      "id": 46,
      "start": 833.3600158691406,
      "end": 838.2400054931641,
      "text": " Abrahamic Covenant in Genesis chapter 15, not only would he speak about all of the"
    },
    {
      "id": 47,
      "start": 838.2400054931641,
      "end": 842.8400115966797,
      "text": " the details with regard to the place and what have you, but he also speaks of the"
    },
    {
      "id": 48,
      "start": 842.8400115966797,
      "end": 847.0800170898438,
      "text": " time of the Abrahamic Covenant, the time of entering into the land that was"
    },
    {
      "id": 49,
      "start": 847.0800170898438,
      "end": 851.9600067138672,
      "text": " promised. And we find that in Genesis 15 and verse number 16, God says this,"
    },
    {
      "id": 50,
      "start": 851.9600067138672,
      "end": 855.8800048828125,
      "text": " but in the fourth generation they shall come hither again. Notice what he says,"
    },
    {
      "id": 51,
      "start": 855.8800048828125,
      "end": 861.9600219726562,
      "text": " for the iniquity of the Amorites is not yet full. We read that statement that the"
    },
    {
      "id": 52,
      "start": 861.9600219726562,
      "end": 866.0800170898438,
      "text": " iniquity of the Amorites is not yet full. In other words, I believe that God here"
    },
    {
      "id": 53,
      "start": 866.0800170898438,
      "end": 871.0400085449219,
      "text": " is demonstrating once again his grace and his mercy. Why? Because he was going"
    },
    {
      "id": 54,
      "start": 871.0400085449219,
      "end": 876.52001953125,
      "text": " to give them time to repent. He was going to give them opportunity to repent"
    },
    {
      "id": 55,
      "start": 876.52001953125,
      "end": 880.7200012207031,
      "text": " before his judgment would come. It's interesting as you go to the book of"
    },
    {
      "id": 56,
      "start": 880.7200012207031,
      "end": 884.1600036621094,
      "text": " Joshua, turn to the book of Joshua, if you will, in chapter number 5, because we"
    },
    {
      "id": 57,
      "start": 884.1600036621094,
      "end": 887.8000183105469,
      "text": " begin to see some things about the Amorites here in Joshua chapter number"
    },
    {
      "id": 58,
      "start": 887.8000183105469,
      "end": 892.2400207519531,
      "text": " 5, and we find that the Amorites in chapter number 5 of the book of Joshua"
    },
    {
      "id": 59,
      "start": 892.2400207519531,
      "end": 896.7200012207031,
      "text": " and also in chapter number 10, there's a different response of the Amorites,"
    },
    {
      "id": 60,
      "start": 896.7200012207031,
      "end": 900.7200012207031,
      "text": " the king of the Amorites, the kings, excuse me, of the Amorites, versus the"
    },
    {
      "id": 61,
      "start": 900.7200012207031,
      "end": 906.1199951171875,
      "text": " response that we see of Rahab in Joshua chapter number 2. Here in Joshua chapter"
    },
    {
      "id": 62,
      "start": 906.1199951171875,
      "end": 908.7200012207031,
      "text": " number 5 and verse number 1, notice what the Bible says,"
    },
    {
      "id": 63,
      "start": 908.7200012207031,
      "end": 912.3600158691406,
      "text": " and it came to pass when all the kings of the Amorites, which were on the side"
    },
    {
      "id": 64,
      "start": 912.3600158691406,
      "end": 916.6800231933594,
      "text": " of Jordan westward, and all the kings of the Canaanites, which were by the sea,"
    },
    {
      "id": 65,
      "start": 916.6800231933594,
      "end": 920.2400207519531,
      "text": " heard that the Lord had dried up the waters of Jordan from before the"
    },
    {
      "id": 66,
      "start": 920.2400207519531,
      "end": 924.8000183105469,
      "text": " children of Israel until we were passed over, that their heart melted, neither was"
    },
    {
      "id": 67,
      "start": 924.8000183105469,
      "end": 929.8800048828125,
      "text": " their spirit in them anymore because of the children of Israel. That's very"
    },
    {
      "id": 68,
      "start": 929.8800048828125,
      "end": 935.8000183105469,
      "text": " similar to what we read of Rahab as the spies went, as we read in Joshua"
    },
    {
      "id": 69,
      "start": 935.8000183105469,
      "end": 940.6000061035156,
      "text": " chapter number 2, when the spies go into Jericho, and we read about the"
    },
    {
      "id": 70,
      "start": 940.6000061035156,
      "end": 945.6000061035156,
      "text": " understanding of Rahab and the people of Jericho, and the Bible tells us in"
    },
    {
      "id": 71,
      "start": 945.6000061035156,
      "end": 950.7200012207031,
      "text": " Joshua chapter 2 and verse number 9 that Rahab says to these men, I know that the"
    },
    {
      "id": 72,
      "start": 950.7200012207031,
      "end": 955.3600158691406,
      "text": " Lord hath given you the land, and that your terror is fallen upon us, and that"
    },
    {
      "id": 73,
      "start": 955.3600158691406,
      "end": 959.8399963378906,
      "text": " all the inhabitants of the land faint because of you. For we have heard how the"
    },
    {
      "id": 74,
      "start": 959.8399963378906,
      "end": 964.2799987792969,
      "text": " Lord dried up the water of the Red Sea for you when you came out of Egypt, and"
    },
    {
      "id": 75,
      "start": 964.2799987792969,
      "end": 967.1600036621094,
      "text": " what ye did under the two kings of the Amorites that were on the other side,"
    },
    {
      "id": 76,
      "start": 967.1600036621094,
      "end": 971.1600036621094,
      "text": " Jordan, Sihon, and Og, whom ye utterly destroyed. By the way, with Sihon in"
    },
    {
      "id": 77,
      "start": 971.1600036621094,
      "end": 975.0400085449219,
      "text": " particular, it was asked that they could pass through freely. They did not want to"
    },
    {
      "id": 78,
      "start": 975.0400085449219,
      "end": 979.0,
      "text": " have interaction, but there was a rejection of that. You can go back and"
    },
    {
      "id": 79,
      "start": 979.0,
      "end": 983.0400085449219,
      "text": " read of that in the book of Numbers. Notice it says in verse number, well we"
    },
    {
      "id": 80,
      "start": 983.0400085449219,
      "end": 988.4400024414062,
      "text": " won't continue reading, but you remember that Rahab believed that God was going"
    },
    {
      "id": 81,
      "start": 988.4400024414062,
      "end": 992.5599975585938,
      "text": " to give the people of Israel the land, and she feared, and there was an"
    },
    {
      "id": 82,
      "start": 992.5599975585938,
      "end": 996.2000122070312,
      "text": " agreement that was made. There was a scarlet thread that was hung out, and God"
    },
    {
      "id": 83,
      "start": 996.2000122070312,
      "end": 1004.2400207519531,
      "text": " through these spies told Rahab that there's safety in the house. Jericho"
    },
    {
      "id": 84,
      "start": 1004.2400207519531,
      "end": 1008.6800231933594,
      "text": " was still destroyed, but Rahab and whoever she had in the house, there was"
    },
    {
      "id": 85,
      "start": 1008.6800231933594,
      "end": 1013.4000244140625,
      "text": " mercy, there was grace. Why? Because of a response. But notice I mentioned in"
    },
    {
      "id": 86,
      "start": 1013.4000244140625,
      "end": 1017.3600158691406,
      "text": " Joshua 5 that these kings of the Amorites, it's also mentioned about the"
    },
    {
      "id": 87,
      "start": 1017.3600158691406,
      "end": 1020.6400146484375,
      "text": " Canaanites here, that they hear about this, but I want you to see what their"
    },
    {
      "id": 88,
      "start": 1020.6400146484375,
      "end": 1024.0,
      "text": " response is, and really you got to flip over to chapter number 10, and I want you"
    },
    {
      "id": 89,
      "start": 1024.0,
      "end": 1028.0800170898438,
      "text": " to really see the response of the kings of the Amorites as it's recorded for us"
    },
    {
      "id": 90,
      "start": 1028.0800170898438,
      "end": 1032.8000183105469,
      "text": " in Joshua chapter number 10. In fact, we find that it's in Joshua chapter number"
    },
    {
      "id": 91,
      "start": 1032.8000183105469,
      "end": 1037.0800170898438,
      "text": " 9, the account of the Gibeonites, and if you want to have an add-on to the"
    },
    {
      "id": 92,
      "start": 1037.0800170898438,
      "end": 1041.9600219726562,
      "text": " message from this morning of the way in which the false teachers, the depth of"
    },
    {
      "id": 93,
      "start": 1041.9600219726562,
      "end": 1046.2000122070312,
      "text": " depravity, excuse me, deception, read about the Gibeonites in Joshua chapter"
    },
    {
      "id": 94,
      "start": 1046.2000122070312,
      "end": 1051.2400207519531,
      "text": " number 9. We find that we, after the situation with southern Canaan being"
    },
    {
      "id": 95,
      "start": 1051.2400207519531,
      "end": 1055.3600158691406,
      "text": " destroyed in Joshua 9 and all the victory, that in Joshua chapter number"
    },
    {
      "id": 96,
      "start": 1055.3600158691406,
      "end": 1060.2000122070312,
      "text": " 10, these five kings of the Amorites, as it's mentioned in verse number 5, the"
    },
    {
      "id": 97,
      "start": 1060.2000122070312,
      "end": 1063.8399963378906,
      "text": " king of Jerusalem, the king of Hebron, the king of Jarmut, the king of Lachish, the"
    },
    {
      "id": 98,
      "start": 1063.8399963378906,
      "end": 1068.7200012207031,
      "text": " king of Eglon, they gathered themselves together and went up, they and all their"
    },
    {
      "id": 99,
      "start": 1068.7200012207031,
      "end": 1073.7200012207031,
      "text": " hosts, and encamped before Gibeon and made war against it, and they would soon"
    },
    {
      "id": 100,
      "start": 1073.7200012207031,
      "end": 1078.9200134277344,
      "text": " be defeated. So we find that the Amorites, as it's mentioned because of the"
    },
    {
      "id": 101,
      "start": 1078.9200134277344,
      "end": 1083.2400207519531,
      "text": " reference in Genesis chapter 15, and then here in the book of Joshua, and we read"
    },
    {
      "id": 102,
      "start": 1083.2400207519531,
      "end": 1088.1199951171875,
      "text": " about the fact that they were destroyed, but you think about the mercy"
    },
    {
      "id": 103,
      "start": 1088.1199951171875,
      "end": 1092.3200073242188,
      "text": " and the grace of God even still being understood within the context of their"
    },
    {
      "id": 104,
      "start": 1092.3200073242188,
      "end": 1099.9600219726562,
      "text": " destruction. For Rahab responded in belief, but these kings of the Amorites,"
    },
    {
      "id": 105,
      "start": 1099.9600219726562,
      "end": 1105.3600158691406,
      "text": " they formed a coalition to go into battle. We find that they were ultimately"
    },
    {
      "id": 106,
      "start": 1105.3600158691406,
      "end": 1110.1600036621094,
      "text": " defeated. One that many like to look at is the Amalekites, and turn over the book"
    },
    {
      "id": 107,
      "start": 1110.1600036621094,
      "end": 1113.7999877929688,
      "text": " of 1st Samuel, if you will, and I want you to look here. Of course, this"
    },
    {
      "id": 108,
      "start": 1113.7999877929688,
      "end": 1117.3599853515625,
      "text": " instruction is given in 1st Samuel chapter 15 with regard to the"
    },
    {
      "id": 109,
      "start": 1117.3599853515625,
      "end": 1122.2999877929688,
      "text": " Amalekites, and maybe this is one in which someone had in mind. As you look at"
    },
    {
      "id": 110,
      "start": 1122.2999877929688,
      "end": 1127.0599975585938,
      "text": " the instruction that Samuel would give to Saul, we find that this instruction is"
    },
    {
      "id": 111,
      "start": 1127.0599975585938,
      "end": 1131.3400268554688,
      "text": " given with regard to the Amalekites, and it says in verse number one of 1st"
    },
    {
      "id": 112,
      "start": 1131.3400268554688,
      "end": 1135.2999877929688,
      "text": " Samuel 15, Samuel also said unto Saul, the Lord sent me to anoint thee to be"
    },
    {
      "id": 113,
      "start": 1135.2999877929688,
      "end": 1139.4600219726562,
      "text": " king over his people, over Israel. Now therefore hearken thou unto the"
    },
    {
      "id": 114,
      "start": 1139.4600219726562,
      "end": 1144.2200317382812,
      "text": " voice of the words of the Lord. Thus saith the Lord of hosts. Notice what it says,"
    },
    {
      "id": 115,
      "start": 1144.2200317382812,
      "end": 1149.260009765625,
      "text": " I remember that which Amalek did to Israel, how he laid wait for him in the"
    },
    {
      "id": 116,
      "start": 1149.260009765625,
      "end": 1154.9400024414062,
      "text": " way when he came up from Egypt. Now go and smite Amalek, and utterly destroy all"
    },
    {
      "id": 117,
      "start": 1154.9400024414062,
      "end": 1158.5400390625,
      "text": " that they have, and spare them not, but slay both man and woman, infant and"
    },
    {
      "id": 118,
      "start": 1158.5400390625,
      "end": 1162.0599975585938,
      "text": " suckling, ox and sheep, camel and ass. There are people that look at verse"
    },
    {
      "id": 119,
      "start": 1162.0599975585938,
      "end": 1167.739990234375,
      "text": " number three completely out of the context of verse number two, or of Exodus"
    },
    {
      "id": 120,
      "start": 1167.739990234375,
      "end": 1172.5800170898438,
      "text": " and Deuteronomy, and say, man, God gave the instruction to just annihilate all"
    },
    {
      "id": 121,
      "start": 1172.5800170898438,
      "end": 1177.739990234375,
      "text": " of them. Notice what he says in verse number two, I remember that which Amalek"
    },
    {
      "id": 122,
      "start": 1177.780029296875,
      "end": 1181.97998046875,
      "text": " did to Israel. Well what is it that Amalek did to Israel? Turn back to Exodus"
    },
    {
      "id": 123,
      "start": 1181.97998046875,
      "end": 1190.97998046875,
      "text": " chapter number 17. In Exodus chapter number 17, of course we understand that"
    },
    {
      "id": 124,
      "start": 1190.97998046875,
      "end": 1194.2999877929688,
      "text": " at this particular point they've already left Egypt, they've already crossed the"
    },
    {
      "id": 125,
      "start": 1194.2999877929688,
      "end": 1198.739990234375,
      "text": " Red Sea, they've already complained about water and about food and about water"
    },
    {
      "id": 126,
      "start": 1198.739990234375,
      "end": 1203.739990234375,
      "text": " again, and God has miraculously provided for them."
    },
    {
      "id": 0,
      "start": 1203.739990234375,
      "end": 1210.0599904060364,
      "text": " But then we find that as we come to the latter part of Exodus chapter number 17 in verse number 8 the Bible begins to reveal"
    },
    {
      "id": 1,
      "start": 1210.0599904060364,
      "end": 1214.5399904251099,
      "text": " to us this about Amalek and it says then came Amalek and fought with Israel in Rephidim and"
    },
    {
      "id": 2,
      "start": 1214.7199897766113,
      "end": 1218.2599906921387,
      "text": " Moses said unto Joshua choose us out men and go out fight with Amalek"
    },
    {
      "id": 3,
      "start": 1218.579990386963,
      "end": 1222.819990158081,
      "text": " Tomorrow I will stand on the top of the hill with the rod of God in mine hand and this is the time in which"
    },
    {
      "id": 4,
      "start": 1223.2599906921387,
      "end": 1225.579990386963,
      "text": " remember they had to stay up the hands of"
    },
    {
      "id": 5,
      "start": 1226.2999897003174,
      "end": 1231.659990310669,
      "text": " Moses and as Moses hands were stayed up the children of Israel had victory as they were let down they had defeat"
    },
    {
      "id": 6,
      "start": 1231.7799911499023,
      "end": 1235.1799907684326,
      "text": " We find that in verse number 16 of Exodus 17 the Bible says"
    },
    {
      "id": 7,
      "start": 1235.4599895477295,
      "end": 1240.4999885559082,
      "text": " Because the Lord hath sworn that the Lord will have war with Amalek from generation to generation"
    },
    {
      "id": 8,
      "start": 1241.899990081787,
      "end": 1246.0999908447266,
      "text": " Now what is it that the Amalekites did? What is it that the king of Amalek did?"
    },
    {
      "id": 9,
      "start": 1246.2199897766113,
      "end": 1251.0599899291992,
      "text": " Well, God gives us more insight to that in the book of Deuteronomy in chapter number 25"
    },
    {
      "id": 10,
      "start": 1251.739990234375,
      "end": 1256.9599914550781,
      "text": " in Deuteronomy chapter number 25 God gives us some insight as to the tactics of the"
    },
    {
      "id": 11,
      "start": 1257.4399909973145,
      "end": 1260.4999885559082,
      "text": " Amalekites the behavior of the Amalekites and what they did and"
    },
    {
      "id": 12,
      "start": 1260.7599906921387,
      "end": 1268.239990234375,
      "text": " God is using Moses here in Deuteronomy to prepare the nation of Israel for entrance into the land and he's going to remind them of"
    },
    {
      "id": 13,
      "start": 1268.239990234375,
      "end": 1272.6799926757812,
      "text": " This and what it is that they're to do notice. It says in verse 17 of Deuteronomy 25"
    },
    {
      "id": 14,
      "start": 1273.1999893188477,
      "end": 1275.7199935913086,
      "text": " Remember what Amalek did unto thee by the way?"
    },
    {
      "id": 15,
      "start": 1276.639991760254,
      "end": 1281.1999893188477,
      "text": " When you were come forth out of Egypt, what is it that he did notice verse 18?"
    },
    {
      "id": 16,
      "start": 1281.1999893188477,
      "end": 1289.0799865722656,
      "text": " How he met thee by the way and smote the hindmost of thee even all that were feeble behind thee when thou was"
    },
    {
      "id": 17,
      "start": 1289.2799911499023,
      "end": 1292.359992980957,
      "text": " faint and weary and he feared not God"
    },
    {
      "id": 18,
      "start": 1293.3999938964844,
      "end": 1295.3999938964844,
      "text": " That's what he did"
    },
    {
      "id": 19,
      "start": 1295.6799926757812,
      "end": 1302.9999923706055,
      "text": " So therefore verse 19 it shall be when the Lord thy God hath given thee rest from all thine enemies round about in the land"
    },
    {
      "id": 20,
      "start": 1302.9999923706055,
      "end": 1310.1599884033203,
      "text": " Which the Lord thy God giveth thee for an inheritance to possess it that thou shalt blot out the remembrance of Amalek from under heaven"
    },
    {
      "id": 21,
      "start": 1310.1599884033203,
      "end": 1312.1599884033203,
      "text": " Thou shalt not forget it"
    },
    {
      "id": 22,
      "start": 1312.5999908447266,
      "end": 1318.5999908447266,
      "text": " So when read first Samuel 15 apart from Exodus 17 apart from Deuteronomy 25"
    },
    {
      "id": 23,
      "start": 1318.7199935913086,
      "end": 1321.2799911499023,
      "text": " You can certainly come to a different conclusion"
    },
    {
      "id": 24,
      "start": 1321.9999923706055,
      "end": 1329.3999938964844,
      "text": " You can reach a conclusion that says how could God do that? Well God says I remember what they did and here's what the"
    },
    {
      "id": 25,
      "start": 1329.9199905395508,
      "end": 1335.6799926757812,
      "text": " Consequences here's what's going to happen and we read it in Exodus chapter 17. We read it in Deuteronomy 25"
    },
    {
      "id": 26,
      "start": 1335.9599914550781,
      "end": 1337.9599914550781,
      "text": " what the details are of"
    },
    {
      "id": 27,
      "start": 1338.3599853515625,
      "end": 1341.479995727539,
      "text": " The behavior of Amalek and the Amalekites"
    },
    {
      "id": 28,
      "start": 1341.9599914550781,
      "end": 1348.1199951171875,
      "text": " Think about the people of Nineveh. I'm going to use this from a positive perspective toward the book of Jonah if you will"
    },
    {
      "id": 29,
      "start": 1348.6399841308594,
      "end": 1350.6399841308594,
      "text": " I'm trying to use this as a contrast"
    },
    {
      "id": 30,
      "start": 1351.3599853515625,
      "end": 1353.3599853515625,
      "text": " between the the two"
    },
    {
      "id": 31,
      "start": 1354.0399932861328,
      "end": 1357.1199951171875,
      "text": " Aspects in which we're looking at here in the city of Nineveh"
    },
    {
      "id": 32,
      "start": 1357.1199951171875,
      "end": 1363.6799926757812,
      "text": " I believe that as Jonah preaches this message after God got a hold of them in Jonah 3 and verse number 4"
    },
    {
      "id": 33,
      "start": 1363.9599914550781,
      "end": 1369.0399932861328,
      "text": " The Bible tells us that he began to enter into the city a day's journey and he cried and said yet 40 days in"
    },
    {
      "id": 34,
      "start": 1369.0399932861328,
      "end": 1371.0399932861328,
      "text": " Nineveh shall be overthrown. I"
    },
    {
      "id": 35,
      "start": 1371.2799835205078,
      "end": 1373.2799835205078,
      "text": " Believe with all my heart"
    },
    {
      "id": 36,
      "start": 1373.719985961914,
      "end": 1375.3999938964844,
      "text": " that Nineveh"
    },
    {
      "id": 37,
      "start": 1375.3999938964844,
      "end": 1382.2799835205078,
      "text": " Including the hundred and twenty thousand children in Nineveh and we get that number from Jonah 4 in verse number 11"
    },
    {
      "id": 38,
      "start": 1383.1999969482422,
      "end": 1387.239990234375,
      "text": " After God deals with Jonah and the Gourd and all of that situation"
    },
    {
      "id": 39,
      "start": 1387.239990234375,
      "end": 1392.2799835205078,
      "text": " He says in verse 11 of chapter 4 and should not I spare Nineveh that great city where there are more than six"
    },
    {
      "id": 40,
      "start": 1392.5599975585938,
      "end": 1397.719985961914,
      "text": " 64,000 persons that cannot discern between the right hand and their left hand and also much cattle"
    },
    {
      "id": 41,
      "start": 1397.719985961914,
      "end": 1403.8399963378906,
      "text": " I believe that in 40 days based on the preaching of Jonah in verse number 4 of Jonah 3"
    },
    {
      "id": 42,
      "start": 1404.0799865722656,
      "end": 1409.239990234375,
      "text": " that God would have destroyed Nineveh including those hundred and twenty thousand children and"
    },
    {
      "id": 43,
      "start": 1409.9199829101562,
      "end": 1415.999984741211,
      "text": " He would have destroyed them, but we find that the response of the people of Nineveh"
    },
    {
      "id": 44,
      "start": 1416.8799896240234,
      "end": 1419.9199829101562,
      "text": " Stayed the judgment of God and spared the people"
    },
    {
      "id": 45,
      "start": 1420.5199890136719,
      "end": 1426.4399871826172,
      "text": " Notice in verse number 5 of Jonah chapter number 3 the Bible says so the people of Nineveh believed God"
    },
    {
      "id": 46,
      "start": 1427.5199890136719,
      "end": 1431.8799896240234,
      "text": " They believed God they proclaimed a fast and put on sackcloth from the greatest of them"
    },
    {
      "id": 47,
      "start": 1431.8799896240234,
      "end": 1435.479995727539,
      "text": " Even to the least of them verse 10. You can read the rest of it later"
    },
    {
      "id": 48,
      "start": 1435.479995727539,
      "end": 1436.2799835205078,
      "text": " but in verse number 10"
    },
    {
      "id": 49,
      "start": 1436.2799835205078,
      "end": 1439.3999938964844,
      "text": " It says that God saw their works that they turned from their evil way and God"
    },
    {
      "id": 50,
      "start": 1439.5199890136719,
      "end": 1443.5599975585938,
      "text": " Repented of the evil that he had said that he would do unto them and he did it not. I"
    },
    {
      "id": 51,
      "start": 1444.5199890136719,
      "end": 1446.5199890136719,
      "text": " believe again that God would have"
    },
    {
      "id": 52,
      "start": 1447.4399871826172,
      "end": 1451.9599914550781,
      "text": " Destroyed the city of Nineveh all of the inhabitants including those hundred and twenty thousand children"
    },
    {
      "id": 53,
      "start": 1452.6799926757812,
      "end": 1454.6799926757812,
      "text": " the question that we could ask about the"
    },
    {
      "id": 54,
      "start": 1455.4399871826172,
      "end": 1460.0,
      "text": " Situation there with Egypt the situation here with Nineveh and you look at two very different"
    },
    {
      "id": 55,
      "start": 1460.6799926757812,
      "end": 1464.7599792480469,
      "text": " situations where God is revealing himself to Pharaoh and to the people of"
    },
    {
      "id": 56,
      "start": 1465.3999938964844,
      "end": 1467.3999938964844,
      "text": " Egypt and the the"
    },
    {
      "id": 57,
      "start": 1468.0,
      "end": 1469.6799926757812,
      "text": " Magicians they are"
    },
    {
      "id": 58,
      "start": 1469.6799926757812,
      "end": 1471.6799926757812,
      "text": " recognizing as they see these"
    },
    {
      "id": 59,
      "start": 1472.0,
      "end": 1476.1999816894531,
      "text": " These plagues and these miracles they are recognizing. This is the finger of God"
    },
    {
      "id": 60,
      "start": 1477.3999938964844,
      "end": 1481.3599853515625,
      "text": " But yet there's not a response like we read of in Nineveh"
    },
    {
      "id": 61,
      "start": 1481.5999755859375,
      "end": 1485.6399841308594,
      "text": " There continues to be a refusal to let the people of God go"
    },
    {
      "id": 62,
      "start": 1486.1199951171875,
      "end": 1488.1199951171875,
      "text": " they see the"
    },
    {
      "id": 63,
      "start": 1488.1999816894531,
      "end": 1494.0,
      "text": " Time in which God allowed for these plagues and all that he does and he reveals his his grace"
    },
    {
      "id": 64,
      "start": 1494.0,
      "end": 1498.5599975585938,
      "text": " I believe in his mercy to the Egyptians yet. They continue to resist"
    },
    {
      "id": 65,
      "start": 1499.1199951171875,
      "end": 1501.1199951171875,
      "text": " yet for the people of Nineveh"
    },
    {
      "id": 66,
      "start": 1501.5199890136719,
      "end": 1504.8800048828125,
      "text": " They respond with repentance and thus they are spared"
    },
    {
      "id": 67,
      "start": 1505.5999755859375,
      "end": 1512.5599975585938,
      "text": " So as we look at the text of Scripture we look at these examples the the the Egyptians the Amorites the"
    },
    {
      "id": 68,
      "start": 1512.7200012207031,
      "end": 1514.2799987792969,
      "text": " Amalekites the people of Nineveh"
    },
    {
      "id": 69,
      "start": 1514.2799987792969,
      "end": 1520.5199890136719,
      "text": " We see the people of Nineveh have a different outcome than the other three that we've looked at but we find that God. Yes"
    },
    {
      "id": 70,
      "start": 1521.1999816894531,
      "end": 1525.4400024414062,
      "text": " He is just and he is righteous and he is the judge of all the earth"
    },
    {
      "id": 71,
      "start": 1526.3999938964844,
      "end": 1533.7999877929688,
      "text": " This evening we could ask the question would God have been justified in destroying the the people of Egypt"
    },
    {
      "id": 72,
      "start": 1533.7999877929688,
      "end": 1537.7999877929688,
      "text": " Would God have been justified in destroying the the people of Nineveh? Yes"
    },
    {
      "id": 73,
      "start": 1539.6399841308594,
      "end": 1546.9599914550781,
      "text": " One was destroyed and one was spared what was different not God the response of the people"
    },
    {
      "id": 74,
      "start": 1547.9599914550781,
      "end": 1551.3199768066406,
      "text": " And we find this evening that our God is no"
    },
    {
      "id": 75,
      "start": 1551.5999755859375,
      "end": 1556.1199951171875,
      "text": " Respecter of persons and we find that as we look at these examples"
    },
    {
      "id": 76,
      "start": 1556.1199951171875,
      "end": 1562.9199829101562,
      "text": " We again mention how that he says that the iniquity of the Amorites is not yet full you read about the Amalekites and it's"
    },
    {
      "id": 77,
      "start": 1563.239990234375,
      "end": 1569.8399963378906,
      "text": " Specifically a result of their own behavior and the judgment of God and we find that here"
    },
    {
      "id": 78,
      "start": 1570.3599853515625,
      "end": 1572.3199768066406,
      "text": " God's judgment is seen"
    },
    {
      "id": 79,
      "start": 1572.3199768066406,
      "end": 1572.6799926757812,
      "text": " yes"
    },
    {
      "id": 80,
      "start": 1572.6799926757812,
      "end": 1574.3599853515625,
      "text": " but if you look at it in its"
    },
    {
      "id": 81,
      "start": 1574.3599853515625,
      "end": 1579.0599975585938,
      "text": " Entirety and look at the entirety of the passages and all that goes into it"
    },
    {
      "id": 82,
      "start": 1579.0599975585938,
      "end": 1586.1600036621094,
      "text": " You find that it's not void of God being merciful. It's not void of God giving space for repentance"
    },
    {
      "id": 83,
      "start": 1586.9199829101562,
      "end": 1588.9199829101562,
      "text": " for we see that in Nineveh and"
    },
    {
      "id": 84,
      "start": 1589.47998046875,
      "end": 1595.0399780273438,
      "text": " Let me say this as we would consider God's judgment and perhaps those that would like to"
    },
    {
      "id": 85,
      "start": 1595.6799926757812,
      "end": 1601.2799987792969,
      "text": " Reach this conclusion and have this perspective of that which was asked this evening"
    },
    {
      "id": 86,
      "start": 1601.8800048828125,
      "end": 1605.4400024414062,
      "text": " Oftentimes they would look at the people groups as being different"
    },
    {
      "id": 87,
      "start": 1606.1199951171875,
      "end": 1610.7200012207031,
      "text": " The the people groups void of Israel right other than Israel"
    },
    {
      "id": 88,
      "start": 1610.7200012207031,
      "end": 1614.7200012207031,
      "text": " Maybe I should say it that way and this evening for just a few minutes"
    },
    {
      "id": 89,
      "start": 1614.7200012207031,
      "end": 1617.8800048828125,
      "text": " I want us to consider God's judgment upon his own people and"
    },
    {
      "id": 90,
      "start": 1618.5199890136719,
      "end": 1626.0399780273438,
      "text": " As we consider God's judgment upon his own people. I believe that it demonstrates God's justice in a very clear way"
    },
    {
      "id": 91,
      "start": 1627.1600036621094,
      "end": 1629.3999938964844,
      "text": " Because God is no respecter of persons"
    },
    {
      "id": 92,
      "start": 1629.3999938964844,
      "end": 1635.5199890136719,
      "text": " and so when God judges these people groups that we speak of and people say look at what God did to"
    },
    {
      "id": 93,
      "start": 1635.6799926757812,
      "end": 1639.3199768066406,
      "text": " This people group or that people group I say yes, he did"
    },
    {
      "id": 94,
      "start": 1639.7200012207031,
      "end": 1643.9599914550781,
      "text": " But do you want to look at what God did in the nation of Israel who were his own people?"
    },
    {
      "id": 95,
      "start": 1645.2799987792969,
      "end": 1647.2799987792969,
      "text": " Why because God is just"
    },
    {
      "id": 96,
      "start": 1648.239990234375,
      "end": 1651.4400024414062,
      "text": " Right. God is merciful, but God is just"
    },
    {
      "id": 97,
      "start": 1652.1199951171875,
      "end": 1655.0399780273438,
      "text": " think with me turn to look at 2nd Chronicles if you will and"
    },
    {
      "id": 98,
      "start": 1656.2799987792969,
      "end": 1661.7599792480469,
      "text": " 2nd Chronicles chapter number 7 and many times when we speak about 2nd Chronicles chapter number 7 a verse"
    },
    {
      "id": 99,
      "start": 1662.0399780273438,
      "end": 1665.0399780273438,
      "text": " Immediately comes to our mind and that's verse number 14"
    },
    {
      "id": 100,
      "start": 1665.0399780273438,
      "end": 1670.5999755859375,
      "text": " If my people which are called by my name shall humble themselves and pray and seek my face and turn from their wicked ways"
    },
    {
      "id": 101,
      "start": 1670.5999755859375,
      "end": 1675.8399963378906,
      "text": " Then will I hear from heaven and will forgive their sin and will heal their land. What a great verse"
    },
    {
      "id": 102,
      "start": 1676.5599975585938,
      "end": 1681.9599914550781,
      "text": " But I want you to understand that in 2nd Chronicles chapter number 7 not only does God give that promise"
    },
    {
      "id": 103,
      "start": 1682.3199768066406,
      "end": 1684.7599792480469,
      "text": " We've looked at that as being revival promise"
    },
    {
      "id": 104,
      "start": 1684.7599792480469,
      "end": 1690.0799865722656,
      "text": " But I want you to notice what God says in verses 19 through 22 with regard to his judgment"
    },
    {
      "id": 105,
      "start": 1691.5199890136719,
      "end": 1692.8800048828125,
      "text": " Notice in verse number 19"
    },
    {
      "id": 106,
      "start": 1692.8800048828125,
      "end": 1696.1600036621094,
      "text": " But if you turn away and forsake my statutes and my commandments"
    },
    {
      "id": 107,
      "start": 1696.1600036621094,
      "end": 1700.1600036621094,
      "text": " Which I have set before you and shall go and serve other gods and worship them"
    },
    {
      "id": 108,
      "start": 1700.47998046875,
      "end": 1704.5599975585938,
      "text": " Then will I pluck them up by the roots out of my land"
    },
    {
      "id": 109,
      "start": 1704.5599975585938,
      "end": 1710.9599914550781,
      "text": " Which I have given them and this house which I have sanctified for my name will I cast out of my sight and will make?"
    },
    {
      "id": 110,
      "start": 1710.9599914550781,
      "end": 1715.6799926757812,
      "text": " It to be a proverb and a byword among all nations in this house"
    },
    {
      "id": 111,
      "start": 1715.6799926757812,
      "end": 1722.8800048828125,
      "text": " Which is high shall be an astonishment to everyone that passeth by it so that he shall say why hath the Lord done thus?"
    },
    {
      "id": 112,
      "start": 1723.3999633789062,
      "end": 1728.260009765625,
      "text": " Unto this land and unto this house and it shall be answered"
    },
    {
      "id": 113,
      "start": 1729.260009765625,
      "end": 1733.0800170898438,
      "text": " Because they forsook the Lord God of their fathers"
    },
    {
      "id": 114,
      "start": 1733.5,
      "end": 1739.5800170898438,
      "text": " Which brought them forth out of the land of Egypt and laid hold on other gods and worshiped them and served them"
    },
    {
      "id": 115,
      "start": 1740.0599975585938,
      "end": 1742.0599975585938,
      "text": " Therefore hath he brought all this evil"
    },
    {
      "id": 116,
      "start": 1742.97998046875,
      "end": 1744.97998046875,
      "text": " upon them"
    },
    {
      "id": 117,
      "start": 1745.2999877929688,
      "end": 1748.7799682617188,
      "text": " If you want to jot down in your notes, I won't take time to read all the verses"
    },
    {
      "id": 118,
      "start": 1748.7799682617188,
      "end": 1751.739990234375,
      "text": " But look at Psalm 106 verses 35 through 43"
    },
    {
      "id": 119,
      "start": 1751.8999633789062,
      "end": 1757.8200073242188,
      "text": " You'll see how the psalmist records this very same truth with regard to the judgment of God the justice of God"
    },
    {
      "id": 120,
      "start": 1758.3800048828125,
      "end": 1762.219970703125,
      "text": " I want you to think about it within the context of the Assyrian captivity and"
    },
    {
      "id": 121,
      "start": 1762.5800170898438,
      "end": 1766.5,
      "text": " second Kings chapter number seven and I know we're in a lot of places this evening and I"
    },
    {
      "id": 122,
      "start": 1767.219970703125,
      "end": 1772.5399780273438,
      "text": " Hope that as we look and compare scripture with scripture that we don't want to just take one"
    },
    {
      "id": 123,
      "start": 1773.3800048828125,
      "end": 1774.5399780273438,
      "text": " isolated"
    },
    {
      "id": 124,
      "start": 1774.5399780273438,
      "end": 1775.5800170898438,
      "text": " incident"
    },
    {
      "id": 125,
      "start": 1775.5800170898438,
      "end": 1778.3399658203125,
      "text": " From here or from the Word of God and come to a conclusion"
    },
    {
      "id": 126,
      "start": 1779.219970703125,
      "end": 1784.6599731445312,
      "text": " First Kings chapter number seven. I think I said second Kings, but it's first Kings chapter number seven seventeen, excuse me"
    },
    {
      "id": 127,
      "start": 1785.6599731445312,
      "end": 1790.8200073242188,
      "text": " First Kings chapter number seventeen and I want you to look here at what the Word of God tells us. I"
    },
    {
      "id": 128,
      "start": 1794.3800048828125,
      "end": 1797.739990234375,
      "text": " Don't know why I'm in first King it did I say second Kings at first I"
    },
    {
      "id": 129,
      "start": 1800.0999755859375,
      "end": 1803.2999877929688,
      "text": " Said first I said second now, I'm gonna say second again. All right"
    },
    {
      "id": 0,
      "start": 1803.2999877929688,
      "end": 1805.639987707138,
      "text": " 2 Kings chapter 17, please forgive me."
    },
    {
      "id": 1,
      "start": 1805.639987707138,
      "end": 1809.079988002777,
      "text": " 2 Kings chapter 17, my notes even say 2 Kings 17."
    },
    {
      "id": 2,
      "start": 1810.079988002777,
      "end": 1811.9199876785278,
      "text": " But beginning in verse number seven,"
    },
    {
      "id": 3,
      "start": 1811.9199876785278,
      "end": 1814.4799880981445,
      "text": " 2 Kings 17 and verse number seven,"
    },
    {
      "id": 4,
      "start": 1814.4799880981445,
      "end": 1816.3199882507324,
      "text": " I will not have time to read all the way down"
    },
    {
      "id": 5,
      "start": 1816.3199882507324,
      "end": 1819.7199878692627,
      "text": " through verse number 23, but this really records for us"
    },
    {
      "id": 6,
      "start": 1819.7199878692627,
      "end": 1821.6399879455566,
      "text": " the record of the Assyrian captivity"
    },
    {
      "id": 7,
      "start": 1821.6399879455566,
      "end": 1824.2399883270264,
      "text": " of the nation of Israel, the 10 tribes of the north."
    },
    {
      "id": 8,
      "start": 1824.2399883270264,
      "end": 1825.2399883270264,
      "text": " In verse number seven it says,"
    },
    {
      "id": 9,
      "start": 1825.2399883270264,
      "end": 1826.9399871826172,
      "text": " for so it was that the children of Israel"
    },
    {
      "id": 10,
      "start": 1826.9399871826172,
      "end": 1828.9999885559082,
      "text": " had sinned against the Lord their God,"
    },
    {
      "id": 11,
      "start": 1828.9999885559082,
      "end": 1830.6799869537354,
      "text": " which had brought them up out of the land of Egypt"
    },
    {
      "id": 12,
      "start": 1830.6799869537354,
      "end": 1832.3999881744385,
      "text": " from under the hand of Pharaoh, king of Egypt,"
    },
    {
      "id": 13,
      "start": 1832.3999881744385,
      "end": 1834.839988708496,
      "text": " and had feared other gods."
    },
    {
      "id": 14,
      "start": 1834.839988708496,
      "end": 1837.719985961914,
      "text": " And notice what it says in verse number 14,"
    },
    {
      "id": 15,
      "start": 1837.719985961914,
      "end": 1839.9999885559082,
      "text": " notwithstanding they would not hear,"
    },
    {
      "id": 16,
      "start": 1839.9999885559082,
      "end": 1843.279987335205,
      "text": " but hardened their necks like to the neck of their fathers"
    },
    {
      "id": 17,
      "start": 1843.279987335205,
      "end": 1845.3199882507324,
      "text": " that did not believe in the Lord God."
    },
    {
      "id": 18,
      "start": 1845.3199882507324,
      "end": 1847.279987335205,
      "text": " They rejected his statutes and his covenant"
    },
    {
      "id": 19,
      "start": 1847.279987335205,
      "end": 1849.1599884033203,
      "text": " that he made with their fathers and his testimonies,"
    },
    {
      "id": 20,
      "start": 1849.1599884033203,
      "end": 1851.5199890136719,
      "text": " which he testified against them."
    },
    {
      "id": 21,
      "start": 1851.5199890136719,
      "end": 1853.5199890136719,
      "text": " And they followed vanity and became vain"
    },
    {
      "id": 22,
      "start": 1853.5199890136719,
      "end": 1856.2399864196777,
      "text": " and went after the heathen that were around about them,"
    },
    {
      "id": 23,
      "start": 1856.2399864196777,
      "end": 1857.9199867248535,
      "text": " concerning whom the Lord had charged"
    },
    {
      "id": 24,
      "start": 1857.9199867248535,
      "end": 1859.9199867248535,
      "text": " that they should not do like them."
    },
    {
      "id": 25,
      "start": 1859.9199867248535,
      "end": 1862.2399864196777,
      "text": " And they left all the commandments of the Lord their God"
    },
    {
      "id": 26,
      "start": 1863.0799865722656,
      "end": 1864.5999870300293,
      "text": " and made them molten images, even two calves,"
    },
    {
      "id": 27,
      "start": 1864.5999870300293,
      "end": 1866.6399879455566,
      "text": " and made a grove and worshiped all the host of heaven"
    },
    {
      "id": 28,
      "start": 1866.6399879455566,
      "end": 1868.3199844360352,
      "text": " and served Baal."
    },
    {
      "id": 29,
      "start": 1868.3199844360352,
      "end": 1869.5199890136719,
      "text": " Notice in verse 18 it says,"
    },
    {
      "id": 30,
      "start": 1869.5199890136719,
      "end": 1871.6399841308594,
      "text": " therefore the Lord was very angry with Israel"
    },
    {
      "id": 31,
      "start": 1871.6399841308594,
      "end": 1873.339988708496,
      "text": " and removed them out of his sight."
    },
    {
      "id": 32,
      "start": 1873.339988708496,
      "end": 1875.499984741211,
      "text": " There was none left but the tribe of Judah only."
    },
    {
      "id": 33,
      "start": 1875.499984741211,
      "end": 1876.5999908447266,
      "text": " And verse number 23 says,"
    },
    {
      "id": 34,
      "start": 1876.5999908447266,
      "end": 1878.999984741211,
      "text": " until the Lord removed Israel out of his sight,"
    },
    {
      "id": 35,
      "start": 1878.999984741211,
      "end": 1881.239990234375,
      "text": " as he had said by all his servants, the prophets,"
    },
    {
      "id": 36,
      "start": 1881.239990234375,
      "end": 1883.6799850463867,
      "text": " so was Israel carried away out of their own land"
    },
    {
      "id": 37,
      "start": 1883.6799850463867,
      "end": 1886.5599899291992,
      "text": " to Assyria unto this day."
    },
    {
      "id": 38,
      "start": 1887.8199844360352,
      "end": 1888.9199905395508,
      "text": " They face judgment."
    },
    {
      "id": 39,
      "start": 1889.9199905395508,
      "end": 1893.6399841308594,
      "text": " They face the justice of God because of their wickedness,"
    },
    {
      "id": 40,
      "start": 1893.6399841308594,
      "end": 1895.839988708496,
      "text": " because of their behavior."
    },
    {
      "id": 41,
      "start": 1895.839988708496,
      "end": 1897.839988708496,
      "text": " Does it mean that God isn't merciful?"
    },
    {
      "id": 42,
      "start": 1897.839988708496,
      "end": 1899.1999893188477,
      "text": " Oh no, God is merciful."
    },
    {
      "id": 43,
      "start": 1900.3199844360352,
      "end": 1901.6799850463867,
      "text": " But they rejected."
    },
    {
      "id": 44,
      "start": 1901.6799850463867,
      "end": 1904.4399871826172,
      "text": " The Bible told us as we looked at these verses here,"
    },
    {
      "id": 45,
      "start": 1904.4399871826172,
      "end": 1905.6399841308594,
      "text": " it says that they would not hear,"
    },
    {
      "id": 46,
      "start": 1905.6399841308594,
      "end": 1907.4799880981445,
      "text": " that they hardened their necks,"
    },
    {
      "id": 47,
      "start": 1907.4799880981445,
      "end": 1909.3199844360352,
      "text": " that they rejected his statutes,"
    },
    {
      "id": 48,
      "start": 1909.3199844360352,
      "end": 1911.1599884033203,
      "text": " that they left all of his commandments"
    },
    {
      "id": 49,
      "start": 1911.1599884033203,
      "end": 1914.1999893188477,
      "text": " and the judgment of God comes."
    },
    {
      "id": 50,
      "start": 1914.1999893188477,
      "end": 1916.0799865722656,
      "text": " We read this of the Assyrian captivity."
    },
    {
      "id": 51,
      "start": 1916.0799865722656,
      "end": 1918.1999893188477,
      "text": " I want you to think about the Babylonian captivity"
    },
    {
      "id": 52,
      "start": 1918.4799880981445,
      "end": 1921.7999877929688,
      "text": " of Judah from the book of Jeremiah, if you will."
    },
    {
      "id": 53,
      "start": 1921.7999877929688,
      "end": 1922.6399841308594,
      "text": " And I want you to notice,"
    },
    {
      "id": 54,
      "start": 1922.6399841308594,
      "end": 1924.6799850463867,
      "text": " there's some very strong language in the book of Jeremiah"
    },
    {
      "id": 55,
      "start": 1924.6799850463867,
      "end": 1926.7999877929688,
      "text": " that I really hope helps us this evening"
    },
    {
      "id": 56,
      "start": 1926.7999877929688,
      "end": 1931.239990234375,
      "text": " with regard to this subject that is before us."
    },
    {
      "id": 57,
      "start": 1931.239990234375,
      "end": 1932.5199890136719,
      "text": " Because again, there are people"
    },
    {
      "id": 58,
      "start": 1932.5199890136719,
      "end": 1934.6599884033203,
      "text": " that will bring this charge against God,"
    },
    {
      "id": 59,
      "start": 1934.6599884033203,
      "end": 1935.8799896240234,
      "text": " that they will bring this charge"
    },
    {
      "id": 60,
      "start": 1935.8799896240234,
      "end": 1937.0799865722656,
      "text": " as they look at the word of God"
    },
    {
      "id": 61,
      "start": 1937.0799865722656,
      "end": 1939.0799865722656,
      "text": " and they'll say that there's some discrepancy."
    },
    {
      "id": 62,
      "start": 1939.0799865722656,
      "end": 1941.8799896240234,
      "text": " But I hope that as we look at God's dealings"
    },
    {
      "id": 63,
      "start": 1941.8799896240234,
      "end": 1943.9199829101562,
      "text": " with his own people, the nation of Israel,"
    },
    {
      "id": 64,
      "start": 1943.9199829101562,
      "end": 1945.999984741211,
      "text": " that we would see very clearly"
    },
    {
      "id": 65,
      "start": 1945.999984741211,
      "end": 1948.1799926757812,
      "text": " that yes, our God is merciful and gracious,"
    },
    {
      "id": 66,
      "start": 1949.0599822998047,
      "end": 1951.5399932861328,
      "text": " but our God is righteous and just."
    },
    {
      "id": 67,
      "start": 1951.5399932861328,
      "end": 1954.5799865722656,
      "text": " And his attributes are in perfect harmony."
    },
    {
      "id": 68,
      "start": 1954.5799865722656,
      "end": 1958.0199890136719,
      "text": " In Jeremiah 11, look at verses 11 through 13."
    },
    {
      "id": 69,
      "start": 1958.0199890136719,
      "end": 1959.6199951171875,
      "text": " Notice what the word of God says."
    },
    {
      "id": 70,
      "start": 1959.6199951171875,
      "end": 1962.3399810791016,
      "text": " Therefore, thus saith the Lord,"
    },
    {
      "id": 71,
      "start": 1962.3399810791016,
      "end": 1965.1999816894531,
      "text": " behold, I will bring evil upon them,"
    },
    {
      "id": 72,
      "start": 1965.1999816894531,
      "end": 1967.97998046875,
      "text": " which they shall not be able to escape."
    },
    {
      "id": 73,
      "start": 1967.97998046875,
      "end": 1969.6399841308594,
      "text": " And though they shall cry unto me,"
    },
    {
      "id": 74,
      "start": 1969.6399841308594,
      "end": 1971.47998046875,
      "text": " I will not hearken unto them."
    },
    {
      "id": 75,
      "start": 1971.47998046875,
      "end": 1973.0999908447266,
      "text": " You say, God said that?"
    },
    {
      "id": 76,
      "start": 1973.0999908447266,
      "end": 1974.739990234375,
      "text": " Yes."
    },
    {
      "id": 77,
      "start": 1974.739990234375,
      "end": 1975.8599853515625,
      "text": " God said that."
    },
    {
      "id": 78,
      "start": 1975.8599853515625,
      "end": 1977.6599884033203,
      "text": " And he's not talking about the Amalekites"
    },
    {
      "id": 79,
      "start": 1978.4199829101562,
      "end": 1979.5399932861328,
      "text": " or the Amorites or the Philistines"
    },
    {
      "id": 80,
      "start": 1979.5399932861328,
      "end": 1982.219985961914,
      "text": " or the Egyptians or the people of Nineveh."
    },
    {
      "id": 81,
      "start": 1982.219985961914,
      "end": 1985.0199890136719,
      "text": " He's talking about his own people, Judah."
    },
    {
      "id": 82,
      "start": 1985.0199890136719,
      "end": 1986.1399841308594,
      "text": " He says in verse number 12,"
    },
    {
      "id": 83,
      "start": 1986.1399841308594,
      "end": 1987.5799865722656,
      "text": " then shall the cities of Judah"
    },
    {
      "id": 84,
      "start": 1987.5799865722656,
      "end": 1989.2999877929688,
      "text": " and inhabitants of Jerusalem go"
    },
    {
      "id": 85,
      "start": 1989.2999877929688,
      "end": 1991.97998046875,
      "text": " and cry unto the gods unto whom they offer incense,"
    },
    {
      "id": 86,
      "start": 1991.97998046875,
      "end": 1993.5999908447266,
      "text": " but they shall not save them at all"
    },
    {
      "id": 87,
      "start": 1993.5999908447266,
      "end": 1994.8999938964844,
      "text": " in the time of their trouble."
    },
    {
      "id": 88,
      "start": 1994.8999938964844,
      "end": 1997.219985961914,
      "text": " For according to their number of thy cities"
    },
    {
      "id": 89,
      "start": 1997.219985961914,
      "end": 1999.0199890136719,
      "text": " were thy gods, O Judah."
    },
    {
      "id": 90,
      "start": 1999.0199890136719,
      "end": 2001.1399841308594,
      "text": " And according to the number of the streets of Jerusalem,"
    },
    {
      "id": 91,
      "start": 2001.1399841308594,
      "end": 2004.1399841308594,
      "text": " have you set up altars to that shameful thing,"
    },
    {
      "id": 92,
      "start": 2004.1399841308594,
      "end": 2006.499984741211,
      "text": " even altars to burn incense unto Baal."
    },
    {
      "id": 93,
      "start": 2007.499984741211,
      "end": 2009.1399841308594,
      "text": " God says, I'm gonna judge you."
    },
    {
      "id": 94,
      "start": 2009.1399841308594,
      "end": 2010.6999816894531,
      "text": " He says in verse number 13,"
    },
    {
      "id": 95,
      "start": 2010.6999816894531,
      "end": 2013.259994506836,
      "text": " I will bring evil upon them"
    },
    {
      "id": 96,
      "start": 2013.259994506836,
      "end": 2016.0799865722656,
      "text": " that they shall not be able to escape."
    },
    {
      "id": 97,
      "start": 2016.0799865722656,
      "end": 2017.739990234375,
      "text": " Notice in Jeremiah chapter 21,"
    },
    {
      "id": 98,
      "start": 2017.739990234375,
      "end": 2020.3799896240234,
      "text": " turn over several chapters, if you will."
    },
    {
      "id": 99,
      "start": 2020.3799896240234,
      "end": 2022.739990234375,
      "text": " You can look at verses one through 10 for sake of time."
    },
    {
      "id": 100,
      "start": 2022.739990234375,
      "end": 2024.8199920654297,
      "text": " I just want to look at verses four through six."
    },
    {
      "id": 101,
      "start": 2024.8199920654297,
      "end": 2027.259994506836,
      "text": " Jeremiah is responding to Zedekiah."
    },
    {
      "id": 102,
      "start": 2029.5799865722656,
      "end": 2031.4199829101562,
      "text": " The request had been made"
    },
    {
      "id": 103,
      "start": 2031.4199829101562,
      "end": 2033.4199829101562,
      "text": " that he would inquire of the Lord."
    },
    {
      "id": 104,
      "start": 2034.4199829101562,
      "end": 2037.219985961914,
      "text": " Notice in verse two, this is the request."
    },
    {
      "id": 105,
      "start": 2037.219985961914,
      "end": 2039.4199829101562,
      "text": " I pray thee of the Lord for us,"
    },
    {
      "id": 106,
      "start": 2039.4199829101562,
      "end": 2040.8599853515625,
      "text": " for Nebuchadnezzar, king of Babylon,"
    },
    {
      "id": 107,
      "start": 2040.8599853515625,
      "end": 2041.9399871826172,
      "text": " maketh war against us."
    },
    {
      "id": 108,
      "start": 2041.9399871826172,
      "end": 2043.4599914550781,
      "text": " If so be that the Lord will deal with us"
    },
    {
      "id": 109,
      "start": 2043.4599914550781,
      "end": 2044.8199920654297,
      "text": " according to all his wondrous works"
    },
    {
      "id": 110,
      "start": 2044.8199920654297,
      "end": 2047.1399841308594,
      "text": " that he may go up from us."
    },
    {
      "id": 111,
      "start": 2047.1399841308594,
      "end": 2049.019989013672,
      "text": " They're wanting God to just intervene"
    },
    {
      "id": 112,
      "start": 2049.019989013672,
      "end": 2052.019989013672,
      "text": " into some miraculous way in his wondrous works."
    },
    {
      "id": 113,
      "start": 2052.019989013672,
      "end": 2054.279983520508,
      "text": " And they say, Jeremiah, go inquire the Lord for us"
    },
    {
      "id": 114,
      "start": 2054.279983520508,
      "end": 2056.019989013672,
      "text": " and find out if he's gonna show up"
    },
    {
      "id": 115,
      "start": 2056.019989013672,
      "end": 2058.699981689453,
      "text": " and deal mightily for us."
    },
    {
      "id": 116,
      "start": 2058.699981689453,
      "end": 2059.8199768066406,
      "text": " Jeremiah said unto them,"
    },
    {
      "id": 117,
      "start": 2059.8199768066406,
      "end": 2061.019989013672,
      "text": " thus shall you say to Zedekiah."
    },
    {
      "id": 118,
      "start": 2061.019989013672,
      "end": 2062.1399841308594,
      "text": " Look at verse four."
    },
    {
      "id": 119,
      "start": 2062.1399841308594,
      "end": 2064.0999755859375,
      "text": " Thus saith the Lord God of Israel."
    },
    {
      "id": 120,
      "start": 2064.0999755859375,
      "end": 2067.0999755859375,
      "text": " Behold, I will turn back the weapons of war"
    },
    {
      "id": 121,
      "start": 2067.0999755859375,
      "end": 2068.4199829101562,
      "text": " that are in your hands,"
    },
    {
      "id": 122,
      "start": 2068.4199829101562,
      "end": 2070.459991455078,
      "text": " wherewith you fight against the king of Babylon"
    },
    {
      "id": 123,
      "start": 2070.459991455078,
      "end": 2071.4199829101562,
      "text": " and against the Chaldeans,"
    },
    {
      "id": 124,
      "start": 2071.4199829101562,
      "end": 2073.0599975585938,
      "text": " which besiege you without the walls."
    },
    {
      "id": 125,
      "start": 2073.0599975585938,
      "end": 2076.0599975585938,
      "text": " And I will assemble them into the midst of this city."
    },
    {
      "id": 126,
      "start": 2076.0599975585938,
      "end": 2079.459991455078,
      "text": " And I myself will fight against you"
    },
    {
      "id": 127,
      "start": 2079.459991455078,
      "end": 2082.1399841308594,
      "text": " with an outstretched hand and with a strong arm,"
    },
    {
      "id": 128,
      "start": 2082.1399841308594,
      "end": 2085.1399841308594,
      "text": " even in anger and in fury and in great wrath."
    },
    {
      "id": 129,
      "start": 2085.1399841308594,
      "end": 2087.3799743652344,
      "text": " And I will smite the inhabitants of this city,"
    },
    {
      "id": 130,
      "start": 2087.3799743652344,
      "end": 2088.3799743652344,
      "text": " both man and beast."
    },
    {
      "id": 131,
      "start": 2088.3799743652344,
      "end": 2091.3799743652344,
      "text": " They shall die of a great pestilence."
    },
    {
      "id": 132,
      "start": 2091.3799743652344,
      "end": 2093.5399780273438,
      "text": " That's not the answer they were hoping for."
    },
    {
      "id": 133,
      "start": 2094.9400024414062,
      "end": 2096.97998046875,
      "text": " But if you read the indictment against Judah"
    },
    {
      "id": 134,
      "start": 2096.97998046875,
      "end": 2098.7999877929688,
      "text": " in the beginning of the book of Jeremiah,"
    },
    {
      "id": 135,
      "start": 2098.7999877929688,
      "end": 2101.6599731445312,
      "text": " you find that there are people that forgot the Lord,"
    },
    {
      "id": 136,
      "start": 2101.6599731445312,
      "end": 2105.459991455078,
      "text": " they forsook the Lord and they followed after idols."
    },
    {
      "id": 137,
      "start": 2105.459991455078,
      "end": 2107.6799926757812,
      "text": " And God said, you're not listening to my prophets."
    },
    {
      "id": 138,
      "start": 2107.6799926757812,
      "end": 2108.8999938964844,
      "text": " There's no repentance."
    },
    {
      "id": 139,
      "start": 2108.8999938964844,
      "end": 2111.199981689453,
      "text": " Judgment is coming."
    },
    {
      "id": 140,
      "start": 2111.199981689453,
      "end": 2113.0999755859375,
      "text": " Did God not send a prophet?"
    },
    {
      "id": 141,
      "start": 2113.0999755859375,
      "end": 2116.2999877929688,
      "text": " Jeremiah's prophesying until he can't talk anymore."
    },
    {
      "id": 142,
      "start": 2117.3799743652344,
      "end": 2118.9400024414062,
      "text": " And there's just rejection."
    },
    {
      "id": 143,
      "start": 2118.9400024414062,
      "end": 2120.220001220703,
      "text": " So guess what happens?"
    },
    {
      "id": 144,
      "start": 2120.220001220703,
      "end": 2121.220001220703,
      "text": " Judgment."
    },
    {
      "id": 145,
      "start": 2122.0599975585938,
      "end": 2122.8999938964844,
      "text": " They're carried away into Babylon."
    },
    {
      "id": 146,
      "start": 2122.8999938964844,
      "end": 2124.8599853515625,
      "text": " Turn to the book of 2 Chronicles, if you will."
    },
    {
      "id": 147,
      "start": 2126.97998046875,
      "end": 2129.220001220703,
      "text": " 2 Chronicles chapter number 36."
    },
    {
      "id": 148,
      "start": 2131.8599853515625,
      "end": 2133.3799743652344,
      "text": " I want you to notice here,"
    },
    {
      "id": 149,
      "start": 2133.3799743652344,
      "end": 2136.239990234375,
      "text": " as it's described to us, the Babylonian captivity."
    },
    {
      "id": 150,
      "start": 2136.239990234375,
      "end": 2140.8199768066406,
      "text": " We read there in 2 Kings 17 about the Assyrian captivity."
    },
    {
      "id": 151,
      "start": 2140.8199768066406,
      "end": 2144.5,
      "text": " Here in 2 Chronicles 36 and verse number 15,"
    },
    {
      "id": 152,
      "start": 2144.5,
      "end": 2145.459991455078,
      "text": " the Bible says this,"
    },
    {
      "id": 153,
      "start": 2145.459991455078,
      "end": 2149.019989013672,
      "text": " and the Lord God of their father sent to them"
    },
    {
      "id": 154,
      "start": 2149.019989013672,
      "end": 2151.9400024414062,
      "text": " by his messengers, rising up at times and sending"
    },
    {
      "id": 155,
      "start": 2151.9400024414062,
      "end": 2153.8199768066406,
      "text": " because he had had compassion on his people"
    },
    {
      "id": 156,
      "start": 2153.8199768066406,
      "end": 2154.6599731445312,
      "text": " and on his dwelling place."
    },
    {
      "id": 157,
      "start": 2154.6599731445312,
      "end": 2157.5799865722656,
      "text": " God is merciful, he's gracious, but notice what they did."
    },
    {
      "id": 158,
      "start": 2157.5799865722656,
      "end": 2160.5999755859375,
      "text": " They mocked the messengers of God and despised his words"
    },
    {
      "id": 159,
      "start": 2160.5999755859375,
      "end": 2162.2999877929688,
      "text": " and misused his prophets"
    },
    {
      "id": 160,
      "start": 2162.2999877929688,
      "end": 2166.199981689453,
      "text": " until the wrath of the Lord rose against his people."
    },
    {
      "id": 161,
      "start": 2166.199981689453,
      "end": 2168.5799865722656,
      "text": " Notice the last statement of verse 16,"
    },
    {
      "id": 162,
      "start": 2168.5799865722656,
      "end": 2171.5399780273438,
      "text": " till there was no remedy."
    },
    {
      "id": 163,
      "start": 2172.5399780273438,
      "end": 2173.3799743652344,
      "text": " Wow."
    },
    {
      "id": 164,
      "start": 2174.779998779297,
      "end": 2178.259979248047,
      "text": " Yeah, God is merciful, but God is just."
    },
    {
      "id": 165,
      "start": 2178.259979248047,
      "end": 2181.4199829101562,
      "text": " And it's not just that as you study the Old Testament"
    },
    {
      "id": 166,
      "start": 2181.4199829101562,
      "end": 2184.6199951171875,
      "text": " that there's some people groups outside of Israel"
    },
    {
      "id": 167,
      "start": 2184.6199951171875,
      "end": 2188.019989013672,
      "text": " that face the judgment of God because of their wickedness,"
    },
    {
      "id": 168,
      "start": 2188.019989013672,
      "end": 2189.5799865722656,
      "text": " the iniquity of the Amorites."
    },
    {
      "id": 169,
      "start": 2189.5799865722656,
      "end": 2191.8199768066406,
      "text": " Listen, they were wicked people that served idols"
    },
    {
      "id": 170,
      "start": 2191.8199768066406,
      "end": 2194.739990234375,
      "text": " and God gave them space to repent, but they repented not."
    },
    {
      "id": 171,
      "start": 2194.739990234375,
      "end": 2199.0599975585938,
      "text": " And we find that God, his judgment comes,"
    },
    {
      "id": 172,
      "start": 2199.0599975585938,
      "end": 2201.779998779297,
      "text": " but his judgment came for the nation of Israel as well."
    },
    {
      "id": 173,
      "start": 2201.779998779297,
      "end": 2203.5399780273438,
      "text": " And I believe that that ought to help us"
    },
    {
      "id": 174,
      "start": 2203.5399780273438,
      "end": 2207.47998046875,
      "text": " to understand the fullness of God's attributes this evening"
    },
    {
      "id": 175,
      "start": 2207.47998046875,
      "end": 2210.0599975585938,
      "text": " that he is gracious and merciful,"
    },
    {
      "id": 176,
      "start": 2210.0599975585938,
      "end": 2212.3599853515625,
      "text": " but he's righteous and just."
    },
    {
      "id": 177,
      "start": 2212.3599853515625,
      "end": 2215.759979248047,
      "text": " The question put a statement with regard"
    },
    {
      "id": 178,
      "start": 2215.759979248047,
      "end": 2217.7999877929688,
      "text": " to the God of the Old Testament"
    },
    {
      "id": 179,
      "start": 2217.7999877929688,
      "end": 2219.5,
      "text": " versus the God of the New Testament,"
    },
    {
      "id": 180,
      "start": 2219.5,
      "end": 2221.47998046875,
      "text": " that they like the God of the New Testament,"
    },
    {
      "id": 181,
      "start": 2221.47998046875,
      "end": 2223.47998046875,
      "text": " but they do not like the God of the Old Testament."
    },
    {
      "id": 182,
      "start": 2223.47998046875,
      "end": 2227.519989013672,
      "text": " I said this that I feel like, and again, not all, but many,"
    },
    {
      "id": 183,
      "start": 2227.519989013672,
      "end": 2228.8399963378906,
      "text": " have an approach to the Bible"
    },
    {
      "id": 184,
      "start": 2228.8399963378906,
      "end": 2231.3999938964844,
      "text": " that's incorrect and incomplete."
    },
    {
      "id": 185,
      "start": 2231.3999938964844,
      "end": 2232.8399963378906,
      "text": " Why do I say that?"
    },
    {
      "id": 186,
      "start": 2232.8399963378906,
      "end": 2234.3999938964844,
      "text": " Well, turn to the book of Acts."
    },
    {
      "id": 187,
      "start": 2235.3999938964844,
      "end": 2237.4400024414062,
      "text": " New Testament, by the way."
    },
    {
      "id": 188,
      "start": 2238.6799926757812,
      "end": 2243.4400024414062,
      "text": " In Acts 5, you reach a faulty conclusion"
    },
    {
      "id": 189,
      "start": 2243.4400024414062,
      "end": 2246.0599975585938,
      "text": " when you have a faulty approach."
    },
    {
      "id": 190,
      "start": 2246.0599975585938,
      "end": 2250.6799926757812,
      "text": " If you want your approach to be that God is unjust"
    },
    {
      "id": 191,
      "start": 2250.6799926757812,
      "end": 2255.6799926757812,
      "text": " in the things that he did, you begin to read to that end."
    },
    {
      "id": 192,
      "start": 2258.47998046875,
      "end": 2259.5599975585938,
      "text": " If you want to see a distinction"
    },
    {
      "id": 193,
      "start": 2259.5599975585938,
      "end": 2260.6399841308594,
      "text": " between the Old and New Testament,"
    },
    {
      "id": 194,
      "start": 2260.6399841308594,
      "end": 2263.199981689453,
      "text": " perhaps you ignore certain passages"
    },
    {
      "id": 195,
      "start": 2263.199981689453,
      "end": 2264.7999877929688,
      "text": " like we'll look at here in the New Testament"
    },
    {
      "id": 196,
      "start": 2264.7999877929688,
      "end": 2267.1599731445312,
      "text": " very quickly as we conclude."
    },
    {
      "id": 197,
      "start": 2267.1599731445312,
      "end": 2270.7999877929688,
      "text": " We find that there's judgment in the New Testament as well."
    },
    {
      "id": 198,
      "start": 2270.7999877929688,
      "end": 2273.459991455078,
      "text": " In Acts 5, we read of Ananias and Sapphira."
    },
    {
      "id": 199,
      "start": 2274.7999877929688,
      "end": 2277.1199951171875,
      "text": " What was the offense of Ananias and Sapphira?"
    },
    {
      "id": 200,
      "start": 2277.1199951171875,
      "end": 2278.5999755859375,
      "text": " They lied."
    },
    {
      "id": 201,
      "start": 2278.5999755859375,
      "end": 2279.4400024414062,
      "text": " They lied."
    },
    {
      "id": 202,
      "start": 2280.6399841308594,
      "end": 2283.5599975585938,
      "text": " Now, sin is sin, right?"
    },
    {
      "id": 203,
      "start": 2283.5599975585938,
      "end": 2285.3599853515625,
      "text": " We see that in the Word of God."
    },
    {
      "id": 204,
      "start": 2285.3599853515625,
      "end": 2287.459991455078,
      "text": " But you know, for many people today,"
    },
    {
      "id": 205,
      "start": 2288.759979248047,
      "end": 2291.1599731445312,
      "text": " I would say many people today on a Sunday"
    },
    {
      "id": 206,
      "start": 2291.1599731445312,
      "end": 2294.0599975585938,
      "text": " in the United States of America that sat in church today,"
    },
    {
      "id": 207,
      "start": 2295.1599731445312,
      "end": 2296.6599731445312,
      "text": " lying is no big deal to them."
    },
    {
      "id": 208,
      "start": 2297.5999755859375,
      "end": 2299.519989013672,
      "text": " They don't even think about it."
    },
    {
      "id": 209,
      "start": 2299.519989013672,
      "end": 2301.6399841308594,
      "text": " They don't even think twice about lying."
    },
    {
      "id": 210,
      "start": 2301.6399841308594,
      "end": 2304.4400024414062,
      "text": " If it means that I'm gonna face a consequence"
    },
    {
      "id": 211,
      "start": 2304.4400024414062,
      "end": 2308.1199951171875,
      "text": " that's not pleasant, I mean, people lie all the time."
    },
    {
      "id": 212,
      "start": 2308.1199951171875,
      "end": 2310.3199768066406,
      "text": " I'm not saying that it's right, it's wrong."
    },
    {
      "id": 213,
      "start": 2311.3599853515625,
      "end": 2314.779998779297,
      "text": " But the offense of Ananias and Sapphira is that they lied."
    },
    {
      "id": 214,
      "start": 2316.2799682617188,
      "end": 2317.760009765625,
      "text": " The Bible records for us here"
    },
    {
      "id": 215,
      "start": 2317.760009765625,
      "end": 2319.6799926757812,
      "text": " that Peter actually says to them,"
    },
    {
      "id": 216,
      "start": 2319.6799926757812,
      "end": 2323.3999633789062,
      "text": " listen, when it was your land, you could have kept it."
    },
    {
      "id": 217,
      "start": 2323.3999633789062,
      "end": 2325.0,
      "text": " You didn't have to sell it."
    },
    {
      "id": 218,
      "start": 2325.0,
      "end": 2327.7999877929688,
      "text": " And when you sold your land and you made your money,"
    },
    {
      "id": 219,
      "start": 2327.7999877929688,
      "end": 2329.760009765625,
      "text": " you didn't have to give it all."
    },
    {
      "id": 220,
      "start": 2331.739990234375,
      "end": 2332.5800170898438,
      "text": " Right?"
    },
    {
      "id": 221,
      "start": 2332.5800170898438,
      "end": 2333.3999633789062,
      "text": " That's what happens."
    },
    {
      "id": 222,
      "start": 2333.3999633789062,
      "end": 2334.239990234375,
      "text": " We won't take time to read all of it,"
    },
    {
      "id": 223,
      "start": 2334.239990234375,
      "end": 2335.9199829101562,
      "text": " but I want you to notice what happens"
    },
    {
      "id": 224,
      "start": 2335.9199829101562,
      "end": 2338.219970703125,
      "text": " that Peter says that you've conceived"
    },
    {
      "id": 225,
      "start": 2338.219970703125,
      "end": 2339.0599975585938,
      "text": " this thing in thine heart."
    },
    {
      "id": 226,
      "start": 2339.0599975585938,
      "end": 2341.7000122070312,
      "text": " You've lied, not unto men at the end of verse number four,"
    },
    {
      "id": 227,
      "start": 2341.7000122070312,
      "end": 2343.1599731445312,
      "text": " but unto God."
    },
    {
      "id": 228,
      "start": 2343.1599731445312,
      "end": 2344.8399658203125,
      "text": " And Ananias, hearing these words,"
    },
    {
      "id": 229,
      "start": 2344.8399658203125,
      "end": 2347.5599975585938,
      "text": " fell down and gave up the ghost."
    },
    {
      "id": 230,
      "start": 2347.5999755859375,
      "end": 2350.2000122070312,
      "text": " And great fear came on all them that heard these things."
    },
    {
      "id": 231,
      "start": 2350.2000122070312,
      "end": 2351.3999633789062,
      "text": " I guess so."
    },
    {
      "id": 232,
      "start": 2352.9199829101562,
      "end": 2353.8800048828125,
      "text": " Right?"
    },
    {
      "id": 233,
      "start": 2353.8800048828125,
      "end": 2356.1599731445312,
      "text": " I mean, what happens if one of us lied today"
    },
    {
      "id": 234,
      "start": 2356.1599731445312,
      "end": 2357.239990234375,
      "text": " and you just died?"
    },
    {
      "id": 235,
      "start": 2361.1199951171875,
      "end": 2363.239990234375,
      "text": " Do you understand what I'm saying?"
    },
    {
      "id": 236,
      "start": 2363.239990234375,
      "end": 2364.6400146484375,
      "text": " It would impact us."
    },
    {
      "id": 237,
      "start": 2366.0800170898438,
      "end": 2368.2799682617188,
      "text": " Sapphira, the Bible tells us, it continues."
    },
    {
      "id": 238,
      "start": 2368.2799682617188,
      "end": 2370.2799682617188,
      "text": " In verse number six, the young man arose, wound him up,"
    },
    {
      "id": 239,
      "start": 2370.2799682617188,
      "end": 2372.0399780273438,
      "text": " and carried him out and buried him."
    },
    {
      "id": 240,
      "start": 2372.0399780273438,
      "end": 2373.760009765625,
      "text": " And it was about the space of three hours after"
    },
    {
      "id": 241,
      "start": 2373.760009765625,
      "end": 2376.5999755859375,
      "text": " when his wife, not knowing what was done, came in."
    },
    {
      "id": 242,
      "start": 2376.5999755859375,
      "end": 2378.5599975585938,
      "text": " And she's asked the same line of questions."
    },
    {
      "id": 243,
      "start": 2378.5599975585938,
      "end": 2380.7999877929688,
      "text": " And she says, yep, yay for so much."
    },
    {
      "id": 244,
      "start": 2380.7999877929688,
      "end": 2381.6400146484375,
      "text": " At the end of verse number eight,"
    },
    {
      "id": 245,
      "start": 2381.6400146484375,
      "end": 2382.47998046875,
      "text": " then Peter said unto her,"
    },
    {
      "id": 246,
      "start": 2382.47998046875,
      "end": 2384.0800170898438,
      "text": " how is it that ye have agreed together"
    },
    {
      "id": 247,
      "start": 2384.0800170898438,
      "end": 2385.4400024414062,
      "text": " to tempt the Spirit of the Lord?"
    },
    {
      "id": 248,
      "start": 2385.4400024414062,
      "end": 2387.5199584960938,
      "text": " Behold, the feet of them which have buried thy husband"
    },
    {
      "id": 249,
      "start": 2387.5199584960938,
      "end": 2389.6799926757812,
      "text": " are at the door and shall carry thee out."
    },
    {
      "id": 250,
      "start": 2389.6799926757812,
      "end": 2391.9599609375,
      "text": " Then fell she down straightway at his feet"
    },
    {
      "id": 251,
      "start": 2391.9599609375,
      "end": 2393.0,
      "text": " and yielded up the ghost."
    },
    {
      "id": 252,
      "start": 2393.0,
      "end": 2395.9199829101562,
      "text": " And the young men came in and found her dead"
    },
    {
      "id": 253,
      "start": 2395.9199829101562,
      "end": 2398.6400146484375,
      "text": " and carrying her forth, buried her by her husband."
    },
    {
      "id": 254,
      "start": 2399.6400146484375,
      "end": 2401.0,
      "text": " Look at the result in verse number 11."
    },
    {
      "id": 255,
      "start": 2401.0,
      "end": 2403.0399780273438,
      "text": " And great fear came upon all the church."
    },
    {
      "id": 0,
      "start": 2403.0399780273438,
      "end": 2415.479977607727,
      "text": " and upon as many as heard these things. They lied and they died.\" Is that not judgment?"
    },
    {
      "id": 1,
      "start": 2415.479977607727,
      "end": 2422.8799781799316,
      "text": " Absolutely. God is just and He is righteous, and the judge of all the earth shall do what's"
    },
    {
      "id": 2,
      "start": 2422.8799781799316,
      "end": 2429.679977416992,
      "text": " right. Turn to the book of...right here in the book of Acts, turn to the chapter 12."
    },
    {
      "id": 3,
      "start": 2429.679977416992,
      "end": 2435.679977416992,
      "text": " In Acts chapter 12, we read of Herod. You say, well, Herod deserved it. He killed James"
    },
    {
      "id": 4,
      "start": 2435.679977416992,
      "end": 2442.799976348877,
      "text": " and he was going to kill Peter. Well, Herod is here at the end of Acts chapter 12, and"
    },
    {
      "id": 5,
      "start": 2442.799976348877,
      "end": 2447.0999794006348,
      "text": " the Bible says that in verse number 20, and Herod was highly displeased with them of Tyre"
    },
    {
      "id": 6,
      "start": 2447.0999794006348,
      "end": 2451.0399780273438,
      "text": " and Sidon, but they came with one accord to him, and having made Blastas the king's chamberlain"
    },
    {
      "id": 7,
      "start": 2451.0399780273438,
      "end": 2455.759979248047,
      "text": " their friend, desired peace because their country was nourished by the king's country."
    },
    {
      "id": 8,
      "start": 2455.759979248047,
      "end": 2460.5999794006348,
      "text": " And upon a set day Herod arrayed in royal apparel, sat upon his throne and made an oration"
    },
    {
      "id": 9,
      "start": 2460.5999794006348,
      "end": 2464.639976501465,
      "text": " unto them. The people gave a shout, saying, It is of the voice of God and not of man."
    },
    {
      "id": 10,
      "start": 2464.639976501465,
      "end": 2468.5999755859375,
      "text": " And immediately the angel of the Lord smote him, because he gave not God the glory, and"
    },
    {
      "id": 11,
      "start": 2468.5999755859375,
      "end": 2475.9199752807617,
      "text": " he was eaten of worms and gave up the ghost. We're talking about judgment, New Testament,"
    },
    {
      "id": 12,
      "start": 2475.9199752807617,
      "end": 2481.359977722168,
      "text": " God's judgment, right? And so we begin to look at the Scriptures, and sometimes what"
    },
    {
      "id": 13,
      "start": 2481.359977722168,
      "end": 2485.4399795532227,
      "text": " happens is we don't see the judgment in the New Testament, maybe in the same light as"
    },
    {
      "id": 14,
      "start": 2485.4399795532227,
      "end": 2490.239974975586,
      "text": " we see the Old Testament. One of the reasons I believe that to be the case is because God"
    },
    {
      "id": 15,
      "start": 2490.239974975586,
      "end": 2493.7799758911133,
      "text": " is dealing with Israel as a nation in the Old Testament. He's dealing with the church"
    },
    {
      "id": 16,
      "start": 2493.7799758911133,
      "end": 2498.459976196289,
      "text": " as a organism in the New Testament, and there's distinction between that. There are many people"
    },
    {
      "id": 17,
      "start": 2498.459976196289,
      "end": 2503.4399795532227,
      "text": " groups that come against Israel as a nation, and therefore they have the right to protect"
    },
    {
      "id": 18,
      "start": 2503.4399795532227,
      "end": 2506.859977722168,
      "text": " their borders and all of those things, and they have… the Philistines are constantly"
    },
    {
      "id": 19,
      "start": 2506.859977722168,
      "end": 2510.55997467041,
      "text": " coming against the nation of Israel and to fight against them, and the Amorites that"
    },
    {
      "id": 20,
      "start": 2510.55997467041,
      "end": 2514.679977416992,
      "text": " set that coalition that we read of in Joshua chapter 10, they're coming against, they"
    },
    {
      "id": 21,
      "start": 2514.679977416992,
      "end": 2521.3199768066406,
      "text": " set in battle against the city of Gibeon. Why? Because of the agreement that had been"
    },
    {
      "id": 22,
      "start": 2521.3199768066406,
      "end": 2525.3999786376953,
      "text": " made between the Gibeonites and the nation of Israel, and we find that they're defeated."
    },
    {
      "id": 23,
      "start": 2525.3999786376953,
      "end": 2529.799980163574,
      "text": " But we see that in the New Testament, God is still a God of just judgment."
    },
    {
      "id": 24,
      "start": 2529.799980163574,
      "end": 2537.7999725341797,
      "text": " I want to remind you of 1 Corinthians chapter 11. We have our Lord's Supper table before"
    },
    {
      "id": 25,
      "start": 2537.7999725341797,
      "end": 2542.199981689453,
      "text": " us, every single service you come in, and as you walk into these doors, one of the first"
    },
    {
      "id": 26,
      "start": 2542.199981689453,
      "end": 2546.239974975586,
      "text": " things that you see is up here on the platform area, this Lord's Supper table. It says,"
    },
    {
      "id": 27,
      "start": 2546.239974975586,
      "end": 2551.759979248047,
      "text": " This do in remembrance of me. We should be mindful of the fact that as we observe the"
    },
    {
      "id": 28,
      "start": 2551.759979248047,
      "end": 2555.0399780273438,
      "text": " Lord's Supper, and even as we think about the table of remembrance that is there, and"
    },
    {
      "id": 29,
      "start": 2555.0399780273438,
      "end": 2560.1599731445312,
      "text": " we see those words and we're mindful of the truth of 1 Corinthians chapter 11, we speak"
    },
    {
      "id": 30,
      "start": 2560.1599731445312,
      "end": 2565.9199829101562,
      "text": " about that importance of eating and drinking in a fashion in which we're not eating and"
    },
    {
      "id": 31,
      "start": 2565.9199829101562,
      "end": 2571.239974975586,
      "text": " drinking unworthily. We let a man examine himself, but I want to remind you what 1"
    },
    {
      "id": 32,
      "start": 2571.239974975586,
      "end": 2577.999984741211,
      "text": " Corinthians 11 and verse number 30 says. Those that would eat and drink unworthily, it says,"
    },
    {
      "id": 33,
      "start": 2577.999984741211,
      "end": 2583.759979248047,
      "text": " for this cause many are weak and sickly among you, and many sleep. You understand that word"
    },
    {
      "id": 34,
      "start": 2583.759979248047,
      "end": 2592.9199829101562,
      "text": " sleep is not, you took a siesta this afternoon. The word sleep means died. They were dead."
    },
    {
      "id": 35,
      "start": 2592.9199829101562,
      "end": 2599.459976196289,
      "text": " God's judgment. God's judgment. I would say this, as you look at the churches in the book"
    },
    {
      "id": 36,
      "start": 2599.459976196289,
      "end": 2606.5599822998047,
      "text": " of Revelation, the churches of Asia, sometimes the judgment is maybe different judgment than"
    },
    {
      "id": 37,
      "start": 2606.5599822998047,
      "end": 2612.519973754883,
      "text": " what we see in the Old Testament. Maybe it's not that a people group is destroyed, but"
    },
    {
      "id": 38,
      "start": 2612.519973754883,
      "end": 2616.8399810791016,
      "text": " you know it's sad judgment when God says to the church at Ephesus, If you don't repent,"
    },
    {
      "id": 39,
      "start": 2616.8399810791016,
      "end": 2623.8799743652344,
      "text": " I'm going to remove your candlestick. That's serious. But sometimes what happens is we"
    },
    {
      "id": 40,
      "start": 2623.8799743652344,
      "end": 2628.3599853515625,
      "text": " don't look at that as being judgment, because the reality is that sometimes we go through"
    },
    {
      "id": 41,
      "start": 2628.3599853515625,
      "end": 2633.279983520508,
      "text": " the motions of church. We don't even know if the Holy Spirit's present, if He's even…"
    },
    {
      "id": 42,
      "start": 2633.279983520508,
      "end": 2638.0799713134766,
      "text": " We're just going through what we do. We're just on our routine. We're just on our check"
    },
    {
      "id": 43,
      "start": 2638.0799713134766,
      "end": 2646.7999725341797,
      "text": " the box, go to church. But God's judgment, removing His presence, removing the candlestick"
    },
    {
      "id": 44,
      "start": 2646.7999725341797,
      "end": 2654.6599731445312,
      "text": " as it says here in Revelation chapter 2 with dealing with the church at Ephesus. It's interesting"
    },
    {
      "id": 45,
      "start": 2654.6599731445312,
      "end": 2660.6799926757812,
      "text": " as you read the messages to the churches, you find that many times that God says, Repent,"
    },
    {
      "id": 46,
      "start": 2660.6799926757812,
      "end": 2668.0399780273438,
      "text": " or here's the consequence. And this evening we begin to think about some of the judgment"
    },
    {
      "id": 47,
      "start": 2668.0399780273438,
      "end": 2673.959991455078,
      "text": " that we would see in New Testament Christianity. It might not be the same kind of judgment"
    },
    {
      "id": 48,
      "start": 2673.959991455078,
      "end": 2678.6399841308594,
      "text": " that we see in the Old Testament with some of these people groups, but nonetheless it's"
    },
    {
      "id": 49,
      "start": 2678.6399841308594,
      "end": 2684.439971923828,
      "text": " judgment. And there are times that people die a premature death. Why? Because of their"
    },
    {
      "id": 50,
      "start": 2684.439971923828,
      "end": 2689.9199829101562,
      "text": " carnality, because of their behavior. I think it was D.L. Moody that said this, When God's"
    },
    {
      "id": 51,
      "start": 2689.9199829101562,
      "end": 2694.3199768066406,
      "text": " people are not walking in holiness, that God begins to deal with them. And the first way"
    },
    {
      "id": 52,
      "start": 2694.3199768066406,
      "end": 2698.0399780273438,
      "text": " in which God deals with His people that are not walking in obedience to His Word and walking"
    },
    {
      "id": 53,
      "start": 2698.0399780273438,
      "end": 2702.999969482422,
      "text": " in holiness, for God said that we're to be holy as He is holy in all manner of conversation."
    },
    {
      "id": 54,
      "start": 2702.999969482422,
      "end": 2709.0799865722656,
      "text": " And he said the first form of the way in which God deals with His people is that of conviction."
    },
    {
      "id": 55,
      "start": 2709.0799865722656,
      "end": 2716.239990234375,
      "text": " You ever face conviction? What happens when we get convicted? When we hear the preaching"
    },
    {
      "id": 56,
      "start": 2716.239990234375,
      "end": 2719.1199645996094,
      "text": " of the Word of God, when we read the Word of God in our daily lives, we're reading the"
    },
    {
      "id": 57,
      "start": 2719.1199645996094,
      "end": 2725.5999755859375,
      "text": " Word of God and God begins to convict us. We can respond to that in one of two ways."
    },
    {
      "id": 58,
      "start": 2725.5999755859375,
      "end": 2730.239990234375,
      "text": " We can have a soft heart and respond in obedience to the Word of God and we can get right whatever"
    },
    {
      "id": 59,
      "start": 2730.239990234375,
      "end": 2736.3199768066406,
      "text": " we need to get right. Or, we can harden our hearts. We can quench the Spirit of God. We"
    },
    {
      "id": 60,
      "start": 2736.3199768066406,
      "end": 2743.2999877929688,
      "text": " can grieve the Spirit of God. When we quench and grieve the Spirit of God, that conviction,"
    },
    {
      "id": 61,
      "start": 2743.2999877929688,
      "end": 2748.959991455078,
      "text": " we just learn how to kind of deal with it. And after a little while, we're not so impacted"
    },
    {
      "id": 62,
      "start": 2748.959991455078,
      "end": 2753.959991455078,
      "text": " by the conviction. Someone drew a diagram and explained conviction like a triangle in"
    },
    {
      "id": 63,
      "start": 2753.959991455078,
      "end": 2759.959991455078,
      "text": " a sandbox. And eventually, the triangle in the sandbox as it rotates either way, whichever"
    },
    {
      "id": 64,
      "start": 2759.959991455078,
      "end": 2765.8399658203125,
      "text": " way you want to have it rotate in your mind, eventually after it rotates one complete revolution,"
    },
    {
      "id": 65,
      "start": 2765.8399658203125,
      "end": 2771.1199645996094,
      "text": " that triangle now becomes a circle. And the circle, the triangle will move freely within"
    },
    {
      "id": 66,
      "start": 2771.1199645996094,
      "end": 2777.199981689453,
      "text": " the circle without any friction from the sand. Do you see it in your mind's eye? Why? Because"
    },
    {
      "id": 67,
      "start": 2777.199981689453,
      "end": 2780.7999877929688,
      "text": " we've just quenched the Spirit of God. We've grieved the Spirit of God. And so, God deals"
    },
    {
      "id": 68,
      "start": 2780.7999877929688,
      "end": 2784.3999633789062,
      "text": " with conviction. And after conviction, if we don't respond to conviction, you know what"
    },
    {
      "id": 69,
      "start": 2784.3999633789062,
      "end": 2790.3599853515625,
      "text": " God uses? Chastisement. You know why He chastens us? Because He loves us. And there are people"
    },
    {
      "id": 70,
      "start": 2790.3599853515625,
      "end": 2794.699981689453,
      "text": " that look at the chastisement of the Lord in a wrong way. We say, no, God chastens us"
    },
    {
      "id": 71,
      "start": 2794.699981689453,
      "end": 2801.7999877929688,
      "text": " because we're His sons, because He loves us. Dale Moody went on to say that if we don't"
    },
    {
      "id": 72,
      "start": 2801.7999877929688,
      "end": 2807.3199768066406,
      "text": " respond to the conviction, we face the chastisement. And if we don't respond to the chastisement,"
    },
    {
      "id": 73,
      "start": 2807.3199768066406,
      "end": 2814.519989013672,
      "text": " we face a coffin. That's pretty serious. As you look at the Word of God and you look"
    },
    {
      "id": 74,
      "start": 2814.519989013672,
      "end": 2820.6399841308594,
      "text": " at 1 Corinthians 11, and for this cause, many are sick and weakly among you, and many sleep."
    },
    {
      "id": 75,
      "start": 2820.6399841308594,
      "end": 2828.2799682617188,
      "text": " Listen, not everyone that's sick is facing the chastisement of God. We understand that"
    },
    {
      "id": 76,
      "start": 2828.2799682617188,
      "end": 2832.199981689453,
      "text": " biblically. Not every time somebody's sick. But I'm going to tell you what, if I'm sick,"
    },
    {
      "id": 77,
      "start": 2832.199981689453,
      "end": 2836.719970703125,
      "text": " I want to... Lord, did I do something like... I want to make sure I'm not sick or weakly"
    },
    {
      "id": 78,
      "start": 2836.719970703125,
      "end": 2843.6399841308594,
      "text": " because of my disobedience. He says, many sleep. They've died. Premature deaths from"
    },
    {
      "id": 79,
      "start": 2843.6399841308594,
      "end": 2850.6799926757812,
      "text": " a human, from our human perspective. Why? Because they ate and drank unworthily."
    },
    {
      "id": 80,
      "start": 2850.6799926757812,
      "end": 2857.6399841308594,
      "text": " Listen, in the New Testament, we find that God, He exercises judgment. We read it in"
    },
    {
      "id": 81,
      "start": 2857.6399841308594,
      "end": 2863.2799682617188,
      "text": " Acts 5 with Ananias and Sapphira, in Acts 12 with Herod. Believers in general in 1 Corinthians"
    },
    {
      "id": 82,
      "start": 2863.2799682617188,
      "end": 2870.1599731445312,
      "text": " 11. The churches of Asia that are mentioned in the book of Revelation, specifically there"
    },
    {
      "id": 83,
      "start": 2870.1599731445312,
      "end": 2876.759979248047,
      "text": " with the church at Ephesus, as we referenced in Revelation 2. And this evening, as we begin"
    },
    {
      "id": 84,
      "start": 2876.759979248047,
      "end": 2881.0799865722656,
      "text": " to think about our God, I'm so thankful that our God is gracious and merciful. But the"
    },
    {
      "id": 85,
      "start": 2881.0799865722656,
      "end": 2888.0799865722656,
      "text": " writer of Hebrews said that our God is a consuming fire, is a fearful thing to fall in the hands"
    },
    {
      "id": 86,
      "start": 2888.0799865722656,
      "end": 2895.519989013672,
      "text": " of a living God, an angry God. And you think about His justice and His judgment. I'm thankful"
    },
    {
      "id": 87,
      "start": 2895.519989013672,
      "end": 2900.719970703125,
      "text": " that God is gracious and merciful. And we do see His judgment in the Old Testament and"
    },
    {
      "id": 88,
      "start": 2900.719970703125,
      "end": 2905.5599670410156,
      "text": " the New Testament. Listen, God said of Himself, I'm the same yesterday, today, and forever."
    },
    {
      "id": 89,
      "start": 2905.5599670410156,
      "end": 2912.259979248047,
      "text": " Begin to approach the Scriptures with that perspective as we begin to read a passage"
    },
    {
      "id": 90,
      "start": 2912.259979248047,
      "end": 2919.5399780273438,
      "text": " that seems to contradict from man's perspective what that truth reveals to us, then we better"
    },
    {
      "id": 91,
      "start": 2919.5399780273438,
      "end": 2924.2599487304688,
      "text": " dig in and dig deeper and try to understand what it is that's taking place and what God"
    },
    {
      "id": 92,
      "start": 2924.2599487304688,
      "end": 2931.6599731445312,
      "text": " is recording for us. So, how do we answer the skeptics? I said we'd end with Jonah 4."
    },
    {
      "id": 93,
      "start": 2931.6599731445312,
      "end": 2938.6799926757812,
      "text": " I already put my Bible away, and so some of you did as well. But look back at Jonah 4."
    },
    {
      "id": 94,
      "start": 2938.6799926757812,
      "end": 2947.239990234375,
      "text": " Look back at Jonah chapter 4. You know, from Jonah's perspective, the people of Nineveh"
    },
    {
      "id": 95,
      "start": 2947.239990234375,
      "end": 2955.1199951171875,
      "text": " deserve judgment. Capital of Assyria, wicked people. They say that the city of Nineveh"
    },
    {
      "id": 96,
      "start": 2955.1199951171875,
      "end": 2959.9199829101562,
      "text": " was lined with stakes that had skulls on them from the people they defeated. It was a wicked"
    },
    {
      "id": 97,
      "start": 2959.9199829101562,
      "end": 2968.0399780273438,
      "text": " place, immoral, ungodly. I think that that Nineveh, Jonah would have been perfectly happy"
    },
    {
      "id": 98,
      "start": 2968.1199951171875,
      "end": 2973.7999877929688,
      "text": " if Nineveh had been destroyed. He'd have been happy about it. That's why he fled. He says"
    },
    {
      "id": 99,
      "start": 2973.7999877929688,
      "end": 2980.8399658203125,
      "text": " in verse number 1, it displeased Jonah exceedingly, and he is very angry. Why? Because God repented"
    },
    {
      "id": 100,
      "start": 2980.8399658203125,
      "end": 2984.1199951171875,
      "text": " the evil that He had said that He would do against them or unto them, and He did it not."
    },
    {
      "id": 101,
      "start": 2984.1199951171875,
      "end": 2987.47998046875,
      "text": " Verse number 2, he prayed unto the Lord and said, I pray thee, O Lord, was not this my"
    },
    {
      "id": 102,
      "start": 2987.47998046875,
      "end": 2994.239990234375,
      "text": " saying when I was yet in my country? Therefore I fled before unto Tarshish. Why? For I knew"
    },
    {
      "id": 103,
      "start": 2994.239990234375,
      "end": 3003.0399780273438,
      "text": " that Thou art a gracious God, and merciful. Slow to anger."
    },
    {
      "id": 0,
      "start": 3003.0399780273438,
      "end": 3012.7199783325195,
      "text": " and of great kindness, and repentest thee of the evil.\" God is gracious, God is"
    },
    {
      "id": 1,
      "start": 3012.7199783325195,
      "end": 3020.599977493286,
      "text": " merciful, God is slow to anger and of great kindness, and God is just, and God"
    },
    {
      "id": 2,
      "start": 3020.599977493286,
      "end": 3026.9599781036377,
      "text": " is righteous. When people reject, whether Old Testament or New Testament, when people"
    },
    {
      "id": 3,
      "start": 3026.9599781036377,
      "end": 3032.7999782562256,
      "text": " reject the grace and mercy of God, the light that God gives, judgment is the"
    },
    {
      "id": 4,
      "start": 3032.7999782562256,
      "end": 3038.359977722168,
      "text": " consequence. And so this evening I hope that that would help us in dealing with"
    },
    {
      "id": 5,
      "start": 3038.359977722168,
      "end": 3044.199977874756,
      "text": " some skeptics, taking a more thorough approach to the Word of God, a complete"
    },
    {
      "id": 6,
      "start": 3044.199977874756,
      "end": 3049.0399780273438,
      "text": " understanding of the passages that often are looked to and attacked and"
    },
    {
      "id": 7,
      "start": 3049.0399780273438,
      "end": 3053.0399780273438,
      "text": " criticized, and say, okay, let's dig in. Why did this happen the way that it did?"
    },
    {
      "id": 8,
      "start": 3053.0399780273438,
      "end": 3058.359977722168,
      "text": " What was God really revealing? Why did God send ten plagues before nine and"
    },
    {
      "id": 9,
      "start": 3058.359977722168,
      "end": 3064.2799797058105,
      "text": " then the death of the firstborn? Is that not the grace and mercy of God? Is that"
    },
    {
      "id": 10,
      "start": 3064.2799797058105,
      "end": 3071.079978942871,
      "text": " not God revealing Himself? Absolutely. But there's a refusal, there's a rejection."
    },
    {
      "id": 11,
      "start": 3071.079978942871,
      "end": 3075.799980163574,
      "text": " We find that throughout the Word of God, He is the judge of all the earth, and He"
    },
    {
      "id": 12,
      "start": 3075.799980163574,
      "end": 3080.359977722168,
      "text": " always does what is right. Let's pray. Father, we love You this evening. We thank"
    },
    {
      "id": 13,
      "start": 3080.359977722168,
      "end": 3085.5999755859375,
      "text": " You for loving us. We thank You for Your precious Word, for the truth that's"
    },
    {
      "id": 14,
      "start": 3085.5999755859375,
      "end": 3091.199981689453,
      "text": " contained therein. I pray this evening, we've looked at so many passages of"
    },
    {
      "id": 15,
      "start": 3091.199981689453,
      "end": 3100.1199798583984,
      "text": " Scripture, we've used some examples that some may turn to in order to attack."
    },
    {
      "id": 16,
      "start": 3101.0399780273438,
      "end": 3109.8399810791016,
      "text": " We've looked at passages that show that You're no respecter of persons, that when"
    },
    {
      "id": 17,
      "start": 3109.8399810791016,
      "end": 3117.55997467041,
      "text": " Your people rejected You and refused to obey You and turned to idols, they faced"
    },
    {
      "id": 18,
      "start": 3117.55997467041,
      "end": 3125.5999755859375,
      "text": " Your judgment, severe judgment. We've looked at examples in the New Testament"
    },
    {
      "id": 19,
      "start": 3125.5999755859375,
      "end": 3136.5599822998047,
      "text": " of those that have faced judgment. God, I pray that this evening, as we consider"
    },
    {
      "id": 20,
      "start": 3136.5599822998047,
      "end": 3142.0399780273438,
      "text": " our own lives, that we would determine that we will walk in holiness and that we would"
    },
    {
      "id": 21,
      "start": 3142.0399780273438,
      "end": 3151.0399780273438,
      "text": " walk in obedience to Thy Word. For we do not want to face Your hand of judgment. We'd"
    },
    {
      "id": 22,
      "start": 3151.0399780273438,
      "end": 3158.679977416992,
      "text": " much rather have Your hand of blessing. And God, I pray that You would continue to enable"
    },
    {
      "id": 23,
      "start": 3158.759979248047,
      "end": 3168.0399780273438,
      "text": " us to adequately interact with those that we come into contact with, that we'd be ready"
    },
    {
      "id": 24,
      "start": 3168.0399780273438,
      "end": 3173.519973754883,
      "text": " to give an answer of the hope that lies within us. I pray that as we have a time of invitation"
    },
    {
      "id": 25,
      "start": 3173.519973754883,
      "end": 3177.7999725341797,
      "text": " that we would respond. Lord, that You do a work in our hearts and lives where You would"
    },
    {
      "id": 26,
      "start": 3177.7999725341797,
      "end": 3180.959976196289,
      "text": " be glorified, and we'll thank You for it. In Christ's name, would You stand with us?"
    }
  ],
  "processed_at": "2025-04-16T14:03:41.658271"
}