{
  "video_id": "7-Svueb0C4s",
  "text": "And on Wednesday evenings here for a few weeks, of course, we were out of town last week, but for a number of weeks now, we've gone through very slowly, systematically through Luke chapter number 11 and cutting our message time, making it more abbreviated so that we can spend more time in prayer. And I am certainly thankful for the passage and for the request of the disciple when the disciple said, Lord, teach us to pray. And what a great request. And I'm so thankful that our God graciously answered, provided response. Of course, the Lord Jesus Christ is going to reply to the disciples. And he says to them, plural, when you pray, verse number two, say, our father, which art in heaven, hallowed be thy name, thy kingdom come, thy will be done as in heaven, so in earth. And we've looked at verse one and two in the previous lessons. And as we've examined this passage, we understood that Jesus is providing framework for prayer. This model prayer that we find here in Luke chapter 11, also in the book of Matthew, we find that it was not intended to be memorized and just simply repeated. In fact, for some of you at some point in your life, you probably memorized this prayer, and it was probably told to you that it was the Lord's Prayer. I believe that the Lord's Prayer is found in John 17, specifically when you read that passage of scripture. In fact, I remember when I played middle school football at Northwoods Park Middle School in Jacksonville, North Carolina, that before every game, I didn't even go to church, but before every game, we recited the Lord's Prayer. I didn't even know, I had no idea what we were even doing or saying, had no clue. And we're in a public school, and we're all reciting this Lord's Prayer. And the reality is that nowhere in the New Testament do you see this prayer, the model here that is given, do you see it prayed as just being memorized and rehearsed. In fact, the New Testament does provide us with some recorded prayers. Of course, we've made note of Paul's prayer for the believers in Colossians 1, and you read the book of Ephesians, and on two occasions, Paul shares with them how he's praying for them specifically. And it is nothing like what we find here. Why? Because this is a model prayer. It is not to just be memorized and repeated. We've noted, as we looked at this passage of scripture, that it says when you pray, not if you pray, but when you pray. And the reality is that prayer is a unique privilege for the children of God. Because of the fact that we've been born again, adopted in the family of God, we have access to the very throne room of heaven. The Bible says when you pray, say, our Father. We're mindful of that relationship that we have that enables us to have access. Of course, we know that he is the God of the universe, the creator of all things, and you think about the Lord God omnipotent in all that he is, and yet he is our Father. And how precious that is for us to be mindful of as we enter into a sweet season of prayer. We find that, as we looked in our last lesson, that there's an attitude of reverence and an attitude of submission. The Bible says, hallowed be thy name, and we're mindful of our God being holy, and we are to give thanks at the remembrance of his holiness, the psalmist says, and that we just get into the presence of God and stand in awe of who he is. And then we find that the spirit or the attitude of really submission, it is very possible for us, and perhaps if we'd be honest with ourselves and transparent with ourselves this evening, there are times in our lives that we can pinpoint that we have prayed very selfishly. We've prayed about what we want, what our desires are, and maybe we've lacked that attitude of submission. Thy kingdom come, thy will be done in heaven, as in heaven, so on earth. And so we're thankful for the instruction that is given there. We come to verse number three, and the Bible says this, give us day by day our daily bread. Give us day by day our daily bread. As we focus this evening on verse number three, if I were to title the message, I'd simply title it prayer for provision. Prayer for provision. As we look at this thought in verse number three, the reality is that for most of us this evening, we have been abundantly blessed, and we probably did not have to pray for our daily bread today. God has graciously blessed us as we would sit here in the place in which we are, and we could think and very honestly agree with what the psalmist says when he said that he hath daily loadeth me with benefits. God has provided for us, and what a blessing. There are times in my life, there are times in our children's lives that they'll say something like this, we have nothing to eat. And what that means really is that there's nothing in the house that I would like to eat, because there's plenty of things, and you start going through a list of the items that are available, and you find out that they're not hungry. I'm not hungry for those things, and there's something else that we would desire. When we think about this particular statement that is given, again, a model, the framework for prayer as Jesus is giving the instruction to his disciples, I'm mindful as we've looked through here already, and it's noteworthy again in verse number three, to find the way in which he's mentioning the aspect of being plural as opposed to singular when he says, of course, the single disciple asked him, Lord, teach us to pray. It says one of his disciples said, Lord, teach us to pray. And then he says, when ye pray, say, our Father. And you find here in verse number three, again, the inclusiveness, give us day by day our daily bread. No doubt, as we would think about this prayer for provision, I believe that really it has two levels of being able to impact us. Number one, if you're taking notes, I believe that it impacts our perspective. It impacts our perspective. You know, the reality is that for some of us today in the particular area in which we live, and just really with the plenty that God has blessed us with, we may not think day by day about our provision that we need. And we understand that provision here, specifically when he says, our daily bread, speaking about the food provision, but we have need of provision. But when we think about this phrase that is given here, and again, the framework for prayer, I believe that as we would begin to follow the framework that it impacts our perspective in this way, it allows us to have an awareness and recognition that God is indeed our provider. You think about the passage, our Father which art in heaven, and you get to verse number three, give us, who's he praying to? He's praying to the Lord, to God Almighty, give us day by day our daily bread. When we pray that and understand the framework in this prayer for provision, again, not memorizing and just mindlessly repeating, but when we're mindful of this perspective and we have an awareness and a recognition that God is our provider. I think about the children of Israel, and we won't take time to go back there, but if you think about Exodus chapter number 16, where God provides us with a record of the manna that came down from heaven and how God provided for his children, you're mindful of the fact that they would collect that, and if they left it over, it would spoil, it would stink, it would breed worms, and so on and so forth, and they would need to just take their daily allotment, and they would find that God on that next day would provide again. What a great reminder for them. I'm mindful as they would enter into the land of promise in Joshua chapter number five, after they cross over and commemorate the crossing and all that takes place there, you find that the Bible tells us in verse number 12 that the manna ceases, but they ate of the fruit of the land. God was providing for his people, and when we begin to have this mindset and this framework for our prayer, and we're mindful of this prayer for provision, that it would impact my perspective to help me have this understanding, this recognition that God is my provider. I believe that it's also impactful for us to be able to instruct our children, to help them understand that God has graciously provided for us, and the provision that he has given to us. We find that God is aware of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn there, if you'd like you can, in Matthew 6 and verse number 8, we find that the Bible tells us this, be not ye therefore like unto them, speaking of those that were praying, he called them hypocrites and so on and so forth, and he says here, your father knoweth what things ye have need of before ye ask him. I made the statement to someone actually today, and I said to the individual, I said, you know, the reality is that prayer, sometimes when we think about prayer, not only is it moving the hand of God, but prayer helps my own perspective. We're going to think about God and his provision for us, and the fact that he is the provider. You say, no, I go to work and I provide for my family. I understand that you're supposed to provide for your family. In fact, the New Testament speaks about those that would not provide for their family. They're worse than an infidel, but the reality is that we understand that it's God who's given us the ability, and so ultimately God is the provider. Notice what the book of Deuteronomy tells us with regard to this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember, in this portion of the book of Deuteronomy, you would find that God is preparing his children for entrance into the land, and remember in chapter number 6, he says when you come into a land that's full of all of these things, and you have houses that you didn't build, and you have vineyards that you didn't plant, and you have all of these things, beware lest thou forget the Lord. We find that Deuteronomy 8 and verse number 18 says this, but thou shalt remember the Lord thy God, for it is he that giveth thee power to get wealth, that he may establish his covenant which he swear unto thy fathers as it is this day. Everything comes from God. He may have given you employment somewhere, and he may use that source of employment to provide for your needs, but you understand that he is the provider. We begin to think about this prayer for provision and how it would impact my perspective, and it would help me to be mindful of who he is and how he provides. Remember, he's the shepherd. Psalm 23, a precious passage of scripture, the Lord is my shepherd, I shall not want. Why? Because what does a good shepherd do? A good shepherd leads his sheep into the green pasture, a good shepherd leads his sheep into the green pastures, right? A good shepherd takes care of his sheep, and guess what? Our God is a good shepherd. He is the good shepherd. He's the great shepherd, and I'm so thankful that he's my shepherd. And we think about this perspective with this framework of prayers as mentioned in Luke chapter number 11, and the reality is just like the children of Israel, you know, the fact of the matter is that we can get very comfortable with things in life and forget some things, as was the warning in Deuteronomy chapter number six. And so this framework, this model that the Lord is providing to the disciples, and of course preserved for us this evening, helps us in our perspective. Not only does it help us in our perspective and I think impact our perspective, but another thought this evening is that it will impact our praise. Many of us, no doubt, when we would sit down to have a meal, we will pray and thank God for the meal that is before us. And sometimes, if we're not careful, it can almost just become a routine kind of thing, almost a memorized prayer. We just kind of, oh we're going to pray, we're going to pray for the food, but I wonder if we have really prayed and recognized, be aware of the fact that God is our provider, that when we sit down and we have that meal that is before us, how it would really impact our praise. Understand that God has provided for us and He's provided abundantly before us. And I understand that as we're sitting here in one of the wealthiest counties in all of America, right, one of the wealthiest nations in all of the world, that sometimes it's hard for us to really kind of relate to this sort of thing, but even in our position and how the Lord has blessed us, we're mindful that it's the Lord that has blessed us and it should impact our praise. See, I believe this evening that as we pray for His provision, that we'll be mindful to praise Him for that provision. I believe this evening that it is very easy for us, and I believe it's a very dangerous position to be in, it's very easy for us to take God's provision for granted. Just take it for granted. And just, you know, we really, in a lot of ways, we do that in a lot of areas of life. Most times we walk in and we turn lights on in a building and we probably don't even think about the electricity, the whatever, it just comes on and we just take it for granted that it's going to come on, until you turn on that switch and it doesn't come on. And then all of a sudden, man, what's going on? I can't believe, right, and this is going to ruin my day and I'm not going to be on time and whatever, right? But the reality is that we just, as human beings, sometimes we can take things for granted. And that's what the danger was for the children of Israel when they would enter into the land of promise. And I think the reality is that for us this evening, when we think about this truth and this framework in which the Lord gives and answers the disciple and teaches the disciples, He's helping them to understand that when we have this model and this framework, that it will help us to be mindful of the fact that He is our provider, which will lead us to praising Him. And I mean truly thanking Him for His provision and not just going through the, oh yeah, we're going to pray before we eat and keep it short, if you would, because the meal's hot, we're hungry. No, no, that we would truly be appreciative of what God has provided for us. And the truth, turn over to Psalm 37, if you will. And when you look at Psalm 37 and the testimony that's here, I know that many of us are familiar with this portion of Scripture and the psalm of David and what powerful truth is contained. It's obviously nowhere near the longest psalm, but it is a lengthy psalm. And here we find that David gives testimony. And I am thankful for what he says in verse number 25 of Psalm 37. And I believe how it relates to our study this evening with this thought from Luke 11 in verse number 3. It says, I have been young and now am old, yet have I not seen the righteous forsaken nor his seed begging bread. Sometimes I think in the Christian life, if we're not careful, things can just become very methodical, if you will. And I think there's a danger here, specifically with regard to the subject matter of prayer. We just kind of get into this methodical kind of thing of prayer. And one of the reasons why I've chosen to go so slowly through this passage in Luke chapter number 11 is not only for my own good, but I hope to be a blessing to you as well, is for us to really just be mindful of when we enter into a season of prayer, that we're praying to the Lord God Almighty, and that He is the creator and sustainer of all things, and that we have access because of this relationship that we have with Him. Begin to think about this prayer of provision, that we do not take things for granted. See, when you're praying for your provision, when you're mindful of—see, the Bible talks about wealth making wings and flying away. The reality is that there are some people that we could look at historically that seem to have plenty, and in just a short turn of events, things can change in a hurry. And we think about this prayer of provision, and it reminds us that our God is our provider. He's our provider. And we ought to praise Him. We ought to thank Him. You know, we go, and we—most times we go to the grocery store, and maybe we just have a list. Maybe it's a shared list, whatever it might be, and you just go through the grocery store, and you just purchase the items that are on your list, and maybe not even given a whole lot of thought to it. A number of years ago, Holly and I had the opportunity. In fact, it was—it's coming up on being five years ago. We were down in Florida for our 15th wedding anniversary, and in August, we'll celebrate 20 years. And so, it was just about five years ago, and we were down in Orlando for just a couple of days, just her and I, and just enjoying some time away. And we drove over to Hope Children's Home in Tampa. And as we drove over there to Hope Children's Home, we had the privilege of being able to take a tour and go through the facility. And I don't remember the fellow's name that took us on the tour. We had the privilege of seeing Brother Higgins and his wife and what have you. But as we went on that tour, we'd go through these rooms and see where they would, of course, have their activities and that sort of thing, go through the school. As we'd go into the kitchen areas, you would see in the dining hall and what have you, there'd be a board, and it was kind of a wish list, and some items would be on that thing of things they were praying for. And I remember going through and seeing in each of those rooms and asking the fellow that was giving us a tour about the items that were listed on this board. And one of them in particular, I remember probably because of a conversation I had with my niece today, it was bacon. And I said, bacon's on all of these boards everywhere I go. And Adeline told me today that her favorite vegetable is bacon. And I said, she has some things to learn in life. I mean, you're on a good track, but I mean, you know, but they were all praying for bacon, I inquired. And he said, we haven't had bacon a long time, and we're praying for bacon. And I just thought about that for a moment. And here's, just honestly, here's what I thought. If I want bacon, we go to the store and buy it. Honestly, I've never prayed for bacon. I just haven't. But I was so impressed with going through there and seeing that. And there were a number of other things on the list. And when we got done the tour, there's a Walmart just, I don't know, a mile or so up the road. And Holly and I drove up to the Walmart and got a whole bunch, two carts full of groceries to take back. And we put a whole lot of bacon in the cart. Because we just want it to be a blessing. Because those kids, and I thought about the lesson that those kids were learning, and the way in which they were seeing how God would work and how God would answer. And this evening, we think about the framework, and we think about the, listen, God's been good to us. He really has. But we need to recognize that it's God who has been good to us. And He's provided for us. He is our provider. We need to praise Him accordingly. And again, for many of us, I know I've said years, I've said this over the years, and it's been a while probably since I've said it, but most of us do not have to pray for our daily bread. We really don't. Because God's blessed us. But when we understand the framework by which God has given us here, we pray for God's continued provision for our families, for our lives, for one another. And then we praise Him for His provision. Every day of my life, I pray and I thank God for a number of things. But as I think about God being my shepherd, I thank Him for His provision, His protection, and His presence. Every day. And I try to instruct and instill in our children, God has provided for us. We have a good God. And as we think about the framework of this passage of scripture, such a simple thought, but I hope that it would impact our perspective, that we'd be more aware of and recognize that God is our provider, and that we would praise Him accordingly. It's so easy to take things for granted. It's so easy to just be comfortable, increased with goods, as the church of the Laodiceans in Revelation 3. We have a good God. Prayer for provision. Let's pray. Father, we love You. We thank You so much for loving us. We do thank You for Your provision. We thank You for just, Lord, as we look at our lives and see Your hand. God, we just want to thank You this evening and praise You. Lord, we know that there are brothers and sisters in other parts of this nation, other parts of the world, that do not have the same level of provision that we may enjoy and experience. God, we rejoice in how You take care of them as well. The testimony of David in Psalm 37 and verse 25. Father, I pray this evening that You would help us to be mindful, regularly mindful, of the truth that You are our provider and that we would praise You accordingly. We do pray that You'd bless our time of prayer. We thank You for the privilege. I pray that You would move mightily and we'll thank You for it. In Christ's name we pray. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.360000133514404,
      "text": " And on Wednesday evenings here for a few weeks, of course, we were out of town last week,"
    },
    {
      "id": 1,
      "start": 5.360000133514404,
      "end": 11.279999732971191,
      "text": " but for a number of weeks now, we've gone through very slowly, systematically through Luke chapter"
    },
    {
      "id": 2,
      "start": 11.279999732971191,
      "end": 18.399999618530273,
      "text": " number 11 and cutting our message time, making it more abbreviated so that we can spend more time"
    },
    {
      "id": 3,
      "start": 18.399999618530273,
      "end": 26.0,
      "text": " in prayer. And I am certainly thankful for the passage and for the request of the disciple when"
    },
    {
      "id": 4,
      "start": 26.0,
      "end": 33.599998474121094,
      "text": " the disciple said, Lord, teach us to pray. And what a great request. And I'm so thankful that"
    },
    {
      "id": 5,
      "start": 33.599998474121094,
      "end": 40.47999954223633,
      "text": " our God graciously answered, provided response. Of course, the Lord Jesus Christ is going to"
    },
    {
      "id": 6,
      "start": 40.47999954223633,
      "end": 46.720001220703125,
      "text": " reply to the disciples. And he says to them, plural, when you pray, verse number two, say,"
    },
    {
      "id": 7,
      "start": 47.7599983215332,
      "end": 53.279998779296875,
      "text": " our father, which art in heaven, hallowed be thy name, thy kingdom come, thy will be done as in"
    },
    {
      "id": 8,
      "start": 53.279998779296875,
      "end": 58.15999984741211,
      "text": " heaven, so in earth. And we've looked at verse one and two in the previous lessons. And as we've"
    },
    {
      "id": 9,
      "start": 58.15999984741211,
      "end": 64.87999725341797,
      "text": " examined this passage, we understood that Jesus is providing framework for prayer. This model"
    },
    {
      "id": 10,
      "start": 64.87999725341797,
      "end": 69.5999984741211,
      "text": " prayer that we find here in Luke chapter 11, also in the book of Matthew, we find that it was not"
    },
    {
      "id": 11,
      "start": 69.5999984741211,
      "end": 74.87999725341797,
      "text": " intended to be memorized and just simply repeated. In fact, for some of you at some point in your"
    },
    {
      "id": 12,
      "start": 74.87999725341797,
      "end": 80.08000183105469,
      "text": " life, you probably memorized this prayer, and it was probably told to you that it was the Lord's"
    },
    {
      "id": 13,
      "start": 80.08000183105469,
      "end": 85.5199966430664,
      "text": " Prayer. I believe that the Lord's Prayer is found in John 17, specifically when you read that passage"
    },
    {
      "id": 14,
      "start": 85.5199966430664,
      "end": 91.76000213623047,
      "text": " of scripture. In fact, I remember when I played middle school football at Northwoods Park Middle"
    },
    {
      "id": 15,
      "start": 91.76000213623047,
      "end": 96.80000305175781,
      "text": " School in Jacksonville, North Carolina, that before every game, I didn't even go to church,"
    },
    {
      "id": 16,
      "start": 96.80000305175781,
      "end": 101.68000030517578,
      "text": " but before every game, we recited the Lord's Prayer. I didn't even know, I had no idea what"
    },
    {
      "id": 17,
      "start": 101.68000030517578,
      "end": 106.95999908447266,
      "text": " we were even doing or saying, had no clue. And we're in a public school, and we're all reciting"
    },
    {
      "id": 18,
      "start": 106.95999908447266,
      "end": 114.08000183105469,
      "text": " this Lord's Prayer. And the reality is that nowhere in the New Testament do you see this"
    },
    {
      "id": 19,
      "start": 114.08000183105469,
      "end": 120.23999786376953,
      "text": " prayer, the model here that is given, do you see it prayed as just being memorized and rehearsed."
    },
    {
      "id": 20,
      "start": 120.23999786376953,
      "end": 127.36000061035156,
      "text": " In fact, the New Testament does provide us with some recorded prayers. Of course, we've made note"
    },
    {
      "id": 21,
      "start": 127.36000061035156,
      "end": 132.32000732421875,
      "text": " of Paul's prayer for the believers in Colossians 1, and you read the book of Ephesians,"
    },
    {
      "id": 22,
      "start": 132.32000732421875,
      "end": 136.8000030517578,
      "text": " and on two occasions, Paul shares with them how he's praying for them specifically."
    },
    {
      "id": 23,
      "start": 136.8000030517578,
      "end": 142.0800018310547,
      "text": " And it is nothing like what we find here. Why? Because this is a model prayer. It is not to just"
    },
    {
      "id": 24,
      "start": 142.0800018310547,
      "end": 147.1199951171875,
      "text": " be memorized and repeated. We've noted, as we looked at this passage of scripture, that it says"
    },
    {
      "id": 25,
      "start": 147.1199951171875,
      "end": 153.1199951171875,
      "text": " when you pray, not if you pray, but when you pray. And the reality is that prayer is a unique"
    },
    {
      "id": 26,
      "start": 153.1199951171875,
      "end": 158.8000030517578,
      "text": " privilege for the children of God. Because of the fact that we've been born again, adopted in the"
    },
    {
      "id": 27,
      "start": 158.8000030517578,
      "end": 164.8800048828125,
      "text": " family of God, we have access to the very throne room of heaven. The Bible says when you pray,"
    },
    {
      "id": 28,
      "start": 164.8800048828125,
      "end": 171.67999267578125,
      "text": " say, our Father. We're mindful of that relationship that we have that enables us to have access. Of"
    },
    {
      "id": 29,
      "start": 171.67999267578125,
      "end": 177.27999877929688,
      "text": " course, we know that he is the God of the universe, the creator of all things, and you think about the"
    },
    {
      "id": 30,
      "start": 177.9199981689453,
      "end": 185.1199951171875,
      "text": " Lord God omnipotent in all that he is, and yet he is our Father. And how precious that is for us to"
    },
    {
      "id": 31,
      "start": 185.1199951171875,
      "end": 192.16000366210938,
      "text": " be mindful of as we enter into a sweet season of prayer. We find that, as we looked in our last"
    },
    {
      "id": 32,
      "start": 192.16000366210938,
      "end": 196.47999572753906,
      "text": " lesson, that there's an attitude of reverence and an attitude of submission. The Bible says,"
    },
    {
      "id": 33,
      "start": 196.47999572753906,
      "end": 202.24000549316406,
      "text": " hallowed be thy name, and we're mindful of our God being holy, and we are to give thanks at the"
    },
    {
      "id": 34,
      "start": 202.24000549316406,
      "end": 208.0800018310547,
      "text": " remembrance of his holiness, the psalmist says, and that we just get into the presence of God and"
    },
    {
      "id": 35,
      "start": 208.0800018310547,
      "end": 215.36000061035156,
      "text": " stand in awe of who he is. And then we find that the spirit or the attitude of really submission,"
    },
    {
      "id": 36,
      "start": 216.16000366210938,
      "end": 221.27999877929688,
      "text": " it is very possible for us, and perhaps if we'd be honest with ourselves and transparent with"
    },
    {
      "id": 37,
      "start": 221.27999877929688,
      "end": 225.83999633789062,
      "text": " ourselves this evening, there are times in our lives that we can pinpoint that we have prayed"
    },
    {
      "id": 38,
      "start": 226.55999755859375,
      "end": 232.24000549316406,
      "text": " very selfishly. We've prayed about what we want, what our desires are, and maybe we've"
    },
    {
      "id": 39,
      "start": 232.24000549316406,
      "end": 239.1999969482422,
      "text": " lacked that attitude of submission. Thy kingdom come, thy will be done in heaven, as in heaven,"
    },
    {
      "id": 40,
      "start": 239.1999969482422,
      "end": 243.67999267578125,
      "text": " so on earth. And so we're thankful for the instruction that is given there. We come to"
    },
    {
      "id": 41,
      "start": 243.67999267578125,
      "end": 252.63999938964844,
      "text": " verse number three, and the Bible says this, give us day by day our daily bread. Give us day by day"
    },
    {
      "id": 42,
      "start": 253.27999877929688,
      "end": 258.4800109863281,
      "text": " our daily bread. As we focus this evening on verse number three, if I were to title the message,"
    },
    {
      "id": 43,
      "start": 258.4800109863281,
      "end": 265.5199890136719,
      "text": " I'd simply title it prayer for provision. Prayer for provision. As we look at this thought in verse"
    },
    {
      "id": 44,
      "start": 265.5199890136719,
      "end": 272.4800109863281,
      "text": " number three, the reality is that for most of us this evening, we have been abundantly blessed,"
    },
    {
      "id": 45,
      "start": 272.4800109863281,
      "end": 280.1600036621094,
      "text": " and we probably did not have to pray for our daily bread today. God has graciously blessed us as we"
    },
    {
      "id": 46,
      "start": 280.1600036621094,
      "end": 286.6400146484375,
      "text": " would sit here in the place in which we are, and we could think and very honestly agree with what"
    },
    {
      "id": 47,
      "start": 286.6400146484375,
      "end": 292.55999755859375,
      "text": " the psalmist says when he said that he hath daily loadeth me with benefits. God has provided for us,"
    },
    {
      "id": 48,
      "start": 292.55999755859375,
      "end": 298.32000732421875,
      "text": " and what a blessing. There are times in my life, there are times in our children's lives that"
    },
    {
      "id": 49,
      "start": 298.32000732421875,
      "end": 303.67999267578125,
      "text": " they'll say something like this, we have nothing to eat. And what that means really is that there's"
    },
    {
      "id": 50,
      "start": 303.67999267578125,
      "end": 308.55999755859375,
      "text": " nothing in the house that I would like to eat, because there's plenty of things, and you start"
    },
    {
      "id": 51,
      "start": 308.55999755859375,
      "end": 312.79998779296875,
      "text": " going through a list of the items that are available, and you find out that they're not"
    },
    {
      "id": 52,
      "start": 312.79998779296875,
      "end": 318.3999938964844,
      "text": " hungry. I'm not hungry for those things, and there's something else that we would desire."
    },
    {
      "id": 53,
      "start": 318.3999938964844,
      "end": 323.2799987792969,
      "text": " When we think about this particular statement that is given, again, a model, the framework for"
    },
    {
      "id": 54,
      "start": 323.2799987792969,
      "end": 329.20001220703125,
      "text": " prayer as Jesus is giving the instruction to his disciples, I'm mindful as we've looked through"
    },
    {
      "id": 55,
      "start": 329.20001220703125,
      "end": 334.239990234375,
      "text": " here already, and it's noteworthy again in verse number three, to find the way in which he's"
    },
    {
      "id": 56,
      "start": 334.239990234375,
      "end": 340.0799865722656,
      "text": " mentioning the aspect of being plural as opposed to singular when he says, of course, the single"
    },
    {
      "id": 57,
      "start": 340.0799865722656,
      "end": 347.2799987792969,
      "text": " disciple asked him, Lord, teach us to pray. It says one of his disciples said, Lord, teach us to pray."
    },
    {
      "id": 58,
      "start": 347.2799987792969,
      "end": 352.3999938964844,
      "text": " And then he says, when ye pray, say, our Father. And you find here in verse number three, again,"
    },
    {
      "id": 59,
      "start": 352.3999938964844,
      "end": 361.1199951171875,
      "text": " the inclusiveness, give us day by day our daily bread. No doubt, as we would think about this"
    },
    {
      "id": 60,
      "start": 361.1199951171875,
      "end": 367.9200134277344,
      "text": " prayer for provision, I believe that really it has two levels of being able to impact us. Number one,"
    },
    {
      "id": 61,
      "start": 367.9200134277344,
      "end": 373.9200134277344,
      "text": " if you're taking notes, I believe that it impacts our perspective. It impacts our perspective."
    },
    {
      "id": 62,
      "start": 373.9200134277344,
      "end": 378.79998779296875,
      "text": " You know, the reality is that for some of us today in the particular area in which we live,"
    },
    {
      "id": 63,
      "start": 378.79998779296875,
      "end": 384.0,
      "text": " and just really with the plenty that God has blessed us with, we may not think day by day"
    },
    {
      "id": 64,
      "start": 384.0,
      "end": 388.79998779296875,
      "text": " about our provision that we need. And we understand that provision here, specifically when he says,"
    },
    {
      "id": 65,
      "start": 388.79998779296875,
      "end": 394.7200012207031,
      "text": " our daily bread, speaking about the food provision, but we have need of provision."
    },
    {
      "id": 66,
      "start": 394.7200012207031,
      "end": 400.3999938964844,
      "text": " But when we think about this phrase that is given here, and again, the framework for prayer,"
    },
    {
      "id": 67,
      "start": 400.3999938964844,
      "end": 405.6000061035156,
      "text": " I believe that as we would begin to follow the framework that it impacts our perspective in this"
    },
    {
      "id": 68,
      "start": 405.6000061035156,
      "end": 413.0400085449219,
      "text": " way, it allows us to have an awareness and recognition that God is indeed our provider."
    },
    {
      "id": 69,
      "start": 413.67999267578125,
      "end": 419.6000061035156,
      "text": " You think about the passage, our Father which art in heaven, and you get to verse number three,"
    },
    {
      "id": 70,
      "start": 419.6000061035156,
      "end": 427.2799987792969,
      "text": " give us, who's he praying to? He's praying to the Lord, to God Almighty, give us day by day"
    },
    {
      "id": 71,
      "start": 427.9200134277344,
      "end": 433.0400085449219,
      "text": " our daily bread. When we pray that and understand the framework in this prayer for provision,"
    },
    {
      "id": 72,
      "start": 433.0400085449219,
      "end": 438.79998779296875,
      "text": " again, not memorizing and just mindlessly repeating, but when we're mindful of this"
    },
    {
      "id": 73,
      "start": 438.79998779296875,
      "end": 444.55999755859375,
      "text": " perspective and we have an awareness and a recognition that God is our provider."
    },
    {
      "id": 74,
      "start": 445.5199890136719,
      "end": 449.2799987792969,
      "text": " I think about the children of Israel, and we won't take time to go back there, but if you"
    },
    {
      "id": 75,
      "start": 449.2799987792969,
      "end": 454.7200012207031,
      "text": " think about Exodus chapter number 16, where God provides us with a record of the manna that came"
    },
    {
      "id": 76,
      "start": 454.7200012207031,
      "end": 461.6000061035156,
      "text": " down from heaven and how God provided for his children, you're mindful of the fact that they"
    },
    {
      "id": 77,
      "start": 461.6000061035156,
      "end": 467.6000061035156,
      "text": " would collect that, and if they left it over, it would spoil, it would stink, it would breed worms,"
    },
    {
      "id": 78,
      "start": 467.6000061035156,
      "end": 473.67999267578125,
      "text": " and so on and so forth, and they would need to just take their daily allotment, and they would"
    },
    {
      "id": 79,
      "start": 473.67999267578125,
      "end": 480.1600036621094,
      "text": " find that God on that next day would provide again. What a great reminder for them. I'm mindful"
    },
    {
      "id": 80,
      "start": 480.1600036621094,
      "end": 485.760009765625,
      "text": " as they would enter into the land of promise in Joshua chapter number five, after they cross over"
    },
    {
      "id": 81,
      "start": 485.760009765625,
      "end": 491.44000244140625,
      "text": " and commemorate the crossing and all that takes place there, you find that the Bible tells us"
    },
    {
      "id": 82,
      "start": 491.44000244140625,
      "end": 497.9200134277344,
      "text": " in verse number 12 that the manna ceases, but they ate of the fruit of the land. God was providing"
    },
    {
      "id": 83,
      "start": 498.0,
      "end": 504.9599914550781,
      "text": " for his people, and when we begin to have this mindset and this framework for our prayer,"
    },
    {
      "id": 84,
      "start": 505.5199890136719,
      "end": 511.1199951171875,
      "text": " and we're mindful of this prayer for provision, that it would impact my perspective to help me"
    },
    {
      "id": 85,
      "start": 511.1199951171875,
      "end": 518.4000244140625,
      "text": " have this understanding, this recognition that God is my provider. I believe that it's also"
    },
    {
      "id": 86,
      "start": 518.4000244140625,
      "end": 525.9199829101562,
      "text": " impactful for us to be able to instruct our children, to help them understand that God has"
    },
    {
      "id": 87,
      "start": 525.9199829101562,
      "end": 532.6400146484375,
      "text": " graciously provided for us, and the provision that he has given to us. We find that God is aware"
    },
    {
      "id": 88,
      "start": 532.6400146484375,
      "end": 537.52001953125,
      "text": " of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn"
    },
    {
      "id": 89,
      "start": 537.52001953125,
      "end": 542.7999877929688,
      "text": " there, if you'd like you can, in Matthew 6 and verse number 8, we find that the Bible tells us"
    },
    {
      "id": 90,
      "start": 542.7999877929688,
      "end": 548.719970703125,
      "text": " this, be not ye therefore like unto them, speaking of those that were praying, he called them"
    },
    {
      "id": 91,
      "start": 548.719970703125,
      "end": 556.4000244140625,
      "text": " hypocrites and so on and so forth, and he says here, your father knoweth what things ye have"
    },
    {
      "id": 92,
      "start": 556.4000244140625,
      "end": 562.9600219726562,
      "text": " need of before ye ask him. I made the statement to someone actually today, and I said to the"
    },
    {
      "id": 93,
      "start": 562.9600219726562,
      "end": 567.760009765625,
      "text": " individual, I said, you know, the reality is that prayer, sometimes when we think about prayer, not"
    },
    {
      "id": 94,
      "start": 567.760009765625,
      "end": 575.0399780273438,
      "text": " only is it moving the hand of God, but prayer helps my own perspective. We're going to think about God"
    },
    {
      "id": 95,
      "start": 575.0399780273438,
      "end": 581.280029296875,
      "text": " and his provision for us, and the fact that he is the provider. You say, no, I go to work and I"
    },
    {
      "id": 96,
      "start": 581.280029296875,
      "end": 586.0800170898438,
      "text": " provide for my family. I understand that you're supposed to provide for your family. In fact,"
    },
    {
      "id": 97,
      "start": 586.6400146484375,
      "end": 590.4000244140625,
      "text": " the New Testament speaks about those that would not provide for their family. They're worse than"
    },
    {
      "id": 98,
      "start": 590.4000244140625,
      "end": 596.3200073242188,
      "text": " an infidel, but the reality is that we understand that it's God who's given us the ability,"
    },
    {
      "id": 99,
      "start": 596.3200073242188,
      "end": 602.239990234375,
      "text": " and so ultimately God is the provider. Notice what the book of Deuteronomy tells us with regard to"
    },
    {
      "id": 100,
      "start": 602.239990234375,
      "end": 607.52001953125,
      "text": " this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember,"
    },
    {
      "id": 101,
      "start": 608.239990234375,
      "end": 615.0399780273438,
      "text": " in this portion of the book of Deuteronomy, you would find that God is preparing his children for"
    },
    {
      "id": 102,
      "start": 615.0399780273438,
      "end": 619.52001953125,
      "text": " entrance into the land, and remember in chapter number 6, he says when you come into a land that's"
    },
    {
      "id": 103,
      "start": 619.52001953125,
      "end": 622.8800048828125,
      "text": " full of all of these things, and you have houses that you didn't build, and you have"
    },
    {
      "id": 104,
      "start": 622.8800048828125,
      "end": 628.0800170898438,
      "text": " vineyards that you didn't plant, and you have all of these things, beware lest thou forget the Lord."
    },
    {
      "id": 105,
      "start": 629.0399780273438,
      "end": 635.4400024414062,
      "text": " We find that Deuteronomy 8 and verse number 18 says this, but thou shalt remember the Lord thy God,"
    },
    {
      "id": 106,
      "start": 636.0,
      "end": 644.1599731445312,
      "text": " for it is he that giveth thee power to get wealth, that he may establish his covenant which he swear"
    },
    {
      "id": 107,
      "start": 644.1599731445312,
      "end": 650.6400146484375,
      "text": " unto thy fathers as it is this day. Everything comes from God. He may have given you employment"
    },
    {
      "id": 108,
      "start": 650.6400146484375,
      "end": 656.4000244140625,
      "text": " somewhere, and he may use that source of employment to provide for your needs, but you understand that"
    },
    {
      "id": 109,
      "start": 656.4000244140625,
      "end": 662.47998046875,
      "text": " he is the provider. We begin to think about this prayer for provision and how it would impact my"
    },
    {
      "id": 110,
      "start": 662.47998046875,
      "end": 669.4400024414062,
      "text": " perspective, and it would help me to be mindful of who he is and how he provides. Remember, he's the"
    },
    {
      "id": 111,
      "start": 669.4400024414062,
      "end": 679.4400024414062,
      "text": " shepherd. Psalm 23, a precious passage of scripture, the Lord is my shepherd, I shall not want. Why?"
    },
    {
      "id": 112,
      "start": 679.4400024414062,
      "end": 683.8400268554688,
      "text": " Because what does a good shepherd do? A good shepherd leads his sheep into the green pasture,"
    },
    {
      "id": 113,
      "start": 683.8400268554688,
      "end": 689.4400024414062,
      "text": " a good shepherd leads his sheep into the green pastures, right? A good shepherd takes care of his"
    },
    {
      "id": 114,
      "start": 689.4400024414062,
      "end": 694.4000244140625,
      "text": " sheep, and guess what? Our God is a good shepherd. He is the good shepherd. He's the great shepherd,"
    },
    {
      "id": 115,
      "start": 694.4000244140625,
      "end": 700.3200073242188,
      "text": " and I'm so thankful that he's my shepherd. And we think about this perspective with this"
    },
    {
      "id": 116,
      "start": 700.3200073242188,
      "end": 706.0800170898438,
      "text": " framework of prayers as mentioned in Luke chapter number 11, and the reality is just like the"
    },
    {
      "id": 117,
      "start": 706.0800170898438,
      "end": 711.6799926757812,
      "text": " children of Israel, you know, the fact of the matter is that we can get very comfortable with"
    },
    {
      "id": 118,
      "start": 711.6799926757812,
      "end": 718.0,
      "text": " things in life and forget some things, as was the warning in Deuteronomy chapter number six."
    },
    {
      "id": 119,
      "start": 718.0,
      "end": 723.8400268554688,
      "text": " And so this framework, this model that the Lord is providing to the disciples, and of course"
    },
    {
      "id": 120,
      "start": 723.8400268554688,
      "end": 728.47998046875,
      "text": " preserved for us this evening, helps us in our perspective. Not only does it help us in our"
    },
    {
      "id": 121,
      "start": 728.47998046875,
      "end": 732.8800048828125,
      "text": " perspective and I think impact our perspective, but another thought this evening is that it will"
    },
    {
      "id": 122,
      "start": 732.8800048828125,
      "end": 740.6400146484375,
      "text": " impact our praise. Many of us, no doubt, when we would sit down to have a meal, we will pray and"
    },
    {
      "id": 123,
      "start": 740.6400146484375,
      "end": 747.3599853515625,
      "text": " thank God for the meal that is before us. And sometimes, if we're not careful, it can almost"
    },
    {
      "id": 124,
      "start": 747.3599853515625,
      "end": 754.239990234375,
      "text": " just become a routine kind of thing, almost a memorized prayer. We just kind of, oh we're going"
    },
    {
      "id": 125,
      "start": 754.239990234375,
      "end": 760.9600219726562,
      "text": " to pray, we're going to pray for the food, but I wonder if we have really prayed and recognized,"
    },
    {
      "id": 126,
      "start": 761.760009765625,
      "end": 767.2000122070312,
      "text": " be aware of the fact that God is our provider, that when we sit down and we have that meal that"
    },
    {
      "id": 127,
      "start": 767.2000122070312,
      "end": 772.47998046875,
      "text": " is before us, how it would really impact our praise. Understand that God has provided for us"
    },
    {
      "id": 128,
      "start": 773.2000122070312,
      "end": 777.52001953125,
      "text": " and He's provided abundantly before us. And I understand that as we're sitting here in one of"
    },
    {
      "id": 129,
      "start": 777.52001953125,
      "end": 783.280029296875,
      "text": " the wealthiest counties in all of America, right, one of the wealthiest nations in all of the world,"
    },
    {
      "id": 130,
      "start": 783.280029296875,
      "end": 788.8800048828125,
      "text": " that sometimes it's hard for us to really kind of relate to this sort of thing, but even in our"
    },
    {
      "id": 131,
      "start": 788.8800048828125,
      "end": 794.6400146484375,
      "text": " position and how the Lord has blessed us, we're mindful that it's the Lord that has blessed us"
    },
    {
      "id": 132,
      "start": 795.52001953125,
      "end": 800.9600219726562,
      "text": " and it should impact our praise. See, I believe this evening that as we pray for His provision,"
    },
    {
      "id": 133,
      "start": 800.9600219726562,
      "end": 808.4000244140625,
      "text": " that we'll be mindful to praise Him for that provision. I believe this evening that it is"
    },
    {
      "id": 134,
      "start": 808.4000244140625,
      "end": 813.4400024414062,
      "text": " very easy for us, and I believe it's a very dangerous position to be in, it's very easy"
    },
    {
      "id": 135,
      "start": 813.4400024414062,
      "end": 820.5599975585938,
      "text": " for us to take God's provision for granted. Just take it for granted. And just, you know,"
    },
    {
      "id": 136,
      "start": 821.2000122070312,
      "end": 827.9199829101562,
      "text": " we really, in a lot of ways, we do that in a lot of areas of life. Most times we walk in and we"
    },
    {
      "id": 137,
      "start": 827.9199829101562,
      "end": 834.719970703125,
      "text": " turn lights on in a building and we probably don't even think about the electricity, the whatever,"
    },
    {
      "id": 138,
      "start": 834.719970703125,
      "end": 838.8800048828125,
      "text": " it just comes on and we just take it for granted that it's going to come on, until you turn on"
    },
    {
      "id": 139,
      "start": 838.8800048828125,
      "end": 843.5999755859375,
      "text": " that switch and it doesn't come on. And then all of a sudden, man, what's going on? I can't believe,"
    },
    {
      "id": 140,
      "start": 843.5999755859375,
      "end": 847.2000122070312,
      "text": " right, and this is going to ruin my day and I'm not going to be on time and whatever, right?"
    },
    {
      "id": 141,
      "start": 847.2000122070312,
      "end": 851.5999755859375,
      "text": " But the reality is that we just, as human beings, sometimes we can take things for granted."
    },
    {
      "id": 142,
      "start": 851.5999755859375,
      "end": 855.2000122070312,
      "text": " And that's what the danger was for the children of Israel when they would enter into the land of"
    },
    {
      "id": 143,
      "start": 855.2000122070312,
      "end": 861.2000122070312,
      "text": " promise. And I think the reality is that for us this evening, when we think about this truth and"
    },
    {
      "id": 144,
      "start": 861.2000122070312,
      "end": 867.0399780273438,
      "text": " this framework in which the Lord gives and answers the disciple and teaches the disciples, He's"
    },
    {
      "id": 145,
      "start": 867.0399780273438,
      "end": 875.0399780273438,
      "text": " helping them to understand that when we have this model and this framework, that it will help us to"
    },
    {
      "id": 146,
      "start": 875.0399780273438,
      "end": 881.6799926757812,
      "text": " be mindful of the fact that He is our provider, which will lead us to praising Him. And I mean"
    },
    {
      "id": 147,
      "start": 881.6799926757812,
      "end": 888.47998046875,
      "text": " truly thanking Him for His provision and not just going through the, oh yeah, we're going to pray"
    },
    {
      "id": 148,
      "start": 888.47998046875,
      "end": 894.3200073242188,
      "text": " before we eat and keep it short, if you would, because the meal's hot, we're hungry. No, no,"
    },
    {
      "id": 149,
      "start": 894.3200073242188,
      "end": 901.9199829101562,
      "text": " that we would truly be appreciative of what God has provided for us. And the truth, turn over to"
    },
    {
      "id": 150,
      "start": 901.9199829101562,
      "end": 908.3200073242188,
      "text": " Psalm 37, if you will. And when you look at Psalm 37 and the testimony that's here, I know that many"
    },
    {
      "id": 151,
      "start": 908.3200073242188,
      "end": 914.0,
      "text": " of us are familiar with this portion of Scripture and the psalm of David and what powerful truth is"
    },
    {
      "id": 152,
      "start": 914.0,
      "end": 920.3200073242188,
      "text": " contained. It's obviously nowhere near the longest psalm, but it is a lengthy psalm. And here we find"
    },
    {
      "id": 153,
      "start": 920.3200073242188,
      "end": 928.47998046875,
      "text": " that David gives testimony. And I am thankful for what he says in verse number 25 of Psalm 37."
    },
    {
      "id": 154,
      "start": 928.47998046875,
      "end": 933.0399780273438,
      "text": " And I believe how it relates to our study this evening with this thought from Luke 11 in verse"
    },
    {
      "id": 155,
      "start": 933.0399780273438,
      "end": 940.719970703125,
      "text": " number 3. It says, I have been young and now am old, yet have I not seen the righteous forsaken"
    },
    {
      "id": 156,
      "start": 941.3599853515625,
      "end": 949.2000122070312,
      "text": " nor his seed begging bread. Sometimes I think in the Christian life, if we're not careful,"
    },
    {
      "id": 157,
      "start": 949.2000122070312,
      "end": 954.719970703125,
      "text": " things can just become very methodical, if you will. And I think there's a danger"
    },
    {
      "id": 158,
      "start": 955.1199951171875,
      "end": 961.4400024414062,
      "text": " here, specifically with regard to the subject matter of prayer. We just kind of get into this"
    },
    {
      "id": 159,
      "start": 961.4400024414062,
      "end": 967.1199951171875,
      "text": " methodical kind of thing of prayer. And one of the reasons why I've chosen to go so slowly through"
    },
    {
      "id": 160,
      "start": 967.1199951171875,
      "end": 972.239990234375,
      "text": " this passage in Luke chapter number 11 is not only for my own good, but I hope to be a blessing to"
    },
    {
      "id": 161,
      "start": 972.239990234375,
      "end": 979.9199829101562,
      "text": " you as well, is for us to really just be mindful of when we enter into a season of prayer, that"
    },
    {
      "id": 162,
      "start": 979.9199829101562,
      "end": 985.760009765625,
      "text": " we're praying to the Lord God Almighty, and that He is the creator and sustainer of all things,"
    },
    {
      "id": 163,
      "start": 985.760009765625,
      "end": 989.280029296875,
      "text": " and that we have access because of this relationship that we have with Him."
    },
    {
      "id": 164,
      "start": 990.1599731445312,
      "end": 994.5599975585938,
      "text": " Begin to think about this prayer of provision, that we do not take things for granted. See,"
    },
    {
      "id": 165,
      "start": 994.5599975585938,
      "end": 999.6799926757812,
      "text": " when you're praying for your provision, when you're mindful of—see, the Bible talks about"
    },
    {
      "id": 166,
      "start": 999.6799926757812,
      "end": 1006.719970703125,
      "text": " wealth making wings and flying away. The reality is that there are some people that we could look"
    },
    {
      "id": 167,
      "start": 1006.719970703125,
      "end": 1014.3200073242188,
      "text": " at historically that seem to have plenty, and in just a short turn of events, things can change in"
    },
    {
      "id": 168,
      "start": 1014.3200073242188,
      "end": 1020.0800170898438,
      "text": " a hurry. And we think about this prayer of provision, and it reminds us that our God is"
    },
    {
      "id": 169,
      "start": 1020.0800170898438,
      "end": 1026.8800048828125,
      "text": " our provider. He's our provider. And we ought to praise Him. We ought to thank Him. You know, we go,"
    },
    {
      "id": 170,
      "start": 1026.8800048828125,
      "end": 1033.760009765625,
      "text": " and we—most times we go to the grocery store, and maybe we just have a list. Maybe it's a"
    },
    {
      "id": 171,
      "start": 1033.760009765625,
      "end": 1038.0799560546875,
      "text": " shared list, whatever it might be, and you just go through the grocery store, and you just purchase"
    },
    {
      "id": 172,
      "start": 1038.0799560546875,
      "end": 1042.4000244140625,
      "text": " the items that are on your list, and maybe not even given a whole lot of thought to it. A number"
    },
    {
      "id": 173,
      "start": 1042.4000244140625,
      "end": 1047.5999755859375,
      "text": " of years ago, Holly and I had the opportunity. In fact, it was—it's coming up on being five years"
    },
    {
      "id": 174,
      "start": 1047.5999755859375,
      "end": 1053.280029296875,
      "text": " ago. We were down in Florida for our 15th wedding anniversary, and in August, we'll celebrate 20"
    },
    {
      "id": 175,
      "start": 1053.280029296875,
      "end": 1058.56005859375,
      "text": " years. And so, it was just about five years ago, and we were down in Orlando for just a couple of"
    },
    {
      "id": 176,
      "start": 1058.56005859375,
      "end": 1065.1199951171875,
      "text": " days, just her and I, and just enjoying some time away. And we drove over to Hope Children's Home"
    },
    {
      "id": 177,
      "start": 1065.1199951171875,
      "end": 1069.3599853515625,
      "text": " in Tampa. And as we drove over there to Hope Children's Home, we had the privilege of being"
    },
    {
      "id": 178,
      "start": 1069.3599853515625,
      "end": 1075.0400390625,
      "text": " able to take a tour and go through the facility. And I don't remember the fellow's name that took"
    },
    {
      "id": 179,
      "start": 1075.0400390625,
      "end": 1079.0400390625,
      "text": " us on the tour. We had the privilege of seeing Brother Higgins and his wife and what have you."
    },
    {
      "id": 180,
      "start": 1079.0400390625,
      "end": 1084.1600341796875,
      "text": " But as we went on that tour, we'd go through these rooms and see where they would, of course, have"
    },
    {
      "id": 181,
      "start": 1084.1600341796875,
      "end": 1088.4000244140625,
      "text": " their activities and that sort of thing, go through the school. As we'd go into the kitchen"
    },
    {
      "id": 182,
      "start": 1088.4000244140625,
      "end": 1092.8800048828125,
      "text": " areas, you would see in the dining hall and what have you, there'd be a board, and it was kind of a"
    },
    {
      "id": 183,
      "start": 1092.8800048828125,
      "end": 1098.3199462890625,
      "text": " wish list, and some items would be on that thing of things they were praying for. And I remember"
    },
    {
      "id": 184,
      "start": 1098.3199462890625,
      "end": 1104.0799560546875,
      "text": " going through and seeing in each of those rooms and asking the fellow that was giving us a tour"
    },
    {
      "id": 185,
      "start": 1104.0799560546875,
      "end": 1109.9200439453125,
      "text": " about the items that were listed on this board. And one of them in particular, I remember probably"
    },
    {
      "id": 186,
      "start": 1109.9200439453125,
      "end": 1115.6800537109375,
      "text": " because of a conversation I had with my niece today, it was bacon. And I said, bacon's on all"
    },
    {
      "id": 187,
      "start": 1115.6800537109375,
      "end": 1121.3599853515625,
      "text": " of these boards everywhere I go. And Adeline told me today that her favorite vegetable is bacon."
    },
    {
      "id": 188,
      "start": 1121.3599853515625,
      "end": 1125.760009765625,
      "text": " And I said, she has some things to learn in life. I mean, you're on a good track, but I mean, you know,"
    },
    {
      "id": 189,
      "start": 1126.800048828125,
      "end": 1131.280029296875,
      "text": " but they were all praying for bacon, I inquired. And he said, we haven't had bacon a long time,"
    },
    {
      "id": 190,
      "start": 1132.0799560546875,
      "end": 1138.9599609375,
      "text": " and we're praying for bacon. And I just thought about that for a moment. And here's, just honestly,"
    },
    {
      "id": 191,
      "start": 1138.9599609375,
      "end": 1147.52001953125,
      "text": " here's what I thought. If I want bacon, we go to the store and buy it. Honestly, I've never prayed"
    },
    {
      "id": 192,
      "start": 1147.52001953125,
      "end": 1155.43994140625,
      "text": " for bacon. I just haven't. But I was so impressed with going through there and seeing that. And"
    },
    {
      "id": 193,
      "start": 1155.43994140625,
      "end": 1160.800048828125,
      "text": " there were a number of other things on the list. And when we got done the tour, there's a Walmart"
    },
    {
      "id": 194,
      "start": 1160.800048828125,
      "end": 1166.6400146484375,
      "text": " just, I don't know, a mile or so up the road. And Holly and I drove up to the Walmart and got a"
    },
    {
      "id": 195,
      "start": 1166.6400146484375,
      "end": 1171.9200439453125,
      "text": " whole bunch, two carts full of groceries to take back. And we put a whole lot of bacon in the cart."
    },
    {
      "id": 196,
      "start": 1173.1199951171875,
      "end": 1178.0799560546875,
      "text": " Because we just want it to be a blessing. Because those kids, and I thought about the lesson that"
    },
    {
      "id": 197,
      "start": 1178.0799560546875,
      "end": 1183.1199951171875,
      "text": " those kids were learning, and the way in which they were seeing how God would work and how God"
    },
    {
      "id": 198,
      "start": 1183.1199951171875,
      "end": 1188.6400146484375,
      "text": " would answer. And this evening, we think about the framework, and we think about the, listen,"
    },
    {
      "id": 199,
      "start": 1188.6400146484375,
      "end": 1195.52001953125,
      "text": " God's been good to us. He really has. But we need to recognize that it's God who has been good to us."
    },
    {
      "id": 200,
      "start": 1196.239990234375,
      "end": 1202.239990234375,
      "text": " And He's provided for us. He is our provider. We need to praise Him accordingly. And again,"
    },
    {
      "id": 201,
      "start": 1202.239990234375,
      "end": 1207.760009765625,
      "text": " for many of us, I know I've said years, I've said this over the years, and it's been a while"
    },
    {
      "id": 202,
      "start": 1207.760009765625,
      "end": 1214.1600341796875,
      "text": " probably since I've said it, but most of us do not have to pray for our daily bread. We really don't."
    },
    {
      "id": 203,
      "start": 1215.5999755859375,
      "end": 1222.8800048828125,
      "text": " Because God's blessed us. But when we understand the framework by which God has given us here,"
    },
    {
      "id": 204,
      "start": 1222.8800048828125,
      "end": 1228.47998046875,
      "text": " we pray for God's continued provision for our families, for our lives, for one another. And"
    },
    {
      "id": 205,
      "start": 1228.47998046875,
      "end": 1234.0799560546875,
      "text": " then we praise Him for His provision. Every day of my life, I pray and I thank God for"
    },
    {
      "id": 206,
      "start": 1234.0799560546875,
      "end": 1239.199951171875,
      "text": " a number of things. But as I think about God being my shepherd, I thank Him for"
    },
    {
      "id": 207,
      "start": 1241.199951171875,
      "end": 1249.1199951171875,
      "text": " His provision, His protection, and His presence. Every day. And I try to instruct and instill in"
    },
    {
      "id": 208,
      "start": 1249.1199951171875,
      "end": 1256.1600341796875,
      "text": " our children, God has provided for us. We have a good God. And as we think about the framework of"
    },
    {
      "id": 209,
      "start": 1256.1600341796875,
      "end": 1261.3599853515625,
      "text": " this passage of scripture, such a simple thought, but I hope that it would impact our perspective,"
    },
    {
      "id": 210,
      "start": 1261.3599853515625,
      "end": 1267.6800537109375,
      "text": " that we'd be more aware of and recognize that God is our provider, and that we would praise"
    },
    {
      "id": 211,
      "start": 1267.6800537109375,
      "end": 1274.3199462890625,
      "text": " Him accordingly. It's so easy to take things for granted. It's so easy to just be comfortable,"
    },
    {
      "id": 212,
      "start": 1274.9599609375,
      "end": 1281.43994140625,
      "text": " increased with goods, as the church of the Laodiceans in Revelation 3. We have a good God."
    },
    {
      "id": 213,
      "start": 1281.43994140625,
      "end": 1286.1600341796875,
      "text": " Prayer for provision. Let's pray. Father, we love You. We thank You so much for loving us."
    },
    {
      "id": 214,
      "start": 1288.4000244140625,
      "end": 1295.6800537109375,
      "text": " We do thank You for Your provision. We thank You for just, Lord, as we look at our lives and see"
    },
    {
      "id": 215,
      "start": 1295.6800537109375,
      "end": 1304.0799560546875,
      "text": " Your hand. God, we just want to thank You this evening and praise You. Lord, we know that there"
    },
    {
      "id": 216,
      "start": 1304.1600341796875,
      "end": 1310.0799560546875,
      "text": " are brothers and sisters in other parts of this nation, other parts of the world,"
    },
    {
      "id": 217,
      "start": 1311.52001953125,
      "end": 1317.199951171875,
      "text": " that do not have the same level of provision that we may enjoy and experience."
    },
    {
      "id": 218,
      "start": 1318.8800048828125,
      "end": 1325.6800537109375,
      "text": " God, we rejoice in how You take care of them as well. The testimony of David in Psalm 37 and verse"
    },
    {
      "id": 219,
      "start": 1325.6800537109375,
      "end": 1330.4000244140625,
      "text": " 25. Father, I pray this evening that You would help us to be mindful,"
    },
    {
      "id": 220,
      "start": 1332.800048828125,
      "end": 1339.5999755859375,
      "text": " regularly mindful, of the truth that You are our provider and that we would praise You accordingly."
    },
    {
      "id": 221,
      "start": 1340.239990234375,
      "end": 1343.6800537109375,
      "text": " We do pray that You'd bless our time of prayer. We thank You for the privilege."
    },
    {
      "id": 222,
      "start": 1344.4000244140625,
      "end": 1349.280029296875,
      "text": " I pray that You would move mightily and we'll thank You for it. In Christ's name we pray. Amen."
    }
  ],
  "processed_at": "2025-04-17T07:35:17.137718"
}