{
  "video_id": "9aMxxX-X0kc",
  "text": "through 16 this morning, 2 Corinthians chapter 5, verses 14 through 16, and as you're turning there let me remind you that as we've studied in this fifth chapter of the book of 2 Corinthians we've considered up to this point three very important truths. Number one, we dealt with the reality and the certainty of heaven, and what great truth that is as we look at the first eight verses of this chapter and we find that Paul uses the phrase, for we know, we are confident, we have this assurance to be absent from the body is to be present with the Lord and what joy it brings to the heart of every true believer that knows that they've been saved by the blood of Christ, that heaven is your home. And there are many people today that are going around life and they're wondering, they don't know what's going to happen when they die, they're not sure, they know that death is a certainty for all man will die, and we understand that, but the reality is that as believers, those that have been born again, that we have that reason to rejoice because we have the reality and certainty of heaven. We then dealt with verse number nine, and we dealt with the importance of living our lives to please the Lord. After Paul is talking about having that eternal perspective at the end of chapter four and after he's talking about heaven and the certainty of heaven, he then talks about the importance of living that we might please the Lord, wherefore we labor that whether present or absent, we may be accepted of him and how important it is that we live to please our Savior. And then two weeks ago, we had a missionary last week, but two weeks ago, we looked at verses 10 down through verse number 13, and we spoke of the subject of the judgment seat of Christ. And Paul understood that heaven was his home, and he had great confidence and certainty of that truth, but we understand that he spoke about, to the church in Corinth, both in the book of 1 Corinthians and then also here in the book of 2 Corinthians, about that bema seat, that coming day, the judgment seat of the Lord. When we as believers were stand before him, we said, it's not a judgment, what is it not? It's not for our sin, but we understand that our works will be tried of what sort they are and he knows our motives. And we mentioned the importance of being able to receive crowns, not for any acknowledgement or recognition for ourselves, but so that God would receive all glory for he is the one that has saved us and he is the one who enables us and it will all be for his glory. We come to verse 14 this morning and we find that we, as we continue through the text, we're confronted with a truth that begs a question. We're confronted with a truth that begs a question. Notice in verse 14, the Bible says, for the love of Christ constraineth us, because we thus judge that if one died for all, then we're all dead. And that he died for all that they which live should not henceforth live unto themselves, but unto him which died for them and rose again. Wherefore, henceforth, know we no man after the flesh, yea, though we have known Christ after the flesh, yet now henceforth know we him no more. As we look at this passage of Scripture, these three verses, we find that it's a great truth that Jesus died for me and that he rose victoriously. He conquered sin, death, and the grave. There's no doubt in my mind this morning that the truth that Paul mentions in these verses of Scripture would cause him to rejoice greatly, to understand what Christ did on our behalf, to understand that he paid the debt that we owed that we could never pay, how he would rejoice greatly. But we find that as we look at the text, as Paul would reflect upon this wonderful truth, he acknowledges the fact that we should therefore live for Jesus. We should live for Jesus. The title for the message this morning is posed as a question. And I posed it the way that I did on purpose because I want every single one of us to ask ourselves the question, who am I living for? Who am I living for? Initially as I began to write out the title, I began to write it this way, who are you living for? But I thought, you know, I don't want to title it that way because I need to answer the question myself personally, but I need each one of you to answer your question, who am I living for? See, if we ask the question, who are you living for, you know what it does? It gets the attention off of us and on someone else. And by the way, we like it that way. Let a man examine himself, I'd rather examine you than myself, you'd rather examine me than yourself. But we ask the question, who am I living for? Who am I living for? As we look at the text of Scripture this morning, if you're taking notes, number one, there's a conflict that we must acknowledge, a conflict that we must acknowledge. We'll begin looking at verse 15, we'll come back to verse 14 in just a moment, but look with me at verse number 15 as we consider this morning this conflict that each of us will face. The Bible says that He died for all. Aren't you thankful for that? He didn't die just for a certain group of people, He died for all and praise the Lord for that. It says that they which live, notice this, should not henceforth live unto themselves, but unto Him which died for them and rose again. So what is the conflict? Well, the reality is that we can live unto ourselves. He uses the phrase here that they should, that they which live should not henceforth, notice this, live unto themselves. You know, this morning as we think about the question, who am I living for, there are many people that if they were honest in answering the question this morning, who am I living for, that they would have to say, I'm living for myself. I am living for my own pleasures, I'm living for those things that I think are going to bring me the greatest level of enjoyment and of pleasure on this earth, they're living for themselves. And I tell you that they live for themselves, not only for pleasure, but they live for position. What position can I have? What place can I rise to? What level of prominence may I be able to achieve, to accomplish, to climb a ladder, so to speak? And we find that there's this conflict because you have the old flesh, you trusted Christ as your Savior, but you still have the old man. And I'll say to you this morning that the old man still has desires. The old man still has those desires and those realities that we face as human beings being saved by the grace of God. There are times in which you, self, wants to be the king of your life. Many a preacher have said over the years that the greatest enemy that we have is the one that we look in the mirror at every morning. So often we think about the external foes and the external enemies, but the reality is that we oftentimes are our own worst enemy. Why? Because I want to live for myself. And in your flesh you want to live for yourself. You want to do the things that please you. You want to have that recognition. Listen, why is pride spoken of so often in the Bible? Why is pride such an issue? I believe it's a great sin that's prevalent in our communities, but even in our churches pride is so prevalent. Why? Because it's a fleshly desire. It feeds our flesh. We find that there are many that live for themselves and they're seeking to live for comfort. They think that they may be able to gain some level of comfort by living for themselves and they just want to do what they want to do. Have you ever heard somebody say, no one can tell me what to do? Many people live with that mantra, with that idea. But we find that the conflict that we must acknowledge is that there is this temptation, this reality of living for ourselves. Even as saved people, we can get into a rut, we can get into a process where we're living for ourselves, but we find that in the text of Scripture it says that we should not henceforth live unto themselves, but notice, but unto Him. So we live for Jesus. We live to please Him, to honor Him, not me, but Christ. Remember what John the Baptist said, He must increase and I must decrease. Truly, John the Baptist had a great following. John the Baptist had a great position. John the Baptist had a race to run and he's the forerunner of Christ and he's the one that would say, behold, the Lamb of God which taketh away the sin of the world, and he had that responsibility. There's a great number of people that followed him, he had many disciples, but when Jesus came on the scene, when he pointed to Jesus, the one who would be the Lamb that would take away the sin of the world, he said, I'm not even worthy to unloose this shoelatchet. He says, as those religious leaders come to him and they begin to tell him about those that were following Jesus, that's the context in John chapter 3, he says, He must increase, but I must decrease. And see, we're living that life for Christ, we're taking and following the pattern that Jesus spoke of. Turn over to Mark chapter number 8, if you will, and notice what Jesus says in Mark chapter number 8. Even as I mentioned Mark 8, some of you already have an idea of the passage that we're looking to as Jesus would call the people unto himself, and we find at the end of the chapter. chapter in verse 34, this great truth is given to us with regard to the crucified life, living for Jesus. The Bible says in verse number 34, and when he, Jesus, had called the people unto him with his disciples also, he said unto them, notice this, whosoever will come after me, let him deny himself and take up his cross and follow me. For whosoever will save his life shall lose it, but whosoever shall lose his life for my sake and the gospels the same shall save it. For what shall it profit a man if he shall gain the whole world and lose his own soul? What shall a man give in exchange for his soul? Whosoever therefore shall be ashamed of me and of my words in this adulterous and sinful generation, of him also shall the Son of Man be ashamed when he cometh in the glory of his Father with the holy angels. We can look at this text of Scripture from really two applications. Number one, if we talk about a lost man, what shall it profit a man if he gain the whole world and lose his own soul? There are many people that have that perspective in life. They've never been redeemed. They're not saved people and they're living for all the pleasures that this world could afford. And by the way, Hebrews chapter number 11 does tell us that there's pleasure in sin for a season. Does it not? Moses had that experience and it speaks of it in Hebrews chapter number 11, and we find that he refused that and he was willing to suffer affliction with the people of God. Why? Because he was going to live not for the pleasures of the world, not for the pleasure of sin, but he's going to live for his God. We find here that as we look at this passage of Scripture and we could say of the lost person, listen, what does it matter if you gain all of these things? What does it matter if you're on the Forbes list of the most wealthy people in all of the world? What does it matter if you reach the number one position, but you're lost for all of eternity? You suffer in the lake of fire. Because I say to you as Christians, there are times in which we too struggle with living for ourselves instead of living for Him. And I make the application this morning, what does it matter if we, listen, if we've been saved by the grace of God, but yet we're living for those same types of things that the world's living for? And you say, but I'm going to heaven, yes, but you're going to go to heaven maybe empty-handed. You're going to go to heaven maybe accumulating a lot of things here on this earth and maybe having great position and title and so on and so forth, but you might stand at that judgment seat of Christ with nothing to offer your Savior. No crown to cast back at His feet. As we read, speaking of the judgment seat of Christ in our last message here in 2 Corinthians chapter number 5. So the Lord gives us this great pattern here in Mark chapter number 8 in verse 34, He gives us the, the progression, if you will. So often we talk about the importance of following Jesus. In fact, we sing songs about following Jesus, I will follow, follow on, all of these songs that we sing and we understand the importance of following Jesus. I have decided to follow Jesus. No turning back, no turning back. Is that not what the songwriter said? Is that not the song that we sing with children and VBS and so on and so forth? But listen, as adult people, as senior saints, we ought to still be singing, I have decided to follow Jesus. Amen? It's not just for the children's church. It's not just for the vacation Bible school kids. It's for us as well. I've decided to follow Jesus. After all that He's done for me, oh, that I would live for Him. And we find that there are oftentimes people talking about following Jesus. Listen, if you don't follow the prescribed pattern that's set forth in Mark 8 in verse 34, you're going to struggle following Jesus because here's the reality is that you must first deny myself. If you try following Jesus but you've never died to self, you're divided and you're going to struggle. It's going to be a battle every single day. Why? Because you've not died to self. And so guess what self wants? Self wants what self wants. Amen? Self doesn't want to suffer. Self wants convenience. Self wants comfort. Am I right? And so we must deny ourselves. Paul said it this way, I am crucified with Christ. He said it this way, I die daily. I've denied myself. Not I, but Christ. Not I, but Christ. We find that he says not only that we're to deny ourselves, but number two, he says that we're to take up his cross. Wow. The cross represents for us many things, but we find that the cross represents first death. I'm thankful that my Lord and Savior died upon that cross. This morning we have a cross in our baptistry. Every time you come in here, you see that cross, but you'll notice that Jesus isn't on that cross. Why? Because he's suffering sin, death, and the grave. Hallelujah. I serve a risen Savior. He's not on the cross anymore. At Christmas time, you'll see these little portrayals of Jesus in a manger at Bethlehem. Listen, he's not there anymore either. Hallelujah. I'm thankful for the truth of the incarnation. I'm thankful that Jesus became flesh, that he came to this world and he became flesh, God in flesh. I'm thankful for that. I'm thankful that he went to the cross because it was necessary for my salvation, for your salvation. The incarnation and the crucifixion, they're great truths and realities. They're absolutely essential to Christian faith and doctrine. He's not in the manger and he's not on the cross. He is seated at the right hand of the Father. He's ascended. He is waiting to come back for us, amen? He is in his exalted position. Listen, when he comes the second time, he's not coming as a babe in the manger. When he comes the second time, he's coming as the conquering king of Judah. And hallelujah, that's my God. But I think about this thing of taking up our cross, it's dying to self. Many years ago, I think Holly and I, we've been married for 24 years, so it was somewhere right after we got married, my mother-in-law had this idea that at Christmas time, that everyone would give a gift that was something that they made. Now, if any of you know me real well, I'm not real crafty. And so all of a sudden, I'm sitting around and I'm thinking, so I'm supposed to make something that I'm going to give to all of these people. What in the world am I going to do? And I began to think about it, I began to kind of pray about it, and what could I do? And I made a bookmark, I have a, it's not this bookmark, but it was a little bit bigger than this. I just had this in my coat pocket this morning. But I made this bookmark, and I had Galatians 2.20 written out, typed out on one side, and on the other side I had this phrase, dying to self is the prerequisite for the victorious Christian life. If you want victory in your life, you better die to self. You've got to die to self. Denying myself, taking up my cross, and then the Bible says, follow me, follow me. You know, when I've denied myself, when I've taken up my cross, I can follow Jesus, singular focus. God doesn't want a divided heart. How many times we read about the kings that they, that they did this, but not with their whole heart, right? You see this phraseology in the Bible, listen, God wants all of your heart. He wants all of you. He wants all of me. But when we look at this passage in 2 Corinthians chapter 5 and we seek to answer the question, who am I living for? We must acknowledge this morning that there's a conflict. We must acknowledge this morning that you struggle, that I struggle every day of our lives. Am I going to live for myself or am I going to live for Jesus? And it's not something that you made a decision on some day in the past and said, I'm going to live for Jesus, and then you never have to revisit that choice. Because the reality is that every day of your life, and in fact, many moments during the days of your life, there's going to be something that comes up that you could make that decision, okay, I'm living for Jesus, but now I'm living for self. I'm living for Jesus, and now I'm living for self. It can go back and forth. The reality this morning is that we must see that there is this conflict, and even as saved people, that we ought to know better. I think this morning, if we would be honest and if we would be willing to come and stand and give testimony, that each of us could say that at some time in my Christian life, however long I've been saved, there has been at least one day that I didn't live for Jesus, that I was living for myself, that I was living for myself. We note the conflict. Number two, I want you to consider some things. There's a conflict, but then there's some consideration. Notice with me, really, three thoughts from these three verses of Scripture on what it is that we should consider. Number one, we should consider Christ's love. In verse number 14, the Bible says, for the love of Christ constraineth us. That word literally means to hold together. It means to hold together lest it fall to pieces. Now, think about that just for a moment. They would use it in binding of sheaf. They would use that phraseology, the same word and that same idea where they would bind them together and they would keep them together so that they would be held and pressed together so that they wouldn't fall apart so they could be... easily transportable, and we find here that he says, the love of Christ constraineth us. Yes, I believe that there's some aspect to this word also having that compelling feature and that motivation idea, and it's there and we understand that, but we see that here we must remember the love of Christ. Listen, it's his love that sent him to the cross. It's the love that kept him on the cross. We find that for God so loved the world, but God commendeth his love toward us, and that while we're yet sinners, Christ died for us. The reality that Paul says to the church, to the folks in Rome, what can separate us from the love of God? Keep yourselves, Jude is telling us, in the love of God. What happened to the church at Ephesus? Well, they left their first love. This morning, are you reminded every day of your life that God loves you, and that it's the love of Christ that constrains you? Listen, when we consider this truth, when we understand, listen, you ever hear somebody say, things are falling apart in my life? Somebody might say, my life is falling apart. Listen, it's God that keeps us together. It's the truth of God's word that we regularly go back to that gives us the joy and the peace. It's his love. I'm thankful that he actively loves us. We sing the songs, we understand the importance of being reminded of God's love, and there's many songs that speak about God's love. And can it be, what a great song, that thou, my God, didst die for me. For me. How can it be? Amazing love, for sure. Jesus loves even me. Wonderful things in the Bible, I see. But this is the dearest, that Jesus loves me. I hope this morning you never get over the fact that God loves you, and that he loves you with an unconditional love. He loves you with an everlasting love. There's nothing that can separate you from God's love. And when you're reminded of God's love for you, it ought to compel you and motivate you to live for Jesus. We consider his love, we consider the fact that he died for us. We see it, it's the second truth that we see here in verse number 14 and 15, because we thus judge that if one, speaking of the Lord Jesus Christ, died for all, then we're all dead. We were all dead. You say, no, I was alive. No, you were dead spiritually. You were alive physically, but you were dead spiritually. And we understand that Paul mentions that in Ephesians 2. You don't need to turn there, but it says, and you hath he quickened to make alive who were dead in trespasses and sins, Ephesians 2 and verse number 1. I was dead. We were dead. In fact, Ephesians 2 goes on to continue mentioning we all had the same position. This was our conversation. There's nothing different about any of us. We were all dead in our trespasses and sins. And so it says that he died for all. I'm so thankful for the Bible truth that God died for all the world. There are some that would teach that he only died for a certain group of people. I do not find that biblically. You find that throughout the Bible that his death was substitutionary and is sufficient for all mankind. We find that the Bible says in 1 John 2, what a great verse of scripture that many people will take and they'll try to explain away other verses. But I come to 1 John 2 and I've had this conversation repeatedly with people where the Bible says this, that in verse number two, and he speaking of Christ is the propitiation for our sins and not for ours only, but also for the sins of the whole world. He's our mercy seat, our covering. He took my place, he died for me and he died for you. Listen this morning, when we consider the fact that he died for me, shouldn't I at least live for him? If he was willing to die for me, if he's willing to die for you, shouldn't we at least live for him? The third truth that we see is what is our view of Christ? In verse 16, it's a verse of scripture that Paul is sharing with us here. And he says, wherefore, henceforth, know we no man after the flesh. Yea, though we have known Christ after the flesh, but now henceforth, know we him no more. It can be a little confusing, this verse of scripture, but let me help you understand as I've meditated upon this and thought through this this week and previously and just really looking at what's taking place here, Paul is saying, listen, my view of Christ has drastically changed from before I got saved to now that I am saved. See, Paul, there's little doubt in my mind that Paul would have known who Jesus was. He would have known who Jesus was. He would have known Christ, the man, Jesus Christ, the man. He would have known him. There's, maybe he met him. Maybe he heard of some miracles. We don't know, the Bible doesn't go into all the details, but we do know that all the Jewish men would come to Jerusalem three times a year. Jesus was there regularly. And by the way, he performed miracles and there was a great, and Paul had trained at the feet of Gamaliel. Paul was a religious leader. I don't know what interactions they had, but what I want you to understand that Paul, now that he's converted, he has a completely different view of who Jesus Christ is. Prior to his salvation, prior to his conversion in Acts chapter nine, he just thought of Christ as a mere man. He thought of Christ maybe as a phony, as a fake, as an imposter, whatever he would have thought of. Why? Because he's going out to kill any of those, to imprison and to commit to death those that were of that way, Acts chapter nine. But now, but now he sees Christ in a whole different way. He understands that what happened there at the cross of Calvary, he understands that at that cross that Jesus was dying for him. He would have been familiar with the fact that it was Barabbas that was supposed to die on that cross, that the other two that were dying alongside Jesus, that the third was for Barabbas, but no, the people said, release him and crucify Christ. And I don't know what place Paul would have had in all of that, but Paul now understands that he died for me and he loves me. And Paul's perspective, his view of Christ is completely transformed. I wonder this morning, can you recall what you thought about Jesus before you got saved? Can you recall this morning your view of Christ before you trusted him as your personal Lord and savior? Depending on your background, depending on how you had been taught, you have varied ideas about who Jesus was or who he is. But now as a believer, man, I have a different view of who Christ is. He's not just a mere man. He's God in flesh. He loves me and he died for me. And so Paul is saying, listen, there's a conflict and we must acknowledge that this morning, but there's some things to consider. I'm reminded of a song. You don't need to turn there, but I just wanna read a couple of verses of this song. It's number 694 in our song book. You can turn there if you'd like. And in this song, it is said that the one who wrote this song, that she went into a place and had been struggling with really some of the things she had been taught about salvation and Christianity. And she was struggling and having some doubts in her life is what the story says. And she went in and she saw a picture on the wall that was a depiction of the cross of Calvary. When she saw that, it had such a deep impact upon her that she sat down and wrote this song. I gave my life for thee. I gave my life for thee, my precious blood I shed that thou might ransom be and quickened from the dead. I gave, I gave my life for thee. And she asked this question, what has thou given for me? Jesus, as she's writing this, it's Jesus that's saying, I gave my life for thee. And then Jesus saying, what have you given for me? The second verse, my father's house of light, my glory circled throne. I left for earthly night for wandering sad and alone. He left the glory of heaven. He's God. You read John 17, our memory verse for the month of March, 2 Corinthians 8, 9. He became poor for us. He left the throne of heaven, the glory that he had. He said, I left, I left it all for thee. Hast thou left aught for me? I know it's a song. It's not Bible, it's a song. But oh my, what a song it is. The third verse, I suffered much for thee, did he not? Peter speaks of in 1 Peter 5, about being an eyewitness of the sufferings of Christ. I suffered much for thee, more than thy tongue can tell.\" Isn't that an interesting statement that the songwriter writes? We can't fully understand all that Christ suffered for us. The end verse of this 2 Corinthians 5 that we'll look at in a few weeks, He hath made Him to be sin for us. I can't fully comprehend that level of suffering. Of bitterest agony, to rescue thee from hell, I've borne, I've borne it all for thee. What hast thou borne for me? Verse 4, and I have brought to thee, down from my home above, salvation full and free, my pardon and my love. I bring, I bring rich gifts to thee. What hast thou brought to me? What a song, what a song. The songwriter understood something that we're preaching about here this morning. In 2 Corinthians 5, 14-16, I don't know the exact verses of Scripture that God was using in and through her life at the time of writing that song, but oh, when we look at this passage as Paul is writing to this church in Corinth, we know some things about the church in Corinth. Man, they're a church that needed to understand that they need to live for Christ. The conflict, the consideration, I finish up this morning with a choice. You know, the facts have been presented as Paul lays it out here. We're all dead, but Christ died for us. We should not live for ourselves, we should live for Him. He loves us. He died for us. He offers this to us. The facts are presented, but Paul now is going to kind of lay it out as we look at this passage. He doesn't ask him the question, but I said that by way of introduction this morning, I said that the truth that is given begs a question. Who am I living for? There's a choice to be made. A choice that every child of God has to make. Listen, there's a choice for salvation, amen? He came to His own, His own received Him not, but as many as received Him, to them gave He power to become the sons of God, John 1. Listen, there's a choice on whether you're going to trust Christ as your Savior or not. Many a time I've presented the gospel to individuals that said their choice was one of rejection. How glorious it is when someone receives that gift. But can I tell you this morning that that's a one-time decision that you make to trust Christ as your Savior. He tells us that He gives us eternal life. He tells us that we'll never perish. He tells us that we're secure in the hand of God, that we have an inheritance that is reserved in heaven for us. I mean, the truth of eternal security is such a precious reality. The choice that you now have as a believer, listen, if you've never been saved this morning, your choice is to get saved, to trust Christ as your Savior. But for every child of God this morning, you know what our choice is, our decision, is our, who are we going to live for? Am I living for myself? Am I living for Jesus? You know, there's some people that say, well, I want to offer another idea. I'm living for my spouse. I'm living for my children. I'm living for my, no, no, you're to live for Jesus. Amen? Live for Jesus. Paul had already made his choice. Paul had already made his choice. We sang the song this morning, who is on the Lord's side? By the way, I love it when songs just mesh so well with the message. Who is on the Lord's side? You know who's speaking? That's Moses, all right? Exodus chapter 32 takes place and all the sin, remember Aaron, they got that golden calf and here be thy gods and so on and so forth and Joshua and Moses come down and Joshua stands there and says, who is on the, or Moses said, who's on the Lord's side? Let them come after me. It was a choice. It was a choice that they had to make. This morning we have a choice. Paul made his choice. Paul had drawn the line in the sand. Paul had boldly proclaimed and declared his choice. How do we know that? Galatians 2.20, I am crucified with Christ. Nevertheless I live, yet not I, but Christ liveth in me and the life which I now live in the flesh. I live by the faith of the Son of God who loved me and gave himself for me. Paul had made it known. Paul says to the church in Philippi in Philippians 1.21, for to me to live is Christ and to die is gain. Paul as he writes here in 2 Corinthians chapter 5, he'd already spoken about heaven. He'd already dealt with the reality and the certainty of heaven. He knew that he was going to go and be and live with the Lord for all of eternity. But the question this morning is not, who are you going to live with for all of eternity? For we know if we're saved that we will live with Christ. The question this morning is this, will I live for Christ today? I will live with him for eternity. But will I live for him today? What a question. What a question. Paul says for me to live is Christ. Man, what is he saying? It's not about me. It's not about Paul. It's not about what I want. It's about what Christ wants. It's about what pleases him. Paul, you're going on another journey. Paul, you're going over there. Don't you know those people hate you? They don't want to hear the gospel. They're going to… Paul said, not me, but Christ. Not me, but Christ. And I want you to consider this morning the wonderful reality from this portion of Scripture as we couple it all together, these first really sixteen verses. We'll deal with verse seventeen next week, and it's a familiar verse of Scripture, but we look at these first sixteen verses, and I've said it already, but I want it to just sink in this morning before we have our time of invitation. If you're saved this morning, you will live with Christ forever. Do you believe that this morning? I'm saying do you really believe that this morning? There's like four amens. I hope there's more that believe that this morning. You're going to live with him forever. How do we know that? Verse fourteen, let not your heart be troubled. You believe in God. Believe also in me. In my Father's house are many mansions. If it were not so, I would have told you. I go to prepare a place for you that, and if I go, I'll come again and receive you. What does it say unto myself? That where I am, there ye may be also. Is that not what it says? First Thessalonians chapter four, we're going to, then they which are alive and remain shall be caught up to meet the Lord in the clouds, right? So forever we will be with the Lord. Is that not what the Bible teaches? Do you believe that this morning? If you're saved this morning, you're going to live with him forever. I can't wait, hallelujah. If you're not saved this morning, listen, if you're not saved this morning, you will live separated from him forever in a place called the lake of fire, often referred to as hell, but the Bible tells us that death and hell are cast in a lake of fire. That's the eternal place of judgment. The Bible tells us of hell that it's a place where the worm dieth not. It's not annihilation. It's separation from God for all of eternity. So if you're not saved this morning, today is the day of salvation. In fact, Paul says that in second Corinthians chapter six, behold, today is the day of salvation. If you're not saved today, the choice for you is to get saved. But if we believe this morning, and I shared the verses with you that we will live with Christ forever. The question, the question is will you live for Christ today? Will you live for Christ today? You're going to live with him forever, but will you live for him today? We got to ask ourselves the question, who am I living for? Who am I living for? I know where we stand today. I know where we're located, and I understand the area that we're in in northern Virginia and the pressures of life and so many people living for so many different things and how that can influence, the culture can influence a church. And all of a sudden, we can get a little distracted on what I'm living for. Oh, God wants to get our attention today. Who am I living for? I got to ask that. Listen, I got to deal with this all week. as God dealt with me. You get it just for 50 minutes. I had to deal with it all week. And I hope you deal with it all next week. And the week after that, that we remember who am I living for? Who am I living for? Because He saved me and I had to live for Him. I shouldn't live for myself. I don't live for my wife. I don't live for my kids. I love my wife. I love my kids. I love my, I got grandkids now. Love them. But I don't live for them. I live for Jesus. And if I live for Jesus, I can be the husband and the father and the grandfather that I'm supposed to be. But if I start living for them, everything gets out of kilter. It gets all whacked out. I got to live for Jesus. Who am I living for? Father we love you. Thank you for loving us. Thank you for the text of scripture. Thank you for the reality that we'll live with you forever. If there's one that's not saved, I pray that today they'd get saved. They'd recognize that you loved them and you died for them. You took their place so that they could be saved. God, I ask that you would help me and every other believer in this room, tuned in via live stream, that we would search our hearts and honestly answer the question, who am I living for? Will I live for Christ today? I'm thankful I'll live with you forever. Will I live for you today? Work as only you can. We'll give you the honor and glory for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Who am I living for?",
  "processed_at": "2025-04-14T17:10:15.110114"
}