{
  "video_id": "9G6aYNGlUN8",
  "text": "live as we continue with the subject matter of sound doctrine, and this evening we will look at the subject matter of the Trinity. In fact, if you are taking notes, it's simply titled the message this evening, The Trinity, and we'll look at a number of verses of Scripture. We'll be in both the Old and New Testament this evening, and the Trinity is a scriptural reality that is of significant importance this evening. Many of us are very much aware of the fact that there are many that would attack this teaching. With that knowledge that there are many today that are attacking the reality and the Bible truth of the Trinity, it makes it that much more important that we study the subject matter and that we are well grounded. Remember, we are to be settled and grounded in the truth and the faith, and we understand that there are many that have come, false teachers and so on and so forth, and that is why it's important for us to study doctrine and to be sound in doctrine and that we would not be tossed to and fro. This evening, as we think about the subject matter of the Trinity, we must remember that our God transcends us, and that our understanding is limited, yet He is the infinite God, and even over the last couple of weeks as we've studied not only the attributes of God but the names of God, we have stood in awe of who our God is and the way in which He has made Himself known to us, and what a tremendous blessing that is. Look here in 1 John 5 and verse number 7. The Bible says this, For there are three that bear record in heaven, the Father, the Word, of course that's referring to Jesus Christ. The beginning was the Word, the Word was with God, and the Word was God. The Word was made flesh and dwelt among us, and so we know that one of the names of Jesus is the Word, and so we see here that the Bible says there are three that bear record in heaven, the Father, the Word, and the Holy Ghost, and these three are one. We use the word Trinity, perhaps a word that would be used as well would be a triunity, three in one. We find the word used both in Acts and in Romans, the Godhead. You will not find the word Trinity or triunity in the Word of God. It's not an English word that you'll find in your Bible, and like matter you will not find the word rapture, and there are some folks that say, well the word rapture's not there. Yeah, but it means caught up, and we find that in the book of 1 Thessalonians that we're to be caught up together in the clouds to meet the Lord in the air, and so we understand the rapture based upon that teaching and obviously other portions of Scripture, and this truth with regard to the triunity, the three in one, is really found throughout the whole of Scripture. The Bible, no doubt we find that the Bible reveals this truth, and we accept it by faith. The Bible says that faith cometh by hearing and hearing by the Word of God, and what a blessing to have the Word of God in its entire purity, and to have the truth that has been given to us. I suppose this evening that many that are within our group this evening have heard various analogies that mankind has tried to kind of come up with to explain the Trinity. I'll say this, and I could use some of those analogies and try to give it to you this evening, but the reality is that there is no analogy that sufficiently explains the truth of the Trinity. Why? Because our God transcends us, and a theologian of yesteryear made this statement, and I thought it was an interesting statement. He said, limiting God to our understanding is making ourselves equal to God in understanding. That was a pretty profound truth from a theologian of yesteryear. Let me remind you still as we think about the kind of introduction to this thought this evening of dealing with the Trinity, if you would turn to the book of Romans in the 11th chapter, Romans 11, and we visited this portion of Scripture a number of weeks ago as we looked at the attributes of God and dealt with the omniscience of God, the fact that He has perfect wisdom and all knowledge. The Bible says in Romans 11, beginning in verse 33, O the depth of the riches both of the wisdom and knowledge of God! How unsearchable are His judgments and His ways past finding out! For who hath known the mind of the Lord? Or who hath been His counselor? Or who hath first given to Him, and it shall be recompensed unto Him again? For of Him and through Him and to Him are all things, to whom be glory forever. Amen. Remember, we've mentioned on a couple of occasions the truth of Psalm 135 coupled with the truth of Psalm 145, where the psalmist declares, I know that the Lord is great. But then he says the greatness of God is unsearchable. And I believe, as I've said often, that there is no contradiction between those two statements. The reality is that we know our God is great, but His greatness is unsearchable in the fact that I can't fully comprehend just how great our God is. And this teaching of the Trinity that we find throughout the Word of God is of utmost importance. You know, things begin to fall apart if the Trinity were not true, and we'll look at some of those things here in just a few moments as we get into the study this evening. And so it is an imperative truth of the Word of God. I will say this also by way of introduction. It's interesting to know as we looked at the names of God, and we spent the last two weeks looking at the names of God, we looked at ten of them all in its entirety. Obviously there are more names that we could have looked at, but two of those names that we dealt with are Elohim and Adonai. Elohim and Adonai. It's interesting in the Hebrew that both of those words are plural, speaking about a singular God. In the beginning, God, in Genesis chapter 1, the Hebrew word for God is plural, but we find that it's speaking of a singular God. I would not say this evening that the teaching and really looking at those two nouns, if you will, being the names of God Elohim and Adonai, that them being plural would prove the Trinity in its entirety, but certainly it helps us to understand how that from the beginning of the Word of God and from the beginning of God's interaction with mankind, He was revealing this truth about the Trinity. And as you look at progressive revelation, as you look at the fullness of the Word of God and see how that God revealed all of this truth to us, how we can rejoice in even the way that God used the names in the beginning of the Word of God. It is interesting the word Adonai, as we mentioned, it means Lord or Master, and often in the Old Testament, in fact, almost two-thirds of the time that the word is used in the Old Testament, it's not referring to God, it's referring to a servant-master relationship, a ruler, a king, something like that. But every time that word is used with dealing with a person, it's always singular, Adonai. But when it's referring to God, Adonai, plural. And what a blessing to see how that God would reveal this teaching of the Trinity, this truth of the Trinity in that fashion. By way of introduction, continue, let me look at a few more verses of Scripture and then we'll dig into some examples specifically. Look at Deuteronomy chapter 6, if you will. Deuteronomy chapter number 6 and verse number 4, and this is a very familiar passage of Scripture and we find that the children of Israel would have been extremely familiar with this portion of Scripture. In fact, they would have recited this regularly. In Deuteronomy 6 and verse number 4, the Bible says, Hear, O Israel, the Lord our God is one Lord. We find that in the New Testament, if you look at the truth of the baptism of Jesus Christ in Matthew chapter number 3, in verses 16 and 17, you'll see the Trinity there as you see the Father, the Son, and the Holy Ghost. Notice in Matthew 3 and verses 16 and 17, the Bible says, And Jesus, when he was baptized, went up straightway out of the water. And, lo, the heavens were opened unto him, and he saw the Spirit of God descending like a dove and lighting upon him. And, lo, a voice from heaven sang, This is my beloved Son in whom I am well pleased. Again, if you're mindful of the Great Commission in Matthew chapter 28 and verses 18 through 20, the Lord Jesus Christ is speaking and he gives the commission to his disciples and he says this, Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth. Go ye therefore and teach all nations, baptizing them in the, what does it say? Name, right? Singular, in the name of the Father and of the Son and of the Holy Ghost, teaching them to observe all things whatsoever I have commanded you. And, lo, I am with you always, even unto the end of the world. Amen. And Paul writes to the believers in Corinth and as he ends the second letter that he sends to them in 2 Corinthians 13 and verse number 14, the Bible says, The grace of the Lord Jesus Christ and the love of God and the communion of the Holy Ghost be with you all. Amen. We think about the Trinity. It is one triune God. coexisting and eternally existing in three persons, God the Father, God the Son, and God the Holy Spirit. Let's look at a few Old Testament examples, if you will, and let's begin all the way back in Genesis 1 at creation, if you will. Genesis chapter number 1, verses 26 and 27, and I want you to notice in each of these Old Testament passages that we'll look at, we'll see how that the reference is given to the truth of the Trinity, and as you go through the Scriptures, you see how that the package is more fully unfolded, unpackaged for us, unwrapped for us, so that we can see this teaching and this truth of the Trinity. But here in Genesis chapter number 1, in verses 26 and 27, the Bible says, and God said, let us make man in our image, after our likeness, and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. So God created man in his own image, and the image of God created he him, male and female created he them. And so we look at some Old Testament examples, and we start with the creation of man, and we find here in our passage of Scripture that God said, let us make man in our image, after our likeness. And again, we see in these Old Testament examples how that this teaching, this truth, the reality of the Trinity, the triunity, the three-in-one, that it is given to us right from the beginning of the Scriptures. The Bible tells us not only here in Genesis chapter 1, but another example here in the book of Genesis, in chapter 11. Turn over there just a few pages in your Bible, and Genesis chapter 11 is the record of the Tower of Babel. You'll be mindful through our study of the book of Genesis that not too long ago we looked at this passage of Scripture, and we understood that which is taking place in the way in which God would confound the languages. And in chapter 11, notice, if you will, in verse number 2, it says, and it came to pass as they journeyed from the east, they found a plain in the land of Shinar, and they dwelt there. And they said one to another, go to, let us make brick, and burned them throughly. And they had brick for stone, and slime had they for mortar. And God, excuse me, and they said, go to, let us build us a city and a tower, whose top may reach into heaven, and let us make us a name, lest we be scattered abroad upon the face of the whole earth. And the Lord came down to see the city and the tower which the children of men builded. And the Lord said, behold, the people is one, and they have all one language, and this they begin to do. And now nothing will be restrained from them which they have imagined to do. Go to, let us go down, and there confound their languages, that they may not understand one another's speech. Again, another instance of this truth being given to us in the Old Testament is Isaiah chapter number 6. So you see in Genesis 1, during the creation of man, and Genesis chapter 11, the confounding of the languages, and Isaiah chapter number 6, the call of Isaiah. The call of Isaiah. Isaiah chapter number 6, and we are again familiar with this passage of Scripture. In fact, I referenced it on Sunday evening during the message, but we look here in Isaiah chapter number 6, and we find that Isaiah sees the Lord sitting upon a throne high and lifted up, his train filled the temple. The Bible tells us after these things, this interaction, we don't have time for reading all of it. I want to get to some things in the New Testament examples here in just a moment, but look at verse number 8. Isaiah speaking here, it says, also I heard the voice of the Lord saying, whom shall I send, and who will go for us? Then said I, here am I, send me. And he said, go and tell this people, hear ye indeed, but understand not, and see indeed, but perceive not. And so again, we find in verse number 8 of Isaiah 6, this reference, this teaching of the Trinity, this revelation to mankind in these three examples from the Old Testament, the creation of man, the confounding of the languages, and the call of Isaiah, how that the plural us is used in each one of those examples. The Lord is speaking, and he says, let us. I don't know about you, but if I'm doing something by myself, I don't say let us, let me, right? Because it's a singular use of the proper use of language. Occasionally, we will hear somebody say something of, hey, we are gonna go do this, and you really understand that they are going to go do this, and they're saying we because they're expecting you to help them, right? That's why they use the plural we. And so we see that God, in each of these examples, is helping us to understand the reality of this Bible truth of the Trinity, the triunity, the three-in-one. As we go to the New Testament, look at some examples. What I'll do this evening is I'll give you the truth in the way in which the each person of the Godhead, the Father, the Son, and the Holy Ghost, or the Holy Spirit, they're each referred to as God. Why? Because they are. Three-in-one. Look at John 17. We'll start first with the Father. In John chapter number 17, we often refer to this portion of Scripture in John 17 as the Lord's Prayer. We understand that there is a model prayer that He gives when the disciples say, teach us to pray. This, in fact, is the Lord's Prayer when He's praying before He would go to the cross of Calvary. And the Bible says this, these words spake Jesus and lifted up His eyes to heaven and said, Father, the hour has come. Glorify Thy Son that Thy Son also may glorify Thee. And Thou hast given Him power over all flesh that He should give eternal life to as many as Thou hast given Him. And this is life eternal that they might know Thee, the only true God, and Jesus Christ whom Thou hast sent. I have glorified Thee on the earth. I have finished the work which Thou hast given me, which Thou gavest me to do. And now, O Father, glorify Thou me with Thine own self, with the glory which I had with Thee before the world was. These five verses of Scripture are so powerful in helping us to understand a number of things about God. Of course, the eternality of Christ is in full view in verse number five when He speaks about the fact that He would have, once again, the glory that He had with the Father before the world was. And there are those that would teach that Jesus is created. No, He is not a created being. He is God. And we'll get to that in just a moment, but we find here the eternality of Christ is in view in verse number five. But we saw in verse number three where that Jesus says, and this is life eternal, that they might know Thee, the one true, or excuse me, the only true God, and Jesus Christ whom Thou hast sent. And so the Father is the one, remember, in verse number one, as Jesus is praying, He says, Father, the hour has come. Glorify Thy Son. And so the Father is referred to as God. Why? Because He is. Jesus Christ is referred to as God. Why? Because He is. And John chapter number one, a portion of Scripture that I quoted a part of it when we looked at first John 5 and verse number 7, it said the Word and how that we may note that that's Jesus Christ, a title or a name that is given to Him. And John 1 and verse number 1, the Bible says, in the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God. All things were made by Him, and without Him was not anything made that was made. If you look in verse number 14, the Bible says, and the Word was made flesh and dwelt among us, and we beheld His glory, the glory as of the only begotten of the Father, full of grace and truth. And so we see here in John chapter number one, that in the beginning was the Word. We know that the Word is Jesus Christ, and in verse number one it says, and the Word was God. But not only there, I want you to look at a few other examples. Look at Acts chapter 20, if you will. And Acts chapter number 20, and I'm gonna spend a bulk of time here. I've kind of gone quickly this evening, but I want to spend a bulk of time on this truth, this aspect of the teaching of the Trinity that Jesus is God, because that is the most attack thing today. There are a few cults and some major world religions that attack the teaching that Jesus is God, and we need to understand that this is a very prominent thing that's going on in our world today, through the world religions and also through the cults, and we need to be grounded and settled, and we need to know what the Word of God says, because they will take the scriptures, they'll twist things around, and they can get you all kinds of sideways if you're not careful, and that's why we're to be settled and grounded in the truth. Look in Acts chapter 20. Contextually, the Apostle Paul is speaking to the church leaders from Ephesus, and notice what he says in verse number 28. blood on the cross of Calvary? Jesus Christ. And it says here, it says that you would feed the church of God which He hath purchased with His own blood. Why is Paul able to say it that way? Because Jesus is God. And there's no contradiction whatsoever. Yes, indeed, God in flesh, He died on the cross of Calvary to pay for the sin of mankind. Notice in the book of Hebrews, if you will, Hebrews chapter number one, we spent much time back in January as we started preaching through the book of Hebrews to look at this truth with regard to the the Lord Jesus Christ being referred to as God, because He is. And in the particular passage, really in verses 5 down through the the end of the chapter, He is dealing with the fact that Jesus is superior to the angels. And we said many things about that, and we'll mention a few of those this evening as well. But notice what it says in verse number 6, and again, when He bringeth in the first begotten of the world, He saith, and let all the angels of God worship Him. You understand that angels are not worshipped, but Christ is worshipped. Why? Because He is God. We find that in verse number 8, it says, but unto the Son He saith, this is God the Father speaking as we look at the verse here, but unto the Son He saith, thy throne, O God, is forever and ever. A scepter of righteousness is the scepter of thy kingdom. And why is God the Father referring to the Son as God, O God, forever and ever? Thy throne, O God, is forever and ever. Why? Because He is. He's God. We find here, we think about angels in the context of Hebrews chapter 1, we find that the angels, in fact, were there announcing the birth of Christ, and they're singing the praises in glory to God in the highest, and so on and so forth. And we find throughout the Word of God that angels are never worshipped. In fact, in the book of Revelation, when there's an angel that's giving some of those truths to John, and John's ready to worship, he says, no, worship God. Don't worship me. Don't worship an angel. You worship God. And so, if we're to worship God, if Jesus is not God, then there's a problem in the fact that throughout the gospel records we find many examples of Jesus accepting worship. Why would He accept worship? Because He's God. Remember when, let me share a couple of examples, and then I'll say that. Look in Matthew chapter number 2, if you will. In Matthew chapter number 2, and this is a portion of Scripture that we're familiar with during the season that is coming near upon us, the Christmas season. And speaking about the birth of our Savior in Matthew 2, in verse number 11, it says, when they were coming to the house, they saw the young child with Mary his mother, fell down and worshipped him. And they worshipped Mary, they worshipped him, and remember they asked Herod, where is he that is born King of the Jews? In verse number 2, and they worship and they present gifts. It says, when they opened their treasures, they presented unto him gifts, gold and frankincense and myrrh. Look over in chapter number 8 of the book of Matthew. We'll just look at a few examples right here in the book of Matthew. In chapter number 8, in verse number 1, the Bible says, when he was come down from the mountain, great multitudes followed him. And behold, there came a leper and worshipped him, saying, Lord, if thou wilt, thou canst make me clean. Of course, Jesus healed the man, but we find here that Jesus accepted and received the worship of this one. In chapter 9, in verse number 18, the Bible gives us another example. While he spake these things unto them, behold, there came a certain ruler and worshipped him, saying, My daughter is even now dead, but come and lay thy hand upon her, and she shall live. There are many other examples that we could give you this evening in the gospel records, and I would encourage you to read through the Gospels and to take note of the times in which Jesus received worship. Why? Because He's God. It was absolutely appropriate for them to worship Jesus Christ because Jesus is God. If He was not God, He would not have received worship. You know, there was a time in which Paul, as he's on a missionary journey, that they were gonna worship Paul. They were gonna present offerings. What did Paul do? No, don't do that. I'm not. I'm trying to point you to the true living God. If someone came to try to worship you, what would you do? Would you let him worship you? I'm not worthy of worship, but Jesus is God, and therefore He accepted and He was worshipped. In Mark chapter number 2, again, we don't have time to look through the entirety of the passage, but I want you to remember what's happening here in Mark chapter number 2 and give you some feed for thought, some looking at this passage maybe later and studying through it. Jesus is teaching and a great group of people are gathered together, and these four want to bring their friend that was sick of the palsy. The Bible says that he was born of four. They couldn't get in because of how many people. They had to let him down through the the roof, and the Bible says that Jesus says to him, look in verse number 5, when Jesus saw their faith, He said unto the sick of the palsy, Son, thy sins be forgiven thee. Now, there are people there that were sitting by that were observing, some that were there for the right reason, trying to hear Jesus teach and wanted to hear the Word. There were others that were there seeking to scribes, Pharisees, Sadducees, that were always looking to accuse the Lord Jesus Christ of something wrong, and here the Bible says that there were some of the scribes. Notice in verse number 6, but there were certain of the scribes sitting there and reasoning in their hearts. Why doth this man thus speak blasphemies? Who can forgive sins but God only? They're right. Only God can forgive sins. You know, the priest can't forgive you of any sins, right? There's a whole host of people that have been blinded by those false teachings. Only God can forgive sins. They're right. Notice what is said here. Immediately when Jesus perceived in the Spirit that they had so reasoned within themselves, He said unto them, Why reason ye these things in your hearts? Whether is it easier to say to the sick of the palsy, Thy sins be forgiven thee, or to say, Arise and take up thy bed and walk? But that ye may know that the Son of Man hath power on earth to forgive sins. And then He turns to the man that was sick of the palsy. You got to see it, you got to understand what's happening. He's talking to these scribes that rightfully say, Who can forgive sins but God only? And He says this to the scribes, and then He looks to the man that's sick of the palsy, and He says to him, Arise, take up thy bed, and go thy way into thine house. And he arose, and he went. Jesus said in verse number 10 that ye may know that the Son of Man hath power on earth to forgive sins. He's God. He's God. We could look at a whole host of examples this evening throughout these pages of the New Testament and find evidence that Christ is Messiah. We speak about His incarnation as deity, and we'll look at some of those things as we transition from the doctrine of God theology to the doctrine of Christ, and we'll begin looking at that in a couple of weeks. And we will make more mention and more reference to these things, but we find that Jesus Christ is God. The teaching of the Trinity here in the New Testament, God the Father is referred to as God because He is. The Lord Jesus Christ is referred to as God. Why? Because He is. He receives worship as God because He is. He mentions about forgiving sins, and what a blessing. Notice in Acts chapter number 5, the final reference, remember the triunity, the three-in-one, God the Father, God the Son, and God the Holy Spirit. In Acts chapter number 5, a portion of Scripture in the early church, there were Ananias and Sapphira. They were gonna sell a possession, remember, and they had made this agreement amongst themselves. They're gonna hold back a portion of what their proceeds were from the sale, but yet they were gonna come in and act as if they were gonna give everything. And the reality is that Peter deals with them and says, listen, you didn't have to sell it, and even after you did, you didn't have to give all of it, but there's an important truth that is given here. Again, sometimes we look at maybe the account and the circumstances in which we're dealing with in the dialogue, and perhaps we could miss some truth. And in verse number 1, it says this, but a certain man named Ananias with Sapphira, his wife, sold a possession and kept back a part of the price, his wife also being privy to it, and brought a certain part and laid it at the apostle's feet. But Peter said, Ananias, why hath Satan filled thine heart to lie to the Holy Ghost and to keep back part of the price of the land? So according to verse number 3, who did Ananias lie to? The Holy Ghost, the Holy Spirit. Verse number 4, while it remained, was it not thine own? And after it was sold, was it not in thine own power? Why hast thou conceived this thing in thine heart? Thou hast not lied unto men, but unto God. But unto God. Why? Because the Holy Spirit is God, right? In verse number 3, Peter says, listen Ananias, Satan has filled your heart. He says, why hath Satan filled thine heart to lie to the Holy Ghost? And he goes through and he tells him, listen, you didn't have to sell the possession. After you sold it, you didn't have to give all of the proceeds to the church. but you came as if that's what you did and you didn't lie to man you lied to God the Holy Spirit is God and by the way I want you to consider this truth we see it here in Acts chapter 5 that the Holy Spirit is the Holy Ghost referred to as God be mindful with me in 2nd Timothy chapter number 3 of a great truth that we have with regard to the the Word of God the inspiration of God's Word in 2nd Timothy 3 in verse number 16 it's a verse that we often quote the Bible says all scripture is given by inspiration of God and it's profitable for doctrine for a proof for correction for instruction and righteousness that the man of God may be perfect throughly furnished unto all good works now we understand inspiration God breathed we understand that this book is God's Word to man and what a blessing that is I am so thankful for the Word of God Peter says this in 2nd Peter chapter number 1 in verses 19 through 21 and again there's no contradiction because the Holy Spirit the Holy Ghost is God and notice in verse number 19 Peter says we have also a more sure word of prophecy where unto you do well that you take heed as into a light that shineth in a dark place until the day dawn and the day star rise in your hearts knowing this first that no prophecy of the scriptures of any private interpretation for the prophecy came not an old time by the will of man but holy men of God spake as they were moved by the Holy Ghost and we understand as we would read this portion of Scripture that the the Holy Spirit would lead these men again everything that Paul wrote or said wasn't Scripture but when he was speaking when he was writing Scripture of course the Holy Ghost would move upon him the Holy Spirit of God and all Scripture is given by inspiration of God and when we think about that truth this evening if the Holy Spirit the Holy Ghost moved upon men and obviously referring to the Old Testament writings here contextually and of course the entirety of the Word of God the question would be if the Holy Spirit is not God then how would we say that this is the Word of God the Holy Spirit's not God but he is God and so therefore there's no contradiction for us to say that this is the Word of God all Scripture is given by inspiration of God and oh by the way the operation of that the outworking of how that happened was that the Holy Ghost came upon men and they spoke and that was the Word of God why because the Holy Spirit is God and so this evening as we think about the subject of the Trinity it's an important subject matter it's an important scriptural reality and it is important for us as we look at the truth of the Trinity to really understand and grasp it to the best of our ability understanding that God has given the truth in his Word and we accept it by faith and we we trust that what God has given us and how he has revealed this truth to us that we can claim it by faith understanding that that he transcends us that my understanding is finite and he is an infinite God and we can rejoice in the fact that he is great but yet his greatness is unsearchable and his ways are past finding out but to understand this evening that this teaching of the Trinity listen there are some that would try to attack the the teaching of the Trinity I've mentioned that by way of introduction the reason why it's important that we study it there were some that would try to say well it was this is just a teaching that was introduced by some theologian in some particular year so on and so forth I showed you this evening starting all the way back in Genesis how that this is a Bible truth this is not something that some theologian or some some religious organization came up with and just began to to teach at some point no I'm pretty confident as I read the Word of God to see how that even in the Old Testament that God was revealing through the use of Elohim and Adonai and then also the use of let us make man in our image let us go down and confound their languages who will go for us that God was revealing even the Old Testament this truth this reality of the Trinity and then we see with the progressive revelation how that we get the New Testament and Jesus Messiah comes and he shows he shows that he is God how he receives worship he forgives sin the attributes of God that that are given in the Old Testament you'll see him in the New Testament through the person of Christ you'll see his power you'll see the names in the book of Revelation when you begin to read the first few chapters the book of Revelation you begin to see how that names are ascribed to Jesus then in the Old Testament are given to God the Father there's no contradiction why Jesus is God and so when we understand the biblical reality of the scriptural truth and we're grounded and settled on it these cults that want to deny that Jesus is God these religions of the world that want to deny that Jesus is God we must stand upon the truth of the Word of God and I would submit to you this but Paul says in 1st Corinthians 2 in verse number 14 the natural man receiveth not the things of the Spirit of God for their foolishness unto him neither can he know them because they are spiritually discerned and I'm so thankful that God has revealed himself to us in his Word and he's given us this truth of the Trinity and what a blessing it is to know that God the Father God the Son and God the Holy Spirit three in one tri unity or Trinity as we often refer to it as let's pray this evening father we love you we're so thankful for your word we're so thankful for the truth that is contained therein and Lord as we study this passage or these passages of Scripture this evening with this subject matter of the Trinity I pray that our faith has been strengthened I pray that we've been grounded even more secure in the faith God we know that there are false teachers we are aware of cults today that would teach that Jesus was created that would teach blasphemous things about our Savior Jesus Christ and God we know that as we study your word that this was not some teaching that originated with some religious organization or some individual theologian at some date in recent history but this this is a Bible truth we go all the way back to the pages of Genesis and we see how that you were revealing this to your people and God I pray that you'd help us as we perhaps come into contact with some or have some that would attack our faith or our belief that we would be able to stand firm upon the truth of your word plus bless our time of prayer again we thank you for the privilege I pray that you be honored and glorified through all that said and done for it's in Christ's name we pray amen if you do not have a prayer bulletin we can get",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.0,
      "text": " live as we continue with the subject matter of sound doctrine, and this evening we will"
    },
    {
      "id": 1,
      "start": 7.0,
      "end": 12.680000305175781,
      "text": " look at the subject matter of the Trinity. In fact, if you are taking notes, it's simply"
    },
    {
      "id": 2,
      "start": 12.680000305175781,
      "end": 17.040000915527344,
      "text": " titled the message this evening, The Trinity, and we'll look at a number of verses of"
    },
    {
      "id": 3,
      "start": 17.040000915527344,
      "end": 22.219999313354492,
      "text": " Scripture. We'll be in both the Old and New Testament this evening, and the Trinity"
    },
    {
      "id": 4,
      "start": 22.219999313354492,
      "end": 29.760000228881836,
      "text": " is a scriptural reality that is of significant importance this evening. Many of us are very"
    },
    {
      "id": 5,
      "start": 29.760000228881836,
      "end": 36.0,
      "text": " much aware of the fact that there are many that would attack this teaching. With that"
    },
    {
      "id": 6,
      "start": 36.0,
      "end": 41.959999084472656,
      "text": " knowledge that there are many today that are attacking the reality and the Bible truth"
    },
    {
      "id": 7,
      "start": 41.959999084472656,
      "end": 47.31999969482422,
      "text": " of the Trinity, it makes it that much more important that we study the subject matter"
    },
    {
      "id": 8,
      "start": 47.31999969482422,
      "end": 52.36000061035156,
      "text": " and that we are well grounded. Remember, we are to be settled and grounded in the truth"
    },
    {
      "id": 9,
      "start": 52.36000061035156,
      "end": 57.52000045776367,
      "text": " and the faith, and we understand that there are many that have come, false teachers and"
    },
    {
      "id": 10,
      "start": 57.560001373291016,
      "end": 63.720001220703125,
      "text": " so on and so forth, and that is why it's important for us to study doctrine and to be sound in"
    },
    {
      "id": 11,
      "start": 63.720001220703125,
      "end": 70.04000091552734,
      "text": " doctrine and that we would not be tossed to and fro. This evening, as we think about the"
    },
    {
      "id": 12,
      "start": 70.04000091552734,
      "end": 77.04000091552734,
      "text": " subject matter of the Trinity, we must remember that our God transcends us, and that our understanding"
    },
    {
      "id": 13,
      "start": 78.4800033569336,
      "end": 85.27999877929688,
      "text": " is limited, yet He is the infinite God, and even over the last couple of weeks as we've"
    },
    {
      "id": 14,
      "start": 85.27999877929688,
      "end": 90.36000061035156,
      "text": " studied not only the attributes of God but the names of God, we have stood in awe of"
    },
    {
      "id": 15,
      "start": 90.36000061035156,
      "end": 95.4800033569336,
      "text": " who our God is and the way in which He has made Himself known to us, and what a tremendous"
    },
    {
      "id": 16,
      "start": 95.4800033569336,
      "end": 102.08000183105469,
      "text": " blessing that is. Look here in 1 John 5 and verse number 7. The Bible says this,"
    },
    {
      "id": 17,
      "start": 102.08000183105469,
      "end": 109.08000183105469,
      "text": " For there are three that bear record in heaven, the Father, the Word, of course that's referring"
    },
    {
      "id": 18,
      "start": 109.31999969482422,
      "end": 114.5999984741211,
      "text": " to Jesus Christ. The beginning was the Word, the Word was with God, and the Word was God."
    },
    {
      "id": 19,
      "start": 114.5999984741211,
      "end": 118.31999969482422,
      "text": " The Word was made flesh and dwelt among us, and so we know that one of the names of Jesus"
    },
    {
      "id": 20,
      "start": 118.31999969482422,
      "end": 123.36000061035156,
      "text": " is the Word, and so we see here that the Bible says there are three that bear record in heaven,"
    },
    {
      "id": 21,
      "start": 123.36000061035156,
      "end": 130.36000061035156,
      "text": " the Father, the Word, and the Holy Ghost, and these three are one. We use the word Trinity,"
    },
    {
      "id": 22,
      "start": 132.27999877929688,
      "end": 139.27999877929688,
      "text": " perhaps a word that would be used as well would be a triunity, three in one. We find"
    },
    {
      "id": 23,
      "start": 140.27999877929688,
      "end": 147.27999877929688,
      "text": " the word used both in Acts and in Romans, the Godhead. You will not find the word Trinity"
    },
    {
      "id": 24,
      "start": 147.27999877929688,
      "end": 152.72000122070312,
      "text": " or triunity in the Word of God. It's not an English word that you'll find in your Bible,"
    },
    {
      "id": 25,
      "start": 152.72000122070312,
      "end": 156.1999969482422,
      "text": " and like matter you will not find the word rapture, and there are some folks that say,"
    },
    {
      "id": 26,
      "start": 156.1999969482422,
      "end": 161.52000427246094,
      "text": " well the word rapture's not there. Yeah, but it means caught up, and we find that in the"
    },
    {
      "id": 27,
      "start": 161.52000427246094,
      "end": 165.72000122070312,
      "text": " book of 1 Thessalonians that we're to be caught up together in the clouds to meet the Lord"
    },
    {
      "id": 28,
      "start": 165.83999633789062,
      "end": 171.32000732421875,
      "text": " in the air, and so we understand the rapture based upon that teaching and obviously other"
    },
    {
      "id": 29,
      "start": 171.32000732421875,
      "end": 177.1999969482422,
      "text": " portions of Scripture, and this truth with regard to the triunity, the three in one,"
    },
    {
      "id": 30,
      "start": 177.1999969482422,
      "end": 184.1999969482422,
      "text": " is really found throughout the whole of Scripture. The Bible, no doubt we find that the Bible"
    },
    {
      "id": 31,
      "start": 184.47999572753906,
      "end": 189.9199981689453,
      "text": " reveals this truth, and we accept it by faith. The Bible says that faith cometh by hearing"
    },
    {
      "id": 32,
      "start": 189.9199981689453,
      "end": 195.60000610351562,
      "text": " and hearing by the Word of God, and what a blessing to have the Word of God in its entire"
    },
    {
      "id": 33,
      "start": 195.63999938964844,
      "end": 202.32000732421875,
      "text": " purity, and to have the truth that has been given to us. I suppose this evening that many"
    },
    {
      "id": 34,
      "start": 202.32000732421875,
      "end": 209.32000732421875,
      "text": " that are within our group this evening have heard various analogies that mankind has tried"
    },
    {
      "id": 35,
      "start": 209.32000732421875,
      "end": 214.8800048828125,
      "text": " to kind of come up with to explain the Trinity. I'll say this, and I could use some of those"
    },
    {
      "id": 36,
      "start": 214.8800048828125,
      "end": 220.60000610351562,
      "text": " analogies and try to give it to you this evening, but the reality is that there is no analogy"
    },
    {
      "id": 37,
      "start": 220.72000122070312,
      "end": 227.72000122070312,
      "text": " that sufficiently explains the truth of the Trinity. Why? Because our God transcends us,"
    },
    {
      "id": 38,
      "start": 227.75999450683594,
      "end": 233.9600067138672,
      "text": " and a theologian of yesteryear made this statement, and I thought it was an interesting statement."
    },
    {
      "id": 39,
      "start": 233.9600067138672,
      "end": 240.60000610351562,
      "text": " He said, limiting God to our understanding is making ourselves equal to God in understanding."
    },
    {
      "id": 40,
      "start": 240.60000610351562,
      "end": 246.75999450683594,
      "text": " That was a pretty profound truth from a theologian of yesteryear. Let me remind you still as"
    },
    {
      "id": 41,
      "start": 246.75999450683594,
      "end": 250.67999267578125,
      "text": " we think about the kind of introduction to this thought this evening of dealing with"
    },
    {
      "id": 42,
      "start": 250.67999267578125,
      "end": 257.55999755859375,
      "text": " the Trinity, if you would turn to the book of Romans in the 11th chapter, Romans 11,"
    },
    {
      "id": 43,
      "start": 257.55999755859375,
      "end": 261.9599914550781,
      "text": " and we visited this portion of Scripture a number of weeks ago as we looked at the attributes"
    },
    {
      "id": 44,
      "start": 261.9599914550781,
      "end": 268.20001220703125,
      "text": " of God and dealt with the omniscience of God, the fact that He has perfect wisdom and all"
    },
    {
      "id": 45,
      "start": 268.20001220703125,
      "end": 272.760009765625,
      "text": " knowledge. The Bible says in Romans 11, beginning in verse 33,"
    },
    {
      "id": 46,
      "start": 272.760009765625,
      "end": 279.760009765625,
      "text": " O the depth of the riches both of the wisdom and knowledge of God! How unsearchable are"
    },
    {
      "id": 47,
      "start": 281.6000061035156,
      "end": 288.6000061035156,
      "text": " His judgments and His ways past finding out! For who hath known the mind of the Lord? Or"
    },
    {
      "id": 48,
      "start": 289.760009765625,
      "end": 294.7200012207031,
      "text": " who hath been His counselor? Or who hath first given to Him, and it shall be recompensed"
    },
    {
      "id": 49,
      "start": 294.7200012207031,
      "end": 299.79998779296875,
      "text": " unto Him again? For of Him and through Him and to Him are all things, to whom be glory"
    },
    {
      "id": 50,
      "start": 299.9599914550781,
      "end": 306.9599914550781,
      "text": " forever. Amen. Remember, we've mentioned on a couple of occasions the truth of Psalm 135"
    },
    {
      "id": 51,
      "start": 307.1199951171875,
      "end": 312.3599853515625,
      "text": " coupled with the truth of Psalm 145, where the psalmist declares, I know that the Lord"
    },
    {
      "id": 52,
      "start": 312.3599853515625,
      "end": 319.239990234375,
      "text": " is great. But then he says the greatness of God is unsearchable. And I believe, as I've"
    },
    {
      "id": 53,
      "start": 319.239990234375,
      "end": 324.239990234375,
      "text": " said often, that there is no contradiction between those two statements. The reality"
    },
    {
      "id": 54,
      "start": 324.239990234375,
      "end": 329.32000732421875,
      "text": " is that we know our God is great, but His greatness is unsearchable in the fact that"
    },
    {
      "id": 55,
      "start": 329.32000732421875,
      "end": 336.32000732421875,
      "text": " I can't fully comprehend just how great our God is. And this teaching of the Trinity"
    },
    {
      "id": 56,
      "start": 336.4800109863281,
      "end": 341.760009765625,
      "text": " that we find throughout the Word of God is of utmost importance. You know, things begin"
    },
    {
      "id": 57,
      "start": 341.760009765625,
      "end": 346.20001220703125,
      "text": " to fall apart if the Trinity were not true, and we'll look at some of those things here"
    },
    {
      "id": 58,
      "start": 346.20001220703125,
      "end": 352.20001220703125,
      "text": " in just a few moments as we get into the study this evening. And so it is an imperative truth"
    },
    {
      "id": 59,
      "start": 352.20001220703125,
      "end": 356.6400146484375,
      "text": " of the Word of God. I will say this also by way of introduction. It's interesting to know"
    },
    {
      "id": 60,
      "start": 356.8399963378906,
      "end": 361.2799987792969,
      "text": " as we looked at the names of God, and we spent the last two weeks looking at the names of"
    },
    {
      "id": 61,
      "start": 361.2799987792969,
      "end": 366.0799865722656,
      "text": " God, we looked at ten of them all in its entirety. Obviously there are more names that we could"
    },
    {
      "id": 62,
      "start": 366.0799865722656,
      "end": 373.0799865722656,
      "text": " have looked at, but two of those names that we dealt with are Elohim and Adonai. Elohim"
    },
    {
      "id": 63,
      "start": 373.9599914550781,
      "end": 380.2799987792969,
      "text": " and Adonai. It's interesting in the Hebrew that both of those words are plural, speaking"
    },
    {
      "id": 64,
      "start": 380.2799987792969,
      "end": 387.2799987792969,
      "text": " about a singular God. In the beginning, God, in Genesis chapter 1, the Hebrew word for"
    },
    {
      "id": 65,
      "start": 387.6199951171875,
      "end": 394.6199951171875,
      "text": " God is plural, but we find that it's speaking of a singular God. I would not say this evening"
    },
    {
      "id": 66,
      "start": 394.82000732421875,
      "end": 400.2799987792969,
      "text": " that the teaching and really looking at those two nouns, if you will, being the names of"
    },
    {
      "id": 67,
      "start": 400.2799987792969,
      "end": 407.2799987792969,
      "text": " God Elohim and Adonai, that them being plural would prove the Trinity in its entirety, but"
    },
    {
      "id": 68,
      "start": 407.2799987792969,
      "end": 412.32000732421875,
      "text": " certainly it helps us to understand how that from the beginning of the Word of God and"
    },
    {
      "id": 69,
      "start": 412.32000732421875,
      "end": 418.44000244140625,
      "text": " from the beginning of God's interaction with mankind, He was revealing this truth about"
    },
    {
      "id": 70,
      "start": 418.44000244140625,
      "end": 423.20001220703125,
      "text": " the Trinity. And as you look at progressive revelation, as you look at the fullness of"
    },
    {
      "id": 71,
      "start": 423.20001220703125,
      "end": 430.20001220703125,
      "text": " the Word of God and see how that God revealed all of this truth to us, how we can rejoice"
    },
    {
      "id": 72,
      "start": 430.6000061035156,
      "end": 436.3599853515625,
      "text": " in even the way that God used the names in the beginning of the Word of God. It is interesting"
    },
    {
      "id": 73,
      "start": 436.3599853515625,
      "end": 441.239990234375,
      "text": " the word Adonai, as we mentioned, it means Lord or Master, and often in the Old Testament,"
    },
    {
      "id": 74,
      "start": 441.239990234375,
      "end": 445.9200134277344,
      "text": " in fact, almost two-thirds of the time that the word is used in the Old Testament, it's"
    },
    {
      "id": 75,
      "start": 445.9200134277344,
      "end": 452.7200012207031,
      "text": " not referring to God, it's referring to a servant-master relationship, a ruler, a king,"
    },
    {
      "id": 76,
      "start": 452.7200012207031,
      "end": 458.8399963378906,
      "text": " something like that. But every time that word is used with dealing with a person, it's always"
    },
    {
      "id": 77,
      "start": 458.8399963378906,
      "end": 465.8399963378906,
      "text": " singular, Adonai. But when it's referring to God, Adonai, plural. And what a blessing"
    },
    {
      "id": 78,
      "start": 466.5199890136719,
      "end": 473.1600036621094,
      "text": " to see how that God would reveal this teaching of the Trinity, this truth of the Trinity"
    },
    {
      "id": 79,
      "start": 473.1600036621094,
      "end": 478.0799865722656,
      "text": " in that fashion. By way of introduction, continue, let me look at a few more verses of Scripture"
    },
    {
      "id": 80,
      "start": 478.0799865722656,
      "end": 483.8800048828125,
      "text": " and then we'll dig into some examples specifically. Look at Deuteronomy chapter 6, if you will."
    },
    {
      "id": 81,
      "start": 483.8800048828125,
      "end": 489.3999938964844,
      "text": " Deuteronomy chapter number 6 and verse number 4, and this is a very familiar passage of"
    },
    {
      "id": 82,
      "start": 489.3999938964844,
      "end": 494.760009765625,
      "text": " Scripture and we find that the children of Israel would have been extremely familiar"
    },
    {
      "id": 83,
      "start": 494.760009765625,
      "end": 499.79998779296875,
      "text": " with this portion of Scripture. In fact, they would have recited this regularly. In"
    },
    {
      "id": 84,
      "start": 499.79998779296875,
      "end": 506.239990234375,
      "text": " Deuteronomy 6 and verse number 4, the Bible says, Hear, O Israel, the Lord our God is"
    },
    {
      "id": 85,
      "start": 506.239990234375,
      "end": 513.280029296875,
      "text": " one Lord. We find that in the New Testament, if you look at the truth of the baptism of"
    },
    {
      "id": 86,
      "start": 513.280029296875,
      "end": 519.280029296875,
      "text": " Jesus Christ in Matthew chapter number 3, in verses 16 and 17, you'll see the Trinity"
    },
    {
      "id": 87,
      "start": 519.3200073242188,
      "end": 526.3200073242188,
      "text": " there as you see the Father, the Son, and the Holy Ghost. Notice in Matthew 3 and verses"
    },
    {
      "id": 88,
      "start": 526.3200073242188,
      "end": 531.3200073242188,
      "text": " 16 and 17, the Bible says, And Jesus, when he was baptized, went up straightway out of"
    },
    {
      "id": 89,
      "start": 531.3200073242188,
      "end": 536.0800170898438,
      "text": " the water. And, lo, the heavens were opened unto him, and he saw the Spirit of God descending"
    },
    {
      "id": 90,
      "start": 536.0800170898438,
      "end": 542.6799926757812,
      "text": " like a dove and lighting upon him. And, lo, a voice from heaven sang, This is my beloved"
    },
    {
      "id": 91,
      "start": 542.6799926757812,
      "end": 548.1199951171875,
      "text": " Son in whom I am well pleased. Again, if you're mindful of the Great Commission in Matthew"
    },
    {
      "id": 92,
      "start": 548.1199951171875,
      "end": 553.0399780273438,
      "text": " chapter 28 and verses 18 through 20, the Lord Jesus Christ is speaking and he gives"
    },
    {
      "id": 93,
      "start": 553.0399780273438,
      "end": 558.1199951171875,
      "text": " the commission to his disciples and he says this, Jesus came and spake unto them, saying,"
    },
    {
      "id": 94,
      "start": 558.1199951171875,
      "end": 563.2000122070312,
      "text": " All power is given unto me in heaven and in earth. Go ye therefore and teach all nations,"
    },
    {
      "id": 95,
      "start": 563.2000122070312,
      "end": 570.2000122070312,
      "text": " baptizing them in the, what does it say? Name, right? Singular, in the name of the Father"
    },
    {
      "id": 96,
      "start": 570.2000122070312,
      "end": 575.239990234375,
      "text": " and of the Son and of the Holy Ghost, teaching them to observe all things whatsoever I have"
    },
    {
      "id": 97,
      "start": 575.239990234375,
      "end": 580.3200073242188,
      "text": " commanded you. And, lo, I am with you always, even unto the end of the world. Amen. And"
    },
    {
      "id": 98,
      "start": 580.3200073242188,
      "end": 585.52001953125,
      "text": " Paul writes to the believers in Corinth and as he ends the second letter that he sends"
    },
    {
      "id": 99,
      "start": 585.52001953125,
      "end": 590.52001953125,
      "text": " to them in 2 Corinthians 13 and verse number 14, the Bible says, The grace of the Lord"
    },
    {
      "id": 100,
      "start": 590.52001953125,
      "end": 597.5599975585938,
      "text": " Jesus Christ and the love of God and the communion of the Holy Ghost be with you all. Amen."
    },
    {
      "id": 101,
      "start": 597.5599975585938,
      "end": 600.0399780273438,
      "text": " We think about the Trinity. It is one triune God."
    },
    {
      "id": 0,
      "start": 600.0399780273438,
      "end": 605.6799778938293,
      "text": " coexisting and eternally existing in three persons, God the Father, God the"
    },
    {
      "id": 1,
      "start": 605.6799778938293,
      "end": 610.2399778366089,
      "text": " Son, and God the Holy Spirit. Let's look at a few Old Testament examples, if you"
    },
    {
      "id": 2,
      "start": 610.2399778366089,
      "end": 614.0799779891968,
      "text": " will, and let's begin all the way back in Genesis 1 at creation, if you will."
    },
    {
      "id": 3,
      "start": 614.0799779891968,
      "end": 619.9199771881104,
      "text": " Genesis chapter number 1, verses 26 and 27, and I want you to notice in each of"
    },
    {
      "id": 4,
      "start": 619.9199771881104,
      "end": 624.7999782562256,
      "text": " these Old Testament passages that we'll look at, we'll see how that the"
    },
    {
      "id": 5,
      "start": 624.7999782562256,
      "end": 631.359977722168,
      "text": " reference is given to the truth of the Trinity, and as you go through"
    },
    {
      "id": 6,
      "start": 631.359977722168,
      "end": 637.5999794006348,
      "text": " the Scriptures, you see how that the package is more fully unfolded,"
    },
    {
      "id": 7,
      "start": 637.5999794006348,
      "end": 642.5999794006348,
      "text": " unpackaged for us, unwrapped for us, so that we can see this teaching and this"
    },
    {
      "id": 8,
      "start": 642.5999794006348,
      "end": 647.3999786376953,
      "text": " truth of the Trinity. But here in Genesis chapter number 1, in verses 26 and 27, the"
    },
    {
      "id": 9,
      "start": 647.3999786376953,
      "end": 659.359977722168,
      "text": " Bible says, and God said, let us make man in our image, after our likeness, and let"
    },
    {
      "id": 10,
      "start": 659.359977722168,
      "end": 662.7599792480469,
      "text": " them have dominion over the fish of the sea, and over the fowl of the air, and"
    },
    {
      "id": 11,
      "start": 662.7599792480469,
      "end": 666.2799758911133,
      "text": " over the cattle, and over all the earth, and over every creeping thing that"
    },
    {
      "id": 12,
      "start": 666.2799758911133,
      "end": 673.6399765014648,
      "text": " creepeth upon the earth. So God created man in his own image, and the image of"
    },
    {
      "id": 13,
      "start": 673.6399765014648,
      "end": 679.3199768066406,
      "text": " God created he him, male and female created he them. And so we look at some"
    },
    {
      "id": 14,
      "start": 679.3199768066406,
      "end": 683.7999801635742,
      "text": " Old Testament examples, and we start with the creation of man, and we find here in"
    },
    {
      "id": 15,
      "start": 683.7999801635742,
      "end": 689.9999771118164,
      "text": " our passage of Scripture that God said, let us make man in our image, after our"
    },
    {
      "id": 16,
      "start": 689.9999771118164,
      "end": 695.4399795532227,
      "text": " likeness. And again, we see in these Old Testament examples how that this"
    },
    {
      "id": 17,
      "start": 695.4399795532227,
      "end": 701.7599792480469,
      "text": " teaching, this truth, the reality of the Trinity, the triunity, the three-in-one,"
    },
    {
      "id": 18,
      "start": 701.7599792480469,
      "end": 707.3199768066406,
      "text": " that it is given to us right from the beginning of the Scriptures. The"
    },
    {
      "id": 19,
      "start": 707.3199768066406,
      "end": 710.5599746704102,
      "text": " Bible tells us not only here in Genesis chapter 1, but another example here in"
    },
    {
      "id": 20,
      "start": 710.5599746704102,
      "end": 714.6799774169922,
      "text": " the book of Genesis, in chapter 11. Turn over there just a few pages in"
    },
    {
      "id": 21,
      "start": 714.6799774169922,
      "end": 720.359977722168,
      "text": " your Bible, and Genesis chapter 11 is the record of the Tower of Babel. You'll be"
    },
    {
      "id": 22,
      "start": 720.359977722168,
      "end": 725.9599761962891,
      "text": " mindful through our study of the book of Genesis that not too long ago we looked"
    },
    {
      "id": 23,
      "start": 725.9599761962891,
      "end": 731.3199768066406,
      "text": " at this passage of Scripture, and we understood that which is taking place in"
    },
    {
      "id": 24,
      "start": 731.3599853515625,
      "end": 736.7999725341797,
      "text": " the way in which God would confound the languages. And in chapter 11, notice, if"
    },
    {
      "id": 25,
      "start": 736.7999725341797,
      "end": 739.7999725341797,
      "text": " you will, in verse number 2, it says, and it came to pass as they journeyed from"
    },
    {
      "id": 26,
      "start": 739.7999725341797,
      "end": 744.0799713134766,
      "text": " the east, they found a plain in the land of Shinar, and they dwelt there. And they"
    },
    {
      "id": 27,
      "start": 744.0799713134766,
      "end": 748.2399749755859,
      "text": " said one to another, go to, let us make brick, and burned them throughly. And they"
    },
    {
      "id": 28,
      "start": 748.2399749755859,
      "end": 752.9999847412109,
      "text": " had brick for stone, and slime had they for mortar. And God, excuse me, and they"
    },
    {
      "id": 29,
      "start": 752.9999847412109,
      "end": 757.1199798583984,
      "text": " said, go to, let us build us a city and a tower, whose top may reach into heaven,"
    },
    {
      "id": 30,
      "start": 757.1199798583984,
      "end": 761.1199798583984,
      "text": " and let us make us a name, lest we be scattered abroad upon the face of the"
    },
    {
      "id": 31,
      "start": 761.1199798583984,
      "end": 767.1599731445312,
      "text": " whole earth. And the Lord came down to see the city and the tower which the"
    },
    {
      "id": 32,
      "start": 767.1599731445312,
      "end": 771.9999847412109,
      "text": " children of men builded. And the Lord said, behold, the people is one, and they"
    },
    {
      "id": 33,
      "start": 771.9999847412109,
      "end": 776.47998046875,
      "text": " have all one language, and this they begin to do. And now nothing will be"
    },
    {
      "id": 34,
      "start": 776.47998046875,
      "end": 784.1599731445312,
      "text": " restrained from them which they have imagined to do. Go to, let us go down, and"
    },
    {
      "id": 35,
      "start": 784.1599731445312,
      "end": 790.5199737548828,
      "text": " there confound their languages, that they may not understand one another's speech."
    },
    {
      "id": 36,
      "start": 790.9999847412109,
      "end": 796.1199798583984,
      "text": " Again, another instance of this truth being given to us in the Old Testament"
    },
    {
      "id": 37,
      "start": 796.1199798583984,
      "end": 800.6799774169922,
      "text": " is Isaiah chapter number 6. So you see in Genesis 1, during the creation of man,"
    },
    {
      "id": 38,
      "start": 800.6799774169922,
      "end": 804.8799743652344,
      "text": " and Genesis chapter 11, the confounding of the languages, and Isaiah chapter"
    },
    {
      "id": 39,
      "start": 804.8799743652344,
      "end": 812.1199798583984,
      "text": " number 6, the call of Isaiah. The call of Isaiah. Isaiah chapter number 6, and we"
    },
    {
      "id": 40,
      "start": 812.1199798583984,
      "end": 816.8399810791016,
      "text": " are again familiar with this passage of Scripture. In fact, I referenced it on"
    },
    {
      "id": 41,
      "start": 816.8799743652344,
      "end": 821.8799743652344,
      "text": " Sunday evening during the message, but we look here in Isaiah chapter number 6,"
    },
    {
      "id": 42,
      "start": 821.8799743652344,
      "end": 827.5199737548828,
      "text": " and we find that Isaiah sees the Lord sitting upon a throne high and lifted up,"
    },
    {
      "id": 43,
      "start": 827.5199737548828,
      "end": 832.2399749755859,
      "text": " his train filled the temple. The Bible tells us after these things, this"
    },
    {
      "id": 44,
      "start": 832.2399749755859,
      "end": 835.3599853515625,
      "text": " interaction, we don't have time for reading all of it. I want to get to some"
    },
    {
      "id": 45,
      "start": 835.3599853515625,
      "end": 839.5599822998047,
      "text": " things in the New Testament examples here in just a moment, but look at verse"
    },
    {
      "id": 46,
      "start": 839.5599822998047,
      "end": 844.9599761962891,
      "text": " number 8. Isaiah speaking here, it says, also I heard the voice of the Lord saying,"
    },
    {
      "id": 47,
      "start": 844.9599761962891,
      "end": 855.1999816894531,
      "text": " whom shall I send, and who will go for us? Then said I, here am I, send me. And he"
    },
    {
      "id": 48,
      "start": 855.1999816894531,
      "end": 858.3199768066406,
      "text": " said, go and tell this people, hear ye indeed, but understand not, and see"
    },
    {
      "id": 49,
      "start": 858.3199768066406,
      "end": 863.9199829101562,
      "text": " indeed, but perceive not. And so again, we find in verse number 8 of Isaiah 6, this"
    },
    {
      "id": 50,
      "start": 863.9199829101562,
      "end": 870.6799926757812,
      "text": " reference, this teaching of the Trinity, this revelation to mankind in these"
    },
    {
      "id": 51,
      "start": 870.7999877929688,
      "end": 875.0399780273438,
      "text": " three examples from the Old Testament, the creation of man, the confounding of"
    },
    {
      "id": 52,
      "start": 875.0399780273438,
      "end": 880.9599914550781,
      "text": " the languages, and the call of Isaiah, how that the plural us is used in each one"
    },
    {
      "id": 53,
      "start": 880.9599914550781,
      "end": 886.8799743652344,
      "text": " of those examples. The Lord is speaking, and he says, let us. I don't know about you,"
    },
    {
      "id": 54,
      "start": 886.8799743652344,
      "end": 891.4399719238281,
      "text": " but if I'm doing something by myself, I don't say let us, let me, right? Because"
    },
    {
      "id": 55,
      "start": 891.4399719238281,
      "end": 898.1199645996094,
      "text": " it's a singular use of the proper use of language. Occasionally, we will hear"
    },
    {
      "id": 56,
      "start": 898.1199645996094,
      "end": 902.47998046875,
      "text": " somebody say something of, hey, we are gonna go do this, and you really"
    },
    {
      "id": 57,
      "start": 902.47998046875,
      "end": 906.6799926757812,
      "text": " understand that they are going to go do this, and they're saying we because"
    },
    {
      "id": 58,
      "start": 906.6799926757812,
      "end": 912.3199768066406,
      "text": " they're expecting you to help them, right? That's why they use the plural we. And so"
    },
    {
      "id": 59,
      "start": 912.3199768066406,
      "end": 918.7599792480469,
      "text": " we see that God, in each of these examples, is helping us to understand the"
    },
    {
      "id": 60,
      "start": 918.7599792480469,
      "end": 925.47998046875,
      "text": " reality of this Bible truth of the Trinity, the triunity, the three-in-one. As"
    },
    {
      "id": 61,
      "start": 925.5199890136719,
      "end": 929.239990234375,
      "text": " we go to the New Testament, look at some examples. What I'll do this evening is"
    },
    {
      "id": 62,
      "start": 929.239990234375,
      "end": 934.0399780273438,
      "text": " I'll give you the truth in the way in which the each person of the"
    },
    {
      "id": 63,
      "start": 934.0399780273438,
      "end": 937.2799682617188,
      "text": " Godhead, the Father, the Son, and the Holy Ghost, or the Holy Spirit, they're each"
    },
    {
      "id": 64,
      "start": 937.2799682617188,
      "end": 944.3999633789062,
      "text": " referred to as God. Why? Because they are. Three-in-one. Look at John 17. We'll start"
    },
    {
      "id": 65,
      "start": 944.3999633789062,
      "end": 951.0799865722656,
      "text": " first with the Father. In John chapter number 17, we often refer to this portion"
    },
    {
      "id": 66,
      "start": 951.0799865722656,
      "end": 955.9599914550781,
      "text": " of Scripture in John 17 as the Lord's Prayer. We understand that there is a"
    },
    {
      "id": 67,
      "start": 955.9599914550781,
      "end": 960.7599792480469,
      "text": " model prayer that He gives when the disciples say, teach us to pray. This, in"
    },
    {
      "id": 68,
      "start": 960.7599792480469,
      "end": 965.1999816894531,
      "text": " fact, is the Lord's Prayer when He's praying before He would go to the cross"
    },
    {
      "id": 69,
      "start": 965.1999816894531,
      "end": 969.8399658203125,
      "text": " of Calvary. And the Bible says this, these words spake Jesus and lifted up His eyes"
    },
    {
      "id": 70,
      "start": 969.8399658203125,
      "end": 974.6799926757812,
      "text": " to heaven and said, Father, the hour has come. Glorify Thy Son that Thy Son also"
    },
    {
      "id": 71,
      "start": 974.6799926757812,
      "end": 979.4399719238281,
      "text": " may glorify Thee. And Thou hast given Him power over all flesh that He should give"
    },
    {
      "id": 72,
      "start": 979.4399719238281,
      "end": 983.8399658203125,
      "text": " eternal life to as many as Thou hast given Him. And this is life eternal that"
    },
    {
      "id": 73,
      "start": 983.8399658203125,
      "end": 990.9999694824219,
      "text": " they might know Thee, the only true God, and Jesus Christ whom Thou hast sent. I"
    },
    {
      "id": 74,
      "start": 990.9999694824219,
      "end": 994.5999755859375,
      "text": " have glorified Thee on the earth. I have finished the work which Thou hast given"
    },
    {
      "id": 75,
      "start": 994.5999755859375,
      "end": 1000.3999633789062,
      "text": " me, which Thou gavest me to do. And now, O Father, glorify Thou me with Thine own"
    },
    {
      "id": 76,
      "start": 1000.3999633789062,
      "end": 1007.2799682617188,
      "text": " self, with the glory which I had with Thee before the world was. These five"
    },
    {
      "id": 77,
      "start": 1007.3599853515625,
      "end": 1012.3999633789062,
      "text": " verses of Scripture are so powerful in helping us to understand a number of"
    },
    {
      "id": 78,
      "start": 1012.3999633789062,
      "end": 1017.2799682617188,
      "text": " things about God. Of course, the eternality of Christ is in full view in"
    },
    {
      "id": 79,
      "start": 1017.2799682617188,
      "end": 1021.6399841308594,
      "text": " verse number five when He speaks about the fact that He would have, once again,"
    },
    {
      "id": 80,
      "start": 1021.6399841308594,
      "end": 1027.1999816894531,
      "text": " the glory that He had with the Father before the world was. And there are those"
    },
    {
      "id": 81,
      "start": 1027.1999816894531,
      "end": 1032.5599670410156,
      "text": " that would teach that Jesus is created. No, He is not a created being. He is God."
    },
    {
      "id": 82,
      "start": 1032.5599670410156,
      "end": 1036.1199645996094,
      "text": " And we'll get to that in just a moment, but we find here the eternality of"
    },
    {
      "id": 83,
      "start": 1036.1199645996094,
      "end": 1039.8399658203125,
      "text": " Christ is in view in verse number five. But we saw in verse number three where"
    },
    {
      "id": 84,
      "start": 1039.8399658203125,
      "end": 1044.8399658203125,
      "text": " that Jesus says, and this is life eternal, that they might know Thee, the one true,"
    },
    {
      "id": 85,
      "start": 1044.8399658203125,
      "end": 1050.1599731445312,
      "text": " or excuse me, the only true God, and Jesus Christ whom Thou hast sent. And so the"
    },
    {
      "id": 86,
      "start": 1050.1599731445312,
      "end": 1054.7999877929688,
      "text": " Father is the one, remember, in verse number one, as Jesus is praying, He says,"
    },
    {
      "id": 87,
      "start": 1054.7999877929688,
      "end": 1059.4399719238281,
      "text": " Father, the hour has come. Glorify Thy Son. And so the Father is referred to as God."
    },
    {
      "id": 88,
      "start": 1059.4399719238281,
      "end": 1065.47998046875,
      "text": " Why? Because He is. Jesus Christ is referred to as God. Why? Because He is. And"
    },
    {
      "id": 89,
      "start": 1065.47998046875,
      "end": 1071.719970703125,
      "text": " John chapter number one, a portion of Scripture that I quoted a part of it"
    },
    {
      "id": 90,
      "start": 1071.719970703125,
      "end": 1075.7599792480469,
      "text": " when we looked at first John 5 and verse number 7, it said the Word and how"
    },
    {
      "id": 91,
      "start": 1075.7599792480469,
      "end": 1079.6399841308594,
      "text": " that we may note that that's Jesus Christ, a title or a name that is given"
    },
    {
      "id": 92,
      "start": 1079.6399841308594,
      "end": 1083.3999633789062,
      "text": " to Him. And John 1 and verse number 1, the Bible says, in the beginning was the"
    },
    {
      "id": 93,
      "start": 1083.3999633789062,
      "end": 1088.8799743652344,
      "text": " Word, and the Word was with God, and the Word was God. The same was in the"
    },
    {
      "id": 94,
      "start": 1088.8799743652344,
      "end": 1092.6399841308594,
      "text": " beginning with God. All things were made by Him, and without Him was not anything"
    },
    {
      "id": 95,
      "start": 1092.8399658203125,
      "end": 1097.0799865722656,
      "text": " made that was made. If you look in verse number 14, the Bible says, and the Word"
    },
    {
      "id": 96,
      "start": 1097.0799865722656,
      "end": 1102.1199645996094,
      "text": " was made flesh and dwelt among us, and we beheld His glory, the glory as of the"
    },
    {
      "id": 97,
      "start": 1102.1199645996094,
      "end": 1107.1999816894531,
      "text": " only begotten of the Father, full of grace and truth. And so we see here in"
    },
    {
      "id": 98,
      "start": 1107.1999816894531,
      "end": 1113.1199951171875,
      "text": " John chapter number one, that in the beginning was the Word. We know that the"
    },
    {
      "id": 99,
      "start": 1113.1199951171875,
      "end": 1119.0799560546875,
      "text": " Word is Jesus Christ, and in verse number one it says, and the Word was God. But not"
    },
    {
      "id": 100,
      "start": 1119.0799560546875,
      "end": 1122.5199584960938,
      "text": " only there, I want you to look at a few other examples. Look at Acts chapter"
    },
    {
      "id": 101,
      "start": 1122.5199584960938,
      "end": 1127.5999755859375,
      "text": " 20, if you will. And Acts chapter number 20, and I'm gonna spend a bulk of time"
    },
    {
      "id": 102,
      "start": 1127.5999755859375,
      "end": 1130.4400024414062,
      "text": " here. I've kind of gone quickly this evening, but I want to spend a bulk of"
    },
    {
      "id": 103,
      "start": 1130.4400024414062,
      "end": 1135.199951171875,
      "text": " time on this truth, this aspect of the teaching of the Trinity that Jesus is"
    },
    {
      "id": 104,
      "start": 1135.199951171875,
      "end": 1140.3999633789062,
      "text": " God, because that is the most attack thing today. There are a few cults and"
    },
    {
      "id": 105,
      "start": 1140.3999633789062,
      "end": 1148.2799682617188,
      "text": " some major world religions that attack the teaching that Jesus is God, and we"
    },
    {
      "id": 106,
      "start": 1148.2799682617188,
      "end": 1152.0399780273438,
      "text": " need to understand that this is a very prominent thing that's going on in our"
    },
    {
      "id": 107,
      "start": 1152.0399780273438,
      "end": 1158.6799926757812,
      "text": " world today, through the world religions and also through the cults, and we"
    },
    {
      "id": 108,
      "start": 1158.6799926757812,
      "end": 1162.719970703125,
      "text": " need to be grounded and settled, and we need to know what the Word of God says,"
    },
    {
      "id": 109,
      "start": 1162.719970703125,
      "end": 1169.1599731445312,
      "text": " because they will take the scriptures, they'll twist things around, and they can"
    },
    {
      "id": 110,
      "start": 1169.1599731445312,
      "end": 1172.7999877929688,
      "text": " get you all kinds of sideways if you're not careful, and that's why we're to be"
    },
    {
      "id": 111,
      "start": 1172.7999877929688,
      "end": 1176.5599975585938,
      "text": " settled and grounded in the truth. Look in Acts chapter 20. Contextually, the"
    },
    {
      "id": 112,
      "start": 1176.5599975585938,
      "end": 1180.4400024414062,
      "text": " Apostle Paul is speaking to the church leaders from Ephesus, and notice what he"
    },
    {
      "id": 113,
      "start": 1180.4400024414062,
      "end": 1182.5199584960938,
      "text": " says in verse number 28."
    },
    {
      "id": 0,
      "start": 1182.5199584960938,
      "end": 1187.9999585151672,
      "text": " blood on the cross of Calvary? Jesus Christ. And it says here, it says that"
    },
    {
      "id": 1,
      "start": 1187.9999585151672,
      "end": 1193.879958152771,
      "text": " you would feed the church of God which He hath purchased with His own blood."
    },
    {
      "id": 2,
      "start": 1193.879958152771,
      "end": 1197.959958076477,
      "text": " Why is Paul able to say it that way? Because Jesus is God. And there's no"
    },
    {
      "id": 3,
      "start": 1197.959958076477,
      "end": 1204.559959411621,
      "text": " contradiction whatsoever. Yes, indeed, God in flesh, He died on the cross of"
    },
    {
      "id": 4,
      "start": 1204.559959411621,
      "end": 1209.7199592590332,
      "text": " Calvary to pay for the sin of mankind. Notice in the book of Hebrews, if you"
    },
    {
      "id": 5,
      "start": 1209.7199592590332,
      "end": 1214.1599578857422,
      "text": " will, Hebrews chapter number one, we spent much time back in January as we"
    },
    {
      "id": 6,
      "start": 1214.1599578857422,
      "end": 1218.279956817627,
      "text": " started preaching through the book of Hebrews to look at this truth with"
    },
    {
      "id": 7,
      "start": 1218.279956817627,
      "end": 1225.5999603271484,
      "text": " regard to the the Lord Jesus Christ being referred to as God, because He is."
    },
    {
      "id": 8,
      "start": 1225.5999603271484,
      "end": 1232.3599586486816,
      "text": " And in the particular passage, really in verses 5 down through the the end of the"
    },
    {
      "id": 9,
      "start": 1232.3599586486816,
      "end": 1236.9599571228027,
      "text": " chapter, He is dealing with the fact that Jesus is superior to the angels. And we"
    },
    {
      "id": 10,
      "start": 1236.99995803833,
      "end": 1240.7599601745605,
      "text": " said many things about that, and we'll mention a few of those this evening as"
    },
    {
      "id": 11,
      "start": 1240.7599601745605,
      "end": 1244.6399574279785,
      "text": " well. But notice what it says in verse number 6, and again, when He bringeth in"
    },
    {
      "id": 12,
      "start": 1244.6399574279785,
      "end": 1249.1999588012695,
      "text": " the first begotten of the world, He saith, and let all the angels of God worship"
    },
    {
      "id": 13,
      "start": 1249.1999588012695,
      "end": 1255.8799591064453,
      "text": " Him. You understand that angels are not worshipped, but Christ is worshipped. Why?"
    },
    {
      "id": 14,
      "start": 1255.8799591064453,
      "end": 1262.8799591064453,
      "text": " Because He is God. We find that in verse number 8, it says, but unto the Son He"
    },
    {
      "id": 15,
      "start": 1262.9199600219727,
      "end": 1267.9999618530273,
      "text": " saith, this is God the Father speaking as we look at the verse here, but unto the"
    },
    {
      "id": 16,
      "start": 1267.9999618530273,
      "end": 1272.6799621582031,
      "text": " Son He saith, thy throne, O God, is forever and ever. A scepter of"
    },
    {
      "id": 17,
      "start": 1272.6799621582031,
      "end": 1277.9999618530273,
      "text": " righteousness is the scepter of thy kingdom. And why is God the Father"
    },
    {
      "id": 18,
      "start": 1277.9999618530273,
      "end": 1284.7799606323242,
      "text": " referring to the Son as God, O God, forever and ever? Thy throne, O God, is"
    },
    {
      "id": 19,
      "start": 1284.7799606323242,
      "end": 1290.9599609375,
      "text": " forever and ever. Why? Because He is. He's God. We find here, we think about angels"
    },
    {
      "id": 20,
      "start": 1291.0399551391602,
      "end": 1297.2399597167969,
      "text": " in the context of Hebrews chapter 1, we find that the angels, in fact, were there"
    },
    {
      "id": 21,
      "start": 1297.2399597167969,
      "end": 1302.6799621582031,
      "text": " announcing the birth of Christ, and they're singing the praises in glory to"
    },
    {
      "id": 22,
      "start": 1302.6799621582031,
      "end": 1307.1199569702148,
      "text": " God in the highest, and so on and so forth. And we find throughout the Word of"
    },
    {
      "id": 23,
      "start": 1307.1199569702148,
      "end": 1311.3199615478516,
      "text": " God that angels are never worshipped. In fact, in the book of Revelation, when"
    },
    {
      "id": 24,
      "start": 1311.3199615478516,
      "end": 1316.439956665039,
      "text": " there's an angel that's giving some of those truths to John, and John's"
    },
    {
      "id": 25,
      "start": 1316.439956665039,
      "end": 1322.1199645996094,
      "text": " ready to worship, he says, no, worship God. Don't worship me. Don't worship an"
    },
    {
      "id": 26,
      "start": 1322.1199645996094,
      "end": 1328.9199523925781,
      "text": " angel. You worship God. And so, if we're to worship God, if Jesus is not God, then"
    },
    {
      "id": 27,
      "start": 1328.9199523925781,
      "end": 1332.9599609375,
      "text": " there's a problem in the fact that throughout the gospel records we find"
    },
    {
      "id": 28,
      "start": 1332.9599609375,
      "end": 1338.9599609375,
      "text": " many examples of Jesus accepting worship. Why would He accept worship? Because He's"
    },
    {
      "id": 29,
      "start": 1338.9599609375,
      "end": 1344.2399597167969,
      "text": " God. Remember when, let me share a couple of examples, and then I'll say that. Look"
    },
    {
      "id": 30,
      "start": 1344.2399597167969,
      "end": 1349.719955444336,
      "text": " in Matthew chapter number 2, if you will. In Matthew chapter number 2, and this is"
    },
    {
      "id": 31,
      "start": 1349.719955444336,
      "end": 1353.8399658203125,
      "text": " a portion of Scripture that we're familiar with during the season that is"
    },
    {
      "id": 32,
      "start": 1353.8399658203125,
      "end": 1359.1599578857422,
      "text": " coming near upon us, the Christmas season. And speaking about the birth of our"
    },
    {
      "id": 33,
      "start": 1359.1599578857422,
      "end": 1363.5199584960938,
      "text": " Savior in Matthew 2, in verse number 11, it says, when they were coming to the"
    },
    {
      "id": 34,
      "start": 1363.5199584960938,
      "end": 1367.9999542236328,
      "text": " house, they saw the young child with Mary his mother, fell down and worshipped him."
    },
    {
      "id": 35,
      "start": 1368.199951171875,
      "end": 1374.2799530029297,
      "text": " And they worshipped Mary, they worshipped him, and remember they asked Herod, where is"
    },
    {
      "id": 36,
      "start": 1374.2799530029297,
      "end": 1378.439956665039,
      "text": " he that is born King of the Jews? In verse number 2, and they worship and they"
    },
    {
      "id": 37,
      "start": 1378.439956665039,
      "end": 1381.9199523925781,
      "text": " present gifts. It says, when they opened their treasures, they presented unto him"
    },
    {
      "id": 38,
      "start": 1381.9199523925781,
      "end": 1386.8399658203125,
      "text": " gifts, gold and frankincense and myrrh. Look over in chapter number 8 of the"
    },
    {
      "id": 39,
      "start": 1386.8399658203125,
      "end": 1389.5199584960938,
      "text": " book of Matthew. We'll just look at a few examples right here in the book of"
    },
    {
      "id": 40,
      "start": 1389.5199584960938,
      "end": 1394.8799591064453,
      "text": " Matthew. In chapter number 8, in verse number 1, the Bible says, when he was"
    },
    {
      "id": 41,
      "start": 1394.8799591064453,
      "end": 1398.7599639892578,
      "text": " come down from the mountain, great multitudes followed him. And behold, there"
    },
    {
      "id": 42,
      "start": 1398.7599639892578,
      "end": 1405.3199615478516,
      "text": " came a leper and worshipped him, saying, Lord, if thou wilt, thou canst make me"
    },
    {
      "id": 43,
      "start": 1405.3199615478516,
      "end": 1411.0399627685547,
      "text": " clean. Of course, Jesus healed the man, but we find here that Jesus accepted and"
    },
    {
      "id": 44,
      "start": 1411.0399627685547,
      "end": 1416.9599609375,
      "text": " received the worship of this one. In chapter 9, in verse number 18, the Bible"
    },
    {
      "id": 45,
      "start": 1416.9599609375,
      "end": 1421.0399627685547,
      "text": " gives us another example. While he spake these things unto them, behold, there came"
    },
    {
      "id": 46,
      "start": 1421.0399627685547,
      "end": 1425.7599639892578,
      "text": " a certain ruler and worshipped him, saying, My daughter is even now dead, but"
    },
    {
      "id": 47,
      "start": 1425.7599639892578,
      "end": 1432.0399627685547,
      "text": " come and lay thy hand upon her, and she shall live. There are many other examples"
    },
    {
      "id": 48,
      "start": 1432.0399627685547,
      "end": 1435.3599548339844,
      "text": " that we could give you this evening in the gospel records, and I would"
    },
    {
      "id": 49,
      "start": 1435.3599548339844,
      "end": 1439.0799560546875,
      "text": " encourage you to read through the Gospels and to take note of the times in"
    },
    {
      "id": 50,
      "start": 1439.0799560546875,
      "end": 1444.5599670410156,
      "text": " which Jesus received worship. Why? Because He's God. It was absolutely"
    },
    {
      "id": 51,
      "start": 1444.5599670410156,
      "end": 1450.199951171875,
      "text": " appropriate for them to worship Jesus Christ because Jesus is God. If He was"
    },
    {
      "id": 52,
      "start": 1450.199951171875,
      "end": 1455.5599670410156,
      "text": " not God, He would not have received worship. You know, there was a time in"
    },
    {
      "id": 53,
      "start": 1455.5599670410156,
      "end": 1458.2399597167969,
      "text": " which Paul, as he's on a missionary journey, that they were gonna worship"
    },
    {
      "id": 54,
      "start": 1458.2399597167969,
      "end": 1462.9599609375,
      "text": " Paul. They were gonna present offerings. What did Paul do? No, don't do that. I'm"
    },
    {
      "id": 55,
      "start": 1462.9599609375,
      "end": 1466.9999694824219,
      "text": " not. I'm trying to point you to the true living God. If someone came to try to"
    },
    {
      "id": 56,
      "start": 1466.9999694824219,
      "end": 1471.2799682617188,
      "text": " worship you, what would you do? Would you let him worship you? I'm not worthy of"
    },
    {
      "id": 57,
      "start": 1471.2799682617188,
      "end": 1476.8399658203125,
      "text": " worship, but Jesus is God, and therefore He accepted and He was worshipped. In"
    },
    {
      "id": 58,
      "start": 1477.199951171875,
      "end": 1480.8399658203125,
      "text": " Mark chapter number 2, again, we don't have time to look through the entirety"
    },
    {
      "id": 59,
      "start": 1480.8399658203125,
      "end": 1484.5999450683594,
      "text": " of the passage, but I want you to remember what's happening here in Mark"
    },
    {
      "id": 60,
      "start": 1484.5999450683594,
      "end": 1489.7599487304688,
      "text": " chapter number 2 and give you some feed for thought, some looking at this"
    },
    {
      "id": 61,
      "start": 1489.7599487304688,
      "end": 1494.9999694824219,
      "text": " passage maybe later and studying through it. Jesus is teaching and a great"
    },
    {
      "id": 62,
      "start": 1494.9999694824219,
      "end": 1499.199951171875,
      "text": " group of people are gathered together, and these four want to bring their"
    },
    {
      "id": 63,
      "start": 1499.199951171875,
      "end": 1503.2399597167969,
      "text": " friend that was sick of the palsy. The Bible says that he was born of four. They"
    },
    {
      "id": 64,
      "start": 1503.2399597167969,
      "end": 1505.9599609375,
      "text": " couldn't get in because of how many people. They had to let him down through"
    },
    {
      "id": 65,
      "start": 1505.9599609375,
      "end": 1511.8399658203125,
      "text": " the the roof, and the Bible says that Jesus says to him, look in verse number"
    },
    {
      "id": 66,
      "start": 1511.8399658203125,
      "end": 1517.8799438476562,
      "text": " 5, when Jesus saw their faith, He said unto the sick of the palsy, Son, thy sins"
    },
    {
      "id": 67,
      "start": 1517.8799438476562,
      "end": 1522.3199462890625,
      "text": " be forgiven thee. Now, there are people there that were sitting by that were"
    },
    {
      "id": 68,
      "start": 1522.3199462890625,
      "end": 1525.719970703125,
      "text": " observing, some that were there for the right reason, trying to hear Jesus teach"
    },
    {
      "id": 69,
      "start": 1525.719970703125,
      "end": 1529.1599731445312,
      "text": " and wanted to hear the Word. There were others that were there seeking to"
    },
    {
      "id": 70,
      "start": 1529.1599731445312,
      "end": 1533.7599487304688,
      "text": " scribes, Pharisees, Sadducees, that were always looking to accuse the Lord Jesus"
    },
    {
      "id": 71,
      "start": 1533.7599487304688,
      "end": 1537.2399597167969,
      "text": " Christ of something wrong, and here the Bible says that there were some of the"
    },
    {
      "id": 72,
      "start": 1537.2399597167969,
      "end": 1540.199951171875,
      "text": " scribes. Notice in verse number 6, but there were certain of the scribes"
    },
    {
      "id": 73,
      "start": 1540.199951171875,
      "end": 1545.8799438476562,
      "text": " sitting there and reasoning in their hearts. Why doth this man thus speak"
    },
    {
      "id": 74,
      "start": 1545.8799438476562,
      "end": 1553.8399658203125,
      "text": " blasphemies? Who can forgive sins but God only? They're right. Only God can forgive"
    },
    {
      "id": 75,
      "start": 1553.8399658203125,
      "end": 1560.6799621582031,
      "text": " sins. You know, the priest can't forgive you of any sins, right? There's a whole"
    },
    {
      "id": 76,
      "start": 1560.6799621582031,
      "end": 1566.8799438476562,
      "text": " host of people that have been blinded by those false teachings. Only God can"
    },
    {
      "id": 77,
      "start": 1566.8799438476562,
      "end": 1571.7999572753906,
      "text": " forgive sins. They're right. Notice what is said here. Immediately when Jesus"
    },
    {
      "id": 78,
      "start": 1571.7999572753906,
      "end": 1574.9199523925781,
      "text": " perceived in the Spirit that they had so reasoned within themselves, He said unto"
    },
    {
      "id": 79,
      "start": 1574.9199523925781,
      "end": 1579.7599487304688,
      "text": " them, Why reason ye these things in your hearts? Whether is it easier to say to"
    },
    {
      "id": 80,
      "start": 1579.7599487304688,
      "end": 1582.7599487304688,
      "text": " the sick of the palsy, Thy sins be forgiven thee, or to say, Arise and take"
    },
    {
      "id": 81,
      "start": 1582.7599487304688,
      "end": 1587.6799621582031,
      "text": " up thy bed and walk? But that ye may know that the Son of Man hath power on earth"
    },
    {
      "id": 82,
      "start": 1587.6799621582031,
      "end": 1592.1599731445312,
      "text": " to forgive sins. And then He turns to the man that was sick of the palsy. You"
    },
    {
      "id": 83,
      "start": 1592.1599731445312,
      "end": 1594.9599609375,
      "text": " got to see it, you got to understand what's happening. He's talking to these"
    },
    {
      "id": 84,
      "start": 1594.9599609375,
      "end": 1600.5199584960938,
      "text": " scribes that rightfully say, Who can forgive sins but God only? And He"
    },
    {
      "id": 85,
      "start": 1600.5199584960938,
      "end": 1603.2399597167969,
      "text": " says this to the scribes, and then He looks to the man that's sick of the"
    },
    {
      "id": 86,
      "start": 1603.2399597167969,
      "end": 1607.8399658203125,
      "text": " palsy, and He says to him, Arise, take up thy bed, and go thy way into thine house."
    },
    {
      "id": 87,
      "start": 1607.8399658203125,
      "end": 1615.3199462890625,
      "text": " And he arose, and he went. Jesus said in verse number 10 that ye may know that"
    },
    {
      "id": 88,
      "start": 1615.3199462890625,
      "end": 1621.7999572753906,
      "text": " the Son of Man hath power on earth to forgive sins. He's God. He's God. We could"
    },
    {
      "id": 89,
      "start": 1621.7999572753906,
      "end": 1626.5199584960938,
      "text": " look at a whole host of examples this evening throughout these pages of the"
    },
    {
      "id": 90,
      "start": 1626.5199584960938,
      "end": 1632.5199584960938,
      "text": " New Testament and find evidence that Christ is Messiah. We speak about His"
    },
    {
      "id": 91,
      "start": 1632.5199584960938,
      "end": 1636.1599731445312,
      "text": " incarnation as deity, and we'll look at some of those things as we transition"
    },
    {
      "id": 92,
      "start": 1636.1599731445312,
      "end": 1639.6799621582031,
      "text": " from the doctrine of God theology to the doctrine of Christ, and we'll begin"
    },
    {
      "id": 93,
      "start": 1639.6799621582031,
      "end": 1644.5599670410156,
      "text": " looking at that in a couple of weeks. And we will make more mention and more"
    },
    {
      "id": 94,
      "start": 1644.5999450683594,
      "end": 1649.2799682617188,
      "text": " reference to these things, but we find that Jesus Christ is God. The teaching of"
    },
    {
      "id": 95,
      "start": 1649.2799682617188,
      "end": 1652.719970703125,
      "text": " the Trinity here in the New Testament, God the Father is referred to as God"
    },
    {
      "id": 96,
      "start": 1652.719970703125,
      "end": 1657.2399597167969,
      "text": " because He is. The Lord Jesus Christ is referred to as God. Why? Because He is. He"
    },
    {
      "id": 97,
      "start": 1657.2399597167969,
      "end": 1662.719970703125,
      "text": " receives worship as God because He is. He mentions about forgiving sins, and what"
    },
    {
      "id": 98,
      "start": 1662.719970703125,
      "end": 1668.1599731445312,
      "text": " a blessing. Notice in Acts chapter number 5, the final reference, remember the"
    },
    {
      "id": 99,
      "start": 1668.1599731445312,
      "end": 1673.1599731445312,
      "text": " triunity, the three-in-one, God the Father, God the Son, and God the Holy Spirit. In"
    },
    {
      "id": 100,
      "start": 1673.1599731445312,
      "end": 1679.6799621582031,
      "text": " Acts chapter number 5, a portion of Scripture in the early church, there"
    },
    {
      "id": 101,
      "start": 1679.6799621582031,
      "end": 1683.5599670410156,
      "text": " were Ananias and Sapphira. They were gonna sell a possession, remember, and"
    },
    {
      "id": 102,
      "start": 1683.5599670410156,
      "end": 1687.6799621582031,
      "text": " they had made this agreement amongst themselves. They're gonna hold back a"
    },
    {
      "id": 103,
      "start": 1687.6799621582031,
      "end": 1692.1199645996094,
      "text": " portion of what their proceeds were from the sale, but yet they were gonna come in"
    },
    {
      "id": 104,
      "start": 1692.1199645996094,
      "end": 1698.719970703125,
      "text": " and act as if they were gonna give everything. And the reality is that Peter"
    },
    {
      "id": 105,
      "start": 1698.719970703125,
      "end": 1702.2799682617188,
      "text": " deals with them and says, listen, you didn't have to sell it, and even after"
    },
    {
      "id": 106,
      "start": 1702.2799682617188,
      "end": 1705.679931640625,
      "text": " you did, you didn't have to give all of it, but there's an important truth that"
    },
    {
      "id": 107,
      "start": 1705.679931640625,
      "end": 1711.1199340820312,
      "text": " is given here. Again, sometimes we look at maybe the account and the"
    },
    {
      "id": 108,
      "start": 1711.1199340820312,
      "end": 1715.2799682617188,
      "text": " circumstances in which we're dealing with in the dialogue, and perhaps we"
    },
    {
      "id": 109,
      "start": 1715.2799682617188,
      "end": 1718.5199584960938,
      "text": " could miss some truth. And in verse number 1, it says this, but a certain man"
    },
    {
      "id": 110,
      "start": 1718.5199584960938,
      "end": 1722.8799438476562,
      "text": " named Ananias with Sapphira, his wife, sold a possession and kept back a part"
    },
    {
      "id": 111,
      "start": 1722.8799438476562,
      "end": 1726.3199462890625,
      "text": " of the price, his wife also being privy to it, and brought a certain part and"
    },
    {
      "id": 112,
      "start": 1726.3199462890625,
      "end": 1732.5599365234375,
      "text": " laid it at the apostle's feet. But Peter said, Ananias, why hath Satan filled thine"
    },
    {
      "id": 113,
      "start": 1732.5599365234375,
      "end": 1739.3999633789062,
      "text": " heart to lie to the Holy Ghost and to keep back part of the price of the land?"
    },
    {
      "id": 114,
      "start": 1739.3999633789062,
      "end": 1744.47998046875,
      "text": " So according to verse number 3, who did Ananias lie to? The Holy Ghost, the Holy"
    },
    {
      "id": 115,
      "start": 1744.47998046875,
      "end": 1750.3999633789062,
      "text": " Spirit. Verse number 4, while it remained, was it not thine own? And after it was"
    },
    {
      "id": 116,
      "start": 1750.3999633789062,
      "end": 1755.43994140625,
      "text": " sold, was it not in thine own power? Why hast thou conceived this thing in thine"
    },
    {
      "id": 117,
      "start": 1755.47998046875,
      "end": 1763.9199829101562,
      "text": " heart? Thou hast not lied unto men, but unto God. But unto God. Why? Because the"
    },
    {
      "id": 118,
      "start": 1763.9199829101562,
      "end": 1769.8399658203125,
      "text": " Holy Spirit is God, right? In verse number 3, Peter says, listen Ananias, Satan has"
    },
    {
      "id": 119,
      "start": 1769.8399658203125,
      "end": 1774.43994140625,
      "text": " filled your heart. He says, why hath Satan filled thine heart to lie to the Holy"
    },
    {
      "id": 120,
      "start": 1774.43994140625,
      "end": 1778.1199340820312,
      "text": " Ghost? And he goes through and he tells him, listen, you didn't have to sell the"
    },
    {
      "id": 121,
      "start": 1778.1199340820312,
      "end": 1782.1599731445312,
      "text": " possession. After you sold it, you didn't have to give all of the proceeds to the"
    },
    {
      "id": 122,
      "start": 1782.1599731445312,
      "end": 1784.43994140625,
      "text": " church."
    },
    {
      "id": 0,
      "start": 1784.43994140625,
      "end": 1789.519941329956,
      "text": " but you came as if that's what you did and you didn't lie to man you lied to"
    },
    {
      "id": 1,
      "start": 1789.519941329956,
      "end": 1797.3399410247803,
      "text": " God the Holy Spirit is God and by the way I want you to consider this truth we"
    },
    {
      "id": 2,
      "start": 1797.3399410247803,
      "end": 1800.8799419403076,
      "text": " see it here in Acts chapter 5 that the Holy Spirit is the Holy Ghost referred"
    },
    {
      "id": 3,
      "start": 1800.8799419403076,
      "end": 1806.1999416351318,
      "text": " to as God be mindful with me in 2nd Timothy chapter number 3 of a great"
    },
    {
      "id": 4,
      "start": 1806.1999416351318,
      "end": 1812.599941253662,
      "text": " truth that we have with regard to the the Word of God the inspiration of God's"
    },
    {
      "id": 5,
      "start": 1812.599941253662,
      "end": 1818.1599426269531,
      "text": " Word in 2nd Timothy 3 in verse number 16 it's a verse that we often quote the"
    },
    {
      "id": 6,
      "start": 1818.1599426269531,
      "end": 1823.6399421691895,
      "text": " Bible says all scripture is given by inspiration of God and it's profitable"
    },
    {
      "id": 7,
      "start": 1823.6399421691895,
      "end": 1826.839942932129,
      "text": " for doctrine for a proof for correction for instruction and righteousness that"
    },
    {
      "id": 8,
      "start": 1826.839942932129,
      "end": 1831.2399406433105,
      "text": " the man of God may be perfect throughly furnished unto all good works now we"
    },
    {
      "id": 9,
      "start": 1831.2399406433105,
      "end": 1836.1999397277832,
      "text": " understand inspiration God breathed we understand that this book is God's Word"
    },
    {
      "id": 10,
      "start": 1836.1999397277832,
      "end": 1841.9199409484863,
      "text": " to man and what a blessing that is I am so thankful for the Word of God Peter"
    },
    {
      "id": 11,
      "start": 1841.9199409484863,
      "end": 1848.6799392700195,
      "text": " says this in 2nd Peter chapter number 1 in verses 19 through 21 and again"
    },
    {
      "id": 12,
      "start": 1848.6799392700195,
      "end": 1853.3599395751953,
      "text": " there's no contradiction because the Holy Spirit the Holy Ghost is God and"
    },
    {
      "id": 13,
      "start": 1853.3599395751953,
      "end": 1858.1199417114258,
      "text": " notice in verse number 19 Peter says we have also a more sure word of prophecy"
    },
    {
      "id": 14,
      "start": 1858.1199417114258,
      "end": 1861.9999389648438,
      "text": " where unto you do well that you take heed as into a light that shineth in a"
    },
    {
      "id": 15,
      "start": 1861.9999389648438,
      "end": 1866.1199417114258,
      "text": " dark place until the day dawn and the day star rise in your hearts knowing"
    },
    {
      "id": 16,
      "start": 1866.1199417114258,
      "end": 1869.8799438476562,
      "text": " this first that no prophecy of the scriptures of any private interpretation"
    },
    {
      "id": 17,
      "start": 1869.8799438476562,
      "end": 1874.3999404907227,
      "text": " for the prophecy came not an old time by the will of man but holy men of God"
    },
    {
      "id": 18,
      "start": 1874.3999404907227,
      "end": 1881.9199447631836,
      "text": " spake as they were moved by the Holy Ghost and we understand as we would read"
    },
    {
      "id": 19,
      "start": 1881.9199447631836,
      "end": 1887.43994140625,
      "text": " this portion of Scripture that the the Holy Spirit would lead these men again"
    },
    {
      "id": 20,
      "start": 1887.43994140625,
      "end": 1891.9599380493164,
      "text": " everything that Paul wrote or said wasn't Scripture but when he was"
    },
    {
      "id": 21,
      "start": 1891.9599380493164,
      "end": 1896.43994140625,
      "text": " speaking when he was writing Scripture of course the Holy Ghost would move upon"
    },
    {
      "id": 22,
      "start": 1896.43994140625,
      "end": 1900.0799407958984,
      "text": " him the Holy Spirit of God and all Scripture is given by inspiration of God"
    },
    {
      "id": 23,
      "start": 1900.0799407958984,
      "end": 1904.319938659668,
      "text": " and when we think about that truth this evening if the Holy Spirit the Holy"
    },
    {
      "id": 24,
      "start": 1904.319938659668,
      "end": 1908.319938659668,
      "text": " Ghost moved upon men and obviously referring to the Old Testament writings"
    },
    {
      "id": 25,
      "start": 1908.319938659668,
      "end": 1913.1599426269531,
      "text": " here contextually and of course the entirety of the Word of God the question"
    },
    {
      "id": 26,
      "start": 1913.1599426269531,
      "end": 1917.7199401855469,
      "text": " would be if the Holy Spirit is not God then how would we say that this is the"
    },
    {
      "id": 27,
      "start": 1917.7199401855469,
      "end": 1923.0799407958984,
      "text": " Word of God the Holy Spirit's not God but he is God and so therefore there's"
    },
    {
      "id": 28,
      "start": 1923.0799407958984,
      "end": 1927.3199462890625,
      "text": " no contradiction for us to say that this is the Word of God all Scripture is"
    },
    {
      "id": 29,
      "start": 1927.3199462890625,
      "end": 1931.919937133789,
      "text": " given by inspiration of God and oh by the way the operation of that the"
    },
    {
      "id": 30,
      "start": 1931.919937133789,
      "end": 1935.919937133789,
      "text": " outworking of how that happened was that the Holy Ghost came upon men and they"
    },
    {
      "id": 31,
      "start": 1935.919937133789,
      "end": 1942.7599487304688,
      "text": " spoke and that was the Word of God why because the Holy Spirit is God and so"
    },
    {
      "id": 32,
      "start": 1942.7599487304688,
      "end": 1946.5199432373047,
      "text": " this evening as we think about the subject of the Trinity it's an important"
    },
    {
      "id": 33,
      "start": 1946.5199432373047,
      "end": 1950.9999389648438,
      "text": " subject matter it's an important scriptural reality and it is important"
    },
    {
      "id": 34,
      "start": 1950.9999389648438,
      "end": 1956.199935913086,
      "text": " for us as we look at the truth of the Trinity to really understand and grasp"
    },
    {
      "id": 35,
      "start": 1956.199935913086,
      "end": 1960.919937133789,
      "text": " it to the best of our ability understanding that God has given the"
    },
    {
      "id": 36,
      "start": 1960.919937133789,
      "end": 1967.2399444580078,
      "text": " truth in his Word and we accept it by faith and we we trust that what God has"
    },
    {
      "id": 37,
      "start": 1967.2399444580078,
      "end": 1972.43994140625,
      "text": " given us and how he has revealed this truth to us that we can claim it by"
    },
    {
      "id": 38,
      "start": 1972.43994140625,
      "end": 1977.5199432373047,
      "text": " faith understanding that that he transcends us that my understanding is"
    },
    {
      "id": 39,
      "start": 1977.8399353027344,
      "end": 1984.3999481201172,
      "text": " finite and he is an infinite God and we can rejoice in the fact that he is great"
    },
    {
      "id": 40,
      "start": 1984.3999481201172,
      "end": 1989.8799438476562,
      "text": " but yet his greatness is unsearchable and his ways are past finding out but to"
    },
    {
      "id": 41,
      "start": 1989.8799438476562,
      "end": 1994.1599426269531,
      "text": " understand this evening that this teaching of the Trinity listen there are"
    },
    {
      "id": 42,
      "start": 1994.1599426269531,
      "end": 1997.7199401855469,
      "text": " some that would try to attack the the teaching of the Trinity I've mentioned"
    },
    {
      "id": 43,
      "start": 1997.7199401855469,
      "end": 2001.3999481201172,
      "text": " that by way of introduction the reason why it's important that we study it"
    },
    {
      "id": 44,
      "start": 2001.3999481201172,
      "end": 2004.9999389648438,
      "text": " there were some that would try to say well it was this is just a teaching that"
    },
    {
      "id": 45,
      "start": 2004.9999389648438,
      "end": 2009.7999420166016,
      "text": " was introduced by some theologian in some particular year so on and so forth"
    },
    {
      "id": 46,
      "start": 2009.7999420166016,
      "end": 2013.3599395751953,
      "text": " I showed you this evening starting all the way back in Genesis how that this is"
    },
    {
      "id": 47,
      "start": 2013.3599395751953,
      "end": 2018.8399353027344,
      "text": " a Bible truth this is not something that some theologian or some some religious"
    },
    {
      "id": 48,
      "start": 2018.8399353027344,
      "end": 2024.5199432373047,
      "text": " organization came up with and just began to to teach at some point no I'm pretty"
    },
    {
      "id": 49,
      "start": 2024.5199432373047,
      "end": 2029.7599487304688,
      "text": " confident as I read the Word of God to see how that even in the Old Testament"
    },
    {
      "id": 50,
      "start": 2029.7599487304688,
      "end": 2035.4799346923828,
      "text": " that God was revealing through the use of Elohim and Adonai and then also the"
    },
    {
      "id": 51,
      "start": 2035.4799346923828,
      "end": 2041.3199462890625,
      "text": " use of let us make man in our image let us go down and confound their languages"
    },
    {
      "id": 52,
      "start": 2041.3199462890625,
      "end": 2046.199951171875,
      "text": " who will go for us that God was revealing even the Old Testament this"
    },
    {
      "id": 53,
      "start": 2046.199951171875,
      "end": 2051.7999267578125,
      "text": " truth this reality of the Trinity and then we see with the progressive"
    },
    {
      "id": 54,
      "start": 2051.7999267578125,
      "end": 2057.2399291992188,
      "text": " revelation how that we get the New Testament and Jesus Messiah comes and he"
    },
    {
      "id": 55,
      "start": 2057.2399291992188,
      "end": 2064.159942626953,
      "text": " shows he shows that he is God how he receives worship he forgives sin the"
    },
    {
      "id": 56,
      "start": 2064.159942626953,
      "end": 2069.399932861328,
      "text": " attributes of God that that are given in the Old Testament you'll see him in the"
    },
    {
      "id": 57,
      "start": 2069.399932861328,
      "end": 2073.0799560546875,
      "text": " New Testament through the person of Christ you'll see his power you'll see"
    },
    {
      "id": 58,
      "start": 2073.0799560546875,
      "end": 2078.0399475097656,
      "text": " the names in the book of Revelation when you begin to read the first few chapters"
    },
    {
      "id": 59,
      "start": 2078.0399475097656,
      "end": 2082.3199462890625,
      "text": " the book of Revelation you begin to see how that names are ascribed to Jesus"
    },
    {
      "id": 60,
      "start": 2082.3199462890625,
      "end": 2086.199951171875,
      "text": " then in the Old Testament are given to God the Father there's no contradiction"
    },
    {
      "id": 61,
      "start": 2086.199951171875,
      "end": 2092.3199462890625,
      "text": " why Jesus is God and so when we understand the biblical reality of the"
    },
    {
      "id": 62,
      "start": 2092.3199462890625,
      "end": 2098.199951171875,
      "text": " scriptural truth and we're grounded and settled on it these cults that want to"
    },
    {
      "id": 63,
      "start": 2098.199951171875,
      "end": 2103.7999267578125,
      "text": " deny that Jesus is God these religions of the world that want to deny that"
    },
    {
      "id": 64,
      "start": 2103.7999267578125,
      "end": 2108.9999389648438,
      "text": " Jesus is God we must stand upon the truth of the Word of God and I would"
    },
    {
      "id": 65,
      "start": 2108.9999389648438,
      "end": 2113.8399353027344,
      "text": " submit to you this but Paul says in 1st Corinthians 2 in verse number 14 the"
    },
    {
      "id": 66,
      "start": 2113.8399353027344,
      "end": 2118.0799560546875,
      "text": " natural man receiveth not the things of the Spirit of God for their foolishness"
    },
    {
      "id": 67,
      "start": 2118.0799560546875,
      "end": 2122.0399475097656,
      "text": " unto him neither can he know them because they are spiritually discerned"
    },
    {
      "id": 68,
      "start": 2122.0399475097656,
      "end": 2128.679931640625,
      "text": " and I'm so thankful that God has revealed himself to us in his Word and"
    },
    {
      "id": 69,
      "start": 2128.679931640625,
      "end": 2134.919952392578,
      "text": " he's given us this truth of the Trinity and what a blessing it is to know that"
    },
    {
      "id": 70,
      "start": 2134.919952392578,
      "end": 2141.3199462890625,
      "text": " God the Father God the Son and God the Holy Spirit three in one tri unity or"
    },
    {
      "id": 71,
      "start": 2141.479949951172,
      "end": 2146.43994140625,
      "text": " Trinity as we often refer to it as let's pray this evening father we love you"
    },
    {
      "id": 72,
      "start": 2146.43994140625,
      "end": 2150.159942626953,
      "text": " we're so thankful for your word we're so thankful for the truth that is contained"
    },
    {
      "id": 73,
      "start": 2150.159942626953,
      "end": 2155.0399475097656,
      "text": " therein and Lord as we study this passage or these passages of Scripture"
    },
    {
      "id": 74,
      "start": 2155.0399475097656,
      "end": 2159.399932861328,
      "text": " this evening with this subject matter of the Trinity I pray that our faith has"
    },
    {
      "id": 75,
      "start": 2159.399932861328,
      "end": 2164.9999389648438,
      "text": " been strengthened I pray that we've been grounded even more secure in the faith"
    },
    {
      "id": 76,
      "start": 2164.9999389648438,
      "end": 2169.719940185547,
      "text": " God we know that there are false teachers we are aware of cults today"
    },
    {
      "id": 77,
      "start": 2169.719940185547,
      "end": 2175.5599365234375,
      "text": " that would teach that Jesus was created that would teach blasphemous things"
    },
    {
      "id": 78,
      "start": 2175.5599365234375,
      "end": 2180.8799438476562,
      "text": " about our Savior Jesus Christ and God we know that as we study your word that"
    },
    {
      "id": 79,
      "start": 2180.8799438476562,
      "end": 2185.5199279785156,
      "text": " this was not some teaching that originated with some religious"
    },
    {
      "id": 80,
      "start": 2185.5199279785156,
      "end": 2191.1199340820312,
      "text": " organization or some individual theologian at some date in recent"
    },
    {
      "id": 81,
      "start": 2191.1199340820312,
      "end": 2195.5199279785156,
      "text": " history but this this is a Bible truth we go all the way back to the pages of"
    },
    {
      "id": 82,
      "start": 2195.5199279785156,
      "end": 2199.5599365234375,
      "text": " Genesis and we see how that you were revealing this to your people and God I"
    },
    {
      "id": 83,
      "start": 2199.6399536132812,
      "end": 2205.6399536132812,
      "text": " pray that you'd help us as we perhaps come into contact with some or have some"
    },
    {
      "id": 84,
      "start": 2205.6399536132812,
      "end": 2209.5599365234375,
      "text": " that would attack our faith or our belief that we would be able to stand"
    },
    {
      "id": 85,
      "start": 2209.5599365234375,
      "end": 2214.8399353027344,
      "text": " firm upon the truth of your word plus bless our time of prayer again we thank"
    },
    {
      "id": 86,
      "start": 2214.8399353027344,
      "end": 2218.0799560546875,
      "text": " you for the privilege I pray that you be honored and glorified through all that"
    },
    {
      "id": 87,
      "start": 2218.0799560546875,
      "end": 2223.399932861328,
      "text": " said and done for it's in Christ's name we pray amen if you do not have a prayer"
    },
    {
      "id": 88,
      "start": 2223.399932861328,
      "end": 2226.5199279785156,
      "text": " bulletin we can get"
    }
  ],
  "processed_at": "2025-04-17T10:44:08.576260"
}