{
  "video_id": "9JjoBDbN7Ms",
  "text": "This morning, that was a blessing. 1 Timothy chapter number two, this morning, 1 Timothy chapter number two. I know that we've been preaching through the book of 1 John, and we will get back there, Lord willing, next Sunday. But I wanna preach a message this morning. If you'd looked at the back of the bulletin already, you see the title this morning, the place of prayer in our lives. The place of prayer in our lives. We think about the subject of prayer. In fact, I've said this before. It's a lot easier for me to talk about prayer, and it's a lot easier for me to preach about prayer than it is for me to actually pray. And the reality is that prayer is work. And as we think about the place of prayer in our lives, obviously, as you know, and I shared with you just a little bit of starting our services with a season of prayer, and I've just thoroughly enjoyed it. I think it's appropriate. And I hope that this message this morning will give you a little bit more insight as to why I believe that it's so necessary, and really ask the Lord to forgive me for not having prayer as a more prominent place in our services, and understanding the importance of prayer. And before we dive into the text of scripture here in 1 Timothy chapter number two this morning, I wanna give you just a little bit of remind us, really, of just some foundational truths, as I'll refer to them as, with regard to the subject matter of prayer. Some foundational truths. And I think it's important for us to understand these foundational truths as we get into the message this morning. And let me say this, right at the beginning, we're living in an evil day. We are living in the last days, as they're described by Paul, as he's writing to Timothy in 2 Timothy chapter number three. He speaks about the evil days, the last days, the perilous times. He describes all that's taking place. And I received an email just on Friday, and the question in the email, it was not from anyone. It was a mass mailing type of an email. But the question in the subject line was this, are we living in the last days? And it's like, if you have to ask the question, I'm not sure where we're going here, right? Because obviously, if you know anything about that phrase, last days, we are absolutely living in the last days. And we find that in these evil days, in these last days, that we need strength. We need strength to stand in an evil day. And the reality is that that strength is not gonna come by your willpower. It's not gonna come by your physical power. The strength to stand in the evil day is going to be a result of prayer power. And the reality this morning is that in Ephesians chapter number six, as God is giving to the believers in Ephesus, to us by way of preservation, the whole armor of God, he concludes the section by speaking about the importance of prayer. In verse number 18 of Ephesians six, you can look at it later, and you can see that he emphasizes after he goes through all of the armor and putting on the whole armor of God, he talks about praying always in the importance of prayer. We understand that the church in Thessalonica is told pray without ceasing. We understand that our Lord and Savior Jesus Christ, he prayed often. But I want you to consider with me this morning as we think about some foundational truth with regard to prayer, I would say this. We must be mindful of the fact that an invitation has been extended. Prayer is the unique privilege that is reserved for the child of God. God Almighty has extended an invitation to you and to me and to every one of his people to enter into his presence. What a great invitation. Remember the words that he spoke to Jeremiah in Jeremiah 33, call unto me. Right, isn't that wonderful? This invitation that the God of the universe, God Almighty, my heavenly Father, he says call unto me. And then he says this, and I will answer thee. Isn't that precious? And show thee great and mighty things which thou knowest not. Consider the words of Jesus in Matthew 7. He says, ask and it shall be given unto you. Seek and ye shall find. Knock and it shall be opened unto you for everyone that asketh receiveth. Do you remember what James says? You have not because you ask not. He also says you have not because you ask amidst. But I want you to think about what Jesus says. For everyone that asketh receiveth and he that seeketh findeth and to him that knocketh it shall be opened. Notice the analogy that he uses or what man is there of you whom if his son ask bread, will he give him a stone? Now not one among us. Amen? In fact, even if it's not your son, but he uses that analogy, but if somebody comes to you and ask for bread, you're not gonna give him a stone. He says, or if he ask a fish, will he give him a serpent? No. No, that's not how we'd respond. And notice the powerful truth. If ye then, being evil, know how to give good gifts unto your children, how much more? How much more? Let those words sing, how much more shall your Father which is in heaven give good things to them that ask him? He said, ask, ask, and it shall be given you. Isn't that precious? This invitation that's been extended. I know that I've said to my children, if you need help, just ask. Perhaps you've said that to your children. Perhaps you've said it to a spouse or maybe to someone else. You say, just ask, how often, however, do we observe people that do not ask for help and struggle to complete the task? Why? Because they don't wanna ask for help. Whether it's because of pride, whether it's because they don't wanna inconvenience you. Has anyone ever said to you, well, I didn't ask you for help because I didn't wanna inconvenience you. Anyone ever say that to you? I've been told that. Can I tell you, you can't inconvenience God. Amen? It is impossible. The Bible tells us that he is a very present help in the time of trouble. The reality of God's word is that God is not only available to help us, but he is able to help us. And when you combine those two truths, it is so powerful because he's always available and he's always able. He said, ask. He said, call unto me in invitation. I want you to understand that God's given us many promises in his word with regard to prayer. We find that throughout the Psalms, the Psalmist regularly records and speaks about how the Lord heard him, how the Lord heard my cry, how the Lord heard my prayer. And you think about the joy of that and you think about the reality that God says, if you call, if you ask, that I will respond. He gave us this promise in Ephesians three that he's able to do exceeding abundantly above all that we ask or think. We're familiar with the truth of Hebrews chapter number four and verse number 16 when he says that we're to come boldly under the throne of grace. You think about that picture in your mind, understanding that Jesus as our great high priest, that he's provided that access and that now you and I have the privilege of going boldly under the throne of grace that we may obtain mercy and find grace to help in time of need. Think about this promise from the book that we've been studying and we're not there yet because it's first John chapter number five, but in first John five and verse number 14, notice the way that it says this truth that says, and this is the confidence that we have in him. Now I like being confident, don't you? We have confidence, let me tell you this, your confidence in Christ is never going to waver from the perspective of him failing you. Now, whether you have confidence in him or not is another story, but the reality is that we can trust him. Great is thy faithfulness, amen? He is trustworthy, he is dependable, and we find that he says the, and this is the confidence that we have in him that if we ask anything according to his will, he heareth us. Doesn't that encourage your heart this morning? I mean, when you consider the invitation that's been extended, when you consider the promises that God has given us in his word, as we think about these foundational truths, I want you to consider answered prayer, the testimonies throughout the word of God of answered prayer. Listen, answered prayer ought to encourage us. It ought to drive us to our knees more often because we know that our God hears and answers prayer. I think about, you could fill in the blanks this morning. You can think about all of those that have gone before us, Abraham, Isaac, and Jacob, and I mean, you just start thinking about Moses and Joshua, and you think about Daniel and David and Isaiah, and I mean, you just start naming all these people of God that they heard from God, they prayed, they saw the face of God, and God answered. Paul, Peter, John. I mean, we just go on and on. And think about all of the records that we have in the Bible that record for us the way in which prayer was heard and prayer was answered. You remember Elijah, he prayed. In fact, the example is used by James when he speaks about the effectual fervent prayer of a righteous man availeth much, he uses the example of the righteous man. example of Elijah praying in the Old Testament. Elisha prayed. Hezekiah prayed. And as we read the Word of God and we see all of these testimonies of answered prayer, they all encourage us. When we think about these foundational truths, and as I take a moment to just meditate upon those foundational truths, I believe that it leads me to a place, and really the message this morning is a place in my life where I'm going to evaluate my own prayer life. And I'm going to, with the help of God, seek to determine the place of prayer in my life. I'm not asking you this morning to evaluate the place of prayer in my life. I'm not asking you this morning to evaluate the place of prayer in your neighbor's life, in your spouse's life, in your child's life, in some other member's life. I'm asking each of us this morning to humbly, before the Lord, to evaluate the place of prayer in our own lives personally. I don't want to evaluate the place of prayer in your life. I want to evaluate the place of prayer in my life. And as we think about 1 Timothy chapter number 2, I believe that God provides us with some important truth regarding the place of prayer in our lives. Notice in 1 Timothy chapter number 2, beginning in verse number 1, the Bible says, I exhort, therefore, that, first of all, supplications, prayers, intercessions, and giving of thanks be made for all men, for kings and for all that are in authority, that we may lead a quiet and peaceable life in all godliness and honesty. For this is good and acceptable in the sight of God our Savior, who will have all men to be saved and to come unto the knowledge of the truth. For there is one God and one Mediator between God and man, the man Christ Jesus. Aren't you thankful for that? Notice what he did. He gave himself a ransom for all to be testified in due time, whereunto I am ordained a preacher and an apostle. I speak the truth in Christ and lie not, a teacher of the Gentiles in faith and verity. I will, therefore, that men pray everywhere, lifting up holy hands without wrath and doubting. Anytime you read the Word of God and you find that God tells us that something is good and acceptable in His sight, we ought to take note of that. Amen? And here in this passage of Scripture, we find that very reference in verse number 3, but as we consider this morning some truth from this passage that would help us in this process of evaluation, I would say, number one, that prayer is a priority. Prayer is a priority. Notice what he says in verse number 1, I exhort, therefore, that first of all – note those words – first of all, not second, not third, not last, but first of all, that supplications, prayers, intercessions, and giving of thanks be made for all men. There's a priority in our text of Scripture that is placed upon prayer. The reality is that prayer should be my first response and not my last resort. There are times, however, in my life, and if you'd be honest in evaluating your life this morning, that we try all sorts of things to figure it out, and then we come to the place when we say, maybe I should pray about this. But prayer should be our first response. In fact, without turning there, but in James 5, in verse 13 and 14, in both of those verses, there are questions that are asked. The first one in verse 13, are any afflicted? You know what the answer is? Let them pray. In verse 14, are any sick? You know what the answer is? Let them pray. Let them call for the elders. I understand the innocence, but let them pray. The response. Someone said this. I believe it was John R. Rice. He said, all of our problems are prayer problems. Man, that helps us to focus on that priority of prayer. The reality is that I can't preach a message with the power of God if I've not first prayed. Amen? You can't live the life that you're supposed to live and have that godly testimony in the midst of your home, in the midst of your family, in the midst of your neighbors, in the midst of your co-workers, without praying. The reality is that we can go and we can try to reach our community and reach the world with the gospel, but we must first pray, because we need the power of God. God has ordained it. We see it all throughout His Word that prayer moves the hand of God. We can argue the finer points and we can ask the questions as to why that is, but the reality is that we must simply accept that God has set it to be so. That prayer moves the hand of God. That ought to encourage us. We're to pray. We're to pray. We're to pray about everything. And we're to have prayer as a priority. It's interesting in the text of Scripture that he says that, first of all, supplications, prayers, intercessions, giving of thanks be made for all men. Notice what he says, for kings and for all that are in authority. Then it says this, that we may lead a quiet and peaceable life in all godliness and honesty. You ever wonder about that verse of Scripture? You know, the reality of we'd be honest this morning with one another, it's a whole lot easier for us to complain about those in authority than it is to pray for them. Amen? I'm talking to myself this morning. It's a whole lot easier for us to criticize, to complain about those that are in authority than it is for us to pray for them. But we're to pray for those that are in authority. And then notice what he says, that we may lead a quiet and peaceable life in all godliness and honesty. Why? Because God moves and God works. You know the truth of Proverbs 21, a verse of Scripture that we've often referred to over the years and rightly so, and what powerful truth it is when God gives us this truth with regard to His power. And he says this, that the king's heart is in the hand of the Lord. As the rivers of water, He, God, turneth it whithersoever He will. Do you believe that? God is able. You read throughout the book of Ezra and Nehemiah and you can see how God moved the heart of some wicked kings, some ungodly kings, how God moved and how God worked and how God responded to the prayer of His people. When they're rebuilding, they're praying. Repeatedly you can read of the times of prayer. Oh, there was a work to be done, but they understood the importance of prayer. This morning, there's a priority that is placed upon prayer. I would say this, that prayer demonstrates our dependence. When I pray, I'm demonstrating my dependence upon God. Someone said this, that prayer is not an escape from our responsibility. Rather, prayer is our response to God's ability. You know, sometimes we use the phrase and we hear the phrase used, I'll pray for you, and sometimes we think that's just a discounted response. But you know the reality is that that's the greatest thing we could do for anyone, is to pray for them. To pray for them. We find that He says that first of all, prayer is a priority. Let me say this, prayer is pleasing to our Lord. We find that it says in verse number three, for this is good and acceptable in the sight of God our Savior. What is good and acceptable? That we're praying, that we're going to His face, that we're seeking Him. We notice that He says that who will have all men to be saved and come unto the knowledge of the truth. You know that God is not willing that any should perish, but that all should come to repentance? You know how you and I need to be praying for those that are in authority that God would save them? You know why those in authority make decisions that we disagree with so often is because they're lost. They're lost people that are operating as lost people. Why should we be surprised by that? We pray for them. We pray for their salvation. That God would bring someone into their presence, that someone would cross their path that has the boldness and the courage to preach the gospel of Jesus Christ, that the Holy Spirit of God would work and move as only He can. We pray. We pray for souls to be saved. Notice it says there's one God and one mediator between God and men, the man Christ Jesus, and what joy that is. You can go directly to God through the Lord Jesus Christ. You don't need some other person that you go through, and I'm thankful for that reality that tells us how He gave Himself a ransom for all. I'm thankful that Jesus died in my place and your place and that He rose conquering sin, death, and the grave, that He ever liveth to make intercession for us, that one day, one glorious day, He's coming back. And what a joy that is. And Paul says as he's writing to Timothy, whereunto I am ordained a preacher and apostle. I speak the truth in Christ and lie not, a teacher of the Gentiles in faith and verity, faith and truth. truth, but then notice what Paul says in verse number eight after he's speaking about prayer in the church and the importance and the priority and the fact that it's pleasing to God. Notice what he says, I will therefore that men pray everywhere lifting up holy hands without wrath and doubting. Can I tell you this morning that prayer is going to require a plan. You're not going to pray by accident. You really aren't. I never pray by accident. I just don't. If I just jump into my day and I just get into it and all sorts of things happen and I get emails and text messages and phone calls and the kind of days that you have and you have so many things going on, the busyness of life, the reality is that if I don't have a time and a purpose and a plan, it gets away from us. And all of a sudden, we look at the clock and we say, man, I haven't even prayed yet. I haven't had my time with the Lord yet. Then we've got to have a plan. We've got to make it a priority. This morning, before I ever even, I walked through the front door this morning from the fellowship hall. It's closer to my house and just joking with you guys, amen. But I walked through that door. I walked through there so I could take care of a couple things over there actually. And then before I ever went to my office this morning, I stopped here and prayed. I spent a season in prayer right there this morning. Why? Because once I go to my office, man, there's all kinds of stuff going on. We've got to have a plan. Let me say this. When we think about this evaluation this morning and we think about the place of prayer in our lives, I want to look at it from two aspects. All of that really was just introduction. And I know it's our passage of Scripture. It was really just introduction. And some of you say, my notebook's full already. It's 11.20 already. I know. I'll try to keep it brief. From two perspectives, number one, the place of prayer in our lives personally, personally, each one of us evaluating our own lives. I would ask this question this morning. I've asked it of myself and I would ask you to ask yourself, what words would best describe our prayer life? If we were to honestly evaluate our prayer lives personally in the place of prayer in our lives, what words would best describe it? I'm not even going to provide you any suggestions. I'd rather you just evaluate and ask the Lord to help you evaluate. God, how best would my prayer life be described? I want you to turn to the book of Acts, if you will, and I want you to look at an example. The example is of Paul at this particular time, Acts chapter 9. His name is still Saul. But I want you to think about this personally from this evaluation. What place does prayer have in my life personally? And I want you to think about the Apostle Paul. I want you to notice in Acts chapter 9, we're familiar with the passage of Scripture and he's journeying. He comes near to Damascus according to verse number three and there's a bright light that shines from heaven. We find that the Lord speaks to him. He hears this voice in verse number four, Saul, Saul, why persecutest thou me? We find that the response is, who art thou, Lord? And then he asked the question after Jesus tells him, I am Jesus whom thou persecutest. He then says, what wilt thou have me to do? He says, Lord, what wilt thou have me to do? And the Bible tells us in verse number six that the response, the Lord says to him, arise and go into the city and it shall be told thee what thou must do. That's interesting because God's going to speak to someone else here in just a moment as we go through the passage and Ananias is going to receive this instruction. But I want you to see that Jesus told him to go to the city and see and go there and it shall be told thee what thou must do. Notice in verse number seven, the men which journeyed with him stood speechless, hearing a voice, but seeing no man. And Saul arose from the earth and when his eyes were opened, he saw no man, but they led him by the hand and brought him into Damascus. And he was there three days. He was three days without sight, it says, and neither did eat nor drink. Notice verse number 10, there was a certain disciple at Damascus named Ananias. And to him said the Lord in a vision, Ananias. And he said, behold, I am here, Lord. Notice what the Lord says, arise and go into the street, which is called straight and inquire in the house of Judas for one called Saul of Tarsus, for behold, he prayeth. He prayeth. What was Paul doing? I understand Saul, we refer to him as Paul. He was praying. Let me ask you in verse number six, did Jesus tell him to go pray? Actually didn't. It's not recorded that Jesus said, go into the city and pray. But Paul's praying. He's praying. Jesus told him, it shall be told thee what thou must do. We can only assume what it is that Paul was praying, the direction in which he was seeking. We understand that he met the Lord. His life was changed. He was saved. This is his testimony of salvation in this passage of Scripture. We find that the Bible tells us, as you continue reading on, that Ananias is concerned. He's saying, listen, we know about this guy and you really want me to go. And we find that the Lord graciously speaks to Ananias and tells him that he's chosen. Notice in verse number 15, after the objection, the Bible says that the Lord said unto him, go thy way for he is a chosen vessel unto me to bear my name before the Gentiles and kings and the children of Israel. For I will show him how great things he must suffer for my name's sake. And Ananias went his way, entered into the house, and putting his hands on him, said, brother, saw the Lord, even Jesus, that appeared unto thee in the way as thou camest, hath sent me, that thou mightest receive thy sight and be filled with the Holy Ghost. And we see that he then preaches and all that takes place. And of course, we're familiar with the life of Paul. But I want you to just think for a moment as we evaluate our lives personally and how Paul, right after his conversion, that when Jesus speaks to Ananias and says, listen, Ananias, I have a task for you, and I want you to go into the city, and he tells him what street to go to, and he tells me he's going to go to a house, and you're going to find one named Saul, and he's praying. That's powerful to me. It's impactful to me to see the response of Saul just after his conversion that he's praying. We know much about the Apostle Paul. We read of his missionary journeys. We read much of his letters, and we read in those letters how that under the inspiration of the Holy Spirit of God that he tells those recipients, whether they be individuals or whether they be churches, he tells them how he's praying for them regularly. Paul says, I'm praying for you. And he doesn't just say, I'm praying for you, but he tells them how he's praying for them. Paul is a man of prayer. Paul understood the importance of prayer. He understood that in his life there was a priority placed upon prayer. And we find that Paul is praying here in Acts 9, and we find that that's his response, and we find that that becomes a pattern in his life, and not a pattern such as rote religion, not a pattern as in, I said my prayers, quote unquote. That's not the idea of praying. It's not rote religion. I'm talking to my Father. Amen? I belong to Him. I've been adopted in His family. We mentioned last week, or two weeks ago from 1 John, how that He spoke about the little children and the young men and the fathers, and we spoke about the little children, how that at salvation, there's just a couple of things that we learn right away. Number one, our sins are forgiven. Number two, He's my Father, and I'm speaking to Him. It's not some recorded prayer. It's not some printed out, I just take a prayer book, and I just pray these prayers, and they're just vain repetitions. No, it's not praying so that someone could look at me. By the way, Jesus spoke of those religious leaders that prayed in that manner, and He said they have their reward. You know what their reward was? The recognition of man. But He said, when you pray, enter into your closet. Amen? And we pray to our Father. We pour our heart out unto Him. Last Sunday morning in Sunday school, Psalm 62.8, we didn't deal with a miracle. We've been dealing with miracles, but God just impressed that passage of Scripture, that verse of Scripture, upon my heart. I couldn't get away from it all week, and we dealt with it last Sunday morning in Sunday school, and how the psalmist told us that we're to trust in Him at all times, and we're to pour our heart out before Him. Hannah did that. David did that on more than one occasion. The people of God that I mentioned by way of introduction this morning, that testimony of answered prayer, they pour their heart out to God. Why? For He's a refuge for us. You don't need a prayer book that has some recorded prayers that someone wrote down. You just need to pour your heart out to God. Paul's praying. Paul tells the people that he ministers to that he's praying for him. Paul asks the people that he's ministering to to pray for him. Often throughout the Scriptures, you find that Paul will ask the question. In fact, in Ephesians 6, when he talks about after the armor of God that I mentioned earlier, how that he says praying always, he then specifically says, and pray for me. He asked the believers in Thessalonica this way. He says, brethren, pray for us. He tells the believers in the church in Colossae to pray for him and to pray for them that the doors would be opened, that he would speak with boldness the way that he's supposed to speak. No wonder in 1 Timothy 2, in verse number eight, he says, I will therefore that men pray everywhere, lifting up holy hands without wrath and doubting. Paul understood the importance of prayer. What a great example for us this morning. When we evaluate our lives personally, personally, what place does prayer have in my life? Number two, and I'll be done with this this morning, when I evaluate prayer and when I ask the question, the place of prayer in our lives, yes, personally, but number two, corporately, corporately. I mentioned this two, three weeks ago now, the first Sunday that we started praying before our service, we start with a song and then we have a season of prayer. I believe God's pleased with that, by the way. It encourages my heart to hear the voices of people praying. How sweet that must be in the ears of God, amen? Jesus said this in Matthew 21 in verse number 13, and this is the verse that I said that Sunday morning that we first changed the order of our services and made this emphasis on prayer corporately. He said, by house shall be called the house of prayer. And just in case we weren't clear as to what house he was speaking of, we find that in 1 Timothy chapter three in verse number 15, that the word of God plainly teaches that the house of God is the church of the living God, amen? Amen? So he wasn't specifically just speaking about the temple, his house. This is God's house. You know that the Lord Jesus Christ is the head of the church? Someone was asking me recently about the church polity in a Baptist church. And the church polity in a Baptist church differs from church polity in some other churches. I began to explain some things, and I said first and foremost, the Lord Jesus Christ is the head of the church, amen? I'm thankful for that. It's his church. And he said, my house shall be a house of prayer. Should be a house of prayer. I want you to think about the example when we think about the place of prayer in our lives, not just personally but corporately. Turn to Acts 12, if you will. We're in Acts nine looking at the life of Paul, but now I want you to look in Acts 12 and the context of Acts chapter number 12 is the situation with Peter. We know that James has already been killed. According to verse number two, Herod's killed James, and then he takes Peter, and he's intending to kill Peter as well. And we know that that's taking place. And Herod, why does he wanna kill Peter? Well, he saw that it pleased the people, the Jews in particular, that he killed James, and so therefore he takes Peter, according to verse number three. But I want you to think of what takes place here in Acts chapter number 12. Notice the Bible says in verse number five, Peter therefore was kept in prison. He was kept in prison. He was gonna be there for a short period of time, and then after which we understand that Herod would bring him forth to kill him. And the Bible tells us in Acts 12 in verse number five, I want you to notice, it says Peter therefore was kept in prison, but then notice the next phrase, but prayer was made without ceasing of the church unto God for him. As you know, often I like to, as I read and as I preach the word of God, I like to put myself in the setting. We did that a little bit this morning in Sunday school as we looked at that miracle, and let's just kind of be there and see what's happening. And this morning when I look at this passage of Scripture, and as I have looked at this passage over the years, I put myself in the setting, and I see the church of God, and I see the events that are taking place, and James is already killed. Herod's taken a sword and he's killed him. That's pretty serious, right? And he saw that the Jews were pleased, so he says, well, I'm gonna take Peter too, and I'm gonna kill him. But because of some things that were taking place, I'm gonna put him in prison first, and then I'm gonna kill him afterwards. And we find that the Bible tells us that the church of God responded how, they prayed. Now, when I try to put myself in the position, I ask myself this question, how would I have responded? What would I have done? Who would I have called and said, hey, we gotta get a plan going to get Peter out of jail? And I start networking with people and say, hey, listen, I know you're good at this, and I know you're good at that, and you're a strong, big guy, and I want you on my team, and we gotta do this, that, and the other, and we're gonna get Peter out of jail, man. We're gonna get him out of prison. Isn't that how we operate sometimes? Seriously. It's just how we operate sometimes. We just immediately begin to think about, okay, what do I need to do to solve this problem? What do I need to do to take care of this? James is killed, Peter's in prison, man. Some maybe flee because, man, I'm gonna be next. I don't wanna get killed. Some are gonna try to figure out how to, no, but the Bible tells us that, but prayer was made without ceasing of the church and to God for him. They responded in prayer. They responded in prayer, and when we see how the church prayed, the Bible continues, and it says, in verse number six, and when Herod would have brought him forth, the same night Peter was sleeping between two soldiers bound with two chains in the keepers before the door kept the prison, I mean, he was pretty shut in, was he not? We'd have had to have a pretty elaborate, sophisticated plan to break Peter out, but God, he's over all of that stuff. And here, the Bible tells us that they were, I mean, it was secure. It was as secure as it could be. In verse number seven, behold, the angel of the Lord came upon him, and a light shined in the prison, and he smote Peter on the side, I love that, and raised him up, saying, Arise up quickly, and his chains fell off from his hands. And the Bible tells us, the angel said unto him, Gird thyself, and bind on thy sandals, and so he did. He saith unto him, Cast thy garment upon thee, and follow me. And he went out, and followed him, and wist not that it was true which was done by the angel, but thought he saw a vision. Now, let me ask you, pause just for a moment before we continue reading. What's the church doing? The church is still praying, because the Bible tells us in verse number five, but prayer was made without ceasing of the church unto God for him. The church is praying. They have an all-night prayer meeting. You know how well those are attended? Come to Wednesday night, and see how well those are attended. That'll give you an idea of how well an all-night prayer meeting would be attended. Amen? And it says this in verse number 10. When they were past the first and the second ward, they came unto the iron gate that leadeth unto the city, which opened to them of his own accord, and they went out, and passed on through one street, and forthwith the angel departed from him. And when Peter was come to himself, this is what he said, now I know of a surety that the Lord hath sent his angel, and hath delivered me out of the hand of Herod, and from all the expectation of the people of the Jews. When he had considered the thing, he came to the house of Mary, the mother of John, whose surname was Mark. What does it say? Where many were gathered together praying. They're praying. Evaluate it personally, but then evaluate it corporately. What place does prayer have? Corporately. As we read in Acts chapter number 12, and you read from verse number six down to where I stopped in verse number 12, all that that you're reading of that miraculous deliverance, I would argue this morning that that is God's hand moving in response to the church praying. Amen? The hand of God moving miraculously, powerfully, beyond what the church could ever do. Remember the Bible tells us, I mentioned the prayer promise, that He is able to do exceeding abundantly above all that we ask or think. Now listen, sometimes we can ask or think some great things, but we might have a little bit of wavering, and He tells us that we're to pray without wrath and doubting, but we find here that these people are gathered praying. No doubt they're praying that God would move. Perhaps some have prayed that God would deliver Peter, but they can't even begin to imagine how God would deliver Peter. Because Herod is powerful, right? And Herod has already killed James, and now Herod has taken Peter, and Herod has this plan, and Peter is in prison, and the guards are there, and the wards are shut. But they're praying. They're praying. And Peter, according to verse number 13, he came, it says, and as Peter knocked at the door of the gate, this is always make you laugh, a damsel came to hearken named Rhoda. So Peter's knocking. It says, when she knew Peter's voice, she opened not the gate for gladness, but ran in and told how Peter stood before the gate. She left him out there because she was so excited. But then guess what? They say, nah, thou art mad, you're crazy. She constantly affirmed that it was even so. Then said they, it is his angel. But Peter continued knocking. I don't know how long he was out there knocking, but he just kept knocking. It says, when they opened the door and saw him, they were astonished, they were astonished. God worked, God answered prayer. You've been praying. And then the Bible tells us, but he, in verse 17, beckoning unto them with the hand to hold their peace. Why do you think he had to quiet them down? Why? Because they're excited. Notice what it says, declared unto them how the Lord had brought him out of the prison. He said, go, show these things unto James and the brethren, and he departed and went into another place. But I want you to just think about this in verse number 17, that when he declares unto them how that the Lord had brought him out of the prison, that was a direct response of their praying, of their praying. I don't know that Peter was aware of the prayer meeting that was taking place. I know that as they were praying, they weren't aware of how God was delivering Peter until he came there. And this morning, as we think about our lives and evaluating and asking ourselves the question, what place does prayer really have in my life, in my life personally? Does it have, is there a priority that's placed upon prayer? Do I have a plan? What is it that would best describe, what words would best describe my prayer life? Prayers work. Prayers work. But then when we evaluate prayer corporately, Jesus said, my house shall be a house of prayer. I no longer desire for prayer to just be a bookend to our services. I don't. I intend with the help of God that we'll do exactly what we did this morning, we'll begin each service with a season of prayer, praying that God would move and work. Listen, those moments of prayer, they really aren't to pray for somebody that's sick. They're not to pray for somebody that's whatever. It's very specific prayer for what's at hand. Oh God, use the song service this morning. Speak to my heart through the songs. Be glorified as we sing praise to Thy name. God, would You use the preacher this morning? Fill him with Your power to deliver the Word of God. God, help me to be attentive. Help me to long to hear and to get something from You this morning, God. And we use that time of prayer for that purpose. We really seek the face of God for how He would be exalted and glorified. That if there's somebody that's lost in our midst that the Holy Spirit of God would speak to them and would convict them of their sin and of Christ's righteousness, of judgment to come, that today would be the day of salvation in their lives. For the saying that God would stir us up, that God would change us, that God would do something in our lives, that He'd be glorified. That's the purpose of that prayer time. With the help of God, I seek to make prayer a priority, not only in my life personally, but corporately as a church. As I mentioned a moment ago, and it's worth repeating, I no longer desire for prayer to simply be bookends to our service. I don't. Here's what someone said. Someone said this about prayer, the pulpit of this day is weak in praying. The pride of learning is against the dependent humility of prayer. When I read that, it just… I understand that I've been given a responsibility to preach the Word. That's my responsibility. But God said, my house shall be a house of prayer. And if we're not praying like we're supposed to, we can preach, we can get the greatest preachers that walk the face of this earth. But if we're not prayed up and we're not ready to receive, who's a better preacher than Jesus? Nobody. But you know what Jesus said? He said, you've heard my words, but you're doing them not. You're like a foolish man. There's others that heard His words and they did it. He said, I liken you to a wise man. We sing the song, wise men build his house upon the rock, the foolish man, no, right? The floods come, so on and so forth. The response, the tenderness of the reception, it wasn't in the message that Jesus delivered. It was the same message from God in flesh. This morning, I want to just open up the curtain a little bit to help you understand why we're placing a greater priority on prayer. I mentioned this three weeks ago. I want to be teachable. I love preaching the Word of God, but when I heard that message a few weeks ago and someone used that analogy of prayer being bookends in our service, I was like, Lord, forgive me. Because quite honestly, we pray, say, Lord, bless our services. And then we have our service, and then we say, Lord, thank You for blessing our service this morning. What place does prayer have in my life, personally and corporately? Let's pray. Father, we love You. Lord, we thank You for loving us. Thank You for the Word of God. Lord, we thank You for the countless promises throughout the entirety of Your Word with regard to prayer, the encouragement that we receive by the way in which You've answered and worked. As we read secular history and read church history, Bible history of those that have seen Your hand move and work, God, how we're encouraged to know that You're a God who hears and answers prayer. This morning, all of those truths and all of those realities must have an impact in our lives. We must be doers of the Word and not hearers only. We must come to the place where we truly evaluate where prayer is in our lives, the place of prayer, personally and corporately. Lord, I pray that Your Holy Spirit would move and work as only You can. We don't want to rush You this morning, Lord. Help us do business with You. Help us to respond. God, help us to make some commitments. Help us, Lord, to renew some commitments with regard to prayer. We want to see You move and work, and God, we want to be able to hear accounts like we read in Acts 12, You moving and working in distinct, miraculous ways as a result of prayer. We commit these moments to You and ask that You'd work as only You can. For it's in Christ's name we pray. Would You stand with me? Heads are bowed, eyes are closed. Kimberly is going to play quietly on the piano. The altar is open. Thank God for prayer. Make a commitment to the Lord. Evaluate your life, your prayer life, as Kimberly plays the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 1.0399999618530273,
      "text": " This morning, that was a blessing."
    },
    {
      "id": 1,
      "start": 1.0399999618530273,
      "end": 2.9600000381469727,
      "text": " 1 Timothy chapter number two,"
    },
    {
      "id": 2,
      "start": 2.9600000381469727,
      "end": 5.239999771118164,
      "text": " this morning, 1 Timothy chapter number two."
    },
    {
      "id": 3,
      "start": 5.239999771118164,
      "end": 7.159999847412109,
      "text": " I know that we've been preaching"
    },
    {
      "id": 4,
      "start": 7.159999847412109,
      "end": 8.5,
      "text": " through the book of 1 John,"
    },
    {
      "id": 5,
      "start": 8.5,
      "end": 9.84000015258789,
      "text": " and we will get back there,"
    },
    {
      "id": 6,
      "start": 9.84000015258789,
      "end": 11.640000343322754,
      "text": " Lord willing, next Sunday."
    },
    {
      "id": 7,
      "start": 11.640000343322754,
      "end": 13.539999961853027,
      "text": " But I wanna preach a message this morning."
    },
    {
      "id": 8,
      "start": 13.539999961853027,
      "end": 15.4399995803833,
      "text": " If you'd looked at the back of the bulletin already,"
    },
    {
      "id": 9,
      "start": 15.4399995803833,
      "end": 16.84000015258789,
      "text": " you see the title this morning,"
    },
    {
      "id": 10,
      "start": 16.84000015258789,
      "end": 19.760000228881836,
      "text": " the place of prayer in our lives."
    },
    {
      "id": 11,
      "start": 19.760000228881836,
      "end": 22.440000534057617,
      "text": " The place of prayer in our lives."
    },
    {
      "id": 12,
      "start": 22.440000534057617,
      "end": 24.959999084472656,
      "text": " We think about the subject of prayer."
    },
    {
      "id": 13,
      "start": 24.959999084472656,
      "end": 26.920000076293945,
      "text": " In fact, I've said this before."
    },
    {
      "id": 14,
      "start": 26.920000076293945,
      "end": 28.8799991607666,
      "text": " It's a lot easier for me to talk about prayer,"
    },
    {
      "id": 15,
      "start": 28.8799991607666,
      "end": 30.760000228881836,
      "text": " and it's a lot easier for me to preach about prayer"
    },
    {
      "id": 16,
      "start": 30.760000228881836,
      "end": 32.47999954223633,
      "text": " than it is for me to actually pray."
    },
    {
      "id": 17,
      "start": 32.47999954223633,
      "end": 36.63999938964844,
      "text": " And the reality is that prayer is work."
    },
    {
      "id": 18,
      "start": 36.63999938964844,
      "end": 39.959999084472656,
      "text": " And as we think about the place of prayer in our lives,"
    },
    {
      "id": 19,
      "start": 39.959999084472656,
      "end": 40.959999084472656,
      "text": " obviously, as you know,"
    },
    {
      "id": 20,
      "start": 40.959999084472656,
      "end": 42.959999084472656,
      "text": " and I shared with you just a little bit"
    },
    {
      "id": 21,
      "start": 42.959999084472656,
      "end": 46.380001068115234,
      "text": " of starting our services with a season of prayer,"
    },
    {
      "id": 22,
      "start": 46.380001068115234,
      "end": 47.91999816894531,
      "text": " and I've just thoroughly enjoyed it."
    },
    {
      "id": 23,
      "start": 47.91999816894531,
      "end": 49.36000061035156,
      "text": " I think it's appropriate."
    },
    {
      "id": 24,
      "start": 49.36000061035156,
      "end": 52.7599983215332,
      "text": " And I hope that this message this morning"
    },
    {
      "id": 25,
      "start": 52.7599983215332,
      "end": 54.31999969482422,
      "text": " will give you a little bit more insight"
    },
    {
      "id": 26,
      "start": 54.31999969482422,
      "end": 56.880001068115234,
      "text": " as to why I believe that it's so necessary,"
    },
    {
      "id": 27,
      "start": 56.880001068115234,
      "end": 59.959999084472656,
      "text": " and really ask the Lord to forgive me"
    },
    {
      "id": 28,
      "start": 59.959999084472656,
      "end": 63.040000915527344,
      "text": " for not having prayer as a more prominent place"
    },
    {
      "id": 29,
      "start": 63.040000915527344,
      "end": 64.4000015258789,
      "text": " in our services,"
    },
    {
      "id": 30,
      "start": 64.4000015258789,
      "end": 67.5199966430664,
      "text": " and understanding the importance of prayer."
    },
    {
      "id": 31,
      "start": 67.5199966430664,
      "end": 69.5199966430664,
      "text": " And before we dive into the text of scripture"
    },
    {
      "id": 32,
      "start": 69.5199966430664,
      "end": 72.0,
      "text": " here in 1 Timothy chapter number two this morning,"
    },
    {
      "id": 33,
      "start": 72.0,
      "end": 74.4800033569336,
      "text": " I wanna give you just a little bit of remind us, really,"
    },
    {
      "id": 34,
      "start": 74.4800033569336,
      "end": 76.95999908447266,
      "text": " of just some foundational truths,"
    },
    {
      "id": 35,
      "start": 76.95999908447266,
      "end": 78.73999786376953,
      "text": " as I'll refer to them as,"
    },
    {
      "id": 36,
      "start": 78.73999786376953,
      "end": 81.5199966430664,
      "text": " with regard to the subject matter of prayer."
    },
    {
      "id": 37,
      "start": 81.5199966430664,
      "end": 82.83999633789062,
      "text": " Some foundational truths."
    },
    {
      "id": 38,
      "start": 82.83999633789062,
      "end": 83.91999816894531,
      "text": " And I think it's important for us"
    },
    {
      "id": 39,
      "start": 83.91999816894531,
      "end": 86.08000183105469,
      "text": " to understand these foundational truths"
    },
    {
      "id": 40,
      "start": 86.12000274658203,
      "end": 88.08000183105469,
      "text": " as we get into the message this morning."
    },
    {
      "id": 41,
      "start": 88.08000183105469,
      "end": 89.55999755859375,
      "text": " And let me say this, right at the beginning,"
    },
    {
      "id": 42,
      "start": 89.55999755859375,
      "end": 92.27999877929688,
      "text": " we're living in an evil day."
    },
    {
      "id": 43,
      "start": 92.27999877929688,
      "end": 95.19999694824219,
      "text": " We are living in the last days,"
    },
    {
      "id": 44,
      "start": 95.19999694824219,
      "end": 97.87999725341797,
      "text": " as they're described by Paul,"
    },
    {
      "id": 45,
      "start": 97.87999725341797,
      "end": 99.19999694824219,
      "text": " as he's writing to Timothy"
    },
    {
      "id": 46,
      "start": 99.19999694824219,
      "end": 100.87999725341797,
      "text": " in 2 Timothy chapter number three."
    },
    {
      "id": 47,
      "start": 100.87999725341797,
      "end": 104.31999969482422,
      "text": " He speaks about the evil days, the last days,"
    },
    {
      "id": 48,
      "start": 104.31999969482422,
      "end": 105.5999984741211,
      "text": " the perilous times."
    },
    {
      "id": 49,
      "start": 105.5999984741211,
      "end": 107.68000030517578,
      "text": " He describes all that's taking place."
    },
    {
      "id": 50,
      "start": 107.68000030517578,
      "end": 110.08000183105469,
      "text": " And I received an email just on Friday,"
    },
    {
      "id": 51,
      "start": 110.08000183105469,
      "end": 111.27999877929688,
      "text": " and the question in the email,"
    },
    {
      "id": 52,
      "start": 111.27999877929688,
      "end": 112.27999877929688,
      "text": " it was not from anyone."
    },
    {
      "id": 53,
      "start": 112.27999877929688,
      "end": 115.0,
      "text": " It was a mass mailing type of an email."
    },
    {
      "id": 54,
      "start": 115.0,
      "end": 116.87999725341797,
      "text": " But the question in the subject line was this,"
    },
    {
      "id": 55,
      "start": 116.87999725341797,
      "end": 118.4000015258789,
      "text": " are we living in the last days?"
    },
    {
      "id": 56,
      "start": 118.4000015258789,
      "end": 120.87999725341797,
      "text": " And it's like, if you have to ask the question,"
    },
    {
      "id": 57,
      "start": 120.87999725341797,
      "end": 122.86000061035156,
      "text": " I'm not sure where we're going here, right?"
    },
    {
      "id": 58,
      "start": 122.86000061035156,
      "end": 125.5999984741211,
      "text": " Because obviously, if you know anything"
    },
    {
      "id": 59,
      "start": 125.5999984741211,
      "end": 127.58000183105469,
      "text": " about that phrase, last days,"
    },
    {
      "id": 60,
      "start": 127.58000183105469,
      "end": 130.8000030517578,
      "text": " we are absolutely living in the last days."
    },
    {
      "id": 61,
      "start": 130.8000030517578,
      "end": 133.0,
      "text": " And we find that in these evil days,"
    },
    {
      "id": 62,
      "start": 133.0,
      "end": 137.1199951171875,
      "text": " in these last days, that we need strength."
    },
    {
      "id": 63,
      "start": 137.97999572753906,
      "end": 142.16000366210938,
      "text": " We need strength to stand in an evil day."
    },
    {
      "id": 64,
      "start": 142.16000366210938,
      "end": 144.47999572753906,
      "text": " And the reality is that that strength"
    },
    {
      "id": 65,
      "start": 144.47999572753906,
      "end": 147.0399932861328,
      "text": " is not gonna come by your willpower."
    },
    {
      "id": 66,
      "start": 147.0399932861328,
      "end": 150.39999389648438,
      "text": " It's not gonna come by your physical power."
    },
    {
      "id": 67,
      "start": 150.39999389648438,
      "end": 153.1999969482422,
      "text": " The strength to stand in the evil day"
    },
    {
      "id": 68,
      "start": 153.1999969482422,
      "end": 157.27999877929688,
      "text": " is going to be a result of prayer power."
    },
    {
      "id": 69,
      "start": 157.27999877929688,
      "end": 158.75999450683594,
      "text": " And the reality this morning is that"
    },
    {
      "id": 70,
      "start": 158.75999450683594,
      "end": 160.36000061035156,
      "text": " in Ephesians chapter number six,"
    },
    {
      "id": 71,
      "start": 160.36000061035156,
      "end": 164.0800018310547,
      "text": " as God is giving to the believers in Ephesus,"
    },
    {
      "id": 72,
      "start": 164.0800018310547,
      "end": 166.33999633789062,
      "text": " to us by way of preservation,"
    },
    {
      "id": 73,
      "start": 166.33999633789062,
      "end": 168.44000244140625,
      "text": " the whole armor of God,"
    },
    {
      "id": 74,
      "start": 168.44000244140625,
      "end": 170.9600067138672,
      "text": " he concludes the section by speaking"
    },
    {
      "id": 75,
      "start": 170.9600067138672,
      "end": 173.75999450683594,
      "text": " about the importance of prayer."
    },
    {
      "id": 76,
      "start": 173.75999450683594,
      "end": 175.55999755859375,
      "text": " In verse number 18 of Ephesians six,"
    },
    {
      "id": 77,
      "start": 175.55999755859375,
      "end": 176.55999755859375,
      "text": " you can look at it later,"
    },
    {
      "id": 78,
      "start": 176.55999755859375,
      "end": 178.36000061035156,
      "text": " and you can see that he emphasizes"
    },
    {
      "id": 79,
      "start": 178.36000061035156,
      "end": 180.9600067138672,
      "text": " after he goes through all of the armor"
    },
    {
      "id": 80,
      "start": 180.9600067138672,
      "end": 182.47999572753906,
      "text": " and putting on the whole armor of God,"
    },
    {
      "id": 81,
      "start": 182.47999572753906,
      "end": 185.1199951171875,
      "text": " he talks about praying always"
    },
    {
      "id": 82,
      "start": 185.1199951171875,
      "end": 186.47999572753906,
      "text": " in the importance of prayer."
    },
    {
      "id": 83,
      "start": 186.47999572753906,
      "end": 189.36000061035156,
      "text": " We understand that the church in Thessalonica"
    },
    {
      "id": 84,
      "start": 189.36000061035156,
      "end": 191.27999877929688,
      "text": " is told pray without ceasing."
    },
    {
      "id": 85,
      "start": 191.27999877929688,
      "end": 193.9600067138672,
      "text": " We understand that our Lord and Savior Jesus Christ,"
    },
    {
      "id": 86,
      "start": 193.9600067138672,
      "end": 195.8800048828125,
      "text": " he prayed often."
    },
    {
      "id": 87,
      "start": 195.8800048828125,
      "end": 197.8000030517578,
      "text": " But I want you to consider with me this morning"
    },
    {
      "id": 88,
      "start": 197.8000030517578,
      "end": 199.8000030517578,
      "text": " as we think about some foundational truth"
    },
    {
      "id": 89,
      "start": 199.8000030517578,
      "end": 201.55999755859375,
      "text": " with regard to prayer,"
    },
    {
      "id": 90,
      "start": 201.55999755859375,
      "end": 202.8000030517578,
      "text": " I would say this."
    },
    {
      "id": 91,
      "start": 202.83999633789062,
      "end": 204.72000122070312,
      "text": " We must be mindful of the fact"
    },
    {
      "id": 92,
      "start": 204.72000122070312,
      "end": 207.67999267578125,
      "text": " that an invitation has been extended."
    },
    {
      "id": 93,
      "start": 207.67999267578125,
      "end": 209.8000030517578,
      "text": " Prayer is the unique privilege"
    },
    {
      "id": 94,
      "start": 209.8000030517578,
      "end": 212.1199951171875,
      "text": " that is reserved for the child of God."
    },
    {
      "id": 95,
      "start": 212.1199951171875,
      "end": 216.0800018310547,
      "text": " God Almighty has extended an invitation"
    },
    {
      "id": 96,
      "start": 216.0800018310547,
      "end": 219.75999450683594,
      "text": " to you and to me and to every one of his people"
    },
    {
      "id": 97,
      "start": 219.75999450683594,
      "end": 222.36000061035156,
      "text": " to enter into his presence."
    },
    {
      "id": 98,
      "start": 222.36000061035156,
      "end": 225.1999969482422,
      "text": " What a great invitation."
    },
    {
      "id": 99,
      "start": 225.1999969482422,
      "end": 227.63999938964844,
      "text": " Remember the words that he spoke to Jeremiah"
    },
    {
      "id": 100,
      "start": 227.63999938964844,
      "end": 228.9600067138672,
      "text": " in Jeremiah 33,"
    },
    {
      "id": 101,
      "start": 228.9600067138672,
      "end": 231.0,
      "text": " call unto me."
    },
    {
      "id": 102,
      "start": 231.0,
      "end": 232.39999389648438,
      "text": " Right, isn't that wonderful?"
    },
    {
      "id": 103,
      "start": 233.0,
      "end": 235.36000061035156,
      "text": " This invitation that the God of the universe,"
    },
    {
      "id": 104,
      "start": 235.36000061035156,
      "end": 238.39999389648438,
      "text": " God Almighty, my heavenly Father,"
    },
    {
      "id": 105,
      "start": 238.39999389648438,
      "end": 240.16000366210938,
      "text": " he says call unto me."
    },
    {
      "id": 106,
      "start": 240.16000366210938,
      "end": 241.1199951171875,
      "text": " And then he says this,"
    },
    {
      "id": 107,
      "start": 241.1199951171875,
      "end": 244.36000061035156,
      "text": " and I will answer thee."
    },
    {
      "id": 108,
      "start": 244.36000061035156,
      "end": 245.60000610351562,
      "text": " Isn't that precious?"
    },
    {
      "id": 109,
      "start": 245.60000610351562,
      "end": 248.44000244140625,
      "text": " And show thee great and mighty things"
    },
    {
      "id": 110,
      "start": 248.44000244140625,
      "end": 249.8800048828125,
      "text": " which thou knowest not."
    },
    {
      "id": 111,
      "start": 249.8800048828125,
      "end": 252.32000732421875,
      "text": " Consider the words of Jesus in Matthew 7."
    },
    {
      "id": 112,
      "start": 252.32000732421875,
      "end": 256.1199951171875,
      "text": " He says, ask and it shall be given unto you."
    },
    {
      "id": 113,
      "start": 256.1199951171875,
      "end": 258.2799987792969,
      "text": " Seek and ye shall find."
    },
    {
      "id": 114,
      "start": 258.2799987792969,
      "end": 260.67999267578125,
      "text": " Knock and it shall be opened unto you"
    },
    {
      "id": 115,
      "start": 260.7200012207031,
      "end": 263.239990234375,
      "text": " for everyone that asketh receiveth."
    },
    {
      "id": 116,
      "start": 263.239990234375,
      "end": 264.3599853515625,
      "text": " Do you remember what James says?"
    },
    {
      "id": 117,
      "start": 264.3599853515625,
      "end": 267.44000244140625,
      "text": " You have not because you ask not."
    },
    {
      "id": 118,
      "start": 267.44000244140625,
      "end": 270.2799987792969,
      "text": " He also says you have not because you ask amidst."
    },
    {
      "id": 119,
      "start": 270.2799987792969,
      "end": 272.32000732421875,
      "text": " But I want you to think about what Jesus says."
    },
    {
      "id": 120,
      "start": 272.32000732421875,
      "end": 274.6400146484375,
      "text": " For everyone that asketh receiveth"
    },
    {
      "id": 121,
      "start": 274.6400146484375,
      "end": 276.55999755859375,
      "text": " and he that seeketh findeth"
    },
    {
      "id": 122,
      "start": 276.55999755859375,
      "end": 279.0400085449219,
      "text": " and to him that knocketh it shall be opened."
    },
    {
      "id": 123,
      "start": 279.0400085449219,
      "end": 280.79998779296875,
      "text": " Notice the analogy that he uses"
    },
    {
      "id": 124,
      "start": 280.79998779296875,
      "end": 282.760009765625,
      "text": " or what man is there of you"
    },
    {
      "id": 125,
      "start": 282.760009765625,
      "end": 285.0,
      "text": " whom if his son ask bread,"
    },
    {
      "id": 126,
      "start": 285.0,
      "end": 286.4800109863281,
      "text": " will he give him a stone?"
    },
    {
      "id": 127,
      "start": 287.9200134277344,
      "end": 289.7200012207031,
      "text": " Now not one among us."
    },
    {
      "id": 128,
      "start": 289.7200012207031,
      "end": 290.6000061035156,
      "text": " Amen?"
    },
    {
      "id": 129,
      "start": 291.6000061035156,
      "end": 293.32000732421875,
      "text": " In fact, even if it's not your son,"
    },
    {
      "id": 130,
      "start": 293.32000732421875,
      "end": 294.2799987792969,
      "text": " but he uses that analogy,"
    },
    {
      "id": 131,
      "start": 294.2799987792969,
      "end": 295.6400146484375,
      "text": " but if somebody comes to you and ask for bread,"
    },
    {
      "id": 132,
      "start": 295.6400146484375,
      "end": 297.0400085449219,
      "text": " you're not gonna give him a stone."
    },
    {
      "id": 133,
      "start": 297.0400085449219,
      "end": 298.44000244140625,
      "text": " He says, or if he ask a fish,"
    },
    {
      "id": 134,
      "start": 298.44000244140625,
      "end": 300.760009765625,
      "text": " will he give him a serpent?"
    },
    {
      "id": 135,
      "start": 300.760009765625,
      "end": 301.8399963378906,
      "text": " No."
    },
    {
      "id": 136,
      "start": 303.239990234375,
      "end": 305.4800109863281,
      "text": " No, that's not how we'd respond."
    },
    {
      "id": 137,
      "start": 305.4800109863281,
      "end": 308.32000732421875,
      "text": " And notice the powerful truth."
    },
    {
      "id": 138,
      "start": 308.32000732421875,
      "end": 311.3999938964844,
      "text": " If ye then, being evil,"
    },
    {
      "id": 139,
      "start": 311.3999938964844,
      "end": 315.6000061035156,
      "text": " know how to give good gifts unto your children,"
    },
    {
      "id": 140,
      "start": 315.6000061035156,
      "end": 318.4800109863281,
      "text": " how much more?"
    },
    {
      "id": 141,
      "start": 318.4800109863281,
      "end": 320.0400085449219,
      "text": " How much more?"
    },
    {
      "id": 142,
      "start": 320.0400085449219,
      "end": 323.20001220703125,
      "text": " Let those words sing, how much more"
    },
    {
      "id": 143,
      "start": 323.20001220703125,
      "end": 326.239990234375,
      "text": " shall your Father which is in heaven"
    },
    {
      "id": 144,
      "start": 326.239990234375,
      "end": 331.239990234375,
      "text": " give good things to them that ask him?"
    },
    {
      "id": 145,
      "start": 331.4800109863281,
      "end": 335.0799865722656,
      "text": " He said, ask, ask,"
    },
    {
      "id": 146,
      "start": 335.0799865722656,
      "end": 337.1600036621094,
      "text": " and it shall be given you."
    },
    {
      "id": 147,
      "start": 337.1600036621094,
      "end": 338.0400085449219,
      "text": " Isn't that precious?"
    },
    {
      "id": 148,
      "start": 338.0400085449219,
      "end": 341.8399963378906,
      "text": " This invitation that's been extended."
    },
    {
      "id": 149,
      "start": 341.8399963378906,
      "end": 343.5199890136719,
      "text": " I know that I've said to my children,"
    },
    {
      "id": 150,
      "start": 343.5199890136719,
      "end": 345.5199890136719,
      "text": " if you need help, just ask."
    },
    {
      "id": 151,
      "start": 345.5199890136719,
      "end": 347.67999267578125,
      "text": " Perhaps you've said that to your children."
    },
    {
      "id": 152,
      "start": 347.67999267578125,
      "end": 349.1199951171875,
      "text": " Perhaps you've said it to a spouse"
    },
    {
      "id": 153,
      "start": 349.1199951171875,
      "end": 350.0400085449219,
      "text": " or maybe to someone else."
    },
    {
      "id": 154,
      "start": 350.0400085449219,
      "end": 352.760009765625,
      "text": " You say, just ask, how often, however,"
    },
    {
      "id": 155,
      "start": 352.760009765625,
      "end": 355.8800048828125,
      "text": " do we observe people that do not ask for help"
    },
    {
      "id": 156,
      "start": 355.8800048828125,
      "end": 358.55999755859375,
      "text": " and struggle to complete the task?"
    },
    {
      "id": 157,
      "start": 360.0799865722656,
      "end": 360.9200134277344,
      "text": " Why?"
    },
    {
      "id": 158,
      "start": 360.9200134277344,
      "end": 362.760009765625,
      "text": " Because they don't wanna ask for help."
    },
    {
      "id": 159,
      "start": 362.760009765625,
      "end": 364.32000732421875,
      "text": " Whether it's because of pride,"
    },
    {
      "id": 160,
      "start": 364.32000732421875,
      "end": 366.7200012207031,
      "text": " whether it's because they don't wanna inconvenience you."
    },
    {
      "id": 161,
      "start": 366.7200012207031,
      "end": 367.55999755859375,
      "text": " Has anyone ever said to you,"
    },
    {
      "id": 162,
      "start": 367.55999755859375,
      "end": 368.5199890136719,
      "text": " well, I didn't ask you for help"
    },
    {
      "id": 163,
      "start": 368.5199890136719,
      "end": 370.5199890136719,
      "text": " because I didn't wanna inconvenience you."
    },
    {
      "id": 164,
      "start": 370.5199890136719,
      "end": 371.7200012207031,
      "text": " Anyone ever say that to you?"
    },
    {
      "id": 165,
      "start": 371.7200012207031,
      "end": 372.9599914550781,
      "text": " I've been told that."
    },
    {
      "id": 166,
      "start": 372.9599914550781,
      "end": 376.2799987792969,
      "text": " Can I tell you, you can't inconvenience God."
    },
    {
      "id": 167,
      "start": 376.2799987792969,
      "end": 377.239990234375,
      "text": " Amen?"
    },
    {
      "id": 168,
      "start": 377.239990234375,
      "end": 378.79998779296875,
      "text": " It is impossible."
    },
    {
      "id": 169,
      "start": 379.4800109863281,
      "end": 382.5199890136719,
      "text": " The Bible tells us that he is a very present help"
    },
    {
      "id": 170,
      "start": 382.5199890136719,
      "end": 383.9599914550781,
      "text": " in the time of trouble."
    },
    {
      "id": 171,
      "start": 383.9599914550781,
      "end": 386.239990234375,
      "text": " The reality of God's word is that God"
    },
    {
      "id": 172,
      "start": 386.239990234375,
      "end": 389.1199951171875,
      "text": " is not only available to help us,"
    },
    {
      "id": 173,
      "start": 389.1199951171875,
      "end": 391.1199951171875,
      "text": " but he is able to help us."
    },
    {
      "id": 174,
      "start": 391.1199951171875,
      "end": 394.20001220703125,
      "text": " And when you combine those two truths,"
    },
    {
      "id": 175,
      "start": 394.20001220703125,
      "end": 397.44000244140625,
      "text": " it is so powerful because he's always available"
    },
    {
      "id": 176,
      "start": 397.44000244140625,
      "end": 398.9200134277344,
      "text": " and he's always able."
    },
    {
      "id": 177,
      "start": 398.9200134277344,
      "end": 400.32000732421875,
      "text": " He said, ask."
    },
    {
      "id": 178,
      "start": 400.32000732421875,
      "end": 402.6000061035156,
      "text": " He said, call unto me in invitation."
    },
    {
      "id": 179,
      "start": 402.6000061035156,
      "end": 404.79998779296875,
      "text": " I want you to understand that God's given us"
    },
    {
      "id": 180,
      "start": 404.79998779296875,
      "end": 407.8399963378906,
      "text": " many promises in his word with regard to prayer."
    },
    {
      "id": 181,
      "start": 408.8800048828125,
      "end": 410.7200012207031,
      "text": " We find that throughout the Psalms,"
    },
    {
      "id": 182,
      "start": 410.7200012207031,
      "end": 413.1600036621094,
      "text": " the Psalmist regularly records"
    },
    {
      "id": 183,
      "start": 413.1600036621094,
      "end": 416.2799987792969,
      "text": " and speaks about how the Lord heard him,"
    },
    {
      "id": 184,
      "start": 416.2799987792969,
      "end": 418.0799865722656,
      "text": " how the Lord heard my cry,"
    },
    {
      "id": 185,
      "start": 418.0799865722656,
      "end": 419.8399963378906,
      "text": " how the Lord heard my prayer."
    },
    {
      "id": 186,
      "start": 419.8399963378906,
      "end": 422.20001220703125,
      "text": " And you think about the joy of that"
    },
    {
      "id": 187,
      "start": 422.20001220703125,
      "end": 424.6400146484375,
      "text": " and you think about the reality that God says,"
    },
    {
      "id": 188,
      "start": 424.6400146484375,
      "end": 428.7200012207031,
      "text": " if you call, if you ask, that I will respond."
    },
    {
      "id": 189,
      "start": 428.7200012207031,
      "end": 431.20001220703125,
      "text": " He gave us this promise in Ephesians three"
    },
    {
      "id": 190,
      "start": 431.20001220703125,
      "end": 434.1199951171875,
      "text": " that he's able to do exceeding abundantly above"
    },
    {
      "id": 191,
      "start": 434.1199951171875,
      "end": 436.1600036621094,
      "text": " all that we ask or think."
    },
    {
      "id": 192,
      "start": 436.1600036621094,
      "end": 437.5199890136719,
      "text": " We're familiar with the truth"
    },
    {
      "id": 193,
      "start": 437.5199890136719,
      "end": 440.3999938964844,
      "text": " of Hebrews chapter number four and verse number 16"
    },
    {
      "id": 194,
      "start": 440.3999938964844,
      "end": 442.6400146484375,
      "text": " when he says that we're to come boldly"
    },
    {
      "id": 195,
      "start": 442.6400146484375,
      "end": 444.55999755859375,
      "text": " under the throne of grace."
    },
    {
      "id": 196,
      "start": 444.55999755859375,
      "end": 447.0400085449219,
      "text": " You think about that picture in your mind,"
    },
    {
      "id": 197,
      "start": 447.0400085449219,
      "end": 450.20001220703125,
      "text": " understanding that Jesus as our great high priest,"
    },
    {
      "id": 198,
      "start": 450.20001220703125,
      "end": 453.20001220703125,
      "text": " that he's provided that access"
    },
    {
      "id": 199,
      "start": 453.20001220703125,
      "end": 456.8800048828125,
      "text": " and that now you and I have the privilege"
    },
    {
      "id": 200,
      "start": 456.8800048828125,
      "end": 459.6000061035156,
      "text": " of going boldly under the throne of grace"
    },
    {
      "id": 201,
      "start": 459.6000061035156,
      "end": 461.79998779296875,
      "text": " that we may obtain mercy and find grace"
    },
    {
      "id": 202,
      "start": 461.79998779296875,
      "end": 463.32000732421875,
      "text": " to help in time of need."
    },
    {
      "id": 203,
      "start": 463.32000732421875,
      "end": 465.0,
      "text": " Think about this promise from the book"
    },
    {
      "id": 204,
      "start": 465.0,
      "end": 466.9599914550781,
      "text": " that we've been studying and we're not there yet"
    },
    {
      "id": 205,
      "start": 466.9599914550781,
      "end": 468.79998779296875,
      "text": " because it's first John chapter number five,"
    },
    {
      "id": 206,
      "start": 468.79998779296875,
      "end": 471.8399963378906,
      "text": " but in first John five and verse number 14,"
    },
    {
      "id": 207,
      "start": 471.8399963378906,
      "end": 475.0799865722656,
      "text": " notice the way that it says this truth that says,"
    },
    {
      "id": 208,
      "start": 475.0799865722656,
      "end": 478.79998779296875,
      "text": " and this is the confidence that we have in him."
    },
    {
      "id": 209,
      "start": 478.79998779296875,
      "end": 481.5199890136719,
      "text": " Now I like being confident, don't you?"
    },
    {
      "id": 210,
      "start": 481.5199890136719,
      "end": 483.44000244140625,
      "text": " We have confidence, let me tell you this,"
    },
    {
      "id": 211,
      "start": 483.44000244140625,
      "end": 488.0,
      "text": " your confidence in Christ is never going to waver"
    },
    {
      "id": 212,
      "start": 488.0,
      "end": 490.8800048828125,
      "text": " from the perspective of him failing you."
    },
    {
      "id": 213,
      "start": 490.8800048828125,
      "end": 493.239990234375,
      "text": " Now, whether you have confidence in him or not"
    },
    {
      "id": 214,
      "start": 493.239990234375,
      "end": 495.7200012207031,
      "text": " is another story, but the reality is that"
    },
    {
      "id": 215,
      "start": 495.7200012207031,
      "end": 497.3999938964844,
      "text": " we can trust him."
    },
    {
      "id": 216,
      "start": 497.3999938964844,
      "end": 499.79998779296875,
      "text": " Great is thy faithfulness, amen?"
    },
    {
      "id": 217,
      "start": 499.79998779296875,
      "end": 502.760009765625,
      "text": " He is trustworthy, he is dependable,"
    },
    {
      "id": 218,
      "start": 502.760009765625,
      "end": 505.0,
      "text": " and we find that he says the,"
    },
    {
      "id": 219,
      "start": 505.0,
      "end": 508.32000732421875,
      "text": " and this is the confidence that we have in him"
    },
    {
      "id": 220,
      "start": 508.32000732421875,
      "end": 513.3200073242188,
      "text": " that if we ask anything according to his will,"
    },
    {
      "id": 221,
      "start": 513.6400146484375,
      "end": 515.719970703125,
      "text": " he heareth us."
    },
    {
      "id": 222,
      "start": 515.719970703125,
      "end": 518.1199951171875,
      "text": " Doesn't that encourage your heart this morning?"
    },
    {
      "id": 223,
      "start": 519.719970703125,
      "end": 522.52001953125,
      "text": " I mean, when you consider the invitation"
    },
    {
      "id": 224,
      "start": 522.52001953125,
      "end": 524.760009765625,
      "text": " that's been extended, when you consider the promises"
    },
    {
      "id": 225,
      "start": 524.7999877929688,
      "end": 526.7999877929688,
      "text": " that God has given us in his word,"
    },
    {
      "id": 226,
      "start": 526.7999877929688,
      "end": 528.8800048828125,
      "text": " as we think about these foundational truths,"
    },
    {
      "id": 227,
      "start": 528.8800048828125,
      "end": 530.52001953125,
      "text": " I want you to consider answered prayer,"
    },
    {
      "id": 228,
      "start": 530.52001953125,
      "end": 532.5599975585938,
      "text": " the testimonies throughout the word of God"
    },
    {
      "id": 229,
      "start": 532.5599975585938,
      "end": 533.52001953125,
      "text": " of answered prayer."
    },
    {
      "id": 230,
      "start": 533.52001953125,
      "end": 536.5999755859375,
      "text": " Listen, answered prayer ought to encourage us."
    },
    {
      "id": 231,
      "start": 536.5999755859375,
      "end": 539.4000244140625,
      "text": " It ought to drive us to our knees more often"
    },
    {
      "id": 232,
      "start": 539.4000244140625,
      "end": 542.8400268554688,
      "text": " because we know that our God hears and answers prayer."
    },
    {
      "id": 233,
      "start": 542.8400268554688,
      "end": 546.47998046875,
      "text": " I think about, you could fill in the blanks this morning."
    },
    {
      "id": 234,
      "start": 546.47998046875,
      "end": 548.8400268554688,
      "text": " You can think about all of those that have gone before us,"
    },
    {
      "id": 235,
      "start": 548.8400268554688,
      "end": 551.47998046875,
      "text": " Abraham, Isaac, and Jacob, and I mean,"
    },
    {
      "id": 236,
      "start": 551.47998046875,
      "end": 554.0800170898438,
      "text": " you just start thinking about Moses and Joshua,"
    },
    {
      "id": 237,
      "start": 554.1199951171875,
      "end": 557.280029296875,
      "text": " and you think about Daniel and David and Isaiah,"
    },
    {
      "id": 238,
      "start": 557.280029296875,
      "end": 560.6400146484375,
      "text": " and I mean, you just start naming all these people of God"
    },
    {
      "id": 239,
      "start": 560.6400146484375,
      "end": 564.52001953125,
      "text": " that they heard from God, they prayed,"
    },
    {
      "id": 240,
      "start": 564.52001953125,
      "end": 567.4000244140625,
      "text": " they saw the face of God, and God answered."
    },
    {
      "id": 241,
      "start": 568.8800048828125,
      "end": 572.6799926757812,
      "text": " Paul, Peter, John."
    },
    {
      "id": 242,
      "start": 572.6799926757812,
      "end": 575.1199951171875,
      "text": " I mean, we just go on and on."
    },
    {
      "id": 243,
      "start": 575.1199951171875,
      "end": 578.47998046875,
      "text": " And think about all of the records that we have"
    },
    {
      "id": 244,
      "start": 578.47998046875,
      "end": 581.7999877929688,
      "text": " in the Bible that record for us"
    },
    {
      "id": 245,
      "start": 582.1599731445312,
      "end": 586.0399780273438,
      "text": " the way in which prayer was heard and prayer was answered."
    },
    {
      "id": 246,
      "start": 586.0399780273438,
      "end": 588.9199829101562,
      "text": " You remember Elijah, he prayed."
    },
    {
      "id": 247,
      "start": 590.239990234375,
      "end": 594.9199829101562,
      "text": " In fact, the example is used by James"
    },
    {
      "id": 248,
      "start": 594.9199829101562,
      "end": 597.6400146484375,
      "text": " when he speaks about the effectual fervent prayer"
    },
    {
      "id": 249,
      "start": 597.6400146484375,
      "end": 599.280029296875,
      "text": " of a righteous man availeth much,"
    },
    {
      "id": 250,
      "start": 599.280029296875,
      "end": 601.47998046875,
      "text": " he uses the example of the righteous man."
    },
    {
      "id": 0,
      "start": 601.47998046875,
      "end": 609.5999803543091,
      "text": " example of Elijah praying in the Old Testament. Elisha prayed. Hezekiah prayed. And as we"
    },
    {
      "id": 1,
      "start": 609.5999803543091,
      "end": 614.6399803161621,
      "text": " read the Word of God and we see all of these testimonies of answered prayer, they all encourage"
    },
    {
      "id": 2,
      "start": 614.6399803161621,
      "end": 621.4399795532227,
      "text": " us. When we think about these foundational truths, and as I take a moment to just meditate"
    },
    {
      "id": 3,
      "start": 621.4399795532227,
      "end": 626.0799808502197,
      "text": " upon those foundational truths, I believe that it leads me to a place, and really the"
    },
    {
      "id": 4,
      "start": 626.0799808502197,
      "end": 632.1199798583984,
      "text": " message this morning is a place in my life where I'm going to evaluate my own prayer"
    },
    {
      "id": 5,
      "start": 632.1199798583984,
      "end": 638.1199798583984,
      "text": " life. And I'm going to, with the help of God, seek to determine the place of prayer in my"
    },
    {
      "id": 6,
      "start": 638.1199798583984,
      "end": 645.8399810791016,
      "text": " life. I'm not asking you this morning to evaluate the place of prayer in my life. I'm not asking"
    },
    {
      "id": 7,
      "start": 645.8399810791016,
      "end": 650.6799812316895,
      "text": " you this morning to evaluate the place of prayer in your neighbor's life, in your spouse's"
    },
    {
      "id": 8,
      "start": 650.6799812316895,
      "end": 655.7999801635742,
      "text": " life, in your child's life, in some other member's life. I'm asking each of us this"
    },
    {
      "id": 9,
      "start": 655.7999801635742,
      "end": 664.7599792480469,
      "text": " morning to humbly, before the Lord, to evaluate the place of prayer in our own lives personally."
    },
    {
      "id": 10,
      "start": 664.7599792480469,
      "end": 669.0199813842773,
      "text": " I don't want to evaluate the place of prayer in your life. I want to evaluate the place"
    },
    {
      "id": 11,
      "start": 669.0199813842773,
      "end": 674.7199783325195,
      "text": " of prayer in my life. And as we think about 1 Timothy chapter number 2, I believe that"
    },
    {
      "id": 12,
      "start": 674.7199783325195,
      "end": 680.6799774169922,
      "text": " God provides us with some important truth regarding the place of prayer in our lives."
    },
    {
      "id": 13,
      "start": 680.6799774169922,
      "end": 684.1599807739258,
      "text": " Notice in 1 Timothy chapter number 2, beginning in verse number 1, the Bible says,"
    },
    {
      "id": 14,
      "start": 684.1599807739258,
      "end": 689.7199783325195,
      "text": " I exhort, therefore, that, first of all, supplications, prayers, intercessions, and giving of thanks"
    },
    {
      "id": 15,
      "start": 689.7199783325195,
      "end": 694.5599822998047,
      "text": " be made for all men, for kings and for all that are in authority, that we may lead a"
    },
    {
      "id": 16,
      "start": 694.5599822998047,
      "end": 699.4999771118164,
      "text": " quiet and peaceable life in all godliness and honesty. For this is good and acceptable"
    },
    {
      "id": 17,
      "start": 699.4999771118164,
      "end": 704.0799789428711,
      "text": " in the sight of God our Savior, who will have all men to be saved and to come unto the knowledge"
    },
    {
      "id": 18,
      "start": 704.1199798583984,
      "end": 709.2399826049805,
      "text": " of the truth. For there is one God and one Mediator between God and man, the man Christ"
    },
    {
      "id": 19,
      "start": 709.2399826049805,
      "end": 716.359977722168,
      "text": " Jesus. Aren't you thankful for that? Notice what he did. He gave himself a ransom for"
    },
    {
      "id": 20,
      "start": 716.359977722168,
      "end": 723.359977722168,
      "text": " all to be testified in due time, whereunto I am ordained a preacher and an apostle."
    },
    {
      "id": 21,
      "start": 723.6399841308594,
      "end": 730.6399841308594,
      "text": " I speak the truth in Christ and lie not, a teacher of the Gentiles in faith and verity."
    },
    {
      "id": 22,
      "start": 731.0399780273438,
      "end": 738.0399780273438,
      "text": " I will, therefore, that men pray everywhere, lifting up holy hands without wrath and doubting."
    },
    {
      "id": 23,
      "start": 742.7199859619141,
      "end": 747.6799774169922,
      "text": " Anytime you read the Word of God and you find that God tells us that something is good and"
    },
    {
      "id": 24,
      "start": 747.6799774169922,
      "end": 751.5199737548828,
      "text": " acceptable in His sight, we ought to take note of that. Amen?"
    },
    {
      "id": 25,
      "start": 751.5199737548828,
      "end": 755.8399810791016,
      "text": " And here in this passage of Scripture, we find that very reference in verse number 3,"
    },
    {
      "id": 26,
      "start": 756.1599731445312,
      "end": 761.8799743652344,
      "text": " but as we consider this morning some truth from this passage that would help us in this"
    },
    {
      "id": 27,
      "start": 761.8799743652344,
      "end": 767.1599731445312,
      "text": " process of evaluation, I would say, number one, that prayer is a priority. Prayer is"
    },
    {
      "id": 28,
      "start": 767.1599731445312,
      "end": 773.1599731445312,
      "text": " a priority. Notice what he says in verse number 1, I exhort, therefore, that first of all"
    },
    {
      "id": 29,
      "start": 773.1599731445312,
      "end": 779.1999816894531,
      "text": " – note those words – first of all, not second, not third, not last, but first of"
    },
    {
      "id": 30,
      "start": 779.1999816894531,
      "end": 786.1999816894531,
      "text": " all, that supplications, prayers, intercessions, and giving of thanks be made for all men."
    },
    {
      "id": 31,
      "start": 787.8799743652344,
      "end": 792.8799743652344,
      "text": " There's a priority in our text of Scripture that is placed upon prayer. The reality is"
    },
    {
      "id": 32,
      "start": 792.8799743652344,
      "end": 798.1599731445312,
      "text": " that prayer should be my first response and not my last resort. There are times, however,"
    },
    {
      "id": 33,
      "start": 798.1599731445312,
      "end": 802.8399810791016,
      "text": " in my life, and if you'd be honest in evaluating your life this morning, that we try all sorts"
    },
    {
      "id": 34,
      "start": 802.8399810791016,
      "end": 806.7599792480469,
      "text": " of things to figure it out, and then we come to the place when we say, maybe I should pray"
    },
    {
      "id": 35,
      "start": 806.7599792480469,
      "end": 813.7599792480469,
      "text": " about this. But prayer should be our first response. In fact, without turning there,"
    },
    {
      "id": 36,
      "start": 814.5999755859375,
      "end": 819.6399841308594,
      "text": " but in James 5, in verse 13 and 14, in both of those verses, there are questions that"
    },
    {
      "id": 37,
      "start": 819.6399841308594,
      "end": 824.2399749755859,
      "text": " are asked. The first one in verse 13, are any afflicted? You know what the answer is?"
    },
    {
      "id": 38,
      "start": 824.2399749755859,
      "end": 830.0799865722656,
      "text": " Let them pray. In verse 14, are any sick? You know what the answer is? Let them pray."
    },
    {
      "id": 39,
      "start": 830.0799865722656,
      "end": 837.0799865722656,
      "text": " Let them call for the elders. I understand the innocence, but let them pray. The response."
    },
    {
      "id": 40,
      "start": 837.2199859619141,
      "end": 841.7999877929688,
      "text": " Someone said this. I believe it was John R. Rice. He said, all of our problems are prayer"
    },
    {
      "id": 41,
      "start": 841.7999877929688,
      "end": 848.6399841308594,
      "text": " problems. Man, that helps us to focus on that priority of prayer. The reality is that I"
    },
    {
      "id": 42,
      "start": 848.6399841308594,
      "end": 855.6399841308594,
      "text": " can't preach a message with the power of God if I've not first prayed. Amen? You can't"
    },
    {
      "id": 43,
      "start": 856.3599853515625,
      "end": 862.9599914550781,
      "text": " live the life that you're supposed to live and have that godly testimony in the midst"
    },
    {
      "id": 44,
      "start": 862.9599914550781,
      "end": 867.1199951171875,
      "text": " of your home, in the midst of your family, in the midst of your neighbors, in the midst"
    },
    {
      "id": 45,
      "start": 867.1199951171875,
      "end": 873.8799743652344,
      "text": " of your co-workers, without praying. The reality is that we can go and we can try to reach"
    },
    {
      "id": 46,
      "start": 873.8799743652344,
      "end": 880.1999816894531,
      "text": " our community and reach the world with the gospel, but we must first pray, because we"
    },
    {
      "id": 47,
      "start": 880.1999816894531,
      "end": 887.1999816894531,
      "text": " need the power of God. God has ordained it. We see it all throughout His Word that prayer"
    },
    {
      "id": 48,
      "start": 887.8399658203125,
      "end": 894.8399658203125,
      "text": " moves the hand of God. We can argue the finer points and we can ask the questions as to"
    },
    {
      "id": 49,
      "start": 895.6799926757812,
      "end": 902.6799926757812,
      "text": " why that is, but the reality is that we must simply accept that God has set it to be so."
    },
    {
      "id": 50,
      "start": 902.8399658203125,
      "end": 909.8399658203125,
      "text": " That prayer moves the hand of God. That ought to encourage us. We're to pray. We're to pray."
    },
    {
      "id": 51,
      "start": 910.239990234375,
      "end": 915.0799865722656,
      "text": " We're to pray about everything. And we're to have prayer as a priority. It's interesting"
    },
    {
      "id": 52,
      "start": 915.0799865722656,
      "end": 920.9199829101562,
      "text": " in the text of Scripture that he says that, first of all, supplications, prayers, intercessions,"
    },
    {
      "id": 53,
      "start": 920.9199829101562,
      "end": 924.9599914550781,
      "text": " giving of thanks be made for all men. Notice what he says, for kings and for all that are"
    },
    {
      "id": 54,
      "start": 924.9599914550781,
      "end": 930.7599792480469,
      "text": " in authority. Then it says this, that we may lead a quiet and peaceable life in all godliness"
    },
    {
      "id": 55,
      "start": 930.7599792480469,
      "end": 936.7999877929688,
      "text": " and honesty. You ever wonder about that verse of Scripture? You know, the reality of we'd"
    },
    {
      "id": 56,
      "start": 936.7999877929688,
      "end": 940.0799865722656,
      "text": " be honest this morning with one another, it's a whole lot easier for us to complain"
    },
    {
      "id": 57,
      "start": 940.0799865722656,
      "end": 947.0799865722656,
      "text": " about those in authority than it is to pray for them. Amen? I'm talking to myself this"
    },
    {
      "id": 58,
      "start": 947.4399719238281,
      "end": 954.4399719238281,
      "text": " morning. It's a whole lot easier for us to criticize, to complain about those that are"
    },
    {
      "id": 59,
      "start": 958.2799682617188,
      "end": 964.2799682617188,
      "text": " in authority than it is for us to pray for them. But we're to pray for those that are"
    },
    {
      "id": 60,
      "start": 964.2799682617188,
      "end": 969.9599914550781,
      "text": " in authority. And then notice what he says, that we may lead a quiet and peaceable life"
    },
    {
      "id": 61,
      "start": 969.9599914550781,
      "end": 975.8399658203125,
      "text": " in all godliness and honesty. Why? Because God moves and God works. You know the truth"
    },
    {
      "id": 62,
      "start": 975.8399658203125,
      "end": 982.5999755859375,
      "text": " of Proverbs 21, a verse of Scripture that we've often referred to over the years and"
    },
    {
      "id": 63,
      "start": 982.5999755859375,
      "end": 987.9199829101562,
      "text": " rightly so, and what powerful truth it is when God gives us this truth with regard to"
    },
    {
      "id": 64,
      "start": 987.9199829101562,
      "end": 994.1799926757812,
      "text": " His power. And he says this, that the king's heart is in the hand of the Lord. As the rivers"
    },
    {
      "id": 65,
      "start": 994.1799926757812,
      "end": 1001.1799926757812,
      "text": " of water, He, God, turneth it whithersoever He will. Do you believe that? God is able."
    },
    {
      "id": 66,
      "start": 1002.0599670410156,
      "end": 1009.0199890136719,
      "text": " You read throughout the book of Ezra and Nehemiah and you can see how God moved the heart of"
    },
    {
      "id": 67,
      "start": 1009.0199890136719,
      "end": 1016.0199890136719,
      "text": " some wicked kings, some ungodly kings, how God moved and how God worked and how God responded"
    },
    {
      "id": 68,
      "start": 1016.8999938964844,
      "end": 1023.8999938964844,
      "text": " to the prayer of His people. When they're rebuilding, they're praying. Repeatedly you"
    },
    {
      "id": 69,
      "start": 1024.8999938964844,
      "end": 1030.1799926757812,
      "text": " can read of the times of prayer. Oh, there was a work to be done, but they understood"
    },
    {
      "id": 70,
      "start": 1030.1799926757812,
      "end": 1035.4599914550781,
      "text": " the importance of prayer. This morning, there's a priority that is placed upon prayer. I would"
    },
    {
      "id": 71,
      "start": 1035.4599914550781,
      "end": 1042.4599914550781,
      "text": " say this, that prayer demonstrates our dependence. When I pray, I'm demonstrating my dependence"
    },
    {
      "id": 72,
      "start": 1043.3399658203125,
      "end": 1050.3399658203125,
      "text": " upon God. Someone said this, that prayer is not an escape from our responsibility. Rather,"
    },
    {
      "id": 73,
      "start": 1053.0599670410156,
      "end": 1060.0599670410156,
      "text": " prayer is our response to God's ability. You know, sometimes we use the phrase and we hear"
    },
    {
      "id": 74,
      "start": 1062.8999938964844,
      "end": 1069.8999938964844,
      "text": " the phrase used, I'll pray for you, and sometimes we think that's just a discounted response."
    },
    {
      "id": 75,
      "start": 1070.219970703125,
      "end": 1075.1799926757812,
      "text": " But you know the reality is that that's the greatest thing we could do for anyone, is"
    },
    {
      "id": 76,
      "start": 1075.1799926757812,
      "end": 1082.1799926757812,
      "text": " to pray for them. To pray for them. We find that He says that first of all, prayer is"
    },
    {
      "id": 77,
      "start": 1083.8199768066406,
      "end": 1088.9399719238281,
      "text": " a priority. Let me say this, prayer is pleasing to our Lord. We find that it says in verse"
    },
    {
      "id": 78,
      "start": 1088.9399719238281,
      "end": 1095.9399719238281,
      "text": " number three, for this is good and acceptable in the sight of God our Savior. What is good"
    },
    {
      "id": 79,
      "start": 1096.5399780273438,
      "end": 1100.8999938964844,
      "text": " and acceptable? That we're praying, that we're going to His face, that we're seeking Him."
    },
    {
      "id": 80,
      "start": 1100.8999938964844,
      "end": 1104.9399719238281,
      "text": " We notice that He says that who will have all men to be saved and come unto the knowledge"
    },
    {
      "id": 81,
      "start": 1104.9399719238281,
      "end": 1108.2799682617188,
      "text": " of the truth. You know that God is not willing that any should perish, but that all should"
    },
    {
      "id": 82,
      "start": 1108.2799682617188,
      "end": 1113.1399841308594,
      "text": " come to repentance? You know how you and I need to be praying for those that are in authority"
    },
    {
      "id": 83,
      "start": 1113.1399841308594,
      "end": 1119.5599975585938,
      "text": " that God would save them? You know why those in authority make decisions that we disagree"
    },
    {
      "id": 84,
      "start": 1119.5999755859375,
      "end": 1126.5999755859375,
      "text": " with so often is because they're lost. They're lost people that are operating as lost people."
    },
    {
      "id": 85,
      "start": 1127.760009765625,
      "end": 1134.760009765625,
      "text": " Why should we be surprised by that? We pray for them. We pray for their salvation. That"
    },
    {
      "id": 86,
      "start": 1135.3599853515625,
      "end": 1141.3599853515625,
      "text": " God would bring someone into their presence, that someone would cross their path that has"
    },
    {
      "id": 87,
      "start": 1141.3599853515625,
      "end": 1146.6399536132812,
      "text": " the boldness and the courage to preach the gospel of Jesus Christ, that the Holy Spirit"
    },
    {
      "id": 88,
      "start": 1146.6399536132812,
      "end": 1153.6399536132812,
      "text": " of God would work and move as only He can. We pray. We pray for souls to be saved. Notice"
    },
    {
      "id": 89,
      "start": 1154.7999877929688,
      "end": 1159.9599609375,
      "text": " it says there's one God and one mediator between God and men, the man Christ Jesus, and what"
    },
    {
      "id": 90,
      "start": 1159.9599609375,
      "end": 1165.4400024414062,
      "text": " joy that is. You can go directly to God through the Lord Jesus Christ. You don't need some"
    },
    {
      "id": 91,
      "start": 1165.4400024414062,
      "end": 1171.5999755859375,
      "text": " other person that you go through, and I'm thankful for that reality that tells us how"
    },
    {
      "id": 92,
      "start": 1171.719970703125,
      "end": 1177.5599975585938,
      "text": " He gave Himself a ransom for all. I'm thankful that Jesus died in my place and your place"
    },
    {
      "id": 93,
      "start": 1177.5599975585938,
      "end": 1182.5999755859375,
      "text": " and that He rose conquering sin, death, and the grave, that He ever liveth to make intercession"
    },
    {
      "id": 94,
      "start": 1182.5999755859375,
      "end": 1189.5999755859375,
      "text": " for us, that one day, one glorious day, He's coming back. And what a joy that is. And Paul"
    },
    {
      "id": 95,
      "start": 1189.760009765625,
      "end": 1195.1599731445312,
      "text": " says as he's writing to Timothy, whereunto I am ordained a preacher and apostle. I speak"
    },
    {
      "id": 96,
      "start": 1195.199951171875,
      "end": 1201.199951171875,
      "text": " the truth in Christ and lie not, a teacher of the Gentiles in faith and verity, faith"
    },
    {
      "id": 97,
      "start": 1201.199951171875,
      "end": 1201.5599975585938,
      "text": " and truth."
    },
    {
      "id": 0,
      "start": 1201.5599975585938,
      "end": 1207.3999977111816,
      "text": " truth, but then notice what Paul says in verse number eight after he's speaking about prayer"
    },
    {
      "id": 1,
      "start": 1207.3999977111816,
      "end": 1211.799997329712,
      "text": " in the church and the importance and the priority and the fact that it's pleasing to God. Notice"
    },
    {
      "id": 2,
      "start": 1211.799997329712,
      "end": 1220.4399967193604,
      "text": " what he says, I will therefore that men pray everywhere lifting up holy hands without wrath"
    },
    {
      "id": 3,
      "start": 1220.4399967193604,
      "end": 1225.879997253418,
      "text": " and doubting. Can I tell you this morning that prayer is going to require a plan. You're not"
    },
    {
      "id": 4,
      "start": 1225.879997253418,
      "end": 1234.3599967956543,
      "text": " going to pray by accident. You really aren't. I never pray by accident. I just don't. If I just"
    },
    {
      "id": 5,
      "start": 1234.3599967956543,
      "end": 1239.879997253418,
      "text": " jump into my day and I just get into it and all sorts of things happen and I get emails and text"
    },
    {
      "id": 6,
      "start": 1239.879997253418,
      "end": 1244.8399963378906,
      "text": " messages and phone calls and the kind of days that you have and you have so many things going on,"
    },
    {
      "id": 7,
      "start": 1244.8399963378906,
      "end": 1252.03999710083,
      "text": " the busyness of life, the reality is that if I don't have a time and a purpose and a plan,"
    },
    {
      "id": 8,
      "start": 1252.7599983215332,
      "end": 1257.9599990844727,
      "text": " it gets away from us. And all of a sudden, we look at the clock and we say, man, I haven't"
    },
    {
      "id": 9,
      "start": 1257.9599990844727,
      "end": 1263.0799980163574,
      "text": " even prayed yet. I haven't had my time with the Lord yet. Then we've got to have a plan."
    },
    {
      "id": 10,
      "start": 1263.7199974060059,
      "end": 1269.479995727539,
      "text": " We've got to make it a priority. This morning, before I ever even, I walked through the front"
    },
    {
      "id": 11,
      "start": 1269.479995727539,
      "end": 1275.2399978637695,
      "text": " door this morning from the fellowship hall. It's closer to my house and just joking with you guys,"
    },
    {
      "id": 12,
      "start": 1275.2399978637695,
      "end": 1279.0,
      "text": " amen. But I walked through that door. I walked through there so I could take care of a couple"
    },
    {
      "id": 13,
      "start": 1279.0,
      "end": 1282.6800003051758,
      "text": " things over there actually. And then before I ever went to my office this morning, I stopped"
    },
    {
      "id": 14,
      "start": 1282.6800003051758,
      "end": 1288.759994506836,
      "text": " here and prayed. I spent a season in prayer right there this morning. Why? Because once I go to my"
    },
    {
      "id": 15,
      "start": 1288.759994506836,
      "end": 1295.9599990844727,
      "text": " office, man, there's all kinds of stuff going on. We've got to have a plan. Let me say this."
    },
    {
      "id": 16,
      "start": 1295.9599990844727,
      "end": 1301.879997253418,
      "text": " When we think about this evaluation this morning and we think about the place of prayer in our"
    },
    {
      "id": 17,
      "start": 1301.879997253418,
      "end": 1305.7999954223633,
      "text": " lives, I want to look at it from two aspects. All of that really was just introduction."
    },
    {
      "id": 18,
      "start": 1306.2799987792969,
      "end": 1309.7999954223633,
      "text": " And I know it's our passage of Scripture. It was really just introduction. And some of you say,"
    },
    {
      "id": 19,
      "start": 1309.7999954223633,
      "end": 1314.5199966430664,
      "text": " my notebook's full already. It's 11.20 already. I know. I'll try to keep it brief."
    },
    {
      "id": 20,
      "start": 1315.7200012207031,
      "end": 1321.0799942016602,
      "text": " From two perspectives, number one, the place of prayer in our lives personally,"
    },
    {
      "id": 21,
      "start": 1322.4399948120117,
      "end": 1329.0799942016602,
      "text": " personally, each one of us evaluating our own lives. I would ask this question this morning."
    },
    {
      "id": 22,
      "start": 1329.0799942016602,
      "end": 1332.8399963378906,
      "text": " I've asked it of myself and I would ask you to ask yourself,"
    },
    {
      "id": 23,
      "start": 1334.1999969482422,
      "end": 1343.0,
      "text": " what words would best describe our prayer life? If we were to honestly evaluate our prayer lives"
    },
    {
      "id": 24,
      "start": 1343.0,
      "end": 1349.0800018310547,
      "text": " personally in the place of prayer in our lives, what words would best describe it?"
    },
    {
      "id": 25,
      "start": 1351.239990234375,
      "end": 1357.6399993896484,
      "text": " I'm not even going to provide you any suggestions. I'd rather you just evaluate and ask the Lord to"
    },
    {
      "id": 26,
      "start": 1357.6399993896484,
      "end": 1365.1600036621094,
      "text": " help you evaluate. God, how best would my prayer life be described? I want you to turn to the book"
    },
    {
      "id": 27,
      "start": 1365.1600036621094,
      "end": 1370.0399932861328,
      "text": " of Acts, if you will, and I want you to look at an example. The example is of Paul at this"
    },
    {
      "id": 28,
      "start": 1370.0399932861328,
      "end": 1376.8399963378906,
      "text": " particular time, Acts chapter 9. His name is still Saul. But I want you to think about this personally"
    },
    {
      "id": 29,
      "start": 1376.8399963378906,
      "end": 1385.239990234375,
      "text": " from this evaluation. What place does prayer have in my life personally? And I want you to think"
    },
    {
      "id": 30,
      "start": 1385.239990234375,
      "end": 1391.3199920654297,
      "text": " about the Apostle Paul. I want you to notice in Acts chapter 9, we're familiar with the passage of"
    },
    {
      "id": 31,
      "start": 1391.3199920654297,
      "end": 1395.8000030517578,
      "text": " Scripture and he's journeying. He comes near to Damascus according to verse number three and"
    },
    {
      "id": 32,
      "start": 1395.8000030517578,
      "end": 1402.6799926757812,
      "text": " there's a bright light that shines from heaven. We find that the Lord speaks to him. He hears this"
    },
    {
      "id": 33,
      "start": 1402.6799926757812,
      "end": 1412.4400024414062,
      "text": " voice in verse number four, Saul, Saul, why persecutest thou me? We find that the response is,"
    },
    {
      "id": 34,
      "start": 1412.4400024414062,
      "end": 1419.6399993896484,
      "text": " who art thou, Lord? And then he asked the question after Jesus tells him, I am Jesus whom"
    },
    {
      "id": 35,
      "start": 1419.6399993896484,
      "end": 1426.1199951171875,
      "text": " thou persecutest. He then says, what wilt thou have me to do? He says, Lord, what wilt thou have"
    },
    {
      "id": 36,
      "start": 1426.1199951171875,
      "end": 1432.3600006103516,
      "text": " me to do? And the Bible tells us in verse number six that the response, the Lord says to him, arise"
    },
    {
      "id": 37,
      "start": 1432.3600006103516,
      "end": 1439.3999938964844,
      "text": " and go into the city and it shall be told thee what thou must do. That's interesting because God's"
    },
    {
      "id": 38,
      "start": 1439.3999938964844,
      "end": 1445.239990234375,
      "text": " going to speak to someone else here in just a moment as we go through the passage and Ananias"
    },
    {
      "id": 39,
      "start": 1445.239990234375,
      "end": 1451.479995727539,
      "text": " is going to receive this instruction. But I want you to see that Jesus told him to go to the city"
    },
    {
      "id": 40,
      "start": 1451.479995727539,
      "end": 1456.8399963378906,
      "text": " and see and go there and it shall be told thee what thou must do. Notice in verse number seven,"
    },
    {
      "id": 41,
      "start": 1456.8399963378906,
      "end": 1461.7200012207031,
      "text": " the men which journeyed with him stood speechless, hearing a voice, but seeing no man. And Saul"
    },
    {
      "id": 42,
      "start": 1461.7200012207031,
      "end": 1467.239990234375,
      "text": " arose from the earth and when his eyes were opened, he saw no man, but they led him by the hand and"
    },
    {
      "id": 43,
      "start": 1467.239990234375,
      "end": 1473.3200073242188,
      "text": " brought him into Damascus. And he was there three days. He was three days without sight, it says,"
    },
    {
      "id": 44,
      "start": 1473.3200073242188,
      "end": 1479.8800048828125,
      "text": " and neither did eat nor drink. Notice verse number 10, there was a certain disciple at Damascus named"
    },
    {
      "id": 45,
      "start": 1479.8800048828125,
      "end": 1486.2000122070312,
      "text": " Ananias. And to him said the Lord in a vision, Ananias. And he said, behold, I am here, Lord."
    },
    {
      "id": 46,
      "start": 1487.0,
      "end": 1494.2799987792969,
      "text": " Notice what the Lord says, arise and go into the street, which is called straight and inquire in"
    },
    {
      "id": 47,
      "start": 1494.2799987792969,
      "end": 1506.2000122070312,
      "text": " the house of Judas for one called Saul of Tarsus, for behold, he prayeth. He prayeth."
    },
    {
      "id": 48,
      "start": 1507.9599914550781,
      "end": 1513.6399841308594,
      "text": " What was Paul doing? I understand Saul, we refer to him as Paul. He was praying. Let me ask you in"
    },
    {
      "id": 49,
      "start": 1513.6399841308594,
      "end": 1519.239990234375,
      "text": " verse number six, did Jesus tell him to go pray? Actually didn't. It's not recorded that Jesus"
    },
    {
      "id": 50,
      "start": 1519.239990234375,
      "end": 1527.8800048828125,
      "text": " said, go into the city and pray. But Paul's praying. He's praying. Jesus told him, it shall"
    },
    {
      "id": 51,
      "start": 1527.8800048828125,
      "end": 1533.3999938964844,
      "text": " be told thee what thou must do. We can only assume what it is that Paul was praying, the direction in"
    },
    {
      "id": 52,
      "start": 1533.3999938964844,
      "end": 1538.6799926757812,
      "text": " which he was seeking. We understand that he met the Lord. His life was changed. He was saved. This"
    },
    {
      "id": 53,
      "start": 1538.6799926757812,
      "end": 1544.3599853515625,
      "text": " is his testimony of salvation in this passage of Scripture. We find that the Bible tells us,"
    },
    {
      "id": 54,
      "start": 1544.3599853515625,
      "end": 1548.760009765625,
      "text": " as you continue reading on, that Ananias is concerned. He's saying, listen, we know about"
    },
    {
      "id": 55,
      "start": 1548.760009765625,
      "end": 1555.0,
      "text": " this guy and you really want me to go. And we find that the Lord graciously speaks to Ananias and"
    },
    {
      "id": 56,
      "start": 1555.0,
      "end": 1560.8399963378906,
      "text": " tells him that he's chosen. Notice in verse number 15, after the objection, the Bible says that the"
    },
    {
      "id": 57,
      "start": 1560.8399963378906,
      "end": 1566.8399963378906,
      "text": " Lord said unto him, go thy way for he is a chosen vessel unto me to bear my name before the Gentiles"
    },
    {
      "id": 58,
      "start": 1566.8399963378906,
      "end": 1571.3200073242188,
      "text": " and kings and the children of Israel. For I will show him how great things he must suffer for my"
    },
    {
      "id": 59,
      "start": 1571.3200073242188,
      "end": 1578.0400085449219,
      "text": " name's sake. And Ananias went his way, entered into the house, and putting his hands on him,"
    },
    {
      "id": 60,
      "start": 1578.0400085449219,
      "end": 1583.8800048828125,
      "text": " said, brother, saw the Lord, even Jesus, that appeared unto thee in the way as thou camest,"
    },
    {
      "id": 61,
      "start": 1583.8800048828125,
      "end": 1587.7200012207031,
      "text": " hath sent me, that thou mightest receive thy sight and be filled with the Holy Ghost. And"
    },
    {
      "id": 62,
      "start": 1587.7200012207031,
      "end": 1591.6399841308594,
      "text": " we see that he then preaches and all that takes place. And of course, we're familiar with the life"
    },
    {
      "id": 63,
      "start": 1591.6399841308594,
      "end": 1597.0799865722656,
      "text": " of Paul. But I want you to just think for a moment as we evaluate our lives personally and how Paul,"
    },
    {
      "id": 64,
      "start": 1597.0799865722656,
      "end": 1602.3599853515625,
      "text": " right after his conversion, that when Jesus speaks to Ananias and says, listen, Ananias,"
    },
    {
      "id": 65,
      "start": 1602.3599853515625,
      "end": 1606.6000061035156,
      "text": " I have a task for you, and I want you to go into the city, and he tells him what street to go to,"
    },
    {
      "id": 66,
      "start": 1606.6000061035156,
      "end": 1610.9199829101562,
      "text": " and he tells me he's going to go to a house, and you're going to find one named Saul, and he's"
    },
    {
      "id": 67,
      "start": 1610.9199829101562,
      "end": 1619.8800048828125,
      "text": " praying. That's powerful to me. It's impactful to me to see the response of Saul just after his"
    },
    {
      "id": 68,
      "start": 1619.8800048828125,
      "end": 1626.2000122070312,
      "text": " conversion that he's praying. We know much about the Apostle Paul. We read of his missionary"
    },
    {
      "id": 69,
      "start": 1626.2000122070312,
      "end": 1632.2000122070312,
      "text": " journeys. We read much of his letters, and we read in those letters how that under the inspiration"
    },
    {
      "id": 70,
      "start": 1632.2000122070312,
      "end": 1637.8800048828125,
      "text": " of the Holy Spirit of God that he tells those recipients, whether they be individuals or"
    },
    {
      "id": 71,
      "start": 1637.8800048828125,
      "end": 1646.1199951171875,
      "text": " whether they be churches, he tells them how he's praying for them regularly. Paul says,"
    },
    {
      "id": 72,
      "start": 1646.1199951171875,
      "end": 1650.1199951171875,
      "text": " I'm praying for you. And he doesn't just say, I'm praying for you, but he tells them how"
    },
    {
      "id": 73,
      "start": 1650.8399963378906,
      "end": 1653.8800048828125,
      "text": " he's praying for them. Paul is a man of prayer."
    },
    {
      "id": 74,
      "start": 1655.9599914550781,
      "end": 1659.3999938964844,
      "text": " Paul understood the importance of prayer. He understood that in his life there was a priority"
    },
    {
      "id": 75,
      "start": 1659.3999938964844,
      "end": 1666.4400024414062,
      "text": " placed upon prayer. And we find that Paul is praying here in Acts 9, and we find that that's"
    },
    {
      "id": 76,
      "start": 1666.4400024414062,
      "end": 1672.6000061035156,
      "text": " his response, and we find that that becomes a pattern in his life, and not a pattern such as"
    },
    {
      "id": 77,
      "start": 1672.6000061035156,
      "end": 1678.1199951171875,
      "text": " rote religion, not a pattern as in, I said my prayers, quote unquote. That's not the idea of"
    },
    {
      "id": 78,
      "start": 1678.1199951171875,
      "end": 1685.6399841308594,
      "text": " praying. It's not rote religion. I'm talking to my Father. Amen? I belong to Him. I've been"
    },
    {
      "id": 79,
      "start": 1685.6399841308594,
      "end": 1691.4800109863281,
      "text": " adopted in His family. We mentioned last week, or two weeks ago from 1 John, how that He spoke"
    },
    {
      "id": 80,
      "start": 1691.4800109863281,
      "end": 1696.2000122070312,
      "text": " about the little children and the young men and the fathers, and we spoke about the little children,"
    },
    {
      "id": 81,
      "start": 1696.2000122070312,
      "end": 1700.9199829101562,
      "text": " how that at salvation, there's just a couple of things that we learn right away. Number one,"
    },
    {
      "id": 82,
      "start": 1700.9199829101562,
      "end": 1708.2799987792969,
      "text": " our sins are forgiven. Number two, He's my Father, and I'm speaking to Him. It's not some recorded"
    },
    {
      "id": 83,
      "start": 1708.2799987792969,
      "end": 1712.9199829101562,
      "text": " prayer. It's not some printed out, I just take a prayer book, and I just pray these prayers,"
    },
    {
      "id": 84,
      "start": 1712.9199829101562,
      "end": 1718.2000122070312,
      "text": " and they're just vain repetitions. No, it's not praying so that someone could look at me. By the"
    },
    {
      "id": 85,
      "start": 1718.2000122070312,
      "end": 1723.0,
      "text": " way, Jesus spoke of those religious leaders that prayed in that manner, and He said they have their"
    },
    {
      "id": 86,
      "start": 1723.0,
      "end": 1727.8800048828125,
      "text": " reward. You know what their reward was? The recognition of man. But He said, when you pray,"
    },
    {
      "id": 87,
      "start": 1727.8800048828125,
      "end": 1737.8800048828125,
      "text": " enter into your closet. Amen? And we pray to our Father. We pour our heart out unto Him. Last"
    },
    {
      "id": 88,
      "start": 1737.8800048828125,
      "end": 1743.0,
      "text": " Sunday morning in Sunday school, Psalm 62.8, we didn't deal with a miracle. We've been dealing"
    },
    {
      "id": 89,
      "start": 1743.0,
      "end": 1747.47998046875,
      "text": " with miracles, but God just impressed that passage of Scripture, that verse of Scripture,"
    },
    {
      "id": 90,
      "start": 1747.47998046875,
      "end": 1751.5599975585938,
      "text": " upon my heart. I couldn't get away from it all week, and we dealt with it last Sunday morning"
    },
    {
      "id": 91,
      "start": 1751.5599975585938,
      "end": 1757.0,
      "text": " in Sunday school, and how the psalmist told us that we're to trust in Him at all times, and we're to"
    },
    {
      "id": 92,
      "start": 1757.0,
      "end": 1767.0,
      "text": " pour our heart out before Him. Hannah did that. David did that on more than one occasion. The"
    },
    {
      "id": 93,
      "start": 1767.0,
      "end": 1772.0399780273438,
      "text": " people of God that I mentioned by way of introduction this morning, that testimony of"
    },
    {
      "id": 94,
      "start": 1772.0399780273438,
      "end": 1776.2799682617188,
      "text": " answered prayer, they pour their heart out to God. Why? For He's a refuge for us."
    },
    {
      "id": 95,
      "start": 1779.6400146484375,
      "end": 1783.3200073242188,
      "text": " You don't need a prayer book that has some recorded prayers that someone wrote down."
    },
    {
      "id": 96,
      "start": 1784.0399780273438,
      "end": 1789.8800048828125,
      "text": " You just need to pour your heart out to God. Paul's praying. Paul tells the people that he"
    },
    {
      "id": 97,
      "start": 1789.8800048828125,
      "end": 1794.6799926757812,
      "text": " ministers to that he's praying for him. Paul asks the people that he's ministering to to pray for"
    },
    {
      "id": 98,
      "start": 1794.6799926757812,
      "end": 1801.47998046875,
      "text": " him. Often throughout the Scriptures, you find that Paul will ask the question. In fact, in Ephesians 6,"
    },
    {
      "id": 0,
      "start": 1801.47998046875,
      "end": 1803.6799805164337,
      "text": " when he talks about after the armor of God"
    },
    {
      "id": 1,
      "start": 1803.6799805164337,
      "end": 1806.399980545044,
      "text": " that I mentioned earlier, how that he says praying always,"
    },
    {
      "id": 2,
      "start": 1806.399980545044,
      "end": 1808.8399806022644,
      "text": " he then specifically says, and pray for me."
    },
    {
      "id": 3,
      "start": 1810.439980506897,
      "end": 1813.47998046875,
      "text": " He asked the believers in Thessalonica this way."
    },
    {
      "id": 4,
      "start": 1813.47998046875,
      "end": 1816.9999809265137,
      "text": " He says, brethren, pray for us."
    },
    {
      "id": 5,
      "start": 1816.9999809265137,
      "end": 1819.1199798583984,
      "text": " He tells the believers in the church in Colossae"
    },
    {
      "id": 6,
      "start": 1819.1199798583984,
      "end": 1821.4599800109863,
      "text": " to pray for him and to pray for them"
    },
    {
      "id": 7,
      "start": 1821.4599800109863,
      "end": 1823.2399806976318,
      "text": " that the doors would be opened,"
    },
    {
      "id": 8,
      "start": 1823.2399806976318,
      "end": 1825.319980621338,
      "text": " that he would speak with boldness"
    },
    {
      "id": 9,
      "start": 1825.319980621338,
      "end": 1827.2599811553955,
      "text": " the way that he's supposed to speak."
    },
    {
      "id": 10,
      "start": 1828.3599796295166,
      "end": 1831.3799800872803,
      "text": " No wonder in 1 Timothy 2, in verse number eight,"
    },
    {
      "id": 11,
      "start": 1831.3799800872803,
      "end": 1836.3399810791016,
      "text": " he says, I will therefore that men pray everywhere,"
    },
    {
      "id": 12,
      "start": 1836.3399810791016,
      "end": 1839.2399787902832,
      "text": " lifting up holy hands without wrath and doubting."
    },
    {
      "id": 13,
      "start": 1839.2399787902832,
      "end": 1841.97998046875,
      "text": " Paul understood the importance of prayer."
    },
    {
      "id": 14,
      "start": 1841.97998046875,
      "end": 1844.2999801635742,
      "text": " What a great example for us this morning."
    },
    {
      "id": 15,
      "start": 1844.2999801635742,
      "end": 1846.7999801635742,
      "text": " When we evaluate our lives personally,"
    },
    {
      "id": 16,
      "start": 1848.4599800109863,
      "end": 1851.579978942871,
      "text": " personally, what place does prayer have in my life?"
    },
    {
      "id": 17,
      "start": 1851.579978942871,
      "end": 1854.0199813842773,
      "text": " Number two, and I'll be done with this this morning,"
    },
    {
      "id": 18,
      "start": 1854.0199813842773,
      "end": 1858.8599815368652,
      "text": " when I evaluate prayer and when I ask the question,"
    },
    {
      "id": 19,
      "start": 1858.8599815368652,
      "end": 1861.3399810791016,
      "text": " the place of prayer in our lives,"
    },
    {
      "id": 20,
      "start": 1862.1799812316895,
      "end": 1865.8199768066406,
      "text": " yes, personally, but number two, corporately, corporately."
    },
    {
      "id": 21,
      "start": 1865.8199768066406,
      "end": 1868.8999786376953,
      "text": " I mentioned this two, three weeks ago now,"
    },
    {
      "id": 22,
      "start": 1868.8999786376953,
      "end": 1871.4999771118164,
      "text": " the first Sunday that we started praying before our service,"
    },
    {
      "id": 23,
      "start": 1871.4999771118164,
      "end": 1874.97998046875,
      "text": " we start with a song and then we have a season of prayer."
    },
    {
      "id": 24,
      "start": 1874.97998046875,
      "end": 1877.5399780273438,
      "text": " I believe God's pleased with that, by the way."
    },
    {
      "id": 25,
      "start": 1877.5399780273438,
      "end": 1881.1399841308594,
      "text": " It encourages my heart to hear the voices of people praying."
    },
    {
      "id": 26,
      "start": 1882.1799774169922,
      "end": 1886.359977722168,
      "text": " How sweet that must be in the ears of God, amen?"
    },
    {
      "id": 27,
      "start": 1887.5199813842773,
      "end": 1890.7399826049805,
      "text": " Jesus said this in Matthew 21 in verse number 13,"
    },
    {
      "id": 28,
      "start": 1891.1399841308594,
      "end": 1893.0599822998047,
      "text": " and this is the verse that I said that Sunday morning"
    },
    {
      "id": 29,
      "start": 1893.0599822998047,
      "end": 1895.9399795532227,
      "text": " that we first changed the order of our services"
    },
    {
      "id": 30,
      "start": 1895.9399795532227,
      "end": 1898.599983215332,
      "text": " and made this emphasis on prayer corporately."
    },
    {
      "id": 31,
      "start": 1898.599983215332,
      "end": 1902.4399795532227,
      "text": " He said, by house shall be called the house of prayer."
    },
    {
      "id": 32,
      "start": 1903.2599792480469,
      "end": 1904.97998046875,
      "text": " And just in case we weren't clear"
    },
    {
      "id": 33,
      "start": 1904.97998046875,
      "end": 1907.5599822998047,
      "text": " as to what house he was speaking of,"
    },
    {
      "id": 34,
      "start": 1907.5599822998047,
      "end": 1911.0199813842773,
      "text": " we find that in 1 Timothy chapter three in verse number 15,"
    },
    {
      "id": 35,
      "start": 1911.0199813842773,
      "end": 1912.97998046875,
      "text": " that the word of God plainly teaches"
    },
    {
      "id": 36,
      "start": 1912.97998046875,
      "end": 1917.97998046875,
      "text": " that the house of God is the church of the living God, amen?"
    },
    {
      "id": 37,
      "start": 1918.1399841308594,
      "end": 1919.3999786376953,
      "text": " Amen?"
    },
    {
      "id": 38,
      "start": 1919.3999786376953,
      "end": 1921.6999816894531,
      "text": " So he wasn't specifically just speaking"
    },
    {
      "id": 39,
      "start": 1921.6999816894531,
      "end": 1925.099983215332,
      "text": " about the temple, his house."
    },
    {
      "id": 40,
      "start": 1925.099983215332,
      "end": 1926.4199829101562,
      "text": " This is God's house."
    },
    {
      "id": 41,
      "start": 1926.4199829101562,
      "end": 1927.7799835205078,
      "text": " You know that the Lord Jesus Christ"
    },
    {
      "id": 42,
      "start": 1927.7799835205078,
      "end": 1929.099983215332,
      "text": " is the head of the church?"
    },
    {
      "id": 43,
      "start": 1930.6999816894531,
      "end": 1931.8999786376953,
      "text": " Someone was asking me recently"
    },
    {
      "id": 44,
      "start": 1931.8999786376953,
      "end": 1936.1399841308594,
      "text": " about the church polity in a Baptist church."
    },
    {
      "id": 45,
      "start": 1936.1399841308594,
      "end": 1938.5399780273438,
      "text": " And the church polity in a Baptist church"
    },
    {
      "id": 46,
      "start": 1938.5399780273438,
      "end": 1941.5799865722656,
      "text": " differs from church polity in some other churches."
    },
    {
      "id": 47,
      "start": 1941.5799865722656,
      "end": 1942.8999786376953,
      "text": " I began to explain some things,"
    },
    {
      "id": 48,
      "start": 1942.8999786376953,
      "end": 1944.0199737548828,
      "text": " and I said first and foremost,"
    },
    {
      "id": 49,
      "start": 1944.0199737548828,
      "end": 1947.959976196289,
      "text": " the Lord Jesus Christ is the head of the church, amen?"
    },
    {
      "id": 50,
      "start": 1948.8199768066406,
      "end": 1949.9399871826172,
      "text": " I'm thankful for that."
    },
    {
      "id": 51,
      "start": 1949.9399871826172,
      "end": 1952.0599822998047,
      "text": " It's his church."
    },
    {
      "id": 52,
      "start": 1952.0599822998047,
      "end": 1956.5399780273438,
      "text": " And he said, my house shall be a house of prayer."
    },
    {
      "id": 53,
      "start": 1956.5399780273438,
      "end": 1958.5799865722656,
      "text": " Should be a house of prayer."
    },
    {
      "id": 54,
      "start": 1958.5799865722656,
      "end": 1960.0599822998047,
      "text": " I want you to think about the example"
    },
    {
      "id": 55,
      "start": 1960.0599822998047,
      "end": 1963.8599853515625,
      "text": " when we think about the place of prayer in our lives,"
    },
    {
      "id": 56,
      "start": 1963.8599853515625,
      "end": 1965.5799865722656,
      "text": " not just personally but corporately."
    },
    {
      "id": 57,
      "start": 1965.5799865722656,
      "end": 1967.6199798583984,
      "text": " Turn to Acts 12, if you will."
    },
    {
      "id": 58,
      "start": 1967.6199798583984,
      "end": 1969.8199768066406,
      "text": " We're in Acts nine looking at the life of Paul,"
    },
    {
      "id": 59,
      "start": 1969.8199768066406,
      "end": 1971.4199829101562,
      "text": " but now I want you to look in Acts 12"
    },
    {
      "id": 60,
      "start": 1971.4199829101562,
      "end": 1974.499984741211,
      "text": " and the context of Acts chapter number 12"
    },
    {
      "id": 61,
      "start": 1974.499984741211,
      "end": 1976.1799774169922,
      "text": " is the situation with Peter."
    },
    {
      "id": 62,
      "start": 1976.1799774169922,
      "end": 1978.2999877929688,
      "text": " We know that James has already been killed."
    },
    {
      "id": 63,
      "start": 1978.2999877929688,
      "end": 1979.5799865722656,
      "text": " According to verse number two,"
    },
    {
      "id": 64,
      "start": 1979.5799865722656,
      "end": 1982.6999816894531,
      "text": " Herod's killed James, and then he takes Peter,"
    },
    {
      "id": 65,
      "start": 1982.6999816894531,
      "end": 1985.1399841308594,
      "text": " and he's intending to kill Peter as well."
    },
    {
      "id": 66,
      "start": 1985.1399841308594,
      "end": 1987.8199768066406,
      "text": " And we know that that's taking place."
    },
    {
      "id": 67,
      "start": 1987.8199768066406,
      "end": 1989.8199768066406,
      "text": " And Herod, why does he wanna kill Peter?"
    },
    {
      "id": 68,
      "start": 1989.8199768066406,
      "end": 1991.7999877929688,
      "text": " Well, he saw that it pleased the people,"
    },
    {
      "id": 69,
      "start": 1991.7999877929688,
      "end": 1994.8999786376953,
      "text": " the Jews in particular, that he killed James,"
    },
    {
      "id": 70,
      "start": 1994.8999786376953,
      "end": 1996.8599853515625,
      "text": " and so therefore he takes Peter,"
    },
    {
      "id": 71,
      "start": 1996.8599853515625,
      "end": 1998.2799835205078,
      "text": " according to verse number three."
    },
    {
      "id": 72,
      "start": 1998.2799835205078,
      "end": 2001.6199798583984,
      "text": " But I want you to think of what takes place here"
    },
    {
      "id": 73,
      "start": 2001.6199798583984,
      "end": 2003.1999816894531,
      "text": " in Acts chapter number 12."
    },
    {
      "id": 74,
      "start": 2003.1999816894531,
      "end": 2005.2999877929688,
      "text": " Notice the Bible says in verse number five,"
    },
    {
      "id": 75,
      "start": 2005.2999877929688,
      "end": 2008.0599822998047,
      "text": " Peter therefore was kept in prison."
    },
    {
      "id": 76,
      "start": 2009.1399841308594,
      "end": 2010.459976196289,
      "text": " He was kept in prison."
    },
    {
      "id": 77,
      "start": 2010.459976196289,
      "end": 2012.8599853515625,
      "text": " He was gonna be there for a short period of time,"
    },
    {
      "id": 78,
      "start": 2012.8599853515625,
      "end": 2015.3799743652344,
      "text": " and then after which we understand"
    },
    {
      "id": 79,
      "start": 2015.3799743652344,
      "end": 2017.7799835205078,
      "text": " that Herod would bring him forth to kill him."
    },
    {
      "id": 80,
      "start": 2018.7799835205078,
      "end": 2022.4199829101562,
      "text": " And the Bible tells us in Acts 12 in verse number five,"
    },
    {
      "id": 81,
      "start": 2022.4199829101562,
      "end": 2024.3799743652344,
      "text": " I want you to notice, it says Peter therefore"
    },
    {
      "id": 82,
      "start": 2024.3799743652344,
      "end": 2027.0399780273438,
      "text": " was kept in prison, but then notice the next phrase,"
    },
    {
      "id": 83,
      "start": 2027.0399780273438,
      "end": 2031.499984741211,
      "text": " but prayer was made without ceasing"
    },
    {
      "id": 84,
      "start": 2031.499984741211,
      "end": 2035.5199737548828,
      "text": " of the church unto God for him."
    },
    {
      "id": 85,
      "start": 2038.7799835205078,
      "end": 2041.7799835205078,
      "text": " As you know, often I like to, as I read"
    },
    {
      "id": 86,
      "start": 2041.7799835205078,
      "end": 2043.3599853515625,
      "text": " and as I preach the word of God,"
    },
    {
      "id": 87,
      "start": 2043.3599853515625,
      "end": 2046.6999816894531,
      "text": " I like to put myself in the setting."
    },
    {
      "id": 88,
      "start": 2046.6999816894531,
      "end": 2048.5799865722656,
      "text": " We did that a little bit this morning in Sunday school"
    },
    {
      "id": 89,
      "start": 2048.5799865722656,
      "end": 2049.5799865722656,
      "text": " as we looked at that miracle,"
    },
    {
      "id": 90,
      "start": 2049.5799865722656,
      "end": 2053.019973754883,
      "text": " and let's just kind of be there and see what's happening."
    },
    {
      "id": 91,
      "start": 2053.019973754883,
      "end": 2055.5799865722656,
      "text": " And this morning when I look at this passage of Scripture,"
    },
    {
      "id": 92,
      "start": 2055.5799865722656,
      "end": 2058.0599670410156,
      "text": " and as I have looked at this passage over the years,"
    },
    {
      "id": 93,
      "start": 2058.0599670410156,
      "end": 2060.0999755859375,
      "text": " I put myself in the setting,"
    },
    {
      "id": 94,
      "start": 2060.0999755859375,
      "end": 2062.1799926757812,
      "text": " and I see the church of God,"
    },
    {
      "id": 95,
      "start": 2062.1799926757812,
      "end": 2064.8599853515625,
      "text": " and I see the events that are taking place,"
    },
    {
      "id": 96,
      "start": 2064.8599853515625,
      "end": 2067.0999755859375,
      "text": " and James is already killed."
    },
    {
      "id": 97,
      "start": 2067.0999755859375,
      "end": 2069.259979248047,
      "text": " Herod's taken a sword and he's killed him."
    },
    {
      "id": 98,
      "start": 2069.259979248047,
      "end": 2070.759979248047,
      "text": " That's pretty serious, right?"
    },
    {
      "id": 99,
      "start": 2071.8999938964844,
      "end": 2073.459991455078,
      "text": " And he saw that the Jews were pleased,"
    },
    {
      "id": 100,
      "start": 2073.459991455078,
      "end": 2074.699981689453,
      "text": " so he says, well, I'm gonna take Peter too,"
    },
    {
      "id": 101,
      "start": 2074.699981689453,
      "end": 2076.699981689453,
      "text": " and I'm gonna kill him."
    },
    {
      "id": 102,
      "start": 2076.699981689453,
      "end": 2078.739990234375,
      "text": " But because of some things that were taking place,"
    },
    {
      "id": 103,
      "start": 2078.739990234375,
      "end": 2079.97998046875,
      "text": " I'm gonna put him in prison first,"
    },
    {
      "id": 104,
      "start": 2079.97998046875,
      "end": 2081.739990234375,
      "text": " and then I'm gonna kill him afterwards."
    },
    {
      "id": 105,
      "start": 2081.739990234375,
      "end": 2083.4199829101562,
      "text": " And we find that the Bible tells us"
    },
    {
      "id": 106,
      "start": 2083.4199829101562,
      "end": 2087.259979248047,
      "text": " that the church of God responded how, they prayed."
    },
    {
      "id": 107,
      "start": 2088.1799926757812,
      "end": 2090.3799743652344,
      "text": " Now, when I try to put myself in the position,"
    },
    {
      "id": 108,
      "start": 2090.3799743652344,
      "end": 2093.459991455078,
      "text": " I ask myself this question, how would I have responded?"
    },
    {
      "id": 109,
      "start": 2095.739990234375,
      "end": 2097.1799926757812,
      "text": " What would I have done?"
    },
    {
      "id": 110,
      "start": 2098.8199768066406,
      "end": 2100.219970703125,
      "text": " Who would I have called and said,"
    },
    {
      "id": 111,
      "start": 2100.219970703125,
      "end": 2102.97998046875,
      "text": " hey, we gotta get a plan going to get Peter out of jail?"
    },
    {
      "id": 112,
      "start": 2106.8599853515625,
      "end": 2108.459991455078,
      "text": " And I start networking with people and say,"
    },
    {
      "id": 113,
      "start": 2108.459991455078,
      "end": 2109.739990234375,
      "text": " hey, listen, I know you're good at this,"
    },
    {
      "id": 114,
      "start": 2109.739990234375,
      "end": 2110.6599731445312,
      "text": " and I know you're good at that,"
    },
    {
      "id": 115,
      "start": 2110.6599731445312,
      "end": 2113.259979248047,
      "text": " and you're a strong, big guy, and I want you on my team,"
    },
    {
      "id": 116,
      "start": 2113.259979248047,
      "end": 2114.5799865722656,
      "text": " and we gotta do this, that, and the other,"
    },
    {
      "id": 117,
      "start": 2114.5799865722656,
      "end": 2115.8999938964844,
      "text": " and we're gonna get Peter out of jail, man."
    },
    {
      "id": 118,
      "start": 2116.1799926757812,
      "end": 2118.219970703125,
      "text": " We're gonna get him out of prison."
    },
    {
      "id": 119,
      "start": 2118.219970703125,
      "end": 2120.1399841308594,
      "text": " Isn't that how we operate sometimes?"
    },
    {
      "id": 120,
      "start": 2120.1399841308594,
      "end": 2121.1799926757812,
      "text": " Seriously."
    },
    {
      "id": 121,
      "start": 2121.1799926757812,
      "end": 2123.1799926757812,
      "text": " It's just how we operate sometimes."
    },
    {
      "id": 122,
      "start": 2125.459991455078,
      "end": 2126.7799682617188,
      "text": " We just immediately begin to think about,"
    },
    {
      "id": 123,
      "start": 2126.7799682617188,
      "end": 2129.6599731445312,
      "text": " okay, what do I need to do to solve this problem?"
    },
    {
      "id": 124,
      "start": 2129.6599731445312,
      "end": 2131.8199768066406,
      "text": " What do I need to do to take care of this?"
    },
    {
      "id": 125,
      "start": 2131.8199768066406,
      "end": 2134.3399658203125,
      "text": " James is killed, Peter's in prison, man."
    },
    {
      "id": 126,
      "start": 2134.3399658203125,
      "end": 2136.6599731445312,
      "text": " Some maybe flee because, man, I'm gonna be next."
    },
    {
      "id": 127,
      "start": 2136.6599731445312,
      "end": 2138.739990234375,
      "text": " I don't wanna get killed."
    },
    {
      "id": 128,
      "start": 2138.739990234375,
      "end": 2140.019989013672,
      "text": " Some are gonna try to figure out how to,"
    },
    {
      "id": 129,
      "start": 2140.019989013672,
      "end": 2142.459991455078,
      "text": " no, but the Bible tells us that,"
    },
    {
      "id": 130,
      "start": 2142.459991455078,
      "end": 2144.459991455078,
      "text": " but prayer was made without ceasing"
    },
    {
      "id": 131,
      "start": 2144.459991455078,
      "end": 2146.499969482422,
      "text": " of the church and to God for him."
    },
    {
      "id": 132,
      "start": 2146.499969482422,
      "end": 2148.3799743652344,
      "text": " They responded in prayer."
    },
    {
      "id": 133,
      "start": 2148.3799743652344,
      "end": 2150.1799926757812,
      "text": " They responded in prayer,"
    },
    {
      "id": 134,
      "start": 2150.1799926757812,
      "end": 2152.1799926757812,
      "text": " and when we see how the church prayed,"
    },
    {
      "id": 135,
      "start": 2152.1799926757812,
      "end": 2153.8199768066406,
      "text": " the Bible continues, and it says,"
    },
    {
      "id": 136,
      "start": 2153.8199768066406,
      "end": 2154.6599731445312,
      "text": " in verse number six,"
    },
    {
      "id": 137,
      "start": 2154.6599731445312,
      "end": 2156.5799865722656,
      "text": " and when Herod would have brought him forth,"
    },
    {
      "id": 138,
      "start": 2156.5799865722656,
      "end": 2159.3399658203125,
      "text": " the same night Peter was sleeping between two soldiers"
    },
    {
      "id": 139,
      "start": 2159.3399658203125,
      "end": 2161.219970703125,
      "text": " bound with two chains in the keepers"
    },
    {
      "id": 140,
      "start": 2161.219970703125,
      "end": 2163.0599670410156,
      "text": " before the door kept the prison,"
    },
    {
      "id": 141,
      "start": 2163.0599670410156,
      "end": 2165.97998046875,
      "text": " I mean, he was pretty shut in, was he not?"
    },
    {
      "id": 142,
      "start": 2165.97998046875,
      "end": 2167.499969482422,
      "text": " We'd have had to have a pretty elaborate,"
    },
    {
      "id": 143,
      "start": 2167.499969482422,
      "end": 2170.219970703125,
      "text": " sophisticated plan to break Peter out,"
    },
    {
      "id": 144,
      "start": 2170.219970703125,
      "end": 2173.699981689453,
      "text": " but God, he's over all of that stuff."
    },
    {
      "id": 145,
      "start": 2174.6599731445312,
      "end": 2177.5399780273438,
      "text": " And here, the Bible tells us that they were,"
    },
    {
      "id": 146,
      "start": 2177.5399780273438,
      "end": 2178.459991455078,
      "text": " I mean, it was secure."
    },
    {
      "id": 147,
      "start": 2178.459991455078,
      "end": 2181.019989013672,
      "text": " It was as secure as it could be."
    },
    {
      "id": 148,
      "start": 2181.019989013672,
      "end": 2181.8599853515625,
      "text": " In verse number seven,"
    },
    {
      "id": 149,
      "start": 2181.8599853515625,
      "end": 2184.4199829101562,
      "text": " behold, the angel of the Lord came upon him,"
    },
    {
      "id": 150,
      "start": 2184.4199829101562,
      "end": 2185.8599853515625,
      "text": " and a light shined in the prison,"
    },
    {
      "id": 151,
      "start": 2185.8599853515625,
      "end": 2188.8199768066406,
      "text": " and he smote Peter on the side, I love that,"
    },
    {
      "id": 152,
      "start": 2188.8199768066406,
      "end": 2190.259979248047,
      "text": " and raised him up, saying,"
    },
    {
      "id": 153,
      "start": 2190.259979248047,
      "end": 2193.7799682617188,
      "text": " Arise up quickly, and his chains fell off from his hands."
    },
    {
      "id": 154,
      "start": 2195.499969482422,
      "end": 2196.8599853515625,
      "text": " And the Bible tells us,"
    },
    {
      "id": 155,
      "start": 2196.8599853515625,
      "end": 2198.019989013672,
      "text": " the angel said unto him,"
    },
    {
      "id": 156,
      "start": 2198.019989013672,
      "end": 2202.0599670410156,
      "text": " Gird thyself, and bind on thy sandals, and so he did."
    },
    {
      "id": 157,
      "start": 2202.0599670410156,
      "end": 2202.8999938964844,
      "text": " He saith unto him,"
    },
    {
      "id": 158,
      "start": 2202.8999938964844,
      "end": 2205.459991455078,
      "text": " Cast thy garment upon thee, and follow me."
    },
    {
      "id": 159,
      "start": 2205.459991455078,
      "end": 2207.1399841308594,
      "text": " And he went out, and followed him,"
    },
    {
      "id": 160,
      "start": 2207.1399841308594,
      "end": 2209.8599853515625,
      "text": " and wist not that it was true which was done by the angel,"
    },
    {
      "id": 161,
      "start": 2209.8599853515625,
      "end": 2211.499969482422,
      "text": " but thought he saw a vision."
    },
    {
      "id": 162,
      "start": 2211.499969482422,
      "end": 2214.219970703125,
      "text": " Now, let me ask you, pause just for a moment"
    },
    {
      "id": 163,
      "start": 2214.219970703125,
      "end": 2215.4199829101562,
      "text": " before we continue reading."
    },
    {
      "id": 164,
      "start": 2215.4199829101562,
      "end": 2217.459991455078,
      "text": " What's the church doing?"
    },
    {
      "id": 165,
      "start": 2217.459991455078,
      "end": 2219.5799865722656,
      "text": " The church is still praying,"
    },
    {
      "id": 166,
      "start": 2219.5799865722656,
      "end": 2221.8999938964844,
      "text": " because the Bible tells us in verse number five,"
    },
    {
      "id": 167,
      "start": 2221.8999938964844,
      "end": 2224.459991455078,
      "text": " but prayer was made without ceasing"
    },
    {
      "id": 168,
      "start": 2224.459991455078,
      "end": 2228.0399780273438,
      "text": " of the church unto God for him."
    },
    {
      "id": 169,
      "start": 2228.0399780273438,
      "end": 2229.939971923828,
      "text": " The church is praying."
    },
    {
      "id": 170,
      "start": 2229.939971923828,
      "end": 2231.97998046875,
      "text": " They have an all-night prayer meeting."
    },
    {
      "id": 171,
      "start": 2232.7799682617188,
      "end": 2234.4199829101562,
      "text": " You know how well those are attended?"
    },
    {
      "id": 172,
      "start": 2235.459991455078,
      "end": 2236.3799743652344,
      "text": " Come to Wednesday night,"
    },
    {
      "id": 173,
      "start": 2236.3799743652344,
      "end": 2237.699981689453,
      "text": " and see how well those are attended."
    },
    {
      "id": 174,
      "start": 2237.699981689453,
      "end": 2239.0999755859375,
      "text": " That'll give you an idea of how well"
    },
    {
      "id": 175,
      "start": 2239.0999755859375,
      "end": 2241.519989013672,
      "text": " an all-night prayer meeting would be attended."
    },
    {
      "id": 176,
      "start": 2241.519989013672,
      "end": 2242.3599853515625,
      "text": " Amen?"
    },
    {
      "id": 177,
      "start": 2243.2999877929688,
      "end": 2245.019989013672,
      "text": " And it says this in verse number 10."
    },
    {
      "id": 178,
      "start": 2245.019989013672,
      "end": 2247.97998046875,
      "text": " When they were past the first and the second ward,"
    },
    {
      "id": 179,
      "start": 2247.97998046875,
      "end": 2250.97998046875,
      "text": " they came unto the iron gate that leadeth unto the city,"
    },
    {
      "id": 180,
      "start": 2250.97998046875,
      "end": 2252.939971923828,
      "text": " which opened to them of his own accord,"
    },
    {
      "id": 181,
      "start": 2252.939971923828,
      "end": 2255.759979248047,
      "text": " and they went out, and passed on through one street,"
    },
    {
      "id": 182,
      "start": 2255.759979248047,
      "end": 2257.939971923828,
      "text": " and forthwith the angel departed from him."
    },
    {
      "id": 183,
      "start": 2257.939971923828,
      "end": 2261.1399841308594,
      "text": " And when Peter was come to himself,"
    },
    {
      "id": 184,
      "start": 2261.1399841308594,
      "end": 2262.0999755859375,
      "text": " this is what he said,"
    },
    {
      "id": 185,
      "start": 2262.0999755859375,
      "end": 2265.8999938964844,
      "text": " now I know of a surety that the Lord hath sent his angel,"
    },
    {
      "id": 186,
      "start": 2265.8999938964844,
      "end": 2267.939971923828,
      "text": " and hath delivered me out of the hand of Herod,"
    },
    {
      "id": 187,
      "start": 2267.939971923828,
      "end": 2271.4199829101562,
      "text": " and from all the expectation of the people of the Jews."
    },
    {
      "id": 188,
      "start": 2271.4199829101562,
      "end": 2272.8599853515625,
      "text": " When he had considered the thing,"
    },
    {
      "id": 189,
      "start": 2272.8599853515625,
      "end": 2275.5399780273438,
      "text": " he came to the house of Mary, the mother of John,"
    },
    {
      "id": 190,
      "start": 2275.5399780273438,
      "end": 2276.8999938964844,
      "text": " whose surname was Mark."
    },
    {
      "id": 191,
      "start": 2276.8999938964844,
      "end": 2277.8599853515625,
      "text": " What does it say?"
    },
    {
      "id": 192,
      "start": 2277.8599853515625,
      "end": 2282.8599853515625,
      "text": " Where many were gathered together praying."
    },
    {
      "id": 193,
      "start": 2285.1799926757812,
      "end": 2286.3799743652344,
      "text": " They're praying."
    },
    {
      "id": 194,
      "start": 2288.7799682617188,
      "end": 2289.8999938964844,
      "text": " Evaluate it personally,"
    },
    {
      "id": 195,
      "start": 2289.8999938964844,
      "end": 2292.0599670410156,
      "text": " but then evaluate it corporately."
    },
    {
      "id": 196,
      "start": 2292.0599670410156,
      "end": 2294.699981689453,
      "text": " What place does prayer have?"
    },
    {
      "id": 197,
      "start": 2294.699981689453,
      "end": 2295.6599731445312,
      "text": " Corporately."
    },
    {
      "id": 198,
      "start": 2300.1799926757812,
      "end": 2303.3799743652344,
      "text": " As we read in Acts chapter number 12,"
    },
    {
      "id": 199,
      "start": 2304.2999877929688,
      "end": 2306.1799926757812,
      "text": " and you read from verse number six"
    },
    {
      "id": 200,
      "start": 2306.1799926757812,
      "end": 2308.7799682617188,
      "text": " down to where I stopped in verse number 12,"
    },
    {
      "id": 201,
      "start": 2308.7799682617188,
      "end": 2313.7799682617188,
      "text": " all that that you're reading of that miraculous deliverance,"
    },
    {
      "id": 202,
      "start": 2313.8999633789062,
      "end": 2315.8800048828125,
      "text": " I would argue this morning"
    },
    {
      "id": 203,
      "start": 2315.8800048828125,
      "end": 2319.5599975585938,
      "text": " that that is God's hand moving"
    },
    {
      "id": 204,
      "start": 2319.5599975585938,
      "end": 2322.1799926757812,
      "text": " in response to the church praying."
    },
    {
      "id": 205,
      "start": 2323.4400024414062,
      "end": 2324.2799682617188,
      "text": " Amen?"
    },
    {
      "id": 206,
      "start": 2325.2799682617188,
      "end": 2330.2799682617188,
      "text": " The hand of God moving miraculously, powerfully,"
    },
    {
      "id": 207,
      "start": 2330.6399536132812,
      "end": 2333.5999755859375,
      "text": " beyond what the church could ever do."
    },
    {
      "id": 208,
      "start": 2333.5999755859375,
      "end": 2335.0,
      "text": " Remember the Bible tells us,"
    },
    {
      "id": 209,
      "start": 2335.0,
      "end": 2336.4599609375,
      "text": " I mentioned the prayer promise,"
    },
    {
      "id": 210,
      "start": 2336.4599609375,
      "end": 2338.239990234375,
      "text": " that He is able to do exceeding abundantly"
    },
    {
      "id": 211,
      "start": 2338.239990234375,
      "end": 2340.0199584960938,
      "text": " above all that we ask or think."
    },
    {
      "id": 212,
      "start": 2340.0199584960938,
      "end": 2342.1599731445312,
      "text": " Now listen, sometimes we can ask or think"
    },
    {
      "id": 213,
      "start": 2342.1599731445312,
      "end": 2343.239990234375,
      "text": " some great things,"
    },
    {
      "id": 214,
      "start": 2343.2799682617188,
      "end": 2346.4400024414062,
      "text": " but we might have a little bit of wavering,"
    },
    {
      "id": 215,
      "start": 2346.4400024414062,
      "end": 2350.2799682617188,
      "text": " and He tells us that we're to pray without wrath and doubting,"
    },
    {
      "id": 216,
      "start": 2350.2799682617188,
      "end": 2353.3599853515625,
      "text": " but we find here that these people are gathered praying."
    },
    {
      "id": 217,
      "start": 2353.3599853515625,
      "end": 2355.8800048828125,
      "text": " No doubt they're praying that God would move."
    },
    {
      "id": 218,
      "start": 2355.8800048828125,
      "end": 2358.8399658203125,
      "text": " Perhaps some have prayed that God would deliver Peter,"
    },
    {
      "id": 219,
      "start": 2358.8399658203125,
      "end": 2361.0799560546875,
      "text": " but they can't even begin to imagine"
    },
    {
      "id": 220,
      "start": 2361.0799560546875,
      "end": 2363.0,
      "text": " how God would deliver Peter."
    },
    {
      "id": 221,
      "start": 2364.1199951171875,
      "end": 2368.0,
      "text": " Because Herod is powerful, right?"
    },
    {
      "id": 222,
      "start": 2368.0,
      "end": 2372.0399780273438,
      "text": " And Herod has already killed James,"
    },
    {
      "id": 223,
      "start": 2372.0399780273438,
      "end": 2374.199951171875,
      "text": " and now Herod has taken Peter,"
    },
    {
      "id": 224,
      "start": 2374.199951171875,
      "end": 2375.9599609375,
      "text": " and Herod has this plan,"
    },
    {
      "id": 225,
      "start": 2375.9599609375,
      "end": 2377.8800048828125,
      "text": " and Peter is in prison,"
    },
    {
      "id": 226,
      "start": 2377.8800048828125,
      "end": 2379.0799560546875,
      "text": " and the guards are there,"
    },
    {
      "id": 227,
      "start": 2379.0799560546875,
      "end": 2381.3999633789062,
      "text": " and the wards are shut."
    },
    {
      "id": 228,
      "start": 2381.3999633789062,
      "end": 2382.3999633789062,
      "text": " But they're praying."
    },
    {
      "id": 229,
      "start": 2383.8399658203125,
      "end": 2384.6799926757812,
      "text": " They're praying."
    },
    {
      "id": 230,
      "start": 2385.7999877929688,
      "end": 2388.1599731445312,
      "text": " And Peter, according to verse number 13,"
    },
    {
      "id": 231,
      "start": 2388.1599731445312,
      "end": 2389.4400024414062,
      "text": " he came, it says,"
    },
    {
      "id": 232,
      "start": 2389.4400024414062,
      "end": 2393.0399780273438,
      "text": " and as Peter knocked at the door of the gate,"
    },
    {
      "id": 233,
      "start": 2393.0399780273438,
      "end": 2394.5999755859375,
      "text": " this is always make you laugh,"
    },
    {
      "id": 234,
      "start": 2395.9199829101562,
      "end": 2399.8399658203125,
      "text": " a damsel came to hearken named Rhoda."
    },
    {
      "id": 235,
      "start": 2399.8399658203125,
      "end": 2401.260009765625,
      "text": " So Peter's knocking."
    },
    {
      "id": 0,
      "start": 2401.260009765625,
      "end": 2409.100009918213,
      "text": " It says, when she knew Peter's voice, she opened not the gate for gladness, but ran"
    },
    {
      "id": 1,
      "start": 2409.100009918213,
      "end": 2412.46000957489,
      "text": " in and told how Peter stood before the gate."
    },
    {
      "id": 2,
      "start": 2412.46000957489,
      "end": 2415.56000995636,
      "text": " She left him out there because she was so excited."
    },
    {
      "id": 3,
      "start": 2415.56000995636,
      "end": 2416.6600093841553,
      "text": " But then guess what?"
    },
    {
      "id": 4,
      "start": 2416.6600093841553,
      "end": 2425.4000091552734,
      "text": " They say, nah, thou art mad, you're crazy."
    },
    {
      "id": 5,
      "start": 2425.4000091552734,
      "end": 2429.2200088500977,
      "text": " She constantly affirmed that it was even so."
    },
    {
      "id": 6,
      "start": 2429.2200088500977,
      "end": 2432.2200088500977,
      "text": " Then said they, it is his angel."
    },
    {
      "id": 7,
      "start": 2432.2200088500977,
      "end": 2433.7400093078613,
      "text": " But Peter continued knocking."
    },
    {
      "id": 8,
      "start": 2433.7400093078613,
      "end": 2438.2200088500977,
      "text": " I don't know how long he was out there knocking, but he just kept knocking."
    },
    {
      "id": 9,
      "start": 2438.2200088500977,
      "end": 2448.7800102233887,
      "text": " It says, when they opened the door and saw him, they were astonished, they were astonished."
    },
    {
      "id": 10,
      "start": 2448.7800102233887,
      "end": 2452.7400093078613,
      "text": " God worked, God answered prayer."
    },
    {
      "id": 11,
      "start": 2452.7400093078613,
      "end": 2455.1200103759766,
      "text": " You've been praying."
    },
    {
      "id": 12,
      "start": 2455.1200103759766,
      "end": 2460.6800079345703,
      "text": " And then the Bible tells us, but he, in verse 17, beckoning unto them with the hand to hold"
    },
    {
      "id": 13,
      "start": 2460.6800079345703,
      "end": 2461.6800079345703,
      "text": " their peace."
    },
    {
      "id": 14,
      "start": 2461.6800079345703,
      "end": 2463.1200103759766,
      "text": " Why do you think he had to quiet them down?"
    },
    {
      "id": 15,
      "start": 2463.1200103759766,
      "end": 2464.1200103759766,
      "text": " Why?"
    },
    {
      "id": 16,
      "start": 2464.1200103759766,
      "end": 2467.0000076293945,
      "text": " Because they're excited."
    },
    {
      "id": 17,
      "start": 2467.0000076293945,
      "end": 2474.440010070801,
      "text": " Notice what it says, declared unto them how the Lord had brought him out of the prison."
    },
    {
      "id": 18,
      "start": 2474.440010070801,
      "end": 2477.440010070801,
      "text": " He said, go, show these things unto James and the brethren, and he departed and went"
    },
    {
      "id": 19,
      "start": 2477.440010070801,
      "end": 2478.6000061035156,
      "text": " into another place."
    },
    {
      "id": 20,
      "start": 2478.6000061035156,
      "end": 2482.7800064086914,
      "text": " But I want you to just think about this in verse number 17, that when he declares unto"
    },
    {
      "id": 21,
      "start": 2482.7800064086914,
      "end": 2488.260009765625,
      "text": " them how that the Lord had brought him out of the prison, that was a direct response"
    },
    {
      "id": 22,
      "start": 2488.260009765625,
      "end": 2493.540008544922,
      "text": " of their praying, of their praying."
    },
    {
      "id": 23,
      "start": 2493.540008544922,
      "end": 2499.3400115966797,
      "text": " I don't know that Peter was aware of the prayer meeting that was taking place."
    },
    {
      "id": 24,
      "start": 2499.3400115966797,
      "end": 2505.4200134277344,
      "text": " I know that as they were praying, they weren't aware of how God was delivering Peter until"
    },
    {
      "id": 25,
      "start": 2505.4200134277344,
      "end": 2507.660011291504,
      "text": " he came there."
    },
    {
      "id": 26,
      "start": 2507.660011291504,
      "end": 2515.7400131225586,
      "text": " And this morning, as we think about our lives and evaluating and asking ourselves the question,"
    },
    {
      "id": 27,
      "start": 2515.7400131225586,
      "end": 2523.1800079345703,
      "text": " what place does prayer really have in my life, in my life personally?"
    },
    {
      "id": 28,
      "start": 2523.1800079345703,
      "end": 2526.580009460449,
      "text": " Does it have, is there a priority that's placed upon prayer?"
    },
    {
      "id": 29,
      "start": 2526.580009460449,
      "end": 2528.260009765625,
      "text": " Do I have a plan?"
    },
    {
      "id": 30,
      "start": 2528.260009765625,
      "end": 2535.1400146484375,
      "text": " What is it that would best describe, what words would best describe my prayer life?"
    },
    {
      "id": 31,
      "start": 2535.1400146484375,
      "end": 2537.6600036621094,
      "text": " Prayers work."
    },
    {
      "id": 32,
      "start": 2537.6600036621094,
      "end": 2538.6600036621094,
      "text": " Prayers work."
    },
    {
      "id": 33,
      "start": 2538.6600036621094,
      "end": 2547.740005493164,
      "text": " But then when we evaluate prayer corporately, Jesus said, my house shall be a house of prayer."
    },
    {
      "id": 34,
      "start": 2547.740005493164,
      "end": 2552.9400024414062,
      "text": " I no longer desire for prayer to just be a bookend to our services."
    },
    {
      "id": 35,
      "start": 2552.9400024414062,
      "end": 2555.020004272461,
      "text": " I don't."
    },
    {
      "id": 36,
      "start": 2555.020004272461,
      "end": 2559.9000091552734,
      "text": " I intend with the help of God that we'll do exactly what we did this morning, we'll begin"
    },
    {
      "id": 37,
      "start": 2559.9000091552734,
      "end": 2566.3800048828125,
      "text": " each service with a season of prayer, praying that God would move and work."
    },
    {
      "id": 38,
      "start": 2566.3800048828125,
      "end": 2571.1000061035156,
      "text": " Listen, those moments of prayer, they really aren't to pray for somebody that's sick."
    },
    {
      "id": 39,
      "start": 2571.1000061035156,
      "end": 2575.1400146484375,
      "text": " They're not to pray for somebody that's whatever."
    },
    {
      "id": 40,
      "start": 2575.1400146484375,
      "end": 2578.9400024414062,
      "text": " It's very specific prayer for what's at hand."
    },
    {
      "id": 41,
      "start": 2578.9400024414062,
      "end": 2583.540008544922,
      "text": " Oh God, use the song service this morning."
    },
    {
      "id": 42,
      "start": 2583.540008544922,
      "end": 2585.1800079345703,
      "text": " Speak to my heart through the songs."
    },
    {
      "id": 43,
      "start": 2585.1800079345703,
      "end": 2588.4200134277344,
      "text": " Be glorified as we sing praise to Thy name."
    },
    {
      "id": 44,
      "start": 2588.9400024414062,
      "end": 2591.260009765625,
      "text": " God, would You use the preacher this morning?"
    },
    {
      "id": 45,
      "start": 2591.260009765625,
      "end": 2594.780014038086,
      "text": " Fill him with Your power to deliver the Word of God."
    },
    {
      "id": 46,
      "start": 2594.780014038086,
      "end": 2597.300003051758,
      "text": " God, help me to be attentive."
    },
    {
      "id": 47,
      "start": 2597.300003051758,
      "end": 2604.260009765625,
      "text": " Help me to long to hear and to get something from You this morning, God."
    },
    {
      "id": 48,
      "start": 2604.260009765625,
      "end": 2608.780014038086,
      "text": " And we use that time of prayer for that purpose."
    },
    {
      "id": 49,
      "start": 2608.780014038086,
      "end": 2613.020004272461,
      "text": " We really seek the face of God for how He would be exalted and glorified."
    },
    {
      "id": 50,
      "start": 2613.020004272461,
      "end": 2617.3800048828125,
      "text": " That if there's somebody that's lost in our midst that the Holy Spirit of God would speak"
    },
    {
      "id": 51,
      "start": 2617.3800048828125,
      "end": 2623.020004272461,
      "text": " to them and would convict them of their sin and of Christ's righteousness, of judgment"
    },
    {
      "id": 52,
      "start": 2623.020004272461,
      "end": 2628.6200103759766,
      "text": " to come, that today would be the day of salvation in their lives."
    },
    {
      "id": 53,
      "start": 2628.6200103759766,
      "end": 2633.5800170898438,
      "text": " For the saying that God would stir us up, that God would change us, that God would do"
    },
    {
      "id": 54,
      "start": 2633.5800170898438,
      "end": 2637.5800170898438,
      "text": " something in our lives, that He'd be glorified."
    },
    {
      "id": 55,
      "start": 2637.5800170898438,
      "end": 2642.220016479492,
      "text": " That's the purpose of that prayer time."
    },
    {
      "id": 56,
      "start": 2642.220016479492,
      "end": 2653.1600036621094,
      "text": " With the help of God, I seek to make prayer a priority, not only in my life personally,"
    },
    {
      "id": 57,
      "start": 2653.1600036621094,
      "end": 2655.060012817383,
      "text": " but corporately as a church."
    },
    {
      "id": 58,
      "start": 2655.060012817383,
      "end": 2662.1000061035156,
      "text": " As I mentioned a moment ago, and it's worth repeating, I no longer desire for prayer to"
    },
    {
      "id": 59,
      "start": 2662.1000061035156,
      "end": 2665.260009765625,
      "text": " simply be bookends to our service."
    },
    {
      "id": 60,
      "start": 2665.260009765625,
      "end": 2666.8600158691406,
      "text": " I don't."
    },
    {
      "id": 61,
      "start": 2666.8600158691406,
      "end": 2670.4600219726562,
      "text": " Here's what someone said."
    },
    {
      "id": 62,
      "start": 2670.4600219726562,
      "end": 2679.779998779297,
      "text": " Someone said this about prayer, the pulpit of this day is weak in praying."
    },
    {
      "id": 63,
      "start": 2679.779998779297,
      "end": 2691.3800048828125,
      "text": " The pride of learning is against the dependent humility of prayer."
    },
    {
      "id": 64,
      "start": 2691.3800048828125,
      "end": 2696.4600219726562,
      "text": " When I read that, it just…"
    },
    {
      "id": 65,
      "start": 2696.4600219726562,
      "end": 2700.779998779297,
      "text": " I understand that I've been given a responsibility to preach the Word."
    },
    {
      "id": 66,
      "start": 2700.779998779297,
      "end": 2703.1800231933594,
      "text": " That's my responsibility."
    },
    {
      "id": 67,
      "start": 2703.1800231933594,
      "end": 2707.220001220703,
      "text": " But God said, my house shall be a house of prayer."
    },
    {
      "id": 68,
      "start": 2707.220001220703,
      "end": 2713.1800231933594,
      "text": " And if we're not praying like we're supposed to, we can preach, we can get the greatest"
    },
    {
      "id": 69,
      "start": 2713.1800231933594,
      "end": 2717.540008544922,
      "text": " preachers that walk the face of this earth."
    },
    {
      "id": 70,
      "start": 2717.540008544922,
      "end": 2723.6000061035156,
      "text": " But if we're not prayed up and we're not ready to receive, who's a better preacher"
    },
    {
      "id": 71,
      "start": 2723.6000061035156,
      "end": 2725.8600158691406,
      "text": " than Jesus?"
    },
    {
      "id": 72,
      "start": 2725.8600158691406,
      "end": 2726.8600158691406,
      "text": " Nobody."
    },
    {
      "id": 73,
      "start": 2726.8600158691406,
      "end": 2729.4600219726562,
      "text": " But you know what Jesus said?"
    },
    {
      "id": 74,
      "start": 2729.4600219726562,
      "end": 2731.4600219726562,
      "text": " He said, you've heard my words, but you're doing them not."
    },
    {
      "id": 75,
      "start": 2731.4600219726562,
      "end": 2734.7000122070312,
      "text": " You're like a foolish man."
    },
    {
      "id": 76,
      "start": 2734.7000122070312,
      "end": 2736.540008544922,
      "text": " There's others that heard His words and they did it."
    },
    {
      "id": 77,
      "start": 2736.540008544922,
      "end": 2738.6199951171875,
      "text": " He said, I liken you to a wise man."
    },
    {
      "id": 78,
      "start": 2738.6199951171875,
      "end": 2743.1000061035156,
      "text": " We sing the song, wise men build his house upon the rock, the foolish man, no, right?"
    },
    {
      "id": 79,
      "start": 2743.1000061035156,
      "end": 2745.1000061035156,
      "text": " The floods come, so on and so forth."
    },
    {
      "id": 80,
      "start": 2745.1000061035156,
      "end": 2752.8600158691406,
      "text": " The response, the tenderness of the reception, it wasn't in the message that Jesus delivered."
    },
    {
      "id": 81,
      "start": 2752.8600158691406,
      "end": 2758.5,
      "text": " It was the same message from God in flesh."
    },
    {
      "id": 82,
      "start": 2758.5,
      "end": 2764.3800048828125,
      "text": " This morning, I want to just open up the curtain a little bit to help you understand why we're"
    },
    {
      "id": 83,
      "start": 2764.3800048828125,
      "end": 2767.8600158691406,
      "text": " placing a greater priority on prayer."
    },
    {
      "id": 84,
      "start": 2767.8600158691406,
      "end": 2770.6800231933594,
      "text": " I mentioned this three weeks ago."
    },
    {
      "id": 85,
      "start": 2770.6800231933594,
      "end": 2774.4200134277344,
      "text": " I want to be teachable."
    },
    {
      "id": 86,
      "start": 2774.4200134277344,
      "end": 2781.4200134277344,
      "text": " I love preaching the Word of God, but when I heard that message a few weeks ago and someone"
    },
    {
      "id": 87,
      "start": 2781.4600219726562,
      "end": 2788.540008544922,
      "text": " used that analogy of prayer being bookends in our service, I was like, Lord, forgive"
    },
    {
      "id": 88,
      "start": 2788.540008544922,
      "end": 2789.8600158691406,
      "text": " me."
    },
    {
      "id": 89,
      "start": 2789.8600158691406,
      "end": 2794.7000122070312,
      "text": " Because quite honestly, we pray, say, Lord, bless our services."
    },
    {
      "id": 90,
      "start": 2794.7000122070312,
      "end": 2799.6600036621094,
      "text": " And then we have our service, and then we say, Lord, thank You for blessing our service"
    },
    {
      "id": 91,
      "start": 2799.6600036621094,
      "end": 2801.9000244140625,
      "text": " this morning."
    },
    {
      "id": 92,
      "start": 2801.9000244140625,
      "end": 2807.220001220703,
      "text": " What place does prayer have in my life, personally and corporately?"
    },
    {
      "id": 93,
      "start": 2807.220001220703,
      "end": 2808.220001220703,
      "text": " Let's pray."
    },
    {
      "id": 94,
      "start": 2808.220001220703,
      "end": 2809.5800170898438,
      "text": " Father, we love You."
    },
    {
      "id": 95,
      "start": 2809.740020751953,
      "end": 2812.02001953125,
      "text": " Lord, we thank You for loving us."
    },
    {
      "id": 96,
      "start": 2812.02001953125,
      "end": 2813.9400024414062,
      "text": " Thank You for the Word of God."
    },
    {
      "id": 97,
      "start": 2813.9400024414062,
      "end": 2822.7000122070312,
      "text": " Lord, we thank You for the countless promises throughout the entirety of Your Word with"
    },
    {
      "id": 98,
      "start": 2822.7000122070312,
      "end": 2830.260009765625,
      "text": " regard to prayer, the encouragement that we receive by the way in which You've answered"
    },
    {
      "id": 99,
      "start": 2830.260009765625,
      "end": 2832.300018310547,
      "text": " and worked."
    },
    {
      "id": 100,
      "start": 2832.300018310547,
      "end": 2837.3399963378906,
      "text": " As we read secular history and read church history, Bible history of those that have"
    },
    {
      "id": 101,
      "start": 2837.3399963378906,
      "end": 2842.4200134277344,
      "text": " seen Your hand move and work, God, how we're encouraged to know that You're a God who"
    },
    {
      "id": 102,
      "start": 2842.4200134277344,
      "end": 2846.0599975585938,
      "text": " hears and answers prayer."
    },
    {
      "id": 103,
      "start": 2846.0599975585938,
      "end": 2852.9000244140625,
      "text": " This morning, all of those truths and all of those realities must have an impact in"
    },
    {
      "id": 104,
      "start": 2852.9000244140625,
      "end": 2856.980010986328,
      "text": " our lives."
    },
    {
      "id": 105,
      "start": 2856.980010986328,
      "end": 2859.0599975585938,
      "text": " We must be doers of the Word and not hearers only."
    },
    {
      "id": 106,
      "start": 2859.0599975585938,
      "end": 2869.779998779297,
      "text": " We must come to the place where we truly evaluate where prayer is in our lives, the"
    },
    {
      "id": 107,
      "start": 2869.779998779297,
      "end": 2875.740020751953,
      "text": " place of prayer, personally and corporately."
    },
    {
      "id": 108,
      "start": 2875.740020751953,
      "end": 2881.8600158691406,
      "text": " Lord, I pray that Your Holy Spirit would move and work as only You can."
    },
    {
      "id": 109,
      "start": 2881.8600158691406,
      "end": 2885.3200073242188,
      "text": " We don't want to rush You this morning, Lord."
    },
    {
      "id": 110,
      "start": 2885.3200073242188,
      "end": 2886.760009765625,
      "text": " Help us do business with You."
    },
    {
      "id": 111,
      "start": 2886.760009765625,
      "end": 2888.8800048828125,
      "text": " Help us to respond."
    },
    {
      "id": 112,
      "start": 2888.8800048828125,
      "end": 2892.1199951171875,
      "text": " God, help us to make some commitments."
    },
    {
      "id": 113,
      "start": 2892.1199951171875,
      "end": 2900.6000061035156,
      "text": " Help us, Lord, to renew some commitments with regard to prayer."
    },
    {
      "id": 114,
      "start": 2900.6000061035156,
      "end": 2905.8800048828125,
      "text": " We want to see You move and work, and God, we want to be able to hear accounts like we"
    },
    {
      "id": 115,
      "start": 2905.8800048828125,
      "end": 2918.4000244140625,
      "text": " read in Acts 12, You moving and working in distinct, miraculous ways as a result of prayer."
    },
    {
      "id": 116,
      "start": 2918.4000244140625,
      "end": 2923.6799926757812,
      "text": " We commit these moments to You and ask that You'd work as only You can."
    },
    {
      "id": 117,
      "start": 2923.6799926757812,
      "end": 2925.239990234375,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 118,
      "start": 2925.239990234375,
      "end": 2927.0,
      "text": " Would You stand with me?"
    },
    {
      "id": 119,
      "start": 2927.0,
      "end": 2928.1600341796875,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 120,
      "start": 2928.1600341796875,
      "end": 2929.8400268554688,
      "text": " Kimberly is going to play quietly on the piano."
    },
    {
      "id": 121,
      "start": 2929.8400268554688,
      "end": 2932.239990234375,
      "text": " The altar is open."
    },
    {
      "id": 122,
      "start": 2932.239990234375,
      "end": 2934.0,
      "text": " Thank God for prayer."
    },
    {
      "id": 123,
      "start": 2934.0,
      "end": 2936.6799926757812,
      "text": " Make a commitment to the Lord."
    },
    {
      "id": 124,
      "start": 2936.6799926757812,
      "end": 2941.0400390625,
      "text": " Evaluate your life, your prayer life, as Kimberly plays the altar is open."
    }
  ],
  "processed_at": "2025-04-16T16:18:07.849014"
}