{
  "video_id": "9S2PoEx7Gq0",
  "text": "came from. I mean, can you imagine that bass came out of that guy? I mean, you know a young guy with a bass voice like that, that was amazing. What a great finish that was, amen. And I heard some of you Baptists back there tapping your toes. Amen. Praise the Lord. I enjoyed that. I videoed that and I'm going to put it on my Facebook page so that everybody can see the great music you folks have here. I appreciate so much your music. It's been a joy these last few days just to be able to sing the old hymns of the faith. And to have these young men tonight get up and sing, they're really good. I'll tell you what, I think I ought to take them with me. I need some singers. You know some evangelists travel in a team and they have singers with them, several of them do. And I've never had anybody travel with me to sing. Sometimes I try to sing, but they always tell me, no don't sing Brother Meshon, just preach, amen. But I enjoyed that tonight, it was a blessing. Just want to let you know before I preach tonight how much we appreciate you folks. You've been a blessing to us over the years. And it's been good to be back here again and to meet some old friends after a few years of not having been here. And then also too we've met some new people that have been added to the church since we were last here. And we have really enjoyed this week together with you. It's been a blessing to spend time with the pastor and his wife and his family. We've enjoyed that as well. And we've eaten well over there, praise the Lord. Mrs. Pastor has been feeding us well. And so we are leaving here a little heavier than we came. But that's alright because you know it's always a blessing to be able to sit down and enjoy a good meal and just have fellowship around the table with God's people. And we've enjoyed that. Also too I want to let you know how much we appreciate your support of our ministry. You've been faithful and we certainly appreciate that. And by the way let me say this, I want to commend you, you are one of the few of our supporting churches that sends us birthday cards, and anniversary cards, and Christmas cards. And you keep up with those events in our lives. And that means a lot to us because many times even though we have supporting churches that we love and we appreciate sometimes we don't always hear from our churches. And it's so good for us to be able to hear from your church. And it means a lot, it really does. We have a church up in Alaska what they do is every fifth Wednesday night they come to the Wednesday night service. And what they do is everybody in the church writes to missionaries. And they've been doing that now for several years. I think the pastor told me for at least the last 25 or 30 years. And so we always get a nice card from them at different events and that's always been such a joy to us. So we appreciate that. And your support means a lot to us because we couldn't stay on the road really without having some support from churches that we've known over the years that we love, and they love us, and they've helped us. And it's been a blessing because our ministry has always been geared towards small churches. We don't generally go into bigger churches. The largest church that I think I've ever preached in was probably the weekend I was there was about 1,500 in attendance. And I'm not used to that many people. And usually I'm preaching in churches that run between 50 and 150. And we want to help the smaller churches. And we want to help the church planters. And I've been involved in church planning. And I'm glad that I've had the opportunity to do that. We planted a Spanish speaking church in the inner city of San Diego. We started that church with a Mexican national. And that work is doing well. And we're thankful for it. I understand that we're getting ready to plant another church out of that one. So we support that work out of our home church. I think we still do. And so we're glad for that. And I've helped other young men as well and try to be an encouragement to them in church planning. So you help us to help them. And you minister to us and it helps us to minister to others. And by the way it helps us to put gasoline in the tank. Amen. That SUV it doesn't go down the road without gasoline. It is not electric. And it is not hybrid. It's gas engine. And even though it's a pretty thrifty little vehicle at the same time gasoline out in our area of the world is extremely expensive. So we're thankful for your support of our ministry and your partners with us. And we don't take that for granted. So thank you. We appreciate it church. God bless you for it. And we want you to know we love you and we appreciate you. Deuteronomy chapter 6 in your Bible tonight. Now I am not feeling well and I've been telling you that the last couple of days. I'm not shaking hands tonight I'm just blowing my nose. So forgive me for that. I had a bad day today. I got up I guess this morning about 5.30 and I thought I'd been hit by a truck. And apparently this thing has moved from my chest down to my head. And so prayerfully I'll be able to get over this the next couple of days. I'm glad I have a couple of days to rest. So thank you for your prayers and we appreciate that so much. Deuteronomy chapter 6 and if you will stand please with me out of respect and reverence to the reading of God's holy, infallible and earned inspired Word. Deuteronomy chapter 6 reading from the Old King James Bible. I'm going to read you can follow along silently if you will please. In fact I think what I'll do is I'm going to begin in verse 1 usually I start in verse 4. But I'm going to begin in the very first verse of Deuteronomy 6. Now this was written to the children of Israel. However what we're going to see here tonight in this particular text has an application to us today. It has an application to us as a church. It has an application to us as individuals. And so what I'm going to read here even though like I say it was written to the children of Israel, the nation of Israel it has a definite application to us in this period of time, in this dispensation. So beginning in verse 1 of chapter 6 I read this, Now these are the commandments, the statutes and the judgments, which the Lord your God commanded to teach you, that ye might do them in the land whither you go to possess it, that thou mightest fear the Lord thy God to keep all His statutes and His commandments which I command thee, thou and thy son, and thy sons' sons, all the days of thy life, and that thy days may be prolonged. Hear therefore, O Israel, and observe to do it. Now it's the second time God says that there's something that needs to be done, you need to do it. Hear therefore, O Israel, and observe to do it, that it may be well with thee. So I understand this to mean if you don't do it it's not going to be well with you. See obedience is an important thing. Amen, would you agree with that? So hear therefore, O Israel, and observe to do it, that it may be well with thee, and that ye may increase mightily as the Lord God of thy fathers hath promised thee in the land that floweth with milk and honey. Verse 4, Hear O Israel, the Lord our God is one Lord, and of course that's the doctrine of monotheism. Verse 5, Now listen to this I want you to see this, And thou shalt love the Lord thy God with all thine heart, and with all thy soul, and with all thy might. And these words which I commanded this day shall be in thine heart. And thou shalt teach them diligently, by the way enthusiastically, fervently. And thou shalt teach them diligently unto thy children, and shalt talk of them when thou sittest in thine house, when thou walkest by the way, when thou liest down, and when thou risest up. And thou shalt bind them for a sign upon thine hand, and they shall be as frontless between thine eyes. And thou shalt write them upon the post of thy house, and on thy gates. Father, we thank you now for the reading of your precious Word, as your blessing now to the preaching of your Word over the next several minutes. Now, God I need your help tonight, so please help me. I am a needy preacher, and I cannot do this except you help me and strengthen me this evening. So, I pray for your hand upon me as I attempt to rightly divide the Word of truth. So, God meet with us now, speak to us afresh tonight, and we'll thank you for it. In Jesus' name and for His sake, amen. Thank you, may you be seated. When I look at this passage of Scripture one of the things that I see is this, God does not want us to be half-hearted Christians. Now, I'm going to say this tonight as I get started, I see a lot of half-heartedness many times amongst God's people. Now, God wants us to worship Him with the whole heart. He doesn't want us to be a half-hearted people. He doesn't want to worship Him in a half-hearted way. And I really love what he says here in this passage of Scripture how wonderful it is, and how practical it is as well when you read down through this. And it makes it very personal when he says, \"...and now shalt love the Lord thy God with,\" what does it say? \"...with all thine heart, and with all thy soul, and with all thy might.\" With every fiber of being, everything that is within us we ought to be loving the Lord. With all our heart, all our soul, all our might. And that's what God says. And you know the Christian that's not living that way is really living a pretty miserable life. Wouldn't you think? But yet we see an awful lot of half-hearted Christianity today. Now, I like to go into churches sometimes just watch people. By the way let me say this, I like airports. I really do, I enjoy airports. Now, I don't like traveling, but I will say that I enjoy airports. You know why? Because I'm an embedded people watcher. So, I like to watch people. So, I'll sit in airports and I'll watch people. You ever do that? And you say, well what's up with this guy? You know I mean you try to figure out what they're all about. You can't really do that, but I mean it's kind of fun to try to think about it. You know and you sometimes see a guy going through the airport with a fairly attractive woman and this guy is not looking so good. And you wonder how did they ever get together? You know? I mean, and that's maybe not fair, maybe that's not kind, but you know it's just the way you are when you're a people watcher. So, when I come into churches sometimes I like to watch people. Now, certainly I'm going to watch people when I'm preaching. Now, I'm standing up here in the sacred desk where your pastor stands all the time, and others that have preached here as well and have been extended the courtesy, the privilege, the honor of preaching from his pulpit. And I'm going to tell you what, I can see everything going going on out here from this perch? I can see it all. And you know sometimes things show up on people's countenances that really sometimes disturb me. Now maybe they don't like my preaching or something, I don't know what it is. And then there are the people who like to sleep during the preaching. Now I know that sometimes you come from work, you're tired, or like in our home church we have our morning prayer meeting at quarter to nine, we have the Sunday school hour at 9.30, we have the church service at 10.30, it ends up at around noon, and then we break and then we have lunch, and Filipinos man, gotta tell you, they eat the whole thing. And so when you're done eating we come back in for the afternoon service at 1.30 and guess what happens? Everybody wants to take a nap. Now I can see all that from the pulpit. And I found this out. Some people can sleep with their eyes open. I mean I'm serious. I mean you can go down there and go like this and you know it's like the elevator's at the top but there's nobody home on that floor. I mean it's just one of those things. And so I watch people all the time. One of the things I really watch for is I watch during the course of the congregational singing, if I'm on the platform I like to watch people sing. And you can really kind of tell sort of what's going on in a church. And you can really kind of tell what's going on in an individual's life by the way they respond to the singing of the old hymns of the faith. Dr. Ron Comfort told the preacher boys, in fact I was in the class when he said it, he said this, he said, now listen, he said, you fellas, you young fellas, and I was glad that he said that because I was the oldest guy in the classroom when he said it, but he said, you young fellas, he said, when you go into your revival meetings, your first revival meetings, one of the things you need to do is you need to sit on the platform during your preliminaries on the first day of the revival meeting and watch the people sing the old hymns of the faith and you can pretty much tell what kind of crowd you're going to preach to that week. And I found that to be true. I found out that that's a factual thing. You can watch people when they sing, I mean how can you sing? There is a fountain filled with blood drawn from Emmanuel's veins. How can you sing and can it be? How can you sing amazing grace? How can you sing anything that we sang tonight and not experience the joy of the Lord? And some people just kind of, you know, we Baptists, we've learned all the hymns, so we just kind of sing them by rote. You know, we just kind of go through the motions. You know what I'm saying? I'm not saying everybody does that, so don't think this is a blanket indictment. I'm not trying to paint this with too broad a brush. I'm just saying that many times it's a litmus test. So you watch people and you say, wow, there's something missing. Half heart of Christianity will steal the joy of the Lord right out of your heart. You know, I've heard people say, well that brother over there, man he stole my joy. Nobody can steal your joy. You've got to give it up. You've got to give it up. No one can take your joy from you. You have got to surrender it. And if you're living a half heart of Christian life, which is again a terrible way to live your life, if you're living a half heart of Christian life, I'm going to tell you right now, you're not going to enjoy being in the house of God. You're not going to enjoy singing the old hymns of the faith. You're not going to enjoy the preaching of the Word of God. You're not going to enjoy the fellowship of God's people because you're half hearted. Can you imagine serving the Lord with a half a heart? I mean, I would not, I'll tell you this right now, there's been times, I've only said this, I've only done this twice. In my ministry over the years, especially when I pastored, I told our people this. I said, let me tell you what. I said, if I know beyond a shadow of a doubt that I am not going into the pulpit filled with the Spirit of God, I'm not preaching. So if I get up one night and I say I'm not preaching tonight because I do not believe that I'm filled with the Spirit of God tonight for whatever reason it is, and I've only had that happen twice in my ministry, and then we have a prayer meeting. And, you know, I kind of felt half hearted sometimes. And God convicted me of that. I don't want to be a half hearted preacher. I don't want to be a half hearted soul winner. Amen? Hey, listen, I don't want to be a half hearted husband. I'm invested in this relationship. I mean, we've been, we're going on 59 years. I mean, there's an investment here. We've been husband and wife all these years, and I don't want to be a half hearted husband. Because the Word of God says that I'm to love my wife as Christ also loved the church and gave himself for it. That requires that I give my all to her. And I have to, my heart should be in my marriage, and in my home, and in my family. So half hearted Christianity is definitely a downer. And I see too much of it today. You know where I saw some real wholehearted Christians was in the Philippines. Every time I, you go into a Filipino church in the Philippine islands, there's 743 islands there. We're seeing independent Baptist churches planted all over that country of 100 million people now. Bible college is being started. Bible Institute is being started. Missionaries are being sent all over the world. They say within the next five to seven years, it'll be the number one missionary sending nation on the face of the earth. And I mentioned it the other day, you can find Filipinos everywhere. Now I know it's part of their culture. They're just a happy people. Amen. They're just a happy people. But I tell you what, when they come to church, man, they come to church all in. And here's a message that I preached years ago, and I haven't preached it for a while. Maybe they're all in or they're all out. There just doesn't seem to be anything in the middle. You know, when people get lackadaisical, they get lethargic, they get apathetic, and they just kind of go through the motions. And a guy told me one time, he said, oh, you know what? I come to church, he said, I hear you preach, but I've heard all that before. I said, oh really? He said, yeah, I've heard all that before. I know everything you said today. The message you just preached, he said, I've heard that all, I don't know how many times I've heard that. And I said, well, you need to hear it again. You didn't get it the first time. You didn't get it the second or third time. And now you're telling me you've heard all this before. Okay, well, if you've heard all this before, then my question for you is what are you doing with it? What are you doing with it? Unto whom much is given much is required. So listen, when God spreads a table for us in the wilderness, and we live in a wilderness today, friends, you know that's through a spiritual vacuum in this country. When God spreads a table before you in the wilderness, man, it's time to come and eat and get everything you can get. And I'll tell you this, the worst preacher, people say, well, you know what? I've heard some pretty bad preachers. Well, you know what? I don't, I've never heard a bad preacher. If they're preaching the Word of God, they're preaching the old book, man. I don't care if they're dynamic. I don't care if they're charismatic. I don't care if they've got this great personality. If they're preaching the Word of God, then praise the Lord. Amen. Jonathan Edwards in his day, that old pilgrim, that old Reformed theology guy, which I'm not a Reformed theology type, but that old pilgrim, Jonathan Edwards, when he preached that great message, Sinners in the Hands of an Angry God, and it actually triggered the first great awakening in America, you know what? He didn't preach like I'm preaching right now. He read his messages. He wrote them out meticulously and he read them. And I heard someone say that a lot of those guys back in those days used to read those things in almost just a dull tone. Now, but the thing is, it was full of the Word of God. So the Word of God is powerful, sharper than any two-edged sword, able to divide and sunder both bone and marrow. Let me tell you what, the Word of God is a powerful thing. So really when it comes down, it's not all based upon the way the message is delivered, it's the message itself and what it's based on. That should stimulate God's people. And they should rejoice over it. You know, I mean, half-hearted Christians, they come to church in a half-hearted manner and they're going to end up leaving the church with a half-hearted response. Well, I think we should come to church excited. Don't you? Now, I'm not suggesting we come into church like, you know, Bozo the Clown with a fake smile on her face and get Popeye bug-eyed, foam in the mouth, roll down the aisles, bounce off the wall kind of happy. I'm not talking about that. I'm talking about coming to church with a whole heart and being ready to receive from God whatever it is He has for us. Amen? I'll tell you what, I want to be a whole-hearted Christian. I want to be all in. I want to be totally invested. I want to be completely and totally absorbed with my Christian life. Let's go back to the book of Revelation. I'm going to move along quickly tonight, so stick with me if you will please. Try not to go too off-long this evening, but I do want to share this. I want to go to Revelation chapter 3. Is everybody with me? Revelation chapter 3 and verse 4. Now, I could actually go through all seven churches of Asia. And of course this was Asia Minor where these churches were located in what's now known today as Turkey. And of course Laodicea was the last of the seven churches. And of course we know if you even look at it geographically the churches were organized in somewhat of a circle. And the Bible says that the Lord Jesus at one point was standing in the midst of the seven churches, the seven golden candlesticks. We'll talk about that in a little bit in a minute. But I want you to look at Revelation chapter 3 and verse 14. And we look at the church of Laodicea and I'm going to read down through this very quickly and then make some comments along the way. By the way, Laodicea was an interesting place. I did a little bit of study on the city of Laodicea and it was an interesting city. It was built by Antiochus II and he named it after his wife, interesting name, her name was Laodice. And he named it after  It was located on the River Ulysses and it's still located there obviously today in what is now today Turkey. I wrote this down so I didn't forget it. It was rich in Greek culture, it was the center of business, the center of science, the center of millinery, and the center of medicine. And it had a great reputation. It was a wealthy city. It was a wealthy place. And by the way, there's evidence that there were, besides the church at Laodicea, there's evidence there was one other there as well. If you go there today, you can see the ruins of both churches. Those churches don't exist today, but you can see the ruins of both churches. And so this church at Laodicea was a very wealthy, very prosperous church at one time. But look at this. In Revelation chapter 3 and verse 14, I begin reading here. And under the angel Angelos, this was the pastor of the church, that's what it's speaking of, of the Laodiceans' rite. These things saith the Amen. Now, of course, we know the Amen is Jesus. Amen? These things saith the Amen, the faithful and true witness, the beginning of the creation of God. Now, look at verse 15. He says this. He said, I know thy works. I know thy works. Now, that ought to either bring consolation or conviction. I know thy works. Now, I'm going to say this. As I get into this text here, it's not a very long text, but as I get into it and share some things along the way, I want you to know this tonight. God knows our works. He knows what we're doing and why we're doing it. What motivates us, what causes us to do what we do, why we do what we do. I ask people this all the time. Why do you do what you do? I've seen people sing in the choir, for example, and I'll ask them sometimes, I mean, I just do this. I kind of probe once in a while. I kind of have a tendency to meddle a little bit. And sometimes when I suspect something's not quite right with somebody that's in the choir or any other area of ministry, I might ask them, why are you in the choir? Why do you want to sing in the choir? Amen. Well, that's a good answer right there. Why do you want to be part of the music program in the church? You know? Well, they give a lot of different answers. And just like he just got done saying, our brother said, because I love singing, amen. And he loves singing because he loves Jesus. It should be for him. I think that people should do what they do with a whole heart. Not half-hearted, just going through the motions. Okay. Pastor says, brother, can you help me with something this week? In fact, would you drive a Sunday school bus for me? Because I know you have a class B license and we need a driver this week. Okay. I really don't like to drive buses anymore. I kind of gave that up. Okay. And why do they complain and moan about it? Well, why? Because they're half-hearted. When they say, hey, pastor, great. I'll be glad to do that. I'll be glad to do it. Oh, would you sing this? You have people in the church that can sing. We just heard some great singing tonight, amen? And so you say, now, brothers, would you sing a special this Sunday? No, if I have to. Well, that's really half-hearted, isn't it? It's really what it is. And that's not the way that we should respond. When God asks us to do something, we should be in all in and we should do it with a whole heart. I want to serve God with a whole heart, don't you? What he couldn't do this week, I couldn't do what I'm doing. Whatever it is God's called you to do, you couldn't do it if you weren't doing it with a whole heart. Your heart would not be in it. You've heard that said many times. Well, my heart's not in it. Well, how come? You know, I had a fellow tell me one time, well, I think I'm going to retire from the ministry. Oh, I said, is that right? He said, yeah. I said, well, man, you're only 55 years old. Why are you going to retire from the ministry? Well, he said, my heart's not just in it anymore. And I thought, now, hold on a minute. Did God call you to the preaching ministry? Did God give you the gift of pastor, evangelist, teacher? Did God give you that gift? The gifts and the calling of God are without repentance. Well, God didn't change his mind, but obviously you have. And now you're telling me your heart's no longer in it. I'm going to tell you what, that's not a good answer. Was your heart in it when you started preaching 25 years ago? Well, yeah, back then it seems like my heart was in it. And I said, okay, well, then how come it's not in it today? I mean, you're 55 years old. You got some good years left in you. You ought to keep on preaching. Amen. Now, if he doesn't want to preach and he doesn't have the heart to preach for whatever reason, and I think there's something wrong with that, then maybe you ought to go get a job. Because he'll cause damage. So this thing of being half-hearted, or really having like, this guy, I have no heart at all in this thing. I mean, that's just a dangerous proposition. So it says, under the angel of the church that led us to your right, these things said, the amen, the faith, and the true witness, the beginning of the creation of God, he said, I know thy works, that thou art neither cold nor hot. I would thou were cold or hot, so then because thou art lukewarm, uh-oh, thou, I want you to see that word, lukewarm. That's an interesting word, isn't it? That word, lukewarm, comes from the Greek word, ameo, ameo. So what it means is this, the word lukewarm in the Greek, the word ameo means this, and by the way, it can also mean from, it also can come from this word, kleoros, and it means half-hearted, tepid, or fluctuating, no zeal, lost appetite. He says, he said this, he said, I know thy works, that thou art neither cold nor hot. I would that thou were cold or hot, so because thou art lukewarm and neither cold nor hot, I will spew thee out of my mouth. It's like, it's like in a medic, he said, listen, because you're lukewarm and you're not on fire, I'd rather have you, I'd rather have a cold or hot. Because you're lukewarm, I'll spew you out of my mouth, it makes me sick. Lukewarm Christianity. So kleoros, that's a Greek word, means half-hearted, tepid, fluctuating, no zeal, lost appetite. To lose one's appetite for things of God really, to me, is a disaster. It really is. So he said, so then because thou art lukewarm and neither cold nor hot, I will spew thee out of my mouth. So lukewarm, kleoros, and spew, along with the word lukewarm, also, it comes from a Greek word, it just makes me sick, he said. Because thou sayest I am rich and increased with goods, and have need of nothing, and knowest not that thou art wretched and miserable and poor and blind and naked. He said, Dave, we don't need anything, man. We got this thing down pat, we know how to do ministry, we don't need you in it either. He said, no, you're poor, you're blind, you're wretched, you're naked. He said, I counsel you to buy me gold, trident and fire, that thou mayest be rich, and white raiment that thou mayest be clothed, that the shame of thy nakedness do not appear, to anoint thine eyes with eye salve that thou mayest see. I think that's interesting because the city of Laodicea was known for its eye salve. It was famous for its school of medicine. And so he uses that as an illustration. But the eye salve they needed was not the eye salve that came from the apothecary, it was the eye salve of the Word of God. You people need to get your focus back where it belongs. You got an eyesight problem, you need to get your eyes back on Jesus. Get your eyes off Jesus and you're going to have a problem with half-heartedness. So I counsel you to buy me gold, trident and fire, that thou mayest be rich, and white raiment that thou mayest be clothed, and that the shame of thy nakedness do not appear, to anoint thine eyes with eye salve that thou mayest see. He said, as many as I love, I rebuke and chasten. Be zealous therefore and repent. And I like that word zealous. That's a good word. Amen. That's a good Bible word. And by the way, we see over in Titus chapter 2 where the Bible says that we who are saved by the grace of God ought to be zealous of good works. We ought to be zealous. We ought to be excited about this thing of serving God. I don't know about you, but I'm excited about being here in church tonight. I've already enjoyed myself. I really have. I can go, hey, I'll tell you what, when you come to church meetings like this, whether it be Sunday school or Sunday morning service, Sunday evening service, or special meetings like we're having this week, boy, that ought to be, that ought to be a blessing. That ought to be a joy. That ought to send you out of here with a little bit of a bounce in your step. Boy, I got to be with God's people tonight. I got to be in church tonight. You know, it ought to promote zeal. I've said this all the time. I said, man, we just need some people to get on fire for God. Man, if people get on fire for God and start serving the Lord all out, we could see a lot of things happen in our churches today. We had a program years ago, I can remember it started with Sword of the Lord. I don't remember who started it, but they had a program called Win One, Disciple One every year. So if you would win one person, disciple that person every year, one a year, the church would double its size within one year. If people had a zeal for souls. If people had a zeal for winning people to Christ. They'd be zealous of good works. Amen? I think that's a, it's just a joy to be zealous. I mean, think about the opposite. You know, being, you know, kind of dead, you know. Several years ago, there was a pastor who began to realize that his church was just kind of spiritually sagging. It was in really bad shape. And he knew they needed a revival. And he had preached his heart out and he wasn't altogether sure exactly what it was going to take to get there. attention. So one Sunday morning he came into church and in his morning message he said, oh, by the way I want to announce we're going to have a funeral tonight. And everybody thought a funeral tonight? Yeah, the evening service we have a funeral tonight so everybody will be here. And so everybody left the church wondering who was the dead person? Who was the funeral? Who were they going to have a funeral for? So word got out all over town and no one knew who the deceased individual was and so they decided that we better come and see who it is. So the whole town showed up. It was standing room only in the church house. So when they came in the church house there was a casket down here. Amen? Some of you may already get this one. There's a casket down here. But the thing that was amazing about it is that the lid of the casket it was turned around backwards so you were looking at the lid of the casket which was open. Ordinarily it would be the other way around so that when you filed past the casket you would see the deceased. But he turned it around and so the casket sitting in the middle of the aisle just like this and the lid is up, the top is up on it and he said, now that everybody is here? He said, I want you all to come and just file past the casket and view the deceased. And so they all got up and they said, wow we're going to find out who this is now. And as they filed past the casket they looked into it and there was a mirror on the bottom of it. There was a mirror on the bottom of it. And everybody saw themselves in the reflection. And he said this, he said, you are the deceased. The church is dead and it needs to be revived. It needs to live again. It needs to be resurrected back to what it once was. And the zeal of the Lord needs to be back in the house of God. Now that was a pretty radical way of getting their attention, but it got their attention. And again I'm not saying that about this church tonight, I'm just saying this in a general statement that really in many churches today we just need an awakening. We just need to be awakened. And we need to get back to the part to where we're not living a halfway Christian life. We're living all out for the Lord. So I thought that was a pretty good illustration. And of course here as we look further on the church at Laodicea we see what ends up happening here. I'll just very quickly read this in verse 19 it says, \"'As many as I love I rebuke and chasten.'\" I like that. Somebody said, well you know what we're living in Laodicea in the period of the church age. Well yeah, but we can still repent and get right with God. Amen. \"'As many as I love I rebuke and chasten.'\" And it said, \"'Be zealous and repent. Behold I stand at the door and knock.'\" That's an amazing thing. \"'If any man hear my voice and open the door I will come in unto him and will sup with him and he with me.'\" And of course we use that in Saul winning. But what Jesus is saying here is, hey listen you folks have locked me out of my church I want back in again. There he is knocking on the door, let me back in. He wants back into his own church again. It's amazing. Psalm 86 and verse 12, \"'I will praise the Lord my God with all my heart and I will glorify thy name forevermore.'\" Joshua 22, 5, \"'But take diligent he to do the commandment and the law which Moses, the servant of the Lord, charged you to love the Lord your God and to walk in all His ways and to keep His commandments and to cleave unto Him and serve Him with all your heart and with all your soul.'\" 1 Samuel 12, 24, \"'Only fear the Lord and serve Him in truth with all your heart for consider how great things He hath done for you.'\" Psalm 91, \"'I will praise thee O Lord with my whole heart I will show forth all thy marvelous works.'\" Psalm 111, verse 1, \"'Praise ye the Lord. I will praise the Lord with my whole heart in the assembly of the upright and in the congregation.'\" Psalm 119, 2, \"'Blessed are they that keep His testimonies and seek Him with the whole heart.'\" Psalm 119, 10, \"'With my whole heart have I sought thee O let me not wander from thy commandments.'\" Psalm 119, 69, \"'They are proud they have forged a lie against me but I will keep thy precepts with my whole heart.'\" Psalm 138, verses 1 and 2, \"'I will praise thee with my whole heart before the gods will I sing praise unto thee. I will worship toward the Holy Temple and praise thy name for thy loving kindness and for thy truth for thou hast magnified thy word above all thy name.'\" And what of the backslidden? What about the backslidden? Isaiah 1, verses 4 and 5, \"'The vision of Isaiah the son of Amoz which he saw concerning Judah and Jerusalem in the days of Uzziah, Jotham, Ahaz, Hezekiah kings of Judah.'\" Ah, sinful nation of people laden with iniquity and the seed of evildoers, children that are corruptors. \"'They have forsaken the Lord, they have provoked the Holy One of Israel and in anger they are gone away backward. Why should you be stricken anymore? Will you revolt more and more? The whole head is sick and the whole heart faint.'\" See that's that principle that's the whole idea of half-heartedness. Jeremiah chapter 3 and verse 10, \"'And yet for all her treacherous sister Judah hath not turned unto me with her whole heart, but faintedly saith the Lord.'\" So when people are backslidden this is what they do, they no longer serve God with the whole heart. But Jeremiah 29 verses 11-13 says this, \"'For I know the thoughts that I think toward you, saith the Lord, thoughts of peace and not of evil, to give you an expected end. Then shall you call upon me, and ye shall go and pray unto me, and I will hearken unto you. And ye shall seek me and find me, when ye shall search for me with all your heart.'\" Amen. When you search for me with all your heart. What a wonderful passage of Scripture that is. That's the cure by the way for half-heartedness is searching God with your whole heart. Pastor Stephen Becker of Regency Baptist Church in the Sacramento, California where he wrote this, and I preached for him not too long ago. He said this, he wrote this in a devotional he wrote for his church. He said, \"'If you had to choose between a Christian that was cold and hardened towards the Lord, one that was a middle of the road Christian, which one would you choose?' Our logic would certainly think that coming to church sometimes instead of never coming is at least doing some good, right? Well I believe half-hearted Christianity is a battle of our era. This lukewarm lifestyle does more harm to the faith than those who have completely turned away from the Lord. Some good is better than none, I agree. But what kind of an impact will this way of living make on future generations? That's a pregnant thought. King Amaziah was a half-hearted follower of the Lord. In 2 Chronicles 25.2 it reads this, \"'And he did that which was right in the sight of the Lord, but not with a perfect heart. He did some good, but he certainly wasn't sold out on fire, dedicated and fervent in his service. Half is better than none, but in terms of what kind of future influence this will make it is detrimental.' There is a story of a man who wanted to sell his house for $2,000, you can't imagine a house for $2,000. Another man wanted very badly to buy it but couldn't afford it. After much bargaining the owner agreed to sell the house for half the original price with a catch that he would retain ownership of one small nail protruding from just over the door.\" I read that and I thought, what? After many years the original owner wanted the house back, but the new owner was unwilling to sell. So, the first owner went out, found the carcass of a dead dog and hung it from the single nail he still owned. Soon the house became unlivable and the family was forced to sell the house to the owner of the nail on his terms. The moral of the story is this, give the devil just one small part of your life and he will make it impossible for Christ's presence to live there. Huh? It's simple but profound. So, the truth is this, there is no such thing as a half-hearted Christian. You're either in or you're out. Pastor Becker says, surrender yourself fully to the Lord and leave no part behind. Now that's important to leave no part behind. What part of us do we leave behind? You know, God doesn't want us to leave any part behind. He wants us to be in service to Him with all heart. And to be lukewarm is to be half-hearted. And Jesus said, a half-hearted Christianity makes me sick. Makes him sick of heart. It breaks his heart when he sees that we are only living half way. No such thing as a half-way Christian. You know, I mean that's why I hear people say, well, you know God is kind of a half-way Christian. Listen, you're either going to serve Him or you aren't. You're not going to serve Him and you're not walking the way you should. Then the Bible says you're backslidden. Half-hearted Christianity is very damaging and detrimental to the cause of Christ. By the way, our children need to see that we're all in. We want our children to have a holy zeal for the things of God. We want them to want to live for Jesus. If they don't see us do it then why would you be surprised when they don't do it? They need to see the sincerity of our Christianity, the zeal, the joy, the happiness, the excitement, the enthusiasm. Not about you but I'm just excited about being saved. You know, being saved to me that's an exciting thing. I mean, you remember when you got saved? You remember? You remember how excited you were? Someone said to me one time, oh, you Christians miss all the fun. I said, no, the only thing I'm going to miss is going to hell. I don't have to go to hell. Amen? In fact, I'm not going to hell. Now that right there is enough to make you happy and joyful. People just, if someone said, well, you know what, brother, my son, it seems like people get saved and after about 18 months to two years, it kind of just wears off and it gets just, you know, just becomes the norm. Should never be that way. The longer you live, the more excited you should be. You know? The more that whole enthusiasm ought to be there, really should be. We don't want to be half hearted. Half hearted Christianity does not please the Lord. So David mentioned several times, I want to serve the Lord and live for him with a whole heart, with a whole heart, a whole heart. I trust that God has used his word tonight to speak to you about this as he's spoken to me today. Let's all stand with our heads bowed and eyes closed tonight. With every head bowed and every eye closed tonight, as our sister comes to play the instrument, how's God spoken to you? Thou shalt love. ",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.800000190734863,
      "text": " came from. I mean, can you imagine that bass came out of"
    },
    {
      "id": 1,
      "start": 4.840000152587891,
      "end": 8.4399995803833,
      "text": " that guy? I mean, you know a young guy with a bass voice"
    },
    {
      "id": 2,
      "start": 8.479999542236328,
      "end": 10.9399995803833,
      "text": " like that, that was amazing. What a great finish that was,"
    },
    {
      "id": 3,
      "start": 10.979999542236328,
      "end": 13.680000305175781,
      "text": " amen. And I heard some of you Baptists back there tapping"
    },
    {
      "id": 4,
      "start": 13.720000267028809,
      "end": 17.920000076293945,
      "text": " your toes. Amen. Praise the Lord. I enjoyed that. I"
    },
    {
      "id": 5,
      "start": 17.959999084472656,
      "end": 20.719999313354492,
      "text": " videoed that and I'm going to put it on my Facebook page so"
    },
    {
      "id": 6,
      "start": 20.760000228881836,
      "end": 24.420000076293945,
      "text": " that everybody can see the great music you folks have"
    },
    {
      "id": 7,
      "start": 24.459999084472656,
      "end": 26.81999969482422,
      "text": " here. I appreciate so much your music. It's been a joy"
    },
    {
      "id": 8,
      "start": 26.81999969482422,
      "end": 30.920000076293945,
      "text": " these last few days just to be able to sing the old hymns of"
    },
    {
      "id": 9,
      "start": 30.959999084472656,
      "end": 33.81999969482422,
      "text": " the faith. And to have these young men tonight get up and"
    },
    {
      "id": 10,
      "start": 33.86000061035156,
      "end": 36.220001220703125,
      "text": " sing, they're really good. I'll tell you what, I think I"
    },
    {
      "id": 11,
      "start": 36.2599983215332,
      "end": 40.060001373291016,
      "text": " ought to take them with me. I need some singers. You know"
    },
    {
      "id": 12,
      "start": 40.099998474121094,
      "end": 42.7400016784668,
      "text": " some evangelists travel in a team and they have singers"
    },
    {
      "id": 13,
      "start": 42.7599983215332,
      "end": 46.900001525878906,
      "text": " with them, several of them do. And I've never had anybody"
    },
    {
      "id": 14,
      "start": 46.939998626708984,
      "end": 49.939998626708984,
      "text": " travel with me to sing. Sometimes I try to sing, but"
    },
    {
      "id": 15,
      "start": 49.97999954223633,
      "end": 51.939998626708984,
      "text": " they always tell me, no don't sing Brother Meshon, just"
    },
    {
      "id": 16,
      "start": 51.97999954223633,
      "end": 55.02000045776367,
      "text": " preach, amen. But I enjoyed that tonight, it was a"
    },
    {
      "id": 17,
      "start": 55.2400016784668,
      "end": 57.68000030517578,
      "text": " blessing. Just want to let you know before I preach tonight"
    },
    {
      "id": 18,
      "start": 57.720001220703125,
      "end": 59.880001068115234,
      "text": " how much we appreciate you folks. You've been a blessing"
    },
    {
      "id": 19,
      "start": 59.91999816894531,
      "end": 62.880001068115234,
      "text": " to us over the years. And it's been good to be back here"
    },
    {
      "id": 20,
      "start": 62.91999816894531,
      "end": 66.22000122070312,
      "text": " again and to meet some old friends after a few years of"
    },
    {
      "id": 21,
      "start": 66.26000213623047,
      "end": 69.26000213623047,
      "text": " not having been here. And then also too we've met some new"
    },
    {
      "id": 22,
      "start": 69.30000305175781,
      "end": 72.45999908447266,
      "text": " people that have been added to the church since we were last"
    },
    {
      "id": 23,
      "start": 72.5,
      "end": 75.83999633789062,
      "text": " here. And we have really enjoyed this week together"
    },
    {
      "id": 24,
      "start": 75.86000061035156,
      "end": 77.94000244140625,
      "text": " with you. It's been a blessing to spend time with the"
    },
    {
      "id": 25,
      "start": 77.95999908447266,
      "end": 80.9000015258789,
      "text": " pastor and his wife and his family. We've enjoyed that as"
    },
    {
      "id": 26,
      "start": 80.94000244140625,
      "end": 83.58000183105469,
      "text": " well. And we've eaten well over there, praise the Lord."
    },
    {
      "id": 27,
      "start": 83.69999694824219,
      "end": 88.18000030517578,
      "text": " Mrs. Pastor has been feeding us well. And so we are leaving"
    },
    {
      "id": 28,
      "start": 88.19999694824219,
      "end": 91.04000091552734,
      "text": " here a little heavier than we came. But that's alright"
    },
    {
      "id": 29,
      "start": 91.08000183105469,
      "end": 93.63999938964844,
      "text": " because you know it's always a blessing to be able to sit"
    },
    {
      "id": 30,
      "start": 93.68000030517578,
      "end": 95.77999877929688,
      "text": " down and enjoy a good meal and just have fellowship around"
    },
    {
      "id": 31,
      "start": 95.81999969482422,
      "end": 99.31999969482422,
      "text": " the table with God's people. And we've enjoyed that. Also"
    },
    {
      "id": 32,
      "start": 99.36000061035156,
      "end": 101.08000183105469,
      "text": " too I want to let you know how much we appreciate your"
    },
    {
      "id": 33,
      "start": 101.12000274658203,
      "end": 103.0199966430664,
      "text": " support of our ministry. You've been faithful and we"
    },
    {
      "id": 34,
      "start": 103.05999755859375,
      "end": 105.86000061035156,
      "text": " certainly appreciate that. And by the way let me say this, I"
    },
    {
      "id": 35,
      "start": 105.9000015258789,
      "end": 108.62000274658203,
      "text": " want to commend you, you are one of the few of our"
    },
    {
      "id": 36,
      "start": 108.66000366210938,
      "end": 111.95999908447266,
      "text": " supporting churches that sends us birthday cards, and"
    },
    {
      "id": 37,
      "start": 112.04000091552734,
      "end": 114.87999725341797,
      "text": " anniversary cards, and Christmas cards. And you keep"
    },
    {
      "id": 38,
      "start": 114.91999816894531,
      "end": 117.95999908447266,
      "text": " up with those events in our lives. And that means a lot to"
    },
    {
      "id": 39,
      "start": 117.9800033569336,
      "end": 120.91999816894531,
      "text": " us because many times even though we have supporting"
    },
    {
      "id": 40,
      "start": 120.95999908447266,
      "end": 124.5,
      "text": " churches that we love and we appreciate sometimes we don't"
    },
    {
      "id": 41,
      "start": 124.5199966430664,
      "end": 128.16000366210938,
      "text": " always hear from our churches. And it's so good for us to be"
    },
    {
      "id": 42,
      "start": 128.1999969482422,
      "end": 131.24000549316406,
      "text": " able to hear from your church. And it means a lot, it really"
    },
    {
      "id": 43,
      "start": 131.25999450683594,
      "end": 133.60000610351562,
      "text": " does. We have a church up in Alaska what they do is every"
    },
    {
      "id": 44,
      "start": 133.63999938964844,
      "end": 138.5399932861328,
      "text": " fifth Wednesday night they come to the Wednesday night"
    },
    {
      "id": 45,
      "start": 138.5800018310547,
      "end": 140.74000549316406,
      "text": " service. And what they do is everybody in the church"
    },
    {
      "id": 46,
      "start": 140.82000732421875,
      "end": 144.16000366210938,
      "text": " writes to missionaries. And they've been doing that now for"
    },
    {
      "id": 47,
      "start": 144.1999969482422,
      "end": 146.86000061035156,
      "text": " several years. I think the pastor told me for at least the"
    },
    {
      "id": 48,
      "start": 146.89999389648438,
      "end": 151.3000030517578,
      "text": " last 25 or 30 years. And so we always get a nice card from"
    },
    {
      "id": 49,
      "start": 151.33999633789062,
      "end": 153.63999938964844,
      "text": " them at different events and that's always been such a joy"
    },
    {
      "id": 50,
      "start": 153.67999267578125,
      "end": 156.5399932861328,
      "text": " to us. So we appreciate that. And your support means a lot"
    },
    {
      "id": 51,
      "start": 156.5800018310547,
      "end": 158.74000549316406,
      "text": " to us because we couldn't stay on the road really without"
    },
    {
      "id": 52,
      "start": 158.77999877929688,
      "end": 163.72000122070312,
      "text": " having some support from churches that we've known over"
    },
    {
      "id": 53,
      "start": 163.75999450683594,
      "end": 167.05999755859375,
      "text": " the years that we love, and they love us, and they've"
    },
    {
      "id": 54,
      "start": 167.0800018310547,
      "end": 169.72000122070312,
      "text": " helped us. And it's been a blessing because our ministry"
    },
    {
      "id": 55,
      "start": 169.74000549316406,
      "end": 172.0,
      "text": " has always been geared towards small churches. We don't"
    },
    {
      "id": 56,
      "start": 172.0399932861328,
      "end": 175.0399932861328,
      "text": " generally go into bigger churches. The largest church"
    },
    {
      "id": 57,
      "start": 175.0800018310547,
      "end": 178.17999267578125,
      "text": " that I think I've ever preached in was probably the weekend I"
    },
    {
      "id": 58,
      "start": 178.22000122070312,
      "end": 181.0800018310547,
      "text": " was there was about 1,500 in attendance. And I'm not used to"
    },
    {
      "id": 59,
      "start": 181.1199951171875,
      "end": 185.32000732421875,
      "text": " that many people. And usually I'm preaching in churches that"
    },
    {
      "id": 60,
      "start": 185.36000061035156,
      "end": 189.02000427246094,
      "text": " run between 50 and 150. And we want to help the smaller"
    },
    {
      "id": 61,
      "start": 189.05999755859375,
      "end": 191.3000030517578,
      "text": " churches. And we want to help the church planters. And I've"
    },
    {
      "id": 62,
      "start": 191.32000732421875,
      "end": 194.16000366210938,
      "text": " been involved in church planning. And I'm glad that"
    },
    {
      "id": 63,
      "start": 194.1999969482422,
      "end": 197.44000244140625,
      "text": " I've had the opportunity to do that. We planted a Spanish"
    },
    {
      "id": 64,
      "start": 197.66000366210938,
      "end": 200.36000061035156,
      "text": " speaking church in the inner city of San Diego. We started"
    },
    {
      "id": 65,
      "start": 200.39999389648438,
      "end": 204.25999450683594,
      "text": " that church with a Mexican national. And that work is"
    },
    {
      "id": 66,
      "start": 204.3000030517578,
      "end": 207.6999969482422,
      "text": " doing well. And we're thankful for it. I understand that we're"
    },
    {
      "id": 67,
      "start": 207.74000549316406,
      "end": 209.74000549316406,
      "text": " getting ready to plant another church out of that one. So we"
    },
    {
      "id": 68,
      "start": 209.77999877929688,
      "end": 212.33999633789062,
      "text": " support that work out of our home church. I think we still"
    },
    {
      "id": 69,
      "start": 212.3800048828125,
      "end": 215.77999877929688,
      "text": " do. And so we're glad for that. And I've helped other young"
    },
    {
      "id": 70,
      "start": 215.82000732421875,
      "end": 218.0399932861328,
      "text": " men as well and try to be an encouragement to them in church"
    },
    {
      "id": 71,
      "start": 218.0800018310547,
      "end": 221.6199951171875,
      "text": " planning. So you help us to help them. And you minister to"
    },
    {
      "id": 72,
      "start": 221.66000366210938,
      "end": 225.36000061035156,
      "text": " us and it helps us to minister to others. And by the way it"
    },
    {
      "id": 73,
      "start": 225.5800018310547,
      "end": 230.77999877929688,
      "text": " helps us to put gasoline in the tank. Amen. That SUV it doesn't"
    },
    {
      "id": 74,
      "start": 230.82000732421875,
      "end": 233.4199981689453,
      "text": " go down the road without gasoline. It is not electric."
    },
    {
      "id": 75,
      "start": 233.4600067138672,
      "end": 237.75999450683594,
      "text": " And it is not hybrid. It's gas engine. And even though it's a"
    },
    {
      "id": 76,
      "start": 237.8000030517578,
      "end": 241.86000061035156,
      "text": " pretty thrifty little vehicle at the same time gasoline out in"
    },
    {
      "id": 77,
      "start": 241.89999389648438,
      "end": 245.5,
      "text": " our area of the world is extremely expensive. So we're"
    },
    {
      "id": 78,
      "start": 245.5399932861328,
      "end": 248.3000030517578,
      "text": " thankful for your support of our ministry and your partners with"
    },
    {
      "id": 79,
      "start": 248.33999633789062,
      "end": 251.27999877929688,
      "text": " us. And we don't take that for granted. So thank you. We"
    },
    {
      "id": 80,
      "start": 251.3000030517578,
      "end": 254.74000549316406,
      "text": " appreciate it church. God bless you for it. And we want you to"
    },
    {
      "id": 81,
      "start": 254.86000061035156,
      "end": 257.05999755859375,
      "text": " know we love you and we appreciate you. Deuteronomy"
    },
    {
      "id": 82,
      "start": 257.1000061035156,
      "end": 259.760009765625,
      "text": " chapter 6 in your Bible tonight. Now I am not feeling well and"
    },
    {
      "id": 83,
      "start": 259.79998779296875,
      "end": 262.5400085449219,
      "text": " I've been telling you that the last couple of days. I'm not"
    },
    {
      "id": 84,
      "start": 262.55999755859375,
      "end": 266.6400146484375,
      "text": " shaking hands tonight I'm just blowing my nose. So forgive me"
    },
    {
      "id": 85,
      "start": 266.67999267578125,
      "end": 269.7799987792969,
      "text": " for that. I had a bad day today. I got up I guess this morning"
    },
    {
      "id": 86,
      "start": 269.79998779296875,
      "end": 273.0400085449219,
      "text": " about 5.30 and I thought I'd been hit by a truck. And"
    },
    {
      "id": 87,
      "start": 273.0799865722656,
      "end": 275.7200012207031,
      "text": " apparently this thing has moved from my chest down to my head."
    },
    {
      "id": 88,
      "start": 275.739990234375,
      "end": 279.9800109863281,
      "text": " And so prayerfully I'll be able to get over this the next couple"
    },
    {
      "id": 89,
      "start": 280.0199890136719,
      "end": 282.6199951171875,
      "text": " of days. I'm glad I have a couple of days to rest. So thank"
    },
    {
      "id": 90,
      "start": 282.8399963378906,
      "end": 285.1000061035156,
      "text": " you for your prayers and we appreciate that so much."
    },
    {
      "id": 91,
      "start": 285.1400146484375,
      "end": 288.3399963378906,
      "text": " Deuteronomy chapter 6 and if you will stand please with me out"
    },
    {
      "id": 92,
      "start": 288.3800048828125,
      "end": 290.4200134277344,
      "text": " of respect and reverence to the reading of God's holy, infallible"
    },
    {
      "id": 93,
      "start": 290.44000244140625,
      "end": 294.0799865722656,
      "text": " and earned inspired Word. Deuteronomy chapter 6 reading"
    },
    {
      "id": 94,
      "start": 294.1199951171875,
      "end": 297.3599853515625,
      "text": " from the Old King James Bible. I'm going to read you can"
    },
    {
      "id": 95,
      "start": 297.3800048828125,
      "end": 299.7200012207031,
      "text": " follow along silently if you will please. In fact I think"
    },
    {
      "id": 96,
      "start": 299.760009765625,
      "end": 302.1199951171875,
      "text": " what I'll do is I'm going to begin in verse 1 usually I start"
    },
    {
      "id": 97,
      "start": 302.1600036621094,
      "end": 305.1000061035156,
      "text": " in verse 4. But I'm going to begin in the very first verse of"
    },
    {
      "id": 98,
      "start": 305.1199951171875,
      "end": 308.05999755859375,
      "text": " Deuteronomy 6. Now this was written to the children of"
    },
    {
      "id": 99,
      "start": 308.1000061035156,
      "end": 310.70001220703125,
      "text": " Israel. However what we're going to see here tonight in this"
    },
    {
      "id": 100,
      "start": 310.7200012207031,
      "end": 314.2799987792969,
      "text": " particular text has an application to us today. It has"
    },
    {
      "id": 101,
      "start": 314.32000732421875,
      "end": 317.4599914550781,
      "text": " an application to us as a church. It has an application to"
    },
    {
      "id": 102,
      "start": 317.4800109863281,
      "end": 321.4599914550781,
      "text": " us as individuals. And so what I'm going to read here even"
    },
    {
      "id": 103,
      "start": 321.5,
      "end": 323.1600036621094,
      "text": " though like I say it was written to the children of"
    },
    {
      "id": 104,
      "start": 323.20001220703125,
      "end": 325.9599914550781,
      "text": " Israel, the nation of Israel it has a definite application to"
    },
    {
      "id": 105,
      "start": 326.0,
      "end": 330.29998779296875,
      "text": " us in this period of time, in this dispensation. So beginning"
    },
    {
      "id": 106,
      "start": 330.3399963378906,
      "end": 333.79998779296875,
      "text": " in verse 1 of chapter 6 I read this, Now these are the"
    },
    {
      "id": 107,
      "start": 333.8399963378906,
      "end": 336.5400085449219,
      "text": " commandments, the statutes and the judgments, which the Lord"
    },
    {
      "id": 108,
      "start": 336.5799865722656,
      "end": 340.5799865722656,
      "text": " your God commanded to teach you, that ye might do them in"
    },
    {
      "id": 109,
      "start": 340.5799865722656,
      "end": 344.2200012207031,
      "text": " the land whither you go to possess it, that thou mightest"
    },
    {
      "id": 110,
      "start": 344.260009765625,
      "end": 348.1600036621094,
      "text": " fear the Lord thy God to keep all His statutes and His"
    },
    {
      "id": 111,
      "start": 348.20001220703125,
      "end": 351.8999938964844,
      "text": " commandments which I command thee, thou and thy son, and"
    },
    {
      "id": 112,
      "start": 351.94000244140625,
      "end": 356.20001220703125,
      "text": " thy sons' sons, all the days of thy life, and that thy days"
    },
    {
      "id": 113,
      "start": 356.239990234375,
      "end": 359.6000061035156,
      "text": " may be prolonged. Hear therefore, O Israel, and"
    },
    {
      "id": 114,
      "start": 359.6400146484375,
      "end": 362.1400146484375,
      "text": " observe to do it. Now it's the second time God says that"
    },
    {
      "id": 115,
      "start": 362.17999267578125,
      "end": 364.2200012207031,
      "text": " there's something that needs to be done, you need to do it."
    },
    {
      "id": 116,
      "start": 364.239990234375,
      "end": 367.4800109863281,
      "text": " Hear therefore, O Israel, and observe to do it, that it may"
    },
    {
      "id": 117,
      "start": 367.5199890136719,
      "end": 370.3599853515625,
      "text": " be well with thee. So I understand this to mean if you"
    },
    {
      "id": 118,
      "start": 370.6600036621094,
      "end": 373.8399963378906,
      "text": " don't do it it's not going to be well with you. See obedience"
    },
    {
      "id": 119,
      "start": 373.8599853515625,
      "end": 377.79998779296875,
      "text": " is an important thing. Amen, would you agree with that? So"
    },
    {
      "id": 120,
      "start": 377.8399963378906,
      "end": 379.94000244140625,
      "text": " hear therefore, O Israel, and observe to do it, that it may"
    },
    {
      "id": 121,
      "start": 379.9800109863281,
      "end": 383.0400085449219,
      "text": " be well with thee, and that ye may increase mightily as the"
    },
    {
      "id": 122,
      "start": 383.0799865722656,
      "end": 386.2799987792969,
      "text": " Lord God of thy fathers hath promised thee in the land that"
    },
    {
      "id": 123,
      "start": 386.32000732421875,
      "end": 390.3800048828125,
      "text": " floweth with milk and honey. Verse 4, Hear O Israel, the"
    },
    {
      "id": 124,
      "start": 390.4200134277344,
      "end": 393.2200012207031,
      "text": " Lord our God is one Lord, and of course that's the doctrine"
    },
    {
      "id": 125,
      "start": 393.260009765625,
      "end": 397.2200012207031,
      "text": " of monotheism. Verse 5, Now listen to this I want you to"
    },
    {
      "id": 126,
      "start": 397.2200012207031,
      "end": 402.0199890136719,
      "text": " see this, And thou shalt love the Lord thy God with all thine"
    },
    {
      "id": 127,
      "start": 402.05999755859375,
      "end": 407.9599914550781,
      "text": " heart, and with all thy soul, and with all thy might. And"
    },
    {
      "id": 128,
      "start": 408.0,
      "end": 410.4599914550781,
      "text": " these words which I commanded this day shall be in thine"
    },
    {
      "id": 129,
      "start": 410.5,
      "end": 414.1000061035156,
      "text": " heart. And thou shalt teach them diligently, by the way"
    },
    {
      "id": 130,
      "start": 414.1400146484375,
      "end": 418.3399963378906,
      "text": " enthusiastically, fervently. And thou shalt teach them"
    },
    {
      "id": 131,
      "start": 418.3800048828125,
      "end": 421.44000244140625,
      "text": " diligently unto thy children, and shalt talk of them when"
    },
    {
      "id": 132,
      "start": 421.4800109863281,
      "end": 424.739990234375,
      "text": " thou sittest in thine house, when thou walkest by the way,"
    },
    {
      "id": 133,
      "start": 424.79998779296875,
      "end": 431.3399963378906,
      "text": " when thou liest down, and when thou risest up. And thou"
    },
    {
      "id": 134,
      "start": 431.3800048828125,
      "end": 434.4800109863281,
      "text": " shalt bind them for a sign upon thine hand, and they"
    },
    {
      "id": 135,
      "start": 434.5199890136719,
      "end": 437.0799865722656,
      "text": " shall be as frontless between thine eyes. And thou shalt"
    },
    {
      "id": 136,
      "start": 437.1199951171875,
      "end": 440.67999267578125,
      "text": " write them upon the post of thy house, and on thy gates."
    },
    {
      "id": 137,
      "start": 440.7200012207031,
      "end": 443.05999755859375,
      "text": " Father, we thank you now for the reading of your precious"
    },
    {
      "id": 138,
      "start": 443.0799865722656,
      "end": 446.0199890136719,
      "text": " Word, as your blessing now to the preaching of your Word"
    },
    {
      "id": 139,
      "start": 446.05999755859375,
      "end": 448.32000732421875,
      "text": " over the next several minutes. Now, God I need your help"
    },
    {
      "id": 140,
      "start": 448.3599853515625,
      "end": 451.3599853515625,
      "text": " tonight, so please help me. I am a needy preacher, and I"
    },
    {
      "id": 141,
      "start": 451.3999938964844,
      "end": 453.6600036621094,
      "text": " cannot do this except you help me and strengthen me this"
    },
    {
      "id": 142,
      "start": 453.6600036621094,
      "end": 457.05999755859375,
      "text": " evening. So, I pray for your hand upon me as I attempt to"
    },
    {
      "id": 143,
      "start": 457.1000061035156,
      "end": 459.8999938964844,
      "text": " rightly divide the Word of truth. So, God meet with us"
    },
    {
      "id": 144,
      "start": 459.9200134277344,
      "end": 462.29998779296875,
      "text": " now, speak to us afresh tonight, and we'll thank you"
    },
    {
      "id": 145,
      "start": 462.32000732421875,
      "end": 465.6400146484375,
      "text": " for it. In Jesus' name and for His sake, amen. Thank you,"
    },
    {
      "id": 146,
      "start": 465.6600036621094,
      "end": 468.1400146484375,
      "text": " may you be seated. When I look at this passage of"
    },
    {
      "id": 147,
      "start": 468.1600036621094,
      "end": 470.6400146484375,
      "text": " Scripture one of the things that I see is this, God does"
    },
    {
      "id": 148,
      "start": 470.67999267578125,
      "end": 476.0400085449219,
      "text": " not want us to be half-hearted Christians. Now, I'm going"
    },
    {
      "id": 149,
      "start": 476.0799865722656,
      "end": 478.0400085449219,
      "text": " to say this tonight as I get started, I see a lot of"
    },
    {
      "id": 150,
      "start": 478.0799865722656,
      "end": 482.3800048828125,
      "text": " half-heartedness many times amongst God's people. Now,"
    },
    {
      "id": 151,
      "start": 482.3999938964844,
      "end": 484.70001220703125,
      "text": " God wants us to worship Him with the whole heart. He"
    },
    {
      "id": 152,
      "start": 484.739990234375,
      "end": 487.739990234375,
      "text": " doesn't want us to be a half-hearted people. He"
    },
    {
      "id": 153,
      "start": 487.7799987792969,
      "end": 491.0799865722656,
      "text": " doesn't want to worship Him in a half-hearted way. And I"
    },
    {
      "id": 154,
      "start": 491.1199951171875,
      "end": 493.1199951171875,
      "text": " really love what he says here in this passage of"
    },
    {
      "id": 155,
      "start": 493.1400146484375,
      "end": 495.2799987792969,
      "text": " Scripture how wonderful it is, and how practical it is as"
    },
    {
      "id": 156,
      "start": 495.32000732421875,
      "end": 498.1600036621094,
      "text": " well when you read down through this. And it makes it"
    },
    {
      "id": 157,
      "start": 498.17999267578125,
      "end": 500.9200134277344,
      "text": " very personal when he says, \"...and now shalt love the"
    },
    {
      "id": 158,
      "start": 500.9599914550781,
      "end": 503.0,
      "text": " Lord thy God with,\" what does it say? \"...with all thine"
    },
    {
      "id": 159,
      "start": 503.0199890136719,
      "end": 508.4599914550781,
      "text": " heart, and with all thy soul, and with all thy might.\" With"
    },
    {
      "id": 160,
      "start": 508.5,
      "end": 510.55999755859375,
      "text": " every fiber of being, everything that is within us"
    },
    {
      "id": 161,
      "start": 510.7799987792969,
      "end": 513.4199829101562,
      "text": " we ought to be loving the Lord. With all our heart, all"
    },
    {
      "id": 162,
      "start": 513.4600219726562,
      "end": 517.1199951171875,
      "text": " our soul, all our might. And that's what God says. And you"
    },
    {
      "id": 163,
      "start": 517.1599731445312,
      "end": 519.1199951171875,
      "text": " know the Christian that's not living that way is really"
    },
    {
      "id": 164,
      "start": 519.1599731445312,
      "end": 524.260009765625,
      "text": " living a pretty miserable life. Wouldn't you think? But"
    },
    {
      "id": 165,
      "start": 524.2999877929688,
      "end": 526.2999877929688,
      "text": " yet we see an awful lot of half-hearted Christianity"
    },
    {
      "id": 166,
      "start": 526.3400268554688,
      "end": 529.2999877929688,
      "text": " today. Now, I like to go into churches sometimes just"
    },
    {
      "id": 167,
      "start": 529.3400268554688,
      "end": 533.3400268554688,
      "text": " watch people. By the way let me say this, I like airports."
    },
    {
      "id": 168,
      "start": 533.3800048828125,
      "end": 536.739990234375,
      "text": " I really do, I enjoy airports. Now, I don't like"
    },
    {
      "id": 169,
      "start": 536.780029296875,
      "end": 539.3200073242188,
      "text": " traveling, but I will say that I enjoy airports. You know"
    },
    {
      "id": 170,
      "start": 539.3400268554688,
      "end": 544.4400024414062,
      "text": " why? Because I'm an embedded people watcher. So, I like to"
    },
    {
      "id": 171,
      "start": 544.47998046875,
      "end": 547.1799926757812,
      "text": " watch people. So, I'll sit in airports and I'll watch"
    },
    {
      "id": 172,
      "start": 547.219970703125,
      "end": 550.719970703125,
      "text": " people. You ever do that? And you say, well what's up with"
    },
    {
      "id": 173,
      "start": 550.760009765625,
      "end": 553.1199951171875,
      "text": " this guy? You know I mean you try to figure out what"
    },
    {
      "id": 174,
      "start": 553.1599731445312,
      "end": 555.719970703125,
      "text": " they're all about. You can't really do that, but I mean"
    },
    {
      "id": 175,
      "start": 555.760009765625,
      "end": 559.760009765625,
      "text": " it's kind of fun to try to think about it. You know and"
    },
    {
      "id": 176,
      "start": 559.7999877929688,
      "end": 561.6599731445312,
      "text": " you sometimes see a guy going through the airport with a"
    },
    {
      "id": 177,
      "start": 561.7000122070312,
      "end": 565.0999755859375,
      "text": " fairly attractive woman and this guy is not looking so"
    },
    {
      "id": 178,
      "start": 565.1400146484375,
      "end": 568.5999755859375,
      "text": " good. And you wonder how did they ever get together?"
    },
    {
      "id": 179,
      "start": 568.9199829101562,
      "end": 572.9199829101562,
      "text": " You know? I mean, and that's maybe not fair, maybe that's"
    },
    {
      "id": 180,
      "start": 572.9600219726562,
      "end": 576.0599975585938,
      "text": " not kind, but you know it's just the way you are when"
    },
    {
      "id": 181,
      "start": 576.0999755859375,
      "end": 578.8599853515625,
      "text": " you're a people watcher. So, when I come into churches"
    },
    {
      "id": 182,
      "start": 578.9000244140625,
      "end": 583.1400146484375,
      "text": " sometimes I like to watch people. Now, certainly I'm"
    },
    {
      "id": 183,
      "start": 583.1599731445312,
      "end": 586.3400268554688,
      "text": " going to watch people when I'm preaching. Now, I'm"
    },
    {
      "id": 184,
      "start": 586.3800048828125,
      "end": 589.3400268554688,
      "text": " standing up here in the sacred desk where your pastor"
    },
    {
      "id": 185,
      "start": 589.3800048828125,
      "end": 591.4400024414062,
      "text": " stands all the time, and others that have preached"
    },
    {
      "id": 186,
      "start": 591.47998046875,
      "end": 594.9199829101562,
      "text": " here as well and have been extended the courtesy, the"
    },
    {
      "id": 187,
      "start": 594.9400024414062,
      "end": 598.280029296875,
      "text": " privilege, the honor of preaching from his pulpit. And"
    },
    {
      "id": 188,
      "start": 598.280029296875,
      "end": 600.1599731445312,
      "text": " I'm going to tell you what, I can see everything going"
    },
    {
      "id": 0,
      "start": 600.1599731445312,
      "end": 607.4199733734131,
      "text": " going on out here from this perch? I can see it all. And you know sometimes things show"
    },
    {
      "id": 1,
      "start": 607.4199733734131,
      "end": 613.9999732971191,
      "text": " up on people's countenances that really sometimes disturb me. Now maybe they don't like my preaching"
    },
    {
      "id": 2,
      "start": 613.9999732971191,
      "end": 617.6599731445312,
      "text": " or something, I don't know what it is. And then there are the people who like to sleep"
    },
    {
      "id": 3,
      "start": 617.6599731445312,
      "end": 624.0599727630615,
      "text": " during the preaching. Now I know that sometimes you come from work, you're tired, or like"
    },
    {
      "id": 4,
      "start": 624.0599727630615,
      "end": 628.6999740600586,
      "text": " in our home church we have our morning prayer meeting at quarter to nine, we have the Sunday"
    },
    {
      "id": 5,
      "start": 628.6999740600586,
      "end": 633.2599716186523,
      "text": " school hour at 9.30, we have the church service at 10.30, it ends up at around noon, and then"
    },
    {
      "id": 6,
      "start": 633.2599716186523,
      "end": 638.839973449707,
      "text": " we break and then we have lunch, and Filipinos man, gotta tell you, they eat the whole thing."
    },
    {
      "id": 7,
      "start": 638.839973449707,
      "end": 643.1799736022949,
      "text": " And so when you're done eating we come back in for the afternoon service at 1.30 and guess"
    },
    {
      "id": 8,
      "start": 643.1799736022949,
      "end": 652.1399726867676,
      "text": " what happens? Everybody wants to take a nap. Now I can see all that from the pulpit. And"
    },
    {
      "id": 9,
      "start": 652.1399726867676,
      "end": 661.4999732971191,
      "text": " I found this out. Some people can sleep with their eyes open. I mean I'm serious. I mean"
    },
    {
      "id": 10,
      "start": 661.4999732971191,
      "end": 668.6199722290039,
      "text": " you can go down there and go like this and you know it's like the elevator's at the top"
    },
    {
      "id": 11,
      "start": 668.6199722290039,
      "end": 673.9799728393555,
      "text": " but there's nobody home on that floor. I mean it's just one of those things. And so I watch"
    },
    {
      "id": 12,
      "start": 673.9799728393555,
      "end": 680.0999755859375,
      "text": " people all the time. One of the things I really watch for is I watch during the course of"
    },
    {
      "id": 13,
      "start": 680.0999755859375,
      "end": 684.8199768066406,
      "text": " the congregational singing, if I'm on the platform I like to watch people sing. And"
    },
    {
      "id": 14,
      "start": 684.8199768066406,
      "end": 690.8799743652344,
      "text": " you can really kind of tell sort of what's going on in a church. And you can really kind"
    },
    {
      "id": 15,
      "start": 690.8799743652344,
      "end": 694.9799728393555,
      "text": " of tell what's going on in an individual's life by the way they respond to the singing"
    },
    {
      "id": 16,
      "start": 694.9799728393555,
      "end": 700.5399703979492,
      "text": " of the old hymns of the faith. Dr. Ron Comfort told the preacher boys, in fact I was in the"
    },
    {
      "id": 17,
      "start": 700.5399703979492,
      "end": 705.3799743652344,
      "text": " class when he said it, he said this, he said, now listen, he said, you fellas, you young"
    },
    {
      "id": 18,
      "start": 705.3799743652344,
      "end": 709.4599761962891,
      "text": " fellas, and I was glad that he said that because I was the oldest guy in the classroom when"
    },
    {
      "id": 19,
      "start": 709.4599761962891,
      "end": 713.4599761962891,
      "text": " he said it, but he said, you young fellas, he said, when you go into your revival meetings,"
    },
    {
      "id": 20,
      "start": 713.4599761962891,
      "end": 717.2999725341797,
      "text": " your first revival meetings, one of the things you need to do is you need to sit on the platform"
    },
    {
      "id": 21,
      "start": 717.2999725341797,
      "end": 721.5399703979492,
      "text": " during your preliminaries on the first day of the revival meeting and watch the people"
    },
    {
      "id": 22,
      "start": 721.5399703979492,
      "end": 725.0999755859375,
      "text": " sing the old hymns of the faith and you can pretty much tell what kind of crowd you're"
    },
    {
      "id": 23,
      "start": 725.0999755859375,
      "end": 732.1399688720703,
      "text": " going to preach to that week. And I found that to be true. I found out that that's a"
    },
    {
      "id": 24,
      "start": 732.1399688720703,
      "end": 736.97998046875,
      "text": " factual thing. You can watch people when they sing, I mean how can you sing? There is a"
    },
    {
      "id": 25,
      "start": 736.97998046875,
      "end": 741.5799713134766,
      "text": " fountain filled with blood drawn from Emmanuel's veins. How can you sing and can it be? How"
    },
    {
      "id": 26,
      "start": 741.5799713134766,
      "end": 747.0199737548828,
      "text": " can you sing amazing grace? How can you sing anything that we sang tonight and not experience"
    },
    {
      "id": 27,
      "start": 747.0199737548828,
      "end": 754.9399719238281,
      "text": " the joy of the Lord? And some people just kind of, you know, we Baptists, we've learned"
    },
    {
      "id": 28,
      "start": 754.9399719238281,
      "end": 760.3799743652344,
      "text": " all the hymns, so we just kind of sing them by rote. You know, we just kind of go through"
    },
    {
      "id": 29,
      "start": 760.3799743652344,
      "end": 763.1399688720703,
      "text": " the motions. You know what I'm saying? I'm not saying everybody does that, so don't think"
    },
    {
      "id": 30,
      "start": 763.1399688720703,
      "end": 766.97998046875,
      "text": " this is a blanket indictment. I'm not trying to paint this with too broad a brush. I'm"
    },
    {
      "id": 31,
      "start": 766.97998046875,
      "end": 773.4599761962891,
      "text": " just saying that many times it's a litmus test. So you watch people and you say, wow,"
    },
    {
      "id": 32,
      "start": 773.4599761962891,
      "end": 780.0199737548828,
      "text": " there's something missing. Half heart of Christianity will steal the joy of the Lord right out of"
    },
    {
      "id": 33,
      "start": 780.0199737548828,
      "end": 786.6999664306641,
      "text": " your heart. You know, I've heard people say, well that brother over there, man he stole"
    },
    {
      "id": 34,
      "start": 786.6999664306641,
      "end": 793.1799774169922,
      "text": " my joy. Nobody can steal your joy. You've got to give it up. You've got to give it up."
    },
    {
      "id": 35,
      "start": 793.1799774169922,
      "end": 797.8599700927734,
      "text": " No one can take your joy from you. You have got to surrender it. And if you're living"
    },
    {
      "id": 36,
      "start": 797.8599700927734,
      "end": 802.8599700927734,
      "text": " a half heart of Christian life, which is again a terrible way to live your life, if you're"
    },
    {
      "id": 37,
      "start": 802.8599700927734,
      "end": 807.2999725341797,
      "text": " living a half heart of Christian life, I'm going to tell you right now, you're not going"
    },
    {
      "id": 38,
      "start": 807.2999725341797,
      "end": 810.3799743652344,
      "text": " to enjoy being in the house of God. You're not going to enjoy singing the old hymns of"
    },
    {
      "id": 39,
      "start": 810.3799743652344,
      "end": 813.6199798583984,
      "text": " the faith. You're not going to enjoy the preaching of the Word of God. You're not going to enjoy"
    },
    {
      "id": 40,
      "start": 813.6199798583984,
      "end": 819.1799774169922,
      "text": " the fellowship of God's people because you're half hearted. Can you imagine serving the"
    },
    {
      "id": 41,
      "start": 819.1799774169922,
      "end": 824.6999664306641,
      "text": " Lord with a half a heart? I mean, I would not, I'll tell you this right now, there's"
    },
    {
      "id": 42,
      "start": 824.6999664306641,
      "end": 829.1399688720703,
      "text": " been times, I've only said this, I've only done this twice. In my ministry over the years,"
    },
    {
      "id": 43,
      "start": 829.1399688720703,
      "end": 834.0599670410156,
      "text": " especially when I pastored, I told our people this. I said, let me tell you what. I said,"
    },
    {
      "id": 44,
      "start": 834.0599670410156,
      "end": 838.4199676513672,
      "text": " if I know beyond a shadow of a doubt that I am not going into the pulpit filled with"
    },
    {
      "id": 45,
      "start": 838.4199676513672,
      "end": 843.8199768066406,
      "text": " the Spirit of God, I'm not preaching. So if I get up one night and I say I'm not preaching"
    },
    {
      "id": 46,
      "start": 843.8199768066406,
      "end": 847.2599792480469,
      "text": " tonight because I do not believe that I'm filled with the Spirit of God tonight for"
    },
    {
      "id": 47,
      "start": 847.2599792480469,
      "end": 851.3799743652344,
      "text": " whatever reason it is, and I've only had that happen twice in my ministry, and then we have"
    },
    {
      "id": 48,
      "start": 851.3799743652344,
      "end": 858.3799743652344,
      "text": " a prayer meeting. And, you know, I kind of felt half hearted sometimes. And God convicted"
    },
    {
      "id": 49,
      "start": 858.3799743652344,
      "end": 863.7399597167969,
      "text": " me of that. I don't want to be a half hearted preacher. I don't want to be a half hearted"
    },
    {
      "id": 50,
      "start": 863.7399597167969,
      "end": 870.7399597167969,
      "text": " soul winner. Amen? Hey, listen, I don't want to be a half hearted husband. I'm invested"
    },
    {
      "id": 51,
      "start": 872.0599670410156,
      "end": 877.0999755859375,
      "text": " in this relationship. I mean, we've been, we're going on 59 years. I mean, there's an"
    },
    {
      "id": 52,
      "start": 877.0999755859375,
      "end": 881.3799743652344,
      "text": " investment here. We've been husband and wife all these years, and I don't want to be a"
    },
    {
      "id": 53,
      "start": 881.3799743652344,
      "end": 886.1399841308594,
      "text": " half hearted husband. Because the Word of God says that I'm to love my wife as Christ"
    },
    {
      "id": 54,
      "start": 886.1399841308594,
      "end": 892.1799621582031,
      "text": " also loved the church and gave himself for it. That requires that I give my all to her."
    },
    {
      "id": 55,
      "start": 892.1799621582031,
      "end": 897.5799865722656,
      "text": " And I have to, my heart should be in my marriage, and in my home, and in my family. So half"
    },
    {
      "id": 56,
      "start": 897.5799865722656,
      "end": 904.3399658203125,
      "text": " hearted Christianity is definitely a downer. And I see too much of it today. You know where"
    },
    {
      "id": 57,
      "start": 904.3399658203125,
      "end": 908.97998046875,
      "text": " I saw some real wholehearted Christians was in the Philippines. Every time I, you go into"
    },
    {
      "id": 58,
      "start": 908.97998046875,
      "end": 913.97998046875,
      "text": " a Filipino church in the Philippine islands, there's 743 islands there. We're seeing independent"
    },
    {
      "id": 59,
      "start": 913.97998046875,
      "end": 918.5399780273438,
      "text": " Baptist churches planted all over that country of 100 million people now. Bible college is"
    },
    {
      "id": 60,
      "start": 918.5399780273438,
      "end": 922.8999633789062,
      "text": " being started. Bible Institute is being started. Missionaries are being sent all over the world."
    },
    {
      "id": 61,
      "start": 922.8999633789062,
      "end": 926.4599609375,
      "text": " They say within the next five to seven years, it'll be the number one missionary sending"
    },
    {
      "id": 62,
      "start": 926.4599609375,
      "end": 931.8999633789062,
      "text": " nation on the face of the earth. And I mentioned it the other day, you can find Filipinos everywhere."
    },
    {
      "id": 63,
      "start": 931.8999633789062,
      "end": 937.8599853515625,
      "text": " Now I know it's part of their culture. They're just a happy people. Amen. They're just a"
    },
    {
      "id": 64,
      "start": 937.8599853515625,
      "end": 941.3799743652344,
      "text": " happy people. But I tell you what, when they come to church, man, they come to church all"
    },
    {
      "id": 65,
      "start": 941.3799743652344,
      "end": 947.6599731445312,
      "text": " in. And here's a message that I preached years ago, and I haven't preached it for a while."
    },
    {
      "id": 66,
      "start": 947.6599731445312,
      "end": 950.8199768066406,
      "text": " Maybe they're all in or they're all out. There just doesn't seem to be anything in"
    },
    {
      "id": 67,
      "start": 950.8199768066406,
      "end": 956.8199768066406,
      "text": " the middle. You know, when people get lackadaisical, they get lethargic, they get apathetic, and"
    },
    {
      "id": 68,
      "start": 956.8199768066406,
      "end": 961.8599853515625,
      "text": " they just kind of go through the motions. And a guy told me one time, he said, oh, you"
    },
    {
      "id": 69,
      "start": 961.8599853515625,
      "end": 966.6199645996094,
      "text": " know what? I come to church, he said, I hear you preach, but I've heard all that before."
    },
    {
      "id": 70,
      "start": 966.6199645996094,
      "end": 969.5799865722656,
      "text": " I said, oh really? He said, yeah, I've heard all that before. I know everything you said"
    },
    {
      "id": 71,
      "start": 969.5799865722656,
      "end": 972.6599731445312,
      "text": " today. The message you just preached, he said, I've heard that all, I don't know how many"
    },
    {
      "id": 72,
      "start": 972.6599731445312,
      "end": 978.0599670410156,
      "text": " times I've heard that. And I said, well, you need to hear it again. You didn't get"
    },
    {
      "id": 73,
      "start": 978.0599670410156,
      "end": 982.9399719238281,
      "text": " it the first time. You didn't get it the second or third time. And now you're telling me you've"
    },
    {
      "id": 74,
      "start": 982.9399719238281,
      "end": 986.6999816894531,
      "text": " heard all this before. Okay, well, if you've heard all this before, then my question for"
    },
    {
      "id": 75,
      "start": 986.6999816894531,
      "end": 991.4199829101562,
      "text": " you is what are you doing with it? What are you doing with it? Unto whom much is given"
    },
    {
      "id": 76,
      "start": 991.4199829101562,
      "end": 996.8599853515625,
      "text": " much is required. So listen, when God spreads a table for us in the wilderness, and we live"
    },
    {
      "id": 77,
      "start": 996.8599853515625,
      "end": 1001.2999877929688,
      "text": " in a wilderness today, friends, you know that's through a spiritual vacuum in this country."
    },
    {
      "id": 78,
      "start": 1001.2999877929688,
      "end": 1005.8599853515625,
      "text": " When God spreads a table before you in the wilderness, man, it's time to come and eat"
    },
    {
      "id": 79,
      "start": 1005.8599853515625,
      "end": 1012.3399658203125,
      "text": " and get everything you can get. And I'll tell you this, the worst preacher, people say,"
    },
    {
      "id": 80,
      "start": 1012.3399658203125,
      "end": 1015.4599609375,
      "text": " well, you know what? I've heard some pretty bad preachers. Well, you know what? I don't,"
    },
    {
      "id": 81,
      "start": 1015.4599609375,
      "end": 1019.4199829101562,
      "text": " I've never heard a bad preacher. If they're preaching the Word of God, they're preaching"
    },
    {
      "id": 82,
      "start": 1019.4199829101562,
      "end": 1023.97998046875,
      "text": " the old book, man. I don't care if they're dynamic. I don't care if they're charismatic."
    },
    {
      "id": 83,
      "start": 1023.97998046875,
      "end": 1028.6199645996094,
      "text": " I don't care if they've got this great personality. If they're preaching the Word of God, then"
    },
    {
      "id": 84,
      "start": 1028.6199645996094,
      "end": 1035.6199645996094,
      "text": " praise the Lord. Amen. Jonathan Edwards in his day, that old pilgrim, that old Reformed"
    },
    {
      "id": 85,
      "start": 1036.5399780273438,
      "end": 1041.3799743652344,
      "text": " theology guy, which I'm not a Reformed theology type, but that old pilgrim, Jonathan Edwards,"
    },
    {
      "id": 86,
      "start": 1041.3799743652344,
      "end": 1045.8599853515625,
      "text": " when he preached that great message, Sinners in the Hands of an Angry God, and it actually"
    },
    {
      "id": 87,
      "start": 1045.8599853515625,
      "end": 1050.4199829101562,
      "text": " triggered the first great awakening in America, you know what? He didn't preach like I'm preaching"
    },
    {
      "id": 88,
      "start": 1050.4199829101562,
      "end": 1057.4199829101562,
      "text": " right now. He read his messages. He wrote them out meticulously and he read them. And"
    },
    {
      "id": 89,
      "start": 1057.5399780273438,
      "end": 1062.0999755859375,
      "text": " I heard someone say that a lot of those guys back in those days used to read those things"
    },
    {
      "id": 90,
      "start": 1062.0999755859375,
      "end": 1069.0999755859375,
      "text": " in almost just a dull tone. Now, but the thing is, it was full of the Word of God. So the"
    },
    {
      "id": 91,
      "start": 1070.97998046875,
      "end": 1075.4999694824219,
      "text": " Word of God is powerful, sharper than any two-edged sword, able to divide and sunder"
    },
    {
      "id": 92,
      "start": 1075.4999694824219,
      "end": 1079.6999816894531,
      "text": " both bone and marrow. Let me tell you what, the Word of God is a powerful thing. So really"
    },
    {
      "id": 93,
      "start": 1079.6999816894531,
      "end": 1082.8199768066406,
      "text": " when it comes down, it's not all based upon the way the message is delivered, it's the"
    },
    {
      "id": 94,
      "start": 1082.8199768066406,
      "end": 1089.5799865722656,
      "text": " message itself and what it's based on. That should stimulate God's people. And they should"
    },
    {
      "id": 95,
      "start": 1089.5799865722656,
      "end": 1094.3799743652344,
      "text": " rejoice over it. You know, I mean, half-hearted Christians, they come to church in a half-hearted"
    },
    {
      "id": 96,
      "start": 1094.3799743652344,
      "end": 1099.8599853515625,
      "text": " manner and they're going to end up leaving the church with a half-hearted response. Well,"
    },
    {
      "id": 97,
      "start": 1099.8599853515625,
      "end": 1106.0999755859375,
      "text": " I think we should come to church excited. Don't you? Now, I'm not suggesting we come"
    },
    {
      "id": 98,
      "start": 1106.0999755859375,
      "end": 1110.3799743652344,
      "text": " into church like, you know, Bozo the Clown with a fake smile on her face and get Popeye"
    },
    {
      "id": 99,
      "start": 1110.4599609375,
      "end": 1113.97998046875,
      "text": " bug-eyed, foam in the mouth, roll down the aisles, bounce off the wall kind of happy."
    },
    {
      "id": 100,
      "start": 1113.97998046875,
      "end": 1118.4199829101562,
      "text": " I'm not talking about that. I'm talking about coming to church with a whole heart and being"
    },
    {
      "id": 101,
      "start": 1118.4199829101562,
      "end": 1122.5799560546875,
      "text": " ready to receive from God whatever it is He has for us. Amen? I'll tell you what, I want"
    },
    {
      "id": 102,
      "start": 1122.5799560546875,
      "end": 1127.4599609375,
      "text": " to be a whole-hearted Christian. I want to be all in. I want to be totally invested."
    },
    {
      "id": 103,
      "start": 1127.4599609375,
      "end": 1132.1399536132812,
      "text": " I want to be completely and totally absorbed with my Christian life."
    },
    {
      "id": 104,
      "start": 1132.1399536132812,
      "end": 1134.8999633789062,
      "text": " Let's go back to the book of Revelation. I'm going to move along quickly tonight, so stick"
    },
    {
      "id": 105,
      "start": 1134.8999633789062,
      "end": 1139.0599975585938,
      "text": " with me if you will please. Try not to go too off-long this evening, but I do want to"
    },
    {
      "id": 106,
      "start": 1139.0599975585938,
      "end": 1144.0999755859375,
      "text": " share this. I want to go to Revelation chapter 3. Is everybody with me? Revelation chapter"
    },
    {
      "id": 107,
      "start": 1144.0999755859375,
      "end": 1150.219970703125,
      "text": " 3 and verse 4. Now, I could actually go through all seven churches of Asia. And of course"
    },
    {
      "id": 108,
      "start": 1150.219970703125,
      "end": 1156.739990234375,
      "text": " this was Asia Minor where these churches were located in what's now known today as Turkey."
    },
    {
      "id": 109,
      "start": 1156.739990234375,
      "end": 1161.2999877929688,
      "text": " And of course Laodicea was the last of the seven churches. And of course we know if you"
    },
    {
      "id": 110,
      "start": 1161.2999877929688,
      "end": 1167.2999877929688,
      "text": " even look at it geographically the churches were organized in somewhat of a circle. And"
    },
    {
      "id": 111,
      "start": 1167.2999877929688,
      "end": 1171.2999877929688,
      "text": " the Bible says that the Lord Jesus at one point was standing in the midst of the seven"
    },
    {
      "id": 112,
      "start": 1171.2999877929688,
      "end": 1175.1799926757812,
      "text": " churches, the seven golden candlesticks. We'll talk about that in a little bit in a minute."
    },
    {
      "id": 113,
      "start": 1175.1799926757812,
      "end": 1179.6599731445312,
      "text": " But I want you to look at Revelation chapter 3 and verse 14. And we look at the church"
    },
    {
      "id": 114,
      "start": 1179.6599731445312,
      "end": 1183.6199951171875,
      "text": " of Laodicea and I'm going to read down through this very quickly and then make some comments"
    },
    {
      "id": 115,
      "start": 1183.6199951171875,
      "end": 1188.219970703125,
      "text": " along the way. By the way, Laodicea was an interesting place. I did a little bit of study"
    },
    {
      "id": 116,
      "start": 1188.219970703125,
      "end": 1194.6599731445312,
      "text": " on the city of Laodicea and it was an interesting city. It was built by Antiochus II and he"
    },
    {
      "id": 117,
      "start": 1194.739990234375,
      "end": 1200.0999755859375,
      "text": " named it after his wife, interesting name, her name was Laodice. And he named it after"
    },
    {
      "id": 118,
      "start": 1200.0999755859375,
      "end": 1200.0999755859375,
      "text": ""
    },
    {
      "id": 0,
      "start": 1200.0999755859375,
      "end": 1205.659975528717,
      "text": " It was located on the River Ulysses and it's still located there obviously today in what"
    },
    {
      "id": 1,
      "start": 1205.659975528717,
      "end": 1206.659975528717,
      "text": " is now today Turkey."
    },
    {
      "id": 2,
      "start": 1206.659975528717,
      "end": 1208.3799753189087,
      "text": " I wrote this down so I didn't forget it."
    },
    {
      "id": 3,
      "start": 1208.3799753189087,
      "end": 1212.4199752807617,
      "text": " It was rich in Greek culture, it was the center of business, the center of science, the center"
    },
    {
      "id": 4,
      "start": 1212.4199752807617,
      "end": 1215.7399759292603,
      "text": " of millinery, and the center of medicine."
    },
    {
      "id": 5,
      "start": 1215.7399759292603,
      "end": 1216.739974975586,
      "text": " And it had a great reputation."
    },
    {
      "id": 6,
      "start": 1216.739974975586,
      "end": 1217.979974746704,
      "text": " It was a wealthy city."
    },
    {
      "id": 7,
      "start": 1217.979974746704,
      "end": 1220.3399753570557,
      "text": " It was a wealthy place."
    },
    {
      "id": 8,
      "start": 1220.3399753570557,
      "end": 1223.899974822998,
      "text": " And by the way, there's evidence that there were, besides the church at Laodicea, there's"
    },
    {
      "id": 9,
      "start": 1223.899974822998,
      "end": 1225.899974822998,
      "text": " evidence there was one other there as well."
    },
    {
      "id": 10,
      "start": 1226.299976348877,
      "end": 1230.0999755859375,
      "text": " If you go there today, you can see the ruins of both churches."
    },
    {
      "id": 11,
      "start": 1230.0999755859375,
      "end": 1234.6999740600586,
      "text": " Those churches don't exist today, but you can see the ruins of both churches."
    },
    {
      "id": 12,
      "start": 1234.6999740600586,
      "end": 1241.4999771118164,
      "text": " And so this church at Laodicea was a very wealthy, very prosperous church at one time."
    },
    {
      "id": 13,
      "start": 1241.4999771118164,
      "end": 1242.4999771118164,
      "text": " But look at this."
    },
    {
      "id": 14,
      "start": 1242.4999771118164,
      "end": 1246.0999755859375,
      "text": " In Revelation chapter 3 and verse 14, I begin reading here."
    },
    {
      "id": 15,
      "start": 1246.0999755859375,
      "end": 1250.1399765014648,
      "text": " And under the angel Angelos, this was the pastor of the church, that's what it's speaking"
    },
    {
      "id": 16,
      "start": 1250.1399765014648,
      "end": 1253.7799758911133,
      "text": " of, of the Laodiceans' rite."
    },
    {
      "id": 17,
      "start": 1253.7799758911133,
      "end": 1254.7799758911133,
      "text": " These things saith the Amen."
    },
    {
      "id": 18,
      "start": 1254.8599739074707,
      "end": 1257.8599739074707,
      "text": " Now, of course, we know the Amen is Jesus."
    },
    {
      "id": 19,
      "start": 1257.8599739074707,
      "end": 1258.8599739074707,
      "text": " Amen?"
    },
    {
      "id": 20,
      "start": 1258.8599739074707,
      "end": 1264.1399765014648,
      "text": " These things saith the Amen, the faithful and true witness, the beginning of the creation"
    },
    {
      "id": 21,
      "start": 1264.1399765014648,
      "end": 1265.1399765014648,
      "text": " of God."
    },
    {
      "id": 22,
      "start": 1265.1399765014648,
      "end": 1266.1399765014648,
      "text": " Now, look at verse 15."
    },
    {
      "id": 23,
      "start": 1266.1399765014648,
      "end": 1267.1399765014648,
      "text": " He says this."
    },
    {
      "id": 24,
      "start": 1267.1399765014648,
      "end": 1268.739974975586,
      "text": " He said, I know thy works."
    },
    {
      "id": 25,
      "start": 1268.739974975586,
      "end": 1269.739974975586,
      "text": " I know thy works."
    },
    {
      "id": 26,
      "start": 1269.739974975586,
      "end": 1273.859977722168,
      "text": " Now, that ought to either bring consolation or conviction."
    },
    {
      "id": 27,
      "start": 1273.859977722168,
      "end": 1274.859977722168,
      "text": " I know thy works."
    },
    {
      "id": 28,
      "start": 1274.859977722168,
      "end": 1277.9399719238281,
      "text": " Now, I'm going to say this."
    },
    {
      "id": 29,
      "start": 1277.9399719238281,
      "end": 1282.619972229004,
      "text": " As I get into this text here, it's not a very long text, but as I get into it and share"
    },
    {
      "id": 30,
      "start": 1282.619972229004,
      "end": 1285.339973449707,
      "text": " some things along the way, I want you to know this tonight."
    },
    {
      "id": 31,
      "start": 1285.339973449707,
      "end": 1288.579978942871,
      "text": " God knows our works."
    },
    {
      "id": 32,
      "start": 1288.579978942871,
      "end": 1290.6999740600586,
      "text": " He knows what we're doing and why we're doing it."
    },
    {
      "id": 33,
      "start": 1290.6999740600586,
      "end": 1295.6599731445312,
      "text": " What motivates us, what causes us to do what we do, why we do what we do."
    },
    {
      "id": 34,
      "start": 1295.6599731445312,
      "end": 1296.859977722168,
      "text": " I ask people this all the time."
    },
    {
      "id": 35,
      "start": 1296.859977722168,
      "end": 1302.0999755859375,
      "text": " Why do you do what you do?"
    },
    {
      "id": 36,
      "start": 1302.0999755859375,
      "end": 1308.0999755859375,
      "text": " I've seen people sing in the choir, for example, and I'll ask them sometimes, I mean, I just"
    },
    {
      "id": 37,
      "start": 1308.0999755859375,
      "end": 1309.0999755859375,
      "text": " do this."
    },
    {
      "id": 38,
      "start": 1309.0999755859375,
      "end": 1310.2999725341797,
      "text": " I kind of probe once in a while."
    },
    {
      "id": 39,
      "start": 1310.2999725341797,
      "end": 1312.579978942871,
      "text": " I kind of have a tendency to meddle a little bit."
    },
    {
      "id": 40,
      "start": 1312.579978942871,
      "end": 1316.4199752807617,
      "text": " And sometimes when I suspect something's not quite right with somebody that's in the choir"
    },
    {
      "id": 41,
      "start": 1316.4199752807617,
      "end": 1322.2599792480469,
      "text": " or any other area of ministry, I might ask them, why are you in the choir?"
    },
    {
      "id": 42,
      "start": 1322.2599792480469,
      "end": 1324.1399765014648,
      "text": " Why do you want to sing in the choir?"
    },
    {
      "id": 43,
      "start": 1324.1399765014648,
      "end": 1325.1399765014648,
      "text": " Amen."
    },
    {
      "id": 44,
      "start": 1325.1399765014648,
      "end": 1328.9399719238281,
      "text": " Well, that's a good answer right there."
    },
    {
      "id": 45,
      "start": 1328.9399719238281,
      "end": 1331.9399719238281,
      "text": " Why do you want to be part of the music program in the church?"
    },
    {
      "id": 46,
      "start": 1331.9399719238281,
      "end": 1332.9399719238281,
      "text": " You know?"
    },
    {
      "id": 47,
      "start": 1332.9399719238281,
      "end": 1335.0599822998047,
      "text": " Well, they give a lot of different answers."
    },
    {
      "id": 48,
      "start": 1335.0599822998047,
      "end": 1339.3999786376953,
      "text": " And just like he just got done saying, our brother said, because I love singing, amen."
    },
    {
      "id": 49,
      "start": 1339.4999694824219,
      "end": 1343.239974975586,
      "text": " And he loves singing because he loves Jesus."
    },
    {
      "id": 50,
      "start": 1343.239974975586,
      "end": 1344.5199737548828,
      "text": " It should be for him."
    },
    {
      "id": 51,
      "start": 1344.5199737548828,
      "end": 1349.0399780273438,
      "text": " I think that people should do what they do with a whole heart."
    },
    {
      "id": 52,
      "start": 1349.0399780273438,
      "end": 1351.0399780273438,
      "text": " Not half-hearted, just going through the motions."
    },
    {
      "id": 53,
      "start": 1351.0399780273438,
      "end": 1352.0399780273438,
      "text": " Okay."
    },
    {
      "id": 54,
      "start": 1352.0399780273438,
      "end": 1356.0799713134766,
      "text": " Pastor says, brother, can you help me with something this week?"
    },
    {
      "id": 55,
      "start": 1356.0799713134766,
      "end": 1357.959976196289,
      "text": " In fact, would you drive a Sunday school bus for me?"
    },
    {
      "id": 56,
      "start": 1357.959976196289,
      "end": 1361.9999694824219,
      "text": " Because I know you have a class B license and we need a driver this week."
    },
    {
      "id": 57,
      "start": 1361.9999694824219,
      "end": 1362.9999694824219,
      "text": " Okay."
    },
    {
      "id": 58,
      "start": 1362.9999694824219,
      "end": 1366.5199737548828,
      "text": " I really don't like to drive buses anymore."
    },
    {
      "id": 59,
      "start": 1366.5199737548828,
      "end": 1367.9999694824219,
      "text": " I kind of gave that up."
    },
    {
      "id": 60,
      "start": 1367.9999694824219,
      "end": 1368.9999694824219,
      "text": " Okay."
    },
    {
      "id": 61,
      "start": 1369.5999755859375,
      "end": 1370.5999755859375,
      "text": " And why do they complain and moan about it?"
    },
    {
      "id": 62,
      "start": 1370.5999755859375,
      "end": 1371.5999755859375,
      "text": " Well, why?"
    },
    {
      "id": 63,
      "start": 1371.5999755859375,
      "end": 1372.5999755859375,
      "text": " Because they're half-hearted."
    },
    {
      "id": 64,
      "start": 1372.5999755859375,
      "end": 1376.5199737548828,
      "text": " When they say, hey, pastor, great."
    },
    {
      "id": 65,
      "start": 1376.5199737548828,
      "end": 1378.9199829101562,
      "text": " I'll be glad to do that."
    },
    {
      "id": 66,
      "start": 1378.9199829101562,
      "end": 1379.9199829101562,
      "text": " I'll be glad to do it."
    },
    {
      "id": 67,
      "start": 1379.9199829101562,
      "end": 1381.47998046875,
      "text": " Oh, would you sing this?"
    },
    {
      "id": 68,
      "start": 1381.47998046875,
      "end": 1382.8399810791016,
      "text": " You have people in the church that can sing."
    },
    {
      "id": 69,
      "start": 1382.8399810791016,
      "end": 1385.3999786376953,
      "text": " We just heard some great singing tonight, amen?"
    },
    {
      "id": 70,
      "start": 1385.3999786376953,
      "end": 1389.3999786376953,
      "text": " And so you say, now, brothers, would you sing a special this Sunday?"
    },
    {
      "id": 71,
      "start": 1389.3999786376953,
      "end": 1391.5999755859375,
      "text": " No, if I have to."
    },
    {
      "id": 72,
      "start": 1391.5999755859375,
      "end": 1394.7599792480469,
      "text": " Well, that's really half-hearted, isn't it?"
    },
    {
      "id": 73,
      "start": 1394.7599792480469,
      "end": 1398.5199737548828,
      "text": " It's really what it is."
    },
    {
      "id": 74,
      "start": 1398.5199737548828,
      "end": 1402.0399780273438,
      "text": " And that's not the way that we should respond."
    },
    {
      "id": 75,
      "start": 1402.0399780273438,
      "end": 1405.9199829101562,
      "text": " When God asks us to do something, we should be in all in and we should do it with a whole"
    },
    {
      "id": 76,
      "start": 1405.9199829101562,
      "end": 1406.9199829101562,
      "text": " heart."
    },
    {
      "id": 77,
      "start": 1406.9199829101562,
      "end": 1412.4399719238281,
      "text": " I want to serve God with a whole heart, don't you?"
    },
    {
      "id": 78,
      "start": 1412.4399719238281,
      "end": 1414.959976196289,
      "text": " What he couldn't do this week, I couldn't do what I'm doing."
    },
    {
      "id": 79,
      "start": 1414.959976196289,
      "end": 1417.3999786376953,
      "text": " Whatever it is God's called you to do, you couldn't do it if you weren't doing it with"
    },
    {
      "id": 80,
      "start": 1417.3999786376953,
      "end": 1419.1599731445312,
      "text": " a whole heart."
    },
    {
      "id": 81,
      "start": 1419.1599731445312,
      "end": 1421.239974975586,
      "text": " Your heart would not be in it."
    },
    {
      "id": 82,
      "start": 1421.239974975586,
      "end": 1422.5199737548828,
      "text": " You've heard that said many times."
    },
    {
      "id": 83,
      "start": 1422.5199737548828,
      "end": 1424.5199737548828,
      "text": " Well, my heart's not in it."
    },
    {
      "id": 84,
      "start": 1424.5199737548828,
      "end": 1427.5199737548828,
      "text": " Well, how come?"
    },
    {
      "id": 85,
      "start": 1427.5199737548828,
      "end": 1431.4399719238281,
      "text": " You know, I had a fellow tell me one time, well, I think I'm going to retire from the"
    },
    {
      "id": 86,
      "start": 1431.4399719238281,
      "end": 1432.4399719238281,
      "text": " ministry."
    },
    {
      "id": 87,
      "start": 1432.4399719238281,
      "end": 1434.3599700927734,
      "text": " Oh, I said, is that right?"
    },
    {
      "id": 88,
      "start": 1434.3599700927734,
      "end": 1435.3599700927734,
      "text": " He said, yeah."
    },
    {
      "id": 89,
      "start": 1435.3599700927734,
      "end": 1437.1599731445312,
      "text": " I said, well, man, you're only 55 years old."
    },
    {
      "id": 90,
      "start": 1437.1599731445312,
      "end": 1438.8799743652344,
      "text": " Why are you going to retire from the ministry?"
    },
    {
      "id": 91,
      "start": 1438.8799743652344,
      "end": 1443.1599731445312,
      "text": " Well, he said, my heart's not just in it anymore."
    },
    {
      "id": 92,
      "start": 1443.1599731445312,
      "end": 1445.3599700927734,
      "text": " And I thought, now, hold on a minute."
    },
    {
      "id": 93,
      "start": 1445.3599700927734,
      "end": 1448.4399719238281,
      "text": " Did God call you to the preaching ministry?"
    },
    {
      "id": 94,
      "start": 1448.4399719238281,
      "end": 1452.239974975586,
      "text": " Did God give you the gift of pastor, evangelist, teacher?"
    },
    {
      "id": 95,
      "start": 1452.239974975586,
      "end": 1454.47998046875,
      "text": " Did God give you that gift?"
    },
    {
      "id": 96,
      "start": 1454.47998046875,
      "end": 1457.3999633789062,
      "text": " The gifts and the calling of God are without repentance."
    },
    {
      "id": 97,
      "start": 1458.2799682617188,
      "end": 1460.7599792480469,
      "text": " Well, God didn't change his mind, but obviously you have."
    },
    {
      "id": 98,
      "start": 1460.7599792480469,
      "end": 1463.9199829101562,
      "text": " And now you're telling me your heart's no longer in it."
    },
    {
      "id": 99,
      "start": 1463.9199829101562,
      "end": 1468.1799621582031,
      "text": " I'm going to tell you what, that's not a good answer."
    },
    {
      "id": 100,
      "start": 1468.1799621582031,
      "end": 1470.8799743652344,
      "text": " Was your heart in it when you started preaching 25 years ago?"
    },
    {
      "id": 101,
      "start": 1470.8799743652344,
      "end": 1473.8799743652344,
      "text": " Well, yeah, back then it seems like my heart was in it."
    },
    {
      "id": 102,
      "start": 1473.8799743652344,
      "end": 1476.3599853515625,
      "text": " And I said, okay, well, then how come it's not in it today?"
    },
    {
      "id": 103,
      "start": 1476.3599853515625,
      "end": 1478.3199768066406,
      "text": " I mean, you're 55 years old."
    },
    {
      "id": 104,
      "start": 1478.3199768066406,
      "end": 1480.0799865722656,
      "text": " You got some good years left in you."
    },
    {
      "id": 105,
      "start": 1480.0799865722656,
      "end": 1481.719970703125,
      "text": " You ought to keep on preaching."
    },
    {
      "id": 106,
      "start": 1481.719970703125,
      "end": 1482.719970703125,
      "text": " Amen."
    },
    {
      "id": 107,
      "start": 1482.719970703125,
      "end": 1486.4399719238281,
      "text": " Now, if he doesn't want to preach and he doesn't have the heart to preach for whatever reason,"
    },
    {
      "id": 108,
      "start": 1486.47998046875,
      "end": 1491.3999633789062,
      "text": " and I think there's something wrong with that, then maybe you ought to go get a job."
    },
    {
      "id": 109,
      "start": 1491.3999633789062,
      "end": 1494.3999633789062,
      "text": " Because he'll cause damage."
    },
    {
      "id": 110,
      "start": 1494.3999633789062,
      "end": 1499.1199645996094,
      "text": " So this thing of being half-hearted, or really having like, this guy, I have no heart at"
    },
    {
      "id": 111,
      "start": 1499.1199645996094,
      "end": 1500.1199645996094,
      "text": " all in this thing."
    },
    {
      "id": 112,
      "start": 1500.1199645996094,
      "end": 1503.5999755859375,
      "text": " I mean, that's just a dangerous proposition."
    },
    {
      "id": 113,
      "start": 1503.5999755859375,
      "end": 1507.5199890136719,
      "text": " So it says, under the angel of the church that led us to your right, these things said,"
    },
    {
      "id": 114,
      "start": 1507.5199890136719,
      "end": 1511.1199645996094,
      "text": " the amen, the faith, and the true witness, the beginning of the creation of God, he said,"
    },
    {
      "id": 115,
      "start": 1511.1199645996094,
      "end": 1516.8799743652344,
      "text": " I know thy works, that thou art neither cold nor hot."
    },
    {
      "id": 116,
      "start": 1516.8799743652344,
      "end": 1522.7599792480469,
      "text": " I would thou were cold or hot, so then because thou art lukewarm, uh-oh, thou, I want you"
    },
    {
      "id": 117,
      "start": 1522.7599792480469,
      "end": 1525.3199768066406,
      "text": " to see that word, lukewarm."
    },
    {
      "id": 118,
      "start": 1525.3199768066406,
      "end": 1527.8399658203125,
      "text": " That's an interesting word, isn't it?"
    },
    {
      "id": 119,
      "start": 1527.8399658203125,
      "end": 1534.7599792480469,
      "text": " That word, lukewarm, comes from the Greek word, ameo, ameo."
    },
    {
      "id": 120,
      "start": 1534.7599792480469,
      "end": 1539.6399841308594,
      "text": " So what it means is this, the word lukewarm in the Greek, the word ameo means this, and"
    },
    {
      "id": 121,
      "start": 1539.6399841308594,
      "end": 1543.3999633789062,
      "text": " by the way, it can also mean from, it also can come from this word, kleoros, and it"
    },
    {
      "id": 122,
      "start": 1543.3999633789062,
      "end": 1547.6799621582031,
      "text": " means half-hearted, tepid, or fluctuating, no zeal, lost appetite."
    },
    {
      "id": 123,
      "start": 1547.6799621582031,
      "end": 1551.719970703125,
      "text": " He says, he said this, he said, I know thy works, that thou art neither cold nor hot."
    },
    {
      "id": 124,
      "start": 1551.719970703125,
      "end": 1555.47998046875,
      "text": " I would that thou were cold or hot, so because thou art lukewarm and neither cold nor hot,"
    },
    {
      "id": 125,
      "start": 1555.47998046875,
      "end": 1559.3999633789062,
      "text": " I will spew thee out of my mouth."
    },
    {
      "id": 126,
      "start": 1559.3999633789062,
      "end": 1564.719970703125,
      "text": " It's like, it's like in a medic, he said, listen, because you're lukewarm and you're"
    },
    {
      "id": 127,
      "start": 1564.719970703125,
      "end": 1568.0399780273438,
      "text": " not on fire, I'd rather have you, I'd rather have a cold or hot."
    },
    {
      "id": 128,
      "start": 1568.0399780273438,
      "end": 1572.8799743652344,
      "text": " Because you're lukewarm, I'll spew you out of my mouth, it makes me sick."
    },
    {
      "id": 129,
      "start": 1572.8799743652344,
      "end": 1574.6999816894531,
      "text": " Lukewarm Christianity."
    },
    {
      "id": 130,
      "start": 1574.6999816894531,
      "end": 1582.1999816894531,
      "text": " So kleoros, that's a Greek word, means half-hearted, tepid, fluctuating, no zeal, lost appetite."
    },
    {
      "id": 131,
      "start": 1582.1999816894531,
      "end": 1587.6399841308594,
      "text": " To lose one's appetite for things of God really, to me, is a disaster."
    },
    {
      "id": 132,
      "start": 1587.6399841308594,
      "end": 1588.6399841308594,
      "text": " It really is."
    },
    {
      "id": 133,
      "start": 1588.6399841308594,
      "end": 1592.4999694824219,
      "text": " So he said, so then because thou art lukewarm and neither cold nor hot, I will spew thee"
    },
    {
      "id": 134,
      "start": 1592.4999694824219,
      "end": 1594.0399780273438,
      "text": " out of my mouth."
    },
    {
      "id": 135,
      "start": 1594.0399780273438,
      "end": 1599.7599792480469,
      "text": " So lukewarm, kleoros, and spew, along with the word lukewarm, also, it comes from a Greek"
    },
    {
      "id": 136,
      "start": 1599.7599792480469,
      "end": 1603.0399780273438,
      "text": " word, it just makes me sick, he said."
    },
    {
      "id": 137,
      "start": 1603.0399780273438,
      "end": 1605.9999694824219,
      "text": " Because thou sayest I am rich and increased with goods, and have need of nothing, and"
    },
    {
      "id": 138,
      "start": 1605.9999694824219,
      "end": 1610.1599731445312,
      "text": " knowest not that thou art wretched and miserable and poor and blind and naked."
    },
    {
      "id": 139,
      "start": 1610.1599731445312,
      "end": 1612.239990234375,
      "text": " He said, Dave, we don't need anything, man."
    },
    {
      "id": 140,
      "start": 1612.239990234375,
      "end": 1615.6799621582031,
      "text": " We got this thing down pat, we know how to do ministry, we don't need you in it either."
    },
    {
      "id": 141,
      "start": 1615.6799621582031,
      "end": 1621.719970703125,
      "text": " He said, no, you're poor, you're blind, you're wretched, you're naked."
    },
    {
      "id": 142,
      "start": 1621.719970703125,
      "end": 1626.5199890136719,
      "text": " He said, I counsel you to buy me gold, trident and fire, that thou mayest be rich, and white"
    },
    {
      "id": 143,
      "start": 1626.5199890136719,
      "end": 1630.0399780273438,
      "text": " raiment that thou mayest be clothed, that the shame of thy nakedness do not appear,"
    },
    {
      "id": 144,
      "start": 1630.0399780273438,
      "end": 1632.9199829101562,
      "text": " to anoint thine eyes with eye salve that thou mayest see."
    },
    {
      "id": 145,
      "start": 1632.9199829101562,
      "end": 1638.5199890136719,
      "text": " I think that's interesting because the city of Laodicea was known for its eye salve."
    },
    {
      "id": 146,
      "start": 1638.5199890136719,
      "end": 1642.1799621582031,
      "text": " It was famous for its school of medicine."
    },
    {
      "id": 147,
      "start": 1642.1799621582031,
      "end": 1644.5599670410156,
      "text": " And so he uses that as an illustration."
    },
    {
      "id": 148,
      "start": 1644.5599670410156,
      "end": 1649.4399719238281,
      "text": " But the eye salve they needed was not the eye salve that came from the apothecary, it"
    },
    {
      "id": 149,
      "start": 1649.4399719238281,
      "end": 1650.7599792480469,
      "text": " was the eye salve of the Word of God."
    },
    {
      "id": 150,
      "start": 1650.7599792480469,
      "end": 1654.3199768066406,
      "text": " You people need to get your focus back where it belongs."
    },
    {
      "id": 151,
      "start": 1654.3199768066406,
      "end": 1658.1199645996094,
      "text": " You got an eyesight problem, you need to get your eyes back on Jesus."
    },
    {
      "id": 152,
      "start": 1658.1199645996094,
      "end": 1661.4399719238281,
      "text": " Get your eyes off Jesus and you're going to have a problem with half-heartedness."
    },
    {
      "id": 153,
      "start": 1661.4399719238281,
      "end": 1667.47998046875,
      "text": " So I counsel you to buy me gold, trident and fire, that thou mayest be rich, and white"
    },
    {
      "id": 154,
      "start": 1667.47998046875,
      "end": 1671.0399780273438,
      "text": " raiment that thou mayest be clothed, and that the shame of thy nakedness do not appear,"
    },
    {
      "id": 155,
      "start": 1671.0399780273438,
      "end": 1674.1599731445312,
      "text": " to anoint thine eyes with eye salve that thou mayest see."
    },
    {
      "id": 156,
      "start": 1674.1599731445312,
      "end": 1677.7799682617188,
      "text": " He said, as many as I love, I rebuke and chasten."
    },
    {
      "id": 157,
      "start": 1677.7799682617188,
      "end": 1679.1199645996094,
      "text": " Be zealous therefore and repent."
    },
    {
      "id": 158,
      "start": 1679.1199645996094,
      "end": 1681.5599670410156,
      "text": " And I like that word zealous."
    },
    {
      "id": 159,
      "start": 1681.5599670410156,
      "end": 1682.5599670410156,
      "text": " That's a good word."
    },
    {
      "id": 160,
      "start": 1682.5599670410156,
      "end": 1683.5599670410156,
      "text": " Amen."
    },
    {
      "id": 161,
      "start": 1683.5599670410156,
      "end": 1684.5599670410156,
      "text": " That's a good Bible word."
    },
    {
      "id": 162,
      "start": 1684.5599670410156,
      "end": 1690.4399719238281,
      "text": " And by the way, we see over in Titus chapter 2 where the Bible says that we who are saved"
    },
    {
      "id": 163,
      "start": 1690.4399719238281,
      "end": 1692.9999694824219,
      "text": " by the grace of God ought to be zealous of good works."
    },
    {
      "id": 164,
      "start": 1692.9999694824219,
      "end": 1697.0399780273438,
      "text": " We ought to be zealous."
    },
    {
      "id": 165,
      "start": 1697.0399780273438,
      "end": 1700.7599792480469,
      "text": " We ought to be excited about this thing of serving God."
    },
    {
      "id": 166,
      "start": 1700.7599792480469,
      "end": 1705.1199645996094,
      "text": " I don't know about you, but I'm excited about being here in church tonight."
    },
    {
      "id": 167,
      "start": 1705.1199645996094,
      "end": 1707.8799743652344,
      "text": " I've already enjoyed myself."
    },
    {
      "id": 168,
      "start": 1707.8799743652344,
      "end": 1708.8799743652344,
      "text": " I really have."
    },
    {
      "id": 169,
      "start": 1709.6399841308594,
      "end": 1713.239990234375,
      "text": " I can go, hey, I'll tell you what, when you come to church meetings like this, whether"
    },
    {
      "id": 170,
      "start": 1713.239990234375,
      "end": 1716.8399658203125,
      "text": " it be Sunday school or Sunday morning service, Sunday evening service, or special meetings"
    },
    {
      "id": 171,
      "start": 1716.8399658203125,
      "end": 1720.1199951171875,
      "text": " like we're having this week, boy, that ought to be, that ought to be a blessing."
    },
    {
      "id": 172,
      "start": 1720.1199951171875,
      "end": 1721.1199951171875,
      "text": " That ought to be a joy."
    },
    {
      "id": 173,
      "start": 1721.1199951171875,
      "end": 1723.3199462890625,
      "text": " That ought to send you out of here with a little bit of a bounce in your step."
    },
    {
      "id": 174,
      "start": 1723.3199462890625,
      "end": 1726.5599975585938,
      "text": " Boy, I got to be with God's people tonight."
    },
    {
      "id": 175,
      "start": 1726.5599975585938,
      "end": 1729.3599853515625,
      "text": " I got to be in church tonight."
    },
    {
      "id": 176,
      "start": 1729.3599853515625,
      "end": 1732.0,
      "text": " You know, it ought to promote zeal."
    },
    {
      "id": 177,
      "start": 1732.0,
      "end": 1733.0,
      "text": " I've said this all the time."
    },
    {
      "id": 178,
      "start": 1733.0,
      "end": 1735.7599487304688,
      "text": " I said, man, we just need some people to get on fire for God."
    },
    {
      "id": 179,
      "start": 1735.7599487304688,
      "end": 1740.719970703125,
      "text": " Man, if people get on fire for God and start serving the Lord all out, we could see a lot"
    },
    {
      "id": 180,
      "start": 1740.719970703125,
      "end": 1744.9599609375,
      "text": " of things happen in our churches today."
    },
    {
      "id": 181,
      "start": 1744.9599609375,
      "end": 1747.8399658203125,
      "text": " We had a program years ago, I can remember it started with Sword of the Lord."
    },
    {
      "id": 182,
      "start": 1747.8399658203125,
      "end": 1751.3599853515625,
      "text": " I don't remember who started it, but they had a program called Win One, Disciple One"
    },
    {
      "id": 183,
      "start": 1751.3599853515625,
      "end": 1752.3599853515625,
      "text": " every year."
    },
    {
      "id": 184,
      "start": 1752.3599853515625,
      "end": 1756.47998046875,
      "text": " So if you would win one person, disciple that person every year, one a year, the church"
    },
    {
      "id": 185,
      "start": 1756.47998046875,
      "end": 1759.2799682617188,
      "text": " would double its size within one year."
    },
    {
      "id": 186,
      "start": 1759.2799682617188,
      "end": 1762.199951171875,
      "text": " If people had a zeal for souls."
    },
    {
      "id": 187,
      "start": 1762.199951171875,
      "end": 1764.6399536132812,
      "text": " If people had a zeal for winning people to Christ."
    },
    {
      "id": 188,
      "start": 1765.3999633789062,
      "end": 1767.3199462890625,
      "text": " They'd be zealous of good works."
    },
    {
      "id": 189,
      "start": 1767.3199462890625,
      "end": 1768.3199462890625,
      "text": " Amen?"
    },
    {
      "id": 190,
      "start": 1768.3199462890625,
      "end": 1771.47998046875,
      "text": " I think that's a, it's just a joy to be zealous."
    },
    {
      "id": 191,
      "start": 1771.47998046875,
      "end": 1774.5999755859375,
      "text": " I mean, think about the opposite."
    },
    {
      "id": 192,
      "start": 1774.5999755859375,
      "end": 1780.6799926757812,
      "text": " You know, being, you know, kind of dead, you know."
    },
    {
      "id": 193,
      "start": 1780.6799926757812,
      "end": 1786.9199829101562,
      "text": " Several years ago, there was a pastor who began to realize that his church was just"
    },
    {
      "id": 194,
      "start": 1786.9199829101562,
      "end": 1789.3199462890625,
      "text": " kind of spiritually sagging."
    },
    {
      "id": 195,
      "start": 1789.3199462890625,
      "end": 1791.8399658203125,
      "text": " It was in really bad shape."
    },
    {
      "id": 196,
      "start": 1791.8399658203125,
      "end": 1795.199951171875,
      "text": " And he knew they needed a revival."
    },
    {
      "id": 197,
      "start": 1795.199951171875,
      "end": 1799.3199462890625,
      "text": " And he had preached his heart out and he wasn't altogether sure exactly what it was going"
    },
    {
      "id": 198,
      "start": 1799.3199462890625,
      "end": 1800.1599731445312,
      "text": " to take to get there."
    },
    {
      "id": 0,
      "start": 1800.1599731445312,
      "end": 1803.859973192215,
      "text": " attention. So one Sunday morning he came into church and in his"
    },
    {
      "id": 1,
      "start": 1803.899973154068,
      "end": 1806.5599732398987,
      "text": " morning message he said, oh, by the way I want to announce"
    },
    {
      "id": 2,
      "start": 1806.5999732017517,
      "end": 1810.3999729156494,
      "text": " we're going to have a funeral tonight. And everybody thought"
    },
    {
      "id": 3,
      "start": 1810.4399728775024,
      "end": 1812.6999731063843,
      "text": " a funeral tonight? Yeah, the evening service we have a"
    },
    {
      "id": 4,
      "start": 1812.7399730682373,
      "end": 1816.0399732589722,
      "text": " funeral tonight so everybody will be here. And so everybody"
    },
    {
      "id": 5,
      "start": 1816.0799732208252,
      "end": 1818.6399726867676,
      "text": " left the church wondering who was the dead person? Who was"
    },
    {
      "id": 6,
      "start": 1818.679973602295,
      "end": 1822.119972229004,
      "text": " the funeral? Who were they going to have a funeral for? So"
    },
    {
      "id": 7,
      "start": 1822.1399726867676,
      "end": 1826.7799739837646,
      "text": " word got out all over town and no one knew who the deceased"
    },
    {
      "id": 8,
      "start": 1826.8199729919434,
      "end": 1830.0599727630615,
      "text": " individual was and so they decided that we better come and"
    },
    {
      "id": 9,
      "start": 1830.0599727630615,
      "end": 1834.619972229004,
      "text": " see who it is. So the whole town showed up. It was standing"
    },
    {
      "id": 10,
      "start": 1834.6599731445312,
      "end": 1838.5599746704102,
      "text": " room only in the church house. So when they came in the church"
    },
    {
      "id": 11,
      "start": 1838.5999717712402,
      "end": 1844.6399726867676,
      "text": " house there was a casket down here. Amen? Some of you may"
    },
    {
      "id": 12,
      "start": 1844.679973602295,
      "end": 1848.9399719238281,
      "text": " already get this one. There's a casket down here. But the thing"
    },
    {
      "id": 13,
      "start": 1848.9799728393555,
      "end": 1851.8799743652344,
      "text": " that was amazing about it is that the lid of the casket it"
    },
    {
      "id": 14,
      "start": 1851.9199714660645,
      "end": 1854.739974975586,
      "text": " was turned around backwards so you were looking at the lid of"
    },
    {
      "id": 15,
      "start": 1854.779972076416,
      "end": 1857.8599739074707,
      "text": " the casket which was open. Ordinarily it would be the other"
    },
    {
      "id": 16,
      "start": 1857.8799743652344,
      "end": 1861.119972229004,
      "text": " way around so that when you filed past the casket you would"
    },
    {
      "id": 17,
      "start": 1861.1599731445312,
      "end": 1865.459976196289,
      "text": " see the deceased. But he turned it around and so the casket"
    },
    {
      "id": 18,
      "start": 1865.4999694824219,
      "end": 1869.2599716186523,
      "text": " sitting in the middle of the aisle just like this and the"
    },
    {
      "id": 19,
      "start": 1869.2999725341797,
      "end": 1872.5999755859375,
      "text": " lid is up, the top is up on it and he said, now that"
    },
    {
      "id": 20,
      "start": 1872.6399765014648,
      "end": 1875.8999710083008,
      "text": " everybody is here? He said, I want you all to come and just"
    },
    {
      "id": 21,
      "start": 1875.9399719238281,
      "end": 1880.2799758911133,
      "text": " file past the casket and view the deceased. And so they all"
    },
    {
      "id": 22,
      "start": 1880.2999725341797,
      "end": 1882.5399703979492,
      "text": " got up and they said, wow we're going to find out who this is"
    },
    {
      "id": 23,
      "start": 1882.5799713134766,
      "end": 1886.2799758911133,
      "text": " now. And as they filed past the casket they looked into it and"
    },
    {
      "id": 24,
      "start": 1886.4999694824219,
      "end": 1892.3799743652344,
      "text": " there was a mirror on the bottom of it. There was a mirror"
    },
    {
      "id": 25,
      "start": 1892.3999710083008,
      "end": 1896.5199737548828,
      "text": " on the bottom of it. And everybody saw themselves in the"
    },
    {
      "id": 26,
      "start": 1896.5399703979492,
      "end": 1904.119972229004,
      "text": " reflection. And he said this, he said, you are the deceased."
    },
    {
      "id": 27,
      "start": 1904.1599731445312,
      "end": 1909.8599700927734,
      "text": " The church is dead and it needs to be revived. It needs to live"
    },
    {
      "id": 28,
      "start": 1909.8999710083008,
      "end": 1912.2599716186523,
      "text": " again. It needs to be resurrected back to what it once"
    },
    {
      "id": 29,
      "start": 1912.2999725341797,
      "end": 1914.9399719238281,
      "text": " was. And the zeal of the Lord needs to be back in the house"
    },
    {
      "id": 30,
      "start": 1915.1599731445312,
      "end": 1918.8599700927734,
      "text": " of God. Now that was a pretty radical way of getting their"
    },
    {
      "id": 31,
      "start": 1918.8999710083008,
      "end": 1923.0999755859375,
      "text": " attention, but it got their attention. And again I'm not"
    },
    {
      "id": 32,
      "start": 1923.1399765014648,
      "end": 1925.9399719238281,
      "text": " saying that about this church tonight, I'm just saying this"
    },
    {
      "id": 33,
      "start": 1925.9799728393555,
      "end": 1928.7799682617188,
      "text": " in a general statement that really in many churches today"
    },
    {
      "id": 34,
      "start": 1928.7999725341797,
      "end": 1934.3799743652344,
      "text": " we just need an awakening. We just need to be awakened. And"
    },
    {
      "id": 35,
      "start": 1934.4199676513672,
      "end": 1936.7799682617188,
      "text": " we need to get back to the part to where we're not living a"
    },
    {
      "id": 36,
      "start": 1936.8199768066406,
      "end": 1942.9199676513672,
      "text": " halfway Christian life. We're living all out for the Lord. So"
    },
    {
      "id": 37,
      "start": 1942.9399719238281,
      "end": 1945.3799743652344,
      "text": " I thought that was a pretty good illustration. And of"
    },
    {
      "id": 38,
      "start": 1945.3999786376953,
      "end": 1948.1399688720703,
      "text": " course here as we look further on the church at Laodicea we"
    },
    {
      "id": 39,
      "start": 1948.1799774169922,
      "end": 1950.8799743652344,
      "text": " see what ends up happening here. I'll just very quickly read"
    },
    {
      "id": 40,
      "start": 1950.9199676513672,
      "end": 1953.8799743652344,
      "text": " this in verse 19 it says, \"'As many as I love I rebuke and"
    },
    {
      "id": 41,
      "start": 1953.9199676513672,
      "end": 1956.4199676513672,
      "text": " chasten.'\" I like that. Somebody said, well you know"
    },
    {
      "id": 42,
      "start": 1956.459976196289,
      "end": 1957.959976196289,
      "text": " what we're living in Laodicea in the period of the church"
    },
    {
      "id": 43,
      "start": 1957.97998046875,
      "end": 1959.8799743652344,
      "text": " age. Well yeah, but we can still repent and get right with"
    },
    {
      "id": 44,
      "start": 1959.9199676513672,
      "end": 1963.699966430664,
      "text": " God. Amen. \"'As many as I love I rebuke and chasten.'\" And it"
    },
    {
      "id": 45,
      "start": 1963.719970703125,
      "end": 1966.1599731445312,
      "text": " said, \"'Be zealous and repent. Behold I stand at the door and"
    },
    {
      "id": 46,
      "start": 1966.199966430664,
      "end": 1968.3999786376953,
      "text": " knock.'\" That's an amazing thing. \"'If any man hear my"
    },
    {
      "id": 47,
      "start": 1968.4399719238281,
      "end": 1970.9399719238281,
      "text": " voice and open the door I will come in unto him and will sup"
    },
    {
      "id": 48,
      "start": 1970.959976196289,
      "end": 1972.6399688720703,
      "text": " with him and he with me.'\" And of course we use that in Saul"
    },
    {
      "id": 49,
      "start": 1972.719970703125,
      "end": 1974.9199676513672,
      "text": " winning. But what Jesus is saying here is, hey listen you"
    },
    {
      "id": 50,
      "start": 1974.959976196289,
      "end": 1976.959976196289,
      "text": " folks have locked me out of my church I want back in again."
    },
    {
      "id": 51,
      "start": 1976.9999694824219,
      "end": 1982.739974975586,
      "text": " There he is knocking on the door, let me back in. He wants"
    },
    {
      "id": 52,
      "start": 1982.7599792480469,
      "end": 1989.3799743652344,
      "text": " back into his own church again. It's amazing. Psalm 86 and"
    },
    {
      "id": 53,
      "start": 1989.3999786376953,
      "end": 1992.3399658203125,
      "text": " verse 12, \"'I will praise the Lord my God with all my heart"
    },
    {
      "id": 54,
      "start": 1992.3799743652344,
      "end": 1998.5799713134766,
      "text": " and I will glorify thy name forevermore.'\" Joshua 22, 5,"
    },
    {
      "id": 55,
      "start": 1998.6199798583984,
      "end": 2001.7599792480469,
      "text": " \"'But take diligent he to do the commandment and the law"
    },
    {
      "id": 56,
      "start": 2001.8999786376953,
      "end": 2003.8399658203125,
      "text": " which Moses, the servant of the Lord, charged you to love"
    },
    {
      "id": 57,
      "start": 2003.8799743652344,
      "end": 2006.8799743652344,
      "text": " the Lord your God and to walk in all His ways and to keep"
    },
    {
      "id": 58,
      "start": 2006.9199676513672,
      "end": 2010.2799682617188,
      "text": " His commandments and to cleave unto Him and serve Him with"
    },
    {
      "id": 59,
      "start": 2010.3199768066406,
      "end": 2014.1199798583984,
      "text": " all your heart and with all your soul.'\" 1 Samuel 12, 24,"
    },
    {
      "id": 60,
      "start": 2014.1599731445312,
      "end": 2017.1599731445312,
      "text": " \"'Only fear the Lord and serve Him in truth with all your"
    },
    {
      "id": 61,
      "start": 2017.199966430664,
      "end": 2020.5599670410156,
      "text": " heart for consider how great things He hath done for you.'\""
    },
    {
      "id": 62,
      "start": 2020.5999755859375,
      "end": 2024.5999755859375,
      "text": " Psalm 91, \"'I will praise thee O Lord with my whole heart I"
    },
    {
      "id": 63,
      "start": 2024.6399688720703,
      "end": 2028.4999694824219,
      "text": " will show forth all thy marvelous works.'\" Psalm 111,"
    },
    {
      "id": 64,
      "start": 2028.6399688720703,
      "end": 2032.1199798583984,
      "text": " verse 1, \"'Praise ye the Lord. I will praise the Lord with"
    },
    {
      "id": 65,
      "start": 2032.1399688720703,
      "end": 2034.2799682617188,
      "text": " my whole heart in the assembly of the upright and in the"
    },
    {
      "id": 66,
      "start": 2034.3199768066406,
      "end": 2037.7799682617188,
      "text": " congregation.'\" Psalm 119, 2, \"'Blessed are they that keep"
    },
    {
      "id": 67,
      "start": 2037.8199768066406,
      "end": 2041.7599792480469,
      "text": " His testimonies and seek Him with the whole heart.'\" Psalm"
    },
    {
      "id": 68,
      "start": 2041.7799682617188,
      "end": 2045.8199768066406,
      "text": " 119, 10, \"'With my whole heart have I sought thee O let me"
    },
    {
      "id": 69,
      "start": 2045.8599700927734,
      "end": 2048.959976196289,
      "text": " not wander from thy commandments.'\" Psalm 119, 69,"
    },
    {
      "id": 70,
      "start": 2048.999969482422,
      "end": 2051.6399688720703,
      "text": " \"'They are proud they have forged a lie against me but I"
    },
    {
      "id": 71,
      "start": 2051.6599731445312,
      "end": 2055.699966430664,
      "text": " will keep thy precepts with my whole heart.'\" Psalm 138,"
    },
    {
      "id": 72,
      "start": 2055.699966430664,
      "end": 2058.0799865722656,
      "text": " verses 1 and 2, \"'I will praise thee with my whole heart"
    },
    {
      "id": 73,
      "start": 2058.0999755859375,
      "end": 2061.0399780273438,
      "text": " before the gods will I sing praise unto thee. I will"
    },
    {
      "id": 74,
      "start": 2061.0799865722656,
      "end": 2064.1399841308594,
      "text": " worship toward the Holy Temple and praise thy name for thy"
    },
    {
      "id": 75,
      "start": 2064.179962158203,
      "end": 2066.9199829101562,
      "text": " loving kindness and for thy truth for thou hast magnified"
    },
    {
      "id": 76,
      "start": 2066.939971923828,
      "end": 2071.5199584960938,
      "text": " thy word above all thy name.'\" And what of the"
    },
    {
      "id": 77,
      "start": 2071.5599670410156,
      "end": 2075.1199645996094,
      "text": " backslidden? What about the backslidden? Isaiah 1, verses"
    },
    {
      "id": 78,
      "start": 2075.1599731445312,
      "end": 2078.199981689453,
      "text": " 4 and 5, \"'The vision of Isaiah the son of Amoz which"
    },
    {
      "id": 79,
      "start": 2078.219970703125,
      "end": 2081.1599731445312,
      "text": " he saw concerning Judah and Jerusalem in the days of"
    },
    {
      "id": 80,
      "start": 2081.199981689453,
      "end": 2085.1399841308594,
      "text": " Uzziah, Jotham, Ahaz, Hezekiah kings of Judah.'\" Ah, sinful"
    },
    {
      "id": 81,
      "start": 2085.1399841308594,
      "end": 2087.6399841308594,
      "text": " nation of people laden with iniquity and the seed of"
    },
    {
      "id": 82,
      "start": 2087.679962158203,
      "end": 2090.97998046875,
      "text": " evildoers, children that are corruptors. \"'They have"
    },
    {
      "id": 83,
      "start": 2091.0199584960938,
      "end": 2092.8799743652344,
      "text": " forsaken the Lord, they have provoked the Holy One of"
    },
    {
      "id": 84,
      "start": 2092.9199829101562,
      "end": 2097.179962158203,
      "text": " Israel and in anger they are gone away backward. Why should"
    },
    {
      "id": 85,
      "start": 2097.219970703125,
      "end": 2100.3199768066406,
      "text": " you be stricken anymore? Will you revolt more and more? The"
    },
    {
      "id": 86,
      "start": 2100.3599853515625,
      "end": 2104.6199645996094,
      "text": " whole head is sick and the whole heart faint.'\" See that's"
    },
    {
      "id": 87,
      "start": 2104.6599731445312,
      "end": 2108.0999755859375,
      "text": " that principle that's the whole idea of half-heartedness."
    },
    {
      "id": 88,
      "start": 2108.1399841308594,
      "end": 2111.6399841308594,
      "text": " Jeremiah chapter 3 and verse 10, \"'And yet for all her"
    },
    {
      "id": 89,
      "start": 2111.6599731445312,
      "end": 2114.5999755859375,
      "text": " treacherous sister Judah hath not turned unto me with her"
    },
    {
      "id": 90,
      "start": 2114.5999755859375,
      "end": 2117.0599670410156,
      "text": " whole heart, but faintedly saith the Lord.'\" So when"
    },
    {
      "id": 91,
      "start": 2117.0999755859375,
      "end": 2119.3999633789062,
      "text": " people are backslidden this is what they do, they no"
    },
    {
      "id": 92,
      "start": 2119.439971923828,
      "end": 2124.0999755859375,
      "text": " longer serve God with the whole heart. But Jeremiah 29"
    },
    {
      "id": 93,
      "start": 2124.1399841308594,
      "end": 2127.1399841308594,
      "text": " verses 11-13 says this, \"'For I know the thoughts that I"
    },
    {
      "id": 94,
      "start": 2127.179962158203,
      "end": 2129.6199645996094,
      "text": " think toward you, saith the Lord, thoughts of peace and"
    },
    {
      "id": 95,
      "start": 2129.6399841308594,
      "end": 2132.47998046875,
      "text": " not of evil, to give you an expected end. Then shall you"
    },
    {
      "id": 96,
      "start": 2132.5199584960938,
      "end": 2134.7799682617188,
      "text": " call upon me, and ye shall go and pray unto me, and I will"
    },
    {
      "id": 97,
      "start": 2134.8199768066406,
      "end": 2137.219970703125,
      "text": " hearken unto you. And ye shall seek me and find me, when"
    },
    {
      "id": 98,
      "start": 2137.259979248047,
      "end": 2143.199981689453,
      "text": " ye shall search for me with all your heart.'\" Amen. When"
    },
    {
      "id": 99,
      "start": 2143.219970703125,
      "end": 2145.5599670410156,
      "text": " you search for me with all your heart. What a wonderful"
    },
    {
      "id": 100,
      "start": 2145.5999755859375,
      "end": 2149.699981689453,
      "text": " passage of Scripture that is. That's the cure by the way for"
    },
    {
      "id": 101,
      "start": 2149.739959716797,
      "end": 2152.699981689453,
      "text": " half-heartedness is searching God with your whole heart."
    },
    {
      "id": 102,
      "start": 2152.739959716797,
      "end": 2156.2799682617188,
      "text": " Pastor Stephen Becker of Regency Baptist Church in the"
    },
    {
      "id": 103,
      "start": 2156.2999877929688,
      "end": 2159.239959716797,
      "text": " Sacramento, California where he wrote this, and I preached"
    },
    {
      "id": 104,
      "start": 2159.2799682617188,
      "end": 2162.8399658203125,
      "text": " for him not too long ago. He said this, he wrote this in a"
    },
    {
      "id": 105,
      "start": 2162.8799743652344,
      "end": 2165.9199829101562,
      "text": " devotional he wrote for his church. He said, \"'If you had"
    },
    {
      "id": 106,
      "start": 2165.939971923828,
      "end": 2168.0599670410156,
      "text": " to choose between a Christian that was cold and hardened"
    },
    {
      "id": 107,
      "start": 2168.0799865722656,
      "end": 2170.8799743652344,
      "text": " towards the Lord, one that was a middle of the road"
    },
    {
      "id": 108,
      "start": 2170.8999633789062,
      "end": 2174.97998046875,
      "text": " Christian, which one would you choose?' Our logic would"
    },
    {
      "id": 109,
      "start": 2174.999969482422,
      "end": 2177.6399841308594,
      "text": " certainly think that coming to church sometimes instead of"
    },
    {
      "id": 110,
      "start": 2177.679962158203,
      "end": 2181.4199829101562,
      "text": " never coming is at least doing some good, right? Well I"
    },
    {
      "id": 111,
      "start": 2181.439971923828,
      "end": 2183.179962158203,
      "text": " believe half-hearted Christianity is a battle of"
    },
    {
      "id": 112,
      "start": 2183.219970703125,
      "end": 2187.3199768066406,
      "text": " our era. This lukewarm lifestyle does more harm to"
    },
    {
      "id": 113,
      "start": 2187.3599853515625,
      "end": 2190.0199584960938,
      "text": " the faith than those who have completely turned away from"
    },
    {
      "id": 114,
      "start": 2190.0599670410156,
      "end": 2194.4599609375,
      "text": " the Lord. Some good is better than none, I agree. But what"
    },
    {
      "id": 115,
      "start": 2194.499969482422,
      "end": 2197.759979248047,
      "text": " kind of an impact will this way of living make on future"
    },
    {
      "id": 116,
      "start": 2197.8799743652344,
      "end": 2205.219970703125,
      "text": " generations? That's a pregnant thought. King Amaziah was a"
    },
    {
      "id": 117,
      "start": 2205.259979248047,
      "end": 2209.4599609375,
      "text": " half-hearted follower of the Lord. In 2 Chronicles 25.2 it"
    },
    {
      "id": 118,
      "start": 2209.499969482422,
      "end": 2212.2999877929688,
      "text": " reads this, \"'And he did that which was right in the sight"
    },
    {
      "id": 119,
      "start": 2212.3399658203125,
      "end": 2216.239959716797,
      "text": " of the Lord, but not with a perfect heart. He did some"
    },
    {
      "id": 120,
      "start": 2216.259979248047,
      "end": 2219.3999633789062,
      "text": " good, but he certainly wasn't sold out on fire, dedicated"
    },
    {
      "id": 121,
      "start": 2219.439971923828,
      "end": 2223.3799743652344,
      "text": " and fervent in his service. Half is better than none, but"
    },
    {
      "id": 122,
      "start": 2223.3999633789062,
      "end": 2225.8399658203125,
      "text": " in terms of what kind of future influence this will make it"
    },
    {
      "id": 123,
      "start": 2225.9599609375,
      "end": 2230.7999877929688,
      "text": " is detrimental.' There is a story of a man who wanted to"
    },
    {
      "id": 124,
      "start": 2230.8399658203125,
      "end": 2233.2999877929688,
      "text": " sell his house for $2,000, you can't imagine a house for"
    },
    {
      "id": 125,
      "start": 2233.3399658203125,
      "end": 2237.699981689453,
      "text": " $2,000. Another man wanted very badly to buy it but"
    },
    {
      "id": 126,
      "start": 2237.739959716797,
      "end": 2241.5399780273438,
      "text": " couldn't afford it. After much bargaining the owner agreed to"
    },
    {
      "id": 127,
      "start": 2241.5799865722656,
      "end": 2243.739959716797,
      "text": " sell the house for half the original price with a catch"
    },
    {
      "id": 128,
      "start": 2243.7799682617188,
      "end": 2246.8799743652344,
      "text": " that he would retain ownership of one small nail protruding"
    },
    {
      "id": 129,
      "start": 2246.9199829101562,
      "end": 2250.97998046875,
      "text": " from just over the door.\" I read that and I thought,"
    },
    {
      "id": 130,
      "start": 2251.0199584960938,
      "end": 2254.9199829101562,
      "text": " what? After many years the original owner wanted the"
    },
    {
      "id": 131,
      "start": 2255.0399780273438,
      "end": 2259.8399658203125,
      "text": " house back, but the new owner was unwilling to sell. So,"
    },
    {
      "id": 132,
      "start": 2259.8799743652344,
      "end": 2262.239959716797,
      "text": " the first owner went out, found the carcass of a dead"
    },
    {
      "id": 133,
      "start": 2262.2799682617188,
      "end": 2264.47998046875,
      "text": " dog and hung it from the single nail he still owned."
    },
    {
      "id": 134,
      "start": 2264.5199584960938,
      "end": 2269.719970703125,
      "text": " Soon the house became unlivable and the family was"
    },
    {
      "id": 135,
      "start": 2269.759979248047,
      "end": 2272.5199584960938,
      "text": " forced to sell the house to the owner of the nail on his"
    },
    {
      "id": 136,
      "start": 2272.5599670410156,
      "end": 2276.759979248047,
      "text": " terms. The moral of the story is this, give the devil just"
    },
    {
      "id": 137,
      "start": 2276.7999877929688,
      "end": 2279.0999755859375,
      "text": " one small part of your life and he will make it impossible"
    },
    {
      "id": 138,
      "start": 2279.3199768066406,
      "end": 2287.5599670410156,
      "text": " for Christ's presence to live there. Huh? It's simple but"
    },
    {
      "id": 139,
      "start": 2287.5999755859375,
      "end": 2293.1599731445312,
      "text": " profound. So, the truth is this, there is no such thing"
    },
    {
      "id": 140,
      "start": 2293.199981689453,
      "end": 2295.999969482422,
      "text": " as a half-hearted Christian. You're either in or you're"
    },
    {
      "id": 141,
      "start": 2296.0399780273438,
      "end": 2301.179962158203,
      "text": " out. Pastor Becker says, surrender yourself fully to"
    },
    {
      "id": 142,
      "start": 2301.199981689453,
      "end": 2303.8399658203125,
      "text": " the Lord and leave no part behind. Now that's important"
    },
    {
      "id": 143,
      "start": 2303.8799743652344,
      "end": 2306.2799682617188,
      "text": " to leave no part behind. What part of us do we leave"
    },
    {
      "id": 144,
      "start": 2306.499969482422,
      "end": 2311.2999877929688,
      "text": " behind? You know, God doesn't want us to leave any part"
    },
    {
      "id": 145,
      "start": 2311.3399658203125,
      "end": 2316.3399658203125,
      "text": " behind. He wants us to be in service to Him with all heart."
    },
    {
      "id": 146,
      "start": 2316.3799438476562,
      "end": 2324.7799682617188,
      "text": " And to be lukewarm is to be half-hearted. And Jesus said,"
    },
    {
      "id": 147,
      "start": 2324.8199462890625,
      "end": 2332.5199584960938,
      "text": " a half-hearted Christianity makes me sick. Makes him sick"
    },
    {
      "id": 148,
      "start": 2332.5999755859375,
      "end": 2337.9400024414062,
      "text": " of heart. It breaks his heart when he sees that we are only"
    },
    {
      "id": 149,
      "start": 2337.97998046875,
      "end": 2342.0799560546875,
      "text": " living half way. No such thing as a half-way Christian. You"
    },
    {
      "id": 150,
      "start": 2342.1199951171875,
      "end": 2343.97998046875,
      "text": " know, I mean that's why I hear people say, well, you know"
    },
    {
      "id": 151,
      "start": 2344.0199584960938,
      "end": 2346.1799926757812,
      "text": " God is kind of a half-way Christian. Listen, you're"
    },
    {
      "id": 152,
      "start": 2346.219970703125,
      "end": 2349.5599975585938,
      "text": " either going to serve Him or you aren't. You're not going"
    },
    {
      "id": 153,
      "start": 2349.5799560546875,
      "end": 2352.1199951171875,
      "text": " to serve Him and you're not walking the way you should."
    },
    {
      "id": 154,
      "start": 2352.1599731445312,
      "end": 2357.0599975585938,
      "text": " Then the Bible says you're backslidden. Half-hearted"
    },
    {
      "id": 155,
      "start": 2357.0999755859375,
      "end": 2360.7599487304688,
      "text": " Christianity is very damaging and detrimental to the cause"
    },
    {
      "id": 156,
      "start": 2360.7799682617188,
      "end": 2364.4400024414062,
      "text": " of Christ. By the way, our children need to see that"
    },
    {
      "id": 157,
      "start": 2364.47998046875,
      "end": 2371.3799438476562,
      "text": " we're all in. We want our children to have a holy zeal"
    },
    {
      "id": 158,
      "start": 2371.4199829101562,
      "end": 2374.1199951171875,
      "text": " for the things of God. We want them to want to live for"
    },
    {
      "id": 159,
      "start": 2374.1599731445312,
      "end": 2378.6199951171875,
      "text": " Jesus. If they don't see us do it then why would you be"
    },
    {
      "id": 160,
      "start": 2378.6599731445312,
      "end": 2382.1599731445312,
      "text": " surprised when they don't do it? They need to see the"
    },
    {
      "id": 161,
      "start": 2382.199951171875,
      "end": 2387.5,
      "text": " sincerity of our Christianity, the zeal, the joy, the"
    },
    {
      "id": 162,
      "start": 2387.5,
      "end": 2391.0799560546875,
      "text": " happiness, the excitement, the enthusiasm. Not about you"
    },
    {
      "id": 163,
      "start": 2391.1199951171875,
      "end": 2396.7799682617188,
      "text": " but I'm just excited about being saved. You know, being"
    },
    {
      "id": 164,
      "start": 2396.8199462890625,
      "end": 2400.1199951171875,
      "text": " saved to me that's an exciting thing."
    },
    {
      "id": 0,
      "start": 2400.1199951171875,
      "end": 2403.679995059967,
      "text": " I mean, you remember when you got saved?"
    },
    {
      "id": 1,
      "start": 2403.679995059967,
      "end": 2405.2799949645996,
      "text": " You remember?"
    },
    {
      "id": 2,
      "start": 2405.2799949645996,
      "end": 2411.9599952697754,
      "text": " You remember how excited you were?"
    },
    {
      "id": 3,
      "start": 2411.9599952697754,
      "end": 2415.679995536804,
      "text": " Someone said to me one time, oh, you Christians miss all the fun."
    },
    {
      "id": 4,
      "start": 2415.679995536804,
      "end": 2418.7999954223633,
      "text": " I said, no, the only thing I'm going to miss is going to hell."
    },
    {
      "id": 5,
      "start": 2418.7999954223633,
      "end": 2419.7999954223633,
      "text": " I don't have to go to hell."
    },
    {
      "id": 6,
      "start": 2419.7999954223633,
      "end": 2420.7999954223633,
      "text": " Amen?"
    },
    {
      "id": 7,
      "start": 2420.7999954223633,
      "end": 2425.399995803833,
      "text": " In fact, I'm not going to hell."
    },
    {
      "id": 8,
      "start": 2425.399995803833,
      "end": 2431.719995498657,
      "text": " Now that right there is enough to make you happy and joyful."
    },
    {
      "id": 9,
      "start": 2431.719995498657,
      "end": 2436.039993286133,
      "text": " People just, if someone said, well, you know what, brother, my son, it seems like people"
    },
    {
      "id": 10,
      "start": 2436.039993286133,
      "end": 2440.039993286133,
      "text": " get saved and after about 18 months to two years, it kind of just wears off and it gets"
    },
    {
      "id": 11,
      "start": 2440.039993286133,
      "end": 2446.039993286133,
      "text": " just, you know, just becomes the norm."
    },
    {
      "id": 12,
      "start": 2446.039993286133,
      "end": 2447.039993286133,
      "text": " Should never be that way."
    },
    {
      "id": 13,
      "start": 2447.039993286133,
      "end": 2452.919994354248,
      "text": " The longer you live, the more excited you should be."
    },
    {
      "id": 14,
      "start": 2452.919994354248,
      "end": 2453.919994354248,
      "text": " You know?"
    },
    {
      "id": 15,
      "start": 2453.919994354248,
      "end": 2459.759994506836,
      "text": " The more that whole enthusiasm ought to be there, really should be."
    },
    {
      "id": 16,
      "start": 2459.759994506836,
      "end": 2461.2399940490723,
      "text": " We don't want to be half hearted."
    },
    {
      "id": 17,
      "start": 2461.2399940490723,
      "end": 2468.4399948120117,
      "text": " Half hearted Christianity does not please the Lord."
    },
    {
      "id": 18,
      "start": 2468.4399948120117,
      "end": 2474.4399948120117,
      "text": " So David mentioned several times, I want to serve the Lord and live for him with a whole"
    },
    {
      "id": 19,
      "start": 2474.4399948120117,
      "end": 2482.4399948120117,
      "text": " heart, with a whole heart, a whole heart."
    },
    {
      "id": 20,
      "start": 2483.4399948120117,
      "end": 2489.6799926757812,
      "text": " I trust that God has used his word tonight to speak to you about this as he's spoken"
    },
    {
      "id": 21,
      "start": 2489.6799926757812,
      "end": 2490.6799926757812,
      "text": " to me today."
    },
    {
      "id": 22,
      "start": 2490.6799926757812,
      "end": 2495.759994506836,
      "text": " Let's all stand with our heads bowed and eyes closed tonight."
    },
    {
      "id": 23,
      "start": 2495.759994506836,
      "end": 2500.359992980957,
      "text": " With every head bowed and every eye closed tonight, as our sister comes to play the instrument,"
    },
    {
      "id": 24,
      "start": 2500.359992980957,
      "end": 2509.9199981689453,
      "text": " how's God spoken to you?"
    },
    {
      "id": 25,
      "start": 2509.9199981689453,
      "end": 2510.9199981689453,
      "text": " Thou shalt love."
    },
    {
      "id": 26,
      "start": 2510.9199981689453,
      "end": 2510.9199981689453,
      "text": ""
    }
  ],
  "processed_at": "2025-04-16T00:09:16.540980"
}