{
  "video_id": "_fRtpMZRJGo",
  "text": "chapter number 35 this evening. Genesis chapter number 35, we'll be looking at verses 16-29 this evening as we finish up this 35th chapter here in the book of Genesis. As we conclude this chapter, we're provided with a number of records. I'll read the text of Scripture and then we'll deal with those and look at this passage maybe from a little peculiar type of a perspective this evening. But notice with me, last week as we read the first half and studied through the first 15 verses of the book of, of the 35th chapter of the book of Genesis, we dealt with the fact that they were returning to Bethel. And what a wonderful truth that God gave us in that portion of Scripture. And we talked about the fact that Jacob of course had been to Bethel before and now this was a return for him. And they were going there for the purpose of worship. And our God is worthy of worship. And we talked about the importance of preparing for worship and looked at that passage and what a blessing it was. And now the Bible tells us beginning in verse number 16 that they journeyed from Bethel. And so they were there, they worshiped, and now they're departing. And the Bible says this, and there was but a little way to come to Ephrath. And Rachel travailed and she had hard labor. And it came to pass when she was in hard labor that the midwife said unto her, fear not, thou shalt have this son also. And it came to pass as her soul was in departing for she died, that she called his name Benoni, but his father called him Benjamin. And Rachel died and was buried in the way of Ephrath which is Bethlehem. And Jacob set a pillar upon her grave, that is the pillar of Rachel's grave unto this day. And Israel journeyed and spread his tent beyond the tower of Edar. And it came to pass when Israel dwelt in the land that Reuben went and lay with Bilhah, his father's concubine. And Israel heard it. The sons of Jacob were twelve, the sons of Leah, Reuben, Jacob's firstborn, and Simeon, and Levi, and Judah, and Issachar, and Zebulun, the sons of Rachel, Joseph, and Benjamin, the sons of Bilhah, Rachel's handmaid, Dan, and Naphtali, the sons of Zilpah, Leah's handmaid, Gad, and Asher. These are the sons of Jacob which were born to him in Paddan Aram. And Jacob came unto Isaac, his father, unto Mamre, unto the city of Arba, which is Hebron, where Abraham and Isaac sojourned. The days of Isaac were 104 score years, 180 years old. Wow. Verse 29, And Isaac gave up the ghost, and died, and was gathered unto his people, being old and full of days. And his sons Esau and Jacob buried him. Of course you'll remember that after Jacob received the vision from the Lord to depart from Paddan Aram and return, we read of the reunion between Jacob and Esau. And now we see this reference for after that great reunion and we read of all of those things that transpired. There was obviously a departure and they were in their different separate places. But as you end the 35th chapter and you see once again a reference to Jacob and Esau, they are together and they are burying their father Isaac. But as we look at this portion of Scripture in these verses that are before us this evening, we really see the record of four events that are provided for us. Number one, we see the record of the birth of Benjamin. And we see that in verses 16 through 18. We have the record of Jacob's sons in verses 23 through 26. That was a question from the teens on the teen takeover, name the sons of Jacob, right? And if you, there's a couple of places you can go and you can see the list. And here we find that in just a few verses of Scripture, God gives us the names of the sons of Jacob. We find that the text of Scripture before us records for us the death of Rachel. And we read that in verses 18 and in verse number 19. And then we find that the Bible in this portion of Scripture reveals to us the death of Isaac in verses 27 through 29. And so we read of the birth of Benjamin, all of the names of Jacob's sons, the death of Rachel and the death of Isaac. And thus I have titled the message this evening, Life and Death. Life and Death. You think about all the sons of Jacob that are mentioned in verses 23 through 26. You can go to previous portions of Scripture and you can read of the record of their birth. And here does not record for us their birth specifically, only Benjamin's birth is recorded here in this portion of Scripture. But you are referencing and understanding that each of these sons of Jacob were born and you can read of that. It's interesting that in these few verses of Scripture, we read of life and we read of death. Let me begin to think about life and begin to think about that thought from this portion of Scripture this evening. In 2022 globally, so not just the United States but globally, in 2022 there were about 67 million people that died and 140 million that were born. Life and death. 140 million born, 67 million died. So every single second, the exact math based on those estimate numbers is that there are 4.4 births every second. Globally. 4.4 people are born, so we'd say 4 people, right, because we're not having a partial, right, but you understand the math exactly. But every second, 4 people are born and 2.1 people, so we'd say 2 people, die. So you think about that. Seconds pass so quickly. But every second that passes represents 4 births and 2 deaths. Life and death. We're familiar with that. We, in fact, often times we don't like talking about death. In fact, there's a big word, a phobia of dying, the fear of dying, an anxiety of dying, and you talk to some people and they have a fear of dying. The uncertainty. The fear. In fact, the book of Hebrews talks about, in Hebrews chapter number 2, you don't need to turn there, but in Hebrews chapter number 2 the Bible talks about these that had this fear of death and perhaps at one point in your life you would say, I had a fear of dying. The uncertainty. But we find that the Bible says in Hebrews 2 and verse 14, for as much then as the children are partakers of flesh and blood, he also himself likewise took part of the same, that through death he might destroy him that had the power of death, that is the devil, and it continues and says this in verse 15, and deliver them who through fear of death were all their lifetime subject to bondage. I hope this evening that you can say, I do not fear death. In saying that you do not fear death, that does not necessarily mean that you have a death sentence, but it means that you don't fear death. It means that you have no fear of that final breath here upon this earth. The life expectancy globally, according to some statistics that I looked at, globally the life expectancy is 73. In the United States of America, the life expectancy currently is about 76 years old. And for some of us that means we have borrowed time, and for some of us that means we have several years, and some have a whole lot of years if you look at that life expectancy. But we understand the Bible teaches us that we don't know when we're going to die. You can look at the statistics and you can look at the life expectancy, but the reality is that we do not know the time of our departure. We understand that Paul would say, the time of my departure is at hand. We understand that Peter would say that I must put off this, my tabernacle. And we understand that there was an understanding and an acknowledgement amongst those individuals, those saints of God, that death was soon for them. God had revealed it to them. As we begin to think about this passage of Scripture and the records that are provided to us of life and death, I want us to consider this evening some biblical truth. Turn to the book of Ecclesiastes, if you will, and we're going to look at a number of passages, and then I'm just going to ask two questions this evening through the message, but turn to the book of Ecclesiastes, if you will. Psalms, Proverbs, Ecclesiastes, and the third chapter, Ecclesiastes chapter number three. It's good to hear pages turning. Somebody sent me an email yesterday, side note, we'll chase the rabbit while you're turning pages, and they said this, they said, pastor, what would we do if we didn't have a Bible? I'm glad we have a Bible. Amen? Because I really don't want to think about that. I'm glad we have a Bible. It's a wonderful thing to hear pages of Bibles turning. Verse one of Ecclesiastes three, the Bible says, to everything there is a season and a time to every purpose under the heaven. Notice what it says, a time to be born and a time to die, a time to plant and a time to pluck up that which is planted, a time to kill and a time to heal, a time to break down and a time to build up, a time to weep and a time to laugh, a time to mourn and a time to dance, a time to cast away stones and a time to gather stones together, a time to embrace and a time to refrain from embracing. And you get the idea, and I'm not going to continue reading the passage, because I want you to notice the first phrase of verse two, a time to be born and a time to die, a time to be born and a time to die. For all of us here, we know the time of our birth, right? We know. You have a record of a live birth, and we have a birth certificate, and you understand that you have a birthday. Somebody told me, I won't mention who, but they have a birthday coming up in the month of April, and they said, just so you know, Pastor, this is the last year I'm celebrating my birthday for a little while. And I understand. I said, well, that's because you're turning 39, and you just don't want to hit that 40. But the reality is that we know the time of our birth. What we do not know is the time of our death. The Bible says a time to be born and a time to die. In chapter number seven of the book of Ecclesiastes, notice what the Bible says in verse number two. Here in Ecclesiastes 7, in verse number two, the Bible says it is better to go to the house of mourning than to go to the house of feasting. Notice why that statement is made about which is better. It says, for that is the end of all men, and the living will lay it to his heart. You know, something interesting about funerals, the house of mourning. There's something that's interesting about going to a funeral, a celebration of life, a memorial service, whatever you want to call it. There's something that's interesting about that experience is it's a sobering time. It's a time of recognizing and understanding that our life is going to come to an end. It's the end of all men. And that's what the wise man says here in the book of Ecclesiastes under the inspiration of the Holy Spirit of God. Notice what Job says over in Job chapter 21. And this portion of Scripture is quite interesting with regard to the observation that is made here in this reply to one of the friends. And Job is speaking here in Job chapter 21. And notice what he says about this idea of death. In Job chapter 21, beginning in verse number 23, the Bible says, One dieth in his full strength, being holy at ease and quiet. His breasts are full of milk, and his bones are moistened with marrow. And another dieth in the bitterness of his soul, and never eateth with pleasure. They shall lie down alike in the dust, and the worms shall cover them. We're going to die one day. We're all going to die. We see life and death. We see in the portion of Scripture this evening the record of the birth of Benjamin, the names of all of the sons of Jacob. But we see the death of Rachel, and we see the death of Isaac, 180 years old. I mean, that's a long life. But it came to an end. All the sons of Jacob, though all of their deaths are not recorded for us within the pages of Scripture, we understand they all died. Hebrews 9 and verse 27 says it this way, And as it is appointed unto men once to die, but after this the judgment. I've often said this, and I've understood, as you think about the truth of that verse of Scripture, that there's an appointment that we have with death. And there's nothing I can do to change it, cancel it. I don't know when it is. Neither do you. Think about how James thinks about life. He says, what is your life? It's but a vapor that appeareth for a little time and then vanisheth away. In James 4 and verse number 14, we're understanding of what a vapor is, and you begin to think about that imagery that is being used, and you think about the boiling pot, and if you think about that analogy of seeing the vapor, and it just appears for a little while, and then it's gone. It's gone. And the reality is that as we begin to think about life, and we think about death, and no matter how many years we might live here upon the earth, the reality is that it's just about that long in light of eternity. I think about what the psalmist said, turn to Psalm 102, if you will. We find that James, in James 4 and 14, references life, and he compares it. He uses the analogy that our life is but a vapor that appeareth for a little time. The psalmist here in Psalm 102, look what he says about his life, his days. In Psalm 102, in verse number 11, the psalmist says this, My days are like a shadow that declineth, and I am withered like grass. You ever see a shadow? Sure you have. You look out in the evening as the sun is setting, and you begin to see that shadow, and it grows, and then before long, the shadow's gone. Why? Because the sun is set. You begin to think about shadows, and light, and all that takes place, and the psalmist says, My days, my life is like a shadow that declineth. But notice what it says in Psalm 90, a familiar passage of Scripture, a psalm actually that's ascribed to Moses. In Psalm 90, the Bible will speak to us about our lives. Beginning in verse number 9 of this psalm, the Bible says this, For all our days are passed away in thy wrath. Notice the statement, we spend our years as a tale that is told. I preached a message several years ago from that thought at the end of verse number 9. I believe it was a last service of a particular year as we were entering into a new year, and I asked this question as I preached from this portion of Scripture, what's your story? Because we spend our years as a tale that is told. For each of us here this evening, there's a chapter in our book. I don't know what page it is, and I don't know when the end comes. But I've read a lot of books, and I'm sure you've read a lot of books as well, and there comes an end to the book, and there's going to come an end to our and there's going to come an end to our lives. And we see that the Bible says that we spend our years as a tale that is told. Notice it says this in verse number 10, The days of our years are threescore years and ten, seventy. And if by reason of strength they be fourscore years, eighty, it is their strength, labor, and sorrow, for it is soon cut off, and we fly away. Who knoweth the power of thine anger, even according to thy fear, so is thy wrath. Notice verse 12, So teach us to number our days, that we may apply our hearts unto wisdom. Isaiah was called of God as a servant of the Lord. He prophesied faithfully. But in one particular account in the book of Isaiah, Isaiah is given the specific task of delivering a message to King Hezekiah. That message is recorded for us in Isaiah 38 in verse number 1, and here's what God says through His messenger, Thus saith the Lord, Set thine house in order, for thou shalt die and not live. Now if you're familiar with the life of Hezekiah in that particular announcement from the prophet of God, you understand that Hezekiah weeps. You understand that God answers and extends his life by 15 years. But even in extending his life by 15 years, you know what happened to Hezekiah one day? He died. He died. We need to think about this passage in Genesis chapter 35 and thinking about life and death and considering the truth that is before us and looking at some statistics, but then also looking and considering once again afresh, if you will, the truth of God's Word with regard to life and death. And two simple questions this evening for the message, and here's the first. First, are you prepared to take your final breath? Are you personally prepared to take your final breath? We don't know the time of our departure. If we were to take a trip today to this evening, we were to load up in our vehicles and we were to visit over to some local cemetery, graveyard, and we begin to walk through the tombstones and begin to walk through the property, one thing that you would find is a variety of ages. You would not find consistency among all of the headstones that all of these people died at a certain age. No, you'll find some that died way older and some that died way younger. Sometimes when a young person dies, an individual will make an assessment, will make a comment of their life was cut short. You've heard somebody say that, no doubt. And the question this evening is, are you prepared to take your final breath? In recent days, we've read of a number of calamities in our nation where people's lives were lost. We mentioned a couple of those this morning in our Sunday school hour. You think about the tragedy that took place in Tennessee. By the way, I read this afternoon that there was a shooting just here in Northern Virginia at a mall up in what, Leesburg, is that where it was? Tyson's at the Tyson's Mall, Dulles, Dulles Shopping Center this afternoon, active shooting situation. It seems like it's recurring, right? It's more and more. You're reading of this. Military personnel serving the U.S. Army go out this week for some training mission in the evening and two Black Hawk helicopters crash, nine people perish, tornadoes. We've seen the devastation. They don't even know how many people have died in all of those tornadoes. You think about earthquakes that have taken place and lives that have perished. And some of those, many of those instances, I mean, car crashes and fatalities, those people did not know that today was when I'm going to take my final breath. They didn't have that understanding. In this evening, I begin to think about this truth and looking at this portion of Scripture and God impressed this truth and this thought upon my heart. And the reality is we must be prepared to take our final breath. It's absolutely essential. And again, when we answer the question that I do not fear dying, when I answer the question that I'm prepared for death, it does not necessarily mean that I have a death sentence, that somebody needs to put us on some kind of special watch because we're going to do harm to ourselves. No, it just means that I know that I'm going to heaven. Notice what Paul says. Look over to the book of Philippians, if you will. I want you to consider the familiar words of the Apostle Paul as he's writing to these believers in Philippi and he shares with them some truth that I think is not only impactful for the believers in Philippi, but no doubt impactful for believers through the centuries. As we've read these verses of Scripture and we've understood what is being communicated and we can rejoice in Paul's preparation and his understanding of being ready to die. Notice what Paul says in Philippians 1 in verse 21. For to me to live is Christ and to die is gain. And then he says this, but if I live in the flesh, this is the fruit of my labor, yet what I shall choose I won't not. Notice what he says in verse 23, for I am in a straight betwixt two. What was it that caused this situation that Paul is referencing? You've ever heard somebody say, I'm between a rock and a hard place. I've heard that saying as a child many times and he says, I'm in a straight betwixt two. Notice what the situation is. Having a desire to depart and to be with Christ, which is far better. You read 1 Corinthians 15, the wonderful chapter on the resurrection. The Bible tells us that this mortal shall put on immortality. The Bible tells us that this corruption shall put on incorruption. In the moment, the twinkling of an eye, I'm so thankful. And Paul says, listen, it's better to be with Christ. Again, it doesn't mean that we have a death sentence that we're trying to cut our lives short. No, it just simply means I'm not afraid of dying and I'm prepared for dying. He says this in verse 24, nevertheless, to abide in the flesh is more needful for you. Paul understood that there was still a mission at hand. There was still something that God had for him. I think about Elijah. Elijah said, I just want to die. After the miraculous fire coming from heaven at Mount Carmel and all that took place and he hears what Jezebel says and he flees and I mean, he just wants to die. But God appears to him. God strengthens him. You know what God says to him? He says, I have two tasks yet for you, Elijah. God still had a purpose for Elijah's life. If we're here this evening and we're still living and breathing, God has a purpose for our life. And I'm thankful that God has a purpose for our life. And until God's done with us, we'll live for Christ. That's what Paul says, for me to live is Christ, to die is gain. No fear of dying. Notice what he says over in 2 Corinthians chapter number 5, in 2 Corinthians chapter number 5, in verse number, I want to read the whole passage, but look at just verse number 8 with me. I've got to get to the last point. Notice what Paul says in 2 Corinthians 5 and verse number 8, we are confident, I say, and willing rather to be absent from the body and to be present with the Lord. This evening, we can have confidence that when we put off this, our earthly tabernacle, that we'll be in the presence of our Savior. We don't have to fear death. We can be prepared for death. But what was it that led Paul to a place of saying that I'm prepared for death, for taking my final breath? Well, obviously, the truth that he had trusted Christ as his Savior. There on the road to Damascus, as it's recorded in Acts chapter number 9, Saul's life was changed forever, and he accepted the Lord Jesus Christ as his personal Savior. From that point forward, Saul was a man that knew he was heaven bound. I think of D.L. Moody, man pulls a gun on him and he says, you can't threaten me with heaven. Wow, that's a man that has confidence to be absent from the body is to be present with the Lord. I shared the story many years ago, but I'll share it again this evening. I was standing in line at the bank just over here in Oakton several years ago now. And as I'm standing there in line and this fellow walks in, and the best way that I could describe this fellow, and I'm not trying to be unkind, but he was an elderly, grumpy man. Just what it was. He didn't have a grumpy shirt on. He didn't need it. He was just grumpy. And you just kind of, you ever meet somebody like that? Just grumpy. Sometimes they wear the shirt. We're at the restaurant and some guy walks in with a grumpy shirt. Just announce it to everybody, man. This guy didn't need a shirt. He's just grumpy. And I'm standing there doing my transaction, doing my thing. He's standing over there and just the two of us and a couple of tellers, and he looks at me and I look at him and I say, how are you? He says, how are you? I said, I'm wonderful. He said, you're lying. That's what he said to me. You're lying. I said, I've never had anyone tell me that. I was like confused. When I said I'm wonderful and he says you're lying, like I couldn't comprehend. I said, what do you mean I'm lying? He said, nobody's wonderful. What would make you say that you're wonderful? I didn't have time to really think about all this and lay it all out, but I just simply responded by saying I'm going to heaven. And he said, are you dying? It's comical, comical. I said, well, as far as I know, I'm not dying right now, but yes, I'm going to die one day. So are you. And I said, I can be wonderful because I know I'm going to heaven. I gave him a gospel tract and asked him to read it. I've never seen that man again in my life. I don't know that I ever will. But the reality is that we don't have to fear death. We can be prepared for death. The second question that I have this evening is not simply are you prepared to take your final breath, but let me ask this question, number two this evening. Are you helping others to be prepared to take their final breath? Are you prepared, but are you helping anyone to be prepared to take their final breath? Dean often says as he prays, everyone that we come into contact with has got a soul and they're going to die. People that you see every day are going to die. No doubt you've had people that you've worked with, people that are relatives, people that are neighbors. You get the news that so-and-so died. And the question this evening is, who are we helping to prepare to take their final breath? See, in the same passage of Scripture in 2 Corinthians chapter 5 and verse number 8, when Paul says, we are confident, I say, and willing rather to be absent from the body and to be present with the Lord, we find that Paul then begins to deal with something at the end of the passage that is so important for us to understand. Notice and pick it up with me. For sake of time, we'll pick it up in verse 18. But notice what the Bible says here in 2 Corinthians 5 and verse number 18. The Bible says, and all things are of God who hath reconciled us to himself by Jesus Christ. We talked about reconciliation this morning. And I dealt with that truth from 1 Peter 3 and verse number 18. And the word reconciliation, it's the means by which sinners are reconciled and brought into a state of favor with God after natural estrangement or enmity. And I think about that truth this evening of reconciliation and being brought back to God. We talked about as 1 Peter 3, 18, I preached this morning that there's the record of Christ's suffering. There's the reason for Christ's suffering. But there's the result that he would bring us to God. God. And here the Bible says that in verse number 18, and all things are of God who hath reconciled us to himself by Jesus Christ, aren't you thankful to be reconciled? What a glorious truth that we can stand up and say, I've been reconciled. I know we don't use the word that often. We might talk about being redeemed and being saved and being born again. But the truth is that we can say accurately, I've been reconciled. And notice what it says at the end of verse number 18, and hath given to us the ministry of reconciliation. We have been reconciled to God through Jesus Christ. By the way, it's the only way to be reconciled because the just for the unjust, and we dealt with that very detailed this morning. But we find that he then says this, that he has given to us the ministry of reconciliation. Notice to wit, verse 19, that God was in Christ, reconciling the world unto himself, not imputing their trespasses unto them, and hath committed unto us the word of reconciliation. So we see at the end of verse number 18 that he hath given to us the ministry of reconciliation. Now in verse number 19, he says, and hath committed unto us the word of reconciliation. And then he says this in verse number 20, now then, we are ambassadors for Christ. We are ambassadors for Christ. As though God did beseech you by us, we pray you in Christ's stead, be reconciled to God. For he hath made him to be sin for us who knew no sin, that we might be made the righteousness of God in him. And as we look there at that truth in verses 18 through 20 of the ministry of reconciliation, when we find that Paul says we've been given this ministry of reconciliation, the word of reconciliation has been committed unto us, he says, now then, we are his ambassadors. Ambassadors are representative. We sing the song, this world is not my home, I'm just a passing through. I often talk about the fact that as a believer, we have dual citizenship, heaven, and for me, America. I'm a citizen of this nation, but I'm a citizen of heaven. And can I say this? It doesn't matter what nation upon this earth you have citizenship in, what matters is that you have citizenship in heaven. There's a whole lot of people that God has allowed us to be surrounded by that need to understand the truth of reconciliation. They need somebody to help them understand how they can be prepared for their final breath. I think about the evangelist, Philip. He's ministering, he's serving the Lord. I mean, he's in Samaria and people are getting saved. It's exciting what's going on. You read in Acts chapter 8, man, it's exciting, God's using Philip. And then God moves Philip and says, I want you to go talk to this Ethiopian eunuch. That Ethiopian eunuch had been in Jerusalem and he's leaving in a chariot and he's reading Isaiah 53. And it's amazing to me that if you look at Acts chapter 8, that what happens in the text of Scripture is that Philip comes up and he gets up into the chariot and he asks this question, understandest thou what thou readest? You know what the eunuch said? How can I, except some man should teach me? You know what the eunuch asked? Who's this man talking about? Is he talking about himself or about somebody else? Isaiah 53 is the great messianic prophecy and the truth of the suffering Savior. I mean, it's an amazing portion of Scripture. And in God's providence, that's what the man's reading. And so what does Philip do? He comes to the same passage and preaches Christ, that he is the Son of God. That eunuch gets saved. But I want you to think about those words when he says, understandest thou what thou readest? How can I? Why did God give us the ministry of reconciliation? He gave it to those that have been reconciled. Why? Because somebody that's been reconciled can tell somebody else how they can be reconciled. Does that make sense? If you've not been reconciled this evening, you can't tell anybody else how to be reconciled. If you're not prepared for your final breath this evening, you can't help anybody else be prepared for their final breath. But God's entrusted to us the ministry of reconciliation. And as I begin to think about Genesis chapter 35, and I read the portion of Scripture, and I read about the birth of Benjamin, and I read about the death of Rachel, and then I read all the names of the sons of Jacob as they're provided for us in that short portion of Scripture, and then I read about the death of Isaac, I'm reminded life and death. The reality this evening is that I don't know, and you don't know either, when we're going to take our final breath. I hope that you can say with confidence, as Paul did, I'm going to straight betwixt two, having a desire to depart, to be with Christ, which is far better. But I hope this evening that we would take seriously the ministry of reconciliation that's been committed to us. That we'd be faithful ambassadors. That we would do our part to try to help people be prepared to take their final breath. Because everywhere we look, people are dying. Four? Every second. How many people are born? Four. How many people die? Two. Think about that. There have been people that have come to me and said, Pastor, I went into work on Monday, and I found out that my coworker passed away over the weekend. It happens, because people die. I read years ago, a story, as best I can tell, it was true. I don't believe everything I read on the internet, and I hope you don't either. But as best I could tell, it was a true story. It was a story about a young girl that lived pretty close to a church, and lived there for years. Her parents, her family did. She was a teenager at this particular point. Her dad and mom were killed. She was struggling. She walked out of that little church on a Sunday and went in for service. She heard the pastor preach. She heard a pastor preach a message similar to what you would hear, perhaps, in our church about Jesus is the only way, Jesus saves, He's a wonderful Savior to me. He loves you, and He died for you. She heard that message. She confronted the pastor after the service, and was so distraught, because she said, if you really believe what you preached this morning, why did you never come to our house and tell us before my parents died? I wouldn't want to be that pastor. I wouldn't want to be that believer, that Christian, that would have to give an answer to that individual. People are dying. People are dying. This evening, I hope that each and every one of us can leave here saying, I know I'm saved. I'm prepared for my final breath. But I hope this evening that each and every one of us would say, God, help me to help others be prepared to take their final breath. Help me to take seriously the ministry of reconciliation, and to understand that God gave me that responsibility because it's only reconciled people that are going to be able to help lost people to be reconciled to God. What a wonderful privilege God has given us, a weighty responsibility. But this evening, there are people that are dying, life and death. How shall they hear without a preacher? Amen? That's what Romans 10 says. associated that truth is to Acts 8. How can I except some man should teach me? Let's pray together. Father, we love you. We thank you for loving us. This portion of Scripture reveals to us the birth of Benjamin and the record of the names of the sons of Jacob, the death of Rachel and the death of Isaac. We're reminded this evening about life and death. The Bible is full of instruction regarding our lives, the analogies of a shadow of a vapor. God, I pray this evening that each and every one of us would be able to say with confidence as Paul did, I know I'm going to go to heaven when I die. I no longer fear death for I've been saved, I've been reconciled. God, I pray that you'd help each and every one of us this evening, myself included, to have a burden, a passion to reach lost people. That we'd take seriously the ministry of reconciliation that's been committed to us. God, we'd be faithful servants, faithful ambassadors to tell a lost and dying world the glorious message of the gospel. In these few moments of invitation, I pray that you'd move and work in our hearts as only you can. I pray that decisions would be made that would please thee. I pray, God, that you'd help us to have an impact on eternity. Well, thank you for all that you'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.760000228881836,
      "text": " chapter number 35 this evening. Genesis chapter number 35, we'll be looking at verses 16-29"
    },
    {
      "id": 1,
      "start": 5.760000228881836,
      "end": 12.239999771118164,
      "text": " this evening as we finish up this 35th chapter here in the book of Genesis. As we conclude"
    },
    {
      "id": 2,
      "start": 12.239999771118164,
      "end": 17.020000457763672,
      "text": " this chapter, we're provided with a number of records. I'll read the text of Scripture"
    },
    {
      "id": 3,
      "start": 17.020000457763672,
      "end": 22.479999542236328,
      "text": " and then we'll deal with those and look at this passage maybe from a little peculiar"
    },
    {
      "id": 4,
      "start": 22.479999542236328,
      "end": 27.979999542236328,
      "text": " type of a perspective this evening. But notice with me, last week as we read the first half"
    },
    {
      "id": 5,
      "start": 27.979999542236328,
      "end": 31.860000610351562,
      "text": " and studied through the first 15 verses of the book of, of the 35th chapter of the book"
    },
    {
      "id": 6,
      "start": 31.860000610351562,
      "end": 36.900001525878906,
      "text": " of Genesis, we dealt with the fact that they were returning to Bethel. And what a wonderful"
    },
    {
      "id": 7,
      "start": 36.900001525878906,
      "end": 42.29999923706055,
      "text": " truth that God gave us in that portion of Scripture. And we talked about the fact that"
    },
    {
      "id": 8,
      "start": 42.29999923706055,
      "end": 47.34000015258789,
      "text": " Jacob of course had been to Bethel before and now this was a return for him. And they"
    },
    {
      "id": 9,
      "start": 47.34000015258789,
      "end": 51.97999954223633,
      "text": " were going there for the purpose of worship. And our God is worthy of worship. And we talked"
    },
    {
      "id": 10,
      "start": 51.97999954223633,
      "end": 56.81999969482422,
      "text": " about the importance of preparing for worship and looked at that passage and what a blessing"
    },
    {
      "id": 11,
      "start": 56.81999969482422,
      "end": 61.939998626708984,
      "text": " it was. And now the Bible tells us beginning in verse number 16 that they journeyed from"
    },
    {
      "id": 12,
      "start": 61.939998626708984,
      "end": 66.0199966430664,
      "text": " Bethel. And so they were there, they worshiped, and now they're departing. And the Bible says"
    },
    {
      "id": 13,
      "start": 66.0199966430664,
      "end": 71.5,
      "text": " this, and there was but a little way to come to Ephrath. And Rachel travailed and she had"
    },
    {
      "id": 14,
      "start": 71.5,
      "end": 77.69999694824219,
      "text": " hard labor. And it came to pass when she was in hard labor that the midwife said unto her,"
    },
    {
      "id": 15,
      "start": 77.69999694824219,
      "end": 84.0,
      "text": " fear not, thou shalt have this son also. And it came to pass as her soul was in departing"
    },
    {
      "id": 16,
      "start": 84.08000183105469,
      "end": 90.76000213623047,
      "text": " for she died, that she called his name Benoni, but his father called him Benjamin. And Rachel"
    },
    {
      "id": 17,
      "start": 90.76000213623047,
      "end": 96.68000030517578,
      "text": " died and was buried in the way of Ephrath which is Bethlehem. And Jacob set a pillar"
    },
    {
      "id": 18,
      "start": 96.68000030517578,
      "end": 101.95999908447266,
      "text": " upon her grave, that is the pillar of Rachel's grave unto this day. And Israel journeyed"
    },
    {
      "id": 19,
      "start": 101.95999908447266,
      "end": 107.4000015258789,
      "text": " and spread his tent beyond the tower of Edar. And it came to pass when Israel dwelt in the"
    },
    {
      "id": 20,
      "start": 107.4000015258789,
      "end": 113.95999908447266,
      "text": " land that Reuben went and lay with Bilhah, his father's concubine. And Israel heard it."
    },
    {
      "id": 21,
      "start": 113.95999908447266,
      "end": 118.72000122070312,
      "text": " The sons of Jacob were twelve, the sons of Leah, Reuben, Jacob's firstborn, and Simeon,"
    },
    {
      "id": 22,
      "start": 118.72000122070312,
      "end": 124.44000244140625,
      "text": " and Levi, and Judah, and Issachar, and Zebulun, the sons of Rachel, Joseph, and Benjamin,"
    },
    {
      "id": 23,
      "start": 124.44000244140625,
      "end": 130.39999389648438,
      "text": " the sons of Bilhah, Rachel's handmaid, Dan, and Naphtali, the sons of Zilpah, Leah's handmaid,"
    },
    {
      "id": 24,
      "start": 130.39999389648438,
      "end": 135.83999633789062,
      "text": " Gad, and Asher. These are the sons of Jacob which were born to him in Paddan Aram. And"
    },
    {
      "id": 25,
      "start": 135.83999633789062,
      "end": 142.0,
      "text": " Jacob came unto Isaac, his father, unto Mamre, unto the city of Arba, which is Hebron, where"
    },
    {
      "id": 26,
      "start": 142.0,
      "end": 150.83999633789062,
      "text": " Abraham and Isaac sojourned. The days of Isaac were 104 score years, 180 years old. Wow."
    },
    {
      "id": 27,
      "start": 150.83999633789062,
      "end": 156.63999938964844,
      "text": " Verse 29, And Isaac gave up the ghost, and died, and was gathered unto his people, being"
    },
    {
      "id": 28,
      "start": 156.63999938964844,
      "end": 163.44000244140625,
      "text": " old and full of days. And his sons Esau and Jacob buried him. Of course you'll remember"
    },
    {
      "id": 29,
      "start": 163.44000244140625,
      "end": 170.5399932861328,
      "text": " that after Jacob received the vision from the Lord to depart from Paddan Aram and return,"
    },
    {
      "id": 30,
      "start": 170.5399932861328,
      "end": 176.4600067138672,
      "text": " we read of the reunion between Jacob and Esau. And now we see this reference for after that"
    },
    {
      "id": 31,
      "start": 176.4600067138672,
      "end": 181.1199951171875,
      "text": " great reunion and we read of all of those things that transpired. There was obviously"
    },
    {
      "id": 32,
      "start": 181.1199951171875,
      "end": 186.22000122070312,
      "text": " a departure and they were in their different separate places. But as you end the 35th chapter"
    },
    {
      "id": 33,
      "start": 186.22000122070312,
      "end": 191.22000122070312,
      "text": " and you see once again a reference to Jacob and Esau, they are together and they are burying"
    },
    {
      "id": 34,
      "start": 191.22000122070312,
      "end": 195.3800048828125,
      "text": " their father Isaac. But as we look at this portion of Scripture in these verses that"
    },
    {
      "id": 35,
      "start": 195.3800048828125,
      "end": 200.74000549316406,
      "text": " are before us this evening, we really see the record of four events that are provided"
    },
    {
      "id": 36,
      "start": 200.74000549316406,
      "end": 206.25999450683594,
      "text": " for us. Number one, we see the record of the birth of Benjamin. And we see that in verses"
    },
    {
      "id": 37,
      "start": 206.25999450683594,
      "end": 213.4199981689453,
      "text": " 16 through 18. We have the record of Jacob's sons in verses 23 through 26. That was a question"
    },
    {
      "id": 38,
      "start": 213.4199981689453,
      "end": 218.5,
      "text": " from the teens on the teen takeover, name the sons of Jacob, right? And if you, there's"
    },
    {
      "id": 39,
      "start": 218.5,
      "end": 222.82000732421875,
      "text": " a couple of places you can go and you can see the list. And here we find that in just"
    },
    {
      "id": 40,
      "start": 222.82000732421875,
      "end": 228.05999755859375,
      "text": " a few verses of Scripture, God gives us the names of the sons of Jacob. We find that the"
    },
    {
      "id": 41,
      "start": 228.05999755859375,
      "end": 233.5800018310547,
      "text": " text of Scripture before us records for us the death of Rachel. And we read that in verses"
    },
    {
      "id": 42,
      "start": 233.5800018310547,
      "end": 238.6999969482422,
      "text": " 18 and in verse number 19. And then we find that the Bible in this portion of Scripture"
    },
    {
      "id": 43,
      "start": 238.6999969482422,
      "end": 245.05999755859375,
      "text": " reveals to us the death of Isaac in verses 27 through 29. And so we read of the birth"
    },
    {
      "id": 44,
      "start": 245.10000610351562,
      "end": 251.6199951171875,
      "text": " of Benjamin, all of the names of Jacob's sons, the death of Rachel and the death of Isaac."
    },
    {
      "id": 45,
      "start": 251.6199951171875,
      "end": 258.6199951171875,
      "text": " And thus I have titled the message this evening, Life and Death. Life and Death. You think"
    },
    {
      "id": 46,
      "start": 259.94000244140625,
      "end": 265.05999755859375,
      "text": " about all the sons of Jacob that are mentioned in verses 23 through 26. You can go to previous"
    },
    {
      "id": 47,
      "start": 265.05999755859375,
      "end": 270.5400085449219,
      "text": " portions of Scripture and you can read of the record of their birth. And here does not"
    },
    {
      "id": 48,
      "start": 270.5400085449219,
      "end": 275.8599853515625,
      "text": " record for us their birth specifically, only Benjamin's birth is recorded here in this"
    },
    {
      "id": 49,
      "start": 275.8599853515625,
      "end": 280.8999938964844,
      "text": " portion of Scripture. But you are referencing and understanding that each of these sons"
    },
    {
      "id": 50,
      "start": 280.8999938964844,
      "end": 286.1400146484375,
      "text": " of Jacob were born and you can read of that. It's interesting that in these few verses"
    },
    {
      "id": 51,
      "start": 286.1400146484375,
      "end": 292.4599914550781,
      "text": " of Scripture, we read of life and we read of death. Let me begin to think about life"
    },
    {
      "id": 52,
      "start": 292.4599914550781,
      "end": 298.3800048828125,
      "text": " and begin to think about that thought from this portion of Scripture this evening. In"
    },
    {
      "id": 53,
      "start": 298.9800109863281,
      "end": 305.9800109863281,
      "text": " 2022 globally, so not just the United States but globally, in 2022 there were about 67"
    },
    {
      "id": 54,
      "start": 305.9800109863281,
      "end": 317.9800109863281,
      "text": " million people that died and 140 million that were born. Life and death. 140 million born,"
    },
    {
      "id": 55,
      "start": 317.9800109863281,
      "end": 326.9800109863281,
      "text": " 67 million died. So every single second, the exact math based on those estimate numbers"
    },
    {
      "id": 56,
      "start": 327.0199890136719,
      "end": 336.29998779296875,
      "text": " is that there are 4.4 births every second. Globally. 4.4 people are born, so we'd say"
    },
    {
      "id": 57,
      "start": 336.29998779296875,
      "end": 340.5799865722656,
      "text": " 4 people, right, because we're not having a partial, right, but you understand the math"
    },
    {
      "id": 58,
      "start": 340.5799865722656,
      "end": 349.5799865722656,
      "text": " exactly. But every second, 4 people are born and 2.1 people, so we'd say 2 people, die."
    },
    {
      "id": 59,
      "start": 350.2200012207031,
      "end": 358.7799987792969,
      "text": " So you think about that. Seconds pass so quickly. But every second that passes represents 4"
    },
    {
      "id": 60,
      "start": 358.7799987792969,
      "end": 366.05999755859375,
      "text": " births and 2 deaths. Life and death. We're familiar with that. We, in fact, often times"
    },
    {
      "id": 61,
      "start": 366.05999755859375,
      "end": 371.82000732421875,
      "text": " we don't like talking about death. In fact, there's a big word, a phobia of dying, the"
    },
    {
      "id": 62,
      "start": 371.82000732421875,
      "end": 377.17999267578125,
      "text": " fear of dying, an anxiety of dying, and you talk to some people and they have a fear of"
    },
    {
      "id": 63,
      "start": 377.260009765625,
      "end": 383.1000061035156,
      "text": " dying. The uncertainty. The fear. In fact, the book of Hebrews talks about, in Hebrews"
    },
    {
      "id": 64,
      "start": 383.1000061035156,
      "end": 386.5400085449219,
      "text": " chapter number 2, you don't need to turn there, but in Hebrews chapter number 2 the Bible"
    },
    {
      "id": 65,
      "start": 386.5400085449219,
      "end": 391.3399963378906,
      "text": " talks about these that had this fear of death and perhaps at one point in your life you"
    },
    {
      "id": 66,
      "start": 391.3399963378906,
      "end": 397.17999267578125,
      "text": " would say, I had a fear of dying. The uncertainty. But we find that the Bible says in Hebrews"
    },
    {
      "id": 67,
      "start": 397.17999267578125,
      "end": 402.260009765625,
      "text": " 2 and verse 14, for as much then as the children are partakers of flesh and blood, he also"
    },
    {
      "id": 68,
      "start": 402.260009765625,
      "end": 408.8999938964844,
      "text": " himself likewise took part of the same, that through death he might destroy him that had"
    },
    {
      "id": 69,
      "start": 408.8999938964844,
      "end": 415.5799865722656,
      "text": " the power of death, that is the devil, and it continues and says this in verse 15, and"
    },
    {
      "id": 70,
      "start": 415.5799865722656,
      "end": 425.94000244140625,
      "text": " deliver them who through fear of death were all their lifetime subject to bondage. I hope"
    },
    {
      "id": 71,
      "start": 425.94000244140625,
      "end": 432.1199951171875,
      "text": " this evening that you can say, I do not fear death. In saying that you do not fear death,"
    },
    {
      "id": 72,
      "start": 432.1199951171875,
      "end": 436.2799987792969,
      "text": " that does not necessarily mean that you have a death sentence, but it means that you don't"
    },
    {
      "id": 73,
      "start": 436.2799987792969,
      "end": 443.20001220703125,
      "text": " fear death. It means that you have no fear of that final breath here upon this earth."
    },
    {
      "id": 74,
      "start": 443.20001220703125,
      "end": 450.3599853515625,
      "text": " The life expectancy globally, according to some statistics that I looked at, globally"
    },
    {
      "id": 75,
      "start": 450.3599853515625,
      "end": 457.239990234375,
      "text": " the life expectancy is 73. In the United States of America, the life expectancy currently"
    },
    {
      "id": 76,
      "start": 457.239990234375,
      "end": 463.55999755859375,
      "text": " is about 76 years old. And for some of us that means we have borrowed time, and for"
    },
    {
      "id": 77,
      "start": 463.55999755859375,
      "end": 468.0,
      "text": " some of us that means we have several years, and some have a whole lot of years if you"
    },
    {
      "id": 78,
      "start": 468.0,
      "end": 473.3599853515625,
      "text": " look at that life expectancy. But we understand the Bible teaches us that we don't know when"
    },
    {
      "id": 79,
      "start": 473.3599853515625,
      "end": 479.0,
      "text": " we're going to die. You can look at the statistics and you can look at the life expectancy, but"
    },
    {
      "id": 80,
      "start": 479.0,
      "end": 484.4800109863281,
      "text": " the reality is that we do not know the time of our departure. We understand that Paul"
    },
    {
      "id": 81,
      "start": 484.4800109863281,
      "end": 489.32000732421875,
      "text": " would say, the time of my departure is at hand. We understand that Peter would say that"
    },
    {
      "id": 82,
      "start": 489.32000732421875,
      "end": 494.0799865722656,
      "text": " I must put off this, my tabernacle. And we understand that there was an understanding"
    },
    {
      "id": 83,
      "start": 494.0799865722656,
      "end": 499.760009765625,
      "text": " and an acknowledgement amongst those individuals, those saints of God, that death was soon for"
    },
    {
      "id": 84,
      "start": 499.760009765625,
      "end": 502.3999938964844,
      "text": " them. God had revealed it to them."
    },
    {
      "id": 85,
      "start": 502.3999938964844,
      "end": 507.4800109863281,
      "text": " As we begin to think about this passage of Scripture and the records that are provided"
    },
    {
      "id": 86,
      "start": 507.4800109863281,
      "end": 513.0399780273438,
      "text": " to us of life and death, I want us to consider this evening some biblical truth. Turn to"
    },
    {
      "id": 87,
      "start": 513.0399780273438,
      "end": 517.239990234375,
      "text": " the book of Ecclesiastes, if you will, and we're going to look at a number of passages,"
    },
    {
      "id": 88,
      "start": 517.239990234375,
      "end": 520.5599975585938,
      "text": " and then I'm just going to ask two questions this evening through the message, but turn"
    },
    {
      "id": 89,
      "start": 520.5599975585938,
      "end": 527.52001953125,
      "text": " to the book of Ecclesiastes, if you will. Psalms, Proverbs, Ecclesiastes, and the third"
    },
    {
      "id": 90,
      "start": 527.52001953125,
      "end": 539.3200073242188,
      "text": " chapter, Ecclesiastes chapter number three. It's good to hear pages turning. Somebody"
    },
    {
      "id": 91,
      "start": 539.3200073242188,
      "end": 543.8800048828125,
      "text": " sent me an email yesterday, side note, we'll chase the rabbit while you're turning pages,"
    },
    {
      "id": 92,
      "start": 543.8800048828125,
      "end": 550.52001953125,
      "text": " and they said this, they said, pastor, what would we do if we didn't have a Bible? I'm"
    },
    {
      "id": 93,
      "start": 550.52001953125,
      "end": 555.0800170898438,
      "text": " glad we have a Bible. Amen? Because I really don't want to think about that. I'm glad we"
    },
    {
      "id": 94,
      "start": 555.0800170898438,
      "end": 560.1199951171875,
      "text": " have a Bible. It's a wonderful thing to hear pages of Bibles turning."
    },
    {
      "id": 95,
      "start": 560.1199951171875,
      "end": 564.0,
      "text": " Verse one of Ecclesiastes three, the Bible says, to everything there is a season and"
    },
    {
      "id": 96,
      "start": 564.0,
      "end": 569.4400024414062,
      "text": " a time to every purpose under the heaven. Notice what it says, a time to be born and"
    },
    {
      "id": 97,
      "start": 569.4400024414062,
      "end": 573.1199951171875,
      "text": " a time to die, a time to plant and a time to pluck up that which is planted, a time"
    },
    {
      "id": 98,
      "start": 573.1199951171875,
      "end": 576.9199829101562,
      "text": " to kill and a time to heal, a time to break down and a time to build up, a time to weep"
    },
    {
      "id": 99,
      "start": 576.9199829101562,
      "end": 581.719970703125,
      "text": " and a time to laugh, a time to mourn and a time to dance, a time to cast away stones"
    },
    {
      "id": 100,
      "start": 581.719970703125,
      "end": 586.3599853515625,
      "text": " and a time to gather stones together, a time to embrace and a time to refrain from embracing."
    },
    {
      "id": 101,
      "start": 586.3599853515625,
      "end": 589.9600219726562,
      "text": " And you get the idea, and I'm not going to continue reading the passage, because I want"
    },
    {
      "id": 102,
      "start": 589.9600219726562,
      "end": 596.2000122070312,
      "text": " you to notice the first phrase of verse two, a time to be born and a time to die, a time"
    },
    {
      "id": 103,
      "start": 596.2000122070312,
      "end": 600.0,
      "text": " to be born and a time to die. For all of us here, we know the time of our"
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 607.920000076294,
      "text": " birth, right? We know. You have a record of a live birth, and we have a birth certificate,"
    },
    {
      "id": 1,
      "start": 607.920000076294,
      "end": 612.6400003433228,
      "text": " and you understand that you have a birthday. Somebody told me, I won't mention who, but they"
    },
    {
      "id": 2,
      "start": 612.6400003433228,
      "end": 616.079999923706,
      "text": " have a birthday coming up in the month of April, and they said, just so you know, Pastor, this is"
    },
    {
      "id": 3,
      "start": 616.079999923706,
      "end": 620.3999996185303,
      "text": " the last year I'm celebrating my birthday for a little while. And I understand. I said, well,"
    },
    {
      "id": 4,
      "start": 620.3999996185303,
      "end": 624.9599990844727,
      "text": " that's because you're turning 39, and you just don't want to hit that 40. But the reality is"
    },
    {
      "id": 5,
      "start": 624.9599990844727,
      "end": 630.6399993896484,
      "text": " that we know the time of our birth. What we do not know is the time of our death."
    },
    {
      "id": 6,
      "start": 631.6000003814697,
      "end": 637.5999984741211,
      "text": " The Bible says a time to be born and a time to die. In chapter number seven of the book of"
    },
    {
      "id": 7,
      "start": 637.5999984741211,
      "end": 644.6399993896484,
      "text": " Ecclesiastes, notice what the Bible says in verse number two. Here in Ecclesiastes 7, in verse"
    },
    {
      "id": 8,
      "start": 644.6399993896484,
      "end": 652.3199996948242,
      "text": " number two, the Bible says it is better to go to the house of mourning than to go to the house of"
    },
    {
      "id": 9,
      "start": 652.3199996948242,
      "end": 662.7999992370605,
      "text": " feasting. Notice why that statement is made about which is better. It says, for that is the end"
    },
    {
      "id": 10,
      "start": 663.439998626709,
      "end": 668.879997253418,
      "text": " of all men, and the living will lay it to his heart. You know, something interesting about"
    },
    {
      "id": 11,
      "start": 669.6800003051758,
      "end": 674.4000015258789,
      "text": " funerals, the house of mourning. There's something that's interesting about going to"
    },
    {
      "id": 12,
      "start": 675.2799987792969,
      "end": 681.7600021362305,
      "text": " a funeral, a celebration of life, a memorial service, whatever you want to call it."
    },
    {
      "id": 13,
      "start": 681.7600021362305,
      "end": 688.0,
      "text": " There's something that's interesting about that experience is it's a sobering time. It's a time"
    },
    {
      "id": 14,
      "start": 688.0,
      "end": 694.2399978637695,
      "text": " of recognizing and understanding that our life is going to come to an end. It's the end of all men."
    },
    {
      "id": 15,
      "start": 695.120002746582,
      "end": 698.8000030517578,
      "text": " And that's what the wise man says here in the book of Ecclesiastes under the inspiration of"
    },
    {
      "id": 16,
      "start": 698.8000030517578,
      "end": 704.879997253418,
      "text": " the Holy Spirit of God. Notice what Job says over in Job chapter 21. And this portion of"
    },
    {
      "id": 17,
      "start": 704.879997253418,
      "end": 711.6800003051758,
      "text": " Scripture is quite interesting with regard to the observation that is made here in this reply to"
    },
    {
      "id": 18,
      "start": 711.6800003051758,
      "end": 717.8399963378906,
      "text": " one of the friends. And Job is speaking here in Job chapter 21. And notice what he says about this"
    },
    {
      "id": 19,
      "start": 717.8399963378906,
      "end": 726.4000015258789,
      "text": " idea of death. In Job chapter 21, beginning in verse number 23, the Bible says, One dieth in"
    },
    {
      "id": 20,
      "start": 726.4000015258789,
      "end": 732.4799957275391,
      "text": " his full strength, being holy at ease and quiet. His breasts are full of milk, and his bones are"
    },
    {
      "id": 21,
      "start": 732.4799957275391,
      "end": 737.4400024414062,
      "text": " moistened with marrow. And another dieth in the bitterness of his soul, and never eateth with"
    },
    {
      "id": 22,
      "start": 737.4400024414062,
      "end": 742.0800018310547,
      "text": " pleasure. They shall lie down alike in the dust, and the worms shall cover them."
    },
    {
      "id": 23,
      "start": 744.6399993896484,
      "end": 750.4799957275391,
      "text": " We're going to die one day. We're all going to die. We see life and death. We see in the portion of"
    },
    {
      "id": 24,
      "start": 750.4799957275391,
      "end": 757.2799987792969,
      "text": " Scripture this evening the record of the birth of Benjamin, the names of all of the sons of Jacob."
    },
    {
      "id": 25,
      "start": 757.2799987792969,
      "end": 763.1999969482422,
      "text": " But we see the death of Rachel, and we see the death of Isaac, 180 years old. I mean, that's a"
    },
    {
      "id": 26,
      "start": 763.1999969482422,
      "end": 771.2799987792969,
      "text": " long life. But it came to an end. All the sons of Jacob, though all of their deaths are not recorded"
    },
    {
      "id": 27,
      "start": 771.2799987792969,
      "end": 779.2799987792969,
      "text": " for us within the pages of Scripture, we understand they all died. Hebrews 9 and verse 27 says it this"
    },
    {
      "id": 28,
      "start": 779.2799987792969,
      "end": 787.1199951171875,
      "text": " way, And as it is appointed unto men once to die, but after this the judgment. I've often said this,"
    },
    {
      "id": 29,
      "start": 787.1199951171875,
      "end": 790.9600067138672,
      "text": " and I've understood, as you think about the truth of that verse of Scripture, that there's an"
    },
    {
      "id": 30,
      "start": 790.9600067138672,
      "end": 796.3999938964844,
      "text": " appointment that we have with death. And there's nothing I can do to change it, cancel it."
    },
    {
      "id": 31,
      "start": 798.3999938964844,
      "end": 807.4400024414062,
      "text": " I don't know when it is. Neither do you. Think about how James thinks about life. He says,"
    },
    {
      "id": 32,
      "start": 807.4400024414062,
      "end": 815.3600006103516,
      "text": " what is your life? It's but a vapor that appeareth for a little time and then vanisheth away."
    },
    {
      "id": 33,
      "start": 815.9199981689453,
      "end": 821.1199951171875,
      "text": " In James 4 and verse number 14, we're understanding of what a vapor is, and you begin to think about"
    },
    {
      "id": 34,
      "start": 821.1199951171875,
      "end": 826.6399993896484,
      "text": " that imagery that is being used, and you think about the boiling pot, and if you think about"
    },
    {
      "id": 35,
      "start": 826.6399993896484,
      "end": 831.4400024414062,
      "text": " that analogy of seeing the vapor, and it just appears for a little while, and then it's gone."
    },
    {
      "id": 36,
      "start": 832.0,
      "end": 837.6000061035156,
      "text": " It's gone. And the reality is that as we begin to think about life, and we think about death,"
    },
    {
      "id": 37,
      "start": 837.6000061035156,
      "end": 842.0800018310547,
      "text": " and no matter how many years we might live here upon the earth, the reality is that it's just"
    },
    {
      "id": 38,
      "start": 842.0800018310547,
      "end": 850.0,
      "text": " about that long in light of eternity. I think about what the psalmist said, turn to Psalm 102,"
    },
    {
      "id": 39,
      "start": 850.0,
      "end": 855.3600006103516,
      "text": " if you will. We find that James, in James 4 and 14, references life, and he compares it. He uses"
    },
    {
      "id": 40,
      "start": 855.3600006103516,
      "end": 860.0,
      "text": " the analogy that our life is but a vapor that appeareth for a little time. The psalmist here"
    },
    {
      "id": 41,
      "start": 860.0,
      "end": 869.6000061035156,
      "text": " in Psalm 102, look what he says about his life, his days. In Psalm 102, in verse number 11,"
    },
    {
      "id": 42,
      "start": 870.1600036621094,
      "end": 871.5199890136719,
      "text": " the psalmist says this,"
    },
    {
      "id": 43,
      "start": 871.5199890136719,
      "end": 879.3599853515625,
      "text": " My days are like a shadow that declineth, and I am withered like grass."
    },
    {
      "id": 44,
      "start": 880.1600036621094,
      "end": 887.2000122070312,
      "text": " You ever see a shadow? Sure you have. You look out in the evening as the sun is setting, and"
    },
    {
      "id": 45,
      "start": 887.2000122070312,
      "end": 892.0799865722656,
      "text": " you begin to see that shadow, and it grows, and then before long, the shadow's gone. Why? Because"
    },
    {
      "id": 46,
      "start": 892.7999877929688,
      "end": 898.0799865722656,
      "text": " the sun is set. You begin to think about shadows, and light, and all that takes place, and the"
    },
    {
      "id": 47,
      "start": 898.0799865722656,
      "end": 904.6400146484375,
      "text": " psalmist says, My days, my life is like a shadow that declineth. But notice what it says in Psalm"
    },
    {
      "id": 48,
      "start": 904.6400146484375,
      "end": 912.4800109863281,
      "text": " 90, a familiar passage of Scripture, a psalm actually that's ascribed to Moses. In Psalm 90,"
    },
    {
      "id": 49,
      "start": 915.5199890136719,
      "end": 922.9599914550781,
      "text": " the Bible will speak to us about our lives. Beginning in verse number 9 of this psalm,"
    },
    {
      "id": 50,
      "start": 923.760009765625,
      "end": 932.3200073242188,
      "text": " the Bible says this, For all our days are passed away in thy wrath. Notice the statement,"
    },
    {
      "id": 51,
      "start": 932.3200073242188,
      "end": 939.4400024414062,
      "text": " we spend our years as a tale that is told. I preached a message several years ago from that"
    },
    {
      "id": 52,
      "start": 939.4400024414062,
      "end": 945.8399963378906,
      "text": " thought at the end of verse number 9. I believe it was a last service of a particular year as we were"
    },
    {
      "id": 53,
      "start": 945.8399963378906,
      "end": 949.760009765625,
      "text": " entering into a new year, and I asked this question as I preached from this portion of"
    },
    {
      "id": 54,
      "start": 949.760009765625,
      "end": 956.3200073242188,
      "text": " Scripture, what's your story? Because we spend our years as a tale that is told."
    },
    {
      "id": 55,
      "start": 957.9200134277344,
      "end": 964.1600036621094,
      "text": " For each of us here this evening, there's a chapter in our book. I don't know what page it is,"
    },
    {
      "id": 56,
      "start": 964.1600036621094,
      "end": 969.1199951171875,
      "text": " and I don't know when the end comes. But I've read a lot of books, and I'm sure you've read"
    },
    {
      "id": 57,
      "start": 969.1199951171875,
      "end": 975.8399963378906,
      "text": " a lot of books as well, and there comes an end to the book, and there's going to come an end to our"
    },
    {
      "id": 58,
      "start": 976.0799865722656,
      "end": 981.2799987792969,
      "text": " and there's going to come an end to our lives. And we see that the Bible says that we spend our"
    },
    {
      "id": 59,
      "start": 981.2799987792969,
      "end": 986.7999877929688,
      "text": " years as a tale that is told. Notice it says this in verse number 10, The days of our years are"
    },
    {
      "id": 60,
      "start": 986.7999877929688,
      "end": 992.3999938964844,
      "text": " threescore years and ten, seventy. And if by reason of strength they be fourscore years,"
    },
    {
      "id": 61,
      "start": 992.3999938964844,
      "end": 999.4400024414062,
      "text": " eighty, it is their strength, labor, and sorrow, for it is soon cut off, and we fly away."
    },
    {
      "id": 62,
      "start": 1000.6400146484375,
      "end": 1004.6400146484375,
      "text": " Who knoweth the power of thine anger, even according to thy fear, so is thy wrath. Notice"
    },
    {
      "id": 63,
      "start": 1004.6400146484375,
      "end": 1011.4400024414062,
      "text": " verse 12, So teach us to number our days, that we may apply our hearts unto wisdom."
    },
    {
      "id": 64,
      "start": 1013.5199890136719,
      "end": 1020.5599975585938,
      "text": " Isaiah was called of God as a servant of the Lord. He prophesied faithfully."
    },
    {
      "id": 65,
      "start": 1021.3599853515625,
      "end": 1028.4800109863281,
      "text": " But in one particular account in the book of Isaiah, Isaiah is given the specific task"
    },
    {
      "id": 66,
      "start": 1029.1199951171875,
      "end": 1035.2799987792969,
      "text": " of delivering a message to King Hezekiah. That message is recorded for us in Isaiah 38 in verse"
    },
    {
      "id": 67,
      "start": 1035.2799987792969,
      "end": 1044.0799865722656,
      "text": " number 1, and here's what God says through His messenger, Thus saith the Lord, Set thine house"
    },
    {
      "id": 68,
      "start": 1044.0799865722656,
      "end": 1052.7200012207031,
      "text": " in order, for thou shalt die and not live. Now if you're familiar with the life of Hezekiah"
    },
    {
      "id": 69,
      "start": 1052.7200012207031,
      "end": 1058.0799865722656,
      "text": " in that particular announcement from the prophet of God, you understand that Hezekiah weeps."
    },
    {
      "id": 70,
      "start": 1059.8399963378906,
      "end": 1066.3200073242188,
      "text": " You understand that God answers and extends his life by 15 years. But even in extending"
    },
    {
      "id": 71,
      "start": 1066.3200073242188,
      "end": 1072.5599975585938,
      "text": " his life by 15 years, you know what happened to Hezekiah one day? He died. He died."
    },
    {
      "id": 72,
      "start": 1073.5199890136719,
      "end": 1079.6000061035156,
      "text": " We need to think about this passage in Genesis chapter 35 and thinking about life and death and"
    },
    {
      "id": 73,
      "start": 1079.6000061035156,
      "end": 1084.3200073242188,
      "text": " considering the truth that is before us and looking at some statistics, but then also looking"
    },
    {
      "id": 74,
      "start": 1084.3200073242188,
      "end": 1092.3200073242188,
      "text": " and considering once again afresh, if you will, the truth of God's Word with regard to life"
    },
    {
      "id": 75,
      "start": 1093.2000122070312,
      "end": 1100.5599975585938,
      "text": " and death. And two simple questions this evening for the message, and here's the first."
    },
    {
      "id": 76,
      "start": 1100.5599975585938,
      "end": 1110.4800109863281,
      "text": " First, are you prepared to take your final breath? Are you personally prepared to take"
    },
    {
      "id": 77,
      "start": 1110.4800109863281,
      "end": 1118.6400146484375,
      "text": " your final breath? We don't know the time of our departure. If we were to take a trip today to"
    },
    {
      "id": 78,
      "start": 1119.3599853515625,
      "end": 1122.6400146484375,
      "text": " this evening, we were to load up in our vehicles and we were to visit"
    },
    {
      "id": 79,
      "start": 1123.2000122070312,
      "end": 1132.5599975585938,
      "text": " over to some local cemetery, graveyard, and we begin to walk through the tombstones and begin to"
    },
    {
      "id": 80,
      "start": 1132.5599975585938,
      "end": 1141.0399780273438,
      "text": " walk through the property, one thing that you would find is a variety of ages. You would not"
    },
    {
      "id": 81,
      "start": 1141.0399780273438,
      "end": 1146.5599975585938,
      "text": " find consistency among all of the headstones that all of these people died at a certain age."
    },
    {
      "id": 82,
      "start": 1147.4400024414062,
      "end": 1153.52001953125,
      "text": " No, you'll find some that died way older and some that died way younger."
    },
    {
      "id": 83,
      "start": 1155.5999755859375,
      "end": 1161.760009765625,
      "text": " Sometimes when a young person dies, an individual will make an assessment, will make a comment of"
    },
    {
      "id": 84,
      "start": 1161.760009765625,
      "end": 1166.719970703125,
      "text": " their life was cut short. You've heard somebody say that, no doubt."
    },
    {
      "id": 85,
      "start": 1168.0800170898438,
      "end": 1171.6799926757812,
      "text": " And the question this evening is, are you prepared to take your final breath?"
    },
    {
      "id": 86,
      "start": 1172.6400146484375,
      "end": 1177.9199829101562,
      "text": " In recent days, we've read of a number of calamities in our nation where people's lives"
    },
    {
      "id": 87,
      "start": 1177.9199829101562,
      "end": 1183.52001953125,
      "text": " were lost. We mentioned a couple of those this morning in our Sunday school hour. You think"
    },
    {
      "id": 88,
      "start": 1183.52001953125,
      "end": 1188.9600219726562,
      "text": " about the tragedy that took place in Tennessee. By the way, I read this afternoon that there was"
    },
    {
      "id": 89,
      "start": 1188.9600219726562,
      "end": 1194.0800170898438,
      "text": " a shooting just here in Northern Virginia at a mall up in what, Leesburg, is that where it was?"
    },
    {
      "id": 90,
      "start": 1194.0800170898438,
      "end": 1198.9600219726562,
      "text": " Tyson's at the Tyson's Mall, Dulles, Dulles Shopping Center this afternoon, active shooting"
    },
    {
      "id": 91,
      "start": 1198.9600219726562,
      "end": 1199.9199829101562,
      "text": " situation."
    },
    {
      "id": 0,
      "start": 1199.9199829101562,
      "end": 1204.8799829483032,
      "text": " It seems like it's recurring, right?"
    },
    {
      "id": 1,
      "start": 1204.8799829483032,
      "end": 1206.3199830055237,
      "text": " It's more and more."
    },
    {
      "id": 2,
      "start": 1206.3199830055237,
      "end": 1209.6599826812744,
      "text": " You're reading of this."
    },
    {
      "id": 3,
      "start": 1209.6599826812744,
      "end": 1214.1599826812744,
      "text": " Military personnel serving the U.S. Army go out this week for some training mission in"
    },
    {
      "id": 4,
      "start": 1214.1599826812744,
      "end": 1222.8399829864502,
      "text": " the evening and two Black Hawk helicopters crash, nine people perish, tornadoes."
    },
    {
      "id": 5,
      "start": 1222.8399829864502,
      "end": 1225.43998336792,
      "text": " We've seen the devastation."
    },
    {
      "id": 6,
      "start": 1225.43998336792,
      "end": 1229.879981994629,
      "text": " They don't even know how many people have died in all of those tornadoes."
    },
    {
      "id": 7,
      "start": 1229.879981994629,
      "end": 1234.9599838256836,
      "text": " You think about earthquakes that have taken place and lives that have perished."
    },
    {
      "id": 8,
      "start": 1234.9599838256836,
      "end": 1239.8399810791016,
      "text": " And some of those, many of those instances, I mean, car crashes and fatalities, those"
    },
    {
      "id": 9,
      "start": 1239.8399810791016,
      "end": 1245.9599838256836,
      "text": " people did not know that today was when I'm going to take my final breath."
    },
    {
      "id": 10,
      "start": 1245.9599838256836,
      "end": 1248.599983215332,
      "text": " They didn't have that understanding."
    },
    {
      "id": 11,
      "start": 1248.599983215332,
      "end": 1252.7599830627441,
      "text": " In this evening, I begin to think about this truth and looking at this portion of Scripture"
    },
    {
      "id": 12,
      "start": 1252.7599830627441,
      "end": 1256.43998336792,
      "text": " and God impressed this truth and this thought upon my heart."
    },
    {
      "id": 13,
      "start": 1256.43998336792,
      "end": 1260.6799812316895,
      "text": " And the reality is we must be prepared to take our final breath."
    },
    {
      "id": 14,
      "start": 1260.6799812316895,
      "end": 1262.7199821472168,
      "text": " It's absolutely essential."
    },
    {
      "id": 15,
      "start": 1262.7199821472168,
      "end": 1267.7999801635742,
      "text": " And again, when we answer the question that I do not fear dying, when I answer the question"
    },
    {
      "id": 16,
      "start": 1267.7999801635742,
      "end": 1272.3999862670898,
      "text": " that I'm prepared for death, it does not necessarily mean that I have a death sentence, that somebody"
    },
    {
      "id": 17,
      "start": 1272.3999862670898,
      "end": 1276.4399795532227,
      "text": " needs to put us on some kind of special watch because we're going to do harm to ourselves."
    },
    {
      "id": 18,
      "start": 1276.4399795532227,
      "end": 1281.1599807739258,
      "text": " No, it just means that I know that I'm going to heaven."
    },
    {
      "id": 19,
      "start": 1281.1599807739258,
      "end": 1282.1599807739258,
      "text": " Notice what Paul says."
    },
    {
      "id": 20,
      "start": 1282.1599807739258,
      "end": 1284.1199798583984,
      "text": " Look over to the book of Philippians, if you will."
    },
    {
      "id": 21,
      "start": 1285.1199798583984,
      "end": 1289.599983215332,
      "text": " I want you to consider the familiar words of the Apostle Paul as he's writing to these"
    },
    {
      "id": 22,
      "start": 1289.599983215332,
      "end": 1298.379981994629,
      "text": " believers in Philippi and he shares with them some truth that I think is not only impactful"
    },
    {
      "id": 23,
      "start": 1298.379981994629,
      "end": 1304.379981994629,
      "text": " for the believers in Philippi, but no doubt impactful for believers through the centuries."
    },
    {
      "id": 24,
      "start": 1304.379981994629,
      "end": 1308.9599838256836,
      "text": " As we've read these verses of Scripture and we've understood what is being communicated"
    },
    {
      "id": 25,
      "start": 1308.9599838256836,
      "end": 1316.8199844360352,
      "text": " and we can rejoice in Paul's preparation and his understanding of being ready to die."
    },
    {
      "id": 26,
      "start": 1316.8199844360352,
      "end": 1320.47998046875,
      "text": " Notice what Paul says in Philippians 1 in verse 21."
    },
    {
      "id": 27,
      "start": 1320.47998046875,
      "end": 1327.1199798583984,
      "text": " For to me to live is Christ and to die is gain."
    },
    {
      "id": 28,
      "start": 1327.1199798583984,
      "end": 1332.47998046875,
      "text": " And then he says this, but if I live in the flesh, this is the fruit of my labor, yet"
    },
    {
      "id": 29,
      "start": 1332.47998046875,
      "end": 1334.2799835205078,
      "text": " what I shall choose I won't not."
    },
    {
      "id": 30,
      "start": 1334.8799896240234,
      "end": 1340.3999786376953,
      "text": " Notice what he says in verse 23, for I am in a straight betwixt two."
    },
    {
      "id": 31,
      "start": 1340.3999786376953,
      "end": 1345.3599853515625,
      "text": " What was it that caused this situation that Paul is referencing?"
    },
    {
      "id": 32,
      "start": 1345.3599853515625,
      "end": 1347.719985961914,
      "text": " You've ever heard somebody say, I'm between a rock and a hard place."
    },
    {
      "id": 33,
      "start": 1347.719985961914,
      "end": 1353.4399871826172,
      "text": " I've heard that saying as a child many times and he says, I'm in a straight betwixt two."
    },
    {
      "id": 34,
      "start": 1353.4399871826172,
      "end": 1355.3999786376953,
      "text": " Notice what the situation is."
    },
    {
      "id": 35,
      "start": 1355.3999786376953,
      "end": 1367.5999755859375,
      "text": " Having a desire to depart and to be with Christ, which is far better."
    },
    {
      "id": 36,
      "start": 1367.5999755859375,
      "end": 1371.5999755859375,
      "text": " You read 1 Corinthians 15, the wonderful chapter on the resurrection."
    },
    {
      "id": 37,
      "start": 1371.5999755859375,
      "end": 1376.0399780273438,
      "text": " The Bible tells us that this mortal shall put on immortality."
    },
    {
      "id": 38,
      "start": 1376.0399780273438,
      "end": 1379.739990234375,
      "text": " The Bible tells us that this corruption shall put on incorruption."
    },
    {
      "id": 39,
      "start": 1379.739990234375,
      "end": 1382.9399871826172,
      "text": " In the moment, the twinkling of an eye, I'm so thankful."
    },
    {
      "id": 40,
      "start": 1382.9399871826172,
      "end": 1386.4199829101562,
      "text": " And Paul says, listen, it's better to be with Christ."
    },
    {
      "id": 41,
      "start": 1386.4199829101562,
      "end": 1391.3799896240234,
      "text": " Again, it doesn't mean that we have a death sentence that we're trying to cut our lives"
    },
    {
      "id": 42,
      "start": 1391.3799896240234,
      "end": 1392.3799896240234,
      "text": " short."
    },
    {
      "id": 43,
      "start": 1392.3799896240234,
      "end": 1399.2799835205078,
      "text": " No, it just simply means I'm not afraid of dying and I'm prepared for dying."
    },
    {
      "id": 44,
      "start": 1399.2799835205078,
      "end": 1405.6199798583984,
      "text": " He says this in verse 24, nevertheless, to abide in the flesh is more needful for you."
    },
    {
      "id": 45,
      "start": 1405.6199798583984,
      "end": 1408.2999877929688,
      "text": " Paul understood that there was still a mission at hand."
    },
    {
      "id": 46,
      "start": 1408.8599853515625,
      "end": 1410.8999786376953,
      "text": " There was still something that God had for him."
    },
    {
      "id": 47,
      "start": 1410.8999786376953,
      "end": 1412.499984741211,
      "text": " I think about Elijah."
    },
    {
      "id": 48,
      "start": 1412.499984741211,
      "end": 1415.219985961914,
      "text": " Elijah said, I just want to die."
    },
    {
      "id": 49,
      "start": 1415.219985961914,
      "end": 1420.8599853515625,
      "text": " After the miraculous fire coming from heaven at Mount Carmel and all that took place and"
    },
    {
      "id": 50,
      "start": 1420.8599853515625,
      "end": 1427.9399871826172,
      "text": " he hears what Jezebel says and he flees and I mean, he just wants to die."
    },
    {
      "id": 51,
      "start": 1427.9399871826172,
      "end": 1429.719985961914,
      "text": " But God appears to him."
    },
    {
      "id": 52,
      "start": 1429.719985961914,
      "end": 1430.719985961914,
      "text": " God strengthens him."
    },
    {
      "id": 53,
      "start": 1430.719985961914,
      "end": 1432.5399780273438,
      "text": " You know what God says to him?"
    },
    {
      "id": 54,
      "start": 1432.5399780273438,
      "end": 1436.2599792480469,
      "text": " He says, I have two tasks yet for you, Elijah."
    },
    {
      "id": 55,
      "start": 1436.2599792480469,
      "end": 1439.2599792480469,
      "text": " God still had a purpose for Elijah's life."
    },
    {
      "id": 56,
      "start": 1439.2599792480469,
      "end": 1442.4199829101562,
      "text": " If we're here this evening and we're still living and breathing, God has a purpose for"
    },
    {
      "id": 57,
      "start": 1442.4199829101562,
      "end": 1445.7799835205078,
      "text": " our life."
    },
    {
      "id": 58,
      "start": 1445.7799835205078,
      "end": 1449.4199829101562,
      "text": " And I'm thankful that God has a purpose for our life."
    },
    {
      "id": 59,
      "start": 1449.4199829101562,
      "end": 1455.2599792480469,
      "text": " And until God's done with us, we'll live for Christ."
    },
    {
      "id": 60,
      "start": 1455.2599792480469,
      "end": 1460.3599853515625,
      "text": " That's what Paul says, for me to live is Christ, to die is gain."
    },
    {
      "id": 61,
      "start": 1460.3599853515625,
      "end": 1462.0599975585938,
      "text": " No fear of dying."
    },
    {
      "id": 62,
      "start": 1462.0599975585938,
      "end": 1467.1799926757812,
      "text": " Notice what he says over in 2 Corinthians chapter number 5, in 2 Corinthians chapter"
    },
    {
      "id": 63,
      "start": 1467.1799926757812,
      "end": 1476.5399780273438,
      "text": " number 5, in verse number, I want to read the whole passage, but look at just verse"
    },
    {
      "id": 64,
      "start": 1476.5399780273438,
      "end": 1477.5399780273438,
      "text": " number 8 with me."
    },
    {
      "id": 65,
      "start": 1477.5399780273438,
      "end": 1481.8199768066406,
      "text": " I've got to get to the last point."
    },
    {
      "id": 66,
      "start": 1481.8199768066406,
      "end": 1490.2999877929688,
      "text": " Notice what Paul says in 2 Corinthians 5 and verse number 8, we are confident, I say, and"
    },
    {
      "id": 67,
      "start": 1490.2999877929688,
      "end": 1498.7799682617188,
      "text": " willing rather to be absent from the body and to be present with the Lord."
    },
    {
      "id": 68,
      "start": 1498.7799682617188,
      "end": 1507.6599731445312,
      "text": " This evening, we can have confidence that when we put off this, our earthly tabernacle,"
    },
    {
      "id": 69,
      "start": 1507.6599731445312,
      "end": 1511.6599731445312,
      "text": " that we'll be in the presence of our Savior."
    },
    {
      "id": 70,
      "start": 1511.6599731445312,
      "end": 1513.4199829101562,
      "text": " We don't have to fear death."
    },
    {
      "id": 71,
      "start": 1513.4199829101562,
      "end": 1514.9599914550781,
      "text": " We can be prepared for death."
    },
    {
      "id": 72,
      "start": 1514.9599914550781,
      "end": 1520.0599975585938,
      "text": " But what was it that led Paul to a place of saying that I'm prepared for death, for taking"
    },
    {
      "id": 73,
      "start": 1520.8199768066406,
      "end": 1521.8199768066406,
      "text": " my final breath?"
    },
    {
      "id": 74,
      "start": 1521.8199768066406,
      "end": 1525.5399780273438,
      "text": " Well, obviously, the truth that he had trusted Christ as his Savior."
    },
    {
      "id": 75,
      "start": 1525.5399780273438,
      "end": 1529.8999938964844,
      "text": " There on the road to Damascus, as it's recorded in Acts chapter number 9, Saul's life was"
    },
    {
      "id": 76,
      "start": 1529.8999938964844,
      "end": 1536.8599853515625,
      "text": " changed forever, and he accepted the Lord Jesus Christ as his personal Savior."
    },
    {
      "id": 77,
      "start": 1536.8599853515625,
      "end": 1543.0199890136719,
      "text": " From that point forward, Saul was a man that knew he was heaven bound."
    },
    {
      "id": 78,
      "start": 1543.0199890136719,
      "end": 1547.5799865722656,
      "text": " I think of D.L. Moody, man pulls a gun on him and he says, you can't threaten me with"
    },
    {
      "id": 79,
      "start": 1547.5799865722656,
      "end": 1548.5799865722656,
      "text": " heaven."
    },
    {
      "id": 80,
      "start": 1549.0999755859375,
      "end": 1553.8199768066406,
      "text": " Wow, that's a man that has confidence to be absent from the body is to be present with"
    },
    {
      "id": 81,
      "start": 1553.8199768066406,
      "end": 1555.5799865722656,
      "text": " the Lord."
    },
    {
      "id": 82,
      "start": 1555.5799865722656,
      "end": 1558.4599914550781,
      "text": " I shared the story many years ago, but I'll share it again this evening."
    },
    {
      "id": 83,
      "start": 1558.4599914550781,
      "end": 1563.8999938964844,
      "text": " I was standing in line at the bank just over here in Oakton several years ago now."
    },
    {
      "id": 84,
      "start": 1563.8999938964844,
      "end": 1568.5399780273438,
      "text": " And as I'm standing there in line and this fellow walks in, and the best way that I could"
    },
    {
      "id": 85,
      "start": 1568.5399780273438,
      "end": 1573.4999694824219,
      "text": " describe this fellow, and I'm not trying to be unkind, but he was an elderly, grumpy man."
    },
    {
      "id": 86,
      "start": 1573.4999694824219,
      "end": 1574.9399719238281,
      "text": " Just what it was."
    },
    {
      "id": 87,
      "start": 1574.9399719238281,
      "end": 1576.1399841308594,
      "text": " He didn't have a grumpy shirt on."
    },
    {
      "id": 88,
      "start": 1576.1399841308594,
      "end": 1577.1399841308594,
      "text": " He didn't need it."
    },
    {
      "id": 89,
      "start": 1577.1399841308594,
      "end": 1579.1799926757812,
      "text": " He was just grumpy."
    },
    {
      "id": 90,
      "start": 1579.1799926757812,
      "end": 1581.1399841308594,
      "text": " And you just kind of, you ever meet somebody like that?"
    },
    {
      "id": 91,
      "start": 1581.1399841308594,
      "end": 1582.4199829101562,
      "text": " Just grumpy."
    },
    {
      "id": 92,
      "start": 1582.4199829101562,
      "end": 1583.4199829101562,
      "text": " Sometimes they wear the shirt."
    },
    {
      "id": 93,
      "start": 1583.4199829101562,
      "end": 1588.219970703125,
      "text": " We're at the restaurant and some guy walks in with a grumpy shirt."
    },
    {
      "id": 94,
      "start": 1588.219970703125,
      "end": 1590.6999816894531,
      "text": " Just announce it to everybody, man."
    },
    {
      "id": 95,
      "start": 1590.6999816894531,
      "end": 1591.6999816894531,
      "text": " This guy didn't need a shirt."
    },
    {
      "id": 96,
      "start": 1591.6999816894531,
      "end": 1592.6999816894531,
      "text": " He's just grumpy."
    },
    {
      "id": 97,
      "start": 1592.6999816894531,
      "end": 1595.3399963378906,
      "text": " And I'm standing there doing my transaction, doing my thing."
    },
    {
      "id": 98,
      "start": 1595.3399963378906,
      "end": 1598.4199829101562,
      "text": " He's standing over there and just the two of us and a couple of tellers, and he looks"
    },
    {
      "id": 99,
      "start": 1598.4199829101562,
      "end": 1603.8199768066406,
      "text": " at me and I look at him and I say, how are you?"
    },
    {
      "id": 100,
      "start": 1603.8199768066406,
      "end": 1604.8199768066406,
      "text": " He says, how are you?"
    },
    {
      "id": 101,
      "start": 1604.8199768066406,
      "end": 1606.0799865722656,
      "text": " I said, I'm wonderful."
    },
    {
      "id": 102,
      "start": 1606.0799865722656,
      "end": 1607.0799865722656,
      "text": " He said, you're lying."
    },
    {
      "id": 103,
      "start": 1607.0799865722656,
      "end": 1610.5199890136719,
      "text": " That's what he said to me."
    },
    {
      "id": 104,
      "start": 1610.5199890136719,
      "end": 1611.5199890136719,
      "text": " You're lying."
    },
    {
      "id": 105,
      "start": 1611.5199890136719,
      "end": 1613.6799926757812,
      "text": " I said, I've never had anyone tell me that."
    },
    {
      "id": 106,
      "start": 1613.6799926757812,
      "end": 1616.3199768066406,
      "text": " I was like confused."
    },
    {
      "id": 107,
      "start": 1616.3199768066406,
      "end": 1620.7999877929688,
      "text": " When I said I'm wonderful and he says you're lying, like I couldn't comprehend."
    },
    {
      "id": 108,
      "start": 1620.7999877929688,
      "end": 1621.7999877929688,
      "text": " I said, what do you mean I'm lying?"
    },
    {
      "id": 109,
      "start": 1621.7999877929688,
      "end": 1624.1999816894531,
      "text": " He said, nobody's wonderful."
    },
    {
      "id": 110,
      "start": 1624.1999816894531,
      "end": 1627.9999694824219,
      "text": " What would make you say that you're wonderful?"
    },
    {
      "id": 111,
      "start": 1627.9999694824219,
      "end": 1631.5199890136719,
      "text": " I didn't have time to really think about all this and lay it all out, but I just simply"
    },
    {
      "id": 112,
      "start": 1631.5199890136719,
      "end": 1635.1999816894531,
      "text": " responded by saying I'm going to heaven."
    },
    {
      "id": 113,
      "start": 1635.3199768066406,
      "end": 1637.3199768066406,
      "text": " And he said, are you dying?"
    },
    {
      "id": 114,
      "start": 1637.3199768066406,
      "end": 1640.4399719238281,
      "text": " It's comical, comical."
    },
    {
      "id": 115,
      "start": 1640.4399719238281,
      "end": 1646.0799865722656,
      "text": " I said, well, as far as I know, I'm not dying right now, but yes, I'm going to die one day."
    },
    {
      "id": 116,
      "start": 1646.0799865722656,
      "end": 1648.1599731445312,
      "text": " So are you."
    },
    {
      "id": 117,
      "start": 1648.1599731445312,
      "end": 1651.7599792480469,
      "text": " And I said, I can be wonderful because I know I'm going to heaven."
    },
    {
      "id": 118,
      "start": 1651.7599792480469,
      "end": 1654.8799743652344,
      "text": " I gave him a gospel tract and asked him to read it."
    },
    {
      "id": 119,
      "start": 1654.8799743652344,
      "end": 1657.2799682617188,
      "text": " I've never seen that man again in my life."
    },
    {
      "id": 120,
      "start": 1657.2799682617188,
      "end": 1659.3999938964844,
      "text": " I don't know that I ever will."
    },
    {
      "id": 121,
      "start": 1659.3999938964844,
      "end": 1662.5999755859375,
      "text": " But the reality is that we don't have to fear death."
    },
    {
      "id": 122,
      "start": 1662.5999755859375,
      "end": 1666.1999816894531,
      "text": " We can be prepared for death."
    },
    {
      "id": 123,
      "start": 1666.1999816894531,
      "end": 1671.47998046875,
      "text": " The second question that I have this evening is not simply are you prepared to take your"
    },
    {
      "id": 124,
      "start": 1671.47998046875,
      "end": 1676.6799926757812,
      "text": " final breath, but let me ask this question, number two this evening."
    },
    {
      "id": 125,
      "start": 1676.6799926757812,
      "end": 1685.1999816894531,
      "text": " Are you helping others to be prepared to take their final breath?"
    },
    {
      "id": 126,
      "start": 1685.1999816894531,
      "end": 1694.9999694824219,
      "text": " Are you prepared, but are you helping anyone to be prepared to take their final breath?"
    },
    {
      "id": 127,
      "start": 1694.9999694824219,
      "end": 1701.3999938964844,
      "text": " Dean often says as he prays, everyone that we come into contact with has got a soul and"
    },
    {
      "id": 128,
      "start": 1701.3999938964844,
      "end": 1704.5999755859375,
      "text": " they're going to die."
    },
    {
      "id": 129,
      "start": 1704.5999755859375,
      "end": 1710.0799865722656,
      "text": " People that you see every day are going to die."
    },
    {
      "id": 130,
      "start": 1710.0799865722656,
      "end": 1716.5999755859375,
      "text": " No doubt you've had people that you've worked with, people that are relatives, people that"
    },
    {
      "id": 131,
      "start": 1716.5999755859375,
      "end": 1717.5999755859375,
      "text": " are neighbors."
    },
    {
      "id": 132,
      "start": 1717.5999755859375,
      "end": 1725.3999633789062,
      "text": " You get the news that so-and-so died."
    },
    {
      "id": 133,
      "start": 1725.3999633789062,
      "end": 1730.3200073242188,
      "text": " And the question this evening is, who are we helping to prepare to take their final"
    },
    {
      "id": 134,
      "start": 1730.3200073242188,
      "end": 1731.3200073242188,
      "text": " breath?"
    },
    {
      "id": 135,
      "start": 1731.3200073242188,
      "end": 1736.4400024414062,
      "text": " See, in the same passage of Scripture in 2 Corinthians chapter 5 and verse number 8,"
    },
    {
      "id": 136,
      "start": 1736.4400024414062,
      "end": 1740.7999877929688,
      "text": " when Paul says, we are confident, I say, and willing rather to be absent from the"
    },
    {
      "id": 137,
      "start": 1740.7999877929688,
      "end": 1745.760009765625,
      "text": " body and to be present with the Lord, we find that Paul then begins to deal with something"
    },
    {
      "id": 138,
      "start": 1745.760009765625,
      "end": 1749.239990234375,
      "text": " at the end of the passage that is so important for us to understand."
    },
    {
      "id": 139,
      "start": 1749.239990234375,
      "end": 1750.7999877929688,
      "text": " Notice and pick it up with me."
    },
    {
      "id": 140,
      "start": 1750.7999877929688,
      "end": 1754.0399780273438,
      "text": " For sake of time, we'll pick it up in verse 18."
    },
    {
      "id": 141,
      "start": 1754.0399780273438,
      "end": 1758.6799926757812,
      "text": " But notice what the Bible says here in 2 Corinthians 5 and verse number 18."
    },
    {
      "id": 142,
      "start": 1758.6799926757812,
      "end": 1765.0399780273438,
      "text": " The Bible says, and all things are of God who hath reconciled us to himself by Jesus"
    },
    {
      "id": 143,
      "start": 1765.0399780273438,
      "end": 1766.0399780273438,
      "text": " Christ."
    },
    {
      "id": 144,
      "start": 1766.0399780273438,
      "end": 1768.5999755859375,
      "text": " We talked about reconciliation this morning."
    },
    {
      "id": 145,
      "start": 1768.5999755859375,
      "end": 1772.760009765625,
      "text": " And I dealt with that truth from 1 Peter 3 and verse number 18."
    },
    {
      "id": 146,
      "start": 1772.760009765625,
      "end": 1778.0,
      "text": " And the word reconciliation, it's the means by which sinners are reconciled and brought"
    },
    {
      "id": 147,
      "start": 1778.0,
      "end": 1784.2799682617188,
      "text": " into a state of favor with God after natural estrangement or enmity."
    },
    {
      "id": 148,
      "start": 1784.2799682617188,
      "end": 1789.1199951171875,
      "text": " And I think about that truth this evening of reconciliation and being brought back to"
    },
    {
      "id": 149,
      "start": 1789.1199951171875,
      "end": 1790.1199951171875,
      "text": " God."
    },
    {
      "id": 150,
      "start": 1790.1199951171875,
      "end": 1793.9599609375,
      "text": " We talked about as 1 Peter 3, 18, I preached this morning that there's the record of Christ's"
    },
    {
      "id": 151,
      "start": 1793.9599609375,
      "end": 1794.9599609375,
      "text": " suffering."
    },
    {
      "id": 152,
      "start": 1794.9599609375,
      "end": 1797.0,
      "text": " There's the reason for Christ's suffering."
    },
    {
      "id": 153,
      "start": 1797.0,
      "end": 1800.0,
      "text": " But there's the result that he would bring us to God."
    },
    {
      "id": 0,
      "start": 1800.0,
      "end": 1801.7799999713898,
      "text": " God."
    },
    {
      "id": 1,
      "start": 1801.7799999713898,
      "end": 1808.9399995803833,
      "text": " And here the Bible says that in verse number 18, and all things are of God who hath reconciled"
    },
    {
      "id": 2,
      "start": 1808.9399995803833,
      "end": 1816.8799991607666,
      "text": " us to himself by Jesus Christ, aren't you thankful to be reconciled?"
    },
    {
      "id": 3,
      "start": 1816.8799991607666,
      "end": 1821.2199993133545,
      "text": " What a glorious truth that we can stand up and say, I've been reconciled."
    },
    {
      "id": 4,
      "start": 1821.2199993133545,
      "end": 1823.5400009155273,
      "text": " I know we don't use the word that often."
    },
    {
      "id": 5,
      "start": 1823.5400009155273,
      "end": 1827.6200008392334,
      "text": " We might talk about being redeemed and being saved and being born again."
    },
    {
      "id": 6,
      "start": 1827.6200008392334,
      "end": 1832.340000152588,
      "text": " But the truth is that we can say accurately, I've been reconciled."
    },
    {
      "id": 7,
      "start": 1832.340000152588,
      "end": 1844.5800018310547,
      "text": " And notice what it says at the end of verse number 18, and hath given to us the ministry"
    },
    {
      "id": 8,
      "start": 1844.5800018310547,
      "end": 1848.099998474121,
      "text": " of reconciliation."
    },
    {
      "id": 9,
      "start": 1848.099998474121,
      "end": 1851.400001525879,
      "text": " We have been reconciled to God through Jesus Christ."
    },
    {
      "id": 10,
      "start": 1851.400001525879,
      "end": 1857.1800003051758,
      "text": " By the way, it's the only way to be reconciled because the just for the unjust, and we dealt"
    },
    {
      "id": 11,
      "start": 1857.1800003051758,
      "end": 1859.7599983215332,
      "text": " with that very detailed this morning."
    },
    {
      "id": 12,
      "start": 1859.7599983215332,
      "end": 1871.1600036621094,
      "text": " But we find that he then says this, that he has given to us the ministry of reconciliation."
    },
    {
      "id": 13,
      "start": 1871.1600036621094,
      "end": 1878.5599975585938,
      "text": " Notice to wit, verse 19, that God was in Christ, reconciling the world unto himself, not imputing"
    },
    {
      "id": 14,
      "start": 1878.5599975585938,
      "end": 1884.7200012207031,
      "text": " their trespasses unto them, and hath committed unto us the word of reconciliation."
    },
    {
      "id": 15,
      "start": 1884.7200012207031,
      "end": 1890.3000030517578,
      "text": " So we see at the end of verse number 18 that he hath given to us the ministry of reconciliation."
    },
    {
      "id": 16,
      "start": 1890.3000030517578,
      "end": 1894.900001525879,
      "text": " Now in verse number 19, he says, and hath committed unto us the word of reconciliation."
    },
    {
      "id": 17,
      "start": 1894.900001525879,
      "end": 1903.2200012207031,
      "text": " And then he says this in verse number 20, now then, we are ambassadors for Christ."
    },
    {
      "id": 18,
      "start": 1903.2200012207031,
      "end": 1905.379997253418,
      "text": " We are ambassadors for Christ."
    },
    {
      "id": 19,
      "start": 1905.379997253418,
      "end": 1917.2799987792969,
      "text": " As though God did beseech you by us, we pray you in Christ's stead, be reconciled to God."
    },
    {
      "id": 20,
      "start": 1917.2799987792969,
      "end": 1922.400001525879,
      "text": " For he hath made him to be sin for us who knew no sin, that we might be made the righteousness"
    },
    {
      "id": 21,
      "start": 1922.400001525879,
      "end": 1924.7600021362305,
      "text": " of God in him."
    },
    {
      "id": 22,
      "start": 1924.7600021362305,
      "end": 1931.0399932861328,
      "text": " And as we look there at that truth in verses 18 through 20 of the ministry of reconciliation,"
    },
    {
      "id": 23,
      "start": 1931.0399932861328,
      "end": 1935.6199951171875,
      "text": " when we find that Paul says we've been given this ministry of reconciliation, the word"
    },
    {
      "id": 24,
      "start": 1935.6199951171875,
      "end": 1944.1399993896484,
      "text": " of reconciliation has been committed unto us, he says, now then, we are his ambassadors."
    },
    {
      "id": 25,
      "start": 1944.1399993896484,
      "end": 1946.3800048828125,
      "text": " Ambassadors are representative."
    },
    {
      "id": 26,
      "start": 1946.3800048828125,
      "end": 1951.6600036621094,
      "text": " We sing the song, this world is not my home, I'm just a passing through."
    },
    {
      "id": 27,
      "start": 1951.6600036621094,
      "end": 1959.020004272461,
      "text": " I often talk about the fact that as a believer, we have dual citizenship, heaven, and for"
    },
    {
      "id": 28,
      "start": 1959.020004272461,
      "end": 1961.1199951171875,
      "text": " me, America."
    },
    {
      "id": 29,
      "start": 1961.1199951171875,
      "end": 1965.3200073242188,
      "text": " I'm a citizen of this nation, but I'm a citizen of heaven."
    },
    {
      "id": 30,
      "start": 1965.3200073242188,
      "end": 1967.7200012207031,
      "text": " And can I say this?"
    },
    {
      "id": 31,
      "start": 1967.7200012207031,
      "end": 1974.240005493164,
      "text": " It doesn't matter what nation upon this earth you have citizenship in, what matters is that"
    },
    {
      "id": 32,
      "start": 1974.240005493164,
      "end": 1977.8000030517578,
      "text": " you have citizenship in heaven."
    },
    {
      "id": 33,
      "start": 1977.8000030517578,
      "end": 1985.2799987792969,
      "text": " There's a whole lot of people that God has allowed us to be surrounded by that need to"
    },
    {
      "id": 34,
      "start": 1985.2799987792969,
      "end": 1989.020004272461,
      "text": " understand the truth of reconciliation."
    },
    {
      "id": 35,
      "start": 1989.020004272461,
      "end": 1998.259994506836,
      "text": " They need somebody to help them understand how they can be prepared for their final breath."
    },
    {
      "id": 36,
      "start": 1998.259994506836,
      "end": 2004.5399932861328,
      "text": " I think about the evangelist, Philip."
    },
    {
      "id": 37,
      "start": 2004.5399932861328,
      "end": 2007.0599975585938,
      "text": " He's ministering, he's serving the Lord."
    },
    {
      "id": 38,
      "start": 2007.0599975585938,
      "end": 2010.0599975585938,
      "text": " I mean, he's in Samaria and people are getting saved."
    },
    {
      "id": 39,
      "start": 2010.0599975585938,
      "end": 2011.7799987792969,
      "text": " It's exciting what's going on."
    },
    {
      "id": 40,
      "start": 2011.7799987792969,
      "end": 2016.1600036621094,
      "text": " You read in Acts chapter 8, man, it's exciting, God's using Philip."
    },
    {
      "id": 41,
      "start": 2016.1600036621094,
      "end": 2023.240005493164,
      "text": " And then God moves Philip and says, I want you to go talk to this Ethiopian eunuch."
    },
    {
      "id": 42,
      "start": 2023.240005493164,
      "end": 2031.2799987792969,
      "text": " That Ethiopian eunuch had been in Jerusalem and he's leaving in a chariot and he's reading"
    },
    {
      "id": 43,
      "start": 2031.2799987792969,
      "end": 2034.8800048828125,
      "text": " Isaiah 53."
    },
    {
      "id": 44,
      "start": 2034.8800048828125,
      "end": 2038.4400024414062,
      "text": " And it's amazing to me that if you look at Acts chapter 8, that what happens in the text"
    },
    {
      "id": 45,
      "start": 2038.4400024414062,
      "end": 2043.1799926757812,
      "text": " of Scripture is that Philip comes up and he gets up into the chariot and he asks this"
    },
    {
      "id": 46,
      "start": 2043.1799926757812,
      "end": 2048.740005493164,
      "text": " question, understandest thou what thou readest?"
    },
    {
      "id": 47,
      "start": 2048.740005493164,
      "end": 2049.740005493164,
      "text": " You know what the eunuch said?"
    },
    {
      "id": 48,
      "start": 2049.740005493164,
      "end": 2057.779998779297,
      "text": " How can I, except some man should teach me?"
    },
    {
      "id": 49,
      "start": 2057.779998779297,
      "end": 2060.5,
      "text": " You know what the eunuch asked?"
    },
    {
      "id": 50,
      "start": 2060.5,
      "end": 2061.5,
      "text": " Who's this man talking about?"
    },
    {
      "id": 51,
      "start": 2061.5,
      "end": 2064.3399963378906,
      "text": " Is he talking about himself or about somebody else?"
    },
    {
      "id": 52,
      "start": 2065.239990234375,
      "end": 2070.8399963378906,
      "text": " Isaiah 53 is the great messianic prophecy and the truth of the suffering Savior."
    },
    {
      "id": 53,
      "start": 2070.8399963378906,
      "end": 2074.6799926757812,
      "text": " I mean, it's an amazing portion of Scripture."
    },
    {
      "id": 54,
      "start": 2074.6799926757812,
      "end": 2079.0599975585938,
      "text": " And in God's providence, that's what the man's reading."
    },
    {
      "id": 55,
      "start": 2079.0599975585938,
      "end": 2080.0599975585938,
      "text": " And so what does Philip do?"
    },
    {
      "id": 56,
      "start": 2080.0599975585938,
      "end": 2086.6400146484375,
      "text": " He comes to the same passage and preaches Christ, that he is the Son of God."
    },
    {
      "id": 57,
      "start": 2086.6400146484375,
      "end": 2087.6400146484375,
      "text": " That eunuch gets saved."
    },
    {
      "id": 58,
      "start": 2087.6400146484375,
      "end": 2093.3399963378906,
      "text": " But I want you to think about those words when he says, understandest thou what thou"
    },
    {
      "id": 59,
      "start": 2093.3399963378906,
      "end": 2094.8599853515625,
      "text": " readest?"
    },
    {
      "id": 60,
      "start": 2094.8599853515625,
      "end": 2097.260009765625,
      "text": " How can I?"
    },
    {
      "id": 61,
      "start": 2097.260009765625,
      "end": 2101.1199951171875,
      "text": " Why did God give us the ministry of reconciliation?"
    },
    {
      "id": 62,
      "start": 2101.1199951171875,
      "end": 2104.1400146484375,
      "text": " He gave it to those that have been reconciled."
    },
    {
      "id": 63,
      "start": 2104.1400146484375,
      "end": 2105.1400146484375,
      "text": " Why?"
    },
    {
      "id": 64,
      "start": 2105.1400146484375,
      "end": 2109.7000122070312,
      "text": " Because somebody that's been reconciled can tell somebody else how they can be reconciled."
    },
    {
      "id": 65,
      "start": 2109.7000122070312,
      "end": 2111.760009765625,
      "text": " Does that make sense?"
    },
    {
      "id": 66,
      "start": 2111.760009765625,
      "end": 2116.720001220703,
      "text": " If you've not been reconciled this evening, you can't tell anybody else how to be reconciled."
    },
    {
      "id": 67,
      "start": 2116.7999877929688,
      "end": 2120.6000061035156,
      "text": " If you're not prepared for your final breath this evening, you can't help anybody else"
    },
    {
      "id": 68,
      "start": 2120.6000061035156,
      "end": 2123.1000061035156,
      "text": " be prepared for their final breath."
    },
    {
      "id": 69,
      "start": 2123.1000061035156,
      "end": 2129.720001220703,
      "text": " But God's entrusted to us the ministry of reconciliation."
    },
    {
      "id": 70,
      "start": 2129.720001220703,
      "end": 2135.8800048828125,
      "text": " And as I begin to think about Genesis chapter 35, and I read the portion of Scripture, and"
    },
    {
      "id": 71,
      "start": 2135.8800048828125,
      "end": 2143.459991455078,
      "text": " I read about the birth of Benjamin, and I read about the death of Rachel, and then I"
    },
    {
      "id": 72,
      "start": 2143.459991455078,
      "end": 2148.8399963378906,
      "text": " read all the names of the sons of Jacob as they're provided for us in that short portion"
    },
    {
      "id": 73,
      "start": 2148.8399963378906,
      "end": 2157.260009765625,
      "text": " of Scripture, and then I read about the death of Isaac, I'm reminded life and death."
    },
    {
      "id": 74,
      "start": 2157.260009765625,
      "end": 2163.1799926757812,
      "text": " The reality this evening is that I don't know, and you don't know either, when we're going"
    },
    {
      "id": 75,
      "start": 2163.1799926757812,
      "end": 2165.779998779297,
      "text": " to take our final breath."
    },
    {
      "id": 76,
      "start": 2165.779998779297,
      "end": 2173.019989013672,
      "text": " I hope that you can say with confidence, as Paul did, I'm going to straight betwixt two,"
    },
    {
      "id": 77,
      "start": 2173.019989013672,
      "end": 2178.1000061035156,
      "text": " having a desire to depart, to be with Christ, which is far better."
    },
    {
      "id": 78,
      "start": 2178.1000061035156,
      "end": 2183.779998779297,
      "text": " But I hope this evening that we would take seriously the ministry of reconciliation that's"
    },
    {
      "id": 79,
      "start": 2183.779998779297,
      "end": 2186.5,
      "text": " been committed to us."
    },
    {
      "id": 80,
      "start": 2186.5,
      "end": 2191.3399963378906,
      "text": " That we'd be faithful ambassadors."
    },
    {
      "id": 81,
      "start": 2191.3399963378906,
      "end": 2198.980010986328,
      "text": " That we would do our part to try to help people be prepared to take their final breath."
    },
    {
      "id": 82,
      "start": 2198.980010986328,
      "end": 2202.5,
      "text": " Because everywhere we look, people are dying."
    },
    {
      "id": 83,
      "start": 2202.5,
      "end": 2204.0599975585938,
      "text": " Four?"
    },
    {
      "id": 84,
      "start": 2204.0599975585938,
      "end": 2205.3399963378906,
      "text": " Every second."
    },
    {
      "id": 85,
      "start": 2205.3399963378906,
      "end": 2206.8999938964844,
      "text": " How many people are born?"
    },
    {
      "id": 86,
      "start": 2206.8999938964844,
      "end": 2208.1799926757812,
      "text": " Four."
    },
    {
      "id": 87,
      "start": 2208.1799926757812,
      "end": 2210.1799926757812,
      "text": " How many people die?"
    },
    {
      "id": 88,
      "start": 2210.1799926757812,
      "end": 2211.8200073242188,
      "text": " Two."
    },
    {
      "id": 89,
      "start": 2211.8200073242188,
      "end": 2214.6600036621094,
      "text": " Think about that."
    },
    {
      "id": 90,
      "start": 2214.6600036621094,
      "end": 2218.739990234375,
      "text": " There have been people that have come to me and said, Pastor, I went into work on Monday,"
    },
    {
      "id": 91,
      "start": 2218.739990234375,
      "end": 2223.3399963378906,
      "text": " and I found out that my coworker passed away over the weekend."
    },
    {
      "id": 92,
      "start": 2223.3399963378906,
      "end": 2230.2999877929688,
      "text": " It happens, because people die."
    },
    {
      "id": 93,
      "start": 2230.2999877929688,
      "end": 2240.540008544922,
      "text": " I read years ago, a story, as best I can tell, it was true."
    },
    {
      "id": 94,
      "start": 2240.540008544922,
      "end": 2245.459991455078,
      "text": " I don't believe everything I read on the internet, and I hope you don't either."
    },
    {
      "id": 95,
      "start": 2245.459991455078,
      "end": 2248.1799926757812,
      "text": " But as best I could tell, it was a true story."
    },
    {
      "id": 96,
      "start": 2248.1799926757812,
      "end": 2258.459991455078,
      "text": " It was a story about a young girl that lived pretty close to a church, and lived there"
    },
    {
      "id": 97,
      "start": 2258.5799865722656,
      "end": 2259.5799865722656,
      "text": " for years."
    },
    {
      "id": 98,
      "start": 2259.5799865722656,
      "end": 2261.8999938964844,
      "text": " Her parents, her family did."
    },
    {
      "id": 99,
      "start": 2261.8999938964844,
      "end": 2267.1400146484375,
      "text": " She was a teenager at this particular point."
    },
    {
      "id": 100,
      "start": 2267.1400146484375,
      "end": 2271.019989013672,
      "text": " Her dad and mom were killed."
    },
    {
      "id": 101,
      "start": 2271.019989013672,
      "end": 2274.739990234375,
      "text": " She was struggling."
    },
    {
      "id": 102,
      "start": 2274.739990234375,
      "end": 2279.6600036621094,
      "text": " She walked out of that little church on a Sunday and went in for service."
    },
    {
      "id": 103,
      "start": 2279.6600036621094,
      "end": 2282.5799865722656,
      "text": " She heard the pastor preach."
    },
    {
      "id": 104,
      "start": 2282.5799865722656,
      "end": 2286.1400146484375,
      "text": " She heard a pastor preach a message similar to what you would hear, perhaps, in our church"
    },
    {
      "id": 105,
      "start": 2286.1400146484375,
      "end": 2297.3800048828125,
      "text": " about Jesus is the only way, Jesus saves, He's a wonderful Savior to me."
    },
    {
      "id": 106,
      "start": 2297.3800048828125,
      "end": 2300.6199951171875,
      "text": " He loves you, and He died for you."
    },
    {
      "id": 107,
      "start": 2300.6199951171875,
      "end": 2302.779998779297,
      "text": " She heard that message."
    },
    {
      "id": 108,
      "start": 2302.779998779297,
      "end": 2312.5399780273438,
      "text": " She confronted the pastor after the service, and was so distraught, because she said, if"
    },
    {
      "id": 109,
      "start": 2312.5399780273438,
      "end": 2320.02001953125,
      "text": " you really believe what you preached this morning, why did you never come to our house"
    },
    {
      "id": 110,
      "start": 2320.02001953125,
      "end": 2324.260009765625,
      "text": " and tell us before my parents died?"
    },
    {
      "id": 111,
      "start": 2324.260009765625,
      "end": 2327.0999755859375,
      "text": " I wouldn't want to be that pastor."
    },
    {
      "id": 112,
      "start": 2327.0999755859375,
      "end": 2332.9000244140625,
      "text": " I wouldn't want to be that believer, that Christian, that would have to give an answer"
    },
    {
      "id": 113,
      "start": 2332.9000244140625,
      "end": 2335.1400146484375,
      "text": " to that individual."
    },
    {
      "id": 114,
      "start": 2335.1400146484375,
      "end": 2337.260009765625,
      "text": " People are dying."
    },
    {
      "id": 115,
      "start": 2337.260009765625,
      "end": 2339.8599853515625,
      "text": " People are dying."
    },
    {
      "id": 116,
      "start": 2339.8599853515625,
      "end": 2346.1400146484375,
      "text": " This evening, I hope that each and every one of us can leave here saying, I know I'm saved."
    },
    {
      "id": 117,
      "start": 2346.1400146484375,
      "end": 2349.9000244140625,
      "text": " I'm prepared for my final breath."
    },
    {
      "id": 118,
      "start": 2349.9000244140625,
      "end": 2356.3400268554688,
      "text": " But I hope this evening that each and every one of us would say, God, help me to help"
    },
    {
      "id": 119,
      "start": 2356.3400268554688,
      "end": 2360.739990234375,
      "text": " others be prepared to take their final breath."
    },
    {
      "id": 120,
      "start": 2360.739990234375,
      "end": 2368.2999877929688,
      "text": " Help me to take seriously the ministry of reconciliation, and to understand that God"
    },
    {
      "id": 121,
      "start": 2368.2999877929688,
      "end": 2373.97998046875,
      "text": " gave me that responsibility because it's only reconciled people that are going to"
    },
    {
      "id": 122,
      "start": 2373.97998046875,
      "end": 2379.97998046875,
      "text": " be able to help lost people to be reconciled to God."
    },
    {
      "id": 123,
      "start": 2379.97998046875,
      "end": 2387.1400146484375,
      "text": " What a wonderful privilege God has given us, a weighty responsibility."
    },
    {
      "id": 124,
      "start": 2387.1400146484375,
      "end": 2392.8599853515625,
      "text": " But this evening, there are people that are dying, life and death."
    },
    {
      "id": 125,
      "start": 2392.8599853515625,
      "end": 2396.3400268554688,
      "text": " How shall they hear without a preacher?"
    },
    {
      "id": 126,
      "start": 2396.3400268554688,
      "end": 2397.3400268554688,
      "text": " Amen?"
    },
    {
      "id": 127,
      "start": 2397.3400268554688,
      "end": 2399.3800048828125,
      "text": " That's what Romans 10 says."
    },
    {
      "id": 0,
      "start": 2399.3800048828125,
      "end": 2406.6200046539307,
      "text": " associated that truth is to Acts 8. How can I except some man should teach me? Let's pray"
    },
    {
      "id": 1,
      "start": 2406.6200046539307,
      "end": 2413.6600046157837,
      "text": " together. Father, we love you. We thank you for loving us. This portion of Scripture reveals"
    },
    {
      "id": 2,
      "start": 2413.6600046157837,
      "end": 2420.740005493164,
      "text": " to us the birth of Benjamin and the record of the names of the sons of Jacob, the death"
    },
    {
      "id": 3,
      "start": 2420.740005493164,
      "end": 2428.940004348755,
      "text": " of Rachel and the death of Isaac. We're reminded this evening about life and death. The Bible"
    },
    {
      "id": 4,
      "start": 2428.940004348755,
      "end": 2437.5000038146973,
      "text": " is full of instruction regarding our lives, the analogies of a shadow of a vapor. God,"
    },
    {
      "id": 5,
      "start": 2437.5000038146973,
      "end": 2443.9800033569336,
      "text": " I pray this evening that each and every one of us would be able to say with confidence"
    },
    {
      "id": 6,
      "start": 2443.9800033569336,
      "end": 2451.180004119873,
      "text": " as Paul did, I know I'm going to go to heaven when I die. I no longer fear death for I've"
    },
    {
      "id": 7,
      "start": 2451.180004119873,
      "end": 2457.580005645752,
      "text": " been saved, I've been reconciled. God, I pray that you'd help each and every one of us this"
    },
    {
      "id": 8,
      "start": 2457.580005645752,
      "end": 2468.0600051879883,
      "text": " evening, myself included, to have a burden, a passion to reach lost people. That we'd"
    },
    {
      "id": 9,
      "start": 2468.0600051879883,
      "end": 2474.6600036621094,
      "text": " take seriously the ministry of reconciliation that's been committed to us. God, we'd be"
    },
    {
      "id": 10,
      "start": 2474.6600036621094,
      "end": 2484.140007019043,
      "text": " faithful servants, faithful ambassadors to tell a lost and dying world the glorious message"
    },
    {
      "id": 11,
      "start": 2484.1800079345703,
      "end": 2491.0600051879883,
      "text": " of the gospel. In these few moments of invitation, I pray that you'd move and work in our hearts"
    },
    {
      "id": 12,
      "start": 2491.0600051879883,
      "end": 2496.300003051758,
      "text": " as only you can. I pray that decisions would be made that would please thee. I pray, God,"
    },
    {
      "id": 13,
      "start": 2496.300003051758,
      "end": 2501.020004272461,
      "text": " that you'd help us to have an impact on eternity. Well, thank you for all that you'll do. For"
    },
    {
      "id": 14,
      "start": 2501.020004272461,
      "end": 2502.42000579834,
      "text": " it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T09:49:32.037754"
}