{
  "video_id": "a8Z2gxOlMKc",
  "text": "Chapter number 20 this evening, Genesis chapter number 20, and as we look at this portion of scripture, we'll be looking at the entirety of the chapter this evening. And we've been studying through the book of Genesis periodically here over the last couple of years, and there'll be certain periods of time in which we're very consistent week after week right there in the book of Genesis, and then there are other times in which we'll stray away for a little while and then get back to the book. This is our 52nd lesson through the book of Genesis, and I have thoroughly enjoyed the study and trust that you have as well. And here as we get to Genesis chapter number 20, we're really reminded of an event that took place back in Genesis chapter number 12 in the life of Abraham and Sarah. Of course, at that particular time, their names were Abram and Sarai. Their names had not yet been changed, but as we think back to that event that was recorded back in Genesis chapter number 12, we are told that there was a great famine and they traveled to Egypt, and as they would travel to Egypt because of that great famine, we find that Sarah was taken into Pharaoh's home. And we find that it was because of what Abraham said of Sarah, she is my sister. And we spoke about that portion of scripture, and we talked about the way in which God intervened in Genesis chapter number 12, and as we looked at that portion of scripture in Genesis chapter number 12, we made several observations from that passage, but one of the things that we noted was that our God is able, amen? We don't have to use some type of story and use some type of deception as which Abram and Sarah did there in Genesis chapter number 12. I believe with all of my heart that as Abraham was fearful because of Sarah, that he'd go into that place, and because of her being beautiful, they would kill him for her, and I believe that he had that fear, but I believe with all of my heart that Abraham could have walked right into that place and said, she's my wife, what are you going to do about it? Because God is able, amen? Because God is able. And I dealt with that in Genesis chapter number 12, and I asked this question at the end of that study, I wonder if as we look at that portion of scripture, and we look at that event historically, and we make some application for our lives, I wonder if Abraham would learn a lesson. Now, we could answer the question because we have the Bible, and we know that in Genesis chapter number 20, as we'll study this evening, he does the same thing, but you know there are times in your life and in my life when we make the same mistake more than once, amen? And perhaps when we make that mistake, we fail to live by faith, we fail to trust God, and we see God work, and we see God intervene, and we say, man, I'm going to learn my lesson, but then the circumstances may change, and it may be a period of time, and we go down the same path, and we doubt God. Listen, God knows that we're but flesh. I'm not saying that to make an excuse for our failures, but I'm simply saying that God knows our frame, amen? As we look here at the account in Genesis chapter number 20, we would find that between the time in Genesis chapter number 12 and the time in which we're looking here in Genesis chapter number 20, nearly 25 years had passed. In Genesis chapter number 12, the Bible tells us in that portion of Scripture that Abraham is 75 years old. As best we can tell, in Genesis chapter number 20, he's somewhere between 99 and 100. We understand that if you look at the passage of Scripture, you'll find that just a few chapters earlier, we're told of him being 99 years old, and then when you get into chapter number 21, and you deal with the birth of Isaac, he's 100. And so he's somewhere between 99 and 100, he's probably closer to 100 than 99, but the reality is that 25 years is a long time. And in those 25 years, God had proven himself to Abraham over and over and over, amen? God had demonstrated his power to Abraham in amazing ways. We find that as we would think about this period of time, 25 years in which he'd experienced so much, and as we look at the same mistake being made, the same deception being given to Abimelech that was given to Pharaoh here in Genesis chapter number 20, we could ask ourselves questions such as, how did this happen? Did he not learn his lesson last time? After all that God did for him, after all that God revealed to him, how is it that he could still behave in this manner? And I would simply offer a single word as an answer, and it's flesh. It's what we dealt with this morning. Crucify your flesh. Crucify your flesh. And so we think about this portion of Scripture as, by way of introduction before we get into the chapter, I want you to be mindful, and I'm just going to go very quickly through these events and just really kind of highlight several things, but I want you to be mindful that at the end of Genesis chapter number 12, God worked in such a supernatural way in order to restore Sarah to Abraham in the life of Pharaoh that no doubt Abraham saw the hand of God. Abraham saw God work in a very distinct way. In Genesis chapter number 13, we find that God gives that land to Abraham. Remember, he'd promised him a land, and we find that as you study chapter number 13, that that land is given, we're mindful of the fact in which in chapter number 14, there was that coalition, if you will, of army, those men that took captive Lot and many others, and we find that God gave great victory to Abraham. Remember, he took those trained servants from his home, and it was in that portion of Scripture in which Abraham understood that God is the possessor of heaven and earth. It was in that portion of Scripture in which God revealed to Abraham that he's El Elyon, the most high God. It's in that portion of Scripture before this man Abraham would ever meet the king that he would meet after the great victory and go through meeting the king of Salem that he would meet, excuse me, the king of Sodom that he would meet the king of Salem, Mephibosheth. Not Mephibosheth, that was a mistake, amen? He did not meet Mephibosheth, that's over in the book, in David's life. It was there that he would meet, there in chapter number 13, that he would meet, somebody help me out here, who is it that he's going to meet? Who is it? Melchizedek. Melchizedek. What in the world? All I could keep thinking is Mephibosheth, and you ever get something stuck in your brain and like nothing else kind of can fit in your brain at that point? And so, he of course goes, and remember, when he comes into that place in Genesis chapter number 13, that we find that it's there in which he finds that God is the most high God, he's the possessor of heaven and earth, we find that God will tell Abraham in that portion of Scripture as Melchizedek will reveal these truths to him, and then we find that God tells Abraham in Genesis chapter number 15, fear not, I am thy shield, and thy exceeding great reward. So, oh, God is proving himself to Abraham, and we find that as he makes that covenant in chapter number 15, and he proves himself there to Abraham with regard again to a land and to a seed, and we come to chapter number 16, and yes, we read about the birth of Ishmael, and we find there in that portion of Scripture, after many years had passed, that Abraham and Sarah, they make this decision, but we find that after those ten years, that Ishmael would be born, and God reiterates his promise to Abraham. Abraham, though you've operated outside of what I've communicated to you, my will for you has not yet changed, and here's the promise that I make to you. Thirteen years pass between the end of chapter number 16 and the beginning of chapter number 17. We find that it's there again in chapter number 17, when God tells us that Abraham is 99 years old, that it's in that portion of Scripture when the Lord appears to him and now will reveal himself to Abraham as being El Shaddai, the Lord God Almighty. It begins to, again, reinforce the promises that he's made to Abraham. He'll ask the question in chapter number 18, is anything too hard for the Lord? We find that it's there in chapter number 18, as God is interacting there with Abraham, that God is giving Abraham insight as to the destruction of Sodom and Gomorrah that would be forthcoming, and Abraham talks with God. He communes with God. We come to chapter number 19, and we find that the destruction of Sodom and Gomorrah is revealed to us, and as we would think about all that has happened in a quick overview of all of those chapters, I would say over 25 years, God had proven himself to Abraham. Would you not agree? He revealed himself. He had proven himself, and yet we come to chapter number 20. The circumstances are not known. The circumstances are not communicated to us as to why it is that the decision is made in this journey that is recorded for us in Genesis chapter number 20. In the 12th chapter of Genesis, when they go into Egypt, God reveals to us it's because of a great famine that's in the land. Here in chapter number 20, we do not have those details. Many have sought to come up with some type of an idea as to why it is that they traveled, but this evening I'll just tell you, I don't know. We don't know why they traveled, but the Bible begins, and Abraham journeyed from fence toward the south country and dwelt. between Kadesh and Shur and sojourned in Gerar. And Abraham said of Sarah his wife, She is my sister. And Abimelech king of Gerar sent and took Sarah.\" Notice in verse number 7, the Bible says, Now therefore restore the man his wife, for he is a prophet, and he shall pray for thee, and thou shalt live. And if thou restore her not, know thou that thou shalt surely die, thou and all that are thine. The title for the message this evening is derived from verse number 7, Restore the man his wife. Restore the man his wife. As you take notes this evening, I want you to notice first of all the fear of Abraham. The fear of Abraham. As we look at this portion of Scripture, the Bible tells us, as we've read verses 1 and 2 already, that they travel, they sojourn, and they find themselves in Gerar. The Bible says that the the king of this place is Abimelech, and as we would find that Sarah and Abraham arrive in this place, remember that God had reinforced his promise, he says to Abraham in very certain terms in chapters 17 and 18, that Sarah thy wife shall have a son. We find that God has given these promises to Abraham, and now we find that as he comes to this place, that he says of Sarah that she is my sister. She is my sister. What is it that would motivate Abraham to say that she is my sister? We understand that as we look at the portion of Scripture, if you skip over to verse number 11, that there's insight that is given for Abimelech asks Abraham why it is that he did this thing, and we find that Abraham says this in verse number 11, because I thought surely the fear of God is not in this place, and they will slay me for my wife's sake. Now isn't it interesting that this man, Abraham, was concerned that he was in a place in which they did not fear the Lord, but yet he himself is operating under fear. He's fearful for his own life. He's fearful that, the Bible tells us in verse number 11, that they will slay me for my wife's sake, and yet indeed she is my sister. She is the daughter of my father, but not the daughter of my mother, and she became my wife. We dealt with this in chapter number 12, that this was an accepted practice during this particular era, and we find that he is making this really, I believe as you look at verse number 12 and 13, that what's happening is Abraham is justifying his logic. You know the reality is that there are times in which we are really good at justifying our disobedience. We get really, really creative on how it is that we can justify operating in fear, how it is that we can operate in disobedience, and we justify our actions, and we find that Abraham is providing this justification. Not only does he say, well really she's my half-sister in verse number 12, she is the daughter of my father, but not the daughter of my mother. Notice in verse number 13, and it came to pass when God caused me to wander from my father's house, he's gonna go all the way back to when he first left, when God first called him, and he says that at that time that I said unto her, this is thy kindness which thou shalt show unto me at every place whither we shall come, say of me, he is my brother. In some way, I believe that Abraham had this belief that by following this plan that had been derived, they came up with many years earlier that this would provide him some level of safety and protection that perhaps God was not able to afford. But the reality is that he'd already experienced God providing protection for him in Egypt. This very thing that's being repeated in chapter number 20 has already occurred in Abraham's life. Right now in chapter number 20, we're just in a different city with different names of different characters, but really it's the same event, is it not? Have you ever felt like in your life that there's just kind of a repeat button that's been played? Like, man, I think I've been here before. Maybe I didn't learn the lesson. Why didn't I learn the lesson, right? And here's Abraham, and he says to Abimelech, she's my sister, and I said this as we note the fear of Abraham, you understand that God, as we read His Word, that many times throughout the Scriptures we read these words, fear not. Fear not. Be not afraid. Do we not? Those phrases are littered all throughout the Word of God. We find that Paul says this in 2nd Timothy 1 and verse number 7, for God hath not given us the spirit of fear, but of power and of love and of a sound mind. In fact, it's there in Abraham's life after he'd experienced a great victory. In chapter number 14, as we mentioned earlier, as we did a quick review, we find that it was there in chapter number 15 that God plainly says to Abraham, fear not. As often as we read the words fear not, as often as we read the words be not afraid, as often as we could speak about and preach messages on not having fear and not being controlled by fear, the reality is that we are human beings and we continue to deal with an emotion of fear. It's just how we, that's just something we deal with as human beings. We were in Branson, as you know, for vacation, and the fellow that was teaching the Sunday school class, he had kind of, the subject matter was not on fear at all, but somehow along the line during the message he got onto the subject of fear. And as he was teaching the lesson on fear, he said that if we fear God, then every other fear will go away, because we have a fear of God and we're to have a proper fear of God. And he's going through this, and his wife was not very kind, for he's going through and he's saying all of these things about we need to fear God, and she says, and he says that every other fear will go away, and she says, excuse me honey, is that applicable to snakes as well? And it was like, come on, that's not right for a wife to do that to her husband when he's teaching, you know? But he was really dealing with, listen, why is it that we fear man? Why is it that we fear things that we deal with in life, and we can have this spirit of fear? You know, fear can cause us to do things that we ought not do. Fear can cause us to behave in matters in which are not appropriate and accept it to God. And here in Genesis chapter number 20, I truly believe that Abraham here is motivated by fear, that he says to Abimelech, listen, I thought for sure that the fear of God was not in this place, and therefore here's what you'll do, you'll slay me for my wife's sake. So therefore, I said she's my sister. We see, first of all, the fear of Abraham. I want you to see number two, the faithfulness of God. The faithfulness of God. We understand this evening that our God is always faithful. We sing, great is thy faithfulness, and what a great hymn that is. And I'm so thankful for the faithfulness of God. In fact, I'm so glad that His faithfulness is not dependent upon my faithfulness. Aren't you? Can you imagine the place in which we'd be if God's faithfulness was dependent upon our faithfulness? Miserable. Honestly. But our God is faithful. And here, the first two words of verse number three in Genesis chapter number 20, but God. You know how many times you read in the Scriptures that phrase, those two words, but God? There's an event, there's a set of circumstances that are taking place, but God. But God shows up, and God intervenes, and God works, and God moves. Why? Because God is faithful. God is faithful. And here, the Bible tells us of the faithfulness of God in verse number three. It says, but God came to Abimelech in a dream by night and said to him, behold, thou art but a dead man. That kind of gets your attention, right? Can you imagine? Abimelech, according to what we find here, God comes to him by night, by a dream. He says, behold, thou art but a dead man. Why? For the woman which thou hast taken, for she is a man's wife. Now Abimelech, prior to this, has no knowledge of this, for Abraham has said, she's my sister, and Sarah says, he's my brother. But God, God is faithful. God had made a promise with regard to the seed, the promise that had been made with regard to Abraham and Sarah having a son, Isaac, as we'd find in chapter 21. It says in verse number four, but Abimelech had not come near her, and he, Abimelech said, Lord, wilt thou slay also a righteous nation? Said he not unto me, she is my sister? And she, even she herself said, he is my brother. In the integrity of my heart, in an innocency of my hands have I done this thing? And God said unto him in a dream, yea, I know that thou didst this thing in the integrity of thy heart. For I also withheld thee from sinning against Me, therefore suffered I thee not to touch her.\" That's awesome, isn't it? The way that God intervened, the way that God worked. As I mentioned by way of introduction, just as I believe in Genesis chapter number 12 that God could have protected both Abraham and Sarah as they marched into Egypt land and dealt with Pharaoh, that God could have protected them here as well. Abraham did not have to say, she's my sister, and Sarah did not have to say, he's my brother. I believe that God would have provided a level of protection for them in that place. And God gives some instruction in verse number 7 to Abimelech. He says, Now therefore restore the man his wife, for he is a prophet, and he shall pray for thee, and thou shalt live. And if thou restore her not, know thou that thou shalt surely die, thou and all that are mine. Has God clearly communicated to Abimelech? Absolutely. I mean, God didn't mince any words, right? God clearly communicates to Abimelech, here's the situation, you're a dead man, because she is a man's wife. And he pleads his case, it was in the innocency of my heart, I mean, he said this and she said that, and I had no idea, and it was in the integrity of my heart that I've done this thing. And God says, I know, and that's why I've withheld thee from thee. That's why I did not allow you to go in unto her. And God says, here's what you need to do, you need to restore him his wife, and if you do not do that, I want you to know that thou shalt surely die, thou and all that are thine. Skip over, if you will, to verse number 17, as we consider, again, the faithfulness of God. We find in verse number 17 that Abraham prayed unto God. The Bible tells us that God healed Abimelech and his wife and his maidservants, and they bear children, for the Lord had fast closed up all the wombs of the house of Abimelech because of Sarah, Abraham's wife. God told Abimelech that if he would respond in such a way, he said this, not only would the consequence of not returning or restoring Sarah to Abraham that he would die and all that are thine, but he said that if you restore his wife, according to verse number 7, he is a prophet, and he shall pray for thee and thou shalt live. And we find that Abraham prayed unto God, and God heard that prayer, and God answered that prayer, and God healed Abimelech and his wife and the maidservants, and the Bible tells us that they bear children. God is faithful and mindful of many portions of Scripture. Turn to the book of Deuteronomy, if you will. Hold your place there in Genesis. We'll be back in just a moment. But consider what is said here in Deuteronomy chapter number 7. In Deuteronomy chapter number 7, in verse number 9, God is preparing His people for entrance into the land, Moses is providing instruction and preparation, and the Bible says, know therefore, in Deuteronomy 7 and verse number 9, that the Lord thy God, He is God, the faithful God, which keepeth covenant and mercy with them that love Him and keep His commandments to a thousand generations. He's faithful. Paul says to the believers in 1 Corinthians chapter number 1, in verse number 9, he says it this way very simply, God is faithful. The believers in Corinth had to understand the faithfulness of God, and Paul was rejoicing and understanding that he served a faithful God. I'm mindful of what Paul says to the believers in Thessalonica when he says this in 1 Thessalonians 5 and verse number 24, faithful is he that calleth you who also will do it. Our God is faithful. According to Revelation chapter number 19, when He returns, He'll have that name, faithful and true. He is faithful. He is faithful. Consider this, if you will, Lamentations chapter 3. Hold your place there in Genesis still, but I want you to turn to the book of Lamentations in chapter number 3. It's a verse of Scripture, really a portion of Scripture in which we have come familiar with. As we consider Lamentations 3 and consider the setting really for this particular book, and we'd understand that the Babylonians have taken captive the nation of Judah. The city is laying in ruins. If you read the first chapter of the book of Lamentations, you find that the city is just laid in ruins, and you find the destruction, and we find that it's in chapter number 3 is really as Jeremiah is lamenting all that's taking place. He says in verse number 19, remembering my affliction and my misery, the wormwood and the gall, my soul hath them still in remembrance and is humbled in me. But notice verse number 21, this I recall to my mind, therefore have I hope. It is of the Lord's mercies that we are not consumed, because His compassions fail not. They are new every morning, great is thy faithfulness. The Lord is my portion, saith my soul, therefore will I hope in Him. The Lord is good unto them that wait for Him, to the soul that seeketh Him. But there in verse number 23, they are new every morning, great is thy faithfulness. Our God is faithful, and His faithfulness is not dependent upon our faithfulness, and that should cause us to rejoice greatly, because there are many times in which we fail the Lord. We find that there are many times in which we get caught up, and the flesh would impact and influence us, and maybe we'd make decisions and operate in fear, even as Abraham does in this portion of Scripture in Genesis chapter number 20, but God is faithful. God is faithful. We see the fear of Abraham, we see the faithfulness of God, but I want you to consider with me maybe something a little bit different, but I want you to consider with me the faith of Abimelech. The faith of Abimelech. I'll be honest with you, as you begin to think about those that lived by faith, you begin to make a list of those that lived by faith, and you begin to name those great heroes of the faith, if you will, Abimelech probably has never made it on your list. Not somebody that we think about having faith. But I've often said this, that faith is believing God, faith is taking God at His Word, faith is acting upon the revealed Word of God, right? We speak about having faith, and we speak about the way in which our faith is increased by the truth of the Word of God. We find that the Bible says that it's through the hearing of the Word that our faith is increased, and we understand that we're to live by faith. Without faith, it's impossible to please Him. But I would submit to you this evening that Abimelech operates in faith here in chapter number 20 of the book of Genesis, because God speaks to Abimelech, and God gives Abimelech very clear instruction, and we find that Abimelech, when he understands that which he is told, we find that he demonstrates faith in what God said. Remember, as we looked in just a moment ago, the faithfulness of God, we see that God very plainly tells Abimelech in verse number 7 that He is to restore the man his wife, that if he restores her not, that thou shalt surely die, thou and all that are thine. Notice the response of Abimelech in verse number 8. The Bible says this, therefore Abimelech rose early in the morning and called all his servants and told all these things in their ears, and the men were sore afraid. Why are they afraid? Because God had spoken to Abimelech. And I believe that as God had spoken to Abimelech and said to Abimelech that this woman that you have, that she is a man's wife, and you need to return her, that if you do not do this, then you shall surely die and all that are thine, I believe that when he communicated this message to those that he called in verse number 8, that he communicated the message with a level of seriousness. I mean, he believed what God said. He believed that God was able to perform that which he said. It says in verse number 9, then Abimelech called Abraham and said unto him, what hast thou done unto us? And what have I offended thee that thou hast brought on me and on my kingdom a great sin? Thou hast done deeds unto me that ought not to be done. And Abimelech said unto Abraham, what sawest thou that thou hast done this thing? And we've read verses 11 through 13 already, but I want you to skip down to verse number 14. Look at what Abimelech did. The Bible says that Abimelech took sheep and oxen and men's servants and woman's servants and gave them unto Abraham and restored him, Sarah, his wife. Is that not what God told him to do? God said in verse number 3, thou art but a dead man, for the woman which thou hast taken, for she is a man's wife, and he says in verse number 7, now therefore restore the man. a man his wife.\" We find that in verse 14, the Bible tells us that he, Abimelech, not only did he restore Sarah to Abraham, but it says that he took sheep and oxen and men's servants and women's servants and gave them unto Abraham and restored him Sarah, his wife. You understand that it would have been all for naught if Abimelech would have simply given Abraham sheep and oxen and men's servants and women's servants. That would not have appeased God. If Abimelech said, I'm going to give you all these things, Abraham, but I'm keeping Sarah. What's going to happen? He's a dead man, right? Is that what God said? Thou art but a dead man. The only condition that God gave was that he, Abimelech, restore Sarah to Abraham. And so I'm of the opinion that if he did not include all of this other spoil and simply returned Sarah to Abraham, that he would have lived because that was the condition by which God had communicated to Abimelech what it was that he needed to do. See, Abimelech, do you see how he demonstrated faith? He believed that what God said that he was going to do, that God would do. In a certain sense, we could look at Genesis chapter number 20 and we could say that of the characters that are contained in this portion of scripture, that Abimelech has more faith than Abraham. Now that blows your mind, right? Because when we think of Abraham, we think of Abraham, he's the friend of God. I mean, he's faithful and he is. Abraham finds himself in Hebrews chapter 11 is the great hall of faith, right? But in this particular account, Abimelech is the one that demonstrates faith. Abimelech is the one that hears what God says and responds to it. In obedience. He continues in verse number 15, and Abimelech said, behold, my land is before thee. Dwell where it pleaseth thee. And unto Sarah, he said, behold, I have given thy brother a thousand pieces of silver. Behold, he is to thee a covering of the eyes and to all that are with thee and with all others. Thus, she was reproved. And then the Bible says that Abraham prayed unto God in verse number 17. Now, we understand that God had said to Abimelech in verse number seven, now therefore restore the man his wife for he is a prophet and he shall pray for thee and thou shalt live. I'm not sure if it was God who communicated to Abraham that he should pray for Abimelech or if it was Abimelech that communicated this to Abraham, but we find that Abraham prayed. And as Abraham prays, the Bible tells us that God healed Abimelech and his wife and his maidservants and their children. As we look at this portion of Scripture, we begin to see the evidence that is given to us. We find that Abraham's fear, as I started out the message this evening, I believe that his fear was known by his actions, but also as we think about the faith of Abimelech, that too was known by his actions. As we begin to look at this passage of Scripture and we consider the seriousness, listen, I've never traveled to a place where I was fearful that they would kill me and take Holly to be their wife. I've just never traveled to that place. Have you? It's not a common thing that happens. No doubt this was a common practice. It's something that's been repeated, not only in Genesis 12, but again in chapter number 20. No doubt that this was a serious fear that Abraham had. And he operates based upon that fear. As we begin to think about the specific circumstances of Genesis chapter number 20, many of us are not capable of relating to the specific circumstances. But as we begin to interpret Genesis chapter number 20 and understand the context and understand the purpose of God placing this truth to us in this portion of Scripture and keeping it preserved for us, we say, well, what is it that God wants us to learn? What is it that God wants us to learn in this repeat story in the life of Abraham? Number one, I would say this as to the takeaways, if you will, that God would like us to learn is that we never need to get to a place where we think that we've arrived. Because after 25 years of Abraham walking with God, after 25 years of God proving himself to Abraham and all that had transpired in all of those chapters, we find that when Abraham finds himself in this particular situation again, that he reverts back to that which he had previously done. We need to be careful to never think that we've arrived. And we need to understand this evening that as we look at a portion of Scripture like this, that it's easy for us to look at Genesis chapter number 20 and kind of scratch our head and say, what's wrong with Abraham? I mean, didn't he learn in chapter number 12? I mean, what's wrong with this guy? But sometimes we like to evaluate other people's lives more than we like to evaluate our own lives. Why is that? It's easier. It doesn't cause us to feel so bad. Right? I mean, honestly, when I evaluate someone else's life, whether it's someone in the pages of Scripture or otherwise, it's easy for me to evaluate their lives. It's easy for you to evaluate somebody else's life. But that process of self-evaluation and self-examination and saying, what about me? I started out this evening by saying, there are things no doubt in your life that you've done more than once. I mean, failures in your life. You say, man, how did I do this again? Abraham, as he's in this situation, I mean, I don't know how he must have felt back in Genesis chapter number 12 when Sarah is in the home of Pharaoh. Any men would feel comfortable with that? No. I wouldn't be very comfortable. Now, 25 years later, his wife Sarah is now with Abimelech. Man, how do you feel? And you, I mean, is Abraham not sitting there thinking, man, if I didn't say this or if I said that, I don't know. I'm just thinking about myself. That my wife is now in this place and perhaps a place of being vulnerable, a place of being taken advantage of, a place of I don't know all that's going to happen and it's because of this fear that I had. You understand what I'm saying? And we find this evening that, listen, we need to deal with the flesh, as I said this morning. See, because this thing of fear begins to cripple and paralyze, this thing of fear begins to dictate to Abraham what to do. See, there are times in which, even as he gives answer to Abimelech, that he says, listen, we made this agreement many years ago that anywhere we traveled that I would say she's my sister and she would say that I'm her brother. But you know what? There might be an agreement that was made that after you experience all that God has done, you say, no, we don't have to operate under those agreements any longer, right? Because we've seen that God is faithful. When we see what God did in Genesis chapter number 12, it prepares us for the next encounter, the next difficulty in which we have to experience. And so I would say that as we look at this portion of scripture that we need to be careful to acknowledge that in the life of Abraham, as we see this repeat offense, that we too would understand that we're but flesh. And we must be careful to daily walk with God and to trust God. God is able to do exceeding abundantly above all that we ask or think. But how's God gonna do it? I don't know, but God is able. Amen? I mean, think about what God did here. Did not God prove His power by preventing Abimelech from violating Sarah? By preventing anything from taking place? By closing up the wombs of those people of Gerar? How did God do all of this? Because He's God. He's God. And so this evening, as we look at this portion of scripture and we begin to think about Abraham and understanding what's taking place and we learn some lessons from Abraham, let us also learn some lessons from God. He's always faithful. Listen, God's never gonna fail you. You can find yourself in all sorts of situations in life. You can find yourself in places. Listen, we're living in a crazy world right now. We're living in a world in which people are trying to get folks to do all sorts of crazy things and trying to force and make us do something. Listen, we have a God who's faithful. We have a God who is able. The problem sometimes in our lives is that it's a scary thing to prove God. What do I mean by that? It's a whole lot easier to just rely on your own understanding. Amen? You know what He said there in the book of Malachi? Prove me. He was speaking contextually about giving. Listen, giving is a process of proving God because you're gonna say, I'm gonna give to God first and then I'm gonna expect that God's gonna take care of my needs. You say, I can't take care of my needs with all of it. How am I gonna take care of my needs with less? But God says, prove me. He says, prove me. Not only, and this is the twofold blessing that we see in giving, is God says, not only am I gonna bless you, but I'm gonna rebuke the devout. hour.\" And you say, well that's a pretty good deal. And guess what? God is faithful. Have you not found it to be so? I remember as a kid, I was almost a teenager when my parents got saved just a few months away from being 13 years old. It does not mean that I knew everything that was going on in the home. There are plenty of things that I did not know about, but I remember hearing my dad, not only that at that particular time after his conversion, but talking about stories about it afterwards, when they made the decision that they were gonna start giving. They were gonna start tithing. Listen, if you were raised to do that, and that's something. See, Holly and I, we were we were saved and we were giving before we ever got married, so it was just part of what we did. And when you got all kinds of bills already, and you're already doing whatever, and then it's like, hey we got saved and now we need to start doing this. Has God ever failed you? Not one time. God is faithful. He's faithful. Look at what God did for Abraham and Sarah here in Genesis chapter 20. We can't come up with those certain... we can't concoct that plan, can we? No. There's no way that Abraham could prevent Abimelech from doing anything to Sarah. There's no way in his own power that he was gonna preserve his own life. But God is faithful. So we learn a lesson about Abraham, and how we can, listen, we can sometimes operate in fear. We need to be careful. We need to deal with the flesh. Learn a lesson about God. He's always faithful, and He always will be. Let's learn a lesson about faith. How about we just take God at His word? Just believe God. I don't understand how it's all gonna work out. That can drive us crazy sometimes. It honestly can. And if you're the analytical type as I am, and you like to figure everything out, it all needs to make sense, it can really mess you up. Amen? But we've been called to live by faith. The just shall live by faith. The just shall live by faith. Just believe in God. Having that kind of faith that we say based upon God's word. Listen, when we talk about faith, sometimes people get this idea of living by faith means that we just jump and do whatever and say, man, I was living by faith. I just did all this by faith. No, faith is taking God at His word. Peter didn't step out of the boat until God bid him to. Amen? He said, Lord, if it be Thou, bid me come unto Thee. Right? And Jesus said, come. And based upon that, Peter went. And what happened? Peter walked on water. He didn't walk on water for long because he got his eyes off of the Lord, but he walked on water. He was not presumptuous. He didn't just go. Listen, when the children of Israel, when they were told to go into the land of promise, they were to go and they would bring back that report. Remember the 12 spies went. And the 10 of them, they brought a report that was a report based on sight. We're not able. I mean, there are giants in the land and there's all these things going on and they have walled cities and fortified cities and they're too great for us. Joshua and Caleb said, if God is in it, God will do it because God is able. And do you remember at the end of that portion of scripture in Numbers chapter 14, there was a contingent of them that decided presumptuously that they were going to go up and try to take and enter in. And guess what? Moses told them, don't do it. God is not with you. And what happened? Failure. That's what happened. Why? Because they weren't operating in faith. They were just doing what they wanted to do. They were thinking, we're going to correct this problem by just going out and do this. No, God didn't tell them to do it. And so when we think about faith, we as the people of God were to be living by faith, living by faith. What does God say? Search it out, study it out and say, I want to live by faith. I want to take God at His word. A portion of scripture that's always been so precious to me is Acts 27, when Paul stands with great boldness and declares, I believe God. It's a powerful statement. It's a powerful expression of faith. Here's what God said. It doesn't matter that we've not seen the stars and the moon, the sun. It doesn't matter that we are tossed in this crazy storm. It doesn't matter that all hope that we should be saved is gone. Because God said, the ship's going to be destroyed, but not one of our lives are going to be lost. And I believe God that it shall be even as He said. And we just begin to live by faith. Genesis chapter 20, a historical account, an account in the life of Abraham. But we learn lessons for today. The enemy still tries to use fear to paralyze the people of God. Still today he uses fear. But God hath not given us the spirit of fear. Amen? He's not given us the spirit of fear. But what's going to happen? How's this going to work? How's that? But God? That's how verse 3 starts in Genesis 20, but God. What's the but God in my life and in your life? How's God going to show up and show that He's faithful? Because He is, and He just wants us to trust Him. Oh, that we'd live by faith. Abimelech, he believed what God said, and he acted thereon. He said, here's your wife and here's a whole bunch of other stuff. Pray for me. And God blessed because God is faithful. Let's pray. Father, we love You. We thank You for loving us. I pray that we'd learn some lessons from Genesis 20. It's easy for us to evaluate and criticize the life of Abraham, to see his failure, if you will, in this portion of Scripture, being controlled by fear. But I pray that as we evaluate that, that we'd understand that we too are but dust, that our flesh is weak. You'd help us to take heed lest we also fall. I pray, God, that You'd help us to be mindful of Your faithfulness tonight. Oh, God, that it would just give us a peace, knowing that You are the faithful God, that Your name is faithful. And God, I pray that You'd help us to live by faith. As we see the response of Abimelech to the revelation of God, I pray that we too would live in faith, live by faith. We ask that You'd work in hearts and lives, that decisions would be made that would please Thee. We'll thank You for it. In Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.320000171661377,
      "text": " Chapter number 20 this evening, Genesis chapter number 20, and as we look at this portion"
    },
    {
      "id": 1,
      "start": 4.320000171661377,
      "end": 7.880000114440918,
      "text": " of scripture, we'll be looking at the entirety of the chapter this evening."
    },
    {
      "id": 2,
      "start": 7.880000114440918,
      "end": 11.600000381469727,
      "text": " And we've been studying through the book of Genesis periodically here over the last couple"
    },
    {
      "id": 3,
      "start": 11.600000381469727,
      "end": 16.18000030517578,
      "text": " of years, and there'll be certain periods of time in which we're very consistent week"
    },
    {
      "id": 4,
      "start": 16.18000030517578,
      "end": 20.239999771118164,
      "text": " after week right there in the book of Genesis, and then there are other times in which we'll"
    },
    {
      "id": 5,
      "start": 20.239999771118164,
      "end": 22.559999465942383,
      "text": " stray away for a little while and then get back to the book."
    },
    {
      "id": 6,
      "start": 22.559999465942383,
      "end": 28.0,
      "text": " This is our 52nd lesson through the book of Genesis, and I have thoroughly enjoyed the"
    },
    {
      "id": 7,
      "start": 28.0,
      "end": 30.459999084472656,
      "text": " study and trust that you have as well."
    },
    {
      "id": 8,
      "start": 30.459999084472656,
      "end": 34.599998474121094,
      "text": " And here as we get to Genesis chapter number 20, we're really reminded of an event that"
    },
    {
      "id": 9,
      "start": 34.599998474121094,
      "end": 39.400001525878906,
      "text": " took place back in Genesis chapter number 12 in the life of Abraham and Sarah."
    },
    {
      "id": 10,
      "start": 39.400001525878906,
      "end": 43.84000015258789,
      "text": " Of course, at that particular time, their names were Abram and Sarai."
    },
    {
      "id": 11,
      "start": 43.84000015258789,
      "end": 47.84000015258789,
      "text": " Their names had not yet been changed, but as we think back to that event that was recorded"
    },
    {
      "id": 12,
      "start": 47.84000015258789,
      "end": 52.619998931884766,
      "text": " back in Genesis chapter number 12, we are told that there was a great famine and they"
    },
    {
      "id": 13,
      "start": 52.619998931884766,
      "end": 58.18000030517578,
      "text": " traveled to Egypt, and as they would travel to Egypt because of that great famine, we"
    },
    {
      "id": 14,
      "start": 58.18000030517578,
      "end": 61.97999954223633,
      "text": " find that Sarah was taken into Pharaoh's home."
    },
    {
      "id": 15,
      "start": 61.97999954223633,
      "end": 68.33999633789062,
      "text": " And we find that it was because of what Abraham said of Sarah, she is my sister."
    },
    {
      "id": 16,
      "start": 68.33999633789062,
      "end": 73.58000183105469,
      "text": " And we spoke about that portion of scripture, and we talked about the way in which God intervened"
    },
    {
      "id": 17,
      "start": 73.58000183105469,
      "end": 78.33999633789062,
      "text": " in Genesis chapter number 12, and as we looked at that portion of scripture in Genesis chapter"
    },
    {
      "id": 18,
      "start": 78.33999633789062,
      "end": 84.0199966430664,
      "text": " number 12, we made several observations from that passage, but one of the things that we"
    },
    {
      "id": 19,
      "start": 84.0199966430664,
      "end": 87.73999786376953,
      "text": " noted was that our God is able, amen?"
    },
    {
      "id": 20,
      "start": 87.73999786376953,
      "end": 93.77999877929688,
      "text": " We don't have to use some type of story and use some type of deception as which Abram"
    },
    {
      "id": 21,
      "start": 93.77999877929688,
      "end": 96.86000061035156,
      "text": " and Sarah did there in Genesis chapter number 12."
    },
    {
      "id": 22,
      "start": 96.86000061035156,
      "end": 102.91999816894531,
      "text": " I believe with all of my heart that as Abraham was fearful because of Sarah, that he'd go"
    },
    {
      "id": 23,
      "start": 103.04000091552734,
      "end": 109.04000091552734,
      "text": " into that place, and because of her being beautiful, they would kill him for her, and"
    },
    {
      "id": 24,
      "start": 109.04000091552734,
      "end": 113.80000305175781,
      "text": " I believe that he had that fear, but I believe with all of my heart that Abraham could have"
    },
    {
      "id": 25,
      "start": 113.80000305175781,
      "end": 120.72000122070312,
      "text": " walked right into that place and said, she's my wife, what are you going to do about it?"
    },
    {
      "id": 26,
      "start": 120.72000122070312,
      "end": 124.12000274658203,
      "text": " Because God is able, amen?"
    },
    {
      "id": 27,
      "start": 124.12000274658203,
      "end": 125.66000366210938,
      "text": " Because God is able."
    },
    {
      "id": 28,
      "start": 125.66000366210938,
      "end": 129.60000610351562,
      "text": " And I dealt with that in Genesis chapter number 12, and I asked this question at the end of"
    },
    {
      "id": 29,
      "start": 129.60000610351562,
      "end": 134.67999267578125,
      "text": " that study, I wonder if as we look at that portion of scripture, and we look at that"
    },
    {
      "id": 30,
      "start": 134.67999267578125,
      "end": 140.8000030517578,
      "text": " event historically, and we make some application for our lives, I wonder if Abraham would learn"
    },
    {
      "id": 31,
      "start": 140.8000030517578,
      "end": 141.8000030517578,
      "text": " a lesson."
    },
    {
      "id": 32,
      "start": 141.8000030517578,
      "end": 145.16000366210938,
      "text": " Now, we could answer the question because we have the Bible, and we know that in Genesis"
    },
    {
      "id": 33,
      "start": 145.16000366210938,
      "end": 150.24000549316406,
      "text": " chapter number 20, as we'll study this evening, he does the same thing, but you know there"
    },
    {
      "id": 34,
      "start": 150.24000549316406,
      "end": 157.05999755859375,
      "text": " are times in your life and in my life when we make the same mistake more than once, amen?"
    },
    {
      "id": 35,
      "start": 157.05999755859375,
      "end": 162.74000549316406,
      "text": " And perhaps when we make that mistake, we fail to live by faith, we fail to trust God,"
    },
    {
      "id": 36,
      "start": 162.74000549316406,
      "end": 168.16000366210938,
      "text": " and we see God work, and we see God intervene, and we say, man, I'm going to learn my lesson,"
    },
    {
      "id": 37,
      "start": 168.16000366210938,
      "end": 172.17999267578125,
      "text": " but then the circumstances may change, and it may be a period of time, and we go down"
    },
    {
      "id": 38,
      "start": 172.17999267578125,
      "end": 176.17999267578125,
      "text": " the same path, and we doubt God."
    },
    {
      "id": 39,
      "start": 176.17999267578125,
      "end": 178.74000549316406,
      "text": " Listen, God knows that we're but flesh."
    },
    {
      "id": 40,
      "start": 178.74000549316406,
      "end": 183.27999877929688,
      "text": " I'm not saying that to make an excuse for our failures, but I'm simply saying that God"
    },
    {
      "id": 41,
      "start": 183.27999877929688,
      "end": 185.5800018310547,
      "text": " knows our frame, amen?"
    },
    {
      "id": 42,
      "start": 185.5800018310547,
      "end": 190.66000366210938,
      "text": " As we look here at the account in Genesis chapter number 20, we would find that between"
    },
    {
      "id": 43,
      "start": 190.66000366210938,
      "end": 194.86000061035156,
      "text": " the time in Genesis chapter number 12 and the time in which we're looking here in Genesis"
    },
    {
      "id": 44,
      "start": 194.86000061035156,
      "end": 198.77999877929688,
      "text": " chapter number 20, nearly 25 years had passed."
    },
    {
      "id": 45,
      "start": 198.77999877929688,
      "end": 202.33999633789062,
      "text": " In Genesis chapter number 12, the Bible tells us in that portion of Scripture that Abraham"
    },
    {
      "id": 46,
      "start": 202.33999633789062,
      "end": 204.39999389648438,
      "text": " is 75 years old."
    },
    {
      "id": 47,
      "start": 204.39999389648438,
      "end": 209.5399932861328,
      "text": " As best we can tell, in Genesis chapter number 20, he's somewhere between 99 and 100."
    },
    {
      "id": 48,
      "start": 209.5399932861328,
      "end": 213.63999938964844,
      "text": " We understand that if you look at the passage of Scripture, you'll find that just a few"
    },
    {
      "id": 49,
      "start": 213.6999969482422,
      "end": 217.75999450683594,
      "text": " chapters earlier, we're told of him being 99 years old, and then when you get into chapter"
    },
    {
      "id": 50,
      "start": 217.75999450683594,
      "end": 221.60000610351562,
      "text": " number 21, and you deal with the birth of Isaac, he's 100."
    },
    {
      "id": 51,
      "start": 221.60000610351562,
      "end": 225.60000610351562,
      "text": " And so he's somewhere between 99 and 100, he's probably closer to 100 than 99, but the"
    },
    {
      "id": 52,
      "start": 225.60000610351562,
      "end": 230.52000427246094,
      "text": " reality is that 25 years is a long time."
    },
    {
      "id": 53,
      "start": 230.52000427246094,
      "end": 240.86000061035156,
      "text": " And in those 25 years, God had proven himself to Abraham over and over and over, amen?"
    },
    {
      "id": 54,
      "start": 240.86000061035156,
      "end": 246.5800018310547,
      "text": " God had demonstrated his power to Abraham in amazing ways."
    },
    {
      "id": 55,
      "start": 246.5800018310547,
      "end": 251.94000244140625,
      "text": " We find that as we would think about this period of time, 25 years in which he'd experienced"
    },
    {
      "id": 56,
      "start": 251.94000244140625,
      "end": 257.6600036621094,
      "text": " so much, and as we look at the same mistake being made, the same deception being given"
    },
    {
      "id": 57,
      "start": 257.6600036621094,
      "end": 261.8399963378906,
      "text": " to Abimelech that was given to Pharaoh here in Genesis chapter number 20, we could ask"
    },
    {
      "id": 58,
      "start": 261.8399963378906,
      "end": 266.1000061035156,
      "text": " ourselves questions such as, how did this happen?"
    },
    {
      "id": 59,
      "start": 266.1000061035156,
      "end": 268.739990234375,
      "text": " Did he not learn his lesson last time?"
    },
    {
      "id": 60,
      "start": 268.7799987792969,
      "end": 273.5,
      "text": " After all that God did for him, after all that God revealed to him, how is it that he"
    },
    {
      "id": 61,
      "start": 273.5,
      "end": 276.739990234375,
      "text": " could still behave in this manner?"
    },
    {
      "id": 62,
      "start": 276.739990234375,
      "end": 281.2200012207031,
      "text": " And I would simply offer a single word as an answer, and it's flesh."
    },
    {
      "id": 63,
      "start": 281.2200012207031,
      "end": 283.4599914550781,
      "text": " It's what we dealt with this morning."
    },
    {
      "id": 64,
      "start": 283.4599914550781,
      "end": 285.739990234375,
      "text": " Crucify your flesh."
    },
    {
      "id": 65,
      "start": 285.739990234375,
      "end": 286.739990234375,
      "text": " Crucify your flesh."
    },
    {
      "id": 66,
      "start": 286.739990234375,
      "end": 292.05999755859375,
      "text": " And so we think about this portion of Scripture as, by way of introduction before we get into"
    },
    {
      "id": 67,
      "start": 292.05999755859375,
      "end": 295.6600036621094,
      "text": " the chapter, I want you to be mindful, and I'm just going to go very quickly through"
    },
    {
      "id": 68,
      "start": 295.6600036621094,
      "end": 299.82000732421875,
      "text": " these events and just really kind of highlight several things, but I want you to be mindful"
    },
    {
      "id": 69,
      "start": 299.82000732421875,
      "end": 305.4800109863281,
      "text": " that at the end of Genesis chapter number 12, God worked in such a supernatural way"
    },
    {
      "id": 70,
      "start": 305.4800109863281,
      "end": 311.260009765625,
      "text": " in order to restore Sarah to Abraham in the life of Pharaoh that no doubt Abraham saw"
    },
    {
      "id": 71,
      "start": 311.260009765625,
      "end": 313.4599914550781,
      "text": " the hand of God."
    },
    {
      "id": 72,
      "start": 313.4599914550781,
      "end": 316.4200134277344,
      "text": " Abraham saw God work in a very distinct way."
    },
    {
      "id": 73,
      "start": 316.4200134277344,
      "end": 320.9800109863281,
      "text": " In Genesis chapter number 13, we find that God gives that land to Abraham."
    },
    {
      "id": 74,
      "start": 320.9800109863281,
      "end": 325.0199890136719,
      "text": " Remember, he'd promised him a land, and we find that as you study chapter number 13,"
    },
    {
      "id": 75,
      "start": 325.0199890136719,
      "end": 329.3800048828125,
      "text": " that that land is given, we're mindful of the fact in which in chapter number 14, there"
    },
    {
      "id": 76,
      "start": 329.3800048828125,
      "end": 336.9800109863281,
      "text": " was that coalition, if you will, of army, those men that took captive Lot and many others,"
    },
    {
      "id": 77,
      "start": 336.9800109863281,
      "end": 340.4200134277344,
      "text": " and we find that God gave great victory to Abraham."
    },
    {
      "id": 78,
      "start": 340.4200134277344,
      "end": 344.739990234375,
      "text": " Remember, he took those trained servants from his home, and it was in that portion of Scripture"
    },
    {
      "id": 79,
      "start": 344.739990234375,
      "end": 350.4599914550781,
      "text": " in which Abraham understood that God is the possessor of heaven and earth."
    },
    {
      "id": 80,
      "start": 350.4599914550781,
      "end": 355.6199951171875,
      "text": " It was in that portion of Scripture in which God revealed to Abraham that he's El Elyon,"
    },
    {
      "id": 81,
      "start": 355.6199951171875,
      "end": 357.6600036621094,
      "text": " the most high God."
    },
    {
      "id": 82,
      "start": 357.6600036621094,
      "end": 364.1400146484375,
      "text": " It's in that portion of Scripture before this man Abraham would ever meet the king that"
    },
    {
      "id": 83,
      "start": 364.1400146484375,
      "end": 369.1000061035156,
      "text": " he would meet after the great victory and go through meeting the king of Salem that"
    },
    {
      "id": 84,
      "start": 369.1000061035156,
      "end": 376.1400146484375,
      "text": " he would meet, excuse me, the king of Sodom that he would meet the king of Salem, Mephibosheth."
    },
    {
      "id": 85,
      "start": 376.1400146484375,
      "end": 379.7799987792969,
      "text": " Not Mephibosheth, that was a mistake, amen?"
    },
    {
      "id": 86,
      "start": 379.7799987792969,
      "end": 384.17999267578125,
      "text": " He did not meet Mephibosheth, that's over in the book, in David's life."
    },
    {
      "id": 87,
      "start": 384.17999267578125,
      "end": 390.05999755859375,
      "text": " It was there that he would meet, there in chapter number 13, that he would meet, somebody"
    },
    {
      "id": 88,
      "start": 390.05999755859375,
      "end": 392.17999267578125,
      "text": " help me out here, who is it that he's going to meet?"
    },
    {
      "id": 89,
      "start": 392.17999267578125,
      "end": 393.17999267578125,
      "text": " Who is it?"
    },
    {
      "id": 90,
      "start": 393.17999267578125,
      "end": 394.17999267578125,
      "text": " Melchizedek."
    },
    {
      "id": 91,
      "start": 394.17999267578125,
      "end": 395.17999267578125,
      "text": " Melchizedek."
    },
    {
      "id": 92,
      "start": 395.17999267578125,
      "end": 396.17999267578125,
      "text": " What in the world?"
    },
    {
      "id": 93,
      "start": 396.17999267578125,
      "end": 399.29998779296875,
      "text": " All I could keep thinking is Mephibosheth, and you ever get something stuck in your brain"
    },
    {
      "id": 94,
      "start": 399.29998779296875,
      "end": 402.3800048828125,
      "text": " and like nothing else kind of can fit in your brain at that point?"
    },
    {
      "id": 95,
      "start": 402.3800048828125,
      "end": 408.7799987792969,
      "text": " And so, he of course goes, and remember, when he comes into that place in Genesis chapter"
    },
    {
      "id": 96,
      "start": 408.7799987792969,
      "end": 414.8599853515625,
      "text": " number 13, that we find that it's there in which he finds that God is the most high God,"
    },
    {
      "id": 97,
      "start": 414.8599853515625,
      "end": 420.29998779296875,
      "text": " he's the possessor of heaven and earth, we find that God will tell Abraham in that portion"
    },
    {
      "id": 98,
      "start": 420.29998779296875,
      "end": 425.739990234375,
      "text": " of Scripture as Melchizedek will reveal these truths to him, and then we find that God tells"
    },
    {
      "id": 99,
      "start": 425.739990234375,
      "end": 433.739990234375,
      "text": " Abraham in Genesis chapter number 15, fear not, I am thy shield, and thy exceeding great"
    },
    {
      "id": 100,
      "start": 433.739990234375,
      "end": 434.739990234375,
      "text": " reward."
    },
    {
      "id": 101,
      "start": 434.739990234375,
      "end": 443.29998779296875,
      "text": " So, oh, God is proving himself to Abraham, and we find that as he makes that covenant"
    },
    {
      "id": 102,
      "start": 443.29998779296875,
      "end": 450.260009765625,
      "text": " in chapter number 15, and he proves himself there to Abraham with regard again to a land"
    },
    {
      "id": 103,
      "start": 450.260009765625,
      "end": 456.6199951171875,
      "text": " and to a seed, and we come to chapter number 16, and yes, we read about the birth of Ishmael,"
    },
    {
      "id": 104,
      "start": 456.6199951171875,
      "end": 462.1000061035156,
      "text": " and we find there in that portion of Scripture, after many years had passed, that Abraham"
    },
    {
      "id": 105,
      "start": 462.1000061035156,
      "end": 467.5400085449219,
      "text": " and Sarah, they make this decision, but we find that after those ten years, that Ishmael"
    },
    {
      "id": 106,
      "start": 467.5400085449219,
      "end": 472.6600036621094,
      "text": " would be born, and God reiterates his promise to Abraham."
    },
    {
      "id": 107,
      "start": 472.6600036621094,
      "end": 478.6600036621094,
      "text": " Abraham, though you've operated outside of what I've communicated to you, my will for"
    },
    {
      "id": 108,
      "start": 478.6600036621094,
      "end": 483.1400146484375,
      "text": " you has not yet changed, and here's the promise that I make to you."
    },
    {
      "id": 109,
      "start": 483.1400146484375,
      "end": 486.8999938964844,
      "text": " Thirteen years pass between the end of chapter number 16 and the beginning of chapter number"
    },
    {
      "id": 110,
      "start": 486.8999938964844,
      "end": 488.5,
      "text": " 17."
    },
    {
      "id": 111,
      "start": 488.5,
      "end": 492.260009765625,
      "text": " We find that it's there again in chapter number 17, when God tells us that Abraham"
    },
    {
      "id": 112,
      "start": 492.260009765625,
      "end": 496.8599853515625,
      "text": " is 99 years old, that it's in that portion of Scripture when the Lord appears to him"
    },
    {
      "id": 113,
      "start": 496.8599853515625,
      "end": 502.9800109863281,
      "text": " and now will reveal himself to Abraham as being El Shaddai, the Lord God Almighty."
    },
    {
      "id": 114,
      "start": 502.9800109863281,
      "end": 508.6600036621094,
      "text": " It begins to, again, reinforce the promises that he's made to Abraham."
    },
    {
      "id": 115,
      "start": 508.6600036621094,
      "end": 515.5,
      "text": " He'll ask the question in chapter number 18, is anything too hard for the Lord?"
    },
    {
      "id": 116,
      "start": 515.5,
      "end": 526.219970703125,
      "text": " We find that it's there in chapter number 18, as God is interacting there with Abraham,"
    },
    {
      "id": 117,
      "start": 526.219970703125,
      "end": 530.8599853515625,
      "text": " that God is giving Abraham insight as to the destruction of Sodom and Gomorrah that would"
    },
    {
      "id": 118,
      "start": 530.8599853515625,
      "end": 535.97998046875,
      "text": " be forthcoming, and Abraham talks with God."
    },
    {
      "id": 119,
      "start": 535.97998046875,
      "end": 538.0399780273438,
      "text": " He communes with God."
    },
    {
      "id": 120,
      "start": 538.0399780273438,
      "end": 541.9400024414062,
      "text": " We come to chapter number 19, and we find that the destruction of Sodom and Gomorrah"
    },
    {
      "id": 121,
      "start": 541.9400024414062,
      "end": 546.9400024414062,
      "text": " is revealed to us, and as we would think about all that has happened in a quick overview"
    },
    {
      "id": 122,
      "start": 546.9400024414062,
      "end": 553.280029296875,
      "text": " of all of those chapters, I would say over 25 years, God had proven himself to Abraham."
    },
    {
      "id": 123,
      "start": 553.280029296875,
      "end": 555.5,
      "text": " Would you not agree?"
    },
    {
      "id": 124,
      "start": 555.5,
      "end": 556.5,
      "text": " He revealed himself."
    },
    {
      "id": 125,
      "start": 556.5,
      "end": 561.02001953125,
      "text": " He had proven himself, and yet we come to chapter number 20."
    },
    {
      "id": 126,
      "start": 561.02001953125,
      "end": 562.780029296875,
      "text": " The circumstances are not known."
    },
    {
      "id": 127,
      "start": 562.780029296875,
      "end": 567.5999755859375,
      "text": " The circumstances are not communicated to us as to why it is that the decision is made"
    },
    {
      "id": 128,
      "start": 567.5999755859375,
      "end": 571.239990234375,
      "text": " in this journey that is recorded for us in Genesis chapter number 20."
    },
    {
      "id": 129,
      "start": 571.239990234375,
      "end": 576.4000244140625,
      "text": " In the 12th chapter of Genesis, when they go into Egypt, God reveals to us it's because"
    },
    {
      "id": 130,
      "start": 576.4000244140625,
      "end": 579.52001953125,
      "text": " of a great famine that's in the land."
    },
    {
      "id": 131,
      "start": 579.52001953125,
      "end": 582.3200073242188,
      "text": " Here in chapter number 20, we do not have those details."
    },
    {
      "id": 132,
      "start": 582.3200073242188,
      "end": 587.4600219726562,
      "text": " Many have sought to come up with some type of an idea as to why it is that they traveled,"
    },
    {
      "id": 133,
      "start": 587.4600219726562,
      "end": 592.3200073242188,
      "text": " but this evening I'll just tell you, I don't know."
    },
    {
      "id": 134,
      "start": 592.3200073242188,
      "end": 598.2000122070312,
      "text": " We don't know why they traveled, but the Bible begins, and Abraham journeyed from fence"
    },
    {
      "id": 135,
      "start": 598.2000122070312,
      "end": 600.0399780273438,
      "text": " toward the south country and dwelt."
    },
    {
      "id": 0,
      "start": 600.0399780273438,
      "end": 607.0799779891968,
      "text": " between Kadesh and Shur and sojourned in Gerar. And Abraham said of Sarah his wife,"
    },
    {
      "id": 1,
      "start": 607.0799779891968,
      "end": 617.1199779510498,
      "text": " She is my sister. And Abimelech king of Gerar sent and took Sarah.\" Notice in"
    },
    {
      "id": 2,
      "start": 617.1199779510498,
      "end": 624.9599781036377,
      "text": " verse number 7, the Bible says, Now therefore restore the man his wife, for"
    },
    {
      "id": 3,
      "start": 624.9599781036377,
      "end": 628.6399784088135,
      "text": " he is a prophet, and he shall pray for thee, and thou shalt live. And if thou"
    },
    {
      "id": 4,
      "start": 628.6399784088135,
      "end": 635.7599792480469,
      "text": " restore her not, know thou that thou shalt surely die, thou and all that are"
    },
    {
      "id": 5,
      "start": 635.7599792480469,
      "end": 639.799976348877,
      "text": " thine. The title for the message this evening is derived from verse number 7,"
    },
    {
      "id": 6,
      "start": 639.799976348877,
      "end": 645.6399765014648,
      "text": " Restore the man his wife. Restore the man his wife. As you take notes this evening,"
    },
    {
      "id": 7,
      "start": 645.6399765014648,
      "end": 650.5599784851074,
      "text": " I want you to notice first of all the fear of Abraham. The fear of Abraham. As"
    },
    {
      "id": 8,
      "start": 650.5599784851074,
      "end": 654.359977722168,
      "text": " we look at this portion of Scripture, the Bible tells us, as we've read verses 1"
    },
    {
      "id": 9,
      "start": 654.359977722168,
      "end": 658.919979095459,
      "text": " and 2 already, that they travel, they sojourn, and they find themselves in"
    },
    {
      "id": 10,
      "start": 658.919979095459,
      "end": 663.799976348877,
      "text": " Gerar. The Bible says that the the king of this place is Abimelech, and as we"
    },
    {
      "id": 11,
      "start": 663.799976348877,
      "end": 668.5999755859375,
      "text": " would find that Sarah and Abraham arrive in this place, remember that God had"
    },
    {
      "id": 12,
      "start": 668.5999755859375,
      "end": 673.359977722168,
      "text": " reinforced his promise, he says to Abraham in very certain terms in"
    },
    {
      "id": 13,
      "start": 673.359977722168,
      "end": 681.0799789428711,
      "text": " chapters 17 and 18, that Sarah thy wife shall have a son. We find that God has"
    },
    {
      "id": 14,
      "start": 681.0799789428711,
      "end": 686.5599746704102,
      "text": " given these promises to Abraham, and now we find that as he comes to this place,"
    },
    {
      "id": 15,
      "start": 686.5599746704102,
      "end": 694.3999786376953,
      "text": " that he says of Sarah that she is my sister. She is my sister. What is it"
    },
    {
      "id": 16,
      "start": 694.3999786376953,
      "end": 699.3199768066406,
      "text": " that would motivate Abraham to say that she is my sister? We understand that as"
    },
    {
      "id": 17,
      "start": 699.3199768066406,
      "end": 703.0399780273438,
      "text": " we look at the portion of Scripture, if you skip over to verse number 11, that"
    },
    {
      "id": 18,
      "start": 703.0399780273438,
      "end": 708.1599807739258,
      "text": " there's insight that is given for Abimelech asks Abraham why it is that he"
    },
    {
      "id": 19,
      "start": 708.1599807739258,
      "end": 711.7199783325195,
      "text": " did this thing, and we find that Abraham says this in verse number 11,"
    },
    {
      "id": 20,
      "start": 711.7199783325195,
      "end": 717.5999755859375,
      "text": " because I thought surely the fear of God is not in this place, and they will slay"
    },
    {
      "id": 21,
      "start": 717.5999755859375,
      "end": 722.1999816894531,
      "text": " me for my wife's sake. Now isn't it interesting that this man, Abraham, was"
    },
    {
      "id": 22,
      "start": 722.1999816894531,
      "end": 725.9199752807617,
      "text": " concerned that he was in a place in which they did not fear the Lord, but yet"
    },
    {
      "id": 23,
      "start": 725.9199752807617,
      "end": 732.6399841308594,
      "text": " he himself is operating under fear. He's fearful for his own life. He's fearful"
    },
    {
      "id": 24,
      "start": 732.6399841308594,
      "end": 736.8799743652344,
      "text": " that, the Bible tells us in verse number 11, that they will slay me for my wife's"
    },
    {
      "id": 25,
      "start": 736.9199829101562,
      "end": 741.7599792480469,
      "text": " sake, and yet indeed she is my sister. She is the daughter of my father, but not the"
    },
    {
      "id": 26,
      "start": 741.7599792480469,
      "end": 746.3599853515625,
      "text": " daughter of my mother, and she became my wife. We dealt with this in chapter"
    },
    {
      "id": 27,
      "start": 746.3599853515625,
      "end": 750.9999847412109,
      "text": " number 12, that this was an accepted practice during this particular era, and"
    },
    {
      "id": 28,
      "start": 750.9999847412109,
      "end": 755.2399749755859,
      "text": " we find that he is making this really, I believe as you look at verse number 12"
    },
    {
      "id": 29,
      "start": 755.2399749755859,
      "end": 760.7999725341797,
      "text": " and 13, that what's happening is Abraham is justifying his logic. You know the"
    },
    {
      "id": 30,
      "start": 760.7999725341797,
      "end": 764.1599731445312,
      "text": " reality is that there are times in which we are really good at justifying our"
    },
    {
      "id": 31,
      "start": 764.1599731445312,
      "end": 771.719970703125,
      "text": " disobedience. We get really, really creative on how it is that we can"
    },
    {
      "id": 32,
      "start": 771.719970703125,
      "end": 777.6399841308594,
      "text": " justify operating in fear, how it is that we can operate in disobedience, and we"
    },
    {
      "id": 33,
      "start": 777.6399841308594,
      "end": 782.47998046875,
      "text": " justify our actions, and we find that Abraham is providing this justification."
    },
    {
      "id": 34,
      "start": 782.47998046875,
      "end": 786.0799713134766,
      "text": " Not only does he say, well really she's my half-sister in verse number 12, she is"
    },
    {
      "id": 35,
      "start": 786.0799713134766,
      "end": 789.3199768066406,
      "text": " the daughter of my father, but not the daughter of my mother. Notice in verse"
    },
    {
      "id": 36,
      "start": 789.3199768066406,
      "end": 793.5599822998047,
      "text": " number 13, and it came to pass when God caused me to wander from my father's"
    },
    {
      "id": 37,
      "start": 793.6399841308594,
      "end": 798.7999725341797,
      "text": " house, he's gonna go all the way back to when he first left, when God first called"
    },
    {
      "id": 38,
      "start": 798.7999725341797,
      "end": 804.5199737548828,
      "text": " him, and he says that at that time that I said unto her, this is thy kindness which"
    },
    {
      "id": 39,
      "start": 804.5199737548828,
      "end": 810.6799774169922,
      "text": " thou shalt show unto me at every place whither we shall come, say of me, he is my"
    },
    {
      "id": 40,
      "start": 810.6799774169922,
      "end": 817.1999816894531,
      "text": " brother. In some way, I believe that Abraham had this belief that by"
    },
    {
      "id": 41,
      "start": 817.1999816894531,
      "end": 822.5199737548828,
      "text": " following this plan that had been derived, they came up with many years"
    },
    {
      "id": 42,
      "start": 822.5199737548828,
      "end": 827.4399719238281,
      "text": " earlier that this would provide him some level of safety and protection that"
    },
    {
      "id": 43,
      "start": 827.4399719238281,
      "end": 832.5999755859375,
      "text": " perhaps God was not able to afford. But the reality is that he'd already"
    },
    {
      "id": 44,
      "start": 832.5999755859375,
      "end": 839.2799835205078,
      "text": " experienced God providing protection for him in Egypt. This very thing that's"
    },
    {
      "id": 45,
      "start": 839.2799835205078,
      "end": 843.47998046875,
      "text": " being repeated in chapter number 20 has already occurred in Abraham's life."
    },
    {
      "id": 46,
      "start": 843.47998046875,
      "end": 847.2799835205078,
      "text": " Right now in chapter number 20, we're just in a different city with different"
    },
    {
      "id": 47,
      "start": 847.2799835205078,
      "end": 852.3999786376953,
      "text": " names of different characters, but really it's the same event, is it not? Have you"
    },
    {
      "id": 48,
      "start": 852.3999786376953,
      "end": 855.6399841308594,
      "text": " ever felt like in your life that there's just kind of a repeat button that's been"
    },
    {
      "id": 49,
      "start": 855.6399841308594,
      "end": 860.3599853515625,
      "text": " played? Like, man, I think I've been here before. Maybe I didn't learn the lesson."
    },
    {
      "id": 50,
      "start": 860.3599853515625,
      "end": 864.7599792480469,
      "text": " Why didn't I learn the lesson, right? And here's Abraham, and he says to Abimelech,"
    },
    {
      "id": 51,
      "start": 864.7599792480469,
      "end": 869.1999816894531,
      "text": " she's my sister, and I said this as we note the fear of Abraham, you understand"
    },
    {
      "id": 52,
      "start": 869.1999816894531,
      "end": 873.5199890136719,
      "text": " that God, as we read His Word, that many times throughout the Scriptures we read"
    },
    {
      "id": 53,
      "start": 873.5199890136719,
      "end": 884.719970703125,
      "text": " these words, fear not. Fear not. Be not afraid. Do we not? Those phrases are"
    },
    {
      "id": 54,
      "start": 884.719970703125,
      "end": 889.0799865722656,
      "text": " littered all throughout the Word of God. We find that Paul says this in 2nd"
    },
    {
      "id": 55,
      "start": 889.0799865722656,
      "end": 893.719970703125,
      "text": " Timothy 1 and verse number 7, for God hath not given us the spirit of fear, but"
    },
    {
      "id": 56,
      "start": 893.719970703125,
      "end": 900.3199768066406,
      "text": " of power and of love and of a sound mind. In fact, it's there in Abraham's life"
    },
    {
      "id": 57,
      "start": 900.3199768066406,
      "end": 905.0399780273438,
      "text": " after he'd experienced a great victory. In chapter number 14, as we mentioned"
    },
    {
      "id": 58,
      "start": 905.0399780273438,
      "end": 909.239990234375,
      "text": " earlier, as we did a quick review, we find that it was there in chapter number 15"
    },
    {
      "id": 59,
      "start": 909.239990234375,
      "end": 919.0399780273438,
      "text": " that God plainly says to Abraham, fear not. As often as we read the words fear"
    },
    {
      "id": 60,
      "start": 919.0399780273438,
      "end": 924.6799926757812,
      "text": " not, as often as we read the words be not afraid, as often as we could speak"
    },
    {
      "id": 61,
      "start": 924.6799926757812,
      "end": 929.8799743652344,
      "text": " about and preach messages on not having fear and not being controlled by fear,"
    },
    {
      "id": 62,
      "start": 929.9599914550781,
      "end": 934.47998046875,
      "text": " the reality is that we are human beings and we continue to deal with an"
    },
    {
      "id": 63,
      "start": 934.47998046875,
      "end": 940.7999877929688,
      "text": " emotion of fear. It's just how we, that's just something we deal with as human"
    },
    {
      "id": 64,
      "start": 940.7999877929688,
      "end": 949.719970703125,
      "text": " beings. We were in Branson, as you know, for vacation, and the fellow that was"
    },
    {
      "id": 65,
      "start": 949.719970703125,
      "end": 954.1599731445312,
      "text": " teaching the Sunday school class, he had kind of, the subject matter was not on"
    },
    {
      "id": 66,
      "start": 954.1599731445312,
      "end": 958.4399719238281,
      "text": " fear at all, but somehow along the line during the message he got onto the"
    },
    {
      "id": 67,
      "start": 958.4399719238281,
      "end": 962.5999755859375,
      "text": " subject of fear. And as he was teaching the lesson on fear, he said that if we"
    },
    {
      "id": 68,
      "start": 962.5999755859375,
      "end": 968.47998046875,
      "text": " fear God, then every other fear will go away, because we have a fear of God and"
    },
    {
      "id": 69,
      "start": 968.47998046875,
      "end": 971.9599914550781,
      "text": " we're to have a proper fear of God. And he's going through this, and his"
    },
    {
      "id": 70,
      "start": 971.9599914550781,
      "end": 976.1999816894531,
      "text": " wife was not very kind, for he's going through and he's saying all of these"
    },
    {
      "id": 71,
      "start": 976.1999816894531,
      "end": 979.4399719238281,
      "text": " things about we need to fear God, and she says, and he says that every other fear"
    },
    {
      "id": 72,
      "start": 979.4399719238281,
      "end": 983.47998046875,
      "text": " will go away, and she says, excuse me honey, is that applicable to snakes as"
    },
    {
      "id": 73,
      "start": 983.47998046875,
      "end": 988.7599792480469,
      "text": " well? And it was like, come on, that's not right for a wife to do that to her"
    },
    {
      "id": 74,
      "start": 988.7599792480469,
      "end": 993.8799743652344,
      "text": " husband when he's teaching, you know? But he was really dealing with, listen,"
    },
    {
      "id": 75,
      "start": 993.8799743652344,
      "end": 1000.1999816894531,
      "text": " why is it that we fear man? Why is it that we fear things that we deal with in"
    },
    {
      "id": 76,
      "start": 1000.1999816894531,
      "end": 1006.239990234375,
      "text": " life, and we can have this spirit of fear? You know, fear can cause us to do things"
    },
    {
      "id": 77,
      "start": 1006.239990234375,
      "end": 1012.6399841308594,
      "text": " that we ought not do. Fear can cause us to behave in matters in which are"
    },
    {
      "id": 78,
      "start": 1012.6799926757812,
      "end": 1017.9199829101562,
      "text": " not appropriate and accept it to God. And here in Genesis chapter number 20, I"
    },
    {
      "id": 79,
      "start": 1017.9199829101562,
      "end": 1024.2799682617188,
      "text": " truly believe that Abraham here is motivated by fear, that he says"
    },
    {
      "id": 80,
      "start": 1024.2799682617188,
      "end": 1029.1199645996094,
      "text": " to Abimelech, listen, I thought for sure that the fear of God was not in this"
    },
    {
      "id": 81,
      "start": 1029.1199645996094,
      "end": 1035.5599670410156,
      "text": " place, and therefore here's what you'll do, you'll slay me for my wife's sake. So"
    },
    {
      "id": 82,
      "start": 1035.5599670410156,
      "end": 1041.1199645996094,
      "text": " therefore, I said she's my sister. We see, first of all, the fear of Abraham. I want"
    },
    {
      "id": 83,
      "start": 1041.1199645996094,
      "end": 1046.4399719238281,
      "text": " you to see number two, the faithfulness of God. The faithfulness of God. We"
    },
    {
      "id": 84,
      "start": 1046.4399719238281,
      "end": 1051.47998046875,
      "text": " understand this evening that our God is always faithful. We sing, great is thy"
    },
    {
      "id": 85,
      "start": 1051.47998046875,
      "end": 1055.6799926757812,
      "text": " faithfulness, and what a great hymn that is. And I'm so thankful for the"
    },
    {
      "id": 86,
      "start": 1055.6799926757812,
      "end": 1060.5199890136719,
      "text": " faithfulness of God. In fact, I'm so glad that His faithfulness is not dependent"
    },
    {
      "id": 87,
      "start": 1060.5199890136719,
      "end": 1067.1599731445312,
      "text": " upon my faithfulness. Aren't you? Can you imagine the place in which we'd be if"
    },
    {
      "id": 88,
      "start": 1067.2799682617188,
      "end": 1075.8799743652344,
      "text": " God's faithfulness was dependent upon our faithfulness? Miserable. Honestly. But"
    },
    {
      "id": 89,
      "start": 1075.8799743652344,
      "end": 1081.5199890136719,
      "text": " our God is faithful. And here, the first two words of verse number three in"
    },
    {
      "id": 90,
      "start": 1081.5199890136719,
      "end": 1087.47998046875,
      "text": " Genesis chapter number 20, but God. You know how many times you read in the"
    },
    {
      "id": 91,
      "start": 1087.47998046875,
      "end": 1094.5999755859375,
      "text": " Scriptures that phrase, those two words, but God? There's an event, there's a set"
    },
    {
      "id": 92,
      "start": 1094.5999755859375,
      "end": 1099.5599670410156,
      "text": " of circumstances that are taking place, but God. But God shows up, and God"
    },
    {
      "id": 93,
      "start": 1099.5599670410156,
      "end": 1105.9599914550781,
      "text": " intervenes, and God works, and God moves. Why? Because God is faithful. God is"
    },
    {
      "id": 94,
      "start": 1105.9599914550781,
      "end": 1111.47998046875,
      "text": " faithful. And here, the Bible tells us of the faithfulness of God in verse number"
    },
    {
      "id": 95,
      "start": 1111.47998046875,
      "end": 1119.0399780273438,
      "text": " three. It says, but God came to Abimelech in a dream by night and said to him,"
    },
    {
      "id": 96,
      "start": 1119.0399780273438,
      "end": 1126.9199829101562,
      "text": " behold, thou art but a dead man. That kind of gets your attention, right? Can"
    },
    {
      "id": 97,
      "start": 1126.9199829101562,
      "end": 1133.5999755859375,
      "text": " you imagine? Abimelech, according to what we find here, God comes to him by night,"
    },
    {
      "id": 98,
      "start": 1133.5999755859375,
      "end": 1139.8399658203125,
      "text": " by a dream. He says, behold, thou art but a dead man. Why? For the woman which thou"
    },
    {
      "id": 99,
      "start": 1139.8399658203125,
      "end": 1147.8800048828125,
      "text": " hast taken, for she is a man's wife. Now Abimelech, prior to this, has no"
    },
    {
      "id": 100,
      "start": 1147.9199829101562,
      "end": 1151.9599609375,
      "text": " knowledge of this, for Abraham has said, she's my sister, and Sarah says, he's my"
    },
    {
      "id": 101,
      "start": 1151.9599609375,
      "end": 1160.9199829101562,
      "text": " brother. But God, God is faithful. God had made a promise with regard to the seed,"
    },
    {
      "id": 102,
      "start": 1160.9199829101562,
      "end": 1166.6399536132812,
      "text": " the promise that had been made with regard to Abraham and Sarah having a son,"
    },
    {
      "id": 103,
      "start": 1166.6399536132812,
      "end": 1173.0399780273438,
      "text": " Isaac, as we'd find in chapter 21. It says in verse number four, but Abimelech had"
    },
    {
      "id": 104,
      "start": 1173.0399780273438,
      "end": 1180.0799560546875,
      "text": " not come near her, and he, Abimelech said, Lord, wilt thou slay also a righteous"
    },
    {
      "id": 105,
      "start": 1180.0799560546875,
      "end": 1188.3599853515625,
      "text": " nation? Said he not unto me, she is my sister? And she, even she herself said, he"
    },
    {
      "id": 106,
      "start": 1188.3599853515625,
      "end": 1193.3599853515625,
      "text": " is my brother. In the integrity of my heart, in an innocency of my hands have I"
    },
    {
      "id": 107,
      "start": 1193.3599853515625,
      "end": 1198.3599853515625,
      "text": " done this thing? And God said unto him in a dream, yea, I know that thou didst this"
    },
    {
      "id": 108,
      "start": 1198.3599853515625,
      "end": 1201.7999877929688,
      "text": " thing in the integrity of thy heart."
    },
    {
      "id": 0,
      "start": 1201.7999877929688,
      "end": 1208.6799879074097,
      "text": " For I also withheld thee from sinning against Me, therefore suffered I thee not to touch"
    },
    {
      "id": 1,
      "start": 1208.6799879074097,
      "end": 1210.279987335205,
      "text": " her.\""
    },
    {
      "id": 2,
      "start": 1210.279987335205,
      "end": 1212.119987487793,
      "text": " That's awesome, isn't it?"
    },
    {
      "id": 3,
      "start": 1212.119987487793,
      "end": 1214.6399879455566,
      "text": " The way that God intervened, the way that God worked."
    },
    {
      "id": 4,
      "start": 1214.6399879455566,
      "end": 1219.7599868774414,
      "text": " As I mentioned by way of introduction, just as I believe in Genesis chapter number 12"
    },
    {
      "id": 5,
      "start": 1219.7599868774414,
      "end": 1224.2999877929688,
      "text": " that God could have protected both Abraham and Sarah as they marched into Egypt land"
    },
    {
      "id": 6,
      "start": 1224.2999877929688,
      "end": 1229.119987487793,
      "text": " and dealt with Pharaoh, that God could have protected them here as well."
    },
    {
      "id": 7,
      "start": 1229.119987487793,
      "end": 1233.6399879455566,
      "text": " Abraham did not have to say, she's my sister, and Sarah did not have to say, he's my brother."
    },
    {
      "id": 8,
      "start": 1233.6399879455566,
      "end": 1238.7599868774414,
      "text": " I believe that God would have provided a level of protection for them in that place."
    },
    {
      "id": 9,
      "start": 1238.7599868774414,
      "end": 1243.679988861084,
      "text": " And God gives some instruction in verse number 7 to Abimelech."
    },
    {
      "id": 10,
      "start": 1243.679988861084,
      "end": 1244.679988861084,
      "text": " He says,"
    },
    {
      "id": 11,
      "start": 1244.679988861084,
      "end": 1250.1599884033203,
      "text": " Now therefore restore the man his wife, for he is a prophet, and he shall pray for thee,"
    },
    {
      "id": 12,
      "start": 1250.1599884033203,
      "end": 1251.2399864196777,
      "text": " and thou shalt live."
    },
    {
      "id": 13,
      "start": 1251.2399864196777,
      "end": 1258.839988708496,
      "text": " And if thou restore her not, know thou that thou shalt surely die, thou and all that are"
    },
    {
      "id": 14,
      "start": 1258.839988708496,
      "end": 1260.719985961914,
      "text": " mine."
    },
    {
      "id": 15,
      "start": 1260.719985961914,
      "end": 1263.719985961914,
      "text": " Has God clearly communicated to Abimelech?"
    },
    {
      "id": 16,
      "start": 1263.719985961914,
      "end": 1264.719985961914,
      "text": " Absolutely."
    },
    {
      "id": 17,
      "start": 1264.719985961914,
      "end": 1266.9599914550781,
      "text": " I mean, God didn't mince any words, right?"
    },
    {
      "id": 18,
      "start": 1266.9599914550781,
      "end": 1273.2799911499023,
      "text": " God clearly communicates to Abimelech, here's the situation, you're a dead man, because"
    },
    {
      "id": 19,
      "start": 1273.2799911499023,
      "end": 1276.239990234375,
      "text": " she is a man's wife."
    },
    {
      "id": 20,
      "start": 1276.239990234375,
      "end": 1280.6799850463867,
      "text": " And he pleads his case, it was in the innocency of my heart, I mean, he said this and she"
    },
    {
      "id": 21,
      "start": 1280.6799850463867,
      "end": 1284.999984741211,
      "text": " said that, and I had no idea, and it was in the integrity of my heart that I've done this"
    },
    {
      "id": 22,
      "start": 1284.999984741211,
      "end": 1285.999984741211,
      "text": " thing."
    },
    {
      "id": 23,
      "start": 1285.999984741211,
      "end": 1288.0799865722656,
      "text": " And God says, I know, and that's why I've withheld thee from thee."
    },
    {
      "id": 24,
      "start": 1288.0799865722656,
      "end": 1291.5199890136719,
      "text": " That's why I did not allow you to go in unto her."
    },
    {
      "id": 25,
      "start": 1291.5199890136719,
      "end": 1296.239990234375,
      "text": " And God says, here's what you need to do, you need to restore him his wife, and if you"
    },
    {
      "id": 26,
      "start": 1296.239990234375,
      "end": 1307.1999893188477,
      "text": " do not do that, I want you to know that thou shalt surely die, thou and all that are thine."
    },
    {
      "id": 27,
      "start": 1307.1999893188477,
      "end": 1311.8799896240234,
      "text": " Skip over, if you will, to verse number 17, as we consider, again, the faithfulness of"
    },
    {
      "id": 28,
      "start": 1311.8799896240234,
      "end": 1312.8799896240234,
      "text": " God."
    },
    {
      "id": 29,
      "start": 1312.8799896240234,
      "end": 1318.0399856567383,
      "text": " We find in verse number 17 that Abraham prayed unto God."
    },
    {
      "id": 30,
      "start": 1318.0399856567383,
      "end": 1322.4399871826172,
      "text": " The Bible tells us that God healed Abimelech and his wife and his maidservants, and they"
    },
    {
      "id": 31,
      "start": 1322.4399871826172,
      "end": 1327.839988708496,
      "text": " bear children, for the Lord had fast closed up all the wombs of the house of Abimelech"
    },
    {
      "id": 32,
      "start": 1327.839988708496,
      "end": 1332.7999877929688,
      "text": " because of Sarah, Abraham's wife."
    },
    {
      "id": 33,
      "start": 1332.7999877929688,
      "end": 1339.1199951171875,
      "text": " God told Abimelech that if he would respond in such a way, he said this, not only would"
    },
    {
      "id": 34,
      "start": 1339.1199951171875,
      "end": 1344.1199951171875,
      "text": " the consequence of not returning or restoring Sarah to Abraham that he would die and all"
    },
    {
      "id": 35,
      "start": 1344.1199951171875,
      "end": 1348.759994506836,
      "text": " that are thine, but he said that if you restore his wife, according to verse number 7, he"
    },
    {
      "id": 36,
      "start": 1348.759994506836,
      "end": 1353.0999908447266,
      "text": " is a prophet, and he shall pray for thee and thou shalt live."
    },
    {
      "id": 37,
      "start": 1353.0999908447266,
      "end": 1359.1199951171875,
      "text": " And we find that Abraham prayed unto God, and God heard that prayer, and God answered"
    },
    {
      "id": 38,
      "start": 1359.1199951171875,
      "end": 1363.47998046875,
      "text": " that prayer, and God healed Abimelech and his wife and the maidservants, and the Bible"
    },
    {
      "id": 39,
      "start": 1363.47998046875,
      "end": 1366.759994506836,
      "text": " tells us that they bear children."
    },
    {
      "id": 40,
      "start": 1366.759994506836,
      "end": 1371.0399932861328,
      "text": " God is faithful and mindful of many portions of Scripture."
    },
    {
      "id": 41,
      "start": 1371.0399932861328,
      "end": 1373.2799835205078,
      "text": " Turn to the book of Deuteronomy, if you will."
    },
    {
      "id": 42,
      "start": 1373.2799835205078,
      "end": 1374.2799835205078,
      "text": " Hold your place there in Genesis."
    },
    {
      "id": 43,
      "start": 1374.2799835205078,
      "end": 1375.8399810791016,
      "text": " We'll be back in just a moment."
    },
    {
      "id": 44,
      "start": 1375.8399810791016,
      "end": 1383.759994506836,
      "text": " But consider what is said here in Deuteronomy chapter number 7."
    },
    {
      "id": 45,
      "start": 1383.759994506836,
      "end": 1391.9599914550781,
      "text": " In Deuteronomy chapter number 7, in verse number 9, God is preparing His people for"
    },
    {
      "id": 46,
      "start": 1391.9599914550781,
      "end": 1398.5999908447266,
      "text": " entrance into the land, Moses is providing instruction and preparation, and the Bible"
    },
    {
      "id": 47,
      "start": 1398.5999908447266,
      "end": 1404.4399871826172,
      "text": " says, know therefore, in Deuteronomy 7 and verse number 9, that the Lord thy God, He"
    },
    {
      "id": 48,
      "start": 1404.4399871826172,
      "end": 1412.1599884033203,
      "text": " is God, the faithful God, which keepeth covenant and mercy with them that love Him and keep"
    },
    {
      "id": 49,
      "start": 1412.1599884033203,
      "end": 1417.9599914550781,
      "text": " His commandments to a thousand generations."
    },
    {
      "id": 50,
      "start": 1417.9599914550781,
      "end": 1419.3999938964844,
      "text": " He's faithful."
    },
    {
      "id": 51,
      "start": 1419.5599822998047,
      "end": 1425.0799865722656,
      "text": " Paul says to the believers in 1 Corinthians chapter number 1, in verse number 9, he says"
    },
    {
      "id": 52,
      "start": 1425.0799865722656,
      "end": 1430.5199890136719,
      "text": " it this way very simply, God is faithful."
    },
    {
      "id": 53,
      "start": 1430.5199890136719,
      "end": 1436.7999877929688,
      "text": " The believers in Corinth had to understand the faithfulness of God, and Paul was rejoicing"
    },
    {
      "id": 54,
      "start": 1436.7999877929688,
      "end": 1438.8799896240234,
      "text": " and understanding that he served a faithful God."
    },
    {
      "id": 55,
      "start": 1438.8799896240234,
      "end": 1443.759994506836,
      "text": " I'm mindful of what Paul says to the believers in Thessalonica when he says this in 1 Thessalonians"
    },
    {
      "id": 56,
      "start": 1443.759994506836,
      "end": 1448.719985961914,
      "text": " 5 and verse number 24, faithful is he that calleth you who also will do it."
    },
    {
      "id": 57,
      "start": 1448.719985961914,
      "end": 1450.9599914550781,
      "text": " Our God is faithful."
    },
    {
      "id": 58,
      "start": 1450.9599914550781,
      "end": 1457.9599914550781,
      "text": " According to Revelation chapter number 19, when He returns, He'll have that name, faithful"
    },
    {
      "id": 59,
      "start": 1457.9599914550781,
      "end": 1459.47998046875,
      "text": " and true."
    },
    {
      "id": 60,
      "start": 1459.47998046875,
      "end": 1461.4400024414062,
      "text": " He is faithful."
    },
    {
      "id": 61,
      "start": 1461.4400024414062,
      "end": 1462.7200012207031,
      "text": " He is faithful."
    },
    {
      "id": 62,
      "start": 1462.7200012207031,
      "end": 1465.1999816894531,
      "text": " Consider this, if you will, Lamentations chapter 3."
    },
    {
      "id": 63,
      "start": 1465.1999816894531,
      "end": 1469.2599792480469,
      "text": " Hold your place there in Genesis still, but I want you to turn to the book of Lamentations"
    },
    {
      "id": 64,
      "start": 1469.2599792480469,
      "end": 1471.0,
      "text": " in chapter number 3."
    },
    {
      "id": 65,
      "start": 1471.0,
      "end": 1475.6399841308594,
      "text": " It's a verse of Scripture, really a portion of Scripture in which we have come familiar"
    },
    {
      "id": 66,
      "start": 1475.6399841308594,
      "end": 1478.1999816894531,
      "text": " with."
    },
    {
      "id": 67,
      "start": 1478.1999816894531,
      "end": 1484.3999938964844,
      "text": " As we consider Lamentations 3 and consider the setting really for this particular book,"
    },
    {
      "id": 68,
      "start": 1484.3999938964844,
      "end": 1490.8799743652344,
      "text": " and we'd understand that the Babylonians have taken captive the nation of Judah."
    },
    {
      "id": 69,
      "start": 1490.8799743652344,
      "end": 1492.6399841308594,
      "text": " The city is laying in ruins."
    },
    {
      "id": 70,
      "start": 1492.6399841308594,
      "end": 1498.7200012207031,
      "text": " If you read the first chapter of the book of Lamentations, you find that the city is"
    },
    {
      "id": 71,
      "start": 1498.7200012207031,
      "end": 1503.9199829101562,
      "text": " just laid in ruins, and you find the destruction, and we find that it's in chapter number 3"
    },
    {
      "id": 72,
      "start": 1503.9199829101562,
      "end": 1507.7999877929688,
      "text": " is really as Jeremiah is lamenting all that's taking place."
    },
    {
      "id": 73,
      "start": 1507.7999877929688,
      "end": 1512.3199768066406,
      "text": " He says in verse number 19, remembering my affliction and my misery, the wormwood and"
    },
    {
      "id": 74,
      "start": 1512.3199768066406,
      "end": 1518.3199768066406,
      "text": " the gall, my soul hath them still in remembrance and is humbled in me."
    },
    {
      "id": 75,
      "start": 1518.3199768066406,
      "end": 1526.9599914550781,
      "text": " But notice verse number 21, this I recall to my mind, therefore have I hope."
    },
    {
      "id": 76,
      "start": 1526.9599914550781,
      "end": 1534.1999816894531,
      "text": " It is of the Lord's mercies that we are not consumed, because His compassions fail not."
    },
    {
      "id": 77,
      "start": 1534.1999816894531,
      "end": 1541.6799926757812,
      "text": " They are new every morning, great is thy faithfulness."
    },
    {
      "id": 78,
      "start": 1541.6799926757812,
      "end": 1547.1799926757812,
      "text": " The Lord is my portion, saith my soul, therefore will I hope in Him."
    },
    {
      "id": 79,
      "start": 1547.1799926757812,
      "end": 1551.9599914550781,
      "text": " The Lord is good unto them that wait for Him, to the soul that seeketh Him."
    },
    {
      "id": 80,
      "start": 1552.9599914550781,
      "end": 1559.2799987792969,
      "text": " But there in verse number 23, they are new every morning, great is thy faithfulness."
    },
    {
      "id": 81,
      "start": 1559.2799987792969,
      "end": 1565.1999816894531,
      "text": " Our God is faithful, and His faithfulness is not dependent upon our faithfulness, and"
    },
    {
      "id": 82,
      "start": 1565.1999816894531,
      "end": 1570.7200012207031,
      "text": " that should cause us to rejoice greatly, because there are many times in which we fail the"
    },
    {
      "id": 83,
      "start": 1570.7200012207031,
      "end": 1571.7200012207031,
      "text": " Lord."
    },
    {
      "id": 84,
      "start": 1571.7200012207031,
      "end": 1577.2799987792969,
      "text": " We find that there are many times in which we get caught up, and the flesh would impact"
    },
    {
      "id": 85,
      "start": 1577.2799987792969,
      "end": 1581.7599792480469,
      "text": " and influence us, and maybe we'd make decisions and operate in fear, even as Abraham does"
    },
    {
      "id": 86,
      "start": 1581.7599792480469,
      "end": 1586.5199890136719,
      "text": " in this portion of Scripture in Genesis chapter number 20, but God is faithful."
    },
    {
      "id": 87,
      "start": 1586.5199890136719,
      "end": 1588.0,
      "text": " God is faithful."
    },
    {
      "id": 88,
      "start": 1588.0,
      "end": 1593.7200012207031,
      "text": " We see the fear of Abraham, we see the faithfulness of God, but I want you to consider with me"
    },
    {
      "id": 89,
      "start": 1593.7200012207031,
      "end": 1598.4400024414062,
      "text": " maybe something a little bit different, but I want you to consider with me the faith of"
    },
    {
      "id": 90,
      "start": 1598.4400024414062,
      "end": 1600.3199768066406,
      "text": " Abimelech."
    },
    {
      "id": 91,
      "start": 1600.3199768066406,
      "end": 1601.3199768066406,
      "text": " The faith of Abimelech."
    },
    {
      "id": 92,
      "start": 1601.3199768066406,
      "end": 1607.0,
      "text": " I'll be honest with you, as you begin to think about those that lived by faith, you begin"
    },
    {
      "id": 93,
      "start": 1607.0,
      "end": 1612.0399780273438,
      "text": " to make a list of those that lived by faith, and you begin to name those great heroes of"
    },
    {
      "id": 94,
      "start": 1612.0399780273438,
      "end": 1618.3999938964844,
      "text": " the faith, if you will, Abimelech probably has never made it on your list."
    },
    {
      "id": 95,
      "start": 1618.3999938964844,
      "end": 1621.1599731445312,
      "text": " Not somebody that we think about having faith."
    },
    {
      "id": 96,
      "start": 1621.1599731445312,
      "end": 1627.8799743652344,
      "text": " But I've often said this, that faith is believing God, faith is taking God at His Word, faith"
    },
    {
      "id": 97,
      "start": 1627.8799743652344,
      "end": 1633.2999877929688,
      "text": " is acting upon the revealed Word of God, right?"
    },
    {
      "id": 98,
      "start": 1633.2999877929688,
      "end": 1638.1399841308594,
      "text": " We speak about having faith, and we speak about the way in which our faith is increased"
    },
    {
      "id": 99,
      "start": 1638.1399841308594,
      "end": 1641.3799743652344,
      "text": " by the truth of the Word of God."
    },
    {
      "id": 100,
      "start": 1641.3799743652344,
      "end": 1645.8199768066406,
      "text": " We find that the Bible says that it's through the hearing of the Word that our faith is"
    },
    {
      "id": 101,
      "start": 1645.8199768066406,
      "end": 1649.9400024414062,
      "text": " increased, and we understand that we're to live by faith."
    },
    {
      "id": 102,
      "start": 1649.9400024414062,
      "end": 1653.3799743652344,
      "text": " Without faith, it's impossible to please Him."
    },
    {
      "id": 103,
      "start": 1653.3799743652344,
      "end": 1657.9400024414062,
      "text": " But I would submit to you this evening that Abimelech operates in faith here in chapter"
    },
    {
      "id": 104,
      "start": 1657.9400024414062,
      "end": 1663.4599914550781,
      "text": " number 20 of the book of Genesis, because God speaks to Abimelech, and God gives Abimelech"
    },
    {
      "id": 105,
      "start": 1663.4599914550781,
      "end": 1669.97998046875,
      "text": " very clear instruction, and we find that Abimelech, when he understands that which he is told,"
    },
    {
      "id": 106,
      "start": 1669.97998046875,
      "end": 1675.0599975585938,
      "text": " we find that he demonstrates faith in what God said."
    },
    {
      "id": 107,
      "start": 1675.0599975585938,
      "end": 1681.0599975585938,
      "text": " Remember, as we looked in just a moment ago, the faithfulness of God, we see that God very"
    },
    {
      "id": 108,
      "start": 1681.0599975585938,
      "end": 1687.5,
      "text": " plainly tells Abimelech in verse number 7 that He is to restore the man his wife, that"
    },
    {
      "id": 109,
      "start": 1687.5,
      "end": 1691.3799743652344,
      "text": " if he restores her not, that thou shalt surely die, thou and all that are thine."
    },
    {
      "id": 110,
      "start": 1691.3799743652344,
      "end": 1696.0799865722656,
      "text": " Notice the response of Abimelech in verse number 8."
    },
    {
      "id": 111,
      "start": 1696.0799865722656,
      "end": 1702.8599853515625,
      "text": " The Bible says this, therefore Abimelech rose early in the morning and called all his servants"
    },
    {
      "id": 112,
      "start": 1702.8599853515625,
      "end": 1709.1799926757812,
      "text": " and told all these things in their ears, and the men were sore afraid."
    },
    {
      "id": 113,
      "start": 1709.1799926757812,
      "end": 1712.2799987792969,
      "text": " Why are they afraid?"
    },
    {
      "id": 114,
      "start": 1712.2799987792969,
      "end": 1715.2799682617188,
      "text": " Because God had spoken to Abimelech."
    },
    {
      "id": 115,
      "start": 1715.2799682617188,
      "end": 1721.1199951171875,
      "text": " And I believe that as God had spoken to Abimelech and said to Abimelech that this woman that"
    },
    {
      "id": 116,
      "start": 1721.1199951171875,
      "end": 1727.1599731445312,
      "text": " you have, that she is a man's wife, and you need to return her, that if you do not do"
    },
    {
      "id": 117,
      "start": 1727.1599731445312,
      "end": 1732.47998046875,
      "text": " this, then you shall surely die and all that are thine, I believe that when he communicated"
    },
    {
      "id": 118,
      "start": 1732.47998046875,
      "end": 1737.4400024414062,
      "text": " this message to those that he called in verse number 8, that he communicated the message"
    },
    {
      "id": 119,
      "start": 1737.4400024414062,
      "end": 1740.6400146484375,
      "text": " with a level of seriousness."
    },
    {
      "id": 120,
      "start": 1740.6400146484375,
      "end": 1743.5999755859375,
      "text": " I mean, he believed what God said."
    },
    {
      "id": 121,
      "start": 1743.5999755859375,
      "end": 1748.8399658203125,
      "text": " He believed that God was able to perform that which he said."
    },
    {
      "id": 122,
      "start": 1748.8399658203125,
      "end": 1753.1199951171875,
      "text": " It says in verse number 9, then Abimelech called Abraham and said unto him, what hast"
    },
    {
      "id": 123,
      "start": 1753.1199951171875,
      "end": 1754.239990234375,
      "text": " thou done unto us?"
    },
    {
      "id": 124,
      "start": 1754.239990234375,
      "end": 1759.8399658203125,
      "text": " And what have I offended thee that thou hast brought on me and on my kingdom a great sin?"
    },
    {
      "id": 125,
      "start": 1759.8399658203125,
      "end": 1763.2799682617188,
      "text": " Thou hast done deeds unto me that ought not to be done."
    },
    {
      "id": 126,
      "start": 1763.2799682617188,
      "end": 1766.7999877929688,
      "text": " And Abimelech said unto Abraham, what sawest thou that thou hast done this thing?"
    },
    {
      "id": 127,
      "start": 1766.7999877929688,
      "end": 1770.7999877929688,
      "text": " And we've read verses 11 through 13 already, but I want you to skip down to verse number"
    },
    {
      "id": 128,
      "start": 1770.7999877929688,
      "end": 1771.7999877929688,
      "text": " 14."
    },
    {
      "id": 129,
      "start": 1771.7999877929688,
      "end": 1772.9199829101562,
      "text": " Look at what Abimelech did."
    },
    {
      "id": 130,
      "start": 1772.9199829101562,
      "end": 1777.0800170898438,
      "text": " The Bible says that Abimelech took sheep and oxen and men's servants and woman's servants"
    },
    {
      "id": 131,
      "start": 1777.0800170898438,
      "end": 1784.0800170898438,
      "text": " and gave them unto Abraham and restored him, Sarah, his wife."
    },
    {
      "id": 132,
      "start": 1784.0800170898438,
      "end": 1787.8800048828125,
      "text": " Is that not what God told him to do?"
    },
    {
      "id": 133,
      "start": 1787.8800048828125,
      "end": 1795.8399658203125,
      "text": " God said in verse number 3, thou art but a dead man, for the woman which thou hast taken,"
    },
    {
      "id": 134,
      "start": 1795.8399658203125,
      "end": 1801.760009765625,
      "text": " for she is a man's wife, and he says in verse number 7, now therefore restore the"
    },
    {
      "id": 135,
      "start": 1801.760009765625,
      "end": 1801.7999877929688,
      "text": " man."
    },
    {
      "id": 0,
      "start": 1801.7999877929688,
      "end": 1804.7999877929688,
      "text": " a man his wife.\""
    },
    {
      "id": 1,
      "start": 1804.7999877929688,
      "end": 1807.7199878692627,
      "text": " We find that in verse 14,"
    },
    {
      "id": 2,
      "start": 1807.7199878692627,
      "end": 1811.5199880599976,
      "text": " the Bible tells us that he, Abimelech,"
    },
    {
      "id": 3,
      "start": 1811.5199880599976,
      "end": 1813.7599878311157,
      "text": " not only did he restore Sarah to Abraham,"
    },
    {
      "id": 4,
      "start": 1813.7599878311157,
      "end": 1815.7599878311157,
      "text": " but it says that he took sheep and oxen"
    },
    {
      "id": 5,
      "start": 1815.7599878311157,
      "end": 1817.6799879074097,
      "text": " and men's servants and women's servants"
    },
    {
      "id": 6,
      "start": 1817.6799879074097,
      "end": 1819.0799884796143,
      "text": " and gave them unto Abraham"
    },
    {
      "id": 7,
      "start": 1819.0799884796143,
      "end": 1821.5199871063232,
      "text": " and restored him Sarah, his wife."
    },
    {
      "id": 8,
      "start": 1821.5199871063232,
      "end": 1823.279987335205,
      "text": " You understand that it would have been"
    },
    {
      "id": 9,
      "start": 1823.279987335205,
      "end": 1825.119987487793,
      "text": " all for naught if Abimelech"
    },
    {
      "id": 10,
      "start": 1825.119987487793,
      "end": 1827.279987335205,
      "text": " would have simply given Abraham"
    },
    {
      "id": 11,
      "start": 1827.279987335205,
      "end": 1829.4799880981445,
      "text": " sheep and oxen and men's servants"
    },
    {
      "id": 12,
      "start": 1829.4799880981445,
      "end": 1831.6799869537354,
      "text": " and women's servants."
    },
    {
      "id": 13,
      "start": 1831.6799869537354,
      "end": 1833.4799880981445,
      "text": " That would not have appeased God."
    },
    {
      "id": 14,
      "start": 1833.4799880981445,
      "end": 1834.5999870300293,
      "text": " If Abimelech said,"
    },
    {
      "id": 15,
      "start": 1834.5999870300293,
      "end": 1836.839988708496,
      "text": " I'm going to give you all these things, Abraham,"
    },
    {
      "id": 16,
      "start": 1836.839988708496,
      "end": 1839.9999885559082,
      "text": " but I'm keeping Sarah."
    },
    {
      "id": 17,
      "start": 1839.9999885559082,
      "end": 1841.8799896240234,
      "text": " What's going to happen?"
    },
    {
      "id": 18,
      "start": 1841.8799896240234,
      "end": 1844.119987487793,
      "text": " He's a dead man, right?"
    },
    {
      "id": 19,
      "start": 1844.119987487793,
      "end": 1845.7599868774414,
      "text": " Is that what God said?"
    },
    {
      "id": 20,
      "start": 1845.7599868774414,
      "end": 1848.6399879455566,
      "text": " Thou art but a dead man."
    },
    {
      "id": 21,
      "start": 1848.6399879455566,
      "end": 1850.559986114502,
      "text": " The only condition that God gave"
    },
    {
      "id": 22,
      "start": 1850.559986114502,
      "end": 1852.119987487793,
      "text": " was that he, Abimelech,"
    },
    {
      "id": 23,
      "start": 1852.119987487793,
      "end": 1855.0399894714355,
      "text": " restore Sarah to Abraham."
    },
    {
      "id": 24,
      "start": 1855.0399894714355,
      "end": 1856.3199882507324,
      "text": " And so I'm of the opinion"
    },
    {
      "id": 25,
      "start": 1856.3199882507324,
      "end": 1858.679988861084,
      "text": " that if he did not include all of this other spoil"
    },
    {
      "id": 26,
      "start": 1858.719985961914,
      "end": 1862.0399894714355,
      "text": " and simply returned Sarah to Abraham,"
    },
    {
      "id": 27,
      "start": 1862.0399894714355,
      "end": 1863.7999877929688,
      "text": " that he would have lived"
    },
    {
      "id": 28,
      "start": 1863.7999877929688,
      "end": 1865.119987487793,
      "text": " because that was the condition"
    },
    {
      "id": 29,
      "start": 1865.119987487793,
      "end": 1869.119987487793,
      "text": " by which God had communicated to Abimelech"
    },
    {
      "id": 30,
      "start": 1869.119987487793,
      "end": 1870.7599868774414,
      "text": " what it was that he needed to do."
    },
    {
      "id": 31,
      "start": 1871.719985961914,
      "end": 1872.5599899291992,
      "text": " See, Abimelech,"
    },
    {
      "id": 32,
      "start": 1872.5599899291992,
      "end": 1874.999984741211,
      "text": " do you see how he demonstrated faith?"
    },
    {
      "id": 33,
      "start": 1874.999984741211,
      "end": 1876.9199905395508,
      "text": " He believed that what God said"
    },
    {
      "id": 34,
      "start": 1876.9199905395508,
      "end": 1877.9599914550781,
      "text": " that he was going to do,"
    },
    {
      "id": 35,
      "start": 1877.9599914550781,
      "end": 1879.1999893188477,
      "text": " that God would do."
    },
    {
      "id": 36,
      "start": 1881.3999862670898,
      "end": 1882.5999908447266,
      "text": " In a certain sense,"
    },
    {
      "id": 37,
      "start": 1882.5999908447266,
      "end": 1884.3199844360352,
      "text": " we could look at Genesis chapter number 20"
    },
    {
      "id": 38,
      "start": 1884.3199844360352,
      "end": 1886.1599884033203,
      "text": " and we could say that of the characters"
    },
    {
      "id": 39,
      "start": 1886.1599884033203,
      "end": 1887.8799896240234,
      "text": " that are contained in this portion of scripture,"
    },
    {
      "id": 40,
      "start": 1887.8799896240234,
      "end": 1890.0799865722656,
      "text": " that Abimelech has more faith than Abraham."
    },
    {
      "id": 41,
      "start": 1891.4799880981445,
      "end": 1893.7599868774414,
      "text": " Now that blows your mind, right?"
    },
    {
      "id": 42,
      "start": 1893.7599868774414,
      "end": 1894.8799896240234,
      "text": " Because when we think of Abraham,"
    },
    {
      "id": 43,
      "start": 1894.8799896240234,
      "end": 1895.7999877929688,
      "text": " we think of Abraham,"
    },
    {
      "id": 44,
      "start": 1895.7999877929688,
      "end": 1896.7999877929688,
      "text": " he's the friend of God."
    },
    {
      "id": 45,
      "start": 1896.7999877929688,
      "end": 1898.7999877929688,
      "text": " I mean, he's faithful and he is."
    },
    {
      "id": 46,
      "start": 1898.7999877929688,
      "end": 1901.6399841308594,
      "text": " Abraham finds himself in Hebrews chapter 11"
    },
    {
      "id": 47,
      "start": 1901.6399841308594,
      "end": 1905.3599853515625,
      "text": " is the great hall of faith, right?"
    },
    {
      "id": 48,
      "start": 1905.3599853515625,
      "end": 1907.9599914550781,
      "text": " But in this particular account,"
    },
    {
      "id": 49,
      "start": 1907.9599914550781,
      "end": 1910.239990234375,
      "text": " Abimelech is the one that demonstrates faith."
    },
    {
      "id": 50,
      "start": 1911.3199844360352,
      "end": 1916.119987487793,
      "text": " Abimelech is the one that hears what God says"
    },
    {
      "id": 51,
      "start": 1916.119987487793,
      "end": 1917.4399871826172,
      "text": " and responds to it."
    },
    {
      "id": 52,
      "start": 1918.0399856567383,
      "end": 1919.3199844360352,
      "text": " In obedience."
    },
    {
      "id": 53,
      "start": 1920.3599853515625,
      "end": 1922.0799865722656,
      "text": " He continues in verse number 15,"
    },
    {
      "id": 54,
      "start": 1922.0799865722656,
      "end": 1924.2799911499023,
      "text": " and Abimelech said,"
    },
    {
      "id": 55,
      "start": 1924.2799911499023,
      "end": 1925.8799896240234,
      "text": " behold, my land is before thee."
    },
    {
      "id": 56,
      "start": 1925.8799896240234,
      "end": 1928.7599868774414,
      "text": " Dwell where it pleaseth thee."
    },
    {
      "id": 57,
      "start": 1928.7599868774414,
      "end": 1929.7999877929688,
      "text": " And unto Sarah, he said,"
    },
    {
      "id": 58,
      "start": 1929.7999877929688,
      "end": 1931.1999816894531,
      "text": " behold, I have given thy brother"
    },
    {
      "id": 59,
      "start": 1931.1999816894531,
      "end": 1933.1599884033203,
      "text": " a thousand pieces of silver."
    },
    {
      "id": 60,
      "start": 1933.1599884033203,
      "end": 1935.3599853515625,
      "text": " Behold, he is to thee a covering of the eyes"
    },
    {
      "id": 61,
      "start": 1935.3599853515625,
      "end": 1937.2799835205078,
      "text": " and to all that are with thee"
    },
    {
      "id": 62,
      "start": 1937.2799835205078,
      "end": 1938.239990234375,
      "text": " and with all others."
    },
    {
      "id": 63,
      "start": 1938.239990234375,
      "end": 1941.1999816894531,
      "text": " Thus, she was reproved."
    },
    {
      "id": 64,
      "start": 1941.1999816894531,
      "end": 1943.719985961914,
      "text": " And then the Bible says that Abraham prayed unto God"
    },
    {
      "id": 65,
      "start": 1943.719985961914,
      "end": 1945.47998046875,
      "text": " in verse number 17."
    },
    {
      "id": 66,
      "start": 1945.5199890136719,
      "end": 1949.7999877929688,
      "text": " Now, we understand that God had said to Abimelech"
    },
    {
      "id": 67,
      "start": 1949.7999877929688,
      "end": 1951.1599884033203,
      "text": " in verse number seven,"
    },
    {
      "id": 68,
      "start": 1951.1599884033203,
      "end": 1953.1999816894531,
      "text": " now therefore restore the man his wife"
    },
    {
      "id": 69,
      "start": 1953.1999816894531,
      "end": 1954.7999877929688,
      "text": " for he is a prophet"
    },
    {
      "id": 70,
      "start": 1955.7999877929688,
      "end": 1957.5599822998047,
      "text": " and he shall pray for thee"
    },
    {
      "id": 71,
      "start": 1957.5599822998047,
      "end": 1959.0799865722656,
      "text": " and thou shalt live."
    },
    {
      "id": 72,
      "start": 1960.1599884033203,
      "end": 1963.3999938964844,
      "text": " I'm not sure if it was God who communicated to Abraham"
    },
    {
      "id": 73,
      "start": 1963.3999938964844,
      "end": 1964.7999877929688,
      "text": " that he should pray for Abimelech"
    },
    {
      "id": 74,
      "start": 1964.7999877929688,
      "end": 1967.8799896240234,
      "text": " or if it was Abimelech that communicated this to Abraham,"
    },
    {
      "id": 75,
      "start": 1967.8799896240234,
      "end": 1970.1999816894531,
      "text": " but we find that Abraham prayed."
    },
    {
      "id": 76,
      "start": 1971.759994506836,
      "end": 1972.999984741211,
      "text": " And as Abraham prays,"
    },
    {
      "id": 77,
      "start": 1972.999984741211,
      "end": 1975.1999816894531,
      "text": " the Bible tells us that God healed Abimelech"
    },
    {
      "id": 78,
      "start": 1975.8799896240234,
      "end": 1976.719985961914,
      "text": " and his wife and his maidservants"
    },
    {
      "id": 79,
      "start": 1976.719985961914,
      "end": 1978.719985961914,
      "text": " and their children."
    },
    {
      "id": 80,
      "start": 1978.719985961914,
      "end": 1980.9199829101562,
      "text": " As we look at this portion of Scripture,"
    },
    {
      "id": 81,
      "start": 1980.9199829101562,
      "end": 1984.8799896240234,
      "text": " we begin to see the evidence that is given to us."
    },
    {
      "id": 82,
      "start": 1984.8799896240234,
      "end": 1986.8399810791016,
      "text": " We find that Abraham's fear,"
    },
    {
      "id": 83,
      "start": 1986.8399810791016,
      "end": 1988.759994506836,
      "text": " as I started out the message this evening,"
    },
    {
      "id": 84,
      "start": 1988.759994506836,
      "end": 1991.1599884033203,
      "text": " I believe that his fear was known by his actions,"
    },
    {
      "id": 85,
      "start": 1991.1599884033203,
      "end": 1993.9599914550781,
      "text": " but also as we think about the faith of Abimelech,"
    },
    {
      "id": 86,
      "start": 1993.9599914550781,
      "end": 1996.6399841308594,
      "text": " that too was known by his actions."
    },
    {
      "id": 87,
      "start": 1997.7999877929688,
      "end": 2000.5599822998047,
      "text": " As we begin to look at this passage of Scripture"
    },
    {
      "id": 88,
      "start": 2000.5599822998047,
      "end": 2001.9199829101562,
      "text": " and we consider the seriousness,"
    },
    {
      "id": 89,
      "start": 2001.9199829101562,
      "end": 2005.1599884033203,
      "text": " listen, I've never traveled to a place"
    },
    {
      "id": 90,
      "start": 2005.999984741211,
      "end": 2007.719985961914,
      "text": " where I was fearful that they would kill me"
    },
    {
      "id": 91,
      "start": 2007.719985961914,
      "end": 2009.239990234375,
      "text": " and take Holly to be their wife."
    },
    {
      "id": 92,
      "start": 2009.239990234375,
      "end": 2011.3999938964844,
      "text": " I've just never traveled to that place."
    },
    {
      "id": 93,
      "start": 2011.3999938964844,
      "end": 2012.8799896240234,
      "text": " Have you?"
    },
    {
      "id": 94,
      "start": 2012.8799896240234,
      "end": 2015.0399932861328,
      "text": " It's not a common thing that happens."
    },
    {
      "id": 95,
      "start": 2015.0399932861328,
      "end": 2017.4399871826172,
      "text": " No doubt this was a common practice."
    },
    {
      "id": 96,
      "start": 2017.4399871826172,
      "end": 2018.6399841308594,
      "text": " It's something that's been repeated,"
    },
    {
      "id": 97,
      "start": 2018.6399841308594,
      "end": 2019.7999877929688,
      "text": " not only in Genesis 12,"
    },
    {
      "id": 98,
      "start": 2019.7999877929688,
      "end": 2021.6799926757812,
      "text": " but again in chapter number 20."
    },
    {
      "id": 99,
      "start": 2021.6799926757812,
      "end": 2025.47998046875,
      "text": " No doubt that this was a serious fear that Abraham had."
    },
    {
      "id": 100,
      "start": 2028.759994506836,
      "end": 2031.47998046875,
      "text": " And he operates based upon that fear."
    },
    {
      "id": 101,
      "start": 2032.3599853515625,
      "end": 2036.3999938964844,
      "text": " As we begin to think about the specific circumstances"
    },
    {
      "id": 102,
      "start": 2036.3999938964844,
      "end": 2037.6799926757812,
      "text": " of Genesis chapter number 20,"
    },
    {
      "id": 103,
      "start": 2037.6799926757812,
      "end": 2040.3599853515625,
      "text": " many of us are not capable of relating"
    },
    {
      "id": 104,
      "start": 2040.3599853515625,
      "end": 2042.8799896240234,
      "text": " to the specific circumstances."
    },
    {
      "id": 105,
      "start": 2042.8799896240234,
      "end": 2046.1599884033203,
      "text": " But as we begin to interpret Genesis chapter number 20"
    },
    {
      "id": 106,
      "start": 2046.1599884033203,
      "end": 2047.759994506836,
      "text": " and understand the context"
    },
    {
      "id": 107,
      "start": 2047.759994506836,
      "end": 2051.7999877929688,
      "text": " and understand the purpose of God placing this truth"
    },
    {
      "id": 108,
      "start": 2051.7999877929688,
      "end": 2053.6399841308594,
      "text": " to us in this portion of Scripture"
    },
    {
      "id": 109,
      "start": 2053.6399841308594,
      "end": 2055.6399841308594,
      "text": " and keeping it preserved for us,"
    },
    {
      "id": 110,
      "start": 2055.6399841308594,
      "end": 2059.0799865722656,
      "text": " we say, well, what is it that God wants us to learn?"
    },
    {
      "id": 111,
      "start": 2059.0799865722656,
      "end": 2060.5999755859375,
      "text": " What is it that God wants us to learn"
    },
    {
      "id": 112,
      "start": 2060.5999755859375,
      "end": 2065.0399780273438,
      "text": " in this repeat story in the life of Abraham?"
    },
    {
      "id": 113,
      "start": 2065.0399780273438,
      "end": 2068.8799743652344,
      "text": " Number one, I would say this as to the takeaways,"
    },
    {
      "id": 114,
      "start": 2068.8799743652344,
      "end": 2071.0399780273438,
      "text": " if you will, that God would like us to learn"
    },
    {
      "id": 115,
      "start": 2071.0399780273438,
      "end": 2073.0799865722656,
      "text": " is that we never need to get to a place"
    },
    {
      "id": 116,
      "start": 2073.0799865722656,
      "end": 2075.47998046875,
      "text": " where we think that we've arrived."
    },
    {
      "id": 117,
      "start": 2075.47998046875,
      "end": 2079.3199768066406,
      "text": " Because after 25 years of Abraham walking with God,"
    },
    {
      "id": 118,
      "start": 2079.3199768066406,
      "end": 2083.1599731445312,
      "text": " after 25 years of God proving himself to Abraham"
    },
    {
      "id": 119,
      "start": 2083.1599731445312,
      "end": 2086.519989013672,
      "text": " and all that had transpired in all of those chapters,"
    },
    {
      "id": 120,
      "start": 2086.519989013672,
      "end": 2088.9400024414062,
      "text": " we find that when Abraham finds himself"
    },
    {
      "id": 121,
      "start": 2088.9400024414062,
      "end": 2091.9400024414062,
      "text": " in this particular situation again,"
    },
    {
      "id": 122,
      "start": 2091.9400024414062,
      "end": 2095.6599731445312,
      "text": " that he reverts back to that which he had previously done."
    },
    {
      "id": 123,
      "start": 2097.0599975585938,
      "end": 2099.8999938964844,
      "text": " We need to be careful to never think that we've arrived."
    },
    {
      "id": 124,
      "start": 2102.1799926757812,
      "end": 2103.97998046875,
      "text": " And we need to understand this evening"
    },
    {
      "id": 125,
      "start": 2103.97998046875,
      "end": 2106.97998046875,
      "text": " that as we look at a portion of Scripture like this,"
    },
    {
      "id": 126,
      "start": 2106.97998046875,
      "end": 2110.1399841308594,
      "text": " that it's easy for us to look at Genesis chapter number 20"
    },
    {
      "id": 127,
      "start": 2110.1399841308594,
      "end": 2111.5,
      "text": " and kind of scratch our head and say,"
    },
    {
      "id": 128,
      "start": 2111.5,
      "end": 2113.5399780273438,
      "text": " what's wrong with Abraham?"
    },
    {
      "id": 129,
      "start": 2113.5399780273438,
      "end": 2115.5,
      "text": " I mean, didn't he learn in chapter number 12?"
    },
    {
      "id": 130,
      "start": 2115.5,
      "end": 2118.0999755859375,
      "text": " I mean, what's wrong with this guy?"
    },
    {
      "id": 131,
      "start": 2118.0999755859375,
      "end": 2120.97998046875,
      "text": " But sometimes we like to evaluate other people's lives"
    },
    {
      "id": 132,
      "start": 2120.97998046875,
      "end": 2123.1799926757812,
      "text": " more than we like to evaluate our own lives."
    },
    {
      "id": 133,
      "start": 2125.1799926757812,
      "end": 2126.0799865722656,
      "text": " Why is that?"
    },
    {
      "id": 134,
      "start": 2126.0799865722656,
      "end": 2127.019989013672,
      "text": " It's easier."
    },
    {
      "id": 135,
      "start": 2128.699981689453,
      "end": 2130.5,
      "text": " It doesn't cause us to feel so bad."
    },
    {
      "id": 136,
      "start": 2132.0399780273438,
      "end": 2132.8799743652344,
      "text": " Right?"
    },
    {
      "id": 137,
      "start": 2132.8799743652344,
      "end": 2136.199981689453,
      "text": " I mean, honestly, when I evaluate someone else's life,"
    },
    {
      "id": 138,
      "start": 2136.199981689453,
      "end": 2138.8199768066406,
      "text": " whether it's someone in the pages of Scripture or otherwise,"
    },
    {
      "id": 139,
      "start": 2138.8199768066406,
      "end": 2141.3799743652344,
      "text": " it's easy for me to evaluate their lives."
    },
    {
      "id": 140,
      "start": 2141.3799743652344,
      "end": 2144.8199768066406,
      "text": " It's easy for you to evaluate somebody else's life."
    },
    {
      "id": 141,
      "start": 2144.8199768066406,
      "end": 2149.6199951171875,
      "text": " But that process of self-evaluation and self-examination"
    },
    {
      "id": 142,
      "start": 2149.6199951171875,
      "end": 2151.739990234375,
      "text": " and saying, what about me?"
    },
    {
      "id": 143,
      "start": 2151.739990234375,
      "end": 2153.3799743652344,
      "text": " I started out this evening by saying,"
    },
    {
      "id": 144,
      "start": 2153.3799743652344,
      "end": 2155.0599975585938,
      "text": " there are things no doubt in your life"
    },
    {
      "id": 145,
      "start": 2155.0599975585938,
      "end": 2157.259979248047,
      "text": " that you've done more than once."
    },
    {
      "id": 146,
      "start": 2157.259979248047,
      "end": 2158.97998046875,
      "text": " I mean, failures in your life."
    },
    {
      "id": 147,
      "start": 2159.9400024414062,
      "end": 2162.1399841308594,
      "text": " You say, man, how did I do this again?"
    },
    {
      "id": 148,
      "start": 2163.8999938964844,
      "end": 2165.6599731445312,
      "text": " Abraham, as he's in this situation,"
    },
    {
      "id": 149,
      "start": 2165.6599731445312,
      "end": 2168.8999938964844,
      "text": " I mean, I don't know how he must have felt"
    },
    {
      "id": 150,
      "start": 2168.8999938964844,
      "end": 2170.5,
      "text": " back in Genesis chapter number 12"
    },
    {
      "id": 151,
      "start": 2170.5,
      "end": 2173.019989013672,
      "text": " when Sarah is in the home of Pharaoh."
    },
    {
      "id": 152,
      "start": 2173.8599853515625,
      "end": 2175.8999938964844,
      "text": " Any men would feel comfortable with that?"
    },
    {
      "id": 153,
      "start": 2177.3399963378906,
      "end": 2178.6199951171875,
      "text": " No."
    },
    {
      "id": 154,
      "start": 2178.6199951171875,
      "end": 2179.97998046875,
      "text": " I wouldn't be very comfortable."
    },
    {
      "id": 155,
      "start": 2179.97998046875,
      "end": 2184.97998046875,
      "text": " Now, 25 years later, his wife Sarah is now with Abimelech."
    },
    {
      "id": 156,
      "start": 2186.8999938964844,
      "end": 2188.259979248047,
      "text": " Man, how do you feel?"
    },
    {
      "id": 157,
      "start": 2189.5799865722656,
      "end": 2192.6399841308594,
      "text": " And you, I mean, is Abraham not sitting there thinking,"
    },
    {
      "id": 158,
      "start": 2192.6399841308594,
      "end": 2196.220001220703,
      "text": " man, if I didn't say this or if I said that, I don't know."
    },
    {
      "id": 159,
      "start": 2196.220001220703,
      "end": 2197.959991455078,
      "text": " I'm just thinking about myself."
    },
    {
      "id": 160,
      "start": 2199.699981689453,
      "end": 2202.97998046875,
      "text": " That my wife is now in this place"
    },
    {
      "id": 161,
      "start": 2203.8199768066406,
      "end": 2205.739990234375,
      "text": " and perhaps a place of being vulnerable,"
    },
    {
      "id": 162,
      "start": 2205.739990234375,
      "end": 2208.1799926757812,
      "text": " a place of being taken advantage of,"
    },
    {
      "id": 163,
      "start": 2208.1799926757812,
      "end": 2211.0999755859375,
      "text": " a place of I don't know all that's going to happen"
    },
    {
      "id": 164,
      "start": 2211.0999755859375,
      "end": 2213.6599731445312,
      "text": " and it's because of this fear that I had."
    },
    {
      "id": 165,
      "start": 2214.699981689453,
      "end": 2216.199981689453,
      "text": " You understand what I'm saying?"
    },
    {
      "id": 166,
      "start": 2217.1799926757812,
      "end": 2218.8199768066406,
      "text": " And we find this evening that, listen,"
    },
    {
      "id": 167,
      "start": 2218.8199768066406,
      "end": 2222.1799926757812,
      "text": " we need to deal with the flesh, as I said this morning."
    },
    {
      "id": 168,
      "start": 2222.1799926757812,
      "end": 2224.3799743652344,
      "text": " See, because this thing of fear"
    },
    {
      "id": 169,
      "start": 2224.3799743652344,
      "end": 2226.1399841308594,
      "text": " begins to cripple and paralyze,"
    },
    {
      "id": 170,
      "start": 2226.1399841308594,
      "end": 2231.1399841308594,
      "text": " this thing of fear begins to dictate to Abraham what to do."
    },
    {
      "id": 171,
      "start": 2231.459991455078,
      "end": 2232.739990234375,
      "text": " See, there are times in which,"
    },
    {
      "id": 172,
      "start": 2232.739990234375,
      "end": 2234.8799743652344,
      "text": " even as he gives answer to Abimelech,"
    },
    {
      "id": 173,
      "start": 2234.8799743652344,
      "end": 2238.019989013672,
      "text": " that he says, listen, we made this agreement many years ago"
    },
    {
      "id": 174,
      "start": 2239.0599975585938,
      "end": 2241.5799865722656,
      "text": " that anywhere we traveled that I would say she's my sister"
    },
    {
      "id": 175,
      "start": 2241.5799865722656,
      "end": 2245.019989013672,
      "text": " and she would say that I'm her brother."
    },
    {
      "id": 176,
      "start": 2245.019989013672,
      "end": 2245.8599853515625,
      "text": " But you know what?"
    },
    {
      "id": 177,
      "start": 2245.8599853515625,
      "end": 2247.1399841308594,
      "text": " There might be an agreement that was made"
    },
    {
      "id": 178,
      "start": 2247.1399841308594,
      "end": 2249.9400024414062,
      "text": " that after you experience all that God has done,"
    },
    {
      "id": 179,
      "start": 2249.9400024414062,
      "end": 2251.3399963378906,
      "text": " you say, no, we don't have to operate"
    },
    {
      "id": 180,
      "start": 2251.3399963378906,
      "end": 2255.1799926757812,
      "text": " under those agreements any longer, right?"
    },
    {
      "id": 181,
      "start": 2255.1799926757812,
      "end": 2258.8199768066406,
      "text": " Because we've seen that God is faithful."
    },
    {
      "id": 182,
      "start": 2258.8599853515625,
      "end": 2261.5399780273438,
      "text": " When we see what God did in Genesis chapter number 12,"
    },
    {
      "id": 183,
      "start": 2261.5399780273438,
      "end": 2263.739990234375,
      "text": " it prepares us for the next encounter,"
    },
    {
      "id": 184,
      "start": 2263.739990234375,
      "end": 2266.8599853515625,
      "text": " the next difficulty in which we have to experience."
    },
    {
      "id": 185,
      "start": 2266.8599853515625,
      "end": 2268.8599853515625,
      "text": " And so I would say that as we look"
    },
    {
      "id": 186,
      "start": 2268.8599853515625,
      "end": 2269.97998046875,
      "text": " at this portion of scripture"
    },
    {
      "id": 187,
      "start": 2269.97998046875,
      "end": 2272.5,
      "text": " that we need to be careful to acknowledge"
    },
    {
      "id": 188,
      "start": 2272.5,
      "end": 2273.779998779297,
      "text": " that in the life of Abraham,"
    },
    {
      "id": 189,
      "start": 2273.779998779297,
      "end": 2275.5399780273438,
      "text": " as we see this repeat offense,"
    },
    {
      "id": 190,
      "start": 2275.5399780273438,
      "end": 2279.459991455078,
      "text": " that we too would understand that we're but flesh."
    },
    {
      "id": 191,
      "start": 2279.459991455078,
      "end": 2282.5799865722656,
      "text": " And we must be careful to daily walk with God"
    },
    {
      "id": 192,
      "start": 2282.5799865722656,
      "end": 2284.3399963378906,
      "text": " and to trust God."
    },
    {
      "id": 193,
      "start": 2284.3399963378906,
      "end": 2286.4199829101562,
      "text": " God is able to do exceeding abundantly"
    },
    {
      "id": 194,
      "start": 2286.4199829101562,
      "end": 2287.97998046875,
      "text": " above all that we ask or think."
    },
    {
      "id": 195,
      "start": 2289.6599731445312,
      "end": 2291.1399841308594,
      "text": " But how's God gonna do it?"
    },
    {
      "id": 196,
      "start": 2291.1399841308594,
      "end": 2292.9400024414062,
      "text": " I don't know, but God is able."
    },
    {
      "id": 197,
      "start": 2293.8599853515625,
      "end": 2294.699981689453,
      "text": " Amen?"
    },
    {
      "id": 198,
      "start": 2294.699981689453,
      "end": 2296.2999877929688,
      "text": " I mean, think about what God did here."
    },
    {
      "id": 199,
      "start": 2296.2999877929688,
      "end": 2299.3799743652344,
      "text": " Did not God prove His power"
    },
    {
      "id": 200,
      "start": 2299.3799743652344,
      "end": 2302.699981689453,
      "text": " by preventing Abimelech from violating Sarah?"
    },
    {
      "id": 201,
      "start": 2302.699981689453,
      "end": 2304.779998779297,
      "text": " By preventing anything from taking place?"
    },
    {
      "id": 202,
      "start": 2304.779998779297,
      "end": 2309.2999877929688,
      "text": " By closing up the wombs of those people of Gerar?"
    },
    {
      "id": 203,
      "start": 2309.2999877929688,
      "end": 2310.779998779297,
      "text": " How did God do all of this?"
    },
    {
      "id": 204,
      "start": 2310.779998779297,
      "end": 2312.220001220703,
      "text": " Because He's God."
    },
    {
      "id": 205,
      "start": 2313.259979248047,
      "end": 2314.1799926757812,
      "text": " He's God."
    },
    {
      "id": 206,
      "start": 2315.5399780273438,
      "end": 2316.3800048828125,
      "text": " And so this evening,"
    },
    {
      "id": 207,
      "start": 2316.3800048828125,
      "end": 2318.0999755859375,
      "text": " as we look at this portion of scripture"
    },
    {
      "id": 208,
      "start": 2318.3800048828125,
      "end": 2320.7000122070312,
      "text": " and we begin to think about Abraham"
    },
    {
      "id": 209,
      "start": 2320.7000122070312,
      "end": 2322.1400146484375,
      "text": " and understanding what's taking place"
    },
    {
      "id": 210,
      "start": 2322.1400146484375,
      "end": 2323.97998046875,
      "text": " and we learn some lessons from Abraham,"
    },
    {
      "id": 211,
      "start": 2323.97998046875,
      "end": 2326.219970703125,
      "text": " let us also learn some lessons from God."
    },
    {
      "id": 212,
      "start": 2326.219970703125,
      "end": 2327.97998046875,
      "text": " He's always faithful."
    },
    {
      "id": 213,
      "start": 2327.97998046875,
      "end": 2329.7799682617188,
      "text": " Listen, God's never gonna fail you."
    },
    {
      "id": 214,
      "start": 2331.1799926757812,
      "end": 2334.6599731445312,
      "text": " You can find yourself in all sorts of situations in life."
    },
    {
      "id": 215,
      "start": 2334.6599731445312,
      "end": 2336.6199951171875,
      "text": " You can find yourself in places."
    },
    {
      "id": 216,
      "start": 2336.6199951171875,
      "end": 2339.3399658203125,
      "text": " Listen, we're living in a crazy world right now."
    },
    {
      "id": 217,
      "start": 2340.2999877929688,
      "end": 2341.7799682617188,
      "text": " We're living in a world in which people"
    },
    {
      "id": 218,
      "start": 2341.7799682617188,
      "end": 2344.8599853515625,
      "text": " are trying to get folks to do all sorts of crazy things"
    },
    {
      "id": 219,
      "start": 2344.8599853515625,
      "end": 2348.739990234375,
      "text": " and trying to force and make us do something."
    },
    {
      "id": 220,
      "start": 2348.739990234375,
      "end": 2351.1799926757812,
      "text": " Listen, we have a God who's faithful."
    },
    {
      "id": 221,
      "start": 2352.0199584960938,
      "end": 2353.9400024414062,
      "text": " We have a God who is able."
    },
    {
      "id": 222,
      "start": 2355.8200073242188,
      "end": 2357.6199951171875,
      "text": " The problem sometimes in our lives"
    },
    {
      "id": 223,
      "start": 2357.6199951171875,
      "end": 2360.7799682617188,
      "text": " is that it's a scary thing to prove God."
    },
    {
      "id": 224,
      "start": 2361.7000122070312,
      "end": 2362.97998046875,
      "text": " What do I mean by that?"
    },
    {
      "id": 225,
      "start": 2362.97998046875,
      "end": 2363.8599853515625,
      "text": " It's a whole lot easier"
    },
    {
      "id": 226,
      "start": 2363.8599853515625,
      "end": 2366.5800170898438,
      "text": " to just rely on your own understanding."
    },
    {
      "id": 227,
      "start": 2366.5800170898438,
      "end": 2367.739990234375,
      "text": " Amen?"
    },
    {
      "id": 228,
      "start": 2367.739990234375,
      "end": 2370.5800170898438,
      "text": " You know what He said there in the book of Malachi?"
    },
    {
      "id": 229,
      "start": 2370.5800170898438,
      "end": 2371.6599731445312,
      "text": " Prove me."
    },
    {
      "id": 230,
      "start": 2371.6599731445312,
      "end": 2374.3399658203125,
      "text": " He was speaking contextually about giving."
    },
    {
      "id": 231,
      "start": 2374.6599731445312,
      "end": 2377.0199584960938,
      "text": " Listen, giving is a process of proving God"
    },
    {
      "id": 232,
      "start": 2377.0199584960938,
      "end": 2379.5,
      "text": " because you're gonna say, I'm gonna give to God first"
    },
    {
      "id": 233,
      "start": 2379.5,
      "end": 2380.739990234375,
      "text": " and then I'm gonna expect that God's"
    },
    {
      "id": 234,
      "start": 2380.739990234375,
      "end": 2382.7000122070312,
      "text": " gonna take care of my needs."
    },
    {
      "id": 235,
      "start": 2382.7000122070312,
      "end": 2385.7000122070312,
      "text": " You say, I can't take care of my needs with all of it."
    },
    {
      "id": 236,
      "start": 2385.7000122070312,
      "end": 2388.0599975585938,
      "text": " How am I gonna take care of my needs with less?"
    },
    {
      "id": 237,
      "start": 2389.739990234375,
      "end": 2391.97998046875,
      "text": " But God says, prove me."
    },
    {
      "id": 238,
      "start": 2391.97998046875,
      "end": 2393.5,
      "text": " He says, prove me."
    },
    {
      "id": 239,
      "start": 2393.5,
      "end": 2396.5,
      "text": " Not only, and this is the twofold blessing"
    },
    {
      "id": 240,
      "start": 2396.5,
      "end": 2398.7000122070312,
      "text": " that we see in giving, is God says,"
    },
    {
      "id": 241,
      "start": 2398.7000122070312,
      "end": 2400.5,
      "text": " not only am I gonna bless you,"
    },
    {
      "id": 242,
      "start": 2400.5,
      "end": 2402.1400146484375,
      "text": " but I'm gonna rebuke the devout."
    },
    {
      "id": 0,
      "start": 2402.1400146484375,
      "end": 2410.1400146484375,
      "text": " hour.\" And you say, well that's a pretty good deal. And guess what? God is faithful."
    },
    {
      "id": 1,
      "start": 2410.1400146484375,
      "end": 2417.660015106201,
      "text": " Have you not found it to be so? I remember as a kid, I was almost a"
    },
    {
      "id": 2,
      "start": 2417.660015106201,
      "end": 2421.4600143432617,
      "text": " teenager when my parents got saved just a few months away from being 13 years"
    },
    {
      "id": 3,
      "start": 2421.4600143432617,
      "end": 2424.0600147247314,
      "text": " old. It does not mean that I knew everything that was going on in the home."
    },
    {
      "id": 4,
      "start": 2424.0600147247314,
      "end": 2427.2200145721436,
      "text": " There are plenty of things that I did not know about, but I remember hearing my"
    },
    {
      "id": 5,
      "start": 2427.2200145721436,
      "end": 2432.340015411377,
      "text": " dad, not only that at that particular time after his conversion, but talking"
    },
    {
      "id": 6,
      "start": 2432.340015411377,
      "end": 2436.10001373291,
      "text": " about stories about it afterwards, when they made the decision that they were"
    },
    {
      "id": 7,
      "start": 2436.10001373291,
      "end": 2442.4200134277344,
      "text": " gonna start giving. They were gonna start tithing. Listen, if you were raised to do"
    },
    {
      "id": 8,
      "start": 2442.4200134277344,
      "end": 2446.780014038086,
      "text": " that, and that's something. See, Holly and I, we were we were saved and we were"
    },
    {
      "id": 9,
      "start": 2446.780014038086,
      "end": 2450.3800163269043,
      "text": " giving before we ever got married, so it was just part of what we did. And when"
    },
    {
      "id": 10,
      "start": 2450.3800163269043,
      "end": 2453.500015258789,
      "text": " you got all kinds of bills already, and you're already doing whatever, and then"
    },
    {
      "id": 11,
      "start": 2453.500015258789,
      "end": 2458.4200134277344,
      "text": " it's like, hey we got saved and now we need to start doing this. Has God ever"
    },
    {
      "id": 12,
      "start": 2458.4200134277344,
      "end": 2466.5800170898438,
      "text": " failed you? Not one time. God is faithful. He's faithful. Look at what God did for"
    },
    {
      "id": 13,
      "start": 2466.5800170898438,
      "end": 2471.900016784668,
      "text": " Abraham and Sarah here in Genesis chapter 20. We can't come up with those"
    },
    {
      "id": 14,
      "start": 2471.900016784668,
      "end": 2481.180015563965,
      "text": " certain... we can't concoct that plan, can we? No. There's no way that Abraham could"
    },
    {
      "id": 15,
      "start": 2481.180015563965,
      "end": 2485.7400131225586,
      "text": " prevent Abimelech from doing anything to Sarah. There's no way in his own power"
    },
    {
      "id": 16,
      "start": 2485.7400131225586,
      "end": 2490.300018310547,
      "text": " that he was gonna preserve his own life. But God is faithful. So we learn a lesson"
    },
    {
      "id": 17,
      "start": 2490.300018310547,
      "end": 2496.060012817383,
      "text": " about Abraham, and how we can, listen, we can sometimes operate in fear. We need to"
    },
    {
      "id": 18,
      "start": 2496.060012817383,
      "end": 2502.660011291504,
      "text": " be careful. We need to deal with the flesh. Learn a lesson about God. He's always"
    },
    {
      "id": 19,
      "start": 2502.660011291504,
      "end": 2508.180015563965,
      "text": " faithful, and He always will be. Let's learn a lesson about faith. How about we just"
    },
    {
      "id": 20,
      "start": 2508.180015563965,
      "end": 2513.7000122070312,
      "text": " take God at His word? Just believe God. I don't understand how it's all gonna work"
    },
    {
      "id": 21,
      "start": 2513.7000122070312,
      "end": 2519.620018005371,
      "text": " out. That can drive us crazy sometimes. It honestly can. And if you're the analytical"
    },
    {
      "id": 22,
      "start": 2519.620018005371,
      "end": 2523.620018005371,
      "text": " type as I am, and you like to figure everything out, it all needs to make sense, it can really"
    },
    {
      "id": 23,
      "start": 2523.620018005371,
      "end": 2537.500015258789,
      "text": " mess you up. Amen? But we've been called to live by faith. The just shall live by faith."
    },
    {
      "id": 24,
      "start": 2537.780014038086,
      "end": 2542.8200073242188,
      "text": " The just shall live by faith. Just believe in God. Having that kind of faith that we"
    },
    {
      "id": 25,
      "start": 2542.8200073242188,
      "end": 2546.5800170898438,
      "text": " say based upon God's word. Listen, when we talk about faith, sometimes people get this"
    },
    {
      "id": 26,
      "start": 2546.5800170898438,
      "end": 2551.9400177001953,
      "text": " idea of living by faith means that we just jump and do whatever and say, man, I was living"
    },
    {
      "id": 27,
      "start": 2551.9400177001953,
      "end": 2557.8200073242188,
      "text": " by faith. I just did all this by faith. No, faith is taking God at His word. Peter didn't"
    },
    {
      "id": 28,
      "start": 2557.8200073242188,
      "end": 2565.740020751953,
      "text": " step out of the boat until God bid him to. Amen? He said, Lord, if it be Thou, bid me"
    },
    {
      "id": 29,
      "start": 2565.740020751953,
      "end": 2577.4200134277344,
      "text": " come unto Thee. Right? And Jesus said, come. And based upon that, Peter went. And what"
    },
    {
      "id": 30,
      "start": 2577.4200134277344,
      "end": 2582.7000122070312,
      "text": " happened? Peter walked on water. He didn't walk on water for long because he got his"
    },
    {
      "id": 31,
      "start": 2582.7000122070312,
      "end": 2588.02001953125,
      "text": " eyes off of the Lord, but he walked on water. He was not presumptuous. He didn't just go."
    },
    {
      "id": 32,
      "start": 2588.02001953125,
      "end": 2592.1800079345703,
      "text": " Listen, when the children of Israel, when they were told to go into the land of promise,"
    },
    {
      "id": 33,
      "start": 2592.1800079345703,
      "end": 2596.8600158691406,
      "text": " they were to go and they would bring back that report. Remember the 12 spies went. And"
    },
    {
      "id": 34,
      "start": 2596.8600158691406,
      "end": 2603.9400177001953,
      "text": " the 10 of them, they brought a report that was a report based on sight. We're not able."
    },
    {
      "id": 35,
      "start": 2603.9400177001953,
      "end": 2607.9000091552734,
      "text": " I mean, there are giants in the land and there's all these things going on and they have walled"
    },
    {
      "id": 36,
      "start": 2607.9000091552734,
      "end": 2613.4600219726562,
      "text": " cities and fortified cities and they're too great for us. Joshua and Caleb said, if God"
    },
    {
      "id": 37,
      "start": 2613.4600219726562,
      "end": 2620.260009765625,
      "text": " is in it, God will do it because God is able. And do you remember at the end of that portion"
    },
    {
      "id": 38,
      "start": 2620.260009765625,
      "end": 2625.300018310547,
      "text": " of scripture in Numbers chapter 14, there was a contingent of them that decided presumptuously"
    },
    {
      "id": 39,
      "start": 2625.300018310547,
      "end": 2630.6200103759766,
      "text": " that they were going to go up and try to take and enter in. And guess what? Moses told them,"
    },
    {
      "id": 40,
      "start": 2630.6200103759766,
      "end": 2639.1000213623047,
      "text": " don't do it. God is not with you. And what happened? Failure. That's what happened. Why?"
    },
    {
      "id": 41,
      "start": 2639.1000213623047,
      "end": 2644.5800170898438,
      "text": " Because they weren't operating in faith. They were just doing what they wanted to do. They"
    },
    {
      "id": 42,
      "start": 2644.5800170898438,
      "end": 2648.1400146484375,
      "text": " were thinking, we're going to correct this problem by just going out and do this. No,"
    },
    {
      "id": 43,
      "start": 2648.1400146484375,
      "end": 2652.4200134277344,
      "text": " God didn't tell them to do it. And so when we think about faith, we as the people of"
    },
    {
      "id": 44,
      "start": 2652.4200134277344,
      "end": 2661.9000244140625,
      "text": " God were to be living by faith, living by faith. What does God say? Search it out, study"
    },
    {
      "id": 45,
      "start": 2661.9000244140625,
      "end": 2668.3800048828125,
      "text": " it out and say, I want to live by faith. I want to take God at His word. A portion of"
    },
    {
      "id": 46,
      "start": 2668.3800048828125,
      "end": 2673.3800048828125,
      "text": " scripture that's always been so precious to me is Acts 27, when Paul stands with great"
    },
    {
      "id": 47,
      "start": 2673.3800048828125,
      "end": 2680.260009765625,
      "text": " boldness and declares, I believe God. It's a powerful statement. It's a powerful expression"
    },
    {
      "id": 48,
      "start": 2680.260009765625,
      "end": 2688.740020751953,
      "text": " of faith. Here's what God said. It doesn't matter that we've not seen the stars and the"
    },
    {
      "id": 49,
      "start": 2688.740020751953,
      "end": 2693.8200073242188,
      "text": " moon, the sun. It doesn't matter that we are tossed in this crazy storm. It doesn't matter"
    },
    {
      "id": 50,
      "start": 2693.8200073242188,
      "end": 2702.1400146484375,
      "text": " that all hope that we should be saved is gone. Because God said, the ship's going to be destroyed,"
    },
    {
      "id": 51,
      "start": 2702.1400146484375,
      "end": 2709.6000061035156,
      "text": " but not one of our lives are going to be lost. And I believe God that it shall be even"
    },
    {
      "id": 52,
      "start": 2709.6000061035156,
      "end": 2716.7000122070312,
      "text": " as He said. And we just begin to live by faith. Genesis chapter 20, a historical account,"
    },
    {
      "id": 53,
      "start": 2716.7000122070312,
      "end": 2724.2000122070312,
      "text": " an account in the life of Abraham. But we learn lessons for today. The enemy still tries"
    },
    {
      "id": 54,
      "start": 2724.2000122070312,
      "end": 2731.6600036621094,
      "text": " to use fear to paralyze the people of God. Still today he uses fear. But God hath not"
    },
    {
      "id": 55,
      "start": 2731.6600036621094,
      "end": 2738.060028076172,
      "text": " given us the spirit of fear. Amen? He's not given us the spirit of fear. But what's going"
    },
    {
      "id": 56,
      "start": 2738.060028076172,
      "end": 2744.3400268554688,
      "text": " to happen? How's this going to work? How's that? But God? That's how verse 3 starts in"
    },
    {
      "id": 57,
      "start": 2744.3400268554688,
      "end": 2751.7000122070312,
      "text": " Genesis 20, but God. What's the but God in my life and in your life? How's God going"
    },
    {
      "id": 58,
      "start": 2751.7000122070312,
      "end": 2759.5,
      "text": " to show up and show that He's faithful? Because He is, and He just wants us to trust Him."
    },
    {
      "id": 59,
      "start": 2759.8600158691406,
      "end": 2767.4600219726562,
      "text": " Oh, that we'd live by faith. Abimelech, he believed what God said, and he acted thereon."
    },
    {
      "id": 60,
      "start": 2767.4600219726562,
      "end": 2774.220001220703,
      "text": " He said, here's your wife and here's a whole bunch of other stuff. Pray for me. And God"
    },
    {
      "id": 61,
      "start": 2774.220001220703,
      "end": 2778.8600158691406,
      "text": " blessed because God is faithful. Let's pray. Father, we love You. We thank You for loving"
    },
    {
      "id": 62,
      "start": 2778.8600158691406,
      "end": 2787.5,
      "text": " us. I pray that we'd learn some lessons from Genesis 20. It's easy for us to evaluate and"
    },
    {
      "id": 63,
      "start": 2787.5,
      "end": 2793.1400146484375,
      "text": " criticize the life of Abraham, to see his failure, if you will, in this portion of"
    },
    {
      "id": 64,
      "start": 2793.1400146484375,
      "end": 2804.1400146484375,
      "text": " Scripture, being controlled by fear. But I pray that as we evaluate that, that we'd understand"
    },
    {
      "id": 65,
      "start": 2804.1400146484375,
      "end": 2812.7000122070312,
      "text": " that we too are but dust, that our flesh is weak. You'd help us to take heed lest we also"
    },
    {
      "id": 66,
      "start": 2812.7000122070312,
      "end": 2821.8600158691406,
      "text": " fall. I pray, God, that You'd help us to be mindful of Your faithfulness tonight. Oh,"
    },
    {
      "id": 67,
      "start": 2821.8600158691406,
      "end": 2830.9000244140625,
      "text": " God, that it would just give us a peace, knowing that You are the faithful God, that Your name"
    },
    {
      "id": 68,
      "start": 2830.9000244140625,
      "end": 2839.4600219726562,
      "text": " is faithful. And God, I pray that You'd help us to live by faith. As we see the response"
    },
    {
      "id": 69,
      "start": 2839.5800170898438,
      "end": 2849.6600036621094,
      "text": " of Abimelech to the revelation of God, I pray that we too would live in faith, live by faith."
    },
    {
      "id": 70,
      "start": 2849.6600036621094,
      "end": 2855.6600036621094,
      "text": " We ask that You'd work in hearts and lives, that decisions would be made that would please"
    },
    {
      "id": 71,
      "start": 2855.6600036621094,
      "end": 2859.4600219726562,
      "text": " Thee. We'll thank You for it. In Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-17T04:48:46.101369"
}