{
  "video_id": "aG_nBkVcOeE",
  "text": "chapter number 34 and thankful for God's Word and what a blessing it is to be able to study the Word of God. And as we look at Genesis chapter number 34, there's an historical event that is recorded for us in this passage of Scripture. The two words that I would use to describe the event that is recorded for us are sad and unfortunate. And as we look at this particular passage of Scripture, we understand that God has preserved this account for us. And there's so many things that happen. In fact, as you study the life of the patriarchs in the book of Genesis, you'll find many times where events that follow one another in the passage of Scripture are separated by years of time. And certainly things took place and God did not see fit to record those events for us. But here He records this event for us and I believe that He's recorded it for us because there is a lesson that we must learn. See, this evening I think each of us would agree that life is full of experiences and at times those experiences are less than desirable. There are times in our lives where we're mistreated by individuals. There are times in which we are wrong, that people do us wrong, and we can look at that. We've heard people say life isn't fair and sometimes the response is, well, that's just the way it is. Life isn't fair. And the reality is that as we live life in times of offense, when someone treats us wrongly, when someone mistreats us, we must learn to trust the Lord. And we must learn to trust the Lord and then also we must learn to avoid taking matters into our own hands. And I would say this, admittedly this evening, that taking matters into our own hands is common. At times, if we'd be honest, it's desirable. Isn't it? Sometimes something happens and you say, I just want to give them a piece of my mind. And you just want to take matters into your own hands. And we find that it's a common practice and at times it's desirable. But I would say this, that reacting in that fashion of taking matters into our own hands when we're being wronged is short-sighted. It reveals a lack of trust in the Lord and it often results in a mess. I take matters into my own hands and I find out how quickly I can make a mess of things. And if you've lived life for any length of time, you could agree that that's happened in your life at some point. This evening, as we look at this particular passage of Scripture, I would like to look at the historical account, but then also have the opportunity to make some application in our lives. Begin reading with me there in verse number one. The Bible says this, And Dinah the daughter of Leah, which she barren to Jacob, went out to see the daughters of the land. And when Shechem, the son of Hamar, the Hivite, prince of the country, saw her, he took her and lay with her and defiled her. And his soul claimed unto Dinah the daughter of Jacob, and he loved the damsel, and spake kindly unto the damsel. And Shechem spake unto his father Hamar, and saying this, Get me this damsel to wife. And Jacob heard that he had defiled Dinah his daughter. Now his sons were with his cattle in the field, and Jacob held his peace until they were come. And Hamar, the father of Shechem, went out unto Jacob to commune with him. The sons of Jacob came out of the field when they heard it, and the men were grieved. They were wroth, because he had wrought folly in Israel, in lying with Jacob's daughter, which thing ought not to be done.\" I've titled the message this evening, as I've already mentioned by way of introduction, Avoid Taking Matters Into Your Own Hands. As we look at the account that God gives us here in this particular passage of Scripture, if you're taking notes, I want you to notice under the thought of the historical account, notice with me the recorded offense. We've read the first seven verses of Genesis 34, and in this portion of Scripture, God provides us with the recorded offense. God tells us in verse number one that Dinah, Jacob's daughter, went out and she interacted with the inhabitants of the land. The Bible says at the end of verse number one that she went out to see the daughters of the land. And we find that in that position, perhaps we could look at that and speak about the fact of being vulnerable in the position in which she was, but we find that in that position that Shechem takes advantage of Dinah. The Bible records it and says that he saw her at the end of verse number two, took her and lay with her and defiled her. And we find that Jacob hears about the situation, of course, after he had defiled Dinah, Shechem. The Bible says that he desired her to be his wife, and Jacob hears about what had taken place according to verse number five. And the Bible tells us at the end of verse number five that he held his peace, and he did not answer the matter, he did not engage in the conversation. He waited, rather, for his sons to return from the field. They were out tending to the cattle. And the Bible tells us in verse number seven that the sons of Jacob, they came out of the field and they heard the news. They heard what had taken place. Now, I want you to notice from verse number seven the response of these brothers when they hear what has taken place. Notice the Bible says, the men were grieved. I think that's a normal response, don't you? With what we just read, I'm not going into the details of what took place. You understand in verse number two the situation between Shechem and Dinah. But you understand this evening that when Dinah's brothers, the sons of Jacob, when they hear what has transpired, the Bible says that they were grieved. The Bible goes on to tell us this, and they were very wroth. Again, can you understand why they would have the reaction that they have based on the circumstances that had taken place? They're grieved. They're angry. They're very wroth. And the Bible tells us at the end of verse number seven, notice what it says, because he had wrought folly in Israel in lying with Jacob's daughter. And then notice this phrase, which thing ought not to be done. You know, they were right. What took place was inappropriate. What took place was a violation that should not have taken place. And we find that in that moment, again, as we've mentioned by way of introduction, and we'll get to it as we get to the application aspect of the message this evening, there are times in your life, there are times in my life, we see the historical account here of what's taking place that this just isn't right. It's just not right what took place. As brothers, I don't have a sister. But I think about the relationships between brothers and sisters, and those that have sisters, how a brother wants to protect his sisters. Joseph is the youngest. He's the tallest now, but he's the youngest. But he has two older sisters, but he desires, as a brother, to protect his sisters. And I could understand if this type of event happened where he would be grieved, where he would be very wroth. I can understand. I can relate to the sons of Jacob, can't you? The Bible gives us, it records for us the offense that takes place in the remaining portion of the Scripture here in Genesis chapter 34. We see that there's a response that is outlined. Notice as the sons of Jacob hear word of what has transpired beginning in verse number 8, the response is outlined for us. And in verses 8 through 12, we find that there's a request that is given from Hamar and Shechem to Jacob and the boys. Notice in verse number 8, the Bible says, And Hamar communed with them, saying, The soul of my son Shechem longeth for your daughter. I pray you give her him to wife, and make ye marriages with us, and give your daughters unto us, and take our daughters unto you. By the way, it's a subject that we could develop from verse number 9, and we will not this evening, but you could develop it quite extensively. This is the first attempt to defile the Messianic line. You can understand what's taking place and all the defilement. We're saying, Hey, let us intermarry. And we find that in verse number 10, it says, And ye shall dwell with us, and the land shall be before you. Dwell and trade ye therein, and get you possessions therein. It's as if they're trying to sweeten the deal, if you will, in verse number 10, and make it extremely attractive to get what they want. In verse number 11, it says that Shechem said unto her father and unto her brethren, Let me find grace in your eyes, and what ye shall say unto me I will give. Ask me never so much dowry and gift, and I will give according as ye shall say unto me, but give me the damsel to wife. We see the request. It's quite plain, is it not? Shechem, he wants Dinah to be his wife. Hamar says, Hey, let our group, let us intermarry. You can dwell with us, and you can have of the possessions, trade with us, so on and so forth. And we find that now there will be a proposal that is given from the sons of Jacob. Notice in verse number 13, it's interesting that Jacob is not the one having the correspondence, but he allows the boys to speak on his behalf. And it says in verse number 13, And the sons of Jacob answered Shechem and Hamar his father, notice this word, deceitfully. Deceitfully. I remember as a child hearing this phrase, I'm sure you've heard it as well, two wrongs don't make a right. How many of you have heard that before? Two wrongs don't make a right. Two wrongs make a mess, right? That's how it works. But we find here that these sons of Jacob, the boys now remember their grieve, they're very wroth, they're correct in their assessment, this thing ought not to have been done. But now they're devising a plan, they're making a proposal, but they're being deceitful, they answer Shechem and Hamar deceitfully. Notice what they say in verse 13, because he had defiled thine other sister, notice they said unto them in verse 14, we cannot do this thing, to give our sister to one that is uncircumcised, for that were a reproach unto us. But in this will we consent unto you, if ye will be as we be, that every male of you be circumcised, then will we give our daughters unto you, and we will take your daughters to us, and we will dwell with you, and we will become one people. But if ye will not hearken unto us to be circumcised, then we will take our daughter, and we will be gone. Again, it's quite plain. The request, the proposal, and there's an agreement that is reached. Notice the statement in verse 18, the Bible says that the words pleased Hamar and Shechem, Hamar's son, and the young man deferred not to do the thing, because he had delight in Jacob's daughter, and he was more honorable than all the house of his father. And verse 20 says that Hamar and Shechem, his son, came unto the gate of their city and communed with the men of their city, saying, now notice what they say to the men of the city. It's quite interesting. It gives some insight here that what's happening. In verse 21, they say this to the men of the city, these men are peaceable with us, therefore let them dwell in the land and trade therein. Notice what they say, for the land, behold, it is large enough for them, let us take their daughters to us for wives, and let us give them our daughters, verse 22, only herein will the men consent unto us for to dwell with us, to be one people, if every male among us be circumcised as they are circumcised. But notice what they say in verse 23, shall not their cattle and their substance and every beast of theirs be ours. There's a lot of deceit going on. There's a lot of, this situation is full of just unfortunate approaches and we find that they have this attitude of, listen, we're going to be able to be increased with goods and so on and so forth, and it says at the end of verse 23, only let us consent unto them and they will dwell with us. And unto Hamar and unto Shechem, verse 24, and his son hearkened all that went out of the gate of his city, and every male was circumcised, all that went out of the gate of his city. So we find that there was a request that was given, there was a proposal that was made, and there was an agreement that was reached, and all of the men of the city, the Bible says all of them that came out of the gate of the city, they were circumcised, and we find that the Bible begins to record for us in verses 25 through 29 a great slaughter that took place. This was exactly the plan of the sons of Jacob when the Bible tells us in verse number 13 that they answered them deceitfully. They knew what they were doing, they understood the opportunity that this would provide them with. And the Bible says in verse 25, and it came to pass on the third day when they were sore that two of the sons of Jacob, Simeon and Levi, Dinah's brethren, took each man a sword and came upon the city boldly, notice what it says, and slew all the males. It's a great slaughter that takes place. It says that they slew Hamar and Shechem his son with the edge of the sword and took Dinah out of Shechem's house and went out. The sons of Jacob came upon the slain and spoiled the city. Why? Because they had defiled their sister. Verse 28 says that they took their sheep and their oxen, their asses, and that which was in the city and that which was in the field, and all their wealth and all their little ones and their wives, took they captive and spoiled even all that was in the house. Isn't this an unfortunate event that takes place in Genesis chapter 34? I mean it begins with a violation, but we find then that matters are taken into their own hands and we find that they respond deceitfully and there's this great slaughter. And we know that in verse number 30 that there is a great level of fear and concern on the part of Jacob for the Bible says that Jacob says to Simeon and Levi, ye have troubled me to make me to stink among the inhabitants of the land, among the Canaanites and the parasites, and I being few in number, they shall gather themselves together against me and slay me and I shall be destroyed, I and my house. Now we understand as we've studied through the book of Genesis that often as we read about Jacob and his response to certain circumstances and events, he's a man that's often fearful. And we find this being expressed in verse number 30 because of what has transpired, but I want you to understand the perspective of the sons as it's given to us in verse 31. The Bible says that they said, should he deal with our sister as with an harlot? Really I believe that as you look at verse number 31, this answer to Jacob when he expresses his fear and concern in verse number 30 to his sons, to Simeon and Levi specifically, I believe that these boys and their response as it's recorded in verse 31 is really seeking to justify their actions, to justify their actions. By the way, isn't that typically what we do when we take matters in our own hands? We take matters in our own hands and then we justify our actions. But do you know what they did to me? Do you know what they said? Do you know what...isn't that what we do? And we find here, listen, I've already acknowledged this evening that what took place as they say in verse number 7, this thing ought not to be done. They were absolutely correct. They took matters in their own hands. Jacob will mention this very thing in Genesis 49, turn over if you will, when he's dying and the blessings are being given to his sons. Notice what he says in Genesis chapter 49, beginning in verse number 1, Genesis 49 and verse 1, the Bible says, and Jacob called unto his sons and said, gather yourselves together that I may tell you that which shall befall you in the last days. Gather yourselves together and hear you sons of Jacob and hearken unto Israel your father. Notice beginning in verse number 5, he begins speaking to Simeon and Levi. These are the two that we read of in Genesis 34 that we just read the entirety of the account, this historical account that took place. And notice what Jacob says when he's on his deathbed here. It says, Simeon and Levi are brethren, instruments of cruelty are in their habitations. Oh my soul, come not thou into their secret, unto their assembly. Mine honor, be not thou united. For in their anger, they slew a man and in their self-will, they digged down a wall. Cursed be their anger, for it was fierce, and their wrath, for it was cruel. I will divide them in Jacob and scatter them in Israel. Isn't it interesting that Jacob makes mention specifically of this event that we just read of Genesis 34 about Simeon and Levi and he talks about their anger and how it was fierce and how their wrath was cruel. There are times in our lives that we want to take matters into our own hands. And I believe this evening that as we look at the historical account in Genesis 34, and obviously I've gone very quickly at these 31 verses to kind of dig through it and look at the account, but I want to spend some time this evening to seek to make an application for each of us this evening. Because we are tempted in our lives as we go through life, there are times in which you will be tempted and I will be tempted to take matters into my own hands and into your own hands. Look over at the New Testament, if you will, to the book of Romans. Look at Romans chapter number 12 and then we'll look at a number of passages of Scripture this evening as we seek to make this point this evening of how important it is that we resist, that we avoid taking matters into our own hands. We said number one, the account, number two, the application, the application that we receive from this portion of Scripture. It's interesting in verse number 18, the Bible says this of Romans 12, if it be possible as much lieth in you, live peaceably with all men. Isn't that a great verse of Scripture? Some people say, this is as much possibility as I have, right? But it says in verse 19, notice what God says, dearly beloved, avenge not yourselves, but rather give place unto wrath. For it is written, vengeance is mine, I will repay, saith the Lord. Therefore if thine enemy hunger, feed him. Excuse me? My enemy? My enemy is hungry? Feed him. Feed him. If he thirsts, give him drink. For in so doing thou shalt heap coals of fire on his head. I remember hearing my mom say when I was a kid, she didn't know anything about the Bible, but she said, kill him with kindness. She said that all the time. the time. Kill them with kindness. I want to kill them, but not with kindness, you understand, right? But that's what she'd say all the time. Notice verse 21, be not overcome of evil, but overcome evil with good. I would submit to you this evening, this is not easy to do, and you cannot do it in your own power. You cannot do it in your flesh, because your flesh wants to take matters into its own hands. Your flesh wants to get even. Your flesh wants to repay evil with evil, right? That's what we want to do, revenge, get even, get back, have the last word. It's interesting, Brother Lennon had no idea that I'd be preaching this message this evening. We were sitting at the table last evening, and he was talking about the unique opportunities that they have ministering where they are in Ecuador, and he shared some things with us about ministering amongst the Latino community and amongst the Persian community, but those of the Indian background, the natives that were there for the Incas and what have you, and some of the ministry amongst that people group there, and how some of them continue to have within their tribes and all of those things, the witch doctors and curses and voodoo sorts of things and all of that, and he was sharing with me about times in which those folks will get saved. They'll get saved out of that false teaching and out of that false religion, and they'll get saved, but there's so much of that in their background that somebody then puts a curse against them, so then they want to go to the witch doctor and they want to take and put a curse back, and Brother Lennon said, we have to teach them to trust God. We've got to teach them to rely upon the Lord, and I thought it was so interesting because that tendency is not only for those people that have had that experience in their life, but just a human response when somebody does us wrong, and here God says, vengeance is mine, I will repay, saith the Lord. Be not overcome of evil, but overcome evil with good. I would say this tonight as we think about this truth of avoiding taking matters into my own hands, how can I do that? Number one, I would say this, if I'm going to avoid taking matters into my own hands, I must recognize God's providence. I must recognize that God's in control. We can speak often about God being in control, but when someone does us wrong, when there's an evil that is committed against us, this evening I wonder, do we understand the truth that God is in control even in those moments? See, it seems as if in our lives when things seem to be going well, when there seems to be a great victory, man, God is in control. When someone does us wrong, when someone falsely accuses us, when something happens in our life like what happens to Joseph at the end of the book of Genesis, he makes this testimony. Of course, he's sold into slavery, and you can read all that takes place beginning in chapter 37 of the book of Genesis, but he says, you meant it unto evil, but God meant it unto good. What a perspective, understanding, recognizing God's providence. I believe that when I recognize, when you recognize God's providence in our lives that will enable us to demonstrate restraint in our lives. Listen, you have the flesh and I have the flesh. Our flesh was not eradicated at the moment of salvation. That's not what happened. We're to crucify the flesh. We're to mortify our members. That's what the New Testament tells us, and we're to die daily. That's what Paul says, I die daily. I am crucified with Christ. Our flesh wants to get even. Our flesh wants to react to those times of adversity, and I'm going to recognize God's providence, and I'm going to have to exercise restraint. I believe this evening that when I avoid taking matters into my own hands, it reveals a measure of spiritual maturity. It reveals spiritual maturity when someone could do us wrong, could do us harm, and we can trust God, rely upon Him, not take those things into our own hands and not react to the circumstances and the situations, and it reveals a measure of maturity that we understand who God is and that God is in control. I want you to look at the life of David, and I know we use this passage in Romans, but I want you to go to the book of 1 Samuel, if you will, and we won't have time to develop everything that's taking place in the life of David. We're going to pick it up in 1 Samuel chapter 24. Just begin to think about the life of David briefly before we get to chapter 24, and without looking at all of the chapters and verses, I want you to think about David and his life. I want you to think about where he was in 1 Samuel chapter number 16 when he's out tending to the sheep. I mean, he's doing what his father had instructed him to do. He was being obedient, he was being submissive, he was being responsible to take care of that flock. The man of God, Samuel, comes to anoint the next king, and David's not even invited. Surely this is the one, is what Samuel says, and God says no. One by one, the sons of Jesse pass by, no, no, no. Are there any others? Well, the youngest, he's out taking care of the sheep. Bring him here. We're not going to sit until he comes. God says, it's him. David is anointed to be king of Israel in 1 Samuel chapter 16. He didn't apply for the job. You understand? God chose him to be the king of Israel. And in chapter number 16, at the end of the passage, he's then again taking care of the sheep, and he's brought in to minister to Saul, because there was an evil spirit that came. And we find that he's brought to minister before Saul, and then he's back taking care of the sheep. And in chapter number 17, we read about Goliath and all that takes place, and how the Philistines are fighting against the nation of Israel, and all of the men of Israel, including Saul the king that was head and shoulders above all the others, they're fearful, they're afraid, they're hiding, and David comes. Again, he's just doing what his father instructed him to do. Go and take these goods to your brothers. And he hears Goliath, and he says, is there not a cause? He says, I'll go and fight against this uncircumcised Philistine. He wasn't looking for any kind of recognition. He wasn't looking to be popular or promoted. He wasn't looking for the ladies of the land to say David has slain. No, he wasn't looking for any of that. He wanted everyone to know that there's a God in heaven. He continues to minister before Saul, and Saul tries to kill him. Throw a javelin at him. Saul said, here's what I'm going to do. I can't kill him myself, so I'm going to offer my daughter to be his wife. By the way, he thought he'd offer the daughter that he did because it'd be a reproach to him, and it'd be a bad situation, make his life miserable. He said, give me 100 foreskins of the Philistines as dowry. What was he saying? I'll let the Philistines kill him. David brings back 200, victorious. Everywhere he went, the Bible says that he behaved himself wisely. God was with him. Saul continued to try to kill David. Saul was hunting him. And David was a man that he testifies that there's but a step between him and death. And he understood what was taking place, and we come to 1 Samuel chapter 24, and several other things have transpired, but I want you to see in chapter 24 and verse number 4, the Bible says that the men of David said unto him, behold the day of which the Lord said unto thee, they're now in the cave there, and Saul's there. He had taken these 3,000 chosen men, according to verse number 2, to seek David. Obviously, he wants to kill David. And the Bible says that the men of David, now remember there were 400 men that went with him. That continues to grow to 600 and et cetera. And we find that the Bible says that they say, behold the day of which the Lord said unto thee, behold, I will deliver thine enemy into thine hand that thou mayest do to him as it shall seem good unto thee. Then David arose and cut off the skirt of Saul's robe privily. And it came to pass afterward that David's heart smote him because he had cut off Saul's skirt. And he said unto his men, the Lord forbid that I should do this thing unto my master, the Lord's anointed. Notice what he says, to stretch forth mine hand against him, seeing he is the anointed of the Lord. So David stayed his servants with these words and suffered them not to rise against Saul. But Saul rose up out of the cave and went on his way. David also arose afterward and went out of the cave and cried after Saul, saying, My Lord, the king. When Saul looked behind him, David stooped with his face to the earth and bowed himself. And verse 9 says that David said to Saul, Wherefore hearest thou men's words, saying, Behold, David seeketh thy hurt. Behold, this day thine eyes have seen how the Lord hath delivered thee today into mine hand in the cave.\" Notice what he says, and some bade me kill thee. Sometimes people are going to tell you to take matters into your own hands. You know what they did to you? Did you hear what they said to you? People are going to provoke you, try to encourage you to take matters into your own hands. You're going to let them get away with that? You're going to let them talk to you that way? You understand? This is the world we live in. David said, some of them said to kill you. But mine eyes spared thee, and I said, I will not put forth mine hand against my Lord, for he is the Lord's anointed. Wow. David had to understand something about the providence of God. He had to demonstrate, exercise a measure of restraint. We find that in chapter 26, notice with me again, there's a situation that takes place. And the Bible tells us that David now is in the wilderness of Ziph, and it says that the Ziphites came unto Saul in verse number 1 to Gibeah, saying, Doth not David hide himself in the hill of Hacaliah, which is before Jeshimon? Then Saul arose and went down to the wilderness of Ziph, having 3,000 chosen men of Israel with him to seek David in the wilderness of Ziph. Notice in verse number 3, it says that Saul pitched in the hill of Hacaliah, which is before Jeshimon, by the way. But David abode in the wilderness, and he saw that Saul came after him into the wilderness. And so we see the setting, look down, if you will, to verse number 7. The Bible says, So David and Abishai came to the people by night, and behold, Saul lay sleeping within the trench, and his spear stuck in the ground at his bolster. But Abner and the people lay around about him. Then said Abishai to David, notice what Abishai says, God hath delivered thine enemy into thine hand this day. Now therefore, let me smite him. I pray thee with the spear even to the earth at once, and I will not smite him the second time. Sometimes we say, man, I need an Abishai in my life, because he says, I'll go ahead and take care of it, David. You don't want to raise up your hand against him? Let me do it. I'll just smite him once. I won't do it a second time. That's what Abishai says. But notice in verse number 9, David said to Abishai, destroy him not. For who can stretch forth his hand against the Lord's anointed and be guiltless? David said furthermore, as the Lord liveth, you believe that God's alive? He believes in control? You believe he knows what's going on? He said, as the Lord liveth, the Lord shall smite him. Or his day shall come to die, or he shall descend into battle and perish. The Lord forbid that I should stretch forth mine hand against the Lord's anointed, but I pray thee, take thou now the spear that is in his bolster and the crews of water, and let us go. So David took the spear and the crews of water from Saul's bolster, and they got them away. No man saw it, nor knew it, neither awaked. For they were all asleep, because a deep sleep from the Lord was fallen upon them. David said, I'm not going to lift my hand against the Lord's anointed, but Abishai, I'm not going to allow you to either. He forbid him. He forbade him. The Bible says that David had this understanding that the Lord who lives will deal with Saul. By the way, God was able to deal with Saul, was he not? And Saul did go into battle and did not return from battle. We find that God took care of Saul. Interference between these two events in the life of David is 1 Samuel chapter 25. And in 1 Samuel 25, I believe that God records for us a significant interaction between David and Abigail that helps us with understanding this whole process of not taking matters into our own hands. In Genesis chapter 34, there was a wrong that was committed. There was evil that took place against Dinah. Jacob's sons, the brothers of Dinah, they were grieved and they were full of wrath and they were angry over what had taken place. They were right in their assessment that this thing ought not to be done. But they took matters into their own hands and they made a mess of the situation. We find that David, in 1 Samuel 24, God gives an opportunity when Saul enters into the cave and David says, no, I'm going to resist that. I'm going to trust the Lord. In 1 Samuel chapter 26, God gives another opportunity and Abishai says, let me just smite him once. David says, no, I'm going to trust the Lord. But in 1 Samuel 25, there's a different event that takes place that's not with Saul. See, Saul was the Lord's anointed. David had a certain perspective about not raising his hand against the Lord's anointed. Saul was in the place where God had him at that particular time. But when you look at 1 Samuel chapter number 25, the Bible records for us an interaction between David and Abigail with regard to Nabal and his men. Now Nabal was a fool, says it right in the passage of Scripture. David and his men helped Nabal and did all sorts of things and it was time to be paid. And Nabal says, who's David? I mean, anyone can say they're anyone these days. And David says, the men come back and David says, all right boys, saddle up. We're going to go kill them all. That's what he says. That's what he says. Notice David says in verse number 21 of 1 Samuel 25. Now David had said, surely in vain have I kept all this fellow hath in the wilderness so that nothing was missed of all that pertained unto him. And he hath requited me evil for good. Or do something good and somebody pays you back with evil. David says, this is what happens. He says in verse 22, so and more also do God unto the enemies of David. If I leave of all that pertain to him by the morning light. He's going to go kill them all. By the way, David was a mighty, mighty warrior. David says, let's go boys. I think Abishai was excited, don't you? He was ready to kill Saul in just another chapter. Abishai's like, let's go. He's going to go. But God allows Abigail to come. And the Bible tells us, look, pick it up with me in verse 26. Now therefore, my Lord, as the Lord liveth. Is that not what he says in chapter 26? As the Lord liveth and as thy soul liveth, seeing the Lord hath withholden thee from coming to shed blood. Notice this phrase and from avenging thyself with thine own hand. Now let thine enemies and they that seek evil to my Lord be as Nabal. And now this blessing, which thine handmaid hath brought unto my Lord, let it even be given unto the young men that follow my Lord. Verse number 28, I pray thee, forgive the trespass of thine handmaid for the Lord will certainly make my Lord a sure house because my Lord fighteth the battles of the Lord and evil hath not been found in thee all thy days. Yet a man is risen to pursue thee and to seek thy soul, but the soul of my Lord shall be bound in the bundle of life with the Lord thy God. The souls of thine enemies, them shall he sling out of the middle of a sling. Notice verse 30, and it shall come to pass when the Lord shall have done to my Lord according to all the good that he had spoken concerning thee and shall have appointed thee ruler over Israel. Abigail knew the plan that God had for David. Abigail was aware that he was going to become the king of Israel. And she says that when that comes to pass, notice in verse 31, that this, what is she referring to? That you're going to kill all of the men, that this event, taking matters, avenging thyself with thine own hand, according to verse 26, she says that this shall be no grief unto thee, nor offense of heart unto my Lord, either that thou hast shed blood causeless, or that my Lord hath avenged himself. But when the Lord shall have dealt well with my Lord, then remember thine handmaid. Notice how David responds in verse 32. David said to Abigail, blessed be the Lord God of Israel, which sent thee this day to meet me. Why? Because David was about to take matters into his own hands. Sometimes God might send an Abigail in your life and in my life at just the right time, because we're about to take matters into our own hands. We're about to make a mess of things. God sends an Abigail. David says. Blessed be the Lord God of Israel, which sent thee this day to meet me. He recognizes God's providence, does he not? That God sent her to meet him. Notice in verse 33, he says, And blessed be thy advice, and blessed be thou, which hast kept me this day from coming to shed blood, and from avenging myself with mine own hand. For in very deed, as the Lord God of Israel liveth, which hath kept me back from hurting thee, except thou hast hasted and come to meet me, surely there had not been left unto Nabal by the morning light any that pisseth against the wall. He says, I was gonna kill all of them. That's what he's gonna do. It says in verse number 35, So David received of her hand that which she had brought him and said unto her, go up in peace to thine house. See, I have hearkened to thy voice and have accepted thy person. Nabal still hasn't been dealt with, but God's gonna deal with him. And God's gonna deal with him in such a way that David is not going to have any mark upon his testimony. Not gonna be any reproach, no issues when he becomes the king. It says in verse 36, And Abigail came to Nabal, and behold, he had a feast in his house like the feast of a king, and Nabal's heart was merry within him, for he was very drunken. Wherefore, she told him nothing less or more until the morning light. But it came to pass in the morning when the wine was gone out of Nabal and his wife had told him these things, that his heart died within him and he became as a stone. And it came to pass about 10 days after that the Lord smote Nabal that he died. God's able, God's able. Days passed, but God dealt with Nabal. The Bible says in verse 39, And when David heard that Nabal was dead, he said, Blessed be the Lord. Notice what he says, That hath pleaded the cause of my reproach from the hand of Nabal, and hath kept his servant from evil. For the Lord hath returned the wickedness of Nabal upon his own head. David sent and communed with Abigail to take her to him, to wife. I want you to notice that in this portion of Scripture in Genesis, or excuse me, in 1 Samuel 25, sandwiched between these two events where David is dealing with Saul, there's this interaction with Nabal and Abigail. And David is absolutely determined. In chapter 24, he's not gonna raise his hand against the Lord's anointed. He responds properly. But now Nabal, I'm gonna kill him and I'm gonna kill all the men. Taking matters into my own hands. And he says at the end, after all that we've read and after all that we considered from 1 Samuel 25, he says, that he says, Blessed be the Lord that hath pleaded the cause of my reproach from the hand of Nabal and hath kept his servant from evil. You ever take matters into your own hands and find yourself having to enter into the confession closet and ask God to forgive you for how you behaved? Because when you take matters into your own hands, make a mess of things. We're not trusting the Lord. We're not trusting that he's able. Remember, I said this by way of introduction, when we respond, when we react to being wrong in this manner, then it's really demonstrating a lack of trust, that God is not able, that somehow I have to avenge myself, but God says, vengeance is mine, saith the Lord. And in our lives, listen, you're going to be wronged and I'm gonna be wronged. It's gonna happen. It might happen tonight. It might happen this week. Maybe you've been wronged recently. Maybe you can think this evening of a specific time in which you took matters into your own hands. Said, man, how did I make a mess of this situation? This evening, as we look at the account in Genesis 34, we see the historical account that God provides. Terrible situation. Two wrongs don't make a right. They tried to justify their actions, but what they did was wrong. It was wrong, but it doesn't give you a right to respond wrong. And this evening, if we're gonna avoid taking matters into our own hands, we must recognize the providence of God. We must exercise restraint. And we must understand this evening that God is able. It reveals maturity in the life of a believer. When we're able to be wronged, God's in control. God knows. God is able. I said at the beginning of the message, when we got to Romans, so not really the beginning, the middle of the message, this is not an easy principle. It's not something you're gonna do in your own power. It's not something you're gonna do in your own flesh. Because my flesh and your flesh wants to get even. We don't like being wronged. But this evening, we must avoid taking matters into our own hands. Learn the lessons from the life of David. And thank God when God sends an Abigail in your life. You know what happens for some of us? God sends an Abigail in our life and we get mad at Abigail. Seriously. Who are you to tell me? Just trust the Lord. He's able. Let's pray. Father, we love you. We thank you for loving us. God, we look at a difficult passage of scripture in Genesis 34 this evening. I believe that you've recorded that event not only to give us the historical account, but Lord, to help us understand the importance of not taking matters into our own hands. It's such a common response. At times, if we'd be honest, it's desirable. We wanna get even. We want that revenge. That moment of feeling good. God, we need to take the whole counsel of God into account. You told us that vengeance is yours. You told us to not be overcome with evil, but to overcome evil with good. God, I pray that you'd help us tonight. We live in a world in which we'll be wronged. People will do us wrong and they'll treat us wrong. God, I pray that you'd help us to not react, but God, help us to respond appropriately, biblically. Help us to respond by trusting you, relying upon you. I pray, Lord, that those that maybe are going through a difficulty even at this moment, where they've been wronged, God, I pray that you'd give them wisdom, give them comfort, give them strength. Help us, Lord, to trust you more. I pray that you'd move and work in our hearts and lives as only you can. We'll give you all the honor and glory. Would you stand with me? Heads are bowed, eyes are open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.039999961853027,
      "text": " chapter number 34 and thankful for God's Word and what a blessing it is to be able"
    },
    {
      "id": 1,
      "start": 6.039999961853027,
      "end": 11.239999771118164,
      "text": " to study the Word of God. And as we look at Genesis chapter number 34, there's an historical"
    },
    {
      "id": 2,
      "start": 11.239999771118164,
      "end": 16.18000030517578,
      "text": " event that is recorded for us in this passage of Scripture. The two words that I would use"
    },
    {
      "id": 3,
      "start": 16.18000030517578,
      "end": 21.360000610351562,
      "text": " to describe the event that is recorded for us are sad and unfortunate. And as we look"
    },
    {
      "id": 4,
      "start": 21.360000610351562,
      "end": 27.040000915527344,
      "text": " at this particular passage of Scripture, we understand that God has preserved this account"
    },
    {
      "id": 5,
      "start": 27.040000915527344,
      "end": 31.979999542236328,
      "text": " for us. And there's so many things that happen. In fact, as you study the life of the patriarchs"
    },
    {
      "id": 6,
      "start": 31.979999542236328,
      "end": 39.15999984741211,
      "text": " in the book of Genesis, you'll find many times where events that follow one another in the"
    },
    {
      "id": 7,
      "start": 39.15999984741211,
      "end": 44.68000030517578,
      "text": " passage of Scripture are separated by years of time. And certainly things took place and"
    },
    {
      "id": 8,
      "start": 44.68000030517578,
      "end": 49.720001220703125,
      "text": " God did not see fit to record those events for us. But here He records this event for"
    },
    {
      "id": 9,
      "start": 49.720001220703125,
      "end": 54.959999084472656,
      "text": " us and I believe that He's recorded it for us because there is a lesson that we must"
    },
    {
      "id": 10,
      "start": 54.959999084472656,
      "end": 60.959999084472656,
      "text": " learn. See, this evening I think each of us would agree that life is full of experiences"
    },
    {
      "id": 11,
      "start": 60.959999084472656,
      "end": 66.87999725341797,
      "text": " and at times those experiences are less than desirable. There are times in our lives where"
    },
    {
      "id": 12,
      "start": 66.87999725341797,
      "end": 72.31999969482422,
      "text": " we're mistreated by individuals. There are times in which we are wrong, that people do"
    },
    {
      "id": 13,
      "start": 72.31999969482422,
      "end": 77.12000274658203,
      "text": " us wrong, and we can look at that. We've heard people say life isn't fair and sometimes the"
    },
    {
      "id": 14,
      "start": 77.12000274658203,
      "end": 82.76000213623047,
      "text": " response is, well, that's just the way it is. Life isn't fair. And the reality is that"
    },
    {
      "id": 15,
      "start": 82.76000213623047,
      "end": 89.95999908447266,
      "text": " as we live life in times of offense, when someone treats us wrongly, when someone mistreats"
    },
    {
      "id": 16,
      "start": 89.95999908447266,
      "end": 96.5199966430664,
      "text": " us, we must learn to trust the Lord. And we must learn to trust the Lord and then also"
    },
    {
      "id": 17,
      "start": 96.5199966430664,
      "end": 102.91999816894531,
      "text": " we must learn to avoid taking matters into our own hands. And I would say this, admittedly"
    },
    {
      "id": 18,
      "start": 102.91999816894531,
      "end": 109.5199966430664,
      "text": " this evening, that taking matters into our own hands is common. At times, if we'd be"
    },
    {
      "id": 19,
      "start": 109.5199966430664,
      "end": 115.08000183105469,
      "text": " honest, it's desirable. Isn't it? Sometimes something happens and you say, I just want"
    },
    {
      "id": 20,
      "start": 115.08000183105469,
      "end": 119.83999633789062,
      "text": " to give them a piece of my mind. And you just want to take matters into your own hands."
    },
    {
      "id": 21,
      "start": 119.83999633789062,
      "end": 125.27999877929688,
      "text": " And we find that it's a common practice and at times it's desirable. But I would say this,"
    },
    {
      "id": 22,
      "start": 125.27999877929688,
      "end": 130.47999572753906,
      "text": " that reacting in that fashion of taking matters into our own hands when we're being wronged"
    },
    {
      "id": 23,
      "start": 130.47999572753906,
      "end": 138.0399932861328,
      "text": " is short-sighted. It reveals a lack of trust in the Lord and it often results in a mess."
    },
    {
      "id": 24,
      "start": 138.0399932861328,
      "end": 143.0800018310547,
      "text": " I take matters into my own hands and I find out how quickly I can make a mess of things."
    },
    {
      "id": 25,
      "start": 143.0800018310547,
      "end": 146.9199981689453,
      "text": " And if you've lived life for any length of time, you could agree that that's happened"
    },
    {
      "id": 26,
      "start": 146.9199981689453,
      "end": 152.0399932861328,
      "text": " in your life at some point. This evening, as we look at this particular passage of Scripture,"
    },
    {
      "id": 27,
      "start": 152.0399932861328,
      "end": 158.16000366210938,
      "text": " I would like to look at the historical account, but then also have the opportunity to make"
    },
    {
      "id": 28,
      "start": 158.16000366210938,
      "end": 162.55999755859375,
      "text": " some application in our lives. Begin reading with me there in verse number one. The Bible"
    },
    {
      "id": 29,
      "start": 162.55999755859375,
      "end": 167.9600067138672,
      "text": " says this, And Dinah the daughter of Leah, which she barren to Jacob, went out to see"
    },
    {
      "id": 30,
      "start": 167.9600067138672,
      "end": 173.72000122070312,
      "text": " the daughters of the land. And when Shechem, the son of Hamar, the Hivite, prince of the"
    },
    {
      "id": 31,
      "start": 173.72000122070312,
      "end": 180.52000427246094,
      "text": " country, saw her, he took her and lay with her and defiled her. And his soul claimed"
    },
    {
      "id": 32,
      "start": 180.52000427246094,
      "end": 185.44000244140625,
      "text": " unto Dinah the daughter of Jacob, and he loved the damsel, and spake kindly unto the damsel."
    },
    {
      "id": 33,
      "start": 185.44000244140625,
      "end": 191.32000732421875,
      "text": " And Shechem spake unto his father Hamar, and saying this, Get me this damsel to wife. And"
    },
    {
      "id": 34,
      "start": 191.32000732421875,
      "end": 197.0399932861328,
      "text": " Jacob heard that he had defiled Dinah his daughter. Now his sons were with his cattle"
    },
    {
      "id": 35,
      "start": 197.0399932861328,
      "end": 203.36000061035156,
      "text": " in the field, and Jacob held his peace until they were come. And Hamar, the father of Shechem,"
    },
    {
      "id": 36,
      "start": 203.36000061035156,
      "end": 208.1999969482422,
      "text": " went out unto Jacob to commune with him. The sons of Jacob came out of the field when they"
    },
    {
      "id": 37,
      "start": 208.1999969482422,
      "end": 214.72000122070312,
      "text": " heard it, and the men were grieved. They were wroth, because he had wrought folly in Israel,"
    },
    {
      "id": 38,
      "start": 214.72000122070312,
      "end": 220.8800048828125,
      "text": " in lying with Jacob's daughter, which thing ought not to be done.\" I've titled the message"
    },
    {
      "id": 39,
      "start": 220.8800048828125,
      "end": 225.1999969482422,
      "text": " this evening, as I've already mentioned by way of introduction, Avoid Taking Matters"
    },
    {
      "id": 40,
      "start": 225.1999969482422,
      "end": 229.72000122070312,
      "text": " Into Your Own Hands. As we look at the account that God gives us here in this particular"
    },
    {
      "id": 41,
      "start": 229.72000122070312,
      "end": 235.0399932861328,
      "text": " passage of Scripture, if you're taking notes, I want you to notice under the thought of"
    },
    {
      "id": 42,
      "start": 235.0399932861328,
      "end": 240.16000366210938,
      "text": " the historical account, notice with me the recorded offense. We've read the first seven"
    },
    {
      "id": 43,
      "start": 240.16000366210938,
      "end": 245.60000610351562,
      "text": " verses of Genesis 34, and in this portion of Scripture, God provides us with the recorded"
    },
    {
      "id": 44,
      "start": 245.60000610351562,
      "end": 251.16000366210938,
      "text": " offense. God tells us in verse number one that Dinah, Jacob's daughter, went out and"
    },
    {
      "id": 45,
      "start": 251.16000366210938,
      "end": 254.9600067138672,
      "text": " she interacted with the inhabitants of the land. The Bible says at the end of verse number"
    },
    {
      "id": 46,
      "start": 254.9600067138672,
      "end": 262.239990234375,
      "text": " one that she went out to see the daughters of the land. And we find that in that position,"
    },
    {
      "id": 47,
      "start": 262.239990234375,
      "end": 266.8800048828125,
      "text": " perhaps we could look at that and speak about the fact of being vulnerable in the position"
    },
    {
      "id": 48,
      "start": 266.8800048828125,
      "end": 274.0,
      "text": " in which she was, but we find that in that position that Shechem takes advantage of Dinah."
    },
    {
      "id": 49,
      "start": 274.0,
      "end": 278.2799987792969,
      "text": " The Bible records it and says that he saw her at the end of verse number two, took her"
    },
    {
      "id": 50,
      "start": 278.2799987792969,
      "end": 285.55999755859375,
      "text": " and lay with her and defiled her. And we find that Jacob hears about the situation, of course,"
    },
    {
      "id": 51,
      "start": 285.55999755859375,
      "end": 292.8399963378906,
      "text": " after he had defiled Dinah, Shechem. The Bible says that he desired her to be his wife, and"
    },
    {
      "id": 52,
      "start": 292.8399963378906,
      "end": 297.6400146484375,
      "text": " Jacob hears about what had taken place according to verse number five. And the Bible tells"
    },
    {
      "id": 53,
      "start": 297.6400146484375,
      "end": 303.1600036621094,
      "text": " us at the end of verse number five that he held his peace, and he did not answer the"
    },
    {
      "id": 54,
      "start": 303.1600036621094,
      "end": 308.2799987792969,
      "text": " matter, he did not engage in the conversation. He waited, rather, for his sons to return"
    },
    {
      "id": 55,
      "start": 308.2799987792969,
      "end": 312.239990234375,
      "text": " from the field. They were out tending to the cattle. And the Bible tells us in verse number"
    },
    {
      "id": 56,
      "start": 312.239990234375,
      "end": 317.3999938964844,
      "text": " seven that the sons of Jacob, they came out of the field and they heard the news. They"
    },
    {
      "id": 57,
      "start": 317.3999938964844,
      "end": 323.3599853515625,
      "text": " heard what had taken place. Now, I want you to notice from verse number seven the response"
    },
    {
      "id": 58,
      "start": 323.3599853515625,
      "end": 329.3599853515625,
      "text": " of these brothers when they hear what has taken place. Notice the Bible says, the men"
    },
    {
      "id": 59,
      "start": 329.3599853515625,
      "end": 336.79998779296875,
      "text": " were grieved. I think that's a normal response, don't you? With what we just read, I'm not"
    },
    {
      "id": 60,
      "start": 336.79998779296875,
      "end": 342.3999938964844,
      "text": " going into the details of what took place. You understand in verse number two the situation"
    },
    {
      "id": 61,
      "start": 342.3999938964844,
      "end": 348.3999938964844,
      "text": " between Shechem and Dinah. But you understand this evening that when Dinah's brothers, the"
    },
    {
      "id": 62,
      "start": 348.3999938964844,
      "end": 354.9599914550781,
      "text": " sons of Jacob, when they hear what has transpired, the Bible says that they were grieved. The"
    },
    {
      "id": 63,
      "start": 354.9599914550781,
      "end": 363.8800048828125,
      "text": " Bible goes on to tell us this, and they were very wroth. Again, can you understand why"
    },
    {
      "id": 64,
      "start": 363.8800048828125,
      "end": 368.44000244140625,
      "text": " they would have the reaction that they have based on the circumstances that had taken"
    },
    {
      "id": 65,
      "start": 368.44000244140625,
      "end": 374.239990234375,
      "text": " place? They're grieved. They're angry. They're very wroth. And the Bible tells us at the"
    },
    {
      "id": 66,
      "start": 374.239990234375,
      "end": 378.0400085449219,
      "text": " end of verse number seven, notice what it says, because he had wrought folly in Israel"
    },
    {
      "id": 67,
      "start": 378.0400085449219,
      "end": 384.9200134277344,
      "text": " in lying with Jacob's daughter. And then notice this phrase, which thing ought not to be done."
    },
    {
      "id": 68,
      "start": 385.1199951171875,
      "end": 391.0400085449219,
      "text": " You know, they were right. What took place was inappropriate. What took place was a violation"
    },
    {
      "id": 69,
      "start": 391.0400085449219,
      "end": 396.79998779296875,
      "text": " that should not have taken place. And we find that in that moment, again, as we've mentioned"
    },
    {
      "id": 70,
      "start": 396.79998779296875,
      "end": 400.55999755859375,
      "text": " by way of introduction, and we'll get to it as we get to the application aspect of the"
    },
    {
      "id": 71,
      "start": 400.55999755859375,
      "end": 405.8599853515625,
      "text": " message this evening, there are times in your life, there are times in my life, we see the"
    },
    {
      "id": 72,
      "start": 405.8599853515625,
      "end": 412.20001220703125,
      "text": " historical account here of what's taking place that this just isn't right. It's just not"
    },
    {
      "id": 73,
      "start": 412.20001220703125,
      "end": 421.67999267578125,
      "text": " right what took place. As brothers, I don't have a sister. But I think about the relationships"
    },
    {
      "id": 74,
      "start": 421.67999267578125,
      "end": 427.32000732421875,
      "text": " between brothers and sisters, and those that have sisters, how a brother wants to protect"
    },
    {
      "id": 75,
      "start": 427.32000732421875,
      "end": 434.7200012207031,
      "text": " his sisters. Joseph is the youngest. He's the tallest now, but he's the youngest. But"
    },
    {
      "id": 76,
      "start": 434.7200012207031,
      "end": 443.1199951171875,
      "text": " he has two older sisters, but he desires, as a brother, to protect his sisters. And"
    },
    {
      "id": 77,
      "start": 443.1199951171875,
      "end": 448.760009765625,
      "text": " I could understand if this type of event happened where he would be grieved, where he would"
    },
    {
      "id": 78,
      "start": 448.760009765625,
      "end": 457.0,
      "text": " be very wroth. I can understand. I can relate to the sons of Jacob, can't you? The Bible"
    },
    {
      "id": 79,
      "start": 457.0,
      "end": 462.0,
      "text": " gives us, it records for us the offense that takes place in the remaining portion of the"
    },
    {
      "id": 80,
      "start": 462.0,
      "end": 467.32000732421875,
      "text": " Scripture here in Genesis chapter 34. We see that there's a response that is outlined."
    },
    {
      "id": 81,
      "start": 467.32000732421875,
      "end": 473.9200134277344,
      "text": " Notice as the sons of Jacob hear word of what has transpired beginning in verse number 8,"
    },
    {
      "id": 82,
      "start": 473.9200134277344,
      "end": 479.44000244140625,
      "text": " the response is outlined for us. And in verses 8 through 12, we find that there's a request"
    },
    {
      "id": 83,
      "start": 479.44000244140625,
      "end": 485.4800109863281,
      "text": " that is given from Hamar and Shechem to Jacob and the boys. Notice in verse number 8, the"
    },
    {
      "id": 84,
      "start": 485.4800109863281,
      "end": 492.20001220703125,
      "text": " Bible says, And Hamar communed with them, saying, The soul of my son Shechem longeth"
    },
    {
      "id": 85,
      "start": 492.20001220703125,
      "end": 499.3999938964844,
      "text": " for your daughter. I pray you give her him to wife, and make ye marriages with us, and"
    },
    {
      "id": 86,
      "start": 499.3999938964844,
      "end": 506.5199890136719,
      "text": " give your daughters unto us, and take our daughters unto you. By the way, it's a subject"
    },
    {
      "id": 87,
      "start": 506.5199890136719,
      "end": 510.0,
      "text": " that we could develop from verse number 9, and we will not this evening, but you could"
    },
    {
      "id": 88,
      "start": 510.0,
      "end": 515.5999755859375,
      "text": " develop it quite extensively. This is the first attempt to defile the Messianic line."
    },
    {
      "id": 89,
      "start": 515.5999755859375,
      "end": 519.5599975585938,
      "text": " You can understand what's taking place and all the defilement. We're saying, Hey, let"
    },
    {
      "id": 90,
      "start": 519.5599975585938,
      "end": 525.4400024414062,
      "text": " us intermarry. And we find that in verse number 10, it says, And ye shall dwell with us, and"
    },
    {
      "id": 91,
      "start": 525.4400024414062,
      "end": 532.5999755859375,
      "text": " the land shall be before you. Dwell and trade ye therein, and get you possessions therein."
    },
    {
      "id": 92,
      "start": 532.5999755859375,
      "end": 536.3200073242188,
      "text": " It's as if they're trying to sweeten the deal, if you will, in verse number 10, and make"
    },
    {
      "id": 93,
      "start": 536.3200073242188,
      "end": 541.239990234375,
      "text": " it extremely attractive to get what they want. In verse number 11, it says that Shechem"
    },
    {
      "id": 94,
      "start": 541.239990234375,
      "end": 546.0,
      "text": " said unto her father and unto her brethren, Let me find grace in your eyes, and what ye"
    },
    {
      "id": 95,
      "start": 546.0,
      "end": 552.7999877929688,
      "text": " shall say unto me I will give. Ask me never so much dowry and gift, and I will give according"
    },
    {
      "id": 96,
      "start": 552.7999877929688,
      "end": 562.0399780273438,
      "text": " as ye shall say unto me, but give me the damsel to wife. We see the request. It's quite plain,"
    },
    {
      "id": 97,
      "start": 562.0399780273438,
      "end": 571.8400268554688,
      "text": " is it not? Shechem, he wants Dinah to be his wife. Hamar says, Hey, let our group,"
    },
    {
      "id": 98,
      "start": 571.8400268554688,
      "end": 576.280029296875,
      "text": " let us intermarry. You can dwell with us, and you can have of the possessions, trade"
    },
    {
      "id": 99,
      "start": 576.280029296875,
      "end": 582.0399780273438,
      "text": " with us, so on and so forth. And we find that now there will be a proposal that is given"
    },
    {
      "id": 100,
      "start": 582.0399780273438,
      "end": 586.4400024414062,
      "text": " from the sons of Jacob. Notice in verse number 13, it's interesting that Jacob is not the"
    },
    {
      "id": 101,
      "start": 586.4400024414062,
      "end": 590.5599975585938,
      "text": " one having the correspondence, but he allows the boys to speak on his behalf. And it says"
    },
    {
      "id": 102,
      "start": 590.5599975585938,
      "end": 595.0,
      "text": " in verse number 13, And the sons of Jacob answered Shechem and Hamar his father, notice"
    },
    {
      "id": 103,
      "start": 595.0,
      "end": 599.9600219726562,
      "text": " this word, deceitfully. Deceitfully. I remember as a child hearing this"
    },
    {
      "id": 0,
      "start": 599.9600219726562,
      "end": 603.0800218582153,
      "text": " phrase, I'm sure you've heard it as well, two wrongs don't make a right."
    },
    {
      "id": 1,
      "start": 603.0800218582153,
      "end": 604.9600219726562,
      "text": " How many of you have heard that before?"
    },
    {
      "id": 2,
      "start": 604.9600219726562,
      "end": 606.4600219726562,
      "text": " Two wrongs don't make a right."
    },
    {
      "id": 3,
      "start": 606.4600219726562,
      "end": 607.9600219726562,
      "text": " Two wrongs make a mess, right?"
    },
    {
      "id": 4,
      "start": 607.9600219726562,
      "end": 609.520022392273,
      "text": " That's how it works."
    },
    {
      "id": 5,
      "start": 609.520022392273,
      "end": 614.9200220108032,
      "text": " But we find here that these sons of Jacob, the boys now remember their grieve, they're"
    },
    {
      "id": 6,
      "start": 614.9200220108032,
      "end": 621.4800224304199,
      "text": " very wroth, they're correct in their assessment, this thing ought not to have been done."
    },
    {
      "id": 7,
      "start": 621.4800224304199,
      "end": 626.9200210571289,
      "text": " But now they're devising a plan, they're making a proposal, but they're being deceitful,"
    },
    {
      "id": 8,
      "start": 626.9200210571289,
      "end": 630.5200214385986,
      "text": " they answer Shechem and Hamar deceitfully."
    },
    {
      "id": 9,
      "start": 630.5200214385986,
      "end": 634.5600204467773,
      "text": " Notice what they say in verse 13, because he had defiled thine other sister, notice"
    },
    {
      "id": 10,
      "start": 634.5600204467773,
      "end": 638.8000221252441,
      "text": " they said unto them in verse 14, we cannot do this thing, to give our sister to one that"
    },
    {
      "id": 11,
      "start": 638.8000221252441,
      "end": 642.5400238037109,
      "text": " is uncircumcised, for that were a reproach unto us."
    },
    {
      "id": 12,
      "start": 642.5400238037109,
      "end": 648.6000213623047,
      "text": " But in this will we consent unto you, if ye will be as we be, that every male of you"
    },
    {
      "id": 13,
      "start": 648.6000213623047,
      "end": 654.0000228881836,
      "text": " be circumcised, then will we give our daughters unto you, and we will take your daughters"
    },
    {
      "id": 14,
      "start": 654.080020904541,
      "end": 658.7600212097168,
      "text": " to us, and we will dwell with you, and we will become one people."
    },
    {
      "id": 15,
      "start": 658.7600212097168,
      "end": 664.2000198364258,
      "text": " But if ye will not hearken unto us to be circumcised, then we will take our daughter, and we will"
    },
    {
      "id": 16,
      "start": 664.2000198364258,
      "end": 665.2000198364258,
      "text": " be gone."
    },
    {
      "id": 17,
      "start": 665.2000198364258,
      "end": 667.0000228881836,
      "text": " Again, it's quite plain."
    },
    {
      "id": 18,
      "start": 667.0000228881836,
      "end": 671.2000198364258,
      "text": " The request, the proposal, and there's an agreement that is reached."
    },
    {
      "id": 19,
      "start": 671.2000198364258,
      "end": 676.4400253295898,
      "text": " Notice the statement in verse 18, the Bible says that the words pleased Hamar and Shechem,"
    },
    {
      "id": 20,
      "start": 676.4400253295898,
      "end": 682.3600234985352,
      "text": " Hamar's son, and the young man deferred not to do the thing, because he had delight in"
    },
    {
      "id": 21,
      "start": 682.3600234985352,
      "end": 686.4800186157227,
      "text": " Jacob's daughter, and he was more honorable than all the house of his father."
    },
    {
      "id": 22,
      "start": 686.4800186157227,
      "end": 690.8800201416016,
      "text": " And verse 20 says that Hamar and Shechem, his son, came unto the gate of their city"
    },
    {
      "id": 23,
      "start": 690.8800201416016,
      "end": 694.4000244140625,
      "text": " and communed with the men of their city, saying, now notice what they say to the men of the"
    },
    {
      "id": 24,
      "start": 694.4000244140625,
      "end": 695.4000244140625,
      "text": " city."
    },
    {
      "id": 25,
      "start": 695.4000244140625,
      "end": 696.4000244140625,
      "text": " It's quite interesting."
    },
    {
      "id": 26,
      "start": 696.4000244140625,
      "end": 697.9200210571289,
      "text": " It gives some insight here that what's happening."
    },
    {
      "id": 27,
      "start": 697.9200210571289,
      "end": 703.2200241088867,
      "text": " In verse 21, they say this to the men of the city, these men are peaceable with us, therefore"
    },
    {
      "id": 28,
      "start": 703.2200241088867,
      "end": 706.5600204467773,
      "text": " let them dwell in the land and trade therein."
    },
    {
      "id": 29,
      "start": 706.5600204467773,
      "end": 711.3200225830078,
      "text": " Notice what they say, for the land, behold, it is large enough for them, let us take their"
    },
    {
      "id": 30,
      "start": 711.3200225830078,
      "end": 717.2400207519531,
      "text": " daughters to us for wives, and let us give them our daughters, verse 22, only herein"
    },
    {
      "id": 31,
      "start": 717.2400207519531,
      "end": 722.2800216674805,
      "text": " will the men consent unto us for to dwell with us, to be one people, if every male among"
    },
    {
      "id": 32,
      "start": 722.2800216674805,
      "end": 725.7600250244141,
      "text": " us be circumcised as they are circumcised."
    },
    {
      "id": 33,
      "start": 725.7600250244141,
      "end": 732.8800201416016,
      "text": " But notice what they say in verse 23, shall not their cattle and their substance and every"
    },
    {
      "id": 34,
      "start": 732.8800201416016,
      "end": 739.2000274658203,
      "text": " beast of theirs be ours."
    },
    {
      "id": 35,
      "start": 739.2000274658203,
      "end": 741.6400146484375,
      "text": " There's a lot of deceit going on."
    },
    {
      "id": 36,
      "start": 741.6400146484375,
      "end": 748.9200286865234,
      "text": " There's a lot of, this situation is full of just unfortunate approaches and we find that"
    },
    {
      "id": 37,
      "start": 748.9200286865234,
      "end": 755.3200225830078,
      "text": " they have this attitude of, listen, we're going to be able to be increased with goods"
    },
    {
      "id": 38,
      "start": 755.3200225830078,
      "end": 759.3200225830078,
      "text": " and so on and so forth, and it says at the end of verse 23, only let us consent unto"
    },
    {
      "id": 39,
      "start": 759.3200225830078,
      "end": 761.8800201416016,
      "text": " them and they will dwell with us."
    },
    {
      "id": 40,
      "start": 761.8800201416016,
      "end": 767.1200256347656,
      "text": " And unto Hamar and unto Shechem, verse 24, and his son hearkened all that went out of"
    },
    {
      "id": 41,
      "start": 767.1200256347656,
      "end": 773.2000274658203,
      "text": " the gate of his city, and every male was circumcised, all that went out of the gate"
    },
    {
      "id": 42,
      "start": 773.2000274658203,
      "end": 774.4800262451172,
      "text": " of his city."
    },
    {
      "id": 43,
      "start": 774.4800262451172,
      "end": 779.5600280761719,
      "text": " So we find that there was a request that was given, there was a proposal that was made,"
    },
    {
      "id": 44,
      "start": 779.5600280761719,
      "end": 783.9200286865234,
      "text": " and there was an agreement that was reached, and all of the men of the city, the Bible"
    },
    {
      "id": 45,
      "start": 783.9200286865234,
      "end": 788.4400177001953,
      "text": " says all of them that came out of the gate of the city, they were circumcised, and we"
    },
    {
      "id": 46,
      "start": 788.4400177001953,
      "end": 793.1200256347656,
      "text": " find that the Bible begins to record for us in verses 25 through 29 a great slaughter"
    },
    {
      "id": 47,
      "start": 793.1200256347656,
      "end": 795.1600189208984,
      "text": " that took place."
    },
    {
      "id": 48,
      "start": 795.2000274658203,
      "end": 800.2400207519531,
      "text": " This was exactly the plan of the sons of Jacob when the Bible tells us in verse number 13"
    },
    {
      "id": 49,
      "start": 800.2400207519531,
      "end": 802.2400207519531,
      "text": " that they answered them deceitfully."
    },
    {
      "id": 50,
      "start": 802.2400207519531,
      "end": 807.6800231933594,
      "text": " They knew what they were doing, they understood the opportunity that this would provide them"
    },
    {
      "id": 51,
      "start": 807.6800231933594,
      "end": 808.6800231933594,
      "text": " with."
    },
    {
      "id": 52,
      "start": 808.6800231933594,
      "end": 812.8400268554688,
      "text": " And the Bible says in verse 25, and it came to pass on the third day when they were sore"
    },
    {
      "id": 53,
      "start": 812.8400268554688,
      "end": 817.7400207519531,
      "text": " that two of the sons of Jacob, Simeon and Levi, Dinah's brethren, took each man a sword"
    },
    {
      "id": 54,
      "start": 817.7400207519531,
      "end": 822.0000152587891,
      "text": " and came upon the city boldly, notice what it says, and slew all the males."
    },
    {
      "id": 55,
      "start": 822.0000152587891,
      "end": 824.8800201416016,
      "text": " It's a great slaughter that takes place."
    },
    {
      "id": 56,
      "start": 824.8800201416016,
      "end": 830.1200256347656,
      "text": " It says that they slew Hamar and Shechem his son with the edge of the sword and took Dinah"
    },
    {
      "id": 57,
      "start": 830.1200256347656,
      "end": 832.6000213623047,
      "text": " out of Shechem's house and went out."
    },
    {
      "id": 58,
      "start": 832.6000213623047,
      "end": 836.3200225830078,
      "text": " The sons of Jacob came upon the slain and spoiled the city."
    },
    {
      "id": 59,
      "start": 836.3200225830078,
      "end": 837.3200225830078,
      "text": " Why?"
    },
    {
      "id": 60,
      "start": 837.3200225830078,
      "end": 840.6800231933594,
      "text": " Because they had defiled their sister."
    },
    {
      "id": 61,
      "start": 840.6800231933594,
      "end": 845.3200225830078,
      "text": " Verse 28 says that they took their sheep and their oxen, their asses, and that which was"
    },
    {
      "id": 62,
      "start": 845.3200225830078,
      "end": 848.9200286865234,
      "text": " in the city and that which was in the field, and all their wealth and all their little"
    },
    {
      "id": 63,
      "start": 848.9200286865234,
      "end": 855.5600280761719,
      "text": " ones and their wives, took they captive and spoiled even all that was in the house."
    },
    {
      "id": 64,
      "start": 855.5600280761719,
      "end": 860.9600219726562,
      "text": " Isn't this an unfortunate event that takes place in Genesis chapter 34?"
    },
    {
      "id": 65,
      "start": 860.9600219726562,
      "end": 866.4000244140625,
      "text": " I mean it begins with a violation, but we find then that matters are taken into their"
    },
    {
      "id": 66,
      "start": 866.4000244140625,
      "end": 870.5400085449219,
      "text": " own hands and we find that they respond deceitfully and there's this great slaughter."
    },
    {
      "id": 67,
      "start": 870.5400085449219,
      "end": 874.9200134277344,
      "text": " And we know that in verse number 30 that there is a great level of fear and concern on the"
    },
    {
      "id": 68,
      "start": 874.9200134277344,
      "end": 879.6400146484375,
      "text": " part of Jacob for the Bible says that Jacob says to Simeon and Levi, ye have troubled"
    },
    {
      "id": 69,
      "start": 879.6400146484375,
      "end": 883.8800354003906,
      "text": " me to make me to stink among the inhabitants of the land, among the Canaanites and the"
    },
    {
      "id": 70,
      "start": 883.8800354003906,
      "end": 890.0000305175781,
      "text": " parasites, and I being few in number, they shall gather themselves together against me"
    },
    {
      "id": 71,
      "start": 890.0000305175781,
      "end": 895.0400085449219,
      "text": " and slay me and I shall be destroyed, I and my house."
    },
    {
      "id": 72,
      "start": 895.0400085449219,
      "end": 898.9600219726562,
      "text": " Now we understand as we've studied through the book of Genesis that often as we read"
    },
    {
      "id": 73,
      "start": 898.9600219726562,
      "end": 904.8800354003906,
      "text": " about Jacob and his response to certain circumstances and events, he's a man that's often fearful."
    },
    {
      "id": 74,
      "start": 905.8800354003906,
      "end": 912.0800170898438,
      "text": " And we find this being expressed in verse number 30 because of what has transpired,"
    },
    {
      "id": 75,
      "start": 912.0800170898438,
      "end": 916.9600219726562,
      "text": " but I want you to understand the perspective of the sons as it's given to us in verse"
    },
    {
      "id": 76,
      "start": 916.9600219726562,
      "end": 917.9600219726562,
      "text": " 31."
    },
    {
      "id": 77,
      "start": 917.9600219726562,
      "end": 924.6800231933594,
      "text": " The Bible says that they said, should he deal with our sister as with an harlot?"
    },
    {
      "id": 78,
      "start": 924.6800231933594,
      "end": 930.1400146484375,
      "text": " Really I believe that as you look at verse number 31, this answer to Jacob when he expresses"
    },
    {
      "id": 79,
      "start": 930.1400146484375,
      "end": 935.5800170898438,
      "text": " his fear and concern in verse number 30 to his sons, to Simeon and Levi specifically,"
    },
    {
      "id": 80,
      "start": 935.5800170898438,
      "end": 941.3400268554688,
      "text": " I believe that these boys and their response as it's recorded in verse 31 is really seeking"
    },
    {
      "id": 81,
      "start": 941.3400268554688,
      "end": 945.1800231933594,
      "text": " to justify their actions, to justify their actions."
    },
    {
      "id": 82,
      "start": 945.1800231933594,
      "end": 950.2200317382812,
      "text": " By the way, isn't that typically what we do when we take matters in our own hands?"
    },
    {
      "id": 83,
      "start": 950.2200317382812,
      "end": 954.260009765625,
      "text": " We take matters in our own hands and then we justify our actions."
    },
    {
      "id": 84,
      "start": 954.260009765625,
      "end": 956.0600280761719,
      "text": " But do you know what they did to me?"
    },
    {
      "id": 85,
      "start": 956.0600280761719,
      "end": 957.5400085449219,
      "text": " Do you know what they said?"
    },
    {
      "id": 86,
      "start": 957.5400085449219,
      "end": 961.1000366210938,
      "text": " Do you know what...isn't that what we do?"
    },
    {
      "id": 87,
      "start": 961.1000366210938,
      "end": 966.1800231933594,
      "text": " And we find here, listen, I've already acknowledged this evening that what took place as they"
    },
    {
      "id": 88,
      "start": 966.1800231933594,
      "end": 970.5000305175781,
      "text": " say in verse number 7, this thing ought not to be done."
    },
    {
      "id": 89,
      "start": 970.5000305175781,
      "end": 973.3800354003906,
      "text": " They were absolutely correct."
    },
    {
      "id": 90,
      "start": 973.3800354003906,
      "end": 976.9400329589844,
      "text": " They took matters in their own hands."
    },
    {
      "id": 91,
      "start": 976.9400329589844,
      "end": 982.260009765625,
      "text": " Jacob will mention this very thing in Genesis 49, turn over if you will, when he's dying"
    },
    {
      "id": 92,
      "start": 982.260009765625,
      "end": 986.7000122070312,
      "text": " and the blessings are being given to his sons."
    },
    {
      "id": 93,
      "start": 986.7000122070312,
      "end": 997.1000366210938,
      "text": " Notice what he says in Genesis chapter 49, beginning in verse number 1, Genesis 49 and"
    },
    {
      "id": 94,
      "start": 997.1000366210938,
      "end": 1000.9400329589844,
      "text": " verse 1, the Bible says, and Jacob called unto his sons and said, gather yourselves"
    },
    {
      "id": 95,
      "start": 1000.9400329589844,
      "end": 1006.260009765625,
      "text": " together that I may tell you that which shall befall you in the last days."
    },
    {
      "id": 96,
      "start": 1006.260009765625,
      "end": 1012.02001953125,
      "text": " Gather yourselves together and hear you sons of Jacob and hearken unto Israel your father."
    },
    {
      "id": 97,
      "start": 1012.02001953125,
      "end": 1015.260009765625,
      "text": " Notice beginning in verse number 5, he begins speaking to Simeon and Levi."
    },
    {
      "id": 98,
      "start": 1015.260009765625,
      "end": 1020.3800354003906,
      "text": " These are the two that we read of in Genesis 34 that we just read the entirety of the account,"
    },
    {
      "id": 99,
      "start": 1020.3800354003906,
      "end": 1022.5000305175781,
      "text": " this historical account that took place."
    },
    {
      "id": 100,
      "start": 1022.5000305175781,
      "end": 1026.1000366210938,
      "text": " And notice what Jacob says when he's on his deathbed here."
    },
    {
      "id": 101,
      "start": 1026.1000366210938,
      "end": 1032.260009765625,
      "text": " It says, Simeon and Levi are brethren, instruments of cruelty are in their habitations."
    },
    {
      "id": 102,
      "start": 1032.260009765625,
      "end": 1037.9000244140625,
      "text": " Oh my soul, come not thou into their secret, unto their assembly."
    },
    {
      "id": 103,
      "start": 1037.9000244140625,
      "end": 1041.3400268554688,
      "text": " Mine honor, be not thou united."
    },
    {
      "id": 104,
      "start": 1041.3400268554688,
      "end": 1048.4200134277344,
      "text": " For in their anger, they slew a man and in their self-will, they digged down a wall."
    },
    {
      "id": 105,
      "start": 1048.4200134277344,
      "end": 1054.4600219726562,
      "text": " Cursed be their anger, for it was fierce, and their wrath, for it was cruel."
    },
    {
      "id": 106,
      "start": 1054.4600219726562,
      "end": 1058.260009765625,
      "text": " I will divide them in Jacob and scatter them in Israel."
    },
    {
      "id": 107,
      "start": 1058.260009765625,
      "end": 1064.2200317382812,
      "text": " Isn't it interesting that Jacob makes mention specifically of this event that we just read"
    },
    {
      "id": 108,
      "start": 1064.2200317382812,
      "end": 1070.8000183105469,
      "text": " of Genesis 34 about Simeon and Levi and he talks about their anger and how it was fierce"
    },
    {
      "id": 109,
      "start": 1070.8000183105469,
      "end": 1074.2000122070312,
      "text": " and how their wrath was cruel."
    },
    {
      "id": 110,
      "start": 1074.2000122070312,
      "end": 1078.280029296875,
      "text": " There are times in our lives that we want to take matters into our own hands."
    },
    {
      "id": 111,
      "start": 1078.280029296875,
      "end": 1082.5600280761719,
      "text": " And I believe this evening that as we look at the historical account in Genesis 34, and"
    },
    {
      "id": 112,
      "start": 1082.5600280761719,
      "end": 1087.280029296875,
      "text": " obviously I've gone very quickly at these 31 verses to kind of dig through it and look"
    },
    {
      "id": 113,
      "start": 1087.280029296875,
      "end": 1092.280029296875,
      "text": " at the account, but I want to spend some time this evening to seek to make an application"
    },
    {
      "id": 114,
      "start": 1092.280029296875,
      "end": 1094.3600158691406,
      "text": " for each of us this evening."
    },
    {
      "id": 115,
      "start": 1094.3600158691406,
      "end": 1098.6800231933594,
      "text": " Because we are tempted in our lives as we go through life, there are times in which"
    },
    {
      "id": 116,
      "start": 1098.760009765625,
      "end": 1103.9200134277344,
      "text": " you will be tempted and I will be tempted to take matters into my own hands and into"
    },
    {
      "id": 117,
      "start": 1103.9200134277344,
      "end": 1105.760009765625,
      "text": " your own hands."
    },
    {
      "id": 118,
      "start": 1105.760009765625,
      "end": 1108.760009765625,
      "text": " Look over at the New Testament, if you will, to the book of Romans."
    },
    {
      "id": 119,
      "start": 1108.760009765625,
      "end": 1113.5800170898438,
      "text": " Look at Romans chapter number 12 and then we'll look at a number of passages of Scripture"
    },
    {
      "id": 120,
      "start": 1113.5800170898438,
      "end": 1120.02001953125,
      "text": " this evening as we seek to make this point this evening of how important it is that we"
    },
    {
      "id": 121,
      "start": 1120.02001953125,
      "end": 1125.280029296875,
      "text": " resist, that we avoid taking matters into our own hands."
    },
    {
      "id": 122,
      "start": 1125.280029296875,
      "end": 1130.1199951171875,
      "text": " We said number one, the account, number two, the application, the application that we receive"
    },
    {
      "id": 123,
      "start": 1130.1199951171875,
      "end": 1131.9600219726562,
      "text": " from this portion of Scripture."
    },
    {
      "id": 124,
      "start": 1131.9600219726562,
      "end": 1136.52001953125,
      "text": " It's interesting in verse number 18, the Bible says this of Romans 12, if it be possible"
    },
    {
      "id": 125,
      "start": 1136.52001953125,
      "end": 1139.6799926757812,
      "text": " as much lieth in you, live peaceably with all men."
    },
    {
      "id": 126,
      "start": 1139.6799926757812,
      "end": 1141.6000366210938,
      "text": " Isn't that a great verse of Scripture?"
    },
    {
      "id": 127,
      "start": 1141.6000366210938,
      "end": 1145.9200439453125,
      "text": " Some people say, this is as much possibility as I have, right?"
    },
    {
      "id": 128,
      "start": 1145.9200439453125,
      "end": 1154.800048828125,
      "text": " But it says in verse 19, notice what God says, dearly beloved, avenge not yourselves, but"
    },
    {
      "id": 129,
      "start": 1154.800048828125,
      "end": 1158.280029296875,
      "text": " rather give place unto wrath."
    },
    {
      "id": 130,
      "start": 1158.280029296875,
      "end": 1167.9200439453125,
      "text": " For it is written, vengeance is mine, I will repay, saith the Lord."
    },
    {
      "id": 131,
      "start": 1167.9200439453125,
      "end": 1173.4800415039062,
      "text": " Therefore if thine enemy hunger, feed him."
    },
    {
      "id": 132,
      "start": 1173.4800415039062,
      "end": 1175.7200317382812,
      "text": " Excuse me?"
    },
    {
      "id": 133,
      "start": 1175.7200317382812,
      "end": 1177.3200073242188,
      "text": " My enemy?"
    },
    {
      "id": 134,
      "start": 1177.3200073242188,
      "end": 1179.2400512695312,
      "text": " My enemy is hungry?"
    },
    {
      "id": 135,
      "start": 1179.2400512695312,
      "end": 1180.800048828125,
      "text": " Feed him."
    },
    {
      "id": 136,
      "start": 1180.800048828125,
      "end": 1182.2000122070312,
      "text": " Feed him."
    },
    {
      "id": 137,
      "start": 1182.2000122070312,
      "end": 1186.0400390625,
      "text": " If he thirsts, give him drink."
    },
    {
      "id": 138,
      "start": 1186.0400390625,
      "end": 1192.3200073242188,
      "text": " For in so doing thou shalt heap coals of fire on his head."
    },
    {
      "id": 139,
      "start": 1192.3200073242188,
      "end": 1197.0,
      "text": " I remember hearing my mom say when I was a kid, she didn't know anything about the Bible,"
    },
    {
      "id": 140,
      "start": 1197.0,
      "end": 1198.800048828125,
      "text": " but she said, kill him with kindness."
    },
    {
      "id": 141,
      "start": 1198.800048828125,
      "end": 1200.0400390625,
      "text": " She said that all the time."
    },
    {
      "id": 0,
      "start": 1200.0400390625,
      "end": 1201.0400390625,
      "text": " the time."
    },
    {
      "id": 1,
      "start": 1201.0400390625,
      "end": 1202.0400390625,
      "text": " Kill them with kindness."
    },
    {
      "id": 2,
      "start": 1202.0400390625,
      "end": 1205.8400392532349,
      "text": " I want to kill them, but not with kindness, you understand, right?"
    },
    {
      "id": 3,
      "start": 1205.8400392532349,
      "end": 1209.920039176941,
      "text": " But that's what she'd say all the time."
    },
    {
      "id": 4,
      "start": 1209.920039176941,
      "end": 1218.3200397491455,
      "text": " Notice verse 21, be not overcome of evil, but overcome evil with good."
    },
    {
      "id": 5,
      "start": 1218.3200397491455,
      "end": 1225.2800388336182,
      "text": " I would submit to you this evening, this is not easy to do, and you cannot do it in your"
    },
    {
      "id": 6,
      "start": 1225.2800388336182,
      "end": 1226.8000392913818,
      "text": " own power."
    },
    {
      "id": 7,
      "start": 1226.8000392913818,
      "end": 1233.2800407409668,
      "text": " You cannot do it in your flesh, because your flesh wants to take matters into its own hands."
    },
    {
      "id": 8,
      "start": 1233.2800407409668,
      "end": 1235.9600372314453,
      "text": " Your flesh wants to get even."
    },
    {
      "id": 9,
      "start": 1235.9600372314453,
      "end": 1239.3600387573242,
      "text": " Your flesh wants to repay evil with evil, right?"
    },
    {
      "id": 10,
      "start": 1239.3600387573242,
      "end": 1248.0800399780273,
      "text": " That's what we want to do, revenge, get even, get back, have the last word."
    },
    {
      "id": 11,
      "start": 1248.0800399780273,
      "end": 1255.9600372314453,
      "text": " It's interesting, Brother Lennon had no idea that I'd be preaching this message this evening."
    },
    {
      "id": 12,
      "start": 1255.9600372314453,
      "end": 1261.440040588379,
      "text": " We were sitting at the table last evening, and he was talking about the unique opportunities"
    },
    {
      "id": 13,
      "start": 1261.440040588379,
      "end": 1266.0000381469727,
      "text": " that they have ministering where they are in Ecuador, and he shared some things with"
    },
    {
      "id": 14,
      "start": 1266.0000381469727,
      "end": 1272.8800354003906,
      "text": " us about ministering amongst the Latino community and amongst the Persian community, but those"
    },
    {
      "id": 15,
      "start": 1272.8800354003906,
      "end": 1280.2800369262695,
      "text": " of the Indian background, the natives that were there for the Incas and what have you,"
    },
    {
      "id": 16,
      "start": 1280.2800369262695,
      "end": 1285.6000366210938,
      "text": " and some of the ministry amongst that people group there, and how some of them continue"
    },
    {
      "id": 17,
      "start": 1285.6000366210938,
      "end": 1290.920036315918,
      "text": " to have within their tribes and all of those things, the witch doctors and curses and voodoo"
    },
    {
      "id": 18,
      "start": 1290.920036315918,
      "end": 1295.8400421142578,
      "text": " sorts of things and all of that, and he was sharing with me about times in which those"
    },
    {
      "id": 19,
      "start": 1295.8400421142578,
      "end": 1297.4000396728516,
      "text": " folks will get saved."
    },
    {
      "id": 20,
      "start": 1297.4000396728516,
      "end": 1302.9600372314453,
      "text": " They'll get saved out of that false teaching and out of that false religion, and they'll"
    },
    {
      "id": 21,
      "start": 1302.9600372314453,
      "end": 1308.2800369262695,
      "text": " get saved, but there's so much of that in their background that somebody then puts a"
    },
    {
      "id": 22,
      "start": 1308.2800369262695,
      "end": 1312.6000366210938,
      "text": " curse against them, so then they want to go to the witch doctor and they want to take"
    },
    {
      "id": 23,
      "start": 1312.6000366210938,
      "end": 1319.0000381469727,
      "text": " and put a curse back, and Brother Lennon said, we have to teach them to trust God."
    },
    {
      "id": 24,
      "start": 1319.0000381469727,
      "end": 1325.2800369262695,
      "text": " We've got to teach them to rely upon the Lord, and I thought it was so interesting because"
    },
    {
      "id": 25,
      "start": 1325.2800369262695,
      "end": 1330.2000427246094,
      "text": " that tendency is not only for those people that have had that experience in their life,"
    },
    {
      "id": 26,
      "start": 1330.2000427246094,
      "end": 1337.4400329589844,
      "text": " but just a human response when somebody does us wrong, and here God says, vengeance is"
    },
    {
      "id": 27,
      "start": 1337.6000366210938,
      "end": 1344.6000366210938,
      "text": " mine, I will repay, saith the Lord. Be not overcome of evil, but overcome evil with good."
    },
    {
      "id": 28,
      "start": 1346.6400451660156,
      "end": 1351.560043334961,
      "text": " I would say this tonight as we think about this truth of avoiding taking matters into"
    },
    {
      "id": 29,
      "start": 1351.560043334961,
      "end": 1357.0400390625,
      "text": " my own hands, how can I do that? Number one, I would say this, if I'm going to avoid taking"
    },
    {
      "id": 30,
      "start": 1357.0400390625,
      "end": 1362.6800384521484,
      "text": " matters into my own hands, I must recognize God's providence. I must recognize that God's"
    },
    {
      "id": 31,
      "start": 1362.7200317382812,
      "end": 1369.3200378417969,
      "text": " in control. We can speak often about God being in control, but when someone does us wrong,"
    },
    {
      "id": 32,
      "start": 1369.3200378417969,
      "end": 1375.6400451660156,
      "text": " when there's an evil that is committed against us, this evening I wonder, do we understand"
    },
    {
      "id": 33,
      "start": 1375.6400451660156,
      "end": 1382.2400360107422,
      "text": " the truth that God is in control even in those moments? See, it seems as if in our lives"
    },
    {
      "id": 34,
      "start": 1382.2400360107422,
      "end": 1386.520034790039,
      "text": " when things seem to be going well, when there seems to be a great victory, man, God is in"
    },
    {
      "id": 35,
      "start": 1386.520034790039,
      "end": 1391.2400360107422,
      "text": " control. When someone does us wrong, when someone falsely accuses us, when something"
    },
    {
      "id": 36,
      "start": 1391.280044555664,
      "end": 1396.4800415039062,
      "text": " happens in our life like what happens to Joseph at the end of the book of Genesis, he makes"
    },
    {
      "id": 37,
      "start": 1396.4800415039062,
      "end": 1400.4000396728516,
      "text": " this testimony. Of course, he's sold into slavery, and you can read all that takes place"
    },
    {
      "id": 38,
      "start": 1400.4000396728516,
      "end": 1406.7000427246094,
      "text": " beginning in chapter 37 of the book of Genesis, but he says, you meant it unto evil, but God"
    },
    {
      "id": 39,
      "start": 1406.7000427246094,
      "end": 1413.7000427246094,
      "text": " meant it unto good. What a perspective, understanding, recognizing God's providence. I believe that"
    },
    {
      "id": 40,
      "start": 1414.7000427246094,
      "end": 1421.9400329589844,
      "text": " when I recognize, when you recognize God's providence in our lives that will enable us"
    },
    {
      "id": 41,
      "start": 1421.9400329589844,
      "end": 1427.8600463867188,
      "text": " to demonstrate restraint in our lives. Listen, you have the flesh and I have the flesh. Our"
    },
    {
      "id": 42,
      "start": 1427.8600463867188,
      "end": 1432.9000396728516,
      "text": " flesh was not eradicated at the moment of salvation. That's not what happened. We're"
    },
    {
      "id": 43,
      "start": 1432.9000396728516,
      "end": 1437.1400451660156,
      "text": " to crucify the flesh. We're to mortify our members. That's what the New Testament tells"
    },
    {
      "id": 44,
      "start": 1437.1400451660156,
      "end": 1446.6600341796875,
      "text": " us, and we're to die daily. That's what Paul says, I die daily. I am crucified with Christ."
    },
    {
      "id": 45,
      "start": 1446.6600341796875,
      "end": 1453.7000427246094,
      "text": " Our flesh wants to get even. Our flesh wants to react to those times of adversity, and"
    },
    {
      "id": 46,
      "start": 1453.7000427246094,
      "end": 1462.300048828125,
      "text": " I'm going to recognize God's providence, and I'm going to have to exercise restraint. I"
    },
    {
      "id": 47,
      "start": 1462.300048828125,
      "end": 1468.0600280761719,
      "text": " believe this evening that when I avoid taking matters into my own hands, it reveals a measure"
    },
    {
      "id": 48,
      "start": 1468.0600280761719,
      "end": 1474.5000305175781,
      "text": " of spiritual maturity. It reveals spiritual maturity when someone could do us wrong, could"
    },
    {
      "id": 49,
      "start": 1474.5000305175781,
      "end": 1483.7000427246094,
      "text": " do us harm, and we can trust God, rely upon Him, not take those things into our own hands"
    },
    {
      "id": 50,
      "start": 1483.7000427246094,
      "end": 1489.300048828125,
      "text": " and not react to the circumstances and the situations, and it reveals a measure of maturity"
    },
    {
      "id": 51,
      "start": 1489.300048828125,
      "end": 1496.5800476074219,
      "text": " that we understand who God is and that God is in control."
    },
    {
      "id": 52,
      "start": 1496.5800476074219,
      "end": 1500.5800476074219,
      "text": " I want you to look at the life of David, and I know we use this passage in Romans, but"
    },
    {
      "id": 53,
      "start": 1500.5800476074219,
      "end": 1504.9800415039062,
      "text": " I want you to go to the book of 1 Samuel, if you will, and we won't have time to develop"
    },
    {
      "id": 54,
      "start": 1504.9800415039062,
      "end": 1509.7000427246094,
      "text": " everything that's taking place in the life of David. We're going to pick it up in 1 Samuel"
    },
    {
      "id": 55,
      "start": 1509.7000427246094,
      "end": 1518.6600341796875,
      "text": " chapter 24. Just begin to think about the life of David briefly before we get to chapter"
    },
    {
      "id": 56,
      "start": 1518.6600341796875,
      "end": 1523.0200500488281,
      "text": " 24, and without looking at all of the chapters and verses, I want you to think about David"
    },
    {
      "id": 57,
      "start": 1523.0200500488281,
      "end": 1528.0600280761719,
      "text": " and his life. I want you to think about where he was in 1 Samuel chapter number 16 when"
    },
    {
      "id": 58,
      "start": 1528.0600280761719,
      "end": 1533.7000427246094,
      "text": " he's out tending to the sheep. I mean, he's doing what his father had instructed him to"
    },
    {
      "id": 59,
      "start": 1533.7000427246094,
      "end": 1539.4200439453125,
      "text": " do. He was being obedient, he was being submissive, he was being responsible to take care of that"
    },
    {
      "id": 60,
      "start": 1539.4200439453125,
      "end": 1550.9400329589844,
      "text": " flock. The man of God, Samuel, comes to anoint the next king, and David's not even invited."
    },
    {
      "id": 61,
      "start": 1550.9400329589844,
      "end": 1557.300048828125,
      "text": " Surely this is the one, is what Samuel says, and God says no. One by one, the sons of Jesse"
    },
    {
      "id": 62,
      "start": 1557.300048828125,
      "end": 1564.9000244140625,
      "text": " pass by, no, no, no. Are there any others? Well, the youngest, he's out taking care of"
    },
    {
      "id": 63,
      "start": 1564.9000244140625,
      "end": 1575.2600402832031,
      "text": " the sheep. Bring him here. We're not going to sit until he comes. God says, it's him."
    },
    {
      "id": 64,
      "start": 1575.2600402832031,
      "end": 1580.0600280761719,
      "text": " David is anointed to be king of Israel in 1 Samuel chapter 16. He didn't apply for the"
    },
    {
      "id": 65,
      "start": 1580.0600280761719,
      "end": 1590.2600402832031,
      "text": " job. You understand? God chose him to be the king of Israel. And in chapter number 16,"
    },
    {
      "id": 66,
      "start": 1590.2600402832031,
      "end": 1594.1800537109375,
      "text": " at the end of the passage, he's then again taking care of the sheep, and he's brought"
    },
    {
      "id": 67,
      "start": 1594.1800537109375,
      "end": 1599.3800354003906,
      "text": " in to minister to Saul, because there was an evil spirit that came. And we find that"
    },
    {
      "id": 68,
      "start": 1599.3800354003906,
      "end": 1603.9800415039062,
      "text": " he's brought to minister before Saul, and then he's back taking care of the sheep. And"
    },
    {
      "id": 69,
      "start": 1603.9800415039062,
      "end": 1609.1000366210938,
      "text": " in chapter number 17, we read about Goliath and all that takes place, and how the Philistines"
    },
    {
      "id": 70,
      "start": 1609.1000366210938,
      "end": 1613.2600402832031,
      "text": " are fighting against the nation of Israel, and all of the men of Israel, including Saul"
    },
    {
      "id": 71,
      "start": 1613.2600402832031,
      "end": 1618.1800537109375,
      "text": " the king that was head and shoulders above all the others, they're fearful, they're afraid,"
    },
    {
      "id": 72,
      "start": 1618.1800537109375,
      "end": 1623.8600463867188,
      "text": " they're hiding, and David comes. Again, he's just doing what his father instructed him"
    },
    {
      "id": 73,
      "start": 1623.8600463867188,
      "end": 1632.8600463867188,
      "text": " to do. Go and take these goods to your brothers. And he hears Goliath, and he says, is there"
    },
    {
      "id": 74,
      "start": 1632.8600463867188,
      "end": 1640.7400512695312,
      "text": " not a cause? He says, I'll go and fight against this uncircumcised Philistine. He wasn't looking"
    },
    {
      "id": 75,
      "start": 1640.7400512695312,
      "end": 1645.7400512695312,
      "text": " for any kind of recognition. He wasn't looking to be popular or promoted. He wasn't looking"
    },
    {
      "id": 76,
      "start": 1645.7400512695312,
      "end": 1653.300048828125,
      "text": " for the ladies of the land to say David has slain. No, he wasn't looking for any of that."
    },
    {
      "id": 77,
      "start": 1653.300048828125,
      "end": 1658.5000305175781,
      "text": " He wanted everyone to know that there's a God in heaven. He continues to minister before"
    },
    {
      "id": 78,
      "start": 1658.5000305175781,
      "end": 1664.6600341796875,
      "text": " Saul, and Saul tries to kill him. Throw a javelin at him. Saul said, here's what I'm"
    },
    {
      "id": 79,
      "start": 1664.6600341796875,
      "end": 1669.4200439453125,
      "text": " going to do. I can't kill him myself, so I'm going to offer my daughter to be his wife."
    },
    {
      "id": 80,
      "start": 1669.4200439453125,
      "end": 1673.1400451660156,
      "text": " By the way, he thought he'd offer the daughter that he did because it'd be a reproach to"
    },
    {
      "id": 81,
      "start": 1673.1400451660156,
      "end": 1681.2600402832031,
      "text": " him, and it'd be a bad situation, make his life miserable. He said, give me 100 foreskins"
    },
    {
      "id": 82,
      "start": 1681.2600402832031,
      "end": 1687.5000305175781,
      "text": " of the Philistines as dowry. What was he saying? I'll let the Philistines kill him. David brings"
    },
    {
      "id": 83,
      "start": 1687.5000305175781,
      "end": 1695.4600524902344,
      "text": " back 200, victorious. Everywhere he went, the Bible says that he behaved himself wisely."
    },
    {
      "id": 84,
      "start": 1695.5000305175781,
      "end": 1705.5000305175781,
      "text": " God was with him. Saul continued to try to kill David. Saul was hunting him. And David"
    },
    {
      "id": 85,
      "start": 1705.5000305175781,
      "end": 1710.8600463867188,
      "text": " was a man that he testifies that there's but a step between him and death. And he understood"
    },
    {
      "id": 86,
      "start": 1710.8600463867188,
      "end": 1715.9400634765625,
      "text": " what was taking place, and we come to 1 Samuel chapter 24, and several other things have"
    },
    {
      "id": 87,
      "start": 1715.9400634765625,
      "end": 1720.3400268554688,
      "text": " transpired, but I want you to see in chapter 24 and verse number 4, the Bible says that"
    },
    {
      "id": 88,
      "start": 1720.3400268554688,
      "end": 1724.7400512695312,
      "text": " the men of David said unto him, behold the day of which the Lord said unto thee, they're"
    },
    {
      "id": 89,
      "start": 1724.7400512695312,
      "end": 1729.5800170898438,
      "text": " now in the cave there, and Saul's there. He had taken these 3,000 chosen men, according"
    },
    {
      "id": 90,
      "start": 1729.5800170898438,
      "end": 1734.2200317382812,
      "text": " to verse number 2, to seek David. Obviously, he wants to kill David. And the Bible says"
    },
    {
      "id": 91,
      "start": 1734.2200317382812,
      "end": 1738.820068359375,
      "text": " that the men of David, now remember there were 400 men that went with him. That continues"
    },
    {
      "id": 92,
      "start": 1738.820068359375,
      "end": 1744.3800659179688,
      "text": " to grow to 600 and et cetera. And we find that the Bible says that they say, behold"
    },
    {
      "id": 93,
      "start": 1744.3800659179688,
      "end": 1748.1400146484375,
      "text": " the day of which the Lord said unto thee, behold, I will deliver thine enemy into thine"
    },
    {
      "id": 94,
      "start": 1748.1400146484375,
      "end": 1752.6200561523438,
      "text": " hand that thou mayest do to him as it shall seem good unto thee. Then David arose and"
    },
    {
      "id": 95,
      "start": 1752.6200561523438,
      "end": 1758.2200317382812,
      "text": " cut off the skirt of Saul's robe privily. And it came to pass afterward that David's"
    },
    {
      "id": 96,
      "start": 1758.2200317382812,
      "end": 1764.02001953125,
      "text": " heart smote him because he had cut off Saul's skirt. And he said unto his men, the Lord"
    },
    {
      "id": 97,
      "start": 1764.02001953125,
      "end": 1769.1400146484375,
      "text": " forbid that I should do this thing unto my master, the Lord's anointed. Notice what he"
    },
    {
      "id": 98,
      "start": 1769.1400146484375,
      "end": 1775.260009765625,
      "text": " says, to stretch forth mine hand against him, seeing he is the anointed of the Lord. So"
    },
    {
      "id": 99,
      "start": 1775.260009765625,
      "end": 1780.4600219726562,
      "text": " David stayed his servants with these words and suffered them not to rise against Saul."
    },
    {
      "id": 100,
      "start": 1780.4600219726562,
      "end": 1784.8600463867188,
      "text": " But Saul rose up out of the cave and went on his way. David also arose afterward and"
    },
    {
      "id": 101,
      "start": 1784.8600463867188,
      "end": 1789.9800415039062,
      "text": " went out of the cave and cried after Saul, saying, My Lord, the king. When Saul looked"
    },
    {
      "id": 102,
      "start": 1789.9800415039062,
      "end": 1794.9000244140625,
      "text": " behind him, David stooped with his face to the earth and bowed himself. And verse 9 says"
    },
    {
      "id": 103,
      "start": 1794.9000244140625,
      "end": 1799.1000366210938,
      "text": " that David said to Saul, Wherefore hearest thou men's words, saying, Behold, David seeketh"
    },
    {
      "id": 104,
      "start": 1799.1000366210938,
      "end": 1800.02001953125,
      "text": " thy hurt."
    },
    {
      "id": 0,
      "start": 1800.02001953125,
      "end": 1807.5000195503235,
      "text": " Behold, this day thine eyes have seen how the Lord hath delivered thee today into mine"
    },
    {
      "id": 1,
      "start": 1807.5000195503235,
      "end": 1808.980019569397,
      "text": " hand in the cave.\""
    },
    {
      "id": 2,
      "start": 1808.980019569397,
      "end": 1815.100019454956,
      "text": " Notice what he says, and some bade me kill thee."
    },
    {
      "id": 3,
      "start": 1815.100019454956,
      "end": 1818.6200199127197,
      "text": " Sometimes people are going to tell you to take matters into your own hands."
    },
    {
      "id": 4,
      "start": 1818.6200199127197,
      "end": 1819.6200199127197,
      "text": " You know what they did to you?"
    },
    {
      "id": 5,
      "start": 1819.6200199127197,
      "end": 1821.3800201416016,
      "text": " Did you hear what they said to you?"
    },
    {
      "id": 6,
      "start": 1821.3800201416016,
      "end": 1828.3400192260742,
      "text": " People are going to provoke you, try to encourage you to take matters into your own hands."
    },
    {
      "id": 7,
      "start": 1828.3400192260742,
      "end": 1830.7000198364258,
      "text": " You're going to let them get away with that?"
    },
    {
      "id": 8,
      "start": 1830.7000198364258,
      "end": 1832.7400207519531,
      "text": " You're going to let them talk to you that way?"
    },
    {
      "id": 9,
      "start": 1832.7400207519531,
      "end": 1833.7400207519531,
      "text": " You understand?"
    },
    {
      "id": 10,
      "start": 1833.7400207519531,
      "end": 1838.3000183105469,
      "text": " This is the world we live in."
    },
    {
      "id": 11,
      "start": 1838.3000183105469,
      "end": 1841.960018157959,
      "text": " David said, some of them said to kill you."
    },
    {
      "id": 12,
      "start": 1841.960018157959,
      "end": 1850.1000213623047,
      "text": " But mine eyes spared thee, and I said, I will not put forth mine hand against my Lord, for"
    },
    {
      "id": 13,
      "start": 1850.1000213623047,
      "end": 1853.9800186157227,
      "text": " he is the Lord's anointed."
    },
    {
      "id": 14,
      "start": 1853.9800186157227,
      "end": 1856.3400192260742,
      "text": " Wow."
    },
    {
      "id": 15,
      "start": 1856.3400192260742,
      "end": 1859.1400184631348,
      "text": " David had to understand something about the providence of God."
    },
    {
      "id": 16,
      "start": 1859.1400184631348,
      "end": 1862.7200202941895,
      "text": " He had to demonstrate, exercise a measure of restraint."
    },
    {
      "id": 17,
      "start": 1862.7200202941895,
      "end": 1868.7800216674805,
      "text": " We find that in chapter 26, notice with me again, there's a situation that takes place."
    },
    {
      "id": 18,
      "start": 1868.7800216674805,
      "end": 1872.8200225830078,
      "text": " And the Bible tells us that David now is in the wilderness of Ziph, and it says that the"
    },
    {
      "id": 19,
      "start": 1872.8200225830078,
      "end": 1877.2600173950195,
      "text": " Ziphites came unto Saul in verse number 1 to Gibeah, saying, Doth not David hide himself"
    },
    {
      "id": 20,
      "start": 1877.2600173950195,
      "end": 1881.3800201416016,
      "text": " in the hill of Hacaliah, which is before Jeshimon?"
    },
    {
      "id": 21,
      "start": 1881.3800201416016,
      "end": 1885.6600189208984,
      "text": " Then Saul arose and went down to the wilderness of Ziph, having 3,000 chosen men of Israel"
    },
    {
      "id": 22,
      "start": 1885.9800186157227,
      "end": 1890.5000228881836,
      "text": " with him to seek David in the wilderness of Ziph."
    },
    {
      "id": 23,
      "start": 1890.5000228881836,
      "end": 1894.9400177001953,
      "text": " Notice in verse number 3, it says that Saul pitched in the hill of Hacaliah, which is"
    },
    {
      "id": 24,
      "start": 1894.9400177001953,
      "end": 1896.8200225830078,
      "text": " before Jeshimon, by the way."
    },
    {
      "id": 25,
      "start": 1896.8200225830078,
      "end": 1902.9400177001953,
      "text": " But David abode in the wilderness, and he saw that Saul came after him into the wilderness."
    },
    {
      "id": 26,
      "start": 1902.9400177001953,
      "end": 1906.5000228881836,
      "text": " And so we see the setting, look down, if you will, to verse number 7."
    },
    {
      "id": 27,
      "start": 1906.5000228881836,
      "end": 1910.3800201416016,
      "text": " The Bible says, So David and Abishai came to the people by night, and behold, Saul lay"
    },
    {
      "id": 28,
      "start": 1910.3800201416016,
      "end": 1915.5000228881836,
      "text": " sleeping within the trench, and his spear stuck in the ground at his bolster."
    },
    {
      "id": 29,
      "start": 1915.5000228881836,
      "end": 1920.7800216674805,
      "text": " But Abner and the people lay around about him."
    },
    {
      "id": 30,
      "start": 1920.7800216674805,
      "end": 1926.5400161743164,
      "text": " Then said Abishai to David, notice what Abishai says, God hath delivered thine enemy into"
    },
    {
      "id": 31,
      "start": 1926.5400161743164,
      "end": 1928.7000122070312,
      "text": " thine hand this day."
    },
    {
      "id": 32,
      "start": 1928.7000122070312,
      "end": 1932.780014038086,
      "text": " Now therefore, let me smite him."
    },
    {
      "id": 33,
      "start": 1932.780014038086,
      "end": 1939.500015258789,
      "text": " I pray thee with the spear even to the earth at once, and I will not smite him the second"
    },
    {
      "id": 34,
      "start": 1939.6200256347656,
      "end": 1940.8600158691406,
      "text": " time."
    },
    {
      "id": 35,
      "start": 1940.8600158691406,
      "end": 1944.500015258789,
      "text": " Sometimes we say, man, I need an Abishai in my life, because he says, I'll go ahead and"
    },
    {
      "id": 36,
      "start": 1944.500015258789,
      "end": 1945.500015258789,
      "text": " take care of it, David."
    },
    {
      "id": 37,
      "start": 1945.500015258789,
      "end": 1947.3400268554688,
      "text": " You don't want to raise up your hand against him?"
    },
    {
      "id": 38,
      "start": 1947.3400268554688,
      "end": 1948.3400268554688,
      "text": " Let me do it."
    },
    {
      "id": 39,
      "start": 1948.3400268554688,
      "end": 1949.3400268554688,
      "text": " I'll just smite him once."
    },
    {
      "id": 40,
      "start": 1949.3400268554688,
      "end": 1950.3400268554688,
      "text": " I won't do it a second time."
    },
    {
      "id": 41,
      "start": 1950.3400268554688,
      "end": 1953.1000213623047,
      "text": " That's what Abishai says."
    },
    {
      "id": 42,
      "start": 1953.1000213623047,
      "end": 1960.6200256347656,
      "text": " But notice in verse number 9, David said to Abishai, destroy him not."
    },
    {
      "id": 43,
      "start": 1960.6200256347656,
      "end": 1966.6600189208984,
      "text": " For who can stretch forth his hand against the Lord's anointed and be guiltless?"
    },
    {
      "id": 44,
      "start": 1966.6600189208984,
      "end": 1973.4200134277344,
      "text": " David said furthermore, as the Lord liveth, you believe that God's alive?"
    },
    {
      "id": 45,
      "start": 1973.4200134277344,
      "end": 1975.4200134277344,
      "text": " He believes in control?"
    },
    {
      "id": 46,
      "start": 1975.4200134277344,
      "end": 1977.6400146484375,
      "text": " You believe he knows what's going on?"
    },
    {
      "id": 47,
      "start": 1977.6400146484375,
      "end": 1983.8600158691406,
      "text": " He said, as the Lord liveth, the Lord shall smite him."
    },
    {
      "id": 48,
      "start": 1983.8600158691406,
      "end": 1991.500015258789,
      "text": " Or his day shall come to die, or he shall descend into battle and perish."
    },
    {
      "id": 49,
      "start": 1991.500015258789,
      "end": 1997.0600128173828,
      "text": " The Lord forbid that I should stretch forth mine hand against the Lord's anointed, but"
    },
    {
      "id": 50,
      "start": 1997.0600128173828,
      "end": 2002.1000213623047,
      "text": " I pray thee, take thou now the spear that is in his bolster and the crews of water,"
    },
    {
      "id": 51,
      "start": 2002.1000213623047,
      "end": 2003.6600189208984,
      "text": " and let us go."
    },
    {
      "id": 52,
      "start": 2003.6600189208984,
      "end": 2008.9000244140625,
      "text": " So David took the spear and the crews of water from Saul's bolster, and they got them away."
    },
    {
      "id": 53,
      "start": 2008.9000244140625,
      "end": 2011.8600158691406,
      "text": " No man saw it, nor knew it, neither awaked."
    },
    {
      "id": 54,
      "start": 2011.8600158691406,
      "end": 2018.500015258789,
      "text": " For they were all asleep, because a deep sleep from the Lord was fallen upon them."
    },
    {
      "id": 55,
      "start": 2018.500015258789,
      "end": 2021.9000244140625,
      "text": " David said, I'm not going to lift my hand against the Lord's anointed, but Abishai,"
    },
    {
      "id": 56,
      "start": 2021.9000244140625,
      "end": 2024.540023803711,
      "text": " I'm not going to allow you to either."
    },
    {
      "id": 57,
      "start": 2024.540023803711,
      "end": 2025.540023803711,
      "text": " He forbid him."
    },
    {
      "id": 58,
      "start": 2025.540023803711,
      "end": 2027.6600189208984,
      "text": " He forbade him."
    },
    {
      "id": 59,
      "start": 2027.6600189208984,
      "end": 2035.02001953125,
      "text": " The Bible says that David had this understanding that the Lord who lives will deal with Saul."
    },
    {
      "id": 60,
      "start": 2035.02001953125,
      "end": 2038.4000244140625,
      "text": " By the way, God was able to deal with Saul, was he not?"
    },
    {
      "id": 61,
      "start": 2038.4000244140625,
      "end": 2042.9800262451172,
      "text": " And Saul did go into battle and did not return from battle."
    },
    {
      "id": 62,
      "start": 2042.9800262451172,
      "end": 2046.3400268554688,
      "text": " We find that God took care of Saul."
    },
    {
      "id": 63,
      "start": 2046.3400268554688,
      "end": 2054.1400146484375,
      "text": " Interference between these two events in the life of David is 1 Samuel chapter 25."
    },
    {
      "id": 64,
      "start": 2054.1400146484375,
      "end": 2063.3800048828125,
      "text": " And in 1 Samuel 25, I believe that God records for us a significant interaction between David"
    },
    {
      "id": 65,
      "start": 2063.3800048828125,
      "end": 2070.500030517578,
      "text": " and Abigail that helps us with understanding this whole process of not taking matters into"
    },
    {
      "id": 66,
      "start": 2070.500030517578,
      "end": 2072.3800048828125,
      "text": " our own hands."
    },
    {
      "id": 67,
      "start": 2072.3800048828125,
      "end": 2075.7000122070312,
      "text": " In Genesis chapter 34, there was a wrong that was committed."
    },
    {
      "id": 68,
      "start": 2076.060028076172,
      "end": 2078.6600341796875,
      "text": " There was evil that took place against Dinah."
    },
    {
      "id": 69,
      "start": 2078.6600341796875,
      "end": 2085.5800170898438,
      "text": " Jacob's sons, the brothers of Dinah, they were grieved and they were full of wrath and"
    },
    {
      "id": 70,
      "start": 2085.5800170898438,
      "end": 2087.540008544922,
      "text": " they were angry over what had taken place."
    },
    {
      "id": 71,
      "start": 2087.540008544922,
      "end": 2092.260009765625,
      "text": " They were right in their assessment that this thing ought not to be done."
    },
    {
      "id": 72,
      "start": 2092.260009765625,
      "end": 2098.9400329589844,
      "text": " But they took matters into their own hands and they made a mess of the situation."
    },
    {
      "id": 73,
      "start": 2098.9400329589844,
      "end": 2106.02001953125,
      "text": " We find that David, in 1 Samuel 24, God gives an opportunity when Saul enters into the cave"
    },
    {
      "id": 74,
      "start": 2106.02001953125,
      "end": 2108.4200134277344,
      "text": " and David says, no, I'm going to resist that."
    },
    {
      "id": 75,
      "start": 2108.4200134277344,
      "end": 2109.8200073242188,
      "text": " I'm going to trust the Lord."
    },
    {
      "id": 76,
      "start": 2109.8200073242188,
      "end": 2114.3400268554688,
      "text": " In 1 Samuel chapter 26, God gives another opportunity and Abishai says, let me just"
    },
    {
      "id": 77,
      "start": 2114.3400268554688,
      "end": 2117.060028076172,
      "text": " smite him once."
    },
    {
      "id": 78,
      "start": 2117.060028076172,
      "end": 2118.760009765625,
      "text": " David says, no, I'm going to trust the Lord."
    },
    {
      "id": 79,
      "start": 2118.760009765625,
      "end": 2123.740020751953,
      "text": " But in 1 Samuel 25, there's a different event that takes place that's not with Saul."
    },
    {
      "id": 80,
      "start": 2123.740020751953,
      "end": 2127.6600341796875,
      "text": " See, Saul was the Lord's anointed."
    },
    {
      "id": 81,
      "start": 2127.6600341796875,
      "end": 2131.780029296875,
      "text": " David had a certain perspective about not raising his hand against the Lord's anointed."
    },
    {
      "id": 82,
      "start": 2131.780029296875,
      "end": 2135.7200317382812,
      "text": " Saul was in the place where God had him at that particular time."
    },
    {
      "id": 83,
      "start": 2135.7200317382812,
      "end": 2141.300018310547,
      "text": " But when you look at 1 Samuel chapter number 25, the Bible records for us an interaction"
    },
    {
      "id": 84,
      "start": 2141.300018310547,
      "end": 2146.1000061035156,
      "text": " between David and Abigail with regard to Nabal and his men."
    },
    {
      "id": 85,
      "start": 2146.1000061035156,
      "end": 2151.1800231933594,
      "text": " Now Nabal was a fool, says it right in the passage of Scripture."
    },
    {
      "id": 86,
      "start": 2151.1800231933594,
      "end": 2157.260009765625,
      "text": " David and his men helped Nabal and did all sorts of things and it was time to be paid."
    },
    {
      "id": 87,
      "start": 2157.260009765625,
      "end": 2159.260009765625,
      "text": " And Nabal says, who's David?"
    },
    {
      "id": 88,
      "start": 2159.260009765625,
      "end": 2161.4600219726562,
      "text": " I mean, anyone can say they're anyone these days."
    },
    {
      "id": 89,
      "start": 2161.4600219726562,
      "end": 2167.980010986328,
      "text": " And David says, the men come back and David says, all right boys, saddle up."
    },
    {
      "id": 90,
      "start": 2167.980010986328,
      "end": 2168.980010986328,
      "text": " We're going to go kill them all."
    },
    {
      "id": 91,
      "start": 2168.980010986328,
      "end": 2169.980010986328,
      "text": " That's what he says."
    },
    {
      "id": 92,
      "start": 2169.980010986328,
      "end": 2173.780029296875,
      "text": " That's what he says."
    },
    {
      "id": 93,
      "start": 2173.780029296875,
      "end": 2179.980010986328,
      "text": " Notice David says in verse number 21 of 1 Samuel 25."
    },
    {
      "id": 94,
      "start": 2179.980010986328,
      "end": 2186.3400268554688,
      "text": " Now David had said, surely in vain have I kept all this fellow hath in the wilderness"
    },
    {
      "id": 95,
      "start": 2186.3400268554688,
      "end": 2191.3400268554688,
      "text": " so that nothing was missed of all that pertained unto him."
    },
    {
      "id": 96,
      "start": 2191.3400268554688,
      "end": 2198.9000244140625,
      "text": " And he hath requited me evil for good."
    },
    {
      "id": 97,
      "start": 2198.9000244140625,
      "end": 2202.3800048828125,
      "text": " Or do something good and somebody pays you back with evil."
    },
    {
      "id": 98,
      "start": 2203.1000061035156,
      "end": 2205.500030517578,
      "text": " David says, this is what happens."
    },
    {
      "id": 99,
      "start": 2205.500030517578,
      "end": 2209.4600219726562,
      "text": " He says in verse 22, so and more also do God unto the enemies of David."
    },
    {
      "id": 100,
      "start": 2209.4600219726562,
      "end": 2213.1800231933594,
      "text": " If I leave of all that pertain to him by the morning light."
    },
    {
      "id": 101,
      "start": 2213.1800231933594,
      "end": 2215.5800170898438,
      "text": " He's going to go kill them all."
    },
    {
      "id": 102,
      "start": 2215.5800170898438,
      "end": 2220.1000061035156,
      "text": " By the way, David was a mighty, mighty warrior."
    },
    {
      "id": 103,
      "start": 2220.1000061035156,
      "end": 2221.780029296875,
      "text": " David says, let's go boys."
    },
    {
      "id": 104,
      "start": 2221.780029296875,
      "end": 2224.8600158691406,
      "text": " I think Abishai was excited, don't you?"
    },
    {
      "id": 105,
      "start": 2224.8600158691406,
      "end": 2226.8600158691406,
      "text": " He was ready to kill Saul in just another chapter."
    },
    {
      "id": 106,
      "start": 2226.8600158691406,
      "end": 2230.540008544922,
      "text": " Abishai's like, let's go."
    },
    {
      "id": 107,
      "start": 2230.540008544922,
      "end": 2233.1800231933594,
      "text": " He's going to go."
    },
    {
      "id": 108,
      "start": 2233.1800231933594,
      "end": 2238.1000061035156,
      "text": " But God allows Abigail to come."
    },
    {
      "id": 109,
      "start": 2238.1000061035156,
      "end": 2241.780029296875,
      "text": " And the Bible tells us, look, pick it up with me in verse 26."
    },
    {
      "id": 110,
      "start": 2241.780029296875,
      "end": 2247.300018310547,
      "text": " Now therefore, my Lord, as the Lord liveth."
    },
    {
      "id": 111,
      "start": 2247.300018310547,
      "end": 2251.1400146484375,
      "text": " Is that not what he says in chapter 26?"
    },
    {
      "id": 112,
      "start": 2251.1400146484375,
      "end": 2256.260009765625,
      "text": " As the Lord liveth and as thy soul liveth, seeing the Lord hath withholden thee from"
    },
    {
      "id": 113,
      "start": 2256.260009765625,
      "end": 2258.540008544922,
      "text": " coming to shed blood."
    },
    {
      "id": 114,
      "start": 2258.540008544922,
      "end": 2264.3800048828125,
      "text": " Notice this phrase and from avenging thyself with thine own hand."
    },
    {
      "id": 115,
      "start": 2264.3800048828125,
      "end": 2269.260009765625,
      "text": " Now let thine enemies and they that seek evil to my Lord be as Nabal."
    },
    {
      "id": 116,
      "start": 2269.260009765625,
      "end": 2273.3400268554688,
      "text": " And now this blessing, which thine handmaid hath brought unto my Lord, let it even be"
    },
    {
      "id": 117,
      "start": 2273.3400268554688,
      "end": 2277.2200317382812,
      "text": " given unto the young men that follow my Lord."
    },
    {
      "id": 118,
      "start": 2277.2200317382812,
      "end": 2281.4200134277344,
      "text": " Verse number 28, I pray thee, forgive the trespass of thine handmaid for the Lord will"
    },
    {
      "id": 119,
      "start": 2281.4200134277344,
      "end": 2287.8200073242188,
      "text": " certainly make my Lord a sure house because my Lord fighteth the battles of the Lord and"
    },
    {
      "id": 120,
      "start": 2287.8200073242188,
      "end": 2291.5800170898438,
      "text": " evil hath not been found in thee all thy days."
    },
    {
      "id": 121,
      "start": 2291.5800170898438,
      "end": 2296.3400268554688,
      "text": " Yet a man is risen to pursue thee and to seek thy soul, but the soul of my Lord shall"
    },
    {
      "id": 122,
      "start": 2296.3400268554688,
      "end": 2299.5800170898438,
      "text": " be bound in the bundle of life with the Lord thy God."
    },
    {
      "id": 123,
      "start": 2299.5800170898438,
      "end": 2305.300018310547,
      "text": " The souls of thine enemies, them shall he sling out of the middle of a sling."
    },
    {
      "id": 124,
      "start": 2305.300018310547,
      "end": 2311.1000061035156,
      "text": " Notice verse 30, and it shall come to pass when the Lord shall have done to my Lord according"
    },
    {
      "id": 125,
      "start": 2311.1000061035156,
      "end": 2317.2200317382812,
      "text": " to all the good that he had spoken concerning thee and shall have appointed thee ruler over"
    },
    {
      "id": 126,
      "start": 2317.2200317382812,
      "end": 2318.2200317382812,
      "text": " Israel."
    },
    {
      "id": 127,
      "start": 2318.2200317382812,
      "end": 2320.6199951171875,
      "text": " Abigail knew the plan that God had for David."
    },
    {
      "id": 128,
      "start": 2320.6199951171875,
      "end": 2325.1000366210938,
      "text": " Abigail was aware that he was going to become the king of Israel."
    },
    {
      "id": 129,
      "start": 2325.1000366210938,
      "end": 2332.1000366210938,
      "text": " And she says that when that comes to pass, notice in verse 31, that this, what is she"
    },
    {
      "id": 130,
      "start": 2332.1000366210938,
      "end": 2333.1000366210938,
      "text": " referring to?"
    },
    {
      "id": 131,
      "start": 2333.1000366210938,
      "end": 2338.1000366210938,
      "text": " That you're going to kill all of the men, that this event, taking matters, avenging"
    },
    {
      "id": 132,
      "start": 2338.1000366210938,
      "end": 2344.4600219726562,
      "text": " thyself with thine own hand, according to verse 26, she says that this shall be no grief"
    },
    {
      "id": 133,
      "start": 2344.4600219726562,
      "end": 2350.4600219726562,
      "text": " unto thee, nor offense of heart unto my Lord, either that thou hast shed blood causeless,"
    },
    {
      "id": 134,
      "start": 2350.4600219726562,
      "end": 2353.0400390625,
      "text": " or that my Lord hath avenged himself."
    },
    {
      "id": 135,
      "start": 2353.0400390625,
      "end": 2363.1199951171875,
      "text": " But when the Lord shall have dealt well with my Lord, then remember thine handmaid."
    },
    {
      "id": 136,
      "start": 2363.1199951171875,
      "end": 2366.8200073242188,
      "text": " Notice how David responds in verse 32."
    },
    {
      "id": 137,
      "start": 2366.8200073242188,
      "end": 2374.6600341796875,
      "text": " David said to Abigail, blessed be the Lord God of Israel, which sent thee this day to"
    },
    {
      "id": 138,
      "start": 2374.6600341796875,
      "end": 2376.2200317382812,
      "text": " meet me."
    },
    {
      "id": 139,
      "start": 2376.2200317382812,
      "end": 2377.4400024414062,
      "text": " Why?"
    },
    {
      "id": 140,
      "start": 2377.4400024414062,
      "end": 2382.9000244140625,
      "text": " Because David was about to take matters into his own hands."
    },
    {
      "id": 141,
      "start": 2382.9000244140625,
      "end": 2391.1799926757812,
      "text": " Sometimes God might send an Abigail in your life and in my life at just the right time,"
    },
    {
      "id": 142,
      "start": 2391.1799926757812,
      "end": 2393.1000366210938,
      "text": " because we're about to take matters into our own hands."
    },
    {
      "id": 143,
      "start": 2393.1000366210938,
      "end": 2396.6199951171875,
      "text": " We're about to make a mess of things."
    },
    {
      "id": 144,
      "start": 2396.6199951171875,
      "end": 2399.0599975585938,
      "text": " God sends an Abigail."
    },
    {
      "id": 145,
      "start": 2399.0599975585938,
      "end": 2399.8200073242188,
      "text": " David says."
    },
    {
      "id": 0,
      "start": 2399.8200073242188,
      "end": 2404.2400074005127,
      "text": " Blessed be the Lord God of Israel, which sent thee this day to meet me."
    },
    {
      "id": 1,
      "start": 2404.2400074005127,
      "end": 2406.940007209778,
      "text": " He recognizes God's providence, does he not?"
    },
    {
      "id": 2,
      "start": 2406.940007209778,
      "end": 2409.2800073623657,
      "text": " That God sent her to meet him."
    },
    {
      "id": 3,
      "start": 2409.2800073623657,
      "end": 2410.8200073242188,
      "text": " Notice in verse 33, he says,"
    },
    {
      "id": 4,
      "start": 2410.8200073242188,
      "end": 2414.440007209778,
      "text": " And blessed be thy advice, and blessed be thou,"
    },
    {
      "id": 5,
      "start": 2414.440007209778,
      "end": 2418.2800064086914,
      "text": " which hast kept me this day from coming to shed blood,"
    },
    {
      "id": 6,
      "start": 2418.2800064086914,
      "end": 2423.400007247925,
      "text": " and from avenging myself with mine own hand."
    },
    {
      "id": 7,
      "start": 2423.400007247925,
      "end": 2426.1200065612793,
      "text": " For in very deed, as the Lord God of Israel liveth,"
    },
    {
      "id": 8,
      "start": 2426.1200065612793,
      "end": 2428.2400074005127,
      "text": " which hath kept me back from hurting thee,"
    },
    {
      "id": 9,
      "start": 2428.480007171631,
      "end": 2431.860008239746,
      "text": " except thou hast hasted and come to meet me,"
    },
    {
      "id": 10,
      "start": 2431.860008239746,
      "end": 2434.980007171631,
      "text": " surely there had not been left unto Nabal"
    },
    {
      "id": 11,
      "start": 2434.980007171631,
      "end": 2437.9400062561035,
      "text": " by the morning light any that pisseth against the wall."
    },
    {
      "id": 12,
      "start": 2437.9400062561035,
      "end": 2440.1600074768066,
      "text": " He says, I was gonna kill all of them."
    },
    {
      "id": 13,
      "start": 2441.7800064086914,
      "end": 2442.980007171631,
      "text": " That's what he's gonna do."
    },
    {
      "id": 14,
      "start": 2444.520008087158,
      "end": 2446.6600074768066,
      "text": " It says in verse number 35,"
    },
    {
      "id": 15,
      "start": 2446.6600074768066,
      "end": 2451.0600090026855,
      "text": " So David received of her hand that which she had brought him"
    },
    {
      "id": 16,
      "start": 2451.0600090026855,
      "end": 2453.580005645752,
      "text": " and said unto her, go up in peace to thine house."
    },
    {
      "id": 17,
      "start": 2453.580005645752,
      "end": 2455.700008392334,
      "text": " See, I have hearkened to thy voice"
    },
    {
      "id": 18,
      "start": 2455.700008392334,
      "end": 2458.3200073242188,
      "text": " and have accepted thy person."
    },
    {
      "id": 19,
      "start": 2460.4400062561035,
      "end": 2462.3200073242188,
      "text": " Nabal still hasn't been dealt with,"
    },
    {
      "id": 20,
      "start": 2464.080009460449,
      "end": 2465.580009460449,
      "text": " but God's gonna deal with him."
    },
    {
      "id": 21,
      "start": 2467.080009460449,
      "end": 2469.480010986328,
      "text": " And God's gonna deal with him in such a way"
    },
    {
      "id": 22,
      "start": 2469.480010986328,
      "end": 2474.480010986328,
      "text": " that David is not going to have any mark upon his testimony."
    },
    {
      "id": 23,
      "start": 2474.7000045776367,
      "end": 2478.480010986328,
      "text": " Not gonna be any reproach, no issues when he becomes the king."
    },
    {
      "id": 24,
      "start": 2478.480010986328,
      "end": 2479.7000045776367,
      "text": " It says in verse 36,"
    },
    {
      "id": 25,
      "start": 2479.7000045776367,
      "end": 2481.7800064086914,
      "text": " And Abigail came to Nabal, and behold,"
    },
    {
      "id": 26,
      "start": 2481.7800064086914,
      "end": 2483.940010070801,
      "text": " he had a feast in his house like the feast of a king,"
    },
    {
      "id": 27,
      "start": 2483.940010070801,
      "end": 2485.8000106811523,
      "text": " and Nabal's heart was merry within him,"
    },
    {
      "id": 28,
      "start": 2485.8000106811523,
      "end": 2486.960006713867,
      "text": " for he was very drunken."
    },
    {
      "id": 29,
      "start": 2486.960006713867,
      "end": 2489.080009460449,
      "text": " Wherefore, she told him nothing less or more"
    },
    {
      "id": 30,
      "start": 2489.080009460449,
      "end": 2490.1800079345703,
      "text": " until the morning light."
    },
    {
      "id": 31,
      "start": 2490.1800079345703,
      "end": 2491.6800079345703,
      "text": " But it came to pass in the morning"
    },
    {
      "id": 32,
      "start": 2491.6800079345703,
      "end": 2492.8000106811523,
      "text": " when the wine was gone out of Nabal"
    },
    {
      "id": 33,
      "start": 2492.8000106811523,
      "end": 2495.020004272461,
      "text": " and his wife had told him these things,"
    },
    {
      "id": 34,
      "start": 2495.020004272461,
      "end": 2497.960006713867,
      "text": " that his heart died within him and he became as a stone."
    },
    {
      "id": 35,
      "start": 2497.960006713867,
      "end": 2500.1200103759766,
      "text": " And it came to pass about 10 days after"
    },
    {
      "id": 36,
      "start": 2500.1200103759766,
      "end": 2502.940010070801,
      "text": " that the Lord smote Nabal that he died."
    },
    {
      "id": 37,
      "start": 2504.040008544922,
      "end": 2507.480010986328,
      "text": " God's able, God's able."
    },
    {
      "id": 38,
      "start": 2508.1800079345703,
      "end": 2511.1800079345703,
      "text": " Days passed, but God dealt with Nabal."
    },
    {
      "id": 39,
      "start": 2512.340003967285,
      "end": 2513.940010070801,
      "text": " The Bible says in verse 39,"
    },
    {
      "id": 40,
      "start": 2513.940010070801,
      "end": 2516.860008239746,
      "text": " And when David heard that Nabal was dead,"
    },
    {
      "id": 41,
      "start": 2516.860008239746,
      "end": 2519.540008544922,
      "text": " he said, Blessed be the Lord."
    },
    {
      "id": 42,
      "start": 2519.540008544922,
      "end": 2520.740005493164,
      "text": " Notice what he says,"
    },
    {
      "id": 43,
      "start": 2520.740005493164,
      "end": 2525.340003967285,
      "text": " That hath pleaded the cause of my reproach"
    },
    {
      "id": 44,
      "start": 2525.340003967285,
      "end": 2527.1000061035156,
      "text": " from the hand of Nabal,"
    },
    {
      "id": 45,
      "start": 2527.1000061035156,
      "end": 2532.1000061035156,
      "text": " and hath kept his servant from evil."
    },
    {
      "id": 46,
      "start": 2533.460006713867,
      "end": 2536.1800079345703,
      "text": " For the Lord hath returned the wickedness of Nabal"
    },
    {
      "id": 47,
      "start": 2537.0,
      "end": 2539.240005493164,
      "text": " upon his own head."
    },
    {
      "id": 48,
      "start": 2539.240005493164,
      "end": 2541.240005493164,
      "text": " David sent and communed with Abigail"
    },
    {
      "id": 49,
      "start": 2541.240005493164,
      "end": 2544.960006713867,
      "text": " to take her to him, to wife."
    },
    {
      "id": 50,
      "start": 2544.960006713867,
      "end": 2547.240005493164,
      "text": " I want you to notice that in this portion of Scripture"
    },
    {
      "id": 51,
      "start": 2547.240005493164,
      "end": 2549.6400146484375,
      "text": " in Genesis, or excuse me, in 1 Samuel 25,"
    },
    {
      "id": 52,
      "start": 2549.6400146484375,
      "end": 2552.520004272461,
      "text": " sandwiched between these two events"
    },
    {
      "id": 53,
      "start": 2552.520004272461,
      "end": 2554.960006713867,
      "text": " where David is dealing with Saul,"
    },
    {
      "id": 54,
      "start": 2554.960006713867,
      "end": 2558.8600006103516,
      "text": " there's this interaction with Nabal and Abigail."
    },
    {
      "id": 55,
      "start": 2560.0800018310547,
      "end": 2561.6800079345703,
      "text": " And David is absolutely determined."
    },
    {
      "id": 56,
      "start": 2561.6800079345703,
      "end": 2564.240005493164,
      "text": " In chapter 24, he's not gonna raise his hand"
    },
    {
      "id": 57,
      "start": 2564.240005493164,
      "end": 2565.4400024414062,
      "text": " against the Lord's anointed."
    },
    {
      "id": 58,
      "start": 2565.540008544922,
      "end": 2567.460006713867,
      "text": " He responds properly."
    },
    {
      "id": 59,
      "start": 2567.460006713867,
      "end": 2569.7000122070312,
      "text": " But now Nabal, I'm gonna kill him"
    },
    {
      "id": 60,
      "start": 2569.7000122070312,
      "end": 2571.8200073242188,
      "text": " and I'm gonna kill all the men."
    },
    {
      "id": 61,
      "start": 2571.8200073242188,
      "end": 2573.6600036621094,
      "text": " Taking matters into my own hands."
    },
    {
      "id": 62,
      "start": 2575.060012817383,
      "end": 2576.6600036621094,
      "text": " And he says at the end,"
    },
    {
      "id": 63,
      "start": 2576.6600036621094,
      "end": 2577.980010986328,
      "text": " after all that we've read"
    },
    {
      "id": 64,
      "start": 2577.980010986328,
      "end": 2580.6200103759766,
      "text": " and after all that we considered from 1 Samuel 25,"
    },
    {
      "id": 65,
      "start": 2580.6200103759766,
      "end": 2583.460006713867,
      "text": " he says, that he says,"
    },
    {
      "id": 66,
      "start": 2583.460006713867,
      "end": 2587.6600036621094,
      "text": " Blessed be the Lord that hath pleaded the cause"
    },
    {
      "id": 67,
      "start": 2587.6600036621094,
      "end": 2590.060012817383,
      "text": " of my reproach from the hand of Nabal"
    },
    {
      "id": 68,
      "start": 2590.060012817383,
      "end": 2594.460006713867,
      "text": " and hath kept his servant from evil."
    },
    {
      "id": 69,
      "start": 2594.460006713867,
      "end": 2596.560012817383,
      "text": " You ever take matters into your own hands"
    },
    {
      "id": 70,
      "start": 2597.960006713867,
      "end": 2599.6800079345703,
      "text": " and find yourself having to enter"
    },
    {
      "id": 71,
      "start": 2599.6800079345703,
      "end": 2601.040008544922,
      "text": " into the confession closet"
    },
    {
      "id": 72,
      "start": 2601.040008544922,
      "end": 2604.1200103759766,
      "text": " and ask God to forgive you for how you behaved?"
    },
    {
      "id": 73,
      "start": 2604.1200103759766,
      "end": 2607.040008544922,
      "text": " Because when you take matters into your own hands,"
    },
    {
      "id": 74,
      "start": 2607.040008544922,
      "end": 2608.8400115966797,
      "text": " make a mess of things."
    },
    {
      "id": 75,
      "start": 2608.8400115966797,
      "end": 2610.8400115966797,
      "text": " We're not trusting the Lord."
    },
    {
      "id": 76,
      "start": 2610.8400115966797,
      "end": 2612.5,
      "text": " We're not trusting that he's able."
    },
    {
      "id": 77,
      "start": 2612.5,
      "end": 2615.8400115966797,
      "text": " Remember, I said this by way of introduction,"
    },
    {
      "id": 78,
      "start": 2615.8400115966797,
      "end": 2619.1200103759766,
      "text": " when we respond, when we react to being wrong"
    },
    {
      "id": 79,
      "start": 2619.1200103759766,
      "end": 2622.240005493164,
      "text": " in this manner, then it's really demonstrating"
    },
    {
      "id": 80,
      "start": 2622.240005493164,
      "end": 2625.7000122070312,
      "text": " a lack of trust, that God is not able,"
    },
    {
      "id": 81,
      "start": 2625.7000122070312,
      "end": 2628.220001220703,
      "text": " that somehow I have to avenge myself,"
    },
    {
      "id": 82,
      "start": 2628.220001220703,
      "end": 2630.980010986328,
      "text": " but God says, vengeance is mine, saith the Lord."
    },
    {
      "id": 83,
      "start": 2631.980010986328,
      "end": 2634.540008544922,
      "text": " And in our lives, listen, you're going to be wronged"
    },
    {
      "id": 84,
      "start": 2634.540008544922,
      "end": 2635.6200103759766,
      "text": " and I'm gonna be wronged."
    },
    {
      "id": 85,
      "start": 2635.6200103759766,
      "end": 2636.6600036621094,
      "text": " It's gonna happen."
    },
    {
      "id": 86,
      "start": 2637.5,
      "end": 2638.460006713867,
      "text": " It might happen tonight."
    },
    {
      "id": 87,
      "start": 2638.460006713867,
      "end": 2640.040008544922,
      "text": " It might happen this week."
    },
    {
      "id": 88,
      "start": 2640.040008544922,
      "end": 2642.1800079345703,
      "text": " Maybe you've been wronged recently."
    },
    {
      "id": 89,
      "start": 2642.1800079345703,
      "end": 2644.9400024414062,
      "text": " Maybe you can think this evening"
    },
    {
      "id": 90,
      "start": 2644.9400024414062,
      "end": 2647.5800018310547,
      "text": " of a specific time in which you took matters"
    },
    {
      "id": 91,
      "start": 2647.5800018310547,
      "end": 2648.9400024414062,
      "text": " into your own hands."
    },
    {
      "id": 92,
      "start": 2648.9400024414062,
      "end": 2651.8400115966797,
      "text": " Said, man, how did I make a mess of this situation?"
    },
    {
      "id": 93,
      "start": 2652.9200134277344,
      "end": 2656.800018310547,
      "text": " This evening, as we look at the account in Genesis 34,"
    },
    {
      "id": 94,
      "start": 2656.800018310547,
      "end": 2660.1600036621094,
      "text": " we see the historical account that God provides."
    },
    {
      "id": 95,
      "start": 2660.1600036621094,
      "end": 2662.540008544922,
      "text": " Terrible situation."
    },
    {
      "id": 96,
      "start": 2663.5599975585938,
      "end": 2665.2000122070312,
      "text": " Two wrongs don't make a right."
    },
    {
      "id": 97,
      "start": 2666.3999938964844,
      "end": 2669.1600036621094,
      "text": " They tried to justify their actions,"
    },
    {
      "id": 98,
      "start": 2669.1600036621094,
      "end": 2671.3200073242188,
      "text": " but what they did was wrong."
    },
    {
      "id": 99,
      "start": 2671.3200073242188,
      "end": 2673.6799926757812,
      "text": " It was wrong, but it doesn't give you a right"
    },
    {
      "id": 100,
      "start": 2673.6799926757812,
      "end": 2674.720001220703,
      "text": " to respond wrong."
    },
    {
      "id": 101,
      "start": 2675.7000122070312,
      "end": 2679.8600158691406,
      "text": " And this evening, if we're gonna avoid taking matters"
    },
    {
      "id": 102,
      "start": 2679.8600158691406,
      "end": 2683.9400024414062,
      "text": " into our own hands, we must recognize the providence of God."
    },
    {
      "id": 103,
      "start": 2683.9400024414062,
      "end": 2686.7000122070312,
      "text": " We must exercise restraint."
    },
    {
      "id": 104,
      "start": 2686.7000122070312,
      "end": 2691.5800170898438,
      "text": " And we must understand this evening that God is able."
    },
    {
      "id": 105,
      "start": 2691.5800170898438,
      "end": 2695.740020751953,
      "text": " It reveals maturity in the life of a believer."
    },
    {
      "id": 106,
      "start": 2695.740020751953,
      "end": 2698.5,
      "text": " When we're able to be wronged,"
    },
    {
      "id": 107,
      "start": 2700.300018310547,
      "end": 2701.3600158691406,
      "text": " God's in control."
    },
    {
      "id": 108,
      "start": 2702.3600158691406,
      "end": 2703.779998779297,
      "text": " God knows."
    },
    {
      "id": 109,
      "start": 2703.779998779297,
      "end": 2705.220001220703,
      "text": " God is able."
    },
    {
      "id": 110,
      "start": 2705.220001220703,
      "end": 2706.5800170898438,
      "text": " I said at the beginning of the message,"
    },
    {
      "id": 111,
      "start": 2706.5800170898438,
      "end": 2709.240020751953,
      "text": " when we got to Romans, so not really the beginning,"
    },
    {
      "id": 112,
      "start": 2709.240020751953,
      "end": 2710.540008544922,
      "text": " the middle of the message,"
    },
    {
      "id": 113,
      "start": 2711.6600036621094,
      "end": 2713.1400146484375,
      "text": " this is not an easy principle."
    },
    {
      "id": 114,
      "start": 2714.540008544922,
      "end": 2717.4600219726562,
      "text": " It's not something you're gonna do in your own power."
    },
    {
      "id": 115,
      "start": 2717.4600219726562,
      "end": 2720.8600158691406,
      "text": " It's not something you're gonna do in your own flesh."
    },
    {
      "id": 116,
      "start": 2720.8600158691406,
      "end": 2724.4400024414062,
      "text": " Because my flesh and your flesh wants to get even."
    },
    {
      "id": 117,
      "start": 2725.3399963378906,
      "end": 2726.779998779297,
      "text": " We don't like being wronged."
    },
    {
      "id": 118,
      "start": 2727.980010986328,
      "end": 2730.4200134277344,
      "text": " But this evening, we must avoid taking matters"
    },
    {
      "id": 119,
      "start": 2730.52001953125,
      "end": 2732.1199951171875,
      "text": " into our own hands."
    },
    {
      "id": 120,
      "start": 2732.1199951171875,
      "end": 2735.3800048828125,
      "text": " Learn the lessons from the life of David."
    },
    {
      "id": 121,
      "start": 2736.52001953125,
      "end": 2740.240020751953,
      "text": " And thank God when God sends an Abigail in your life."
    },
    {
      "id": 122,
      "start": 2740.240020751953,
      "end": 2741.8399963378906,
      "text": " You know what happens for some of us?"
    },
    {
      "id": 123,
      "start": 2741.8399963378906,
      "end": 2743.220001220703,
      "text": " God sends an Abigail in our life"
    },
    {
      "id": 124,
      "start": 2743.220001220703,
      "end": 2744.52001953125,
      "text": " and we get mad at Abigail."
    },
    {
      "id": 125,
      "start": 2745.6799926757812,
      "end": 2746.52001953125,
      "text": " Seriously."
    },
    {
      "id": 126,
      "start": 2747.9600219726562,
      "end": 2749.1199951171875,
      "text": " Who are you to tell me?"
    },
    {
      "id": 127,
      "start": 2751.0,
      "end": 2752.480010986328,
      "text": " Just trust the Lord."
    },
    {
      "id": 128,
      "start": 2752.480010986328,
      "end": 2753.52001953125,
      "text": " He's able."
    },
    {
      "id": 129,
      "start": 2753.52001953125,
      "end": 2754.3600158691406,
      "text": " Let's pray."
    },
    {
      "id": 130,
      "start": 2754.3600158691406,
      "end": 2755.6000061035156,
      "text": " Father, we love you."
    },
    {
      "id": 131,
      "start": 2755.6000061035156,
      "end": 2757.8600158691406,
      "text": " We thank you for loving us."
    },
    {
      "id": 132,
      "start": 2757.8600158691406,
      "end": 2760.279998779297,
      "text": " God, we look at a difficult passage of scripture"
    },
    {
      "id": 133,
      "start": 2761.1400146484375,
      "end": 2762.5,
      "text": " in Genesis 34 this evening."
    },
    {
      "id": 134,
      "start": 2763.779998779297,
      "end": 2767.02001953125,
      "text": " I believe that you've recorded that event"
    },
    {
      "id": 135,
      "start": 2770.0800170898438,
      "end": 2772.8200073242188,
      "text": " not only to give us the historical account,"
    },
    {
      "id": 136,
      "start": 2774.0599975585938,
      "end": 2776.260009765625,
      "text": " but Lord, to help us understand the importance"
    },
    {
      "id": 137,
      "start": 2776.260009765625,
      "end": 2779.300018310547,
      "text": " of not taking matters into our own hands."
    },
    {
      "id": 138,
      "start": 2779.300018310547,
      "end": 2781.6600036621094,
      "text": " It's such a common response."
    },
    {
      "id": 139,
      "start": 2782.980010986328,
      "end": 2785.720001220703,
      "text": " At times, if we'd be honest, it's desirable."
    },
    {
      "id": 140,
      "start": 2786.980010986328,
      "end": 2787.8600158691406,
      "text": " We wanna get even."
    },
    {
      "id": 141,
      "start": 2787.8600158691406,
      "end": 2789.3399963378906,
      "text": " We want that revenge."
    },
    {
      "id": 142,
      "start": 2790.1799926757812,
      "end": 2794.240020751953,
      "text": " That moment of feeling good."
    },
    {
      "id": 143,
      "start": 2797.240020751953,
      "end": 2802.240020751953,
      "text": " God, we need to take the whole counsel of God into account."
    },
    {
      "id": 144,
      "start": 2804.3200073242188,
      "end": 2805.9600219726562,
      "text": " You told us that vengeance is yours."
    },
    {
      "id": 145,
      "start": 2805.9600219726562,
      "end": 2809.4600219726562,
      "text": " You told us to not be overcome with evil,"
    },
    {
      "id": 146,
      "start": 2809.4600219726562,
      "end": 2811.3800048828125,
      "text": " but to overcome evil with good."
    },
    {
      "id": 147,
      "start": 2812.6000061035156,
      "end": 2814.6400146484375,
      "text": " God, I pray that you'd help us tonight."
    },
    {
      "id": 148,
      "start": 2816.3999938964844,
      "end": 2818.6400146484375,
      "text": " We live in a world in which we'll be wronged."
    },
    {
      "id": 149,
      "start": 2818.6400146484375,
      "end": 2821.800018310547,
      "text": " People will do us wrong and they'll treat us wrong."
    },
    {
      "id": 150,
      "start": 2821.800018310547,
      "end": 2825.5,
      "text": " God, I pray that you'd help us to not react,"
    },
    {
      "id": 151,
      "start": 2825.5,
      "end": 2829.240020751953,
      "text": " but God, help us to respond appropriately, biblically."
    },
    {
      "id": 152,
      "start": 2829.240020751953,
      "end": 2833.3200073242188,
      "text": " Help us to respond by trusting you, relying upon you."
    },
    {
      "id": 153,
      "start": 2835.540008544922,
      "end": 2839.1799926757812,
      "text": " I pray, Lord, that those that maybe are going through"
    },
    {
      "id": 154,
      "start": 2839.1799926757812,
      "end": 2841.1000061035156,
      "text": " a difficulty even at this moment,"
    },
    {
      "id": 155,
      "start": 2842.4200134277344,
      "end": 2844.3200073242188,
      "text": " where they've been wronged,"
    },
    {
      "id": 156,
      "start": 2844.3200073242188,
      "end": 2846.1000061035156,
      "text": " God, I pray that you'd give them wisdom,"
    },
    {
      "id": 157,
      "start": 2846.1000061035156,
      "end": 2850.1799926757812,
      "text": " give them comfort, give them strength."
    },
    {
      "id": 158,
      "start": 2851.0800170898438,
      "end": 2852.6799926757812,
      "text": " Help us, Lord, to trust you more."
    },
    {
      "id": 159,
      "start": 2852.6799926757812,
      "end": 2855.0,
      "text": " I pray that you'd move and work in our hearts and lives"
    },
    {
      "id": 160,
      "start": 2855.0,
      "end": 2856.1000061035156,
      "text": " as only you can."
    },
    {
      "id": 161,
      "start": 2857.3600158691406,
      "end": 2859.3200073242188,
      "text": " We'll give you all the honor and glory."
    },
    {
      "id": 162,
      "start": 2860.480010986328,
      "end": 2861.3600158691406,
      "text": " Would you stand with me?"
    },
    {
      "id": 163,
      "start": 2861.3600158691406,
      "end": 2862.9600219726562,
      "text": " Heads are bowed, eyes are open."
    }
  ],
  "processed_at": "2025-04-16T10:07:08.902075"
}