{
  "video_id": "aJhY6zXGiNE",
  "text": "number 11 this evening, Luke chapter number 11, and I'll be looking at verse number 4. Of course, for a number of weeks now, on Wednesday evenings, we have gone through this portion of Scripture, and we have purposed to go very slowly through this portion of Scripture, really dealing with one phrase at a time, and having abbreviated services on Wednesday evenings so that we can have extended periods of time of prayer, and I believe that prayer is important. We see all throughout the Word of God how that God's people are encouraged to pray. We have the privilege of reading recorded prayers of God's people. We have the privilege of understanding how God hears and answers prayer and how prayer changes things, and I believe that we need a revival of prayer, and the songwriter wrote the song about sweet hour of prayer, and you know, it's a precious thing to be able to have communion with our Lord and to enter into His presence and to bring, not only to worship Him and adore Him during our time of prayer, but to bring petitions before His throne to be engaged in the ministry of intercessory prayer, and throughout the Word of God we find many examples and instructions that are provided to us with regard to the subject matter of prayer. As we have the opportunity to look at this particular portion of Scripture, of course we understand that Jesus is responding to the request of the disciple when the disciple said, Lord, teach us to pray, as John also taught his disciples, and we think about, we understand the model prayer, if you will, the framework of prayer that is given here in this portion of Scripture. You can look at Matthew 6 as well, and when followed, when we look at this framework and use this framework or this model to really guide our time of prayer, you'll be mindful of several things. Number one, you'll be mindful of your relationship to God Almighty, our Father which art in heaven. You'll be mindful of that relationship that was made possible through the sacrifice of the Lord Jesus Christ on the cross of Calvary. You'll be mindful of His holiness and His greatness. Hallowed be thy name. We see our Father which art in heaven, and you are mindful and you're taken in your mind as you follow the framework and you begin to think about the names of God and you begin to just worship God in the beauty of His holiness and be mindful of who He is and really standing in awe of Him. Remember, the psalmist said, I know that the Lord is great, and then later on he says that His greatness, speaking of the Lord, is unsearchable, and there's no contradiction there. The reality is that we know that God is great, but we cannot understand or comprehend the completeness of God's greatness. In our finite minds, we're incapable of understanding an infinite God. We're mindful of His provision, give us day by day our daily bread. And we mentioned that He is Jehovah Jireh. It's a name that is ascribed to God there in Genesis chapter number 22. We're mindful that He is the shepherd, our shepherd, and the shepherd provides. We're mindful as we follow this framework of His forgiveness and forgive us our sins. And I'm so thankful that our God is ready to pardon and ready to forgive that with He, with Thee, with the Lord, there is forgiveness. Not only are we mindful of these truths, but we find that as we follow this framework that we'll develop an attitude of both reverence and submission. When we understand who He is and we're mindful of who He is, we enter into that time of prayer, not in a relaxed type of an atmosphere, if you will, but really with a spirit, an attitude of reverence. We understand how our God is holy, and we approach Him based upon His holiness. We understand that Isaiah, in Isaiah chapter number 6, when he sees God in all of His holiness in the year that King Uzziah died, he immediately falls and begins to worship. And what a blessing to see throughout the Scriptures the way in which God is worshipped. And we have that attitude of reverence. We have that attitude of submission. And you remember as we looked at this particular thought, Thy kingdom come, Thy will be done as in heaven, so in earth, a few weeks ago. We said prayer is so much more than really just a grocery list of our needs, our wants, or our demands. It's fellowship with God Almighty. Last week we looked at that text at the beginning of verse number 4, and forgive us our sins. This evening we will examine the next phrase in verse number 4 and really focus upon the importance of God's people having a forgiving spirit. Notice what the Word of God says in Luke 11 in verse number 4, and forgive us our sins, for we also forgive everyone that is indebted to us. And I've simply titled the study this evening, We Also Forgive, there that phrase in verse number 4, and just be looking at this phrase this evening, for we also forgive everyone that is indebted to us, and considering the importance of us as the people of God having a forgiving spirit. If you're taking notes to the first thought this evening is I want you to consider the problem when we think about the statement that is made here. The problem that we face in life is that as you live life, you'll find that people will sin against you, and it's something that we deal with. In fact, there are times in which we've sinned against others, that we're the offender, not the one being offended, but the subject matter is really dealing with you as the offended party if you will, the one that's been sinned against. We can look through the scriptures and we can look at examples of individuals that were sinned against, that were dealt maybe improperly from their brethren, from others that were in their lives, and we understand that this is something that we will encounter in life, and we will deal with this, and really our response is what is important. I want you to think about this situation, and I want you to look back in the book of Matthew if you will, in chapter number 18, and I want you to consider with me the inquiry of Peter as we think about the problem that we all face in life of those that would sin against us. We look at this inquiry of Peter in Matthew chapter number 18, and we know that here in this passage the Lord will give great instruction with regard to forgiveness, and He'll use a great example of teaching and illustrating the importance of forgiveness and the way in which those that are forgiven should be forgiving others, but we find that Peter makes this inquiry in verse number 21, \"...then came Peter to him and said, Lord, how oft shall my brother sin against me, and I forgive him?\" And then he offers a potential answer to the question that he's asked, till seven times? And if we understand really some of the historical background there, some of those prominent teachers during this particular era, they would suggest that you would forgive others up to three, possibly four times for the same offense, and so really when you see Peter in his inquiry and asking the question, he's revealing to us that our brother is going to sin against us. And he says, how oft shall my brother sin against me, and I forgive him? That my response to his sinning against me would be forgiveness, and he says, till seven times. And really, if the common accepted practice was three or maybe four times, seven is pretty commendable, is it not? I mean, Peter in his mind, I mean, three was kind of the going rate, if you will, and Peter's like, I've doubled it, right? I mean, plus a little bit, right? And so he says, till seven times. And I know that often we speak about Peter and how he's so outwardly spoken, and throughout the Scriptures we see him asking questions and offering answers and sometimes speaking things that he really doesn't have any sense of what he's talking about, but here I believe that the question is probably one that many had. Peter is asking honestly, inquiring of the Lord, and we'll look at the answer in just a moment, but we notice the inquiry of Peter with regard to this problem that our brother, and others, will sin against us. Look at what Jesus said. Notice the instruction of Jesus in Luke 17. We see the inquiry of Peter in Matthew 18. Over in Luke 17, we find that Jesus is teaching the disciples about the subject matter of forgiveness, and notice how he begins the passage of Scripture in verse number one of Luke 17. And then said he unto the disciples, it is impossible but that offenses will come. But woe unto him through whom they come. It were better for him that a millstone were hanged about his neck and he cast into the sea than that he should offend one of these little ones. Then he says this to these disciples, take heed to yourselves, if thy brother trespass against thee, rebuke him, and if he repent, forgive him. If he repent, forgive him. And so we see again that Jesus is teaching this subject matter that these offenses are going to come if thy brother trespass against thee, and so we understand that in life, listen, we didn't have to live long to know that these things are going to happen. And how is it that sometimes we want to respond, really, Proverbs tells us this in Proverbs 24 and verse number 29, and really the response that many people like to have when somebody does them wrong, in Proverbs 24 and verse 29, the Bible says, say not, I will do so to him as he hath done to me. I will render to the man according to his work. The wise man says, say not that this is what you're going to do, and the reality is that as parents, those of us that have had children, those that have worked with children, no doubt at some point you receive the answer when you ask the question, why did you hit so and so? Why did you throw that at so and so? Why did you do this? Well, because they did it to me. We hear that, right? And it's kind of the, I wouldn't have hit them if they didn't hit me. I wouldn't have said that if they didn't say this. And that's sometimes the way that we like to deal with things in the flesh, and we can be in danger as we look at the way in which people would hurt us, would sin against us of doing things inappropriately or responding inappropriately, but we find that the text of Scripture that we're looking at here in Luke 11 says, for we also forgive everyone that is indebted to us. So there's a principle that's contained here that is mindful for us, again, as we think about this model prayer, this framework of prayer, and we understand the way in which we would use this as a guide for our time of prayer, that we would be mindful not only of our own sinfulness, but of the importance of forgiving others in our lives. And I'm so thankful that Christ would forgive us, that with Him there's forgiveness, and that we can say, forgive us our sins, but we, as people that have been forgiven, should forgive. And so the principle is that we would forgive and avoid bitterness in our lives. Notice what Ephesians 4 says. Turn to the book of Ephesians, if you will, and I want you to notice what Paul is saying to these believers in Ephesus, and notice throughout this portion of Scripture, really beginning in verse number 17 and going all the way through the end of Ephesians 4, Paul is dealing with this principle that we see throughout the New Testament of this putting off of the old and putting on of the new. And as we would see this truth, he begins, he says this in verse 22, that you put off concerning the former conversation, the old man which is corrupt according to the deceitful lust, and be renewed in the spirit of your mind. And then he's going to, throughout the next several verses of Scripture, really to the end of the chapter, he's going to illustrate this put off, put on principle. These things that you did before, this banner in which you lived and behaved, your former conversation that was according to the old man, that we've been born again, and so the things that we used to do, we don't do those things anymore, we're new creatures, we're in Christ, and so Paul is going through and giving all of this instruction, and you find that he comes to verse number 31, and he says this, let all bitterness and wrath and anger and clamor and evil speaking be put away from you with all malice. And then notice verse 32, and be kind one to another, tenderhearted, forgiving one another. And then he tells us this at the end of the verse, and it's so important that we understand this perspective really that is given to us at the end of verse number 32, even as God, for Christ's sake, hath forgiven you. Aren't you thankful to be forgiven? I mean honestly, to know that we have been forgiven, of course if you were to be mindful of the entirety really of the thought, the theme, or the tenor of this book of Ephesians, you'll remember that in chapter number 2, that Paul dealt with their former conversation that they were dead in their trespasses and sins, and yet God, who is rich in mercy for his great love wherewith he had loved us, and how they'd been born again, and just the transformation that took place in their lives, and now when Paul is teaching them on the subject matter of forgiving one another, Paul says that they are to be mindful and have this perspective, even as God, for Christ's sake, hath forgiven you. Almighty God has forgiven us, and therefore we ought to forgive others. We see this principle that is given to us when the Lord Jesus Christ is giving this response to the disciples and teaching them on this model, this framework for prayer, for we also forgive everyone that is indebted to us. You know, the problem I've heard over the years where individuals have made some sort of statement, well they don't deserve to be forgiven. We need to be careful, because the reality is that we, while we were yet sinners, Christ died for us, Romans 5. And we understand that God's grace and his mercy that was abundant towards us in forgiving us, and when we are mindful and we're living with that perspective, it will certainly enable us to be able to forgive those that would offend us, that would sin against us. Let's go back to Matthew 18, if you will, and notice the response that Jesus gives to this inquiry of Peter. Remember, as we mentioned a few moments ago, Peter says, how oft, Lord, shall my brother sin against me and I forgive him, till seven times? And Jesus saith unto him, verse number 22 of Matthew 18, I say not unto thee until seven times, but until seventy times seven. We are familiar with this portion of Scripture, and we know the way in which the Lord responds, and you understand that here in this text that Jesus is not telling Peter to keep some type of a logbook and to count the number of times in which the individual would sin against him, and once he reaches 490, it's done. I have no more opportunity to forgive you of this offense. No, that wasn't the idea, to keep a logbook and to count up to that number. The message in which Jesus is communicating to Peter and to the other disciples and to us as the Word of God has been preserved for us this evening, is understood that we are to forgive continually, perpetually, as they come and they seek forgiveness that we would forgive, we need to be careful of guarding against bitterness in our own hearts, in our own lives. In Luke 17, we mentioned a moment ago about the instruction of Jesus, and we understand again the fact that there will be those that will sin against us, and you notice here in Luke 17, in verse number 4, Jesus continues his teaching and says, And if he trespass against thee seven times in a day, and seven times in a day turn again to thee, saying, I repent, thou shalt forgive him. And so it's a little bit different of a context of what Peter had asked and the answer that he received in Matthew chapter number 18, and Jesus is saying here, if seven times in a day, and he repents, then you forgive him, thou shalt forgive him. And I want you to notice the response of the apostles as it's recorded for us in verse number 5, and the apostles said unto the Lord, increase our faith. And I believe that the response of the apostles here in verse number 5 in understanding this thing, this teaching subject of forgiveness, is that we need the help of God, especially in dealing with someone that would be a repeated offender, as is what's being dealt with here in this text of Scripture. That we would have God's help and God's grace as we would seek to have that forgiving spirit that would be evident in the people of God. Notice with me over in Hebrews chapter number 12, and this is really what we seek to guard against as we would understand the importance of forgiveness in our lives, and we'd understand the potential for bitterness. There's some people that are bitter in our world. There's some people that are bitter in churches. I've heard evangelists make statements of times in which they've gone to preach in revival meetings and as they've been in revival meetings, they have witnessed where there would be some people in the church that had not spoken to one another for numbers of years because of some falling out that they had. Palmer Sean has shared a number of examples over the years, and no doubt Brother Sommerdorf and Brother Hummel and others that we have had that have come and shared this pulpit with us in revival meetings, they have seen bitterness even amongst the people of God. We see in verse number 15 of Hebrews 12 where the Bible says, looking diligently, lest any man fail of the grace of God, lest any root of bitterness springing up trouble you, and thereby many be defiled. Bitterness is a real danger, and there are people in our world, there are people in our world, but there are people in our churches that are struggling with this thing of bitterness. They're bitter. Something that took place maybe recently, maybe years ago, and they just won't let go of it, they won't forgive, and they're holding on to that, and they're bitter. Bitterness has grown in them. And someone has wisely said that bitterness will destroy the vessel in which it's stored more than the vessel on which it is poured. And I think that's a very wise statement that someone made. It's not original with me, but it's a very appropriate saying with regard to the subject matter of bitterness. And the reality this evening, there are some people, somebody could be bitter at someone, and the individual that you're bitter at, they probably have no idea that you're bitter at them, that you have an unforgiving spirit, and that you got this animosity towards them, and you don't want to see them, you don't want to bump into them, whatever. They probably don't even know. It's not affected them, but for us, if we would allow that bitterness to spring up within us, it can destroy us, cause us to have a lack of ability to minister appropriately and what have you. And so this evening, we're mindful of this model again that we see in Luke chapter 11, and we've taken piece by piece and looking at these individual statements that Jesus gives to these disciples in providing a model prayer framework for our prayer, that as we would seek forgiveness from our God, understanding that He is a forgiving God, that He's full of mercy and grace, that He's ready to pardon and ready to forgive, that we also are mindful of the importance of us as believers, of followers of Jesus Christ, of having a forgiving spirit. Not allowing any bitterness to creep within our lives, but to have that spirit of forgiveness. As we look at this passage in Luke chapter 11, again, we've purposed to go very slow through this and to be mindful of this framework, and I hope that over this series of messages as we've sought to just dig in and to give some framework, that it would help us in our individual prayer lives, that we have maybe over the last five or six weeks of studying this portion of Scripture, that we have seen our own personal prayer time grow and develop through understanding the framework that God provides for us. And prayer, again, is not some religious exercise that we just, well, I said my prayers today, and well, God bless this person and bless that person and bless them as well, and there's so much more to prayer, communing with our God, and as we would spend that time of adoring Him and exalting Him and being mindful of who He is, and then looking as we've continued to move our way through next week, we'll look at this last statement of verse number four, and consider the, lead us not into temptation, but deliver us from evil, and we'll look at some other principles throughout the Word of God with regard to prayer, and again, I'm so thankful for the privilege of prayer, and I hope this evening that as we consider this thought, that we would be mindful of the importance of a forgiving spirit as the people of God, that we would not be in a place where they say, well, they don't deserve it, and that we'd allow bitterness to destroy us, but that we would be forgiving. Remember, even as God, for Christ's sake, hath forgiven you, I'm so thankful. I know this evening if I were to ask, and if you'd be honest, if you've ever had to confess the same sin more than once, you'd probably say yes, you'd answer in the affirmative, and I'm so thankful that God still forgives, and even though we might mess up multiple times in the same day and the same offense, God forgives, and oh, that we would be Christ-like, and that we would also offer forgiveness to those that would sin against us. Father, we love You. We thank You for loving us. We thank You for the Word of God, the truth contained therein, and I pray that You would help us to have a forgiving spirit. Lord, that we would guard against bitterness in our lives, that we would be mindful of the grace and mercy that has been extended to us, and that we, in like fashion, would seek to be gracious and merciful to those that we interact with here upon earth. We pray that You'd bless our time of prayer. We pray that You'd be honored and glorified through all that we say and do. For it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.360000133514404,
      "text": " number 11 this evening, Luke chapter number 11, and I'll be looking at verse number 4."
    },
    {
      "id": 1,
      "start": 5.360000133514404,
      "end": 10.319999694824219,
      "text": " Of course, for a number of weeks now, on Wednesday evenings, we have gone through this portion"
    },
    {
      "id": 2,
      "start": 10.319999694824219,
      "end": 16.799999237060547,
      "text": " of Scripture, and we have purposed to go very slowly through this portion of Scripture,"
    },
    {
      "id": 3,
      "start": 16.799999237060547,
      "end": 23.360000610351562,
      "text": " really dealing with one phrase at a time, and having abbreviated services on Wednesday"
    },
    {
      "id": 4,
      "start": 23.360000610351562,
      "end": 30.440000534057617,
      "text": " evenings so that we can have extended periods of time of prayer, and I believe that prayer"
    },
    {
      "id": 5,
      "start": 30.440000534057617,
      "end": 31.600000381469727,
      "text": " is important."
    },
    {
      "id": 6,
      "start": 31.600000381469727,
      "end": 36.040000915527344,
      "text": " We see all throughout the Word of God how that God's people are encouraged to pray."
    },
    {
      "id": 7,
      "start": 36.040000915527344,
      "end": 40.47999954223633,
      "text": " We have the privilege of reading recorded prayers of God's people."
    },
    {
      "id": 8,
      "start": 40.47999954223633,
      "end": 44.84000015258789,
      "text": " We have the privilege of understanding how God hears and answers prayer and how prayer"
    },
    {
      "id": 9,
      "start": 44.84000015258789,
      "end": 53.2400016784668,
      "text": " changes things, and I believe that we need a revival of prayer, and the songwriter wrote"
    },
    {
      "id": 10,
      "start": 53.2400016784668,
      "end": 59.439998626708984,
      "text": " the song about sweet hour of prayer, and you know, it's a precious thing to be able"
    },
    {
      "id": 11,
      "start": 59.439998626708984,
      "end": 65.5199966430664,
      "text": " to have communion with our Lord and to enter into His presence and to bring, not only to"
    },
    {
      "id": 12,
      "start": 65.5199966430664,
      "end": 70.87999725341797,
      "text": " worship Him and adore Him during our time of prayer, but to bring petitions before His"
    },
    {
      "id": 13,
      "start": 70.87999725341797,
      "end": 75.95999908447266,
      "text": " throne to be engaged in the ministry of intercessory prayer, and throughout the Word of God we"
    },
    {
      "id": 14,
      "start": 75.95999908447266,
      "end": 80.4000015258789,
      "text": " find many examples and instructions that are provided to us with regard to the subject"
    },
    {
      "id": 15,
      "start": 80.4000015258789,
      "end": 82.4000015258789,
      "text": " matter of prayer."
    },
    {
      "id": 16,
      "start": 82.4000015258789,
      "end": 86.83999633789062,
      "text": " As we have the opportunity to look at this particular portion of Scripture, of course"
    },
    {
      "id": 17,
      "start": 86.83999633789062,
      "end": 91.76000213623047,
      "text": " we understand that Jesus is responding to the request of the disciple when the disciple"
    },
    {
      "id": 18,
      "start": 91.76000213623047,
      "end": 98.4800033569336,
      "text": " said, Lord, teach us to pray, as John also taught his disciples, and we think about,"
    },
    {
      "id": 19,
      "start": 98.4800033569336,
      "end": 104.12000274658203,
      "text": " we understand the model prayer, if you will, the framework of prayer that is given here"
    },
    {
      "id": 20,
      "start": 104.12000274658203,
      "end": 105.55999755859375,
      "text": " in this portion of Scripture."
    },
    {
      "id": 21,
      "start": 105.55999755859375,
      "end": 110.80000305175781,
      "text": " You can look at Matthew 6 as well, and when followed, when we look at this framework and"
    },
    {
      "id": 22,
      "start": 110.83999633789062,
      "end": 117.83999633789062,
      "text": " use this framework or this model to really guide our time of prayer, you'll be mindful"
    },
    {
      "id": 23,
      "start": 118.91999816894531,
      "end": 120.27999877929688,
      "text": " of several things."
    },
    {
      "id": 24,
      "start": 120.27999877929688,
      "end": 126.12000274658203,
      "text": " Number one, you'll be mindful of your relationship to God Almighty, our Father which art in heaven."
    },
    {
      "id": 25,
      "start": 126.12000274658203,
      "end": 130.75999450683594,
      "text": " You'll be mindful of that relationship that was made possible through the sacrifice of"
    },
    {
      "id": 26,
      "start": 130.75999450683594,
      "end": 133.55999755859375,
      "text": " the Lord Jesus Christ on the cross of Calvary."
    },
    {
      "id": 27,
      "start": 133.55999755859375,
      "end": 136.83999633789062,
      "text": " You'll be mindful of His holiness and His greatness."
    },
    {
      "id": 28,
      "start": 136.83999633789062,
      "end": 139.0,
      "text": " Hallowed be thy name."
    },
    {
      "id": 29,
      "start": 139.0,
      "end": 144.24000549316406,
      "text": " We see our Father which art in heaven, and you are mindful and you're taken in your mind"
    },
    {
      "id": 30,
      "start": 144.24000549316406,
      "end": 148.75999450683594,
      "text": " as you follow the framework and you begin to think about the names of God and you begin"
    },
    {
      "id": 31,
      "start": 148.75999450683594,
      "end": 154.83999633789062,
      "text": " to just worship God in the beauty of His holiness and be mindful of who He is and really standing"
    },
    {
      "id": 32,
      "start": 154.83999633789062,
      "end": 156.60000610351562,
      "text": " in awe of Him."
    },
    {
      "id": 33,
      "start": 156.60000610351562,
      "end": 162.1199951171875,
      "text": " Remember, the psalmist said, I know that the Lord is great, and then later on he says that"
    },
    {
      "id": 34,
      "start": 162.1199951171875,
      "end": 168.24000549316406,
      "text": " His greatness, speaking of the Lord, is unsearchable, and there's no contradiction there."
    },
    {
      "id": 35,
      "start": 168.24000549316406,
      "end": 173.9600067138672,
      "text": " The reality is that we know that God is great, but we cannot understand or comprehend the"
    },
    {
      "id": 36,
      "start": 173.9600067138672,
      "end": 176.9199981689453,
      "text": " completeness of God's greatness."
    },
    {
      "id": 37,
      "start": 176.9199981689453,
      "end": 181.44000244140625,
      "text": " In our finite minds, we're incapable of understanding an infinite God."
    },
    {
      "id": 38,
      "start": 181.44000244140625,
      "end": 186.52000427246094,
      "text": " We're mindful of His provision, give us day by day our daily bread."
    },
    {
      "id": 39,
      "start": 186.52000427246094,
      "end": 189.52000427246094,
      "text": " And we mentioned that He is Jehovah Jireh."
    },
    {
      "id": 40,
      "start": 189.52000427246094,
      "end": 194.75999450683594,
      "text": " It's a name that is ascribed to God there in Genesis chapter number 22."
    },
    {
      "id": 41,
      "start": 194.75999450683594,
      "end": 199.60000610351562,
      "text": " We're mindful that He is the shepherd, our shepherd, and the shepherd provides."
    },
    {
      "id": 42,
      "start": 199.60000610351562,
      "end": 206.39999389648438,
      "text": " We're mindful as we follow this framework of His forgiveness and forgive us our sins."
    },
    {
      "id": 43,
      "start": 206.39999389648438,
      "end": 212.1199951171875,
      "text": " And I'm so thankful that our God is ready to pardon and ready to forgive that with He,"
    },
    {
      "id": 44,
      "start": 212.1199951171875,
      "end": 216.63999938964844,
      "text": " with Thee, with the Lord, there is forgiveness."
    },
    {
      "id": 45,
      "start": 216.63999938964844,
      "end": 221.27999877929688,
      "text": " Not only are we mindful of these truths, but we find that as we follow this framework that"
    },
    {
      "id": 46,
      "start": 221.27999877929688,
      "end": 226.27999877929688,
      "text": " we'll develop an attitude of both reverence and submission."
    },
    {
      "id": 47,
      "start": 226.27999877929688,
      "end": 233.63999938964844,
      "text": " When we understand who He is and we're mindful of who He is, we enter into that time of prayer,"
    },
    {
      "id": 48,
      "start": 233.63999938964844,
      "end": 240.1199951171875,
      "text": " not in a relaxed type of an atmosphere, if you will, but really with a spirit, an attitude"
    },
    {
      "id": 49,
      "start": 240.1199951171875,
      "end": 241.1199951171875,
      "text": " of reverence."
    },
    {
      "id": 50,
      "start": 241.1199951171875,
      "end": 247.52000427246094,
      "text": " We understand how our God is holy, and we approach Him based upon His holiness."
    },
    {
      "id": 51,
      "start": 247.52000427246094,
      "end": 252.60000610351562,
      "text": " We understand that Isaiah, in Isaiah chapter number 6, when he sees God in all of His holiness"
    },
    {
      "id": 52,
      "start": 252.60000610351562,
      "end": 257.5199890136719,
      "text": " in the year that King Uzziah died, he immediately falls and begins to worship."
    },
    {
      "id": 53,
      "start": 257.5199890136719,
      "end": 262.2799987792969,
      "text": " And what a blessing to see throughout the Scriptures the way in which God is worshipped."
    },
    {
      "id": 54,
      "start": 262.2799987792969,
      "end": 265.239990234375,
      "text": " And we have that attitude of reverence."
    },
    {
      "id": 55,
      "start": 265.239990234375,
      "end": 268.0799865722656,
      "text": " We have that attitude of submission."
    },
    {
      "id": 56,
      "start": 268.0799865722656,
      "end": 272.8800048828125,
      "text": " And you remember as we looked at this particular thought, Thy kingdom come, Thy will be done"
    },
    {
      "id": 57,
      "start": 272.8800048828125,
      "end": 276.3599853515625,
      "text": " as in heaven, so in earth, a few weeks ago."
    },
    {
      "id": 58,
      "start": 276.3599853515625,
      "end": 281.7200012207031,
      "text": " We said prayer is so much more than really just a grocery list of our needs, our wants,"
    },
    {
      "id": 59,
      "start": 281.7200012207031,
      "end": 282.7200012207031,
      "text": " or our demands."
    },
    {
      "id": 60,
      "start": 282.7200012207031,
      "end": 286.1199951171875,
      "text": " It's fellowship with God Almighty."
    },
    {
      "id": 61,
      "start": 286.1199951171875,
      "end": 291.8399963378906,
      "text": " Last week we looked at that text at the beginning of verse number 4, and forgive us our sins."
    },
    {
      "id": 62,
      "start": 291.8399963378906,
      "end": 296.9599914550781,
      "text": " This evening we will examine the next phrase in verse number 4 and really focus upon the"
    },
    {
      "id": 63,
      "start": 296.9599914550781,
      "end": 301.67999267578125,
      "text": " importance of God's people having a forgiving spirit."
    },
    {
      "id": 64,
      "start": 301.67999267578125,
      "end": 308.20001220703125,
      "text": " Notice what the Word of God says in Luke 11 in verse number 4, and forgive us our sins,"
    },
    {
      "id": 65,
      "start": 308.20001220703125,
      "end": 314.5199890136719,
      "text": " for we also forgive everyone that is indebted to us."
    },
    {
      "id": 66,
      "start": 314.5199890136719,
      "end": 320.32000732421875,
      "text": " And I've simply titled the study this evening, We Also Forgive, there that phrase in verse"
    },
    {
      "id": 67,
      "start": 320.32000732421875,
      "end": 325.9599914550781,
      "text": " number 4, and just be looking at this phrase this evening, for we also forgive everyone"
    },
    {
      "id": 68,
      "start": 325.9599914550781,
      "end": 332.239990234375,
      "text": " that is indebted to us, and considering the importance of us as the people of God having"
    },
    {
      "id": 69,
      "start": 332.239990234375,
      "end": 333.6400146484375,
      "text": " a forgiving spirit."
    },
    {
      "id": 70,
      "start": 333.6400146484375,
      "end": 337.20001220703125,
      "text": " If you're taking notes to the first thought this evening is I want you to consider the"
    },
    {
      "id": 71,
      "start": 337.20001220703125,
      "end": 340.6600036621094,
      "text": " problem when we think about the statement that is made here."
    },
    {
      "id": 72,
      "start": 340.6600036621094,
      "end": 344.9599914550781,
      "text": " The problem that we face in life is that as you live life, you'll find that people will"
    },
    {
      "id": 73,
      "start": 344.9599914550781,
      "end": 348.44000244140625,
      "text": " sin against you, and it's something that we deal with."
    },
    {
      "id": 74,
      "start": 348.44000244140625,
      "end": 353.239990234375,
      "text": " In fact, there are times in which we've sinned against others, that we're the offender, not"
    },
    {
      "id": 75,
      "start": 353.239990234375,
      "end": 358.7200012207031,
      "text": " the one being offended, but the subject matter is really dealing with you as the offended"
    },
    {
      "id": 76,
      "start": 358.7200012207031,
      "end": 361.9599914550781,
      "text": " party if you will, the one that's been sinned against."
    },
    {
      "id": 77,
      "start": 361.9599914550781,
      "end": 365.8999938964844,
      "text": " We can look through the scriptures and we can look at examples of individuals that were"
    },
    {
      "id": 78,
      "start": 365.8999938964844,
      "end": 372.9800109863281,
      "text": " sinned against, that were dealt maybe improperly from their brethren, from others that were"
    },
    {
      "id": 79,
      "start": 372.9800109863281,
      "end": 377.9200134277344,
      "text": " in their lives, and we understand that this is something that we will encounter in life,"
    },
    {
      "id": 80,
      "start": 377.9200134277344,
      "end": 381.79998779296875,
      "text": " and we will deal with this, and really our response is what is important."
    },
    {
      "id": 81,
      "start": 381.79998779296875,
      "end": 386.05999755859375,
      "text": " I want you to think about this situation, and I want you to look back in the book of"
    },
    {
      "id": 82,
      "start": 386.05999755859375,
      "end": 391.1199951171875,
      "text": " Matthew if you will, in chapter number 18, and I want you to consider with me the inquiry"
    },
    {
      "id": 83,
      "start": 391.1199951171875,
      "end": 396.6400146484375,
      "text": " of Peter as we think about the problem that we all face in life of those that would sin"
    },
    {
      "id": 84,
      "start": 396.6400146484375,
      "end": 397.7200012207031,
      "text": " against us."
    },
    {
      "id": 85,
      "start": 397.7200012207031,
      "end": 402.9200134277344,
      "text": " We look at this inquiry of Peter in Matthew chapter number 18, and we know that here in"
    },
    {
      "id": 86,
      "start": 402.9200134277344,
      "end": 408.5199890136719,
      "text": " this passage the Lord will give great instruction with regard to forgiveness, and He'll use"
    },
    {
      "id": 87,
      "start": 409.1199951171875,
      "end": 415.0400085449219,
      "text": " a great example of teaching and illustrating the importance of forgiveness and the way"
    },
    {
      "id": 88,
      "start": 415.0400085449219,
      "end": 420.55999755859375,
      "text": " in which those that are forgiven should be forgiving others, but we find that Peter makes"
    },
    {
      "id": 89,
      "start": 420.55999755859375,
      "end": 422.9599914550781,
      "text": " this inquiry in verse number 21,"
    },
    {
      "id": 90,
      "start": 422.9599914550781,
      "end": 430.3599853515625,
      "text": " \"...then came Peter to him and said, Lord, how oft shall my brother sin against me, and"
    },
    {
      "id": 91,
      "start": 430.3599853515625,
      "end": 431.8800048828125,
      "text": " I forgive him?\""
    },
    {
      "id": 92,
      "start": 431.8800048828125,
      "end": 440.3999938964844,
      "text": " And then he offers a potential answer to the question that he's asked, till seven times?"
    },
    {
      "id": 93,
      "start": 440.3999938964844,
      "end": 447.0400085449219,
      "text": " And if we understand really some of the historical background there, some of those prominent"
    },
    {
      "id": 94,
      "start": 447.0400085449219,
      "end": 452.5199890136719,
      "text": " teachers during this particular era, they would suggest that you would forgive others"
    },
    {
      "id": 95,
      "start": 452.5199890136719,
      "end": 457.67999267578125,
      "text": " up to three, possibly four times for the same offense, and so really when you see"
    },
    {
      "id": 96,
      "start": 457.67999267578125,
      "end": 464.1600036621094,
      "text": " Peter in his inquiry and asking the question, he's revealing to us that our brother is going"
    },
    {
      "id": 97,
      "start": 464.1600036621094,
      "end": 466.3599853515625,
      "text": " to sin against us."
    },
    {
      "id": 98,
      "start": 466.3599853515625,
      "end": 472.0799865722656,
      "text": " And he says, how oft shall my brother sin against me, and I forgive him?"
    },
    {
      "id": 99,
      "start": 472.0799865722656,
      "end": 479.2799987792969,
      "text": " That my response to his sinning against me would be forgiveness, and he says, till seven"
    },
    {
      "id": 100,
      "start": 479.2799987792969,
      "end": 481.0799865722656,
      "text": " times."
    },
    {
      "id": 101,
      "start": 481.0799865722656,
      "end": 487.3599853515625,
      "text": " And really, if the common accepted practice was three or maybe four times, seven is pretty"
    },
    {
      "id": 102,
      "start": 487.3599853515625,
      "end": 488.8399963378906,
      "text": " commendable, is it not?"
    },
    {
      "id": 103,
      "start": 488.8399963378906,
      "end": 493.5199890136719,
      "text": " I mean, Peter in his mind, I mean, three was kind of the going rate, if you will, and Peter's"
    },
    {
      "id": 104,
      "start": 493.5199890136719,
      "end": 494.7200012207031,
      "text": " like, I've doubled it, right?"
    },
    {
      "id": 105,
      "start": 494.7200012207031,
      "end": 496.9599914550781,
      "text": " I mean, plus a little bit, right?"
    },
    {
      "id": 106,
      "start": 496.9599914550781,
      "end": 500.2799987792969,
      "text": " And so he says, till seven times."
    },
    {
      "id": 107,
      "start": 500.2799987792969,
      "end": 507.20001220703125,
      "text": " And I know that often we speak about Peter and how he's so outwardly spoken, and throughout"
    },
    {
      "id": 108,
      "start": 507.20001220703125,
      "end": 512.3200073242188,
      "text": " the Scriptures we see him asking questions and offering answers and sometimes speaking"
    },
    {
      "id": 109,
      "start": 512.3200073242188,
      "end": 518.52001953125,
      "text": " things that he really doesn't have any sense of what he's talking about, but here I believe"
    },
    {
      "id": 110,
      "start": 518.52001953125,
      "end": 523.9199829101562,
      "text": " that the question is probably one that many had."
    },
    {
      "id": 111,
      "start": 523.9199829101562,
      "end": 528.760009765625,
      "text": " Peter is asking honestly, inquiring of the Lord, and we'll look at the answer in just"
    },
    {
      "id": 112,
      "start": 528.760009765625,
      "end": 534.3599853515625,
      "text": " a moment, but we notice the inquiry of Peter with regard to this problem that our brother,"
    },
    {
      "id": 113,
      "start": 534.3599853515625,
      "end": 537.6400146484375,
      "text": " and others, will sin against us."
    },
    {
      "id": 114,
      "start": 537.6400146484375,
      "end": 538.9199829101562,
      "text": " Look at what Jesus said."
    },
    {
      "id": 115,
      "start": 538.9199829101562,
      "end": 542.1599731445312,
      "text": " Notice the instruction of Jesus in Luke 17."
    },
    {
      "id": 116,
      "start": 542.1599731445312,
      "end": 544.9199829101562,
      "text": " We see the inquiry of Peter in Matthew 18."
    },
    {
      "id": 117,
      "start": 544.9199829101562,
      "end": 552.280029296875,
      "text": " Over in Luke 17, we find that Jesus is teaching the disciples about the subject matter of"
    },
    {
      "id": 118,
      "start": 552.280029296875,
      "end": 558.3599853515625,
      "text": " forgiveness, and notice how he begins the passage of Scripture in verse number one of"
    },
    {
      "id": 119,
      "start": 558.3599853515625,
      "end": 559.3599853515625,
      "text": " Luke 17."
    },
    {
      "id": 120,
      "start": 559.3599853515625,
      "end": 569.0399780273438,
      "text": " And then said he unto the disciples, it is impossible but that offenses will come."
    },
    {
      "id": 121,
      "start": 569.0399780273438,
      "end": 571.2000122070312,
      "text": " But woe unto him through whom they come."
    },
    {
      "id": 122,
      "start": 571.2000122070312,
      "end": 575.1599731445312,
      "text": " It were better for him that a millstone were hanged about his neck and he cast into the"
    },
    {
      "id": 123,
      "start": 575.1599731445312,
      "end": 579.280029296875,
      "text": " sea than that he should offend one of these little ones."
    },
    {
      "id": 124,
      "start": 579.280029296875,
      "end": 584.4400024414062,
      "text": " Then he says this to these disciples, take heed to yourselves, if thy brother trespass"
    },
    {
      "id": 125,
      "start": 584.4400024414062,
      "end": 591.1599731445312,
      "text": " against thee, rebuke him, and if he repent, forgive him."
    },
    {
      "id": 126,
      "start": 591.1599731445312,
      "end": 592.52001953125,
      "text": " If he repent, forgive him."
    },
    {
      "id": 127,
      "start": 592.52001953125,
      "end": 597.5599975585938,
      "text": " And so we see again that Jesus is teaching this subject matter that these offenses are"
    },
    {
      "id": 128,
      "start": 597.5599975585938,
      "end": 603.47998046875,
      "text": " going to come if thy brother trespass against thee, and so we understand that in life, listen,"
    },
    {
      "id": 129,
      "start": 603.47998046875,
      "end": 607.4000244140625,
      "text": " we didn't have to live long to know that these things are going to happen."
    },
    {
      "id": 130,
      "start": 607.4000244140625,
      "end": 612.8400268554688,
      "text": " And how is it that sometimes we want to respond, really, Proverbs tells us this in Proverbs"
    },
    {
      "id": 131,
      "start": 612.8400268554688,
      "end": 621.3599853515625,
      "text": " 24 and verse number 29, and really the response that many people like to have when somebody"
    },
    {
      "id": 132,
      "start": 621.3599853515625,
      "end": 627.760009765625,
      "text": " does them wrong, in Proverbs 24 and verse 29, the Bible says, say not, I will do so"
    },
    {
      "id": 133,
      "start": 627.760009765625,
      "end": 630.7999877929688,
      "text": " to him as he hath done to me."
    },
    {
      "id": 134,
      "start": 630.7999877929688,
      "end": 635.1199951171875,
      "text": " I will render to the man according to his work."
    },
    {
      "id": 135,
      "start": 635.1199951171875,
      "end": 640.239990234375,
      "text": " The wise man says, say not that this is what you're going to do, and the reality is that"
    },
    {
      "id": 136,
      "start": 640.239990234375,
      "end": 645.760009765625,
      "text": " as parents, those of us that have had children, those that have worked with children, no doubt"
    },
    {
      "id": 137,
      "start": 645.760009765625,
      "end": 651.5999755859375,
      "text": " at some point you receive the answer when you ask the question, why did you hit so and"
    },
    {
      "id": 138,
      "start": 651.5999755859375,
      "end": 652.5999755859375,
      "text": " so?"
    },
    {
      "id": 139,
      "start": 652.5999755859375,
      "end": 654.2000122070312,
      "text": " Why did you throw that at so and so?"
    },
    {
      "id": 140,
      "start": 654.2000122070312,
      "end": 655.4000244140625,
      "text": " Why did you do this?"
    },
    {
      "id": 141,
      "start": 655.4000244140625,
      "end": 657.8800048828125,
      "text": " Well, because they did it to me."
    },
    {
      "id": 142,
      "start": 657.8800048828125,
      "end": 658.8800048828125,
      "text": " We hear that, right?"
    },
    {
      "id": 143,
      "start": 658.8800048828125,
      "end": 661.5999755859375,
      "text": " And it's kind of the, I wouldn't have hit them if they didn't hit me."
    },
    {
      "id": 144,
      "start": 661.5999755859375,
      "end": 664.8800048828125,
      "text": " I wouldn't have said that if they didn't say this."
    },
    {
      "id": 145,
      "start": 664.8800048828125,
      "end": 671.3200073242188,
      "text": " And that's sometimes the way that we like to deal with things in the flesh, and we can"
    },
    {
      "id": 146,
      "start": 671.3200073242188,
      "end": 677.2000122070312,
      "text": " be in danger as we look at the way in which people would hurt us, would sin against us"
    },
    {
      "id": 147,
      "start": 677.2000122070312,
      "end": 683.2000122070312,
      "text": " of doing things inappropriately or responding inappropriately, but we find that the text"
    },
    {
      "id": 148,
      "start": 683.2000122070312,
      "end": 688.6799926757812,
      "text": " of Scripture that we're looking at here in Luke 11 says, for we also forgive everyone"
    },
    {
      "id": 149,
      "start": 688.6799926757812,
      "end": 691.4000244140625,
      "text": " that is indebted to us."
    },
    {
      "id": 150,
      "start": 691.4000244140625,
      "end": 696.9600219726562,
      "text": " So there's a principle that's contained here that is mindful for us, again, as we think"
    },
    {
      "id": 151,
      "start": 696.9600219726562,
      "end": 702.5999755859375,
      "text": " about this model prayer, this framework of prayer, and we understand the way in which"
    },
    {
      "id": 152,
      "start": 702.5999755859375,
      "end": 708.5599975585938,
      "text": " we would use this as a guide for our time of prayer, that we would be mindful not only"
    },
    {
      "id": 153,
      "start": 708.5599975585938,
      "end": 713.47998046875,
      "text": " of our own sinfulness, but of the importance of forgiving others in our lives."
    },
    {
      "id": 154,
      "start": 713.47998046875,
      "end": 718.3200073242188,
      "text": " And I'm so thankful that Christ would forgive us, that with Him there's forgiveness, and"
    },
    {
      "id": 155,
      "start": 718.3200073242188,
      "end": 724.8400268554688,
      "text": " that we can say, forgive us our sins, but we, as people that have been forgiven, should"
    },
    {
      "id": 156,
      "start": 724.8400268554688,
      "end": 726.2000122070312,
      "text": " forgive."
    },
    {
      "id": 157,
      "start": 726.2000122070312,
      "end": 732.1599731445312,
      "text": " And so the principle is that we would forgive and avoid bitterness in our lives."
    },
    {
      "id": 158,
      "start": 732.1599731445312,
      "end": 735.280029296875,
      "text": " Notice what Ephesians 4 says."
    },
    {
      "id": 159,
      "start": 735.280029296875,
      "end": 739.2000122070312,
      "text": " Turn to the book of Ephesians, if you will, and I want you to notice what Paul is saying"
    },
    {
      "id": 160,
      "start": 739.2000122070312,
      "end": 745.719970703125,
      "text": " to these believers in Ephesus, and notice throughout this portion of Scripture, really"
    },
    {
      "id": 161,
      "start": 746.239990234375,
      "end": 751.239990234375,
      "text": " beginning in verse number 17 and going all the way through the end of Ephesians 4, Paul"
    },
    {
      "id": 162,
      "start": 751.239990234375,
      "end": 755.5999755859375,
      "text": " is dealing with this principle that we see throughout the New Testament of this putting"
    },
    {
      "id": 163,
      "start": 755.5999755859375,
      "end": 762.4000244140625,
      "text": " off of the old and putting on of the new."
    },
    {
      "id": 164,
      "start": 762.4000244140625,
      "end": 767.9600219726562,
      "text": " And as we would see this truth, he begins, he says this in verse 22, that you put off"
    },
    {
      "id": 165,
      "start": 767.9600219726562,
      "end": 773.280029296875,
      "text": " concerning the former conversation, the old man which is corrupt according to the deceitful"
    },
    {
      "id": 166,
      "start": 773.280029296875,
      "end": 776.6799926757812,
      "text": " lust, and be renewed in the spirit of your mind."
    },
    {
      "id": 167,
      "start": 776.6799926757812,
      "end": 780.760009765625,
      "text": " And then he's going to, throughout the next several verses of Scripture, really to the"
    },
    {
      "id": 168,
      "start": 780.760009765625,
      "end": 787.2000122070312,
      "text": " end of the chapter, he's going to illustrate this put off, put on principle."
    },
    {
      "id": 169,
      "start": 787.2000122070312,
      "end": 792.3200073242188,
      "text": " These things that you did before, this banner in which you lived and behaved, your former"
    },
    {
      "id": 170,
      "start": 792.3200073242188,
      "end": 797.5999755859375,
      "text": " conversation that was according to the old man, that we've been born again, and so the"
    },
    {
      "id": 171,
      "start": 797.5999755859375,
      "end": 802.1599731445312,
      "text": " things that we used to do, we don't do those things anymore, we're new creatures, we're"
    },
    {
      "id": 172,
      "start": 802.280029296875,
      "end": 807.239990234375,
      "text": " in Christ, and so Paul is going through and giving all of this instruction, and you find"
    },
    {
      "id": 173,
      "start": 807.239990234375,
      "end": 812.8400268554688,
      "text": " that he comes to verse number 31, and he says this, let all bitterness and wrath and anger"
    },
    {
      "id": 174,
      "start": 812.8400268554688,
      "end": 818.0800170898438,
      "text": " and clamor and evil speaking be put away from you with all malice."
    },
    {
      "id": 175,
      "start": 818.0800170898438,
      "end": 827.1599731445312,
      "text": " And then notice verse 32, and be kind one to another, tenderhearted, forgiving one another."
    },
    {
      "id": 176,
      "start": 827.1599731445312,
      "end": 832.760009765625,
      "text": " And then he tells us this at the end of the verse, and it's so important that we understand"
    },
    {
      "id": 177,
      "start": 832.760009765625,
      "end": 839.9199829101562,
      "text": " this perspective really that is given to us at the end of verse number 32, even as God,"
    },
    {
      "id": 178,
      "start": 839.9199829101562,
      "end": 843.280029296875,
      "text": " for Christ's sake, hath forgiven you."
    },
    {
      "id": 179,
      "start": 843.280029296875,
      "end": 845.5999755859375,
      "text": " Aren't you thankful to be forgiven?"
    },
    {
      "id": 180,
      "start": 845.5999755859375,
      "end": 851.6400146484375,
      "text": " I mean honestly, to know that we have been forgiven, of course if you were to be mindful"
    },
    {
      "id": 181,
      "start": 851.6400146484375,
      "end": 859.8800048828125,
      "text": " of the entirety really of the thought, the theme, or the tenor of this book of Ephesians,"
    },
    {
      "id": 182,
      "start": 859.8800048828125,
      "end": 864.9199829101562,
      "text": " you'll remember that in chapter number 2, that Paul dealt with their former conversation"
    },
    {
      "id": 183,
      "start": 864.9199829101562,
      "end": 872.1599731445312,
      "text": " that they were dead in their trespasses and sins, and yet God, who is rich in mercy for"
    },
    {
      "id": 184,
      "start": 872.1599731445312,
      "end": 877.4400024414062,
      "text": " his great love wherewith he had loved us, and how they'd been born again, and just the"
    },
    {
      "id": 185,
      "start": 877.4400024414062,
      "end": 882.5599975585938,
      "text": " transformation that took place in their lives, and now when Paul is teaching them on the"
    },
    {
      "id": 186,
      "start": 882.5599975585938,
      "end": 888.280029296875,
      "text": " subject matter of forgiving one another, Paul says that they are to be mindful and have"
    },
    {
      "id": 187,
      "start": 888.280029296875,
      "end": 896.4000244140625,
      "text": " this perspective, even as God, for Christ's sake, hath forgiven you."
    },
    {
      "id": 188,
      "start": 896.4000244140625,
      "end": 901.52001953125,
      "text": " Almighty God has forgiven us, and therefore we ought to forgive others."
    },
    {
      "id": 189,
      "start": 901.52001953125,
      "end": 907.9600219726562,
      "text": " We see this principle that is given to us when the Lord Jesus Christ is giving this"
    },
    {
      "id": 190,
      "start": 907.9600219726562,
      "end": 914.3599853515625,
      "text": " response to the disciples and teaching them on this model, this framework for prayer,"
    },
    {
      "id": 191,
      "start": 914.3599853515625,
      "end": 919.0800170898438,
      "text": " for we also forgive everyone that is indebted to us."
    },
    {
      "id": 192,
      "start": 919.0800170898438,
      "end": 924.0399780273438,
      "text": " You know, the problem I've heard over the years where individuals have made some sort"
    },
    {
      "id": 193,
      "start": 924.0399780273438,
      "end": 927.3599853515625,
      "text": " of statement, well they don't deserve to be forgiven."
    },
    {
      "id": 194,
      "start": 927.3599853515625,
      "end": 935.3599853515625,
      "text": " We need to be careful, because the reality is that we, while we were yet sinners, Christ"
    },
    {
      "id": 195,
      "start": 935.3599853515625,
      "end": 938.3599853515625,
      "text": " died for us, Romans 5."
    },
    {
      "id": 196,
      "start": 938.3599853515625,
      "end": 944.6799926757812,
      "text": " And we understand that God's grace and his mercy that was abundant towards us in forgiving"
    },
    {
      "id": 197,
      "start": 944.6799926757812,
      "end": 951.4000244140625,
      "text": " us, and when we are mindful and we're living with that perspective, it will certainly enable"
    },
    {
      "id": 198,
      "start": 951.4000244140625,
      "end": 956.4400024414062,
      "text": " us to be able to forgive those that would offend us, that would sin against us."
    },
    {
      "id": 199,
      "start": 956.52001953125,
      "end": 960.9199829101562,
      "text": " Let's go back to Matthew 18, if you will, and notice the response that Jesus gives to"
    },
    {
      "id": 200,
      "start": 960.9199829101562,
      "end": 963.0,
      "text": " this inquiry of Peter."
    },
    {
      "id": 201,
      "start": 963.0,
      "end": 968.52001953125,
      "text": " Remember, as we mentioned a few moments ago, Peter says, how oft, Lord, shall my brother"
    },
    {
      "id": 202,
      "start": 968.52001953125,
      "end": 972.719970703125,
      "text": " sin against me and I forgive him, till seven times?"
    },
    {
      "id": 203,
      "start": 972.719970703125,
      "end": 981.239990234375,
      "text": " And Jesus saith unto him, verse number 22 of Matthew 18, I say not unto thee until seven"
    },
    {
      "id": 204,
      "start": 981.239990234375,
      "end": 989.5999755859375,
      "text": " times, but until seventy times seven."
    },
    {
      "id": 205,
      "start": 989.5999755859375,
      "end": 995.9600219726562,
      "text": " We are familiar with this portion of Scripture, and we know the way in which the Lord responds,"
    },
    {
      "id": 206,
      "start": 995.9600219726562,
      "end": 1002.1199951171875,
      "text": " and you understand that here in this text that Jesus is not telling Peter to keep some"
    },
    {
      "id": 207,
      "start": 1002.1199951171875,
      "end": 1008.5599975585938,
      "text": " type of a logbook and to count the number of times in which the individual would sin"
    },
    {
      "id": 208,
      "start": 1008.5599975585938,
      "end": 1013.1599731445312,
      "text": " against him, and once he reaches 490, it's done."
    },
    {
      "id": 209,
      "start": 1013.1599731445312,
      "end": 1017.47998046875,
      "text": " I have no more opportunity to forgive you of this offense."
    },
    {
      "id": 210,
      "start": 1017.47998046875,
      "end": 1025.0400390625,
      "text": " No, that wasn't the idea, to keep a logbook and to count up to that number."
    },
    {
      "id": 211,
      "start": 1025.0400390625,
      "end": 1030.56005859375,
      "text": " The message in which Jesus is communicating to Peter and to the other disciples and to"
    },
    {
      "id": 212,
      "start": 1030.56005859375,
      "end": 1035.8399658203125,
      "text": " us as the Word of God has been preserved for us this evening, is understood that we are"
    },
    {
      "id": 213,
      "start": 1035.8399658203125,
      "end": 1041.9200439453125,
      "text": " to forgive continually, perpetually, as they come and they seek forgiveness that we would"
    },
    {
      "id": 214,
      "start": 1041.9200439453125,
      "end": 1047.8800048828125,
      "text": " forgive, we need to be careful of guarding against bitterness in our own hearts, in our"
    },
    {
      "id": 215,
      "start": 1047.8800048828125,
      "end": 1049.9599609375,
      "text": " own lives."
    },
    {
      "id": 216,
      "start": 1049.9599609375,
      "end": 1055.5999755859375,
      "text": " In Luke 17, we mentioned a moment ago about the instruction of Jesus, and we understand"
    },
    {
      "id": 217,
      "start": 1055.5999755859375,
      "end": 1061.760009765625,
      "text": " again the fact that there will be those that will sin against us, and you notice here in"
    },
    {
      "id": 218,
      "start": 1061.760009765625,
      "end": 1068.0799560546875,
      "text": " Luke 17, in verse number 4, Jesus continues his teaching and says,"
    },
    {
      "id": 219,
      "start": 1068.0799560546875,
      "end": 1074.6800537109375,
      "text": " And if he trespass against thee seven times in a day, and seven times in a day turn again"
    },
    {
      "id": 220,
      "start": 1074.6800537109375,
      "end": 1078.56005859375,
      "text": " to thee, saying, I repent, thou shalt forgive him."
    },
    {
      "id": 221,
      "start": 1078.56005859375,
      "end": 1083.719970703125,
      "text": " And so it's a little bit different of a context of what Peter had asked and the answer that"
    },
    {
      "id": 222,
      "start": 1083.719970703125,
      "end": 1088.280029296875,
      "text": " he received in Matthew chapter number 18, and Jesus is saying here, if seven times in"
    },
    {
      "id": 223,
      "start": 1088.280029296875,
      "end": 1093.239990234375,
      "text": " a day, and he repents, then you forgive him, thou shalt forgive him."
    },
    {
      "id": 224,
      "start": 1093.239990234375,
      "end": 1096.719970703125,
      "text": " And I want you to notice the response of the apostles as it's recorded for us in verse"
    },
    {
      "id": 225,
      "start": 1096.719970703125,
      "end": 1103.43994140625,
      "text": " number 5, and the apostles said unto the Lord, increase our faith."
    },
    {
      "id": 226,
      "start": 1103.43994140625,
      "end": 1109.719970703125,
      "text": " And I believe that the response of the apostles here in verse number 5 in understanding this"
    },
    {
      "id": 227,
      "start": 1109.719970703125,
      "end": 1116.8800048828125,
      "text": " thing, this teaching subject of forgiveness, is that we need the help of God, especially"
    },
    {
      "id": 228,
      "start": 1116.8800048828125,
      "end": 1121.760009765625,
      "text": " in dealing with someone that would be a repeated offender, as is what's being dealt with here"
    },
    {
      "id": 229,
      "start": 1121.760009765625,
      "end": 1124.56005859375,
      "text": " in this text of Scripture."
    },
    {
      "id": 230,
      "start": 1124.56005859375,
      "end": 1131.52001953125,
      "text": " That we would have God's help and God's grace as we would seek to have that forgiving spirit"
    },
    {
      "id": 231,
      "start": 1131.52001953125,
      "end": 1133.8399658203125,
      "text": " that would be evident in the people of God."
    },
    {
      "id": 232,
      "start": 1133.8399658203125,
      "end": 1138.280029296875,
      "text": " Notice with me over in Hebrews chapter number 12, and this is really what we seek to guard"
    },
    {
      "id": 233,
      "start": 1138.280029296875,
      "end": 1145.3199462890625,
      "text": " against as we would understand the importance of forgiveness in our lives, and we'd understand"
    },
    {
      "id": 234,
      "start": 1145.3199462890625,
      "end": 1148.47998046875,
      "text": " the potential for bitterness."
    },
    {
      "id": 235,
      "start": 1148.47998046875,
      "end": 1151.719970703125,
      "text": " There's some people that are bitter in our world."
    },
    {
      "id": 236,
      "start": 1151.719970703125,
      "end": 1153.6800537109375,
      "text": " There's some people that are bitter in churches."
    },
    {
      "id": 237,
      "start": 1153.6800537109375,
      "end": 1160.43994140625,
      "text": " I've heard evangelists make statements of times in which they've gone to preach in revival"
    },
    {
      "id": 238,
      "start": 1160.43994140625,
      "end": 1165.8800048828125,
      "text": " meetings and as they've been in revival meetings, they have witnessed where there would be some"
    },
    {
      "id": 239,
      "start": 1165.8800048828125,
      "end": 1171.8399658203125,
      "text": " people in the church that had not spoken to one another for numbers of years because of"
    },
    {
      "id": 240,
      "start": 1171.8399658203125,
      "end": 1175.280029296875,
      "text": " some falling out that they had."
    },
    {
      "id": 241,
      "start": 1175.280029296875,
      "end": 1181.1600341796875,
      "text": " Palmer Sean has shared a number of examples over the years, and no doubt Brother Sommerdorf"
    },
    {
      "id": 242,
      "start": 1181.1600341796875,
      "end": 1187.3199462890625,
      "text": " and Brother Hummel and others that we have had that have come and shared this pulpit"
    },
    {
      "id": 243,
      "start": 1187.3199462890625,
      "end": 1195.800048828125,
      "text": " with us in revival meetings, they have seen bitterness even amongst the people of God."
    },
    {
      "id": 244,
      "start": 1195.800048828125,
      "end": 1200.8599853515625,
      "text": " We see in verse number 15 of Hebrews 12 where the Bible says, looking diligently, lest any"
    },
    {
      "id": 245,
      "start": 1200.9000244140625,
      "end": 1206.93994140625,
      "text": " man fail of the grace of God, lest any root of bitterness springing up trouble you, and"
    },
    {
      "id": 246,
      "start": 1206.93994140625,
      "end": 1211.3399658203125,
      "text": " thereby many be defiled."
    },
    {
      "id": 247,
      "start": 1211.3399658203125,
      "end": 1216.699951171875,
      "text": " Bitterness is a real danger, and there are people in our world, there are people in our"
    },
    {
      "id": 248,
      "start": 1216.699951171875,
      "end": 1221.1400146484375,
      "text": " world, but there are people in our churches that are struggling with this thing of bitterness."
    },
    {
      "id": 249,
      "start": 1221.1400146484375,
      "end": 1222.97998046875,
      "text": " They're bitter."
    },
    {
      "id": 250,
      "start": 1222.97998046875,
      "end": 1229.1400146484375,
      "text": " Something that took place maybe recently, maybe years ago, and they just won't let go"
    },
    {
      "id": 251,
      "start": 1229.219970703125,
      "end": 1234.4200439453125,
      "text": " of it, they won't forgive, and they're holding on to that, and they're bitter."
    },
    {
      "id": 252,
      "start": 1234.4200439453125,
      "end": 1237.300048828125,
      "text": " Bitterness has grown in them."
    },
    {
      "id": 253,
      "start": 1237.300048828125,
      "end": 1244.1800537109375,
      "text": " And someone has wisely said that bitterness will destroy the vessel in which it's stored"
    },
    {
      "id": 254,
      "start": 1244.1800537109375,
      "end": 1248.5400390625,
      "text": " more than the vessel on which it is poured."
    },
    {
      "id": 255,
      "start": 1248.5400390625,
      "end": 1252.219970703125,
      "text": " And I think that's a very wise statement that someone made."
    },
    {
      "id": 256,
      "start": 1252.219970703125,
      "end": 1258.1400146484375,
      "text": " It's not original with me, but it's a very appropriate saying with regard to the subject"
    },
    {
      "id": 257,
      "start": 1258.1400146484375,
      "end": 1259.9000244140625,
      "text": " matter of bitterness."
    },
    {
      "id": 258,
      "start": 1259.9000244140625,
      "end": 1265.3800048828125,
      "text": " And the reality this evening, there are some people, somebody could be bitter at someone,"
    },
    {
      "id": 259,
      "start": 1265.3800048828125,
      "end": 1270.8599853515625,
      "text": " and the individual that you're bitter at, they probably have no idea that you're bitter"
    },
    {
      "id": 260,
      "start": 1270.8599853515625,
      "end": 1278.6199951171875,
      "text": " at them, that you have an unforgiving spirit, and that you got this animosity towards them,"
    },
    {
      "id": 261,
      "start": 1278.6199951171875,
      "end": 1283.0999755859375,
      "text": " and you don't want to see them, you don't want to bump into them, whatever."
    },
    {
      "id": 262,
      "start": 1283.0999755859375,
      "end": 1285.699951171875,
      "text": " They probably don't even know."
    },
    {
      "id": 263,
      "start": 1285.699951171875,
      "end": 1291.5400390625,
      "text": " It's not affected them, but for us, if we would allow that bitterness to spring up within"
    },
    {
      "id": 264,
      "start": 1291.5400390625,
      "end": 1298.780029296875,
      "text": " us, it can destroy us, cause us to have a lack of ability to minister appropriately"
    },
    {
      "id": 265,
      "start": 1298.780029296875,
      "end": 1300.219970703125,
      "text": " and what have you."
    },
    {
      "id": 266,
      "start": 1300.219970703125,
      "end": 1305.3399658203125,
      "text": " And so this evening, we're mindful of this model again that we see in Luke chapter 11,"
    },
    {
      "id": 267,
      "start": 1305.3399658203125,
      "end": 1310.219970703125,
      "text": " and we've taken piece by piece and looking at these individual statements that Jesus"
    },
    {
      "id": 268,
      "start": 1310.219970703125,
      "end": 1316.4200439453125,
      "text": " gives to these disciples in providing a model prayer framework for our prayer, that as we"
    },
    {
      "id": 269,
      "start": 1316.4200439453125,
      "end": 1323.5400390625,
      "text": " would seek forgiveness from our God, understanding that He is a forgiving God, that He's full"
    },
    {
      "id": 270,
      "start": 1323.5400390625,
      "end": 1330.6600341796875,
      "text": " of mercy and grace, that He's ready to pardon and ready to forgive, that we also are mindful"
    },
    {
      "id": 271,
      "start": 1330.6600341796875,
      "end": 1338.8599853515625,
      "text": " of the importance of us as believers, of followers of Jesus Christ, of having a forgiving spirit."
    },
    {
      "id": 272,
      "start": 1339.06005859375,
      "end": 1345.699951171875,
      "text": " Not allowing any bitterness to creep within our lives, but to have that spirit of forgiveness."
    },
    {
      "id": 273,
      "start": 1345.699951171875,
      "end": 1350.5400390625,
      "text": " As we look at this passage in Luke chapter 11, again, we've purposed to go very slow"
    },
    {
      "id": 274,
      "start": 1350.5400390625,
      "end": 1355.97998046875,
      "text": " through this and to be mindful of this framework, and I hope that over this series of messages"
    },
    {
      "id": 275,
      "start": 1355.97998046875,
      "end": 1361.0999755859375,
      "text": " as we've sought to just dig in and to give some framework, that it would help us in our"
    },
    {
      "id": 276,
      "start": 1361.0999755859375,
      "end": 1367.5400390625,
      "text": " individual prayer lives, that we have maybe over the last five or six weeks of studying"
    },
    {
      "id": 277,
      "start": 1367.5400390625,
      "end": 1375.739990234375,
      "text": " this portion of Scripture, that we have seen our own personal prayer time grow and develop"
    },
    {
      "id": 278,
      "start": 1375.739990234375,
      "end": 1380.5400390625,
      "text": " through understanding the framework that God provides for us."
    },
    {
      "id": 279,
      "start": 1380.5400390625,
      "end": 1387.780029296875,
      "text": " And prayer, again, is not some religious exercise that we just, well, I said my prayers today,"
    },
    {
      "id": 280,
      "start": 1387.780029296875,
      "end": 1392.4599609375,
      "text": " and well, God bless this person and bless that person and bless them as well, and there's"
    },
    {
      "id": 281,
      "start": 1392.4599609375,
      "end": 1398.5,
      "text": " so much more to prayer, communing with our God, and as we would spend that time of adoring"
    },
    {
      "id": 282,
      "start": 1398.5,
      "end": 1405.06005859375,
      "text": " Him and exalting Him and being mindful of who He is, and then looking as we've continued"
    },
    {
      "id": 283,
      "start": 1405.06005859375,
      "end": 1409.699951171875,
      "text": " to move our way through next week, we'll look at this last statement of verse number four,"
    },
    {
      "id": 284,
      "start": 1409.699951171875,
      "end": 1414.93994140625,
      "text": " and consider the, lead us not into temptation, but deliver us from evil, and we'll look at"
    },
    {
      "id": 285,
      "start": 1414.93994140625,
      "end": 1419.4599609375,
      "text": " some other principles throughout the Word of God with regard to prayer, and again, I'm"
    },
    {
      "id": 286,
      "start": 1419.4599609375,
      "end": 1424.06005859375,
      "text": " so thankful for the privilege of prayer, and I hope this evening that as we consider"
    },
    {
      "id": 287,
      "start": 1424.06005859375,
      "end": 1429.6199951171875,
      "text": " this thought, that we would be mindful of the importance of a forgiving spirit as the"
    },
    {
      "id": 288,
      "start": 1429.6199951171875,
      "end": 1434.0999755859375,
      "text": " people of God, that we would not be in a place where they say, well, they don't deserve it,"
    },
    {
      "id": 289,
      "start": 1434.0999755859375,
      "end": 1439.739990234375,
      "text": " and that we'd allow bitterness to destroy us, but that we would be forgiving."
    },
    {
      "id": 290,
      "start": 1439.739990234375,
      "end": 1446.6199951171875,
      "text": " Remember, even as God, for Christ's sake, hath forgiven you, I'm so thankful."
    },
    {
      "id": 291,
      "start": 1446.6199951171875,
      "end": 1450.5799560546875,
      "text": " I know this evening if I were to ask, and if you'd be honest, if you've ever had to"
    },
    {
      "id": 292,
      "start": 1450.5799560546875,
      "end": 1456.97998046875,
      "text": " confess the same sin more than once, you'd probably say yes, you'd answer in the affirmative,"
    },
    {
      "id": 293,
      "start": 1456.97998046875,
      "end": 1463.4200439453125,
      "text": " and I'm so thankful that God still forgives, and even though we might mess up multiple"
    },
    {
      "id": 294,
      "start": 1463.4200439453125,
      "end": 1470.5799560546875,
      "text": " times in the same day and the same offense, God forgives, and oh, that we would be Christ-like,"
    },
    {
      "id": 295,
      "start": 1470.5799560546875,
      "end": 1474.739990234375,
      "text": " and that we would also offer forgiveness to those that would sin against us."
    },
    {
      "id": 296,
      "start": 1474.9000244140625,
      "end": 1479.699951171875,
      "text": " Father, we love You. We thank You for loving us. We thank You for the Word of God, the truth"
    },
    {
      "id": 297,
      "start": 1479.699951171875,
      "end": 1485.0999755859375,
      "text": " contained therein, and I pray that You would help us to have a forgiving spirit. Lord, that we would"
    },
    {
      "id": 298,
      "start": 1485.0999755859375,
      "end": 1491.699951171875,
      "text": " guard against bitterness in our lives, that we would be mindful of the grace and mercy that has"
    },
    {
      "id": 299,
      "start": 1491.699951171875,
      "end": 1496.93994140625,
      "text": " been extended to us, and that we, in like fashion, would seek to be gracious and merciful to those"
    },
    {
      "id": 300,
      "start": 1496.93994140625,
      "end": 1501.739990234375,
      "text": " that we interact with here upon earth. We pray that You'd bless our time of prayer. We pray that"
    },
    {
      "id": 301,
      "start": 1501.739990234375,
      "end": 1506.02001953125,
      "text": " You'd be honored and glorified through all that we say and do. For it's in Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T07:09:34.352959"
}