{
  "video_id": "ApQwzzTJDiU",
  "text": "number three, and last week we finished up 1 Thessalonians 5, and as I told you at the very beginning of this sermon series here on Wednesday evenings, that we would go through the latter portion of 1 Thessalonians 5, and then skip over to 2 Thessalonians chapter number three. In both of these passages we find that there's concise instruction that is provided that is worthy of our review and study, and of course, as you know, we've titled the series here on Wednesday evening, Walk Worthy, Please God. And this second letter to the believers in Thessalonica is written, it's really written shortly after the first letter. There's not a lot of time that lapses between the writing of the two letters. I do want you to know, if you look at 2 Thessalonians chapter two, I know that you, I mentioned already that it will be in chapter three, but look in chapter two, if you will, in verse number one, because God gives us some insight with regard to the reason of this letter being written as quickly after the first letter was written as it is. It says this in verse number one, Now we beseech you, brethren, by the coming of our Lord Jesus Christ and by our gathering together unto Him. Notice what he says, that ye be not soon shaken in mind or be troubled neither by spirit nor by word nor by letter as from us, as that that day of Christ, as that the day of Christ is at hand. Let no man deceive you by any means. For that day, what day? The day of Christ, that day shall not come except there come a falling away first and that man of sin be revealed the son of perdition. So as we look at these first three verses of 2 Thessalonians chapter two, we understand that there are some false teachers that were seeking to confuse and influence the believers in Thessalonica. It's interesting the means by which false teachers take and here specifically God gives us insight in verse number two that Paul says this nor by letter as from us. That's quite interesting because basically what we understand to be taking place is someone, these false teachers, either an individual or a group, they sent a letter to the church at Thessalonica indicating that it was from Paul and giving teaching instruction that was contrary to what Paul had previously given which caused for a great level of confusion. And we find that the apostle Paul of course, God knowing all things, all scripture being given by inspiration of God, we find that this second letter is sent and it's sent for really a variety of reasons. Number one, it would provide comfort. We find that it would provide correction and it would provide instruction and we see all three of those elements at work in 2 Thessalonians, just three chapters, and as you study through the chapters you find that the apostle Paul is comforting, correcting, and instructing. And all of those things are necessary by the way of the spiritual leader. He says, let no man deceive you by any means in verse number three. And we understand even as I preached on Sunday morning that there are those that lie in wait to deceive and their cunning craftiness and all that they do. And we find that the apostle Paul is seeking under the inspiration of the Holy Spirit of God to provide the believers in Thessalonica some instruction and some correction and some comfort. The closing section of the letter, the third chapter beginning in verse number six is similar to the first letter in that the words that are provided, these words of instruction again, are these concise statements that God gives to the church. Now, they're not as concise as they were in the first book. In 1 Thessalonians chapter five, you look at that text of scripture and in some of them, verse 14, for instance, there were four pieces of instruction in one verse. And you find in rejoice evermore, pray without ceasing and everything give thanks for this is the will of God in Christ Jesus concerning you, despise not prophesies. I mean, it's just bam, bam, bam. It's not quite as concise in the second letter, but we find that the instruction is given. And obviously there's already been a first letter provided. We've already studied that and that helps us understand some of what is now being written the second time. Now, as you consider verses seven through nine of our text this evening, you'll see two truths. We're going to look at verses six through 10, but let me just, by way of introduction, read to you verses seven through nine and deal with two truths that God reveals to us. Notice in verse number seven, Paul says this, for yourselves know how ye ought to follow us, for we behave not ourselves disorderly among you, neither did we eat any man's bread for naught, but wrought with labor and travail night and day that we might not be chargeable to any of you. Not because we have not power, but to make ourselves an example unto you to follow this or follow us. So we find that there are two truths that are revealed to us in these few verses of Scripture. Number one is this, the believers at Thessalonica had been previously instructed. He says for yourselves know how you ought to follow us, and we go back and you can understand in the first letter how that Paul references back to the time that he was in Thessalonica ministering, but also in the content of the first letter of the first Thessalonians, the first letter to the church, we find that the instruction is provided, the truth is given. We find also in these verses of Scripture, not only had they been given truth and provided with instruction, but the believers had an example to follow. The apostle Paul says for we behave not ourselves in verse number seven disorderly among you. He goes on to describe their behavior, their manner of living while they were there in Thessalonica, and he says that it was to set forth an example. Notice in verse number nine, but to make ourselves an example unto you to follow us. And so it's interesting to me, and I appreciate the way that God works and how God ministers to his people. He provides instruction, but then he also gives an example. Some of us are able to learn very well just by reading something, others of us need to see it done, right? There's different ways of learning, and we're not going to deal with that extensively this evening, but I love the fact that God gives not only the instruction, but the apostle Paul says we were an example to you as well. And so as we look at this text of Scripture, the statement in verse number seven where he says that we behave not ourselves disorderly among you, gives us some insight with regard to the subject matter that Paul is going to address in this text of Scripture, and that is this, those that were walking disorderly. I've titled the message this evening, Disorderly Behavior. Disorderly Behavior, 2 Thessalonians 3 verses 6 through 10. As we look at the portion of Scripture, the Bible says in verse number six, now we command you. Again, as we look at the first letter, we find that God would give this instruction, he says we beseech you in verse 12 of chapter 5, we exhort you in verse 14 of chapter 5, I charge you in verse 27. And so we come to the third chapter, in verse number six, Paul says now we command you. Now I like the language because it's not simply a suggestion. You ever give someone a suggestion, expecting that they're going to receive it as a command? But it was a suggestion. So you thought that when you suggested something, that it meant that they were going to do that thing. But it was just a suggestion, so they said, nah, I don't think I want to do that. And the reality is that here, Paul is not making a suggestion, God's not making a suggestion, he says now we command you. And I like the clarity of the statement, I like the fact that there's no ambiguity, it's clear. So we command you what? Now we command you brethren, in the name of our Lord Jesus Christ, that ye withdraw yourselves from every brother that walketh disorderly, and not after the tradition which he received of us. We read verses seven through nine, I'll read them again, for yourselves know how you ought to follow us, for we behave not ourselves disorderly among you, neither did we eat any man's bread for naught, but wrought with labor and travail night and day, that we might not be chargeable to any of you. Not because we have not power, but to make ourselves an example unto you to follow us. Now verse 10 says this, for even when we were with you, this we commanded you, that if any should not work, neither should he eat. And so we look at this text of Scripture and we find that Paul is addressing those that are walking disorderly, disorderly behavior is the content, the subject matter in verses six through 10. If you're taking notes, number one, identify disorderly behavior. We need to learn how to identify disorderly behavior. And it's important that as we look here at this text of Scripture, you notice in verse number six that there were some within the church that were walking disorderly. It was not something where the Apostle Paul was saying it may be at some point in your future that no there were some that were walking disorderly and we see that in verse number six it says that you withdraw yourselves from every brother that walketh disorderly and so we find that we understand that of the church in Thessalonica again a model church a good church but there were some that were walking disorderly and so we find that we must be able to identify disorderly behavior and Paul gives us some insight here there's at least one example in the text of scripture that is provided to us with regard to the disorderly behavior that is the subject by which the church in Thessalonica is dealing with in verse number 10 the the disorderly behavior is a failure to work and notice he says for even when we were with you this we commanded you so it was something that had been previously commanded that if any would not work neither should he eat now no work no food I know that's not popular today man and the reality is that he's not referring to people that cannot work he's referring to people that will not work all right there's a difference between those who cannot legitimately they cannot work and those who just simply will not work there's a difference and here what God is dealing with is those that will not work they have the ability to work but they will not work and God says that listen if they don't work there's no food and so the disorderly behavior has to be identified now as we look at this text of scripture and we understand the importance of identifying disorderly behavior we know that not only does it need to be identified but number two it needs to be corrected it needs to be corrected now it's interesting the word disorderly in verse 6 and then again in verse number 7 of 2nd Thessalonians 3 this word is given to us and this word is is derived from the same Greek word that is translated unruly in the first letter and so in the first letter in 1st Thessalonians 5 in verse number 14 the Bible says this now we exhort you brethren warn them that are unruly I'm not gonna read the rest of the verse because it's that phrase that is pertinent to our subject matter this evening and he says warn them that are unruly I taught on that a number of weeks ago and we find that here when he speaks about those that are disorderly it's not the same word but it's derived from the word that is translated unruly and so we understand there's a a connection between unruly and disorderly almost being used synonymously if you will and we find that here in chapter number 5 of the previous letter now remember there's not a lot of time that passes between the writing of 1st Thessalonians and the writing of 2nd Thessalonians and it seems as if when you think about this correcting the the disorderly behavior there are at least two possibilities at play here number one the believers in Thessalonica were not warning the unruly or the disorderly they weren't warning them now I tend to think that's not what was going on I tend to believe that what happened because Paul had mentioned how that he believed that they would do what he commanded them I believe really what was happening is that the unruly and the disorderly were not heeding the warning you know you can give a warning but you can't make the person heed it amen I told a story years ago and I think I've told it twice from the pulpit there was a pastor and his wife leaving a church in the south and they were leaving on a Sunday morning they were trying to hustle to get somewhere for lunch or whatever they were doing and they came to a railroad crossing the lights were flashing the bars were down and he said I can make it he goes to try to go around the bars hit by a train both of them killed whose fault is it it's his fault the warning was there he just didn't heed the warning right we've all been in circumstances and situations where we have experienced times in our own lives where we did not heed the warning or like man they warned me about that or that whatever there was a label that warned about the potential of this happening and I didn't heed the warning and now this is the consequence the result so I believe that really what's happening here in Thessalonica was that the warnings were provided but they simply weren't heeding the warning now we're gonna think about what's going on and understand the context and obviously the the reason that Paul is writing to these believers a second time so quickly those false teachers that were seeking to confuse and to influence the believers here's what was happening we saw in chapter 2 in verse number 2 they were telling him that the day of Christ was at hand so here's what was happening as people were saying well we don't need to work then we don't need to work and I remember I can't remember the year I know that Harold Camping said 88 reasons that Christ has come back in 1988 and that didn't happen and so he had to write something else and I don't know Harold Camping made all kinds of declarations with naming years he never read the part where it says no man know at the hour and anyhow he's he's no longer alive but but he I think it was somewhere early in the 2000s he made another huge declaration and there were people selling all of their goods there are people quitting their jobs and they were doing all this stuff to go on the road and and try to announce that Jesus is coming on this particular day and he didn't and they didn't have anything and they didn't have a job and it was Harold Camping didn't take care of him he didn't pay for all their expenses and it was a real problem so what was happening here is because of this false teaching it was influencing some people say well then we don't there's no need for us to work no the principles that you you work you provide for your own you work so that you could have and if you don't work you don't eat and so we find that when we consider the text of Scripture and we couple it with what we've just studied in 1st Thessalonians chapter number 5 that just because we're able to identify disorderly behavior and even if we do our part to correct disorderly behavior it doesn't mean that the the guilty party is going to respond favorably right we agree with that and so we find that what's happening here is the Apostle Paul is now going to provide us with the the next step and so if you're taking notes number three separate from disorderly brethren now I understand that that this is not easy nor is it typically desired but we find that here in the text of Scripture Paul makes it extremely clear in verse number six notice he says now we command you we made point of that earlier but he says we command you brethren notice in the name of our Lord Jesus Christ that ye withdraw yourselves from every brother that walketh disorderly and not after the tradition which he received of us now later on in the text in a future lesson we're gonna find that there's another truth of admonition that is given to have no company with someone but that's someone who actually has some doctrinal differences with regard to he says in verse 14 if any man obey not our word by this epistle note that man and have no company with him that he may be ashamed we don't count him as an enemy according to verse 15 but admonish him as a brother but the reality is that their separation here in verses six through ten he's talking about these that have are guilty of being unruly or disorderly in their behavior and Paul says that were to withdraw ourselves the the word literally means to remove yourself it literally means to depart from now understand with me this evening again that this is not easy nor is it often desired but the instruction is clear and this is not a circumstance or a situation where someone is disorderly on one occasion and we immediately say I can't have any no they were warned they were corrected there was a measure of time and by the way let me say this oftentimes if we're not careful when we think about the circumstances in life we enjoy it greatly when individuals and especially when God is long-suffering toward us but when others and God are long-suffering towards others sometimes we don't have patience for that does that make sense what I just said so I like it when God is long-suffering with me I like it when people are long-suffering with me you ever interact with somebody that has no patience with you and you're trying to work through something so listen can you just be patient like I'm trying to and they're just they don't want to hear it they're just and we we like when people are long-suffering and patient with us but if we see somebody if we think that there's somebody that's walking disorderly and we don't know all of the the steps that have been taken sometimes we might come to the place of why isn't that dealt with yet Well, maybe you don't know how it's being dealt with, and the manner by which it's being dealt with, and the fact that there's a measure of longsuffering, that if you were in the circumstance and the situation, you would appreciate the longsuffering. And so we find that this is not just immediate first offense, bam, you're done. It's a situation where this is a behavior that has developed, and the warning has been given, but there's no heeding the warning. So what's the step? Withdrawal. Separate. Now, remember, those behaving disorderly will influence others. Amen? We've all at some point in our lives heard someone, and maybe we were the ones speaking the words about the bad apple. The bad apple doesn't make the, it's going to make the good apples bad if you keep it together. The good apples, I don't care how many good apples you put in there, they're never going to make the bad apple good. We've used that. We've heard it. But we find that biblically, God reveals to us the truth of influence, and those that are walking disorderly will have an influence on the body, on the church. And therefore, we find that this command is given, that Paul is, I mean, he is clear. There's no confusion. He's making it extremely clear. God is providing us with this instruction. Now look back, if you will, at 1 Corinthians chapter 15. 1 Corinthians chapter 15, see, the truth is not just something that your mom or grandma told you about the apple. It's a biblical foundation. It's a truth that God has given us in His Word with regard to relationships and with regard to influence. In 1 Corinthians 15, in verse number 33, it says this, be not deceived. Now anytime a verse starts with those words, you ought to pay close attention. Why? Because the enemy is a liar. He is a deceiver. Amen? And so here, God says, be not deceived. What is it? Evil communications corrupt good manners. How many of you, I don't want you to raise your hand, but just answer it yourself if you have children. How many of you that had children wanted your children to have good friends? Everybody. You don't want your kids running around with the bad kids. You don't want your kids being associated with, no, you want your, you're concerned about the company that your kids keep. Does that just automatically stop when we turn 18 or 21 or 52 or 89 or whatever that, no, evil communications corrupt good manners. It is a biblical truth. In 1 Corinthians 5, in verse number 6, the Bible says a little leaven, leaveneth the whole lump. The doctor tells you, and I don't say this lightly, so please understand, I understand the severity of it, but if the doctor were to tell you that you have cancer, well, just leave it. We're not going to do any, no, we want to get rid of it. Why? Because that cancer is going to spread. And so we want to get rid of it. And so we find that the biblical truths that are provided to us in 1 Corinthians 5, 1 Corinthians 15 help us to understand that those that are behaving disorderly will have an influence on the church. They will have an influence on brothers and sisters in Christ, and so therefore Paul, under the inspiration of the Holy Spirit of God, he says, listen, not only are we to identify disorderly behavior, we are to correct disorderly behavior, and depending on the response of the individual, then ultimately, if there's no positive response to the correction, to the warning that's provided, the next step is to separate from, to withdraw yourselves. Again, I'm not suggesting this evening that this is an easy step or a desired step. I understand relationships, and I understand that there are times in which we'll say, well, we can just set aside those differences, we can just set aside these things, and we have to understand within the context of the church and hear what's taking place in the church in Thessalonica, that Paul speaks expressly under the inspiration of the Holy Spirit of God of how to deal with these matters. I want you to turn to Colossians, and we'll be done this evening, we'll have our prayer time, but turn to the book of Colossians, if you will, in the first chapter. In Colossians chapter number 1, the end of the chapter, the Apostle Paul provides really, if you will, a philosophy of ministry and just his approach to ministry. And he says this in verse 28, verse 27 talks about, with Christ in you, the hope of glory. He says, whom we preach, I just referenced the latter part of verse 27, because he begins verse 28 by saying, whom we preach. We preach Christ, amen, 1 Corinthians. We preach Christ, Christ crucified, Christ alone. He died for us, he was buried and he rose again, and we preach Christ. And Paul says, whom we preach, and then notice this, warning every man, and teaching every man in all wisdom. So we find that there's a preaching, a warning, and a teaching. And so sometimes what happens when there's someone that's disorderly, you warn them, but then what do you need to do? You don't just stop with a warning, you then have to teach them what is appropriate. We find, and we'll mention this again as we go further into 2 Thessalonians chapter 3, when he's dealing with the more doctrinal issue at the end of the text, the reality is that there's some people that can be led astray, you warn them and then you teach them. Sometimes people don't want a warning. Sometimes people don't want to be taught. It's just the way it is. It's a hard thing that you have to acknowledge. I remember Jason Caldwell making a statement when he was here preaching one time. He said, it breaks my heart that there are people that do not know the truth. I agree. He said, but what breaks my heart more than that is there are people who do not want to know the truth. Wow. There are people that just don't want the warning. There are people that just don't want the teaching. But I want you to notice why Paul says we preach Christ, we preach Him whom we preach, warning every man and teaching every man in all wisdom, why? That we may present every man perfect in Christ Jesus. Word perfect is complete. To be complete in Christ. See Paul understood that one day every believer would stand before Christ. Every man must appear before Christ. If you're saved by the grace of God, you will stand before Christ. And so why is Paul preaching and warning and teaching? So that when that day comes, you will be prepared for it. Now will any of us ever be fully prepared? I think not. It's a fearful thing. It ought to cause us to seriously inspect self-examination and we'll stand before Christ one day. But Paul says that this is why we do what we do. Where unto, verse 29, I also labor, striving according to His working which worketh in me mightily. I'm so thankful that God works in us and through us to accomplish His purpose, but you understand that it's still labor. He uses that word labor, he uses the word striving, that it communicates to us the labor that's involved. Now I want you to see in the fourth chapter what it said of Epaphras. Epaphras, our understanding of the church in Colossae, Paul never was there. He had no part in starting the church, he had no interaction with the believers in Colossae save this letter that God inspired and had Paul write to the church that's there in Colossae. And he writes to them, he hears about their salvation and testimony and about their walk according to the first chapter from Epaphras. It's our understanding that he's the pastor of the church. Notice what it says in verse 12 of Colossians 4 about Epaphras. He says, who is one of you a servant of Christ, saluteth you. Notice what it says, always laboring fervently for you in prayers that ye may stand perfect and complete in all the will of God. Wow. What a blessing to have some spiritual leaders that have a concern about individual believers. I'm thankful that in my life I've had some spiritual leaders that cared about me. I understand there are times in which all of us need to be warned about something. None of us are perfect. And we ought to be humble in receiving that warning, and we ought to be responsive. We ought to, if a warning has to be given, that we do follow the process of self-examination and see the legitimacy of the concern that is brought to us so that we can evaluate our own behavior and then correct it if it needs to be corrected. It's important that we take that response. These believers, unfortunately, that are being spoken of in 2 Thessalonians chapter 3 and verses 6 through 10, it appears, based upon the direction of the text and the step of separation, withdraw yourselves, that these that were guilty simply weren't hearing the warning. They weren't heeding the warning. Find them that are unruly. They were told that in 1 Thessalonians 5 verse 14. I believe they did. And yet there were some that continued to walk disorderly. Paul said, no, they've been instructed. They've been given an example. And if they still won't heed, then you have to separate from them. And again, I'm not suggesting this evening that it's an easy thing or even a desired thing, but we need to be careful that we understand the power of influence. And he says, be not deceived. Evil communications will corrupt good manners. Let's pray together. Father, we love You. We thank You for loving us. We thank You for the privilege of knowing You and having Your Word. We thank You for the truth that's contained therein. I pray, Lord, that You would help us to walk worthy, to please You. Lord, help us to walk in obedience to Your Word. Help us, Lord, as we pray tonight. We thank You for the privilege. I pray that You would work through this season of corporate prayer that You'd be glorified and we'll thank You for it in Christ's name we pray. Amen. Anyone not get a prayer bulletin when you came in this evening?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.920000076293945,
      "text": " number three, and last week we finished up 1 Thessalonians 5, and as I told you at the"
    },
    {
      "id": 1,
      "start": 6.920000076293945,
      "end": 12.600000381469727,
      "text": " very beginning of this sermon series here on Wednesday evenings, that we would go through"
    },
    {
      "id": 2,
      "start": 12.600000381469727,
      "end": 18.440000534057617,
      "text": " the latter portion of 1 Thessalonians 5, and then skip over to 2 Thessalonians chapter"
    },
    {
      "id": 3,
      "start": 18.440000534057617,
      "end": 19.719999313354492,
      "text": " number three."
    },
    {
      "id": 4,
      "start": 19.719999313354492,
      "end": 26.440000534057617,
      "text": " In both of these passages we find that there's concise instruction that is provided that"
    },
    {
      "id": 5,
      "start": 26.440000534057617,
      "end": 32.84000015258789,
      "text": " is worthy of our review and study, and of course, as you know, we've titled the series"
    },
    {
      "id": 6,
      "start": 32.84000015258789,
      "end": 37.47999954223633,
      "text": " here on Wednesday evening, Walk Worthy, Please God."
    },
    {
      "id": 7,
      "start": 37.47999954223633,
      "end": 41.79999923706055,
      "text": " And this second letter to the believers in Thessalonica is written, it's really written"
    },
    {
      "id": 8,
      "start": 41.79999923706055,
      "end": 44.52000045776367,
      "text": " shortly after the first letter."
    },
    {
      "id": 9,
      "start": 44.52000045776367,
      "end": 48.720001220703125,
      "text": " There's not a lot of time that lapses between the writing of the two letters."
    },
    {
      "id": 10,
      "start": 48.720001220703125,
      "end": 53.040000915527344,
      "text": " I do want you to know, if you look at 2 Thessalonians chapter two, I know that you, I mentioned"
    },
    {
      "id": 11,
      "start": 53.040000915527344,
      "end": 55.68000030517578,
      "text": " already that it will be in chapter three, but look in chapter two, if you will, in"
    },
    {
      "id": 12,
      "start": 55.68000030517578,
      "end": 61.279998779296875,
      "text": " verse number one, because God gives us some insight with regard to the reason of this"
    },
    {
      "id": 13,
      "start": 61.279998779296875,
      "end": 65.63999938964844,
      "text": " letter being written as quickly after the first letter was written as it is."
    },
    {
      "id": 14,
      "start": 65.63999938964844,
      "end": 71.5999984741211,
      "text": " It says this in verse number one, Now we beseech you, brethren, by the coming of our Lord Jesus"
    },
    {
      "id": 15,
      "start": 71.5999984741211,
      "end": 75.4800033569336,
      "text": " Christ and by our gathering together unto Him."
    },
    {
      "id": 16,
      "start": 75.4800033569336,
      "end": 82.27999877929688,
      "text": " Notice what he says, that ye be not soon shaken in mind or be troubled neither by spirit nor"
    },
    {
      "id": 17,
      "start": 82.27999877929688,
      "end": 90.91999816894531,
      "text": " by word nor by letter as from us, as that that day of Christ, as that the day of Christ"
    },
    {
      "id": 18,
      "start": 90.91999816894531,
      "end": 92.44000244140625,
      "text": " is at hand."
    },
    {
      "id": 19,
      "start": 92.44000244140625,
      "end": 95.5999984741211,
      "text": " Let no man deceive you by any means."
    },
    {
      "id": 20,
      "start": 95.5999984741211,
      "end": 97.76000213623047,
      "text": " For that day, what day?"
    },
    {
      "id": 21,
      "start": 97.76000213623047,
      "end": 104.83999633789062,
      "text": " The day of Christ, that day shall not come except there come a falling away first and"
    },
    {
      "id": 22,
      "start": 104.83999633789062,
      "end": 110.0,
      "text": " that man of sin be revealed the son of perdition."
    },
    {
      "id": 23,
      "start": 110.0,
      "end": 114.44000244140625,
      "text": " So as we look at these first three verses of 2 Thessalonians chapter two, we understand"
    },
    {
      "id": 24,
      "start": 114.44000244140625,
      "end": 119.95999908447266,
      "text": " that there are some false teachers that were seeking to confuse and influence the believers"
    },
    {
      "id": 25,
      "start": 119.95999908447266,
      "end": 121.5999984741211,
      "text": " in Thessalonica."
    },
    {
      "id": 26,
      "start": 121.5999984741211,
      "end": 127.68000030517578,
      "text": " It's interesting the means by which false teachers take and here specifically God gives"
    },
    {
      "id": 27,
      "start": 127.68000030517578,
      "end": 134.60000610351562,
      "text": " us insight in verse number two that Paul says this nor by letter as from us."
    },
    {
      "id": 28,
      "start": 134.60000610351562,
      "end": 139.9600067138672,
      "text": " That's quite interesting because basically what we understand to be taking place is someone,"
    },
    {
      "id": 29,
      "start": 139.9600067138672,
      "end": 144.83999633789062,
      "text": " these false teachers, either an individual or a group, they sent a letter to the church"
    },
    {
      "id": 30,
      "start": 144.83999633789062,
      "end": 151.72000122070312,
      "text": " at Thessalonica indicating that it was from Paul and giving teaching instruction that"
    },
    {
      "id": 31,
      "start": 151.72000122070312,
      "end": 159.16000366210938,
      "text": " was contrary to what Paul had previously given which caused for a great level of confusion."
    },
    {
      "id": 32,
      "start": 159.16000366210938,
      "end": 164.72000122070312,
      "text": " And we find that the apostle Paul of course, God knowing all things, all scripture being"
    },
    {
      "id": 33,
      "start": 164.72000122070312,
      "end": 169.75999450683594,
      "text": " given by inspiration of God, we find that this second letter is sent and it's sent"
    },
    {
      "id": 34,
      "start": 169.75999450683594,
      "end": 171.8800048828125,
      "text": " for really a variety of reasons."
    },
    {
      "id": 35,
      "start": 171.8800048828125,
      "end": 174.1199951171875,
      "text": " Number one, it would provide comfort."
    },
    {
      "id": 36,
      "start": 174.1199951171875,
      "end": 179.1199951171875,
      "text": " We find that it would provide correction and it would provide instruction and we see all"
    },
    {
      "id": 37,
      "start": 179.1199951171875,
      "end": 184.8800048828125,
      "text": " three of those elements at work in 2 Thessalonians, just three chapters, and as you study through"
    },
    {
      "id": 38,
      "start": 184.8800048828125,
      "end": 191.63999938964844,
      "text": " the chapters you find that the apostle Paul is comforting, correcting, and instructing."
    },
    {
      "id": 39,
      "start": 191.63999938964844,
      "end": 196.02000427246094,
      "text": " And all of those things are necessary by the way of the spiritual leader."
    },
    {
      "id": 40,
      "start": 196.02000427246094,
      "end": 200.0,
      "text": " He says, let no man deceive you by any means in verse number three."
    },
    {
      "id": 41,
      "start": 200.0,
      "end": 204.72000122070312,
      "text": " And we understand even as I preached on Sunday morning that there are those that lie in wait"
    },
    {
      "id": 42,
      "start": 204.72000122070312,
      "end": 209.55999755859375,
      "text": " to deceive and their cunning craftiness and all that they do."
    },
    {
      "id": 43,
      "start": 209.55999755859375,
      "end": 213.9600067138672,
      "text": " And we find that the apostle Paul is seeking under the inspiration of the Holy Spirit of"
    },
    {
      "id": 44,
      "start": 213.9600067138672,
      "end": 219.9199981689453,
      "text": " God to provide the believers in Thessalonica some instruction and some correction and some"
    },
    {
      "id": 45,
      "start": 219.9199981689453,
      "end": 220.9600067138672,
      "text": " comfort."
    },
    {
      "id": 46,
      "start": 221.27999877929688,
      "end": 226.0800018310547,
      "text": " The closing section of the letter, the third chapter beginning in verse number six is similar"
    },
    {
      "id": 47,
      "start": 226.0800018310547,
      "end": 232.47999572753906,
      "text": " to the first letter in that the words that are provided, these words of instruction again,"
    },
    {
      "id": 48,
      "start": 232.47999572753906,
      "end": 236.83999633789062,
      "text": " are these concise statements that God gives to the church."
    },
    {
      "id": 49,
      "start": 236.83999633789062,
      "end": 240.24000549316406,
      "text": " Now, they're not as concise as they were in the first book."
    },
    {
      "id": 50,
      "start": 240.24000549316406,
      "end": 247.39999389648438,
      "text": " In 1 Thessalonians chapter five, you look at that text of scripture and in some of them,"
    },
    {
      "id": 51,
      "start": 247.39999389648438,
      "end": 252.32000732421875,
      "text": " verse 14, for instance, there were four pieces of instruction in one verse."
    },
    {
      "id": 52,
      "start": 252.32000732421875,
      "end": 257.20001220703125,
      "text": " And you find in rejoice evermore, pray without ceasing and everything give thanks for this"
    },
    {
      "id": 53,
      "start": 257.20001220703125,
      "end": 260.55999755859375,
      "text": " is the will of God in Christ Jesus concerning you, despise not prophesies."
    },
    {
      "id": 54,
      "start": 260.55999755859375,
      "end": 262.67999267578125,
      "text": " I mean, it's just bam, bam, bam."
    },
    {
      "id": 55,
      "start": 262.67999267578125,
      "end": 269.0,
      "text": " It's not quite as concise in the second letter, but we find that the instruction is given."
    },
    {
      "id": 56,
      "start": 269.0,
      "end": 273.0799865722656,
      "text": " And obviously there's already been a first letter provided."
    },
    {
      "id": 57,
      "start": 273.0799865722656,
      "end": 278.55999755859375,
      "text": " We've already studied that and that helps us understand some of what is now being written"
    },
    {
      "id": 58,
      "start": 278.55999755859375,
      "end": 279.79998779296875,
      "text": " the second time."
    },
    {
      "id": 59,
      "start": 279.79998779296875,
      "end": 283.44000244140625,
      "text": " Now, as you consider verses seven through nine of our text this evening, you'll see"
    },
    {
      "id": 60,
      "start": 283.44000244140625,
      "end": 284.44000244140625,
      "text": " two truths."
    },
    {
      "id": 61,
      "start": 284.44000244140625,
      "end": 288.8399963378906,
      "text": " We're going to look at verses six through 10, but let me just, by way of introduction,"
    },
    {
      "id": 62,
      "start": 288.8399963378906,
      "end": 295.32000732421875,
      "text": " read to you verses seven through nine and deal with two truths that God reveals to us."
    },
    {
      "id": 63,
      "start": 295.32000732421875,
      "end": 302.0,
      "text": " Notice in verse number seven, Paul says this, for yourselves know how ye ought to follow"
    },
    {
      "id": 64,
      "start": 302.0,
      "end": 310.3999938964844,
      "text": " us, for we behave not ourselves disorderly among you, neither did we eat any man's bread"
    },
    {
      "id": 65,
      "start": 310.3999938964844,
      "end": 316.3599853515625,
      "text": " for naught, but wrought with labor and travail night and day that we might not be chargeable"
    },
    {
      "id": 66,
      "start": 316.3599853515625,
      "end": 318.4200134277344,
      "text": " to any of you."
    },
    {
      "id": 67,
      "start": 318.4200134277344,
      "end": 325.67999267578125,
      "text": " Not because we have not power, but to make ourselves an example unto you to follow this"
    },
    {
      "id": 68,
      "start": 325.67999267578125,
      "end": 327.4800109863281,
      "text": " or follow us."
    },
    {
      "id": 69,
      "start": 327.4800109863281,
      "end": 330.760009765625,
      "text": " So we find that there are two truths that are revealed to us in these few verses of"
    },
    {
      "id": 70,
      "start": 330.760009765625,
      "end": 332.0400085449219,
      "text": " Scripture."
    },
    {
      "id": 71,
      "start": 332.0400085449219,
      "end": 338.29998779296875,
      "text": " Number one is this, the believers at Thessalonica had been previously instructed."
    },
    {
      "id": 72,
      "start": 338.29998779296875,
      "end": 344.44000244140625,
      "text": " He says for yourselves know how you ought to follow us, and we go back and you can understand"
    },
    {
      "id": 73,
      "start": 344.44000244140625,
      "end": 350.67999267578125,
      "text": " in the first letter how that Paul references back to the time that he was in Thessalonica"
    },
    {
      "id": 74,
      "start": 350.67999267578125,
      "end": 356.9200134277344,
      "text": " ministering, but also in the content of the first letter of the first Thessalonians, the"
    },
    {
      "id": 75,
      "start": 357.0799865722656,
      "end": 364.17999267578125,
      "text": " first letter to the church, we find that the instruction is provided, the truth is given."
    },
    {
      "id": 76,
      "start": 364.17999267578125,
      "end": 369.44000244140625,
      "text": " We find also in these verses of Scripture, not only had they been given truth and provided"
    },
    {
      "id": 77,
      "start": 369.44000244140625,
      "end": 374.3800048828125,
      "text": " with instruction, but the believers had an example to follow."
    },
    {
      "id": 78,
      "start": 374.3800048828125,
      "end": 380.3999938964844,
      "text": " The apostle Paul says for we behave not ourselves in verse number seven disorderly among you."
    },
    {
      "id": 79,
      "start": 380.3999938964844,
      "end": 386.5199890136719,
      "text": " He goes on to describe their behavior, their manner of living while they were there in"
    },
    {
      "id": 80,
      "start": 386.5199890136719,
      "end": 390.79998779296875,
      "text": " Thessalonica, and he says that it was to set forth an example."
    },
    {
      "id": 81,
      "start": 390.79998779296875,
      "end": 396.6400146484375,
      "text": " Notice in verse number nine, but to make ourselves an example unto you to follow us."
    },
    {
      "id": 82,
      "start": 396.6400146484375,
      "end": 403.6000061035156,
      "text": " And so it's interesting to me, and I appreciate the way that God works and how God ministers"
    },
    {
      "id": 83,
      "start": 403.6000061035156,
      "end": 404.94000244140625,
      "text": " to his people."
    },
    {
      "id": 84,
      "start": 404.94000244140625,
      "end": 410.70001220703125,
      "text": " He provides instruction, but then he also gives an example."
    },
    {
      "id": 85,
      "start": 410.70001220703125,
      "end": 415.8800048828125,
      "text": " Some of us are able to learn very well just by reading something, others of us need to"
    },
    {
      "id": 86,
      "start": 416.239990234375,
      "end": 417.32000732421875,
      "text": " see it done, right?"
    },
    {
      "id": 87,
      "start": 417.32000732421875,
      "end": 421.5199890136719,
      "text": " There's different ways of learning, and we're not going to deal with that extensively this"
    },
    {
      "id": 88,
      "start": 421.5199890136719,
      "end": 426.3599853515625,
      "text": " evening, but I love the fact that God gives not only the instruction, but the apostle"
    },
    {
      "id": 89,
      "start": 426.3599853515625,
      "end": 429.44000244140625,
      "text": " Paul says we were an example to you as well."
    },
    {
      "id": 90,
      "start": 429.44000244140625,
      "end": 435.20001220703125,
      "text": " And so as we look at this text of Scripture, the statement in verse number seven where"
    },
    {
      "id": 91,
      "start": 435.20001220703125,
      "end": 442.17999267578125,
      "text": " he says that we behave not ourselves disorderly among you, gives us some insight with regard"
    },
    {
      "id": 92,
      "start": 442.3399963378906,
      "end": 448.5799865722656,
      "text": " to the subject matter that Paul is going to address in this text of Scripture, and that"
    },
    {
      "id": 93,
      "start": 448.5799865722656,
      "end": 451.94000244140625,
      "text": " is this, those that were walking disorderly."
    },
    {
      "id": 94,
      "start": 451.94000244140625,
      "end": 456.7799987792969,
      "text": " I've titled the message this evening, Disorderly Behavior."
    },
    {
      "id": 95,
      "start": 456.7799987792969,
      "end": 460.4200134277344,
      "text": " Disorderly Behavior, 2 Thessalonians 3 verses 6 through 10."
    },
    {
      "id": 96,
      "start": 460.4200134277344,
      "end": 464.70001220703125,
      "text": " As we look at the portion of Scripture, the Bible says in verse number six, now we command"
    },
    {
      "id": 97,
      "start": 464.70001220703125,
      "end": 465.70001220703125,
      "text": " you."
    },
    {
      "id": 98,
      "start": 465.70001220703125,
      "end": 469.8599853515625,
      "text": " Again, as we look at the first letter, we find that God would give this instruction,"
    },
    {
      "id": 99,
      "start": 469.8599853515625,
      "end": 476.260009765625,
      "text": " he says we beseech you in verse 12 of chapter 5, we exhort you in verse 14 of chapter 5,"
    },
    {
      "id": 100,
      "start": 476.260009765625,
      "end": 478.8599853515625,
      "text": " I charge you in verse 27."
    },
    {
      "id": 101,
      "start": 478.8599853515625,
      "end": 484.5,
      "text": " And so we come to the third chapter, in verse number six, Paul says now we command you."
    },
    {
      "id": 102,
      "start": 484.5,
      "end": 488.0199890136719,
      "text": " Now I like the language because it's not simply a suggestion."
    },
    {
      "id": 103,
      "start": 488.0199890136719,
      "end": 494.05999755859375,
      "text": " You ever give someone a suggestion, expecting that they're going to receive it as a command?"
    },
    {
      "id": 104,
      "start": 494.05999755859375,
      "end": 495.82000732421875,
      "text": " But it was a suggestion."
    },
    {
      "id": 105,
      "start": 495.82000732421875,
      "end": 501.5,
      "text": " So you thought that when you suggested something, that it meant that they were going to do that"
    },
    {
      "id": 106,
      "start": 501.5,
      "end": 502.5,
      "text": " thing."
    },
    {
      "id": 107,
      "start": 502.5,
      "end": 507.4200134277344,
      "text": " But it was just a suggestion, so they said, nah, I don't think I want to do that."
    },
    {
      "id": 108,
      "start": 507.4200134277344,
      "end": 512.260009765625,
      "text": " And the reality is that here, Paul is not making a suggestion, God's not making a suggestion,"
    },
    {
      "id": 109,
      "start": 512.260009765625,
      "end": 514.4600219726562,
      "text": " he says now we command you."
    },
    {
      "id": 110,
      "start": 514.4600219726562,
      "end": 522.1799926757812,
      "text": " And I like the clarity of the statement, I like the fact that there's no ambiguity, it's"
    },
    {
      "id": 111,
      "start": 522.1799926757812,
      "end": 523.1799926757812,
      "text": " clear."
    },
    {
      "id": 112,
      "start": 523.260009765625,
      "end": 524.260009765625,
      "text": " So we command you what?"
    },
    {
      "id": 113,
      "start": 524.260009765625,
      "end": 530.97998046875,
      "text": " Now we command you brethren, in the name of our Lord Jesus Christ, that ye withdraw yourselves"
    },
    {
      "id": 114,
      "start": 530.97998046875,
      "end": 541.0999755859375,
      "text": " from every brother that walketh disorderly, and not after the tradition which he received"
    },
    {
      "id": 115,
      "start": 541.0999755859375,
      "end": 542.3400268554688,
      "text": " of us."
    },
    {
      "id": 116,
      "start": 542.3400268554688,
      "end": 545.97998046875,
      "text": " We read verses seven through nine, I'll read them again, for yourselves know how you ought"
    },
    {
      "id": 117,
      "start": 545.97998046875,
      "end": 550.5800170898438,
      "text": " to follow us, for we behave not ourselves disorderly among you, neither did we eat any"
    },
    {
      "id": 118,
      "start": 550.5800170898438,
      "end": 554.5800170898438,
      "text": " man's bread for naught, but wrought with labor and travail night and day, that we might"
    },
    {
      "id": 119,
      "start": 554.5800170898438,
      "end": 556.8200073242188,
      "text": " not be chargeable to any of you."
    },
    {
      "id": 120,
      "start": 556.8200073242188,
      "end": 562.0999755859375,
      "text": " Not because we have not power, but to make ourselves an example unto you to follow us."
    },
    {
      "id": 121,
      "start": 562.0999755859375,
      "end": 569.260009765625,
      "text": " Now verse 10 says this, for even when we were with you, this we commanded you, that if any"
    },
    {
      "id": 122,
      "start": 569.260009765625,
      "end": 573.8599853515625,
      "text": " should not work, neither should he eat."
    },
    {
      "id": 123,
      "start": 573.8599853515625,
      "end": 578.02001953125,
      "text": " And so we look at this text of Scripture and we find that Paul is addressing those that"
    },
    {
      "id": 124,
      "start": 578.02001953125,
      "end": 584.6599731445312,
      "text": " are walking disorderly, disorderly behavior is the content, the subject matter in verses"
    },
    {
      "id": 125,
      "start": 584.6599731445312,
      "end": 586.0999755859375,
      "text": " six through 10."
    },
    {
      "id": 126,
      "start": 586.0999755859375,
      "end": 590.2999877929688,
      "text": " If you're taking notes, number one, identify disorderly behavior."
    },
    {
      "id": 127,
      "start": 590.2999877929688,
      "end": 593.4600219726562,
      "text": " We need to learn how to identify disorderly behavior."
    },
    {
      "id": 128,
      "start": 593.4600219726562,
      "end": 598.9000244140625,
      "text": " And it's important that as we look here at this text of Scripture, you notice in verse"
    },
    {
      "id": 129,
      "start": 598.9000244140625,
      "end": 599.9400024414062,
      "text": " number six that there"
    },
    {
      "id": 0,
      "start": 599.9400024414062,
      "end": 604.9800024032593,
      "text": " were some within the church that were walking disorderly. It was not something"
    },
    {
      "id": 1,
      "start": 604.9800024032593,
      "end": 610.3800020217896,
      "text": " where the Apostle Paul was saying it may be at some point in your future that no"
    },
    {
      "id": 2,
      "start": 610.3800020217896,
      "end": 613.9000024795532,
      "text": " there were some that were walking disorderly and we see that in verse"
    },
    {
      "id": 3,
      "start": 613.9000024795532,
      "end": 616.8600025177002,
      "text": " number six it says that you withdraw yourselves from every brother that"
    },
    {
      "id": 4,
      "start": 616.8600025177002,
      "end": 621.7400016784668,
      "text": " walketh disorderly and so we find that we understand that of the church in"
    },
    {
      "id": 5,
      "start": 621.7400016784668,
      "end": 627.2200031280518,
      "text": " Thessalonica again a model church a good church but there were some that were"
    },
    {
      "id": 6,
      "start": 627.2200031280518,
      "end": 633.6600036621094,
      "text": " walking disorderly and so we find that we must be able to identify disorderly"
    },
    {
      "id": 7,
      "start": 633.6600036621094,
      "end": 639.9000015258789,
      "text": " behavior and Paul gives us some insight here there's at least one example in the"
    },
    {
      "id": 8,
      "start": 639.9000015258789,
      "end": 645.0200042724609,
      "text": " text of scripture that is provided to us with regard to the disorderly behavior"
    },
    {
      "id": 9,
      "start": 645.0200042724609,
      "end": 649.3800010681152,
      "text": " that is the subject by which the church in Thessalonica is dealing with in verse"
    },
    {
      "id": 10,
      "start": 649.3800010681152,
      "end": 656.3400039672852,
      "text": " number 10 the the disorderly behavior is a failure to work and notice he says for"
    },
    {
      "id": 11,
      "start": 656.3400039672852,
      "end": 659.8600006103516,
      "text": " even when we were with you this we commanded you so it was something that"
    },
    {
      "id": 12,
      "start": 659.8600006103516,
      "end": 666.1800003051758,
      "text": " had been previously commanded that if any would not work neither should he eat"
    },
    {
      "id": 13,
      "start": 666.1800003051758,
      "end": 675.7000045776367,
      "text": " now no work no food I know that's not popular today man and the reality is"
    },
    {
      "id": 14,
      "start": 675.7000045776367,
      "end": 680.0200042724609,
      "text": " that he's not referring to people that cannot work he's referring to people"
    },
    {
      "id": 15,
      "start": 680.0200042724609,
      "end": 685.1000061035156,
      "text": " that will not work all right there's a difference between those who cannot"
    },
    {
      "id": 16,
      "start": 685.1000061035156,
      "end": 690.1399993896484,
      "text": " legitimately they cannot work and those who just simply will not work there's a"
    },
    {
      "id": 17,
      "start": 690.1399993896484,
      "end": 696.1000061035156,
      "text": " difference and here what God is dealing with is those that will not work they"
    },
    {
      "id": 18,
      "start": 696.1000061035156,
      "end": 700.9800033569336,
      "text": " have the ability to work but they will not work and God says that listen if"
    },
    {
      "id": 19,
      "start": 700.9800033569336,
      "end": 706.5400009155273,
      "text": " they don't work there's no food and so the disorderly behavior has to be"
    },
    {
      "id": 20,
      "start": 706.5400009155273,
      "end": 711.9800033569336,
      "text": " identified now as we look at this text of scripture and we understand the"
    },
    {
      "id": 21,
      "start": 711.9800033569336,
      "end": 716.3400039672852,
      "text": " importance of identifying disorderly behavior we know that not only does it"
    },
    {
      "id": 22,
      "start": 716.3400039672852,
      "end": 720.3000030517578,
      "text": " need to be identified but number two it needs to be corrected it needs to be"
    },
    {
      "id": 23,
      "start": 720.3000030517578,
      "end": 726.6600036621094,
      "text": " corrected now it's interesting the word disorderly in verse 6 and then again in"
    },
    {
      "id": 24,
      "start": 726.6600036621094,
      "end": 732.6600036621094,
      "text": " verse number 7 of 2nd Thessalonians 3 this word is given to us and this word"
    },
    {
      "id": 25,
      "start": 732.6600036621094,
      "end": 738.9799957275391,
      "text": " is is derived from the same Greek word that is translated unruly in the first"
    },
    {
      "id": 26,
      "start": 738.9799957275391,
      "end": 743.8200073242188,
      "text": " letter and so in the first letter in 1st Thessalonians 5 in verse number 14"
    },
    {
      "id": 27,
      "start": 743.8200073242188,
      "end": 751.2200012207031,
      "text": " the Bible says this now we exhort you brethren warn them that are unruly I'm"
    },
    {
      "id": 28,
      "start": 751.2200012207031,
      "end": 754.2200012207031,
      "text": " not gonna read the rest of the verse because it's that phrase that is"
    },
    {
      "id": 29,
      "start": 754.2200012207031,
      "end": 757.8200073242188,
      "text": " pertinent to our subject matter this evening and he says warn them that are"
    },
    {
      "id": 30,
      "start": 757.8200073242188,
      "end": 762.3000030517578,
      "text": " unruly I taught on that a number of weeks ago and we find that here when he"
    },
    {
      "id": 31,
      "start": 762.3000030517578,
      "end": 767.8600006103516,
      "text": " speaks about those that are disorderly it's not the same word but it's derived"
    },
    {
      "id": 32,
      "start": 767.8600006103516,
      "end": 772.7400054931641,
      "text": " from the word that is translated unruly and so we understand there's a a"
    },
    {
      "id": 33,
      "start": 772.7400054931641,
      "end": 777.4600067138672,
      "text": " connection between unruly and disorderly almost being used synonymously if you"
    },
    {
      "id": 34,
      "start": 777.4600067138672,
      "end": 782.8600006103516,
      "text": " will and we find that here in chapter number 5 of the previous letter now"
    },
    {
      "id": 35,
      "start": 782.8600006103516,
      "end": 786.5800018310547,
      "text": " remember there's not a lot of time that passes between the writing of 1st"
    },
    {
      "id": 36,
      "start": 786.5800018310547,
      "end": 790.8600006103516,
      "text": " Thessalonians and the writing of 2nd Thessalonians and it seems as if when"
    },
    {
      "id": 37,
      "start": 790.8600006103516,
      "end": 796.2200012207031,
      "text": " you think about this correcting the the disorderly behavior there are at least"
    },
    {
      "id": 38,
      "start": 796.2200012207031,
      "end": 802.6600036621094,
      "text": " two possibilities at play here number one the believers in Thessalonica were"
    },
    {
      "id": 39,
      "start": 802.6600036621094,
      "end": 808.7400054931641,
      "text": " not warning the unruly or the disorderly they weren't warning them now I tend to"
    },
    {
      "id": 40,
      "start": 808.7400054931641,
      "end": 812.8600006103516,
      "text": " think that's not what was going on I tend to believe that what happened"
    },
    {
      "id": 41,
      "start": 812.8600006103516,
      "end": 818.3000030517578,
      "text": " because Paul had mentioned how that he believed that they would do what he"
    },
    {
      "id": 42,
      "start": 818.3000030517578,
      "end": 823.6199951171875,
      "text": " commanded them I believe really what was happening is that the unruly and the"
    },
    {
      "id": 43,
      "start": 823.6199951171875,
      "end": 831.3399963378906,
      "text": " disorderly were not heeding the warning you know you can give a warning but you"
    },
    {
      "id": 44,
      "start": 831.3399963378906,
      "end": 839.1000061035156,
      "text": " can't make the person heed it amen I told a story years ago and I think I've"
    },
    {
      "id": 45,
      "start": 839.1000061035156,
      "end": 843.0200042724609,
      "text": " told it twice from the pulpit there was a pastor and his wife leaving a church"
    },
    {
      "id": 46,
      "start": 843.0200042724609,
      "end": 845.9000091552734,
      "text": " in the south and they were leaving on a Sunday morning they were trying to"
    },
    {
      "id": 47,
      "start": 845.9000091552734,
      "end": 849.5,
      "text": " hustle to get somewhere for lunch or whatever they were doing and they came"
    },
    {
      "id": 48,
      "start": 849.5,
      "end": 853.9000091552734,
      "text": " to a railroad crossing the lights were flashing the bars were down and he said"
    },
    {
      "id": 49,
      "start": 853.9000091552734,
      "end": 857.739990234375,
      "text": " I can make it he goes to try to go around the bars hit by a train both of"
    },
    {
      "id": 50,
      "start": 857.739990234375,
      "end": 863.5800170898438,
      "text": " them killed whose fault is it it's his fault the warning was there he just"
    },
    {
      "id": 51,
      "start": 863.5800170898438,
      "end": 868.260009765625,
      "text": " didn't heed the warning right we've all been in circumstances and situations"
    },
    {
      "id": 52,
      "start": 868.260009765625,
      "end": 872.5,
      "text": " where we have experienced times in our own lives where we did not heed the"
    },
    {
      "id": 53,
      "start": 872.5,
      "end": 877.5599975585938,
      "text": " warning or like man they warned me about that or that whatever there was a label"
    },
    {
      "id": 54,
      "start": 877.5599975585938,
      "end": 881.8399963378906,
      "text": " that warned about the potential of this happening and I didn't heed the warning"
    },
    {
      "id": 55,
      "start": 881.8399963378906,
      "end": 886.7200012207031,
      "text": " and now this is the consequence the result so I believe that really what's"
    },
    {
      "id": 56,
      "start": 886.7200012207031,
      "end": 892.0400085449219,
      "text": " happening here in Thessalonica was that the warnings were provided but they"
    },
    {
      "id": 57,
      "start": 892.0400085449219,
      "end": 897.760009765625,
      "text": " simply weren't heeding the warning now we're gonna think about what's going on"
    },
    {
      "id": 58,
      "start": 897.760009765625,
      "end": 903.4400024414062,
      "text": " and understand the context and obviously the the reason that Paul is writing to"
    },
    {
      "id": 59,
      "start": 903.4400024414062,
      "end": 908.3200073242188,
      "text": " these believers a second time so quickly those false teachers that were"
    },
    {
      "id": 60,
      "start": 908.3200073242188,
      "end": 913.7999877929688,
      "text": " seeking to confuse and to influence the believers here's what was happening we"
    },
    {
      "id": 61,
      "start": 913.7999877929688,
      "end": 918.4400024414062,
      "text": " saw in chapter 2 in verse number 2 they were telling him that the day of Christ"
    },
    {
      "id": 62,
      "start": 918.4400024414062,
      "end": 922.8399963378906,
      "text": " was at hand so here's what was happening as people were saying well we don't need"
    },
    {
      "id": 63,
      "start": 922.8399963378906,
      "end": 929.0,
      "text": " to work then we don't need to work and I remember I can't remember the year I"
    },
    {
      "id": 64,
      "start": 929.0,
      "end": 932.6799926757812,
      "text": " know that Harold Camping said 88 reasons that Christ has come back in"
    },
    {
      "id": 65,
      "start": 932.6799926757812,
      "end": 937.4800109863281,
      "text": " 1988 and that didn't happen and so he had to write something else and I don't"
    },
    {
      "id": 66,
      "start": 937.4800109863281,
      "end": 942.1199951171875,
      "text": " know Harold Camping made all kinds of declarations with naming years he never"
    },
    {
      "id": 67,
      "start": 942.1199951171875,
      "end": 947.6400146484375,
      "text": " read the part where it says no man know at the hour and anyhow he's he's no"
    },
    {
      "id": 68,
      "start": 947.6400146484375,
      "end": 953.5199890136719,
      "text": " longer alive but but he I think it was somewhere early in the 2000s he made"
    },
    {
      "id": 69,
      "start": 953.5199890136719,
      "end": 957.9599914550781,
      "text": " another huge declaration and there were people selling all of their goods there"
    },
    {
      "id": 70,
      "start": 957.9599914550781,
      "end": 961.6400146484375,
      "text": " are people quitting their jobs and they were doing all this stuff to go on the"
    },
    {
      "id": 71,
      "start": 961.6400146484375,
      "end": 967.1600036621094,
      "text": " road and and try to announce that Jesus is coming on this particular day and he"
    },
    {
      "id": 72,
      "start": 967.1600036621094,
      "end": 971.9599914550781,
      "text": " didn't and they didn't have anything and they didn't have a job and it was Harold"
    },
    {
      "id": 73,
      "start": 971.9599914550781,
      "end": 975.9599914550781,
      "text": " Camping didn't take care of him he didn't pay for all their expenses and it"
    },
    {
      "id": 74,
      "start": 975.9599914550781,
      "end": 980.9599914550781,
      "text": " was a real problem so what was happening here is because of this false teaching"
    },
    {
      "id": 75,
      "start": 980.9599914550781,
      "end": 984.7200012207031,
      "text": " it was influencing some people say well then we don't there's no need for us to"
    },
    {
      "id": 76,
      "start": 984.7200012207031,
      "end": 990.4400024414062,
      "text": " work no the principles that you you work you provide for your own you work"
    },
    {
      "id": 77,
      "start": 990.4400024414062,
      "end": 996.7200012207031,
      "text": " so that you could have and if you don't work you don't eat and so we find that"
    },
    {
      "id": 78,
      "start": 996.7200012207031,
      "end": 1001.3999938964844,
      "text": " when we consider the text of Scripture and we couple it with what we've just"
    },
    {
      "id": 79,
      "start": 1001.3999938964844,
      "end": 1005.3999938964844,
      "text": " studied in 1st Thessalonians chapter number 5 that just because we're able to"
    },
    {
      "id": 80,
      "start": 1005.3999938964844,
      "end": 1010.7200012207031,
      "text": " identify disorderly behavior and even if we do our part to correct disorderly"
    },
    {
      "id": 81,
      "start": 1010.7200012207031,
      "end": 1017.0400085449219,
      "text": " behavior it doesn't mean that the the guilty party is going to respond"
    },
    {
      "id": 82,
      "start": 1017.0400085449219,
      "end": 1022.9599914550781,
      "text": " favorably right we agree with that and so we find that what's happening here is"
    },
    {
      "id": 83,
      "start": 1022.9599914550781,
      "end": 1029.8800048828125,
      "text": " the Apostle Paul is now going to provide us with the the next step and so if"
    },
    {
      "id": 84,
      "start": 1029.8800048828125,
      "end": 1035.4800109863281,
      "text": " you're taking notes number three separate from disorderly brethren now I"
    },
    {
      "id": 85,
      "start": 1035.4800109863281,
      "end": 1041.8399963378906,
      "text": " understand that that this is not easy nor is it typically desired but we find"
    },
    {
      "id": 86,
      "start": 1041.8399963378906,
      "end": 1045.6000061035156,
      "text": " that here in the text of Scripture Paul makes it extremely clear in verse number"
    },
    {
      "id": 87,
      "start": 1045.6000061035156,
      "end": 1052.2799987792969,
      "text": " six notice he says now we command you we made point of that earlier but he says"
    },
    {
      "id": 88,
      "start": 1052.2799987792969,
      "end": 1058.760009765625,
      "text": " we command you brethren notice in the name of our Lord Jesus Christ that ye"
    },
    {
      "id": 89,
      "start": 1059.3600158691406,
      "end": 1066.2799987792969,
      "text": " withdraw yourselves from every brother that walketh disorderly and not after"
    },
    {
      "id": 90,
      "start": 1066.2799987792969,
      "end": 1073.6400146484375,
      "text": " the tradition which he received of us now later on in the text in a future"
    },
    {
      "id": 91,
      "start": 1073.6400146484375,
      "end": 1079.0800170898438,
      "text": " lesson we're gonna find that there's another truth of admonition that is"
    },
    {
      "id": 92,
      "start": 1079.0800170898438,
      "end": 1083.4800109863281,
      "text": " given to have no company with someone but that's someone who actually has some"
    },
    {
      "id": 93,
      "start": 1083.4800109863281,
      "end": 1089.9599914550781,
      "text": " doctrinal differences with regard to he says in verse 14 if any man obey not our"
    },
    {
      "id": 94,
      "start": 1089.9599914550781,
      "end": 1095.4400024414062,
      "text": " word by this epistle note that man and have no company with him that he may be"
    },
    {
      "id": 95,
      "start": 1095.4400024414062,
      "end": 1099.4800109863281,
      "text": " ashamed we don't count him as an enemy according to verse 15 but admonish him"
    },
    {
      "id": 96,
      "start": 1099.4800109863281,
      "end": 1105.5599975585938,
      "text": " as a brother but the reality is that their separation here in verses six"
    },
    {
      "id": 97,
      "start": 1105.5599975585938,
      "end": 1111.5199890136719,
      "text": " through ten he's talking about these that have are guilty of being unruly or"
    },
    {
      "id": 98,
      "start": 1111.5199890136719,
      "end": 1117.3599853515625,
      "text": " disorderly in their behavior and Paul says that were to withdraw ourselves the"
    },
    {
      "id": 99,
      "start": 1117.3599853515625,
      "end": 1121.5999755859375,
      "text": " the word literally means to remove yourself it literally means to depart"
    },
    {
      "id": 100,
      "start": 1121.5999755859375,
      "end": 1126.6799926757812,
      "text": " from now understand with me this evening again that this is not easy nor is it"
    },
    {
      "id": 101,
      "start": 1126.6799926757812,
      "end": 1132.9600219726562,
      "text": " often desired but the instruction is clear and this is not a circumstance or"
    },
    {
      "id": 102,
      "start": 1132.9600219726562,
      "end": 1137.9199829101562,
      "text": " a situation where someone is disorderly on one occasion and we immediately say"
    },
    {
      "id": 103,
      "start": 1137.9199829101562,
      "end": 1143.760009765625,
      "text": " I can't have any no they were warned they were corrected there was a measure"
    },
    {
      "id": 104,
      "start": 1143.760009765625,
      "end": 1149.3200073242188,
      "text": " of time and by the way let me say this oftentimes if we're not careful when we"
    },
    {
      "id": 105,
      "start": 1149.3200073242188,
      "end": 1154.4000244140625,
      "text": " think about the circumstances in life we enjoy it greatly when individuals and"
    },
    {
      "id": 106,
      "start": 1154.4000244140625,
      "end": 1160.0399780273438,
      "text": " especially when God is long-suffering toward us but when others and God are"
    },
    {
      "id": 107,
      "start": 1160.0399780273438,
      "end": 1164.4000244140625,
      "text": " long-suffering towards others sometimes we don't have patience for that does"
    },
    {
      "id": 108,
      "start": 1164.4000244140625,
      "end": 1169.1199951171875,
      "text": " that make sense what I just said so I like it when God is long-suffering with"
    },
    {
      "id": 109,
      "start": 1169.1199951171875,
      "end": 1173.0800170898438,
      "text": " me I like it when people are long-suffering with me you ever interact"
    },
    {
      "id": 110,
      "start": 1173.0800170898438,
      "end": 1175.3200073242188,
      "text": " with somebody that has no patience with you and you're trying to work through"
    },
    {
      "id": 111,
      "start": 1175.3200073242188,
      "end": 1179.3599853515625,
      "text": " something so listen can you just be patient like I'm trying to and they're"
    },
    {
      "id": 112,
      "start": 1179.3599853515625,
      "end": 1183.5599975585938,
      "text": " just they don't want to hear it they're just and we we like when people are"
    },
    {
      "id": 113,
      "start": 1183.5599975585938,
      "end": 1189.0800170898438,
      "text": " long-suffering and patient with us but if we see somebody if we think that"
    },
    {
      "id": 114,
      "start": 1189.0800170898438,
      "end": 1193.6799926757812,
      "text": " there's somebody that's walking disorderly and we don't know all of the"
    },
    {
      "id": 115,
      "start": 1193.6799926757812,
      "end": 1198.2000122070312,
      "text": " the steps that have been taken sometimes we might come to the place of"
    },
    {
      "id": 116,
      "start": 1198.2000122070312,
      "end": 1201.7999877929688,
      "text": " why isn't that dealt with yet"
    },
    {
      "id": 0,
      "start": 1201.7999877929688,
      "end": 1206.9599876403809,
      "text": " Well, maybe you don't know how it's being dealt with, and the manner by which it's being"
    },
    {
      "id": 1,
      "start": 1206.9599876403809,
      "end": 1212.3399877548218,
      "text": " dealt with, and the fact that there's a measure of longsuffering, that if you were in the"
    },
    {
      "id": 2,
      "start": 1212.3399877548218,
      "end": 1217.6799879074097,
      "text": " circumstance and the situation, you would appreciate the longsuffering."
    },
    {
      "id": 3,
      "start": 1217.6799879074097,
      "end": 1222.1799869537354,
      "text": " And so we find that this is not just immediate first offense, bam, you're done."
    },
    {
      "id": 4,
      "start": 1222.1799869537354,
      "end": 1228.1399879455566,
      "text": " It's a situation where this is a behavior that has developed, and the warning has been"
    },
    {
      "id": 5,
      "start": 1228.1399879455566,
      "end": 1231.4599876403809,
      "text": " given, but there's no heeding the warning."
    },
    {
      "id": 6,
      "start": 1231.4599876403809,
      "end": 1233.279987335205,
      "text": " So what's the step?"
    },
    {
      "id": 7,
      "start": 1233.279987335205,
      "end": 1234.279987335205,
      "text": " Withdrawal."
    },
    {
      "id": 8,
      "start": 1234.279987335205,
      "end": 1235.279987335205,
      "text": " Separate."
    },
    {
      "id": 9,
      "start": 1235.279987335205,
      "end": 1245.279987335205,
      "text": " Now, remember, those behaving disorderly will influence others."
    },
    {
      "id": 10,
      "start": 1245.279987335205,
      "end": 1247.719985961914,
      "text": " Amen?"
    },
    {
      "id": 11,
      "start": 1247.719985961914,
      "end": 1252.3999862670898,
      "text": " We've all at some point in our lives heard someone, and maybe we were the ones speaking"
    },
    {
      "id": 12,
      "start": 1252.3999862670898,
      "end": 1255.2399864196777,
      "text": " the words about the bad apple."
    },
    {
      "id": 13,
      "start": 1255.2399864196777,
      "end": 1260.9199867248535,
      "text": " The bad apple doesn't make the, it's going to make the good apples bad if you keep it"
    },
    {
      "id": 14,
      "start": 1260.9199867248535,
      "end": 1261.9199867248535,
      "text": " together."
    },
    {
      "id": 15,
      "start": 1261.9199867248535,
      "end": 1264.7999877929688,
      "text": " The good apples, I don't care how many good apples you put in there, they're never going"
    },
    {
      "id": 16,
      "start": 1264.7999877929688,
      "end": 1267.1599884033203,
      "text": " to make the bad apple good."
    },
    {
      "id": 17,
      "start": 1267.1599884033203,
      "end": 1268.1599884033203,
      "text": " We've used that."
    },
    {
      "id": 18,
      "start": 1268.1599884033203,
      "end": 1270.1599884033203,
      "text": " We've heard it."
    },
    {
      "id": 19,
      "start": 1270.1599884033203,
      "end": 1278.4599914550781,
      "text": " But we find that biblically, God reveals to us the truth of influence, and those that"
    },
    {
      "id": 20,
      "start": 1278.4599914550781,
      "end": 1285.6799850463867,
      "text": " are walking disorderly will have an influence on the body, on the church."
    },
    {
      "id": 21,
      "start": 1285.6799850463867,
      "end": 1294.2799911499023,
      "text": " And therefore, we find that this command is given, that Paul is, I mean, he is clear."
    },
    {
      "id": 22,
      "start": 1294.2799911499023,
      "end": 1296.6799850463867,
      "text": " There's no confusion."
    },
    {
      "id": 23,
      "start": 1296.6799850463867,
      "end": 1299.239990234375,
      "text": " He's making it extremely clear."
    },
    {
      "id": 24,
      "start": 1299.239990234375,
      "end": 1301.3599853515625,
      "text": " God is providing us with this instruction."
    },
    {
      "id": 25,
      "start": 1301.3599853515625,
      "end": 1304.7599868774414,
      "text": " Now look back, if you will, at 1 Corinthians chapter 15."
    },
    {
      "id": 26,
      "start": 1304.7599868774414,
      "end": 1310.1999893188477,
      "text": " 1 Corinthians chapter 15, see, the truth is not just something that your mom or grandma"
    },
    {
      "id": 27,
      "start": 1310.1999893188477,
      "end": 1311.999984741211,
      "text": " told you about the apple."
    },
    {
      "id": 28,
      "start": 1311.999984741211,
      "end": 1314.1999893188477,
      "text": " It's a biblical foundation."
    },
    {
      "id": 29,
      "start": 1314.1999893188477,
      "end": 1320.119987487793,
      "text": " It's a truth that God has given us in His Word with regard to relationships and with"
    },
    {
      "id": 30,
      "start": 1320.119987487793,
      "end": 1323.5599899291992,
      "text": " regard to influence."
    },
    {
      "id": 31,
      "start": 1323.5599899291992,
      "end": 1332.3999938964844,
      "text": " In 1 Corinthians 15, in verse number 33, it says this, be not deceived."
    },
    {
      "id": 32,
      "start": 1332.3999938964844,
      "end": 1337.5599822998047,
      "text": " Now anytime a verse starts with those words, you ought to pay close attention."
    },
    {
      "id": 33,
      "start": 1337.5599822998047,
      "end": 1338.719985961914,
      "text": " Why?"
    },
    {
      "id": 34,
      "start": 1338.719985961914,
      "end": 1343.8199920654297,
      "text": " Because the enemy is a liar."
    },
    {
      "id": 35,
      "start": 1343.9399871826172,
      "end": 1345.9399871826172,
      "text": " He is a deceiver."
    },
    {
      "id": 36,
      "start": 1345.9399871826172,
      "end": 1347.6599884033203,
      "text": " Amen?"
    },
    {
      "id": 37,
      "start": 1347.6599884033203,
      "end": 1350.9399871826172,
      "text": " And so here, God says, be not deceived."
    },
    {
      "id": 38,
      "start": 1350.9399871826172,
      "end": 1352.259994506836,
      "text": " What is it?"
    },
    {
      "id": 39,
      "start": 1352.259994506836,
      "end": 1360.0599822998047,
      "text": " Evil communications corrupt good manners."
    },
    {
      "id": 40,
      "start": 1360.0599822998047,
      "end": 1362.9599914550781,
      "text": " How many of you, I don't want you to raise your hand, but just answer it yourself if"
    },
    {
      "id": 41,
      "start": 1362.9599914550781,
      "end": 1364.5399932861328,
      "text": " you have children."
    },
    {
      "id": 42,
      "start": 1364.5399932861328,
      "end": 1369.6599884033203,
      "text": " How many of you that had children wanted your children to have good friends?"
    },
    {
      "id": 43,
      "start": 1369.6599884033203,
      "end": 1371.5399932861328,
      "text": " Everybody."
    },
    {
      "id": 44,
      "start": 1371.5399932861328,
      "end": 1374.5399932861328,
      "text": " You don't want your kids running around with the bad kids."
    },
    {
      "id": 45,
      "start": 1374.5399932861328,
      "end": 1379.5399932861328,
      "text": " You don't want your kids being associated with, no, you want your, you're concerned"
    },
    {
      "id": 46,
      "start": 1379.5399932861328,
      "end": 1384.259994506836,
      "text": " about the company that your kids keep."
    },
    {
      "id": 47,
      "start": 1384.259994506836,
      "end": 1390.4599914550781,
      "text": " Does that just automatically stop when we turn 18 or 21 or 52 or 89 or whatever that,"
    },
    {
      "id": 48,
      "start": 1390.4599914550781,
      "end": 1393.8199920654297,
      "text": " no, evil communications corrupt good manners."
    },
    {
      "id": 49,
      "start": 1393.8199920654297,
      "end": 1396.3799896240234,
      "text": " It is a biblical truth."
    },
    {
      "id": 50,
      "start": 1396.3799896240234,
      "end": 1400.5799865722656,
      "text": " In 1 Corinthians 5, in verse number 6, the Bible says a little leaven, leaveneth the"
    },
    {
      "id": 51,
      "start": 1400.5799865722656,
      "end": 1403.759994506836,
      "text": " whole lump."
    },
    {
      "id": 52,
      "start": 1403.759994506836,
      "end": 1409.4199829101562,
      "text": " The doctor tells you, and I don't say this lightly, so please understand, I understand"
    },
    {
      "id": 53,
      "start": 1409.4199829101562,
      "end": 1416.0199890136719,
      "text": " the severity of it, but if the doctor were to tell you that you have cancer, well, just"
    },
    {
      "id": 54,
      "start": 1416.0199890136719,
      "end": 1417.0199890136719,
      "text": " leave it."
    },
    {
      "id": 55,
      "start": 1417.0199890136719,
      "end": 1420.1799926757812,
      "text": " We're not going to do any, no, we want to get rid of it."
    },
    {
      "id": 56,
      "start": 1420.1799926757812,
      "end": 1421.2999877929688,
      "text": " Why?"
    },
    {
      "id": 57,
      "start": 1421.2999877929688,
      "end": 1424.7799835205078,
      "text": " Because that cancer is going to spread."
    },
    {
      "id": 58,
      "start": 1424.7799835205078,
      "end": 1426.8999938964844,
      "text": " And so we want to get rid of it."
    },
    {
      "id": 59,
      "start": 1426.8999938964844,
      "end": 1433.97998046875,
      "text": " And so we find that the biblical truths that are provided to us in 1 Corinthians 5, 1 Corinthians"
    },
    {
      "id": 60,
      "start": 1433.97998046875,
      "end": 1441.5399932861328,
      "text": " 15 help us to understand that those that are behaving disorderly will have an influence"
    },
    {
      "id": 61,
      "start": 1441.5399932861328,
      "end": 1443.499984741211,
      "text": " on the church."
    },
    {
      "id": 62,
      "start": 1443.499984741211,
      "end": 1449.3399810791016,
      "text": " They will have an influence on brothers and sisters in Christ, and so therefore Paul,"
    },
    {
      "id": 63,
      "start": 1449.3399810791016,
      "end": 1454.499984741211,
      "text": " under the inspiration of the Holy Spirit of God, he says, listen, not only are we to identify"
    },
    {
      "id": 64,
      "start": 1454.499984741211,
      "end": 1462.97998046875,
      "text": " disorderly behavior, we are to correct disorderly behavior, and depending on the response of"
    },
    {
      "id": 65,
      "start": 1462.97998046875,
      "end": 1470.6999816894531,
      "text": " the individual, then ultimately, if there's no positive response to the correction, to"
    },
    {
      "id": 66,
      "start": 1470.6999816894531,
      "end": 1478.1399841308594,
      "text": " the warning that's provided, the next step is to separate from, to withdraw yourselves."
    },
    {
      "id": 67,
      "start": 1478.4599914550781,
      "end": 1488.4599914550781,
      "text": " Again, I'm not suggesting this evening that this is an easy step or a desired step."
    },
    {
      "id": 68,
      "start": 1488.4599914550781,
      "end": 1493.8599853515625,
      "text": " I understand relationships, and I understand that there are times in which we'll say, well,"
    },
    {
      "id": 69,
      "start": 1493.8599853515625,
      "end": 1499.5799865722656,
      "text": " we can just set aside those differences, we can just set aside these things, and we have"
    },
    {
      "id": 70,
      "start": 1499.5799865722656,
      "end": 1504.5399780273438,
      "text": " to understand within the context of the church and hear what's taking place in the church"
    },
    {
      "id": 71,
      "start": 1504.5799865722656,
      "end": 1508.8999938964844,
      "text": " in Thessalonica, that Paul speaks expressly under the inspiration of the Holy Spirit of"
    },
    {
      "id": 72,
      "start": 1508.8999938964844,
      "end": 1511.5399780273438,
      "text": " God of how to deal with these matters."
    },
    {
      "id": 73,
      "start": 1511.5399780273438,
      "end": 1515.6999816894531,
      "text": " I want you to turn to Colossians, and we'll be done this evening, we'll have our prayer"
    },
    {
      "id": 74,
      "start": 1515.6999816894531,
      "end": 1520.6999816894531,
      "text": " time, but turn to the book of Colossians, if you will, in the first chapter."
    },
    {
      "id": 75,
      "start": 1520.6999816894531,
      "end": 1529.5399780273438,
      "text": " In Colossians chapter number 1, the end of the chapter, the Apostle Paul provides really,"
    },
    {
      "id": 76,
      "start": 1529.5399780273438,
      "end": 1535.2200012207031,
      "text": " if you will, a philosophy of ministry and just his approach to ministry."
    },
    {
      "id": 77,
      "start": 1535.2200012207031,
      "end": 1542.6999816894531,
      "text": " And he says this in verse 28, verse 27 talks about, with Christ in you, the hope of glory."
    },
    {
      "id": 78,
      "start": 1542.6999816894531,
      "end": 1547.5799865722656,
      "text": " He says, whom we preach, I just referenced the latter part of verse 27, because he begins"
    },
    {
      "id": 79,
      "start": 1547.5799865722656,
      "end": 1549.8199768066406,
      "text": " verse 28 by saying, whom we preach."
    },
    {
      "id": 80,
      "start": 1549.8199768066406,
      "end": 1553.9199829101562,
      "text": " We preach Christ, amen, 1 Corinthians."
    },
    {
      "id": 81,
      "start": 1553.9199829101562,
      "end": 1557.97998046875,
      "text": " We preach Christ, Christ crucified, Christ alone."
    },
    {
      "id": 82,
      "start": 1557.97998046875,
      "end": 1562.8999938964844,
      "text": " He died for us, he was buried and he rose again, and we preach Christ."
    },
    {
      "id": 83,
      "start": 1562.8999938964844,
      "end": 1571.8599853515625,
      "text": " And Paul says, whom we preach, and then notice this, warning every man, and teaching every"
    },
    {
      "id": 84,
      "start": 1571.8599853515625,
      "end": 1574.5799865722656,
      "text": " man in all wisdom."
    },
    {
      "id": 85,
      "start": 1574.5799865722656,
      "end": 1580.739990234375,
      "text": " So we find that there's a preaching, a warning, and a teaching."
    },
    {
      "id": 86,
      "start": 1580.739990234375,
      "end": 1586.0199890136719,
      "text": " And so sometimes what happens when there's someone that's disorderly, you warn them,"
    },
    {
      "id": 87,
      "start": 1586.0199890136719,
      "end": 1587.5,
      "text": " but then what do you need to do?"
    },
    {
      "id": 88,
      "start": 1587.5,
      "end": 1594.4400024414062,
      "text": " You don't just stop with a warning, you then have to teach them what is appropriate."
    },
    {
      "id": 89,
      "start": 1594.4400024414062,
      "end": 1599.0199890136719,
      "text": " We find, and we'll mention this again as we go further into 2 Thessalonians chapter 3,"
    },
    {
      "id": 90,
      "start": 1599.0199890136719,
      "end": 1604.7799987792969,
      "text": " when he's dealing with the more doctrinal issue at the end of the text, the reality"
    },
    {
      "id": 91,
      "start": 1604.7799987792969,
      "end": 1613.5,
      "text": " is that there's some people that can be led astray, you warn them and then you teach them."
    },
    {
      "id": 92,
      "start": 1613.5,
      "end": 1616.2999877929688,
      "text": " Sometimes people don't want a warning."
    },
    {
      "id": 93,
      "start": 1616.2999877929688,
      "end": 1617.97998046875,
      "text": " Sometimes people don't want to be taught."
    },
    {
      "id": 94,
      "start": 1617.97998046875,
      "end": 1620.6799926757812,
      "text": " It's just the way it is."
    },
    {
      "id": 95,
      "start": 1620.6799926757812,
      "end": 1624.97998046875,
      "text": " It's a hard thing that you have to acknowledge."
    },
    {
      "id": 96,
      "start": 1624.97998046875,
      "end": 1629.3799743652344,
      "text": " I remember Jason Caldwell making a statement when he was here preaching one time."
    },
    {
      "id": 97,
      "start": 1629.3799743652344,
      "end": 1633.7799987792969,
      "text": " He said, it breaks my heart that there are people that do not know the truth."
    },
    {
      "id": 98,
      "start": 1633.7799987792969,
      "end": 1634.7799987792969,
      "text": " I agree."
    },
    {
      "id": 99,
      "start": 1634.7799987792969,
      "end": 1640.0199890136719,
      "text": " He said, but what breaks my heart more than that is there are people who do not want to"
    },
    {
      "id": 100,
      "start": 1640.0199890136719,
      "end": 1641.0199890136719,
      "text": " know the truth."
    },
    {
      "id": 101,
      "start": 1641.0199890136719,
      "end": 1642.0199890136719,
      "text": " Wow."
    },
    {
      "id": 102,
      "start": 1642.0199890136719,
      "end": 1646.1399841308594,
      "text": " There are people that just don't want the warning."
    },
    {
      "id": 103,
      "start": 1646.1399841308594,
      "end": 1648.2200012207031,
      "text": " There are people that just don't want the teaching."
    },
    {
      "id": 104,
      "start": 1648.2200012207031,
      "end": 1653.6199951171875,
      "text": " But I want you to notice why Paul says we preach Christ, we preach Him whom we preach,"
    },
    {
      "id": 105,
      "start": 1653.6199951171875,
      "end": 1656.97998046875,
      "text": " warning every man and teaching every man in all wisdom, why?"
    },
    {
      "id": 106,
      "start": 1656.97998046875,
      "end": 1662.4599914550781,
      "text": " That we may present every man perfect in Christ Jesus."
    },
    {
      "id": 107,
      "start": 1662.4599914550781,
      "end": 1664.6999816894531,
      "text": " Word perfect is complete."
    },
    {
      "id": 108,
      "start": 1664.6999816894531,
      "end": 1667.0199890136719,
      "text": " To be complete in Christ."
    },
    {
      "id": 109,
      "start": 1667.0199890136719,
      "end": 1671.8999938964844,
      "text": " See Paul understood that one day every believer would stand before Christ."
    },
    {
      "id": 110,
      "start": 1671.8999938964844,
      "end": 1673.3799743652344,
      "text": " Every man must appear before Christ."
    },
    {
      "id": 111,
      "start": 1673.3799743652344,
      "end": 1677.0599975585938,
      "text": " If you're saved by the grace of God, you will stand before Christ."
    },
    {
      "id": 112,
      "start": 1677.0599975585938,
      "end": 1681.6799926757812,
      "text": " And so why is Paul preaching and warning and teaching?"
    },
    {
      "id": 113,
      "start": 1681.6799926757812,
      "end": 1686.3399963378906,
      "text": " So that when that day comes, you will be prepared for it."
    },
    {
      "id": 114,
      "start": 1686.3399963378906,
      "end": 1688.6599731445312,
      "text": " Now will any of us ever be fully prepared?"
    },
    {
      "id": 115,
      "start": 1688.6599731445312,
      "end": 1689.6599731445312,
      "text": " I think not."
    },
    {
      "id": 116,
      "start": 1689.6599731445312,
      "end": 1692.1399841308594,
      "text": " It's a fearful thing."
    },
    {
      "id": 117,
      "start": 1692.1399841308594,
      "end": 1702.0999755859375,
      "text": " It ought to cause us to seriously inspect self-examination and we'll stand before Christ"
    },
    {
      "id": 118,
      "start": 1702.2200012207031,
      "end": 1703.2200012207031,
      "text": " one day."
    },
    {
      "id": 119,
      "start": 1703.2200012207031,
      "end": 1708.5,
      "text": " But Paul says that this is why we do what we do."
    },
    {
      "id": 120,
      "start": 1708.5,
      "end": 1715.1799926757812,
      "text": " Where unto, verse 29, I also labor, striving according to His working which worketh in"
    },
    {
      "id": 121,
      "start": 1715.1799926757812,
      "end": 1716.1799926757812,
      "text": " me mightily."
    },
    {
      "id": 122,
      "start": 1716.1799926757812,
      "end": 1720.8599853515625,
      "text": " I'm so thankful that God works in us and through us to accomplish His purpose, but you understand"
    },
    {
      "id": 123,
      "start": 1720.8599853515625,
      "end": 1722.4599609375,
      "text": " that it's still labor."
    },
    {
      "id": 124,
      "start": 1722.4599609375,
      "end": 1728.7799682617188,
      "text": " He uses that word labor, he uses the word striving, that it communicates to us the labor"
    },
    {
      "id": 125,
      "start": 1728.7799682617188,
      "end": 1729.7799682617188,
      "text": " that's involved."
    },
    {
      "id": 126,
      "start": 1729.7799682617188,
      "end": 1734.6599731445312,
      "text": " Now I want you to see in the fourth chapter what it said of Epaphras."
    },
    {
      "id": 127,
      "start": 1734.6599731445312,
      "end": 1739.4199829101562,
      "text": " Epaphras, our understanding of the church in Colossae, Paul never was there."
    },
    {
      "id": 128,
      "start": 1739.4199829101562,
      "end": 1743.3399658203125,
      "text": " He had no part in starting the church, he had no interaction with the believers in Colossae"
    },
    {
      "id": 129,
      "start": 1743.3399658203125,
      "end": 1752.97998046875,
      "text": " save this letter that God inspired and had Paul write to the church that's there in Colossae."
    },
    {
      "id": 130,
      "start": 1752.97998046875,
      "end": 1757.8200073242188,
      "text": " And he writes to them, he hears about their salvation and testimony and about their walk"
    },
    {
      "id": 131,
      "start": 1757.8599853515625,
      "end": 1759.8999633789062,
      "text": " according to the first chapter from Epaphras."
    },
    {
      "id": 132,
      "start": 1759.8999633789062,
      "end": 1764.0599975585938,
      "text": " It's our understanding that he's the pastor of the church."
    },
    {
      "id": 133,
      "start": 1764.0599975585938,
      "end": 1767.47998046875,
      "text": " Notice what it says in verse 12 of Colossians 4 about Epaphras."
    },
    {
      "id": 134,
      "start": 1767.47998046875,
      "end": 1770.4199829101562,
      "text": " He says, who is one of you a servant of Christ, saluteth you."
    },
    {
      "id": 135,
      "start": 1770.4199829101562,
      "end": 1777.9400024414062,
      "text": " Notice what it says, always laboring fervently for you in prayers that ye may stand perfect"
    },
    {
      "id": 136,
      "start": 1777.9400024414062,
      "end": 1782.2999877929688,
      "text": " and complete in all the will of God."
    },
    {
      "id": 137,
      "start": 1782.2999877929688,
      "end": 1783.6599731445312,
      "text": " Wow."
    },
    {
      "id": 138,
      "start": 1783.6599731445312,
      "end": 1793.9400024414062,
      "text": " What a blessing to have some spiritual leaders that have a concern about individual believers."
    },
    {
      "id": 139,
      "start": 1793.9400024414062,
      "end": 1801.7799682617188,
      "text": " I'm thankful that in my life I've had some spiritual leaders that cared about me."
    },
    {
      "id": 0,
      "start": 1801.7799682617188,
      "end": 1807.2999682426453,
      "text": " I understand there are times in which all of us need to be warned about something."
    },
    {
      "id": 1,
      "start": 1807.2999682426453,
      "end": 1810.019968032837,
      "text": " None of us are perfect."
    },
    {
      "id": 2,
      "start": 1810.019968032837,
      "end": 1815.8999681472778,
      "text": " And we ought to be humble in receiving that warning, and we ought to be responsive."
    },
    {
      "id": 3,
      "start": 1815.8999681472778,
      "end": 1823.4399681091309,
      "text": " We ought to, if a warning has to be given, that we do follow the process of self-examination"
    },
    {
      "id": 4,
      "start": 1823.4399681091309,
      "end": 1829.4999675750732,
      "text": " and see the legitimacy of the concern that is brought to us so that we can evaluate our"
    },
    {
      "id": 5,
      "start": 1829.4999675750732,
      "end": 1833.019968032837,
      "text": " own behavior and then correct it if it needs to be corrected."
    },
    {
      "id": 6,
      "start": 1833.019968032837,
      "end": 1836.7399673461914,
      "text": " It's important that we take that response."
    },
    {
      "id": 7,
      "start": 1836.7399673461914,
      "end": 1841.659969329834,
      "text": " These believers, unfortunately, that are being spoken of in 2 Thessalonians chapter 3 and"
    },
    {
      "id": 8,
      "start": 1841.659969329834,
      "end": 1848.1799697875977,
      "text": " verses 6 through 10, it appears, based upon the direction of the text and the step of"
    },
    {
      "id": 9,
      "start": 1848.1799697875977,
      "end": 1854.9799690246582,
      "text": " separation, withdraw yourselves, that these that were guilty simply weren't hearing the"
    },
    {
      "id": 10,
      "start": 1854.9799690246582,
      "end": 1856.9399681091309,
      "text": " warning."
    },
    {
      "id": 11,
      "start": 1856.9399681091309,
      "end": 1859.4199676513672,
      "text": " They weren't heeding the warning."
    },
    {
      "id": 12,
      "start": 1859.4199676513672,
      "end": 1860.4999694824219,
      "text": " Find them that are unruly."
    },
    {
      "id": 13,
      "start": 1860.4999694824219,
      "end": 1863.4199676513672,
      "text": " They were told that in 1 Thessalonians 5 verse 14."
    },
    {
      "id": 14,
      "start": 1863.4199676513672,
      "end": 1865.4999694824219,
      "text": " I believe they did."
    },
    {
      "id": 15,
      "start": 1865.4999694824219,
      "end": 1870.0599670410156,
      "text": " And yet there were some that continued to walk disorderly."
    },
    {
      "id": 16,
      "start": 1870.0599670410156,
      "end": 1874.099967956543,
      "text": " Paul said, no, they've been instructed."
    },
    {
      "id": 17,
      "start": 1874.099967956543,
      "end": 1877.8999710083008,
      "text": " They've been given an example."
    },
    {
      "id": 18,
      "start": 1877.8999710083008,
      "end": 1882.1799697875977,
      "text": " And if they still won't heed, then you have to separate from them."
    },
    {
      "id": 19,
      "start": 1882.1799697875977,
      "end": 1887.4999694824219,
      "text": " And again, I'm not suggesting this evening that it's an easy thing or even a desired"
    },
    {
      "id": 20,
      "start": 1887.4999694824219,
      "end": 1892.4599685668945,
      "text": " thing, but we need to be careful that we understand the power of influence."
    },
    {
      "id": 21,
      "start": 1892.4599685668945,
      "end": 1894.8999710083008,
      "text": " And he says, be not deceived."
    },
    {
      "id": 22,
      "start": 1894.8999710083008,
      "end": 1899.099967956543,
      "text": " Evil communications will corrupt good manners."
    },
    {
      "id": 23,
      "start": 1899.099967956543,
      "end": 1900.099967956543,
      "text": " Let's pray together."
    },
    {
      "id": 24,
      "start": 1900.099967956543,
      "end": 1901.099967956543,
      "text": " Father, we love You."
    },
    {
      "id": 25,
      "start": 1901.099967956543,
      "end": 1902.099967956543,
      "text": " We thank You for loving us."
    },
    {
      "id": 26,
      "start": 1902.099967956543,
      "end": 1907.4999694824219,
      "text": " We thank You for the privilege of knowing You and having Your Word."
    },
    {
      "id": 27,
      "start": 1907.4999694824219,
      "end": 1910.6199645996094,
      "text": " We thank You for the truth that's contained therein."
    },
    {
      "id": 28,
      "start": 1910.6199645996094,
      "end": 1914.4599685668945,
      "text": " I pray, Lord, that You would help us to walk worthy, to please You."
    },
    {
      "id": 29,
      "start": 1914.4599685668945,
      "end": 1918.8599700927734,
      "text": " Lord, help us to walk in obedience to Your Word."
    },
    {
      "id": 30,
      "start": 1918.8599700927734,
      "end": 1920.4999694824219,
      "text": " Help us, Lord, as we pray tonight."
    },
    {
      "id": 31,
      "start": 1920.4999694824219,
      "end": 1921.819969177246,
      "text": " We thank You for the privilege."
    },
    {
      "id": 32,
      "start": 1921.819969177246,
      "end": 1927.8999710083008,
      "text": " I pray that You would work through this season of corporate prayer that You'd be glorified"
    },
    {
      "id": 33,
      "start": 1927.8999710083008,
      "end": 1930.5399627685547,
      "text": " and we'll thank You for it in Christ's name we pray."
    },
    {
      "id": 34,
      "start": 1930.5399627685547,
      "end": 1931.5399627685547,
      "text": " Amen."
    },
    {
      "id": 35,
      "start": 1931.5399627685547,
      "end": 1933.9399719238281,
      "text": " Anyone not get a prayer bulletin when you came in this evening?"
    }
  ],
  "processed_at": "2025-04-15T06:31:50.172376"
}