{
  "video_id": "aSMYJGSxXQQ",
  "text": "to have some folks visiting with us this morning. We thank you for being here. Is that Brad? Yes, amen. And I wasn't sure you had a mask on when I saw you, and now you don't. So I was like, did he have a beard or not? But anyway, good to have you here, you and your wife and son. And we met Brad on Friday over at Jordan Kitts as we're looking for a new piano. And he's here this morning with his family. Certainly thankful to have him. Trust the service will be a blessing to you. Colossians chapter number 4, we're looking at verses 2 through 4 this morning, of course, our theme for this year, Complete in Christ. And I am so thankful for the book of Colossians. I'm thankful for the Bible, amen. And all of it is good, and it's profitable, is what God tells us. All scripture is given by inspiration of God, and it is profitable. And I'm so thankful how God's word helps us as we've studied through the book of Colossians here on Sunday mornings. We've learned many valuable lessons. And as we come to this fourth chapter, of course, we dealt with the first verse coupled together with the last section of chapter number 3 a couple of weeks ago. But as we look at the fourth chapter, we see really that the letter, it kind of shifts as far as the instruction and kind of some final remarks and what have you. And as we look at this portion of scripture, I do trust that it will be a blessing to you this morning, that it would encourage us and challenge us in our walk with Christ. The Bible begins in verse number 2 by saying this, continue in prayer and watch in the same with thanksgiving, with all praying also for us, that God would open unto us a door of utterance to speak the mystery of Christ, for which I am also in bonds, that I may make it manifest as I ought to speak. As we look at this particular passage of scripture, the subject of prayer is obviously before us. As you study through the word of God, as you read the scriptures, you will notice that there's an obvious emphasis on prayer. I'm thankful that God gives us many promises with regard to prayer. He's given us much instruction with regard to the subject matter of prayer. And we think about those wonderful promises that we hold dear when we consider the subject matter of prayer. We have the privilege as we read the word of God to read how the people of God sought the face of God through prayer, how the word of God records the prayers of many, that we have the privilege of reading. And not only do we have the privilege of reading those prayers, but then we have the privilege of seeing how God answers those prayers. And the reality is that as we think about praying and we think about the subject of prayer, we understand, I believe, that each of us that are gathered here this morning would readily acknowledge that prayer is important, that prayer is necessary and it's a unique privilege for the child of God. The reality, however, is there are times in our lives when we find that praying is neglected. Why is that so? We understand the importance of it. We understand that it moves the hand of God. We understand that we're praying to the God of the impossible, the God who said, I can do anything, that there's nothing too hard for me. He said that He's able to do exceeding, abundantly above all that we ask or think. And yet, as the people of God, there are times in our lives, if you would be honest and if I would be honest, there are times in our lives when we neglect prayer. We understand what prayer is. We understand the importance and the significance of prayer. But yet we fail to pray. Why is that so? Well, prayer is spiritual battle. The enemy, the adversary, he doesn't want us to engage in prayer. He wants to distract us from praying. He wants us to think that it's not going to really matter. It's not going to impact or affect anything. And he wants to get us busy and tied up with all sorts of other things. And he wants to get us distracted. How many times in your life, how many times in my life, more than I'd like to really acknowledge, you enter into your time of prayer and distractions come. The phone rings. Someone knocks at the door. You get a text message, whatever it might be. And the distractions, if you have little ones, the little ones need your attention and they want this and they need that and so on and so forth. And it just seems as if the distractions abound. It's labor. It's battle. And as we look at the passage of Scripture, we understand that we've been instructed to pray. We understand really the importance of prayer. We understand the impact of prayer as we read of how God worked and how God continues to work. And we find here that the passage of Scripture has this phrase, continue in prayer, in verse number two. I want to use that as our title for our message this morning as we think about this subject matter of prayer. It's of great interest to me that as you think about the disciples as they walked with the Lord Jesus Christ and they observed so many wonderful things. And I mean, if you study through the Gospel records and you read of the life and ministry of the Lord Jesus Christ and how the disciples had the privilege of not only walking with Him, but seeing Him do great things. But of all the things that they observed, there's only one thing that they said to the Lord to teach us. It's found in Luke, in chapter number 11, when they say, you don't need to turn there, but he says, we don't know who the disciple is. It's an unnamed disciple. I like to think it's Peter, because Peter's always the one that's talking. He says, Lord, teach us to pray. Lord, teach us to do miracles. No. Lord, teach us how to multiply the bread and the fish and teach us how to heal people and teach us how to, no, no. Teach us to pray. Isn't that significant? It's of interest that of all the things that the disciples could have asked the Lord to teach them, we find recorded in the Word of God for us that they say, Lord, teach us to pray. Teach us to pray. As we look at the passage of Scripture, I want you to notice, number one, if you're taking notes, the privilege to pray. Prayer is a unique privilege that's truly reserved for the believer. It is a privilege that we have as the child of God to enter boldly into the throne room of heaven. We're to come boldly into the throne of grace, is what the Scriptures tell us in the book of Hebrews in the fourth chapter. You think about the privilege that we have as the people of God. Why is it a privilege that is reserved to us as the people of God? Because we pray to God through Christ. And because we belong to Him, we have direct access. And I'm so thankful that at any time in my life, in any situation, for any reason, I can go to God in prayer. It is a unique privilege. And we understand that as we think about this subject of prayer, and there are many that have used it, some maybe that aren't even saved that would talk about praying. And I have found in recent, really, years as we've looked at the cultural shift in our society, that it's not so often that you hear people anymore saying, I'll pray for you. They'll say, I'm thinking about you. And I'm not really sure the significance of someone thinking about me. But I do know the significance of someone praying for me. And I do understand, as the people of God, having the privilege of engaging in prayer and understanding that it moves the heart of God, the hand of God. We notice as we begin in verse number two that the Bible says, continue in prayer. I believe that this word continue would reveal to you, it would reveal to me that this is something that they're already engaged in. You're not going to continue doing something if you're not actually doing that thing. You wouldn't say continue to fill in the blank, continue to pray, continue in prayer if you're not first praying. And so as Paul would understand the church at Colossae, he did not have the privilege of being there and serving amongst these individuals. But he received a report. He commends these believers. And he then says to them, under the inspiration of the Holy Spirit of God, as he concludes, as we get into this fourth chapter, continue. Continue in what? Continue in prayer. They are being encouraged to press on. We find that as we would think about the idea of continuing in prayer, it carries with it the idea of to persevere and not to faint. And you think about Peter, even as he was there in the garden and as Jesus was praying. And what did Peter do? He fell asleep. And Jesus says, what? You could not watch and pray with me for an hour? And we find that here that he says continue in prayer to be devoted to it, to understand the significance of it. Generically, the word prayer means to simply ask. And it means to ask with earnestness. It's interesting that the verse continues. It not only says continue in prayer, but then it says this, and watch in the same. Well, he's speaking of prayer. So when he says, and watch in the same, he's speaking of prayer. And the word watch is an interesting word. It means to give strict attention to. How many times, again, when we seek to go before the throne room of heaven and pray that our minds are just diverted to so many other things and we're distracted, but yet this word watch, it means to give strict attention to, to take heed. And he says to watch in the same with thanksgiving. With thanksgiving. As we think about the privilege of prayer and we consider the many promises that God has given us throughout His Word, we're familiar with a number of those promises. I referenced Ephesians 3 20 already. You think about the great promise in Jeremiah 33 when God says to Jeremiah, call unto me and I will answer thee and show thee great and mighty things which thou knowest not. Last Sunday afternoon, Brother Dan Hummel spent time on that particular verse of Scripture in our afternoon service and encouraging us with regard to the way that God hears and answers prayer and what a blessing. And we find the Bible tells us as we would consider the truth of James chapter number 5 in verse number 16 when the Word of God says that the effectual fervent prayer of a righteous man availeth much. We think about this privilege that we have to pray. In the 1828 Noah Webster's Dictionary, the word prayer is denoted and given the definition in this sense. It says this, in worship a solemn address to the Supreme Being. We're praying to God, the God of the impossible, the God who said let there be light and there was light. Consisting of adoration, confession of sins, supplication for mercy and forgiveness, intercession for blessings on others, and thanksgiving. That's what the dictionary says. Noah Webster's 1828, and you look up the word prayer. We find that as we would consider the privilege of prayer and we understand as Paul says continue in prayer and watch in the same with thanksgiving. I would say to you that there's, it's not originable with me, but someone made up an acronym of prayer acts, A-C-T-S. It begins with adoration. You know when you begin your time of prayer and you begin to just adore the Lord that you stand in all of who He is, when you begin to think about the attributes that He's revealed to us within His Word and you begin to pray and seek His face and you understand that you're getting into that very presence of God Almighty and you begin to maybe reference the names of God. Maybe you begin to reference the attributes of God. You're joyful and rejoicing for who He is to you and what He's done for you and you're adoring Him. And then you move into confession. How important it is that we understand the importance of confession in our lives that the Word of God tells us that we serve a God who is faithful and He will forgive us if we confess our sins. He is faithful and just to forgive us and to cleanse us from all unrighteousness. And our prayer time ought to consist of some confession, some time in which we say, Lord search me, show me if there be any wicked way, lead me in the way everlasting. Because we understand that he that covereth his sin shall not prosper. But what a joy to know that he that confesseth, he receives mercy. Amen. What a blessing. I think of Thanksgiving as we find the end of this verse continuing prayer and watch in the same with Thanksgiving. Oh that God would help us to be a thankful people. We understand that in the last days one of the ways in which the perilous times are described as being that people will be unthankful. I was praying this morning and I was praying right here and all the crows were out there squawking and making all kinds of noise and I can't stand crows. And I said to Brother Hummel last Sunday, I said I think the sound of these crows is what God hears when we complain. Because it sounds like murmuring. It just drives me nuts. We're to be a thankful people. It's easy to complain. It really is. But when we give thanks in everything, we're to pray, right? But we're to give thanks. We're to seek God's face and thank him and understanding that God has purpose and plan and reason and that God is able. We face a difficulty. We face a circumstance and we can thank God that that he knows what to do. He has the power to do what has to be done. Isn't that wonderful? Can you imagine if we did not have that confidence as he's given us his word and we just were left to our own devices, our own resources, not having the knowledge that God is able to do exceeding abundantly above, that he has the power to do and the wisdom to know what to do. That's phenomenal. So with thanksgiving, in fact, as we look at the truth in the book of Philippians with regard to this truth, the Bible says be careful for nothing but in everything by prayer and supplication. With thanksgiving let your requests be made known unto God. You know, it's biblically accurate that we can thank God for how he's going to answer before the answer ever comes. With thanksgiving, God, I thank you in advance of what you're going to do because I know what you're going to do is right. It may not be exactly what I think should be done, but I'm thankful that it's not up to me. Amen? And God knows far greater than I know. He knows far greater than you know. And so we think about this privilege, it ends as we think about that acronym of acts, adoration, confession, thanksgiving, supplication. Supplication, not only for ourself but for others. You think about the ministry of intercessory prayer. You think about the opportunities that we have to bring our petitions before the throne room of heaven. When we understand that we need wisdom and we go to God and we know that he's told us that if any man lack wisdom let him ask of God who giveth to all men liberally and upbraideth not. In James 1. And you find that I need wisdom. Isn't it great to know the one who has all wisdom that has promised to give it to us when we acknowledge our need for it and request it? We find that we are able to go on the behalf of not only our own needs but as we pray one for another, intercessory prayer. What a blessing to know that we can pray one for another. And really in this particular passage of Scripture we find that the privilege is revealed to us in verse number two when he speaks about this continuing in prayer and watching the same with thanksgiving. And as we enter into the third verse we really begin to see that nature of intercessory prayer where Paul says this in verse number three, with all praying also for us that God would open unto us a door of utterance to speak the mystery of Christ for which I am also in bonds that I may make it manifest as I ought to speak. Number two, if you're taking notes notice a petition from Paul. A petition from Paul. We find that in the first chapter of the book of Colossians in verse number three Paul says this to these believers, we give thanks to God and the Father of our Lord Jesus Christ. Notice what Paul says, praying always for you. I will not take the time this morning to read verses 9 through 14 of chapter number 1 but we find that as Paul is encouraging the believers in Colossians 1 and verse number 3 he tells them that he's praying always for them. In verses 9 through 14 he gives them the specifics of how I'm praying for you. And here's how we're praying for you. And what a blessing as Paul would seek to encourage these believers. Now as we look at this final chapter and we look at this subject matter we see the petition from Paul where he now makes the request that they would pray for him. It's a blessing to be able to pray one for another. And I would submit to you that as I look at this petition from Paul that each one of us would say I need some people praying for me in this manner. I need some people to pray that God would give me boldness, that God would open up a door of utterance, that God would enable me to speak the way that I'm supposed to speak. Notice how specific Paul is. He does not just say in verse number 3, with all praying also for us, but he gives them some details, some specifics as to how he's requesting that they pray. I want you to understand that Paul is in bonds. He even makes note of that at the end of verse number 3, for which I am also in bonds. You'll notice that something that is missing from the specific prayer request that Paul gives in this passage of Scripture is a release from prison. He doesn't pray for that. Now you and me, if I was in prison and I was sending you letters, I'd probably be asking you to pray that God would release me from prison, right? Paul doesn't ask for that. He understood that God had him there for a reason. He understood that God's sovereign and Paul would be in prison not one day shorter or one day longer than God saw fit for him to be there. Do we believe that this morning? Do we understand that our God is able? Listen, you think about Joseph when he was in prison. He was there just as long as he was supposed to be there, right? Not a day sooner did he get released than what God had ordained for him to be released, and not a day longer did he stay in that prison than what he was supposed to. You think about the opportunity. Remember when the butler and the baker came, what did he say? Hey, remember me! Is that not what Joseph said? But the Bible tells us that the butler forgot him. Two full years. That's a long time. It's a long time. But then there was a dream, and nobody in Egypt could interpret the dream. And the butler all of a sudden... has a good memory. Ah, I remember this guy in prison. Do you not see the hand of God? Because had the butler remembered Joseph earlier than at that particular circumstance in his life and said, hey, Pharaoh, there's a guy that can interpret dreams in prison. Yeah, I got a lot of those astrologers and magicians. I got a whole group of them. That's what they're here for. That's what they're part of my cabinet for. Right? But it wasn't until all those guys failed that Joseph is remembered. Paul doesn't ask for a release from prison. Oftentimes we're so caught up in God delivering us from our difficulty that we fail to recognize that God has a purpose in that difficulty. We're all guilty of it. I don't like difficulties. Amen? And if you like them, you're crazy. Just kidding. But seriously, we try to avoid problems, do we not? But we find that, as Paul would say in the beginning of the book of Philippians in chapter 1 and verse number 12, the things that happen to me happen for the furtherance of the gospel. And so often we're saying, God, deliver me from this trial. Deliver me from this trouble. Deliver me from this problem. And God's saying, I'm trying to teach you something in the midst of this trial, in the midst of this storm. It was Jesus, by the way, that told the disciples to get into the boat and to pass onto the other side. And there was a storm in the midst of the sea. Why were they in the storm? Because they obeyed the Lord. Right? What if they disobeyed and said, nah, we're not going to sail tonight. We'll do it tomorrow. But was there not a great lesson in that storm? We're going to perish. We're going to die. Jesus came walking on the water. It's amazing. And they see that Jesus has power even over the winds and the waves. Listen, there are times in which He's trying to develop us. There are times in which He's trying to bring us into contact with someone that needs to hear the truth of the gospel. And it may be through the time of difficulty, the time of trial, that in that very moment that God is orchestrating it in such a way that He's bringing you into the very presence of someone that maybe a mother and a father have prayed for, that they would understand the truth of the gospel. And God says, here's someone that I can bring in their life and share the gospel with them. That's how God works. If we'd let Him. God, what are you trying to teach me in this moment of difficulty? How are you trying to develop me? Who is it that I'm here for? Who is it that you want me to be able to reach? But if we're too busy complaining and murmuring about our circumstances and we're just, woe is me, and we have the Eeyore syndrome, oh bother, then we miss it all. Right? We miss it all. Paul doesn't pray for deliverance. Notice how Paul requests prayer. Notice, number one, he says this, that God would open unto us a door of utterance. As I think about that phraseology, we understand that he's praying that God would open the door, not that we would kick down a door, not that we would make our own opportunity, but that God would open a door of utterance for us, that God would work in such a way that He would orchestrate that which needs to be orchestrated and that it's not by my own engineering of an opportunity and me trying to orchestrate this and that, but seeking God's face to open up a door of utterance. Notice what he says, that He would open up this door of utterance. I believe that we could use a phraseology and say that He says, open unto us a door of utterance, that it's for me to have an opportunity. For me to have an opportunity. I wonder how often do we pray that God would give us opportunities? Just a couple of weeks ago, as we looked at the last section of chapter 3 and the first verse of chapter 4, we dealt with the truth of being in the workplace and really the idea of revival happening in our workplace and how God has you in that place for a purpose, for a reason, and that as we would consider our missions map and think about the missionaries that we support all across the world, that as we would understand that we as the church, as you would go into your workplace tomorrow, that really we focus upon the fact that you're a missionary in that place. Have you been praying for that opportunity? Have you been praying for that individual? God, would you open up a door of utterance? Would you move and work in such a way that you would open it? Make it clear and help me, God, to seize the opportunity. Notice what he says, not only that God would open unto us a door of utterance, but notice what he says, to speak the mystery of Christ, for which I am also in bonds. You know what he, the opportunity that he seeks? To speak of Christ. Open up a door of utterance that I can, that I can speak of the mystery of Christ, that I can preach the gospel. He speaks about the mystery of Christ in the first chapter of Christ in you, the hope of glory. And you think about the opportunity that he's asking for these believers in Colossae, would you pray for me? Now understand, as you think about the Apostle Paul, and you think about reading his life and his ministry, do you really think this is somebody that you would say, he needs prayer that God would open up his mouth that he would speak? No, everywhere he goes he's preaching the gospel. But you know why I believe that is? Because he's constantly asking people to pray that God would give him boldness to open his mouth as he should. Notice in Ephesians, what he says in Ephesians 6, as he's, after he gives all of the information with regard to the armor of God, and he encourages these believers in Ephesus with regard to the spiritual battle in which we're engaged in, and he speaks about prayer in verse number 18, and notice in verse number 19, and for me, pray for all the saints, but pray for me that utterance may be given unto me, that I may open my mouth boldly to make known the mystery of the gospel, for which I am an ambassador in bonds, that therein I may speak boldly as I ought to speak. He's employing as many people as he can to pray for him that God would open up doors of utterance, that God would give him boldness, that God would enable him, empower him to speak the mystery of Christ. Oh, that ought to be one of the number one prayer requests that we're praying for one another. That ought to be something that I'm saying, would you pray for me? Someone says, hey, how can I pray for you? Let me tell you, would you pray that God would give me boldness to open my mouth and speak the mystery of Christ as I should? Has anyone ever asked you that? Amen. One. I don't know how many people are here, but one. It's not common, but oh, it's necessary. Can you imagine if we really begin to pray this way, that we'd understand the purpose of God, that we'd understand that he's left us here as ambassadors, that he sent us, that we are his representatives, we are his witnesses. This is a consistent petition that we see throughout the word of God, that we see in the life of the apostle Paul. He says in verse number four, that I may make it, speaking of the mystery of Christ, the gospel of Christ, that I may make it manifest as I ought to speak. He says this to the believers in Thessalonica. He says very simply in 1 Thessalonians chapter number 5 and verse 25, brethren, pray for us, and there's no real detail that's given with regard to the request, but in chapter number 3 of 2 Thessalonians, in verse number 1, Paul says this to these believers in this church, finally, brethren, pray for us that the word of the Lord may have free course and be glorified even as it is with you. This was a consistent petition from Paul. When he understands the privilege of prayer and he's seeking to engage these believers in Colossae, listen, continue in prayer, recognize the privilege that you have to go before the throne room of heaven and pray, and continue in prayer, and watch in the same with thanksgiving. And then he says, with all, also praying for us. Here's how I want you to pray for me, how I want you to pray for us, that we would speak the mystery of Christ, that God would open up a door of utterance. Wow! I'd like to believe that the people in Ephesus, and the people in Colossae, and the people in Thessalonica, the church members of these particular churches that we've referenced these verses of Scripture, I'd like to believe that they engaged in this prayer for Paul, that they took the request seriously, and they engaged in prayer, and they saw God, they heard how God worked. God used Paul in a great way. When you think about God using men, oftentimes you'll find that there are people that are praying. Many of us know of C. H. Spurgeon. I had the opportunity a number of years ago when we were visiting my brother while he was stationed in England to go to the Metropolitan Tabernacle. And as I went to the Metropolitan Tabernacle, I was not aware of the fact that it's only a portion of the size that it once was under the ministry of C. H. Spurgeon. And as I was speaking with the man in the bookstore, they have a bookstore that's open, and we were able to go into the auditorium, and we were able to walk around the auditorium. And I asked him if he would show me the place where the pulpit was where Mr. Spurgeon preached from, and if he would be able to show me the basement area of underneath of that pulpit where there were men that gathered and prayed. And he said, Sir, I'm thankful that you know about that, but unfortunately... that portion of the building is no longer owned by us, it was torn down and they did some remodeling and so on and so forth, and so I was not able to see it. But if you understand and you read some things about C.H. Spurgeon, you'll find that many times they would ask him about the power in his ministry and he would refer to a room that was in the basement underneath the pulpit, directly under where the pulpit sat in that metropolitan tabernacle. There were no less than 100 men each service that he was preaching that were gathered in that place praying for God's power. Is there any wonder why God used him in the way in which he did? People were praying, they were seeking the face of God, understanding that God is able, that God uses his word, that God blesses and answers prayer, and so the Apostle Paul, as he's writing to these believers under the inspiration of the Holy Spirit of God, he says, number one, recognize the privilege of prayer. He then gives them a petition from Paul, this request that is given specifically with regard to having this door of utterance open that God would move and work and give opportunities. And I would submit to you that as we conclude this morning by looking at these few verses of Scripture, that this is a pattern for God's people. It's a pattern for God's people. I'm encouraged as I read the word of God. I'm comforted as I read the word of God and see that we serve a God who hears and answers prayer. I'm encouraged and I'm comforted when I see how God answers prayer. We could speak of a number of times throughout the word of God. I'll use one simple illustration of Hannah when she was praying and she's pouring her heart out to God. God answered. Samuel was born. Give you a New Testament illustration in Acts chapter number four. The people of God are under persecution because of what has happened and they're threatened and they're told not to speak anymore in the name of the Lord Jesus Christ. And what do they do? They gather together and they pray. And as they pray, they make this request that God would grant us boldness, that we would speak the word of God. And guess what? Just a couple of verses after the prayer, God gives them, God answers and God blesses. I mentioned by way of introduction that we understand the importance of prayer, but at times in our lives, we've neglected prayer. I believe that as we would neglect prayer, that really what we're doing is we're missing out on seeing God work. We're missing out on seeing what God is able to do. Simply because we don't pray. Simply because we try our own way. We try to figure it out. I've said this before. It's not just true of our church, though it is true of our church. It's true of churches all across this nation. I would say that one of the most important meetings of a church is the prayer meeting. But it is regularly the least attended meeting of any church. Regularly. What does that show about what we believe about prayer? We just simply can neglect it. We don't see the significance of it, the importance of it. We are able to just skip it or miss it. But the reality is that this is a pattern for the people of God. How many of you have read the book of Acts? We've read the book of Acts. How many times when you read the book of Acts, you say, man, isn't that exciting what God's doing? Look at how God is moving. Look at how God is working. Let's take a quick journey through the book of Acts. Begin in the first chapter. It's not every verse that deals with the subject matter, but I just want to take a quick survey through the book of Acts in closing this morning. Why, because when I think about the book of Acts and I think about how God is moving and working in the first century church and we read the book of Acts and we read it and we say, man, look at what God is doing. Look at how God is working. There are 3,000 saved, there are 5,000 saved, there's a multitude saved, there are multitudes saved. God is working and moving. But you'll find out that the people of God are praying. They're praying. Look in Acts one. Look in verse number 14. The Bible said, these all continued with one accord in what, in prayer and supplication with the women and Mary the mother of Jesus and with his brethren. Look over in chapter number two. After the day of Pentecost, after they received the word and were baptized, according to verse number 41, there were 3,000 souls added to the church. Notice what the Bible tells us in verse number 42 of Acts chapter number two. And they continued steadfastly in the apostles' doctrine and fellowship and in breaking of bread and in prayers. They're praying. Notice in chapter number four. I mentioned this just a moment ago. That New Testament illustration or example that is given to us, they faced threats and faced this interrogation. In verse number 23, the Bible says, in being let go, they went to their own company. The disciples, John and Peter, that were there standing before the religious group that were giving them this difficulty, they go to their own company, to the church. And it says that they reported all that the chief priests and elders had said unto them. And when they heard that, what did they do? They lifted up their voice to God with one accord. What is that? It's prayer. It's prayer. They lifted up their voice to God with one accord and said, Lord, Thou art God, which has made heaven and earth and the sea and all that in them is. You think about the beginning of their prayer here in verse number 24. And you think about the way in which that's the God that we serve. That's the God that we pray to. He is the Lord God omnipotent. He's Jehovah. He created everything. He sustains everything. He is able to do anything. You think about Hezekiah. When Sennacherib and they come and they seize and they try to take over, they've already taken the northern tribe captive Israel. And now Judah is under attack. And Hezekiah, what does he do? He prays. Listen, he understood that Sennacherib and Rabshakeh had made these threats. And Rabshakeh says, hey, listen, we've conquered everybody else. What are you going to do? He says to the people, don't let Hezekiah deceive you into trusting God. You know what Hezekiah does after he gets those letters? He lays them out before God. And he says, God, you're the Creator. You've made everything. This is nothing for you. Amen? He sought God. Here, the immediate response, unfortunately in our lives, there are times in which prayer is not our immediate response to the difficulty. It's our last resort. But we don't go to God immediately. We don't seek His face immediately. But the church in Acts 4, as soon as they heard that, they lifted up their voice to God with one accord. They immediately responded with prayer. Go over to chapter 6 and look in verse 4. There's some trouble in the church. And the deacons are sought out, these men. And the Bible says in verse 4, as the disciples would speak here, but we will give ourselves continually to prayer and to the ministry of the word. Give ourselves continually to prayer and to the ministry of the word. Why? Because they understood the significance of prayer. They understood the significance of prayer. Notice in chapter number 12, it's an exciting portion of scripture. In fact, I had the privilege on Thursday to preach chapel over at Fairfax Baptist Temple Academy. And for the younger students, I preached from Acts 12. And for the older students, I preached from the book of 1 Samuel. But Acts 12, this is where James was killed. Peter's in prison. Herod's going to kill James. He's already killed James. He now wants to kill Peter. But the Bible tells us that when Peter was in prison, notice in verse number 5, Peter therefore was kept in prison, but prayer was made without ceasing of the church unto God for him. They had a prayer meeting. If you look in chapter number 12 and verse number 12, the last phrase of the verse of scripture says, where many were gathered together praying. You notice that they prayed without ceasing unto God for him because of the circumstance, because of the situation. And then when he's released, they're astonished. They can't even believe. Rhoda's so excited, she forgets to open the door. She goes running back in and says, hey, Peter's knocking at the door. And they said, you're crazy. You're mad. And there's Peter still knocking. And they let him in. And the Bible tells us that, verse number 17, he beckoning unto them with the hand to hold their peace. I think there was excitement. Peter, what happened? How did you? Can you imagine? You've been praying. Peter's in prison. And now Peter's where you are. You want to know what happened. Everyone's talking, trying to figure it out. And Peter, beckoning unto them with their hand to hold their peace, he declared unto them how the Lord had brought him out of the prison. That had to be exciting because our God answers prayer. But we miss out on seeing what God's able to do because we neglect prayer. Notice, keep going with me, chapter 13 and verse number 3. Notice here, this is the first missionary journey. And God, the Holy Spirit of God says in verse number 2, as they ministered to the Lord and fasted, the Holy Ghost said, separate me, Barnabas. and Saul, for the work whereinto I have called them. And when they had fasted and prayed, and laid their hands on them, they sent them away.\" I believe that not only did the church here at Antioch pray for these as they went out on this first missionary journey, but I would argue that they prayed for them during the entirety of the missionary journey. And that's why at the end of chapter number 14, when they return from this missionary journey, and they're going to announce that they're going to be there to give an update that the people show up. Why? Because they want to hear how God answered prayer. And if you look at the end of chapter number 14 in the middle of verse number 27, it says that they rehearsed all that God had done with them. When we hear these update letters from our missionaries, when we hear of how God is working, listen, it's exciting to us if we've been praying for them. Because we get to hear how God's answering our prayers. We're praying for people that sometimes we don't even know. We have missionaries that we've supported from before the time I got here as pastor that we still support today that I've not met them face to face. I've had interaction with them. They've not been able to leave their field for a period of time to be able to come for furlough and so on and so forth. And I've had correspondence with them, but I've not met them face to face. And yet we pray for them and we see how God works. We see what God does. That's why missions conferences are so exciting to me. Why? Because we get to hear what God's doing in the lives of these missionaries. We're invested in it. We're not only giving to it, but we're also praying for them. We find that in chapter number 16 and verse number 25. Notice what the Bible says here. They're in a situation there in Philippi, and they're imprisoned, Paul and Silas. And the Bible says in Acts 16 and 25, and at midnight, Paul and Silas, what does it say? They prayed and they sang praises unto God, and the prisoners heard them. What did God do? There's a great earthquake. God released them. Can you think about the impact that this must have had in Philippi? As Paul writes back to the believers in Philippi in the letter that we call the Book of Philippians, I think about this jailer. He will soon say, sirs, what must I do to be saved? Paul and Silas didn't lift up their voice and complain about their circumstances. They didn't lift up their voice and have everyone hear them in a wrong manner. No, they lifted up their voices and they prayed and they sang praises unto God. You say, how could we praise God in such a situation? Because God's in control. Were they rightly imprisoned? No, they weren't. But sometimes, even when things from a human perspective don't seem to be right, God is still in control of that. How many times I've heard people say, well, that just wasn't supposed to be this way, and this happened and that happened, and these people this and those people that. God's over all of that. Amen? And if God still let it happen, then God let it happen. And I'm not going to waste my time trying to figure out how to reverse something and why I'm going to be upset about it and so on and so forth. I'm just going to press on and serve God. Chapter 21, verse 5. Again, we could look at a number of additional references throughout the book of Acts. Here in Acts 21, Paul's gathered with some of the believers and they tarried there for seven days. He was going to Jerusalem. And it tells us in verse 5, and when we'd accomplished those days, we departed and went our way, and they all brought us on our way with wives and children until we were out of the city and we kneeled down on the shore and prayed. And prayed. It's exciting to read the book of Acts. It's exciting to see what God did and how God worked and how the Gospel there in Jerusalem influenced so many and the church exploded with membership and attendance. But God did not intend that the Gospel simply stay in Jerusalem. He had given the specific instruction as recorded in Acts 1 that they're to be in Jerusalem and Judea and Samaria and unto the uttermost part of the earth after they're endued with power of the Holy Ghost. And we find that it's in Acts 8 as that persecution intensifies that they're scattered abroad and they went everywhere preaching the Word. And you begin to see how God's purposes are being fulfilled. And it's being fulfilled through persecution in Acts chapter number 8. That's what caused them to be scattered abroad but they went everywhere preaching the Word. And you begin to see how the Gospel reached just the known world throughout the book of Acts. And you begin to understand the implications of all that takes place in the book of Acts. And you say, there's a key. And it's prayer. And to the believers in Colossae as Paul is wrapping up this book under the inspiration of the Holy Spirit of God, he says in verse 2, continue in prayer. Continue in prayer. We recognize this morning the privilege that it is that is ours to pray. It's a great privilege that we can go before the throne room of heaven and seek the face of God and know that He hears us and know that He's able. It's not just some kind of wishful I hope these things are going to happen, I hope God hears me. No, no, we have confidence that He hears us. The petition from Paul not only continue in prayer and watch in the same with Thanksgiving, but for us, the door of utterance would be open unto us, that we would speak the mystery of God, that we would do what we're supposed to do, that we would pray one for another, that we would be the ambassadors, the witnesses that God's called us to be. It's a pattern for God's people. Prayer is not something that we just, yep, I had my time of prayer. It's not just some rote religion. It's talking to God. He's the creator of the universe. And knowing that He hears us and He answers us, it's amazing. It's phenomenal. We see throughout the Word of God this pattern that has been established. It seems as if in the busyness of life, I understand we live in a busy, busy time. It's amazing to me how busy we are. Because we have more modern conveniences than we've ever had. We have a washing machine. You know what the alternative is? You know what they did 150 years ago? They didn't have no washing machines. Right? We got grocery stores. I could go on and on of all the modern conveniences that we have. And yet we have less time than we seem to have ever had. Right? The enemy doesn't want us to pray. But we need to understand this pattern of prayer that is established in the Word of God Continue in prayer. Watch in the same with Thanksgiving. That we would have that encouragement that Paul gives these believers in Colossae. And we'd say, you know what? I need to make this a priority. Because when I pray, I get to see what God can do. And God can do more than any of us can do, than all of us can do collectively. He can do more. Amen? Oh, that we'd be people of prayer. Let's pray together. Father, we love You. We thank You so much for loving us. Thank You for this instruction, this admonition. I'm encouraged as I read the portion of Scripture. I'm also challenged. Lord, I pray that You would help us to be honest with ourselves and with You with regard to the subject of prayer. If we've neglected prayer, would You help us to acknowledge that and confess it? Lord, would You help us to make commitments to engage in prayer, to intercede on the behalf of one another, knowing that You're able to do exceeding abundantly above all that we ask or think? Would You help us to understand as we consider the great acts that we read of in the book of Acts, how that it was a people that prayed, and they saw You work? God, help us to be a praying church, a praying people. I pray that You'd move and work as only You can as we have an opportunity to respond. As the Holy Spirit of God has worked in hearts and lives, would You help us to say, yes, Lord, yes? Would You help us, Lord, to do business with You in these moments? We'll thank You for it in Christ's name we pray. Would You stand?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.5999999046325684,
      "text": " to have some folks visiting with us this morning."
    },
    {
      "id": 1,
      "start": 2.5999999046325684,
      "end": 4.0,
      "text": " We thank you for being here."
    },
    {
      "id": 2,
      "start": 4.0,
      "end": 5.960000038146973,
      "text": " Is that Brad?"
    },
    {
      "id": 3,
      "start": 5.960000038146973,
      "end": 7.360000133514404,
      "text": " Yes, amen."
    },
    {
      "id": 4,
      "start": 7.360000133514404,
      "end": 11.199999809265137,
      "text": " And I wasn't sure you had a mask on when I saw you,"
    },
    {
      "id": 5,
      "start": 11.199999809265137,
      "end": 12.119999885559082,
      "text": " and now you don't."
    },
    {
      "id": 6,
      "start": 12.119999885559082,
      "end": 14.760000228881836,
      "text": " So I was like, did he have a beard or not?"
    },
    {
      "id": 7,
      "start": 14.760000228881836,
      "end": 17.200000762939453,
      "text": " But anyway, good to have you here, you and your wife"
    },
    {
      "id": 8,
      "start": 17.200000762939453,
      "end": 18.0,
      "text": " and son."
    },
    {
      "id": 9,
      "start": 18.0,
      "end": 21.520000457763672,
      "text": " And we met Brad on Friday over at Jordan Kitts"
    },
    {
      "id": 10,
      "start": 21.520000457763672,
      "end": 23.079999923706055,
      "text": " as we're looking for a new piano."
    },
    {
      "id": 11,
      "start": 23.079999923706055,
      "end": 25.260000228881836,
      "text": " And he's here this morning with his family."
    },
    {
      "id": 12,
      "start": 25.260000228881836,
      "end": 26.8799991607666,
      "text": " Certainly thankful to have him."
    },
    {
      "id": 13,
      "start": 26.8799991607666,
      "end": 28.719999313354492,
      "text": " Trust the service will be a blessing to you."
    },
    {
      "id": 14,
      "start": 28.719999313354492,
      "end": 30.600000381469727,
      "text": " Colossians chapter number 4, we're"
    },
    {
      "id": 15,
      "start": 30.600000381469727,
      "end": 32.880001068115234,
      "text": " looking at verses 2 through 4 this morning, of course,"
    },
    {
      "id": 16,
      "start": 32.880001068115234,
      "end": 34.720001220703125,
      "text": " our theme for this year, Complete in Christ."
    },
    {
      "id": 17,
      "start": 34.720001220703125,
      "end": 37.52000045776367,
      "text": " And I am so thankful for the book of Colossians."
    },
    {
      "id": 18,
      "start": 37.52000045776367,
      "end": 39.2400016784668,
      "text": " I'm thankful for the Bible, amen."
    },
    {
      "id": 19,
      "start": 39.2400016784668,
      "end": 42.31999969482422,
      "text": " And all of it is good, and it's profitable,"
    },
    {
      "id": 20,
      "start": 42.31999969482422,
      "end": 43.47999954223633,
      "text": " is what God tells us."
    },
    {
      "id": 21,
      "start": 43.47999954223633,
      "end": 46.439998626708984,
      "text": " All scripture is given by inspiration of God,"
    },
    {
      "id": 22,
      "start": 46.439998626708984,
      "end": 47.63999938964844,
      "text": " and it is profitable."
    },
    {
      "id": 23,
      "start": 47.63999938964844,
      "end": 51.0,
      "text": " And I'm so thankful how God's word helps us"
    },
    {
      "id": 24,
      "start": 51.0,
      "end": 53.0,
      "text": " as we've studied through the book of Colossians"
    },
    {
      "id": 25,
      "start": 53.0,
      "end": 54.439998626708984,
      "text": " here on Sunday mornings."
    },
    {
      "id": 26,
      "start": 54.439998626708984,
      "end": 56.7599983215332,
      "text": " We've learned many valuable lessons."
    },
    {
      "id": 27,
      "start": 56.7599983215332,
      "end": 58.400001525878906,
      "text": " And as we come to this fourth chapter,"
    },
    {
      "id": 28,
      "start": 58.400001525878906,
      "end": 61.63999938964844,
      "text": " of course, we dealt with the first verse coupled together"
    },
    {
      "id": 29,
      "start": 61.63999938964844,
      "end": 64.83999633789062,
      "text": " with the last section of chapter number 3 a couple of weeks ago."
    },
    {
      "id": 30,
      "start": 64.83999633789062,
      "end": 66.55999755859375,
      "text": " But as we look at the fourth chapter,"
    },
    {
      "id": 31,
      "start": 66.55999755859375,
      "end": 69.36000061035156,
      "text": " we see really that the letter, it kind of"
    },
    {
      "id": 32,
      "start": 69.36000061035156,
      "end": 73.68000030517578,
      "text": " shifts as far as the instruction and kind of some final remarks"
    },
    {
      "id": 33,
      "start": 73.68000030517578,
      "end": 74.5999984741211,
      "text": " and what have you."
    },
    {
      "id": 34,
      "start": 74.5999984741211,
      "end": 76.44000244140625,
      "text": " And as we look at this portion of scripture,"
    },
    {
      "id": 35,
      "start": 76.44000244140625,
      "end": 78.31999969482422,
      "text": " I do trust that it will be a blessing to you this morning,"
    },
    {
      "id": 36,
      "start": 78.31999969482422,
      "end": 80.4800033569336,
      "text": " that it would encourage us and challenge us"
    },
    {
      "id": 37,
      "start": 80.4800033569336,
      "end": 82.16000366210938,
      "text": " in our walk with Christ."
    },
    {
      "id": 38,
      "start": 82.16000366210938,
      "end": 84.80000305175781,
      "text": " The Bible begins in verse number 2 by saying this,"
    },
    {
      "id": 39,
      "start": 84.80000305175781,
      "end": 91.12000274658203,
      "text": " continue in prayer and watch in the same with thanksgiving,"
    },
    {
      "id": 40,
      "start": 91.12000274658203,
      "end": 95.31999969482422,
      "text": " with all praying also for us, that God would open unto us"
    },
    {
      "id": 41,
      "start": 95.31999969482422,
      "end": 99.72000122070312,
      "text": " a door of utterance to speak the mystery of Christ,"
    },
    {
      "id": 42,
      "start": 99.72000122070312,
      "end": 105.23999786376953,
      "text": " for which I am also in bonds, that I may make it manifest"
    },
    {
      "id": 43,
      "start": 105.23999786376953,
      "end": 107.95999908447266,
      "text": " as I ought to speak."
    },
    {
      "id": 44,
      "start": 107.95999908447266,
      "end": 110.55999755859375,
      "text": " As we look at this particular passage of scripture,"
    },
    {
      "id": 45,
      "start": 110.55999755859375,
      "end": 113.5999984741211,
      "text": " the subject of prayer is obviously before us."
    },
    {
      "id": 46,
      "start": 113.5999984741211,
      "end": 116.44000244140625,
      "text": " As you study through the word of God, as you read the scriptures,"
    },
    {
      "id": 47,
      "start": 116.44000244140625,
      "end": 120.68000030517578,
      "text": " you will notice that there's an obvious emphasis on prayer."
    },
    {
      "id": 48,
      "start": 120.68000030517578,
      "end": 124.72000122070312,
      "text": " I'm thankful that God gives us many promises with regard to prayer."
    },
    {
      "id": 49,
      "start": 124.72000122070312,
      "end": 128.83999633789062,
      "text": " He's given us much instruction with regard to the subject matter of prayer."
    },
    {
      "id": 50,
      "start": 128.83999633789062,
      "end": 130.8800048828125,
      "text": " And we think about those wonderful promises"
    },
    {
      "id": 51,
      "start": 130.8800048828125,
      "end": 135.16000366210938,
      "text": " that we hold dear when we consider the subject matter of prayer."
    },
    {
      "id": 52,
      "start": 135.16000366210938,
      "end": 137.75999450683594,
      "text": " We have the privilege as we read the word of God"
    },
    {
      "id": 53,
      "start": 137.75999450683594,
      "end": 143.1999969482422,
      "text": " to read how the people of God sought the face of God through prayer,"
    },
    {
      "id": 54,
      "start": 143.1999969482422,
      "end": 147.60000610351562,
      "text": " how the word of God records the prayers of many,"
    },
    {
      "id": 55,
      "start": 147.60000610351562,
      "end": 149.9199981689453,
      "text": " that we have the privilege of reading."
    },
    {
      "id": 56,
      "start": 149.9199981689453,
      "end": 152.52000427246094,
      "text": " And not only do we have the privilege of reading those prayers,"
    },
    {
      "id": 57,
      "start": 152.52000427246094,
      "end": 157.63999938964844,
      "text": " but then we have the privilege of seeing how God answers those prayers."
    },
    {
      "id": 58,
      "start": 157.63999938964844,
      "end": 159.8800048828125,
      "text": " And the reality is that as we think about praying"
    },
    {
      "id": 59,
      "start": 159.8800048828125,
      "end": 161.67999267578125,
      "text": " and we think about the subject of prayer,"
    },
    {
      "id": 60,
      "start": 161.67999267578125,
      "end": 165.72000122070312,
      "text": " we understand, I believe, that each of us that are gathered here this morning"
    },
    {
      "id": 61,
      "start": 165.72000122070312,
      "end": 169.24000549316406,
      "text": " would readily acknowledge that prayer is important,"
    },
    {
      "id": 62,
      "start": 169.24000549316406,
      "end": 173.47999572753906,
      "text": " that prayer is necessary and it's a unique privilege for the child of God."
    },
    {
      "id": 63,
      "start": 173.47999572753906,
      "end": 176.83999633789062,
      "text": " The reality, however, is there are times in our lives"
    },
    {
      "id": 64,
      "start": 176.83999633789062,
      "end": 181.47999572753906,
      "text": " when we find that praying is neglected."
    },
    {
      "id": 65,
      "start": 181.47999572753906,
      "end": 182.63999938964844,
      "text": " Why is that so?"
    },
    {
      "id": 66,
      "start": 182.63999938964844,
      "end": 184.52000427246094,
      "text": " We understand the importance of it."
    },
    {
      "id": 67,
      "start": 184.52000427246094,
      "end": 188.0399932861328,
      "text": " We understand that it moves the hand of God."
    },
    {
      "id": 68,
      "start": 188.0399932861328,
      "end": 191.27999877929688,
      "text": " We understand that we're praying to the God of the impossible,"
    },
    {
      "id": 69,
      "start": 191.27999877929688,
      "end": 195.83999633789062,
      "text": " the God who said, I can do anything, that there's nothing too hard for me."
    },
    {
      "id": 70,
      "start": 195.83999633789062,
      "end": 197.47999572753906,
      "text": " He said that He's able to do exceeding,"
    },
    {
      "id": 71,
      "start": 197.47999572753906,
      "end": 200.67999267578125,
      "text": " abundantly above all that we ask or think."
    },
    {
      "id": 72,
      "start": 200.67999267578125,
      "end": 203.9600067138672,
      "text": " And yet, as the people of God, there are times in our lives,"
    },
    {
      "id": 73,
      "start": 203.9600067138672,
      "end": 206.60000610351562,
      "text": " if you would be honest and if I would be honest,"
    },
    {
      "id": 74,
      "start": 206.60000610351562,
      "end": 212.0,
      "text": " there are times in our lives when we neglect prayer."
    },
    {
      "id": 75,
      "start": 212.0,
      "end": 213.52000427246094,
      "text": " We understand what prayer is."
    },
    {
      "id": 76,
      "start": 213.52000427246094,
      "end": 216.39999389648438,
      "text": " We understand the importance and the significance of prayer."
    },
    {
      "id": 77,
      "start": 216.39999389648438,
      "end": 219.39999389648438,
      "text": " But yet we fail to pray."
    },
    {
      "id": 78,
      "start": 219.39999389648438,
      "end": 220.27999877929688,
      "text": " Why is that so?"
    },
    {
      "id": 79,
      "start": 220.27999877929688,
      "end": 222.9600067138672,
      "text": " Well, prayer is spiritual battle."
    },
    {
      "id": 80,
      "start": 222.9600067138672,
      "end": 227.36000061035156,
      "text": " The enemy, the adversary, he doesn't want us to engage in prayer."
    },
    {
      "id": 81,
      "start": 227.36000061035156,
      "end": 229.1199951171875,
      "text": " He wants to distract us from praying."
    },
    {
      "id": 82,
      "start": 229.1199951171875,
      "end": 231.83999633789062,
      "text": " He wants us to think that it's not going to really matter."
    },
    {
      "id": 83,
      "start": 231.83999633789062,
      "end": 233.9199981689453,
      "text": " It's not going to impact or affect anything."
    },
    {
      "id": 84,
      "start": 233.9199981689453,
      "end": 237.9199981689453,
      "text": " And he wants to get us busy and tied up with all sorts of other things."
    },
    {
      "id": 85,
      "start": 237.9199981689453,
      "end": 239.67999267578125,
      "text": " And he wants to get us distracted."
    },
    {
      "id": 86,
      "start": 239.67999267578125,
      "end": 242.0399932861328,
      "text": " How many times in your life, how many times in my life,"
    },
    {
      "id": 87,
      "start": 242.0399932861328,
      "end": 245.47999572753906,
      "text": " more than I'd like to really acknowledge, you"
    },
    {
      "id": 88,
      "start": 245.47999572753906,
      "end": 248.8800048828125,
      "text": " enter into your time of prayer and distractions come."
    },
    {
      "id": 89,
      "start": 248.8800048828125,
      "end": 250.52000427246094,
      "text": " The phone rings."
    },
    {
      "id": 90,
      "start": 250.52000427246094,
      "end": 251.9199981689453,
      "text": " Someone knocks at the door."
    },
    {
      "id": 91,
      "start": 251.9199981689453,
      "end": 254.0,
      "text": " You get a text message, whatever it might be."
    },
    {
      "id": 92,
      "start": 254.0,
      "end": 256.8800048828125,
      "text": " And the distractions, if you have little ones,"
    },
    {
      "id": 93,
      "start": 256.8800048828125,
      "end": 259.8800048828125,
      "text": " the little ones need your attention and they want this"
    },
    {
      "id": 94,
      "start": 259.8800048828125,
      "end": 261.9599914550781,
      "text": " and they need that and so on and so forth."
    },
    {
      "id": 95,
      "start": 261.9599914550781,
      "end": 266.1600036621094,
      "text": " And it just seems as if the distractions abound."
    },
    {
      "id": 96,
      "start": 266.1600036621094,
      "end": 268.9599914550781,
      "text": " It's labor."
    },
    {
      "id": 97,
      "start": 268.9599914550781,
      "end": 271.0,
      "text": " It's battle."
    },
    {
      "id": 98,
      "start": 271.0,
      "end": 274.1199951171875,
      "text": " And as we look at the passage of Scripture,"
    },
    {
      "id": 99,
      "start": 274.1199951171875,
      "end": 277.1600036621094,
      "text": " we understand that we've been instructed to pray."
    },
    {
      "id": 100,
      "start": 277.1600036621094,
      "end": 280.0400085449219,
      "text": " We understand really the importance of prayer."
    },
    {
      "id": 101,
      "start": 280.0400085449219,
      "end": 281.9599914550781,
      "text": " We understand the impact of prayer as we"
    },
    {
      "id": 102,
      "start": 281.9599914550781,
      "end": 287.0400085449219,
      "text": " read of how God worked and how God continues to work."
    },
    {
      "id": 103,
      "start": 287.0400085449219,
      "end": 290.9599914550781,
      "text": " And we find here that the passage of Scripture"
    },
    {
      "id": 104,
      "start": 290.9599914550781,
      "end": 296.3599853515625,
      "text": " has this phrase, continue in prayer, in verse number two."
    },
    {
      "id": 105,
      "start": 296.3599853515625,
      "end": 299.8800048828125,
      "text": " I want to use that as our title for our message"
    },
    {
      "id": 106,
      "start": 299.8800048828125,
      "end": 303.0799865722656,
      "text": " this morning as we think about this subject matter of prayer."
    },
    {
      "id": 107,
      "start": 303.0799865722656,
      "end": 304.8399963378906,
      "text": " It's of great interest to me that as you"
    },
    {
      "id": 108,
      "start": 304.8399963378906,
      "end": 308.1199951171875,
      "text": " think about the disciples as they walked with the Lord Jesus Christ"
    },
    {
      "id": 109,
      "start": 308.1199951171875,
      "end": 310.3999938964844,
      "text": " and they observed so many wonderful things."
    },
    {
      "id": 110,
      "start": 310.3999938964844,
      "end": 312.79998779296875,
      "text": " And I mean, if you study through the Gospel records"
    },
    {
      "id": 111,
      "start": 312.79998779296875,
      "end": 315.9200134277344,
      "text": " and you read of the life and ministry of the Lord Jesus"
    },
    {
      "id": 112,
      "start": 315.9200134277344,
      "end": 319.4800109863281,
      "text": " Christ and how the disciples had the privilege of not only"
    },
    {
      "id": 113,
      "start": 319.4800109863281,
      "end": 323.8800048828125,
      "text": " walking with Him, but seeing Him do great things."
    },
    {
      "id": 114,
      "start": 323.8800048828125,
      "end": 326.8800048828125,
      "text": " But of all the things that they observed,"
    },
    {
      "id": 115,
      "start": 326.8800048828125,
      "end": 331.3999938964844,
      "text": " there's only one thing that they said to the Lord to teach us."
    },
    {
      "id": 116,
      "start": 331.3999938964844,
      "end": 334.0799865722656,
      "text": " It's found in Luke, in chapter number 11, when they say,"
    },
    {
      "id": 117,
      "start": 334.0799865722656,
      "end": 335.9200134277344,
      "text": " you don't need to turn there, but he says,"
    },
    {
      "id": 118,
      "start": 335.9200134277344,
      "end": 337.44000244140625,
      "text": " we don't know who the disciple is."
    },
    {
      "id": 119,
      "start": 337.44000244140625,
      "end": 338.55999755859375,
      "text": " It's an unnamed disciple."
    },
    {
      "id": 120,
      "start": 338.55999755859375,
      "end": 340.67999267578125,
      "text": " I like to think it's Peter, because Peter's always"
    },
    {
      "id": 121,
      "start": 340.67999267578125,
      "end": 342.3599853515625,
      "text": " the one that's talking."
    },
    {
      "id": 122,
      "start": 342.3599853515625,
      "end": 348.0799865722656,
      "text": " He says, Lord, teach us to pray."
    },
    {
      "id": 123,
      "start": 348.0799865722656,
      "end": 352.32000732421875,
      "text": " Lord, teach us to do miracles."
    },
    {
      "id": 124,
      "start": 352.32000732421875,
      "end": 353.32000732421875,
      "text": " No."
    },
    {
      "id": 125,
      "start": 353.32000732421875,
      "end": 356.5199890136719,
      "text": " Lord, teach us how to multiply the bread and the fish"
    },
    {
      "id": 126,
      "start": 356.5199890136719,
      "end": 360.67999267578125,
      "text": " and teach us how to heal people and teach us how to, no, no."
    },
    {
      "id": 127,
      "start": 360.67999267578125,
      "end": 363.6400146484375,
      "text": " Teach us to pray."
    },
    {
      "id": 128,
      "start": 363.6400146484375,
      "end": 365.2799987792969,
      "text": " Isn't that significant?"
    },
    {
      "id": 129,
      "start": 365.2799987792969,
      "end": 368.79998779296875,
      "text": " It's of interest that of all the things"
    },
    {
      "id": 130,
      "start": 368.79998779296875,
      "end": 372.8800048828125,
      "text": " that the disciples could have asked the Lord to teach them,"
    },
    {
      "id": 131,
      "start": 372.8800048828125,
      "end": 375.0799865722656,
      "text": " we find recorded in the Word of God for us"
    },
    {
      "id": 132,
      "start": 375.0799865722656,
      "end": 380.3999938964844,
      "text": " that they say, Lord, teach us to pray."
    },
    {
      "id": 133,
      "start": 380.3999938964844,
      "end": 381.55999755859375,
      "text": " Teach us to pray."
    },
    {
      "id": 134,
      "start": 381.55999755859375,
      "end": 383.20001220703125,
      "text": " As we look at the passage of Scripture,"
    },
    {
      "id": 135,
      "start": 383.20001220703125,
      "end": 385.67999267578125,
      "text": " I want you to notice, number one, if you're taking notes,"
    },
    {
      "id": 136,
      "start": 385.67999267578125,
      "end": 388.239990234375,
      "text": " the privilege to pray."
    },
    {
      "id": 137,
      "start": 388.239990234375,
      "end": 390.3999938964844,
      "text": " Prayer is a unique privilege that's"
    },
    {
      "id": 138,
      "start": 390.3999938964844,
      "end": 392.8800048828125,
      "text": " truly reserved for the believer."
    },
    {
      "id": 139,
      "start": 392.8800048828125,
      "end": 395.5199890136719,
      "text": " It is a privilege that we have as the child of God"
    },
    {
      "id": 140,
      "start": 395.5199890136719,
      "end": 399.44000244140625,
      "text": " to enter boldly into the throne room of heaven."
    },
    {
      "id": 141,
      "start": 399.44000244140625,
      "end": 401.7200012207031,
      "text": " We're to come boldly into the throne of grace,"
    },
    {
      "id": 142,
      "start": 401.7200012207031,
      "end": 404.3599853515625,
      "text": " is what the Scriptures tell us in the book of Hebrews"
    },
    {
      "id": 143,
      "start": 404.3599853515625,
      "end": 405.2799987792969,
      "text": " in the fourth chapter."
    },
    {
      "id": 144,
      "start": 405.2799987792969,
      "end": 407.20001220703125,
      "text": " You think about the privilege that we"
    },
    {
      "id": 145,
      "start": 407.20001220703125,
      "end": 408.9599914550781,
      "text": " have as the people of God."
    },
    {
      "id": 146,
      "start": 408.9599914550781,
      "end": 411.2799987792969,
      "text": " Why is it a privilege that is reserved to us"
    },
    {
      "id": 147,
      "start": 411.2799987792969,
      "end": 412.239990234375,
      "text": " as the people of God?"
    },
    {
      "id": 148,
      "start": 412.239990234375,
      "end": 414.6000061035156,
      "text": " Because we pray to God through Christ."
    },
    {
      "id": 149,
      "start": 414.6000061035156,
      "end": 418.7200012207031,
      "text": " And because we belong to Him, we have direct access."
    },
    {
      "id": 150,
      "start": 418.7200012207031,
      "end": 421.1199951171875,
      "text": " And I'm so thankful that at any time in my life,"
    },
    {
      "id": 151,
      "start": 421.1199951171875,
      "end": 423.6400146484375,
      "text": " in any situation, for any reason,"
    },
    {
      "id": 152,
      "start": 423.6400146484375,
      "end": 425.760009765625,
      "text": " I can go to God in prayer."
    },
    {
      "id": 153,
      "start": 425.760009765625,
      "end": 428.0,
      "text": " It is a unique privilege."
    },
    {
      "id": 154,
      "start": 428.0,
      "end": 429.9200134277344,
      "text": " And we understand that as we think"
    },
    {
      "id": 155,
      "start": 429.9200134277344,
      "end": 431.7200012207031,
      "text": " about this subject of prayer, and there"
    },
    {
      "id": 156,
      "start": 431.7200012207031,
      "end": 435.32000732421875,
      "text": " are many that have used it, some maybe that aren't even saved"
    },
    {
      "id": 157,
      "start": 435.32000732421875,
      "end": 436.55999755859375,
      "text": " that would talk about praying."
    },
    {
      "id": 158,
      "start": 436.55999755859375,
      "end": 439.4800109863281,
      "text": " And I have found in recent, really,"
    },
    {
      "id": 159,
      "start": 439.4800109863281,
      "end": 442.9599914550781,
      "text": " years as we've looked at the cultural shift in our society,"
    },
    {
      "id": 160,
      "start": 442.9599914550781,
      "end": 445.8399963378906,
      "text": " that it's not so often that you hear people anymore saying,"
    },
    {
      "id": 161,
      "start": 445.8399963378906,
      "end": 446.8800048828125,
      "text": " I'll pray for you."
    },
    {
      "id": 162,
      "start": 446.8800048828125,
      "end": 448.8800048828125,
      "text": " They'll say, I'm thinking about you."
    },
    {
      "id": 163,
      "start": 448.8800048828125,
      "end": 451.67999267578125,
      "text": " And I'm not really sure the significance of someone"
    },
    {
      "id": 164,
      "start": 451.67999267578125,
      "end": 452.760009765625,
      "text": " thinking about me."
    },
    {
      "id": 165,
      "start": 452.760009765625,
      "end": 456.20001220703125,
      "text": " But I do know the significance of someone praying for me."
    },
    {
      "id": 166,
      "start": 456.20001220703125,
      "end": 458.44000244140625,
      "text": " And I do understand, as the people of God,"
    },
    {
      "id": 167,
      "start": 458.44000244140625,
      "end": 461.2799987792969,
      "text": " having the privilege of engaging in prayer"
    },
    {
      "id": 168,
      "start": 461.2799987792969,
      "end": 463.8399963378906,
      "text": " and understanding that it moves the heart of God,"
    },
    {
      "id": 169,
      "start": 463.8399963378906,
      "end": 465.1199951171875,
      "text": " the hand of God."
    },
    {
      "id": 170,
      "start": 465.1199951171875,
      "end": 467.0,
      "text": " We notice as we begin in verse number two"
    },
    {
      "id": 171,
      "start": 467.0,
      "end": 470.2799987792969,
      "text": " that the Bible says, continue in prayer."
    },
    {
      "id": 172,
      "start": 470.2799987792969,
      "end": 473.8399963378906,
      "text": " I believe that this word continue would reveal to you,"
    },
    {
      "id": 173,
      "start": 473.8399963378906,
      "end": 478.1600036621094,
      "text": " it would reveal to me that this is something that they're"
    },
    {
      "id": 174,
      "start": 478.1600036621094,
      "end": 480.9599914550781,
      "text": " already engaged in."
    },
    {
      "id": 175,
      "start": 480.9599914550781,
      "end": 483.44000244140625,
      "text": " You're not going to continue doing something if you're not"
    },
    {
      "id": 176,
      "start": 483.44000244140625,
      "end": 485.20001220703125,
      "text": " actually doing that thing."
    },
    {
      "id": 177,
      "start": 485.20001220703125,
      "end": 488.0799865722656,
      "text": " You wouldn't say continue to fill in the blank,"
    },
    {
      "id": 178,
      "start": 488.0799865722656,
      "end": 490.6000061035156,
      "text": " continue to pray, continue in prayer"
    },
    {
      "id": 179,
      "start": 490.6000061035156,
      "end": 492.3599853515625,
      "text": " if you're not first praying."
    },
    {
      "id": 180,
      "start": 492.3599853515625,
      "end": 496.6400146484375,
      "text": " And so as Paul would understand the church at Colossae,"
    },
    {
      "id": 181,
      "start": 496.6400146484375,
      "end": 499.8800048828125,
      "text": " he did not have the privilege of being there and serving"
    },
    {
      "id": 182,
      "start": 499.8800048828125,
      "end": 501.1199951171875,
      "text": " amongst these individuals."
    },
    {
      "id": 183,
      "start": 501.1199951171875,
      "end": 503.0799865722656,
      "text": " But he received a report."
    },
    {
      "id": 184,
      "start": 503.0799865722656,
      "end": 504.8399963378906,
      "text": " He commends these believers."
    },
    {
      "id": 185,
      "start": 504.8399963378906,
      "end": 507.20001220703125,
      "text": " And he then says to them, under the inspiration"
    },
    {
      "id": 186,
      "start": 507.20001220703125,
      "end": 509.6400146484375,
      "text": " of the Holy Spirit of God, as he concludes,"
    },
    {
      "id": 187,
      "start": 509.6400146484375,
      "end": 512.4400024414062,
      "text": " as we get into this fourth chapter, continue."
    },
    {
      "id": 188,
      "start": 512.4400024414062,
      "end": 513.5599975585938,
      "text": " Continue in what?"
    },
    {
      "id": 189,
      "start": 513.5599975585938,
      "end": 515.5999755859375,
      "text": " Continue in prayer."
    },
    {
      "id": 190,
      "start": 515.5999755859375,
      "end": 519.52001953125,
      "text": " They are being encouraged to press on."
    },
    {
      "id": 191,
      "start": 519.52001953125,
      "end": 523.1599731445312,
      "text": " We find that as we would think about the idea of continuing"
    },
    {
      "id": 192,
      "start": 523.1599731445312,
      "end": 526.47998046875,
      "text": " in prayer, it carries with it the idea of to persevere"
    },
    {
      "id": 193,
      "start": 526.47998046875,
      "end": 528.0800170898438,
      "text": " and not to faint."
    },
    {
      "id": 194,
      "start": 528.0800170898438,
      "end": 531.7999877929688,
      "text": " And you think about Peter, even as he was there in the garden"
    },
    {
      "id": 195,
      "start": 531.7999877929688,
      "end": 533.3599853515625,
      "text": " and as Jesus was praying."
    },
    {
      "id": 196,
      "start": 533.3599853515625,
      "end": 534.3599853515625,
      "text": " And what did Peter do?"
    },
    {
      "id": 197,
      "start": 534.3599853515625,
      "end": 535.3200073242188,
      "text": " He fell asleep."
    },
    {
      "id": 198,
      "start": 535.3200073242188,
      "end": 536.47998046875,
      "text": " And Jesus says, what?"
    },
    {
      "id": 199,
      "start": 536.5599975585938,
      "end": 539.4400024414062,
      "text": " You could not watch and pray with me for an hour?"
    },
    {
      "id": 200,
      "start": 539.4400024414062,
      "end": 543.7999877929688,
      "text": " And we find that here that he says continue in prayer"
    },
    {
      "id": 201,
      "start": 543.7999877929688,
      "end": 546.4400024414062,
      "text": " to be devoted to it, to understand"
    },
    {
      "id": 202,
      "start": 546.4400024414062,
      "end": 548.0,
      "text": " the significance of it."
    },
    {
      "id": 203,
      "start": 548.0,
      "end": 550.8800048828125,
      "text": " Generically, the word prayer means to simply ask."
    },
    {
      "id": 204,
      "start": 550.8800048828125,
      "end": 554.760009765625,
      "text": " And it means to ask with earnestness."
    },
    {
      "id": 205,
      "start": 554.760009765625,
      "end": 557.0,
      "text": " It's interesting that the verse continues."
    },
    {
      "id": 206,
      "start": 557.0,
      "end": 559.719970703125,
      "text": " It not only says continue in prayer,"
    },
    {
      "id": 207,
      "start": 559.719970703125,
      "end": 564.0,
      "text": " but then it says this, and watch in the same."
    },
    {
      "id": 208,
      "start": 564.0,
      "end": 565.5999755859375,
      "text": " Well, he's speaking of prayer."
    },
    {
      "id": 209,
      "start": 565.5999755859375,
      "end": 567.7999877929688,
      "text": " So when he says, and watch in the same,"
    },
    {
      "id": 210,
      "start": 567.7999877929688,
      "end": 569.280029296875,
      "text": " he's speaking of prayer."
    },
    {
      "id": 211,
      "start": 569.280029296875,
      "end": 571.0800170898438,
      "text": " And the word watch is an interesting word."
    },
    {
      "id": 212,
      "start": 571.0800170898438,
      "end": 574.9199829101562,
      "text": " It means to give strict attention to."
    },
    {
      "id": 213,
      "start": 574.9199829101562,
      "end": 577.1599731445312,
      "text": " How many times, again, when we seek"
    },
    {
      "id": 214,
      "start": 577.1599731445312,
      "end": 580.1599731445312,
      "text": " to go before the throne room of heaven"
    },
    {
      "id": 215,
      "start": 580.1599731445312,
      "end": 584.5999755859375,
      "text": " and pray that our minds are just diverted to so"
    },
    {
      "id": 216,
      "start": 584.5999755859375,
      "end": 587.3599853515625,
      "text": " many other things and we're distracted,"
    },
    {
      "id": 217,
      "start": 587.3599853515625,
      "end": 589.4400024414062,
      "text": " but yet this word watch, it means"
    },
    {
      "id": 218,
      "start": 589.4400024414062,
      "end": 592.4400024414062,
      "text": " to give strict attention to, to take heed."
    },
    {
      "id": 219,
      "start": 592.47998046875,
      "end": 597.47998046875,
      "text": " And he says to watch in the same with thanksgiving."
    },
    {
      "id": 220,
      "start": 599.4000244140625,
      "end": 600.239990234375,
      "text": " With thanksgiving."
    },
    {
      "id": 0,
      "start": 600.239990234375,
      "end": 604.319990158081,
      "text": " As we think about the privilege of prayer and we consider the many promises"
    },
    {
      "id": 1,
      "start": 604.319990158081,
      "end": 607.5999903678894,
      "text": " that God has given us throughout His Word, we're familiar with a number of"
    },
    {
      "id": 2,
      "start": 607.5999903678894,
      "end": 611.6799898147583,
      "text": " those promises. I referenced Ephesians 3 20 already. You think about the great"
    },
    {
      "id": 3,
      "start": 611.6799898147583,
      "end": 617.239990234375,
      "text": " promise in Jeremiah 33 when God says to Jeremiah, call unto me and I will answer"
    },
    {
      "id": 4,
      "start": 617.239990234375,
      "end": 620.7999897003174,
      "text": " thee and show thee great and mighty things which thou knowest not. Last"
    },
    {
      "id": 5,
      "start": 620.7999897003174,
      "end": 624.8799896240234,
      "text": " Sunday afternoon, Brother Dan Hummel spent time on that particular verse of"
    },
    {
      "id": 6,
      "start": 624.8799896240234,
      "end": 629.5999908447266,
      "text": " Scripture in our afternoon service and encouraging us with regard to the way"
    },
    {
      "id": 7,
      "start": 629.5999908447266,
      "end": 634.3999900817871,
      "text": " that God hears and answers prayer and what a blessing. And we find the Bible"
    },
    {
      "id": 8,
      "start": 634.3999900817871,
      "end": 638.8399887084961,
      "text": " tells us as we would consider the truth of James chapter number 5 in verse"
    },
    {
      "id": 9,
      "start": 638.8399887084961,
      "end": 643.5199890136719,
      "text": " number 16 when the Word of God says that the effectual fervent prayer of a"
    },
    {
      "id": 10,
      "start": 643.5199890136719,
      "end": 649.9999885559082,
      "text": " righteous man availeth much. We think about this privilege that we have to"
    },
    {
      "id": 11,
      "start": 649.9999885559082,
      "end": 656.5199890136719,
      "text": " pray. In the 1828 Noah Webster's Dictionary, the word prayer is denoted"
    },
    {
      "id": 12,
      "start": 656.5199890136719,
      "end": 661.3999900817871,
      "text": " and given the definition in this sense. It says this, in worship a solemn"
    },
    {
      "id": 13,
      "start": 661.3999900817871,
      "end": 667.8399887084961,
      "text": " address to the Supreme Being. We're praying to God, the God of the impossible,"
    },
    {
      "id": 14,
      "start": 667.8399887084961,
      "end": 679.6399917602539,
      "text": " the God who said let there be light and there was light. Consisting of adoration,"
    },
    {
      "id": 15,
      "start": 679.6799926757812,
      "end": 686.5999908447266,
      "text": " confession of sins, supplication for mercy and forgiveness, intercession for"
    },
    {
      "id": 16,
      "start": 686.5999908447266,
      "end": 693.5999908447266,
      "text": " blessings on others, and thanksgiving. That's what the dictionary says. Noah Webster's"
    },
    {
      "id": 17,
      "start": 693.5999908447266,
      "end": 699.3199920654297,
      "text": " 1828, and you look up the word prayer. We find that as we would consider the"
    },
    {
      "id": 18,
      "start": 699.3199920654297,
      "end": 704.3999938964844,
      "text": " privilege of prayer and we understand as Paul says continue in prayer and watch"
    },
    {
      "id": 19,
      "start": 704.3999938964844,
      "end": 708.5599899291992,
      "text": " in the same with thanksgiving. I would say to you that there's, it's not"
    },
    {
      "id": 20,
      "start": 708.5599899291992,
      "end": 713.1999893188477,
      "text": " originable with me, but someone made up an acronym of prayer acts, A-C-T-S. It"
    },
    {
      "id": 21,
      "start": 713.1999893188477,
      "end": 717.5599899291992,
      "text": " begins with adoration. You know when you begin your time of prayer and you begin"
    },
    {
      "id": 22,
      "start": 717.5599899291992,
      "end": 721.6399917602539,
      "text": " to just adore the Lord that you stand in all of who He is, when you begin to think"
    },
    {
      "id": 23,
      "start": 721.6399917602539,
      "end": 725.1999893188477,
      "text": " about the attributes that He's revealed to us within His Word and you begin to"
    },
    {
      "id": 24,
      "start": 725.1999893188477,
      "end": 728.9199829101562,
      "text": " pray and seek His face and you understand that you're getting into"
    },
    {
      "id": 25,
      "start": 728.9199829101562,
      "end": 734.6399841308594,
      "text": " that very presence of God Almighty and you begin to maybe reference the names"
    },
    {
      "id": 26,
      "start": 734.8399963378906,
      "end": 739.5199890136719,
      "text": " of God. Maybe you begin to reference the attributes of God. You're joyful and"
    },
    {
      "id": 27,
      "start": 739.5199890136719,
      "end": 744.5999908447266,
      "text": " rejoicing for who He is to you and what He's done for you and you're adoring"
    },
    {
      "id": 28,
      "start": 744.5999908447266,
      "end": 751.7199859619141,
      "text": " Him. And then you move into confession. How important it is that we understand"
    },
    {
      "id": 29,
      "start": 751.7199859619141,
      "end": 757.0399932861328,
      "text": " the importance of confession in our lives that the Word of God tells us"
    },
    {
      "id": 30,
      "start": 757.0399932861328,
      "end": 762.5199890136719,
      "text": " that we serve a God who is faithful and He will forgive us if we confess our"
    },
    {
      "id": 31,
      "start": 762.5199890136719,
      "end": 767.3599853515625,
      "text": " sins. He is faithful and just to forgive us and to cleanse us from all"
    },
    {
      "id": 32,
      "start": 767.3599853515625,
      "end": 772.4799957275391,
      "text": " unrighteousness. And our prayer time ought to consist of some confession, some"
    },
    {
      "id": 33,
      "start": 772.4799957275391,
      "end": 778.8399963378906,
      "text": " time in which we say, Lord search me, show me if there be any wicked way, lead me in"
    },
    {
      "id": 34,
      "start": 778.8399963378906,
      "end": 783.7199859619141,
      "text": " the way everlasting. Because we understand that he that covereth his sin"
    },
    {
      "id": 35,
      "start": 783.7199859619141,
      "end": 789.3199920654297,
      "text": " shall not prosper. But what a joy to know that he that confesseth, he receives"
    },
    {
      "id": 36,
      "start": 789.3999938964844,
      "end": 795.4399871826172,
      "text": " mercy. Amen. What a blessing. I think of Thanksgiving as we find the end of this"
    },
    {
      "id": 37,
      "start": 795.4399871826172,
      "end": 800.3599853515625,
      "text": " verse continuing prayer and watch in the same with Thanksgiving. Oh that God"
    },
    {
      "id": 38,
      "start": 800.3599853515625,
      "end": 804.7999877929688,
      "text": " would help us to be a thankful people. We understand that in the last days one of"
    },
    {
      "id": 39,
      "start": 804.7999877929688,
      "end": 808.5999908447266,
      "text": " the ways in which the perilous times are described as being that people will be"
    },
    {
      "id": 40,
      "start": 808.5999908447266,
      "end": 815.5999908447266,
      "text": " unthankful. I was praying this morning and I was praying right here and all the"
    },
    {
      "id": 41,
      "start": 815.5999908447266,
      "end": 820.3199920654297,
      "text": " crows were out there squawking and making all kinds of noise and I can't"
    },
    {
      "id": 42,
      "start": 820.3199920654297,
      "end": 825.3999938964844,
      "text": " stand crows. And I said to Brother Hummel last Sunday, I said I think the sound of"
    },
    {
      "id": 43,
      "start": 825.3999938964844,
      "end": 830.7199859619141,
      "text": " these crows is what God hears when we complain. Because it sounds like murmuring."
    },
    {
      "id": 44,
      "start": 830.7199859619141,
      "end": 837.6799926757812,
      "text": " It just drives me nuts. We're to be a thankful people. It's easy to complain."
    },
    {
      "id": 45,
      "start": 837.6799926757812,
      "end": 844.5799865722656,
      "text": " It really is. But when we give thanks in everything, we're to pray, right? But we're"
    },
    {
      "id": 46,
      "start": 844.5799865722656,
      "end": 849.2999877929688,
      "text": " to give thanks. We're to seek God's face and thank him and understanding that God"
    },
    {
      "id": 47,
      "start": 849.2999877929688,
      "end": 855.4399871826172,
      "text": " has purpose and plan and reason and that God is able. We face a difficulty. We face"
    },
    {
      "id": 48,
      "start": 855.4399871826172,
      "end": 861.5799865722656,
      "text": " a circumstance and we can thank God that that he knows what to do. He has the"
    },
    {
      "id": 49,
      "start": 861.5799865722656,
      "end": 867.0199890136719,
      "text": " power to do what has to be done. Isn't that wonderful? Can you imagine if we did not"
    },
    {
      "id": 50,
      "start": 867.0199890136719,
      "end": 871.1399841308594,
      "text": " have that confidence as he's given us his word and we just were left to our"
    },
    {
      "id": 51,
      "start": 871.1799926757812,
      "end": 876.0999755859375,
      "text": " own devices, our own resources, not having the knowledge that God is able to do"
    },
    {
      "id": 52,
      "start": 876.0999755859375,
      "end": 881.0199890136719,
      "text": " exceeding abundantly above, that he has the power to do and the wisdom to know"
    },
    {
      "id": 53,
      "start": 881.0199890136719,
      "end": 889.1199951171875,
      "text": " what to do. That's phenomenal. So with thanksgiving, in fact, as we look at the"
    },
    {
      "id": 54,
      "start": 889.1199951171875,
      "end": 893.8599853515625,
      "text": " truth in the book of Philippians with regard to this truth, the Bible says be"
    },
    {
      "id": 55,
      "start": 893.8599853515625,
      "end": 899.8999938964844,
      "text": " careful for nothing but in everything by prayer and supplication. With thanksgiving"
    },
    {
      "id": 56,
      "start": 900.2599792480469,
      "end": 907.6600036621094,
      "text": " let your requests be made known unto God. You know, it's biblically accurate that"
    },
    {
      "id": 57,
      "start": 907.6600036621094,
      "end": 913.9400024414062,
      "text": " we can thank God for how he's going to answer before the answer ever comes. With"
    },
    {
      "id": 58,
      "start": 913.9400024414062,
      "end": 917.6199951171875,
      "text": " thanksgiving, God, I thank you in advance of what you're going to do because I know"
    },
    {
      "id": 59,
      "start": 917.6199951171875,
      "end": 922.0199890136719,
      "text": " what you're going to do is right. It may not be exactly what I think should be"
    },
    {
      "id": 60,
      "start": 922.0199890136719,
      "end": 927.3399963378906,
      "text": " done, but I'm thankful that it's not up to me. Amen? And God knows far greater"
    },
    {
      "id": 61,
      "start": 927.3399963378906,
      "end": 930.3399963378906,
      "text": " than I know. He knows far greater than you know. And so we think about this"
    },
    {
      "id": 62,
      "start": 930.3399963378906,
      "end": 934.9400024414062,
      "text": " privilege, it ends as we think about that acronym of acts, adoration, confession,"
    },
    {
      "id": 63,
      "start": 934.9400024414062,
      "end": 942.3800048828125,
      "text": " thanksgiving, supplication. Supplication, not only for ourself but for others. You"
    },
    {
      "id": 64,
      "start": 942.3800048828125,
      "end": 946.3800048828125,
      "text": " think about the ministry of intercessory prayer. You think about the"
    },
    {
      "id": 65,
      "start": 946.3800048828125,
      "end": 950.6199951171875,
      "text": " opportunities that we have to bring our petitions before the throne room of"
    },
    {
      "id": 66,
      "start": 950.6199951171875,
      "end": 956.2200012207031,
      "text": " heaven. When we understand that we need wisdom and we go to God and we know that"
    },
    {
      "id": 67,
      "start": 956.2200012207031,
      "end": 959.4199829101562,
      "text": " he's told us that if any man lack wisdom let him ask of God who giveth to"
    },
    {
      "id": 68,
      "start": 959.4199829101562,
      "end": 963.6199951171875,
      "text": " all men liberally and upbraideth not. In James 1. And you find that I need"
    },
    {
      "id": 69,
      "start": 963.6199951171875,
      "end": 969.4599914550781,
      "text": " wisdom. Isn't it great to know the one who has all wisdom that has promised to"
    },
    {
      "id": 70,
      "start": 969.4599914550781,
      "end": 975.97998046875,
      "text": " give it to us when we acknowledge our need for it and request it? We find that"
    },
    {
      "id": 71,
      "start": 975.97998046875,
      "end": 981.2999877929688,
      "text": " we are able to go on the behalf of not only our own needs but as we pray one"
    },
    {
      "id": 72,
      "start": 981.2999877929688,
      "end": 987.1799926757812,
      "text": " for another, intercessory prayer. What a blessing to know that we can pray one"
    },
    {
      "id": 73,
      "start": 987.1799926757812,
      "end": 991.6600036621094,
      "text": " for another. And really in this particular passage of Scripture we find"
    },
    {
      "id": 74,
      "start": 991.6600036621094,
      "end": 995.2200012207031,
      "text": " that the privilege is revealed to us in verse number two when he speaks about"
    },
    {
      "id": 75,
      "start": 995.2200012207031,
      "end": 999.3800048828125,
      "text": " this continuing in prayer and watching the same with thanksgiving. And as we"
    },
    {
      "id": 76,
      "start": 999.3800048828125,
      "end": 1003.6999816894531,
      "text": " enter into the third verse we really begin to see that nature of intercessory"
    },
    {
      "id": 77,
      "start": 1003.6999816894531,
      "end": 1008.6199951171875,
      "text": " prayer where Paul says this in verse number three, with all praying also for"
    },
    {
      "id": 78,
      "start": 1008.6199951171875,
      "end": 1014.0199890136719,
      "text": " us that God would open unto us a door of utterance to speak the mystery of"
    },
    {
      "id": 79,
      "start": 1014.0199890136719,
      "end": 1021.2200012207031,
      "text": " Christ for which I am also in bonds that I may make it manifest as I ought to"
    },
    {
      "id": 80,
      "start": 1021.2200012207031,
      "end": 1026.4400024414062,
      "text": " speak. Number two, if you're taking notes notice a petition from Paul. A petition"
    },
    {
      "id": 81,
      "start": 1026.4400024414062,
      "end": 1030.0599975585938,
      "text": " from Paul. We find that in the first chapter of the book of Colossians in"
    },
    {
      "id": 82,
      "start": 1030.0599975585938,
      "end": 1033.97998046875,
      "text": " verse number three Paul says this to these believers, we give thanks to God"
    },
    {
      "id": 83,
      "start": 1033.97998046875,
      "end": 1039.3399963378906,
      "text": " and the Father of our Lord Jesus Christ. Notice what Paul says, praying always for"
    },
    {
      "id": 84,
      "start": 1039.3399963378906,
      "end": 1043.6999816894531,
      "text": " you. I will not take the time this morning to read verses 9 through 14 of"
    },
    {
      "id": 85,
      "start": 1043.6999816894531,
      "end": 1048.2999877929688,
      "text": " chapter number 1 but we find that as Paul is encouraging the believers in"
    },
    {
      "id": 86,
      "start": 1048.2999877929688,
      "end": 1052.0999755859375,
      "text": " Colossians 1 and verse number 3 he tells them that he's praying always"
    },
    {
      "id": 87,
      "start": 1052.0999755859375,
      "end": 1058.3399963378906,
      "text": " for them. In verses 9 through 14 he gives them the specifics of how I'm"
    },
    {
      "id": 88,
      "start": 1058.3399963378906,
      "end": 1063.1399841308594,
      "text": " praying for you. And here's how we're praying for you. And what a blessing as"
    },
    {
      "id": 89,
      "start": 1063.1399841308594,
      "end": 1069.4599914550781,
      "text": " Paul would seek to encourage these believers. Now as we look at this final"
    },
    {
      "id": 90,
      "start": 1069.4599914550781,
      "end": 1073.3800048828125,
      "text": " chapter and we look at this subject matter we see the petition from Paul"
    },
    {
      "id": 91,
      "start": 1073.3800048828125,
      "end": 1079.2599792480469,
      "text": " where he now makes the request that they would pray for him. It's a blessing to be"
    },
    {
      "id": 92,
      "start": 1079.2599792480469,
      "end": 1082.8199768066406,
      "text": " able to pray one for another. And I would submit to you that as I look at this"
    },
    {
      "id": 93,
      "start": 1082.8199768066406,
      "end": 1088.2599792480469,
      "text": " petition from Paul that each one of us would say I need some people praying for"
    },
    {
      "id": 94,
      "start": 1088.2599792480469,
      "end": 1092.0599975585938,
      "text": " me in this manner. I need some people to pray that God would give me boldness,"
    },
    {
      "id": 95,
      "start": 1092.0599975585938,
      "end": 1095.5399780273438,
      "text": " that God would open up a door of utterance, that God would enable me to"
    },
    {
      "id": 96,
      "start": 1095.5399780273438,
      "end": 1100.0999755859375,
      "text": " speak the way that I'm supposed to speak. Notice how specific Paul is. He does not"
    },
    {
      "id": 97,
      "start": 1100.0999755859375,
      "end": 1104.5399780273438,
      "text": " just say in verse number 3, with all praying also for us, but he gives them"
    },
    {
      "id": 98,
      "start": 1104.5399780273438,
      "end": 1109.9400024414062,
      "text": " some details, some specifics as to how he's requesting that they pray. I want"
    },
    {
      "id": 99,
      "start": 1109.9400024414062,
      "end": 1113.4199829101562,
      "text": " you to understand that Paul is in bonds. He even makes note of that at the end of"
    },
    {
      "id": 100,
      "start": 1113.4199829101562,
      "end": 1117.3399658203125,
      "text": " verse number 3, for which I am also in bonds. You'll notice that something that"
    },
    {
      "id": 101,
      "start": 1117.3399658203125,
      "end": 1121.6599731445312,
      "text": " is missing from the specific prayer request that Paul gives in this passage"
    },
    {
      "id": 102,
      "start": 1121.6599731445312,
      "end": 1128.1400146484375,
      "text": " of Scripture is a release from prison. He doesn't pray for that. Now you and me,"
    },
    {
      "id": 103,
      "start": 1128.1400146484375,
      "end": 1132.8200073242188,
      "text": " if I was in prison and I was sending you letters, I'd probably be asking you to"
    },
    {
      "id": 104,
      "start": 1132.8200073242188,
      "end": 1138.97998046875,
      "text": " pray that God would release me from prison, right? Paul doesn't ask for that."
    },
    {
      "id": 105,
      "start": 1138.97998046875,
      "end": 1144.0599975585938,
      "text": " He understood that God had him there for a reason. He understood that God's"
    },
    {
      "id": 106,
      "start": 1144.0599975585938,
      "end": 1150.5,
      "text": " sovereign and Paul would be in prison not one day shorter or one day longer"
    },
    {
      "id": 107,
      "start": 1150.5,
      "end": 1154.9400024414062,
      "text": " than God saw fit for him to be there. Do we believe that this morning? Do we"
    },
    {
      "id": 108,
      "start": 1154.9400024414062,
      "end": 1158.5399780273438,
      "text": " understand that our God is able? Listen, you think about Joseph when he was in"
    },
    {
      "id": 109,
      "start": 1158.5399780273438,
      "end": 1164.97998046875,
      "text": " prison. He was there just as long as he was supposed to be there, right? Not a day"
    },
    {
      "id": 110,
      "start": 1164.97998046875,
      "end": 1169.0999755859375,
      "text": " sooner did he get released than what God had ordained for him to be released, and"
    },
    {
      "id": 111,
      "start": 1169.0999755859375,
      "end": 1174.7799682617188,
      "text": " not a day longer did he stay in that prison than what he was supposed to. You"
    },
    {
      "id": 112,
      "start": 1174.7799682617188,
      "end": 1177.8599853515625,
      "text": " think about the opportunity. Remember when the butler and the baker came, what"
    },
    {
      "id": 113,
      "start": 1177.8599853515625,
      "end": 1182.8200073242188,
      "text": " did he say? Hey, remember me! Is that not what Joseph said? But the Bible tells us"
    },
    {
      "id": 114,
      "start": 1182.8200073242188,
      "end": 1192.97998046875,
      "text": " that the butler forgot him. Two full years. That's a long time. It's a long time. But"
    },
    {
      "id": 115,
      "start": 1192.97998046875,
      "end": 1199.7799682617188,
      "text": " then there was a dream, and nobody in Egypt could interpret the dream. And the butler"
    },
    {
      "id": 116,
      "start": 1199.7799682617188,
      "end": 1202.2999877929688,
      "text": " all of a sudden..."
    },
    {
      "id": 0,
      "start": 1202.2999877929688,
      "end": 1210.2199878692627,
      "text": " has a good memory. Ah, I remember this guy in prison. Do you not see the hand of God?"
    },
    {
      "id": 1,
      "start": 1210.2199878692627,
      "end": 1215.0999879837036,
      "text": " Because had the butler remembered Joseph earlier than at that particular circumstance in his"
    },
    {
      "id": 2,
      "start": 1215.0999879837036,
      "end": 1219.8599872589111,
      "text": " life and said, hey, Pharaoh, there's a guy that can interpret dreams in prison. Yeah,"
    },
    {
      "id": 3,
      "start": 1219.8599872589111,
      "end": 1225.4399871826172,
      "text": " I got a lot of those astrologers and magicians. I got a whole group of them. That's what they're"
    },
    {
      "id": 4,
      "start": 1225.4399871826172,
      "end": 1232.2199878692627,
      "text": " here for. That's what they're part of my cabinet for. Right? But it wasn't until all those"
    },
    {
      "id": 5,
      "start": 1232.2199878692627,
      "end": 1240.059986114502,
      "text": " guys failed that Joseph is remembered. Paul doesn't ask for a release from prison. Oftentimes"
    },
    {
      "id": 6,
      "start": 1240.059986114502,
      "end": 1246.8599891662598,
      "text": " we're so caught up in God delivering us from our difficulty that we fail to recognize that"
    },
    {
      "id": 7,
      "start": 1246.8599891662598,
      "end": 1255.7399864196777,
      "text": " God has a purpose in that difficulty. We're all guilty of it. I don't like difficulties."
    },
    {
      "id": 8,
      "start": 1255.7399864196777,
      "end": 1263.779987335205,
      "text": " Amen? And if you like them, you're crazy. Just kidding. But seriously, we try to avoid"
    },
    {
      "id": 9,
      "start": 1263.779987335205,
      "end": 1269.0199890136719,
      "text": " problems, do we not? But we find that, as Paul would say in the beginning of the book"
    },
    {
      "id": 10,
      "start": 1269.0199890136719,
      "end": 1273.4199905395508,
      "text": " of Philippians in chapter 1 and verse number 12, the things that happen to me happen for"
    },
    {
      "id": 11,
      "start": 1273.4199905395508,
      "end": 1279.739990234375,
      "text": " the furtherance of the gospel. And so often we're saying, God, deliver me from this trial."
    },
    {
      "id": 12,
      "start": 1279.739990234375,
      "end": 1284.0199890136719,
      "text": " Deliver me from this trouble. Deliver me from this problem. And God's saying, I'm trying"
    },
    {
      "id": 13,
      "start": 1284.0199890136719,
      "end": 1289.5399856567383,
      "text": " to teach you something in the midst of this trial, in the midst of this storm. It was"
    },
    {
      "id": 14,
      "start": 1289.5399856567383,
      "end": 1294.1399841308594,
      "text": " Jesus, by the way, that told the disciples to get into the boat and to pass onto the"
    },
    {
      "id": 15,
      "start": 1294.1399841308594,
      "end": 1301.5399856567383,
      "text": " other side. And there was a storm in the midst of the sea. Why were they in the storm? Because"
    },
    {
      "id": 16,
      "start": 1301.5399856567383,
      "end": 1307.0999908447266,
      "text": " they obeyed the Lord. Right? What if they disobeyed and said, nah, we're not going to"
    },
    {
      "id": 17,
      "start": 1307.0999908447266,
      "end": 1313.8599853515625,
      "text": " sail tonight. We'll do it tomorrow. But was there not a great lesson in that storm? We're"
    },
    {
      "id": 18,
      "start": 1313.8599853515625,
      "end": 1321.0999908447266,
      "text": " going to perish. We're going to die. Jesus came walking on the water. It's amazing. And"
    },
    {
      "id": 19,
      "start": 1321.0999908447266,
      "end": 1327.6599884033203,
      "text": " they see that Jesus has power even over the winds and the waves. Listen, there are times"
    },
    {
      "id": 20,
      "start": 1327.6599884033203,
      "end": 1331.1799926757812,
      "text": " in which He's trying to develop us. There are times in which He's trying to bring us"
    },
    {
      "id": 21,
      "start": 1331.1799926757812,
      "end": 1336.8999938964844,
      "text": " into contact with someone that needs to hear the truth of the gospel. And it may be through"
    },
    {
      "id": 22,
      "start": 1336.8999938964844,
      "end": 1342.6599884033203,
      "text": " the time of difficulty, the time of trial, that in that very moment that God is orchestrating"
    },
    {
      "id": 23,
      "start": 1342.6599884033203,
      "end": 1347.1399841308594,
      "text": " it in such a way that He's bringing you into the very presence of someone that maybe a"
    },
    {
      "id": 24,
      "start": 1347.1399841308594,
      "end": 1351.9399871826172,
      "text": " mother and a father have prayed for, that they would understand the truth of the gospel."
    },
    {
      "id": 25,
      "start": 1351.9399871826172,
      "end": 1356.1799926757812,
      "text": " And God says, here's someone that I can bring in their life and share the gospel with them."
    },
    {
      "id": 26,
      "start": 1356.1799926757812,
      "end": 1363.3799896240234,
      "text": " That's how God works. If we'd let Him. God, what are you trying to teach me in this moment"
    },
    {
      "id": 27,
      "start": 1363.3799896240234,
      "end": 1368.4199829101562,
      "text": " of difficulty? How are you trying to develop me? Who is it that I'm here for? Who is it"
    },
    {
      "id": 28,
      "start": 1368.4199829101562,
      "end": 1373.97998046875,
      "text": " that you want me to be able to reach? But if we're too busy complaining and murmuring"
    },
    {
      "id": 29,
      "start": 1373.97998046875,
      "end": 1379.8599853515625,
      "text": " about our circumstances and we're just, woe is me, and we have the Eeyore syndrome, oh"
    },
    {
      "id": 30,
      "start": 1379.8599853515625,
      "end": 1386.0999908447266,
      "text": " bother, then we miss it all. Right? We miss it all. Paul doesn't pray for deliverance."
    },
    {
      "id": 31,
      "start": 1386.0999908447266,
      "end": 1392.6799926757812,
      "text": " Notice how Paul requests prayer. Notice, number one, he says this, that God would open unto"
    },
    {
      "id": 32,
      "start": 1392.6799926757812,
      "end": 1400.1599884033203,
      "text": " us a door of utterance. As I think about that phraseology, we understand that he's"
    },
    {
      "id": 33,
      "start": 1400.1599884033203,
      "end": 1405.3999938964844,
      "text": " praying that God would open the door, not that we would kick down a door, not that we"
    },
    {
      "id": 34,
      "start": 1405.3999938964844,
      "end": 1411.239990234375,
      "text": " would make our own opportunity, but that God would open a door of utterance for us, that"
    },
    {
      "id": 35,
      "start": 1411.239990234375,
      "end": 1417.0399932861328,
      "text": " God would work in such a way that He would orchestrate that which needs to be orchestrated"
    },
    {
      "id": 36,
      "start": 1417.1999816894531,
      "end": 1422.8799896240234,
      "text": " and that it's not by my own engineering of an opportunity and me trying to orchestrate"
    },
    {
      "id": 37,
      "start": 1422.8799896240234,
      "end": 1430.3999938964844,
      "text": " this and that, but seeking God's face to open up a door of utterance. Notice what he says,"
    },
    {
      "id": 38,
      "start": 1430.3999938964844,
      "end": 1434.6199951171875,
      "text": " that He would open up this door of utterance. I believe that we could use a phraseology"
    },
    {
      "id": 39,
      "start": 1434.6199951171875,
      "end": 1439.3599853515625,
      "text": " and say that He says, open unto us a door of utterance, that it's for me to have an"
    },
    {
      "id": 40,
      "start": 1439.3599853515625,
      "end": 1444.0399932861328,
      "text": " opportunity. For me to have an opportunity. I wonder how often do we pray that God would"
    },
    {
      "id": 41,
      "start": 1444.0399932861328,
      "end": 1448.6399841308594,
      "text": " give us opportunities? Just a couple of weeks ago, as we looked at the last section of chapter"
    },
    {
      "id": 42,
      "start": 1448.6399841308594,
      "end": 1453.6799926757812,
      "text": " 3 and the first verse of chapter 4, we dealt with the truth of being in the workplace and"
    },
    {
      "id": 43,
      "start": 1453.6799926757812,
      "end": 1459.7200012207031,
      "text": " really the idea of revival happening in our workplace and how God has you in that place"
    },
    {
      "id": 44,
      "start": 1459.7200012207031,
      "end": 1464.2599792480469,
      "text": " for a purpose, for a reason, and that as we would consider our missions map and think"
    },
    {
      "id": 45,
      "start": 1464.2599792480469,
      "end": 1468.239990234375,
      "text": " about the missionaries that we support all across the world, that as we would understand"
    },
    {
      "id": 46,
      "start": 1468.239990234375,
      "end": 1473.8399963378906,
      "text": " that we as the church, as you would go into your workplace tomorrow, that really we focus"
    },
    {
      "id": 47,
      "start": 1473.8399963378906,
      "end": 1480.2799987792969,
      "text": " upon the fact that you're a missionary in that place. Have you been praying for that"
    },
    {
      "id": 48,
      "start": 1480.2799987792969,
      "end": 1484.0799865722656,
      "text": " opportunity? Have you been praying for that individual? God, would you open up a door"
    },
    {
      "id": 49,
      "start": 1484.0799865722656,
      "end": 1489.3199768066406,
      "text": " of utterance? Would you move and work in such a way that you would open it? Make it clear"
    },
    {
      "id": 50,
      "start": 1489.3199768066406,
      "end": 1493.7599792480469,
      "text": " and help me, God, to seize the opportunity. Notice what he says, not only that God would"
    },
    {
      "id": 51,
      "start": 1493.7599792480469,
      "end": 1500.47998046875,
      "text": " open unto us a door of utterance, but notice what he says, to speak the mystery of Christ,"
    },
    {
      "id": 52,
      "start": 1500.47998046875,
      "end": 1504.7599792480469,
      "text": " for which I am also in bonds. You know what he, the opportunity that he seeks? To speak"
    },
    {
      "id": 53,
      "start": 1504.7599792480469,
      "end": 1510.9199829101562,
      "text": " of Christ. Open up a door of utterance that I can, that I can speak of the mystery of"
    },
    {
      "id": 54,
      "start": 1510.9199829101562,
      "end": 1517.2999877929688,
      "text": " Christ, that I can preach the gospel. He speaks about the mystery of Christ in the first chapter"
    },
    {
      "id": 55,
      "start": 1517.2999877929688,
      "end": 1523.6799926757812,
      "text": " of Christ in you, the hope of glory. And you think about the opportunity that he's asking"
    },
    {
      "id": 56,
      "start": 1523.6799926757812,
      "end": 1528.3999938964844,
      "text": " for these believers in Colossae, would you pray for me? Now understand, as you think"
    },
    {
      "id": 57,
      "start": 1528.3999938964844,
      "end": 1532.6799926757812,
      "text": " about the Apostle Paul, and you think about reading his life and his ministry, do you"
    },
    {
      "id": 58,
      "start": 1532.6799926757812,
      "end": 1537.0,
      "text": " really think this is somebody that you would say, he needs prayer that God would open up"
    },
    {
      "id": 59,
      "start": 1537.0,
      "end": 1542.5599975585938,
      "text": " his mouth that he would speak? No, everywhere he goes he's preaching the gospel. But you"
    },
    {
      "id": 60,
      "start": 1542.5599975585938,
      "end": 1548.5199890136719,
      "text": " know why I believe that is? Because he's constantly asking people to pray that God would give"
    },
    {
      "id": 61,
      "start": 1548.5199890136719,
      "end": 1553.47998046875,
      "text": " him boldness to open his mouth as he should. Notice in Ephesians, what he says in Ephesians"
    },
    {
      "id": 62,
      "start": 1553.47998046875,
      "end": 1560.7599792480469,
      "text": " 6, as he's, after he gives all of the information with regard to the armor of God, and he encourages"
    },
    {
      "id": 63,
      "start": 1560.7599792480469,
      "end": 1564.7599792480469,
      "text": " these believers in Ephesus with regard to the spiritual battle in which we're engaged"
    },
    {
      "id": 64,
      "start": 1564.7599792480469,
      "end": 1569.239990234375,
      "text": " in, and he speaks about prayer in verse number 18, and notice in verse number 19, and for"
    },
    {
      "id": 65,
      "start": 1569.239990234375,
      "end": 1575.9199829101562,
      "text": " me, pray for all the saints, but pray for me that utterance may be given unto me, that"
    },
    {
      "id": 66,
      "start": 1575.9199829101562,
      "end": 1582.3799743652344,
      "text": " I may open my mouth boldly to make known the mystery of the gospel, for which I am an ambassador"
    },
    {
      "id": 67,
      "start": 1582.3799743652344,
      "end": 1587.8199768066406,
      "text": " in bonds, that therein I may speak boldly as I ought to speak. He's employing as many"
    },
    {
      "id": 68,
      "start": 1587.8199768066406,
      "end": 1592.6199951171875,
      "text": " people as he can to pray for him that God would open up doors of utterance, that God"
    },
    {
      "id": 69,
      "start": 1592.6199951171875,
      "end": 1598.7799987792969,
      "text": " would give him boldness, that God would enable him, empower him to speak the mystery of Christ."
    },
    {
      "id": 70,
      "start": 1598.7799987792969,
      "end": 1602.5399780273438,
      "text": " Oh, that ought to be one of the number one prayer requests that we're praying for one"
    },
    {
      "id": 71,
      "start": 1602.5399780273438,
      "end": 1607.6999816894531,
      "text": " another. That ought to be something that I'm saying, would you pray for me? Someone says,"
    },
    {
      "id": 72,
      "start": 1607.6999816894531,
      "end": 1611.5799865722656,
      "text": " hey, how can I pray for you? Let me tell you, would you pray that God would give me"
    },
    {
      "id": 73,
      "start": 1611.5799865722656,
      "end": 1617.3799743652344,
      "text": " boldness to open my mouth and speak the mystery of Christ as I should? Has anyone ever asked"
    },
    {
      "id": 74,
      "start": 1617.3799743652344,
      "end": 1625.2999877929688,
      "text": " you that? Amen. One. I don't know how many people are here, but one. It's not common,"
    },
    {
      "id": 75,
      "start": 1625.2999877929688,
      "end": 1632.8199768066406,
      "text": " but oh, it's necessary. Can you imagine if we really begin to pray this way, that we'd"
    },
    {
      "id": 76,
      "start": 1632.8199768066406,
      "end": 1639.0599975585938,
      "text": " understand the purpose of God, that we'd understand that he's left us here as ambassadors,"
    },
    {
      "id": 77,
      "start": 1639.0599975585938,
      "end": 1645.739990234375,
      "text": " that he sent us, that we are his representatives, we are his witnesses. This is a consistent"
    },
    {
      "id": 78,
      "start": 1645.739990234375,
      "end": 1651.3799743652344,
      "text": " petition that we see throughout the word of God, that we see in the life of the apostle"
    },
    {
      "id": 79,
      "start": 1651.3799743652344,
      "end": 1657.1799926757812,
      "text": " Paul. He says in verse number four, that I may make it, speaking of the mystery of Christ,"
    },
    {
      "id": 80,
      "start": 1657.1799926757812,
      "end": 1662.6199951171875,
      "text": " the gospel of Christ, that I may make it manifest as I ought to speak. He says this to the believers"
    },
    {
      "id": 81,
      "start": 1662.6199951171875,
      "end": 1668.0199890136719,
      "text": " in Thessalonica. He says very simply in 1 Thessalonians chapter number 5 and verse 25,"
    },
    {
      "id": 82,
      "start": 1668.0199890136719,
      "end": 1672.6999816894531,
      "text": " brethren, pray for us, and there's no real detail that's given with regard to the request,"
    },
    {
      "id": 83,
      "start": 1672.6999816894531,
      "end": 1677.4599914550781,
      "text": " but in chapter number 3 of 2 Thessalonians, in verse number 1, Paul says this to these"
    },
    {
      "id": 84,
      "start": 1677.4599914550781,
      "end": 1682.6999816894531,
      "text": " believers in this church, finally, brethren, pray for us that the word of the Lord may"
    },
    {
      "id": 85,
      "start": 1682.6999816894531,
      "end": 1689.8799743652344,
      "text": " have free course and be glorified even as it is with you. This was a consistent petition"
    },
    {
      "id": 86,
      "start": 1689.8799743652344,
      "end": 1695.0,
      "text": " from Paul. When he understands the privilege of prayer and he's seeking to engage these"
    },
    {
      "id": 87,
      "start": 1695.0,
      "end": 1700.5999755859375,
      "text": " believers in Colossae, listen, continue in prayer, recognize the privilege that you have"
    },
    {
      "id": 88,
      "start": 1700.5999755859375,
      "end": 1706.2799987792969,
      "text": " to go before the throne room of heaven and pray, and continue in prayer, and watch in"
    },
    {
      "id": 89,
      "start": 1706.2799987792969,
      "end": 1711.3599853515625,
      "text": " the same with thanksgiving. And then he says, with all, also praying for us. Here's how"
    },
    {
      "id": 90,
      "start": 1711.3599853515625,
      "end": 1716.3999633789062,
      "text": " I want you to pray for me, how I want you to pray for us, that we would speak the mystery"
    },
    {
      "id": 91,
      "start": 1716.3999633789062,
      "end": 1723.6400146484375,
      "text": " of Christ, that God would open up a door of utterance. Wow! I'd like to believe that"
    },
    {
      "id": 92,
      "start": 1723.6400146484375,
      "end": 1730.5599975585938,
      "text": " the people in Ephesus, and the people in Colossae, and the people in Thessalonica, the church"
    },
    {
      "id": 93,
      "start": 1730.5599975585938,
      "end": 1734.9199829101562,
      "text": " members of these particular churches that we've referenced these verses of Scripture,"
    },
    {
      "id": 94,
      "start": 1734.9199829101562,
      "end": 1742.1199951171875,
      "text": " I'd like to believe that they engaged in this prayer for Paul, that they took the request"
    },
    {
      "id": 95,
      "start": 1742.1199951171875,
      "end": 1749.239990234375,
      "text": " seriously, and they engaged in prayer, and they saw God, they heard how God worked. God"
    },
    {
      "id": 96,
      "start": 1749.239990234375,
      "end": 1754.1599731445312,
      "text": " used Paul in a great way. When you think about God using men, oftentimes you'll find that"
    },
    {
      "id": 97,
      "start": 1754.1599731445312,
      "end": 1760.6799926757812,
      "text": " there are people that are praying. Many of us know of C. H. Spurgeon. I had the opportunity"
    },
    {
      "id": 98,
      "start": 1760.6799926757812,
      "end": 1764.5599975585938,
      "text": " a number of years ago when we were visiting my brother while he was stationed in England"
    },
    {
      "id": 99,
      "start": 1764.5599975585938,
      "end": 1770.0399780273438,
      "text": " to go to the Metropolitan Tabernacle. And as I went to the Metropolitan Tabernacle, I was"
    },
    {
      "id": 100,
      "start": 1770.0399780273438,
      "end": 1775.6799926757812,
      "text": " not aware of the fact that it's only a portion of the size that it once was under the ministry"
    },
    {
      "id": 101,
      "start": 1775.6799926757812,
      "end": 1780.5199584960938,
      "text": " of C. H. Spurgeon. And as I was speaking with the man in the bookstore, they have a bookstore"
    },
    {
      "id": 102,
      "start": 1780.5199584960938,
      "end": 1783.760009765625,
      "text": " that's open, and we were able to go into the auditorium, and we were able to walk around"
    },
    {
      "id": 103,
      "start": 1783.760009765625,
      "end": 1789.2799682617188,
      "text": " the auditorium. And I asked him if he would show me the place where the pulpit was where"
    },
    {
      "id": 104,
      "start": 1789.2799682617188,
      "end": 1794.5999755859375,
      "text": " Mr. Spurgeon preached from, and if he would be able to show me the basement area of underneath"
    },
    {
      "id": 105,
      "start": 1794.5999755859375,
      "end": 1799.8399658203125,
      "text": " of that pulpit where there were men that gathered and prayed. And he said, Sir, I'm thankful"
    },
    {
      "id": 106,
      "start": 1799.8399658203125,
      "end": 1802.239990234375,
      "text": " that you know about that, but unfortunately..."
    },
    {
      "id": 0,
      "start": 1802.239990234375,
      "end": 1805.159990310669,
      "text": " that portion of the building is no longer owned by us,"
    },
    {
      "id": 1,
      "start": 1805.159990310669,
      "end": 1807.6799902915955,
      "text": " it was torn down and they did some remodeling"
    },
    {
      "id": 2,
      "start": 1807.6799902915955,
      "end": 1810.6799898147583,
      "text": " and so on and so forth, and so I was not able to see it."
    },
    {
      "id": 3,
      "start": 1810.6799898147583,
      "end": 1812.899990081787,
      "text": " But if you understand and you read some things"
    },
    {
      "id": 4,
      "start": 1812.899990081787,
      "end": 1816.6399898529053,
      "text": " about C.H. Spurgeon, you'll find that many times"
    },
    {
      "id": 5,
      "start": 1816.6399898529053,
      "end": 1819.6399898529053,
      "text": " they would ask him about the power in his ministry"
    },
    {
      "id": 6,
      "start": 1819.6399898529053,
      "end": 1822.319990158081,
      "text": " and he would refer to a room that was in the basement"
    },
    {
      "id": 7,
      "start": 1822.319990158081,
      "end": 1825.3599910736084,
      "text": " underneath the pulpit, directly under where the pulpit sat"
    },
    {
      "id": 8,
      "start": 1825.3599910736084,
      "end": 1827.5199909210205,
      "text": " in that metropolitan tabernacle."
    },
    {
      "id": 9,
      "start": 1827.5199909210205,
      "end": 1830.7999897003174,
      "text": " There were no less than 100 men each service"
    },
    {
      "id": 10,
      "start": 1830.7999897003174,
      "end": 1832.9999904632568,
      "text": " that he was preaching that were gathered in that place"
    },
    {
      "id": 11,
      "start": 1832.9999904632568,
      "end": 1834.7599906921387,
      "text": " praying for God's power."
    },
    {
      "id": 12,
      "start": 1836.5199890136719,
      "end": 1838.6599884033203,
      "text": " Is there any wonder why God used him"
    },
    {
      "id": 13,
      "start": 1838.6599884033203,
      "end": 1840.1999893188477,
      "text": " in the way in which he did?"
    },
    {
      "id": 14,
      "start": 1841.1599884033203,
      "end": 1845.3199920654297,
      "text": " People were praying, they were seeking the face of God,"
    },
    {
      "id": 15,
      "start": 1845.3199920654297,
      "end": 1849.639991760254,
      "text": " understanding that God is able, that God uses his word,"
    },
    {
      "id": 16,
      "start": 1849.639991760254,
      "end": 1852.079990386963,
      "text": " that God blesses and answers prayer,"
    },
    {
      "id": 17,
      "start": 1852.079990386963,
      "end": 1855.799991607666,
      "text": " and so the Apostle Paul, as he's writing to these believers"
    },
    {
      "id": 18,
      "start": 1855.799991607666,
      "end": 1857.5599899291992,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 19,
      "start": 1857.5599899291992,
      "end": 1860.5599899291992,
      "text": " he says, number one, recognize the privilege of prayer."
    },
    {
      "id": 20,
      "start": 1861.3199920654297,
      "end": 1863.4399909973145,
      "text": " He then gives them a petition from Paul,"
    },
    {
      "id": 21,
      "start": 1863.4399909973145,
      "end": 1866.9999923706055,
      "text": " this request that is given specifically with regard"
    },
    {
      "id": 22,
      "start": 1866.9999923706055,
      "end": 1870.359992980957,
      "text": " to having this door of utterance open"
    },
    {
      "id": 23,
      "start": 1870.359992980957,
      "end": 1873.9999923706055,
      "text": " that God would move and work and give opportunities."
    },
    {
      "id": 24,
      "start": 1873.9999923706055,
      "end": 1876.4799880981445,
      "text": " And I would submit to you that as we conclude this morning"
    },
    {
      "id": 25,
      "start": 1876.4799880981445,
      "end": 1878.7599868774414,
      "text": " by looking at these few verses of Scripture,"
    },
    {
      "id": 26,
      "start": 1878.7599868774414,
      "end": 1881.4399871826172,
      "text": " that this is a pattern for God's people."
    },
    {
      "id": 27,
      "start": 1881.4399871826172,
      "end": 1883.1999893188477,
      "text": " It's a pattern for God's people."
    },
    {
      "id": 28,
      "start": 1883.1999893188477,
      "end": 1887.9999923706055,
      "text": " I'm encouraged as I read the word of God."
    },
    {
      "id": 29,
      "start": 1887.9999923706055,
      "end": 1889.9999923706055,
      "text": " I'm comforted as I read the word of God"
    },
    {
      "id": 30,
      "start": 1890.3999938964844,
      "end": 1893.639991760254,
      "text": " and see that we serve a God who hears and answers prayer."
    },
    {
      "id": 31,
      "start": 1893.639991760254,
      "end": 1895.5999908447266,
      "text": " I'm encouraged and I'm comforted"
    },
    {
      "id": 32,
      "start": 1895.5999908447266,
      "end": 1898.1999893188477,
      "text": " when I see how God answers prayer."
    },
    {
      "id": 33,
      "start": 1898.1999893188477,
      "end": 1900.9599914550781,
      "text": " We could speak of a number of times"
    },
    {
      "id": 34,
      "start": 1900.9599914550781,
      "end": 1902.0399932861328,
      "text": " throughout the word of God."
    },
    {
      "id": 35,
      "start": 1902.0399932861328,
      "end": 1905.119987487793,
      "text": " I'll use one simple illustration of Hannah"
    },
    {
      "id": 36,
      "start": 1905.119987487793,
      "end": 1909.1999893188477,
      "text": " when she was praying and she's pouring her heart out to God."
    },
    {
      "id": 37,
      "start": 1910.7999877929688,
      "end": 1911.9199905395508,
      "text": " God answered."
    },
    {
      "id": 38,
      "start": 1912.9199905395508,
      "end": 1914.2999877929688,
      "text": " Samuel was born."
    },
    {
      "id": 39,
      "start": 1916.5599899291992,
      "end": 1918.1999893188477,
      "text": " Give you a New Testament illustration"
    },
    {
      "id": 40,
      "start": 1918.1999893188477,
      "end": 1919.7199935913086,
      "text": " in Acts chapter number four."
    },
    {
      "id": 41,
      "start": 1919.7199935913086,
      "end": 1922.3199920654297,
      "text": " The people of God are under persecution"
    },
    {
      "id": 42,
      "start": 1922.3199920654297,
      "end": 1924.639991760254,
      "text": " because of what has happened and they're threatened"
    },
    {
      "id": 43,
      "start": 1924.639991760254,
      "end": 1926.3199920654297,
      "text": " and they're told not to speak anymore"
    },
    {
      "id": 44,
      "start": 1926.3199920654297,
      "end": 1928.5199890136719,
      "text": " in the name of the Lord Jesus Christ."
    },
    {
      "id": 45,
      "start": 1928.5199890136719,
      "end": 1929.359992980957,
      "text": " And what do they do?"
    },
    {
      "id": 46,
      "start": 1929.359992980957,
      "end": 1932.0799865722656,
      "text": " They gather together and they pray."
    },
    {
      "id": 47,
      "start": 1932.0799865722656,
      "end": 1934.0399932861328,
      "text": " And as they pray, they make this request"
    },
    {
      "id": 48,
      "start": 1934.0399932861328,
      "end": 1937.1199951171875,
      "text": " that God would grant us boldness,"
    },
    {
      "id": 49,
      "start": 1937.1199951171875,
      "end": 1939.5599975585938,
      "text": " that we would speak the word of God."
    },
    {
      "id": 50,
      "start": 1939.5599975585938,
      "end": 1940.3999938964844,
      "text": " And guess what?"
    },
    {
      "id": 51,
      "start": 1940.3999938964844,
      "end": 1942.5199890136719,
      "text": " Just a couple of verses after the prayer,"
    },
    {
      "id": 52,
      "start": 1942.5199890136719,
      "end": 1946.3999938964844,
      "text": " God gives them, God answers and God blesses."
    },
    {
      "id": 53,
      "start": 1948.479995727539,
      "end": 1949.9599914550781,
      "text": " I mentioned by way of introduction"
    },
    {
      "id": 54,
      "start": 1949.9599914550781,
      "end": 1952.999984741211,
      "text": " that we understand the importance of prayer,"
    },
    {
      "id": 55,
      "start": 1952.999984741211,
      "end": 1956.6799926757812,
      "text": " but at times in our lives, we've neglected prayer."
    },
    {
      "id": 56,
      "start": 1957.5999908447266,
      "end": 1959.4599914550781,
      "text": " I believe that as we would neglect prayer,"
    },
    {
      "id": 57,
      "start": 1959.4599914550781,
      "end": 1961.3999938964844,
      "text": " that really what we're doing is we're missing out"
    },
    {
      "id": 58,
      "start": 1961.3999938964844,
      "end": 1963.759994506836,
      "text": " on seeing God work."
    },
    {
      "id": 59,
      "start": 1963.759994506836,
      "end": 1966.4399871826172,
      "text": " We're missing out on seeing what God is able to do."
    },
    {
      "id": 60,
      "start": 1967.3399963378906,
      "end": 1968.5599975585938,
      "text": " Simply because we don't pray."
    },
    {
      "id": 61,
      "start": 1968.5599975585938,
      "end": 1970.6399841308594,
      "text": " Simply because we try our own way."
    },
    {
      "id": 62,
      "start": 1970.6399841308594,
      "end": 1972.4399871826172,
      "text": " We try to figure it out."
    },
    {
      "id": 63,
      "start": 1972.4399871826172,
      "end": 1973.3999938964844,
      "text": " I've said this before."
    },
    {
      "id": 64,
      "start": 1973.3999938964844,
      "end": 1974.8599853515625,
      "text": " It's not just true of our church,"
    },
    {
      "id": 65,
      "start": 1974.8599853515625,
      "end": 1976.0799865722656,
      "text": " though it is true of our church."
    },
    {
      "id": 66,
      "start": 1976.0799865722656,
      "end": 1979.1599884033203,
      "text": " It's true of churches all across this nation."
    },
    {
      "id": 67,
      "start": 1979.1599884033203,
      "end": 1981.3599853515625,
      "text": " I would say that one of the most important meetings"
    },
    {
      "id": 68,
      "start": 1981.3599853515625,
      "end": 1983.0799865722656,
      "text": " of a church is the prayer meeting."
    },
    {
      "id": 69,
      "start": 1984.6799926757812,
      "end": 1987.239990234375,
      "text": " But it is regularly the least attended meeting"
    },
    {
      "id": 70,
      "start": 1987.239990234375,
      "end": 1988.719985961914,
      "text": " of any church."
    },
    {
      "id": 71,
      "start": 1988.719985961914,
      "end": 1989.6199951171875,
      "text": " Regularly."
    },
    {
      "id": 72,
      "start": 1991.0799865722656,
      "end": 1993.8799896240234,
      "text": " What does that show about what we believe about prayer?"
    },
    {
      "id": 73,
      "start": 1995.759994506836,
      "end": 1997.3199920654297,
      "text": " We just simply can neglect it."
    },
    {
      "id": 74,
      "start": 1997.3199920654297,
      "end": 2000.479995727539,
      "text": " We don't see the significance of it, the importance of it."
    },
    {
      "id": 75,
      "start": 2000.479995727539,
      "end": 2004.6799926757812,
      "text": " We are able to just skip it or miss it."
    },
    {
      "id": 76,
      "start": 2004.6799926757812,
      "end": 2007.3599853515625,
      "text": " But the reality is that this is a pattern"
    },
    {
      "id": 77,
      "start": 2007.3599853515625,
      "end": 2008.5999908447266,
      "text": " for the people of God."
    },
    {
      "id": 78,
      "start": 2008.5999908447266,
      "end": 2010.759994506836,
      "text": " How many of you have read the book of Acts?"
    },
    {
      "id": 79,
      "start": 2012.5599975585938,
      "end": 2014.0999908447266,
      "text": " We've read the book of Acts."
    },
    {
      "id": 80,
      "start": 2014.0999908447266,
      "end": 2015.5199890136719,
      "text": " How many times when you read the book of Acts,"
    },
    {
      "id": 81,
      "start": 2015.5199890136719,
      "end": 2019.2799835205078,
      "text": " you say, man, isn't that exciting what God's doing?"
    },
    {
      "id": 82,
      "start": 2019.2799835205078,
      "end": 2020.7999877929688,
      "text": " Look at how God is moving."
    },
    {
      "id": 83,
      "start": 2020.7999877929688,
      "end": 2022.479995727539,
      "text": " Look at how God is working."
    },
    {
      "id": 84,
      "start": 2023.3199920654297,
      "end": 2026.4599914550781,
      "text": " Let's take a quick journey through the book of Acts."
    },
    {
      "id": 85,
      "start": 2026.4599914550781,
      "end": 2028.719985961914,
      "text": " Begin in the first chapter."
    },
    {
      "id": 86,
      "start": 2028.719985961914,
      "end": 2032.739990234375,
      "text": " It's not every verse that deals with the subject matter,"
    },
    {
      "id": 87,
      "start": 2032.739990234375,
      "end": 2034.8599853515625,
      "text": " but I just want to take a quick survey"
    },
    {
      "id": 88,
      "start": 2034.8599853515625,
      "end": 2037.1199951171875,
      "text": " through the book of Acts in closing this morning."
    },
    {
      "id": 89,
      "start": 2037.1199951171875,
      "end": 2039.0599975585938,
      "text": " Why, because when I think about the book of Acts"
    },
    {
      "id": 90,
      "start": 2039.0599975585938,
      "end": 2041.739990234375,
      "text": " and I think about how God is moving and working"
    },
    {
      "id": 91,
      "start": 2041.739990234375,
      "end": 2044.5399932861328,
      "text": " in the first century church and we read the book of Acts"
    },
    {
      "id": 92,
      "start": 2044.5399932861328,
      "end": 2048.0799865722656,
      "text": " and we read it and we say, man, look at what God is doing."
    },
    {
      "id": 93,
      "start": 2048.0799865722656,
      "end": 2049.459991455078,
      "text": " Look at how God is working."
    },
    {
      "id": 94,
      "start": 2049.459991455078,
      "end": 2051.6599884033203,
      "text": " There are 3,000 saved, there are 5,000 saved,"
    },
    {
      "id": 95,
      "start": 2051.6599884033203,
      "end": 2053.979995727539,
      "text": " there's a multitude saved, there are multitudes saved."
    },
    {
      "id": 96,
      "start": 2053.979995727539,
      "end": 2056.759994506836,
      "text": " God is working and moving."
    },
    {
      "id": 97,
      "start": 2056.759994506836,
      "end": 2060.9400024414062,
      "text": " But you'll find out that the people of God are praying."
    },
    {
      "id": 98,
      "start": 2060.9400024414062,
      "end": 2062.0799865722656,
      "text": " They're praying."
    },
    {
      "id": 99,
      "start": 2062.279998779297,
      "end": 2063.8399963378906,
      "text": " Look in Acts one."
    },
    {
      "id": 100,
      "start": 2063.8399963378906,
      "end": 2065.5599975585938,
      "text": " Look in verse number 14."
    },
    {
      "id": 101,
      "start": 2065.5599975585938,
      "end": 2068.1199951171875,
      "text": " The Bible said, these all continued with one accord"
    },
    {
      "id": 102,
      "start": 2068.1199951171875,
      "end": 2071.759979248047,
      "text": " in what, in prayer and supplication with the women"
    },
    {
      "id": 103,
      "start": 2071.759979248047,
      "end": 2074.239990234375,
      "text": " and Mary the mother of Jesus and with his brethren."
    },
    {
      "id": 104,
      "start": 2074.239990234375,
      "end": 2076.8599853515625,
      "text": " Look over in chapter number two."
    },
    {
      "id": 105,
      "start": 2076.8599853515625,
      "end": 2079.9199829101562,
      "text": " After the day of Pentecost, after they received the word"
    },
    {
      "id": 106,
      "start": 2079.9199829101562,
      "end": 2082.199981689453,
      "text": " and were baptized, according to verse number 41,"
    },
    {
      "id": 107,
      "start": 2082.199981689453,
      "end": 2084.199981689453,
      "text": " there were 3,000 souls added to the church."
    },
    {
      "id": 108,
      "start": 2084.199981689453,
      "end": 2086.7999877929688,
      "text": " Notice what the Bible tells us in verse number 42"
    },
    {
      "id": 109,
      "start": 2086.7999877929688,
      "end": 2088.3999938964844,
      "text": " of Acts chapter number two."
    },
    {
      "id": 110,
      "start": 2088.3999938964844,
      "end": 2092.3199768066406,
      "text": " And they continued steadfastly in the apostles' doctrine"
    },
    {
      "id": 111,
      "start": 2092.3199768066406,
      "end": 2096.779998779297,
      "text": " and fellowship and in breaking of bread and in prayers."
    },
    {
      "id": 112,
      "start": 2098.9199829101562,
      "end": 2100.1199951171875,
      "text": " They're praying."
    },
    {
      "id": 113,
      "start": 2100.1199951171875,
      "end": 2102.5599975585938,
      "text": " Notice in chapter number four."
    },
    {
      "id": 114,
      "start": 2102.5599975585938,
      "end": 2104.8800048828125,
      "text": " I mentioned this just a moment ago."
    },
    {
      "id": 115,
      "start": 2104.8800048828125,
      "end": 2107.5,
      "text": " That New Testament illustration or example"
    },
    {
      "id": 116,
      "start": 2107.5,
      "end": 2109.5599975585938,
      "text": " that is given to us, they faced threats"
    },
    {
      "id": 117,
      "start": 2109.5599975585938,
      "end": 2111.959991455078,
      "text": " and faced this interrogation."
    },
    {
      "id": 118,
      "start": 2111.959991455078,
      "end": 2115.019989013672,
      "text": " In verse number 23, the Bible says, in being let go,"
    },
    {
      "id": 119,
      "start": 2115.019989013672,
      "end": 2116.3199768066406,
      "text": " they went to their own company."
    },
    {
      "id": 120,
      "start": 2116.3199768066406,
      "end": 2118.6799926757812,
      "text": " The disciples, John and Peter, that were there"
    },
    {
      "id": 121,
      "start": 2118.6799926757812,
      "end": 2120.519989013672,
      "text": " standing before the religious group"
    },
    {
      "id": 122,
      "start": 2120.519989013672,
      "end": 2123.959991455078,
      "text": " that were giving them this difficulty,"
    },
    {
      "id": 123,
      "start": 2123.959991455078,
      "end": 2126.3999938964844,
      "text": " they go to their own company, to the church."
    },
    {
      "id": 124,
      "start": 2126.3999938964844,
      "end": 2128.6799926757812,
      "text": " And it says that they reported all that the chief priests"
    },
    {
      "id": 125,
      "start": 2128.6799926757812,
      "end": 2130.279998779297,
      "text": " and elders had said unto them."
    },
    {
      "id": 126,
      "start": 2130.279998779297,
      "end": 2132.97998046875,
      "text": " And when they heard that, what did they do?"
    },
    {
      "id": 127,
      "start": 2132.97998046875,
      "end": 2136.0399780273438,
      "text": " They lifted up their voice to God with one accord."
    },
    {
      "id": 128,
      "start": 2136.0399780273438,
      "end": 2137.239990234375,
      "text": " What is that?"
    },
    {
      "id": 129,
      "start": 2137.239990234375,
      "end": 2138.3599853515625,
      "text": " It's prayer."
    },
    {
      "id": 130,
      "start": 2138.3599853515625,
      "end": 2139.47998046875,
      "text": " It's prayer."
    },
    {
      "id": 131,
      "start": 2139.47998046875,
      "end": 2142.9199829101562,
      "text": " They lifted up their voice to God with one accord"
    },
    {
      "id": 132,
      "start": 2142.9199829101562,
      "end": 2147.0399780273438,
      "text": " and said, Lord, Thou art God, which"
    },
    {
      "id": 133,
      "start": 2147.0399780273438,
      "end": 2150.7999877929688,
      "text": " has made heaven and earth and the sea"
    },
    {
      "id": 134,
      "start": 2150.7999877929688,
      "end": 2153.3599853515625,
      "text": " and all that in them is."
    },
    {
      "id": 135,
      "start": 2153.3599853515625,
      "end": 2155.199981689453,
      "text": " You think about the beginning of their prayer"
    },
    {
      "id": 136,
      "start": 2155.199981689453,
      "end": 2156.959991455078,
      "text": " here in verse number 24."
    },
    {
      "id": 137,
      "start": 2156.959991455078,
      "end": 2158.7999877929688,
      "text": " And you think about the way in which that's"
    },
    {
      "id": 138,
      "start": 2158.7999877929688,
      "end": 2159.720001220703,
      "text": " the God that we serve."
    },
    {
      "id": 139,
      "start": 2159.720001220703,
      "end": 2161.3199768066406,
      "text": " That's the God that we pray to."
    },
    {
      "id": 140,
      "start": 2161.3199768066406,
      "end": 2162.9199829101562,
      "text": " He is the Lord God omnipotent."
    },
    {
      "id": 141,
      "start": 2162.9199829101562,
      "end": 2164.199981689453,
      "text": " He's Jehovah."
    },
    {
      "id": 142,
      "start": 2164.199981689453,
      "end": 2165.5599975585938,
      "text": " He created everything."
    },
    {
      "id": 143,
      "start": 2165.5599975585938,
      "end": 2167.1600036621094,
      "text": " He sustains everything."
    },
    {
      "id": 144,
      "start": 2167.1600036621094,
      "end": 2169.279998779297,
      "text": " He is able to do anything."
    },
    {
      "id": 145,
      "start": 2169.279998779297,
      "end": 2170.7999877929688,
      "text": " You think about Hezekiah."
    },
    {
      "id": 146,
      "start": 2170.7999877929688,
      "end": 2174.3599853515625,
      "text": " When Sennacherib and they come and they seize"
    },
    {
      "id": 147,
      "start": 2174.3599853515625,
      "end": 2177.5599975585938,
      "text": " and they try to take over, they've"
    },
    {
      "id": 148,
      "start": 2177.5599975585938,
      "end": 2181.3599853515625,
      "text": " already taken the northern tribe captive Israel."
    },
    {
      "id": 149,
      "start": 2181.3599853515625,
      "end": 2183.5999755859375,
      "text": " And now Judah is under attack."
    },
    {
      "id": 150,
      "start": 2183.5999755859375,
      "end": 2185.0599975585938,
      "text": " And Hezekiah, what does he do?"
    },
    {
      "id": 151,
      "start": 2185.0599975585938,
      "end": 2187.1199951171875,
      "text": " He prays."
    },
    {
      "id": 152,
      "start": 2187.1199951171875,
      "end": 2190.3599853515625,
      "text": " Listen, he understood that Sennacherib and Rabshakeh"
    },
    {
      "id": 153,
      "start": 2190.3599853515625,
      "end": 2191.4400024414062,
      "text": " had made these threats."
    },
    {
      "id": 154,
      "start": 2191.4400024414062,
      "end": 2194.3199768066406,
      "text": " And Rabshakeh says, hey, listen, we've"
    },
    {
      "id": 155,
      "start": 2194.3199768066406,
      "end": 2195.47998046875,
      "text": " conquered everybody else."
    },
    {
      "id": 156,
      "start": 2195.47998046875,
      "end": 2196.6399841308594,
      "text": " What are you going to do?"
    },
    {
      "id": 157,
      "start": 2196.6399841308594,
      "end": 2199.7999877929688,
      "text": " He says to the people, don't let Hezekiah deceive you"
    },
    {
      "id": 158,
      "start": 2199.7999877929688,
      "end": 2201.519989013672,
      "text": " into trusting God."
    },
    {
      "id": 159,
      "start": 2201.519989013672,
      "end": 2203.9199829101562,
      "text": " You know what Hezekiah does after he gets those letters?"
    },
    {
      "id": 160,
      "start": 2203.9199829101562,
      "end": 2205.7999877929688,
      "text": " He lays them out before God."
    },
    {
      "id": 161,
      "start": 2205.7999877929688,
      "end": 2208.3599853515625,
      "text": " And he says, God, you're the Creator."
    },
    {
      "id": 162,
      "start": 2208.3599853515625,
      "end": 2209.9199829101562,
      "text": " You've made everything."
    },
    {
      "id": 163,
      "start": 2209.9199829101562,
      "end": 2212.279998779297,
      "text": " This is nothing for you."
    },
    {
      "id": 164,
      "start": 2212.279998779297,
      "end": 2213.5599975585938,
      "text": " Amen?"
    },
    {
      "id": 165,
      "start": 2213.5599975585938,
      "end": 2214.47998046875,
      "text": " He sought God."
    },
    {
      "id": 166,
      "start": 2214.47998046875,
      "end": 2218.0399780273438,
      "text": " Here, the immediate response, unfortunately in our lives,"
    },
    {
      "id": 167,
      "start": 2218.0399780273438,
      "end": 2220.0399780273438,
      "text": " there are times in which prayer is not"
    },
    {
      "id": 168,
      "start": 2220.0399780273438,
      "end": 2222.0399780273438,
      "text": " our immediate response to the difficulty."
    },
    {
      "id": 169,
      "start": 2222.0399780273438,
      "end": 2223.5999755859375,
      "text": " It's our last resort."
    },
    {
      "id": 170,
      "start": 2223.5999755859375,
      "end": 2225.4400024414062,
      "text": " But we don't go to God immediately."
    },
    {
      "id": 171,
      "start": 2225.4400024414062,
      "end": 2227.279998779297,
      "text": " We don't seek His face immediately."
    },
    {
      "id": 172,
      "start": 2227.3199768066406,
      "end": 2232.5599975585938,
      "text": " But the church in Acts 4, as soon as they heard that,"
    },
    {
      "id": 173,
      "start": 2232.5599975585938,
      "end": 2236.279998779297,
      "text": " they lifted up their voice to God with one accord."
    },
    {
      "id": 174,
      "start": 2236.279998779297,
      "end": 2239.1199951171875,
      "text": " They immediately responded with prayer."
    },
    {
      "id": 175,
      "start": 2239.1199951171875,
      "end": 2242.239990234375,
      "text": " Go over to chapter 6 and look in verse 4."
    },
    {
      "id": 176,
      "start": 2242.239990234375,
      "end": 2243.8800048828125,
      "text": " There's some trouble in the church."
    },
    {
      "id": 177,
      "start": 2243.8800048828125,
      "end": 2247.6399841308594,
      "text": " And the deacons are sought out, these men."
    },
    {
      "id": 178,
      "start": 2247.6399841308594,
      "end": 2250.1199951171875,
      "text": " And the Bible says in verse 4, as the disciples"
    },
    {
      "id": 179,
      "start": 2250.1199951171875,
      "end": 2253.3199768066406,
      "text": " would speak here, but we will give ourselves continually"
    },
    {
      "id": 180,
      "start": 2253.3199768066406,
      "end": 2258.5599975585938,
      "text": " to prayer and to the ministry of the word."
    },
    {
      "id": 181,
      "start": 2258.5599975585938,
      "end": 2260.759979248047,
      "text": " Give ourselves continually to prayer"
    },
    {
      "id": 182,
      "start": 2260.759979248047,
      "end": 2264.3199768066406,
      "text": " and to the ministry of the word."
    },
    {
      "id": 183,
      "start": 2264.3199768066406,
      "end": 2264.8399963378906,
      "text": " Why?"
    },
    {
      "id": 184,
      "start": 2264.8399963378906,
      "end": 2267.0799865722656,
      "text": " Because they understood the significance of prayer."
    },
    {
      "id": 185,
      "start": 2267.0799865722656,
      "end": 2268.8800048828125,
      "text": " They understood the significance of prayer."
    },
    {
      "id": 186,
      "start": 2271.720001220703,
      "end": 2275.1199951171875,
      "text": " Notice in chapter number 12, it's"
    },
    {
      "id": 187,
      "start": 2275.1199951171875,
      "end": 2276.759979248047,
      "text": " an exciting portion of scripture."
    },
    {
      "id": 188,
      "start": 2276.759979248047,
      "end": 2278.7999877929688,
      "text": " In fact, I had the privilege on Thursday"
    },
    {
      "id": 189,
      "start": 2278.7999877929688,
      "end": 2282.0399780273438,
      "text": " to preach chapel over at Fairfax Baptist Temple Academy."
    },
    {
      "id": 190,
      "start": 2282.0799865722656,
      "end": 2286.199981689453,
      "text": " And for the younger students, I preached from Acts 12."
    },
    {
      "id": 191,
      "start": 2286.199981689453,
      "end": 2287.7999877929688,
      "text": " And for the older students, I preached"
    },
    {
      "id": 192,
      "start": 2287.7999877929688,
      "end": 2289.0799865722656,
      "text": " from the book of 1 Samuel."
    },
    {
      "id": 193,
      "start": 2289.0799865722656,
      "end": 2292.9199829101562,
      "text": " But Acts 12, this is where James was killed."
    },
    {
      "id": 194,
      "start": 2292.9199829101562,
      "end": 2294.8399963378906,
      "text": " Peter's in prison."
    },
    {
      "id": 195,
      "start": 2294.8399963378906,
      "end": 2297.0,
      "text": " Herod's going to kill James."
    },
    {
      "id": 196,
      "start": 2297.0,
      "end": 2298.0399780273438,
      "text": " He's already killed James."
    },
    {
      "id": 197,
      "start": 2298.0399780273438,
      "end": 2299.5599975585938,
      "text": " He now wants to kill Peter."
    },
    {
      "id": 198,
      "start": 2299.5599975585938,
      "end": 2302.0399780273438,
      "text": " But the Bible tells us that when Peter was in prison,"
    },
    {
      "id": 199,
      "start": 2302.0399780273438,
      "end": 2305.199981689453,
      "text": " notice in verse number 5, Peter therefore was kept in prison,"
    },
    {
      "id": 200,
      "start": 2305.199981689453,
      "end": 2308.6399841308594,
      "text": " but prayer was made without ceasing of the church"
    },
    {
      "id": 201,
      "start": 2308.6399841308594,
      "end": 2312.0,
      "text": " unto God for him."
    },
    {
      "id": 202,
      "start": 2312.0,
      "end": 2313.8399963378906,
      "text": " They had a prayer meeting."
    },
    {
      "id": 203,
      "start": 2313.8399963378906,
      "end": 2316.0800170898438,
      "text": " If you look in chapter number 12 and verse number 12,"
    },
    {
      "id": 204,
      "start": 2316.0800170898438,
      "end": 2318.1199951171875,
      "text": " the last phrase of the verse of scripture"
    },
    {
      "id": 205,
      "start": 2318.1199951171875,
      "end": 2321.9599609375,
      "text": " says, where many were gathered together praying."
    },
    {
      "id": 206,
      "start": 2321.9599609375,
      "end": 2326.1199951171875,
      "text": " You notice that they prayed without ceasing unto God"
    },
    {
      "id": 207,
      "start": 2326.1199951171875,
      "end": 2328.0399780273438,
      "text": " for him because of the circumstance,"
    },
    {
      "id": 208,
      "start": 2328.0399780273438,
      "end": 2330.2799682617188,
      "text": " because of the situation."
    },
    {
      "id": 209,
      "start": 2330.2799682617188,
      "end": 2332.9599609375,
      "text": " And then when he's released, they're astonished."
    },
    {
      "id": 210,
      "start": 2332.9599609375,
      "end": 2335.239990234375,
      "text": " They can't even believe."
    },
    {
      "id": 211,
      "start": 2335.239990234375,
      "end": 2339.0800170898438,
      "text": " Rhoda's so excited, she forgets to open the door."
    },
    {
      "id": 212,
      "start": 2339.0800170898438,
      "end": 2341.3200073242188,
      "text": " She goes running back in and says, hey,"
    },
    {
      "id": 213,
      "start": 2341.3200073242188,
      "end": 2343.0800170898438,
      "text": " Peter's knocking at the door."
    },
    {
      "id": 214,
      "start": 2343.0800170898438,
      "end": 2344.239990234375,
      "text": " And they said, you're crazy."
    },
    {
      "id": 215,
      "start": 2344.239990234375,
      "end": 2346.9199829101562,
      "text": " You're mad."
    },
    {
      "id": 216,
      "start": 2346.9199829101562,
      "end": 2350.6400146484375,
      "text": " And there's Peter still knocking."
    },
    {
      "id": 217,
      "start": 2350.6400146484375,
      "end": 2351.760009765625,
      "text": " And they let him in."
    },
    {
      "id": 218,
      "start": 2351.760009765625,
      "end": 2355.0,
      "text": " And the Bible tells us that, verse number 17,"
    },
    {
      "id": 219,
      "start": 2355.0,
      "end": 2357.6799926757812,
      "text": " he beckoning unto them with the hand to hold their peace."
    },
    {
      "id": 220,
      "start": 2357.6799926757812,
      "end": 2358.8800048828125,
      "text": " I think there was excitement."
    },
    {
      "id": 221,
      "start": 2358.8800048828125,
      "end": 2359.7999877929688,
      "text": " Peter, what happened?"
    },
    {
      "id": 222,
      "start": 2359.7999877929688,
      "end": 2360.6799926757812,
      "text": " How did you?"
    },
    {
      "id": 223,
      "start": 2360.6799926757812,
      "end": 2361.4400024414062,
      "text": " Can you imagine?"
    },
    {
      "id": 224,
      "start": 2361.4400024414062,
      "end": 2363.0,
      "text": " You've been praying."
    },
    {
      "id": 225,
      "start": 2363.0,
      "end": 2364.3999633789062,
      "text": " Peter's in prison."
    },
    {
      "id": 226,
      "start": 2364.3999633789062,
      "end": 2366.8800048828125,
      "text": " And now Peter's where you are."
    },
    {
      "id": 227,
      "start": 2366.8800048828125,
      "end": 2368.3200073242188,
      "text": " You want to know what happened."
    },
    {
      "id": 228,
      "start": 2368.3200073242188,
      "end": 2370.1599731445312,
      "text": " Everyone's talking, trying to figure it out."
    },
    {
      "id": 229,
      "start": 2370.1599731445312,
      "end": 2372.1599731445312,
      "text": " And Peter, beckoning unto them with their hand"
    },
    {
      "id": 230,
      "start": 2372.1599731445312,
      "end": 2374.1199951171875,
      "text": " to hold their peace, he declared unto them"
    },
    {
      "id": 231,
      "start": 2374.1199951171875,
      "end": 2377.8399658203125,
      "text": " how the Lord had brought him out of the prison."
    },
    {
      "id": 232,
      "start": 2377.8399658203125,
      "end": 2383.0,
      "text": " That had to be exciting because our God answers prayer."
    },
    {
      "id": 233,
      "start": 2383.0,
      "end": 2385.47998046875,
      "text": " But we miss out on seeing what God's able to do"
    },
    {
      "id": 234,
      "start": 2385.47998046875,
      "end": 2388.7999877929688,
      "text": " because we neglect prayer."
    },
    {
      "id": 235,
      "start": 2388.7999877929688,
      "end": 2392.719970703125,
      "text": " Notice, keep going with me, chapter 13 and verse number 3."
    },
    {
      "id": 236,
      "start": 2392.719970703125,
      "end": 2396.0,
      "text": " Notice here, this is the first missionary journey."
    },
    {
      "id": 237,
      "start": 2396.0,
      "end": 2398.6400146484375,
      "text": " And God, the Holy Spirit of God says in verse number 2,"
    },
    {
      "id": 238,
      "start": 2398.6400146484375,
      "end": 2400.6400146484375,
      "text": " as they ministered to the Lord and fasted,"
    },
    {
      "id": 239,
      "start": 2400.6400146484375,
      "end": 2403.4400024414062,
      "text": " the Holy Ghost said, separate me, Barnabas."
    },
    {
      "id": 0,
      "start": 2403.4400024414062,
      "end": 2405.9800024032593,
      "text": " and Saul, for the work whereinto I have called them."
    },
    {
      "id": 1,
      "start": 2405.9800024032593,
      "end": 2409.1800022125244,
      "text": " And when they had fasted and prayed,"
    },
    {
      "id": 2,
      "start": 2409.1800022125244,
      "end": 2412.1400022506714,
      "text": " and laid their hands on them, they sent them away.\""
    },
    {
      "id": 3,
      "start": 2412.1400022506714,
      "end": 2415.6000022888184,
      "text": " I believe that not only did the church here at Antioch"
    },
    {
      "id": 4,
      "start": 2415.6000022888184,
      "end": 2419.3000020980835,
      "text": " pray for these as they went out on this first missionary journey,"
    },
    {
      "id": 5,
      "start": 2419.3000020980835,
      "end": 2422.1000022888184,
      "text": " but I would argue that they prayed for them"
    },
    {
      "id": 6,
      "start": 2422.1000022888184,
      "end": 2424.5600032806396,
      "text": " during the entirety of the missionary journey."
    },
    {
      "id": 7,
      "start": 2424.5600032806396,
      "end": 2427.1400032043457,
      "text": " And that's why at the end of chapter number 14,"
    },
    {
      "id": 8,
      "start": 2427.1400032043457,
      "end": 2429.4400024414062,
      "text": " when they return from this missionary journey,"
    },
    {
      "id": 9,
      "start": 2429.4400024414062,
      "end": 2431.9400024414062,
      "text": " and they're going to announce that they're going to be there"
    },
    {
      "id": 10,
      "start": 2431.9400024414062,
      "end": 2435.1000022888184,
      "text": " to give an update that the people show up."
    },
    {
      "id": 11,
      "start": 2435.1000022888184,
      "end": 2437.6400032043457,
      "text": " Why? Because they want to hear how God answered prayer."
    },
    {
      "id": 12,
      "start": 2437.6400032043457,
      "end": 2439.6400032043457,
      "text": " And if you look at the end of chapter number 14"
    },
    {
      "id": 13,
      "start": 2439.6400032043457,
      "end": 2441.400001525879,
      "text": " in the middle of verse number 27,"
    },
    {
      "id": 14,
      "start": 2441.400001525879,
      "end": 2446.6400032043457,
      "text": " it says that they rehearsed all that God had done with them."
    },
    {
      "id": 15,
      "start": 2446.6400032043457,
      "end": 2448.9400024414062,
      "text": " When we hear these update letters from our missionaries,"
    },
    {
      "id": 16,
      "start": 2448.9400024414062,
      "end": 2450.680004119873,
      "text": " when we hear of how God is working,"
    },
    {
      "id": 17,
      "start": 2450.680004119873,
      "end": 2454.4400024414062,
      "text": " listen, it's exciting to us if we've been praying for them."
    },
    {
      "id": 18,
      "start": 2454.4400024414062,
      "end": 2457.9400024414062,
      "text": " Because we get to hear how God's answering our prayers."
    },
    {
      "id": 19,
      "start": 2457.9400024414062,
      "end": 2460.6000022888184,
      "text": " We're praying for people that sometimes we don't even know."
    },
    {
      "id": 20,
      "start": 2460.6000022888184,
      "end": 2462.7600021362305,
      "text": " We have missionaries that we've supported"
    },
    {
      "id": 21,
      "start": 2462.7600021362305,
      "end": 2465.2600021362305,
      "text": " from before the time I got here as pastor"
    },
    {
      "id": 22,
      "start": 2465.2600021362305,
      "end": 2469.0600051879883,
      "text": " that we still support today that I've not met them face to face."
    },
    {
      "id": 23,
      "start": 2469.0600051879883,
      "end": 2470.520004272461,
      "text": " I've had interaction with them."
    },
    {
      "id": 24,
      "start": 2470.520004272461,
      "end": 2473.300003051758,
      "text": " They've not been able to leave their field for a period of time"
    },
    {
      "id": 25,
      "start": 2473.300003051758,
      "end": 2475.6000061035156,
      "text": " to be able to come for furlough and so on and so forth."
    },
    {
      "id": 26,
      "start": 2475.6000061035156,
      "end": 2477.4800033569336,
      "text": " And I've had correspondence with them,"
    },
    {
      "id": 27,
      "start": 2477.4800033569336,
      "end": 2479.1399993896484,
      "text": " but I've not met them face to face."
    },
    {
      "id": 28,
      "start": 2479.1399993896484,
      "end": 2483.7600021362305,
      "text": " And yet we pray for them and we see how God works."
    },
    {
      "id": 29,
      "start": 2483.7600021362305,
      "end": 2485.680000305176,
      "text": " We see what God does."
    },
    {
      "id": 30,
      "start": 2485.680000305176,
      "end": 2488.6000061035156,
      "text": " That's why missions conferences are so exciting to me."
    },
    {
      "id": 31,
      "start": 2488.6000061035156,
      "end": 2490.5600051879883,
      "text": " Why? Because we get to hear what God's doing"
    },
    {
      "id": 32,
      "start": 2490.5600051879883,
      "end": 2492.520004272461,
      "text": " in the lives of these missionaries."
    },
    {
      "id": 33,
      "start": 2492.520004272461,
      "end": 2493.6399993896484,
      "text": " We're invested in it."
    },
    {
      "id": 34,
      "start": 2493.6399993896484,
      "end": 2496.6000061035156,
      "text": " We're not only giving to it, but we're also praying for them."
    },
    {
      "id": 35,
      "start": 2496.6000061035156,
      "end": 2500.180000305176,
      "text": " We find that in chapter number 16 and verse number 25."
    },
    {
      "id": 36,
      "start": 2500.180000305176,
      "end": 2502.4800033569336,
      "text": " Notice what the Bible says here."
    },
    {
      "id": 37,
      "start": 2502.4800033569336,
      "end": 2505.3600006103516,
      "text": " They're in a situation there in Philippi,"
    },
    {
      "id": 38,
      "start": 2505.3600006103516,
      "end": 2507.840003967285,
      "text": " and they're imprisoned, Paul and Silas."
    },
    {
      "id": 39,
      "start": 2507.840003967285,
      "end": 2510.6000061035156,
      "text": " And the Bible says in Acts 16 and 25,"
    },
    {
      "id": 40,
      "start": 2510.6000061035156,
      "end": 2513.9400024414062,
      "text": " and at midnight, Paul and Silas, what does it say?"
    },
    {
      "id": 41,
      "start": 2513.9400024414062,
      "end": 2517.0600051879883,
      "text": " They prayed and they sang praises unto God,"
    },
    {
      "id": 42,
      "start": 2517.0600051879883,
      "end": 2520.520004272461,
      "text": " and the prisoners heard them."
    },
    {
      "id": 43,
      "start": 2520.520004272461,
      "end": 2523.3600006103516,
      "text": " What did God do? There's a great earthquake."
    },
    {
      "id": 44,
      "start": 2523.3600006103516,
      "end": 2526.5600051879883,
      "text": " God released them."
    },
    {
      "id": 45,
      "start": 2526.5600051879883,
      "end": 2527.900001525879,
      "text": " Can you think about the impact"
    },
    {
      "id": 46,
      "start": 2527.900001525879,
      "end": 2530.4400024414062,
      "text": " that this must have had in Philippi?"
    },
    {
      "id": 47,
      "start": 2530.4400024414062,
      "end": 2532.6800079345703,
      "text": " As Paul writes back to the believers in Philippi"
    },
    {
      "id": 48,
      "start": 2532.6800079345703,
      "end": 2536.760009765625,
      "text": " in the letter that we call the Book of Philippians,"
    },
    {
      "id": 49,
      "start": 2536.760009765625,
      "end": 2538.020004272461,
      "text": " I think about this jailer."
    },
    {
      "id": 50,
      "start": 2538.020004272461,
      "end": 2543.1399993896484,
      "text": " He will soon say, sirs, what must I do to be saved?"
    },
    {
      "id": 51,
      "start": 2543.1399993896484,
      "end": 2544.8600006103516,
      "text": " Paul and Silas didn't lift up their voice"
    },
    {
      "id": 52,
      "start": 2544.9000091552734,
      "end": 2548.520004272461,
      "text": " and complain about their circumstances."
    },
    {
      "id": 53,
      "start": 2548.520004272461,
      "end": 2549.8200073242188,
      "text": " They didn't lift up their voice"
    },
    {
      "id": 54,
      "start": 2549.8200073242188,
      "end": 2552.8200073242188,
      "text": " and have everyone hear them in a wrong manner."
    },
    {
      "id": 55,
      "start": 2552.8200073242188,
      "end": 2554.8200073242188,
      "text": " No, they lifted up their voices and they prayed"
    },
    {
      "id": 56,
      "start": 2554.8200073242188,
      "end": 2557.6199951171875,
      "text": " and they sang praises unto God."
    },
    {
      "id": 57,
      "start": 2557.6199951171875,
      "end": 2560.240005493164,
      "text": " You say, how could we praise God in such a situation?"
    },
    {
      "id": 58,
      "start": 2560.240005493164,
      "end": 2562.8200073242188,
      "text": " Because God's in control."
    },
    {
      "id": 59,
      "start": 2562.8200073242188,
      "end": 2564.520004272461,
      "text": " Were they rightly imprisoned?"
    },
    {
      "id": 60,
      "start": 2564.520004272461,
      "end": 2569.1600036621094,
      "text": " No, they weren't."
    },
    {
      "id": 61,
      "start": 2569.1600036621094,
      "end": 2572.020004272461,
      "text": " But sometimes, even when things from a human perspective"
    },
    {
      "id": 62,
      "start": 2572.020004272461,
      "end": 2574.1000061035156,
      "text": " don't seem to be right,"
    },
    {
      "id": 63,
      "start": 2574.4000091552734,
      "end": 2577.1000061035156,
      "text": " God is still in control of that."
    },
    {
      "id": 64,
      "start": 2577.1000061035156,
      "end": 2578.720001220703,
      "text": " How many times I've heard people say,"
    },
    {
      "id": 65,
      "start": 2578.720001220703,
      "end": 2580.760009765625,
      "text": " well, that just wasn't supposed to be this way,"
    },
    {
      "id": 66,
      "start": 2580.760009765625,
      "end": 2582.0599975585938,
      "text": " and this happened and that happened,"
    },
    {
      "id": 67,
      "start": 2582.0599975585938,
      "end": 2584.0599975585938,
      "text": " and these people this and those people that."
    },
    {
      "id": 68,
      "start": 2584.0599975585938,
      "end": 2586.6800079345703,
      "text": " God's over all of that."
    },
    {
      "id": 69,
      "start": 2586.6800079345703,
      "end": 2587.4400024414062,
      "text": " Amen?"
    },
    {
      "id": 70,
      "start": 2587.4400024414062,
      "end": 2590.6399993896484,
      "text": " And if God still let it happen,"
    },
    {
      "id": 71,
      "start": 2590.6399993896484,
      "end": 2592.5599975585938,
      "text": " then God let it happen."
    },
    {
      "id": 72,
      "start": 2592.5599975585938,
      "end": 2594.0599975585938,
      "text": " And I'm not going to waste my time"
    },
    {
      "id": 73,
      "start": 2594.0599975585938,
      "end": 2595.5599975585938,
      "text": " trying to figure out how to reverse something"
    },
    {
      "id": 74,
      "start": 2595.5599975585938,
      "end": 2597.0599975585938,
      "text": " and why I'm going to be upset about it"
    },
    {
      "id": 75,
      "start": 2597.0599975585938,
      "end": 2598.020004272461,
      "text": " and so on and so forth."
    },
    {
      "id": 76,
      "start": 2598.020004272461,
      "end": 2599.5599975585938,
      "text": " I'm just going to press on and serve God."
    },
    {
      "id": 77,
      "start": 2599.5599975585938,
      "end": 2602.760009765625,
      "text": " Chapter 21, verse 5."
    },
    {
      "id": 78,
      "start": 2602.800003051758,
      "end": 2605.220001220703,
      "text": " Again, we could look at a number of additional references"
    },
    {
      "id": 79,
      "start": 2605.220001220703,
      "end": 2608.760009765625,
      "text": " throughout the book of Acts."
    },
    {
      "id": 80,
      "start": 2608.760009765625,
      "end": 2611.520004272461,
      "text": " Here in Acts 21,"
    },
    {
      "id": 81,
      "start": 2611.520004272461,
      "end": 2615.4199981689453,
      "text": " Paul's gathered with some of the believers"
    },
    {
      "id": 82,
      "start": 2615.4199981689453,
      "end": 2618.020004272461,
      "text": " and they tarried there for seven days."
    },
    {
      "id": 83,
      "start": 2618.020004272461,
      "end": 2619.260009765625,
      "text": " He was going to Jerusalem."
    },
    {
      "id": 84,
      "start": 2619.260009765625,
      "end": 2620.8399963378906,
      "text": " And it tells us in verse 5,"
    },
    {
      "id": 85,
      "start": 2620.8399963378906,
      "end": 2623.720001220703,
      "text": " and when we'd accomplished those days,"
    },
    {
      "id": 86,
      "start": 2623.720001220703,
      "end": 2625.1399993896484,
      "text": " we departed and went our way,"
    },
    {
      "id": 87,
      "start": 2625.1399993896484,
      "end": 2627.1000061035156,
      "text": " and they all brought us on our way"
    },
    {
      "id": 88,
      "start": 2627.1000061035156,
      "end": 2628.260009765625,
      "text": " with wives and children"
    },
    {
      "id": 89,
      "start": 2628.260009765625,
      "end": 2629.800003051758,
      "text": " until we were out of the city"
    },
    {
      "id": 90,
      "start": 2629.8399963378906,
      "end": 2632.5599975585938,
      "text": " and we kneeled down on the shore"
    },
    {
      "id": 91,
      "start": 2632.5599975585938,
      "end": 2634.1399993896484,
      "text": " and prayed."
    },
    {
      "id": 92,
      "start": 2634.1399993896484,
      "end": 2636.720001220703,
      "text": " And prayed."
    },
    {
      "id": 93,
      "start": 2636.720001220703,
      "end": 2638.9400024414062,
      "text": " It's exciting to read the book of Acts."
    },
    {
      "id": 94,
      "start": 2638.9400024414062,
      "end": 2640.6399993896484,
      "text": " It's exciting to see what God did"
    },
    {
      "id": 95,
      "start": 2640.6399993896484,
      "end": 2641.800003051758,
      "text": " and how God worked"
    },
    {
      "id": 96,
      "start": 2641.800003051758,
      "end": 2646.520004272461,
      "text": " and how the Gospel there in Jerusalem"
    },
    {
      "id": 97,
      "start": 2646.520004272461,
      "end": 2647.8399963378906,
      "text": " influenced so many"
    },
    {
      "id": 98,
      "start": 2647.8399963378906,
      "end": 2650.760009765625,
      "text": " and the church exploded with membership"
    },
    {
      "id": 99,
      "start": 2650.760009765625,
      "end": 2652.6800079345703,
      "text": " and attendance."
    },
    {
      "id": 100,
      "start": 2652.6800079345703,
      "end": 2654.760009765625,
      "text": " But God did not intend that the Gospel"
    },
    {
      "id": 101,
      "start": 2654.760009765625,
      "end": 2656.3800048828125,
      "text": " simply stay in Jerusalem."
    },
    {
      "id": 102,
      "start": 2656.3800048828125,
      "end": 2658.220001220703,
      "text": " He had given the specific instruction"
    },
    {
      "id": 103,
      "start": 2658.220001220703,
      "end": 2659.720001220703,
      "text": " as recorded in Acts 1"
    },
    {
      "id": 104,
      "start": 2659.720001220703,
      "end": 2661.519989013672,
      "text": " that they're to be in Jerusalem and Judea"
    },
    {
      "id": 105,
      "start": 2661.519989013672,
      "end": 2663.519989013672,
      "text": " and Samaria and unto the uttermost part of the earth"
    },
    {
      "id": 106,
      "start": 2663.519989013672,
      "end": 2665.220001220703,
      "text": " after they're endued with power"
    },
    {
      "id": 107,
      "start": 2665.220001220703,
      "end": 2666.720001220703,
      "text": " of the Holy Ghost."
    },
    {
      "id": 108,
      "start": 2666.720001220703,
      "end": 2668.220001220703,
      "text": " And we find that it's in Acts 8"
    },
    {
      "id": 109,
      "start": 2668.220001220703,
      "end": 2670.0599975585938,
      "text": " as that persecution intensifies"
    },
    {
      "id": 110,
      "start": 2670.0599975585938,
      "end": 2671.720001220703,
      "text": " that they're scattered abroad"
    },
    {
      "id": 111,
      "start": 2671.720001220703,
      "end": 2673.720001220703,
      "text": " and they went everywhere preaching the Word."
    },
    {
      "id": 112,
      "start": 2673.720001220703,
      "end": 2676.220001220703,
      "text": " And you begin to see how God's purposes"
    },
    {
      "id": 113,
      "start": 2676.220001220703,
      "end": 2677.519989013672,
      "text": " are being fulfilled."
    },
    {
      "id": 114,
      "start": 2677.519989013672,
      "end": 2679.720001220703,
      "text": " And it's being fulfilled through persecution"
    },
    {
      "id": 115,
      "start": 2679.720001220703,
      "end": 2682.220001220703,
      "text": " in Acts chapter number 8."
    },
    {
      "id": 116,
      "start": 2682.220001220703,
      "end": 2684.220001220703,
      "text": " That's what caused them to be scattered abroad"
    },
    {
      "id": 117,
      "start": 2684.220001220703,
      "end": 2686.720001220703,
      "text": " but they went everywhere preaching the Word."
    },
    {
      "id": 118,
      "start": 2686.720001220703,
      "end": 2690.720001220703,
      "text": " And you begin to see how the Gospel reached"
    },
    {
      "id": 119,
      "start": 2690.720001220703,
      "end": 2692.720001220703,
      "text": " just the known world"
    },
    {
      "id": 120,
      "start": 2692.720001220703,
      "end": 2694.220001220703,
      "text": " throughout the book of Acts."
    },
    {
      "id": 121,
      "start": 2694.220001220703,
      "end": 2695.720001220703,
      "text": " And you begin to understand"
    },
    {
      "id": 122,
      "start": 2695.720001220703,
      "end": 2698.220001220703,
      "text": " the implications of all that takes place"
    },
    {
      "id": 123,
      "start": 2698.220001220703,
      "end": 2699.220001220703,
      "text": " in the book of Acts."
    },
    {
      "id": 124,
      "start": 2699.220001220703,
      "end": 2701.720001220703,
      "text": " And you say, there's a key."
    },
    {
      "id": 125,
      "start": 2701.720001220703,
      "end": 2704.220001220703,
      "text": " And it's prayer."
    },
    {
      "id": 126,
      "start": 2704.220001220703,
      "end": 2705.720001220703,
      "text": " And to the believers in Colossae"
    },
    {
      "id": 127,
      "start": 2705.720001220703,
      "end": 2707.720001220703,
      "text": " as Paul is wrapping up this book"
    },
    {
      "id": 128,
      "start": 2707.720001220703,
      "end": 2710.220001220703,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 129,
      "start": 2710.220001220703,
      "end": 2711.720001220703,
      "text": " he says in verse 2,"
    },
    {
      "id": 130,
      "start": 2711.720001220703,
      "end": 2714.720001220703,
      "text": " continue in prayer."
    },
    {
      "id": 131,
      "start": 2714.720001220703,
      "end": 2716.220001220703,
      "text": " Continue in prayer."
    },
    {
      "id": 132,
      "start": 2716.220001220703,
      "end": 2719.220001220703,
      "text": " We recognize this morning the privilege that it is"
    },
    {
      "id": 133,
      "start": 2719.220001220703,
      "end": 2721.220001220703,
      "text": " that is ours to pray."
    },
    {
      "id": 134,
      "start": 2721.220001220703,
      "end": 2723.220001220703,
      "text": " It's a great privilege"
    },
    {
      "id": 135,
      "start": 2723.220001220703,
      "end": 2726.220001220703,
      "text": " that we can go before the throne room of heaven"
    },
    {
      "id": 136,
      "start": 2726.220001220703,
      "end": 2728.220001220703,
      "text": " and seek the face of God"
    },
    {
      "id": 137,
      "start": 2728.220001220703,
      "end": 2730.220001220703,
      "text": " and know that He hears us"
    },
    {
      "id": 138,
      "start": 2730.220001220703,
      "end": 2733.220001220703,
      "text": " and know that He's able."
    },
    {
      "id": 139,
      "start": 2733.220001220703,
      "end": 2735.220001220703,
      "text": " It's not just some kind of wishful"
    },
    {
      "id": 140,
      "start": 2735.220001220703,
      "end": 2736.720001220703,
      "text": " I hope these things are going to happen,"
    },
    {
      "id": 141,
      "start": 2736.720001220703,
      "end": 2738.220001220703,
      "text": " I hope God hears me."
    },
    {
      "id": 142,
      "start": 2738.220001220703,
      "end": 2740.720001220703,
      "text": " No, no, we have confidence"
    },
    {
      "id": 143,
      "start": 2740.720001220703,
      "end": 2743.220001220703,
      "text": " that He hears us."
    },
    {
      "id": 144,
      "start": 2743.220001220703,
      "end": 2745.720001220703,
      "text": " The petition from Paul"
    },
    {
      "id": 145,
      "start": 2745.720001220703,
      "end": 2747.220001220703,
      "text": " not only continue in prayer"
    },
    {
      "id": 146,
      "start": 2747.220001220703,
      "end": 2748.720001220703,
      "text": " and watch in the same with Thanksgiving,"
    },
    {
      "id": 147,
      "start": 2748.720001220703,
      "end": 2750.220001220703,
      "text": " but for us,"
    },
    {
      "id": 148,
      "start": 2750.220001220703,
      "end": 2751.720001220703,
      "text": " the door of utterance would be open unto us,"
    },
    {
      "id": 149,
      "start": 2751.720001220703,
      "end": 2754.220001220703,
      "text": " that we would speak the mystery of God,"
    },
    {
      "id": 150,
      "start": 2754.220001220703,
      "end": 2756.720001220703,
      "text": " that we would do what we're supposed to do,"
    },
    {
      "id": 151,
      "start": 2756.720001220703,
      "end": 2758.220001220703,
      "text": " that we would pray one for another,"
    },
    {
      "id": 152,
      "start": 2758.220001220703,
      "end": 2760.220001220703,
      "text": " that we would be the ambassadors,"
    },
    {
      "id": 153,
      "start": 2760.220001220703,
      "end": 2762.720001220703,
      "text": " the witnesses that God's called us to be."
    },
    {
      "id": 154,
      "start": 2762.720001220703,
      "end": 2765.220001220703,
      "text": " It's a pattern for God's people."
    },
    {
      "id": 155,
      "start": 2765.220001220703,
      "end": 2768.220001220703,
      "text": " Prayer is not something that we just,"
    },
    {
      "id": 156,
      "start": 2768.220001220703,
      "end": 2770.220001220703,
      "text": " yep, I had my time of prayer."
    },
    {
      "id": 157,
      "start": 2770.220001220703,
      "end": 2772.720001220703,
      "text": " It's not just some rote religion."
    },
    {
      "id": 158,
      "start": 2772.720001220703,
      "end": 2775.220001220703,
      "text": " It's talking to God."
    },
    {
      "id": 159,
      "start": 2775.220001220703,
      "end": 2777.720001220703,
      "text": " He's the creator of the universe."
    },
    {
      "id": 160,
      "start": 2777.720001220703,
      "end": 2779.220001220703,
      "text": " And knowing that He hears us"
    },
    {
      "id": 161,
      "start": 2779.220001220703,
      "end": 2782.220001220703,
      "text": " and He answers us, it's amazing."
    },
    {
      "id": 162,
      "start": 2782.220001220703,
      "end": 2784.220001220703,
      "text": " It's phenomenal."
    },
    {
      "id": 163,
      "start": 2784.220001220703,
      "end": 2786.220001220703,
      "text": " We see throughout the Word of God"
    },
    {
      "id": 164,
      "start": 2786.220001220703,
      "end": 2789.220001220703,
      "text": " this pattern that has been established."
    },
    {
      "id": 165,
      "start": 2789.220001220703,
      "end": 2792.220001220703,
      "text": " It seems as if in the busyness of life,"
    },
    {
      "id": 166,
      "start": 2792.220001220703,
      "end": 2794.720001220703,
      "text": " I understand we live in a busy, busy time."
    },
    {
      "id": 167,
      "start": 2794.720001220703,
      "end": 2797.220001220703,
      "text": " It's amazing to me how busy we are."
    },
    {
      "id": 168,
      "start": 2797.220001220703,
      "end": 2799.220001220703,
      "text": " Because we have more modern conveniences"
    },
    {
      "id": 169,
      "start": 2799.220001220703,
      "end": 2802.220001220703,
      "text": " than we've ever had."
    },
    {
      "id": 170,
      "start": 2802.220001220703,
      "end": 2804.720001220703,
      "text": " We have a washing machine."
    },
    {
      "id": 171,
      "start": 2804.720001220703,
      "end": 2806.220001220703,
      "text": " You know what the alternative is?"
    },
    {
      "id": 172,
      "start": 2806.220001220703,
      "end": 2808.220001220703,
      "text": " You know what they did 150 years ago?"
    },
    {
      "id": 173,
      "start": 2808.220001220703,
      "end": 2811.220001220703,
      "text": " They didn't have no washing machines."
    },
    {
      "id": 174,
      "start": 2811.220001220703,
      "end": 2815.220001220703,
      "text": " Right? We got grocery stores."
    },
    {
      "id": 175,
      "start": 2815.220001220703,
      "end": 2817.220001220703,
      "text": " I could go on and on of all the modern conveniences"
    },
    {
      "id": 176,
      "start": 2817.220001220703,
      "end": 2819.220001220703,
      "text": " that we have."
    },
    {
      "id": 177,
      "start": 2819.220001220703,
      "end": 2820.720001220703,
      "text": " And yet we have less time"
    },
    {
      "id": 178,
      "start": 2820.720001220703,
      "end": 2823.220001220703,
      "text": " than we seem to have ever had."
    },
    {
      "id": 179,
      "start": 2823.220001220703,
      "end": 2825.220001220703,
      "text": " Right?"
    },
    {
      "id": 180,
      "start": 2825.220001220703,
      "end": 2827.720001220703,
      "text": " The enemy doesn't want us to pray."
    },
    {
      "id": 181,
      "start": 2827.720001220703,
      "end": 2829.720001220703,
      "text": " But we need to understand this pattern of prayer"
    },
    {
      "id": 182,
      "start": 2829.720001220703,
      "end": 2831.720001220703,
      "text": " that is established in the Word of God"
    },
    {
      "id": 183,
      "start": 2831.720001220703,
      "end": 2834.720001220703,
      "text": " Continue in prayer."
    },
    {
      "id": 184,
      "start": 2834.720001220703,
      "end": 2838.720001220703,
      "text": " Watch in the same with Thanksgiving."
    },
    {
      "id": 185,
      "start": 2838.720001220703,
      "end": 2840.220001220703,
      "text": " That we would have that encouragement"
    },
    {
      "id": 186,
      "start": 2840.220001220703,
      "end": 2842.720001220703,
      "text": " that Paul gives these believers in Colossae."
    },
    {
      "id": 187,
      "start": 2842.720001220703,
      "end": 2844.720001220703,
      "text": " And we'd say, you know what?"
    },
    {
      "id": 188,
      "start": 2844.720001220703,
      "end": 2847.220001220703,
      "text": " I need to make this a priority."
    },
    {
      "id": 189,
      "start": 2847.220001220703,
      "end": 2850.720001220703,
      "text": " Because when I pray, I get to see what God can do."
    },
    {
      "id": 190,
      "start": 2850.720001220703,
      "end": 2853.220001220703,
      "text": " And God can do more than any of us can do,"
    },
    {
      "id": 191,
      "start": 2853.220001220703,
      "end": 2855.220001220703,
      "text": " than all of us can do collectively."
    },
    {
      "id": 192,
      "start": 2855.220001220703,
      "end": 2856.720001220703,
      "text": " He can do more."
    },
    {
      "id": 193,
      "start": 2856.720001220703,
      "end": 2857.720001220703,
      "text": " Amen?"
    },
    {
      "id": 194,
      "start": 2857.720001220703,
      "end": 2859.220001220703,
      "text": " Oh, that we'd be people of prayer."
    },
    {
      "id": 195,
      "start": 2859.220001220703,
      "end": 2860.220001220703,
      "text": " Let's pray together."
    },
    {
      "id": 196,
      "start": 2860.220001220703,
      "end": 2861.720001220703,
      "text": " Father, we love You."
    },
    {
      "id": 197,
      "start": 2861.720001220703,
      "end": 2864.720001220703,
      "text": " We thank You so much for loving us."
    },
    {
      "id": 198,
      "start": 2864.720001220703,
      "end": 2868.220001220703,
      "text": " Thank You for this instruction, this admonition."
    },
    {
      "id": 199,
      "start": 2868.220001220703,
      "end": 2872.720001220703,
      "text": " I'm encouraged as I read the portion of Scripture."
    },
    {
      "id": 200,
      "start": 2872.720001220703,
      "end": 2876.220001220703,
      "text": " I'm also challenged."
    },
    {
      "id": 201,
      "start": 2876.220001220703,
      "end": 2879.720001220703,
      "text": " Lord, I pray that You would help us"
    },
    {
      "id": 202,
      "start": 2879.720001220703,
      "end": 2884.220001220703,
      "text": " to be honest with ourselves and with You"
    },
    {
      "id": 203,
      "start": 2884.220001220703,
      "end": 2889.720001220703,
      "text": " with regard to the subject of prayer."
    },
    {
      "id": 204,
      "start": 2889.720001220703,
      "end": 2891.220001220703,
      "text": " If we've neglected prayer,"
    },
    {
      "id": 205,
      "start": 2891.220001220703,
      "end": 2894.220001220703,
      "text": " would You help us to acknowledge that and confess it?"
    },
    {
      "id": 206,
      "start": 2894.220001220703,
      "end": 2896.220001220703,
      "text": " Lord, would You help us to make commitments"
    },
    {
      "id": 207,
      "start": 2896.220001220703,
      "end": 2899.220001220703,
      "text": " to engage in prayer,"
    },
    {
      "id": 208,
      "start": 2899.220001220703,
      "end": 2902.720001220703,
      "text": " to intercede on the behalf of one another,"
    },
    {
      "id": 209,
      "start": 2902.720001220703,
      "end": 2906.220001220703,
      "text": " knowing that You're able to do exceeding abundantly"
    },
    {
      "id": 210,
      "start": 2906.220001220703,
      "end": 2909.720001220703,
      "text": " above all that we ask or think?"
    },
    {
      "id": 211,
      "start": 2909.720001220703,
      "end": 2911.720001220703,
      "text": " Would You help us to understand"
    },
    {
      "id": 212,
      "start": 2911.720001220703,
      "end": 2918.7200317382812,
      "text": " as we consider the great acts"
    },
    {
      "id": 213,
      "start": 2918.7200317382812,
      "end": 2922.7200317382812,
      "text": " that we read of in the book of Acts,"
    },
    {
      "id": 214,
      "start": 2922.7200317382812,
      "end": 2926.2200317382812,
      "text": " how that it was a people that prayed,"
    },
    {
      "id": 215,
      "start": 2926.2200317382812,
      "end": 2928.2200317382812,
      "text": " and they saw You work?"
    },
    {
      "id": 216,
      "start": 2928.2200317382812,
      "end": 2929.7200317382812,
      "text": " God, help us to be a praying church,"
    },
    {
      "id": 217,
      "start": 2929.7200317382812,
      "end": 2932.2200317382812,
      "text": " a praying people."
    },
    {
      "id": 218,
      "start": 2932.2200317382812,
      "end": 2935.2200317382812,
      "text": " I pray that You'd move and work as only You can"
    },
    {
      "id": 219,
      "start": 2935.2200317382812,
      "end": 2939.2200317382812,
      "text": " as we have an opportunity to respond."
    },
    {
      "id": 220,
      "start": 2939.2200317382812,
      "end": 2941.7200317382812,
      "text": " As the Holy Spirit of God has worked in hearts and lives,"
    },
    {
      "id": 221,
      "start": 2941.7200317382812,
      "end": 2942.7200317382812,
      "text": " would You help us to say,"
    },
    {
      "id": 222,
      "start": 2942.7200317382812,
      "end": 2943.7200317382812,
      "text": " yes, Lord, yes?"
    },
    {
      "id": 223,
      "start": 2943.7200317382812,
      "end": 2944.7200317382812,
      "text": " Would You help us, Lord,"
    },
    {
      "id": 224,
      "start": 2944.7200317382812,
      "end": 2947.7200317382812,
      "text": " to do business with You in these moments?"
    },
    {
      "id": 225,
      "start": 2947.7200317382812,
      "end": 2949.7200317382812,
      "text": " We'll thank You for it in Christ's name we pray."
    },
    {
      "id": 226,
      "start": 2949.7200317382812,
      "end": 2950.7200317382812,
      "text": " Would You stand?"
    }
  ],
  "processed_at": "2025-04-17T02:49:07.035800"
}