{
  "video_id": "bdcBSlwEZJw",
  "text": "that President at that time Woodrow Wilson issued a presidential proclamation that officially established the first National Mother's Day holiday to celebrate America's mothers. We understand that prior to that official date there are many states that already celebrate it and they kind of had their own time of celebrating and recognizing but this was the first National Mother's Day. The idea for Mother's Day is credited by some to a lady by the name of Julia Ward Howe which was in 1872 and by others to Anna Jarvis 1907. Most would give the credit to Anna Jarvis for all of her hard work on sent thousands of letters and lobbied and petitioned and what have you but they both both of these ladies suggested a holiday dedicated to a day of peace. Many individual states as I mentioned a moment ago celebrated Mother's Day by 1911 but it was not until President Wilson lobbied Congress in 1914 that Mother's Day was officially set on the second Sunday of every May. In his first Mother's Day proclamation Wilson stated that the holiday offered an opportunity to publicly express our love and reverence for the mothers of our country and I'm thankful that we have this date on our calendar and there was a joke going around about whether or not you know the the mothers have a Mother's Day fathers have Father's Day but what about Kids Day and so that's just every day and but the the reality is that I'm thankful that on our calendar that every year we have Mother's Day and I sent a note to my mom this morning it's the first year in a number of years that she's not been in our presence. In fact I was sharing with Holly and the kids last night that last year on Mother's Day both my mom and Holly's mom were in attendance for Mother's Day service they were both in town and so we certainly appreciate that opportunity so I sent both of them text messages this morning and I hope that if your mom is still living that you have sought to make it a special day for her. Many of us are familiar with this passage of scripture here in Proverbs chapter 31 the content of this passage and the virtuous woman verse one however of this familiar chapter provides us with some very important information notice in Proverbs 31 and verse number one the Bible says this the words of King Lemuel the prophecy that his mother taught him that his mother taught him I've titled the message this morning his mother taught him think about the words of this single verse of scripture and the significance of it in fact there's been much debate over the centuries as to who this King Lemuel actually is and we don't have any other reference with any of the kings or chronicles that would provide us with a name of King Lemuel and so through the series of debate over the centuries there have been a number of people that have suggested that Lemuel was a name for Solomon that Bathsheba used specifically for him whether that's the case or not the Bible doesn't tell us but we do know that the name Lemuel means for God or belonging to God and it would be as you look at the text of scripture and understand all that's giving all the instruction that's that's provided here it could possibly be that it's Bathsheba who is the mother of Solomon that she had for her son this name Lemuel whether that's the case or not it's not really to be debated we find that the text does tell us however that this prophecy that is recorded in this portion of scripture it is the prophecy that his mother taught him we're going to think about this prophecy and thinking about that which is provided here I would simply say that this which his mother taught him there's instruction that is being given begin to think about instruction it continues and notice in verse 2 what my son and what the son of my womb and what the son of my vows give not thy strength unto women nor thy ways to that which destroyeth kings it is not for kings oh Lemuel it is not for kings to drink wine nor for princes strong drink lest they drink and forget the law and pervert the judgment of any of the afflicted give strong drink unto him that is ready to perish or die and wine unto those that be of a heavy heart let him drink and forget his poverty and remember his misery no more open thy mouth for the dumb and the cause of all such as are appointed to destruction open thy mouth judge righteously and plead the cause of the poor and needy in verse number 10 the bible says who can find a virtuous woman for her price is far above rubies and as you continue through the next several verses you'll find that there's much information given with regard to the virtuous woman and maybe we would say a description of that virtuous woman but i'm going to think about this text of scripture this morning and as i was meditating and preparing throughout the week that statement in verse number one really caught my attention that his mother taught him if you're taking notes this morning i want you to consider first of all with me i want you to note the vision of the instructor the vision of the instructor now we're not speaking about their physical vision but i begin to think about here in our text of scripture we understand that the instructor is the mother of this king lemuel the bible says very clearly that his mother taught him she's instructing her son and we find that she's providing counsel instruction with regard to life this morning we acknowledge however the reality that many can carry the title of instructor within the text of scripture we find that it's the mother of king lemuel but the reality is that there are many today that carry the title of instructor in fact many times as we go through life perhaps we would even have for a period of time maybe for a long period of time that title ascribed to us that we are an instructor that we are one that is giving information seeking to equip others begin to think about an instructor and thinking about the vision of an instructor and thinking here of this text of scripture and the vision of the mother of king lemuel and begin to think about an instructor i would say this an instructor has a desire to impart truth an instructor has a desire to impart truth begin to think about the vision of an instructor and noticing here in the text of scripture how that the mother of this king lemuel she desires to impart truth to her son an instructor should have that desire if they don't have a desire to impart truth they shouldn't be an instructor they have no business being in that line of work but we find that truth is vital truth is absolutely vital as we get to think about the instruction that is provided here and we know this is the word of god and we understand this morning that god said uh the lord jesus christ in john 17 sanctify them through thy word thy word is truth jesus said of himself i am the way the truth and the life no man cometh unto the father but by me i am thankful this morning for truth you understand this morning that truth is under attack you understand this morning that it seems as if there are people within our society uh that are seeking to influence the next generation and in fact if we'd be honest this morning they're having a measure of success on influencing the next generation and they have this idea that truth is relative it can be your truth or my truth or their truth but the reality this morning is that we are thankful that we have god's truth and god has given us truth this morning i begin to think about an instructor and their desire to impart truth and we see that here uh in the the instruction of proverbs chapter 31 i would say this an instructor not only has a desire to impart truth but i would say this an instructor seeks to equip for the future an instructor seeks to equip for the future i think about this passage of scripture and as you begin to study through proverbs chapter 31 it would seem as if lemuel was receiving this instruction at a young age he was being taught things that would be pertinent to his future things that may not be applied immediately in his life but the vision of the instructor is that they know they're aware of some things that are going to happen in the future with regard to life and living and circumstances and so on and so forth and so what is the instructor seeking to do well the instructor is seeking to equip the student for the future you know it's interesting you think about instruction maybe some classes that you've gone to and there are some classes that i've been to over the years and you kind of at you know particular classes and what they might be you say i hope i really never have to use this which i am being taught but we receive that instruction for the event that may come to pass and we want to be equipped for that king lemuel uh is going to eventually as you look at the content of verse 10 and following and you think about the virtuous woman and uh the the wife and the capable wife if you will and you begin to look at that portion of scripture and you think how uh the the mother of king lemuel is seeking to to equip her son for a future decision, a decision that is so important in life, the person to whom you will marry. Now we understand if it is the case that Lemuel is Solomon, he did not heed much of the instruction that is provided or contained within this portion of Scripture, we'll save that for another time. But we find that as we think about the vision of the instructor, they desire to impart truth, they seek to equip for the future, we find here that the truth of the instructor here with regard to the vision of instructor, there are cautions that are given regarding the dangers of life. This morning, we celebrate Mother's Day, we think about instructors, and some, that which would qualify an instructor is sometimes the experience that they've had in life. And as they have experienced life, I think about parenthood, I remember saying to Juliana on more than one occasion, I was 16 before, so I understand. I was this age before, so I understand. And there's certain things that we understand. I use Juliana as the example because she's our oldest, and I would say those things to her, and the reality is that God has given us an opportunity and we then as instructors are seeking to provide caution regarding the dangers of life. You know, it's quite heartbreaking for an instructor that has given a caution when they see the student, that individual that they've instructed, not give heed to the caution. We can't make them give heed to the caution, but when I think about the vision of the instructor that the vision, there's caution that is provided. There are dangers in life, many of them. The reality is you think about these young kids that just stood up here and sang and how precious that was, there are some dangers that they're going to face in life, and they need some moms that are going to instruct them, that are going to teach them, that are going to warn them, caution them with regard to those dangers. You think about signs in life and you think about those signs that say warning, caution, danger ahead. I read a report just the other day that some tourist was traveling. I did not catch where they were traveling, but they were following the GPS and they turned directly into a boat ramp marina and ended up with their van, their minivan in the water. How many of you saw that in the news? The reality is that you follow the GPS, but you've got to have a little sense as well. The reality is that literally people are jumping in the water to try to help them get out and the van's just kind of floating and that's, I don't know what you tell your insurance at that point, but I was following the GPS. And the reality is that in life there's dangers. There's danger. And as an instructor with vision, we seek to give caution regarding the dangers of life. We find that there are dangers, no doubt the book of Proverbs particularly speaks often about the strange woman. And we find that those, those warnings are provided and you see some instruction that's provided even here. You see the warning that is given with regard to alcoholic beverage there in verses 4 and 5 to King Lemuel. And we find that the warning is being provided, the caution about the dangers of life. I would say that the instructor not only gives caution regarding the dangers of life, but the instructor gives counsel regarding the decisions in life. You know decisions, we make decisions every day. We really do. Every day we make decisions. Some decisions are harder than other decisions. Would you agree this morning? And there are decisions that we make in life and especially when you think about young people and you think about being the role of an instructor and hear the vision of the instructor, the vision of the instructor is to know, to have an awareness that there are decisions in life that these individuals need to make and I'm seeking to provide them counsel with regard to those decisions. The Bible speaks much about counsel and the importance of receiving counsel, that there's safety in the multitude of counselors is what God's Word says. And we find this morning that the instructor, the vision of the instructor is to see beyond the immediate and to seek to impart truth and to equip for the future, to provide caution with regard to the dangers of life, to provide counsel with regard to the decisions in life. There are times that I've heard people say, what I do to be 18 again? And I kind of scratch my head and I'm like, do you remember how hard it was when you were 18 trying to make all those decisions? I mean, there's a lot of stuff that you're trying to process and go through and some people might make that statement because they say, well, I'm wiser now and maybe I'd choose different things and whatever the case may be for someone making that statement, the reality is that not one of us can go back and redo it. But you know what we can do? Is we can give counsel to those that God would enable us to be instructors to, and we can give them counsel with regard to the decisions in life. I won't ask you to raise your hand this morning, but I think each of us, if we're honest, we would, but there have been some times in our lives that we made some bad decisions. We made some foolish decisions. And we said, man, what was I thinking and then maybe we say, I wasn't thinking and that's why I made that decision. And we make some bad decisions. And so what do we do with that? Well, we should learn from that, but then we also are able to equip others and to help them understand, listen, there's some decisions that you're going to face in life. One of the goals that Holly and I have had with raising our children is to seek to equip them for life. Listen, I don't want to take care of my kids for life. Hallelujah. I don't. I don't want to have to pay their bills. I don't want to take care. No, I want to raise them and I want to have them equipped for life. It doesn't mean that they might not fall on hard times and they might need some assistance, a phone call or this or that, whatever. But the reality is that the goal of an instructor is to say, hey, I want to give you, I want to impart to you that which you would need for life. The vision of the instructor. Let me note this. Not only the vision of the instructor, but I would say number two, I want you to note the value of instruction. The value of instruction. We see the vision of the instructor, but then we must note the value of instruction. We will not take the time to read the entirety of Proverbs 31, but I would say to you that that which is contained within Proverbs 31 is valuable. Why? Because it's God's Word and all of God's Word is valuable and we find that God's Word is to be cherished. God's Word is to be reverenced. God's Word is to be obeyed and to be followed and we find this morning when we're speaking within the context here of the instruction that has been provided, we must recognize and note the value of instruction. At times, I would say that it is unfortunate, but at times, we and others fail to recognize the value of instruction, especially in the moment. In the moment when the instruction is being provided, there are times in which we do not recognize the value of that instruction. And then all of a sudden, there's something that happens in life and you say, you know, I think I remember somebody talking about this before and maybe I wish I would have paid more attention. I wish I would have been more attuned to what was going on and we may be at the time the instruction is being provided, we did not recognize the value of instruction. But I would say that that's unfortunate and we must this morning, as those that would receive instruction, not only those that would give instruction, but we all are recipients of instruction in life, we must recognize the value. We mentioned this in the previous point, but typically, the instructor has something that has qualified them to be in that position of instructing and therefore, they would have value to give to those that they're instructing. If I desire to learn something new, I've used this before, but if I desire to learn something new that I've not done before and I'm going to seek out an instructor for that particular discipline or that particular thing that I want to learn, I want to find somebody that is qualified to provide instruction. You might go through a process, maybe an interview type process, and say, let me know, what are your qualifications for instructing me in this thing? And when they look at you and they can't give you anything of substance, you say, well, I think I'm going to keep on looking for someone who is more qualified. This morning, we think about the value of instruction and we understand it and we use the context this morning of the instruction that God provides to us in His Word. I'm so thankful this morning for God's Word and the instruction that is given. All scripture is given by inspiration of God. The Bible says that it's profitable not only for doctrine, for reproof, for correction, for instruction in righteousness. And verse number 17 says that the man of God might be throughly furnished unto all good works. I'm thankful for the instruction that God has given in His Word. When we begin to think about the value of instruction... this morning and I believe that if each of us would understand the value of instruction we would respond in a different manner. How many of you ever had you're trying to give instruction to your children maybe you just pause and say are you listening to me? That ever happen to you? Maybe you're instructing in some other context and you you are giving some level of instruction and you say you guys aren't listening to me are you? I remember my dad when he was teaching when I was in high school he was teaching our teen class in our church in Nevada and he's a Marine and so you got to kind of take that into context of what's going on there and he was active duty at the time and he constantly was dealing with Marines and certain things he he was he was in the Marine Corps in a different era I'll put it that way and so my dad had the idea that when he was instructing if you weren't paying attention he just throw stuff at you I mean honestly and so what was it that he would throw well he'd have a dry erase board that he was writing on and so dry erase markers would fly in the classroom often it would why because you're not paying attention but if we understand this morning the value of instruction then we'll respond in a certain way let me give you a few thoughts from the book of Proverbs here we'll look at a couple other chapter or other portions of scripture as well but I want you to think about our response to instruction when we know the value of instruction will respond notice in Proverbs 4 and verse number 1 the first way that will respond is that we will hear instruction we'll hear instruction we'll have a desire to hear the instruction why because we understand the value of instruction it's interesting today we're living in a time unfortunately in our society where there is a just a shift in the dynamics of the respect that a younger generation has for an older generation I'm sure that you've witnessed that and you've seen that in our society it used to be that a younger generation had a great level of respect for an older generation because they recognize that there was something that that older generation had to offer the next generation but in our society today it seems as if there are many that have the idea that we really don't need the older generation and that's unfortunate I am in a stage in my life where no longer am I the youngest preacher when I go to a preacher's meeting for a number of years I was always the youngest guy there and not so much the case anymore and that's a good thing because there's some younger preachers that are out there but the reality is that even in those early days and still to this day I go to a preacher's fellowship and I want to talk to some older pastors and I want to try to learn something from them they've experienced some things in their ministries and in their lives and this past Tuesday I was at a pastor's meeting and some of the guys and I talked to a bunch of people that were there and I went over and I spoke to one pastor he's 80-something years old he just retired for the second time and I want to try to get something from him and we think this morning of this idea there's a value in instruction so I want to hear instruction what can I how can I benefit from the instruction that is being provided notice in chapter four and verse number one of the book of Proverbs it says hear ye children the instruction of a father and attend to know understanding why why does he say that will notice verse number two for I give you good doctrine forsaking not my law we understand that Proverbs here as we think about the the book of Proverbs in a whole and Solomon speaking to his son Rehoboam but we understand in a very real sense that God is speaking to us as his children and he says to us here here instruction God's instruction is good instruction it's valuable it is profitable for us and when I understand and I know the value of instruction that I want to hear it not only do I hear it but number two I'd say this I want to receive it notice over in Proverbs chapter number 19 you know there's something different between hearing and receiving would you agree with that this morning there's something different between hearing and receiving I can hear somebody but am I receiving the instruction I believe that the thought of receiving instruction is not only the hearing of it but the applying of it that I'm going to put into practice that which is being imparted again it's not just you know are you listening to me yeah I'm hearing you no no no but you you then watch the behavior you know the the decisions that are being made in you're saying no no no you're not hearing me and really what's happening is it's not that they're not hearing you they're not receiving it they're not receiving it notice what the Bible says in Proverbs 19 and verse number 20 hear counsel and receive instruction that thou mayest be wise in thy latter end receive instruction you know as we think about this truth of receiving instruction it's sad that there are many times that instruction is not received it's not that instruction is not given it's that instruction is not received now there's a problem when instruction is not given and again that's for another conversation but this morning when instruction is being given when we know in Proverbs 31 the truth that his mother taught him instruction actively was being given was being provided the D the the the importance is that that instruction is being received there are times in which instruction is rejected despised listen to this indictment you don't need to turn there I'll read it for you but in Jeremiah 32 and in verse number 33 God gives an indictment to Judah with regard to their response the receiving of instruction by the way God was faithful to give the nation of Israel and the nation of Judah instruction God was gracious and long-suffering and he kept raising up prophets and sending prophets to deliver the message of God from God to his people but we know that in Jeremiah 32 in verse number 33 the Bible says of them and they have turned unto me the back and not the face can you see the imagery I mean if you're talking to someone you want them to look at you you want them to face you can you imagine if you're giving instruction to somebody and they turn their back on you that's just rude and God says and they have turned into the back and not the face though I taught them rising up early and teaching them yet they have not harkened to receive instruction I would submit to you that that's frustrating as an instructor is it not you're trying to give instruction you're trying to teach you're trying to impart truth you're trying to equip for the future you're aware of the fact that there are some cautions that you want to give because there are dangers in life you're aware of the fact that you want to give some counsel because there are some decisions in life and yet they're not taking heed this morning I believe that when we understand the value of instruction that not only will we hear instruction but we will receive instruction we'll receive that which is being imparted and then I would say this and I love the the the verse of Scripture the way it says look over at Proverbs chapter number 12 and verse number 1 I would say that we then as I hear instruction and receive instruction I'm going to love instruction love instruction in Proverbs chapter number 12 in verse number 1 the Bible speaks about this subject of instruction and it says whoso loveth instruction loveth knowledge but he that hateth reproof is brutish I think about that first statement of Proverbs 12 and verse number 1 whoso loveth instruction loveth knowledge I desire to receive that instruction I understand the value of instruction and so therefore I develop a love for instruction and I would submit to you that this is really kind of a cycle if you will then as I love instruction then I'm going to hear it and I'm gonna receive it and then my love for instruction is going to increase and therefore I'm going to hear it and I'm going to receive it and I'm gonna love it more why because I understand the value of it God's Word is full of valuable instruction and I would say this God's Word is full of valuable instruction for every aspect of life God's Word has the answer we begin to think about the the the importance this morning of recognizing the value of instruction so that I would respond to that instruction by hearing it and receiving it and loving it that I would apply it in my life that I would be a doer of the Word and not a hearer only how many times people have forsaken they have despised instruction they've suffered greatly for it. The Bible says the way of the transgressor is hard. You know, sometimes it's challenging to watch a child, someone that you've sought to influence and counsel, you've sought to pour your life into to instruct them. Sometimes it's difficult to watch them make decisions that are outside of the counsel, the instruction that you've provided. How many times we'd like to go over and make the decision for them. But you know what you find out in life? You can't really do that. You can't really do that. So what do we, when we understand that truth this morning, we must recognize for most of us that are here in the room this morning, we think about that first point of the message this morning, the vision of the instructor, that we would seek to impart that truth, that we would pray for, that we would seek every opportunity that God would give us to be able to give that instruction. Then when we're on the receiving end, that we'd hear it, we'd receive it, we'd love it. I'm thankful that God would give us instruction. I'm thankful that God would give us instructors in our lives. I hope this morning you can think of some people that God has given you in your life to be an instructor, someone that seeks to impart truth, someone that is faithful and diligent to invest in you. I was speaking with someone just this past week and talked about some of my mentors. And I'm thankful for people that were willing to invest in my life. I'm thankful that basically at any moment I can pick up the phone and there's a few people that I can call and I can know that they're going to pick up the phone and they're going to provide me with some instruction. Because there are times in life that we need instruction, we need that counsel. And I'm thankful that God in His grace and His mercy has not only given us individuals, but He's given us this complete book. You know, how important it is that we face a situation in life, we say, God, would you help me? Would you give me the instruction that I need? I don't, I hope that you recognize in your life there are times that I just don't know what to do. God, I need some instruction. I need some direction. And God said that if we need wisdom, that if we ask Him, He promises to give it. He told us that He's given us all things that pertain unto life and godliness. And so this morning as we think about Mother's Day and we think about this truth of Proverbs chapter 31, and we think about the way in which the proverb begins, and again, most of us this morning are familiar with much of the content, but we see in that very first verse that the Bible says that His mother taught Him. I wonder this morning, in closing, I wonder this morning, if we were to write out some things that our mother taught us, what would they be? Let me ask it this way. What if we had our children write out some things that they would say, here's what my mother taught me? We find within the context of Proverbs 31 that the instructor is the mother, but as I said, many of us can have that title as instructor. And so I wonder this morning, if we make it broader this morning, if we'd say of those that God has given you the opportunity to have an influence in their lives, if they were given the task of sitting down and writing out what has this instructor, what have they taught you? What would the content be? Would there be anything of substance, of value? Would you be able to look at it and say, man, I didn't even realize I was teaching all those lessons. I'm so thankful they were getting that. They were grasping that which I was seeking to impart to them. This morning, we see the vision of the instructor. I hope this morning, I know our kids are, Holly and I, our children are getting older, 16, 18, 20. I mean, many of you have children that are older than that. But I understand that sometimes when they're, you know, this big and it's just busy and so many things and we can just get overwhelmed, when is this stage going to be over? It's hard. Have vision to know that you're instructing them. You're seeking to impart and to equip, to caution and to counsel. Why? Because by God's grace, they're going to grow up. They're going to face a lot of things in life and they need your instruction. Have some vision about your instruction. And then for all of us this morning, I hope that we'd understand the value of instruction. I say, man, I want to hear it and receive it and love it and just continue in that cycle because I understand that God has given me instruction and it is good for me. It is valuable. I never want to be in a place where it's said of Judah there in the book of Jeremiah that they hearken not to receive instruction. I don't want to be in that place. God's given us his word. This morning, we must receive the instruction. Let's pray together. Father, we love you. We thank you so much for loving us. We thank you for the privilege of being able to gather together this morning. We thank you for your word. We thank you for the truth of your word. We thank you for this day, Mother's Day. As we think about this truth in Proverbs 31, what great content is provided to us there in that portion of scripture as we just focus primarily in the beginning portion to think about the vision of the instructor, the value of instruction. God, I pray this morning that you would help us. I pray that you would work in hearts and lives as only you can. Help us to have a vision for those that you've given us the opportunity to instruct and help us to have the proper value placed upon the instruction that we'd receive. Help us, Lord. I pray that in this few moments of invitation, before we have the baby dedication, Lord, I pray that you would move and work in hearts and lives as only you can. I pray that in these few moments of invitation that decisions would be made that would please thee. Maybe there's some that this morning, if they'd be honest, they've not received instruction. Maybe they've hardened their heart. Maybe they've resisted, despised instruction. Oh, God, I pray that you'd help them to get that right. I pray that we would love instruction, hear it and receive it, apply it in our lives. I pray that you'd move and work as only you can. For it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.28000020980835,
      "text": " that President at that time Woodrow Wilson issued a presidential proclamation"
    },
    {
      "id": 1,
      "start": 5.28000020980835,
      "end": 11.520000457763672,
      "text": " that officially established the first National Mother's Day holiday to celebrate America's"
    },
    {
      "id": 2,
      "start": 11.520000457763672,
      "end": 17.68000030517578,
      "text": " mothers. We understand that prior to that official date there are many states that already celebrate"
    },
    {
      "id": 3,
      "start": 17.68000030517578,
      "end": 22.079999923706055,
      "text": " it and they kind of had their own time of celebrating and recognizing but this was the"
    },
    {
      "id": 4,
      "start": 22.079999923706055,
      "end": 28.079999923706055,
      "text": " first National Mother's Day. The idea for Mother's Day is credited by some to a lady by the name of"
    },
    {
      "id": 5,
      "start": 28.079999923706055,
      "end": 36.560001373291016,
      "text": " Julia Ward Howe which was in 1872 and by others to Anna Jarvis 1907. Most would give the credit"
    },
    {
      "id": 6,
      "start": 36.560001373291016,
      "end": 43.599998474121094,
      "text": " to Anna Jarvis for all of her hard work on sent thousands of letters and lobbied and petitioned"
    },
    {
      "id": 7,
      "start": 43.599998474121094,
      "end": 48.08000183105469,
      "text": " and what have you but they both both of these ladies suggested a holiday dedicated to a day"
    },
    {
      "id": 8,
      "start": 48.08000183105469,
      "end": 54.2400016784668,
      "text": " of peace. Many individual states as I mentioned a moment ago celebrated Mother's Day by 1911 but it"
    },
    {
      "id": 9,
      "start": 54.2400016784668,
      "end": 60.560001373291016,
      "text": " was not until President Wilson lobbied Congress in 1914 that Mother's Day was officially set on"
    },
    {
      "id": 10,
      "start": 60.560001373291016,
      "end": 66.31999969482422,
      "text": " the second Sunday of every May. In his first Mother's Day proclamation Wilson stated that"
    },
    {
      "id": 11,
      "start": 66.31999969482422,
      "end": 72.23999786376953,
      "text": " the holiday offered an opportunity to publicly express our love and reverence for the mothers"
    },
    {
      "id": 12,
      "start": 72.80000305175781,
      "end": 80.08000183105469,
      "text": " of our country and I'm thankful that we have this date on our calendar and there was a joke going"
    },
    {
      "id": 13,
      "start": 80.08000183105469,
      "end": 84.55999755859375,
      "text": " around about whether or not you know the the mothers have a Mother's Day fathers have Father's"
    },
    {
      "id": 14,
      "start": 84.55999755859375,
      "end": 90.63999938964844,
      "text": " Day but what about Kids Day and so that's just every day and but the the reality is that I'm"
    },
    {
      "id": 15,
      "start": 90.63999938964844,
      "end": 96.23999786376953,
      "text": " thankful that on our calendar that every year we have Mother's Day and I sent a note to my mom this"
    },
    {
      "id": 16,
      "start": 96.23999786376953,
      "end": 101.04000091552734,
      "text": " morning it's the first year in a number of years that she's not been in our presence. In fact I"
    },
    {
      "id": 17,
      "start": 101.04000091552734,
      "end": 105.91999816894531,
      "text": " was sharing with Holly and the kids last night that last year on Mother's Day both my mom and"
    },
    {
      "id": 18,
      "start": 106.0,
      "end": 110.87999725341797,
      "text": " Holly's mom were in attendance for Mother's Day service they were both in town and so we certainly"
    },
    {
      "id": 19,
      "start": 110.87999725341797,
      "end": 116.0,
      "text": " appreciate that opportunity so I sent both of them text messages this morning and I hope that if your"
    },
    {
      "id": 20,
      "start": 116.0,
      "end": 122.23999786376953,
      "text": " mom is still living that you have sought to make it a special day for her. Many of us are familiar"
    },
    {
      "id": 21,
      "start": 122.23999786376953,
      "end": 127.36000061035156,
      "text": " with this passage of scripture here in Proverbs chapter 31 the content of this passage and the"
    },
    {
      "id": 22,
      "start": 127.36000061035156,
      "end": 135.0399932861328,
      "text": " virtuous woman verse one however of this familiar chapter provides us with some very important"
    },
    {
      "id": 23,
      "start": 135.0399932861328,
      "end": 141.75999450683594,
      "text": " information notice in Proverbs 31 and verse number one the Bible says this the words of King"
    },
    {
      "id": 24,
      "start": 141.75999450683594,
      "end": 151.0399932861328,
      "text": " Lemuel the prophecy that his mother taught him that his mother taught him I've titled the message"
    },
    {
      "id": 25,
      "start": 151.0399932861328,
      "end": 157.75999450683594,
      "text": " this morning his mother taught him think about the words of this single verse of scripture and"
    },
    {
      "id": 26,
      "start": 157.75999450683594,
      "end": 163.52000427246094,
      "text": " the significance of it in fact there's been much debate over the centuries as to who this King"
    },
    {
      "id": 27,
      "start": 163.52000427246094,
      "end": 170.39999389648438,
      "text": " Lemuel actually is and we don't have any other reference with any of the kings or chronicles"
    },
    {
      "id": 28,
      "start": 171.0399932861328,
      "end": 176.9600067138672,
      "text": " that would provide us with a name of King Lemuel and so through the series of debate"
    },
    {
      "id": 29,
      "start": 177.75999450683594,
      "end": 185.75999450683594,
      "text": " over the centuries there have been a number of people that have suggested that Lemuel was a name"
    },
    {
      "id": 30,
      "start": 185.75999450683594,
      "end": 192.55999755859375,
      "text": " for Solomon that Bathsheba used specifically for him whether that's the case or not the Bible"
    },
    {
      "id": 31,
      "start": 192.55999755859375,
      "end": 200.8000030517578,
      "text": " doesn't tell us but we do know that the name Lemuel means for God or belonging to God and it"
    },
    {
      "id": 32,
      "start": 200.8000030517578,
      "end": 205.9199981689453,
      "text": " would be as you look at the text of scripture and understand all that's giving all the instruction"
    },
    {
      "id": 33,
      "start": 205.9199981689453,
      "end": 212.47999572753906,
      "text": " that's that's provided here it could possibly be that it's Bathsheba who is the mother of Solomon"
    },
    {
      "id": 34,
      "start": 212.47999572753906,
      "end": 218.9600067138672,
      "text": " that she had for her son this name Lemuel whether that's the case or not it's not really to be"
    },
    {
      "id": 35,
      "start": 218.9600067138672,
      "end": 224.72000122070312,
      "text": " debated we find that the text does tell us however that this prophecy that is recorded in"
    },
    {
      "id": 36,
      "start": 224.72000122070312,
      "end": 230.8800048828125,
      "text": " this portion of scripture it is the prophecy that his mother taught him we're going to think about"
    },
    {
      "id": 37,
      "start": 230.8800048828125,
      "end": 236.32000732421875,
      "text": " this prophecy and thinking about that which is provided here I would simply say that this which"
    },
    {
      "id": 38,
      "start": 236.32000732421875,
      "end": 241.67999267578125,
      "text": " his mother taught him there's instruction that is being given begin to think about instruction it"
    },
    {
      "id": 39,
      "start": 241.67999267578125,
      "end": 248.55999755859375,
      "text": " continues and notice in verse 2 what my son and what the son of my womb and what the son of my"
    },
    {
      "id": 40,
      "start": 248.55999755859375,
      "end": 256.79998779296875,
      "text": " vows give not thy strength unto women nor thy ways to that which destroyeth kings it is not"
    },
    {
      "id": 41,
      "start": 256.79998779296875,
      "end": 264.0,
      "text": " for kings oh Lemuel it is not for kings to drink wine nor for princes strong drink lest they drink"
    },
    {
      "id": 42,
      "start": 264.0,
      "end": 269.6000061035156,
      "text": " and forget the law and pervert the judgment of any of the afflicted give strong drink unto him that"
    },
    {
      "id": 43,
      "start": 269.6000061035156,
      "end": 275.67999267578125,
      "text": " is ready to perish or die and wine unto those that be of a heavy heart let him drink and forget"
    },
    {
      "id": 44,
      "start": 275.67999267578125,
      "end": 281.760009765625,
      "text": " his poverty and remember his misery no more open thy mouth for the dumb and the cause of all such"
    },
    {
      "id": 45,
      "start": 281.760009765625,
      "end": 289.8399963378906,
      "text": " as are appointed to destruction open thy mouth judge righteously and plead the cause of the poor"
    },
    {
      "id": 46,
      "start": 289.8399963378906,
      "end": 296.9599914550781,
      "text": " and needy in verse number 10 the bible says who can find a virtuous woman for her price is far"
    },
    {
      "id": 47,
      "start": 297.6000061035156,
      "end": 302.79998779296875,
      "text": " above rubies and as you continue through the next several verses you'll find that there's much"
    },
    {
      "id": 48,
      "start": 302.79998779296875,
      "end": 308.55999755859375,
      "text": " information given with regard to the virtuous woman and maybe we would say a description"
    },
    {
      "id": 49,
      "start": 309.2799987792969,
      "end": 314.0,
      "text": " of that virtuous woman but i'm going to think about this text of scripture this morning"
    },
    {
      "id": 50,
      "start": 314.79998779296875,
      "end": 319.760009765625,
      "text": " and as i was meditating and preparing throughout the week that statement in verse number one really"
    },
    {
      "id": 51,
      "start": 319.760009765625,
      "end": 325.5199890136719,
      "text": " caught my attention that his mother taught him if you're taking notes this morning i want you to"
    },
    {
      "id": 52,
      "start": 325.5199890136719,
      "end": 332.8800048828125,
      "text": " consider first of all with me i want you to note the vision of the instructor the vision of the"
    },
    {
      "id": 53,
      "start": 332.8800048828125,
      "end": 338.9599914550781,
      "text": " instructor now we're not speaking about their physical vision but i begin to think about here"
    },
    {
      "id": 54,
      "start": 338.9599914550781,
      "end": 345.67999267578125,
      "text": " in our text of scripture we understand that the instructor is the mother of this king lemuel the"
    },
    {
      "id": 55,
      "start": 345.67999267578125,
      "end": 352.32000732421875,
      "text": " bible says very clearly that his mother taught him she's instructing her son and we find that"
    },
    {
      "id": 56,
      "start": 352.32000732421875,
      "end": 360.239990234375,
      "text": " she's providing counsel instruction with regard to life this morning we acknowledge however the"
    },
    {
      "id": 57,
      "start": 360.239990234375,
      "end": 367.3599853515625,
      "text": " reality that many can carry the title of instructor within the text of scripture we find that it's the"
    },
    {
      "id": 58,
      "start": 367.3599853515625,
      "end": 373.0400085449219,
      "text": " mother of king lemuel but the reality is that there are many today that carry the title of"
    },
    {
      "id": 59,
      "start": 373.0400085449219,
      "end": 379.3599853515625,
      "text": " instructor in fact many times as we go through life perhaps we would even have for a period of"
    },
    {
      "id": 60,
      "start": 379.3599853515625,
      "end": 385.760009765625,
      "text": " time maybe for a long period of time that title ascribed to us that we are an instructor that we"
    },
    {
      "id": 61,
      "start": 385.760009765625,
      "end": 392.0,
      "text": " are one that is giving information seeking to equip others begin to think about an instructor"
    },
    {
      "id": 62,
      "start": 392.0,
      "end": 397.0400085449219,
      "text": " and thinking about the vision of an instructor and thinking here of this text of scripture and"
    },
    {
      "id": 63,
      "start": 397.9200134277344,
      "end": 403.3599853515625,
      "text": " the vision of the mother of king lemuel and begin to think about an instructor i would say this an"
    },
    {
      "id": 64,
      "start": 403.3599853515625,
      "end": 410.7200012207031,
      "text": " instructor has a desire to impart truth an instructor has a desire to impart truth"
    },
    {
      "id": 65,
      "start": 410.7200012207031,
      "end": 416.9599914550781,
      "text": " begin to think about the vision of an instructor and noticing here in the text of scripture how"
    },
    {
      "id": 66,
      "start": 416.9599914550781,
      "end": 425.20001220703125,
      "text": " that the mother of this king lemuel she desires to impart truth to her son an instructor should"
    },
    {
      "id": 67,
      "start": 425.20001220703125,
      "end": 429.760009765625,
      "text": " have that desire if they don't have a desire to impart truth they shouldn't be an instructor they"
    },
    {
      "id": 68,
      "start": 429.760009765625,
      "end": 436.4800109863281,
      "text": " have no business being in that line of work but we find that truth is vital truth is absolutely"
    },
    {
      "id": 69,
      "start": 436.4800109863281,
      "end": 440.9599914550781,
      "text": " vital as we get to think about the instruction that is provided here and we know this is the"
    },
    {
      "id": 70,
      "start": 440.9599914550781,
      "end": 446.7200012207031,
      "text": " word of god and we understand this morning that god said uh the lord jesus christ in john 17"
    },
    {
      "id": 71,
      "start": 447.2799987792969,
      "end": 455.1199951171875,
      "text": " sanctify them through thy word thy word is truth jesus said of himself i am the way the truth"
    },
    {
      "id": 72,
      "start": 455.1199951171875,
      "end": 461.9200134277344,
      "text": " and the life no man cometh unto the father but by me i am thankful this morning for truth"
    },
    {
      "id": 73,
      "start": 461.9200134277344,
      "end": 466.239990234375,
      "text": " you understand this morning that truth is under attack you understand this morning that it seems"
    },
    {
      "id": 74,
      "start": 466.239990234375,
      "end": 472.0799865722656,
      "text": " as if there are people within our society uh that are seeking to influence the next generation and"
    },
    {
      "id": 75,
      "start": 472.0799865722656,
      "end": 477.0400085449219,
      "text": " in fact if we'd be honest this morning they're having a measure of success on influencing the"
    },
    {
      "id": 76,
      "start": 477.0400085449219,
      "end": 482.0799865722656,
      "text": " next generation and they have this idea that truth is relative it can be your truth or"
    },
    {
      "id": 77,
      "start": 482.0799865722656,
      "end": 487.5199890136719,
      "text": " my truth or their truth but the reality this morning is that we are thankful that we have"
    },
    {
      "id": 78,
      "start": 487.5199890136719,
      "end": 493.9200134277344,
      "text": " god's truth and god has given us truth this morning i begin to think about an instructor"
    },
    {
      "id": 79,
      "start": 493.9200134277344,
      "end": 501.3599853515625,
      "text": " and their desire to impart truth and we see that here uh in the the instruction of proverbs chapter"
    },
    {
      "id": 80,
      "start": 501.3599853515625,
      "end": 506.32000732421875,
      "text": " 31 i would say this an instructor not only has a desire to impart truth but i would say this an"
    },
    {
      "id": 81,
      "start": 506.32000732421875,
      "end": 516.0800170898438,
      "text": " instructor seeks to equip for the future an instructor seeks to equip for the future i think"
    },
    {
      "id": 82,
      "start": 516.0800170898438,
      "end": 521.760009765625,
      "text": " about this passage of scripture and as you begin to study through proverbs chapter 31 it would seem"
    },
    {
      "id": 83,
      "start": 521.760009765625,
      "end": 528.4000244140625,
      "text": " as if lemuel was receiving this instruction at a young age he was being taught things that would"
    },
    {
      "id": 84,
      "start": 528.4000244140625,
      "end": 535.5999755859375,
      "text": " be pertinent to his future things that may not be applied immediately in his life but the vision of"
    },
    {
      "id": 85,
      "start": 535.5999755859375,
      "end": 542.1599731445312,
      "text": " the instructor is that they know they're aware of some things that are going to happen in the future"
    },
    {
      "id": 86,
      "start": 542.1599731445312,
      "end": 547.4400024414062,
      "text": " with regard to life and living and circumstances and so on and so forth and so what is the"
    },
    {
      "id": 87,
      "start": 547.4400024414062,
      "end": 553.9199829101562,
      "text": " instructor seeking to do well the instructor is seeking to equip the student for the future"
    },
    {
      "id": 88,
      "start": 554.47998046875,
      "end": 557.6799926757812,
      "text": " you know it's interesting you think about instruction maybe some classes that you've"
    },
    {
      "id": 89,
      "start": 557.6799926757812,
      "end": 561.760009765625,
      "text": " gone to and there are some classes that i've been to over the years and you kind of"
    },
    {
      "id": 90,
      "start": 562.4000244140625,
      "end": 567.52001953125,
      "text": " at you know particular classes and what they might be you say i hope i really never have to use"
    },
    {
      "id": 91,
      "start": 568.239990234375,
      "end": 576.239990234375,
      "text": " this which i am being taught but we receive that instruction for the event that may come to pass"
    },
    {
      "id": 92,
      "start": 576.239990234375,
      "end": 584.4000244140625,
      "text": " and we want to be equipped for that king lemuel uh is going to eventually as you look at the content"
    },
    {
      "id": 93,
      "start": 584.4000244140625,
      "end": 590.3200073242188,
      "text": " of verse 10 and following and you think about the virtuous woman and uh the the wife and the capable"
    },
    {
      "id": 94,
      "start": 590.3200073242188,
      "end": 594.3200073242188,
      "text": " wife if you will and you begin to look at that portion of scripture and you think how"
    },
    {
      "id": 95,
      "start": 594.3200073242188,
      "end": 599.760009765625,
      "text": " uh the the mother of king lemuel is seeking to to equip her son"
    },
    {
      "id": 0,
      "start": 599.760009765625,
      "end": 607.760009765625,
      "text": " for a future decision, a decision that is so important in life, the person to whom you"
    },
    {
      "id": 1,
      "start": 607.760009765625,
      "end": 614.3200101852417,
      "text": " will marry. Now we understand if it is the case that Lemuel is Solomon, he did not heed"
    },
    {
      "id": 2,
      "start": 614.3200101852417,
      "end": 619.2800102233887,
      "text": " much of the instruction that is provided or contained within this portion of Scripture,"
    },
    {
      "id": 3,
      "start": 619.2800102233887,
      "end": 623.3600101470947,
      "text": " we'll save that for another time. But we find that as we think about the vision of"
    },
    {
      "id": 4,
      "start": 623.3600101470947,
      "end": 628.0000095367432,
      "text": " the instructor, they desire to impart truth, they seek to equip for the future, we find"
    },
    {
      "id": 5,
      "start": 628.0000095367432,
      "end": 633.8800086975098,
      "text": " here that the truth of the instructor here with regard to the vision of instructor, there"
    },
    {
      "id": 6,
      "start": 633.8800086975098,
      "end": 642.4800109863281,
      "text": " are cautions that are given regarding the dangers of life. This morning, we celebrate"
    },
    {
      "id": 7,
      "start": 642.4800109863281,
      "end": 648.8000106811523,
      "text": " Mother's Day, we think about instructors, and some, that which would qualify an instructor"
    },
    {
      "id": 8,
      "start": 648.8000106811523,
      "end": 654.6400108337402,
      "text": " is sometimes the experience that they've had in life. And as they have experienced life,"
    },
    {
      "id": 9,
      "start": 654.6400108337402,
      "end": 660.9200096130371,
      "text": " I think about parenthood, I remember saying to Juliana on more than one occasion, I was"
    },
    {
      "id": 10,
      "start": 660.9200096130371,
      "end": 665.6800079345703,
      "text": " 16 before, so I understand. I was this age before, so I understand. And there's certain"
    },
    {
      "id": 11,
      "start": 665.6800079345703,
      "end": 669.9600067138672,
      "text": " things that we understand. I use Juliana as the example because she's our oldest, and"
    },
    {
      "id": 12,
      "start": 669.9600067138672,
      "end": 676.0800094604492,
      "text": " I would say those things to her, and the reality is that God has given us an opportunity and"
    },
    {
      "id": 13,
      "start": 676.0800094604492,
      "end": 683.8400115966797,
      "text": " we then as instructors are seeking to provide caution regarding the dangers of life. You"
    },
    {
      "id": 14,
      "start": 683.8400115966797,
      "end": 689.1600112915039,
      "text": " know, it's quite heartbreaking for an instructor that has given a caution when they see the"
    },
    {
      "id": 15,
      "start": 689.1600112915039,
      "end": 696.2800064086914,
      "text": " student, that individual that they've instructed, not give heed to the caution. We can't make"
    },
    {
      "id": 16,
      "start": 696.2800064086914,
      "end": 701.7200088500977,
      "text": " them give heed to the caution, but when I think about the vision of the instructor that"
    },
    {
      "id": 17,
      "start": 701.7200088500977,
      "end": 709.9200134277344,
      "text": " the vision, there's caution that is provided. There are dangers in life, many of them. The"
    },
    {
      "id": 18,
      "start": 709.9200134277344,
      "end": 714.4800109863281,
      "text": " reality is you think about these young kids that just stood up here and sang and how precious"
    },
    {
      "id": 19,
      "start": 714.4800109863281,
      "end": 719.2000122070312,
      "text": " that was, there are some dangers that they're going to face in life, and they need some"
    },
    {
      "id": 20,
      "start": 719.2000122070312,
      "end": 722.6000061035156,
      "text": " moms that are going to instruct them, that are going to teach them, that are going to"
    },
    {
      "id": 21,
      "start": 722.6000061035156,
      "end": 731.3200073242188,
      "text": " warn them, caution them with regard to those dangers. You think about signs in life and"
    },
    {
      "id": 22,
      "start": 731.3200073242188,
      "end": 739.2000122070312,
      "text": " you think about those signs that say warning, caution, danger ahead. I read a report just"
    },
    {
      "id": 23,
      "start": 739.2000122070312,
      "end": 744.9200134277344,
      "text": " the other day that some tourist was traveling. I did not catch where they were traveling,"
    },
    {
      "id": 24,
      "start": 744.9200134277344,
      "end": 750.0400085449219,
      "text": " but they were following the GPS and they turned directly into a boat ramp marina and ended"
    },
    {
      "id": 25,
      "start": 750.0400085449219,
      "end": 756.2400054931641,
      "text": " up with their van, their minivan in the water. How many of you saw that in the news? The"
    },
    {
      "id": 26,
      "start": 756.2400054931641,
      "end": 762.2800140380859,
      "text": " reality is that you follow the GPS, but you've got to have a little sense as well. The reality"
    },
    {
      "id": 27,
      "start": 762.2800140380859,
      "end": 766.0800170898438,
      "text": " is that literally people are jumping in the water to try to help them get out and the"
    },
    {
      "id": 28,
      "start": 766.0800170898438,
      "end": 770.0000152587891,
      "text": " van's just kind of floating and that's, I don't know what you tell your insurance at"
    },
    {
      "id": 29,
      "start": 770.0000152587891,
      "end": 777.1200103759766,
      "text": " that point, but I was following the GPS. And the reality is that in life there's dangers."
    },
    {
      "id": 30,
      "start": 777.1200103759766,
      "end": 784.9200134277344,
      "text": " There's danger. And as an instructor with vision, we seek to give caution regarding"
    },
    {
      "id": 31,
      "start": 784.9200134277344,
      "end": 792.5600128173828,
      "text": " the dangers of life. We find that there are dangers, no doubt the book of Proverbs particularly"
    },
    {
      "id": 32,
      "start": 792.6000061035156,
      "end": 798.4000091552734,
      "text": " speaks often about the strange woman. And we find that those, those warnings are provided"
    },
    {
      "id": 33,
      "start": 798.4000091552734,
      "end": 802.6000061035156,
      "text": " and you see some instruction that's provided even here. You see the warning that is given"
    },
    {
      "id": 34,
      "start": 802.6000061035156,
      "end": 809.8800048828125,
      "text": " with regard to alcoholic beverage there in verses 4 and 5 to King Lemuel. And we find"
    },
    {
      "id": 35,
      "start": 809.8800048828125,
      "end": 817.0000152587891,
      "text": " that the warning is being provided, the caution about the dangers of life. I would say that"
    },
    {
      "id": 36,
      "start": 817.0000152587891,
      "end": 823.3600158691406,
      "text": " the instructor not only gives caution regarding the dangers of life, but the instructor gives"
    },
    {
      "id": 37,
      "start": 823.3600158691406,
      "end": 831.3600158691406,
      "text": " counsel regarding the decisions in life. You know decisions, we make decisions every day."
    },
    {
      "id": 38,
      "start": 831.3600158691406,
      "end": 837.5200042724609,
      "text": " We really do. Every day we make decisions. Some decisions are harder than other decisions."
    },
    {
      "id": 39,
      "start": 837.5200042724609,
      "end": 841.8000030517578,
      "text": " Would you agree this morning? And there are decisions that we make in life and especially"
    },
    {
      "id": 40,
      "start": 841.8000030517578,
      "end": 845.9000091552734,
      "text": " when you think about young people and you think about being the role of an instructor"
    },
    {
      "id": 41,
      "start": 845.9000091552734,
      "end": 851.0200042724609,
      "text": " and hear the vision of the instructor, the vision of the instructor is to know, to have"
    },
    {
      "id": 42,
      "start": 851.0200042724609,
      "end": 856.5,
      "text": " an awareness that there are decisions in life that these individuals need to make and I'm"
    },
    {
      "id": 43,
      "start": 856.5,
      "end": 863.1400146484375,
      "text": " seeking to provide them counsel with regard to those decisions. The Bible speaks much"
    },
    {
      "id": 44,
      "start": 863.1400146484375,
      "end": 870.52001953125,
      "text": " about counsel and the importance of receiving counsel, that there's safety in the multitude"
    },
    {
      "id": 45,
      "start": 870.52001953125,
      "end": 876.7200012207031,
      "text": " of counselors is what God's Word says. And we find this morning that the instructor,"
    },
    {
      "id": 46,
      "start": 876.7200012207031,
      "end": 883.52001953125,
      "text": " the vision of the instructor is to see beyond the immediate and to seek to impart truth"
    },
    {
      "id": 47,
      "start": 883.52001953125,
      "end": 889.9600219726562,
      "text": " and to equip for the future, to provide caution with regard to the dangers of life, to provide"
    },
    {
      "id": 48,
      "start": 889.9600219726562,
      "end": 896.3200073242188,
      "text": " counsel with regard to the decisions in life. There are times that I've heard people say,"
    },
    {
      "id": 49,
      "start": 897.2000122070312,
      "end": 902.0400085449219,
      "text": " what I do to be 18 again? And I kind of scratch my head and I'm like, do you remember how"
    },
    {
      "id": 50,
      "start": 902.0400085449219,
      "end": 906.1600036621094,
      "text": " hard it was when you were 18 trying to make all those decisions? I mean, there's a lot"
    },
    {
      "id": 51,
      "start": 906.1600036621094,
      "end": 910.2799987792969,
      "text": " of stuff that you're trying to process and go through and some people might make that"
    },
    {
      "id": 52,
      "start": 910.2799987792969,
      "end": 914.7200012207031,
      "text": " statement because they say, well, I'm wiser now and maybe I'd choose different things"
    },
    {
      "id": 53,
      "start": 914.7200012207031,
      "end": 919.9600219726562,
      "text": " and whatever the case may be for someone making that statement, the reality is that not one"
    },
    {
      "id": 54,
      "start": 919.9600219726562,
      "end": 926.8800048828125,
      "text": " of us can go back and redo it. But you know what we can do? Is we can give counsel to"
    },
    {
      "id": 55,
      "start": 926.8800048828125,
      "end": 933.6000061035156,
      "text": " those that God would enable us to be instructors to, and we can give them counsel with regard"
    },
    {
      "id": 56,
      "start": 933.6000061035156,
      "end": 939.0400085449219,
      "text": " to the decisions in life. I won't ask you to raise your hand this morning, but I think"
    },
    {
      "id": 57,
      "start": 939.0400085449219,
      "end": 942.8800048828125,
      "text": " each of us, if we're honest, we would, but there have been some times in our lives that"
    },
    {
      "id": 58,
      "start": 942.8800048828125,
      "end": 949.8800048828125,
      "text": " we made some bad decisions. We made some foolish decisions. And we said, man, what was I thinking"
    },
    {
      "id": 59,
      "start": 950.2799987792969,
      "end": 955.0400085449219,
      "text": " and then maybe we say, I wasn't thinking and that's why I made that decision. And we make"
    },
    {
      "id": 60,
      "start": 955.0400085449219,
      "end": 959.9600219726562,
      "text": " some bad decisions. And so what do we do with that? Well, we should learn from that, but"
    },
    {
      "id": 61,
      "start": 959.9600219726562,
      "end": 964.9200134277344,
      "text": " then we also are able to equip others and to help them understand, listen, there's some"
    },
    {
      "id": 62,
      "start": 964.9200134277344,
      "end": 969.2799987792969,
      "text": " decisions that you're going to face in life. One of the goals that Holly and I have had"
    },
    {
      "id": 63,
      "start": 969.2799987792969,
      "end": 975.6800231933594,
      "text": " with raising our children is to seek to equip them for life. Listen, I don't want to take"
    },
    {
      "id": 64,
      "start": 975.6800231933594,
      "end": 980.1600036621094,
      "text": " care of my kids for life. Hallelujah. I don't. I don't want to have to pay their bills. I"
    },
    {
      "id": 65,
      "start": 980.1600036621094,
      "end": 985.6000061035156,
      "text": " don't want to take care. No, I want to raise them and I want to have them equipped for"
    },
    {
      "id": 66,
      "start": 985.6000061035156,
      "end": 990.8000183105469,
      "text": " life. It doesn't mean that they might not fall on hard times and they might need some"
    },
    {
      "id": 67,
      "start": 990.8000183105469,
      "end": 995.9600219726562,
      "text": " assistance, a phone call or this or that, whatever. But the reality is that the goal"
    },
    {
      "id": 68,
      "start": 995.9600219726562,
      "end": 1000.6199951171875,
      "text": " of an instructor is to say, hey, I want to give you, I want to impart to you that which"
    },
    {
      "id": 69,
      "start": 1000.6199951171875,
      "end": 1007.7000122070312,
      "text": " you would need for life. The vision of the instructor. Let me note this. Not only the"
    },
    {
      "id": 70,
      "start": 1007.7000122070312,
      "end": 1012.7799987792969,
      "text": " vision of the instructor, but I would say number two, I want you to note the value of"
    },
    {
      "id": 71,
      "start": 1012.7799987792969,
      "end": 1018.260009765625,
      "text": " instruction. The value of instruction. We see the vision of the instructor, but then"
    },
    {
      "id": 72,
      "start": 1018.260009765625,
      "end": 1023.4800109863281,
      "text": " we must note the value of instruction. We will not take the time to read the entirety"
    },
    {
      "id": 73,
      "start": 1023.4800109863281,
      "end": 1028.2200012207031,
      "text": " of Proverbs 31, but I would say to you that that which is contained within Proverbs 31"
    },
    {
      "id": 74,
      "start": 1028.2200012207031,
      "end": 1033.6199951171875,
      "text": " is valuable. Why? Because it's God's Word and all of God's Word is valuable and we find"
    },
    {
      "id": 75,
      "start": 1033.6199951171875,
      "end": 1039.1800231933594,
      "text": " that God's Word is to be cherished. God's Word is to be reverenced. God's Word is to"
    },
    {
      "id": 76,
      "start": 1039.1800231933594,
      "end": 1044.3800048828125,
      "text": " be obeyed and to be followed and we find this morning when we're speaking within the context"
    },
    {
      "id": 77,
      "start": 1044.3800048828125,
      "end": 1052.1000061035156,
      "text": " here of the instruction that has been provided, we must recognize and note the value of instruction."
    },
    {
      "id": 78,
      "start": 1052.1000061035156,
      "end": 1060.4200134277344,
      "text": " At times, I would say that it is unfortunate, but at times, we and others fail to recognize"
    },
    {
      "id": 79,
      "start": 1060.4200134277344,
      "end": 1067.7000122070312,
      "text": " the value of instruction, especially in the moment. In the moment when the instruction"
    },
    {
      "id": 80,
      "start": 1067.7000122070312,
      "end": 1074.0599975585938,
      "text": " is being provided, there are times in which we do not recognize the value of that instruction."
    },
    {
      "id": 81,
      "start": 1074.0599975585938,
      "end": 1077.7799987792969,
      "text": " And then all of a sudden, there's something that happens in life and you say, you know,"
    },
    {
      "id": 82,
      "start": 1077.7799987792969,
      "end": 1081.7400207519531,
      "text": " I think I remember somebody talking about this before and maybe I wish I would have"
    },
    {
      "id": 83,
      "start": 1081.7799987792969,
      "end": 1086.9400024414062,
      "text": " paid more attention. I wish I would have been more attuned to what was going on and we may"
    },
    {
      "id": 84,
      "start": 1086.9400024414062,
      "end": 1092.8200073242188,
      "text": " be at the time the instruction is being provided, we did not recognize the value of instruction."
    },
    {
      "id": 85,
      "start": 1092.8200073242188,
      "end": 1097.7400207519531,
      "text": " But I would say that that's unfortunate and we must this morning, as those that would"
    },
    {
      "id": 86,
      "start": 1097.7400207519531,
      "end": 1102.5599975585938,
      "text": " receive instruction, not only those that would give instruction, but we all are recipients"
    },
    {
      "id": 87,
      "start": 1102.5599975585938,
      "end": 1108.3000183105469,
      "text": " of instruction in life, we must recognize the value. We mentioned this in the previous"
    },
    {
      "id": 88,
      "start": 1108.3000183105469,
      "end": 1115.7000122070312,
      "text": " point, but typically, the instructor has something that has qualified them to be in"
    },
    {
      "id": 89,
      "start": 1115.7000122070312,
      "end": 1121.8200073242188,
      "text": " that position of instructing and therefore, they would have value to give to those that"
    },
    {
      "id": 90,
      "start": 1121.8200073242188,
      "end": 1127.8200073242188,
      "text": " they're instructing. If I desire to learn something new, I've used this before, but"
    },
    {
      "id": 91,
      "start": 1127.8200073242188,
      "end": 1132.7000122070312,
      "text": " if I desire to learn something new that I've not done before and I'm going to seek out"
    },
    {
      "id": 92,
      "start": 1132.7000122070312,
      "end": 1138.02001953125,
      "text": " an instructor for that particular discipline or that particular thing that I want to learn,"
    },
    {
      "id": 93,
      "start": 1138.02001953125,
      "end": 1143.5800170898438,
      "text": " I want to find somebody that is qualified to provide instruction. You might go through"
    },
    {
      "id": 94,
      "start": 1143.5800170898438,
      "end": 1149.97998046875,
      "text": " a process, maybe an interview type process, and say, let me know, what are your qualifications"
    },
    {
      "id": 95,
      "start": 1149.97998046875,
      "end": 1155.8599853515625,
      "text": " for instructing me in this thing? And when they look at you and they can't give you anything"
    },
    {
      "id": 96,
      "start": 1155.8599853515625,
      "end": 1160.1000366210938,
      "text": " of substance, you say, well, I think I'm going to keep on looking for someone who is"
    },
    {
      "id": 97,
      "start": 1160.1000366210938,
      "end": 1166.3599853515625,
      "text": " more qualified. This morning, we think about the value of instruction and we understand"
    },
    {
      "id": 98,
      "start": 1166.3599853515625,
      "end": 1171.4000244140625,
      "text": " it and we use the context this morning of the instruction that God provides to us in"
    },
    {
      "id": 99,
      "start": 1171.4000244140625,
      "end": 1177.2000122070312,
      "text": " His Word. I'm so thankful this morning for God's Word and the instruction that is given."
    },
    {
      "id": 100,
      "start": 1177.2000122070312,
      "end": 1181.780029296875,
      "text": " All scripture is given by inspiration of God. The Bible says that it's profitable not only"
    },
    {
      "id": 101,
      "start": 1181.780029296875,
      "end": 1187.47998046875,
      "text": " for doctrine, for reproof, for correction, for instruction in righteousness. And verse"
    },
    {
      "id": 102,
      "start": 1187.47998046875,
      "end": 1193.7200317382812,
      "text": " number 17 says that the man of God might be throughly furnished unto all good works. I'm"
    },
    {
      "id": 103,
      "start": 1193.8400268554688,
      "end": 1198.4400024414062,
      "text": " thankful for the instruction that God has given in His Word. When we begin to think"
    },
    {
      "id": 104,
      "start": 1198.4400024414062,
      "end": 1199.8400268554688,
      "text": " about the value of instruction..."
    },
    {
      "id": 0,
      "start": 1199.8400268554688,
      "end": 1204.9400267601013,
      "text": " this morning and I believe that if each of us would understand the value of"
    },
    {
      "id": 1,
      "start": 1204.9400267601013,
      "end": 1210.7600269317627,
      "text": " instruction we would respond in a different manner. How many of you ever"
    },
    {
      "id": 2,
      "start": 1210.7600269317627,
      "end": 1214.740026473999,
      "text": " had you're trying to give instruction to your children maybe you just pause and"
    },
    {
      "id": 3,
      "start": 1214.740026473999,
      "end": 1219.1800270080566,
      "text": " say are you listening to me? That ever happen to you? Maybe you're instructing"
    },
    {
      "id": 4,
      "start": 1219.1800270080566,
      "end": 1223.7800273895264,
      "text": " in some other context and you you are giving some level of instruction and you"
    },
    {
      "id": 5,
      "start": 1223.7800273895264,
      "end": 1228.2200260162354,
      "text": " say you guys aren't listening to me are you? I remember my dad when he was"
    },
    {
      "id": 6,
      "start": 1228.2200260162354,
      "end": 1232.1800270080566,
      "text": " teaching when I was in high school he was teaching our teen class in our"
    },
    {
      "id": 7,
      "start": 1232.1800270080566,
      "end": 1236.380027770996,
      "text": " church in Nevada and he's a Marine and so you got to kind of take that into"
    },
    {
      "id": 8,
      "start": 1236.380027770996,
      "end": 1240.5400276184082,
      "text": " context of what's going on there and he was active duty at the time and he"
    },
    {
      "id": 9,
      "start": 1240.5400276184082,
      "end": 1245.9000282287598,
      "text": " constantly was dealing with Marines and certain things he he was he was in the"
    },
    {
      "id": 10,
      "start": 1245.9000282287598,
      "end": 1250.9000282287598,
      "text": " Marine Corps in a different era I'll put it that way and so my dad had the idea"
    },
    {
      "id": 11,
      "start": 1250.9000282287598,
      "end": 1254.100025177002,
      "text": " that when he was instructing if you weren't paying attention he just throw"
    },
    {
      "id": 12,
      "start": 1254.100025177002,
      "end": 1259.100025177002,
      "text": " stuff at you I mean honestly and so what was it that he would throw well"
    },
    {
      "id": 13,
      "start": 1259.100025177002,
      "end": 1262.8600273132324,
      "text": " he'd have a dry erase board that he was writing on and so dry erase markers"
    },
    {
      "id": 14,
      "start": 1262.8600273132324,
      "end": 1266.6200256347656,
      "text": " would fly in the classroom often it would why because you're not paying"
    },
    {
      "id": 15,
      "start": 1266.6200256347656,
      "end": 1273.5800247192383,
      "text": " attention but if we understand this morning the value of instruction then"
    },
    {
      "id": 16,
      "start": 1273.5800247192383,
      "end": 1278.1400299072266,
      "text": " we'll respond in a certain way let me give you a few thoughts from the book of"
    },
    {
      "id": 17,
      "start": 1278.1400299072266,
      "end": 1282.540023803711,
      "text": " Proverbs here we'll look at a couple other chapter or other portions of"
    },
    {
      "id": 18,
      "start": 1282.540023803711,
      "end": 1287.1000289916992,
      "text": " scripture as well but I want you to think about our response to instruction"
    },
    {
      "id": 19,
      "start": 1287.1000289916992,
      "end": 1291.1800231933594,
      "text": " when we know the value of instruction will respond notice in Proverbs 4 and"
    },
    {
      "id": 20,
      "start": 1291.1800231933594,
      "end": 1296.0600280761719,
      "text": " verse number 1 the first way that will respond is that we will hear instruction"
    },
    {
      "id": 21,
      "start": 1296.0600280761719,
      "end": 1301.6200256347656,
      "text": " we'll hear instruction we'll have a desire to hear the instruction why"
    },
    {
      "id": 22,
      "start": 1301.6200256347656,
      "end": 1307.1400299072266,
      "text": " because we understand the value of instruction it's interesting today we're"
    },
    {
      "id": 23,
      "start": 1307.1400299072266,
      "end": 1315.2200241088867,
      "text": " living in a time unfortunately in our society where there is a just a shift in"
    },
    {
      "id": 24,
      "start": 1315.2200241088867,
      "end": 1320.0600280761719,
      "text": " the dynamics of the respect that a younger generation has for an older"
    },
    {
      "id": 25,
      "start": 1320.0600280761719,
      "end": 1323.9400253295898,
      "text": " generation I'm sure that you've witnessed that and you've seen that in"
    },
    {
      "id": 26,
      "start": 1323.9400253295898,
      "end": 1329.9800262451172,
      "text": " our society it used to be that a younger generation had a great level of respect"
    },
    {
      "id": 27,
      "start": 1329.9800262451172,
      "end": 1334.02001953125,
      "text": " for an older generation because they recognize that there was something that"
    },
    {
      "id": 28,
      "start": 1334.1400299072266,
      "end": 1340.4200286865234,
      "text": " that older generation had to offer the next generation but in our society today"
    },
    {
      "id": 29,
      "start": 1340.4200286865234,
      "end": 1346.540023803711,
      "text": " it seems as if there are many that have the idea that we really don't need the"
    },
    {
      "id": 30,
      "start": 1346.540023803711,
      "end": 1353.1400299072266,
      "text": " older generation and that's unfortunate I am in a stage in my life where no"
    },
    {
      "id": 31,
      "start": 1353.1400299072266,
      "end": 1357.7400207519531,
      "text": " longer am I the youngest preacher when I go to a preacher's meeting for a number"
    },
    {
      "id": 32,
      "start": 1357.7400207519531,
      "end": 1362.9000244140625,
      "text": " of years I was always the youngest guy there and not so much the case anymore"
    },
    {
      "id": 33,
      "start": 1362.9000244140625,
      "end": 1366.1400299072266,
      "text": " and that's a good thing because there's some younger preachers that are out"
    },
    {
      "id": 34,
      "start": 1366.1400299072266,
      "end": 1371.6600341796875,
      "text": " there but the reality is that even in those early days and still to this day I"
    },
    {
      "id": 35,
      "start": 1371.6600341796875,
      "end": 1376.02001953125,
      "text": " go to a preacher's fellowship and I want to talk to some older pastors and I want"
    },
    {
      "id": 36,
      "start": 1376.02001953125,
      "end": 1380.6200256347656,
      "text": " to try to learn something from them they've experienced some things in their"
    },
    {
      "id": 37,
      "start": 1380.6200256347656,
      "end": 1386.9000244140625,
      "text": " ministries and in their lives and this past Tuesday I was at a pastor's meeting and some of the"
    },
    {
      "id": 38,
      "start": 1386.9000244140625,
      "end": 1391.3800201416016,
      "text": " guys and I talked to a bunch of people that were there and I went over and I"
    },
    {
      "id": 39,
      "start": 1391.3800201416016,
      "end": 1395.4600219726562,
      "text": " spoke to one pastor he's 80-something years old he just retired for the second"
    },
    {
      "id": 40,
      "start": 1395.4600219726562,
      "end": 1401.9000244140625,
      "text": " time and I want to try to get something from him and we think this morning of"
    },
    {
      "id": 41,
      "start": 1401.9000244140625,
      "end": 1407.6600341796875,
      "text": " this idea there's a value in instruction so I want to hear instruction what can I"
    },
    {
      "id": 42,
      "start": 1407.6600341796875,
      "end": 1413.1000213623047,
      "text": " how can I benefit from the instruction that is being provided notice in chapter"
    },
    {
      "id": 43,
      "start": 1413.1000213623047,
      "end": 1418.4600219726562,
      "text": " four and verse number one of the book of Proverbs it says hear ye children the"
    },
    {
      "id": 44,
      "start": 1418.4600219726562,
      "end": 1426.6200256347656,
      "text": " instruction of a father and attend to know understanding why why does he say"
    },
    {
      "id": 45,
      "start": 1426.6200256347656,
      "end": 1431.8600311279297,
      "text": " that will notice verse number two for I give you good doctrine forsaking not my"
    },
    {
      "id": 46,
      "start": 1431.8600311279297,
      "end": 1438.3800201416016,
      "text": " law we understand that Proverbs here as we think about the the book of Proverbs"
    },
    {
      "id": 47,
      "start": 1438.3800201416016,
      "end": 1442.4200286865234,
      "text": " in a whole and Solomon speaking to his son Rehoboam but we understand in a very"
    },
    {
      "id": 48,
      "start": 1442.4200286865234,
      "end": 1448.260025024414,
      "text": " real sense that God is speaking to us as his children and he says to us here"
    },
    {
      "id": 49,
      "start": 1448.260025024414,
      "end": 1453.7000274658203,
      "text": " here instruction God's instruction is good instruction it's valuable it is"
    },
    {
      "id": 50,
      "start": 1453.7000274658203,
      "end": 1458.2200317382812,
      "text": " profitable for us and when I understand and I know the value of instruction that"
    },
    {
      "id": 51,
      "start": 1458.2200317382812,
      "end": 1461.780029296875,
      "text": " I want to hear it not only do I hear it but number two I'd say this I want to"
    },
    {
      "id": 52,
      "start": 1461.780029296875,
      "end": 1465.6200256347656,
      "text": " receive it notice over in Proverbs chapter number 19 you know there's"
    },
    {
      "id": 53,
      "start": 1465.6200256347656,
      "end": 1470.2600402832031,
      "text": " something different between hearing and receiving would you agree with that this"
    },
    {
      "id": 54,
      "start": 1470.2600402832031,
      "end": 1475.3000183105469,
      "text": " morning there's something different between hearing and receiving I can hear"
    },
    {
      "id": 55,
      "start": 1475.3000183105469,
      "end": 1479.9800415039062,
      "text": " somebody but am I receiving the instruction I believe that the thought"
    },
    {
      "id": 56,
      "start": 1479.9800415039062,
      "end": 1485.2200317382812,
      "text": " of receiving instruction is not only the hearing of it but the applying of it"
    },
    {
      "id": 57,
      "start": 1485.2200317382812,
      "end": 1491.5400390625,
      "text": " that I'm going to put into practice that which is being imparted again it's not"
    },
    {
      "id": 58,
      "start": 1491.5400390625,
      "end": 1495.4600219726562,
      "text": " just you know are you listening to me yeah I'm hearing you no no no but you"
    },
    {
      "id": 59,
      "start": 1495.4600219726562,
      "end": 1500.1800231933594,
      "text": " you then watch the behavior you know the the decisions that are being made in"
    },
    {
      "id": 60,
      "start": 1500.1800231933594,
      "end": 1504.7000122070312,
      "text": " you're saying no no no you're not hearing me and really what's happening"
    },
    {
      "id": 61,
      "start": 1504.7000122070312,
      "end": 1508.9400329589844,
      "text": " is it's not that they're not hearing you they're not receiving it they're not"
    },
    {
      "id": 62,
      "start": 1508.9400329589844,
      "end": 1517.3800354003906,
      "text": " receiving it notice what the Bible says in Proverbs 19 and verse number 20 hear"
    },
    {
      "id": 63,
      "start": 1517.3800354003906,
      "end": 1527.3400268554688,
      "text": " counsel and receive instruction that thou mayest be wise in thy latter end"
    },
    {
      "id": 64,
      "start": 1527.3400268554688,
      "end": 1532.780029296875,
      "text": " receive instruction you know as we think about this truth of receiving"
    },
    {
      "id": 65,
      "start": 1532.780029296875,
      "end": 1536.6200256347656,
      "text": " instruction it's sad that there are many times that instruction is not received"
    },
    {
      "id": 66,
      "start": 1536.6200256347656,
      "end": 1541.5800170898438,
      "text": " it's not that instruction is not given it's that instruction is not received"
    },
    {
      "id": 67,
      "start": 1541.5800170898438,
      "end": 1545.9000244140625,
      "text": " now there's a problem when instruction is not given and again that's for"
    },
    {
      "id": 68,
      "start": 1545.9000244140625,
      "end": 1550.1800231933594,
      "text": " another conversation but this morning when instruction is being given when we"
    },
    {
      "id": 69,
      "start": 1550.1800231933594,
      "end": 1555.9800415039062,
      "text": " know in Proverbs 31 the truth that his mother taught him instruction actively"
    },
    {
      "id": 70,
      "start": 1555.9800415039062,
      "end": 1560.5800170898438,
      "text": " was being given was being provided the D the the the importance is that that"
    },
    {
      "id": 71,
      "start": 1560.5800170898438,
      "end": 1566.4600219726562,
      "text": " instruction is being received there are times in which instruction is rejected"
    },
    {
      "id": 72,
      "start": 1566.4600219726562,
      "end": 1572.6600341796875,
      "text": " despised listen to this indictment you don't need to turn there I'll read it"
    },
    {
      "id": 73,
      "start": 1572.6600341796875,
      "end": 1579.5800170898438,
      "text": " for you but in Jeremiah 32 and in verse number 33 God gives an indictment to"
    },
    {
      "id": 74,
      "start": 1579.5800170898438,
      "end": 1587.4600219726562,
      "text": " Judah with regard to their response the receiving of instruction by the way God"
    },
    {
      "id": 75,
      "start": 1587.4600219726562,
      "end": 1591.3800354003906,
      "text": " was faithful to give the nation of Israel and the nation of Judah"
    },
    {
      "id": 76,
      "start": 1591.3800354003906,
      "end": 1595.780029296875,
      "text": " instruction God was gracious and long-suffering and he kept raising up"
    },
    {
      "id": 77,
      "start": 1595.780029296875,
      "end": 1601.5400390625,
      "text": " prophets and sending prophets to deliver the message of God from God to his"
    },
    {
      "id": 78,
      "start": 1601.5400390625,
      "end": 1607.0600280761719,
      "text": " people but we know that in Jeremiah 32 in verse number 33 the Bible says of"
    },
    {
      "id": 79,
      "start": 1607.0600280761719,
      "end": 1612.3400268554688,
      "text": " them and they have turned unto me the back and not the face can you see the"
    },
    {
      "id": 80,
      "start": 1612.3400268554688,
      "end": 1616.5000305175781,
      "text": " imagery I mean if you're talking to someone you want them to look at you you"
    },
    {
      "id": 81,
      "start": 1616.5000305175781,
      "end": 1620.1400146484375,
      "text": " want them to face you can you imagine if you're giving instruction to somebody"
    },
    {
      "id": 82,
      "start": 1620.1400146484375,
      "end": 1627.3000183105469,
      "text": " and they turn their back on you that's just rude and God says and they have"
    },
    {
      "id": 83,
      "start": 1627.3000183105469,
      "end": 1636.0600280761719,
      "text": " turned into the back and not the face though I taught them rising up early and"
    },
    {
      "id": 84,
      "start": 1636.0600280761719,
      "end": 1646.3400268554688,
      "text": " teaching them yet they have not harkened to receive instruction I would"
    },
    {
      "id": 85,
      "start": 1646.3400268554688,
      "end": 1651.780029296875,
      "text": " submit to you that that's frustrating as an instructor is it not you're trying to"
    },
    {
      "id": 86,
      "start": 1651.780029296875,
      "end": 1654.5000305175781,
      "text": " give instruction you're trying to teach you're trying to impart truth you're"
    },
    {
      "id": 87,
      "start": 1654.5000305175781,
      "end": 1658.4200134277344,
      "text": " trying to equip for the future you're aware of the fact that there are some"
    },
    {
      "id": 88,
      "start": 1658.4200134277344,
      "end": 1662.2600402832031,
      "text": " cautions that you want to give because there are dangers in life you're aware"
    },
    {
      "id": 89,
      "start": 1662.2600402832031,
      "end": 1665.3400268554688,
      "text": " of the fact that you want to give some counsel because there are some decisions"
    },
    {
      "id": 90,
      "start": 1665.3400268554688,
      "end": 1673.0600280761719,
      "text": " in life and yet they're not taking heed this morning I believe that when we"
    },
    {
      "id": 91,
      "start": 1673.0600280761719,
      "end": 1678.8200378417969,
      "text": " understand the value of instruction that not only will we hear instruction but we"
    },
    {
      "id": 92,
      "start": 1678.8200378417969,
      "end": 1685.2200317382812,
      "text": " will receive instruction we'll receive that which is being imparted and then I"
    },
    {
      "id": 93,
      "start": 1685.2200317382812,
      "end": 1689.6200256347656,
      "text": " would say this and I love the the the verse of Scripture the way it says look"
    },
    {
      "id": 94,
      "start": 1689.6200256347656,
      "end": 1693.3000183105469,
      "text": " over at Proverbs chapter number 12 and verse number 1 I would say that we then"
    },
    {
      "id": 95,
      "start": 1693.3000183105469,
      "end": 1698.0600280761719,
      "text": " as I hear instruction and receive instruction I'm going to love instruction"
    },
    {
      "id": 96,
      "start": 1698.0600280761719,
      "end": 1705.780029296875,
      "text": " love instruction in Proverbs chapter number 12 in verse number 1 the Bible"
    },
    {
      "id": 97,
      "start": 1705.780029296875,
      "end": 1712.02001953125,
      "text": " speaks about this subject of instruction and it says whoso loveth instruction"
    },
    {
      "id": 98,
      "start": 1712.02001953125,
      "end": 1719.0599975585938,
      "text": " loveth knowledge but he that hateth reproof is brutish I think about that"
    },
    {
      "id": 99,
      "start": 1719.0599975585938,
      "end": 1723.4600219726562,
      "text": " first statement of Proverbs 12 and verse number 1 whoso loveth instruction"
    },
    {
      "id": 100,
      "start": 1723.4600219726562,
      "end": 1730.1800537109375,
      "text": " loveth knowledge I desire to receive that instruction I understand the value"
    },
    {
      "id": 101,
      "start": 1730.1800537109375,
      "end": 1735.260009765625,
      "text": " of instruction and so therefore I develop a love for instruction and I"
    },
    {
      "id": 102,
      "start": 1735.260009765625,
      "end": 1739.5800170898438,
      "text": " would submit to you that this is really kind of a cycle if you will then as I"
    },
    {
      "id": 103,
      "start": 1739.5800170898438,
      "end": 1744.5800170898438,
      "text": " love instruction then I'm going to hear it and I'm gonna receive it and then my"
    },
    {
      "id": 104,
      "start": 1744.5800170898438,
      "end": 1748.8200073242188,
      "text": " love for instruction is going to increase and therefore I'm going to hear"
    },
    {
      "id": 105,
      "start": 1748.8200073242188,
      "end": 1752.8600463867188,
      "text": " it and I'm going to receive it and I'm gonna love it more why because I"
    },
    {
      "id": 106,
      "start": 1752.8600463867188,
      "end": 1761.3800048828125,
      "text": " understand the value of it God's Word is full of valuable instruction and I"
    },
    {
      "id": 107,
      "start": 1761.3800048828125,
      "end": 1766.5,
      "text": " would say this God's Word is full of valuable instruction for every aspect of"
    },
    {
      "id": 108,
      "start": 1766.5,
      "end": 1774.300048828125,
      "text": " life God's Word has the answer we begin to think about the the the importance"
    },
    {
      "id": 109,
      "start": 1774.300048828125,
      "end": 1780.02001953125,
      "text": " this morning of recognizing the value of instruction so that I would respond"
    },
    {
      "id": 110,
      "start": 1780.02001953125,
      "end": 1786.1000366210938,
      "text": " to that instruction by hearing it and receiving it and loving it that I would"
    },
    {
      "id": 111,
      "start": 1786.1000366210938,
      "end": 1792.02001953125,
      "text": " apply it in my life that I would be a doer of the Word and not a hearer only"
    },
    {
      "id": 112,
      "start": 1792.02001953125,
      "end": 1799.1800537109375,
      "text": " how many times people have forsaken they have despised instruction they've"
    },
    {
      "id": 113,
      "start": 1799.1800537109375,
      "end": 1801.9400024414062,
      "text": " suffered"
    },
    {
      "id": 0,
      "start": 1801.9400024414062,
      "end": 1806.9800024032593,
      "text": " greatly for it. The Bible says the way of the transgressor is hard. You know, sometimes"
    },
    {
      "id": 1,
      "start": 1806.9800024032593,
      "end": 1816.2200021743774,
      "text": " it's challenging to watch a child, someone that you've sought to influence and counsel,"
    },
    {
      "id": 2,
      "start": 1816.2200021743774,
      "end": 1821.1000022888184,
      "text": " you've sought to pour your life into to instruct them. Sometimes it's difficult to watch them"
    },
    {
      "id": 3,
      "start": 1821.1000022888184,
      "end": 1828.4200019836426,
      "text": " make decisions that are outside of the counsel, the instruction that you've provided. How"
    },
    {
      "id": 4,
      "start": 1828.4200019836426,
      "end": 1833.3800029754639,
      "text": " many times we'd like to go over and make the decision for them. But you know what you"
    },
    {
      "id": 5,
      "start": 1833.3800029754639,
      "end": 1838.96000289917,
      "text": " find out in life? You can't really do that. You can't really do that. So what do we, when"
    },
    {
      "id": 6,
      "start": 1838.96000289917,
      "end": 1844.7800025939941,
      "text": " we understand that truth this morning, we must recognize for most of us that are here"
    },
    {
      "id": 7,
      "start": 1844.7800025939941,
      "end": 1849.2600021362305,
      "text": " in the room this morning, we think about that first point of the message this morning, the"
    },
    {
      "id": 8,
      "start": 1849.2600021362305,
      "end": 1855.5000038146973,
      "text": " vision of the instructor, that we would seek to impart that truth, that we would pray for,"
    },
    {
      "id": 9,
      "start": 1855.5000038146973,
      "end": 1860.8200035095215,
      "text": " that we would seek every opportunity that God would give us to be able to give that"
    },
    {
      "id": 10,
      "start": 1860.8200035095215,
      "end": 1868.6600036621094,
      "text": " instruction. Then when we're on the receiving end, that we'd hear it, we'd receive it, we'd"
    },
    {
      "id": 11,
      "start": 1868.6600036621094,
      "end": 1873.9400024414062,
      "text": " love it. I'm thankful that God would give us instruction. I'm thankful that God would"
    },
    {
      "id": 12,
      "start": 1873.9400024414062,
      "end": 1879.620002746582,
      "text": " give us instructors in our lives. I hope this morning you can think of some people that"
    },
    {
      "id": 13,
      "start": 1879.620002746582,
      "end": 1885.8199996948242,
      "text": " God has given you in your life to be an instructor, someone that seeks to impart truth, someone"
    },
    {
      "id": 14,
      "start": 1885.8199996948242,
      "end": 1892.8600006103516,
      "text": " that is faithful and diligent to invest in you. I was speaking with someone just this"
    },
    {
      "id": 15,
      "start": 1892.8600006103516,
      "end": 1900.7799987792969,
      "text": " past week and talked about some of my mentors. And I'm thankful for people that were willing"
    },
    {
      "id": 16,
      "start": 1900.7799987792969,
      "end": 1907.1399993896484,
      "text": " to invest in my life. I'm thankful that basically at any moment I can pick up the phone and"
    },
    {
      "id": 17,
      "start": 1907.1399993896484,
      "end": 1911.5800018310547,
      "text": " there's a few people that I can call and I can know that they're going to pick up the"
    },
    {
      "id": 18,
      "start": 1911.5800018310547,
      "end": 1916.5800018310547,
      "text": " phone and they're going to provide me with some instruction. Because there are times"
    },
    {
      "id": 19,
      "start": 1916.5800018310547,
      "end": 1923.3800048828125,
      "text": " in life that we need instruction, we need that counsel. And I'm thankful that God in"
    },
    {
      "id": 20,
      "start": 1923.3800048828125,
      "end": 1928.900001525879,
      "text": " His grace and His mercy has not only given us individuals, but He's given us this complete"
    },
    {
      "id": 21,
      "start": 1928.900001525879,
      "end": 1935.3399963378906,
      "text": " book. You know, how important it is that we face a situation in life, we say, God, would"
    },
    {
      "id": 22,
      "start": 1935.3399963378906,
      "end": 1940.3800048828125,
      "text": " you help me? Would you give me the instruction that I need? I don't, I hope that you recognize"
    },
    {
      "id": 23,
      "start": 1940.3800048828125,
      "end": 1945.6999969482422,
      "text": " in your life there are times that I just don't know what to do. God, I need some instruction."
    },
    {
      "id": 24,
      "start": 1945.6999969482422,
      "end": 1950.8600006103516,
      "text": " I need some direction. And God said that if we need wisdom, that if we ask Him, He promises"
    },
    {
      "id": 25,
      "start": 1950.8600006103516,
      "end": 1956.740005493164,
      "text": " to give it. He told us that He's given us all things that pertain unto life and godliness."
    },
    {
      "id": 26,
      "start": 1956.740005493164,
      "end": 1960.4600067138672,
      "text": " And so this morning as we think about Mother's Day and we think about this truth of Proverbs"
    },
    {
      "id": 27,
      "start": 1960.4600067138672,
      "end": 1966.8600006103516,
      "text": " chapter 31, and we think about the way in which the proverb begins, and again, most"
    },
    {
      "id": 28,
      "start": 1966.8600006103516,
      "end": 1971.6199951171875,
      "text": " of us this morning are familiar with much of the content, but we see in that very first"
    },
    {
      "id": 29,
      "start": 1971.6199951171875,
      "end": 1979.6199951171875,
      "text": " verse that the Bible says that His mother taught Him. I wonder this morning, in closing,"
    },
    {
      "id": 30,
      "start": 1979.6199951171875,
      "end": 1987.0599975585938,
      "text": " I wonder this morning, if we were to write out some things that our mother taught us,"
    },
    {
      "id": 31,
      "start": 1987.0599975585938,
      "end": 1996.2200012207031,
      "text": " what would they be? Let me ask it this way. What if we had our children write out some"
    },
    {
      "id": 32,
      "start": 1996.2200012207031,
      "end": 2003.240005493164,
      "text": " things that they would say, here's what my mother taught me? We find within the context"
    },
    {
      "id": 33,
      "start": 2003.240005493164,
      "end": 2011.5400085449219,
      "text": " of Proverbs 31 that the instructor is the mother, but as I said, many of us can have"
    },
    {
      "id": 34,
      "start": 2011.5400085449219,
      "end": 2018.4199981689453,
      "text": " that title as instructor. And so I wonder this morning, if we make it broader this morning,"
    },
    {
      "id": 35,
      "start": 2018.4199981689453,
      "end": 2022.6199951171875,
      "text": " if we'd say of those that God has given you the opportunity to have an influence in their"
    },
    {
      "id": 36,
      "start": 2022.6199951171875,
      "end": 2030.9000091552734,
      "text": " lives, if they were given the task of sitting down and writing out what has this instructor,"
    },
    {
      "id": 37,
      "start": 2030.9000091552734,
      "end": 2038.1800079345703,
      "text": " what have they taught you? What would the content be? Would there be anything of substance,"
    },
    {
      "id": 38,
      "start": 2038.1800079345703,
      "end": 2043.4600067138672,
      "text": " of value? Would you be able to look at it and say, man, I didn't even realize I was"
    },
    {
      "id": 39,
      "start": 2043.4600067138672,
      "end": 2049.979995727539,
      "text": " teaching all those lessons. I'm so thankful they were getting that. They were grasping"
    },
    {
      "id": 40,
      "start": 2049.979995727539,
      "end": 2057.1399993896484,
      "text": " that which I was seeking to impart to them. This morning, we see the vision of the instructor."
    },
    {
      "id": 41,
      "start": 2057.1399993896484,
      "end": 2064.5800170898438,
      "text": " I hope this morning, I know our kids are, Holly and I, our children are getting older,"
    },
    {
      "id": 42,
      "start": 2064.5800170898438,
      "end": 2071.6600036621094,
      "text": " 16, 18, 20. I mean, many of you have children that are older than that. But I understand"
    },
    {
      "id": 43,
      "start": 2071.6600036621094,
      "end": 2075.8200073242188,
      "text": " that sometimes when they're, you know, this big and it's just busy and so many things"
    },
    {
      "id": 44,
      "start": 2075.8200073242188,
      "end": 2087.2999877929688,
      "text": " and we can just get overwhelmed, when is this stage going to be over? It's hard. Have vision"
    },
    {
      "id": 45,
      "start": 2087.2999877929688,
      "end": 2094.5800170898438,
      "text": " to know that you're instructing them. You're seeking to impart and to equip, to caution"
    },
    {
      "id": 46,
      "start": 2094.5800170898438,
      "end": 2100.5,
      "text": " and to counsel. Why? Because by God's grace, they're going to grow up. They're going to"
    },
    {
      "id": 47,
      "start": 2100.5,
      "end": 2106.9400024414062,
      "text": " face a lot of things in life and they need your instruction. Have some vision about your"
    },
    {
      "id": 48,
      "start": 2106.9400024414062,
      "end": 2112.6199951171875,
      "text": " instruction. And then for all of us this morning, I hope that we'd understand the value of instruction."
    },
    {
      "id": 49,
      "start": 2112.6199951171875,
      "end": 2118.8999938964844,
      "text": " I say, man, I want to hear it and receive it and love it and just continue in that cycle"
    },
    {
      "id": 50,
      "start": 2118.8999938964844,
      "end": 2126.779998779297,
      "text": " because I understand that God has given me instruction and it is good for me. It is valuable."
    },
    {
      "id": 51,
      "start": 2126.779998779297,
      "end": 2133.019989013672,
      "text": " I never want to be in a place where it's said of Judah there in the book of Jeremiah that"
    },
    {
      "id": 52,
      "start": 2133.019989013672,
      "end": 2141.0599975585938,
      "text": " they hearken not to receive instruction. I don't want to be in that place. God's given"
    },
    {
      "id": 53,
      "start": 2141.0599975585938,
      "end": 2146.1400146484375,
      "text": " us his word. This morning, we must receive the instruction. Let's pray together. Father,"
    },
    {
      "id": 54,
      "start": 2146.1400146484375,
      "end": 2150.459991455078,
      "text": " we love you. We thank you so much for loving us. We thank you for the privilege of being"
    },
    {
      "id": 55,
      "start": 2150.459991455078,
      "end": 2156.1799926757812,
      "text": " able to gather together this morning. We thank you for your word. We thank you for the truth"
    },
    {
      "id": 56,
      "start": 2156.1799926757812,
      "end": 2161.459991455078,
      "text": " of your word. We thank you for this day, Mother's Day. As we think about this truth in Proverbs"
    },
    {
      "id": 57,
      "start": 2161.459991455078,
      "end": 2169.459991455078,
      "text": " 31, what great content is provided to us there in that portion of scripture as we just focus"
    },
    {
      "id": 58,
      "start": 2169.459991455078,
      "end": 2174.4200134277344,
      "text": " primarily in the beginning portion to think about the vision of the instructor, the value"
    },
    {
      "id": 59,
      "start": 2174.4200134277344,
      "end": 2181.1799926757812,
      "text": " of instruction. God, I pray this morning that you would help us. I pray that you would work"
    },
    {
      "id": 60,
      "start": 2181.1799926757812,
      "end": 2185.5800170898438,
      "text": " in hearts and lives as only you can. Help us to have a vision for those that you've"
    },
    {
      "id": 61,
      "start": 2185.5800170898438,
      "end": 2191.5599975585938,
      "text": " given us the opportunity to instruct and help us to have the proper value placed upon the"
    },
    {
      "id": 62,
      "start": 2191.5599975585938,
      "end": 2197.459991455078,
      "text": " instruction that we'd receive. Help us, Lord. I pray that in this few moments of invitation,"
    },
    {
      "id": 63,
      "start": 2197.459991455078,
      "end": 2202.019989013672,
      "text": " before we have the baby dedication, Lord, I pray that you would move and work in hearts"
    },
    {
      "id": 64,
      "start": 2202.019989013672,
      "end": 2206.5,
      "text": " and lives as only you can. I pray that in these few moments of invitation that decisions"
    },
    {
      "id": 65,
      "start": 2206.5,
      "end": 2211.739990234375,
      "text": " would be made that would please thee. Maybe there's some that this morning, if they'd"
    },
    {
      "id": 66,
      "start": 2211.739990234375,
      "end": 2215.8600158691406,
      "text": " be honest, they've not received instruction. Maybe they've hardened their heart. Maybe"
    },
    {
      "id": 67,
      "start": 2215.8600158691406,
      "end": 2222.1000061035156,
      "text": " they've resisted, despised instruction. Oh, God, I pray that you'd help them to get that"
    },
    {
      "id": 68,
      "start": 2222.1000061035156,
      "end": 2231.019989013672,
      "text": " right. I pray that we would love instruction, hear it and receive it, apply it in our lives."
    },
    {
      "id": 69,
      "start": 2231.019989013672,
      "end": 2234.3399963378906,
      "text": " I pray that you'd move and work as only you can. For it's in Christ's name we pray. Would"
    },
    {
      "id": 70,
      "start": 2234.3399963378906,
      "end": 2237.9400024414062,
      "text": " you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on"
    },
    {
      "id": 71,
      "start": 2237.9400024414062,
      "end": 2238.6199951171875,
      "text": " the piano."
    }
  ],
  "processed_at": "2025-04-16T09:15:32.720910"
}