{
  "video_id": "Bub30LEwKyg",
  "text": "Kings chapter number six, we'll be looking at verses 24 through 33, and this is lesson number 28, as we've been studying through the life of Elijah and now Elisha. And if you're taking notes this evening, the title for the message is The Syrians Besieged Samaria. The Syrians Besieged Samaria. In our text of scripture, we'll look at this, what has happened and the conflict between the Syrians and the nation of Israel. You'll remember from our previous section of the book of 2 Kings chapter number six last Wednesday evening as we studied this portion of scripture, we made note as to the fact that Elisha prayed and the host of the Syrians that were sent to apprehend him, remember they were smitten with blindness from the Lord. And you'll recall with me that Elisha was telling the secrets of Ben-Hadad when he was working with his generals, if you will, and they were devising their strategic plans for warfare that Elisha was letting King Jehoram, the King of Israel, know the plans. And Ben-Hadad was sure that there was a traitor in their midst and he was told, no, no traitor. It's the prophet of God, Elisha, he's telling the secrets of those things which you speak even in your bedchamber, can you imagine? We know that as we studied the passage of scripture that Ben-Hadad sends a host of Syrians there to Dothan, that's where Elisha was, and remember the servant of the Lord went out early in the morning and he saw the great host that had compassed the city and he was concerned, he said, alas, my master, and we find that he said, how shall we do? And Elisha said, don't worry, there's more for us than there are with them, isn't that exciting? And he prayed that God would open the eyes of that servant and God opened his eyes and he saw the great host, the angelic host, the powers of God. As I mentioned last week, what a great truth that is to understand the spiritual battle that we're engaged in and oh, how even still today we're engaged in spiritual warfare. I am thankful, the Bible says, of God before us, who can be against us? We are more than conquerors through Christ, but thanks be to God which giveth us the victory through the Lord Jesus Christ and we can rejoice in that. He then prayed that God would cause these soldiers to be blinded and God answered that prayer and we find that he, Elisha, led them to Samaria and then prayed that their eyes would be opened and sure enough, their eyes were opened, they were taken good care of. Remember Jehoram said, should we kill them? And Elisha says, no, treat them nice and feed them and send them back and they returned to Ben-Hadad and what a story they had to tell. Their whole purpose of going to Dothan was to take Elisha and to bring him back to Ben-Hadad and yet the very person that they were supposed to take captive led them in blindness to Samaria and then back to, of course, Syria to their captain, to their general, if you will, and we find now that we come to the text of scripture that is before us tonight and as time passed, Ben-Hadad, the king of Syria, would gather his army and besiege Samaria. Notice in verse number 24 it says, and it came to pass after this. Now we do not know the amount of time that passes between verse number 23 and verse number 24. We read in verse number 23 at the end of the verse that it says, so the bands of Syria came no more into the land of Israel. It would seem as if you would study the history of Israel and the conflicts between the nation of Israel and the Syrians. They would send bands of men in and it was just a constant conflict and for a period of time that ceased and we find that there was a period of time that lapsed that came to pass after this that Ben-Hadad, king of Syria, notice what the Bible says in verse number 24, gathered all his host and went up and besieged Samaria. As we're taking notes this evening, the title for the message again is The Syrians Besieged Samaria and number one if you're taking notes, notice the record of the siege. God provides us a record of what is happening and as we see this, of course it was a military strategy that was often employed. You can read throughout history of various military campaigns where an army would come to a city and they would lay siege against the city and they would cut out anything from coming in or going out. Basically in essence what they were seeking to do is starve them out and there would be a period of time that would last, no set time as to the length of the siege. But we find that as we come to the text of Scripture, the Bible gives us the record of this particular siege on this particular day, this period of time and it says that he, Ben-Hadad, the king of Syria, notice he gathered all his host and they came and they compassed the city, they laid siege against Samaria. Now you'll recall with me that Samaria is the capital of Israel. When we speak about Israel in this particular era of history for the nation of Israel we're speaking of the ten tribes of the north, the northern kingdom as we would often refer to it as. Of course Jehoram is the king of Israel at this particular time in history and we will look in just a few moments and see the wickedness that really would just describe the period of time in which we're looking at. And we find that this host of Syria that they laid siege against Samaria, the capital city of the northern kingdom of Israel. The Bible says that there was a great famine in Samaria to begin verse number 25. It would seem as we look at the passage of Scripture that the siege lasted certainly for long enough to have a significant impact upon the city of Samaria. In other words, we would say this from a military perspective, the Syrians were successful in doing what they sought to do. The Syrians, they had laid out, look, they didn't have to go and do battle and fight with them, they're just going to besiege the city. They're going to cut out, nothing's coming in, nothing's going out and we're just going to starve them. I mean that's what we're going to do and there's a great famine and they've been successful at accomplishing what they want to accomplish. Eventually from a military perspective, from the mindset of the Ben-Hadad, the king of Syria, and from that military perspective, really what they're looking for is for the city to just go ahead and just surrender. And then they can go ahead and have whatever they want to have and do whatever they want to do. And we find here that this siege, what Syria did to Samaria, they were successful. The record is given to us, but I want you to see really the result of the siege. As we look in verses 25 through 29, and I should say the results of the siege, I want you to see what the Bible tells us. We see the record that they besieged Samaria, but look at what happens because of this. We've not been in a position, those of us that are gathered here, where we've been in a city that has been besieged, where we've been in that situation, and we find that as we begin to read in verses 25 down through verse number 29, and read the results as God would tell us what happened, we really see the seriousness of the situation. I mean, this is a terrible, terrible situation, really, in certain regards, beyond human comprehension. Things that we probably would just not even, outside of Scripture, outside of reading it and understanding that God's given us a true record, would be hard for us to comprehend, especially as Americans, being in this country, and even with some of the things that we're dealing with right now, with COVID-19, it pales in comparison to what we're dealing with this evening. It pales in comparison to what other nations throughout history have had to deal with. We know that the record is true. When we read the results that are captured here, this, remember, is God's Word. God's Word is truth. Every single part of it. Every single detail that God gives us, it's true. Thy Word is truth. The psalmist said it's very pure, it's very true, and we find that the results are laid out for us. We mentioned already, in verse number 25, there was a great famine in Samaria. Notice that this great famine is evidenced by a couple of things. Number one, you see that the Bible says, and behold, they besieged it, notice, in verse number 25, until an ass's head was sold for fourscore pieces of silver. Now, this donkey that is mentioned here in verse number 25, you have to understand he's an unclean animal, and the head of this particular animal was selling for 80 pieces of silver. That's pretty serious. As far as the inflation, if you will, of the commodities, I've never had the brains of a donkey for my dinner, and I hope that I never have to. But for 80 pieces of silver, again, we see the inflation. We see, really, the results of this siege that was laid against Samaria, the effectiveness, in a sense, of what Syria was doing to the city of Samaria. And we find that the Bible tells us not only was this donkey's head sold for fourscore pieces of silver, this unclean animal, but it says at the end of verse number 25, in the fourth part of a cab of doves dung for five pieces of silver. And we don't even know what that particular measurement is. There are some that have given their ideas and really assumptions as to the size, the quantity. It's really uncertain. It's a very small portion, no doubt. But it's doves dung was being sold for five pieces of silver So we noticed this great famine and how it's evidence for us in verse 25 by the cost of goods the commodities the Inflation if you will and in how there was just nothing notice that they were helpless And I would say hopeless in verse 26 and 27 as we look at the text of Scripture We see that there's a sense of helplessness and hopelessness the Bible tells us in verse number 26 and as the king of Israel This is Jehoram As he was passing by upon the wall there cried a woman unto him saying help my lord Oh king and so you understand that they the the woman that's mentioned here we don't have her name, but we understand that she's calling to the king to Jehoram for help and We find that it was a hopeless helpless situation and notice how he the king responds He said if the Lord do not help thee whence shall I help thee? She needed help the king was not capable of giving any help. He says to her in essence It's outside of my control. There's nothing that I can do It would have to be the Lord that would help now, I'm thankful that we know the Lord God Almighty I'm thankful even as I prayed this evening to start our service Psalm 121 that the Lord would help us to lift up our eyes into the hills from whence cometh our help Knowing that our help cometh from the Lord which made heaven and earth I'm thankful that Hebrews 13 that the Bible says that we might boldly say the Lord is my helper and what a joy To know the help that God provides and throughout the scriptures we can see so often How that he is a very present help in the time of trouble He is able and what a blessing that is Of course, we'd understand this particular time in Israel's history, especially in the northern kingdom under the reign of Jehoram there was much idolatry false worship of idols that was taking place and Here they're going to the king, you know, it's natural for people to look for help from somebody that they can see someone they Expect to be able to help and here the king says there's nothing I can do It's interesting He said something similar if you remember in 2nd Kings chapter number 5 when the king of Syria had sent a letter with regard to the situation With Naaman and his leprosy and remember the king of Syria said hey We're gonna send Naaman over there so you can take care of them and Jehoram's like who am I like? What am I gonna do about this? In fact, he says the king of Israel says when he received the letter in 2nd Kings chapter number 5 He says behold I have Excuse me verse number 7 Am I God to kill and to make alive that this man doth send unto me to recover a man of his leprosy and now in Chapter number 6 this woman is saying to the king help us He says I'm not able notice what he says at the end of verse number 27 He says out of the barn floor or out of the winepress in other words there was nothing the Syrians had laid siege against Samaria for whatever duration of time that has passed at this particular point And they were at the end of themselves. They had no hope they had no help There were no resources that were left nothing that was available to them And we find that as we continue to go through the text and see the results of this siege That we see the tragic details that are given to us in verses 28 and 29 Behavior that really is beyond our comprehension We know that it's true because God's Word says that it is and I'll be honest with you this evening this is a very sad portion of Scripture to see the level of just wickedness I would call it to see how Just severe the situation and circumstances were the Bible says this in verse number 28 and the king said unto her what a let thee And she answered This woman said unto me Give thy son that we may eat him today, and we will eat my son Tomorrow I can't even imagine saying that I can't imagine being in that mindset The starvation has been so severe because of the siege that's been laid against the city nothing coming in nothing going out and we find that there's nothing left and we've mentioned already about the the head of the the donkey and Those things that would give us an evidence of how bad this siege was and we find that these two women They made an agreement that they would kill and eat the the one son today and tomorrow They would kill and eat the other son cannibalism, this is horrible, this is wicked It shows us the seriousness the severity of the siege the seriousness of the situation Notice what she says she mentions the agreement that was made in verse 28 between her and this other woman in verse number 29 Notice what she says so we boiled my son and did eat him And I said unto her on the next day give thy son that we may eat him and She hath hid her son My heart just is saddened when I read those verses of Scripture I can't imagine the the level of despair and just desperation these Inhabitants of Samaria were in We find that the Bible gives us not only the record of the siege the results of the siege I want you to notice as we look at the remainder of chapter number six this evening the response of King Jehoram Now you notice that the king The Bible tells us that he was passing by upon the wall in verse 26 and that's where he kind of get his interaction in this particular Situation as it's unfolding with the siege of the Syrians against the city of Samaria and he's receiving this word from this woman Initially she asked for help and then gives her gives her situation Explains it and it says in verse number 30 as we begin to see the response of King Jehoram the Bible says it came to pass when the king heard the words of the woman that he rent his clothes and He passed by upon the wall and the people looked and behold. He had sackcloth within upon his flesh We find that there was a reaction a response of despair really, if you think about the sackcloth that is mentioned perhaps even a level of humility and understanding the the the seriousness of the situation and it says that he rent his clothes and he passed by upon the wall and the people looked This was something that was done publicly. This was something that the people of Samaria The the people of Israel there would have seen King Jehoram Responding in this manner and I believe that it reveals to us his level of desperation With regard to the scenario the the seeds that they were dealing with But notice what he says We see how he responds in verse number 30, but I want you to notice what he says in verse number 31 He said go excuse me God do so and more also to me if the head of Elisha The son of Shaphat shall stand on him this day. You know, he's saying in verse number 31. We're gonna kill Elisha Let's kill the man of God as if he's the culprit as if he's the reason for all that's taking place And perhaps it's a thought by which he had experienced the or at least heard of the miracles of Elisha the the miracles of God that God wrought through Elisha the provision and various other things and we find of course that he was aware of the healing of Naaman and He saw what happened with the Syrians that came after Elisha and Dothan in the previous passage of Scripture and now he concludes after he hears what's taking place He's experiencing this great siege against the city. He's he's irrational He determines what we're gonna do is kill Elisha He says God do so and more also to me if the head of Elisha the son of Shaphat shall stand on him This day it's very interesting because Jehoram is the son of wicked Ahab and wicked Jezebel and you remember that Jezebel said in first Kings with regard to Elijah in first Kings chapter number 18, right actually it's in chapter number 19 that she says After she hears word about Elisha slaying the prophets of Baal. She says this Let the gobs do to me and more also if I make not thy life as the life of one of them by tomorrow about this time That was in first Kings 19 and verse number 2 when Jezebel is speaking about killing the man of God Elijah now Jehoram is speaking about killing the man of God Elisha here in 2nd Kings chapter number 6 because of this great famine That is the result of the the siege that the Syrians have laid against the city of Samaria The Bible tells us in verse number 32, but Elisha sat in his house now it's kind of interesting as I notice the text of Scripture and kind of see the the way in which the writer would give us some insight as to maybe the The level of reaction of Elisha and really the calm demeanor If you will of Elisha the man of God, this is the he sat in his house, and the elders sat with him, and the king sent a man from before him.\" Why did the king send a man? Because he wanted to go get Elisha to bring him back, right? He was going to kill him, remember? He says that in verse number 31. So we find that the Bible says that, see, in verse number 32, it says, He said to the elders, Elisha says to the elders, See ye how this son of a murderer hath sent to take away mine head. Isn't it interesting, isn't it just encouraging, how God allowed Elisha to know what was going on? Elisha was the one that had been informing King Jehoram of the plans of Ben-Hadad during the battle. This is recorded earlier in chapter number 6. And now we find that Jehoram says, we're going to kill Elisha, but God allows Elisha to have this knowledge of what's going on. And then he continues and says, Look, when the messenger cometh, shut the door, and hold him fast at the door, is not the sound of his master's feet behind him? So in other words, Elisha understands that this messenger has been sent to apprehend him for the purpose of murder. And he says, but his master Jehoram, his feet are behind him, he's coming as well. In verse 33, And while he yet talked with them, behold, the messenger came down unto him, and he said, Behold, this evil is of the Lord. What should I wait for the Lord any longer? And it's interesting in verse number 33, as you look at that phraseology, really the dialogue, because we see that chapter 7 begins with Elisha responding. And we'll get into that next week, just very difficult to deal with all of it in one lesson. And we'll deal with the 7th chapter next Wednesday evening. But Jehoram is speaking to Elisha and says, Behold, this evil is of the Lord. What should I wait for the Lord any longer? And I believe that as you look at the context and you understand why Jehoram would say this to Elisha, and then Elisha would respond in chapter 7, in verse number 1, he says, Hear ye the word of the Lord, thus saith the Lord tomorrow about this time. And he's speaking of really the deliverance of God and how God was going to work miraculously. Again, the subject for next Wednesday evening. But it would seem evident that Elisha had in some way counseled Jehoram with regard to the reason for this particular siege that they were experiencing under the hands of the Syrians was because of the evil of the wickedness of the nation of Israel. And he says, What should I wait for the Lord any longer? Perhaps Elisha had encouraged him that God would work and God would deliver, but he's ready to surrender. He's ready to be done with this. And we find that God, no doubt, is working. And it's interesting to understand as we look at the scriptures and deal with these various things that take place and really the terrible situation in chapter number 6 at the end of the passage, dealing with this siege against Samaria. But you understand that the nation of Israel at this time, as I mentioned earlier in the message tonight, they were really idolatrous people. They were serving false gods, idols, and the plurality of their gods. And God was bringing a level of judgment against them because of their wickedness. And no doubt God was going to humble them and he was going to show his power. And he does just that in chapter number 7. He shows his power. I'm not sure all to whom the nation of Israel, Samaria as a city, were looking to help for. There's no record in our text of scripture that they cry out to God for help. There is the record that they go to the king for help. But even in that situation, he doesn't cry out to God, at least as not as recorded in the scriptures. Notice this, and we'll close with this in 2 Kings 3, just to remind you of the character of Jehoram and also of the wickedness that would describe this particular era of history in the nation of Israel. In 2 Kings 3, in verse number 1, the Bible says, Now Jehoram, the son of Ahab, began to reign over Israel and Samaria in the eighteenth year of Jehoshaphat, king of Judah, and reigned twelve years. We won't take a lot of time here, but you'll remember that Jehoshaphat, the king of Judah, he would be categorized basically as being a good king. Judah had several good kings throughout their history, and Jehoshaphat would have been one of them. But yet up in the northern kingdom in Israel, Jehoram is reigning, and the Bible tells us of him in verse number 2, that he wrought evil in the sight of the Lord, but not like his father, not like his mother, for he put away the image of Baal that his father had made. But notice what it says in verse 3, Nevertheless, he cleaved unto the sons of Jeroboam, the son of Nebat, which made Israel to sin, he departed not therefrom. And if you go back, we don't have time to deal with it this evening, but if you go back to 1 Kings, maybe jot it down in your notes, in 1 Kings chapter number 12, in verses 25 through 33, you will find described for you in that passage of scripture, the sins of Jeroboam. You will find that there at the time after Solomon's reign, when you have Rehoboam, king of Judah, Jeroboam, king of Israel, you will find how that he introduced idolatrous worship, false worship, all of the new feast days, and all of those things that they put in place, so that people would not return to Jerusalem, which was down in Judah, and then perhaps not come back to him. And so Jeroboam introduced a bunch of those things, and you find that detailed in 1 Kings 12, verses 25 through 33. As we look at chapter number 6, and we conclude this passage as we prepare for chapter number 7 for next Wednesday evening, we must understand in this passage of scripture that God is giving us this record, and it's a terrible time in Israel's history. A terrible time during the reign of Jehoram. I mean, the details, the description of what's happening during this time in which the Syrians besieged Samaria is terrible. It's beyond, at certain levels, our ability to really comprehend that things would go that low and be that difficult and that problematic. But we find that as we come to chapter number 7 that Elisha stands up with great power and great boldness and says, hear the word of the Lord. I'm so thankful that our God is able. And our God works miraculously in chapter number 7. I look forward to being able to study it with you next Wednesday evening and looking at what God does and how God works. But we must understand that we need to turn to the Lord, that we need to keep our eyes upon him, that he is able. He is able. And what a great God that we serve. He is able to do exceeding abundantly above all that we ask or think, according to Ephesians 3 and verse number 20. The Syrians besieged Samaria. And we find that the people there in northern Israel, they were suffering greatly. And God was getting ready to work miraculously in 2 Kings chapter 7. Let's pray. Father, we love you. We thank you for loving us. Thank you for thy word, the truth of thy word. We thank you for the power of your word. Lord, I pray that even as we would understand this just terrible time in Israel's history, Lord, that we would learn lessons from this passage and understanding the importance of seeking you and obeying you and doing your will. Lord, that we'd understand that you are able. Lord, that we would understand the fact that you are a righteous judge and that your judgment is seen in this passage of scripture. And God, we thank you for Elisha and for his boldness. Lord, we pray that you would help us to continue to serve you. Lord, keep our eyes upon our Lord and Savior, Jesus Christ, the author and finisher of our faith. I pray, Lord, that you'd be with our workers for Awana here in just a little while as they work with the young people. I pray that you would encourage them and strengthen them. I pray, God, that you would help us this week to be used of thee. And we'll thank you for all that you'll do. For it's in Christ's name we pray. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.800000190734863,
      "text": " Kings chapter number six, we'll be looking at verses 24 through 33, and this is lesson"
    },
    {
      "id": 1,
      "start": 4.800000190734863,
      "end": 9.4399995803833,
      "text": " number 28, as we've been studying through the life of Elijah and now Elisha."
    },
    {
      "id": 2,
      "start": 9.4399995803833,
      "end": 15.119999885559082,
      "text": " And if you're taking notes this evening, the title for the message is The Syrians Besieged"
    },
    {
      "id": 3,
      "start": 15.119999885559082,
      "end": 17.280000686645508,
      "text": " Samaria."
    },
    {
      "id": 4,
      "start": 17.280000686645508,
      "end": 20.8799991607666,
      "text": " The Syrians Besieged Samaria."
    },
    {
      "id": 5,
      "start": 20.8799991607666,
      "end": 26.719999313354492,
      "text": " In our text of scripture, we'll look at this, what has happened and the conflict between"
    },
    {
      "id": 6,
      "start": 26.719999313354492,
      "end": 28.600000381469727,
      "text": " the Syrians and the nation of Israel."
    },
    {
      "id": 7,
      "start": 28.719999313354492,
      "end": 33.79999923706055,
      "text": " You'll remember from our previous section of the book of 2 Kings chapter number six"
    },
    {
      "id": 8,
      "start": 33.79999923706055,
      "end": 38.279998779296875,
      "text": " last Wednesday evening as we studied this portion of scripture, we made note as to the"
    },
    {
      "id": 9,
      "start": 38.279998779296875,
      "end": 46.15999984741211,
      "text": " fact that Elisha prayed and the host of the Syrians that were sent to apprehend him, remember"
    },
    {
      "id": 10,
      "start": 46.15999984741211,
      "end": 49.68000030517578,
      "text": " they were smitten with blindness from the Lord."
    },
    {
      "id": 11,
      "start": 49.68000030517578,
      "end": 54.7599983215332,
      "text": " And you'll recall with me that Elisha was telling the secrets of Ben-Hadad when he was"
    },
    {
      "id": 12,
      "start": 54.7599983215332,
      "end": 60.279998779296875,
      "text": " working with his generals, if you will, and they were devising their strategic plans"
    },
    {
      "id": 13,
      "start": 60.279998779296875,
      "end": 66.76000213623047,
      "text": " for warfare that Elisha was letting King Jehoram, the King of Israel, know the plans."
    },
    {
      "id": 14,
      "start": 66.76000213623047,
      "end": 73.68000030517578,
      "text": " And Ben-Hadad was sure that there was a traitor in their midst and he was told, no, no traitor."
    },
    {
      "id": 15,
      "start": 73.68000030517578,
      "end": 80.04000091552734,
      "text": " It's the prophet of God, Elisha, he's telling the secrets of those things which you speak"
    },
    {
      "id": 16,
      "start": 80.04000091552734,
      "end": 83.0199966430664,
      "text": " even in your bedchamber, can you imagine?"
    },
    {
      "id": 17,
      "start": 83.0999984741211,
      "end": 89.18000030517578,
      "text": " We know that as we studied the passage of scripture that Ben-Hadad sends a host of Syrians"
    },
    {
      "id": 18,
      "start": 89.18000030517578,
      "end": 94.69999694824219,
      "text": " there to Dothan, that's where Elisha was, and remember the servant of the Lord went"
    },
    {
      "id": 19,
      "start": 94.69999694824219,
      "end": 99.13999938964844,
      "text": " out early in the morning and he saw the great host that had compassed the city and he was"
    },
    {
      "id": 20,
      "start": 99.13999938964844,
      "end": 105.62000274658203,
      "text": " concerned, he said, alas, my master, and we find that he said, how shall we do?"
    },
    {
      "id": 21,
      "start": 105.62000274658203,
      "end": 109.22000122070312,
      "text": " And Elisha said, don't worry, there's more for us than there are with them, isn't that"
    },
    {
      "id": 22,
      "start": 109.22000122070312,
      "end": 110.62000274658203,
      "text": " exciting?"
    },
    {
      "id": 23,
      "start": 110.62000274658203,
      "end": 115.77999877929688,
      "text": " And he prayed that God would open the eyes of that servant and God opened his eyes and"
    },
    {
      "id": 24,
      "start": 115.77999877929688,
      "end": 120.30000305175781,
      "text": " he saw the great host, the angelic host, the powers of God."
    },
    {
      "id": 25,
      "start": 120.30000305175781,
      "end": 126.0999984741211,
      "text": " As I mentioned last week, what a great truth that is to understand the spiritual battle"
    },
    {
      "id": 26,
      "start": 126.0999984741211,
      "end": 131.13999938964844,
      "text": " that we're engaged in and oh, how even still today we're engaged in spiritual warfare."
    },
    {
      "id": 27,
      "start": 131.13999938964844,
      "end": 135.22000122070312,
      "text": " I am thankful, the Bible says, of God before us, who can be against us?"
    },
    {
      "id": 28,
      "start": 135.22000122070312,
      "end": 141.5,
      "text": " We are more than conquerors through Christ, but thanks be to God which giveth us the victory"
    },
    {
      "id": 29,
      "start": 141.5,
      "end": 144.77999877929688,
      "text": " through the Lord Jesus Christ and we can rejoice in that."
    },
    {
      "id": 30,
      "start": 144.77999877929688,
      "end": 151.22000122070312,
      "text": " He then prayed that God would cause these soldiers to be blinded and God answered that"
    },
    {
      "id": 31,
      "start": 151.22000122070312,
      "end": 156.17999267578125,
      "text": " prayer and we find that he, Elisha, led them to Samaria and then prayed that their eyes"
    },
    {
      "id": 32,
      "start": 156.17999267578125,
      "end": 161.5800018310547,
      "text": " would be opened and sure enough, their eyes were opened, they were taken good care of."
    },
    {
      "id": 33,
      "start": 161.5800018310547,
      "end": 163.05999755859375,
      "text": " Remember Jehoram said, should we kill them?"
    },
    {
      "id": 34,
      "start": 163.05999755859375,
      "end": 167.66000366210938,
      "text": " And Elisha says, no, treat them nice and feed them and send them back and they returned"
    },
    {
      "id": 35,
      "start": 167.66000366210938,
      "end": 170.89999389648438,
      "text": " to Ben-Hadad and what a story they had to tell."
    },
    {
      "id": 36,
      "start": 170.89999389648438,
      "end": 176.5800018310547,
      "text": " Their whole purpose of going to Dothan was to take Elisha and to bring him back to Ben-Hadad"
    },
    {
      "id": 37,
      "start": 176.5800018310547,
      "end": 183.3000030517578,
      "text": " and yet the very person that they were supposed to take captive led them in blindness to Samaria"
    },
    {
      "id": 38,
      "start": 183.3000030517578,
      "end": 190.82000732421875,
      "text": " and then back to, of course, Syria to their captain, to their general, if you will, and"
    },
    {
      "id": 39,
      "start": 190.82000732421875,
      "end": 197.86000061035156,
      "text": " we find now that we come to the text of scripture that is before us tonight and as time passed,"
    },
    {
      "id": 40,
      "start": 197.86000061035156,
      "end": 203.4199981689453,
      "text": " Ben-Hadad, the king of Syria, would gather his army and besiege Samaria."
    },
    {
      "id": 41,
      "start": 203.4199981689453,
      "end": 208.10000610351562,
      "text": " Notice in verse number 24 it says, and it came to pass after this."
    },
    {
      "id": 42,
      "start": 208.10000610351562,
      "end": 212.66000366210938,
      "text": " Now we do not know the amount of time that passes between verse number 23 and verse number"
    },
    {
      "id": 43,
      "start": 212.66000366210938,
      "end": 213.82000732421875,
      "text": " 24."
    },
    {
      "id": 44,
      "start": 213.82000732421875,
      "end": 217.4199981689453,
      "text": " We read in verse number 23 at the end of the verse that it says, so the bands of Syria"
    },
    {
      "id": 45,
      "start": 217.4199981689453,
      "end": 219.77999877929688,
      "text": " came no more into the land of Israel."
    },
    {
      "id": 46,
      "start": 219.77999877929688,
      "end": 226.25999450683594,
      "text": " It would seem as if you would study the history of Israel and the conflicts between the nation"
    },
    {
      "id": 47,
      "start": 226.25999450683594,
      "end": 227.94000244140625,
      "text": " of Israel and the Syrians."
    },
    {
      "id": 48,
      "start": 227.94000244140625,
      "end": 233.17999267578125,
      "text": " They would send bands of men in and it was just a constant conflict and for a period"
    },
    {
      "id": 49,
      "start": 233.17999267578125,
      "end": 237.94000244140625,
      "text": " of time that ceased and we find that there was a period of time that lapsed that came"
    },
    {
      "id": 50,
      "start": 237.94000244140625,
      "end": 242.4199981689453,
      "text": " to pass after this that Ben-Hadad, king of Syria, notice what the Bible says in verse"
    },
    {
      "id": 51,
      "start": 242.4199981689453,
      "end": 248.1999969482422,
      "text": " number 24, gathered all his host and went up and besieged Samaria."
    },
    {
      "id": 52,
      "start": 248.1999969482422,
      "end": 253.16000366210938,
      "text": " As we're taking notes this evening, the title for the message again is The Syrians Besieged"
    },
    {
      "id": 53,
      "start": 253.16000366210938,
      "end": 258.55999755859375,
      "text": " Samaria and number one if you're taking notes, notice the record of the siege."
    },
    {
      "id": 54,
      "start": 258.55999755859375,
      "end": 263.32000732421875,
      "text": " God provides us a record of what is happening and as we see this, of course it was a military"
    },
    {
      "id": 55,
      "start": 263.32000732421875,
      "end": 264.8599853515625,
      "text": " strategy that was often employed."
    },
    {
      "id": 56,
      "start": 264.8599853515625,
      "end": 270.3599853515625,
      "text": " You can read throughout history of various military campaigns where an army would come"
    },
    {
      "id": 57,
      "start": 270.3599853515625,
      "end": 275.20001220703125,
      "text": " to a city and they would lay siege against the city and they would cut out anything from"
    },
    {
      "id": 58,
      "start": 275.20001220703125,
      "end": 276.9599914550781,
      "text": " coming in or going out."
    },
    {
      "id": 59,
      "start": 276.9599914550781,
      "end": 281.239990234375,
      "text": " Basically in essence what they were seeking to do is starve them out and there would be"
    },
    {
      "id": 60,
      "start": 281.239990234375,
      "end": 287.32000732421875,
      "text": " a period of time that would last, no set time as to the length of the siege."
    },
    {
      "id": 61,
      "start": 287.32000732421875,
      "end": 291.8800048828125,
      "text": " But we find that as we come to the text of Scripture, the Bible gives us the record of"
    },
    {
      "id": 62,
      "start": 291.8800048828125,
      "end": 298.0799865722656,
      "text": " this particular siege on this particular day, this period of time and it says that he, Ben-Hadad,"
    },
    {
      "id": 63,
      "start": 298.0799865722656,
      "end": 304.0799865722656,
      "text": " the king of Syria, notice he gathered all his host and they came and they compassed"
    },
    {
      "id": 64,
      "start": 304.0799865722656,
      "end": 306.239990234375,
      "text": " the city, they laid siege against Samaria."
    },
    {
      "id": 65,
      "start": 306.239990234375,
      "end": 311.6400146484375,
      "text": " Now you'll recall with me that Samaria is the capital of Israel."
    },
    {
      "id": 66,
      "start": 311.6400146484375,
      "end": 317.8399963378906,
      "text": " When we speak about Israel in this particular era of history for the nation of Israel we're"
    },
    {
      "id": 67,
      "start": 317.8399963378906,
      "end": 323.239990234375,
      "text": " speaking of the ten tribes of the north, the northern kingdom as we would often refer to"
    },
    {
      "id": 68,
      "start": 323.239990234375,
      "end": 324.239990234375,
      "text": " it as."
    },
    {
      "id": 69,
      "start": 324.239990234375,
      "end": 330.3999938964844,
      "text": " Of course Jehoram is the king of Israel at this particular time in history and we will"
    },
    {
      "id": 70,
      "start": 330.3999938964844,
      "end": 336.8800048828125,
      "text": " look in just a few moments and see the wickedness that really would just describe the period"
    },
    {
      "id": 71,
      "start": 336.8800048828125,
      "end": 339.0400085449219,
      "text": " of time in which we're looking at."
    },
    {
      "id": 72,
      "start": 339.0400085449219,
      "end": 345.760009765625,
      "text": " And we find that this host of Syria that they laid siege against Samaria, the capital city"
    },
    {
      "id": 73,
      "start": 345.760009765625,
      "end": 350.2799987792969,
      "text": " of the northern kingdom of Israel."
    },
    {
      "id": 74,
      "start": 350.2799987792969,
      "end": 354.8399963378906,
      "text": " The Bible says that there was a great famine in Samaria to begin verse number 25."
    },
    {
      "id": 75,
      "start": 354.8399963378906,
      "end": 359.3599853515625,
      "text": " It would seem as we look at the passage of Scripture that the siege lasted certainly"
    },
    {
      "id": 76,
      "start": 359.3599853515625,
      "end": 364.79998779296875,
      "text": " for long enough to have a significant impact upon the city of Samaria."
    },
    {
      "id": 77,
      "start": 364.79998779296875,
      "end": 369.67999267578125,
      "text": " In other words, we would say this from a military perspective, the Syrians were successful in"
    },
    {
      "id": 78,
      "start": 369.67999267578125,
      "end": 371.4800109863281,
      "text": " doing what they sought to do."
    },
    {
      "id": 79,
      "start": 371.4800109863281,
      "end": 375.44000244140625,
      "text": " The Syrians, they had laid out, look, they didn't have to go and do battle and fight"
    },
    {
      "id": 80,
      "start": 375.44000244140625,
      "end": 377.79998779296875,
      "text": " with them, they're just going to besiege the city."
    },
    {
      "id": 81,
      "start": 377.79998779296875,
      "end": 381.5199890136719,
      "text": " They're going to cut out, nothing's coming in, nothing's going out and we're just going"
    },
    {
      "id": 82,
      "start": 381.5199890136719,
      "end": 382.5199890136719,
      "text": " to starve them."
    },
    {
      "id": 83,
      "start": 382.5199890136719,
      "end": 387.1199951171875,
      "text": " I mean that's what we're going to do and there's a great famine and they've been successful"
    },
    {
      "id": 84,
      "start": 387.1199951171875,
      "end": 389.8399963378906,
      "text": " at accomplishing what they want to accomplish."
    },
    {
      "id": 85,
      "start": 389.8399963378906,
      "end": 395.9599914550781,
      "text": " Eventually from a military perspective, from the mindset of the Ben-Hadad, the king of"
    },
    {
      "id": 86,
      "start": 395.9599914550781,
      "end": 400.0799865722656,
      "text": " Syria, and from that military perspective, really what they're looking for is for the"
    },
    {
      "id": 87,
      "start": 400.0799865722656,
      "end": 403.44000244140625,
      "text": " city to just go ahead and just surrender."
    },
    {
      "id": 88,
      "start": 403.44000244140625,
      "end": 406.55999755859375,
      "text": " And then they can go ahead and have whatever they want to have and do whatever they want"
    },
    {
      "id": 89,
      "start": 406.55999755859375,
      "end": 407.8800048828125,
      "text": " to do."
    },
    {
      "id": 90,
      "start": 407.8800048828125,
      "end": 413.0,
      "text": " And we find here that this siege, what Syria did to Samaria, they were successful."
    },
    {
      "id": 91,
      "start": 413.0,
      "end": 418.3999938964844,
      "text": " The record is given to us, but I want you to see really the result of the siege."
    },
    {
      "id": 92,
      "start": 418.3999938964844,
      "end": 422.0799865722656,
      "text": " As we look in verses 25 through 29, and I should say the results of the siege, I want"
    },
    {
      "id": 93,
      "start": 422.0799865722656,
      "end": 423.67999267578125,
      "text": " you to see what the Bible tells us."
    },
    {
      "id": 94,
      "start": 423.67999267578125,
      "end": 429.4800109863281,
      "text": " We see the record that they besieged Samaria, but look at what happens because of this."
    },
    {
      "id": 95,
      "start": 429.4800109863281,
      "end": 434.79998779296875,
      "text": " We've not been in a position, those of us that are gathered here, where we've been in"
    },
    {
      "id": 96,
      "start": 434.79998779296875,
      "end": 441.3599853515625,
      "text": " a city that has been besieged, where we've been in that situation, and we find that as"
    },
    {
      "id": 97,
      "start": 441.3599853515625,
      "end": 447.760009765625,
      "text": " we begin to read in verses 25 down through verse number 29, and read the results as God"
    },
    {
      "id": 98,
      "start": 447.760009765625,
      "end": 453.55999755859375,
      "text": " would tell us what happened, we really see the seriousness of the situation."
    },
    {
      "id": 99,
      "start": 453.55999755859375,
      "end": 462.1199951171875,
      "text": " I mean, this is a terrible, terrible situation, really, in certain regards, beyond human comprehension."
    },
    {
      "id": 100,
      "start": 462.1199951171875,
      "end": 468.1600036621094,
      "text": " Things that we probably would just not even, outside of Scripture, outside of reading it"
    },
    {
      "id": 101,
      "start": 468.1600036621094,
      "end": 471.6400146484375,
      "text": " and understanding that God's given us a true record, would be hard for us to comprehend,"
    },
    {
      "id": 102,
      "start": 471.6400146484375,
      "end": 475.4800109863281,
      "text": " especially as Americans, being in this country, and even with some of the things that we're"
    },
    {
      "id": 103,
      "start": 475.4800109863281,
      "end": 479.760009765625,
      "text": " dealing with right now, with COVID-19, it pales in comparison to what we're dealing"
    },
    {
      "id": 104,
      "start": 479.760009765625,
      "end": 480.760009765625,
      "text": " with this evening."
    },
    {
      "id": 105,
      "start": 480.760009765625,
      "end": 486.32000732421875,
      "text": " It pales in comparison to what other nations throughout history have had to deal with."
    },
    {
      "id": 106,
      "start": 486.32000732421875,
      "end": 488.0799865722656,
      "text": " We know that the record is true."
    },
    {
      "id": 107,
      "start": 488.0799865722656,
      "end": 492.3999938964844,
      "text": " When we read the results that are captured here, this, remember, is God's Word."
    },
    {
      "id": 108,
      "start": 492.3999938964844,
      "end": 494.7200012207031,
      "text": " God's Word is truth."
    },
    {
      "id": 109,
      "start": 494.7200012207031,
      "end": 496.1000061035156,
      "text": " Every single part of it."
    },
    {
      "id": 110,
      "start": 496.1000061035156,
      "end": 498.260009765625,
      "text": " Every single detail that God gives us, it's true."
    },
    {
      "id": 111,
      "start": 498.260009765625,
      "end": 500.1000061035156,
      "text": " Thy Word is truth."
    },
    {
      "id": 112,
      "start": 500.1000061035156,
      "end": 504.70001220703125,
      "text": " The psalmist said it's very pure, it's very true, and we find that the results are laid"
    },
    {
      "id": 113,
      "start": 504.70001220703125,
      "end": 505.70001220703125,
      "text": " out for us."
    },
    {
      "id": 114,
      "start": 505.70001220703125,
      "end": 510.5,
      "text": " We mentioned already, in verse number 25, there was a great famine in Samaria."
    },
    {
      "id": 115,
      "start": 510.5,
      "end": 515.5800170898438,
      "text": " Notice that this great famine is evidenced by a couple of things."
    },
    {
      "id": 116,
      "start": 515.5800170898438,
      "end": 520.739990234375,
      "text": " Number one, you see that the Bible says, and behold, they besieged it, notice, in verse"
    },
    {
      "id": 117,
      "start": 520.739990234375,
      "end": 528.1400146484375,
      "text": " number 25, until an ass's head was sold for fourscore pieces of silver."
    },
    {
      "id": 118,
      "start": 528.1400146484375,
      "end": 534.02001953125,
      "text": " Now, this donkey that is mentioned here in verse number 25, you have to understand he's"
    },
    {
      "id": 119,
      "start": 534.02001953125,
      "end": 541.1799926757812,
      "text": " an unclean animal, and the head of this particular animal was selling for 80 pieces of silver."
    },
    {
      "id": 120,
      "start": 541.1799926757812,
      "end": 543.1799926757812,
      "text": " That's pretty serious."
    },
    {
      "id": 121,
      "start": 543.1799926757812,
      "end": 549.219970703125,
      "text": " As far as the inflation, if you will, of the commodities, I've never had the brains of"
    },
    {
      "id": 122,
      "start": 549.9400024414062,
      "end": 554.3400268554688,
      "text": " a donkey for my dinner, and I hope that I never have to."
    },
    {
      "id": 123,
      "start": 554.3400268554688,
      "end": 557.02001953125,
      "text": " But for 80 pieces of silver, again, we see the inflation."
    },
    {
      "id": 124,
      "start": 557.02001953125,
      "end": 563.9400024414062,
      "text": " We see, really, the results of this siege that was laid against Samaria, the effectiveness,"
    },
    {
      "id": 125,
      "start": 563.9400024414062,
      "end": 568.780029296875,
      "text": " in a sense, of what Syria was doing to the city of Samaria."
    },
    {
      "id": 126,
      "start": 568.780029296875,
      "end": 573.719970703125,
      "text": " And we find that the Bible tells us not only was this donkey's head sold for fourscore"
    },
    {
      "id": 127,
      "start": 573.719970703125,
      "end": 578.1400146484375,
      "text": " pieces of silver, this unclean animal, but it says at the end of verse number 25, in"
    },
    {
      "id": 128,
      "start": 578.1400146484375,
      "end": 585.219970703125,
      "text": " the fourth part of a cab of doves dung for five pieces of silver."
    },
    {
      "id": 129,
      "start": 585.219970703125,
      "end": 588.8200073242188,
      "text": " And we don't even know what that particular measurement is."
    },
    {
      "id": 130,
      "start": 588.8200073242188,
      "end": 595.97998046875,
      "text": " There are some that have given their ideas and really assumptions as to the size, the"
    },
    {
      "id": 131,
      "start": 595.97998046875,
      "end": 596.97998046875,
      "text": " quantity."
    },
    {
      "id": 132,
      "start": 596.97998046875,
      "end": 597.97998046875,
      "text": " It's really uncertain."
    },
    {
      "id": 133,
      "start": 597.97998046875,
      "end": 599.97998046875,
      "text": " It's a very small portion, no doubt."
    },
    {
      "id": 0,
      "start": 599.97998046875,
      "end": 605.6999802589417,
      "text": " But it's doves dung was being sold for five pieces of silver"
    },
    {
      "id": 1,
      "start": 606.5399804115295,
      "end": 610.3799800872803,
      "text": " So we noticed this great famine and how it's evidence for us in verse 25"
    },
    {
      "id": 2,
      "start": 610.899980545044,
      "end": 614.0399808883667,
      "text": " by the cost of goods the commodities the"
    },
    {
      "id": 3,
      "start": 614.899980545044,
      "end": 620.0199813842773,
      "text": " Inflation if you will and in how there was just nothing notice that they were helpless"
    },
    {
      "id": 4,
      "start": 620.0199813842773,
      "end": 625.1799812316895,
      "text": " And I would say hopeless in verse 26 and 27 as we look at the text of Scripture"
    },
    {
      "id": 5,
      "start": 625.1799812316895,
      "end": 632.5799789428711,
      "text": " We see that there's a sense of helplessness and hopelessness the Bible tells us in verse number 26 and as the king of Israel"
    },
    {
      "id": 6,
      "start": 632.5799789428711,
      "end": 634.0199813842773,
      "text": " This is Jehoram"
    },
    {
      "id": 7,
      "start": 634.0199813842773,
      "end": 641.7799797058105,
      "text": " As he was passing by upon the wall there cried a woman unto him saying help my lord"
    },
    {
      "id": 8,
      "start": 641.7799797058105,
      "end": 646.97998046875,
      "text": " Oh king and so you understand that they the the woman that's mentioned here"
    },
    {
      "id": 9,
      "start": 646.97998046875,
      "end": 653.539981842041,
      "text": " we don't have her name, but we understand that she's calling to the king to Jehoram for help and"
    },
    {
      "id": 10,
      "start": 654.2599792480469,
      "end": 661.2599792480469,
      "text": " We find that it was a hopeless helpless situation and notice how he the king responds"
    },
    {
      "id": 11,
      "start": 661.2999801635742,
      "end": 666.6999816894531,
      "text": " He said if the Lord do not help thee whence shall I help thee?"
    },
    {
      "id": 12,
      "start": 668.0599822998047,
      "end": 674.9999771118164,
      "text": " She needed help the king was not capable of giving any help. He says to her in essence"
    },
    {
      "id": 13,
      "start": 676.2199783325195,
      "end": 679.859977722168,
      "text": " It's outside of my control. There's nothing that I can do"
    },
    {
      "id": 14,
      "start": 680.2599792480469,
      "end": 685.0199813842773,
      "text": " It would have to be the Lord that would help now, I'm thankful that we know the Lord God Almighty"
    },
    {
      "id": 15,
      "start": 685.1799774169922,
      "end": 688.3399810791016,
      "text": " I'm thankful even as I prayed this evening to start our service"
    },
    {
      "id": 16,
      "start": 688.6199798583984,
      "end": 693.3799819946289,
      "text": " Psalm 121 that the Lord would help us to lift up our eyes into the hills from whence cometh our help"
    },
    {
      "id": 17,
      "start": 693.7799835205078,
      "end": 697.2599792480469,
      "text": " Knowing that our help cometh from the Lord which made heaven and earth"
    },
    {
      "id": 18,
      "start": 697.2999801635742,
      "end": 704.2599792480469,
      "text": " I'm thankful that Hebrews 13 that the Bible says that we might boldly say the Lord is my helper and what a joy"
    },
    {
      "id": 19,
      "start": 704.6999816894531,
      "end": 709.97998046875,
      "text": " To know the help that God provides and throughout the scriptures we can see so often"
    },
    {
      "id": 20,
      "start": 710.3799819946289,
      "end": 714.1999816894531,
      "text": " How that he is a very present help in the time of trouble"
    },
    {
      "id": 21,
      "start": 714.1999816894531,
      "end": 717.4199829101562,
      "text": " He is able and what a blessing that is"
    },
    {
      "id": 22,
      "start": 717.4199829101562,
      "end": 724.8199768066406,
      "text": " Of course, we'd understand this particular time in Israel's history, especially in the northern kingdom under the reign of Jehoram"
    },
    {
      "id": 23,
      "start": 724.9399795532227,
      "end": 730.1799774169922,
      "text": " there was much idolatry false worship of idols that was taking place and"
    },
    {
      "id": 24,
      "start": 730.8199768066406,
      "end": 733.6999816894531,
      "text": " Here they're going to the king, you know, it's natural"
    },
    {
      "id": 25,
      "start": 734.2599792480469,
      "end": 737.97998046875,
      "text": " for people to look for help from somebody that they can see someone they"
    },
    {
      "id": 26,
      "start": 738.1399841308594,
      "end": 742.2999877929688,
      "text": " Expect to be able to help and here the king says there's nothing I can do"
    },
    {
      "id": 27,
      "start": 743.2599792480469,
      "end": 744.6199798583984,
      "text": " It's interesting"
    },
    {
      "id": 28,
      "start": 744.6199798583984,
      "end": 751.5799865722656,
      "text": " He said something similar if you remember in 2nd Kings chapter number 5 when the king of Syria had sent a letter"
    },
    {
      "id": 29,
      "start": 751.8999786376953,
      "end": 753.8999786376953,
      "text": " with regard to the situation"
    },
    {
      "id": 30,
      "start": 754.3799743652344,
      "end": 758.7399749755859,
      "text": " With Naaman and his leprosy and remember the king of Syria said hey"
    },
    {
      "id": 31,
      "start": 758.7399749755859,
      "end": 763.2199859619141,
      "text": " We're gonna send Naaman over there so you can take care of them and Jehoram's like who am I like?"
    },
    {
      "id": 32,
      "start": 763.2199859619141,
      "end": 764.9399871826172,
      "text": " What am I gonna do about this?"
    },
    {
      "id": 33,
      "start": 764.9399871826172,
      "end": 770.6199798583984,
      "text": " In fact, he says the king of Israel says when he received the letter in 2nd Kings chapter number 5"
    },
    {
      "id": 34,
      "start": 770.6199798583984,
      "end": 772.5399780273438,
      "text": " He says behold I have"
    },
    {
      "id": 35,
      "start": 772.5399780273438,
      "end": 773.97998046875,
      "text": " Excuse me verse number 7"
    },
    {
      "id": 36,
      "start": 773.97998046875,
      "end": 780.3799743652344,
      "text": " Am I God to kill and to make alive that this man doth send unto me to recover a man of his leprosy and now in"
    },
    {
      "id": 37,
      "start": 780.3799743652344,
      "end": 784.0599822998047,
      "text": " Chapter number 6 this woman is saying to the king help us"
    },
    {
      "id": 38,
      "start": 784.5799865722656,
      "end": 787.9399871826172,
      "text": " He says I'm not able notice what he says at the end of verse number 27"
    },
    {
      "id": 39,
      "start": 788.1399841308594,
      "end": 794.1399841308594,
      "text": " He says out of the barn floor or out of the winepress in other words there was nothing"
    },
    {
      "id": 40,
      "start": 794.8999786376953,
      "end": 795.9399871826172,
      "text": " the"
    },
    {
      "id": 41,
      "start": 795.9399871826172,
      "end": 803.0599822998047,
      "text": " Syrians had laid siege against Samaria for whatever duration of time that has passed at this particular point"
    },
    {
      "id": 42,
      "start": 803.0599822998047,
      "end": 807.7399749755859,
      "text": " And they were at the end of themselves. They had no hope they had no help"
    },
    {
      "id": 43,
      "start": 807.7399749755859,
      "end": 811.6599731445312,
      "text": " There were no resources that were left nothing that was available to them"
    },
    {
      "id": 44,
      "start": 811.6599731445312,
      "end": 817.3399810791016,
      "text": " And we find that as we continue to go through the text and see the results of this siege"
    },
    {
      "id": 45,
      "start": 817.5399780273438,
      "end": 822.2999877929688,
      "text": " That we see the tragic details that are given to us in verses 28 and 29"
    },
    {
      "id": 46,
      "start": 823.3799743652344,
      "end": 827.3799743652344,
      "text": " Behavior that really is beyond our comprehension"
    },
    {
      "id": 47,
      "start": 828.7799835205078,
      "end": 834.1799774169922,
      "text": " We know that it's true because God's Word says that it is and I'll be honest with you this evening"
    },
    {
      "id": 48,
      "start": 834.1799774169922,
      "end": 837.8999786376953,
      "text": " this is a very sad portion of Scripture to see the level of"
    },
    {
      "id": 49,
      "start": 838.4199829101562,
      "end": 840.1799774169922,
      "text": " just"
    },
    {
      "id": 50,
      "start": 840.1799774169922,
      "end": 842.8199768066406,
      "text": " wickedness I would call it to see how"
    },
    {
      "id": 51,
      "start": 843.2599792480469,
      "end": 850.9399871826172,
      "text": " Just severe the situation and circumstances were the Bible says this in verse number 28 and the king said unto her what a let thee"
    },
    {
      "id": 52,
      "start": 850.9399871826172,
      "end": 852.9399871826172,
      "text": " And she answered"
    },
    {
      "id": 53,
      "start": 853.2999877929688,
      "end": 855.2999877929688,
      "text": " This woman said unto me"
    },
    {
      "id": 54,
      "start": 855.6599731445312,
      "end": 861.4599914550781,
      "text": " Give thy son that we may eat him today, and we will eat my son"
    },
    {
      "id": 55,
      "start": 862.1399841308594,
      "end": 868.4999694824219,
      "text": " Tomorrow I can't even imagine saying that I can't imagine being in that mindset"
    },
    {
      "id": 56,
      "start": 868.4999694824219,
      "end": 875.8599853515625,
      "text": " The starvation has been so severe because of the siege that's been laid against the city nothing coming in nothing going out"
    },
    {
      "id": 57,
      "start": 875.9399719238281,
      "end": 882.5399780273438,
      "text": " and we find that there's nothing left and we've mentioned already about the the head of the the donkey and"
    },
    {
      "id": 58,
      "start": 882.9399719238281,
      "end": 889.8999938964844,
      "text": " Those things that would give us an evidence of how bad this siege was and we find that these two women"
    },
    {
      "id": 59,
      "start": 889.8999938964844,
      "end": 896.0599670410156,
      "text": " They made an agreement that they would kill and eat the the one son today and tomorrow"
    },
    {
      "id": 60,
      "start": 896.3399658203125,
      "end": 900.8999938964844,
      "text": " They would kill and eat the other son cannibalism, this is horrible, this is wicked"
    },
    {
      "id": 61,
      "start": 901.9399719238281,
      "end": 908.0199890136719,
      "text": " It shows us the seriousness the severity of the siege the seriousness of the situation"
    },
    {
      "id": 62,
      "start": 908.739990234375,
      "end": 915.0999755859375,
      "text": " Notice what she says she mentions the agreement that was made in verse 28 between her and this other woman in verse number 29"
    },
    {
      "id": 63,
      "start": 915.0999755859375,
      "end": 919.8599853515625,
      "text": " Notice what she says so we boiled my son and did eat him"
    },
    {
      "id": 64,
      "start": 920.2599792480469,
      "end": 926.0999755859375,
      "text": " And I said unto her on the next day give thy son that we may eat him and"
    },
    {
      "id": 65,
      "start": 926.5399780273438,
      "end": 929.239990234375,
      "text": " She hath hid her son"
    },
    {
      "id": 66,
      "start": 931.7799682617188,
      "end": 937.8199768066406,
      "text": " My heart just is saddened when I read those verses of Scripture I can't imagine"
    },
    {
      "id": 67,
      "start": 938.8199768066406,
      "end": 940.8199768066406,
      "text": " the the level of"
    },
    {
      "id": 68,
      "start": 941.1799926757812,
      "end": 943.7799682617188,
      "text": " despair and just desperation these"
    },
    {
      "id": 69,
      "start": 944.6199951171875,
      "end": 946.6199951171875,
      "text": " Inhabitants of Samaria were in"
    },
    {
      "id": 70,
      "start": 946.6599731445312,
      "end": 952.8199768066406,
      "text": " We find that the Bible gives us not only the record of the siege the results of the siege"
    },
    {
      "id": 71,
      "start": 952.8199768066406,
      "end": 959.219970703125,
      "text": " I want you to notice as we look at the remainder of chapter number six this evening the response of King Jehoram"
    },
    {
      "id": 72,
      "start": 959.8199768066406,
      "end": 961.8199768066406,
      "text": " Now you notice that the king"
    },
    {
      "id": 73,
      "start": 962.5799865722656,
      "end": 968.8599853515625,
      "text": " The Bible tells us that he was passing by upon the wall in verse 26 and that's where he kind of get his interaction in"
    },
    {
      "id": 74,
      "start": 968.8599853515625,
      "end": 970.8599853515625,
      "text": " this particular"
    },
    {
      "id": 75,
      "start": 970.8599853515625,
      "end": 977.97998046875,
      "text": " Situation as it's unfolding with the siege of the Syrians against the city of Samaria and he's receiving this word from this woman"
    },
    {
      "id": 76,
      "start": 977.97998046875,
      "end": 982.2599792480469,
      "text": " Initially she asked for help and then gives her gives her situation"
    },
    {
      "id": 77,
      "start": 982.2599792480469,
      "end": 987.6599731445312,
      "text": " Explains it and it says in verse number 30 as we begin to see the response of King Jehoram"
    },
    {
      "id": 78,
      "start": 987.6599731445312,
      "end": 993.8599853515625,
      "text": " the Bible says it came to pass when the king heard the words of the woman that he rent his clothes and"
    },
    {
      "id": 79,
      "start": 993.8999938964844,
      "end": 998.4599914550781,
      "text": " He passed by upon the wall and the people looked and behold. He had sackcloth"
    },
    {
      "id": 80,
      "start": 998.97998046875,
      "end": 1000.1399841308594,
      "text": " within"
    },
    {
      "id": 81,
      "start": 1000.1399841308594,
      "end": 1001.7799682617188,
      "text": " upon his flesh"
    },
    {
      "id": 82,
      "start": 1001.7799682617188,
      "end": 1005.739990234375,
      "text": " We find that there was a reaction a response of despair"
    },
    {
      "id": 83,
      "start": 1006.2599792480469,
      "end": 1011.0599670410156,
      "text": " really, if you think about the sackcloth that is mentioned perhaps even a level of humility and"
    },
    {
      "id": 84,
      "start": 1011.5799865722656,
      "end": 1019.2599792480469,
      "text": " understanding the the the seriousness of the situation and it says that he rent his clothes and he passed by upon the wall and"
    },
    {
      "id": 85,
      "start": 1019.2599792480469,
      "end": 1020.8599853515625,
      "text": " the people looked"
    },
    {
      "id": 86,
      "start": 1020.8599853515625,
      "end": 1024.9399719238281,
      "text": " This was something that was done publicly. This was something that the people of Samaria"
    },
    {
      "id": 87,
      "start": 1025.3399658203125,
      "end": 1028.5399780273438,
      "text": " The the people of Israel there would have seen King Jehoram"
    },
    {
      "id": 88,
      "start": 1029.0999755859375,
      "end": 1033.8999938964844,
      "text": " Responding in this manner and I believe that it reveals to us his level of desperation"
    },
    {
      "id": 89,
      "start": 1034.2999877929688,
      "end": 1038.2599792480469,
      "text": " With regard to the scenario the the seeds that they were dealing with"
    },
    {
      "id": 90,
      "start": 1039.2599792480469,
      "end": 1041.2599792480469,
      "text": " But notice what he says"
    },
    {
      "id": 91,
      "start": 1042.0599670410156,
      "end": 1048.219970703125,
      "text": " We see how he responds in verse number 30, but I want you to notice what he says in verse number 31"
    },
    {
      "id": 92,
      "start": 1048.4199829101562,
      "end": 1051.2999877929688,
      "text": " He said go excuse me"
    },
    {
      "id": 93,
      "start": 1051.8599853515625,
      "end": 1057.0199890136719,
      "text": " God do so and more also to me if the head of Elisha"
    },
    {
      "id": 94,
      "start": 1057.8199768066406,
      "end": 1065.2999877929688,
      "text": " The son of Shaphat shall stand on him this day. You know, he's saying in verse number 31. We're gonna kill Elisha"
    },
    {
      "id": 95,
      "start": 1066.7799682617188,
      "end": 1074.0199890136719,
      "text": " Let's kill the man of God as if he's the culprit as if he's the reason for all that's taking place"
    },
    {
      "id": 96,
      "start": 1074.6999816894531,
      "end": 1082.0199890136719,
      "text": " And perhaps it's a thought by which he had experienced the or at least heard of the miracles of"
    },
    {
      "id": 97,
      "start": 1082.5799865722656,
      "end": 1089.0599670410156,
      "text": " Elisha the the miracles of God that God wrought through Elisha the provision and various other things and we find"
    },
    {
      "id": 98,
      "start": 1089.2599792480469,
      "end": 1092.6199951171875,
      "text": " of course that he was aware of the healing of Naaman and"
    },
    {
      "id": 99,
      "start": 1092.8599853515625,
      "end": 1095.8999938964844,
      "text": " He saw what happened with the Syrians that came after"
    },
    {
      "id": 100,
      "start": 1096.2999877929688,
      "end": 1103.4199829101562,
      "text": " Elisha and Dothan in the previous passage of Scripture and now he concludes after he hears what's taking place"
    },
    {
      "id": 101,
      "start": 1103.4199829101562,
      "end": 1108.9599914550781,
      "text": " He's experiencing this great siege against the city. He's he's irrational"
    },
    {
      "id": 102,
      "start": 1109.8599853515625,
      "end": 1112.97998046875,
      "text": " He determines what we're gonna do is kill Elisha"
    },
    {
      "id": 103,
      "start": 1113.6199951171875,
      "end": 1120.5799560546875,
      "text": " He says God do so and more also to me if the head of Elisha the son of Shaphat shall stand on him"
    },
    {
      "id": 104,
      "start": 1120.8599853515625,
      "end": 1124.9400024414062,
      "text": " This day it's very interesting because Jehoram is the son of"
    },
    {
      "id": 105,
      "start": 1125.739990234375,
      "end": 1132.8999633789062,
      "text": " wicked Ahab and wicked Jezebel and you remember that Jezebel said in first Kings with regard to"
    },
    {
      "id": 106,
      "start": 1133.2999877929688,
      "end": 1139.3800048828125,
      "text": " Elijah in first Kings chapter number 18, right actually it's in chapter number 19 that she says"
    },
    {
      "id": 107,
      "start": 1140.219970703125,
      "end": 1146.260009765625,
      "text": " After she hears word about Elisha slaying the prophets of Baal. She says this"
    },
    {
      "id": 108,
      "start": 1146.97998046875,
      "end": 1153.5,
      "text": " Let the gobs do to me and more also if I make not thy life as the life of one of them by tomorrow"
    },
    {
      "id": 109,
      "start": 1154.0599975585938,
      "end": 1155.739990234375,
      "text": " about this time"
    },
    {
      "id": 110,
      "start": 1155.739990234375,
      "end": 1162.1399536132812,
      "text": " That was in first Kings 19 and verse number 2 when Jezebel is speaking about killing the man of God"
    },
    {
      "id": 111,
      "start": 1162.8599853515625,
      "end": 1166.8999633789062,
      "text": " Elijah now Jehoram is speaking about killing the man of God"
    },
    {
      "id": 112,
      "start": 1167.5399780273438,
      "end": 1172.0999755859375,
      "text": " Elisha here in 2nd Kings chapter number 6 because of this great famine"
    },
    {
      "id": 113,
      "start": 1172.0999755859375,
      "end": 1177.5599975585938,
      "text": " That is the result of the the siege that the Syrians have laid against the city of Samaria"
    },
    {
      "id": 114,
      "start": 1178.5599975585938,
      "end": 1182.6799926757812,
      "text": " The Bible tells us in verse number 32, but Elisha sat in his house"
    },
    {
      "id": 115,
      "start": 1183.0999755859375,
      "end": 1187.239990234375,
      "text": " now it's kind of interesting as I notice the text of Scripture and kind of see the"
    },
    {
      "id": 116,
      "start": 1187.4599609375,
      "end": 1191.0399780273438,
      "text": " the way in which the writer would give us some insight as to maybe the"
    },
    {
      "id": 117,
      "start": 1191.7999877929688,
      "end": 1196.0399780273438,
      "text": " The level of reaction of Elisha and really the calm demeanor"
    },
    {
      "id": 118,
      "start": 1196.5599975585938,
      "end": 1200.0799560546875,
      "text": " If you will of Elisha the man of God, this is the"
    },
    {
      "id": 0,
      "start": 1200.0799560546875,
      "end": 1205.9999561309814,
      "text": " he sat in his house, and the elders sat with him, and the king sent a man from before him.\""
    },
    {
      "id": 1,
      "start": 1205.9999561309814,
      "end": 1208.9199562072754,
      "text": " Why did the king send a man?"
    },
    {
      "id": 2,
      "start": 1208.9199562072754,
      "end": 1213.2399559020996,
      "text": " Because he wanted to go get Elisha to bring him back, right?"
    },
    {
      "id": 3,
      "start": 1213.2399559020996,
      "end": 1215.1199560165405,
      "text": " He was going to kill him, remember?"
    },
    {
      "id": 4,
      "start": 1215.1199560165405,
      "end": 1218.1599559783936,
      "text": " He says that in verse number 31."
    },
    {
      "id": 5,
      "start": 1218.1599559783936,
      "end": 1223.8399562835693,
      "text": " So we find that the Bible says that, see, in verse number 32, it says,"
    },
    {
      "id": 6,
      "start": 1223.8399562835693,
      "end": 1226.3199558258057,
      "text": " He said to the elders, Elisha says to the elders,"
    },
    {
      "id": 7,
      "start": 1226.3199558258057,
      "end": 1232.879955291748,
      "text": " See ye how this son of a murderer hath sent to take away mine head."
    },
    {
      "id": 8,
      "start": 1232.879955291748,
      "end": 1241.1999549865723,
      "text": " Isn't it interesting, isn't it just encouraging, how God allowed Elisha to know what was going on?"
    },
    {
      "id": 9,
      "start": 1241.1999549865723,
      "end": 1246.719955444336,
      "text": " Elisha was the one that had been informing King Jehoram of the plans of Ben-Hadad during the battle."
    },
    {
      "id": 10,
      "start": 1246.719955444336,
      "end": 1249.0799560546875,
      "text": " This is recorded earlier in chapter number 6."
    },
    {
      "id": 11,
      "start": 1249.0799560546875,
      "end": 1253.0399551391602,
      "text": " And now we find that Jehoram says, we're going to kill Elisha,"
    },
    {
      "id": 12,
      "start": 1253.0399551391602,
      "end": 1257.3999557495117,
      "text": " but God allows Elisha to have this knowledge of what's going on."
    },
    {
      "id": 13,
      "start": 1257.3999557495117,
      "end": 1258.5999565124512,
      "text": " And then he continues and says,"
    },
    {
      "id": 14,
      "start": 1258.5999565124512,
      "end": 1262.719955444336,
      "text": " Look, when the messenger cometh, shut the door, and hold him fast at the door,"
    },
    {
      "id": 15,
      "start": 1262.719955444336,
      "end": 1266.1999588012695,
      "text": " is not the sound of his master's feet behind him?"
    },
    {
      "id": 16,
      "start": 1266.1999588012695,
      "end": 1273.0399551391602,
      "text": " So in other words, Elisha understands that this messenger has been sent to apprehend him for the purpose of murder."
    },
    {
      "id": 17,
      "start": 1273.0399551391602,
      "end": 1278.3999557495117,
      "text": " And he says, but his master Jehoram, his feet are behind him, he's coming as well."
    },
    {
      "id": 18,
      "start": 1278.439956665039,
      "end": 1279.839958190918,
      "text": " In verse 33,"
    },
    {
      "id": 19,
      "start": 1279.839958190918,
      "end": 1284.1999588012695,
      "text": " And while he yet talked with them, behold, the messenger came down unto him, and he said,"
    },
    {
      "id": 20,
      "start": 1284.1999588012695,
      "end": 1289.0399551391602,
      "text": " Behold, this evil is of the Lord. What should I wait for the Lord any longer?"
    },
    {
      "id": 21,
      "start": 1289.0399551391602,
      "end": 1293.7599563598633,
      "text": " And it's interesting in verse number 33, as you look at that phraseology, really the dialogue,"
    },
    {
      "id": 22,
      "start": 1293.7599563598633,
      "end": 1298.439956665039,
      "text": " because we see that chapter 7 begins with Elisha responding."
    },
    {
      "id": 23,
      "start": 1298.439956665039,
      "end": 1302.9199523925781,
      "text": " And we'll get into that next week, just very difficult to deal with all of it in one lesson."
    },
    {
      "id": 24,
      "start": 1302.9199523925781,
      "end": 1306.6399536132812,
      "text": " And we'll deal with the 7th chapter next Wednesday evening."
    },
    {
      "id": 25,
      "start": 1307.0399551391602,
      "end": 1310.6799545288086,
      "text": " But Jehoram is speaking to Elisha and says,"
    },
    {
      "id": 26,
      "start": 1310.6799545288086,
      "end": 1315.0799560546875,
      "text": " Behold, this evil is of the Lord. What should I wait for the Lord any longer?"
    },
    {
      "id": 27,
      "start": 1315.0799560546875,
      "end": 1321.9999542236328,
      "text": " And I believe that as you look at the context and you understand why Jehoram would say this to Elisha,"
    },
    {
      "id": 28,
      "start": 1321.9999542236328,
      "end": 1325.8799591064453,
      "text": " and then Elisha would respond in chapter 7, in verse number 1, he says,"
    },
    {
      "id": 29,
      "start": 1325.8799591064453,
      "end": 1330.439956665039,
      "text": " Hear ye the word of the Lord, thus saith the Lord tomorrow about this time."
    },
    {
      "id": 30,
      "start": 1330.439956665039,
      "end": 1335.2399597167969,
      "text": " And he's speaking of really the deliverance of God and how God was going to work miraculously."
    },
    {
      "id": 31,
      "start": 1335.2399597167969,
      "end": 1338.1599578857422,
      "text": " Again, the subject for next Wednesday evening."
    },
    {
      "id": 32,
      "start": 1338.1599578857422,
      "end": 1345.199951171875,
      "text": " But it would seem evident that Elisha had in some way counseled Jehoram"
    },
    {
      "id": 33,
      "start": 1345.199951171875,
      "end": 1353.5599517822266,
      "text": " with regard to the reason for this particular siege that they were experiencing under the hands of the Syrians"
    },
    {
      "id": 34,
      "start": 1353.5599517822266,
      "end": 1359.7599487304688,
      "text": " was because of the evil of the wickedness of the nation of Israel."
    },
    {
      "id": 35,
      "start": 1359.7599487304688,
      "end": 1363.199951171875,
      "text": " And he says, What should I wait for the Lord any longer?"
    },
    {
      "id": 36,
      "start": 1363.199951171875,
      "end": 1369.5599517822266,
      "text": " Perhaps Elisha had encouraged him that God would work and God would deliver,"
    },
    {
      "id": 37,
      "start": 1369.5599517822266,
      "end": 1374.1199493408203,
      "text": " but he's ready to surrender. He's ready to be done with this."
    },
    {
      "id": 38,
      "start": 1374.1199493408203,
      "end": 1378.2399597167969,
      "text": " And we find that God, no doubt, is working."
    },
    {
      "id": 39,
      "start": 1378.2399597167969,
      "end": 1384.1599578857422,
      "text": " And it's interesting to understand as we look at the scriptures and deal with these various things that take place"
    },
    {
      "id": 40,
      "start": 1384.1599578857422,
      "end": 1388.9999542236328,
      "text": " and really the terrible situation in chapter number 6 at the end of the passage,"
    },
    {
      "id": 41,
      "start": 1388.9999542236328,
      "end": 1392.4799499511719,
      "text": " dealing with this siege against Samaria."
    },
    {
      "id": 42,
      "start": 1392.4799499511719,
      "end": 1398.7999572753906,
      "text": " But you understand that the nation of Israel at this time, as I mentioned earlier in the message tonight,"
    },
    {
      "id": 43,
      "start": 1398.7999572753906,
      "end": 1401.7599487304688,
      "text": " they were really idolatrous people."
    },
    {
      "id": 44,
      "start": 1401.7599487304688,
      "end": 1407.4799499511719,
      "text": " They were serving false gods, idols, and the plurality of their gods."
    },
    {
      "id": 45,
      "start": 1407.4799499511719,
      "end": 1412.6799621582031,
      "text": " And God was bringing a level of judgment against them because of their wickedness."
    },
    {
      "id": 46,
      "start": 1412.6799621582031,
      "end": 1419.8799591064453,
      "text": " And no doubt God was going to humble them and he was going to show his power."
    },
    {
      "id": 47,
      "start": 1419.8799591064453,
      "end": 1423.3599548339844,
      "text": " And he does just that in chapter number 7. He shows his power."
    },
    {
      "id": 48,
      "start": 1423.3599548339844,
      "end": 1430.5999603271484,
      "text": " I'm not sure all to whom the nation of Israel, Samaria as a city, were looking to help for."
    },
    {
      "id": 49,
      "start": 1430.5999603271484,
      "end": 1434.9999542236328,
      "text": " There's no record in our text of scripture that they cry out to God for help."
    },
    {
      "id": 50,
      "start": 1434.9999542236328,
      "end": 1438.2799530029297,
      "text": " There is the record that they go to the king for help."
    },
    {
      "id": 51,
      "start": 1438.5999603271484,
      "end": 1445.8799591064453,
      "text": " But even in that situation, he doesn't cry out to God, at least as not as recorded in the scriptures."
    },
    {
      "id": 52,
      "start": 1445.8799591064453,
      "end": 1449.5599517822266,
      "text": " Notice this, and we'll close with this in 2 Kings 3,"
    },
    {
      "id": 53,
      "start": 1449.5599517822266,
      "end": 1456.199951171875,
      "text": " just to remind you of the character of Jehoram and also of the wickedness"
    },
    {
      "id": 54,
      "start": 1456.199951171875,
      "end": 1462.43994140625,
      "text": " that would describe this particular era of history in the nation of Israel."
    },
    {
      "id": 55,
      "start": 1462.43994140625,
      "end": 1464.3599548339844,
      "text": " In 2 Kings 3, in verse number 1, the Bible says,"
    },
    {
      "id": 56,
      "start": 1464.3599548339844,
      "end": 1468.3599548339844,
      "text": " Now Jehoram, the son of Ahab, began to reign over Israel and Samaria"
    },
    {
      "id": 57,
      "start": 1468.3599548339844,
      "end": 1472.5999450683594,
      "text": " in the eighteenth year of Jehoshaphat, king of Judah, and reigned twelve years."
    },
    {
      "id": 58,
      "start": 1472.5999450683594,
      "end": 1477.6399536132812,
      "text": " We won't take a lot of time here, but you'll remember that Jehoshaphat, the king of Judah,"
    },
    {
      "id": 59,
      "start": 1477.6399536132812,
      "end": 1481.5599670410156,
      "text": " he would be categorized basically as being a good king."
    },
    {
      "id": 60,
      "start": 1481.5599670410156,
      "end": 1484.3599548339844,
      "text": " Judah had several good kings throughout their history,"
    },
    {
      "id": 61,
      "start": 1484.3599548339844,
      "end": 1487.0799560546875,
      "text": " and Jehoshaphat would have been one of them."
    },
    {
      "id": 62,
      "start": 1487.0799560546875,
      "end": 1491.7999572753906,
      "text": " But yet up in the northern kingdom in Israel, Jehoram is reigning,"
    },
    {
      "id": 63,
      "start": 1491.7999572753906,
      "end": 1494.199951171875,
      "text": " and the Bible tells us of him in verse number 2,"
    },
    {
      "id": 64,
      "start": 1494.199951171875,
      "end": 1496.8399658203125,
      "text": " that he wrought evil in the sight of the Lord,"
    },
    {
      "id": 65,
      "start": 1496.8399658203125,
      "end": 1499.3199462890625,
      "text": " but not like his father, not like his mother,"
    },
    {
      "id": 66,
      "start": 1499.3199462890625,
      "end": 1501.9599609375,
      "text": " for he put away the image of Baal that his father had made."
    },
    {
      "id": 67,
      "start": 1501.9599609375,
      "end": 1503.3199462890625,
      "text": " But notice what it says in verse 3,"
    },
    {
      "id": 68,
      "start": 1503.3199462890625,
      "end": 1507.6399536132812,
      "text": " Nevertheless, he cleaved unto the sons of Jeroboam, the son of Nebat,"
    },
    {
      "id": 69,
      "start": 1507.6399536132812,
      "end": 1512.1199645996094,
      "text": " which made Israel to sin, he departed not therefrom."
    },
    {
      "id": 70,
      "start": 1512.1199645996094,
      "end": 1514.9999694824219,
      "text": " And if you go back, we don't have time to deal with it this evening,"
    },
    {
      "id": 71,
      "start": 1514.9999694824219,
      "end": 1518.1199645996094,
      "text": " but if you go back to 1 Kings, maybe jot it down in your notes,"
    },
    {
      "id": 72,
      "start": 1518.1199645996094,
      "end": 1522.2799682617188,
      "text": " in 1 Kings chapter number 12, in verses 25 through 33,"
    },
    {
      "id": 73,
      "start": 1522.2799682617188,
      "end": 1526.43994140625,
      "text": " you will find described for you in that passage of scripture,"
    },
    {
      "id": 74,
      "start": 1526.43994140625,
      "end": 1528.2799682617188,
      "text": " the sins of Jeroboam."
    },
    {
      "id": 75,
      "start": 1529.1599426269531,
      "end": 1533.6399536132812,
      "text": " You will find that there at the time after Solomon's reign,"
    },
    {
      "id": 76,
      "start": 1533.6399536132812,
      "end": 1537.4799499511719,
      "text": " when you have Rehoboam, king of Judah, Jeroboam, king of Israel,"
    },
    {
      "id": 77,
      "start": 1537.4799499511719,
      "end": 1541.8799438476562,
      "text": " you will find how that he introduced idolatrous worship,"
    },
    {
      "id": 78,
      "start": 1541.8799438476562,
      "end": 1545.3999633789062,
      "text": " false worship, all of the new feast days,"
    },
    {
      "id": 79,
      "start": 1545.3999633789062,
      "end": 1547.9599609375,
      "text": " and all of those things that they put in place,"
    },
    {
      "id": 80,
      "start": 1547.9599609375,
      "end": 1552.2799682617188,
      "text": " so that people would not return to Jerusalem, which was down in Judah,"
    },
    {
      "id": 81,
      "start": 1552.2799682617188,
      "end": 1554.9199523925781,
      "text": " and then perhaps not come back to him."
    },
    {
      "id": 82,
      "start": 1554.9199523925781,
      "end": 1557.719970703125,
      "text": " And so Jeroboam introduced a bunch of those things,"
    },
    {
      "id": 83,
      "start": 1557.719970703125,
      "end": 1562.9999694824219,
      "text": " and you find that detailed in 1 Kings 12, verses 25 through 33."
    },
    {
      "id": 84,
      "start": 1562.9999694824219,
      "end": 1564.5199584960938,
      "text": " As we look at chapter number 6,"
    },
    {
      "id": 85,
      "start": 1564.5199584960938,
      "end": 1568.3599548339844,
      "text": " and we conclude this passage as we prepare for chapter number 7"
    },
    {
      "id": 86,
      "start": 1568.3599548339844,
      "end": 1569.6399536132812,
      "text": " for next Wednesday evening,"
    },
    {
      "id": 87,
      "start": 1570.199951171875,
      "end": 1572.7599487304688,
      "text": " we must understand in this passage of scripture"
    },
    {
      "id": 88,
      "start": 1572.7599487304688,
      "end": 1574.9199523925781,
      "text": " that God is giving us this record,"
    },
    {
      "id": 89,
      "start": 1574.9199523925781,
      "end": 1577.5599670410156,
      "text": " and it's a terrible time in Israel's history."
    },
    {
      "id": 90,
      "start": 1578.0399475097656,
      "end": 1580.43994140625,
      "text": " A terrible time during the reign of Jehoram."
    },
    {
      "id": 91,
      "start": 1580.43994140625,
      "end": 1584.5199584960938,
      "text": " I mean, the details, the description of what's happening"
    },
    {
      "id": 92,
      "start": 1584.5199584960938,
      "end": 1589.7999572753906,
      "text": " during this time in which the Syrians besieged Samaria is terrible."
    },
    {
      "id": 93,
      "start": 1590.3599548339844,
      "end": 1592.5199584960938,
      "text": " It's beyond, at certain levels,"
    },
    {
      "id": 94,
      "start": 1592.5199584960938,
      "end": 1597.1599426269531,
      "text": " our ability to really comprehend that things would go that low"
    },
    {
      "id": 95,
      "start": 1597.1599426269531,
      "end": 1600.9199523925781,
      "text": " and be that difficult and that problematic."
    },
    {
      "id": 96,
      "start": 1600.9199523925781,
      "end": 1603.7999572753906,
      "text": " But we find that as we come to chapter number 7"
    },
    {
      "id": 97,
      "start": 1603.7999572753906,
      "end": 1606.9999694824219,
      "text": " that Elisha stands up with great power and great boldness"
    },
    {
      "id": 98,
      "start": 1606.9999694824219,
      "end": 1609.5599670410156,
      "text": " and says, hear the word of the Lord."
    },
    {
      "id": 99,
      "start": 1609.5599670410156,
      "end": 1611.7999572753906,
      "text": " I'm so thankful that our God is able."
    },
    {
      "id": 100,
      "start": 1611.7999572753906,
      "end": 1614.5999450683594,
      "text": " And our God works miraculously in chapter number 7."
    },
    {
      "id": 101,
      "start": 1614.5999450683594,
      "end": 1618.199951171875,
      "text": " I look forward to being able to study it with you next Wednesday evening"
    },
    {
      "id": 102,
      "start": 1618.199951171875,
      "end": 1621.5599670410156,
      "text": " and looking at what God does and how God works."
    },
    {
      "id": 103,
      "start": 1621.5599670410156,
      "end": 1624.43994140625,
      "text": " But we must understand that we need to turn to the Lord,"
    },
    {
      "id": 104,
      "start": 1624.43994140625,
      "end": 1626.9199523925781,
      "text": " that we need to keep our eyes upon him,"
    },
    {
      "id": 105,
      "start": 1626.9199523925781,
      "end": 1627.8799438476562,
      "text": " that he is able."
    },
    {
      "id": 106,
      "start": 1628.8399658203125,
      "end": 1629.9599609375,
      "text": " He is able."
    },
    {
      "id": 107,
      "start": 1629.9599609375,
      "end": 1631.719970703125,
      "text": " And what a great God that we serve."
    },
    {
      "id": 108,
      "start": 1631.719970703125,
      "end": 1634.1199645996094,
      "text": " He is able to do exceeding abundantly above"
    },
    {
      "id": 109,
      "start": 1634.1199645996094,
      "end": 1638.3599548339844,
      "text": " all that we ask or think, according to Ephesians 3 and verse number 20."
    },
    {
      "id": 110,
      "start": 1638.9999694824219,
      "end": 1642.2799682617188,
      "text": " The Syrians besieged Samaria."
    },
    {
      "id": 111,
      "start": 1642.2799682617188,
      "end": 1647.3999633789062,
      "text": " And we find that the people there in northern Israel,"
    },
    {
      "id": 112,
      "start": 1647.3999633789062,
      "end": 1649.2399597167969,
      "text": " they were suffering greatly."
    },
    {
      "id": 113,
      "start": 1649.2399597167969,
      "end": 1653.3199462890625,
      "text": " And God was getting ready to work miraculously in 2 Kings chapter 7."
    },
    {
      "id": 114,
      "start": 1653.3199462890625,
      "end": 1654.199951171875,
      "text": " Let's pray."
    },
    {
      "id": 115,
      "start": 1654.199951171875,
      "end": 1654.9999694824219,
      "text": " Father, we love you."
    },
    {
      "id": 116,
      "start": 1654.9999694824219,
      "end": 1656.199951171875,
      "text": " We thank you for loving us."
    },
    {
      "id": 117,
      "start": 1656.199951171875,
      "end": 1658.199951171875,
      "text": " Thank you for thy word, the truth of thy word."
    },
    {
      "id": 118,
      "start": 1658.199951171875,
      "end": 1660.199951171875,
      "text": " We thank you for the power of your word."
    },
    {
      "id": 119,
      "start": 1660.199951171875,
      "end": 1662.8399658203125,
      "text": " Lord, I pray that even as we would understand this"
    },
    {
      "id": 120,
      "start": 1663.4799499511719,
      "end": 1665.5599670410156,
      "text": " just terrible time in Israel's history,"
    },
    {
      "id": 121,
      "start": 1666.199951171875,
      "end": 1669.3999633789062,
      "text": " Lord, that we would learn lessons from this passage"
    },
    {
      "id": 122,
      "start": 1669.3999633789062,
      "end": 1674.3599548339844,
      "text": " and understanding the importance of seeking you and obeying you and doing your will."
    },
    {
      "id": 123,
      "start": 1674.3599548339844,
      "end": 1676.9999694824219,
      "text": " Lord, that we'd understand that you are able."
    },
    {
      "id": 124,
      "start": 1676.9999694824219,
      "end": 1681.3199462890625,
      "text": " Lord, that we would understand the fact that you are a righteous judge"
    },
    {
      "id": 125,
      "start": 1681.3199462890625,
      "end": 1685.3999633789062,
      "text": " and that your judgment is seen in this passage of scripture."
    },
    {
      "id": 126,
      "start": 1685.3999633789062,
      "end": 1689.3199462890625,
      "text": " And God, we thank you for Elisha and for his boldness."
    },
    {
      "id": 127,
      "start": 1689.8799438476562,
      "end": 1693.5599670410156,
      "text": " Lord, we pray that you would help us to continue to serve you."
    },
    {
      "id": 128,
      "start": 1693.5599670410156,
      "end": 1696.8399658203125,
      "text": " Lord, keep our eyes upon our Lord and Savior, Jesus Christ,"
    },
    {
      "id": 129,
      "start": 1696.8399658203125,
      "end": 1698.43994140625,
      "text": " the author and finisher of our faith."
    },
    {
      "id": 130,
      "start": 1698.43994140625,
      "end": 1702.6799621582031,
      "text": " I pray, Lord, that you'd be with our workers for Awana here in just a little while"
    },
    {
      "id": 131,
      "start": 1703.4799499511719,
      "end": 1705.1599426269531,
      "text": " as they work with the young people."
    },
    {
      "id": 132,
      "start": 1705.1599426269531,
      "end": 1707.2399597167969,
      "text": " I pray that you would encourage them and strengthen them."
    },
    {
      "id": 133,
      "start": 1707.2399597167969,
      "end": 1710.7599487304688,
      "text": " I pray, God, that you would help us this week to be used of thee."
    },
    {
      "id": 134,
      "start": 1710.7599487304688,
      "end": 1712.1199340820312,
      "text": " And we'll thank you for all that you'll do."
    },
    {
      "id": 135,
      "start": 1712.1199340820312,
      "end": 1714.1199340820312,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 136,
      "start": 1714.1199340820312,
      "end": 1714.5999755859375,
      "text": " Amen."
    }
  ],
  "processed_at": "2025-04-17T20:26:15.171625"
}