{
  "video_id": "BZi-sUEn51M",
  "text": "If you would to pray for the summer door family and Kimberly's grandfather went home to be with the Lord this morning And so that was brother Dave some of our dad and so if you would pray for the family I know they would certainly appreciate that. I've had some communication with the summer door last night and then again today And so if you would pray for them, I know they would certainly appreciate that we thank the Lord for the truth of heaven amen and To be absent from the body is to be present with the Lord and brother summer Saved man, and so we saw or not as others which have no hope first Thessalonians chapter number five this evening first Thessalonians chapter number five And they'll be looking at verse number 14 once again And as we've started a series seven weeks ago now looking at the instruction That's provided at the end of the book of first Thessalonians and then we'll also move over to the end of the book of second Thessalonians and to this model church a Good church a serving church a a church that believed in Practiced what New Testament churches are to do we find that they receive instruction as I've mentioned multiple times The instruction is concise and it is applicable and I am thankful that God's Word is profitable for us I'm thankful that it is easy to understand and apply in our lives I hope that as we've studied here tonight being lesson number seven I hope that we have been active in applying these principles in our lives We find that as we come this evening to the fourth commandment really that is found in verse number 14 We find that it begins with this exhortation now We exhort you remember verse 12 it started with and we beseech you and now we find in verse 14 now we exhort you brethren Remember, he says warn them that are unruly comfort the feeble-minded Support the weak and then this evening. We'll look at this thought be patient Toward all men as we begin to think about these Instructions that God gives in this portion of Scripture. We find that these Instructions require that we would be engaged in other words. There's some action that we need to take There's something we need to do when we think about those that are unruly They need to be warned and that's an action. That's an active. It's not a passive type of thing It's an active involvement warning those that are unruly Comforting those that are feeble-minded those that are easily discouraged those that have little faith if you will that we would be Encouraging them that we would be comforting them and then as we looked at last week Supporting the weak and we said this that some might be weak physically But we're really most concerned about those that would be weak spiritually and some are weak spiritually just because they're new babes in Christ and they're just growing and they're They're not mature believers and we need to come alongside them and and support them and help them grow and be involved in that process of discipleship and we find that there are some that are weak spiritually because they're just not growing and They've not taken heed remember as Paul writes to those in the book of Hebrews He said at the time that you ought to be teachers you have need that one teach you and so he was not speaking that to really Commending them for that. He was correcting them for that as we look at the verse this evening and look at the last phrase Verse number 14 when the Bible says be patient Toward all men I've used that as the title this evening just as I have with each of these thoughts over the last several weeks and begin to Think about this verse of Scripture and these instructions and we come to this final one It's probably the most complicated As we would understand this truth of be patient toward all men. Have you ever witnessed someone who lacked patience? No doubt you've you've witnessed someone that's lacked patience. Let me ask you this. Have you ever lacked patience? Sure, we have Sure, we have right and we could ask ourselves that this way this evening Is it even possible that we could be patient toward all men that we could be patient toward people? Because some people say this have you ever heard someone say this people drive me crazy People annoy me people bother me you hear people make those types of statements Unfortunately, and I've said it from this pulpit before I seek to correct it when I hear somebody in ministry Say it because it really bothers me but I've heard many people over the years that are in ministry say something like this the ministry would be great if it wasn't for people and I cannot stand that comment and here's why there's no ministry if there's no people and I believe that the person that would make that statement needs to really evaluate themselves and get in line with the scripture And not have that perspective. I understand that at times some are trying to be funny I don't think it's a laughing matter I think it's a serious thing in this evening when we begin to look at this statement when the Bible says be patient toward all men understand with me that God never Instructs us his children to do something that he will not enable us to be able to do He does not give us commands. He does not give us instructions That we are incapable of fulfilling now I might not be capable of fulfilling it in my own power and my own strength in our own Flesh in fact in my flesh and probably in your flesh as well. We're not gonna be patient toward all men Amen but through the help of God with God's grace and with his help with the power of The Holy Spirit of God as we are commanded to be filled with the Spirit of God We're commanded to walk in the Spirit so that we do not fulfill the lust of the flesh Then we find that God would enable us to be able to fulfill the instruction that he gives to be patient toward all men The word patient means to be long-suffering It means to be slow to anger not easily provoked It carries with it the idea of being calm under the sufferance of injuries or offenses it also carries with it the idea of not being revengeful and And here God says Be patient Toward all men. Why would God tell us that because God knows us? Amen, God's the one that created us and he knows the sinful condition of man Of course after the garden the fall of man He understands and the reality is that many of us struggle in the area of being patient or being long-suffering Some have said and maybe you've heard it maybe you've said it you should never pray for patience You ever hear somebody say that maybe you've been guilty of saying that I've heard preachers say you shouldn't pray for patience Because then the trials come and that's how God's gonna help you get patience I've heard people say that and the reality is that the the truth as we look at the word patient and Understanding that it means to be long-suffering. It is a it's it's Described as we look at Galatians 5 in fact turned there as the fruit of the Spirit notice in Galatians 5 and as I look at the truth in Galatians 5 when the Bible says the fruit of the Spirit now It does not say but the fruits plural of the Spirit it says but the fruit of the Spirit now I believe that that's important for us to understand because as the Next phrase is given to us and all of these words are given in verse 22 and 23 of Galatians 5 We find that the fruit of the Spirit is Described with all of these words these terms. It's not that I have the fruit of the Spirit I just don't have that one. Do you understand what I'm saying? And so we find here this evening This is the fruit of the Spirit. Have you ever described something? maybe you've used a number of of words and describing something you had a Good dinner and you used a number of words to describe that dinner But it's all describing the same piece of meat or the same Side salad that you had or whatever. It might be and here we find this is but the fruit of the Spirit is love joy Peace notice what it says long Suffering you see it. They're not making it up. It's right there in verse 22 gentleness goodness faith meekness Temperance against such there is no law in verse number 16 It says this I say then walk in the Spirit and you shall not fulfill the lust of the flesh And then God gives us this wonderful truth in verse 17 that all of us have proven to be Absolutely true. The Bible says the flesh lusteth against the spirit Have you experienced that in your life? The flesh lusteth against the spirit and the spirit against the flesh and these are notice what it says Contrary the one to the other So that you cannot do the things that you would remember Paul He says the things that I would I do not the things that I would not that I do and we find here that he Says but the fruit of the Spirit were to walk in the spirit So we do not fulfill the lust of the flesh in verse 16 The fruit of the Spirit is described in verse 22 in verse 23 and then the Bible says in verse 24 and they that are Christ noticed have crucified what? the flesh With the affections and lust if we live in the spirit Let us also walk in the spirit And so we find as we look at this truth of be patient toward all men that it's we're not going to be patient Toward all men in our own power own strength and your flesh and in my flesh We must be filled with the Spirit of God. We must walk in the Spirit. We find that the Bible tells us, we begin to understand here where it says, love, joy, peace, long-suffering, and we think about the truth of charity or love. You know what the Bible says in 1 Corinthians 13 about love or charity? It says this, charity suffereth long. You know what that word is? It's the same word that's translated long-suffering. Same word. Charity in 1 Corinthians 13 and verse number 4 is described this way, it suffereth long. You know we're instructed to love one another. John 13 records it this way, if you would turn there in John 13. The Bible says this, Jesus of course as we know is going to provide this command after he'd washed the feet of the disciples and then of course he's explaining to them about his soon going to the cross of Calvary and all the things that are going to take place and he says this in verse number 34 of John chapter 13, he says a new commandment I give unto you. What is this? That you love one another as I have loved you that you also love one another. So we understand that we're to love as Christ loved and he says this in verse 35, by this, by what? By this love that we have one toward another. By this shall all men know that you are my disciples if you have love one to another. We find that the Bible tells us that Jesus gives this command that we're to love one another. We find that the Bible tells us if you want to jot it down we won't turn there but in 1 Peter 4 and verse number 8 the Bible says that we're to have fervent charity among yourselves. Fervent charity, this love, but the Bible describes charity or love in 1 Corinthians 13 as it suffereth long. And so this evening as we begin to understand and try to unwrap if you will this truth that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'd each be transparent and honest this is an area in which we struggle with. People can really kind of get on our nerves, right? I mean be transparent tonight don't leave me up here on an island by myself, amen? And the reality is people can, they can be annoying from time to time. I can be annoying, amen? You can be annoying. We all can but but he says be patient toward all men. I want to go over and consider an example that we read of in Matthew chapter 18. Look in Matthew 18 if you will with me tonight and here's the reality and begin to think about this instruction where the Bible says be patient toward all men. We could find ourselves if we're not careful being patient with certain people and then lacking patience with others. We could find ourselves in a position where we desire for others to be patient toward us while we are not demonstrating patience toward others. But again we must recognize and we must understand that this is not something that you're going to conjure up in your own flesh. It's not something that you're just gonna, you know, sometimes oh well they're just patient. I mean they were just blessed with patience. Be patient toward all men. It's a command but I can only do it through the help of God and we find that the fruit of the Holy Spirit is described as being long-suffering. Notice with me in Matthew 18 and we're gonna pick it up in verse 21. Notice what the Bible says. Then came Peter to him and said, Lord how off shall my brother sin against me and I forgive him till seven times. Now honestly what Peter is saying here was looked at by that particular era and those others that would be in that arena of time and culture. Really he was being quite generous and saying till seven times because it was only thought that maybe two or three times you might forgive someone. But Peter says till seven times and Jesus says we are familiar. I say not unto thee until seven times but until seventy times seven. You see that in verse 22. Now I've said this before and you understand this. It is not the idea that Jesus was teaching that you keep a record book and when they get to 490 offenses you're off the hook. You don't have to forgive him anymore, right? That's not the idea. By the way I'm thankful that my God and your God forgives. Notice what he says in verse 23. Therefore is the kingdom of heaven likened to a certain king which would take account of his servants and when he had begun to reckon one was brought unto him which owed him ten thousand talents. Now really this particular amount that is mentioned in verse 24 is really beyond the ability to ever repay and the Bible says that this is what he owed but for as much notice in verse 25 as he had not to pay, he had no way to pay, it says his Lord commanded him to be sold and his wife and children and all that he had in payment to be made. The reality is that even if they were sold that it would not satisfy the entirety of the debt but we find that that would have been within the rights legally to do. And I want you to notice in verse 26 the Bible says this, the servant therefore fell down and worshipped him saying, look, notice what he says, Lord have what? Have patience with me and I will pay thee all. Now I really don't think he ever would have been able to pay all when you understand the amount of ten thousand talents but we find that really what I want to focus on this evening as we look at this thought of be patient toward all men is that this man understanding his circumstances, understanding the condition, understanding what was at stake, he falls down and he says have patience with me. No doubt we can relate with this man where we want others to be patient with us. Just be patient. Notice verse 27, then the Lord of that servant was moved with compassion. Notice what the Bible says, and loosed him and forgave him the debt. Isn't that amazing? But I want you to see this is an interesting passage of Scripture that helps us to see really the tendency of humanity. The same servant, you notice it says the same servant, right? Is that what your Bible says? The same servant. So this one that just had this situation unfold in his life, this situation where ten thousand talents are owed, he cannot pay, it's impossible. The master says okay we're gonna sell you and your family and we're gonna take care of the debt and he says he falls on his knees as Lord be patient with me. This same servant that was forgiven where the Bible says that he had compassion, the Lord, the master had compassion and loosed him and forgave him the debt. The Bible says that the same servant went out and what does he do? Well he finds his fellow servant which owed him a hundred pence. A hundred pence is nothing compared to ten thousand talents. I mean just a very insignificant amount compared to the ten thousand talents. And I want you to notice that the Bible says that he, this same servant that had just experienced he laid hands on him. On who? On this fellow servant that owed him a hundred pence and he took him by the throat. Notice what he said, pay me that thou owest. And I want you to see it. Many of us are familiar with this but I want you to see it and I hope it will help us today. The Bible says that his fellow servant fell down at his feet. Is this not the same thing that he did? Notice what he says, and he besought him. What did he say? Have patience with me and I will pay thee all. It's the same exact thing that this servant said to his master. Is it not? Have patience with me. Have patience with me. And it says that the first four words of verse number 30, and he would not. And he would not. He would not what? He would not have patience. He would not allow for this man to have a season, an opportunity to be able to earn the money to be able to pay back the debt. He did not forgive the debt and excuse it all like he had experienced and what he had received. He didn't even have enough compassion to have enough patience to let this servant work to pay it off. The Bible says that he cast him into prison till he should pay the debt. I understand that we could look at this passage of Scripture and we could make many applications and understand this evening that as we look at this particular passage in light of the truth of 1 Thessalonians 5 and verse number 14. so often that when we consider the thought of patience, when we consider the thought of being long-suffering, we're here, God gives us clearly this instruction to the local church, he says, now we exhort you, brethren. And he says, warn them that are unruly. And no doubt, that's a necessity, that's something that needs to happen. I said this a few weeks ago, ignoring the problem of the unruly is not going to resolve the problem, it's just going to make the situation worse. It has to be addressed, it has to be dealt with, and God in his sovereignty and his omniscience, he knew that local churches would deal with some that would be unruly. I'm thankful that it's not all the time that people and all the people are unruly, but you find that God gives the instruction. When there are those that are unruly, they need to be warned. Why would we warn the unruly? Well, so they could correct their behavior, so that they could be pleasing to the Lord, because one day they're going to stand before Christ. And you want to be able to, as Paul says in the book of Colossians, that they would be able to be presented perfect or complete before the Lord. And so we find that, warn them that are unruly, comfort the feeble-minded. You know, there are some people that it just becomes almost more natural to be an encourager and to be able to encourage others. I said this, that there are times in which we are the one doing the encouragement, and times in which we're the ones that need the encouragement. And no doubt, I'm thankful that Barnabas was a man, that he was a son of consolation, a comforter and encourager. I'm thankful that this was true in the life of the Apostle Paul, that he had someone that would come and encourage him. Remember, he said, as we studied that portion of Scripture, how God chose to comfort him by the coming of Titus, and how God will use us as individuals to comfort those that need the comfort to come and to get close to them and speak to them, to comfort them. We find that there are some that need to be supported. Support the weak, support the weak. There are some that are just weak. Some receive a phone call, they have a doctor's visit, they have a, I mean, you just fill in the blank. Life can take a turn in a moment. You can get devastating news, and you have no idea how that might impact you, how it might affect you. We ought not, as we think about these truths of warn them and comfort them and support them, those that are unruly, those that are feeble-minded, those that are weak, we understand it's not judge them, it's not criticize them, it's not condemn them, it's not, no, it's an active engagement of trying to help them grow in Christ. But then he says, be patient toward all men. I think in verse number 14, naturally speaking, the one that's the hardest is the final, be patient toward all men. But we find that with the help of God, as we're truly walking in the Spirit, as we're filled with the Spirit of God, as we've crucified the flesh and the affections thereof, we can demonstrate this godly patience, this long-suffering, this attitude that we find demonstrated here in this portion of Scripture in 1 Thessalonians where God says, be patient toward all men. I wonder this evening, I started out by asking some questions, have you ever witnessed someone that lacked patience? Sure we have. Have you ever lacked patience? I'm pretty confident that all of us have. At some point in our lives, we've lacked patience. Is it possible that we could be patient toward all men? Well, if it's not possible, God would not have instructed us to do so. But knowing that God instructed us to do so, it's obvious that we can with God's help. I use the illustration in the book of Matthew this evening for this purpose. Don't be like that individual that wants people to be patient with them and then turn around and not have patience with others. It's so common and so easy for us to fall in the trap. It's a human tendency that we see on display in Matthew 18. Have patience with me, but then I'm gonna go around and I'm not gonna have patience with others. God's people ought to be different. God's people ought to be different. And God tells us be patient toward all men. I wonder this evening, I know for me, even as I prepared, man, I need the help of God. You need the help of God. We need to be walking in the spirit if we're gonna be patient toward all men. And let me tell you this, you ever hear, my dad uses this terminology all the time. I'm not sure if other people use it or not, but he says people push his buttons. You ever hear somebody use that phraseology? And someone said I was looking for the off button. Bad decision. But what I'm saying this, when you seek to try to fulfill, as you're walking in the spirit, you can guarantee that there are gonna be some things that happen where if I could adopt and use for a moment that phrase, people are gonna push your buttons. I wonder this evening how quickly we can get into the flesh and not walk in the spirit. Because it requires us to be dead to self and we walk in the spirit because the fruit of the spirit is love, joy, peace, long suffering, long suffering. He says be patient toward all men. Oh, that God would help us in this area. Say, I'd rather warn the unruly, but they're all there, amen. And we're responsible to fulfill all of them, that we are to warn the unruly, we are to comfort the feeble-minded, we are to support the weak, but we're also commanded to be patient toward all men. Father, we love you. We thank you for loving us. I pray God that you'd help us. We acknowledge this evening that we cannot in our own flesh, in our own power, begin to fulfill this piece of instruction that you've given us in your word. It's absolutely going to be only achievable as we walk in the spirit, as we crucify the flesh, as we're filled with the spirit of God. And I pray, Lord, that you'd help us to daily, daily, as Paul said, I die daily, daily that we would say, I am crucified with Christ, that we'd be emptied of self, filled with your spirit, that we'd be able to, with your help and by your grace, obey this instruction, to be patient toward all men. I thank you for the privilege of prayer, the corporate prayer. I pray that you'd bless all that's said and done. For it's in Christ's name we pray, amen. Does anyone need a prayer bulletin this evening?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.460000038146973,
      "text": " If you would to pray for the summer door family and Kimberly's grandfather went home to be with the Lord this morning"
    },
    {
      "id": 1,
      "start": 6.460000038146973,
      "end": 11.539999961853027,
      "text": " And so that was brother Dave some of our dad and so if you would pray for the family"
    },
    {
      "id": 2,
      "start": 11.539999961853027,
      "end": 16.540000915527344,
      "text": " I know they would certainly appreciate that. I've had some communication with the summer door last night and then again today"
    },
    {
      "id": 3,
      "start": 16.540000915527344,
      "end": 20.6200008392334,
      "text": " And so if you would pray for them, I know they would certainly appreciate that"
    },
    {
      "id": 4,
      "start": 20.6200008392334,
      "end": 23.959999084472656,
      "text": " we thank the Lord for the truth of heaven amen and"
    },
    {
      "id": 5,
      "start": 24.280000686645508,
      "end": 27.65999984741211,
      "text": " To be absent from the body is to be present with the Lord and brother summer"
    },
    {
      "id": 6,
      "start": 28.219999313354492,
      "end": 34.7400016784668,
      "text": " Saved man, and so we saw or not as others which have no hope first Thessalonians chapter number five this evening"
    },
    {
      "id": 7,
      "start": 35.2599983215332,
      "end": 37.599998474121094,
      "text": " first Thessalonians chapter number five"
    },
    {
      "id": 8,
      "start": 38.540000915527344,
      "end": 41.13999938964844,
      "text": " And they'll be looking at verse number 14 once again"
    },
    {
      "id": 9,
      "start": 41.13999938964844,
      "end": 47.380001068115234,
      "text": " And as we've started a series seven weeks ago now looking at the instruction"
    },
    {
      "id": 10,
      "start": 47.380001068115234,
      "end": 49.97999954223633,
      "text": " That's provided at the end of the book of first Thessalonians"
    },
    {
      "id": 11,
      "start": 49.97999954223633,
      "end": 55.58000183105469,
      "text": " and then we'll also move over to the end of the book of second Thessalonians and to this model church a"
    },
    {
      "id": 12,
      "start": 55.779998779296875,
      "end": 60.5,
      "text": " Good church a serving church a a church that believed in"
    },
    {
      "id": 13,
      "start": 61.29999923706055,
      "end": 68.18000030517578,
      "text": " Practiced what New Testament churches are to do we find that they receive instruction as I've mentioned multiple times"
    },
    {
      "id": 14,
      "start": 68.18000030517578,
      "end": 75.62000274658203,
      "text": " The instruction is concise and it is applicable and I am thankful that God's Word is profitable for us"
    },
    {
      "id": 15,
      "start": 75.62000274658203,
      "end": 79.9800033569336,
      "text": " I'm thankful that it is easy to understand and apply in our lives"
    },
    {
      "id": 16,
      "start": 79.9800033569336,
      "end": 84.18000030517578,
      "text": " I hope that as we've studied here tonight being lesson number seven"
    },
    {
      "id": 17,
      "start": 84.18000030517578,
      "end": 90.22000122070312,
      "text": " I hope that we have been active in applying these principles in our lives"
    },
    {
      "id": 18,
      "start": 90.54000091552734,
      "end": 96.86000061035156,
      "text": " We find that as we come this evening to the fourth commandment really that is found in verse number 14"
    },
    {
      "id": 19,
      "start": 96.9800033569336,
      "end": 99.73999786376953,
      "text": " We find that it begins with this exhortation now"
    },
    {
      "id": 20,
      "start": 99.73999786376953,
      "end": 107.30000305175781,
      "text": " We exhort you remember verse 12 it started with and we beseech you and now we find in verse 14 now we exhort you brethren"
    },
    {
      "id": 21,
      "start": 107.81999969482422,
      "end": 111.9800033569336,
      "text": " Remember, he says warn them that are unruly comfort the feeble-minded"
    },
    {
      "id": 22,
      "start": 112.69999694824219,
      "end": 117.5,
      "text": " Support the weak and then this evening. We'll look at this thought be patient"
    },
    {
      "id": 23,
      "start": 118.26000213623047,
      "end": 121.13999938964844,
      "text": " Toward all men as we begin to think about these"
    },
    {
      "id": 24,
      "start": 122.18000030517578,
      "end": 127.33999633789062,
      "text": " Instructions that God gives in this portion of Scripture. We find that these"
    },
    {
      "id": 25,
      "start": 127.9800033569336,
      "end": 133.66000366210938,
      "text": " Instructions require that we would be engaged in other words. There's some action that we need to take"
    },
    {
      "id": 26,
      "start": 134.4199981689453,
      "end": 137.4600067138672,
      "text": " There's something we need to do when we think about those that are unruly"
    },
    {
      "id": 27,
      "start": 137.4600067138672,
      "end": 144.4199981689453,
      "text": " They need to be warned and that's an action. That's an active. It's not a passive type of thing"
    },
    {
      "id": 28,
      "start": 144.4199981689453,
      "end": 147.6199951171875,
      "text": " It's an active involvement warning those that are unruly"
    },
    {
      "id": 29,
      "start": 148.17999267578125,
      "end": 154.82000732421875,
      "text": " Comforting those that are feeble-minded those that are easily discouraged those that have little faith if you will that we would be"
    },
    {
      "id": 30,
      "start": 155.13999938964844,
      "end": 159.5,
      "text": " Encouraging them that we would be comforting them and then as we looked at last week"
    },
    {
      "id": 31,
      "start": 159.82000732421875,
      "end": 163.25999450683594,
      "text": " Supporting the weak and we said this that some might be weak physically"
    },
    {
      "id": 32,
      "start": 163.25999450683594,
      "end": 165.83999633789062,
      "text": " But we're really most concerned about those that would be weak"
    },
    {
      "id": 33,
      "start": 166.3000030517578,
      "end": 172.22000122070312,
      "text": " spiritually and some are weak spiritually just because they're new babes in Christ and they're just growing and they're"
    },
    {
      "id": 34,
      "start": 172.5800018310547,
      "end": 174.6199951171875,
      "text": " They're not mature believers"
    },
    {
      "id": 35,
      "start": 174.6199951171875,
      "end": 182.3800048828125,
      "text": " and we need to come alongside them and and support them and help them grow and be involved in that process of"
    },
    {
      "id": 36,
      "start": 182.6999969482422,
      "end": 188.25999450683594,
      "text": " discipleship and we find that there are some that are weak spiritually because they're just not growing and"
    },
    {
      "id": 37,
      "start": 188.77999877929688,
      "end": 193.6999969482422,
      "text": " They've not taken heed remember as Paul writes to those in the book of Hebrews"
    },
    {
      "id": 38,
      "start": 193.6999969482422,
      "end": 199.5,
      "text": " He said at the time that you ought to be teachers you have need that one teach you and so he was not speaking that"
    },
    {
      "id": 39,
      "start": 199.5,
      "end": 201.5,
      "text": " to really"
    },
    {
      "id": 40,
      "start": 202.02000427246094,
      "end": 209.05999755859375,
      "text": " Commending them for that. He was correcting them for that as we look at the verse this evening and look at the last phrase"
    },
    {
      "id": 41,
      "start": 209.4199981689453,
      "end": 212.5,
      "text": " Verse number 14 when the Bible says be patient"
    },
    {
      "id": 42,
      "start": 213.3800048828125,
      "end": 214.5,
      "text": " Toward all men"
    },
    {
      "id": 43,
      "start": 214.5,
      "end": 220.3800048828125,
      "text": " I've used that as the title this evening just as I have with each of these thoughts over the last several weeks and begin to"
    },
    {
      "id": 44,
      "start": 220.3800048828125,
      "end": 225.22000122070312,
      "text": " Think about this verse of Scripture and these instructions and we come to this final one"
    },
    {
      "id": 45,
      "start": 225.22000122070312,
      "end": 227.22000122070312,
      "text": " It's probably the most complicated"
    },
    {
      "id": 46,
      "start": 227.5,
      "end": 234.3800048828125,
      "text": " As we would understand this truth of be patient toward all men. Have you ever witnessed someone who lacked patience?"
    },
    {
      "id": 47,
      "start": 235.89999389648438,
      "end": 242.10000610351562,
      "text": " No doubt you've you've witnessed someone that's lacked patience. Let me ask you this. Have you ever lacked patience?"
    },
    {
      "id": 48,
      "start": 242.5,
      "end": 243.94000244140625,
      "text": " Sure, we have"
    },
    {
      "id": 49,
      "start": 243.94000244140625,
      "end": 248.6999969482422,
      "text": " Sure, we have right and we could ask ourselves that this way this evening"
    },
    {
      "id": 50,
      "start": 248.6999969482422,
      "end": 254.6199951171875,
      "text": " Is it even possible that we could be patient toward all men that we could be patient toward people?"
    },
    {
      "id": 51,
      "start": 254.74000549316406,
      "end": 258.4599914550781,
      "text": " Because some people say this have you ever heard someone say this people drive me crazy"
    },
    {
      "id": 52,
      "start": 259.05999755859375,
      "end": 263.739990234375,
      "text": " People annoy me people bother me you hear people make those types of statements"
    },
    {
      "id": 53,
      "start": 264.739990234375,
      "end": 270.17999267578125,
      "text": " Unfortunately, and I've said it from this pulpit before I seek to correct it when I hear somebody in ministry"
    },
    {
      "id": 54,
      "start": 270.17999267578125,
      "end": 272.1400146484375,
      "text": " Say it because it really bothers me"
    },
    {
      "id": 55,
      "start": 272.1400146484375,
      "end": 279.1400146484375,
      "text": " but I've heard many people over the years that are in ministry say something like this the ministry would be great if it wasn't for"
    },
    {
      "id": 56,
      "start": 279.1400146484375,
      "end": 284.94000244140625,
      "text": " people and I cannot stand that comment and here's why there's no ministry if there's no people and"
    },
    {
      "id": 57,
      "start": 285.29998779296875,
      "end": 293.17999267578125,
      "text": " I believe that the person that would make that statement needs to really evaluate themselves and get in line with the scripture"
    },
    {
      "id": 58,
      "start": 293.6199951171875,
      "end": 298.739990234375,
      "text": " And not have that perspective. I understand that at times some are trying to be funny"
    },
    {
      "id": 59,
      "start": 298.739990234375,
      "end": 300.4599914550781,
      "text": " I don't think it's a laughing matter"
    },
    {
      "id": 60,
      "start": 300.4599914550781,
      "end": 307.6600036621094,
      "text": " I think it's a serious thing in this evening when we begin to look at this statement when the Bible says be patient toward all"
    },
    {
      "id": 61,
      "start": 307.6600036621094,
      "end": 308.5400085449219,
      "text": " men"
    },
    {
      "id": 62,
      "start": 308.5400085449219,
      "end": 310.5400085449219,
      "text": " understand with me that God never"
    },
    {
      "id": 63,
      "start": 310.7799987792969,
      "end": 317.70001220703125,
      "text": " Instructs us his children to do something that he will not enable us to be able to do"
    },
    {
      "id": 64,
      "start": 317.8999938964844,
      "end": 320.739990234375,
      "text": " He does not give us commands. He does not give us instructions"
    },
    {
      "id": 65,
      "start": 321.70001220703125,
      "end": 325.0199890136719,
      "text": " That we are incapable of fulfilling now"
    },
    {
      "id": 66,
      "start": 325.3800048828125,
      "end": 330.0199890136719,
      "text": " I might not be capable of fulfilling it in my own power and my own strength in our own"
    },
    {
      "id": 67,
      "start": 330.70001220703125,
      "end": 337.2200012207031,
      "text": " Flesh in fact in my flesh and probably in your flesh as well. We're not gonna be patient toward all men"
    },
    {
      "id": 68,
      "start": 337.70001220703125,
      "end": 338.8599853515625,
      "text": " Amen"
    },
    {
      "id": 69,
      "start": 338.8599853515625,
      "end": 343.5400085449219,
      "text": " but through the help of God with God's grace and with his help with the power of"
    },
    {
      "id": 70,
      "start": 343.82000732421875,
      "end": 348.05999755859375,
      "text": " The Holy Spirit of God as we are commanded to be filled with the Spirit of God"
    },
    {
      "id": 71,
      "start": 348.29998779296875,
      "end": 352.3399963378906,
      "text": " We're commanded to walk in the Spirit so that we do not fulfill the lust of the flesh"
    },
    {
      "id": 72,
      "start": 352.5400085449219,
      "end": 360.260009765625,
      "text": " Then we find that God would enable us to be able to fulfill the instruction that he gives to be patient"
    },
    {
      "id": 73,
      "start": 360.739990234375,
      "end": 362.1000061035156,
      "text": " toward all"
    },
    {
      "id": 74,
      "start": 362.1000061035156,
      "end": 363.3800048828125,
      "text": " men"
    },
    {
      "id": 75,
      "start": 363.3800048828125,
      "end": 366.1400146484375,
      "text": " The word patient means to be long-suffering"
    },
    {
      "id": 76,
      "start": 366.3399963378906,
      "end": 370.260009765625,
      "text": " It means to be slow to anger not easily provoked"
    },
    {
      "id": 77,
      "start": 370.260009765625,
      "end": 375.5400085449219,
      "text": " It carries with it the idea of being calm under the sufferance of injuries or offenses"
    },
    {
      "id": 78,
      "start": 375.5400085449219,
      "end": 379.260009765625,
      "text": " it also carries with it the idea of not being revengeful and"
    },
    {
      "id": 79,
      "start": 380.1000061035156,
      "end": 382.1000061035156,
      "text": " And here God says"
    },
    {
      "id": 80,
      "start": 382.8599853515625,
      "end": 384.82000732421875,
      "text": " Be patient"
    },
    {
      "id": 81,
      "start": 384.82000732421875,
      "end": 389.1000061035156,
      "text": " Toward all men. Why would God tell us that because God knows us?"
    },
    {
      "id": 82,
      "start": 389.7799987792969,
      "end": 395.0199890136719,
      "text": " Amen, God's the one that created us and he knows the sinful condition of man"
    },
    {
      "id": 83,
      "start": 395.0199890136719,
      "end": 397.0199890136719,
      "text": " Of course after the garden the fall of man"
    },
    {
      "id": 84,
      "start": 397.0199890136719,
      "end": 404.05999755859375,
      "text": " He understands and the reality is that many of us struggle in the area of being patient or being long-suffering"
    },
    {
      "id": 85,
      "start": 405.05999755859375,
      "end": 410.4200134277344,
      "text": " Some have said and maybe you've heard it maybe you've said it you should never pray for patience"
    },
    {
      "id": 86,
      "start": 410.4200134277344,
      "end": 415.7799987792969,
      "text": " You ever hear somebody say that maybe you've been guilty of saying that I've heard preachers say you shouldn't pray for patience"
    },
    {
      "id": 87,
      "start": 415.8999938964844,
      "end": 419.94000244140625,
      "text": " Because then the trials come and that's how God's gonna help you get patience"
    },
    {
      "id": 88,
      "start": 419.94000244140625,
      "end": 425.94000244140625,
      "text": " I've heard people say that and the reality is that the the truth as we look at the word patient and"
    },
    {
      "id": 89,
      "start": 426.29998779296875,
      "end": 430.260009765625,
      "text": " Understanding that it means to be long-suffering. It is a it's it's"
    },
    {
      "id": 90,
      "start": 430.82000732421875,
      "end": 437.3399963378906,
      "text": " Described as we look at Galatians 5 in fact turned there as the fruit of the Spirit notice in Galatians 5"
    },
    {
      "id": 91,
      "start": 437.3399963378906,
      "end": 441.8599853515625,
      "text": " and as I look at the truth in Galatians 5 when the Bible says the fruit of"
    },
    {
      "id": 92,
      "start": 442.3800048828125,
      "end": 444.1400146484375,
      "text": " the Spirit now"
    },
    {
      "id": 93,
      "start": 444.1400146484375,
      "end": 446.260009765625,
      "text": " It does not say but the fruits"
    },
    {
      "id": 94,
      "start": 446.8999938964844,
      "end": 450.5,
      "text": " plural of the Spirit it says but the fruit of"
    },
    {
      "id": 95,
      "start": 450.94000244140625,
      "end": 452.739990234375,
      "text": " the Spirit now"
    },
    {
      "id": 96,
      "start": 452.739990234375,
      "end": 456.6199951171875,
      "text": " I believe that that's important for us to understand because as the"
    },
    {
      "id": 97,
      "start": 456.9800109863281,
      "end": 463.1000061035156,
      "text": " Next phrase is given to us and all of these words are given in verse 22 and 23 of Galatians 5"
    },
    {
      "id": 98,
      "start": 463.3399963378906,
      "end": 466.05999755859375,
      "text": " We find that the fruit of the Spirit is"
    },
    {
      "id": 99,
      "start": 466.7799987792969,
      "end": 472.9800109863281,
      "text": " Described with all of these words these terms. It's not that I have the fruit of the Spirit"
    },
    {
      "id": 100,
      "start": 472.9800109863281,
      "end": 477.739990234375,
      "text": " I just don't have that one. Do you understand what I'm saying? And so we find here this evening"
    },
    {
      "id": 101,
      "start": 477.739990234375,
      "end": 480.5799865722656,
      "text": " This is the fruit of the Spirit. Have you ever described something?"
    },
    {
      "id": 102,
      "start": 480.5799865722656,
      "end": 484.6600036621094,
      "text": " maybe you've used a number of of words and describing something you had a"
    },
    {
      "id": 103,
      "start": 485.29998779296875,
      "end": 489.5799865722656,
      "text": " Good dinner and you used a number of words to describe that dinner"
    },
    {
      "id": 104,
      "start": 489.6600036621094,
      "end": 493.0199890136719,
      "text": " But it's all describing the same piece of meat or the same"
    },
    {
      "id": 105,
      "start": 493.260009765625,
      "end": 498.8999938964844,
      "text": " Side salad that you had or whatever. It might be and here we find this is but the fruit of the Spirit is"
    },
    {
      "id": 106,
      "start": 500.17999267578125,
      "end": 501.6199951171875,
      "text": " love"
    },
    {
      "id": 107,
      "start": 501.6199951171875,
      "end": 503.0199890136719,
      "text": " joy"
    },
    {
      "id": 108,
      "start": 503.0199890136719,
      "end": 506.0199890136719,
      "text": " Peace notice what it says long"
    },
    {
      "id": 109,
      "start": 506.9800109863281,
      "end": 511.3800048828125,
      "text": " Suffering you see it. They're not making it up. It's right there in verse 22"
    },
    {
      "id": 110,
      "start": 512.1799926757812,
      "end": 514.1799926757812,
      "text": " gentleness goodness"
    },
    {
      "id": 111,
      "start": 514.1799926757812,
      "end": 515.6599731445312,
      "text": " faith"
    },
    {
      "id": 112,
      "start": 515.6599731445312,
      "end": 516.8599853515625,
      "text": " meekness"
    },
    {
      "id": 113,
      "start": 516.8599853515625,
      "end": 521.7000122070312,
      "text": " Temperance against such there is no law in verse number 16"
    },
    {
      "id": 114,
      "start": 521.7000122070312,
      "end": 527.5800170898438,
      "text": " It says this I say then walk in the Spirit and you shall not fulfill the lust of the flesh"
    },
    {
      "id": 115,
      "start": 527.5800170898438,
      "end": 533.0599975585938,
      "text": " And then God gives us this wonderful truth in verse 17 that all of us have proven to be"
    },
    {
      "id": 116,
      "start": 533.739990234375,
      "end": 538.97998046875,
      "text": " Absolutely true. The Bible says the flesh lusteth against the spirit"
    },
    {
      "id": 117,
      "start": 538.97998046875,
      "end": 540.4600219726562,
      "text": " Have you experienced that in your life?"
    },
    {
      "id": 118,
      "start": 540.4600219726562,
      "end": 546.6599731445312,
      "text": " The flesh lusteth against the spirit and the spirit against the flesh and these are notice what it says"
    },
    {
      "id": 119,
      "start": 547.1799926757812,
      "end": 549.97998046875,
      "text": " Contrary the one to the other"
    },
    {
      "id": 120,
      "start": 550.5399780273438,
      "end": 553.7000122070312,
      "text": " So that you cannot do the things that you would remember Paul"
    },
    {
      "id": 121,
      "start": 553.739990234375,
      "end": 559.5,
      "text": " He says the things that I would I do not the things that I would not that I do and we find here that he"
    },
    {
      "id": 122,
      "start": 559.5,
      "end": 562.0599975585938,
      "text": " Says but the fruit of the Spirit were to walk in the spirit"
    },
    {
      "id": 123,
      "start": 562.0599975585938,
      "end": 564.9000244140625,
      "text": " So we do not fulfill the lust of the flesh in verse 16"
    },
    {
      "id": 124,
      "start": 565.2999877929688,
      "end": 572.8200073242188,
      "text": " The fruit of the Spirit is described in verse 22 in verse 23 and then the Bible says in verse 24 and they that are"
    },
    {
      "id": 125,
      "start": 572.8200073242188,
      "end": 575.4600219726562,
      "text": " Christ noticed have crucified what?"
    },
    {
      "id": 126,
      "start": 576.02001953125,
      "end": 577.6599731445312,
      "text": " the flesh"
    },
    {
      "id": 127,
      "start": 577.6599731445312,
      "end": 582.4600219726562,
      "text": " With the affections and lust if we live in the spirit"
    },
    {
      "id": 128,
      "start": 582.4600219726562,
      "end": 585.5,
      "text": " Let us also walk in the spirit"
    },
    {
      "id": 129,
      "start": 585.5,
      "end": 592.219970703125,
      "text": " And so we find as we look at this truth of be patient toward all men that it's we're not going to be patient"
    },
    {
      "id": 130,
      "start": 592.219970703125,
      "end": 596.4600219726562,
      "text": " Toward all men in our own power own strength and your flesh and in my flesh"
    },
    {
      "id": 131,
      "start": 596.4600219726562,
      "end": 599.97998046875,
      "text": " We must be filled with the Spirit of God. We must walk"
    },
    {
      "id": 0,
      "start": 599.97998046875,
      "end": 604.8599805831909,
      "text": " in the Spirit. We find that the Bible tells us, we begin to understand here"
    },
    {
      "id": 1,
      "start": 604.8599805831909,
      "end": 609.1599807739258,
      "text": " where it says, love, joy, peace, long-suffering, and we think about the"
    },
    {
      "id": 2,
      "start": 609.1599807739258,
      "end": 613.5799808502197,
      "text": " truth of charity or love. You know what the Bible says in 1 Corinthians 13"
    },
    {
      "id": 3,
      "start": 613.5799808502197,
      "end": 619.1399803161621,
      "text": " about love or charity? It says this, charity suffereth long. You know what"
    },
    {
      "id": 4,
      "start": 619.1399803161621,
      "end": 624.0999813079834,
      "text": " that word is? It's the same word that's translated long-suffering. Same word."
    },
    {
      "id": 5,
      "start": 624.0999813079834,
      "end": 628.4199810028076,
      "text": " Charity in 1 Corinthians 13 and verse number 4 is described this way, it"
    },
    {
      "id": 6,
      "start": 628.4199810028076,
      "end": 635.97998046875,
      "text": " suffereth long. You know we're instructed to love one another. John 13"
    },
    {
      "id": 7,
      "start": 635.97998046875,
      "end": 640.6599807739258,
      "text": " records it this way, if you would turn there in John 13. The Bible says this,"
    },
    {
      "id": 8,
      "start": 640.6599807739258,
      "end": 645.3799819946289,
      "text": " Jesus of course as we know is going to provide this command after he'd washed"
    },
    {
      "id": 9,
      "start": 645.3799819946289,
      "end": 649.8599815368652,
      "text": " the feet of the disciples and then of course he's explaining to them about his"
    },
    {
      "id": 10,
      "start": 649.8599815368652,
      "end": 653.7399787902832,
      "text": " soon going to the cross of Calvary and all the things that are going to take"
    },
    {
      "id": 11,
      "start": 653.7399787902832,
      "end": 660.9399795532227,
      "text": " place and he says this in verse number 34 of John chapter 13, he says a new"
    },
    {
      "id": 12,
      "start": 660.9399795532227,
      "end": 667.1399841308594,
      "text": " commandment I give unto you. What is this? That you love one another as I have"
    },
    {
      "id": 13,
      "start": 667.1399841308594,
      "end": 672.4999771118164,
      "text": " loved you that you also love one another. So we understand that we're to love as"
    },
    {
      "id": 14,
      "start": 672.4999771118164,
      "end": 678.099983215332,
      "text": " Christ loved and he says this in verse 35, by this, by what? By this love that we"
    },
    {
      "id": 15,
      "start": 678.1399841308594,
      "end": 683.6999816894531,
      "text": " have one toward another. By this shall all men know that you are my disciples"
    },
    {
      "id": 16,
      "start": 683.6999816894531,
      "end": 689.7399826049805,
      "text": " if you have love one to another. We find that the Bible tells us that Jesus gives"
    },
    {
      "id": 17,
      "start": 689.7399826049805,
      "end": 693.859977722168,
      "text": " this command that we're to love one another. We find that the Bible tells us"
    },
    {
      "id": 18,
      "start": 693.859977722168,
      "end": 697.6199798583984,
      "text": " if you want to jot it down we won't turn there but in 1 Peter 4 and verse"
    },
    {
      "id": 19,
      "start": 697.6199798583984,
      "end": 703.4599838256836,
      "text": " number 8 the Bible says that we're to have fervent charity among yourselves."
    },
    {
      "id": 20,
      "start": 703.6199798583984,
      "end": 708.2999801635742,
      "text": " Fervent charity, this love, but the Bible describes charity or love in 1"
    },
    {
      "id": 21,
      "start": 708.2999801635742,
      "end": 713.9399795532227,
      "text": " Corinthians 13 as it suffereth long. And so this evening as we begin to"
    },
    {
      "id": 22,
      "start": 713.9399795532227,
      "end": 719.2999801635742,
      "text": " understand and try to unwrap if you will this truth that is given to us in"
    },
    {
      "id": 23,
      "start": 719.2999801635742,
      "end": 724.4999771118164,
      "text": " 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward"
    },
    {
      "id": 24,
      "start": 724.4999771118164,
      "end": 729.5799865722656,
      "text": " all men. I think honestly tonight if we'd each be transparent and honest this is"
    },
    {
      "id": 25,
      "start": 729.5799865722656,
      "end": 734.0999755859375,
      "text": " an area in which we struggle with. People can really kind of get on our"
    },
    {
      "id": 26,
      "start": 734.0999755859375,
      "end": 739.7399749755859,
      "text": " nerves, right? I mean be transparent tonight don't leave me up here on an"
    },
    {
      "id": 27,
      "start": 739.7399749755859,
      "end": 744.6999816894531,
      "text": " island by myself, amen? And the reality is people can, they can be annoying from"
    },
    {
      "id": 28,
      "start": 744.6999816894531,
      "end": 750.7399749755859,
      "text": " time to time. I can be annoying, amen? You can be annoying. We all can but but he"
    },
    {
      "id": 29,
      "start": 750.7399749755859,
      "end": 758.3399810791016,
      "text": " says be patient toward all men. I want to go over and consider an example that we"
    },
    {
      "id": 30,
      "start": 758.3399810791016,
      "end": 763.0999755859375,
      "text": " read of in Matthew chapter 18. Look in Matthew 18 if you will with me tonight"
    },
    {
      "id": 31,
      "start": 763.0999755859375,
      "end": 767.8599853515625,
      "text": " and here's the reality and begin to think about this instruction where the"
    },
    {
      "id": 32,
      "start": 767.8599853515625,
      "end": 773.8199768066406,
      "text": " Bible says be patient toward all men. We could find ourselves if we're not"
    },
    {
      "id": 33,
      "start": 773.8199768066406,
      "end": 777.5799865722656,
      "text": " careful being patient with certain people and then lacking patience with"
    },
    {
      "id": 34,
      "start": 777.5799865722656,
      "end": 783.6999816894531,
      "text": " others. We could find ourselves in a position where we desire for others to"
    },
    {
      "id": 35,
      "start": 783.7399749755859,
      "end": 789.97998046875,
      "text": " be patient toward us while we are not demonstrating patience toward others. But"
    },
    {
      "id": 36,
      "start": 789.97998046875,
      "end": 793.2599792480469,
      "text": " again we must recognize and we must understand that this is not something"
    },
    {
      "id": 37,
      "start": 793.2599792480469,
      "end": 796.4999847412109,
      "text": " that you're going to conjure up in your own flesh. It's not something that you're"
    },
    {
      "id": 38,
      "start": 796.4999847412109,
      "end": 799.8199768066406,
      "text": " just gonna, you know, sometimes oh well they're just patient. I mean they were"
    },
    {
      "id": 39,
      "start": 799.8199768066406,
      "end": 806.8199768066406,
      "text": " just blessed with patience. Be patient toward all men. It's a command but I can"
    },
    {
      "id": 40,
      "start": 806.8199768066406,
      "end": 811.7399749755859,
      "text": " only do it through the help of God and we find that the fruit of the Holy"
    },
    {
      "id": 41,
      "start": 811.8599853515625,
      "end": 814.9399871826172,
      "text": " Spirit is described as being long-suffering. Notice with me in"
    },
    {
      "id": 42,
      "start": 814.9399871826172,
      "end": 820.4199829101562,
      "text": " Matthew 18 and we're gonna pick it up in verse 21. Notice what the Bible says."
    },
    {
      "id": 43,
      "start": 820.4199829101562,
      "end": 825.6999816894531,
      "text": " Then came Peter to him and said, Lord how off shall my brother sin against me and"
    },
    {
      "id": 44,
      "start": 825.6999816894531,
      "end": 832.6999816894531,
      "text": " I forgive him till seven times. Now honestly what Peter is saying here was"
    },
    {
      "id": 45,
      "start": 832.6999816894531,
      "end": 839.0199737548828,
      "text": " looked at by that particular era and those others that would be in that"
    },
    {
      "id": 46,
      "start": 839.0199737548828,
      "end": 844.8599853515625,
      "text": " arena of time and culture. Really he was being quite generous and saying till"
    },
    {
      "id": 47,
      "start": 844.8599853515625,
      "end": 849.2999877929688,
      "text": " seven times because it was only thought that maybe two or three times you might"
    },
    {
      "id": 48,
      "start": 849.2999877929688,
      "end": 853.7399749755859,
      "text": " forgive someone. But Peter says till seven times and Jesus says we are"
    },
    {
      "id": 49,
      "start": 853.7399749755859,
      "end": 859.219970703125,
      "text": " familiar. I say not unto thee until seven times but until seventy times seven. You"
    },
    {
      "id": 50,
      "start": 859.219970703125,
      "end": 863.4199829101562,
      "text": " see that in verse 22. Now I've said this before and you understand this. It is not"
    },
    {
      "id": 51,
      "start": 863.4199829101562,
      "end": 868.6199951171875,
      "text": " the idea that Jesus was teaching that you keep a record book and when they get"
    },
    {
      "id": 52,
      "start": 868.6199951171875,
      "end": 873.5399780273438,
      "text": " to 490 offenses you're off the hook. You don't have to forgive him anymore, right?"
    },
    {
      "id": 53,
      "start": 873.5399780273438,
      "end": 878.4199829101562,
      "text": " That's not the idea. By the way I'm thankful that my God and your God"
    },
    {
      "id": 54,
      "start": 878.4199829101562,
      "end": 883.6999816894531,
      "text": " forgives. Notice what he says in verse 23. Therefore is the kingdom of heaven"
    },
    {
      "id": 55,
      "start": 883.6999816894531,
      "end": 888.3399658203125,
      "text": " likened to a certain king which would take account of his servants and when he"
    },
    {
      "id": 56,
      "start": 888.3399658203125,
      "end": 895.7799682617188,
      "text": " had begun to reckon one was brought unto him which owed him ten thousand talents."
    },
    {
      "id": 57,
      "start": 896.3399658203125,
      "end": 902.0199890136719,
      "text": " Now really this particular amount that is mentioned in verse 24 is really"
    },
    {
      "id": 58,
      "start": 902.0199890136719,
      "end": 907.0999755859375,
      "text": " beyond the ability to ever repay and the Bible says that this is what he owed but"
    },
    {
      "id": 59,
      "start": 907.0999755859375,
      "end": 912.0999755859375,
      "text": " for as much notice in verse 25 as he had not to pay, he had no way to pay, it says"
    },
    {
      "id": 60,
      "start": 912.0999755859375,
      "end": 917.3399658203125,
      "text": " his Lord commanded him to be sold and his wife and children and all that he had in"
    },
    {
      "id": 61,
      "start": 917.3399658203125,
      "end": 922.739990234375,
      "text": " payment to be made. The reality is that even if they were sold that it would not"
    },
    {
      "id": 62,
      "start": 922.8599853515625,
      "end": 927.8199768066406,
      "text": " satisfy the entirety of the debt but we find that that would have been within"
    },
    {
      "id": 63,
      "start": 927.8199768066406,
      "end": 935.97998046875,
      "text": " the rights legally to do. And I want you to notice in verse 26 the Bible says"
    },
    {
      "id": 64,
      "start": 935.97998046875,
      "end": 941.97998046875,
      "text": " this, the servant therefore fell down and worshipped him saying, look, notice what he says,"
    },
    {
      "id": 65,
      "start": 941.97998046875,
      "end": 956.739990234375,
      "text": " Lord have what? Have patience with me and I will pay thee all. Now I really don't"
    },
    {
      "id": 66,
      "start": 956.739990234375,
      "end": 959.7799682617188,
      "text": " think he ever would have been able to pay all when you understand the amount"
    },
    {
      "id": 67,
      "start": 959.7799682617188,
      "end": 964.0599670410156,
      "text": " of ten thousand talents but we find that really what I want to focus on this"
    },
    {
      "id": 68,
      "start": 964.0599670410156,
      "end": 968.2999877929688,
      "text": " evening as we look at this thought of be patient toward all men is that this man"
    },
    {
      "id": 69,
      "start": 968.2999877929688,
      "end": 972.1399841308594,
      "text": " understanding his circumstances, understanding the condition, understanding"
    },
    {
      "id": 70,
      "start": 972.1399841308594,
      "end": 983.2999877929688,
      "text": " what was at stake, he falls down and he says have patience with me. No doubt we"
    },
    {
      "id": 71,
      "start": 983.2999877929688,
      "end": 988.0599670410156,
      "text": " can relate with this man where we want others to be patient with us. Just be"
    },
    {
      "id": 72,
      "start": 988.0599670410156,
      "end": 994.8199768066406,
      "text": " patient. Notice verse 27, then the Lord of that servant was moved with compassion."
    },
    {
      "id": 73,
      "start": 995.8199768066406,
      "end": 1003.2599792480469,
      "text": " Notice what the Bible says, and loosed him and forgave him the debt. Isn't that"
    },
    {
      "id": 74,
      "start": 1003.2599792480469,
      "end": 1009.0599670410156,
      "text": " amazing? But I want you to see this is an interesting passage of"
    },
    {
      "id": 75,
      "start": 1009.0599670410156,
      "end": 1015.97998046875,
      "text": " Scripture that helps us to see really the tendency of humanity. The same"
    },
    {
      "id": 76,
      "start": 1015.97998046875,
      "end": 1019.0599670410156,
      "text": " servant, you notice it says the same servant, right? Is that what your Bible"
    },
    {
      "id": 77,
      "start": 1019.0599670410156,
      "end": 1023.8999938964844,
      "text": " says? The same servant. So this one that just had this situation unfold in his"
    },
    {
      "id": 78,
      "start": 1023.9399719238281,
      "end": 1028.219970703125,
      "text": " life, this situation where ten thousand talents are owed, he cannot pay, it's"
    },
    {
      "id": 79,
      "start": 1028.219970703125,
      "end": 1032.97998046875,
      "text": " impossible. The master says okay we're gonna sell you and your family and we're"
    },
    {
      "id": 80,
      "start": 1032.97998046875,
      "end": 1036.8999938964844,
      "text": " gonna take care of the debt and he says he falls on his knees as Lord be"
    },
    {
      "id": 81,
      "start": 1036.8999938964844,
      "end": 1043.0199890136719,
      "text": " patient with me. This same servant that was forgiven where the Bible says that"
    },
    {
      "id": 82,
      "start": 1043.0199890136719,
      "end": 1047.8199768066406,
      "text": " he had compassion, the Lord, the master had compassion and loosed him and"
    },
    {
      "id": 83,
      "start": 1047.8199768066406,
      "end": 1052.6599731445312,
      "text": " forgave him the debt. The Bible says that the same servant went out and what does"
    },
    {
      "id": 84,
      "start": 1052.6599731445312,
      "end": 1061.5399780273438,
      "text": " he do? Well he finds his fellow servant which owed him a hundred pence. A hundred"
    },
    {
      "id": 85,
      "start": 1061.5399780273438,
      "end": 1068.1399841308594,
      "text": " pence is nothing compared to ten thousand talents. I mean just a very"
    },
    {
      "id": 86,
      "start": 1068.1399841308594,
      "end": 1074.4199829101562,
      "text": " insignificant amount compared to the ten thousand talents. And I want you to"
    },
    {
      "id": 87,
      "start": 1074.4199829101562,
      "end": 1081.1799926757812,
      "text": " notice that the Bible says that he, this same servant that had just experienced"
    },
    {
      "id": 88,
      "start": 1082.1399841308594,
      "end": 1087.5399780273438,
      "text": " he laid hands on him. On who? On this fellow servant that owed him a hundred"
    },
    {
      "id": 89,
      "start": 1087.5399780273438,
      "end": 1093.3399658203125,
      "text": " pence and he took him by the throat. Notice what he said, pay me that thou"
    },
    {
      "id": 90,
      "start": 1093.3399658203125,
      "end": 1098.3799743652344,
      "text": " owest. And I want you to see it. Many of us are familiar with this but I want you"
    },
    {
      "id": 91,
      "start": 1098.3799743652344,
      "end": 1102.3399658203125,
      "text": " to see it and I hope it will help us today. The Bible says that his fellow"
    },
    {
      "id": 92,
      "start": 1102.3399658203125,
      "end": 1108.739990234375,
      "text": " servant fell down at his feet. Is this not the same thing that he did? Notice"
    },
    {
      "id": 93,
      "start": 1108.739990234375,
      "end": 1119.5399780273438,
      "text": " what he says, and he besought him. What did he say? Have patience with me and I"
    },
    {
      "id": 94,
      "start": 1119.5399780273438,
      "end": 1129.6199951171875,
      "text": " will pay thee all. It's the same exact thing that this servant said to his"
    },
    {
      "id": 95,
      "start": 1129.6199951171875,
      "end": 1140.0199584960938,
      "text": " master. Is it not? Have patience with me. Have patience with me. And it says that"
    },
    {
      "id": 96,
      "start": 1140.0199584960938,
      "end": 1150.6599731445312,
      "text": " the first four words of verse number 30, and he would not. And he would not. He"
    },
    {
      "id": 97,
      "start": 1150.6599731445312,
      "end": 1154.1399536132812,
      "text": " would not what? He would not have patience. He would not allow for this"
    },
    {
      "id": 98,
      "start": 1154.1399536132812,
      "end": 1160.0199584960938,
      "text": " man to have a season, an opportunity to be able to earn the money to be able to"
    },
    {
      "id": 99,
      "start": 1160.0199584960938,
      "end": 1165.5799560546875,
      "text": " pay back the debt. He did not forgive the debt and excuse it all like he had"
    },
    {
      "id": 100,
      "start": 1165.5799560546875,
      "end": 1169.4199829101562,
      "text": " experienced and what he had received. He didn't even have enough compassion to"
    },
    {
      "id": 101,
      "start": 1169.4199829101562,
      "end": 1176.8200073242188,
      "text": " have enough patience to let this servant work to pay it off. The Bible says that"
    },
    {
      "id": 102,
      "start": 1176.8200073242188,
      "end": 1185.6599731445312,
      "text": " he cast him into prison till he should pay the debt. I understand that we could look at"
    },
    {
      "id": 103,
      "start": 1185.6599731445312,
      "end": 1192.1399536132812,
      "text": " this passage of Scripture and we could make many applications and understand"
    },
    {
      "id": 104,
      "start": 1192.1399536132812,
      "end": 1196.8200073242188,
      "text": " this evening that as we look at this particular passage in light of the truth"
    },
    {
      "id": 105,
      "start": 1196.8200073242188,
      "end": 1199.4199829101562,
      "text": " of 1 Thessalonians 5 and verse number 14."
    },
    {
      "id": 0,
      "start": 1199.4199829101562,
      "end": 1203.4199829101562,
      "text": " so often that when we consider the thought of patience,"
    },
    {
      "id": 1,
      "start": 1203.4199829101562,
      "end": 1205.9199829101562,
      "text": " when we consider the thought of being long-suffering,"
    },
    {
      "id": 2,
      "start": 1205.9199829101562,
      "end": 1210.1199827194214,
      "text": " we're here, God gives us clearly this instruction"
    },
    {
      "id": 3,
      "start": 1210.1199827194214,
      "end": 1211.8199825286865,
      "text": " to the local church, he says,"
    },
    {
      "id": 4,
      "start": 1211.8199825286865,
      "end": 1214.219983100891,
      "text": " now we exhort you, brethren."
    },
    {
      "id": 5,
      "start": 1214.219983100891,
      "end": 1217.2199821472168,
      "text": " And he says, warn them that are unruly."
    },
    {
      "id": 6,
      "start": 1217.2199821472168,
      "end": 1219.4199829101562,
      "text": " And no doubt, that's a necessity,"
    },
    {
      "id": 7,
      "start": 1219.4199829101562,
      "end": 1221.6199836730957,
      "text": " that's something that needs to happen."
    },
    {
      "id": 8,
      "start": 1221.6199836730957,
      "end": 1223.9199829101562,
      "text": " I said this a few weeks ago,"
    },
    {
      "id": 9,
      "start": 1223.9199829101562,
      "end": 1226.4199829101562,
      "text": " ignoring the problem of the unruly"
    },
    {
      "id": 10,
      "start": 1226.4199829101562,
      "end": 1228.519983291626,
      "text": " is not going to resolve the problem,"
    },
    {
      "id": 11,
      "start": 1228.7199821472168,
      "end": 1231.4199829101562,
      "text": " it's just going to make the situation worse."
    },
    {
      "id": 12,
      "start": 1231.4199829101562,
      "end": 1234.2199821472168,
      "text": " It has to be addressed, it has to be dealt with,"
    },
    {
      "id": 13,
      "start": 1234.2199821472168,
      "end": 1237.3199844360352,
      "text": " and God in his sovereignty and his omniscience,"
    },
    {
      "id": 14,
      "start": 1237.3199844360352,
      "end": 1240.2199821472168,
      "text": " he knew that local churches would deal with some"
    },
    {
      "id": 15,
      "start": 1240.2199821472168,
      "end": 1241.3199844360352,
      "text": " that would be unruly."
    },
    {
      "id": 16,
      "start": 1241.3199844360352,
      "end": 1244.1199836730957,
      "text": " I'm thankful that it's not all the time"
    },
    {
      "id": 17,
      "start": 1244.1199836730957,
      "end": 1246.7199821472168,
      "text": " that people and all the people are unruly,"
    },
    {
      "id": 18,
      "start": 1246.7199821472168,
      "end": 1249.1199836730957,
      "text": " but you find that God gives the instruction."
    },
    {
      "id": 19,
      "start": 1249.1199836730957,
      "end": 1251.2199821472168,
      "text": " When there are those that are unruly,"
    },
    {
      "id": 20,
      "start": 1251.2199821472168,
      "end": 1253.7199821472168,
      "text": " they need to be warned."
    },
    {
      "id": 21,
      "start": 1253.7199821472168,
      "end": 1255.5199813842773,
      "text": " Why would we warn the unruly?"
    },
    {
      "id": 22,
      "start": 1255.5199813842773,
      "end": 1257.3199844360352,
      "text": " Well, so they could correct their behavior,"
    },
    {
      "id": 23,
      "start": 1257.4199829101562,
      "end": 1259.3199844360352,
      "text": " so that they could be pleasing to the Lord,"
    },
    {
      "id": 24,
      "start": 1259.3199844360352,
      "end": 1262.7199821472168,
      "text": " because one day they're going to stand before Christ."
    },
    {
      "id": 25,
      "start": 1262.7199821472168,
      "end": 1264.6199798583984,
      "text": " And you want to be able to, as Paul says"
    },
    {
      "id": 26,
      "start": 1264.6199798583984,
      "end": 1265.719985961914,
      "text": " in the book of Colossians,"
    },
    {
      "id": 27,
      "start": 1265.719985961914,
      "end": 1268.1199798583984,
      "text": " that they would be able to be presented perfect"
    },
    {
      "id": 28,
      "start": 1268.1199798583984,
      "end": 1271.0199813842773,
      "text": " or complete before the Lord."
    },
    {
      "id": 29,
      "start": 1271.0199813842773,
      "end": 1273.9199829101562,
      "text": " And so we find that, warn them that are unruly,"
    },
    {
      "id": 30,
      "start": 1273.9199829101562,
      "end": 1275.5199813842773,
      "text": " comfort the feeble-minded."
    },
    {
      "id": 31,
      "start": 1275.5199813842773,
      "end": 1277.219985961914,
      "text": " You know, there are some people that it just becomes"
    },
    {
      "id": 32,
      "start": 1277.219985961914,
      "end": 1279.8199844360352,
      "text": " almost more natural to be an encourager"
    },
    {
      "id": 33,
      "start": 1279.8199844360352,
      "end": 1281.9199829101562,
      "text": " and to be able to encourage others."
    },
    {
      "id": 34,
      "start": 1281.9199829101562,
      "end": 1284.1199798583984,
      "text": " I said this, that there are times in which"
    },
    {
      "id": 35,
      "start": 1284.1199798583984,
      "end": 1286.0199813842773,
      "text": " we are the one doing the encouragement,"
    },
    {
      "id": 36,
      "start": 1286.1199798583984,
      "end": 1287.4199829101562,
      "text": " and times in which we're the ones"
    },
    {
      "id": 37,
      "start": 1287.4199829101562,
      "end": 1289.0199813842773,
      "text": " that need the encouragement."
    },
    {
      "id": 38,
      "start": 1289.0199813842773,
      "end": 1292.3199844360352,
      "text": " And no doubt, I'm thankful that Barnabas was a man,"
    },
    {
      "id": 39,
      "start": 1292.3199844360352,
      "end": 1294.8199844360352,
      "text": " that he was a son of consolation,"
    },
    {
      "id": 40,
      "start": 1294.8199844360352,
      "end": 1296.719985961914,
      "text": " a comforter and encourager."
    },
    {
      "id": 41,
      "start": 1296.719985961914,
      "end": 1298.8199844360352,
      "text": " I'm thankful that this was true"
    },
    {
      "id": 42,
      "start": 1298.8199844360352,
      "end": 1300.6199798583984,
      "text": " in the life of the Apostle Paul,"
    },
    {
      "id": 43,
      "start": 1300.6199798583984,
      "end": 1303.4199829101562,
      "text": " that he had someone that would come and encourage him."
    },
    {
      "id": 44,
      "start": 1304.8199844360352,
      "end": 1308.1199798583984,
      "text": " Remember, he said, as we studied that portion of Scripture,"
    },
    {
      "id": 45,
      "start": 1308.1199798583984,
      "end": 1312.719985961914,
      "text": " how God chose to comfort him by the coming of Titus,"
    },
    {
      "id": 46,
      "start": 1312.8199844360352,
      "end": 1315.8199844360352,
      "text": " and how God will use us as individuals"
    },
    {
      "id": 47,
      "start": 1315.8199844360352,
      "end": 1319.219985961914,
      "text": " to comfort those that need the comfort to come"
    },
    {
      "id": 48,
      "start": 1319.219985961914,
      "end": 1322.9199829101562,
      "text": " and to get close to them and speak to them,"
    },
    {
      "id": 49,
      "start": 1324.0199813842773,
      "end": 1325.719985961914,
      "text": " to comfort them."
    },
    {
      "id": 50,
      "start": 1325.719985961914,
      "end": 1328.4199829101562,
      "text": " We find that there are some that need to be supported."
    },
    {
      "id": 51,
      "start": 1328.4199829101562,
      "end": 1331.4199829101562,
      "text": " Support the weak, support the weak."
    },
    {
      "id": 52,
      "start": 1331.4199829101562,
      "end": 1333.1199798583984,
      "text": " There are some that are just weak."
    },
    {
      "id": 53,
      "start": 1335.0199890136719,
      "end": 1339.4199829101562,
      "text": " Some receive a phone call, they have a doctor's visit,"
    },
    {
      "id": 54,
      "start": 1339.4199829101562,
      "end": 1342.0199890136719,
      "text": " they have a, I mean, you just fill in the blank."
    },
    {
      "id": 55,
      "start": 1342.0199890136719,
      "end": 1344.219985961914,
      "text": " Life can take a turn in a moment."
    },
    {
      "id": 56,
      "start": 1346.1199798583984,
      "end": 1348.9199829101562,
      "text": " You can get devastating news,"
    },
    {
      "id": 57,
      "start": 1348.9199829101562,
      "end": 1351.8199768066406,
      "text": " and you have no idea how that might impact you,"
    },
    {
      "id": 58,
      "start": 1351.8199768066406,
      "end": 1353.0199890136719,
      "text": " how it might affect you."
    },
    {
      "id": 59,
      "start": 1354.6199798583984,
      "end": 1356.9199829101562,
      "text": " We ought not, as we think about these truths"
    },
    {
      "id": 60,
      "start": 1356.9199829101562,
      "end": 1359.6199798583984,
      "text": " of warn them and comfort them and support them,"
    },
    {
      "id": 61,
      "start": 1359.6199798583984,
      "end": 1361.6199798583984,
      "text": " those that are unruly, those that are feeble-minded,"
    },
    {
      "id": 62,
      "start": 1361.6199798583984,
      "end": 1364.1199798583984,
      "text": " those that are weak, we understand it's not judge them,"
    },
    {
      "id": 63,
      "start": 1364.1199798583984,
      "end": 1366.3199768066406,
      "text": " it's not criticize them, it's not condemn them,"
    },
    {
      "id": 64,
      "start": 1366.3199768066406,
      "end": 1368.9199829101562,
      "text": " it's not, no, it's an active engagement"
    },
    {
      "id": 65,
      "start": 1368.9199829101562,
      "end": 1372.8199768066406,
      "text": " of trying to help them grow in Christ."
    },
    {
      "id": 66,
      "start": 1372.8199768066406,
      "end": 1376.5199890136719,
      "text": " But then he says, be patient toward all men."
    },
    {
      "id": 67,
      "start": 1377.8199768066406,
      "end": 1379.9199829101562,
      "text": " I think in verse number 14,"
    },
    {
      "id": 68,
      "start": 1382.6199798583984,
      "end": 1385.219985961914,
      "text": " naturally speaking, the one that's the hardest"
    },
    {
      "id": 69,
      "start": 1385.219985961914,
      "end": 1388.9199829101562,
      "text": " is the final, be patient toward all men."
    },
    {
      "id": 70,
      "start": 1391.1199798583984,
      "end": 1393.719985961914,
      "text": " But we find that with the help of God,"
    },
    {
      "id": 71,
      "start": 1394.5599822998047,
      "end": 1396.6199798583984,
      "text": " as we're truly walking in the Spirit,"
    },
    {
      "id": 72,
      "start": 1396.6199798583984,
      "end": 1398.8199768066406,
      "text": " as we're filled with the Spirit of God,"
    },
    {
      "id": 73,
      "start": 1399.5199890136719,
      "end": 1403.6199798583984,
      "text": " as we've crucified the flesh and the affections thereof,"
    },
    {
      "id": 74,
      "start": 1403.6199798583984,
      "end": 1408.0199890136719,
      "text": " we can demonstrate this godly patience,"
    },
    {
      "id": 75,
      "start": 1408.0199890136719,
      "end": 1411.9199829101562,
      "text": " this long-suffering, this attitude"
    },
    {
      "id": 76,
      "start": 1411.9199829101562,
      "end": 1414.8199768066406,
      "text": " that we find demonstrated here"
    },
    {
      "id": 77,
      "start": 1414.8199768066406,
      "end": 1417.6199798583984,
      "text": " in this portion of Scripture in 1 Thessalonians"
    },
    {
      "id": 78,
      "start": 1417.6199798583984,
      "end": 1421.0199890136719,
      "text": " where God says, be patient toward all men."
    },
    {
      "id": 79,
      "start": 1421.0199890136719,
      "end": 1422.4199829101562,
      "text": " I wonder this evening,"
    },
    {
      "id": 80,
      "start": 1422.4199829101562,
      "end": 1425.0199890136719,
      "text": " I started out by asking some questions,"
    },
    {
      "id": 81,
      "start": 1425.0199890136719,
      "end": 1427.4199829101562,
      "text": " have you ever witnessed someone that lacked patience?"
    },
    {
      "id": 82,
      "start": 1427.4199829101562,
      "end": 1428.4199829101562,
      "text": " Sure we have."
    },
    {
      "id": 83,
      "start": 1429.5199890136719,
      "end": 1431.3199768066406,
      "text": " Have you ever lacked patience?"
    },
    {
      "id": 84,
      "start": 1432.5199890136719,
      "end": 1435.1199798583984,
      "text": " I'm pretty confident that all of us have."
    },
    {
      "id": 85,
      "start": 1435.1199798583984,
      "end": 1438.4199829101562,
      "text": " At some point in our lives, we've lacked patience."
    },
    {
      "id": 86,
      "start": 1438.4199829101562,
      "end": 1442.9199829101562,
      "text": " Is it possible that we could be patient toward all men?"
    },
    {
      "id": 87,
      "start": 1443.8199768066406,
      "end": 1445.1199798583984,
      "text": " Well, if it's not possible,"
    },
    {
      "id": 88,
      "start": 1445.1199798583984,
      "end": 1447.4199829101562,
      "text": " God would not have instructed us to do so."
    },
    {
      "id": 89,
      "start": 1448.3199768066406,
      "end": 1450.8199768066406,
      "text": " But knowing that God instructed us to do so,"
    },
    {
      "id": 90,
      "start": 1450.8199768066406,
      "end": 1455.1199798583984,
      "text": " it's obvious that we can with God's help."
    },
    {
      "id": 91,
      "start": 1456.1199951171875,
      "end": 1459.6199951171875,
      "text": " I use the illustration in the book of Matthew this evening"
    },
    {
      "id": 92,
      "start": 1459.6199951171875,
      "end": 1461.9199829101562,
      "text": " for this purpose."
    },
    {
      "id": 93,
      "start": 1461.9199829101562,
      "end": 1463.8199768066406,
      "text": " Don't be like that individual"
    },
    {
      "id": 94,
      "start": 1463.8199768066406,
      "end": 1466.219970703125,
      "text": " that wants people to be patient with them"
    },
    {
      "id": 95,
      "start": 1467.4199829101562,
      "end": 1470.3199768066406,
      "text": " and then turn around and not have patience with others."
    },
    {
      "id": 96,
      "start": 1471.6199951171875,
      "end": 1475.219970703125,
      "text": " It's so common and so easy for us to fall in the trap."
    },
    {
      "id": 97,
      "start": 1475.219970703125,
      "end": 1480.219970703125,
      "text": " It's a human tendency that we see on display in Matthew 18."
    },
    {
      "id": 98,
      "start": 1481.719970703125,
      "end": 1484.3199768066406,
      "text": " Have patience with me, but then I'm gonna go around"
    },
    {
      "id": 99,
      "start": 1484.3199768066406,
      "end": 1487.3199768066406,
      "text": " and I'm not gonna have patience with others."
    },
    {
      "id": 100,
      "start": 1487.3199768066406,
      "end": 1489.1199951171875,
      "text": " God's people ought to be different."
    },
    {
      "id": 101,
      "start": 1490.0199890136719,
      "end": 1492.3199768066406,
      "text": " God's people ought to be different."
    },
    {
      "id": 102,
      "start": 1492.3199768066406,
      "end": 1496.219970703125,
      "text": " And God tells us be patient toward all men."
    },
    {
      "id": 103,
      "start": 1496.219970703125,
      "end": 1500.9199829101562,
      "text": " I wonder this evening, I know for me, even as I prepared,"
    },
    {
      "id": 104,
      "start": 1500.9199829101562,
      "end": 1503.0199890136719,
      "text": " man, I need the help of God."
    },
    {
      "id": 105,
      "start": 1504.0199890136719,
      "end": 1505.219970703125,
      "text": " You need the help of God."
    },
    {
      "id": 106,
      "start": 1505.219970703125,
      "end": 1507.8199768066406,
      "text": " We need to be walking in the spirit"
    },
    {
      "id": 107,
      "start": 1507.8199768066406,
      "end": 1510.9199829101562,
      "text": " if we're gonna be patient toward all men."
    },
    {
      "id": 108,
      "start": 1510.9199829101562,
      "end": 1512.8199768066406,
      "text": " And let me tell you this,"
    },
    {
      "id": 109,
      "start": 1512.8199768066406,
      "end": 1515.0199890136719,
      "text": " you ever hear, my dad uses this terminology all the time."
    },
    {
      "id": 110,
      "start": 1515.0199890136719,
      "end": 1516.8199768066406,
      "text": " I'm not sure if other people use it or not,"
    },
    {
      "id": 111,
      "start": 1516.8199768066406,
      "end": 1519.219970703125,
      "text": " but he says people push his buttons."
    },
    {
      "id": 112,
      "start": 1519.219970703125,
      "end": 1521.8199768066406,
      "text": " You ever hear somebody use that phraseology?"
    },
    {
      "id": 113,
      "start": 1521.8199768066406,
      "end": 1524.719970703125,
      "text": " And someone said I was looking for the off button."
    },
    {
      "id": 114,
      "start": 1526.1199951171875,
      "end": 1527.4199829101562,
      "text": " Bad decision."
    },
    {
      "id": 115,
      "start": 1528.3199768066406,
      "end": 1530.219970703125,
      "text": " But what I'm saying this,"
    },
    {
      "id": 116,
      "start": 1530.219970703125,
      "end": 1532.4199829101562,
      "text": " when you seek to try to fulfill,"
    },
    {
      "id": 117,
      "start": 1532.4199829101562,
      "end": 1534.6199951171875,
      "text": " as you're walking in the spirit,"
    },
    {
      "id": 118,
      "start": 1534.6199951171875,
      "end": 1536.719970703125,
      "text": " you can guarantee that there are gonna be some things"
    },
    {
      "id": 119,
      "start": 1536.719970703125,
      "end": 1539.5199890136719,
      "text": " that happen where if I could adopt"
    },
    {
      "id": 120,
      "start": 1539.5199890136719,
      "end": 1541.6199951171875,
      "text": " and use for a moment that phrase,"
    },
    {
      "id": 121,
      "start": 1541.6199951171875,
      "end": 1543.3199768066406,
      "text": " people are gonna push your buttons."
    },
    {
      "id": 122,
      "start": 1544.3199768066406,
      "end": 1547.8199768066406,
      "text": " I wonder this evening how quickly we can get into the flesh"
    },
    {
      "id": 123,
      "start": 1547.8199768066406,
      "end": 1550.0199890136719,
      "text": " and not walk in the spirit."
    },
    {
      "id": 124,
      "start": 1550.0199890136719,
      "end": 1552.6199951171875,
      "text": " Because it requires us to be dead to self"
    },
    {
      "id": 125,
      "start": 1552.6199951171875,
      "end": 1554.719970703125,
      "text": " and we walk in the spirit"
    },
    {
      "id": 126,
      "start": 1554.719970703125,
      "end": 1559.5199890136719,
      "text": " because the fruit of the spirit is love, joy, peace,"
    },
    {
      "id": 127,
      "start": 1559.5199890136719,
      "end": 1562.5199890136719,
      "text": " long suffering, long suffering."
    },
    {
      "id": 128,
      "start": 1562.5199890136719,
      "end": 1565.719970703125,
      "text": " He says be patient toward all men."
    },
    {
      "id": 129,
      "start": 1565.719970703125,
      "end": 1568.1199951171875,
      "text": " Oh, that God would help us in this area."
    },
    {
      "id": 130,
      "start": 1568.1199951171875,
      "end": 1570.8199768066406,
      "text": " Say, I'd rather warn the unruly,"
    },
    {
      "id": 131,
      "start": 1570.8199768066406,
      "end": 1572.8199768066406,
      "text": " but they're all there, amen."
    },
    {
      "id": 132,
      "start": 1572.8199768066406,
      "end": 1575.8199768066406,
      "text": " And we're responsible to fulfill all of them,"
    },
    {
      "id": 133,
      "start": 1575.8199768066406,
      "end": 1577.9199829101562,
      "text": " that we are to warn the unruly,"
    },
    {
      "id": 134,
      "start": 1577.9199829101562,
      "end": 1579.719970703125,
      "text": " we are to comfort the feeble-minded,"
    },
    {
      "id": 135,
      "start": 1579.719970703125,
      "end": 1582.0199890136719,
      "text": " we are to support the weak,"
    },
    {
      "id": 136,
      "start": 1582.0199890136719,
      "end": 1585.5199890136719,
      "text": " but we're also commanded to be patient toward all men."
    },
    {
      "id": 137,
      "start": 1585.5199890136719,
      "end": 1586.9199829101562,
      "text": " Father, we love you."
    },
    {
      "id": 138,
      "start": 1586.9199829101562,
      "end": 1589.219970703125,
      "text": " We thank you for loving us."
    },
    {
      "id": 139,
      "start": 1589.219970703125,
      "end": 1591.219970703125,
      "text": " I pray God that you'd help us."
    },
    {
      "id": 140,
      "start": 1591.219970703125,
      "end": 1593.0199890136719,
      "text": " We acknowledge this evening"
    },
    {
      "id": 141,
      "start": 1594.219970703125,
      "end": 1597.9199829101562,
      "text": " that we cannot in our own flesh, in our own power,"
    },
    {
      "id": 142,
      "start": 1598.9199829101562,
      "end": 1603.0199890136719,
      "text": " begin to fulfill this piece of instruction"
    },
    {
      "id": 143,
      "start": 1603.0199890136719,
      "end": 1604.8199768066406,
      "text": " that you've given us in your word."
    },
    {
      "id": 144,
      "start": 1606.5199890136719,
      "end": 1608.4199829101562,
      "text": " It's absolutely going to be"
    },
    {
      "id": 145,
      "start": 1610.4199829101562,
      "end": 1613.8199768066406,
      "text": " only achievable as we walk in the spirit,"
    },
    {
      "id": 146,
      "start": 1614.9199829101562,
      "end": 1616.9199829101562,
      "text": " as we crucify the flesh,"
    },
    {
      "id": 147,
      "start": 1618.0199890136719,
      "end": 1621.219970703125,
      "text": " as we're filled with the spirit of God."
    },
    {
      "id": 148,
      "start": 1621.219970703125,
      "end": 1624.9199829101562,
      "text": " And I pray, Lord, that you'd help us to daily,"
    },
    {
      "id": 149,
      "start": 1624.9199829101562,
      "end": 1629.219970703125,
      "text": " daily, as Paul said, I die daily,"
    },
    {
      "id": 150,
      "start": 1629.219970703125,
      "end": 1632.6199951171875,
      "text": " daily that we would say, I am crucified with Christ,"
    },
    {
      "id": 151,
      "start": 1634.5199890136719,
      "end": 1636.219970703125,
      "text": " that we'd be emptied of self,"
    },
    {
      "id": 152,
      "start": 1637.3199768066406,
      "end": 1638.8199768066406,
      "text": " filled with your spirit,"
    },
    {
      "id": 153,
      "start": 1640.219970703125,
      "end": 1643.4199829101562,
      "text": " that we'd be able to, with your help and by your grace,"
    },
    {
      "id": 154,
      "start": 1645.0199890136719,
      "end": 1648.3199768066406,
      "text": " obey this instruction,"
    },
    {
      "id": 155,
      "start": 1648.3199768066406,
      "end": 1650.6199951171875,
      "text": " to be patient toward all men."
    },
    {
      "id": 156,
      "start": 1651.6199951171875,
      "end": 1653.3199768066406,
      "text": " I thank you for the privilege of prayer,"
    },
    {
      "id": 157,
      "start": 1653.3199768066406,
      "end": 1654.3199768066406,
      "text": " the corporate prayer."
    },
    {
      "id": 158,
      "start": 1654.3199768066406,
      "end": 1656.9199829101562,
      "text": " I pray that you'd bless all that's said and done."
    },
    {
      "id": 159,
      "start": 1656.9199829101562,
      "end": 1659.8199768066406,
      "text": " For it's in Christ's name we pray, amen."
    },
    {
      "id": 160,
      "start": 1659.8199768066406,
      "end": 1662.1199951171875,
      "text": " Does anyone need a prayer bulletin this evening?"
    }
  ],
  "processed_at": "2025-04-15T09:07:28.648060"
}