{
  "video_id": "cCksVIX-UWU",
  "text": "And this morning, we're gonna deal with our service to the Lord. I've titled the message for the audience of one, for the audience of one. And I hope that as we go through the message this morning, that that title will be abundantly clear to you as what I'm seeking to communicate through this message for the audience of one. For the last three weeks, we had the opportunity minus last Sunday, but as we've dealt with this third phase, if you will, for our annual theme, the great is the Lord and greatly to be praised. We discovered his greatness. We spoke about the importance of declaring his greatness. And then for this third phase, we've dealt with the subject of how God's greatness will impact our lives. And I believe that when we understand how great he is, it should have an impact on each of us. For indeed it is true that what we believe will impact our behavior. For three weeks, we spent time looking at the subject matter of prayer. And there were several times that we noted that what we believe to be true about God, and we find that in his precious word will impact how we pray. We pray that God will move mountains because he can, because he's God, because he has all power, because he's reigning and ruling. We pray that God would save sinners because he's able. And you think about the way that we pray, it's based upon what we believe to be true about God's word, about who God is. We find that we've looked at David, the life of David in Psalm 32. We look at the life of Daniel. Why did Daniel have such confidence in praying that God would show him not only the dream, but the interpretation of the dream, because he knew who God was. He knew who God was. And therefore he prayed that God would give an answer. And guess what God did. And Daniel did not stand before Nebuchadnezzar and say that I'm able. He said, there's a God in heaven and praise the Lord. He's still there. He rules and he reigns and he's able. We had the opportunity to look at the life of Paul. And we dealt with the subject matter of a life marked by prayer. And we looked at his life. And as we were challenged through those messages to examine our own prayer lives, and in order to determine how our prayer lives have been shaped, have been impacted by what God has given to us in his word about how great he is. What is it that's on your prayer list? What is it that we're praying about right now that only God can do? And that really will impact as we examine these things, how we pray. This morning, I'd like to move into a second thought and that would be our service to God. You know, it's a privilege to serve God. And I would say this morning that when I truly understand how great our God is, it should impact how I serve him. I'm not just serving a mere human. I'm not just serving some false idol. No, I'm serving the great I am. I'm serving the King of Kings and Lord of Lords. And as we consider that thought this morning and understanding that as we serve God, we must never lose sight of the fact that we are serving God. Yes, will our service be to people? No doubt. But ultimately, our service is for the audience of one. It's for God. What a privilege it is to serve the Lord. Notice in Ephesians chapter two, we're familiar with verses eight and nine. I'll read them together with verse number 10. The Bible says, for by grace are you saved through faith. And that not of yourselves, it is the gift of God, not of works, lest any man should boast. Notice verse 10, for we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them. So we're gonna think about this truth of our service to the Lord. I want you to consider just a few thoughts with me this morning. Number one, we should review our attitude towards serving the Lord. We should review our attitude towards serving the Lord. In other words, we understand, the Bible says here, we are his workmanship, created in Christ Jesus, notice, unto good works, which God hath before ordained that we should walk in them. Before salvation, before you trust that Christ is your Savior, before I trust that Christ is my Savior, if you're here this morning and you've not yet been saved, according to the Bible in Romans six and verse number 17, I was a servant of sin, but in Christ. According to Romans 6, 18, no longer am I a servant of sin, but now I serve the Lord Jesus Christ and I am a servant of righteousness. And you know, the reality is I'd much rather be a servant of righteousness than a servant of sin. And we find that truth to be there for us in Romans six, verse 17 and 18. But when we understand this truth about serving the Lord and reviewing our attitude towards our service, I wonder this morning, do we have the perspective that I have to serve the Lord, or do we have the perspective that I get to serve the Lord? There's a great difference between having that perspective that I have to do this, and sometimes when we take that perspective, it becomes overbearing, it becomes duty, it's just difficult and maybe with drudgery, but when we have the perspective, when we review our attitude and understand that we are his workmanship, that God has created us for this, that he has designed it to be so, then I say, I get to serve the Lord. I get to serve Christ. What a privilege, what a blessing. We find this morning that the Bible is abundantly clear. When we think about this truth of our service to God, we do not serve the Lord to get saved. Ephesians two and eight in verse eight and nine are quite clear that the Bible says, for by grace are you saved through faith, and that not of yourselves, it is the gift of God, not of works, lest any man should be saved, lest any man should boast, and so we think about Ephesians two, verses eight and nine, we understand the Bible is abundantly clear when we speak about our service to God. It's not so that you can be saved. It's not even that you could stay saved. See, you can't serve God to stay saved just like you can't serve God to get saved. The Bible tells us in 1 Peter one, verses four and five, that we are kept by the power of God. We find that we have an inheritance that's reserved in heaven for us. I cannot work to be saved, nor can I work to stay saved, but when we understand and we examine, we review our attitude towards serving the Lord, we understand this morning that we get to serve God because we are saved. It's the result of being saved that gives us the privilege and the opportunity to serve the master, to serve the king of kings and Lord of lords, and what a great privilege it is. But at times, if we're not careful, our attitude can kind of get sideways with regard to service. We can kind of get into the drudgery and the monotony, if you will, and we can get overwhelmed with it, and we lose our focus that we're serving the Lord, we're serving the master, and what a blessing. Think about the perspective, if you will, of the psalmist, or Psalm 84, and I want you to look at a couple of verses within the Psalms, because really, I hope this morning that your service for Christ is a delight, that it's a delight. We understand that God has designed it that his children would serve him, and what a blessing it is, and you say, as we look at this truth of serving the Lord, we understand that it comes, and we'll look at our next point, it comes in a variety of shapes and sizes, and everyone's service is not the same, but what a privilege it is to serve the Lord, and it should be a delight. In Psalm 84, notice in verse number 10, the Bible says, for a day in thy court is better than a thousand. I had rather be a doorkeeper in the house of my God than to dwell in the tents of wickedness. I want you to think about that just for a moment. The psalmist says that they'd rather be a doorkeeper in the house of my God, a doorkeeper. You say, well, that's kind of a, no, no, no, that's a service to the king. It's a privilege, it's a delight to be able to serve the Lord, and you think about the perspective here. It says I'd rather do that than to dwell in the tents of wickedness. I want you to think about your service to the Lord, and the reality is that, listen, I'd rather clean bathrooms for the Lord than do something else for the world, amen, and what a delight. Somebody came to me not long ago and said, pastor, what can I do? I'll clean toilets, I'll clean this, I'll do that, whatever, I just wanna serve the Lord, and praise the Lord for that kind of perspective because why, it's a privilege to serve God. It is an absolute privilege. The psalmist says here in Psalm 84, what he would rather do, be a doorkeeper in the house of my God. I want you to think about Psalm 100, and of course, we're familiar with that psalm. It's a very familiar psalm to us, but I want you to see what the psalmist says in Psalm 100 in verse number two. The Bible says this, serve the Lord how? With gladness, with gladness. Come before his presence with singing, and we think about this truth as we review our attitude towards serving the Lord. I get to do this, I get to serve God. I can do it with gladness, and why? Because my perspective is that it's for the audience of one, for the audience of one. I'm serving the Lord. I have the privilege of being able to serve Christ. You say, well, as the pastor, you get to, no, no, listen, we get to serve Christ. There were many a day after I trusted Christ as my savior, I was an usher at our church, the first church I ever went to after I got saved, and I was an usher at that church as a teenager, and you know what the job of the ushers were? All the ushers are gonna get scared this morning. The job of the ushers every Saturday morning was to go to the church house and clean the house, the church house, and we went to that church house. church house, all the ushers, we get together on Saturday morning early before visitation and we'd get there and we'd spend a couple of hours before visitation cleaning that church house. Then we go on visitation, we come back after visitation and we clean the church house some more. And you know it was a delight. It was just a joy to be able to serve the Lord. And at times we must review our attitude towards serving the Lord because we don't want to get bogged down in the work. We don't want to get overwhelmed. We don't want to look at the wrong thing. We want to remind ourselves that we're serving the Lord, that it's for the audience of one. I don't have to, but I get to. It's a great perspective in life. Number two, we must rejoice for the ability to serve the Lord. Rejoice for the ability to serve the Lord. You know it's God who has gifted each of his children and given us the ability to serve him. And as I begin to think about that truth and we understand this morning that we are his workmanship created in Christ Jesus notice unto good works. And then at the end of verse number 10 of Ephesians 2 it says, which God hath before ordained that we should walk in them. And this is great for us to rejoice in having the ability to serve the Lord. So I can't do what I used to do. God knows that. There's a great Bible character that we're familiar with. We won't take the time to go to the book of Joshua, but you understand in the life of Joshua that there comes a time in Joshua's life, he was the human leader for the nation of Israel. He's the one that leads the children of Israel into the land of promise. He's the one that leads the children of Israel into all the battles that we read in the beginning of the book of Joshua and all of that. But there comes a time when God says to Joshua, you're old. You're old. He no longer was going to go out and lead in battles, but what was he going to do? He's going to divide the land. That was his duty. That was his responsibility. And guess what we find about Joshua? He was faithful to lead the children of Israel into battle, but as his life stages changed, he was faithful to serve God in dividing the land. If you're to study the book of Joshua, the latter part of the book, you'll find that there's some children, some tribes of the nation of Israel that kind of just sat around and they didn't do anything. And Joshua said, hey, what's going on? Aren't you going to go and claim your land, claim your inheritance? And he was used of God. And then he challenges the people before his death on serving the Lord. There are different stages that you see in the life of Joshua through that book of Joshua. And you find that all along the way, he's serving the Lord. Is it in different ways? Absolutely. But he's still serving God. And he had the ability to do what God called him to do at that time. Why? Because God equipped him and God enabled him for the task that was at hand. God equipped him and God enabled him for the battles that took place in the beginning of the book of Joshua. But then God enabled and equipped him for the division of the land that you read of in the midst of the book of Joshua. And then God equipped and enabled him to deliver those challenging messages to the two and a half tribes and to the leaders and the people of Israel before he would die. God enabled him. God equipped him. And God equips and enables each of us. Turn to the book of 1 Corinthians, if you will. And I want to go through a few verses here in the book of 1 Corinthians. And it's interesting as we look at this particular book, the church in Corinth, as we understand, turn to chapter number one to begin. But the church of Corinth is not a model church. The church in Corinth has lots of problems. The church in Corinth is being corrected for a lot of things that they're doing wrong. And the Lord would use the apostle Paul to pen this book in order to give them instruction with regard to how they were to serve the Lord and what was to take place. But when we understand and we're rejoicing for the ability to serve the Lord, I want you to see what God says to the people at Corinth with regard to their service. In verse number four of 1 Corinthians 1, notice what Paul says to these believers under the inspiration of the Holy Spirit of God. He says, I thank my God always on your behalf. Notice this, for the grace of God which is given you by Jesus Christ. I would submit to you this morning that that grace of God which is given you by Jesus Christ is not only saving grace, though it encompasses that, but it's also serving grace and the ability to serve the Lord. Paul talks about the grace that was bestowed upon him. At the end of this book, we find that Peter mentions about being a good steward of the manifold grace of God. And we find here that he's speaking about, notice, the grace of God which is given you by Jesus Christ. That in everything, verse number five, ye are enriched by him in all utterance and in all knowledge, even as the testimony of Christ was confirmed in you. Notice verse seven, so that you come behind in no gift, waiting for the coming of our Lord Jesus Christ. Now, as you study the book of 1 Corinthians, you find that one of the reasons that there's some division and some jealousy and envy within the members of the church at Corinth is because of the subject of spiritual gifts. Some were saying, well, I have this gift and you have that gift and my gift is better than your gift and so on and so forth. And we'll look at a few verses because the apostle Paul is going to deal with that and try to help them. But I want you to notice as we speak about the ability to serve God and how we ought to rejoice that he's given us the ability to serve the Lord, that it is God who has given us the grace. It is God who has given us the ability. He has equipped us. And it says here of the church in Corinth that they come behind in no gift. This church that was full of division and envy was a church that was gifted spiritually. But they allowed those spiritual gifts to cause them to look at each other and say, I'm better than you because of the gift that I have. And they totally missed the purpose for which God gave them the spiritual gifts in the first place. Notice in chapter number 4 of 1 Corinthians verses 6 and 7, notice what the Bible says here. In chapter 4, 1 Corinthians 4 verse 6 and 7, the Bible says this, and these things brethren I have in a figure transferred to myself and to Apollos for your sakes that you might learn in us not to think of men above that which is written, that no one of you be puffed up for one against another. He's dealing with the importance of humility. And notice in verse 7 he says, for who maketh thee to differ from another? By the way, aren't you happy everyone's not like you? Amen. I'm happy everyone's not like me. I'm happy everyone's not like you. I'm happy I'm not like you. Amen. But the reality is God's made us different. But then notice when we think about the spiritual gifts, notice in verse number 7, and what hast thou that thou didst not receive? He's going to build upon this as we go through the book of 1 Corinthians, and we'll look at a few more verses. He says, now if thou didst receive it, why dost thou glory as if thou hadst not received it? And we find that he's speaking, we look at this idea of the ability to serve the Lord, and we rejoice that God's given us the ability. Why? Because it's God who has equipped us. It is God who has enabled us. Think about this, the God of the universe, the one who spoke it all into existence, the one who formed man from the dust of the ground and then breathed the life into them through the breath of God, that he would allow us, he would allow you to serve him. It's amazing that he would allow us to serve him in any capacity. It's amazing the ability that he's given us to serve him. In 1 Corinthians chapter 12, notice as he continues to help this group of believers in Corinth to understand the subject matter of spiritual gifts and to understand the ability that God had given them to be able to serve the Lord. Remember, we don't serve God, we don't do good works to be saved, we don't serve the Lord or do good works to stay saved, but because we are saved, we are to serve Christ. We are to do good works. Notice in 1 Corinthians 12, now, verse number one, concerning spiritual gifts, brethren, I would not have you ignorant. Ye know that ye were Gentiles, carried away unto these dumb idols, even as ye were led. Wherefore, I give you to understand that no man speaking by the Spirit of God calleth Jesus a curse, and that no man can say that Jesus is the Lord, but by the Holy Ghost. Now there are diversities of gifts, but notice this, the same Spirit. Verse number five, and there are differences of administrations, but the same Lord. And there are diversities of operations, but it is the same God which worketh all in all. But the manifestation of the Spirit is given to every man to profit with all. Every man has been equipped and enabled to be able to serve Christ. Every child of God. Remember the book of 1 Corinthians has been written to save people, to people that have been born again, saved by the grace of God. And he says that the manifestation of the Spirit is given to every man to profit with all. For to one, notice verse eight, is given by the Spirit the word of wisdom. To another, the word of knowledge by the same Spirit. To another, faith by the same Spirit. To another, the gifts of healing by the same Spirit. To another, the working of miracles. To another, prophecy. To another, discerning of spirits. To another, diverse kinds of tongues. To another, the interpretation of tongues. Now I'm not going to get into all the spiritual gifts this morning, but understand that some of those were temporary sign gifts. The gift of healing, the gift of tongues, those are temporary. sign gifts. We think about even the gift of prophecy with regard to foretelling versus what we would look at it today as being foretelling. We see that those things have ceased. In fact, as you read through chapter 13 and 14, you see it very plainly that they would cease, that they would be done away with those temporary sign gifts. But notice in verse number 11 he says, but all these, and so everything that he references beginning in verse number 8 and following, he says, but all these worketh that one in the self same spirit dividing to every man severally, notice these words, as he will. God has equipped you. God has enabled you. And we think about this subject matter of our service to God, we think about how great God is, and we've examined it throughout this year, to think this morning, to comprehend this morning that the God of the universe would equip us as individuals and enable us to be able to serve him. He's given us the ability. It ought to cause us to rejoice greatly. By the way, it ought to motivate us to serve him. Amen? We're not to sit on the premises, we're to stand on the promises. We're not to be on the sidelines, we're to get in the game. Listen, I like playing sports. I'm getting older now, but I enjoy playing sports. I enjoy playing them a whole lot more than I enjoy watching them. We had our Labor Day picnic. I haven't played soccer in years. But I got sick and tired of watching them play soccer. Guess what? I went and played soccer. Right, Fernando? You and I, we're out there playing soccer. I think I scored four goals. Amen? Amen. Praise the Lord. I'm getting older. But I had a good time. I wanted to get in the game. I don't want to just watch. We're talking about serving the Lord. It's a participation thing. It's not just an observation thing. It's not just being a spectator, but being a participator. And he's equipped us to be able to serve the Lord. And we ought to rejoice for the ability that God has given us. Notice in the book of Ephesians, in chapter number four, notice with me, in the book of Ephesians, in chapter number four, and I'm going to read a few verses of Scripture and I hope as we look at this portion that we find here that as Paul is writing to the church at Ephesus again, how God had equipped them and how God had enabled them, that we would recognize that it's God who has given us the ability to serve him and we would rejoice greatly because of it. Notice in Ephesians four and verse number seven, but unto every one of us, it's kind of all inclusive, isn't it? No one's left out. If you're saved by grace, you've been enabled to serve the Lord and equipped, is given grace according to the measure of the gift of Christ. Wherefore he saith, when he ascended up on high, he led captivity captive and gave gifts unto men. Verses nine and 10 is a parenthetical and it's, I'm not skipping it for the purpose of just avoiding it, but going into the thought of spiritual gifts that God is dealing with in this text of Scripture and you find that he says and gave gifts unto men at the end of verse number eight. He talks about the measure of the gift of Christ in verse number seven and then notice in verse number 11, and he gave some apostles and some prophets and some evangelists and some pastors and teachers for what purpose? For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ. And we find that it's God who gave, it's God who equipped, it's God who has enabled and when we understand that, we ought to rejoice that he's given us the ability to serve him. Listen, I did not just sign up to be a pastor. I wasn't at a job fair somewhere and looking at the benefits of what they might be and say, you know, I think that's a really good career path for me. No, God called me. God equipped me. God has enabled me. And by the way, I rejoice for the opportunity. Let me say this, when he was first calling me, I resisted the call. I was scared to death. No, that's not, it's not for me. It's not something, but it was God. I had to realize that as God calls, God enables and there might be a place of service that God has called you to, that God has gifted you in a particular area and God will equip you. God will enable you to do that work. Brother Somerdorst was with us this morning. He didn't just sign up again at the same job fair and I go to the pastor line and he goes to the evangelist line. It's not how it works. God calls and God equips. And what a joy and what a blessing. And you don't need to turn there, but in 1 Peter chapter 4 and verse number 10, the Bible says, as every man hath received the gift, even so minister the same one to another as good stewards of the manifold grace of God. We're to be good stewards. It's required in stewards, the Bible tells us in 1 Corinthians, that a man be found faithful. And Peter says in 1 Peter 4 and verse number 10, that we're to be good stewards of the manifold grace of God. That as God has enabled and equipped us, that we're good stewards, that we're faithful with that which he has entrusted us with. That we recognize that God has given us the ability to serve him. Paul says it this way. I think about the testimony of Paul when I rejoice for this ability to serve the Lord, but I see Paul rejoicing as well to the same group of people. Notice in 1 Corinthians 15, we were there in chapter 12 just a moment ago, just a few chapters over. Notice what Paul says in 1 Corinthians 15 and verse number 10. As the apostle Paul would understand that it was the Lord that equipped him, that gave him the ability and that Paul had the privilege of serving the Lord and the various ways in which he had the privilege of serving the Lord. He says this in verse 10 of 1 Corinthians 15, but by the grace of God, I am what I am. He says in his grace, which was bestowed upon me was not in vain, but I labored more abundantly than they all, yet not I, but the grace of God which was with me. Therefore, whether it were I or they, so we preach and so ye believed. Remember there's division in Corinth. I'm of Paul, I'm of Apollos and Cephas and so on and so forth and we find that Paul is saying, listen God, I am what I am by the grace of God. God has enabled me and God has equipped me and Paul is rejoicing for the opportunity that he had. He says that I'm laboring, I'm labored more abundantly than they all. Why? Not because he wanted to be a good steward of the manifold grace of God. God used Peter to pen those words in 1 Peter 4 and verse number 10, but no doubt Paul is an example of an individual that had been equipped and enabled by God who was a good steward of the manifold grace of God. He says this as he's writing to the folks in Thessalonica. Notice in 1 Thessalonians chapter number 2, in 1 Thessalonians chapter 2, notice what Paul says. Again, this ability that we have in rejoicing for the ability to serve the Lord. Again, my attitude as I review my attitude, it's a get to situation, not a have to situation. Now the bottom line is that really if you were to dig real deep, you really do have to serve the Lord because you need to be a good, at least you're going to stand before Christ. You're going to give an account. You're going to give an account. But man, I get to. I get to serve him. I get to serve him. In 1 Thessalonians chapter 2, notice what Paul says in chapter 2 and verse number 4. He says, but as we were allowed of God to be put in trust with the gospel, even so we speak, not as pleasing men, but who? But God, which trieth our hearts. Why? For the audience of one. For the audience of one. Paul says as he went into Thessalonica and he's preaching the gospel and of course all that was taking place with regard to the persecution during that particular era of his missionary journey and we see that his attitude is this. We were allowed of God. I had the privilege. I had the opportunity. It was a delight. But Paul, you suffered. But Paul, you were persecuted. But I was allowed of God. God entrusted me. God allowed me to do this. But Paul, you suffered. But it was worth it. You read 2 Corinthians chapter number 4. He says it's worth it. It's worth it. And he says here that we were put in trust with the gospel even so we speak not as pleasing men, but God, which trieth our hearts. You know what happens when you try to please men? You fail. You know why you fail? Because it's impossible to please everyone. It is absolutely impossible to please everyone. And if you want a case study on it, you can control the thermostat next week. You say, well that's such a simple thing. You can't please everyone. Promise you. Promise you. But you know, it's for the audience of one when we serve the Lord. For the audience of one. We're serving God and He's the one that tries the heart. By the way, I'm thankful. My heart's deceitful and so is yours. But God, He trieth the heart. He knows. He knows your motive. He knows why you're serving Him. He knows. He knows what your motive is. By the way, if your motive is to be recognized by man, you have your reward. Just go back to Matthew and read what he says about those Pharisees and those Sadducees. When they prayed those big high prayers and they wanted to be noticed of men, they have their reward. reward. That's what Jesus says. What's the reward? The applause of man. Did you hear him? No, no, no. It's for the audience of one. And when our motive is to please Christ, when our motive is to please Christ and to serve Christ and to do it with a pure heart then he is the one that's exalted and magnified and it's all about him. Will you make people upset? Yeah, you will. But when you keep your focus on I'm serving the Lord, I'm serving the Lord. Paul says it this way in 1 Timothy chapter 1. Think about what Paul says here. It's a verse of scripture that Holly has on her signature of her email and I appreciate this verse of scripture. Many of us have what we might refer to as a life verse. Maybe we sign a card or an email with a particular verse and again Holly has verse 12 of 1 Timothy 1. I want you to notice what Paul says in this verse of scripture. And I thank Christ Jesus our Lord who hath enabled me for that he counted me faithful putting me into the ministry. Notice verse 13 with it. Who was before a blasphemer and a persecutor and injurious but I obtained mercy because I did it ignorantly in unbelief. Listen I'm thankful that I'm not what I used to be. In fact they sang about that this morning in that song. I'm a sinner saved by grace and I'm not what I used to be. Aren't you thankful? I'm no longer a servant of sin, Romans 6 we mentioned that in the beginning of the message. I'm now a servant of righteousness and Paul says this is what I was before but now I have the privilege of serving the Lord and he says I thank Christ Jesus our Lord who hath enabled me for that he counted me faithful putting me into the ministry. What a great perspective. Rejoicing for the ability to serve the Lord. Number three if you're taking notes we must review our attitude, we must rejoice for the ability but number three I want you to recognize what is accomplished when we serve the Lord. Recognize what is accomplished when we serve the Lord. Clearly our service to God is for the audience of one but I would submit to you this morning that it has an impact on many. Our service to God is for the audience of one, the Lord Jesus Christ but it has an impact on many. We read already in 1 Corinthians chapter number 12 where the Bible said and we'll look at a couple of verses there in 1 Corinthians chapter 12 notice as we talked about the gifts of the Spirit he said I don't want you to be ignorant concerning the spiritual gifts in 1 Corinthians chapter 12 he mentioned in verse number 7 that the manifestation of the Spirit is given to every man to profit with all. And so as the body of Christ is assembled and the people of God are enabled and equipped and we serve the Lord it's yes for God to be glorified but we find that it will have a profit on all. Notice this truth see the greatest aspect we talk about recognizing what is accomplished when we serve the Lord is that he is glorified. He's glorified. If our service to God is done the way that we've spoken of thus far in the sermon this morning then God is glorified. Let your light so shine before men that they may see your good works and do what? Glorify your Father which is in heaven. Is that what the Bible tells us? Those are the words of Jesus and we find that that's the purpose right? Notice in 1 Corinthians chapter 12 we look at verse 18 it says but now hath God set the members every one of them in the body notice as it hath pleased him and for the glory of God. See it's his church and in his church he is to receive glory and when we serve the Lord every single one of us as we serve the Lord in the manner in which God has enabled us to serve the Lord and we're good stewards of the manifold grace of God and we're serving God out of that pure heart in doing what he's called us to do then God is glorified. He's exalted and he's magnified. Look at 1 Peter chapter 4 we referenced verse number 10 earlier that the Bible talks about being a good steward of the manifold grace of God but I want you to see what the Bible says in verse number 11. In 1 Peter chapter 4 we find that every man hath received the gift and we're thankful for that and we're to be good stewards of the manifold grace of God but verse number 11 of 1 Peter 4 says this if any man speak let him speak as the oracles of God if any man minister let him do it as of the ability which God giveth and notice this phrase that God in all things may be glorified through Jesus Christ to whom be praise and dominion forever and ever amen. In Ephesians 4 we won't take the time to turn there but we spoke in that portion of scripture how the Lord gave some to the church. He gave the evangelists, some apostles, evangelists, pastors, teachers and he said why for the perfecting of the saints. It's that God would be glorified but number two so that God's people would be edified. What is accomplished when we serve the Lord? We must recognize what's accomplished when we serve the Lord and by the way all of these things are connected. When I recognize what's accomplished it's going to impact, it's going to help me have the right attitude. When I understand that it's him that's given me the ability it's going to help me to have the right attitude. When I have the right attitude then I'm going to serve him the way that I'm supposed to with a pure heart and not for any kind of man accolades and recognition but I'm going to serve the Lord with that pure heart and it's going to accomplish what it's supposed to accomplish. Number one for God to be glorified but number two for God's people to be edified. For the profit of all. That God's people would be edified. That word means to be built up. We find that it's a word the Greek word would often in this particular era be used with regard to the construction of a building and thinking about the edification and how people are to be built up and we find that the Bible says for the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ in Ephesians 4 and verse number 12 and we find that God's people are to be edified and as we serve again, as we serve God it's for the audience of one but it has an impact on many. It's for the audience of one but it has an impact on many and we have been given the opportunity to serve the Lord. What a privilege. What a privilege as we examine our lives and understanding how great God is and certainly each of us would say great is the Lord and greatly to be praised. How has his greatness impacted the way that I pray? But this morning how has his greatness impacted how I serve him? Because he's a great God. He's worthy of our best. Amen. He is worthy of our best. I was reading an author a week ago and I was reading a particular author and he was quoting somebody else and I don't remember who he was quoting so I can't tell you who it was because it wasn't the man that actually wrote the book that I was reading but he was quoting somebody else and here's what he said. He said you and I have a best part of our day. What he was talking about is like some people are morning people, some people are evening people, whatever. We know what the best part of our day is. He said you know what I try to do in my life? I try to give God the best part of my day. The best. Why? Because he deserves it. You go over and read the book of Malachi. What a convicting book. They're bringing some offerings but God says no, no, no would you take that to your governor? No you wouldn't. So why are you bringing it to me? I'm a great God and he is. Listen I know we've joked and I've said it before about that phraseology of it's good enough for government work. Listen it's not good. Our best is what God deserves. By the way aren't you thankful that he gave you his best? I don't want to just mail it in. I don't want to just kind of go through the motions. No, no he deserves my best. He deserves your best. Let me use an example in closing this morning. An example from the Old Testament. Turn back to the book of Exodus if you will. We won't take time to look through all of it. In fact it would be a sermon series to look at all of it. But I want you to look at Exodus 36 and we're going to kind of walk our way through a few verses of scripture throughout the end of the book of Exodus here this morning in closing. With this idea of our service to God for the audience of one. As we examine our lives and we begin to consider how is my service to God? What am I doing for God? How am I serving God? I hope that you have an answer for that question because God has equipped you. He's enabled you. He's given us the opportunity, the ability to serve him. What a privilege it is. We find that in the book of Exodus there's a lot of things that are taking place in the book of Exodus. Of course God is bringing his people out of Egyptian captivity, Egyptian bondage and as God would bring his people out we find that God gives them instruction. He takes Moses up and gives them the Ten Commandments and so on and so forth and the law. He provides for them. The people break even the law as he's up there and receiving instruction with regard to the construction of the tabernacle. And many of us would be familiar with the tabernacle in the Old Testament. The gathering place, the meeting place, the worshipping place if you will for the children of Israel until the time of... Solomon when the temple would be built. So, for a number of generations, it was that God's presence was known physically on earth through the tabernacle. We find that the Bible tells us, and what a joy, in the book of John, that Jesus, he dwelt among us, and that Greek word truly is tabernacled amongst us. What a privilege and what a blessing. You think about the incarnation. But here, we think about the construction of the tabernacle. All of the instruction is given. If you were to study the book of Exodus, and if you were to have an idea of the tabernacle, and all of the intricacies. I mean, it was a very elaborate structure. There was a lot of work that took place. But I want you to understand that if you were to study through the book of Exodus, and begin to try to nail down a time frame, it's about five to six months that it took them to construct the tabernacle. Now, that's pretty amazing. When you consider all that was involved with the tabernacle, and all of the pieces of furniture, and the elaborate work, five to six months for its completion. And we think about this truth as we look at this idea of our service to the Lord. And as we think about the construction of the tabernacle, God had equipped Bezalel and Aholiab. He gives us their names specifically. And by the way, he told Moses about them, not only equipping them for the work, but enabling them to teach others how to do those things. But we find that as we look here, and we think about their work for God, the Bible tells us in Exodus 36, in verse number one, notice it says, then wrought Bezalel and Aholiab, notice, and every wise-hearted man. And then notice this phrase, in whom the Lord put wisdom and understanding to know how to work all manner of work for the service of the sanctuary according to all that the Lord had commanded. So, who was it that equipped them? It was the Lord. Who was it that equips you? It's the Lord. We've belabored the point in the New Testament this morning, for us as God's people in 2023, that God has equipped and enabled us. And here, as we look at this Old Testament illustration to prove the point this morning, to nail it home, if you will, that it was God who had given to Bezalel, Aholiab, and every wise-hearted man, the Lord put wisdom and understanding to know how to work all manner of work for the service of the sanctuary according to all the Lord had commanded. Notice verse two, and Moses called Bezalel and Aholiab and every wise-hearted man, in whose heart the Lord had put wisdom, and every one whose heart stirred him up to come unto the work. Notice these words, to do it. What a privilege. I don't know. God doesn't tell us a whole lot about Bezalel or Aholiab. The other men aren't even name by name. But I'd like to think that these men had a perspective of who am I that God would allow me to be used in this manner. Who am I that I would be privileged, that God would enable me to make these pieces of furniture that would be within the holy place and even the holy of holies. It's amazing. And they were equipped, but they had to do the work. They were equipped for it, but they had to do it. We've been equipped, we've been enabled, we've been given a gift, but we better use it. We better use it. And we find in chapter 36 that God tells us how they were to do the work and how the people brought the materials that were needed. And you read through chapter 36 and 37 and 38 and you find that throughout these chapters that they're working and they're working diligently. They're working. It seems as if as you read the chapters here in the book of Exodus that it's a delight for them. You don't see Moses having to run around and try to, hey, let's go guys, we got to get this done. Let's go. No, no, it looks like it's a delight. It's just joy. We sing the song, there's joy in serving Jesus. And here they're serving the Lord. And you come to chapter 39 of the book of Exodus and look down, if you will, at verse number 32. The Bible says, I'll give you a moment, 39 and verse 32, thus was all the work of the tabernacle of the tent of the congregation, look at that word, finished. It was finished. The children of Israel did according to all that the Lord commanded Moses, so did they. They were faithful. Notice what it said, it was finished. They did the work that they did the work that God called them to do. Notice what it says, according to all that the Lord commanded Moses, so did they. No shortcuts. They did it all. Notice in verse number 42, the end of the chapter, Exodus 39 verse 42, according to all that the Lord commanded Moses, so the children of Israel made all the work. And Moses did look upon all the work and behold, they had done it as the Lord had commanded. Even so had they done it and Moses blessed them. Wow. What an amazing time in Israel's history. Chapter 40 of the book of Exodus, one of my favorite chapters of the Bible, because you see what takes place with the rearing up of the tabernacle. We don't have time to read through it, but you'll notice if you read it later on your own, that you'll find a number of references. In fact, 13 times from verse three down through verse number 15, you read this statement, and thou shout. God told them what to do. God explicitly explained to them the instruction that they're to follow. And then you find that the Bible tells us as the Lord commanded Moses, repeated seven times, and you find that they did it. They did the work. They did what God called them to do. And you come to verse number 34. And in Exodus chapter 40 and verse number 34, it starts with a word then. Then. The word then is an interesting word because it means after something. After the Lord commanded and after they did according to what the Lord commanded then. Then does not come if they don't do. Would you agree? We never read the end of Exodus 40 if they don't do as the Lord commanded them to do. What is accomplished? What is it when we think about this truth of serving the Lord and we recognize what is accomplished when we serve the Lord? We've already noted their attitude. We've understood that God's given them the ability and we find what is accomplished. Well, because they did the work, we're able to read the end of Exodus when the Bible says, then a cloud covered the tent of the congregation and the glory of the Lord filled the tabernacle. Verse 35, and Moses were not able to enter into the tent of the congregation. Why? Because the cloud abode thereon and the glory of the Lord filled the tabernacle. I hope that you'd agree with me this morning that here we would find that God is glorified. There's no, listen, there's no way that God would fill the tabernacle with his glory if he wasn't pleased with what they did. And we find here that God's glory is manifested. His glory fills the tabernacle according to verse 34 and verse number 35 and the Lord is exalted. The Lord is glorified. That's what happens in your life and in my life when we serve the Lord. Listen, God's not called any one of us to build a tabernacle. God's not called, he is, I'm thankful that my body is, when I got saved, when you got saved, our body is the temple of the Holy Ghost. Amen? That's what the New Testament believers, we understand that. You don't have to, God's not called you to do what he called a bezel on a holy abbey and these wise-hearted men, but we find that as they did what God called them to do, as they reviewed, they had the right attitude, they understood the ability that God gave, and they accomplished bringing glory to God. That's the first and primary reason that we serve God is to bring honor and glory to him. But I said this is for the audience of one but has an impact on many. I want you to understand that for generations, for generations, the people of Israel went to a tabernacle and brought their offerings, pointing to Messiah who would one day come because some people served the Lord. There's no record, none that I have found, if you found it, please help me, none that I have found where any of these pieces of furniture are ever remade before the construction of the temple. They did a thorough work. They were diligent in serving the Lord and generations of people were impacted because of their service to God. It was for the glory of God, but it had an impact on many. And I wonder this morning, does our service bring glory to God? How are we serving God? Is it bringing glory to him? Who's it impacting? How is our service having an effect on others? What a joy to have the opportunity to serve the Lord. I think of some Bible characters that served the Lord and had a proper perspective and they understood what God had given them to do. And I think about the way in which David prepared for the house of the Lord, the temple, if you fast forward all of these generations later and you think about what God is doing and how David would prepare for the palace and he says that the palace is not for man but it's for God. So therefore, what was David doing? Man, David was preparing with all of his might, the Bible tells us. He talks about how the house that God would dwell in, that Solomon would build, how that it was to be a great house and how it was to be magnificent and so on and so forth. And we find here that God would use David in this way. I think about the situation as you look at the, after the destruction of Jerusalem and the Babylonian captivity and all that takes place and you begin to think about the rebuilding and what takes place and those opposition and how that the Bible tells us that there were some people that had the opportunity to go and to do a work and here the people were calling, hey, come down here and let's talk and let's do this and what have you and all of those that were trying to prevent the work of God from continuing to go forward. And we find that the perspective was that we're doing a great work. Why? Because it's a work for God. It's a work for God. This morning as we serve the Lord, we're not serving men. As you serve in our church, you're not serving me as the pastor. You're serving the Lord. Does it profit with all? Sure it does. Does it have an impact on the whole body? Sure. That's how it's supposed to work ultimately to bring honor and glory to the Lord. And as we bring honor and glory to the Lord, then we have the opportunity to also have an impact on many. This morning for the audience of one, we serve a great God, a great, great God and He gives us the opportunity, the privilege of being able to serve Him. I wonder this morning, how's our attitude towards serving the Lord? How's our attitude? Do we have the perspective that I have to do this or do we have the perspective that I get to do this? I hope this morning it's a get to perspective, that it's a delight, that there truly is joy in serving Jesus. Recognize this morning it's God who's given us the ability. We must remember that. The only thing special about us is God. It's the only thing special about us. Paul said, I am what I am by the grace of God. This morning we can accomplish great things as we serve the Lord, glorifying Him and then impacting others. This morning for the audience of one, O Lord, would our service be pleasing to Thee? Would we have that right perspective? Let's pray. Father, we love You. How we thank You for loving us. We thank You for the opportunity that You've given us to gather, to hear from Your Word. Thank You for the examples of those in the Scriptures that served You faithfully. God I pray that You would help us to serve You faithfully and acceptably. Lord that we would evaluate our lives, our attitude toward our service to You. God I pray that we bring You honor and glory. I pray that others would be impacted by our service to Thee. Lord maybe there's someone here that's not sure of heaven. They've never been saved. God I pray that today they'd be saved. They'd trust Christ as their Savior. You're understanding they could never work to get to heaven. They could never work to keep themselves saved. Yes, the Bible speaks of our works, our service, it's a result of being saved, not the means by which we are saved. God I pray that the Holy Spirit of God would convict that one that might be here, Lord, that they would understand their need today to be saved. I pray for every child of God, Lord, as we've gathered this morning, we've been challenged by Your Word. I pray that we would evaluate our lives and our service to You. God I pray that You'd help us to do what You've called us to do. That we would be good stewards of the manifold grace of God. That You would use us for Your honor and for Your glory. That many others would be impacted by our service. We'll thank You in these moments of invitation, Lord, for the work that You'll do. I pray that You'd have Your will and way in every individual that's gathered together. We'll thank You for it. In Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano and as she plays the altar is open. Maybe this morning you want to come and thank God for the opportunity to serve. Maybe this morning you've not been serving like you should be and maybe you want to come and ask God to help you in that particular area of your life. If you're not saved we'd love to take a Bible and show you how you can know for sure that heaven's your home as Kimberly plays the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.5799999237060547,
      "text": " And this morning, we're gonna deal with our service"
    },
    {
      "id": 1,
      "start": 3.5799999237060547,
      "end": 4.420000076293945,
      "text": " to the Lord."
    },
    {
      "id": 2,
      "start": 4.420000076293945,
      "end": 7.119999885559082,
      "text": " I've titled the message for the audience of one,"
    },
    {
      "id": 3,
      "start": 7.119999885559082,
      "end": 8.420000076293945,
      "text": " for the audience of one."
    },
    {
      "id": 4,
      "start": 8.420000076293945,
      "end": 11.079999923706055,
      "text": " And I hope that as we go through the message this morning,"
    },
    {
      "id": 5,
      "start": 11.079999923706055,
      "end": 13.520000457763672,
      "text": " that that title will be abundantly clear to you"
    },
    {
      "id": 6,
      "start": 13.520000457763672,
      "end": 16.700000762939453,
      "text": " as what I'm seeking to communicate through this message"
    },
    {
      "id": 7,
      "start": 16.700000762939453,
      "end": 19.639999389648438,
      "text": " for the audience of one."
    },
    {
      "id": 8,
      "start": 19.639999389648438,
      "end": 20.760000228881836,
      "text": " For the last three weeks,"
    },
    {
      "id": 9,
      "start": 20.760000228881836,
      "end": 23.760000228881836,
      "text": " we had the opportunity minus last Sunday,"
    },
    {
      "id": 10,
      "start": 23.760000228881836,
      "end": 26.520000457763672,
      "text": " but as we've dealt with this third phase, if you will,"
    },
    {
      "id": 11,
      "start": 26.520000457763672,
      "end": 28.18000030517578,
      "text": " for our annual theme,"
    },
    {
      "id": 12,
      "start": 28.18000030517578,
      "end": 30.940000534057617,
      "text": " the great is the Lord and greatly to be praised."
    },
    {
      "id": 13,
      "start": 30.940000534057617,
      "end": 32.5,
      "text": " We discovered his greatness."
    },
    {
      "id": 14,
      "start": 32.5,
      "end": 35.29999923706055,
      "text": " We spoke about the importance of declaring his greatness."
    },
    {
      "id": 15,
      "start": 35.29999923706055,
      "end": 36.68000030517578,
      "text": " And then for this third phase,"
    },
    {
      "id": 16,
      "start": 36.68000030517578,
      "end": 39.540000915527344,
      "text": " we've dealt with the subject of how God's greatness"
    },
    {
      "id": 17,
      "start": 39.540000915527344,
      "end": 41.459999084472656,
      "text": " will impact our lives."
    },
    {
      "id": 18,
      "start": 41.459999084472656,
      "end": 44.459999084472656,
      "text": " And I believe that when we understand how great he is,"
    },
    {
      "id": 19,
      "start": 44.459999084472656,
      "end": 47.5,
      "text": " it should have an impact on each of us."
    },
    {
      "id": 20,
      "start": 47.5,
      "end": 49.97999954223633,
      "text": " For indeed it is true that what we believe"
    },
    {
      "id": 21,
      "start": 49.97999954223633,
      "end": 52.13999938964844,
      "text": " will impact our behavior."
    },
    {
      "id": 22,
      "start": 52.13999938964844,
      "end": 53.0,
      "text": " For three weeks,"
    },
    {
      "id": 23,
      "start": 53.0,
      "end": 56.220001220703125,
      "text": " we spent time looking at the subject matter of prayer."
    },
    {
      "id": 24,
      "start": 56.220001220703125,
      "end": 58.099998474121094,
      "text": " And there were several times that we noted"
    },
    {
      "id": 25,
      "start": 58.939998626708984,
      "end": 60.41999816894531,
      "text": " that what we believe to be true about God,"
    },
    {
      "id": 26,
      "start": 60.41999816894531,
      "end": 62.86000061035156,
      "text": " and we find that in his precious word"
    },
    {
      "id": 27,
      "start": 62.86000061035156,
      "end": 65.0199966430664,
      "text": " will impact how we pray."
    },
    {
      "id": 28,
      "start": 65.0199966430664,
      "end": 67.58000183105469,
      "text": " We pray that God will move mountains because he can,"
    },
    {
      "id": 29,
      "start": 67.58000183105469,
      "end": 70.0199966430664,
      "text": " because he's God, because he has all power,"
    },
    {
      "id": 30,
      "start": 70.0199966430664,
      "end": 71.83999633789062,
      "text": " because he's reigning and ruling."
    },
    {
      "id": 31,
      "start": 71.83999633789062,
      "end": 74.62000274658203,
      "text": " We pray that God would save sinners because he's able."
    },
    {
      "id": 32,
      "start": 74.62000274658203,
      "end": 76.54000091552734,
      "text": " And you think about the way that we pray,"
    },
    {
      "id": 33,
      "start": 76.54000091552734,
      "end": 78.9000015258789,
      "text": " it's based upon what we believe to be true"
    },
    {
      "id": 34,
      "start": 78.9000015258789,
      "end": 82.36000061035156,
      "text": " about God's word, about who God is."
    },
    {
      "id": 35,
      "start": 82.36000061035156,
      "end": 84.18000030517578,
      "text": " We find that we've looked at David,"
    },
    {
      "id": 36,
      "start": 84.18000030517578,
      "end": 86.05999755859375,
      "text": " the life of David in Psalm 32."
    },
    {
      "id": 37,
      "start": 86.05999755859375,
      "end": 87.72000122070312,
      "text": " We look at the life of Daniel."
    },
    {
      "id": 38,
      "start": 88.23999786376953,
      "end": 90.5199966430664,
      "text": " Why did Daniel have such confidence in praying"
    },
    {
      "id": 39,
      "start": 90.5199966430664,
      "end": 93.66000366210938,
      "text": " that God would show him not only the dream,"
    },
    {
      "id": 40,
      "start": 93.66000366210938,
      "end": 95.76000213623047,
      "text": " but the interpretation of the dream,"
    },
    {
      "id": 41,
      "start": 95.76000213623047,
      "end": 97.30000305175781,
      "text": " because he knew who God was."
    },
    {
      "id": 42,
      "start": 98.16000366210938,
      "end": 99.55999755859375,
      "text": " He knew who God was."
    },
    {
      "id": 43,
      "start": 99.55999755859375,
      "end": 102.36000061035156,
      "text": " And therefore he prayed that God would give an answer."
    },
    {
      "id": 44,
      "start": 102.36000061035156,
      "end": 103.76000213623047,
      "text": " And guess what God did."
    },
    {
      "id": 45,
      "start": 103.76000213623047,
      "end": 106.27999877929688,
      "text": " And Daniel did not stand before Nebuchadnezzar"
    },
    {
      "id": 46,
      "start": 106.27999877929688,
      "end": 107.4000015258789,
      "text": " and say that I'm able."
    },
    {
      "id": 47,
      "start": 107.4000015258789,
      "end": 110.23999786376953,
      "text": " He said, there's a God in heaven and praise the Lord."
    },
    {
      "id": 48,
      "start": 110.23999786376953,
      "end": 111.08000183105469,
      "text": " He's still there."
    },
    {
      "id": 49,
      "start": 111.08000183105469,
      "end": 113.0199966430664,
      "text": " He rules and he reigns and he's able."
    },
    {
      "id": 50,
      "start": 113.0199966430664,
      "end": 115.33999633789062,
      "text": " We had the opportunity to look at the life of Paul."
    },
    {
      "id": 51,
      "start": 115.33999633789062,
      "end": 117.37999725341797,
      "text": " And we dealt with the subject matter of a life"
    },
    {
      "id": 52,
      "start": 117.37999725341797,
      "end": 118.9800033569336,
      "text": " marked by prayer."
    },
    {
      "id": 53,
      "start": 118.9800033569336,
      "end": 120.22000122070312,
      "text": " And we looked at his life."
    },
    {
      "id": 54,
      "start": 120.22000122070312,
      "end": 122.73999786376953,
      "text": " And as we were challenged through those messages"
    },
    {
      "id": 55,
      "start": 122.73999786376953,
      "end": 124.62000274658203,
      "text": " to examine our own prayer lives,"
    },
    {
      "id": 56,
      "start": 124.62000274658203,
      "end": 128.5,
      "text": " and in order to determine how our prayer lives"
    },
    {
      "id": 57,
      "start": 128.5,
      "end": 131.13999938964844,
      "text": " have been shaped, have been impacted"
    },
    {
      "id": 58,
      "start": 131.13999938964844,
      "end": 134.13999938964844,
      "text": " by what God has given to us in his word"
    },
    {
      "id": 59,
      "start": 134.13999938964844,
      "end": 136.22000122070312,
      "text": " about how great he is."
    },
    {
      "id": 60,
      "start": 136.22000122070312,
      "end": 137.94000244140625,
      "text": " What is it that's on your prayer list?"
    },
    {
      "id": 61,
      "start": 137.94000244140625,
      "end": 139.82000732421875,
      "text": " What is it that we're praying about right now"
    },
    {
      "id": 62,
      "start": 139.82000732421875,
      "end": 141.89999389648438,
      "text": " that only God can do?"
    },
    {
      "id": 63,
      "start": 141.89999389648438,
      "end": 145.22000122070312,
      "text": " And that really will impact as we examine these things,"
    },
    {
      "id": 64,
      "start": 146.05999755859375,
      "end": 146.89999389648438,
      "text": " how we pray."
    },
    {
      "id": 65,
      "start": 146.89999389648438,
      "end": 149.4600067138672,
      "text": " This morning, I'd like to move into a second thought"
    },
    {
      "id": 66,
      "start": 149.4600067138672,
      "end": 152.4600067138672,
      "text": " and that would be our service to God."
    },
    {
      "id": 67,
      "start": 152.4600067138672,
      "end": 155.17999267578125,
      "text": " You know, it's a privilege to serve God."
    },
    {
      "id": 68,
      "start": 155.17999267578125,
      "end": 158.05999755859375,
      "text": " And I would say this morning that when I truly understand"
    },
    {
      "id": 69,
      "start": 158.05999755859375,
      "end": 162.17999267578125,
      "text": " how great our God is, it should impact how I serve him."
    },
    {
      "id": 70,
      "start": 162.17999267578125,
      "end": 164.13999938964844,
      "text": " I'm not just serving a mere human."
    },
    {
      "id": 71,
      "start": 164.13999938964844,
      "end": 166.8800048828125,
      "text": " I'm not just serving some false idol."
    },
    {
      "id": 72,
      "start": 166.8800048828125,
      "end": 168.72000122070312,
      "text": " No, I'm serving the great I am."
    },
    {
      "id": 73,
      "start": 168.72000122070312,
      "end": 171.97999572753906,
      "text": " I'm serving the King of Kings and Lord of Lords."
    },
    {
      "id": 74,
      "start": 171.97999572753906,
      "end": 174.6999969482422,
      "text": " And as we consider that thought this morning"
    },
    {
      "id": 75,
      "start": 174.6999969482422,
      "end": 177.86000061035156,
      "text": " and understanding that as we serve God,"
    },
    {
      "id": 76,
      "start": 177.86000061035156,
      "end": 180.5399932861328,
      "text": " we must never lose sight of the fact"
    },
    {
      "id": 77,
      "start": 180.5399932861328,
      "end": 183.3000030517578,
      "text": " that we are serving God."
    },
    {
      "id": 78,
      "start": 183.3000030517578,
      "end": 185.5399932861328,
      "text": " Yes, will our service be to people?"
    },
    {
      "id": 79,
      "start": 185.5399932861328,
      "end": 186.74000549316406,
      "text": " No doubt."
    },
    {
      "id": 80,
      "start": 186.74000549316406,
      "end": 191.74000549316406,
      "text": " But ultimately, our service is for the audience of one."
    },
    {
      "id": 81,
      "start": 192.02000427246094,
      "end": 193.4600067138672,
      "text": " It's for God."
    },
    {
      "id": 82,
      "start": 193.4600067138672,
      "end": 195.17999267578125,
      "text": " What a privilege it is to serve the Lord."
    },
    {
      "id": 83,
      "start": 195.17999267578125,
      "end": 196.5399932861328,
      "text": " Notice in Ephesians chapter two,"
    },
    {
      "id": 84,
      "start": 196.5399932861328,
      "end": 198.13999938964844,
      "text": " we're familiar with verses eight and nine."
    },
    {
      "id": 85,
      "start": 198.13999938964844,
      "end": 200.5,
      "text": " I'll read them together with verse number 10."
    },
    {
      "id": 86,
      "start": 200.5,
      "end": 204.17999267578125,
      "text": " The Bible says, for by grace are you saved through faith."
    },
    {
      "id": 87,
      "start": 205.02000427246094,
      "end": 207.13999938964844,
      "text": " And that not of yourselves, it is the gift of God,"
    },
    {
      "id": 88,
      "start": 207.13999938964844,
      "end": 210.05999755859375,
      "text": " not of works, lest any man should boast."
    },
    {
      "id": 89,
      "start": 210.05999755859375,
      "end": 213.6199951171875,
      "text": " Notice verse 10, for we are his workmanship,"
    },
    {
      "id": 90,
      "start": 213.6199951171875,
      "end": 217.4199981689453,
      "text": " created in Christ Jesus unto good works,"
    },
    {
      "id": 91,
      "start": 217.4199981689453,
      "end": 222.4199981689453,
      "text": " which God hath before ordained that we should walk in them."
    },
    {
      "id": 92,
      "start": 223.74000549316406,
      "end": 225.3800048828125,
      "text": " So we're gonna think about this truth"
    },
    {
      "id": 93,
      "start": 225.3800048828125,
      "end": 227.3800048828125,
      "text": " of our service to the Lord."
    },
    {
      "id": 94,
      "start": 227.3800048828125,
      "end": 228.8800048828125,
      "text": " I want you to consider just a few thoughts"
    },
    {
      "id": 95,
      "start": 228.8800048828125,
      "end": 229.72000122070312,
      "text": " with me this morning."
    },
    {
      "id": 96,
      "start": 230.0800018310547,
      "end": 232.24000549316406,
      "text": " Number one, we should review our attitude"
    },
    {
      "id": 97,
      "start": 232.24000549316406,
      "end": 233.72000122070312,
      "text": " towards serving the Lord."
    },
    {
      "id": 98,
      "start": 233.72000122070312,
      "end": 236.16000366210938,
      "text": " We should review our attitude towards serving the Lord."
    },
    {
      "id": 99,
      "start": 236.16000366210938,
      "end": 238.52000427246094,
      "text": " In other words, we understand, the Bible says here,"
    },
    {
      "id": 100,
      "start": 238.52000427246094,
      "end": 243.24000549316406,
      "text": " we are his workmanship, created in Christ Jesus,"
    },
    {
      "id": 101,
      "start": 243.24000549316406,
      "end": 246.9199981689453,
      "text": " notice, unto good works, which God hath before ordained"
    },
    {
      "id": 102,
      "start": 246.9199981689453,
      "end": 248.72000122070312,
      "text": " that we should walk in them."
    },
    {
      "id": 103,
      "start": 248.72000122070312,
      "end": 250.72000122070312,
      "text": " Before salvation, before you trust"
    },
    {
      "id": 104,
      "start": 250.72000122070312,
      "end": 251.67999267578125,
      "text": " that Christ is your Savior,"
    },
    {
      "id": 105,
      "start": 251.67999267578125,
      "end": 253.72000122070312,
      "text": " before I trust that Christ is my Savior,"
    },
    {
      "id": 106,
      "start": 253.72000122070312,
      "end": 256.3599853515625,
      "text": " if you're here this morning and you've not yet been saved,"
    },
    {
      "id": 107,
      "start": 256.3599853515625,
      "end": 259.32000732421875,
      "text": " according to the Bible in Romans six and verse number 17,"
    },
    {
      "id": 108,
      "start": 260.0400085449219,
      "end": 265.0400085449219,
      "text": " I was a servant of sin, but in Christ."
    },
    {
      "id": 109,
      "start": 265.3599853515625,
      "end": 266.7200012207031,
      "text": " According to Romans 6, 18,"
    },
    {
      "id": 110,
      "start": 266.7200012207031,
      "end": 269.3599853515625,
      "text": " no longer am I a servant of sin,"
    },
    {
      "id": 111,
      "start": 269.3599853515625,
      "end": 271.55999755859375,
      "text": " but now I serve the Lord Jesus Christ"
    },
    {
      "id": 112,
      "start": 271.55999755859375,
      "end": 274.6400146484375,
      "text": " and I am a servant of righteousness."
    },
    {
      "id": 113,
      "start": 274.6400146484375,
      "end": 276.55999755859375,
      "text": " And you know, the reality is I'd much rather"
    },
    {
      "id": 114,
      "start": 276.55999755859375,
      "end": 279.79998779296875,
      "text": " be a servant of righteousness than a servant of sin."
    },
    {
      "id": 115,
      "start": 279.79998779296875,
      "end": 282.7200012207031,
      "text": " And we find that truth to be there for us"
    },
    {
      "id": 116,
      "start": 282.7200012207031,
      "end": 284.9200134277344,
      "text": " in Romans six, verse 17 and 18."
    },
    {
      "id": 117,
      "start": 284.9200134277344,
      "end": 287.9599914550781,
      "text": " But when we understand this truth about serving the Lord"
    },
    {
      "id": 118,
      "start": 287.9599914550781,
      "end": 291.1199951171875,
      "text": " and reviewing our attitude towards our service,"
    },
    {
      "id": 119,
      "start": 291.1199951171875,
      "end": 294.55999755859375,
      "text": " I wonder this morning, do we have the perspective"
    },
    {
      "id": 120,
      "start": 294.55999755859375,
      "end": 296.7200012207031,
      "text": " that I have to serve the Lord,"
    },
    {
      "id": 121,
      "start": 296.7200012207031,
      "end": 300.3599853515625,
      "text": " or do we have the perspective that I get to serve the Lord?"
    },
    {
      "id": 122,
      "start": 300.3599853515625,
      "end": 303.9200134277344,
      "text": " There's a great difference between having that perspective"
    },
    {
      "id": 123,
      "start": 303.9200134277344,
      "end": 306.0,
      "text": " that I have to do this,"
    },
    {
      "id": 124,
      "start": 306.0,
      "end": 307.9599914550781,
      "text": " and sometimes when we take that perspective,"
    },
    {
      "id": 125,
      "start": 307.9599914550781,
      "end": 310.6199951171875,
      "text": " it becomes overbearing, it becomes duty,"
    },
    {
      "id": 126,
      "start": 310.6199951171875,
      "end": 313.6000061035156,
      "text": " it's just difficult and maybe with drudgery,"
    },
    {
      "id": 127,
      "start": 313.6000061035156,
      "end": 315.0799865722656,
      "text": " but when we have the perspective,"
    },
    {
      "id": 128,
      "start": 315.0799865722656,
      "end": 317.260009765625,
      "text": " when we review our attitude and understand"
    },
    {
      "id": 129,
      "start": 317.260009765625,
      "end": 319.17999267578125,
      "text": " that we are his workmanship,"
    },
    {
      "id": 130,
      "start": 319.17999267578125,
      "end": 321.2200012207031,
      "text": " that God has created us for this,"
    },
    {
      "id": 131,
      "start": 321.2200012207031,
      "end": 323.8999938964844,
      "text": " that he has designed it to be so,"
    },
    {
      "id": 132,
      "start": 323.8999938964844,
      "end": 326.70001220703125,
      "text": " then I say, I get to serve the Lord."
    },
    {
      "id": 133,
      "start": 326.70001220703125,
      "end": 328.8999938964844,
      "text": " I get to serve Christ."
    },
    {
      "id": 134,
      "start": 328.8999938964844,
      "end": 331.3800048828125,
      "text": " What a privilege, what a blessing."
    },
    {
      "id": 135,
      "start": 331.3800048828125,
      "end": 334.82000732421875,
      "text": " We find this morning that the Bible is abundantly clear."
    },
    {
      "id": 136,
      "start": 334.82000732421875,
      "end": 338.260009765625,
      "text": " When we think about this truth of our service to God,"
    },
    {
      "id": 137,
      "start": 338.260009765625,
      "end": 340.94000244140625,
      "text": " we do not serve the Lord to get saved."
    },
    {
      "id": 138,
      "start": 341.94000244140625,
      "end": 344.7799987792969,
      "text": " Ephesians two and eight in verse eight and nine"
    },
    {
      "id": 139,
      "start": 344.7799987792969,
      "end": 346.3399963378906,
      "text": " are quite clear that the Bible says,"
    },
    {
      "id": 140,
      "start": 346.3399963378906,
      "end": 349.4200134277344,
      "text": " for by grace are you saved through faith,"
    },
    {
      "id": 141,
      "start": 349.4200134277344,
      "end": 352.3800048828125,
      "text": " and that not of yourselves, it is the gift of God,"
    },
    {
      "id": 142,
      "start": 352.3800048828125,
      "end": 356.0400085449219,
      "text": " not of works, lest any man should be saved,"
    },
    {
      "id": 143,
      "start": 356.9800109863281,
      "end": 358.1400146484375,
      "text": " lest any man should boast,"
    },
    {
      "id": 144,
      "start": 358.1400146484375,
      "end": 361.29998779296875,
      "text": " and so we think about Ephesians two, verses eight and nine,"
    },
    {
      "id": 145,
      "start": 361.29998779296875,
      "end": 363.6199951171875,
      "text": " we understand the Bible is abundantly clear"
    },
    {
      "id": 146,
      "start": 363.6199951171875,
      "end": 365.5799865722656,
      "text": " when we speak about our service to God."
    },
    {
      "id": 147,
      "start": 365.5799865722656,
      "end": 368.2799987792969,
      "text": " It's not so that you can be saved."
    },
    {
      "id": 148,
      "start": 368.2799987792969,
      "end": 370.5799865722656,
      "text": " It's not even that you could stay saved."
    },
    {
      "id": 149,
      "start": 370.5799865722656,
      "end": 373.2200012207031,
      "text": " See, you can't serve God to stay saved"
    },
    {
      "id": 150,
      "start": 373.2200012207031,
      "end": 375.6600036621094,
      "text": " just like you can't serve God to get saved."
    },
    {
      "id": 151,
      "start": 375.6600036621094,
      "end": 378.3999938964844,
      "text": " The Bible tells us in 1 Peter one, verses four and five,"
    },
    {
      "id": 152,
      "start": 378.3999938964844,
      "end": 380.8399963378906,
      "text": " that we are kept by the power of God."
    },
    {
      "id": 153,
      "start": 380.8399963378906,
      "end": 382.5,
      "text": " We find that we have an inheritance"
    },
    {
      "id": 154,
      "start": 382.5,
      "end": 384.8599853515625,
      "text": " that's reserved in heaven for us."
    },
    {
      "id": 155,
      "start": 384.8599853515625,
      "end": 389.4599914550781,
      "text": " I cannot work to be saved, nor can I work to stay saved,"
    },
    {
      "id": 156,
      "start": 389.4599914550781,
      "end": 391.6600036621094,
      "text": " but when we understand and we examine,"
    },
    {
      "id": 157,
      "start": 391.6600036621094,
      "end": 394.239990234375,
      "text": " we review our attitude towards serving the Lord,"
    },
    {
      "id": 158,
      "start": 394.239990234375,
      "end": 398.1000061035156,
      "text": " we understand this morning that we get to serve God"
    },
    {
      "id": 159,
      "start": 398.1000061035156,
      "end": 400.5799865722656,
      "text": " because we are saved."
    },
    {
      "id": 160,
      "start": 400.5799865722656,
      "end": 402.5400085449219,
      "text": " It's the result of being saved"
    },
    {
      "id": 161,
      "start": 402.5400085449219,
      "end": 405.1000061035156,
      "text": " that gives us the privilege and the opportunity"
    },
    {
      "id": 162,
      "start": 405.1000061035156,
      "end": 408.05999755859375,
      "text": " to serve the master, to serve the king of kings"
    },
    {
      "id": 163,
      "start": 408.05999755859375,
      "end": 410.8599853515625,
      "text": " and Lord of lords, and what a great privilege it is."
    },
    {
      "id": 164,
      "start": 410.8599853515625,
      "end": 412.2200012207031,
      "text": " But at times, if we're not careful,"
    },
    {
      "id": 165,
      "start": 412.2200012207031,
      "end": 414.2200012207031,
      "text": " our attitude can kind of get sideways"
    },
    {
      "id": 166,
      "start": 414.2200012207031,
      "end": 415.760009765625,
      "text": " with regard to service."
    },
    {
      "id": 167,
      "start": 415.760009765625,
      "end": 417.5799865722656,
      "text": " We can kind of get into the drudgery"
    },
    {
      "id": 168,
      "start": 417.5799865722656,
      "end": 418.94000244140625,
      "text": " and the monotony, if you will,"
    },
    {
      "id": 169,
      "start": 418.94000244140625,
      "end": 420.6199951171875,
      "text": " and we can get overwhelmed with it,"
    },
    {
      "id": 170,
      "start": 420.6199951171875,
      "end": 424.5400085449219,
      "text": " and we lose our focus that we're serving the Lord,"
    },
    {
      "id": 171,
      "start": 424.5400085449219,
      "end": 427.5799865722656,
      "text": " we're serving the master, and what a blessing."
    },
    {
      "id": 172,
      "start": 427.5799865722656,
      "end": 430.3599853515625,
      "text": " Think about the perspective, if you will,"
    },
    {
      "id": 173,
      "start": 431.1400146484375,
      "end": 432.67999267578125,
      "text": " of the psalmist, or Psalm 84,"
    },
    {
      "id": 174,
      "start": 432.67999267578125,
      "end": 434.6199951171875,
      "text": " and I want you to look at a couple of verses"
    },
    {
      "id": 175,
      "start": 434.6199951171875,
      "end": 436.8399963378906,
      "text": " within the Psalms, because really,"
    },
    {
      "id": 176,
      "start": 436.8399963378906,
      "end": 439.8399963378906,
      "text": " I hope this morning that your service for Christ"
    },
    {
      "id": 177,
      "start": 439.8399963378906,
      "end": 443.17999267578125,
      "text": " is a delight, that it's a delight."
    },
    {
      "id": 178,
      "start": 443.17999267578125,
      "end": 445.4200134277344,
      "text": " We understand that God has designed it"
    },
    {
      "id": 179,
      "start": 445.4200134277344,
      "end": 447.67999267578125,
      "text": " that his children would serve him,"
    },
    {
      "id": 180,
      "start": 447.67999267578125,
      "end": 450.32000732421875,
      "text": " and what a blessing it is, and you say,"
    },
    {
      "id": 181,
      "start": 450.32000732421875,
      "end": 453.2799987792969,
      "text": " as we look at this truth of serving the Lord,"
    },
    {
      "id": 182,
      "start": 453.2799987792969,
      "end": 454.6400146484375,
      "text": " we understand that it comes,"
    },
    {
      "id": 183,
      "start": 454.6400146484375,
      "end": 455.79998779296875,
      "text": " and we'll look at our next point,"
    },
    {
      "id": 184,
      "start": 455.79998779296875,
      "end": 459.1600036621094,
      "text": " it comes in a variety of shapes and sizes,"
    },
    {
      "id": 185,
      "start": 459.1600036621094,
      "end": 460.8399963378906,
      "text": " and everyone's service is not the same,"
    },
    {
      "id": 186,
      "start": 460.8399963378906,
      "end": 462.8800048828125,
      "text": " but what a privilege it is to serve the Lord,"
    },
    {
      "id": 187,
      "start": 462.8800048828125,
      "end": 464.0400085449219,
      "text": " and it should be a delight."
    },
    {
      "id": 188,
      "start": 464.0400085449219,
      "end": 467.0400085449219,
      "text": " In Psalm 84, notice in verse number 10,"
    },
    {
      "id": 189,
      "start": 467.0400085449219,
      "end": 470.44000244140625,
      "text": " the Bible says, for a day in thy court"
    },
    {
      "id": 190,
      "start": 470.44000244140625,
      "end": 472.67999267578125,
      "text": " is better than a thousand."
    },
    {
      "id": 191,
      "start": 472.67999267578125,
      "end": 477.5,
      "text": " I had rather be a doorkeeper in the house of my God"
    },
    {
      "id": 192,
      "start": 477.5,
      "end": 481.5199890136719,
      "text": " than to dwell in the tents of wickedness."
    },
    {
      "id": 193,
      "start": 481.5199890136719,
      "end": 483.239990234375,
      "text": " I want you to think about that just for a moment."
    },
    {
      "id": 194,
      "start": 483.239990234375,
      "end": 487.7200012207031,
      "text": " The psalmist says that they'd rather be a doorkeeper"
    },
    {
      "id": 195,
      "start": 487.7200012207031,
      "end": 492.7200012207031,
      "text": " in the house of my God, a doorkeeper."
    },
    {
      "id": 196,
      "start": 492.8399963378906,
      "end": 494.67999267578125,
      "text": " You say, well, that's kind of a,"
    },
    {
      "id": 197,
      "start": 494.67999267578125,
      "end": 497.260009765625,
      "text": " no, no, no, that's a service to the king."
    },
    {
      "id": 198,
      "start": 497.260009765625,
      "end": 498.760009765625,
      "text": " It's a privilege, it's a delight"
    },
    {
      "id": 199,
      "start": 498.760009765625,
      "end": 500.1600036621094,
      "text": " to be able to serve the Lord,"
    },
    {
      "id": 200,
      "start": 500.1600036621094,
      "end": 502.32000732421875,
      "text": " and you think about the perspective here."
    },
    {
      "id": 201,
      "start": 502.32000732421875,
      "end": 504.0199890136719,
      "text": " It says I'd rather do that"
    },
    {
      "id": 202,
      "start": 504.0199890136719,
      "end": 506.29998779296875,
      "text": " than to dwell in the tents of wickedness."
    },
    {
      "id": 203,
      "start": 506.29998779296875,
      "end": 508.44000244140625,
      "text": " I want you to think about your service to the Lord,"
    },
    {
      "id": 204,
      "start": 508.44000244140625,
      "end": 510.0799865722656,
      "text": " and the reality is that, listen,"
    },
    {
      "id": 205,
      "start": 510.0799865722656,
      "end": 512.6400146484375,
      "text": " I'd rather clean bathrooms for the Lord"
    },
    {
      "id": 206,
      "start": 512.6400146484375,
      "end": 516.4000244140625,
      "text": " than do something else for the world, amen,"
    },
    {
      "id": 207,
      "start": 516.47998046875,
      "end": 517.760009765625,
      "text": " and what a delight."
    },
    {
      "id": 208,
      "start": 517.760009765625,
      "end": 519.3599853515625,
      "text": " Somebody came to me not long ago and said,"
    },
    {
      "id": 209,
      "start": 519.3599853515625,
      "end": 520.6799926757812,
      "text": " pastor, what can I do?"
    },
    {
      "id": 210,
      "start": 520.6799926757812,
      "end": 523.0800170898438,
      "text": " I'll clean toilets, I'll clean this, I'll do that,"
    },
    {
      "id": 211,
      "start": 523.0800170898438,
      "end": 526.3200073242188,
      "text": " whatever, I just wanna serve the Lord,"
    },
    {
      "id": 212,
      "start": 526.3200073242188,
      "end": 529.5599975585938,
      "text": " and praise the Lord for that kind of perspective"
    },
    {
      "id": 213,
      "start": 529.5599975585938,
      "end": 533.4400024414062,
      "text": " because why, it's a privilege to serve God."
    },
    {
      "id": 214,
      "start": 533.4400024414062,
      "end": 534.7999877929688,
      "text": " It is an absolute privilege."
    },
    {
      "id": 215,
      "start": 534.7999877929688,
      "end": 537.0399780273438,
      "text": " The psalmist says here in Psalm 84,"
    },
    {
      "id": 216,
      "start": 537.0399780273438,
      "end": 538.02001953125,
      "text": " what he would rather do,"
    },
    {
      "id": 217,
      "start": 538.02001953125,
      "end": 539.760009765625,
      "text": " be a doorkeeper in the house of my God."
    },
    {
      "id": 218,
      "start": 539.760009765625,
      "end": 543.1599731445312,
      "text": " I want you to think about Psalm 100,"
    },
    {
      "id": 219,
      "start": 543.1599731445312,
      "end": 544.9600219726562,
      "text": " and of course, we're familiar with that psalm."
    },
    {
      "id": 220,
      "start": 544.9600219726562,
      "end": 546.8400268554688,
      "text": " It's a very familiar psalm to us,"
    },
    {
      "id": 221,
      "start": 546.8400268554688,
      "end": 548.4400024414062,
      "text": " but I want you to see what the psalmist says"
    },
    {
      "id": 222,
      "start": 548.4400024414062,
      "end": 550.47998046875,
      "text": " in Psalm 100 in verse number two."
    },
    {
      "id": 223,
      "start": 550.47998046875,
      "end": 553.0999755859375,
      "text": " The Bible says this, serve the Lord how?"
    },
    {
      "id": 224,
      "start": 553.0999755859375,
      "end": 555.9199829101562,
      "text": " With gladness, with gladness."
    },
    {
      "id": 225,
      "start": 555.9199829101562,
      "end": 558.6400146484375,
      "text": " Come before his presence with singing,"
    },
    {
      "id": 226,
      "start": 558.6400146484375,
      "end": 560.52001953125,
      "text": " and we think about this truth"
    },
    {
      "id": 227,
      "start": 560.52001953125,
      "end": 563.3599853515625,
      "text": " as we review our attitude towards serving the Lord."
    },
    {
      "id": 228,
      "start": 563.3599853515625,
      "end": 565.47998046875,
      "text": " I get to do this, I get to serve God."
    },
    {
      "id": 229,
      "start": 565.47998046875,
      "end": 568.239990234375,
      "text": " I can do it with gladness, and why?"
    },
    {
      "id": 230,
      "start": 568.239990234375,
      "end": 571.760009765625,
      "text": " Because my perspective is that it's for the audience of one,"
    },
    {
      "id": 231,
      "start": 571.760009765625,
      "end": 572.739990234375,
      "text": " for the audience of one."
    },
    {
      "id": 232,
      "start": 572.739990234375,
      "end": 574.3200073242188,
      "text": " I'm serving the Lord."
    },
    {
      "id": 233,
      "start": 574.6799926757812,
      "end": 576.5999755859375,
      "text": " I have the privilege of being able to serve Christ."
    },
    {
      "id": 234,
      "start": 576.5999755859375,
      "end": 579.1199951171875,
      "text": " You say, well, as the pastor, you get to,"
    },
    {
      "id": 235,
      "start": 579.1199951171875,
      "end": 581.4400024414062,
      "text": " no, no, listen, we get to serve Christ."
    },
    {
      "id": 236,
      "start": 581.4400024414062,
      "end": 584.8599853515625,
      "text": " There were many a day after I trusted Christ as my savior,"
    },
    {
      "id": 237,
      "start": 584.8599853515625,
      "end": 586.3200073242188,
      "text": " I was an usher at our church,"
    },
    {
      "id": 238,
      "start": 586.3200073242188,
      "end": 588.2000122070312,
      "text": " the first church I ever went to after I got saved,"
    },
    {
      "id": 239,
      "start": 588.2000122070312,
      "end": 590.52001953125,
      "text": " and I was an usher at that church as a teenager,"
    },
    {
      "id": 240,
      "start": 590.52001953125,
      "end": 592.4400024414062,
      "text": " and you know what the job of the ushers were?"
    },
    {
      "id": 241,
      "start": 592.4400024414062,
      "end": 594.1599731445312,
      "text": " All the ushers are gonna get scared this morning."
    },
    {
      "id": 242,
      "start": 594.1599731445312,
      "end": 596.3200073242188,
      "text": " The job of the ushers every Saturday morning"
    },
    {
      "id": 243,
      "start": 596.3200073242188,
      "end": 598.1599731445312,
      "text": " was to go to the church house and clean the house,"
    },
    {
      "id": 244,
      "start": 598.1599731445312,
      "end": 600.760009765625,
      "text": " the church house, and we went to that church house."
    },
    {
      "id": 0,
      "start": 600.760009765625,
      "end": 605.0000095367432,
      "text": " church house, all the ushers, we get together on Saturday morning early before visitation and we'd"
    },
    {
      "id": 1,
      "start": 605.0000095367432,
      "end": 609.5600099563599,
      "text": " get there and we'd spend a couple of hours before visitation cleaning that church house. Then we go"
    },
    {
      "id": 2,
      "start": 609.5600099563599,
      "end": 614.5200099945068,
      "text": " on visitation, we come back after visitation and we clean the church house some more. And you know"
    },
    {
      "id": 3,
      "start": 614.5200099945068,
      "end": 620.5200099945068,
      "text": " it was a delight. It was just a joy to be able to serve the Lord. And at times we must review"
    },
    {
      "id": 4,
      "start": 620.5200099945068,
      "end": 624.1200103759766,
      "text": " our attitude towards serving the Lord because we don't want to get bogged down in the work."
    },
    {
      "id": 5,
      "start": 624.1200103759766,
      "end": 628.6000099182129,
      "text": " We don't want to get overwhelmed. We don't want to look at the wrong thing. We want to remind"
    },
    {
      "id": 6,
      "start": 628.6000099182129,
      "end": 634.2800102233887,
      "text": " ourselves that we're serving the Lord, that it's for the audience of one. I don't have to,"
    },
    {
      "id": 7,
      "start": 634.2800102233887,
      "end": 641.2400093078613,
      "text": " but I get to. It's a great perspective in life. Number two, we must rejoice for the ability to"
    },
    {
      "id": 8,
      "start": 641.2400093078613,
      "end": 645.8800086975098,
      "text": " serve the Lord. Rejoice for the ability to serve the Lord. You know it's God who has gifted each"
    },
    {
      "id": 9,
      "start": 645.8800086975098,
      "end": 651.8800086975098,
      "text": " of his children and given us the ability to serve him. And as I begin to think about that truth"
    },
    {
      "id": 10,
      "start": 651.8800086975098,
      "end": 657.4000091552734,
      "text": " and we understand this morning that we are his workmanship created in Christ Jesus notice unto"
    },
    {
      "id": 11,
      "start": 657.4000091552734,
      "end": 662.6800079345703,
      "text": " good works. And then at the end of verse number 10 of Ephesians 2 it says, which God hath before"
    },
    {
      "id": 12,
      "start": 662.6800079345703,
      "end": 671.8000106811523,
      "text": " ordained that we should walk in them. And this is great for us to rejoice in having the ability"
    },
    {
      "id": 13,
      "start": 671.8000106811523,
      "end": 679.4800109863281,
      "text": " to serve the Lord. So I can't do what I used to do. God knows that. There's a great Bible"
    },
    {
      "id": 14,
      "start": 679.4800109863281,
      "end": 683.3200073242188,
      "text": " character that we're familiar with. We won't take the time to go to the book of Joshua,"
    },
    {
      "id": 15,
      "start": 683.3200073242188,
      "end": 687.2400131225586,
      "text": " but you understand in the life of Joshua that there comes a time in Joshua's life,"
    },
    {
      "id": 16,
      "start": 687.2400131225586,
      "end": 691.880012512207,
      "text": " he was the human leader for the nation of Israel. He's the one that leads the children of Israel"
    },
    {
      "id": 17,
      "start": 691.880012512207,
      "end": 697.0800094604492,
      "text": " into the land of promise. He's the one that leads the children of Israel into all the battles that"
    },
    {
      "id": 18,
      "start": 697.0800094604492,
      "end": 701.5600128173828,
      "text": " we read in the beginning of the book of Joshua and all of that. But there comes a time when God"
    },
    {
      "id": 19,
      "start": 701.5600128173828,
      "end": 710.1200103759766,
      "text": " says to Joshua, you're old. You're old. He no longer was going to go out and lead in battles,"
    },
    {
      "id": 20,
      "start": 710.1200103759766,
      "end": 713.9600067138672,
      "text": " but what was he going to do? He's going to divide the land. That was his duty. That was"
    },
    {
      "id": 21,
      "start": 713.9600067138672,
      "end": 719.1600112915039,
      "text": " his responsibility. And guess what we find about Joshua? He was faithful to lead the children of"
    },
    {
      "id": 22,
      "start": 719.1600112915039,
      "end": 728.5200119018555,
      "text": " Israel into battle, but as his life stages changed, he was faithful to serve God in dividing the land."
    },
    {
      "id": 23,
      "start": 728.5200119018555,
      "end": 731.9600067138672,
      "text": " If you're to study the book of Joshua, the latter part of the book, you'll find that there's some"
    },
    {
      "id": 24,
      "start": 731.9600067138672,
      "end": 735.0800170898438,
      "text": " children, some tribes of the nation of Israel that kind of just sat around and they didn't do"
    },
    {
      "id": 25,
      "start": 735.0800170898438,
      "end": 740.760009765625,
      "text": " anything. And Joshua said, hey, what's going on? Aren't you going to go and claim your land,"
    },
    {
      "id": 26,
      "start": 740.760009765625,
      "end": 746.760009765625,
      "text": " claim your inheritance? And he was used of God. And then he challenges the people before his death"
    },
    {
      "id": 27,
      "start": 746.760009765625,
      "end": 752.0400085449219,
      "text": " on serving the Lord. There are different stages that you see in the life of Joshua"
    },
    {
      "id": 28,
      "start": 752.0400085449219,
      "end": 758.6800079345703,
      "text": " through that book of Joshua. And you find that all along the way, he's serving the Lord. Is it"
    },
    {
      "id": 29,
      "start": 758.760009765625,
      "end": 765.2400054931641,
      "text": " in different ways? Absolutely. But he's still serving God. And he had the ability to do what"
    },
    {
      "id": 30,
      "start": 765.2400054931641,
      "end": 771.8800048828125,
      "text": " God called him to do at that time. Why? Because God equipped him and God enabled him for the task"
    },
    {
      "id": 31,
      "start": 771.8800048828125,
      "end": 778.3600158691406,
      "text": " that was at hand. God equipped him and God enabled him for the battles that took place in the"
    },
    {
      "id": 32,
      "start": 778.3600158691406,
      "end": 783.3200073242188,
      "text": " beginning of the book of Joshua. But then God enabled and equipped him for the division of the"
    },
    {
      "id": 33,
      "start": 783.3200073242188,
      "end": 788.1200103759766,
      "text": " land that you read of in the midst of the book of Joshua. And then God equipped and enabled him to"
    },
    {
      "id": 34,
      "start": 788.1200103759766,
      "end": 793.4000091552734,
      "text": " deliver those challenging messages to the two and a half tribes and to the leaders and the people"
    },
    {
      "id": 35,
      "start": 793.4000091552734,
      "end": 800.2000122070312,
      "text": " of Israel before he would die. God enabled him. God equipped him. And God equips and enables each"
    },
    {
      "id": 36,
      "start": 800.2000122070312,
      "end": 804.0400085449219,
      "text": " of us. Turn to the book of 1 Corinthians, if you will. And I want to go through a few verses here"
    },
    {
      "id": 37,
      "start": 804.0400085449219,
      "end": 809.4800109863281,
      "text": " in the book of 1 Corinthians. And it's interesting as we look at this particular book, the church in"
    },
    {
      "id": 38,
      "start": 809.4800109863281,
      "end": 814.2000122070312,
      "text": " Corinth, as we understand, turn to chapter number one to begin. But the church of Corinth is not a"
    },
    {
      "id": 39,
      "start": 814.2000122070312,
      "end": 820.1200103759766,
      "text": " model church. The church in Corinth has lots of problems. The church in Corinth is being corrected"
    },
    {
      "id": 40,
      "start": 820.1200103759766,
      "end": 826.3600158691406,
      "text": " for a lot of things that they're doing wrong. And the Lord would use the apostle Paul to pen"
    },
    {
      "id": 41,
      "start": 826.3600158691406,
      "end": 832.2800140380859,
      "text": " this book in order to give them instruction with regard to how they were to serve the Lord and what"
    },
    {
      "id": 42,
      "start": 832.2800140380859,
      "end": 837.7200164794922,
      "text": " was to take place. But when we understand and we're rejoicing for the ability to serve the Lord,"
    },
    {
      "id": 43,
      "start": 837.7200164794922,
      "end": 843.4000091552734,
      "text": " I want you to see what God says to the people at Corinth with regard to their service. In verse"
    },
    {
      "id": 44,
      "start": 843.4800109863281,
      "end": 848.6800079345703,
      "text": " number four of 1 Corinthians 1, notice what Paul says to these believers under the inspiration of"
    },
    {
      "id": 45,
      "start": 848.6800079345703,
      "end": 854.760009765625,
      "text": " the Holy Spirit of God. He says, I thank my God always on your behalf. Notice this, for the grace"
    },
    {
      "id": 46,
      "start": 854.760009765625,
      "end": 862.6800231933594,
      "text": " of God which is given you by Jesus Christ. I would submit to you this morning that that grace of God"
    },
    {
      "id": 47,
      "start": 862.6800231933594,
      "end": 867.9600219726562,
      "text": " which is given you by Jesus Christ is not only saving grace, though it encompasses that, but it's"
    },
    {
      "id": 48,
      "start": 867.9600219726562,
      "end": 873.8000183105469,
      "text": " also serving grace and the ability to serve the Lord. Paul talks about the grace that was bestowed"
    },
    {
      "id": 49,
      "start": 873.8000183105469,
      "end": 880.1199951171875,
      "text": " upon him. At the end of this book, we find that Peter mentions about being a"
    },
    {
      "id": 50,
      "start": 880.1199951171875,
      "end": 885.7200012207031,
      "text": " good steward of the manifold grace of God. And we find here that he's speaking about, notice, the"
    },
    {
      "id": 51,
      "start": 885.7200012207031,
      "end": 892.4400024414062,
      "text": " grace of God which is given you by Jesus Christ. That in everything, verse number five, ye are"
    },
    {
      "id": 52,
      "start": 892.4400024414062,
      "end": 898.4400024414062,
      "text": " enriched by him in all utterance and in all knowledge, even as the testimony of Christ was"
    },
    {
      "id": 53,
      "start": 898.4400024414062,
      "end": 905.7200012207031,
      "text": " confirmed in you. Notice verse seven, so that you come behind in no gift, waiting for the coming of"
    },
    {
      "id": 54,
      "start": 905.7200012207031,
      "end": 911.0,
      "text": " our Lord Jesus Christ. Now, as you study the book of 1 Corinthians, you find that one of the reasons"
    },
    {
      "id": 55,
      "start": 911.0,
      "end": 918.0400085449219,
      "text": " that there's some division and some jealousy and envy within the members of the church at Corinth"
    },
    {
      "id": 56,
      "start": 918.0400085449219,
      "end": 923.8000183105469,
      "text": " is because of the subject of spiritual gifts. Some were saying, well, I have this gift and you"
    },
    {
      "id": 57,
      "start": 923.8000183105469,
      "end": 927.5599975585938,
      "text": " have that gift and my gift is better than your gift and so on and so forth. And we'll look at a"
    },
    {
      "id": 58,
      "start": 927.5599975585938,
      "end": 932.2000122070312,
      "text": " few verses because the apostle Paul is going to deal with that and try to help them. But I want"
    },
    {
      "id": 59,
      "start": 932.2000122070312,
      "end": 937.2400207519531,
      "text": " you to notice as we speak about the ability to serve God and how we ought to rejoice that he's"
    },
    {
      "id": 60,
      "start": 937.2400207519531,
      "end": 943.1600036621094,
      "text": " given us the ability to serve the Lord, that it is God who has given us the grace. It is God who has"
    },
    {
      "id": 61,
      "start": 943.1600036621094,
      "end": 948.6000061035156,
      "text": " given us the ability. He has equipped us. And it says here of the church in Corinth that they come"
    },
    {
      "id": 62,
      "start": 948.6000061035156,
      "end": 955.7200012207031,
      "text": " behind in no gift. This church that was full of division and envy was a church that was gifted"
    },
    {
      "id": 63,
      "start": 955.7200012207031,
      "end": 961.7200012207031,
      "text": " spiritually. But they allowed those spiritual gifts to cause them to look at each other and say,"
    },
    {
      "id": 64,
      "start": 961.7200012207031,
      "end": 967.0,
      "text": " I'm better than you because of the gift that I have. And they totally missed the purpose for which"
    },
    {
      "id": 65,
      "start": 967.0,
      "end": 973.7200012207031,
      "text": " God gave them the spiritual gifts in the first place. Notice in chapter number 4 of 1 Corinthians"
    },
    {
      "id": 66,
      "start": 973.7200012207031,
      "end": 981.0800170898438,
      "text": " verses 6 and 7, notice what the Bible says here. In chapter 4, 1 Corinthians 4 verse 6 and 7,"
    },
    {
      "id": 67,
      "start": 981.0800170898438,
      "end": 986.4400024414062,
      "text": " the Bible says this, and these things brethren I have in a figure transferred to myself and to"
    },
    {
      "id": 68,
      "start": 986.4400024414062,
      "end": 991.4800109863281,
      "text": " Apollos for your sakes that you might learn in us not to think of men above that which is written,"
    },
    {
      "id": 69,
      "start": 991.4800109863281,
      "end": 996.0400085449219,
      "text": " that no one of you be puffed up for one against another. He's dealing with the importance of"
    },
    {
      "id": 70,
      "start": 996.0400085449219,
      "end": 1001.1600036621094,
      "text": " humility. And notice in verse 7 he says, for who maketh thee to differ from another? By the way,"
    },
    {
      "id": 71,
      "start": 1001.1600036621094,
      "end": 1008.1199951171875,
      "text": " aren't you happy everyone's not like you? Amen. I'm happy everyone's not like me. I'm happy"
    },
    {
      "id": 72,
      "start": 1008.1199951171875,
      "end": 1014.0400085449219,
      "text": " everyone's not like you. I'm happy I'm not like you. Amen. But the reality is God's made us"
    },
    {
      "id": 73,
      "start": 1014.0400085449219,
      "end": 1017.6400146484375,
      "text": " different. But then notice when we think about the spiritual gifts, notice in verse number 7,"
    },
    {
      "id": 74,
      "start": 1017.6400146484375,
      "end": 1023.8000183105469,
      "text": " and what hast thou that thou didst not receive? He's going to build upon this as we go through"
    },
    {
      "id": 75,
      "start": 1023.8000183105469,
      "end": 1028.2799987792969,
      "text": " the book of 1 Corinthians, and we'll look at a few more verses. He says, now if thou didst receive"
    },
    {
      "id": 76,
      "start": 1028.2799987792969,
      "end": 1034.2799987792969,
      "text": " it, why dost thou glory as if thou hadst not received it? And we find that he's speaking,"
    },
    {
      "id": 77,
      "start": 1034.2799987792969,
      "end": 1038.3600158691406,
      "text": " we look at this idea of the ability to serve the Lord, and we rejoice that God's given us"
    },
    {
      "id": 78,
      "start": 1038.3600158691406,
      "end": 1045.0,
      "text": " the ability. Why? Because it's God who has equipped us. It is God who has enabled us."
    },
    {
      "id": 79,
      "start": 1045.0,
      "end": 1050.6000061035156,
      "text": " Think about this, the God of the universe, the one who spoke it all into existence,"
    },
    {
      "id": 80,
      "start": 1050.6000061035156,
      "end": 1056.52001953125,
      "text": " the one who formed man from the dust of the ground and then breathed the life into them"
    },
    {
      "id": 81,
      "start": 1056.52001953125,
      "end": 1065.0800170898438,
      "text": " through the breath of God, that he would allow us, he would allow you to serve him. It's amazing"
    },
    {
      "id": 82,
      "start": 1066.4400024414062,
      "end": 1072.3600158691406,
      "text": " that he would allow us to serve him in any capacity. It's amazing the ability that he's"
    },
    {
      "id": 83,
      "start": 1072.3600158691406,
      "end": 1079.1600036621094,
      "text": " given us to serve him. In 1 Corinthians chapter 12, notice as he continues to help this group"
    },
    {
      "id": 84,
      "start": 1079.1600036621094,
      "end": 1085.4000244140625,
      "text": " of believers in Corinth to understand the subject matter of spiritual gifts and to understand"
    },
    {
      "id": 85,
      "start": 1085.4000244140625,
      "end": 1091.5599975585938,
      "text": " the ability that God had given them to be able to serve the Lord. Remember, we don't serve God,"
    },
    {
      "id": 86,
      "start": 1091.5599975585938,
      "end": 1096.6000061035156,
      "text": " we don't do good works to be saved, we don't serve the Lord or do good works to stay saved,"
    },
    {
      "id": 87,
      "start": 1096.6000061035156,
      "end": 1104.0400085449219,
      "text": " but because we are saved, we are to serve Christ. We are to do good works. Notice in 1 Corinthians 12,"
    },
    {
      "id": 88,
      "start": 1104.0400085449219,
      "end": 1110.52001953125,
      "text": " now, verse number one, concerning spiritual gifts, brethren, I would not have you ignorant."
    },
    {
      "id": 89,
      "start": 1111.6400146484375,
      "end": 1117.0,
      "text": " Ye know that ye were Gentiles, carried away unto these dumb idols, even as ye were led."
    },
    {
      "id": 90,
      "start": 1117.0,
      "end": 1122.6799926757812,
      "text": " Wherefore, I give you to understand that no man speaking by the Spirit of God calleth Jesus a"
    },
    {
      "id": 91,
      "start": 1122.6799926757812,
      "end": 1128.760009765625,
      "text": " curse, and that no man can say that Jesus is the Lord, but by the Holy Ghost. Now there are"
    },
    {
      "id": 92,
      "start": 1128.760009765625,
      "end": 1135.0,
      "text": " diversities of gifts, but notice this, the same Spirit. Verse number five, and there are differences"
    },
    {
      "id": 93,
      "start": 1135.0,
      "end": 1142.2000122070312,
      "text": " of administrations, but the same Lord. And there are diversities of operations, but it is the same"
    },
    {
      "id": 94,
      "start": 1142.2000122070312,
      "end": 1150.1199951171875,
      "text": " God which worketh all in all. But the manifestation of the Spirit is given to every man to profit"
    },
    {
      "id": 95,
      "start": 1150.6799926757812,
      "end": 1157.5599975585938,
      "text": " with all. Every man has been equipped and enabled to be able to serve Christ. Every child of God."
    },
    {
      "id": 96,
      "start": 1157.5599975585938,
      "end": 1162.4400024414062,
      "text": " Remember the book of 1 Corinthians has been written to save people, to people that have been"
    },
    {
      "id": 97,
      "start": 1162.4400024414062,
      "end": 1168.1199951171875,
      "text": " born again, saved by the grace of God. And he says that the manifestation of the Spirit is given to"
    },
    {
      "id": 98,
      "start": 1168.1199951171875,
      "end": 1175.5599975585938,
      "text": " every man to profit with all. For to one, notice verse eight, is given by the Spirit the word of wisdom."
    },
    {
      "id": 99,
      "start": 1176.6000366210938,
      "end": 1180.8400268554688,
      "text": " To another, the word of knowledge by the same Spirit. To another, faith by the same Spirit. To"
    },
    {
      "id": 100,
      "start": 1180.8400268554688,
      "end": 1185.5599975585938,
      "text": " another, the gifts of healing by the same Spirit. To another, the working of miracles. To another, prophecy."
    },
    {
      "id": 101,
      "start": 1185.5599975585938,
      "end": 1189.3200073242188,
      "text": " To another, discerning of spirits. To another, diverse kinds of tongues. To another, the"
    },
    {
      "id": 102,
      "start": 1189.3200073242188,
      "end": 1193.4000244140625,
      "text": " interpretation of tongues. Now I'm not going to get into all the spiritual gifts this morning,"
    },
    {
      "id": 103,
      "start": 1193.4000244140625,
      "end": 1199.3200073242188,
      "text": " but understand that some of those were temporary sign gifts. The gift of healing, the gift of"
    },
    {
      "id": 104,
      "start": 1199.3200073242188,
      "end": 1200.6799926757812,
      "text": " tongues, those are temporary."
    },
    {
      "id": 0,
      "start": 1200.6799926757812,
      "end": 1205.9199924468994,
      "text": " sign gifts. We think about even the gift of prophecy with regard to"
    },
    {
      "id": 1,
      "start": 1205.9199924468994,
      "end": 1210.39999294281,
      "text": " foretelling versus what we would look at it today as being"
    },
    {
      "id": 2,
      "start": 1210.39999294281,
      "end": 1214.479992866516,
      "text": " foretelling. We see that those things have ceased. In fact, as you read through"
    },
    {
      "id": 3,
      "start": 1214.479992866516,
      "end": 1219.8799934387207,
      "text": " chapter 13 and 14, you see it very plainly that they would cease, that they"
    },
    {
      "id": 4,
      "start": 1219.8799934387207,
      "end": 1226.0799922943115,
      "text": " would be done away with those temporary sign gifts. But notice in verse number 11"
    },
    {
      "id": 5,
      "start": 1226.0799922943115,
      "end": 1230.3199920654297,
      "text": " he says, but all these, and so everything that he references beginning in verse"
    },
    {
      "id": 6,
      "start": 1230.3199920654297,
      "end": 1235.9599914550781,
      "text": " number 8 and following, he says, but all these worketh that one in the self same"
    },
    {
      "id": 7,
      "start": 1235.9599914550781,
      "end": 1244.9599914550781,
      "text": " spirit dividing to every man severally, notice these words, as he will. God has"
    },
    {
      "id": 8,
      "start": 1244.9599914550781,
      "end": 1251.919994354248,
      "text": " equipped you. God has enabled you. And we think about this subject matter of our"
    },
    {
      "id": 9,
      "start": 1251.919994354248,
      "end": 1256.0399932861328,
      "text": " service to God, we think about how great God is, and we've examined it throughout"
    },
    {
      "id": 10,
      "start": 1256.0399932861328,
      "end": 1261.5599937438965,
      "text": " this year, to think this morning, to comprehend this morning that the God of"
    },
    {
      "id": 11,
      "start": 1261.5599937438965,
      "end": 1266.3999938964844,
      "text": " the universe would equip us as individuals and enable us to be able to"
    },
    {
      "id": 12,
      "start": 1266.3999938964844,
      "end": 1272.7999954223633,
      "text": " serve him. He's given us the ability. It ought to cause us to rejoice greatly. By"
    },
    {
      "id": 13,
      "start": 1272.7999954223633,
      "end": 1279.2799911499023,
      "text": " the way, it ought to motivate us to serve him. Amen? We're not to sit on the"
    },
    {
      "id": 14,
      "start": 1279.2799911499023,
      "end": 1283.9599914550781,
      "text": " premises, we're to stand on the promises. We're not to be on the sidelines, we're"
    },
    {
      "id": 15,
      "start": 1283.9599914550781,
      "end": 1288.359992980957,
      "text": " to get in the game. Listen, I like playing sports. I'm getting older now, but I enjoy"
    },
    {
      "id": 16,
      "start": 1288.359992980957,
      "end": 1293.759994506836,
      "text": " playing sports. I enjoy playing them a whole lot more than I enjoy watching them. We had"
    },
    {
      "id": 17,
      "start": 1293.759994506836,
      "end": 1297.9199905395508,
      "text": " our Labor Day picnic. I haven't played soccer in years. But I got sick and tired of watching"
    },
    {
      "id": 18,
      "start": 1297.9199905395508,
      "end": 1302.1199951171875,
      "text": " them play soccer. Guess what? I went and played soccer. Right, Fernando? You and I, we're"
    },
    {
      "id": 19,
      "start": 1302.1199951171875,
      "end": 1308.5199890136719,
      "text": " out there playing soccer. I think I scored four goals. Amen? Amen. Praise the Lord. I'm"
    },
    {
      "id": 20,
      "start": 1308.5199890136719,
      "end": 1314.639991760254,
      "text": " getting older. But I had a good time. I wanted to get in the game. I don't want to just watch."
    },
    {
      "id": 21,
      "start": 1314.639991760254,
      "end": 1324.2799911499023,
      "text": " We're talking about serving the Lord. It's a participation thing. It's not just an observation"
    },
    {
      "id": 22,
      "start": 1324.2799911499023,
      "end": 1331.3199920654297,
      "text": " thing. It's not just being a spectator, but being a participator. And he's equipped"
    },
    {
      "id": 23,
      "start": 1331.3199920654297,
      "end": 1336.1199951171875,
      "text": " us to be able to serve the Lord. And we ought to rejoice for the ability that God has given"
    },
    {
      "id": 24,
      "start": 1336.1199951171875,
      "end": 1340.3999938964844,
      "text": " us. Notice in the book of Ephesians, in chapter number four, notice with me, in the book"
    },
    {
      "id": 25,
      "start": 1340.3999938964844,
      "end": 1346.1599884033203,
      "text": " of Ephesians, in chapter number four, and I'm going to read a few verses of Scripture"
    },
    {
      "id": 26,
      "start": 1346.1599884033203,
      "end": 1351.0399932861328,
      "text": " and I hope as we look at this portion that we find here that as Paul is writing to the"
    },
    {
      "id": 27,
      "start": 1351.0399932861328,
      "end": 1356.5599975585938,
      "text": " church at Ephesus again, how God had equipped them and how God had enabled them, that we"
    },
    {
      "id": 28,
      "start": 1356.5599975585938,
      "end": 1361.0999908447266,
      "text": " would recognize that it's God who has given us the ability to serve him and we would rejoice"
    },
    {
      "id": 29,
      "start": 1361.0999908447266,
      "end": 1365.8999938964844,
      "text": " greatly because of it. Notice in Ephesians four and verse number seven, but unto every"
    },
    {
      "id": 30,
      "start": 1365.8999938964844,
      "end": 1371.1399993896484,
      "text": " one of us, it's kind of all inclusive, isn't it? No one's left out. If you're saved by"
    },
    {
      "id": 31,
      "start": 1371.1399993896484,
      "end": 1377.0599975585938,
      "text": " grace, you've been enabled to serve the Lord and equipped, is given grace according to"
    },
    {
      "id": 32,
      "start": 1377.0599975585938,
      "end": 1381.9399871826172,
      "text": " the measure of the gift of Christ. Wherefore he saith, when he ascended up on high, he"
    },
    {
      "id": 33,
      "start": 1381.9399871826172,
      "end": 1388.5,
      "text": " led captivity captive and gave gifts unto men. Verses nine and 10 is a parenthetical"
    },
    {
      "id": 34,
      "start": 1388.5,
      "end": 1393.5799865722656,
      "text": " and it's, I'm not skipping it for the purpose of just avoiding it, but going into the thought"
    },
    {
      "id": 35,
      "start": 1393.5799865722656,
      "end": 1397.9399871826172,
      "text": " of spiritual gifts that God is dealing with in this text of Scripture and you find that"
    },
    {
      "id": 36,
      "start": 1397.9399871826172,
      "end": 1401.5,
      "text": " he says and gave gifts unto men at the end of verse number eight. He talks about the"
    },
    {
      "id": 37,
      "start": 1401.5,
      "end": 1405.8999938964844,
      "text": " measure of the gift of Christ in verse number seven and then notice in verse number 11,"
    },
    {
      "id": 38,
      "start": 1405.8999938964844,
      "end": 1412.6199951171875,
      "text": " and he gave some apostles and some prophets and some evangelists and some pastors and"
    },
    {
      "id": 39,
      "start": 1412.6199951171875,
      "end": 1416.6199951171875,
      "text": " teachers for what purpose? For the perfecting of the saints, for the work of the ministry,"
    },
    {
      "id": 40,
      "start": 1416.6199951171875,
      "end": 1421.7799987792969,
      "text": " for the edifying of the body of Christ. And we find that it's God who gave, it's God who"
    },
    {
      "id": 41,
      "start": 1421.7799987792969,
      "end": 1427.0599975585938,
      "text": " equipped, it's God who has enabled and when we understand that, we ought to rejoice that"
    },
    {
      "id": 42,
      "start": 1427.0599975585938,
      "end": 1434.8199920654297,
      "text": " he's given us the ability to serve him. Listen, I did not just sign up to be a pastor. I wasn't"
    },
    {
      "id": 43,
      "start": 1434.8199920654297,
      "end": 1438.8599853515625,
      "text": " at a job fair somewhere and looking at the benefits of what they might be and say, you"
    },
    {
      "id": 44,
      "start": 1438.8599853515625,
      "end": 1445.4199981689453,
      "text": " know, I think that's a really good career path for me. No, God called me. God equipped"
    },
    {
      "id": 45,
      "start": 1445.4199981689453,
      "end": 1451.979995727539,
      "text": " me. God has enabled me. And by the way, I rejoice for the opportunity. Let me say this,"
    },
    {
      "id": 46,
      "start": 1451.979995727539,
      "end": 1457.6199951171875,
      "text": " when he was first calling me, I resisted the call. I was scared to death. No, that's not,"
    },
    {
      "id": 47,
      "start": 1457.6199951171875,
      "end": 1462.1000061035156,
      "text": " it's not for me. It's not something, but it was God. I had to realize that as God calls,"
    },
    {
      "id": 48,
      "start": 1462.1000061035156,
      "end": 1468.0199890136719,
      "text": " God enables and there might be a place of service that God has called you to, that God"
    },
    {
      "id": 49,
      "start": 1468.0199890136719,
      "end": 1473.6999816894531,
      "text": " has gifted you in a particular area and God will equip you. God will enable you to do"
    },
    {
      "id": 50,
      "start": 1473.6999816894531,
      "end": 1476.8999938964844,
      "text": " that work. Brother Somerdorst was with us this morning. He didn't just sign up again"
    },
    {
      "id": 51,
      "start": 1476.8999938964844,
      "end": 1480.97998046875,
      "text": " at the same job fair and I go to the pastor line and he goes to the evangelist line. It's"
    },
    {
      "id": 52,
      "start": 1480.97998046875,
      "end": 1487.3800048828125,
      "text": " not how it works. God calls and God equips. And what a joy and what a blessing. And you"
    },
    {
      "id": 53,
      "start": 1487.3800048828125,
      "end": 1490.9400024414062,
      "text": " don't need to turn there, but in 1 Peter chapter 4 and verse number 10, the Bible says, as"
    },
    {
      "id": 54,
      "start": 1490.9400024414062,
      "end": 1496.5399780273438,
      "text": " every man hath received the gift, even so minister the same one to another as good stewards"
    },
    {
      "id": 55,
      "start": 1496.5399780273438,
      "end": 1502.2599792480469,
      "text": " of the manifold grace of God. We're to be good stewards. It's required in stewards,"
    },
    {
      "id": 56,
      "start": 1502.2599792480469,
      "end": 1507.6600036621094,
      "text": " the Bible tells us in 1 Corinthians, that a man be found faithful. And Peter says in"
    },
    {
      "id": 57,
      "start": 1507.6600036621094,
      "end": 1512.1399841308594,
      "text": " 1 Peter 4 and verse number 10, that we're to be good stewards of the manifold grace"
    },
    {
      "id": 58,
      "start": 1512.1399841308594,
      "end": 1519.2200012207031,
      "text": " of God. That as God has enabled and equipped us, that we're good stewards, that we're faithful"
    },
    {
      "id": 59,
      "start": 1519.2200012207031,
      "end": 1524.6999816894531,
      "text": " with that which he has entrusted us with. That we recognize that God has given us the"
    },
    {
      "id": 60,
      "start": 1524.6999816894531,
      "end": 1530.6199951171875,
      "text": " ability to serve him. Paul says it this way. I think about the testimony of Paul when I"
    },
    {
      "id": 61,
      "start": 1530.6199951171875,
      "end": 1535.3800048828125,
      "text": " rejoice for this ability to serve the Lord, but I see Paul rejoicing as well to the same"
    },
    {
      "id": 62,
      "start": 1535.3800048828125,
      "end": 1539.8599853515625,
      "text": " group of people. Notice in 1 Corinthians 15, we were there in chapter 12 just a moment"
    },
    {
      "id": 63,
      "start": 1539.8599853515625,
      "end": 1545.8999938964844,
      "text": " ago, just a few chapters over. Notice what Paul says in 1 Corinthians 15 and verse number"
    },
    {
      "id": 64,
      "start": 1545.8999938964844,
      "end": 1551.2200012207031,
      "text": " 10. As the apostle Paul would understand that it was the Lord that equipped him, that gave"
    },
    {
      "id": 65,
      "start": 1551.2200012207031,
      "end": 1556.8999938964844,
      "text": " him the ability and that Paul had the privilege of serving the Lord and the various ways in"
    },
    {
      "id": 66,
      "start": 1556.8999938964844,
      "end": 1561.4599914550781,
      "text": " which he had the privilege of serving the Lord. He says this in verse 10 of 1 Corinthians"
    },
    {
      "id": 67,
      "start": 1561.4599914550781,
      "end": 1570.0599975585938,
      "text": " 15, but by the grace of God, I am what I am. He says in his grace, which was bestowed upon"
    },
    {
      "id": 68,
      "start": 1570.0599975585938,
      "end": 1577.0199890136719,
      "text": " me was not in vain, but I labored more abundantly than they all, yet not I, but the grace of"
    },
    {
      "id": 69,
      "start": 1577.0199890136719,
      "end": 1584.0199890136719,
      "text": " God which was with me. Therefore, whether it were I or they, so we preach and so ye"
    },
    {
      "id": 70,
      "start": 1584.0199890136719,
      "end": 1589.6199951171875,
      "text": " believed. Remember there's division in Corinth. I'm of Paul, I'm of Apollos and Cephas and"
    },
    {
      "id": 71,
      "start": 1589.6199951171875,
      "end": 1593.6600036621094,
      "text": " so on and so forth and we find that Paul is saying, listen God, I am what I am by the"
    },
    {
      "id": 72,
      "start": 1593.6600036621094,
      "end": 1600.239990234375,
      "text": " grace of God. God has enabled me and God has equipped me and Paul is rejoicing for the"
    },
    {
      "id": 73,
      "start": 1600.239990234375,
      "end": 1605.2999877929688,
      "text": " opportunity that he had. He says that I'm laboring, I'm labored more abundantly than"
    },
    {
      "id": 74,
      "start": 1605.2999877929688,
      "end": 1609.97998046875,
      "text": " they all. Why? Not because he wanted to be a good steward of the manifold grace of God."
    },
    {
      "id": 75,
      "start": 1609.97998046875,
      "end": 1614.6600036621094,
      "text": " God used Peter to pen those words in 1 Peter 4 and verse number 10, but no doubt Paul is"
    },
    {
      "id": 76,
      "start": 1614.6600036621094,
      "end": 1620.4599914550781,
      "text": " an example of an individual that had been equipped and enabled by God who was a good"
    },
    {
      "id": 77,
      "start": 1620.4599914550781,
      "end": 1626.6600036621094,
      "text": " steward of the manifold grace of God. He says this as he's writing to the folks in Thessalonica."
    },
    {
      "id": 78,
      "start": 1626.6600036621094,
      "end": 1631.97998046875,
      "text": " Notice in 1 Thessalonians chapter number 2, in 1 Thessalonians chapter 2, notice what"
    },
    {
      "id": 79,
      "start": 1632.1399841308594,
      "end": 1638.0599975585938,
      "text": " Paul says. Again, this ability that we have in rejoicing for the ability to serve the"
    },
    {
      "id": 80,
      "start": 1638.0599975585938,
      "end": 1644.5799865722656,
      "text": " Lord. Again, my attitude as I review my attitude, it's a get to situation, not a have to situation."
    },
    {
      "id": 81,
      "start": 1644.5799865722656,
      "end": 1647.5399780273438,
      "text": " Now the bottom line is that really if you were to dig real deep, you really do have"
    },
    {
      "id": 82,
      "start": 1647.5399780273438,
      "end": 1650.6600036621094,
      "text": " to serve the Lord because you need to be a good, at least you're going to stand before"
    },
    {
      "id": 83,
      "start": 1650.6600036621094,
      "end": 1655.8999938964844,
      "text": " Christ. You're going to give an account. You're going to give an account. But man, I get to."
    },
    {
      "id": 84,
      "start": 1655.8999938964844,
      "end": 1661.5799865722656,
      "text": " I get to serve him. I get to serve him. In 1 Thessalonians chapter 2, notice what Paul"
    },
    {
      "id": 85,
      "start": 1661.5799865722656,
      "end": 1670.1399841308594,
      "text": " says in chapter 2 and verse number 4. He says, but as we were allowed of God to be"
    },
    {
      "id": 86,
      "start": 1670.1399841308594,
      "end": 1677.4599914550781,
      "text": " put in trust with the gospel, even so we speak, not as pleasing men, but who? But God, which"
    },
    {
      "id": 87,
      "start": 1677.4599914550781,
      "end": 1684.0,
      "text": " trieth our hearts. Why? For the audience of one. For the audience of one. Paul says as"
    },
    {
      "id": 88,
      "start": 1684.0,
      "end": 1687.8200073242188,
      "text": " he went into Thessalonica and he's preaching the gospel and of course all that was taking"
    },
    {
      "id": 89,
      "start": 1687.8200073242188,
      "end": 1694.2999877929688,
      "text": " place with regard to the persecution during that particular era of his missionary journey"
    },
    {
      "id": 90,
      "start": 1694.2999877929688,
      "end": 1700.1000061035156,
      "text": " and we see that his attitude is this. We were allowed of God. I had the privilege. I had"
    },
    {
      "id": 91,
      "start": 1700.1000061035156,
      "end": 1704.5799865722656,
      "text": " the opportunity. It was a delight. But Paul, you suffered. But Paul, you were persecuted."
    },
    {
      "id": 92,
      "start": 1704.5799865722656,
      "end": 1713.739990234375,
      "text": " But I was allowed of God. God entrusted me. God allowed me to do this. But Paul, you suffered."
    },
    {
      "id": 93,
      "start": 1713.739990234375,
      "end": 1719.6199951171875,
      "text": " But it was worth it. You read 2 Corinthians chapter number 4. He says it's worth it. It's"
    },
    {
      "id": 94,
      "start": 1719.6199951171875,
      "end": 1725.3800048828125,
      "text": " worth it. And he says here that we were put in trust with the gospel even so we speak"
    },
    {
      "id": 95,
      "start": 1725.3800048828125,
      "end": 1732.5800170898438,
      "text": " not as pleasing men, but God, which trieth our hearts. You know what happens when you"
    },
    {
      "id": 96,
      "start": 1732.5800170898438,
      "end": 1740.02001953125,
      "text": " try to please men? You fail. You know why you fail? Because it's impossible to please"
    },
    {
      "id": 97,
      "start": 1740.02001953125,
      "end": 1746.2999877929688,
      "text": " everyone. It is absolutely impossible to please everyone. And if you want a case study"
    },
    {
      "id": 98,
      "start": 1746.2999877929688,
      "end": 1752.6199951171875,
      "text": " on it, you can control the thermostat next week. You say, well that's such a simple thing."
    },
    {
      "id": 99,
      "start": 1752.6199951171875,
      "end": 1760.4199829101562,
      "text": " You can't please everyone. Promise you. Promise you. But you know, it's for the audience of"
    },
    {
      "id": 100,
      "start": 1760.4199829101562,
      "end": 1768.0599975585938,
      "text": " one when we serve the Lord. For the audience of one. We're serving God and He's the one"
    },
    {
      "id": 101,
      "start": 1768.0599975585938,
      "end": 1775.02001953125,
      "text": " that tries the heart. By the way, I'm thankful. My heart's deceitful and so is yours. But"
    },
    {
      "id": 102,
      "start": 1775.02001953125,
      "end": 1782.1799926757812,
      "text": " God, He trieth the heart. He knows. He knows your motive. He knows why you're serving Him."
    },
    {
      "id": 103,
      "start": 1782.1799926757812,
      "end": 1787.8599853515625,
      "text": " He knows. He knows what your motive is. By the way, if your motive is to be recognized"
    },
    {
      "id": 104,
      "start": 1787.8599853515625,
      "end": 1792.7000122070312,
      "text": " by man, you have your reward. Just go back to Matthew and read what he says about those"
    },
    {
      "id": 105,
      "start": 1792.7000122070312,
      "end": 1798.0399780273438,
      "text": " Pharisees and those Sadducees. When they prayed those big high prayers and they wanted to"
    },
    {
      "id": 106,
      "start": 1798.0399780273438,
      "end": 1800.719970703125,
      "text": " be noticed of men, they have their reward."
    },
    {
      "id": 0,
      "start": 1800.719970703125,
      "end": 1806.3999705314636,
      "text": " reward. That's what Jesus says. What's the reward? The applause of man. Did you hear"
    },
    {
      "id": 1,
      "start": 1806.3999705314636,
      "end": 1814.0799703598022,
      "text": " him? No, no, no. It's for the audience of one. And when our motive is to please Christ,"
    },
    {
      "id": 2,
      "start": 1814.0799703598022,
      "end": 1818.559970855713,
      "text": " when our motive is to please Christ and to serve Christ and to do it with a pure heart"
    },
    {
      "id": 3,
      "start": 1818.559970855713,
      "end": 1824.3199710845947,
      "text": " then he is the one that's exalted and magnified and it's all about him. Will you make people"
    },
    {
      "id": 4,
      "start": 1824.3199710845947,
      "end": 1830.3399715423584,
      "text": " upset? Yeah, you will. But when you keep your focus on I'm serving the Lord, I'm serving"
    },
    {
      "id": 5,
      "start": 1830.3399715423584,
      "end": 1836.5799713134766,
      "text": " the Lord. Paul says it this way in 1 Timothy chapter 1. Think about what Paul says here."
    },
    {
      "id": 6,
      "start": 1836.5799713134766,
      "end": 1842.1799697875977,
      "text": " It's a verse of scripture that Holly has on her signature of her email and I appreciate"
    },
    {
      "id": 7,
      "start": 1842.1799697875977,
      "end": 1848.9399719238281,
      "text": " this verse of scripture. Many of us have what we might refer to as a life verse. Maybe we"
    },
    {
      "id": 8,
      "start": 1848.9399719238281,
      "end": 1854.4199714660645,
      "text": " sign a card or an email with a particular verse and again Holly has verse 12 of 1 Timothy"
    },
    {
      "id": 9,
      "start": 1854.4199714660645,
      "end": 1860.1399688720703,
      "text": " 1. I want you to notice what Paul says in this verse of scripture. And I thank Christ"
    },
    {
      "id": 10,
      "start": 1860.1399688720703,
      "end": 1870.6999740600586,
      "text": " Jesus our Lord who hath enabled me for that he counted me faithful putting me into the"
    },
    {
      "id": 11,
      "start": 1870.6999740600586,
      "end": 1881.8599700927734,
      "text": " ministry. Notice verse 13 with it. Who was before a blasphemer and a persecutor and injurious"
    },
    {
      "id": 12,
      "start": 1881.8599700927734,
      "end": 1887.9799728393555,
      "text": " but I obtained mercy because I did it ignorantly in unbelief. Listen I'm thankful that I'm"
    },
    {
      "id": 13,
      "start": 1887.9799728393555,
      "end": 1893.6599731445312,
      "text": " not what I used to be. In fact they sang about that this morning in that song. I'm a sinner"
    },
    {
      "id": 14,
      "start": 1893.6599731445312,
      "end": 1898.0199737548828,
      "text": " saved by grace and I'm not what I used to be. Aren't you thankful? I'm no longer a servant"
    },
    {
      "id": 15,
      "start": 1898.0199737548828,
      "end": 1901.8599700927734,
      "text": " of sin, Romans 6 we mentioned that in the beginning of the message. I'm now a servant"
    },
    {
      "id": 16,
      "start": 1901.8599700927734,
      "end": 1907.6599731445312,
      "text": " of righteousness and Paul says this is what I was before but now I have the privilege"
    },
    {
      "id": 17,
      "start": 1907.6599731445312,
      "end": 1914.6999740600586,
      "text": " of serving the Lord and he says I thank Christ Jesus our Lord who hath enabled me for that"
    },
    {
      "id": 18,
      "start": 1914.6999740600586,
      "end": 1921.3799743652344,
      "text": " he counted me faithful putting me into the ministry. What a great perspective. Rejoicing"
    },
    {
      "id": 19,
      "start": 1921.3799743652344,
      "end": 1925.819969177246,
      "text": " for the ability to serve the Lord. Number three if you're taking notes we must review"
    },
    {
      "id": 20,
      "start": 1925.819969177246,
      "end": 1930.6599731445312,
      "text": " our attitude, we must rejoice for the ability but number three I want you to recognize what"
    },
    {
      "id": 21,
      "start": 1930.6599731445312,
      "end": 1937.4199676513672,
      "text": " is accomplished when we serve the Lord. Recognize what is accomplished when we serve the Lord."
    },
    {
      "id": 22,
      "start": 1937.4199676513672,
      "end": 1942.219970703125,
      "text": " Clearly our service to God is for the audience of one but I would submit to you this morning"
    },
    {
      "id": 23,
      "start": 1942.219970703125,
      "end": 1949.9399719238281,
      "text": " that it has an impact on many. Our service to God is for the audience of one, the Lord"
    },
    {
      "id": 24,
      "start": 1949.9399719238281,
      "end": 1957.1799774169922,
      "text": " Jesus Christ but it has an impact on many. We read already in 1 Corinthians chapter number"
    },
    {
      "id": 25,
      "start": 1957.1799774169922,
      "end": 1961.979965209961,
      "text": " 12 where the Bible said and we'll look at a couple of verses there in 1 Corinthians"
    },
    {
      "id": 26,
      "start": 1961.979965209961,
      "end": 1966.7799682617188,
      "text": " chapter 12 notice as we talked about the gifts of the Spirit he said I don't want you to"
    },
    {
      "id": 27,
      "start": 1966.7799682617188,
      "end": 1972.2999725341797,
      "text": " be ignorant concerning the spiritual gifts in 1 Corinthians chapter 12 he mentioned in"
    },
    {
      "id": 28,
      "start": 1972.2999725341797,
      "end": 1978.699966430664,
      "text": " verse number 7 that the manifestation of the Spirit is given to every man to profit with"
    },
    {
      "id": 29,
      "start": 1978.699966430664,
      "end": 1986.6599731445312,
      "text": " all. And so as the body of Christ is assembled and the people of God are enabled and equipped"
    },
    {
      "id": 30,
      "start": 1986.6599731445312,
      "end": 1992.1599731445312,
      "text": " and we serve the Lord it's yes for God to be glorified but we find that it will have"
    },
    {
      "id": 31,
      "start": 1992.1599731445312,
      "end": 1996.739974975586,
      "text": " a profit on all. Notice this truth see the greatest aspect we talk about recognizing"
    },
    {
      "id": 32,
      "start": 1996.739974975586,
      "end": 2002.3399658203125,
      "text": " what is accomplished when we serve the Lord is that he is glorified. He's glorified."
    },
    {
      "id": 33,
      "start": 2002.3399658203125,
      "end": 2007.6799774169922,
      "text": " If our service to God is done the way that we've spoken of thus far in the sermon this"
    },
    {
      "id": 34,
      "start": 2007.6799774169922,
      "end": 2013.0599670410156,
      "text": " morning then God is glorified. Let your light so shine before men that they may see your"
    },
    {
      "id": 35,
      "start": 2013.0599670410156,
      "end": 2017.5399780273438,
      "text": " good works and do what? Glorify your Father which is in heaven. Is that what the Bible"
    },
    {
      "id": 36,
      "start": 2017.5399780273438,
      "end": 2024.0799713134766,
      "text": " tells us? Those are the words of Jesus and we find that that's the purpose right? Notice"
    },
    {
      "id": 37,
      "start": 2024.0799713134766,
      "end": 2029.8199768066406,
      "text": " in 1 Corinthians chapter 12 we look at verse 18 it says but now hath God set the members"
    },
    {
      "id": 38,
      "start": 2029.8199768066406,
      "end": 2037.6599731445312,
      "text": " every one of them in the body notice as it hath pleased him and for the glory of God."
    },
    {
      "id": 39,
      "start": 2037.6599731445312,
      "end": 2044.2599639892578,
      "text": " See it's his church and in his church he is to receive glory and when we serve the Lord"
    },
    {
      "id": 40,
      "start": 2044.2599639892578,
      "end": 2048.0599670410156,
      "text": " every single one of us as we serve the Lord in the manner in which God has enabled us"
    },
    {
      "id": 41,
      "start": 2048.0599670410156,
      "end": 2052.7999725341797,
      "text": " to serve the Lord and we're good stewards of the manifold grace of God and we're serving"
    },
    {
      "id": 42,
      "start": 2053.019973754883,
      "end": 2059.939971923828,
      "text": " God out of that pure heart in doing what he's called us to do then God is glorified. He's"
    },
    {
      "id": 43,
      "start": 2059.939971923828,
      "end": 2065.219970703125,
      "text": " exalted and he's magnified. Look at 1 Peter chapter 4 we referenced verse number 10 earlier"
    },
    {
      "id": 44,
      "start": 2065.219970703125,
      "end": 2068.8199768066406,
      "text": " that the Bible talks about being a good steward of the manifold grace of God but I want you"
    },
    {
      "id": 45,
      "start": 2068.8199768066406,
      "end": 2075.8199768066406,
      "text": " to see what the Bible says in verse number 11. In 1 Peter chapter 4 we find that every"
    },
    {
      "id": 46,
      "start": 2076.0599670410156,
      "end": 2080.3399658203125,
      "text": " man hath received the gift and we're thankful for that and we're to be good stewards of"
    },
    {
      "id": 47,
      "start": 2080.3599853515625,
      "end": 2087.3599853515625,
      "text": " the manifold grace of God but verse number 11 of 1 Peter 4 says this if any man speak"
    },
    {
      "id": 48,
      "start": 2087.3599853515625,
      "end": 2093.5799560546875,
      "text": " let him speak as the oracles of God if any man minister let him do it as of the ability"
    },
    {
      "id": 49,
      "start": 2093.5799560546875,
      "end": 2100.1599731445312,
      "text": " which God giveth and notice this phrase that God in all things may be glorified through"
    },
    {
      "id": 50,
      "start": 2100.1599731445312,
      "end": 2107.1599731445312,
      "text": " Jesus Christ to whom be praise and dominion forever and ever amen. In Ephesians 4 we won't"
    },
    {
      "id": 51,
      "start": 2107.8399658203125,
      "end": 2114.8399658203125,
      "text": " take the time to turn there but we spoke in that portion of scripture how the Lord gave"
    },
    {
      "id": 52,
      "start": 2116.0599670410156,
      "end": 2122.219970703125,
      "text": " some to the church. He gave the evangelists, some apostles, evangelists, pastors, teachers"
    },
    {
      "id": 53,
      "start": 2122.219970703125,
      "end": 2127.699981689453,
      "text": " and he said why for the perfecting of the saints. It's that God would be glorified but"
    },
    {
      "id": 54,
      "start": 2127.699981689453,
      "end": 2134.699981689453,
      "text": " number two so that God's people would be edified. What is accomplished when we serve the Lord?"
    },
    {
      "id": 55,
      "start": 2135.5999755859375,
      "end": 2139.759979248047,
      "text": " We must recognize what's accomplished when we serve the Lord and by the way all of these"
    },
    {
      "id": 56,
      "start": 2139.759979248047,
      "end": 2144.759979248047,
      "text": " things are connected. When I recognize what's accomplished it's going to impact, it's going"
    },
    {
      "id": 57,
      "start": 2144.759979248047,
      "end": 2148.8599853515625,
      "text": " to help me have the right attitude. When I understand that it's him that's given me the"
    },
    {
      "id": 58,
      "start": 2148.8599853515625,
      "end": 2152.3199768066406,
      "text": " ability it's going to help me to have the right attitude. When I have the right attitude"
    },
    {
      "id": 59,
      "start": 2152.3199768066406,
      "end": 2155.9199829101562,
      "text": " then I'm going to serve him the way that I'm supposed to with a pure heart and not for"
    },
    {
      "id": 60,
      "start": 2155.9199829101562,
      "end": 2159.439971923828,
      "text": " any kind of man accolades and recognition but I'm going to serve the Lord with that"
    },
    {
      "id": 61,
      "start": 2159.439971923828,
      "end": 2163.2799682617188,
      "text": " pure heart and it's going to accomplish what it's supposed to accomplish. Number one for"
    },
    {
      "id": 62,
      "start": 2163.3799743652344,
      "end": 2170.3799743652344,
      "text": " God to be glorified but number two for God's people to be edified. For the profit of all."
    },
    {
      "id": 63,
      "start": 2171.739959716797,
      "end": 2176.499969482422,
      "text": " That God's people would be edified. That word means to be built up. We find that it's a"
    },
    {
      "id": 64,
      "start": 2176.499969482422,
      "end": 2182.3199768066406,
      "text": " word the Greek word would often in this particular era be used with regard to the construction"
    },
    {
      "id": 65,
      "start": 2182.3199768066406,
      "end": 2187.5799560546875,
      "text": " of a building and thinking about the edification and how people are to be built up and we find"
    },
    {
      "id": 66,
      "start": 2187.5799560546875,
      "end": 2190.97998046875,
      "text": " that the Bible says for the perfecting of the saints, for the work of the ministry,"
    },
    {
      "id": 67,
      "start": 2190.97998046875,
      "end": 2196.47998046875,
      "text": " for the edifying of the body of Christ in Ephesians 4 and verse number 12 and we find"
    },
    {
      "id": 68,
      "start": 2196.47998046875,
      "end": 2201.759979248047,
      "text": " that God's people are to be edified and as we serve again, as we serve God it's for the"
    },
    {
      "id": 69,
      "start": 2201.759979248047,
      "end": 2208.3999633789062,
      "text": " audience of one but it has an impact on many. It's for the audience of one but it has an"
    },
    {
      "id": 70,
      "start": 2208.3999633789062,
      "end": 2215.3999633789062,
      "text": " impact on many and we have been given the opportunity to serve the Lord. What a privilege."
    },
    {
      "id": 71,
      "start": 2216.3199768066406,
      "end": 2222.0399780273438,
      "text": " What a privilege as we examine our lives and understanding how great God is and certainly"
    },
    {
      "id": 72,
      "start": 2222.0399780273438,
      "end": 2227.8999633789062,
      "text": " each of us would say great is the Lord and greatly to be praised. How has his greatness"
    },
    {
      "id": 73,
      "start": 2227.8999633789062,
      "end": 2233.8799743652344,
      "text": " impacted the way that I pray? But this morning how has his greatness impacted how I serve"
    },
    {
      "id": 74,
      "start": 2233.8799743652344,
      "end": 2240.8799743652344,
      "text": " him? Because he's a great God. He's worthy of our best. Amen. He is worthy of our best."
    },
    {
      "id": 75,
      "start": 2241.47998046875,
      "end": 2246.8399658203125,
      "text": " I was reading an author a week ago and I was reading a particular author and he was quoting"
    },
    {
      "id": 76,
      "start": 2246.8399658203125,
      "end": 2250.3599853515625,
      "text": " somebody else and I don't remember who he was quoting so I can't tell you who it was"
    },
    {
      "id": 77,
      "start": 2250.3599853515625,
      "end": 2253.3399658203125,
      "text": " because it wasn't the man that actually wrote the book that I was reading but he was quoting"
    },
    {
      "id": 78,
      "start": 2253.3399658203125,
      "end": 2258.679962158203,
      "text": " somebody else and here's what he said. He said you and I have a best part of our day."
    },
    {
      "id": 79,
      "start": 2258.679962158203,
      "end": 2262.3599853515625,
      "text": " What he was talking about is like some people are morning people, some people are evening"
    },
    {
      "id": 80,
      "start": 2262.3599853515625,
      "end": 2267.3599853515625,
      "text": " people, whatever. We know what the best part of our day is. He said you know what I try"
    },
    {
      "id": 81,
      "start": 2267.3599853515625,
      "end": 2272.8799743652344,
      "text": " to do in my life? I try to give God the best part of my day. The best. Why? Because he"
    },
    {
      "id": 82,
      "start": 2272.8799743652344,
      "end": 2278.3199768066406,
      "text": " deserves it. You go over and read the book of Malachi. What a convicting book. They're"
    },
    {
      "id": 83,
      "start": 2278.3199768066406,
      "end": 2283.3199768066406,
      "text": " bringing some offerings but God says no, no, no would you take that to your governor? No"
    },
    {
      "id": 84,
      "start": 2283.3199768066406,
      "end": 2289.219970703125,
      "text": " you wouldn't. So why are you bringing it to me? I'm a great God and he is. Listen I know"
    },
    {
      "id": 85,
      "start": 2289.219970703125,
      "end": 2293.3999633789062,
      "text": " we've joked and I've said it before about that phraseology of it's good enough for government"
    },
    {
      "id": 86,
      "start": 2293.3999633789062,
      "end": 2301.5599670410156,
      "text": " work. Listen it's not good. Our best is what God deserves. By the way aren't you thankful"
    },
    {
      "id": 87,
      "start": 2301.5599670410156,
      "end": 2309.8399658203125,
      "text": " that he gave you his best? I don't want to just mail it in. I don't want to just kind"
    },
    {
      "id": 88,
      "start": 2309.8399658203125,
      "end": 2317.3599853515625,
      "text": " of go through the motions. No, no he deserves my best. He deserves your best. Let me use"
    },
    {
      "id": 89,
      "start": 2317.3599853515625,
      "end": 2322.199951171875,
      "text": " an example in closing this morning. An example from the Old Testament. Turn back to the book"
    },
    {
      "id": 90,
      "start": 2322.199951171875,
      "end": 2326.719970703125,
      "text": " of Exodus if you will. We won't take time to look through all of it. In fact it would"
    },
    {
      "id": 91,
      "start": 2326.719970703125,
      "end": 2331.1599731445312,
      "text": " be a sermon series to look at all of it. But I want you to look at Exodus 36 and we're"
    },
    {
      "id": 92,
      "start": 2331.1599731445312,
      "end": 2335.8399658203125,
      "text": " going to kind of walk our way through a few verses of scripture throughout the end of"
    },
    {
      "id": 93,
      "start": 2335.8399658203125,
      "end": 2343.0399780273438,
      "text": " the book of Exodus here this morning in closing. With this idea of our service to God for the"
    },
    {
      "id": 94,
      "start": 2343.0399780273438,
      "end": 2348.9199829101562,
      "text": " audience of one. As we examine our lives and we begin to consider how is my service to"
    },
    {
      "id": 95,
      "start": 2348.9199829101562,
      "end": 2354.8799438476562,
      "text": " God? What am I doing for God? How am I serving God? I hope that you have an answer for that"
    },
    {
      "id": 96,
      "start": 2354.8799438476562,
      "end": 2360.5199584960938,
      "text": " question because God has equipped you. He's enabled you. He's given us the opportunity,"
    },
    {
      "id": 97,
      "start": 2360.5199584960938,
      "end": 2366.5999755859375,
      "text": " the ability to serve him. What a privilege it is. We find that in the book of Exodus"
    },
    {
      "id": 98,
      "start": 2366.5999755859375,
      "end": 2369.5999755859375,
      "text": " there's a lot of things that are taking place in the book of Exodus. Of course God is bringing"
    },
    {
      "id": 99,
      "start": 2369.5999755859375,
      "end": 2375.2799682617188,
      "text": " his people out of Egyptian captivity, Egyptian bondage and as God would bring his people"
    },
    {
      "id": 100,
      "start": 2375.2799682617188,
      "end": 2380.0799560546875,
      "text": " out we find that God gives them instruction. He takes Moses up and gives them the Ten Commandments"
    },
    {
      "id": 101,
      "start": 2380.0799560546875,
      "end": 2384.47998046875,
      "text": " and so on and so forth and the law. He provides for them. The people break even the law as"
    },
    {
      "id": 102,
      "start": 2384.47998046875,
      "end": 2390.0799560546875,
      "text": " he's up there and receiving instruction with regard to the construction of the tabernacle."
    },
    {
      "id": 103,
      "start": 2390.0799560546875,
      "end": 2394.9199829101562,
      "text": " And many of us would be familiar with the tabernacle in the Old Testament. The gathering"
    },
    {
      "id": 104,
      "start": 2394.9199829101562,
      "end": 2398.9199829101562,
      "text": " place, the meeting place, the worshipping place if you will for the children of Israel"
    },
    {
      "id": 105,
      "start": 2398.9199829101562,
      "end": 2400.719970703125,
      "text": " until the time of..."
    },
    {
      "id": 0,
      "start": 2400.719970703125,
      "end": 2407.599970817566,
      "text": " Solomon when the temple would be built. So, for a number of generations, it was that God's"
    },
    {
      "id": 1,
      "start": 2407.599970817566,
      "end": 2414.639970779419,
      "text": " presence was known physically on earth through the tabernacle. We find that the Bible tells us,"
    },
    {
      "id": 2,
      "start": 2414.639970779419,
      "end": 2422.559970855713,
      "text": " and what a joy, in the book of John, that Jesus, he dwelt among us, and that Greek word truly is"
    },
    {
      "id": 3,
      "start": 2422.559970855713,
      "end": 2427.9199714660645,
      "text": " tabernacled amongst us. What a privilege and what a blessing. You think about the incarnation."
    },
    {
      "id": 4,
      "start": 2427.9199714660645,
      "end": 2432.959972381592,
      "text": " But here, we think about the construction of the tabernacle. All of the instruction is given."
    },
    {
      "id": 5,
      "start": 2432.959972381592,
      "end": 2437.5199699401855,
      "text": " If you were to study the book of Exodus, and if you were to have an idea of the tabernacle,"
    },
    {
      "id": 6,
      "start": 2437.5199699401855,
      "end": 2443.999969482422,
      "text": " and all of the intricacies. I mean, it was a very elaborate structure. There was a lot of work that"
    },
    {
      "id": 7,
      "start": 2443.999969482422,
      "end": 2448.879970550537,
      "text": " took place. But I want you to understand that if you were to study through the book of Exodus,"
    },
    {
      "id": 8,
      "start": 2448.879970550537,
      "end": 2454.6399688720703,
      "text": " and begin to try to nail down a time frame, it's about five to six months that it took"
    },
    {
      "id": 9,
      "start": 2454.6399688720703,
      "end": 2460.959972381592,
      "text": " them to construct the tabernacle. Now, that's pretty amazing. When you consider all that was"
    },
    {
      "id": 10,
      "start": 2460.959972381592,
      "end": 2465.439971923828,
      "text": " involved with the tabernacle, and all of the pieces of furniture, and the elaborate work,"
    },
    {
      "id": 11,
      "start": 2465.439971923828,
      "end": 2470.4799728393555,
      "text": " five to six months for its completion. And we think about this truth as we look at this idea"
    },
    {
      "id": 12,
      "start": 2470.4799728393555,
      "end": 2474.6399688720703,
      "text": " of our service to the Lord. And as we think about the construction of the tabernacle,"
    },
    {
      "id": 13,
      "start": 2474.6399688720703,
      "end": 2480.2399673461914,
      "text": " God had equipped Bezalel and Aholiab. He gives us their names specifically. And by the way,"
    },
    {
      "id": 14,
      "start": 2480.2399673461914,
      "end": 2486.0799713134766,
      "text": " he told Moses about them, not only equipping them for the work, but enabling them to teach others"
    },
    {
      "id": 15,
      "start": 2486.7999725341797,
      "end": 2491.839973449707,
      "text": " how to do those things. But we find that as we look here, and we think about their work for God,"
    },
    {
      "id": 16,
      "start": 2491.839973449707,
      "end": 2495.839973449707,
      "text": " the Bible tells us in Exodus 36, in verse number one, notice it says,"
    },
    {
      "id": 17,
      "start": 2495.839973449707,
      "end": 2502.5599670410156,
      "text": " then wrought Bezalel and Aholiab, notice, and every wise-hearted man. And then notice this phrase,"
    },
    {
      "id": 18,
      "start": 2502.5599670410156,
      "end": 2509.599967956543,
      "text": " in whom the Lord put wisdom and understanding to know how to work all manner of work"
    },
    {
      "id": 19,
      "start": 2509.599967956543,
      "end": 2515.999969482422,
      "text": " for the service of the sanctuary according to all that the Lord had commanded. So,"
    },
    {
      "id": 20,
      "start": 2515.999969482422,
      "end": 2521.599967956543,
      "text": " who was it that equipped them? It was the Lord. Who was it that equips you? It's the Lord."
    },
    {
      "id": 21,
      "start": 2521.599967956543,
      "end": 2526.9599685668945,
      "text": " We've belabored the point in the New Testament this morning, for us as God's people in 2023,"
    },
    {
      "id": 22,
      "start": 2526.9599685668945,
      "end": 2532.959976196289,
      "text": " that God has equipped and enabled us. And here, as we look at this Old Testament illustration"
    },
    {
      "id": 23,
      "start": 2532.959976196289,
      "end": 2538.8799743652344,
      "text": " to prove the point this morning, to nail it home, if you will, that it was God who had given"
    },
    {
      "id": 24,
      "start": 2538.8799743652344,
      "end": 2545.5999755859375,
      "text": " to Bezalel, Aholiab, and every wise-hearted man, the Lord put wisdom and understanding"
    },
    {
      "id": 25,
      "start": 2545.5999755859375,
      "end": 2550.7999725341797,
      "text": " to know how to work all manner of work for the service of the sanctuary according to all the"
    },
    {
      "id": 26,
      "start": 2550.7999725341797,
      "end": 2555.679977416992,
      "text": " Lord had commanded. Notice verse two, and Moses called Bezalel and Aholiab and every wise-hearted"
    },
    {
      "id": 27,
      "start": 2555.679977416992,
      "end": 2561.2799682617188,
      "text": " man, in whose heart the Lord had put wisdom, and every one whose heart stirred him up to come unto"
    },
    {
      "id": 28,
      "start": 2561.2799682617188,
      "end": 2569.919967651367,
      "text": " the work. Notice these words, to do it. What a privilege. I don't know. God doesn't tell us a"
    },
    {
      "id": 29,
      "start": 2569.919967651367,
      "end": 2578.3199768066406,
      "text": " whole lot about Bezalel or Aholiab. The other men aren't even name by name. But I'd like to think"
    },
    {
      "id": 30,
      "start": 2579.759963989258,
      "end": 2587.759963989258,
      "text": " that these men had a perspective of who am I that God would allow me to be used in this manner."
    },
    {
      "id": 31,
      "start": 2588.6399688720703,
      "end": 2595.919967651367,
      "text": " Who am I that I would be privileged, that God would enable me to make these pieces of furniture"
    },
    {
      "id": 32,
      "start": 2596.959976196289,
      "end": 2603.759963989258,
      "text": " that would be within the holy place and even the holy of holies. It's amazing. And they were"
    },
    {
      "id": 33,
      "start": 2603.759963989258,
      "end": 2609.519973754883,
      "text": " equipped, but they had to do the work. They were equipped for it, but they had to do it."
    },
    {
      "id": 34,
      "start": 2610.0799713134766,
      "end": 2613.679977416992,
      "text": " We've been equipped, we've been enabled, we've been given a gift, but we better use it."
    },
    {
      "id": 35,
      "start": 2613.679977416992,
      "end": 2623.3599700927734,
      "text": " We better use it. And we find in chapter 36 that God tells us how they were to do the work and how"
    },
    {
      "id": 36,
      "start": 2623.3599700927734,
      "end": 2629.759963989258,
      "text": " the people brought the materials that were needed. And you read through chapter 36 and 37 and 38 and"
    },
    {
      "id": 37,
      "start": 2629.759963989258,
      "end": 2634.6399688720703,
      "text": " you find that throughout these chapters that they're working and they're working diligently."
    },
    {
      "id": 38,
      "start": 2635.519973754883,
      "end": 2639.999969482422,
      "text": " They're working. It seems as if as you read the chapters here in the book of Exodus that it's a"
    },
    {
      "id": 39,
      "start": 2639.999969482422,
      "end": 2644.8799743652344,
      "text": " delight for them. You don't see Moses having to run around and try to, hey, let's go guys, we got"
    },
    {
      "id": 40,
      "start": 2644.8799743652344,
      "end": 2650.3999633789062,
      "text": " to get this done. Let's go. No, no, it looks like it's a delight. It's just joy. We sing the song,"
    },
    {
      "id": 41,
      "start": 2650.3999633789062,
      "end": 2656.9599609375,
      "text": " there's joy in serving Jesus. And here they're serving the Lord. And you come to chapter 39"
    },
    {
      "id": 42,
      "start": 2657.999969482422,
      "end": 2663.5999755859375,
      "text": " of the book of Exodus and look down, if you will, at verse number 32. The Bible says,"
    },
    {
      "id": 43,
      "start": 2664.1599731445312,
      "end": 2666.6399841308594,
      "text": " I'll give you a moment, 39 and verse 32,"
    },
    {
      "id": 44,
      "start": 2666.6399841308594,
      "end": 2673.5199584960938,
      "text": " thus was all the work of the tabernacle of the tent of the congregation, look at that word,"
    },
    {
      "id": 45,
      "start": 2673.5199584960938,
      "end": 2681.3599853515625,
      "text": " finished. It was finished. The children of Israel did according to all that the Lord commanded Moses,"
    },
    {
      "id": 46,
      "start": 2681.999969482422,
      "end": 2689.0399780273438,
      "text": " so did they. They were faithful. Notice what it said, it was finished. They did the work that"
    },
    {
      "id": 47,
      "start": 2689.2799682617188,
      "end": 2693.759979248047,
      "text": " they did the work that God called them to do. Notice what it says, according to all that the"
    },
    {
      "id": 48,
      "start": 2693.759979248047,
      "end": 2701.199981689453,
      "text": " Lord commanded Moses, so did they. No shortcuts. They did it all. Notice in verse number 42,"
    },
    {
      "id": 49,
      "start": 2701.199981689453,
      "end": 2706.719970703125,
      "text": " the end of the chapter, Exodus 39 verse 42, according to all that the Lord commanded Moses,"
    },
    {
      "id": 50,
      "start": 2706.719970703125,
      "end": 2713.679962158203,
      "text": " so the children of Israel made all the work. And Moses did look upon all the work and behold,"
    },
    {
      "id": 51,
      "start": 2713.679962158203,
      "end": 2721.5999755859375,
      "text": " they had done it as the Lord had commanded. Even so had they done it and Moses blessed them."
    },
    {
      "id": 52,
      "start": 2723.0399780273438,
      "end": 2729.759979248047,
      "text": " Wow. What an amazing time in Israel's history. Chapter 40 of the book of Exodus,"
    },
    {
      "id": 53,
      "start": 2729.759979248047,
      "end": 2735.2799682617188,
      "text": " one of my favorite chapters of the Bible, because you see what takes place with the"
    },
    {
      "id": 54,
      "start": 2735.2799682617188,
      "end": 2739.8399658203125,
      "text": " rearing up of the tabernacle. We don't have time to read through it, but you'll notice if you read"
    },
    {
      "id": 55,
      "start": 2739.8399658203125,
      "end": 2745.5999755859375,
      "text": " it later on your own, that you'll find a number of references. In fact, 13 times from verse three"
    },
    {
      "id": 56,
      "start": 2745.5999755859375,
      "end": 2752.3199768066406,
      "text": " down through verse number 15, you read this statement, and thou shout. God told them what to"
    },
    {
      "id": 57,
      "start": 2752.3199768066406,
      "end": 2758.239959716797,
      "text": " do. God explicitly explained to them the instruction that they're to follow. And then you find that the"
    },
    {
      "id": 58,
      "start": 2758.239959716797,
      "end": 2764.0799560546875,
      "text": " Bible tells us as the Lord commanded Moses, repeated seven times, and you find that they"
    },
    {
      "id": 59,
      "start": 2764.0799560546875,
      "end": 2770.3999633789062,
      "text": " did it. They did the work. They did what God called them to do. And you come to verse number 34."
    },
    {
      "id": 60,
      "start": 2771.1199645996094,
      "end": 2775.0399780273438,
      "text": " And in Exodus chapter 40 and verse number 34, it starts with a word then."
    },
    {
      "id": 61,
      "start": 2776.3199768066406,
      "end": 2784.0799560546875,
      "text": " Then. The word then is an interesting word because it means after something. After the Lord commanded"
    },
    {
      "id": 62,
      "start": 2784.0799560546875,
      "end": 2790.719970703125,
      "text": " and after they did according to what the Lord commanded then. Then does not come"
    },
    {
      "id": 63,
      "start": 2791.679962158203,
      "end": 2799.8399658203125,
      "text": " if they don't do. Would you agree? We never read the end of Exodus 40 if they don't do as the Lord"
    },
    {
      "id": 64,
      "start": 2799.8399658203125,
      "end": 2805.5199584960938,
      "text": " commanded them to do. What is accomplished? What is it when we think about this truth of serving"
    },
    {
      "id": 65,
      "start": 2805.5199584960938,
      "end": 2809.9199829101562,
      "text": " the Lord and we recognize what is accomplished when we serve the Lord? We've already noted"
    },
    {
      "id": 66,
      "start": 2809.9199829101562,
      "end": 2814.8799743652344,
      "text": " their attitude. We've understood that God's given them the ability and we find what is accomplished."
    },
    {
      "id": 67,
      "start": 2814.8799743652344,
      "end": 2819.5199584960938,
      "text": " Well, because they did the work, we're able to read the end of Exodus when the Bible says,"
    },
    {
      "id": 68,
      "start": 2819.5199584960938,
      "end": 2831.759979248047,
      "text": " then a cloud covered the tent of the congregation and the glory of the Lord filled the tabernacle."
    },
    {
      "id": 69,
      "start": 2832.3999633789062,
      "end": 2838.1599731445312,
      "text": " Verse 35, and Moses were not able to enter into the tent of the congregation. Why? Because the"
    },
    {
      "id": 70,
      "start": 2838.1599731445312,
      "end": 2844.3999633789062,
      "text": " cloud abode thereon and the glory of the Lord filled the tabernacle. I hope that you'd agree"
    },
    {
      "id": 71,
      "start": 2844.3999633789062,
      "end": 2850.7999572753906,
      "text": " with me this morning that here we would find that God is glorified. There's no, listen, there's no"
    },
    {
      "id": 72,
      "start": 2850.7999572753906,
      "end": 2854.9599609375,
      "text": " way that God would fill the tabernacle with his glory if he wasn't pleased with what they did."
    },
    {
      "id": 73,
      "start": 2855.8399658203125,
      "end": 2861.9199829101562,
      "text": " And we find here that God's glory is manifested. His glory fills the tabernacle according to verse"
    },
    {
      "id": 74,
      "start": 2861.9199829101562,
      "end": 2868.1599731445312,
      "text": " 34 and verse number 35 and the Lord is exalted. The Lord is glorified. That's what happens in"
    },
    {
      "id": 75,
      "start": 2868.1599731445312,
      "end": 2872.6399841308594,
      "text": " your life and in my life when we serve the Lord. Listen, God's not called any one of us to build a"
    },
    {
      "id": 76,
      "start": 2872.6399841308594,
      "end": 2878.6399841308594,
      "text": " tabernacle. God's not called, he is, I'm thankful that my body is, when I got saved, when you got"
    },
    {
      "id": 77,
      "start": 2878.6399841308594,
      "end": 2883.439971923828,
      "text": " saved, our body is the temple of the Holy Ghost. Amen? That's what the New Testament believers,"
    },
    {
      "id": 78,
      "start": 2883.439971923828,
      "end": 2889.199981689453,
      "text": " we understand that. You don't have to, God's not called you to do what he called a bezel on a holy"
    },
    {
      "id": 79,
      "start": 2889.199981689453,
      "end": 2893.999969482422,
      "text": " abbey and these wise-hearted men, but we find that as they did what God called them to do,"
    },
    {
      "id": 80,
      "start": 2893.999969482422,
      "end": 2898.3199768066406,
      "text": " as they reviewed, they had the right attitude, they understood the ability that God gave,"
    },
    {
      "id": 81,
      "start": 2898.3199768066406,
      "end": 2904.8799743652344,
      "text": " and they accomplished bringing glory to God. That's the first and primary reason that we serve"
    },
    {
      "id": 82,
      "start": 2904.8799743652344,
      "end": 2909.5199584960938,
      "text": " God is to bring honor and glory to him. But I said this is for the audience of one but has an impact"
    },
    {
      "id": 83,
      "start": 2909.5199584960938,
      "end": 2918.0,
      "text": " on many. I want you to understand that for generations, for generations, the people of Israel"
    },
    {
      "id": 84,
      "start": 2918.7999877929688,
      "end": 2924.5599975585938,
      "text": " went to a tabernacle and brought their offerings, pointing to Messiah who would one day come"
    },
    {
      "id": 85,
      "start": 2925.3599853515625,
      "end": 2932.3999633789062,
      "text": " because some people served the Lord. There's no record, none that I have found, if you found it,"
    },
    {
      "id": 86,
      "start": 2932.3999633789062,
      "end": 2936.7999877929688,
      "text": " please help me, none that I have found where any of these pieces of furniture are ever remade"
    },
    {
      "id": 87,
      "start": 2937.7599487304688,
      "end": 2944.7999877929688,
      "text": " before the construction of the temple. They did a thorough work. They were diligent in serving"
    },
    {
      "id": 88,
      "start": 2944.7999877929688,
      "end": 2952.5599975585938,
      "text": " the Lord and generations of people were impacted because of their service to God. It was for the"
    },
    {
      "id": 89,
      "start": 2953.2799682617188,
      "end": 2957.7599487304688,
      "text": " glory of God, but it had an impact on many. And I wonder this morning,"
    },
    {
      "id": 90,
      "start": 2959.6799926757812,
      "end": 2965.5999755859375,
      "text": " does our service bring glory to God? How are we serving God? Is it bringing glory to him?"
    },
    {
      "id": 91,
      "start": 2965.5999755859375,
      "end": 2973.3599853515625,
      "text": " Who's it impacting? How is our service having an effect on others? What a joy to have the"
    },
    {
      "id": 92,
      "start": 2973.3599853515625,
      "end": 2978.47998046875,
      "text": " opportunity to serve the Lord. I think of some Bible characters that served the Lord and had"
    },
    {
      "id": 93,
      "start": 2978.47998046875,
      "end": 2984.239990234375,
      "text": " a proper perspective and they understood what God had given them to do. And I think about the"
    },
    {
      "id": 94,
      "start": 2984.239990234375,
      "end": 2990.3199462890625,
      "text": " way in which David prepared for the house of the Lord, the temple, if you fast forward all of these"
    },
    {
      "id": 95,
      "start": 2990.3199462890625,
      "end": 2996.6399536132812,
      "text": " generations later and you think about what God is doing and how David would prepare for the palace"
    },
    {
      "id": 96,
      "start": 2996.6399536132812,
      "end": 2999.6799926757812,
      "text": " and he says that the palace is not for man but it's for God."
    },
    {
      "id": 0,
      "start": 2999.6799926757812,
      "end": 3001.279992699623,
      "text": " So therefore, what was David doing?"
    },
    {
      "id": 1,
      "start": 3001.279992699623,
      "end": 3005.399992465973,
      "text": " Man, David was preparing with all of his might, the Bible tells us."
    },
    {
      "id": 2,
      "start": 3005.399992465973,
      "end": 3012.439992904663,
      "text": " He talks about how the house that God would dwell in, that Solomon would build, how that"
    },
    {
      "id": 3,
      "start": 3012.439992904663,
      "end": 3017.639991760254,
      "text": " it was to be a great house and how it was to be magnificent and so on and so forth."
    },
    {
      "id": 4,
      "start": 3017.639991760254,
      "end": 3021.639991760254,
      "text": " And we find here that God would use David in this way."
    },
    {
      "id": 5,
      "start": 3021.639991760254,
      "end": 3027.8799934387207,
      "text": " I think about the situation as you look at the, after the destruction of Jerusalem and"
    },
    {
      "id": 6,
      "start": 3027.8799934387207,
      "end": 3033.799991607666,
      "text": " the Babylonian captivity and all that takes place and you begin to think about the rebuilding"
    },
    {
      "id": 7,
      "start": 3033.799991607666,
      "end": 3038.8399925231934,
      "text": " and what takes place and those opposition and how that the Bible tells us that there"
    },
    {
      "id": 8,
      "start": 3038.8399925231934,
      "end": 3044.2399940490723,
      "text": " were some people that had the opportunity to go and to do a work and here the people"
    },
    {
      "id": 9,
      "start": 3044.2399940490723,
      "end": 3049.0999908447266,
      "text": " were calling, hey, come down here and let's talk and let's do this and what have you and"
    },
    {
      "id": 10,
      "start": 3049.0999908447266,
      "end": 3055.759994506836,
      "text": " all of those that were trying to prevent the work of God from continuing to go forward."
    },
    {
      "id": 11,
      "start": 3055.759994506836,
      "end": 3059.7199935913086,
      "text": " And we find that the perspective was that we're doing a great work."
    },
    {
      "id": 12,
      "start": 3059.7199935913086,
      "end": 3060.7199935913086,
      "text": " Why?"
    },
    {
      "id": 13,
      "start": 3060.7199935913086,
      "end": 3061.7199935913086,
      "text": " Because it's a work for God."
    },
    {
      "id": 14,
      "start": 3061.7199935913086,
      "end": 3064.059989929199,
      "text": " It's a work for God."
    },
    {
      "id": 15,
      "start": 3064.059989929199,
      "end": 3067.9999923706055,
      "text": " This morning as we serve the Lord, we're not serving men."
    },
    {
      "id": 16,
      "start": 3067.9999923706055,
      "end": 3071.7999954223633,
      "text": " As you serve in our church, you're not serving me as the pastor."
    },
    {
      "id": 17,
      "start": 3071.7999954223633,
      "end": 3074.3199920654297,
      "text": " You're serving the Lord."
    },
    {
      "id": 18,
      "start": 3074.3199920654297,
      "end": 3075.919990539551,
      "text": " Does it profit with all?"
    },
    {
      "id": 19,
      "start": 3075.919990539551,
      "end": 3076.919990539551,
      "text": " Sure it does."
    },
    {
      "id": 20,
      "start": 3076.919990539551,
      "end": 3078.9999923706055,
      "text": " Does it have an impact on the whole body?"
    },
    {
      "id": 21,
      "start": 3078.9999923706055,
      "end": 3079.9999923706055,
      "text": " Sure."
    },
    {
      "id": 22,
      "start": 3079.9999923706055,
      "end": 3083.9999923706055,
      "text": " That's how it's supposed to work ultimately to bring honor and glory to the Lord."
    },
    {
      "id": 23,
      "start": 3083.9999923706055,
      "end": 3088.239990234375,
      "text": " And as we bring honor and glory to the Lord, then we have the opportunity to also have"
    },
    {
      "id": 24,
      "start": 3088.239990234375,
      "end": 3089.9999923706055,
      "text": " an impact on many."
    },
    {
      "id": 25,
      "start": 3089.9999923706055,
      "end": 3096.519989013672,
      "text": " This morning for the audience of one, we serve a great God, a great, great God and He gives"
    },
    {
      "id": 26,
      "start": 3096.519989013672,
      "end": 3100.6799926757812,
      "text": " us the opportunity, the privilege of being able to serve Him."
    },
    {
      "id": 27,
      "start": 3100.6799926757812,
      "end": 3104.1199951171875,
      "text": " I wonder this morning, how's our attitude towards serving the Lord?"
    },
    {
      "id": 28,
      "start": 3104.1199951171875,
      "end": 3106.07999420166,
      "text": " How's our attitude?"
    },
    {
      "id": 29,
      "start": 3106.07999420166,
      "end": 3110.7199935913086,
      "text": " Do we have the perspective that I have to do this or do we have the perspective that"
    },
    {
      "id": 30,
      "start": 3110.7199935913086,
      "end": 3111.919990539551,
      "text": " I get to do this?"
    },
    {
      "id": 31,
      "start": 3111.919990539551,
      "end": 3117.519989013672,
      "text": " I hope this morning it's a get to perspective, that it's a delight, that there truly is joy"
    },
    {
      "id": 32,
      "start": 3117.519989013672,
      "end": 3120.7199935913086,
      "text": " in serving Jesus."
    },
    {
      "id": 33,
      "start": 3120.7199935913086,
      "end": 3122.8999938964844,
      "text": " Recognize this morning it's God who's given us the ability."
    },
    {
      "id": 34,
      "start": 3122.8999938964844,
      "end": 3126.07999420166,
      "text": " We must remember that."
    },
    {
      "id": 35,
      "start": 3126.07999420166,
      "end": 3129.479995727539,
      "text": " The only thing special about us is God."
    },
    {
      "id": 36,
      "start": 3129.479995727539,
      "end": 3132.6799926757812,
      "text": " It's the only thing special about us."
    },
    {
      "id": 37,
      "start": 3132.6799926757812,
      "end": 3136.5599975585938,
      "text": " Paul said, I am what I am by the grace of God."
    },
    {
      "id": 38,
      "start": 3136.5599975585938,
      "end": 3143.439987182617,
      "text": " This morning we can accomplish great things as we serve the Lord, glorifying Him and then"
    },
    {
      "id": 39,
      "start": 3143.439987182617,
      "end": 3145.719985961914,
      "text": " impacting others."
    },
    {
      "id": 40,
      "start": 3145.719985961914,
      "end": 3150.3599853515625,
      "text": " This morning for the audience of one, O Lord, would our service be pleasing to Thee?"
    },
    {
      "id": 41,
      "start": 3150.3599853515625,
      "end": 3152.279998779297,
      "text": " Would we have that right perspective?"
    },
    {
      "id": 42,
      "start": 3152.279998779297,
      "end": 3153.279998779297,
      "text": " Let's pray."
    },
    {
      "id": 43,
      "start": 3153.279998779297,
      "end": 3154.279998779297,
      "text": " Father, we love You."
    },
    {
      "id": 44,
      "start": 3154.279998779297,
      "end": 3156.3599853515625,
      "text": " How we thank You for loving us."
    },
    {
      "id": 45,
      "start": 3156.3599853515625,
      "end": 3162.199996948242,
      "text": " We thank You for the opportunity that You've given us to gather, to hear from Your Word."
    },
    {
      "id": 46,
      "start": 3162.199996948242,
      "end": 3168.8799896240234,
      "text": " Thank You for the examples of those in the Scriptures that served You faithfully."
    },
    {
      "id": 47,
      "start": 3168.8799896240234,
      "end": 3175.239990234375,
      "text": " God I pray that You would help us to serve You faithfully and acceptably."
    },
    {
      "id": 48,
      "start": 3175.239990234375,
      "end": 3180.3999938964844,
      "text": " Lord that we would evaluate our lives, our attitude toward our service to You."
    },
    {
      "id": 49,
      "start": 3180.3999938964844,
      "end": 3184.3599853515625,
      "text": " God I pray that we bring You honor and glory."
    },
    {
      "id": 50,
      "start": 3184.3599853515625,
      "end": 3188.7999877929688,
      "text": " I pray that others would be impacted by our service to Thee."
    },
    {
      "id": 51,
      "start": 3188.7999877929688,
      "end": 3191.7999877929688,
      "text": " Lord maybe there's someone here that's not sure of heaven."
    },
    {
      "id": 52,
      "start": 3191.7999877929688,
      "end": 3194.3599853515625,
      "text": " They've never been saved."
    },
    {
      "id": 53,
      "start": 3194.3599853515625,
      "end": 3195.959991455078,
      "text": " God I pray that today they'd be saved."
    },
    {
      "id": 54,
      "start": 3195.959991455078,
      "end": 3197.519989013672,
      "text": " They'd trust Christ as their Savior."
    },
    {
      "id": 55,
      "start": 3197.519989013672,
      "end": 3200.519989013672,
      "text": " You're understanding they could never work to get to heaven."
    },
    {
      "id": 56,
      "start": 3200.519989013672,
      "end": 3203.3599853515625,
      "text": " They could never work to keep themselves saved."
    },
    {
      "id": 57,
      "start": 3203.3599853515625,
      "end": 3211.8799896240234,
      "text": " Yes, the Bible speaks of our works, our service, it's a result of being saved, not the means"
    },
    {
      "id": 58,
      "start": 3211.8799896240234,
      "end": 3214.439987182617,
      "text": " by which we are saved."
    },
    {
      "id": 59,
      "start": 3214.439987182617,
      "end": 3218.0799865722656,
      "text": " God I pray that the Holy Spirit of God would convict that one that might be here, Lord,"
    },
    {
      "id": 60,
      "start": 3218.0799865722656,
      "end": 3221.3999938964844,
      "text": " that they would understand their need today to be saved."
    },
    {
      "id": 61,
      "start": 3221.3999938964844,
      "end": 3225.039993286133,
      "text": " I pray for every child of God, Lord, as we've gathered this morning, we've been challenged"
    },
    {
      "id": 62,
      "start": 3225.039993286133,
      "end": 3226.439987182617,
      "text": " by Your Word."
    },
    {
      "id": 63,
      "start": 3226.439987182617,
      "end": 3231.3599853515625,
      "text": " I pray that we would evaluate our lives and our service to You."
    },
    {
      "id": 64,
      "start": 3231.3599853515625,
      "end": 3235.719985961914,
      "text": " God I pray that You'd help us to do what You've called us to do."
    },
    {
      "id": 65,
      "start": 3235.719985961914,
      "end": 3239.8399963378906,
      "text": " That we would be good stewards of the manifold grace of God."
    },
    {
      "id": 66,
      "start": 3239.8399963378906,
      "end": 3243.739990234375,
      "text": " That You would use us for Your honor and for Your glory."
    },
    {
      "id": 67,
      "start": 3243.739990234375,
      "end": 3247.3599853515625,
      "text": " That many others would be impacted by our service."
    },
    {
      "id": 68,
      "start": 3247.3599853515625,
      "end": 3251.6399993896484,
      "text": " We'll thank You in these moments of invitation, Lord, for the work that You'll do."
    },
    {
      "id": 69,
      "start": 3251.6399993896484,
      "end": 3256.3200073242188,
      "text": " I pray that You'd have Your will and way in every individual that's gathered together."
    },
    {
      "id": 70,
      "start": 3256.3200073242188,
      "end": 3257.3200073242188,
      "text": " We'll thank You for it."
    },
    {
      "id": 71,
      "start": 3257.3200073242188,
      "end": 3258.3200073242188,
      "text": " In Christ's name we pray."
    },
    {
      "id": 72,
      "start": 3258.3200073242188,
      "end": 3259.3200073242188,
      "text": " Would you stand with me?"
    },
    {
      "id": 73,
      "start": 3259.3200073242188,
      "end": 3261.3200073242188,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 74,
      "start": 3261.3200073242188,
      "end": 3265.959991455078,
      "text": " Kimberly's going to play quietly on the piano and as she plays the altar is open."
    },
    {
      "id": 75,
      "start": 3265.959991455078,
      "end": 3269.8399963378906,
      "text": " Maybe this morning you want to come and thank God for the opportunity to serve."
    },
    {
      "id": 76,
      "start": 3269.8399963378906,
      "end": 3274.279998779297,
      "text": " Maybe this morning you've not been serving like you should be and maybe you want to come"
    },
    {
      "id": 77,
      "start": 3274.279998779297,
      "end": 3278.279998779297,
      "text": " and ask God to help you in that particular area of your life."
    },
    {
      "id": 78,
      "start": 3278.279998779297,
      "end": 3281.5599975585938,
      "text": " If you're not saved we'd love to take a Bible and show you how you can know for sure that"
    },
    {
      "id": 79,
      "start": 3281.5599975585938,
      "end": 3284.1199951171875,
      "text": " heaven's your home as Kimberly plays the altar is open."
    }
  ],
  "processed_at": "2025-04-15T10:45:35.044121"
}