{
  "video_id": "CECxpbAod2A",
  "text": "41 this evening, Genesis chapter 41. We'll be looking at verses 44 through 53 and then next Sunday evening we'll finish up Genesis chapter number 41. It's kind of interesting if you think about Genesis 41 to this point in our study as we enter into the 44th verse tonight. Up to this point Joseph has been released from prison. Remember we start at the passage of Scripture and he's still in prison. Pharaoh had a dream no one could interpret the dream and the butler remembers, oh yeah I was in prison you were angry with me and there was a man there and he was able to interpret my dream and the baker's dream and they both came to pass just as he said they would and we find that Pharaoh sent and called for Joseph with haste and Joseph is released from prison. Joseph tells Pharaoh the dream. Not only does Joseph tell Pharaoh the dream but remember he provides counsel to Pharaoh with regard to what has to happen really over the next 14 years. The dream that Pharaoh had really was God revealing to Pharaoh what was going to happen in Egypt over the next 14 years. We find that the Bible spoke of God doing this work and that it would come to pass soon. It would shortly be brought to pass according to verse number 32 and we find that he, Joseph, after giving the interpretation and the counsel to Pharaoh that he is promoted to second in command over all of Egypt. Wow, what a chapter. I mean so many amazing things that take place in such a short period of time to begin Genesis chapter 41. It reminds me of God's timing and God's timing is amazing and when God is ready, when God's time is right and he brings it to pass and what a blessing. There are times in which we could be waiting and we're waiting and we're waiting and it seems like what's going on but when God is, when things are taking place in God's timing it's perfect and it happens just as he wants it to happen. We find this evening as we look at our text of scripture in verses 44 through 53 that God will provide us really an overview of the first seven years of the famine. Of course we know after the first seven years or those seven years of famine, we know, excuse me, the seven years of plenty, we know that those seven years of plenty would be followed by seven years of famine and so these few verses of scripture cover seven years of time, the seven years of plenty. Now it's interesting because up to verse number 43 all of those events that I just told you happened very quickly and here we find in just a handful of verses that God is going to give us an overview of those seven years of plenty and in doing so God gives us some information with regard to Joseph and what has been taking place. Joseph, in this text of scripture, we find that he is given an Egyptian name, he's also given an Egyptian bride and God blesses, he has two children. Notice in verse number 44 the Bible says, and Pharaoh said unto Joseph, I am Pharaoh without thee shall no man lift up his hand or foot in all the land of Egypt. And Pharaoh called Joseph's name Zaphnath-Paneah and he gave him to wife Asenath, the daughter of Potipharah, priest of On and Joseph went out over all the land of Egypt. The Bible tells us in verse 46 that Joseph was 30 years old when he stood before Pharaoh, king of Egypt and Joseph went out from the presence of Pharaoh and went throughout all the land of Egypt. If you draw your attention down to verse number 52 the Bible says the name of the second called he Ephraim, this is the second child and notice what it says, for God hath caused me to be fruitful in the land of my affliction. I've titled the message this evening from that verse of scripture there in verse number 52, fruitful in the land of affliction. Fruitful in the land of affliction. Many times when we think about the land of affliction we do not think of it as being a place that would produce fruit, that would be a fruitful place. In fact, we think about the land of affliction or times of affliction in your life, in my life, we don't think of them in very pleasant terms and an idea of looking at this passage of scripture, God helps us to learn some important truths. As I begin to look at this passage let me just say this by way of introduction, the name that Joseph called, or that Pharaoh gives Joseph, the Egyptian name Zaphnath-Paneah, the exact meaning is unclear and I'll admit that you can look at a number of different commentaries and theologians. In fact, the meaning of Joseph's Egyptian name has been debated amongst theologians and amongst Jewish rabbis for centuries, but it seems as if as you look at this and you look at some things that this name Zaphnath-Paneah, and it really makes sense when you think about this meaning, and again there's a lot of debate and some have different opinions as to what it means, but it seems that it carries this meaning, God speaks and he lives. Now it could be God speaks and he giveth life, but that idea, and I want you to think about that just for a moment, as Pharaoh, a polytheistic, idolatrous individual that he himself was looked at as being some level of deity by the people of Egypt, and yet as he stands there he has no way of having this dream interpreted, he is troubled, and Joseph comes in and Joseph says, remember, he says, it is not in me, God shall give Pharaoh an answer of peace, and when God uses Joseph to share with Pharaoh the interpretation of the dream and to give him counsel, Pharaoh could have picked any Egyptian name to give Joseph, but it seems as if there's a consensus with this meeting that God speaks and he lives. Isn't that precious? To think about the influence and impact that Joseph could have in the life of Pharaoh because he stood there with boldness and he stood there in humility, I believe that his only concern, I mentioned this a couple of weeks ago, his only concern was for the glory of God, and when you and I are only concerned for the glory of God, it's amazing what God can do in and through our lives. As we look at the text of Scripture tonight, we begin to look at these verses of Scripture, I believe that there are two principles that God really brings into focus for us as you read through the verses, and I hope tonight that we can consider these two principles and seek to make application in our lives. Number one, I believe that we see in this passage of Scripture the principle of preparation, the principle of preparation. Why do I say that? Well, we read verses 44 and 45 already and we find that Joseph is elevated to this position. The Bible tells us in verse number 46, I read it a moment ago, but notice it says, and Joseph was 30 years old when he stood before Pharaoh, king of Egypt. It's interesting to me that in this particular age, being 30 years old, he is elevated to a position of great power, but also a great responsibility. I want you to think about the power that he has. Only Pharaoh would have more power over all the land of Egypt, but then I want you to think about the responsibility that would be entrusted to Joseph. I mean, a great deal of responsibility is given to Joseph in placing him in this particular position. I believe that as we look at this portion of Scripture, we begin to see what's happening. Notice the Bible says that Joseph, at the end of verse number 46, he went out from the presence of Pharaoh and went throughout all the land of Egypt. The Bible says in verse 47, in the seven plenteous years, the earth brought forth by handfuls. Now this is aligned with what Joseph said would happen when Joseph gives the interpretation. He tells Pharaoh that there would be seven years of plenty and we find that it's exactly what's taking place. The Bible says that during those plenteous years, the earth brought forth by handfuls. Notice in verse 48, and he gathered up all the food of the seven years, which were in the land of Egypt, and laid up the food in the cities, the food of the field, which was round about every city, laid he up in the same. And Joseph gathered corn as the sand of the sea very much until he left numbering, for it was without number. Do you see the responsibility of this position that Joseph has? If we begin to think about the responsibility, no doubt having a position like this and having the power, but also having the responsibility to gather up during these years of plenty, no doubt there would be some that would not be happy with Joseph with regard to that which he was doing. There would be certainly a number of people that he would have to delegate responsibility to, that he would have responsibility entrusted to them. He had a great deal of responsibility laid upon his shoulders, but I would submit to you this evening that God was preparing Joseph for this very moment for years. The principle of preparation. See, in Genesis chapter 37, we are first introduced to Joseph when he is 17 years old. We don't know, we really don't know anything biblically scriptural about Joseph's life prior to that event in Genesis 37 when he comes on the scene as a 17-year-old, but I want you to think about Joseph when he first comes on the scene at 17 years old, it seems as if Joseph already at that point in his life had proven to be both faithful and trustworthy. Joseph was in a position, remember the Bible tells us that he brought back the evil report of his brothers. He understood the difference between right and wrong, good and evil. Oh today we have people that are much older than 17 that seem to not have any idea of morality and the difference between right and wrong, good and evil. And we find that Joseph, he observing their behavior, he knew of their evil report or their evil behavior and he brought back that evil report. So as his brothers depart, we find that it's Joseph who is given the responsibility to go see what your brothers are doing. Bring me word again. And we find that this is the responsibility that is entrusted to him and at that point in his life we find that Joseph is immediately obedient to what his father had instructed him to do. His dad calls him and says here son here's what I want you to do. Now we already know that his brothers didn't like him. His brothers were upset because of the dreams and all that had taken place and his brothers are are not kind towards him. They could not speak kindly to him and we find that here he goes out to find his brothers to fulfill the responsibility that had been given to him from his father and it's there where he's taken and put into a pit and eventually sold into slavery. We find that he comes to Egypt and he's there in Egypt, 17 years old, about 17. We find that's where we're introduced to him in Genesis 37. It seems as if all those events take place pretty quickly and we come to Genesis chapter 39 and we find that he's bought by one named Potiphar. And of course we find that Joseph immediately when he comes into the place of being in Potiphar's house, he's elevated to a position of responsibility and he has the responsibility to take care of, to be a minister there in the house of Potiphar to be a steward. God's preparing Joseph. God's preparing him and we find that Joseph after a period of time being the steward in Potiphar's house, we know that he's lied about and he's falsely accused and he finds himself in prison and guess what God's doing in Joseph's life in prison? He's preparing him. He's preparing him. So nearly 13 years, about 13 years have passed since Joseph has been in Egypt and all along the way God is preparing Joseph. God does a work of preparation in his servants. By the way I'm thankful for the work of preparation. I'm thankful for how God will lead and work in individuals lives and God has particular purposes and wills for our lives and he desires that he would prepare us for the task that he has for us to do. The problem is how do we deal with the time of preparation? How do we handle that season of preparation when God is shaping us and molding us and preparing us? Are we faithful? Are we obedient to what God has called us to do so that we're learning what we're supposed to learn? Because that principle of preparation is so important in our lives, God is preparing us. I wonder tonight what is God preparing us for? God has a plan and a purpose for you and your life and there are times in which we have that opportunity even as Joseph did to go through a period of preparation. And as Joseph would be entrusted with this great position of not only power but great responsibility, we find that God had been preparing him all along the way. Turn to the New Testament, if you will, the book of Luke. I want to hold your place there in Genesis 41, but I want to show you two verses. You're familiar with the verses no doubt in the book of Luke, but I want you to look at Luke 16 and then we'll look at a verse over in Luke 19. And I want you to consider with me the time, the principle that we see here of preparation. I am thankful that through the the overview that I just provided you with all along the way in Joseph's life, we find that he was faithful. And because he was faithful, God was molding him and God was shaping him and he was in a position that when Pharaoh says, okay Joseph, you're the one, you're the one that's going to be in this position, that Joseph was ready for the task that was given to him. Notice in Luke chapter 16 and verse number 10, the Bible says, he that is faithful in that which is least is faithful also in much. And he that is unjust in the least is unjust also in much. You know, a good indicator of the faithfulness of individuals is how do they handle the little things that are entrusted to them. The things that people might say, well that's really not that big of a deal, but no, it is a big deal. And we learn to be faithful in the little things and God will entrust us with bigger things. God will give us that responsibility. Why? Because he's preparing us even through those times. Joseph finds himself in Potiphar's house. What am I doing here? Why have I been sold here? And God's preparing him and he's faithful and God is with him and he's doing what he's supposed to be doing and he's the steward and he's so able to do what God has given him to do that even the Potiphar, the ruler of the home, he doesn't even know what's going on. He didn't trust at all to Joseph, the prison guard. He does the same thing. Joseph is faithful in that which is least and God gives him great responsibility. Notice in Luke chapter 19 and verse number 17. Luke 19 and verse number 17, this is a passage, we could really look at the entirety of it from verse 11 down through verse 27 of the truth of being faithful, but I want to just draw your attention to verse 17 and we'll get back over to the book of Genesis. Notice it says here, and he said unto him, well thou good servant, because thou hast been faithful in very little, have thou authority over ten cities. Faithful over little. You know what God's doing when he entrusts us with those little things? He's preparing us. He's preparing us. And I don't know exactly what he's preparing each and every one of us for, but it's very interesting how God works in the season of preparation. I'll use a personal illustration and when I was working in the corporate world, I remember working in the corporate world for a number of years and I had studied. I knew that God called me to the ministry and I knew that that's what God wanted me to do. I was working in our church doing all that the pastor would allow me to do with regard to ministry and opportunities and things were going well there, but I knew God had called me to pastor and I was working in the corporate world and honestly things were going absolutely wonderful from a corporate perspective with regard to promotions and all of those types of things, but I knew that's not where God had me forever. I knew that God called me to the ministry. And yet during that time, because of a principle that was taught to me by a spiritual mentor of understanding that God is able to prepare us through every season of life, that I determined that even while I was there, I was going to seek to be the best that I could be for the Lord and learn what I could learn so that God could use that time for whatever the future would be. And it's amazing to me, and I give all the glory to God, it's amazing to me on the opportunities that the Lord allowed me to have in the corporate world that have been such a blessing and a help when it comes to pastoring. Things that they don't teach you in Bible college, things that they don't teach you in seminary, things that you don't have any classes on certain things, and the opportunity that I had in that particular season of life in a time of preparation. And because of the influence in my life that was given to me that, hey, I know that this is not where you're going to be forever, I know that you believe God's called you to pastor, but in this place, learn what God has for you to learn. It's a season of preparation. And how I thank God for how he prepared and the things that he taught me. As we look in the book of Genesis in chapter 41, I believe that here we see a principle of preparation that Joseph, now at 30 years old, he is entrusted with this great position and he has great responsibility, he has great power, but God had been preparing him all along. It's not as if Joseph just, bam, you're going to be second in command. No, there was he was 17 when he first there is introduced to us in Genesis 37. So 13 years of preparation before he goes to the place, the position that we read of him having here. By the way, I think that if Joseph could stand here and give testimony, he'd be able to tell us that through those 13 years, God was preparing him for the task that was at hand. And what a blessing. I see another principle in our text of scripture, not only a principle of preparation, but I see the principle of perspective. Perspective. You know, everyone has a different perspective in life. Everyone has a different perspective when it comes to circumstances and events that take place in our lives, even in the lives of others. And we begin to look here and we find even as I've mentioned for the time... title of the message this evening, Fruitful in the Land of Affliction, we find that here God gives us some glimpse with regard to the principle of perspective. I believe that it's revealed to us Joseph, as I mentioned by way of introduction, had been given an Egyptian name and he had been given an Egyptian bride, yet when his two sons are born he gives them Hebrew names. And in giving them Hebrew names and understanding the meaning of the names, we find that it helps us to be able to learn about Joseph's perspective. What is his perspective with all that he's dealt with, with all that he's endured? The Bible tells us in verse number 50, and unto Joseph were born two sons before the years of famine came. So in those first seven years of plenty, we find that Joseph was blessed by the Lord to have two sons, it says, which Asenath, the daughter of Potipharah, priest of On, bear unto him. And Joseph called the name of the firstborn Manasseh. Notice what he says when we see the firstborn that is named here, Manasseh, the name means forgetfulness. It means to forget. Now it doesn't mean to forget like you forgot what was on your grocery list. Alright, how many of you ever forget what's on your grocery list? You understand what I'm saying? And we got so many tools that help us to remember things and yet we seem to forget things. And I have the opposite problem with a grocery list. I add things to it. I go down the cookie aisle and I'm like, oh yeah, we need those cookies and we need ice cream. And Holly says that wasn't on the list, but it just got in the cart somehow, you understand. But that's not what it means when we're talking about forgetfulness. It's this purpose of forgetting, this intentional forgetting something. Notice what he says, For God, said he, hath made me forget all my toil, and all my father's house. Now I don't believe that he's meaning all of the positive things and the good things because obviously there's some good things that he learned. He learned about Jehovah God. We find that even in giving his testimony and standing before Pharaoh and standing before his brothers as we go through the remainder of Genesis, we find that he continues to give glory to God. He did not forget the God of his father. He did not forget those truths that he was given. But I want you to understand that Joseph is saying that this idea of forgetfulness, that God made me to forget all my toil and my father's house. You know there were a lot of bad things that happened to Joseph. Right? We've studied them. Hated by your brothers. I mean to the point where they can't even speak kindly to you. This is a hatred at a whole nother level. We think about the selling into slavery. I mean they were going to kill him and then they decided no let's not kill him because we can actually get some money for him so why don't we sell him into slavery. And even as they had determined that they're going to put him in that pit so they could kill him, they're sitting there eating. I mean they have no care or concern whatsoever. And here's the thought tonight when we think about the principle of perspective. The negatives that are in our past, they must not rob us of our opportunity for today. See there are some negatives in each of our lives. There are some negatives in Joseph's life. There were some things that happened to him that if he determined that that was going to be the focus of his attention, if every day of his life he was going to just focus upon the fact that my brothers did me wrong, that my brothers did this and my brothers did that and this is not fair and this is not right, Joseph would not be second in command. He had to forget that stuff because those negatives would hinder Joseph from being able to do what God had for him to do. I want you to think about the principle. Turn to the book of Philippians if you will. Again hold your spot here in Genesis but turn to the book of Philippians and I want you to look at Philippians chapter number 3. I want you to think about what Paul says in this portion of scripture and there's so much rich truth in Philippians chapter number 3. I wish we could study all of it this evening but I want to draw your attention to some things that Paul says with regard to even what we find here in the life of Joseph in Genesis chapter 41 when he names his firstborn Manasseh, the idea of forgetfulness. Notice that Paul says this in verse number 10, I'll start there, that I may know him and the power of his resurrection, the fellowship of his sufferings being made conformable unto his death. So he reveals to us his desire to know the Lord in a very intimate way, not just knowing about God but knowing him personally and intimately. If by any means I might attain unto the resurrection of the dead, not as though I had already attained, either were already perfect, but I follow after, if then I may apprehend that for which also I am apprehended of Christ Jesus. And then notice verse 13, brethren, I count not myself to have apprehended. But this one thing I do, forgetting those things which are behind, and reaching forth unto those things which are before, I press toward the mark for the prize of the high calling of God in Christ Jesus. You know, there are a lot of people today that are crippled because of the things that happened to them in the past. They're crippled, figuratively speaking, because of the things that happened to them in the past. They've not forgotten them. They're holding on to them. They're bothered by them. The Bible teaches in the book of Hebrews the danger of a root of bitterness. You know what often happens when we cannot forget those negatives in the past is we get bitter. We get bitter. And bitterness will absolutely destroy you. It will destroy you. Someone said bitterness will destroy the vessel in which it's stored more than the vessel in which it's poured. Bitterness will destroy you. Joseph could have been bitter over the things that happened in his life, over the treatment that he experienced. I've only focused on his brothers, but think about Mrs. Potiphar as she lied and had him imprisoned. I mean, you think about Joseph coming into Egypt and all the events that happened to lead him there. And then he's in the house of Potiphar. And I mean, even though he's purchased as a slave, I mean, he's pretty successful and he's become the steward of the house and things are going well. But then Mrs. Potiphar lies about him and he finds himself in prison. Man, there's some things that he could get bitter about. Listen, be careful about bitterness. Many people today are crippled because of things that happened in their past. They just can't get over them. Can I say this? Be careful about psychologists and psychiatrists. I'm not either one. Anytime I'm asked to give counsel, I seek to give biblical counsel and I do it often. However, I would say this. Sometimes they just want to dig up things in the past and never really resolve them. Never really resolve them. And it can become very dangerous. And what I'm saying to you this evening is that when we look at this principle of perspective, where's your focus tonight? What are we focused on? If we just want to focus on the hurt and the harm and the bad things that happened to us in our past, it will cripple you from doing today what God has for you to do today. We can't live in the past. We can't change the past. It doesn't matter how angry we are. It doesn't matter how bitter we are about the things that happened to us. We cannot change them. Amen? You can't. You can't change them. As we see the firstborn son, Joseph called his name Manasseh. Forgetfulness. For God said he hath made me forget all my toil and all my father's house. I believe it's because of the name of the firstborn that we're able to read of the secondborn. I believe it's because of the perspective that I'm going to forget those things, the negatives, and I'm not going to let those hinder me from doing what God has for me. I find that in the 52nd verse we're told about the secondborn and it says here that he, the name of the second, called he Ephraim. For God hath caused me to be fruitful in the land of my affliction. I mean, what a perspective that Joseph has. Listen, he calls it what it is. It's a land of affliction. We don't have to sugarcoat things. We can call them what they are, but the reality is that even in the midst of what looks like and as we would look at this portion of scripture and look at all of the events in the life of Joseph, we could say yeah that's a land of affliction, but he says, but God made me to be fruitful. And so Ephraim means fruitfulness. It means fruitfulness. God hath caused him to be fruitful in the land of his affliction. And I want you to think about being fruitful. God has called us to be fruitful. Has he not? Turn to the book of John, if you will, John chapter number 15, and I want you to look. here at the truth of this idea of us as God's people being fruitful people. We find here that Joseph says, God hath made me, he hath caused me to be fruitful in the land of my affliction. What enabled Joseph to be fruitful in the land of his affliction was his perspective on understanding, as we looked at that firstborn son Manasseh, that forgetfulness. Man, if he just focused and just stayed on all of that and just determined that's where he was going to live, he would not be fruitful. John 15, notice in verse number one, I am the true vine, Jesus is speaking. My father is the husbandman. Often Jesus would use illustrations and analogies that people could easily relate to. And here he's using this very familiar teaching and truth with regard to agriculture, if you will. And he says, I am the true vine, and my father is the husbandman. Every branch in me that beareth not fruit, he taketh away. And every branch that beareth fruit, he purgeth it, that it may bring forth more fruit. So who are the branches that are in Jesus? We are, Christians, disciples, followers of Christ. Do you track? You see what's going on? Listen, he is the true vine. He'll say in just a little while, I am the vine, ye are the branches. And he says here, every branch in me, and so we know that we are the branches if we've trusted Jesus Christ as our personal Savior, we are the branches. And he says, every branch in me that beareth not fruit, he taketh away. That's a little bit scary. You know why? Because God's purpose is that we'd be fruitful. What good is a fruit tree if it doesn't produce fruit? They would understand this. You've got a fig tree, and it doesn't produce figs. How long are you going to keep the fig tree around? Three years, four years, 14 years, 22 years, no, eventually you're going to cut that thing down and you're going to plant something else because it's not producing fruit, correct? And the Bible says here, and every branch that beareth fruit, notice it says he purgeth it. Now, I'm not an arborist, I'm not an agricultural guru, but I understand, I've done some study and I understand the picture that Jesus is giving, and I understand the purpose of pruning. You know what happens when you prune? You get more fruit. You've got to cut it back, and when it grows, it produces more fruit. I pruned these crape myrtles out here a couple of years ago, and some of you are ready to kill me. Pastor, you killed the trees. No, no, I did some research and I did it how they said to do it. I'm not an arborist, but we didn't pay somebody to do it, and I just chopped them things up, man. You know what, Tim? They came back and they were beautiful. I mean, they just blossomed and flourished. Here he says, that every branch that bear fruit, he purgeth it, that it may bring forth. Notice what it says, more fruit. Verse 3, now you're clean through the word which I have spoken unto you. You can look at that in Ephesians 5 and 26 and see the ministry of God's word and cleansing. Notice verse 4, abide in me and I in you, as the branch cannot bear fruit of itself except it abide in the vine. No more can ye except ye abide in me. The principle of abiding is so critical. He says, abide in me and I in you, as the branch cannot bear fruit of itself. We know this. When Holly first got home from down in North Carolina, the first time when she was here for the scripture assembly, she arrived home and I had some roses waiting for her. Amen? All you husbands take notes and write things down. I had some roses, I had a card and I had some chocolate. I tried to cover all those boxes, amen? And I had it there waiting for her and then she was going to leave to go back to North Carolina and those roses got put down and guess what happened to those roses? They died. Why? Because they were cut from the vine. I mean, they were beautiful and then they died. And I noticed that before she got home, I was going to have to deal with those roses and I didn't deal with them on the Monday and then Tuesday I said, I got to take care of that but I had some other things going on and I just kind of left it there and Wednesday I walked downstairs and I said, what is that smell? You know what those roses started to do? They started to stink. How many of you know roses smell good when they're alive and when they're fresh, right? But they died and they stunk, I had to throw them away. We know this but notice Jesus saying this is us. He wants us to be fruitful. Joseph says, God hath made me to be fruitful, he hath caused me to be fruitful in the land of my affliction. I mean in the difficulties, God hath caused me to be fruitful. Notice in verse number five, I am the vine, ye are the branches, he that abideth in me and I in him, the same bringeth forth. What does it say? Much fruit, for without me ye can do nothing. If a man abide not in me, he is cast forth as a branch and is withered. Men gather them and cast them into the fire and they are burned. If ye abide in me and my words abide in you, ye shall ask what ye will and it shall be done unto you. Notice in verse eight, critical verse of Scripture, herein is my Father glorified that ye bear much fruit, so shall ye be my disciples. You know God wants us to be fruitful. He said to, when he issued that call to the disciples, they're on the Sea of Galilee, the call to Peter, he says, follow me and I will make you fishers of men. When we begin to look at John 15 and thinking about this principle of perspective with Joseph back in Genesis chapter 41, and he says, God hath caused me to be fruitful in the land of my affliction, and I say God has intended for us as his people to be fruitful people. And when we bear much fruit, see, it's fruit, more fruit, and much fruit, as you study through John 15, and he says that if you bear much fruit, he says, herein is my Father glorified that you bear much fruit. I want God to be glorified. So we've got to abide in him, and we have to allow God to work through our lives. Listen, we cannot hinder what God is seeking to do in our lives today because we're so focused on the hardships and the difficulties that happened at some time in our past. Joseph says when Manasseh is born, God has caused me to forget. God has caused me to be fruitful in the land of my affliction. Listen, this evening, we're going to face some affliction, some difficulty. You say, pastor, you're telling me I'm facing it right now. I understand. Turn to the book of 1 Thessalonians, if you will. I want to just journey real quickly through just a few verses of Scripture, and I hope that this helps us tonight. We consider the principle of preparation. God is working to prepare us. Listen, don't despise the time of preparation. Don't neglect a season of preparation in your life because we need that. God's preparing us for something. You think about this principle of perspective. Perspective is so important. In 1 Thessalonians chapter number 3, Paul had already mentioned in chapter 1 how that they came to them with much difficulty as they brought the gospel, and that was what they were dealing with. And if you go back to the book of Acts, you can study and see on that journey all of the hardship that they faced. But as you come to the third chapter, notice that the Bible says in verse number 3 that no man should be moved by these afflictions. Listen, there were some difficulties that the people in Thessalonica were facing. There were some persecutions that they were dealing with. There were some afflictions, and Paul says that no man should be moved by these afflictions. Listen, God is God, and He's on His throne, and He has a purpose, and even in that time of affliction, God can use you and can cause you to be fruitful. He says, knowing for yourselves know that we are appointed thereunto. Notice in 2 Thessalonians chapter number 1, and then we're going to come back to 1 Thessalonians because I want you to see the perspective and the opportunity that we can be fruitful even in the midst of affliction. In 2 Thessalonians 1 and verse number 4, the Bible says so that we ourselves glory in you in the churches of God for your patience and faith in all your persecutions and tribulations that ye endure. They were suffering. The church in Thessalonica, the believers, they were dealing with persecution and all these hardships and things that were taking place, and Paul says that you have patience and faith in all your persecutions and tribulations that ye endure. He said in chapter 3 of the first book, he says that no man should be moved by these afflictions, but I want you to go all the way back to the first chapter of 1 Thessalonians. First Thessalonians. And I want you to see that a people, a church that was facing persecution, affliction, and difficulty, that God had allowed them to be fruitful even in a season of difficulty and affliction. The Bible says in verse number seven of First Thessalonians one, actually back up to verse number four, if you will, knowing, brethren, beloved, your election of God for our gospel came not unto you in word only, but also in power and in the Holy Ghost and in much assurance, as you know what manner of men we were among you for your sake. And ye became followers of us and of the Lord, having received the word in much affliction with joy of the Holy Ghost. Now notice this, so that ye were in samples to all that believe in Macedonia and Achaia. Verse number eight, for from you sounded out the word of the Lord, not only in Macedonia and Achaia, but also in every place your faith to God were to spread abroad, so that we need not to speak anything, for they themselves show of us what manner of entering in we had unto you, and how you turned to God from idols to serve the living and true God. The church at Thessalonica had a great testimony. I've said this over the years, there's no perfect church, but the church at Thessalonica is a model church. And as you study through the two epistles to the Thessalonians, you find that they're a model church, and here Paul is saying at this last part of chapter number one, that even though they had dealt with affliction, and even though they had dealt with this persecution, these persecutions and tribulations, and all that they were dealing with, that they were still fruitful, for notice it says, for from you, in verse number eight, sounded out the word of the Lord, not only in Macedonia and Achaia, but also in every place your faith to God were to spread abroad, so that we need not to speak anything. It's almost as if Paul is saying, we go to share the gospel in a region, but you've already shared the gospel there. Now think about that for a moment. In the midst of their affliction, and their persecution, and their difficulties, and all they were dealing with, they were still sending out the truth of the gospel, they were still doing what they were seeking to be fruitful, God was using them to be fruitful, even in a time, a season of affliction. I've heard many testimonies over the years of people that have dealt with great hardships, be it physical or otherwise, and they share testimonies of, in that season of great difficulty and of affliction, how God used them to be able to share the gospel with someone, and they got saved. That's amazing to me, that God would work in that manner. See, this evening, we think about the principle of preparation, it's important that we understand, and we go through that season of preparation, for God has a purpose and a plan for us. And when he's ready to open that door, did we get all the preparation we were supposed to get? Are we ready to do what God has for us to do? See, because when the opportunity arises, that's not time to prepare, that's time to do. Does that make sense? But then the principle of perspective, what do we focus on? Do we focus on how bad things are? How terrible, how we were wronged, and how this happened and that happened, and I just can't imagine this person didn't do this, or this person didn't say hi to me, and this person, I mean, we get mad about silly things. Seriously, honestly. Somebody came to me about five weeks ago and said, Pastor, are you mad at me? I said, no, why would I be mad at you? Well, you didn't say hi to me last week. I'm very sorry. And it was a great conversation, everything was resolved. But what I'm saying is that, it wasn't that I didn't say hi because I was mad, we had a problem with the sound thing, my lapel wasn't working, and I was back there trying to get things fixed up, and working with whatever was going on, and I think it wasn't my lapel, it was my iPad. Because Joseph says, you just need to get a new one. But the reality is that sometimes the devil can use super little things to just mess us up. Seriously. And what's our perspective? Listen, Joseph had a whole lot of bad things. He said, God, he calls me to forget. And therefore, God's called me to be fruitful in the land of affliction. See, sometimes we're in the land of affliction when it's a time of great distress and just difficulty, and we think that means that we have a pass to just kind of do nothing. Well, I got all this stuff going on, and God understands, and it's just, woe is me, pity party. Joseph said, God, let me be fruitful. God hath called me to be fruitful in the land of my affliction. I don't know tonight what everyone is dealing with, but I know we have a God who if we keep our attention and our perspective on him, that even in the midst of difficulty and affliction, he can cause us to be fruitful. He can use us for his honor and for his glory. There's a world that was directly impacted because of Joseph's faithfulness and fruitfulness. People's lives were spared because there was a great famine that was coming, and because Joseph understood the preparation, Joseph had a right perspective. When the opportunity came, God used him. God calls me to be fruitful. Tonight, I hope that God would help us to have that perspective that Joseph had, that we'd understand the preparation that God is taking us through. Let's pray. Father, we love you. We thank you for loving us. We thank you that you're God, and though at times we don't understand all that's taking place, we can trust you. We can rest in you. God, help us to understand the seasons of preparation that you would guide and lead us through, and I pray that in those moments of preparation that you would help us to get all that we're supposed to get, that we would be prepared for the opportunities that you present us with. I think about this perspective of Joseph and the principle that we see here, the naming of his two sons, and God, I pray that you'd help us to look to Jesus, the author and finisher of our faith, help us to have an eternal perspective, not a temporal perspective, help us to not focus upon those things that are hurtful, but God, help us to focus on you and how you can cause us to be fruitful, even in the land of affliction. I pray that tonight you would move and work in hearts and lives as only you can. I pray, Lord, that we would not only see the life of Joseph recorded for us, but we would apply truth in our lives that would cause us to be used in like manner. We give you the glory for all that you'll do, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.559999942779541,
      "text": " 41 this evening, Genesis chapter 41. We'll be looking at verses 44 through 53"
    },
    {
      "id": 1,
      "start": 5.559999942779541,
      "end": 9.760000228881836,
      "text": " and then next Sunday evening we'll finish up Genesis chapter number 41."
    },
    {
      "id": 2,
      "start": 9.760000228881836,
      "end": 13.920000076293945,
      "text": " It's kind of interesting if you think about Genesis 41 to this point in our"
    },
    {
      "id": 3,
      "start": 13.920000076293945,
      "end": 14.600000381469727,
      "text": " study"
    },
    {
      "id": 4,
      "start": 14.600000381469727,
      "end": 19.360000610351562,
      "text": " as we enter into the 44th verse tonight. Up to this point Joseph"
    },
    {
      "id": 5,
      "start": 19.360000610351562,
      "end": 23.040000915527344,
      "text": " has been released from prison. Remember we start at the passage of Scripture and"
    },
    {
      "id": 6,
      "start": 23.040000915527344,
      "end": 25.280000686645508,
      "text": " he's still in prison. Pharaoh had a dream"
    },
    {
      "id": 7,
      "start": 25.280000686645508,
      "end": 28.68000030517578,
      "text": " no one could interpret the dream and the butler remembers, oh yeah"
    },
    {
      "id": 8,
      "start": 28.68000030517578,
      "end": 31.84000015258789,
      "text": " I was in prison you were angry with me and there was a man there"
    },
    {
      "id": 9,
      "start": 31.84000015258789,
      "end": 35.880001068115234,
      "text": " and he was able to interpret my dream and the baker's dream and they both came"
    },
    {
      "id": 10,
      "start": 35.880001068115234,
      "end": 36.959999084472656,
      "text": " to pass just as"
    },
    {
      "id": 11,
      "start": 36.959999084472656,
      "end": 40.91999816894531,
      "text": " he said they would and we find that Pharaoh sent and"
    },
    {
      "id": 12,
      "start": 40.91999816894531,
      "end": 44.720001220703125,
      "text": " called for Joseph with haste and Joseph is released from prison."
    },
    {
      "id": 13,
      "start": 44.720001220703125,
      "end": 49.720001220703125,
      "text": " Joseph tells Pharaoh the dream. Not only does Joseph tell Pharaoh the dream"
    },
    {
      "id": 14,
      "start": 49.720001220703125,
      "end": 52.959999084472656,
      "text": " but remember he provides counsel to Pharaoh"
    },
    {
      "id": 15,
      "start": 52.959999084472656,
      "end": 57.040000915527344,
      "text": " with regard to what has to happen really over the next 14 years."
    },
    {
      "id": 16,
      "start": 57.31999969482422,
      "end": 62.52000045776367,
      "text": " The dream that Pharaoh had really was God revealing to Pharaoh"
    },
    {
      "id": 17,
      "start": 62.52000045776367,
      "end": 66.36000061035156,
      "text": " what was going to happen in Egypt over the next 14 years."
    },
    {
      "id": 18,
      "start": 66.36000061035156,
      "end": 69.4000015258789,
      "text": " We find that the Bible spoke of God"
    },
    {
      "id": 19,
      "start": 69.4000015258789,
      "end": 73.27999877929688,
      "text": " doing this work and that it would come to pass soon. It would shortly"
    },
    {
      "id": 20,
      "start": 73.27999877929688,
      "end": 77.80000305175781,
      "text": " be brought to pass according to verse number 32 and we find that he, Joseph,"
    },
    {
      "id": 21,
      "start": 77.80000305175781,
      "end": 82.23999786376953,
      "text": " after giving the interpretation and the counsel to Pharaoh"
    },
    {
      "id": 22,
      "start": 82.23999786376953,
      "end": 85.95999908447266,
      "text": " that he is promoted to second in command over all of"
    },
    {
      "id": 23,
      "start": 85.95999908447266,
      "end": 90.19999694824219,
      "text": " Egypt. Wow, what a chapter. I mean so many amazing"
    },
    {
      "id": 24,
      "start": 90.19999694824219,
      "end": 94.0,
      "text": " things that take place in such a short period of time"
    },
    {
      "id": 25,
      "start": 94.0,
      "end": 97.23999786376953,
      "text": " to begin Genesis chapter 41. It reminds me"
    },
    {
      "id": 26,
      "start": 97.23999786376953,
      "end": 100.87999725341797,
      "text": " of God's timing and God's timing is amazing"
    },
    {
      "id": 27,
      "start": 100.87999725341797,
      "end": 105.76000213623047,
      "text": " and when God is ready, when God's time is right"
    },
    {
      "id": 28,
      "start": 105.76000213623047,
      "end": 110.23999786376953,
      "text": " and he brings it to pass and what a blessing. There are times in which we"
    },
    {
      "id": 29,
      "start": 110.23999786376953,
      "end": 111.72000122070312,
      "text": " could be waiting and we're"
    },
    {
      "id": 30,
      "start": 111.72000122070312,
      "end": 115.63999938964844,
      "text": " waiting and we're waiting and it seems like what's going on"
    },
    {
      "id": 31,
      "start": 115.80000305175781,
      "end": 120.44000244140625,
      "text": " but when God is, when things are taking place in God's timing"
    },
    {
      "id": 32,
      "start": 120.44000244140625,
      "end": 124.16000366210938,
      "text": " it's perfect and it happens just as he wants it to happen."
    },
    {
      "id": 33,
      "start": 124.16000366210938,
      "end": 129.9600067138672,
      "text": " We find this evening as we look at our text of scripture in verses 44 through 53"
    },
    {
      "id": 34,
      "start": 129.9600067138672,
      "end": 135.0800018310547,
      "text": " that God will provide us really an overview of the first seven years"
    },
    {
      "id": 35,
      "start": 135.0800018310547,
      "end": 139.1999969482422,
      "text": " of the famine. Of course we know after the first seven years or those seven"
    },
    {
      "id": 36,
      "start": 139.1999969482422,
      "end": 141.72000122070312,
      "text": " years of famine, we know, excuse me, the seven years of plenty,"
    },
    {
      "id": 37,
      "start": 141.8000030517578,
      "end": 144.67999267578125,
      "text": " we know that those seven years of plenty would be followed"
    },
    {
      "id": 38,
      "start": 144.67999267578125,
      "end": 148.9600067138672,
      "text": " by seven years of famine and so these few verses of scripture"
    },
    {
      "id": 39,
      "start": 148.9600067138672,
      "end": 152.0800018310547,
      "text": " cover seven years of time,"
    },
    {
      "id": 40,
      "start": 152.0800018310547,
      "end": 156.1999969482422,
      "text": " the seven years of plenty. Now it's interesting because up to verse number"
    },
    {
      "id": 41,
      "start": 156.1999969482422,
      "end": 156.9199981689453,
      "text": " 43"
    },
    {
      "id": 42,
      "start": 156.9199981689453,
      "end": 160.52000427246094,
      "text": " all of those events that I just told you happened very quickly"
    },
    {
      "id": 43,
      "start": 160.52000427246094,
      "end": 163.8000030517578,
      "text": " and here we find in just a handful of verses that God"
    },
    {
      "id": 44,
      "start": 163.8000030517578,
      "end": 168.0800018310547,
      "text": " is going to give us an overview of those seven years of plenty"
    },
    {
      "id": 45,
      "start": 168.27999877929688,
      "end": 172.63999938964844,
      "text": " and in doing so God gives us some information with regard to Joseph"
    },
    {
      "id": 46,
      "start": 172.63999938964844,
      "end": 176.0800018310547,
      "text": " and what has been taking place. Joseph,"
    },
    {
      "id": 47,
      "start": 176.0800018310547,
      "end": 179.60000610351562,
      "text": " in this text of scripture, we find that he is given"
    },
    {
      "id": 48,
      "start": 179.60000610351562,
      "end": 183.8000030517578,
      "text": " an Egyptian name, he's also given an Egyptian bride"
    },
    {
      "id": 49,
      "start": 183.8000030517578,
      "end": 188.16000366210938,
      "text": " and God blesses, he has two children. Notice in verse number 44"
    },
    {
      "id": 50,
      "start": 188.16000366210938,
      "end": 191.36000061035156,
      "text": " the Bible says, and Pharaoh said unto Joseph, I am Pharaoh"
    },
    {
      "id": 51,
      "start": 191.36000061035156,
      "end": 195.83999633789062,
      "text": " without thee shall no man lift up his hand or foot"
    },
    {
      "id": 52,
      "start": 196.0,
      "end": 200.24000549316406,
      "text": " in all the land of Egypt. And Pharaoh called Joseph's name"
    },
    {
      "id": 53,
      "start": 200.24000549316406,
      "end": 204.83999633789062,
      "text": " Zaphnath-Paneah and he gave him to wife Asenath,"
    },
    {
      "id": 54,
      "start": 204.83999633789062,
      "end": 208.27999877929688,
      "text": " the daughter of Potipharah, priest of On"
    },
    {
      "id": 55,
      "start": 208.27999877929688,
      "end": 211.8000030517578,
      "text": " and Joseph went out over all the land"
    },
    {
      "id": 56,
      "start": 211.8000030517578,
      "end": 215.9199981689453,
      "text": " of Egypt. The Bible tells us in verse 46 that Joseph was 30 years old when he"
    },
    {
      "id": 57,
      "start": 215.9199981689453,
      "end": 217.60000610351562,
      "text": " stood before Pharaoh, king of Egypt"
    },
    {
      "id": 58,
      "start": 217.60000610351562,
      "end": 220.8000030517578,
      "text": " and Joseph went out from the presence of Pharaoh and went throughout all"
    },
    {
      "id": 59,
      "start": 220.8000030517578,
      "end": 225.75999450683594,
      "text": " the land of Egypt. If you draw your attention down to verse number 52"
    },
    {
      "id": 60,
      "start": 225.75999450683594,
      "end": 229.52000427246094,
      "text": " the Bible says the name of the second called he Ephraim, this is the second child"
    },
    {
      "id": 61,
      "start": 229.52000427246094,
      "end": 233.0399932861328,
      "text": " and notice what it says, for God hath caused me to be fruitful"
    },
    {
      "id": 62,
      "start": 233.0399932861328,
      "end": 237.55999755859375,
      "text": " in the land of my affliction. I've titled the message this evening from that verse"
    },
    {
      "id": 63,
      "start": 237.55999755859375,
      "end": 238.63999938964844,
      "text": " of scripture there"
    },
    {
      "id": 64,
      "start": 238.63999938964844,
      "end": 242.36000061035156,
      "text": " in verse number 52, fruitful in the land"
    },
    {
      "id": 65,
      "start": 242.36000061035156,
      "end": 246.39999389648438,
      "text": " of affliction. Fruitful in the land of affliction. Many times when we think"
    },
    {
      "id": 66,
      "start": 246.39999389648438,
      "end": 249.8000030517578,
      "text": " about the land of affliction we do not think of it as being a place that would"
    },
    {
      "id": 67,
      "start": 249.8000030517578,
      "end": 252.9199981689453,
      "text": " produce fruit, that would be a fruitful place. In fact,"
    },
    {
      "id": 68,
      "start": 252.9600067138672,
      "end": 256.4800109863281,
      "text": " we think about the land of affliction or times of affliction in your life, in my"
    },
    {
      "id": 69,
      "start": 256.4800109863281,
      "end": 257.0400085449219,
      "text": " life,"
    },
    {
      "id": 70,
      "start": 257.0400085449219,
      "end": 261.239990234375,
      "text": " we don't think of them in very pleasant terms and an idea of"
    },
    {
      "id": 71,
      "start": 261.239990234375,
      "end": 265.5199890136719,
      "text": " looking at this passage of scripture, God helps us to learn"
    },
    {
      "id": 72,
      "start": 265.5199890136719,
      "end": 269.20001220703125,
      "text": " some important truths. As I begin to look at this passage"
    },
    {
      "id": 73,
      "start": 269.20001220703125,
      "end": 273.760009765625,
      "text": " let me just say this by way of introduction, the name that Joseph"
    },
    {
      "id": 74,
      "start": 273.760009765625,
      "end": 278.79998779296875,
      "text": " called, or that Pharaoh gives Joseph, the Egyptian name Zaphnath-Paneah,"
    },
    {
      "id": 75,
      "start": 279.3999938964844,
      "end": 284.1199951171875,
      "text": " the exact meaning is unclear and I'll admit that you can look at a number of"
    },
    {
      "id": 76,
      "start": 284.1199951171875,
      "end": 286.4800109863281,
      "text": " different commentaries and theologians. In fact,"
    },
    {
      "id": 77,
      "start": 286.4800109863281,
      "end": 289.4800109863281,
      "text": " the meaning of Joseph's"
    },
    {
      "id": 78,
      "start": 289.4800109863281,
      "end": 293.79998779296875,
      "text": " Egyptian name has been debated amongst theologians and amongst"
    },
    {
      "id": 79,
      "start": 293.79998779296875,
      "end": 299.32000732421875,
      "text": " Jewish rabbis for centuries, but it seems as if as you look at this and you"
    },
    {
      "id": 80,
      "start": 299.32000732421875,
      "end": 300.3599853515625,
      "text": " look at some things"
    },
    {
      "id": 81,
      "start": 300.3599853515625,
      "end": 305.32000732421875,
      "text": " that this name Zaphnath-Paneah, and it really makes sense when you think about"
    },
    {
      "id": 82,
      "start": 305.32000732421875,
      "end": 306.4800109863281,
      "text": " this meaning,"
    },
    {
      "id": 83,
      "start": 306.4800109863281,
      "end": 310.1199951171875,
      "text": " and again there's a lot of debate and some have different opinions as to what"
    },
    {
      "id": 84,
      "start": 310.1199951171875,
      "end": 310.7200012207031,
      "text": " it means,"
    },
    {
      "id": 85,
      "start": 310.7200012207031,
      "end": 314.8399963378906,
      "text": " but it seems that it carries this meaning, God speaks"
    },
    {
      "id": 86,
      "start": 314.8399963378906,
      "end": 320.8399963378906,
      "text": " and he lives. Now it could be God speaks and he giveth life,"
    },
    {
      "id": 87,
      "start": 320.8399963378906,
      "end": 325.1600036621094,
      "text": " but that idea, and I want you to think about that just for a moment,"
    },
    {
      "id": 88,
      "start": 325.1600036621094,
      "end": 329.0799865722656,
      "text": " as Pharaoh, a polytheistic,"
    },
    {
      "id": 89,
      "start": 329.0799865722656,
      "end": 334.6000061035156,
      "text": " idolatrous individual that he himself was looked at as being some level of"
    },
    {
      "id": 90,
      "start": 334.6000061035156,
      "end": 335.6000061035156,
      "text": " deity"
    },
    {
      "id": 91,
      "start": 335.7200012207031,
      "end": 340.3599853515625,
      "text": " by the people of Egypt, and yet as he stands there he has no"
    },
    {
      "id": 92,
      "start": 340.3599853515625,
      "end": 344.32000732421875,
      "text": " way of having this dream interpreted, he is troubled,"
    },
    {
      "id": 93,
      "start": 344.32000732421875,
      "end": 347.55999755859375,
      "text": " and Joseph comes in and Joseph says, remember,"
    },
    {
      "id": 94,
      "start": 347.55999755859375,
      "end": 351.3599853515625,
      "text": " he says, it is not in me, God shall give Pharaoh"
    },
    {
      "id": 95,
      "start": 351.3599853515625,
      "end": 355.79998779296875,
      "text": " an answer of peace, and when God uses Joseph"
    },
    {
      "id": 96,
      "start": 355.79998779296875,
      "end": 360.9200134277344,
      "text": " to share with Pharaoh the interpretation of the dream and to give him counsel,"
    },
    {
      "id": 97,
      "start": 360.9200134277344,
      "end": 364.1600036621094,
      "text": " Pharaoh could have picked any Egyptian name"
    },
    {
      "id": 98,
      "start": 364.760009765625,
      "end": 369.67999267578125,
      "text": " to give Joseph, but it seems as if there's a consensus"
    },
    {
      "id": 99,
      "start": 369.67999267578125,
      "end": 373.7200012207031,
      "text": " with this meeting that God speaks"
    },
    {
      "id": 100,
      "start": 373.7200012207031,
      "end": 377.1199951171875,
      "text": " and he lives. Isn't that precious?"
    },
    {
      "id": 101,
      "start": 377.1199951171875,
      "end": 380.32000732421875,
      "text": " To think about the influence and impact"
    },
    {
      "id": 102,
      "start": 380.32000732421875,
      "end": 385.3999938964844,
      "text": " that Joseph could have in the life of Pharaoh because he stood there with"
    },
    {
      "id": 103,
      "start": 385.3999938964844,
      "end": 386.5199890136719,
      "text": " boldness"
    },
    {
      "id": 104,
      "start": 386.5199890136719,
      "end": 391.6000061035156,
      "text": " and he stood there in humility, I believe that his only concern, I mentioned this a"
    },
    {
      "id": 105,
      "start": 391.6000061035156,
      "end": 392.67999267578125,
      "text": " couple of weeks ago,"
    },
    {
      "id": 106,
      "start": 392.7200012207031,
      "end": 397.44000244140625,
      "text": " his only concern was for the glory of God, and when you and I are only concerned"
    },
    {
      "id": 107,
      "start": 397.44000244140625,
      "end": 400.6400146484375,
      "text": " for the glory of God, it's amazing what God can do"
    },
    {
      "id": 108,
      "start": 400.6400146484375,
      "end": 405.8399963378906,
      "text": " in and through our lives. As we look at the text of Scripture tonight, we begin"
    },
    {
      "id": 109,
      "start": 405.8399963378906,
      "end": 406.1199951171875,
      "text": " to"
    },
    {
      "id": 110,
      "start": 406.1199951171875,
      "end": 410.9200134277344,
      "text": " look at these verses of Scripture, I believe that there are two principles"
    },
    {
      "id": 111,
      "start": 410.9200134277344,
      "end": 411.79998779296875,
      "text": " that God"
    },
    {
      "id": 112,
      "start": 411.79998779296875,
      "end": 415.9599914550781,
      "text": " really brings into focus for us as you read through the verses,"
    },
    {
      "id": 113,
      "start": 415.9599914550781,
      "end": 419.20001220703125,
      "text": " and I hope tonight that we can consider these two principles"
    },
    {
      "id": 114,
      "start": 419.3999938964844,
      "end": 422.67999267578125,
      "text": " and seek to make application in our lives. Number one,"
    },
    {
      "id": 115,
      "start": 422.67999267578125,
      "end": 425.7200012207031,
      "text": " I believe that we see in this passage of Scripture"
    },
    {
      "id": 116,
      "start": 425.7200012207031,
      "end": 430.0,
      "text": " the principle of preparation, the principle of preparation."
    },
    {
      "id": 117,
      "start": 430.0,
      "end": 434.0400085449219,
      "text": " Why do I say that? Well, we read verses 44 and 45 already"
    },
    {
      "id": 118,
      "start": 434.0400085449219,
      "end": 437.8800048828125,
      "text": " and we find that Joseph is elevated to this position. The Bible tells us in"
    },
    {
      "id": 119,
      "start": 437.8800048828125,
      "end": 439.20001220703125,
      "text": " verse number 46,"
    },
    {
      "id": 120,
      "start": 439.20001220703125,
      "end": 443.20001220703125,
      "text": " I read it a moment ago, but notice it says, and Joseph was 30 years old"
    },
    {
      "id": 121,
      "start": 443.20001220703125,
      "end": 447.0400085449219,
      "text": " when he stood before Pharaoh, king of Egypt. It's interesting to me that in"
    },
    {
      "id": 122,
      "start": 447.0400085449219,
      "end": 451.20001220703125,
      "text": " this particular age, being 30 years old, he is elevated to a position of great"
    },
    {
      "id": 123,
      "start": 451.20001220703125,
      "end": 452.0400085449219,
      "text": " power,"
    },
    {
      "id": 124,
      "start": 452.0400085449219,
      "end": 456.760009765625,
      "text": " but also a great responsibility. I want you to think about the power that he has."
    },
    {
      "id": 125,
      "start": 456.760009765625,
      "end": 458.8800048828125,
      "text": " Only Pharaoh would have more power"
    },
    {
      "id": 126,
      "start": 458.8800048828125,
      "end": 462.32000732421875,
      "text": " over all the land of Egypt, but then I want you to think about the"
    },
    {
      "id": 127,
      "start": 462.32000732421875,
      "end": 464.0400085449219,
      "text": " responsibility"
    },
    {
      "id": 128,
      "start": 464.0400085449219,
      "end": 469.79998779296875,
      "text": " that would be entrusted to Joseph. I mean, a great deal of responsibility"
    },
    {
      "id": 129,
      "start": 469.79998779296875,
      "end": 474.0,
      "text": " is given to Joseph in placing him in this particular"
    },
    {
      "id": 130,
      "start": 474.0,
      "end": 478.3999938964844,
      "text": " position. I believe that as we look at this portion of Scripture, we begin to see"
    },
    {
      "id": 131,
      "start": 478.3999938964844,
      "end": 480.1199951171875,
      "text": " what's happening. Notice the Bible says"
    },
    {
      "id": 132,
      "start": 480.1199951171875,
      "end": 484.20001220703125,
      "text": " that Joseph, at the end of verse number 46, he went out from the presence of Pharaoh"
    },
    {
      "id": 133,
      "start": 484.20001220703125,
      "end": 488.6000061035156,
      "text": " and went throughout all the land of Egypt. The Bible says in verse 47, in the"
    },
    {
      "id": 134,
      "start": 488.6000061035156,
      "end": 489.20001220703125,
      "text": " seven"
    },
    {
      "id": 135,
      "start": 489.20001220703125,
      "end": 492.8399963378906,
      "text": " plenteous years, the earth brought forth by"
    },
    {
      "id": 136,
      "start": 492.8399963378906,
      "end": 497.8399963378906,
      "text": " handfuls. Now this is aligned with what Joseph said would happen when Joseph"
    },
    {
      "id": 137,
      "start": 497.8399963378906,
      "end": 499.2799987792969,
      "text": " gives the interpretation."
    },
    {
      "id": 138,
      "start": 499.2799987792969,
      "end": 503.0,
      "text": " He tells Pharaoh that there would be seven years of plenty"
    },
    {
      "id": 139,
      "start": 503.0799865722656,
      "end": 506.67999267578125,
      "text": " and we find that it's exactly what's taking place. The Bible says that during"
    },
    {
      "id": 140,
      "start": 506.67999267578125,
      "end": 507.760009765625,
      "text": " those plenteous years,"
    },
    {
      "id": 141,
      "start": 507.760009765625,
      "end": 510.8399963378906,
      "text": " the earth brought forth by handfuls."
    },
    {
      "id": 142,
      "start": 510.8399963378906,
      "end": 514.0,
      "text": " Notice in verse 48, and he gathered up"
    },
    {
      "id": 143,
      "start": 514.0,
      "end": 518.719970703125,
      "text": " all the food of the seven years, which were in the land of Egypt,"
    },
    {
      "id": 144,
      "start": 518.719970703125,
      "end": 521.760009765625,
      "text": " and laid up the food in the cities, the food of the field,"
    },
    {
      "id": 145,
      "start": 521.760009765625,
      "end": 524.7999877929688,
      "text": " which was round about every city, laid he"
    },
    {
      "id": 146,
      "start": 524.7999877929688,
      "end": 529.7999877929688,
      "text": " up in the same. And Joseph gathered corn as the sand of the sea very much until"
    },
    {
      "id": 147,
      "start": 529.7999877929688,
      "end": 530.5599975585938,
      "text": " he left"
    },
    {
      "id": 148,
      "start": 530.5599975585938,
      "end": 534.3200073242188,
      "text": " numbering, for it was without number."
    },
    {
      "id": 149,
      "start": 534.3200073242188,
      "end": 538.47998046875,
      "text": " Do you see the responsibility of this position that Joseph has?"
    },
    {
      "id": 150,
      "start": 538.47998046875,
      "end": 542.0800170898438,
      "text": " If we begin to think about the responsibility, no doubt having a"
    },
    {
      "id": 151,
      "start": 542.0800170898438,
      "end": 543.5599975585938,
      "text": " position like this"
    },
    {
      "id": 152,
      "start": 543.5599975585938,
      "end": 547.3200073242188,
      "text": " and having the power, but also having the responsibility"
    },
    {
      "id": 153,
      "start": 547.3200073242188,
      "end": 550.4400024414062,
      "text": " to gather up during these years of plenty,"
    },
    {
      "id": 154,
      "start": 550.4400024414062,
      "end": 554.719970703125,
      "text": " no doubt there would be some that would not be happy with Joseph with regard to"
    },
    {
      "id": 155,
      "start": 554.719970703125,
      "end": 558.0399780273438,
      "text": " that which he was doing. There would be certainly"
    },
    {
      "id": 156,
      "start": 558.0399780273438,
      "end": 561.239990234375,
      "text": " a number of people that he would have to"
    },
    {
      "id": 157,
      "start": 561.239990234375,
      "end": 566.0800170898438,
      "text": " delegate responsibility to, that he would have responsibility entrusted to"
    },
    {
      "id": 158,
      "start": 566.0800170898438,
      "end": 566.5599975585938,
      "text": " them."
    },
    {
      "id": 159,
      "start": 566.5599975585938,
      "end": 570.0,
      "text": " He had a great deal of responsibility laid"
    },
    {
      "id": 160,
      "start": 570.0,
      "end": 573.8800048828125,
      "text": " upon his shoulders, but I would submit to you this evening that God was"
    },
    {
      "id": 161,
      "start": 573.8800048828125,
      "end": 576.4400024414062,
      "text": " preparing Joseph for this very moment"
    },
    {
      "id": 162,
      "start": 576.4400024414062,
      "end": 580.719970703125,
      "text": " for years. The principle of preparation."
    },
    {
      "id": 163,
      "start": 580.719970703125,
      "end": 585.2000122070312,
      "text": " See, in Genesis chapter 37, we are first introduced to Joseph"
    },
    {
      "id": 164,
      "start": 585.239990234375,
      "end": 589.760009765625,
      "text": " when he is 17 years old. We don't know, we really don't know anything biblically"
    },
    {
      "id": 165,
      "start": 589.760009765625,
      "end": 590.47998046875,
      "text": " scriptural"
    },
    {
      "id": 166,
      "start": 590.47998046875,
      "end": 595.5999755859375,
      "text": " about Joseph's life prior to that event in Genesis 37 when he comes on the scene"
    },
    {
      "id": 167,
      "start": 595.5999755859375,
      "end": 596.760009765625,
      "text": " as a 17-year-old,"
    },
    {
      "id": 168,
      "start": 596.760009765625,
      "end": 600.0,
      "text": " but I want you to think about Joseph when he first comes on the scene at 17"
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 605.8400001525879,
      "text": " years old, it seems as if Joseph already at that point in his life had proven to"
    },
    {
      "id": 1,
      "start": 605.8400001525879,
      "end": 611.039999961853,
      "text": " be both faithful and trustworthy. Joseph was in a position, remember the Bible"
    },
    {
      "id": 2,
      "start": 611.039999961853,
      "end": 616.3999996185303,
      "text": " tells us that he brought back the evil report of his brothers. He understood the"
    },
    {
      "id": 3,
      "start": 616.3999996185303,
      "end": 621.5599994659424,
      "text": " difference between right and wrong, good and evil. Oh today we have people that"
    },
    {
      "id": 4,
      "start": 621.5599994659424,
      "end": 627.4799995422363,
      "text": " are much older than 17 that seem to not have any idea of morality and the"
    },
    {
      "id": 5,
      "start": 627.4799995422363,
      "end": 632.4799995422363,
      "text": " difference between right and wrong, good and evil. And we find that Joseph, he"
    },
    {
      "id": 6,
      "start": 632.4799995422363,
      "end": 637.2799987792969,
      "text": " observing their behavior, he knew of their evil report or their evil behavior"
    },
    {
      "id": 7,
      "start": 637.2799987792969,
      "end": 642.4799995422363,
      "text": " and he brought back that evil report. So as his brothers depart, we find that it's"
    },
    {
      "id": 8,
      "start": 642.4799995422363,
      "end": 647.1599998474121,
      "text": " Joseph who is given the responsibility to go see what your brothers are doing."
    },
    {
      "id": 9,
      "start": 647.1599998474121,
      "end": 651.3600006103516,
      "text": " Bring me word again. And we find that this is the responsibility that is"
    },
    {
      "id": 10,
      "start": 651.3600006103516,
      "end": 655.4799995422363,
      "text": " entrusted to him and at that point in his life we find that Joseph is"
    },
    {
      "id": 11,
      "start": 655.4799995422363,
      "end": 661.4000015258789,
      "text": " immediately obedient to what his father had instructed him to do. His dad calls"
    },
    {
      "id": 12,
      "start": 661.4000015258789,
      "end": 664.3199996948242,
      "text": " him and says here son here's what I want you to do. Now we already know that his"
    },
    {
      "id": 13,
      "start": 664.3199996948242,
      "end": 668.0,
      "text": " brothers didn't like him. His brothers were upset because of the dreams and all"
    },
    {
      "id": 14,
      "start": 668.0,
      "end": 672.2799987792969,
      "text": " that had taken place and his brothers are are not kind towards him. They could"
    },
    {
      "id": 15,
      "start": 672.2799987792969,
      "end": 678.4000015258789,
      "text": " not speak kindly to him and we find that here he goes out to find his brothers to"
    },
    {
      "id": 16,
      "start": 678.4000015258789,
      "end": 682.6399993896484,
      "text": " fulfill the responsibility that had been given to him from his father and it's"
    },
    {
      "id": 17,
      "start": 682.6399993896484,
      "end": 688.2799987792969,
      "text": " there where he's taken and put into a pit and eventually sold into slavery. We"
    },
    {
      "id": 18,
      "start": 688.2799987792969,
      "end": 695.8000030517578,
      "text": " find that he comes to Egypt and he's there in Egypt, 17 years old, about 17. We"
    },
    {
      "id": 19,
      "start": 695.8000030517578,
      "end": 698.6800003051758,
      "text": " find that's where we're introduced to him in Genesis 37. It seems as if all those"
    },
    {
      "id": 20,
      "start": 698.6800003051758,
      "end": 702.6800003051758,
      "text": " events take place pretty quickly and we come to Genesis chapter 39 and we find"
    },
    {
      "id": 21,
      "start": 702.6800003051758,
      "end": 708.3600006103516,
      "text": " that he's bought by one named Potiphar. And of course we find that Joseph"
    },
    {
      "id": 22,
      "start": 708.3600006103516,
      "end": 712.1999969482422,
      "text": " immediately when he comes into the place of being in Potiphar's house, he's"
    },
    {
      "id": 23,
      "start": 712.1999969482422,
      "end": 715.4800033569336,
      "text": " elevated to a position of responsibility and he has the"
    },
    {
      "id": 24,
      "start": 715.4800033569336,
      "end": 722.879997253418,
      "text": " responsibility to take care of, to be a minister there in the house of Potiphar"
    },
    {
      "id": 25,
      "start": 722.879997253418,
      "end": 731.2400054931641,
      "text": " to be a steward. God's preparing Joseph. God's preparing him and we find that"
    },
    {
      "id": 26,
      "start": 731.2400054931641,
      "end": 735.3999938964844,
      "text": " Joseph after a period of time being the steward in Potiphar's house, we know that"
    },
    {
      "id": 27,
      "start": 735.3999938964844,
      "end": 739.3999938964844,
      "text": " he's lied about and he's falsely accused and he finds himself in prison and guess"
    },
    {
      "id": 28,
      "start": 739.3999938964844,
      "end": 744.3200073242188,
      "text": " what God's doing in Joseph's life in prison? He's preparing him. He's preparing"
    },
    {
      "id": 29,
      "start": 744.3200073242188,
      "end": 750.4400024414062,
      "text": " him. So nearly 13 years, about 13 years have passed since Joseph has been in"
    },
    {
      "id": 30,
      "start": 750.4400024414062,
      "end": 757.2799987792969,
      "text": " Egypt and all along the way God is preparing Joseph. God does a work of"
    },
    {
      "id": 31,
      "start": 757.2799987792969,
      "end": 763.6000061035156,
      "text": " preparation in his servants. By the way I'm thankful for the work of preparation."
    },
    {
      "id": 32,
      "start": 763.6000061035156,
      "end": 768.8800048828125,
      "text": " I'm thankful for how God will lead and work in individuals lives and God has"
    },
    {
      "id": 33,
      "start": 768.8800048828125,
      "end": 774.7200012207031,
      "text": " particular purposes and wills for our lives and he desires that he would"
    },
    {
      "id": 34,
      "start": 774.7200012207031,
      "end": 780.3999938964844,
      "text": " prepare us for the task that he has for us to do. The problem is how do we deal"
    },
    {
      "id": 35,
      "start": 780.3999938964844,
      "end": 786.3999938964844,
      "text": " with the time of preparation? How do we handle that season of preparation when"
    },
    {
      "id": 36,
      "start": 786.3999938964844,
      "end": 791.8399963378906,
      "text": " God is shaping us and molding us and preparing us? Are we faithful? Are we"
    },
    {
      "id": 37,
      "start": 791.8399963378906,
      "end": 796.2799987792969,
      "text": " obedient to what God has called us to do so that we're learning what we're"
    },
    {
      "id": 38,
      "start": 796.2799987792969,
      "end": 800.6000061035156,
      "text": " supposed to learn? Because that principle of preparation is so important"
    },
    {
      "id": 39,
      "start": 800.6000061035156,
      "end": 804.8000030517578,
      "text": " in our lives, God is preparing us. I wonder tonight what is God preparing us"
    },
    {
      "id": 40,
      "start": 804.8000030517578,
      "end": 811.0,
      "text": " for? God has a plan and a purpose for you and your life and there are times in"
    },
    {
      "id": 41,
      "start": 811.0,
      "end": 816.6000061035156,
      "text": " which we have that opportunity even as Joseph did to go through a period of"
    },
    {
      "id": 42,
      "start": 816.6000061035156,
      "end": 822.7599945068359,
      "text": " preparation. And as Joseph would be entrusted with this great position of"
    },
    {
      "id": 43,
      "start": 822.7599945068359,
      "end": 827.3200073242188,
      "text": " not only power but great responsibility, we find that God had been preparing him"
    },
    {
      "id": 44,
      "start": 827.3200073242188,
      "end": 831.8800048828125,
      "text": " all along the way. Turn to the New Testament, if you will, the book of Luke. I"
    },
    {
      "id": 45,
      "start": 831.8800048828125,
      "end": 835.0800018310547,
      "text": " want to hold your place there in Genesis 41, but I want to show you two verses."
    },
    {
      "id": 46,
      "start": 835.0800018310547,
      "end": 838.0399932861328,
      "text": " You're familiar with the verses no doubt in the book of Luke, but I want you to"
    },
    {
      "id": 47,
      "start": 838.0399932861328,
      "end": 841.7599945068359,
      "text": " look at Luke 16 and then we'll look at a verse over in Luke 19. And I want you to"
    },
    {
      "id": 48,
      "start": 841.7599945068359,
      "end": 845.8200073242188,
      "text": " consider with me the time, the principle that we see here of preparation. I am"
    },
    {
      "id": 49,
      "start": 845.8200073242188,
      "end": 850.0399932861328,
      "text": " thankful that through the the overview that I just provided you with all along"
    },
    {
      "id": 50,
      "start": 850.0399932861328,
      "end": 856.3200073242188,
      "text": " the way in Joseph's life, we find that he was faithful. And because he was"
    },
    {
      "id": 51,
      "start": 856.3200073242188,
      "end": 862.3999938964844,
      "text": " faithful, God was molding him and God was shaping him and he was in a position"
    },
    {
      "id": 52,
      "start": 862.3999938964844,
      "end": 866.6400146484375,
      "text": " that when Pharaoh says, okay Joseph, you're the one, you're the one that's"
    },
    {
      "id": 53,
      "start": 866.6400146484375,
      "end": 871.7999877929688,
      "text": " going to be in this position, that Joseph was ready for the task that was given to"
    },
    {
      "id": 54,
      "start": 871.7999877929688,
      "end": 876.0,
      "text": " him. Notice in Luke chapter 16 and verse number 10, the Bible says, he that is"
    },
    {
      "id": 55,
      "start": 876.0,
      "end": 883.8399963378906,
      "text": " faithful in that which is least is faithful also in much. And he that is"
    },
    {
      "id": 56,
      "start": 883.8399963378906,
      "end": 892.0799865722656,
      "text": " unjust in the least is unjust also in much. You know, a good indicator of the"
    },
    {
      "id": 57,
      "start": 892.0799865722656,
      "end": 896.0799865722656,
      "text": " faithfulness of individuals is how do they handle the little things that are"
    },
    {
      "id": 58,
      "start": 896.0799865722656,
      "end": 900.2799987792969,
      "text": " entrusted to them. The things that people might say, well that's really not that"
    },
    {
      "id": 59,
      "start": 900.2799987792969,
      "end": 905.5,
      "text": " big of a deal, but no, it is a big deal. And we learn to be faithful in the"
    },
    {
      "id": 60,
      "start": 905.5,
      "end": 911.3800048828125,
      "text": " little things and God will entrust us with bigger things. God will give us that"
    },
    {
      "id": 61,
      "start": 911.3800048828125,
      "end": 915.8200073242188,
      "text": " responsibility. Why? Because he's preparing us even through those times."
    },
    {
      "id": 62,
      "start": 915.8200073242188,
      "end": 920.5799865722656,
      "text": " Joseph finds himself in Potiphar's house. What am I doing here? Why have I"
    },
    {
      "id": 63,
      "start": 920.5799865722656,
      "end": 924.7000122070312,
      "text": " been sold here? And God's preparing him and he's faithful and God is with him"
    },
    {
      "id": 64,
      "start": 924.7000122070312,
      "end": 929.6600036621094,
      "text": " and he's doing what he's supposed to be doing and he's the steward and he's so"
    },
    {
      "id": 65,
      "start": 929.6600036621094,
      "end": 936.9800109863281,
      "text": " able to do what God has given him to do that even the Potiphar, the ruler of the"
    },
    {
      "id": 66,
      "start": 936.9800109863281,
      "end": 941.8999938964844,
      "text": " home, he doesn't even know what's going on. He didn't trust at all to Joseph, the"
    },
    {
      "id": 67,
      "start": 941.8999938964844,
      "end": 947.3800048828125,
      "text": " prison guard. He does the same thing. Joseph is faithful in that which is"
    },
    {
      "id": 68,
      "start": 947.3800048828125,
      "end": 953.1000061035156,
      "text": " least and God gives him great responsibility. Notice in Luke chapter"
    },
    {
      "id": 69,
      "start": 953.1000061035156,
      "end": 959.8999938964844,
      "text": " 19 and verse number 17. Luke 19 and verse number 17, this is a passage, we"
    },
    {
      "id": 70,
      "start": 959.8999938964844,
      "end": 964.4599914550781,
      "text": " could really look at the entirety of it from verse 11 down through verse 27 of"
    },
    {
      "id": 71,
      "start": 964.4599914550781,
      "end": 968.8599853515625,
      "text": " the truth of being faithful, but I want to just draw your attention to verse 17"
    },
    {
      "id": 72,
      "start": 968.8599853515625,
      "end": 972.1400146484375,
      "text": " and we'll get back over to the book of Genesis. Notice it says here,"
    },
    {
      "id": 73,
      "start": 972.1400146484375,
      "end": 976.6199951171875,
      "text": " and he said unto him, well thou good servant, because thou hast been faithful"
    },
    {
      "id": 74,
      "start": 977.1400146484375,
      "end": 986.1400146484375,
      "text": " in very little, have thou authority over ten cities. Faithful over little. You"
    },
    {
      "id": 75,
      "start": 986.1400146484375,
      "end": 989.9400024414062,
      "text": " know what God's doing when he entrusts us with those little things? He's"
    },
    {
      "id": 76,
      "start": 989.9400024414062,
      "end": 995.4599914550781,
      "text": " preparing us. He's preparing us. And I don't know exactly what he's preparing"
    },
    {
      "id": 77,
      "start": 995.4599914550781,
      "end": 999.4599914550781,
      "text": " each and every one of us for, but it's very interesting how God works in the"
    },
    {
      "id": 78,
      "start": 999.4599914550781,
      "end": 1004.6600036621094,
      "text": " season of preparation. I'll use a personal illustration and when I was"
    },
    {
      "id": 79,
      "start": 1004.6600036621094,
      "end": 1007.3399963378906,
      "text": " working in the corporate world, I remember working in the corporate world"
    },
    {
      "id": 80,
      "start": 1007.3399963378906,
      "end": 1010.739990234375,
      "text": " for a number of years and I had studied. I knew that God called me to the"
    },
    {
      "id": 81,
      "start": 1010.739990234375,
      "end": 1014.9800109863281,
      "text": " ministry and I knew that that's what God wanted me to do. I was working in our"
    },
    {
      "id": 82,
      "start": 1014.9800109863281,
      "end": 1020.1000061035156,
      "text": " church doing all that the pastor would allow me to do with regard to ministry"
    },
    {
      "id": 83,
      "start": 1020.1000061035156,
      "end": 1025.0199890136719,
      "text": " and opportunities and things were going well there, but I knew God had called me"
    },
    {
      "id": 84,
      "start": 1025.0199890136719,
      "end": 1030.9800109863281,
      "text": " to pastor and I was working in the corporate world and honestly things were"
    },
    {
      "id": 85,
      "start": 1031.0199890136719,
      "end": 1034.8999938964844,
      "text": " going absolutely wonderful from a corporate perspective with regard to"
    },
    {
      "id": 86,
      "start": 1034.8999938964844,
      "end": 1038.5,
      "text": " promotions and all of those types of things, but I knew that's not where God"
    },
    {
      "id": 87,
      "start": 1038.5,
      "end": 1044.6600036621094,
      "text": " had me forever. I knew that God called me to the ministry. And yet during that time,"
    },
    {
      "id": 88,
      "start": 1044.6600036621094,
      "end": 1050.0199890136719,
      "text": " because of a principle that was taught to me by a spiritual mentor of"
    },
    {
      "id": 89,
      "start": 1050.0199890136719,
      "end": 1055.1799926757812,
      "text": " understanding that God is able to prepare us through every season of life,"
    },
    {
      "id": 90,
      "start": 1055.1799926757812,
      "end": 1061.5,
      "text": " that I determined that even while I was there, I was going to seek to be the best"
    },
    {
      "id": 91,
      "start": 1061.5,
      "end": 1066.5400085449219,
      "text": " that I could be for the Lord and learn what I could learn so that God could use"
    },
    {
      "id": 92,
      "start": 1066.5400085449219,
      "end": 1073.8200073242188,
      "text": " that time for whatever the future would be. And it's amazing to me, and I give all"
    },
    {
      "id": 93,
      "start": 1073.8200073242188,
      "end": 1078.6199951171875,
      "text": " the glory to God, it's amazing to me on the opportunities that the Lord allowed"
    },
    {
      "id": 94,
      "start": 1078.6199951171875,
      "end": 1085.0199890136719,
      "text": " me to have in the corporate world that have been such a blessing and a help"
    },
    {
      "id": 95,
      "start": 1085.0199890136719,
      "end": 1089.9800109863281,
      "text": " when it comes to pastoring. Things that they don't teach you in Bible college,"
    },
    {
      "id": 96,
      "start": 1089.9800109863281,
      "end": 1093.1799926757812,
      "text": " things that they don't teach you in seminary, things that you don't have any"
    },
    {
      "id": 97,
      "start": 1093.1799926757812,
      "end": 1098.2200012207031,
      "text": " classes on certain things, and the opportunity that I had in that"
    },
    {
      "id": 98,
      "start": 1098.2200012207031,
      "end": 1105.2999877929688,
      "text": " particular season of life in a time of preparation. And because of the influence"
    },
    {
      "id": 99,
      "start": 1105.2999877929688,
      "end": 1110.4200134277344,
      "text": " in my life that was given to me that, hey, I know that this is not where you're"
    },
    {
      "id": 100,
      "start": 1110.4200134277344,
      "end": 1114.0999755859375,
      "text": " going to be forever, I know that you believe God's called you to pastor, but"
    },
    {
      "id": 101,
      "start": 1114.1799926757812,
      "end": 1120.02001953125,
      "text": " in this place, learn what God has for you to learn. It's a season of preparation."
    },
    {
      "id": 102,
      "start": 1120.739990234375,
      "end": 1126.5800170898438,
      "text": " And how I thank God for how he prepared and the things that he taught me."
    },
    {
      "id": 103,
      "start": 1127.6199951171875,
      "end": 1133.5399780273438,
      "text": " As we look in the book of Genesis in chapter 41, I believe that here we see a principle"
    },
    {
      "id": 104,
      "start": 1133.5399780273438,
      "end": 1139.2999877929688,
      "text": " of preparation that Joseph, now at 30 years old, he is entrusted with this great position"
    },
    {
      "id": 105,
      "start": 1139.2999877929688,
      "end": 1146.1799926757812,
      "text": " and he has great responsibility, he has great power, but God had been preparing him all along."
    },
    {
      "id": 106,
      "start": 1146.1799926757812,
      "end": 1149.780029296875,
      "text": " It's not as if Joseph just, bam, you're going to be second in command. No, there was"
    },
    {
      "id": 107,
      "start": 1151.219970703125,
      "end": 1158.3400268554688,
      "text": " he was 17 when he first there is introduced to us in Genesis 37. So 13 years of preparation"
    },
    {
      "id": 108,
      "start": 1158.97998046875,
      "end": 1164.9000244140625,
      "text": " before he goes to the place, the position that we read of him having here. By the way,"
    },
    {
      "id": 109,
      "start": 1164.9000244140625,
      "end": 1169.3800048828125,
      "text": " I think that if Joseph could stand here and give testimony, he'd be able to tell us that"
    },
    {
      "id": 110,
      "start": 1169.3800048828125,
      "end": 1177.0599975585938,
      "text": " through those 13 years, God was preparing him for the task that was at hand. And what a blessing."
    },
    {
      "id": 111,
      "start": 1177.0599975585938,
      "end": 1181.2999877929688,
      "text": " I see another principle in our text of scripture, not only a principle of preparation,"
    },
    {
      "id": 112,
      "start": 1181.2999877929688,
      "end": 1187.0599975585938,
      "text": " but I see the principle of perspective. Perspective. You know, everyone has a different"
    },
    {
      "id": 113,
      "start": 1187.0599975585938,
      "end": 1191.9400024414062,
      "text": " perspective in life. Everyone has a different perspective when it comes to circumstances"
    },
    {
      "id": 114,
      "start": 1191.9400024414062,
      "end": 1197.2999877929688,
      "text": " and events that take place in our lives, even in the lives of others. And we begin to"
    },
    {
      "id": 115,
      "start": 1197.2999877929688,
      "end": 1199.9400024414062,
      "text": " look here and we find even as I've mentioned for the time..."
    },
    {
      "id": 0,
      "start": 1199.9400024414062,
      "end": 1204.660002231598,
      "text": " title of the message this evening, Fruitful in the Land of Affliction, we find that here"
    },
    {
      "id": 1,
      "start": 1204.660002231598,
      "end": 1210.0200023651123,
      "text": " God gives us some glimpse with regard to the principle of perspective. I believe that it's"
    },
    {
      "id": 2,
      "start": 1210.0200023651123,
      "end": 1214.8400020599365,
      "text": " revealed to us Joseph, as I mentioned by way of introduction, had been given an Egyptian"
    },
    {
      "id": 3,
      "start": 1214.8400020599365,
      "end": 1220.1400032043457,
      "text": " name and he had been given an Egyptian bride, yet when his two sons are born he gives them"
    },
    {
      "id": 4,
      "start": 1220.1400032043457,
      "end": 1228.1000022888184,
      "text": " Hebrew names. And in giving them Hebrew names and understanding the meaning of the names,"
    },
    {
      "id": 5,
      "start": 1228.1000022888184,
      "end": 1235.5800018310547,
      "text": " we find that it helps us to be able to learn about Joseph's perspective. What is his perspective"
    },
    {
      "id": 6,
      "start": 1235.5800018310547,
      "end": 1239.8600006103516,
      "text": " with all that he's dealt with, with all that he's endured? The Bible tells us in verse"
    },
    {
      "id": 7,
      "start": 1239.8600006103516,
      "end": 1246.180004119873,
      "text": " number 50, and unto Joseph were born two sons before the years of famine came. So in those"
    },
    {
      "id": 8,
      "start": 1246.180004119873,
      "end": 1252.2000007629395,
      "text": " first seven years of plenty, we find that Joseph was blessed by the Lord to have two"
    },
    {
      "id": 9,
      "start": 1252.2000007629395,
      "end": 1258.46000289917,
      "text": " sons, it says, which Asenath, the daughter of Potipharah, priest of On, bear unto him."
    },
    {
      "id": 10,
      "start": 1258.46000289917,
      "end": 1263.7600021362305,
      "text": " And Joseph called the name of the firstborn Manasseh. Notice what he says when we see"
    },
    {
      "id": 11,
      "start": 1263.7600021362305,
      "end": 1270.8000030517578,
      "text": " the firstborn that is named here, Manasseh, the name means forgetfulness. It means to"
    },
    {
      "id": 12,
      "start": 1270.8000030517578,
      "end": 1275.7200012207031,
      "text": " forget. Now it doesn't mean to forget like you forgot what was on your grocery list."
    },
    {
      "id": 13,
      "start": 1275.7200012207031,
      "end": 1279.2799987792969,
      "text": " Alright, how many of you ever forget what's on your grocery list? You understand what"
    },
    {
      "id": 14,
      "start": 1279.2799987792969,
      "end": 1283.3800048828125,
      "text": " I'm saying? And we got so many tools that help us to remember things and yet we seem"
    },
    {
      "id": 15,
      "start": 1283.3800048828125,
      "end": 1287.6399993896484,
      "text": " to forget things. And I have the opposite problem with a grocery list. I add things"
    },
    {
      "id": 16,
      "start": 1287.6399993896484,
      "end": 1291.3600006103516,
      "text": " to it. I go down the cookie aisle and I'm like, oh yeah, we need those cookies and we"
    },
    {
      "id": 17,
      "start": 1291.3600006103516,
      "end": 1295.9800033569336,
      "text": " need ice cream. And Holly says that wasn't on the list, but it just got in the cart somehow,"
    },
    {
      "id": 18,
      "start": 1295.9800033569336,
      "end": 1301.120002746582,
      "text": " you understand. But that's not what it means when we're talking about forgetfulness. It's"
    },
    {
      "id": 19,
      "start": 1301.120002746582,
      "end": 1307.2799987792969,
      "text": " this purpose of forgetting, this intentional forgetting something. Notice what he says,"
    },
    {
      "id": 20,
      "start": 1307.2799987792969,
      "end": 1317.0800018310547,
      "text": " For God, said he, hath made me forget all my toil, and all my father's house. Now I"
    },
    {
      "id": 21,
      "start": 1317.0800018310547,
      "end": 1321.8400039672852,
      "text": " don't believe that he's meaning all of the positive things and the good things because"
    },
    {
      "id": 22,
      "start": 1321.8400039672852,
      "end": 1326.0800018310547,
      "text": " obviously there's some good things that he learned. He learned about Jehovah God. We"
    },
    {
      "id": 23,
      "start": 1326.0800018310547,
      "end": 1330.9600067138672,
      "text": " find that even in giving his testimony and standing before Pharaoh and standing before"
    },
    {
      "id": 24,
      "start": 1330.9600067138672,
      "end": 1336.9199981689453,
      "text": " his brothers as we go through the remainder of Genesis, we find that he continues to give"
    },
    {
      "id": 25,
      "start": 1336.9199981689453,
      "end": 1344.4400024414062,
      "text": " glory to God. He did not forget the God of his father. He did not forget those truths"
    },
    {
      "id": 26,
      "start": 1344.4400024414062,
      "end": 1351.1600036621094,
      "text": " that he was given. But I want you to understand that Joseph is saying that this idea of forgetfulness,"
    },
    {
      "id": 27,
      "start": 1351.1600036621094,
      "end": 1354.3200073242188,
      "text": " that God made me to forget all my toil and my father's house. You know there were a lot"
    },
    {
      "id": 28,
      "start": 1354.3200073242188,
      "end": 1365.6800079345703,
      "text": " of bad things that happened to Joseph. Right? We've studied them. Hated by your brothers."
    },
    {
      "id": 29,
      "start": 1365.6800079345703,
      "end": 1371.0800018310547,
      "text": " I mean to the point where they can't even speak kindly to you. This is a hatred at a"
    },
    {
      "id": 30,
      "start": 1371.0800018310547,
      "end": 1375.8800048828125,
      "text": " whole nother level. We think about the selling into slavery. I mean they were going to kill"
    },
    {
      "id": 31,
      "start": 1375.8800048828125,
      "end": 1379.4600067138672,
      "text": " him and then they decided no let's not kill him because we can actually get some money"
    },
    {
      "id": 32,
      "start": 1379.4600067138672,
      "end": 1384.520004272461,
      "text": " for him so why don't we sell him into slavery. And even as they had determined that they're"
    },
    {
      "id": 33,
      "start": 1384.520004272461,
      "end": 1388.9199981689453,
      "text": " going to put him in that pit so they could kill him, they're sitting there eating. I"
    },
    {
      "id": 34,
      "start": 1388.9199981689453,
      "end": 1393.6399993896484,
      "text": " mean they have no care or concern whatsoever. And here's the thought tonight when we think"
    },
    {
      "id": 35,
      "start": 1393.6399993896484,
      "end": 1400.8399963378906,
      "text": " about the principle of perspective. The negatives that are in our past, they must not rob us"
    },
    {
      "id": 36,
      "start": 1400.8399963378906,
      "end": 1406.0400085449219,
      "text": " of our opportunity for today. See there are some negatives in each of our lives. There"
    },
    {
      "id": 37,
      "start": 1406.0400085449219,
      "end": 1410.2799987792969,
      "text": " are some negatives in Joseph's life. There were some things that happened to him that"
    },
    {
      "id": 38,
      "start": 1410.2799987792969,
      "end": 1414.8800048828125,
      "text": " if he determined that that was going to be the focus of his attention, if every day of"
    },
    {
      "id": 39,
      "start": 1414.8800048828125,
      "end": 1419.4000091552734,
      "text": " his life he was going to just focus upon the fact that my brothers did me wrong, that my"
    },
    {
      "id": 40,
      "start": 1419.4000091552734,
      "end": 1424.6800079345703,
      "text": " brothers did this and my brothers did that and this is not fair and this is not right,"
    },
    {
      "id": 41,
      "start": 1424.6800079345703,
      "end": 1431.8000030517578,
      "text": " Joseph would not be second in command. He had to forget that stuff because those negatives"
    },
    {
      "id": 42,
      "start": 1431.8000030517578,
      "end": 1438.6800079345703,
      "text": " would hinder Joseph from being able to do what God had for him to do. I want you to"
    },
    {
      "id": 43,
      "start": 1438.6800079345703,
      "end": 1441.3200073242188,
      "text": " think about the principle. Turn to the book of Philippians if you will. Again hold your"
    },
    {
      "id": 44,
      "start": 1441.3200073242188,
      "end": 1445.2799987792969,
      "text": " spot here in Genesis but turn to the book of Philippians and I want you to look at Philippians"
    },
    {
      "id": 45,
      "start": 1445.2799987792969,
      "end": 1450.5599975585938,
      "text": " chapter number 3. I want you to think about what Paul says in this portion of scripture"
    },
    {
      "id": 46,
      "start": 1450.5599975585938,
      "end": 1454.7200012207031,
      "text": " and there's so much rich truth in Philippians chapter number 3. I wish we could study all"
    },
    {
      "id": 47,
      "start": 1454.7200012207031,
      "end": 1460.2200012207031,
      "text": " of it this evening but I want to draw your attention to some things that Paul says with"
    },
    {
      "id": 48,
      "start": 1460.2200012207031,
      "end": 1466.2799987792969,
      "text": " regard to even what we find here in the life of Joseph in Genesis chapter 41 when he names"
    },
    {
      "id": 49,
      "start": 1466.2799987792969,
      "end": 1473.760009765625,
      "text": " his firstborn Manasseh, the idea of forgetfulness. Notice that Paul says this in verse number"
    },
    {
      "id": 50,
      "start": 1473.760009765625,
      "end": 1477.760009765625,
      "text": " 10, I'll start there, that I may know him and the power of his resurrection, the fellowship"
    },
    {
      "id": 51,
      "start": 1477.760009765625,
      "end": 1483.9599914550781,
      "text": " of his sufferings being made conformable unto his death. So he reveals to us his desire"
    },
    {
      "id": 52,
      "start": 1483.9599914550781,
      "end": 1489.2000122070312,
      "text": " to know the Lord in a very intimate way, not just knowing about God but knowing him personally"
    },
    {
      "id": 53,
      "start": 1489.2000122070312,
      "end": 1494.7999877929688,
      "text": " and intimately. If by any means I might attain unto the resurrection of the dead, not as"
    },
    {
      "id": 54,
      "start": 1494.7999877929688,
      "end": 1500.3200073242188,
      "text": " though I had already attained, either were already perfect, but I follow after, if then"
    },
    {
      "id": 55,
      "start": 1500.3200073242188,
      "end": 1506.3200073242188,
      "text": " I may apprehend that for which also I am apprehended of Christ Jesus. And then notice"
    },
    {
      "id": 56,
      "start": 1506.3200073242188,
      "end": 1514.1199951171875,
      "text": " verse 13, brethren, I count not myself to have apprehended. But this one thing I do,"
    },
    {
      "id": 57,
      "start": 1514.1199951171875,
      "end": 1520.6400146484375,
      "text": " forgetting those things which are behind, and reaching forth unto those things which"
    },
    {
      "id": 58,
      "start": 1520.6400146484375,
      "end": 1527.3200073242188,
      "text": " are before, I press toward the mark for the prize of the high calling of God in Christ"
    },
    {
      "id": 59,
      "start": 1527.3200073242188,
      "end": 1531.6000061035156,
      "text": " Jesus. You know, there are a lot of people today that are crippled because of the things"
    },
    {
      "id": 60,
      "start": 1531.6000061035156,
      "end": 1540.5599975585938,
      "text": " that happened to them in the past. They're crippled, figuratively speaking, because of"
    },
    {
      "id": 61,
      "start": 1540.5599975585938,
      "end": 1545.9599914550781,
      "text": " the things that happened to them in the past. They've not forgotten them. They're holding"
    },
    {
      "id": 62,
      "start": 1545.9599914550781,
      "end": 1553.3600158691406,
      "text": " on to them. They're bothered by them. The Bible teaches in the book of Hebrews the danger"
    },
    {
      "id": 63,
      "start": 1553.3600158691406,
      "end": 1560.0199890136719,
      "text": " of a root of bitterness. You know what often happens when we cannot forget those negatives"
    },
    {
      "id": 64,
      "start": 1560.0199890136719,
      "end": 1571.0599975585938,
      "text": " in the past is we get bitter. We get bitter. And bitterness will absolutely destroy you."
    },
    {
      "id": 65,
      "start": 1571.0599975585938,
      "end": 1577.8999938964844,
      "text": " It will destroy you. Someone said bitterness will destroy the vessel in which it's stored"
    },
    {
      "id": 66,
      "start": 1577.8999938964844,
      "end": 1587.8999938964844,
      "text": " more than the vessel in which it's poured. Bitterness will destroy you. Joseph could"
    },
    {
      "id": 67,
      "start": 1587.8999938964844,
      "end": 1594.4599914550781,
      "text": " have been bitter over the things that happened in his life, over the treatment that he experienced."
    },
    {
      "id": 68,
      "start": 1594.4599914550781,
      "end": 1603.5400085449219,
      "text": " I've only focused on his brothers, but think about Mrs. Potiphar as she lied and had him"
    },
    {
      "id": 69,
      "start": 1603.5400085449219,
      "end": 1611.2999877929688,
      "text": " imprisoned. I mean, you think about Joseph coming into Egypt and all the events that"
    },
    {
      "id": 70,
      "start": 1611.2999877929688,
      "end": 1614.9400024414062,
      "text": " happened to lead him there. And then he's in the house of Potiphar. And I mean, even"
    },
    {
      "id": 71,
      "start": 1614.9400024414062,
      "end": 1619.7000122070312,
      "text": " though he's purchased as a slave, I mean, he's pretty successful and he's become the"
    },
    {
      "id": 72,
      "start": 1619.7000122070312,
      "end": 1623.2999877929688,
      "text": " steward of the house and things are going well. But then Mrs. Potiphar lies about him"
    },
    {
      "id": 73,
      "start": 1623.2999877929688,
      "end": 1628.9800109863281,
      "text": " and he finds himself in prison. Man, there's some things that he could get bitter about."
    },
    {
      "id": 74,
      "start": 1629.7000122070312,
      "end": 1637.0199890136719,
      "text": " Listen, be careful about bitterness. Many people today are crippled because of things"
    },
    {
      "id": 75,
      "start": 1637.0199890136719,
      "end": 1642.5599975585938,
      "text": " that happened in their past. They just can't get over them. Can I say this? Be careful"
    },
    {
      "id": 76,
      "start": 1642.5599975585938,
      "end": 1652.3399963378906,
      "text": " about psychologists and psychiatrists. I'm not either one. Anytime I'm asked to give"
    },
    {
      "id": 77,
      "start": 1652.3399963378906,
      "end": 1658.9599914550781,
      "text": " counsel, I seek to give biblical counsel and I do it often. However, I would say this."
    },
    {
      "id": 78,
      "start": 1658.9599914550781,
      "end": 1666.1199951171875,
      "text": " Sometimes they just want to dig up things in the past and never really resolve them."
    },
    {
      "id": 79,
      "start": 1666.1199951171875,
      "end": 1671.0400085449219,
      "text": " Never really resolve them. And it can become very dangerous. And what I'm saying to you"
    },
    {
      "id": 80,
      "start": 1671.0400085449219,
      "end": 1674.6799926757812,
      "text": " this evening is that when we look at this principle of perspective, where's your focus"
    },
    {
      "id": 81,
      "start": 1674.6799926757812,
      "end": 1679.9599914550781,
      "text": " tonight? What are we focused on? If we just want to focus on the hurt and the harm and"
    },
    {
      "id": 82,
      "start": 1679.9599914550781,
      "end": 1685.5199890136719,
      "text": " the bad things that happened to us in our past, it will cripple you from doing today"
    },
    {
      "id": 83,
      "start": 1685.6799926757812,
      "end": 1692.3999938964844,
      "text": " what God has for you to do today. We can't live in the past. We can't change the past."
    },
    {
      "id": 84,
      "start": 1692.3999938964844,
      "end": 1696.5199890136719,
      "text": " It doesn't matter how angry we are. It doesn't matter how bitter we are about the things"
    },
    {
      "id": 85,
      "start": 1696.5199890136719,
      "end": 1703.5199890136719,
      "text": " that happened to us. We cannot change them. Amen? You can't. You can't change them."
    },
    {
      "id": 86,
      "start": 1703.5199890136719,
      "end": 1713.8400268554688,
      "text": " As we see the firstborn son, Joseph called his name Manasseh. Forgetfulness. For God"
    },
    {
      "id": 87,
      "start": 1713.8400268554688,
      "end": 1721.0800170898438,
      "text": " said he hath made me forget all my toil and all my father's house. I believe it's because"
    },
    {
      "id": 88,
      "start": 1721.0800170898438,
      "end": 1726.9400024414062,
      "text": " of the name of the firstborn that we're able to read of the secondborn. I believe it's"
    },
    {
      "id": 89,
      "start": 1726.9400024414062,
      "end": 1730.7200317382812,
      "text": " because of the perspective that I'm going to forget those things, the negatives, and"
    },
    {
      "id": 90,
      "start": 1730.7200317382812,
      "end": 1737.1599731445312,
      "text": " I'm not going to let those hinder me from doing what God has for me. I find that in"
    },
    {
      "id": 91,
      "start": 1737.1599731445312,
      "end": 1743.6799926757812,
      "text": " the 52nd verse we're told about the secondborn and it says here that he, the name of the"
    },
    {
      "id": 92,
      "start": 1743.6799926757812,
      "end": 1755.6400146484375,
      "text": " second, called he Ephraim. For God hath caused me to be fruitful in the land of my affliction."
    },
    {
      "id": 93,
      "start": 1755.6400146484375,
      "end": 1764.1199951171875,
      "text": " I mean, what a perspective that Joseph has. Listen, he calls it what it is. It's a land"
    },
    {
      "id": 94,
      "start": 1764.1199951171875,
      "end": 1769.280029296875,
      "text": " of affliction. We don't have to sugarcoat things. We can call them what they are, but"
    },
    {
      "id": 95,
      "start": 1769.280029296875,
      "end": 1773.4400024414062,
      "text": " the reality is that even in the midst of what looks like and as we would look at this"
    },
    {
      "id": 96,
      "start": 1773.47998046875,
      "end": 1777.8800048828125,
      "text": " portion of scripture and look at all of the events in the life of Joseph, we could say"
    },
    {
      "id": 97,
      "start": 1777.8800048828125,
      "end": 1782.6799926757812,
      "text": " yeah that's a land of affliction, but he says, but God made me to be fruitful. And so Ephraim"
    },
    {
      "id": 98,
      "start": 1782.6799926757812,
      "end": 1788.280029296875,
      "text": " means fruitfulness. It means fruitfulness. God hath caused him to be fruitful in the"
    },
    {
      "id": 99,
      "start": 1788.280029296875,
      "end": 1792.0800170898438,
      "text": " land of his affliction. And I want you to think about being fruitful. God has called"
    },
    {
      "id": 100,
      "start": 1792.0800170898438,
      "end": 1798.6799926757812,
      "text": " us to be fruitful. Has he not? Turn to the book of John, if you will, John chapter number"
    },
    {
      "id": 101,
      "start": 1798.6799926757812,
      "end": 1800.0399780273438,
      "text": " 15, and I want you to look."
    },
    {
      "id": 0,
      "start": 1800.0399780273438,
      "end": 1805.8799781799316,
      "text": " here at the truth of this idea of us as God's people being fruitful people."
    },
    {
      "id": 1,
      "start": 1805.8799781799316,
      "end": 1812.1199779510498,
      "text": " We find here that Joseph says, God hath made me, he hath caused me to be fruitful in the"
    },
    {
      "id": 2,
      "start": 1812.1199779510498,
      "end": 1816.3999786376953,
      "text": " land of my affliction."
    },
    {
      "id": 3,
      "start": 1816.3999786376953,
      "end": 1821.8799781799316,
      "text": " What enabled Joseph to be fruitful in the land of his affliction was his perspective"
    },
    {
      "id": 4,
      "start": 1821.8799781799316,
      "end": 1826.9999771118164,
      "text": " on understanding, as we looked at that firstborn son Manasseh, that forgetfulness."
    },
    {
      "id": 5,
      "start": 1827.6799774169922,
      "end": 1832.1599769592285,
      "text": " Man, if he just focused and just stayed on all of that and just determined that's where"
    },
    {
      "id": 6,
      "start": 1832.1599769592285,
      "end": 1836.5599784851074,
      "text": " he was going to live, he would not be fruitful."
    },
    {
      "id": 7,
      "start": 1836.5599784851074,
      "end": 1842.459976196289,
      "text": " John 15, notice in verse number one, I am the true vine, Jesus is speaking."
    },
    {
      "id": 8,
      "start": 1842.459976196289,
      "end": 1845.7599792480469,
      "text": " My father is the husbandman."
    },
    {
      "id": 9,
      "start": 1845.7599792480469,
      "end": 1852.2799797058105,
      "text": " Often Jesus would use illustrations and analogies that people could easily relate to."
    },
    {
      "id": 10,
      "start": 1852.2799797058105,
      "end": 1860.359977722168,
      "text": " And here he's using this very familiar teaching and truth with regard to agriculture, if you"
    },
    {
      "id": 11,
      "start": 1860.359977722168,
      "end": 1861.359977722168,
      "text": " will."
    },
    {
      "id": 12,
      "start": 1861.359977722168,
      "end": 1864.8799743652344,
      "text": " And he says, I am the true vine, and my father is the husbandman."
    },
    {
      "id": 13,
      "start": 1864.8799743652344,
      "end": 1870.1599807739258,
      "text": " Every branch in me that beareth not fruit, he taketh away."
    },
    {
      "id": 14,
      "start": 1870.1599807739258,
      "end": 1876.579978942871,
      "text": " And every branch that beareth fruit, he purgeth it, that it may bring forth more fruit."
    },
    {
      "id": 15,
      "start": 1876.579978942871,
      "end": 1881.359977722168,
      "text": " So who are the branches that are in Jesus?"
    },
    {
      "id": 16,
      "start": 1881.359977722168,
      "end": 1885.5199813842773,
      "text": " We are, Christians, disciples, followers of Christ."
    },
    {
      "id": 17,
      "start": 1885.5199813842773,
      "end": 1886.5199813842773,
      "text": " Do you track?"
    },
    {
      "id": 18,
      "start": 1886.5199813842773,
      "end": 1887.5199813842773,
      "text": " You see what's going on?"
    },
    {
      "id": 19,
      "start": 1887.5199813842773,
      "end": 1889.7199783325195,
      "text": " Listen, he is the true vine."
    },
    {
      "id": 20,
      "start": 1889.7199783325195,
      "end": 1894.6399765014648,
      "text": " He'll say in just a little while, I am the vine, ye are the branches."
    },
    {
      "id": 21,
      "start": 1894.6399765014648,
      "end": 1899.5599746704102,
      "text": " And he says here, every branch in me, and so we know that we are the branches if we've"
    },
    {
      "id": 22,
      "start": 1899.5599746704102,
      "end": 1903.359977722168,
      "text": " trusted Jesus Christ as our personal Savior, we are the branches."
    },
    {
      "id": 23,
      "start": 1903.359977722168,
      "end": 1911.3199768066406,
      "text": " And he says, every branch in me that beareth not fruit, he taketh away."
    },
    {
      "id": 24,
      "start": 1911.3199768066406,
      "end": 1916.0399780273438,
      "text": " That's a little bit scary."
    },
    {
      "id": 25,
      "start": 1916.0399780273438,
      "end": 1917.0399780273438,
      "text": " You know why?"
    },
    {
      "id": 26,
      "start": 1917.0399780273438,
      "end": 1920.359977722168,
      "text": " Because God's purpose is that we'd be fruitful."
    },
    {
      "id": 27,
      "start": 1920.359977722168,
      "end": 1924.7999801635742,
      "text": " What good is a fruit tree if it doesn't produce fruit?"
    },
    {
      "id": 28,
      "start": 1924.7999801635742,
      "end": 1925.7999801635742,
      "text": " They would understand this."
    },
    {
      "id": 29,
      "start": 1925.7999801635742,
      "end": 1928.8399810791016,
      "text": " You've got a fig tree, and it doesn't produce figs."
    },
    {
      "id": 30,
      "start": 1928.8399810791016,
      "end": 1931.719970703125,
      "text": " How long are you going to keep the fig tree around?"
    },
    {
      "id": 31,
      "start": 1931.719970703125,
      "end": 1935.4399719238281,
      "text": " Three years, four years, 14 years, 22 years, no, eventually you're going to cut that thing"
    },
    {
      "id": 32,
      "start": 1935.4399719238281,
      "end": 1940.5199737548828,
      "text": " down and you're going to plant something else because it's not producing fruit, correct?"
    },
    {
      "id": 33,
      "start": 1940.719970703125,
      "end": 1949.2799835205078,
      "text": " And the Bible says here, and every branch that beareth fruit, notice it says he purgeth"
    },
    {
      "id": 34,
      "start": 1949.2799835205078,
      "end": 1950.2799835205078,
      "text": " it."
    },
    {
      "id": 35,
      "start": 1950.2799835205078,
      "end": 1957.0399780273438,
      "text": " Now, I'm not an arborist, I'm not an agricultural guru, but I understand, I've done some study"
    },
    {
      "id": 36,
      "start": 1957.0399780273438,
      "end": 1962.6799774169922,
      "text": " and I understand the picture that Jesus is giving, and I understand the purpose of pruning."
    },
    {
      "id": 37,
      "start": 1962.6799774169922,
      "end": 1964.1199798583984,
      "text": " You know what happens when you prune?"
    },
    {
      "id": 38,
      "start": 1964.1199798583984,
      "end": 1967.239974975586,
      "text": " You get more fruit."
    },
    {
      "id": 39,
      "start": 1967.239974975586,
      "end": 1971.9199829101562,
      "text": " You've got to cut it back, and when it grows, it produces more fruit."
    },
    {
      "id": 40,
      "start": 1971.9199829101562,
      "end": 1975.4399719238281,
      "text": " I pruned these crape myrtles out here a couple of years ago, and some of you are ready to"
    },
    {
      "id": 41,
      "start": 1975.4399719238281,
      "end": 1976.4399719238281,
      "text": " kill me."
    },
    {
      "id": 42,
      "start": 1976.4399719238281,
      "end": 1977.8399810791016,
      "text": " Pastor, you killed the trees."
    },
    {
      "id": 43,
      "start": 1977.8399810791016,
      "end": 1982.5999755859375,
      "text": " No, no, I did some research and I did it how they said to do it."
    },
    {
      "id": 44,
      "start": 1982.5999755859375,
      "end": 1987.7599792480469,
      "text": " I'm not an arborist, but we didn't pay somebody to do it, and I just chopped them things up,"
    },
    {
      "id": 45,
      "start": 1987.7599792480469,
      "end": 1988.7599792480469,
      "text": " man."
    },
    {
      "id": 46,
      "start": 1988.7599792480469,
      "end": 1989.7599792480469,
      "text": " You know what, Tim?"
    },
    {
      "id": 47,
      "start": 1989.7599792480469,
      "end": 1991.8399810791016,
      "text": " They came back and they were beautiful."
    },
    {
      "id": 48,
      "start": 1991.8399810791016,
      "end": 1995.999984741211,
      "text": " I mean, they just blossomed and flourished."
    },
    {
      "id": 49,
      "start": 1995.999984741211,
      "end": 2002.1999816894531,
      "text": " Here he says, that every branch that bear fruit, he purgeth it, that it may bring forth."
    },
    {
      "id": 50,
      "start": 2002.1999816894531,
      "end": 2005.7599792480469,
      "text": " Notice what it says, more fruit."
    },
    {
      "id": 51,
      "start": 2005.7599792480469,
      "end": 2009.2799835205078,
      "text": " Verse 3, now you're clean through the word which I have spoken unto you."
    },
    {
      "id": 52,
      "start": 2009.2799835205078,
      "end": 2014.7999725341797,
      "text": " You can look at that in Ephesians 5 and 26 and see the ministry of God's word and cleansing."
    },
    {
      "id": 53,
      "start": 2014.7999725341797,
      "end": 2022.4399719238281,
      "text": " Notice verse 4, abide in me and I in you, as the branch cannot bear fruit of itself"
    },
    {
      "id": 54,
      "start": 2022.4399719238281,
      "end": 2024.8799743652344,
      "text": " except it abide in the vine."
    },
    {
      "id": 55,
      "start": 2024.8799743652344,
      "end": 2028.6799774169922,
      "text": " No more can ye except ye abide in me."
    },
    {
      "id": 56,
      "start": 2028.6799774169922,
      "end": 2032.3199768066406,
      "text": " The principle of abiding is so critical."
    },
    {
      "id": 57,
      "start": 2032.3199768066406,
      "end": 2037.6799774169922,
      "text": " He says, abide in me and I in you, as the branch cannot bear fruit of itself."
    },
    {
      "id": 58,
      "start": 2037.6799774169922,
      "end": 2040.0399780273438,
      "text": " We know this."
    },
    {
      "id": 59,
      "start": 2040.0399780273438,
      "end": 2045.1999816894531,
      "text": " When Holly first got home from down in North Carolina, the first time when she was here"
    },
    {
      "id": 60,
      "start": 2045.1999816894531,
      "end": 2050.6399841308594,
      "text": " for the scripture assembly, she arrived home and I had some roses waiting for her."
    },
    {
      "id": 61,
      "start": 2050.6399841308594,
      "end": 2051.6399841308594,
      "text": " Amen?"
    },
    {
      "id": 62,
      "start": 2051.6399841308594,
      "end": 2054.1199798583984,
      "text": " All you husbands take notes and write things down."
    },
    {
      "id": 63,
      "start": 2054.3599853515625,
      "end": 2057.439971923828,
      "text": " I had some roses, I had a card and I had some chocolate."
    },
    {
      "id": 64,
      "start": 2057.439971923828,
      "end": 2060.519989013672,
      "text": " I tried to cover all those boxes, amen?"
    },
    {
      "id": 65,
      "start": 2060.519989013672,
      "end": 2064.999969482422,
      "text": " And I had it there waiting for her and then she was going to leave to go back to North"
    },
    {
      "id": 66,
      "start": 2064.999969482422,
      "end": 2070.439971923828,
      "text": " Carolina and those roses got put down and guess what happened to those roses?"
    },
    {
      "id": 67,
      "start": 2070.439971923828,
      "end": 2071.439971923828,
      "text": " They died."
    },
    {
      "id": 68,
      "start": 2071.439971923828,
      "end": 2072.439971923828,
      "text": " Why?"
    },
    {
      "id": 69,
      "start": 2072.439971923828,
      "end": 2074.239990234375,
      "text": " Because they were cut from the vine."
    },
    {
      "id": 70,
      "start": 2074.239990234375,
      "end": 2079.999969482422,
      "text": " I mean, they were beautiful and then they died."
    },
    {
      "id": 71,
      "start": 2079.999969482422,
      "end": 2085.239990234375,
      "text": " And I noticed that before she got home, I was going to have to deal with those roses"
    },
    {
      "id": 72,
      "start": 2085.239990234375,
      "end": 2092.719970703125,
      "text": " and I didn't deal with them on the Monday and then Tuesday I said, I got to take care"
    },
    {
      "id": 73,
      "start": 2092.719970703125,
      "end": 2096.5999755859375,
      "text": " of that but I had some other things going on and I just kind of left it there and Wednesday"
    },
    {
      "id": 74,
      "start": 2096.5999755859375,
      "end": 2101.0399780273438,
      "text": " I walked downstairs and I said, what is that smell?"
    },
    {
      "id": 75,
      "start": 2101.0399780273438,
      "end": 2102.239990234375,
      "text": " You know what those roses started to do?"
    },
    {
      "id": 76,
      "start": 2102.239990234375,
      "end": 2103.239990234375,
      "text": " They started to stink."
    },
    {
      "id": 77,
      "start": 2103.239990234375,
      "end": 2108.5599670410156,
      "text": " How many of you know roses smell good when they're alive and when they're fresh, right?"
    },
    {
      "id": 78,
      "start": 2108.5599670410156,
      "end": 2115.6399841308594,
      "text": " But they died and they stunk, I had to throw them away."
    },
    {
      "id": 79,
      "start": 2115.6399841308594,
      "end": 2118.6599731445312,
      "text": " We know this but notice Jesus saying this is us."
    },
    {
      "id": 80,
      "start": 2118.6599731445312,
      "end": 2119.8399658203125,
      "text": " He wants us to be fruitful."
    },
    {
      "id": 81,
      "start": 2119.8399658203125,
      "end": 2125.499969482422,
      "text": " Joseph says, God hath made me to be fruitful, he hath caused me to be fruitful in the land"
    },
    {
      "id": 82,
      "start": 2125.499969482422,
      "end": 2128.6399841308594,
      "text": " of my affliction."
    },
    {
      "id": 83,
      "start": 2128.6399841308594,
      "end": 2132.8399658203125,
      "text": " I mean in the difficulties, God hath caused me to be fruitful."
    },
    {
      "id": 84,
      "start": 2132.8399658203125,
      "end": 2136.1199645996094,
      "text": " Notice in verse number five, I am the vine, ye are the branches, he that abideth in me"
    },
    {
      "id": 85,
      "start": 2136.1199645996094,
      "end": 2138.1199645996094,
      "text": " and I in him, the same bringeth forth."
    },
    {
      "id": 86,
      "start": 2138.6799926757812,
      "end": 2139.6799926757812,
      "text": " What does it say?"
    },
    {
      "id": 87,
      "start": 2139.6799926757812,
      "end": 2143.439971923828,
      "text": " Much fruit, for without me ye can do nothing."
    },
    {
      "id": 88,
      "start": 2143.439971923828,
      "end": 2148.7999877929688,
      "text": " If a man abide not in me, he is cast forth as a branch and is withered."
    },
    {
      "id": 89,
      "start": 2148.7999877929688,
      "end": 2152.0999755859375,
      "text": " Men gather them and cast them into the fire and they are burned."
    },
    {
      "id": 90,
      "start": 2152.0999755859375,
      "end": 2156.3599853515625,
      "text": " If ye abide in me and my words abide in you, ye shall ask what ye will and it shall be"
    },
    {
      "id": 91,
      "start": 2156.3599853515625,
      "end": 2157.3599853515625,
      "text": " done unto you."
    },
    {
      "id": 92,
      "start": 2157.3599853515625,
      "end": 2165.47998046875,
      "text": " Notice in verse eight, critical verse of Scripture, herein is my Father glorified that ye bear"
    },
    {
      "id": 93,
      "start": 2165.47998046875,
      "end": 2170.5599670410156,
      "text": " much fruit, so shall ye be my disciples."
    },
    {
      "id": 94,
      "start": 2170.5599670410156,
      "end": 2174.6399841308594,
      "text": " You know God wants us to be fruitful."
    },
    {
      "id": 95,
      "start": 2174.6399841308594,
      "end": 2182.3199768066406,
      "text": " He said to, when he issued that call to the disciples, they're on the Sea of Galilee,"
    },
    {
      "id": 96,
      "start": 2182.3199768066406,
      "end": 2189.3999633789062,
      "text": " the call to Peter, he says, follow me and I will make you fishers of men."
    },
    {
      "id": 97,
      "start": 2189.3999633789062,
      "end": 2195.6799926757812,
      "text": " When we begin to look at John 15 and thinking about this principle of perspective with Joseph"
    },
    {
      "id": 98,
      "start": 2195.6799926757812,
      "end": 2201.1599731445312,
      "text": " back in Genesis chapter 41, and he says, God hath caused me to be fruitful in the land"
    },
    {
      "id": 99,
      "start": 2201.1599731445312,
      "end": 2207.3199768066406,
      "text": " of my affliction, and I say God has intended for us as his people to be fruitful people."
    },
    {
      "id": 100,
      "start": 2207.3199768066406,
      "end": 2213.6399841308594,
      "text": " And when we bear much fruit, see, it's fruit, more fruit, and much fruit, as you study through"
    },
    {
      "id": 101,
      "start": 2213.6399841308594,
      "end": 2219.999969482422,
      "text": " John 15, and he says that if you bear much fruit, he says, herein is my Father glorified"
    },
    {
      "id": 102,
      "start": 2219.999969482422,
      "end": 2220.999969482422,
      "text": " that you bear much fruit."
    },
    {
      "id": 103,
      "start": 2220.999969482422,
      "end": 2223.3599853515625,
      "text": " I want God to be glorified."
    },
    {
      "id": 104,
      "start": 2223.3599853515625,
      "end": 2228.7999877929688,
      "text": " So we've got to abide in him, and we have to allow God to work through our lives."
    },
    {
      "id": 105,
      "start": 2228.7999877929688,
      "end": 2234.1199645996094,
      "text": " Listen, we cannot hinder what God is seeking to do in our lives today because we're so"
    },
    {
      "id": 106,
      "start": 2234.1199645996094,
      "end": 2239.999969482422,
      "text": " focused on the hardships and the difficulties that happened at some time in our past."
    },
    {
      "id": 107,
      "start": 2240.3199768066406,
      "end": 2247.3199768066406,
      "text": " Joseph says when Manasseh is born, God has caused me to forget."
    },
    {
      "id": 108,
      "start": 2247.3199768066406,
      "end": 2250.5999755859375,
      "text": " God has caused me to be fruitful in the land of my affliction."
    },
    {
      "id": 109,
      "start": 2250.5999755859375,
      "end": 2256.9199829101562,
      "text": " Listen, this evening, we're going to face some affliction, some difficulty."
    },
    {
      "id": 110,
      "start": 2256.9199829101562,
      "end": 2260.7999877929688,
      "text": " You say, pastor, you're telling me I'm facing it right now."
    },
    {
      "id": 111,
      "start": 2260.7999877929688,
      "end": 2261.7999877929688,
      "text": " I understand."
    },
    {
      "id": 112,
      "start": 2261.7999877929688,
      "end": 2264.6399841308594,
      "text": " Turn to the book of 1 Thessalonians, if you will."
    },
    {
      "id": 113,
      "start": 2264.6399841308594,
      "end": 2270.5599670410156,
      "text": " I want to just journey real quickly through just a few verses of Scripture, and I hope"
    },
    {
      "id": 114,
      "start": 2270.5599670410156,
      "end": 2273.439971923828,
      "text": " that this helps us tonight."
    },
    {
      "id": 115,
      "start": 2273.439971923828,
      "end": 2276.0399780273438,
      "text": " We consider the principle of preparation."
    },
    {
      "id": 116,
      "start": 2276.0399780273438,
      "end": 2278.0399780273438,
      "text": " God is working to prepare us."
    },
    {
      "id": 117,
      "start": 2278.0399780273438,
      "end": 2282.8399658203125,
      "text": " Listen, don't despise the time of preparation."
    },
    {
      "id": 118,
      "start": 2282.8399658203125,
      "end": 2289.0399780273438,
      "text": " Don't neglect a season of preparation in your life because we need that."
    },
    {
      "id": 119,
      "start": 2289.0399780273438,
      "end": 2291.3199768066406,
      "text": " God's preparing us for something."
    },
    {
      "id": 120,
      "start": 2291.3199768066406,
      "end": 2293.5599670410156,
      "text": " You think about this principle of perspective."
    },
    {
      "id": 121,
      "start": 2293.5599670410156,
      "end": 2295.3199768066406,
      "text": " Perspective is so important."
    },
    {
      "id": 122,
      "start": 2295.3199768066406,
      "end": 2301.0799865722656,
      "text": " In 1 Thessalonians chapter number 3, Paul had already mentioned in chapter 1 how that"
    },
    {
      "id": 123,
      "start": 2301.0799865722656,
      "end": 2307.239990234375,
      "text": " they came to them with much difficulty as they brought the gospel, and that was what"
    },
    {
      "id": 124,
      "start": 2307.239990234375,
      "end": 2308.239990234375,
      "text": " they were dealing with."
    },
    {
      "id": 125,
      "start": 2308.239990234375,
      "end": 2311.6399841308594,
      "text": " And if you go back to the book of Acts, you can study and see on that journey all of the"
    },
    {
      "id": 126,
      "start": 2311.6399841308594,
      "end": 2312.6399536132812,
      "text": " hardship that they faced."
    },
    {
      "id": 127,
      "start": 2312.6399536132812,
      "end": 2316.7599487304688,
      "text": " But as you come to the third chapter, notice that the Bible says in verse number 3 that"
    },
    {
      "id": 128,
      "start": 2316.7599487304688,
      "end": 2320.0199584960938,
      "text": " no man should be moved by these afflictions."
    },
    {
      "id": 129,
      "start": 2320.0199584960938,
      "end": 2328.8599853515625,
      "text": " Listen, there were some difficulties that the people in Thessalonica were facing."
    },
    {
      "id": 130,
      "start": 2328.8599853515625,
      "end": 2331.0199584960938,
      "text": " There were some persecutions that they were dealing with."
    },
    {
      "id": 131,
      "start": 2331.0199584960938,
      "end": 2336.0199584960938,
      "text": " There were some afflictions, and Paul says that no man should be moved by these afflictions."
    },
    {
      "id": 132,
      "start": 2336.0199584960938,
      "end": 2341.2599487304688,
      "text": " Listen, God is God, and He's on His throne, and He has a purpose, and even in that time"
    },
    {
      "id": 133,
      "start": 2341.2599487304688,
      "end": 2345.0199584960938,
      "text": " of affliction, God can use you and can cause you to be fruitful."
    },
    {
      "id": 134,
      "start": 2345.0199584960938,
      "end": 2350.0199584960938,
      "text": " He says, knowing for yourselves know that we are appointed thereunto."
    },
    {
      "id": 135,
      "start": 2350.0199584960938,
      "end": 2354.0199584960938,
      "text": " Notice in 2 Thessalonians chapter number 1, and then we're going to come back to 1 Thessalonians"
    },
    {
      "id": 136,
      "start": 2354.0199584960938,
      "end": 2360.0999755859375,
      "text": " because I want you to see the perspective and the opportunity that we can be fruitful"
    },
    {
      "id": 137,
      "start": 2360.0999755859375,
      "end": 2363.5799560546875,
      "text": " even in the midst of affliction."
    },
    {
      "id": 138,
      "start": 2363.5799560546875,
      "end": 2367.8599853515625,
      "text": " In 2 Thessalonians 1 and verse number 4, the Bible says so that we ourselves glory in you"
    },
    {
      "id": 139,
      "start": 2367.8599853515625,
      "end": 2373.9400024414062,
      "text": " in the churches of God for your patience and faith in all your persecutions and tribulations"
    },
    {
      "id": 140,
      "start": 2373.9400024414062,
      "end": 2376.699951171875,
      "text": " that ye endure."
    },
    {
      "id": 141,
      "start": 2376.699951171875,
      "end": 2378.5399780273438,
      "text": " They were suffering."
    },
    {
      "id": 142,
      "start": 2378.5399780273438,
      "end": 2382.3800048828125,
      "text": " The church in Thessalonica, the believers, they were dealing with persecution and all"
    },
    {
      "id": 143,
      "start": 2382.3800048828125,
      "end": 2386.9400024414062,
      "text": " these hardships and things that were taking place, and Paul says that you have patience"
    },
    {
      "id": 144,
      "start": 2386.9400024414062,
      "end": 2391.8599853515625,
      "text": " and faith in all your persecutions and tribulations that ye endure."
    },
    {
      "id": 145,
      "start": 2391.8599853515625,
      "end": 2395.97998046875,
      "text": " He said in chapter 3 of the first book, he says that no man should be moved by these"
    },
    {
      "id": 146,
      "start": 2395.97998046875,
      "end": 2399.9400024414062,
      "text": " afflictions, but I want you to go all the way back to the first chapter of 1 Thessalonians."
    },
    {
      "id": 0,
      "start": 2399.9400024414062,
      "end": 2402.300002336502,
      "text": " First Thessalonians."
    },
    {
      "id": 1,
      "start": 2402.300002336502,
      "end": 2404.240002632141,
      "text": " And I want you to see that a people,"
    },
    {
      "id": 2,
      "start": 2404.240002632141,
      "end": 2406.8800024986267,
      "text": " a church that was facing persecution,"
    },
    {
      "id": 3,
      "start": 2406.8800024986267,
      "end": 2409.4400024414062,
      "text": " affliction, and difficulty,"
    },
    {
      "id": 4,
      "start": 2409.4400024414062,
      "end": 2412.120002746582,
      "text": " that God had allowed them to be fruitful"
    },
    {
      "id": 5,
      "start": 2412.120002746582,
      "end": 2415.6400022506714,
      "text": " even in a season of difficulty and affliction."
    },
    {
      "id": 6,
      "start": 2415.6400022506714,
      "end": 2417.6800022125244,
      "text": " The Bible says in verse number seven"
    },
    {
      "id": 7,
      "start": 2417.6800022125244,
      "end": 2419.7200031280518,
      "text": " of First Thessalonians one,"
    },
    {
      "id": 8,
      "start": 2419.7200031280518,
      "end": 2422.46000289917,
      "text": " actually back up to verse number four, if you will,"
    },
    {
      "id": 9,
      "start": 2422.46000289917,
      "end": 2424.5600032806396,
      "text": " knowing, brethren, beloved, your election of God"
    },
    {
      "id": 10,
      "start": 2424.5600032806396,
      "end": 2427.040002822876,
      "text": " for our gospel came not unto you in word only,"
    },
    {
      "id": 11,
      "start": 2427.040002822876,
      "end": 2428.8400020599365,
      "text": " but also in power and in the Holy Ghost"
    },
    {
      "id": 12,
      "start": 2428.8400020599365,
      "end": 2431.4400024414062,
      "text": " and in much assurance, as you know what manner of men"
    },
    {
      "id": 13,
      "start": 2431.4400024414062,
      "end": 2434.0800018310547,
      "text": " we were among you for your sake."
    },
    {
      "id": 14,
      "start": 2434.0800018310547,
      "end": 2436.400001525879,
      "text": " And ye became followers of us and of the Lord,"
    },
    {
      "id": 15,
      "start": 2436.400001525879,
      "end": 2438.9800033569336,
      "text": " having received the word in much affliction"
    },
    {
      "id": 16,
      "start": 2438.9800033569336,
      "end": 2441.400001525879,
      "text": " with joy of the Holy Ghost."
    },
    {
      "id": 17,
      "start": 2441.400001525879,
      "end": 2444.96000289917,
      "text": " Now notice this, so that ye were in samples"
    },
    {
      "id": 18,
      "start": 2444.96000289917,
      "end": 2447.96000289917,
      "text": " to all that believe in Macedonia and Achaia."
    },
    {
      "id": 19,
      "start": 2447.96000289917,
      "end": 2451.240001678467,
      "text": " Verse number eight, for from you sounded out"
    },
    {
      "id": 20,
      "start": 2451.240001678467,
      "end": 2453.6000022888184,
      "text": " the word of the Lord, not only in Macedonia and Achaia,"
    },
    {
      "id": 21,
      "start": 2453.6000022888184,
      "end": 2455.560001373291,
      "text": " but also in every place your faith to God"
    },
    {
      "id": 22,
      "start": 2455.560001373291,
      "end": 2457.680004119873,
      "text": " were to spread abroad, so that we need not"
    },
    {
      "id": 23,
      "start": 2457.680004119873,
      "end": 2460.0000038146973,
      "text": " to speak anything, for they themselves show of us"
    },
    {
      "id": 24,
      "start": 2460.0000038146973,
      "end": 2462.280002593994,
      "text": " what manner of entering in we had unto you,"
    },
    {
      "id": 25,
      "start": 2462.280002593994,
      "end": 2464.2000045776367,
      "text": " and how you turned to God from idols"
    },
    {
      "id": 26,
      "start": 2464.2000045776367,
      "end": 2467.0600051879883,
      "text": " to serve the living and true God."
    },
    {
      "id": 27,
      "start": 2468.2000045776367,
      "end": 2470.6399993896484,
      "text": " The church at Thessalonica had a great testimony."
    },
    {
      "id": 28,
      "start": 2471.6399993896484,
      "end": 2474.4400024414062,
      "text": " I've said this over the years, there's no perfect church,"
    },
    {
      "id": 29,
      "start": 2476.0,
      "end": 2478.4800033569336,
      "text": " but the church at Thessalonica is a model church."
    },
    {
      "id": 30,
      "start": 2479.4800033569336,
      "end": 2481.92000579834,
      "text": " And as you study through the two epistles"
    },
    {
      "id": 31,
      "start": 2481.92000579834,
      "end": 2484.9400024414062,
      "text": " to the Thessalonians, you find that they're a model church,"
    },
    {
      "id": 32,
      "start": 2484.9400024414062,
      "end": 2487.0,
      "text": " and here Paul is saying at this last part"
    },
    {
      "id": 33,
      "start": 2487.0,
      "end": 2488.800003051758,
      "text": " of chapter number one, that even though"
    },
    {
      "id": 34,
      "start": 2488.800003051758,
      "end": 2490.2000045776367,
      "text": " they had dealt with affliction,"
    },
    {
      "id": 35,
      "start": 2490.2000045776367,
      "end": 2492.7600021362305,
      "text": " and even though they had dealt with this persecution,"
    },
    {
      "id": 36,
      "start": 2492.7600021362305,
      "end": 2494.520004272461,
      "text": " these persecutions and tribulations,"
    },
    {
      "id": 37,
      "start": 2494.520004272461,
      "end": 2495.8800048828125,
      "text": " and all that they were dealing with,"
    },
    {
      "id": 38,
      "start": 2495.8800048828125,
      "end": 2498.319999694824,
      "text": " that they were still fruitful, for notice it says,"
    },
    {
      "id": 39,
      "start": 2498.319999694824,
      "end": 2499.840003967285,
      "text": " for from you, in verse number eight,"
    },
    {
      "id": 40,
      "start": 2499.840003967285,
      "end": 2502.0800018310547,
      "text": " sounded out the word of the Lord,"
    },
    {
      "id": 41,
      "start": 2502.0800018310547,
      "end": 2503.520004272461,
      "text": " not only in Macedonia and Achaia,"
    },
    {
      "id": 42,
      "start": 2503.520004272461,
      "end": 2505.3600006103516,
      "text": " but also in every place your faith to God"
    },
    {
      "id": 43,
      "start": 2505.3600006103516,
      "end": 2507.279998779297,
      "text": " were to spread abroad, so that we need not"
    },
    {
      "id": 44,
      "start": 2507.279998779297,
      "end": 2508.4800033569336,
      "text": " to speak anything."
    },
    {
      "id": 45,
      "start": 2508.4800033569336,
      "end": 2510.2000045776367,
      "text": " It's almost as if Paul is saying,"
    },
    {
      "id": 46,
      "start": 2510.2000045776367,
      "end": 2512.3800048828125,
      "text": " we go to share the gospel in a region,"
    },
    {
      "id": 47,
      "start": 2512.3800048828125,
      "end": 2514.520004272461,
      "text": " but you've already shared the gospel there."
    },
    {
      "id": 48,
      "start": 2515.520004272461,
      "end": 2517.8800048828125,
      "text": " Now think about that for a moment."
    },
    {
      "id": 49,
      "start": 2517.8800048828125,
      "end": 2519.2000045776367,
      "text": " In the midst of their affliction,"
    },
    {
      "id": 50,
      "start": 2519.2000045776367,
      "end": 2520.800003051758,
      "text": " and their persecution, and their difficulties,"
    },
    {
      "id": 51,
      "start": 2520.800003051758,
      "end": 2521.8800048828125,
      "text": " and all they were dealing with,"
    },
    {
      "id": 52,
      "start": 2521.8800048828125,
      "end": 2525.0,
      "text": " they were still sending out the truth of the gospel,"
    },
    {
      "id": 53,
      "start": 2525.0,
      "end": 2526.9599990844727,
      "text": " they were still doing what they were seeking"
    },
    {
      "id": 54,
      "start": 2526.9599990844727,
      "end": 2530.3600006103516,
      "text": " to be fruitful, God was using them to be fruitful,"
    },
    {
      "id": 55,
      "start": 2530.3600006103516,
      "end": 2533.460006713867,
      "text": " even in a time, a season of affliction."
    },
    {
      "id": 56,
      "start": 2535.720001220703,
      "end": 2537.520004272461,
      "text": " I've heard many testimonies over the years"
    },
    {
      "id": 57,
      "start": 2537.520004272461,
      "end": 2540.779998779297,
      "text": " of people that have dealt with great hardships,"
    },
    {
      "id": 58,
      "start": 2541.779998779297,
      "end": 2545.5,
      "text": " be it physical or otherwise,"
    },
    {
      "id": 59,
      "start": 2545.5,
      "end": 2547.9000091552734,
      "text": " and they share testimonies of,"
    },
    {
      "id": 60,
      "start": 2547.9000091552734,
      "end": 2551.3200073242188,
      "text": " in that season of great difficulty and of affliction,"
    },
    {
      "id": 61,
      "start": 2551.3200073242188,
      "end": 2553.3399963378906,
      "text": " how God used them to be able to share the gospel"
    },
    {
      "id": 62,
      "start": 2553.3399963378906,
      "end": 2556.3399963378906,
      "text": " with someone, and they got saved."
    },
    {
      "id": 63,
      "start": 2556.3399963378906,
      "end": 2559.6600036621094,
      "text": " That's amazing to me, that God would work in that manner."
    },
    {
      "id": 64,
      "start": 2560.9000091552734,
      "end": 2563.0599975585938,
      "text": " See, this evening, we think about"
    },
    {
      "id": 65,
      "start": 2563.0599975585938,
      "end": 2566.5,
      "text": " the principle of preparation,"
    },
    {
      "id": 66,
      "start": 2566.5,
      "end": 2567.8600006103516,
      "text": " it's important that we understand,"
    },
    {
      "id": 67,
      "start": 2567.8600006103516,
      "end": 2570.4199981689453,
      "text": " and we go through that season of preparation,"
    },
    {
      "id": 68,
      "start": 2571.0599975585938,
      "end": 2573.0599975585938,
      "text": " for God has a purpose and a plan for us."
    },
    {
      "id": 69,
      "start": 2574.6199951171875,
      "end": 2577.8200073242188,
      "text": " And when he's ready to open that door,"
    },
    {
      "id": 70,
      "start": 2577.8200073242188,
      "end": 2580.0599975585938,
      "text": " did we get all the preparation we were supposed to get?"
    },
    {
      "id": 71,
      "start": 2580.0599975585938,
      "end": 2582.760009765625,
      "text": " Are we ready to do what God has for us to do?"
    },
    {
      "id": 72,
      "start": 2583.740005493164,
      "end": 2585.6199951171875,
      "text": " See, because when the opportunity arises,"
    },
    {
      "id": 73,
      "start": 2585.6199951171875,
      "end": 2588.979995727539,
      "text": " that's not time to prepare, that's time to do."
    },
    {
      "id": 74,
      "start": 2588.979995727539,
      "end": 2590.020004272461,
      "text": " Does that make sense?"
    },
    {
      "id": 75,
      "start": 2591.3399963378906,
      "end": 2593.979995727539,
      "text": " But then the principle of perspective,"
    },
    {
      "id": 76,
      "start": 2593.979995727539,
      "end": 2595.740005493164,
      "text": " what do we focus on?"
    },
    {
      "id": 77,
      "start": 2595.740005493164,
      "end": 2598.040008544922,
      "text": " Do we focus on how bad things are?"
    },
    {
      "id": 78,
      "start": 2598.040008544922,
      "end": 2599.540008544922,
      "text": " How terrible, how we were wronged,"
    },
    {
      "id": 79,
      "start": 2599.540008544922,
      "end": 2600.9400024414062,
      "text": " and how this happened and that happened,"
    },
    {
      "id": 80,
      "start": 2600.9400024414062,
      "end": 2604.9000091552734,
      "text": " and I just can't imagine this person didn't do this,"
    },
    {
      "id": 81,
      "start": 2604.9000091552734,
      "end": 2606.3399963378906,
      "text": " or this person didn't say hi to me,"
    },
    {
      "id": 82,
      "start": 2606.3399963378906,
      "end": 2609.300003051758,
      "text": " and this person, I mean, we get mad about silly things."
    },
    {
      "id": 83,
      "start": 2610.1399993896484,
      "end": 2612.1000061035156,
      "text": " Seriously, honestly."
    },
    {
      "id": 84,
      "start": 2615.3600006103516,
      "end": 2616.979995727539,
      "text": " Somebody came to me about five weeks ago and said,"
    },
    {
      "id": 85,
      "start": 2616.979995727539,
      "end": 2618.460006713867,
      "text": " Pastor, are you mad at me?"
    },
    {
      "id": 86,
      "start": 2618.460006713867,
      "end": 2620.5800018310547,
      "text": " I said, no, why would I be mad at you?"
    },
    {
      "id": 87,
      "start": 2620.5800018310547,
      "end": 2623.1399993896484,
      "text": " Well, you didn't say hi to me last week."
    },
    {
      "id": 88,
      "start": 2623.1399993896484,
      "end": 2624.1800079345703,
      "text": " I'm very sorry."
    },
    {
      "id": 89,
      "start": 2625.260009765625,
      "end": 2629.220001220703,
      "text": " And it was a great conversation, everything was resolved."
    },
    {
      "id": 90,
      "start": 2629.9000091552734,
      "end": 2630.740005493164,
      "text": " But what I'm saying is that,"
    },
    {
      "id": 91,
      "start": 2630.740005493164,
      "end": 2633.1399993896484,
      "text": " it wasn't that I didn't say hi because I was mad,"
    },
    {
      "id": 92,
      "start": 2633.1399993896484,
      "end": 2634.6199951171875,
      "text": " we had a problem with the sound thing,"
    },
    {
      "id": 93,
      "start": 2634.6199951171875,
      "end": 2636.779998779297,
      "text": " my lapel wasn't working, and I was back there"
    },
    {
      "id": 94,
      "start": 2636.779998779297,
      "end": 2638.020004272461,
      "text": " trying to get things fixed up,"
    },
    {
      "id": 95,
      "start": 2638.020004272461,
      "end": 2640.260009765625,
      "text": " and working with whatever was going on,"
    },
    {
      "id": 96,
      "start": 2640.260009765625,
      "end": 2644.3399963378906,
      "text": " and I think it wasn't my lapel, it was my iPad."
    },
    {
      "id": 97,
      "start": 2644.3399963378906,
      "end": 2646.9000091552734,
      "text": " Because Joseph says, you just need to get a new one."
    },
    {
      "id": 98,
      "start": 2646.9000091552734,
      "end": 2649.740005493164,
      "text": " But the reality is that sometimes the devil"
    },
    {
      "id": 99,
      "start": 2649.740005493164,
      "end": 2652.540008544922,
      "text": " can use super little things to just mess us up."
    },
    {
      "id": 100,
      "start": 2653.740005493164,
      "end": 2654.5800018310547,
      "text": " Seriously."
    },
    {
      "id": 101,
      "start": 2655.5800018310547,
      "end": 2657.5800170898438,
      "text": " And what's our perspective?"
    },
    {
      "id": 102,
      "start": 2658.3399963378906,
      "end": 2661.6600036621094,
      "text": " Listen, Joseph had a whole lot of bad things."
    },
    {
      "id": 103,
      "start": 2661.6600036621094,
      "end": 2664.220001220703,
      "text": " He said, God, he calls me to forget."
    },
    {
      "id": 104,
      "start": 2666.1000061035156,
      "end": 2668.739990234375,
      "text": " And therefore, God's called me to be fruitful"
    },
    {
      "id": 105,
      "start": 2668.739990234375,
      "end": 2670.0599975585938,
      "text": " in the land of affliction."
    },
    {
      "id": 106,
      "start": 2671.0599975585938,
      "end": 2672.540008544922,
      "text": " See, sometimes we're in the land of affliction"
    },
    {
      "id": 107,
      "start": 2672.540008544922,
      "end": 2675.779998779297,
      "text": " when it's a time of great distress and just difficulty,"
    },
    {
      "id": 108,
      "start": 2675.779998779297,
      "end": 2678.2999877929688,
      "text": " and we think that means that we have a pass"
    },
    {
      "id": 109,
      "start": 2678.2999877929688,
      "end": 2679.6600036621094,
      "text": " to just kind of do nothing."
    },
    {
      "id": 110,
      "start": 2680.739990234375,
      "end": 2682.3800048828125,
      "text": " Well, I got all this stuff going on,"
    },
    {
      "id": 111,
      "start": 2682.3800048828125,
      "end": 2686.8999938964844,
      "text": " and God understands, and it's just,"
    },
    {
      "id": 112,
      "start": 2686.8999938964844,
      "end": 2689.5800170898438,
      "text": " woe is me, pity party."
    },
    {
      "id": 113,
      "start": 2691.0599975585938,
      "end": 2694.1799926757812,
      "text": " Joseph said, God, let me be fruitful."
    },
    {
      "id": 114,
      "start": 2695.3399963378906,
      "end": 2697.019989013672,
      "text": " God hath called me to be fruitful"
    },
    {
      "id": 115,
      "start": 2697.8999938964844,
      "end": 2699.5800170898438,
      "text": " in the land of my affliction."
    },
    {
      "id": 116,
      "start": 2699.5800170898438,
      "end": 2703.779998779297,
      "text": " I don't know tonight what everyone is dealing with,"
    },
    {
      "id": 117,
      "start": 2703.779998779297,
      "end": 2707.1799926757812,
      "text": " but I know we have a God who if we keep our attention"
    },
    {
      "id": 118,
      "start": 2707.1799926757812,
      "end": 2709.8200073242188,
      "text": " and our perspective on him,"
    },
    {
      "id": 119,
      "start": 2709.8200073242188,
      "end": 2713.1400146484375,
      "text": " that even in the midst of difficulty and affliction,"
    },
    {
      "id": 120,
      "start": 2713.1400146484375,
      "end": 2715.459991455078,
      "text": " he can cause us to be fruitful."
    },
    {
      "id": 121,
      "start": 2715.459991455078,
      "end": 2717.8200073242188,
      "text": " He can use us for his honor and for his glory."
    },
    {
      "id": 122,
      "start": 2718.7000122070312,
      "end": 2723.7000122070312,
      "text": " There's a world that was directly impacted"
    },
    {
      "id": 123,
      "start": 2725.7000122070312,
      "end": 2730.1400146484375,
      "text": " because of Joseph's faithfulness and fruitfulness."
    },
    {
      "id": 124,
      "start": 2731.779998779297,
      "end": 2734.019989013672,
      "text": " People's lives were spared"
    },
    {
      "id": 125,
      "start": 2735.8600158691406,
      "end": 2738.459991455078,
      "text": " because there was a great famine that was coming,"
    },
    {
      "id": 126,
      "start": 2739.5800170898438,
      "end": 2743.5,
      "text": " and because Joseph understood the preparation,"
    },
    {
      "id": 127,
      "start": 2743.5,
      "end": 2745.9400024414062,
      "text": " Joseph had a right perspective."
    },
    {
      "id": 128,
      "start": 2745.9400024414062,
      "end": 2750.2999877929688,
      "text": " When the opportunity came, God used him."
    },
    {
      "id": 129,
      "start": 2750.2999877929688,
      "end": 2752.0599975585938,
      "text": " God calls me to be fruitful."
    },
    {
      "id": 130,
      "start": 2752.0599975585938,
      "end": 2754.8600158691406,
      "text": " Tonight, I hope that God would help us"
    },
    {
      "id": 131,
      "start": 2754.8600158691406,
      "end": 2758.9400024414062,
      "text": " to have that perspective that Joseph had,"
    },
    {
      "id": 132,
      "start": 2758.9400024414062,
      "end": 2760.739990234375,
      "text": " that we'd understand the preparation"
    },
    {
      "id": 133,
      "start": 2760.739990234375,
      "end": 2762.4200134277344,
      "text": " that God is taking us through."
    },
    {
      "id": 134,
      "start": 2762.4200134277344,
      "end": 2763.260009765625,
      "text": " Let's pray."
    },
    {
      "id": 135,
      "start": 2763.260009765625,
      "end": 2764.5800170898438,
      "text": " Father, we love you."
    },
    {
      "id": 136,
      "start": 2764.5800170898438,
      "end": 2766.1799926757812,
      "text": " We thank you for loving us."
    },
    {
      "id": 137,
      "start": 2767.220001220703,
      "end": 2769.1000061035156,
      "text": " We thank you that you're God,"
    },
    {
      "id": 138,
      "start": 2769.1000061035156,
      "end": 2770.779998779297,
      "text": " and though at times we don't understand"
    },
    {
      "id": 139,
      "start": 2770.779998779297,
      "end": 2772.8200073242188,
      "text": " all that's taking place, we can trust you."
    },
    {
      "id": 140,
      "start": 2772.8200073242188,
      "end": 2774.1400146484375,
      "text": " We can rest in you."
    },
    {
      "id": 141,
      "start": 2775.019989013672,
      "end": 2779.7000122070312,
      "text": " God, help us to understand the seasons of preparation"
    },
    {
      "id": 142,
      "start": 2779.7000122070312,
      "end": 2782.220001220703,
      "text": " that you would guide and lead us through,"
    },
    {
      "id": 143,
      "start": 2782.220001220703,
      "end": 2784.8200073242188,
      "text": " and I pray that in those moments of preparation"
    },
    {
      "id": 144,
      "start": 2784.8200073242188,
      "end": 2788.3800048828125,
      "text": " that you would help us to get all"
    },
    {
      "id": 145,
      "start": 2788.3800048828125,
      "end": 2789.8999938964844,
      "text": " that we're supposed to get,"
    },
    {
      "id": 146,
      "start": 2790.8600158691406,
      "end": 2793.540008544922,
      "text": " that we would be prepared for the opportunities"
    },
    {
      "id": 147,
      "start": 2793.540008544922,
      "end": 2795.1000061035156,
      "text": " that you present us with."
    },
    {
      "id": 148,
      "start": 2797.540008544922,
      "end": 2801.739990234375,
      "text": " I think about this perspective of Joseph"
    },
    {
      "id": 149,
      "start": 2801.739990234375,
      "end": 2804.540008544922,
      "text": " and the principle that we see here,"
    },
    {
      "id": 150,
      "start": 2804.540008544922,
      "end": 2807.3399963378906,
      "text": " the naming of his two sons,"
    },
    {
      "id": 151,
      "start": 2807.3399963378906,
      "end": 2809.5800170898438,
      "text": " and God, I pray that you'd help us to look to Jesus,"
    },
    {
      "id": 152,
      "start": 2809.5800170898438,
      "end": 2811.739990234375,
      "text": " the author and finisher of our faith,"
    },
    {
      "id": 153,
      "start": 2811.739990234375,
      "end": 2813.459991455078,
      "text": " help us to have an eternal perspective,"
    },
    {
      "id": 154,
      "start": 2813.459991455078,
      "end": 2815.5,
      "text": " not a temporal perspective,"
    },
    {
      "id": 155,
      "start": 2815.5,
      "end": 2820.5,
      "text": " help us to not focus upon those things that are hurtful,"
    },
    {
      "id": 156,
      "start": 2822.980010986328,
      "end": 2824.7000122070312,
      "text": " but God, help us to focus on you"
    },
    {
      "id": 157,
      "start": 2826.260009765625,
      "end": 2828.980010986328,
      "text": " and how you can cause us to be fruitful,"
    },
    {
      "id": 158,
      "start": 2828.980010986328,
      "end": 2830.779998779297,
      "text": " even in the land of affliction."
    },
    {
      "id": 159,
      "start": 2831.9400024414062,
      "end": 2833.8600158691406,
      "text": " I pray that tonight you would move and work"
    },
    {
      "id": 160,
      "start": 2833.8600158691406,
      "end": 2836.5800170898438,
      "text": " in hearts and lives as only you can."
    },
    {
      "id": 161,
      "start": 2836.5800170898438,
      "end": 2839.739990234375,
      "text": " I pray, Lord, that we would not only see"
    },
    {
      "id": 162,
      "start": 2841.1400146484375,
      "end": 2843.1000061035156,
      "text": " the life of Joseph recorded for us,"
    },
    {
      "id": 163,
      "start": 2843.1000061035156,
      "end": 2845.739990234375,
      "text": " but we would apply truth in our lives"
    },
    {
      "id": 164,
      "start": 2845.739990234375,
      "end": 2849.1799926757812,
      "text": " that would cause us to be used in like manner."
    },
    {
      "id": 165,
      "start": 2849.1799926757812,
      "end": 2850.6199951171875,
      "text": " We give you the glory for all that you'll do,"
    },
    {
      "id": 166,
      "start": 2850.6199951171875,
      "end": 2852.3800048828125,
      "text": " for it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-15T23:24:23.703203"
}