{
  "video_id": "CuDgnvg3ek8",
  "text": "42, and I am thankful for the blessings of the Lord. Had a number of folks that were traveling that God has brought back safely. Have some folks that continue to travel. Want you to pray for them. And then Brother Fernando, his grandmother had surgery last evening and he sent me a text. I mentioned this in Sunday School and he sent me a text and we prayed and we're thankful that that surgery went well and she's recovering well and so we praise the Lord for that. And it's amazing our God does here and answer prayer, amen. And every time we go to the Lord in prayer, we have that confidence knowing that he hears us and that he's able and we certainly are encouraged each time he answers prayer. Genesis chapter 42 this evening and we'll look at the entire chapter. Genesis 42, one through 38. I'm not gonna read the entire text this evening. I'm gonna just kind of jump through the text of scripture this evening as we deal with this subject matter. But notice beginning in verse number one in Genesis 42, the Bible says, now when Jacob saw that there was corn in Egypt, Jacob said unto his sons, why do you look one upon another? And he said, behold, I have heard that there's corn in Egypt. Get you down thither and buy for us from fence that we may live and not die. And Joseph's 10 brethren went down to buy corn in Egypt. But Benjamin, Joseph's brother, Jacob sent not with his brethren for he said, lest peradventure mischief befall him. The sons of Israel came to buy corn among those that came for the famine was in the land of Canaan. We'll dig in further through the text as we study through this portion of scripture this evening. But you understand that the seven years of great plenty had ended and the seven years of dearth began according to the end of chapter number 41 of the book of Genesis. We find that Joseph was diligent during those seven years of great plenty. And we find that because of his diligence and his obedience to follow that which God had revealed to him, we find that there was food in Egypt. Now we understand that as we look at this and dig into chapter number 42, it says now when Jacob saw that there was corn in Egypt. And so we find that as we back up just a little bit into chapter 41, by way of introduction, we find that the Bible tells us in verse number 54, notice of chapter 41, verse 54. And the seven years of dearth began to come according as Joseph had said, and the dearth was in all lands. But in the land of Egypt, there was bread. Again, you see in verse number 57, notice it says in all countries came into Egypt to Joseph for to buy corn. Why? Because the famine was so sore in all lands. We find that there in chapter number 42 in verse number five, at the end of the verse, it says that the famine was in the land of Canaan as well. And so we find that as we look at this portion of scripture, I've titled the message this evening, Joseph's brethren went down to buy corn in Egypt. And you see that in verse number three, and we find that throughout this passage of scripture that God records for us this journey that these 10 brothers took from Canaan to Egypt for the purpose of getting food, of buying corn. And we find that as God would rehearse for us the account as it takes place, that these 10 brothers, of course, they meet their brother, Joseph. Their brother who they had sold into slavery, their brother that nearly 20 years had passed since the last time they had seen him. And we find that Joseph now is in this elevated position of leadership. We've studied through the book of Genesis. We've understood the things that have taken place. And we find that now these brothers, because of what Jacob understood to be true, in verse number one of chapter 42, the Bible says that Jacob saw that there was corn in Egypt. In chapter 42 in verse number two, it says that Jacob heard there was corn in Egypt. And so Jacob, upon understanding the fact that there was a source of food and understanding the circumstances in which they were facing, it was a real bad time because of this great dearth that had came upon the land. And notice at the end of verse number two, he says that we may live and not die. That gives us some insight with regard to the conditions and how bad it really was. And so we find that Jacob, understanding all of these things and what he was experiencing, we find that he sends his boys, these 10 sons, to Egypt. He did not send Benjamin, the youngest. Why? Well, because he'd already lost Joseph and he did not want any mischief to fall upon Benjamin. In his mind, remember, Jacob had every part of his being believe that Joseph was killed. When his brothers came back and they said, hey, we found this. Do you know whose this is? What was it that they showed him? The coat of many colors that Jacob had given to his son and they had dipped it in blood. Remember, they killed an animal, they dipped it in blood and they said, we found this. And what did Jacob believe? A wild beast hath devoured him. He believed that he was dead. And the brothers, his sons, his own sons allowed him to believe that lie. And now we find that we come to chapter 42. So many, I mean, 20 years, at least a minimum of 20 years has passed between the time in which Jacob, his sons sold Joseph into slavery. And now as they're dealing with this great famine, and we find that as we read through Genesis chapter 42, that as we look at the dialogue that God provides of this record and this account and all the interactions that take place, really what we find is that God is at work. God is working. In fact, as we look at this portion of scripture and we look at the circumstances that are recorded here in Genesis 42, it really reminds us that God is always at work. God is always at work. We may not recognize it, we may not see it, but we can rest assured that God is always at work. And we find that as we look at this portion of scripture, I'm going to deal with two thoughts very quickly so that we can spend the bulk of our time on my final thought this evening. But when I think about looking at Genesis 42 and consider the fact that God is at work, we notice first of all, God is working locally. When I say that he's working locally, I'm saying he's working in Egypt. Joseph was there, and you understand all the circumstances with regard to the previous chapters and all that we've studied in the life of Joseph, and we see how God is working. God had given Joseph the opportunity, the ability to be able to interpret the dream, to be able to come up with a plan so that there would be food in Egypt. God was at work in Egypt. God was at work, not only locally, but God was working globally. We look at this particular portion of scripture, and we find that this famine impacted more than just Egypt. It was Pharaoh that had the dream. It was Pharaoh that understood through this dream that God gave, through Joseph's interpretation, what was going to come and how God was going to bring it to pass, but understand that the famine impacted more than just Egypt. In fact, it says in verse 57 that all countries came into Egypt. Why? Because in Egypt, there was food, and so God, listen, he knows where Jacob and the boys are. He knows that they're in Canaan, and God is working. He's working locally in Egypt. He's working in Joseph's life. He's working through those circumstances there, but we find that he's working throughout the entire world, and we find that here, the entire known world, and we find that this particular famine had an impact there in Canaan. We see it in chapter 42 and verse number five. Also in chapter 46 and verse number 31, the Bible plainly tells us that Joseph said unto his brethren and unto his father's house, I will go up and show Pharaoh and say unto him, my brethren in my father's house, which are in the land of Canaan, are come unto me, and so they came from Canaan. Why? Because there was a famine. God's working locally. He's working globally, but where I really wanna focus our attention this evening and dig into this portion of Scripture is that God is working personally. Our God is a personal God. I'm thankful that God is at work in Egypt, and God is at work throughout all of these lands as we look in Genesis chapter number 42, but the reality is that we see as we dig into the portion of Scripture that God is working in the lives of individuals, and God still today, listen, God is working locally. God is working globally, but the amazing truth of how God is at work is that he's at work personally. He's working in people's lives. We may not always see it. We may be praying, and we don't see the results, and we don't see how God is working, but we can be confident, and we can rest assured that God is at work. God is at work in our lives. As we dig through Genesis chapter 42, and we begin to see how God is working and what God is doing, and how he, being an omnipresent God, he's everywhere, but he's working because he's a personal God. He's working in the lives of individuals. Can I say this this evening, even before we dig into the rest of the portion of Scripture tonight? Sometimes when God is at work, at work, it's uncomfortable. It's uncomfortable. Sometimes when God is at work, we might resist it. We don't like it. You know, sometimes God is working and He's kind of peeling back the layers of the skin of the onion, so to speak, to expose some things in our lives that have to be dealt with. And you know, sometimes when God is at work, it's an uncomfortable thing. And sometimes we don't really like it. But God is at work. We ought to rejoice that God is at work. We ought to rejoice that God is interested in working in our lives personally. We ought to rejoice when we come to the house of God and we hear the preaching of God's Word. When we go in our daily devotions and we open up the Word of God and we begin to read and God begins to prick our hearts through the personal reading, through the public preaching, we ought to rejoice that God would work in our lives individually. It's a blessed thing. I've said, not recently, but I've said over the years that it's a good thing when God's people deal with that circumstance in which we feel the preaching and God's Word will bring in our lives some conviction. Conviction is a good thing. When my toes and your toes are stepped on, it's a good thing because God's at work. Notice as we look at this portion of Scripture and consider that God is working personally, I would say, number one, that God is working in Joseph's life. God is working in Joseph's life. We find that Joseph is here. Notice we stopped reading in verse number five. Pick it up with me in verse number six of Genesis 42. The Bible says, and Joseph was the governor over the land. Now we knew that, did we not? We knew, based on studying through this portion of Scripture and studying through the life of Joseph, we know that God elevated Joseph to a place of great authority. And we find that Joseph is the governor of the land. We understand that his brothers have no clue that Joseph is the governor of the land. But Joseph is the governor of the land and he it was that sold to all the people of the land. Now I want you in your minds eye, we'll finish reading verse number six here in just a moment, but in your mind's eye this evening, I want you to consider the busyness of where Joseph is. I want you to understand the number of people that would be in and out trying to buy food. Listen, if you're in a position in which there's a great famine, so much so that you're considering that you're going to die as a result of this famine and you need food, it's going to be a busy place. There are going to be a lot of people in and out trying to buy food, trying to survive. And we find that the people, all the people of the land, they came there to where Joseph was. In fact, in verse 57 of chapter 41, it says, and all countries came into Egypt to Joseph for to buy corn. Remember when the people, when the Egyptians cried to Pharaoh, we have no food. What did he say? Go to Joseph. God's working in Joseph's life. Why do I say that? Well, look at the rest of verse number six. And Joseph's brethren came. And Joseph's brethren came. And Joseph's brethren came. We read through the text and we understand that Joseph recognizes who they are. They don't know who he is. But when I think about Joseph's brothers coming and it says that they bowed down themselves before him with their faces to the earth and Joseph saw his brethren and he knew them, but made himself strange unto them and spake roughly unto them. And he said unto them, whence came ye? And they said, from the land of Canaan to buy food. And so we find here in these verses of scripture that God is working in Joseph's life. Why do I say that? Well, understand that Joseph had some dreams about his brothers bowing down and the authority that he would have and we see that this is being fulfilled here. But I also want you to understand that Joseph is now coming face to face with the brothers that hated him, that wanted to kill him, that wanted to, and eventually sold him into slavery. I want you to think about the emotions of that. Listen, as we look in the life of Joseph, go back to chapter 41, if you will, and look in verses 51 and 52 of Genesis chapter 41 and I want you to see that as we look at this portion of scripture here and we understand what's taking place that God tells us in Genesis 41 and verse number 51, and Joseph called the name of the firstborn Manasseh. For God said he hath made me forget all my toil and all my father's house and the name of the second called he Ephraim. For God hath caused me to be fruitful in the land of my affliction. We studied this several weeks ago when we looked at Joseph and we talked about the principle of perspective from this portion of scripture and the fact that he names his firstborn Manasseh, which means forgetfulness. He names his secondborn Ephraim, which means fruitfulness. And we looked through and we dealt with that and we understood that God had been working in the life of Joseph. But I want you to understand that now as Joseph's brothers come face to face with him, that what he had believed in and what he had handled now, those emotions are raw. He's face to face with his brothers. How are you going to respond? How are you going to deal with that? Listen, I wonder this evening if there's anything in you, someone walks into a room and you have ought against them. I mean maybe they did you wrong. We're supposed to forgive. Joseph says forgetfulness and fruitfulness and naming his sons. But you know when you come face to face with someone that hurt you, they didn't seek his forgiveness, did they? No. Man, God's at work in the life of Joseph. I believe that God is proving some things in the life of Joseph. You know God will prove some things in our lives. It's easy to say things. There's a whole different story to actually live it. It's one thing to say I forgive that person but then to interact with that person. Would you agree? You say I forgive him but I never want to see him again. Have you ever heard somebody say that? Sure you have. Is that true forgiveness? I mean listen, remember sometimes when God's at work it's not comfortable. It's not comfortable. Joseph is he standing there and he sees his brothers. It's been 20 years. His brothers don't recognize him. No doubt there's been a great transformation in his even physical appearance and then of course with wearing all of the Egyptian garb that he would have on they don't recognize he speaks Egyptian no doubt and he's speaking through a translator as you'd find as we continue studying through these chapters and we find that he knew his brothers. God was at work. God was at work. We find that God is working in the life of Joseph but I would say that God is not only working in the life of Joseph but God is working in the lives of Joseph's brothers. And really that's the bulk of this portion of scripture. Look in verse number 8. The Bible says, And Joseph knew his brethren, but they knew him not. And Joseph remembered the dreams which he dreamed of them, and said unto them, Ye are spies, to see the nakedness of the land, ye are come. And they said unto him, Nay, my lord, but to buy food are thy servants come. We are all one man's sons, we are true men, thy servants are no spies. And he said unto them, Nay, but to see the nakedness of the land, ye are come. They said, Thy servants are twelve brethren, the sons of one man in the land of Canaan. Behold, the youngest is this day with our father, and one is not. Who is that? That's how they refer to him. One is not. They're talking to Joseph. The one who they say is not. And we find that through this portion of scripture that Joseph, I believe, as you study the life of Joseph, he was a man that sought the Lord, he followed the Lord, he obeyed the Lord. I believe that in this interaction between Joseph and his brothers, he is in obedience to God. When he's speaking roughly to them in all the circumstances that are going on, I believe that Joseph is doing exactly what God has instructed him to do. Joseph's not, he's not walking in the flesh in this portion of scripture. I believe that Joseph is obedient to the Lord, but God is working in the lives of those brothers. We're going to see it here in just a moment. Notice with me, the Bible says that he says that they come to see the nakedness of the land in verse 14. And Joseph said unto them, That is it that I spake unto you, saying, You're spies. Hereby ye shall be approved. By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither. Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your words may be proved, whether there be any truth in you, or else by the life of Pharaoh, surely, you're spies. And he, Joseph, put them, his brothers, all together into ward three days. I think those were three long days. Don't you think so? They didn't know what they were going to experience when they got to Egypt. They know that they were given instruction from Dad to go buy corn in Egypt, and they arrive, and they immediately have this interaction. Perhaps as they're waiting in line, as many are there to buy food, perhaps they see person after person that stands, and they get their food, and they go on their way. And then all of a sudden, they arrive, and there's all this questioning, and they're put into ward. They're put into prison. There's this interaction. We find that for three days, the Bible does not tell us during this three-day period of time what they discuss. However, when we look at verse number 21, I think God gives us some insight as to what they were discussing, and what they were discussing were events that took place over 20 years ago. Notice with me that Joseph will keep it in context in verse 18, after these three days, he says, and Joseph said unto them, the third day, this do and live, and then notice this phrase, for I fear God, wow, now think about it, Jacob sent his boys from Canaan to Egypt, no doubt they had preconceived ideas about the Egyptians, about their religion, about their polytheism, and all of the things that they would be exposed to and would deal with, and then as they're standing there, speaking to the governor of the country, the one who's in charge, he calls them out of prison on the third day and says, for I fear God. Wow, I believe God is working in the lives of these boys, and God is going to continue as we look through this portion of scripture, how God is working and moving, he says this, Joseph to his brothers in verse 19, if ye be true men, let one of your brethren be bound in the house of your prison, go ye, carry corn for the famine of your houses, but bring your youngest brother unto me, so shall your words be verified, and ye shall not die, and they did so. And then verse 21, it says, and they said one to another, notice what they say, we find that Simeon remains in jail, and we'll look through here, but notice in verse 21, as they wander off, as they leave from the presence of Joseph, they leave and the Bible says that they say, we are guilty concerning our brother. Why did they have that thought? Conviction, God was at work, nothing was said about what they did to Joseph, nothing was said, there was no insight that this was Joseph that they were speaking to, it was God working through these circumstances, it was God working to bring conviction in the lives of these boys, why? Because ultimately, God wants to bring them back to himself. That's what God's doing, and as they leave, listen, nothing is said about Joseph, the only thing that's said about Joseph and one is not, and they say, we are guilty, we are guilty, we are guilty about what? Our brother, we are guilty concerning our brother. I think for 20 long years, these things, it haunted them, it haunted them what they did, why? Because they never got it right, they never dealt with it. I don't know how many times Jacob might have said something about Joseph, and every time Dad would say something about Joseph, how do you think the 10 brothers feel? They knew the truth, they knew what they did. How do you think they felt when they saw Jacob bereaving his son, I mean, he's weeping, no doubt. I want you to think about it tonight, listen, there are, and I know that the Bible doesn't tell us all of this, but you know as a human being, there are certain special events in your life, there are things that take place in your life that remind us, that trigger things in our lives, maybe you've never heard of it, maybe you've never seen it, but it triggers things in our lives, maybe there's a special day, maybe it's a birthday, as we would celebrate if we think about our own culture and our own society, and you have a son who is not, what happens on the day of their birth? You think about that, do you not? And when you think about that, perhaps you talk about that, and those brothers that are under conviction, and now they're standing there, listen, all they wanted to do was buy food, but God was working, God was working, God knew where they were, God had orchestrated some events, why? Because our God is a sovereign God, and he had worked in such a way to elevate Joseph to a place of prominence and of position, and he had worked so that this famine would affect not only Egypt, but also Canaan, and all these other lands were impacted, and now the brothers come, and they say, we are guilty concerning our brother, and that we saw, notice the rest of verse 21, we saw the anguish of his soul when he besought us, and we would not hear, therefore is this distress come upon us. I believe that these brothers were convinced that the reason for their trouble was rooted in what happened 20 years earlier. Do you not, when you read verse 21? I mean, no one had to convince them of it. You know who was working? God, God was working. It's amazing, sometimes I'll preach a message, and someone will say something, and I'm like, I don't even think I said anything about that. It really wasn't even something that was part of the message, but you know what happened? God was at work, God was moving, God was working. I've sat in preaching services, I've sat and I've listened to preaching, and God will trigger through something that is said, a verse that I read, another thought, and I'll go over, and maybe I'll miss the next few sentences that the preacher says, but God's working in my life, and that's how God works. A journey that was expected to simply go and buy some corn and go home to provide food for the family. God is at work, God is at work. Notice the Bible says in verse 22, and Reuben answered, he answered them saying, spake I not unto you, saying, do not sin against the child, and you would not hear. Therefore, behold, also, his blood is required. I mean, the conversation continues. Reuben, he's going back, listen, he remembers with clarity the conversation that had taken place. Remember, Reuben was the one that went back to the pit, and Joseph wasn't there, because they sold him into slavery, and we find here in verse 23, and they knew not that Joseph understood them, for he spake unto them by an interpreter. Joseph is standing there hearing all of this. He's hearing this conversation between his brothers. He's hearing, listen, he didn't bring it up. It's an awesome thing when God works. Sometimes a preacher gets accused of, you're preaching that because you knew this was going on, and so on and so forth. Listen, if you preach the whole counsel of God, you just let God work, honestly. And when God works, you just sit back and say, look at what God was doing. Listen, I think it was Brother Hummel, maybe it was Brother Mershon, talked about someone coming and saying, the preacher must have told you all about my life, because all you've done is preach about the things that I've been dealing with. He's like, I don't have any idea. God's dealing in your life. God's at work. Joseph didn't say anything about what happened 20 years ago, but those boys were under conviction, deep conviction. Notice in verse 24, and he turned himself about from them and wept. Joseph, again, remember we started out, God was at work in Joseph's life. He returned to them again and communed with them and took from them Simeon and bound him before their eyes. And Joseph commanded to fill their sacks with corn. Notice this, and to restore every man's money into a sack. To give them provision for the way. And thus did he unto them. And they laid their asses with the corn and departed thence. So we see what's happening. Simeon remains behind, nine of them are now going to travel back. And Joseph gives this instruction. Remember, he's the one in charge, he's the authority. And he commands that their sacks be filled with corn, but he also commands to restore every man's money, notice where, into a sack. He didn't just give the money back to them. He said, put it back in their sack. And we find that he also provided for them, for their journey to give them provision for the way. Verse 27, these nine brothers, Simeon is left in prison. The nine brothers, they journey. And it says, as one of them, we don't know which one, opened his sack to give his ass for vendor in the inn, he espied his money, for behold, it was in his sack's mouth. Now he knew that he had given the money. He knew that he bought the corn. And now he opens up to be able to give his animal, the provision, the food. And as he does so, he sees the money. Oh, praise the Lord, God gave us our money. That's not how they respond. It's not how they respond, why? Because God is at work. Notice in verse 28, and he said unto his brethren, my money is restored. But I think it was this kind of tone of, my money is restored? Like, what's going on? And lo, it is even in my sack. And their heart, notice what it says, failed them. Failed them. And they were afraid. Notice what they say to each other. What is this that God hath done unto us? God was at work. God was at work. And we find that in the lives of these brothers we see it very distinctly through these events that are recorded in Genesis 42 that God is working. Listen sometimes I've mentioned twice now and for a third time sometimes it's uncomfortable when God is at work. Sometimes it means we need to deal with things that quite honestly we just really don't want to deal with. You know what I mean by that? Sometimes we just rather not deal with stuff. But God says I'm working in your life. I want you to be right with me. We're going to observe the Lord's Supper tonight and only as God could do it. I had written on my calendar, my desk calendar that we'd observe the Lord's Supper tonight months ago. But I never communicated that to Holly to put in the bulletin. Yesterday morning I was praying and God impressed upon my heart hey we've got to do the Lord's Supper tomorrow night. I was like man I didn't tell Holly about it. We're in the middle. We're going to have the open house yesterday. And then someone asked me yesterday they said hey when, how often do you observe the Lord's Supper? I was like actually tomorrow night we're observing the Lord's Supper. We talk about self-examination. We talk about the process when the Bible says let a man examine himself. We sing the song nothing between my soul and my Savior. And we think about this process of God being at work. I often say when we deal with the subject of self-examination that it requires both humility and honesty. Here's the reality of life. The reality of life is that I would rather inspect Armando and Armando would rather inspect me. That's the reality of life. Why? Because it's a hard thing to inspect yourself, to examine yourself. You know why? We think we're better than we are. We think we really don't have any problems. We think we've got it all together. But then God starts working. That bitterness, lack of forgiveness, that contention, unresolved. I mean you just go down a list. I'm not going to go down through a list tonight. I'm just going to mention a few things. But the reality is that God is working. Listen this was something that happened 20 years earlier. I think that the brothers probably tried to suppress it as much as they possibly could. Isn't that what we try to do? Try to suppress those things. Try to suppress them. But you know what God does? He brings it right to the forefront. We can deal with this. I can handle this. I'm thankful that God was working locally and globally but God was working personally. Our God is a personal God. And He works in the lives of His people. And as we allow Him to have His way, as we say as the psalmist does in Psalm 139, God search me oh God. Search me oh God. And show me if there be any wicked way in my life. Right? That's what the Bible teaches us. That process of self-examination. And so we find that God is working in the lives of these brothers. They say what is this that God hath done unto us? Surely we are guilty concerning our brother. And they understand what is taking place and how God is working. God is at work in the life of Joseph. God is at work in the lives of the ten brothers. I believe that God is at work in Jacob's life. Look at verse 29. And they, nine of them, He sent ten out. And they, nine of them, came unto Jacob their father unto the land of Canaan. And notice what the next phrase says. And told him all that befell unto them. They didn't just come back with some food. They came back with a story. With an account of what took place. Here's what happened. Dad you sent us there. We came back with food but a whole lot more. Now they don't reveal everything to Jacob. They don't reveal to Jacob at this particular juncture. We don't, we see that not a place here where they reveal what they have done and really the conviction that they're dealing with. Why? They don't want to tell Jacob. So we find that the, verse number 30, the man who is the Lord of the land. Now who is that? That's Joseph. That's their younger brother. That's the one who is not. According to what they say in verse number 13, and one is not, the man, the ruler of the land, he is Joseph. And it says the man who is the Lord of the land spake roughly to us and took us for spies of the country. And we said unto him, we are true men, we are no spies. We be twelve brethren, sons of our father. One is not, that's Joseph. And the youngest is this day with our father in the land of Canaan. The man, the Lord of the country said unto us, hereby shall I know that you are true men. Leave one of your brethren here with me and take food for the famine of your households and be gone. And bring your youngest brother unto me. Then shall I know that you are no spies, but you are true men. So will I deliver you your brother, that's Simeon, and ye shall traffic in the land. In other words, they'd be able to come back and forth and receive the goods, the food that they would need during the time of famine. Joseph was the one that knew it was going to be seven years long. We don't know at this particular time exactly how much time has passed. You can kind of guess at it. But the reality is that we find that when later on, when Joseph is revealing to his brothers what was going on, he says in verse number 6 of chapter 45, for these two years hath the famine been in the land. And so this is very early with regard to the seven years of famine. And so he tells them, he gives the plan, and now the boys are telling dad, these nine, verse 35, and it came to pass as they emptied their sacks, that behold, every man's bundle of money was in his sack. And when both they and their father saw the bundles of money, they were afraid. And Jacob, their father, said unto them, Me have ye bereaved of my children. Notice where he says, Joseph is not. He's dead in his mind. Simeon is not. He's in prison in Egypt, right? And ye will take Benjamin away. All these things are against me. You know, Jacob, God was working in his life too. God was working in Jacob's life. Reuben spake unto his father, saying, Slay my two sons, if I bring them not to thee. Deliver him into my hand, and I will bring him to thee again. Now obviously Reuben had no way of being able to really guarantee that he'd be able to do that, but that's what he says. In verse 38, he said, My son shall not go down with you. For his brother is dead, and he is left alone. If mischief befall him by the way, and the witchy go, then shall ye bring down my gray hairs with sorrow to the grave. Listen, God's working in Jacob's life. Jacob needs to learn to trust the Lord. Jacob needs to learn some things about who God is and what God is able to do. In fact, as you fast forward through the life of Joseph in the next several chapters, you find that it's reported that Joseph is alive. He makes himself known to his brothers, and that news gets back to Jacob, and Jacob then will journey to go into Egypt. But before we get too far ahead of ourselves, we understand that God is working personally in Genesis chapter 42. I wonder this evening, as we look at this portion of Scripture and we see the dialogue, we see the account, the events as they unfold on this first visit to Egypt. So much more than what these 10 brothers expected. I don't think for a moment they were thinking God was going to convict them, deal with them in this manner. But I wonder as I look at this portion of Scripture, I'm amazed by the sensitivity of them recognizing that God was at work. Think about it this way with me. Sometimes we deal with circumstances and situations and we say, well, it's just bad luck, just misfortune, just this thing happened. You know, these boys, I don't think they were very close to God, but you know their immediate response? God is at work. What is this that God hath done unto us? I wonder tonight, how quick are we to acknowledge God working in our lives? When that circumstance, whatever it might be, when this thing happens in your life and in my life, we know, listen, we know that God is sovereign. We know that God is a pursuing God. God is an intimate, personal God. We can stand here and say, I want to be right with God. God wants you to be right with Him more than you could ever want to be right with God. I believe that with all my heart tonight. Draw an eye unto God and He'll draw an eye unto you. Amen? And I wonder tonight when that thing happens in my life and in your life, do we recognize it as being the hand of God? Do we examine our lives and say, what is God trying to teach me through this? How is God trying to grow me through this? this? How's God going to use me through this? Or do we just write it off as some kind of bad misfortune, bad luck, whatever word we want to use to just kind of again continue to suppress something? You understand what I'm saying tonight? These boys, God is at work. What has God done to us? And I just wonder tonight, how's God working in our lives? Do you see God working in your life? Do you hear the voice of God when you read the Bible, when you come to church, when you hear the preaching of God's word? Is God working in your life? Are there some things that God's putting his finger on? And maybe we don't like it. Maybe we don't want to deal with it. But God's at work. And God's going to continue to pursue. God's going to continue to pursue. And God wants you to not have a hard heart, but to have a tender heart. He doesn't want us to be hardened, but to be softened, to be tender. And this evening, as we look at Genesis chapter 42, we see how God is working in the life of Joseph, the life of the brothers, the life of Jacob. I just believe tonight that God's working in our lives as well. And I wonder, are we able to recognize it? And how do we respond to it? What is God doing? How is God working? Will we let God be God and have his way? Let's pray together. Father, we love you. We thank you for loving us. God, we thank you for this portion of Scripture, for the opportunity to see how you're a personal God. Lord, I pray that in the quietness of the moment tonight, as we've heard the preaching of your word, as we have a time of invitation even in preparation for observing the Lord's Supper, God, I pray that you'd help us to examine ourselves. God, I pray that you'd help us to submit, to surrender to thee. Lord, I don't know how you're working in everyone's life. I believe that you are at work. And I know at times it's uncomfortable, it's difficult. But God, I pray that you'd help us to submit and surrender. God, we would see and acknowledge that you are at work. Would you have your will and way in these moments of invitation? Well, thank you for what you'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.159999847412109,
      "text": " 42, and I am thankful for the blessings of the Lord."
    },
    {
      "id": 1,
      "start": 4.159999847412109,
      "end": 5.800000190734863,
      "text": " Had a number of folks that were traveling"
    },
    {
      "id": 2,
      "start": 5.800000190734863,
      "end": 7.739999771118164,
      "text": " that God has brought back safely."
    },
    {
      "id": 3,
      "start": 7.739999771118164,
      "end": 9.239999771118164,
      "text": " Have some folks that continue to travel."
    },
    {
      "id": 4,
      "start": 9.239999771118164,
      "end": 10.4399995803833,
      "text": " Want you to pray for them."
    },
    {
      "id": 5,
      "start": 10.4399995803833,
      "end": 11.880000114440918,
      "text": " And then Brother Fernando,"
    },
    {
      "id": 6,
      "start": 11.880000114440918,
      "end": 15.600000381469727,
      "text": " his grandmother had surgery last evening"
    },
    {
      "id": 7,
      "start": 15.600000381469727,
      "end": 17.280000686645508,
      "text": " and he sent me a text."
    },
    {
      "id": 8,
      "start": 17.280000686645508,
      "end": 18.719999313354492,
      "text": " I mentioned this in Sunday School"
    },
    {
      "id": 9,
      "start": 18.719999313354492,
      "end": 21.280000686645508,
      "text": " and he sent me a text and we prayed"
    },
    {
      "id": 10,
      "start": 21.280000686645508,
      "end": 24.079999923706055,
      "text": " and we're thankful that that surgery went well"
    },
    {
      "id": 11,
      "start": 24.079999923706055,
      "end": 25.68000030517578,
      "text": " and she's recovering well"
    },
    {
      "id": 12,
      "start": 25.68000030517578,
      "end": 27.559999465942383,
      "text": " and so we praise the Lord for that."
    },
    {
      "id": 13,
      "start": 27.559999465942383,
      "end": 29.959999084472656,
      "text": " And it's amazing our God does here"
    },
    {
      "id": 14,
      "start": 29.959999084472656,
      "end": 31.31999969482422,
      "text": " and answer prayer, amen."
    },
    {
      "id": 15,
      "start": 31.31999969482422,
      "end": 34.15999984741211,
      "text": " And every time we go to the Lord in prayer,"
    },
    {
      "id": 16,
      "start": 34.15999984741211,
      "end": 36.279998779296875,
      "text": " we have that confidence knowing that he hears us"
    },
    {
      "id": 17,
      "start": 36.279998779296875,
      "end": 39.279998779296875,
      "text": " and that he's able and we certainly are encouraged"
    },
    {
      "id": 18,
      "start": 39.279998779296875,
      "end": 40.880001068115234,
      "text": " each time he answers prayer."
    },
    {
      "id": 19,
      "start": 40.880001068115234,
      "end": 43.15999984741211,
      "text": " Genesis chapter 42 this evening"
    },
    {
      "id": 20,
      "start": 43.15999984741211,
      "end": 45.2400016784668,
      "text": " and we'll look at the entire chapter."
    },
    {
      "id": 21,
      "start": 45.2400016784668,
      "end": 47.0,
      "text": " Genesis 42, one through 38."
    },
    {
      "id": 22,
      "start": 47.0,
      "end": 49.959999084472656,
      "text": " I'm not gonna read the entire text this evening."
    },
    {
      "id": 23,
      "start": 49.959999084472656,
      "end": 52.0,
      "text": " I'm gonna just kind of jump through the text"
    },
    {
      "id": 24,
      "start": 52.0,
      "end": 53.7599983215332,
      "text": " of scripture this evening"
    },
    {
      "id": 25,
      "start": 53.7599983215332,
      "end": 55.619998931884766,
      "text": " as we deal with this subject matter."
    },
    {
      "id": 26,
      "start": 55.619998931884766,
      "end": 58.84000015258789,
      "text": " But notice beginning in verse number one in Genesis 42,"
    },
    {
      "id": 27,
      "start": 58.84000015258789,
      "end": 59.68000030517578,
      "text": " the Bible says,"
    },
    {
      "id": 28,
      "start": 59.68000030517578,
      "end": 63.68000030517578,
      "text": " now when Jacob saw that there was corn in Egypt,"
    },
    {
      "id": 29,
      "start": 63.68000030517578,
      "end": 65.12000274658203,
      "text": " Jacob said unto his sons,"
    },
    {
      "id": 30,
      "start": 65.12000274658203,
      "end": 67.4000015258789,
      "text": " why do you look one upon another?"
    },
    {
      "id": 31,
      "start": 67.4000015258789,
      "end": 68.23999786376953,
      "text": " And he said, behold,"
    },
    {
      "id": 32,
      "start": 68.23999786376953,
      "end": 70.19999694824219,
      "text": " I have heard that there's corn in Egypt."
    },
    {
      "id": 33,
      "start": 70.19999694824219,
      "end": 73.5999984741211,
      "text": " Get you down thither and buy for us from fence"
    },
    {
      "id": 34,
      "start": 73.5999984741211,
      "end": 77.31999969482422,
      "text": " that we may live and not die."
    },
    {
      "id": 35,
      "start": 77.31999969482422,
      "end": 81.36000061035156,
      "text": " And Joseph's 10 brethren went down to buy corn in Egypt."
    },
    {
      "id": 36,
      "start": 81.36000061035156,
      "end": 83.08000183105469,
      "text": " But Benjamin, Joseph's brother,"
    },
    {
      "id": 37,
      "start": 83.08000183105469,
      "end": 85.55999755859375,
      "text": " Jacob sent not with his brethren"
    },
    {
      "id": 38,
      "start": 85.55999755859375,
      "end": 88.5999984741211,
      "text": " for he said, lest peradventure mischief"
    },
    {
      "id": 39,
      "start": 89.27999877929688,
      "end": 90.12000274658203,
      "text": " befall him."
    },
    {
      "id": 40,
      "start": 90.12000274658203,
      "end": 91.91999816894531,
      "text": " The sons of Israel came to buy corn"
    },
    {
      "id": 41,
      "start": 91.91999816894531,
      "end": 94.4800033569336,
      "text": " among those that came for the famine"
    },
    {
      "id": 42,
      "start": 94.4800033569336,
      "end": 97.12000274658203,
      "text": " was in the land of Canaan."
    },
    {
      "id": 43,
      "start": 97.12000274658203,
      "end": 98.95999908447266,
      "text": " We'll dig in further through the text"
    },
    {
      "id": 44,
      "start": 98.95999908447266,
      "end": 101.95999908447266,
      "text": " as we study through this portion of scripture this evening."
    },
    {
      "id": 45,
      "start": 101.95999908447266,
      "end": 104.44000244140625,
      "text": " But you understand that the seven years of great plenty"
    },
    {
      "id": 46,
      "start": 104.44000244140625,
      "end": 107.80000305175781,
      "text": " had ended and the seven years of dearth began"
    },
    {
      "id": 47,
      "start": 107.80000305175781,
      "end": 109.95999908447266,
      "text": " according to the end of chapter number 41"
    },
    {
      "id": 48,
      "start": 109.95999908447266,
      "end": 111.31999969482422,
      "text": " of the book of Genesis."
    },
    {
      "id": 49,
      "start": 111.31999969482422,
      "end": 113.4000015258789,
      "text": " We find that Joseph was diligent"
    },
    {
      "id": 50,
      "start": 113.4000015258789,
      "end": 115.83999633789062,
      "text": " during those seven years of great plenty."
    },
    {
      "id": 51,
      "start": 115.83999633789062,
      "end": 118.36000061035156,
      "text": " And we find that because of his diligence"
    },
    {
      "id": 52,
      "start": 119.12000274658203,
      "end": 120.5999984741211,
      "text": " and his obedience to follow that"
    },
    {
      "id": 53,
      "start": 120.5999984741211,
      "end": 122.91999816894531,
      "text": " which God had revealed to him,"
    },
    {
      "id": 54,
      "start": 122.91999816894531,
      "end": 126.68000030517578,
      "text": " we find that there was food in Egypt."
    },
    {
      "id": 55,
      "start": 126.68000030517578,
      "end": 128.67999267578125,
      "text": " Now we understand that as we look at this"
    },
    {
      "id": 56,
      "start": 128.67999267578125,
      "end": 130.36000061035156,
      "text": " and dig into chapter number 42,"
    },
    {
      "id": 57,
      "start": 130.36000061035156,
      "end": 133.47999572753906,
      "text": " it says now when Jacob saw that there was corn in Egypt."
    },
    {
      "id": 58,
      "start": 133.47999572753906,
      "end": 136.0800018310547,
      "text": " And so we find that as we back up just a little bit"
    },
    {
      "id": 59,
      "start": 136.0800018310547,
      "end": 138.63999938964844,
      "text": " into chapter 41, by way of introduction,"
    },
    {
      "id": 60,
      "start": 138.63999938964844,
      "end": 141.52000427246094,
      "text": " we find that the Bible tells us in verse number 54,"
    },
    {
      "id": 61,
      "start": 141.52000427246094,
      "end": 144.27999877929688,
      "text": " notice of chapter 41, verse 54."
    },
    {
      "id": 62,
      "start": 144.27999877929688,
      "end": 147.75999450683594,
      "text": " And the seven years of dearth began to come"
    },
    {
      "id": 63,
      "start": 147.8000030517578,
      "end": 150.1199951171875,
      "text": " according as Joseph had said,"
    },
    {
      "id": 64,
      "start": 150.1199951171875,
      "end": 153.83999633789062,
      "text": " and the dearth was in all lands."
    },
    {
      "id": 65,
      "start": 153.83999633789062,
      "end": 157.0800018310547,
      "text": " But in the land of Egypt, there was bread."
    },
    {
      "id": 66,
      "start": 157.0800018310547,
      "end": 158.8000030517578,
      "text": " Again, you see in verse number 57,"
    },
    {
      "id": 67,
      "start": 158.8000030517578,
      "end": 161.0399932861328,
      "text": " notice it says in all countries"
    },
    {
      "id": 68,
      "start": 161.0399932861328,
      "end": 165.0,
      "text": " came into Egypt to Joseph for to buy corn."
    },
    {
      "id": 69,
      "start": 165.0,
      "end": 165.83999633789062,
      "text": " Why?"
    },
    {
      "id": 70,
      "start": 165.83999633789062,
      "end": 169.3000030517578,
      "text": " Because the famine was so sore in all lands."
    },
    {
      "id": 71,
      "start": 169.3000030517578,
      "end": 172.8000030517578,
      "text": " We find that there in chapter number 42"
    },
    {
      "id": 72,
      "start": 172.8000030517578,
      "end": 175.1999969482422,
      "text": " in verse number five, at the end of the verse,"
    },
    {
      "id": 73,
      "start": 175.1999969482422,
      "end": 179.0399932861328,
      "text": " it says that the famine was in the land of Canaan as well."
    },
    {
      "id": 74,
      "start": 179.0399932861328,
      "end": 182.1199951171875,
      "text": " And so we find that as we look at this portion of scripture,"
    },
    {
      "id": 75,
      "start": 182.1199951171875,
      "end": 184.1999969482422,
      "text": " I've titled the message this evening,"
    },
    {
      "id": 76,
      "start": 184.1999969482422,
      "end": 188.36000061035156,
      "text": " Joseph's brethren went down to buy corn in Egypt."
    },
    {
      "id": 77,
      "start": 188.36000061035156,
      "end": 190.36000061035156,
      "text": " And you see that in verse number three,"
    },
    {
      "id": 78,
      "start": 190.36000061035156,
      "end": 193.27999877929688,
      "text": " and we find that throughout this passage of scripture"
    },
    {
      "id": 79,
      "start": 193.27999877929688,
      "end": 196.5800018310547,
      "text": " that God records for us this journey"
    },
    {
      "id": 80,
      "start": 196.5800018310547,
      "end": 200.8000030517578,
      "text": " that these 10 brothers took from Canaan to Egypt"
    },
    {
      "id": 81,
      "start": 200.8000030517578,
      "end": 204.36000061035156,
      "text": " for the purpose of getting food, of buying corn."
    },
    {
      "id": 82,
      "start": 204.44000244140625,
      "end": 207.16000366210938,
      "text": " And we find that as God would rehearse for us"
    },
    {
      "id": 83,
      "start": 207.16000366210938,
      "end": 209.60000610351562,
      "text": " the account as it takes place,"
    },
    {
      "id": 84,
      "start": 209.60000610351562,
      "end": 211.63999938964844,
      "text": " that these 10 brothers, of course,"
    },
    {
      "id": 85,
      "start": 211.63999938964844,
      "end": 214.27999877929688,
      "text": " they meet their brother, Joseph."
    },
    {
      "id": 86,
      "start": 214.27999877929688,
      "end": 217.8800048828125,
      "text": " Their brother who they had sold into slavery,"
    },
    {
      "id": 87,
      "start": 217.8800048828125,
      "end": 221.52000427246094,
      "text": " their brother that nearly 20 years had passed"
    },
    {
      "id": 88,
      "start": 221.52000427246094,
      "end": 223.67999267578125,
      "text": " since the last time they had seen him."
    },
    {
      "id": 89,
      "start": 223.67999267578125,
      "end": 225.4199981689453,
      "text": " And we find that Joseph now"
    },
    {
      "id": 90,
      "start": 225.4199981689453,
      "end": 228.27999877929688,
      "text": " is in this elevated position of leadership."
    },
    {
      "id": 91,
      "start": 228.27999877929688,
      "end": 230.16000366210938,
      "text": " We've studied through the book of Genesis."
    },
    {
      "id": 92,
      "start": 230.16000366210938,
      "end": 232.44000244140625,
      "text": " We've understood the things that have taken place."
    },
    {
      "id": 93,
      "start": 232.52000427246094,
      "end": 234.9199981689453,
      "text": " And we find that now these brothers,"
    },
    {
      "id": 94,
      "start": 234.9199981689453,
      "end": 238.3000030517578,
      "text": " because of what Jacob understood to be true,"
    },
    {
      "id": 95,
      "start": 238.3000030517578,
      "end": 240.55999755859375,
      "text": " in verse number one of chapter 42,"
    },
    {
      "id": 96,
      "start": 240.55999755859375,
      "end": 242.47999572753906,
      "text": " the Bible says that Jacob saw"
    },
    {
      "id": 97,
      "start": 242.47999572753906,
      "end": 243.9600067138672,
      "text": " that there was corn in Egypt."
    },
    {
      "id": 98,
      "start": 243.9600067138672,
      "end": 246.9600067138672,
      "text": " In chapter 42 in verse number two,"
    },
    {
      "id": 99,
      "start": 246.9600067138672,
      "end": 250.67999267578125,
      "text": " it says that Jacob heard there was corn in Egypt."
    },
    {
      "id": 100,
      "start": 250.67999267578125,
      "end": 253.72000122070312,
      "text": " And so Jacob, upon understanding"
    },
    {
      "id": 101,
      "start": 253.72000122070312,
      "end": 256.3399963378906,
      "text": " the fact that there was a source of food"
    },
    {
      "id": 102,
      "start": 256.3399963378906,
      "end": 258.8800048828125,
      "text": " and understanding the circumstances"
    },
    {
      "id": 103,
      "start": 258.8800048828125,
      "end": 259.79998779296875,
      "text": " in which they were facing,"
    },
    {
      "id": 104,
      "start": 260.0400085449219,
      "end": 263.55999755859375,
      "text": " it was a real bad time"
    },
    {
      "id": 105,
      "start": 263.55999755859375,
      "end": 265.32000732421875,
      "text": " because of this great dearth"
    },
    {
      "id": 106,
      "start": 265.32000732421875,
      "end": 267.4800109863281,
      "text": " that had came upon the land."
    },
    {
      "id": 107,
      "start": 267.4800109863281,
      "end": 269.20001220703125,
      "text": " And notice at the end of verse number two,"
    },
    {
      "id": 108,
      "start": 269.20001220703125,
      "end": 272.67999267578125,
      "text": " he says that we may live and not die."
    },
    {
      "id": 109,
      "start": 272.67999267578125,
      "end": 274.4200134277344,
      "text": " That gives us some insight"
    },
    {
      "id": 110,
      "start": 274.4200134277344,
      "end": 276.239990234375,
      "text": " with regard to the conditions"
    },
    {
      "id": 111,
      "start": 276.239990234375,
      "end": 278.2799987792969,
      "text": " and how bad it really was."
    },
    {
      "id": 112,
      "start": 278.2799987792969,
      "end": 279.8800048828125,
      "text": " And so we find that Jacob,"
    },
    {
      "id": 113,
      "start": 279.8800048828125,
      "end": 281.6000061035156,
      "text": " understanding all of these things"
    },
    {
      "id": 114,
      "start": 281.6000061035156,
      "end": 283.239990234375,
      "text": " and what he was experiencing,"
    },
    {
      "id": 115,
      "start": 283.239990234375,
      "end": 285.239990234375,
      "text": " we find that he sends his boys,"
    },
    {
      "id": 116,
      "start": 285.239990234375,
      "end": 287.6000061035156,
      "text": " these 10 sons, to Egypt."
    },
    {
      "id": 117,
      "start": 287.6000061035156,
      "end": 289.55999755859375,
      "text": " He did not send Benjamin, the youngest."
    },
    {
      "id": 118,
      "start": 289.55999755859375,
      "end": 290.3999938964844,
      "text": " Why?"
    },
    {
      "id": 119,
      "start": 290.3999938964844,
      "end": 292.239990234375,
      "text": " Well, because he'd already lost Joseph"
    },
    {
      "id": 120,
      "start": 292.239990234375,
      "end": 293.8999938964844,
      "text": " and he did not want any mischief"
    },
    {
      "id": 121,
      "start": 293.8999938964844,
      "end": 295.760009765625,
      "text": " to fall upon Benjamin."
    },
    {
      "id": 122,
      "start": 295.760009765625,
      "end": 297.44000244140625,
      "text": " In his mind, remember,"
    },
    {
      "id": 123,
      "start": 297.44000244140625,
      "end": 300.9599914550781,
      "text": " Jacob had every part of his being"
    },
    {
      "id": 124,
      "start": 300.9599914550781,
      "end": 303.79998779296875,
      "text": " believe that Joseph was killed."
    },
    {
      "id": 125,
      "start": 303.79998779296875,
      "end": 305.32000732421875,
      "text": " When his brothers came back"
    },
    {
      "id": 126,
      "start": 305.32000732421875,
      "end": 307.32000732421875,
      "text": " and they said, hey, we found this."
    },
    {
      "id": 127,
      "start": 307.32000732421875,
      "end": 308.4200134277344,
      "text": " Do you know whose this is?"
    },
    {
      "id": 128,
      "start": 308.4200134277344,
      "end": 309.6199951171875,
      "text": " What was it that they showed him?"
    },
    {
      "id": 129,
      "start": 309.6199951171875,
      "end": 311.1400146484375,
      "text": " The coat of many colors"
    },
    {
      "id": 130,
      "start": 311.1400146484375,
      "end": 313.44000244140625,
      "text": " that Jacob had given to his son"
    },
    {
      "id": 131,
      "start": 313.44000244140625,
      "end": 315.3599853515625,
      "text": " and they had dipped it in blood."
    },
    {
      "id": 132,
      "start": 315.3599853515625,
      "end": 316.4800109863281,
      "text": " Remember, they killed an animal,"
    },
    {
      "id": 133,
      "start": 316.4800109863281,
      "end": 317.44000244140625,
      "text": " they dipped it in blood"
    },
    {
      "id": 134,
      "start": 318.2799987792969,
      "end": 319.1199951171875,
      "text": " and they said, we found this."
    },
    {
      "id": 135,
      "start": 319.1199951171875,
      "end": 320.5199890136719,
      "text": " And what did Jacob believe?"
    },
    {
      "id": 136,
      "start": 320.5199890136719,
      "end": 323.0400085449219,
      "text": " A wild beast hath devoured him."
    },
    {
      "id": 137,
      "start": 323.0400085449219,
      "end": 325.0,
      "text": " He believed that he was dead."
    },
    {
      "id": 138,
      "start": 325.0,
      "end": 326.760009765625,
      "text": " And the brothers, his sons,"
    },
    {
      "id": 139,
      "start": 326.760009765625,
      "end": 330.79998779296875,
      "text": " his own sons allowed him to believe that lie."
    },
    {
      "id": 140,
      "start": 332.0400085449219,
      "end": 334.760009765625,
      "text": " And now we find that we come to chapter 42."
    },
    {
      "id": 141,
      "start": 334.760009765625,
      "end": 336.260009765625,
      "text": " So many, I mean, 20 years,"
    },
    {
      "id": 142,
      "start": 336.260009765625,
      "end": 339.5199890136719,
      "text": " at least a minimum of 20 years has passed"
    },
    {
      "id": 143,
      "start": 339.5199890136719,
      "end": 341.8399963378906,
      "text": " between the time in which Jacob,"
    },
    {
      "id": 144,
      "start": 341.8399963378906,
      "end": 345.3999938964844,
      "text": " his sons sold Joseph into slavery."
    },
    {
      "id": 145,
      "start": 345.44000244140625,
      "end": 348.5199890136719,
      "text": " And now as they're dealing with this great famine,"
    },
    {
      "id": 146,
      "start": 348.5199890136719,
      "end": 351.8399963378906,
      "text": " and we find that as we read through Genesis chapter 42,"
    },
    {
      "id": 147,
      "start": 351.8399963378906,
      "end": 353.6000061035156,
      "text": " that as we look at the dialogue"
    },
    {
      "id": 148,
      "start": 353.6000061035156,
      "end": 356.6400146484375,
      "text": " that God provides of this record and this account"
    },
    {
      "id": 149,
      "start": 356.6400146484375,
      "end": 359.32000732421875,
      "text": " and all the interactions that take place,"
    },
    {
      "id": 150,
      "start": 359.32000732421875,
      "end": 364.32000732421875,
      "text": " really what we find is that God is at work."
    },
    {
      "id": 151,
      "start": 364.3999938964844,
      "end": 366.2799987792969,
      "text": " God is working."
    },
    {
      "id": 152,
      "start": 366.2799987792969,
      "end": 369.4800109863281,
      "text": " In fact, as we look at this portion of scripture"
    },
    {
      "id": 153,
      "start": 369.4800109863281,
      "end": 371.239990234375,
      "text": " and we look at the circumstances"
    },
    {
      "id": 154,
      "start": 371.239990234375,
      "end": 373.32000732421875,
      "text": " that are recorded here in Genesis 42,"
    },
    {
      "id": 155,
      "start": 373.32000732421875,
      "end": 378.32000732421875,
      "text": " it really reminds us that God is always at work."
    },
    {
      "id": 156,
      "start": 379.20001220703125,
      "end": 380.8399963378906,
      "text": " God is always at work."
    },
    {
      "id": 157,
      "start": 380.8399963378906,
      "end": 383.94000244140625,
      "text": " We may not recognize it, we may not see it,"
    },
    {
      "id": 158,
      "start": 383.94000244140625,
      "end": 388.94000244140625,
      "text": " but we can rest assured that God is always at work."
    },
    {
      "id": 159,
      "start": 389.3399963378906,
      "end": 392.55999755859375,
      "text": " And we find that as we look at this portion of scripture,"
    },
    {
      "id": 160,
      "start": 392.55999755859375,
      "end": 395.05999755859375,
      "text": " I'm going to deal with two thoughts very quickly"
    },
    {
      "id": 161,
      "start": 395.05999755859375,
      "end": 397.20001220703125,
      "text": " so that we can spend the bulk of our time"
    },
    {
      "id": 162,
      "start": 397.20001220703125,
      "end": 399.239990234375,
      "text": " on my final thought this evening."
    },
    {
      "id": 163,
      "start": 399.239990234375,
      "end": 401.6000061035156,
      "text": " But when I think about looking at Genesis 42"
    },
    {
      "id": 164,
      "start": 401.6000061035156,
      "end": 404.0799865722656,
      "text": " and consider the fact that God is at work,"
    },
    {
      "id": 165,
      "start": 404.0799865722656,
      "end": 407.6400146484375,
      "text": " we notice first of all, God is working locally."
    },
    {
      "id": 166,
      "start": 407.6400146484375,
      "end": 409.1199951171875,
      "text": " When I say that he's working locally,"
    },
    {
      "id": 167,
      "start": 409.1199951171875,
      "end": 411.4800109863281,
      "text": " I'm saying he's working in Egypt."
    },
    {
      "id": 168,
      "start": 411.4800109863281,
      "end": 414.20001220703125,
      "text": " Joseph was there, and you understand all the circumstances"
    },
    {
      "id": 169,
      "start": 414.20001220703125,
      "end": 416.8800048828125,
      "text": " with regard to the previous chapters"
    },
    {
      "id": 170,
      "start": 416.8800048828125,
      "end": 419.0799865722656,
      "text": " and all that we've studied in the life of Joseph,"
    },
    {
      "id": 171,
      "start": 419.0799865722656,
      "end": 421.3999938964844,
      "text": " and we see how God is working."
    },
    {
      "id": 172,
      "start": 421.3999938964844,
      "end": 424.239990234375,
      "text": " God had given Joseph the opportunity,"
    },
    {
      "id": 173,
      "start": 424.239990234375,
      "end": 426.79998779296875,
      "text": " the ability to be able to interpret the dream,"
    },
    {
      "id": 174,
      "start": 426.79998779296875,
      "end": 429.44000244140625,
      "text": " to be able to come up with a plan"
    },
    {
      "id": 175,
      "start": 429.44000244140625,
      "end": 431.67999267578125,
      "text": " so that there would be food in Egypt."
    },
    {
      "id": 176,
      "start": 431.67999267578125,
      "end": 434.9599914550781,
      "text": " God was at work in Egypt."
    },
    {
      "id": 177,
      "start": 434.9599914550781,
      "end": 437.20001220703125,
      "text": " God was at work, not only locally,"
    },
    {
      "id": 178,
      "start": 437.20001220703125,
      "end": 439.2799987792969,
      "text": " but God was working globally."
    },
    {
      "id": 179,
      "start": 439.2799987792969,
      "end": 441.9200134277344,
      "text": " We look at this particular portion of scripture,"
    },
    {
      "id": 180,
      "start": 441.9200134277344,
      "end": 445.4800109863281,
      "text": " and we find that this famine impacted more than just Egypt."
    },
    {
      "id": 181,
      "start": 445.4800109863281,
      "end": 447.7799987792969,
      "text": " It was Pharaoh that had the dream."
    },
    {
      "id": 182,
      "start": 447.7799987792969,
      "end": 451.6199951171875,
      "text": " It was Pharaoh that understood through this dream"
    },
    {
      "id": 183,
      "start": 451.6199951171875,
      "end": 455.32000732421875,
      "text": " that God gave, through Joseph's interpretation,"
    },
    {
      "id": 184,
      "start": 455.32000732421875,
      "end": 456.7200012207031,
      "text": " what was going to come"
    },
    {
      "id": 185,
      "start": 456.7200012207031,
      "end": 459.0199890136719,
      "text": " and how God was going to bring it to pass,"
    },
    {
      "id": 186,
      "start": 459.6199951171875,
      "end": 461.0199890136719,
      "text": " but understand that the famine impacted"
    },
    {
      "id": 187,
      "start": 461.0199890136719,
      "end": 462.0199890136719,
      "text": " more than just Egypt."
    },
    {
      "id": 188,
      "start": 462.0199890136719,
      "end": 464.17999267578125,
      "text": " In fact, it says in verse 57"
    },
    {
      "id": 189,
      "start": 464.17999267578125,
      "end": 466.8999938964844,
      "text": " that all countries came into Egypt."
    },
    {
      "id": 190,
      "start": 466.8999938964844,
      "end": 467.739990234375,
      "text": " Why?"
    },
    {
      "id": 191,
      "start": 467.739990234375,
      "end": 469.05999755859375,
      "text": " Because in Egypt, there was food,"
    },
    {
      "id": 192,
      "start": 469.05999755859375,
      "end": 472.4599914550781,
      "text": " and so God, listen, he knows where Jacob and the boys are."
    },
    {
      "id": 193,
      "start": 472.4599914550781,
      "end": 475.94000244140625,
      "text": " He knows that they're in Canaan, and God is working."
    },
    {
      "id": 194,
      "start": 475.94000244140625,
      "end": 478.17999267578125,
      "text": " He's working locally in Egypt."
    },
    {
      "id": 195,
      "start": 478.17999267578125,
      "end": 479.739990234375,
      "text": " He's working in Joseph's life."
    },
    {
      "id": 196,
      "start": 479.739990234375,
      "end": 482.0,
      "text": " He's working through those circumstances there,"
    },
    {
      "id": 197,
      "start": 482.0,
      "end": 486.260009765625,
      "text": " but we find that he's working throughout the entire world,"
    },
    {
      "id": 198,
      "start": 486.260009765625,
      "end": 488.8599853515625,
      "text": " and we find that here, the entire known world,"
    },
    {
      "id": 199,
      "start": 489.70001220703125,
      "end": 491.8800048828125,
      "text": " and we find that this particular famine"
    },
    {
      "id": 200,
      "start": 491.8800048828125,
      "end": 494.05999755859375,
      "text": " had an impact there in Canaan."
    },
    {
      "id": 201,
      "start": 494.05999755859375,
      "end": 496.3800048828125,
      "text": " We see it in chapter 42 and verse number five."
    },
    {
      "id": 202,
      "start": 496.3800048828125,
      "end": 499.7799987792969,
      "text": " Also in chapter 46 and verse number 31,"
    },
    {
      "id": 203,
      "start": 499.7799987792969,
      "end": 501.5799865722656,
      "text": " the Bible plainly tells us"
    },
    {
      "id": 204,
      "start": 501.5799865722656,
      "end": 503.6600036621094,
      "text": " that Joseph said unto his brethren"
    },
    {
      "id": 205,
      "start": 503.6600036621094,
      "end": 505.6199951171875,
      "text": " and unto his father's house,"
    },
    {
      "id": 206,
      "start": 505.6199951171875,
      "end": 508.260009765625,
      "text": " I will go up and show Pharaoh and say unto him,"
    },
    {
      "id": 207,
      "start": 508.260009765625,
      "end": 509.8599853515625,
      "text": " my brethren in my father's house,"
    },
    {
      "id": 208,
      "start": 509.8599853515625,
      "end": 512.3400268554688,
      "text": " which are in the land of Canaan, are come unto me,"
    },
    {
      "id": 209,
      "start": 512.3400268554688,
      "end": 514.1400146484375,
      "text": " and so they came from Canaan."
    },
    {
      "id": 210,
      "start": 514.1400146484375,
      "end": 514.97998046875,
      "text": " Why?"
    },
    {
      "id": 211,
      "start": 514.97998046875,
      "end": 516.02001953125,
      "text": " Because there was a famine."
    },
    {
      "id": 212,
      "start": 517.02001953125,
      "end": 519.1400146484375,
      "text": " God's working locally."
    },
    {
      "id": 213,
      "start": 519.1400146484375,
      "end": 520.6599731445312,
      "text": " He's working globally,"
    },
    {
      "id": 214,
      "start": 520.6599731445312,
      "end": 523.1400146484375,
      "text": " but where I really wanna focus our attention this evening"
    },
    {
      "id": 215,
      "start": 523.1400146484375,
      "end": 525.3800048828125,
      "text": " and dig into this portion of Scripture"
    },
    {
      "id": 216,
      "start": 525.3800048828125,
      "end": 527.5,
      "text": " is that God is working personally."
    },
    {
      "id": 217,
      "start": 528.4199829101562,
      "end": 530.760009765625,
      "text": " Our God is a personal God."
    },
    {
      "id": 218,
      "start": 531.9400024414062,
      "end": 534.7000122070312,
      "text": " I'm thankful that God is at work in Egypt,"
    },
    {
      "id": 219,
      "start": 534.7000122070312,
      "end": 537.5800170898438,
      "text": " and God is at work throughout all of these lands"
    },
    {
      "id": 220,
      "start": 537.5800170898438,
      "end": 540.0599975585938,
      "text": " as we look in Genesis chapter number 42,"
    },
    {
      "id": 221,
      "start": 540.0599975585938,
      "end": 541.8200073242188,
      "text": " but the reality is that we see"
    },
    {
      "id": 222,
      "start": 541.8200073242188,
      "end": 544.1400146484375,
      "text": " as we dig into the portion of Scripture"
    },
    {
      "id": 223,
      "start": 544.1799926757812,
      "end": 548.0999755859375,
      "text": " that God is working in the lives of individuals,"
    },
    {
      "id": 224,
      "start": 548.0999755859375,
      "end": 551.1400146484375,
      "text": " and God still today, listen, God is working locally."
    },
    {
      "id": 225,
      "start": 551.1400146484375,
      "end": 553.1799926757812,
      "text": " God is working globally,"
    },
    {
      "id": 226,
      "start": 553.1799926757812,
      "end": 557.1400146484375,
      "text": " but the amazing truth of how God is at work"
    },
    {
      "id": 227,
      "start": 557.1400146484375,
      "end": 559.1400146484375,
      "text": " is that he's at work personally."
    },
    {
      "id": 228,
      "start": 559.1400146484375,
      "end": 561.260009765625,
      "text": " He's working in people's lives."
    },
    {
      "id": 229,
      "start": 561.260009765625,
      "end": 562.5800170898438,
      "text": " We may not always see it."
    },
    {
      "id": 230,
      "start": 562.5800170898438,
      "end": 565.02001953125,
      "text": " We may be praying, and we don't see the results,"
    },
    {
      "id": 231,
      "start": 565.02001953125,
      "end": 567.0599975585938,
      "text": " and we don't see how God is working,"
    },
    {
      "id": 232,
      "start": 567.0599975585938,
      "end": 568.5800170898438,
      "text": " but we can be confident,"
    },
    {
      "id": 233,
      "start": 568.5800170898438,
      "end": 572.6199951171875,
      "text": " and we can rest assured that God is at work."
    },
    {
      "id": 234,
      "start": 572.6599731445312,
      "end": 574.9400024414062,
      "text": " God is at work in our lives."
    },
    {
      "id": 235,
      "start": 574.9400024414062,
      "end": 577.3400268554688,
      "text": " As we dig through Genesis chapter 42,"
    },
    {
      "id": 236,
      "start": 577.3400268554688,
      "end": 579.3400268554688,
      "text": " and we begin to see how God is working"
    },
    {
      "id": 237,
      "start": 579.3400268554688,
      "end": 580.780029296875,
      "text": " and what God is doing,"
    },
    {
      "id": 238,
      "start": 580.780029296875,
      "end": 585.5800170898438,
      "text": " and how he, being an omnipresent God,"
    },
    {
      "id": 239,
      "start": 585.5800170898438,
      "end": 588.3800048828125,
      "text": " he's everywhere, but he's working"
    },
    {
      "id": 240,
      "start": 588.3800048828125,
      "end": 589.6599731445312,
      "text": " because he's a personal God."
    },
    {
      "id": 241,
      "start": 589.6599731445312,
      "end": 592.2999877929688,
      "text": " He's working in the lives of individuals."
    },
    {
      "id": 242,
      "start": 592.2999877929688,
      "end": 593.5800170898438,
      "text": " Can I say this this evening,"
    },
    {
      "id": 243,
      "start": 593.5800170898438,
      "end": 596.260009765625,
      "text": " even before we dig into the rest"
    },
    {
      "id": 244,
      "start": 596.260009765625,
      "end": 598.6199951171875,
      "text": " of the portion of Scripture tonight?"
    },
    {
      "id": 245,
      "start": 598.6199951171875,
      "end": 600.3400268554688,
      "text": " Sometimes when God is at work,"
    },
    {
      "id": 0,
      "start": 600.3400268554688,
      "end": 608.4600267410278,
      "text": " at work, it's uncomfortable. It's uncomfortable. Sometimes when God is at work, we might resist"
    },
    {
      "id": 1,
      "start": 608.4600267410278,
      "end": 615.3400268554688,
      "text": " it. We don't like it. You know, sometimes God is working and He's kind of peeling back"
    },
    {
      "id": 2,
      "start": 615.3400268554688,
      "end": 621.3800277709961,
      "text": " the layers of the skin of the onion, so to speak, to expose some things in our lives"
    },
    {
      "id": 3,
      "start": 621.3800277709961,
      "end": 626.8600273132324,
      "text": " that have to be dealt with. And you know, sometimes when God is at work, it's an uncomfortable"
    },
    {
      "id": 4,
      "start": 626.8600273132324,
      "end": 633.4400253295898,
      "text": " thing. And sometimes we don't really like it. But God is at work. We ought to rejoice"
    },
    {
      "id": 5,
      "start": 633.4400253295898,
      "end": 638.5000267028809,
      "text": " that God is at work. We ought to rejoice that God is interested in working in our lives"
    },
    {
      "id": 6,
      "start": 638.5000267028809,
      "end": 643.3400268554688,
      "text": " personally. We ought to rejoice when we come to the house of God and we hear the preaching"
    },
    {
      "id": 7,
      "start": 643.3400268554688,
      "end": 648.6200256347656,
      "text": " of God's Word. When we go in our daily devotions and we open up the Word of God and we begin"
    },
    {
      "id": 8,
      "start": 648.6200256347656,
      "end": 653.3400268554688,
      "text": " to read and God begins to prick our hearts through the personal reading, through the"
    },
    {
      "id": 9,
      "start": 653.3400268554688,
      "end": 658.2600250244141,
      "text": " public preaching, we ought to rejoice that God would work in our lives individually."
    },
    {
      "id": 10,
      "start": 658.2600250244141,
      "end": 662.6200256347656,
      "text": " It's a blessed thing. I've said, not recently, but I've said over the years that it's a good"
    },
    {
      "id": 11,
      "start": 662.6200256347656,
      "end": 673.2200241088867,
      "text": " thing when God's people deal with that circumstance in which we feel the preaching and God's Word"
    },
    {
      "id": 12,
      "start": 673.2200241088867,
      "end": 680.0400238037109,
      "text": " will bring in our lives some conviction. Conviction is a good thing. When my toes and your toes"
    },
    {
      "id": 13,
      "start": 680.0400238037109,
      "end": 685.3200302124023,
      "text": " are stepped on, it's a good thing because God's at work. Notice as we look at this portion"
    },
    {
      "id": 14,
      "start": 685.3200302124023,
      "end": 689.160026550293,
      "text": " of Scripture and consider that God is working personally, I would say, number one, that"
    },
    {
      "id": 15,
      "start": 689.160026550293,
      "end": 698.5200271606445,
      "text": " God is working in Joseph's life. God is working in Joseph's life. We find that Joseph is here."
    },
    {
      "id": 16,
      "start": 698.5200271606445,
      "end": 702.1400299072266,
      "text": " Notice we stopped reading in verse number five. Pick it up with me in verse number six"
    },
    {
      "id": 17,
      "start": 702.1400299072266,
      "end": 706.8000259399414,
      "text": " of Genesis 42. The Bible says, and Joseph was the governor over the land. Now we knew"
    },
    {
      "id": 18,
      "start": 706.8000259399414,
      "end": 711.7600250244141,
      "text": " that, did we not? We knew, based on studying through this portion of Scripture and studying"
    },
    {
      "id": 19,
      "start": 711.7600250244141,
      "end": 718.5600280761719,
      "text": " through the life of Joseph, we know that God elevated Joseph to a place of great authority."
    },
    {
      "id": 20,
      "start": 718.5600280761719,
      "end": 723.0800247192383,
      "text": " And we find that Joseph is the governor of the land. We understand that his brothers"
    },
    {
      "id": 21,
      "start": 723.0800247192383,
      "end": 729.1200256347656,
      "text": " have no clue that Joseph is the governor of the land. But Joseph is the governor of the"
    },
    {
      "id": 22,
      "start": 729.1200256347656,
      "end": 735.6800231933594,
      "text": " land and he it was that sold to all the people of the land. Now I want you in your minds"
    },
    {
      "id": 23,
      "start": 735.6800231933594,
      "end": 739.4400329589844,
      "text": " eye, we'll finish reading verse number six here in just a moment, but in your mind's"
    },
    {
      "id": 24,
      "start": 739.4400329589844,
      "end": 744.6800231933594,
      "text": " eye this evening, I want you to consider the busyness of where Joseph is. I want you to"
    },
    {
      "id": 25,
      "start": 744.6800231933594,
      "end": 750.4400329589844,
      "text": " understand the number of people that would be in and out trying to buy food. Listen,"
    },
    {
      "id": 26,
      "start": 750.4400329589844,
      "end": 754.9600219726562,
      "text": " if you're in a position in which there's a great famine, so much so that you're considering"
    },
    {
      "id": 27,
      "start": 754.9600219726562,
      "end": 760.1600341796875,
      "text": " that you're going to die as a result of this famine and you need food, it's going to be"
    },
    {
      "id": 28,
      "start": 760.1600341796875,
      "end": 765.2000274658203,
      "text": " a busy place. There are going to be a lot of people in and out trying to buy food, trying"
    },
    {
      "id": 29,
      "start": 765.2000274658203,
      "end": 770.4800262451172,
      "text": " to survive. And we find that the people, all the people of the land, they came there"
    },
    {
      "id": 30,
      "start": 770.4800262451172,
      "end": 775.0600280761719,
      "text": " to where Joseph was. In fact, in verse 57 of chapter 41, it says, and all countries"
    },
    {
      "id": 31,
      "start": 775.0600280761719,
      "end": 780.280029296875,
      "text": " came into Egypt to Joseph for to buy corn. Remember when the people, when the Egyptians"
    },
    {
      "id": 32,
      "start": 780.280029296875,
      "end": 787.2000274658203,
      "text": " cried to Pharaoh, we have no food. What did he say? Go to Joseph. God's working in Joseph's"
    },
    {
      "id": 33,
      "start": 787.2000274658203,
      "end": 793.7600250244141,
      "text": " life. Why do I say that? Well, look at the rest of verse number six. And Joseph's brethren"
    },
    {
      "id": 34,
      "start": 793.7600250244141,
      "end": 804.2000274658203,
      "text": " came. And Joseph's brethren came. And Joseph's brethren came. We read through the text and"
    },
    {
      "id": 35,
      "start": 804.2000274658203,
      "end": 808.8800201416016,
      "text": " we understand that Joseph recognizes who they are. They don't know who he is. But when I"
    },
    {
      "id": 36,
      "start": 808.8800201416016,
      "end": 814.8400268554688,
      "text": " think about Joseph's brothers coming and it says that they bowed down themselves before"
    },
    {
      "id": 37,
      "start": 814.8400268554688,
      "end": 823.5800323486328,
      "text": " him with their faces to the earth and Joseph saw his brethren and he knew them, but made"
    },
    {
      "id": 38,
      "start": 823.5800323486328,
      "end": 827.7400207519531,
      "text": " himself strange unto them and spake roughly unto them. And he said unto them, whence"
    },
    {
      "id": 39,
      "start": 827.7400207519531,
      "end": 832.5800323486328,
      "text": " came ye? And they said, from the land of Canaan to buy food. And so we find here in these"
    },
    {
      "id": 40,
      "start": 832.5800323486328,
      "end": 837.4200286865234,
      "text": " verses of scripture that God is working in Joseph's life. Why do I say that? Well, understand"
    },
    {
      "id": 41,
      "start": 837.4200286865234,
      "end": 842.1400299072266,
      "text": " that Joseph had some dreams about his brothers bowing down and the authority that he would"
    },
    {
      "id": 42,
      "start": 842.1400299072266,
      "end": 847.3400268554688,
      "text": " have and we see that this is being fulfilled here. But I also want you to understand that"
    },
    {
      "id": 43,
      "start": 847.3400268554688,
      "end": 854.2600250244141,
      "text": " Joseph is now coming face to face with the brothers that hated him, that wanted to kill"
    },
    {
      "id": 44,
      "start": 854.2600250244141,
      "end": 859.5000305175781,
      "text": " him, that wanted to, and eventually sold him into slavery. I want you to think about the"
    },
    {
      "id": 45,
      "start": 859.5000305175781,
      "end": 866.0600280761719,
      "text": " emotions of that. Listen, as we look in the life of Joseph, go back to chapter 41, if"
    },
    {
      "id": 46,
      "start": 866.0600280761719,
      "end": 872.9400329589844,
      "text": " you will, and look in verses 51 and 52 of Genesis chapter 41 and I want you to see that"
    },
    {
      "id": 47,
      "start": 872.9400329589844,
      "end": 877.6200256347656,
      "text": " as we look at this portion of scripture here and we understand what's taking place that"
    },
    {
      "id": 48,
      "start": 877.6200256347656,
      "end": 883.7400207519531,
      "text": " God tells us in Genesis 41 and verse number 51, and Joseph called the name of the firstborn"
    },
    {
      "id": 49,
      "start": 883.7400207519531,
      "end": 889.5400390625,
      "text": " Manasseh. For God said he hath made me forget all my toil and all my father's house and"
    },
    {
      "id": 50,
      "start": 889.5400390625,
      "end": 894.5400390625,
      "text": " the name of the second called he Ephraim. For God hath caused me to be fruitful in the"
    },
    {
      "id": 51,
      "start": 894.5400390625,
      "end": 900.02001953125,
      "text": " land of my affliction. We studied this several weeks ago when we looked at Joseph and we"
    },
    {
      "id": 52,
      "start": 900.02001953125,
      "end": 904.4600219726562,
      "text": " talked about the principle of perspective from this portion of scripture and the fact"
    },
    {
      "id": 53,
      "start": 904.4600219726562,
      "end": 909.1000366210938,
      "text": " that he names his firstborn Manasseh, which means forgetfulness. He names his secondborn"
    },
    {
      "id": 54,
      "start": 909.1000366210938,
      "end": 914.5400390625,
      "text": " Ephraim, which means fruitfulness. And we looked through and we dealt with that and"
    },
    {
      "id": 55,
      "start": 914.5400390625,
      "end": 921.02001953125,
      "text": " we understood that God had been working in the life of Joseph. But I want you to understand"
    },
    {
      "id": 56,
      "start": 921.02001953125,
      "end": 927.8600158691406,
      "text": " that now as Joseph's brothers come face to face with him, that what he had believed in"
    },
    {
      "id": 57,
      "start": 927.8600158691406,
      "end": 936.9800415039062,
      "text": " and what he had handled now, those emotions are raw. He's face to face with his brothers."
    },
    {
      "id": 58,
      "start": 936.9800415039062,
      "end": 940.9400329589844,
      "text": " How are you going to respond? How are you going to deal with that? Listen, I wonder"
    },
    {
      "id": 59,
      "start": 940.9400329589844,
      "end": 945.9800415039062,
      "text": " this evening if there's anything in you, someone walks into a room and you have ought against"
    },
    {
      "id": 60,
      "start": 945.9800415039062,
      "end": 955.1400146484375,
      "text": " them. I mean maybe they did you wrong. We're supposed to forgive. Joseph says forgetfulness"
    },
    {
      "id": 61,
      "start": 955.1400146484375,
      "end": 960.5800170898438,
      "text": " and fruitfulness and naming his sons. But you know when you come face to face with someone"
    },
    {
      "id": 62,
      "start": 960.5800170898438,
      "end": 968.6600341796875,
      "text": " that hurt you, they didn't seek his forgiveness, did they? No. Man, God's at work in the life"
    },
    {
      "id": 63,
      "start": 968.6600341796875,
      "end": 973.9400329589844,
      "text": " of Joseph. I believe that God is proving some things in the life of Joseph. You know God"
    },
    {
      "id": 64,
      "start": 973.9400329589844,
      "end": 978.4800415039062,
      "text": " will prove some things in our lives. It's easy to say things. There's a whole different"
    },
    {
      "id": 65,
      "start": 978.4800415039062,
      "end": 983.2200317382812,
      "text": " story to actually live it. It's one thing to say I forgive that person but then to interact"
    },
    {
      "id": 66,
      "start": 983.2200317382812,
      "end": 989.1400146484375,
      "text": " with that person. Would you agree? You say I forgive him but I never want to see him"
    },
    {
      "id": 67,
      "start": 989.1400146484375,
      "end": 997.3000183105469,
      "text": " again. Have you ever heard somebody say that? Sure you have. Is that true forgiveness? I"
    },
    {
      "id": 68,
      "start": 997.3000183105469,
      "end": 1004.0600280761719,
      "text": " mean listen, remember sometimes when God's at work it's not comfortable. It's not comfortable."
    },
    {
      "id": 69,
      "start": 1004.0600280761719,
      "end": 1008.5000305175781,
      "text": " Joseph is he standing there and he sees his brothers. It's been 20 years. His brothers"
    },
    {
      "id": 70,
      "start": 1008.5000305175781,
      "end": 1012.8200378417969,
      "text": " don't recognize him. No doubt there's been a great transformation in his even physical"
    },
    {
      "id": 71,
      "start": 1012.8200378417969,
      "end": 1016.8200378417969,
      "text": " appearance and then of course with wearing all of the Egyptian garb that he would have"
    },
    {
      "id": 72,
      "start": 1016.8200378417969,
      "end": 1021.7400207519531,
      "text": " on they don't recognize he speaks Egyptian no doubt and he's speaking through a translator"
    },
    {
      "id": 73,
      "start": 1021.7400207519531,
      "end": 1026.2200317382812,
      "text": " as you'd find as we continue studying through these chapters and we find that he knew his"
    },
    {
      "id": 74,
      "start": 1026.2200317382812,
      "end": 1035.4200134277344,
      "text": " brothers. God was at work. God was at work. We find that God is working in the life of"
    },
    {
      "id": 75,
      "start": 1035.4200134277344,
      "end": 1040.4200134277344,
      "text": " Joseph but I would say that God is not only working in the life of Joseph but God is working"
    },
    {
      "id": 76,
      "start": 1040.4600219726562,
      "end": 1046.1800231933594,
      "text": " in the lives of Joseph's brothers. And really that's the bulk of this portion of scripture."
    },
    {
      "id": 77,
      "start": 1046.1800231933594,
      "end": 1050.1800231933594,
      "text": " Look in verse number 8. The Bible says, And Joseph knew his brethren, but they knew him"
    },
    {
      "id": 78,
      "start": 1050.1800231933594,
      "end": 1054.6600341796875,
      "text": " not. And Joseph remembered the dreams which he dreamed of them, and said unto them, Ye"
    },
    {
      "id": 79,
      "start": 1054.6600341796875,
      "end": 1059.1000366210938,
      "text": " are spies, to see the nakedness of the land, ye are come. And they said unto him, Nay,"
    },
    {
      "id": 80,
      "start": 1059.1000366210938,
      "end": 1065.0600280761719,
      "text": " my lord, but to buy food are thy servants come. We are all one man's sons, we are true"
    },
    {
      "id": 81,
      "start": 1065.0600280761719,
      "end": 1069.6600341796875,
      "text": " men, thy servants are no spies. And he said unto them, Nay, but to see the nakedness of"
    },
    {
      "id": 82,
      "start": 1069.6600341796875,
      "end": 1075.4200134277344,
      "text": " the land, ye are come. They said, Thy servants are twelve brethren, the sons of one man"
    },
    {
      "id": 83,
      "start": 1075.4200134277344,
      "end": 1081.1000366210938,
      "text": " in the land of Canaan. Behold, the youngest is this day with our father, and one is not."
    },
    {
      "id": 84,
      "start": 1081.1000366210938,
      "end": 1089.02001953125,
      "text": " Who is that? That's how they refer to him. One is not. They're talking to Joseph. The"
    },
    {
      "id": 85,
      "start": 1089.02001953125,
      "end": 1095.3400268554688,
      "text": " one who they say is not. And we find that through this portion of scripture that Joseph,"
    },
    {
      "id": 86,
      "start": 1095.3400268554688,
      "end": 1100.2200317382812,
      "text": " I believe, as you study the life of Joseph, he was a man that sought the Lord, he followed"
    },
    {
      "id": 87,
      "start": 1100.2200317382812,
      "end": 1104.8600158691406,
      "text": " the Lord, he obeyed the Lord. I believe that in this interaction between Joseph and his"
    },
    {
      "id": 88,
      "start": 1104.8600158691406,
      "end": 1111.1400146484375,
      "text": " brothers, he is in obedience to God. When he's speaking roughly to them in all the"
    },
    {
      "id": 89,
      "start": 1111.1400146484375,
      "end": 1115.3800048828125,
      "text": " circumstances that are going on, I believe that Joseph is doing exactly what God has"
    },
    {
      "id": 90,
      "start": 1115.3800048828125,
      "end": 1120.8600463867188,
      "text": " instructed him to do. Joseph's not, he's not walking in the flesh in this portion of scripture."
    },
    {
      "id": 91,
      "start": 1120.9000244140625,
      "end": 1126.300048828125,
      "text": " I believe that Joseph is obedient to the Lord, but God is working in the lives of those brothers."
    },
    {
      "id": 92,
      "start": 1126.300048828125,
      "end": 1130.8200073242188,
      "text": " We're going to see it here in just a moment. Notice with me, the Bible says that he says"
    },
    {
      "id": 93,
      "start": 1130.8200073242188,
      "end": 1134.9800415039062,
      "text": " that they come to see the nakedness of the land in verse 14. And Joseph said unto them,"
    },
    {
      "id": 94,
      "start": 1134.9800415039062,
      "end": 1141.1000366210938,
      "text": " That is it that I spake unto you, saying, You're spies. Hereby ye shall be approved."
    },
    {
      "id": 95,
      "start": 1141.1000366210938,
      "end": 1147.780029296875,
      "text": " By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither."
    },
    {
      "id": 96,
      "start": 1147.780029296875,
      "end": 1152.780029296875,
      "text": " Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your"
    },
    {
      "id": 97,
      "start": 1152.780029296875,
      "end": 1158.300048828125,
      "text": " words may be proved, whether there be any truth in you, or else by the life of Pharaoh,"
    },
    {
      "id": 98,
      "start": 1158.300048828125,
      "end": 1166.1800537109375,
      "text": " surely, you're spies. And he, Joseph, put them, his brothers, all together into ward"
    },
    {
      "id": 99,
      "start": 1166.1800537109375,
      "end": 1172.780029296875,
      "text": " three days. I think those were three long days. Don't you think so? They didn't know"
    },
    {
      "id": 100,
      "start": 1172.780029296875,
      "end": 1177.02001953125,
      "text": " what they were going to experience when they got to Egypt. They know that they were given"
    },
    {
      "id": 101,
      "start": 1177.02001953125,
      "end": 1182.8600463867188,
      "text": " instruction from Dad to go buy corn in Egypt, and they arrive, and they immediately have"
    },
    {
      "id": 102,
      "start": 1182.8600463867188,
      "end": 1188.780029296875,
      "text": " this interaction. Perhaps as they're waiting in line, as many are there to buy food, perhaps"
    },
    {
      "id": 103,
      "start": 1188.780029296875,
      "end": 1192.8200073242188,
      "text": " they see person after person that stands, and they get their food, and they go on their"
    },
    {
      "id": 104,
      "start": 1192.8200073242188,
      "end": 1196.1400146484375,
      "text": " way. And then all of a sudden, they arrive, and there's all this questioning, and they're"
    },
    {
      "id": 105,
      "start": 1196.1400146484375,
      "end": 1200.260009765625,
      "text": " put into ward. They're put into prison. There's this interaction. We find that"
    },
    {
      "id": 0,
      "start": 1200.260009765625,
      "end": 1202.9000098705292,
      "text": " for three days, the Bible does not tell us"
    },
    {
      "id": 1,
      "start": 1202.9000098705292,
      "end": 1206.0200099945068,
      "text": " during this three-day period of time what they discuss."
    },
    {
      "id": 2,
      "start": 1206.0200099945068,
      "end": 1208.8200101852417,
      "text": " However, when we look at verse number 21,"
    },
    {
      "id": 3,
      "start": 1208.8200101852417,
      "end": 1211.140009880066,
      "text": " I think God gives us some insight"
    },
    {
      "id": 4,
      "start": 1211.140009880066,
      "end": 1212.8600101470947,
      "text": " as to what they were discussing,"
    },
    {
      "id": 5,
      "start": 1212.8600101470947,
      "end": 1214.9000101089478,
      "text": " and what they were discussing were events"
    },
    {
      "id": 6,
      "start": 1214.9000101089478,
      "end": 1217.6400089263916,
      "text": " that took place over 20 years ago."
    },
    {
      "id": 7,
      "start": 1217.6400089263916,
      "end": 1220.9000091552734,
      "text": " Notice with me that Joseph will keep it in context"
    },
    {
      "id": 8,
      "start": 1220.9000091552734,
      "end": 1224.420009613037,
      "text": " in verse 18, after these three days, he says,"
    },
    {
      "id": 9,
      "start": 1224.420009613037,
      "end": 1226.420009613037,
      "text": " and Joseph said unto them, the third day,"
    },
    {
      "id": 10,
      "start": 1226.420009613037,
      "end": 1229.3000106811523,
      "text": " this do and live, and then notice this phrase,"
    },
    {
      "id": 11,
      "start": 1229.3000106811523,
      "end": 1234.3000106811523,
      "text": " for I fear God, wow, now think about it,"
    },
    {
      "id": 12,
      "start": 1237.9400100708008,
      "end": 1242.9400100708008,
      "text": " Jacob sent his boys from Canaan to Egypt,"
    },
    {
      "id": 13,
      "start": 1245.820011138916,
      "end": 1249.9000091552734,
      "text": " no doubt they had preconceived ideas about the Egyptians,"
    },
    {
      "id": 14,
      "start": 1249.9000091552734,
      "end": 1253.700008392334,
      "text": " about their religion, about their polytheism,"
    },
    {
      "id": 15,
      "start": 1253.700008392334,
      "end": 1256.0200080871582,
      "text": " and all of the things that they would be exposed to"
    },
    {
      "id": 16,
      "start": 1256.0200080871582,
      "end": 1258.6400108337402,
      "text": " and would deal with, and then as they're standing there,"
    },
    {
      "id": 17,
      "start": 1258.6400108337402,
      "end": 1260.600009918213,
      "text": " speaking to the governor of the country,"
    },
    {
      "id": 18,
      "start": 1260.600009918213,
      "end": 1263.7200088500977,
      "text": " the one who's in charge, he calls them out of prison"
    },
    {
      "id": 19,
      "start": 1263.7200088500977,
      "end": 1268.5600128173828,
      "text": " on the third day and says, for I fear God."
    },
    {
      "id": 20,
      "start": 1270.8000106811523,
      "end": 1275.4400100708008,
      "text": " Wow, I believe God is working in the lives of these boys,"
    },
    {
      "id": 21,
      "start": 1275.4400100708008,
      "end": 1279.4400100708008,
      "text": " and God is going to continue as we look"
    },
    {
      "id": 22,
      "start": 1279.4400100708008,
      "end": 1280.8400115966797,
      "text": " through this portion of scripture,"
    },
    {
      "id": 23,
      "start": 1280.8400115966797,
      "end": 1284.3200073242188,
      "text": " how God is working and moving, he says this,"
    },
    {
      "id": 24,
      "start": 1284.3200073242188,
      "end": 1286.1200103759766,
      "text": " Joseph to his brothers in verse 19,"
    },
    {
      "id": 25,
      "start": 1286.1200103759766,
      "end": 1288.2800064086914,
      "text": " if ye be true men, let one of your brethren"
    },
    {
      "id": 26,
      "start": 1288.2800064086914,
      "end": 1290.4800109863281,
      "text": " be bound in the house of your prison,"
    },
    {
      "id": 27,
      "start": 1290.4800109863281,
      "end": 1293.640007019043,
      "text": " go ye, carry corn for the famine of your houses,"
    },
    {
      "id": 28,
      "start": 1293.640007019043,
      "end": 1296.7200088500977,
      "text": " but bring your youngest brother unto me,"
    },
    {
      "id": 29,
      "start": 1296.7200088500977,
      "end": 1299.160011291504,
      "text": " so shall your words be verified,"
    },
    {
      "id": 30,
      "start": 1299.160011291504,
      "end": 1303.0000076293945,
      "text": " and ye shall not die, and they did so."
    },
    {
      "id": 31,
      "start": 1303.0000076293945,
      "end": 1305.8200073242188,
      "text": " And then verse 21, it says, and they said one to another,"
    },
    {
      "id": 32,
      "start": 1305.8200073242188,
      "end": 1310.0400085449219,
      "text": " notice what they say, we find that Simeon remains in jail,"
    },
    {
      "id": 33,
      "start": 1310.0400085449219,
      "end": 1313.0000076293945,
      "text": " and we'll look through here, but notice in verse 21,"
    },
    {
      "id": 34,
      "start": 1313.0000076293945,
      "end": 1316.0800094604492,
      "text": " as they wander off, as they leave from the presence"
    },
    {
      "id": 35,
      "start": 1316.9200134277344,
      "end": 1319.640007019043,
      "text": " of Joseph, they leave and the Bible says that they say,"
    },
    {
      "id": 36,
      "start": 1319.640007019043,
      "end": 1321.7200088500977,
      "text": " we are guilty concerning our brother."
    },
    {
      "id": 37,
      "start": 1323.0600128173828,
      "end": 1324.9200134277344,
      "text": " Why did they have that thought?"
    },
    {
      "id": 38,
      "start": 1325.9600067138672,
      "end": 1330.5600128173828,
      "text": " Conviction, God was at work, nothing was said"
    },
    {
      "id": 39,
      "start": 1330.5600128173828,
      "end": 1333.6000061035156,
      "text": " about what they did to Joseph, nothing was said,"
    },
    {
      "id": 40,
      "start": 1333.6000061035156,
      "end": 1336.000015258789,
      "text": " there was no insight that this was Joseph"
    },
    {
      "id": 41,
      "start": 1336.000015258789,
      "end": 1339.020004272461,
      "text": " that they were speaking to, it was God working"
    },
    {
      "id": 42,
      "start": 1339.020004272461,
      "end": 1342.6000061035156,
      "text": " through these circumstances, it was God working"
    },
    {
      "id": 43,
      "start": 1342.6000061035156,
      "end": 1346.000015258789,
      "text": " to bring conviction in the lives of these boys, why?"
    },
    {
      "id": 44,
      "start": 1346.8800048828125,
      "end": 1349.8800048828125,
      "text": " Because ultimately, God wants to bring them back to himself."
    },
    {
      "id": 45,
      "start": 1351.1400146484375,
      "end": 1354.3200073242188,
      "text": " That's what God's doing, and as they leave, listen,"
    },
    {
      "id": 46,
      "start": 1354.3200073242188,
      "end": 1357.240005493164,
      "text": " nothing is said about Joseph, the only thing that's said"
    },
    {
      "id": 47,
      "start": 1357.240005493164,
      "end": 1362.240005493164,
      "text": " about Joseph and one is not, and they say, we are guilty,"
    },
    {
      "id": 48,
      "start": 1363.9200134277344,
      "end": 1367.6800079345703,
      "text": " we are guilty, we are guilty about what?"
    },
    {
      "id": 49,
      "start": 1367.6800079345703,
      "end": 1372.6800079345703,
      "text": " Our brother, we are guilty concerning our brother."
    },
    {
      "id": 50,
      "start": 1373.4000091552734,
      "end": 1377.1600036621094,
      "text": " I think for 20 long years, these things, it haunted them,"
    },
    {
      "id": 51,
      "start": 1378.4400024414062,
      "end": 1381.8800048828125,
      "text": " it haunted them what they did, why?"
    },
    {
      "id": 52,
      "start": 1381.8800048828125,
      "end": 1385.4000091552734,
      "text": " Because they never got it right, they never dealt with it."
    },
    {
      "id": 53,
      "start": 1386.760009765625,
      "end": 1389.000015258789,
      "text": " I don't know how many times Jacob might have said"
    },
    {
      "id": 54,
      "start": 1389.000015258789,
      "end": 1394.000015258789,
      "text": " something about Joseph, and every time Dad would say"
    },
    {
      "id": 55,
      "start": 1395.7200164794922,
      "end": 1397.0400085449219,
      "text": " something about Joseph, how do you think"
    },
    {
      "id": 56,
      "start": 1397.0400085449219,
      "end": 1398.1600036621094,
      "text": " the 10 brothers feel?"
    },
    {
      "id": 57,
      "start": 1398.240005493164,
      "end": 1401.240005493164,
      "text": " They knew the truth, they knew what they did."
    },
    {
      "id": 58,
      "start": 1402.3600158691406,
      "end": 1404.4400024414062,
      "text": " How do you think they felt when they saw Jacob"
    },
    {
      "id": 59,
      "start": 1404.4400024414062,
      "end": 1408.9200134277344,
      "text": " bereaving his son, I mean, he's weeping, no doubt."
    },
    {
      "id": 60,
      "start": 1408.9200134277344,
      "end": 1410.8400115966797,
      "text": " I want you to think about it tonight, listen,"
    },
    {
      "id": 61,
      "start": 1410.8400115966797,
      "end": 1413.3600158691406,
      "text": " there are, and I know that the Bible doesn't tell us"
    },
    {
      "id": 62,
      "start": 1413.3600158691406,
      "end": 1416.1200103759766,
      "text": " all of this, but you know as a human being,"
    },
    {
      "id": 63,
      "start": 1416.1200103759766,
      "end": 1419.000015258789,
      "text": " there are certain special events in your life,"
    },
    {
      "id": 64,
      "start": 1419.000015258789,
      "end": 1421.0800170898438,
      "text": " there are things that take place in your life"
    },
    {
      "id": 65,
      "start": 1421.0800170898438,
      "end": 1423.9200134277344,
      "text": " that remind us, that trigger things in our lives,"
    },
    {
      "id": 66,
      "start": 1423.9200134277344,
      "end": 1426.6800079345703,
      "text": " maybe you've never heard of it, maybe you've never seen it,"
    },
    {
      "id": 67,
      "start": 1426.6800079345703,
      "end": 1427.9600067138672,
      "text": " but it triggers things in our lives,"
    },
    {
      "id": 68,
      "start": 1427.9600067138672,
      "end": 1430.8800048828125,
      "text": " maybe there's a special day, maybe it's a birthday,"
    },
    {
      "id": 69,
      "start": 1430.8800048828125,
      "end": 1433.3200073242188,
      "text": " as we would celebrate if we think about our own culture"
    },
    {
      "id": 70,
      "start": 1433.3200073242188,
      "end": 1436.2000122070312,
      "text": " and our own society, and you have a son who is not,"
    },
    {
      "id": 71,
      "start": 1436.2000122070312,
      "end": 1438.240005493164,
      "text": " what happens on the day of their birth?"
    },
    {
      "id": 72,
      "start": 1438.240005493164,
      "end": 1442.240005493164,
      "text": " You think about that, do you not?"
    },
    {
      "id": 73,
      "start": 1442.240005493164,
      "end": 1445.0400085449219,
      "text": " And when you think about that, perhaps you talk about that,"
    },
    {
      "id": 74,
      "start": 1445.0400085449219,
      "end": 1447.5600128173828,
      "text": " and those brothers that are under conviction,"
    },
    {
      "id": 75,
      "start": 1447.5600128173828,
      "end": 1449.4000091552734,
      "text": " and now they're standing there, listen,"
    },
    {
      "id": 76,
      "start": 1449.4000091552734,
      "end": 1454.4000091552734,
      "text": " all they wanted to do was buy food, but God was working,"
    },
    {
      "id": 77,
      "start": 1455.0400085449219,
      "end": 1457.8800048828125,
      "text": " God was working, God knew where they were,"
    },
    {
      "id": 78,
      "start": 1457.8800048828125,
      "end": 1460.8800048828125,
      "text": " God had orchestrated some events, why?"
    },
    {
      "id": 79,
      "start": 1460.8800048828125,
      "end": 1463.1600036621094,
      "text": " Because our God is a sovereign God,"
    },
    {
      "id": 80,
      "start": 1463.1600036621094,
      "end": 1466.2000122070312,
      "text": " and he had worked in such a way to elevate Joseph"
    },
    {
      "id": 81,
      "start": 1466.2000122070312,
      "end": 1469.1199951171875,
      "text": " to a place of prominence and of position,"
    },
    {
      "id": 82,
      "start": 1469.1199951171875,
      "end": 1471.1600036621094,
      "text": " and he had worked so that this famine would affect"
    },
    {
      "id": 83,
      "start": 1471.1600036621094,
      "end": 1473.1199951171875,
      "text": " not only Egypt, but also Canaan,"
    },
    {
      "id": 84,
      "start": 1473.1199951171875,
      "end": 1475.0800170898438,
      "text": " and all these other lands were impacted,"
    },
    {
      "id": 85,
      "start": 1475.0800170898438,
      "end": 1477.3600158691406,
      "text": " and now the brothers come, and they say,"
    },
    {
      "id": 86,
      "start": 1477.3600158691406,
      "end": 1480.0,
      "text": " we are guilty concerning our brother,"
    },
    {
      "id": 87,
      "start": 1480.0,
      "end": 1482.3200073242188,
      "text": " and that we saw, notice the rest of verse 21,"
    },
    {
      "id": 88,
      "start": 1482.4000244140625,
      "end": 1486.6000061035156,
      "text": " we saw the anguish of his soul when he besought us,"
    },
    {
      "id": 89,
      "start": 1486.6000061035156,
      "end": 1489.6000061035156,
      "text": " and we would not hear,"
    },
    {
      "id": 90,
      "start": 1489.6000061035156,
      "end": 1494.6000061035156,
      "text": " therefore is this distress come upon us."
    },
    {
      "id": 91,
      "start": 1496.7200012207031,
      "end": 1499.5599975585938,
      "text": " I believe that these brothers were convinced"
    },
    {
      "id": 92,
      "start": 1500.52001953125,
      "end": 1502.8399963378906,
      "text": " that the reason for their trouble"
    },
    {
      "id": 93,
      "start": 1503.8800048828125,
      "end": 1507.1600036621094,
      "text": " was rooted in what happened 20 years earlier."
    },
    {
      "id": 94,
      "start": 1507.1600036621094,
      "end": 1509.1600036621094,
      "text": " Do you not, when you read verse 21?"
    },
    {
      "id": 95,
      "start": 1509.1600036621094,
      "end": 1512.0,
      "text": " I mean, no one had to convince them of it."
    },
    {
      "id": 96,
      "start": 1512.6800231933594,
      "end": 1513.52001953125,
      "text": " You know who was working?"
    },
    {
      "id": 97,
      "start": 1513.52001953125,
      "end": 1516.4800109863281,
      "text": " God, God was working."
    },
    {
      "id": 98,
      "start": 1516.4800109863281,
      "end": 1518.8399963378906,
      "text": " It's amazing, sometimes I'll preach a message,"
    },
    {
      "id": 99,
      "start": 1518.8399963378906,
      "end": 1519.8000183105469,
      "text": " and someone will say something,"
    },
    {
      "id": 100,
      "start": 1519.8000183105469,
      "end": 1523.3399963378906,
      "text": " and I'm like, I don't even think I said anything about that."
    },
    {
      "id": 101,
      "start": 1523.3399963378906,
      "end": 1524.7200012207031,
      "text": " It really wasn't even something"
    },
    {
      "id": 102,
      "start": 1524.7200012207031,
      "end": 1526.0400085449219,
      "text": " that was part of the message,"
    },
    {
      "id": 103,
      "start": 1526.0400085449219,
      "end": 1526.8800048828125,
      "text": " but you know what happened?"
    },
    {
      "id": 104,
      "start": 1526.8800048828125,
      "end": 1531.8000183105469,
      "text": " God was at work, God was moving, God was working."
    },
    {
      "id": 105,
      "start": 1531.8000183105469,
      "end": 1533.8399963378906,
      "text": " I've sat in preaching services,"
    },
    {
      "id": 106,
      "start": 1533.8399963378906,
      "end": 1535.7200012207031,
      "text": " I've sat and I've listened to preaching,"
    },
    {
      "id": 107,
      "start": 1535.7200012207031,
      "end": 1538.4000244140625,
      "text": " and God will trigger through something that is said,"
    },
    {
      "id": 108,
      "start": 1538.4000244140625,
      "end": 1540.4000244140625,
      "text": " a verse that I read, another thought,"
    },
    {
      "id": 109,
      "start": 1540.4000244140625,
      "end": 1542.3200073242188,
      "text": " and I'll go over, and maybe I'll miss"
    },
    {
      "id": 110,
      "start": 1542.3200073242188,
      "end": 1544.7200012207031,
      "text": " the next few sentences that the preacher says,"
    },
    {
      "id": 111,
      "start": 1544.7200012207031,
      "end": 1547.1000061035156,
      "text": " but God's working in my life,"
    },
    {
      "id": 112,
      "start": 1548.5599975585938,
      "end": 1550.2200012207031,
      "text": " and that's how God works."
    },
    {
      "id": 113,
      "start": 1552.0400085449219,
      "end": 1555.9200134277344,
      "text": " A journey that was expected to simply go"
    },
    {
      "id": 114,
      "start": 1555.9200134277344,
      "end": 1558.8399963378906,
      "text": " and buy some corn and go home"
    },
    {
      "id": 115,
      "start": 1558.8399963378906,
      "end": 1561.3800048828125,
      "text": " to provide food for the family."
    },
    {
      "id": 116,
      "start": 1561.3800048828125,
      "end": 1563.9400024414062,
      "text": " God is at work, God is at work."
    },
    {
      "id": 117,
      "start": 1564.8800048828125,
      "end": 1568.4400024414062,
      "text": " Notice the Bible says in verse 22,"
    },
    {
      "id": 118,
      "start": 1569.4400024414062,
      "end": 1572.3200073242188,
      "text": " and Reuben answered, he answered them saying,"
    },
    {
      "id": 119,
      "start": 1572.3200073242188,
      "end": 1574.6800231933594,
      "text": " spake I not unto you, saying,"
    },
    {
      "id": 120,
      "start": 1574.6800231933594,
      "end": 1577.52001953125,
      "text": " do not sin against the child, and you would not hear."
    },
    {
      "id": 121,
      "start": 1577.52001953125,
      "end": 1581.2799987792969,
      "text": " Therefore, behold, also, his blood is required."
    },
    {
      "id": 122,
      "start": 1581.2799987792969,
      "end": 1583.5599975585938,
      "text": " I mean, the conversation continues."
    },
    {
      "id": 123,
      "start": 1583.5599975585938,
      "end": 1585.2000122070312,
      "text": " Reuben, he's going back, listen,"
    },
    {
      "id": 124,
      "start": 1585.2000122070312,
      "end": 1588.5599975585938,
      "text": " he remembers with clarity the conversation"
    },
    {
      "id": 125,
      "start": 1588.5599975585938,
      "end": 1589.3800048828125,
      "text": " that had taken place."
    },
    {
      "id": 126,
      "start": 1589.3800048828125,
      "end": 1592.8800048828125,
      "text": " Remember, Reuben was the one that went back to the pit,"
    },
    {
      "id": 127,
      "start": 1592.8800048828125,
      "end": 1594.0400085449219,
      "text": " and Joseph wasn't there,"
    },
    {
      "id": 128,
      "start": 1594.0400085449219,
      "end": 1595.760009765625,
      "text": " because they sold him into slavery,"
    },
    {
      "id": 129,
      "start": 1595.760009765625,
      "end": 1597.8800048828125,
      "text": " and we find here in verse 23,"
    },
    {
      "id": 130,
      "start": 1598.0,
      "end": 1601.6400146484375,
      "text": " and they knew not that Joseph understood them,"
    },
    {
      "id": 131,
      "start": 1602.5599975585938,
      "end": 1605.6400146484375,
      "text": " for he spake unto them by an interpreter."
    },
    {
      "id": 132,
      "start": 1605.6400146484375,
      "end": 1608.760009765625,
      "text": " Joseph is standing there hearing all of this."
    },
    {
      "id": 133,
      "start": 1608.760009765625,
      "end": 1612.9600219726562,
      "text": " He's hearing this conversation between his brothers."
    },
    {
      "id": 134,
      "start": 1612.9600219726562,
      "end": 1615.6000061035156,
      "text": " He's hearing, listen, he didn't bring it up."
    },
    {
      "id": 135,
      "start": 1615.6000061035156,
      "end": 1617.5599975585938,
      "text": " It's an awesome thing when God works."
    },
    {
      "id": 136,
      "start": 1618.5800170898438,
      "end": 1621.2000122070312,
      "text": " Sometimes a preacher gets accused of,"
    },
    {
      "id": 137,
      "start": 1621.2000122070312,
      "end": 1624.1199951171875,
      "text": " you're preaching that because you knew this was going on,"
    },
    {
      "id": 138,
      "start": 1624.1199951171875,
      "end": 1625.2799987792969,
      "text": " and so on and so forth."
    },
    {
      "id": 139,
      "start": 1625.2799987792969,
      "end": 1627.0,
      "text": " Listen, if you preach the whole counsel of God,"
    },
    {
      "id": 140,
      "start": 1627.0,
      "end": 1630.0,
      "text": " you just let God work, honestly."
    },
    {
      "id": 141,
      "start": 1630.8800048828125,
      "end": 1633.52001953125,
      "text": " And when God works, you just sit back and say,"
    },
    {
      "id": 142,
      "start": 1633.52001953125,
      "end": 1635.1199951171875,
      "text": " look at what God was doing."
    },
    {
      "id": 143,
      "start": 1635.1199951171875,
      "end": 1637.5599975585938,
      "text": " Listen, I think it was Brother Hummel,"
    },
    {
      "id": 144,
      "start": 1637.5599975585938,
      "end": 1639.0800170898438,
      "text": " maybe it was Brother Mershon,"
    },
    {
      "id": 145,
      "start": 1639.0800170898438,
      "end": 1641.9200134277344,
      "text": " talked about someone coming and saying,"
    },
    {
      "id": 146,
      "start": 1641.9200134277344,
      "end": 1644.1400146484375,
      "text": " the preacher must have told you all about my life,"
    },
    {
      "id": 147,
      "start": 1644.1400146484375,
      "end": 1645.8399963378906,
      "text": " because all you've done is preach about the things"
    },
    {
      "id": 148,
      "start": 1645.8399963378906,
      "end": 1646.6800231933594,
      "text": " that I've been dealing with."
    },
    {
      "id": 149,
      "start": 1646.6800231933594,
      "end": 1647.6000061035156,
      "text": " He's like, I don't have any idea."
    },
    {
      "id": 150,
      "start": 1647.6000061035156,
      "end": 1649.6800231933594,
      "text": " God's dealing in your life."
    },
    {
      "id": 151,
      "start": 1649.6800231933594,
      "end": 1651.8000183105469,
      "text": " God's at work."
    },
    {
      "id": 152,
      "start": 1651.8000183105469,
      "end": 1655.6800231933594,
      "text": " Joseph didn't say anything about what happened 20 years ago,"
    },
    {
      "id": 153,
      "start": 1655.6800231933594,
      "end": 1659.1600036621094,
      "text": " but those boys were under conviction, deep conviction."
    },
    {
      "id": 154,
      "start": 1659.1600036621094,
      "end": 1660.5599975585938,
      "text": " Notice in verse 24,"
    },
    {
      "id": 155,
      "start": 1661.52001953125,
      "end": 1664.52001953125,
      "text": " and he turned himself about from them and wept."
    },
    {
      "id": 156,
      "start": 1664.52001953125,
      "end": 1666.3600158691406,
      "text": " Joseph, again, remember we started out,"
    },
    {
      "id": 157,
      "start": 1666.3600158691406,
      "end": 1668.2400207519531,
      "text": " God was at work in Joseph's life."
    },
    {
      "id": 158,
      "start": 1669.4000244140625,
      "end": 1671.9600219726562,
      "text": " He returned to them again and communed with them"
    },
    {
      "id": 159,
      "start": 1671.9600219726562,
      "end": 1675.4400024414062,
      "text": " and took from them Simeon and bound him before their eyes."
    },
    {
      "id": 160,
      "start": 1675.4400024414062,
      "end": 1680.4400024414062,
      "text": " And Joseph commanded to fill their sacks with corn."
    },
    {
      "id": 161,
      "start": 1680.4400024414062,
      "end": 1684.6000061035156,
      "text": " Notice this, and to restore every man's money into a sack."
    },
    {
      "id": 162,
      "start": 1685.6800231933594,
      "end": 1688.6800231933594,
      "text": " To give them provision for the way."
    },
    {
      "id": 163,
      "start": 1688.6800231933594,
      "end": 1691.4400024414062,
      "text": " And thus did he unto them."
    },
    {
      "id": 164,
      "start": 1691.4400024414062,
      "end": 1694.4400024414062,
      "text": " And they laid their asses with the corn and departed thence."
    },
    {
      "id": 165,
      "start": 1695.4400024414062,
      "end": 1696.7200012207031,
      "text": " So we see what's happening."
    },
    {
      "id": 166,
      "start": 1696.7200012207031,
      "end": 1698.1600036621094,
      "text": " Simeon remains behind,"
    },
    {
      "id": 167,
      "start": 1698.1600036621094,
      "end": 1701.1600036621094,
      "text": " nine of them are now going to travel back."
    },
    {
      "id": 168,
      "start": 1701.1600036621094,
      "end": 1703.2400207519531,
      "text": " And Joseph gives this instruction."
    },
    {
      "id": 169,
      "start": 1703.2400207519531,
      "end": 1705.8800048828125,
      "text": " Remember, he's the one in charge, he's the authority."
    },
    {
      "id": 170,
      "start": 1705.8800048828125,
      "end": 1708.9200134277344,
      "text": " And he commands that their sacks be filled with corn,"
    },
    {
      "id": 171,
      "start": 1708.9200134277344,
      "end": 1711.3600158691406,
      "text": " but he also commands to restore every man's money,"
    },
    {
      "id": 172,
      "start": 1711.3600158691406,
      "end": 1714.280029296875,
      "text": " notice where, into a sack."
    },
    {
      "id": 173,
      "start": 1714.280029296875,
      "end": 1716.2000122070312,
      "text": " He didn't just give the money back to them."
    },
    {
      "id": 174,
      "start": 1716.2000122070312,
      "end": 1718.1199951171875,
      "text": " He said, put it back in their sack."
    },
    {
      "id": 175,
      "start": 1718.1199951171875,
      "end": 1721.239990234375,
      "text": " And we find that he also provided for them,"
    },
    {
      "id": 176,
      "start": 1721.239990234375,
      "end": 1724.7999877929688,
      "text": " for their journey to give them provision for the way."
    },
    {
      "id": 177,
      "start": 1725.7200317382812,
      "end": 1729.3200073242188,
      "text": " Verse 27, these nine brothers, Simeon is left in prison."
    },
    {
      "id": 178,
      "start": 1729.3200073242188,
      "end": 1730.9199829101562,
      "text": " The nine brothers, they journey."
    },
    {
      "id": 179,
      "start": 1730.9199829101562,
      "end": 1733.8800048828125,
      "text": " And it says, as one of them, we don't know which one,"
    },
    {
      "id": 180,
      "start": 1733.8800048828125,
      "end": 1737.1600341796875,
      "text": " opened his sack to give his ass for vendor in the inn,"
    },
    {
      "id": 181,
      "start": 1737.1600341796875,
      "end": 1742.1600341796875,
      "text": " he espied his money, for behold, it was in his sack's mouth."
    },
    {
      "id": 182,
      "start": 1743.0800170898438,
      "end": 1745.0800170898438,
      "text": " Now he knew that he had given the money."
    },
    {
      "id": 183,
      "start": 1745.0800170898438,
      "end": 1746.4000244140625,
      "text": " He knew that he bought the corn."
    },
    {
      "id": 184,
      "start": 1746.4000244140625,
      "end": 1750.6400146484375,
      "text": " And now he opens up to be able to give his animal,"
    },
    {
      "id": 185,
      "start": 1750.6400146484375,
      "end": 1752.760009765625,
      "text": " the provision, the food."
    },
    {
      "id": 186,
      "start": 1752.760009765625,
      "end": 1755.1600341796875,
      "text": " And as he does so, he sees the money."
    },
    {
      "id": 187,
      "start": 1757.7999877929688,
      "end": 1760.0,
      "text": " Oh, praise the Lord, God gave us our money."
    },
    {
      "id": 188,
      "start": 1760.0,
      "end": 1761.4000244140625,
      "text": " That's not how they respond."
    },
    {
      "id": 189,
      "start": 1763.0800170898438,
      "end": 1764.0,
      "text": " It's not how they respond, why?"
    },
    {
      "id": 190,
      "start": 1764.0,
      "end": 1766.0800170898438,
      "text": " Because God is at work."
    },
    {
      "id": 191,
      "start": 1766.0800170898438,
      "end": 1768.6000366210938,
      "text": " Notice in verse 28, and he said unto his brethren,"
    },
    {
      "id": 192,
      "start": 1768.6000366210938,
      "end": 1770.239990234375,
      "text": " my money is restored."
    },
    {
      "id": 193,
      "start": 1770.4400024414062,
      "end": 1773.3200073242188,
      "text": " But I think it was this kind of tone of,"
    },
    {
      "id": 194,
      "start": 1773.3200073242188,
      "end": 1775.0,
      "text": " my money is restored?"
    },
    {
      "id": 195,
      "start": 1775.0,
      "end": 1777.8400268554688,
      "text": " Like, what's going on?"
    },
    {
      "id": 196,
      "start": 1777.8400268554688,
      "end": 1780.1600341796875,
      "text": " And lo, it is even in my sack."
    },
    {
      "id": 197,
      "start": 1780.1600341796875,
      "end": 1784.280029296875,
      "text": " And their heart, notice what it says, failed them."
    },
    {
      "id": 198,
      "start": 1785.5599975585938,
      "end": 1787.2000122070312,
      "text": " Failed them."
    },
    {
      "id": 199,
      "start": 1787.2000122070312,
      "end": 1789.5599975585938,
      "text": " And they were afraid."
    },
    {
      "id": 200,
      "start": 1789.5599975585938,
      "end": 1791.9199829101562,
      "text": " Notice what they say to each other."
    },
    {
      "id": 201,
      "start": 1791.9199829101562,
      "end": 1796.9199829101562,
      "text": " What is this that God hath done unto us?"
    },
    {
      "id": 0,
      "start": 1796.9199829101562,
      "end": 1805.0799827575684,
      "text": " God was at work. God was at work. And we find that in the lives of these brothers we see"
    },
    {
      "id": 1,
      "start": 1805.0799827575684,
      "end": 1812.559983253479,
      "text": " it very distinctly through these events that are recorded in Genesis 42 that God is working."
    },
    {
      "id": 2,
      "start": 1812.559983253479,
      "end": 1817.519983291626,
      "text": " Listen sometimes I've mentioned twice now and for a third time sometimes it's uncomfortable"
    },
    {
      "id": 3,
      "start": 1817.519983291626,
      "end": 1822.0799827575684,
      "text": " when God is at work. Sometimes it means we need to deal with things that quite honestly"
    },
    {
      "id": 4,
      "start": 1822.0799827575684,
      "end": 1827.1599826812744,
      "text": " we just really don't want to deal with. You know what I mean by that? Sometimes we just"
    },
    {
      "id": 5,
      "start": 1827.1599826812744,
      "end": 1834.7999839782715,
      "text": " rather not deal with stuff. But God says I'm working in your life. I want you to be right"
    },
    {
      "id": 6,
      "start": 1834.7999839782715,
      "end": 1838.879981994629,
      "text": " with me. We're going to observe the Lord's Supper tonight and only as God could do it."
    },
    {
      "id": 7,
      "start": 1838.879981994629,
      "end": 1843.7599830627441,
      "text": " I had written on my calendar, my desk calendar that we'd observe the Lord's Supper tonight"
    },
    {
      "id": 8,
      "start": 1843.7599830627441,
      "end": 1849.999984741211,
      "text": " months ago. But I never communicated that to Holly to put in the bulletin. Yesterday"
    },
    {
      "id": 9,
      "start": 1849.999984741211,
      "end": 1853.2399826049805,
      "text": " morning I was praying and God impressed upon my heart hey we've got to do the Lord's Supper"
    },
    {
      "id": 10,
      "start": 1853.2399826049805,
      "end": 1856.599983215332,
      "text": " tomorrow night. I was like man I didn't tell Holly about it. We're in the middle. We're"
    },
    {
      "id": 11,
      "start": 1856.599983215332,
      "end": 1860.3599815368652,
      "text": " going to have the open house yesterday. And then someone asked me yesterday they said"
    },
    {
      "id": 12,
      "start": 1860.3599815368652,
      "end": 1864.5599822998047,
      "text": " hey when, how often do you observe the Lord's Supper? I was like actually tomorrow night"
    },
    {
      "id": 13,
      "start": 1864.5599822998047,
      "end": 1873.2799835205078,
      "text": " we're observing the Lord's Supper. We talk about self-examination. We talk about the"
    },
    {
      "id": 14,
      "start": 1873.2799835205078,
      "end": 1879.1599807739258,
      "text": " process when the Bible says let a man examine himself. We sing the song nothing between"
    },
    {
      "id": 15,
      "start": 1879.1599807739258,
      "end": 1886.719985961914,
      "text": " my soul and my Savior. And we think about this process of God being at work. I often"
    },
    {
      "id": 16,
      "start": 1886.719985961914,
      "end": 1894.4399795532227,
      "text": " say when we deal with the subject of self-examination that it requires both humility and honesty."
    },
    {
      "id": 17,
      "start": 1894.4399795532227,
      "end": 1901.1999816894531,
      "text": " Here's the reality of life. The reality of life is that I would rather inspect Armando"
    },
    {
      "id": 18,
      "start": 1901.3599853515625,
      "end": 1909.6399841308594,
      "text": " and Armando would rather inspect me. That's the reality of life. Why? Because it's a hard"
    },
    {
      "id": 19,
      "start": 1909.6399841308594,
      "end": 1915.599983215332,
      "text": " thing to inspect yourself, to examine yourself. You know why? We think we're better than we"
    },
    {
      "id": 20,
      "start": 1915.599983215332,
      "end": 1922.9599838256836,
      "text": " are. We think we really don't have any problems. We think we've got it all together. But then"
    },
    {
      "id": 21,
      "start": 1922.9599838256836,
      "end": 1936.6799774169922,
      "text": " God starts working. That bitterness, lack of forgiveness, that contention, unresolved."
    },
    {
      "id": 22,
      "start": 1936.6799774169922,
      "end": 1939.4399871826172,
      "text": " I mean you just go down a list. I'm not going to go down through a list tonight. I'm just"
    },
    {
      "id": 23,
      "start": 1939.4399871826172,
      "end": 1943.9199829101562,
      "text": " going to mention a few things. But the reality is that God is working. Listen this was something"
    },
    {
      "id": 24,
      "start": 1943.9199829101562,
      "end": 1949.5999755859375,
      "text": " that happened 20 years earlier. I think that the brothers probably tried to suppress it"
    },
    {
      "id": 25,
      "start": 1949.5999755859375,
      "end": 1954.6799774169922,
      "text": " as much as they possibly could. Isn't that what we try to do? Try to suppress those things."
    },
    {
      "id": 26,
      "start": 1954.6799774169922,
      "end": 1959.5999755859375,
      "text": " Try to suppress them. But you know what God does? He brings it right to the forefront."
    },
    {
      "id": 27,
      "start": 1959.5999755859375,
      "end": 1965.4399871826172,
      "text": " We can deal with this. I can handle this. I'm thankful that God was working locally"
    },
    {
      "id": 28,
      "start": 1965.4399871826172,
      "end": 1971.3599853515625,
      "text": " and globally but God was working personally. Our God is a personal God. And He works in"
    },
    {
      "id": 29,
      "start": 1971.3599853515625,
      "end": 1976.7999877929688,
      "text": " the lives of His people. And as we allow Him to have His way, as we say as the psalmist"
    },
    {
      "id": 30,
      "start": 1976.7999877929688,
      "end": 1985.3999786376953,
      "text": " does in Psalm 139, God search me oh God. Search me oh God. And show me if there be"
    },
    {
      "id": 31,
      "start": 1985.3999786376953,
      "end": 1990.959976196289,
      "text": " any wicked way in my life. Right? That's what the Bible teaches us. That process of self-examination."
    },
    {
      "id": 32,
      "start": 1990.959976196289,
      "end": 1995.47998046875,
      "text": " And so we find that God is working in the lives of these brothers. They say what is"
    },
    {
      "id": 33,
      "start": 1995.47998046875,
      "end": 2005.1599884033203,
      "text": " this that God hath done unto us? Surely we are guilty concerning our brother. And they"
    },
    {
      "id": 34,
      "start": 2005.1599884033203,
      "end": 2012.239990234375,
      "text": " understand what is taking place and how God is working. God is at work in the life of"
    },
    {
      "id": 35,
      "start": 2012.239990234375,
      "end": 2016.999984741211,
      "text": " Joseph. God is at work in the lives of the ten brothers. I believe that God is at work"
    },
    {
      "id": 36,
      "start": 2016.999984741211,
      "end": 2025.8399810791016,
      "text": " in Jacob's life. Look at verse 29. And they, nine of them, He sent ten out. And they, nine"
    },
    {
      "id": 37,
      "start": 2025.8399810791016,
      "end": 2031.3199768066406,
      "text": " of them, came unto Jacob their father unto the land of Canaan. And notice what the next"
    },
    {
      "id": 38,
      "start": 2031.3199768066406,
      "end": 2038.999984741211,
      "text": " phrase says. And told him all that befell unto them. They didn't just come back with"
    },
    {
      "id": 39,
      "start": 2038.999984741211,
      "end": 2048.519989013672,
      "text": " some food. They came back with a story. With an account of what took place. Here's what"
    },
    {
      "id": 40,
      "start": 2048.519989013672,
      "end": 2057.1199951171875,
      "text": " happened. Dad you sent us there. We came back with food but a whole lot more. Now they don't"
    },
    {
      "id": 41,
      "start": 2057.1199951171875,
      "end": 2062.3999938964844,
      "text": " reveal everything to Jacob. They don't reveal to Jacob at this particular juncture. We don't,"
    },
    {
      "id": 42,
      "start": 2062.3999938964844,
      "end": 2067.6799926757812,
      "text": " we see that not a place here where they reveal what they have done and really the conviction"
    },
    {
      "id": 43,
      "start": 2067.6799926757812,
      "end": 2073.6399841308594,
      "text": " that they're dealing with. Why? They don't want to tell Jacob. So we find that the, verse"
    },
    {
      "id": 44,
      "start": 2073.6399841308594,
      "end": 2078.519989013672,
      "text": " number 30, the man who is the Lord of the land. Now who is that? That's Joseph. That's"
    },
    {
      "id": 45,
      "start": 2078.519989013672,
      "end": 2083.8399963378906,
      "text": " their younger brother. That's the one who is not. According to what they say in verse"
    },
    {
      "id": 46,
      "start": 2083.8399963378906,
      "end": 2091.1199951171875,
      "text": " number 13, and one is not, the man, the ruler of the land, he is Joseph. And it says the"
    },
    {
      "id": 47,
      "start": 2091.1199951171875,
      "end": 2097.3199768066406,
      "text": " man who is the Lord of the land spake roughly to us and took us for spies of the country."
    },
    {
      "id": 48,
      "start": 2097.3199768066406,
      "end": 2101.3199768066406,
      "text": " And we said unto him, we are true men, we are no spies. We be twelve brethren, sons"
    },
    {
      "id": 49,
      "start": 2101.3199768066406,
      "end": 2105.0799865722656,
      "text": " of our father. One is not, that's Joseph. And the youngest is this day with our father"
    },
    {
      "id": 50,
      "start": 2105.0799865722656,
      "end": 2109.199981689453,
      "text": " in the land of Canaan. The man, the Lord of the country said unto us, hereby shall I know"
    },
    {
      "id": 51,
      "start": 2109.199981689453,
      "end": 2113.5599975585938,
      "text": " that you are true men. Leave one of your brethren here with me and take food for the famine"
    },
    {
      "id": 52,
      "start": 2113.5599975585938,
      "end": 2118.5999755859375,
      "text": " of your households and be gone. And bring your youngest brother unto me. Then shall"
    },
    {
      "id": 53,
      "start": 2118.5999755859375,
      "end": 2123.3199768066406,
      "text": " I know that you are no spies, but you are true men. So will I deliver you your brother,"
    },
    {
      "id": 54,
      "start": 2123.3199768066406,
      "end": 2126.5599975585938,
      "text": " that's Simeon, and ye shall traffic in the land. In other words, they'd be able to come"
    },
    {
      "id": 55,
      "start": 2126.5599975585938,
      "end": 2130.0399780273438,
      "text": " back and forth and receive the goods, the food that they would need during the time"
    },
    {
      "id": 56,
      "start": 2130.0399780273438,
      "end": 2133.6399841308594,
      "text": " of famine. Joseph was the one that knew it was going to be seven years long. We don't"
    },
    {
      "id": 57,
      "start": 2133.6399841308594,
      "end": 2137.7999877929688,
      "text": " know at this particular time exactly how much time has passed. You can kind of guess at"
    },
    {
      "id": 58,
      "start": 2137.7999877929688,
      "end": 2144.5599975585938,
      "text": " it. But the reality is that we find that when later on, when Joseph is revealing to"
    },
    {
      "id": 59,
      "start": 2144.5599975585938,
      "end": 2149.3999938964844,
      "text": " his brothers what was going on, he says in verse number 6 of chapter 45, for these two"
    },
    {
      "id": 60,
      "start": 2149.3999938964844,
      "end": 2154.3799743652344,
      "text": " years hath the famine been in the land. And so this is very early with regard to the seven"
    },
    {
      "id": 61,
      "start": 2154.3799743652344,
      "end": 2158.959991455078,
      "text": " years of famine. And so he tells them, he gives the plan, and now the boys are telling"
    },
    {
      "id": 62,
      "start": 2158.959991455078,
      "end": 2165.5999755859375,
      "text": " dad, these nine, verse 35, and it came to pass as they emptied their sacks, that behold,"
    },
    {
      "id": 63,
      "start": 2165.5999755859375,
      "end": 2169.6799926757812,
      "text": " every man's bundle of money was in his sack. And when both they and their father saw the"
    },
    {
      "id": 64,
      "start": 2169.6799926757812,
      "end": 2178.3999938964844,
      "text": " bundles of money, they were afraid. And Jacob, their father, said unto them, Me have ye bereaved"
    },
    {
      "id": 65,
      "start": 2178.3999938964844,
      "end": 2185.8799743652344,
      "text": " of my children. Notice where he says, Joseph is not. He's dead in his mind. Simeon is not."
    },
    {
      "id": 66,
      "start": 2185.8799743652344,
      "end": 2194.759979248047,
      "text": " He's in prison in Egypt, right? And ye will take Benjamin away. All these things are against"
    },
    {
      "id": 67,
      "start": 2194.759979248047,
      "end": 2205.1199951171875,
      "text": " me. You know, Jacob, God was working in his life too. God was working in Jacob's life."
    },
    {
      "id": 68,
      "start": 2205.1199951171875,
      "end": 2210.019989013672,
      "text": " Reuben spake unto his father, saying, Slay my two sons, if I bring them not to thee."
    },
    {
      "id": 69,
      "start": 2210.019989013672,
      "end": 2215.0399780273438,
      "text": " Deliver him into my hand, and I will bring him to thee again. Now obviously Reuben had"
    },
    {
      "id": 70,
      "start": 2215.0399780273438,
      "end": 2218.719970703125,
      "text": " no way of being able to really guarantee that he'd be able to do that, but that's what he"
    },
    {
      "id": 71,
      "start": 2218.719970703125,
      "end": 2223.959991455078,
      "text": " says. In verse 38, he said, My son shall not go down with you. For his brother is dead,"
    },
    {
      "id": 72,
      "start": 2223.959991455078,
      "end": 2230.0399780273438,
      "text": " and he is left alone. If mischief befall him by the way, and the witchy go, then shall"
    },
    {
      "id": 73,
      "start": 2230.0399780273438,
      "end": 2237.8799743652344,
      "text": " ye bring down my gray hairs with sorrow to the grave. Listen, God's working in Jacob's"
    },
    {
      "id": 74,
      "start": 2237.8799743652344,
      "end": 2245.8799743652344,
      "text": " life. Jacob needs to learn to trust the Lord. Jacob needs to learn some things about who"
    },
    {
      "id": 75,
      "start": 2245.8799743652344,
      "end": 2252.3199768066406,
      "text": " God is and what God is able to do. In fact, as you fast forward through the life of Joseph"
    },
    {
      "id": 76,
      "start": 2252.3199768066406,
      "end": 2257.0799865722656,
      "text": " in the next several chapters, you find that it's reported that Joseph is alive. He makes"
    },
    {
      "id": 77,
      "start": 2257.0799865722656,
      "end": 2262.5599975585938,
      "text": " himself known to his brothers, and that news gets back to Jacob, and Jacob then will journey"
    },
    {
      "id": 78,
      "start": 2262.5599975585938,
      "end": 2267.8399963378906,
      "text": " to go into Egypt. But before we get too far ahead of ourselves, we understand that God"
    },
    {
      "id": 79,
      "start": 2267.8399963378906,
      "end": 2273.6799926757812,
      "text": " is working personally in Genesis chapter 42. I wonder this evening, as we look at this"
    },
    {
      "id": 80,
      "start": 2273.6799926757812,
      "end": 2281.939971923828,
      "text": " portion of Scripture and we see the dialogue, we see the account, the events as they unfold"
    },
    {
      "id": 81,
      "start": 2281.939971923828,
      "end": 2291.259979248047,
      "text": " on this first visit to Egypt. So much more than what these 10 brothers expected. I don't"
    },
    {
      "id": 82,
      "start": 2291.259979248047,
      "end": 2298.0599975585938,
      "text": " think for a moment they were thinking God was going to convict them, deal with them"
    },
    {
      "id": 83,
      "start": 2298.0599975585938,
      "end": 2303.739990234375,
      "text": " in this manner. But I wonder as I look at this portion of Scripture, I'm amazed by the"
    },
    {
      "id": 84,
      "start": 2304.739990234375,
      "end": 2312.8999633789062,
      "text": " sensitivity of them recognizing that God was at work. Think about it this way with me."
    },
    {
      "id": 85,
      "start": 2312.8999633789062,
      "end": 2318.5399780273438,
      "text": " Sometimes we deal with circumstances and situations and we say, well, it's just bad luck, just"
    },
    {
      "id": 86,
      "start": 2318.5399780273438,
      "end": 2324.3800048828125,
      "text": " misfortune, just this thing happened. You know, these boys, I don't think they were"
    },
    {
      "id": 87,
      "start": 2324.3800048828125,
      "end": 2332.9400024414062,
      "text": " very close to God, but you know their immediate response? God is at work. What is this that"
    },
    {
      "id": 88,
      "start": 2332.9400024414062,
      "end": 2344.5599975585938,
      "text": " God hath done unto us? I wonder tonight, how quick are we to acknowledge God working"
    },
    {
      "id": 89,
      "start": 2344.5599975585938,
      "end": 2350.97998046875,
      "text": " in our lives? When that circumstance, whatever it might be, when this thing happens in your"
    },
    {
      "id": 90,
      "start": 2350.97998046875,
      "end": 2356.219970703125,
      "text": " life and in my life, we know, listen, we know that God is sovereign. We know that God is"
    },
    {
      "id": 91,
      "start": 2356.219970703125,
      "end": 2364.5799560546875,
      "text": " a pursuing God. God is an intimate, personal God. We can stand here and say, I want to"
    },
    {
      "id": 92,
      "start": 2364.5799560546875,
      "end": 2369.1399536132812,
      "text": " be right with God. God wants you to be right with Him more than you could ever want to"
    },
    {
      "id": 93,
      "start": 2369.1399536132812,
      "end": 2377.8200073242188,
      "text": " be right with God. I believe that with all my heart tonight. Draw an eye unto God and"
    },
    {
      "id": 94,
      "start": 2377.8200073242188,
      "end": 2386.2000122070312,
      "text": " He'll draw an eye unto you. Amen? And I wonder tonight when that thing happens in my life"
    },
    {
      "id": 95,
      "start": 2386.2000122070312,
      "end": 2392.8800048828125,
      "text": " and in your life, do we recognize it as being the hand of God? Do we examine our lives and"
    },
    {
      "id": 96,
      "start": 2392.8800048828125,
      "end": 2396.8800048828125,
      "text": " say, what is God trying to teach me through this? How is God trying to grow me through"
    },
    {
      "id": 97,
      "start": 2396.8800048828125,
      "end": 2397.0,
      "text": " this?"
    },
    {
      "id": 0,
      "start": 2397.0,
      "end": 2402.5599999427795,
      "text": " this? How's God going to use me through this? Or do we just write it off as some kind of"
    },
    {
      "id": 1,
      "start": 2402.5599999427795,
      "end": 2407.800000190735,
      "text": " bad misfortune, bad luck, whatever word we want to use to just kind of again continue"
    },
    {
      "id": 2,
      "start": 2407.800000190735,
      "end": 2416.9599990844727,
      "text": " to suppress something? You understand what I'm saying tonight? These boys, God is at"
    },
    {
      "id": 3,
      "start": 2416.9599990844727,
      "end": 2425.760000228882,
      "text": " work. What has God done to us? And I just wonder tonight, how's God working in our lives?"
    },
    {
      "id": 4,
      "start": 2425.760000228882,
      "end": 2431.759998321533,
      "text": " Do you see God working in your life? Do you hear the voice of God when you read the Bible,"
    },
    {
      "id": 5,
      "start": 2431.759998321533,
      "end": 2435.9199981689453,
      "text": " when you come to church, when you hear the preaching of God's word? Is God working in"
    },
    {
      "id": 6,
      "start": 2435.9199981689453,
      "end": 2444.2000007629395,
      "text": " your life? Are there some things that God's putting his finger on? And maybe we don't"
    },
    {
      "id": 7,
      "start": 2444.2000007629395,
      "end": 2451.7999992370605,
      "text": " like it. Maybe we don't want to deal with it. But God's at work. And God's going to"
    },
    {
      "id": 8,
      "start": 2451.7999992370605,
      "end": 2457.560001373291,
      "text": " continue to pursue. God's going to continue to pursue. And God wants you to not have"
    },
    {
      "id": 9,
      "start": 2457.560001373291,
      "end": 2464.680000305176,
      "text": " a hard heart, but to have a tender heart. He doesn't want us to be hardened, but to"
    },
    {
      "id": 10,
      "start": 2464.680000305176,
      "end": 2472.279998779297,
      "text": " be softened, to be tender. And this evening, as we look at Genesis chapter 42, we see how"
    },
    {
      "id": 11,
      "start": 2472.279998779297,
      "end": 2478.0800018310547,
      "text": " God is working in the life of Joseph, the life of the brothers, the life of Jacob. I"
    },
    {
      "id": 12,
      "start": 2478.2399978637695,
      "end": 2484.120002746582,
      "text": " just believe tonight that God's working in our lives as well. And I wonder, are we able"
    },
    {
      "id": 13,
      "start": 2484.120002746582,
      "end": 2490.720001220703,
      "text": " to recognize it? And how do we respond to it? What is God doing? How is God working?"
    },
    {
      "id": 14,
      "start": 2490.720001220703,
      "end": 2498.720001220703,
      "text": " Will we let God be God and have his way? Let's pray together. Father, we love you. We thank"
    },
    {
      "id": 15,
      "start": 2498.720001220703,
      "end": 2509.319999694824,
      "text": " you for loving us. God, we thank you for this portion of Scripture, for the opportunity"
    },
    {
      "id": 16,
      "start": 2509.319999694824,
      "end": 2521.2399978637695,
      "text": " to see how you're a personal God. Lord, I pray that in the quietness of the moment tonight,"
    },
    {
      "id": 17,
      "start": 2521.2399978637695,
      "end": 2530.520004272461,
      "text": " as we've heard the preaching of your word, as we have a time of invitation even in preparation"
    },
    {
      "id": 18,
      "start": 2530.520004272461,
      "end": 2538.5599975585938,
      "text": " for observing the Lord's Supper, God, I pray that you'd help us to examine ourselves. God,"
    },
    {
      "id": 19,
      "start": 2538.5599975585938,
      "end": 2551.039993286133,
      "text": " I pray that you'd help us to submit, to surrender to thee. Lord, I don't know how you're working"
    },
    {
      "id": 20,
      "start": 2551.039993286133,
      "end": 2559.479995727539,
      "text": " in everyone's life. I believe that you are at work. And I know at times it's uncomfortable,"
    },
    {
      "id": 21,
      "start": 2559.479995727539,
      "end": 2569.8800048828125,
      "text": " it's difficult. But God, I pray that you'd help us to submit and surrender. God, we would"
    },
    {
      "id": 22,
      "start": 2569.8800048828125,
      "end": 2577.6799926757812,
      "text": " see and acknowledge that you are at work. Would you have your will and way in these"
    },
    {
      "id": 23,
      "start": 2577.6799926757812,
      "end": 2581.8800048828125,
      "text": " moments of invitation? Well, thank you for what you'll do. For it's in Christ's name"
    },
    {
      "id": 24,
      "start": 2581.8800048828125,
      "end": 2582.5599975585938,
      "text": " we pray."
    }
  ],
  "processed_at": "2025-04-15T10:30:00.651969"
}