{
  "video_id": "cZ76dCVG9Gg",
  "text": "Proverbs, chapter number 15, verse number 1 is our text this evening. I've titled the message, The Power of Our Words, The Power of Our Words, Proverbs 15 verse number 1. The Bible says this, a soft answer turneth away wrath, but grievous words stir up anger. It's amazing for me and I think for you as well to think about the power of our words. We can use our words to build up in a positive manner or we can use our words to bring low in a negative manner. I think about the positive use of our words to give compliment, to give thanks, to encourage. We can do all of that with our words. It's pretty amazing what we can do with our words, how we can encourage someone, how we can compliment someone, how we can give thanks, of course, to our God supremely, but also to one another. And we think about that being used in a positive fashion, but we do understand that our words can be used in a negative connotation as well. We can criticize, complain, attack. You know, God hears us, all of our words. He hears us. It's interesting if you were to study in the Old Testament, especially in the book of Numbers, you'll find the people complaining regularly, the children of Israel. The Bible will say often how that God heard their complaint. He heard their words. I think about the positive and the negative aspect of our words and I think about this single verse of Scripture here in Proverbs 15 and verse number 1, and what a great contrast that we see here in this verse of Scripture. The Bible says a soft answer. Notice the thought there, a soft answer, something that is tender or delicate, the answer being the response. And no doubt we can understand how our words can have that tender or delicate answer that we would provide a response to someone and we find that the Bible says that a soft answer turneth away wrath. That's powerful. That's powerful. A soft answer, tender, delicate response, the Bible says turneth away wrath. Not sharp, not harsh, but tender, delicate. Notice the contrast. The Bible says, but grievous words, grievous words, those are hurtful or painful, that which would cause grief or sorrow, that which is provoking or offensive, that's what grievous means. And those grievous words, notice what the Bible says, they stir up anger. It's interesting because we see a turning away of wrath and we see a stirring up of anger. It is the soft answer that turneth away wrath, but it is the grievous words that stir up anger. Have you ever heard someone use the expression that they're just adding fuel to the fire? You've heard someone use that expression before? You've understood no doubt in your life and I know in my life we absolutely have understood the power of our words. Consider with me the counsel that we see in Proverbs 4 and verse number 24, and you don't need to turn to all these verses, I'm going to try to go quickly this evening, it's already 10 till. In Proverbs 4 and verse number 24 the Bible says this, put away from thee a froward mouth and perverse lips put far from thee. That's good counsel. To put away from thee a froward mouth and perverse lips put far from thee. I consider the counsel from Proverbs 4 and verse 24, I consider the truth that God gives us in Proverbs 18 and verse number 21, where there the Bible says this, death and life are in the power of the tongue. They that love it shall eat the fruit thereof. Did you hear that? Death and life are in the power of the tongue. Wow. The observation that is given to us in Proverbs 21 and verse 23, where the Bible says, whoso keepeth his mouth and his tongue keepeth his soul from troubles. Proverbs 21, 23. Some of us need to memorize that verse of Scripture, amen? Seriously. Proverbs 21 and verse 23. Whoso keepeth his mouth and his tongue keepeth his soul from troubles. I'm sure that on more than one occasion or on more occasions than we'd like to admit, our words have caused us trouble. Amen? More often than we'd like to admit, our words have caused us trouble. And here we find that the Bible says, whoso keepeth his mouth and his tongue keepeth his soul from troubles. Have you ever had a situation and say, man, I wish I didn't say that? You're trying to catch your words as they're leaving your mouth, but guess what? You can't do that. I remember this expression, and we spoke, obviously, today is Mother's Day. This morning, the truth from Proverbs 31, my mother taught me. I remember hearing this often from my mom as I was growing up, and as you know, I didn't get saved until I was a senior in high school. My parents didn't get saved until I was, I think, eighth grade when they got saved. And so as a young kid, I would hear, not from a biblical perspective, but just from a moral perspective, if you don't have anything nice to say, tell me what it says. Don't say anything at all, right? You've heard that, no doubt, right? And I remember hearing that from my mom at a young age. I also remember hearing this, think before you speak. Think before you speak. Now sometimes we have a problem with that. Because sometimes we just, I mean, our mouth just kind of, I mean, it just rolls, right? Sometimes something happens in life, something is going on, someone says something to us. You think about that truth of Proverbs 15 and verse number one, where the Bible says, a soft answer turns away wrath, but grievous words stir up anger. There are times in your life and in my life when someone has said something to us and we respond not with a soft answer, but with grievous words, and all of a sudden, wrath is stirred up. Anger is stirred up. We find here that as we think about the power of our words this evening, and I think about those two statements that I often remember my mom sharing with me throughout the years, I would think of this, that some have put this idea of think before you speak to an acronym, THINK, T-H-I-N-K. And in eight minutes, I'm going to try to get through it, amen? And you guys like to fellowship anyway, so I'll preach a little bit longer tonight, amen? But no, honestly, let me just try to get through this, T. Here's some questions to ask ourselves when we are going to use our words, because we understand the power of our words, and we think about this, and we're going to use this acronym THINK. Number one, the T, is it truthful? Is it truthful? In Ephesians 4 and verse number 15, we are instructed to speak the truth in love, to speak the truth in love. Now we think about that, that verse of Scripture and the admonition that is given to us that we are to speak the truth, and so we must ensure that what we are saying is truthful, but God says that we're to speak the truth in love, in love. So there's a way in which we have to speak the truth, and that is in love. Think about this, in the book of Zechariah, the Old Testament prophet, I want you to notice what Zechariah says in Zechariah 8 and verse number 16. The Bible says this, these are the things that ye shall do, speak every man the truth to his neighbor, execute the judgment of truth, and peace in your gates. And what a difference a society would be if every man spoke truth to his neighbor. Honestly, it would be a different society altogether. Zechariah 8 and verse 16 tells us, of course, the passage continues with other things that we ought to do, but the first one that is mentioned there is that we're to speak every man the truth to his neighbor. Is it truthful? Let's say this, is it helpful? Is it helpful? Ephesians chapter number 4 and verse number 29, the Bible tells us how we can use our words, and I've already mentioned that we can use them in a positive fashion, also in a negative fashion, but we find that in Ephesians 4 and verse number 29, the Bible says there that we're to let no corrupt communication proceed out of your mouth. But notice what it says, but that which is good to the use of edifying, that it, those words that we speak, that they may minister grace unto the hearers. So are our words helpful? Have you ever been in a situation where maybe you were thinking before you spoke and there was something that came to your mind to say and you said, you know, that's probably not very helpful in this circumstance. It's not very helpful in this situation for me to speak. this thing. And we find that it is to be used, notice, for the use of edifying. The word edify is such an important word for us to understand as we read through the New Testament. We see so often that God uses that word and how we're to build up one another. I mentioned already by way of introduction that we can use our words in a positive manner to build up or we can use them in the negative to bring low. Oh, that God would help us to use our words to build people up, to edify them. We find that the Bible teaches us in the book of Psalms, in Psalm 37 and verse number 30, with regard to this thought of whether it's helpful. In Psalm 37 and verse number 30, the psalmist says this, speaking of the righteous man, that the mouth of the righteous speaketh wisdom and his tongue talketh of judgment. It's interesting because verse number 31 gives us the key as to why he speaks wisdom and he talks of judgment, and that is because the law of his God is in his heart. None of his steps shall slide. And the more time we spend in God's word, the more of God's word that's going to come out of our mouth. We're going to be able to use God's word. Listen, I believe this evening that God's word is helpful. It's profitable. We understand that. And so we ask ourselves, is this thing truthful? Is it helpful? I could ask it this way, is it inspiring? The I, T-H-I, number three there, is it inspiring? And we're there in Psalm 37, look over in chapter 35, and notice in verse number 28, Psalm 35 and verse number 28, the Bible says, and my tongue shall speak of thy righteousness and of thy praise all the day long. I want you to think about the psalmist and the manner in which you would use his words. And he says that my tongue shall speak, and of course of God, of God's righteousness and of thy praise all the day long. That's inspiring. You're going to hear somebody, listen, I don't like hearing people complain. How many of you like listening to people complain? I cannot stand listening to people complain. I want to be honest with you. I don't think God likes listening to us complain. He says it in his word over and over. He doesn't like complaining. But you know what we're good at as human beings? Complaining. We really are. We're good at it. We find here that we think about this thought of inspiring one another. And if somebody is speaking like the psalmist says here, that he's speaking of the righteousness of God and praising God all the day long, that's inspiring. And guess what? All of a sudden that's inspiring me to think about my Savior, to think about my God and to praise him along with the brother or sister that is praising the Lord. Psalm 77 and verse number 12 says it this way, I will meditate also of all thy work and talk of all thy doings. You know it's inspiring when someone talks about what God is doing. It really is. We can talk about what God has done in the past and the works that he's done that are contained within the pages of this precious book. But we can also talk about what God is doing in our life actively. We begin to talk about God's doings, God's workings in our lives. And that's inspiring to people. It's encouraging. The end, is it necessary? Is it necessary? Is it necessary? Let me share a few verses with you in the book of Proverbs chapter 11 and verse number 12. Some people may have a perspective that, well, it was necessary for me to say that, okay? Let's take everything else into consideration with regard to these biblical truths of speaking the truth in love. And I want you to think about this as we notice these few verses in the book of Proverbs with whether or not something is necessary for us to speak. Notice in Proverbs 11 and verse number 12, the Bible says, He that is void of wisdom despiseth his neighbor. But of man of understanding, notice what it says, holdeth his peace. You ever hear somebody say, I'm going to give him peace of my mind? I always laugh. It's probably going to be the last peace of your mind, right? I mean, you better be careful when you're giving somebody a peace of your mind. Typically, what follows when somebody says, I'm going to give you a peace of my mind, is not necessary. It's something that's not inspiring. It's something that's not helpful. Amen? I've had people say that to me. Let me give you a peace of my mind. And I already know what's coming. Notice in Proverbs 15, it says here that he that holdeth, a man of understanding holdeth his peace. Let's look over at chapter 15 and verse number 23. Proverbs 15 and verse number 23, the Bible says, A man hath joy by the answer of his mouth in a word spoken, notice this phrase, in due season. How good is it? I don't always know what the due season is, but the Holy Spirit does. I don't always know, but the Holy Spirit does. And as I'm abiding in the Spirit, as I'm walking in the Spirit, not fulfilling the lust of the flesh, as I'm seeking to follow the Lord, then something might be necessary to say, but it might not be the due season. Does that make sense this evening? It might not be the right place. It might not be the right setting. And God, the Holy Spirit, communes with our spirit. We can have that, you know, it's not really the right time to say that to that individual. That requires that we walk with God. It really does. That little phrase there, in due season, is impactful. Notice in Proverbs chapter 25 and verse number 11. In Proverbs 25 and verse number 11, going right along with this in due season from Proverbs 15 and verse 23, here the Bible says this, a word, fitly spoken, is like apples of gold and pictures of silver. And think about that phrase, fitly spoken. You know what it means, really? It carries with it literally the idea, at the right moment. At the right moment. That's what it means, fitly spoken. In due season, fitly spoken. I want to say this, when I think about this thought of whether it is necessary. At times, what might be necessary to say is also difficult to say. Have you ever experienced that in your life? It's necessary to say something, but it's a difficult something that you need to say. If you've not been in that position in life, I think one day you will be. I've been in that position many times, where I know that there's something that's necessary to say, but it's difficult. It's not easy. And I would say that in moments like those, we must spend much time in prayer, and we must deliver the words in an appropriate manner. When the Bible says, speak the truth in love, we think about something that's necessary. See, sometimes correction is necessary, correct? I mean, we all need correction at times in our lives. And we would say, well, it's necessary that I correct that behavior. You're in a position that you would have the responsibility of correcting the behavior of giving that word, and it's necessary. It's difficult. You're in a situation where you had to talk to someone, and your stomach just bothered you. You're just, man, I wish I really didn't have to have this meeting. Have you ever been there? I've been there more times than I could tell you. And in those moments, we've acknowledged it's necessary. It's going to be hard. It's necessary. And I would say that we must bathe it in prayer, and we must be careful to deliver the message in an appropriate manner. Look over at what the book of Proverbs, here in chapter 27, just a couple of chapters from where we were in chapter 25. Notice in chapter 27, in verse number 6, notice what the Bible says. Speaking on our words, not which is necessary, but yet difficult. The Bible says, faithful are the wounds of a friend. But the kisses of an enemy are deceitful. As we're going to think about this verse of Scripture, and begin to consider this evening, this truth of what is necessary, and as I consider that which is necessary, but yet difficult at the same time, and I also understand the Bible says, faithful are the wounds of a friend. I preached a message a couple of weeks ago on Sunday evening that I entitled, Divisions and Contentions. And in that message, I was speaking there from the book of 1 Corinthians, chapter number 1, and I mentioned that during times of conflict, there are some things that we must consider so that we would respond properly. And one of those was that we must review what we know to be true. When someone is a friend, I mean, I'm saying truly a biblical friend, the definition of a friend. The Bible says, iron sharpeneth iron, and the Bible says, faithful are the wounds of a friend. I don't know this evening where you are in your life, but I would say this, that there comes a time in our lives where there might be the need for a friend to deliver to us a message that is difficult. but necessary. Necessary, but difficult. And in those moments we must understand that the Bible says faithful are the wounds of a friend. Now, I would not say that someone has the liberty to use this verse of Scripture and violate other verses of Scripture that we've already looked at and say, well, faithful are the wounds of a friend. That's not what I'm suggesting this evening. But there are times that something is necessary to be said. And my question at that time, and as we have to deal with it as adults in dealing with someone, a friend coming and giving us something that's maybe challenging to receive, do we have the humility? Do we understand that they love us and they have our best interest at heart and at mind? I'll give you a simple, silly illustration. Have you ever heard somebody public speak that says, um, all the time? Sure you have. Have you ever heard somebody that public speaks that says okay a lot? Okay, okay, okay. There's a professor at Bible College, not the Bible College that I went to, but a fellow that I worked with after I was, actually I was in Bible College at the time, and his professor said okay all the time. And so he gathered some of the students together and he said, listen, next time he says okay, here's what we're going to do. All the class together is going to say, okay, okay, okay, okay, okay, okay. Let's just say the professor wasn't very pleased with that, okay? It was not well received. When I first started preaching, I would say okay quite a bit. It was just my thing. I just said okay. And it was almost like a, are you following, are you tracking, are you where I am, that kind of a thing. And I was doing my internship at a church, and I was still in Bible College, and I had to, I had to preach a number of messages during my internship, and a man in the church, Henry Barfield, he's with the Lord now, and Henry Barfield came to me and he handed me two dollars worth of quarters. He said, I want you to put these in your pocket, and I want you to jingle them around. Okay? So I did it. He said, it's annoying, right? Yeah, actually it is. He said, every time you say okay, that's what it sounds like. That's what he said to me. And he said, here's what I want you to know. When I first started, now he wasn't a pastor, he was a, he was an adult Sunday school teacher in a church for 25 years. Taught adult Sunday school. A deacon in a church, just a solid Christian. He said, when I first started teaching, I said um all the time. And he said, somebody in the church gave me two dollars worth of quarters, so I'm going to put them in my pocket. Now I don't carry two dollars worth of quarters in my pocket, but that man, after teaching for all those years, every time he taught he had quarters in his pocket. And that was his reminder to not say um. I don't have to carry the quarters to not say okay, at least I think. I don't say it as often as I used to, that's for sure. But the reality is that, listen, I could have been offended by that. Could have been hurtful. But you know what, that man was just trying to help me. He was just trying to help me. He was just trying to be a blessing. And it's a silly illustration, some simple kind of thing, but nonetheless we find this evening that there are times in which we have a message to deliver to somebody that's necessary, but difficult. And in those times we need the help of God. And we need God's help to be able to deliver that message. And when that message is delivered, my response is so vital. Why? Because a soft answer turneth away wrath, but grievous words stir up anger. Number five, if I count it right, K, is it kind? Is it kind? How many of you heard little kids running around and you heard parents say, speak kindly, use kind words. We ask ourselves, is it kind? Look over at the book of Ephesians. We've already referenced three verses from Ephesians chapter number four, or excuse me, this is the third verse from Ephesians chapter number four. Notice in chapter four in verse number 32, we find that he said in verse number 15 that we're to speak the truth in love. We find in verse number 29 that our words are to be used for the use of edifying, that it may minister grace unto the hearers. And then here in verse number 32 the Bible says, and be kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you. Be kind. Notice Colossians chapter number four, and we'll finish with this verse of scripture. In Colossians four in verse number six, it's a familiar verse. In fact, at the, I believe it was the last Sunday of 2022, so just five months ago or so, I preached a message from this portion of scripture, Colossians four, verse five and six. And I don't remember exactly what I titled the message, something with regard to having a successful year, that sort of thing. And I talked about walking in wisdom toward them that are without and redeeming the time. And then I talked about this in verse number six, let your speech, notice those words, these are difficult words, be always with grace. That little word in Colossians four in verse number six where it says, always, that's an important word. It's a difficult word. You know why? Sometimes we just don't feel like it. Sometimes our flesh wants to just say something. You have the flesh just like I do. We all have the flesh. We're to mortify our members, we're to crucify our flesh. But you know, it's very amazing to me how quickly our flesh can come alive. Have you ever experienced that? I mean, you're walking in the spirit, you're just rejoicing in the Lord and then something happens and all of a sudden it's like, man, what happened? I was trying to rent a piece of machinery probably ten years ago for the church and I was in the place of business trying to rent a piece of machinery to do some work here at the church and the owner of that establishment just ripped me to pieces. I mean, just criticized me, he questioned my integrity, he questioned, I mean, he just was ugly nasty, just rude. You call yourself a preacher and you're trying to get away with paying taxes. He was just going after me. All because I tried to give him a tax exempt form that is a state of Virginia form to not have to pay taxes for the piece of equipment that we're renting. You call yourself a preacher. I mean, he was going after me. And here's all I could, the Holy Spirit just kept running around. I just, five minutes earlier I was just praying this, Lord help me to walk in the spirit today. Lord help me not to give in to the flesh. Lord help me to walk in the spirit. And I pray this, Lord help me to be dead to criticisms and to compliments. And it was real in that moment because I wanted to tell that guy a few things as well. I'm just being honest with you. I mean, he was questioning my integrity. It was, and I just stood there. I just stood there. And he got done. And I very quietly, very kindly and politely, I said, sir, with all due respect, could you just read letter B of this form and let me know why this is not, I don't mind paying the taxes, but can you just explain it to me? Ripped the paper out of my hand, read it, threw it on the table, whatever, I won't charge you the taxes. I mean, just ugly. But listen, sometimes that happens in our lives. But how do we respond to it? How do we respond to it? Talked about divisions and contentions a couple of weeks ago. You know, people sometimes respond to that kind of stuff today. They go to their car and they get some kind of weapon and they do some bad stuff. No, no, no, no. That's not how we respond. We have to be kind. A soft answer, turn it the way we're at. It's a biblical promise. Grievous words stir up anger. This evening, our words are powerful. Our words are powerful. And if we're not careful, we don't take heed to the truth of Proverbs 21 and verse 23. And our words, they cause us trouble, cause us trouble. I hope this evening that God would help us to understand the power of our words to set a watch, a gate before our mouth, that we would think before we speak. Say, God, I want to honor you with my words. I want to build people up with my words. At times, you're going to have to deliver a message to someone that's necessary but difficult. And in those moments, oh, you need to beg God for help, grace and mercy, to be able to communicate effectively and appropriately that message. Our words are powerful, very powerful. This evening, I hope that each and every one of us say, God, I want my words to be pleasing to thee. Let me finish. I said I was going to finish with this verse, but let me just finish with Psalm 19. Psalm 19. Look there with me. Psalm 19. We're familiar with the psalm, the heavens declare the glory of God, the firmament showeth His handiwork, but I want you to notice verse 14. Psalm 19 and verse 14. We actually don't do this very often, but would you read the verse with me? Psalm 19 and verse number 14. Let's read it together. Let the words of my mouth and the meditation of my heart be acceptable in thy sight, O Lord, my strength and my redeemer. In whose sight? In God's sight. Let the words of my mouth and the meditation of my heart be acceptable in thy sight, O Lord, my strength and my redeemer. Father, we love you. We thank you for loving us. We thank you for the privilege of being able to be gathered in the house of God today. Lord, we thank you for Mother's Day, the opportunity that we've had to honor the ladies of our church. God, we thank you for your word and for the truth of your word. It's so applicable in our lives. It's relevant for everyday living. God, this message this evening is one that, I think if we'd be honest, steps on all of our toes. God, I pray that that verse that we just read in unison together would be the motto of our lives, that the words of our mouth, the meditation of our heart would be acceptable, O Lord, in thy sight. Lord, help us to please you with our words. Help us to understand this evening the power of our words. I pray that as we have a moment of invitation that you'd move and work in hearts and lives as only you can. Oh, God, I pray that we do business with you. I pray that we would be doers of the word and not hearers only. We'll thank you for the work that you'll do. For it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 23.15999984741211,
      "text": " Proverbs, chapter number 15, verse number 1 is our text this evening."
    },
    {
      "id": 1,
      "start": 23.15999984741211,
      "end": 29.360000610351562,
      "text": " I've titled the message, The Power of Our Words, The Power of Our Words, Proverbs 15"
    },
    {
      "id": 2,
      "start": 29.360000610351562,
      "end": 30.360000610351562,
      "text": " verse number 1."
    },
    {
      "id": 3,
      "start": 30.360000610351562,
      "end": 38.880001068115234,
      "text": " The Bible says this, a soft answer turneth away wrath, but grievous words stir up anger."
    },
    {
      "id": 4,
      "start": 38.880001068115234,
      "end": 47.36000061035156,
      "text": " It's amazing for me and I think for you as well to think about the power of our words."
    },
    {
      "id": 5,
      "start": 47.36000061035156,
      "end": 53.63999938964844,
      "text": " We can use our words to build up in a positive manner or we can use our words to bring low"
    },
    {
      "id": 6,
      "start": 53.63999938964844,
      "end": 56.2400016784668,
      "text": " in a negative manner."
    },
    {
      "id": 7,
      "start": 56.2400016784668,
      "end": 63.31999969482422,
      "text": " I think about the positive use of our words to give compliment, to give thanks, to encourage."
    },
    {
      "id": 8,
      "start": 63.31999969482422,
      "end": 64.68000030517578,
      "text": " We can do all of that with our words."
    },
    {
      "id": 9,
      "start": 64.68000030517578,
      "end": 69.08000183105469,
      "text": " It's pretty amazing what we can do with our words, how we can encourage someone, how we"
    },
    {
      "id": 10,
      "start": 69.08000183105469,
      "end": 75.4800033569336,
      "text": " can compliment someone, how we can give thanks, of course, to our God supremely, but also"
    },
    {
      "id": 11,
      "start": 75.4800033569336,
      "end": 76.4800033569336,
      "text": " to one another."
    },
    {
      "id": 12,
      "start": 76.4800033569336,
      "end": 81.95999908447266,
      "text": " And we think about that being used in a positive fashion, but we do understand that our words"
    },
    {
      "id": 13,
      "start": 81.95999908447266,
      "end": 84.4800033569336,
      "text": " can be used in a negative connotation as well."
    },
    {
      "id": 14,
      "start": 84.4800033569336,
      "end": 91.19999694824219,
      "text": " We can criticize, complain, attack."
    },
    {
      "id": 15,
      "start": 91.19999694824219,
      "end": 94.0,
      "text": " You know, God hears us, all of our words."
    },
    {
      "id": 16,
      "start": 94.0,
      "end": 95.0,
      "text": " He hears us."
    },
    {
      "id": 17,
      "start": 95.0,
      "end": 100.36000061035156,
      "text": " It's interesting if you were to study in the Old Testament, especially in the book of Numbers,"
    },
    {
      "id": 18,
      "start": 100.36000061035156,
      "end": 104.16000366210938,
      "text": " you'll find the people complaining regularly, the children of Israel."
    },
    {
      "id": 19,
      "start": 104.16000366210938,
      "end": 107.76000213623047,
      "text": " The Bible will say often how that God heard their complaint."
    },
    {
      "id": 20,
      "start": 107.76000213623047,
      "end": 109.76000213623047,
      "text": " He heard their words."
    },
    {
      "id": 21,
      "start": 109.76000213623047,
      "end": 114.04000091552734,
      "text": " I think about the positive and the negative aspect of our words and I think about this"
    },
    {
      "id": 22,
      "start": 114.04000091552734,
      "end": 118.27999877929688,
      "text": " single verse of Scripture here in Proverbs 15 and verse number 1, and what a great contrast"
    },
    {
      "id": 23,
      "start": 118.27999877929688,
      "end": 121.0199966430664,
      "text": " that we see here in this verse of Scripture."
    },
    {
      "id": 24,
      "start": 121.0199966430664,
      "end": 123.91999816894531,
      "text": " The Bible says a soft answer."
    },
    {
      "id": 25,
      "start": 123.91999816894531,
      "end": 130.27999877929688,
      "text": " Notice the thought there, a soft answer, something that is tender or delicate, the answer being"
    },
    {
      "id": 26,
      "start": 130.27999877929688,
      "end": 131.27999877929688,
      "text": " the response."
    },
    {
      "id": 27,
      "start": 131.27999877929688,
      "end": 139.32000732421875,
      "text": " And no doubt we can understand how our words can have that tender or delicate answer that"
    },
    {
      "id": 28,
      "start": 139.32000732421875,
      "end": 145.44000244140625,
      "text": " we would provide a response to someone and we find that the Bible says that a soft answer"
    },
    {
      "id": 29,
      "start": 145.44000244140625,
      "end": 148.75999450683594,
      "text": " turneth away wrath."
    },
    {
      "id": 30,
      "start": 148.75999450683594,
      "end": 149.75999450683594,
      "text": " That's powerful."
    },
    {
      "id": 31,
      "start": 149.75999450683594,
      "end": 151.9600067138672,
      "text": " That's powerful."
    },
    {
      "id": 32,
      "start": 151.9600067138672,
      "end": 162.0399932861328,
      "text": " A soft answer, tender, delicate response, the Bible says turneth away wrath."
    },
    {
      "id": 33,
      "start": 162.0399932861328,
      "end": 170.67999267578125,
      "text": " Not sharp, not harsh, but tender, delicate."
    },
    {
      "id": 34,
      "start": 170.67999267578125,
      "end": 171.67999267578125,
      "text": " Notice the contrast."
    },
    {
      "id": 35,
      "start": 171.67999267578125,
      "end": 179.60000610351562,
      "text": " The Bible says, but grievous words, grievous words, those are hurtful or painful, that"
    },
    {
      "id": 36,
      "start": 179.60000610351562,
      "end": 186.72000122070312,
      "text": " which would cause grief or sorrow, that which is provoking or offensive, that's what grievous"
    },
    {
      "id": 37,
      "start": 186.72000122070312,
      "end": 187.72000122070312,
      "text": " means."
    },
    {
      "id": 38,
      "start": 188.72000122070312,
      "end": 196.9600067138672,
      "text": " And those grievous words, notice what the Bible says, they stir up anger."
    },
    {
      "id": 39,
      "start": 196.9600067138672,
      "end": 204.0,
      "text": " It's interesting because we see a turning away of wrath and we see a stirring up of"
    },
    {
      "id": 40,
      "start": 204.0,
      "end": 205.39999389648438,
      "text": " anger."
    },
    {
      "id": 41,
      "start": 205.39999389648438,
      "end": 212.39999389648438,
      "text": " It is the soft answer that turneth away wrath, but it is the grievous words that stir up"
    },
    {
      "id": 42,
      "start": 212.39999389648438,
      "end": 213.39999389648438,
      "text": " anger."
    },
    {
      "id": 43,
      "start": 214.39999389648438,
      "end": 220.0800018310547,
      "text": " Have you ever heard someone use the expression that they're just adding fuel to the fire?"
    },
    {
      "id": 44,
      "start": 220.0800018310547,
      "end": 223.67999267578125,
      "text": " You've heard someone use that expression before?"
    },
    {
      "id": 45,
      "start": 223.67999267578125,
      "end": 229.32000732421875,
      "text": " You've understood no doubt in your life and I know in my life we absolutely have understood"
    },
    {
      "id": 46,
      "start": 229.32000732421875,
      "end": 233.36000061035156,
      "text": " the power of our words."
    },
    {
      "id": 47,
      "start": 233.36000061035156,
      "end": 237.60000610351562,
      "text": " Consider with me the counsel that we see in Proverbs 4 and verse number 24, and you don't"
    },
    {
      "id": 48,
      "start": 237.60000610351562,
      "end": 240.63999938964844,
      "text": " need to turn to all these verses, I'm going to try to go quickly this evening, it's already"
    },
    {
      "id": 49,
      "start": 240.63999938964844,
      "end": 241.63999938964844,
      "text": " 10 till."
    },
    {
      "id": 50,
      "start": 241.83999633789062,
      "end": 248.72000122070312,
      "text": " In Proverbs 4 and verse number 24 the Bible says this, put away from thee a froward mouth"
    },
    {
      "id": 51,
      "start": 248.72000122070312,
      "end": 253.16000366210938,
      "text": " and perverse lips put far from thee."
    },
    {
      "id": 52,
      "start": 253.16000366210938,
      "end": 254.72000122070312,
      "text": " That's good counsel."
    },
    {
      "id": 53,
      "start": 254.72000122070312,
      "end": 260.9200134277344,
      "text": " To put away from thee a froward mouth and perverse lips put far from thee."
    },
    {
      "id": 54,
      "start": 260.9200134277344,
      "end": 265.67999267578125,
      "text": " I consider the counsel from Proverbs 4 and verse 24, I consider the truth that God gives"
    },
    {
      "id": 55,
      "start": 265.67999267578125,
      "end": 272.3999938964844,
      "text": " us in Proverbs 18 and verse number 21, where there the Bible says this, death and life"
    },
    {
      "id": 56,
      "start": 272.3999938964844,
      "end": 275.3599853515625,
      "text": " are in the power of the tongue."
    },
    {
      "id": 57,
      "start": 275.3599853515625,
      "end": 277.67999267578125,
      "text": " They that love it shall eat the fruit thereof."
    },
    {
      "id": 58,
      "start": 277.67999267578125,
      "end": 279.1199951171875,
      "text": " Did you hear that?"
    },
    {
      "id": 59,
      "start": 279.1199951171875,
      "end": 284.0400085449219,
      "text": " Death and life are in the power of the tongue."
    },
    {
      "id": 60,
      "start": 284.0400085449219,
      "end": 286.2799987792969,
      "text": " Wow."
    },
    {
      "id": 61,
      "start": 286.2799987792969,
      "end": 292.67999267578125,
      "text": " The observation that is given to us in Proverbs 21 and verse 23, where the Bible says, whoso"
    },
    {
      "id": 62,
      "start": 293.20001220703125,
      "end": 300.20001220703125,
      "text": " keepeth his mouth and his tongue keepeth his soul from troubles."
    },
    {
      "id": 63,
      "start": 301.55999755859375,
      "end": 302.760009765625,
      "text": " Proverbs 21, 23."
    },
    {
      "id": 64,
      "start": 302.760009765625,
      "end": 305.79998779296875,
      "text": " Some of us need to memorize that verse of Scripture, amen?"
    },
    {
      "id": 65,
      "start": 305.79998779296875,
      "end": 306.79998779296875,
      "text": " Seriously."
    },
    {
      "id": 66,
      "start": 306.79998779296875,
      "end": 307.79998779296875,
      "text": " Proverbs 21 and verse 23."
    },
    {
      "id": 67,
      "start": 307.79998779296875,
      "end": 314.79998779296875,
      "text": " Whoso keepeth his mouth and his tongue keepeth his soul from troubles."
    },
    {
      "id": 68,
      "start": 315.1199951171875,
      "end": 322.1199951171875,
      "text": " I'm sure that on more than one occasion or on more occasions than we'd like to admit,"
    },
    {
      "id": 69,
      "start": 322.2799987792969,
      "end": 325.1600036621094,
      "text": " our words have caused us trouble."
    },
    {
      "id": 70,
      "start": 325.1600036621094,
      "end": 326.760009765625,
      "text": " Amen?"
    },
    {
      "id": 71,
      "start": 326.760009765625,
      "end": 331.9599914550781,
      "text": " More often than we'd like to admit, our words have caused us trouble."
    },
    {
      "id": 72,
      "start": 331.9599914550781,
      "end": 337.32000732421875,
      "text": " And here we find that the Bible says, whoso keepeth his mouth and his tongue keepeth his"
    },
    {
      "id": 73,
      "start": 337.32000732421875,
      "end": 339.1600036621094,
      "text": " soul from troubles."
    },
    {
      "id": 74,
      "start": 339.1600036621094,
      "end": 342.44000244140625,
      "text": " Have you ever had a situation and say, man, I wish I didn't say that?"
    },
    {
      "id": 75,
      "start": 342.44000244140625,
      "end": 345.8800048828125,
      "text": " You're trying to catch your words as they're leaving your mouth, but guess what?"
    },
    {
      "id": 76,
      "start": 345.8800048828125,
      "end": 350.1199951171875,
      "text": " You can't do that."
    },
    {
      "id": 77,
      "start": 350.1199951171875,
      "end": 354.9599914550781,
      "text": " I remember this expression, and we spoke, obviously, today is Mother's Day."
    },
    {
      "id": 78,
      "start": 354.9599914550781,
      "end": 359.3599853515625,
      "text": " This morning, the truth from Proverbs 31, my mother taught me."
    },
    {
      "id": 79,
      "start": 359.3599853515625,
      "end": 364.0799865722656,
      "text": " I remember hearing this often from my mom as I was growing up, and as you know, I didn't"
    },
    {
      "id": 80,
      "start": 364.0799865722656,
      "end": 365.3999938964844,
      "text": " get saved until I was a senior in high school."
    },
    {
      "id": 81,
      "start": 365.3999938964844,
      "end": 370.1600036621094,
      "text": " My parents didn't get saved until I was, I think, eighth grade when they got saved."
    },
    {
      "id": 82,
      "start": 370.1600036621094,
      "end": 375.1199951171875,
      "text": " And so as a young kid, I would hear, not from a biblical perspective, but just from a moral"
    },
    {
      "id": 83,
      "start": 375.1199951171875,
      "end": 381.4800109863281,
      "text": " perspective, if you don't have anything nice to say, tell me what it says."
    },
    {
      "id": 84,
      "start": 381.4800109863281,
      "end": 383.6400146484375,
      "text": " Don't say anything at all, right?"
    },
    {
      "id": 85,
      "start": 383.6400146484375,
      "end": 385.3999938964844,
      "text": " You've heard that, no doubt, right?"
    },
    {
      "id": 86,
      "start": 385.3999938964844,
      "end": 388.5199890136719,
      "text": " And I remember hearing that from my mom at a young age."
    },
    {
      "id": 87,
      "start": 388.5199890136719,
      "end": 393.7200012207031,
      "text": " I also remember hearing this, think before you speak."
    },
    {
      "id": 88,
      "start": 393.7200012207031,
      "end": 394.760009765625,
      "text": " Think before you speak."
    },
    {
      "id": 89,
      "start": 394.760009765625,
      "end": 398.2799987792969,
      "text": " Now sometimes we have a problem with that."
    },
    {
      "id": 90,
      "start": 398.2799987792969,
      "end": 402.3999938964844,
      "text": " Because sometimes we just, I mean, our mouth just kind of, I mean, it just rolls, right?"
    },
    {
      "id": 91,
      "start": 402.9200134277344,
      "end": 406.9599914550781,
      "text": " Sometimes something happens in life, something is going on, someone says something to us."
    },
    {
      "id": 92,
      "start": 406.9599914550781,
      "end": 410.2799987792969,
      "text": " You think about that truth of Proverbs 15 and verse number one, where the Bible says,"
    },
    {
      "id": 93,
      "start": 410.2799987792969,
      "end": 413.9200134277344,
      "text": " a soft answer turns away wrath, but grievous words stir up anger."
    },
    {
      "id": 94,
      "start": 413.9200134277344,
      "end": 418.9599914550781,
      "text": " There are times in your life and in my life when someone has said something to us and"
    },
    {
      "id": 95,
      "start": 418.9599914550781,
      "end": 425.0,
      "text": " we respond not with a soft answer, but with grievous words, and all of a sudden, wrath"
    },
    {
      "id": 96,
      "start": 425.0,
      "end": 427.5199890136719,
      "text": " is stirred up."
    },
    {
      "id": 97,
      "start": 427.5199890136719,
      "end": 429.6400146484375,
      "text": " Anger is stirred up."
    },
    {
      "id": 98,
      "start": 429.6400146484375,
      "end": 434.4800109863281,
      "text": " We find here that as we think about the power of our words this evening, and I think about"
    },
    {
      "id": 99,
      "start": 434.4800109863281,
      "end": 440.1600036621094,
      "text": " those two statements that I often remember my mom sharing with me throughout the years,"
    },
    {
      "id": 100,
      "start": 440.1600036621094,
      "end": 446.239990234375,
      "text": " I would think of this, that some have put this idea of think before you speak to an"
    },
    {
      "id": 101,
      "start": 446.239990234375,
      "end": 450.79998779296875,
      "text": " acronym, THINK, T-H-I-N-K."
    },
    {
      "id": 102,
      "start": 450.79998779296875,
      "end": 454.0400085449219,
      "text": " And in eight minutes, I'm going to try to get through it, amen?"
    },
    {
      "id": 103,
      "start": 454.0400085449219,
      "end": 457.9200134277344,
      "text": " And you guys like to fellowship anyway, so I'll preach a little bit longer tonight, amen?"
    },
    {
      "id": 104,
      "start": 457.9200134277344,
      "end": 462.239990234375,
      "text": " But no, honestly, let me just try to get through this, T. Here's some questions to"
    },
    {
      "id": 105,
      "start": 462.239990234375,
      "end": 467.1199951171875,
      "text": " ask ourselves when we are going to use our words, because we understand the power of"
    },
    {
      "id": 106,
      "start": 467.1199951171875,
      "end": 471.9599914550781,
      "text": " our words, and we think about this, and we're going to use this acronym THINK."
    },
    {
      "id": 107,
      "start": 471.9599914550781,
      "end": 475.5799865722656,
      "text": " Number one, the T, is it truthful?"
    },
    {
      "id": 108,
      "start": 475.5799865722656,
      "end": 476.5799865722656,
      "text": " Is it truthful?"
    },
    {
      "id": 109,
      "start": 476.5799865722656,
      "end": 482.9599914550781,
      "text": " In Ephesians 4 and verse number 15, we are instructed to speak the truth in love, to"
    },
    {
      "id": 110,
      "start": 482.9599914550781,
      "end": 484.5199890136719,
      "text": " speak the truth in love."
    },
    {
      "id": 111,
      "start": 484.5199890136719,
      "end": 488.6400146484375,
      "text": " Now we think about that, that verse of Scripture and the admonition that is given to us that"
    },
    {
      "id": 112,
      "start": 488.6400146484375,
      "end": 493.0400085449219,
      "text": " we are to speak the truth, and so we must ensure that what we are saying is truthful,"
    },
    {
      "id": 113,
      "start": 493.0400085449219,
      "end": 498.1600036621094,
      "text": " but God says that we're to speak the truth in love, in love."
    },
    {
      "id": 114,
      "start": 498.1600036621094,
      "end": 502.0,
      "text": " So there's a way in which we have to speak the truth, and that is in love."
    },
    {
      "id": 115,
      "start": 502.0,
      "end": 506.0,
      "text": " Think about this, in the book of Zechariah, the Old Testament prophet, I want you to notice"
    },
    {
      "id": 116,
      "start": 506.0,
      "end": 509.32000732421875,
      "text": " what Zechariah says in Zechariah 8 and verse number 16."
    },
    {
      "id": 117,
      "start": 509.32000732421875,
      "end": 516.5999755859375,
      "text": " The Bible says this, these are the things that ye shall do, speak every man the truth"
    },
    {
      "id": 118,
      "start": 516.5999755859375,
      "end": 523.8800048828125,
      "text": " to his neighbor, execute the judgment of truth, and peace in your gates."
    },
    {
      "id": 119,
      "start": 523.8800048828125,
      "end": 529.5599975585938,
      "text": " And what a difference a society would be if every man spoke truth to his neighbor."
    },
    {
      "id": 120,
      "start": 529.5599975585938,
      "end": 534.7999877929688,
      "text": " Honestly, it would be a different society altogether."
    },
    {
      "id": 121,
      "start": 534.7999877929688,
      "end": 540.1599731445312,
      "text": " Zechariah 8 and verse 16 tells us, of course, the passage continues with other things that"
    },
    {
      "id": 122,
      "start": 540.1599731445312,
      "end": 544.2000122070312,
      "text": " we ought to do, but the first one that is mentioned there is that we're to speak every"
    },
    {
      "id": 123,
      "start": 544.2000122070312,
      "end": 547.97998046875,
      "text": " man the truth to his neighbor."
    },
    {
      "id": 124,
      "start": 547.97998046875,
      "end": 548.97998046875,
      "text": " Is it truthful?"
    },
    {
      "id": 125,
      "start": 548.97998046875,
      "end": 551.4400024414062,
      "text": " Let's say this, is it helpful?"
    },
    {
      "id": 126,
      "start": 551.4400024414062,
      "end": 552.4400024414062,
      "text": " Is it helpful?"
    },
    {
      "id": 127,
      "start": 552.4400024414062,
      "end": 557.6400146484375,
      "text": " Ephesians chapter number 4 and verse number 29, the Bible tells us how we can use our"
    },
    {
      "id": 128,
      "start": 557.6400146484375,
      "end": 561.5999755859375,
      "text": " words, and I've already mentioned that we can use them in a positive fashion, also in"
    },
    {
      "id": 129,
      "start": 561.5999755859375,
      "end": 567.4199829101562,
      "text": " a negative fashion, but we find that in Ephesians 4 and verse number 29, the Bible says there"
    },
    {
      "id": 130,
      "start": 567.4199829101562,
      "end": 571.5599975585938,
      "text": " that we're to let no corrupt communication proceed out of your mouth."
    },
    {
      "id": 131,
      "start": 571.5599975585938,
      "end": 578.719970703125,
      "text": " But notice what it says, but that which is good to the use of edifying, that it, those"
    },
    {
      "id": 132,
      "start": 578.719970703125,
      "end": 585.8800048828125,
      "text": " words that we speak, that they may minister grace unto the hearers."
    },
    {
      "id": 133,
      "start": 585.8800048828125,
      "end": 586.8800048828125,
      "text": " So are our words helpful?"
    },
    {
      "id": 134,
      "start": 586.8800048828125,
      "end": 590.9600219726562,
      "text": " Have you ever been in a situation where maybe you were thinking before you spoke and there"
    },
    {
      "id": 135,
      "start": 591.0,
      "end": 594.0,
      "text": " was something that came to your mind to say and you said, you know, that's probably not"
    },
    {
      "id": 136,
      "start": 594.0,
      "end": 596.0,
      "text": " very helpful in this circumstance."
    },
    {
      "id": 137,
      "start": 596.0,
      "end": 600.0,
      "text": " It's not very helpful in this situation for me to speak."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 605.2600002288818,
      "text": " this thing. And we find that it is to be used, notice, for the use of edifying."
    },
    {
      "id": 1,
      "start": 605.2600002288818,
      "end": 609.6599998474121,
      "text": " The word edify is such an important word for us to understand as we read through"
    },
    {
      "id": 2,
      "start": 609.6599998474121,
      "end": 613.460000038147,
      "text": " the New Testament. We see so often that God uses that word"
    },
    {
      "id": 3,
      "start": 613.460000038147,
      "end": 618.6200008392334,
      "text": " and how we're to build up one another. I mentioned already by way of introduction"
    },
    {
      "id": 4,
      "start": 618.6200008392334,
      "end": 621.8199996948242,
      "text": " that we can use our words in a positive manner to build up"
    },
    {
      "id": 5,
      "start": 621.8199996948242,
      "end": 624.8600006103516,
      "text": " or we can use them in the negative to bring low."
    },
    {
      "id": 6,
      "start": 624.8600006103516,
      "end": 628.5400009155273,
      "text": " Oh, that God would help us to use our words to build people up, to"
    },
    {
      "id": 7,
      "start": 628.5400009155273,
      "end": 634.6599998474121,
      "text": " edify them. We find that the Bible teaches us in the book of Psalms,"
    },
    {
      "id": 8,
      "start": 634.6599998474121,
      "end": 639.8199996948242,
      "text": " in Psalm 37 and verse number 30, with regard to this thought of whether it's helpful."
    },
    {
      "id": 9,
      "start": 639.8199996948242,
      "end": 644.5,
      "text": " In Psalm 37 and verse number 30, the psalmist says this,"
    },
    {
      "id": 10,
      "start": 644.5,
      "end": 649.7400016784668,
      "text": " speaking of the righteous man, that the mouth of the righteous speaketh wisdom"
    },
    {
      "id": 11,
      "start": 649.7400016784668,
      "end": 656.6199989318848,
      "text": " and his tongue talketh of judgment. It's interesting because verse number 31"
    },
    {
      "id": 12,
      "start": 656.6199989318848,
      "end": 661.5400009155273,
      "text": " gives us the key as to why he speaks wisdom and he talks of judgment,"
    },
    {
      "id": 13,
      "start": 661.5400009155273,
      "end": 665.7399978637695,
      "text": " and that is because the law of his God is in his heart."
    },
    {
      "id": 14,
      "start": 665.7399978637695,
      "end": 669.8199996948242,
      "text": " None of his steps shall slide. And the more time we spend in God's word,"
    },
    {
      "id": 15,
      "start": 669.8199996948242,
      "end": 673.2600021362305,
      "text": " the more of God's word that's going to come out of our mouth."
    },
    {
      "id": 16,
      "start": 673.2600021362305,
      "end": 676.9400024414062,
      "text": " We're going to be able to use God's word. Listen, I believe this evening that God's"
    },
    {
      "id": 17,
      "start": 676.9400024414062,
      "end": 679.6999969482422,
      "text": " word is helpful. It's profitable."
    },
    {
      "id": 18,
      "start": 679.6999969482422,
      "end": 683.8199996948242,
      "text": " We understand that. And so we ask ourselves, is this thing truthful?"
    },
    {
      "id": 19,
      "start": 683.8199996948242,
      "end": 688.620002746582,
      "text": " Is it helpful? I could ask it this way, is it inspiring?"
    },
    {
      "id": 20,
      "start": 688.620002746582,
      "end": 692.9000015258789,
      "text": " The I, T-H-I, number three there, is it inspiring?"
    },
    {
      "id": 21,
      "start": 692.9000015258789,
      "end": 698.6999969482422,
      "text": " And we're there in Psalm 37, look over in chapter 35, and notice in verse number 28,"
    },
    {
      "id": 22,
      "start": 698.6999969482422,
      "end": 701.0199966430664,
      "text": " Psalm 35 and verse number 28, the Bible says,"
    },
    {
      "id": 23,
      "start": 701.0199966430664,
      "end": 707.4199981689453,
      "text": " and my tongue shall speak of thy righteousness and of thy praise all the day long."
    },
    {
      "id": 24,
      "start": 707.4199981689453,
      "end": 711.3000030517578,
      "text": " I want you to think about the psalmist and the manner in which you would use his words."
    },
    {
      "id": 25,
      "start": 711.3000030517578,
      "end": 715.379997253418,
      "text": " And he says that my tongue shall speak, and of course of God,"
    },
    {
      "id": 26,
      "start": 715.379997253418,
      "end": 718.6600036621094,
      "text": " of God's righteousness and of thy praise all the day long."
    },
    {
      "id": 27,
      "start": 718.6600036621094,
      "end": 721.8199996948242,
      "text": " That's inspiring. You're going to hear somebody, listen,"
    },
    {
      "id": 28,
      "start": 721.8199996948242,
      "end": 725.9000015258789,
      "text": " I don't like hearing people complain. How many of you like listening to people complain?"
    },
    {
      "id": 29,
      "start": 725.9000015258789,
      "end": 729.2599945068359,
      "text": " I cannot stand listening to people complain. I want to be honest with you."
    },
    {
      "id": 30,
      "start": 729.2599945068359,
      "end": 734.2200012207031,
      "text": " I don't think God likes listening to us complain. He says it in his word over and over."
    },
    {
      "id": 31,
      "start": 734.2200012207031,
      "end": 738.4199981689453,
      "text": " He doesn't like complaining. But you know what we're good at as human beings?"
    },
    {
      "id": 32,
      "start": 738.4199981689453,
      "end": 742.7400054931641,
      "text": " Complaining. We really are. We're good at it."
    },
    {
      "id": 33,
      "start": 742.7400054931641,
      "end": 747.7799987792969,
      "text": " We find here that we think about this thought of inspiring one another."
    },
    {
      "id": 34,
      "start": 747.7799987792969,
      "end": 750.4199981689453,
      "text": " And if somebody is speaking like the psalmist says here,"
    },
    {
      "id": 35,
      "start": 750.4199981689453,
      "end": 753.8999938964844,
      "text": " that he's speaking of the righteousness of God and praising God all the day long,"
    },
    {
      "id": 36,
      "start": 753.8999938964844,
      "end": 755.5399932861328,
      "text": " that's inspiring. And guess what?"
    },
    {
      "id": 37,
      "start": 755.5399932861328,
      "end": 758.4600067138672,
      "text": " All of a sudden that's inspiring me to think about my Savior,"
    },
    {
      "id": 38,
      "start": 758.4600067138672,
      "end": 764.6199951171875,
      "text": " to think about my God and to praise him along with the brother or sister that is praising the Lord."
    },
    {
      "id": 39,
      "start": 764.6199951171875,
      "end": 768.7400054931641,
      "text": " Psalm 77 and verse number 12 says it this way,"
    },
    {
      "id": 40,
      "start": 768.7400054931641,
      "end": 774.1799926757812,
      "text": " I will meditate also of all thy work and talk of all thy doings."
    },
    {
      "id": 41,
      "start": 774.1799926757812,
      "end": 778.4600067138672,
      "text": " You know it's inspiring when someone talks about what God is doing."
    },
    {
      "id": 42,
      "start": 778.4600067138672,
      "end": 782.9799957275391,
      "text": " It really is. We can talk about what God has done in the past"
    },
    {
      "id": 43,
      "start": 782.9799957275391,
      "end": 786.9799957275391,
      "text": " and the works that he's done that are contained within the pages of this precious book."
    },
    {
      "id": 44,
      "start": 786.9799957275391,
      "end": 790.3399963378906,
      "text": " But we can also talk about what God is doing in our life actively."
    },
    {
      "id": 45,
      "start": 790.3399963378906,
      "end": 794.3399963378906,
      "text": " We begin to talk about God's doings, God's workings in our lives."
    },
    {
      "id": 46,
      "start": 794.3399963378906,
      "end": 799.7799987792969,
      "text": " And that's inspiring to people. It's encouraging."
    },
    {
      "id": 47,
      "start": 799.7799987792969,
      "end": 805.5800018310547,
      "text": " The end, is it necessary? Is it necessary? Is it necessary?"
    },
    {
      "id": 48,
      "start": 805.5800018310547,
      "end": 813.3800048828125,
      "text": " Let me share a few verses with you in the book of Proverbs chapter 11 and verse number 12."
    },
    {
      "id": 49,
      "start": 813.3800048828125,
      "end": 819.4199981689453,
      "text": " Some people may have a perspective that, well, it was necessary for me to say that, okay?"
    },
    {
      "id": 50,
      "start": 819.4199981689453,
      "end": 823.7400054931641,
      "text": " Let's take everything else into consideration with regard to these biblical truths"
    },
    {
      "id": 51,
      "start": 823.7400054931641,
      "end": 826.7400054931641,
      "text": " of speaking the truth in love."
    },
    {
      "id": 52,
      "start": 826.7400054931641,
      "end": 830.9799957275391,
      "text": " And I want you to think about this as we notice these few verses in the book of Proverbs"
    },
    {
      "id": 53,
      "start": 830.9799957275391,
      "end": 833.9799957275391,
      "text": " with whether or not something is necessary for us to speak."
    },
    {
      "id": 54,
      "start": 833.9799957275391,
      "end": 836.8200073242188,
      "text": " Notice in Proverbs 11 and verse number 12, the Bible says,"
    },
    {
      "id": 55,
      "start": 836.8200073242188,
      "end": 840.1399993896484,
      "text": " He that is void of wisdom despiseth his neighbor."
    },
    {
      "id": 56,
      "start": 840.1399993896484,
      "end": 845.0599975585938,
      "text": " But of man of understanding, notice what it says, holdeth his peace."
    },
    {
      "id": 57,
      "start": 845.0599975585938,
      "end": 848.6600036621094,
      "text": " You ever hear somebody say, I'm going to give him peace of my mind?"
    },
    {
      "id": 58,
      "start": 848.6600036621094,
      "end": 852.7799987792969,
      "text": " I always laugh. It's probably going to be the last peace of your mind, right?"
    },
    {
      "id": 59,
      "start": 852.7799987792969,
      "end": 857.5400085449219,
      "text": " I mean, you better be careful when you're giving somebody a peace of your mind."
    },
    {
      "id": 60,
      "start": 857.5400085449219,
      "end": 861.3399963378906,
      "text": " Typically, what follows when somebody says, I'm going to give you a peace of my mind,"
    },
    {
      "id": 61,
      "start": 861.3399963378906,
      "end": 865.2999877929688,
      "text": " is not necessary. It's something that's not inspiring."
    },
    {
      "id": 62,
      "start": 865.2999877929688,
      "end": 868.4200134277344,
      "text": " It's something that's not helpful. Amen?"
    },
    {
      "id": 63,
      "start": 868.4200134277344,
      "end": 870.6199951171875,
      "text": " I've had people say that to me. Let me give you a peace of my mind."
    },
    {
      "id": 64,
      "start": 870.6199951171875,
      "end": 874.2999877929688,
      "text": " And I already know what's coming."
    },
    {
      "id": 65,
      "start": 874.2999877929688,
      "end": 880.8200073242188,
      "text": " Notice in Proverbs 15, it says here that he that holdeth, a man of understanding holdeth his peace."
    },
    {
      "id": 66,
      "start": 880.8200073242188,
      "end": 884.5,
      "text": " Let's look over at chapter 15 and verse number 23."
    },
    {
      "id": 67,
      "start": 884.5,
      "end": 889.3399963378906,
      "text": " Proverbs 15 and verse number 23, the Bible says,"
    },
    {
      "id": 68,
      "start": 889.3399963378906,
      "end": 898.4200134277344,
      "text": " A man hath joy by the answer of his mouth in a word spoken, notice this phrase, in due season."
    },
    {
      "id": 69,
      "start": 898.4200134277344,
      "end": 903.5400085449219,
      "text": " How good is it?"
    },
    {
      "id": 70,
      "start": 903.5400085449219,
      "end": 909.4200134277344,
      "text": " I don't always know what the due season is, but the Holy Spirit does."
    },
    {
      "id": 71,
      "start": 909.4200134277344,
      "end": 911.3800048828125,
      "text": " I don't always know, but the Holy Spirit does."
    },
    {
      "id": 72,
      "start": 911.3800048828125,
      "end": 914.5,
      "text": " And as I'm abiding in the Spirit, as I'm walking in the Spirit,"
    },
    {
      "id": 73,
      "start": 914.5,
      "end": 918.260009765625,
      "text": " not fulfilling the lust of the flesh, as I'm seeking to follow the Lord,"
    },
    {
      "id": 74,
      "start": 918.260009765625,
      "end": 923.5400085449219,
      "text": " then something might be necessary to say, but it might not be the due season."
    },
    {
      "id": 75,
      "start": 923.5400085449219,
      "end": 925.3399963378906,
      "text": " Does that make sense this evening?"
    },
    {
      "id": 76,
      "start": 925.3399963378906,
      "end": 930.9800109863281,
      "text": " It might not be the right place. It might not be the right setting."
    },
    {
      "id": 77,
      "start": 930.9800109863281,
      "end": 935.2999877929688,
      "text": " And God, the Holy Spirit, communes with our spirit."
    },
    {
      "id": 78,
      "start": 935.2999877929688,
      "end": 941.8999938964844,
      "text": " We can have that, you know, it's not really the right time to say that to that individual."
    },
    {
      "id": 79,
      "start": 941.8999938964844,
      "end": 945.7000122070312,
      "text": " That requires that we walk with God. It really does."
    },
    {
      "id": 80,
      "start": 945.7000122070312,
      "end": 949.6600036621094,
      "text": " That little phrase there, in due season, is impactful."
    },
    {
      "id": 81,
      "start": 949.6600036621094,
      "end": 954.0599975585938,
      "text": " Notice in Proverbs chapter 25 and verse number 11."
    },
    {
      "id": 82,
      "start": 954.0599975585938,
      "end": 960.1799926757812,
      "text": " In Proverbs 25 and verse number 11, going right along with this in due season from Proverbs 15 and verse 23,"
    },
    {
      "id": 83,
      "start": 960.1799926757812,
      "end": 968.2200012207031,
      "text": " here the Bible says this, a word, fitly spoken, is like apples of gold and pictures of silver."
    },
    {
      "id": 84,
      "start": 968.2200012207031,
      "end": 970.4200134277344,
      "text": " And think about that phrase, fitly spoken."
    },
    {
      "id": 85,
      "start": 970.4200134277344,
      "end": 976.1000061035156,
      "text": " You know what it means, really? It carries with it literally the idea, at the right moment."
    },
    {
      "id": 86,
      "start": 976.1000061035156,
      "end": 980.4599914550781,
      "text": " At the right moment. That's what it means, fitly spoken."
    },
    {
      "id": 87,
      "start": 980.4599914550781,
      "end": 984.3399963378906,
      "text": " In due season, fitly spoken."
    },
    {
      "id": 88,
      "start": 984.3399963378906,
      "end": 988.6600036621094,
      "text": " I want to say this, when I think about this thought of whether it is necessary."
    },
    {
      "id": 89,
      "start": 988.6600036621094,
      "end": 998.2200012207031,
      "text": " At times, what might be necessary to say is also difficult to say."
    },
    {
      "id": 90,
      "start": 998.2200012207031,
      "end": 1000.5799865722656,
      "text": " Have you ever experienced that in your life?"
    },
    {
      "id": 91,
      "start": 1000.5799865722656,
      "end": 1008.3800048828125,
      "text": " It's necessary to say something, but it's a difficult something that you need to say."
    },
    {
      "id": 92,
      "start": 1008.3800048828125,
      "end": 1013.739990234375,
      "text": " If you've not been in that position in life, I think one day you will be."
    },
    {
      "id": 93,
      "start": 1013.739990234375,
      "end": 1022.1799926757812,
      "text": " I've been in that position many times, where I know that there's something that's necessary to say, but it's difficult."
    },
    {
      "id": 94,
      "start": 1022.1799926757812,
      "end": 1024.260009765625,
      "text": " It's not easy."
    },
    {
      "id": 95,
      "start": 1024.260009765625,
      "end": 1031.260009765625,
      "text": " And I would say that in moments like those, we must spend much time in prayer,"
    },
    {
      "id": 96,
      "start": 1031.260009765625,
      "end": 1037.1400146484375,
      "text": " and we must deliver the words in an appropriate manner."
    },
    {
      "id": 97,
      "start": 1037.1400146484375,
      "end": 1041.8599853515625,
      "text": " When the Bible says, speak the truth in love, we think about something that's necessary."
    },
    {
      "id": 98,
      "start": 1041.8599853515625,
      "end": 1045.9400024414062,
      "text": " See, sometimes correction is necessary, correct?"
    },
    {
      "id": 99,
      "start": 1045.9400024414062,
      "end": 1050.8999938964844,
      "text": " I mean, we all need correction at times in our lives."
    },
    {
      "id": 100,
      "start": 1050.8999938964844,
      "end": 1054.9800109863281,
      "text": " And we would say, well, it's necessary that I correct that behavior."
    },
    {
      "id": 101,
      "start": 1054.9800109863281,
      "end": 1066.1000061035156,
      "text": " You're in a position that you would have the responsibility of correcting the behavior of giving that word, and it's necessary."
    },
    {
      "id": 102,
      "start": 1066.1000061035156,
      "end": 1068.739990234375,
      "text": " It's difficult."
    },
    {
      "id": 103,
      "start": 1068.739990234375,
      "end": 1074.4599914550781,
      "text": " You're in a situation where you had to talk to someone, and your stomach just bothered you."
    },
    {
      "id": 104,
      "start": 1074.4599914550781,
      "end": 1079.0199890136719,
      "text": " You're just, man, I wish I really didn't have to have this meeting."
    },
    {
      "id": 105,
      "start": 1079.0199890136719,
      "end": 1080.3399963378906,
      "text": " Have you ever been there?"
    },
    {
      "id": 106,
      "start": 1080.3399963378906,
      "end": 1083.739990234375,
      "text": " I've been there more times than I could tell you."
    },
    {
      "id": 107,
      "start": 1083.739990234375,
      "end": 1087.8599853515625,
      "text": " And in those moments, we've acknowledged it's necessary."
    },
    {
      "id": 108,
      "start": 1087.8599853515625,
      "end": 1089.1799926757812,
      "text": " It's going to be hard."
    },
    {
      "id": 109,
      "start": 1089.1799926757812,
      "end": 1090.3399963378906,
      "text": " It's necessary."
    },
    {
      "id": 110,
      "start": 1090.3399963378906,
      "end": 1097.7799987792969,
      "text": " And I would say that we must bathe it in prayer, and we must be careful to deliver the message in an appropriate manner."
    },
    {
      "id": 111,
      "start": 1097.7799987792969,
      "end": 1103.1000061035156,
      "text": " Look over at what the book of Proverbs, here in chapter 27, just a couple of chapters from where we were in chapter 25."
    },
    {
      "id": 112,
      "start": 1103.1000061035156,
      "end": 1112.4600219726562,
      "text": " Notice in chapter 27, in verse number 6, notice what the Bible says."
    },
    {
      "id": 113,
      "start": 1112.4600219726562,
      "end": 1116.97998046875,
      "text": " Speaking on our words, not which is necessary, but yet difficult."
    },
    {
      "id": 114,
      "start": 1116.97998046875,
      "end": 1123.780029296875,
      "text": " The Bible says, faithful are the wounds of a friend."
    },
    {
      "id": 115,
      "start": 1123.780029296875,
      "end": 1128.4600219726562,
      "text": " But the kisses of an enemy are deceitful."
    },
    {
      "id": 116,
      "start": 1128.4600219726562,
      "end": 1134.8599853515625,
      "text": " As we're going to think about this verse of Scripture, and begin to consider this evening,"
    },
    {
      "id": 117,
      "start": 1134.8599853515625,
      "end": 1142.780029296875,
      "text": " this truth of what is necessary, and as I consider that which is necessary, but yet difficult at the same time,"
    },
    {
      "id": 118,
      "start": 1142.780029296875,
      "end": 1146.260009765625,
      "text": " and I also understand the Bible says, faithful are the wounds of a friend."
    },
    {
      "id": 119,
      "start": 1146.260009765625,
      "end": 1151.6199951171875,
      "text": " I preached a message a couple of weeks ago on Sunday evening that I entitled, Divisions and Contentions."
    },
    {
      "id": 120,
      "start": 1151.6199951171875,
      "end": 1156.260009765625,
      "text": " And in that message, I was speaking there from the book of 1 Corinthians, chapter number 1,"
    },
    {
      "id": 121,
      "start": 1156.260009765625,
      "end": 1163.1400146484375,
      "text": " and I mentioned that during times of conflict, there are some things that we must consider so that we would respond properly."
    },
    {
      "id": 122,
      "start": 1163.1400146484375,
      "end": 1169.7000122070312,
      "text": " And one of those was that we must review what we know to be true."
    },
    {
      "id": 123,
      "start": 1169.7000122070312,
      "end": 1177.5800170898438,
      "text": " When someone is a friend, I mean, I'm saying truly a biblical friend, the definition of a friend."
    },
    {
      "id": 124,
      "start": 1177.5800170898438,
      "end": 1184.1799926757812,
      "text": " The Bible says, iron sharpeneth iron, and the Bible says, faithful are the wounds of a friend."
    },
    {
      "id": 125,
      "start": 1184.1799926757812,
      "end": 1191.780029296875,
      "text": " I don't know this evening where you are in your life, but I would say this, that there comes a time in our lives"
    },
    {
      "id": 126,
      "start": 1191.780029296875,
      "end": 1199.5,
      "text": " where there might be the need for a friend to deliver to us a message that is difficult."
    },
    {
      "id": 0,
      "start": 1199.5,
      "end": 1209.619999885559,
      "text": " but necessary. Necessary, but difficult. And in those moments we must understand that the"
    },
    {
      "id": 1,
      "start": 1209.619999885559,
      "end": 1217.840000152588,
      "text": " Bible says faithful are the wounds of a friend. Now, I would not say that someone has the"
    },
    {
      "id": 2,
      "start": 1217.840000152588,
      "end": 1223.6399993896484,
      "text": " liberty to use this verse of Scripture and violate other verses of Scripture that we've"
    },
    {
      "id": 3,
      "start": 1223.6399993896484,
      "end": 1228.0200004577637,
      "text": " already looked at and say, well, faithful are the wounds of a friend. That's not what"
    },
    {
      "id": 4,
      "start": 1228.0200004577637,
      "end": 1234.2799987792969,
      "text": " I'm suggesting this evening. But there are times that something is necessary to be said."
    },
    {
      "id": 5,
      "start": 1234.2799987792969,
      "end": 1241.0,
      "text": " And my question at that time, and as we have to deal with it as adults in dealing with"
    },
    {
      "id": 6,
      "start": 1241.0,
      "end": 1248.6800003051758,
      "text": " someone, a friend coming and giving us something that's maybe challenging to receive, do we"
    },
    {
      "id": 7,
      "start": 1248.6800003051758,
      "end": 1254.8800010681152,
      "text": " have the humility? Do we understand that they love us and they have our best interest at"
    },
    {
      "id": 8,
      "start": 1254.8800010681152,
      "end": 1261.6199989318848,
      "text": " heart and at mind? I'll give you a simple, silly illustration. Have you ever heard somebody"
    },
    {
      "id": 9,
      "start": 1261.6199989318848,
      "end": 1267.9599990844727,
      "text": " public speak that says, um, all the time? Sure you have. Have you ever heard somebody"
    },
    {
      "id": 10,
      "start": 1267.9599990844727,
      "end": 1275.6600036621094,
      "text": " that public speaks that says okay a lot? Okay, okay, okay. There's a professor at Bible"
    },
    {
      "id": 11,
      "start": 1275.6600036621094,
      "end": 1278.5400009155273,
      "text": " College, not the Bible College that I went to, but a fellow that I worked with after"
    },
    {
      "id": 12,
      "start": 1278.5400009155273,
      "end": 1282.879997253418,
      "text": " I was, actually I was in Bible College at the time, and his professor said okay all"
    },
    {
      "id": 13,
      "start": 1282.879997253418,
      "end": 1287.7600021362305,
      "text": " the time. And so he gathered some of the students together and he said, listen, next time he"
    },
    {
      "id": 14,
      "start": 1287.7600021362305,
      "end": 1291.8000030517578,
      "text": " says okay, here's what we're going to do. All the class together is going to say, okay,"
    },
    {
      "id": 15,
      "start": 1291.8000030517578,
      "end": 1299.3199996948242,
      "text": " okay, okay, okay, okay, okay. Let's just say the professor wasn't very pleased with that,"
    },
    {
      "id": 16,
      "start": 1299.3199996948242,
      "end": 1306.099998474121,
      "text": " okay? It was not well received. When I first started preaching, I would say okay quite"
    },
    {
      "id": 17,
      "start": 1306.099998474121,
      "end": 1312.0199966430664,
      "text": " a bit. It was just my thing. I just said okay. And it was almost like a, are you following,"
    },
    {
      "id": 18,
      "start": 1312.0199966430664,
      "end": 1317.3399963378906,
      "text": " are you tracking, are you where I am, that kind of a thing. And I was doing my internship"
    },
    {
      "id": 19,
      "start": 1317.3399963378906,
      "end": 1322.0199966430664,
      "text": " at a church, and I was still in Bible College, and I had to, I had to preach a number of"
    },
    {
      "id": 20,
      "start": 1322.0199966430664,
      "end": 1326.3399963378906,
      "text": " messages during my internship, and a man in the church, Henry Barfield, he's with the"
    },
    {
      "id": 21,
      "start": 1326.3399963378906,
      "end": 1331.4600067138672,
      "text": " Lord now, and Henry Barfield came to me and he handed me two dollars worth of quarters."
    },
    {
      "id": 22,
      "start": 1331.7799987792969,
      "end": 1339.8600006103516,
      "text": " He said, I want you to put these in your pocket, and I want you to jingle them around. Okay?"
    },
    {
      "id": 23,
      "start": 1339.8600006103516,
      "end": 1345.5399932861328,
      "text": " So I did it. He said, it's annoying, right? Yeah, actually it is. He said, every time"
    },
    {
      "id": 24,
      "start": 1345.5399932861328,
      "end": 1353.259994506836,
      "text": " you say okay, that's what it sounds like. That's what he said to me. And he said, here's"
    },
    {
      "id": 25,
      "start": 1353.259994506836,
      "end": 1358.740005493164,
      "text": " what I want you to know. When I first started, now he wasn't a pastor, he was a, he was an"
    },
    {
      "id": 26,
      "start": 1358.740005493164,
      "end": 1364.4199981689453,
      "text": " adult Sunday school teacher in a church for 25 years. Taught adult Sunday school. A deacon"
    },
    {
      "id": 27,
      "start": 1364.4199981689453,
      "end": 1372.2200012207031,
      "text": " in a church, just a solid Christian. He said, when I first started teaching, I said um all"
    },
    {
      "id": 28,
      "start": 1372.2200012207031,
      "end": 1376.8999938964844,
      "text": " the time. And he said, somebody in the church gave me two dollars worth of quarters, so"
    },
    {
      "id": 29,
      "start": 1376.8999938964844,
      "end": 1380.8999938964844,
      "text": " I'm going to put them in my pocket. Now I don't carry two dollars worth of quarters"
    },
    {
      "id": 30,
      "start": 1380.8999938964844,
      "end": 1385.5399932861328,
      "text": " in my pocket, but that man, after teaching for all those years, every time he taught"
    },
    {
      "id": 31,
      "start": 1385.5399932861328,
      "end": 1392.5399932861328,
      "text": " he had quarters in his pocket. And that was his reminder to not say um. I don't have"
    },
    {
      "id": 32,
      "start": 1392.5399932861328,
      "end": 1395.7799987792969,
      "text": " to carry the quarters to not say okay, at least I think. I don't say it as often as"
    },
    {
      "id": 33,
      "start": 1395.7799987792969,
      "end": 1400.3000030517578,
      "text": " I used to, that's for sure. But the reality is that, listen, I could have been offended"
    },
    {
      "id": 34,
      "start": 1400.3000030517578,
      "end": 1405.1799926757812,
      "text": " by that. Could have been hurtful. But you know what, that man was just trying to help"
    },
    {
      "id": 35,
      "start": 1405.1799926757812,
      "end": 1410.8600006103516,
      "text": " me. He was just trying to help me. He was just trying to be a blessing. And it's a silly"
    },
    {
      "id": 36,
      "start": 1410.8600006103516,
      "end": 1415.7799987792969,
      "text": " illustration, some simple kind of thing, but nonetheless we find this evening that"
    },
    {
      "id": 37,
      "start": 1415.7799987792969,
      "end": 1422.3800048828125,
      "text": " there are times in which we have a message to deliver to somebody that's necessary, but"
    },
    {
      "id": 38,
      "start": 1422.3800048828125,
      "end": 1429.7799987792969,
      "text": " difficult. And in those times we need the help of God. And we need God's help to be"
    },
    {
      "id": 39,
      "start": 1429.7799987792969,
      "end": 1438.6999969482422,
      "text": " able to deliver that message. And when that message is delivered, my response is so vital."
    },
    {
      "id": 40,
      "start": 1439.259994506836,
      "end": 1448.1399993896484,
      "text": " Why? Because a soft answer turneth away wrath, but grievous words stir up anger. Number five,"
    },
    {
      "id": 41,
      "start": 1448.1399993896484,
      "end": 1456.2200012207031,
      "text": " if I count it right, K, is it kind? Is it kind? How many of you heard little kids running"
    },
    {
      "id": 42,
      "start": 1456.2200012207031,
      "end": 1464.5,
      "text": " around and you heard parents say, speak kindly, use kind words. We ask ourselves, is it kind?"
    },
    {
      "id": 43,
      "start": 1464.5,
      "end": 1467.7000122070312,
      "text": " Look over at the book of Ephesians. We've already referenced three verses from Ephesians"
    },
    {
      "id": 44,
      "start": 1467.7000122070312,
      "end": 1472.260009765625,
      "text": " chapter number four, or excuse me, this is the third verse from Ephesians chapter number"
    },
    {
      "id": 45,
      "start": 1472.260009765625,
      "end": 1479.4200134277344,
      "text": " four. Notice in chapter four in verse number 32, we find that he said in verse number 15"
    },
    {
      "id": 46,
      "start": 1479.4200134277344,
      "end": 1483.4200134277344,
      "text": " that we're to speak the truth in love. We find in verse number 29 that our words are"
    },
    {
      "id": 47,
      "start": 1483.4200134277344,
      "end": 1487.3399963378906,
      "text": " to be used for the use of edifying, that it may minister grace unto the hearers. And then"
    },
    {
      "id": 48,
      "start": 1487.3399963378906,
      "end": 1492.7799987792969,
      "text": " here in verse number 32 the Bible says, and be kind one to another, tenderhearted, forgiving"
    },
    {
      "id": 49,
      "start": 1492.7799987792969,
      "end": 1500.9400024414062,
      "text": " one another, even as God for Christ's sake hath forgiven you. Be kind. Notice Colossians"
    },
    {
      "id": 50,
      "start": 1500.9400024414062,
      "end": 1505.2999877929688,
      "text": " chapter number four, and we'll finish with this verse of scripture. In Colossians four"
    },
    {
      "id": 51,
      "start": 1505.2999877929688,
      "end": 1510.9800109863281,
      "text": " in verse number six, it's a familiar verse. In fact, at the, I believe it was the last"
    },
    {
      "id": 52,
      "start": 1510.9800109863281,
      "end": 1517.260009765625,
      "text": " Sunday of 2022, so just five months ago or so, I preached a message from this portion"
    },
    {
      "id": 53,
      "start": 1517.260009765625,
      "end": 1521.5799865722656,
      "text": " of scripture, Colossians four, verse five and six. And I don't remember exactly what"
    },
    {
      "id": 54,
      "start": 1521.5799865722656,
      "end": 1525.4599914550781,
      "text": " I titled the message, something with regard to having a successful year, that sort of"
    },
    {
      "id": 55,
      "start": 1525.4599914550781,
      "end": 1530.9800109863281,
      "text": " thing. And I talked about walking in wisdom toward them that are without and redeeming"
    },
    {
      "id": 56,
      "start": 1530.9800109863281,
      "end": 1536.9400024414062,
      "text": " the time. And then I talked about this in verse number six, let your speech, notice"
    },
    {
      "id": 57,
      "start": 1536.9400024414062,
      "end": 1546.7000122070312,
      "text": " those words, these are difficult words, be always with grace. That little word in Colossians"
    },
    {
      "id": 58,
      "start": 1546.7000122070312,
      "end": 1551.6199951171875,
      "text": " four in verse number six where it says, always, that's an important word. It's a difficult"
    },
    {
      "id": 59,
      "start": 1551.6199951171875,
      "end": 1557.4599914550781,
      "text": " word. You know why? Sometimes we just don't feel like it. Sometimes our flesh wants to"
    },
    {
      "id": 60,
      "start": 1557.4599914550781,
      "end": 1563.4599914550781,
      "text": " just say something. You have the flesh just like I do. We all have the flesh. We're to"
    },
    {
      "id": 61,
      "start": 1563.4599914550781,
      "end": 1569.3800048828125,
      "text": " mortify our members, we're to crucify our flesh. But you know, it's very amazing to"
    },
    {
      "id": 62,
      "start": 1569.3800048828125,
      "end": 1574.1400146484375,
      "text": " me how quickly our flesh can come alive. Have you ever experienced that? I mean, you're"
    },
    {
      "id": 63,
      "start": 1574.1400146484375,
      "end": 1578.9400024414062,
      "text": " walking in the spirit, you're just rejoicing in the Lord and then something happens and"
    },
    {
      "id": 64,
      "start": 1578.9400024414062,
      "end": 1584.5,
      "text": " all of a sudden it's like, man, what happened? I was trying to rent a piece of machinery"
    },
    {
      "id": 65,
      "start": 1584.5,
      "end": 1588.2200012207031,
      "text": " probably ten years ago for the church and I was in the place of business trying to rent"
    },
    {
      "id": 66,
      "start": 1588.2200012207031,
      "end": 1591.8599853515625,
      "text": " a piece of machinery to do some work here at the church and the owner of that establishment"
    },
    {
      "id": 67,
      "start": 1591.8599853515625,
      "end": 1601.5400085449219,
      "text": " just ripped me to pieces. I mean, just criticized me, he questioned my integrity, he questioned,"
    },
    {
      "id": 68,
      "start": 1601.5400085449219,
      "end": 1609.0199890136719,
      "text": " I mean, he just was ugly nasty, just rude. You call yourself a preacher and you're trying"
    },
    {
      "id": 69,
      "start": 1609.0199890136719,
      "end": 1614.739990234375,
      "text": " to get away with paying taxes. He was just going after me. All because I tried to give"
    },
    {
      "id": 70,
      "start": 1614.739990234375,
      "end": 1621.8999938964844,
      "text": " him a tax exempt form that is a state of Virginia form to not have to pay taxes for the piece"
    },
    {
      "id": 71,
      "start": 1621.8999938964844,
      "end": 1627.5799865722656,
      "text": " of equipment that we're renting. You call yourself a preacher. I mean, he was going"
    },
    {
      "id": 72,
      "start": 1627.5799865722656,
      "end": 1632.4599914550781,
      "text": " after me. And here's all I could, the Holy Spirit just kept running around. I just, five"
    },
    {
      "id": 73,
      "start": 1632.4599914550781,
      "end": 1637.0599975585938,
      "text": " minutes earlier I was just praying this, Lord help me to walk in the spirit today. Lord"
    },
    {
      "id": 74,
      "start": 1637.0599975585938,
      "end": 1644.260009765625,
      "text": " help me not to give in to the flesh. Lord help me to walk in the spirit. And I pray"
    },
    {
      "id": 75,
      "start": 1644.260009765625,
      "end": 1650.4599914550781,
      "text": " this, Lord help me to be dead to criticisms and to compliments. And it was real in that"
    },
    {
      "id": 76,
      "start": 1650.4599914550781,
      "end": 1655.5799865722656,
      "text": " moment because I wanted to tell that guy a few things as well. I'm just being honest"
    },
    {
      "id": 77,
      "start": 1655.5799865722656,
      "end": 1665.0199890136719,
      "text": " with you. I mean, he was questioning my integrity. It was, and I just stood there. I just stood"
    },
    {
      "id": 78,
      "start": 1665.0199890136719,
      "end": 1673.6199951171875,
      "text": " there. And he got done. And I very quietly, very kindly and politely, I said, sir, with"
    },
    {
      "id": 79,
      "start": 1673.6199951171875,
      "end": 1679.1400146484375,
      "text": " all due respect, could you just read letter B of this form and let me know why this is"
    },
    {
      "id": 80,
      "start": 1679.1400146484375,
      "end": 1683.5799865722656,
      "text": " not, I don't mind paying the taxes, but can you just explain it to me? Ripped the paper"
    },
    {
      "id": 81,
      "start": 1683.5799865722656,
      "end": 1688.8999938964844,
      "text": " out of my hand, read it, threw it on the table, whatever, I won't charge you the taxes."
    },
    {
      "id": 82,
      "start": 1688.8999938964844,
      "end": 1696.0199890136719,
      "text": " I mean, just ugly. But listen, sometimes that happens in our lives. But how do we respond"
    },
    {
      "id": 83,
      "start": 1696.0199890136719,
      "end": 1702.8999938964844,
      "text": " to it? How do we respond to it? Talked about divisions and contentions a couple of weeks"
    },
    {
      "id": 84,
      "start": 1702.8999938964844,
      "end": 1706.1000061035156,
      "text": " ago. You know, people sometimes respond to that kind of stuff today. They go to their"
    },
    {
      "id": 85,
      "start": 1706.1000061035156,
      "end": 1712.02001953125,
      "text": " car and they get some kind of weapon and they do some bad stuff. No, no, no, no. That's"
    },
    {
      "id": 86,
      "start": 1712.02001953125,
      "end": 1720.260009765625,
      "text": " not how we respond. We have to be kind. A soft answer, turn it the way we're at. It's"
    },
    {
      "id": 87,
      "start": 1720.260009765625,
      "end": 1728.7000122070312,
      "text": " a biblical promise. Grievous words stir up anger. This evening, our words are powerful."
    },
    {
      "id": 88,
      "start": 1728.7000122070312,
      "end": 1736.7000122070312,
      "text": " Our words are powerful. And if we're not careful, we don't take heed to the truth of"
    },
    {
      "id": 89,
      "start": 1736.7000122070312,
      "end": 1745.0999755859375,
      "text": " Proverbs 21 and verse 23. And our words, they cause us trouble, cause us trouble. I hope"
    },
    {
      "id": 90,
      "start": 1745.0999755859375,
      "end": 1754.5,
      "text": " this evening that God would help us to understand the power of our words to set a watch, a gate"
    },
    {
      "id": 91,
      "start": 1754.5,
      "end": 1761.0999755859375,
      "text": " before our mouth, that we would think before we speak. Say, God, I want to honor you with"
    },
    {
      "id": 92,
      "start": 1761.0999755859375,
      "end": 1769.3800048828125,
      "text": " my words. I want to build people up with my words. At times, you're going to have to deliver"
    },
    {
      "id": 93,
      "start": 1769.3800048828125,
      "end": 1775.6199951171875,
      "text": " a message to someone that's necessary but difficult. And in those moments, oh, you need"
    },
    {
      "id": 94,
      "start": 1775.6199951171875,
      "end": 1782.7000122070312,
      "text": " to beg God for help, grace and mercy, to be able to communicate effectively and appropriately"
    },
    {
      "id": 95,
      "start": 1782.7000122070312,
      "end": 1790.3400268554688,
      "text": " that message. Our words are powerful, very powerful. This evening, I hope that each and"
    },
    {
      "id": 96,
      "start": 1790.3400268554688,
      "end": 1796.0599975585938,
      "text": " every one of us say, God, I want my words to be pleasing to thee. Let me finish. I said"
    },
    {
      "id": 97,
      "start": 1796.0599975585938,
      "end": 1799.1400146484375,
      "text": " I was going to finish with this verse, but let me just finish with Psalm 19."
    },
    {
      "id": 0,
      "start": 1799.1400146484375,
      "end": 1809.2800149917603,
      "text": " Psalm 19. Look there with me. Psalm 19. We're familiar with the psalm, the heavens declare"
    },
    {
      "id": 1,
      "start": 1809.2800149917603,
      "end": 1813.7400150299072,
      "text": " the glory of God, the firmament showeth His handiwork, but I want you to notice verse"
    },
    {
      "id": 2,
      "start": 1813.7400150299072,
      "end": 1822.360013961792,
      "text": " 14. Psalm 19 and verse 14. We actually don't do this very often, but would you read the"
    },
    {
      "id": 3,
      "start": 1822.360013961792,
      "end": 1833.5200157165527,
      "text": " verse with me? Psalm 19 and verse number 14. Let's read it together. Let the words of my"
    },
    {
      "id": 4,
      "start": 1833.5200157165527,
      "end": 1847.840015411377,
      "text": " mouth and the meditation of my heart be acceptable in thy sight, O Lord, my strength and my redeemer."
    },
    {
      "id": 5,
      "start": 1847.840015411377,
      "end": 1859.4000129699707,
      "text": " In whose sight? In God's sight. Let the words of my mouth and the meditation of my heart"
    },
    {
      "id": 6,
      "start": 1859.4000129699707,
      "end": 1867.5200119018555,
      "text": " be acceptable in thy sight, O Lord, my strength and my redeemer."
    },
    {
      "id": 7,
      "start": 1867.5200119018555,
      "end": 1873.2000122070312,
      "text": " Father, we love you. We thank you for loving us. We thank you for the privilege of being"
    },
    {
      "id": 8,
      "start": 1873.2400131225586,
      "end": 1878.9200134277344,
      "text": " able to be gathered in the house of God today. Lord, we thank you for Mother's Day, the opportunity"
    },
    {
      "id": 9,
      "start": 1878.9200134277344,
      "end": 1887.8000183105469,
      "text": " that we've had to honor the ladies of our church. God, we thank you for your word and"
    },
    {
      "id": 10,
      "start": 1887.8000183105469,
      "end": 1894.120018005371,
      "text": " for the truth of your word. It's so applicable in our lives. It's relevant for everyday living."
    },
    {
      "id": 11,
      "start": 1895.120018005371,
      "end": 1903.4400177001953,
      "text": " God, this message this evening is one that, I think if we'd be honest, steps on all of"
    },
    {
      "id": 12,
      "start": 1903.4400177001953,
      "end": 1913.6400146484375,
      "text": " our toes. God, I pray that that verse that we just read in unison together would be the"
    },
    {
      "id": 13,
      "start": 1913.6400146484375,
      "end": 1918.160011291504,
      "text": " motto of our lives, that the words of our mouth, the meditation of our heart would be"
    },
    {
      "id": 14,
      "start": 1918.160011291504,
      "end": 1923.880012512207,
      "text": " acceptable, O Lord, in thy sight. Lord, help us to please you with our words. Help us to"
    },
    {
      "id": 15,
      "start": 1923.880012512207,
      "end": 1930.0400085449219,
      "text": " understand this evening the power of our words. I pray that as we have a moment of invitation"
    },
    {
      "id": 16,
      "start": 1930.0400085449219,
      "end": 1934.7400207519531,
      "text": " that you'd move and work in hearts and lives as only you can. Oh, God, I pray that we do"
    },
    {
      "id": 17,
      "start": 1934.7400207519531,
      "end": 1941.0400085449219,
      "text": " business with you. I pray that we would be doers of the word and not hearers only. We'll"
    },
    {
      "id": 18,
      "start": 1941.0400085449219,
      "end": 1944.2400207519531,
      "text": " thank you for the work that you'll do. For it's in Christ's name we pray. Would you stand"
    },
    {
      "id": 19,
      "start": 1944.2400207519531,
      "end": 1948.1200103759766,
      "text": " with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano."
    }
  ],
  "processed_at": "2025-04-16T09:11:59.186996"
}