{
  "video_id": "d-1B6rYpHbw",
  "text": "With the Lord's help today we'll go from verse 18 through 27. You want to open the windows? I mean you can if you want that's fine distractions First John chapter number 2 verses 18 through 27. We'll be looking at this morning I just want to read verse number 18 and we'll get into the message this morning It says little children is the last time and as you have heard that Antichrist shall come Even now are there many? Antichrist whereby we know that it is the last time we're living in the last days we understand that Paul as he's writing to Timothy in 2nd Timothy, he speaks about some of the the truth with regard to the last days and some of the Ways in which we will be dealing with various things He talks about the perilous times that shall come and we find that here as we look at this passage of Scripture Really as John is ministering to these believers. He's giving them great truth. That is so precious for us this morning as well It's been so impactful throughout the entirety of the church age if you'll remember in our previous study It was two weeks ago But in our previous study we looked at verses 15 through 17 Love not the world and as we looked at that passage of Scripture We spoke about the fact that there was a warning that was given to the believers With regard to the tactic of the enemy to corrupt the people of God and the Church of God externally and we see the external threat the warning was given about those three pitfalls the lust of the flesh the lust of the eyes and the pride of life and the way in Which the enemy will use the external things in order to corrupt the people of God and to corrupt the Church of God This morning as we move into this passage of Scripture in verses 18 through 27 Really? Now we are given a warning with regard to the tactic of the enemy to corrupt the people of God and the Church of God internally and we see that there's an external factor the world the flesh the devil the lust of the eyes the lust of the flesh and the pride of life we see That external threat and the warning that is given but we find that as we enter into this section in first John that once again, there is a reference to the internal threat that of false teaching and we understand that the enemy as Jude mentions that there have been some that have crept in unawares and the importance of contending earnestly contending for the faith because of this internal Threat to the people of God to the Church of God and the enemy using that internal Tactic in order to corrupt the people of God now, we know that throughout the New Testament in fact, we started as we began the study in the book of first John to speak about some of the false teaching that was prevalent at the particular time and some of what they were dealing with and we know that all throughout the first century and all throughout church history And including today there has been false teaching we find the New Testament gives us many references and many Truths with regard to the subject of false teaching and to the warnings We find that Peter says it this way under the inspiration of the Holy Spirit of God that just as there were false Prophets that there will be false teachers as you study the Word of God in the Old Testament You'll find that on a number of occasion. There is record in reference to the false prophets that were so prevalent During that day when God was using Jeremiah in particular God was giving Jeremiah truth and God was giving Jeremiah warning with regard to the impending danger The the Babylonian captivity and all that was taking place and yet there were false Prophets that were coming on the stage and saying nope. This isn't true. This isn't true This isn't gonna happen and so on and so forth And if you read the book of Jeremiah and you understand what's taking place throughout that those portions of that book you'll find that God is faithful to say I have given my word to Jeremiah and These are liars. They're false prophets. They're not prophesying my word they're coming and they're saying that they're speaking the word of the Lord, but in fact They are lying and we find here that these false teachers Continue to exist today and there is a great danger of corruption Internally notice as we study this portion of Scripture this morning if you're taking notes number one the exposure of false teaching I'm thankful that the Word of God exposes the false teachers for what they are Amen, I'm thankful that God has provided us with this precious book and with the truth. He says thy word is truth I'm thankful that Jesus himself is truth and he's given us truth and it exposes the false teaching We notice here as we look at verses 18 and 19. I've read verse 18. Let me read verse 19 It says they went out from us speaking of these that are referred to in verse number 18 as Antichrist They went out from us, but they were not of us for if they had been of us They would no doubt have continued with us, but they went out that they might be made Manifest that they were not all of us as we consider the exposure of false teaching I want you to see the description that is provided the description of these false teachers in verse number 18 The Bible refers to describes these false teachers as being Antichrist Notice the Bible says in verse number 18 as you have heard it says little children It is the last time and as you have heard that Antichrist shall come We'll come back to that at the end of the message this morning But notice the next phrase even now are there many? Antichrists Whereby we know that it is the last time we find that this word Antichrist or Antichrist. It's the same Greek word We find that John uses it in his writings and we find that really the the best way to define this word is any person that is teaching something that is against Christ or Instead of Christ and we find that this spirit of the Antichrist and these many Antichrists that are already prevalent. We're told in 2nd Thessalonians chapter number 3 and verse number 7 Excuse me chapter number 2 and verse number 7 that the mystery of iniquity doth already work And we find that as we look at this portion of Scripture And we see how that these false teachers are described that they're described as being Antichrist They are against the Lord Jesus Christ The Bible tells us in 1st John chapter number 4 in verse number 3 in every spirit that confesseth Not that Jesus Christ has come in the flesh is not of God and this is that spirit of Antichrist Whereof ye have heard that it should come and even now Already is it in the world? We find that in verse number 1 of 1st John chapter number 4 He refers to these as being not only Antichrist, but as false prophets Notice it says in 1st John 4 in verse number 1 It says this beloved believe not every spirit, but try the spirits whether they are of God because why because many False prophets are gone out into the world the plurality the the number of these false prophets of these Antichrist these that are against the Lord Jesus Christ notice the description goes further in our text It says in 1st John 2 in verse number 22 It says who is a liar, but he that denieth that Jesus is the Christ He is Antichrist that denieth the father and the son he calls him a liar They're liars The Bible tells us that the devil is a liar. He's the father of it He's the father of it. Amen and John chapter number 8 and we find that Jesus is truth but these Antichrist these false teachers that are prevalent not only in the day in which John is writing all throughout church history and especially today we see these many false teachers these false prophets these Antichrists as they're described for us. And so we see the description I want you to notice their doctrine the doctrine of these false teachers in verse 22 in verse 23 We read verse 22. It says who is a liar, but he that denieth that Jesus is the Christ He is Antichrist that denieth the father and the son notice verse 23 whosoever denieth the son The same hath not the father, but he that acknowledgeth the son hath the father also in 1st John 2 in verse 22 and 23 God gives us some insight with regard to the doctrine of these false teachers That are described as being liars and being antichrists. We find that there's something that's very consistent Amongst cults and amongst world religions and that is their false teaching surrounding the person of Jesus Christ We find that this is so prevalent in our society today you begin to look at the cults and the world religions and you find that they're They they air with regard to the person of Jesus Christ And let me say this if you're wrong on who Jesus is you're wrong. I mean and it is the the the the Cost of being wrong on that point is severe because we know that without the Lord Jesus Christ That there is no salvation. The Bible says that I am the way the truth and the life No, man cometh unto the father But by me there is no other name given under given among men under heaven given among men Whereby we must be saved Peter is speaking in Acts 4 about the name of Jesus and we find here that here these Antichrists these false teachers these liars What is it that they do? What is their doctrine? Notice it says that they denieth, in verse number 22, that Jesus is the Christ. They deny that He is God in flesh. They deny the deity of Jesus Christ. They deny it. There are many today that have tried to explain away the Trinity. They've tried to attack the person of Jesus Christ. Why? Because perhaps they say, well, it doesn't make sense in my mind. His ways are not our ways. His thoughts are not our thoughts. He transcends us, and we cannot fully comprehend who He is. The reality is that the Bible tells us, even as I said this morning as we opened in prayer, that our God is a great God. We sang, to God be the glory, great things He hath done. And our God is great, and His greatness has been revealed to us. His greatness has been declared to us. But as much as we know this morning that He is great, the psalmist continues to say that His greatness is unsearchable. It's amazing. When you think about how great our God is, and as much as I think I might understand, as much as you think you might understand, He's so much higher than what we could possibly conceive in our minds. He is God. He is God in flesh. He has no beginning and no end. He is the Almighty. He is the Messiah. He is the Promised One. And we find that they deny that Jesus is the Christ, and look at the consequence of their false teaching. It says in verse number 23, Whosoever denieth the Son, the same hath not the Father. There's no wiggle room. Amen? There's no wiggle room. There's an absolute truth that is provided to us here in this passage of Scripture. Listen, you can't deny the person of Christ. You can't deny the truth of the deity of Christ and have the Father, because the only way you know the Father is through the Son. Amen? Now remember, the writer, humanly speaking, of the book of 1 John is the Apostle John. You think about the truth of the book of the Gospel of John and how the Gospel of John shows over and over and proves the deity of Jesus Christ. And John, remember, he's saying, I'm an eyewitness. Remember as we started this book, we talked about how he says we've heard Him, we've seen Him, we've handled Him. He's providing this truth, and he says, listen, there are many false teachers. They are anti-Christ. They're against the Lord Jesus Christ. They deny that He is God, and in their denial of Him being God, they do not have the Father. 2 John 1, there's only one chapter, but 2 John and verse number 7, the Bible says this. Notice just a few pages over in 2 John, verse number 7, for many deceivers are entered into the world. Do you see how every one of these references talks about the plurality of them and the number of them? There are many, and it says this, who confess not that Jesus Christ has come in the flesh. This is a deceiver and an anti-Christ. Jesus did come in the flesh. He was born of a virgin. He was born. Remember, you think about the truth of Philippians chapter number 2, where the Bible talks about, let this mind be in you, which was also in Christ Jesus, and you begin to read the truth of Philippians 2, and you read about the incarnation, and you read about all that takes place, and what a blessing to see the summary that is given. It continues and says, who being in the form of God, thought it not robbery to be equal with God, but made himself of no reputation, took upon the form of a servant, and was made in the likeness of men. The Bible tells us that being found in fashion as a man, he humbled himself and became obedient unto death, even the death of the cross. But you understand that he rose, conquering sin, death, and the grave. Amen! He rose. He lives. He ever liveth to make intercession for us. He's coming again, and here we find that the Bible says, wherefore God also hath highly exalted him, and given him a name which is above every name, that at the name of Jesus every knee should bow of things in heaven, and things in earth, and things under the earth, and that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. These false teachers, these antichrists that deny that Jesus is Lord, I'm sorry this morning for them, but the reality is that one day they will acknowledge that He is God. I hope they would acknowledge it before it's eternally too late. It's not a matter of if, it's a matter of when. And when makes all the difference, because they will confess that Jesus Christ is Lord. We find that here in the book of 1 John we see the description of false teachers, because these false teachers are being exposed, and the Word of God is exposing them for what they are, and they're described, and then we see their doctrine, and I want you to see their desire. What's the desire of these false teachers? Well, in verse number 26 of 1 John chapter number 2, we find that this desire that is given to us is revealed to us here. It says, these things have I written unto you, the believers, the little children that are addressed in verse number 18, concerning them, that's the false teachers, that's the antichrist, that seduce you. Their desire is to seduce you. That word means to cause to stray, to lead away, to lead aside from the right way. That's what they want to do, they want to seduce you. And let me say this, just like they did in the book of Jeremiah, these false teachers, these false prophets, they come with all of their fanfare, they come with all of their just various types of eloquence, and they come in, and sometimes they'll use various means, and man, they look like they got it all together and they sound good and so on and so forth, but they're lying. They're false teachers. Let me give you one example in Jeremiah chapter 28. The Bible records for us here about Hananiah the prophet that died because God said he was going to die because he was a false prophet and he was prophesying lies. But it's interesting as you look through Jeremiah chapter 28, it's only 17 verses, I don't have the time to read all of it, but I want you to know that as we go through this passage of Scripture that Hananiah, in verse number 10, let me read verse number 9, the prophet which prophesieth of peace, when the word of the prophet shall come to pass, then shall the prophet be known that the Lord hath truly sent him. That's the test. You can read that all the way back in Deuteronomy, but then look in verse number 10, then Hananiah the prophet took the yoke from off the prophet Jeremiah's neck and break it. Can you imagine the way in which the crowd would respond to such antics? Jeremiah is prophesying that the Babylonians that besiege us, that they're going to take us captive and that this city is going to be destroyed and so on and so forth, and then this Hananiah comes and he takes these yokes and he breaks them and he says in the presence of all the people, notice in verse number 11, thus saith the Lord, they proclaim, they pretend that they're speaking the word of God. It says, even so will I break the yoke of Nebuchadnezzar, king of Babylon, from the neck of all nations within the space of two full years, and the prophet Jeremiah went his way. Then the word of the Lord came unto Jeremiah, the prophet, after that Hananiah the prophet had broken the yoke from off the neck of the prophet Jeremiah, saying, go and tell Hananiah, saying, thus saith the Lord, thou hast broken the yokes of wood, but thou shalt make for them yokes of iron. It's interesting, he said that it would be within the space of two full years, but if you read verse number 16, it says, therefore, thus saith the Lord, behold, I will cast thee from off the face of the earth. This year thou shalt die, because thou hast taught rebellion against the Lord. So Hananiah the prophet died the same year in the seventh month. God dealt with him. It was severe judgment. But I just think about that passage of Scripture and the antics of Hananiah and the way in which he's breaking that yoke. I mean, certainly the people would be excited about hearing something like that. He's saying that he's speaking the word of the Lord, but God says, no, I didn't give him this message. We see that the desire of these antichrists, the desire of these false teachers is to seduce, to deceive. Remember this truth in 2 Timothy 3, in verse number 13, the Bible says, but evil men and seducers shall wax worse and worse, deceiving and being deceived. On Wednesday evenings, several, I don't know, last year in the fall, I preached a series for a couple of months on the danger of deception. The way in which we read all throughout the word of God, the warning has been given to us with regard to this age of deception in which we're living. We find that these false teachers that are mentioned here, the exposure of false teaching, he gives a description, he gives their doctrine and then he speaks of their desire. As we move forward this morning, I want you to think not only of the exposure of false teaching, but I want you to consider number two, the enabling of the believer, the enabling of the believer. I'm thankful that there's a great contrast in these verses of Scripture with regard to the behavior of the false teacher, the behavior of the Antichrist, that spirit of Antichrist versus the behavior of the believer. The reality is that in verse number 20, the Bible says, but we, excuse me, but ye have an unction from the Holy One, and ye know it. all things.\" Notice, in verse number 27, it says, \"...but the anointing which ye have received of him abideth in you. And ye need not that any man teach you, but as the same anointing teacheth you of all things, and is truth, and is no lie. And even as it hath taught you, ye shall abide in him.\" We have an unction from the Holy One. The anointing which we have received, according to verse number 27, \"...of him abideth in you.\" And we find that this is none other than the anointing of the Holy Spirit of God. I'm so thankful for the Holy Spirit. I'm thankful that the Bible teaches us that at the moment of salvation that we are sealed with that Holy Spirit of promise, which is the earnest of our inheritance. The Bible teaches us that in Ephesians 1 and verses 13 and 14. And what a joy to know that my body is the temple of the Holy Spirit of God, and if you've been saved, if you've been born again, the Holy Spirit of God indwells you. We have this unction. We have this anointing, and he's speaking of that. We understand that later in the book of Ephesians that the believers in Ephesus would be encouraged to be filled with the Spirit of God. You receive the Spirit of God at the moment of salvation. You've been indwelled by the Spirit of God, but you must be filled with the Holy Spirit of God. What's the difference? What is it that we're speaking of? Well, very simply this, it's not how much of the Holy Spirit I have, because at the moment of salvation, I got all of the Holy Spirit I'm ever gonna get, and so did you. What's in view here is how much of me the Holy Spirit has. How much have I yielded to the Holy Spirit of God? How much have I been filled with the Holy Spirit? What prevents me from being filled with the Holy Spirit of God itself? We find that we've been given this responsibility, and we think about the enabling of the believer. I want you to think about this passage and what this enabling allows us to do. It enables us to perceive. To perceive. Notice with me in verse 21, again, we'd say this, to perceive or to discern, and discernment is critical. Discernment is critical. Why? Because they'll wax eloquent. They'll use words that seem to be close to what you're familiar with. They'll say things that seem to, man, they got it all together. They've presented this so just in order, and it just seems so just right like it should be, right in line. They'll wax eloquent, but we need perception. We need to be able to perceive. We need to be able to discern. Notice in 1 John 2, it says that we have an unction from the Holy One in verse number 20, and ye know all things. Continue in verse number 21. Notice what it says here. It says this, I have not written unto you because you know not the truth, but because you know it, and that no lie is of the truth. You see how John is encouraging these believers. It's interesting because Peter says this, I'm gonna remind you of some things. I'm gonna stir you up by putting you in remembrance of things. Though you know them, he says I'm gonna remind you of them, and John says I'm not writing to you because you don't know the truth, but in fact you know it. You have the truth, and I'm trying to help you to understand that no lie is of the truth, and so as this enabling that we have, it enables us to perceive the anointing of the Holy Spirit of God, helps us to be able to perceive and to discern between right and wrong, between right teaching and wrong teaching, between truth and error. We find that as we look at this passage of Scripture, and he speaks about that, that we know the truth, that we have the truth. Again in verse number 27, he tells us that he teaches us the truth. I am so thankful this morning that the Holy Spirit of God is the divine teacher. I'm thankful this morning that the Holy Spirit of God, according to what John writes to us, and you read in chapters 15 and 16 as the Lord Jesus Christ is giving this truth to the disciples with regard to the coming of the Holy Spirit of God, he says it's expedient for you that I go away. He is the the Holy Spirit of comfort, but he's also our divine teacher, and it tells us in verse number 27 that you need not that any man teach you, but as the same anointing teacheth you of all things, notice this, and is truth and is no lie, and even as it hath taught you, ye shall abide in him. I'm thankful for the enabling of the Holy Spirit of God, the enabling of the believer, and that he enables us to perceive. You hear something, and maybe you don't know the exact answer. Maybe you're not equipped to have that perfect answer immediately, but the Holy Spirit of God just gives you that uneasy feeling with regard to something just doesn't seem right with that. You begin to dig in, and you begin to ask the divine teacher to reveal to you from this precious book the truth of God's Word, what it is that is truth on that particular subject. Listen, we're not to be tossed to and fro with all of these teachings, and we're to be settled and established, and we're to know the truth, and I'm thankful that the Holy Spirit of God enables us to perceive. Discernment is critical when you think about false teaching. They wax eloquent. Notice not only the enabling that he enables us to perceive, but I want you to understand he enables us to proceed, to continue. Notice in verse number 24, he says this, let that therefore abide in you. He uses that phrase at the end of verse number 27 as well, ye shall abide in him, and that phrase abide. Of course, John would be very familiar with that phrase as he was taught about the importance of abiding in Christ. He says, let that therefore abide in you. What is it that he is referring to? What you have heard from the beginning. What you have heard from the beginning. There's nothing new under the sun, right? God's given us all things that pertain unto life and godliness, and we find that John's saying, listen, just as Paul said when he's writing to those churches in the region of Galatia, he's saying, listen, there's no new gospel. There's no other gospel. These people have come in and they've given you a false gospel, and John says, listen, let that therefore abide in you which you have heard from the beginning. Notice, if that which you have heard from the beginning shall remain in you, notice, ye shall, ye also shall continue in the Son and in the Father. I'm thankful that the Holy Spirit of God, the anointing, that unction that enables us to proceed, to continue. Yes, we understand that we're living in the midst of apostasy. We're living in the last days. We're living with so many false teachers, but the enabling, the unction, the anointing of the Holy Spirit of God enables us to proceed, to continue going forward. We don't have to become a casualty by this internal attack. Remember, as we said by way of introduction, that as you notice in the previous text of Scripture that we looked at two weeks ago, that there's the warning that is given with regard to that attack, that corruption externally. The world, the lust of the flesh, the lust of the eyes, the pride of life. And you say, listen, love not the world. There's the potential of becoming corrupt because of the world, the external threat. And how sad it is that so many churches today have become so worldly that it's almost impossible to distinguish them between being a church and being a club. And that's sad. I know it's not popular, but it is certainly prevalent in our society today. Come out from among them and be ye separate, saith the Lord. There is a distinction and a difference amongst the people of God. Amen? By the grace of God and with the help of God, we're never gonna have a nightclub atmosphere in this place. Amen? Seriously. Don't get me on that rabbit trail. Let me get back. Amen? I'm serious though. There should be a distinction, the external threat. But you know there's an internal threat and it's false teaching. And they creep in unawares. They begin to preach heresy. They deny the Lord Jesus Christ. Though I've said this, we need to be careful of false teachers because they use our vocabulary but not our dictionary. They'll use words that you're familiar with but they mean something entirely different by those words. And we have to be careful to have that discernment to say, listen, we need to be able to understand what is being said and what is being given. And what do you mean by that? What is your definition of that? The Holy Spirit of God enables us to continue. It's interesting, we won't take time this morning, but if you go back to 2 Timothy chapter number 3 and you read about those perilous times and how Paul describes all that will take place and he says, as we mentioned in verse number 13 of chapter number 3, that evil men and seducers shall wax worse and worse, deceiving and being deceived. You know what verse number 14 says? but continue.\" Yeah, there are going to be false teachers, there's going to be all of this nonsense that's going on, but we're to continue. How can I continue? First John chapter number 2. It's the enabling, the anointing, that truth abiding in us and that if it remains in us that ye shall continue in the Son and in the Father. The Word of God is precious and it's so connected. One passage to another and you interpret Scripture by Scripture and you begin to see, listen, I can't continue in my own power and neither can you. With all of the apostasy and all of the trouble that's going on in the perilous times, I'm not able to continue in my own power and neither are you. But we have that enabling, the anointing, the unction. What a blessing. Now let me, as we look at this passage of Scripture and we identify the exposure of false teaching and the enabling of the believer, let me circle back. I said that we'd go back to this in verse number 18 and I'm going to spend the remainder of the time this morning with regard to this thought. As you look back at verse number 18, John started in verse number 18 by making this statement, little children, it is the last time. And as ye have heard, that Antichrist shall come. Even now are there many Antichrists whereby we know that it is the last time. See, the reality is that as he refers to these false teachers as being Antichrists, he also makes mention that they have heard that Antichrist shall come. And he is going to come. The Antichrist will be revealed. We don't know exactly a date. I do not intend in any way, shape, or form this morning, as we look at a few things, to try to put any type of date on this because it would be inappropriate for me to do so, but the reality is that we can understand biblically and scripturally when it is that the Antichrist shall rise. It's very likely that the Antichrist is in our society today. We'd have no idea who they might be, but when they rise, I would say this, it would be after the rapture of the church. The rapture of the church is imminent, by the way, and really, if we had a couple of hours this morning, we'd just go all the way through the third verse of chapter number three because they're so connected with verse 18 of chapter number two of 1 John, all the way through verse three of chapter number three. We'll break it up into two messages, and I'll deal with that subject next week, of when he shall appear, but Jesus is coming. His return is imminent. And the reality is that the Bible would teach us that after the rapture of the church, again, which is imminent, that the Antichrist shall rise. According to Daniel chapter number nine in verse number 27, he, the Antichrist, is going to sign a peace treaty with Israel at the start of the tribulation. That is going to happen. And we find, according to Daniel nine in verse number 27, that it's at the start of that seven period, that period of tribulation, the week of tribulation that is referred to, and we find that at the midpoint, at the three-and-a-half-year point, he is going to break that treaty, right? In 2 Thessalonians chapter number two, I mentioned already, verse number seven, where the Bible says that the mystery of iniquity doth already work, but notice in 2 Timothy two, in verse number three, and excuse me, I said Timothy, 2 Thessalonians, excuse me, 2 Thessalonians two, in verse number three, we're talking about when will Antichrist rise. John started out the passage of scripture in 1 John two, in verse number 18, speaking to these believers and telling them, and this is the last time, and telling them that they have heard that Antichrist shall come. He then continues and says, listen, there are already many Antichrists, these false teachers that are prevalent, but the reality is that the Antichrist is going to appear. He is going to rise. Continuing to 2 Thessalonians two, in verse number three, the Bible says, let no man deceive you by any means, for that day shall not come, except there come a falling away first, and that man of sin be revealed, the son of perdition. This is the Antichrist, how he's described here in 2 Thessalonians. We notice that in verse number four, again, the connection of Daniel's prophecy in chapter number nine, and it talks about at that midpoint of the tribulation, in verse number four of 2 Thessalonians two, who opposeth and exalteth himself above all that is called God, or that is worshiped, so that he as God sitteth in the temple of God, showing himself that he is God. We know that he's not God, he's Antichrist. But when does this rise of Antichrist, how is it that we would say that it's after the rapture of the church? Well, we'll turn to the book of Revelation, thank you for asking, and look in the book of Revelation in chapter number three, and then we'll look at chapter four and chapter six. In Revelation chapter number three, as the messages are given to the churches in Asia, they begin in chapter number two, and in chapter number three, he's given a message to Philadelphia, the church in Philadelphia, in verses seven through 13. I want to notice what he says in verse number 10, because thou hast kept the word of my patience, I also will keep thee from the hour of temptation, which shall come upon all the world, to try them and to dwell upon the earth. We know that Jeremiah speaks of the tribulation as being the day of Jacob's trouble, and we find that in Revelation chapter number four, as you look at all of the churches that are addressed in chapters two and three, really providing us truth with regard to the church age. And we find that in the fourth chapter, beginning in verse number one, notice what the Bible says, after this, after all that he deals with with these seven churches, after this, I looked, and behold, a door was opened in heaven, and the first voice which I heard was as it were of a trumpet talking with me. The songwriter said, listen for the trumpet, Jesus is coming. Why do you say that? We find that in Thessalonians chapter number four, and you think about the trump of God, and here we find that here's what it said, come up hither, and I will show thee things which must be hereafter. We find that as you look at the scriptures, I believe that this is the record, the truth with regard to the rapture of the church. Skip over to chapter number six, if you will, and we see some things in chapters four and five, but in chapter number six, we begin to see about the seal judgments. And I just want to focus for just a few minutes this morning on the first of these three seal judgments that are mentioned in Revelation chapter number six, because this is the rise of Antichrist, the first seal in particular. Notice in Revelation six, in verses one and two, the Bible says this is the first of these seven seals. It says, and I saw when the lamb opened one of the seals. Now, who's the lamb? That's Jesus, right? That is the lamb of God, which taketh away the sin of the world. So the lamb opens one of the seals, and I heard, as it were, the noise of thunder, one of the four beasts saying, come and see. And I saw, and behold, a white horse. And he that sat on him had a bow, and a crown was given unto him, and he went forth conquering and to conquer. Let me say this, this is none other than the counterfeit, the Antichrist. This is not the Lord Jesus Christ. We find that he will come in Revelation chapter 19, and we read of that passage of Scripture, and the heaven is open in verse number 11 of Revelation 19. I saw heaven open, and behold, a white horse, and he that sat upon him was called Faithful and True, and in righteousness he doth judge and make war. That's the return of Jesus Christ at the end of the tribulation. This record of this first seal in Revelation 6, verses 1 and 2, this white horse, this is the counterfeit, this is the rise of Antichrist, which happens after the rapture of the church. Now look at the second seal. In verses 3 and 4, the Bible says, and when he had opened the second seal, I heard the second beast say, come and see. And there went out another horse that was red, and power was given to him that sat there on to take peace from the earth, and that they should kill one another. And there was given unto him, notice this says, a great sword. Now I believe that as you read through the book of Revelation, and you read of the seal judgments, and you read of the trumpet judgments, and you read of the vial or the bowl judgments, that they happen in rapid succession. We find that there's going to be great turmoil, there's going to be the wrath of God during that tribulation period, and we find that now this second horse, this red horse that comes with power, that says that he has the power to take peace from the earth, that they should kill one another. No doubt this red horse would reveal to us intense war upon the earth, and there'd be a great sword. Now look at verses 5 and 6. We're not going to look at all four of these horses this morning. I'm going to stop here at this third horse. But it says here in verse number 5, and when he had opened the third seal, I heard the third beast say, come and see, and I beheld, and lo, a black horse. And he that sat on him had a pair of balances in his hand, and I heard a voice in the midst of the four beasts say, a measure of wheat for a penny, and three measures of barley for a penny, and see thou. hurt not the oil and the wine.\" As we look at this third seal that is mentioned here, this black horse, this would be revealing to us this great famine that is going to take place. This great famine is going to be impactful to the point where the Bible describes it as being a measure of wheat for a penny. Now what he's referring to here in three measures of barley for a penny, what he's referring to here in this passage of Scripture is that there's going to be a daily wage would only buy the normal food for a normal day's food ration. So a day's wage equals a daily ration of food. You say, how could that be? Surely you don't pay, I know things are more expensive at the grocery store today, but you don't pay for one ration of food for one individual what you make in a day. But we notice that as the Antichrist is revealed in verse number one and two, and as the rise of Antichrist and the start of the tribulation, that there's going to be great war that's going to lead to great famine. And this great famine, the Bible tells us that there's going to be a measure of wheat for a penny. Let me just give you a couple of interesting truths this morning. Again, I'm listening for the trumpet, amen? I'm looking to the sky for the reality is that our redemption draweth nigh, amen? The coming of the Lord is nigh, and I'm so thankful to know that the Lord Jesus Christ is coming again, and he's coming right on time. You've often heard me say that things are falling into place in our world today. Listen, there are people today that are looking at all that's taking place and are saying, everything's falling apart, everything's going crazy. And the world is going crazy, but God is in control, amen? And we find that as God is in control, and as John says to these believers that he's writing to, he says, listen, you have heard that Antichrist shall come. Even now are there many Antichrists. So he deals with the false teachers, but he gives mention to the fact that Antichrist shall come. When's he going to come? After the rapture. Here's what's going to happen. And I believe that we are definitely getting close to the return of the Lord Jesus Christ. Now let me just, and again, I hope that no one would take the statements that I'm making this morning and take them out of context. I'm simply trying to help us understand how quickly things can change and how this can come to pass that quick. Because when the rapture of the church takes place and Christians are removed and the Antichrist is revealed and the rise of Antichrist and these seals are opened, it is going to be havoc on earth. The third seal that is mentioned here is world famine. And let me just share with you some interesting truth. It's terrible what's going on in the Ukraine right now with Russia and all of that situation. People are dying. It's a catastrophic situation. But I'll just use this as an example, and I'm not suggesting that this is this period of time. Just bear with me. Don't misunderstand what I'm saying this morning. I'm not seeking to set a date. I'm not seeking to say this is unfolding before our eyes. I'm simply saying, look at how quickly things can change. Do you know that Russia is the number one world exporter of wheat? And Ukraine is number five. Those two countries account for nearly 33% of the world's export of wheat. There are decisions already being made with regard to, we're not going to be able to get wheat. We're not going to be able to do this. It's going to increase, so on and so forth. I read an article this morning, even, about fertilizer that is exported from Russia. And how that Brazil, in particular, is in a real big mess because they don't have fertilizer, and that's where they import it from is Russia, and Russia's not going to export it, and therefore the yield is going to be less, and so on and so forth. And the cost, and you think that inflation's already hit us? It's only going to be worse. It's interesting that in just whatever it's been, 9 or 10 days, 10 days, I guess, since the invasion, that the cost of wheat has gone up 44%. And that, what's going on right now, isn't even close to what's going to happen when the Antichrist is revealed. Again, I'm not suggesting anything beyond what I'm saying, so don't misunderstand, don't take further what I'm saying. I'm simply helping us to understand this morning that we're really seeing the truth of how quickly these things can take place. I think about this when the book of Revelation talks about the two witnesses and how that the whole world is going to see them. You know, for many people, for many generations, it is almost impossible to figure out how that could take place. But for us today, with the advancements in technology, you can see things all over, you can see video from all over the world, active, live video right now. And so we see that these things are absolutely possible, and there are some people that say, oh, look at all that we have, look at all that this is, it's not possible that that's ever going to happen. A day's wage is not, to buy a daily ration of food, and that third seal, that's what's going to happen. That's what God tells us. And so we don't know when Antichrist is going to rise, but we know that it's going to happen after the rapture. And we know that as we look at these truths that God gives us with regard to the false teaching that is so prevalent and how that it leads to the culmination of the rapture of the church and, of course, the Antichrist being revealed, the reality is that our focus should be on the soon return of our Lord and Savior, Jesus Christ. He's coming again. And with everything that's going on in our world, with everything that's taking place, and as you enter into the very next section of 1 John, I'll preach on this next week, but in verse number 28, he says, and now little children abide in him that when he shall appear, he immediately goes from that internal threat to the false teachers, to the Antichrist, as he describes them. And he says, listen, I want you to abide in him, and I want you to understand that he's going to appear, when he shall appear, that we may have confidence and not be ashamed before him, it is coming. And he deals with the return of the Lord Jesus Christ, it'll be our focus next week. But I ask ourselves this question, are we ready? Are we ready for the return of the Lord? We understand some of these things that are taking place, and we notice what's going on in the world. Listen, it's only going to get a whole lot worse after we leave. After the rapture of the church, it's going to get so much worse, because that same passage of Scripture in 2 Thessalonians, that speaks about the mystery of iniquity doth already work, it says, only he who now letteth will let, until he be taken out of the way. And I believe that that's referring to the Holy Spirit of God, who is the restrainer of all of this wickedness, and the Holy Spirit of God indwells in the people of God, and when the rapture takes place, then he that letteth, that restrains, only he who now letteth will let, until he be taken out of the way. The havoc upon earth. Listen, I'm thankful I'm not going to be here for the tribulation. I am thankful. But there are some lost people that I know, there are some lost people that you know, that they think it's bad right now. We know that this pales in comparison to what will be. Amen? And this morning, the false teaching is so prevalent, we must understand the way that these false teachers are exposed, and we must be faithful to continue in that enabling of the Holy Spirit of God to lift up the name of Christ, and to do everything that God would enable us to do to redeem the time to make a difference. Souls are dying. We have a unique opportunity. Souls are being deceived, and we have the truth of this book. And God's given us the warning. I hope that we would take the warning. I hope that as a church, one of the jobs of a pastor is to protect the flock, and I understand the fact that God is the shepherd, the Lord Jesus Christ is the shepherd, the head of the church, but the pastor is the under-shepherd, and the responsibility is to protect the flock of God. Individually, we find that the false teaching, listen, don't believe everything you listen to on YouTube, please. Don't listen to every preacher that's on the Internet and say, well, this preacher said, and he sounded right, and I'm just going to go with it. You can find scores and scores and scores of false teachers out there, and God gives us a warning of the tactic of the enemy to corrupt not only externally but internally. Antichrist will come. I'm not going to be here. But I'm here when the antichrists, the false teachers... are doing what they're doing. And so are you. And so we must be prepared for that and we must engage in that. Let's pray together. Father, we love You. We thank You for loving us. We thank You for the truth of Your Word, the power of Your Word. We thank You for that which has been revealed this morning. I thank You for the warning that's been given about this tactic of the enemy internally. God, I pray that You'd help us to know the truth, help us to stand for truth, help us to fight the good fight. Lord, I pray that You would help us to earnestly contend for the faith and that You would enable us, Lord, to be doers of the Word and not hearers only. I pray, Father, that You would move and work in hearts and lives as only You can. If there's someone that's not sure of heaven, oh God, I pray that today they would get it settled. Today is the day of salvation. That before it's eternally too late, that they would get it settled. Lord, for every believer, I pray that You'd help us to receive the warning on how these false teachers are exposed and then could rejoice in the enabling of the Holy Spirit of God to be able to perceive and to proceed. I pray that You'd help us to continue and that we'd serve You faithfully. Use us to be Your representatives, Your ambassadors in these evil days. We pray that You'd work and move as only You can. For it's in Christ's name we pray. Would You stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano and as she does, the altar is open. Maybe you want to come and thank God for the truth, the warning. Warnings are good. Maybe this morning you've been deceived. Maybe you've been listening to some false teaching. You've gotten some things and maybe you've lent your ear to those things. You need to ask the Lord to help you. Maybe this morning there's some people that you know that though you won't be here when the Antichrist is revealed, they will and maybe you want to pray for them. Ask God to give you unique opportunities of being able to share the gospel with them, to give them the truth. As Kimberly plays, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.940000057220459,
      "text": " With the Lord's help today we'll go from verse 18 through 27. You want to open the windows?"
    },
    {
      "id": 1,
      "start": 4.940000057220459,
      "end": 7.239999771118164,
      "text": " I mean you can if you want that's fine"
    },
    {
      "id": 2,
      "start": 8.359999656677246,
      "end": 10.359999656677246,
      "text": " distractions"
    },
    {
      "id": 3,
      "start": 12.880000114440918,
      "end": 16.719999313354492,
      "text": " First John chapter number 2 verses 18 through 27. We'll be looking at this morning"
    },
    {
      "id": 4,
      "start": 16.719999313354492,
      "end": 19.760000228881836,
      "text": " I just want to read verse number 18 and we'll get into the message this morning"
    },
    {
      "id": 5,
      "start": 19.760000228881836,
      "end": 23.579999923706055,
      "text": " It says little children is the last time and as you have heard that"
    },
    {
      "id": 6,
      "start": 24.239999771118164,
      "end": 25.84000015258789,
      "text": " Antichrist shall come"
    },
    {
      "id": 7,
      "start": 25.84000015258789,
      "end": 27.84000015258789,
      "text": " Even now are there many?"
    },
    {
      "id": 8,
      "start": 28.239999771118164,
      "end": 34.68000030517578,
      "text": " Antichrist whereby we know that it is the last time we're living in the last days"
    },
    {
      "id": 9,
      "start": 34.68000030517578,
      "end": 39.880001068115234,
      "text": " we understand that Paul as he's writing to Timothy in 2nd Timothy, he speaks about some of the"
    },
    {
      "id": 10,
      "start": 40.400001525878906,
      "end": 43.560001373291016,
      "text": " the truth with regard to the last days and some of the"
    },
    {
      "id": 11,
      "start": 44.400001525878906,
      "end": 47.279998779296875,
      "text": " Ways in which we will be dealing with various things"
    },
    {
      "id": 12,
      "start": 47.279998779296875,
      "end": 53.7599983215332,
      "text": " He talks about the perilous times that shall come and we find that here as we look at this passage of Scripture"
    },
    {
      "id": 13,
      "start": 53.7599983215332,
      "end": 61.119998931884766,
      "text": " Really as John is ministering to these believers. He's giving them great truth. That is so precious for us this morning as well"
    },
    {
      "id": 14,
      "start": 61.15999984741211,
      "end": 66.95999908447266,
      "text": " It's been so impactful throughout the entirety of the church age if you'll remember in our previous study"
    },
    {
      "id": 15,
      "start": 66.95999908447266,
      "end": 67.91999816894531,
      "text": " It was two weeks ago"
    },
    {
      "id": 16,
      "start": 67.91999816894531,
      "end": 71.05999755859375,
      "text": " But in our previous study we looked at verses 15 through 17"
    },
    {
      "id": 17,
      "start": 71.27999877929688,
      "end": 74.83999633789062,
      "text": " Love not the world and as we looked at that passage of Scripture"
    },
    {
      "id": 18,
      "start": 74.83999633789062,
      "end": 79.69999694824219,
      "text": " We spoke about the fact that there was a warning that was given to the believers"
    },
    {
      "id": 19,
      "start": 79.9000015258789,
      "end": 86.58000183105469,
      "text": " With regard to the tactic of the enemy to corrupt the people of God and the Church of God"
    },
    {
      "id": 20,
      "start": 87.58000183105469,
      "end": 90.86000061035156,
      "text": " externally and we see the external threat the"
    },
    {
      "id": 21,
      "start": 91.5,
      "end": 98.13999938964844,
      "text": " warning was given about those three pitfalls the lust of the flesh the lust of the eyes and the pride of life and the way in"
    },
    {
      "id": 22,
      "start": 98.13999938964844,
      "end": 104.62000274658203,
      "text": " Which the enemy will use the external things in order to corrupt the people of God and to corrupt the Church of God"
    },
    {
      "id": 23,
      "start": 105.22000122070312,
      "end": 110.33999633789062,
      "text": " This morning as we move into this passage of Scripture in verses 18 through 27"
    },
    {
      "id": 24,
      "start": 110.66000366210938,
      "end": 111.18000030517578,
      "text": " Really?"
    },
    {
      "id": 25,
      "start": 111.18000030517578,
      "end": 118.22000122070312,
      "text": " Now we are given a warning with regard to the tactic of the enemy to corrupt the people of God and the Church of God"
    },
    {
      "id": 26,
      "start": 119.13999938964844,
      "end": 121.13999938964844,
      "text": " internally and we see that there's an"
    },
    {
      "id": 27,
      "start": 121.41999816894531,
      "end": 128.05999755859375,
      "text": " external factor the world the flesh the devil the lust of the eyes the lust of the flesh and the pride of life we see"
    },
    {
      "id": 28,
      "start": 128.05999755859375,
      "end": 133.86000061035156,
      "text": " That external threat and the warning that is given but we find that as we enter into this section in first"
    },
    {
      "id": 29,
      "start": 133.86000061035156,
      "end": 141.6199951171875,
      "text": " John that once again, there is a reference to the internal threat that of false teaching and we understand that the enemy"
    },
    {
      "id": 30,
      "start": 141.82000732421875,
      "end": 147.33999633789062,
      "text": " as Jude mentions that there have been some that have crept in unawares and"
    },
    {
      "id": 31,
      "start": 147.77999877929688,
      "end": 155.02000427246094,
      "text": " the importance of contending earnestly contending for the faith because of this internal"
    },
    {
      "id": 32,
      "start": 155.77999877929688,
      "end": 161.05999755859375,
      "text": " Threat to the people of God to the Church of God and the enemy using that internal"
    },
    {
      "id": 33,
      "start": 161.17999267578125,
      "end": 166.17999267578125,
      "text": " Tactic in order to corrupt the people of God now, we know that throughout the New Testament"
    },
    {
      "id": 34,
      "start": 166.17999267578125,
      "end": 170.97999572753906,
      "text": " in fact, we started as we began the study in the book of first John to speak about some of the"
    },
    {
      "id": 35,
      "start": 171.6199951171875,
      "end": 177.6999969482422,
      "text": " false teaching that was prevalent at the particular time and some of what they were dealing with and we know that all throughout the first"
    },
    {
      "id": 36,
      "start": 177.6999969482422,
      "end": 179.6999969482422,
      "text": " century and all throughout church history"
    },
    {
      "id": 37,
      "start": 180.3800048828125,
      "end": 187.5399932861328,
      "text": " And including today there has been false teaching we find the New Testament gives us many references and many"
    },
    {
      "id": 38,
      "start": 187.86000061035156,
      "end": 191.66000366210938,
      "text": " Truths with regard to the subject of false teaching and to the warnings"
    },
    {
      "id": 39,
      "start": 191.97999572753906,
      "end": 198.3000030517578,
      "text": " We find that Peter says it this way under the inspiration of the Holy Spirit of God that just as there were false"
    },
    {
      "id": 40,
      "start": 198.6199951171875,
      "end": 203.94000244140625,
      "text": " Prophets that there will be false teachers as you study the Word of God in the Old Testament"
    },
    {
      "id": 41,
      "start": 203.94000244140625,
      "end": 211.3000030517578,
      "text": " You'll find that on a number of occasion. There is record in reference to the false prophets that were so prevalent"
    },
    {
      "id": 42,
      "start": 212.02000427246094,
      "end": 215.74000549316406,
      "text": " During that day when God was using Jeremiah in particular"
    },
    {
      "id": 43,
      "start": 215.74000549316406,
      "end": 222.5800018310547,
      "text": " God was giving Jeremiah truth and God was giving Jeremiah warning with regard to the impending danger"
    },
    {
      "id": 44,
      "start": 222.94000244140625,
      "end": 227.4600067138672,
      "text": " The the Babylonian captivity and all that was taking place and yet there were false"
    },
    {
      "id": 45,
      "start": 227.66000366210938,
      "end": 232.02000427246094,
      "text": " Prophets that were coming on the stage and saying nope. This isn't true. This isn't true"
    },
    {
      "id": 46,
      "start": 232.02000427246094,
      "end": 234.4600067138672,
      "text": " This isn't gonna happen and so on and so forth"
    },
    {
      "id": 47,
      "start": 234.4600067138672,
      "end": 240.74000549316406,
      "text": " And if you read the book of Jeremiah and you understand what's taking place throughout that those portions of that book"
    },
    {
      "id": 48,
      "start": 240.86000061035156,
      "end": 246.3800048828125,
      "text": " you'll find that God is faithful to say I have given my word to Jeremiah and"
    },
    {
      "id": 49,
      "start": 246.6999969482422,
      "end": 250.3000030517578,
      "text": " These are liars. They're false prophets. They're not"
    },
    {
      "id": 50,
      "start": 250.82000732421875,
      "end": 257.17999267578125,
      "text": " prophesying my word they're coming and they're saying that they're speaking the word of the Lord, but in fact"
    },
    {
      "id": 51,
      "start": 257.17999267578125,
      "end": 261.260009765625,
      "text": " They are lying and we find here that these false teachers"
    },
    {
      "id": 52,
      "start": 261.7799987792969,
      "end": 266.5,
      "text": " Continue to exist today and there is a great danger of corruption"
    },
    {
      "id": 53,
      "start": 267.4599914550781,
      "end": 275.2200012207031,
      "text": " Internally notice as we study this portion of Scripture this morning if you're taking notes number one the exposure of false teaching"
    },
    {
      "id": 54,
      "start": 275.2200012207031,
      "end": 278.739990234375,
      "text": " I'm thankful that the Word of God exposes the false teachers for what they are"
    },
    {
      "id": 55,
      "start": 279.70001220703125,
      "end": 286.5,
      "text": " Amen, I'm thankful that God has provided us with this precious book and with the truth. He says thy word is truth"
    },
    {
      "id": 56,
      "start": 286.5,
      "end": 293.5400085449219,
      "text": " I'm thankful that Jesus himself is truth and he's given us truth and it exposes the false teaching"
    },
    {
      "id": 57,
      "start": 293.5400085449219,
      "end": 298.4800109863281,
      "text": " We notice here as we look at verses 18 and 19. I've read verse 18. Let me read verse 19"
    },
    {
      "id": 58,
      "start": 298.4800109863281,
      "end": 304.17999267578125,
      "text": " It says they went out from us speaking of these that are referred to in verse number 18 as Antichrist"
    },
    {
      "id": 59,
      "start": 304.6199951171875,
      "end": 308.8599853515625,
      "text": " They went out from us, but they were not of us for if they had been of us"
    },
    {
      "id": 60,
      "start": 308.9800109863281,
      "end": 314.7200012207031,
      "text": " They would no doubt have continued with us, but they went out that they might be made"
    },
    {
      "id": 61,
      "start": 315.239990234375,
      "end": 320.8999938964844,
      "text": " Manifest that they were not all of us as we consider the exposure of false teaching"
    },
    {
      "id": 62,
      "start": 320.8999938964844,
      "end": 327.3399963378906,
      "text": " I want you to see the description that is provided the description of these false teachers in verse number 18"
    },
    {
      "id": 63,
      "start": 327.3399963378906,
      "end": 332.3599853515625,
      "text": " The Bible refers to describes these false teachers as being Antichrist"
    },
    {
      "id": 64,
      "start": 332.82000732421875,
      "end": 336.760009765625,
      "text": " Notice the Bible says in verse number 18 as you have heard it says little children"
    },
    {
      "id": 65,
      "start": 336.760009765625,
      "end": 341.05999755859375,
      "text": " It is the last time and as you have heard that Antichrist shall come"
    },
    {
      "id": 66,
      "start": 341.4200134277344,
      "end": 344.0400085449219,
      "text": " We'll come back to that at the end of the message this morning"
    },
    {
      "id": 67,
      "start": 344.5400085449219,
      "end": 348.8999938964844,
      "text": " But notice the next phrase even now are there many?"
    },
    {
      "id": 68,
      "start": 349.5,
      "end": 351.3800048828125,
      "text": " Antichrists"
    },
    {
      "id": 69,
      "start": 351.3800048828125,
      "end": 356.8599853515625,
      "text": " Whereby we know that it is the last time we find that this word"
    },
    {
      "id": 70,
      "start": 357.6600036621094,
      "end": 360.3399963378906,
      "text": " Antichrist or Antichrist. It's the same Greek word"
    },
    {
      "id": 71,
      "start": 360.3800048828125,
      "end": 367.739990234375,
      "text": " We find that John uses it in his writings and we find that really the the best way to define this word is any"
    },
    {
      "id": 72,
      "start": 368.0199890136719,
      "end": 372.260009765625,
      "text": " person that is teaching something that is against Christ or"
    },
    {
      "id": 73,
      "start": 373.260009765625,
      "end": 378.9800109863281,
      "text": " Instead of Christ and we find that this spirit of the Antichrist and these many"
    },
    {
      "id": 74,
      "start": 379.4599914550781,
      "end": 384.9800109863281,
      "text": " Antichrists that are already prevalent. We're told in 2nd Thessalonians chapter number 3 and verse number 7"
    },
    {
      "id": 75,
      "start": 385.0199890136719,
      "end": 390.6199951171875,
      "text": " Excuse me chapter number 2 and verse number 7 that the mystery of iniquity doth already work"
    },
    {
      "id": 76,
      "start": 390.6199951171875,
      "end": 394.29998779296875,
      "text": " And we find that as we look at this portion of Scripture"
    },
    {
      "id": 77,
      "start": 394.29998779296875,
      "end": 399.739990234375,
      "text": " And we see how that these false teachers are described that they're described as being Antichrist"
    },
    {
      "id": 78,
      "start": 399.94000244140625,
      "end": 402.6600036621094,
      "text": " They are against the Lord Jesus Christ"
    },
    {
      "id": 79,
      "start": 403.1400146484375,
      "end": 408.70001220703125,
      "text": " The Bible tells us in 1st John chapter number 4 in verse number 3 in every spirit that confesseth"
    },
    {
      "id": 80,
      "start": 408.70001220703125,
      "end": 415.5,
      "text": " Not that Jesus Christ has come in the flesh is not of God and this is that spirit of Antichrist"
    },
    {
      "id": 81,
      "start": 416.0199890136719,
      "end": 419.6600036621094,
      "text": " Whereof ye have heard that it should come and even now"
    },
    {
      "id": 82,
      "start": 420.6199951171875,
      "end": 423.3800048828125,
      "text": " Already is it in the world?"
    },
    {
      "id": 83,
      "start": 423.8599853515625,
      "end": 427.70001220703125,
      "text": " We find that in verse number 1 of 1st John chapter number 4"
    },
    {
      "id": 84,
      "start": 427.70001220703125,
      "end": 431.739990234375,
      "text": " He refers to these as being not only Antichrist, but as false prophets"
    },
    {
      "id": 85,
      "start": 431.739990234375,
      "end": 434.29998779296875,
      "text": " Notice it says in 1st John 4 in verse number 1"
    },
    {
      "id": 86,
      "start": 434.29998779296875,
      "end": 441.94000244140625,
      "text": " It says this beloved believe not every spirit, but try the spirits whether they are of God because why because many"
    },
    {
      "id": 87,
      "start": 442.4599914550781,
      "end": 446.0199890136719,
      "text": " False prophets are gone out into the world"
    },
    {
      "id": 88,
      "start": 446.70001220703125,
      "end": 451.05999755859375,
      "text": " the plurality the the number of these false prophets of these"
    },
    {
      "id": 89,
      "start": 451.70001220703125,
      "end": 457.3800048828125,
      "text": " Antichrist these that are against the Lord Jesus Christ notice the description goes further in our text"
    },
    {
      "id": 90,
      "start": 457.3800048828125,
      "end": 459.5400085449219,
      "text": " It says in 1st John 2 in verse number 22"
    },
    {
      "id": 91,
      "start": 459.5400085449219,
      "end": 465.05999755859375,
      "text": " It says who is a liar, but he that denieth that Jesus is the Christ"
    },
    {
      "id": 92,
      "start": 465.05999755859375,
      "end": 471.1400146484375,
      "text": " He is Antichrist that denieth the father and the son he calls him a liar"
    },
    {
      "id": 93,
      "start": 472.260009765625,
      "end": 473.94000244140625,
      "text": " They're liars"
    },
    {
      "id": 94,
      "start": 473.94000244140625,
      "end": 477.8599853515625,
      "text": " The Bible tells us that the devil is a liar. He's the father of it"
    },
    {
      "id": 95,
      "start": 477.8599853515625,
      "end": 484.4200134277344,
      "text": " He's the father of it. Amen and John chapter number 8 and we find that Jesus is truth"
    },
    {
      "id": 96,
      "start": 484.5799865722656,
      "end": 485.8599853515625,
      "text": " but these"
    },
    {
      "id": 97,
      "start": 485.8599853515625,
      "end": 492.4200134277344,
      "text": " Antichrist these false teachers that are prevalent not only in the day in which John is writing all throughout church history and"
    },
    {
      "id": 98,
      "start": 493.05999755859375,
      "end": 498.17999267578125,
      "text": " especially today we see these many false teachers these false prophets these"
    },
    {
      "id": 99,
      "start": 498.8599853515625,
      "end": 502.3599853515625,
      "text": " Antichrists as they're described for us. And so we see the description"
    },
    {
      "id": 100,
      "start": 502.3599853515625,
      "end": 507.82000732421875,
      "text": " I want you to notice their doctrine the doctrine of these false teachers in verse 22 in verse 23"
    },
    {
      "id": 101,
      "start": 508.1000061035156,
      "end": 513.219970703125,
      "text": " We read verse 22. It says who is a liar, but he that denieth that Jesus is the Christ"
    },
    {
      "id": 102,
      "start": 513.4600219726562,
      "end": 517.8599853515625,
      "text": " He is Antichrist that denieth the father and the son notice verse 23"
    },
    {
      "id": 103,
      "start": 518.7000122070312,
      "end": 520.7000122070312,
      "text": " whosoever denieth the son"
    },
    {
      "id": 104,
      "start": 521.5399780273438,
      "end": 527.780029296875,
      "text": " The same hath not the father, but he that acknowledgeth the son hath the father also"
    },
    {
      "id": 105,
      "start": 528.4199829101562,
      "end": 530.4199829101562,
      "text": " in 1st John 2 in verse 22 and 23"
    },
    {
      "id": 106,
      "start": 530.9000244140625,
      "end": 535.3400268554688,
      "text": " God gives us some insight with regard to the doctrine of these false teachers"
    },
    {
      "id": 107,
      "start": 535.3400268554688,
      "end": 541.3800048828125,
      "text": " That are described as being liars and being antichrists. We find that there's something that's very consistent"
    },
    {
      "id": 108,
      "start": 541.97998046875,
      "end": 549.6599731445312,
      "text": " Amongst cults and amongst world religions and that is their false teaching surrounding the person of Jesus Christ"
    },
    {
      "id": 109,
      "start": 549.9400024414062,
      "end": 553.0599975585938,
      "text": " We find that this is so prevalent in our society today"
    },
    {
      "id": 110,
      "start": 553.1799926757812,
      "end": 557.1400146484375,
      "text": " you begin to look at the cults and the world religions and you find that they're"
    },
    {
      "id": 111,
      "start": 557.5399780273438,
      "end": 561.6599731445312,
      "text": " They they air with regard to the person of Jesus Christ"
    },
    {
      "id": 112,
      "start": 561.6599731445312,
      "end": 568.8599853515625,
      "text": " And let me say this if you're wrong on who Jesus is you're wrong. I mean and it is the the the the"
    },
    {
      "id": 113,
      "start": 569.6199951171875,
      "end": 575.260009765625,
      "text": " Cost of being wrong on that point is severe because we know that without the Lord Jesus Christ"
    },
    {
      "id": 114,
      "start": 575.5399780273438,
      "end": 580.219970703125,
      "text": " That there is no salvation. The Bible says that I am the way the truth and the life"
    },
    {
      "id": 115,
      "start": 580.219970703125,
      "end": 582.4199829101562,
      "text": " No, man cometh unto the father"
    },
    {
      "id": 116,
      "start": 582.4199829101562,
      "end": 587.5800170898438,
      "text": " But by me there is no other name given under given among men under heaven given among men"
    },
    {
      "id": 117,
      "start": 587.739990234375,
      "end": 595.6599731445312,
      "text": " Whereby we must be saved Peter is speaking in Acts 4 about the name of Jesus and we find here that here these"
    },
    {
      "id": 118,
      "start": 597.3800048828125,
      "end": 599.780029296875,
      "text": " Antichrists these false teachers these liars"
    },
    {
      "id": 0,
      "start": 599.780029296875,
      "end": 604.360029220581,
      "text": " What is it that they do? What is their doctrine? Notice it says that they"
    },
    {
      "id": 1,
      "start": 604.360029220581,
      "end": 612.1400289535522,
      "text": " denieth, in verse number 22, that Jesus is the Christ. They deny that He is God in"
    },
    {
      "id": 2,
      "start": 612.1400289535522,
      "end": 618.1600284576416,
      "text": " flesh. They deny the deity of Jesus Christ. They deny it. There are many today"
    },
    {
      "id": 3,
      "start": 618.1600284576416,
      "end": 622.8800296783447,
      "text": " that have tried to explain away the Trinity. They've tried to attack the"
    },
    {
      "id": 4,
      "start": 622.8800296783447,
      "end": 627.6400299072266,
      "text": " person of Jesus Christ. Why? Because perhaps they say, well, it doesn't make"
    },
    {
      "id": 5,
      "start": 627.6400299072266,
      "end": 631.840030670166,
      "text": " sense in my mind. His ways are not our ways. His thoughts are not our thoughts."
    },
    {
      "id": 6,
      "start": 631.840030670166,
      "end": 637.780029296875,
      "text": " He transcends us, and we cannot fully comprehend who He is. The reality is that"
    },
    {
      "id": 7,
      "start": 637.780029296875,
      "end": 641.8200302124023,
      "text": " the Bible tells us, even as I said this morning as we opened in prayer, that our"
    },
    {
      "id": 8,
      "start": 641.8200302124023,
      "end": 647.2000274658203,
      "text": " God is a great God. We sang, to God be the glory, great things He hath done. And our"
    },
    {
      "id": 9,
      "start": 647.2000274658203,
      "end": 650.9000282287598,
      "text": " God is great, and His greatness has been revealed to us. His greatness has been"
    },
    {
      "id": 10,
      "start": 650.9000282287598,
      "end": 655.3200302124023,
      "text": " declared to us. But as much as we know this morning that He is great, the"
    },
    {
      "id": 11,
      "start": 655.3200302124023,
      "end": 661.0400276184082,
      "text": " psalmist continues to say that His greatness is unsearchable. It's amazing."
    },
    {
      "id": 12,
      "start": 661.0400276184082,
      "end": 665.400032043457,
      "text": " When you think about how great our God is, and as much as I think I might"
    },
    {
      "id": 13,
      "start": 665.400032043457,
      "end": 670.3200302124023,
      "text": " understand, as much as you think you might understand, He's so much higher"
    },
    {
      "id": 14,
      "start": 670.3200302124023,
      "end": 678.6800308227539,
      "text": " than what we could possibly conceive in our minds. He is God. He is God in flesh."
    },
    {
      "id": 15,
      "start": 678.6800308227539,
      "end": 685.2000274658203,
      "text": " He has no beginning and no end. He is the Almighty. He is the Messiah. He is the"
    },
    {
      "id": 16,
      "start": 685.2000274658203,
      "end": 690.400032043457,
      "text": " Promised One. And we find that they deny that Jesus is the Christ, and look at"
    },
    {
      "id": 17,
      "start": 690.400032043457,
      "end": 694.3200302124023,
      "text": " the consequence of their false teaching. It says in verse number 23,"
    },
    {
      "id": 18,
      "start": 694.3200302124023,
      "end": 700.7200317382812,
      "text": " Whosoever denieth the Son, the same hath not the Father. There's no wiggle room."
    },
    {
      "id": 19,
      "start": 700.7200317382812,
      "end": 704.8400268554688,
      "text": " Amen? There's no wiggle room. There's an absolute truth that is"
    },
    {
      "id": 20,
      "start": 704.8400268554688,
      "end": 708.8800277709961,
      "text": " provided to us here in this passage of Scripture. Listen, you can't deny the"
    },
    {
      "id": 21,
      "start": 708.8800277709961,
      "end": 714.160026550293,
      "text": " person of Christ. You can't deny the truth of the deity of Christ and have"
    },
    {
      "id": 22,
      "start": 714.160026550293,
      "end": 718.9600296020508,
      "text": " the Father, because the only way you know the Father is through the Son. Amen?"
    },
    {
      "id": 23,
      "start": 718.9600296020508,
      "end": 724.0000305175781,
      "text": " Now remember, the writer, humanly speaking, of the book of 1 John is the"
    },
    {
      "id": 24,
      "start": 724.0000305175781,
      "end": 728.1600341796875,
      "text": " Apostle John. You think about the truth of the book of the Gospel of John and"
    },
    {
      "id": 25,
      "start": 728.1600341796875,
      "end": 733.7200317382812,
      "text": " how the Gospel of John shows over and over and proves the deity of Jesus"
    },
    {
      "id": 26,
      "start": 733.7200317382812,
      "end": 739.0000305175781,
      "text": " Christ. And John, remember, he's saying, I'm an eyewitness. Remember as we started"
    },
    {
      "id": 27,
      "start": 739.0000305175781,
      "end": 743.1600341796875,
      "text": " this book, we talked about how he says we've heard Him, we've seen Him, we've"
    },
    {
      "id": 28,
      "start": 743.1600341796875,
      "end": 748.9200286865234,
      "text": " handled Him. He's providing this truth, and he says, listen, there are many false"
    },
    {
      "id": 29,
      "start": 748.9200286865234,
      "end": 753.8800354003906,
      "text": " teachers. They are anti-Christ. They're against the Lord Jesus Christ. They deny"
    },
    {
      "id": 30,
      "start": 753.8800354003906,
      "end": 760.4800262451172,
      "text": " that He is God, and in their denial of Him being God, they do not have the"
    },
    {
      "id": 31,
      "start": 760.4800262451172,
      "end": 766.4000244140625,
      "text": " Father. 2 John 1, there's only one chapter, but 2 John and verse number 7,"
    },
    {
      "id": 32,
      "start": 766.4000244140625,
      "end": 770.8000335693359,
      "text": " the Bible says this. Notice just a few pages over in 2 John, verse number 7,"
    },
    {
      "id": 33,
      "start": 770.8000335693359,
      "end": 775.4800262451172,
      "text": " for many deceivers are entered into the world. Do you see how every one of these"
    },
    {
      "id": 34,
      "start": 775.4800262451172,
      "end": 779.8800354003906,
      "text": " references talks about the plurality of them and the number of them? There are"
    },
    {
      "id": 35,
      "start": 779.8800354003906,
      "end": 785.3600311279297,
      "text": " many, and it says this, who confess not that Jesus Christ has come in the flesh."
    },
    {
      "id": 36,
      "start": 785.3600311279297,
      "end": 793.280029296875,
      "text": " This is a deceiver and an anti-Christ. Jesus did come in the flesh. He was born"
    },
    {
      "id": 37,
      "start": 793.280029296875,
      "end": 797.6000366210938,
      "text": " of a virgin. He was born. Remember, you think about the truth of Philippians"
    },
    {
      "id": 38,
      "start": 797.6000366210938,
      "end": 801.280029296875,
      "text": " chapter number 2, where the Bible talks about, let this mind be in you, which was"
    },
    {
      "id": 39,
      "start": 801.280029296875,
      "end": 805.9800262451172,
      "text": " also in Christ Jesus, and you begin to read the truth of Philippians 2, and you"
    },
    {
      "id": 40,
      "start": 805.9800262451172,
      "end": 810.0800323486328,
      "text": " read about the incarnation, and you read about all that takes place, and what a"
    },
    {
      "id": 41,
      "start": 810.0800323486328,
      "end": 815.0400238037109,
      "text": " blessing to see the summary that is given. It continues and says, who being in"
    },
    {
      "id": 42,
      "start": 815.0400238037109,
      "end": 820.2000274658203,
      "text": " the form of God, thought it not robbery to be equal with God, but made himself of"
    },
    {
      "id": 43,
      "start": 820.2000274658203,
      "end": 826.0000305175781,
      "text": " no reputation, took upon the form of a servant, and was made in the likeness of"
    },
    {
      "id": 44,
      "start": 826.0000305175781,
      "end": 830.280029296875,
      "text": " men. The Bible tells us that being found in fashion as a man, he humbled himself"
    },
    {
      "id": 45,
      "start": 830.280029296875,
      "end": 836.7200317382812,
      "text": " and became obedient unto death, even the death of the cross. But you understand"
    },
    {
      "id": 46,
      "start": 836.7200317382812,
      "end": 843.3600311279297,
      "text": " that he rose, conquering sin, death, and the grave. Amen! He rose. He lives. He ever"
    },
    {
      "id": 47,
      "start": 843.3600311279297,
      "end": 847.9600219726562,
      "text": " liveth to make intercession for us. He's coming again, and here we find that the"
    },
    {
      "id": 48,
      "start": 847.9600219726562,
      "end": 852.8400268554688,
      "text": " Bible says, wherefore God also hath highly exalted him, and given him a name"
    },
    {
      "id": 49,
      "start": 852.8400268554688,
      "end": 858.4400329589844,
      "text": " which is above every name, that at the name of Jesus every knee should bow of"
    },
    {
      "id": 50,
      "start": 858.4400329589844,
      "end": 862.0400390625,
      "text": " things in heaven, and things in earth, and things under the earth, and that every"
    },
    {
      "id": 51,
      "start": 862.0400390625,
      "end": 868.8000183105469,
      "text": " tongue should confess that Jesus Christ is Lord, to the glory of God the Father."
    },
    {
      "id": 52,
      "start": 868.8000183105469,
      "end": 874.5600280761719,
      "text": " These false teachers, these antichrists that deny that Jesus is Lord, I'm sorry"
    },
    {
      "id": 53,
      "start": 874.5600280761719,
      "end": 879.2400207519531,
      "text": " this morning for them, but the reality is that one day they will acknowledge that"
    },
    {
      "id": 54,
      "start": 879.2400207519531,
      "end": 885.7200317382812,
      "text": " He is God. I hope they would acknowledge it before it's eternally too late. It's"
    },
    {
      "id": 55,
      "start": 885.7200317382812,
      "end": 892.2400207519531,
      "text": " not a matter of if, it's a matter of when. And when makes all the difference, because"
    },
    {
      "id": 56,
      "start": 892.2400207519531,
      "end": 898.280029296875,
      "text": " they will confess that Jesus Christ is Lord. We find that here in the book of 1 John we"
    },
    {
      "id": 57,
      "start": 898.280029296875,
      "end": 903.6000366210938,
      "text": " see the description of false teachers, because these false teachers are being exposed, and"
    },
    {
      "id": 58,
      "start": 903.6000366210938,
      "end": 907.4400329589844,
      "text": " the Word of God is exposing them for what they are, and they're described, and then"
    },
    {
      "id": 59,
      "start": 907.6000366210938,
      "end": 911.6800231933594,
      "text": " we see their doctrine, and I want you to see their desire. What's the desire of these"
    },
    {
      "id": 60,
      "start": 911.6800231933594,
      "end": 917.280029296875,
      "text": " false teachers? Well, in verse number 26 of 1 John chapter number 2, we find that this"
    },
    {
      "id": 61,
      "start": 917.280029296875,
      "end": 923.0400390625,
      "text": " desire that is given to us is revealed to us here. It says, these things have I written"
    },
    {
      "id": 62,
      "start": 923.0400390625,
      "end": 928.3600158691406,
      "text": " unto you, the believers, the little children that are addressed in verse number 18, concerning"
    },
    {
      "id": 63,
      "start": 928.3600158691406,
      "end": 936.5600280761719,
      "text": " them, that's the false teachers, that's the antichrist, that seduce you. Their desire"
    },
    {
      "id": 64,
      "start": 936.6800231933594,
      "end": 943.6800231933594,
      "text": " is to seduce you. That word means to cause to stray, to lead away, to lead aside from"
    },
    {
      "id": 65,
      "start": 944.52001953125,
      "end": 949.7600402832031,
      "text": " the right way. That's what they want to do, they want to seduce you. And let me say this,"
    },
    {
      "id": 66,
      "start": 949.7600402832031,
      "end": 954.3800354003906,
      "text": " just like they did in the book of Jeremiah, these false teachers, these false prophets,"
    },
    {
      "id": 67,
      "start": 954.3800354003906,
      "end": 960.1200256347656,
      "text": " they come with all of their fanfare, they come with all of their just various types"
    },
    {
      "id": 68,
      "start": 960.1200256347656,
      "end": 966.0400390625,
      "text": " of eloquence, and they come in, and sometimes they'll use various means, and man, they look"
    },
    {
      "id": 69,
      "start": 966.0400390625,
      "end": 971.6400146484375,
      "text": " like they got it all together and they sound good and so on and so forth, but they're lying."
    },
    {
      "id": 70,
      "start": 971.6400146484375,
      "end": 978.6400146484375,
      "text": " They're false teachers. Let me give you one example in Jeremiah chapter 28. The Bible"
    },
    {
      "id": 71,
      "start": 978.6800231933594,
      "end": 984.6400146484375,
      "text": " records for us here about Hananiah the prophet that died because God said he was going to"
    },
    {
      "id": 72,
      "start": 984.6400146484375,
      "end": 988.9200439453125,
      "text": " die because he was a false prophet and he was prophesying lies. But it's interesting"
    },
    {
      "id": 73,
      "start": 988.9200439453125,
      "end": 993.7000427246094,
      "text": " as you look through Jeremiah chapter 28, it's only 17 verses, I don't have the time to read"
    },
    {
      "id": 74,
      "start": 993.7000427246094,
      "end": 997.9400329589844,
      "text": " all of it, but I want you to know that as we go through this passage of Scripture that"
    },
    {
      "id": 75,
      "start": 997.9400329589844,
      "end": 1002.6600341796875,
      "text": " Hananiah, in verse number 10, let me read verse number 9, the prophet which prophesieth"
    },
    {
      "id": 76,
      "start": 1002.6600341796875,
      "end": 1008.4200439453125,
      "text": " of peace, when the word of the prophet shall come to pass, then shall the prophet be known"
    },
    {
      "id": 77,
      "start": 1008.4200439453125,
      "end": 1013.1000366210938,
      "text": " that the Lord hath truly sent him. That's the test. You can read that all the way back"
    },
    {
      "id": 78,
      "start": 1013.1000366210938,
      "end": 1018.0800170898438,
      "text": " in Deuteronomy, but then look in verse number 10, then Hananiah the prophet took the yoke"
    },
    {
      "id": 79,
      "start": 1018.1200256347656,
      "end": 1025.1200256347656,
      "text": " from off the prophet Jeremiah's neck and break it. Can you imagine the way in which the crowd"
    },
    {
      "id": 80,
      "start": 1025.4400329589844,
      "end": 1032.3200378417969,
      "text": " would respond to such antics? Jeremiah is prophesying that the Babylonians that besiege"
    },
    {
      "id": 81,
      "start": 1032.3200378417969,
      "end": 1035.8400268554688,
      "text": " us, that they're going to take us captive and that this city is going to be destroyed"
    },
    {
      "id": 82,
      "start": 1035.8400268554688,
      "end": 1040.9600219726562,
      "text": " and so on and so forth, and then this Hananiah comes and he takes these yokes and he breaks"
    },
    {
      "id": 83,
      "start": 1040.9600219726562,
      "end": 1047.4400329589844,
      "text": " them and he says in the presence of all the people, notice in verse number 11, thus saith"
    },
    {
      "id": 84,
      "start": 1047.4400329589844,
      "end": 1052.52001953125,
      "text": " the Lord, they proclaim, they pretend that they're speaking the word of God. It says,"
    },
    {
      "id": 85,
      "start": 1052.52001953125,
      "end": 1057.280029296875,
      "text": " even so will I break the yoke of Nebuchadnezzar, king of Babylon, from the neck of all nations"
    },
    {
      "id": 86,
      "start": 1057.280029296875,
      "end": 1062.7600402832031,
      "text": " within the space of two full years, and the prophet Jeremiah went his way. Then the word"
    },
    {
      "id": 87,
      "start": 1062.7600402832031,
      "end": 1066.1200256347656,
      "text": " of the Lord came unto Jeremiah, the prophet, after that Hananiah the prophet had broken"
    },
    {
      "id": 88,
      "start": 1066.1200256347656,
      "end": 1071.1600341796875,
      "text": " the yoke from off the neck of the prophet Jeremiah, saying, go and tell Hananiah, saying,"
    },
    {
      "id": 89,
      "start": 1071.1600341796875,
      "end": 1075.8800354003906,
      "text": " thus saith the Lord, thou hast broken the yokes of wood, but thou shalt make for them"
    },
    {
      "id": 90,
      "start": 1075.8800354003906,
      "end": 1081.4000244140625,
      "text": " yokes of iron. It's interesting, he said that it would be within the space of two"
    },
    {
      "id": 91,
      "start": 1081.4000244140625,
      "end": 1086.0400390625,
      "text": " full years, but if you read verse number 16, it says, therefore, thus saith the Lord, behold,"
    },
    {
      "id": 92,
      "start": 1086.0400390625,
      "end": 1090.6000366210938,
      "text": " I will cast thee from off the face of the earth. This year thou shalt die, because thou"
    },
    {
      "id": 93,
      "start": 1090.6000366210938,
      "end": 1096.1200256347656,
      "text": " hast taught rebellion against the Lord. So Hananiah the prophet died the same year in"
    },
    {
      "id": 94,
      "start": 1096.1200256347656,
      "end": 1101.9600219726562,
      "text": " the seventh month. God dealt with him. It was severe judgment. But I just think about"
    },
    {
      "id": 95,
      "start": 1102.0000305175781,
      "end": 1107.8000183105469,
      "text": " that passage of Scripture and the antics of Hananiah and the way in which he's breaking"
    },
    {
      "id": 96,
      "start": 1107.8000183105469,
      "end": 1113.3600463867188,
      "text": " that yoke. I mean, certainly the people would be excited about hearing something like that."
    },
    {
      "id": 97,
      "start": 1113.3600463867188,
      "end": 1117.2400512695312,
      "text": " He's saying that he's speaking the word of the Lord, but God says, no, I didn't give"
    },
    {
      "id": 98,
      "start": 1117.2400512695312,
      "end": 1124.2400512695312,
      "text": " him this message. We see that the desire of these antichrists, the desire of these false"
    },
    {
      "id": 99,
      "start": 1124.6800537109375,
      "end": 1129.8800048828125,
      "text": " teachers is to seduce, to deceive. Remember this truth in 2 Timothy 3, in verse number"
    },
    {
      "id": 100,
      "start": 1129.8800048828125,
      "end": 1136.8800048828125,
      "text": " 13, the Bible says, but evil men and seducers shall wax worse and worse, deceiving and being"
    },
    {
      "id": 101,
      "start": 1137.280029296875,
      "end": 1143.4400024414062,
      "text": " deceived. On Wednesday evenings, several, I don't know, last year in the fall, I preached"
    },
    {
      "id": 102,
      "start": 1143.4400024414062,
      "end": 1149.0800170898438,
      "text": " a series for a couple of months on the danger of deception. The way in which we read all"
    },
    {
      "id": 103,
      "start": 1149.0800170898438,
      "end": 1153.2400512695312,
      "text": " throughout the word of God, the warning has been given to us with regard to this age of"
    },
    {
      "id": 104,
      "start": 1153.2400512695312,
      "end": 1159.7200317382812,
      "text": " deception in which we're living. We find that these false teachers that are mentioned here,"
    },
    {
      "id": 105,
      "start": 1159.7200317382812,
      "end": 1164.4800415039062,
      "text": " the exposure of false teaching, he gives a description, he gives their doctrine and"
    },
    {
      "id": 106,
      "start": 1164.4800415039062,
      "end": 1169.52001953125,
      "text": " then he speaks of their desire. As we move forward this morning, I want you to think"
    },
    {
      "id": 107,
      "start": 1169.52001953125,
      "end": 1173.760009765625,
      "text": " not only of the exposure of false teaching, but I want you to consider number two, the"
    },
    {
      "id": 108,
      "start": 1173.760009765625,
      "end": 1178.9600219726562,
      "text": " enabling of the believer, the enabling of the believer. I'm thankful that there's a"
    },
    {
      "id": 109,
      "start": 1178.9600219726562,
      "end": 1184.6400146484375,
      "text": " great contrast in these verses of Scripture with regard to the behavior of the false teacher,"
    },
    {
      "id": 110,
      "start": 1184.6400146484375,
      "end": 1191.3200073242188,
      "text": " the behavior of the Antichrist, that spirit of Antichrist versus the behavior of the believer."
    },
    {
      "id": 111,
      "start": 1191.3200073242188,
      "end": 1196.56005859375,
      "text": " The reality is that in verse number 20, the Bible says, but we, excuse me, but ye have"
    },
    {
      "id": 112,
      "start": 1196.56005859375,
      "end": 1199.8400268554688,
      "text": " an unction from the Holy One, and ye know it."
    },
    {
      "id": 0,
      "start": 1199.8400268554688,
      "end": 1205.4800267219543,
      "text": " all things.\" Notice, in verse number 27, it says,"
    },
    {
      "id": 1,
      "start": 1205.4800267219543,
      "end": 1211.0000267028809,
      "text": " \"...but the anointing which ye have received of him abideth in you. And ye"
    },
    {
      "id": 2,
      "start": 1211.0000267028809,
      "end": 1215.880027770996,
      "text": " need not that any man teach you, but as the same anointing teacheth you of all"
    },
    {
      "id": 3,
      "start": 1215.880027770996,
      "end": 1221.880027770996,
      "text": " things, and is truth, and is no lie. And even as it hath taught you, ye shall"
    },
    {
      "id": 4,
      "start": 1221.880027770996,
      "end": 1228.080026626587,
      "text": " abide in him.\" We have an unction from the Holy One. The anointing which we have"
    },
    {
      "id": 5,
      "start": 1228.080026626587,
      "end": 1233.4000282287598,
      "text": " received, according to verse number 27, \"...of him abideth in you.\" And we find that"
    },
    {
      "id": 6,
      "start": 1233.4000282287598,
      "end": 1237.760025024414,
      "text": " this is none other than the anointing of the Holy Spirit of God. I'm so thankful"
    },
    {
      "id": 7,
      "start": 1237.760025024414,
      "end": 1242.9600257873535,
      "text": " for the Holy Spirit. I'm thankful that the Bible teaches us that at the moment"
    },
    {
      "id": 8,
      "start": 1242.9600257873535,
      "end": 1247.720027923584,
      "text": " of salvation that we are sealed with that Holy Spirit of promise, which is the"
    },
    {
      "id": 9,
      "start": 1247.720027923584,
      "end": 1252.260025024414,
      "text": " earnest of our inheritance. The Bible teaches us that in Ephesians 1 and"
    },
    {
      "id": 10,
      "start": 1252.260025024414,
      "end": 1257.0800285339355,
      "text": " verses 13 and 14. And what a joy to know that my body is the temple of the Holy"
    },
    {
      "id": 11,
      "start": 1257.2000274658203,
      "end": 1261.720027923584,
      "text": " Spirit of God, and if you've been saved, if you've been born again, the Holy Spirit"
    },
    {
      "id": 12,
      "start": 1261.720027923584,
      "end": 1268.5200271606445,
      "text": " of God indwells you. We have this unction. We have this anointing, and he's"
    },
    {
      "id": 13,
      "start": 1268.5200271606445,
      "end": 1272.5600280761719,
      "text": " speaking of that. We understand that later in the book of Ephesians that the"
    },
    {
      "id": 14,
      "start": 1272.5600280761719,
      "end": 1278.4000244140625,
      "text": " believers in Ephesus would be encouraged to be filled with the Spirit of God. You"
    },
    {
      "id": 15,
      "start": 1278.4000244140625,
      "end": 1282.8200302124023,
      "text": " receive the Spirit of God at the moment of salvation. You've been indwelled by"
    },
    {
      "id": 16,
      "start": 1282.8200302124023,
      "end": 1286.6400299072266,
      "text": " the Spirit of God, but you must be filled with the Holy Spirit of God. What's the"
    },
    {
      "id": 17,
      "start": 1286.6400299072266,
      "end": 1290.2000274658203,
      "text": " difference? What is it that we're speaking of? Well, very simply this, it's"
    },
    {
      "id": 18,
      "start": 1290.2000274658203,
      "end": 1295.0800247192383,
      "text": " not how much of the Holy Spirit I have, because at the moment of salvation, I got"
    },
    {
      "id": 19,
      "start": 1295.0800247192383,
      "end": 1302.6000289916992,
      "text": " all of the Holy Spirit I'm ever gonna get, and so did you. What's in view here"
    },
    {
      "id": 20,
      "start": 1302.6000289916992,
      "end": 1309.4000244140625,
      "text": " is how much of me the Holy Spirit has. How much have I yielded to the Holy"
    },
    {
      "id": 21,
      "start": 1309.4000244140625,
      "end": 1313.6400299072266,
      "text": " Spirit of God? How much have I been filled with the Holy Spirit? What"
    },
    {
      "id": 22,
      "start": 1313.6800231933594,
      "end": 1319.8000259399414,
      "text": " prevents me from being filled with the Holy Spirit of God itself? We find that"
    },
    {
      "id": 23,
      "start": 1319.8000259399414,
      "end": 1324.040023803711,
      "text": " we've been given this responsibility, and we think about the enabling of the"
    },
    {
      "id": 24,
      "start": 1324.040023803711,
      "end": 1328.760025024414,
      "text": " believer. I want you to think about this passage and what this enabling allows"
    },
    {
      "id": 25,
      "start": 1328.760025024414,
      "end": 1336.760025024414,
      "text": " us to do. It enables us to perceive. To perceive. Notice with me in verse 21, again,"
    },
    {
      "id": 26,
      "start": 1336.760025024414,
      "end": 1343.1600341796875,
      "text": " we'd say this, to perceive or to discern, and discernment is critical. Discernment"
    },
    {
      "id": 27,
      "start": 1343.1600341796875,
      "end": 1348.3200225830078,
      "text": " is critical. Why? Because they'll wax eloquent. They'll use words that seem to"
    },
    {
      "id": 28,
      "start": 1348.3200225830078,
      "end": 1353.1600341796875,
      "text": " be close to what you're familiar with. They'll say things that seem to, man, they"
    },
    {
      "id": 29,
      "start": 1353.1600341796875,
      "end": 1357.6800231933594,
      "text": " got it all together. They've presented this so just in order, and it just seems"
    },
    {
      "id": 30,
      "start": 1357.6800231933594,
      "end": 1363.9600219726562,
      "text": " so just right like it should be, right in line. They'll wax eloquent, but we need"
    },
    {
      "id": 31,
      "start": 1363.9600219726562,
      "end": 1369.3600311279297,
      "text": " perception. We need to be able to perceive. We need to be able to discern."
    },
    {
      "id": 32,
      "start": 1369.4400329589844,
      "end": 1373.6800231933594,
      "text": " Notice in 1 John 2, it says that we have an unction from the Holy One in"
    },
    {
      "id": 33,
      "start": 1373.6800231933594,
      "end": 1379.3600311279297,
      "text": " verse number 20, and ye know all things. Continue in verse number 21. Notice what"
    },
    {
      "id": 34,
      "start": 1379.3600311279297,
      "end": 1384.0000305175781,
      "text": " it says here. It says this, I have not written unto you because you know not"
    },
    {
      "id": 35,
      "start": 1384.0000305175781,
      "end": 1393.4800262451172,
      "text": " the truth, but because you know it, and that no lie is of the truth. You see how"
    },
    {
      "id": 36,
      "start": 1393.4800262451172,
      "end": 1397.300033569336,
      "text": " John is encouraging these believers. It's interesting because Peter says this, I'm"
    },
    {
      "id": 37,
      "start": 1397.300033569336,
      "end": 1400.300033569336,
      "text": " gonna remind you of some things. I'm gonna stir you up by putting you in"
    },
    {
      "id": 38,
      "start": 1400.300033569336,
      "end": 1404.0600280761719,
      "text": " remembrance of things. Though you know them, he says I'm gonna remind you of"
    },
    {
      "id": 39,
      "start": 1404.0600280761719,
      "end": 1407.6600341796875,
      "text": " them, and John says I'm not writing to you because you don't know the truth, but"
    },
    {
      "id": 40,
      "start": 1407.6600341796875,
      "end": 1411.9800262451172,
      "text": " in fact you know it. You have the truth, and I'm trying to help you to"
    },
    {
      "id": 41,
      "start": 1411.9800262451172,
      "end": 1417.260025024414,
      "text": " understand that no lie is of the truth, and so as this enabling that we have, it"
    },
    {
      "id": 42,
      "start": 1417.260025024414,
      "end": 1422.9400329589844,
      "text": " enables us to perceive the anointing of the Holy Spirit of God, helps us to"
    },
    {
      "id": 43,
      "start": 1422.9400329589844,
      "end": 1427.3400268554688,
      "text": " be able to perceive and to discern between right and wrong, between right"
    },
    {
      "id": 44,
      "start": 1427.3400268554688,
      "end": 1433.260025024414,
      "text": " teaching and wrong teaching, between truth and error. We find that as we look"
    },
    {
      "id": 45,
      "start": 1433.260025024414,
      "end": 1437.540023803711,
      "text": " at this passage of Scripture, and he speaks about that, that we know the truth,"
    },
    {
      "id": 46,
      "start": 1437.540023803711,
      "end": 1442.6600341796875,
      "text": " that we have the truth. Again in verse number 27, he tells us that he teaches us"
    },
    {
      "id": 47,
      "start": 1442.6600341796875,
      "end": 1447.7000274658203,
      "text": " the truth. I am so thankful this morning that the Holy Spirit of God is the"
    },
    {
      "id": 48,
      "start": 1447.7000274658203,
      "end": 1452.3400268554688,
      "text": " divine teacher. I'm thankful this morning that the Holy Spirit of God, according to"
    },
    {
      "id": 49,
      "start": 1452.3400268554688,
      "end": 1458.780029296875,
      "text": " what John writes to us, and you read in chapters 15 and 16 as the Lord Jesus"
    },
    {
      "id": 50,
      "start": 1458.780029296875,
      "end": 1465.1800231933594,
      "text": " Christ is giving this truth to the disciples with regard to the coming of"
    },
    {
      "id": 51,
      "start": 1465.1800231933594,
      "end": 1470.780029296875,
      "text": " the Holy Spirit of God, he says it's expedient for you that I go away. He is"
    },
    {
      "id": 52,
      "start": 1470.780029296875,
      "end": 1476.8200378417969,
      "text": " the the Holy Spirit of comfort, but he's also our divine teacher, and it tells us"
    },
    {
      "id": 53,
      "start": 1476.8200378417969,
      "end": 1482.5800170898438,
      "text": " in verse number 27 that you need not that any man teach you, but as the same"
    },
    {
      "id": 54,
      "start": 1482.5800170898438,
      "end": 1490.4600219726562,
      "text": " anointing teacheth you of all things, notice this, and is truth and is no lie,"
    },
    {
      "id": 55,
      "start": 1490.4600219726562,
      "end": 1499.3400268554688,
      "text": " and even as it hath taught you, ye shall abide in him. I'm thankful for the"
    },
    {
      "id": 56,
      "start": 1499.3400268554688,
      "end": 1503.4600219726562,
      "text": " enabling of the Holy Spirit of God, the enabling of the believer, and that he"
    },
    {
      "id": 57,
      "start": 1503.4600219726562,
      "end": 1509.9400329589844,
      "text": " enables us to perceive. You hear something, and maybe you don't know the"
    },
    {
      "id": 58,
      "start": 1509.9400329589844,
      "end": 1514.4600219726562,
      "text": " exact answer. Maybe you're not equipped to have that perfect answer immediately,"
    },
    {
      "id": 59,
      "start": 1514.4600219726562,
      "end": 1519.5400390625,
      "text": " but the Holy Spirit of God just gives you that uneasy feeling with regard to"
    },
    {
      "id": 60,
      "start": 1519.5400390625,
      "end": 1525.02001953125,
      "text": " something just doesn't seem right with that. You begin to dig in, and you begin"
    },
    {
      "id": 61,
      "start": 1525.02001953125,
      "end": 1530.5000305175781,
      "text": " to ask the divine teacher to reveal to you from this precious book the"
    },
    {
      "id": 62,
      "start": 1530.5000305175781,
      "end": 1536.4200134277344,
      "text": " truth of God's Word, what it is that is truth on that particular subject. Listen,"
    },
    {
      "id": 63,
      "start": 1536.4200134277344,
      "end": 1540.780029296875,
      "text": " we're not to be tossed to and fro with all of these teachings, and we're to be"
    },
    {
      "id": 64,
      "start": 1540.780029296875,
      "end": 1545.0600280761719,
      "text": " settled and established, and we're to know the truth, and I'm thankful that the"
    },
    {
      "id": 65,
      "start": 1545.0600280761719,
      "end": 1550.6200256347656,
      "text": " Holy Spirit of God enables us to perceive. Discernment is critical when"
    },
    {
      "id": 66,
      "start": 1550.6200256347656,
      "end": 1556.8600158691406,
      "text": " you think about false teaching. They wax eloquent. Notice not only the enabling"
    },
    {
      "id": 67,
      "start": 1556.8600158691406,
      "end": 1560.5400390625,
      "text": " that he enables us to perceive, but I want you to understand he enables us to"
    },
    {
      "id": 68,
      "start": 1560.5400390625,
      "end": 1566.6600341796875,
      "text": " proceed, to continue. Notice in verse number 24, he says this,"
    },
    {
      "id": 69,
      "start": 1566.6600341796875,
      "end": 1571.0600280761719,
      "text": " let that therefore abide in you. He uses that phrase at the end of verse number"
    },
    {
      "id": 70,
      "start": 1571.0600280761719,
      "end": 1575.5000305175781,
      "text": " 27 as well, ye shall abide in him, and that phrase abide. Of course, John would"
    },
    {
      "id": 71,
      "start": 1575.5000305175781,
      "end": 1579.8200378417969,
      "text": " be very familiar with that phrase as he was taught about the importance of"
    },
    {
      "id": 72,
      "start": 1579.8200378417969,
      "end": 1585.0600280761719,
      "text": " abiding in Christ. He says, let that therefore abide in you. What is it that"
    },
    {
      "id": 73,
      "start": 1585.0600280761719,
      "end": 1589.2200317382812,
      "text": " he is referring to? What you have heard from the beginning. What you have heard"
    },
    {
      "id": 74,
      "start": 1589.2200317382812,
      "end": 1594.4200134277344,
      "text": " from the beginning. There's nothing new under the sun, right? God's given us all"
    },
    {
      "id": 75,
      "start": 1594.4200134277344,
      "end": 1598.5000305175781,
      "text": " things that pertain unto life and godliness, and we find that John's saying,"
    },
    {
      "id": 76,
      "start": 1598.5000305175781,
      "end": 1602.7400207519531,
      "text": " listen, just as Paul said when he's writing to those churches in the region"
    },
    {
      "id": 77,
      "start": 1602.7400207519531,
      "end": 1607.3000183105469,
      "text": " of Galatia, he's saying, listen, there's no new gospel. There's no other gospel."
    },
    {
      "id": 78,
      "start": 1607.3000183105469,
      "end": 1612.2200317382812,
      "text": " These people have come in and they've given you a false gospel, and John says,"
    },
    {
      "id": 79,
      "start": 1612.2200317382812,
      "end": 1616.5800170898438,
      "text": " listen, let that therefore abide in you which you have heard from the"
    },
    {
      "id": 80,
      "start": 1616.5800170898438,
      "end": 1620.5800170898438,
      "text": " beginning. Notice, if that which you have heard from the beginning shall remain in"
    },
    {
      "id": 81,
      "start": 1620.5800170898438,
      "end": 1627.4200134277344,
      "text": " you, notice, ye shall, ye also shall continue in the Son and in the Father."
    },
    {
      "id": 82,
      "start": 1627.4200134277344,
      "end": 1634.1800231933594,
      "text": " I'm thankful that the Holy Spirit of God, the anointing, that unction that enables"
    },
    {
      "id": 83,
      "start": 1634.1800231933594,
      "end": 1640.2600402832031,
      "text": " us to proceed, to continue. Yes, we understand that we're living in the"
    },
    {
      "id": 84,
      "start": 1640.2600402832031,
      "end": 1645.1000366210938,
      "text": " midst of apostasy. We're living in the last days. We're living with so many"
    },
    {
      "id": 85,
      "start": 1645.1000366210938,
      "end": 1649.8200378417969,
      "text": " false teachers, but the enabling, the unction, the anointing of the Holy"
    },
    {
      "id": 86,
      "start": 1649.8200378417969,
      "end": 1656.4200134277344,
      "text": " Spirit of God enables us to proceed, to continue going forward. We don't have to"
    },
    {
      "id": 87,
      "start": 1656.4200134277344,
      "end": 1661.4200134277344,
      "text": " become a casualty by this internal attack. Remember, as we said by way of"
    },
    {
      "id": 88,
      "start": 1661.4200134277344,
      "end": 1665.3000183105469,
      "text": " introduction, that as you notice in the previous text of Scripture that we"
    },
    {
      "id": 89,
      "start": 1665.3000183105469,
      "end": 1669.9800415039062,
      "text": " looked at two weeks ago, that there's the warning that is given with regard to"
    },
    {
      "id": 90,
      "start": 1669.9800415039062,
      "end": 1675.0600280761719,
      "text": " that attack, that corruption externally. The world, the lust of the flesh, the lust"
    },
    {
      "id": 91,
      "start": 1675.0600280761719,
      "end": 1679.5000305175781,
      "text": " of the eyes, the pride of life. And you say, listen, love not the world. There's"
    },
    {
      "id": 92,
      "start": 1679.5000305175781,
      "end": 1684.5000305175781,
      "text": " the potential of becoming corrupt because of the world, the external threat."
    },
    {
      "id": 93,
      "start": 1684.5000305175781,
      "end": 1690.2200317382812,
      "text": " And how sad it is that so many churches today have become so worldly that it's"
    },
    {
      "id": 94,
      "start": 1690.2200317382812,
      "end": 1695.4600219726562,
      "text": " almost impossible to distinguish them between being a church and being a club."
    },
    {
      "id": 95,
      "start": 1695.4600219726562,
      "end": 1701.9000244140625,
      "text": " And that's sad. I know it's not popular, but it is certainly prevalent in our"
    },
    {
      "id": 96,
      "start": 1701.9000244140625,
      "end": 1709.5000305175781,
      "text": " society today. Come out from among them and be ye separate, saith the Lord. There"
    },
    {
      "id": 97,
      "start": 1709.5000305175781,
      "end": 1714.9400024414062,
      "text": " is a distinction and a difference amongst the people of God. Amen? By the"
    },
    {
      "id": 98,
      "start": 1714.9400024414062,
      "end": 1718.6200561523438,
      "text": " grace of God and with the help of God, we're never gonna have a nightclub"
    },
    {
      "id": 99,
      "start": 1718.6600341796875,
      "end": 1725.8200073242188,
      "text": " atmosphere in this place. Amen? Seriously. Don't get me on that rabbit trail. Let me"
    },
    {
      "id": 100,
      "start": 1725.8200073242188,
      "end": 1733.5400390625,
      "text": " get back. Amen? I'm serious though. There should be a distinction, the external"
    },
    {
      "id": 101,
      "start": 1733.5400390625,
      "end": 1740.4200439453125,
      "text": " threat. But you know there's an internal threat and it's false teaching. And they"
    },
    {
      "id": 102,
      "start": 1740.4200439453125,
      "end": 1748.9000244140625,
      "text": " creep in unawares. They begin to preach heresy. They deny the Lord Jesus Christ."
    },
    {
      "id": 103,
      "start": 1748.9000244140625,
      "end": 1753.0599975585938,
      "text": " Though I've said this, we need to be careful of false teachers because they"
    },
    {
      "id": 104,
      "start": 1753.0599975585938,
      "end": 1757.6200561523438,
      "text": " use our vocabulary but not our dictionary. They'll use words that you're"
    },
    {
      "id": 105,
      "start": 1757.6200561523438,
      "end": 1762.3400268554688,
      "text": " familiar with but they mean something entirely different by those words. And we"
    },
    {
      "id": 106,
      "start": 1762.3400268554688,
      "end": 1766.5800170898438,
      "text": " have to be careful to have that discernment to say, listen, we need to be"
    },
    {
      "id": 107,
      "start": 1766.5800170898438,
      "end": 1771.1800537109375,
      "text": " able to understand what is being said and what is being given. And what do you"
    },
    {
      "id": 108,
      "start": 1771.1800537109375,
      "end": 1779.0599975585938,
      "text": " mean by that? What is your definition of that? The Holy Spirit of God enables us"
    },
    {
      "id": 109,
      "start": 1779.0599975585938,
      "end": 1782.780029296875,
      "text": " to continue. It's interesting, we won't take time this morning, but if you go"
    },
    {
      "id": 110,
      "start": 1782.780029296875,
      "end": 1787.2200317382812,
      "text": " back to 2 Timothy chapter number 3 and you read about those perilous times and"
    },
    {
      "id": 111,
      "start": 1787.2200317382812,
      "end": 1791.7400512695312,
      "text": " how Paul describes all that will take place and he says, as we mentioned in"
    },
    {
      "id": 112,
      "start": 1791.7400512695312,
      "end": 1795.9800415039062,
      "text": " verse number 13 of chapter number 3, that evil men and seducers shall wax worse"
    },
    {
      "id": 113,
      "start": 1795.9800415039062,
      "end": 1801.4600219726562,
      "text": " and worse, deceiving and being deceived. You know what verse number 14 says?"
    },
    {
      "id": 0,
      "start": 1801.4600219726562,
      "end": 1804.2200219631195,
      "text": " but continue.\""
    },
    {
      "id": 1,
      "start": 1804.2200219631195,
      "end": 1809.3800220489502,
      "text": " Yeah, there are going to be false teachers, there's going to be all of this nonsense that's"
    },
    {
      "id": 2,
      "start": 1809.3800220489502,
      "end": 1811.3800220489502,
      "text": " going on, but we're to continue."
    },
    {
      "id": 3,
      "start": 1811.3800220489502,
      "end": 1813.020022392273,
      "text": " How can I continue?"
    },
    {
      "id": 4,
      "start": 1813.020022392273,
      "end": 1814.760022163391,
      "text": " First John chapter number 2."
    },
    {
      "id": 5,
      "start": 1814.760022163391,
      "end": 1820.420021057129,
      "text": " It's the enabling, the anointing, that truth abiding in us and that if it remains in us"
    },
    {
      "id": 6,
      "start": 1820.420021057129,
      "end": 1824.5400218963623,
      "text": " that ye shall continue in the Son and in the Father."
    },
    {
      "id": 7,
      "start": 1824.5400218963623,
      "end": 1827.920021057129,
      "text": " The Word of God is precious and it's so connected."
    },
    {
      "id": 8,
      "start": 1827.920021057129,
      "end": 1831.9600219726562,
      "text": " One passage to another and you interpret Scripture by Scripture and you begin to see,"
    },
    {
      "id": 9,
      "start": 1831.9600219726562,
      "end": 1835.8800201416016,
      "text": " listen, I can't continue in my own power and neither can you."
    },
    {
      "id": 10,
      "start": 1835.8800201416016,
      "end": 1841.3600234985352,
      "text": " With all of the apostasy and all of the trouble that's going on in the perilous times, I'm"
    },
    {
      "id": 11,
      "start": 1841.3600234985352,
      "end": 1845.920021057129,
      "text": " not able to continue in my own power and neither are you."
    },
    {
      "id": 12,
      "start": 1845.920021057129,
      "end": 1851.3200225830078,
      "text": " But we have that enabling, the anointing, the unction."
    },
    {
      "id": 13,
      "start": 1851.3200225830078,
      "end": 1853.6000213623047,
      "text": " What a blessing."
    },
    {
      "id": 14,
      "start": 1853.6000213623047,
      "end": 1859.6000213623047,
      "text": " Now let me, as we look at this passage of Scripture and we identify the exposure of"
    },
    {
      "id": 15,
      "start": 1859.6000213623047,
      "end": 1862.8400230407715,
      "text": " false teaching and the enabling of the believer, let me circle back."
    },
    {
      "id": 16,
      "start": 1862.8400230407715,
      "end": 1866.0000228881836,
      "text": " I said that we'd go back to this in verse number 18 and I'm going to spend the remainder"
    },
    {
      "id": 17,
      "start": 1866.0000228881836,
      "end": 1870.2000198364258,
      "text": " of the time this morning with regard to this thought."
    },
    {
      "id": 18,
      "start": 1870.2000198364258,
      "end": 1875.2800216674805,
      "text": " As you look back at verse number 18, John started in verse number 18 by making this"
    },
    {
      "id": 19,
      "start": 1875.2800216674805,
      "end": 1880.0000228881836,
      "text": " statement, little children, it is the last time."
    },
    {
      "id": 20,
      "start": 1880.0000228881836,
      "end": 1886.1200256347656,
      "text": " And as ye have heard, that Antichrist shall come."
    },
    {
      "id": 21,
      "start": 1886.1200256347656,
      "end": 1892.040023803711,
      "text": " Even now are there many Antichrists whereby we know that it is the last time."
    },
    {
      "id": 22,
      "start": 1892.040023803711,
      "end": 1897.4000244140625,
      "text": " See, the reality is that as he refers to these false teachers as being Antichrists, he also"
    },
    {
      "id": 23,
      "start": 1897.4000244140625,
      "end": 1902.2800216674805,
      "text": " makes mention that they have heard that Antichrist shall come."
    },
    {
      "id": 24,
      "start": 1902.2800216674805,
      "end": 1905.0800247192383,
      "text": " And he is going to come."
    },
    {
      "id": 25,
      "start": 1905.0800247192383,
      "end": 1907.260025024414,
      "text": " The Antichrist will be revealed."
    },
    {
      "id": 26,
      "start": 1907.260025024414,
      "end": 1909.7200241088867,
      "text": " We don't know exactly a date."
    },
    {
      "id": 27,
      "start": 1910.4400253295898,
      "end": 1914.4800186157227,
      "text": " I do not intend in any way, shape, or form this morning, as we look at a few things,"
    },
    {
      "id": 28,
      "start": 1914.4800186157227,
      "end": 1919.6200256347656,
      "text": " to try to put any type of date on this because it would be inappropriate for me to do so,"
    },
    {
      "id": 29,
      "start": 1919.6200256347656,
      "end": 1925.1600189208984,
      "text": " but the reality is that we can understand biblically and scripturally when it is that"
    },
    {
      "id": 30,
      "start": 1925.1600189208984,
      "end": 1927.760025024414,
      "text": " the Antichrist shall rise."
    },
    {
      "id": 31,
      "start": 1927.760025024414,
      "end": 1932.9600219726562,
      "text": " It's very likely that the Antichrist is in our society today."
    },
    {
      "id": 32,
      "start": 1932.9600219726562,
      "end": 1937.6400146484375,
      "text": " We'd have no idea who they might be, but when they rise, I would say this, it would be after"
    },
    {
      "id": 33,
      "start": 1937.6400146484375,
      "end": 1940.2000274658203,
      "text": " the rapture of the church."
    },
    {
      "id": 34,
      "start": 1940.2000274658203,
      "end": 1944.4000244140625,
      "text": " The rapture of the church is imminent, by the way, and really, if we had a couple of"
    },
    {
      "id": 35,
      "start": 1944.4000244140625,
      "end": 1947.6800231933594,
      "text": " hours this morning, we'd just go all the way through the third verse of chapter number"
    },
    {
      "id": 36,
      "start": 1947.6800231933594,
      "end": 1952.5600280761719,
      "text": " three because they're so connected with verse 18 of chapter number two of 1 John, all the"
    },
    {
      "id": 37,
      "start": 1952.5600280761719,
      "end": 1955.6800231933594,
      "text": " way through verse three of chapter number three."
    },
    {
      "id": 38,
      "start": 1955.6800231933594,
      "end": 1959.6800231933594,
      "text": " We'll break it up into two messages, and I'll deal with that subject next week, of when"
    },
    {
      "id": 39,
      "start": 1959.6800231933594,
      "end": 1962.540023803711,
      "text": " he shall appear, but Jesus is coming."
    },
    {
      "id": 40,
      "start": 1962.540023803711,
      "end": 1964.6000213623047,
      "text": " His return is imminent."
    },
    {
      "id": 41,
      "start": 1964.6000213623047,
      "end": 1970.1200256347656,
      "text": " And the reality is that the Bible would teach us that after the rapture of the church, again,"
    },
    {
      "id": 42,
      "start": 1970.1200256347656,
      "end": 1973.4000244140625,
      "text": " which is imminent, that the Antichrist shall rise."
    },
    {
      "id": 43,
      "start": 1973.4000244140625,
      "end": 1978.1200256347656,
      "text": " According to Daniel chapter number nine in verse number 27, he, the Antichrist, is going"
    },
    {
      "id": 44,
      "start": 1978.1200256347656,
      "end": 1984.000015258789,
      "text": " to sign a peace treaty with Israel at the start of the tribulation."
    },
    {
      "id": 45,
      "start": 1984.000015258789,
      "end": 1986.4000244140625,
      "text": " That is going to happen."
    },
    {
      "id": 46,
      "start": 1986.4000244140625,
      "end": 1990.4400177001953,
      "text": " And we find, according to Daniel nine in verse number 27, that it's at the start of that"
    },
    {
      "id": 47,
      "start": 1990.4400177001953,
      "end": 1996.2000274658203,
      "text": " seven period, that period of tribulation, the week of tribulation that is referred to,"
    },
    {
      "id": 48,
      "start": 1996.2000274658203,
      "end": 2003.8800201416016,
      "text": " and we find that at the midpoint, at the three-and-a-half-year point, he is going to break that treaty, right?"
    },
    {
      "id": 49,
      "start": 2003.8800201416016,
      "end": 2008.2000274658203,
      "text": " In 2 Thessalonians chapter number two, I mentioned already, verse number seven, where the Bible"
    },
    {
      "id": 50,
      "start": 2008.2000274658203,
      "end": 2014.040023803711,
      "text": " says that the mystery of iniquity doth already work, but notice in 2 Timothy two, in verse"
    },
    {
      "id": 51,
      "start": 2014.040023803711,
      "end": 2019.760025024414,
      "text": " number three, and excuse me, I said Timothy, 2 Thessalonians, excuse me, 2 Thessalonians"
    },
    {
      "id": 52,
      "start": 2019.760025024414,
      "end": 2024.2000274658203,
      "text": " two, in verse number three, we're talking about when will Antichrist rise."
    },
    {
      "id": 53,
      "start": 2024.2000274658203,
      "end": 2028.9200286865234,
      "text": " John started out the passage of scripture in 1 John two, in verse number 18, speaking"
    },
    {
      "id": 54,
      "start": 2028.9200286865234,
      "end": 2033.0600280761719,
      "text": " to these believers and telling them, and this is the last time, and telling them that they"
    },
    {
      "id": 55,
      "start": 2033.0600280761719,
      "end": 2035.5800170898438,
      "text": " have heard that Antichrist shall come."
    },
    {
      "id": 56,
      "start": 2035.5800170898438,
      "end": 2039.6000213623047,
      "text": " He then continues and says, listen, there are already many Antichrists, these false"
    },
    {
      "id": 57,
      "start": 2039.6000213623047,
      "end": 2044.9600219726562,
      "text": " teachers that are prevalent, but the reality is that the Antichrist is going to appear."
    },
    {
      "id": 58,
      "start": 2044.9600219726562,
      "end": 2046.9600219726562,
      "text": " He is going to rise."
    },
    {
      "id": 59,
      "start": 2046.9600219726562,
      "end": 2051.000015258789,
      "text": " Continuing to 2 Thessalonians two, in verse number three, the Bible says, let no man deceive"
    },
    {
      "id": 60,
      "start": 2051.000015258789,
      "end": 2057.1200256347656,
      "text": " you by any means, for that day shall not come, except there come a falling away first, and"
    },
    {
      "id": 61,
      "start": 2057.1200256347656,
      "end": 2062.5800170898438,
      "text": " that man of sin be revealed, the son of perdition."
    },
    {
      "id": 62,
      "start": 2062.5800170898438,
      "end": 2068.060028076172,
      "text": " This is the Antichrist, how he's described here in 2 Thessalonians."
    },
    {
      "id": 63,
      "start": 2068.060028076172,
      "end": 2072.9400329589844,
      "text": " We notice that in verse number four, again, the connection of Daniel's prophecy in chapter"
    },
    {
      "id": 64,
      "start": 2072.9400329589844,
      "end": 2077.6200256347656,
      "text": " number nine, and it talks about at that midpoint of the tribulation, in verse number four of"
    },
    {
      "id": 65,
      "start": 2077.6200256347656,
      "end": 2083.8200073242188,
      "text": " 2 Thessalonians two, who opposeth and exalteth himself above all that is called God, or that"
    },
    {
      "id": 66,
      "start": 2083.8200073242188,
      "end": 2089.4400329589844,
      "text": " is worshiped, so that he as God sitteth in the temple of God, showing himself that he"
    },
    {
      "id": 67,
      "start": 2089.4400329589844,
      "end": 2091.260009765625,
      "text": " is God."
    },
    {
      "id": 68,
      "start": 2091.260009765625,
      "end": 2094.8600158691406,
      "text": " We know that he's not God, he's Antichrist."
    },
    {
      "id": 69,
      "start": 2094.8600158691406,
      "end": 2099.5800170898438,
      "text": " But when does this rise of Antichrist, how is it that we would say that it's after the"
    },
    {
      "id": 70,
      "start": 2099.5800170898438,
      "end": 2100.5800170898438,
      "text": " rapture of the church?"
    },
    {
      "id": 71,
      "start": 2100.5800170898438,
      "end": 2104.1400146484375,
      "text": " Well, we'll turn to the book of Revelation, thank you for asking, and look in the book"
    },
    {
      "id": 72,
      "start": 2104.1400146484375,
      "end": 2107.6600341796875,
      "text": " of Revelation in chapter number three, and then we'll look at chapter four and chapter"
    },
    {
      "id": 73,
      "start": 2107.6600341796875,
      "end": 2110.4200134277344,
      "text": " six."
    },
    {
      "id": 74,
      "start": 2110.4200134277344,
      "end": 2116.540008544922,
      "text": " In Revelation chapter number three, as the messages are given to the churches in Asia,"
    },
    {
      "id": 75,
      "start": 2116.540008544922,
      "end": 2121.2200317382812,
      "text": " they begin in chapter number two, and in chapter number three, he's given a message to Philadelphia,"
    },
    {
      "id": 76,
      "start": 2121.2200317382812,
      "end": 2124.1000366210938,
      "text": " the church in Philadelphia, in verses seven through 13."
    },
    {
      "id": 77,
      "start": 2124.1000366210938,
      "end": 2128.3400268554688,
      "text": " I want to notice what he says in verse number 10, because thou hast kept the word of my"
    },
    {
      "id": 78,
      "start": 2128.3400268554688,
      "end": 2134.02001953125,
      "text": " patience, I also will keep thee from the hour of temptation, which shall come upon"
    },
    {
      "id": 79,
      "start": 2134.02001953125,
      "end": 2138.3400268554688,
      "text": " all the world, to try them and to dwell upon the earth."
    },
    {
      "id": 80,
      "start": 2138.3400268554688,
      "end": 2143.6200256347656,
      "text": " We know that Jeremiah speaks of the tribulation as being the day of Jacob's trouble, and we"
    },
    {
      "id": 81,
      "start": 2143.6200256347656,
      "end": 2148.060028076172,
      "text": " find that in Revelation chapter number four, as you look at all of the churches that are"
    },
    {
      "id": 82,
      "start": 2148.060028076172,
      "end": 2153.6000366210938,
      "text": " addressed in chapters two and three, really providing us truth with regard to the church"
    },
    {
      "id": 83,
      "start": 2153.6000366210938,
      "end": 2154.740020751953,
      "text": " age."
    },
    {
      "id": 84,
      "start": 2154.740020751953,
      "end": 2160.1800231933594,
      "text": " And we find that in the fourth chapter, beginning in verse number one, notice what the Bible"
    },
    {
      "id": 85,
      "start": 2160.1800231933594,
      "end": 2165.9400329589844,
      "text": " says, after this, after all that he deals with with these seven churches, after this,"
    },
    {
      "id": 86,
      "start": 2165.9400329589844,
      "end": 2173.740020751953,
      "text": " I looked, and behold, a door was opened in heaven, and the first voice which I heard"
    },
    {
      "id": 87,
      "start": 2173.740020751953,
      "end": 2179.8600158691406,
      "text": " was as it were of a trumpet talking with me."
    },
    {
      "id": 88,
      "start": 2179.8600158691406,
      "end": 2182.8200073242188,
      "text": " The songwriter said, listen for the trumpet, Jesus is coming."
    },
    {
      "id": 89,
      "start": 2182.8200073242188,
      "end": 2183.8200073242188,
      "text": " Why do you say that?"
    },
    {
      "id": 90,
      "start": 2183.9000244140625,
      "end": 2187.540008544922,
      "text": " We find that in Thessalonians chapter number four, and you think about the trump of God,"
    },
    {
      "id": 91,
      "start": 2187.540008544922,
      "end": 2195.4600219726562,
      "text": " and here we find that here's what it said, come up hither, and I will show thee things"
    },
    {
      "id": 92,
      "start": 2195.4600219726562,
      "end": 2198.9000244140625,
      "text": " which must be hereafter."
    },
    {
      "id": 93,
      "start": 2198.9000244140625,
      "end": 2205.6600341796875,
      "text": " We find that as you look at the scriptures, I believe that this is the record, the truth"
    },
    {
      "id": 94,
      "start": 2205.6600341796875,
      "end": 2208.6600341796875,
      "text": " with regard to the rapture of the church."
    },
    {
      "id": 95,
      "start": 2208.6600341796875,
      "end": 2212.8600158691406,
      "text": " Skip over to chapter number six, if you will, and we see some things in chapters four and"
    },
    {
      "id": 96,
      "start": 2212.9000244140625,
      "end": 2217.1400146484375,
      "text": " five, but in chapter number six, we begin to see about the seal judgments."
    },
    {
      "id": 97,
      "start": 2217.1400146484375,
      "end": 2220.9000244140625,
      "text": " And I just want to focus for just a few minutes this morning on the first of these three seal"
    },
    {
      "id": 98,
      "start": 2220.9000244140625,
      "end": 2226.540008544922,
      "text": " judgments that are mentioned in Revelation chapter number six, because this is the rise"
    },
    {
      "id": 99,
      "start": 2226.540008544922,
      "end": 2231.500030517578,
      "text": " of Antichrist, the first seal in particular."
    },
    {
      "id": 100,
      "start": 2231.500030517578,
      "end": 2236.300018310547,
      "text": " Notice in Revelation six, in verses one and two, the Bible says this is the first of these"
    },
    {
      "id": 101,
      "start": 2236.300018310547,
      "end": 2237.300018310547,
      "text": " seven seals."
    },
    {
      "id": 102,
      "start": 2237.300018310547,
      "end": 2240.980010986328,
      "text": " It says, and I saw when the lamb opened one of the seals."
    },
    {
      "id": 103,
      "start": 2240.980010986328,
      "end": 2242.1400146484375,
      "text": " Now, who's the lamb?"
    },
    {
      "id": 104,
      "start": 2242.4200134277344,
      "end": 2243.4200134277344,
      "text": " That's Jesus, right?"
    },
    {
      "id": 105,
      "start": 2243.4200134277344,
      "end": 2246.5800170898438,
      "text": " That is the lamb of God, which taketh away the sin of the world."
    },
    {
      "id": 106,
      "start": 2246.5800170898438,
      "end": 2253.9400329589844,
      "text": " So the lamb opens one of the seals, and I heard, as it were, the noise of thunder, one"
    },
    {
      "id": 107,
      "start": 2253.9400329589844,
      "end": 2256.9200134277344,
      "text": " of the four beasts saying, come and see."
    },
    {
      "id": 108,
      "start": 2256.9200134277344,
      "end": 2260.6000366210938,
      "text": " And I saw, and behold, a white horse."
    },
    {
      "id": 109,
      "start": 2260.6000366210938,
      "end": 2266.1800231933594,
      "text": " And he that sat on him had a bow, and a crown was given unto him, and he went forth conquering"
    },
    {
      "id": 110,
      "start": 2266.1800231933594,
      "end": 2268.4200134277344,
      "text": " and to conquer."
    },
    {
      "id": 111,
      "start": 2268.4200134277344,
      "end": 2273.4600219726562,
      "text": " Let me say this, this is none other than the counterfeit, the Antichrist."
    },
    {
      "id": 112,
      "start": 2273.4600219726562,
      "end": 2275.5800170898438,
      "text": " This is not the Lord Jesus Christ."
    },
    {
      "id": 113,
      "start": 2275.5800170898438,
      "end": 2281.980010986328,
      "text": " We find that he will come in Revelation chapter 19, and we read of that passage of Scripture,"
    },
    {
      "id": 114,
      "start": 2281.980010986328,
      "end": 2285.5800170898438,
      "text": " and the heaven is open in verse number 11 of Revelation 19."
    },
    {
      "id": 115,
      "start": 2285.5800170898438,
      "end": 2290.3400268554688,
      "text": " I saw heaven open, and behold, a white horse, and he that sat upon him was called Faithful"
    },
    {
      "id": 116,
      "start": 2290.3400268554688,
      "end": 2294.980010986328,
      "text": " and True, and in righteousness he doth judge and make war."
    },
    {
      "id": 117,
      "start": 2294.980010986328,
      "end": 2299.500030517578,
      "text": " That's the return of Jesus Christ at the end of the tribulation."
    },
    {
      "id": 118,
      "start": 2299.500030517578,
      "end": 2305.02001953125,
      "text": " This record of this first seal in Revelation 6, verses 1 and 2, this white horse, this"
    },
    {
      "id": 119,
      "start": 2305.02001953125,
      "end": 2313.9000244140625,
      "text": " is the counterfeit, this is the rise of Antichrist, which happens after the rapture of the church."
    },
    {
      "id": 120,
      "start": 2313.9000244140625,
      "end": 2315.5800170898438,
      "text": " Now look at the second seal."
    },
    {
      "id": 121,
      "start": 2315.5800170898438,
      "end": 2320.3400268554688,
      "text": " In verses 3 and 4, the Bible says, and when he had opened the second seal, I heard the"
    },
    {
      "id": 122,
      "start": 2320.3400268554688,
      "end": 2322.5,
      "text": " second beast say, come and see."
    },
    {
      "id": 123,
      "start": 2322.5,
      "end": 2327.7400512695312,
      "text": " And there went out another horse that was red, and power was given to him that sat there"
    },
    {
      "id": 124,
      "start": 2327.7400512695312,
      "end": 2332.5800170898438,
      "text": " on to take peace from the earth, and that they should kill one another."
    },
    {
      "id": 125,
      "start": 2332.5800170898438,
      "end": 2336.8200073242188,
      "text": " And there was given unto him, notice this says, a great sword."
    },
    {
      "id": 126,
      "start": 2336.8200073242188,
      "end": 2341.1000366210938,
      "text": " Now I believe that as you read through the book of Revelation, and you read of the seal"
    },
    {
      "id": 127,
      "start": 2341.1000366210938,
      "end": 2346.7400512695312,
      "text": " judgments, and you read of the trumpet judgments, and you read of the vial or the bowl judgments,"
    },
    {
      "id": 128,
      "start": 2346.7400512695312,
      "end": 2349.7000122070312,
      "text": " that they happen in rapid succession."
    },
    {
      "id": 129,
      "start": 2349.7000122070312,
      "end": 2354.5800170898438,
      "text": " We find that there's going to be great turmoil, there's going to be the wrath of God during"
    },
    {
      "id": 130,
      "start": 2354.5800170898438,
      "end": 2359.6600341796875,
      "text": " that tribulation period, and we find that now this second horse, this red horse that"
    },
    {
      "id": 131,
      "start": 2359.6600341796875,
      "end": 2364.780029296875,
      "text": " comes with power, that says that he has the power to take peace from the earth, that they"
    },
    {
      "id": 132,
      "start": 2364.780029296875,
      "end": 2366.4000244140625,
      "text": " should kill one another."
    },
    {
      "id": 133,
      "start": 2366.4000244140625,
      "end": 2371.4200439453125,
      "text": " No doubt this red horse would reveal to us intense war upon the earth, and there'd be"
    },
    {
      "id": 134,
      "start": 2371.4200439453125,
      "end": 2374.1799926757812,
      "text": " a great sword."
    },
    {
      "id": 135,
      "start": 2374.1799926757812,
      "end": 2376.5,
      "text": " Now look at verses 5 and 6."
    },
    {
      "id": 136,
      "start": 2376.5,
      "end": 2378.5400390625,
      "text": " We're not going to look at all four of these horses this morning."
    },
    {
      "id": 137,
      "start": 2378.5400390625,
      "end": 2381.3400268554688,
      "text": " I'm going to stop here at this third horse."
    },
    {
      "id": 138,
      "start": 2381.3400268554688,
      "end": 2386.2200317382812,
      "text": " But it says here in verse number 5, and when he had opened the third seal, I heard the"
    },
    {
      "id": 139,
      "start": 2386.2200317382812,
      "end": 2390.7000122070312,
      "text": " third beast say, come and see, and I beheld, and lo, a black horse."
    },
    {
      "id": 140,
      "start": 2390.7000122070312,
      "end": 2395.3800048828125,
      "text": " And he that sat on him had a pair of balances in his hand, and I heard a voice in the midst"
    },
    {
      "id": 141,
      "start": 2395.3800048828125,
      "end": 2399.7000122070312,
      "text": " of the four beasts say, a measure of wheat for a penny, and three measures of barley"
    },
    {
      "id": 142,
      "start": 2399.7000122070312,
      "end": 2401.5,
      "text": " for a penny, and see thou."
    },
    {
      "id": 0,
      "start": 2401.5,
      "end": 2404.3399999141693,
      "text": " hurt not the oil and the wine.\""
    },
    {
      "id": 1,
      "start": 2404.3399999141693,
      "end": 2410.619999885559,
      "text": " As we look at this third seal that is mentioned here, this black horse, this would be revealing"
    },
    {
      "id": 2,
      "start": 2410.619999885559,
      "end": 2414.699999809265,
      "text": " to us this great famine that is going to take place."
    },
    {
      "id": 3,
      "start": 2414.699999809265,
      "end": 2418.7000007629395,
      "text": " This great famine is going to be impactful to the point where the Bible describes it"
    },
    {
      "id": 4,
      "start": 2418.7000007629395,
      "end": 2422.340000152588,
      "text": " as being a measure of wheat for a penny."
    },
    {
      "id": 5,
      "start": 2422.340000152588,
      "end": 2427.0599994659424,
      "text": " Now what he's referring to here in three measures of barley for a penny, what he's referring"
    },
    {
      "id": 6,
      "start": 2427.0599994659424,
      "end": 2433.659999847412,
      "text": " to here in this passage of Scripture is that there's going to be a daily wage would only"
    },
    {
      "id": 7,
      "start": 2433.659999847412,
      "end": 2438.560001373291,
      "text": " buy the normal food for a normal day's food ration."
    },
    {
      "id": 8,
      "start": 2438.560001373291,
      "end": 2443.5,
      "text": " So a day's wage equals a daily ration of food."
    },
    {
      "id": 9,
      "start": 2443.5,
      "end": 2446.2999992370605,
      "text": " You say, how could that be?"
    },
    {
      "id": 10,
      "start": 2446.2999992370605,
      "end": 2451.5,
      "text": " Surely you don't pay, I know things are more expensive at the grocery store today, but"
    },
    {
      "id": 11,
      "start": 2451.5,
      "end": 2457.060001373291,
      "text": " you don't pay for one ration of food for one individual what you make in a day."
    },
    {
      "id": 12,
      "start": 2457.060001373291,
      "end": 2463.340000152588,
      "text": " But we notice that as the Antichrist is revealed in verse number one and two, and as the rise"
    },
    {
      "id": 13,
      "start": 2463.340000152588,
      "end": 2468.120002746582,
      "text": " of Antichrist and the start of the tribulation, that there's going to be great war that's"
    },
    {
      "id": 14,
      "start": 2468.120002746582,
      "end": 2470.1399993896484,
      "text": " going to lead to great famine."
    },
    {
      "id": 15,
      "start": 2470.1399993896484,
      "end": 2473.6600036621094,
      "text": " And this great famine, the Bible tells us that there's going to be a measure of wheat"
    },
    {
      "id": 16,
      "start": 2473.6600036621094,
      "end": 2475.779998779297,
      "text": " for a penny."
    },
    {
      "id": 17,
      "start": 2476.180000305176,
      "end": 2480.9400024414062,
      "text": " Let me just give you a couple of interesting truths this morning."
    },
    {
      "id": 18,
      "start": 2480.9400024414062,
      "end": 2484.900001525879,
      "text": " Again, I'm listening for the trumpet, amen?"
    },
    {
      "id": 19,
      "start": 2484.900001525879,
      "end": 2491.4599990844727,
      "text": " I'm looking to the sky for the reality is that our redemption draweth nigh, amen?"
    },
    {
      "id": 20,
      "start": 2491.4599990844727,
      "end": 2497.6600036621094,
      "text": " The coming of the Lord is nigh, and I'm so thankful to know that the Lord Jesus Christ"
    },
    {
      "id": 21,
      "start": 2497.6600036621094,
      "end": 2501.4599990844727,
      "text": " is coming again, and he's coming right on time."
    },
    {
      "id": 22,
      "start": 2501.4599990844727,
      "end": 2506.9800033569336,
      "text": " You've often heard me say that things are falling into place in our world today."
    },
    {
      "id": 23,
      "start": 2506.9800033569336,
      "end": 2510.7399978637695,
      "text": " Listen, there are people today that are looking at all that's taking place and are saying,"
    },
    {
      "id": 24,
      "start": 2510.7399978637695,
      "end": 2513.180000305176,
      "text": " everything's falling apart, everything's going crazy."
    },
    {
      "id": 25,
      "start": 2513.180000305176,
      "end": 2517.680000305176,
      "text": " And the world is going crazy, but God is in control, amen?"
    },
    {
      "id": 26,
      "start": 2517.680000305176,
      "end": 2522.0400009155273,
      "text": " And we find that as God is in control, and as John says to these believers that he's"
    },
    {
      "id": 27,
      "start": 2522.0400009155273,
      "end": 2528.220001220703,
      "text": " writing to, he says, listen, you have heard that Antichrist shall come."
    },
    {
      "id": 28,
      "start": 2528.220001220703,
      "end": 2530.220001220703,
      "text": " Even now are there many Antichrists."
    },
    {
      "id": 29,
      "start": 2530.220001220703,
      "end": 2534.8200073242188,
      "text": " So he deals with the false teachers, but he gives mention to the fact that Antichrist"
    },
    {
      "id": 30,
      "start": 2534.8200073242188,
      "end": 2535.8200073242188,
      "text": " shall come."
    },
    {
      "id": 31,
      "start": 2535.8200073242188,
      "end": 2536.8200073242188,
      "text": " When's he going to come?"
    },
    {
      "id": 32,
      "start": 2536.8200073242188,
      "end": 2537.8200073242188,
      "text": " After the rapture."
    },
    {
      "id": 33,
      "start": 2537.8200073242188,
      "end": 2539.6199951171875,
      "text": " Here's what's going to happen."
    },
    {
      "id": 34,
      "start": 2539.6199951171875,
      "end": 2546.699996948242,
      "text": " And I believe that we are definitely getting close to the return of the Lord Jesus Christ."
    },
    {
      "id": 35,
      "start": 2546.699996948242,
      "end": 2552.300003051758,
      "text": " Now let me just, and again, I hope that no one would take the statements that I'm making"
    },
    {
      "id": 36,
      "start": 2552.300003051758,
      "end": 2554.259994506836,
      "text": " this morning and take them out of context."
    },
    {
      "id": 37,
      "start": 2554.259994506836,
      "end": 2559.1600036621094,
      "text": " I'm simply trying to help us understand how quickly things can change and how this can"
    },
    {
      "id": 38,
      "start": 2559.1600036621094,
      "end": 2563.3200073242188,
      "text": " come to pass that quick."
    },
    {
      "id": 39,
      "start": 2563.3200073242188,
      "end": 2569.240005493164,
      "text": " Because when the rapture of the church takes place and Christians are removed and the Antichrist"
    },
    {
      "id": 40,
      "start": 2569.240005493164,
      "end": 2575.5599975585938,
      "text": " is revealed and the rise of Antichrist and these seals are opened, it is going to be"
    },
    {
      "id": 41,
      "start": 2575.5599975585938,
      "end": 2581.479995727539,
      "text": " havoc on earth."
    },
    {
      "id": 42,
      "start": 2581.479995727539,
      "end": 2585.979995727539,
      "text": " The third seal that is mentioned here is world famine."
    },
    {
      "id": 43,
      "start": 2585.979995727539,
      "end": 2589.8600006103516,
      "text": " And let me just share with you some interesting truth."
    },
    {
      "id": 44,
      "start": 2589.8600006103516,
      "end": 2595.6600036621094,
      "text": " It's terrible what's going on in the Ukraine right now with Russia and all of that situation."
    },
    {
      "id": 45,
      "start": 2595.6600036621094,
      "end": 2596.6600036621094,
      "text": " People are dying."
    },
    {
      "id": 46,
      "start": 2596.6600036621094,
      "end": 2599.5,
      "text": " It's a catastrophic situation."
    },
    {
      "id": 47,
      "start": 2599.5,
      "end": 2603.1000061035156,
      "text": " But I'll just use this as an example, and I'm not suggesting that this is this period"
    },
    {
      "id": 48,
      "start": 2603.1000061035156,
      "end": 2604.1000061035156,
      "text": " of time."
    },
    {
      "id": 49,
      "start": 2604.1000061035156,
      "end": 2605.699996948242,
      "text": " Just bear with me."
    },
    {
      "id": 50,
      "start": 2605.699996948242,
      "end": 2608.0599975585938,
      "text": " Don't misunderstand what I'm saying this morning."
    },
    {
      "id": 51,
      "start": 2608.0599975585938,
      "end": 2609.5800018310547,
      "text": " I'm not seeking to set a date."
    },
    {
      "id": 52,
      "start": 2609.5800018310547,
      "end": 2612.6199951171875,
      "text": " I'm not seeking to say this is unfolding before our eyes."
    },
    {
      "id": 53,
      "start": 2612.6199951171875,
      "end": 2615.8999938964844,
      "text": " I'm simply saying, look at how quickly things can change."
    },
    {
      "id": 54,
      "start": 2615.8999938964844,
      "end": 2622.3600006103516,
      "text": " Do you know that Russia is the number one world exporter of wheat?"
    },
    {
      "id": 55,
      "start": 2622.3600006103516,
      "end": 2626.1799926757812,
      "text": " And Ukraine is number five."
    },
    {
      "id": 56,
      "start": 2626.1799926757812,
      "end": 2636.0,
      "text": " Those two countries account for nearly 33% of the world's export of wheat."
    },
    {
      "id": 57,
      "start": 2636.0,
      "end": 2639.3399963378906,
      "text": " There are decisions already being made with regard to, we're not going to be able to get"
    },
    {
      "id": 58,
      "start": 2639.3399963378906,
      "end": 2640.3399963378906,
      "text": " wheat."
    },
    {
      "id": 59,
      "start": 2640.3399963378906,
      "end": 2641.3399963378906,
      "text": " We're not going to be able to do this."
    },
    {
      "id": 60,
      "start": 2641.3399963378906,
      "end": 2642.3399963378906,
      "text": " It's going to increase, so on and so forth."
    },
    {
      "id": 61,
      "start": 2643.0599975585938,
      "end": 2647.3399963378906,
      "text": " I read an article this morning, even, about fertilizer that is exported from Russia."
    },
    {
      "id": 62,
      "start": 2647.3399963378906,
      "end": 2652.4199981689453,
      "text": " And how that Brazil, in particular, is in a real big mess because they don't have fertilizer,"
    },
    {
      "id": 63,
      "start": 2652.4199981689453,
      "end": 2657.1000061035156,
      "text": " and that's where they import it from is Russia, and Russia's not going to export it, and therefore"
    },
    {
      "id": 64,
      "start": 2657.1000061035156,
      "end": 2659.3800048828125,
      "text": " the yield is going to be less, and so on and so forth."
    },
    {
      "id": 65,
      "start": 2659.3800048828125,
      "end": 2662.3800048828125,
      "text": " And the cost, and you think that inflation's already hit us?"
    },
    {
      "id": 66,
      "start": 2662.3800048828125,
      "end": 2666.9400024414062,
      "text": " It's only going to be worse."
    },
    {
      "id": 67,
      "start": 2666.9400024414062,
      "end": 2672.459991455078,
      "text": " It's interesting that in just whatever it's been, 9 or 10 days, 10 days, I guess, since"
    },
    {
      "id": 68,
      "start": 2672.459991455078,
      "end": 2680.9400024414062,
      "text": " the invasion, that the cost of wheat has gone up 44%."
    },
    {
      "id": 69,
      "start": 2680.9400024414062,
      "end": 2686.1000061035156,
      "text": " And that, what's going on right now, isn't even close to what's going to happen when"
    },
    {
      "id": 70,
      "start": 2686.1000061035156,
      "end": 2688.4200134277344,
      "text": " the Antichrist is revealed."
    },
    {
      "id": 71,
      "start": 2688.4200134277344,
      "end": 2694.6600036621094,
      "text": " Again, I'm not suggesting anything beyond what I'm saying, so don't misunderstand, don't"
    },
    {
      "id": 72,
      "start": 2694.6600036621094,
      "end": 2696.019989013672,
      "text": " take further what I'm saying."
    },
    {
      "id": 73,
      "start": 2696.1000061035156,
      "end": 2702.8999938964844,
      "text": " I'm simply helping us to understand this morning that we're really seeing the truth of how"
    },
    {
      "id": 74,
      "start": 2702.8999938964844,
      "end": 2705.1400146484375,
      "text": " quickly these things can take place."
    },
    {
      "id": 75,
      "start": 2705.1400146484375,
      "end": 2710.6600036621094,
      "text": " I think about this when the book of Revelation talks about the two witnesses and how that"
    },
    {
      "id": 76,
      "start": 2710.6600036621094,
      "end": 2712.980010986328,
      "text": " the whole world is going to see them."
    },
    {
      "id": 77,
      "start": 2712.980010986328,
      "end": 2717.1799926757812,
      "text": " You know, for many people, for many generations, it is almost impossible to figure out how"
    },
    {
      "id": 78,
      "start": 2717.1799926757812,
      "end": 2719.260009765625,
      "text": " that could take place."
    },
    {
      "id": 79,
      "start": 2719.260009765625,
      "end": 2724.6199951171875,
      "text": " But for us today, with the advancements in technology, you can see things all over, you"
    },
    {
      "id": 80,
      "start": 2724.6199951171875,
      "end": 2730.9400024414062,
      "text": " can see video from all over the world, active, live video right now."
    },
    {
      "id": 81,
      "start": 2730.9400024414062,
      "end": 2735.1799926757812,
      "text": " And so we see that these things are absolutely possible, and there are some people that say,"
    },
    {
      "id": 82,
      "start": 2735.1799926757812,
      "end": 2738.8999938964844,
      "text": " oh, look at all that we have, look at all that this is, it's not possible that that's"
    },
    {
      "id": 83,
      "start": 2738.8999938964844,
      "end": 2739.8999938964844,
      "text": " ever going to happen."
    },
    {
      "id": 84,
      "start": 2739.8999938964844,
      "end": 2746.739990234375,
      "text": " A day's wage is not, to buy a daily ration of food, and that third seal, that's what's"
    },
    {
      "id": 85,
      "start": 2746.739990234375,
      "end": 2748.739990234375,
      "text": " going to happen."
    },
    {
      "id": 86,
      "start": 2748.739990234375,
      "end": 2750.9400024414062,
      "text": " That's what God tells us."
    },
    {
      "id": 87,
      "start": 2750.9400024414062,
      "end": 2754.739990234375,
      "text": " And so we don't know when Antichrist is going to rise, but we know that it's going to happen"
    },
    {
      "id": 88,
      "start": 2754.739990234375,
      "end": 2756.459991455078,
      "text": " after the rapture."
    },
    {
      "id": 89,
      "start": 2756.459991455078,
      "end": 2762.4200134277344,
      "text": " And we know that as we look at these truths that God gives us with regard to the false"
    },
    {
      "id": 90,
      "start": 2762.4200134277344,
      "end": 2767.6199951171875,
      "text": " teaching that is so prevalent and how that it leads to the culmination of the rapture"
    },
    {
      "id": 91,
      "start": 2767.6199951171875,
      "end": 2773.3800048828125,
      "text": " of the church and, of course, the Antichrist being revealed, the reality is that our focus"
    },
    {
      "id": 92,
      "start": 2773.3800048828125,
      "end": 2777.739990234375,
      "text": " should be on the soon return of our Lord and Savior, Jesus Christ."
    },
    {
      "id": 93,
      "start": 2777.739990234375,
      "end": 2779.8200073242188,
      "text": " He's coming again."
    },
    {
      "id": 94,
      "start": 2779.8200073242188,
      "end": 2783.8599853515625,
      "text": " And with everything that's going on in our world, with everything that's taking place,"
    },
    {
      "id": 95,
      "start": 2783.8599853515625,
      "end": 2788.3800048828125,
      "text": " and as you enter into the very next section of 1 John, I'll preach on this next week,"
    },
    {
      "id": 96,
      "start": 2788.3800048828125,
      "end": 2795.019989013672,
      "text": " but in verse number 28, he says, and now little children abide in him that when he shall appear,"
    },
    {
      "id": 97,
      "start": 2795.019989013672,
      "end": 2801.2999877929688,
      "text": " he immediately goes from that internal threat to the false teachers, to the Antichrist,"
    },
    {
      "id": 98,
      "start": 2801.2999877929688,
      "end": 2802.2999877929688,
      "text": " as he describes them."
    },
    {
      "id": 99,
      "start": 2802.2999877929688,
      "end": 2806.1799926757812,
      "text": " And he says, listen, I want you to abide in him, and I want you to understand that he's"
    },
    {
      "id": 100,
      "start": 2806.1799926757812,
      "end": 2811.1400146484375,
      "text": " going to appear, when he shall appear, that we may have confidence and not be ashamed"
    },
    {
      "id": 101,
      "start": 2811.1400146484375,
      "end": 2812.739990234375,
      "text": " before him, it is coming."
    },
    {
      "id": 102,
      "start": 2812.739990234375,
      "end": 2817.480010986328,
      "text": " And he deals with the return of the Lord Jesus Christ, it'll be our focus next week."
    },
    {
      "id": 103,
      "start": 2817.480010986328,
      "end": 2821.2999877929688,
      "text": " But I ask ourselves this question, are we ready?"
    },
    {
      "id": 104,
      "start": 2821.2999877929688,
      "end": 2823.739990234375,
      "text": " Are we ready for the return of the Lord?"
    },
    {
      "id": 105,
      "start": 2823.739990234375,
      "end": 2828.4200134277344,
      "text": " We understand some of these things that are taking place, and we notice what's going on"
    },
    {
      "id": 106,
      "start": 2828.4200134277344,
      "end": 2829.4200134277344,
      "text": " in the world."
    },
    {
      "id": 107,
      "start": 2829.4200134277344,
      "end": 2833.760009765625,
      "text": " Listen, it's only going to get a whole lot worse after we leave."
    },
    {
      "id": 108,
      "start": 2833.760009765625,
      "end": 2837.6000061035156,
      "text": " After the rapture of the church, it's going to get so much worse, because that same passage"
    },
    {
      "id": 109,
      "start": 2837.6000061035156,
      "end": 2842.6000061035156,
      "text": " of Scripture in 2 Thessalonians, that speaks about the mystery of iniquity doth already"
    },
    {
      "id": 110,
      "start": 2842.6000061035156,
      "end": 2847.6600036621094,
      "text": " work, it says, only he who now letteth will let, until he be taken out of the way."
    },
    {
      "id": 111,
      "start": 2847.6600036621094,
      "end": 2852.6000061035156,
      "text": " And I believe that that's referring to the Holy Spirit of God, who is the restrainer"
    },
    {
      "id": 112,
      "start": 2852.6000061035156,
      "end": 2857.0,
      "text": " of all of this wickedness, and the Holy Spirit of God indwells in the people of God, and"
    },
    {
      "id": 113,
      "start": 2857.0,
      "end": 2862.279998779297,
      "text": " when the rapture takes place, then he that letteth, that restrains, only he who now letteth"
    },
    {
      "id": 114,
      "start": 2862.279998779297,
      "end": 2867.5599975585938,
      "text": " will let, until he be taken out of the way."
    },
    {
      "id": 115,
      "start": 2867.5599975585938,
      "end": 2869.1199951171875,
      "text": " The havoc upon earth."
    },
    {
      "id": 116,
      "start": 2869.1199951171875,
      "end": 2874.480010986328,
      "text": " Listen, I'm thankful I'm not going to be here for the tribulation."
    },
    {
      "id": 117,
      "start": 2874.480010986328,
      "end": 2875.480010986328,
      "text": " I am thankful."
    },
    {
      "id": 118,
      "start": 2875.480010986328,
      "end": 2881.480010986328,
      "text": " But there are some lost people that I know, there are some lost people that you know,"
    },
    {
      "id": 119,
      "start": 2881.480010986328,
      "end": 2883.7999877929688,
      "text": " that they think it's bad right now."
    },
    {
      "id": 120,
      "start": 2883.7999877929688,
      "end": 2890.6799926757812,
      "text": " We know that this pales in comparison to what will be."
    },
    {
      "id": 121,
      "start": 2890.6799926757812,
      "end": 2891.6799926757812,
      "text": " Amen?"
    },
    {
      "id": 122,
      "start": 2891.6799926757812,
      "end": 2903.3200073242188,
      "text": " And this morning, the false teaching is so prevalent, we must understand the way that"
    },
    {
      "id": 123,
      "start": 2903.3200073242188,
      "end": 2910.3200073242188,
      "text": " these false teachers are exposed, and we must be faithful to continue in that enabling of"
    },
    {
      "id": 124,
      "start": 2910.3200073242188,
      "end": 2916.5599975585938,
      "text": " the Holy Spirit of God to lift up the name of Christ, and to do everything that God would"
    },
    {
      "id": 125,
      "start": 2916.5599975585938,
      "end": 2921.6400146484375,
      "text": " enable us to do to redeem the time to make a difference."
    },
    {
      "id": 126,
      "start": 2921.6400146484375,
      "end": 2923.5999755859375,
      "text": " Souls are dying."
    },
    {
      "id": 127,
      "start": 2923.5999755859375,
      "end": 2926.2000122070312,
      "text": " We have a unique opportunity."
    },
    {
      "id": 128,
      "start": 2926.2000122070312,
      "end": 2933.760009765625,
      "text": " Souls are being deceived, and we have the truth of this book."
    },
    {
      "id": 129,
      "start": 2933.760009765625,
      "end": 2935.8400268554688,
      "text": " And God's given us the warning."
    },
    {
      "id": 130,
      "start": 2935.8400268554688,
      "end": 2938.6400146484375,
      "text": " I hope that we would take the warning."
    },
    {
      "id": 131,
      "start": 2938.6400146484375,
      "end": 2945.6799926757812,
      "text": " I hope that as a church, one of the jobs of a pastor is to protect the flock, and I understand"
    },
    {
      "id": 132,
      "start": 2946.4000244140625,
      "end": 2950.5599975585938,
      "text": " the fact that God is the shepherd, the Lord Jesus Christ is the shepherd, the head of"
    },
    {
      "id": 133,
      "start": 2950.5599975585938,
      "end": 2954.5599975585938,
      "text": " the church, but the pastor is the under-shepherd, and the responsibility is to protect the flock"
    },
    {
      "id": 134,
      "start": 2954.5599975585938,
      "end": 2957.0,
      "text": " of God."
    },
    {
      "id": 135,
      "start": 2957.0,
      "end": 2962.719970703125,
      "text": " Individually, we find that the false teaching, listen, don't believe everything you listen"
    },
    {
      "id": 136,
      "start": 2962.719970703125,
      "end": 2968.239990234375,
      "text": " to on YouTube, please."
    },
    {
      "id": 137,
      "start": 2968.239990234375,
      "end": 2971.5999755859375,
      "text": " Don't listen to every preacher that's on the Internet and say, well, this preacher said,"
    },
    {
      "id": 138,
      "start": 2971.5999755859375,
      "end": 2976.1599731445312,
      "text": " and he sounded right, and I'm just going to go with it."
    },
    {
      "id": 139,
      "start": 2976.1599731445312,
      "end": 2981.1199951171875,
      "text": " You can find scores and scores and scores of false teachers out there, and God gives"
    },
    {
      "id": 140,
      "start": 2981.1199951171875,
      "end": 2991.3599853515625,
      "text": " us a warning of the tactic of the enemy to corrupt not only externally but internally."
    },
    {
      "id": 141,
      "start": 2991.3599853515625,
      "end": 2993.7999877929688,
      "text": " Antichrist will come."
    },
    {
      "id": 142,
      "start": 2993.7999877929688,
      "end": 2997.0800170898438,
      "text": " I'm not going to be here."
    },
    {
      "id": 143,
      "start": 2997.0800170898438,
      "end": 3001.7999877929688,
      "text": " But I'm here when the antichrists, the false teachers..."
    },
    {
      "id": 0,
      "start": 3001.7999877929688,
      "end": 3007.5599880218506,
      "text": " are doing what they're doing. And so are you. And so we must be prepared for that and we"
    },
    {
      "id": 1,
      "start": 3007.5599880218506,
      "end": 3012.5999879837036,
      "text": " must engage in that. Let's pray together. Father, we love You. We thank You for loving"
    },
    {
      "id": 2,
      "start": 3012.5999879837036,
      "end": 3017.6799879074097,
      "text": " us. We thank You for the truth of Your Word, the power of Your Word. We thank You for that"
    },
    {
      "id": 3,
      "start": 3017.6799879074097,
      "end": 3023.439987182617,
      "text": " which has been revealed this morning. I thank You for the warning that's been given about"
    },
    {
      "id": 4,
      "start": 3023.439987182617,
      "end": 3032.279987335205,
      "text": " this tactic of the enemy internally. God, I pray that You'd help us to know the truth,"
    },
    {
      "id": 5,
      "start": 3032.279987335205,
      "end": 3039.0399894714355,
      "text": " help us to stand for truth, help us to fight the good fight. Lord, I pray that You would"
    },
    {
      "id": 6,
      "start": 3039.0399894714355,
      "end": 3043.719985961914,
      "text": " help us to earnestly contend for the faith and that You would enable us, Lord, to be"
    },
    {
      "id": 7,
      "start": 3043.719985961914,
      "end": 3048.999988555908,
      "text": " doers of the Word and not hearers only. I pray, Father, that You would move and work"
    },
    {
      "id": 8,
      "start": 3048.999988555908,
      "end": 3054.3599891662598,
      "text": " in hearts and lives as only You can. If there's someone that's not sure of heaven, oh God,"
    },
    {
      "id": 9,
      "start": 3054.3599891662598,
      "end": 3058.959987640381,
      "text": " I pray that today they would get it settled. Today is the day of salvation. That before"
    },
    {
      "id": 10,
      "start": 3058.959987640381,
      "end": 3063.519989013672,
      "text": " it's eternally too late, that they would get it settled. Lord, for every believer, I pray"
    },
    {
      "id": 11,
      "start": 3063.519989013672,
      "end": 3073.439987182617,
      "text": " that You'd help us to receive the warning on how these false teachers are exposed and"
    },
    {
      "id": 12,
      "start": 3073.439987182617,
      "end": 3079.6399841308594,
      "text": " then could rejoice in the enabling of the Holy Spirit of God to be able to perceive"
    },
    {
      "id": 13,
      "start": 3079.6399841308594,
      "end": 3086.0799865722656,
      "text": " and to proceed. I pray that You'd help us to continue and that we'd serve You faithfully."
    },
    {
      "id": 14,
      "start": 3086.0799865722656,
      "end": 3093.6799850463867,
      "text": " Use us to be Your representatives, Your ambassadors in these evil days. We pray that You'd work"
    },
    {
      "id": 15,
      "start": 3093.6799850463867,
      "end": 3096.959991455078,
      "text": " and move as only You can. For it's in Christ's name we pray. Would You stand with me? Heads"
    },
    {
      "id": 16,
      "start": 3096.959991455078,
      "end": 3101.439987182617,
      "text": " are bowed, eyes are closed. Kimberly's going to play quietly on the piano and as she does,"
    },
    {
      "id": 17,
      "start": 3101.439987182617,
      "end": 3106.3599853515625,
      "text": " the altar is open. Maybe you want to come and thank God for the truth, the warning."
    },
    {
      "id": 18,
      "start": 3106.3599853515625,
      "end": 3111.1999893188477,
      "text": " Warnings are good. Maybe this morning you've been deceived. Maybe you've been listening"
    },
    {
      "id": 19,
      "start": 3111.1999893188477,
      "end": 3116.7999877929688,
      "text": " to some false teaching. You've gotten some things and maybe you've lent your ear to those"
    },
    {
      "id": 20,
      "start": 3116.7999877929688,
      "end": 3120.839988708496,
      "text": " things. You need to ask the Lord to help you. Maybe this morning there's some people that"
    },
    {
      "id": 21,
      "start": 3120.839988708496,
      "end": 3126.3599853515625,
      "text": " you know that though you won't be here when the Antichrist is revealed, they will and"
    },
    {
      "id": 22,
      "start": 3126.3599853515625,
      "end": 3130.439987182617,
      "text": " maybe you want to pray for them. Ask God to give you unique opportunities of being able"
    },
    {
      "id": 23,
      "start": 3130.439987182617,
      "end": 3135.719985961914,
      "text": " to share the gospel with them, to give them the truth. As Kimberly plays, the altar is"
    },
    {
      "id": 24,
      "start": 3135.719985961914,
      "end": 3136.1199951171875,
      "text": " open."
    }
  ],
  "processed_at": "2025-04-16T16:05:49.927992"
}