{
  "video_id": "DSAVnV2bHaY",
  "text": "a great song this evening to be able to sing. Thank the Lord for the old hymns of the faith. Amen. And what a blessing how they encourage us and strengthen us and prepare us for the truth from his word. Genesis chapter 37. A couple of weeks ago, we had an introduction to the life of Joseph. We looked at the first few verses here of Genesis chapter 37, verses one through four. And in that introductory message, we noted some aspects of Joseph's childhood. And then we examined some aspects of his character. And we noted that though Joseph was a young man, he was a man of character. And I'm thankful for some people of character. I'm thankful for young people that have character. And character is so important in our society today. We find in many places that it's lacking. But what a blessing to have young people of character. Joseph was a man of character. As we study through Genesis chapter number 37 again, not much is mentioned specifically about the childhood of Joseph. There's just a few aspects that we're able to go to. And then we read of that event last time that we looked at the start, Genesis 37, where he's there and he's working with his brothers there. And what have you, as we looked in verse number two and three and all that was going on. And then we find the very next event that is dealt with are the dreams of Joseph. And I've simply titled the message this evening, the dreams of Joseph from Genesis 37, verses five through 11. Notice with me and let me just remind you that Joseph was hated by his brothers. Remember, Joseph was the favorite. We talked about the dysfunctional family. The Bible tells us in verse number three. Now, Israel, the father there, Israel loved Joseph more than all his children because he was the son of his old age. And he made him a coat of many colors. And so every time they would see Joseph wearing that coat, it was a reminder not only as to the love that Jacob had for him, but also the position in which Joseph would have as being heir. And we find that it caused the brothers great distress. It says in verse four, when his brethren saw that their father loved him more than all his brethren. Notice the Bible says that they hated him and could not speak peaceably unto him. And if you think it couldn't get worse, it does. In verse number five, the Bible says this. And Joseph dreamed a dream and he told it his brethren notice and they hated him yet the more. They already hated him and could not speak peaceably unto him. According to verse number four, they hear the dream and the Bible says that they hated him yet the more he said unto them in verse number six. Here, I pray you this dream, which I have dreamed. For behold, we were binding sheaves in the field and low. My sheaf arose and also stood upright. Behold, your sheaves stood round about and made obeisance to my sheaf and his brethren said unto him, Shout thou indeed reign over us or shout thou indeed have dominion over us. And they hated him yet the more for his dreams and for his words. And he dreamed yet another dream and told it his brethren and said, Behold, I have dreamed a dream more. And behold, the sun and the moon and the eleven stars made obedience to me. And he told it to his father and to his brethren and his father rebuked him and said unto him, What is this dream that thou hast dreamed? Shall I and thy mother and thy brethren indeed come to bow down ourselves to thee, to the earth? And his brethren envied him, but his father observed the saying. As we look at this portion of Scripture, I want you to consider three thoughts with me this evening. We'll seek to make some application as we get to the end of the message this evening, but consider with me, first of all, what God was revealing. Consider what God was revealing. There are two dreams that are mentioned here that Joseph has. And the first dream is outlined for us in verses five through seven. We understand that in this first dream, but it's specifically dealing with Joseph and his brethren, the eleven brothers. And in this first dream, we find the Bible says that they're binding sheaves in the field. This is the dream that Joseph has. And his sheaf arose and stood upright and their sheaves all stood round about and did obeisance. And we begin to consider what God was revealing to Joseph through this, his first dream. And he shares that dream and it's understood what's taking place. And then Joseph has a second dream. That second dream is outlined for us in verse number nine, as we read a moment ago. And in this particular dream, it's not just the eleven brethren. It's also mother and father. And we would understand that Rachel has died. And so no doubt this would be a reference to Leah. In this particular text and dealing with that. And we find that now he says that the sun and the moon and the eleven stars representing the eleven brothers did made obeisance to him and begin to think about what God was revealing, what God was making known to Joseph, what was to come to pass in Joseph's life. He was making known to Joseph the future events that would take place in Joseph's life and how those how it would relate with his brothers and so on and so forth. And we find that these dreams are given by the Lord. Now, we understand that prior to the Bible being completed, that there are many examples in God's word of those that receive revelation from God through dreams or visions. And we can read of that and we can understand that. We can see within the context of Scripture how that God would be revealing things, events, future happenings through dreams and visions. We've been studying the life of Samuel in Sunday school. And as we're studying through his life and we're mindful of the fact that the Lord is calling to Samuel, there's no vision in that time. There's no open revelation from the Lord. And God calls to Samuel. And we've mentioned this before, but we dealt with it in Sunday school that Samuel is instructed by Eli to say, speak, Lord, for thy servant heareth. And we find that Samuel obeys the instruction that Eli provided. And he said, speak for thy servant hereth, according to First Samuel three in verse number ten. And there God speaks to Samuel and says, I will do a thing in Israel. And he reveals to Samuel what he God is going to do in the future. And we find that God would work. And there are many other examples that we could look to this evening with regard to God revealing to his people his plans with regard to the future, using dreams and visions. Now, understand that those dreams and visions never equate to having salvation. And there's a circumstance today that people talk about receiving dreams and visions and so on and so forth. And I've had conversation with people in various times where I'd ask them if they're going to heaven when they die. And I get a variety of answers when I ask that question. And some say yes, because they've been baptized. Some say yes, because they have spoken in tongues. And some say yes, because they're part of some church and so on and so forth. And because I'm a good person and I hope so and I'm doing the best that I can. And some have said, yes, I've been born again. I've trusted the Lord Jesus Christ as my personal savior. I've been saved. I've been born again. And hallelujah. When that answer comes. Some, however, have told me at different times in my life that they've seen a vision, they've had a dream, and that's why they believe they're going to heaven. Whenever that happens, I immediately go to Acts chapter number 10 and talk about a man by the name of Cornelius. And Cornelius was a man that was a religious man. But Cornelius was a man that was lost. He was a man that prayed fervently. He was religious, but he was lost. And God allowed for a vision to be given. And God spoke to Cornelius. And what God said to Cornelius was to go and get Peter. And Peter would give him the words that he needed to have. In other words, Peter would come and give him the gospel. And if you read the record of Acts chapter number 10, and then as it's rehearsed before the the Jews there in Jerusalem by Peter to them in chapter number 11, you'll find that Peter shows up and Peter preaches the gospel and then Cornelius and all that were gathered there, they get saved. At the preaching of the gospel, not because of a vision or a dream. And so we see that in this vision, this just these dreams that Joseph is having. The two that are recorded here in our text of Scripture that God is making known to Joseph what is going to come to pass. Now, we understand that God has given us a complete canon of Scripture. God's given us his word. And I'm so thankful this evening to have the word of God in its complete form and that we can rejoice that we have all of it. You know, there are some people on the earth today that do not have any portion of this book in their own language. It's just simply not available to them in their language. There are some groups of people that in their own language, all they have is the New Testament. Now, understand that the New Testament is better than having nothing. But, you know, as we study our Bibles, as we read through the Scriptures, can you imagine if all we had was the New Testament? How much we would miss from not having the Old Testament? I know there's some people today that say, well, we're New Testament believers. We really don't need the Old Testament. They are mistaken. And they have not understood that even the New Testament itself says of the Old Testament that it is written for our learning. It is written for our admonition. And here's what Paul says in the book of Hebrews, that the law having a shadow of good things. to come. And if you don't understand, if you don't have the Old Testament, how are you understanding the book of Hebrews? I mean it's almost going to be impossible to understand the book of Hebrews if you do not have the Old Testament and understanding all that the Jews and the practices with regard to the offerings and the sacrifices and what have you. And we find that God has graciously given us the whole Bible. And what a blessing that is. And we find that today God is no longer speaking to us in dreams and visions and it's not that we need to try to have some dream or some vision to understand some future event. No, God is speaking to us through His Word. And by the way, in His Word He's told us about some future events. He's told us about some future events that will come to pass. We don't know the particular times of some of these events, but we know that they're going to come to pass. I want you to notice with me, keep your place here, we'll be back in Genesis in just a moment, but go to the Gospel of John if you will. In John chapter number 14, we'll look at John 14 and also at John 16. And I want you to notice what the Lord Jesus Christ said to His disciples here in John 14 and then again in John chapter number 16. I want you to think about the truth of God giving us the entire Bible. Of course even as He's speaking to the disciples at this particular time, before He would go to the cross of Calvary, they did not have the complete Bible like we have it today. And so they too were in a position where they did not have the complete revelation of God. But notice what the Bible says in John 14 and verse 25. These things have I spoken unto you, being yet present with you. But the Comforter, who is that? It says, which is the Holy Ghost. Aren't you thankful for the Holy Ghost? And I'm so thankful. The moment of salvation, the Bible teaches us that the Holy Ghost, the third person of the Trinity, of the Godhead, takes up residence within us. And we don't need to be scared about preaching or teaching about the Holy Ghost, the Holy Spirit. It is biblical, it is understood that God has given us the Holy Ghost and the Comforter has come. Notice, which the Father will send in my name. I'm so thankful to have the Holy Spirit indwell me and to be indwelled by God's Spirit. The Bible says this, He shall teach you, how many things? All things. And bring all things to your remembrance whatsoever I have said unto you. You know that the disciples were just like us, they forgot some things. And no doubt you've forgotten some things in your life and the disciples, they had forgotten some things and the Holy Spirit of God will remind them. I've mentioned this before and what a blessing it is and how important it is that we're in God's Word every day of our lives. Why? Because then the Holy Spirit of God can remind us of some biblical truth. You go through circumstances in your life, you have difficulties, you have somebody that brings up a question and because you've been in God's Word, because you've studied it and you've read it, then the Holy Spirit of God can remind you and can guide you and can teach you what you need to be able to say. What a blessing. But listen, if you're not in the Word, if there's nothing there, how's He gonna remind you of it? You never read it, I don't know it, I'm unaware of it. No, we're in the book, we're studying it, we're learning it, we're hearing it, we're reading it, and we're examining it and the Bible says that the Holy Spirit of God, that He's going to teach us all things and He's gonna bring all things to remembrance whatsoever I've said unto you. Notice in chapter 16, notice what the Lord says. In verse number 12 of John 16, Jesus says, I have yet many things to say unto you, but ye cannot bear them now. You know, I'm thankful that God has infinite wisdom. And I'm thankful that the Bible teaches us as newborn babes, desire the sincere milk of the Word that ye may grow thereby. And then you read where the Bible talks about strong meat in Hebrews chapter number five and six and you read over there and you understand that the Bible would teach us and give us the truth with regard to our spiritual diet and our spiritual growth. And it's interesting because in Hebrews chapter number five, He says this in verse number 11, of whom we have many things to say. Now listen, Jesus said, I have yet many things to say unto you, but ye cannot bear them now. He says that to the disciples in John 16 in verse number 12. And then I believe Paul wrote under the inspiration of the Holy Spirit of God, the book of Hebrews. And Paul says this to these that he's writing to, of whom we have many things to say and hard to be uttered. Why? Seeing your dull of hearing. For when for the time you ought to be teachers, you have need that one teach you again, which would be the first principles of the oracles of God and to become such as have need of milk and not of strong meat. For everyone that is, useth milk is unskillful in the word of righteousness for he is a babe, but strong meat belongeth to them that are full age. Even those by who, who by reason of use have their senses exercised to discern both good and evil. God and His infinite wisdom has determined how we grow as believers. Listen, I didn't know everything the day after I got saved that I know today. I didn't understand the day I trust that Christ is my savior, August 31st, 1997. I did not in that moment understand everything that happened in salvation. I didn't, I didn't understand it. And I'm sure that you didn't understand it either. And I didn't know about the words justified and reconciled and all of those things. I didn't know that he is our propitiation. I didn't know those Bible words. I wasn't familiar with those truths and I didn't understand the great transaction that took place. And then as I begin to grow in grace and the knowledge of our Lord and savior, Jesus Christ, I begin to learn more and more and more about what happened on that day that I got saved. And I learn more about my savior and we're growing. And notice the Bible says in John 16, verse 12, I have yet many things to say unto you, but you cannot bear them now. How be it when he, the spirit of truth, this is the Holy spirit, the Holy ghost is come. He will guide you into what's at say all truth for he shall not speak of himself, but whatsoever he shall hear that shall he speak. And he will show you what's at say things to come, huh? He's going to show us things to come. How's he going to show us things to come through his word, through his word. You know, it's interesting that Jesus said to the disciples in John 14, let not your heart be troubled. You believe in God, believe also in me and my father's house are many mansions. If it were not so, I would have told you, I go to prepare a place for you. And if I go, I will come again and receive you unto myself that where I am there you may be also. And so we find that there in John 14, verses one through three, Jesus was speaking about leaving, ascending to heaven after the, uh, the, the resurrection, the crucifixion and the resurrection, he'd ascend to heaven. And then he would come again. The timeline was unknown, but the disciples received that. And as you study the remainder of the, uh, the new Testament, as the books are written, as the revelation is given, we begin to understand about the rapture. We begin to understand about the second coming and we understand about the tribulation and about eternity, the millennial and so on and so forth. And we understand these things to come. What a glorious truth. The disciples in Acts chapter number one, before the ascension, they say, are you going to set up your kingdom? He says, it's not for you to know. Right? But then he begins to give us revelation and we have the whole canon of scripture. And one of the things that God shows us, I want you to make this connection this evening, is he will show you things to come. What is God showing Joseph in these dreams? Things to come. He's showing Joseph some things that are going to come to pass in Joseph's life and in the lives of his family. Of course, we understand the fulfillment because we know the account of the book of Genesis and we understand in the life of Joseph how that he would be sold into slavery and how he would take after being imprisoned and go and be second in command and all that would take place. We understand, we're familiar with the life of Joseph, but in this particular moment, I don't think Joseph understood all that these dreams meant. I don't think the brothers understood all that these dreams meant, but there was enough in the dreams to know. We're going to note here not only what God was revealing, but consider with me number two, what his family recognized. Through God giving these dreams, there was a recognition on the part of the brethren for sure. And we see also on the part of Israel or Jacob, we find that the Bible says, notice in verse number eight of Genesis 37, after Joseph shares that first dream with them in verse number seven, in verse number eight, notice what his brothers say, shalt thou indeed, notice what they say, reign over us. They recognized some of what this dream meant. They were picking up on the fact that his sheaf arose and then there it stood upright and then their sheaves stood round about and did obeisance. They were tracking, they were understanding. and they say, shalt thou indeed reign over us. Now, Joseph is younger than these boys, isn't he? We know that Benjamin is younger than Joseph, but the other 11 are older than Joseph. And culturally speaking, there's no way they're gonna bow down to their younger brother. And we find that the Bible says in verse number eight, or shalt thou indeed have dominion over us. Begin to recognize what God is revealing through these dreams. Notice what their response was that says, and we'll get to it in just a moment in its entirety, but they hated him yet the more for his dreams and his words. We know not only how the brothers responded or what they recognized there in verse number eight, but notice what his father, how his father, what he recognized, the Bible says that he told his father, this is with the second dream and his brethren, and his father rebuked him and said, notice what he says, what is this dream that thou hast dreamed? By the way, I'm not sure that Joseph could have concocted the dream himself. You know, you ever, you can't control what you dream, especially in the context of this dream with regard to God revealing to Joseph what was going to happen. We find that his father says, what is this dream that thou hast dreamed? Shall I and thy mother and thy brethren indeed come to bow down ourselves to thee, to the earth? I want you to see what they recognized. They recognized that God was revealing what was eventually gonna come to pass. I would submit to you this evening that they didn't like it. They didn't like it. And we note that in our third point this evening when we consider how his brothers responded, I've already made mention to verse number eight where the Bible says at the end of the verse that they hated him yet the more for his dreams and for his words. There are some Bible commentators, in fact, depending on the particular Bible that you have, if you have notes within your Bible that's a study Bible of some sort, if you read some commentaries, there are many commentators that give Joseph, I believe, disservice in this passage of Scripture and they say that Joseph was not right for telling his dreams. I don't see that in the text of Scripture. If you just read the Bible, I don't think that Joseph was wrong in telling the dreams. Joseph is making known to his brothers that which had been revealed to him and we find that the response of the brothers, they hate him. They hate him yet the more the Bible says for his dreams and for his words. Now remember, they already hated him so much that they could not speak peaceably unto him. I can't imagine this relationship getting any worse than what it was, but we find that it says yet the more. His brethren envied him according to verse number 11. The Bible tells us that his father observed the saying. Begin to think about this portion of Scripture and I've already tried to make some parallel as we've looked at some New Testament truth this evening and as we begin to understand how God is working in Joseph's life through these two dreams and what God is revealing, what he's making known that's going to come to pass, the reality this evening is that God has given us the Bible and he's given us the complete canon of Scripture and there's some things that you know as a child of God, someone that's been born again, someone that believes in the authority of this book, there's some things that you know about the future that other people don't know and God wants us to tell him. God wants us to tell him. God expects, in fact, God has commanded us to be witnesses. God has commanded us to go and to preach the gospel to every creature. God has commanded us and I look at the Scriptures and I look at the testimony of those that walked with the Lord Jesus Christ. I think about John in 1 John chapter number one if you want to turn there very quickly and I want you to notice what John says. It really is similar to what you read of the disciples in the book of Acts as they're testifying and as they're going forth and proclaiming the truth but we see it here in 1 John chapter number one. In 1 John chapter number one, the Bible says this, that beginning in verse number one, that which was from the beginning which we have heard, which we have seen with our eyes, which we have looked upon and our hands have handled of the word of life, for the life was manifested and we have seen it and bear witness and show unto you that eternal life which was with the Father and was manifested unto us. That which we have seen and heard, notice those next words, declare we unto you that you also may have fellowship with us and truly our fellowship is with the Father and with his son Jesus Christ. It's said this way in Acts four in verse number 20, the disciples say for we cannot but speak the things which we have seen and heard. Oh that God would give us a measure of that type of courage, a measure of that type of boldness that we would say and echo the words of John and of the disciples here in Acts chapter number four where we would say we cannot but speak the things which we have seen and heard. The Bible tells us about Elijah and we studied the life of Elijah, the beginning of his life this morning through providing an obvious example of God's care for his children, for his servants and you notice that as you study through the life of Elijah that you come to a place where God has revealed to Elijah some future events that are going to take place. The Bible tells us that Elijah's response to that is that he wept. In fact, the Bible says it this way, the man of God wept. What caused him to weep? Well that which had been revealed to him. I want you to begin to think about this evening as we would try to, yes, we understand the historical context of what God is doing through these dreams in Genesis chapter number 37 and we see what God was revealing, we see what was recognized, we see the response of his brothers in particular and their hatred for him but I want you to understand this evening that God has revealed truth to you and to me. He's given us truth. One day the trumpet of the Lord is going to sound. One day, every single person that we know is gonna stand before God Almighty. Is that true or not? One day, every single person that you know and that I know is gonna stand before God. The Bible describes for us two judgments. There's a judgment that's referred to as the bema seat or the judgment seat of Christ and that's the place where I'll stand. If you're saved tonight, that's the place that you'll stand. And thank God we won't stand at the other judgment but we'll stand at the bema seat of Christ. The Bible describes for us a judgment that is called the great white throne judgment. And at that judgment, again I'm thankful, I won't stand at that judgment. If you've been born again this evening, if you've been saved by the blood of Christ, you will not stand at the great white throne judgment. That's the authority of God's word, that's what God tells us. Who stands at that judgment? The lost, those that have rejected the Lord Jesus Christ. And the Bible tells us that at that judgment that death and hell are cast into the lake of fire, this is the second death. Revelation 20, 11 through 15 reveals that to us of the great white throne judgment. What a sad day, what a sad judgment. I would submit to you this evening that God has revealed that to us, he's made that known to us. Remember the Holy Spirit, John 16, Jesus said I have many things to say but you're not ready for it yet but the spirit is going to come, the spirit of truth. And when the spirit of truth shall come, he will guide you into all truth and he will show you things to come. Things to come. The great white throne judgment is not the next thing to come on God's prophetic calendar. In fact, there are many things that will take place before the great white throne judgment. If you're to very quickly understand the prophetic calendar of God that is revealed to us in his word, the next event is the rapture. And then after the rapture, there's seven years of tribulation. And just looking at the high points after the seven years of tribulation, you'd find that there's the millennial reign of Christ. And then after the millennial reign of Christ is when you read of the great white throne judgment. Those are just hitting the high points very quickly in the book of Revelation. There are many other events that are described that we could look to, but you find that those are the high points on God's prophetic calendar. But what I'm saying to you this evening is that God's revealed that to us. But why has he revealed it to us? So that we tell somebody, so they could be prepared. But here's what I would submit to you this evening. Sometimes they're gonna respond to you the same way that the 11 brothers responded to Joseph. With hatred. With hatred. With animosity. With unkindness. With whatever other word you wanna use to describe it. But we find that, listen, the God of this world hath blinded the minds of them which believe not. We're engaged in spiritual warfare and spiritual battle. And listen, people don't like hearing the truth. And there are many times we find today. that people have believed a lie. And they've believed it so much that there's no room for the truth. And they can get so angry at you or at me as the messenger. The brothers were so angry with Joseph, and even his father rebuked him for the dream. I've been told so many things over the years and I try to share truth with people. I remember hearing somebody say, oh, two things you should never talk about, politics and religion. How many ever heard somebody say that? Can I tell you, here's what I believe, and I'm only 42 years old, but here's what I believe, that if we didn't believe that about 70 years ago, our world would be different today. But about 70 years ago, it was commonly believed that it wasn't appropriate to talk about politics and religion, and so we stopped talking about those two subjects and we probably wouldn't be in the mess that we're in today if we would've kept talking about politics and religion. I'm not preaching politics tonight, I'm just saying that we took those two things out and said, no, you can't talk about those two things. I'd much rather talk about, and it's not religion, it's a relationship with the Lord Jesus Christ. Man, we need to talk about Jesus and to tell others why, because they're gonna stand before God one day. Here's what God says to Ezekiel. I've called you to be a watchman. I've called you to be a watchman. You can read it in chapter three and then again in chapter 33, and God says to Ezekiel that you give them warning. And if you warn them, you've done your part. How they respond to the warning, that's completely on them. But you warn them, you warn them. If the watchman fails to sound the horn, the trumpet, and danger is coming, then the responsibility falls upon the watchman. And I wanna remind you of what the Apostle Paul said in Acts chapter number 20, and we'll close with this tonight. Listen, Paul was a man that knew the Old Testament. Paul knew the Old Testament. Paul was trained, learned at the feet of Gamaliel. He was learned. And then he got born again, hallelujah. Because as religious as he was and as zealous as he was, he was lost, but in Acts 9, he got saved. And we come to Acts chapter number 20, and we find that Paul is preaching and he's giving the truth. And here in Acts chapter number 20, he comes and he's called the Ephesian church leaders together to be able to speak with them. And I want you to notice in verse number 24, he says, but none of these things move me, neither count I my life dear unto myself, so that I might finish my course with joy in the ministry which I have received of the Lord Jesus to testify the gospel of the grace of God. And now behold, I know that ye all, among whom I have gone preaching the kingdom of God, shall see my face no more. Wherefore, I take you to record this day, notice what Paul says, that I am pure from the blood of all men. Why does he say that? Notice verse 27, for I have not shunned to declare unto you all the counsel of God. He says, I'm gonna skip down for sake of time in verse 31. He says, therefore, watch and remember that by the space of three years, notice how he describes this, I ceased not to what? To warn everyone night and day with tears. Paul, why did you have tears? Because there was something that Paul understood that God had revealed to him that was going to take place. And this evening, when we look at this account from Genesis 37, you say, man, I didn't expect all this tonight. Some dreams of Joseph and what God was revealing to Joseph about some future events in the life of Joseph and his family as God's people. I no longer need a dream or a vision. I have God's completed book, the Bible. And in God's completed book, the Bible, he has given me truth concerning things to come. And oh, that God would give us a passion to tell someone else about these things to come. Because many people, they have no idea. They're just living life, let come what may. What's gonna happen when we die? I have no idea, I'll think about it then. No, no, that's the wrong answer. It's too late then, it's too late. Philippians tells us that every knee shall bow and every tongue shall confess. That is going to happen. How much better for it to happen on this side of eternity and to forever be with the Lord? This evening, we see the dreams of Joseph. We don't need to have a dream, we just need to read the book. As we read the book, God reveals to us and then it's our responsibility to tell some other people about what's going to happen, what's gonna happen. You know, there's people who run around, what's gonna happen with this and what's gonna happen with that and how's this gonna work and what's this gonna do? People have lost their way. I got an email yesterday, there's a church overseas that they decided to have a full service guided and directed by chat GPT. That's nonsense. We got the Bible. We don't need artificial intelligence. We got God's word. People have lost their way. They have no idea and yet we have God's authoritative word. Oh, that God would give us boldness and courage. I think Joseph had to have a lot of boldness and courage to tell his brothers what he dreamed. Do you remember when Samuel received the revelation from God? As soon as he woke up in the morning, I think Samuel tried to get busy and Eli said, Samuel, Samuel, what did God say to you? That was the last question he wanted to be asked and Eli says, tell me all of it. Hide nothing from me. I understand that Joseph needed to have some courage and some boldness and so do we. Here's the wonderful truth. You know what Jesus said? All power is given unto me in heaven and earth and then he said this, I'll be with you. I'll be with you. He'll give us that courage and that boldness. Oh, that God would give us the right disposition to be able to give the truth in love, to let people know, listen, I'm telling you this because I care about you, because I love you, because I want you to know the truth because one day, you're gonna stand before God. Let's pray together. Father, we love you. We thank you for loving us. I thank you for the Bible. Thank you for the life of Joseph and his courage and boldness to share these dreams. As you revealed to him, to his brethren, the things that were going to happen, I thank you this evening that you've given us the whole Bible and I pray that as we have the opportunity to be students of your word, to attend a church that faithfully preaches your word, God, you said to whom much is given, much is required and I pray that you'd help us to go on the power of the Holy Spirit of God, help us to go with boldness and courage and love to a lost and dying world of things to come. Every single person that we know one day will stand before you. God, would you help us to be mindful of that truth as we go throughout our week, as we interact with individuals, help us to not be intimidated by their position, by their possessions, by any status that they might have but Lord, help us to go in the power of the Holy Spirit. I pray that you'd use us for your honor and for your glory. I pray that you'd move during this time of invitation. Lord, maybe you've convicted some, challenged some. Lord, I pray that we'd be responsive to your word tonight. We'll thank you for every decision that's made for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano tonight and maybe you wanna come to this old fashioned altar. Maybe you wanna thank God that he's given you his word, that he saved your soul. Maybe this evening you wanna come and commit to the Lord that you with his power, with his help, are determining that you wanna be a witness and tell others of things to come. As Kimberly plays, the altar is open. ♪ Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh ♪",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.299999952316284,
      "text": " a great song this evening to be able to sing."
    },
    {
      "id": 1,
      "start": 3.640000104904175,
      "end": 5.800000190734863,
      "text": " Thank the Lord for the old hymns of the faith."
    },
    {
      "id": 2,
      "start": 5.800000190734863,
      "end": 9.84000015258789,
      "text": " Amen. And what a blessing how they encourage us and strengthen us"
    },
    {
      "id": 3,
      "start": 9.84000015258789,
      "end": 12.979999542236328,
      "text": " and prepare us for the truth from his word."
    },
    {
      "id": 4,
      "start": 12.979999542236328,
      "end": 14.279999732971191,
      "text": " Genesis chapter 37."
    },
    {
      "id": 5,
      "start": 14.279999732971191,
      "end": 18.1200008392334,
      "text": " A couple of weeks ago, we had an introduction to the life of Joseph."
    },
    {
      "id": 6,
      "start": 18.1200008392334,
      "end": 22.920000076293945,
      "text": " We looked at the first few verses here of Genesis chapter 37, verses one through four."
    },
    {
      "id": 7,
      "start": 23.1200008392334,
      "end": 28.31999969482422,
      "text": " And in that introductory message, we noted some aspects of Joseph's childhood."
    },
    {
      "id": 8,
      "start": 28.579999923706055,
      "end": 31.280000686645508,
      "text": " And then we examined some aspects of his character."
    },
    {
      "id": 9,
      "start": 31.280000686645508,
      "end": 36.15999984741211,
      "text": " And we noted that though Joseph was a young man, he was a man of character."
    },
    {
      "id": 10,
      "start": 36.36000061035156,
      "end": 39.619998931884766,
      "text": " And I'm thankful for some people of character."
    },
    {
      "id": 11,
      "start": 39.619998931884766,
      "end": 43.060001373291016,
      "text": " I'm thankful for young people that have character."
    },
    {
      "id": 12,
      "start": 43.2599983215332,
      "end": 48.20000076293945,
      "text": " And character is so important in our society today."
    },
    {
      "id": 13,
      "start": 48.20000076293945,
      "end": 50.84000015258789,
      "text": " We find in many places that it's lacking."
    },
    {
      "id": 14,
      "start": 51.29999923706055,
      "end": 53.939998626708984,
      "text": " But what a blessing to have young people of character."
    },
    {
      "id": 15,
      "start": 53.939998626708984,
      "end": 56.13999938964844,
      "text": " Joseph was a man of character."
    },
    {
      "id": 16,
      "start": 56.15999984741211,
      "end": 59.040000915527344,
      "text": " As we study through Genesis chapter number 37 again,"
    },
    {
      "id": 17,
      "start": 59.599998474121094,
      "end": 63.599998474121094,
      "text": " not much is mentioned specifically about the childhood of Joseph."
    },
    {
      "id": 18,
      "start": 63.599998474121094,
      "end": 65.77999877929688,
      "text": " There's just a few aspects that we're able to go to."
    },
    {
      "id": 19,
      "start": 66.04000091552734,
      "end": 69.33999633789062,
      "text": " And then we read of that event last time that we looked at the start,"
    },
    {
      "id": 20,
      "start": 69.33999633789062,
      "end": 73.81999969482422,
      "text": " Genesis 37, where he's there and he's working with his brothers there."
    },
    {
      "id": 21,
      "start": 74.27999877929688,
      "end": 77.26000213623047,
      "text": " And what have you, as we looked in verse number two and three"
    },
    {
      "id": 22,
      "start": 77.76000213623047,
      "end": 79.08000183105469,
      "text": " and all that was going on."
    },
    {
      "id": 23,
      "start": 79.08000183105469,
      "end": 85.16000366210938,
      "text": " And then we find the very next event that is dealt with are the dreams of Joseph."
    },
    {
      "id": 24,
      "start": 85.16000366210938,
      "end": 88.05999755859375,
      "text": " And I've simply titled the message this evening,"
    },
    {
      "id": 25,
      "start": 88.05999755859375,
      "end": 92.81999969482422,
      "text": " the dreams of Joseph from Genesis 37, verses five through 11."
    },
    {
      "id": 26,
      "start": 93.45999908447266,
      "end": 96.69999694824219,
      "text": " Notice with me and let me just remind you"
    },
    {
      "id": 27,
      "start": 96.9000015258789,
      "end": 100.54000091552734,
      "text": " that Joseph was hated by his brothers."
    },
    {
      "id": 28,
      "start": 100.80000305175781,
      "end": 103.54000091552734,
      "text": " Remember, Joseph was the favorite."
    },
    {
      "id": 29,
      "start": 103.54000091552734,
      "end": 105.5999984741211,
      "text": " We talked about the dysfunctional family."
    },
    {
      "id": 30,
      "start": 105.5999984741211,
      "end": 107.13999938964844,
      "text": " The Bible tells us in verse number three."
    },
    {
      "id": 31,
      "start": 107.13999938964844,
      "end": 111.73999786376953,
      "text": " Now, Israel, the father there, Israel loved Joseph more than all his children"
    },
    {
      "id": 32,
      "start": 112.0199966430664,
      "end": 113.72000122070312,
      "text": " because he was the son of his old age."
    },
    {
      "id": 33,
      "start": 113.72000122070312,
      "end": 115.62000274658203,
      "text": " And he made him a coat of many colors."
    },
    {
      "id": 34,
      "start": 115.62000274658203,
      "end": 120.41999816894531,
      "text": " And so every time they would see Joseph wearing that coat, it was a reminder"
    },
    {
      "id": 35,
      "start": 120.62000274658203,
      "end": 123.9800033569336,
      "text": " not only as to the love that Jacob had for him,"
    },
    {
      "id": 36,
      "start": 124.16000366210938,
      "end": 128.4199981689453,
      "text": " but also the position in which Joseph would have as being heir."
    },
    {
      "id": 37,
      "start": 128.89999389648438,
      "end": 132.32000732421875,
      "text": " And we find that it caused the brothers great distress."
    },
    {
      "id": 38,
      "start": 132.32000732421875,
      "end": 136.05999755859375,
      "text": " It says in verse four, when his brethren saw that their father loved him"
    },
    {
      "id": 39,
      "start": 136.05999755859375,
      "end": 137.5399932861328,
      "text": " more than all his brethren."
    },
    {
      "id": 40,
      "start": 137.5399932861328,
      "end": 142.8000030517578,
      "text": " Notice the Bible says that they hated him and could not speak peaceably unto him."
    },
    {
      "id": 41,
      "start": 143.02000427246094,
      "end": 145.66000366210938,
      "text": " And if you think it couldn't get worse, it does."
    },
    {
      "id": 42,
      "start": 145.9199981689453,
      "end": 148.25999450683594,
      "text": " In verse number five, the Bible says this."
    },
    {
      "id": 43,
      "start": 148.25999450683594,
      "end": 153.25999450683594,
      "text": " And Joseph dreamed a dream and he told it his brethren notice"
    },
    {
      "id": 44,
      "start": 153.25999450683594,
      "end": 156.36000061035156,
      "text": " and they hated him yet the more."
    },
    {
      "id": 45,
      "start": 157.63999938964844,
      "end": 160.5399932861328,
      "text": " They already hated him and could not speak peaceably unto him."
    },
    {
      "id": 46,
      "start": 160.77999877929688,
      "end": 162.94000244140625,
      "text": " According to verse number four, they hear the dream"
    },
    {
      "id": 47,
      "start": 162.94000244140625,
      "end": 165.74000549316406,
      "text": " and the Bible says that they hated him yet the more he said unto them"
    },
    {
      "id": 48,
      "start": 165.74000549316406,
      "end": 166.52000427246094,
      "text": " in verse number six."
    },
    {
      "id": 49,
      "start": 166.52000427246094,
      "end": 168.8800048828125,
      "text": " Here, I pray you this dream, which I have dreamed."
    },
    {
      "id": 50,
      "start": 169.17999267578125,
      "end": 172.0800018310547,
      "text": " For behold, we were binding sheaves in the field and low."
    },
    {
      "id": 51,
      "start": 172.1999969482422,
      "end": 174.39999389648438,
      "text": " My sheaf arose and also stood upright."
    },
    {
      "id": 52,
      "start": 174.39999389648438,
      "end": 178.97999572753906,
      "text": " Behold, your sheaves stood round about and made obeisance to my sheaf"
    },
    {
      "id": 53,
      "start": 179.27999877929688,
      "end": 182.5399932861328,
      "text": " and his brethren said unto him, Shout thou indeed reign over us"
    },
    {
      "id": 54,
      "start": 182.5399932861328,
      "end": 185.77999877929688,
      "text": " or shout thou indeed have dominion over us."
    },
    {
      "id": 55,
      "start": 186.0399932861328,
      "end": 191.1199951171875,
      "text": " And they hated him yet the more for his dreams and for his words."
    },
    {
      "id": 56,
      "start": 191.72000122070312,
      "end": 194.52000427246094,
      "text": " And he dreamed yet another dream and told it his brethren and said,"
    },
    {
      "id": 57,
      "start": 194.52000427246094,
      "end": 196.52000427246094,
      "text": " Behold, I have dreamed a dream more."
    },
    {
      "id": 58,
      "start": 196.52000427246094,
      "end": 200.72000122070312,
      "text": " And behold, the sun and the moon and the eleven stars made obedience to me."
    },
    {
      "id": 59,
      "start": 200.74000549316406,
      "end": 204.97999572753906,
      "text": " And he told it to his father and to his brethren and his father rebuked him"
    },
    {
      "id": 60,
      "start": 204.97999572753906,
      "end": 207.94000244140625,
      "text": " and said unto him, What is this dream that thou hast dreamed?"
    },
    {
      "id": 61,
      "start": 208.4199981689453,
      "end": 213.0800018310547,
      "text": " Shall I and thy mother and thy brethren indeed come to bow down ourselves"
    },
    {
      "id": 62,
      "start": 213.0800018310547,
      "end": 214.32000732421875,
      "text": " to thee, to the earth?"
    },
    {
      "id": 63,
      "start": 214.86000061035156,
      "end": 219.5800018310547,
      "text": " And his brethren envied him, but his father observed the saying."
    },
    {
      "id": 64,
      "start": 219.5800018310547,
      "end": 221.9600067138672,
      "text": " As we look at this portion of Scripture, I want you to consider"
    },
    {
      "id": 65,
      "start": 222.1999969482422,
      "end": 223.75999450683594,
      "text": " three thoughts with me this evening."
    },
    {
      "id": 66,
      "start": 223.75999450683594,
      "end": 226.55999755859375,
      "text": " We'll seek to make some application as we get to the end of the message"
    },
    {
      "id": 67,
      "start": 226.55999755859375,
      "end": 230.60000610351562,
      "text": " this evening, but consider with me, first of all, what God was revealing."
    },
    {
      "id": 68,
      "start": 230.8000030517578,
      "end": 232.36000061035156,
      "text": " Consider what God was revealing."
    },
    {
      "id": 69,
      "start": 232.36000061035156,
      "end": 235.0800018310547,
      "text": " There are two dreams that are mentioned here that Joseph has."
    },
    {
      "id": 70,
      "start": 235.3000030517578,
      "end": 238.4600067138672,
      "text": " And the first dream is outlined for us in verses five through seven."
    },
    {
      "id": 71,
      "start": 239.16000366210938,
      "end": 241.0399932861328,
      "text": " We understand that in this first dream,"
    },
    {
      "id": 72,
      "start": 241.0399932861328,
      "end": 245.5800018310547,
      "text": " but it's specifically dealing with Joseph and his brethren, the eleven brothers."
    },
    {
      "id": 73,
      "start": 245.74000549316406,
      "end": 249.32000732421875,
      "text": " And in this first dream, we find the Bible says that they're binding sheaves"
    },
    {
      "id": 74,
      "start": 249.32000732421875,
      "end": 251.66000366210938,
      "text": " in the field. This is the dream that Joseph has."
    },
    {
      "id": 75,
      "start": 251.66000366210938,
      "end": 256.260009765625,
      "text": " And his sheaf arose and stood upright and their sheaves"
    },
    {
      "id": 76,
      "start": 256.260009765625,
      "end": 259.9599914550781,
      "text": " all stood round about and did obeisance."
    },
    {
      "id": 77,
      "start": 260.1000061035156,
      "end": 263.7799987792969,
      "text": " And we begin to consider what God was revealing to Joseph"
    },
    {
      "id": 78,
      "start": 263.7799987792969,
      "end": 265.44000244140625,
      "text": " through this, his first dream."
    },
    {
      "id": 79,
      "start": 265.44000244140625,
      "end": 269.0400085449219,
      "text": " And he shares that dream and it's understood what's taking place."
    },
    {
      "id": 80,
      "start": 269.0400085449219,
      "end": 271.8399963378906,
      "text": " And then Joseph has a second dream."
    },
    {
      "id": 81,
      "start": 272.0400085449219,
      "end": 276.2200012207031,
      "text": " That second dream is outlined for us in verse number nine, as we read a moment ago."
    },
    {
      "id": 82,
      "start": 276.3800048828125,
      "end": 280.6600036621094,
      "text": " And in this particular dream, it's not just the eleven brethren."
    },
    {
      "id": 83,
      "start": 280.6600036621094,
      "end": 282.7200012207031,
      "text": " It's also mother and father."
    },
    {
      "id": 84,
      "start": 282.8599853515625,
      "end": 286.05999755859375,
      "text": " And we would understand that Rachel has died."
    },
    {
      "id": 85,
      "start": 286.05999755859375,
      "end": 289.260009765625,
      "text": " And so no doubt this would be a reference to Leah."
    },
    {
      "id": 86,
      "start": 289.70001220703125,
      "end": 292.3599853515625,
      "text": " In this particular text and dealing with that."
    },
    {
      "id": 87,
      "start": 292.55999755859375,
      "end": 298.0,
      "text": " And we find that now he says that the sun and the moon and the eleven stars"
    },
    {
      "id": 88,
      "start": 298.0,
      "end": 302.7799987792969,
      "text": " representing the eleven brothers did made obeisance to him"
    },
    {
      "id": 89,
      "start": 303.239990234375,
      "end": 307.2200012207031,
      "text": " and begin to think about what God was revealing, what God was making known"
    },
    {
      "id": 90,
      "start": 307.2200012207031,
      "end": 311.5799865722656,
      "text": " to Joseph, what was to come to pass in Joseph's life."
    },
    {
      "id": 91,
      "start": 311.9200134277344,
      "end": 315.5799865722656,
      "text": " He was making known to Joseph the future events"
    },
    {
      "id": 92,
      "start": 315.5799865722656,
      "end": 318.9200134277344,
      "text": " that would take place in Joseph's life and how those"
    },
    {
      "id": 93,
      "start": 319.5,
      "end": 322.6199951171875,
      "text": " how it would relate with his brothers and so on and so forth."
    },
    {
      "id": 94,
      "start": 322.82000732421875,
      "end": 326.5400085449219,
      "text": " And we find that these dreams are given by the Lord."
    },
    {
      "id": 95,
      "start": 326.55999755859375,
      "end": 329.79998779296875,
      "text": " Now, we understand that prior to the Bible being completed,"
    },
    {
      "id": 96,
      "start": 330.0,
      "end": 334.739990234375,
      "text": " that there are many examples in God's word of those that receive revelation"
    },
    {
      "id": 97,
      "start": 334.739990234375,
      "end": 337.44000244140625,
      "text": " from God through dreams or visions."
    },
    {
      "id": 98,
      "start": 337.67999267578125,
      "end": 340.1199951171875,
      "text": " And we can read of that and we can understand that."
    },
    {
      "id": 99,
      "start": 340.1199951171875,
      "end": 344.67999267578125,
      "text": " We can see within the context of Scripture how that God would be revealing"
    },
    {
      "id": 100,
      "start": 344.70001220703125,
      "end": 349.8800048828125,
      "text": " things, events, future happenings through dreams and visions."
    },
    {
      "id": 101,
      "start": 350.0799865722656,
      "end": 353.1199951171875,
      "text": " We've been studying the life of Samuel in Sunday school."
    },
    {
      "id": 102,
      "start": 353.1199951171875,
      "end": 355.9800109863281,
      "text": " And as we're studying through his life and we're mindful of the fact"
    },
    {
      "id": 103,
      "start": 355.9800109863281,
      "end": 360.0799865722656,
      "text": " that the Lord is calling to Samuel, there's no vision in that time."
    },
    {
      "id": 104,
      "start": 360.0799865722656,
      "end": 362.9599914550781,
      "text": " There's no open revelation from the Lord."
    },
    {
      "id": 105,
      "start": 362.9599914550781,
      "end": 365.1000061035156,
      "text": " And God calls to Samuel."
    },
    {
      "id": 106,
      "start": 365.20001220703125,
      "end": 368.29998779296875,
      "text": " And we've mentioned this before, but we dealt with it in Sunday school"
    },
    {
      "id": 107,
      "start": 368.29998779296875,
      "end": 373.260009765625,
      "text": " that Samuel is instructed by Eli to say, speak, Lord,"
    },
    {
      "id": 108,
      "start": 373.2799987792969,
      "end": 375.32000732421875,
      "text": " for thy servant heareth."
    },
    {
      "id": 109,
      "start": 375.32000732421875,
      "end": 380.1000061035156,
      "text": " And we find that Samuel obeys the instruction that Eli provided."
    },
    {
      "id": 110,
      "start": 380.29998779296875,
      "end": 383.79998779296875,
      "text": " And he said, speak for thy servant hereth, according to First Samuel"
    },
    {
      "id": 111,
      "start": 383.79998779296875,
      "end": 385.3999938964844,
      "text": " three in verse number ten."
    },
    {
      "id": 112,
      "start": 385.3999938964844,
      "end": 390.8999938964844,
      "text": " And there God speaks to Samuel and says, I will do a thing in Israel."
    },
    {
      "id": 113,
      "start": 391.1000061035156,
      "end": 397.2799987792969,
      "text": " And he reveals to Samuel what he God is going to do in the future."
    },
    {
      "id": 114,
      "start": 397.4800109863281,
      "end": 399.5799865722656,
      "text": " And we find that God would work."
    },
    {
      "id": 115,
      "start": 399.5799865722656,
      "end": 402.7200012207031,
      "text": " And there are many other examples that we could look to this evening"
    },
    {
      "id": 116,
      "start": 402.8800048828125,
      "end": 408.17999267578125,
      "text": " with regard to God revealing to his people his plans"
    },
    {
      "id": 117,
      "start": 408.17999267578125,
      "end": 412.6600036621094,
      "text": " with regard to the future, using dreams and visions."
    },
    {
      "id": 118,
      "start": 412.9200134277344,
      "end": 416.1600036621094,
      "text": " Now, understand that those dreams and visions"
    },
    {
      "id": 119,
      "start": 416.3999938964844,
      "end": 420.32000732421875,
      "text": " never equate to having salvation."
    },
    {
      "id": 120,
      "start": 420.6199951171875,
      "end": 425.260009765625,
      "text": " And there's a circumstance today that people talk about receiving dreams"
    },
    {
      "id": 121,
      "start": 425.260009765625,
      "end": 427.5400085449219,
      "text": " and visions and so on and so forth."
    },
    {
      "id": 122,
      "start": 427.5400085449219,
      "end": 431.3800048828125,
      "text": " And I've had conversation with people in various times"
    },
    {
      "id": 123,
      "start": 431.3999938964844,
      "end": 434.29998779296875,
      "text": " where I'd ask them if they're going to heaven when they die."
    },
    {
      "id": 124,
      "start": 434.29998779296875,
      "end": 437.29998779296875,
      "text": " And I get a variety of answers when I ask that question."
    },
    {
      "id": 125,
      "start": 437.29998779296875,
      "end": 439.739990234375,
      "text": " And some say yes, because they've been baptized."
    },
    {
      "id": 126,
      "start": 439.739990234375,
      "end": 442.44000244140625,
      "text": " Some say yes, because they have spoken in tongues."
    },
    {
      "id": 127,
      "start": 442.44000244140625,
      "end": 446.5199890136719,
      "text": " And some say yes, because they're part of some church and so on and so forth."
    },
    {
      "id": 128,
      "start": 446.5199890136719,
      "end": 450.0199890136719,
      "text": " And because I'm a good person and I hope so and I'm doing the best that I can."
    },
    {
      "id": 129,
      "start": 450.260009765625,
      "end": 452.5799865722656,
      "text": " And some have said, yes, I've been born again."
    },
    {
      "id": 130,
      "start": 452.5799865722656,
      "end": 455.70001220703125,
      "text": " I've trusted the Lord Jesus Christ as my personal savior."
    },
    {
      "id": 131,
      "start": 455.8599853515625,
      "end": 458.29998779296875,
      "text": " I've been saved. I've been born again."
    },
    {
      "id": 132,
      "start": 458.29998779296875,
      "end": 460.5,
      "text": " And hallelujah. When that answer comes."
    },
    {
      "id": 133,
      "start": 460.5199890136719,
      "end": 463.55999755859375,
      "text": " Some, however, have told me at different times in my life"
    },
    {
      "id": 134,
      "start": 463.760009765625,
      "end": 466.9200134277344,
      "text": " that they've seen a vision, they've had a dream,"
    },
    {
      "id": 135,
      "start": 466.9200134277344,
      "end": 469.9599914550781,
      "text": " and that's why they believe they're going to heaven."
    },
    {
      "id": 136,
      "start": 470.20001220703125,
      "end": 473.20001220703125,
      "text": " Whenever that happens, I immediately go to Acts chapter number 10"
    },
    {
      "id": 137,
      "start": 473.20001220703125,
      "end": 475.1400146484375,
      "text": " and talk about a man by the name of Cornelius."
    },
    {
      "id": 138,
      "start": 475.3999938964844,
      "end": 478.0400085449219,
      "text": " And Cornelius was a man that was a religious man."
    },
    {
      "id": 139,
      "start": 478.0400085449219,
      "end": 480.1000061035156,
      "text": " But Cornelius was a man that was lost."
    },
    {
      "id": 140,
      "start": 480.5799865722656,
      "end": 482.3800048828125,
      "text": " He was a man that prayed fervently."
    },
    {
      "id": 141,
      "start": 482.3800048828125,
      "end": 485.3800048828125,
      "text": " He was religious, but he was lost."
    },
    {
      "id": 142,
      "start": 485.8800048828125,
      "end": 488.2799987792969,
      "text": " And God allowed for a vision to be given."
    },
    {
      "id": 143,
      "start": 488.2799987792969,
      "end": 490.5,
      "text": " And God spoke to Cornelius."
    },
    {
      "id": 144,
      "start": 490.5,
      "end": 494.0400085449219,
      "text": " And what God said to Cornelius was to go and get Peter."
    },
    {
      "id": 145,
      "start": 494.20001220703125,
      "end": 497.6400146484375,
      "text": " And Peter would give him the words that he needed to have."
    },
    {
      "id": 146,
      "start": 497.79998779296875,
      "end": 500.44000244140625,
      "text": " In other words, Peter would come and give him the gospel."
    },
    {
      "id": 147,
      "start": 500.67999267578125,
      "end": 502.8399963378906,
      "text": " And if you read the record of Acts chapter number 10,"
    },
    {
      "id": 148,
      "start": 502.8399963378906,
      "end": 507.1600036621094,
      "text": " and then as it's rehearsed before the the Jews there in Jerusalem"
    },
    {
      "id": 149,
      "start": 507.1600036621094,
      "end": 511.4599914550781,
      "text": " by Peter to them in chapter number 11, you'll find that Peter shows up"
    },
    {
      "id": 150,
      "start": 511.6000061035156,
      "end": 515.2000122070312,
      "text": " and Peter preaches the gospel and then Cornelius"
    },
    {
      "id": 151,
      "start": 515.2000122070312,
      "end": 517.7999877929688,
      "text": " and all that were gathered there, they get saved."
    },
    {
      "id": 152,
      "start": 518.3599853515625,
      "end": 521.4000244140625,
      "text": " At the preaching of the gospel, not because of a vision or a dream."
    },
    {
      "id": 153,
      "start": 521.760009765625,
      "end": 526.1599731445312,
      "text": " And so we see that in this vision, this just these dreams that Joseph is having."
    },
    {
      "id": 154,
      "start": 526.760009765625,
      "end": 529.5999755859375,
      "text": " The two that are recorded here in our text of Scripture"
    },
    {
      "id": 155,
      "start": 529.5999755859375,
      "end": 533.9600219726562,
      "text": " that God is making known to Joseph what is going to come to pass."
    },
    {
      "id": 156,
      "start": 534.1599731445312,
      "end": 537.8800048828125,
      "text": " Now, we understand that God has given us a complete canon of Scripture."
    },
    {
      "id": 157,
      "start": 538.0800170898438,
      "end": 540.0,
      "text": " God's given us his word."
    },
    {
      "id": 158,
      "start": 540.0,
      "end": 546.5999755859375,
      "text": " And I'm so thankful this evening to have the word of God in its complete form"
    },
    {
      "id": 159,
      "start": 546.760009765625,
      "end": 549.1599731445312,
      "text": " and that we can rejoice that we have all of it."
    },
    {
      "id": 160,
      "start": 549.1599731445312,
      "end": 551.1599731445312,
      "text": " You know, there are some people on the earth today"
    },
    {
      "id": 161,
      "start": 551.3599853515625,
      "end": 555.9600219726562,
      "text": " that do not have any portion of this book in their own language."
    },
    {
      "id": 162,
      "start": 556.239990234375,
      "end": 560.280029296875,
      "text": " It's just simply not available to them in their language."
    },
    {
      "id": 163,
      "start": 560.4400024414062,
      "end": 563.3200073242188,
      "text": " There are some groups of people that in their own language,"
    },
    {
      "id": 164,
      "start": 563.3200073242188,
      "end": 565.6400146484375,
      "text": " all they have is the New Testament."
    },
    {
      "id": 165,
      "start": 565.9199829101562,
      "end": 569.280029296875,
      "text": " Now, understand that the New Testament is better than having nothing."
    },
    {
      "id": 166,
      "start": 569.47998046875,
      "end": 573.280029296875,
      "text": " But, you know, as we study our Bibles, as we read through the Scriptures,"
    },
    {
      "id": 167,
      "start": 573.47998046875,
      "end": 576.280029296875,
      "text": " can you imagine if all we had was the New Testament?"
    },
    {
      "id": 168,
      "start": 576.47998046875,
      "end": 580.4000244140625,
      "text": " How much we would miss from not having the Old Testament?"
    },
    {
      "id": 169,
      "start": 580.5599975585938,
      "end": 583.4400024414062,
      "text": " I know there's some people today that say, well, we're New Testament believers."
    },
    {
      "id": 170,
      "start": 583.4400024414062,
      "end": 585.0399780273438,
      "text": " We really don't need the Old Testament."
    },
    {
      "id": 171,
      "start": 585.0399780273438,
      "end": 586.4400024414062,
      "text": " They are mistaken."
    },
    {
      "id": 172,
      "start": 586.4400024414062,
      "end": 589.8400268554688,
      "text": " And they have not understood that even the New Testament itself says"
    },
    {
      "id": 173,
      "start": 589.8400268554688,
      "end": 592.9199829101562,
      "text": " of the Old Testament that it is written for our learning."
    },
    {
      "id": 174,
      "start": 592.9199829101562,
      "end": 595.0399780273438,
      "text": " It is written for our admonition."
    },
    {
      "id": 175,
      "start": 595.0399780273438,
      "end": 597.1599731445312,
      "text": " And here's what Paul says in the book of Hebrews,"
    },
    {
      "id": 176,
      "start": 597.1599731445312,
      "end": 599.9600219726562,
      "text": " that the law having a shadow of good things."
    },
    {
      "id": 0,
      "start": 599.9600219726562,
      "end": 604.2000217437744,
      "text": " to come. And if you don't understand, if you don't have the Old Testament, how are you"
    },
    {
      "id": 1,
      "start": 604.2000217437744,
      "end": 609.4400215148926,
      "text": " understanding the book of Hebrews? I mean it's almost going to be impossible to understand"
    },
    {
      "id": 2,
      "start": 609.4400215148926,
      "end": 614.3600215911865,
      "text": " the book of Hebrews if you do not have the Old Testament and understanding all that the"
    },
    {
      "id": 3,
      "start": 614.3600215911865,
      "end": 620.0400218963623,
      "text": " Jews and the practices with regard to the offerings and the sacrifices and what have"
    },
    {
      "id": 4,
      "start": 620.0400218963623,
      "end": 626.560022354126,
      "text": " you. And we find that God has graciously given us the whole Bible. And what a blessing that"
    },
    {
      "id": 5,
      "start": 626.560022354126,
      "end": 633.200023651123,
      "text": " is. And we find that today God is no longer speaking to us in dreams and visions and it's"
    },
    {
      "id": 6,
      "start": 633.200023651123,
      "end": 638.1600227355957,
      "text": " not that we need to try to have some dream or some vision to understand some future event."
    },
    {
      "id": 7,
      "start": 638.1600227355957,
      "end": 643.4400215148926,
      "text": " No, God is speaking to us through His Word. And by the way, in His Word He's told us about"
    },
    {
      "id": 8,
      "start": 643.4400215148926,
      "end": 649.200023651123,
      "text": " some future events. He's told us about some future events that will come to pass. We don't"
    },
    {
      "id": 9,
      "start": 649.200023651123,
      "end": 653.5200233459473,
      "text": " know the particular times of some of these events, but we know that they're going to"
    },
    {
      "id": 10,
      "start": 653.5200233459473,
      "end": 658.2400207519531,
      "text": " come to pass. I want you to notice with me, keep your place here, we'll be back in Genesis"
    },
    {
      "id": 11,
      "start": 658.2400207519531,
      "end": 662.3600234985352,
      "text": " in just a moment, but go to the Gospel of John if you will. In John chapter number 14,"
    },
    {
      "id": 12,
      "start": 662.3600234985352,
      "end": 668.2400207519531,
      "text": " we'll look at John 14 and also at John 16. And I want you to notice what the Lord Jesus"
    },
    {
      "id": 13,
      "start": 668.2400207519531,
      "end": 673.3200225830078,
      "text": " Christ said to His disciples here in John 14 and then again in John chapter number 16."
    },
    {
      "id": 14,
      "start": 673.3200225830078,
      "end": 679.8800201416016,
      "text": " I want you to think about the truth of God giving us the entire Bible. Of course even"
    },
    {
      "id": 15,
      "start": 679.8800201416016,
      "end": 684.0400238037109,
      "text": " as He's speaking to the disciples at this particular time, before He would go to the"
    },
    {
      "id": 16,
      "start": 684.0400238037109,
      "end": 690.9600219726562,
      "text": " cross of Calvary, they did not have the complete Bible like we have it today. And so they too"
    },
    {
      "id": 17,
      "start": 690.9600219726562,
      "end": 695.8800201416016,
      "text": " were in a position where they did not have the complete revelation of God. But notice"
    },
    {
      "id": 18,
      "start": 695.8800201416016,
      "end": 701.3600234985352,
      "text": " what the Bible says in John 14 and verse 25. These things have I spoken unto you, being"
    },
    {
      "id": 19,
      "start": 701.3600234985352,
      "end": 707.9600219726562,
      "text": " yet present with you. But the Comforter, who is that? It says, which is the Holy Ghost."
    },
    {
      "id": 20,
      "start": 708.0800247192383,
      "end": 712.8400192260742,
      "text": " Aren't you thankful for the Holy Ghost? And I'm so thankful. The moment of salvation,"
    },
    {
      "id": 21,
      "start": 712.8400192260742,
      "end": 718.1600189208984,
      "text": " the Bible teaches us that the Holy Ghost, the third person of the Trinity, of the Godhead,"
    },
    {
      "id": 22,
      "start": 718.1600189208984,
      "end": 723.4400253295898,
      "text": " takes up residence within us. And we don't need to be scared about preaching or teaching"
    },
    {
      "id": 23,
      "start": 723.4400253295898,
      "end": 729.0400238037109,
      "text": " about the Holy Ghost, the Holy Spirit. It is biblical, it is understood that God has"
    },
    {
      "id": 24,
      "start": 729.0400238037109,
      "end": 733.6800231933594,
      "text": " given us the Holy Ghost and the Comforter has come. Notice, which the Father will send"
    },
    {
      "id": 25,
      "start": 733.7200164794922,
      "end": 740.7200164794922,
      "text": " in my name. I'm so thankful to have the Holy Spirit indwell me and to be indwelled by God's"
    },
    {
      "id": 26,
      "start": 741.7200164794922,
      "end": 748.7200164794922,
      "text": " Spirit. The Bible says this, He shall teach you, how many things? All things. And bring"
    },
    {
      "id": 27,
      "start": 751.1600189208984,
      "end": 757.4000244140625,
      "text": " all things to your remembrance whatsoever I have said unto you. You know that the disciples"
    },
    {
      "id": 28,
      "start": 757.4000244140625,
      "end": 762.280029296875,
      "text": " were just like us, they forgot some things. And no doubt you've forgotten some things"
    },
    {
      "id": 29,
      "start": 762.280029296875,
      "end": 766.4000244140625,
      "text": " in your life and the disciples, they had forgotten some things and the Holy Spirit"
    },
    {
      "id": 30,
      "start": 766.4000244140625,
      "end": 771.4000244140625,
      "text": " of God will remind them. I've mentioned this before and what a blessing it is and how important"
    },
    {
      "id": 31,
      "start": 771.4000244140625,
      "end": 777.3600158691406,
      "text": " it is that we're in God's Word every day of our lives. Why? Because then the Holy Spirit"
    },
    {
      "id": 32,
      "start": 777.3600158691406,
      "end": 783.6000213623047,
      "text": " of God can remind us of some biblical truth. You go through circumstances in your life,"
    },
    {
      "id": 33,
      "start": 783.6000213623047,
      "end": 787.7200164794922,
      "text": " you have difficulties, you have somebody that brings up a question and because you've been"
    },
    {
      "id": 34,
      "start": 787.7600250244141,
      "end": 792.9600219726562,
      "text": " in God's Word, because you've studied it and you've read it, then the Holy Spirit of God"
    },
    {
      "id": 35,
      "start": 792.9600219726562,
      "end": 799.6800231933594,
      "text": " can remind you and can guide you and can teach you what you need to be able to say. What"
    },
    {
      "id": 36,
      "start": 799.6800231933594,
      "end": 806.0000152587891,
      "text": " a blessing. But listen, if you're not in the Word, if there's nothing there, how's He gonna"
    },
    {
      "id": 37,
      "start": 806.0000152587891,
      "end": 811.8400268554688,
      "text": " remind you of it? You never read it, I don't know it, I'm unaware of it. No, we're in the"
    },
    {
      "id": 38,
      "start": 811.8400268554688,
      "end": 816.9200286865234,
      "text": " book, we're studying it, we're learning it, we're hearing it, we're reading it, and we're"
    },
    {
      "id": 39,
      "start": 816.9200286865234,
      "end": 821.2400207519531,
      "text": " examining it and the Bible says that the Holy Spirit of God, that He's going to teach"
    },
    {
      "id": 40,
      "start": 821.2400207519531,
      "end": 825.52001953125,
      "text": " us all things and He's gonna bring all things to remembrance whatsoever I've said unto you."
    },
    {
      "id": 41,
      "start": 825.52001953125,
      "end": 833.2000274658203,
      "text": " Notice in chapter 16, notice what the Lord says. In verse number 12 of John 16, Jesus"
    },
    {
      "id": 42,
      "start": 833.2000274658203,
      "end": 837.8800201416016,
      "text": " says, I have yet many things to say unto you, but ye cannot bear them now. You know, I'm"
    },
    {
      "id": 43,
      "start": 837.8800201416016,
      "end": 845.7200164794922,
      "text": " thankful that God has infinite wisdom. And I'm thankful that the Bible teaches us as"
    },
    {
      "id": 44,
      "start": 845.7600250244141,
      "end": 851.52001953125,
      "text": " newborn babes, desire the sincere milk of the Word that ye may grow thereby. And then"
    },
    {
      "id": 45,
      "start": 851.52001953125,
      "end": 857.4400329589844,
      "text": " you read where the Bible talks about strong meat in Hebrews chapter number five and six"
    },
    {
      "id": 46,
      "start": 857.4400329589844,
      "end": 861.8800354003906,
      "text": " and you read over there and you understand that the Bible would teach us and give us"
    },
    {
      "id": 47,
      "start": 861.8800354003906,
      "end": 867.6000366210938,
      "text": " the truth with regard to our spiritual diet and our spiritual growth. And it's interesting"
    },
    {
      "id": 48,
      "start": 867.6000366210938,
      "end": 872.9600219726562,
      "text": " because in Hebrews chapter number five, He says this in verse number 11, of whom we have"
    },
    {
      "id": 49,
      "start": 872.9600219726562,
      "end": 878.1600341796875,
      "text": " many things to say. Now listen, Jesus said, I have yet many things to say unto you, but"
    },
    {
      "id": 50,
      "start": 878.1600341796875,
      "end": 883.7200317382812,
      "text": " ye cannot bear them now. He says that to the disciples in John 16 in verse number 12. And"
    },
    {
      "id": 51,
      "start": 883.7200317382812,
      "end": 888.2400207519531,
      "text": " then I believe Paul wrote under the inspiration of the Holy Spirit of God, the book of Hebrews."
    },
    {
      "id": 52,
      "start": 888.2400207519531,
      "end": 893.0800170898438,
      "text": " And Paul says this to these that he's writing to, of whom we have many things to say and"
    },
    {
      "id": 53,
      "start": 893.0800170898438,
      "end": 899.8400268554688,
      "text": " hard to be uttered. Why? Seeing your dull of hearing. For when for the time you ought"
    },
    {
      "id": 54,
      "start": 899.8800354003906,
      "end": 904.6400146484375,
      "text": " to be teachers, you have need that one teach you again, which would be the first principles"
    },
    {
      "id": 55,
      "start": 904.6400146484375,
      "end": 909.5600280761719,
      "text": " of the oracles of God and to become such as have need of milk and not of strong meat."
    },
    {
      "id": 56,
      "start": 909.5600280761719,
      "end": 914.52001953125,
      "text": " For everyone that is, useth milk is unskillful in the word of righteousness for he is a babe,"
    },
    {
      "id": 57,
      "start": 914.52001953125,
      "end": 918.8000183105469,
      "text": " but strong meat belongeth to them that are full age. Even those by who, who by reason"
    },
    {
      "id": 58,
      "start": 918.8000183105469,
      "end": 925.8000183105469,
      "text": " of use have their senses exercised to discern both good and evil. God and His infinite wisdom"
    },
    {
      "id": 59,
      "start": 926.8000183105469,
      "end": 933.8000183105469,
      "text": " has determined how we grow as believers. Listen, I didn't know everything the day after I got"
    },
    {
      "id": 60,
      "start": 935.6000366210938,
      "end": 942.6000366210938,
      "text": " saved that I know today. I didn't understand the day I trust that Christ is my savior,"
    },
    {
      "id": 61,
      "start": 942.6000366210938,
      "end": 949.760009765625,
      "text": " August 31st, 1997. I did not in that moment understand everything that happened in salvation."
    },
    {
      "id": 62,
      "start": 949.760009765625,
      "end": 954.6200256347656,
      "text": " I didn't, I didn't understand it. And I'm sure that you didn't understand it either."
    },
    {
      "id": 63,
      "start": 954.6200256347656,
      "end": 959.7400207519531,
      "text": " And I didn't know about the words justified and reconciled and all of those things. I"
    },
    {
      "id": 64,
      "start": 959.7400207519531,
      "end": 965.260009765625,
      "text": " didn't know that he is our propitiation. I didn't know those Bible words. I wasn't familiar"
    },
    {
      "id": 65,
      "start": 965.260009765625,
      "end": 971.4200134277344,
      "text": " with those truths and I didn't understand the great transaction that took place. And"
    },
    {
      "id": 66,
      "start": 971.4200134277344,
      "end": 977.5800170898438,
      "text": " then as I begin to grow in grace and the knowledge of our Lord and savior, Jesus Christ, I begin"
    },
    {
      "id": 67,
      "start": 977.5800170898438,
      "end": 982.6200256347656,
      "text": " to learn more and more and more about what happened on that day that I got saved. And"
    },
    {
      "id": 68,
      "start": 982.6200256347656,
      "end": 987.6200256347656,
      "text": " I learn more about my savior and we're growing. And notice the Bible says in John 16, verse"
    },
    {
      "id": 69,
      "start": 987.6200256347656,
      "end": 992.5400085449219,
      "text": " 12, I have yet many things to say unto you, but you cannot bear them now. How be it when"
    },
    {
      "id": 70,
      "start": 992.5400085449219,
      "end": 998.6600341796875,
      "text": " he, the spirit of truth, this is the Holy spirit, the Holy ghost is come. He will guide"
    },
    {
      "id": 71,
      "start": 998.6600341796875,
      "end": 1005.6600341796875,
      "text": " you into what's at say all truth for he shall not speak of himself, but whatsoever he shall"
    },
    {
      "id": 72,
      "start": 1005.9000244140625,
      "end": 1012.9000244140625,
      "text": " hear that shall he speak. And he will show you what's at say things to come, huh? He's"
    },
    {
      "id": 73,
      "start": 1013.7400207519531,
      "end": 1018.3400268554688,
      "text": " going to show us things to come. How's he going to show us things to come through his"
    },
    {
      "id": 74,
      "start": 1018.3400268554688,
      "end": 1024.5000305175781,
      "text": " word, through his word. You know, it's interesting that Jesus said to the disciples in John 14,"
    },
    {
      "id": 75,
      "start": 1024.5000305175781,
      "end": 1027.9000244140625,
      "text": " let not your heart be troubled. You believe in God, believe also in me and my father's"
    },
    {
      "id": 76,
      "start": 1027.9000244140625,
      "end": 1032.4200134277344,
      "text": " house are many mansions. If it were not so, I would have told you, I go to prepare a place"
    },
    {
      "id": 77,
      "start": 1032.4200134277344,
      "end": 1038.3000183105469,
      "text": " for you. And if I go, I will come again and receive you unto myself that where I am there"
    },
    {
      "id": 78,
      "start": 1038.3000183105469,
      "end": 1043.1800231933594,
      "text": " you may be also. And so we find that there in John 14, verses one through three, Jesus"
    },
    {
      "id": 79,
      "start": 1043.1800231933594,
      "end": 1048.4200134277344,
      "text": " was speaking about leaving, ascending to heaven after the, uh, the, the resurrection, the"
    },
    {
      "id": 80,
      "start": 1048.4200134277344,
      "end": 1053.1800231933594,
      "text": " crucifixion and the resurrection, he'd ascend to heaven. And then he would come again. The"
    },
    {
      "id": 81,
      "start": 1053.1800231933594,
      "end": 1057.8600158691406,
      "text": " timeline was unknown, but the disciples received that. And as you study the remainder of the,"
    },
    {
      "id": 82,
      "start": 1057.8600158691406,
      "end": 1064.260009765625,
      "text": " uh, the new Testament, as the books are written, as the revelation is given, we begin to understand"
    },
    {
      "id": 83,
      "start": 1064.260009765625,
      "end": 1068.260009765625,
      "text": " about the rapture. We begin to understand about the second coming and we understand"
    },
    {
      "id": 84,
      "start": 1068.260009765625,
      "end": 1072.780029296875,
      "text": " about the tribulation and about eternity, the millennial and so on and so forth. And"
    },
    {
      "id": 85,
      "start": 1072.780029296875,
      "end": 1079.780029296875,
      "text": " we understand these things to come. What a glorious truth. The disciples in Acts chapter"
    },
    {
      "id": 86,
      "start": 1079.780029296875,
      "end": 1084.1000366210938,
      "text": " number one, before the ascension, they say, are you going to set up your kingdom? He says,"
    },
    {
      "id": 87,
      "start": 1084.1000366210938,
      "end": 1090.6200256347656,
      "text": " it's not for you to know. Right? But then he begins to give us revelation and we have"
    },
    {
      "id": 88,
      "start": 1090.6200256347656,
      "end": 1095.6600341796875,
      "text": " the whole canon of scripture. And one of the things that God shows us, I want you to make"
    },
    {
      "id": 89,
      "start": 1095.6600341796875,
      "end": 1103.9000244140625,
      "text": " this connection this evening, is he will show you things to come. What is God showing Joseph"
    },
    {
      "id": 90,
      "start": 1103.9000244140625,
      "end": 1109.7000122070312,
      "text": " in these dreams? Things to come. He's showing Joseph some things that are going to come"
    },
    {
      "id": 91,
      "start": 1109.7000122070312,
      "end": 1116.300048828125,
      "text": " to pass in Joseph's life and in the lives of his family. Of course, we understand the"
    },
    {
      "id": 92,
      "start": 1116.300048828125,
      "end": 1121.0599975585938,
      "text": " fulfillment because we know the account of the book of Genesis and we understand in the"
    },
    {
      "id": 93,
      "start": 1121.0599975585938,
      "end": 1125.7400512695312,
      "text": " life of Joseph how that he would be sold into slavery and how he would take after being"
    },
    {
      "id": 94,
      "start": 1125.7400512695312,
      "end": 1131.7000122070312,
      "text": " imprisoned and go and be second in command and all that would take place. We understand,"
    },
    {
      "id": 95,
      "start": 1131.7000122070312,
      "end": 1137.1799926757812,
      "text": " we're familiar with the life of Joseph, but in this particular moment, I don't think Joseph"
    },
    {
      "id": 96,
      "start": 1137.1799926757812,
      "end": 1142.2200317382812,
      "text": " understood all that these dreams meant. I don't think the brothers understood all that"
    },
    {
      "id": 97,
      "start": 1142.2200317382812,
      "end": 1148.300048828125,
      "text": " these dreams meant, but there was enough in the dreams to know. We're going to note here"
    },
    {
      "id": 98,
      "start": 1148.300048828125,
      "end": 1155.7400512695312,
      "text": " not only what God was revealing, but consider with me number two, what his family recognized."
    },
    {
      "id": 99,
      "start": 1155.7400512695312,
      "end": 1160.5400390625,
      "text": " Through God giving these dreams, there was a recognition on the part of the brethren"
    },
    {
      "id": 100,
      "start": 1160.5400390625,
      "end": 1166.6199951171875,
      "text": " for sure. And we see also on the part of Israel or Jacob, we find that the Bible says, notice"
    },
    {
      "id": 101,
      "start": 1166.6199951171875,
      "end": 1171.7000122070312,
      "text": " in verse number eight of Genesis 37, after Joseph shares that first dream with them in"
    },
    {
      "id": 102,
      "start": 1171.7000122070312,
      "end": 1177.5,
      "text": " verse number seven, in verse number eight, notice what his brothers say, shalt thou indeed,"
    },
    {
      "id": 103,
      "start": 1177.5,
      "end": 1187.4200439453125,
      "text": " notice what they say, reign over us. They recognized some of what this dream meant."
    },
    {
      "id": 104,
      "start": 1187.4200439453125,
      "end": 1194.3400268554688,
      "text": " They were picking up on the fact that his sheaf arose and then there it stood upright"
    },
    {
      "id": 105,
      "start": 1194.3400268554688,
      "end": 1199.1000366210938,
      "text": " and then their sheaves stood round about and did obeisance. They were tracking, they"
    },
    {
      "id": 106,
      "start": 1199.1000366210938,
      "end": 1199.9400024414062,
      "text": " were understanding."
    },
    {
      "id": 0,
      "start": 1199.9400024414062,
      "end": 1203.64000248909,
      "text": " and they say, shalt thou indeed reign over us."
    },
    {
      "id": 1,
      "start": 1203.64000248909,
      "end": 1206.6000022888184,
      "text": " Now, Joseph is younger than these boys, isn't he?"
    },
    {
      "id": 2,
      "start": 1207.5600023269653,
      "end": 1209.5200023651123,
      "text": " We know that Benjamin is younger than Joseph,"
    },
    {
      "id": 3,
      "start": 1209.5200023651123,
      "end": 1213.080002784729,
      "text": " but the other 11 are older than Joseph."
    },
    {
      "id": 4,
      "start": 1213.080002784729,
      "end": 1215.8800020217896,
      "text": " And culturally speaking, there's no way"
    },
    {
      "id": 5,
      "start": 1215.8800020217896,
      "end": 1219.0800018310547,
      "text": " they're gonna bow down to their younger brother."
    },
    {
      "id": 6,
      "start": 1219.0800018310547,
      "end": 1222.200002670288,
      "text": " And we find that the Bible says in verse number eight,"
    },
    {
      "id": 7,
      "start": 1222.200002670288,
      "end": 1227.200002670288,
      "text": " or shalt thou indeed have dominion over us."
    },
    {
      "id": 8,
      "start": 1227.200002670288,
      "end": 1232.2000007629395,
      "text": " Begin to recognize what God is revealing"
    },
    {
      "id": 9,
      "start": 1232.5000038146973,
      "end": 1234.8200035095215,
      "text": " through these dreams."
    },
    {
      "id": 10,
      "start": 1234.8200035095215,
      "end": 1236.9800033569336,
      "text": " Notice what their response was that says,"
    },
    {
      "id": 11,
      "start": 1236.9800033569336,
      "end": 1239.060001373291,
      "text": " and we'll get to it in just a moment in its entirety,"
    },
    {
      "id": 12,
      "start": 1239.060001373291,
      "end": 1241.180004119873,
      "text": " but they hated him yet the more for his dreams"
    },
    {
      "id": 13,
      "start": 1241.180004119873,
      "end": 1242.020004272461,
      "text": " and his words."
    },
    {
      "id": 14,
      "start": 1242.020004272461,
      "end": 1244.5000038146973,
      "text": " We know not only how the brothers responded"
    },
    {
      "id": 15,
      "start": 1244.5000038146973,
      "end": 1247.180004119873,
      "text": " or what they recognized there in verse number eight,"
    },
    {
      "id": 16,
      "start": 1247.180004119873,
      "end": 1249.6600036621094,
      "text": " but notice what his father, how his father,"
    },
    {
      "id": 17,
      "start": 1249.6600036621094,
      "end": 1253.3800010681152,
      "text": " what he recognized, the Bible says that he told his father,"
    },
    {
      "id": 18,
      "start": 1253.3800010681152,
      "end": 1255.7800025939941,
      "text": " this is with the second dream and his brethren,"
    },
    {
      "id": 19,
      "start": 1255.8000030517578,
      "end": 1257.1600036621094,
      "text": " and his father rebuked him and said,"
    },
    {
      "id": 20,
      "start": 1257.1600036621094,
      "end": 1259.2000007629395,
      "text": " notice what he says, what is this dream"
    },
    {
      "id": 21,
      "start": 1259.2000007629395,
      "end": 1260.1600036621094,
      "text": " that thou hast dreamed?"
    },
    {
      "id": 22,
      "start": 1260.1600036621094,
      "end": 1262.7600021362305,
      "text": " By the way, I'm not sure that Joseph could have"
    },
    {
      "id": 23,
      "start": 1262.7600021362305,
      "end": 1265.240005493164,
      "text": " concocted the dream himself."
    },
    {
      "id": 24,
      "start": 1265.240005493164,
      "end": 1268.2000045776367,
      "text": " You know, you ever, you can't control what you dream,"
    },
    {
      "id": 25,
      "start": 1269.7799987792969,
      "end": 1272.9200057983398,
      "text": " especially in the context of this dream"
    },
    {
      "id": 26,
      "start": 1272.9200057983398,
      "end": 1276.5400009155273,
      "text": " with regard to God revealing to Joseph"
    },
    {
      "id": 27,
      "start": 1276.5400009155273,
      "end": 1278.1600036621094,
      "text": " what was going to happen."
    },
    {
      "id": 28,
      "start": 1278.1600036621094,
      "end": 1279.9200057983398,
      "text": " We find that his father says,"
    },
    {
      "id": 29,
      "start": 1279.9200057983398,
      "end": 1281.5600051879883,
      "text": " what is this dream that thou hast dreamed?"
    },
    {
      "id": 30,
      "start": 1281.5600051879883,
      "end": 1286.5600051879883,
      "text": " Shall I and thy mother and thy brethren indeed come"
    },
    {
      "id": 31,
      "start": 1286.5800018310547,
      "end": 1290.9599990844727,
      "text": " to bow down ourselves to thee, to the earth?"
    },
    {
      "id": 32,
      "start": 1291.900001525879,
      "end": 1294.1000061035156,
      "text": " I want you to see what they recognized."
    },
    {
      "id": 33,
      "start": 1294.1000061035156,
      "end": 1297.4200057983398,
      "text": " They recognized that God was revealing"
    },
    {
      "id": 34,
      "start": 1299.1800003051758,
      "end": 1301.1800003051758,
      "text": " what was eventually gonna come to pass."
    },
    {
      "id": 35,
      "start": 1302.0600051879883,
      "end": 1303.620002746582,
      "text": " I would submit to you this evening"
    },
    {
      "id": 36,
      "start": 1303.620002746582,
      "end": 1305.6600036621094,
      "text": " that they didn't like it."
    },
    {
      "id": 37,
      "start": 1305.6600036621094,
      "end": 1307.3400039672852,
      "text": " They didn't like it."
    },
    {
      "id": 38,
      "start": 1307.3400039672852,
      "end": 1309.620002746582,
      "text": " And we note that in our third point this evening"
    },
    {
      "id": 39,
      "start": 1309.6399993896484,
      "end": 1313.400001525879,
      "text": " when we consider how his brothers responded,"
    },
    {
      "id": 40,
      "start": 1313.400001525879,
      "end": 1315.8400039672852,
      "text": " I've already made mention to verse number eight"
    },
    {
      "id": 41,
      "start": 1316.7799987792969,
      "end": 1319.2000045776367,
      "text": " where the Bible says at the end of the verse"
    },
    {
      "id": 42,
      "start": 1319.2000045776367,
      "end": 1322.5600051879883,
      "text": " that they hated him yet the more for his dreams"
    },
    {
      "id": 43,
      "start": 1322.5600051879883,
      "end": 1324.3199996948242,
      "text": " and for his words."
    },
    {
      "id": 44,
      "start": 1324.3199996948242,
      "end": 1325.9200057983398,
      "text": " There are some Bible commentators,"
    },
    {
      "id": 45,
      "start": 1325.9200057983398,
      "end": 1328.760009765625,
      "text": " in fact, depending on the particular Bible that you have,"
    },
    {
      "id": 46,
      "start": 1328.760009765625,
      "end": 1331.1199951171875,
      "text": " if you have notes within your Bible"
    },
    {
      "id": 47,
      "start": 1331.1199951171875,
      "end": 1333.0400085449219,
      "text": " that's a study Bible of some sort,"
    },
    {
      "id": 48,
      "start": 1333.0400085449219,
      "end": 1334.6000061035156,
      "text": " if you read some commentaries,"
    },
    {
      "id": 49,
      "start": 1334.6000061035156,
      "end": 1337.5599975585938,
      "text": " there are many commentators that give Joseph,"
    },
    {
      "id": 50,
      "start": 1337.5599975585938,
      "end": 1340.260009765625,
      "text": " I believe, disservice in this passage of Scripture"
    },
    {
      "id": 51,
      "start": 1340.260009765625,
      "end": 1342.4199981689453,
      "text": " and they say that Joseph was not right"
    },
    {
      "id": 52,
      "start": 1342.4199981689453,
      "end": 1343.8600006103516,
      "text": " for telling his dreams."
    },
    {
      "id": 53,
      "start": 1345.240005493164,
      "end": 1347.9000091552734,
      "text": " I don't see that in the text of Scripture."
    },
    {
      "id": 54,
      "start": 1347.9000091552734,
      "end": 1349.260009765625,
      "text": " If you just read the Bible,"
    },
    {
      "id": 55,
      "start": 1349.260009765625,
      "end": 1353.8000030517578,
      "text": " I don't think that Joseph was wrong in telling the dreams."
    },
    {
      "id": 56,
      "start": 1353.8000030517578,
      "end": 1357.4199981689453,
      "text": " Joseph is making known to his brothers"
    },
    {
      "id": 57,
      "start": 1357.4199981689453,
      "end": 1359.4400024414062,
      "text": " that which had been revealed to him"
    },
    {
      "id": 58,
      "start": 1359.4400024414062,
      "end": 1362.6399993896484,
      "text": " and we find that the response of the brothers,"
    },
    {
      "id": 59,
      "start": 1362.6399993896484,
      "end": 1364.1800079345703,
      "text": " they hate him."
    },
    {
      "id": 60,
      "start": 1364.1800079345703,
      "end": 1366.5800018310547,
      "text": " They hate him yet the more the Bible says"
    },
    {
      "id": 61,
      "start": 1366.5800018310547,
      "end": 1368.0800018310547,
      "text": " for his dreams and for his words."
    },
    {
      "id": 62,
      "start": 1368.0800018310547,
      "end": 1370.0,
      "text": " Now remember, they already hated him so much"
    },
    {
      "id": 63,
      "start": 1370.0,
      "end": 1372.979995727539,
      "text": " that they could not speak peaceably unto him."
    },
    {
      "id": 64,
      "start": 1372.979995727539,
      "end": 1375.240005493164,
      "text": " I can't imagine this relationship getting any worse"
    },
    {
      "id": 65,
      "start": 1375.240005493164,
      "end": 1378.3600006103516,
      "text": " than what it was, but we find that it says yet the more."
    },
    {
      "id": 66,
      "start": 1379.3600006103516,
      "end": 1382.7200012207031,
      "text": " His brethren envied him according to verse number 11."
    },
    {
      "id": 67,
      "start": 1382.7200012207031,
      "end": 1386.0,
      "text": " The Bible tells us that his father observed the saying."
    },
    {
      "id": 68,
      "start": 1386.0,
      "end": 1387.8800048828125,
      "text": " Begin to think about this portion of Scripture"
    },
    {
      "id": 69,
      "start": 1387.8800048828125,
      "end": 1390.2799987792969,
      "text": " and I've already tried to make some parallel"
    },
    {
      "id": 70,
      "start": 1390.2799987792969,
      "end": 1393.0,
      "text": " as we've looked at some New Testament truth this evening"
    },
    {
      "id": 71,
      "start": 1393.0,
      "end": 1395.5,
      "text": " and as we begin to understand how God is working"
    },
    {
      "id": 72,
      "start": 1395.5,
      "end": 1398.1600036621094,
      "text": " in Joseph's life through these two dreams"
    },
    {
      "id": 73,
      "start": 1398.1600036621094,
      "end": 1400.8399963378906,
      "text": " and what God is revealing, what he's making known"
    },
    {
      "id": 74,
      "start": 1400.8399963378906,
      "end": 1402.4000091552734,
      "text": " that's going to come to pass,"
    },
    {
      "id": 75,
      "start": 1402.4000091552734,
      "end": 1406.1999969482422,
      "text": " the reality this evening is that God has given us the Bible"
    },
    {
      "id": 76,
      "start": 1407.740005493164,
      "end": 1410.2799987792969,
      "text": " and he's given us the complete canon of Scripture"
    },
    {
      "id": 77,
      "start": 1410.2799987792969,
      "end": 1412.7200012207031,
      "text": " and there's some things that you know as a child of God,"
    },
    {
      "id": 78,
      "start": 1412.7200012207031,
      "end": 1414.2200012207031,
      "text": " someone that's been born again,"
    },
    {
      "id": 79,
      "start": 1414.2200012207031,
      "end": 1416.8600006103516,
      "text": " someone that believes in the authority of this book,"
    },
    {
      "id": 80,
      "start": 1416.8600006103516,
      "end": 1419.1199951171875,
      "text": " there's some things that you know about the future"
    },
    {
      "id": 81,
      "start": 1419.1199951171875,
      "end": 1420.6399993896484,
      "text": " that other people don't know"
    },
    {
      "id": 82,
      "start": 1421.4600067138672,
      "end": 1425.3800048828125,
      "text": " and God wants us to tell him."
    },
    {
      "id": 83,
      "start": 1427.5800018310547,
      "end": 1428.8200073242188,
      "text": " God wants us to tell him."
    },
    {
      "id": 84,
      "start": 1429.8200073242188,
      "end": 1433.7799987792969,
      "text": " God expects, in fact, God has commanded us to be witnesses."
    },
    {
      "id": 85,
      "start": 1433.7799987792969,
      "end": 1436.8600006103516,
      "text": " God has commanded us to go and to preach the gospel"
    },
    {
      "id": 86,
      "start": 1436.8600006103516,
      "end": 1438.020004272461,
      "text": " to every creature."
    },
    {
      "id": 87,
      "start": 1438.020004272461,
      "end": 1440.3800048828125,
      "text": " God has commanded us and I look at the Scriptures"
    },
    {
      "id": 88,
      "start": 1440.3800048828125,
      "end": 1443.4199981689453,
      "text": " and I look at the testimony of those that walked"
    },
    {
      "id": 89,
      "start": 1443.4199981689453,
      "end": 1444.6000061035156,
      "text": " with the Lord Jesus Christ."
    },
    {
      "id": 90,
      "start": 1444.6000061035156,
      "end": 1447.6199951171875,
      "text": " I think about John in 1 John chapter number one"
    },
    {
      "id": 91,
      "start": 1447.6199951171875,
      "end": 1449.4199981689453,
      "text": " if you want to turn there very quickly"
    },
    {
      "id": 92,
      "start": 1449.4199981689453,
      "end": 1451.8399963378906,
      "text": " and I want you to notice what John says."
    },
    {
      "id": 93,
      "start": 1451.8399963378906,
      "end": 1454.520004272461,
      "text": " It really is similar to what you read of the disciples"
    },
    {
      "id": 94,
      "start": 1454.520004272461,
      "end": 1456.4400024414062,
      "text": " in the book of Acts as they're testifying"
    },
    {
      "id": 95,
      "start": 1456.4400024414062,
      "end": 1459.239990234375,
      "text": " and as they're going forth and proclaiming the truth"
    },
    {
      "id": 96,
      "start": 1459.239990234375,
      "end": 1461.9200134277344,
      "text": " but we see it here in 1 John chapter number one."
    },
    {
      "id": 97,
      "start": 1472.6799926757812,
      "end": 1475.3200073242188,
      "text": " In 1 John chapter number one, the Bible says this,"
    },
    {
      "id": 98,
      "start": 1475.3200073242188,
      "end": 1477.239990234375,
      "text": " that beginning in verse number one,"
    },
    {
      "id": 99,
      "start": 1477.260009765625,
      "end": 1480.1000061035156,
      "text": " that which was from the beginning which we have heard,"
    },
    {
      "id": 100,
      "start": 1480.1000061035156,
      "end": 1481.8399963378906,
      "text": " which we have seen with our eyes,"
    },
    {
      "id": 101,
      "start": 1481.8399963378906,
      "end": 1484.739990234375,
      "text": " which we have looked upon and our hands have handled"
    },
    {
      "id": 102,
      "start": 1484.739990234375,
      "end": 1487.2999877929688,
      "text": " of the word of life, for the life was manifested"
    },
    {
      "id": 103,
      "start": 1487.2999877929688,
      "end": 1489.4599914550781,
      "text": " and we have seen it and bear witness"
    },
    {
      "id": 104,
      "start": 1489.4599914550781,
      "end": 1491.7799987792969,
      "text": " and show unto you that eternal life"
    },
    {
      "id": 105,
      "start": 1491.7799987792969,
      "end": 1494.7000122070312,
      "text": " which was with the Father and was manifested unto us."
    },
    {
      "id": 106,
      "start": 1494.7000122070312,
      "end": 1496.5400085449219,
      "text": " That which we have seen and heard,"
    },
    {
      "id": 107,
      "start": 1496.5400085449219,
      "end": 1501.1799926757812,
      "text": " notice those next words, declare we unto you"
    },
    {
      "id": 108,
      "start": 1501.1799926757812,
      "end": 1502.9400024414062,
      "text": " that you also may have fellowship with us"
    },
    {
      "id": 109,
      "start": 1502.9400024414062,
      "end": 1505.0599975585938,
      "text": " and truly our fellowship is with the Father"
    },
    {
      "id": 110,
      "start": 1505.0599975585938,
      "end": 1506.7000122070312,
      "text": " and with his son Jesus Christ."
    },
    {
      "id": 111,
      "start": 1506.7200012207031,
      "end": 1509.1600036621094,
      "text": " It's said this way in Acts four in verse number 20,"
    },
    {
      "id": 112,
      "start": 1509.1600036621094,
      "end": 1513.1600036621094,
      "text": " the disciples say for we cannot but speak the things"
    },
    {
      "id": 113,
      "start": 1513.1600036621094,
      "end": 1515.8800048828125,
      "text": " which we have seen and heard."
    },
    {
      "id": 114,
      "start": 1515.8800048828125,
      "end": 1519.9599914550781,
      "text": " Oh that God would give us a measure of that type of courage,"
    },
    {
      "id": 115,
      "start": 1519.9599914550781,
      "end": 1523.1600036621094,
      "text": " a measure of that type of boldness that we would say"
    },
    {
      "id": 116,
      "start": 1523.1600036621094,
      "end": 1525.8800048828125,
      "text": " and echo the words of John and of the disciples"
    },
    {
      "id": 117,
      "start": 1525.8800048828125,
      "end": 1527.3999938964844,
      "text": " here in Acts chapter number four where we would say"
    },
    {
      "id": 118,
      "start": 1527.3999938964844,
      "end": 1531.0,
      "text": " we cannot but speak the things which we have seen and heard."
    },
    {
      "id": 119,
      "start": 1532.6199951171875,
      "end": 1534.3999938964844,
      "text": " The Bible tells us about Elijah"
    },
    {
      "id": 120,
      "start": 1534.4200134277344,
      "end": 1536.8600158691406,
      "text": " and we studied the life of Elijah,"
    },
    {
      "id": 121,
      "start": 1536.8600158691406,
      "end": 1538.9400024414062,
      "text": " the beginning of his life this morning"
    },
    {
      "id": 122,
      "start": 1538.9400024414062,
      "end": 1542.2200012207031,
      "text": " through providing an obvious example of God's care"
    },
    {
      "id": 123,
      "start": 1542.2200012207031,
      "end": 1544.1400146484375,
      "text": " for his children, for his servants"
    },
    {
      "id": 124,
      "start": 1544.1400146484375,
      "end": 1546.739990234375,
      "text": " and you notice that as you study through the life of Elijah"
    },
    {
      "id": 125,
      "start": 1546.739990234375,
      "end": 1549.5800170898438,
      "text": " that you come to a place where God has revealed to Elijah"
    },
    {
      "id": 126,
      "start": 1549.5800170898438,
      "end": 1552.739990234375,
      "text": " some future events that are going to take place."
    },
    {
      "id": 127,
      "start": 1552.739990234375,
      "end": 1555.3600158691406,
      "text": " The Bible tells us that Elijah's response to that"
    },
    {
      "id": 128,
      "start": 1555.3600158691406,
      "end": 1556.8999938964844,
      "text": " is that he wept."
    },
    {
      "id": 129,
      "start": 1556.8999938964844,
      "end": 1558.260009765625,
      "text": " In fact, the Bible says it this way,"
    },
    {
      "id": 130,
      "start": 1558.260009765625,
      "end": 1560.7000122070312,
      "text": " the man of God wept."
    },
    {
      "id": 131,
      "start": 1560.7000122070312,
      "end": 1561.6600036621094,
      "text": " What caused him to weep?"
    },
    {
      "id": 132,
      "start": 1561.6799926757812,
      "end": 1563.7799987792969,
      "text": " Well that which had been revealed to him."
    },
    {
      "id": 133,
      "start": 1564.760009765625,
      "end": 1566.760009765625,
      "text": " I want you to begin to think about this evening"
    },
    {
      "id": 134,
      "start": 1566.760009765625,
      "end": 1569.4800109863281,
      "text": " as we would try to, yes, we understand the historical"
    },
    {
      "id": 135,
      "start": 1569.4800109863281,
      "end": 1572.5199890136719,
      "text": " context of what God is doing through these dreams"
    },
    {
      "id": 136,
      "start": 1572.5199890136719,
      "end": 1574.4400024414062,
      "text": " in Genesis chapter number 37"
    },
    {
      "id": 137,
      "start": 1574.4400024414062,
      "end": 1576.2000122070312,
      "text": " and we see what God was revealing,"
    },
    {
      "id": 138,
      "start": 1576.2000122070312,
      "end": 1577.6400146484375,
      "text": " we see what was recognized,"
    },
    {
      "id": 139,
      "start": 1577.6400146484375,
      "end": 1580.6000061035156,
      "text": " we see the response of his brothers in particular"
    },
    {
      "id": 140,
      "start": 1580.6000061035156,
      "end": 1582.239990234375,
      "text": " and their hatred for him"
    },
    {
      "id": 141,
      "start": 1582.239990234375,
      "end": 1584.0,
      "text": " but I want you to understand this evening"
    },
    {
      "id": 142,
      "start": 1584.0,
      "end": 1586.7000122070312,
      "text": " that God has revealed truth to you and to me."
    },
    {
      "id": 143,
      "start": 1587.5599975585938,
      "end": 1589.3999938964844,
      "text": " He's given us truth."
    },
    {
      "id": 144,
      "start": 1589.3999938964844,
      "end": 1591.8999938964844,
      "text": " One day the trumpet of the Lord is going to sound."
    },
    {
      "id": 145,
      "start": 1593.5800170898438,
      "end": 1597.5400085449219,
      "text": " One day, every single person that we know"
    },
    {
      "id": 146,
      "start": 1597.5400085449219,
      "end": 1599.3999938964844,
      "text": " is gonna stand before God Almighty."
    },
    {
      "id": 147,
      "start": 1602.1799926757812,
      "end": 1603.4200134277344,
      "text": " Is that true or not?"
    },
    {
      "id": 148,
      "start": 1604.6199951171875,
      "end": 1607.8999938964844,
      "text": " One day, every single person that you know"
    },
    {
      "id": 149,
      "start": 1607.8999938964844,
      "end": 1610.0,
      "text": " and that I know is gonna stand before God."
    },
    {
      "id": 150,
      "start": 1611.5400085449219,
      "end": 1614.1000061035156,
      "text": " The Bible describes for us two judgments."
    },
    {
      "id": 151,
      "start": 1615.2200012207031,
      "end": 1618.6799926757812,
      "text": " There's a judgment that's referred to as the bema seat"
    },
    {
      "id": 152,
      "start": 1618.6799926757812,
      "end": 1620.9800109863281,
      "text": " or the judgment seat of Christ"
    },
    {
      "id": 153,
      "start": 1620.9800109863281,
      "end": 1622.8800048828125,
      "text": " and that's the place where I'll stand."
    },
    {
      "id": 154,
      "start": 1623.8200073242188,
      "end": 1624.8999938964844,
      "text": " If you're saved tonight,"
    },
    {
      "id": 155,
      "start": 1624.8999938964844,
      "end": 1627.2999877929688,
      "text": " that's the place that you'll stand."
    },
    {
      "id": 156,
      "start": 1627.2999877929688,
      "end": 1630.3399963378906,
      "text": " And thank God we won't stand at the other judgment"
    },
    {
      "id": 157,
      "start": 1630.3399963378906,
      "end": 1632.5599975585938,
      "text": " but we'll stand at the bema seat of Christ."
    },
    {
      "id": 158,
      "start": 1634.5400085449219,
      "end": 1637.4200134277344,
      "text": " The Bible describes for us a judgment"
    },
    {
      "id": 159,
      "start": 1637.4200134277344,
      "end": 1640.4200134277344,
      "text": " that is called the great white throne judgment."
    },
    {
      "id": 160,
      "start": 1640.4200134277344,
      "end": 1643.0800170898438,
      "text": " And at that judgment, again I'm thankful,"
    },
    {
      "id": 161,
      "start": 1643.0800170898438,
      "end": 1645.7000122070312,
      "text": " I won't stand at that judgment."
    },
    {
      "id": 162,
      "start": 1645.7000122070312,
      "end": 1647.260009765625,
      "text": " If you've been born again this evening,"
    },
    {
      "id": 163,
      "start": 1647.260009765625,
      "end": 1649.760009765625,
      "text": " if you've been saved by the blood of Christ,"
    },
    {
      "id": 164,
      "start": 1649.760009765625,
      "end": 1652.4400024414062,
      "text": " you will not stand at the great white throne judgment."
    },
    {
      "id": 165,
      "start": 1653.3999938964844,
      "end": 1655.0,
      "text": " That's the authority of God's word,"
    },
    {
      "id": 166,
      "start": 1655.0,
      "end": 1656.6400146484375,
      "text": " that's what God tells us."
    },
    {
      "id": 167,
      "start": 1658.2000122070312,
      "end": 1659.5599975585938,
      "text": " Who stands at that judgment?"
    },
    {
      "id": 168,
      "start": 1659.5599975585938,
      "end": 1664.0800170898438,
      "text": " The lost, those that have rejected the Lord Jesus Christ."
    },
    {
      "id": 169,
      "start": 1664.0800170898438,
      "end": 1666.3600158691406,
      "text": " And the Bible tells us that at that judgment"
    },
    {
      "id": 170,
      "start": 1666.3600158691406,
      "end": 1669.5199890136719,
      "text": " that death and hell are cast into the lake of fire,"
    },
    {
      "id": 171,
      "start": 1669.5199890136719,
      "end": 1671.1199951171875,
      "text": " this is the second death."
    },
    {
      "id": 172,
      "start": 1672.4800109863281,
      "end": 1675.3200073242188,
      "text": " Revelation 20, 11 through 15 reveals that to us"
    },
    {
      "id": 173,
      "start": 1675.3200073242188,
      "end": 1677.4200134277344,
      "text": " of the great white throne judgment."
    },
    {
      "id": 174,
      "start": 1677.4200134277344,
      "end": 1680.3600158691406,
      "text": " What a sad day, what a sad judgment."
    },
    {
      "id": 175,
      "start": 1682.2999877929688,
      "end": 1683.7799987792969,
      "text": " I would submit to you this evening"
    },
    {
      "id": 176,
      "start": 1683.7799987792969,
      "end": 1685.7000122070312,
      "text": " that God has revealed that to us,"
    },
    {
      "id": 177,
      "start": 1685.7000122070312,
      "end": 1687.7799987792969,
      "text": " he's made that known to us."
    },
    {
      "id": 178,
      "start": 1687.7799987792969,
      "end": 1690.5400085449219,
      "text": " Remember the Holy Spirit, John 16,"
    },
    {
      "id": 179,
      "start": 1690.5400085449219,
      "end": 1692.5800170898438,
      "text": " Jesus said I have many things to say"
    },
    {
      "id": 180,
      "start": 1692.5800170898438,
      "end": 1694.2200012207031,
      "text": " but you're not ready for it yet"
    },
    {
      "id": 181,
      "start": 1694.2200012207031,
      "end": 1697.260009765625,
      "text": " but the spirit is going to come, the spirit of truth."
    },
    {
      "id": 182,
      "start": 1697.260009765625,
      "end": 1699.0199890136719,
      "text": " And when the spirit of truth shall come,"
    },
    {
      "id": 183,
      "start": 1699.0199890136719,
      "end": 1700.4200134277344,
      "text": " he will guide you into all truth"
    },
    {
      "id": 184,
      "start": 1700.4200134277344,
      "end": 1704.2999877929688,
      "text": " and he will show you things to come."
    },
    {
      "id": 185,
      "start": 1704.2999877929688,
      "end": 1705.260009765625,
      "text": " Things to come."
    },
    {
      "id": 186,
      "start": 1708.6000061035156,
      "end": 1711.0,
      "text": " The great white throne judgment is not the next thing"
    },
    {
      "id": 187,
      "start": 1711.0,
      "end": 1713.9600219726562,
      "text": " to come on God's prophetic calendar."
    },
    {
      "id": 188,
      "start": 1713.9600219726562,
      "end": 1715.8800048828125,
      "text": " In fact, there are many things that will take place"
    },
    {
      "id": 189,
      "start": 1715.8800048828125,
      "end": 1718.1199951171875,
      "text": " before the great white throne judgment."
    },
    {
      "id": 190,
      "start": 1718.1199951171875,
      "end": 1720.239990234375,
      "text": " If you're to very quickly understand"
    },
    {
      "id": 191,
      "start": 1720.239990234375,
      "end": 1721.8800048828125,
      "text": " the prophetic calendar of God"
    },
    {
      "id": 192,
      "start": 1721.8800048828125,
      "end": 1723.2000122070312,
      "text": " that is revealed to us in his word,"
    },
    {
      "id": 193,
      "start": 1723.2000122070312,
      "end": 1725.5999755859375,
      "text": " the next event is the rapture."
    },
    {
      "id": 194,
      "start": 1725.5999755859375,
      "end": 1726.5599975585938,
      "text": " And then after the rapture,"
    },
    {
      "id": 195,
      "start": 1726.5599975585938,
      "end": 1728.6400146484375,
      "text": " there's seven years of tribulation."
    },
    {
      "id": 196,
      "start": 1728.6400146484375,
      "end": 1730.4400024414062,
      "text": " And just looking at the high points"
    },
    {
      "id": 197,
      "start": 1730.4400024414062,
      "end": 1732.280029296875,
      "text": " after the seven years of tribulation,"
    },
    {
      "id": 198,
      "start": 1732.280029296875,
      "end": 1735.0,
      "text": " you'd find that there's the millennial reign of Christ."
    },
    {
      "id": 199,
      "start": 1735.0,
      "end": 1736.8599853515625,
      "text": " And then after the millennial reign of Christ"
    },
    {
      "id": 200,
      "start": 1736.8599853515625,
      "end": 1740.0999755859375,
      "text": " is when you read of the great white throne judgment."
    },
    {
      "id": 201,
      "start": 1740.0999755859375,
      "end": 1741.3800048828125,
      "text": " Those are just hitting the high points"
    },
    {
      "id": 202,
      "start": 1741.3800048828125,
      "end": 1743.1400146484375,
      "text": " very quickly in the book of Revelation."
    },
    {
      "id": 203,
      "start": 1743.1400146484375,
      "end": 1745.02001953125,
      "text": " There are many other events that are described"
    },
    {
      "id": 204,
      "start": 1745.02001953125,
      "end": 1746.02001953125,
      "text": " that we could look to,"
    },
    {
      "id": 205,
      "start": 1746.02001953125,
      "end": 1748.1799926757812,
      "text": " but you find that those are the high points"
    },
    {
      "id": 206,
      "start": 1748.1799926757812,
      "end": 1750.260009765625,
      "text": " on God's prophetic calendar."
    },
    {
      "id": 207,
      "start": 1750.260009765625,
      "end": 1751.7000122070312,
      "text": " But what I'm saying to you this evening"
    },
    {
      "id": 208,
      "start": 1751.7000122070312,
      "end": 1754.3800048828125,
      "text": " is that God's revealed that to us."
    },
    {
      "id": 209,
      "start": 1754.3800048828125,
      "end": 1757.1799926757812,
      "text": " But why has he revealed it to us?"
    },
    {
      "id": 210,
      "start": 1757.1799926757812,
      "end": 1760.0,
      "text": " So that we tell somebody, so they could be prepared."
    },
    {
      "id": 211,
      "start": 1760.8200073242188,
      "end": 1764.0999755859375,
      "text": " But here's what I would submit to you this evening."
    },
    {
      "id": 212,
      "start": 1764.0999755859375,
      "end": 1765.5800170898438,
      "text": " Sometimes they're gonna respond to you"
    },
    {
      "id": 213,
      "start": 1765.5800170898438,
      "end": 1768.3800048828125,
      "text": " the same way that the 11 brothers responded to Joseph."
    },
    {
      "id": 214,
      "start": 1771.1400146484375,
      "end": 1772.02001953125,
      "text": " With hatred."
    },
    {
      "id": 215,
      "start": 1774.7000122070312,
      "end": 1776.260009765625,
      "text": " With hatred."
    },
    {
      "id": 216,
      "start": 1776.260009765625,
      "end": 1777.8599853515625,
      "text": " With animosity."
    },
    {
      "id": 217,
      "start": 1777.8599853515625,
      "end": 1779.3400268554688,
      "text": " With unkindness."
    },
    {
      "id": 218,
      "start": 1781.1400146484375,
      "end": 1784.2200317382812,
      "text": " With whatever other word you wanna use to describe it."
    },
    {
      "id": 219,
      "start": 1784.2200317382812,
      "end": 1785.9000244140625,
      "text": " But we find that, listen,"
    },
    {
      "id": 220,
      "start": 1785.9000244140625,
      "end": 1788.97998046875,
      "text": " the God of this world hath blinded the minds of them"
    },
    {
      "id": 221,
      "start": 1789.0,
      "end": 1790.5999755859375,
      "text": " which believe not."
    },
    {
      "id": 222,
      "start": 1790.5999755859375,
      "end": 1793.47998046875,
      "text": " We're engaged in spiritual warfare and spiritual battle."
    },
    {
      "id": 223,
      "start": 1793.47998046875,
      "end": 1796.6400146484375,
      "text": " And listen, people don't like hearing the truth."
    },
    {
      "id": 224,
      "start": 1796.6400146484375,
      "end": 1799.8800048828125,
      "text": " And there are many times we find today."
    },
    {
      "id": 0,
      "start": 1799.8800048828125,
      "end": 1804.28000497818,
      "text": " that people have believed a lie."
    },
    {
      "id": 1,
      "start": 1804.28000497818,
      "end": 1806.1200046539307,
      "text": " And they've believed it so much"
    },
    {
      "id": 2,
      "start": 1806.1200046539307,
      "end": 1810.6000051498413,
      "text": " that there's no room for the truth."
    },
    {
      "id": 3,
      "start": 1810.6000051498413,
      "end": 1812.7200050354004,
      "text": " And they can get so angry at you"
    },
    {
      "id": 4,
      "start": 1812.7200050354004,
      "end": 1814.7600049972534,
      "text": " or at me as the messenger."
    },
    {
      "id": 5,
      "start": 1814.7600049972534,
      "end": 1817.8800048828125,
      "text": " The brothers were so angry with Joseph,"
    },
    {
      "id": 6,
      "start": 1817.8800048828125,
      "end": 1824.4000053405762,
      "text": " and even his father rebuked him for the dream."
    },
    {
      "id": 7,
      "start": 1824.4000053405762,
      "end": 1826.4000053405762,
      "text": " I've been told so many things over the years"
    },
    {
      "id": 8,
      "start": 1826.4000053405762,
      "end": 1828.4000053405762,
      "text": " and I try to share truth with people."
    },
    {
      "id": 9,
      "start": 1828.4000053405762,
      "end": 1829.680004119873,
      "text": " I remember hearing somebody say,"
    },
    {
      "id": 10,
      "start": 1829.680004119873,
      "end": 1831.4400043487549,
      "text": " oh, two things you should never talk about,"
    },
    {
      "id": 11,
      "start": 1831.4400043487549,
      "end": 1832.4400062561035,
      "text": " politics and religion."
    },
    {
      "id": 12,
      "start": 1832.4400062561035,
      "end": 1834.3200035095215,
      "text": " How many ever heard somebody say that?"
    },
    {
      "id": 13,
      "start": 1834.3200035095215,
      "end": 1836.0400047302246,
      "text": " Can I tell you, here's what I believe,"
    },
    {
      "id": 14,
      "start": 1836.0400047302246,
      "end": 1837.5600051879883,
      "text": " and I'm only 42 years old,"
    },
    {
      "id": 15,
      "start": 1837.5600051879883,
      "end": 1838.7200050354004,
      "text": " but here's what I believe,"
    },
    {
      "id": 16,
      "start": 1838.7200050354004,
      "end": 1841.240005493164,
      "text": " that if we didn't believe that about 70 years ago,"
    },
    {
      "id": 17,
      "start": 1841.240005493164,
      "end": 1843.9200057983398,
      "text": " our world would be different today."
    },
    {
      "id": 18,
      "start": 1843.9200057983398,
      "end": 1845.240005493164,
      "text": " But about 70 years ago,"
    },
    {
      "id": 19,
      "start": 1845.240005493164,
      "end": 1848.1600036621094,
      "text": " it was commonly believed that it wasn't appropriate"
    },
    {
      "id": 20,
      "start": 1848.1600036621094,
      "end": 1850.4800033569336,
      "text": " to talk about politics and religion,"
    },
    {
      "id": 21,
      "start": 1850.4800033569336,
      "end": 1852.7600059509277,
      "text": " and so we stopped talking about those two subjects"
    },
    {
      "id": 22,
      "start": 1852.7600059509277,
      "end": 1854.2800064086914,
      "text": " and we probably wouldn't be in the mess"
    },
    {
      "id": 23,
      "start": 1854.2800064086914,
      "end": 1855.4800033569336,
      "text": " that we're in today"
    },
    {
      "id": 24,
      "start": 1855.4800033569336,
      "end": 1858.9600067138672,
      "text": " if we would've kept talking about politics and religion."
    },
    {
      "id": 25,
      "start": 1858.9600067138672,
      "end": 1860.4800033569336,
      "text": " I'm not preaching politics tonight,"
    },
    {
      "id": 26,
      "start": 1860.4800033569336,
      "end": 1862.8000030517578,
      "text": " I'm just saying that we took those two things out"
    },
    {
      "id": 27,
      "start": 1862.8000030517578,
      "end": 1864.9200057983398,
      "text": " and said, no, you can't talk about those two things."
    },
    {
      "id": 28,
      "start": 1864.9200057983398,
      "end": 1866.0800018310547,
      "text": " I'd much rather talk about,"
    },
    {
      "id": 29,
      "start": 1866.0800018310547,
      "end": 1867.0400085449219,
      "text": " and it's not religion,"
    },
    {
      "id": 30,
      "start": 1867.0400085449219,
      "end": 1869.4400024414062,
      "text": " it's a relationship with the Lord Jesus Christ."
    },
    {
      "id": 31,
      "start": 1870.8000030517578,
      "end": 1875.0800018310547,
      "text": " Man, we need to talk about Jesus and to tell others why,"
    },
    {
      "id": 32,
      "start": 1875.0800018310547,
      "end": 1877.9200057983398,
      "text": " because they're gonna stand before God one day."
    },
    {
      "id": 33,
      "start": 1880.7200012207031,
      "end": 1883.6800079345703,
      "text": " Here's what God says to Ezekiel."
    },
    {
      "id": 34,
      "start": 1884.6800079345703,
      "end": 1886.6800079345703,
      "text": " I've called you to be a watchman."
    },
    {
      "id": 35,
      "start": 1888.4400024414062,
      "end": 1890.9200057983398,
      "text": " I've called you to be a watchman."
    },
    {
      "id": 36,
      "start": 1890.9200057983398,
      "end": 1892.2800064086914,
      "text": " You can read it in chapter three"
    },
    {
      "id": 37,
      "start": 1892.2800064086914,
      "end": 1893.8000030517578,
      "text": " and then again in chapter 33,"
    },
    {
      "id": 38,
      "start": 1893.8000030517578,
      "end": 1897.8000030517578,
      "text": " and God says to Ezekiel that you give them warning."
    },
    {
      "id": 39,
      "start": 1898.8400039672852,
      "end": 1902.640007019043,
      "text": " And if you warn them, you've done your part."
    },
    {
      "id": 40,
      "start": 1902.640007019043,
      "end": 1904.7600021362305,
      "text": " How they respond to the warning,"
    },
    {
      "id": 41,
      "start": 1906.400001525879,
      "end": 1907.7200012207031,
      "text": " that's completely on them."
    },
    {
      "id": 42,
      "start": 1908.640007019043,
      "end": 1911.6000061035156,
      "text": " But you warn them, you warn them."
    },
    {
      "id": 43,
      "start": 1911.6000061035156,
      "end": 1915.5600051879883,
      "text": " If the watchman fails to sound the horn,"
    },
    {
      "id": 44,
      "start": 1915.5600051879883,
      "end": 1917.8000030517578,
      "text": " the trumpet, and danger is coming,"
    },
    {
      "id": 45,
      "start": 1917.8000030517578,
      "end": 1920.4800033569336,
      "text": " then the responsibility falls upon the watchman."
    },
    {
      "id": 46,
      "start": 1922.0000076293945,
      "end": 1925.1600036621094,
      "text": " And I wanna remind you of what the Apostle Paul said"
    },
    {
      "id": 47,
      "start": 1925.1600036621094,
      "end": 1926.4400024414062,
      "text": " in Acts chapter number 20,"
    },
    {
      "id": 48,
      "start": 1926.4400024414062,
      "end": 1928.9199981689453,
      "text": " and we'll close with this tonight."
    },
    {
      "id": 49,
      "start": 1928.9199981689453,
      "end": 1932.5599975585938,
      "text": " Listen, Paul was a man that knew the Old Testament."
    },
    {
      "id": 50,
      "start": 1933.8000030517578,
      "end": 1935.4400024414062,
      "text": " Paul knew the Old Testament."
    },
    {
      "id": 51,
      "start": 1935.4400024414062,
      "end": 1939.240005493164,
      "text": " Paul was trained, learned at the feet of Gamaliel."
    },
    {
      "id": 52,
      "start": 1939.240005493164,
      "end": 1941.7200012207031,
      "text": " He was learned."
    },
    {
      "id": 53,
      "start": 1942.9600067138672,
      "end": 1946.1200103759766,
      "text": " And then he got born again, hallelujah."
    },
    {
      "id": 54,
      "start": 1947.240005493164,
      "end": 1950.8400115966797,
      "text": " Because as religious as he was and as zealous as he was,"
    },
    {
      "id": 55,
      "start": 1950.8400115966797,
      "end": 1953.520004272461,
      "text": " he was lost, but in Acts 9, he got saved."
    },
    {
      "id": 56,
      "start": 1953.520004272461,
      "end": 1955.6399993896484,
      "text": " And we come to Acts chapter number 20,"
    },
    {
      "id": 57,
      "start": 1955.6399993896484,
      "end": 1958.3600006103516,
      "text": " and we find that Paul is preaching"
    },
    {
      "id": 58,
      "start": 1958.3600006103516,
      "end": 1959.8400115966797,
      "text": " and he's giving the truth."
    },
    {
      "id": 59,
      "start": 1959.8400115966797,
      "end": 1961.1200103759766,
      "text": " And here in Acts chapter number 20,"
    },
    {
      "id": 60,
      "start": 1961.1200103759766,
      "end": 1965.4000091552734,
      "text": " he comes and he's called the Ephesian church leaders"
    },
    {
      "id": 61,
      "start": 1965.4000091552734,
      "end": 1967.8400115966797,
      "text": " together to be able to speak with them."
    },
    {
      "id": 62,
      "start": 1967.8400115966797,
      "end": 1970.2000122070312,
      "text": " And I want you to notice in verse number 24,"
    },
    {
      "id": 63,
      "start": 1970.2000122070312,
      "end": 1972.1600036621094,
      "text": " he says, but none of these things move me,"
    },
    {
      "id": 64,
      "start": 1972.1600036621094,
      "end": 1975.0,
      "text": " neither count I my life dear unto myself,"
    },
    {
      "id": 65,
      "start": 1975.0,
      "end": 1976.9199981689453,
      "text": " so that I might finish my course with joy"
    },
    {
      "id": 66,
      "start": 1976.9199981689453,
      "end": 1979.760009765625,
      "text": " in the ministry which I have received of the Lord Jesus"
    },
    {
      "id": 67,
      "start": 1979.760009765625,
      "end": 1982.9199981689453,
      "text": " to testify the gospel of the grace of God."
    },
    {
      "id": 68,
      "start": 1982.9199981689453,
      "end": 1985.3200073242188,
      "text": " And now behold, I know that ye all,"
    },
    {
      "id": 69,
      "start": 1985.3200073242188,
      "end": 1987.8400115966797,
      "text": " among whom I have gone preaching the kingdom of God,"
    },
    {
      "id": 70,
      "start": 1987.8400115966797,
      "end": 1989.4400024414062,
      "text": " shall see my face no more."
    },
    {
      "id": 71,
      "start": 1989.4400024414062,
      "end": 1991.6800079345703,
      "text": " Wherefore, I take you to record this day,"
    },
    {
      "id": 72,
      "start": 1991.6800079345703,
      "end": 1993.0800018310547,
      "text": " notice what Paul says,"
    },
    {
      "id": 73,
      "start": 1993.0800018310547,
      "end": 1997.4199981689453,
      "text": " that I am pure from the blood of all men."
    },
    {
      "id": 74,
      "start": 1998.760009765625,
      "end": 2000.2000122070312,
      "text": " Why does he say that?"
    },
    {
      "id": 75,
      "start": 2000.2000122070312,
      "end": 2004.3200073242188,
      "text": " Notice verse 27, for I have not shunned"
    },
    {
      "id": 76,
      "start": 2004.3200073242188,
      "end": 2009.3200073242188,
      "text": " to declare unto you all the counsel of God."
    },
    {
      "id": 77,
      "start": 2010.4000091552734,
      "end": 2013.7200012207031,
      "text": " He says, I'm gonna skip down for sake of time in verse 31."
    },
    {
      "id": 78,
      "start": 2013.7200012207031,
      "end": 2015.8600006103516,
      "text": " He says, therefore, watch and remember"
    },
    {
      "id": 79,
      "start": 2015.8600006103516,
      "end": 2017.5599975585938,
      "text": " that by the space of three years,"
    },
    {
      "id": 80,
      "start": 2017.5599975585938,
      "end": 2018.8000030517578,
      "text": " notice how he describes this,"
    },
    {
      "id": 81,
      "start": 2018.8000030517578,
      "end": 2021.1200103759766,
      "text": " I ceased not to what?"
    },
    {
      "id": 82,
      "start": 2021.1200103759766,
      "end": 2026.1200103759766,
      "text": " To warn everyone night and day with tears."
    },
    {
      "id": 83,
      "start": 2027.0800018310547,
      "end": 2029.0800018310547,
      "text": " Paul, why did you have tears?"
    },
    {
      "id": 84,
      "start": 2029.0800018310547,
      "end": 2030.8000030517578,
      "text": " Because there was something that Paul understood"
    },
    {
      "id": 85,
      "start": 2030.8000030517578,
      "end": 2033.7200012207031,
      "text": " that God had revealed to him that was going to take place."
    },
    {
      "id": 86,
      "start": 2034.6399993896484,
      "end": 2037.9600067138672,
      "text": " And this evening, when we look at this account"
    },
    {
      "id": 87,
      "start": 2037.9600067138672,
      "end": 2039.240005493164,
      "text": " from Genesis 37, you say, man,"
    },
    {
      "id": 88,
      "start": 2039.240005493164,
      "end": 2040.8800048828125,
      "text": " I didn't expect all this tonight."
    },
    {
      "id": 89,
      "start": 2042.6399993896484,
      "end": 2046.9400024414062,
      "text": " Some dreams of Joseph and what God was revealing to Joseph"
    },
    {
      "id": 90,
      "start": 2046.9400024414062,
      "end": 2050.1399993896484,
      "text": " about some future events in the life of Joseph"
    },
    {
      "id": 91,
      "start": 2050.1399993896484,
      "end": 2054.480010986328,
      "text": " and his family as God's people."
    },
    {
      "id": 92,
      "start": 2054.480010986328,
      "end": 2056.5599975585938,
      "text": " I no longer need a dream or a vision."
    },
    {
      "id": 93,
      "start": 2056.5599975585938,
      "end": 2060.3600158691406,
      "text": " I have God's completed book, the Bible."
    },
    {
      "id": 94,
      "start": 2060.3600158691406,
      "end": 2062.6600036621094,
      "text": " And in God's completed book, the Bible,"
    },
    {
      "id": 95,
      "start": 2062.6600036621094,
      "end": 2066.7000122070312,
      "text": " he has given me truth concerning things to come."
    },
    {
      "id": 96,
      "start": 2067.760009765625,
      "end": 2070.6799926757812,
      "text": " And oh, that God would give us a passion"
    },
    {
      "id": 97,
      "start": 2070.6799926757812,
      "end": 2075.279998779297,
      "text": " to tell someone else about these things to come."
    },
    {
      "id": 98,
      "start": 2075.279998779297,
      "end": 2078.0,
      "text": " Because many people, they have no idea."
    },
    {
      "id": 99,
      "start": 2079.0,
      "end": 2084.0,
      "text": " They're just living life, let come what may."
    },
    {
      "id": 100,
      "start": 2085.480010986328,
      "end": 2086.4400024414062,
      "text": " What's gonna happen when we die?"
    },
    {
      "id": 101,
      "start": 2086.4400024414062,
      "end": 2088.1199951171875,
      "text": " I have no idea, I'll think about it then."
    },
    {
      "id": 102,
      "start": 2088.1199951171875,
      "end": 2092.720001220703,
      "text": " No, no, that's the wrong answer."
    },
    {
      "id": 103,
      "start": 2092.720001220703,
      "end": 2097.0,
      "text": " It's too late then, it's too late."
    },
    {
      "id": 104,
      "start": 2099.0,
      "end": 2104.0,
      "text": " Philippians tells us that every knee shall bow"
    },
    {
      "id": 105,
      "start": 2104.0,
      "end": 2106.9200134277344,
      "text": " and every tongue shall confess."
    },
    {
      "id": 106,
      "start": 2107.0,
      "end": 2110.1400146484375,
      "text": " That is going to happen."
    },
    {
      "id": 107,
      "start": 2112.6799926757812,
      "end": 2116.800018310547,
      "text": " How much better for it to happen on this side of eternity"
    },
    {
      "id": 108,
      "start": 2117.8399963378906,
      "end": 2120.459991455078,
      "text": " and to forever be with the Lord?"
    },
    {
      "id": 109,
      "start": 2121.6400146484375,
      "end": 2124.459991455078,
      "text": " This evening, we see the dreams of Joseph."
    },
    {
      "id": 110,
      "start": 2125.480010986328,
      "end": 2126.480010986328,
      "text": " We don't need to have a dream,"
    },
    {
      "id": 111,
      "start": 2126.480010986328,
      "end": 2128.3399963378906,
      "text": " we just need to read the book."
    },
    {
      "id": 112,
      "start": 2128.3399963378906,
      "end": 2131.239990234375,
      "text": " As we read the book, God reveals to us"
    },
    {
      "id": 113,
      "start": 2131.239990234375,
      "end": 2133.3200073242188,
      "text": " and then it's our responsibility to tell some other people"
    },
    {
      "id": 114,
      "start": 2133.3200073242188,
      "end": 2136.239990234375,
      "text": " about what's going to happen, what's gonna happen."
    },
    {
      "id": 115,
      "start": 2136.239990234375,
      "end": 2137.3999938964844,
      "text": " You know, there's people who run around,"
    },
    {
      "id": 116,
      "start": 2137.3999938964844,
      "end": 2138.720001220703,
      "text": " what's gonna happen with this"
    },
    {
      "id": 117,
      "start": 2138.720001220703,
      "end": 2139.8399963378906,
      "text": " and what's gonna happen with that"
    },
    {
      "id": 118,
      "start": 2139.8399963378906,
      "end": 2142.4400024414062,
      "text": " and how's this gonna work and what's this gonna do?"
    },
    {
      "id": 119,
      "start": 2143.739990234375,
      "end": 2145.1600036621094,
      "text": " People have lost their way."
    },
    {
      "id": 120,
      "start": 2145.1600036621094,
      "end": 2148.480010986328,
      "text": " I got an email yesterday, there's a church overseas"
    },
    {
      "id": 121,
      "start": 2148.480010986328,
      "end": 2151.0,
      "text": " that they decided to have a full service"
    },
    {
      "id": 122,
      "start": 2151.0,
      "end": 2154.739990234375,
      "text": " guided and directed by chat GPT."
    },
    {
      "id": 123,
      "start": 2154.739990234375,
      "end": 2157.1600036621094,
      "text": " That's nonsense."
    },
    {
      "id": 124,
      "start": 2157.1600036621094,
      "end": 2159.3999938964844,
      "text": " We got the Bible."
    },
    {
      "id": 125,
      "start": 2159.3999938964844,
      "end": 2162.0599975585938,
      "text": " We don't need artificial intelligence."
    },
    {
      "id": 126,
      "start": 2162.0599975585938,
      "end": 2163.52001953125,
      "text": " We got God's word."
    },
    {
      "id": 127,
      "start": 2164.52001953125,
      "end": 2166.980010986328,
      "text": " People have lost their way."
    },
    {
      "id": 128,
      "start": 2166.980010986328,
      "end": 2171.980010986328,
      "text": " They have no idea and yet we have God's authoritative word."
    },
    {
      "id": 129,
      "start": 2172.720001220703,
      "end": 2176.1199951171875,
      "text": " Oh, that God would give us boldness and courage."
    },
    {
      "id": 130,
      "start": 2176.1199951171875,
      "end": 2179.1799926757812,
      "text": " I think Joseph had to have a lot of boldness and courage"
    },
    {
      "id": 131,
      "start": 2179.1799926757812,
      "end": 2181.6799926757812,
      "text": " to tell his brothers what he dreamed."
    },
    {
      "id": 132,
      "start": 2181.6799926757812,
      "end": 2185.3999938964844,
      "text": " Do you remember when Samuel received the revelation from God?"
    },
    {
      "id": 133,
      "start": 2186.3200073242188,
      "end": 2187.6400146484375,
      "text": " As soon as he woke up in the morning,"
    },
    {
      "id": 134,
      "start": 2187.6400146484375,
      "end": 2189.239990234375,
      "text": " I think Samuel tried to get busy"
    },
    {
      "id": 135,
      "start": 2190.0800170898438,
      "end": 2195.0800170898438,
      "text": " and Eli said, Samuel, Samuel, what did God say to you?"
    },
    {
      "id": 136,
      "start": 2196.279998779297,
      "end": 2199.3600158691406,
      "text": " That was the last question he wanted to be asked"
    },
    {
      "id": 137,
      "start": 2200.720001220703,
      "end": 2205.040008544922,
      "text": " and Eli says, tell me all of it."
    },
    {
      "id": 138,
      "start": 2205.040008544922,
      "end": 2207.2000122070312,
      "text": " Hide nothing from me."
    },
    {
      "id": 139,
      "start": 2210.3600158691406,
      "end": 2214.0800170898438,
      "text": " I understand that Joseph needed to have some courage"
    },
    {
      "id": 140,
      "start": 2214.0800170898438,
      "end": 2217.4400024414062,
      "text": " and some boldness and so do we."
    },
    {
      "id": 141,
      "start": 2217.4400024414062,
      "end": 2219.1199951171875,
      "text": " Here's the wonderful truth."
    },
    {
      "id": 142,
      "start": 2219.959991455078,
      "end": 2220.800018310547,
      "text": " You know what Jesus said?"
    },
    {
      "id": 143,
      "start": 2220.800018310547,
      "end": 2223.2000122070312,
      "text": " All power is given unto me in heaven and earth"
    },
    {
      "id": 144,
      "start": 2223.2000122070312,
      "end": 2226.52001953125,
      "text": " and then he said this, I'll be with you."
    },
    {
      "id": 145,
      "start": 2226.52001953125,
      "end": 2227.5599975585938,
      "text": " I'll be with you."
    },
    {
      "id": 146,
      "start": 2228.52001953125,
      "end": 2231.279998779297,
      "text": " He'll give us that courage and that boldness."
    },
    {
      "id": 147,
      "start": 2232.9200134277344,
      "end": 2236.3999938964844,
      "text": " Oh, that God would give us the right disposition"
    },
    {
      "id": 148,
      "start": 2236.3999938964844,
      "end": 2239.2000122070312,
      "text": " to be able to give the truth in love,"
    },
    {
      "id": 149,
      "start": 2239.2000122070312,
      "end": 2241.480010986328,
      "text": " to let people know, listen, I'm telling you this"
    },
    {
      "id": 150,
      "start": 2241.480010986328,
      "end": 2243.3600158691406,
      "text": " because I care about you, because I love you,"
    },
    {
      "id": 151,
      "start": 2243.3600158691406,
      "end": 2245.6000061035156,
      "text": " because I want you to know the truth"
    },
    {
      "id": 152,
      "start": 2246.6000061035156,
      "end": 2248.959991455078,
      "text": " because one day, you're gonna stand before God."
    },
    {
      "id": 153,
      "start": 2250.1600036621094,
      "end": 2251.0,
      "text": " Let's pray together."
    },
    {
      "id": 154,
      "start": 2251.0,
      "end": 2251.959991455078,
      "text": " Father, we love you."
    },
    {
      "id": 155,
      "start": 2253.0,
      "end": 2254.5599975585938,
      "text": " We thank you for loving us."
    },
    {
      "id": 156,
      "start": 2255.9200134277344,
      "end": 2257.3200073242188,
      "text": " I thank you for the Bible."
    },
    {
      "id": 157,
      "start": 2259.0,
      "end": 2261.1600036621094,
      "text": " Thank you for the life of Joseph and his courage"
    },
    {
      "id": 158,
      "start": 2261.1600036621094,
      "end": 2266.1600036621094,
      "text": " and boldness to share these dreams."
    },
    {
      "id": 159,
      "start": 2268.52001953125,
      "end": 2271.6000061035156,
      "text": " As you revealed to him, to his brethren,"
    },
    {
      "id": 160,
      "start": 2271.6000061035156,
      "end": 2274.1199951171875,
      "text": " the things that were going to happen,"
    },
    {
      "id": 161,
      "start": 2274.1199951171875,
      "end": 2275.1199951171875,
      "text": " I thank you this evening"
    },
    {
      "id": 162,
      "start": 2275.1199951171875,
      "end": 2276.9200134277344,
      "text": " that you've given us the whole Bible"
    },
    {
      "id": 163,
      "start": 2278.040008544922,
      "end": 2280.52001953125,
      "text": " and I pray that as we have the opportunity"
    },
    {
      "id": 164,
      "start": 2280.52001953125,
      "end": 2282.52001953125,
      "text": " to be students of your word,"
    },
    {
      "id": 165,
      "start": 2282.52001953125,
      "end": 2286.4400024414062,
      "text": " to attend a church that faithfully preaches your word,"
    },
    {
      "id": 166,
      "start": 2286.4400024414062,
      "end": 2289.9200134277344,
      "text": " God, you said to whom much is given, much is required"
    },
    {
      "id": 167,
      "start": 2289.9200134277344,
      "end": 2292.1199951171875,
      "text": " and I pray that you'd help us to go on the power"
    },
    {
      "id": 168,
      "start": 2292.1199951171875,
      "end": 2294.239990234375,
      "text": " of the Holy Spirit of God,"
    },
    {
      "id": 169,
      "start": 2294.239990234375,
      "end": 2296.8399963378906,
      "text": " help us to go with boldness and courage and love"
    },
    {
      "id": 170,
      "start": 2297.800018310547,
      "end": 2301.1600036621094,
      "text": " to a lost and dying world of things to come."
    },
    {
      "id": 171,
      "start": 2302.1600036621094,
      "end": 2305.480010986328,
      "text": " Every single person that we know one day"
    },
    {
      "id": 172,
      "start": 2305.480010986328,
      "end": 2306.6799926757812,
      "text": " will stand before you."
    },
    {
      "id": 173,
      "start": 2307.6400146484375,
      "end": 2310.0800170898438,
      "text": " God, would you help us to be mindful of that truth"
    },
    {
      "id": 174,
      "start": 2310.0800170898438,
      "end": 2312.3599853515625,
      "text": " as we go throughout our week,"
    },
    {
      "id": 175,
      "start": 2312.3599853515625,
      "end": 2314.1600341796875,
      "text": " as we interact with individuals,"
    },
    {
      "id": 176,
      "start": 2314.1600341796875,
      "end": 2316.6799926757812,
      "text": " help us to not be intimidated by their position,"
    },
    {
      "id": 177,
      "start": 2316.6799926757812,
      "end": 2321.6799926757812,
      "text": " by their possessions, by any status that they might have"
    },
    {
      "id": 178,
      "start": 2323.0800170898438,
      "end": 2326.0399780273438,
      "text": " but Lord, help us to go in the power of the Holy Spirit."
    },
    {
      "id": 179,
      "start": 2327.9600219726562,
      "end": 2330.8800048828125,
      "text": " I pray that you'd use us for your honor and for your glory."
    },
    {
      "id": 180,
      "start": 2331.5999755859375,
      "end": 2332.760009765625,
      "text": " I pray that you'd move during this time of invitation."
    },
    {
      "id": 181,
      "start": 2332.760009765625,
      "end": 2337.5999755859375,
      "text": " Lord, maybe you've convicted some, challenged some."
    },
    {
      "id": 182,
      "start": 2337.5999755859375,
      "end": 2342.5999755859375,
      "text": " Lord, I pray that we'd be responsive to your word tonight."
    },
    {
      "id": 183,
      "start": 2342.6799926757812,
      "end": 2344.239990234375,
      "text": " We'll thank you for every decision that's made"
    },
    {
      "id": 184,
      "start": 2344.239990234375,
      "end": 2345.6400146484375,
      "text": " for it's in Christ's name we pray."
    },
    {
      "id": 185,
      "start": 2345.6400146484375,
      "end": 2347.2000122070312,
      "text": " Would you stand with me?"
    },
    {
      "id": 186,
      "start": 2347.2000122070312,
      "end": 2348.8400268554688,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 187,
      "start": 2349.6799926757812,
      "end": 2351.760009765625,
      "text": " Kimberly's gonna play quietly on the piano tonight"
    },
    {
      "id": 188,
      "start": 2351.760009765625,
      "end": 2354.0,
      "text": " and maybe you wanna come to this old fashioned altar."
    },
    {
      "id": 189,
      "start": 2354.0,
      "end": 2355.9600219726562,
      "text": " Maybe you wanna thank God that he's given you his word,"
    },
    {
      "id": 190,
      "start": 2355.9600219726562,
      "end": 2357.3599853515625,
      "text": " that he saved your soul."
    },
    {
      "id": 191,
      "start": 2358.2000122070312,
      "end": 2360.6400146484375,
      "text": " Maybe this evening you wanna come and commit to the Lord"
    },
    {
      "id": 192,
      "start": 2361.4000244140625,
      "end": 2364.0399780273438,
      "text": " that you with his power, with his help,"
    },
    {
      "id": 193,
      "start": 2364.0399780273438,
      "end": 2366.0800170898438,
      "text": " are determining that you wanna be a witness"
    },
    {
      "id": 194,
      "start": 2366.0800170898438,
      "end": 2369.0,
      "text": " and tell others of things to come."
    },
    {
      "id": 195,
      "start": 2369.0,
      "end": 2371.2000122070312,
      "text": " As Kimberly plays, the altar is open."
    },
    {
      "id": 196,
      "start": 2371.2000122070312,
      "end": 2376.2000122070312,
      "text": " ♪ Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh ♪"
    }
  ],
  "processed_at": "2025-04-16T08:24:18.710691"
}