{
  "video_id": "DtcTsCiwnIM",
  "text": "Psalm 119, and I've titled the message this evening, Oh, How Love I Thy Law. Of course, we're familiar with that phrase as we'd consider Psalm 119 and verse number 97. Psalm 119 is a wonderful passage of scripture. Of course, it's the longest psalm in all of the Bible, 176 verses, and as you look at the psalm, you find that all but a handful of verses actually have some reference in them to God's word. Sometimes it's referred to as thy statutes, thy judgments, thy testimonies, thy word. There's all sorts of various phrases that are used all in speaking about the word of God and how thankful I am this evening that we have a Bible. I mean, it's a tremendous truth and reality that we have here, that every service, when I stand up behind this pulpit, I mean, without really thinking about it, I say, take your Bible and turn to. Why do I say that? Well, number one, I've been given the responsibility to preach the word, and so when we get behind the pulpit, we're preaching God's book, God's word, but I also have gotten into the routine of saying that because you have a Bible and you bring a Bible and you can turn to the pages in your Bible and you have, if you did not bring a Bible with you, each of our pews, we have pew Bibles and we wanna have people using the word and opening the Bible, and so without even thinking really much about it, I say, hey, if you have your Bibles, I said it this way tonight, take your Bible and turn to Psalm 119. That's what I said when I got up here. Why? Because we have a Bible. How many of you remember when Brother Jim Savalli was here, our missionary to Samoa? Some of you remember when he was here, and he said this when he was here, and I remember talking to him afterwards and since. I've had some opportunities to fellowship with Brother Savalli, and he made this statement. He said, I remember in our church in Samoa, the very first time I could ever say, take your Bible and turn to, and actually hear the pages of a Bible turning, because until that point, no one had a Bible because there were no Bibles available. And sometimes we don't really understand how blessed we have been. I mean, honestly, to have a Bible, most of us have multiple copies. We have Bibles on our, how many of you have a Bible on your phone, your iPad? You got a Bible, right? You're sitting in the doctor's office, and they said to be there at nine, and they don't see you until 10, unless you go to Brother Magnus'. I know he's right on time all the time. But the reality is that you sit there, you can pull, I went to the dentist a few weeks ago. I could pull out my phone, and I can access it. It's amazing what we have. The psalmist here in Psalm 119, he's speaking so much about the Bible, and he comes to verse 97, and he says, oh, how love I thy law, it, thy law, is my meditation all the day. Begin to think about that truth and what he's proclaiming there. Begin to think about the way in which you have opportunity to open the Bible, to read the Bible, and then to literally have the truth of God's word on your heart and on your mind throughout the day. I enjoy, I personally like reading my Bible early in the morning, not that I would not read it in the afternoon or evening, but I enjoy reading it in the morning, having my time with God every morning, getting into the word. Why? Because throughout the day, God will bring back to my heart and my mind truth that I had read earlier in the day. And here the psalmist says, it is my meditation all the day, that we read God's word, and we love God's word, and we have this idea that when we go throughout the day, that we're reminded and we're meditating upon, literally musing upon, chewing on, if you will, the truth that God revealed to us. We find that throughout the passage of scripture that the psalmist doesn't simply make the declaration in verse 97, if you will. Skip down and look at verse 140 with me. Notice what the Bible says here. Again, the psalmist still speaking, and he says, thy word is very pure. Therefore, thy servant loveth it. The psalmist recognized something to be true about God's word. He says that it's very pure. It reminds me of truth that we have previous in our Bibles in Psalm chapter 12, where the Bible says in verse number six, the words of the Lord are pure words. As silver tried in a furnace of earth purified seven times, thou shalt keep them, O Lord. Thou shalt preserve them from this generation forever. Only God could make that promise, and only God could keep that promise because he's eternal. We find that the psalmist says, thy word is very pure. Listen, this book, the Bible, there's nothing like it in all the world. There's not another book that you'll ever read that has the power or the purity that this book has. It is the mind of God, it is the very word of God. And we find that he says, therefore, because of my understanding of it being very pure, therefore thy servant loveth it. Skip down and notice in verse number 163, the Bible says, I hate and abhor lying, but thy law do I love. We think about this phrase, I hate and abhor lying, no doubt we understand that we do not enjoy when someone tells us lies, when someone's peddling falsehood, when someone is giving false teaching. And he says, but thy law do I love. And in this same Psalm, notice a couple of verses down in verse 165, great peace have they which love thy law, and nothing shall offend them. We should think about the truth of Psalm 118, 165, great peace have they which love thy law. Why? Because the person that loves the law of the Lord, the person that loves the word is gonna be in the word. The person that loves the word is going to spend time with God, going to learn more about God, and it's gonna have a great impact, great peace have they which love thy law. And he's already declared, I love thy law. In verse 167, just a few verses down, he says, my soul hath kept thy testimonies, and then notice how he words it here, and I love them exceedingly. I love them exceedingly. It's interesting that we find these declarations of the psalmist, really, we see five of them that we've looked at with regard to four specifically that speaks about how he loves, and then the result in verse 165. But I want you to back up, if you will. We skipped over one of the verses, and that's in 159. I want you to notice here, the Bible says this, consider how I love thy precepts. Quicken me, O Lord, according to thy loving kindness. It's interesting to me as I read verse 159 in Psalm 119, the psalmist has made the declaration in verse 97, the other verses that we've read a moment ago, he makes the declaration that he loves God's word. But then in Psalm 119 in verse 159, as he's praying to the Lord, he says, consider how I love thy precepts. It's one thing for us to declare our love for God's word. It's quite another thing for us to say to God, consider how I love thy precepts. I mean, the reality is that when we talk and we understand this evening about the Bible, and we spent two days this week on Friday and Saturday putting scriptures together and having that opportunity at Scripture Assembly to put nearly 22,000 John and Romans together, why? Well, because we love the Bible, but we want the truth of God's word to be given to those who do not have it readily available. Why is it that Beacon of Truth is printing Bibles and engaged in the work? Why is it that we give to a ministry to print portions of scripture from tracts and John and Romans, Romans booklets, New Testaments, full Bibles? Why? Because we know the power of God's word, we love God's word, and we want other people to have it. So we labor, we work, we give of our resources so that the word can be published, so that the word can be proclaimed and be distributed around the world. But we come this evening to the personal nature of what the psalmist says, oh, how love I thy law. There's many reasons that we should love God's word. We looked at one there in Psalm 140, in Psalm 119, verse 140, where he says that thy word is very pure. We understand this book is a perfect book. This book is God's book, it's perfect. The source, all scripture. How much scripture? All scripture is given by inspiration of God. What a joy to know the book that we hold in our hands, that this book is pure, that this book is the very word of God. It's inspired by God. We find that the psalmist said, as we looked in Psalm 12, but in Psalm 19, in verse number seven, the psalmist makes this declaration with regard to God's word. The law of the Lord is perfect. It's perfect. I've read books, I have a number of them on my bookshelf. I've read books that have errors. Never found an error in the Bible. Oh, I've had people come to me and said they. found errors. You know what I find most often, Mark? They just really went to a website somewhere and they looked up errors in the Bible and they just took some man's word for the fact that there's a contradiction or an error. I often have said, oh, there's, the book is full of contradictions. You ever have anyone tell you that? And I hand them my Bible and say, well, if it's full of them, can you show me one? Well, I don't, I don't know any off the top of my head. You just kind of laugh and just kind of carry on. But the reality is that someone said this, if you think there's a mistake, you're mistaken. See, some of the truth of God's word requires that we dig and we dig and we labor and we labor. I remember hearing a preacher say this, and I remember exactly the number of years we was at a conference that we're at last July. And there was one portion of scripture that he struggled with understanding and he prayed for years that God would give him an understanding of that portion of scripture. And he stood before us and he testified at what joy it was when God finally revealed to him the truth of that portion of scripture that he had prayed over and labored over. This book is amazing. It's a perfect book. I'm thankful that God preserved it. Wouldn't it be, we understand this evening the truth of inspiration. All scripture is given by inspiration of God. And inspiration is important Bible doctrine. It's absolutely imperative that we understand that all scripture is given by inspiration. There are people today that would like to make you think and would like to peddle their ideas that it's just man's words that man wrote. No, it's God's word and we can rest assured of that. But we also understand that God not only inspired His word, but He preserved His word. And that wonderful truth of preservation is so important for us this evening. Why? We don't have the originals. In fact, when Paul was writing and he says to Timothy in 2 Timothy chapter number 4, bring these things and especially the parchments. Those were copies of copies of copies of copies. He didn't have the originals either, but God said that He would preserve His word. And we hold in our hands this evening the very preserved book that God has given to us. We understand this evening here, even in Psalm 119, in verse number 89, the Bible says this, forever, O Lord, Thy word is settled in heaven. In verse 160 of Psalm 119, the Bible says this, it says, Thy word is true from the beginning and every one of Thy righteous judgments endureth forever. How many of them? It says every one. Only God can do that. Only God can do that. That reminds us this evening of how blessed we are to have the preserved book, the preserved word of God. I find that this book is profitable often as we deal with the truth of 2 Timothy chapter 3 and verse number 16 and we talk about the fact that all scripture is given by inspiration of God, but it says that it's profitable. It's profitable. Why do we read the Bible? We'll get to that in just a few moments, but we understand that we read it because it's a profit to us. It benefits us. Why is it that we hear the preaching of God's word? Why is it that the preacher has been given the responsibility to preach the word? Because it's the word that changes lives. It's the word that's profitable. It's God's word. We find this evening that this book is profitable. I'm reminded of Joshua one and verse number eight. In fact, many of you, uh, we could, we could quote the verse, but I want you to go back there and I want you to look at what's happening in Joshua chapter number one. And I want you to consider, uh, just some truth about this and Joshua one and all the circumstances that are taking place with regard to Moses. In fact, in verse number one, the Bible says now after the death of Moses, now this is a simple question this evening, but who is the human penman for the first five books of the Bible? Moses, right? The Pentateuch, we often refer to the law, the Pentateuch, the books of Moses and those first five books, God used Moses to pen those. And, uh, he's the human penman, but we find that the Bible says now after the death of Moses, the servant of the Lord, it came to pass that the Lord spake unto Joshua, the son of none, Moses, his minister saying, Moses, my servant is dead. Now therefore arise, go over this Jordan, thou and all this people unto the land, which I do give to them, even to the children of Israel. We're not going to go through the entirety here, but we find that there's a promise given in verse number five, there shall not any man be able to stand before thee all the days of thy life. As I was with Moses, so I will be with thee. I will not fail thee nor forsake thee. Moses left a couple of very important things. Number one, he left a great example for Joshua. Moses was a faithful minister. Moses was a man that, uh, was, was faithful in all his house. He did so many wonderful things. God used him greatly. And we find that he had influence in the life of Joshua. But I want you to understand that Moses also left a book. He left a book. And we find that the Bible says as God gives to Joshua this promise of victory and he says, be strong in verse number six and have a good courage for unto this people shalt thou divide for an inheritance the land, which I swear unto their fathers to give them. Only be thou strong and very courageous that thou mayest observe to do according to all the law, which Moses, my servant, commanded thee, turn not from it to the right hand or to the left that thou mayest prosper whithersoever thou goest. And then here's the verse in verse number eight, this book of the law, this book of the law, Moses was faithful to, to, to write down what God had commanded him to write down. Yes, he was faithful. You find throughout the pages of the Pentateuch that God would say to Moses, say this to my people, and then you'll see where Moses goes and says this to his people. Moses was faithful. He says, this book of the law shall not depart out of thy mouth, but thou shalt meditate therein. Notice what it says, day and night. For what purpose? That thou mayest observe, what does it say? To do. To do according to all that is written therein. For then thou shalt make thy way prosperous and then thou shalt have good success. This evening I have this verse of scripture. I have just four little phrases, really three of them are just words, single words that are underlined in my Bible. The first phrase is to do. The second one is all. And then the next two that I have underlined, both of them the same word then. We understand when then occurs. Then is a sequence of events, if you will. It's a time, it's an order. And we find here this evening that the then of verse number eight in Joshua chapter number one, we desire. What is the then? It's to make thy way prosperous. It's to have good success. Praise the Lord. I mean, that's what we want. That's our desire. That's our goal. But the reality is we never get there if we're not meditating there in day and night. If we're not doing that, getting into God's word so that we could do according to all that is written therein. We're not going to do what we do not know. You say, well, that's pretty basic I know. The message tonight is actually very basic. But sometimes you've got to get back to the basics. You've got to get back to the basics. You're not going to do what you don't know. It's just not going to happen. So we've got to get into the book, get into the Bible, allow the Bible to get into us and understand that we need to do all that is written therein. I pray, I think almost every single time that I pray when I enter into my time of devotions personally and when I enter into this pulpit, I pray God help us to be doers of the word and not hearers only. Why? Well, because James one tells us that it's, we're deceiving ourselves if we're hearers and we're not doers. We're to be doing the word. Yes, we have to hear it, but we must make a commitment to doing it. I want you to understand this evening the book that we hold in our hands is powerful. It's powerful. Notice with me a truth in Jeremiah chapter 23. In Jeremiah chapter 23 this evening we see these words written with regard to the power of God's word. This book that we hold, dear, that we hold in our hands this evening, in Jeremiah chapter 23 and verse number 28, notice what the Bible says. The prophet that hath a dream, let him tell a dream. And he that hath my word, let him speak my word faithfully. What is the chaff to the wheat, saith the Lord? Chaff is useless rubbish. That's what it is. But wheat, it's profitable. Wheat, it's nourishing. You want to separate the chaff from the wheat, do you not? They would do that, it was a, we understand the purpose, the process, and we find here that God says, what is the chaff to the wheat? And then he says this in verse 29, is not my word like as a fire, saith the Lord, and like a hammer that breaketh the rock in pieces? Therefore, behold, I am against the prophets, saith the Lord, that steal my words every one from his neighbor. God's word is powerful. So often as we think about the declaration of the psalmist this evening, again, there's many reasons in which we would agree with the psalmist, oh, how love I thy law. We love God's word. We love the Bible. But I ask this question of myself, and I ask you this evening as we look at this thought tonight and consider this truth from Psalm 119, is the, does the evidence, or is there evidence that supports the claim? We can claim just about anything we want to claim, but what does the evidence say? What does the evidence support? If we say we love something, then there should be evidence to support the claim. And here this evening, we begin to think about this declaration, oh, how love I thy law. There ought to be something in the life of the psalmist, there ought to be something in your life and my life that would support the claim if we're going to say I love God's word. I would say very basically this evening in a very simple idea is that we, number one, would read the Bible. Just read the Bible. I don't like reading. Learn to. This book is not like any other book. I don't have time to read. You better make time. Let me rephrase that. You better steward time. I often say to Joseph and to our other children and to many of you, you cannot make time. We cannot make time. We are stewards of time. We can't make time. We steward time. You better steward time to read God's word. It's not going to happen on accident. It's not going to happen by chance. You're going to have to purpose to read God's word. We give out the Bible reading schedules. I don't have any up here in the daily devotional that we gave you. There's a Bible reading schedule in there. There's all sorts of things that you can use. You can use apps and so on and so forth that give you a daily reading schedule. Can I tell you this evening that we're not reading the Bible simply to fill out a book that we hand you in the beginning of the year? That we give you this book that gives you so many chapters each day and so on and so forth? No. We're giving you the book as a tool. But we don't read the Bible so that we can check off that little box that's there in that little booklet. No. We're not reading the Bible because we understand what the Bible is. And if we love the Bible, we better be reading the Bible. And if we're not reading the Bible, then we can't claim to love the Bible because the evidence doesn't support the claim. It's sad to me this evening that you can look at, and I understand statistics, and I shared some statistics in the message this morning, and I understand the statistics can be skewed one way or the other and so on and so forth. I get all of that. But the statistics do reveal something, and there's a number of statistics that have been given over the last couple of decades with regard to the number of people that are professing Christians that have never read Genesis to Revelation. They've never read the entire Bible in their entire Christian life. People that admit, acknowledge that they don't read the Bible daily. They go to church, they believe the Bible is God's word, but they don't read the Bible. This evening, Paul tells Timothy, and I understand that it's within the context of Paul coming to where Timothy is, but he says, till I come, give attendance to reading, to exhortation, to doctrine. We teach our children to read the Bible. Why? Because we know what the Bible is. We know what the Bible is capable of doing. We know that it's God's word, that it's perfect, it's preserved, it's profitable. We understand the power of God's word, so we teach them to read it. I've not kept track over the years how many times I've read through the Bible from cover to cover. But I never get to the point where I finish reading the Bible and I say, well, I guess I don't have to read it again. No. I just start right back the next day in Genesis 1. I've shared with you from the pulpit before, I'm the kind of, I like reading Genesis to Revelation, Genesis, that's just how I like reading it. I understand the chronological aspect of it, I understand all of that, I'm not interested really too much in the chronological reading of it, that's just my own preference. I've done it that way before and I think it's good to be able to understand the chronological order of things. I'm not one for reading some old and some, I just like doing it that way. We all have our preference. Somebody said this, I don't like the way, they were speaking to D. L. Moody, I don't like the way that you share the Gospel. And he said, okay, well, why don't you tell me how you do it? He said, well, I don't. And he said, well, I like my way better than your way. You may have a preference on how you read, whether you read some old and some new, whether you read, but you better be reading it, better be reading it. The entrance of thy word, give it light. As newborn babes desire the cereal milk of the word that you may grow thereby. Strong me, in Hebrews chapter number 5, belonging to them who are full age. In the time, he says in the same passage, that you ought to be teachers, you have need that one teach you, and we find that we must be reading the Bible. Bible reading is so important. We sing the song with the little kids. In fact, if I called the kids up here this evening to sing it, they'd sing it for you. Read your Bible, pray every day, and you'll do what? Grow, grow, grow, right? It's absolutely imperative. It is a, it's a daily discipline when we read God's word. Not only do we read it, if we love God's word, we ought to be reading God's word. The evidence to support the claim. If we love God's word, we ought to be studying God's word. I believe there's a difference between reading and studying. I believe that as you look at the scriptures, that you'll find that we're to read the Bible, but every time that I read the Bible, every time that you read the Bible, you may not have opportunity to study the Bible at that very time. But how are we studying the Bible? Is there some time in our week, in our schedule that we've set aside for some Bible study where we're going to dig deeper than just reading? And one of the aids that I think is so important is that while you're reading, that you keep a notebook or you keep something where you can jot down, hey, I want to go back and look at this. I want to go back and find out more about this. What happened in this city? Who are these people? What's going on? So on and so forth. And we're going to dig deeper, maybe a connection, no scriptures of any private interpretation. We interpret scripture with scripture and it requires study. Can I tell you that study is work? Study is work. Takes work. It takes commitment. It takes dedication. It takes time. But we find that the Bible says in a verse that we're most of us are familiar with, study in 2 Timothy 2 and verse 15, to show thyself a proven to God, a workman that needeth not to be ashamed, rightly dividing the word of truth. If you're not reading and studying your Bible, you know what's going to happen, you'll believe a lie, false teachers, you listen to something on the internet, some YouTube channel, some internet preacher, and you've not read and studied and you're not grounded in the truth of God's word, start believing crazy things. Seriously. Happens all the time. People say, what do you think about this? Where did you get that idea? Because you didn't get that idea from reading the Bible. You got that idea from watching something online, watching something, and you try to read it into the Bible. But if you're reading the Bible, studying the Bible, oh, it's so important. The psalmist says, I love God's word. We must read it. We must study it. Can I say this evening we should memorize it? I know that I mentioned this morning, I did on Wednesday as well, the importance of memorizing. We have verses each month that we have given you to try to encourage you to memorize God's word. And oftentimes I think it's a misunderstanding or misconception that we have in our churches that we think Bible memorization is for children. We kind of have this idea that you get a memory verse on Sunday school and it's kind of for the children. And Joseph gave all the little kids today from Sunday school, gave them a memory verse that they were going to work on this week. And Holly gives the kids memory verses on Wednesday night in their class. I think it's wonderful. The Children's Church, Junior Church, Jennifer and Lena, the kids will come up here and they'll give us some verses that they've memorized. They'll sing some songs. But we are to memorize God's word. Hide God's word in our hearts. Bible memorization requires… requires labor. As some often will say, well, you just can memorize things better. You just have a better mind. It just requires work. It requires work, commitment, dedication. Take one verse a month, a week, however you do it, and just work on memorizing that verse, hiding God's Word. Listen, it's a truth that God gives us throughout His Word, wherewithal shall a young man cleanse his way by taking heed thereto according to thy Word. Thy Word have I hid in mine heart that I might not sin against thee, in Psalm 119 verses 9 and 11. But the Lord Jesus Christ, when He was tempted, He's led of the spirit into the wilderness and the enemy, Satan, comes and tempts. And in each of those accounts He says, it is written. What a great pattern for us this evening to understand that we can't say it is written if we don't have Scripture memorized in our heart. At that moment of temptation, at that moment of difficulty of trial, that we have God's Word memorized, that we can immediately recite it and rehearse it and be able to use the sword of the Spirit, which is the Word of God, in order to combat our enemy. Oh, we need to know, memorize God's Word. Yes, it's work. Yes, it's labor. But I want to encourage you this evening to memorize God's Word. Someone wrote, I don't remember if it was Harlan Popov or someone else, but they posed the question this way. If someone took your Bible away, and I know that's a hard thing for us to think about, but I want you to know there's many people groups that have had that happen. Many people groups, they come in and they confiscate all the Bibles. Why do they do that? Because they know the power of this book. They do. Take all the Bibles away. The question was this, if someone took your Bible away, how much Bible would you still have? If someone took your Bible away, how much Bible would you still have? While I was in Bible college, there was a, I think it was only one or two years that I was there that they had it, but they had an old style camp meeting. It was a thing called Camp Glory, Camp Glory. And Holly, when she was younger, her church would come over and participate in that. It was, put a big tent out and had this Camp Glory. And I remember all the sound equipment would be under there. And so as a college student, they asked some of us on one of the evenings if we'd sleep under the tent so that there'd be some people there to protect all of the valuable equipment with all the sound equipment and what have you. And I remember at the time, Holly and I weren't married, I was in college, but some of her brothers and myself and a couple of other college students, we slept under the tent that night. And for a couple of hours, we just quoted scripture. And here's how we do it. There's like six of us and they'd have to memorize and quote, rehearse a verse. And then the next person, the next person, the next person, the next person, just kind of go right in a circle. And just how many verses could we quote? How many verses had we hid in our hearts? And you'd be laying there and you've already quoted five, six, seven, however many verses. And you're trying to think of the next one you're going to say. And then two people before you said it and you said, no, that was the one I was going to say. Right. And you're trying to think about the verses, but, but hiding God's word in our hearts. If we love God's word, you know, it's amazing to me. There's some people that you can talk to that can tell you all kinds of statistics about all kinds of things. They can rattle off sports information. They can tell you about all of these statistics and so on and so forth. That stuff is going to matter nothing in eternity. But then you challenge them to memorize a verse of scripture. Well, I just don't have a good memory. I just can't do it. Are you kidding me? You know all of this stuff about all these other things, but you can't. And it's just a, if I love God's word, if you love God's word, we're going to be memorizing it. We talked about reading it and studying it, memorizing it. The Psalmist said in Psalm 119, it is my meditation. Oh, how love I thy law. It is my meditation all the day. I preached a message years ago from Psalm 119. Actually, it was a Sunday school class that I taught that we need to get to the place where we think and act biblically. To think and act biblically. That we have so much of God's word in us that it impacts our thoughts, it impacts our behavior, and we begin to think and act biblically. When someone asks you a question, I mean, without giving much thought to it, you're immediately thinking about a Bible principle that you could give as an answer. When you're, I say this to guys as I try to help them with preparing messages, and you know it, those of you that have been here for any length of time, almost every illustration that I use with the Bible, I try to use a Bible illustration. Go to a Bible passage that gives us and illustrates that truth that we're working with. Why? Because the Bible is full of it. It has so much rich information for us where we can see, here's a Bible principle, but here's how it applied. Here's how they used the Bible principle, or here's how they did not apply the Bible principle, and here's what happened. Begin to think and act biblically. Why? Because we're saturating our minds with the Bible. We're reading it. We're studying it. We're memorizing it. It's on my mind throughout the day. And then I would say this, finally this evening as we wrap up, if I love God's Word, I'm going to talk about it. I'm going to share it with others. I'm going to share the truth of God's Word with others. And it doesn't have to be something that's forced. It doesn't have to be something that is any type of manipulation. No, it's just going to come natural. Why? Because it's so much in me that it's just the overflow. But I want to talk about the Bible. And the reality this evening is that you study throughout the pages of Scripture, you look at the Apostle Paul, and I understand that as he's ministering there, and God used him to write so much of our New Testament from a human perspective, but we find this evening that we as the people of God, we need to be sharing the truth of God's Word. And if I love God's Word, I'm going to talk about God's Word. How do I know that? Because you talk about what you love. You talk about what you love. You meet somebody that you've never met before, and you talk to them for a little while, and you can find out their likes, their dislikes, their loves. You can find out their interests. Why? Because they talk about what they love. You ever meet somebody that's all about cars? They're talking about cars, and they're just, I didn't look at you, Ron, for that purpose. Sorry. But you're looking, and you're just talking about, but it's, they, we understand it. But I wonder this evening, how often when we as God's people just kind of are having fellowship, how often do we talk about God's Word? Like, just naturally. Just when's the last time you said to someone, or maybe someone said to you, hey, what's God teaching you from His Word? And the fact that we wouldn't be fearful of someone asking us that question, that we are spending so much time in God's Word, that daily we're in the Bible because we love it. We say, oh, how love I thy law, that I'm not afraid of someone asking me, hey, what's God teaching you in His, from His Word? What did you read today? What are you studying? What are you learning? What is God revealing? We shouldn't have to be afraid of that question if we love God's Word. This evening I would submit to you, as Bible-believing Christians, that we ought to echo the words of the psalmist and say, oh, how love I thy law. But there ought to be evidences in our lives that would support the claim. Really, you say that you love God's Word? Does the evidence support it? We're to inspect and examine ourselves, not someone else. We'll examine our own hearts. How's my Bible reading? As you think about that this evening, just ask yourself, how's my Bible reading? I've told you before, there's times that I go to read my Bible and I'm distracted. You say, oh, you're the pastor. I'm a human being. There are times I go to read my Bible and I'm distracted. I'll read a chapter, two, maybe three, and I'm like, I have no idea what I just read. I'm distracted. So you know what I do? I've told you before, from this pulpit what I do. I go back and I start over and I pray, God, help me to not be distracted. Eliminate those distractions. Help me to be focused. Why? Because this is your Word and you have something for me. And I want to get what you have for me because I need it. We come to the place where we say, listen, how's my Bible reading? When's the last time I shared something from God's Word with someone else? I mean, not forced to, but just because it's got to come out, it's the overflow. Like it's just, I want to talk about it. And that's why I see the psalmist, oh, how love I thy law. I hope this evening that each of us would say, I love God's Word. And then we'd examine ourselves and see if the evidence supports the claim. Let's pray. Father, we love you. Thank you for loving us. It's a joy to have the Bible. It's a joy this evening to know that you've given us the opportunity to put together scriptures, John and Romans, these last couple of days. It's a labor of love. It's a labor. Because we know the power of Your Word. We know that it's profitable. Being born again not of corruptible seed but of incorruptible by the Word of God which liveth and abideth forever. God, I pray that You would help us to love Your Word. And I pray that the evidences would be in our lives that as we examine ourselves, Lord, You'd help us to read and study and memorize and meditate and share Your Word. Help it to be fresh. Lord, give us revival. I pray that You'd move and work in hearts and lives as only You can and we'll thank You for it in Christ's name we pray. Would You stand with us?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.920000076293945,
      "text": " Psalm 119, and I've titled the message this evening,"
    },
    {
      "id": 1,
      "start": 4.920000076293945,
      "end": 7.639999866485596,
      "text": " Oh, How Love I Thy Law."
    },
    {
      "id": 2,
      "start": 7.639999866485596,
      "end": 9.479999542236328,
      "text": " Of course, we're familiar with that phrase"
    },
    {
      "id": 3,
      "start": 9.479999542236328,
      "end": 13.0600004196167,
      "text": " as we'd consider Psalm 119 and verse number 97."
    },
    {
      "id": 4,
      "start": 13.0600004196167,
      "end": 16.31999969482422,
      "text": " Psalm 119 is a wonderful passage of scripture."
    },
    {
      "id": 5,
      "start": 16.31999969482422,
      "end": 18.760000228881836,
      "text": " Of course, it's the longest psalm in all of the Bible,"
    },
    {
      "id": 6,
      "start": 18.760000228881836,
      "end": 21.719999313354492,
      "text": " 176 verses, and as you look at the psalm,"
    },
    {
      "id": 7,
      "start": 21.719999313354492,
      "end": 24.760000228881836,
      "text": " you find that all but a handful of verses"
    },
    {
      "id": 8,
      "start": 24.760000228881836,
      "end": 29.68000030517578,
      "text": " actually have some reference in them to God's word."
    },
    {
      "id": 9,
      "start": 29.68000030517578,
      "end": 31.959999084472656,
      "text": " Sometimes it's referred to as thy statutes,"
    },
    {
      "id": 10,
      "start": 31.959999084472656,
      "end": 35.279998779296875,
      "text": " thy judgments, thy testimonies, thy word."
    },
    {
      "id": 11,
      "start": 35.279998779296875,
      "end": 37.959999084472656,
      "text": " There's all sorts of various phrases"
    },
    {
      "id": 12,
      "start": 37.959999084472656,
      "end": 41.31999969482422,
      "text": " that are used all in speaking about the word of God"
    },
    {
      "id": 13,
      "start": 41.31999969482422,
      "end": 45.2400016784668,
      "text": " and how thankful I am this evening that we have a Bible."
    },
    {
      "id": 14,
      "start": 45.2400016784668,
      "end": 47.52000045776367,
      "text": " I mean, it's a tremendous truth"
    },
    {
      "id": 15,
      "start": 47.52000045776367,
      "end": 50.02000045776367,
      "text": " and reality that we have here,"
    },
    {
      "id": 16,
      "start": 50.02000045776367,
      "end": 52.97999954223633,
      "text": " that every service, when I stand up behind this pulpit,"
    },
    {
      "id": 17,
      "start": 52.97999954223633,
      "end": 55.08000183105469,
      "text": " I mean, without really thinking about it,"
    },
    {
      "id": 18,
      "start": 55.08000183105469,
      "end": 57.63999938964844,
      "text": " I say, take your Bible and turn to."
    },
    {
      "id": 19,
      "start": 58.599998474121094,
      "end": 59.63999938964844,
      "text": " Why do I say that?"
    },
    {
      "id": 20,
      "start": 59.63999938964844,
      "end": 62.0,
      "text": " Well, number one, I've been given the responsibility"
    },
    {
      "id": 21,
      "start": 62.0,
      "end": 64.5199966430664,
      "text": " to preach the word, and so when we get behind the pulpit,"
    },
    {
      "id": 22,
      "start": 64.5199966430664,
      "end": 67.05999755859375,
      "text": " we're preaching God's book, God's word,"
    },
    {
      "id": 23,
      "start": 67.05999755859375,
      "end": 70.73999786376953,
      "text": " but I also have gotten into the routine of saying that"
    },
    {
      "id": 24,
      "start": 70.73999786376953,
      "end": 73.23999786376953,
      "text": " because you have a Bible and you bring a Bible"
    },
    {
      "id": 25,
      "start": 73.23999786376953,
      "end": 76.86000061035156,
      "text": " and you can turn to the pages in your Bible"
    },
    {
      "id": 26,
      "start": 76.86000061035156,
      "end": 80.04000091552734,
      "text": " and you have, if you did not bring a Bible with you,"
    },
    {
      "id": 27,
      "start": 80.04000091552734,
      "end": 82.36000061035156,
      "text": " each of our pews, we have pew Bibles"
    },
    {
      "id": 28,
      "start": 82.36000061035156,
      "end": 85.73999786376953,
      "text": " and we wanna have people using the word"
    },
    {
      "id": 29,
      "start": 85.77999877929688,
      "end": 87.69999694824219,
      "text": " and opening the Bible,"
    },
    {
      "id": 30,
      "start": 87.69999694824219,
      "end": 90.31999969482422,
      "text": " and so without even thinking really much about it,"
    },
    {
      "id": 31,
      "start": 90.31999969482422,
      "end": 91.37999725341797,
      "text": " I say, hey, if you have your Bibles,"
    },
    {
      "id": 32,
      "start": 91.37999725341797,
      "end": 93.22000122070312,
      "text": " I said it this way tonight,"
    },
    {
      "id": 33,
      "start": 93.22000122070312,
      "end": 95.30000305175781,
      "text": " take your Bible and turn to Psalm 119."
    },
    {
      "id": 34,
      "start": 95.30000305175781,
      "end": 96.83999633789062,
      "text": " That's what I said when I got up here."
    },
    {
      "id": 35,
      "start": 96.83999633789062,
      "end": 97.68000030517578,
      "text": " Why?"
    },
    {
      "id": 36,
      "start": 97.68000030517578,
      "end": 98.86000061035156,
      "text": " Because we have a Bible."
    },
    {
      "id": 37,
      "start": 100.05999755859375,
      "end": 102.77999877929688,
      "text": " How many of you remember when Brother Jim Savalli was here,"
    },
    {
      "id": 38,
      "start": 102.77999877929688,
      "end": 103.9800033569336,
      "text": " our missionary to Samoa?"
    },
    {
      "id": 39,
      "start": 103.9800033569336,
      "end": 105.26000213623047,
      "text": " Some of you remember when he was here,"
    },
    {
      "id": 40,
      "start": 105.26000213623047,
      "end": 107.0199966430664,
      "text": " and he said this when he was here,"
    },
    {
      "id": 41,
      "start": 107.0199966430664,
      "end": 109.54000091552734,
      "text": " and I remember talking to him afterwards and since."
    },
    {
      "id": 42,
      "start": 109.54000091552734,
      "end": 111.22000122070312,
      "text": " I've had some opportunities to fellowship"
    },
    {
      "id": 43,
      "start": 111.22000122070312,
      "end": 113.9000015258789,
      "text": " with Brother Savalli, and he made this statement."
    },
    {
      "id": 44,
      "start": 113.9000015258789,
      "end": 116.5,
      "text": " He said, I remember in our church in Samoa,"
    },
    {
      "id": 45,
      "start": 116.5,
      "end": 119.41999816894531,
      "text": " the very first time I could ever say,"
    },
    {
      "id": 46,
      "start": 119.41999816894531,
      "end": 121.54000091552734,
      "text": " take your Bible and turn to,"
    },
    {
      "id": 47,
      "start": 121.54000091552734,
      "end": 124.83999633789062,
      "text": " and actually hear the pages of a Bible turning,"
    },
    {
      "id": 48,
      "start": 124.83999633789062,
      "end": 128.77999877929688,
      "text": " because until that point, no one had a Bible"
    },
    {
      "id": 49,
      "start": 128.77999877929688,
      "end": 131.4199981689453,
      "text": " because there were no Bibles available."
    },
    {
      "id": 50,
      "start": 131.4199981689453,
      "end": 133.97999572753906,
      "text": " And sometimes we don't really understand"
    },
    {
      "id": 51,
      "start": 133.97999572753906,
      "end": 136.13999938964844,
      "text": " how blessed we have been."
    },
    {
      "id": 52,
      "start": 136.13999938964844,
      "end": 138.74000549316406,
      "text": " I mean, honestly, to have a Bible,"
    },
    {
      "id": 53,
      "start": 138.74000549316406,
      "end": 141.0,
      "text": " most of us have multiple copies."
    },
    {
      "id": 54,
      "start": 141.0,
      "end": 142.05999755859375,
      "text": " We have Bibles on our,"
    },
    {
      "id": 55,
      "start": 142.05999755859375,
      "end": 144.4199981689453,
      "text": " how many of you have a Bible on your phone, your iPad?"
    },
    {
      "id": 56,
      "start": 144.4199981689453,
      "end": 145.47999572753906,
      "text": " You got a Bible, right?"
    },
    {
      "id": 57,
      "start": 145.47999572753906,
      "end": 146.8800048828125,
      "text": " You're sitting in the doctor's office,"
    },
    {
      "id": 58,
      "start": 146.8800048828125,
      "end": 148.25999450683594,
      "text": " and they said to be there at nine,"
    },
    {
      "id": 59,
      "start": 148.25999450683594,
      "end": 149.66000366210938,
      "text": " and they don't see you until 10,"
    },
    {
      "id": 60,
      "start": 149.66000366210938,
      "end": 151.02000427246094,
      "text": " unless you go to Brother Magnus'."
    },
    {
      "id": 61,
      "start": 151.02000427246094,
      "end": 152.97999572753906,
      "text": " I know he's right on time all the time."
    },
    {
      "id": 62,
      "start": 152.97999572753906,
      "end": 154.77999877929688,
      "text": " But the reality is that you sit there,"
    },
    {
      "id": 63,
      "start": 154.77999877929688,
      "end": 157.27999877929688,
      "text": " you can pull, I went to the dentist a few weeks ago."
    },
    {
      "id": 64,
      "start": 157.27999877929688,
      "end": 160.17999267578125,
      "text": " I could pull out my phone, and I can access it."
    },
    {
      "id": 65,
      "start": 160.17999267578125,
      "end": 163.66000366210938,
      "text": " It's amazing what we have."
    },
    {
      "id": 66,
      "start": 163.66000366210938,
      "end": 165.3000030517578,
      "text": " The psalmist here in Psalm 119,"
    },
    {
      "id": 67,
      "start": 165.3000030517578,
      "end": 167.86000061035156,
      "text": " he's speaking so much about the Bible,"
    },
    {
      "id": 68,
      "start": 167.86000061035156,
      "end": 170.77999877929688,
      "text": " and he comes to verse 97,"
    },
    {
      "id": 69,
      "start": 170.77999877929688,
      "end": 171.6199951171875,
      "text": " and he says,"
    },
    {
      "id": 70,
      "start": 171.6199951171875,
      "end": 174.77999877929688,
      "text": " oh, how love I thy law, it, thy law,"
    },
    {
      "id": 71,
      "start": 174.77999877929688,
      "end": 178.5,
      "text": " is my meditation all the day."
    },
    {
      "id": 72,
      "start": 178.5,
      "end": 180.16000366210938,
      "text": " Begin to think about that truth"
    },
    {
      "id": 73,
      "start": 180.16000366210938,
      "end": 182.3000030517578,
      "text": " and what he's proclaiming there."
    },
    {
      "id": 74,
      "start": 182.3000030517578,
      "end": 184.86000061035156,
      "text": " Begin to think about the way in which you have opportunity"
    },
    {
      "id": 75,
      "start": 184.86000061035156,
      "end": 187.6999969482422,
      "text": " to open the Bible, to read the Bible,"
    },
    {
      "id": 76,
      "start": 187.6999969482422,
      "end": 191.4199981689453,
      "text": " and then to literally have the truth of God's word"
    },
    {
      "id": 77,
      "start": 191.4199981689453,
      "end": 195.24000549316406,
      "text": " on your heart and on your mind throughout the day."
    },
    {
      "id": 78,
      "start": 195.24000549316406,
      "end": 198.4199981689453,
      "text": " I enjoy, I personally like reading my Bible"
    },
    {
      "id": 79,
      "start": 198.4199981689453,
      "end": 199.77999877929688,
      "text": " early in the morning,"
    },
    {
      "id": 80,
      "start": 199.77999877929688,
      "end": 202.82000732421875,
      "text": " not that I would not read it in the afternoon or evening,"
    },
    {
      "id": 81,
      "start": 202.82000732421875,
      "end": 205.17999267578125,
      "text": " but I enjoy reading it in the morning,"
    },
    {
      "id": 82,
      "start": 205.17999267578125,
      "end": 208.4199981689453,
      "text": " having my time with God every morning,"
    },
    {
      "id": 83,
      "start": 208.4199981689453,
      "end": 209.89999389648438,
      "text": " getting into the word."
    },
    {
      "id": 84,
      "start": 209.89999389648438,
      "end": 210.74000549316406,
      "text": " Why?"
    },
    {
      "id": 85,
      "start": 210.74000549316406,
      "end": 211.77999877929688,
      "text": " Because throughout the day,"
    },
    {
      "id": 86,
      "start": 211.77999877929688,
      "end": 215.13999938964844,
      "text": " God will bring back to my heart and my mind"
    },
    {
      "id": 87,
      "start": 215.13999938964844,
      "end": 218.10000610351562,
      "text": " truth that I had read earlier in the day."
    },
    {
      "id": 88,
      "start": 218.10000610351562,
      "end": 219.13999938964844,
      "text": " And here the psalmist says,"
    },
    {
      "id": 89,
      "start": 219.13999938964844,
      "end": 221.33999633789062,
      "text": " it is my meditation all the day,"
    },
    {
      "id": 90,
      "start": 221.33999633789062,
      "end": 224.67999267578125,
      "text": " that we read God's word, and we love God's word,"
    },
    {
      "id": 91,
      "start": 224.67999267578125,
      "end": 227.47999572753906,
      "text": " and we have this idea that when we go throughout the day,"
    },
    {
      "id": 92,
      "start": 227.52000427246094,
      "end": 230.27999877929688,
      "text": " that we're reminded and we're meditating upon,"
    },
    {
      "id": 93,
      "start": 230.27999877929688,
      "end": 233.4600067138672,
      "text": " literally musing upon, chewing on, if you will,"
    },
    {
      "id": 94,
      "start": 233.4600067138672,
      "end": 236.4199981689453,
      "text": " the truth that God revealed to us."
    },
    {
      "id": 95,
      "start": 237.6999969482422,
      "end": 240.32000732421875,
      "text": " We find that throughout the passage of scripture"
    },
    {
      "id": 96,
      "start": 240.32000732421875,
      "end": 243.82000732421875,
      "text": " that the psalmist doesn't simply make the declaration"
    },
    {
      "id": 97,
      "start": 243.82000732421875,
      "end": 245.67999267578125,
      "text": " in verse 97, if you will."
    },
    {
      "id": 98,
      "start": 245.67999267578125,
      "end": 248.75999450683594,
      "text": " Skip down and look at verse 140 with me."
    },
    {
      "id": 99,
      "start": 248.75999450683594,
      "end": 250.8000030517578,
      "text": " Notice what the Bible says here."
    },
    {
      "id": 100,
      "start": 250.8000030517578,
      "end": 252.82000732421875,
      "text": " Again, the psalmist still speaking,"
    },
    {
      "id": 101,
      "start": 252.82000732421875,
      "end": 257.05999755859375,
      "text": " and he says, thy word is very pure."
    },
    {
      "id": 102,
      "start": 258.0799865722656,
      "end": 263.0799865722656,
      "text": " Therefore, thy servant loveth it."
    },
    {
      "id": 103,
      "start": 264.2799987792969,
      "end": 266.6000061035156,
      "text": " The psalmist recognized something to be true"
    },
    {
      "id": 104,
      "start": 266.6000061035156,
      "end": 267.760009765625,
      "text": " about God's word."
    },
    {
      "id": 105,
      "start": 267.760009765625,
      "end": 269.55999755859375,
      "text": " He says that it's very pure."
    },
    {
      "id": 106,
      "start": 269.55999755859375,
      "end": 273.760009765625,
      "text": " It reminds me of truth that we have previous in our Bibles"
    },
    {
      "id": 107,
      "start": 273.760009765625,
      "end": 275.8399963378906,
      "text": " in Psalm chapter 12, where the Bible says"
    },
    {
      "id": 108,
      "start": 275.8399963378906,
      "end": 280.05999755859375,
      "text": " in verse number six, the words of the Lord are pure words."
    },
    {
      "id": 109,
      "start": 280.05999755859375,
      "end": 284.44000244140625,
      "text": " As silver tried in a furnace of earth purified seven times,"
    },
    {
      "id": 110,
      "start": 284.44000244140625,
      "end": 286.3999938964844,
      "text": " thou shalt keep them, O Lord."
    },
    {
      "id": 111,
      "start": 286.3999938964844,
      "end": 291.3999938964844,
      "text": " Thou shalt preserve them from this generation forever."
    },
    {
      "id": 112,
      "start": 291.9599914550781,
      "end": 294.20001220703125,
      "text": " Only God could make that promise,"
    },
    {
      "id": 113,
      "start": 294.20001220703125,
      "end": 298.0199890136719,
      "text": " and only God could keep that promise because he's eternal."
    },
    {
      "id": 114,
      "start": 298.0199890136719,
      "end": 301.0799865722656,
      "text": " We find that the psalmist says, thy word is very pure."
    },
    {
      "id": 115,
      "start": 301.0799865722656,
      "end": 303.0799865722656,
      "text": " Listen, this book, the Bible,"
    },
    {
      "id": 116,
      "start": 303.0799865722656,
      "end": 305.1600036621094,
      "text": " there's nothing like it in all the world."
    },
    {
      "id": 117,
      "start": 305.1600036621094,
      "end": 307.5199890136719,
      "text": " There's not another book that you'll ever read"
    },
    {
      "id": 118,
      "start": 307.5199890136719,
      "end": 311.1600036621094,
      "text": " that has the power or the purity that this book has."
    },
    {
      "id": 119,
      "start": 311.1600036621094,
      "end": 314.44000244140625,
      "text": " It is the mind of God, it is the very word of God."
    },
    {
      "id": 120,
      "start": 314.44000244140625,
      "end": 316.4800109863281,
      "text": " And we find that he says, therefore,"
    },
    {
      "id": 121,
      "start": 316.4800109863281,
      "end": 320.5199890136719,
      "text": " because of my understanding of it being very pure,"
    },
    {
      "id": 122,
      "start": 320.5199890136719,
      "end": 323.79998779296875,
      "text": " therefore thy servant loveth it."
    },
    {
      "id": 123,
      "start": 323.79998779296875,
      "end": 328.0799865722656,
      "text": " Skip down and notice in verse number 163,"
    },
    {
      "id": 124,
      "start": 328.0799865722656,
      "end": 331.6400146484375,
      "text": " the Bible says, I hate and abhor lying,"
    },
    {
      "id": 125,
      "start": 331.6400146484375,
      "end": 334.3999938964844,
      "text": " but thy law do I love."
    },
    {
      "id": 126,
      "start": 336.3599853515625,
      "end": 339.7200012207031,
      "text": " We think about this phrase, I hate and abhor lying,"
    },
    {
      "id": 127,
      "start": 339.7200012207031,
      "end": 343.6000061035156,
      "text": " no doubt we understand that we do not enjoy"
    },
    {
      "id": 128,
      "start": 343.6000061035156,
      "end": 345.2200012207031,
      "text": " when someone tells us lies,"
    },
    {
      "id": 129,
      "start": 345.2200012207031,
      "end": 347.0,
      "text": " when someone's peddling falsehood,"
    },
    {
      "id": 130,
      "start": 347.0,
      "end": 349.55999755859375,
      "text": " when someone is giving false teaching."
    },
    {
      "id": 131,
      "start": 349.55999755859375,
      "end": 354.05999755859375,
      "text": " And he says, but thy law do I love."
    },
    {
      "id": 132,
      "start": 354.05999755859375,
      "end": 356.0799865722656,
      "text": " And in this same Psalm,"
    },
    {
      "id": 133,
      "start": 356.0799865722656,
      "end": 358.7200012207031,
      "text": " notice a couple of verses down in verse 165,"
    },
    {
      "id": 134,
      "start": 358.7200012207031,
      "end": 363.7200012207031,
      "text": " great peace have they which love thy law,"
    },
    {
      "id": 135,
      "start": 365.0400085449219,
      "end": 368.0,
      "text": " and nothing shall offend them."
    },
    {
      "id": 136,
      "start": 368.0,
      "end": 371.0,
      "text": " We should think about the truth of Psalm 118, 165,"
    },
    {
      "id": 137,
      "start": 371.0,
      "end": 374.8399963378906,
      "text": " great peace have they which love thy law."
    },
    {
      "id": 138,
      "start": 374.8399963378906,
      "end": 375.67999267578125,
      "text": " Why?"
    },
    {
      "id": 139,
      "start": 375.67999267578125,
      "end": 377.79998779296875,
      "text": " Because the person that loves the law of the Lord,"
    },
    {
      "id": 140,
      "start": 377.79998779296875,
      "end": 381.1199951171875,
      "text": " the person that loves the word is gonna be in the word."
    },
    {
      "id": 141,
      "start": 381.1199951171875,
      "end": 382.6400146484375,
      "text": " The person that loves the word"
    },
    {
      "id": 142,
      "start": 382.6400146484375,
      "end": 384.3599853515625,
      "text": " is going to spend time with God,"
    },
    {
      "id": 143,
      "start": 384.3599853515625,
      "end": 386.67999267578125,
      "text": " going to learn more about God,"
    },
    {
      "id": 144,
      "start": 386.67999267578125,
      "end": 388.20001220703125,
      "text": " and it's gonna have a great impact,"
    },
    {
      "id": 145,
      "start": 388.20001220703125,
      "end": 390.6400146484375,
      "text": " great peace have they which love thy law."
    },
    {
      "id": 146,
      "start": 390.6400146484375,
      "end": 394.239990234375,
      "text": " And he's already declared, I love thy law."
    },
    {
      "id": 147,
      "start": 394.239990234375,
      "end": 397.0799865722656,
      "text": " In verse 167, just a few verses down, he says,"
    },
    {
      "id": 148,
      "start": 397.0799865722656,
      "end": 401.3999938964844,
      "text": " my soul hath kept thy testimonies,"
    },
    {
      "id": 149,
      "start": 401.3999938964844,
      "end": 403.4800109863281,
      "text": " and then notice how he words it here,"
    },
    {
      "id": 150,
      "start": 403.4800109863281,
      "end": 407.1199951171875,
      "text": " and I love them exceedingly."
    },
    {
      "id": 151,
      "start": 407.1199951171875,
      "end": 408.7200012207031,
      "text": " I love them exceedingly."
    },
    {
      "id": 152,
      "start": 410.20001220703125,
      "end": 411.79998779296875,
      "text": " It's interesting that we find"
    },
    {
      "id": 153,
      "start": 411.79998779296875,
      "end": 414.0400085449219,
      "text": " these declarations of the psalmist,"
    },
    {
      "id": 154,
      "start": 414.0400085449219,
      "end": 417.1600036621094,
      "text": " really, we see five of them that we've looked at"
    },
    {
      "id": 155,
      "start": 417.1600036621094,
      "end": 419.8800048828125,
      "text": " with regard to four specifically"
    },
    {
      "id": 156,
      "start": 419.8800048828125,
      "end": 421.6400146484375,
      "text": " that speaks about how he loves,"
    },
    {
      "id": 157,
      "start": 421.6400146484375,
      "end": 424.55999755859375,
      "text": " and then the result in verse 165."
    },
    {
      "id": 158,
      "start": 424.55999755859375,
      "end": 426.55999755859375,
      "text": " But I want you to back up, if you will."
    },
    {
      "id": 159,
      "start": 427.0400085449219,
      "end": 430.0,
      "text": " We skipped over one of the verses, and that's in 159."
    },
    {
      "id": 160,
      "start": 430.0,
      "end": 432.55999755859375,
      "text": " I want you to notice here, the Bible says this,"
    },
    {
      "id": 161,
      "start": 432.55999755859375,
      "end": 437.55999755859375,
      "text": " consider how I love thy precepts."
    },
    {
      "id": 162,
      "start": 438.32000732421875,
      "end": 443.0799865722656,
      "text": " Quicken me, O Lord, according to thy loving kindness."
    },
    {
      "id": 163,
      "start": 443.0799865722656,
      "end": 446.5199890136719,
      "text": " It's interesting to me as I read verse 159 in Psalm 119,"
    },
    {
      "id": 164,
      "start": 446.5199890136719,
      "end": 449.6000061035156,
      "text": " the psalmist has made the declaration in verse 97,"
    },
    {
      "id": 165,
      "start": 449.6000061035156,
      "end": 451.7200012207031,
      "text": " the other verses that we've read a moment ago,"
    },
    {
      "id": 166,
      "start": 451.7200012207031,
      "end": 455.44000244140625,
      "text": " he makes the declaration that he loves God's word."
    },
    {
      "id": 167,
      "start": 455.44000244140625,
      "end": 458.3999938964844,
      "text": " But then in Psalm 119 in verse 159,"
    },
    {
      "id": 168,
      "start": 458.3999938964844,
      "end": 459.7200012207031,
      "text": " as he's praying to the Lord, he says,"
    },
    {
      "id": 169,
      "start": 459.7200012207031,
      "end": 464.0400085449219,
      "text": " consider how I love thy precepts."
    },
    {
      "id": 170,
      "start": 464.0400085449219,
      "end": 468.7200012207031,
      "text": " It's one thing for us to declare our love for God's word."
    },
    {
      "id": 171,
      "start": 468.7200012207031,
      "end": 470.8399963378906,
      "text": " It's quite another thing for us to say to God,"
    },
    {
      "id": 172,
      "start": 470.8399963378906,
      "end": 473.67999267578125,
      "text": " consider how I love thy precepts."
    },
    {
      "id": 173,
      "start": 473.67999267578125,
      "end": 476.7200012207031,
      "text": " I mean, the reality is that when we talk"
    },
    {
      "id": 174,
      "start": 476.7200012207031,
      "end": 479.20001220703125,
      "text": " and we understand this evening about the Bible,"
    },
    {
      "id": 175,
      "start": 479.20001220703125,
      "end": 482.760009765625,
      "text": " and we spent two days this week on Friday and Saturday"
    },
    {
      "id": 176,
      "start": 482.760009765625,
      "end": 484.44000244140625,
      "text": " putting scriptures together"
    },
    {
      "id": 177,
      "start": 484.44000244140625,
      "end": 488.0400085449219,
      "text": " and having that opportunity at Scripture Assembly"
    },
    {
      "id": 178,
      "start": 488.0400085449219,
      "end": 492.44000244140625,
      "text": " to put nearly 22,000 John and Romans together, why?"
    },
    {
      "id": 179,
      "start": 493.67999267578125,
      "end": 495.0199890136719,
      "text": " Well, because we love the Bible,"
    },
    {
      "id": 180,
      "start": 495.0199890136719,
      "end": 499.0799865722656,
      "text": " but we want the truth of God's word to be given to those"
    },
    {
      "id": 181,
      "start": 499.0799865722656,
      "end": 501.4800109863281,
      "text": " who do not have it readily available."
    },
    {
      "id": 182,
      "start": 501.4800109863281,
      "end": 504.8399963378906,
      "text": " Why is it that Beacon of Truth is printing Bibles"
    },
    {
      "id": 183,
      "start": 504.8399963378906,
      "end": 506.6000061035156,
      "text": " and engaged in the work?"
    },
    {
      "id": 184,
      "start": 506.6000061035156,
      "end": 508.760009765625,
      "text": " Why is it that we give to a ministry"
    },
    {
      "id": 185,
      "start": 508.760009765625,
      "end": 510.79998779296875,
      "text": " to print portions of scripture"
    },
    {
      "id": 186,
      "start": 510.79998779296875,
      "end": 514.7999877929688,
      "text": " from tracts and John and Romans, Romans booklets,"
    },
    {
      "id": 187,
      "start": 514.7999877929688,
      "end": 516.719970703125,
      "text": " New Testaments, full Bibles?"
    },
    {
      "id": 188,
      "start": 516.719970703125,
      "end": 517.5599975585938,
      "text": " Why?"
    },
    {
      "id": 189,
      "start": 517.5599975585938,
      "end": 519.4000244140625,
      "text": " Because we know the power of God's word,"
    },
    {
      "id": 190,
      "start": 519.4000244140625,
      "end": 522.8400268554688,
      "text": " we love God's word, and we want other people to have it."
    },
    {
      "id": 191,
      "start": 522.8400268554688,
      "end": 526.3200073242188,
      "text": " So we labor, we work, we give of our resources"
    },
    {
      "id": 192,
      "start": 526.3200073242188,
      "end": 528.8800048828125,
      "text": " so that the word can be published,"
    },
    {
      "id": 193,
      "start": 528.8800048828125,
      "end": 530.760009765625,
      "text": " so that the word can be proclaimed"
    },
    {
      "id": 194,
      "start": 530.760009765625,
      "end": 533.4400024414062,
      "text": " and be distributed around the world."
    },
    {
      "id": 195,
      "start": 533.4400024414062,
      "end": 536.3599853515625,
      "text": " But we come this evening to the personal nature"
    },
    {
      "id": 196,
      "start": 536.3599853515625,
      "end": 537.719970703125,
      "text": " of what the psalmist says,"
    },
    {
      "id": 197,
      "start": 537.719970703125,
      "end": 541.760009765625,
      "text": " oh, how love I thy law."
    },
    {
      "id": 198,
      "start": 541.760009765625,
      "end": 544.239990234375,
      "text": " There's many reasons that we should love God's word."
    },
    {
      "id": 199,
      "start": 544.239990234375,
      "end": 546.8400268554688,
      "text": " We looked at one there in Psalm 140,"
    },
    {
      "id": 200,
      "start": 546.8400268554688,
      "end": 548.47998046875,
      "text": " in Psalm 119, verse 140,"
    },
    {
      "id": 201,
      "start": 548.47998046875,
      "end": 550.6400146484375,
      "text": " where he says that thy word is very pure."
    },
    {
      "id": 202,
      "start": 550.6400146484375,
      "end": 553.3400268554688,
      "text": " We understand this book is a perfect book."
    },
    {
      "id": 203,
      "start": 554.2000122070312,
      "end": 556.6799926757812,
      "text": " This book is God's book, it's perfect."
    },
    {
      "id": 204,
      "start": 556.6799926757812,
      "end": 558.6199951171875,
      "text": " The source, all scripture."
    },
    {
      "id": 205,
      "start": 558.6199951171875,
      "end": 559.4600219726562,
      "text": " How much scripture?"
    },
    {
      "id": 206,
      "start": 559.4600219726562,
      "end": 562.3200073242188,
      "text": " All scripture is given by inspiration of God."
    },
    {
      "id": 207,
      "start": 562.3200073242188,
      "end": 566.3400268554688,
      "text": " What a joy to know the book that we hold in our hands,"
    },
    {
      "id": 208,
      "start": 567.219970703125,
      "end": 568.780029296875,
      "text": " that this book is pure,"
    },
    {
      "id": 209,
      "start": 568.780029296875,
      "end": 571.1799926757812,
      "text": " that this book is the very word of God."
    },
    {
      "id": 210,
      "start": 571.1799926757812,
      "end": 572.9199829101562,
      "text": " It's inspired by God."
    },
    {
      "id": 211,
      "start": 572.9199829101562,
      "end": 574.3400268554688,
      "text": " We find that the psalmist said,"
    },
    {
      "id": 212,
      "start": 574.3400268554688,
      "end": 576.7000122070312,
      "text": " as we looked in Psalm 12, but in Psalm 19,"
    },
    {
      "id": 213,
      "start": 576.7000122070312,
      "end": 577.9400024414062,
      "text": " in verse number seven,"
    },
    {
      "id": 214,
      "start": 577.9400024414062,
      "end": 579.9000244140625,
      "text": " the psalmist makes this declaration"
    },
    {
      "id": 215,
      "start": 579.9000244140625,
      "end": 581.9400024414062,
      "text": " with regard to God's word."
    },
    {
      "id": 216,
      "start": 581.9400024414062,
      "end": 586.1799926757812,
      "text": " The law of the Lord is perfect."
    },
    {
      "id": 217,
      "start": 586.1799926757812,
      "end": 587.9000244140625,
      "text": " It's perfect."
    },
    {
      "id": 218,
      "start": 587.9000244140625,
      "end": 591.02001953125,
      "text": " I've read books, I have a number of them on my bookshelf."
    },
    {
      "id": 219,
      "start": 591.02001953125,
      "end": 592.9199829101562,
      "text": " I've read books that have errors."
    },
    {
      "id": 220,
      "start": 593.760009765625,
      "end": 596.719970703125,
      "text": " Never found an error in the Bible."
    },
    {
      "id": 221,
      "start": 598.3599853515625,
      "end": 600.5599975585938,
      "text": " Oh, I've had people come to me and said they."
    },
    {
      "id": 0,
      "start": 600.5599975585938,
      "end": 605.5999975204468,
      "text": " found errors. You know what I find most often, Mark? They just really went to a website somewhere"
    },
    {
      "id": 1,
      "start": 605.5999975204468,
      "end": 610.1199979782104,
      "text": " and they looked up errors in the Bible and they just took some man's word for the fact"
    },
    {
      "id": 2,
      "start": 610.1199979782104,
      "end": 614.6399974822998,
      "text": " that there's a contradiction or an error. I often have said, oh, there's, the book is"
    },
    {
      "id": 3,
      "start": 614.6399974822998,
      "end": 618.1199970245361,
      "text": " full of contradictions. You ever have anyone tell you that? And I hand them my Bible and"
    },
    {
      "id": 4,
      "start": 618.1199970245361,
      "end": 621.2399978637695,
      "text": " say, well, if it's full of them, can you show me one? Well, I don't, I don't know any off"
    },
    {
      "id": 5,
      "start": 621.2399978637695,
      "end": 626.2799968719482,
      "text": " the top of my head. You just kind of laugh and just kind of carry on. But the reality"
    },
    {
      "id": 6,
      "start": 626.2799968719482,
      "end": 634.8399963378906,
      "text": " is that someone said this, if you think there's a mistake, you're mistaken. See, some of the"
    },
    {
      "id": 7,
      "start": 634.8399963378906,
      "end": 643.3599967956543,
      "text": " truth of God's word requires that we dig and we dig and we labor and we labor. I remember"
    },
    {
      "id": 8,
      "start": 643.3599967956543,
      "end": 648.3999977111816,
      "text": " hearing a preacher say this, and I remember exactly the number of years we was at a conference"
    },
    {
      "id": 9,
      "start": 648.3999977111816,
      "end": 652.439998626709,
      "text": " that we're at last July. And there was one portion of scripture that he struggled with"
    },
    {
      "id": 10,
      "start": 652.439998626709,
      "end": 658.5999984741211,
      "text": " understanding and he prayed for years that God would give him an understanding of that"
    },
    {
      "id": 11,
      "start": 658.5999984741211,
      "end": 663.6399993896484,
      "text": " portion of scripture. And he stood before us and he testified at what joy it was when"
    },
    {
      "id": 12,
      "start": 663.6399993896484,
      "end": 668.7200012207031,
      "text": " God finally revealed to him the truth of that portion of scripture that he had prayed over"
    },
    {
      "id": 13,
      "start": 668.7200012207031,
      "end": 676.3999938964844,
      "text": " and labored over. This book is amazing. It's a perfect book. I'm thankful that God preserved"
    },
    {
      "id": 14,
      "start": 676.3999938964844,
      "end": 681.4799957275391,
      "text": " it. Wouldn't it be, we understand this evening the truth of inspiration. All scripture is"
    },
    {
      "id": 15,
      "start": 681.4799957275391,
      "end": 686.7200012207031,
      "text": " given by inspiration of God. And inspiration is important Bible doctrine. It's absolutely"
    },
    {
      "id": 16,
      "start": 686.7200012207031,
      "end": 690.5999984741211,
      "text": " imperative that we understand that all scripture is given by inspiration. There are people"
    },
    {
      "id": 17,
      "start": 690.5999984741211,
      "end": 694.5199966430664,
      "text": " today that would like to make you think and would like to peddle their ideas that it's"
    },
    {
      "id": 18,
      "start": 694.5199966430664,
      "end": 700.3999938964844,
      "text": " just man's words that man wrote. No, it's God's word and we can rest assured of that."
    },
    {
      "id": 19,
      "start": 700.3999938964844,
      "end": 707.1199951171875,
      "text": " But we also understand that God not only inspired His word, but He preserved His word. And that"
    },
    {
      "id": 20,
      "start": 707.1199951171875,
      "end": 713.4399948120117,
      "text": " wonderful truth of preservation is so important for us this evening. Why? We don't have the"
    },
    {
      "id": 21,
      "start": 713.4399948120117,
      "end": 721.1999969482422,
      "text": " originals. In fact, when Paul was writing and he says to Timothy in 2 Timothy chapter"
    },
    {
      "id": 22,
      "start": 721.1999969482422,
      "end": 727.0,
      "text": " number 4, bring these things and especially the parchments. Those were copies of copies"
    },
    {
      "id": 23,
      "start": 727.0,
      "end": 733.4799957275391,
      "text": " of copies of copies. He didn't have the originals either, but God said that He would preserve"
    },
    {
      "id": 24,
      "start": 733.4799957275391,
      "end": 740.9599914550781,
      "text": " His word. And we hold in our hands this evening the very preserved book that God has given"
    },
    {
      "id": 25,
      "start": 740.9599914550781,
      "end": 746.8800048828125,
      "text": " to us. We understand this evening here, even in Psalm 119, in verse number 89, the Bible"
    },
    {
      "id": 26,
      "start": 746.8800048828125,
      "end": 756.3600006103516,
      "text": " says this, forever, O Lord, Thy word is settled in heaven. In verse 160 of Psalm 119, the"
    },
    {
      "id": 27,
      "start": 756.3600006103516,
      "end": 762.0,
      "text": " Bible says this, it says, Thy word is true from the beginning and every one of Thy righteous"
    },
    {
      "id": 28,
      "start": 762.0,
      "end": 771.8800048828125,
      "text": " judgments endureth forever. How many of them? It says every one. Only God can do that. Only"
    },
    {
      "id": 29,
      "start": 771.8800048828125,
      "end": 779.4400024414062,
      "text": " God can do that. That reminds us this evening of how blessed we are to have the preserved"
    },
    {
      "id": 30,
      "start": 779.4400024414062,
      "end": 785.7599945068359,
      "text": " book, the preserved word of God. I find that this book is profitable often as we deal with"
    },
    {
      "id": 31,
      "start": 785.7599945068359,
      "end": 790.0800018310547,
      "text": " the truth of 2 Timothy chapter 3 and verse number 16 and we talk about the fact that"
    },
    {
      "id": 32,
      "start": 790.0800018310547,
      "end": 795.1199951171875,
      "text": " all scripture is given by inspiration of God, but it says that it's profitable. It's"
    },
    {
      "id": 33,
      "start": 795.1199951171875,
      "end": 799.4799957275391,
      "text": " profitable. Why do we read the Bible? We'll get to that in just a few moments, but we"
    },
    {
      "id": 34,
      "start": 799.4799957275391,
      "end": 805.8399963378906,
      "text": " understand that we read it because it's a profit to us. It benefits us. Why is it that"
    },
    {
      "id": 35,
      "start": 805.8399963378906,
      "end": 811.5599975585938,
      "text": " we hear the preaching of God's word? Why is it that the preacher has been given the responsibility"
    },
    {
      "id": 36,
      "start": 811.5599975585938,
      "end": 817.1999969482422,
      "text": " to preach the word? Because it's the word that changes lives. It's the word that's profitable."
    },
    {
      "id": 37,
      "start": 817.1999969482422,
      "end": 824.1999969482422,
      "text": " It's God's word. We find this evening that this book is profitable. I'm reminded of Joshua"
    },
    {
      "id": 38,
      "start": 824.1999969482422,
      "end": 828.5200042724609,
      "text": " one and verse number eight. In fact, many of you, uh, we could, we could quote the verse,"
    },
    {
      "id": 39,
      "start": 828.5200042724609,
      "end": 832.0800018310547,
      "text": " but I want you to go back there and I want you to look at what's happening in Joshua"
    },
    {
      "id": 40,
      "start": 832.0800018310547,
      "end": 837.239990234375,
      "text": " chapter number one. And I want you to consider, uh, just some truth about this and Joshua"
    },
    {
      "id": 41,
      "start": 837.239990234375,
      "end": 842.9199981689453,
      "text": " one and all the circumstances that are taking place with regard to Moses. In fact, in verse"
    },
    {
      "id": 42,
      "start": 842.9199981689453,
      "end": 848.2799987792969,
      "text": " number one, the Bible says now after the death of Moses, now this is a simple question"
    },
    {
      "id": 43,
      "start": 848.2799987792969,
      "end": 853.9599914550781,
      "text": " this evening, but who is the human penman for the first five books of the Bible? Moses,"
    },
    {
      "id": 44,
      "start": 853.9599914550781,
      "end": 860.0400085449219,
      "text": " right? The Pentateuch, we often refer to the law, the Pentateuch, the books of Moses and"
    },
    {
      "id": 45,
      "start": 860.0400085449219,
      "end": 868.1799926757812,
      "text": " those first five books, God used Moses to pen those. And, uh, he's the human penman,"
    },
    {
      "id": 46,
      "start": 868.1799926757812,
      "end": 872.6799926757812,
      "text": " but we find that the Bible says now after the death of Moses, the servant of the Lord,"
    },
    {
      "id": 47,
      "start": 872.6799926757812,
      "end": 877.5199890136719,
      "text": " it came to pass that the Lord spake unto Joshua, the son of none, Moses, his minister"
    },
    {
      "id": 48,
      "start": 877.5199890136719,
      "end": 884.6399841308594,
      "text": " saying, Moses, my servant is dead. Now therefore arise, go over this Jordan, thou and all this"
    },
    {
      "id": 49,
      "start": 884.6399841308594,
      "end": 889.6000061035156,
      "text": " people unto the land, which I do give to them, even to the children of Israel. We're not"
    },
    {
      "id": 50,
      "start": 889.6000061035156,
      "end": 893.6799926757812,
      "text": " going to go through the entirety here, but we find that there's a promise given in verse"
    },
    {
      "id": 51,
      "start": 893.6799926757812,
      "end": 898.2000122070312,
      "text": " number five, there shall not any man be able to stand before thee all the days of thy life."
    },
    {
      "id": 52,
      "start": 898.2000122070312,
      "end": 903.8599853515625,
      "text": " As I was with Moses, so I will be with thee. I will not fail thee nor forsake thee. Moses"
    },
    {
      "id": 53,
      "start": 903.8599853515625,
      "end": 911.5599975585938,
      "text": " left a couple of very important things. Number one, he left a great example for Joshua. Moses"
    },
    {
      "id": 54,
      "start": 911.5599975585938,
      "end": 917.760009765625,
      "text": " was a faithful minister. Moses was a man that, uh, was, was faithful in all his house. He"
    },
    {
      "id": 55,
      "start": 917.760009765625,
      "end": 922.6399841308594,
      "text": " did so many wonderful things. God used him greatly. And we find that he had influence"
    },
    {
      "id": 56,
      "start": 922.7200012207031,
      "end": 931.7200012207031,
      "text": " in the life of Joshua. But I want you to understand that Moses also left a book. He left a book."
    },
    {
      "id": 57,
      "start": 931.7200012207031,
      "end": 938.1600036621094,
      "text": " And we find that the Bible says as God gives to Joshua this promise of victory and he says,"
    },
    {
      "id": 58,
      "start": 938.1600036621094,
      "end": 942.760009765625,
      "text": " be strong in verse number six and have a good courage for unto this people shalt thou divide"
    },
    {
      "id": 59,
      "start": 942.760009765625,
      "end": 947.6799926757812,
      "text": " for an inheritance the land, which I swear unto their fathers to give them. Only be thou"
    },
    {
      "id": 60,
      "start": 947.7999877929688,
      "end": 954.3999938964844,
      "text": " strong and very courageous that thou mayest observe to do according to all the law, which"
    },
    {
      "id": 61,
      "start": 954.3999938964844,
      "end": 959.7200012207031,
      "text": " Moses, my servant, commanded thee, turn not from it to the right hand or to the left that"
    },
    {
      "id": 62,
      "start": 959.7200012207031,
      "end": 964.6399841308594,
      "text": " thou mayest prosper whithersoever thou goest. And then here's the verse in verse number"
    },
    {
      "id": 63,
      "start": 964.6399841308594,
      "end": 974.4800109863281,
      "text": " eight, this book of the law, this book of the law, Moses was faithful to, to, to write"
    },
    {
      "id": 64,
      "start": 974.4800109863281,
      "end": 979.7999877929688,
      "text": " down what God had commanded him to write down. Yes, he was faithful. You find throughout"
    },
    {
      "id": 65,
      "start": 979.7999877929688,
      "end": 984.5599975585938,
      "text": " the pages of the Pentateuch that God would say to Moses, say this to my people, and then"
    },
    {
      "id": 66,
      "start": 984.5599975585938,
      "end": 991.1199951171875,
      "text": " you'll see where Moses goes and says this to his people. Moses was faithful. He says,"
    },
    {
      "id": 67,
      "start": 991.1199951171875,
      "end": 998.6399841308594,
      "text": " this book of the law shall not depart out of thy mouth, but thou shalt meditate therein."
    },
    {
      "id": 68,
      "start": 998.6399841308594,
      "end": 1007.7999877929688,
      "text": " Notice what it says, day and night. For what purpose? That thou mayest observe, what does"
    },
    {
      "id": 69,
      "start": 1007.7999877929688,
      "end": 1019.9199829101562,
      "text": " it say? To do. To do according to all that is written therein. For then thou shalt make"
    },
    {
      "id": 70,
      "start": 1019.9199829101562,
      "end": 1027.3200073242188,
      "text": " thy way prosperous and then thou shalt have good success. This evening I have this verse"
    },
    {
      "id": 71,
      "start": 1027.3599853515625,
      "end": 1032.3200073242188,
      "text": " of scripture. I have just four little phrases, really three of them are just words, single"
    },
    {
      "id": 72,
      "start": 1032.3200073242188,
      "end": 1040.239990234375,
      "text": " words that are underlined in my Bible. The first phrase is to do. The second one is all."
    },
    {
      "id": 73,
      "start": 1040.239990234375,
      "end": 1044.760009765625,
      "text": " And then the next two that I have underlined, both of them the same word then. We understand"
    },
    {
      "id": 74,
      "start": 1044.760009765625,
      "end": 1051.7999877929688,
      "text": " when then occurs. Then is a sequence of events, if you will. It's a time, it's an order. And"
    },
    {
      "id": 75,
      "start": 1051.7999877929688,
      "end": 1057.2000122070312,
      "text": " we find here this evening that the then of verse number eight in Joshua chapter number"
    },
    {
      "id": 76,
      "start": 1057.2000122070312,
      "end": 1062.1199951171875,
      "text": " one, we desire. What is the then? It's to make thy way prosperous. It's to have good"
    },
    {
      "id": 77,
      "start": 1062.1199951171875,
      "end": 1067.4400024414062,
      "text": " success. Praise the Lord. I mean, that's what we want. That's our desire. That's our goal."
    },
    {
      "id": 78,
      "start": 1067.4400024414062,
      "end": 1072.3599853515625,
      "text": " But the reality is we never get there if we're not meditating there in day and night. If we're"
    },
    {
      "id": 79,
      "start": 1072.3599853515625,
      "end": 1078.3399963378906,
      "text": " not doing that, getting into God's word so that we could do according to all that is"
    },
    {
      "id": 80,
      "start": 1078.3399963378906,
      "end": 1084.3800048828125,
      "text": " written therein. We're not going to do what we do not know. You say, well, that's pretty"
    },
    {
      "id": 81,
      "start": 1084.3800048828125,
      "end": 1089.2999877929688,
      "text": " basic I know. The message tonight is actually very basic. But sometimes you've got to get"
    },
    {
      "id": 82,
      "start": 1089.2999877929688,
      "end": 1095.5,
      "text": " back to the basics. You've got to get back to the basics. You're not going to do what"
    },
    {
      "id": 83,
      "start": 1095.5,
      "end": 1100.1399841308594,
      "text": " you don't know. It's just not going to happen. So we've got to get into the book, get into"
    },
    {
      "id": 84,
      "start": 1100.1399841308594,
      "end": 1106.3800048828125,
      "text": " the Bible, allow the Bible to get into us and understand that we need to do all that"
    },
    {
      "id": 85,
      "start": 1106.3800048828125,
      "end": 1114.6599731445312,
      "text": " is written therein. I pray, I think almost every single time that I pray when I enter"
    },
    {
      "id": 86,
      "start": 1114.6599731445312,
      "end": 1120.9000244140625,
      "text": " into my time of devotions personally and when I enter into this pulpit, I pray God help"
    },
    {
      "id": 87,
      "start": 1120.9000244140625,
      "end": 1127.4600219726562,
      "text": " us to be doers of the word and not hearers only. Why? Well, because James one tells us"
    },
    {
      "id": 88,
      "start": 1127.4600219726562,
      "end": 1135.4600219726562,
      "text": " that it's, we're deceiving ourselves if we're hearers and we're not doers. We're to be doing"
    },
    {
      "id": 89,
      "start": 1135.4600219726562,
      "end": 1141.260009765625,
      "text": " the word. Yes, we have to hear it, but we must make a commitment to doing it. I want"
    },
    {
      "id": 90,
      "start": 1141.260009765625,
      "end": 1146.8200073242188,
      "text": " you to understand this evening the book that we hold in our hands is powerful. It's powerful."
    },
    {
      "id": 91,
      "start": 1146.8200073242188,
      "end": 1151.739990234375,
      "text": " Notice with me a truth in Jeremiah chapter 23. In Jeremiah chapter 23 this evening we"
    },
    {
      "id": 92,
      "start": 1151.739990234375,
      "end": 1159.4199829101562,
      "text": " see these words written with regard to the power of God's word. This book that we hold,"
    },
    {
      "id": 93,
      "start": 1159.4199829101562,
      "end": 1167.260009765625,
      "text": " dear, that we hold in our hands this evening, in Jeremiah chapter 23 and verse number 28,"
    },
    {
      "id": 94,
      "start": 1167.260009765625,
      "end": 1173.2999877929688,
      "text": " notice what the Bible says. The prophet that hath a dream, let him tell a dream. And he"
    },
    {
      "id": 95,
      "start": 1173.2999877929688,
      "end": 1182.7000122070312,
      "text": " that hath my word, let him speak my word faithfully. What is the chaff to the wheat, saith the"
    },
    {
      "id": 96,
      "start": 1182.7000122070312,
      "end": 1193.6199951171875,
      "text": " Lord? Chaff is useless rubbish. That's what it is. But wheat, it's profitable. Wheat,"
    },
    {
      "id": 97,
      "start": 1193.6199951171875,
      "end": 1199.3800048828125,
      "text": " it's nourishing. You want to separate the chaff from the wheat, do you not?"
    },
    {
      "id": 0,
      "start": 1199.3800048828125,
      "end": 1205.320004940033,
      "text": " They would do that, it was a, we understand the purpose, the process, and we find here"
    },
    {
      "id": 1,
      "start": 1205.320004940033,
      "end": 1208.9600048065186,
      "text": " that God says, what is the chaff to the wheat?"
    },
    {
      "id": 2,
      "start": 1208.9600048065186,
      "end": 1217.9600048065186,
      "text": " And then he says this in verse 29, is not my word like as a fire, saith the Lord, and"
    },
    {
      "id": 3,
      "start": 1217.9600048065186,
      "end": 1222.6400051116943,
      "text": " like a hammer that breaketh the rock in pieces?"
    },
    {
      "id": 4,
      "start": 1222.6400051116943,
      "end": 1228.100004196167,
      "text": " Therefore, behold, I am against the prophets, saith the Lord, that steal my words every"
    },
    {
      "id": 5,
      "start": 1228.100004196167,
      "end": 1230.8600044250488,
      "text": " one from his neighbor."
    },
    {
      "id": 6,
      "start": 1230.8600044250488,
      "end": 1233.740005493164,
      "text": " God's word is powerful."
    },
    {
      "id": 7,
      "start": 1233.740005493164,
      "end": 1238.9000053405762,
      "text": " So often as we think about the declaration of the psalmist this evening, again, there's"
    },
    {
      "id": 8,
      "start": 1238.9000053405762,
      "end": 1244.9200057983398,
      "text": " many reasons in which we would agree with the psalmist, oh, how love I thy law."
    },
    {
      "id": 9,
      "start": 1244.9200057983398,
      "end": 1246.580005645752,
      "text": " We love God's word."
    },
    {
      "id": 10,
      "start": 1246.580005645752,
      "end": 1248.740005493164,
      "text": " We love the Bible."
    },
    {
      "id": 11,
      "start": 1248.740005493164,
      "end": 1253.9000053405762,
      "text": " But I ask this question of myself, and I ask you this evening as we look at this thought"
    },
    {
      "id": 12,
      "start": 1253.9000053405762,
      "end": 1259.9400062561035,
      "text": " tonight and consider this truth from Psalm 119, is the, does the evidence, or is there"
    },
    {
      "id": 13,
      "start": 1259.9400062561035,
      "end": 1264.140007019043,
      "text": " evidence that supports the claim?"
    },
    {
      "id": 14,
      "start": 1264.140007019043,
      "end": 1270.900001525879,
      "text": " We can claim just about anything we want to claim, but what does the evidence say?"
    },
    {
      "id": 15,
      "start": 1270.900001525879,
      "end": 1273.900001525879,
      "text": " What does the evidence support?"
    },
    {
      "id": 16,
      "start": 1273.900001525879,
      "end": 1279.9200057983398,
      "text": " If we say we love something, then there should be evidence to support the claim."
    },
    {
      "id": 17,
      "start": 1279.9600067138672,
      "end": 1285.8400039672852,
      "text": " And here this evening, we begin to think about this declaration, oh, how love I thy law."
    },
    {
      "id": 18,
      "start": 1285.8400039672852,
      "end": 1290.2000045776367,
      "text": " There ought to be something in the life of the psalmist, there ought to be something"
    },
    {
      "id": 19,
      "start": 1290.2000045776367,
      "end": 1295.8400039672852,
      "text": " in your life and my life that would support the claim if we're going to say I love God's"
    },
    {
      "id": 20,
      "start": 1295.8400039672852,
      "end": 1299.240005493164,
      "text": " word."
    },
    {
      "id": 21,
      "start": 1299.240005493164,
      "end": 1304.6800079345703,
      "text": " I would say very basically this evening in a very simple idea is that we, number one,"
    },
    {
      "id": 22,
      "start": 1304.6800079345703,
      "end": 1307.7600021362305,
      "text": " would read the Bible."
    },
    {
      "id": 23,
      "start": 1307.7600021362305,
      "end": 1310.2800064086914,
      "text": " Just read the Bible."
    },
    {
      "id": 24,
      "start": 1310.2800064086914,
      "end": 1311.8800048828125,
      "text": " I don't like reading."
    },
    {
      "id": 25,
      "start": 1311.8800048828125,
      "end": 1314.6800079345703,
      "text": " Learn to."
    },
    {
      "id": 26,
      "start": 1314.6800079345703,
      "end": 1317.360008239746,
      "text": " This book is not like any other book."
    },
    {
      "id": 27,
      "start": 1317.360008239746,
      "end": 1319.0800018310547,
      "text": " I don't have time to read."
    },
    {
      "id": 28,
      "start": 1319.0800018310547,
      "end": 1321.3200073242188,
      "text": " You better make time."
    },
    {
      "id": 29,
      "start": 1321.3200073242188,
      "end": 1322.3200073242188,
      "text": " Let me rephrase that."
    },
    {
      "id": 30,
      "start": 1322.3200073242188,
      "end": 1323.3200073242188,
      "text": " You better steward time."
    },
    {
      "id": 31,
      "start": 1323.3200073242188,
      "end": 1328.6600036621094,
      "text": " I often say to Joseph and to our other children and to many of you, you cannot make time."
    },
    {
      "id": 32,
      "start": 1328.6600036621094,
      "end": 1329.8800048828125,
      "text": " We cannot make time."
    },
    {
      "id": 33,
      "start": 1329.8800048828125,
      "end": 1331.9600067138672,
      "text": " We are stewards of time."
    },
    {
      "id": 34,
      "start": 1331.9600067138672,
      "end": 1333.3800048828125,
      "text": " We can't make time."
    },
    {
      "id": 35,
      "start": 1333.3800048828125,
      "end": 1336.3600006103516,
      "text": " We steward time."
    },
    {
      "id": 36,
      "start": 1336.4800109863281,
      "end": 1339.3200073242188,
      "text": " You better steward time to read God's word."
    },
    {
      "id": 37,
      "start": 1339.3200073242188,
      "end": 1340.3200073242188,
      "text": " It's not going to happen on accident."
    },
    {
      "id": 38,
      "start": 1340.3200073242188,
      "end": 1342.1600036621094,
      "text": " It's not going to happen by chance."
    },
    {
      "id": 39,
      "start": 1342.1600036621094,
      "end": 1346.3600006103516,
      "text": " You're going to have to purpose to read God's word."
    },
    {
      "id": 40,
      "start": 1346.3600006103516,
      "end": 1350.3200073242188,
      "text": " We give out the Bible reading schedules."
    },
    {
      "id": 41,
      "start": 1350.3200073242188,
      "end": 1353.9199981689453,
      "text": " I don't have any up here in the daily devotional that we gave you."
    },
    {
      "id": 42,
      "start": 1353.9199981689453,
      "end": 1355.7200012207031,
      "text": " There's a Bible reading schedule in there."
    },
    {
      "id": 43,
      "start": 1355.7200012207031,
      "end": 1357.3000030517578,
      "text": " There's all sorts of things that you can use."
    },
    {
      "id": 44,
      "start": 1357.3000030517578,
      "end": 1361.9199981689453,
      "text": " You can use apps and so on and so forth that give you a daily reading schedule."
    },
    {
      "id": 45,
      "start": 1362.0,
      "end": 1366.4400024414062,
      "text": " Can I tell you this evening that we're not reading the Bible simply to fill out a book"
    },
    {
      "id": 46,
      "start": 1366.4400024414062,
      "end": 1368.7000122070312,
      "text": " that we hand you in the beginning of the year?"
    },
    {
      "id": 47,
      "start": 1368.7000122070312,
      "end": 1374.4000091552734,
      "text": " That we give you this book that gives you so many chapters each day and so on and so"
    },
    {
      "id": 48,
      "start": 1374.4000091552734,
      "end": 1375.4000091552734,
      "text": " forth?"
    },
    {
      "id": 49,
      "start": 1375.4000091552734,
      "end": 1376.4000091552734,
      "text": " No."
    },
    {
      "id": 50,
      "start": 1376.4000091552734,
      "end": 1380.8800048828125,
      "text": " We're giving you the book as a tool."
    },
    {
      "id": 51,
      "start": 1380.8800048828125,
      "end": 1386.5599975585938,
      "text": " But we don't read the Bible so that we can check off that little box that's there in"
    },
    {
      "id": 52,
      "start": 1386.5599975585938,
      "end": 1387.5599975585938,
      "text": " that little booklet."
    },
    {
      "id": 53,
      "start": 1387.5599975585938,
      "end": 1388.5599975585938,
      "text": " No."
    },
    {
      "id": 54,
      "start": 1388.5599975585938,
      "end": 1392.2000122070312,
      "text": " We're not reading the Bible because we understand what the Bible is."
    },
    {
      "id": 55,
      "start": 1392.2000122070312,
      "end": 1395.6000061035156,
      "text": " And if we love the Bible, we better be reading the Bible."
    },
    {
      "id": 56,
      "start": 1395.6000061035156,
      "end": 1399.3600006103516,
      "text": " And if we're not reading the Bible, then we can't claim to love the Bible because the"
    },
    {
      "id": 57,
      "start": 1399.3600006103516,
      "end": 1403.5599975585938,
      "text": " evidence doesn't support the claim."
    },
    {
      "id": 58,
      "start": 1403.5599975585938,
      "end": 1408.6800079345703,
      "text": " It's sad to me this evening that you can look at, and I understand statistics, and I shared"
    },
    {
      "id": 59,
      "start": 1408.6800079345703,
      "end": 1414.2799987792969,
      "text": " some statistics in the message this morning, and I understand the statistics can be skewed"
    },
    {
      "id": 60,
      "start": 1414.2799987792969,
      "end": 1416.3200073242188,
      "text": " one way or the other and so on and so forth."
    },
    {
      "id": 61,
      "start": 1416.3200073242188,
      "end": 1418.0400085449219,
      "text": " I get all of that."
    },
    {
      "id": 62,
      "start": 1418.0400085449219,
      "end": 1422.8000030517578,
      "text": " But the statistics do reveal something, and there's a number of statistics that have been"
    },
    {
      "id": 63,
      "start": 1422.8000030517578,
      "end": 1428.4400024414062,
      "text": " given over the last couple of decades with regard to the number of people that are professing"
    },
    {
      "id": 64,
      "start": 1428.4400024414062,
      "end": 1432.760009765625,
      "text": " Christians that have never read Genesis to Revelation."
    },
    {
      "id": 65,
      "start": 1432.760009765625,
      "end": 1436.6399993896484,
      "text": " They've never read the entire Bible in their entire Christian life."
    },
    {
      "id": 66,
      "start": 1436.6399993896484,
      "end": 1440.520004272461,
      "text": " People that admit, acknowledge that they don't read the Bible daily."
    },
    {
      "id": 67,
      "start": 1440.520004272461,
      "end": 1446.9199981689453,
      "text": " They go to church, they believe the Bible is God's word, but they don't read the Bible."
    },
    {
      "id": 68,
      "start": 1446.9199981689453,
      "end": 1453.6399993896484,
      "text": " This evening, Paul tells Timothy, and I understand that it's within the context of Paul coming"
    },
    {
      "id": 69,
      "start": 1453.6399993896484,
      "end": 1460.6400146484375,
      "text": " to where Timothy is, but he says, till I come, give attendance to reading, to exhortation,"
    },
    {
      "id": 70,
      "start": 1460.6400146484375,
      "end": 1463.760009765625,
      "text": " to doctrine."
    },
    {
      "id": 71,
      "start": 1463.760009765625,
      "end": 1466.1199951171875,
      "text": " We teach our children to read the Bible."
    },
    {
      "id": 72,
      "start": 1466.1199951171875,
      "end": 1467.1199951171875,
      "text": " Why?"
    },
    {
      "id": 73,
      "start": 1467.1199951171875,
      "end": 1468.4800109863281,
      "text": " Because we know what the Bible is."
    },
    {
      "id": 74,
      "start": 1468.4800109863281,
      "end": 1470.6000061035156,
      "text": " We know what the Bible is capable of doing."
    },
    {
      "id": 75,
      "start": 1470.6000061035156,
      "end": 1474.6400146484375,
      "text": " We know that it's God's word, that it's perfect, it's preserved, it's profitable."
    },
    {
      "id": 76,
      "start": 1474.6400146484375,
      "end": 1480.239990234375,
      "text": " We understand the power of God's word, so we teach them to read it."
    },
    {
      "id": 77,
      "start": 1480.239990234375,
      "end": 1486.9599914550781,
      "text": " I've not kept track over the years how many times I've read through the Bible from cover"
    },
    {
      "id": 78,
      "start": 1486.9599914550781,
      "end": 1489.0800170898438,
      "text": " to cover."
    },
    {
      "id": 79,
      "start": 1489.0800170898438,
      "end": 1492.8000183105469,
      "text": " But I never get to the point where I finish reading the Bible and I say, well, I guess"
    },
    {
      "id": 80,
      "start": 1492.8000183105469,
      "end": 1494.7200012207031,
      "text": " I don't have to read it again."
    },
    {
      "id": 81,
      "start": 1494.7200012207031,
      "end": 1495.7200012207031,
      "text": " No."
    },
    {
      "id": 82,
      "start": 1495.7200012207031,
      "end": 1499.2799987792969,
      "text": " I just start right back the next day in Genesis 1."
    },
    {
      "id": 83,
      "start": 1499.2799987792969,
      "end": 1502.5599975585938,
      "text": " I've shared with you from the pulpit before, I'm the kind of, I like reading Genesis to"
    },
    {
      "id": 84,
      "start": 1502.5599975585938,
      "end": 1506.2000122070312,
      "text": " Revelation, Genesis, that's just how I like reading it."
    },
    {
      "id": 85,
      "start": 1506.2000122070312,
      "end": 1511.3200073242188,
      "text": " I understand the chronological aspect of it, I understand all of that, I'm not interested"
    },
    {
      "id": 86,
      "start": 1511.3200073242188,
      "end": 1517.0400085449219,
      "text": " really too much in the chronological reading of it, that's just my own preference."
    },
    {
      "id": 87,
      "start": 1517.0400085449219,
      "end": 1521.239990234375,
      "text": " I've done it that way before and I think it's good to be able to understand the chronological"
    },
    {
      "id": 88,
      "start": 1521.239990234375,
      "end": 1522.9200134277344,
      "text": " order of things."
    },
    {
      "id": 89,
      "start": 1522.9200134277344,
      "end": 1526.8000183105469,
      "text": " I'm not one for reading some old and some, I just like doing it that way."
    },
    {
      "id": 90,
      "start": 1526.8000183105469,
      "end": 1529.3200073242188,
      "text": " We all have our preference."
    },
    {
      "id": 91,
      "start": 1529.3200073242188,
      "end": 1532.5599975585938,
      "text": " Somebody said this, I don't like the way, they were speaking to D. L. Moody, I don't"
    },
    {
      "id": 92,
      "start": 1532.5599975585938,
      "end": 1535.6799926757812,
      "text": " like the way that you share the Gospel."
    },
    {
      "id": 93,
      "start": 1535.6799926757812,
      "end": 1539.4800109863281,
      "text": " And he said, okay, well, why don't you tell me how you do it?"
    },
    {
      "id": 94,
      "start": 1539.4800109863281,
      "end": 1540.4800109863281,
      "text": " He said, well, I don't."
    },
    {
      "id": 95,
      "start": 1540.4800109863281,
      "end": 1546.0400085449219,
      "text": " And he said, well, I like my way better than your way."
    },
    {
      "id": 96,
      "start": 1546.0400085449219,
      "end": 1550.2799987792969,
      "text": " You may have a preference on how you read, whether you read some old and some new, whether"
    },
    {
      "id": 97,
      "start": 1550.2799987792969,
      "end": 1556.7799987792969,
      "text": " you read, but you better be reading it, better be reading it."
    },
    {
      "id": 98,
      "start": 1556.7799987792969,
      "end": 1561.6600036621094,
      "text": " The entrance of thy word, give it light."
    },
    {
      "id": 99,
      "start": 1561.6600036621094,
      "end": 1567.3399963378906,
      "text": " As newborn babes desire the cereal milk of the word that you may grow thereby."
    },
    {
      "id": 100,
      "start": 1567.3399963378906,
      "end": 1571.5800170898438,
      "text": " Strong me, in Hebrews chapter number 5, belonging to them who are full age."
    },
    {
      "id": 101,
      "start": 1571.5800170898438,
      "end": 1575.6600036621094,
      "text": " In the time, he says in the same passage, that you ought to be teachers, you have need"
    },
    {
      "id": 102,
      "start": 1575.6600036621094,
      "end": 1581.4200134277344,
      "text": " that one teach you, and we find that we must be reading the Bible."
    },
    {
      "id": 103,
      "start": 1581.4200134277344,
      "end": 1583.8200073242188,
      "text": " Bible reading is so important."
    },
    {
      "id": 104,
      "start": 1583.8200073242188,
      "end": 1585.2200012207031,
      "text": " We sing the song with the little kids."
    },
    {
      "id": 105,
      "start": 1585.2200012207031,
      "end": 1588.6600036621094,
      "text": " In fact, if I called the kids up here this evening to sing it, they'd sing it for you."
    },
    {
      "id": 106,
      "start": 1588.6600036621094,
      "end": 1592.1000061035156,
      "text": " Read your Bible, pray every day, and you'll do what?"
    },
    {
      "id": 107,
      "start": 1592.1000061035156,
      "end": 1599.5,
      "text": " Grow, grow, grow, right?"
    },
    {
      "id": 108,
      "start": 1599.5,
      "end": 1600.7000122070312,
      "text": " It's absolutely imperative."
    },
    {
      "id": 109,
      "start": 1600.7000122070312,
      "end": 1606.3399963378906,
      "text": " It is a, it's a daily discipline when we read God's word."
    },
    {
      "id": 110,
      "start": 1606.3399963378906,
      "end": 1610.9800109863281,
      "text": " Not only do we read it, if we love God's word, we ought to be reading God's word."
    },
    {
      "id": 111,
      "start": 1610.9800109863281,
      "end": 1612.7000122070312,
      "text": " The evidence to support the claim."
    },
    {
      "id": 112,
      "start": 1612.7000122070312,
      "end": 1617.2200012207031,
      "text": " If we love God's word, we ought to be studying God's word."
    },
    {
      "id": 113,
      "start": 1617.2200012207031,
      "end": 1620.1400146484375,
      "text": " I believe there's a difference between reading and studying."
    },
    {
      "id": 114,
      "start": 1620.1400146484375,
      "end": 1625.5,
      "text": " I believe that as you look at the scriptures, that you'll find that we're to read the Bible,"
    },
    {
      "id": 115,
      "start": 1625.5,
      "end": 1629.3399963378906,
      "text": " but every time that I read the Bible, every time that you read the Bible, you may not"
    },
    {
      "id": 116,
      "start": 1629.3399963378906,
      "end": 1633.4599914550781,
      "text": " have opportunity to study the Bible at that very time."
    },
    {
      "id": 117,
      "start": 1633.4599914550781,
      "end": 1634.8200073242188,
      "text": " But how are we studying the Bible?"
    },
    {
      "id": 118,
      "start": 1634.8200073242188,
      "end": 1639.4200134277344,
      "text": " Is there some time in our week, in our schedule that we've set aside for some Bible study"
    },
    {
      "id": 119,
      "start": 1639.4200134277344,
      "end": 1643.1000061035156,
      "text": " where we're going to dig deeper than just reading?"
    },
    {
      "id": 120,
      "start": 1643.1000061035156,
      "end": 1647.739990234375,
      "text": " And one of the aids that I think is so important is that while you're reading, that you keep"
    },
    {
      "id": 121,
      "start": 1647.739990234375,
      "end": 1652.4200134277344,
      "text": " a notebook or you keep something where you can jot down, hey, I want to go back and look"
    },
    {
      "id": 122,
      "start": 1652.4200134277344,
      "end": 1653.4200134277344,
      "text": " at this."
    },
    {
      "id": 123,
      "start": 1653.4200134277344,
      "end": 1655.739990234375,
      "text": " I want to go back and find out more about this."
    },
    {
      "id": 124,
      "start": 1655.739990234375,
      "end": 1657.5,
      "text": " What happened in this city?"
    },
    {
      "id": 125,
      "start": 1657.5,
      "end": 1658.8200073242188,
      "text": " Who are these people?"
    },
    {
      "id": 126,
      "start": 1658.8200073242188,
      "end": 1659.8200073242188,
      "text": " What's going on?"
    },
    {
      "id": 127,
      "start": 1659.8200073242188,
      "end": 1660.8200073242188,
      "text": " So on and so forth."
    },
    {
      "id": 128,
      "start": 1660.8200073242188,
      "end": 1666.1199951171875,
      "text": " And we're going to dig deeper, maybe a connection, no scriptures of any private interpretation."
    },
    {
      "id": 129,
      "start": 1666.1199951171875,
      "end": 1669.6000061035156,
      "text": " We interpret scripture with scripture and it requires study."
    },
    {
      "id": 130,
      "start": 1669.6000061035156,
      "end": 1672.1600036621094,
      "text": " Can I tell you that study is work?"
    },
    {
      "id": 131,
      "start": 1672.1600036621094,
      "end": 1675.0400085449219,
      "text": " Study is work."
    },
    {
      "id": 132,
      "start": 1675.0400085449219,
      "end": 1676.0400085449219,
      "text": " Takes work."
    },
    {
      "id": 133,
      "start": 1676.0400085449219,
      "end": 1677.0400085449219,
      "text": " It takes commitment."
    },
    {
      "id": 134,
      "start": 1677.0400085449219,
      "end": 1678.0400085449219,
      "text": " It takes dedication."
    },
    {
      "id": 135,
      "start": 1678.0400085449219,
      "end": 1679.2799987792969,
      "text": " It takes time."
    },
    {
      "id": 136,
      "start": 1679.2799987792969,
      "end": 1684.2000122070312,
      "text": " But we find that the Bible says in a verse that we're most of us are familiar with, study"
    },
    {
      "id": 137,
      "start": 1684.2000122070312,
      "end": 1689.239990234375,
      "text": " in 2 Timothy 2 and verse 15, to show thyself a proven to God, a workman that needeth not"
    },
    {
      "id": 138,
      "start": 1689.239990234375,
      "end": 1692.52001953125,
      "text": " to be ashamed, rightly dividing the word of truth."
    },
    {
      "id": 139,
      "start": 1692.52001953125,
      "end": 1695.1600036621094,
      "text": " If you're not reading and studying your Bible, you know what's going to happen, you'll believe"
    },
    {
      "id": 140,
      "start": 1695.1600036621094,
      "end": 1703.8000183105469,
      "text": " a lie, false teachers, you listen to something on the internet, some YouTube channel, some"
    },
    {
      "id": 141,
      "start": 1703.8000183105469,
      "end": 1709.2799987792969,
      "text": " internet preacher, and you've not read and studied and you're not grounded in the truth"
    },
    {
      "id": 142,
      "start": 1709.2799987792969,
      "end": 1713.280029296875,
      "text": " of God's word, start believing crazy things."
    },
    {
      "id": 143,
      "start": 1713.280029296875,
      "end": 1714.3599853515625,
      "text": " Seriously."
    },
    {
      "id": 144,
      "start": 1714.3599853515625,
      "end": 1715.3599853515625,
      "text": " Happens all the time."
    },
    {
      "id": 145,
      "start": 1715.3599853515625,
      "end": 1717.1199951171875,
      "text": " People say, what do you think about this?"
    },
    {
      "id": 146,
      "start": 1717.1199951171875,
      "end": 1719.3599853515625,
      "text": " Where did you get that idea?"
    },
    {
      "id": 147,
      "start": 1719.3599853515625,
      "end": 1722.239990234375,
      "text": " Because you didn't get that idea from reading the Bible."
    },
    {
      "id": 148,
      "start": 1722.239990234375,
      "end": 1726.1199951171875,
      "text": " You got that idea from watching something online, watching something, and you try to"
    },
    {
      "id": 149,
      "start": 1726.1199951171875,
      "end": 1727.4400024414062,
      "text": " read it into the Bible."
    },
    {
      "id": 150,
      "start": 1727.4400024414062,
      "end": 1731.8400268554688,
      "text": " But if you're reading the Bible, studying the Bible, oh, it's so important."
    },
    {
      "id": 151,
      "start": 1731.8400268554688,
      "end": 1734.5599975585938,
      "text": " The psalmist says, I love God's word."
    },
    {
      "id": 152,
      "start": 1734.5599975585938,
      "end": 1737.0800170898438,
      "text": " We must read it."
    },
    {
      "id": 153,
      "start": 1737.0800170898438,
      "end": 1738.0800170898438,
      "text": " We must study it."
    },
    {
      "id": 154,
      "start": 1738.0800170898438,
      "end": 1740.4000244140625,
      "text": " Can I say this evening we should memorize it?"
    },
    {
      "id": 155,
      "start": 1740.4000244140625,
      "end": 1745.239990234375,
      "text": " I know that I mentioned this morning, I did on Wednesday as well, the importance of memorizing."
    },
    {
      "id": 156,
      "start": 1745.239990234375,
      "end": 1753.1199951171875,
      "text": " We have verses each month that we have given you to try to encourage you to memorize God's"
    },
    {
      "id": 157,
      "start": 1753.1199951171875,
      "end": 1755.1199951171875,
      "text": " word."
    },
    {
      "id": 158,
      "start": 1755.1199951171875,
      "end": 1761.8400268554688,
      "text": " And oftentimes I think it's a misunderstanding or misconception that we have in our churches"
    },
    {
      "id": 159,
      "start": 1761.8400268554688,
      "end": 1764.9600219726562,
      "text": " that we think Bible memorization is for children."
    },
    {
      "id": 160,
      "start": 1764.9600219726562,
      "end": 1768.9199829101562,
      "text": " We kind of have this idea that you get a memory verse on Sunday school and it's kind of for"
    },
    {
      "id": 161,
      "start": 1768.9199829101562,
      "end": 1770.1600341796875,
      "text": " the children."
    },
    {
      "id": 162,
      "start": 1770.1600341796875,
      "end": 1773.7200317382812,
      "text": " And Joseph gave all the little kids today from Sunday school, gave them a memory verse"
    },
    {
      "id": 163,
      "start": 1773.7200317382812,
      "end": 1775.4400024414062,
      "text": " that they were going to work on this week."
    },
    {
      "id": 164,
      "start": 1775.4400024414062,
      "end": 1779.0800170898438,
      "text": " And Holly gives the kids memory verses on Wednesday night in their class."
    },
    {
      "id": 165,
      "start": 1779.0800170898438,
      "end": 1780.0800170898438,
      "text": " I think it's wonderful."
    },
    {
      "id": 166,
      "start": 1780.0800170898438,
      "end": 1785.4400024414062,
      "text": " The Children's Church, Junior Church, Jennifer and Lena, the kids will come up here and they'll"
    },
    {
      "id": 167,
      "start": 1785.4400024414062,
      "end": 1788.5599975585938,
      "text": " give us some verses that they've memorized."
    },
    {
      "id": 168,
      "start": 1788.5599975585938,
      "end": 1791.280029296875,
      "text": " They'll sing some songs."
    },
    {
      "id": 169,
      "start": 1791.280029296875,
      "end": 1794.760009765625,
      "text": " But we are to memorize God's word."
    },
    {
      "id": 170,
      "start": 1794.760009765625,
      "end": 1798.2000122070312,
      "text": " Hide God's word in our hearts."
    },
    {
      "id": 171,
      "start": 1798.2000122070312,
      "end": 1799.4400024414062,
      "text": " Bible memorization requires…"
    },
    {
      "id": 0,
      "start": 1799.4400024414062,
      "end": 1805.4800024032593,
      "text": " requires labor. As some often will say, well, you just can memorize things better. You just"
    },
    {
      "id": 1,
      "start": 1805.4800024032593,
      "end": 1813.0600023269653,
      "text": " have a better mind. It just requires work. It requires work, commitment, dedication."
    },
    {
      "id": 2,
      "start": 1813.0600023269653,
      "end": 1819.3000030517578,
      "text": " Take one verse a month, a week, however you do it, and just work on memorizing that verse,"
    },
    {
      "id": 3,
      "start": 1819.3000030517578,
      "end": 1823.4200019836426,
      "text": " hiding God's Word. Listen, it's a truth that God gives us throughout His Word, wherewithal"
    },
    {
      "id": 4,
      "start": 1823.4200019836426,
      "end": 1827.3000030517578,
      "text": " shall a young man cleanse his way by taking heed thereto according to thy Word. Thy Word"
    },
    {
      "id": 5,
      "start": 1827.3000030517578,
      "end": 1831.7800025939941,
      "text": " have I hid in mine heart that I might not sin against thee, in Psalm 119 verses 9 and"
    },
    {
      "id": 6,
      "start": 1831.7800025939941,
      "end": 1836.3400039672852,
      "text": " 11. But the Lord Jesus Christ, when He was tempted, He's led of the spirit into the wilderness"
    },
    {
      "id": 7,
      "start": 1836.3400039672852,
      "end": 1845.4200019836426,
      "text": " and the enemy, Satan, comes and tempts. And in each of those accounts He says, it is written."
    },
    {
      "id": 8,
      "start": 1845.4200019836426,
      "end": 1850.7200012207031,
      "text": " What a great pattern for us this evening to understand that we can't say it is written"
    },
    {
      "id": 9,
      "start": 1850.7200012207031,
      "end": 1856.96000289917,
      "text": " if we don't have Scripture memorized in our heart. At that moment of temptation, at that"
    },
    {
      "id": 10,
      "start": 1856.96000289917,
      "end": 1861.96000289917,
      "text": " moment of difficulty of trial, that we have God's Word memorized, that we can immediately"
    },
    {
      "id": 11,
      "start": 1861.96000289917,
      "end": 1866.5600051879883,
      "text": " recite it and rehearse it and be able to use the sword of the Spirit, which is the Word"
    },
    {
      "id": 12,
      "start": 1866.5600051879883,
      "end": 1874.4800033569336,
      "text": " of God, in order to combat our enemy. Oh, we need to know, memorize God's Word. Yes,"
    },
    {
      "id": 13,
      "start": 1874.4800033569336,
      "end": 1880.4400024414062,
      "text": " it's work. Yes, it's labor. But I want to encourage you this evening to memorize God's"
    },
    {
      "id": 14,
      "start": 1880.4400024414062,
      "end": 1885.0800018310547,
      "text": " Word. Someone wrote, I don't remember if it was Harlan Popov or someone else, but they"
    },
    {
      "id": 15,
      "start": 1885.0800018310547,
      "end": 1889.4800033569336,
      "text": " posed the question this way. If someone took your Bible away, and I know that's a hard"
    },
    {
      "id": 16,
      "start": 1889.4800033569336,
      "end": 1893.2000045776367,
      "text": " thing for us to think about, but I want you to know there's many people groups that have"
    },
    {
      "id": 17,
      "start": 1893.2000045776367,
      "end": 1898.9200057983398,
      "text": " had that happen. Many people groups, they come in and they confiscate all the Bibles."
    },
    {
      "id": 18,
      "start": 1898.9200057983398,
      "end": 1904.400001525879,
      "text": " Why do they do that? Because they know the power of this book. They do. Take all the"
    },
    {
      "id": 19,
      "start": 1904.400001525879,
      "end": 1908.8000030517578,
      "text": " Bibles away. The question was this, if someone took your Bible away, how much Bible would"
    },
    {
      "id": 20,
      "start": 1908.8000030517578,
      "end": 1914.6399993896484,
      "text": " you still have? If someone took your Bible away, how much Bible would you still have?"
    },
    {
      "id": 21,
      "start": 1914.6399993896484,
      "end": 1920.6000061035156,
      "text": " While I was in Bible college, there was a, I think it was only one or two years that"
    },
    {
      "id": 22,
      "start": 1920.6000061035156,
      "end": 1925.4400024414062,
      "text": " I was there that they had it, but they had an old style camp meeting. It was a thing"
    },
    {
      "id": 23,
      "start": 1925.4400024414062,
      "end": 1931.0400085449219,
      "text": " called Camp Glory, Camp Glory. And Holly, when she was younger, her church would come"
    },
    {
      "id": 24,
      "start": 1931.0400085449219,
      "end": 1935.6000061035156,
      "text": " over and participate in that. It was, put a big tent out and had this Camp Glory. And"
    },
    {
      "id": 25,
      "start": 1935.6000061035156,
      "end": 1939.7200012207031,
      "text": " I remember all the sound equipment would be under there. And so as a college student,"
    },
    {
      "id": 26,
      "start": 1939.7200012207031,
      "end": 1943.8399963378906,
      "text": " they asked some of us on one of the evenings if we'd sleep under the tent so that there'd"
    },
    {
      "id": 27,
      "start": 1943.8399963378906,
      "end": 1948.8000030517578,
      "text": " be some people there to protect all of the valuable equipment with all the sound equipment"
    },
    {
      "id": 28,
      "start": 1948.8000030517578,
      "end": 1952.8399963378906,
      "text": " and what have you. And I remember at the time, Holly and I weren't married, I was in college,"
    },
    {
      "id": 29,
      "start": 1952.8399963378906,
      "end": 1955.9199981689453,
      "text": " but some of her brothers and myself and a couple of other college students, we slept"
    },
    {
      "id": 30,
      "start": 1955.9199981689453,
      "end": 1961.0800018310547,
      "text": " under the tent that night. And for a couple of hours, we just quoted scripture. And here's"
    },
    {
      "id": 31,
      "start": 1961.0800018310547,
      "end": 1965.5599975585938,
      "text": " how we do it. There's like six of us and they'd have to memorize and quote, rehearse"
    },
    {
      "id": 32,
      "start": 1965.5599975585938,
      "end": 1968.6800079345703,
      "text": " a verse. And then the next person, the next person, the next person, the next person,"
    },
    {
      "id": 33,
      "start": 1968.6800079345703,
      "end": 1973.1600036621094,
      "text": " just kind of go right in a circle. And just how many verses could we quote? How many verses"
    },
    {
      "id": 34,
      "start": 1973.1600036621094,
      "end": 1979.3200073242188,
      "text": " had we hid in our hearts? And you'd be laying there and you've already quoted five, six,"
    },
    {
      "id": 35,
      "start": 1979.3200073242188,
      "end": 1982.760009765625,
      "text": " seven, however many verses. And you're trying to think of the next one you're going to say."
    },
    {
      "id": 36,
      "start": 1982.760009765625,
      "end": 1985.760009765625,
      "text": " And then two people before you said it and you said, no, that was the one I was going"
    },
    {
      "id": 37,
      "start": 1985.760009765625,
      "end": 1990.2799987792969,
      "text": " to say. Right. And you're trying to think about the verses, but, but hiding God's word"
    },
    {
      "id": 38,
      "start": 1990.2799987792969,
      "end": 1995.6800079345703,
      "text": " in our hearts. If we love God's word, you know, it's amazing to me. There's some people"
    },
    {
      "id": 39,
      "start": 1995.6800079345703,
      "end": 2001.8000030517578,
      "text": " that you can talk to that can tell you all kinds of statistics about all kinds of things."
    },
    {
      "id": 40,
      "start": 2001.8000030517578,
      "end": 2008.1800079345703,
      "text": " They can rattle off sports information. They can tell you about all of these statistics"
    },
    {
      "id": 41,
      "start": 2008.1800079345703,
      "end": 2014.2799987792969,
      "text": " and so on and so forth. That stuff is going to matter nothing in eternity. But then you"
    },
    {
      "id": 42,
      "start": 2014.2799987792969,
      "end": 2018.520004272461,
      "text": " challenge them to memorize a verse of scripture. Well, I just don't have a good memory. I just"
    },
    {
      "id": 43,
      "start": 2018.760009765625,
      "end": 2023.1999969482422,
      "text": " can't do it. Are you kidding me? You know all of this stuff about all these other things,"
    },
    {
      "id": 44,
      "start": 2023.1999969482422,
      "end": 2026.8800048828125,
      "text": " but you can't. And it's just a, if I love God's word, if you love God's word, we're"
    },
    {
      "id": 45,
      "start": 2026.8800048828125,
      "end": 2033.5599975585938,
      "text": " going to be memorizing it. We talked about reading it and studying it, memorizing it."
    },
    {
      "id": 46,
      "start": 2033.5599975585938,
      "end": 2039.520004272461,
      "text": " The Psalmist said in Psalm 119, it is my meditation. Oh, how love I thy law. It is my meditation"
    },
    {
      "id": 47,
      "start": 2039.520004272461,
      "end": 2045.6000061035156,
      "text": " all the day. I preached a message years ago from Psalm 119. Actually, it was a Sunday"
    },
    {
      "id": 48,
      "start": 2045.6000061035156,
      "end": 2052.040008544922,
      "text": " school class that I taught that we need to get to the place where we think and act biblically."
    },
    {
      "id": 49,
      "start": 2052.040008544922,
      "end": 2061.040008544922,
      "text": " To think and act biblically. That we have so much of God's word in us that it impacts"
    },
    {
      "id": 50,
      "start": 2061.040008544922,
      "end": 2067.1199951171875,
      "text": " our thoughts, it impacts our behavior, and we begin to think and act biblically. When"
    },
    {
      "id": 51,
      "start": 2067.1199951171875,
      "end": 2071.7999877929688,
      "text": " someone asks you a question, I mean, without giving much thought to it, you're immediately"
    },
    {
      "id": 52,
      "start": 2071.7999877929688,
      "end": 2076.540008544922,
      "text": " thinking about a Bible principle that you could give as an answer. When you're, I say"
    },
    {
      "id": 53,
      "start": 2076.540008544922,
      "end": 2081.8399963378906,
      "text": " this to guys as I try to help them with preparing messages, and you know it, those of you that"
    },
    {
      "id": 54,
      "start": 2081.8399963378906,
      "end": 2088.480010986328,
      "text": " have been here for any length of time, almost every illustration that I use with the Bible,"
    },
    {
      "id": 55,
      "start": 2088.480010986328,
      "end": 2094.7999877929688,
      "text": " I try to use a Bible illustration. Go to a Bible passage that gives us and illustrates"
    },
    {
      "id": 56,
      "start": 2094.7999877929688,
      "end": 2101.720001220703,
      "text": " that truth that we're working with. Why? Because the Bible is full of it. It has so much rich"
    },
    {
      "id": 57,
      "start": 2101.720001220703,
      "end": 2107.6000061035156,
      "text": " information for us where we can see, here's a Bible principle, but here's how it applied."
    },
    {
      "id": 58,
      "start": 2107.6000061035156,
      "end": 2111.7999877929688,
      "text": " Here's how they used the Bible principle, or here's how they did not apply the Bible"
    },
    {
      "id": 59,
      "start": 2111.7999877929688,
      "end": 2118.0800170898438,
      "text": " principle, and here's what happened. Begin to think and act biblically. Why? Because"
    },
    {
      "id": 60,
      "start": 2118.0800170898438,
      "end": 2121.5599975585938,
      "text": " we're saturating our minds with the Bible. We're reading it. We're studying it. We're"
    },
    {
      "id": 61,
      "start": 2121.5599975585938,
      "end": 2128.0,
      "text": " memorizing it. It's on my mind throughout the day. And then I would say this, finally"
    },
    {
      "id": 62,
      "start": 2128.0,
      "end": 2134.0,
      "text": " this evening as we wrap up, if I love God's Word, I'm going to talk about it. I'm going"
    },
    {
      "id": 63,
      "start": 2134.0,
      "end": 2141.480010986328,
      "text": " to share it with others. I'm going to share the truth of God's Word with others. And"
    },
    {
      "id": 64,
      "start": 2141.480010986328,
      "end": 2146.1199951171875,
      "text": " it doesn't have to be something that's forced. It doesn't have to be something that is any"
    },
    {
      "id": 65,
      "start": 2146.1199951171875,
      "end": 2150.519989013672,
      "text": " type of manipulation. No, it's just going to come natural. Why? Because it's so much"
    },
    {
      "id": 66,
      "start": 2150.519989013672,
      "end": 2155.720001220703,
      "text": " in me that it's just the overflow. But I want to talk about the Bible. And the reality this"
    },
    {
      "id": 67,
      "start": 2155.720001220703,
      "end": 2159.6799926757812,
      "text": " evening is that you study throughout the pages of Scripture, you look at the Apostle"
    },
    {
      "id": 68,
      "start": 2159.6799926757812,
      "end": 2164.4400024414062,
      "text": " Paul, and I understand that as he's ministering there, and God used him to write so much of"
    },
    {
      "id": 69,
      "start": 2164.4400024414062,
      "end": 2169.3200073242188,
      "text": " our New Testament from a human perspective, but we find this evening that we as the people"
    },
    {
      "id": 70,
      "start": 2169.3200073242188,
      "end": 2176.040008544922,
      "text": " of God, we need to be sharing the truth of God's Word. And if I love God's Word, I'm"
    },
    {
      "id": 71,
      "start": 2176.040008544922,
      "end": 2182.5599975585938,
      "text": " going to talk about God's Word. How do I know that? Because you talk about what you love."
    },
    {
      "id": 72,
      "start": 2182.5599975585938,
      "end": 2188.1600036621094,
      "text": " You talk about what you love. You meet somebody that you've never met before, and you talk"
    },
    {
      "id": 73,
      "start": 2188.1600036621094,
      "end": 2193.279998779297,
      "text": " to them for a little while, and you can find out their likes, their dislikes, their loves."
    },
    {
      "id": 74,
      "start": 2193.279998779297,
      "end": 2199.6400146484375,
      "text": " You can find out their interests. Why? Because they talk about what they love. You ever meet"
    },
    {
      "id": 75,
      "start": 2199.6400146484375,
      "end": 2204.519989013672,
      "text": " somebody that's all about cars? They're talking about cars, and they're just, I didn't look"
    },
    {
      "id": 76,
      "start": 2204.519989013672,
      "end": 2209.0800170898438,
      "text": " at you, Ron, for that purpose. Sorry. But you're looking, and you're just talking about,"
    },
    {
      "id": 77,
      "start": 2209.0800170898438,
      "end": 2216.5599975585938,
      "text": " but it's, they, we understand it. But I wonder this evening, how often when we as God's people"
    },
    {
      "id": 78,
      "start": 2216.5599975585938,
      "end": 2224.1600036621094,
      "text": " just kind of are having fellowship, how often do we talk about God's Word? Like, just naturally."
    },
    {
      "id": 79,
      "start": 2224.1600036621094,
      "end": 2229.3600158691406,
      "text": " Just when's the last time you said to someone, or maybe someone said to you, hey, what's"
    },
    {
      "id": 80,
      "start": 2229.3600158691406,
      "end": 2237.519989013672,
      "text": " God teaching you from His Word? And the fact that we wouldn't be fearful of someone asking"
    },
    {
      "id": 81,
      "start": 2237.519989013672,
      "end": 2245.0800170898438,
      "text": " us that question, that we are spending so much time in God's Word, that daily we're"
    },
    {
      "id": 82,
      "start": 2245.0800170898438,
      "end": 2250.3200073242188,
      "text": " in the Bible because we love it. We say, oh, how love I thy law, that I'm not afraid of"
    },
    {
      "id": 83,
      "start": 2250.3200073242188,
      "end": 2257.6000061035156,
      "text": " someone asking me, hey, what's God teaching you in His, from His Word? What did you read"
    },
    {
      "id": 84,
      "start": 2257.6000061035156,
      "end": 2261.7999877929688,
      "text": " today? What are you studying? What are you learning? What is God revealing? We shouldn't"
    },
    {
      "id": 85,
      "start": 2261.7999877929688,
      "end": 2268.8800048828125,
      "text": " have to be afraid of that question if we love God's Word. This evening I would submit"
    },
    {
      "id": 86,
      "start": 2268.8800048828125,
      "end": 2274.279998779297,
      "text": " to you, as Bible-believing Christians, that we ought to echo the words of the psalmist"
    },
    {
      "id": 87,
      "start": 2274.279998779297,
      "end": 2283.8800048828125,
      "text": " and say, oh, how love I thy law. But there ought to be evidences in our lives that would"
    },
    {
      "id": 88,
      "start": 2283.8800048828125,
      "end": 2291.2000122070312,
      "text": " support the claim. Really, you say that you love God's Word? Does the evidence support"
    },
    {
      "id": 89,
      "start": 2291.2000122070312,
      "end": 2299.1199951171875,
      "text": " it? We're to inspect and examine ourselves, not someone else. We'll examine our own hearts."
    },
    {
      "id": 90,
      "start": 2299.1199951171875,
      "end": 2303.5599975585938,
      "text": " How's my Bible reading? As you think about that this evening, just ask yourself, how's"
    },
    {
      "id": 91,
      "start": 2303.5599975585938,
      "end": 2308.959991455078,
      "text": " my Bible reading? I've told you before, there's times that I go to read my Bible and I'm distracted."
    },
    {
      "id": 92,
      "start": 2308.959991455078,
      "end": 2313.7200317382812,
      "text": " You say, oh, you're the pastor. I'm a human being. There are times I go to read my Bible"
    },
    {
      "id": 93,
      "start": 2313.7200317382812,
      "end": 2317.7999877929688,
      "text": " and I'm distracted. I'll read a chapter, two, maybe three, and I'm like, I have no"
    },
    {
      "id": 94,
      "start": 2317.7999877929688,
      "end": 2323.0800170898438,
      "text": " idea what I just read. I'm distracted. So you know what I do? I've told you before,"
    },
    {
      "id": 95,
      "start": 2323.0800170898438,
      "end": 2328.760009765625,
      "text": " from this pulpit what I do. I go back and I start over and I pray, God, help me to not"
    },
    {
      "id": 96,
      "start": 2328.760009765625,
      "end": 2333.9600219726562,
      "text": " be distracted. Eliminate those distractions. Help me to be focused. Why? Because this is"
    },
    {
      "id": 97,
      "start": 2333.9600219726562,
      "end": 2340.5599975585938,
      "text": " your Word and you have something for me. And I want to get what you have for me because"
    },
    {
      "id": 98,
      "start": 2340.5599975585938,
      "end": 2346.9600219726562,
      "text": " I need it. We come to the place where we say, listen, how's my Bible reading? When's"
    },
    {
      "id": 99,
      "start": 2346.9600219726562,
      "end": 2353.6799926757812,
      "text": " the last time I shared something from God's Word with someone else? I mean, not forced"
    },
    {
      "id": 100,
      "start": 2353.6799926757812,
      "end": 2359.8800048828125,
      "text": " to, but just because it's got to come out, it's the overflow. Like it's just, I want"
    },
    {
      "id": 101,
      "start": 2359.8800048828125,
      "end": 2365.8400268554688,
      "text": " to talk about it. And that's why I see the psalmist, oh, how love I thy law. I hope this"
    },
    {
      "id": 102,
      "start": 2365.8400268554688,
      "end": 2370.6400146484375,
      "text": " evening that each of us would say, I love God's Word. And then we'd examine ourselves"
    },
    {
      "id": 103,
      "start": 2370.6400146484375,
      "end": 2375.8400268554688,
      "text": " and see if the evidence supports the claim. Let's pray. Father, we love you. Thank you"
    },
    {
      "id": 104,
      "start": 2375.8400268554688,
      "end": 2382.9199829101562,
      "text": " for loving us. It's a joy to have the Bible. It's a joy this evening to know that you've"
    },
    {
      "id": 105,
      "start": 2382.9199829101562,
      "end": 2391.9199829101562,
      "text": " given us the opportunity to put together scriptures, John and Romans, these last couple of days."
    },
    {
      "id": 106,
      "start": 2391.9199829101562,
      "end": 2397.9199829101562,
      "text": " It's a labor of love. It's a labor."
    },
    {
      "id": 0,
      "start": 2397.9199829101562,
      "end": 2404.3199830055237,
      "text": " Because we know the power of Your Word. We know that it's profitable. Being born again"
    },
    {
      "id": 1,
      "start": 2404.3199830055237,
      "end": 2408.43998336792,
      "text": " not of corruptible seed but of incorruptible by the Word of God which liveth and abideth"
    },
    {
      "id": 2,
      "start": 2408.43998336792,
      "end": 2419.1599826812744,
      "text": " forever. God, I pray that You would help us to love Your Word. And I pray that the evidences"
    },
    {
      "id": 3,
      "start": 2419.1599826812744,
      "end": 2426.9199829101562,
      "text": " would be in our lives that as we examine ourselves, Lord, You'd help us to read and study and"
    },
    {
      "id": 4,
      "start": 2426.9199829101562,
      "end": 2437.5199813842773,
      "text": " memorize and meditate and share Your Word. Help it to be fresh. Lord, give us revival."
    },
    {
      "id": 5,
      "start": 2437.5199813842773,
      "end": 2440.5199813842773,
      "text": " I pray that You'd move and work in hearts and lives as only You can and we'll thank"
    },
    {
      "id": 6,
      "start": 2440.5199813842773,
      "end": 2442.6399841308594,
      "text": " You for it in Christ's name we pray. Would You stand with us?"
    }
  ],
  "processed_at": "2025-04-14T19:42:37.610709"
}