{
  "video_id": "DzfYEJzAihI",
  "text": "chapter number one, and that shouldn't be hard to find. And then once you have your place there to turn, if you will, to Psalm 147. And if you want to stick a bookmark there in Psalm 147, a ribbon, a something put there in Psalm 147, we'll be there in just a moment. And I want to look at a passage of scripture here in Genesis chapter number one, and then we'll go there to Psalm 147. Last week, if you were here, you know that we examined creation. And as we looked at the truth of creation, we looked at Psalm 34. He spake and it was done. And then we looked at a number of verses here in the book of Genesis in the first chapter and dealing with the repeated phrases where the Bible says God said, and it was so. We mentioned that creation reveals to us the greatness of God, because we find that creation reveals that our God is omnipotent, that he has all power, that indeed he is great in power. We said not only does creation reveal to us that our God is omnipotent, but our God is omniscient, that he has perfect knowledge. He is great in wisdom. And I'm thankful that our God is great in power and great in wisdom. I'm thankful for what Job said, that the reality is that not only does our God have the wisdom, but he has the power to do what needs to be done. And I'm so grateful for that. And then as we concluded the message last week, we dealt with the fact that creation reveals to us that our God is a God of order. And I'm so thankful that our God is a God of order. We live in the time of chaos and confusion and all sorts of things going on, but our God is a God of order and we can rejoice in that. And we've mentioned as we have as our theme, great is the Lord and greatly to be praised, that we wanna understand as we look at that truth throughout the year, number one, we wanna recognize his greatness. And how is it when we come, we say, yes, God is great, but how do we know that God is great? And over these few weeks, we're going to deal with recognizing God's greatness through creation and how creation reveals to us that our God is great. And as we enter into the end of the year, really midpoint of the year, we'll deal with our response to God's greatness. And before we can respond to his greatness, we must know that he is great. And what a blessing to know the great God and our savior, the Lord Jesus Christ. We're looking for his appearing, by the way, that's what Titus is told by the apostle Paul, looking for the blessed hope, right? The glorious appearing of our great God and savior, the Lord Jesus Christ. And I'm so thankful that one day, and I believe soon he's coming again. In Genesis one, notice in verse number, we'll read verses 14 and following. Notice the Bible says in verse number 14, and God said, let there be lights in the firmament of the heaven to divide the day from the night, let them be for signs and for seasons and for days and years. And let them be for lights in the firmament of the heaven to give light upon the earth. And it was so. And God made two great lights, the greater light to rule the day, the lesser light to rule the night. He made the stars also. And God set them in the firmament of the heaven to give light upon the earth and to rule over the day and over the night, divide the light from the darkness. And God saw that it was good in the evening and the morning were the fourth day. This morning, I wanna consider a single aspect of creation that God reveals to us that took place here on the fourth day of creation. We read the entirety of that day of creation in verse 14 down through verse number 19, the text that we read this morning. But I wanna draw your attention to the last portion of verse number 16. It's just five simple words in the English language, but oh, the depths of what is communicated through these five simple words. When the Bible says this, He made the stars also. He made the stars also. We'll use it as our title for the message this evening, this morning, excuse me. And I've already fast forward to tonight, but for this morning, we'll look at this text of scripture. He made the stars also. Remember what Jeremiah said in Jeremiah 32 in verse 17, all Lord God, thou hast made the heaven and the earth by thy great power and stretched out arm. And then notice how it impacted Jeremiah. And there is nothing too hard for thee. He recognized that God is the creator. He says, God, you've made the heaven and the earth. And obviously we understand all that is contained therein. Oh, the power of our God. He did it by his great power and his stretched out arm. We find that in Genesis chapter 15, if you take and turn over there, if you will, and then eventually we'll get to Psalm 147. But notice in Genesis 15, this is the understanding of this covenant that God would make with Abram. His name would soon in a few chapters be changed to Abraham. But at this particular time in history, His name is Abram. And the Bible says in verse number one, after these things, the word of the Lord came unto Abram in a vision saying, fear not Abram. I am thy shield and thy exceeding great reward. By the way, that's a great entrance, is it not? When God says, fear not, the girls just sang about not having any fear. And we see that the Bible says to Abram to fear not, if you understand the context of chapter 14 and why there might be reason for fear because of that coalition of armies that was defeated and how Lot was rescued by Abram and so on and so forth, that God shows up and says, hey, Abram, don't fear. Why? I am thy shield and thy exceeding great reward. Notice in verse number two, that Abram then says to the Lord, he says, Lord God, what will thou give me seeing I go childless? The steward of my house is this Eleazar of Damascus. And Abram said, behold, to me thou hast given no seed and lo, one born in my house is mine heir. This was his logic. This was his reason on how God might use Eleazar to be his heir. But we find that God responds in verse number four and says, behold, the word of the Lord came unto him saying, this shall not be thine heir, but he that shall come forth out of thine own mouth shall be thine heir. And then notice this in verse number five. And he brought him forth abroad. God brings Abram out and says, look now toward heaven. And tell the stars. Genesis one, the Bible says that he made the stars also. And as God is giving this promise to Abram, he takes him out in the night and he says to Abram, he says, look toward heaven and tell the stars. Notice what he says, if thou be able to number them. Have you ever tried to count the stars? Honestly, I never have. I've never tried. I know some that have. When I was about 13 years old, I went walking out of my house. We lived in Jacksonville, North Carolina. The neighbor that lived on this corner, there was a road in between our house and their house. They had three children, two daughters and a son. The son was the oldest, I don't remember his name. But I remember walking out one night, early evening, and I walked out and he was standing in the middle of his front yard and he was doing this. And I thought, what is that guy doing? He's crazy. And I walked over there and I called him by name and said, what are you doing? He said, you made me lose count. I said, count of what? He said, I was counting the stars. You're doing what? But notice what God says. So shall thy seed be. God is giving, using his creation to reinforce a promise that God has given to Abram. And he says to Abram, look toward heaven. You see all those stars out there? Are you able to number them? Of course he cannot. We find that God would use his creation to reinforce this promise. And the Bible says that Abram, in verse number six, that he believed in the Lord. He counted it to him for righteousness. Oh, isn't that wonderful to see the faith of Abram? Many of us this morning would be familiar with the declaration of the psalmist in Psalm 19 in verse number one, where the Bible says, the heavens declare the glory of God and the firmament showeth his handiwork. This morning as we sit here and I've asked the question already, have you ever tried to count the number of stars? The reality is that none of us would be capable of counting the number of stars. It's beyond our ability. In fact, with all of the advancement in technology and all of the things that exist, we find that even still today, that scientists are only able to offer us with an estimate as to how many stars are actually in the universe. The number of stars that they estimate to be in our universe is this, 200 billion trillion. I mean, I don't even know how you think about it. Honestly, when I think about that number, my mind cannot wrap around that number. 200 billion trillion is the estimate as to how many stars are in our universe. You think about that number and you find that that number is huge, beyond my ability, at least, to comprehend. How many zeros is that? I have no idea. I mean, scientific notation. is needed for that, amen, because it's something to some big power, right? I don't even know how many zeros there are. But the reality is that with that many estimated to be that number of stars in our universe, do you know, not including our sun, that the next closest star to earth is 25.3 trillion miles away? 25.3 trillion miles, four and a half or so light years away, is the next closest star to earth. That's phenomenal to me. And God simply says in Genesis, He made the stars also. It's important for us to understand this morning that God did not make the stars so that mankind would worship the stars. Now we understand that there's a segment of human population throughout the centuries that have worshipped the heavenlies, that have worshipped the stars, and that is not in any way, shape or form, the reason that God created the stars. In fact, He tells us there in Genesis why He did, but I find as we look at Psalm 147, that rather than man worshipping the stars, we find that God created the stars in order to demonstrate His great power and His infinite wisdom, so that man would worship the Creator. That we'd understand how great He is. It's interesting as we look at Psalm 147 this morning and examine these few verses of Scripture, the Bible begins in verse number one, really our text will be verses three through six, but let me read verse number one as we get into it. The Bible says, praise ye the Lord, for it is good to sing praises unto our God, for it is pleasant, and praise is comely. Oh, how important it is that we praise our God. By the way, we have much to praise Him for. The Lord doth build up Jerusalem, He gathereth together the outcast of Israel, He healeth the broken and hardened, bindeth up their wounds, He telleth the number of the stars, He calleth them all by their names. Great is our Lord and of great power, His understanding is infinite. The Lord lifteth up the meek, He casteth the wicked down to the ground. I want to focus our attention this morning on verses three through six here from Psalm 147. If you're taking notes, number one, I want you to note the powerful proclamation. In verses four and five, God gives us this powerful proclamation and it really deals with His power and His wisdom. We mention as we look at Psalm 19 about the heavens declare the glory of God, the firmament showeth His handiwork. As we look there in Genesis chapter one that He made the stars also, we find that the psalmist now again, under the inspiration of the Holy Spirit of God, begins to reference the stars in verses four and five. Then we find this powerful proclamation is given to us with regard to the stars, God's creation, and notice first of all in verse number four, the Bible says this, He, God, the Lord, the one that's to be praised in verse number one, He telleth the number of the stars. Listen, God doesn't have to give an estimate. He knows exactly how many stars there are. He does not have to wonder as our scientists have given us these estimates of 200 billion trillion. No, God knows precisely exactly the number of stars. The Bible declares to us that He telleth the number of the stars, but He stood before Abram and He says, Abram, look up to heaven and see if you can tell the number of stars. Abram's just a man. He's like we are, flesh and blood. Just as we can relate to Abram and say with Abram, no, it is impossible for me to number the stars, but God, He telleth the number of them, of the stars. Notice in this powerful proclamation, not only does God tell us that He knows the number of the stars, but it's amazing in the end of verse number four, the Bible says this, He calleth them, the stars, all by their names. Isn't that amazing? He knoweth the number of the stars and He calleth them all by their names. This is absolutely fascinating to me when I consider the infinite wisdom and the great power of our God and He says in Genesis one, He made the stars also, but He knows how many He made and He gave each of them a name. This is phenomenal. How many names do you think you know? How many people do you think within your circle that you know? I mean, maybe a couple of hundred, maybe more for certain people, right? But the reality, have you ever forgotten somebody's name? Miss Mariah and Mana were walking out of church last Sunday night and I looked straight at Mariah and called her Mana and she, Mana was standing right next to her, but I called her and I said, man, I'm sorry, Mariah, I know your name is Mariah. I'm normally pretty good with names and I'm not saying that to pat myself on the back, I really work on it, I try to be careful with it, I try to learn people's names. Cole over here, man, I was messed up thinking his name was Connor because he looks like my niece's boyfriend in Texas, Connor. He looks just like him, not just like him, but close. And I knew it started with a C and man, every time I'd see him walk in, I'm like, what is his name? I know it's not Cole, I mean, I know it's not Connor, but that's what I want to call him. And so I finally put him aside one day and I said, listen, just remind me of your name. And I don't think I've forgotten since. I try to, but sometimes we forget people's names, right? Two hundred billion trillion is the estimate of man as to the number of stars. God knows exactly how many there are and He calls them all by their name. That's phenomenal to me. Now this great, powerful proclamation of Psalm 147 in verse number four is followed up in verse number five by revealing to us and helping us understand what God is seeking to communicate to us as His creation with this reference to the stars. It is this, number one, He is great. Notice in verse number five, great is our Lord. I mean, how else do you walk away from the powerful proclamation of verse number four without or with any other response than God's great? I mean, that's the immediate response, great is our Lord, notice, and of great power. Yes, we mentioned last week the power of God. And the psalmist continues and says, His understanding is infinite. His understanding is infinite. And so when we begin to notice this powerful proclamation in Psalm 147 verses four and five, we see that He knows exactly the number of stars and He has given all of them a name and He knows them, He calls them by their names, reveals to us that He's a great God, He has great power, and that His understanding is infinite. But I want you to understand this morning that this powerful proclamation is sandwiched in between some precious promises. And if you're taking notes, the second thought this morning is consider the precious promises. We find that verse four and five, this great proclamation of our God and His power and His wisdom, His understanding, and we can understand that He transcends us, His power and His knowledge is so far greater than anything we could even begin to comprehend. But this truth is sandwiched between some precious promises that God is giving to us as the crown of His creation, mankind. Next week, I'm going to preach and it's on the front of our bulletin this week, so we're a week off, but it says, I am fearfully and wonderfully made. I'm going to preach a message on that very title next week, I am fearfully and wonderfully made. I say we're a week off just joking on that, we don't create the bulletins, they just come in and we use them and I saw them and Holly got done printing them and I said, oh, that's my title for my message next week. But anyhow, I want you to notice these precious promises. The all-powerful, all-wise God who spoke the world into existence, who knows the number of stars, who calls them all by their name, is concerned about you as an individual. With all the wonder and the beauty of creation, with all that we see and we can look into the heavenlies and we can see the power, the glory, the work of our God, we understand that He is concerned about you, He's concerned about me, He's concerned about us as individuals. Do you think this morning that if He knows the stars by name? Have you considered that He knows your name? Isn't that precious? There's a song last week, Brianna and Joseph sang, in the middle of my storm, the same fella that wrote that song sang another song, I didn't write the song, but He knows my name. And some of you may have heard that song at some point, but He knows my name. Listen, I'm so thankful that He knows my name and that He knows your name because He's concerned with us as individuals. Now let's consider these promises, let's note them here in verses 3 and verse number 6. There are three of them and they're so precious. Notice in verse number 3, the first of these three promises, the Bible says this, He healeth the broken in heart. He healeth the broken in heart. This same God who knows the number of the stars, the same God who calls them all by their names, this God that is great in power, that His understanding is infinite, that for us as His people, His creation, He says this, that He healeth the broken in heart. Oh, that's a precious truth of the Word of God. I want you to understand this morning that God does not say in Psalm 147 and verse number 3, He does not say that you would not have a broken heart. He says that He healeth the broken in heart, and that ought to be precious to us. See, there are times in our lives where perhaps we go around and we think that we're never going to have a broken heart, we're never going to have this difficulty, we're never going to experience this hardship, but God, the God who said He made the stars also, the one who knows their number, and He calls them by their name, He says, listen, I understand that as an individual at some point you might have a broken heart, but He healeth the broken heart. Oh, that's so precious to me. And I hold it dear, why? Because we are frail people. God knows our frame, He's made us and He knows what we're made of, and He knows what we endure, and He knows what we go through, and He knows that there are times that we might have a broken heart, but He heals. Do you not think this morning that the God who spoke it all into creation, the God who the Bible says He made the stars also, that He knoweth their number and He calls them by name, do you think this morning that He doesn't know about your condition? He knows, listen, if you have a broken heart this morning, God knows it, and the wonderful thing is not just that God knows that you have a broken heart, but the precious truth of the Word of God is that the Bible says that He healeth the broken in heart. We do not need to be shamed or shameful if we have a time in which our heart is overwhelmed, a time in which we would say our heart is breaking over the things that we're dealing with. We need not pretend, we need not to put on a facade, we need not to act as if we got it all under control, no, we go to the One who heals the broken heart, and that's such a precious truth of the Word of God. Turn back if you will, keep your place here, we'll be back in just a moment, but turn to the book of…we're in the book of Psalms, turn to Psalm 61. So many of the Psalms are so precious to us. I mentioned to you a few Sunday nights ago that I'm going to, by God's grace and with God's help, in addition to reading through the Scriptures this year, I'm going to read the book of Psalms and Proverbs each month. I've already been so encouraged and so blessed. Psalm 61 begins, we look at the Psalms and we see how the psalmist is so transparent. Hear my cry, O God, attend unto my prayer. From the end of the earth will I cry unto Thee. Notice what he says, when my heart is overwhelmed, lead me to the rock that is higher than I. You say, I don't know, my heart's overwhelmed, I'm just not…you're human, it happens. There are times in which our hearts are broken, but how we rejoice in understanding even what the psalmist says here in Psalm 61, that when my heart is overwhelmed, lead me to the rock that is higher than I, that we find that the psalmist tells us here in Psalm 147 in verse number 3, he healeth the broken in heart. Oh, this morning. We know people that have broken hearts. You say, pastor, I'm one of them. Maybe you are, you know. You're going through something this morning, a season, whatever it might be. Maybe you know someone. Man, I don't know how people do it without Jesus, honestly. I don't know how people do it without Jesus, because we face some difficulties in life. We face a troubled time, but isn't it wonderful to know that our God reigns? Isn't it wonderful to know the one that heals the broken heart? And again, sandwiched in between these promises is the fact that he knows the number of the stars. He calls them by their name. He's great in power. He's great. He's great in power. His understanding is infinite. And it helps me because I understand that, listen, if he's able to do all of that, that powerful proclamation in verse 4 and 5, if he's able to do all of that with regard to creation and all of the stars and all of his power and his wisdom, then certainly he has the ability to heal my broken heart and to heal your broken heart and to give you what you need in the moment of what you're going through. But it's God that heals the broken heart. Sometimes we look for someone else to heal the broken heart. We think some other circumstance or some other thing is going to heal our broken heart, but it is God who makes the proclamation. He makes this precious promise that it is He that healeth the broken heart. Oh, this morning, I hope that you would take great comfort in this first promise. But he continues. Notice again in verse number 3, the Bible says this, and bindeth up their wounds. He bindeth up their wounds. The word wounds means sorrow, pain, or hurt. The word bindeth literally carries with it the context of a, of bandaging something. And I want you to, in your mind this morning, get this picture where the Bible says that He, God, the Lord, the one who created the stars, the one who knows their number that calls them by their names, that He binds your wounds. Again, as I mentioned in the first promise, again here we find that He does not say that your life will be free from wounds. Rather, He says that He bindeth up their wounds. I think about the little child. I think about our children. I think about when I was a child. I think about our children. You think about the times in which they would get hurt, learning to ride a bike. That's always a difficult time in life, isn't it? Trying to get a child to learn how to ride a bike, and get to that point where you're going to take those training wheels off, right? And what's going to happen? You better have a good supply of Band-Aids, right? Have any of you, you remember your kids learn how to ride a bike, or maybe your kids are in that stage of learning to ride a bike? We have some in church that like Band-Aids a whole lot. I see them with Band-Aids on all the time, right? There's something about riding the bike, and skinning up your knees, right? And it happens, your elbows, and all sorts of things. See, back when I was a kid learning how to do it, they didn't have all these knee pads, elbow pads, and all this helmet stuff. Man, you just had to rub some dirt on it and get over it, you know? Like just whatever. And my dad, he just said amen. He was not the person I went to when I had a wound that had to be bound up, amen? And he took my thunder already. But the reality is that when our kids were going through those stages, they'd fall and they'd cut up their knee, or their hand, or their elbow. You know who they'd come running to? Holly, mom. And they'd be crying, and it would be almost just beyond the ability to calm them down. And Holly would calmly take them into the bathroom, try to get them cleaned up, bandage that wound. You know when all of a sudden it starts happening to that child? They're calm. Why? Because someone who loves them is binding up, bandaging their wounds. And maybe... moms from time to time have other means of helping calm and soothe their children. Let's go get a popsicle, a cookie, a something, right? And man, it just seems to make everything better. We understand that physically speaking, that we understand the idea of having a wound, having something that someone then bandages up and provides that comfort for us that we need and helps us to heal that thing up. But we look at the word of God and the Bible says, not only does God heal the broken in heart, but he says that he bindeth up their wounds. You say, pastor, I have some pains, I have some hurts, I have some sorrow, then rejoice in knowing that God binds them up. Oh, what a joy, what a blessing. Why didn't my children come to me? Maybe I was not as compassionate. Why did I go to my mom and not to my dad? Because he was not as compassionate. You ever have a thought that you broke something? You know what my dad would do? Tim, stand up for just a minute. I'd tell him I thought I broke my arm, he'd say, nah, it's good. That's how it works sometimes. But God is compassionate. God is full of grace and mercy. And he knows what your wounds are. He knows what your hurts are. He knows that if you're carrying that load, he knows and he tells us, he gives us this precious promise that he bindeth up their wounds. I'm so thankful that I don't have to just live life with my wounds. Again, he didn't say that we'd never have wounds. He says that he would bind them up. They don't have to stay as open wounds. They don't have to become infected wounds. You know what happens when they stay open and they become infected? Starts to impact other areas of your life. Spiritually, we're speaking now. We see it physically. You gotta deal with the wounds. You gotta deal with them. You gotta medicate them. You gotta make sure infection doesn't set in, right? There are times in which people have wounds and doctors will put marks on their arms to see where the infection has spread to and they need to come back. And if it passes this line, that stuff happens. But can I tell you what happens in our hearts and our lives when we have wounds and we don't go to the one that binds up the wounds? We get bitter. We get bitter. And bitterness destroys. When we get bitter, no longer are we able to be in a place where we're used of God for his honor and for his glory. We get so focused on ourselves and we're so angry at whoever it was that hurt us and whatever took place and whatever those wounds are. And we're just bitter. Someone said this, it's not original with me, but bitterness destroys the vessel in which it's stored more than the vessel in which it's poured. The reality this morning is that when wounds are not addressed and taken care of, it can cause this root of bitterness. Aren't you thankful this morning that though we experience wounds in our lives, that they don't have to go as open wounds. They don't have to become infected wounds. Why? Because our God, the Bible says, that he bindeth up their wounds. You say, oh, you don't know how deeply hurt I am. Remember, he spoke and it was so. The Bible says he made the stars also. He knows their number. He calls them by name. You're gonna tell me that you have a wound that he can't heal? Come on. He bindeth up their wounds. Notice verse number six, the third promise that is given to us. The powerful proclamation is verses four and five, but these precious promises by which we receive great comfort this morning, I hope that we're encouraged this morning. He healeth the broken in heart. He bindeth up their wounds. Notice in verse number six, the Lord lifteth up the meek. The word lifteth up literally means to restore. The word meek is used in a variety of contexts throughout the Bible. Some have looked at meek and looked at it as being weakness, and not always is it looked at in that frame. Power under control is a great way to define meekness. Meekness in the New Testament, when you look at the fruit of the spirit, it's akin to gentleness. We find here that in the context that's talking about this one that's meek, that's cast down, and all of that that's taking place, and all of these things that have really taken place in the life of this individual, but the Bible says that the Lord, the same God who spoke it all into existence, the one that made the stars also, that knows their number, that calls them by their names, that he lifteth up the meek that he restores. This morning, as we look at these precious promises, and we consider them for just a few moments this morning, I hope that our hearts would be encouraged. I hope that we would receive great comfort from the God who is the God of all comfort. That we understand that though we live in this world, that we will endure hurt, and we will have times of brokenheartedness, and wounds, and times that we're overwhelmed, that God heals, and he binds, and he lifts, he restores. I mentioned that this, our God, who knows the number of the stars, who calls them all by their names, that he's interested in us as individuals. His greatest concern for us is our salvation. It's his greatest concern for us. This morning, I'm thankful for the promises that we find in verse three and verse number six. But you know the greatest work that God's ever done in my life is saving my soul. And I believe this morning that if you're here, and you've trusted Christ as your savior, that you too would testify that the greatest work he's ever done in your life is saving your soul. See, he's not willing that any should perish, but that all should come to repentance. He's given us the plan of redemption in his word that mankind can only be saved through the Lord Jesus Christ. There's no other name under heaven given among men whereby we must be saved. The precious, wonderful name of Jesus. It's not by works of righteousness which we have done. It's not by some religion that we've held to. It's all through the work of Jesus Christ on the cross of Calvary. His death, his burial, and his glorious resurrection. It's Jesus alone. It's not grace plus works. It's not grace and anything else. It's just Jesus. And this morning, as the people of God, if you're here this morning and you've been saved by the blood of Christ, oh, you should rejoice. But though we've been saved by the, and if you've not been saved by the blood of Christ, if you've not, if you don't know, if you don't have that assurance, you're trying to get to heaven on your own some way, through some church or through some other work, oh, come to Christ. He died for you. He loves you. He knows you individually. And he died for you. But for those of us that know Christ as our Savior, oh, those of us that know that he is the creator, the truth that we find this powerful proclamation in verses four and five, yes, should cause us to stand in awe of who he is. And we should have the same response as the psalmist has, great is the Lord and of great power. And his understanding is infinite. But understand this morning that this powerful proclamation in verses four and five of Psalm 147 is sandwiched in between some precious promises for God's people. And those precious promises that he healeth the broken in heart, that he bindeth up their wounds, that he lifteth up the meek, that the same God who has promised to do that for you made the stars also. He calls them all by their names. He knows their number. See, it's kind of like, and the reason that I went to Genesis 15, it's kind of like Abram. You ever have your own logic and your own reason? Abram did. Abram said, God, I'm having a child. You promised me a seed. God, can this Eliezer, maybe he'd be the heir? God says, no, no, Abram, that's not my plan. God says, listen, I'm going to illustrate. Come on out here, look up toward the heaven, see all those stars, can you tell the number of them? Of course not. He says, so shall thy seed be. This morning, God says to you and He says to me, He made the stars also. He knows their number. He calls them all by their names, but He says, I know that my people, they have broken hearts. I know that my people have wounds. I know that they face difficulties and hardships, but I'm the God who heals the broken heart. That's what God says. I'm the God who bindeth up their wounds. Can you see God's mercy and His compassion? Like the mother and the child, binding up your wounds, literally to bandage. He says, I lift up, I restore the meek. Maybe this morning, you say to the Lord, Lord, You know my heart and You know what I'm going through. God, I know who You are, I know that You've created all these things and God, I'm going to claim these promises. Maybe you have a wound. Maybe you've got a wound that's been neglected, it's not been tended to. You've allowed it to just kind of be open and fester and become infected, if I could use that terminology this morning. Maybe you need to let God bind up, bandage that wound because it's just destroying you Maybe this morning, say, Lord, I need to be restored. He lifteth up the meek. I'm not sure what it is this morning, but I know that the Creator God, who knows the number and the names of the stars, He knows you as an individual and He loves you and He knows what you're going through and He says, I can take care of that. I can handle that, but we've got to let Him. We've got to come to Him. That's why the psalmist says, when my heart is overwhelmed, lead me to the rock that is higher than I. Oh, that I would not just try to figure it out myself, try to resolve the matter. No, no, God, You're the one that heals and binds and lifts. Let Him have His way. Let Him do what only He can do. Aren't they some precious promises? I mean, it's a powerful proclamation of what God has done with the stars, knowing their number and their name, but what's more precious to me than He cares about me, He cares about you. He heals, He binds, and He lifts. Let's pray. Lord, we love You this morning and we thank You for loving us. Lord, I don't know, but I take great comfort in knowing that You know every circumstance and situation that every person, under the sound of my voice, is dealing with today. God, You did not promise that we'd have no broken hearts. You did not promise that we'd have no wounds, but You promised that You heal and that You bind. Oh, I'm so thankful. I praise You and I rejoice in You. Thank You for the testimony of the psalmist. I thank You for the work You've done in my life over the years. God, I pray this morning, in the time of invitation, as we reflect upon that which we've heard and we respond to that which we've received from Your Word, as we allow the Holy Spirit of God to have His will and way in our lives, I pray this morning, God, that we'd respond in faith, in obedience, in brokenness. God, I don't know the needs, but I'm thankful that You do. And God, I pray that You would work in such a way that You alone would be glorified. We pray that in these few moments of invitation, there's one that's not sure of heaven. Oh, God, I pray that today would be the day of their salvation. They would not leave this place without knowing for sure, 100% certainty that heaven is their home. I pray that no one would leave this place with a broken heart or a wound, but God, we'd allow You to heal and bind, lift us up. I pray that You'd be glorified, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.5,
      "text": " chapter number one, and that shouldn't be hard to find."
    },
    {
      "id": 1,
      "start": 3.5,
      "end": 5.619999885559082,
      "text": " And then once you have your place there to turn,"
    },
    {
      "id": 2,
      "start": 5.619999885559082,
      "end": 9.0600004196167,
      "text": " if you will, to Psalm 147."
    },
    {
      "id": 3,
      "start": 9.0600004196167,
      "end": 12.420000076293945,
      "text": " And if you want to stick a bookmark there in Psalm 147,"
    },
    {
      "id": 4,
      "start": 12.420000076293945,
      "end": 15.859999656677246,
      "text": " a ribbon, a something put there in Psalm 147,"
    },
    {
      "id": 5,
      "start": 15.859999656677246,
      "end": 17.459999084472656,
      "text": " we'll be there in just a moment."
    },
    {
      "id": 6,
      "start": 17.459999084472656,
      "end": 19.5,
      "text": " And I want to look at a passage of scripture here"
    },
    {
      "id": 7,
      "start": 19.5,
      "end": 20.780000686645508,
      "text": " in Genesis chapter number one,"
    },
    {
      "id": 8,
      "start": 20.780000686645508,
      "end": 23.700000762939453,
      "text": " and then we'll go there to Psalm 147."
    },
    {
      "id": 9,
      "start": 23.700000762939453,
      "end": 25.260000228881836,
      "text": " Last week, if you were here,"
    },
    {
      "id": 10,
      "start": 25.260000228881836,
      "end": 27.700000762939453,
      "text": " you know that we examined creation."
    },
    {
      "id": 11,
      "start": 27.700000762939453,
      "end": 30.299999237060547,
      "text": " And as we looked at the truth of creation,"
    },
    {
      "id": 12,
      "start": 30.299999237060547,
      "end": 31.940000534057617,
      "text": " we looked at Psalm 34."
    },
    {
      "id": 13,
      "start": 31.940000534057617,
      "end": 33.939998626708984,
      "text": " He spake and it was done."
    },
    {
      "id": 14,
      "start": 33.939998626708984,
      "end": 35.779998779296875,
      "text": " And then we looked at a number of verses here"
    },
    {
      "id": 15,
      "start": 35.779998779296875,
      "end": 38.060001373291016,
      "text": " in the book of Genesis in the first chapter"
    },
    {
      "id": 16,
      "start": 38.060001373291016,
      "end": 40.2599983215332,
      "text": " and dealing with the repeated phrases"
    },
    {
      "id": 17,
      "start": 40.2599983215332,
      "end": 44.18000030517578,
      "text": " where the Bible says God said, and it was so."
    },
    {
      "id": 18,
      "start": 44.18000030517578,
      "end": 47.13999938964844,
      "text": " We mentioned that creation reveals to us"
    },
    {
      "id": 19,
      "start": 47.13999938964844,
      "end": 48.41999816894531,
      "text": " the greatness of God,"
    },
    {
      "id": 20,
      "start": 48.41999816894531,
      "end": 50.599998474121094,
      "text": " because we find that creation reveals"
    },
    {
      "id": 21,
      "start": 50.599998474121094,
      "end": 52.29999923706055,
      "text": " that our God is omnipotent,"
    },
    {
      "id": 22,
      "start": 52.29999923706055,
      "end": 56.900001525878906,
      "text": " that he has all power, that indeed he is great in power."
    },
    {
      "id": 23,
      "start": 56.900001525878906,
      "end": 59.29999923706055,
      "text": " We said not only does creation reveal to us"
    },
    {
      "id": 24,
      "start": 59.29999923706055,
      "end": 60.70000076293945,
      "text": " that our God is omnipotent,"
    },
    {
      "id": 25,
      "start": 60.70000076293945,
      "end": 64.66000366210938,
      "text": " but our God is omniscient, that he has perfect knowledge."
    },
    {
      "id": 26,
      "start": 64.66000366210938,
      "end": 66.9800033569336,
      "text": " He is great in wisdom."
    },
    {
      "id": 27,
      "start": 66.9800033569336,
      "end": 69.26000213623047,
      "text": " And I'm thankful that our God is great in power"
    },
    {
      "id": 28,
      "start": 69.26000213623047,
      "end": 70.30000305175781,
      "text": " and great in wisdom."
    },
    {
      "id": 29,
      "start": 70.30000305175781,
      "end": 72.5,
      "text": " I'm thankful for what Job said,"
    },
    {
      "id": 30,
      "start": 72.5,
      "end": 74.81999969482422,
      "text": " that the reality is that not only does our God"
    },
    {
      "id": 31,
      "start": 74.81999969482422,
      "end": 77.66000366210938,
      "text": " have the wisdom, but he has the power to do"
    },
    {
      "id": 32,
      "start": 77.66000366210938,
      "end": 78.69999694824219,
      "text": " what needs to be done."
    },
    {
      "id": 33,
      "start": 78.69999694824219,
      "end": 80.45999908447266,
      "text": " And I'm so grateful for that."
    },
    {
      "id": 34,
      "start": 80.45999908447266,
      "end": 82.58000183105469,
      "text": " And then as we concluded the message last week,"
    },
    {
      "id": 35,
      "start": 82.58000183105469,
      "end": 85.0,
      "text": " we dealt with the fact that creation reveals to us"
    },
    {
      "id": 36,
      "start": 85.0,
      "end": 88.04000091552734,
      "text": " that our God is a God of order."
    },
    {
      "id": 37,
      "start": 88.04000091552734,
      "end": 90.83999633789062,
      "text": " And I'm so thankful that our God is a God of order."
    },
    {
      "id": 38,
      "start": 90.83999633789062,
      "end": 93.76000213623047,
      "text": " We live in the time of chaos and confusion"
    },
    {
      "id": 39,
      "start": 93.76000213623047,
      "end": 95.80000305175781,
      "text": " and all sorts of things going on,"
    },
    {
      "id": 40,
      "start": 95.80000305175781,
      "end": 100.4800033569336,
      "text": " but our God is a God of order and we can rejoice in that."
    },
    {
      "id": 41,
      "start": 100.4800033569336,
      "end": 102.5199966430664,
      "text": " And we've mentioned as we have as our theme,"
    },
    {
      "id": 42,
      "start": 102.5199966430664,
      "end": 105.19999694824219,
      "text": " great is the Lord and greatly to be praised,"
    },
    {
      "id": 43,
      "start": 105.19999694824219,
      "end": 108.19999694824219,
      "text": " that we wanna understand as we look at that truth"
    },
    {
      "id": 44,
      "start": 108.19999694824219,
      "end": 109.55999755859375,
      "text": " throughout the year,"
    },
    {
      "id": 45,
      "start": 109.55999755859375,
      "end": 112.16000366210938,
      "text": " number one, we wanna recognize his greatness."
    },
    {
      "id": 46,
      "start": 112.16000366210938,
      "end": 113.95999908447266,
      "text": " And how is it when we come, we say,"
    },
    {
      "id": 47,
      "start": 113.95999908447266,
      "end": 117.44000244140625,
      "text": " yes, God is great, but how do we know that God is great?"
    },
    {
      "id": 48,
      "start": 117.44000244140625,
      "end": 120.12000274658203,
      "text": " And over these few weeks, we're going to deal with"
    },
    {
      "id": 49,
      "start": 120.12000274658203,
      "end": 122.72000122070312,
      "text": " recognizing God's greatness through creation"
    },
    {
      "id": 50,
      "start": 122.72000122070312,
      "end": 126.62000274658203,
      "text": " and how creation reveals to us that our God is great."
    },
    {
      "id": 51,
      "start": 126.62000274658203,
      "end": 129.60000610351562,
      "text": " And as we enter into the end of the year,"
    },
    {
      "id": 52,
      "start": 129.60000610351562,
      "end": 131.66000366210938,
      "text": " really midpoint of the year,"
    },
    {
      "id": 53,
      "start": 131.66000366210938,
      "end": 134.36000061035156,
      "text": " we'll deal with our response to God's greatness."
    },
    {
      "id": 54,
      "start": 134.36000061035156,
      "end": 136.32000732421875,
      "text": " And before we can respond to his greatness,"
    },
    {
      "id": 55,
      "start": 136.32000732421875,
      "end": 138.32000732421875,
      "text": " we must know that he is great."
    },
    {
      "id": 56,
      "start": 138.32000732421875,
      "end": 141.83999633789062,
      "text": " And what a blessing to know the great God"
    },
    {
      "id": 57,
      "start": 141.83999633789062,
      "end": 143.94000244140625,
      "text": " and our savior, the Lord Jesus Christ."
    },
    {
      "id": 58,
      "start": 144.77999877929688,
      "end": 145.6199951171875,
      "text": " We're looking for his appearing, by the way,"
    },
    {
      "id": 59,
      "start": 145.6199951171875,
      "end": 148.6999969482422,
      "text": " that's what Titus is told by the apostle Paul,"
    },
    {
      "id": 60,
      "start": 148.6999969482422,
      "end": 150.82000732421875,
      "text": " looking for the blessed hope, right?"
    },
    {
      "id": 61,
      "start": 150.82000732421875,
      "end": 153.4199981689453,
      "text": " The glorious appearing of our great God and savior,"
    },
    {
      "id": 62,
      "start": 153.4199981689453,
      "end": 154.94000244140625,
      "text": " the Lord Jesus Christ."
    },
    {
      "id": 63,
      "start": 154.94000244140625,
      "end": 156.66000366210938,
      "text": " And I'm so thankful that one day,"
    },
    {
      "id": 64,
      "start": 156.66000366210938,
      "end": 158.86000061035156,
      "text": " and I believe soon he's coming again."
    },
    {
      "id": 65,
      "start": 158.86000061035156,
      "end": 161.05999755859375,
      "text": " In Genesis one, notice in verse number,"
    },
    {
      "id": 66,
      "start": 161.05999755859375,
      "end": 162.97999572753906,
      "text": " we'll read verses 14 and following."
    },
    {
      "id": 67,
      "start": 162.97999572753906,
      "end": 164.5800018310547,
      "text": " Notice the Bible says in verse number 14,"
    },
    {
      "id": 68,
      "start": 164.5800018310547,
      "end": 166.3800048828125,
      "text": " and God said, let there be lights"
    },
    {
      "id": 69,
      "start": 166.3800048828125,
      "end": 167.9600067138672,
      "text": " in the firmament of the heaven"
    },
    {
      "id": 70,
      "start": 167.9600067138672,
      "end": 169.4199981689453,
      "text": " to divide the day from the night,"
    },
    {
      "id": 71,
      "start": 169.4199981689453,
      "end": 171.5399932861328,
      "text": " let them be for signs and for seasons"
    },
    {
      "id": 72,
      "start": 171.5399932861328,
      "end": 173.3000030517578,
      "text": " and for days and years."
    },
    {
      "id": 73,
      "start": 173.3000030517578,
      "end": 175.94000244140625,
      "text": " And let them be for lights in the firmament of the heaven"
    },
    {
      "id": 74,
      "start": 175.94000244140625,
      "end": 178.10000610351562,
      "text": " to give light upon the earth."
    },
    {
      "id": 75,
      "start": 178.10000610351562,
      "end": 180.05999755859375,
      "text": " And it was so."
    },
    {
      "id": 76,
      "start": 180.05999755859375,
      "end": 181.6199951171875,
      "text": " And God made two great lights,"
    },
    {
      "id": 77,
      "start": 181.6199951171875,
      "end": 183.6199951171875,
      "text": " the greater light to rule the day,"
    },
    {
      "id": 78,
      "start": 183.6199951171875,
      "end": 185.97999572753906,
      "text": " the lesser light to rule the night."
    },
    {
      "id": 79,
      "start": 185.97999572753906,
      "end": 188.17999267578125,
      "text": " He made the stars also."
    },
    {
      "id": 80,
      "start": 188.17999267578125,
      "end": 190.66000366210938,
      "text": " And God set them in the firmament of the heaven"
    },
    {
      "id": 81,
      "start": 190.66000366210938,
      "end": 192.94000244140625,
      "text": " to give light upon the earth"
    },
    {
      "id": 82,
      "start": 192.94000244140625,
      "end": 195.4600067138672,
      "text": " and to rule over the day and over the night,"
    },
    {
      "id": 83,
      "start": 195.4600067138672,
      "end": 197.1199951171875,
      "text": " divide the light from the darkness."
    },
    {
      "id": 84,
      "start": 197.1199951171875,
      "end": 198.5800018310547,
      "text": " And God saw that it was good"
    },
    {
      "id": 85,
      "start": 198.5800018310547,
      "end": 201.77999877929688,
      "text": " in the evening and the morning were the fourth day."
    },
    {
      "id": 86,
      "start": 201.77999877929688,
      "end": 205.10000610351562,
      "text": " This morning, I wanna consider a single aspect of creation"
    },
    {
      "id": 87,
      "start": 205.10000610351562,
      "end": 207.82000732421875,
      "text": " that God reveals to us that took place here"
    },
    {
      "id": 88,
      "start": 207.82000732421875,
      "end": 209.4600067138672,
      "text": " on the fourth day of creation."
    },
    {
      "id": 89,
      "start": 209.4600067138672,
      "end": 212.5399932861328,
      "text": " We read the entirety of that day of creation"
    },
    {
      "id": 90,
      "start": 212.5399932861328,
      "end": 214.77999877929688,
      "text": " in verse 14 down through verse number 19,"
    },
    {
      "id": 91,
      "start": 214.77999877929688,
      "end": 216.74000549316406,
      "text": " the text that we read this morning."
    },
    {
      "id": 92,
      "start": 216.74000549316406,
      "end": 218.05999755859375,
      "text": " But I wanna draw your attention"
    },
    {
      "id": 93,
      "start": 218.05999755859375,
      "end": 220.74000549316406,
      "text": " to the last portion of verse number 16."
    },
    {
      "id": 94,
      "start": 220.74000549316406,
      "end": 225.10000610351562,
      "text": " It's just five simple words in the English language,"
    },
    {
      "id": 95,
      "start": 225.10000610351562,
      "end": 228.6999969482422,
      "text": " but oh, the depths of what is communicated"
    },
    {
      "id": 96,
      "start": 228.6999969482422,
      "end": 231.3000030517578,
      "text": " through these five simple words."
    },
    {
      "id": 97,
      "start": 231.3000030517578,
      "end": 236.3000030517578,
      "text": " When the Bible says this, He made the stars also."
    },
    {
      "id": 98,
      "start": 236.94000244140625,
      "end": 238.25999450683594,
      "text": " He made the stars also."
    },
    {
      "id": 99,
      "start": 238.25999450683594,
      "end": 240.89999389648438,
      "text": " We'll use it as our title for the message this evening,"
    },
    {
      "id": 100,
      "start": 240.89999389648438,
      "end": 242.3000030517578,
      "text": " this morning, excuse me."
    },
    {
      "id": 101,
      "start": 242.3000030517578,
      "end": 244.74000549316406,
      "text": " And I've already fast forward to tonight,"
    },
    {
      "id": 102,
      "start": 244.74000549316406,
      "end": 247.4600067138672,
      "text": " but for this morning, we'll look at this text of scripture."
    },
    {
      "id": 103,
      "start": 247.4600067138672,
      "end": 249.4600067138672,
      "text": " He made the stars also."
    },
    {
      "id": 104,
      "start": 249.4600067138672,
      "end": 253.13999938964844,
      "text": " Remember what Jeremiah said in Jeremiah 32 in verse 17,"
    },
    {
      "id": 105,
      "start": 253.13999938964844,
      "end": 258.1400146484375,
      "text": " all Lord God, thou hast made the heaven and the earth"
    },
    {
      "id": 106,
      "start": 259.1000061035156,
      "end": 262.7799987792969,
      "text": " by thy great power and stretched out arm."
    },
    {
      "id": 107,
      "start": 262.7799987792969,
      "end": 265.260009765625,
      "text": " And then notice how it impacted Jeremiah."
    },
    {
      "id": 108,
      "start": 265.260009765625,
      "end": 269.5799865722656,
      "text": " And there is nothing too hard for thee."
    },
    {
      "id": 109,
      "start": 270.5799865722656,
      "end": 272.8999938964844,
      "text": " He recognized that God is the creator."
    },
    {
      "id": 110,
      "start": 272.8999938964844,
      "end": 276.29998779296875,
      "text": " He says, God, you've made the heaven and the earth."
    },
    {
      "id": 111,
      "start": 276.29998779296875,
      "end": 280.6600036621094,
      "text": " And obviously we understand all that is contained therein."
    },
    {
      "id": 112,
      "start": 280.6600036621094,
      "end": 282.29998779296875,
      "text": " Oh, the power of our God."
    },
    {
      "id": 113,
      "start": 282.29998779296875,
      "end": 285.05999755859375,
      "text": " He did it by his great power and his stretched out arm."
    },
    {
      "id": 114,
      "start": 285.05999755859375,
      "end": 287.0199890136719,
      "text": " We find that in Genesis chapter 15,"
    },
    {
      "id": 115,
      "start": 287.0199890136719,
      "end": 290.05999755859375,
      "text": " if you take and turn over there, if you will,"
    },
    {
      "id": 116,
      "start": 290.05999755859375,
      "end": 291.9800109863281,
      "text": " and then eventually we'll get to Psalm 147."
    },
    {
      "id": 117,
      "start": 291.9800109863281,
      "end": 294.0199890136719,
      "text": " But notice in Genesis 15,"
    },
    {
      "id": 118,
      "start": 294.0199890136719,
      "end": 297.4200134277344,
      "text": " this is the understanding of this covenant"
    },
    {
      "id": 119,
      "start": 297.4200134277344,
      "end": 298.9800109863281,
      "text": " that God would make with Abram."
    },
    {
      "id": 120,
      "start": 298.9800109863281,
      "end": 302.3800048828125,
      "text": " His name would soon in a few chapters be changed to Abraham."
    },
    {
      "id": 121,
      "start": 302.3800048828125,
      "end": 305.29998779296875,
      "text": " But at this particular time in history, His name is Abram."
    },
    {
      "id": 122,
      "start": 305.29998779296875,
      "end": 306.739990234375,
      "text": " And the Bible says in verse number one,"
    },
    {
      "id": 123,
      "start": 306.739990234375,
      "end": 309.5799865722656,
      "text": " after these things, the word of the Lord came unto Abram"
    },
    {
      "id": 124,
      "start": 309.5799865722656,
      "end": 311.82000732421875,
      "text": " in a vision saying, fear not Abram."
    },
    {
      "id": 125,
      "start": 311.82000732421875,
      "end": 314.94000244140625,
      "text": " I am thy shield and thy exceeding great reward."
    },
    {
      "id": 126,
      "start": 314.94000244140625,
      "end": 318.29998779296875,
      "text": " By the way, that's a great entrance, is it not?"
    },
    {
      "id": 127,
      "start": 318.29998779296875,
      "end": 319.8999938964844,
      "text": " When God says, fear not,"
    },
    {
      "id": 128,
      "start": 319.8999938964844,
      "end": 322.6199951171875,
      "text": " the girls just sang about not having any fear."
    },
    {
      "id": 129,
      "start": 322.6199951171875,
      "end": 325.7799987792969,
      "text": " And we see that the Bible says to Abram to fear not,"
    },
    {
      "id": 130,
      "start": 325.7799987792969,
      "end": 327.94000244140625,
      "text": " if you understand the context of chapter 14"
    },
    {
      "id": 131,
      "start": 327.94000244140625,
      "end": 330.3800048828125,
      "text": " and why there might be reason for fear"
    },
    {
      "id": 132,
      "start": 330.3800048828125,
      "end": 333.1400146484375,
      "text": " because of that coalition of armies that was defeated"
    },
    {
      "id": 133,
      "start": 333.1400146484375,
      "end": 336.05999755859375,
      "text": " and how Lot was rescued by Abram and so on and so forth,"
    },
    {
      "id": 134,
      "start": 336.05999755859375,
      "end": 339.260009765625,
      "text": " that God shows up and says, hey, Abram, don't fear."
    },
    {
      "id": 135,
      "start": 339.260009765625,
      "end": 340.1000061035156,
      "text": " Why?"
    },
    {
      "id": 136,
      "start": 340.1000061035156,
      "end": 345.1000061035156,
      "text": " I am thy shield and thy exceeding great reward."
    },
    {
      "id": 137,
      "start": 345.29998779296875,
      "end": 346.3800048828125,
      "text": " Notice in verse number two,"
    },
    {
      "id": 138,
      "start": 346.3800048828125,
      "end": 348.9800109863281,
      "text": " that Abram then says to the Lord, he says, Lord God,"
    },
    {
      "id": 139,
      "start": 348.9800109863281,
      "end": 352.4599914550781,
      "text": " what will thou give me seeing I go childless?"
    },
    {
      "id": 140,
      "start": 353.3399963378906,
      "end": 356.5799865722656,
      "text": " The steward of my house is this Eleazar of Damascus."
    },
    {
      "id": 141,
      "start": 356.5799865722656,
      "end": 359.739990234375,
      "text": " And Abram said, behold, to me thou hast given no seed"
    },
    {
      "id": 142,
      "start": 359.739990234375,
      "end": 364.6600036621094,
      "text": " and lo, one born in my house is mine heir."
    },
    {
      "id": 143,
      "start": 364.6600036621094,
      "end": 366.3399963378906,
      "text": " This was his logic."
    },
    {
      "id": 144,
      "start": 366.3399963378906,
      "end": 370.5799865722656,
      "text": " This was his reason on how God might use Eleazar"
    },
    {
      "id": 145,
      "start": 370.5799865722656,
      "end": 372.1400146484375,
      "text": " to be his heir."
    },
    {
      "id": 146,
      "start": 372.1400146484375,
      "end": 375.0199890136719,
      "text": " But we find that God responds in verse number four"
    },
    {
      "id": 147,
      "start": 375.0199890136719,
      "end": 377.4599914550781,
      "text": " and says, behold, the word of the Lord came unto him"
    },
    {
      "id": 148,
      "start": 377.4599914550781,
      "end": 381.4599914550781,
      "text": " saying, this shall not be thine heir,"
    },
    {
      "id": 149,
      "start": 381.4599914550781,
      "end": 383.6199951171875,
      "text": " but he that shall come forth out of thine own mouth"
    },
    {
      "id": 150,
      "start": 383.6199951171875,
      "end": 384.5799865722656,
      "text": " shall be thine heir."
    },
    {
      "id": 151,
      "start": 384.5799865722656,
      "end": 386.70001220703125,
      "text": " And then notice this in verse number five."
    },
    {
      "id": 152,
      "start": 387.70001220703125,
      "end": 390.05999755859375,
      "text": " And he brought him forth abroad."
    },
    {
      "id": 153,
      "start": 390.05999755859375,
      "end": 395.05999755859375,
      "text": " God brings Abram out and says, look now toward heaven."
    },
    {
      "id": 154,
      "start": 396.7799987792969,
      "end": 398.3800048828125,
      "text": " And tell the stars."
    },
    {
      "id": 155,
      "start": 399.739990234375,
      "end": 402.70001220703125,
      "text": " Genesis one, the Bible says that he made the stars also."
    },
    {
      "id": 156,
      "start": 402.70001220703125,
      "end": 405.6199951171875,
      "text": " And as God is giving this promise to Abram,"
    },
    {
      "id": 157,
      "start": 405.6199951171875,
      "end": 408.7799987792969,
      "text": " he takes him out in the night and he says to Abram,"
    },
    {
      "id": 158,
      "start": 408.7799987792969,
      "end": 413.7799987792969,
      "text": " he says, look toward heaven and tell the stars."
    },
    {
      "id": 159,
      "start": 413.8999938964844,
      "end": 418.8999938964844,
      "text": " Notice what he says, if thou be able to number them."
    },
    {
      "id": 160,
      "start": 420.5799865722656,
      "end": 423.3399963378906,
      "text": " Have you ever tried to count the stars?"
    },
    {
      "id": 161,
      "start": 423.3399963378906,
      "end": 425.739990234375,
      "text": " Honestly, I never have."
    },
    {
      "id": 162,
      "start": 425.739990234375,
      "end": 426.7799987792969,
      "text": " I've never tried."
    },
    {
      "id": 163,
      "start": 429.260009765625,
      "end": 430.7799987792969,
      "text": " I know some that have."
    },
    {
      "id": 164,
      "start": 432.17999267578125,
      "end": 434.4599914550781,
      "text": " When I was about 13 years old,"
    },
    {
      "id": 165,
      "start": 434.4599914550781,
      "end": 436.5,
      "text": " I went walking out of my house."
    },
    {
      "id": 166,
      "start": 436.5,
      "end": 438.8999938964844,
      "text": " We lived in Jacksonville, North Carolina."
    },
    {
      "id": 167,
      "start": 438.8999938964844,
      "end": 442.5799865722656,
      "text": " The neighbor that lived on this corner,"
    },
    {
      "id": 168,
      "start": 442.5799865722656,
      "end": 444.8599853515625,
      "text": " there was a road in between our house and their house."
    },
    {
      "id": 169,
      "start": 444.8599853515625,
      "end": 447.260009765625,
      "text": " They had three children, two daughters and a son."
    },
    {
      "id": 170,
      "start": 447.260009765625,
      "end": 450.2200012207031,
      "text": " The son was the oldest, I don't remember his name."
    },
    {
      "id": 171,
      "start": 450.2200012207031,
      "end": 453.29998779296875,
      "text": " But I remember walking out one night, early evening,"
    },
    {
      "id": 172,
      "start": 453.29998779296875,
      "end": 454.739990234375,
      "text": " and I walked out and he was standing"
    },
    {
      "id": 173,
      "start": 454.739990234375,
      "end": 458.2200012207031,
      "text": " in the middle of his front yard and he was doing this."
    },
    {
      "id": 174,
      "start": 458.2200012207031,
      "end": 460.0199890136719,
      "text": " And I thought, what is that guy doing?"
    },
    {
      "id": 175,
      "start": 460.0199890136719,
      "end": 460.94000244140625,
      "text": " He's crazy."
    },
    {
      "id": 176,
      "start": 462.0199890136719,
      "end": 463.70001220703125,
      "text": " And I walked over there and I called him by name"
    },
    {
      "id": 177,
      "start": 463.70001220703125,
      "end": 464.5400085449219,
      "text": " and said, what are you doing?"
    },
    {
      "id": 178,
      "start": 464.5400085449219,
      "end": 466.5,
      "text": " He said, you made me lose count."
    },
    {
      "id": 179,
      "start": 467.94000244140625,
      "end": 469.3399963378906,
      "text": " I said, count of what?"
    },
    {
      "id": 180,
      "start": 469.3399963378906,
      "end": 472.17999267578125,
      "text": " He said, I was counting the stars."
    },
    {
      "id": 181,
      "start": 472.17999267578125,
      "end": 473.1000061035156,
      "text": " You're doing what?"
    },
    {
      "id": 182,
      "start": 475.260009765625,
      "end": 476.8599853515625,
      "text": " But notice what God says."
    },
    {
      "id": 183,
      "start": 480.2200012207031,
      "end": 483.6199951171875,
      "text": " So shall thy seed be."
    },
    {
      "id": 184,
      "start": 485.260009765625,
      "end": 490.260009765625,
      "text": " God is giving, using his creation to reinforce a promise"
    },
    {
      "id": 185,
      "start": 492.1400146484375,
      "end": 494.7799987792969,
      "text": " that God has given to Abram."
    },
    {
      "id": 186,
      "start": 494.7799987792969,
      "end": 496.82000732421875,
      "text": " And he says to Abram, look toward heaven."
    },
    {
      "id": 187,
      "start": 497.7799987792969,
      "end": 499.1400146484375,
      "text": " You see all those stars out there?"
    },
    {
      "id": 188,
      "start": 499.1400146484375,
      "end": 500.1000061035156,
      "text": " Are you able to number them?"
    },
    {
      "id": 189,
      "start": 500.1000061035156,
      "end": 501.3800048828125,
      "text": " Of course he cannot."
    },
    {
      "id": 190,
      "start": 502.260009765625,
      "end": 504.9800109863281,
      "text": " We find that God would use his creation"
    },
    {
      "id": 191,
      "start": 504.9800109863281,
      "end": 506.8599853515625,
      "text": " to reinforce this promise."
    },
    {
      "id": 192,
      "start": 506.8599853515625,
      "end": 509.6600036621094,
      "text": " And the Bible says that Abram, in verse number six,"
    },
    {
      "id": 193,
      "start": 509.6600036621094,
      "end": 512.0999755859375,
      "text": " that he believed in the Lord."
    },
    {
      "id": 194,
      "start": 512.1400146484375,
      "end": 515.219970703125,
      "text": " He counted it to him for righteousness."
    },
    {
      "id": 195,
      "start": 515.219970703125,
      "end": 518.9400024414062,
      "text": " Oh, isn't that wonderful to see the faith of Abram?"
    },
    {
      "id": 196,
      "start": 518.9400024414062,
      "end": 520.780029296875,
      "text": " Many of us this morning would be familiar"
    },
    {
      "id": 197,
      "start": 520.780029296875,
      "end": 523.0999755859375,
      "text": " with the declaration of the psalmist in Psalm 19"
    },
    {
      "id": 198,
      "start": 523.0999755859375,
      "end": 524.8599853515625,
      "text": " in verse number one, where the Bible says,"
    },
    {
      "id": 199,
      "start": 524.8599853515625,
      "end": 527.3800048828125,
      "text": " the heavens declare the glory of God"
    },
    {
      "id": 200,
      "start": 527.3800048828125,
      "end": 530.02001953125,
      "text": " and the firmament showeth his handiwork."
    },
    {
      "id": 201,
      "start": 531.5399780273438,
      "end": 532.97998046875,
      "text": " This morning as we sit here"
    },
    {
      "id": 202,
      "start": 532.97998046875,
      "end": 534.9000244140625,
      "text": " and I've asked the question already,"
    },
    {
      "id": 203,
      "start": 534.9000244140625,
      "end": 537.0599975585938,
      "text": " have you ever tried to count the number of stars?"
    },
    {
      "id": 204,
      "start": 537.0599975585938,
      "end": 539.780029296875,
      "text": " The reality is that none of us would be capable"
    },
    {
      "id": 205,
      "start": 539.780029296875,
      "end": 542.1400146484375,
      "text": " of counting the number of stars."
    },
    {
      "id": 206,
      "start": 542.1400146484375,
      "end": 544.1799926757812,
      "text": " It's beyond our ability."
    },
    {
      "id": 207,
      "start": 544.1799926757812,
      "end": 547.219970703125,
      "text": " In fact, with all of the advancement in technology"
    },
    {
      "id": 208,
      "start": 547.219970703125,
      "end": 548.739990234375,
      "text": " and all of the things that exist,"
    },
    {
      "id": 209,
      "start": 548.739990234375,
      "end": 550.8599853515625,
      "text": " we find that even still today,"
    },
    {
      "id": 210,
      "start": 550.8599853515625,
      "end": 553.3400268554688,
      "text": " that scientists are only able to offer us"
    },
    {
      "id": 211,
      "start": 553.3400268554688,
      "end": 555.4199829101562,
      "text": " with an estimate as to how many stars"
    },
    {
      "id": 212,
      "start": 555.4199829101562,
      "end": 557.1199951171875,
      "text": " are actually in the universe."
    },
    {
      "id": 213,
      "start": 558.0599975585938,
      "end": 559.8200073242188,
      "text": " The number of stars that they estimate"
    },
    {
      "id": 214,
      "start": 559.8200073242188,
      "end": 564.6599731445312,
      "text": " to be in our universe is this, 200 billion trillion."
    },
    {
      "id": 215,
      "start": 566.780029296875,
      "end": 568.6599731445312,
      "text": " I mean, I don't even know how you think about it."
    },
    {
      "id": 216,
      "start": 568.6599731445312,
      "end": 570.739990234375,
      "text": " Honestly, when I think about that number,"
    },
    {
      "id": 217,
      "start": 570.739990234375,
      "end": 573.6799926757812,
      "text": " my mind cannot wrap around that number."
    },
    {
      "id": 218,
      "start": 575.219970703125,
      "end": 580.219970703125,
      "text": " 200 billion trillion is the estimate"
    },
    {
      "id": 219,
      "start": 580.219970703125,
      "end": 582.6599731445312,
      "text": " as to how many stars are in our universe."
    },
    {
      "id": 220,
      "start": 584.219970703125,
      "end": 587.4199829101562,
      "text": " You think about that number and you find"
    },
    {
      "id": 221,
      "start": 587.4199829101562,
      "end": 592.1799926757812,
      "text": " that that number is huge, beyond my ability,"
    },
    {
      "id": 222,
      "start": 592.1799926757812,
      "end": 594.219970703125,
      "text": " at least, to comprehend."
    },
    {
      "id": 223,
      "start": 594.219970703125,
      "end": 595.2999877929688,
      "text": " How many zeros is that?"
    },
    {
      "id": 224,
      "start": 595.2999877929688,
      "end": 596.5800170898438,
      "text": " I have no idea."
    },
    {
      "id": 225,
      "start": 596.5800170898438,
      "end": 599.9000244140625,
      "text": " I mean, scientific notation."
    },
    {
      "id": 0,
      "start": 599.9000244140625,
      "end": 603.8200244903564,
      "text": " is needed for that, amen, because it's something to some big power, right?"
    },
    {
      "id": 1,
      "start": 603.8200244903564,
      "end": 607.7800245285034,
      "text": " I don't even know how many zeros there are."
    },
    {
      "id": 2,
      "start": 607.7800245285034,
      "end": 615.8800239562988,
      "text": " But the reality is that with that many estimated to be that number of stars in our universe,"
    },
    {
      "id": 3,
      "start": 615.8800239562988,
      "end": 625.9800243377686,
      "text": " do you know, not including our sun, that the next closest star to earth is 25.3 trillion"
    },
    {
      "id": 4,
      "start": 625.9800243377686,
      "end": 627.9800243377686,
      "text": " miles away?"
    },
    {
      "id": 5,
      "start": 628.9800243377686,
      "end": 637.9000244140625,
      "text": " 25.3 trillion miles, four and a half or so light years away, is the next closest star"
    },
    {
      "id": 6,
      "start": 637.9000244140625,
      "end": 640.0200233459473,
      "text": " to earth."
    },
    {
      "id": 7,
      "start": 640.0200233459473,
      "end": 642.8200225830078,
      "text": " That's phenomenal to me."
    },
    {
      "id": 8,
      "start": 642.8200225830078,
      "end": 650.100025177002,
      "text": " And God simply says in Genesis, He made the stars also."
    },
    {
      "id": 9,
      "start": 650.100025177002,
      "end": 655.700023651123,
      "text": " It's important for us to understand this morning that God did not make the stars so that mankind"
    },
    {
      "id": 10,
      "start": 655.700023651123,
      "end": 657.7400245666504,
      "text": " would worship the stars."
    },
    {
      "id": 11,
      "start": 657.7400245666504,
      "end": 662.9400253295898,
      "text": " Now we understand that there's a segment of human population throughout the centuries"
    },
    {
      "id": 12,
      "start": 662.9400253295898,
      "end": 667.5400238037109,
      "text": " that have worshipped the heavenlies, that have worshipped the stars, and that is not"
    },
    {
      "id": 13,
      "start": 667.5400238037109,
      "end": 671.3000259399414,
      "text": " in any way, shape or form, the reason that God created the stars."
    },
    {
      "id": 14,
      "start": 671.3000259399414,
      "end": 677.5400238037109,
      "text": " In fact, He tells us there in Genesis why He did, but I find as we look at Psalm 147,"
    },
    {
      "id": 15,
      "start": 677.5400238037109,
      "end": 683.5800247192383,
      "text": " that rather than man worshipping the stars, we find that God created the stars in order"
    },
    {
      "id": 16,
      "start": 683.5800247192383,
      "end": 691.5800247192383,
      "text": " to demonstrate His great power and His infinite wisdom, so that man would worship the Creator."
    },
    {
      "id": 17,
      "start": 691.5800247192383,
      "end": 695.1000213623047,
      "text": " That we'd understand how great He is."
    },
    {
      "id": 18,
      "start": 695.1000213623047,
      "end": 700.140022277832,
      "text": " It's interesting as we look at Psalm 147 this morning and examine these few verses of Scripture,"
    },
    {
      "id": 19,
      "start": 700.140022277832,
      "end": 704.4200210571289,
      "text": " the Bible begins in verse number one, really our text will be verses three through six,"
    },
    {
      "id": 20,
      "start": 704.4200210571289,
      "end": 706.3000259399414,
      "text": " but let me read verse number one as we get into it."
    },
    {
      "id": 21,
      "start": 706.3000259399414,
      "end": 711.9800262451172,
      "text": " The Bible says, praise ye the Lord, for it is good to sing praises unto our God, for"
    },
    {
      "id": 22,
      "start": 711.9800262451172,
      "end": 715.3800277709961,
      "text": " it is pleasant, and praise is comely."
    },
    {
      "id": 23,
      "start": 715.3800277709961,
      "end": 719.0600280761719,
      "text": " Oh, how important it is that we praise our God."
    },
    {
      "id": 24,
      "start": 719.0600280761719,
      "end": 722.0600280761719,
      "text": " By the way, we have much to praise Him for."
    },
    {
      "id": 25,
      "start": 722.0600280761719,
      "end": 726.7000274658203,
      "text": " The Lord doth build up Jerusalem, He gathereth together the outcast of Israel, He healeth"
    },
    {
      "id": 26,
      "start": 726.7000274658203,
      "end": 730.7400207519531,
      "text": " the broken and hardened, bindeth up their wounds, He telleth the number of the stars,"
    },
    {
      "id": 27,
      "start": 730.7400207519531,
      "end": 732.4600219726562,
      "text": " He calleth them all by their names."
    },
    {
      "id": 28,
      "start": 732.4600219726562,
      "end": 735.9800262451172,
      "text": " Great is our Lord and of great power, His understanding is infinite."
    },
    {
      "id": 29,
      "start": 735.9800262451172,
      "end": 742.2200317382812,
      "text": " The Lord lifteth up the meek, He casteth the wicked down to the ground."
    },
    {
      "id": 30,
      "start": 742.2200317382812,
      "end": 746.1400299072266,
      "text": " I want to focus our attention this morning on verses three through six here from Psalm"
    },
    {
      "id": 31,
      "start": 746.1400299072266,
      "end": 747.1400299072266,
      "text": " 147."
    },
    {
      "id": 32,
      "start": 747.1400299072266,
      "end": 752.2600250244141,
      "text": " If you're taking notes, number one, I want you to note the powerful proclamation."
    },
    {
      "id": 33,
      "start": 752.2600250244141,
      "end": 756.9400177001953,
      "text": " In verses four and five, God gives us this powerful proclamation and it really deals"
    },
    {
      "id": 34,
      "start": 756.9400177001953,
      "end": 758.6400299072266,
      "text": " with His power and His wisdom."
    },
    {
      "id": 35,
      "start": 758.6400299072266,
      "end": 764.2200317382812,
      "text": " We mention as we look at Psalm 19 about the heavens declare the glory of God, the firmament"
    },
    {
      "id": 36,
      "start": 764.2600250244141,
      "end": 765.6200256347656,
      "text": " showeth His handiwork."
    },
    {
      "id": 37,
      "start": 765.6200256347656,
      "end": 770.780029296875,
      "text": " As we look there in Genesis chapter one that He made the stars also, we find that the psalmist"
    },
    {
      "id": 38,
      "start": 770.780029296875,
      "end": 775.4600219726562,
      "text": " now again, under the inspiration of the Holy Spirit of God, begins to reference the stars"
    },
    {
      "id": 39,
      "start": 775.4600219726562,
      "end": 777.1800231933594,
      "text": " in verses four and five."
    },
    {
      "id": 40,
      "start": 777.1800231933594,
      "end": 782.2600250244141,
      "text": " Then we find this powerful proclamation is given to us with regard to the stars, God's"
    },
    {
      "id": 41,
      "start": 782.2600250244141,
      "end": 788.1800231933594,
      "text": " creation, and notice first of all in verse number four, the Bible says this, He, God,"
    },
    {
      "id": 42,
      "start": 788.1800231933594,
      "end": 794.3400268554688,
      "text": " the Lord, the one that's to be praised in verse number one, He telleth the number of"
    },
    {
      "id": 43,
      "start": 794.3400268554688,
      "end": 795.3400268554688,
      "text": " the stars."
    },
    {
      "id": 44,
      "start": 795.3400268554688,
      "end": 799.0600280761719,
      "text": " Listen, God doesn't have to give an estimate."
    },
    {
      "id": 45,
      "start": 799.0600280761719,
      "end": 802.4200286865234,
      "text": " He knows exactly how many stars there are."
    },
    {
      "id": 46,
      "start": 802.4200286865234,
      "end": 810.3800201416016,
      "text": " He does not have to wonder as our scientists have given us these estimates of 200 billion"
    },
    {
      "id": 47,
      "start": 810.3800201416016,
      "end": 811.3800201416016,
      "text": " trillion."
    },
    {
      "id": 48,
      "start": 811.3800201416016,
      "end": 814.9400177001953,
      "text": " No, God knows precisely exactly the number of stars."
    },
    {
      "id": 49,
      "start": 814.9400177001953,
      "end": 821.3400268554688,
      "text": " The Bible declares to us that He telleth the number of the stars, but He stood before Abram"
    },
    {
      "id": 50,
      "start": 821.3400268554688,
      "end": 826.9800262451172,
      "text": " and He says, Abram, look up to heaven and see if you can tell the number of stars."
    },
    {
      "id": 51,
      "start": 826.9800262451172,
      "end": 828.780029296875,
      "text": " Abram's just a man."
    },
    {
      "id": 52,
      "start": 828.780029296875,
      "end": 831.9800262451172,
      "text": " He's like we are, flesh and blood."
    },
    {
      "id": 53,
      "start": 831.9800262451172,
      "end": 837.7600250244141,
      "text": " Just as we can relate to Abram and say with Abram, no, it is impossible for me to number"
    },
    {
      "id": 54,
      "start": 837.7600250244141,
      "end": 846.2400207519531,
      "text": " the stars, but God, He telleth the number of them, of the stars."
    },
    {
      "id": 55,
      "start": 846.2400207519531,
      "end": 850.9000244140625,
      "text": " Notice in this powerful proclamation, not only does God tell us that He knows the number"
    },
    {
      "id": 56,
      "start": 850.9000244140625,
      "end": 855.8000183105469,
      "text": " of the stars, but it's amazing in the end of verse number four, the Bible says this,"
    },
    {
      "id": 57,
      "start": 855.8000183105469,
      "end": 862.8800354003906,
      "text": " He calleth them, the stars, all by their names."
    },
    {
      "id": 58,
      "start": 862.8800354003906,
      "end": 867.2000122070312,
      "text": " Isn't that amazing?"
    },
    {
      "id": 59,
      "start": 867.2000122070312,
      "end": 876.6000366210938,
      "text": " He knoweth the number of the stars and He calleth them all by their names."
    },
    {
      "id": 60,
      "start": 876.6000366210938,
      "end": 882.3200378417969,
      "text": " This is absolutely fascinating to me when I consider the infinite wisdom and the great"
    },
    {
      "id": 61,
      "start": 882.3200378417969,
      "end": 888.0800170898438,
      "text": " power of our God and He says in Genesis one, He made the stars also, but He knows how many"
    },
    {
      "id": 62,
      "start": 888.0800170898438,
      "end": 892.8000183105469,
      "text": " He made and He gave each of them a name."
    },
    {
      "id": 63,
      "start": 892.8000183105469,
      "end": 894.8800354003906,
      "text": " This is phenomenal."
    },
    {
      "id": 64,
      "start": 894.8800354003906,
      "end": 896.3200378417969,
      "text": " How many names do you think you know?"
    },
    {
      "id": 65,
      "start": 896.4400329589844,
      "end": 899.760009765625,
      "text": " How many people do you think within your circle that you know?"
    },
    {
      "id": 66,
      "start": 899.760009765625,
      "end": 905.4000244140625,
      "text": " I mean, maybe a couple of hundred, maybe more for certain people, right?"
    },
    {
      "id": 67,
      "start": 905.4000244140625,
      "end": 911.6800231933594,
      "text": " But the reality, have you ever forgotten somebody's name?"
    },
    {
      "id": 68,
      "start": 911.6800231933594,
      "end": 915.6800231933594,
      "text": " Miss Mariah and Mana were walking out of church last Sunday night and I looked straight at"
    },
    {
      "id": 69,
      "start": 915.6800231933594,
      "end": 918.760009765625,
      "text": " Mariah and called her Mana and she, Mana was standing right next to her, but I called her"
    },
    {
      "id": 70,
      "start": 918.760009765625,
      "end": 921.52001953125,
      "text": " and I said, man, I'm sorry, Mariah, I know your name is Mariah."
    },
    {
      "id": 71,
      "start": 921.52001953125,
      "end": 925.5600280761719,
      "text": " I'm normally pretty good with names and I'm not saying that to pat myself on the back,"
    },
    {
      "id": 72,
      "start": 925.5600280761719,
      "end": 929.3200378417969,
      "text": " I really work on it, I try to be careful with it, I try to learn people's names."
    },
    {
      "id": 73,
      "start": 929.3200378417969,
      "end": 937.0400390625,
      "text": " Cole over here, man, I was messed up thinking his name was Connor because he looks like"
    },
    {
      "id": 74,
      "start": 937.0400390625,
      "end": 939.6800231933594,
      "text": " my niece's boyfriend in Texas, Connor."
    },
    {
      "id": 75,
      "start": 939.6800231933594,
      "end": 943.8200378417969,
      "text": " He looks just like him, not just like him, but close."
    },
    {
      "id": 76,
      "start": 943.8200378417969,
      "end": 949.6000366210938,
      "text": " And I knew it started with a C and man, every time I'd see him walk in, I'm like, what is"
    },
    {
      "id": 77,
      "start": 949.6000366210938,
      "end": 950.6000366210938,
      "text": " his name?"
    },
    {
      "id": 78,
      "start": 950.6000366210938,
      "end": 954.280029296875,
      "text": " I know it's not Cole, I mean, I know it's not Connor, but that's what I want to call"
    },
    {
      "id": 79,
      "start": 954.280029296875,
      "end": 955.280029296875,
      "text": " him."
    },
    {
      "id": 80,
      "start": 956.0000305175781,
      "end": 960.4600219726562,
      "text": " And so I finally put him aside one day and I said, listen, just remind me of your name."
    },
    {
      "id": 81,
      "start": 960.4600219726562,
      "end": 963.0800170898438,
      "text": " And I don't think I've forgotten since."
    },
    {
      "id": 82,
      "start": 963.0800170898438,
      "end": 967.8000183105469,
      "text": " I try to, but sometimes we forget people's names, right?"
    },
    {
      "id": 83,
      "start": 967.8000183105469,
      "end": 974.6000366210938,
      "text": " Two hundred billion trillion is the estimate of man as to the number of stars."
    },
    {
      "id": 84,
      "start": 974.6000366210938,
      "end": 982.4000244140625,
      "text": " God knows exactly how many there are and He calls them all by their name."
    },
    {
      "id": 85,
      "start": 982.4000244140625,
      "end": 985.280029296875,
      "text": " That's phenomenal to me."
    },
    {
      "id": 86,
      "start": 985.280029296875,
      "end": 992.6800231933594,
      "text": " Now this great, powerful proclamation of Psalm 147 in verse number four is followed up in"
    },
    {
      "id": 87,
      "start": 992.6800231933594,
      "end": 999.0400390625,
      "text": " verse number five by revealing to us and helping us understand what God is seeking to communicate"
    },
    {
      "id": 88,
      "start": 999.0400390625,
      "end": 1003.5800170898438,
      "text": " to us as His creation with this reference to the stars."
    },
    {
      "id": 89,
      "start": 1003.5800170898438,
      "end": 1008.280029296875,
      "text": " It is this, number one, He is great."
    },
    {
      "id": 90,
      "start": 1008.280029296875,
      "end": 1011.8000183105469,
      "text": " Notice in verse number five, great is our Lord."
    },
    {
      "id": 91,
      "start": 1012.2000122070312,
      "end": 1016.8800354003906,
      "text": " I mean, how else do you walk away from the powerful proclamation of verse number four"
    },
    {
      "id": 92,
      "start": 1016.8800354003906,
      "end": 1022.2000122070312,
      "text": " without or with any other response than God's great?"
    },
    {
      "id": 93,
      "start": 1022.2000122070312,
      "end": 1030.4000244140625,
      "text": " I mean, that's the immediate response, great is our Lord, notice, and of great power."
    },
    {
      "id": 94,
      "start": 1030.4000244140625,
      "end": 1036.8400268554688,
      "text": " Yes, we mentioned last week the power of God."
    },
    {
      "id": 95,
      "start": 1036.8800354003906,
      "end": 1044.280029296875,
      "text": " And the psalmist continues and says, His understanding is infinite."
    },
    {
      "id": 96,
      "start": 1044.280029296875,
      "end": 1046.6000366210938,
      "text": " His understanding is infinite."
    },
    {
      "id": 97,
      "start": 1046.6000366210938,
      "end": 1051.6800231933594,
      "text": " And so when we begin to notice this powerful proclamation in Psalm 147 verses four and"
    },
    {
      "id": 98,
      "start": 1051.6800231933594,
      "end": 1057.5600280761719,
      "text": " five, we see that He knows exactly the number of stars and He has given all of them a name"
    },
    {
      "id": 99,
      "start": 1057.5600280761719,
      "end": 1065.52001953125,
      "text": " and He knows them, He calls them by their names, reveals to us that He's a great God,"
    },
    {
      "id": 100,
      "start": 1065.52001953125,
      "end": 1070.8000183105469,
      "text": " He has great power, and that His understanding is infinite."
    },
    {
      "id": 101,
      "start": 1070.8000183105469,
      "end": 1078.6800231933594,
      "text": " But I want you to understand this morning that this powerful proclamation is sandwiched"
    },
    {
      "id": 102,
      "start": 1078.6800231933594,
      "end": 1082.760009765625,
      "text": " in between some precious promises."
    },
    {
      "id": 103,
      "start": 1082.760009765625,
      "end": 1088.7200317382812,
      "text": " And if you're taking notes, the second thought this morning is consider the precious promises."
    },
    {
      "id": 104,
      "start": 1088.7200317382812,
      "end": 1094.8400268554688,
      "text": " We find that verse four and five, this great proclamation of our God and His power and"
    },
    {
      "id": 105,
      "start": 1094.8400268554688,
      "end": 1100.760009765625,
      "text": " His wisdom, His understanding, and we can understand that He transcends us, His power"
    },
    {
      "id": 106,
      "start": 1100.760009765625,
      "end": 1107.8400268554688,
      "text": " and His knowledge is so far greater than anything we could even begin to comprehend."
    },
    {
      "id": 107,
      "start": 1107.8400268554688,
      "end": 1114.2400512695312,
      "text": " But this truth is sandwiched between some precious promises that God is giving to us"
    },
    {
      "id": 108,
      "start": 1114.2400512695312,
      "end": 1119.52001953125,
      "text": " as the crown of His creation, mankind."
    },
    {
      "id": 109,
      "start": 1119.52001953125,
      "end": 1123.1600341796875,
      "text": " Next week, I'm going to preach and it's on the front of our bulletin this week, so we're"
    },
    {
      "id": 110,
      "start": 1123.1600341796875,
      "end": 1127.0800170898438,
      "text": " a week off, but it says, I am fearfully and wonderfully made."
    },
    {
      "id": 111,
      "start": 1127.0800170898438,
      "end": 1133.1199951171875,
      "text": " I'm going to preach a message on that very title next week, I am fearfully and wonderfully"
    },
    {
      "id": 112,
      "start": 1133.1199951171875,
      "end": 1134.1199951171875,
      "text": " made."
    },
    {
      "id": 113,
      "start": 1134.1199951171875,
      "end": 1140.4000244140625,
      "text": " I say we're a week off just joking on that, we don't create the bulletins, they just come"
    },
    {
      "id": 114,
      "start": 1140.4000244140625,
      "end": 1145.0400390625,
      "text": " in and we use them and I saw them and Holly got done printing them and I said, oh, that's"
    },
    {
      "id": 115,
      "start": 1145.0400390625,
      "end": 1147.4000244140625,
      "text": " my title for my message next week."
    },
    {
      "id": 116,
      "start": 1147.4000244140625,
      "end": 1152.8400268554688,
      "text": " But anyhow, I want you to notice these precious promises."
    },
    {
      "id": 117,
      "start": 1152.8400268554688,
      "end": 1160.8600463867188,
      "text": " The all-powerful, all-wise God who spoke the world into existence, who knows the number"
    },
    {
      "id": 118,
      "start": 1160.8600463867188,
      "end": 1172.2200317382812,
      "text": " of stars, who calls them all by their name, is concerned about you as an individual."
    },
    {
      "id": 119,
      "start": 1172.2200317382812,
      "end": 1180.6600341796875,
      "text": " With all the wonder and the beauty of creation, with all that we see and we can look into"
    },
    {
      "id": 120,
      "start": 1180.6600341796875,
      "end": 1187.260009765625,
      "text": " the heavenlies and we can see the power, the glory, the work of our God, we understand"
    },
    {
      "id": 121,
      "start": 1187.260009765625,
      "end": 1195.4200439453125,
      "text": " that He is concerned about you, He's concerned about me, He's concerned about us as individuals."
    },
    {
      "id": 122,
      "start": 1195.4200439453125,
      "end": 1199.3400268554688,
      "text": " Do you think this morning that if He knows the stars by name?"
    },
    {
      "id": 0,
      "start": 1199.3400268554688,
      "end": 1203.020026922226,
      "text": " Have you considered that He knows your name?"
    },
    {
      "id": 1,
      "start": 1203.020026922226,
      "end": 1207.540026664734,
      "text": " Isn't that precious?"
    },
    {
      "id": 2,
      "start": 1207.540026664734,
      "end": 1212.740026473999,
      "text": " There's a song last week, Brianna and Joseph sang, in the middle of my storm, the same"
    },
    {
      "id": 3,
      "start": 1212.740026473999,
      "end": 1218.6200275421143,
      "text": " fella that wrote that song sang another song, I didn't write the song, but He knows my name."
    },
    {
      "id": 4,
      "start": 1218.6200275421143,
      "end": 1222.2200260162354,
      "text": " And some of you may have heard that song at some point, but He knows my name."
    },
    {
      "id": 5,
      "start": 1222.2200260162354,
      "end": 1227.580026626587,
      "text": " Listen, I'm so thankful that He knows my name and that He knows your name because He's concerned"
    },
    {
      "id": 6,
      "start": 1227.580026626587,
      "end": 1228.580026626587,
      "text": " with us as individuals."
    },
    {
      "id": 7,
      "start": 1229.1800270080566,
      "end": 1234.3400268554688,
      "text": " Now let's consider these promises, let's note them here in verses 3 and verse number 6."
    },
    {
      "id": 8,
      "start": 1234.3400268554688,
      "end": 1237.5800285339355,
      "text": " There are three of them and they're so precious."
    },
    {
      "id": 9,
      "start": 1237.5800285339355,
      "end": 1244.0200271606445,
      "text": " Notice in verse number 3, the first of these three promises, the Bible says this, He healeth"
    },
    {
      "id": 10,
      "start": 1244.0200271606445,
      "end": 1247.0200271606445,
      "text": " the broken in heart."
    },
    {
      "id": 11,
      "start": 1247.0200271606445,
      "end": 1251.8600273132324,
      "text": " He healeth the broken in heart."
    },
    {
      "id": 12,
      "start": 1251.8600273132324,
      "end": 1256.3400268554688,
      "text": " This same God who knows the number of the stars, the same God who calls them all by"
    },
    {
      "id": 13,
      "start": 1256.3400268554688,
      "end": 1263.0200271606445,
      "text": " their names, this God that is great in power, that His understanding is infinite, that for"
    },
    {
      "id": 14,
      "start": 1263.0200271606445,
      "end": 1271.1000289916992,
      "text": " us as His people, His creation, He says this, that He healeth the broken in heart."
    },
    {
      "id": 15,
      "start": 1271.1000289916992,
      "end": 1274.9400253295898,
      "text": " Oh, that's a precious truth of the Word of God."
    },
    {
      "id": 16,
      "start": 1274.9400253295898,
      "end": 1280.780029296875,
      "text": " I want you to understand this morning that God does not say in Psalm 147 and verse number"
    },
    {
      "id": 17,
      "start": 1280.780029296875,
      "end": 1287.1000289916992,
      "text": " 3, He does not say that you would not have a broken heart."
    },
    {
      "id": 18,
      "start": 1287.1000289916992,
      "end": 1294.1000289916992,
      "text": " He says that He healeth the broken in heart, and that ought to be precious to us."
    },
    {
      "id": 19,
      "start": 1294.1000289916992,
      "end": 1299.4200286865234,
      "text": " See, there are times in our lives where perhaps we go around and we think that we're never"
    },
    {
      "id": 20,
      "start": 1299.4200286865234,
      "end": 1303.3400268554688,
      "text": " going to have a broken heart, we're never going to have this difficulty, we're never"
    },
    {
      "id": 21,
      "start": 1303.3400268554688,
      "end": 1308.6200256347656,
      "text": " going to experience this hardship, but God, the God who said He made the stars also, the"
    },
    {
      "id": 22,
      "start": 1308.6200256347656,
      "end": 1313.6200256347656,
      "text": " one who knows their number, and He calls them by their name, He says, listen, I understand"
    },
    {
      "id": 23,
      "start": 1313.6200256347656,
      "end": 1320.380027770996,
      "text": " that as an individual at some point you might have a broken heart, but He healeth the broken"
    },
    {
      "id": 24,
      "start": 1320.380027770996,
      "end": 1321.380027770996,
      "text": " heart."
    },
    {
      "id": 25,
      "start": 1321.380027770996,
      "end": 1325.4600296020508,
      "text": " Oh, that's so precious to me."
    },
    {
      "id": 26,
      "start": 1325.4600296020508,
      "end": 1327.4400329589844,
      "text": " And I hold it dear, why?"
    },
    {
      "id": 27,
      "start": 1327.4400329589844,
      "end": 1329.8600311279297,
      "text": " Because we are frail people."
    },
    {
      "id": 28,
      "start": 1329.8600311279297,
      "end": 1334.6200256347656,
      "text": " God knows our frame, He's made us and He knows what we're made of, and He knows what we endure,"
    },
    {
      "id": 29,
      "start": 1334.6200256347656,
      "end": 1338.02001953125,
      "text": " and He knows what we go through, and He knows that there are times that we might have a"
    },
    {
      "id": 30,
      "start": 1338.02001953125,
      "end": 1345.8200225830078,
      "text": " broken heart, but He heals."
    },
    {
      "id": 31,
      "start": 1345.8200225830078,
      "end": 1354.6200256347656,
      "text": " Do you not think this morning that the God who spoke it all into creation, the God who"
    },
    {
      "id": 32,
      "start": 1354.6200256347656,
      "end": 1359.0600280761719,
      "text": " the Bible says He made the stars also, that He knoweth their number and He calls them"
    },
    {
      "id": 33,
      "start": 1359.0600280761719,
      "end": 1366.02001953125,
      "text": " by name, do you think this morning that He doesn't know about your condition?"
    },
    {
      "id": 34,
      "start": 1366.02001953125,
      "end": 1371.8200225830078,
      "text": " He knows, listen, if you have a broken heart this morning, God knows it, and the wonderful"
    },
    {
      "id": 35,
      "start": 1371.8200225830078,
      "end": 1376.5000305175781,
      "text": " thing is not just that God knows that you have a broken heart, but the precious truth"
    },
    {
      "id": 36,
      "start": 1376.5000305175781,
      "end": 1384.7000274658203,
      "text": " of the Word of God is that the Bible says that He healeth the broken in heart."
    },
    {
      "id": 37,
      "start": 1384.7000274658203,
      "end": 1393.1800231933594,
      "text": " We do not need to be shamed or shameful if we have a time in which our heart is overwhelmed,"
    },
    {
      "id": 38,
      "start": 1393.1800231933594,
      "end": 1398.5000305175781,
      "text": " a time in which we would say our heart is breaking over the things that we're dealing"
    },
    {
      "id": 39,
      "start": 1398.5000305175781,
      "end": 1400.4000244140625,
      "text": " with."
    },
    {
      "id": 40,
      "start": 1400.4000244140625,
      "end": 1405.5800323486328,
      "text": " We need not pretend, we need not to put on a facade, we need not to act as if we got"
    },
    {
      "id": 41,
      "start": 1405.5800323486328,
      "end": 1411.4200286865234,
      "text": " it all under control, no, we go to the One who heals the broken heart, and that's such"
    },
    {
      "id": 42,
      "start": 1411.4200286865234,
      "end": 1413.7000274658203,
      "text": " a precious truth of the Word of God."
    },
    {
      "id": 43,
      "start": 1413.7000274658203,
      "end": 1417.8200225830078,
      "text": " Turn back if you will, keep your place here, we'll be back in just a moment, but turn to"
    },
    {
      "id": 44,
      "start": 1417.8200225830078,
      "end": 1427.3400268554688,
      "text": " the book of…we're in the book of Psalms, turn to Psalm 61."
    },
    {
      "id": 45,
      "start": 1427.3400268554688,
      "end": 1430.7000274658203,
      "text": " So many of the Psalms are so precious to us."
    },
    {
      "id": 46,
      "start": 1430.7000274658203,
      "end": 1435.6600341796875,
      "text": " I mentioned to you a few Sunday nights ago that I'm going to, by God's grace and with"
    },
    {
      "id": 47,
      "start": 1435.6600341796875,
      "end": 1439.7400207519531,
      "text": " God's help, in addition to reading through the Scriptures this year, I'm going to read"
    },
    {
      "id": 48,
      "start": 1439.7400207519531,
      "end": 1442.5800323486328,
      "text": " the book of Psalms and Proverbs each month."
    },
    {
      "id": 49,
      "start": 1442.5800323486328,
      "end": 1447.9000244140625,
      "text": " I've already been so encouraged and so blessed."
    },
    {
      "id": 50,
      "start": 1447.9000244140625,
      "end": 1454.3800201416016,
      "text": " Psalm 61 begins, we look at the Psalms and we see how the psalmist is so transparent."
    },
    {
      "id": 51,
      "start": 1454.3800201416016,
      "end": 1460.2600402832031,
      "text": " Hear my cry, O God, attend unto my prayer."
    },
    {
      "id": 52,
      "start": 1460.2600402832031,
      "end": 1462.4200134277344,
      "text": " From the end of the earth will I cry unto Thee."
    },
    {
      "id": 53,
      "start": 1462.4200134277344,
      "end": 1468.8200378417969,
      "text": " Notice what he says, when my heart is overwhelmed, lead me to the rock that is higher than I."
    },
    {
      "id": 54,
      "start": 1468.8200378417969,
      "end": 1480.5000305175781,
      "text": " You say, I don't know, my heart's overwhelmed, I'm just not…you're human, it happens."
    },
    {
      "id": 55,
      "start": 1480.5000305175781,
      "end": 1487.3000183105469,
      "text": " There are times in which our hearts are broken, but how we rejoice in understanding even what"
    },
    {
      "id": 56,
      "start": 1487.3000183105469,
      "end": 1491.9800415039062,
      "text": " the psalmist says here in Psalm 61, that when my heart is overwhelmed, lead me to the rock"
    },
    {
      "id": 57,
      "start": 1491.9800415039062,
      "end": 1496.6600341796875,
      "text": " that is higher than I, that we find that the psalmist tells us here in Psalm 147 in verse"
    },
    {
      "id": 58,
      "start": 1496.6600341796875,
      "end": 1501.8200378417969,
      "text": " number 3, he healeth the broken in heart."
    },
    {
      "id": 59,
      "start": 1501.8200378417969,
      "end": 1507.1800231933594,
      "text": " Oh, this morning."
    },
    {
      "id": 60,
      "start": 1507.1800231933594,
      "end": 1511.4600219726562,
      "text": " We know people that have broken hearts."
    },
    {
      "id": 61,
      "start": 1511.4600219726562,
      "end": 1513.3400268554688,
      "text": " You say, pastor, I'm one of them."
    },
    {
      "id": 62,
      "start": 1513.3400268554688,
      "end": 1515.6200256347656,
      "text": " Maybe you are, you know."
    },
    {
      "id": 63,
      "start": 1515.6200256347656,
      "end": 1523.5400390625,
      "text": " You're going through something this morning, a season, whatever it might be."
    },
    {
      "id": 64,
      "start": 1523.5400390625,
      "end": 1524.5400390625,
      "text": " Maybe you know someone."
    },
    {
      "id": 65,
      "start": 1525.5400390625,
      "end": 1531.5400390625,
      "text": " Man, I don't know how people do it without Jesus, honestly."
    },
    {
      "id": 66,
      "start": 1531.5400390625,
      "end": 1539.4600219726562,
      "text": " I don't know how people do it without Jesus, because we face some difficulties in life."
    },
    {
      "id": 67,
      "start": 1539.4600219726562,
      "end": 1546.1400146484375,
      "text": " We face a troubled time, but isn't it wonderful to know that our God reigns?"
    },
    {
      "id": 68,
      "start": 1546.1400146484375,
      "end": 1551.8600158691406,
      "text": " Isn't it wonderful to know the one that heals the broken heart?"
    },
    {
      "id": 69,
      "start": 1551.8600158691406,
      "end": 1558.5000305175781,
      "text": " And again, sandwiched in between these promises is the fact that he knows the number of the"
    },
    {
      "id": 70,
      "start": 1558.5000305175781,
      "end": 1559.5000305175781,
      "text": " stars."
    },
    {
      "id": 71,
      "start": 1559.5000305175781,
      "end": 1560.5000305175781,
      "text": " He calls them by their name."
    },
    {
      "id": 72,
      "start": 1560.5000305175781,
      "end": 1561.5000305175781,
      "text": " He's great in power."
    },
    {
      "id": 73,
      "start": 1561.5000305175781,
      "end": 1562.5000305175781,
      "text": " He's great."
    },
    {
      "id": 74,
      "start": 1562.5000305175781,
      "end": 1563.5000305175781,
      "text": " He's great in power."
    },
    {
      "id": 75,
      "start": 1563.5000305175781,
      "end": 1565.4200134277344,
      "text": " His understanding is infinite."
    },
    {
      "id": 76,
      "start": 1565.4200134277344,
      "end": 1570.5400390625,
      "text": " And it helps me because I understand that, listen, if he's able to do all of that, that"
    },
    {
      "id": 77,
      "start": 1570.5400390625,
      "end": 1574.6200256347656,
      "text": " powerful proclamation in verse 4 and 5, if he's able to do all of that with regard to"
    },
    {
      "id": 78,
      "start": 1574.6200256347656,
      "end": 1580.0600280761719,
      "text": " creation and all of the stars and all of his power and his wisdom, then certainly he has"
    },
    {
      "id": 79,
      "start": 1580.0600280761719,
      "end": 1587.7400207519531,
      "text": " the ability to heal my broken heart and to heal your broken heart and to give you what"
    },
    {
      "id": 80,
      "start": 1587.7400207519531,
      "end": 1593.1800231933594,
      "text": " you need in the moment of what you're going through."
    },
    {
      "id": 81,
      "start": 1593.1800231933594,
      "end": 1597.5000305175781,
      "text": " But it's God that heals the broken heart."
    },
    {
      "id": 82,
      "start": 1597.5000305175781,
      "end": 1599.9000244140625,
      "text": " Sometimes we look for someone else to heal the broken heart."
    },
    {
      "id": 83,
      "start": 1599.9000244140625,
      "end": 1603.9800415039062,
      "text": " We think some other circumstance or some other thing is going to heal our broken heart, but"
    },
    {
      "id": 84,
      "start": 1603.9800415039062,
      "end": 1606.5400390625,
      "text": " it is God who makes the proclamation."
    },
    {
      "id": 85,
      "start": 1606.5400390625,
      "end": 1611.9400329589844,
      "text": " He makes this precious promise that it is He that healeth the broken heart."
    },
    {
      "id": 86,
      "start": 1611.9400329589844,
      "end": 1619.5400390625,
      "text": " Oh, this morning, I hope that you would take great comfort in this first promise."
    },
    {
      "id": 87,
      "start": 1619.5400390625,
      "end": 1620.5400390625,
      "text": " But he continues."
    },
    {
      "id": 88,
      "start": 1620.5400390625,
      "end": 1630.9400329589844,
      "text": " Notice again in verse number 3, the Bible says this, and bindeth up their wounds."
    },
    {
      "id": 89,
      "start": 1630.9400329589844,
      "end": 1632.1000366210938,
      "text": " He bindeth up their wounds."
    },
    {
      "id": 90,
      "start": 1632.1000366210938,
      "end": 1635.5000305175781,
      "text": " The word wounds means sorrow, pain, or hurt."
    },
    {
      "id": 91,
      "start": 1635.5000305175781,
      "end": 1642.1800231933594,
      "text": " The word bindeth literally carries with it the context of a, of bandaging something."
    },
    {
      "id": 92,
      "start": 1642.1800231933594,
      "end": 1646.3800354003906,
      "text": " And I want you to, in your mind this morning, get this picture where the Bible says that"
    },
    {
      "id": 93,
      "start": 1646.3800354003906,
      "end": 1652.02001953125,
      "text": " He, God, the Lord, the one who created the stars, the one who knows their number that"
    },
    {
      "id": 94,
      "start": 1652.02001953125,
      "end": 1657.3400268554688,
      "text": " calls them by their names, that He binds your wounds."
    },
    {
      "id": 95,
      "start": 1657.3400268554688,
      "end": 1662.7400207519531,
      "text": " Again, as I mentioned in the first promise, again here we find that He does not say that"
    },
    {
      "id": 96,
      "start": 1662.7400207519531,
      "end": 1665.9800415039062,
      "text": " your life will be free from wounds."
    },
    {
      "id": 97,
      "start": 1665.9800415039062,
      "end": 1674.4200134277344,
      "text": " Rather, He says that He bindeth up their wounds."
    },
    {
      "id": 98,
      "start": 1674.4200134277344,
      "end": 1677.2200317382812,
      "text": " I think about the little child."
    },
    {
      "id": 99,
      "start": 1677.2200317382812,
      "end": 1678.9400329589844,
      "text": " I think about our children."
    },
    {
      "id": 100,
      "start": 1678.9400329589844,
      "end": 1681.6200256347656,
      "text": " I think about when I was a child."
    },
    {
      "id": 101,
      "start": 1681.6200256347656,
      "end": 1684.3000183105469,
      "text": " I think about our children."
    },
    {
      "id": 102,
      "start": 1684.3000183105469,
      "end": 1690.2600402832031,
      "text": " You think about the times in which they would get hurt, learning to ride a bike."
    },
    {
      "id": 103,
      "start": 1690.2600402832031,
      "end": 1693.0600280761719,
      "text": " That's always a difficult time in life, isn't it?"
    },
    {
      "id": 104,
      "start": 1693.0600280761719,
      "end": 1696.3000183105469,
      "text": " Trying to get a child to learn how to ride a bike, and get to that point where you're"
    },
    {
      "id": 105,
      "start": 1696.3000183105469,
      "end": 1698.9400329589844,
      "text": " going to take those training wheels off, right?"
    },
    {
      "id": 106,
      "start": 1698.9400329589844,
      "end": 1699.9400329589844,
      "text": " And what's going to happen?"
    },
    {
      "id": 107,
      "start": 1699.9400329589844,
      "end": 1704.7000122070312,
      "text": " You better have a good supply of Band-Aids, right?"
    },
    {
      "id": 108,
      "start": 1704.7000122070312,
      "end": 1708.8200378417969,
      "text": " Have any of you, you remember your kids learn how to ride a bike, or maybe your kids are"
    },
    {
      "id": 109,
      "start": 1708.8200378417969,
      "end": 1712.9000244140625,
      "text": " in that stage of learning to ride a bike?"
    },
    {
      "id": 110,
      "start": 1712.9000244140625,
      "end": 1715.2200317382812,
      "text": " We have some in church that like Band-Aids a whole lot."
    },
    {
      "id": 111,
      "start": 1715.2200317382812,
      "end": 1718.9400024414062,
      "text": " I see them with Band-Aids on all the time, right?"
    },
    {
      "id": 112,
      "start": 1719.0599975585938,
      "end": 1722.9000244140625,
      "text": " There's something about riding the bike, and skinning up your knees, right?"
    },
    {
      "id": 113,
      "start": 1722.9000244140625,
      "end": 1725.4600219726562,
      "text": " And it happens, your elbows, and all sorts of things."
    },
    {
      "id": 114,
      "start": 1725.4600219726562,
      "end": 1728.7400512695312,
      "text": " See, back when I was a kid learning how to do it, they didn't have all these knee pads,"
    },
    {
      "id": 115,
      "start": 1728.7400512695312,
      "end": 1730.6600341796875,
      "text": " elbow pads, and all this helmet stuff."
    },
    {
      "id": 116,
      "start": 1730.6600341796875,
      "end": 1733.6600341796875,
      "text": " Man, you just had to rub some dirt on it and get over it, you know?"
    },
    {
      "id": 117,
      "start": 1733.6600341796875,
      "end": 1735.6600341796875,
      "text": " Like just whatever."
    },
    {
      "id": 118,
      "start": 1735.6600341796875,
      "end": 1737.2200317382812,
      "text": " And my dad, he just said amen."
    },
    {
      "id": 119,
      "start": 1737.2200317382812,
      "end": 1741.4600219726562,
      "text": " He was not the person I went to when I had a wound that had to be bound up, amen?"
    },
    {
      "id": 120,
      "start": 1741.4600219726562,
      "end": 1744.3800048828125,
      "text": " And he took my thunder already."
    },
    {
      "id": 121,
      "start": 1744.3800048828125,
      "end": 1752.300048828125,
      "text": " But the reality is that when our kids were going through those stages, they'd fall and"
    },
    {
      "id": 122,
      "start": 1752.300048828125,
      "end": 1756.5800170898438,
      "text": " they'd cut up their knee, or their hand, or their elbow."
    },
    {
      "id": 123,
      "start": 1756.5800170898438,
      "end": 1759.3800048828125,
      "text": " You know who they'd come running to?"
    },
    {
      "id": 124,
      "start": 1759.3800048828125,
      "end": 1763.8200073242188,
      "text": " Holly, mom."
    },
    {
      "id": 125,
      "start": 1763.8200073242188,
      "end": 1772.7000122070312,
      "text": " And they'd be crying, and it would be almost just beyond the ability to calm them down."
    },
    {
      "id": 126,
      "start": 1772.7000122070312,
      "end": 1779.9000244140625,
      "text": " And Holly would calmly take them into the bathroom, try to get them cleaned up, bandage"
    },
    {
      "id": 127,
      "start": 1779.9000244140625,
      "end": 1780.9000244140625,
      "text": " that wound."
    },
    {
      "id": 128,
      "start": 1780.9000244140625,
      "end": 1785.5800170898438,
      "text": " You know when all of a sudden it starts happening to that child?"
    },
    {
      "id": 129,
      "start": 1785.5800170898438,
      "end": 1787.8600463867188,
      "text": " They're calm."
    },
    {
      "id": 130,
      "start": 1787.8600463867188,
      "end": 1789.7400512695312,
      "text": " Why?"
    },
    {
      "id": 131,
      "start": 1789.7400512695312,
      "end": 1798.9000244140625,
      "text": " Because someone who loves them is binding up, bandaging their wounds."
    },
    {
      "id": 132,
      "start": 1798.9000244140625,
      "end": 1799.4200439453125,
      "text": " And maybe..."
    },
    {
      "id": 0,
      "start": 1799.4200439453125,
      "end": 1804.4200439453125,
      "text": " moms from time to time have other means of helping calm"
    },
    {
      "id": 1,
      "start": 1806.1800441741943,
      "end": 1808.0600442886353,
      "text": " and soothe their children."
    },
    {
      "id": 2,
      "start": 1808.0600442886353,
      "end": 1812.5000438690186,
      "text": " Let's go get a popsicle, a cookie, a something, right?"
    },
    {
      "id": 3,
      "start": 1812.5000438690186,
      "end": 1815.6600437164307,
      "text": " And man, it just seems to make everything better."
    },
    {
      "id": 4,
      "start": 1817.620044708252,
      "end": 1819.5800437927246,
      "text": " We understand that physically speaking,"
    },
    {
      "id": 5,
      "start": 1819.5800437927246,
      "end": 1824.140043258667,
      "text": " that we understand the idea of having a wound,"
    },
    {
      "id": 6,
      "start": 1824.140043258667,
      "end": 1828.0200443267822,
      "text": " having something that someone then bandages up"
    },
    {
      "id": 7,
      "start": 1828.0200443267822,
      "end": 1830.780044555664,
      "text": " and provides that comfort for us that we need"
    },
    {
      "id": 8,
      "start": 1830.780044555664,
      "end": 1834.0200424194336,
      "text": " and helps us to heal that thing up."
    },
    {
      "id": 9,
      "start": 1834.0200424194336,
      "end": 1836.4200439453125,
      "text": " But we look at the word of God and the Bible says,"
    },
    {
      "id": 10,
      "start": 1836.4200439453125,
      "end": 1838.780044555664,
      "text": " not only does God heal the broken in heart,"
    },
    {
      "id": 11,
      "start": 1838.780044555664,
      "end": 1842.3200454711914,
      "text": " but he says that he bindeth up their wounds."
    },
    {
      "id": 12,
      "start": 1842.3200454711914,
      "end": 1845.3800430297852,
      "text": " You say, pastor, I have some pains, I have some hurts,"
    },
    {
      "id": 13,
      "start": 1845.3800430297852,
      "end": 1848.220043182373,
      "text": " I have some sorrow, then rejoice in knowing"
    },
    {
      "id": 14,
      "start": 1848.220043182373,
      "end": 1852.2000427246094,
      "text": " that God binds them up."
    },
    {
      "id": 15,
      "start": 1852.2000427246094,
      "end": 1855.2400436401367,
      "text": " Oh, what a joy, what a blessing."
    },
    {
      "id": 16,
      "start": 1856.2400436401367,
      "end": 1860.2400436401367,
      "text": " Why didn't my children come to me?"
    },
    {
      "id": 17,
      "start": 1860.2400436401367,
      "end": 1862.4800453186035,
      "text": " Maybe I was not as compassionate."
    },
    {
      "id": 18,
      "start": 1864.9200439453125,
      "end": 1867.4800415039062,
      "text": " Why did I go to my mom and not to my dad?"
    },
    {
      "id": 19,
      "start": 1867.4800415039062,
      "end": 1870.1400451660156,
      "text": " Because he was not as compassionate."
    },
    {
      "id": 20,
      "start": 1874.0400466918945,
      "end": 1877.560043334961,
      "text": " You ever have a thought that you broke something?"
    },
    {
      "id": 21,
      "start": 1878.4800415039062,
      "end": 1879.6200408935547,
      "text": " You know what my dad would do?"
    },
    {
      "id": 22,
      "start": 1879.6200408935547,
      "end": 1881.6400451660156,
      "text": " Tim, stand up for just a minute."
    },
    {
      "id": 23,
      "start": 1881.6400451660156,
      "end": 1883.7200469970703,
      "text": " I'd tell him I thought I broke my arm, he'd say,"
    },
    {
      "id": 24,
      "start": 1883.7200469970703,
      "end": 1885.7600402832031,
      "text": " nah, it's good."
    },
    {
      "id": 25,
      "start": 1890.3200454711914,
      "end": 1891.8200454711914,
      "text": " That's how it works sometimes."
    },
    {
      "id": 26,
      "start": 1895.560043334961,
      "end": 1897.560043334961,
      "text": " But God is compassionate."
    },
    {
      "id": 27,
      "start": 1898.7200469970703,
      "end": 1901.9600448608398,
      "text": " God is full of grace and mercy."
    },
    {
      "id": 28,
      "start": 1901.9600448608398,
      "end": 1904.0800476074219,
      "text": " And he knows what your wounds are."
    },
    {
      "id": 29,
      "start": 1904.0800476074219,
      "end": 1906.440040588379,
      "text": " He knows what your hurts are."
    },
    {
      "id": 30,
      "start": 1906.440040588379,
      "end": 1908.8800430297852,
      "text": " He knows that if you're carrying that load,"
    },
    {
      "id": 31,
      "start": 1908.8800430297852,
      "end": 1913.4800415039062,
      "text": " he knows and he tells us, he gives us this precious promise"
    },
    {
      "id": 32,
      "start": 1914.2400436401367,
      "end": 1917.8800430297852,
      "text": " that he bindeth up their wounds."
    },
    {
      "id": 33,
      "start": 1917.8800430297852,
      "end": 1920.0800476074219,
      "text": " I'm so thankful that I don't have to just live life"
    },
    {
      "id": 34,
      "start": 1920.0800476074219,
      "end": 1921.2000427246094,
      "text": " with my wounds."
    },
    {
      "id": 35,
      "start": 1924.0800476074219,
      "end": 1928.7600402832031,
      "text": " Again, he didn't say that we'd never have wounds."
    },
    {
      "id": 36,
      "start": 1928.7600402832031,
      "end": 1931.4000396728516,
      "text": " He says that he would bind them up."
    },
    {
      "id": 37,
      "start": 1931.4000396728516,
      "end": 1933.4800415039062,
      "text": " They don't have to stay as open wounds."
    },
    {
      "id": 38,
      "start": 1934.6800384521484,
      "end": 1937.9600372314453,
      "text": " They don't have to become infected wounds."
    },
    {
      "id": 39,
      "start": 1939.560043334961,
      "end": 1943.2000427246094,
      "text": " You know what happens when they stay open"
    },
    {
      "id": 40,
      "start": 1943.9200439453125,
      "end": 1945.1200408935547,
      "text": " and they become infected?"
    },
    {
      "id": 41,
      "start": 1945.1200408935547,
      "end": 1948.4400482177734,
      "text": " Starts to impact other areas of your life."
    },
    {
      "id": 42,
      "start": 1948.4400482177734,
      "end": 1950.4400482177734,
      "text": " Spiritually, we're speaking now."
    },
    {
      "id": 43,
      "start": 1950.4400482177734,
      "end": 1952.0800476074219,
      "text": " We see it physically."
    },
    {
      "id": 44,
      "start": 1952.0800476074219,
      "end": 1953.1600494384766,
      "text": " You gotta deal with the wounds."
    },
    {
      "id": 45,
      "start": 1953.1600494384766,
      "end": 1954.7200469970703,
      "text": " You gotta deal with them."
    },
    {
      "id": 46,
      "start": 1954.7200469970703,
      "end": 1955.560043334961,
      "text": " You gotta medicate them."
    },
    {
      "id": 47,
      "start": 1955.560043334961,
      "end": 1958.7200469970703,
      "text": " You gotta make sure infection doesn't set in, right?"
    },
    {
      "id": 48,
      "start": 1958.7200469970703,
      "end": 1960.4000396728516,
      "text": " There are times in which people have wounds"
    },
    {
      "id": 49,
      "start": 1960.4000396728516,
      "end": 1962.6400451660156,
      "text": " and doctors will put marks on their arms"
    },
    {
      "id": 50,
      "start": 1962.6400451660156,
      "end": 1965.7600402832031,
      "text": " to see where the infection has spread to"
    },
    {
      "id": 51,
      "start": 1965.7600402832031,
      "end": 1966.6800384521484,
      "text": " and they need to come back."
    },
    {
      "id": 52,
      "start": 1966.6800384521484,
      "end": 1970.2400512695312,
      "text": " And if it passes this line, that stuff happens."
    },
    {
      "id": 53,
      "start": 1970.2400512695312,
      "end": 1972.1200408935547,
      "text": " But can I tell you what happens in our hearts"
    },
    {
      "id": 54,
      "start": 1972.1200408935547,
      "end": 1973.7600402832031,
      "text": " and our lives when we have wounds"
    },
    {
      "id": 55,
      "start": 1973.7600402832031,
      "end": 1977.7600402832031,
      "text": " and we don't go to the one that binds up the wounds?"
    },
    {
      "id": 56,
      "start": 1977.7600402832031,
      "end": 1978.6800384521484,
      "text": " We get bitter."
    },
    {
      "id": 57,
      "start": 1980.7600402832031,
      "end": 1981.6800384521484,
      "text": " We get bitter."
    },
    {
      "id": 58,
      "start": 1983.2400512695312,
      "end": 1985.0800476074219,
      "text": " And bitterness destroys."
    },
    {
      "id": 59,
      "start": 1986.3800506591797,
      "end": 1990.6000366210938,
      "text": " When we get bitter, no longer are we able to be in a place"
    },
    {
      "id": 60,
      "start": 1990.6000366210938,
      "end": 1994.800048828125,
      "text": " where we're used of God for his honor and for his glory."
    },
    {
      "id": 61,
      "start": 1994.800048828125,
      "end": 1997.3400421142578,
      "text": " We get so focused on ourselves and we're so angry"
    },
    {
      "id": 62,
      "start": 1997.3400421142578,
      "end": 2000.1200408935547,
      "text": " at whoever it was that hurt us and whatever took place"
    },
    {
      "id": 63,
      "start": 2000.1200408935547,
      "end": 2001.4800415039062,
      "text": " and whatever those wounds are."
    },
    {
      "id": 64,
      "start": 2001.4800415039062,
      "end": 2004.1200408935547,
      "text": " And we're just bitter."
    },
    {
      "id": 65,
      "start": 2004.1200408935547,
      "end": 2006.280044555664,
      "text": " Someone said this, it's not original with me,"
    },
    {
      "id": 66,
      "start": 2006.280044555664,
      "end": 2009.4000396728516,
      "text": " but bitterness destroys the vessel in which it's stored"
    },
    {
      "id": 67,
      "start": 2009.4000396728516,
      "end": 2011.9400482177734,
      "text": " more than the vessel in which it's poured."
    },
    {
      "id": 68,
      "start": 2013.060043334961,
      "end": 2016.2400512695312,
      "text": " The reality this morning is that when wounds"
    },
    {
      "id": 69,
      "start": 2016.2400512695312,
      "end": 2018.5200500488281,
      "text": " are not addressed and taken care of,"
    },
    {
      "id": 70,
      "start": 2018.5200500488281,
      "end": 2022.7400512695312,
      "text": " it can cause this root of bitterness."
    },
    {
      "id": 71,
      "start": 2022.7400512695312,
      "end": 2024.4800415039062,
      "text": " Aren't you thankful this morning"
    },
    {
      "id": 72,
      "start": 2025.6000366210938,
      "end": 2029.560043334961,
      "text": " that though we experience wounds in our lives,"
    },
    {
      "id": 73,
      "start": 2029.560043334961,
      "end": 2033.280044555664,
      "text": " that they don't have to go as open wounds."
    },
    {
      "id": 74,
      "start": 2033.280044555664,
      "end": 2035.5200500488281,
      "text": " They don't have to become infected wounds."
    },
    {
      "id": 75,
      "start": 2035.5200500488281,
      "end": 2036.3600463867188,
      "text": " Why?"
    },
    {
      "id": 76,
      "start": 2036.3600463867188,
      "end": 2038.7600402832031,
      "text": " Because our God, the Bible says,"
    },
    {
      "id": 77,
      "start": 2038.7600402832031,
      "end": 2043.6600494384766,
      "text": " that he bindeth up their wounds."
    },
    {
      "id": 78,
      "start": 2043.6600494384766,
      "end": 2047.7600402832031,
      "text": " You say, oh, you don't know how deeply hurt I am."
    },
    {
      "id": 79,
      "start": 2047.7600402832031,
      "end": 2051.7200469970703,
      "text": " Remember, he spoke and it was so."
    },
    {
      "id": 80,
      "start": 2051.7200469970703,
      "end": 2054.080047607422,
      "text": " The Bible says he made the stars also."
    },
    {
      "id": 81,
      "start": 2054.080047607422,
      "end": 2055.2400512695312,
      "text": " He knows their number."
    },
    {
      "id": 82,
      "start": 2055.2400512695312,
      "end": 2056.56005859375,
      "text": " He calls them by name."
    },
    {
      "id": 83,
      "start": 2056.56005859375,
      "end": 2057.8800354003906,
      "text": " You're gonna tell me that you have a wound"
    },
    {
      "id": 84,
      "start": 2057.8800354003906,
      "end": 2059.000030517578,
      "text": " that he can't heal?"
    },
    {
      "id": 85,
      "start": 2060.520050048828,
      "end": 2062.1600341796875,
      "text": " Come on."
    },
    {
      "id": 86,
      "start": 2062.1600341796875,
      "end": 2066.280029296875,
      "text": " He bindeth up their wounds."
    },
    {
      "id": 87,
      "start": 2068.320037841797,
      "end": 2070.8800354003906,
      "text": " Notice verse number six,"
    },
    {
      "id": 88,
      "start": 2070.8800354003906,
      "end": 2073.8600463867188,
      "text": " the third promise that is given to us."
    },
    {
      "id": 89,
      "start": 2073.8600463867188,
      "end": 2076.2400512695312,
      "text": " The powerful proclamation is verses four and five,"
    },
    {
      "id": 90,
      "start": 2076.2400512695312,
      "end": 2078.4800415039062,
      "text": " but these precious promises by which"
    },
    {
      "id": 91,
      "start": 2078.4800415039062,
      "end": 2082.2400512695312,
      "text": " we receive great comfort this morning,"
    },
    {
      "id": 92,
      "start": 2082.2400512695312,
      "end": 2085.2400512695312,
      "text": " I hope that we're encouraged this morning."
    },
    {
      "id": 93,
      "start": 2086.4400329589844,
      "end": 2088.000030517578,
      "text": " He healeth the broken in heart."
    },
    {
      "id": 94,
      "start": 2088.000030517578,
      "end": 2089.280029296875,
      "text": " He bindeth up their wounds."
    },
    {
      "id": 95,
      "start": 2090.000030517578,
      "end": 2090.840057373047,
      "text": " Notice in verse number six,"
    },
    {
      "id": 96,
      "start": 2090.840057373047,
      "end": 2095.760040283203,
      "text": " the Lord lifteth up the meek."
    },
    {
      "id": 97,
      "start": 2095.760040283203,
      "end": 2098.6600341796875,
      "text": " The word lifteth up literally means to restore."
    },
    {
      "id": 98,
      "start": 2100.6000366210938,
      "end": 2103.520050048828,
      "text": " The word meek is used in a variety of contexts"
    },
    {
      "id": 99,
      "start": 2103.520050048828,
      "end": 2104.760040283203,
      "text": " throughout the Bible."
    },
    {
      "id": 100,
      "start": 2104.760040283203,
      "end": 2107.520050048828,
      "text": " Some have looked at meek and looked at it"
    },
    {
      "id": 101,
      "start": 2107.520050048828,
      "end": 2109.6000366210938,
      "text": " as being weakness, and not always"
    },
    {
      "id": 102,
      "start": 2109.6000366210938,
      "end": 2111.6800537109375,
      "text": " is it looked at in that frame."
    },
    {
      "id": 103,
      "start": 2111.6800537109375,
      "end": 2115.000030517578,
      "text": " Power under control is a great way to define meekness."
    },
    {
      "id": 104,
      "start": 2115.000030517578,
      "end": 2116.6400451660156,
      "text": " Meekness in the New Testament,"
    },
    {
      "id": 105,
      "start": 2116.6400451660156,
      "end": 2117.6800537109375,
      "text": " when you look at the fruit of the spirit,"
    },
    {
      "id": 106,
      "start": 2117.6800537109375,
      "end": 2120.7200317382812,
      "text": " it's akin to gentleness."
    },
    {
      "id": 107,
      "start": 2120.7200317382812,
      "end": 2122.6400451660156,
      "text": " We find here that in the context"
    },
    {
      "id": 108,
      "start": 2122.6400451660156,
      "end": 2124.5400390625,
      "text": " that's talking about this one that's meek,"
    },
    {
      "id": 109,
      "start": 2124.5400390625,
      "end": 2127.780029296875,
      "text": " that's cast down, and all of that that's taking place,"
    },
    {
      "id": 110,
      "start": 2127.780029296875,
      "end": 2131.2000427246094,
      "text": " and all of these things that have really taken place"
    },
    {
      "id": 111,
      "start": 2131.2000427246094,
      "end": 2132.7200317382812,
      "text": " in the life of this individual,"
    },
    {
      "id": 112,
      "start": 2132.7200317382812,
      "end": 2134.4800415039062,
      "text": " but the Bible says that the Lord,"
    },
    {
      "id": 113,
      "start": 2134.4800415039062,
      "end": 2137.520050048828,
      "text": " the same God who spoke it all into existence,"
    },
    {
      "id": 114,
      "start": 2137.520050048828,
      "end": 2139.000030517578,
      "text": " the one that made the stars also,"
    },
    {
      "id": 115,
      "start": 2139.000030517578,
      "end": 2141.280029296875,
      "text": " that knows their number, that calls them by their names,"
    },
    {
      "id": 116,
      "start": 2141.280029296875,
      "end": 2146.280029296875,
      "text": " that he lifteth up the meek that he restores."
    },
    {
      "id": 117,
      "start": 2148.6800537109375,
      "end": 2153.4800415039062,
      "text": " This morning, as we look at these precious promises,"
    },
    {
      "id": 118,
      "start": 2153.4800415039062,
      "end": 2157.320037841797,
      "text": " and we consider them for just a few moments this morning,"
    },
    {
      "id": 119,
      "start": 2157.320037841797,
      "end": 2160.9200439453125,
      "text": " I hope that our hearts would be encouraged."
    },
    {
      "id": 120,
      "start": 2160.9200439453125,
      "end": 2163.580047607422,
      "text": " I hope that we would receive great comfort"
    },
    {
      "id": 121,
      "start": 2163.580047607422,
      "end": 2166.9600524902344,
      "text": " from the God who is the God of all comfort."
    },
    {
      "id": 122,
      "start": 2166.9600524902344,
      "end": 2170.320037841797,
      "text": " That we understand that though we live in this world,"
    },
    {
      "id": 123,
      "start": 2170.320037841797,
      "end": 2173.1800537109375,
      "text": " that we will endure hurt, and we will have times"
    },
    {
      "id": 124,
      "start": 2173.1800537109375,
      "end": 2175.840057373047,
      "text": " of brokenheartedness, and wounds,"
    },
    {
      "id": 125,
      "start": 2175.840057373047,
      "end": 2179.0400390625,
      "text": " and times that we're overwhelmed,"
    },
    {
      "id": 126,
      "start": 2179.0400390625,
      "end": 2184.0400390625,
      "text": " that God heals, and he binds, and he lifts, he restores."
    },
    {
      "id": 127,
      "start": 2185.5400390625,
      "end": 2189.4400329589844,
      "text": " I mentioned that this, our God,"
    },
    {
      "id": 128,
      "start": 2190.580047607422,
      "end": 2192.8800354003906,
      "text": " who knows the number of the stars,"
    },
    {
      "id": 129,
      "start": 2192.8800354003906,
      "end": 2195.9600524902344,
      "text": " who calls them all by their names,"
    },
    {
      "id": 130,
      "start": 2195.9600524902344,
      "end": 2198.3600463867188,
      "text": " that he's interested in us as individuals."
    },
    {
      "id": 131,
      "start": 2200.9400329589844,
      "end": 2205.56005859375,
      "text": " His greatest concern for us is our salvation."
    },
    {
      "id": 132,
      "start": 2206.840057373047,
      "end": 2208.840057373047,
      "text": " It's his greatest concern for us."
    },
    {
      "id": 133,
      "start": 2211.1200561523438,
      "end": 2215.080047607422,
      "text": " This morning, I'm thankful for the promises"
    },
    {
      "id": 134,
      "start": 2215.080047607422,
      "end": 2217.820037841797,
      "text": " that we find in verse three and verse number six."
    },
    {
      "id": 135,
      "start": 2219.2000427246094,
      "end": 2223.6400451660156,
      "text": " But you know the greatest work"
    },
    {
      "id": 136,
      "start": 2223.6400451660156,
      "end": 2227.2400512695312,
      "text": " that God's ever done in my life is saving my soul."
    },
    {
      "id": 137,
      "start": 2228.840057373047,
      "end": 2230.8800354003906,
      "text": " And I believe this morning that if you're here,"
    },
    {
      "id": 138,
      "start": 2230.8800354003906,
      "end": 2233.320037841797,
      "text": " and you've trusted Christ as your savior,"
    },
    {
      "id": 139,
      "start": 2233.320037841797,
      "end": 2235.6000366210938,
      "text": " that you too would testify that the greatest work"
    },
    {
      "id": 140,
      "start": 2236.3600463867188,
      "end": 2238.800048828125,
      "text": " he's ever done in your life is saving your soul."
    },
    {
      "id": 141,
      "start": 2240.760040283203,
      "end": 2243.7200317382812,
      "text": " See, he's not willing that any should perish,"
    },
    {
      "id": 142,
      "start": 2243.7200317382812,
      "end": 2245.780029296875,
      "text": " but that all should come to repentance."
    },
    {
      "id": 143,
      "start": 2246.9200439453125,
      "end": 2250.520050048828,
      "text": " He's given us the plan of redemption in his word"
    },
    {
      "id": 144,
      "start": 2250.520050048828,
      "end": 2252.320037841797,
      "text": " that mankind can only be saved"
    },
    {
      "id": 145,
      "start": 2252.320037841797,
      "end": 2253.6400451660156,
      "text": " through the Lord Jesus Christ."
    },
    {
      "id": 146,
      "start": 2253.6400451660156,
      "end": 2255.4400329589844,
      "text": " There's no other name under heaven given among men"
    },
    {
      "id": 147,
      "start": 2255.4400329589844,
      "end": 2257.580047607422,
      "text": " whereby we must be saved."
    },
    {
      "id": 148,
      "start": 2257.580047607422,
      "end": 2260.080047607422,
      "text": " The precious, wonderful name of Jesus."
    },
    {
      "id": 149,
      "start": 2261.280029296875,
      "end": 2263.8800354003906,
      "text": " It's not by works of righteousness which we have done."
    },
    {
      "id": 150,
      "start": 2263.8800354003906,
      "end": 2266.9200439453125,
      "text": " It's not by some religion that we've held to."
    },
    {
      "id": 151,
      "start": 2266.9200439453125,
      "end": 2269.0400390625,
      "text": " It's all through the work of Jesus Christ"
    },
    {
      "id": 152,
      "start": 2269.0400390625,
      "end": 2270.820037841797,
      "text": " on the cross of Calvary."
    },
    {
      "id": 153,
      "start": 2270.820037841797,
      "end": 2274.06005859375,
      "text": " His death, his burial, and his glorious resurrection."
    },
    {
      "id": 154,
      "start": 2274.06005859375,
      "end": 2276.280029296875,
      "text": " It's Jesus alone."
    },
    {
      "id": 155,
      "start": 2277.6200561523438,
      "end": 2280.000030517578,
      "text": " It's not grace plus works."
    },
    {
      "id": 156,
      "start": 2280.000030517578,
      "end": 2281.3600463867188,
      "text": " It's not grace and anything else."
    },
    {
      "id": 157,
      "start": 2281.3600463867188,
      "end": 2283.9600524902344,
      "text": " It's just Jesus."
    },
    {
      "id": 158,
      "start": 2283.9600524902344,
      "end": 2286.9200439453125,
      "text": " And this morning, as the people of God,"
    },
    {
      "id": 159,
      "start": 2286.9200439453125,
      "end": 2288.500030517578,
      "text": " if you're here this morning and you've been saved"
    },
    {
      "id": 160,
      "start": 2288.500030517578,
      "end": 2291.080047607422,
      "text": " by the blood of Christ, oh, you should rejoice."
    },
    {
      "id": 161,
      "start": 2292.080047607422,
      "end": 2294.4000549316406,
      "text": " But though we've been saved by the,"
    },
    {
      "id": 162,
      "start": 2294.4000549316406,
      "end": 2296.4800415039062,
      "text": " and if you've not been saved by the blood of Christ,"
    },
    {
      "id": 163,
      "start": 2296.4800415039062,
      "end": 2297.760040283203,
      "text": " if you've not, if you don't know,"
    },
    {
      "id": 164,
      "start": 2297.760040283203,
      "end": 2299.6800537109375,
      "text": " if you don't have that assurance,"
    },
    {
      "id": 165,
      "start": 2299.6800537109375,
      "end": 2302.280029296875,
      "text": " you're trying to get to heaven on your own some way,"
    },
    {
      "id": 166,
      "start": 2303.320037841797,
      "end": 2306.1800537109375,
      "text": " through some church or through some other work,"
    },
    {
      "id": 167,
      "start": 2306.1800537109375,
      "end": 2308.4000549316406,
      "text": " oh, come to Christ."
    },
    {
      "id": 168,
      "start": 2308.4000549316406,
      "end": 2309.2400512695312,
      "text": " He died for you."
    },
    {
      "id": 169,
      "start": 2309.2400512695312,
      "end": 2310.06005859375,
      "text": " He loves you."
    },
    {
      "id": 170,
      "start": 2310.06005859375,
      "end": 2312.280029296875,
      "text": " He knows you individually."
    },
    {
      "id": 171,
      "start": 2313.7600708007812,
      "end": 2314.9600219726562,
      "text": " And he died for you."
    },
    {
      "id": 172,
      "start": 2316.7200317382812,
      "end": 2319.280029296875,
      "text": " But for those of us that know Christ as our Savior,"
    },
    {
      "id": 173,
      "start": 2320.280029296875,
      "end": 2323.1200561523438,
      "text": " oh, those of us that know that he is the creator,"
    },
    {
      "id": 174,
      "start": 2324.9200439453125,
      "end": 2329.2400512695312,
      "text": " the truth that we find this powerful proclamation"
    },
    {
      "id": 175,
      "start": 2329.2400512695312,
      "end": 2331.4000244140625,
      "text": " in verses four and five, yes,"
    },
    {
      "id": 176,
      "start": 2331.4000244140625,
      "end": 2334.56005859375,
      "text": " should cause us to stand in awe of who he is."
    },
    {
      "id": 177,
      "start": 2335.4800415039062,
      "end": 2338.2000732421875,
      "text": " And we should have the same response as the psalmist has,"
    },
    {
      "id": 178,
      "start": 2338.2000732421875,
      "end": 2341.0400390625,
      "text": " great is the Lord and of great power."
    },
    {
      "id": 179,
      "start": 2341.0400390625,
      "end": 2343.4400634765625,
      "text": " And his understanding is infinite."
    },
    {
      "id": 180,
      "start": 2343.4400634765625,
      "end": 2345.8800659179688,
      "text": " But understand this morning"
    },
    {
      "id": 181,
      "start": 2345.8800659179688,
      "end": 2347.8400268554688,
      "text": " that this powerful proclamation"
    },
    {
      "id": 182,
      "start": 2347.8800659179688,
      "end": 2350.280029296875,
      "text": " in verses four and five of Psalm 147"
    },
    {
      "id": 183,
      "start": 2350.280029296875,
      "end": 2352.800048828125,
      "text": " is sandwiched in between"
    },
    {
      "id": 184,
      "start": 2352.800048828125,
      "end": 2355.7400512695312,
      "text": " some precious promises for God's people."
    },
    {
      "id": 185,
      "start": 2357.280029296875,
      "end": 2360.280029296875,
      "text": " And those precious promises"
    },
    {
      "id": 186,
      "start": 2360.280029296875,
      "end": 2363.56005859375,
      "text": " that he healeth the broken in heart,"
    },
    {
      "id": 187,
      "start": 2363.56005859375,
      "end": 2366.06005859375,
      "text": " that he bindeth up their wounds,"
    },
    {
      "id": 188,
      "start": 2366.06005859375,
      "end": 2369.1600341796875,
      "text": " that he lifteth up the meek,"
    },
    {
      "id": 189,
      "start": 2370.6800537109375,
      "end": 2375.6800537109375,
      "text": " that the same God who has promised to do that for you"
    },
    {
      "id": 190,
      "start": 2375.6800537109375,
      "end": 2378.6400146484375,
      "text": " made the stars also."
    },
    {
      "id": 191,
      "start": 2379.52001953125,
      "end": 2381.280029296875,
      "text": " He calls them all by their names."
    },
    {
      "id": 192,
      "start": 2381.280029296875,
      "end": 2382.4400634765625,
      "text": " He knows their number."
    },
    {
      "id": 193,
      "start": 2383.52001953125,
      "end": 2384.6400146484375,
      "text": " See, it's kind of like,"
    },
    {
      "id": 194,
      "start": 2384.6400146484375,
      "end": 2386.6000366210938,
      "text": " and the reason that I went to Genesis 15,"
    },
    {
      "id": 195,
      "start": 2386.6000366210938,
      "end": 2388.1400146484375,
      "text": " it's kind of like Abram."
    },
    {
      "id": 196,
      "start": 2390.4400634765625,
      "end": 2393.320068359375,
      "text": " You ever have your own logic and your own reason?"
    },
    {
      "id": 197,
      "start": 2393.320068359375,
      "end": 2394.4000244140625,
      "text": " Abram did."
    },
    {
      "id": 198,
      "start": 2394.4000244140625,
      "end": 2396.2000732421875,
      "text": " Abram said, God, I'm having a child."
    },
    {
      "id": 199,
      "start": 2397.4400634765625,
      "end": 2398.9600219726562,
      "text": " You promised me a seed."
    },
    {
      "id": 0,
      "start": 2398.9600219726562,
      "end": 2403.720022201538,
      "text": " God, can this Eliezer, maybe he'd be the heir?"
    },
    {
      "id": 1,
      "start": 2403.720022201538,
      "end": 2409.840022087097,
      "text": " God says, no, no, Abram, that's not my plan."
    },
    {
      "id": 2,
      "start": 2409.840022087097,
      "end": 2411.600022315979,
      "text": " God says, listen, I'm going to illustrate."
    },
    {
      "id": 3,
      "start": 2411.600022315979,
      "end": 2415.9400215148926,
      "text": " Come on out here, look up toward the heaven, see all those stars, can you tell the number"
    },
    {
      "id": 4,
      "start": 2415.9400215148926,
      "end": 2416.9400215148926,
      "text": " of them?"
    },
    {
      "id": 5,
      "start": 2416.9400215148926,
      "end": 2418.88002204895,
      "text": " Of course not."
    },
    {
      "id": 6,
      "start": 2418.88002204895,
      "end": 2421.800022125244,
      "text": " He says, so shall thy seed be."
    },
    {
      "id": 7,
      "start": 2421.800022125244,
      "end": 2428.1200218200684,
      "text": " This morning, God says to you and He says to me, He made the stars also."
    },
    {
      "id": 8,
      "start": 2428.1200218200684,
      "end": 2429.840021133423,
      "text": " He knows their number."
    },
    {
      "id": 9,
      "start": 2429.840021133423,
      "end": 2437.1600227355957,
      "text": " He calls them all by their names, but He says, I know that my people, they have broken hearts."
    },
    {
      "id": 10,
      "start": 2437.1600227355957,
      "end": 2440.320022583008,
      "text": " I know that my people have wounds."
    },
    {
      "id": 11,
      "start": 2440.320022583008,
      "end": 2447.1200218200684,
      "text": " I know that they face difficulties and hardships, but I'm the God who heals the broken heart."
    },
    {
      "id": 12,
      "start": 2447.1200218200684,
      "end": 2448.6000213623047,
      "text": " That's what God says."
    },
    {
      "id": 13,
      "start": 2448.6000213623047,
      "end": 2454.4000205993652,
      "text": " I'm the God who bindeth up their wounds."
    },
    {
      "id": 14,
      "start": 2454.4000205993652,
      "end": 2458.080020904541,
      "text": " Can you see God's mercy and His compassion?"
    },
    {
      "id": 15,
      "start": 2458.080020904541,
      "end": 2466.840019226074,
      "text": " Like the mother and the child, binding up your wounds, literally to bandage."
    },
    {
      "id": 16,
      "start": 2466.840019226074,
      "end": 2470.640022277832,
      "text": " He says, I lift up, I restore the meek."
    },
    {
      "id": 17,
      "start": 2470.640022277832,
      "end": 2480.9600219726562,
      "text": " Maybe this morning, you say to the Lord, Lord, You know my heart and You know what I'm going"
    },
    {
      "id": 18,
      "start": 2480.9600219726562,
      "end": 2481.9600219726562,
      "text": " through."
    },
    {
      "id": 19,
      "start": 2481.9600219726562,
      "end": 2487.44002532959,
      "text": " God, I know who You are, I know that You've created all these things and God, I'm going"
    },
    {
      "id": 20,
      "start": 2487.800018310547,
      "end": 2490.200019836426,
      "text": " to claim these promises."
    },
    {
      "id": 21,
      "start": 2490.200019836426,
      "end": 2492.320022583008,
      "text": " Maybe you have a wound."
    },
    {
      "id": 22,
      "start": 2492.320022583008,
      "end": 2498.1600189208984,
      "text": " Maybe you've got a wound that's been neglected, it's not been tended to."
    },
    {
      "id": 23,
      "start": 2498.1600189208984,
      "end": 2503.7200241088867,
      "text": " You've allowed it to just kind of be open and fester and become infected, if I could"
    },
    {
      "id": 24,
      "start": 2503.7200241088867,
      "end": 2508.0000228881836,
      "text": " use that terminology this morning."
    },
    {
      "id": 25,
      "start": 2508.0000228881836,
      "end": 2517.2800216674805,
      "text": " Maybe you need to let God bind up, bandage that wound because it's just destroying you"
    },
    {
      "id": 26,
      "start": 2518.1200256347656,
      "end": 2522.840019226074,
      "text": " Maybe this morning, say, Lord, I need to be restored."
    },
    {
      "id": 27,
      "start": 2522.840019226074,
      "end": 2525.52001953125,
      "text": " He lifteth up the meek."
    },
    {
      "id": 28,
      "start": 2525.52001953125,
      "end": 2532.4000244140625,
      "text": " I'm not sure what it is this morning, but I know that the Creator God, who knows the"
    },
    {
      "id": 29,
      "start": 2532.4000244140625,
      "end": 2539.9200286865234,
      "text": " number and the names of the stars, He knows you as an individual and He loves you and"
    },
    {
      "id": 30,
      "start": 2539.9200286865234,
      "end": 2546.8400268554688,
      "text": " He knows what you're going through and He says, I can take care of that."
    },
    {
      "id": 31,
      "start": 2546.8400268554688,
      "end": 2550.4000244140625,
      "text": " I can handle that, but we've got to let Him."
    },
    {
      "id": 32,
      "start": 2550.4000244140625,
      "end": 2551.4000244140625,
      "text": " We've got to come to Him."
    },
    {
      "id": 33,
      "start": 2551.4000244140625,
      "end": 2556.9600219726562,
      "text": " That's why the psalmist says, when my heart is overwhelmed, lead me to the rock that is"
    },
    {
      "id": 34,
      "start": 2556.9600219726562,
      "end": 2557.9600219726562,
      "text": " higher than I."
    },
    {
      "id": 35,
      "start": 2557.9600219726562,
      "end": 2564.4000244140625,
      "text": " Oh, that I would not just try to figure it out myself, try to resolve the matter."
    },
    {
      "id": 36,
      "start": 2564.4000244140625,
      "end": 2571.560028076172,
      "text": " No, no, God, You're the one that heals and binds and lifts."
    },
    {
      "id": 37,
      "start": 2571.560028076172,
      "end": 2573.6400146484375,
      "text": " Let Him have His way."
    },
    {
      "id": 38,
      "start": 2573.6400146484375,
      "end": 2578.800018310547,
      "text": " Let Him do what only He can do."
    },
    {
      "id": 39,
      "start": 2578.800018310547,
      "end": 2580.000015258789,
      "text": " Aren't they some precious promises?"
    },
    {
      "id": 40,
      "start": 2580.000015258789,
      "end": 2586.3600158691406,
      "text": " I mean, it's a powerful proclamation of what God has done with the stars, knowing their"
    },
    {
      "id": 41,
      "start": 2586.3600158691406,
      "end": 2592.760025024414,
      "text": " number and their name, but what's more precious to me than He cares about me, He cares about"
    },
    {
      "id": 42,
      "start": 2592.760025024414,
      "end": 2593.760025024414,
      "text": " you."
    },
    {
      "id": 43,
      "start": 2593.760025024414,
      "end": 2597.8400268554688,
      "text": " He heals, He binds, and He lifts."
    },
    {
      "id": 44,
      "start": 2597.8400268554688,
      "end": 2598.8400268554688,
      "text": " Let's pray."
    },
    {
      "id": 45,
      "start": 2598.8400268554688,
      "end": 2604.320022583008,
      "text": " Lord, we love You this morning and we thank You for loving us."
    },
    {
      "id": 46,
      "start": 2604.320022583008,
      "end": 2619.0800170898438,
      "text": " Lord, I don't know, but I take great comfort in knowing that You know every circumstance"
    },
    {
      "id": 47,
      "start": 2619.0800170898438,
      "end": 2627.720016479492,
      "text": " and situation that every person, under the sound of my voice, is dealing with today."
    },
    {
      "id": 48,
      "start": 2627.720016479492,
      "end": 2632.320022583008,
      "text": " God, You did not promise that we'd have no broken hearts."
    },
    {
      "id": 49,
      "start": 2632.320022583008,
      "end": 2637.4400177001953,
      "text": " You did not promise that we'd have no wounds, but You promised that You heal and that You"
    },
    {
      "id": 50,
      "start": 2637.4400177001953,
      "end": 2638.4400177001953,
      "text": " bind."
    },
    {
      "id": 51,
      "start": 2638.4400177001953,
      "end": 2641.4400177001953,
      "text": " Oh, I'm so thankful."
    },
    {
      "id": 52,
      "start": 2641.4400177001953,
      "end": 2646.8400268554688,
      "text": " I praise You and I rejoice in You."
    },
    {
      "id": 53,
      "start": 2646.8400268554688,
      "end": 2650.3600158691406,
      "text": " Thank You for the testimony of the psalmist."
    },
    {
      "id": 54,
      "start": 2650.3600158691406,
      "end": 2655.480010986328,
      "text": " I thank You for the work You've done in my life over the years."
    },
    {
      "id": 55,
      "start": 2655.480010986328,
      "end": 2664.8200073242188,
      "text": " God, I pray this morning, in the time of invitation, as we reflect upon that which we've heard"
    },
    {
      "id": 56,
      "start": 2664.8200073242188,
      "end": 2670.4400329589844,
      "text": " and we respond to that which we've received from Your Word, as we allow the Holy Spirit"
    },
    {
      "id": 57,
      "start": 2670.4400329589844,
      "end": 2676.02001953125,
      "text": " of God to have His will and way in our lives, I pray this morning, God, that we'd respond"
    },
    {
      "id": 58,
      "start": 2676.02001953125,
      "end": 2680.9000244140625,
      "text": " in faith, in obedience, in brokenness."
    },
    {
      "id": 59,
      "start": 2680.9000244140625,
      "end": 2687.300018310547,
      "text": " God, I don't know the needs, but I'm thankful that You do."
    },
    {
      "id": 60,
      "start": 2687.300018310547,
      "end": 2696.1800231933594,
      "text": " And God, I pray that You would work in such a way that You alone would be glorified."
    },
    {
      "id": 61,
      "start": 2696.1800231933594,
      "end": 2700.8200073242188,
      "text": " We pray that in these few moments of invitation, there's one that's not sure of heaven."
    },
    {
      "id": 62,
      "start": 2700.8200073242188,
      "end": 2705.4200134277344,
      "text": " Oh, God, I pray that today would be the day of their salvation."
    },
    {
      "id": 63,
      "start": 2705.4200134277344,
      "end": 2710.1800231933594,
      "text": " They would not leave this place without knowing for sure, 100% certainty that heaven is their"
    },
    {
      "id": 64,
      "start": 2710.1800231933594,
      "end": 2711.780029296875,
      "text": " home."
    },
    {
      "id": 65,
      "start": 2711.780029296875,
      "end": 2718.3800354003906,
      "text": " I pray that no one would leave this place with a broken heart or a wound, but God, we'd"
    },
    {
      "id": 66,
      "start": 2718.3800354003906,
      "end": 2724.4600219726562,
      "text": " allow You to heal and bind, lift us up."
    },
    {
      "id": 67,
      "start": 2724.4600219726562,
      "end": 2728.500030517578,
      "text": " I pray that You'd be glorified, for it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T11:05:25.050879"
}