{
  "video_id": "e8EcrF1qCYY",
  "text": "to kind of begin our message this morning. And of course, you know, in just a couple of weeks, we'll be celebrating the resurrection of our Lord and Jesus, our Lord and Savior, Jesus Christ. And I'm so thankful. The truth of the resurrection is the cornerstone of our faith, amen. And looking forward to that. I won't be preaching next week. We'll have a missionary here. And so Brother Baloo will be preaching. And so this morning, we're gonna look at this subject matter, dealing with the Apostle Peter and a statement that he makes here in 1 Peter 5 and verse number one. I believe that many of us, and we've talked about this in various settings over the years in men's meetings and other types of lessons, Sunday school classes and what have you, but Peter seems to be very relatable. It seems like as you study the word of God, that there are certain Bible characters in which we can relate to better than others. And Peter just seems to be one of those characters that seems to be very relatable. And I think about Peter and some of the declarations that he made within the scriptures that God has recorded for us. And man, some of them are just awesome. I mean, mountaintop type of declarations. Some of them, you just scratch your head and say, yeah, he didn't really know what he was saying. And that's okay. Sometimes we're there as well. But the reality I was reading this morning, the book of John, you remember in John chapter number six, when the disciples, many of those that follow Jesus left and Jesus turns to the disciples and said, are you gonna go away also? And Peter says, to whom shall we go? For thou hast the words of eternal life. And we are sure, we are confident that thou art the Christ. I mean, what a great declaration. We think about Peter, a man that walked with the Lord Jesus Christ, a man that encountered in his journey as he walked with the Lord Jesus Christ, he was an eyewitness of many miracles. And he had the privilege of seeing the power of the Lord Jesus Christ. It was his own mother-in-law that was healed of a fever, the Bible tells us. And there he would see that firsthand. It was Peter that got out of the boat and walked on the water. It was Peter that was at the Mount of Transfiguration. You think about Peter and all of these wonderful things and how God used Peter. Of course, as you read the book of Acts, you begin to see the preaching of Peter and his leadership and how God used him. And yes, we oftentimes we speak about, well, you know, Peter doubted the Lord. He denied the Lord. I know he did. I know he denied the Lord. But the reality is that as you look at the life of Peter, there's so many wonderful things in his life. And you see a man that is relatable. You see a man that here as he's writing to these believers in the book of 1 Peter, of course, he'll be used to pen the words of 2 Peter as well. But as he's writing the book of 1 Peter, and under the inspiration of the Holy Spirit of God, he's seeking to encourage these believers that are facing difficulty and facing persecution under the rule of Nero. These believers that are suffering for the cause of Christ. And he's seeking to encourage them and he's seeking to instruct them. And he says something very interesting in verse number one that leads us back to the gospels will be our subject that we'll study this morning. But notice what Peter says, the elders which are among you, I exhort, who am also an elder, he understands his position. And then notice where he says, and a witness of the sufferings of Christ. And also a partaker of the glory that shall be revealed. Before the glory, there was suffering. And as you think about the subject of the book of 1 Peter and these believers that were suffering, he tells them, listen, if you're suffering for the cause of Christ, happy are ye. And you say, happy? Blessed? Yes. The perspective of Peter. But I want you to think about that statement. Think about all of the things that Peter witnessed in his time of walking with the Lord Jesus Christ. And under the inspiration of the Holy Spirit of God, God directs Peter to say in verse number one of 1 Peter 5, that he was a witness of the sufferings of Christ. A witness of the sufferings of Christ. I want you to go back to the book of Matthew, if you will. And we're gonna look at a number of scriptures this morning. So get your fingers ready. I am at a disadvantage with this contraption here. So you bear with me this morning, but we'll get to a number of passages of scripture. I want you to see the record of his suffering. God records for us in his word, the suffering of the Lord Jesus Christ. It's interesting in Matthew chapter number 16, one of those mountain pillar type of statements that Peter makes, it was here in Matthew chapter number 16, that Jesus says to the disciples in verse number 13, whom do men say that I, the son of man am? And of course, you're familiar with the response. They respond to Jesus and say, some say that thou art John the Baptist and some Elias and others Jeremiah's or one of the prophets. And then Jesus says this in verse number 15, but whom say ye that I am? And here's Peter and man, what a bold, precious declaration. He says this, thou art the Christ, the son of the living God. And Jesus says to Peter, he says this in verse number 17, blessed art thou Simon Barjona for flesh and blood hath not revealed it unto thee, but my father, which is in heaven. And I say also unto thee that thou art Peter and upon this rock, I will build my church and the gates of hell shall not prevail against it. And I will give unto thee the keys of the kingdom of heaven. What sort of thou shalt bind on earth shall be bound in heaven. And what sort of thou shalt loose on earth shall be loosed in heaven, then charged to his disciples that they should tell no man that he was Jesus the Christ. But I wanna draw your attention to verse 21. I want you to think about the excitement, all that's taken place, the promises that Jesus has given here, that great declaration of Peter. We often refer to the promise of verse number 18 when Jesus says, I will build my church and what a blessing to see God working and continuing to do that to this very day. And he's promised to do so until the rapture when the church is taken out of here. But notice what Jesus says in verse 21, from that time forth began Jesus to show unto his disciples. Now think about Peter and think about what he's experienced and think about that statement that he makes in first Peter five in verse number one, that he is a witness of the sufferings of Christ. Here in verse number 21, the Bible says that Jesus beginning at that time and going forth, he's beginning to reveal, to show to his disciples what? How that he must go unto Jerusalem and what? And suffer many things of the elders and chief priests and scribes, notice, and be killed and be raised again the third day. Was at that time in the life and ministry of the Lord Jesus Christ, was at that time that Peter as one of his followers, as one of the disciples, begins to receive this instruction from Jesus with regard to how he would suffer many things. Yes, he would be killed, he would go to that cruel tree, he would go to the cross of Calvary, and he would suffer and bleed and die, but he would rise in victory. And we'll look at that in two weeks. But I want you to think about these sufferings and the record of his suffering. Turn to the book of Luke, if you will, in chapter 22. And we're gonna stick here in Luke here for just a little while as we complete this point this morning. But look at Luke chapter number 22, if you will, at some time has passed in the life and ministry of the Lord Jesus Christ. And we find that it's in Luke chapter number 22 that God records for us the record of what we'd refer to as the Lord's Supper. And as the record is given to us here in Luke's gospel, the Bible tells us beginning in verse number 13, and they went and found as he had said unto them, and they made ready the Passover, verse 14 of Luke 22. And when the hour was come, he sat down and the 12 apostles with him, and he said unto them, notice what he says, with desire, I have desired to eat this Passover with you before I suffer. Before I suffer. The record of his suffering comes as we continue to look through Luke chapter number 22, and you'll see the arrest, and you'll see the denial and all that takes place. But I wanna draw your attention to Luke chapter 22 in verse number 63. Jesus has been arrested in the garden of Gethsemane. We read of that and we find that here as we come to the near the end of Luke chapter number 22, that the Bible tells us of Jesus Christ being mocked and beaten. He's the very son of God. He is God in flesh. He is the creator. And we find that in verse number 63, that the Bible tells us and the men that held Jesus mocked him and smote him. The suffering is now beginning. We find that it was in Matthew in chapter number 16 that Jesus declares to them how that he was going to suffer. And we find that he says to them there at the Passover that he desired to have this Passover with them before I suffer. And now as we come to verse number 63, we begin to see the suffering. He's mocked. He's smitten. The Bible says in verse 64, and when they had blindfolded him, they struck him on the face. Notice what they say. Prophesy. Who is it that smote thee? You know what's amazing is he knew exactly who it was that smote him. Can you see the suffering beginning? When they take the Son of God, my Savior, your Savior, they've arrested Him. They begin to mock Him and they blindfold Him and they beat Him. The Bible says that they struck Him on the face. And they say, prophesy. Who is it that smote thee? Look at verse 65, and many other things blasphemously spake they against Him. He stands before the Sanhedrin at the end of chapter 22 and chapter 23. It begins when He's standing there before Pilate and then Herod because Pilate learns that he's of the region in which Herod is in control of there, of Galilee. We find that Herod and Pilate are made friends that day. According to verse number 12, they had been before at enmity and they're made friends according to verse number 12. And then Jesus is again before Pilate in verse 13 down through verse number 25. And we find that as we continue in chapter number 23 that we come to verse number 26 as it begins to describe to us the crucifixion. As they arrested Him and they mocked Him and they beat Him, and then He stands before the Sanhedrin and before Pilate and Herod and then Pilate, and then we find that as Pilate was ready to release Jesus, the crowd cried out and said, no, we'll take Barabbas. As for this one Jesus, crucify Him. And Pilate says, I find no fault in this man. And they cry out the more, crucify Him, crucify Him. The Bible begins to declare to us, look if you will, in verse 33, when they were come to the place which is called Calvary, aren't you thankful for Calvary? It says there they crucified Him. That's a simple statement. But the suffering of crucifixion is beyond what I can adequately describe to you this morning. The Romans had sought to perfect the art, quote-unquote, of crucifixion to make it as miserable and as painful as they could possibly do. How many times they would crucify these individuals and they would seek to draw it out for as long as they possibly could to extend the period of suffering. It's unbelievable. We would use this word perhaps, it's inhumane. It's the suffering of the cross. It's a simple statement. There they crucified Him. But all that that entails, the male factors, one on the right hand, the other on the left, verse 34, then said Jesus, Father forgive them, for they know not what they do. They parted His raiment, they cast lots, the people stood beholding and the rulers also with them derided Him saying, notice what they say, He saved others, let Him save Himself. If He be the Christ, the chosen of God, the soldiers also mocked Him, coming to Him and offering Him vinegar and saying, if Thou be the King of the Jews, save Thyself. Aren't you thankful that He stayed on the cross? He saved others, but He stayed on that cross to save us from sin, to pay the awful penalty, to shed His precious blood. I'm so thankful that He stayed on the cross. We've often said over the years that it was love that held Him there. He says that He could have called legions of angels. It was for this purpose that Jesus came to earth. He came to die. And the Bible records for us the sufferings of our Lord and Savior, Jesus Christ. And Peter says that He is, yes, an elder, but he says, I'm a witness of the sufferings of Christ. And this morning as we take just a few moments and consider the record that God has given, of course, you can read in all four of the Gospels, you can read the record of the suffering of the cross of Calvary. I want you to continue thinking about this this morning. I want you to consider the reason for His suffering. Yes, the Bible records for us His suffering, but I want you to think about the reason. It could be summed up in one word, me. Each of us could say, He suffered. Why? For me. I suffered to pay for my sin. And we find here this morning, turn to the book of 1 Peter, if you will, and I want to draw your attention to various aspects of what Peter says before he comes to that fifth chapter and says that he is a witness of the sufferings of Christ. I want you to notice that he speaks of the sufferings of Christ prior to that statement here in the book of 1 Peter, beginning in chapter number two. In 1 Peter chapter number two, in verse number 20, notice what the word of God says with regard to the suffering of the Lord Jesus Christ. It says, but what glory is it if when ye are, ye be buffeted for your faults, you shall take it patiently. But if when you do well and suffer for it, you take it patiently, this is acceptable with God. Notice verse number 21, for He even here unto were ye called. Notice when he says, Christ also suffered for us, Christ also suffered for us, leaving us an example that ye should follow His steps, who did no sin, neither was guile found in His mouth, who when He was reviled, reviled not again. When He suffered, He threatened not, but committed Himself to Him that judgeth righteously, who His own self bear our sins in His own body on the tree, that we being dead to sin should live unto righteousness, by whose stripes ye are healed. For ye were as sheep going astray, but are now returned unto the shepherd and bishop of your souls. Look in chapter number three, in verse number 18, where the Bible says this, for Christ also hath once suffered for sins, the just Jesus for the unjust humankind. The just for the unjust, that He might bring us to God, being put to death in the flesh, but quickened by the Spirit. That truth of reconciliation, that truth of redemption. Listen, there's no way for man to be redeemed, but through the precious blood of Jesus Christ, that required suffering for you and for me and for humanity. The Lord Jesus Christ, God in flesh, though He was rich, yet for our sakes He became poor. He humbled Himself and became obedient unto death, even the death of the cross. We find the reason for the suffering. Peter says that He once suffered for our sins, that why, the just for the unjust, that He might bring us to God. Aren't you thankful for that? Chapter four, notice what he says in verse number one of 1 Peter chapter four, for as much then as Christ hath suffered for us in the flesh, arm yourselves likewise with the same mind, for he that hath suffered in the flesh hath ceased from sin. You know, Peter understood that Jesus suffered all that He did in order to pay for the penalty of sin. There's no other payment that was accepted. God in His wisdom, He had determined before the foundation of the world, Peter deals with this truth as well, that Jesus is the Lamb that was slain before the foundation of the world. And we find that God in His grace and His mercy, He had prescribed that this is the only way by which man can be redeemed. And Jesus was willing to go to that cross to suffer. And Peter says, I'm a witness of the sufferings of Christ, I'm a witness of the sufferings of Christ. See, Peter had this understanding that Jesus was fulfilling that which had been prophesied. In fact, at the end of chapter number two of 1 Peter, really he's referencing there the truth of Isaiah 53. Hold your place there in the book of, actually we're going to go back to the book of Acts, so you don't need to hold your place there in 1 Peter, but go over to Isaiah 53, if you will, a portion of Scripture that is familiar to many of us. Isaiah 53, some have described this chapter as being the chapter of the suffering Savior. And here we find in Isaiah 53, beginning in verse number four, notice the Bible says, Surely He hath borne our griefs and carried our sorrows. Yet, we did esteem him stricken, smitten of God, and afflicted. Notice he was wounded for our transgressions. He was bruised for our iniquities. The chastisement of our peace was upon him, and with his stripes we are healed. All we like sheep have gone astray, we have turned everyone to his own way. The Lord hath laid on him the iniquity of us all.\" What's interesting for Peter is used by God in the book of Acts as a leader in the first century church. And turn over to Acts 3, if you will. You find that Peter is understanding even this prophecy that we read of in Isaiah 53, and it's evidence that he's understanding the fulfillment of this prophecy through the suffering of the Lord Jesus Christ as he gives an answer in Acts chapter number 3. Now Acts chapter number 3, many of you will be familiar with the passage of Scripture. It's that miracle that takes place when that lame man was laying there at the gate, beautiful. Remember, Peter says to him, he's asking alms, and he says, \"'Silver and gold have I none, but such as I have, in the name of Jesus Christ of Nazareth, rise up and walk.'\" And man, this guy, he was healed, and he's leaping, and he's going, walking, and leaping, and praising God with them into the temple. It's interesting in verse number 9, it says, \"'And all the people saw him walking and praising God, and they knew that it was he which sat for alms at the beautiful gate of the temple, and they were filled with wonder and amazement at that which had happened unto him.'\" In the next passage of Scripture through the end of chapter number 3, we find that Peter's going to preach a message, and we find that as he preaches that message, he's going to reveal this truth to us that he understood the reason for which Christ suffered. He'll stand before the religious leaders in chapter number 4 and give testimony with regard to the miracle that takes place. But I want you to see, as he's preaching in verse number 11, it says, \"'And as the lame man which was healed held Peter and John, all the people ran together unto them in the porch that is called Solomon's, greatly wandering, and Peter saw it. He answered unto the people, \"'You men of Israel, why marvel ye at this? Or why look ye so earnestly on us, as though by our own power or holiness we had made this man to walk? No, the God of Abraham, and of Isaac, and of Jacob, the God of our fathers, hath glorified his son Jesus.'\" Remember, I said this in 1 Peter 5.1, before the glory is the suffering. He says that, \"'The God of our fathers hath glorified his son Jesus, whom ye delivered up and denied him in the presence of Pilate when he was determined to let him go. But ye denied the Holy One and the just, and desired a murderer to be granted unto you, and killed the Prince of life, whom God hath raised from the dead, whereof we are witnesses. And his name, through faith in his name, hath made this man strong, whom ye see and know. Yea, the faith which is by him hath given him this perfect soundness in the presence of you all. And now, brethren, I want that through ignorance he did it, as did also your rulers.'\" Notice in verse number 18, \"'But those things which God before had showed by the mouth of all his prophets, that Christ should suffer, he hath so fulfilled.'\" Listen, this morning, as we think about the suffering of the Lord Jesus Christ, we consider this morning the record that God has given us. We consider this morning the reason for his suffering. And as we understand the truth of God's Word, we understand that Peter, yes, he is a witness of the sufferings of Christ, and we find that he makes that declaration. We've not witnessed it firsthand, but we have the record of it. And we understand the truth that Jesus Christ, God in flesh, he did it all for me. He suffered. This morning, when we speak about suffering, when we think about suffering, and there are some in our midst that have suffered greatly, you've dealt with difficulty, but can I tell you this morning that the greatest that we could suffer really pales in comparison to what Jesus Christ suffered for our redemption. He suffered it all, why? Because he loved me. How appropriate the song that Kimberly and Pierre played this morning, how deep the Father's love. Oh man, I think about the love of God as it's demonstrated on that cruel cross, the suffering for me and for you. I want you to think about, as we finish up this morning, the result of this suffering. Of course, we know it's redemption, but turn back to the book of Luke, if you will. We kind of walked our way through, skipping along some passages here in the book of Luke, and we ended up there in chapter 23, and looking at that suffering. Notice if you will, in chapter 23, in verse number 46, verse 45 says that the sun was dark and the veil of the temple was rent in the midst, and verse 46 of Luke 23, when Jesus had cried with a loud voice, he said, Father, into thy hands I commend my spirit, and having said thus, he gave up the ghost. He died. He died. The burial is recorded beginning in verse number 50 and down through the end of the passage, and we understand that chapter 24, the beginning of this chapter, it records for us the glorious truth of the resurrection of our Lord and Savior, Jesus Christ, when He conquered sin, death, and the grave, and hallelujah for the resurrection. But I want to move down past the testimony of the resurrection, I want you to move down to verse number 26, if you will. Here in verse number 26, we're jumping right into the dialogue that Jesus is having with these disciples on the road to Emmaus. You remember that these disciples on the road to Emmaus, they're saddened, they take this journey, they've left Jerusalem, and it's almost a seven-mile journey, and Jesus comes and He begins to walk with them, and they're just saddened, and Jesus questions them about their sadness, and they say, are you a stranger in Jerusalem? You're not aware of the things that have happened? And He asked them, what things? In verse number 19, they begin to declare the things that have happened, and He says in verse 25, then He said unto them, O fools and slow of heart, to believe all that the prophets have spoken, ought not Christ to have suffered these things, and to enter into His glory? It says that beginning at Moses, and all the prophets, He expounded unto them in all the Scriptures the things concerning Himself. And what a lesson that must have been. Can you imagine? And we find that they constrained Him to stay because He was going to keep on going after they got home, and they said, no, the hour's late, come on, and He goes in and they're going to eat, and He took the bread, He blessed it and break it, and the Bible says that their eyes were opened, and then He vanished out of their sight. You know what they did? They walked back to Jerusalem, almost seven miles. Jared, you did 16 miles yesterday, and Tim, I think, they did a 16-mile hike yesterday, these guys almost did that. Go back to Jerusalem. You know, they go back with a testimony. He is risen indeed, and exciting. Go down to verse 46, if you will, actually pick it up in verse 44, and He said unto them, Jesus now speaking, these are the words which I spake unto you while I was yet with you, that all things must be fulfilled. Remember we started as Peter gave that testimony that he's a witness of the sufferings of Christ, and it was there after the declaration when Jesus said, who do men say that I am? And some say John the Baptist, some Isaiah or Jeremiah, one of the other prophets, but whom say ye that I am? And after Peter had given that bold declaration, thou art the Christ, the Son of the living God, it was at that time that Jesus began to reveal to them, to show unto them the things that He must suffer. And He says here in verse 44, these are the words which I spake unto you while I was yet with you, that all things must be fulfilled, which were written in the law of Moses and the prophets and in the Psalms concerning me. Then opened He their understanding that they might understand the Scriptures, and He said unto them, thus it is written, and thus it behooved Christ to suffer, to rise from the dead the third day, that repentance and remission of sin should be preached in His name among all nations beginning at Jerusalem, and ye are witnesses of these things. You know what I find in Peter? I find a man that, remember Jesus said to him in a couple of chapters earlier how that He was going to deny him. And He said, listen, Peter, Satan hath desired to have you that he may sift you as wheat. But He says this, but I have prayed for thee. And then He says this, and when thou art converted, strengthen thy brethren. And Peter, John records in John 21 that encounter when Peter and John are there. It's interesting in the gospel account. of the resurrection, how that He says, go sell the disciples, and Peter. And Peter, as he hears these words, remember as we read there just a moment ago in Acts 3, he said we're witnesses of these things. And then in 1 Peter 5, in verse 1, he says that I am a witness of the sufferings of Christ. And he says, Jesus says to them, here, listen, it was written and thus it behooved Christ, in verse 46, to suffer, to rise from the dead the third day. And then notice the result of this. Yes, it's redemption and salvation because now mankind can be saved and we see that the truth is given, that repentance and remission of sin should be preached in His name among all nations, beginning at Jerusalem, and you're witnesses of these things. The end here of Luke 24 reveals to us, it records for us the ascension of Jesus Christ. If you're trying to trace the timeline, it's in connection there with Acts 1. And you see that Peter, he's embraced this responsibility that he has. Yes, he's a witness, but he understands the result that redemption has now been paid for. The price of redemption, the blood of Christ, all the way back in Genesis, the prophecies regarding the blood that would be shed and all of those sacrifices that were done day after day. Remember, Hebrews 10 speaks about those that would stand, those priests that would minister daily, offering the same sacrifices that could never take away sin. But this man, after he made one sacrifice for sin forever, sat at the right hand of the throne of God. And we find here that Peter is being used by God. He's testifying. I'm a witness of the sufferings, and let me help you understand that as we testify of the sufferings, as he's writing to the believers in 1 Peter, he did this for you. He suffered for us. This is what he did. Notice, if you will, in 2 Corinthians 5. In 2 Corinthians 5, we've read in 1 Peter about the reason for his suffering. We find that he suffered for our sin. Here, the Bible tells us in 2 Corinthians 5 in verse 21, for he hath made him to be sin for us, who knew no sin. Notice the last part of this verse, that we might be made the righteousness of God in him. That we might be made the righteousness of God in him. There's no other way for mankind to be declared righteous, but through the imputed righteousness of the Lord Jesus Christ. In fact, Isaiah says this, that all of our good works are as filthy rags. As man goes about trying to establish his own righteousness, he fails utterly. The Bible says that we've all come short, that we're all sinners, and we understand that from Romans chapter number three, and we find the result of the suffering is that we now can be saved. And those of us that are here this morning that have been saved, we can rejoice greatly in the suffering of the Lord Jesus Christ. It should cause us to, even as I read the passage of Scripture, to be choked up. To think about what he did for us. He's God, but he did it for us. I wanna close with this thought from Hebrews chapter number 12. Turn there if you will. In Hebrews chapter number 12, we'll make application and be done this morning. In Hebrews chapter number 12, Hebrews 12. Beginning in verse number one. Hebrews 12 and verse number one, the Bible says, we're foreseeing we also are encompassed about with so great a cloud of witnesses. Let us lay aside every weight and the sin which doth so easily beset us and let us run with patience the race that is set before us. Looking unto Jesus, the author and finisher of our faith, notice this, who for the joy that was set before him endured the cross, despising the shame and is set down at the right hand of the throne of God. For consider him that endured such contradiction of sinners against himself, lest you be wearied and faint in your own minds. I want you to think about the word suffer is not here, but when you think about the truth that is being written, when it talks about he endured the cross, despising the shame, verse three says that he endured such contradiction of sinners against himself. I think that it's fair that we could say that he suffered. We read it all over the place in all sorts of passages of scripture that we've looked at even this morning. And though the word is not there, we see this suffering, but I wanna draw your attention where the Bible says in verse number two, that looking unto Jesus, the author and finisher of our faith, but it says this, for the joy that was set before him. He endured the cross. He endured that suffering. Why? For the joy that was set before him. He understood that because of that suffering, that suffering precedes glory. And that if there's no death on the cross, there's no resurrection. If there's no death on the cross, there's no atonement. The substitutionary atonement that God speaks of all throughout his word, that the just dies for the unjust, that we find ourselves in that position, that he has taken our place. And he suffered for me. He suffered it all because he loved me. And this morning, when we think about the glorious truth of this message, I wonder this morning, how does it really impact us? Two thoughts. Number one, we should rejoice greatly. I mean, we ought to just take some time and just really thank God for our salvation. I understand this morning that in a sense, my salvation cost me nothing, but it cost him everything. Cost him everything. When I think about, go back and read all four gospel accounts of the crucifixion. I couldn't do it publicly this morning, but you go back this afternoon and you read all four gospel accounts of the suffering of the Lord Jesus Christ. As you read it, as the tears flow down your cheeks, just thank him. Rejoice greatly. Because he did it all for me. Personally, you say that he did it for me. What joy should flood our souls? Amen? Preacher friend said this. He said, speaking about the importance of rejoicing in our salvation, for our salvation, he said, there are days that we as believers have tough days. He said, but on our worst of days, I'm still going to heaven. I'm still going to heaven. Amen? Think about that. The suffering. We're witnesses. But then I want you to think about how it impacted Peter. Peter, he says in John 21, I go a fishing. He's there with the Lord Jesus Christ after they caught nothing. Jesus said, I have prayed for thee when thou art converted, strengthen thy brethren. When you read of the life of Peter in the book of Acts and you read as he's testifying and ministering to these believers in first and second Peter, you see a man that is compelled to tell others about Jesus Christ and about his suffering for them. You know, this morning, we are privileged to know this truth. Honestly, it doesn't make us better. It makes us accountable. When I think about that this morning, listen, I'm so thankful that I'm going to heaven one day. I don't know when it's gonna be. But one day, for every single one of us that have trusted the Lord Jesus Christ our personal Savior, heaven is real. Heaven is real. But there's a whole lot of people in our world that they don't know about the sufferings of Jesus Christ. They don't know what he did on the cross of Calvary or why he did what he did on the cross of Calvary. I remember speaking to a man when I, I say a man, we were just teenagers, we were kids. Y'all teenagers are kids, amen. You know, the older you get, the more you refer to kids that aren't really kids, but you call them kids. There's like this 20-something-year-old. I found myself yesterday saying to Brianna, yeah, this kid over at the store, and I was like, actually, it was probably like 24, but you know, I guess now he's a kid, you know? And some of you, you look at me as a kid, I get it. But the reality is that I was a senior in high school. I had just been saved, not long. Been saved for just probably a month at the most. And we're sitting at a lunch table as a senior. senior in high school, and there's this kid that was sitting there. My brother was a sophomore, and so we had lunch together. Actually, I had lunch together almost every day in my senior high school, and there was a kid that was in his class, and he was sitting there with us, and I began to talk to him about the Lord Jesus Christ. And I began to talk to him about how Jesus died for him, and he had a very skewed perspective with regard to the death of Christ on the cross of Calvary, and that it was not a willing sacrifice, but that it was a Roman authority that forced him. And I began to share truth with him, some of what I shared this morning. Listen, Jesus did it all because he loved us. Those Romans, remember what he said to Pilate, you have no authority, no power unless I give it to you, right? He could have called legions of angels, but Peter says, I'm a witness of the sufferings of Christ. This morning, we weren't there physically to be eyewitnesses, but in a sense this morning, if you'd allow me to say it, we are witnesses of his suffering. Amen? We know that he suffered, and we know why he suffered. And I trust this morning that it would not only lead us to a place of rejoicing greatly, thanking him, having this increased level of gratitude for our redemption, but it would lead us to, God, would you help me to share this wonderful message with someone? I believe that as we begin to pray that way, God would delight in answering that prayer. I challenge you this morning, I'm challenging myself, that we would say, God, would you give me the opportunity in these next couple of weeks to share with someone the truth of why you suffered on the cross of Calvary? Would you give me the opportunity? As we pray specifically, I believe God will answer that prayer, begin to look for those opportunities that He would present to us. See during this time, and I understand we're in a different time in our country's history. There was a time when Easter, man, people that never went to church would be in church. That's becoming less and less of a situation. But there still are some people out there that have some idea of what Easter is really all about. Not that they've trusted Christ, not that maybe they know all of it, but this time of our calendar gives us an opportunity. And I'm praying, and I want to ask you this morning to pray specifically, maybe to come to this altar and say, God, would you give me in these next couple of weeks, give me a divine appointment, give me an opportunity to speak of your sufferings and why you suffered. Thank Him for your redemption, absolutely. Read the passages, weep and rejoice that He loved you so much that He was willing to suffer in the manner in which He did. But then go tell someone of this great truth. Let's pray. Father, we love you. Thank you for loving us. My heart is overwhelmed this morning, just thinking about the statement of Peter, a witness of the sufferings of Christ. As we read the account leading to the cross and then the cross itself, thank you. Thank you for being obedient unto death, even the death of the cross. Rejoice in the resurrection before the glory is the suffering. We understand that you did it all for me, personally, each one of us can say that. I pray this morning that you'd help us to have a level of motivation to go and share this truth with someone. God, would you help us, each of us, to pray specifically about that opportunity, that divine appointment. I pray, God, that you'd move and work, open doors, lead our path, that we might share with someone the sufferings of Jesus Christ, why He suffered the way that He did, of course, leading to the glory of His resurrection, conquering sin, death, and the grave. I pray that you would guide and direct in these moments of invitation. If there's one in our midst that's never trusted Christ as their Savior, we pray that today would be the day of their salvation. We'll give you the glory for all that you'll do, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.8399999141693115,
      "text": " to kind of begin our message this morning."
    },
    {
      "id": 1,
      "start": 2.8399999141693115,
      "end": 4.679999828338623,
      "text": " And of course, you know, in just a couple of weeks,"
    },
    {
      "id": 2,
      "start": 4.679999828338623,
      "end": 5.920000076293945,
      "text": " we'll be celebrating the resurrection"
    },
    {
      "id": 3,
      "start": 5.920000076293945,
      "end": 9.0,
      "text": " of our Lord and Jesus, our Lord and Savior, Jesus Christ."
    },
    {
      "id": 4,
      "start": 9.0,
      "end": 10.760000228881836,
      "text": " And I'm so thankful."
    },
    {
      "id": 5,
      "start": 10.760000228881836,
      "end": 12.239999771118164,
      "text": " The truth of the resurrection"
    },
    {
      "id": 6,
      "start": 12.239999771118164,
      "end": 14.720000267028809,
      "text": " is the cornerstone of our faith, amen."
    },
    {
      "id": 7,
      "start": 14.720000267028809,
      "end": 15.960000038146973,
      "text": " And looking forward to that."
    },
    {
      "id": 8,
      "start": 15.960000038146973,
      "end": 17.31999969482422,
      "text": " I won't be preaching next week."
    },
    {
      "id": 9,
      "start": 17.31999969482422,
      "end": 18.600000381469727,
      "text": " We'll have a missionary here."
    },
    {
      "id": 10,
      "start": 18.600000381469727,
      "end": 21.15999984741211,
      "text": " And so Brother Baloo will be preaching."
    },
    {
      "id": 11,
      "start": 21.15999984741211,
      "end": 22.8799991607666,
      "text": " And so this morning,"
    },
    {
      "id": 12,
      "start": 22.8799991607666,
      "end": 24.18000030517578,
      "text": " we're gonna look at this subject matter,"
    },
    {
      "id": 13,
      "start": 24.18000030517578,
      "end": 26.600000381469727,
      "text": " dealing with the Apostle Peter"
    },
    {
      "id": 14,
      "start": 26.600000381469727,
      "end": 27.920000076293945,
      "text": " and a statement that he makes here"
    },
    {
      "id": 15,
      "start": 27.959999084472656,
      "end": 30.559999465942383,
      "text": " in 1 Peter 5 and verse number one."
    },
    {
      "id": 16,
      "start": 30.559999465942383,
      "end": 31.719999313354492,
      "text": " I believe that many of us,"
    },
    {
      "id": 17,
      "start": 31.719999313354492,
      "end": 33.84000015258789,
      "text": " and we've talked about this in various settings"
    },
    {
      "id": 18,
      "start": 33.84000015258789,
      "end": 35.47999954223633,
      "text": " over the years in men's meetings"
    },
    {
      "id": 19,
      "start": 35.47999954223633,
      "end": 38.0,
      "text": " and other types of lessons,"
    },
    {
      "id": 20,
      "start": 38.0,
      "end": 39.779998779296875,
      "text": " Sunday school classes and what have you,"
    },
    {
      "id": 21,
      "start": 39.779998779296875,
      "end": 41.91999816894531,
      "text": " but Peter seems to be very relatable."
    },
    {
      "id": 22,
      "start": 41.91999816894531,
      "end": 43.599998474121094,
      "text": " It seems like as you study the word of God,"
    },
    {
      "id": 23,
      "start": 43.599998474121094,
      "end": 45.279998779296875,
      "text": " that there are certain Bible characters"
    },
    {
      "id": 24,
      "start": 45.279998779296875,
      "end": 48.52000045776367,
      "text": " in which we can relate to better than others."
    },
    {
      "id": 25,
      "start": 48.52000045776367,
      "end": 50.68000030517578,
      "text": " And Peter just seems to be one of those characters"
    },
    {
      "id": 26,
      "start": 50.68000030517578,
      "end": 52.439998626708984,
      "text": " that seems to be very relatable."
    },
    {
      "id": 27,
      "start": 52.439998626708984,
      "end": 55.58000183105469,
      "text": " And I think about Peter and some of the declarations"
    },
    {
      "id": 28,
      "start": 55.58000183105469,
      "end": 57.279998779296875,
      "text": " that he made within the scriptures"
    },
    {
      "id": 29,
      "start": 57.279998779296875,
      "end": 58.84000015258789,
      "text": " that God has recorded for us."
    },
    {
      "id": 30,
      "start": 58.84000015258789,
      "end": 61.18000030517578,
      "text": " And man, some of them are just awesome."
    },
    {
      "id": 31,
      "start": 61.18000030517578,
      "end": 64.58000183105469,
      "text": " I mean, mountaintop type of declarations."
    },
    {
      "id": 32,
      "start": 64.58000183105469,
      "end": 66.4800033569336,
      "text": " Some of them, you just scratch your head and say,"
    },
    {
      "id": 33,
      "start": 66.4800033569336,
      "end": 68.05999755859375,
      "text": " yeah, he didn't really know what he was saying."
    },
    {
      "id": 34,
      "start": 68.05999755859375,
      "end": 68.9000015258789,
      "text": " And that's okay."
    },
    {
      "id": 35,
      "start": 68.9000015258789,
      "end": 70.4800033569336,
      "text": " Sometimes we're there as well."
    },
    {
      "id": 36,
      "start": 70.4800033569336,
      "end": 71.95999908447266,
      "text": " But the reality I was reading this morning,"
    },
    {
      "id": 37,
      "start": 71.95999908447266,
      "end": 72.80000305175781,
      "text": " the book of John,"
    },
    {
      "id": 38,
      "start": 72.80000305175781,
      "end": 74.12000274658203,
      "text": " you remember in John chapter number six,"
    },
    {
      "id": 39,
      "start": 74.12000274658203,
      "end": 75.44000244140625,
      "text": " when the disciples,"
    },
    {
      "id": 40,
      "start": 75.44000244140625,
      "end": 77.27999877929688,
      "text": " many of those that follow Jesus left"
    },
    {
      "id": 41,
      "start": 77.27999877929688,
      "end": 78.76000213623047,
      "text": " and Jesus turns to the disciples and said,"
    },
    {
      "id": 42,
      "start": 78.76000213623047,
      "end": 80.68000030517578,
      "text": " are you gonna go away also?"
    },
    {
      "id": 43,
      "start": 80.68000030517578,
      "end": 84.36000061035156,
      "text": " And Peter says, to whom shall we go?"
    },
    {
      "id": 44,
      "start": 84.36000061035156,
      "end": 86.73999786376953,
      "text": " For thou hast the words of eternal life."
    },
    {
      "id": 45,
      "start": 87.69999694824219,
      "end": 91.0199966430664,
      "text": " And we are sure, we are confident that thou art the Christ."
    },
    {
      "id": 46,
      "start": 91.0199966430664,
      "end": 93.5,
      "text": " I mean, what a great declaration."
    },
    {
      "id": 47,
      "start": 93.5,
      "end": 95.45999908447266,
      "text": " We think about Peter,"
    },
    {
      "id": 48,
      "start": 95.45999908447266,
      "end": 98.86000061035156,
      "text": " a man that walked with the Lord Jesus Christ,"
    },
    {
      "id": 49,
      "start": 98.86000061035156,
      "end": 102.58000183105469,
      "text": " a man that encountered in his journey"
    },
    {
      "id": 50,
      "start": 102.58000183105469,
      "end": 104.5,
      "text": " as he walked with the Lord Jesus Christ,"
    },
    {
      "id": 51,
      "start": 104.5,
      "end": 107.0199966430664,
      "text": " he was an eyewitness of many miracles."
    },
    {
      "id": 52,
      "start": 107.0199966430664,
      "end": 110.30000305175781,
      "text": " And he had the privilege of seeing the power"
    },
    {
      "id": 53,
      "start": 110.30000305175781,
      "end": 112.30000305175781,
      "text": " of the Lord Jesus Christ."
    },
    {
      "id": 54,
      "start": 112.30000305175781,
      "end": 114.66000366210938,
      "text": " It was his own mother-in-law that was healed of a fever,"
    },
    {
      "id": 55,
      "start": 114.66000366210938,
      "end": 115.66000366210938,
      "text": " the Bible tells us."
    },
    {
      "id": 56,
      "start": 115.66000366210938,
      "end": 117.91999816894531,
      "text": " And there he would see that firsthand."
    },
    {
      "id": 57,
      "start": 117.91999816894531,
      "end": 119.54000091552734,
      "text": " It was Peter that got out of the boat"
    },
    {
      "id": 58,
      "start": 119.54000091552734,
      "end": 120.9800033569336,
      "text": " and walked on the water."
    },
    {
      "id": 59,
      "start": 120.9800033569336,
      "end": 123.94000244140625,
      "text": " It was Peter that was at the Mount of Transfiguration."
    },
    {
      "id": 60,
      "start": 123.94000244140625,
      "end": 126.63999938964844,
      "text": " You think about Peter and all of these wonderful things"
    },
    {
      "id": 61,
      "start": 126.63999938964844,
      "end": 128.6999969482422,
      "text": " and how God used Peter."
    },
    {
      "id": 62,
      "start": 128.6999969482422,
      "end": 130.13999938964844,
      "text": " Of course, as you read the book of Acts,"
    },
    {
      "id": 63,
      "start": 130.13999938964844,
      "end": 133.3000030517578,
      "text": " you begin to see the preaching of Peter and his leadership"
    },
    {
      "id": 64,
      "start": 133.3000030517578,
      "end": 134.89999389648438,
      "text": " and how God used him."
    },
    {
      "id": 65,
      "start": 134.89999389648438,
      "end": 137.4600067138672,
      "text": " And yes, we oftentimes we speak about,"
    },
    {
      "id": 66,
      "start": 137.4600067138672,
      "end": 138.94000244140625,
      "text": " well, you know, Peter doubted the Lord."
    },
    {
      "id": 67,
      "start": 138.94000244140625,
      "end": 140.10000610351562,
      "text": " He denied the Lord."
    },
    {
      "id": 68,
      "start": 140.10000610351562,
      "end": 140.9199981689453,
      "text": " I know he did."
    },
    {
      "id": 69,
      "start": 140.9199981689453,
      "end": 142.94000244140625,
      "text": " I know he denied the Lord."
    },
    {
      "id": 70,
      "start": 142.94000244140625,
      "end": 145.4600067138672,
      "text": " But the reality is that as you look at the life of Peter,"
    },
    {
      "id": 71,
      "start": 146.25999450683594,
      "end": 147.6999969482422,
      "text": " there's so many wonderful things in his life."
    },
    {
      "id": 72,
      "start": 147.6999969482422,
      "end": 150.3000030517578,
      "text": " And you see a man that is relatable."
    },
    {
      "id": 73,
      "start": 150.3000030517578,
      "end": 154.22000122070312,
      "text": " You see a man that here as he's writing to these believers"
    },
    {
      "id": 74,
      "start": 154.22000122070312,
      "end": 156.4199981689453,
      "text": " in the book of 1 Peter,"
    },
    {
      "id": 75,
      "start": 156.4199981689453,
      "end": 158.33999633789062,
      "text": " of course, he'll be used to pen the words"
    },
    {
      "id": 76,
      "start": 158.33999633789062,
      "end": 159.8000030517578,
      "text": " of 2 Peter as well."
    },
    {
      "id": 77,
      "start": 159.8000030517578,
      "end": 163.02000427246094,
      "text": " But as he's writing the book of 1 Peter,"
    },
    {
      "id": 78,
      "start": 163.02000427246094,
      "end": 165.22000122070312,
      "text": " and under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 79,
      "start": 165.22000122070312,
      "end": 167.3800048828125,
      "text": " he's seeking to encourage these believers"
    },
    {
      "id": 80,
      "start": 167.3800048828125,
      "end": 170.66000366210938,
      "text": " that are facing difficulty and facing persecution"
    },
    {
      "id": 81,
      "start": 170.66000366210938,
      "end": 172.25999450683594,
      "text": " under the rule of Nero."
    },
    {
      "id": 82,
      "start": 172.25999450683594,
      "end": 175.5800018310547,
      "text": " These believers that are suffering for the cause of Christ."
    },
    {
      "id": 83,
      "start": 175.5800018310547,
      "end": 178.22000122070312,
      "text": " And he's seeking to encourage them"
    },
    {
      "id": 84,
      "start": 178.22000122070312,
      "end": 180.5399932861328,
      "text": " and he's seeking to instruct them."
    },
    {
      "id": 85,
      "start": 180.5399932861328,
      "end": 183.6199951171875,
      "text": " And he says something very interesting in verse number one"
    },
    {
      "id": 86,
      "start": 183.6199951171875,
      "end": 185.3800048828125,
      "text": " that leads us back to the gospels"
    },
    {
      "id": 87,
      "start": 185.3800048828125,
      "end": 187.66000366210938,
      "text": " will be our subject that we'll study this morning."
    },
    {
      "id": 88,
      "start": 187.66000366210938,
      "end": 189.05999755859375,
      "text": " But notice what Peter says,"
    },
    {
      "id": 89,
      "start": 189.05999755859375,
      "end": 192.13999938964844,
      "text": " the elders which are among you, I exhort,"
    },
    {
      "id": 90,
      "start": 192.13999938964844,
      "end": 195.10000610351562,
      "text": " who am also an elder, he understands his position."
    },
    {
      "id": 91,
      "start": 195.10000610351562,
      "end": 196.25999450683594,
      "text": " And then notice where he says,"
    },
    {
      "id": 92,
      "start": 196.25999450683594,
      "end": 201.25999450683594,
      "text": " and a witness of the sufferings of Christ."
    },
    {
      "id": 93,
      "start": 202.05999755859375,
      "end": 207.05999755859375,
      "text": " And also a partaker of the glory that shall be revealed."
    },
    {
      "id": 94,
      "start": 208.5399932861328,
      "end": 211.86000061035156,
      "text": " Before the glory, there was suffering."
    },
    {
      "id": 95,
      "start": 211.86000061035156,
      "end": 214.02000427246094,
      "text": " And as you think about the subject"
    },
    {
      "id": 96,
      "start": 214.02000427246094,
      "end": 215.13999938964844,
      "text": " of the book of 1 Peter"
    },
    {
      "id": 97,
      "start": 215.13999938964844,
      "end": 217.6199951171875,
      "text": " and these believers that were suffering,"
    },
    {
      "id": 98,
      "start": 217.6199951171875,
      "end": 218.77999877929688,
      "text": " he tells them, listen,"
    },
    {
      "id": 99,
      "start": 218.77999877929688,
      "end": 220.5800018310547,
      "text": " if you're suffering for the cause of Christ,"
    },
    {
      "id": 100,
      "start": 220.5800018310547,
      "end": 222.10000610351562,
      "text": " happy are ye."
    },
    {
      "id": 101,
      "start": 222.10000610351562,
      "end": 223.17999267578125,
      "text": " And you say, happy?"
    },
    {
      "id": 102,
      "start": 223.17999267578125,
      "end": 224.02000427246094,
      "text": " Blessed?"
    },
    {
      "id": 103,
      "start": 224.02000427246094,
      "end": 224.94000244140625,
      "text": " Yes."
    },
    {
      "id": 104,
      "start": 224.94000244140625,
      "end": 226.77999877929688,
      "text": " The perspective of Peter."
    },
    {
      "id": 105,
      "start": 226.77999877929688,
      "end": 228.6999969482422,
      "text": " But I want you to think about that statement."
    },
    {
      "id": 106,
      "start": 228.6999969482422,
      "end": 232.82000732421875,
      "text": " Think about all of the things that Peter witnessed"
    },
    {
      "id": 107,
      "start": 232.82000732421875,
      "end": 236.4600067138672,
      "text": " in his time of walking with the Lord Jesus Christ."
    },
    {
      "id": 108,
      "start": 236.4600067138672,
      "end": 239.6199951171875,
      "text": " And under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 109,
      "start": 239.6199951171875,
      "end": 244.05999755859375,
      "text": " God directs Peter to say in verse number one"
    },
    {
      "id": 110,
      "start": 244.05999755859375,
      "end": 247.74000549316406,
      "text": " of 1 Peter 5, that he was a witness"
    },
    {
      "id": 111,
      "start": 247.74000549316406,
      "end": 251.82000732421875,
      "text": " of the sufferings of Christ."
    },
    {
      "id": 112,
      "start": 251.82000732421875,
      "end": 253.97999572753906,
      "text": " A witness of the sufferings of Christ."
    },
    {
      "id": 113,
      "start": 253.97999572753906,
      "end": 256.3800048828125,
      "text": " I want you to go back to the book of Matthew, if you will."
    },
    {
      "id": 114,
      "start": 256.3800048828125,
      "end": 258.6199951171875,
      "text": " And we're gonna look at a number of scriptures this morning."
    },
    {
      "id": 115,
      "start": 259.4200134277344,
      "end": 260.260009765625,
      "text": " So get your fingers ready."
    },
    {
      "id": 116,
      "start": 260.260009765625,
      "end": 263.17999267578125,
      "text": " I am at a disadvantage with this contraption here."
    },
    {
      "id": 117,
      "start": 263.17999267578125,
      "end": 265.82000732421875,
      "text": " So you bear with me this morning,"
    },
    {
      "id": 118,
      "start": 265.82000732421875,
      "end": 268.6600036621094,
      "text": " but we'll get to a number of passages of scripture."
    },
    {
      "id": 119,
      "start": 268.6600036621094,
      "end": 272.1000061035156,
      "text": " I want you to see the record of his suffering."
    },
    {
      "id": 120,
      "start": 272.1000061035156,
      "end": 274.5799865722656,
      "text": " God records for us in his word,"
    },
    {
      "id": 121,
      "start": 274.5799865722656,
      "end": 276.6199951171875,
      "text": " the suffering of the Lord Jesus Christ."
    },
    {
      "id": 122,
      "start": 276.6199951171875,
      "end": 279.0199890136719,
      "text": " It's interesting in Matthew chapter number 16,"
    },
    {
      "id": 123,
      "start": 279.0199890136719,
      "end": 283.29998779296875,
      "text": " one of those mountain pillar type of statements"
    },
    {
      "id": 124,
      "start": 283.29998779296875,
      "end": 287.17999267578125,
      "text": " that Peter makes, it was here in Matthew chapter number 16,"
    },
    {
      "id": 125,
      "start": 287.17999267578125,
      "end": 290.1000061035156,
      "text": " that Jesus says to the disciples in verse number 13,"
    },
    {
      "id": 126,
      "start": 290.1000061035156,
      "end": 293.2200012207031,
      "text": " whom do men say that I, the son of man am?"
    },
    {
      "id": 127,
      "start": 293.2200012207031,
      "end": 295.17999267578125,
      "text": " And of course, you're familiar with the response."
    },
    {
      "id": 128,
      "start": 295.17999267578125,
      "end": 297.17999267578125,
      "text": " They respond to Jesus and say,"
    },
    {
      "id": 129,
      "start": 297.17999267578125,
      "end": 299.17999267578125,
      "text": " some say that thou art John the Baptist"
    },
    {
      "id": 130,
      "start": 299.17999267578125,
      "end": 301.82000732421875,
      "text": " and some Elias and others Jeremiah's"
    },
    {
      "id": 131,
      "start": 301.82000732421875,
      "end": 302.739990234375,
      "text": " or one of the prophets."
    },
    {
      "id": 132,
      "start": 302.739990234375,
      "end": 305.82000732421875,
      "text": " And then Jesus says this in verse number 15,"
    },
    {
      "id": 133,
      "start": 305.82000732421875,
      "end": 308.6199951171875,
      "text": " but whom say ye that I am?"
    },
    {
      "id": 134,
      "start": 308.6199951171875,
      "end": 310.8599853515625,
      "text": " And here's Peter and man,"
    },
    {
      "id": 135,
      "start": 310.8599853515625,
      "end": 314.29998779296875,
      "text": " what a bold, precious declaration."
    },
    {
      "id": 136,
      "start": 314.29998779296875,
      "end": 318.9800109863281,
      "text": " He says this, thou art the Christ,"
    },
    {
      "id": 137,
      "start": 318.9800109863281,
      "end": 322.29998779296875,
      "text": " the son of the living God."
    },
    {
      "id": 138,
      "start": 322.29998779296875,
      "end": 324.6199951171875,
      "text": " And Jesus says to Peter,"
    },
    {
      "id": 139,
      "start": 324.6199951171875,
      "end": 326.5,
      "text": " he says this in verse number 17,"
    },
    {
      "id": 140,
      "start": 326.5,
      "end": 328.739990234375,
      "text": " blessed art thou Simon Barjona"
    },
    {
      "id": 141,
      "start": 328.739990234375,
      "end": 331.2200012207031,
      "text": " for flesh and blood hath not revealed it unto thee,"
    },
    {
      "id": 142,
      "start": 331.2200012207031,
      "end": 333.05999755859375,
      "text": " but my father, which is in heaven."
    },
    {
      "id": 143,
      "start": 333.05999755859375,
      "end": 335.3800048828125,
      "text": " And I say also unto thee that thou art Peter"
    },
    {
      "id": 144,
      "start": 335.3800048828125,
      "end": 337.3399963378906,
      "text": " and upon this rock, I will build my church"
    },
    {
      "id": 145,
      "start": 337.3399963378906,
      "end": 339.9800109863281,
      "text": " and the gates of hell shall not prevail against it."
    },
    {
      "id": 146,
      "start": 339.9800109863281,
      "end": 342.6600036621094,
      "text": " And I will give unto thee the keys of the kingdom of heaven."
    },
    {
      "id": 147,
      "start": 342.6600036621094,
      "end": 344.17999267578125,
      "text": " What sort of thou shalt bind on earth"
    },
    {
      "id": 148,
      "start": 344.17999267578125,
      "end": 345.17999267578125,
      "text": " shall be bound in heaven."
    },
    {
      "id": 149,
      "start": 345.17999267578125,
      "end": 346.9800109863281,
      "text": " And what sort of thou shalt loose on earth"
    },
    {
      "id": 150,
      "start": 346.9800109863281,
      "end": 348.2200012207031,
      "text": " shall be loosed in heaven,"
    },
    {
      "id": 151,
      "start": 348.2200012207031,
      "end": 351.0799865722656,
      "text": " then charged to his disciples that they should tell no man"
    },
    {
      "id": 152,
      "start": 351.0799865722656,
      "end": 353.9800109863281,
      "text": " that he was Jesus the Christ."
    },
    {
      "id": 153,
      "start": 353.9800109863281,
      "end": 356.1000061035156,
      "text": " But I wanna draw your attention to verse 21."
    },
    {
      "id": 154,
      "start": 356.1000061035156,
      "end": 357.3399963378906,
      "text": " I want you to think about the excitement,"
    },
    {
      "id": 155,
      "start": 357.3399963378906,
      "end": 358.3399963378906,
      "text": " all that's taken place,"
    },
    {
      "id": 156,
      "start": 358.3399963378906,
      "end": 360.6199951171875,
      "text": " the promises that Jesus has given here,"
    },
    {
      "id": 157,
      "start": 360.6199951171875,
      "end": 362.6600036621094,
      "text": " that great declaration of Peter."
    },
    {
      "id": 158,
      "start": 362.6600036621094,
      "end": 364.9800109863281,
      "text": " We often refer to the promise of verse number 18"
    },
    {
      "id": 159,
      "start": 364.9800109863281,
      "end": 367.1400146484375,
      "text": " when Jesus says, I will build my church"
    },
    {
      "id": 160,
      "start": 367.1400146484375,
      "end": 369.3399963378906,
      "text": " and what a blessing to see God working"
    },
    {
      "id": 161,
      "start": 369.3399963378906,
      "end": 371.5799865722656,
      "text": " and continuing to do that to this very day."
    },
    {
      "id": 162,
      "start": 371.5799865722656,
      "end": 374.05999755859375,
      "text": " And he's promised to do so until the rapture"
    },
    {
      "id": 163,
      "start": 374.05999755859375,
      "end": 376.20001220703125,
      "text": " when the church is taken out of here."
    },
    {
      "id": 164,
      "start": 376.20001220703125,
      "end": 379.2200012207031,
      "text": " But notice what Jesus says in verse 21,"
    },
    {
      "id": 165,
      "start": 379.2200012207031,
      "end": 383.6000061035156,
      "text": " from that time forth began Jesus"
    },
    {
      "id": 166,
      "start": 383.6000061035156,
      "end": 384.9599914550781,
      "text": " to show unto his disciples."
    },
    {
      "id": 167,
      "start": 384.9599914550781,
      "end": 387.70001220703125,
      "text": " Now think about Peter and think about what he's experienced"
    },
    {
      "id": 168,
      "start": 387.70001220703125,
      "end": 389.3800048828125,
      "text": " and think about that statement that he makes"
    },
    {
      "id": 169,
      "start": 389.3800048828125,
      "end": 391.4200134277344,
      "text": " in first Peter five in verse number one,"
    },
    {
      "id": 170,
      "start": 391.4200134277344,
      "end": 394.29998779296875,
      "text": " that he is a witness of the sufferings of Christ."
    },
    {
      "id": 171,
      "start": 394.29998779296875,
      "end": 397.17999267578125,
      "text": " Here in verse number 21, the Bible says that Jesus"
    },
    {
      "id": 172,
      "start": 397.17999267578125,
      "end": 400.0199890136719,
      "text": " beginning at that time and going forth,"
    },
    {
      "id": 173,
      "start": 400.0199890136719,
      "end": 403.6199951171875,
      "text": " he's beginning to reveal, to show to his disciples what?"
    },
    {
      "id": 174,
      "start": 403.6199951171875,
      "end": 407.82000732421875,
      "text": " How that he must go unto Jerusalem and what?"
    },
    {
      "id": 175,
      "start": 407.82000732421875,
      "end": 412.5799865722656,
      "text": " And suffer many things of the elders"
    },
    {
      "id": 176,
      "start": 412.5799865722656,
      "end": 415.79998779296875,
      "text": " and chief priests and scribes, notice,"
    },
    {
      "id": 177,
      "start": 415.79998779296875,
      "end": 420.79998779296875,
      "text": " and be killed and be raised again the third day."
    },
    {
      "id": 178,
      "start": 421.94000244140625,
      "end": 424.4200134277344,
      "text": " Was at that time in the life and ministry"
    },
    {
      "id": 179,
      "start": 424.4200134277344,
      "end": 426.4599914550781,
      "text": " of the Lord Jesus Christ, was at that time"
    },
    {
      "id": 180,
      "start": 426.4599914550781,
      "end": 428.5799865722656,
      "text": " that Peter as one of his followers,"
    },
    {
      "id": 181,
      "start": 428.6199951171875,
      "end": 431.82000732421875,
      "text": " as one of the disciples, begins to receive"
    },
    {
      "id": 182,
      "start": 431.82000732421875,
      "end": 434.5,
      "text": " this instruction from Jesus with regard"
    },
    {
      "id": 183,
      "start": 434.5,
      "end": 436.7200012207031,
      "text": " to how he would suffer many things."
    },
    {
      "id": 184,
      "start": 436.7200012207031,
      "end": 439.7200012207031,
      "text": " Yes, he would be killed, he would go to that cruel tree,"
    },
    {
      "id": 185,
      "start": 439.7200012207031,
      "end": 441.739990234375,
      "text": " he would go to the cross of Calvary,"
    },
    {
      "id": 186,
      "start": 441.739990234375,
      "end": 444.17999267578125,
      "text": " and he would suffer and bleed and die,"
    },
    {
      "id": 187,
      "start": 444.17999267578125,
      "end": 446.9800109863281,
      "text": " but he would rise in victory."
    },
    {
      "id": 188,
      "start": 446.9800109863281,
      "end": 448.9800109863281,
      "text": " And we'll look at that in two weeks."
    },
    {
      "id": 189,
      "start": 448.9800109863281,
      "end": 450.9200134277344,
      "text": " But I want you to think about these sufferings"
    },
    {
      "id": 190,
      "start": 450.9200134277344,
      "end": 452.8599853515625,
      "text": " and the record of his suffering."
    },
    {
      "id": 191,
      "start": 452.8599853515625,
      "end": 455.6600036621094,
      "text": " Turn to the book of Luke, if you will, in chapter 22."
    },
    {
      "id": 192,
      "start": 455.6600036621094,
      "end": 457.6600036621094,
      "text": " And we're gonna stick here in Luke here"
    },
    {
      "id": 193,
      "start": 457.6600036621094,
      "end": 459.6199951171875,
      "text": " for just a little while as we complete"
    },
    {
      "id": 194,
      "start": 459.6199951171875,
      "end": 461.05999755859375,
      "text": " this point this morning."
    },
    {
      "id": 195,
      "start": 461.05999755859375,
      "end": 464.1400146484375,
      "text": " But look at Luke chapter number 22, if you will,"
    },
    {
      "id": 196,
      "start": 464.1400146484375,
      "end": 467.0199890136719,
      "text": " at some time has passed in the life and ministry"
    },
    {
      "id": 197,
      "start": 467.0199890136719,
      "end": 468.6199951171875,
      "text": " of the Lord Jesus Christ."
    },
    {
      "id": 198,
      "start": 468.6199951171875,
      "end": 470.9800109863281,
      "text": " And we find that it's in Luke chapter number 22"
    },
    {
      "id": 199,
      "start": 470.9800109863281,
      "end": 473.739990234375,
      "text": " that God records for us the record"
    },
    {
      "id": 200,
      "start": 473.739990234375,
      "end": 475.8999938964844,
      "text": " of what we'd refer to as the Lord's Supper."
    },
    {
      "id": 201,
      "start": 475.8999938964844,
      "end": 479.2200012207031,
      "text": " And as the record is given to us here in Luke's gospel,"
    },
    {
      "id": 202,
      "start": 479.2200012207031,
      "end": 481.9800109863281,
      "text": " the Bible tells us beginning in verse number 13,"
    },
    {
      "id": 203,
      "start": 481.9800109863281,
      "end": 484.5400085449219,
      "text": " and they went and found as he had said unto them,"
    },
    {
      "id": 204,
      "start": 484.5400085449219,
      "end": 488.4200134277344,
      "text": " and they made ready the Passover, verse 14 of Luke 22."
    },
    {
      "id": 205,
      "start": 488.4200134277344,
      "end": 489.6600036621094,
      "text": " And when the hour was come,"
    },
    {
      "id": 206,
      "start": 489.6600036621094,
      "end": 492.8999938964844,
      "text": " he sat down and the 12 apostles with him,"
    },
    {
      "id": 207,
      "start": 492.8999938964844,
      "end": 495.5799865722656,
      "text": " and he said unto them, notice what he says,"
    },
    {
      "id": 208,
      "start": 495.5799865722656,
      "end": 500.5799865722656,
      "text": " with desire, I have desired to eat this Passover with you"
    },
    {
      "id": 209,
      "start": 500.739990234375,
      "end": 503.8800048828125,
      "text": " before I suffer."
    },
    {
      "id": 210,
      "start": 503.8800048828125,
      "end": 505.9200134277344,
      "text": " Before I suffer."
    },
    {
      "id": 211,
      "start": 505.9200134277344,
      "end": 508.1400146484375,
      "text": " The record of his suffering comes"
    },
    {
      "id": 212,
      "start": 508.1400146484375,
      "end": 512.02001953125,
      "text": " as we continue to look through Luke chapter number 22,"
    },
    {
      "id": 213,
      "start": 512.02001953125,
      "end": 513.3800048828125,
      "text": " and you'll see the arrest,"
    },
    {
      "id": 214,
      "start": 513.3800048828125,
      "end": 515.7000122070312,
      "text": " and you'll see the denial and all that takes place."
    },
    {
      "id": 215,
      "start": 515.7000122070312,
      "end": 519.7000122070312,
      "text": " But I wanna draw your attention to Luke chapter 22"
    },
    {
      "id": 216,
      "start": 519.7000122070312,
      "end": 521.3599853515625,
      "text": " in verse number 63."
    },
    {
      "id": 217,
      "start": 522.8599853515625,
      "end": 525.8200073242188,
      "text": " Jesus has been arrested in the garden of Gethsemane."
    },
    {
      "id": 218,
      "start": 525.8200073242188,
      "end": 528.8599853515625,
      "text": " We read of that and we find that here"
    },
    {
      "id": 219,
      "start": 528.8599853515625,
      "end": 533.0599975585938,
      "text": " as we come to the near the end of Luke chapter number 22,"
    },
    {
      "id": 220,
      "start": 533.0599975585938,
      "end": 535.5800170898438,
      "text": " that the Bible tells us of Jesus Christ"
    },
    {
      "id": 221,
      "start": 535.5800170898438,
      "end": 537.260009765625,
      "text": " being mocked and beaten."
    },
    {
      "id": 222,
      "start": 537.260009765625,
      "end": 538.9000244140625,
      "text": " He's the very son of God."
    },
    {
      "id": 223,
      "start": 538.9000244140625,
      "end": 541.0599975585938,
      "text": " He is God in flesh."
    },
    {
      "id": 224,
      "start": 541.0599975585938,
      "end": 542.3800048828125,
      "text": " He is the creator."
    },
    {
      "id": 225,
      "start": 542.3800048828125,
      "end": 544.6599731445312,
      "text": " And we find that in verse number 63,"
    },
    {
      "id": 226,
      "start": 544.6599731445312,
      "end": 548.1400146484375,
      "text": " that the Bible tells us and the men that held Jesus"
    },
    {
      "id": 227,
      "start": 548.1400146484375,
      "end": 551.5999755859375,
      "text": " mocked him and smote him."
    },
    {
      "id": 228,
      "start": 551.5999755859375,
      "end": 554.02001953125,
      "text": " The suffering is now beginning."
    },
    {
      "id": 229,
      "start": 554.02001953125,
      "end": 557.3800048828125,
      "text": " We find that it was in Matthew in chapter number 16"
    },
    {
      "id": 230,
      "start": 557.3800048828125,
      "end": 562.3800048828125,
      "text": " that Jesus declares to them how that he was going to suffer."
    },
    {
      "id": 231,
      "start": 562.739990234375,
      "end": 566.7000122070312,
      "text": " And we find that he says to them there at the Passover"
    },
    {
      "id": 232,
      "start": 566.7000122070312,
      "end": 570.02001953125,
      "text": " that he desired to have this Passover with them"
    },
    {
      "id": 233,
      "start": 570.02001953125,
      "end": 571.52001953125,
      "text": " before I suffer."
    },
    {
      "id": 234,
      "start": 571.52001953125,
      "end": 574.2000122070312,
      "text": " And now as we come to verse number 63,"
    },
    {
      "id": 235,
      "start": 574.2000122070312,
      "end": 576.719970703125,
      "text": " we begin to see the suffering."
    },
    {
      "id": 236,
      "start": 576.719970703125,
      "end": 578.219970703125,
      "text": " He's mocked."
    },
    {
      "id": 237,
      "start": 578.219970703125,
      "end": 580.0399780273438,
      "text": " He's smitten."
    },
    {
      "id": 238,
      "start": 580.0399780273438,
      "end": 582.9600219726562,
      "text": " The Bible says in verse 64,"
    },
    {
      "id": 239,
      "start": 582.9600219726562,
      "end": 584.8800048828125,
      "text": " and when they had blindfolded him,"
    },
    {
      "id": 240,
      "start": 585.9199829101562,
      "end": 587.9199829101562,
      "text": " they struck him on the face."
    },
    {
      "id": 241,
      "start": 589.760009765625,
      "end": 591.6400146484375,
      "text": " Notice what they say."
    },
    {
      "id": 242,
      "start": 591.6400146484375,
      "end": 593.52001953125,
      "text": " Prophesy."
    },
    {
      "id": 243,
      "start": 593.52001953125,
      "end": 595.9600219726562,
      "text": " Who is it that smote thee?"
    },
    {
      "id": 244,
      "start": 595.9600219726562,
      "end": 597.8400268554688,
      "text": " You know what's amazing is he knew exactly"
    },
    {
      "id": 245,
      "start": 597.8400268554688,
      "end": 599.2000122070312,
      "text": " who it was that smote him."
    },
    {
      "id": 0,
      "start": 599.2000122070312,
      "end": 605.6600122451782,
      "text": " Can you see the suffering beginning?"
    },
    {
      "id": 1,
      "start": 605.6600122451782,
      "end": 613.0000123977661,
      "text": " When they take the Son of God, my Savior, your Savior, they've arrested Him."
    },
    {
      "id": 2,
      "start": 613.0000123977661,
      "end": 618.3200130462646,
      "text": " They begin to mock Him and they blindfold Him and they beat Him."
    },
    {
      "id": 3,
      "start": 618.3200130462646,
      "end": 624.5600128173828,
      "text": " The Bible says that they struck Him on the face."
    },
    {
      "id": 4,
      "start": 624.5600128173828,
      "end": 628.0000114440918,
      "text": " And they say, prophesy."
    },
    {
      "id": 5,
      "start": 628.0000114440918,
      "end": 630.4000129699707,
      "text": " Who is it that smote thee?"
    },
    {
      "id": 6,
      "start": 630.4000129699707,
      "end": 638.3600120544434,
      "text": " Look at verse 65, and many other things blasphemously spake they against Him."
    },
    {
      "id": 7,
      "start": 638.3600120544434,
      "end": 642.8000106811523,
      "text": " He stands before the Sanhedrin at the end of chapter 22 and chapter 23."
    },
    {
      "id": 8,
      "start": 642.8000106811523,
      "end": 646.940013885498,
      "text": " It begins when He's standing there before Pilate and then Herod because Pilate learns"
    },
    {
      "id": 9,
      "start": 646.940013885498,
      "end": 652.1600112915039,
      "text": " that he's of the region in which Herod is in control of there, of Galilee."
    },
    {
      "id": 10,
      "start": 652.1600112915039,
      "end": 655.5400123596191,
      "text": " We find that Herod and Pilate are made friends that day."
    },
    {
      "id": 11,
      "start": 655.5400123596191,
      "end": 659.5200119018555,
      "text": " According to verse number 12, they had been before at enmity and they're made friends"
    },
    {
      "id": 12,
      "start": 659.5200119018555,
      "end": 660.9200134277344,
      "text": " according to verse number 12."
    },
    {
      "id": 13,
      "start": 660.9200134277344,
      "end": 666.6800155639648,
      "text": " And then Jesus is again before Pilate in verse 13 down through verse number 25."
    },
    {
      "id": 14,
      "start": 666.6800155639648,
      "end": 671.6800155639648,
      "text": " And we find that as we continue in chapter number 23 that we come to verse number 26"
    },
    {
      "id": 15,
      "start": 671.6800155639648,
      "end": 676.8000106811523,
      "text": " as it begins to describe to us the crucifixion."
    },
    {
      "id": 16,
      "start": 676.8000106811523,
      "end": 680.6400146484375,
      "text": " As they arrested Him and they mocked Him and they beat Him, and then He stands before the"
    },
    {
      "id": 17,
      "start": 680.6400146484375,
      "end": 686.760009765625,
      "text": " Sanhedrin and before Pilate and Herod and then Pilate, and then we find that as Pilate"
    },
    {
      "id": 18,
      "start": 686.760009765625,
      "end": 696.8400115966797,
      "text": " was ready to release Jesus, the crowd cried out and said, no, we'll take Barabbas."
    },
    {
      "id": 19,
      "start": 696.8400115966797,
      "end": 700.5200119018555,
      "text": " As for this one Jesus, crucify Him."
    },
    {
      "id": 20,
      "start": 700.5200119018555,
      "end": 704.9600143432617,
      "text": " And Pilate says, I find no fault in this man."
    },
    {
      "id": 21,
      "start": 704.9600143432617,
      "end": 712.2400131225586,
      "text": " And they cry out the more, crucify Him, crucify Him."
    },
    {
      "id": 22,
      "start": 712.2400131225586,
      "end": 718.6400146484375,
      "text": " The Bible begins to declare to us, look if you will, in verse 33, when they were come"
    },
    {
      "id": 23,
      "start": 718.6400146484375,
      "end": 728.6400146484375,
      "text": " to the place which is called Calvary, aren't you thankful for Calvary?"
    },
    {
      "id": 24,
      "start": 728.6400146484375,
      "end": 731.2800140380859,
      "text": " It says there they crucified Him."
    },
    {
      "id": 25,
      "start": 731.2800140380859,
      "end": 736.4000091552734,
      "text": " That's a simple statement."
    },
    {
      "id": 26,
      "start": 736.4000091552734,
      "end": 743.5600128173828,
      "text": " But the suffering of crucifixion is beyond what I can adequately describe to you this"
    },
    {
      "id": 27,
      "start": 743.5600128173828,
      "end": 744.9200134277344,
      "text": " morning."
    },
    {
      "id": 28,
      "start": 744.9200134277344,
      "end": 753.6800079345703,
      "text": " The Romans had sought to perfect the art, quote-unquote, of crucifixion to make it as"
    },
    {
      "id": 29,
      "start": 753.6800079345703,
      "end": 760.3200073242188,
      "text": " miserable and as painful as they could possibly do."
    },
    {
      "id": 30,
      "start": 760.3600158691406,
      "end": 767.4400177001953,
      "text": " How many times they would crucify these individuals and they would seek to draw it out for as"
    },
    {
      "id": 31,
      "start": 767.4400177001953,
      "end": 773.1200103759766,
      "text": " long as they possibly could to extend the period of suffering."
    },
    {
      "id": 32,
      "start": 773.1200103759766,
      "end": 777.1200103759766,
      "text": " It's unbelievable."
    },
    {
      "id": 33,
      "start": 777.1200103759766,
      "end": 781.9200134277344,
      "text": " We would use this word perhaps, it's inhumane."
    },
    {
      "id": 34,
      "start": 781.9200134277344,
      "end": 786.4800109863281,
      "text": " It's the suffering of the cross."
    },
    {
      "id": 35,
      "start": 786.4800109863281,
      "end": 787.9600067138672,
      "text": " It's a simple statement."
    },
    {
      "id": 36,
      "start": 787.9600067138672,
      "end": 790.5600128173828,
      "text": " There they crucified Him."
    },
    {
      "id": 37,
      "start": 790.5600128173828,
      "end": 796.5600128173828,
      "text": " But all that that entails, the male factors, one on the right hand, the other on the left,"
    },
    {
      "id": 38,
      "start": 796.5600128173828,
      "end": 809.7200164794922,
      "text": " verse 34, then said Jesus, Father forgive them, for they know not what they do."
    },
    {
      "id": 39,
      "start": 809.7200164794922,
      "end": 814.9200134277344,
      "text": " They parted His raiment, they cast lots, the people stood beholding and the rulers also"
    },
    {
      "id": 40,
      "start": 814.9200134277344,
      "end": 822.3200073242188,
      "text": " with them derided Him saying, notice what they say, He saved others, let Him save Himself."
    },
    {
      "id": 41,
      "start": 822.3200073242188,
      "end": 828.6800079345703,
      "text": " If He be the Christ, the chosen of God, the soldiers also mocked Him, coming to Him and"
    },
    {
      "id": 42,
      "start": 828.6800079345703,
      "end": 835.0000152587891,
      "text": " offering Him vinegar and saying, if Thou be the King of the Jews, save Thyself."
    },
    {
      "id": 43,
      "start": 835.0000152587891,
      "end": 839.9200134277344,
      "text": " Aren't you thankful that He stayed on the cross?"
    },
    {
      "id": 44,
      "start": 839.9200134277344,
      "end": 850.8400115966797,
      "text": " He saved others, but He stayed on that cross to save us from sin, to pay the awful penalty,"
    },
    {
      "id": 45,
      "start": 850.8400115966797,
      "end": 855.0000152587891,
      "text": " to shed His precious blood."
    },
    {
      "id": 46,
      "start": 855.0000152587891,
      "end": 858.9200134277344,
      "text": " I'm so thankful that He stayed on the cross."
    },
    {
      "id": 47,
      "start": 858.9200134277344,
      "end": 863.6800231933594,
      "text": " We've often said over the years that it was love that held Him there."
    },
    {
      "id": 48,
      "start": 863.6800231933594,
      "end": 868.760009765625,
      "text": " He says that He could have called legions of angels."
    },
    {
      "id": 49,
      "start": 868.760009765625,
      "end": 873.1200256347656,
      "text": " It was for this purpose that Jesus came to earth."
    },
    {
      "id": 50,
      "start": 873.1200256347656,
      "end": 875.4800109863281,
      "text": " He came to die."
    },
    {
      "id": 51,
      "start": 875.4800109863281,
      "end": 882.0,
      "text": " And the Bible records for us the sufferings of our Lord and Savior, Jesus Christ."
    },
    {
      "id": 52,
      "start": 882.0,
      "end": 890.4800109863281,
      "text": " And Peter says that He is, yes, an elder, but he says, I'm a witness of the sufferings"
    },
    {
      "id": 53,
      "start": 890.4800109863281,
      "end": 892.4000244140625,
      "text": " of Christ."
    },
    {
      "id": 54,
      "start": 892.4000244140625,
      "end": 897.8000183105469,
      "text": " And this morning as we take just a few moments and consider the record that God has given,"
    },
    {
      "id": 55,
      "start": 897.8400268554688,
      "end": 903.0800170898438,
      "text": " of course, you can read in all four of the Gospels, you can read the record of the suffering"
    },
    {
      "id": 56,
      "start": 903.0800170898438,
      "end": 907.2400207519531,
      "text": " of the cross of Calvary."
    },
    {
      "id": 57,
      "start": 907.2400207519531,
      "end": 910.0800170898438,
      "text": " I want you to continue thinking about this this morning."
    },
    {
      "id": 58,
      "start": 910.0800170898438,
      "end": 914.1200256347656,
      "text": " I want you to consider the reason for His suffering."
    },
    {
      "id": 59,
      "start": 914.1200256347656,
      "end": 918.5599975585938,
      "text": " Yes, the Bible records for us His suffering, but I want you to think about the reason."
    },
    {
      "id": 60,
      "start": 918.5599975585938,
      "end": 921.5599975585938,
      "text": " It could be summed up in one word, me."
    },
    {
      "id": 61,
      "start": 921.5599975585938,
      "end": 923.2400207519531,
      "text": " Each of us could say, He suffered."
    },
    {
      "id": 62,
      "start": 923.2400207519531,
      "end": 924.2400207519531,
      "text": " Why?"
    },
    {
      "id": 63,
      "start": 924.2400207519531,
      "end": 925.2400207519531,
      "text": " For me."
    },
    {
      "id": 64,
      "start": 925.2400207519531,
      "end": 928.1200256347656,
      "text": " I suffered to pay for my sin."
    },
    {
      "id": 65,
      "start": 928.1200256347656,
      "end": 932.4800109863281,
      "text": " And we find here this morning, turn to the book of 1 Peter, if you will, and I want to"
    },
    {
      "id": 66,
      "start": 932.4800109863281,
      "end": 937.760009765625,
      "text": " draw your attention to various aspects of what Peter says before he comes to that fifth"
    },
    {
      "id": 67,
      "start": 937.760009765625,
      "end": 942.0800170898438,
      "text": " chapter and says that he is a witness of the sufferings of Christ."
    },
    {
      "id": 68,
      "start": 942.0800170898438,
      "end": 946.9200134277344,
      "text": " I want you to notice that he speaks of the sufferings of Christ prior to that statement"
    },
    {
      "id": 69,
      "start": 946.9200134277344,
      "end": 951.4000244140625,
      "text": " here in the book of 1 Peter, beginning in chapter number two."
    },
    {
      "id": 70,
      "start": 951.4000244140625,
      "end": 956.1200256347656,
      "text": " In 1 Peter chapter number two, in verse number 20, notice what the word of God says with"
    },
    {
      "id": 71,
      "start": 956.1200256347656,
      "end": 959.3200073242188,
      "text": " regard to the suffering of the Lord Jesus Christ."
    },
    {
      "id": 72,
      "start": 959.3200073242188,
      "end": 965.0400085449219,
      "text": " It says, but what glory is it if when ye are, ye be buffeted for your faults, you shall"
    },
    {
      "id": 73,
      "start": 965.0400085449219,
      "end": 967.2400207519531,
      "text": " take it patiently."
    },
    {
      "id": 74,
      "start": 967.2400207519531,
      "end": 973.3200073242188,
      "text": " But if when you do well and suffer for it, you take it patiently, this is acceptable"
    },
    {
      "id": 75,
      "start": 973.3200073242188,
      "end": 974.3200073242188,
      "text": " with God."
    },
    {
      "id": 76,
      "start": 974.3200073242188,
      "end": 978.4800109863281,
      "text": " Notice verse number 21, for He even here unto were ye called."
    },
    {
      "id": 77,
      "start": 978.5599975585938,
      "end": 988.0800170898438,
      "text": " Notice when he says, Christ also suffered for us, Christ also suffered for us, leaving"
    },
    {
      "id": 78,
      "start": 988.0800170898438,
      "end": 993.7200012207031,
      "text": " us an example that ye should follow His steps, who did no sin, neither was guile found in"
    },
    {
      "id": 79,
      "start": 993.7200012207031,
      "end": 997.4800109863281,
      "text": " His mouth, who when He was reviled, reviled not again."
    },
    {
      "id": 80,
      "start": 997.4800109863281,
      "end": 1002.9600219726562,
      "text": " When He suffered, He threatened not, but committed Himself to Him that judgeth righteously, who"
    },
    {
      "id": 81,
      "start": 1002.9600219726562,
      "end": 1011.0400085449219,
      "text": " His own self bear our sins in His own body on the tree, that we being dead to sin should"
    },
    {
      "id": 82,
      "start": 1011.0400085449219,
      "end": 1017.3200073242188,
      "text": " live unto righteousness, by whose stripes ye are healed."
    },
    {
      "id": 83,
      "start": 1017.3200073242188,
      "end": 1023.2799987792969,
      "text": " For ye were as sheep going astray, but are now returned unto the shepherd and bishop"
    },
    {
      "id": 84,
      "start": 1023.2799987792969,
      "end": 1024.7400207519531,
      "text": " of your souls."
    },
    {
      "id": 85,
      "start": 1024.7400207519531,
      "end": 1031.1200256347656,
      "text": " Look in chapter number three, in verse number 18, where the Bible says this, for Christ"
    },
    {
      "id": 86,
      "start": 1031.1200256347656,
      "end": 1042.9800109863281,
      "text": " also hath once suffered for sins, the just Jesus for the unjust humankind."
    },
    {
      "id": 87,
      "start": 1042.9800109863281,
      "end": 1049.5599975585938,
      "text": " The just for the unjust, that He might bring us to God, being put to death in the flesh,"
    },
    {
      "id": 88,
      "start": 1049.5599975585938,
      "end": 1051.3600158691406,
      "text": " but quickened by the Spirit."
    },
    {
      "id": 89,
      "start": 1051.3600158691406,
      "end": 1055.4800109863281,
      "text": " That truth of reconciliation, that truth of redemption."
    },
    {
      "id": 90,
      "start": 1055.4800109863281,
      "end": 1061.0400085449219,
      "text": " Listen, there's no way for man to be redeemed, but through the precious blood of Jesus Christ,"
    },
    {
      "id": 91,
      "start": 1061.0400085449219,
      "end": 1065.8400268554688,
      "text": " that required suffering for you and for me and for humanity."
    },
    {
      "id": 92,
      "start": 1065.8400268554688,
      "end": 1072.5599975585938,
      "text": " The Lord Jesus Christ, God in flesh, though He was rich, yet for our sakes He became poor."
    },
    {
      "id": 93,
      "start": 1072.5599975585938,
      "end": 1079.52001953125,
      "text": " He humbled Himself and became obedient unto death, even the death of the cross."
    },
    {
      "id": 94,
      "start": 1079.52001953125,
      "end": 1081.8800048828125,
      "text": " We find the reason for the suffering."
    },
    {
      "id": 95,
      "start": 1081.8800048828125,
      "end": 1087.6400146484375,
      "text": " Peter says that He once suffered for our sins, that why, the just for the unjust, that He"
    },
    {
      "id": 96,
      "start": 1087.6400146484375,
      "end": 1089.3600158691406,
      "text": " might bring us to God."
    },
    {
      "id": 97,
      "start": 1089.9200134277344,
      "end": 1092.1200256347656,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 98,
      "start": 1092.1200256347656,
      "end": 1096.8400268554688,
      "text": " Chapter four, notice what he says in verse number one of 1 Peter chapter four, for as"
    },
    {
      "id": 99,
      "start": 1096.8400268554688,
      "end": 1102.8400268554688,
      "text": " much then as Christ hath suffered for us in the flesh, arm yourselves likewise with the"
    },
    {
      "id": 100,
      "start": 1102.8400268554688,
      "end": 1108.5599975585938,
      "text": " same mind, for he that hath suffered in the flesh hath ceased from sin."
    },
    {
      "id": 101,
      "start": 1108.5599975585938,
      "end": 1114.6400146484375,
      "text": " You know, Peter understood that Jesus suffered all that He did in order to pay for the penalty"
    },
    {
      "id": 102,
      "start": 1114.6400146484375,
      "end": 1116.0800170898438,
      "text": " of sin."
    },
    {
      "id": 103,
      "start": 1116.0800170898438,
      "end": 1119.2000122070312,
      "text": " There's no other payment that was accepted."
    },
    {
      "id": 104,
      "start": 1119.2000122070312,
      "end": 1125.239990234375,
      "text": " God in His wisdom, He had determined before the foundation of the world, Peter deals with"
    },
    {
      "id": 105,
      "start": 1125.239990234375,
      "end": 1129.9600219726562,
      "text": " this truth as well, that Jesus is the Lamb that was slain before the foundation of the"
    },
    {
      "id": 106,
      "start": 1129.9600219726562,
      "end": 1130.9600219726562,
      "text": " world."
    },
    {
      "id": 107,
      "start": 1130.9600219726562,
      "end": 1138.4000244140625,
      "text": " And we find that God in His grace and His mercy, He had prescribed that this is the"
    },
    {
      "id": 108,
      "start": 1138.4000244140625,
      "end": 1142.1199951171875,
      "text": " only way by which man can be redeemed."
    },
    {
      "id": 109,
      "start": 1142.1199951171875,
      "end": 1148.280029296875,
      "text": " And Jesus was willing to go to that cross to suffer."
    },
    {
      "id": 110,
      "start": 1148.3599853515625,
      "end": 1155.7200317382812,
      "text": " And Peter says, I'm a witness of the sufferings of Christ, I'm a witness of the sufferings"
    },
    {
      "id": 111,
      "start": 1155.7200317382812,
      "end": 1156.7200317382812,
      "text": " of Christ."
    },
    {
      "id": 112,
      "start": 1156.7200317382812,
      "end": 1161.4800415039062,
      "text": " See, Peter had this understanding that Jesus was fulfilling that which had been prophesied."
    },
    {
      "id": 113,
      "start": 1161.4800415039062,
      "end": 1165.6799926757812,
      "text": " In fact, at the end of chapter number two of 1 Peter, really he's referencing there"
    },
    {
      "id": 114,
      "start": 1165.6799926757812,
      "end": 1168.5599975585938,
      "text": " the truth of Isaiah 53."
    },
    {
      "id": 115,
      "start": 1168.5599975585938,
      "end": 1171.6000366210938,
      "text": " Hold your place there in the book of, actually we're going to go back to the book of Acts,"
    },
    {
      "id": 116,
      "start": 1171.6000366210938,
      "end": 1174.7200317382812,
      "text": " so you don't need to hold your place there in 1 Peter, but go over to Isaiah 53, if"
    },
    {
      "id": 117,
      "start": 1174.7200317382812,
      "end": 1180.1199951171875,
      "text": " you will, a portion of Scripture that is familiar to many of us."
    },
    {
      "id": 118,
      "start": 1180.1199951171875,
      "end": 1189.3599853515625,
      "text": " Isaiah 53, some have described this chapter as being the chapter of the suffering Savior."
    },
    {
      "id": 119,
      "start": 1189.3599853515625,
      "end": 1194.239990234375,
      "text": " And here we find in Isaiah 53, beginning in verse number four, notice the Bible says,"
    },
    {
      "id": 120,
      "start": 1194.239990234375,
      "end": 1199.280029296875,
      "text": " Surely He hath borne our griefs and carried our sorrows."
    },
    {
      "id": 0,
      "start": 1199.280029296875,
      "end": 1204.9600291252136,
      "text": " Yet, we did esteem him stricken, smitten of God, and afflicted."
    },
    {
      "id": 1,
      "start": 1204.9600291252136,
      "end": 1208.820029258728,
      "text": " Notice he was wounded for our transgressions."
    },
    {
      "id": 2,
      "start": 1208.820029258728,
      "end": 1211.0400295257568,
      "text": " He was bruised for our iniquities."
    },
    {
      "id": 3,
      "start": 1211.0400295257568,
      "end": 1217.8000297546387,
      "text": " The chastisement of our peace was upon him, and with his stripes we are healed."
    },
    {
      "id": 4,
      "start": 1217.8000297546387,
      "end": 1222.2200298309326,
      "text": " All we like sheep have gone astray, we have turned everyone to his own way."
    },
    {
      "id": 5,
      "start": 1222.2200298309326,
      "end": 1228.1000289916992,
      "text": " The Lord hath laid on him the iniquity of us all.\""
    },
    {
      "id": 6,
      "start": 1228.1000289916992,
      "end": 1234.2400283813477,
      "text": " What's interesting for Peter is used by God in the book of Acts as a leader in the first"
    },
    {
      "id": 7,
      "start": 1234.2400283813477,
      "end": 1235.2400283813477,
      "text": " century church."
    },
    {
      "id": 8,
      "start": 1235.2400283813477,
      "end": 1237.5200309753418,
      "text": " And turn over to Acts 3, if you will."
    },
    {
      "id": 9,
      "start": 1237.5200309753418,
      "end": 1242.8000297546387,
      "text": " You find that Peter is understanding even this prophecy that we read of in Isaiah 53,"
    },
    {
      "id": 10,
      "start": 1242.8000297546387,
      "end": 1247.6400299072266,
      "text": " and it's evidence that he's understanding the fulfillment of this prophecy through the"
    },
    {
      "id": 11,
      "start": 1247.6400299072266,
      "end": 1253.3200302124023,
      "text": " suffering of the Lord Jesus Christ as he gives an answer in Acts chapter number 3."
    },
    {
      "id": 12,
      "start": 1253.3200302124023,
      "end": 1257.8000297546387,
      "text": " Now Acts chapter number 3, many of you will be familiar with the passage of Scripture."
    },
    {
      "id": 13,
      "start": 1257.8000297546387,
      "end": 1263.680030822754,
      "text": " It's that miracle that takes place when that lame man was laying there at the gate, beautiful."
    },
    {
      "id": 14,
      "start": 1263.680030822754,
      "end": 1267.4400329589844,
      "text": " Remember, Peter says to him, he's asking alms, and he says,"
    },
    {
      "id": 15,
      "start": 1267.4400329589844,
      "end": 1273.0800323486328,
      "text": " \"'Silver and gold have I none, but such as I have, in the name of Jesus Christ of Nazareth,"
    },
    {
      "id": 16,
      "start": 1273.0800323486328,
      "end": 1274.9200286865234,
      "text": " rise up and walk.'\""
    },
    {
      "id": 17,
      "start": 1274.9200286865234,
      "end": 1281.660026550293,
      "text": " And man, this guy, he was healed, and he's leaping, and he's going, walking, and leaping,"
    },
    {
      "id": 18,
      "start": 1281.660026550293,
      "end": 1284.0800323486328,
      "text": " and praising God with them into the temple."
    },
    {
      "id": 19,
      "start": 1284.0800323486328,
      "end": 1285.5200271606445,
      "text": " It's interesting in verse number 9, it says,"
    },
    {
      "id": 20,
      "start": 1285.5200271606445,
      "end": 1290.280029296875,
      "text": " \"'And all the people saw him walking and praising God, and they knew that it was he"
    },
    {
      "id": 21,
      "start": 1290.280029296875,
      "end": 1294.5200271606445,
      "text": " which sat for alms at the beautiful gate of the temple, and they were filled with wonder"
    },
    {
      "id": 22,
      "start": 1294.5200271606445,
      "end": 1298.9600296020508,
      "text": " and amazement at that which had happened unto him.'\""
    },
    {
      "id": 23,
      "start": 1298.9600296020508,
      "end": 1303.2400283813477,
      "text": " In the next passage of Scripture through the end of chapter number 3, we find that Peter's"
    },
    {
      "id": 24,
      "start": 1303.2400283813477,
      "end": 1307.6000289916992,
      "text": " going to preach a message, and we find that as he preaches that message, he's going to"
    },
    {
      "id": 25,
      "start": 1307.6000289916992,
      "end": 1313.1200256347656,
      "text": " reveal this truth to us that he understood the reason for which Christ suffered."
    },
    {
      "id": 26,
      "start": 1313.160026550293,
      "end": 1317.5600280761719,
      "text": " He'll stand before the religious leaders in chapter number 4 and give testimony with"
    },
    {
      "id": 27,
      "start": 1317.5600280761719,
      "end": 1320.2400283813477,
      "text": " regard to the miracle that takes place."
    },
    {
      "id": 28,
      "start": 1320.2400283813477,
      "end": 1324.0400314331055,
      "text": " But I want you to see, as he's preaching in verse number 11, it says,"
    },
    {
      "id": 29,
      "start": 1324.0400314331055,
      "end": 1328.280029296875,
      "text": " \"'And as the lame man which was healed held Peter and John, all the people ran together"
    },
    {
      "id": 30,
      "start": 1328.280029296875,
      "end": 1333.4400329589844,
      "text": " unto them in the porch that is called Solomon's, greatly wandering, and Peter saw it."
    },
    {
      "id": 31,
      "start": 1333.4400329589844,
      "end": 1337.3600311279297,
      "text": " He answered unto the people, \"'You men of Israel, why marvel ye at this?"
    },
    {
      "id": 32,
      "start": 1337.3600311279297,
      "end": 1342.6400299072266,
      "text": " Or why look ye so earnestly on us, as though by our own power or holiness we had made this"
    },
    {
      "id": 33,
      "start": 1342.6400299072266,
      "end": 1344.2400360107422,
      "text": " man to walk?"
    },
    {
      "id": 34,
      "start": 1344.2400360107422,
      "end": 1349.0800323486328,
      "text": " No, the God of Abraham, and of Isaac, and of Jacob, the God of our fathers, hath glorified"
    },
    {
      "id": 35,
      "start": 1349.0800323486328,
      "end": 1350.4800262451172,
      "text": " his son Jesus.'\""
    },
    {
      "id": 36,
      "start": 1350.4800262451172,
      "end": 1358.1200256347656,
      "text": " Remember, I said this in 1 Peter 5.1, before the glory is the suffering."
    },
    {
      "id": 37,
      "start": 1358.1200256347656,
      "end": 1364.040023803711,
      "text": " He says that, \"'The God of our fathers hath glorified his son Jesus, whom ye delivered"
    },
    {
      "id": 38,
      "start": 1364.040023803711,
      "end": 1369.0000305175781,
      "text": " up and denied him in the presence of Pilate when he was determined to let him go."
    },
    {
      "id": 39,
      "start": 1369.0000305175781,
      "end": 1373.2400360107422,
      "text": " But ye denied the Holy One and the just, and desired a murderer to be granted unto"
    },
    {
      "id": 40,
      "start": 1373.2400360107422,
      "end": 1380.4000244140625,
      "text": " you, and killed the Prince of life, whom God hath raised from the dead, whereof we are"
    },
    {
      "id": 41,
      "start": 1380.4000244140625,
      "end": 1381.4000244140625,
      "text": " witnesses."
    },
    {
      "id": 42,
      "start": 1381.4000244140625,
      "end": 1388.4400329589844,
      "text": " And his name, through faith in his name, hath made this man strong, whom ye see and know."
    },
    {
      "id": 43,
      "start": 1388.4400329589844,
      "end": 1393.8800354003906,
      "text": " Yea, the faith which is by him hath given him this perfect soundness in the presence"
    },
    {
      "id": 44,
      "start": 1393.8800354003906,
      "end": 1394.9600219726562,
      "text": " of you all."
    },
    {
      "id": 45,
      "start": 1394.9600219726562,
      "end": 1399.3600311279297,
      "text": " And now, brethren, I want that through ignorance he did it, as did also your rulers.'\""
    },
    {
      "id": 46,
      "start": 1399.3600311279297,
      "end": 1404.760025024414,
      "text": " Notice in verse number 18, \"'But those things which God before had showed by the mouth of"
    },
    {
      "id": 47,
      "start": 1404.760025024414,
      "end": 1412.3200225830078,
      "text": " all his prophets, that Christ should suffer, he hath so fulfilled.'\""
    },
    {
      "id": 48,
      "start": 1412.3200225830078,
      "end": 1419.2400360107422,
      "text": " Listen, this morning, as we think about the suffering of the Lord Jesus Christ, we consider"
    },
    {
      "id": 49,
      "start": 1419.2400360107422,
      "end": 1422.4200286865234,
      "text": " this morning the record that God has given us."
    },
    {
      "id": 50,
      "start": 1422.4200286865234,
      "end": 1425.6200256347656,
      "text": " We consider this morning the reason for his suffering."
    },
    {
      "id": 51,
      "start": 1425.6200256347656,
      "end": 1431.9800262451172,
      "text": " And as we understand the truth of God's Word, we understand that Peter, yes, he is a witness"
    },
    {
      "id": 52,
      "start": 1431.9800262451172,
      "end": 1436.9000244140625,
      "text": " of the sufferings of Christ, and we find that he makes that declaration."
    },
    {
      "id": 53,
      "start": 1436.9000244140625,
      "end": 1441.3800354003906,
      "text": " We've not witnessed it firsthand, but we have the record of it."
    },
    {
      "id": 54,
      "start": 1441.3800354003906,
      "end": 1450.6600341796875,
      "text": " And we understand the truth that Jesus Christ, God in flesh, he did it all for me."
    },
    {
      "id": 55,
      "start": 1450.6600341796875,
      "end": 1453.3400268554688,
      "text": " He suffered."
    },
    {
      "id": 56,
      "start": 1453.3400268554688,
      "end": 1457.3800354003906,
      "text": " This morning, when we speak about suffering, when we think about suffering, and there are"
    },
    {
      "id": 57,
      "start": 1457.3800354003906,
      "end": 1462.5800170898438,
      "text": " some in our midst that have suffered greatly, you've dealt with difficulty, but can I tell"
    },
    {
      "id": 58,
      "start": 1462.5800170898438,
      "end": 1467.5000305175781,
      "text": " you this morning that the greatest that we could suffer really pales in comparison to"
    },
    {
      "id": 59,
      "start": 1467.5000305175781,
      "end": 1473.1800231933594,
      "text": " what Jesus Christ suffered for our redemption."
    },
    {
      "id": 60,
      "start": 1473.1800231933594,
      "end": 1474.8600158691406,
      "text": " He suffered it all, why?"
    },
    {
      "id": 61,
      "start": 1474.8600158691406,
      "end": 1477.3400268554688,
      "text": " Because he loved me."
    },
    {
      "id": 62,
      "start": 1477.3400268554688,
      "end": 1482.7400207519531,
      "text": " How appropriate the song that Kimberly and Pierre played this morning, how deep the Father's"
    },
    {
      "id": 63,
      "start": 1482.7400207519531,
      "end": 1483.7400207519531,
      "text": " love."
    },
    {
      "id": 64,
      "start": 1483.7400207519531,
      "end": 1494.7400207519531,
      "text": " Oh man, I think about the love of God as it's demonstrated on that cruel cross, the suffering"
    },
    {
      "id": 65,
      "start": 1494.7400207519531,
      "end": 1495.7400207519531,
      "text": " for me and for you."
    },
    {
      "id": 66,
      "start": 1495.7400207519531,
      "end": 1501.9800415039062,
      "text": " I want you to think about, as we finish up this morning, the result of this suffering."
    },
    {
      "id": 67,
      "start": 1501.9800415039062,
      "end": 1507.1400146484375,
      "text": " Of course, we know it's redemption, but turn back to the book of Luke, if you will."
    },
    {
      "id": 68,
      "start": 1507.1400146484375,
      "end": 1513.1800231933594,
      "text": " We kind of walked our way through, skipping along some passages here in the book of Luke,"
    },
    {
      "id": 69,
      "start": 1513.1800231933594,
      "end": 1518.3400268554688,
      "text": " and we ended up there in chapter 23, and looking at that suffering."
    },
    {
      "id": 70,
      "start": 1518.3400268554688,
      "end": 1527.6600341796875,
      "text": " Notice if you will, in chapter 23, in verse number 46, verse 45 says that the sun was"
    },
    {
      "id": 71,
      "start": 1527.6600341796875,
      "end": 1533.2600402832031,
      "text": " dark and the veil of the temple was rent in the midst, and verse 46 of Luke 23, when Jesus"
    },
    {
      "id": 72,
      "start": 1533.2600402832031,
      "end": 1539.3800354003906,
      "text": " had cried with a loud voice, he said, Father, into thy hands I commend my spirit, and having"
    },
    {
      "id": 73,
      "start": 1539.3800354003906,
      "end": 1542.8200378417969,
      "text": " said thus, he gave up the ghost."
    },
    {
      "id": 74,
      "start": 1542.8200378417969,
      "end": 1545.1000366210938,
      "text": " He died."
    },
    {
      "id": 75,
      "start": 1545.1000366210938,
      "end": 1546.3400268554688,
      "text": " He died."
    },
    {
      "id": 76,
      "start": 1546.3400268554688,
      "end": 1550.3800354003906,
      "text": " The burial is recorded beginning in verse number 50 and down through the end of the"
    },
    {
      "id": 77,
      "start": 1550.3800354003906,
      "end": 1555.8200378417969,
      "text": " passage, and we understand that chapter 24, the beginning of this chapter, it records"
    },
    {
      "id": 78,
      "start": 1555.8200378417969,
      "end": 1561.1800231933594,
      "text": " for us the glorious truth of the resurrection of our Lord and Savior, Jesus Christ, when"
    },
    {
      "id": 79,
      "start": 1561.1800231933594,
      "end": 1566.1400146484375,
      "text": " He conquered sin, death, and the grave, and hallelujah for the resurrection."
    },
    {
      "id": 80,
      "start": 1566.1400146484375,
      "end": 1572.2600402832031,
      "text": " But I want to move down past the testimony of the resurrection, I want you to move down"
    },
    {
      "id": 81,
      "start": 1572.2600402832031,
      "end": 1574.7400207519531,
      "text": " to verse number 26, if you will."
    },
    {
      "id": 82,
      "start": 1574.7400207519531,
      "end": 1579.1800231933594,
      "text": " Here in verse number 26, we're jumping right into the dialogue that Jesus is having with"
    },
    {
      "id": 83,
      "start": 1579.1800231933594,
      "end": 1582.5400390625,
      "text": " these disciples on the road to Emmaus."
    },
    {
      "id": 84,
      "start": 1582.5400390625,
      "end": 1587.02001953125,
      "text": " You remember that these disciples on the road to Emmaus, they're saddened, they take this"
    },
    {
      "id": 85,
      "start": 1587.02001953125,
      "end": 1592.9000244140625,
      "text": " journey, they've left Jerusalem, and it's almost a seven-mile journey, and Jesus comes"
    },
    {
      "id": 86,
      "start": 1592.9000244140625,
      "end": 1598.8200378417969,
      "text": " and He begins to walk with them, and they're just saddened, and Jesus questions them about"
    },
    {
      "id": 87,
      "start": 1598.8200378417969,
      "end": 1602.780029296875,
      "text": " their sadness, and they say, are you a stranger in Jerusalem?"
    },
    {
      "id": 88,
      "start": 1602.780029296875,
      "end": 1606.1400146484375,
      "text": " You're not aware of the things that have happened?"
    },
    {
      "id": 89,
      "start": 1606.1400146484375,
      "end": 1607.5800170898438,
      "text": " And He asked them, what things?"
    },
    {
      "id": 90,
      "start": 1607.5800170898438,
      "end": 1611.2200317382812,
      "text": " In verse number 19, they begin to declare the things that have happened, and He says"
    },
    {
      "id": 91,
      "start": 1611.2200317382812,
      "end": 1617.3400268554688,
      "text": " in verse 25, then He said unto them, O fools and slow of heart, to believe all that the"
    },
    {
      "id": 92,
      "start": 1617.3400268554688,
      "end": 1625.8200378417969,
      "text": " prophets have spoken, ought not Christ to have suffered these things, and to enter into"
    },
    {
      "id": 93,
      "start": 1625.8200378417969,
      "end": 1627.8200378417969,
      "text": " His glory?"
    },
    {
      "id": 94,
      "start": 1627.8200378417969,
      "end": 1633.02001953125,
      "text": " It says that beginning at Moses, and all the prophets, He expounded unto them in all the"
    },
    {
      "id": 95,
      "start": 1633.02001953125,
      "end": 1636.9800415039062,
      "text": " Scriptures the things concerning Himself."
    },
    {
      "id": 96,
      "start": 1636.9800415039062,
      "end": 1640.4200439453125,
      "text": " And what a lesson that must have been."
    },
    {
      "id": 97,
      "start": 1640.6200256347656,
      "end": 1642.6200256347656,
      "text": " Can you imagine?"
    },
    {
      "id": 98,
      "start": 1642.6200256347656,
      "end": 1646.4200439453125,
      "text": " And we find that they constrained Him to stay because He was going to keep on going after"
    },
    {
      "id": 99,
      "start": 1646.4200439453125,
      "end": 1650.02001953125,
      "text": " they got home, and they said, no, the hour's late, come on, and He goes in and they're"
    },
    {
      "id": 100,
      "start": 1650.02001953125,
      "end": 1655.6600341796875,
      "text": " going to eat, and He took the bread, He blessed it and break it, and the Bible says that their"
    },
    {
      "id": 101,
      "start": 1655.6600341796875,
      "end": 1660.7000427246094,
      "text": " eyes were opened, and then He vanished out of their sight."
    },
    {
      "id": 102,
      "start": 1660.7000427246094,
      "end": 1661.7000427246094,
      "text": " You know what they did?"
    },
    {
      "id": 103,
      "start": 1661.7000427246094,
      "end": 1665.4600219726562,
      "text": " They walked back to Jerusalem, almost seven miles."
    },
    {
      "id": 104,
      "start": 1665.4600219726562,
      "end": 1670.3800354003906,
      "text": " Jared, you did 16 miles yesterday, and Tim, I think, they did a 16-mile hike yesterday,"
    },
    {
      "id": 105,
      "start": 1670.3800354003906,
      "end": 1672.9800415039062,
      "text": " these guys almost did that."
    },
    {
      "id": 106,
      "start": 1672.9800415039062,
      "end": 1673.9800415039062,
      "text": " Go back to Jerusalem."
    },
    {
      "id": 107,
      "start": 1673.9800415039062,
      "end": 1677.02001953125,
      "text": " You know, they go back with a testimony."
    },
    {
      "id": 108,
      "start": 1677.02001953125,
      "end": 1681.3800354003906,
      "text": " He is risen indeed, and exciting."
    },
    {
      "id": 109,
      "start": 1681.3800354003906,
      "end": 1686.02001953125,
      "text": " Go down to verse 46, if you will, actually pick it up in verse 44, and He said unto them,"
    },
    {
      "id": 110,
      "start": 1686.02001953125,
      "end": 1692.2600402832031,
      "text": " Jesus now speaking, these are the words which I spake unto you while I was yet with you,"
    },
    {
      "id": 111,
      "start": 1692.2600402832031,
      "end": 1693.780029296875,
      "text": " that all things must be fulfilled."
    },
    {
      "id": 112,
      "start": 1693.780029296875,
      "end": 1700.1200256347656,
      "text": " Remember we started as Peter gave that testimony that he's a witness of the sufferings of Christ,"
    },
    {
      "id": 113,
      "start": 1700.8600158691406,
      "end": 1705.5600280761719,
      "text": " and it was there after the declaration when Jesus said, who do men say that I am?"
    },
    {
      "id": 114,
      "start": 1705.5600280761719,
      "end": 1711.2400207519531,
      "text": " And some say John the Baptist, some Isaiah or Jeremiah, one of the other prophets, but"
    },
    {
      "id": 115,
      "start": 1711.2400207519531,
      "end": 1712.6400146484375,
      "text": " whom say ye that I am?"
    },
    {
      "id": 116,
      "start": 1712.6400146484375,
      "end": 1717.52001953125,
      "text": " And after Peter had given that bold declaration, thou art the Christ, the Son of the living"
    },
    {
      "id": 117,
      "start": 1717.52001953125,
      "end": 1723.52001953125,
      "text": " God, it was at that time that Jesus began to reveal to them, to show unto them the things"
    },
    {
      "id": 118,
      "start": 1723.52001953125,
      "end": 1726.2000122070312,
      "text": " that He must suffer."
    },
    {
      "id": 119,
      "start": 1726.2000122070312,
      "end": 1731.9600219726562,
      "text": " And He says here in verse 44, these are the words which I spake unto you while I was yet"
    },
    {
      "id": 120,
      "start": 1731.9600219726562,
      "end": 1737.6000366210938,
      "text": " with you, that all things must be fulfilled, which were written in the law of Moses and"
    },
    {
      "id": 121,
      "start": 1737.6000366210938,
      "end": 1741.4000244140625,
      "text": " the prophets and in the Psalms concerning me."
    },
    {
      "id": 122,
      "start": 1741.4000244140625,
      "end": 1745.3600463867188,
      "text": " Then opened He their understanding that they might understand the Scriptures, and He said"
    },
    {
      "id": 123,
      "start": 1745.3600463867188,
      "end": 1752.760009765625,
      "text": " unto them, thus it is written, and thus it behooved Christ to suffer, to rise from the"
    },
    {
      "id": 124,
      "start": 1752.760009765625,
      "end": 1758.6400146484375,
      "text": " dead the third day, that repentance and remission of sin should be preached in His name among"
    },
    {
      "id": 125,
      "start": 1758.6400146484375,
      "end": 1765.6000366210938,
      "text": " all nations beginning at Jerusalem, and ye are witnesses of these things."
    },
    {
      "id": 126,
      "start": 1765.6000366210938,
      "end": 1768.1200561523438,
      "text": " You know what I find in Peter?"
    },
    {
      "id": 127,
      "start": 1768.1200561523438,
      "end": 1773.0,
      "text": " I find a man that, remember Jesus said to him in a couple of chapters earlier how that"
    },
    {
      "id": 128,
      "start": 1773.0,
      "end": 1775.4400024414062,
      "text": " He was going to deny him."
    },
    {
      "id": 129,
      "start": 1775.4400024414062,
      "end": 1779.800048828125,
      "text": " And He said, listen, Peter, Satan hath desired to have you that he may sift you as wheat."
    },
    {
      "id": 130,
      "start": 1780.3200073242188,
      "end": 1783.3200073242188,
      "text": " But He says this, but I have prayed for thee."
    },
    {
      "id": 131,
      "start": 1783.3200073242188,
      "end": 1789.3600463867188,
      "text": " And then He says this, and when thou art converted, strengthen thy brethren."
    },
    {
      "id": 132,
      "start": 1789.3600463867188,
      "end": 1796.8800048828125,
      "text": " And Peter, John records in John 21 that encounter when Peter and John are there."
    },
    {
      "id": 133,
      "start": 1796.8800048828125,
      "end": 1799.3200073242188,
      "text": " It's interesting in the gospel account."
    },
    {
      "id": 0,
      "start": 1799.3200073242188,
      "end": 1801.5200073719025,
      "text": " of the resurrection, how that He says,"
    },
    {
      "id": 1,
      "start": 1801.5200073719025,
      "end": 1805.520007133484,
      "text": " go sell the disciples, and Peter."
    },
    {
      "id": 2,
      "start": 1805.520007133484,
      "end": 1807.9400072097778,
      "text": " And Peter, as he hears these words,"
    },
    {
      "id": 3,
      "start": 1807.9400072097778,
      "end": 1810.10000705719,
      "text": " remember as we read there just a moment ago"
    },
    {
      "id": 4,
      "start": 1810.10000705719,
      "end": 1813.3200073242188,
      "text": " in Acts 3, he said we're witnesses of these things."
    },
    {
      "id": 5,
      "start": 1813.3200073242188,
      "end": 1816.2800064086914,
      "text": " And then in 1 Peter 5, in verse 1,"
    },
    {
      "id": 6,
      "start": 1816.2800064086914,
      "end": 1819.0000076293945,
      "text": " he says that I am a witness"
    },
    {
      "id": 7,
      "start": 1819.0000076293945,
      "end": 1821.8400077819824,
      "text": " of the sufferings of Christ."
    },
    {
      "id": 8,
      "start": 1821.8400077819824,
      "end": 1823.7600078582764,
      "text": " And he says, Jesus says to them,"
    },
    {
      "id": 9,
      "start": 1823.7600078582764,
      "end": 1827.3800067901611,
      "text": " here, listen, it was written"
    },
    {
      "id": 10,
      "start": 1827.3800067901611,
      "end": 1830.1800079345703,
      "text": " and thus it behooved Christ, in verse 46,"
    },
    {
      "id": 11,
      "start": 1830.1800079345703,
      "end": 1834.140007019043,
      "text": " to suffer, to rise from the dead the third day."
    },
    {
      "id": 12,
      "start": 1834.140007019043,
      "end": 1836.0200080871582,
      "text": " And then notice the result of this."
    },
    {
      "id": 13,
      "start": 1836.0200080871582,
      "end": 1837.860008239746,
      "text": " Yes, it's redemption and salvation"
    },
    {
      "id": 14,
      "start": 1837.860008239746,
      "end": 1840.0400085449219,
      "text": " because now mankind can be saved"
    },
    {
      "id": 15,
      "start": 1840.0400085449219,
      "end": 1842.740005493164,
      "text": " and we see that the truth is given,"
    },
    {
      "id": 16,
      "start": 1842.740005493164,
      "end": 1844.4200057983398,
      "text": " that repentance and remission of sin"
    },
    {
      "id": 17,
      "start": 1844.4200057983398,
      "end": 1847.0600090026855,
      "text": " should be preached in His name among all nations,"
    },
    {
      "id": 18,
      "start": 1847.0600090026855,
      "end": 1848.1000061035156,
      "text": " beginning at Jerusalem,"
    },
    {
      "id": 19,
      "start": 1848.1000061035156,
      "end": 1851.0400085449219,
      "text": " and you're witnesses of these things."
    },
    {
      "id": 20,
      "start": 1852.0600090026855,
      "end": 1855.580005645752,
      "text": " The end here of Luke 24 reveals to us,"
    },
    {
      "id": 21,
      "start": 1855.580005645752,
      "end": 1858.6200065612793,
      "text": " it records for us the ascension of Jesus Christ."
    },
    {
      "id": 22,
      "start": 1860.5000076293945,
      "end": 1863.4200057983398,
      "text": " If you're trying to trace the timeline,"
    },
    {
      "id": 23,
      "start": 1863.4200057983398,
      "end": 1866.360008239746,
      "text": " it's in connection there with Acts 1."
    },
    {
      "id": 24,
      "start": 1867.5000076293945,
      "end": 1869.260009765625,
      "text": " And you see that Peter,"
    },
    {
      "id": 25,
      "start": 1869.260009765625,
      "end": 1873.1000061035156,
      "text": " he's embraced this responsibility that he has."
    },
    {
      "id": 26,
      "start": 1873.1000061035156,
      "end": 1875.740005493164,
      "text": " Yes, he's a witness, but he understands the result"
    },
    {
      "id": 27,
      "start": 1875.740005493164,
      "end": 1880.3200073242188,
      "text": " that redemption has now been paid for."
    },
    {
      "id": 28,
      "start": 1880.3200073242188,
      "end": 1883.4600067138672,
      "text": " The price of redemption, the blood of Christ,"
    },
    {
      "id": 29,
      "start": 1883.4600067138672,
      "end": 1885.9000091552734,
      "text": " all the way back in Genesis,"
    },
    {
      "id": 30,
      "start": 1885.9000091552734,
      "end": 1889.9800109863281,
      "text": " the prophecies regarding the blood that would be shed"
    },
    {
      "id": 31,
      "start": 1889.9800109863281,
      "end": 1894.9800109863281,
      "text": " and all of those sacrifices that were done day after day."
    },
    {
      "id": 32,
      "start": 1895.3800048828125,
      "end": 1899.5000076293945,
      "text": " Remember, Hebrews 10 speaks about those that would stand,"
    },
    {
      "id": 33,
      "start": 1899.5000076293945,
      "end": 1901.7800064086914,
      "text": " those priests that would minister daily,"
    },
    {
      "id": 34,
      "start": 1901.7800064086914,
      "end": 1905.3800048828125,
      "text": " offering the same sacrifices that could never take away sin."
    },
    {
      "id": 35,
      "start": 1905.3800048828125,
      "end": 1910.140007019043,
      "text": " But this man, after he made one sacrifice for sin forever,"
    },
    {
      "id": 36,
      "start": 1910.140007019043,
      "end": 1912.5000076293945,
      "text": " sat at the right hand of the throne of God."
    },
    {
      "id": 37,
      "start": 1912.5800094604492,
      "end": 1917.5800094604492,
      "text": " And we find here that Peter is being used by God."
    },
    {
      "id": 38,
      "start": 1918.9800109863281,
      "end": 1920.7000045776367,
      "text": " He's testifying."
    },
    {
      "id": 39,
      "start": 1920.7000045776367,
      "end": 1922.3800048828125,
      "text": " I'm a witness of the sufferings,"
    },
    {
      "id": 40,
      "start": 1922.3800048828125,
      "end": 1925.6200103759766,
      "text": " and let me help you understand that as we testify"
    },
    {
      "id": 41,
      "start": 1925.6200103759766,
      "end": 1926.5800094604492,
      "text": " of the sufferings,"
    },
    {
      "id": 42,
      "start": 1926.5800094604492,
      "end": 1928.5400085449219,
      "text": " as he's writing to the believers in 1 Peter,"
    },
    {
      "id": 43,
      "start": 1928.5400085449219,
      "end": 1930.5,
      "text": " he did this for you."
    },
    {
      "id": 44,
      "start": 1930.5,
      "end": 1932.9800109863281,
      "text": " He suffered for us."
    },
    {
      "id": 45,
      "start": 1932.9800109863281,
      "end": 1934.020004272461,
      "text": " This is what he did."
    },
    {
      "id": 46,
      "start": 1934.020004272461,
      "end": 1936.740005493164,
      "text": " Notice, if you will, in 2 Corinthians 5."
    },
    {
      "id": 47,
      "start": 1937.740005493164,
      "end": 1940.4200134277344,
      "text": " In 2 Corinthians 5,"
    },
    {
      "id": 48,
      "start": 1945.4200134277344,
      "end": 1950.4200134277344,
      "text": " we've read in 1 Peter about the reason for his suffering."
    },
    {
      "id": 49,
      "start": 1952.4200134277344,
      "end": 1955.8200073242188,
      "text": " We find that he suffered for our sin."
    },
    {
      "id": 50,
      "start": 1955.8200073242188,
      "end": 1959.5,
      "text": " Here, the Bible tells us in 2 Corinthians 5 in verse 21,"
    },
    {
      "id": 51,
      "start": 1959.5,
      "end": 1964.5,
      "text": " for he hath made him to be sin for us, who knew no sin."
    },
    {
      "id": 52,
      "start": 1965.1800079345703,
      "end": 1967.5400085449219,
      "text": " Notice the last part of this verse,"
    },
    {
      "id": 53,
      "start": 1967.5400085449219,
      "end": 1972.2200012207031,
      "text": " that we might be made the righteousness of God in him."
    },
    {
      "id": 54,
      "start": 1974.020004272461,
      "end": 1978.0600128173828,
      "text": " That we might be made the righteousness of God in him."
    },
    {
      "id": 55,
      "start": 1978.0600128173828,
      "end": 1980.6200103759766,
      "text": " There's no other way for mankind to be declared righteous,"
    },
    {
      "id": 56,
      "start": 1980.6200103759766,
      "end": 1983.4200134277344,
      "text": " but through the imputed righteousness"
    },
    {
      "id": 57,
      "start": 1983.4200134277344,
      "end": 1984.9800109863281,
      "text": " of the Lord Jesus Christ."
    },
    {
      "id": 58,
      "start": 1986.2200012207031,
      "end": 1987.6200103759766,
      "text": " In fact, Isaiah says this,"
    },
    {
      "id": 59,
      "start": 1987.6200103759766,
      "end": 1991.740005493164,
      "text": " that all of our good works are as filthy rags."
    },
    {
      "id": 60,
      "start": 1992.740005493164,
      "end": 1995.1000061035156,
      "text": " As man goes about trying to establish"
    },
    {
      "id": 61,
      "start": 1995.1000061035156,
      "end": 1998.3400115966797,
      "text": " his own righteousness, he fails utterly."
    },
    {
      "id": 62,
      "start": 1998.3400115966797,
      "end": 2000.2200012207031,
      "text": " The Bible says that we've all come short,"
    },
    {
      "id": 63,
      "start": 2000.2200012207031,
      "end": 2001.2200012207031,
      "text": " that we're all sinners,"
    },
    {
      "id": 64,
      "start": 2001.2200012207031,
      "end": 2003.5400085449219,
      "text": " and we understand that from Romans chapter number three,"
    },
    {
      "id": 65,
      "start": 2003.5400085449219,
      "end": 2005.4600067138672,
      "text": " and we find the result of the suffering"
    },
    {
      "id": 66,
      "start": 2005.4600067138672,
      "end": 2008.4200134277344,
      "text": " is that we now can be saved."
    },
    {
      "id": 67,
      "start": 2008.4200134277344,
      "end": 2009.8600006103516,
      "text": " And those of us that are here this morning"
    },
    {
      "id": 68,
      "start": 2009.8600006103516,
      "end": 2010.740005493164,
      "text": " that have been saved,"
    },
    {
      "id": 69,
      "start": 2010.740005493164,
      "end": 2012.8200073242188,
      "text": " we can rejoice greatly"
    },
    {
      "id": 70,
      "start": 2012.8200073242188,
      "end": 2014.7000122070312,
      "text": " in the suffering of the Lord Jesus Christ."
    },
    {
      "id": 71,
      "start": 2014.7000122070312,
      "end": 2016.4200134277344,
      "text": " It should cause us to,"
    },
    {
      "id": 72,
      "start": 2017.3800048828125,
      "end": 2019.1400146484375,
      "text": " even as I read the passage of Scripture,"
    },
    {
      "id": 73,
      "start": 2019.1400146484375,
      "end": 2021.020004272461,
      "text": " to be choked up."
    },
    {
      "id": 74,
      "start": 2021.0600128173828,
      "end": 2023.7000122070312,
      "text": " To think about what he did for us."
    },
    {
      "id": 75,
      "start": 2025.6200103759766,
      "end": 2029.0600128173828,
      "text": " He's God, but he did it for us."
    },
    {
      "id": 76,
      "start": 2030.8200073242188,
      "end": 2032.3400115966797,
      "text": " I wanna close with this thought"
    },
    {
      "id": 77,
      "start": 2032.3400115966797,
      "end": 2034.4200134277344,
      "text": " from Hebrews chapter number 12."
    },
    {
      "id": 78,
      "start": 2035.9800109863281,
      "end": 2037.260009765625,
      "text": " Turn there if you will."
    },
    {
      "id": 79,
      "start": 2037.260009765625,
      "end": 2039.3800048828125,
      "text": " In Hebrews chapter number 12,"
    },
    {
      "id": 80,
      "start": 2039.3800048828125,
      "end": 2041.9000091552734,
      "text": " we'll make application and be done this morning."
    },
    {
      "id": 81,
      "start": 2042.9800109863281,
      "end": 2044.8200073242188,
      "text": " In Hebrews chapter number 12,"
    },
    {
      "id": 82,
      "start": 2044.8200073242188,
      "end": 2045.740005493164,
      "text": " Hebrews 12."
    },
    {
      "id": 83,
      "start": 2050.780014038086,
      "end": 2052.4200134277344,
      "text": " Beginning in verse number one."
    },
    {
      "id": 84,
      "start": 2054.1400146484375,
      "end": 2055.3800048828125,
      "text": " Hebrews 12 and verse number one,"
    },
    {
      "id": 85,
      "start": 2055.3800048828125,
      "end": 2056.220001220703,
      "text": " the Bible says,"
    },
    {
      "id": 86,
      "start": 2056.220001220703,
      "end": 2058.1000061035156,
      "text": " we're foreseeing we also are encompassed about"
    },
    {
      "id": 87,
      "start": 2058.1000061035156,
      "end": 2061.1000061035156,
      "text": " with so great a cloud of witnesses."
    },
    {
      "id": 88,
      "start": 2061.1000061035156,
      "end": 2062.779998779297,
      "text": " Let us lay aside every weight"
    },
    {
      "id": 89,
      "start": 2062.779998779297,
      "end": 2064.779998779297,
      "text": " and the sin which doth so easily beset us"
    },
    {
      "id": 90,
      "start": 2064.779998779297,
      "end": 2066.1400146484375,
      "text": " and let us run with patience"
    },
    {
      "id": 91,
      "start": 2066.1400146484375,
      "end": 2068.02001953125,
      "text": " the race that is set before us."
    },
    {
      "id": 92,
      "start": 2068.02001953125,
      "end": 2071.1400146484375,
      "text": " Looking unto Jesus, the author and finisher of our faith,"
    },
    {
      "id": 93,
      "start": 2071.1400146484375,
      "end": 2072.4600219726562,
      "text": " notice this,"
    },
    {
      "id": 94,
      "start": 2072.4600219726562,
      "end": 2075.3399963378906,
      "text": " who for the joy that was set before him"
    },
    {
      "id": 95,
      "start": 2076.300018310547,
      "end": 2078.5,
      "text": " endured the cross,"
    },
    {
      "id": 96,
      "start": 2078.5,
      "end": 2080.7000122070312,
      "text": " despising the shame"
    },
    {
      "id": 97,
      "start": 2080.7000122070312,
      "end": 2084.220001220703,
      "text": " and is set down at the right hand of the throne of God."
    },
    {
      "id": 98,
      "start": 2084.220001220703,
      "end": 2086.8200073242188,
      "text": " For consider him that endured such contradiction"
    },
    {
      "id": 99,
      "start": 2086.8200073242188,
      "end": 2088.740020751953,
      "text": " of sinners against himself,"
    },
    {
      "id": 100,
      "start": 2088.740020751953,
      "end": 2091.5,
      "text": " lest you be wearied and faint in your own minds."
    },
    {
      "id": 101,
      "start": 2093.02001953125,
      "end": 2095.8200073242188,
      "text": " I want you to think about the word suffer is not here,"
    },
    {
      "id": 102,
      "start": 2095.8200073242188,
      "end": 2098.8200073242188,
      "text": " but when you think about the truth that is being written,"
    },
    {
      "id": 103,
      "start": 2098.8200073242188,
      "end": 2101.5,
      "text": " when it talks about he endured the cross,"
    },
    {
      "id": 104,
      "start": 2101.5,
      "end": 2102.8200073242188,
      "text": " despising the shame,"
    },
    {
      "id": 105,
      "start": 2102.8200073242188,
      "end": 2106.5,
      "text": " verse three says that he endured such contradiction"
    },
    {
      "id": 106,
      "start": 2106.5,
      "end": 2107.8600158691406,
      "text": " of sinners against himself."
    },
    {
      "id": 107,
      "start": 2107.8600158691406,
      "end": 2111.3800048828125,
      "text": " I think that it's fair that we could say that he suffered."
    },
    {
      "id": 108,
      "start": 2111.3800048828125,
      "end": 2112.779998779297,
      "text": " We read it all over the place"
    },
    {
      "id": 109,
      "start": 2112.779998779297,
      "end": 2114.740020751953,
      "text": " in all sorts of passages of scripture"
    },
    {
      "id": 110,
      "start": 2114.740020751953,
      "end": 2116.1000061035156,
      "text": " that we've looked at even this morning."
    },
    {
      "id": 111,
      "start": 2116.1000061035156,
      "end": 2117.5800170898438,
      "text": " And though the word is not there,"
    },
    {
      "id": 112,
      "start": 2117.5800170898438,
      "end": 2118.5800170898438,
      "text": " we see this suffering,"
    },
    {
      "id": 113,
      "start": 2118.5800170898438,
      "end": 2120.1799926757812,
      "text": " but I wanna draw your attention"
    },
    {
      "id": 114,
      "start": 2120.1799926757812,
      "end": 2122.1000061035156,
      "text": " where the Bible says in verse number two,"
    },
    {
      "id": 115,
      "start": 2122.1000061035156,
      "end": 2123.5,
      "text": " that looking unto Jesus,"
    },
    {
      "id": 116,
      "start": 2123.5,
      "end": 2124.7000122070312,
      "text": " the author and finisher of our faith,"
    },
    {
      "id": 117,
      "start": 2124.7000122070312,
      "end": 2125.540008544922,
      "text": " but it says this,"
    },
    {
      "id": 118,
      "start": 2125.540008544922,
      "end": 2129.4600219726562,
      "text": " for the joy that was set before him."
    },
    {
      "id": 119,
      "start": 2129.4600219726562,
      "end": 2131.3399963378906,
      "text": " He endured the cross."
    },
    {
      "id": 120,
      "start": 2131.3399963378906,
      "end": 2134.02001953125,
      "text": " He endured that suffering."
    },
    {
      "id": 121,
      "start": 2134.02001953125,
      "end": 2134.8600158691406,
      "text": " Why?"
    },
    {
      "id": 122,
      "start": 2134.8600158691406,
      "end": 2137.6600036621094,
      "text": " For the joy that was set before him."
    },
    {
      "id": 123,
      "start": 2137.6600036621094,
      "end": 2140.4600219726562,
      "text": " He understood that because of that suffering,"
    },
    {
      "id": 124,
      "start": 2140.4600219726562,
      "end": 2143.4600219726562,
      "text": " that suffering precedes glory."
    },
    {
      "id": 125,
      "start": 2143.4600219726562,
      "end": 2146.300018310547,
      "text": " And that if there's no death on the cross,"
    },
    {
      "id": 126,
      "start": 2146.300018310547,
      "end": 2148.220001220703,
      "text": " there's no resurrection."
    },
    {
      "id": 127,
      "start": 2148.220001220703,
      "end": 2149.7000122070312,
      "text": " If there's no death on the cross,"
    },
    {
      "id": 128,
      "start": 2149.7000122070312,
      "end": 2151.1000061035156,
      "text": " there's no atonement."
    },
    {
      "id": 129,
      "start": 2151.1000061035156,
      "end": 2152.7000122070312,
      "text": " The substitutionary atonement"
    },
    {
      "id": 130,
      "start": 2152.7000122070312,
      "end": 2155.3399963378906,
      "text": " that God speaks of all throughout his word,"
    },
    {
      "id": 131,
      "start": 2156.1400146484375,
      "end": 2158.300018310547,
      "text": " that the just dies for the unjust,"
    },
    {
      "id": 132,
      "start": 2158.300018310547,
      "end": 2161.1400146484375,
      "text": " that we find ourselves in that position,"
    },
    {
      "id": 133,
      "start": 2161.1400146484375,
      "end": 2164.4200134277344,
      "text": " that he has taken our place."
    },
    {
      "id": 134,
      "start": 2164.4200134277344,
      "end": 2166.260009765625,
      "text": " And he suffered for me."
    },
    {
      "id": 135,
      "start": 2166.260009765625,
      "end": 2170.300018310547,
      "text": " He suffered it all because he loved me."
    },
    {
      "id": 136,
      "start": 2170.300018310547,
      "end": 2171.1400146484375,
      "text": " And this morning,"
    },
    {
      "id": 137,
      "start": 2171.1400146484375,
      "end": 2175.6199951171875,
      "text": " when we think about the glorious truth of this message,"
    },
    {
      "id": 138,
      "start": 2175.6199951171875,
      "end": 2176.8200073242188,
      "text": " I wonder this morning,"
    },
    {
      "id": 139,
      "start": 2177.8999938964844,
      "end": 2180.220001220703,
      "text": " how does it really impact us?"
    },
    {
      "id": 140,
      "start": 2180.220001220703,
      "end": 2181.0599975585938,
      "text": " Two thoughts."
    },
    {
      "id": 141,
      "start": 2181.0599975585938,
      "end": 2184.1000061035156,
      "text": " Number one, we should rejoice greatly."
    },
    {
      "id": 142,
      "start": 2184.1000061035156,
      "end": 2186.3399963378906,
      "text": " I mean, we ought to just take some time"
    },
    {
      "id": 143,
      "start": 2186.3399963378906,
      "end": 2190.5,
      "text": " and just really thank God for our salvation."
    },
    {
      "id": 144,
      "start": 2190.5,
      "end": 2194.220001220703,
      "text": " I understand this morning that in a sense,"
    },
    {
      "id": 145,
      "start": 2194.220001220703,
      "end": 2196.1400146484375,
      "text": " my salvation cost me nothing,"
    },
    {
      "id": 146,
      "start": 2197.5800170898438,
      "end": 2199.1400146484375,
      "text": " but it cost him everything."
    },
    {
      "id": 147,
      "start": 2200.8999938964844,
      "end": 2202.1400146484375,
      "text": " Cost him everything."
    },
    {
      "id": 148,
      "start": 2203.8200073242188,
      "end": 2205.1799926757812,
      "text": " When I think about,"
    },
    {
      "id": 149,
      "start": 2206.300018310547,
      "end": 2209.220001220703,
      "text": " go back and read all four gospel accounts"
    },
    {
      "id": 150,
      "start": 2210.740020751953,
      "end": 2211.980010986328,
      "text": " of the crucifixion."
    },
    {
      "id": 151,
      "start": 2211.980010986328,
      "end": 2214.0599975585938,
      "text": " I couldn't do it publicly this morning,"
    },
    {
      "id": 152,
      "start": 2215.220001220703,
      "end": 2216.5800170898438,
      "text": " but you go back this afternoon"
    },
    {
      "id": 153,
      "start": 2216.5800170898438,
      "end": 2219.300018310547,
      "text": " and you read all four gospel accounts"
    },
    {
      "id": 154,
      "start": 2219.300018310547,
      "end": 2223.1000061035156,
      "text": " of the suffering of the Lord Jesus Christ."
    },
    {
      "id": 155,
      "start": 2223.1000061035156,
      "end": 2224.1000061035156,
      "text": " As you read it,"
    },
    {
      "id": 156,
      "start": 2225.0599975585938,
      "end": 2228.0599975585938,
      "text": " as the tears flow down your cheeks,"
    },
    {
      "id": 157,
      "start": 2228.0599975585938,
      "end": 2228.980010986328,
      "text": " just thank him."
    },
    {
      "id": 158,
      "start": 2230.1000061035156,
      "end": 2231.5,
      "text": " Rejoice greatly."
    },
    {
      "id": 159,
      "start": 2232.8600158691406,
      "end": 2236.4600219726562,
      "text": " Because he did it all for me."
    },
    {
      "id": 160,
      "start": 2236.4600219726562,
      "end": 2238.8600158691406,
      "text": " Personally, you say that he did it for me."
    },
    {
      "id": 161,
      "start": 2239.8600158691406,
      "end": 2244.8600158691406,
      "text": " What joy should flood our souls?"
    },
    {
      "id": 162,
      "start": 2246.1000061035156,
      "end": 2247.5,
      "text": " Amen?"
    },
    {
      "id": 163,
      "start": 2247.5,
      "end": 2249.740020751953,
      "text": " Preacher friend said this."
    },
    {
      "id": 164,
      "start": 2249.740020751953,
      "end": 2253.6600036621094,
      "text": " He said, speaking about the importance"
    },
    {
      "id": 165,
      "start": 2253.6600036621094,
      "end": 2257.540008544922,
      "text": " of rejoicing in our salvation, for our salvation,"
    },
    {
      "id": 166,
      "start": 2257.540008544922,
      "end": 2259.5,
      "text": " he said, there are days that we as believers"
    },
    {
      "id": 167,
      "start": 2259.5,
      "end": 2261.1000061035156,
      "text": " have tough days."
    },
    {
      "id": 168,
      "start": 2261.1000061035156,
      "end": 2263.540008544922,
      "text": " He said, but on our worst of days,"
    },
    {
      "id": 169,
      "start": 2263.540008544922,
      "end": 2264.8600158691406,
      "text": " I'm still going to heaven."
    },
    {
      "id": 170,
      "start": 2266.1000061035156,
      "end": 2267.4200134277344,
      "text": " I'm still going to heaven."
    },
    {
      "id": 171,
      "start": 2267.4200134277344,
      "end": 2268.7000122070312,
      "text": " Amen?"
    },
    {
      "id": 172,
      "start": 2268.7000122070312,
      "end": 2269.6199951171875,
      "text": " Think about that."
    },
    {
      "id": 173,
      "start": 2270.740020751953,
      "end": 2272.1400146484375,
      "text": " The suffering."
    },
    {
      "id": 174,
      "start": 2272.1400146484375,
      "end": 2274.02001953125,
      "text": " We're witnesses."
    },
    {
      "id": 175,
      "start": 2274.02001953125,
      "end": 2275.02001953125,
      "text": " But then I want you to think about"
    },
    {
      "id": 176,
      "start": 2275.02001953125,
      "end": 2276.6600036621094,
      "text": " how it impacted Peter."
    },
    {
      "id": 177,
      "start": 2280.220001220703,
      "end": 2283.8600158691406,
      "text": " Peter, he says in John 21, I go a fishing."
    },
    {
      "id": 178,
      "start": 2285.02001953125,
      "end": 2287.0599975585938,
      "text": " He's there with the Lord Jesus Christ"
    },
    {
      "id": 179,
      "start": 2287.0599975585938,
      "end": 2288.540008544922,
      "text": " after they caught nothing."
    },
    {
      "id": 180,
      "start": 2289.8600158691406,
      "end": 2291.4200134277344,
      "text": " Jesus said, I have prayed for thee"
    },
    {
      "id": 181,
      "start": 2291.4200134277344,
      "end": 2293.8200073242188,
      "text": " when thou art converted, strengthen thy brethren."
    },
    {
      "id": 182,
      "start": 2293.8200073242188,
      "end": 2296.3800048828125,
      "text": " When you read of the life of Peter in the book of Acts"
    },
    {
      "id": 183,
      "start": 2296.3800048828125,
      "end": 2299.4200134277344,
      "text": " and you read as he's testifying and ministering"
    },
    {
      "id": 184,
      "start": 2299.4200134277344,
      "end": 2301.7000122070312,
      "text": " to these believers in first and second Peter,"
    },
    {
      "id": 185,
      "start": 2301.7000122070312,
      "end": 2303.8200073242188,
      "text": " you see a man that is compelled"
    },
    {
      "id": 186,
      "start": 2304.8999938964844,
      "end": 2307.1000061035156,
      "text": " to tell others about Jesus Christ"
    },
    {
      "id": 187,
      "start": 2308.1400146484375,
      "end": 2311.300018310547,
      "text": " and about his suffering for them."
    },
    {
      "id": 188,
      "start": 2312.2999877929688,
      "end": 2315.3800048828125,
      "text": " You know, this morning, we are privileged"
    },
    {
      "id": 189,
      "start": 2315.3800048828125,
      "end": 2316.7000122070312,
      "text": " to know this truth."
    },
    {
      "id": 190,
      "start": 2318.2200317382812,
      "end": 2321.1799926757812,
      "text": " Honestly, it doesn't make us better."
    },
    {
      "id": 191,
      "start": 2322.0599975585938,
      "end": 2323.3400268554688,
      "text": " It makes us accountable."
    },
    {
      "id": 192,
      "start": 2326.8200073242188,
      "end": 2328.780029296875,
      "text": " When I think about that this morning,"
    },
    {
      "id": 193,
      "start": 2328.780029296875,
      "end": 2332.02001953125,
      "text": " listen, I'm so thankful that I'm going to heaven one day."
    },
    {
      "id": 194,
      "start": 2332.02001953125,
      "end": 2333.6199951171875,
      "text": " I don't know when it's gonna be."
    },
    {
      "id": 195,
      "start": 2334.5,
      "end": 2337.4199829101562,
      "text": " But one day, for every single one of us"
    },
    {
      "id": 196,
      "start": 2337.4199829101562,
      "end": 2338.780029296875,
      "text": " that have trusted the Lord Jesus Christ"
    },
    {
      "id": 197,
      "start": 2338.780029296875,
      "end": 2341.3400268554688,
      "text": " our personal Savior, heaven is real."
    },
    {
      "id": 198,
      "start": 2342.4600219726562,
      "end": 2343.5,
      "text": " Heaven is real."
    },
    {
      "id": 199,
      "start": 2345.9400024414062,
      "end": 2350.3400268554688,
      "text": " But there's a whole lot of people in our world"
    },
    {
      "id": 200,
      "start": 2351.5399780273438,
      "end": 2355.2200317382812,
      "text": " that they don't know about the sufferings of Jesus Christ."
    },
    {
      "id": 201,
      "start": 2355.2200317382812,
      "end": 2358.0599975585938,
      "text": " They don't know what he did on the cross of Calvary"
    },
    {
      "id": 202,
      "start": 2358.0599975585938,
      "end": 2361.780029296875,
      "text": " or why he did what he did on the cross of Calvary."
    },
    {
      "id": 203,
      "start": 2362.9000244140625,
      "end": 2364.6199951171875,
      "text": " I remember speaking to a man when I,"
    },
    {
      "id": 204,
      "start": 2364.6199951171875,
      "end": 2367.780029296875,
      "text": " I say a man, we were just teenagers, we were kids."
    },
    {
      "id": 205,
      "start": 2367.780029296875,
      "end": 2369.9000244140625,
      "text": " Y'all teenagers are kids, amen."
    },
    {
      "id": 206,
      "start": 2369.9000244140625,
      "end": 2370.97998046875,
      "text": " You know, the older you get,"
    },
    {
      "id": 207,
      "start": 2370.97998046875,
      "end": 2374.6199951171875,
      "text": " the more you refer to kids that aren't really kids,"
    },
    {
      "id": 208,
      "start": 2374.6199951171875,
      "end": 2375.4600219726562,
      "text": " but you call them kids."
    },
    {
      "id": 209,
      "start": 2375.4600219726562,
      "end": 2376.7000122070312,
      "text": " There's like this 20-something-year-old."
    },
    {
      "id": 210,
      "start": 2376.7000122070312,
      "end": 2378.5,
      "text": " I found myself yesterday saying to Brianna,"
    },
    {
      "id": 211,
      "start": 2378.5,
      "end": 2379.5800170898438,
      "text": " yeah, this kid over at the store,"
    },
    {
      "id": 212,
      "start": 2379.5800170898438,
      "end": 2381.1799926757812,
      "text": " and I was like, actually, it was probably like 24,"
    },
    {
      "id": 213,
      "start": 2381.1799926757812,
      "end": 2383.8200073242188,
      "text": " but you know, I guess now he's a kid, you know?"
    },
    {
      "id": 214,
      "start": 2383.8200073242188,
      "end": 2386.7000122070312,
      "text": " And some of you, you look at me as a kid, I get it."
    },
    {
      "id": 215,
      "start": 2386.7000122070312,
      "end": 2390.3800048828125,
      "text": " But the reality is that I was a senior in high school."
    },
    {
      "id": 216,
      "start": 2390.3800048828125,
      "end": 2392.02001953125,
      "text": " I had just been saved, not long."
    },
    {
      "id": 217,
      "start": 2392.9000244140625,
      "end": 2396.6199951171875,
      "text": " Been saved for just probably a month at the most."
    },
    {
      "id": 218,
      "start": 2396.6199951171875,
      "end": 2399.5399780273438,
      "text": " And we're sitting at a lunch table as a senior."
    },
    {
      "id": 0,
      "start": 2399.5399780273438,
      "end": 2403.779977798462,
      "text": " senior in high school, and there's this kid that was sitting there."
    },
    {
      "id": 1,
      "start": 2403.779977798462,
      "end": 2406.979978084564,
      "text": " My brother was a sophomore, and so we had lunch together."
    },
    {
      "id": 2,
      "start": 2406.979978084564,
      "end": 2411.1799783706665,
      "text": " Actually, I had lunch together almost every day in my senior high school, and there was"
    },
    {
      "id": 3,
      "start": 2411.1799783706665,
      "end": 2414.659977912903,
      "text": " a kid that was in his class, and he was sitting there with us, and I began to talk to him"
    },
    {
      "id": 4,
      "start": 2414.659977912903,
      "end": 2416.5399780273438,
      "text": " about the Lord Jesus Christ."
    },
    {
      "id": 5,
      "start": 2416.5399780273438,
      "end": 2425.9799785614014,
      "text": " And I began to talk to him about how Jesus died for him, and he had a very skewed perspective"
    },
    {
      "id": 6,
      "start": 2425.9799785614014,
      "end": 2430.179977416992,
      "text": " with regard to the death of Christ on the cross of Calvary, and that it was not a willing"
    },
    {
      "id": 7,
      "start": 2430.179977416992,
      "end": 2437.6199798583984,
      "text": " sacrifice, but that it was a Roman authority that forced him."
    },
    {
      "id": 8,
      "start": 2437.6199798583984,
      "end": 2442.5399780273438,
      "text": " And I began to share truth with him, some of what I shared this morning."
    },
    {
      "id": 9,
      "start": 2442.5399780273438,
      "end": 2447.7799797058105,
      "text": " Listen, Jesus did it all because he loved us."
    },
    {
      "id": 10,
      "start": 2447.7799797058105,
      "end": 2452.179977416992,
      "text": " Those Romans, remember what he said to Pilate, you have no authority, no power unless I give"
    },
    {
      "id": 11,
      "start": 2452.179977416992,
      "end": 2455.579978942871,
      "text": " it to you, right?"
    },
    {
      "id": 12,
      "start": 2455.579978942871,
      "end": 2460.9399795532227,
      "text": " He could have called legions of angels, but Peter says, I'm a witness of the sufferings"
    },
    {
      "id": 13,
      "start": 2460.9399795532227,
      "end": 2462.6199798583984,
      "text": " of Christ."
    },
    {
      "id": 14,
      "start": 2462.6199798583984,
      "end": 2469.5399780273438,
      "text": " This morning, we weren't there physically to be eyewitnesses, but in a sense this morning,"
    },
    {
      "id": 15,
      "start": 2469.5399780273438,
      "end": 2473.3799743652344,
      "text": " if you'd allow me to say it, we are witnesses of his suffering."
    },
    {
      "id": 16,
      "start": 2473.3799743652344,
      "end": 2474.659980773926,
      "text": " Amen?"
    },
    {
      "id": 17,
      "start": 2474.659980773926,
      "end": 2481.0199813842773,
      "text": " We know that he suffered, and we know why he suffered."
    },
    {
      "id": 18,
      "start": 2481.0199813842773,
      "end": 2488.3399810791016,
      "text": " And I trust this morning that it would not only lead us to a place of rejoicing greatly,"
    },
    {
      "id": 19,
      "start": 2488.3399810791016,
      "end": 2497.659980773926,
      "text": " thanking him, having this increased level of gratitude for our redemption, but it would"
    },
    {
      "id": 20,
      "start": 2497.659980773926,
      "end": 2503.699981689453,
      "text": " lead us to, God, would you help me to share this wonderful message with someone?"
    },
    {
      "id": 21,
      "start": 2504.699981689453,
      "end": 2510.97998046875,
      "text": " I believe that as we begin to pray that way, God would delight in answering that prayer."
    },
    {
      "id": 22,
      "start": 2510.97998046875,
      "end": 2517.579978942871,
      "text": " I challenge you this morning, I'm challenging myself, that we would say, God, would you"
    },
    {
      "id": 23,
      "start": 2517.579978942871,
      "end": 2527.259979248047,
      "text": " give me the opportunity in these next couple of weeks to share with someone the truth of"
    },
    {
      "id": 24,
      "start": 2527.259979248047,
      "end": 2531.1399841308594,
      "text": " why you suffered on the cross of Calvary?"
    },
    {
      "id": 25,
      "start": 2531.1399841308594,
      "end": 2533.4199829101562,
      "text": " Would you give me the opportunity?"
    },
    {
      "id": 26,
      "start": 2533.4199829101562,
      "end": 2539.5599822998047,
      "text": " As we pray specifically, I believe God will answer that prayer, begin to look for those"
    },
    {
      "id": 27,
      "start": 2539.5599822998047,
      "end": 2542.5799713134766,
      "text": " opportunities that He would present to us."
    },
    {
      "id": 28,
      "start": 2542.5799713134766,
      "end": 2547.3799743652344,
      "text": " See during this time, and I understand we're in a different time in our country's history."
    },
    {
      "id": 29,
      "start": 2547.3799743652344,
      "end": 2553.6199798583984,
      "text": " There was a time when Easter, man, people that never went to church would be in church."
    },
    {
      "id": 30,
      "start": 2553.6199798583984,
      "end": 2559.699981689453,
      "text": " That's becoming less and less of a situation."
    },
    {
      "id": 31,
      "start": 2559.699981689453,
      "end": 2565.1399841308594,
      "text": " But there still are some people out there that have some idea of what Easter is really"
    },
    {
      "id": 32,
      "start": 2565.1399841308594,
      "end": 2567.8999786376953,
      "text": " all about."
    },
    {
      "id": 33,
      "start": 2567.8999786376953,
      "end": 2572.499984741211,
      "text": " Not that they've trusted Christ, not that maybe they know all of it, but this time of"
    },
    {
      "id": 34,
      "start": 2572.499984741211,
      "end": 2577.459976196289,
      "text": " our calendar gives us an opportunity."
    },
    {
      "id": 35,
      "start": 2577.459976196289,
      "end": 2581.97998046875,
      "text": " And I'm praying, and I want to ask you this morning to pray specifically, maybe to come"
    },
    {
      "id": 36,
      "start": 2581.97998046875,
      "end": 2587.179977416992,
      "text": " to this altar and say, God, would you give me in these next couple of weeks, give me"
    },
    {
      "id": 37,
      "start": 2587.179977416992,
      "end": 2597.739974975586,
      "text": " a divine appointment, give me an opportunity to speak of your sufferings and why you suffered."
    },
    {
      "id": 38,
      "start": 2597.739974975586,
      "end": 2601.019973754883,
      "text": " Thank Him for your redemption, absolutely."
    },
    {
      "id": 39,
      "start": 2601.019973754883,
      "end": 2608.2999725341797,
      "text": " Read the passages, weep and rejoice that He loved you so much that He was willing to suffer"
    },
    {
      "id": 40,
      "start": 2608.2999725341797,
      "end": 2610.459976196289,
      "text": " in the manner in which He did."
    },
    {
      "id": 41,
      "start": 2610.459976196289,
      "end": 2615.259979248047,
      "text": " But then go tell someone of this great truth."
    },
    {
      "id": 42,
      "start": 2615.259979248047,
      "end": 2616.259979248047,
      "text": " Let's pray."
    },
    {
      "id": 43,
      "start": 2616.259979248047,
      "end": 2617.5399780273438,
      "text": " Father, we love you."
    },
    {
      "id": 44,
      "start": 2617.5399780273438,
      "end": 2624.179977416992,
      "text": " Thank you for loving us."
    },
    {
      "id": 45,
      "start": 2624.179977416992,
      "end": 2632.179977416992,
      "text": " My heart is overwhelmed this morning, just thinking about the statement of Peter, a witness"
    },
    {
      "id": 46,
      "start": 2632.179977416992,
      "end": 2637.1399841308594,
      "text": " of the sufferings of Christ."
    },
    {
      "id": 47,
      "start": 2637.1399841308594,
      "end": 2651.8199768066406,
      "text": " As we read the account leading to the cross and then the cross itself, thank you."
    },
    {
      "id": 48,
      "start": 2651.8199768066406,
      "end": 2656.5799865722656,
      "text": " Thank you for being obedient unto death, even the death of the cross."
    },
    {
      "id": 49,
      "start": 2656.5799865722656,
      "end": 2665.699981689453,
      "text": " Rejoice in the resurrection before the glory is the suffering."
    },
    {
      "id": 50,
      "start": 2665.699981689453,
      "end": 2674.0599670410156,
      "text": " We understand that you did it all for me, personally, each one of us can say that."
    },
    {
      "id": 51,
      "start": 2674.0599670410156,
      "end": 2681.699981689453,
      "text": " I pray this morning that you'd help us to have a level of motivation to go and share"
    },
    {
      "id": 52,
      "start": 2681.699981689453,
      "end": 2683.499969482422,
      "text": " this truth with someone."
    },
    {
      "id": 53,
      "start": 2683.499969482422,
      "end": 2690.8599853515625,
      "text": " God, would you help us, each of us, to pray specifically about that opportunity, that"
    },
    {
      "id": 54,
      "start": 2690.8599853515625,
      "end": 2692.6199645996094,
      "text": " divine appointment."
    },
    {
      "id": 55,
      "start": 2692.6199645996094,
      "end": 2701.1399841308594,
      "text": " I pray, God, that you'd move and work, open doors, lead our path, that we might share"
    },
    {
      "id": 56,
      "start": 2701.1399841308594,
      "end": 2709.97998046875,
      "text": " with someone the sufferings of Jesus Christ, why He suffered the way that He did, of course,"
    },
    {
      "id": 57,
      "start": 2709.97998046875,
      "end": 2716.739990234375,
      "text": " leading to the glory of His resurrection, conquering sin, death, and the grave."
    },
    {
      "id": 58,
      "start": 2716.739990234375,
      "end": 2720.699981689453,
      "text": " I pray that you would guide and direct in these moments of invitation."
    },
    {
      "id": 59,
      "start": 2720.699981689453,
      "end": 2725.0999755859375,
      "text": " If there's one in our midst that's never trusted Christ as their Savior, we pray that"
    },
    {
      "id": 60,
      "start": 2725.0999755859375,
      "end": 2728.0999755859375,
      "text": " today would be the day of their salvation."
    },
    {
      "id": 61,
      "start": 2728.0999755859375,
      "end": 2731.8599853515625,
      "text": " We'll give you the glory for all that you'll do, for it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T15:31:40.993143"
}