{
  "video_id": "ecW69mkE0VU",
  "text": "last time, so it's been a while since we're here. We were supposed to be here back during COVID. And of course, because of COVID, we weren't able to come and we had to cancel out the meeting that we had scheduled then. So the Lord was gracious to let us come this year in 2023. And I tell you, it's good to be here, amen? In fact, at this point in life, it's good to be anywhere. So I'm just thankful for the opportunity to be back here in Virginia once again, in beautiful Oakton. And we've been getting around a little bit, my cousin and his wife live just south of here. And so we went down and visited with them yesterday for a little while. They've lived here for quite some time, so it's good to see them. So it's having family near you was a bonus. So getting to spend time with people we don't see on a regular basis was a joy. I'll be introducing us in the morning service a little bit more, you pray for me. I woke up this morning with a slight cold and I thought yesterday it was allergies and I told them then, if I get a cold, a lot of times I lose my voice. And I preached a missions conference where I had to hold the mic at my mouth all week long. I mean, I held up here, it felt so bad, I told the pastor, I don't want my love offering, you can keep it because I feel bad that I wasn't able to do my normal preaching. And he said, listen, he said, you know, God can still use your squeaky voice, amen? And so I had a good missions conference, I had a good faith promise commitment and took on some more missionaries, including us. And so God blessed us in a great way during the course of that meeting. So you pray for me that I keep my voice during the course of the week. If you've not met us before, this is my wife, Linda, I'll have her stand very quickly. The Bible said, who so fond of the wife finds the good thing and obtain a favor of the Lord, amen? We've been married 58 years now, gone 59. God's been gracious to give us long life together and just mentioned bladder cancer, I've had it twice now. So I know what it's like to go through the surgery and I've had other cancers as well. So God's kept me going in spite of all that. And so I'm thankful for it. But we've been on the road now and revival work now, 31 years, I pastored 14 years in the San Diego area. And we've enjoyed our ministry, but we're getting a little bit older now. So traveling is getting harder. So it was always difficult for us to get on planes and fly to different places. And of course, we drive quite a bit. And in fact, we finished this meeting, we go to Harrisonburg for a meeting and be down there next week. And then we fly back to San Diego and then we're in the car four days later, driving to Missouri for meetings there. And then we'll be coming up in the Minnesota and down through South Dakota. So it's getting a little bit rougher. I was saying to Brother Sommerdorf yesterday, saw his big RV out there. We had an RV, but we got to the point where it was getting too difficult for us to use it. Get a little bit older, it's harder to set it up and tear it down every week. We had a fifth wheel. And so we get out of that and we've been just using our car and our RV or SUV and now I'm flying as well. But good to be with you. We'll be talking a bit more about revival during the course of the week. Now, revive us again that thy people may rejoice in thee, Psalm 85, six. Now, in a revival meeting, one of the things that's most important is prayer. And we had some prayer yesterday, but we need to continue to pray that God would work during the course of the week. Now, listen friends, I'll tell you, we desperately need revival in America. But we need it in our Bible believing churches. I said, I told them yesterday, judgment must begin at the house of God. We have got to have a time in our churches in America where we recognize the importance of revival within the local New Testament church. Now, I have had the blessing of seeing revivals take place in churches over the years. But I will say this, I've not seen much, I've not seen much of a revival spirit in recent years. Seems like there's been more of a resistance, more of a hindering spirit. People refusing to get right with God. People refusing to confess their sin and repent and turn from their wicked ways. I mean, that's become a real problem. There is a simple formula for revival, it's this, and of course we see it in 2 Chronicles 7, 14, and they say, well, now, Brother Meshon, you know that was given to the children of Israel, but as a practical application to us today, if my people, which are called by my name, number one, will humble themselves. Now, there's a concept. Will humble themselves and pray, amen, and seek my face. Now, hear this, and turn from their wicked ways. He's not talking to the world there, he's talking to his people. Turn from their wicked ways. He said, if you'll do that, those four things. Now, those four things are not the result of revival, it's what brings revival. It's what invites revival. That's not the fruit of revival, it's what brings revival. That's the formula for revival, four things. So if you do that, he said, listen, I'll answer your prayer, I'll forgive your sins, I'll heal your land. And I've said this for years, the only hope America has is a revived church. Unless we experience revival right here, and we see God do a work here, America's done. The answer's not in the White House, folks, the answer's in God's house. We got too busy with politics here in recent years, and listen, I'll tell you what, we need to understand and realize that you and I, who are saved by the grace of God, the Great Commission is what's most important, first of all, winning people to Jesus Christ one by one. But we've got to get our own household cleaned up. Would you agree with that? So I really do believe we need to give some thought and consideration to that this week as we go into the revival meeting. I'm serious about revival. I wanna see revival, amen, don't you? I really do, I want God to start with me. And that's an important thing. Haggai chapter one in your Bible today, let's go to Haggai chapter one. Haggai chapter one, a great little book, one of the minor prophets write stuff right between Zephaniah and Zechariah. Haggai chapter one, if you have a Cambridge-wide margin Bible like I do, it's on page 1002, amen? I said that in a church one time, the guy said, oh, I got one of those. So he got right to the page. Haggai chapter one, we're gonna start there, and then we'll just move around in the Bible just a bit here in the Sunday school hour. And I guess if I were to give my Sunday school lesson a topic this morning, it'd be this. Self-confrontation, self-examination, putting yourself on trial. Every once in a while, we just need to stop and we need to confront ourselves and examine ourselves in light of the word of God. And I thought about this the other day, I think sometimes we're too busy examining the world, but let me say something to your friends, the world's gonna do what the world's gonna do. They're just gonna do what they're gonna do. They're unsaved, they're lost, they don't know Christ, they don't have the word of God, so the world's going to do what the world's gonna do. We get so busy looking at the world, what the world's doing, that we don't stop and take time to look at ourselves. That's an important thing for us to sometimes get engaged in self-confrontation, self-examination. Now, I'm not talking about introspection here, and I'm not talking about contemporary mysticism or contemplative mysticism and some of the stuff that goes on today in some circles of churchianity. I'm talking about getting down and dirty with us, with ourselves, and taking a hard look at ourselves. And every once in a while, it's good to just stop and do that. But I want you to get Haggai chapter one, we'll go down through just a few verses here and just look at a couple of things that God just spoke to my heart about. Personally, my wife actually pointed this out to me, and I went back and I studied this whole book. And by the way, it's a post-exilic book, and of course, there's four of them. It's Haggai, Zechariah, Malachi, and Joel, four post-exilic books, and this is one of them. And it was when Cyrus gave the grant to the children of Israel to reestablish and rebuild the temple. We see that back in the book of Ezra. We see specifically what it says in Ezra chapter four. We're gonna find out that when their adversaries came against them, they left off building the temple. And for 14 years, the work remained dormant. And God was not really pleased with that. And of course, we know that Artaxerxes gave a mandate that they were stopped doing it because of the lies, the false things that were being said about them and what their agenda was and what their desires were and their purposes were. So they left off building the temple when they should have just continued on at some point. So talk about that as we get into this. But in Haggai chapter one, beginning in verse one, I read this, in the second year of Darius the king in the sixth month, that was Elal in the Hebrew calendar. It's September in the lunar calendar. In the first day of the month came the word of the Lord by Haggai, the prophet of Zerubbabel, the son of Shealtiel, governor of Judah and to Joshua, the son of Josedek, the high priest saying, thus speaketh the Lord of hosts saying, this people say, now watch this, this people say, the time has not come, the time that the Lord's house should be built. And of course, you can go back to reference it back to Ezra chapter four in verse 24 to see what all was taking place there, the whole dynamic. He said, they said, listen, the people say, the time has not come, the time that the Lord's house should be built. But look in verse three, then came the word of the Lord by Haggai the prophet saying, well, is it time for you? Oh, ye to dwell in your sealed houses and this house lie waste. God says, what about me? He said, you guys are so busy building your own houses, building your own mansions that you've forgotten about my house. He said, listen, you need to get back to building my house. It's important for you to get back to building my house. You need to reestablish the house of God. And they weren't doing that. Now, let me say this, and then I'll move on to the next verse because there's something here I want you to see. It's important to us this morning, just a very simple thing. There's nothing. something profound here. But let me say this, sometimes I think we just basically get so lackadaisical and so kind of, you know, we're in our comfort zone and we're kind of comfortable and enjoying our situation, our life the way it is right now that we don't stop and think about, now listen, am I moving forward for God? Am I doing what God wants me to do? Am I busy about God's work? Or am I just basically coasting along here in my Christian life? There's too much of that. We don't have much time left. You're going to hear me preach about that a little bit this morning. Let me tell you something, friends. We need to understand this. Jesus is coming soon. And the night cometh when no man can work. And so we all of us need to be busy about God's business. Now I'm going to walk down the aisle so I'm not forgetting these people up here. I'll come back in a minute. We need to be busy about God's business. And we've just gotten to the point, I think, where we've gotten into this spiritual lethargy and this spiritual apathy and we forgot about God. By the way, we see the children of Israel on two different occasions. God said to them, listen, you've forgotten me days without number. Well, we used to be a God-conscious nation, America. You remember that we were at one time a God-conscious nation? Amen? Our friends back here are from western Pennsylvania. My brother, I don't know how old you are, but I'm a little older maybe than you, I think. Amen? Pennsylvania was a blue state law. We were a blue law state. I'm sorry, I got that backwards. We were a blue law state. Everything was closed on Sunday. Nothing was open on the Lord's Day. I remember that. I grew up under that in the 40s and the 50s and early 60s and everything was closed. But the churches were open. And the neighborhood in which I lived, I was born in West Philadelphia and then we moved out to the suburbs. The neighborhood I lived in and my wife lived in, I don't know of anybody on my block that didn't go to church. Everybody went to church. Maybe not the right churches, but everybody went to church because we were a God-conscious nation. And then when they repealed the blue laws, I think it was in the late 60s, when they repealed the blue laws and we had them down here, Virginia had blue laws as well. When the blue laws got repealed and all the malls opened up and all the other stuff started happening and everything else was going on on Sundays and everybody was playing baseball and football and basketball and hockey, everything else going on on Sundays, all of a sudden people stopped going to church. So America was no longer a God-conscious country. So I can hear God say, well, what about me? What about me? So He says to the children of Israel, and that's a little off topic, but He says to the children of Israel, well, what about me? He says, is it time for you, O ye, to dwell in your sealed houses, and this house lie waste? Look at verse 5, Now therefore thus saith the Lord of hosts, say it, Consider your ways. He said, y'all need to consider your ways. I'm in Virginia, so I'm saying y'all, amen? Even though we're in northern Virginia, it's still y'all. We're below the Mason-Dixon line here, amen? He said, y'all need to consider your ways. And He says it not only once, but if you read through Haggai, He says it five times. So moving on to verse 6, He said, You have sown much, you bring in little. You eat, but you have not enough. You drink, but you're not filled with drink. You clothe you, but there is none warm. And he that earneth wages earneth wages, to put him into a bag with holes. He said, you know, you guys are so busy about you and not busy about me that you're not prospering at all. When you're not right with God and you're not in fellowship with God, you're not walking with the Lord, you're not walking in the Spirit of God, I guarantee you, you're not going to prosper. Now, we're not talking about the, you know, the stuff that these, you know, fools on TV talk about, about this health, wealth, and prosperity stuff, and faith, seed, and all that stuff. No, God said, listen, the reason you're not prospering is because you're not walking in accordance with My will. You get out of the will of God, you're not going to prosper. Let me give you a good example. If you're not tithing, and of course, most of you here are probably church members, you ought to be tithing. If you're not, you're living in sin. But He said, if you, listen, if you're not tithing, you're going to tithe somewhere else. If you don't tithe the Lord, you're going to tithe to the doctor, you're going to tithe to the dentist, you'll tithe to the auto mechanic. God is going to get that tithe somewhere. When I first got saved, I can remember, I got it somehow in my mind because I was an E6 in the Navy, that I, at that point in time, that there was no way that I could possibly tithe. I just, we weren't making a lot of money back in those days, and the military never made a lot of money, but we definitely weren't making a lot of money then. And I said, Lord, listen, you know I can't tithe. I mean, I just can't do it. I can't pay my bills. I'm overextended. My family won't eat if I tithe. My wife wasn't on board with that, having been saved seven years before I was, and she was a little bit more spiritually astute, and so I didn't tithe. All right? The first month I didn't tithe, my car broke down. Now hear this. I mean, this is my testimony. My car broke down. The starter went out. It was my home to work car. 1967 Datsun. What a piece of junk that was. The starter went out. So I went down to Napa and I bought a starter. Brought it home, put it in my car. And then I looked at the receipt, which I charged, by the way. Then I looked at the receipt. The starter cost me, to the penny, what my tithe would have been. I said, Lord, you've got my attention. And from that point forward, I tithe. Because I realized and understood the principle that we see right here. If you rob God, and we see that in Malchai chapter 3, if you rob God and said, listen, I'm going to tell you one thing right now, you're not going to prosper. I'm going to send the locust, the palmer worm, I'm going to send all kinds of critters into your fields to eat up your harvest. Not a good thing, So he said, you better tithe. So he said, listen, because you've not done this, you're not prospering. And you wonder why. I like what he says there. It's kind of a funny statement. But he says, and he that earneth wages, earneth wages to put into a bag with holes. So this comes in and goes right out again. Now, verse 7, he says again, look, Thus saith the Lord of hosts, Consider your ways. God wants us to consider our ways. When we go into a Bible meeting, that's what we ought to be doing. We should be examining ourselves. We ought to confront ourselves. The Word of God will confront us for sure. We ought to put ourselves on trial. That's a volitional thing. It's a matter of choice. A lot of people aren't going to pay any attention sometimes to the beck and call of the Holy Ghost. If I tell you this, I was preaching down in Torrance, California, one time, a bigger auditorium than this, a big crowd that morning. About halfway down here, back here, I'd ask your dad if that ever happened to him. About halfway down here, there's a woman sitting here. She's sitting right there, two kids in the middle, and her husband here. I'm preaching. I can't remember this day why I was preaching. While I'm preaching, she stuck her fingers in her ears. I said, now, that's kind of strange. So she sticks her fingers in her ears. Now not only is she sticking her fingers in her ears, now she's shaking her head no at me. I'm a young preacher, and I'm kind of irritated by this, I guess. It was bothering me. So I thought, you know, I'm just going to go right back there and stand right where she's sitting, and I'm going to preach right there. And the Holy Spirit, you know, that still small voice, that whisper, said, don't you do it. I'll take care of her. So when the service is over, she's at the back door. And I said to one of the deacons, I said, who is that woman? And he said, oh, that's the head deacon's wife. And they're back there shaking hands with people leaving the building. And I said, I'm going to go back there and chat with her. I said, that woman stuck her fingers in her ears while I'm preaching. Oh, she wouldn't do that. I said, she did it. I'm either lying or dying. And I was going to head right back there. The Spirit of God said, don't you do it. I'll handle that. Now, I've never heard anybody do that to me again. Now, it seems to me like I've read an account in the Bible where it says they stopped their ears. Well, that's kind of what she did. And I thought, why would somebody that claims to be saved by the grace of God do that? But you know what the truth of the matter is? Something got to her from the Word of God, she didn't want to hear it. Therefore, she was not willing to, you ready for this? It's not a, listen, it's not profoundity here. Therefore, she was not willing to examine her ways. Not willing to consider. Not willing to be confronted about her ways. Go back to 1 Corinthians, please. We'll go back there very quickly. 1 Corinthians chapter 11. Oh, good. You've got a clock back there. Praise the Lord. I can see you, God. I have to keep doing this. 1 Corinthians chapter 11. I want you to start in verse 17. I'll lay some foundation here. Of course, we know this passage of Scripture. We use this when we have a Lord's Supper. At least I've done it over the years. I'm sure you do it here as well. It's a classic application of the Lord's Supper. But 1 Corinthians chapter 11, verse 17. I'm going to read down through this very quickly. So now, in this I declare unto you, and I praise you not, that you come together not for the better, but for the worse. For first of all, when you come together in the church, I hear that there are divisions among you, and I partly believe it. Boy, it's a terrible thing to have divisions in the church. It's good when the brethren dwell together in unity. For there must be also heresies. In other words, they were developing sex within the church. There also must be heresies among you, that they which are proved may be made manifest among you. When you come together, therefore, at one place, this is not to eat the Lord's Supper. For in eating every one taketh before the other his own supper, and one is hungry and another is drunken.\" Man, there's a lot of preaching right here. \"'Well, what, have you not houses to eat and drink in, or despise ye the church of God, and shame them that have not? What shall I say unto you? Shall I praise you in this?' Well, I'm going to tell you what, I praise you not. \"'For I received of the Lord that which also I delivered unto you, that the Lord Jesus, the same night in which he was betrayed, took bread. And when he had given thanks, he broke it, and he said, Take, eat. This is my body, which is broken for you. This do in remembrance of me,' because it's a symbol of his death, it's an emblem, it's a memorial service. \"'After the same manner also he took the cup, and after he had supped and sang, This cup is the new testament of my blood. This do ye as often as ye drink it in remembrance of me. For as often as ye eat this bread and drink this cup, ye do show, demonstrate the Lord's death until he come.'\" Verse 27, \"'Wherefore, whose service shall eat this bread and drink of this cup unworthily?' By the way, none of us are worthy of the death, burial, and blood of Jesus Christ. You think about his death, burial, and resurrection as we celebrate the Lord's Supper, we think about the precious blood of Jesus. None of us are worthy of that. He said, so you drink this cup of this Lord, not to drink the cup of the Lord unworthily, carelessly, or reverently, shall be guilty of the body and the blood of the Lord. Now look at this. \"'But let a man examine himself,' you see that, \"'and so let him eat of that bread and drink of that cup. For he that eateth and drinketh unworthily or carelessly eateth and drinketh damnation or judgment to himself, not discerning or honoring the Lord's body. For this cause many are weak and sickly among you, many sleep. For if we would judge ourselves, we should not be judged.'\" Listen, if we would judge ourselves and get things right with God, we wouldn't have to experience chastisement. God wouldn't have to judge our sins. But when we are judged, we're chastened to the Lord. \"'For whom, Lord, lovely chasteneth, that we should not be condemned by the world.'\" Amen. It just basically proves you're saved when God chastises you. No chastisement, you're not saved. That's kind of what he's saying. But I want you to see this. He said, you need to examine yourself. He said, don't come to the Lord's table and do so flippantly or irreverently. Examine yourself. God once again says, listen, consider your ways and examine yourself. I can show you a whole lot of teaching in the Bible that speaks about this. Examine yourself. Just listen to this. Job 13, 23. \"'How many are mine iniquities and sins?' Job says. \"'Well, make me to know my transgression and my sin.'\" Psalm 26, 2, \"'Examine me, O Lord, and prove me. Try my reins and my heart.'\" Psalm 4, 4, \"'Stand in awe and sin not. Commune with your own heart upon your bed and be still.'\" Selah. Psalm 77, 6, \"'I call to remembrance my song in the night. I commune with my own heart, and my spirit may diligent search.'\" That's talking about intense examination. Psalm 119, 59, like this one, \"'I thought on my ways and turned my feet unto thy testimonies.'\" Wow. Well, there's something right there. That's something to think about right there. He said, listen, I'll tell you what I did. I thought on my ways. I mean, that's intentionally stopping and thinking about my ways. God said at one point somewhere along the line, I remember reading, your ways are not my ways, friends. Sometimes you've chosen the wrong way, not my way. And His way's the right way, always the right way. He said, listen, I stopped. He said, I thought on my ways, and as a result, I turned my feet unto thy testimonies. Now, that's a good thing. Lamentations 340. I like this one, too. \"'Let us search and try our ways, and turn again unto the Lord.'\" Wow. Galatians 6, 4, \"'But let every man prove his own work, and then shall he have rejoicing in himself alone, not in another.'\" Second Corinthians 13, 5, this is an important one, \"'Examine yourselves.'\" \"'Examine yourselves,' Paul says to the Corinthian church, \"'Examine yourselves,' and he had a reason for saying this, \"'Examine yourselves whether you be in the faith. Prove your own selves. Know you not your own selves, how that Jesus Christ is in you, except you be reprobates?' So Paul said, listen, you need to make sure you're saved.\" Sometimes, you know, we've got people come into revival meetings just aren't saved. I was preaching at my home church last week, and I used the Ten Commandments. I went through all of the Ten Commandments, not the ten suggestions, the ten opinions. Galatians chapter 20, I went down through each one of the Ten Commandments, and talked about them, and explained why God gave the moral law. Why did God give us the Ten Commandments? Well, Galatians chapter 3 gives the answer. As a schoolmaster, to bring us to Christ, to convict us of sin, because there's no man except the God-man, Christ Jesus, that was ever capable of keeping the law. And in fact, the Bible says the law was fulfilled in Him. So we know He can't keep the law, so as you read down through the Ten Commandments, somewhere along the line, you ought to get convicted. For an unsaved person, I use the Ten Commandments in soul winning. I'm not one of these one, two, three, pray after me guys. I don't like this easy decisionism. I want people to know why they're lost, and know what the Bible says about being lost. And then you can lead them to Christ. You can't get somebody saved, get them lost first, amen? So I want to get them lost. You can get them lost in the Ten Commandments. Well, sir, have you ever told a lie? Thou shalt not bear false witness. Have you ever told a lie? Well, yeah, I've done that. Well, then the Bible says you're a liar. You've got to be careful with how you approach this. Amen. Amen. Well, have you ever taken anything that's not yours? No, yeah, when I was a kid, I stole something. I shoplifted in a candy store. I said, well, then you're a thief. The Bible says you're a lying thief. Have you ever coveted something that's not yours? Maybe your neighbor's car. Maybe you've got a Toyota. He's got a Lexus. You'd like to have his Lexus. Well, thou shalt not covet. So you're a coveting, lying thief. I mean, you can go on and on. You can go right on down the list. Now, you've got to be careful with it. Once again, you have to be careful how you approach people with that. But you can get them lost that way. Well, Glaser's chapter 3 says, well, what is the purpose of the law? Well, the purpose of the law is to be a schoolmaster to convictives of sin. The cause of the recognized were lost, it turned to Christ to be saved. So I mean, you can use the law as an effective tool. So it's a matter of people examining themselves. And so I wanted our church to see that. I said, now, we've got some people here this morning, I'll guarantee you, we've probably got some church members here that are lost. Just because you're a church member, it doesn't impress me. In fact, it doesn't impress God. Maybe you're a tithing church member and you take the Lord's Supper and all the rest of it. And maybe you're even out knocking doors with us on Saturdays, but you've never been born again. Examine yourselves, whether you be in the faith. Because you've never been changed. You may have changed the outside. Oh, here we go now. You may have changed the outside, but the heart's never been changed. You got a three-piece suit and a King James haircut, but your heart's never been changed. And because your heart's never been changed, it shows up on the outside in the way you live your life. And you've never been changed. You live a two-standard life. You'll live one way outside the church and one way in the church because it's more important you have people see you than it is how God sees you. Amen. Preacher, that's good. I mean, it really does convict people. So I want them to see that. Well, we had two people saved at the service. Now I don't know, they weren't church members that I know of. Amen. I wrote this down for me. The hardest thing to do is to honestly examine ourselves. And the reason that we won't do it is because we sometimes engage in self-deception. Well, I'm really okay. It makes you feel easy and comfortable. We can deceive ourselves sometimes when we don't examine ourselves the way we should. So we ought to examine ourselves, inspect ourselves in detail, examine ourselves and look at ourselves thoroughly in accordance with the Word of God. Amen. Now I've got to move along here. I don't have much time left. Oswald J. Smith put this out. I really like this. He's a great Canadian pastor. Some of you have probably read some of his material. He has a lot of good material out there, especially about missions. But he wrote a little thing about self-examination. He gave a list. And in the entire list, are we guilty? Let me just quickly read you the list. Number one, this is when it comes to self-examination. Number one, have we forgiven everyone? Is there any malice, spite, hatred or enmity in our hearts? Do we cherish grudges? Have we refused to be reconciled? We ought to be reconciled to our brother. If you have one against another, you should make that right with him. During revival times, that's one of the things that sometimes happens. I've seen it happen in two churches. We had a revival break out in two churches, and I had no idea, preaching that meeting, that half the church was at odds with the other half. And in one church, they were all upset with the pastor's wife. And during the invitation, she's playing the piano, had to stop because people are coming, weeping, asking for her forgiveness and hugging her because they had ought against her, and asked her forgiveness. The song leader got up and said, I preached on pride the night before. We'd extended the meeting out another day. And he got up and he said, listen, he said, I'm just full of pride. He said, I think I raised perfect kids, had a perfect home, had a perfect marriage, and I thought we had every hair in place, and the rest of the church was just really in serious trouble. And his wife got up and said the same thing. And revival broke out in that place, and I just went back and sat in the back back there and said, hallelujah, praise God, just let it go and happen, turn it over to the pastor and let him just handle the thing. And it went on and on and on. And it all had to do with reconciliation amongst the church. the brethren, saw it happen to another church. Number two, do we get angry? Come on now. Do we get angry? Are there any uprisings within? Is it true that we still lose our tempers? Does wrath hold us at times in its grip? Do you get angry? I get angry sometimes driving through Los Angeles. It's not a rush hour. It's a parking lot, and I just can't handle traffic, and I get angry. And my wife, I said to men yesterday, my wife says, you just stress me out. When we were doing the RV, it was even worse. And she said, do you just have joy? And I said, oh yeah, I'm really enjoying this, praise the Lord. Number three, is there any feeling of jealousy when another's preferred before us? Does it make us envious and uncomfortable? Do we get jealous of those who can pray, and speak, and do things better than we can? Number four, do we get impatient and irritated? I had someone tell me one time, pastor, I just want to let you know you irritate me. I said, wait a minute, get in line, brother. What can I tell a guy that says that? I can only say, well, I'm sorry, I mean, how did I irritate you? And then he's going to give me a list, you know. Do little things vex and annoy, or are we sweet, calm, and unruffled under all circumstances? Number five, are we offended easily? There's a big one. When people fail to notice us and pass by without speaking, does it hurt? If others are made much of, and we are neglected, how do we feel about it? Number six, is there any pride in our hearts? No, no, no, no, none of us ever deal with that. Come on now, are we puffed up? Do we think a great deal of our own position and attainments? Number seven, have we been dishonest? Is our business open and above reproach? Do we give a yard for a yard and a pound for a pound? Are we honest in our statements or do we exaggerate and thus convey false impressions? I submit unto you that the number one most probably insidious, pervasive sin amongst Christian people is lying. We come forth from the womb speaking lies. We're born liars. Unless the Holy Spirit of God has control of that, we can still be involved in lying, and we have a tendency to exaggerate when it benefits us. Number eight, have we been gossiping about people? No, we don't do that in Baptist churches. I've got an example, I'll use it later. Do we slander the character of others? Well, that seems like that's almost like a spectator sport in America today. People just slandering each other, tearing each other apart, so much divisions and vitriol and so much bitterness and angst. It's amazing what's happened to our society today. Everybody's impugning each other's character and tearing each other apart to try to get their way and to put forth their own agenda. It's disgusting. Do we slander the character of others? Are we tail bearers in busybodies? Number nine, do we criticize unlovingly, harshly, severely? Are we always finding fault and looking for flaws in others? Yeah, we do that. Number 10, do we rob God? Have we stolen time that belongs to Him? Has our money been withheld? Number 11, are we guilty of the sin of unbelief? In spite of all He has done for us, do we still refuse to believe the promises of His Word? God is good for His Word. Aren't you glad for that? Number 12, have we committed the sin of prayerlessness? Are we intercessors? Do we pray? How much time are we spending on our knees? Have we crowded prayer out of our lives? Number 13, are we neglecting God's Word? How many chapters do we read each day? Are we Bible students? Do we draw our source of supply from the Scriptures? Number 14, are we burdened for the salvation of souls? Have we a love for the lost? Is there any compassion in our hearts for those who are perishing? Number 15, have we failed to confess Christ openly? Are we ashamed of Jesus? Do we keep our mouths closed when we're surrendered by worldly people we're witnessing daily? Number 16, are our lives filled with lightness and frivolity? Is our conduct unseemly? Would the world, by our actions, consider us on its side? Well, that's a good one there. Number 17, have we wronged anyone and failed to make restitution or has the spirit of Zacchaeus possessed us? Have we restored the many little things that God has shown us? Number 18, are we worried or anxious? Do we fail to trust God for our temporal and spiritual needs? Are we constantly crossing bridges before we come to them? Number 19, are we guilty of lustful thoughts? Do we allow our minds to harbor impure and unholy imaginations? That's a big problem today with men because I'll tell you what, you can't hardly go out in the public anymore and not be offended by what we see or be enticed by it. It's sad. A. W. Tozer wrote this in his classic work The Pursuit of God. He said this, he said, the man who has struggled to purify himself and has had nothing but repeated failures will experience real relief when he stops tinkering with his soul and looks away to the perfect one. While he looks at Christ, the very thing he has so long been trying to do, we'll be getting done with him. We should examine ourselves in light of the truth being revealed to us from Scripture and allow God's Word to convict us and change us. At the same time, we must humbly admit our inability to change ourselves and rely on the power of ourselves and rely on the power of the Holy Spirit within to transform us into the image of Christ. So, when you consider all these things, this idea of self-examination, self-confrontation, to me personally is a very important thing when it comes to revival, to revival. When God's willing to send revival, the problem's not with him. The problem's not with God, the problem's with us. And you say, well, that sounds like kind of a blanking indictment. Well, in some ways it is. I mean, we really have to look at us, not only just individually, but corporately as well. You know? One of the things that I've seen in revival is this. We talked about this, we're talking about this a couple of times since we've been here. One of the things I've seen in revival about this is that when revival comes, man, the old-fashioned excitement that one time permeated our churches. I mean, just the joy, the zeal. Once again, I'll bring it up a little bit, the sporting in the morning message. Let me tell you what, the joy and the zeal that really ought to be in the house of God and the excitement ought to be there, the enthusiasm ought to be there. When revival comes, God restores that. You know? Some people come to church, look like they've been sucking lemon juice through PVC pipe all week long, man, they just come to work sour. You know? God doesn't want us to come to the house of the Lord that way. We ought to have joy, joy unspeakable full glory. We ought to be excited about something. You know, the world's excited about all kinds of things. Amen? I have a picture on my phone, Lord forgive me, I have a picture on my phone of a 2024 Corvette Z06. No, I love Corvettes. Amen? I'm 77 years old, I have no business even thinking about that. But if God give me one of them, I sure drive it, amen? I sure would. And let me tell you this, I mean, I was in a car dealer the other day getting my car serviced and there's one out in the showroom floor, it's one of the only ones on the West Coast. It's a Copa, it's a beautiful car. And I'm looking at this thing, man, I'm looking at it and I'm saying, wow, this is some car, let's take a picture of it. Guy said, hey, can I sell this to you? I said, you could, but I said I couldn't afford it, it was $172,000. And I said, yeah, I said, it's looking good, man. I said, that thing looks fast just sitting there. And he said, do you think you can handle this car? I said, try me out. He said, I'll road test it right now. Well, see, now that excites me. I just, I'm a car guy, I'm an aviation guy for one thing, but I'm a car guy and I like cars and the faster the better. And sometimes the Lord has to convict me of that. Now preacher, you don't need to be thinking about that stuff. Now the car excites me, just looking at it excited me. The thought of having one really excites me. But here's the thing, if something like that, some kind of a material thing like that can excite us, then what about the things of God? Why don't we get excited about the things of God? You know? So we ought to get excited. We ought to be enthusiastic. We ought to rejoice about the things of the Lord. God's been good to us. For God is good and his mercy endureth forever. God's been so good. I praise the Lord for it. We need to examine ourselves and sometimes engage in self-confrontation. Father, we thank you Lord this morning for what we've seen in that word, just a very simple Sunday school lesson, but yet still at the same time, I think very important. So God, as we begin this revival meeting this week, I pray that we would be willing to spend some time as did David. We see in the Psalms that he many times would, even in the early hours of the morning, in the middle of the night at times, he would lay in his bed and he would muse and he would consider and he'd think about and examine himself. Lord, sometimes we just need to stop and do that as well. I pray God that we would this week just seek your face and Lord, we just bow before you God, cry out your name and ask that you would once again breathe fresh upon us. Oh Spirit of God, do that which only you can do. Work in our hearts and lives. Begin with me, oh God, I pray. I'm a needy preacher. I need your help and I need you to speak to me this week as well. So Lord, I pray that we would just have a meeting this week which would be honoring and glorifying to you. We'll thank you for it in advance in Jesus' name. Amen. Pastor? Amen. You are dismissed. ",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.5199999809265137,
      "text": " last time, so it's been a while since we're here."
    },
    {
      "id": 1,
      "start": 2.5199999809265137,
      "end": 4.960000038146973,
      "text": " We were supposed to be here back during COVID."
    },
    {
      "id": 2,
      "start": 4.960000038146973,
      "end": 8.039999961853027,
      "text": " And of course, because of COVID, we weren't able to come"
    },
    {
      "id": 3,
      "start": 8.039999961853027,
      "end": 9.760000228881836,
      "text": " and we had to cancel out the meeting"
    },
    {
      "id": 4,
      "start": 9.760000228881836,
      "end": 11.399999618530273,
      "text": " that we had scheduled then."
    },
    {
      "id": 5,
      "start": 11.399999618530273,
      "end": 15.4399995803833,
      "text": " So the Lord was gracious to let us come this year in 2023."
    },
    {
      "id": 6,
      "start": 15.4399995803833,
      "end": 17.8799991607666,
      "text": " And I tell you, it's good to be here, amen?"
    },
    {
      "id": 7,
      "start": 17.8799991607666,
      "end": 20.399999618530273,
      "text": " In fact, at this point in life, it's good to be anywhere."
    },
    {
      "id": 8,
      "start": 20.399999618530273,
      "end": 23.1200008392334,
      "text": " So I'm just thankful for the opportunity to be back here"
    },
    {
      "id": 9,
      "start": 23.1200008392334,
      "end": 26.280000686645508,
      "text": " in Virginia once again, in beautiful Oakton."
    },
    {
      "id": 10,
      "start": 26.280000686645508,
      "end": 28.31999969482422,
      "text": " And we've been getting around a little bit,"
    },
    {
      "id": 11,
      "start": 28.31999969482422,
      "end": 31.799999237060547,
      "text": " my cousin and his wife live just south of here."
    },
    {
      "id": 12,
      "start": 31.799999237060547,
      "end": 33.720001220703125,
      "text": " And so we went down and visited with them yesterday"
    },
    {
      "id": 13,
      "start": 33.720001220703125,
      "end": 34.560001373291016,
      "text": " for a little while."
    },
    {
      "id": 14,
      "start": 34.560001373291016,
      "end": 35.720001220703125,
      "text": " They've lived here for quite some time,"
    },
    {
      "id": 15,
      "start": 35.720001220703125,
      "end": 36.68000030517578,
      "text": " so it's good to see them."
    },
    {
      "id": 16,
      "start": 36.68000030517578,
      "end": 39.36000061035156,
      "text": " So it's having family near you was a bonus."
    },
    {
      "id": 17,
      "start": 39.36000061035156,
      "end": 41.400001525878906,
      "text": " So getting to spend time with people we don't see"
    },
    {
      "id": 18,
      "start": 41.400001525878906,
      "end": 43.91999816894531,
      "text": " on a regular basis was a joy."
    },
    {
      "id": 19,
      "start": 43.91999816894531,
      "end": 46.20000076293945,
      "text": " I'll be introducing us in the morning service"
    },
    {
      "id": 20,
      "start": 46.20000076293945,
      "end": 47.31999969482422,
      "text": " a little bit more, you pray for me."
    },
    {
      "id": 21,
      "start": 47.31999969482422,
      "end": 49.7599983215332,
      "text": " I woke up this morning with a slight cold"
    },
    {
      "id": 22,
      "start": 49.7599983215332,
      "end": 51.439998626708984,
      "text": " and I thought yesterday it was allergies"
    },
    {
      "id": 23,
      "start": 51.439998626708984,
      "end": 53.52000045776367,
      "text": " and I told them then, if I get a cold,"
    },
    {
      "id": 24,
      "start": 53.52000045776367,
      "end": 55.63999938964844,
      "text": " a lot of times I lose my voice."
    },
    {
      "id": 25,
      "start": 55.68000030517578,
      "end": 58.279998779296875,
      "text": " And I preached a missions conference"
    },
    {
      "id": 26,
      "start": 58.279998779296875,
      "end": 60.400001525878906,
      "text": " where I had to hold the mic at my mouth all week long."
    },
    {
      "id": 27,
      "start": 60.400001525878906,
      "end": 61.84000015258789,
      "text": " I mean, I held up here, it felt so bad,"
    },
    {
      "id": 28,
      "start": 61.84000015258789,
      "end": 64.44000244140625,
      "text": " I told the pastor, I don't want my love offering,"
    },
    {
      "id": 29,
      "start": 64.44000244140625,
      "end": 66.19999694824219,
      "text": " you can keep it because I feel bad"
    },
    {
      "id": 30,
      "start": 66.19999694824219,
      "end": 68.68000030517578,
      "text": " that I wasn't able to do my normal preaching."
    },
    {
      "id": 31,
      "start": 68.68000030517578,
      "end": 70.04000091552734,
      "text": " And he said, listen, he said, you know,"
    },
    {
      "id": 32,
      "start": 70.04000091552734,
      "end": 73.44000244140625,
      "text": " God can still use your squeaky voice, amen?"
    },
    {
      "id": 33,
      "start": 73.44000244140625,
      "end": 75.08000183105469,
      "text": " And so I had a good missions conference,"
    },
    {
      "id": 34,
      "start": 75.08000183105469,
      "end": 76.55999755859375,
      "text": " I had a good faith promise commitment"
    },
    {
      "id": 35,
      "start": 76.55999755859375,
      "end": 79.9000015258789,
      "text": " and took on some more missionaries, including us."
    },
    {
      "id": 36,
      "start": 79.9000015258789,
      "end": 82.81999969482422,
      "text": " And so God blessed us in a great way"
    },
    {
      "id": 37,
      "start": 82.81999969482422,
      "end": 83.91999816894531,
      "text": " during the course of that meeting."
    },
    {
      "id": 38,
      "start": 83.91999816894531,
      "end": 85.91999816894531,
      "text": " So you pray for me that I keep my voice"
    },
    {
      "id": 39,
      "start": 85.91999816894531,
      "end": 87.4000015258789,
      "text": " during the course of the week."
    },
    {
      "id": 40,
      "start": 87.4000015258789,
      "end": 90.08000183105469,
      "text": " If you've not met us before, this is my wife, Linda,"
    },
    {
      "id": 41,
      "start": 90.08000183105469,
      "end": 91.27999877929688,
      "text": " I'll have her stand very quickly."
    },
    {
      "id": 42,
      "start": 91.27999877929688,
      "end": 92.76000213623047,
      "text": " The Bible said, who so fond of the wife"
    },
    {
      "id": 43,
      "start": 92.76000213623047,
      "end": 96.16000366210938,
      "text": " finds the good thing and obtain a favor of the Lord, amen?"
    },
    {
      "id": 44,
      "start": 96.16000366210938,
      "end": 98.68000030517578,
      "text": " We've been married 58 years now, gone 59."
    },
    {
      "id": 45,
      "start": 98.68000030517578,
      "end": 101.87999725341797,
      "text": " God's been gracious to give us long life together"
    },
    {
      "id": 46,
      "start": 101.87999725341797,
      "end": 104.87999725341797,
      "text": " and just mentioned bladder cancer, I've had it twice now."
    },
    {
      "id": 47,
      "start": 104.87999725341797,
      "end": 107.12000274658203,
      "text": " So I know what it's like to go through the surgery"
    },
    {
      "id": 48,
      "start": 107.12000274658203,
      "end": 108.87999725341797,
      "text": " and I've had other cancers as well."
    },
    {
      "id": 49,
      "start": 108.87999725341797,
      "end": 111.69999694824219,
      "text": " So God's kept me going in spite of all that."
    },
    {
      "id": 50,
      "start": 111.69999694824219,
      "end": 113.0,
      "text": " And so I'm thankful for it."
    },
    {
      "id": 51,
      "start": 113.0,
      "end": 116.55999755859375,
      "text": " But we've been on the road now and revival work now,"
    },
    {
      "id": 52,
      "start": 116.55999755859375,
      "end": 120.36000061035156,
      "text": " 31 years, I pastored 14 years in the San Diego area."
    },
    {
      "id": 53,
      "start": 120.36000061035156,
      "end": 122.27999877929688,
      "text": " And we've enjoyed our ministry,"
    },
    {
      "id": 54,
      "start": 122.27999877929688,
      "end": 124.0999984741211,
      "text": " but we're getting a little bit older now."
    },
    {
      "id": 55,
      "start": 124.0999984741211,
      "end": 125.4000015258789,
      "text": " So traveling is getting harder."
    },
    {
      "id": 56,
      "start": 125.4000015258789,
      "end": 129.16000366210938,
      "text": " So it was always difficult for us to get on planes"
    },
    {
      "id": 57,
      "start": 129.16000366210938,
      "end": 130.36000061035156,
      "text": " and fly to different places."
    },
    {
      "id": 58,
      "start": 130.36000061035156,
      "end": 131.8000030517578,
      "text": " And of course, we drive quite a bit."
    },
    {
      "id": 59,
      "start": 131.8000030517578,
      "end": 133.83999633789062,
      "text": " And in fact, we finished this meeting,"
    },
    {
      "id": 60,
      "start": 133.83999633789062,
      "end": 135.9199981689453,
      "text": " we go to Harrisonburg for a meeting"
    },
    {
      "id": 61,
      "start": 135.9199981689453,
      "end": 136.9600067138672,
      "text": " and be down there next week."
    },
    {
      "id": 62,
      "start": 136.9600067138672,
      "end": 139.32000732421875,
      "text": " And then we fly back to San Diego"
    },
    {
      "id": 63,
      "start": 139.32000732421875,
      "end": 140.82000732421875,
      "text": " and then we're in the car four days later,"
    },
    {
      "id": 64,
      "start": 140.82000732421875,
      "end": 142.8800048828125,
      "text": " driving to Missouri for meetings there."
    },
    {
      "id": 65,
      "start": 143.72000122070312,
      "end": 144.55999755859375,
      "text": " And then we'll be coming up in the Minnesota"
    },
    {
      "id": 66,
      "start": 144.55999755859375,
      "end": 145.67999267578125,
      "text": " and down through South Dakota."
    },
    {
      "id": 67,
      "start": 145.67999267578125,
      "end": 147.83999633789062,
      "text": " So it's getting a little bit rougher."
    },
    {
      "id": 68,
      "start": 147.83999633789062,
      "end": 149.32000732421875,
      "text": " I was saying to Brother Sommerdorf yesterday,"
    },
    {
      "id": 69,
      "start": 149.32000732421875,
      "end": 152.0,
      "text": " saw his big RV out there."
    },
    {
      "id": 70,
      "start": 152.0,
      "end": 153.9600067138672,
      "text": " We had an RV, but we got to the point"
    },
    {
      "id": 71,
      "start": 153.9600067138672,
      "end": 156.55999755859375,
      "text": " where it was getting too difficult for us to use it."
    },
    {
      "id": 72,
      "start": 156.55999755859375,
      "end": 158.1999969482422,
      "text": " Get a little bit older, it's harder to set it up"
    },
    {
      "id": 73,
      "start": 158.1999969482422,
      "end": 159.16000366210938,
      "text": " and tear it down every week."
    },
    {
      "id": 74,
      "start": 159.16000366210938,
      "end": 160.52000427246094,
      "text": " We had a fifth wheel."
    },
    {
      "id": 75,
      "start": 160.52000427246094,
      "end": 163.36000061035156,
      "text": " And so we get out of that and we've been just using our car"
    },
    {
      "id": 76,
      "start": 163.36000061035156,
      "end": 167.16000366210938,
      "text": " and our RV or SUV and now I'm flying as well."
    },
    {
      "id": 77,
      "start": 167.16000366210938,
      "end": 168.0,
      "text": " But good to be with you."
    },
    {
      "id": 78,
      "start": 168.0,
      "end": 169.36000061035156,
      "text": " We'll be talking a bit more about revival"
    },
    {
      "id": 79,
      "start": 169.36000061035156,
      "end": 170.17999267578125,
      "text": " during the course of the week."
    },
    {
      "id": 80,
      "start": 170.17999267578125,
      "end": 172.83999633789062,
      "text": " Now, revive us again that thy people may rejoice"
    },
    {
      "id": 81,
      "start": 173.8000030517578,
      "end": 175.55999755859375,
      "text": " in thee, Psalm 85, six."
    },
    {
      "id": 82,
      "start": 175.55999755859375,
      "end": 176.86000061035156,
      "text": " Now, in a revival meeting,"
    },
    {
      "id": 83,
      "start": 176.86000061035156,
      "end": 180.0,
      "text": " one of the things that's most important is prayer."
    },
    {
      "id": 84,
      "start": 180.0,
      "end": 181.39999389648438,
      "text": " And we had some prayer yesterday,"
    },
    {
      "id": 85,
      "start": 181.39999389648438,
      "end": 183.55999755859375,
      "text": " but we need to continue to pray that God would work"
    },
    {
      "id": 86,
      "start": 183.55999755859375,
      "end": 186.0,
      "text": " during the course of the week."
    },
    {
      "id": 87,
      "start": 186.0,
      "end": 187.94000244140625,
      "text": " Now, listen friends, I'll tell you,"
    },
    {
      "id": 88,
      "start": 187.94000244140625,
      "end": 190.0,
      "text": " we desperately need revival in America."
    },
    {
      "id": 89,
      "start": 191.67999267578125,
      "end": 195.32000732421875,
      "text": " But we need it in our Bible believing churches."
    },
    {
      "id": 90,
      "start": 195.32000732421875,
      "end": 196.83999633789062,
      "text": " I said, I told them yesterday,"
    },
    {
      "id": 91,
      "start": 196.83999633789062,
      "end": 198.67999267578125,
      "text": " judgment must begin at the house of God."
    },
    {
      "id": 92,
      "start": 198.67999267578125,
      "end": 202.9199981689453,
      "text": " We have got to have a time in our churches in America"
    },
    {
      "id": 93,
      "start": 202.9199981689453,
      "end": 205.0800018310547,
      "text": " where we recognize the importance of revival"
    },
    {
      "id": 94,
      "start": 205.0800018310547,
      "end": 207.66000366210938,
      "text": " within the local New Testament church."
    },
    {
      "id": 95,
      "start": 208.55999755859375,
      "end": 211.24000549316406,
      "text": " Now, I have had the blessing of seeing revivals take place"
    },
    {
      "id": 96,
      "start": 211.24000549316406,
      "end": 213.1999969482422,
      "text": " in churches over the years."
    },
    {
      "id": 97,
      "start": 213.1999969482422,
      "end": 215.16000366210938,
      "text": " But I will say this, I've not seen much,"
    },
    {
      "id": 98,
      "start": 215.16000366210938,
      "end": 217.9600067138672,
      "text": " I've not seen much of a revival spirit in recent years."
    },
    {
      "id": 99,
      "start": 219.1999969482422,
      "end": 221.4600067138672,
      "text": " Seems like there's been more of a resistance,"
    },
    {
      "id": 100,
      "start": 222.60000610351562,
      "end": 225.36000061035156,
      "text": " more of a hindering spirit."
    },
    {
      "id": 101,
      "start": 225.36000061035156,
      "end": 228.60000610351562,
      "text": " People refusing to get right with God."
    },
    {
      "id": 102,
      "start": 229.5,
      "end": 232.27999877929688,
      "text": " People refusing to confess their sin and repent"
    },
    {
      "id": 103,
      "start": 232.27999877929688,
      "end": 234.52000427246094,
      "text": " and turn from their wicked ways."
    },
    {
      "id": 104,
      "start": 234.52000427246094,
      "end": 236.72000122070312,
      "text": " I mean, that's become a real problem."
    },
    {
      "id": 105,
      "start": 237.6199951171875,
      "end": 239.75999450683594,
      "text": " There is a simple formula for revival, it's this,"
    },
    {
      "id": 106,
      "start": 239.75999450683594,
      "end": 242.72000122070312,
      "text": " and of course we see it in 2 Chronicles 7, 14,"
    },
    {
      "id": 107,
      "start": 242.72000122070312,
      "end": 244.16000366210938,
      "text": " and they say, well, now, Brother Meshon,"
    },
    {
      "id": 108,
      "start": 244.16000366210938,
      "end": 245.8000030517578,
      "text": " you know that was given to the children of Israel,"
    },
    {
      "id": 109,
      "start": 245.8000030517578,
      "end": 248.33999633789062,
      "text": " but as a practical application to us today,"
    },
    {
      "id": 110,
      "start": 248.33999633789062,
      "end": 250.25999450683594,
      "text": " if my people, which are called by my name,"
    },
    {
      "id": 111,
      "start": 250.25999450683594,
      "end": 252.17999267578125,
      "text": " number one, will humble themselves."
    },
    {
      "id": 112,
      "start": 253.25999450683594,
      "end": 255.24000549316406,
      "text": " Now, there's a concept."
    },
    {
      "id": 113,
      "start": 255.24000549316406,
      "end": 258.1600036621094,
      "text": " Will humble themselves and pray, amen,"
    },
    {
      "id": 114,
      "start": 258.7200012207031,
      "end": 259.9599914550781,
      "text": " and seek my face."
    },
    {
      "id": 115,
      "start": 259.9599914550781,
      "end": 263.760009765625,
      "text": " Now, hear this, and turn from their wicked ways."
    },
    {
      "id": 116,
      "start": 264.9599914550781,
      "end": 266.32000732421875,
      "text": " He's not talking to the world there,"
    },
    {
      "id": 117,
      "start": 266.32000732421875,
      "end": 268.2799987792969,
      "text": " he's talking to his people."
    },
    {
      "id": 118,
      "start": 268.2799987792969,
      "end": 270.9599914550781,
      "text": " Turn from their wicked ways."
    },
    {
      "id": 119,
      "start": 270.9599914550781,
      "end": 274.0799865722656,
      "text": " He said, if you'll do that, those four things."
    },
    {
      "id": 120,
      "start": 274.0799865722656,
      "end": 275.9200134277344,
      "text": " Now, those four things are not the result of revival,"
    },
    {
      "id": 121,
      "start": 275.9200134277344,
      "end": 277.55999755859375,
      "text": " it's what brings revival."
    },
    {
      "id": 122,
      "start": 277.55999755859375,
      "end": 278.9200134277344,
      "text": " It's what invites revival."
    },
    {
      "id": 123,
      "start": 278.9200134277344,
      "end": 282.0799865722656,
      "text": " That's not the fruit of revival, it's what brings revival."
    },
    {
      "id": 124,
      "start": 282.0799865722656,
      "end": 284.79998779296875,
      "text": " That's the formula for revival, four things."
    },
    {
      "id": 125,
      "start": 284.79998779296875,
      "end": 287.67999267578125,
      "text": " So if you do that, he said, listen, I'll answer your prayer,"
    },
    {
      "id": 126,
      "start": 288.2799987792969,
      "end": 290.67999267578125,
      "text": " I'll forgive your sins, I'll heal your land."
    },
    {
      "id": 127,
      "start": 291.55999755859375,
      "end": 293.44000244140625,
      "text": " And I've said this for years,"
    },
    {
      "id": 128,
      "start": 293.44000244140625,
      "end": 295.739990234375,
      "text": " the only hope America has is a revived church."
    },
    {
      "id": 129,
      "start": 297.20001220703125,
      "end": 299.760009765625,
      "text": " Unless we experience revival right here,"
    },
    {
      "id": 130,
      "start": 299.760009765625,
      "end": 302.6000061035156,
      "text": " and we see God do a work here, America's done."
    },
    {
      "id": 131,
      "start": 303.8800048828125,
      "end": 305.3599853515625,
      "text": " The answer's not in the White House, folks,"
    },
    {
      "id": 132,
      "start": 305.3599853515625,
      "end": 306.760009765625,
      "text": " the answer's in God's house."
    },
    {
      "id": 133,
      "start": 307.7200012207031,
      "end": 309.9599914550781,
      "text": " We got too busy with politics here in recent years,"
    },
    {
      "id": 134,
      "start": 309.9599914550781,
      "end": 311.3599853515625,
      "text": " and listen, I'll tell you what,"
    },
    {
      "id": 135,
      "start": 311.3599853515625,
      "end": 313.6000061035156,
      "text": " we need to understand and realize that you and I,"
    },
    {
      "id": 136,
      "start": 313.6000061035156,
      "end": 314.9200134277344,
      "text": " who are saved by the grace of God,"
    },
    {
      "id": 137,
      "start": 314.9200134277344,
      "end": 316.67999267578125,
      "text": " the Great Commission is what's most important,"
    },
    {
      "id": 138,
      "start": 316.67999267578125,
      "end": 320.8800048828125,
      "text": " first of all, winning people to Jesus Christ one by one."
    },
    {
      "id": 139,
      "start": 320.8800048828125,
      "end": 324.1199951171875,
      "text": " But we've got to get our own household cleaned up."
    },
    {
      "id": 140,
      "start": 324.1199951171875,
      "end": 325.3599853515625,
      "text": " Would you agree with that?"
    },
    {
      "id": 141,
      "start": 326.79998779296875,
      "end": 328.32000732421875,
      "text": " So I really do believe we need to give"
    },
    {
      "id": 142,
      "start": 328.32000732421875,
      "end": 330.1199951171875,
      "text": " some thought and consideration to that this week"
    },
    {
      "id": 143,
      "start": 330.1199951171875,
      "end": 331.3599853515625,
      "text": " as we go into the revival meeting."
    },
    {
      "id": 144,
      "start": 331.3599853515625,
      "end": 332.760009765625,
      "text": " I'm serious about revival."
    },
    {
      "id": 145,
      "start": 333.760009765625,
      "end": 336.0,
      "text": " I wanna see revival, amen, don't you?"
    },
    {
      "id": 146,
      "start": 336.8399963378906,
      "end": 338.9599914550781,
      "text": " I really do, I want God to start with me."
    },
    {
      "id": 147,
      "start": 339.8800048828125,
      "end": 341.239990234375,
      "text": " And that's an important thing."
    },
    {
      "id": 148,
      "start": 341.239990234375,
      "end": 342.9200134277344,
      "text": " Haggai chapter one in your Bible today,"
    },
    {
      "id": 149,
      "start": 342.9200134277344,
      "end": 344.67999267578125,
      "text": " let's go to Haggai chapter one."
    },
    {
      "id": 150,
      "start": 346.79998779296875,
      "end": 351.0799865722656,
      "text": " Haggai chapter one, a great little book,"
    },
    {
      "id": 151,
      "start": 351.0799865722656,
      "end": 352.8399963378906,
      "text": " one of the minor prophets write stuff"
    },
    {
      "id": 152,
      "start": 352.8399963378906,
      "end": 354.55999755859375,
      "text": " right between Zephaniah and Zechariah."
    },
    {
      "id": 153,
      "start": 354.55999755859375,
      "end": 356.8800048828125,
      "text": " Haggai chapter one, if you have a Cambridge-wide margin"
    },
    {
      "id": 154,
      "start": 356.8800048828125,
      "end": 359.44000244140625,
      "text": " Bible like I do, it's on page 1002, amen?"
    },
    {
      "id": 155,
      "start": 360.67999267578125,
      "end": 362.3999938964844,
      "text": " I said that in a church one time,"
    },
    {
      "id": 156,
      "start": 362.3999938964844,
      "end": 364.239990234375,
      "text": " the guy said, oh, I got one of those."
    },
    {
      "id": 157,
      "start": 365.55999755859375,
      "end": 368.4800109863281,
      "text": " So he got right to the page."
    },
    {
      "id": 158,
      "start": 368.4800109863281,
      "end": 370.6000061035156,
      "text": " Haggai chapter one, we're gonna start there,"
    },
    {
      "id": 159,
      "start": 370.6000061035156,
      "end": 372.1199951171875,
      "text": " and then we'll just move around in the Bible"
    },
    {
      "id": 160,
      "start": 372.1199951171875,
      "end": 374.239990234375,
      "text": " just a bit here in the Sunday school hour."
    },
    {
      "id": 161,
      "start": 376.79998779296875,
      "end": 380.0799865722656,
      "text": " And I guess if I were to give my Sunday school lesson"
    },
    {
      "id": 162,
      "start": 380.0799865722656,
      "end": 381.8399963378906,
      "text": " a topic this morning, it'd be this."
    },
    {
      "id": 163,
      "start": 382.760009765625,
      "end": 387.5199890136719,
      "text": " Self-confrontation, self-examination,"
    },
    {
      "id": 164,
      "start": 387.5199890136719,
      "end": 389.20001220703125,
      "text": " putting yourself on trial."
    },
    {
      "id": 165,
      "start": 390.2799987792969,
      "end": 392.20001220703125,
      "text": " Every once in a while, we just need to stop"
    },
    {
      "id": 166,
      "start": 392.20001220703125,
      "end": 396.8399963378906,
      "text": " and we need to confront ourselves and examine ourselves"
    },
    {
      "id": 167,
      "start": 396.8399963378906,
      "end": 398.2799987792969,
      "text": " in light of the word of God."
    },
    {
      "id": 168,
      "start": 399.6400146484375,
      "end": 401.67999267578125,
      "text": " And I thought about this the other day,"
    },
    {
      "id": 169,
      "start": 401.67999267578125,
      "end": 403.9200134277344,
      "text": " I think sometimes we're too busy examining the world,"
    },
    {
      "id": 170,
      "start": 403.9200134277344,
      "end": 405.1600036621094,
      "text": " but let me say something to your friends,"
    },
    {
      "id": 171,
      "start": 405.1600036621094,
      "end": 407.8800048828125,
      "text": " the world's gonna do what the world's gonna do."
    },
    {
      "id": 172,
      "start": 407.8800048828125,
      "end": 409.3599853515625,
      "text": " They're just gonna do what they're gonna do."
    },
    {
      "id": 173,
      "start": 409.3599853515625,
      "end": 411.9200134277344,
      "text": " They're unsaved, they're lost, they don't know Christ,"
    },
    {
      "id": 174,
      "start": 411.9200134277344,
      "end": 412.8800048828125,
      "text": " they don't have the word of God,"
    },
    {
      "id": 175,
      "start": 412.8800048828125,
      "end": 415.239990234375,
      "text": " so the world's going to do what the world's gonna do."
    },
    {
      "id": 176,
      "start": 415.239990234375,
      "end": 417.239990234375,
      "text": " We get so busy looking at the world,"
    },
    {
      "id": 177,
      "start": 417.239990234375,
      "end": 419.67999267578125,
      "text": " what the world's doing, that we don't stop"
    },
    {
      "id": 178,
      "start": 419.67999267578125,
      "end": 421.44000244140625,
      "text": " and take time to look at ourselves."
    },
    {
      "id": 179,
      "start": 422.32000732421875,
      "end": 424.0,
      "text": " That's an important thing for us to sometimes"
    },
    {
      "id": 180,
      "start": 424.0,
      "end": 427.239990234375,
      "text": " get engaged in self-confrontation, self-examination."
    },
    {
      "id": 181,
      "start": 427.239990234375,
      "end": 429.760009765625,
      "text": " Now, I'm not talking about introspection here,"
    },
    {
      "id": 182,
      "start": 429.760009765625,
      "end": 431.8399963378906,
      "text": " and I'm not talking about contemporary mysticism"
    },
    {
      "id": 183,
      "start": 431.8399963378906,
      "end": 434.7200012207031,
      "text": " or contemplative mysticism and some of the stuff"
    },
    {
      "id": 184,
      "start": 435.2799987792969,
      "end": 438.9599914550781,
      "text": " that goes on today in some circles of churchianity."
    },
    {
      "id": 185,
      "start": 438.9599914550781,
      "end": 441.20001220703125,
      "text": " I'm talking about getting down and dirty with us,"
    },
    {
      "id": 186,
      "start": 441.20001220703125,
      "end": 444.79998779296875,
      "text": " with ourselves, and taking a hard look at ourselves."
    },
    {
      "id": 187,
      "start": 445.8399963378906,
      "end": 446.9200134277344,
      "text": " And every once in a while,"
    },
    {
      "id": 188,
      "start": 446.9200134277344,
      "end": 448.9599914550781,
      "text": " it's good to just stop and do that."
    },
    {
      "id": 189,
      "start": 448.9599914550781,
      "end": 450.32000732421875,
      "text": " But I want you to get Haggai chapter one,"
    },
    {
      "id": 190,
      "start": 450.32000732421875,
      "end": 451.9599914550781,
      "text": " we'll go down through just a few verses here"
    },
    {
      "id": 191,
      "start": 451.9599914550781,
      "end": 453.0400085449219,
      "text": " and just look at a couple of things"
    },
    {
      "id": 192,
      "start": 453.0400085449219,
      "end": 454.760009765625,
      "text": " that God just spoke to my heart about."
    },
    {
      "id": 193,
      "start": 454.760009765625,
      "end": 457.55999755859375,
      "text": " Personally, my wife actually pointed this out to me,"
    },
    {
      "id": 194,
      "start": 457.55999755859375,
      "end": 460.0799865722656,
      "text": " and I went back and I studied this whole book."
    },
    {
      "id": 195,
      "start": 460.0799865722656,
      "end": 462.55999755859375,
      "text": " And by the way, it's a post-exilic book,"
    },
    {
      "id": 196,
      "start": 462.55999755859375,
      "end": 463.6000061035156,
      "text": " and of course, there's four of them."
    },
    {
      "id": 197,
      "start": 463.6000061035156,
      "end": 466.0799865722656,
      "text": " It's Haggai, Zechariah, Malachi, and Joel,"
    },
    {
      "id": 198,
      "start": 466.0799865722656,
      "end": 468.760009765625,
      "text": " four post-exilic books, and this is one of them."
    },
    {
      "id": 199,
      "start": 468.760009765625,
      "end": 471.239990234375,
      "text": " And it was when Cyrus gave the grant"
    },
    {
      "id": 200,
      "start": 471.239990234375,
      "end": 472.9200134277344,
      "text": " to the children of Israel to reestablish"
    },
    {
      "id": 201,
      "start": 472.9200134277344,
      "end": 474.8399963378906,
      "text": " and rebuild the temple."
    },
    {
      "id": 202,
      "start": 474.8399963378906,
      "end": 476.4800109863281,
      "text": " We see that back in the book of Ezra."
    },
    {
      "id": 203,
      "start": 476.4800109863281,
      "end": 479.6000061035156,
      "text": " We see specifically what it says in Ezra chapter four."
    },
    {
      "id": 204,
      "start": 479.6000061035156,
      "end": 481.760009765625,
      "text": " We're gonna find out that when their adversaries"
    },
    {
      "id": 205,
      "start": 481.760009765625,
      "end": 485.20001220703125,
      "text": " came against them, they left off building the temple."
    },
    {
      "id": 206,
      "start": 485.20001220703125,
      "end": 487.8399963378906,
      "text": " And for 14 years, the work remained dormant."
    },
    {
      "id": 207,
      "start": 488.7200012207031,
      "end": 490.79998779296875,
      "text": " And God was not really pleased with that."
    },
    {
      "id": 208,
      "start": 490.79998779296875,
      "end": 493.0400085449219,
      "text": " And of course, we know that Artaxerxes"
    },
    {
      "id": 209,
      "start": 493.0400085449219,
      "end": 495.0,
      "text": " gave a mandate that they were stopped doing it"
    },
    {
      "id": 210,
      "start": 495.0,
      "end": 498.44000244140625,
      "text": " because of the lies, the false things"
    },
    {
      "id": 211,
      "start": 498.44000244140625,
      "end": 499.6000061035156,
      "text": " that were being said about them"
    },
    {
      "id": 212,
      "start": 499.6000061035156,
      "end": 502.20001220703125,
      "text": " and what their agenda was and what their desires were"
    },
    {
      "id": 213,
      "start": 502.20001220703125,
      "end": 503.1199951171875,
      "text": " and their purposes were."
    },
    {
      "id": 214,
      "start": 503.1199951171875,
      "end": 504.7200012207031,
      "text": " So they left off building the temple"
    },
    {
      "id": 215,
      "start": 504.7200012207031,
      "end": 508.4800109863281,
      "text": " when they should have just continued on at some point."
    },
    {
      "id": 216,
      "start": 508.4800109863281,
      "end": 509.7200012207031,
      "text": " So talk about that as we get into this."
    },
    {
      "id": 217,
      "start": 509.7200012207031,
      "end": 512.280029296875,
      "text": " But in Haggai chapter one, beginning in verse one,"
    },
    {
      "id": 218,
      "start": 512.280029296875,
      "end": 515.47998046875,
      "text": " I read this, in the second year of Darius the king"
    },
    {
      "id": 219,
      "start": 515.47998046875,
      "end": 518.47998046875,
      "text": " in the sixth month, that was Elal in the Hebrew calendar."
    },
    {
      "id": 220,
      "start": 518.47998046875,
      "end": 520.4400024414062,
      "text": " It's September in the lunar calendar."
    },
    {
      "id": 221,
      "start": 520.4400024414062,
      "end": 522.8400268554688,
      "text": " In the first day of the month came the word of the Lord"
    },
    {
      "id": 222,
      "start": 523.6400146484375,
      "end": 527.4000244140625,
      "text": " by Haggai, the prophet of Zerubbabel, the son of Shealtiel,"
    },
    {
      "id": 223,
      "start": 527.4000244140625,
      "end": 530.4400024414062,
      "text": " governor of Judah and to Joshua, the son of Josedek,"
    },
    {
      "id": 224,
      "start": 530.4400024414062,
      "end": 532.1599731445312,
      "text": " the high priest saying,"
    },
    {
      "id": 225,
      "start": 532.1599731445312,
      "end": 534.6799926757812,
      "text": " thus speaketh the Lord of hosts saying,"
    },
    {
      "id": 226,
      "start": 534.6799926757812,
      "end": 537.3599853515625,
      "text": " this people say, now watch this,"
    },
    {
      "id": 227,
      "start": 537.3599853515625,
      "end": 540.6799926757812,
      "text": " this people say, the time has not come,"
    },
    {
      "id": 228,
      "start": 540.6799926757812,
      "end": 543.4000244140625,
      "text": " the time that the Lord's house should be built."
    },
    {
      "id": 229,
      "start": 543.4000244140625,
      "end": 545.3200073242188,
      "text": " And of course, you can go back to reference it back"
    },
    {
      "id": 230,
      "start": 545.3200073242188,
      "end": 547.6400146484375,
      "text": " to Ezra chapter four in verse 24"
    },
    {
      "id": 231,
      "start": 547.6400146484375,
      "end": 550.7999877929688,
      "text": " to see what all was taking place there, the whole dynamic."
    },
    {
      "id": 232,
      "start": 550.7999877929688,
      "end": 553.8800048828125,
      "text": " He said, they said, listen, the people say,"
    },
    {
      "id": 233,
      "start": 553.8800048828125,
      "end": 555.3200073242188,
      "text": " the time has not come,"
    },
    {
      "id": 234,
      "start": 555.3200073242188,
      "end": 557.1599731445312,
      "text": " the time that the Lord's house should be built."
    },
    {
      "id": 235,
      "start": 557.1599731445312,
      "end": 558.9199829101562,
      "text": " But look in verse three,"
    },
    {
      "id": 236,
      "start": 558.9199829101562,
      "end": 563.280029296875,
      "text": " then came the word of the Lord by Haggai the prophet saying,"
    },
    {
      "id": 237,
      "start": 563.280029296875,
      "end": 565.5599975585938,
      "text": " well, is it time for you?"
    },
    {
      "id": 238,
      "start": 565.5599975585938,
      "end": 567.5,
      "text": " Oh, ye to dwell in your sealed houses"
    },
    {
      "id": 239,
      "start": 567.5,
      "end": 569.239990234375,
      "text": " and this house lie waste."
    },
    {
      "id": 240,
      "start": 569.239990234375,
      "end": 570.719970703125,
      "text": " God says, what about me?"
    },
    {
      "id": 241,
      "start": 572.239990234375,
      "end": 576.0800170898438,
      "text": " He said, you guys are so busy building your own houses,"
    },
    {
      "id": 242,
      "start": 576.0800170898438,
      "end": 577.52001953125,
      "text": " building your own mansions"
    },
    {
      "id": 243,
      "start": 578.4400024414062,
      "end": 580.3599853515625,
      "text": " that you've forgotten about my house."
    },
    {
      "id": 244,
      "start": 581.719970703125,
      "end": 584.719970703125,
      "text": " He said, listen, you need to get back to building my house."
    },
    {
      "id": 245,
      "start": 585.760009765625,
      "end": 588.2000122070312,
      "text": " It's important for you to get back to building my house."
    },
    {
      "id": 246,
      "start": 588.2000122070312,
      "end": 591.3599853515625,
      "text": " You need to reestablish the house of God."
    },
    {
      "id": 247,
      "start": 591.3599853515625,
      "end": 592.760009765625,
      "text": " And they weren't doing that."
    },
    {
      "id": 248,
      "start": 592.760009765625,
      "end": 594.5999755859375,
      "text": " Now, let me say this,"
    },
    {
      "id": 249,
      "start": 594.5999755859375,
      "end": 596.0800170898438,
      "text": " and then I'll move on to the next verse"
    },
    {
      "id": 250,
      "start": 596.0800170898438,
      "end": 597.5599975585938,
      "text": " because there's something here I want you to see."
    },
    {
      "id": 251,
      "start": 597.5599975585938,
      "end": 598.6799926757812,
      "text": " It's important to us this morning,"
    },
    {
      "id": 252,
      "start": 598.6799926757812,
      "end": 599.760009765625,
      "text": " just a very simple thing."
    },
    {
      "id": 253,
      "start": 599.760009765625,
      "end": 600.5999755859375,
      "text": " There's nothing."
    },
    {
      "id": 0,
      "start": 600.5999755859375,
      "end": 606.8999757766724,
      "text": " something profound here. But let me say this, sometimes I think we just basically get so"
    },
    {
      "id": 1,
      "start": 606.8999757766724,
      "end": 613.6199760437012,
      "text": " lackadaisical and so kind of, you know, we're in our comfort zone and we're kind of comfortable"
    },
    {
      "id": 2,
      "start": 613.6199760437012,
      "end": 617.6999759674072,
      "text": " and enjoying our situation, our life the way it is right now that we don't stop and think"
    },
    {
      "id": 3,
      "start": 617.6999759674072,
      "end": 621.2599754333496,
      "text": " about, now listen, am I moving forward for God? Am I doing what God wants me to do? Am"
    },
    {
      "id": 4,
      "start": 621.2599754333496,
      "end": 627.2199764251709,
      "text": " I busy about God's work? Or am I just basically coasting along here in my Christian life?"
    },
    {
      "id": 5,
      "start": 627.2199764251709,
      "end": 631.0799751281738,
      "text": " There's too much of that. We don't have much time left. You're going to hear me preach"
    },
    {
      "id": 6,
      "start": 631.0799751281738,
      "end": 634.6799774169922,
      "text": " about that a little bit this morning. Let me tell you something, friends. We need to"
    },
    {
      "id": 7,
      "start": 634.6799774169922,
      "end": 640.3199768066406,
      "text": " understand this. Jesus is coming soon. And the night cometh when no man can work. And"
    },
    {
      "id": 8,
      "start": 640.3199768066406,
      "end": 644.2399749755859,
      "text": " so we all of us need to be busy about God's business. Now I'm going to walk down the aisle"
    },
    {
      "id": 9,
      "start": 644.2399749755859,
      "end": 647.2399749755859,
      "text": " so I'm not forgetting these people up here. I'll come back in a minute. We need to be"
    },
    {
      "id": 10,
      "start": 647.2399749755859,
      "end": 652.1999740600586,
      "text": " busy about God's business. And we've just gotten to the point, I think, where we've"
    },
    {
      "id": 11,
      "start": 652.1999740600586,
      "end": 656.7599754333496,
      "text": " gotten into this spiritual lethargy and this spiritual apathy and we forgot about God."
    },
    {
      "id": 12,
      "start": 656.799976348877,
      "end": 660.6999740600586,
      "text": " By the way, we see the children of Israel on two different occasions. God said to them,"
    },
    {
      "id": 13,
      "start": 660.6999740600586,
      "end": 666.7399749755859,
      "text": " listen, you've forgotten me days without number. Well, we used to be a God-conscious nation,"
    },
    {
      "id": 14,
      "start": 666.7399749755859,
      "end": 672.9799728393555,
      "text": " America. You remember that we were at one time a God-conscious nation? Amen? Our friends"
    },
    {
      "id": 15,
      "start": 672.9799728393555,
      "end": 677.8199768066406,
      "text": " back here are from western Pennsylvania. My brother, I don't know how old you are, but"
    },
    {
      "id": 16,
      "start": 677.8199768066406,
      "end": 684.8199768066406,
      "text": " I'm a little older maybe than you, I think. Amen? Pennsylvania was a blue state law. We"
    },
    {
      "id": 17,
      "start": 687.7599792480469,
      "end": 692.859977722168,
      "text": " were a blue law state. I'm sorry, I got that backwards. We were a blue law state. Everything"
    },
    {
      "id": 18,
      "start": 692.859977722168,
      "end": 698.9399719238281,
      "text": " was closed on Sunday. Nothing was open on the Lord's Day. I remember that. I grew up"
    },
    {
      "id": 19,
      "start": 698.9399719238281,
      "end": 705.4199752807617,
      "text": " under that in the 40s and the 50s and early 60s and everything was closed. But the churches"
    },
    {
      "id": 20,
      "start": 705.4199752807617,
      "end": 710.8999786376953,
      "text": " were open. And the neighborhood in which I lived, I was born in West Philadelphia and"
    },
    {
      "id": 21,
      "start": 710.8999786376953,
      "end": 715.339973449707,
      "text": " then we moved out to the suburbs. The neighborhood I lived in and my wife lived in, I don't know"
    },
    {
      "id": 22,
      "start": 715.339973449707,
      "end": 722.339973449707,
      "text": " of anybody on my block that didn't go to church. Everybody went to church. Maybe not"
    },
    {
      "id": 23,
      "start": 722.9599761962891,
      "end": 729.9599761962891,
      "text": " the right churches, but everybody went to church because we were a God-conscious nation."
    },
    {
      "id": 24,
      "start": 731.97998046875,
      "end": 735.7999725341797,
      "text": " And then when they repealed the blue laws, I think it was in the late 60s, when they"
    },
    {
      "id": 25,
      "start": 735.7999725341797,
      "end": 739.7599792480469,
      "text": " repealed the blue laws and we had them down here, Virginia had blue laws as well. When"
    },
    {
      "id": 26,
      "start": 739.7599792480469,
      "end": 743.47998046875,
      "text": " the blue laws got repealed and all the malls opened up and all the other stuff started"
    },
    {
      "id": 27,
      "start": 743.6999816894531,
      "end": 746.8999786376953,
      "text": " happening and everything else was going on on Sundays and everybody was playing baseball"
    },
    {
      "id": 28,
      "start": 746.8999786376953,
      "end": 751.5399780273438,
      "text": " and football and basketball and hockey, everything else going on on Sundays, all of a sudden"
    },
    {
      "id": 29,
      "start": 751.5399780273438,
      "end": 758.5399780273438,
      "text": " people stopped going to church. So America was no longer a God-conscious country. So"
    },
    {
      "id": 30,
      "start": 759.1799774169922,
      "end": 766.1799774169922,
      "text": " I can hear God say, well, what about me? What about me? So He says to the children of Israel,"
    },
    {
      "id": 31,
      "start": 766.4999694824219,
      "end": 769.6599731445312,
      "text": " and that's a little off topic, but He says to the children of Israel, well, what about"
    },
    {
      "id": 32,
      "start": 769.6599731445312,
      "end": 774.1599731445312,
      "text": " me? He says, is it time for you, O ye, to dwell in your sealed houses, and this house"
    },
    {
      "id": 33,
      "start": 774.1599731445312,
      "end": 781.1599731445312,
      "text": " lie waste? Look at verse 5, Now therefore thus saith the Lord of hosts, say it, Consider"
    },
    {
      "id": 34,
      "start": 782.7399749755859,
      "end": 789.7399749755859,
      "text": " your ways. He said, y'all need to consider your ways. I'm in Virginia, so I'm saying"
    },
    {
      "id": 35,
      "start": 790.5599822998047,
      "end": 795.2399749755859,
      "text": " y'all, amen? Even though we're in northern Virginia, it's still y'all. We're below the"
    },
    {
      "id": 36,
      "start": 795.2599792480469,
      "end": 802.2599792480469,
      "text": " Mason-Dixon line here, amen? He said, y'all need to consider your ways. And He says it"
    },
    {
      "id": 37,
      "start": 802.2999725341797,
      "end": 809.2999725341797,
      "text": " not only once, but if you read through Haggai, He says it five times. So moving on to verse"
    },
    {
      "id": 38,
      "start": 809.3399810791016,
      "end": 815.4999694824219,
      "text": " 6, He said, You have sown much, you bring in little. You eat, but you have not enough."
    },
    {
      "id": 39,
      "start": 815.4999694824219,
      "end": 820.6199798583984,
      "text": " You drink, but you're not filled with drink. You clothe you, but there is none warm. And"
    },
    {
      "id": 40,
      "start": 820.6399688720703,
      "end": 826.9599761962891,
      "text": " he that earneth wages earneth wages, to put him into a bag with holes. He said, you know,"
    },
    {
      "id": 41,
      "start": 826.9599761962891,
      "end": 833.2799682617188,
      "text": " you guys are so busy about you and not busy about me that you're not prospering at all."
    },
    {
      "id": 42,
      "start": 833.2799682617188,
      "end": 835.9599761962891,
      "text": " When you're not right with God and you're not in fellowship with God, you're not walking"
    },
    {
      "id": 43,
      "start": 835.9599761962891,
      "end": 839.4999694824219,
      "text": " with the Lord, you're not walking in the Spirit of God, I guarantee you, you're not going"
    },
    {
      "id": 44,
      "start": 839.4999694824219,
      "end": 844.9599761962891,
      "text": " to prosper. Now, we're not talking about the, you know, the stuff that these, you know,"
    },
    {
      "id": 45,
      "start": 844.9599761962891,
      "end": 848.7599792480469,
      "text": " fools on TV talk about, about this health, wealth, and prosperity stuff, and faith, seed,"
    },
    {
      "id": 46,
      "start": 848.8999786376953,
      "end": 853.1399688720703,
      "text": " and all that stuff. No, God said, listen, the reason you're not prospering is because"
    },
    {
      "id": 47,
      "start": 853.1399688720703,
      "end": 857.219970703125,
      "text": " you're not walking in accordance with My will. You get out of the will of God, you're not"
    },
    {
      "id": 48,
      "start": 857.219970703125,
      "end": 862.739990234375,
      "text": " going to prosper. Let me give you a good example. If you're not tithing, and of course, most"
    },
    {
      "id": 49,
      "start": 862.739990234375,
      "end": 865.219970703125,
      "text": " of you here are probably church members, you ought to be tithing. If you're not, you're"
    },
    {
      "id": 50,
      "start": 865.219970703125,
      "end": 869.9399719238281,
      "text": " living in sin. But He said, if you, listen, if you're not tithing, you're going to tithe"
    },
    {
      "id": 51,
      "start": 869.9399719238281,
      "end": 873.2999877929688,
      "text": " somewhere else. If you don't tithe the Lord, you're going to tithe to the doctor, you're"
    },
    {
      "id": 52,
      "start": 873.2999877929688,
      "end": 876.6799621582031,
      "text": " going to tithe to the dentist, you'll tithe to the auto mechanic. God is going to get"
    },
    {
      "id": 53,
      "start": 876.6799621582031,
      "end": 883.739990234375,
      "text": " that tithe somewhere. When I first got saved, I can remember, I got it somehow in my mind"
    },
    {
      "id": 54,
      "start": 883.739990234375,
      "end": 887.9399719238281,
      "text": " because I was an E6 in the Navy, that I, at that point in time, that there was no way"
    },
    {
      "id": 55,
      "start": 887.9399719238281,
      "end": 891.8599853515625,
      "text": " that I could possibly tithe. I just, we weren't making a lot of money back in those days,"
    },
    {
      "id": 56,
      "start": 891.8599853515625,
      "end": 896.0199890136719,
      "text": " and the military never made a lot of money, but we definitely weren't making a lot of"
    },
    {
      "id": 57,
      "start": 896.0199890136719,
      "end": 901.3399658203125,
      "text": " money then. And I said, Lord, listen, you know I can't tithe. I mean, I just can't do"
    },
    {
      "id": 58,
      "start": 901.3399658203125,
      "end": 909.1199645996094,
      "text": " it. I can't pay my bills. I'm overextended. My family won't eat if I tithe. My wife wasn't"
    },
    {
      "id": 59,
      "start": 909.1199645996094,
      "end": 914.3399658203125,
      "text": " on board with that, having been saved seven years before I was, and she was a little bit"
    },
    {
      "id": 60,
      "start": 914.3399658203125,
      "end": 922.9199829101562,
      "text": " more spiritually astute, and so I didn't tithe. All right? The first month I didn't tithe,"
    },
    {
      "id": 61,
      "start": 922.9199829101562,
      "end": 928.5999755859375,
      "text": " my car broke down. Now hear this. I mean, this is my testimony. My car broke down. The"
    },
    {
      "id": 62,
      "start": 928.6599731445312,
      "end": 938.4199829101562,
      "text": " starter went out. It was my home to work car. 1967 Datsun. What a piece of junk that was."
    },
    {
      "id": 63,
      "start": 938.4199829101562,
      "end": 943.5399780273438,
      "text": " The starter went out. So I went down to Napa and I bought a starter. Brought it home, put"
    },
    {
      "id": 64,
      "start": 943.5399780273438,
      "end": 950.3399658203125,
      "text": " it in my car. And then I looked at the receipt, which I charged, by the way. Then I looked"
    },
    {
      "id": 65,
      "start": 950.3399658203125,
      "end": 958.5799865722656,
      "text": " at the receipt. The starter cost me, to the penny, what my tithe would have been. I said,"
    },
    {
      "id": 66,
      "start": 958.5799865722656,
      "end": 964.3599853515625,
      "text": " Lord, you've got my attention. And from that point forward, I tithe. Because I realized"
    },
    {
      "id": 67,
      "start": 964.3599853515625,
      "end": 968.239990234375,
      "text": " and understood the principle that we see right here. If you rob God, and we see that in Malchai"
    },
    {
      "id": 68,
      "start": 968.239990234375,
      "end": 972.6399841308594,
      "text": " chapter 3, if you rob God and said, listen, I'm going to tell you one thing right now,"
    },
    {
      "id": 69,
      "start": 972.6399841308594,
      "end": 977.3599853515625,
      "text": " you're not going to prosper. I'm going to send the locust, the palmer worm, I'm going"
    },
    {
      "id": 70,
      "start": 977.3599853515625,
      "end": 985.2799682617188,
      "text": " to send all kinds of critters into your fields to eat up your harvest. Not a good thing,"
    },
    {
      "id": 71,
      "start": 986.219970703125,
      "end": 991.2599792480469,
      "text": " So he said, you better tithe. So he said, listen, because you've not done this, you're"
    },
    {
      "id": 72,
      "start": 991.2599792480469,
      "end": 994.8999633789062,
      "text": " not prospering. And you wonder why. I like what he says there. It's kind of a funny statement."
    },
    {
      "id": 73,
      "start": 994.8999633789062,
      "end": 998.5599670410156,
      "text": " But he says, and he that earneth wages, earneth wages to put into a bag with holes. So this"
    },
    {
      "id": 74,
      "start": 998.5599670410156,
      "end": 1004.2799682617188,
      "text": " comes in and goes right out again. Now, verse 7, he says again, look, Thus saith the Lord"
    },
    {
      "id": 75,
      "start": 1004.2799682617188,
      "end": 1011.2799682617188,
      "text": " of hosts, Consider your ways. God wants us to consider our ways. When we go into a Bible"
    },
    {
      "id": 76,
      "start": 1011.2799682617188,
      "end": 1014.1599731445312,
      "text": " meeting, that's what we ought to be doing. We should be examining ourselves. We ought"
    },
    {
      "id": 77,
      "start": 1014.1599731445312,
      "end": 1018.8399658203125,
      "text": " to confront ourselves. The Word of God will confront us for sure. We ought to put ourselves"
    },
    {
      "id": 78,
      "start": 1018.8399658203125,
      "end": 1024.3199768066406,
      "text": " on trial. That's a volitional thing. It's a matter of choice. A lot of people aren't"
    },
    {
      "id": 79,
      "start": 1024.3199768066406,
      "end": 1028.719970703125,
      "text": " going to pay any attention sometimes to the beck and call of the Holy Ghost. If I tell"
    },
    {
      "id": 80,
      "start": 1028.719970703125,
      "end": 1031.9199829101562,
      "text": " you this, I was preaching down in Torrance, California, one time, a bigger auditorium"
    },
    {
      "id": 81,
      "start": 1031.9199829101562,
      "end": 1036.719970703125,
      "text": " than this, a big crowd that morning. About halfway down here, back here, I'd ask your"
    },
    {
      "id": 82,
      "start": 1036.719970703125,
      "end": 1041.3199768066406,
      "text": " dad if that ever happened to him. About halfway down here, there's a woman sitting here. She's"
    },
    {
      "id": 83,
      "start": 1041.3199768066406,
      "end": 1044.6799621582031,
      "text": " sitting right there, two kids in the middle, and her husband here. I'm preaching. I can't"
    },
    {
      "id": 84,
      "start": 1044.6799621582031,
      "end": 1050.0799865722656,
      "text": " remember this day why I was preaching. While I'm preaching, she stuck her fingers in her"
    },
    {
      "id": 85,
      "start": 1050.0799865722656,
      "end": 1056.1199645996094,
      "text": " ears. I said, now, that's kind of strange. So she sticks her fingers in her ears. Now"
    },
    {
      "id": 86,
      "start": 1056.1199645996094,
      "end": 1061.6399841308594,
      "text": " not only is she sticking her fingers in her ears, now she's shaking her head no at me."
    },
    {
      "id": 87,
      "start": 1061.6399841308594,
      "end": 1068.719970703125,
      "text": " I'm a young preacher, and I'm kind of irritated by this, I guess. It was bothering me. So"
    },
    {
      "id": 88,
      "start": 1068.719970703125,
      "end": 1071.2799682617188,
      "text": " I thought, you know, I'm just going to go right back there and stand right where she's"
    },
    {
      "id": 89,
      "start": 1071.2799682617188,
      "end": 1076.3999633789062,
      "text": " sitting, and I'm going to preach right there. And the Holy Spirit, you know, that still"
    },
    {
      "id": 90,
      "start": 1076.3999633789062,
      "end": 1082.8199768066406,
      "text": " small voice, that whisper, said, don't you do it. I'll take care of her. So when the"
    },
    {
      "id": 91,
      "start": 1082.8199768066406,
      "end": 1086.3199768066406,
      "text": " service is over, she's at the back door. And I said to one of the deacons, I said, who"
    },
    {
      "id": 92,
      "start": 1086.3199768066406,
      "end": 1091.6799621582031,
      "text": " is that woman? And he said, oh, that's the head deacon's wife. And they're back there"
    },
    {
      "id": 93,
      "start": 1091.6799621582031,
      "end": 1094.7599792480469,
      "text": " shaking hands with people leaving the building. And I said, I'm going to go back there and"
    },
    {
      "id": 94,
      "start": 1094.7599792480469,
      "end": 1098.0799865722656,
      "text": " chat with her. I said, that woman stuck her fingers in her ears while I'm preaching. Oh,"
    },
    {
      "id": 95,
      "start": 1098.1999816894531,
      "end": 1102.719970703125,
      "text": " she wouldn't do that. I said, she did it. I'm either lying or dying. And I was going"
    },
    {
      "id": 96,
      "start": 1102.719970703125,
      "end": 1106.8399658203125,
      "text": " to head right back there. The Spirit of God said, don't you do it. I'll handle that. Now,"
    },
    {
      "id": 97,
      "start": 1106.8399658203125,
      "end": 1111.719970703125,
      "text": " I've never heard anybody do that to me again. Now, it seems to me like I've read an account"
    },
    {
      "id": 98,
      "start": 1111.719970703125,
      "end": 1114.6799926757812,
      "text": " in the Bible where it says they stopped their ears. Well, that's kind of what she did. And"
    },
    {
      "id": 99,
      "start": 1114.6799926757812,
      "end": 1119.3599853515625,
      "text": " I thought, why would somebody that claims to be saved by the grace of God do that? But"
    },
    {
      "id": 100,
      "start": 1119.3599853515625,
      "end": 1124.3599853515625,
      "text": " you know what the truth of the matter is? Something got to her from the Word of God,"
    },
    {
      "id": 101,
      "start": 1124.47998046875,
      "end": 1129.9599609375,
      "text": " she didn't want to hear it. Therefore, she was not willing to, you ready for this? It's"
    },
    {
      "id": 102,
      "start": 1129.9599609375,
      "end": 1135.4400024414062,
      "text": " not a, listen, it's not profoundity here. Therefore, she was not willing to examine"
    },
    {
      "id": 103,
      "start": 1135.4400024414062,
      "end": 1142.4400024414062,
      "text": " her ways. Not willing to consider. Not willing to be confronted about her ways. Go back to"
    },
    {
      "id": 104,
      "start": 1145.3199462890625,
      "end": 1150.3199462890625,
      "text": " 1 Corinthians, please. We'll go back there very quickly. 1 Corinthians chapter 11. Oh,"
    },
    {
      "id": 105,
      "start": 1151.3199462890625,
      "end": 1154.199951171875,
      "text": " good. You've got a clock back there. Praise the Lord. I can see you, God. I have to keep"
    },
    {
      "id": 106,
      "start": 1154.199951171875,
      "end": 1159.3999633789062,
      "text": " doing this. 1 Corinthians chapter 11. I want you to start in verse 17. I'll lay some foundation"
    },
    {
      "id": 107,
      "start": 1159.3999633789062,
      "end": 1162.9199829101562,
      "text": " here. Of course, we know this passage of Scripture. We use this when we have a Lord's Supper."
    },
    {
      "id": 108,
      "start": 1162.9199829101562,
      "end": 1167.0799560546875,
      "text": " At least I've done it over the years. I'm sure you do it here as well. It's a classic"
    },
    {
      "id": 109,
      "start": 1167.0799560546875,
      "end": 1171.0,
      "text": " application of the Lord's Supper. But 1 Corinthians chapter 11, verse 17. I'm going to read down"
    },
    {
      "id": 110,
      "start": 1171.0,
      "end": 1172.199951171875,
      "text": " through this very quickly."
    },
    {
      "id": 111,
      "start": 1172.199951171875,
      "end": 1176.0799560546875,
      "text": " So now, in this I declare unto you, and I praise you not, that you come together not"
    },
    {
      "id": 112,
      "start": 1176.0799560546875,
      "end": 1180.8399658203125,
      "text": " for the better, but for the worse. For first of all, when you come together in the church,"
    },
    {
      "id": 113,
      "start": 1180.8399658203125,
      "end": 1184.4400024414062,
      "text": " I hear that there are divisions among you, and I partly believe it. Boy, it's a terrible"
    },
    {
      "id": 114,
      "start": 1184.4400024414062,
      "end": 1188.9199829101562,
      "text": " thing to have divisions in the church. It's good when the brethren dwell together in unity."
    },
    {
      "id": 115,
      "start": 1188.9199829101562,
      "end": 1193.7999877929688,
      "text": " For there must be also heresies. In other words, they were developing sex within the"
    },
    {
      "id": 116,
      "start": 1193.7999877929688,
      "end": 1199.239990234375,
      "text": " church. There also must be heresies among you, that they which are proved may be made"
    },
    {
      "id": 117,
      "start": 1199.239990234375,
      "end": 1200.4400024414062,
      "text": " manifest among you."
    },
    {
      "id": 0,
      "start": 1200.4400024414062,
      "end": 1205.7600026130676,
      "text": " When you come together, therefore, at one place, this is not to eat the Lord's Supper."
    },
    {
      "id": 1,
      "start": 1205.7600026130676,
      "end": 1210.6000022888184,
      "text": " For in eating every one taketh before the other his own supper, and one is hungry and"
    },
    {
      "id": 2,
      "start": 1210.6000022888184,
      "end": 1211.6000022888184,
      "text": " another is drunken.\""
    },
    {
      "id": 3,
      "start": 1211.6000022888184,
      "end": 1213.3600025177002,
      "text": " Man, there's a lot of preaching right here."
    },
    {
      "id": 4,
      "start": 1213.3600025177002,
      "end": 1217.8800029754639,
      "text": " \"'Well, what, have you not houses to eat and drink in, or despise ye the church of"
    },
    {
      "id": 5,
      "start": 1217.8800029754639,
      "end": 1220.0000019073486,
      "text": " God, and shame them that have not?"
    },
    {
      "id": 6,
      "start": 1220.0000019073486,
      "end": 1221.3200016021729,
      "text": " What shall I say unto you?"
    },
    {
      "id": 7,
      "start": 1221.3200016021729,
      "end": 1222.5200023651123,
      "text": " Shall I praise you in this?'"
    },
    {
      "id": 8,
      "start": 1222.5200023651123,
      "end": 1224.8400020599365,
      "text": " Well, I'm going to tell you what, I praise you not."
    },
    {
      "id": 9,
      "start": 1224.8400020599365,
      "end": 1229.2400016784668,
      "text": " \"'For I received of the Lord that which also I delivered unto you, that the Lord Jesus,"
    },
    {
      "id": 10,
      "start": 1229.2400016784668,
      "end": 1232.2800025939941,
      "text": " the same night in which he was betrayed, took bread."
    },
    {
      "id": 11,
      "start": 1232.2800025939941,
      "end": 1235.8800010681152,
      "text": " And when he had given thanks, he broke it, and he said, Take, eat."
    },
    {
      "id": 12,
      "start": 1235.8800010681152,
      "end": 1238.560001373291,
      "text": " This is my body, which is broken for you."
    },
    {
      "id": 13,
      "start": 1238.560001373291,
      "end": 1242.2400016784668,
      "text": " This do in remembrance of me,' because it's a symbol of his death, it's an emblem, it's"
    },
    {
      "id": 14,
      "start": 1242.2400016784668,
      "end": 1243.4800033569336,
      "text": " a memorial service."
    },
    {
      "id": 15,
      "start": 1243.4800033569336,
      "end": 1249.1600036621094,
      "text": " \"'After the same manner also he took the cup, and after he had supped and sang, This"
    },
    {
      "id": 16,
      "start": 1249.1600036621094,
      "end": 1251.0000038146973,
      "text": " cup is the new testament of my blood."
    },
    {
      "id": 17,
      "start": 1251.0000038146973,
      "end": 1253.8800010681152,
      "text": " This do ye as often as ye drink it in remembrance of me."
    },
    {
      "id": 18,
      "start": 1253.8800010681152,
      "end": 1258.4400024414062,
      "text": " For as often as ye eat this bread and drink this cup, ye do show, demonstrate the Lord's"
    },
    {
      "id": 19,
      "start": 1258.4400024414062,
      "end": 1260.8800010681152,
      "text": " death until he come.'\""
    },
    {
      "id": 20,
      "start": 1260.8800010681152,
      "end": 1266.8000030517578,
      "text": " Verse 27, \"'Wherefore, whose service shall eat this bread and drink of this cup unworthily?'"
    },
    {
      "id": 21,
      "start": 1266.8000030517578,
      "end": 1270.4400024414062,
      "text": " By the way, none of us are worthy of the death, burial, and blood of Jesus Christ."
    },
    {
      "id": 22,
      "start": 1270.4400024414062,
      "end": 1274.3600006103516,
      "text": " You think about his death, burial, and resurrection as we celebrate the Lord's Supper, we think"
    },
    {
      "id": 23,
      "start": 1274.3600006103516,
      "end": 1276.1600036621094,
      "text": " about the precious blood of Jesus."
    },
    {
      "id": 24,
      "start": 1276.1600036621094,
      "end": 1278.0800018310547,
      "text": " None of us are worthy of that."
    },
    {
      "id": 25,
      "start": 1278.0800018310547,
      "end": 1283.0800018310547,
      "text": " He said, so you drink this cup of this Lord, not to drink the cup of the Lord unworthily,"
    },
    {
      "id": 26,
      "start": 1283.0800018310547,
      "end": 1288.6399993896484,
      "text": " carelessly, or reverently, shall be guilty of the body and the blood of the Lord."
    },
    {
      "id": 27,
      "start": 1288.6399993896484,
      "end": 1289.6399993896484,
      "text": " Now look at this."
    },
    {
      "id": 28,
      "start": 1289.6399993896484,
      "end": 1294.2000045776367,
      "text": " \"'But let a man examine himself,' you see that, \"'and so let him eat of that bread and"
    },
    {
      "id": 29,
      "start": 1294.2000045776367,
      "end": 1295.7600021362305,
      "text": " drink of that cup."
    },
    {
      "id": 30,
      "start": 1295.7600021362305,
      "end": 1299.8600006103516,
      "text": " For he that eateth and drinketh unworthily or carelessly eateth and drinketh damnation"
    },
    {
      "id": 31,
      "start": 1299.8600006103516,
      "end": 1304.1000061035156,
      "text": " or judgment to himself, not discerning or honoring the Lord's body."
    },
    {
      "id": 32,
      "start": 1304.1000061035156,
      "end": 1307.2000045776367,
      "text": " For this cause many are weak and sickly among you, many sleep."
    },
    {
      "id": 33,
      "start": 1307.2000045776367,
      "end": 1311.6399993896484,
      "text": " For if we would judge ourselves, we should not be judged.'\""
    },
    {
      "id": 34,
      "start": 1312.2000045776367,
      "end": 1315.2000045776367,
      "text": " Listen, if we would judge ourselves and get things right with God, we wouldn't have to"
    },
    {
      "id": 35,
      "start": 1315.2000045776367,
      "end": 1317.3600006103516,
      "text": " experience chastisement."
    },
    {
      "id": 36,
      "start": 1317.3600006103516,
      "end": 1319.1600036621094,
      "text": " God wouldn't have to judge our sins."
    },
    {
      "id": 37,
      "start": 1319.1600036621094,
      "end": 1321.1600036621094,
      "text": " But when we are judged, we're chastened to the Lord."
    },
    {
      "id": 38,
      "start": 1321.1600036621094,
      "end": 1324.6399993896484,
      "text": " \"'For whom, Lord, lovely chasteneth, that we should not be condemned by the world.'\""
    },
    {
      "id": 39,
      "start": 1324.6399993896484,
      "end": 1325.6399993896484,
      "text": " Amen."
    },
    {
      "id": 40,
      "start": 1325.6399993896484,
      "end": 1327.2799987792969,
      "text": " It just basically proves you're saved when God chastises you."
    },
    {
      "id": 41,
      "start": 1327.2799987792969,
      "end": 1329.1999969482422,
      "text": " No chastisement, you're not saved."
    },
    {
      "id": 42,
      "start": 1329.1999969482422,
      "end": 1330.5599975585938,
      "text": " That's kind of what he's saying."
    },
    {
      "id": 43,
      "start": 1330.5599975585938,
      "end": 1331.5599975585938,
      "text": " But I want you to see this."
    },
    {
      "id": 44,
      "start": 1331.5599975585938,
      "end": 1333.7200012207031,
      "text": " He said, you need to examine yourself."
    },
    {
      "id": 45,
      "start": 1333.7200012207031,
      "end": 1337.9000091552734,
      "text": " He said, don't come to the Lord's table and do so flippantly or irreverently."
    },
    {
      "id": 46,
      "start": 1337.9000091552734,
      "end": 1338.9000091552734,
      "text": " Examine yourself."
    },
    {
      "id": 47,
      "start": 1338.9000091552734,
      "end": 1344.6999969482422,
      "text": " God once again says, listen, consider your ways and examine yourself."
    },
    {
      "id": 48,
      "start": 1344.6999969482422,
      "end": 1349.6199951171875,
      "text": " I can show you a whole lot of teaching in the Bible that speaks about this."
    },
    {
      "id": 49,
      "start": 1349.6199951171875,
      "end": 1351.260009765625,
      "text": " Examine yourself."
    },
    {
      "id": 50,
      "start": 1351.260009765625,
      "end": 1352.260009765625,
      "text": " Just listen to this."
    },
    {
      "id": 51,
      "start": 1352.260009765625,
      "end": 1353.260009765625,
      "text": " Job 13, 23."
    },
    {
      "id": 52,
      "start": 1353.260009765625,
      "end": 1357.020004272461,
      "text": " \"'How many are mine iniquities and sins?'"
    },
    {
      "id": 53,
      "start": 1357.020004272461,
      "end": 1358.020004272461,
      "text": " Job says."
    },
    {
      "id": 54,
      "start": 1358.020004272461,
      "end": 1361.5,
      "text": " \"'Well, make me to know my transgression and my sin.'\""
    },
    {
      "id": 55,
      "start": 1361.5,
      "end": 1364.8200073242188,
      "text": " Psalm 26, 2, \"'Examine me, O Lord, and prove me."
    },
    {
      "id": 56,
      "start": 1364.8200073242188,
      "end": 1367.1000061035156,
      "text": " Try my reins and my heart.'\""
    },
    {
      "id": 57,
      "start": 1367.3399963378906,
      "end": 1370.3800048828125,
      "text": " Psalm 4, 4, \"'Stand in awe and sin not."
    },
    {
      "id": 58,
      "start": 1370.3800048828125,
      "end": 1372.6999969482422,
      "text": " Commune with your own heart upon your bed and be still.'\""
    },
    {
      "id": 59,
      "start": 1372.6999969482422,
      "end": 1373.6999969482422,
      "text": " Selah."
    },
    {
      "id": 60,
      "start": 1373.6999969482422,
      "end": 1376.5,
      "text": " Psalm 77, 6, \"'I call to remembrance my song in the night."
    },
    {
      "id": 61,
      "start": 1376.5,
      "end": 1381.2200012207031,
      "text": " I commune with my own heart, and my spirit may diligent search.'\""
    },
    {
      "id": 62,
      "start": 1381.2200012207031,
      "end": 1384.3800048828125,
      "text": " That's talking about intense examination."
    },
    {
      "id": 63,
      "start": 1384.3800048828125,
      "end": 1390.020004272461,
      "text": " Psalm 119, 59, like this one, \"'I thought on my ways and turned my feet unto thy testimonies.'\""
    },
    {
      "id": 64,
      "start": 1390.020004272461,
      "end": 1391.020004272461,
      "text": " Wow."
    },
    {
      "id": 65,
      "start": 1391.020004272461,
      "end": 1393.1000061035156,
      "text": " Well, there's something right there."
    },
    {
      "id": 66,
      "start": 1393.1000061035156,
      "end": 1394.6600036621094,
      "text": " That's something to think about right there."
    },
    {
      "id": 67,
      "start": 1394.6600036621094,
      "end": 1396.020004272461,
      "text": " He said, listen, I'll tell you what I did."
    },
    {
      "id": 68,
      "start": 1396.020004272461,
      "end": 1398.5800018310547,
      "text": " I thought on my ways."
    },
    {
      "id": 69,
      "start": 1398.5800018310547,
      "end": 1403.260009765625,
      "text": " I mean, that's intentionally stopping and thinking about my ways."
    },
    {
      "id": 70,
      "start": 1403.260009765625,
      "end": 1406.3399963378906,
      "text": " God said at one point somewhere along the line, I remember reading, your ways are not"
    },
    {
      "id": 71,
      "start": 1406.3399963378906,
      "end": 1408.740005493164,
      "text": " my ways, friends."
    },
    {
      "id": 72,
      "start": 1408.740005493164,
      "end": 1412.4600067138672,
      "text": " Sometimes you've chosen the wrong way, not my way."
    },
    {
      "id": 73,
      "start": 1412.4600067138672,
      "end": 1415.3399963378906,
      "text": " And His way's the right way, always the right way."
    },
    {
      "id": 74,
      "start": 1415.3399963378906,
      "end": 1416.5,
      "text": " He said, listen, I stopped."
    },
    {
      "id": 75,
      "start": 1416.5,
      "end": 1421.7799987792969,
      "text": " He said, I thought on my ways, and as a result, I turned my feet unto thy testimonies."
    },
    {
      "id": 76,
      "start": 1421.7799987792969,
      "end": 1424.4600067138672,
      "text": " Now, that's a good thing."
    },
    {
      "id": 77,
      "start": 1424.4600067138672,
      "end": 1425.4600067138672,
      "text": " Lamentations 340."
    },
    {
      "id": 78,
      "start": 1425.9000091552734,
      "end": 1426.9000091552734,
      "text": " I like this one, too."
    },
    {
      "id": 79,
      "start": 1426.9000091552734,
      "end": 1432.8600006103516,
      "text": " \"'Let us search and try our ways, and turn again unto the Lord.'\""
    },
    {
      "id": 80,
      "start": 1432.8600006103516,
      "end": 1433.8600006103516,
      "text": " Wow."
    },
    {
      "id": 81,
      "start": 1433.8600006103516,
      "end": 1438.6600036621094,
      "text": " Galatians 6, 4, \"'But let every man prove his own work, and then shall he have rejoicing"
    },
    {
      "id": 82,
      "start": 1438.6600036621094,
      "end": 1441.3800048828125,
      "text": " in himself alone, not in another.'\""
    },
    {
      "id": 83,
      "start": 1441.3800048828125,
      "end": 1445.3000030517578,
      "text": " Second Corinthians 13, 5, this is an important one, \"'Examine yourselves.'\""
    },
    {
      "id": 84,
      "start": 1445.3000030517578,
      "end": 1450.3800048828125,
      "text": " \"'Examine yourselves,' Paul says to the Corinthian church, \"'Examine yourselves,' and he had a"
    },
    {
      "id": 85,
      "start": 1450.3800048828125,
      "end": 1455.4600067138672,
      "text": " reason for saying this, \"'Examine yourselves whether you be in the faith."
    },
    {
      "id": 86,
      "start": 1455.4600067138672,
      "end": 1456.4599914550781,
      "text": " Prove your own selves."
    },
    {
      "id": 87,
      "start": 1456.4599914550781,
      "end": 1461.260009765625,
      "text": " Know you not your own selves, how that Jesus Christ is in you, except you be reprobates?'"
    },
    {
      "id": 88,
      "start": 1461.260009765625,
      "end": 1465.260009765625,
      "text": " So Paul said, listen, you need to make sure you're saved.\""
    },
    {
      "id": 89,
      "start": 1465.260009765625,
      "end": 1468.3399963378906,
      "text": " Sometimes, you know, we've got people come into revival meetings just aren't saved."
    },
    {
      "id": 90,
      "start": 1468.3399963378906,
      "end": 1472.4599914550781,
      "text": " I was preaching at my home church last week, and I used the Ten Commandments."
    },
    {
      "id": 91,
      "start": 1472.4599914550781,
      "end": 1477.8999938964844,
      "text": " I went through all of the Ten Commandments, not the ten suggestions, the ten opinions."
    },
    {
      "id": 92,
      "start": 1477.8999938964844,
      "end": 1481.260009765625,
      "text": " Galatians chapter 20, I went down through each one of the Ten Commandments, and talked"
    },
    {
      "id": 93,
      "start": 1481.260009765625,
      "end": 1484.6199951171875,
      "text": " about them, and explained why God gave the moral law."
    },
    {
      "id": 94,
      "start": 1484.6199951171875,
      "end": 1486.2200012207031,
      "text": " Why did God give us the Ten Commandments?"
    },
    {
      "id": 95,
      "start": 1486.2200012207031,
      "end": 1489.4200134277344,
      "text": " Well, Galatians chapter 3 gives the answer."
    },
    {
      "id": 96,
      "start": 1489.4200134277344,
      "end": 1496.0599975585938,
      "text": " As a schoolmaster, to bring us to Christ, to convict us of sin, because there's no man"
    },
    {
      "id": 97,
      "start": 1496.0599975585938,
      "end": 1500.0599975585938,
      "text": " except the God-man, Christ Jesus, that was ever capable of keeping the law."
    },
    {
      "id": 98,
      "start": 1500.0599975585938,
      "end": 1504.3399963378906,
      "text": " And in fact, the Bible says the law was fulfilled in Him."
    },
    {
      "id": 99,
      "start": 1504.3399963378906,
      "end": 1509.0599975585938,
      "text": " So we know He can't keep the law, so as you read down through the Ten Commandments, somewhere"
    },
    {
      "id": 100,
      "start": 1509.0599975585938,
      "end": 1512.7000122070312,
      "text": " along the line, you ought to get convicted."
    },
    {
      "id": 101,
      "start": 1512.7000122070312,
      "end": 1515.8999938964844,
      "text": " For an unsaved person, I use the Ten Commandments in soul winning."
    },
    {
      "id": 102,
      "start": 1515.8999938964844,
      "end": 1517.9400024414062,
      "text": " I'm not one of these one, two, three, pray after me guys."
    },
    {
      "id": 103,
      "start": 1517.9400024414062,
      "end": 1519.4599914550781,
      "text": " I don't like this easy decisionism."
    },
    {
      "id": 104,
      "start": 1519.4599914550781,
      "end": 1525.6199951171875,
      "text": " I want people to know why they're lost, and know what the Bible says about being lost."
    },
    {
      "id": 105,
      "start": 1525.6199951171875,
      "end": 1526.6199951171875,
      "text": " And then you can lead them to Christ."
    },
    {
      "id": 106,
      "start": 1526.6199951171875,
      "end": 1530.5800170898438,
      "text": " You can't get somebody saved, get them lost first, amen?"
    },
    {
      "id": 107,
      "start": 1530.5800170898438,
      "end": 1531.5800170898438,
      "text": " So I want to get them lost."
    },
    {
      "id": 108,
      "start": 1531.5800170898438,
      "end": 1532.5800170898438,
      "text": " You can get them lost in the Ten Commandments."
    },
    {
      "id": 109,
      "start": 1533.5800170898438,
      "end": 1535.5800170898438,
      "text": " Well, sir, have you ever told a lie?"
    },
    {
      "id": 110,
      "start": 1535.5800170898438,
      "end": 1538.260009765625,
      "text": " Thou shalt not bear false witness."
    },
    {
      "id": 111,
      "start": 1538.260009765625,
      "end": 1539.260009765625,
      "text": " Have you ever told a lie?"
    },
    {
      "id": 112,
      "start": 1539.260009765625,
      "end": 1540.260009765625,
      "text": " Well, yeah, I've done that."
    },
    {
      "id": 113,
      "start": 1540.260009765625,
      "end": 1541.260009765625,
      "text": " Well, then the Bible says you're a liar."
    },
    {
      "id": 114,
      "start": 1541.260009765625,
      "end": 1545.5800170898438,
      "text": " You've got to be careful with how you approach this."
    },
    {
      "id": 115,
      "start": 1545.5800170898438,
      "end": 1546.5800170898438,
      "text": " Amen."
    },
    {
      "id": 116,
      "start": 1546.5800170898438,
      "end": 1547.5800170898438,
      "text": " Amen."
    },
    {
      "id": 117,
      "start": 1547.5800170898438,
      "end": 1551.1400146484375,
      "text": " Well, have you ever taken anything that's not yours?"
    },
    {
      "id": 118,
      "start": 1551.1400146484375,
      "end": 1553.6199951171875,
      "text": " No, yeah, when I was a kid, I stole something."
    },
    {
      "id": 119,
      "start": 1553.6199951171875,
      "end": 1555.2999877929688,
      "text": " I shoplifted in a candy store."
    },
    {
      "id": 120,
      "start": 1555.2999877929688,
      "end": 1557.0599975585938,
      "text": " I said, well, then you're a thief."
    },
    {
      "id": 121,
      "start": 1557.0599975585938,
      "end": 1560.739990234375,
      "text": " The Bible says you're a lying thief."
    },
    {
      "id": 122,
      "start": 1560.739990234375,
      "end": 1563.8600158691406,
      "text": " Have you ever coveted something that's not yours?"
    },
    {
      "id": 123,
      "start": 1563.8600158691406,
      "end": 1564.9400024414062,
      "text": " Maybe your neighbor's car."
    },
    {
      "id": 124,
      "start": 1564.9400024414062,
      "end": 1565.9400024414062,
      "text": " Maybe you've got a Toyota."
    },
    {
      "id": 125,
      "start": 1565.9400024414062,
      "end": 1566.9400024414062,
      "text": " He's got a Lexus."
    },
    {
      "id": 126,
      "start": 1566.9400024414062,
      "end": 1567.9400024414062,
      "text": " You'd like to have his Lexus."
    },
    {
      "id": 127,
      "start": 1567.9400024414062,
      "end": 1569.1799926757812,
      "text": " Well, thou shalt not covet."
    },
    {
      "id": 128,
      "start": 1569.1799926757812,
      "end": 1572.6199951171875,
      "text": " So you're a coveting, lying thief."
    },
    {
      "id": 129,
      "start": 1572.6199951171875,
      "end": 1573.6199951171875,
      "text": " I mean, you can go on and on."
    },
    {
      "id": 130,
      "start": 1573.6199951171875,
      "end": 1574.6199951171875,
      "text": " You can go right on down the list."
    },
    {
      "id": 131,
      "start": 1574.6199951171875,
      "end": 1575.8999938964844,
      "text": " Now, you've got to be careful with it."
    },
    {
      "id": 132,
      "start": 1575.8999938964844,
      "end": 1578.1400146484375,
      "text": " Once again, you have to be careful how you approach people with that."
    },
    {
      "id": 133,
      "start": 1578.1400146484375,
      "end": 1579.6600036621094,
      "text": " But you can get them lost that way."
    },
    {
      "id": 134,
      "start": 1579.6600036621094,
      "end": 1582.2999877929688,
      "text": " Well, Glaser's chapter 3 says, well, what is the purpose of the law?"
    },
    {
      "id": 135,
      "start": 1582.2999877929688,
      "end": 1586.7799987792969,
      "text": " Well, the purpose of the law is to be a schoolmaster to convictives of sin."
    },
    {
      "id": 136,
      "start": 1586.7799987792969,
      "end": 1591.2200012207031,
      "text": " The cause of the recognized were lost, it turned to Christ to be saved."
    },
    {
      "id": 137,
      "start": 1591.2200012207031,
      "end": 1595.9800109863281,
      "text": " So I mean, you can use the law as an effective tool."
    },
    {
      "id": 138,
      "start": 1595.9800109863281,
      "end": 1598.4599914550781,
      "text": " So it's a matter of people examining themselves."
    },
    {
      "id": 139,
      "start": 1598.4599914550781,
      "end": 1599.8999938964844,
      "text": " And so I wanted our church to see that."
    },
    {
      "id": 140,
      "start": 1599.8999938964844,
      "end": 1603.4200134277344,
      "text": " I said, now, we've got some people here this morning, I'll guarantee you, we've probably"
    },
    {
      "id": 141,
      "start": 1603.4200134277344,
      "end": 1606.4200134277344,
      "text": " got some church members here that are lost."
    },
    {
      "id": 142,
      "start": 1606.4200134277344,
      "end": 1608.5400085449219,
      "text": " Just because you're a church member, it doesn't impress me."
    },
    {
      "id": 143,
      "start": 1608.5400085449219,
      "end": 1612.9400024414062,
      "text": " In fact, it doesn't impress God."
    },
    {
      "id": 144,
      "start": 1612.9400024414062,
      "end": 1615.9800109863281,
      "text": " Maybe you're a tithing church member and you take the Lord's Supper and all the rest of"
    },
    {
      "id": 145,
      "start": 1615.9800109863281,
      "end": 1616.9800109863281,
      "text": " it."
    },
    {
      "id": 146,
      "start": 1616.9800109863281,
      "end": 1619.4599914550781,
      "text": " And maybe you're even out knocking doors with us on Saturdays, but you've never been"
    },
    {
      "id": 147,
      "start": 1619.4599914550781,
      "end": 1620.4599914550781,
      "text": " born again."
    },
    {
      "id": 148,
      "start": 1620.4599914550781,
      "end": 1622.8999938964844,
      "text": " Examine yourselves, whether you be in the faith."
    },
    {
      "id": 149,
      "start": 1622.8999938964844,
      "end": 1623.9400024414062,
      "text": " Because you've never been changed."
    },
    {
      "id": 150,
      "start": 1623.9400024414062,
      "end": 1625.1400146484375,
      "text": " You may have changed the outside."
    },
    {
      "id": 151,
      "start": 1625.1400146484375,
      "end": 1626.8200073242188,
      "text": " Oh, here we go now."
    },
    {
      "id": 152,
      "start": 1626.8200073242188,
      "end": 1629.6199951171875,
      "text": " You may have changed the outside, but the heart's never been changed."
    },
    {
      "id": 153,
      "start": 1629.6199951171875,
      "end": 1633.4200134277344,
      "text": " You got a three-piece suit and a King James haircut, but your heart's never been changed."
    },
    {
      "id": 154,
      "start": 1633.4200134277344,
      "end": 1636.1400146484375,
      "text": " And because your heart's never been changed, it shows up on the outside in the way you"
    },
    {
      "id": 155,
      "start": 1636.1400146484375,
      "end": 1637.1400146484375,
      "text": " live your life."
    },
    {
      "id": 156,
      "start": 1637.1400146484375,
      "end": 1638.1400146484375,
      "text": " And you've never been changed."
    },
    {
      "id": 157,
      "start": 1638.1400146484375,
      "end": 1641.5800170898438,
      "text": " You live a two-standard life."
    },
    {
      "id": 158,
      "start": 1641.5800170898438,
      "end": 1646.3399963378906,
      "text": " You'll live one way outside the church and one way in the church because it's more important"
    },
    {
      "id": 159,
      "start": 1646.3399963378906,
      "end": 1648.9400024414062,
      "text": " you have people see you than it is how God sees you."
    },
    {
      "id": 160,
      "start": 1648.9400024414062,
      "end": 1649.9400024414062,
      "text": " Amen."
    },
    {
      "id": 161,
      "start": 1649.9400024414062,
      "end": 1651.5,
      "text": " Preacher, that's good."
    },
    {
      "id": 162,
      "start": 1651.5,
      "end": 1654.1000061035156,
      "text": " I mean, it really does convict people."
    },
    {
      "id": 163,
      "start": 1654.1000061035156,
      "end": 1655.1000061035156,
      "text": " So I want them to see that."
    },
    {
      "id": 164,
      "start": 1655.1000061035156,
      "end": 1658.4200134277344,
      "text": " Well, we had two people saved at the service."
    },
    {
      "id": 165,
      "start": 1658.4200134277344,
      "end": 1661.9400024414062,
      "text": " Now I don't know, they weren't church members that I know of."
    },
    {
      "id": 166,
      "start": 1661.9400024414062,
      "end": 1662.9400024414062,
      "text": " Amen."
    },
    {
      "id": 167,
      "start": 1662.9400024414062,
      "end": 1665.4200134277344,
      "text": " I wrote this down for me."
    },
    {
      "id": 168,
      "start": 1665.4200134277344,
      "end": 1669.260009765625,
      "text": " The hardest thing to do is to honestly examine ourselves."
    },
    {
      "id": 169,
      "start": 1669.260009765625,
      "end": 1673.0199890136719,
      "text": " And the reason that we won't do it is because we sometimes engage in self-deception."
    },
    {
      "id": 170,
      "start": 1673.0199890136719,
      "end": 1676.0199890136719,
      "text": " Well, I'm really okay."
    },
    {
      "id": 171,
      "start": 1676.0199890136719,
      "end": 1678.3399963378906,
      "text": " It makes you feel easy and comfortable."
    },
    {
      "id": 172,
      "start": 1678.3399963378906,
      "end": 1683.8600158691406,
      "text": " We can deceive ourselves sometimes when we don't examine ourselves the way we should."
    },
    {
      "id": 173,
      "start": 1683.8600158691406,
      "end": 1688.4599914550781,
      "text": " So we ought to examine ourselves, inspect ourselves in detail, examine ourselves and"
    },
    {
      "id": 174,
      "start": 1688.4599914550781,
      "end": 1692.1000061035156,
      "text": " look at ourselves thoroughly in accordance with the Word of God."
    },
    {
      "id": 175,
      "start": 1692.1000061035156,
      "end": 1693.1000061035156,
      "text": " Amen."
    },
    {
      "id": 176,
      "start": 1693.1000061035156,
      "end": 1696.0199890136719,
      "text": " Now I've got to move along here."
    },
    {
      "id": 177,
      "start": 1696.0199890136719,
      "end": 1697.7000122070312,
      "text": " I don't have much time left."
    },
    {
      "id": 178,
      "start": 1697.7000122070312,
      "end": 1699.5,
      "text": " Oswald J. Smith put this out."
    },
    {
      "id": 179,
      "start": 1699.5,
      "end": 1700.5,
      "text": " I really like this."
    },
    {
      "id": 180,
      "start": 1700.5,
      "end": 1702.8600158691406,
      "text": " He's a great Canadian pastor."
    },
    {
      "id": 181,
      "start": 1702.8600158691406,
      "end": 1705.4200134277344,
      "text": " Some of you have probably read some of his material."
    },
    {
      "id": 182,
      "start": 1705.4200134277344,
      "end": 1708.7000122070312,
      "text": " He has a lot of good material out there, especially about missions."
    },
    {
      "id": 183,
      "start": 1708.7000122070312,
      "end": 1710.4599914550781,
      "text": " But he wrote a little thing about self-examination."
    },
    {
      "id": 184,
      "start": 1710.4599914550781,
      "end": 1712.3800048828125,
      "text": " He gave a list."
    },
    {
      "id": 185,
      "start": 1712.3800048828125,
      "end": 1713.7000122070312,
      "text": " And in the entire list, are we guilty?"
    },
    {
      "id": 186,
      "start": 1713.7000122070312,
      "end": 1716.1799926757812,
      "text": " Let me just quickly read you the list."
    },
    {
      "id": 187,
      "start": 1716.1799926757812,
      "end": 1719.8200073242188,
      "text": " Number one, this is when it comes to self-examination."
    },
    {
      "id": 188,
      "start": 1719.8200073242188,
      "end": 1723.5,
      "text": " Number one, have we forgiven everyone?"
    },
    {
      "id": 189,
      "start": 1723.5,
      "end": 1726.3400268554688,
      "text": " Is there any malice, spite, hatred or enmity in our hearts?"
    },
    {
      "id": 190,
      "start": 1726.3400268554688,
      "end": 1727.3400268554688,
      "text": " Do we cherish grudges?"
    },
    {
      "id": 191,
      "start": 1728.2200317382812,
      "end": 1731.6199951171875,
      "text": " Have we refused to be reconciled?"
    },
    {
      "id": 192,
      "start": 1731.6199951171875,
      "end": 1733.6199951171875,
      "text": " We ought to be reconciled to our brother."
    },
    {
      "id": 193,
      "start": 1733.6199951171875,
      "end": 1737.4199829101562,
      "text": " If you have one against another, you should make that right with him."
    },
    {
      "id": 194,
      "start": 1737.4199829101562,
      "end": 1740.1799926757812,
      "text": " During revival times, that's one of the things that sometimes happens."
    },
    {
      "id": 195,
      "start": 1740.1799926757812,
      "end": 1741.5,
      "text": " I've seen it happen in two churches."
    },
    {
      "id": 196,
      "start": 1741.5,
      "end": 1745.8599853515625,
      "text": " We had a revival break out in two churches, and I had no idea, preaching that meeting,"
    },
    {
      "id": 197,
      "start": 1745.8599853515625,
      "end": 1750.9000244140625,
      "text": " that half the church was at odds with the other half."
    },
    {
      "id": 198,
      "start": 1750.9000244140625,
      "end": 1755.6199951171875,
      "text": " And in one church, they were all upset with the pastor's wife."
    },
    {
      "id": 199,
      "start": 1755.6199951171875,
      "end": 1758.4600219726562,
      "text": " And during the invitation, she's playing the piano, had to stop because people are"
    },
    {
      "id": 200,
      "start": 1758.4600219726562,
      "end": 1762.739990234375,
      "text": " coming, weeping, asking for her forgiveness and hugging her because they had ought against"
    },
    {
      "id": 201,
      "start": 1762.739990234375,
      "end": 1766.4199829101562,
      "text": " her, and asked her forgiveness."
    },
    {
      "id": 202,
      "start": 1766.4199829101562,
      "end": 1770.5800170898438,
      "text": " The song leader got up and said, I preached on pride the night before."
    },
    {
      "id": 203,
      "start": 1770.5800170898438,
      "end": 1772.1799926757812,
      "text": " We'd extended the meeting out another day."
    },
    {
      "id": 204,
      "start": 1772.1799926757812,
      "end": 1775.3400268554688,
      "text": " And he got up and he said, listen, he said, I'm just full of pride."
    },
    {
      "id": 205,
      "start": 1775.3400268554688,
      "end": 1779.0599975585938,
      "text": " He said, I think I raised perfect kids, had a perfect home, had a perfect marriage, and"
    },
    {
      "id": 206,
      "start": 1779.0599975585938,
      "end": 1782.1400146484375,
      "text": " I thought we had every hair in place, and the rest of the church was just really in"
    },
    {
      "id": 207,
      "start": 1782.1400146484375,
      "end": 1783.6599731445312,
      "text": " serious trouble."
    },
    {
      "id": 208,
      "start": 1784.6599731445312,
      "end": 1787.6199951171875,
      "text": " And his wife got up and said the same thing."
    },
    {
      "id": 209,
      "start": 1787.6199951171875,
      "end": 1791.3800048828125,
      "text": " And revival broke out in that place, and I just went back and sat in the back back there"
    },
    {
      "id": 210,
      "start": 1791.3800048828125,
      "end": 1794.5800170898438,
      "text": " and said, hallelujah, praise God, just let it go and happen, turn it over to the pastor"
    },
    {
      "id": 211,
      "start": 1794.5800170898438,
      "end": 1796.2999877929688,
      "text": " and let him just handle the thing."
    },
    {
      "id": 212,
      "start": 1796.2999877929688,
      "end": 1798.3400268554688,
      "text": " And it went on and on and on."
    },
    {
      "id": 213,
      "start": 1798.3400268554688,
      "end": 1800.5,
      "text": " And it all had to do with reconciliation amongst the church."
    },
    {
      "id": 0,
      "start": 1800.5,
      "end": 1807.460000038147,
      "text": " the brethren, saw it happen to another church. Number two, do we get angry? Come on now."
    },
    {
      "id": 1,
      "start": 1807.460000038147,
      "end": 1814.8999996185303,
      "text": " Do we get angry? Are there any uprisings within? Is it true that we still lose our tempers?"
    },
    {
      "id": 2,
      "start": 1814.8999996185303,
      "end": 1821.8999996185303,
      "text": " Does wrath hold us at times in its grip? Do you get angry? I get angry sometimes driving"
    },
    {
      "id": 3,
      "start": 1821.8999996185303,
      "end": 1829.1800003051758,
      "text": " through Los Angeles. It's not a rush hour. It's a parking lot, and I just can't handle"
    },
    {
      "id": 4,
      "start": 1829.1800003051758,
      "end": 1834.1800003051758,
      "text": " traffic, and I get angry. And my wife, I said to men yesterday, my wife says, you just stress"
    },
    {
      "id": 5,
      "start": 1834.1800003051758,
      "end": 1842.1800003051758,
      "text": " me out. When we were doing the RV, it was even worse. And she said, do you just have"
    },
    {
      "id": 6,
      "start": 1842.1800003051758,
      "end": 1848.0200004577637,
      "text": " joy? And I said, oh yeah, I'm really enjoying this, praise the Lord. Number three, is there"
    },
    {
      "id": 7,
      "start": 1848.0200004577637,
      "end": 1853.3800010681152,
      "text": " any feeling of jealousy when another's preferred before us? Does it make us envious and uncomfortable?"
    },
    {
      "id": 8,
      "start": 1853.3800010681152,
      "end": 1859.9799995422363,
      "text": " Do we get jealous of those who can pray, and speak, and do things better than we can?"
    },
    {
      "id": 9,
      "start": 1859.9799995422363,
      "end": 1867.620002746582,
      "text": " Number four, do we get impatient and irritated? I had someone tell me one time, pastor, I"
    },
    {
      "id": 10,
      "start": 1867.620002746582,
      "end": 1874.9400024414062,
      "text": " just want to let you know you irritate me. I said, wait a minute, get in line, brother."
    },
    {
      "id": 11,
      "start": 1874.9400024414062,
      "end": 1878.7799987792969,
      "text": " What can I tell a guy that says that? I can only say, well, I'm sorry, I mean, how did"
    },
    {
      "id": 12,
      "start": 1878.7799987792969,
      "end": 1883.2799987792969,
      "text": " I irritate you? And then he's going to give me a list, you know. Do little things vex"
    },
    {
      "id": 13,
      "start": 1883.2799987792969,
      "end": 1888.5800018310547,
      "text": " and annoy, or are we sweet, calm, and unruffled under all circumstances? Number five, are"
    },
    {
      "id": 14,
      "start": 1888.5800018310547,
      "end": 1893.2200012207031,
      "text": " we offended easily? There's a big one. When people fail to notice us and pass by without"
    },
    {
      "id": 15,
      "start": 1893.2200012207031,
      "end": 1899.0199966430664,
      "text": " speaking, does it hurt? If others are made much of, and we are neglected, how do we feel"
    },
    {
      "id": 16,
      "start": 1899.0199966430664,
      "end": 1906.2200012207031,
      "text": " about it? Number six, is there any pride in our hearts? No, no, no, no, none of us ever"
    },
    {
      "id": 17,
      "start": 1906.2200012207031,
      "end": 1910.0199966430664,
      "text": " deal with that. Come on now, are we puffed up? Do we think a great deal of our own position"
    },
    {
      "id": 18,
      "start": 1910.0199966430664,
      "end": 1919.0199966430664,
      "text": " and attainments? Number seven, have we been dishonest? Is our business open and above"
    },
    {
      "id": 19,
      "start": 1919.0199966430664,
      "end": 1922.0599975585938,
      "text": " reproach? Do we give a yard for a yard and a pound for a pound? Are we honest in our"
    },
    {
      "id": 20,
      "start": 1922.0599975585938,
      "end": 1926.9800033569336,
      "text": " statements or do we exaggerate and thus convey false impressions? I submit unto you that"
    },
    {
      "id": 21,
      "start": 1926.9800033569336,
      "end": 1933.0599975585938,
      "text": " the number one most probably insidious, pervasive sin amongst Christian people is lying. We"
    },
    {
      "id": 22,
      "start": 1933.0599975585938,
      "end": 1938.3399963378906,
      "text": " come forth from the womb speaking lies. We're born liars. Unless the Holy Spirit of God"
    },
    {
      "id": 23,
      "start": 1938.3399963378906,
      "end": 1944.4199981689453,
      "text": " has control of that, we can still be involved in lying, and we have a tendency to exaggerate"
    },
    {
      "id": 24,
      "start": 1944.4199981689453,
      "end": 1951.0599975585938,
      "text": " when it benefits us. Number eight, have we been gossiping about people? No, we don't"
    },
    {
      "id": 25,
      "start": 1951.0599975585938,
      "end": 1958.8200073242188,
      "text": " do that in Baptist churches. I've got an example, I'll use it later. Do we slander the character"
    },
    {
      "id": 26,
      "start": 1958.8200073242188,
      "end": 1964.6999969482422,
      "text": " of others? Well, that seems like that's almost like a spectator sport in America today. People"
    },
    {
      "id": 27,
      "start": 1964.6999969482422,
      "end": 1968.259994506836,
      "text": " just slandering each other, tearing each other apart, so much divisions and vitriol and so"
    },
    {
      "id": 28,
      "start": 1968.259994506836,
      "end": 1973.0599975585938,
      "text": " much bitterness and angst. It's amazing what's happened to our society today. Everybody's"
    },
    {
      "id": 29,
      "start": 1973.0599975585938,
      "end": 1976.7799987792969,
      "text": " impugning each other's character and tearing each other apart to try to get their way and"
    },
    {
      "id": 30,
      "start": 1976.7799987792969,
      "end": 1982.6199951171875,
      "text": " to put forth their own agenda. It's disgusting. Do we slander the character of others? Are"
    },
    {
      "id": 31,
      "start": 1982.6199951171875,
      "end": 1988.259994506836,
      "text": " we tail bearers in busybodies? Number nine, do we criticize unlovingly, harshly, severely?"
    },
    {
      "id": 32,
      "start": 1988.259994506836,
      "end": 1993.3800048828125,
      "text": " Are we always finding fault and looking for flaws in others? Yeah, we do that. Number"
    },
    {
      "id": 33,
      "start": 1993.3800048828125,
      "end": 1999.8999938964844,
      "text": " 10, do we rob God? Have we stolen time that belongs to Him? Has our money been withheld?"
    },
    {
      "id": 34,
      "start": 1999.8999938964844,
      "end": 2006.259994506836,
      "text": " Number 11, are we guilty of the sin of unbelief? In spite of all He has done for us, do we"
    },
    {
      "id": 35,
      "start": 2006.259994506836,
      "end": 2011.3800048828125,
      "text": " still refuse to believe the promises of His Word? God is good for His Word. Aren't you"
    },
    {
      "id": 36,
      "start": 2011.3800048828125,
      "end": 2016.9400024414062,
      "text": " glad for that? Number 12, have we committed the sin of prayerlessness? Are we intercessors?"
    },
    {
      "id": 37,
      "start": 2016.9400024414062,
      "end": 2019.8200073242188,
      "text": " Do we pray? How much time are we spending on our knees? Have we crowded prayer out of"
    },
    {
      "id": 38,
      "start": 2019.8200073242188,
      "end": 2025.4600067138672,
      "text": " our lives? Number 13, are we neglecting God's Word? How many chapters do we read each day?"
    },
    {
      "id": 39,
      "start": 2025.4600067138672,
      "end": 2031.3000030517578,
      "text": " Are we Bible students? Do we draw our source of supply from the Scriptures? Number 14,"
    },
    {
      "id": 40,
      "start": 2031.3000030517578,
      "end": 2036.1199951171875,
      "text": " are we burdened for the salvation of souls? Have we a love for the lost? Is there any"
    },
    {
      "id": 41,
      "start": 2036.1199951171875,
      "end": 2041.3399963378906,
      "text": " compassion in our hearts for those who are perishing? Number 15, have we failed to confess"
    },
    {
      "id": 42,
      "start": 2041.3399963378906,
      "end": 2045.6999969482422,
      "text": " Christ openly? Are we ashamed of Jesus? Do we keep our mouths closed when we're surrendered"
    },
    {
      "id": 43,
      "start": 2045.6999969482422,
      "end": 2051.539993286133,
      "text": " by worldly people we're witnessing daily? Number 16, are our lives filled with lightness"
    },
    {
      "id": 44,
      "start": 2051.539993286133,
      "end": 2056.8599853515625,
      "text": " and frivolity? Is our conduct unseemly? Would the world, by our actions, consider us on"
    },
    {
      "id": 45,
      "start": 2056.8599853515625,
      "end": 2063.2000122070312,
      "text": " its side? Well, that's a good one there. Number 17, have we wronged anyone and failed to make"
    },
    {
      "id": 46,
      "start": 2063.2000122070312,
      "end": 2068.1799926757812,
      "text": " restitution or has the spirit of Zacchaeus possessed us? Have we restored the many little"
    },
    {
      "id": 47,
      "start": 2068.1799926757812,
      "end": 2073.739990234375,
      "text": " things that God has shown us? Number 18, are we worried or anxious? Do we fail to trust"
    },
    {
      "id": 48,
      "start": 2073.739990234375,
      "end": 2077.540008544922,
      "text": " God for our temporal and spiritual needs? Are we constantly crossing bridges before"
    },
    {
      "id": 49,
      "start": 2077.540008544922,
      "end": 2084.1799926757812,
      "text": " we come to them? Number 19, are we guilty of lustful thoughts? Do we allow our minds"
    },
    {
      "id": 50,
      "start": 2084.1799926757812,
      "end": 2087.9400024414062,
      "text": " to harbor impure and unholy imaginations? That's a big problem today with men because"
    },
    {
      "id": 51,
      "start": 2087.9400024414062,
      "end": 2090.9200134277344,
      "text": " I'll tell you what, you can't hardly go out in the public anymore and not be offended"
    },
    {
      "id": 52,
      "start": 2090.9200134277344,
      "end": 2099.0599975585938,
      "text": " by what we see or be enticed by it. It's sad. A. W. Tozer wrote this in his classic work"
    },
    {
      "id": 53,
      "start": 2099.0599975585938,
      "end": 2103.3800048828125,
      "text": " The Pursuit of God. He said this, he said, the man who has struggled to purify himself"
    },
    {
      "id": 54,
      "start": 2103.4200134277344,
      "end": 2107.260009765625,
      "text": " and has had nothing but repeated failures will experience real relief when he stops"
    },
    {
      "id": 55,
      "start": 2107.260009765625,
      "end": 2112.5,
      "text": " tinkering with his soul and looks away to the perfect one. While he looks at Christ,"
    },
    {
      "id": 56,
      "start": 2112.5,
      "end": 2117.779998779297,
      "text": " the very thing he has so long been trying to do, we'll be getting done with him. We"
    },
    {
      "id": 57,
      "start": 2117.779998779297,
      "end": 2122.6600036621094,
      "text": " should examine ourselves in light of the truth being revealed to us from Scripture and allow"
    },
    {
      "id": 58,
      "start": 2122.6600036621094,
      "end": 2129.2000122070312,
      "text": " God's Word to convict us and change us. At the same time, we must humbly admit our inability"
    },
    {
      "id": 59,
      "start": 2129.2000122070312,
      "end": 2136.6799926757812,
      "text": " to change ourselves and rely on the power of ourselves and rely on the power of the"
    },
    {
      "id": 60,
      "start": 2136.6799926757812,
      "end": 2143.0,
      "text": " Holy Spirit within to transform us into the image of Christ. So, when you consider all"
    },
    {
      "id": 61,
      "start": 2143.0,
      "end": 2148.8399963378906,
      "text": " these things, this idea of self-examination, self-confrontation, to me personally is a"
    },
    {
      "id": 62,
      "start": 2148.8399963378906,
      "end": 2157.2000122070312,
      "text": " very important thing when it comes to revival, to revival. When God's willing to send revival,"
    },
    {
      "id": 63,
      "start": 2157.2000122070312,
      "end": 2163.3599853515625,
      "text": " the problem's not with him. The problem's not with God, the problem's with us. And"
    },
    {
      "id": 64,
      "start": 2163.3599853515625,
      "end": 2167.239990234375,
      "text": " you say, well, that sounds like kind of a blanking indictment. Well, in some ways it"
    },
    {
      "id": 65,
      "start": 2167.239990234375,
      "end": 2170.6000061035156,
      "text": " is. I mean, we really have to look at us, not only just individually, but corporately"
    },
    {
      "id": 66,
      "start": 2170.6000061035156,
      "end": 2176.760009765625,
      "text": " as well. You know? One of the things that I've seen in revival is this. We talked about"
    },
    {
      "id": 67,
      "start": 2176.760009765625,
      "end": 2179.959991455078,
      "text": " this, we're talking about this a couple of times since we've been here. One of the"
    },
    {
      "id": 68,
      "start": 2179.959991455078,
      "end": 2183.2000122070312,
      "text": " things I've seen in revival about this is that when revival comes, man, the old-fashioned"
    },
    {
      "id": 69,
      "start": 2183.2000122070312,
      "end": 2189.3200073242188,
      "text": " excitement that one time permeated our churches. I mean, just the joy, the zeal. Once again,"
    },
    {
      "id": 70,
      "start": 2189.3200073242188,
      "end": 2193.3999938964844,
      "text": " I'll bring it up a little bit, the sporting in the morning message. Let me tell you what,"
    },
    {
      "id": 71,
      "start": 2193.3999938964844,
      "end": 2195.959991455078,
      "text": " the joy and the zeal that really ought to be in the house of God and the excitement"
    },
    {
      "id": 72,
      "start": 2195.959991455078,
      "end": 2199.2000122070312,
      "text": " ought to be there, the enthusiasm ought to be there. When revival comes, God restores"
    },
    {
      "id": 73,
      "start": 2199.2000122070312,
      "end": 2205.7999877929688,
      "text": " that. You know? Some people come to church, look like they've been sucking lemon juice"
    },
    {
      "id": 74,
      "start": 2205.7999877929688,
      "end": 2212.6400146484375,
      "text": " through PVC pipe all week long, man, they just come to work sour. You know? God doesn't"
    },
    {
      "id": 75,
      "start": 2212.6400146484375,
      "end": 2216.239990234375,
      "text": " want us to come to the house of the Lord that way. We ought to have joy, joy unspeakable"
    },
    {
      "id": 76,
      "start": 2216.239990234375,
      "end": 2221.480010986328,
      "text": " full glory. We ought to be excited about something. You know, the world's excited about all kinds"
    },
    {
      "id": 77,
      "start": 2221.480010986328,
      "end": 2230.6799926757812,
      "text": " of things. Amen? I have a picture on my phone, Lord forgive me, I have a picture on my phone"
    },
    {
      "id": 78,
      "start": 2230.6799926757812,
      "end": 2240.760009765625,
      "text": " of a 2024 Corvette Z06. No, I love Corvettes. Amen? I'm 77 years old, I have no business"
    },
    {
      "id": 79,
      "start": 2240.760009765625,
      "end": 2248.480010986328,
      "text": " even thinking about that. But if God give me one of them, I sure drive it, amen? I"
    },
    {
      "id": 80,
      "start": 2248.480010986328,
      "end": 2253.0799865722656,
      "text": " sure would. And let me tell you this, I mean, I was in a car dealer the other day getting"
    },
    {
      "id": 81,
      "start": 2253.0799865722656,
      "end": 2255.7999877929688,
      "text": " my car serviced and there's one out in the showroom floor, it's one of the only ones"
    },
    {
      "id": 82,
      "start": 2255.7999877929688,
      "end": 2261.279998779297,
      "text": " on the West Coast. It's a Copa, it's a beautiful car. And I'm looking at this thing, man, I'm"
    },
    {
      "id": 83,
      "start": 2261.279998779297,
      "end": 2264.040008544922,
      "text": " looking at it and I'm saying, wow, this is some car, let's take a picture of it. Guy"
    },
    {
      "id": 84,
      "start": 2264.040008544922,
      "end": 2269.5599975585938,
      "text": " said, hey, can I sell this to you? I said, you could, but I said I couldn't afford it,"
    },
    {
      "id": 85,
      "start": 2269.5599975585938,
      "end": 2276.519989013672,
      "text": " it was $172,000. And I said, yeah, I said, it's looking good, man. I said, that thing"
    },
    {
      "id": 86,
      "start": 2276.519989013672,
      "end": 2282.0799865722656,
      "text": " looks fast just sitting there. And he said, do you think you can handle this car? I said,"
    },
    {
      "id": 87,
      "start": 2282.0799865722656,
      "end": 2287.4400024414062,
      "text": " try me out. He said, I'll road test it right now. Well, see, now that excites me. I just,"
    },
    {
      "id": 88,
      "start": 2287.4400024414062,
      "end": 2292.8800048828125,
      "text": " I'm a car guy, I'm an aviation guy for one thing, but I'm a car guy and I like cars and"
    },
    {
      "id": 89,
      "start": 2292.8800048828125,
      "end": 2298.760009765625,
      "text": " the faster the better. And sometimes the Lord has to convict me of that."
    },
    {
      "id": 90,
      "start": 2298.760009765625,
      "end": 2305.3599853515625,
      "text": " Now preacher, you don't need to be thinking about that stuff. Now the car excites me,"
    },
    {
      "id": 91,
      "start": 2305.3599853515625,
      "end": 2310.1199951171875,
      "text": " just looking at it excited me. The thought of having one really excites me. But here's"
    },
    {
      "id": 92,
      "start": 2310.1199951171875,
      "end": 2315.280029296875,
      "text": " the thing, if something like that, some kind of a material thing like that can excite us,"
    },
    {
      "id": 93,
      "start": 2315.280029296875,
      "end": 2321.280029296875,
      "text": " then what about the things of God? Why don't we get excited about the things of God? You"
    },
    {
      "id": 94,
      "start": 2322.0800170898438,
      "end": 2328.8400268554688,
      "text": " know? So we ought to get excited. We ought to be enthusiastic. We ought to rejoice about"
    },
    {
      "id": 95,
      "start": 2328.8400268554688,
      "end": 2333.6400146484375,
      "text": " the things of the Lord. God's been good to us. For God is good and his mercy endureth"
    },
    {
      "id": 96,
      "start": 2333.6400146484375,
      "end": 2338.5599975585938,
      "text": " forever. God's been so good. I praise the Lord for it. We need to examine ourselves"
    },
    {
      "id": 97,
      "start": 2338.5599975585938,
      "end": 2342.9199829101562,
      "text": " and sometimes engage in self-confrontation. Father, we thank you Lord this morning for"
    },
    {
      "id": 98,
      "start": 2342.9199829101562,
      "end": 2346.2000122070312,
      "text": " what we've seen in that word, just a very simple Sunday school lesson, but yet still"
    },
    {
      "id": 99,
      "start": 2346.2000122070312,
      "end": 2350.9600219726562,
      "text": " at the same time, I think very important. So God, as we begin this revival meeting this"
    },
    {
      "id": 100,
      "start": 2350.9600219726562,
      "end": 2356.8800048828125,
      "text": " week, I pray that we would be willing to spend some time as did David. We see in the"
    },
    {
      "id": 101,
      "start": 2356.8800048828125,
      "end": 2362.0,
      "text": " Psalms that he many times would, even in the early hours of the morning, in the middle"
    },
    {
      "id": 102,
      "start": 2362.0,
      "end": 2365.9600219726562,
      "text": " of the night at times, he would lay in his bed and he would muse and he would consider"
    },
    {
      "id": 103,
      "start": 2365.9600219726562,
      "end": 2370.0,
      "text": " and he'd think about and examine himself. Lord, sometimes we just need to stop and do"
    },
    {
      "id": 104,
      "start": 2370.0,
      "end": 2375.6799926757812,
      "text": " that as well. I pray God that we would this week just seek your face and Lord, we just"
    },
    {
      "id": 105,
      "start": 2375.6799926757812,
      "end": 2379.239990234375,
      "text": " bow before you God, cry out your name and ask that you would once again breathe fresh"
    },
    {
      "id": 106,
      "start": 2379.239990234375,
      "end": 2385.0800170898438,
      "text": " upon us. Oh Spirit of God, do that which only you can do. Work in our hearts and lives."
    },
    {
      "id": 107,
      "start": 2385.0800170898438,
      "end": 2388.6799926757812,
      "text": " Begin with me, oh God, I pray. I'm a needy preacher. I need your help and I need you"
    },
    {
      "id": 108,
      "start": 2388.6799926757812,
      "end": 2392.8800048828125,
      "text": " to speak to me this week as well. So Lord, I pray that we would just have a meeting this"
    },
    {
      "id": 109,
      "start": 2392.8800048828125,
      "end": 2396.4000244140625,
      "text": " week which would be honoring and glorifying to you. We'll thank you for it in advance"
    },
    {
      "id": 110,
      "start": 2396.4000244140625,
      "end": 2398.4000244140625,
      "text": " in Jesus' name. Amen. Pastor?"
    },
    {
      "id": 111,
      "start": 2398.4000244140625,
      "end": 2399.9600219726562,
      "text": " Amen. You are dismissed."
    }
  ],
  "processed_at": "2025-04-16T00:30:52.331827"
}