{
  "video_id": "eKXXb-CvsCo",
  "text": "this evening, John chapter 21. You say, pastor, I thought we were in the book of Revelation. Well, we were and we are. And I'll remind you the last study last Sunday night was the teen takeover. But the week before, we finished up looking at the letter to the church of Ephesus. We dealt with the church in Ephesus. And we found, as we studied the last two weeks ago, that the Lord corrected the believers in Ephesus for this reason, because they left their first love. The Lord said, nevertheless, I am somewhat against thee. And we find that as we begin reading that correction to the church at Ephesus and the instruction for what they were to do and how they were to respond in dealing with that, I wonder this evening, if it was true of the believers in Ephesus that they had left their first love in the first century, if it was true of them, and if Jesus said it, then it was true, amen, I wonder this evening, how many other believers are guilty of leaving their first love over the last 20 centuries? I don't know the number, you don't know the number, but we know that God is aware of how many he would say to as he did to the church of Ephesus, you've left your first love. I believe that the Lord knows and I believe that the Lord is faithful to use his word to bring conviction to the heart of the individual that would be guilty of leaving their first love. I'm reminded at the end of the letter to the church of Ephesus and to each of the churches, we find these words, he that hath an ear, let him hear what the Spirit saith unto the churches. We find that this letter must have caused the believers in Ephesus to pause, to examine, to be able to have that process of answering the question, do I really love God? Do I love God with all my heart? Remember what the Bible says there in John 21, we'll be there in just a moment, but let me read to you a couple of verses in the book of Deuteronomy in chapter six in verse number five, the Bible says this, and thou shalt love the Lord thy God with all thine heart, with all thy soul and with all thy might. We find a few chapters later in Deuteronomy 10 in verse number 12, the Bible says this, and now Israel, what doth the Lord thy God require of thee, but to fear the Lord thy God, to walk in all his ways and to love him and to serve the Lord thy God with all thy heart and with all thy soul. So we begin to think about this subject matter this evening, I wanna preach a message that I've simply entitled, loving God with all your heart. Loving God with all your heart. I've invited you to turn to John 21, because I wanna review this evening, the interaction that God gives us in John chapter 21 between the Lord Jesus Christ, our resurrected Savior with Peter. And in John 21, beginning in verse number 15, notice what the Bible says, I'll read verse 15 down through verse number 19, and then we'll get into the message this evening. In verse 15, the Bible says, so when they had dined, Jesus saith to Simon Peter, Simon, son of Jonas, lovest thou me more than these? He saith unto him, yea, Lord, thou knowest that I love thee. He saith unto him, feed my lambs. He saith to him again the second time, Simon, son of Jonas, lovest thou me? He saith unto him, yea, Lord, thou knowest that I love thee. He saith unto him, feed my sheep. He saith unto him, verse 17, the third time, Simon, son of Jonas, lovest thou me? Peter was grieved. It means to have a heavy, sorrowful, broken heart. He was grieved because he said unto him the third time, lovest thou me? And he said unto him, Lord, thou knowest all things. By the way, that's a convicting truth. God knows all things. We can say whatever we wanna say, but God knows. In fact, when we get to the letter to the church of the Laodiceans, he says, you say, but here's what I say. Notice, Lord, thou knowest all things. Thou knowest that I love thee. Jesus saith unto him, feed my sheep. Verily, verily, I say unto thee, when thou wast young, thou girdest thyself and walkest whither thou wouldest, but when thou shalt be old, thou shalt stretch forth thy hands and another shall gird thee and carry thee whither thou wouldest not. This spake he, signifying by what death he should glorify God. And who had spoken this, he saith unto him, follow me. I want you to think about this interaction, this evening between the resurrected Christ and Peter. And I want you to just pause for a moment and put yourself in the account that we've read in John chapter 21. And I want you to think about Peter, who Peter is and what Peter has professed over the time that we have the opportunity to read the gospel messages and the gospel accounts of the life and ministry of the Lord Jesus Christ. And it's this Peter that we find that as he was a fisherman, that Jesus said to him, cast out, go out into the deep and launch out, right? And let down your nets for a draft of fishes. And Peter went out, he said, we've told all the night, nevertheless, that thy word will let down the net, singular. And he goes out and they have a great draft of fishes. I mean, it's a great miracle of the Lord. And we find that it's at that moment that Jesus says to Peter, follow me, and I will make you fishers of men. It's Peter that stood there at Caesarea Philippi when Jesus said, whom do men say that I am? And then he says, who do you say that I am? And it's Peter that stands up with the power of God. And he says, thou art the Christ, the son of the living God. We find that in John chapter six, when all those that were following forsook the Lord and Jesus says to the disciples, will you go also? And it's Peter that stands and says, Lord, we know that you are the Christ. You have the words of eternal life. Where are we gonna go? And it's Peter that on the night before Jesus was crucified, that Jesus tells Peter that he's going to deny him. And it's Peter that says in Matthew 26 and verse 33, he answered and said to Jesus, though all men shall be offended because of thee, yet will I never be offended. And we know that over the course of the next several verses of Matthew 26, that much transpires. And eventually we read how Peter denied the Lord thrice. We read at the end of the chapter, how that the Lord and Peter, their eyes met. And the Bible says that he went out and he wept bitterly. Because he recognized what had happened in his life. And I think is looking at this passage of scripture this evening and dealing with the subject of loving God with all of our hearts. It's this Peter. See what happens sometimes in our life is we kind of get like Peter in Matthew 26 and 33 and say, not me. It's not gonna happen to me. I mean, I'm never gonna not love you like I should. I'm never gonna be guilty of what the church of Ephesus was guilty of leaving their first love. No, not me. Peter said, Lord, I'm not gonna do that. I'll never deny you. I'll never be offended. I'll go with you unto the death. And I think he meant well, I think he was sincere in what he was saying. But we have an enemy. Remember what Jesus said in Luke? He's desired to sift you as wheat. As I look at this passage of scripture this evening, and I deal with this subject matter of loving God with all of our hearts, I want you to consider a few thoughts from these few verses of scripture. Number one, when we talk about this interaction, I want you to note that this interaction was personal. This interaction was personal. Go back to the beginning of John 21. It might be on the same page for you. But we find that according to the opening statements of John chapter 21. Now remember in John 20, that's the truth of the resurrection, right? That's when they saw the resurrected Christ. And Thomas wasn't there the first week. And then Thomas was where he was supposed to be. And he saw Christ. And we come to chapter 21. And the Bible says, after these things, Jesus showed himself again to the disciples at the Sea of Tiberias. That's the Sea of Galilee. And on this Y showed he himself. Notice verse two, there were together Simon Peter and Thomas called Didymus, and Nathanael of Cana in Galilee, and the two sons of Zebedee, and two other of his disciples. So there are seven disciples, according to verse number two, that are there. The Bible tells us in verse number three, that Simon, notice it says, Simon Peter said unto them, I go a fishing. They say unto him, we also go with thee. They went forth and entered into a ship immediately. And that night they caught nothing. But I want you to notice what happens over the next few verses. I'm not gonna read all of them I'm gonna pick through notice in verse number five when Jesus shows up. It was morning according to verse number four He stood on the shore The disciples knew not that it was Jesus, but notice in verse 5. It says then Jesus saith unto what does it say? them notice with me in verse number 10 Jesus saith unto them Notice in verse number 12 Jesus saith unto Them is them singular or plural Amen, we're tracking. Amen English class tonight. It's plural He said unto them according to verse number two There were seven disciples Peter looks at them and says I go a fishing according to verse number three and they Plural say we're going with you and we find that when Jesus shows up when he's on the shore They knew not that it was Jesus He said unto them and he's addressing them as a group the seven of them But I said to you that the interaction was personal because notice in verse 15 So when they plural the whole of the group had dined Jesus saith to Simon Peter We must recognize tonight that our God is a personal God He cares about us individually, I'm so thankful tonight that our God loves the whole world Amen for God so loved the world praise the Lord for that His love is global it's to all people But his love is personal. He loves us as individuals He's concerned about you and he's concerned about me as individuals and we find that as those Disciples were there, by the way So often as you read the Gospels you can read how the Lord Jesus Christ in the midst of great multitudes of people He singles out individuals and he ministers to individuals There was a great host in a certain leper and we see that repeatedly how Jesus ministers to individuals and we find that he said unto them he said unto them, but then he says Simon son of Jonas Simon son of Jonas Lovest thou me More than these we find that Jesus saith to Simon Peter according to verse number 15 According to verse number 16 Jesus saith to Peter again and according to verse number 17 He Jesus saith to him Peter the third time Our God is a personal God in this interaction that we read here is a personal interaction and I'm thankful this evening that though as we look at the letter to the Church of Ephesus in Revelation chapter 2 and we begin reading those letters to the seven churches that yes God is addressing the church at Ephesus the Church of Ephesus but remember a church is made up of individual believers and So when God is saying to the Church of Ephesus that you've left your first love he's speaking about Individual believers within the congregation that had left their first love And when you receive that letter of correction when you receive that word that Christ gave to the church It requires a time of pause and examination and being able to evaluate our lives and determine Have I personally left my first love and I'm thankful here as we have this account in John 21 That Jesus came to Peter personally And we must understand tonight that you are an individual that God loves That he desires to have fellowship with you you say me yes, he loves you He wants to have fellowship with you He desires that you would be in his presence that you would long to have he's not gonna force you He's not gonna make you but as his child he wants you to have that fellowship Draw and die unto God Amen We have a privilege to do that to enter into his presence To come boldly into the throne of grace to understand that he loves us as individuals so often We speak about the need for revival in our nation and we do we need revival, but you know how revival starts starts with an individual Revival starts with if you read and you study of of great movements of God of revivals of old you find regularly and consistently as you study the revivals of old how they started with just a an Individual a couple of folks that gathered together that desired for God to use them into work Why because our God is a personal God You know, there's a lot of world Religions that don't have the truth that we have with regard to the fact that our God is a personal God I'm thankful that I can commune with him That I can know him Paul says that I may know him and that awesome He's a personal God the interaction here in John chapter 21, though There were others that were gathered. It wasn't only Peter that went fishing There were others that were there and we find that Jesus was personal the interaction was personal number two tonight Not only was the interaction personal, but I want you to see the interaction was purposed. Can I tell you this evening? that our God always always moves with purpose There is a purpose to everything our God does we may not know it at the time We may not understand it maybe for this lifetime But we can rest assured in knowing that God has a purpose And we find that as we rest in that truth that God has a purpose we find in this interaction this evening This interaction that was personal was also purpose that Jesus was moving with purpose And we find that he comes to Simon and notice with me at least a first aspect of this purposed Interaction that Christ had with Peter one of the purposes was that of examination Notice what he says in verse number 15 Simon son of Jonas Lovest thou me more than these Now there's a couple of different ideas that people have had through the centuries of what did Christ mean when he said more than these? And there are some that have the idea Do you love me more than the other? Disciples than these others that are here and remember as I quoted earlier from Matthew 26 in verse 33 When he said this that that all men shall be offended because of thee though all men shall be offended because of thee yet will I never be offended and Certainly, it could be that Jesus was asking the question Love is now me more than these speaking of the other disciples We find also that it's possible. Remember a few verses back that when Peter got there that he was pulling those Dragging the net according to the end of verse number eight and it tells us as soon verse number nine as they came To land they saw a fire of coals there and fish laid there on and bread and it says in verse number 11 Simon Peter went up and drew the net to land full of great fishes and 150 and three and for all there were so many yet was not the net broken now, I don't know of the 153 here that's mentioned. There's no other place that God tells us a number of fish that they caught We find that yes He says they caught nothing so we could say zero in verse number three But as far as actually numbering the the number of fish that they caught here 153 I believe there's something significant about that and I believe that as that idea that I go a Fishing in verse number three remember he was a fisherman and that was the dad's business and that was kind of going back to that Jesus said follow me and I'll make you fishers of men And so we find that when he says love is now me more than these certainly it could be the other disciples that were there But also maybe the things of the world the fish Do you love me more than these? See here's the reality There are things in this world that are pulling for your love for your affection Why does God say John says in first John to love not the world? Neither the things that are in the world, right? We sing the song rarely We play it more for an invitation turn your eyes upon Jesus and the things of this world will grow strangely dim But we find that there are many listen we see I mentioned last week We'll study it next Sunday morning be part of the message where the Bible tells us of Demas that hath forsaken me having Loved this present world We find this evening That this interaction was purposed and one of the purposes must have been for examination For Peter to examine his own heart Can I tell you this evening that this self-examination that we read of that Peter would have to go through that? I believe tonight the Church of Ephesus when they receive that letter of correction They would have had to pause and examine this truth where Jesus God and flesh the one that cannot lie He's the resurrected Savior at that point. He says you've left your first love You can't argue with God, I mean you could try but you lose every time Remember what Gamaliel said when they wanted to fight against the disciples. Hey, listen if this thing be a of men, it's just going to kind of fizzle out, but if it be of God, then you're really wasting your time because you're going to fight against God. Tonight, just as the church of Ephesus when they received that letter and just as Peter here in John 21, I would say for us this evening it's a process of examination. The Bible tells us in 1 Corinthians 11 we observe the Lord's Supper, but let a man examine himself. Can I tell you this evening, it's a difficult process. I look at Peter here and Jesus says, Peter, do you love me? In verse 15, lovest thou me more than these, and he saith unto him, yea, Lord, thou knowest that I love thee. He saith unto him, feed my lambs, but then he asks again in verse 16 and then a third time in verse 17. That process of examination, you know your heart is deceitful and so is mine. According to Jeremiah 17, our hearts are deceitful, they're desperately wicked. The process of examination, the process of self-examination is a difficult process but it is absolutely necessary for every child of God to get alone with God and to go through that process of self-examination and before we ever say as the psalmist did in Psalm 139, search me O God, we must first examine our own hearts and our own lives. No doubt in my mind, listen again as I mentioned by way of introduction, if the church, if the believers in the first century of the church of Ephesus were guilty of leaving their first love, I do not for one moment of time think that every other generation of believers have been innocent of that particular thing. I think there are many that have been guilty of leaving their first love. So I believe tonight that one purpose that the Lord had for this interaction, again he always moves with purpose, when Peter says, I go fishing, God knew where he was. Aren't you thankful God knows where you are? Listen, you can have, the devil is relentless. Not one of us tonight are immune from his attack, not one of us tonight are going to go through life without having the accuser of the brethren try to trip us and discourage us and defeat us but greater is he that is in me than he that is in the world. But I want you to know that there are some times in life that we get overloaded, we can get bogged down and we can say, as Peter said, I'm going fishing. But Jesus knows where you are. He knows where you are and he loves you and he pursues you as a personal God, as an individual and then he has purpose. He wants us to examine ourselves. Not only the purpose of examination but I believe in a very real sense there's a purpose here of restoration. I'm thankful that our God is a restoring God. I'm thankful tonight that our God is a God of second and third and you fill in the blank number of chances. Aren't you thankful for that? Again on Sunday morning we'll deal not only with Demas but you think about Mark and he says, send them to me. Why? For he's profitable to me for the ministry. Ah, what a great statement, what a great truth. And here we find that our God is a restoring God. He restoreth my soul is what the psalmist says in Psalm 23. We find that this truth of restoration, see Peter had denied the Lord three times but now he publicly confesses his love for the Lord three times. I know that there's much debate and there's much depth with regard to digging into the use of the words and so on and so forth and the Greek word for love and there are multiple of them and so on and so forth but the reality is that Jesus was purposed to ask him the question three times and to be able to have Peter who had denied the Lord thrice to now publicly confess his love for Christ on three occasions. Back in Matthew 26 I've referenced verse 33 a couple of times but I want you to look at a few other verses in Matthew 26 beginning in verse 31. We'll look at more of the interaction that Jesus had with Peter before he made that quoted statement that I made earlier. But notice in verse 31 of Matthew chapter 26 the Bible says this, then saith Jesus unto them, all ye shall be offended because of me this night for it is written I will smite the shepherd and the sheep of the flock shall be scattered abroad. But after I am risen again, by the way aren't you thankful that we serve a risen savior? He says but after I am risen again I will go before you into Galilee. Peter answered and said unto him though all men shall be offended because of thee yet will I never be offended. Jesus said unto him verily I say unto thee that this night before the cock crow thou shalt deny me thrice. Peter said unto him though I should die with thee yet will I not deny thee. Likewise also said all the disciples. I think Peter believed what he said. I don't think Peter thought he would actually deny the Lord. But as you look through the chapter and I mentioned it earlier tonight but look at verse 69 the Bible says now Peter sat without in the palace and a damsel came unto him saying thou also wast with Jesus of Galilee. Verse 70 is the first of the three denials. But he denied before them all saying I know not what thou sayest. When he was gone out into the porch another maid saw him and said unto them that were there this fellow also was with Jesus of Nazareth. And again the second denial in verse 72 he denied with an oath I do not know the man. After a while came unto him they that stood by and said to Peter surely thou also art one of them for thy speech bereath thee. Then verse 74 is the third denial he began then began he to curse and to swear saying I know not the man. And immediately the cock crew. Peter remembered the word of Jesus which said unto him before the cock crow thou shalt deny me thrice and he went out and he wept bitterly. I can't imagine all that Peter experienced in this few moments of time. I can't imagine the emotions and all that had transpired the fear that he had because of what was taking place the uncertainty and all of the different emotions that we could mention this evening. But we know that that his heart was broken in verse number 75. And we find that we have a gracious God that that when we think listen there are times in which we could look at our lives and say man I really messed up I really wouldn't listen. Our God is a God of restoration. He's a restoring God. And Jesus comes to Peter. He says Peter do you love me? Three times. And I think it's significant as we look at the not only personal interaction but the purposed interaction that it was for a process of examination but also for a time of restoration. I think tonight that as I look at Peter in John chapter 21 it must have been so encouraging for the Lord to have this conversation with him. Yes it was difficult. He says he was grieved in verse 17. But I believe that later on in life when Peter would look back at this moment at this event it probably brought him great peace and joy to understand that Jesus met with him there on the shore of Galilee and had this interaction with him. This evening not only was it personal and purposed but number three the interaction was productive. It was productive. Can I tell you this evening that when we look at God's word and we think about the truth of God's word and how it effectually worketh in us that believe and understanding this evening the power of God's word and we look at this interaction and we find that it produced something. We think about the word of God being profitable and we think about the truth of how God's word will work in the hearts of his people and remember even as we looked a couple of weeks ago at Revelation chapter 2 as that truth is given to the believers there at the church of Ephesus when he says nevertheless I have somewhat against thee because thou hast left thy first love. So what does he do? He gives them counsel. He says remember therefore from whence thou art fallen and repent. He gives them the corrective measure and do the first works or else I will come unto thee quickly and will remove thy candlestick out of his place except thou repent and so they had a choice to make. This evening when we look at this interaction that Peter had with Jesus it was productive because of the way that Peter responded to the interaction. See we can go through the motions. We can take the step of saying well I went and got some counsel but even as brother McKinney said this. this morning, getting counsel isn't the same as taking heed to counsel, to doing, to applying the truth of God's Word. So I believe in this passage of Scripture, the reason that I would say that it was a productive interaction is because Peter learned the importance of loving his Savior. He learned just how important it was that he loved Jesus with all of his heart. We learned this evening as we examined the passage of Scripture that it's really your heart that God wants. He wants your heart. And I believe tonight, even as I said two weeks ago, if God truly has our heart, He really has all of us. When God has our heart, when He's Lord and He's Savior and He's King of your life and He's King of my life and He has my heart, then we can sing the songs that we sing and we can sing them with great truth and transparency, I'll go where you want me to go, I'll do what you want me to do. Why? Because He has my heart and I'll do whatever He wants me to do. I mentioned several weeks ago about an interview that a fellow on the Christian radio station was having and I just caught just a few moments of this interaction and the man, Alex McFarland, is very well known. He preaches all over the country and I don't know all of his positions. I don't endorse him wholly just because I mentioned his name. But I do say this, that I've heard him say some good things and one thing that he said in that interview is he said, I found myself as a new believer just praising God and rejoicing that I could clean the bathrooms at my church. Why? Because he just loved Jesus and he was willing to do whatever because God had his heart. You know why God had his heart? Because he understood that he was without Christ and then he got saved. We mentioned that a little bit in Sunday School this morning as Brother McKinney took us over to Ephesians chapter number 2. Listen, there was a time that we were without Christ, but aren't you thankful that now, Oh, hallelujah, for his great mercy and his great love. We find this evening that Peter learned the truth and the importance of loving his Savior and he understood how much his Savior loved him and he wants to love him with all his heart. Not only did Peter understand the importance of loving Christ, but I believe that Peter understood what the Lord expected of him. Notice in verse 15, he says, feed my lambs and verse number 16 and 17, he says, feed my sheep. And then we find in verse 19, he says, follow me. Follow me. Listen, if we understand this evening the importance and we truly love God with all of our hearts, we'll do what he calls us to do, we'll live for him, we'll serve him, we'll keep his commandments and his commandments will not be grievous. Why? Because he has my heart. You know, I love my wife and I love my children. You know, when Holly asks me to help her with something, I'm delighted to be able to do it. Why? Because I love her. Because I love her. I don't like, how many of you like painting? Some of you. You're crazy. I don't like painting. I don't. But you know what I did a couple of weeks ago? I did some painting. Why? Because Holly wanted to do some painting. I did some painting. You know what? It was enjoyable, actually. And it's one of those things, listen, when I get to serve God, when I love him and I'm doing it out of love, it's not that I have to do these things. It's not that, oh, no. I delight in doing it. Why? Because I love him. And I know that I love him because he first loved me. But what happens sometimes is we start getting things out of order, and we start doing as the church of Ephesus was doing, and we're doing all these things, but we're not doing it from a heart of love, the motive. And the reality this evening is that Peter learned that Jesus was to be loved with all of his heart, and that he had to do the will of God in his life to minister to those that God would call him to minister to, to follow Jesus wherever Jesus would lead him to go. You know, tonight, if we love Jesus the way that we should, then we, too, would be in the same position. Lord, I'll do what you want me to do. I'll go where you want me to go because I love you. Go over to the book of Isaiah, if you will, Isaiah chapter 1. Give you a few thoughts tonight from Isaiah and Jeremiah very quickly. There's a problem in the day of Hosea, in chapter 10 of Hosea, the Bible says they had a divided heart. You know, we've got to be careful. We can't have a divided heart. We can't serve God and mammon. That's what Jesus said. Isaiah chapter number 1, we find that verse number 11, notice what the Bible says in Isaiah 1 and 11, to what purpose is the multitude of your sacrifices unto me, saith the Lord? I am full of the burnt offerings of rams and the fat of red fed beasts, and I delight not in the blood of bullocks or of lambs or of he goats. When you come to appear before me, who hath required this at your hand to tread my courts? Bring no more, notice what it says, vain oblations, incenses and abomination unto me, the new moons and Sabbaths, the calling of assemblies I cannot away with. It is iniquity, even the solemn meeting, your new moons and your appointed feasts my soul hateth. They are a trouble unto me, I am weary to bear them. And when you spread forth your hands, I will hide mine eyes from you, yea, when you make many prayers, I will not hear. Your hands are full of blood, wash you, make you clean, put away the evil of your doings from before mine eyes, cease to do evil. Understand that as we look at this passage of scripture, that they were bringing offerings, they were, where did they get the idea of bringing offerings? Well, they were doing what God had commanded them to do back in Leviticus. But you know what was missing? Their heart. Their heart. God says, why are you bringing me these things? Notice in Isaiah chapter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse that would be quoted later in the Gospels, the Bible says this in verse 13, wherefore the Lord said, forasmuch as this people draw near me with their mouth and with their lips do honor me, but notice, but have removed their heart far from me. And their fear toward me is taught by the precept of men. God says with their mouth, they draw near me with their mouth, and with their lips they do honor me. But there's a problem because their heart, their heart has been removed. In Jeremiah chapter 4 and verse number 4, notice what the prophet says with regard to the subject of our heart tonight. In verse number 3, I'll read with it. In Jeremiah chapter 4 and verse number 3, it says, for thus saith the Lord to the men of Judah and Jerusalem, break up your fallow ground and sow not among thorns, circumcise yourselves to the Lord. Notice what he says, and take away the foreskins of your heart, ye men of Judah and inhabitants of Jerusalem, lest my fury come forth like fire and burn that none can quench it because of the evil of your doings. Again in chapter 29, Jeremiah 29 and verse 13, the Bible says this with regard to this truth with regard to our hearts. In Jeremiah 29 and verse 13, you shall seek me and find me, notice when you shall search for me with what, all your heart. You know, God doesn't want half-hearted Christianity, He doesn't want us to have a divided heart. He wants us to have a heart for Him. He wants us to love Him with all of our heart. This evening as I consider the thought from Revelation chapter 2, I just couldn't get away from it. Because I believe tonight that every single one of us, let him that thinketh he stand take heed lest he fall, that's Bible, right, that's what it says. Every one of us tonight have an enemy. And I hope tonight that we could each stand and say, I love God with all my heart. But I understand just as Peter stood and said, Lord, I'll never deny you, that we have an enemy and he's relentless and he's ruthless. And he wants to, he wants to divide your heart and my heart. He wants to cause us to just go through the motions and just kind of half-hearted, just kind of do what we know we're supposed to do without the heart. But God says, I want your heart. I want your heart. Tonight, just as the church of Ephesus and just as Peter needed to have this personal interaction that would cause some examination, say, Lord, I don't want to be guilty of leaving my first love. Lord, I want to keep my heart where it ought to be. Keep thy heart with all diligence, for out of it are the issues of life. Guard my heart, keep it. Be aware of the external attacks so that we could not be guilty, as those believers in the first century were, of leaving their first love. It's personal, it's individual. What does God have for each of us? If you say tonight, I love God with all my heart, I say praise the Lord. But can I tell you tonight, protect it. Protect it. Be careful. You have an enemy. We need to keep on loving God with all of our heart. Let's pray. Father, we love you. We thank you for loving us. We know that we only love you because you first loved us. God, I think about this correction to the church of Ephesus and coupled with this interaction that our resurrected Savior had with Peter. God, it brings me to a place of self-examination. I pray tonight that it would help all of us, Lord, to pause and truly examine our hearts. That we'd love you like we should. We'd love you with all of our hearts. I pray that as we have this moment of invitation, I pray, God, that you'd have your will in a way, move and work as only you can, and we'll thank you for it. In Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.799999952316284,
      "text": " this evening, John chapter 21."
    },
    {
      "id": 1,
      "start": 2.799999952316284,
      "end": 5.400000095367432,
      "text": " You say, pastor, I thought we were in the book of Revelation."
    },
    {
      "id": 2,
      "start": 5.400000095367432,
      "end": 7.28000020980835,
      "text": " Well, we were and we are."
    },
    {
      "id": 3,
      "start": 7.28000020980835,
      "end": 10.359999656677246,
      "text": " And I'll remind you the last study last Sunday night"
    },
    {
      "id": 4,
      "start": 10.359999656677246,
      "end": 11.5600004196167,
      "text": " was the teen takeover."
    },
    {
      "id": 5,
      "start": 11.5600004196167,
      "end": 13.960000038146973,
      "text": " But the week before, we finished up"
    },
    {
      "id": 6,
      "start": 13.960000038146973,
      "end": 17.520000457763672,
      "text": " looking at the letter to the church of Ephesus."
    },
    {
      "id": 7,
      "start": 17.520000457763672,
      "end": 20.040000915527344,
      "text": " We dealt with the church in Ephesus."
    },
    {
      "id": 8,
      "start": 20.040000915527344,
      "end": 23.0,
      "text": " And we found, as we studied the last two weeks ago,"
    },
    {
      "id": 9,
      "start": 23.0,
      "end": 25.719999313354492,
      "text": " that the Lord corrected the believers in Ephesus"
    },
    {
      "id": 10,
      "start": 25.760000228881836,
      "end": 30.600000381469727,
      "text": " for this reason, because they left their first love."
    },
    {
      "id": 11,
      "start": 30.600000381469727,
      "end": 33.560001373291016,
      "text": " The Lord said, nevertheless, I am somewhat against thee."
    },
    {
      "id": 12,
      "start": 33.560001373291016,
      "end": 36.08000183105469,
      "text": " And we find that as we begin reading that correction"
    },
    {
      "id": 13,
      "start": 36.08000183105469,
      "end": 39.119998931884766,
      "text": " to the church at Ephesus and the instruction"
    },
    {
      "id": 14,
      "start": 39.119998931884766,
      "end": 42.2400016784668,
      "text": " for what they were to do and how they were to respond"
    },
    {
      "id": 15,
      "start": 42.2400016784668,
      "end": 45.560001373291016,
      "text": " in dealing with that, I wonder this evening,"
    },
    {
      "id": 16,
      "start": 45.560001373291016,
      "end": 49.20000076293945,
      "text": " if it was true of the believers in Ephesus"
    },
    {
      "id": 17,
      "start": 49.20000076293945,
      "end": 52.400001525878906,
      "text": " that they had left their first love in the first century,"
    },
    {
      "id": 18,
      "start": 52.400001525878906,
      "end": 55.2400016784668,
      "text": " if it was true of them, and if Jesus said it,"
    },
    {
      "id": 19,
      "start": 55.2400016784668,
      "end": 59.79999923706055,
      "text": " then it was true, amen, I wonder this evening,"
    },
    {
      "id": 20,
      "start": 59.79999923706055,
      "end": 63.29999923706055,
      "text": " how many other believers are guilty"
    },
    {
      "id": 21,
      "start": 63.29999923706055,
      "end": 68.30000305175781,
      "text": " of leaving their first love over the last 20 centuries?"
    },
    {
      "id": 22,
      "start": 69.91999816894531,
      "end": 72.37999725341797,
      "text": " I don't know the number, you don't know the number,"
    },
    {
      "id": 23,
      "start": 72.37999725341797,
      "end": 75.80000305175781,
      "text": " but we know that God is aware of how many"
    },
    {
      "id": 24,
      "start": 75.80000305175781,
      "end": 80.0,
      "text": " he would say to as he did to the church of Ephesus,"
    },
    {
      "id": 25,
      "start": 80.0,
      "end": 81.83999633789062,
      "text": " you've left your first love."
    },
    {
      "id": 26,
      "start": 81.83999633789062,
      "end": 83.5999984741211,
      "text": " I believe that the Lord knows and I believe"
    },
    {
      "id": 27,
      "start": 83.5999984741211,
      "end": 86.72000122070312,
      "text": " that the Lord is faithful to use his word"
    },
    {
      "id": 28,
      "start": 86.72000122070312,
      "end": 89.83999633789062,
      "text": " to bring conviction to the heart of the individual"
    },
    {
      "id": 29,
      "start": 89.83999633789062,
      "end": 93.5199966430664,
      "text": " that would be guilty of leaving their first love."
    },
    {
      "id": 30,
      "start": 93.5199966430664,
      "end": 95.54000091552734,
      "text": " I'm reminded at the end of the letter"
    },
    {
      "id": 31,
      "start": 95.54000091552734,
      "end": 98.58000183105469,
      "text": " to the church of Ephesus and to each of the churches,"
    },
    {
      "id": 32,
      "start": 98.58000183105469,
      "end": 102.4000015258789,
      "text": " we find these words, he that hath an ear,"
    },
    {
      "id": 33,
      "start": 102.4000015258789,
      "end": 107.36000061035156,
      "text": " let him hear what the Spirit saith unto the churches."
    },
    {
      "id": 34,
      "start": 107.36000061035156,
      "end": 110.5999984741211,
      "text": " We find that this letter must have caused"
    },
    {
      "id": 35,
      "start": 110.5999984741211,
      "end": 115.5999984741211,
      "text": " the believers in Ephesus to pause, to examine,"
    },
    {
      "id": 36,
      "start": 117.23999786376953,
      "end": 121.08000183105469,
      "text": " to be able to have that process of answering the question,"
    },
    {
      "id": 37,
      "start": 121.08000183105469,
      "end": 123.5199966430664,
      "text": " do I really love God?"
    },
    {
      "id": 38,
      "start": 123.5199966430664,
      "end": 127.04000091552734,
      "text": " Do I love God with all my heart?"
    },
    {
      "id": 39,
      "start": 127.04000091552734,
      "end": 129.47999572753906,
      "text": " Remember what the Bible says there in John 21,"
    },
    {
      "id": 40,
      "start": 129.47999572753906,
      "end": 130.44000244140625,
      "text": " we'll be there in just a moment,"
    },
    {
      "id": 41,
      "start": 130.44000244140625,
      "end": 132.36000061035156,
      "text": " but let me read to you a couple of verses"
    },
    {
      "id": 42,
      "start": 132.36000061035156,
      "end": 135.0800018310547,
      "text": " in the book of Deuteronomy in chapter six"
    },
    {
      "id": 43,
      "start": 135.0800018310547,
      "end": 137.36000061035156,
      "text": " in verse number five, the Bible says this,"
    },
    {
      "id": 44,
      "start": 137.36000061035156,
      "end": 141.39999389648438,
      "text": " and thou shalt love the Lord thy God with all thine heart,"
    },
    {
      "id": 45,
      "start": 141.39999389648438,
      "end": 145.36000061035156,
      "text": " with all thy soul and with all thy might."
    },
    {
      "id": 46,
      "start": 145.36000061035156,
      "end": 147.83999633789062,
      "text": " We find a few chapters later in Deuteronomy 10"
    },
    {
      "id": 47,
      "start": 147.83999633789062,
      "end": 150.1199951171875,
      "text": " in verse number 12, the Bible says this,"
    },
    {
      "id": 48,
      "start": 150.1199951171875,
      "end": 154.72000122070312,
      "text": " and now Israel, what doth the Lord thy God require of thee,"
    },
    {
      "id": 49,
      "start": 154.72000122070312,
      "end": 157.8000030517578,
      "text": " but to fear the Lord thy God, to walk in all his ways"
    },
    {
      "id": 50,
      "start": 157.8000030517578,
      "end": 160.74000549316406,
      "text": " and to love him and to serve the Lord thy God"
    },
    {
      "id": 51,
      "start": 160.74000549316406,
      "end": 164.32000732421875,
      "text": " with all thy heart and with all thy soul."
    },
    {
      "id": 52,
      "start": 165.32000732421875,
      "end": 168.8800048828125,
      "text": " So we begin to think about this subject matter this evening,"
    },
    {
      "id": 53,
      "start": 168.8800048828125,
      "end": 171.67999267578125,
      "text": " I wanna preach a message that I've simply entitled,"
    },
    {
      "id": 54,
      "start": 171.67999267578125,
      "end": 175.0,
      "text": " loving God with all your heart."
    },
    {
      "id": 55,
      "start": 175.0,
      "end": 177.44000244140625,
      "text": " Loving God with all your heart."
    },
    {
      "id": 56,
      "start": 177.44000244140625,
      "end": 179.67999267578125,
      "text": " I've invited you to turn to John 21,"
    },
    {
      "id": 57,
      "start": 179.67999267578125,
      "end": 181.77999877929688,
      "text": " because I wanna review this evening,"
    },
    {
      "id": 58,
      "start": 181.77999877929688,
      "end": 185.83999633789062,
      "text": " the interaction that God gives us in John chapter 21"
    },
    {
      "id": 59,
      "start": 185.83999633789062,
      "end": 187.9600067138672,
      "text": " between the Lord Jesus Christ,"
    },
    {
      "id": 60,
      "start": 187.9600067138672,
      "end": 191.5800018310547,
      "text": " our resurrected Savior with Peter."
    },
    {
      "id": 61,
      "start": 192.4199981689453,
      "end": 195.4600067138672,
      "text": " And in John 21, beginning in verse number 15,"
    },
    {
      "id": 62,
      "start": 195.4600067138672,
      "end": 196.66000366210938,
      "text": " notice what the Bible says,"
    },
    {
      "id": 63,
      "start": 196.66000366210938,
      "end": 199.4199981689453,
      "text": " I'll read verse 15 down through verse number 19,"
    },
    {
      "id": 64,
      "start": 199.4199981689453,
      "end": 202.3000030517578,
      "text": " and then we'll get into the message this evening."
    },
    {
      "id": 65,
      "start": 202.3000030517578,
      "end": 203.66000366210938,
      "text": " In verse 15, the Bible says,"
    },
    {
      "id": 66,
      "start": 203.66000366210938,
      "end": 208.66000366210938,
      "text": " so when they had dined, Jesus saith to Simon Peter,"
    },
    {
      "id": 67,
      "start": 209.05999755859375,
      "end": 214.05999755859375,
      "text": " Simon, son of Jonas, lovest thou me more than these?"
    },
    {
      "id": 68,
      "start": 217.47999572753906,
      "end": 220.44000244140625,
      "text": " He saith unto him, yea, Lord,"
    },
    {
      "id": 69,
      "start": 220.44000244140625,
      "end": 223.0399932861328,
      "text": " thou knowest that I love thee."
    },
    {
      "id": 70,
      "start": 223.0399932861328,
      "end": 225.8000030517578,
      "text": " He saith unto him, feed my lambs."
    },
    {
      "id": 71,
      "start": 225.8000030517578,
      "end": 227.63999938964844,
      "text": " He saith to him again the second time,"
    },
    {
      "id": 72,
      "start": 227.63999938964844,
      "end": 230.1199951171875,
      "text": " Simon, son of Jonas, lovest thou me?"
    },
    {
      "id": 73,
      "start": 230.1199951171875,
      "end": 232.24000549316406,
      "text": " He saith unto him, yea, Lord,"
    },
    {
      "id": 74,
      "start": 232.24000549316406,
      "end": 234.6999969482422,
      "text": " thou knowest that I love thee."
    },
    {
      "id": 75,
      "start": 234.6999969482422,
      "end": 237.67999267578125,
      "text": " He saith unto him, feed my sheep."
    },
    {
      "id": 76,
      "start": 237.67999267578125,
      "end": 241.44000244140625,
      "text": " He saith unto him, verse 17, the third time,"
    },
    {
      "id": 77,
      "start": 241.44000244140625,
      "end": 246.44000244140625,
      "text": " Simon, son of Jonas, lovest thou me?"
    },
    {
      "id": 78,
      "start": 247.72000122070312,
      "end": 249.16000366210938,
      "text": " Peter was grieved."
    },
    {
      "id": 79,
      "start": 249.16000366210938,
      "end": 252.0800018310547,
      "text": " It means to have a heavy, sorrowful, broken heart."
    },
    {
      "id": 80,
      "start": 252.0800018310547,
      "end": 255.36000061035156,
      "text": " He was grieved because he said unto him the third time,"
    },
    {
      "id": 81,
      "start": 255.36000061035156,
      "end": 256.4800109863281,
      "text": " lovest thou me?"
    },
    {
      "id": 82,
      "start": 256.4800109863281,
      "end": 260.8399963378906,
      "text": " And he said unto him, Lord, thou knowest all things."
    },
    {
      "id": 83,
      "start": 260.8399963378906,
      "end": 264.0799865722656,
      "text": " By the way, that's a convicting truth."
    },
    {
      "id": 84,
      "start": 264.0799865722656,
      "end": 266.1000061035156,
      "text": " God knows all things."
    },
    {
      "id": 85,
      "start": 266.1000061035156,
      "end": 268.32000732421875,
      "text": " We can say whatever we wanna say, but God knows."
    },
    {
      "id": 86,
      "start": 268.32000732421875,
      "end": 269.55999755859375,
      "text": " In fact, when we get to the letter"
    },
    {
      "id": 87,
      "start": 269.55999755859375,
      "end": 271.32000732421875,
      "text": " to the church of the Laodiceans,"
    },
    {
      "id": 88,
      "start": 271.32000732421875,
      "end": 273.739990234375,
      "text": " he says, you say, but here's what I say."
    },
    {
      "id": 89,
      "start": 274.7799987792969,
      "end": 277.239990234375,
      "text": " Notice, Lord, thou knowest all things."
    },
    {
      "id": 90,
      "start": 277.239990234375,
      "end": 278.7200012207031,
      "text": " Thou knowest that I love thee."
    },
    {
      "id": 91,
      "start": 278.7200012207031,
      "end": 281.3999938964844,
      "text": " Jesus saith unto him, feed my sheep."
    },
    {
      "id": 92,
      "start": 281.3999938964844,
      "end": 283.0799865722656,
      "text": " Verily, verily, I say unto thee,"
    },
    {
      "id": 93,
      "start": 283.0799865722656,
      "end": 286.239990234375,
      "text": " when thou wast young, thou girdest thyself"
    },
    {
      "id": 94,
      "start": 286.239990234375,
      "end": 288.0400085449219,
      "text": " and walkest whither thou wouldest,"
    },
    {
      "id": 95,
      "start": 288.0400085449219,
      "end": 290.1199951171875,
      "text": " but when thou shalt be old,"
    },
    {
      "id": 96,
      "start": 290.1199951171875,
      "end": 291.9599914550781,
      "text": " thou shalt stretch forth thy hands"
    },
    {
      "id": 97,
      "start": 291.9599914550781,
      "end": 293.1199951171875,
      "text": " and another shall gird thee"
    },
    {
      "id": 98,
      "start": 293.1199951171875,
      "end": 295.67999267578125,
      "text": " and carry thee whither thou wouldest not."
    },
    {
      "id": 99,
      "start": 295.67999267578125,
      "end": 298.239990234375,
      "text": " This spake he, signifying by what death"
    },
    {
      "id": 100,
      "start": 298.239990234375,
      "end": 300.4800109863281,
      "text": " he should glorify God."
    },
    {
      "id": 101,
      "start": 300.4800109863281,
      "end": 304.1199951171875,
      "text": " And who had spoken this, he saith unto him, follow me."
    },
    {
      "id": 102,
      "start": 305.2799987792969,
      "end": 307.1400146484375,
      "text": " I want you to think about this interaction,"
    },
    {
      "id": 103,
      "start": 307.94000244140625,
      "end": 311.1000061035156,
      "text": " this evening between the resurrected Christ and Peter."
    },
    {
      "id": 104,
      "start": 311.1000061035156,
      "end": 313.2200012207031,
      "text": " And I want you to just pause for a moment"
    },
    {
      "id": 105,
      "start": 313.2200012207031,
      "end": 316.29998779296875,
      "text": " and put yourself in the account"
    },
    {
      "id": 106,
      "start": 316.29998779296875,
      "end": 318.29998779296875,
      "text": " that we've read in John chapter 21."
    },
    {
      "id": 107,
      "start": 318.29998779296875,
      "end": 320.260009765625,
      "text": " And I want you to think about Peter,"
    },
    {
      "id": 108,
      "start": 320.260009765625,
      "end": 324.2200012207031,
      "text": " who Peter is and what Peter has professed"
    },
    {
      "id": 109,
      "start": 324.2200012207031,
      "end": 327.4200134277344,
      "text": " over the time that we have the opportunity"
    },
    {
      "id": 110,
      "start": 327.4200134277344,
      "end": 331.29998779296875,
      "text": " to read the gospel messages and the gospel accounts"
    },
    {
      "id": 111,
      "start": 331.29998779296875,
      "end": 334.3399963378906,
      "text": " of the life and ministry of the Lord Jesus Christ."
    },
    {
      "id": 112,
      "start": 334.3399963378906,
      "end": 336.79998779296875,
      "text": " And it's this Peter that we find"
    },
    {
      "id": 113,
      "start": 337.32000732421875,
      "end": 338.8800048828125,
      "text": " that as he was a fisherman,"
    },
    {
      "id": 114,
      "start": 338.8800048828125,
      "end": 341.760009765625,
      "text": " that Jesus said to him, cast out,"
    },
    {
      "id": 115,
      "start": 341.760009765625,
      "end": 345.0,
      "text": " go out into the deep and launch out, right?"
    },
    {
      "id": 116,
      "start": 345.0,
      "end": 348.2799987792969,
      "text": " And let down your nets for a draft of fishes."
    },
    {
      "id": 117,
      "start": 348.2799987792969,
      "end": 350.9599914550781,
      "text": " And Peter went out, he said,"
    },
    {
      "id": 118,
      "start": 350.9599914550781,
      "end": 352.8800048828125,
      "text": " we've told all the night, nevertheless,"
    },
    {
      "id": 119,
      "start": 352.8800048828125,
      "end": 355.67999267578125,
      "text": " that thy word will let down the net, singular."
    },
    {
      "id": 120,
      "start": 355.67999267578125,
      "end": 358.44000244140625,
      "text": " And he goes out and they have a great draft of fishes."
    },
    {
      "id": 121,
      "start": 358.44000244140625,
      "end": 361.2799987792969,
      "text": " I mean, it's a great miracle of the Lord."
    },
    {
      "id": 122,
      "start": 361.2799987792969,
      "end": 363.32000732421875,
      "text": " And we find that it's at that moment"
    },
    {
      "id": 123,
      "start": 363.32000732421875,
      "end": 366.2799987792969,
      "text": " that Jesus says to Peter, follow me,"
    },
    {
      "id": 124,
      "start": 366.2799987792969,
      "end": 368.1199951171875,
      "text": " and I will make you fishers of men."
    },
    {
      "id": 125,
      "start": 369.20001220703125,
      "end": 371.9200134277344,
      "text": " It's Peter that stood there at Caesarea Philippi"
    },
    {
      "id": 126,
      "start": 371.9200134277344,
      "end": 375.3999938964844,
      "text": " when Jesus said, whom do men say that I am?"
    },
    {
      "id": 127,
      "start": 375.3999938964844,
      "end": 378.2799987792969,
      "text": " And then he says, who do you say that I am?"
    },
    {
      "id": 128,
      "start": 378.2799987792969,
      "end": 382.3999938964844,
      "text": " And it's Peter that stands up with the power of God."
    },
    {
      "id": 129,
      "start": 382.3999938964844,
      "end": 385.5199890136719,
      "text": " And he says, thou art the Christ,"
    },
    {
      "id": 130,
      "start": 385.5199890136719,
      "end": 387.7200012207031,
      "text": " the son of the living God."
    },
    {
      "id": 131,
      "start": 387.7200012207031,
      "end": 389.5199890136719,
      "text": " We find that in John chapter six,"
    },
    {
      "id": 132,
      "start": 389.5199890136719,
      "end": 392.7200012207031,
      "text": " when all those that were following forsook the Lord"
    },
    {
      "id": 133,
      "start": 392.7200012207031,
      "end": 394.8399963378906,
      "text": " and Jesus says to the disciples,"
    },
    {
      "id": 134,
      "start": 394.8399963378906,
      "end": 396.0400085449219,
      "text": " will you go also?"
    },
    {
      "id": 135,
      "start": 396.0400085449219,
      "end": 398.5199890136719,
      "text": " And it's Peter that stands and says,"
    },
    {
      "id": 136,
      "start": 398.5199890136719,
      "end": 402.3599853515625,
      "text": " Lord, we know that you are the Christ."
    },
    {
      "id": 137,
      "start": 402.3599853515625,
      "end": 405.0400085449219,
      "text": " You have the words of eternal life."
    },
    {
      "id": 138,
      "start": 405.0400085449219,
      "end": 407.1199951171875,
      "text": " Where are we gonna go?"
    },
    {
      "id": 139,
      "start": 409.32000732421875,
      "end": 414.32000732421875,
      "text": " And it's Peter that on the night before Jesus was crucified,"
    },
    {
      "id": 140,
      "start": 415.9599914550781,
      "end": 419.760009765625,
      "text": " that Jesus tells Peter that he's going to deny him."
    },
    {
      "id": 141,
      "start": 420.9599914550781,
      "end": 424.6000061035156,
      "text": " And it's Peter that says in Matthew 26 and verse 33,"
    },
    {
      "id": 142,
      "start": 425.3599853515625,
      "end": 426.3999938964844,
      "text": " he answered and said to Jesus,"
    },
    {
      "id": 143,
      "start": 426.3999938964844,
      "end": 429.1600036621094,
      "text": " though all men shall be offended because of thee,"
    },
    {
      "id": 144,
      "start": 429.1600036621094,
      "end": 432.67999267578125,
      "text": " yet will I never be offended."
    },
    {
      "id": 145,
      "start": 433.9599914550781,
      "end": 437.2799987792969,
      "text": " And we know that over the course of the next several verses"
    },
    {
      "id": 146,
      "start": 437.2799987792969,
      "end": 441.760009765625,
      "text": " of Matthew 26, that much transpires."
    },
    {
      "id": 147,
      "start": 442.6400146484375,
      "end": 446.79998779296875,
      "text": " And eventually we read how Peter denied the Lord thrice."
    },
    {
      "id": 148,
      "start": 448.1600036621094,
      "end": 450.1199951171875,
      "text": " We read at the end of the chapter,"
    },
    {
      "id": 149,
      "start": 450.1199951171875,
      "end": 454.9599914550781,
      "text": " how that the Lord and Peter, their eyes met."
    },
    {
      "id": 150,
      "start": 454.9599914550781,
      "end": 457.79998779296875,
      "text": " And the Bible says that he went out and he wept bitterly."
    },
    {
      "id": 151,
      "start": 458.8800048828125,
      "end": 462.5199890136719,
      "text": " Because he recognized what had happened in his life."
    },
    {
      "id": 152,
      "start": 462.5199890136719,
      "end": 465.32000732421875,
      "text": " And I think is looking at this passage of scripture"
    },
    {
      "id": 153,
      "start": 465.32000732421875,
      "end": 467.9200134277344,
      "text": " this evening and dealing with the subject"
    },
    {
      "id": 154,
      "start": 467.9200134277344,
      "end": 471.0400085449219,
      "text": " of loving God with all of our hearts."
    },
    {
      "id": 155,
      "start": 472.1199951171875,
      "end": 473.1199951171875,
      "text": " It's this Peter."
    },
    {
      "id": 156,
      "start": 473.1199951171875,
      "end": 475.0799865722656,
      "text": " See what happens sometimes in our life"
    },
    {
      "id": 157,
      "start": 475.0799865722656,
      "end": 477.8800048828125,
      "text": " is we kind of get like Peter in Matthew 26 and 33"
    },
    {
      "id": 158,
      "start": 477.8800048828125,
      "end": 479.6400146484375,
      "text": " and say, not me."
    },
    {
      "id": 159,
      "start": 480.0400085449219,
      "end": 481.0400085449219,
      "text": " It's not gonna happen to me."
    },
    {
      "id": 160,
      "start": 481.0400085449219,
      "end": 484.1600036621094,
      "text": " I mean, I'm never gonna not love you like I should."
    },
    {
      "id": 161,
      "start": 484.1600036621094,
      "end": 487.760009765625,
      "text": " I'm never gonna be guilty of what the church of Ephesus"
    },
    {
      "id": 162,
      "start": 487.760009765625,
      "end": 490.3999938964844,
      "text": " was guilty of leaving their first love."
    },
    {
      "id": 163,
      "start": 490.3999938964844,
      "end": 492.1600036621094,
      "text": " No, not me."
    },
    {
      "id": 164,
      "start": 493.6000061035156,
      "end": 495.8800048828125,
      "text": " Peter said, Lord, I'm not gonna do that."
    },
    {
      "id": 165,
      "start": 496.760009765625,
      "end": 498.8399963378906,
      "text": " I'll never deny you."
    },
    {
      "id": 166,
      "start": 498.8399963378906,
      "end": 500.44000244140625,
      "text": " I'll never be offended."
    },
    {
      "id": 167,
      "start": 501.3599853515625,
      "end": 502.7200012207031,
      "text": " I'll go with you unto the death."
    },
    {
      "id": 168,
      "start": 502.7200012207031,
      "end": 504.0799865722656,
      "text": " And I think he meant well,"
    },
    {
      "id": 169,
      "start": 504.0799865722656,
      "end": 507.32000732421875,
      "text": " I think he was sincere in what he was saying."
    },
    {
      "id": 170,
      "start": 507.32000732421875,
      "end": 509.239990234375,
      "text": " But we have an enemy."
    },
    {
      "id": 171,
      "start": 509.8399963378906,
      "end": 510.8800048828125,
      "text": " Remember what Jesus said in Luke?"
    },
    {
      "id": 172,
      "start": 510.8800048828125,
      "end": 514.5999755859375,
      "text": " He's desired to sift you as wheat."
    },
    {
      "id": 173,
      "start": 516.8800048828125,
      "end": 520.47998046875,
      "text": " As I look at this passage of scripture this evening,"
    },
    {
      "id": 174,
      "start": 520.47998046875,
      "end": 523.7999877929688,
      "text": " and I deal with this subject matter of loving God"
    },
    {
      "id": 175,
      "start": 523.7999877929688,
      "end": 525.1599731445312,
      "text": " with all of our hearts,"
    },
    {
      "id": 176,
      "start": 525.1599731445312,
      "end": 527.3599853515625,
      "text": " I want you to consider a few thoughts"
    },
    {
      "id": 177,
      "start": 527.3599853515625,
      "end": 528.9600219726562,
      "text": " from these few verses of scripture."
    },
    {
      "id": 178,
      "start": 528.9600219726562,
      "end": 531.52001953125,
      "text": " Number one, when we talk about this interaction,"
    },
    {
      "id": 179,
      "start": 531.52001953125,
      "end": 534.3599853515625,
      "text": " I want you to note that this interaction was personal."
    },
    {
      "id": 180,
      "start": 535.3599853515625,
      "end": 536.52001953125,
      "text": " This interaction was personal."
    },
    {
      "id": 181,
      "start": 536.52001953125,
      "end": 538.1599731445312,
      "text": " Go back to the beginning of John 21."
    },
    {
      "id": 182,
      "start": 538.1599731445312,
      "end": 540.280029296875,
      "text": " It might be on the same page for you."
    },
    {
      "id": 183,
      "start": 540.280029296875,
      "end": 543.280029296875,
      "text": " But we find that according to the opening statements"
    },
    {
      "id": 184,
      "start": 543.280029296875,
      "end": 544.4400024414062,
      "text": " of John chapter 21."
    },
    {
      "id": 185,
      "start": 544.4400024414062,
      "end": 545.719970703125,
      "text": " Now remember in John 20,"
    },
    {
      "id": 186,
      "start": 545.719970703125,
      "end": 547.6400146484375,
      "text": " that's the truth of the resurrection, right?"
    },
    {
      "id": 187,
      "start": 547.6400146484375,
      "end": 549.7999877929688,
      "text": " That's when they saw the resurrected Christ."
    },
    {
      "id": 188,
      "start": 549.7999877929688,
      "end": 552.7999877929688,
      "text": " And Thomas wasn't there the first week."
    },
    {
      "id": 189,
      "start": 552.7999877929688,
      "end": 555.0800170898438,
      "text": " And then Thomas was where he was supposed to be."
    },
    {
      "id": 190,
      "start": 555.0800170898438,
      "end": 556.0399780273438,
      "text": " And he saw Christ."
    },
    {
      "id": 191,
      "start": 556.0399780273438,
      "end": 557.5999755859375,
      "text": " And we come to chapter 21."
    },
    {
      "id": 192,
      "start": 557.5999755859375,
      "end": 559.239990234375,
      "text": " And the Bible says, after these things,"
    },
    {
      "id": 193,
      "start": 559.239990234375,
      "end": 561.3599853515625,
      "text": " Jesus showed himself again to the disciples"
    },
    {
      "id": 194,
      "start": 561.3599853515625,
      "end": 562.4400024414062,
      "text": " at the Sea of Tiberias."
    },
    {
      "id": 195,
      "start": 562.4400024414062,
      "end": 563.8800048828125,
      "text": " That's the Sea of Galilee."
    },
    {
      "id": 196,
      "start": 563.8800048828125,
      "end": 566.5599975585938,
      "text": " And on this Y showed he himself."
    },
    {
      "id": 197,
      "start": 566.5599975585938,
      "end": 569.47998046875,
      "text": " Notice verse two, there were together Simon Peter"
    },
    {
      "id": 198,
      "start": 569.47998046875,
      "end": 570.6799926757812,
      "text": " and Thomas called Didymus,"
    },
    {
      "id": 199,
      "start": 570.6799926757812,
      "end": 572.8400268554688,
      "text": " and Nathanael of Cana in Galilee,"
    },
    {
      "id": 200,
      "start": 572.8400268554688,
      "end": 574.719970703125,
      "text": " and the two sons of Zebedee,"
    },
    {
      "id": 201,
      "start": 574.719970703125,
      "end": 576.8800048828125,
      "text": " and two other of his disciples."
    },
    {
      "id": 202,
      "start": 576.8800048828125,
      "end": 578.6799926757812,
      "text": " So there are seven disciples,"
    },
    {
      "id": 203,
      "start": 578.6799926757812,
      "end": 581.239990234375,
      "text": " according to verse number two, that are there."
    },
    {
      "id": 204,
      "start": 581.239990234375,
      "end": 583.0,
      "text": " The Bible tells us in verse number three,"
    },
    {
      "id": 205,
      "start": 583.0,
      "end": 584.8400268554688,
      "text": " that Simon, notice it says,"
    },
    {
      "id": 206,
      "start": 584.8400268554688,
      "end": 589.8400268554688,
      "text": " Simon Peter said unto them, I go a fishing."
    },
    {
      "id": 207,
      "start": 589.9199829101562,
      "end": 593.1599731445312,
      "text": " They say unto him, we also go with thee."
    },
    {
      "id": 208,
      "start": 593.1599731445312,
      "end": 596.239990234375,
      "text": " They went forth and entered into a ship immediately."
    },
    {
      "id": 209,
      "start": 596.239990234375,
      "end": 599.719970703125,
      "text": " And that night they caught nothing."
    },
    {
      "id": 0,
      "start": 599.719970703125,
      "end": 603.9999709129333,
      "text": " But I want you to notice what happens over the next few verses. I'm not gonna read all of them"
    },
    {
      "id": 1,
      "start": 603.9999709129333,
      "end": 610.2799711227417,
      "text": " I'm gonna pick through notice in verse number five when Jesus shows up. It was morning according to verse number four"
    },
    {
      "id": 2,
      "start": 610.2799711227417,
      "end": 611.759970664978,
      "text": " He stood on the shore"
    },
    {
      "id": 3,
      "start": 611.759970664978,
      "end": 618.3199710845947,
      "text": " The disciples knew not that it was Jesus, but notice in verse 5. It says then Jesus saith unto what does it say?"
    },
    {
      "id": 4,
      "start": 619.2799701690674,
      "end": 620.799970626831,
      "text": " them"
    },
    {
      "id": 5,
      "start": 620.799970626831,
      "end": 623.8399715423584,
      "text": " notice with me in verse number 10 Jesus saith unto"
    },
    {
      "id": 6,
      "start": 623.8399715423584,
      "end": 625.8399715423584,
      "text": " them"
    },
    {
      "id": 7,
      "start": 626.4399700164795,
      "end": 628.719970703125,
      "text": " Notice in verse number 12 Jesus saith unto"
    },
    {
      "id": 8,
      "start": 629.5999698638916,
      "end": 631.5999698638916,
      "text": " Them is them singular or plural"
    },
    {
      "id": 9,
      "start": 632.7599716186523,
      "end": 636.5999717712402,
      "text": " Amen, we're tracking. Amen English class tonight. It's plural"
    },
    {
      "id": 10,
      "start": 636.5999717712402,
      "end": 639.8399696350098,
      "text": " He said unto them according to verse number two"
    },
    {
      "id": 11,
      "start": 639.8399696350098,
      "end": 643.9199714660645,
      "text": " There were seven disciples Peter looks at them and says I go a fishing"
    },
    {
      "id": 12,
      "start": 644.159969329834,
      "end": 646.159969329834,
      "text": " according to verse number three and they"
    },
    {
      "id": 13,
      "start": 646.3599700927734,
      "end": 652.3599700927734,
      "text": " Plural say we're going with you and we find that when Jesus shows up when he's on the shore"
    },
    {
      "id": 14,
      "start": 652.3599700927734,
      "end": 654.1199722290039,
      "text": " They knew not that it was Jesus"
    },
    {
      "id": 15,
      "start": 654.1199722290039,
      "end": 660.3599700927734,
      "text": " He said unto them and he's addressing them as a group the seven of them"
    },
    {
      "id": 16,
      "start": 660.3599700927734,
      "end": 664.6799697875977,
      "text": " But I said to you that the interaction was personal because notice in verse 15"
    },
    {
      "id": 17,
      "start": 664.8799743652344,
      "end": 668.9199676513672,
      "text": " So when they plural the whole of the group had dined"
    },
    {
      "id": 18,
      "start": 669.7599716186523,
      "end": 671.3999710083008,
      "text": " Jesus saith"
    },
    {
      "id": 19,
      "start": 671.3999710083008,
      "end": 673.3999710083008,
      "text": " to Simon Peter"
    },
    {
      "id": 20,
      "start": 675.9199676513672,
      "end": 679.1999740600586,
      "text": " We must recognize tonight that our God is a personal God"
    },
    {
      "id": 21,
      "start": 679.719970703125,
      "end": 685.2399673461914,
      "text": " He cares about us individually, I'm so thankful tonight that our God loves the whole world"
    },
    {
      "id": 22,
      "start": 686.7599716186523,
      "end": 690.7999725341797,
      "text": " Amen for God so loved the world praise the Lord for that"
    },
    {
      "id": 23,
      "start": 692.5599670410156,
      "end": 695.719970703125,
      "text": " His love is global it's to all people"
    },
    {
      "id": 24,
      "start": 696.3599700927734,
      "end": 700.2799682617188,
      "text": " But his love is personal. He loves us as individuals"
    },
    {
      "id": 25,
      "start": 700.5199737548828,
      "end": 705.8799743652344,
      "text": " He's concerned about you and he's concerned about me as individuals and we find that as those"
    },
    {
      "id": 26,
      "start": 705.9999694824219,
      "end": 707.9999694824219,
      "text": " Disciples were there, by the way"
    },
    {
      "id": 27,
      "start": 707.9999694824219,
      "end": 714.3599700927734,
      "text": " So often as you read the Gospels you can read how the Lord Jesus Christ in the midst of great multitudes of people"
    },
    {
      "id": 28,
      "start": 714.3599700927734,
      "end": 719.1599731445312,
      "text": " He singles out individuals and he ministers to individuals"
    },
    {
      "id": 29,
      "start": 719.1599731445312,
      "end": 724.6799697875977,
      "text": " There was a great host in a certain leper and we see that repeatedly how Jesus"
    },
    {
      "id": 30,
      "start": 724.6799697875977,
      "end": 731.2799682617188,
      "text": " ministers to individuals and we find that he said unto them he said unto them, but then he says"
    },
    {
      "id": 31,
      "start": 732.2799682617188,
      "end": 734.2799682617188,
      "text": " Simon son of Jonas"
    },
    {
      "id": 32,
      "start": 734.7599639892578,
      "end": 736.7599639892578,
      "text": " Simon son of Jonas"
    },
    {
      "id": 33,
      "start": 737.2799682617188,
      "end": 739.2799682617188,
      "text": " Lovest thou me"
    },
    {
      "id": 34,
      "start": 739.3199768066406,
      "end": 746.1199645996094,
      "text": " More than these we find that Jesus saith to Simon Peter according to verse number 15"
    },
    {
      "id": 35,
      "start": 746.3999633789062,
      "end": 752.1999664306641,
      "text": " According to verse number 16 Jesus saith to Peter again and according to verse number 17"
    },
    {
      "id": 36,
      "start": 752.1999664306641,
      "end": 755.5199737548828,
      "text": " He Jesus saith to him Peter the third time"
    },
    {
      "id": 37,
      "start": 755.8399658203125,
      "end": 762.0799713134766,
      "text": " Our God is a personal God in this interaction that we read here is a personal interaction"
    },
    {
      "id": 38,
      "start": 762.0799713134766,
      "end": 766.6799774169922,
      "text": " and I'm thankful this evening that though as we look at the letter to the Church of"
    },
    {
      "id": 39,
      "start": 766.8399658203125,
      "end": 772.3199768066406,
      "text": " Ephesus in Revelation chapter 2 and we begin reading those letters to the seven churches that yes"
    },
    {
      "id": 40,
      "start": 772.4799652099609,
      "end": 776.9999694824219,
      "text": " God is addressing the church at Ephesus the Church of Ephesus"
    },
    {
      "id": 41,
      "start": 776.9999694824219,
      "end": 781.5999755859375,
      "text": " but remember a church is made up of individual believers and"
    },
    {
      "id": 42,
      "start": 782.3999633789062,
      "end": 788.8399658203125,
      "text": " So when God is saying to the Church of Ephesus that you've left your first love he's speaking about"
    },
    {
      "id": 43,
      "start": 789.5599670410156,
      "end": 795.0399780273438,
      "text": " Individual believers within the congregation that had left their first love"
    },
    {
      "id": 44,
      "start": 796.2799682617188,
      "end": 803.4399719238281,
      "text": " And when you receive that letter of correction when you receive that word that Christ gave to the church"
    },
    {
      "id": 45,
      "start": 803.4399719238281,
      "end": 810.4799652099609,
      "text": " It requires a time of pause and examination and being able to evaluate our lives and determine"
    },
    {
      "id": 46,
      "start": 810.719970703125,
      "end": 816.3999633789062,
      "text": " Have I personally left my first love and I'm thankful here as we have this account in John 21"
    },
    {
      "id": 47,
      "start": 816.6799774169922,
      "end": 819.1599731445312,
      "text": " That Jesus came to Peter personally"
    },
    {
      "id": 48,
      "start": 820.6399688720703,
      "end": 825.1599731445312,
      "text": " And we must understand tonight that you are an individual that God loves"
    },
    {
      "id": 49,
      "start": 827.1999664306641,
      "end": 833.1999664306641,
      "text": " That he desires to have fellowship with you you say me yes, he loves you"
    },
    {
      "id": 50,
      "start": 833.7999725341797,
      "end": 835.5199737548828,
      "text": " He wants to have fellowship with you"
    },
    {
      "id": 51,
      "start": 835.5199737548828,
      "end": 841.3599700927734,
      "text": " He desires that you would be in his presence that you would long to have he's not gonna force you"
    },
    {
      "id": 52,
      "start": 841.3599700927734,
      "end": 845.719970703125,
      "text": " He's not gonna make you but as his child he wants you to have that fellowship"
    },
    {
      "id": 53,
      "start": 846.0399780273438,
      "end": 848.0399780273438,
      "text": " Draw and die unto God"
    },
    {
      "id": 54,
      "start": 848.6399688720703,
      "end": 849.719970703125,
      "text": " Amen"
    },
    {
      "id": 55,
      "start": 849.719970703125,
      "end": 852.7599639892578,
      "text": " We have a privilege to do that to enter into his presence"
    },
    {
      "id": 56,
      "start": 853.0399780273438,
      "end": 857.9199829101562,
      "text": " To come boldly into the throne of grace to understand that he loves us as individuals"
    },
    {
      "id": 57,
      "start": 858.5999755859375,
      "end": 860.3999633789062,
      "text": " so often"
    },
    {
      "id": 58,
      "start": 860.3999633789062,
      "end": 867.0799560546875,
      "text": " We speak about the need for revival in our nation and we do we need revival, but you know how revival starts"
    },
    {
      "id": 59,
      "start": 867.6799621582031,
      "end": 869.6799621582031,
      "text": " starts with an individual"
    },
    {
      "id": 60,
      "start": 870.6399841308594,
      "end": 878.5199584960938,
      "text": " Revival starts with if you read and you study of of great movements of God of revivals of old you find"
    },
    {
      "id": 61,
      "start": 878.9599609375,
      "end": 880.3199768066406,
      "text": " regularly and"
    },
    {
      "id": 62,
      "start": 880.3199768066406,
      "end": 884.6799621582031,
      "text": " consistently as you study the revivals of old how they started with just a an"
    },
    {
      "id": 63,
      "start": 885.2399597167969,
      "end": 891.0799560546875,
      "text": " Individual a couple of folks that gathered together that desired for God to use them into work"
    },
    {
      "id": 64,
      "start": 891.0799560546875,
      "end": 893.6399841308594,
      "text": " Why because our God is a personal God"
    },
    {
      "id": 65,
      "start": 895.3999633789062,
      "end": 897.3999633789062,
      "text": " You know, there's a lot of world"
    },
    {
      "id": 66,
      "start": 897.5999755859375,
      "end": 904.1999816894531,
      "text": " Religions that don't have the truth that we have with regard to the fact that our God is a personal God"
    },
    {
      "id": 67,
      "start": 904.7999572753906,
      "end": 906.8399658203125,
      "text": " I'm thankful that I can commune with him"
    },
    {
      "id": 68,
      "start": 908.47998046875,
      "end": 913.0799560546875,
      "text": " That I can know him Paul says that I may know him and that awesome"
    },
    {
      "id": 69,
      "start": 913.3999633789062,
      "end": 917.8399658203125,
      "text": " He's a personal God the interaction here in John chapter 21, though"
    },
    {
      "id": 70,
      "start": 917.8399658203125,
      "end": 921.719970703125,
      "text": " There were others that were gathered. It wasn't only Peter that went fishing"
    },
    {
      "id": 71,
      "start": 921.719970703125,
      "end": 928.3599853515625,
      "text": " There were others that were there and we find that Jesus was personal the interaction was personal number two tonight"
    },
    {
      "id": 72,
      "start": 928.3599853515625,
      "end": 934.4399719238281,
      "text": " Not only was the interaction personal, but I want you to see the interaction was purposed. Can I tell you this evening?"
    },
    {
      "id": 73,
      "start": 935.1599731445312,
      "end": 937.1599731445312,
      "text": " that our God always"
    },
    {
      "id": 74,
      "start": 937.7599792480469,
      "end": 938.7599792480469,
      "text": " always"
    },
    {
      "id": 75,
      "start": 938.7599792480469,
      "end": 940.5999755859375,
      "text": " moves with purpose"
    },
    {
      "id": 76,
      "start": 940.5999755859375,
      "end": 945.6399841308594,
      "text": " There is a purpose to everything our God does we may not know it at the time"
    },
    {
      "id": 77,
      "start": 945.6399841308594,
      "end": 949.5999755859375,
      "text": " We may not understand it maybe for this lifetime"
    },
    {
      "id": 78,
      "start": 949.719970703125,
      "end": 955.6399841308594,
      "text": " But we can rest assured in knowing that God has a purpose"
    },
    {
      "id": 79,
      "start": 955.8799743652344,
      "end": 962.5599670410156,
      "text": " And we find that as we rest in that truth that God has a purpose we find in this interaction this evening"
    },
    {
      "id": 80,
      "start": 962.5599670410156,
      "end": 968.8799743652344,
      "text": " This interaction that was personal was also purpose that Jesus was moving with purpose"
    },
    {
      "id": 81,
      "start": 968.8799743652344,
      "end": 975.3999633789062,
      "text": " And we find that he comes to Simon and notice with me at least a first aspect of this purposed"
    },
    {
      "id": 82,
      "start": 975.9999694824219,
      "end": 981.8399658203125,
      "text": " Interaction that Christ had with Peter one of the purposes was that of examination"
    },
    {
      "id": 83,
      "start": 982.8799743652344,
      "end": 987.47998046875,
      "text": " Notice what he says in verse number 15 Simon son of Jonas"
    },
    {
      "id": 84,
      "start": 988.1599731445312,
      "end": 990.1599731445312,
      "text": " Lovest thou me"
    },
    {
      "id": 85,
      "start": 990.1599731445312,
      "end": 992.1599731445312,
      "text": " more than these"
    },
    {
      "id": 86,
      "start": 992.2399597167969,
      "end": 999.5599670410156,
      "text": " Now there's a couple of different ideas that people have had through the centuries of what did Christ mean when he said more than these?"
    },
    {
      "id": 87,
      "start": 999.6799621582031,
      "end": 1001.6799621582031,
      "text": " And there are some that have the idea"
    },
    {
      "id": 88,
      "start": 1001.9599609375,
      "end": 1003.9599609375,
      "text": " Do you love me more than the other?"
    },
    {
      "id": 89,
      "start": 1004.0399780273438,
      "end": 1009.5999755859375,
      "text": " Disciples than these others that are here and remember as I quoted earlier from Matthew 26 in verse 33"
    },
    {
      "id": 90,
      "start": 1009.7999572753906,
      "end": 1016.8399658203125,
      "text": " When he said this that that all men shall be offended because of thee though all men shall be offended because of thee yet"
    },
    {
      "id": 91,
      "start": 1016.8399658203125,
      "end": 1018.8399658203125,
      "text": " will I never be offended and"
    },
    {
      "id": 92,
      "start": 1019.9599609375,
      "end": 1023.6399841308594,
      "text": " Certainly, it could be that Jesus was asking the question"
    },
    {
      "id": 93,
      "start": 1023.6799621582031,
      "end": 1027.5999755859375,
      "text": " Love is now me more than these speaking of the other disciples"
    },
    {
      "id": 94,
      "start": 1027.5999755859375,
      "end": 1035.3199768066406,
      "text": " We find also that it's possible. Remember a few verses back that when Peter got there that he was pulling those"
    },
    {
      "id": 95,
      "start": 1036.0399780273438,
      "end": 1043.1599731445312,
      "text": " Dragging the net according to the end of verse number eight and it tells us as soon verse number nine as they came"
    },
    {
      "id": 96,
      "start": 1043.8799743652344,
      "end": 1049.4399719238281,
      "text": " To land they saw a fire of coals there and fish laid there on and bread and it says in verse number 11"
    },
    {
      "id": 97,
      "start": 1049.4399719238281,
      "end": 1052.9999694824219,
      "text": " Simon Peter went up and drew the net to land full of great fishes and"
    },
    {
      "id": 98,
      "start": 1053.7599792480469,
      "end": 1060.0799560546875,
      "text": " 150 and three and for all there were so many yet was not the net broken now, I don't know"
    },
    {
      "id": 99,
      "start": 1060.5999755859375,
      "end": 1062.6799621582031,
      "text": " of the"
    },
    {
      "id": 100,
      "start": 1062.6799621582031,
      "end": 1069.2399597167969,
      "text": " 153 here that's mentioned. There's no other place that God tells us a number of fish that they caught"
    },
    {
      "id": 101,
      "start": 1070.1199645996094,
      "end": 1071.47998046875,
      "text": " We find that yes"
    },
    {
      "id": 102,
      "start": 1071.47998046875,
      "end": 1074.5999755859375,
      "text": " He says they caught nothing so we could say zero in verse number three"
    },
    {
      "id": 103,
      "start": 1074.5999755859375,
      "end": 1079.8799743652344,
      "text": " But as far as actually numbering the the number of fish that they caught here 153"
    },
    {
      "id": 104,
      "start": 1079.8799743652344,
      "end": 1085.3199768066406,
      "text": " I believe there's something significant about that and I believe that as that idea that I go a"
    },
    {
      "id": 105,
      "start": 1085.6399841308594,
      "end": 1092.1599731445312,
      "text": " Fishing in verse number three remember he was a fisherman and that was the dad's business and that was kind of going back to that"
    },
    {
      "id": 106,
      "start": 1092.4399719238281,
      "end": 1094.8399658203125,
      "text": " Jesus said follow me and I'll make you fishers of men"
    },
    {
      "id": 107,
      "start": 1094.8399658203125,
      "end": 1100.3599853515625,
      "text": " And so we find that when he says love is now me more than these certainly it could be the other disciples that were there"
    },
    {
      "id": 108,
      "start": 1100.3599853515625,
      "end": 1103.3999633789062,
      "text": " But also maybe the things of the world the fish"
    },
    {
      "id": 109,
      "start": 1104.6399841308594,
      "end": 1106.6399841308594,
      "text": " Do you love me more than these?"
    },
    {
      "id": 110,
      "start": 1107.1599731445312,
      "end": 1109.0399780273438,
      "text": " See here's the reality"
    },
    {
      "id": 111,
      "start": 1109.0399780273438,
      "end": 1114.2799682617188,
      "text": " There are things in this world that are pulling for your love for your affection"
    },
    {
      "id": 112,
      "start": 1115.0,
      "end": 1120.5599975585938,
      "text": " Why does God say John says in first John to love not the world?"
    },
    {
      "id": 113,
      "start": 1121.2799682617188,
      "end": 1125.9199829101562,
      "text": " Neither the things that are in the world, right? We sing the song rarely"
    },
    {
      "id": 114,
      "start": 1125.9199829101562,
      "end": 1132.6599731445312,
      "text": " We play it more for an invitation turn your eyes upon Jesus and the things of this world will grow"
    },
    {
      "id": 115,
      "start": 1133.239990234375,
      "end": 1135.0,
      "text": " strangely dim"
    },
    {
      "id": 116,
      "start": 1135.0,
      "end": 1139.699951171875,
      "text": " But we find that there are many listen we see I mentioned last week"
    },
    {
      "id": 117,
      "start": 1140.199951171875,
      "end": 1146.93994140625,
      "text": " We'll study it next Sunday morning be part of the message where the Bible tells us of Demas that hath forsaken me having"
    },
    {
      "id": 118,
      "start": 1147.239990234375,
      "end": 1149.8399658203125,
      "text": " Loved this present world"
    },
    {
      "id": 119,
      "start": 1151.8399658203125,
      "end": 1153.8399658203125,
      "text": " We find this evening"
    },
    {
      "id": 120,
      "start": 1153.9599609375,
      "end": 1160.219970703125,
      "text": " That this interaction was purposed and one of the purposes must have been for examination"
    },
    {
      "id": 121,
      "start": 1160.8999633789062,
      "end": 1162.8999633789062,
      "text": " For Peter to examine his own heart"
    },
    {
      "id": 122,
      "start": 1163.2999877929688,
      "end": 1169.2999877929688,
      "text": " Can I tell you this evening that this self-examination that we read of that Peter would have to go through that?"
    },
    {
      "id": 123,
      "start": 1169.2999877929688,
      "end": 1174.0399780273438,
      "text": " I believe tonight the Church of Ephesus when they receive that letter of correction"
    },
    {
      "id": 124,
      "start": 1174.0399780273438,
      "end": 1181.2799682617188,
      "text": " They would have had to pause and examine this truth where Jesus God and flesh the one that cannot lie"
    },
    {
      "id": 125,
      "start": 1181.2799682617188,
      "end": 1186.97998046875,
      "text": " He's the resurrected Savior at that point. He says you've left your first love"
    },
    {
      "id": 126,
      "start": 1187.5399780273438,
      "end": 1193.2599487304688,
      "text": " You can't argue with God, I mean you could try but you lose every time"
    },
    {
      "id": 127,
      "start": 1195.0199584960938,
      "end": 1199.699951171875,
      "text": " Remember what Gamaliel said when they wanted to fight against the disciples. Hey, listen if this thing be a"
    },
    {
      "id": 0,
      "start": 1199.699951171875,
      "end": 1203.8399510383606,
      "text": " of men, it's just going to kind of fizzle out, but if it be of God, then you're really"
    },
    {
      "id": 1,
      "start": 1203.8399510383606,
      "end": 1212.4199514389038,
      "text": " wasting your time because you're going to fight against God. Tonight, just as the church"
    },
    {
      "id": 2,
      "start": 1212.4199514389038,
      "end": 1218.4599514007568,
      "text": " of Ephesus when they received that letter and just as Peter here in John 21, I would"
    },
    {
      "id": 3,
      "start": 1218.4599514007568,
      "end": 1224.2199516296387,
      "text": " say for us this evening it's a process of examination. The Bible tells us in 1 Corinthians"
    },
    {
      "id": 4,
      "start": 1224.2199516296387,
      "end": 1231.539951324463,
      "text": " 11 we observe the Lord's Supper, but let a man examine himself. Can I tell you this evening,"
    },
    {
      "id": 5,
      "start": 1231.539951324463,
      "end": 1240.539951324463,
      "text": " it's a difficult process. I look at Peter here and Jesus says, Peter, do you love me?"
    },
    {
      "id": 6,
      "start": 1240.539951324463,
      "end": 1246.3799514770508,
      "text": " In verse 15, lovest thou me more than these, and he saith unto him, yea, Lord, thou knowest"
    },
    {
      "id": 7,
      "start": 1246.3799514770508,
      "end": 1251.6199493408203,
      "text": " that I love thee. He saith unto him, feed my lambs, but then he asks again in verse"
    },
    {
      "id": 8,
      "start": 1251.6199493408203,
      "end": 1257.259952545166,
      "text": " 16 and then a third time in verse 17. That process of examination, you know your heart"
    },
    {
      "id": 9,
      "start": 1257.259952545166,
      "end": 1262.259952545166,
      "text": " is deceitful and so is mine. According to Jeremiah 17, our hearts are deceitful, they're"
    },
    {
      "id": 10,
      "start": 1262.259952545166,
      "end": 1269.8599548339844,
      "text": " desperately wicked. The process of examination, the process of self-examination is a difficult"
    },
    {
      "id": 11,
      "start": 1269.8599548339844,
      "end": 1276.0599517822266,
      "text": " process but it is absolutely necessary for every child of God to get alone with God and"
    },
    {
      "id": 12,
      "start": 1276.0599517822266,
      "end": 1280.6199493408203,
      "text": " to go through that process of self-examination and before we ever say as the psalmist did"
    },
    {
      "id": 13,
      "start": 1280.6199493408203,
      "end": 1288.1799545288086,
      "text": " in Psalm 139, search me O God, we must first examine our own hearts and our own lives."
    },
    {
      "id": 14,
      "start": 1288.1799545288086,
      "end": 1293.3399505615234,
      "text": " No doubt in my mind, listen again as I mentioned by way of introduction, if the church, if"
    },
    {
      "id": 15,
      "start": 1293.3399505615234,
      "end": 1298.699951171875,
      "text": " the believers in the first century of the church of Ephesus were guilty of leaving their"
    },
    {
      "id": 16,
      "start": 1298.699951171875,
      "end": 1304.3599548339844,
      "text": " first love, I do not for one moment of time think that every other generation of believers"
    },
    {
      "id": 17,
      "start": 1304.3599548339844,
      "end": 1311.5199508666992,
      "text": " have been innocent of that particular thing. I think there are many that have been guilty"
    },
    {
      "id": 18,
      "start": 1311.5199508666992,
      "end": 1320.199951171875,
      "text": " of leaving their first love. So I believe tonight that one purpose that the Lord had"
    },
    {
      "id": 19,
      "start": 1320.199951171875,
      "end": 1325.319953918457,
      "text": " for this interaction, again he always moves with purpose, when Peter says, I go fishing,"
    },
    {
      "id": 20,
      "start": 1325.319953918457,
      "end": 1332.1199493408203,
      "text": " God knew where he was. Aren't you thankful God knows where you are? Listen, you can have,"
    },
    {
      "id": 21,
      "start": 1332.1199493408203,
      "end": 1338.5199584960938,
      "text": " the devil is relentless. Not one of us tonight are immune from his attack, not one of us"
    },
    {
      "id": 22,
      "start": 1338.5199584960938,
      "end": 1344.8399505615234,
      "text": " tonight are going to go through life without having the accuser of the brethren try to"
    },
    {
      "id": 23,
      "start": 1344.8399505615234,
      "end": 1349.9199523925781,
      "text": " trip us and discourage us and defeat us but greater is he that is in me than he that is"
    },
    {
      "id": 24,
      "start": 1349.9199523925781,
      "end": 1356.6399536132812,
      "text": " in the world. But I want you to know that there are some times in life that we get overloaded,"
    },
    {
      "id": 25,
      "start": 1356.6399536132812,
      "end": 1362.5199584960938,
      "text": " we can get bogged down and we can say, as Peter said, I'm going fishing. But Jesus knows"
    },
    {
      "id": 26,
      "start": 1362.5199584960938,
      "end": 1371.7999572753906,
      "text": " where you are. He knows where you are and he loves you and he pursues you as a personal"
    },
    {
      "id": 27,
      "start": 1371.7999572753906,
      "end": 1378.4199523925781,
      "text": " God, as an individual and then he has purpose. He wants us to examine ourselves. Not only"
    },
    {
      "id": 28,
      "start": 1378.4199523925781,
      "end": 1383.439956665039,
      "text": " the purpose of examination but I believe in a very real sense there's a purpose here"
    },
    {
      "id": 29,
      "start": 1383.439956665039,
      "end": 1391.679946899414,
      "text": " of restoration. I'm thankful that our God is a restoring God. I'm thankful tonight that"
    },
    {
      "id": 30,
      "start": 1391.679946899414,
      "end": 1397.719955444336,
      "text": " our God is a God of second and third and you fill in the blank number of chances. Aren't"
    },
    {
      "id": 31,
      "start": 1397.719955444336,
      "end": 1403.4199523925781,
      "text": " you thankful for that? Again on Sunday morning we'll deal not only with Demas but you think"
    },
    {
      "id": 32,
      "start": 1403.4199523925781,
      "end": 1409.7999572753906,
      "text": " about Mark and he says, send them to me. Why? For he's profitable to me for the ministry."
    },
    {
      "id": 33,
      "start": 1410.3999481201172,
      "end": 1416.9999542236328,
      "text": " Ah, what a great statement, what a great truth. And here we find that our God is a restoring"
    },
    {
      "id": 34,
      "start": 1416.9999542236328,
      "end": 1424.5199584960938,
      "text": " God. He restoreth my soul is what the psalmist says in Psalm 23. We find that this truth"
    },
    {
      "id": 35,
      "start": 1424.5199584960938,
      "end": 1432.179946899414,
      "text": " of restoration, see Peter had denied the Lord three times but now he publicly confesses"
    },
    {
      "id": 36,
      "start": 1432.179946899414,
      "end": 1439.0399475097656,
      "text": " his love for the Lord three times. I know that there's much debate and there's much"
    },
    {
      "id": 37,
      "start": 1439.0399475097656,
      "end": 1444.5599517822266,
      "text": " depth with regard to digging into the use of the words and so on and so forth and the"
    },
    {
      "id": 38,
      "start": 1444.5599517822266,
      "end": 1448.8399505615234,
      "text": " Greek word for love and there are multiple of them and so on and so forth but the reality"
    },
    {
      "id": 39,
      "start": 1448.8399505615234,
      "end": 1456.3599548339844,
      "text": " is that Jesus was purposed to ask him the question three times and to be able to have"
    },
    {
      "id": 40,
      "start": 1456.3599548339844,
      "end": 1463.2799377441406,
      "text": " Peter who had denied the Lord thrice to now publicly confess his love for Christ on three"
    },
    {
      "id": 41,
      "start": 1463.2799377441406,
      "end": 1467.9999389648438,
      "text": " occasions. Back in Matthew 26 I've referenced verse 33 a couple of times but I want you"
    },
    {
      "id": 42,
      "start": 1467.9999389648438,
      "end": 1475.7199401855469,
      "text": " to look at a few other verses in Matthew 26 beginning in verse 31. We'll look at more"
    },
    {
      "id": 43,
      "start": 1475.7199401855469,
      "end": 1481.43994140625,
      "text": " of the interaction that Jesus had with Peter before he made that quoted statement that"
    },
    {
      "id": 44,
      "start": 1481.43994140625,
      "end": 1489.8399658203125,
      "text": " I made earlier. But notice in verse 31 of Matthew chapter 26 the Bible says this, then"
    },
    {
      "id": 45,
      "start": 1489.8399658203125,
      "end": 1494.6799621582031,
      "text": " saith Jesus unto them, all ye shall be offended because of me this night for it is written"
    },
    {
      "id": 46,
      "start": 1494.6799621582031,
      "end": 1499.1599426269531,
      "text": " I will smite the shepherd and the sheep of the flock shall be scattered abroad. But"
    },
    {
      "id": 47,
      "start": 1499.1599426269531,
      "end": 1504.4799499511719,
      "text": " after I am risen again, by the way aren't you thankful that we serve a risen savior?"
    },
    {
      "id": 48,
      "start": 1504.4799499511719,
      "end": 1509.3199462890625,
      "text": " He says but after I am risen again I will go before you into Galilee. Peter answered"
    },
    {
      "id": 49,
      "start": 1509.3199462890625,
      "end": 1512.6799621582031,
      "text": " and said unto him though all men shall be offended because of thee yet will I never"
    },
    {
      "id": 50,
      "start": 1512.6799621582031,
      "end": 1518.3999633789062,
      "text": " be offended. Jesus said unto him verily I say unto thee that this night before the cock"
    },
    {
      "id": 51,
      "start": 1518.3999633789062,
      "end": 1524.7599487304688,
      "text": " crow thou shalt deny me thrice. Peter said unto him though I should die with thee yet"
    },
    {
      "id": 52,
      "start": 1524.7599487304688,
      "end": 1532.9599609375,
      "text": " will I not deny thee. Likewise also said all the disciples. I think Peter believed what"
    },
    {
      "id": 53,
      "start": 1532.9599609375,
      "end": 1541.4799499511719,
      "text": " he said. I don't think Peter thought he would actually deny the Lord. But as you look through"
    },
    {
      "id": 54,
      "start": 1541.4799499511719,
      "end": 1546.0799560546875,
      "text": " the chapter and I mentioned it earlier tonight but look at verse 69 the Bible says now Peter"
    },
    {
      "id": 55,
      "start": 1546.1199645996094,
      "end": 1552.2799377441406,
      "text": " sat without in the palace and a damsel came unto him saying thou also wast with Jesus"
    },
    {
      "id": 56,
      "start": 1552.2799377441406,
      "end": 1560.2399597167969,
      "text": " of Galilee. Verse 70 is the first of the three denials. But he denied before them all saying"
    },
    {
      "id": 57,
      "start": 1560.2399597167969,
      "end": 1566.3999633789062,
      "text": " I know not what thou sayest. When he was gone out into the porch another maid saw him and"
    },
    {
      "id": 58,
      "start": 1566.3999633789062,
      "end": 1572.0399475097656,
      "text": " said unto them that were there this fellow also was with Jesus of Nazareth. And again"
    },
    {
      "id": 59,
      "start": 1572.0399475097656,
      "end": 1579.7599487304688,
      "text": " the second denial in verse 72 he denied with an oath I do not know the man. After a while"
    },
    {
      "id": 60,
      "start": 1579.7599487304688,
      "end": 1584.4799499511719,
      "text": " came unto him they that stood by and said to Peter surely thou also art one of them"
    },
    {
      "id": 61,
      "start": 1584.4799499511719,
      "end": 1592.0399475097656,
      "text": " for thy speech bereath thee. Then verse 74 is the third denial he began then began he"
    },
    {
      "id": 62,
      "start": 1592.0399475097656,
      "end": 1600.2799377441406,
      "text": " to curse and to swear saying I know not the man. And immediately the cock crew. Peter"
    },
    {
      "id": 63,
      "start": 1600.8799438476562,
      "end": 1605.43994140625,
      "text": " remembered the word of Jesus which said unto him before the cock crow thou shalt deny me"
    },
    {
      "id": 64,
      "start": 1605.43994140625,
      "end": 1613.43994140625,
      "text": " thrice and he went out and he wept bitterly. I can't imagine all that Peter experienced"
    },
    {
      "id": 65,
      "start": 1613.43994140625,
      "end": 1621.9199523925781,
      "text": " in this few moments of time. I can't imagine the emotions and all that had transpired the"
    },
    {
      "id": 66,
      "start": 1621.9199523925781,
      "end": 1627.8799438476562,
      "text": " fear that he had because of what was taking place the uncertainty and all of the different"
    },
    {
      "id": 67,
      "start": 1627.8799438476562,
      "end": 1633.5199584960938,
      "text": " emotions that we could mention this evening. But we know that that his heart was broken"
    },
    {
      "id": 68,
      "start": 1633.5199584960938,
      "end": 1640.7199401855469,
      "text": " in verse number 75. And we find that we have a gracious God that that when we think listen"
    },
    {
      "id": 69,
      "start": 1640.7199401855469,
      "end": 1645.0799560546875,
      "text": " there are times in which we could look at our lives and say man I really messed up I"
    },
    {
      "id": 70,
      "start": 1645.0799560546875,
      "end": 1652.5199584960938,
      "text": " really wouldn't listen. Our God is a God of restoration. He's a restoring God. And Jesus"
    },
    {
      "id": 71,
      "start": 1652.5199584960938,
      "end": 1661.3599548339844,
      "text": " comes to Peter. He says Peter do you love me? Three times. And I think it's significant"
    },
    {
      "id": 72,
      "start": 1661.3599548339844,
      "end": 1667.3199462890625,
      "text": " as we look at the not only personal interaction but the purposed interaction that it was for"
    },
    {
      "id": 73,
      "start": 1667.3199462890625,
      "end": 1674.43994140625,
      "text": " a process of examination but also for a time of restoration. I think tonight that as I"
    },
    {
      "id": 74,
      "start": 1674.43994140625,
      "end": 1681.7599487304688,
      "text": " look at Peter in John chapter 21 it must have been so encouraging for the Lord to have this"
    },
    {
      "id": 75,
      "start": 1681.7599487304688,
      "end": 1688.0399475097656,
      "text": " conversation with him. Yes it was difficult. He says he was grieved in verse 17. But I"
    },
    {
      "id": 76,
      "start": 1688.0399475097656,
      "end": 1693.3999633789062,
      "text": " believe that later on in life when Peter would look back at this moment at this event it"
    },
    {
      "id": 77,
      "start": 1693.3999633789062,
      "end": 1700.7599487304688,
      "text": " probably brought him great peace and joy to understand that Jesus met with him there on"
    },
    {
      "id": 78,
      "start": 1700.7599487304688,
      "end": 1710.1599426269531,
      "text": " the shore of Galilee and had this interaction with him. This evening not only was it personal"
    },
    {
      "id": 79,
      "start": 1710.199951171875,
      "end": 1716.3999633789062,
      "text": " and purposed but number three the interaction was productive. It was productive. Can I tell"
    },
    {
      "id": 80,
      "start": 1716.3999633789062,
      "end": 1722.0399780273438,
      "text": " you this evening that when we look at God's word and we think about the truth of God's"
    },
    {
      "id": 81,
      "start": 1722.0399780273438,
      "end": 1727.719970703125,
      "text": " word and how it effectually worketh in us that believe and understanding this evening"
    },
    {
      "id": 82,
      "start": 1727.719970703125,
      "end": 1734.0399780273438,
      "text": " the power of God's word and we look at this interaction and we find that it produced something."
    },
    {
      "id": 83,
      "start": 1734.0399780273438,
      "end": 1739.7999267578125,
      "text": " We think about the word of God being profitable and we think about the truth of how God's"
    },
    {
      "id": 84,
      "start": 1739.7999267578125,
      "end": 1744.6399536132812,
      "text": " word will work in the hearts of his people and remember even as we looked a couple of"
    },
    {
      "id": 85,
      "start": 1744.6399536132812,
      "end": 1749.7999267578125,
      "text": " weeks ago at Revelation chapter 2 as that truth is given to the believers there at the"
    },
    {
      "id": 86,
      "start": 1749.7999267578125,
      "end": 1753.8799438476562,
      "text": " church of Ephesus when he says nevertheless I have somewhat against thee because thou"
    },
    {
      "id": 87,
      "start": 1753.8799438476562,
      "end": 1757.9999389648438,
      "text": " hast left thy first love. So what does he do? He gives them counsel. He says remember"
    },
    {
      "id": 88,
      "start": 1757.9999389648438,
      "end": 1763.2799682617188,
      "text": " therefore from whence thou art fallen and repent. He gives them the corrective measure"
    },
    {
      "id": 89,
      "start": 1763.2799682617188,
      "end": 1768.2399291992188,
      "text": " and do the first works or else I will come unto thee quickly and will remove thy candlestick"
    },
    {
      "id": 90,
      "start": 1768.2399291992188,
      "end": 1777.5999755859375,
      "text": " out of his place except thou repent and so they had a choice to make. This evening when"
    },
    {
      "id": 91,
      "start": 1777.5999755859375,
      "end": 1784.1599731445312,
      "text": " we look at this interaction that Peter had with Jesus it was productive because of the"
    },
    {
      "id": 92,
      "start": 1784.1599731445312,
      "end": 1793.199951171875,
      "text": " way that Peter responded to the interaction. See we can go through the motions. We can"
    },
    {
      "id": 93,
      "start": 1793.3199462890625,
      "end": 1799.2399291992188,
      "text": " take the step of saying well I went and got some counsel but even as brother McKinney"
    },
    {
      "id": 94,
      "start": 1799.2399291992188,
      "end": 1799.7599487304688,
      "text": " said this."
    },
    {
      "id": 0,
      "start": 1799.7599487304688,
      "end": 1807.8399486541748,
      "text": " this morning, getting counsel isn't the same as taking heed to counsel, to doing,"
    },
    {
      "id": 1,
      "start": 1807.8399486541748,
      "end": 1811.239948272705,
      "text": " to applying the truth of God's Word."
    },
    {
      "id": 2,
      "start": 1811.239948272705,
      "end": 1814.6399488449097,
      "text": " So I believe in this passage of Scripture, the reason that I would say that it was a"
    },
    {
      "id": 3,
      "start": 1814.6399488449097,
      "end": 1820.7599487304688,
      "text": " productive interaction is because Peter learned the importance of loving his Savior."
    },
    {
      "id": 4,
      "start": 1820.7599487304688,
      "end": 1827.6799488067627,
      "text": " He learned just how important it was that he loved Jesus with all of his heart."
    },
    {
      "id": 5,
      "start": 1827.6799488067627,
      "end": 1832.1599502563477,
      "text": " We learned this evening as we examined the passage of Scripture that it's really your"
    },
    {
      "id": 6,
      "start": 1832.1599502563477,
      "end": 1833.9999504089355,
      "text": " heart that God wants."
    },
    {
      "id": 7,
      "start": 1833.9999504089355,
      "end": 1836.1199493408203,
      "text": " He wants your heart."
    },
    {
      "id": 8,
      "start": 1836.1199493408203,
      "end": 1841.4799499511719,
      "text": " And I believe tonight, even as I said two weeks ago, if God truly has our heart, He"
    },
    {
      "id": 9,
      "start": 1841.4799499511719,
      "end": 1844.239948272705,
      "text": " really has all of us."
    },
    {
      "id": 10,
      "start": 1844.239948272705,
      "end": 1849.239948272705,
      "text": " When God has our heart, when He's Lord and He's Savior and He's King of your life and"
    },
    {
      "id": 11,
      "start": 1849.239948272705,
      "end": 1855.7199478149414,
      "text": " He's King of my life and He has my heart, then we can sing the songs that we sing and"
    },
    {
      "id": 12,
      "start": 1855.7599487304688,
      "end": 1861.9999504089355,
      "text": " we can sing them with great truth and transparency, I'll go where you want me to go, I'll do what"
    },
    {
      "id": 13,
      "start": 1861.9999504089355,
      "end": 1862.9999504089355,
      "text": " you want me to do."
    },
    {
      "id": 14,
      "start": 1862.9999504089355,
      "end": 1863.9999465942383,
      "text": " Why?"
    },
    {
      "id": 15,
      "start": 1863.9999465942383,
      "end": 1869.799949645996,
      "text": " Because He has my heart and I'll do whatever He wants me to do."
    },
    {
      "id": 16,
      "start": 1869.799949645996,
      "end": 1880.3599472045898,
      "text": " I mentioned several weeks ago about an interview that a fellow on the Christian radio station"
    },
    {
      "id": 17,
      "start": 1880.3599472045898,
      "end": 1886.9199523925781,
      "text": " was having and I just caught just a few moments of this interaction and the man, Alex McFarland,"
    },
    {
      "id": 18,
      "start": 1886.9199523925781,
      "end": 1887.9199523925781,
      "text": " is very well known."
    },
    {
      "id": 19,
      "start": 1887.9199523925781,
      "end": 1890.679946899414,
      "text": " He preaches all over the country and I don't know all of his positions."
    },
    {
      "id": 20,
      "start": 1890.679946899414,
      "end": 1893.959945678711,
      "text": " I don't endorse him wholly just because I mentioned his name."
    },
    {
      "id": 21,
      "start": 1893.959945678711,
      "end": 1898.4399490356445,
      "text": " But I do say this, that I've heard him say some good things and one thing that he said"
    },
    {
      "id": 22,
      "start": 1898.4399490356445,
      "end": 1903.9199523925781,
      "text": " in that interview is he said, I found myself as a new believer just praising God and rejoicing"
    },
    {
      "id": 23,
      "start": 1903.9199523925781,
      "end": 1907.0399475097656,
      "text": " that I could clean the bathrooms at my church."
    },
    {
      "id": 24,
      "start": 1907.0399475097656,
      "end": 1908.2399520874023,
      "text": " Why?"
    },
    {
      "id": 25,
      "start": 1908.2399520874023,
      "end": 1915.5999450683594,
      "text": " Because he just loved Jesus and he was willing to do whatever because God had his heart."
    },
    {
      "id": 26,
      "start": 1915.5999450683594,
      "end": 1917.6199493408203,
      "text": " You know why God had his heart?"
    },
    {
      "id": 27,
      "start": 1917.6199493408203,
      "end": 1924.1199493408203,
      "text": " Because he understood that he was without Christ and then he got saved."
    },
    {
      "id": 28,
      "start": 1924.1199493408203,
      "end": 1927.8399505615234,
      "text": " We mentioned that a little bit in Sunday School this morning as Brother McKinney took us over"
    },
    {
      "id": 29,
      "start": 1927.8399505615234,
      "end": 1929.199951171875,
      "text": " to Ephesians chapter number 2."
    },
    {
      "id": 30,
      "start": 1929.199951171875,
      "end": 1933.959945678711,
      "text": " Listen, there was a time that we were without Christ, but aren't you thankful that now,"
    },
    {
      "id": 31,
      "start": 1934.959945678711,
      "end": 1940.3599548339844,
      "text": " Oh, hallelujah, for his great mercy and his great love."
    },
    {
      "id": 32,
      "start": 1940.3599548339844,
      "end": 1946.3599548339844,
      "text": " We find this evening that Peter learned the truth and the importance of loving his Savior"
    },
    {
      "id": 33,
      "start": 1946.3599548339844,
      "end": 1951.0399475097656,
      "text": " and he understood how much his Savior loved him and he wants to love him with all his"
    },
    {
      "id": 34,
      "start": 1951.0399475097656,
      "end": 1952.0399475097656,
      "text": " heart."
    },
    {
      "id": 35,
      "start": 1952.0399475097656,
      "end": 1955.5599517822266,
      "text": " Not only did Peter understand the importance of loving Christ, but I believe that Peter"
    },
    {
      "id": 36,
      "start": 1955.5599517822266,
      "end": 1958.43994140625,
      "text": " understood what the Lord expected of him."
    },
    {
      "id": 37,
      "start": 1958.43994140625,
      "end": 1962.9999542236328,
      "text": " Notice in verse 15, he says, feed my lambs and verse number 16 and 17, he says, feed"
    },
    {
      "id": 38,
      "start": 1962.9999542236328,
      "end": 1963.9999542236328,
      "text": " my sheep."
    },
    {
      "id": 39,
      "start": 1963.9999542236328,
      "end": 1968.5599517822266,
      "text": " And then we find in verse 19, he says, follow me."
    },
    {
      "id": 40,
      "start": 1968.5599517822266,
      "end": 1969.5599517822266,
      "text": " Follow me."
    },
    {
      "id": 41,
      "start": 1969.5599517822266,
      "end": 1976.3199462890625,
      "text": " Listen, if we understand this evening the importance and we truly love God with all"
    },
    {
      "id": 42,
      "start": 1976.3199462890625,
      "end": 1981.5999450683594,
      "text": " of our hearts, we'll do what he calls us to do, we'll live for him, we'll serve him, we'll"
    },
    {
      "id": 43,
      "start": 1981.5999450683594,
      "end": 1985.5999450683594,
      "text": " keep his commandments and his commandments will not be grievous."
    },
    {
      "id": 44,
      "start": 1985.5999450683594,
      "end": 1986.8599548339844,
      "text": " Why?"
    },
    {
      "id": 45,
      "start": 1986.8599548339844,
      "end": 1989.9199523925781,
      "text": " Because he has my heart."
    },
    {
      "id": 46,
      "start": 1989.9199523925781,
      "end": 1994.5999450683594,
      "text": " You know, I love my wife and I love my children."
    },
    {
      "id": 47,
      "start": 1994.5999450683594,
      "end": 2000.4799499511719,
      "text": " You know, when Holly asks me to help her with something, I'm delighted to be able to do"
    },
    {
      "id": 48,
      "start": 2000.4799499511719,
      "end": 2001.4799499511719,
      "text": " it."
    },
    {
      "id": 49,
      "start": 2001.4799499511719,
      "end": 2002.4799499511719,
      "text": " Why?"
    },
    {
      "id": 50,
      "start": 2002.4799499511719,
      "end": 2003.4799499511719,
      "text": " Because I love her."
    },
    {
      "id": 51,
      "start": 2003.4799499511719,
      "end": 2005.3599548339844,
      "text": " Because I love her."
    },
    {
      "id": 52,
      "start": 2005.3599548339844,
      "end": 2009.3599548339844,
      "text": " I don't like, how many of you like painting?"
    },
    {
      "id": 53,
      "start": 2009.3599548339844,
      "end": 2010.3599548339844,
      "text": " Some of you."
    },
    {
      "id": 54,
      "start": 2010.3599548339844,
      "end": 2011.3599548339844,
      "text": " You're crazy."
    },
    {
      "id": 55,
      "start": 2011.3599548339844,
      "end": 2013.199951171875,
      "text": " I don't like painting."
    },
    {
      "id": 56,
      "start": 2013.199951171875,
      "end": 2014.199951171875,
      "text": " I don't."
    },
    {
      "id": 57,
      "start": 2014.199951171875,
      "end": 2017.3599548339844,
      "text": " But you know what I did a couple of weeks ago?"
    },
    {
      "id": 58,
      "start": 2017.3599548339844,
      "end": 2018.719955444336,
      "text": " I did some painting."
    },
    {
      "id": 59,
      "start": 2018.719955444336,
      "end": 2019.719955444336,
      "text": " Why?"
    },
    {
      "id": 60,
      "start": 2020.5199432373047,
      "end": 2021.5199432373047,
      "text": " Because Holly wanted to do some painting."
    },
    {
      "id": 61,
      "start": 2021.5199432373047,
      "end": 2023.1599426269531,
      "text": " I did some painting."
    },
    {
      "id": 62,
      "start": 2023.1599426269531,
      "end": 2024.1599426269531,
      "text": " You know what?"
    },
    {
      "id": 63,
      "start": 2024.1599426269531,
      "end": 2027.3999481201172,
      "text": " It was enjoyable, actually."
    },
    {
      "id": 64,
      "start": 2027.3999481201172,
      "end": 2031.1599426269531,
      "text": " And it's one of those things, listen, when I get to serve God, when I love him and I'm"
    },
    {
      "id": 65,
      "start": 2031.1599426269531,
      "end": 2034.0399475097656,
      "text": " doing it out of love, it's not that I have to do these things."
    },
    {
      "id": 66,
      "start": 2034.0399475097656,
      "end": 2036.8399505615234,
      "text": " It's not that, oh, no."
    },
    {
      "id": 67,
      "start": 2036.8399505615234,
      "end": 2039.0799560546875,
      "text": " I delight in doing it."
    },
    {
      "id": 68,
      "start": 2039.0799560546875,
      "end": 2040.0799560546875,
      "text": " Why?"
    },
    {
      "id": 69,
      "start": 2040.0799560546875,
      "end": 2041.7599487304688,
      "text": " Because I love him."
    },
    {
      "id": 70,
      "start": 2041.7599487304688,
      "end": 2045.5599517822266,
      "text": " And I know that I love him because he first loved me."
    },
    {
      "id": 71,
      "start": 2045.5599517822266,
      "end": 2050.719955444336,
      "text": " But what happens sometimes is we start getting things out of order, and we start doing as"
    },
    {
      "id": 72,
      "start": 2050.719955444336,
      "end": 2054.5999450683594,
      "text": " the church of Ephesus was doing, and we're doing all these things, but we're not doing"
    },
    {
      "id": 73,
      "start": 2054.5999450683594,
      "end": 2059.9999389648438,
      "text": " it from a heart of love, the motive."
    },
    {
      "id": 74,
      "start": 2059.9999389648438,
      "end": 2067.0799560546875,
      "text": " And the reality this evening is that Peter learned that Jesus was to be loved with all"
    },
    {
      "id": 75,
      "start": 2067.0799560546875,
      "end": 2073.6399536132812,
      "text": " of his heart, and that he had to do the will of God in his life to minister to those that"
    },
    {
      "id": 76,
      "start": 2073.719940185547,
      "end": 2081.239959716797,
      "text": " God would call him to minister to, to follow Jesus wherever Jesus would lead him to go."
    },
    {
      "id": 77,
      "start": 2081.239959716797,
      "end": 2084.5999450683594,
      "text": " You know, tonight, if we love Jesus the way that we should, then we, too, would be in"
    },
    {
      "id": 78,
      "start": 2084.5999450683594,
      "end": 2085.5999450683594,
      "text": " the same position."
    },
    {
      "id": 79,
      "start": 2085.5999450683594,
      "end": 2087.5999450683594,
      "text": " Lord, I'll do what you want me to do."
    },
    {
      "id": 80,
      "start": 2087.5999450683594,
      "end": 2090.2799377441406,
      "text": " I'll go where you want me to go because I love you."
    },
    {
      "id": 81,
      "start": 2090.2799377441406,
      "end": 2095.919952392578,
      "text": " Go over to the book of Isaiah, if you will, Isaiah chapter 1."
    },
    {
      "id": 82,
      "start": 2095.919952392578,
      "end": 2101.3599548339844,
      "text": " Give you a few thoughts tonight from Isaiah and Jeremiah very quickly."
    },
    {
      "id": 83,
      "start": 2101.3599548339844,
      "end": 2105.5199584960938,
      "text": " There's a problem in the day of Hosea, in chapter 10 of Hosea, the Bible says they had"
    },
    {
      "id": 84,
      "start": 2105.5199584960938,
      "end": 2106.5199584960938,
      "text": " a divided heart."
    },
    {
      "id": 85,
      "start": 2106.5199584960938,
      "end": 2109.159942626953,
      "text": " You know, we've got to be careful."
    },
    {
      "id": 86,
      "start": 2109.159942626953,
      "end": 2110.199951171875,
      "text": " We can't have a divided heart."
    },
    {
      "id": 87,
      "start": 2110.199951171875,
      "end": 2111.679962158203,
      "text": " We can't serve God and mammon."
    },
    {
      "id": 88,
      "start": 2111.679962158203,
      "end": 2114.239959716797,
      "text": " That's what Jesus said."
    },
    {
      "id": 89,
      "start": 2114.239959716797,
      "end": 2121.0399475097656,
      "text": " Isaiah chapter number 1, we find that verse number 11, notice what the Bible says in Isaiah"
    },
    {
      "id": 90,
      "start": 2121.0399475097656,
      "end": 2125.8799438476562,
      "text": " 1 and 11, to what purpose is the multitude of your sacrifices unto me, saith the Lord?"
    },
    {
      "id": 91,
      "start": 2125.8799438476562,
      "end": 2131.159942626953,
      "text": " I am full of the burnt offerings of rams and the fat of red fed beasts, and I delight"
    },
    {
      "id": 92,
      "start": 2131.159942626953,
      "end": 2134.2799377441406,
      "text": " not in the blood of bullocks or of lambs or of he goats."
    },
    {
      "id": 93,
      "start": 2134.2799377441406,
      "end": 2139.719940185547,
      "text": " When you come to appear before me, who hath required this at your hand to tread my courts?"
    },
    {
      "id": 94,
      "start": 2139.719940185547,
      "end": 2145.1199340820312,
      "text": " Bring no more, notice what it says, vain oblations, incenses and abomination unto me, the new"
    },
    {
      "id": 95,
      "start": 2145.1199340820312,
      "end": 2149.159942626953,
      "text": " moons and Sabbaths, the calling of assemblies I cannot away with."
    },
    {
      "id": 96,
      "start": 2149.159942626953,
      "end": 2153.919952392578,
      "text": " It is iniquity, even the solemn meeting, your new moons and your appointed feasts my soul"
    },
    {
      "id": 97,
      "start": 2153.919952392578,
      "end": 2154.9999389648438,
      "text": " hateth."
    },
    {
      "id": 98,
      "start": 2154.9999389648438,
      "end": 2158.2999572753906,
      "text": " They are a trouble unto me, I am weary to bear them."
    },
    {
      "id": 99,
      "start": 2158.2999572753906,
      "end": 2162.8799438476562,
      "text": " And when you spread forth your hands, I will hide mine eyes from you, yea, when you make"
    },
    {
      "id": 100,
      "start": 2162.8799438476562,
      "end": 2164.7599487304688,
      "text": " many prayers, I will not hear."
    },
    {
      "id": 101,
      "start": 2164.7599487304688,
      "end": 2170.0799560546875,
      "text": " Your hands are full of blood, wash you, make you clean, put away the evil of your doings"
    },
    {
      "id": 102,
      "start": 2170.0799560546875,
      "end": 2174.199951171875,
      "text": " from before mine eyes, cease to do evil."
    },
    {
      "id": 103,
      "start": 2174.199951171875,
      "end": 2177.9599609375,
      "text": " Understand that as we look at this passage of scripture, that they were bringing offerings,"
    },
    {
      "id": 104,
      "start": 2177.9599609375,
      "end": 2179.9599609375,
      "text": " they were, where did they get the idea of bringing offerings?"
    },
    {
      "id": 105,
      "start": 2179.9599609375,
      "end": 2182.9599609375,
      "text": " Well, they were doing what God had commanded them to do back in Leviticus."
    },
    {
      "id": 106,
      "start": 2183.2799377441406,
      "end": 2186.2799377441406,
      "text": " But you know what was missing?"
    },
    {
      "id": 107,
      "start": 2186.2799377441406,
      "end": 2187.2799377441406,
      "text": " Their heart."
    },
    {
      "id": 108,
      "start": 2187.2799377441406,
      "end": 2188.2799377441406,
      "text": " Their heart."
    },
    {
      "id": 109,
      "start": 2188.2799377441406,
      "end": 2192.7599487304688,
      "text": " God says, why are you bringing me these things?"
    },
    {
      "id": 110,
      "start": 2192.7599487304688,
      "end": 2198.5599365234375,
      "text": " Notice in Isaiah chapter 29 and verse 13, notice what the Bible says, and I don't have"
    },
    {
      "id": 111,
      "start": 2198.5599365234375,
      "end": 2203.719940185547,
      "text": " time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse"
    },
    {
      "id": 112,
      "start": 2203.719940185547,
      "end": 2207.9999389648438,
      "text": " that would be quoted later in the Gospels, the Bible says this in verse 13, wherefore"
    },
    {
      "id": 113,
      "start": 2207.9999389648438,
      "end": 2214.7999572753906,
      "text": " the Lord said, forasmuch as this people draw near me with their mouth and with their lips"
    },
    {
      "id": 114,
      "start": 2214.7999572753906,
      "end": 2222.2799377441406,
      "text": " do honor me, but notice, but have removed their heart far from me."
    },
    {
      "id": 115,
      "start": 2222.2799377441406,
      "end": 2226.8399353027344,
      "text": " And their fear toward me is taught by the precept of men."
    },
    {
      "id": 116,
      "start": 2226.8399353027344,
      "end": 2231.5399475097656,
      "text": " God says with their mouth, they draw near me with their mouth, and with their lips they"
    },
    {
      "id": 117,
      "start": 2231.5399475097656,
      "end": 2232.5399475097656,
      "text": " do honor me."
    },
    {
      "id": 118,
      "start": 2232.5399475097656,
      "end": 2238.179962158203,
      "text": " But there's a problem because their heart, their heart has been removed."
    },
    {
      "id": 119,
      "start": 2238.179962158203,
      "end": 2243.0599365234375,
      "text": " In Jeremiah chapter 4 and verse number 4, notice what the prophet says with regard to"
    },
    {
      "id": 120,
      "start": 2243.0599365234375,
      "end": 2247.1399536132812,
      "text": " the subject of our heart tonight."
    },
    {
      "id": 121,
      "start": 2247.1399536132812,
      "end": 2249.219940185547,
      "text": " In verse number 3, I'll read with it."
    },
    {
      "id": 122,
      "start": 2249.219940185547,
      "end": 2253.93994140625,
      "text": " In Jeremiah chapter 4 and verse number 3, it says, for thus saith the Lord to the men"
    },
    {
      "id": 123,
      "start": 2253.93994140625,
      "end": 2259.4599609375,
      "text": " of Judah and Jerusalem, break up your fallow ground and sow not among thorns, circumcise"
    },
    {
      "id": 124,
      "start": 2259.4599609375,
      "end": 2261.6199340820312,
      "text": " yourselves to the Lord."
    },
    {
      "id": 125,
      "start": 2261.699951171875,
      "end": 2268.5399475097656,
      "text": " Notice what he says, and take away the foreskins of your heart, ye men of Judah and inhabitants"
    },
    {
      "id": 126,
      "start": 2268.5399475097656,
      "end": 2275.0599365234375,
      "text": " of Jerusalem, lest my fury come forth like fire and burn that none can quench it because"
    },
    {
      "id": 127,
      "start": 2275.0599365234375,
      "end": 2277.2599487304688,
      "text": " of the evil of your doings."
    },
    {
      "id": 128,
      "start": 2277.2599487304688,
      "end": 2283.3799438476562,
      "text": " Again in chapter 29, Jeremiah 29 and verse 13, the Bible says this with regard to this"
    },
    {
      "id": 129,
      "start": 2283.3799438476562,
      "end": 2290.0199584960938,
      "text": " truth with regard to our hearts."
    },
    {
      "id": 130,
      "start": 2290.0199584960938,
      "end": 2294.2999572753906,
      "text": " In Jeremiah 29 and verse 13, you shall seek me and find me, notice when you shall search"
    },
    {
      "id": 131,
      "start": 2294.2999572753906,
      "end": 2299.219940185547,
      "text": " for me with what, all your heart."
    },
    {
      "id": 132,
      "start": 2299.219940185547,
      "end": 2307.6199340820312,
      "text": " You know, God doesn't want half-hearted Christianity, He doesn't want us to have a divided heart."
    },
    {
      "id": 133,
      "start": 2307.6199340820312,
      "end": 2310.4599609375,
      "text": " He wants us to have a heart for Him."
    },
    {
      "id": 134,
      "start": 2310.4599609375,
      "end": 2314.4999389648438,
      "text": " He wants us to love Him with all of our heart."
    },
    {
      "id": 135,
      "start": 2314.4999389648438,
      "end": 2319.6199340820312,
      "text": " This evening as I consider the thought from Revelation chapter 2, I just couldn't get"
    },
    {
      "id": 136,
      "start": 2319.6199340820312,
      "end": 2322.3999633789062,
      "text": " away from it."
    },
    {
      "id": 137,
      "start": 2322.3999633789062,
      "end": 2329.699951171875,
      "text": " Because I believe tonight that every single one of us, let him that thinketh he stand"
    },
    {
      "id": 138,
      "start": 2329.699951171875,
      "end": 2335.1199340820312,
      "text": " take heed lest he fall, that's Bible, right, that's what it says."
    },
    {
      "id": 139,
      "start": 2335.1199340820312,
      "end": 2340.8599243164062,
      "text": " Every one of us tonight have an enemy."
    },
    {
      "id": 140,
      "start": 2340.8599243164062,
      "end": 2347.719970703125,
      "text": " And I hope tonight that we could each stand and say, I love God with all my heart."
    },
    {
      "id": 141,
      "start": 2347.8199462890625,
      "end": 2353.2399291992188,
      "text": " But I understand just as Peter stood and said, Lord, I'll never deny you, that we have an"
    },
    {
      "id": 142,
      "start": 2353.2399291992188,
      "end": 2357.6399536132812,
      "text": " enemy and he's relentless and he's ruthless."
    },
    {
      "id": 143,
      "start": 2357.6399536132812,
      "end": 2362.2799682617188,
      "text": " And he wants to, he wants to divide your heart and my heart."
    },
    {
      "id": 144,
      "start": 2362.2799682617188,
      "end": 2367.6399536132812,
      "text": " He wants to cause us to just go through the motions and just kind of half-hearted, just"
    },
    {
      "id": 145,
      "start": 2367.6399536132812,
      "end": 2374.7599487304688,
      "text": " kind of do what we know we're supposed to do without the heart."
    },
    {
      "id": 146,
      "start": 2374.7999267578125,
      "end": 2376.9999389648438,
      "text": " But God says, I want your heart."
    },
    {
      "id": 147,
      "start": 2376.9999389648438,
      "end": 2380.3999633789062,
      "text": " I want your heart."
    },
    {
      "id": 148,
      "start": 2380.3999633789062,
      "end": 2387.699951171875,
      "text": " Tonight, just as the church of Ephesus and just as Peter needed to have this personal"
    },
    {
      "id": 149,
      "start": 2387.699951171875,
      "end": 2398.2799682617188,
      "text": " interaction that would cause some examination, say, Lord, I don't want to be guilty of leaving"
    },
    {
      "id": 150,
      "start": 2398.2799682617188,
      "end": 2399.199951171875,
      "text": " my first love."
    },
    {
      "id": 0,
      "start": 2399.199951171875,
      "end": 2405.2199511528015,
      "text": " Lord, I want to keep my heart where it ought to be."
    },
    {
      "id": 1,
      "start": 2405.2199511528015,
      "end": 2409.879951477051,
      "text": " Keep thy heart with all diligence, for out of it are the issues of life."
    },
    {
      "id": 2,
      "start": 2409.879951477051,
      "end": 2414.539951324463,
      "text": " Guard my heart, keep it."
    },
    {
      "id": 3,
      "start": 2414.539951324463,
      "end": 2424.6599502563477,
      "text": " Be aware of the external attacks so that we could not be guilty, as those believers in"
    },
    {
      "id": 4,
      "start": 2424.6599502563477,
      "end": 2428.619951248169,
      "text": " the first century were, of leaving their first love."
    },
    {
      "id": 5,
      "start": 2428.619951248169,
      "end": 2431.8199501037598,
      "text": " It's personal, it's individual."
    },
    {
      "id": 6,
      "start": 2431.8199501037598,
      "end": 2434.099952697754,
      "text": " What does God have for each of us?"
    },
    {
      "id": 7,
      "start": 2434.099952697754,
      "end": 2438.259952545166,
      "text": " If you say tonight, I love God with all my heart, I say praise the Lord."
    },
    {
      "id": 8,
      "start": 2438.259952545166,
      "end": 2443.3399505615234,
      "text": " But can I tell you tonight, protect it."
    },
    {
      "id": 9,
      "start": 2443.3399505615234,
      "end": 2445.139949798584,
      "text": " Protect it."
    },
    {
      "id": 10,
      "start": 2445.139949798584,
      "end": 2446.139949798584,
      "text": " Be careful."
    },
    {
      "id": 11,
      "start": 2446.139949798584,
      "end": 2448.4999504089355,
      "text": " You have an enemy."
    },
    {
      "id": 12,
      "start": 2448.4999504089355,
      "end": 2450.7399520874023,
      "text": " We need to keep on loving God with all of our heart."
    },
    {
      "id": 13,
      "start": 2450.7399520874023,
      "end": 2451.7399520874023,
      "text": " Let's pray."
    },
    {
      "id": 14,
      "start": 2451.7399520874023,
      "end": 2453.0599517822266,
      "text": " Father, we love you."
    },
    {
      "id": 15,
      "start": 2453.0599517822266,
      "end": 2455.859951019287,
      "text": " We thank you for loving us."
    },
    {
      "id": 16,
      "start": 2455.859951019287,
      "end": 2459.8199501037598,
      "text": " We know that we only love you because you first loved us."
    },
    {
      "id": 17,
      "start": 2459.8199501037598,
      "end": 2470.419952392578,
      "text": " God, I think about this correction to the church of Ephesus and coupled with this interaction"
    },
    {
      "id": 18,
      "start": 2470.419952392578,
      "end": 2475.1799545288086,
      "text": " that our resurrected Savior had with Peter."
    },
    {
      "id": 19,
      "start": 2475.1799545288086,
      "end": 2481.299949645996,
      "text": " God, it brings me to a place of self-examination."
    },
    {
      "id": 20,
      "start": 2481.299949645996,
      "end": 2491.7399520874023,
      "text": " I pray tonight that it would help all of us, Lord, to pause and truly examine our hearts."
    },
    {
      "id": 21,
      "start": 2491.7399520874023,
      "end": 2494.5399475097656,
      "text": " That we'd love you like we should."
    },
    {
      "id": 22,
      "start": 2494.5399475097656,
      "end": 2497.1799545288086,
      "text": " We'd love you with all of our hearts."
    },
    {
      "id": 23,
      "start": 2497.1799545288086,
      "end": 2501.2599487304688,
      "text": " I pray that as we have this moment of invitation, I pray, God, that you'd have your will in"
    },
    {
      "id": 24,
      "start": 2501.2599487304688,
      "end": 2504.419952392578,
      "text": " a way, move and work as only you can, and we'll thank you for it."
    },
    {
      "id": 25,
      "start": 2504.419952392578,
      "end": 2505.5399475097656,
      "text": " In Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-14T21:06:14.941047"
}