{
  "video_id": "eO6wOHtfoHo",
  "text": "you through the book of Colossians, and I have thoroughly enjoyed already these several messages that I've been able to prepare and deliver from this great book, and it's only four chapters in the book of Colossians, and some have asked, is it really going to take us all year? Well, that kind of depends, and this is message number five, and we'll get through almost the end of chapter number one today, and I have another message next week on chapter number one, but we'll continue to make progress through this book, and you'll recall last week as we looked at verses nine through 14 that we dealt with the truth with regard to the prayer of Paul for the believers in Colossians. What a blessing it was to kind of dig through those verses of scripture and to see exactly how it was that Paul was praying for them, and we think about the ministry of intercessory prayer, the great privilege that we have to go to God on the behalf of others, and what a blessing. As we continue to study through this book, you'll remember that as we dealt with the prayer of Paul in verses nine through 14, we kind of said some things with regard to the prayer, and one of the things that we said is we need to know some things about people in order to pray for them, to engage in this ministry of intercessory prayer, and some of what the apostle Paul knew was the fact that there were false teachers that were present there in Colossae, and knowing that those false teachers were present, of course he prayed that they would be spiritually mature, that they would grow in their walk with Christ, and I often said, and I have often said over the years, and I said it last week as well, that one of the best ways to combat false teaching is spiritual maturity, spiritual growth. When you know the Word of God and you know the truth of God's Word, it enables you to be able to stand against the attacks of the enemy, it enables you to be able to stand against the subtlety of the false teachers. I know that I've said many times that they will use our vocabulary, but they use a different definition, and so you've got to be careful with these false teachers. They're very sly and cunning, and the subtlety that you find within false teachers, and so the apostle Paul understood that those false teachers were present, and that gives us some understanding as to the next several verses that are before us this morning, and really this passage of Scripture, Colossians 1, we'll be looking at verses 15 through 23, is one of the most powerful passages in briefly describing the person of Jesus Christ, and I don't really think you could probably go anywhere else in the New Testament and find just a handful of verses that so powerfully gives us truth with regard to the person of Jesus Christ. Obviously, you can compare Scripture with Scripture, you can go to a whole host of passages, but in these few verses we find that Paul is going to provide this great truth, powerful truth, and as these false teachers were present and active in the city of Colossae, one thing that we'd understand about false teachers is they all have one thing in common. One thing that I believe that all false teachers have in common is their attack upon the person of Jesus Christ. And false teachers will always have… there are all sorts of things, you can look at false teachers and you can find all sorts of various teachings and various creeds and religious activities, if you will, that they would encourage you to be participating in, but one thing that is common amongst false teachers is their attack upon the person of Jesus Christ. We can ask ourselves this morning, why is that? Why is there unity amongst the false teachers on this one point of an attack upon the person of Jesus Christ? Well, if the enemy is able to cause people to err regarding the person and work of Jesus Christ, we understand that the consequences are grave and eternal. And so therefore, there's this unity, if you will, amongst these false teachers on the attack against the person and work of the Lord Jesus Christ. Usually false teachers will not deny the existence of Jesus Christ. They won't try to come in and say, no, Jesus doesn't exist, and he's just… no, no, they'll just not give the fullness of who Jesus really is. They're okay, false teachers are okay with someone believing that Jesus existed, they're okay with somebody saying that he was a good man, that he was even a prophet, but they're not okay with saying that he is the Son of God and the only Savior for mankind, and that of course is what we find the Word of God to clearly teach us. And so therefore, this attack upon who he is. If you'll remember on Wednesday evening, several weeks ago, we began studying about the doctrine of Christ, and one of the passages in which we started with was there in Matthew when the Lord Jesus Christ said to the disciples, whom do men say that I, the Son of Man, am? And of course, the disciples provided an answer, and in that answer, what was revealed not only to the Lord, of course he already knew it, but their acknowledgment would also reveal to them, and it reveals to us, that there was confusion with regard to who Jesus is. Some say that you're John the Baptist, some say that you're one of the prophets, Elijah or Jeremiah or one of the others, and there was confusion about who Jesus is, and we find that still today, that confusion exists. And of course, Jesus then turns the attention to his disciples and he says, but whom say ye that I am? And Peter stood with great confidence and boldness and he said, thou art the Christ, the Son of the living God. What a great declaration, a powerful truth that was revealed there in the Gospel of Matthew, and we find that here in Colossae, the Greek philosophers and the Gnostics, they really didn't believe, they didn't really mind if people believed in Jesus. I mean, think about the timing. This is being written nearly 25 to 35 years after the crucifixion and resurrection of Jesus Christ. No doubt there were people that knew that Jesus existed. They didn't mind if you believed that Jesus existed, as long as you did not believe that he was God in flesh and the Savior of the world. Therefore, Paul declares powerfully and concisely who Christ is. It is important for us to note that as we look at this passage of Scripture, that Paul actually did not go forth and attack the false teaching. You know what he did? He just exalted the Lord Jesus Christ, and he showed who Jesus is. See, one of the things, I took some classes in seminary Bible college that deal with all of the coltonisms and what have you, and they try to prepare you on how to talk to people with different perspectives and what have you, and you know what I've learned in life? I've learned, not to say that the classes were of no value, but what I've learned in life is that if we would simply just exalt the Lord Jesus Christ, I don't need to answer all of the questions of the false teachers, I don't need to deal with all of those things, I simply need to elevate and exalt our Savior. Now, knowing some of those things may help us, but I've found in life that often, as we would deal with some of those particular aspects of maybe a cult or a false teacher, we can find ourselves winning an argument, or engaged in an argument, but never actually able to present who Jesus is in a fashion in which they might come to a saving knowledge of our Lord and Savior Jesus Christ. Why? Because we just want to argue about the points of what their religion teaches versus what the Bible teaches, and we just begin to get in an argument, and you'll find very few people are willing to acknowledge that they're wrong. So we just exalt Christ, and we just elevate Christ. If you're taking notes this morning, that's what I've titled the message, The Exalted Christ. The Exalted Christ. In this passage of Scripture, I want you to notice, if you're taking notes, number one, the way that Christ is described. Notice with me in verse number 12, really, we'll kind of start there. I know that the passage will deal with primarily verses 15 through 23, but let's go back to verse number 12. The Bible says this, giving thanks unto the Father which hath made us meet, to be partakers of the inheritance of the saints in light, who hath delivered us from the power of darkness, and hath translated us into the kingdom of his dear Son, in whom we have redemption through his blood, even the forgiveness of sins. Who is, and so the reason why I start it there back in verse number 12 is because you do begin in verse number 15, and it says, who is the image of the invisible God. We understand that he's referring back to his dear Son that is mentioned at the end of verse number 13, and it's carried through, he's referring to the Lord Jesus Christ. He is the image of the invisible God, the firstborn of every creature, for by him were all things created that are in heaven and that are in earth, visible and invisible, whether they be thrones or dominions or principalities or powers, all things were created by him and for him. And he is before all things, and by him all things consist. And he is the head of the body, the church, who is the beginning, the firstborn from the dead, that in all things he might have the preeminence, for it pleased the Father that in him should all fullness dwell. And having made peace through the blood of his cross, by him, to reconcile all things unto himself, by him I say, whether they be things in earth or things in heaven, and you, that were sometime alienated and enemies in your mind. by wicked works, yet now hath He reconciled the body of His flesh through death to present you holy and unblameable and unreprovable in His sight. If ye continue in the faith grounded and settled, and be not moved away from the hope of the Gospel which ye have heard, which was preached to every creature which is under heaven, whereof I, Paul, am made a minister.\" Number one, if you're taking notes, notice the way Christ is described. The way that He is described. Number one, we find right here in v. 15 and really down through a number of verses, v. 19 in particular, but the first way in which He is described is that He is the image of the invisible God. John 4 and v. 24 when Jesus is meeting with the woman of the well there when He says that He must needs go through Samaria, He's having that conversation. And in John 4 and v. 24, the Bible says that God is a Spirit. They that worship Him must worship Him in spirit and in truth. And so we find that Paul, as he's elevating and exalting the Lord Jesus Christ, the first manner in which he describes our wonderful Savior is that He is the image of the invisible God. That word image is important. It means the likeness. It really means the manifestation. And it helps us to understand what the Apostle Paul is saying here. And it helps us to understand the deity of Christ. Again, as we compare Scripture with Scripture, what Paul is saying to these believers in Colossae is that Jesus is God. That He is the very God in flesh. That He is the image of the invisible God. You understand that at the incarnation, He did not become God. He is not like God. He is God. And He always has been and forever will be. He is God. And we find that the Bible would reveal to us that Jesus manifested God to people. See, we mentioned already that John 4 and verse 24, God is a spirit. And so we find that as Jesus would manifest the Father, and He uses that terminology often in the book of John in particular, and that word manifest, it means to make known or visible. To make known or to make visible. And so if God is a spirit, we find that Jesus as God, when He was robed in human flesh at the incarnation, He did not cease to be God. He continued to be God because He is God. And He manifested, He made known or made visible what God is or who God is. And we find that in John 1, hold your place here in the book of Colossians. We'll look at a few verses in the book of John. And I want you to notice in John 1, a passage in which we often reference with regard to the incarnation and what power it is. We'll look at the first three verses in just a moment, but I want you to look at verse number 14 with me here as we speak about the Lord Jesus Christ being the image of the invisible God. The Bible says in verse number 14, and the Word was made flesh. Now we know in the beginning of this chapter that the Bible tells us that in the beginning was the Word and the Word was with God and the Word was God. And so Jesus is the Word of God. It's a name that was assigned to Him. And He, it says this, the Word was made flesh and dwelt among us, tabernacled among us. And it says here, and we beheld His glory, the glory as of the only begotten of the Father, full of grace and truth. How could they behold His glory? Because He manifested Himself, right? He made it visible. He made it known through the incarnation. Look at verse number 18. No man hath seen God at any time. The only begotten Son, which is in the bosom of the Father, He hath declared Him. In John chapter number 17, we find that the Bible makes this truth known to us with regard to the day in which Jesus, He says the hour is now come. He would soon go to the cross of Calvary. And as He's praying here in this passage of Scripture, many wonderful things are revealed to us here, but we find that just as Colossians 1 deals with the eternality of Christ, so also John 17 deals with the eternality of Christ. Just as Colossians 1 deals with the fact that He is the image, the manifestation of the invisible God, so also we find that truth in John 17. Notice in verse number five, Jesus says this, and now, O Father, glorify Thou me with Thine own self, notice this, with the glory which I had with Thee before the world was. The eternality of Christ, we see that over in the book of Colossians, stay here in John, I'm gonna read another couple of verses here, but in the book of Colossians in chapter number one, we see the eternality of Christ in verse number 17 when the Bible says He is before all things, and by Him all things consist. So in John 17, in verse number five, we see the eternality, and then we see the manifestation, look in verse number six of John 17, the Bible says this, Jesus said, I have manifested Thy name unto the men which Thou gavest me out of the world. Thine they were, and Thou gavest them me, and they have kept Thy word. Again, that word manifest means to make known or make visible, and so Jesus, often as He was walking upon the earth during His earthly ministry, He made the claim of deity, and we understand that He made the claim of deity because often the religious leaders were ready to stone Him and kill Him because of the statements, the declarations that He made, and so we find not only does the Bible tell us here in Colossians 1 and 15 that He is the image of the invisible God, I want you to notice what is said in verse number 19, we'll read the rest of verse 15 here in just a moment, but look and skip down to verse number 19. Notice what it says, for it pleased the Father. Now, you understand that as we look here at this passage of Scripture, and we begin to see the Trinity or the triunity, and we see that the Bible says that it pleased the Father, that in Him, speaking of Jesus Christ, His Son, as He mentions in verse number 13, when it talks about the kingdom of His dear Son, we see that the Bible says that it pleased the Father, that in Him, notice this phrase, should all fullness dwell. Now, Paul, again, without attacking the false teachers and saying here's where they're wrong, here's where they're wrong, he's exalting Christ, but in so doing, he's exposing the false teachers because they had this idea of these angels and various created beings and so on and so forth that there would be aspects in which there would be certain amounts of divinity and power and so on and so forth, and here, the Apostle Paul says, in Him, in Jesus Christ, it pleased the Father that in Him should all fullness dwell. The entirety of it. The whole sum of it. The total of all divine power and attributes are in Jesus Christ. All fullness, and then it says dwell. The idea of that word dwell, not only does it mean to be present, but it carries with it the idea of being at home permanently. In other words, He always has been and He always will be God. The truth that we find, again, this passage of Scripture is exalting the Lord Jesus Christ and we find the way in which He is described in John 1, we looked at a few verses, but in verse number 16, the Bible in that passage of Scripture tells us this truth, and of His fullness have all we received and grace for grace. And so Paul is telling these believers in Colossae, let me help you understand a little bit more about Jesus Christ. Let me help you understand who He is in a very distinct and a very powerful and concise way. Number one, He is the image of the invisible God. Number two, He is the Creator. At the end of verse number 15, the Bible says the firstborn of every creature. Now, we need to be careful as understanding what is meant by this phraseology, the firstborn of every creature. The false teachers will tell you that that means Jesus was created. That's what they'll tell you. He was the firstborn, so therefore He was created. Well, that's in violation of Scripture. Scripture does not support that when you compare Scripture with Scripture. Also, we find that that word firstborn not only carries with it maybe the firstborn as a child, but you think about the distinction in the Old Testament of the heir, the firstborn, the one that has supremacy, that receives the inheritance, that owns the things, and you find that here in speaking of Jesus Christ, when He says that He's the firstborn of every creature, it does not mean that He was created. He is the Creator, and that is what we find here, not only the way that Christ is described, that He is the image of the invisible God, but number two, He is the Creator, and we find that here as we look in verse number 15 down through verse number 17 in understanding the work of creation, that the Bible says that He is the firstborn of every creature, for by Him were all things made. created, that are in heaven and that are in earth, visible and invisible, whether they be thrones or dominions or principalities or powers. All things were created by Him and for Him. And He is before all things, and by Him all things consist.\" Now we'd have to understand and make this note that the truth of John chapter number one, coupled with the truth of Colossians chapter number one, these passages of Scripture do not contradict the record of Genesis 1. Rather, we would find that these passages of Scripture complement what we find in Genesis chapter number one and provide further details. When you read Genesis chapter number one, you find very simply where the Bible says, in the beginning God created the heaven and the earth, a passage in which we're familiar with. We find that in John chapter number one and Colossians chapter number one, that God is going to, through revelation, the divine revelation of the Word of God, He is going to give us further details with regard to the work of Jesus Christ in creation. He's the Creator. And we find that in John chapter number one, the Bible says, in the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God. All things were made by Him, and without Him was not anything made that was made. It's obvious in John 1, as well as Colossians 1, that he's speaking about the Lord Jesus Christ. And it says, for by Him, in verse number 16, were all things created. I'm thankful that God gives us the truth of creation. I've made known, especially as we were studying the book of Genesis, that the truth of creation is not isolated to the first few chapters of the book of Genesis. The truth of creation is dealt with throughout the whole of God's Word. You will find various passages of Scripture throughout the Old and New Testament that declare to us the creation of the universe, and the fact that our God is the Creator. And here, as we would think about the truth that is given to us, for by Him were all things created that are in heaven, that are in earth, that we would understand that this truth of creation is not arrived to by reasoning, but rather through revelation. Many have tried to reason. Many have offered various ideas as to how the cosmos began, and all of those things. And science has offered its theories, no doubt. And we understand that we're living in the midst of a generation that are dealing with a number of false teachers that have denied the Creator God, and they have offered some other theory as to the universe in which we live in, where we came from. But we find that the truth is not arrived to by reasoning, but by revelation. One who was there, God, reveals to us how He did what He did. You could enter into a room, and you could have some observation of something that took place, and as you would look at that particular example that would be before you, you could try to, through using reason, conclude what was going on, and how things started there. And maybe you're looking at some sophisticated type of machinery, and you go in, and you begin to evaluate, and you make all kinds of calculations, and you begin to try to give an explanation through reason as to how this process started. And then somebody comes in that was there, that started the process, and says, let me explain to you exactly what happened here. Because through your theory, you're not going to reach the proper conclusion, because it cannot be reached through reasoning. In fact, if you were to go and see a pendulum swinging back and forth, and you could make some measurements as to the distance in which that pendulum is traveling in each direction, if you were, you know, up to speed with physics and mathematics and all of those types of things, you could work all sorts of calculations, and through all of your calculations, you may be able to determine when that pendulum will stop swinging. But if you use the same calculations, and you try to go backwards, and try to find when it started swinging, you're gonna find yourself in a mess. The reason why is because you would eventually get to the place that your calculations would really have said that that thing would have to be spinning all the way around in order for it to still be spinning at the distance, or still going back and forth in the distance in which it was currently moving. And so somebody comes in and says, no, actually this is what we did, this is how we started the process. And so we find that the truth of creation is a truth that is revealed to us through the Creator, through God. All Scripture is given by inspiration of God, and it's profitable, not only for doctrine, but we find that Paul says there in 2 Timothy chapter number 3, that it's profitable for doctrine, for reproof, for correction, for instruction in righteousness, that the man of God might be perfect, throughly furnished unto all good works. And so God has given us His Word, He's given us the account of creation. Notice, as we would begin to think about God being the Creator, that He is the one who was there, and He is the one that gives us the record. He created everything, and He controls everything. The Bible says in verse number 16, notice it says, all things were created by Him. It tells us that are in heaven and that are in earth, visible and invisible. I heard a story, not really a story, it was an account yesterday, I heard an account of someone in some desert over in Africa found the smallest species of some type of a land animal. And they're going through all this sort of thing, and they were giving the measurements, and it was microscopic, the size of this thing, and some people had discovered this thing. Listen, God created all things, visible and invisible. The Bible says here this, whether they be thrones or dominions or principalities or powers. It's interesting, because here in verse number 16, when He begins to deal with that thrones, dominions, principalities, and powers, you will see that He's speaking of the angel world. You know, angels are created beings. God created the angels. In the book of Ephesians, in chapter number 6, as you would begin to deal with the whole armor of God and the the battle that we're engaged in, you would find that Paul says in Ephesians 6 and verse number 12, we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places. See, these false teachers in Colossae, they were dealing with some things with regard to angels, and they were dealing with some angel worship. We'll find that later, near the end of chapter number 2, in particular, where that's dealt with. But you find here, as Paul is exalting the Lord Jesus Christ, that he says, listen, he created everything, including the angels. Some people would like to think that Jesus is actually lower than an angel in his power and so on and so forth, because he came as a man. But as we studied the book of Hebrews, we understood that he came in that fashion so that he could die and redeem mankind. He had to come in the form of a man. This is God's plan. By the way, I'm so thankful for God's plan. We find that the Bible continues and says this, all things were created by him and for him. Not only that, he is before all things, and by him all things consist. Hebrews 1 and verse number 3 gives us truth with regard, again, to this subject matter of the creation. It tells us in Hebrews 1 and verse number 3, who being the brightness of his glory and the express image of his person, it sounds similar to what we're studying in here in Colossians 1, upholding all things by the word of his power. When he had by himself purged our sins, sat down on the right hand of the majesty on high. And then it tells us being made so much better than the angels. And what we find in verse number 3, not only the fact that it says he's the express image of his person, upholding all things by the word of his power. Not only did he create all things, but he is the keeper of all things. If you remove God, the whole universe is gonna fall apart. It really is. Because by him all things consist. He holds it all together. And we find that here, the believers in Colossians, by preservation for us this morning, when we're looking at this exalted Christ, we find that he is the image of the invisible God that he manifested, made known, made visible God to man. We find that he is the creator. We find, number three, that he is the redeemer. I'm so thankful that he is the creator. But I'm telling you, the truth that he is the redeemer causes me to rejoice greatly. Because without his redeeming work, if he was the creator but not the redeemer, we'd all have a destination in Lake Idaho. a fire. Right? He is the Creator. He is the Redeemer. We looked at those verses of Scripture last week in verses 12-14. And as we looked at that passage of Scripture last week, we noted the four powerful statements that were made. And just to quickly review, in verse number 12, the Bible says that He hath made us meat to be partakers. And what a great word that word meat. It means to make qualified. The reality that we could not qualify ourselves for heaven, but He qualified us. He made us meat to be partakers of the inheritance of the saints in light. You can't qualify yourself and I can't qualify myself for heaven. But through the imputed righteousness of the Lord Jesus Christ, He hath made us meat. He hath made us qualified. Isn't that awesome? It says this in verse number 13, that He delivered us from the power of darkness. Hallelujah. Not only that, but He translated us into the kingdom of His dear Son. And then we find in verse number 14, He spoke about the truth of redemption, the forgiveness through His precious blood. And now, once again, the Apostle Paul is going to exalt the Lord Jesus Christ by speaking about His work of redemption. Notice in verse number 20, and we'll get back to verse number 18 here in just a moment, but notice in verse number 20, the Bible says this, and having made peace through the blood of His cross by Him to reconcile all things unto Himself. By Him, I say, whether they be things on earth or things in heaven. And you that were sometime alienated and enemies in your mind by wicked works, yet now hath He reconciled. Now just think here for a moment as we think about these great truths that have already been revealed to us in verse number 20, the peace that we can have with God through the blood of His cross. In Romans chapter number 5, the Bible speaks about peace with God. Often as the people of God, we speak about the peace of God, and I'm so thankful for the peace of God, which passeth all understanding. I've often heard people over the years make a statement near the end of their life and they'll say something like this, if I've asked them if they're sure of heaven, I've made my peace with God. Have you ever heard anyone say that, use that terminology? The question is this, how did you do that? Because biblically speaking, there's only one way to make peace with God. Romans 5 and verse number 1, therefore being justified by faith, we have peace with God through our Lord Jesus Christ. And here in Colossians 1 and verse number 20, it says, and having made peace through the blood of His cross, we were at enmity with God. The Bible says that God, but God commendeth His love toward us and that while we're yet sinners, Christ died for us. We were at enmity with God because of our sin nature, because of the transgression that's recorded in Genesis 3, when Adam and Eve sinned and sin entered into the world and death passed upon all men for that all have sinned. And we find that we were able now, or we are able to have peace with God through the blood of His cross. Wow. He mentions about the fact that of this truth in verse number 21, when he says in you that were sometime alienated and enemies in your mind by wicked works, yet now hath He reconciled. So he speaks about this peace and then he speaks about the truth of reconciliation. I'm so thankful for this word reconciled, the truth of reconciliation. It's through his substitutionary atonement that we can be reconciled to God. You ever had two parties of people that were at odds at variance one with the other and they need to have a mediator so that they can be reconciled. Well, we were at enmity with God. We were separated from God because He is holy and we are sinful. Jesus Christ, through His work on the cross of Calvary, through the substitutionary atonement, He made it possible that we could be reconciled to God. It's a precious truth of the word of God. And then we see in verse number 22, the Bible continues with this idea about the reconciliation, that it was in the body of His flesh through death. It was through the substitutionary death that we can be reconciled. But notice this last phrase of verse number 22, to present you holy and unblameable and unreprovable in His sight. Now think about that truth. The reality is that there in verse number 22 when He says to present you, we find in verse number 13 it says, who hath delivered us from the power of darkness and hath translated us into the kingdom of His dear Son. I mentioned the song last Sunday morning. The old account was settled long ago. I mean, the reality is that the day in which you were saved, you were delivered from the power of darkness, and you were translated into the kingdom of His dear Son. It was a great miracle that took place on that day. And we find that here the Bible reveals to us that it was so that, or one of the workings of our salvation is that He would present us holy, unblameable, and unreprovable. Now in of ourselves, we're not holy, unblameable, and unreprovable. But in as we're clothed in His righteousness, the imputed righteousness of Christ that we mention in 2 Corinthians 5 and verse number 21, and we see here that the Bible says that He's done these things, He is the Redeemer, this is the work of redemption, and therefore He is going to present us. Think about this truth of our theme for this year. Complete in Christ. In Colossians 2, in verse number 10, is the verse of Scripture in which we find that it says, and you are complete in Him, which is the head of all principality and power. I don't need anything else. I'm complete in Christ, and because of the work of redemption, He is going to present you, He's going to present His children holy, unblameable, and unreprovable. Clothed in His holiness. Unblameable and unreprovable are similar words, one meaning without blemish and the other meaning blameless. Now think about that. That's how He's going to present us. Someone said this, every time that God the Father looks at you, He has the son, S-O-N, in His sight. Because we're clothed in the righteousness of Christ. And you think about the accuser of the brethren, as the book of Revelation would deal with our enemy being the accuser of the brethren, that He would seek to cause us to, He'd like to bring up our past and talk about our sin, but we're able to say, it's under the blood. Julianna sang that song this morning, I am forgiven forever. Not because I deserved it, but because God who is rich in mercy, because of His great love wherewith He has loved us, because of His work of redemption, He has saved us, He's offered to us the gift of salvation, and as we receive that free gift of eternal life, He makes it so that He is going to present us holy, unblameable, and unreprovable in His sight. It's amazing. Remember the truth that God gave to the children of Israel in the Old Testament, the book of Psalms, He speaks about the sins being as far removed as the east is from the west. That's in Psalm 103 and verse number 12. And it's a great truth, and you understand that if you travel east, you can just keep on, there's no point in which east and west are really divisible one from the other. We find that He did not say as far as the north is from the south, but as far as the east is from the west. In Psalm 103 and verse 12, as far as the east is from the west, so far hath He removed our transgressions from us. Aren't you thankful for that? We think about redemption. We think about His work of being the Redeemer. Listen, it's a wonderful thing to be forgiven. It's a wonderful thing to know that we have been forgiven by the Lord and that we have this forgiveness. There are many today that do not know that forgiveness is even available. In Micah 7 and verse number 19, it says, He will turn again, He will have compassion upon us, He will subdue our iniquities, and Thou wilt cast all their sins into the depths of the sea. We sing a song, gone, gone, gone. Yes, my sins are gone. What a great truth. And here we find one of the impacts or results, if you will, of redemption, that He will present us wholly, unblameable and unreprovable in His sight. We'll deal with it as we get through the rest of Colossians chapter number 1, but let me just give you a quick preview. In verse number 28, and again, I'm jumping into next week's message, but in verse number 28, the Bible says, Whom we preach, warning every man and teaching every man in all wisdom that we may present every man perfect in Christ Jesus. Why is Paul preaching the gospel? Why are they out doing these missionary journeys and going and preaching the gospel? Because he understands the power of the gospel to transform people, but also that we might be presented wholly and unblameable and unreprovable in His sight, and therefore, Paul is preaching that message. What joy to know that he is the Redeemer. He's the Redeemer. Number four, how Christ is described. Notice with me that He is the head of the body, the church. In v. 18, the Bible says this, and He is the head of the body, the church. Who is the beginning, the firstborn from the dead, that in all things He might have the preeminence. As we look at v. 18, we find that that word head carries with it the idea of the originator or the source. It helps us to understand that He is the leader or the ruler, that He is the head of the church. I'm so thankful that it is His church. You know, the church was not man's idea. It was God's idea. God designed the church. God empowers the church. The Lord Jesus Christ said in Matthew 16 and v. 18, I will build My church and the gates of hell shall not prevail against it. We find that Paul tells Timothy in 1 Timothy 3 and v. 15 that thou oughtest to know how to obey thyself in the house of God, which is the church of the living God. It's God's church. He's the head of the church. Oftentimes, we'll speak about the polity, if you will, for a local church, and we'll speak about the office of pastor and deacon and the role in which I play as the pastor. I am the under-shepherd. But we have a chief shepherd. And I'm so thankful that it's His church and that He is the head of the church. What a joy. What a blessing. I want you to think about the ownership that He has of the church just for a moment and this position that He has as being the head of the body, the church. Not only is He the originator, the source, the leader, and ruler, but notice what is said in Acts 20. This is just a precious passage of Scripture to me as I study through the entirety of this passage. It's one in which I find great encouragement. I find that Paul is here speaking to these Ephesian elders, the leaders of the church at Ephesus, and he's rehearsing for them some of his work in ministry, and then he's giving them some good counsel and instruction with regard to the work that is before them. And it says this in Acts 20, 28, \"'Take heed, therefore, unto yourselves, into all the flock over which the Holy Ghost hath made you overseers, to feed the church of God, which He hath purchased with His own blood.'\" Feed the church of God, which He hath purchased with His own blood. This exalted position of the Lord Jesus Christ as being the head of the church, this was important for these believers in Colossae to understand. Not only was it important for the believers in Colossae to understand, but it's important for us today to continue to understand that Jesus is the head of the church. And oh, how powerful that truth is. And how mindful we must be of this reality that is before us. This is not my church. It's God's church. We understand that He is God in flesh. Paul in these verses of Scripture will present to these believers in Colossae the Lord Jesus Christ. The exalted Christ. He will give for them the truth that He is the image of the invisible God. That He is the Creator. That He is the Redeemer. That He is the head of the body, the church. What is Paul saying? He's saying that He's God. That Jesus is God. Paul in Acts 17, when he arrives in the city of Thessalonica, there was a synagogue of the Jews and Paul goes to meet with them and to give them truth. And the Bible tells us in v. 2 of Acts 17, and Paul, as his manner was, went in unto them, and three Sabbath days reasoned with them out of the Scriptures, opening and alleging that Christ's most needs have suffered, and risen again from the dead, and that this Jesus whom I preach unto you is Christ. They knew who this Jesus was. They knew who the man Jesus was. These individuals, these Jews that are in the synagogue there in Thessalonica, they would have understood who Jesus was as a man. They would have understood His crucifixion. They would have been aware of these things. And Paul says this Jesus whom I preach unto you is Christ, the Anointed One, the Messiah, the Son of God. And here in the book of Colossians, he presents Jesus Christ to these believers. Now, obviously, they've already understood who Jesus Christ was. They'd placed their faith and trust in Him when they received the Gospel. But Paul is beginning to... You know, we sing the song more about Jesus. I hope that you know more about Jesus today than you did when you first got saved. That you understand more of the working of redemption today than the day you first got saved. And so Paul, because of these false teachers coming in and saying various things, and there are certain people groups around the world that they're okay if you believe in Jesus as just being another small G-O-D. They don't mind that you serve a multiplicity of gods and have all of these different deities in which you would worship because they do not mind you believing that Jesus existed. They're attacking who He really is and His work that He completed. And so Paul makes this presentation to these believers in Colossae. How do we respond? Number two, I've simply said this, the appropriate response. The appropriate response. When you read all of these things, when you receive this great truth that Paul reveals to these believers in Colossae, when you see the Lord Jesus Christ exalted in this position, when you understand that He is the image of the invisible God, that He is the Creator, He is the Redeemer, He is the head of the body of the church, what's the proper response? Well, notice in verse 18. The Bible says this at the end of verse 18. That in all things, He might have the preeminence. That in all things, He might have the preeminence. Wouldn't that simply be the logical conclusion that we would reach? When we understand who He is. When He's presented in the fashion in which He has been. And we understand who Jesus is, it would only seem logical to me that we would say, yes, He deserves the preeminence in every area of my life. That word preeminence is the only place in the New Testament in which it's found. And that word means to be first or to hold the first place. Doesn't He deserve that position? Isn't our appropriate response to the truth that is before us this morning to say it's all about Jesus? It should be this, that we say like John the Baptist said in John 3 and verse 30, He must increase, I must decrease. That in all things, He might have the preeminence. Oh, that we would live our lives in that fashion. It's not about what I want, it's about what God wants. Paul says it this way in 1 Corinthians 6 and verses 19 and 20. What? Know ye not? Right? I think about the way in which he starts that passage of Scripture as if he's saying, are you ignorant to this? You know not this truth? What's this truth? That you've been bought with a price. Therefore, the natural conclusion of being bought with a price is that you're to glorify God in your body and your spirit, which are His. He owns us. When we understand that without Him we can do nothing, when we understand that He has done for us what I could not do for myself and what no one else could do for me, that I say, yes, I want to give Him the preeminence. I want to crown Him Lord of lords in my life. See, the reality is that He is Lord. He is King. There are times in which in our lives individually, He may not be the Lord and King of my life. Who sits upon that throne of your heart, of your life? You know who wants to sit on that throne is self. And it's a constant battle. That's why Paul said, I am crucified with Christ. Because the constant battle is that self wants to be first. I think it was D.L. Moody that said if He is not Lord of all, He is not Lord at all. What powerful statement that old preacher of yesteryear made. This morning as we look at this appropriate response, we'd say first of all, that we should crown Him Lord of our lives. That He would be the Master in our lives. That He would have the preeminence. I believe that many times today, unfortunately, there are people that are looking for a Savior, but not for a Master. What do I mean by that? Well, they want somebody to deliver them from the penalty of sin, but they're not interested in that same somebody controlling their life. Why? Because I have my ambitions. I have my desires. I have my... But we've been bought with a price. We're not our own. Number two, how we should respond, the appropriate response, is that we would continue. Notice in verse number 23, The Bible says this, if you continue in the faith, grounded and settled, and be not moved away from the hope of the gospel, which ye have heard, and which was preached to every creature which is under heaven, whereof I, Paul, am made a minister.\" When you're speaking about this idea of continuing, you remember as we were studying the passage of Scripture with the prayer of Paul, and we talked about the truth in verse number 11, that he said, strengthened with all might, according to his glorious power, unto all patience and longsuffering, with joyfulness. As we looked at that passage of Scripture and we understood the truth that what Paul was giving for these believers to understand that what was produced was that spiritual maturity, that endurance, that steadfastness, that continuing, if you will, to do the will of God. And we see here in verse number 23 that he says, if you continue in the faith, grounded and settled, and be not moved away from the hope of the gospel, which ye have heard, and which was preached to every creature which is under heaven, whereof I, Paul, am made a minister. So notice with me and consider with me the danger that is present that they would be moved away. How are they going to be moved away? False teachers. False teachers. Now, we'd understand here that he says that you would continue in the faith grounded and settled. Again, we see the importance, the significance of discipleship and spiritual maturity through this phraseology of being grounded and settled. I would say this, that if we're grounded and settled, it will go a long way to keep us from being moved away. Because we're grounded and settled. Listen, I hope that no one could come to you and say that you could get to heaven by your own works. I hope that you're grounded and settled enough to know that's a false teaching. And here's why that's a false teaching. You have some verses that you can go to. And you can say, well, the Bible says this, and here's a passage of Scripture that deals with this. It's not of our own works, not of the works of our own righteousness that we have done. We're not clothed in our righteousness. We're clothed in the righteousness of Christ. The Bible says that it's a gift of God, not of works, lest any man should boast. Just to use one example, if we're grounded and settled, it will go a long way to keep us from being moved away. You know, the believers in the region of Galatia, as Paul is ministering to those believers in Galatians chapter number one, of course, we know that it's a number of churches there in Galatia, a church in Antioch and Pisidia and Iconium, Lystra, and Derbe. And it says in verse number two, that the church is in Galatia. But notice with me, the Bible says this in verse number six. He says in Galatians 1 verse number six, I marvel that ye are so soon removed from him that called you into the grace of Christ unto another gospel. And then he says this, which is not another, but there be some that trouble you and would pervert the gospel of Christ. But though we are an angel from heaven, preach any other gospel unto you that, that which we have preached unto you, let him be accursed, strong language. But what happened in these churches in Galatia, there are some false teachers there, the Judaizers in particular, and those false teachers were teaching something other. And Paul says, I am, I marvel that you're so soon removed from him that called you into the grace of Christ unto another gospel. Notice that phraseology, that they were so soon removed. What does he say in Colossians 1? He says this, if you continue in the faith, grounded and settled, and be not moved away. Now let me say this. These people in Colossae that are being written to in Colossians in this book, they are referred to in verse number two as the saints and faithful brethren in Christ, which are at Colossae. They're saved people. We believe in eternal security. We are kept by the power of God. Jesus said in John chapter number 10, that my sheep hear my voice and I know them and I give unto them eternal life and they shall never perish. I'm so thankful for the truth of eternal security. Here in verse number 23, he's not teaching that they would lose their salvation. If they've been saved, they are secure in Christ. So what is he teaching? What are the false teachers? Why do the false teachers come after saved people if they can't cause you to be lost? Because they can attack your effectiveness. You think about the work of a false teacher, bringing in confusion and chaos and all sorts of things. And it begins that you're not going to continue to preach the same message that you receive because you're so messed up and you're so confused about what the real truth is. And now what's happening is your effectiveness on reaching other people with that powerful gospel that's able to save souls, your effectiveness is hindered. If you don't know the truth of eternal security, how are you going to help somebody with eternal security? If you don't know the truth that Jesus is the only Savior, that Jesus Christ himself said, I am the way, the truth, and the life, no man cometh unto the Father but by me. If Peter stood with great power and said, neither is there salvation in any other for there's no other name under heaven given among men whereby we must be saved. If we don't know those truths, because some false teachers have gotten us all kinds of sideways and we've been moved away, I'm still secure in Christ, but my effectiveness on reaching the world with the gospel is greatly hindered. And that's what the false teacher wants to do. He wants to keep people from being saved. And so the attack upon the church that the enemy brings on introducing false teaching, these men that are referenced in Jude, verse number 3 and 4, that had crept in unawares, that turned the grace of God into lasciviousness. Jude says, it was needful that I write unto you. It was necessary. It was of utmost importance. Why? Because these false teachers are coming in. I'm thankful for my security in Christ, but I want to continue in this and I want to be grounded and settled. And it's not the idea that if I get all kinds of sideways because of a false teacher that I'm going to lose my salvation. No, but I'm going to lose my effectiveness. There's a lot of people today in our world that kind of carry that idea, you just be sincere about what you believe and at the end everything's going to be okay. Just sincerely embrace and believe what you believe. All roads lead to heaven. I've heard it so many times. It's just not true. It's just not true. But the false teachers, the enemy, right? The God of this world has blinded the minds of them which believe not, lest the light of the glorious gospel should shine unto them, according to 2 Corinthians, chapter number 4. And so we find that these false teachers, they're going to continue to attack and to continue to try to tear down. And when you or when I stand up and I say, Jesus is the only way, oh man, they don't like that. They don't like that. In fact, I preached a message several years ago about that very subject, Jesus is the only way. There was a large, large church, a Baptist church, unfortunately, in New York City. The pastor stood up and he preached a message, and in his message, he said, this thinking that Jesus is the only way is outdated, and it's just not true, and you can't support it biblically. And when he made that statement in a church of 10 or 15,000 people, you could hear in the background applause and hooting and hollering at the support of the statement that was made. How sad. People are being, listen, they're condemned already. And if we would, if the false teachers get their way and they subvert and they come in and they undermine the truth of the Word of God, then we find that people will continue to be lost in their sins. And so Paul says, let me exalt the Lord Jesus Christ. Let me help you. Let me remind you, and let me help you understand that He is the image of the invisible God. He's the Creator. He's the Redeemer. He's the head of the body of the church. And here's your appropriate response to such truth, that you would crown Him Lord and King of your life, that in all things He would have the preeminence, and that you would continue. Don't be tossed to and fro with every wind of doctrine. No, be grounded and settled. You understand this morning that the right way is not always the popular way. I'd still rather be right with just a few people than be wrong with the multitudes. Amen. Let's pray. Father, we love You. We thank You for loving us. We thank You for this passage of Scripture. What great truth that You give us in Your Word. We thank You for our Savior. We thank You for who He is, God in flesh. We thank You for what He has done. We thank You for the redeeming work at Calvary, His substitutionary atonement, His death, burial, and glorious resurrection. I pray this morning that You would help Your people. We know this is Your church. church, God help us to be grounded and settled. Help us Lord to stand for truth, to contend for the faith. I pray that if there's one that's not sure of heaven, maybe they've been influenced by some false teachers, some false doctrine, maybe they've been told that there's some other way to get to heaven. I pray that this morning the truth of your word, the Holy Spirit would take it and minister as only he can. Would you be exalted in our midst during these few moments of invitation? We'll thank you for all that you'll do for it's in Christ's name we pray. Would you stand with me? Kimberly's gonna play quietly on the piano. We will have a moment of invitation here and I encourage you at home to allow the Lord to have his way in your life as you consider these truths from the Word of God. As Kimberly plays we'll have a moment of invitation.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.420000076293945,
      "text": " you through the book of Colossians, and I have thoroughly enjoyed already these several"
    },
    {
      "id": 1,
      "start": 5.420000076293945,
      "end": 10.0,
      "text": " messages that I've been able to prepare and deliver from this great book, and it's only"
    },
    {
      "id": 2,
      "start": 10.0,
      "end": 13.539999961853027,
      "text": " four chapters in the book of Colossians, and some have asked, is it really going to take"
    },
    {
      "id": 3,
      "start": 13.539999961853027,
      "end": 14.539999961853027,
      "text": " us all year?"
    },
    {
      "id": 4,
      "start": 14.539999961853027,
      "end": 19.700000762939453,
      "text": " Well, that kind of depends, and this is message number five, and we'll get through almost"
    },
    {
      "id": 5,
      "start": 19.700000762939453,
      "end": 24.139999389648438,
      "text": " the end of chapter number one today, and I have another message next week on chapter"
    },
    {
      "id": 6,
      "start": 24.139999389648438,
      "end": 28.940000534057617,
      "text": " number one, but we'll continue to make progress through this book, and you'll recall last"
    },
    {
      "id": 7,
      "start": 28.940000534057617,
      "end": 34.7400016784668,
      "text": " week as we looked at verses nine through 14 that we dealt with the truth with regard"
    },
    {
      "id": 8,
      "start": 34.7400016784668,
      "end": 39.099998474121094,
      "text": " to the prayer of Paul for the believers in Colossians."
    },
    {
      "id": 9,
      "start": 39.099998474121094,
      "end": 44.41999816894531,
      "text": " What a blessing it was to kind of dig through those verses of scripture and to see exactly"
    },
    {
      "id": 10,
      "start": 44.41999816894531,
      "end": 50.7400016784668,
      "text": " how it was that Paul was praying for them, and we think about the ministry of intercessory"
    },
    {
      "id": 11,
      "start": 50.7400016784668,
      "end": 57.459999084472656,
      "text": " prayer, the great privilege that we have to go to God on the behalf of others, and what"
    },
    {
      "id": 12,
      "start": 57.459999084472656,
      "end": 58.459999084472656,
      "text": " a blessing."
    },
    {
      "id": 13,
      "start": 58.459999084472656,
      "end": 63.13999938964844,
      "text": " As we continue to study through this book, you'll remember that as we dealt with the"
    },
    {
      "id": 14,
      "start": 63.13999938964844,
      "end": 69.0199966430664,
      "text": " prayer of Paul in verses nine through 14, we kind of said some things with regard to"
    },
    {
      "id": 15,
      "start": 69.0199966430664,
      "end": 73.62000274658203,
      "text": " the prayer, and one of the things that we said is we need to know some things about"
    },
    {
      "id": 16,
      "start": 73.62000274658203,
      "end": 78.26000213623047,
      "text": " people in order to pray for them, to engage in this ministry of intercessory prayer, and"
    },
    {
      "id": 17,
      "start": 78.26000213623047,
      "end": 83.36000061035156,
      "text": " some of what the apostle Paul knew was the fact that there were false teachers that were"
    },
    {
      "id": 18,
      "start": 83.36000061035156,
      "end": 88.83999633789062,
      "text": " present there in Colossae, and knowing that those false teachers were present, of course"
    },
    {
      "id": 19,
      "start": 88.83999633789062,
      "end": 95.16000366210938,
      "text": " he prayed that they would be spiritually mature, that they would grow in their walk with Christ,"
    },
    {
      "id": 20,
      "start": 95.16000366210938,
      "end": 100.76000213623047,
      "text": " and I often said, and I have often said over the years, and I said it last week as well,"
    },
    {
      "id": 21,
      "start": 100.76000213623047,
      "end": 105.12000274658203,
      "text": " that one of the best ways to combat false teaching is spiritual maturity, spiritual"
    },
    {
      "id": 22,
      "start": 105.12000274658203,
      "end": 106.12000274658203,
      "text": " growth."
    },
    {
      "id": 23,
      "start": 106.12000274658203,
      "end": 110.72000122070312,
      "text": " When you know the Word of God and you know the truth of God's Word, it enables you to"
    },
    {
      "id": 24,
      "start": 110.72000122070312,
      "end": 114.95999908447266,
      "text": " be able to stand against the attacks of the enemy, it enables you to be able to stand"
    },
    {
      "id": 25,
      "start": 114.95999908447266,
      "end": 118.0,
      "text": " against the subtlety of the false teachers."
    },
    {
      "id": 26,
      "start": 118.0,
      "end": 123.4800033569336,
      "text": " I know that I've said many times that they will use our vocabulary, but they use a different"
    },
    {
      "id": 27,
      "start": 123.4800033569336,
      "end": 127.08000183105469,
      "text": " definition, and so you've got to be careful with these false teachers."
    },
    {
      "id": 28,
      "start": 127.08000183105469,
      "end": 133.8800048828125,
      "text": " They're very sly and cunning, and the subtlety that you find within false teachers, and so"
    },
    {
      "id": 29,
      "start": 133.8800048828125,
      "end": 138.63999938964844,
      "text": " the apostle Paul understood that those false teachers were present, and that gives us some"
    },
    {
      "id": 30,
      "start": 138.63999938964844,
      "end": 143.52000427246094,
      "text": " understanding as to the next several verses that are before us this morning, and really"
    },
    {
      "id": 31,
      "start": 143.52000427246094,
      "end": 148.9199981689453,
      "text": " this passage of Scripture, Colossians 1, we'll be looking at verses 15 through 23, is one"
    },
    {
      "id": 32,
      "start": 148.9199981689453,
      "end": 158.0399932861328,
      "text": " of the most powerful passages in briefly describing the person of Jesus Christ, and I don't really"
    },
    {
      "id": 33,
      "start": 158.0399932861328,
      "end": 162.36000061035156,
      "text": " think you could probably go anywhere else in the New Testament and find just a handful"
    },
    {
      "id": 34,
      "start": 162.36000061035156,
      "end": 169.83999633789062,
      "text": " of verses that so powerfully gives us truth with regard to the person of Jesus Christ."
    },
    {
      "id": 35,
      "start": 169.83999633789062,
      "end": 174.24000549316406,
      "text": " Obviously, you can compare Scripture with Scripture, you can go to a whole host of passages,"
    },
    {
      "id": 36,
      "start": 174.24000549316406,
      "end": 180.0,
      "text": " but in these few verses we find that Paul is going to provide this great truth, powerful"
    },
    {
      "id": 37,
      "start": 180.0,
      "end": 185.66000366210938,
      "text": " truth, and as these false teachers were present and active in the city of Colossae, one thing"
    },
    {
      "id": 38,
      "start": 185.66000366210938,
      "end": 191.05999755859375,
      "text": " that we'd understand about false teachers is they all have one thing in common."
    },
    {
      "id": 39,
      "start": 191.3000030517578,
      "end": 196.17999267578125,
      "text": " One thing that I believe that all false teachers have in common is their attack upon the person"
    },
    {
      "id": 40,
      "start": 196.17999267578125,
      "end": 198.16000366210938,
      "text": " of Jesus Christ."
    },
    {
      "id": 41,
      "start": 198.16000366210938,
      "end": 202.3800048828125,
      "text": " And false teachers will always have… there are all sorts of things, you can look at false"
    },
    {
      "id": 42,
      "start": 202.3800048828125,
      "end": 208.6199951171875,
      "text": " teachers and you can find all sorts of various teachings and various creeds and religious"
    },
    {
      "id": 43,
      "start": 208.6199951171875,
      "end": 214.27999877929688,
      "text": " activities, if you will, that they would encourage you to be participating in, but one thing"
    },
    {
      "id": 44,
      "start": 214.27999877929688,
      "end": 219.44000244140625,
      "text": " that is common amongst false teachers is their attack upon the person of Jesus Christ."
    },
    {
      "id": 45,
      "start": 219.44000244140625,
      "end": 222.24000549316406,
      "text": " We can ask ourselves this morning, why is that?"
    },
    {
      "id": 46,
      "start": 222.24000549316406,
      "end": 228.39999389648438,
      "text": " Why is there unity amongst the false teachers on this one point of an attack upon the person"
    },
    {
      "id": 47,
      "start": 228.39999389648438,
      "end": 229.52000427246094,
      "text": " of Jesus Christ?"
    },
    {
      "id": 48,
      "start": 229.52000427246094,
      "end": 236.36000061035156,
      "text": " Well, if the enemy is able to cause people to err regarding the person and work of Jesus"
    },
    {
      "id": 49,
      "start": 236.36000061035156,
      "end": 241.75999450683594,
      "text": " Christ, we understand that the consequences are grave and eternal."
    },
    {
      "id": 50,
      "start": 241.75999450683594,
      "end": 246.32000732421875,
      "text": " And so therefore, there's this unity, if you will, amongst these false teachers on"
    },
    {
      "id": 51,
      "start": 246.32000732421875,
      "end": 251.44000244140625,
      "text": " the attack against the person and work of the Lord Jesus Christ."
    },
    {
      "id": 52,
      "start": 251.44000244140625,
      "end": 255.60000610351562,
      "text": " Usually false teachers will not deny the existence of Jesus Christ."
    },
    {
      "id": 53,
      "start": 255.60000610351562,
      "end": 259.32000732421875,
      "text": " They won't try to come in and say, no, Jesus doesn't exist, and he's just… no, no, they'll"
    },
    {
      "id": 54,
      "start": 259.32000732421875,
      "end": 264.239990234375,
      "text": " just not give the fullness of who Jesus really is."
    },
    {
      "id": 55,
      "start": 264.239990234375,
      "end": 270.55999755859375,
      "text": " They're okay, false teachers are okay with someone believing that Jesus existed, they're"
    },
    {
      "id": 56,
      "start": 270.55999755859375,
      "end": 275.3999938964844,
      "text": " okay with somebody saying that he was a good man, that he was even a prophet, but they're"
    },
    {
      "id": 57,
      "start": 275.4800109863281,
      "end": 281.3999938964844,
      "text": " not okay with saying that he is the Son of God and the only Savior for mankind, and that"
    },
    {
      "id": 58,
      "start": 281.3999938964844,
      "end": 285.2799987792969,
      "text": " of course is what we find the Word of God to clearly teach us."
    },
    {
      "id": 59,
      "start": 285.2799987792969,
      "end": 289.7799987792969,
      "text": " And so therefore, this attack upon who he is."
    },
    {
      "id": 60,
      "start": 289.7799987792969,
      "end": 294.7200012207031,
      "text": " If you'll remember on Wednesday evening, several weeks ago, we began studying about the doctrine"
    },
    {
      "id": 61,
      "start": 294.7200012207031,
      "end": 299.1600036621094,
      "text": " of Christ, and one of the passages in which we started with was there in Matthew when"
    },
    {
      "id": 62,
      "start": 299.1600036621094,
      "end": 305.0799865722656,
      "text": " the Lord Jesus Christ said to the disciples, whom do men say that I, the Son of Man, am?"
    },
    {
      "id": 63,
      "start": 305.0799865722656,
      "end": 310.9200134277344,
      "text": " And of course, the disciples provided an answer, and in that answer, what was revealed not"
    },
    {
      "id": 64,
      "start": 310.9200134277344,
      "end": 316.1199951171875,
      "text": " only to the Lord, of course he already knew it, but their acknowledgment would also reveal"
    },
    {
      "id": 65,
      "start": 316.1199951171875,
      "end": 322.739990234375,
      "text": " to them, and it reveals to us, that there was confusion with regard to who Jesus is."
    },
    {
      "id": 66,
      "start": 322.739990234375,
      "end": 326.1199951171875,
      "text": " Some say that you're John the Baptist, some say that you're one of the prophets, Elijah"
    },
    {
      "id": 67,
      "start": 326.1199951171875,
      "end": 333.1199951171875,
      "text": " or Jeremiah or one of the others, and there was confusion about who Jesus is, and we find"
    },
    {
      "id": 68,
      "start": 333.1199951171875,
      "end": 336.7200012207031,
      "text": " that still today, that confusion exists."
    },
    {
      "id": 69,
      "start": 336.7200012207031,
      "end": 341.20001220703125,
      "text": " And of course, Jesus then turns the attention to his disciples and he says, but whom say"
    },
    {
      "id": 70,
      "start": 341.20001220703125,
      "end": 343.5799865722656,
      "text": " ye that I am?"
    },
    {
      "id": 71,
      "start": 343.5799865722656,
      "end": 349.79998779296875,
      "text": " And Peter stood with great confidence and boldness and he said, thou art the Christ,"
    },
    {
      "id": 72,
      "start": 349.79998779296875,
      "end": 352.3999938964844,
      "text": " the Son of the living God."
    },
    {
      "id": 73,
      "start": 352.4800109863281,
      "end": 357.9599914550781,
      "text": " What a great declaration, a powerful truth that was revealed there in the Gospel of Matthew,"
    },
    {
      "id": 74,
      "start": 357.9599914550781,
      "end": 363.3999938964844,
      "text": " and we find that here in Colossae, the Greek philosophers and the Gnostics, they really"
    },
    {
      "id": 75,
      "start": 363.3999938964844,
      "end": 366.9599914550781,
      "text": " didn't believe, they didn't really mind if people believed in Jesus."
    },
    {
      "id": 76,
      "start": 366.9599914550781,
      "end": 369.0799865722656,
      "text": " I mean, think about the timing."
    },
    {
      "id": 77,
      "start": 369.0799865722656,
      "end": 375.6400146484375,
      "text": " This is being written nearly 25 to 35 years after the crucifixion and resurrection of"
    },
    {
      "id": 78,
      "start": 375.6400146484375,
      "end": 377.0,
      "text": " Jesus Christ."
    },
    {
      "id": 79,
      "start": 377.0,
      "end": 383.5199890136719,
      "text": " No doubt there were people that knew that Jesus existed."
    },
    {
      "id": 80,
      "start": 383.5199890136719,
      "end": 388.760009765625,
      "text": " They didn't mind if you believed that Jesus existed, as long as you did not believe that"
    },
    {
      "id": 81,
      "start": 388.760009765625,
      "end": 392.0,
      "text": " he was God in flesh and the Savior of the world."
    },
    {
      "id": 82,
      "start": 392.0,
      "end": 397.239990234375,
      "text": " Therefore, Paul declares powerfully and concisely who Christ is."
    },
    {
      "id": 83,
      "start": 397.239990234375,
      "end": 401.8399963378906,
      "text": " It is important for us to note that as we look at this passage of Scripture, that Paul"
    },
    {
      "id": 84,
      "start": 401.8399963378906,
      "end": 406.1600036621094,
      "text": " actually did not go forth and attack the false teaching."
    },
    {
      "id": 85,
      "start": 406.1600036621094,
      "end": 407.6400146484375,
      "text": " You know what he did?"
    },
    {
      "id": 86,
      "start": 407.6400146484375,
      "end": 412.9599914550781,
      "text": " He just exalted the Lord Jesus Christ, and he showed who Jesus is."
    },
    {
      "id": 87,
      "start": 412.9599914550781,
      "end": 418.1600036621094,
      "text": " See, one of the things, I took some classes in seminary Bible college that deal with all"
    },
    {
      "id": 88,
      "start": 418.1600036621094,
      "end": 423.0799865722656,
      "text": " of the coltonisms and what have you, and they try to prepare you on how to talk to people"
    },
    {
      "id": 89,
      "start": 423.0799865722656,
      "end": 426.5199890136719,
      "text": " with different perspectives and what have you, and you know what I've learned in life?"
    },
    {
      "id": 90,
      "start": 426.5199890136719,
      "end": 431.239990234375,
      "text": " I've learned, not to say that the classes were of no value, but what I've learned in"
    },
    {
      "id": 91,
      "start": 431.6400146484375,
      "end": 436.8800048828125,
      "text": " life is that if we would simply just exalt the Lord Jesus Christ, I don't need to answer"
    },
    {
      "id": 92,
      "start": 436.8800048828125,
      "end": 441.7200012207031,
      "text": " all of the questions of the false teachers, I don't need to deal with all of those things,"
    },
    {
      "id": 93,
      "start": 441.7200012207031,
      "end": 445.32000732421875,
      "text": " I simply need to elevate and exalt our Savior."
    },
    {
      "id": 94,
      "start": 445.32000732421875,
      "end": 451.5199890136719,
      "text": " Now, knowing some of those things may help us, but I've found in life that often, as"
    },
    {
      "id": 95,
      "start": 451.5199890136719,
      "end": 458.1199951171875,
      "text": " we would deal with some of those particular aspects of maybe a cult or a false teacher,"
    },
    {
      "id": 96,
      "start": 458.1199951171875,
      "end": 462.79998779296875,
      "text": " we can find ourselves winning an argument, or engaged in an argument, but never actually"
    },
    {
      "id": 97,
      "start": 462.79998779296875,
      "end": 469.1400146484375,
      "text": " able to present who Jesus is in a fashion in which they might come to a saving knowledge"
    },
    {
      "id": 98,
      "start": 469.1400146484375,
      "end": 471.0799865722656,
      "text": " of our Lord and Savior Jesus Christ."
    },
    {
      "id": 99,
      "start": 471.0799865722656,
      "end": 472.0799865722656,
      "text": " Why?"
    },
    {
      "id": 100,
      "start": 472.0799865722656,
      "end": 476.8800048828125,
      "text": " Because we just want to argue about the points of what their religion teaches versus what"
    },
    {
      "id": 101,
      "start": 476.8800048828125,
      "end": 480.8800048828125,
      "text": " the Bible teaches, and we just begin to get in an argument, and you'll find very few people"
    },
    {
      "id": 102,
      "start": 480.8800048828125,
      "end": 483.8399963378906,
      "text": " are willing to acknowledge that they're wrong."
    },
    {
      "id": 103,
      "start": 483.8399963378906,
      "end": 486.3999938964844,
      "text": " So we just exalt Christ, and we just elevate Christ."
    },
    {
      "id": 104,
      "start": 486.3999938964844,
      "end": 490.7200012207031,
      "text": " If you're taking notes this morning, that's what I've titled the message, The Exalted"
    },
    {
      "id": 105,
      "start": 490.7200012207031,
      "end": 491.7200012207031,
      "text": " Christ."
    },
    {
      "id": 106,
      "start": 491.7200012207031,
      "end": 492.7200012207031,
      "text": " The Exalted Christ."
    },
    {
      "id": 107,
      "start": 492.7200012207031,
      "end": 495.9599914550781,
      "text": " In this passage of Scripture, I want you to notice, if you're taking notes, number one,"
    },
    {
      "id": 108,
      "start": 495.9599914550781,
      "end": 497.79998779296875,
      "text": " the way that Christ is described."
    },
    {
      "id": 109,
      "start": 497.79998779296875,
      "end": 501.7200012207031,
      "text": " Notice with me in verse number 12, really, we'll kind of start there."
    },
    {
      "id": 110,
      "start": 501.7200012207031,
      "end": 506.2200012207031,
      "text": " I know that the passage will deal with primarily verses 15 through 23, but let's go back to"
    },
    {
      "id": 111,
      "start": 506.2200012207031,
      "end": 507.2200012207031,
      "text": " verse number 12."
    },
    {
      "id": 112,
      "start": 507.2200012207031,
      "end": 512.719970703125,
      "text": " The Bible says this, giving thanks unto the Father which hath made us meet, to be partakers"
    },
    {
      "id": 113,
      "start": 512.719970703125,
      "end": 518.8400268554688,
      "text": " of the inheritance of the saints in light, who hath delivered us from the power of darkness,"
    },
    {
      "id": 114,
      "start": 518.8400268554688,
      "end": 525.3599853515625,
      "text": " and hath translated us into the kingdom of his dear Son, in whom we have redemption through"
    },
    {
      "id": 115,
      "start": 525.3599853515625,
      "end": 528.97998046875,
      "text": " his blood, even the forgiveness of sins."
    },
    {
      "id": 116,
      "start": 528.97998046875,
      "end": 532.9400024414062,
      "text": " Who is, and so the reason why I start it there back in verse number 12 is because you do"
    },
    {
      "id": 117,
      "start": 532.9400024414062,
      "end": 537.0800170898438,
      "text": " begin in verse number 15, and it says, who is the image of the invisible God."
    },
    {
      "id": 118,
      "start": 537.0800170898438,
      "end": 540.8400268554688,
      "text": " We understand that he's referring back to his dear Son that is mentioned at the end"
    },
    {
      "id": 119,
      "start": 540.8400268554688,
      "end": 545.4600219726562,
      "text": " of verse number 13, and it's carried through, he's referring to the Lord Jesus Christ."
    },
    {
      "id": 120,
      "start": 545.4600219726562,
      "end": 551.47998046875,
      "text": " He is the image of the invisible God, the firstborn of every creature, for by him were"
    },
    {
      "id": 121,
      "start": 551.47998046875,
      "end": 556.3599853515625,
      "text": " all things created that are in heaven and that are in earth, visible and invisible,"
    },
    {
      "id": 122,
      "start": 556.3599853515625,
      "end": 562.5999755859375,
      "text": " whether they be thrones or dominions or principalities or powers, all things were created by him"
    },
    {
      "id": 123,
      "start": 562.5999755859375,
      "end": 564.5599975585938,
      "text": " and for him."
    },
    {
      "id": 124,
      "start": 564.5599975585938,
      "end": 570.0599975585938,
      "text": " And he is before all things, and by him all things consist."
    },
    {
      "id": 125,
      "start": 570.0599975585938,
      "end": 574.4199829101562,
      "text": " And he is the head of the body, the church, who is the beginning, the firstborn from"
    },
    {
      "id": 126,
      "start": 574.4199829101562,
      "end": 580.3400268554688,
      "text": " the dead, that in all things he might have the preeminence, for it pleased the Father"
    },
    {
      "id": 127,
      "start": 580.3400268554688,
      "end": 585.5,
      "text": " that in him should all fullness dwell."
    },
    {
      "id": 128,
      "start": 585.5,
      "end": 590.4600219726562,
      "text": " And having made peace through the blood of his cross, by him, to reconcile all things"
    },
    {
      "id": 129,
      "start": 590.4600219726562,
      "end": 596.97998046875,
      "text": " unto himself, by him I say, whether they be things in earth or things in heaven, and you,"
    },
    {
      "id": 130,
      "start": 596.97998046875,
      "end": 600.219970703125,
      "text": " that were sometime alienated and enemies in your mind."
    },
    {
      "id": 0,
      "start": 600.219970703125,
      "end": 605.6999707221985,
      "text": " by wicked works, yet now hath He reconciled"
    },
    {
      "id": 1,
      "start": 605.6999707221985,
      "end": 607.8199706077576,
      "text": " the body of His flesh through death"
    },
    {
      "id": 2,
      "start": 607.8199706077576,
      "end": 610.4999704360962,
      "text": " to present you holy and unblameable"
    },
    {
      "id": 3,
      "start": 610.4999704360962,
      "end": 612.8199710845947,
      "text": " and unreprovable in His sight."
    },
    {
      "id": 4,
      "start": 612.8199710845947,
      "end": 615.5799703598022,
      "text": " If ye continue in the faith grounded and settled,"
    },
    {
      "id": 5,
      "start": 615.5799703598022,
      "end": 617.5399703979492,
      "text": " and be not moved away from the hope"
    },
    {
      "id": 6,
      "start": 617.5399703979492,
      "end": 619.9399700164795,
      "text": " of the Gospel which ye have heard,"
    },
    {
      "id": 7,
      "start": 619.9399700164795,
      "end": 621.7399711608887,
      "text": " which was preached to every creature"
    },
    {
      "id": 8,
      "start": 621.7399711608887,
      "end": 623.139970779419,
      "text": " which is under heaven,"
    },
    {
      "id": 9,
      "start": 623.139970779419,
      "end": 626.5199699401855,
      "text": " whereof I, Paul, am made a minister.\""
    },
    {
      "id": 10,
      "start": 626.5199699401855,
      "end": 628.1799697875977,
      "text": " Number one, if you're taking notes,"
    },
    {
      "id": 11,
      "start": 628.1799697875977,
      "end": 630.9199714660645,
      "text": " notice the way Christ is described."
    },
    {
      "id": 12,
      "start": 630.9199714660645,
      "end": 632.6399688720703,
      "text": " The way that He is described."
    },
    {
      "id": 13,
      "start": 632.6399688720703,
      "end": 635.2399711608887,
      "text": " Number one, we find right here in v. 15"
    },
    {
      "id": 14,
      "start": 635.2399711608887,
      "end": 637.4399719238281,
      "text": " and really down through a number of verses,"
    },
    {
      "id": 15,
      "start": 637.4399719238281,
      "end": 638.8799705505371,
      "text": " v. 19 in particular,"
    },
    {
      "id": 16,
      "start": 638.8799705505371,
      "end": 641.2399711608887,
      "text": " but the first way in which He is described"
    },
    {
      "id": 17,
      "start": 641.2399711608887,
      "end": 644.9999694824219,
      "text": " is that He is the image of the invisible God."
    },
    {
      "id": 18,
      "start": 644.9999694824219,
      "end": 647.3199691772461,
      "text": " John 4 and v. 24 when Jesus is meeting"
    },
    {
      "id": 19,
      "start": 647.3199691772461,
      "end": 648.9799690246582,
      "text": " with the woman of the well there"
    },
    {
      "id": 20,
      "start": 648.9799690246582,
      "end": 650.659969329834,
      "text": " when He says that He must needs go"
    },
    {
      "id": 21,
      "start": 650.659969329834,
      "end": 652.9799690246582,
      "text": " through Samaria, He's having that conversation."
    },
    {
      "id": 22,
      "start": 652.9799690246582,
      "end": 654.8799705505371,
      "text": " And in John 4 and v. 24,"
    },
    {
      "id": 23,
      "start": 654.8799705505371,
      "end": 657.3799705505371,
      "text": " the Bible says that God is a Spirit."
    },
    {
      "id": 24,
      "start": 657.3999710083008,
      "end": 659.3599700927734,
      "text": " They that worship Him must worship Him"
    },
    {
      "id": 25,
      "start": 659.3599700927734,
      "end": 661.9199714660645,
      "text": " in spirit and in truth."
    },
    {
      "id": 26,
      "start": 661.9199714660645,
      "end": 663.3999710083008,
      "text": " And so we find that Paul,"
    },
    {
      "id": 27,
      "start": 663.3999710083008,
      "end": 666.599967956543,
      "text": " as he's elevating and exalting the Lord Jesus Christ,"
    },
    {
      "id": 28,
      "start": 666.599967956543,
      "end": 668.6399688720703,
      "text": " the first manner in which he describes"
    },
    {
      "id": 29,
      "start": 668.6399688720703,
      "end": 671.9399719238281,
      "text": " our wonderful Savior is that He is the image"
    },
    {
      "id": 30,
      "start": 671.9399719238281,
      "end": 673.2799682617188,
      "text": " of the invisible God."
    },
    {
      "id": 31,
      "start": 673.2799682617188,
      "end": 674.9199676513672,
      "text": " That word image is important."
    },
    {
      "id": 32,
      "start": 674.9199676513672,
      "end": 676.7599716186523,
      "text": " It means the likeness."
    },
    {
      "id": 33,
      "start": 676.7599716186523,
      "end": 679.3599700927734,
      "text": " It really means the manifestation."
    },
    {
      "id": 34,
      "start": 679.3599700927734,
      "end": 681.2399673461914,
      "text": " And it helps us to understand"
    },
    {
      "id": 35,
      "start": 681.2399673461914,
      "end": 683.6399688720703,
      "text": " what the Apostle Paul is saying here."
    },
    {
      "id": 36,
      "start": 683.6399688720703,
      "end": 686.7999725341797,
      "text": " And it helps us to understand the deity of Christ."
    },
    {
      "id": 37,
      "start": 686.8199691772461,
      "end": 689.3199691772461,
      "text": " Again, as we compare Scripture with Scripture,"
    },
    {
      "id": 38,
      "start": 689.3199691772461,
      "end": 693.7799682617188,
      "text": " what Paul is saying to these believers in Colossae"
    },
    {
      "id": 39,
      "start": 693.7799682617188,
      "end": 696.8999710083008,
      "text": " is that Jesus is God."
    },
    {
      "id": 40,
      "start": 696.8999710083008,
      "end": 700.1399688720703,
      "text": " That He is the very God in flesh."
    },
    {
      "id": 41,
      "start": 700.1399688720703,
      "end": 702.8199691772461,
      "text": " That He is the image of the invisible God."
    },
    {
      "id": 42,
      "start": 702.8199691772461,
      "end": 705.1799697875977,
      "text": " You understand that at the incarnation,"
    },
    {
      "id": 43,
      "start": 705.1799697875977,
      "end": 706.9799728393555,
      "text": " He did not become God."
    },
    {
      "id": 44,
      "start": 706.9799728393555,
      "end": 708.9599685668945,
      "text": " He is not like God."
    },
    {
      "id": 45,
      "start": 708.9599685668945,
      "end": 710.4999694824219,
      "text": " He is God."
    },
    {
      "id": 46,
      "start": 710.4999694824219,
      "end": 714.2599716186523,
      "text": " And He always has been and forever will be."
    },
    {
      "id": 47,
      "start": 714.2599716186523,
      "end": 715.8999710083008,
      "text": " He is God."
    },
    {
      "id": 48,
      "start": 715.9199676513672,
      "end": 718.6799697875977,
      "text": " And we find that the Bible would reveal to us"
    },
    {
      "id": 49,
      "start": 718.6799697875977,
      "end": 723.3999710083008,
      "text": " that Jesus manifested God to people."
    },
    {
      "id": 50,
      "start": 723.3999710083008,
      "end": 726.0599670410156,
      "text": " See, we mentioned already that John 4 and verse 24,"
    },
    {
      "id": 51,
      "start": 726.0599670410156,
      "end": 727.3999710083008,
      "text": " God is a spirit."
    },
    {
      "id": 52,
      "start": 727.3999710083008,
      "end": 731.5599670410156,
      "text": " And so we find that as Jesus would manifest the Father,"
    },
    {
      "id": 53,
      "start": 731.5599670410156,
      "end": 733.719970703125,
      "text": " and He uses that terminology often"
    },
    {
      "id": 54,
      "start": 733.719970703125,
      "end": 735.6799774169922,
      "text": " in the book of John in particular,"
    },
    {
      "id": 55,
      "start": 735.6799774169922,
      "end": 737.0799713134766,
      "text": " and that word manifest,"
    },
    {
      "id": 56,
      "start": 737.0799713134766,
      "end": 740.6399688720703,
      "text": " it means to make known or visible."
    },
    {
      "id": 57,
      "start": 740.6399688720703,
      "end": 743.0799713134766,
      "text": " To make known or to make visible."
    },
    {
      "id": 58,
      "start": 743.0799713134766,
      "end": 745.3599700927734,
      "text": " And so if God is a spirit,"
    },
    {
      "id": 59,
      "start": 745.3599700927734,
      "end": 747.6199645996094,
      "text": " we find that Jesus as God,"
    },
    {
      "id": 60,
      "start": 747.6199645996094,
      "end": 751.4999694824219,
      "text": " when He was robed in human flesh at the incarnation,"
    },
    {
      "id": 61,
      "start": 751.4999694824219,
      "end": 753.5999755859375,
      "text": " He did not cease to be God."
    },
    {
      "id": 62,
      "start": 753.5999755859375,
      "end": 757.2799682617188,
      "text": " He continued to be God because He is God."
    },
    {
      "id": 63,
      "start": 757.2799682617188,
      "end": 760.8199768066406,
      "text": " And He manifested, He made known"
    },
    {
      "id": 64,
      "start": 760.8199768066406,
      "end": 765.1399688720703,
      "text": " or made visible what God is or who God is."
    },
    {
      "id": 65,
      "start": 765.1399688720703,
      "end": 767.0999755859375,
      "text": " And we find that in John 1,"
    },
    {
      "id": 66,
      "start": 767.0999755859375,
      "end": 768.6799774169922,
      "text": " hold your place here in the book of Colossians."
    },
    {
      "id": 67,
      "start": 768.6799774169922,
      "end": 770.6199645996094,
      "text": " We'll look at a few verses in the book of John."
    },
    {
      "id": 68,
      "start": 770.6199645996094,
      "end": 773.5999755859375,
      "text": " And I want you to notice in John 1,"
    },
    {
      "id": 69,
      "start": 773.6199645996094,
      "end": 775.9599761962891,
      "text": " a passage in which we often reference"
    },
    {
      "id": 70,
      "start": 775.9599761962891,
      "end": 779.1799774169922,
      "text": " with regard to the incarnation and what power it is."
    },
    {
      "id": 71,
      "start": 779.1799774169922,
      "end": 782.0999755859375,
      "text": " We'll look at the first three verses in just a moment,"
    },
    {
      "id": 72,
      "start": 782.0999755859375,
      "end": 784.9799652099609,
      "text": " but I want you to look at verse number 14 with me here"
    },
    {
      "id": 73,
      "start": 784.9799652099609,
      "end": 787.4199676513672,
      "text": " as we speak about the Lord Jesus Christ"
    },
    {
      "id": 74,
      "start": 787.4199676513672,
      "end": 790.1399688720703,
      "text": " being the image of the invisible God."
    },
    {
      "id": 75,
      "start": 790.1399688720703,
      "end": 791.6599731445312,
      "text": " The Bible says in verse number 14,"
    },
    {
      "id": 76,
      "start": 791.6599731445312,
      "end": 793.8599700927734,
      "text": " and the Word was made flesh."
    },
    {
      "id": 77,
      "start": 793.8599700927734,
      "end": 796.3399658203125,
      "text": " Now we know in the beginning of this chapter"
    },
    {
      "id": 78,
      "start": 796.3399658203125,
      "end": 798.9399719238281,
      "text": " that the Bible tells us that in the beginning was the Word"
    },
    {
      "id": 79,
      "start": 798.9399719238281,
      "end": 801.8999633789062,
      "text": " and the Word was with God and the Word was God."
    },
    {
      "id": 80,
      "start": 801.8999633789062,
      "end": 804.3599700927734,
      "text": " And so Jesus is the Word of God."
    },
    {
      "id": 81,
      "start": 804.3599700927734,
      "end": 806.719970703125,
      "text": " It's a name that was assigned to Him."
    },
    {
      "id": 82,
      "start": 806.719970703125,
      "end": 808.3199768066406,
      "text": " And He, it says this,"
    },
    {
      "id": 83,
      "start": 808.3199768066406,
      "end": 811.7999725341797,
      "text": " the Word was made flesh and dwelt among us,"
    },
    {
      "id": 84,
      "start": 811.7999725341797,
      "end": 814.0399780273438,
      "text": " tabernacled among us."
    },
    {
      "id": 85,
      "start": 814.0399780273438,
      "end": 818.1199645996094,
      "text": " And it says here, and we beheld His glory,"
    },
    {
      "id": 86,
      "start": 818.1199645996094,
      "end": 820.719970703125,
      "text": " the glory as of the only begotten of the Father,"
    },
    {
      "id": 87,
      "start": 820.719970703125,
      "end": 822.3199768066406,
      "text": " full of grace and truth."
    },
    {
      "id": 88,
      "start": 822.3199768066406,
      "end": 823.9999694824219,
      "text": " How could they behold His glory?"
    },
    {
      "id": 89,
      "start": 823.9999694824219,
      "end": 826.0799713134766,
      "text": " Because He manifested Himself, right?"
    },
    {
      "id": 90,
      "start": 826.0799713134766,
      "end": 827.4999694824219,
      "text": " He made it visible."
    },
    {
      "id": 91,
      "start": 827.4999694824219,
      "end": 830.4399719238281,
      "text": " He made it known through the incarnation."
    },
    {
      "id": 92,
      "start": 830.4399719238281,
      "end": 831.9799652099609,
      "text": " Look at verse number 18."
    },
    {
      "id": 93,
      "start": 831.9799652099609,
      "end": 835.3399658203125,
      "text": " No man hath seen God at any time."
    },
    {
      "id": 94,
      "start": 835.3399658203125,
      "end": 836.9799652099609,
      "text": " The only begotten Son,"
    },
    {
      "id": 95,
      "start": 836.9799652099609,
      "end": 838.8999633789062,
      "text": " which is in the bosom of the Father,"
    },
    {
      "id": 96,
      "start": 838.8999633789062,
      "end": 841.6199645996094,
      "text": " He hath declared Him."
    },
    {
      "id": 97,
      "start": 841.6199645996094,
      "end": 843.8999633789062,
      "text": " In John chapter number 17,"
    },
    {
      "id": 98,
      "start": 843.8999633789062,
      "end": 847.4799652099609,
      "text": " we find that the Bible makes this truth known to us"
    },
    {
      "id": 99,
      "start": 847.4799652099609,
      "end": 850.3799743652344,
      "text": " with regard to the day in which Jesus,"
    },
    {
      "id": 100,
      "start": 850.3799743652344,
      "end": 852.0599670410156,
      "text": " He says the hour is now come."
    },
    {
      "id": 101,
      "start": 852.0599670410156,
      "end": 854.0999755859375,
      "text": " He would soon go to the cross of Calvary."
    },
    {
      "id": 102,
      "start": 854.0999755859375,
      "end": 856.97998046875,
      "text": " And as He's praying here in this passage of Scripture,"
    },
    {
      "id": 103,
      "start": 856.97998046875,
      "end": 859.8999633789062,
      "text": " many wonderful things are revealed to us here,"
    },
    {
      "id": 104,
      "start": 859.9199829101562,
      "end": 862.9999694824219,
      "text": " but we find that just as Colossians 1"
    },
    {
      "id": 105,
      "start": 862.9999694824219,
      "end": 865.5399780273438,
      "text": " deals with the eternality of Christ,"
    },
    {
      "id": 106,
      "start": 865.5399780273438,
      "end": 869.2399597167969,
      "text": " so also John 17 deals with the eternality of Christ."
    },
    {
      "id": 107,
      "start": 869.2399597167969,
      "end": 872.6799621582031,
      "text": " Just as Colossians 1 deals with the fact"
    },
    {
      "id": 108,
      "start": 872.6799621582031,
      "end": 873.9399719238281,
      "text": " that He is the image,"
    },
    {
      "id": 109,
      "start": 873.9399719238281,
      "end": 876.3599853515625,
      "text": " the manifestation of the invisible God,"
    },
    {
      "id": 110,
      "start": 876.3599853515625,
      "end": 879.1199645996094,
      "text": " so also we find that truth in John 17."
    },
    {
      "id": 111,
      "start": 879.1199645996094,
      "end": 880.7799682617188,
      "text": " Notice in verse number five,"
    },
    {
      "id": 112,
      "start": 880.7799682617188,
      "end": 882.3199768066406,
      "text": " Jesus says this,"
    },
    {
      "id": 113,
      "start": 882.3199768066406,
      "end": 887.3199768066406,
      "text": " and now, O Father, glorify Thou me with Thine own self,"
    },
    {
      "id": 114,
      "start": 887.7399597167969,
      "end": 888.7999572753906,
      "text": " notice this,"
    },
    {
      "id": 115,
      "start": 888.8199768066406,
      "end": 891.9999694824219,
      "text": " with the glory which I had with Thee"
    },
    {
      "id": 116,
      "start": 891.9999694824219,
      "end": 895.4399719238281,
      "text": " before the world was."
    },
    {
      "id": 117,
      "start": 895.4399719238281,
      "end": 897.219970703125,
      "text": " The eternality of Christ,"
    },
    {
      "id": 118,
      "start": 897.219970703125,
      "end": 899.4999694824219,
      "text": " we see that over in the book of Colossians,"
    },
    {
      "id": 119,
      "start": 899.4999694824219,
      "end": 900.5799560546875,
      "text": " stay here in John,"
    },
    {
      "id": 120,
      "start": 900.5799560546875,
      "end": 903.0999755859375,
      "text": " I'm gonna read another couple of verses here,"
    },
    {
      "id": 121,
      "start": 903.0999755859375,
      "end": 905.8999633789062,
      "text": " but in the book of Colossians in chapter number one,"
    },
    {
      "id": 122,
      "start": 905.8999633789062,
      "end": 908.7999572753906,
      "text": " we see the eternality of Christ in verse number 17"
    },
    {
      "id": 123,
      "start": 908.7999572753906,
      "end": 912.0599670410156,
      "text": " when the Bible says He is before all things,"
    },
    {
      "id": 124,
      "start": 912.0599670410156,
      "end": 915.3799743652344,
      "text": " and by Him all things consist."
    },
    {
      "id": 125,
      "start": 916.3599853515625,
      "end": 918.8399658203125,
      "text": " So in John 17, in verse number five,"
    },
    {
      "id": 126,
      "start": 918.8399658203125,
      "end": 920.0799560546875,
      "text": " we see the eternality,"
    },
    {
      "id": 127,
      "start": 920.0799560546875,
      "end": 921.5999755859375,
      "text": " and then we see the manifestation,"
    },
    {
      "id": 128,
      "start": 921.5999755859375,
      "end": 924.1999816894531,
      "text": " look in verse number six of John 17,"
    },
    {
      "id": 129,
      "start": 924.1999816894531,
      "end": 925.1399841308594,
      "text": " the Bible says this,"
    },
    {
      "id": 130,
      "start": 925.1399841308594,
      "end": 925.97998046875,
      "text": " Jesus said,"
    },
    {
      "id": 131,
      "start": 925.97998046875,
      "end": 929.3199768066406,
      "text": " I have manifested Thy name unto the men"
    },
    {
      "id": 132,
      "start": 929.3199768066406,
      "end": 931.9199829101562,
      "text": " which Thou gavest me out of the world."
    },
    {
      "id": 133,
      "start": 931.9199829101562,
      "end": 933.0799560546875,
      "text": " Thine they were,"
    },
    {
      "id": 134,
      "start": 933.0799560546875,
      "end": 935.2799682617188,
      "text": " and Thou gavest them me,"
    },
    {
      "id": 135,
      "start": 935.2799682617188,
      "end": 937.7999572753906,
      "text": " and they have kept Thy word."
    },
    {
      "id": 136,
      "start": 937.7999572753906,
      "end": 940.47998046875,
      "text": " Again, that word manifest means to make known"
    },
    {
      "id": 137,
      "start": 940.47998046875,
      "end": 941.9199829101562,
      "text": " or make visible,"
    },
    {
      "id": 138,
      "start": 941.9199829101562,
      "end": 944.8599853515625,
      "text": " and so Jesus, often as He was walking"
    },
    {
      "id": 139,
      "start": 944.8599853515625,
      "end": 947.7599792480469,
      "text": " upon the earth during His earthly ministry,"
    },
    {
      "id": 140,
      "start": 947.7599792480469,
      "end": 950.2799682617188,
      "text": " He made the claim of deity,"
    },
    {
      "id": 141,
      "start": 950.2799682617188,
      "end": 953.0399780273438,
      "text": " and we understand that He made the claim of deity"
    },
    {
      "id": 142,
      "start": 953.0399780273438,
      "end": 954.9999694824219,
      "text": " because often the religious leaders"
    },
    {
      "id": 143,
      "start": 954.9999694824219,
      "end": 957.3199768066406,
      "text": " were ready to stone Him and kill Him"
    },
    {
      "id": 144,
      "start": 957.3199768066406,
      "end": 958.6599731445312,
      "text": " because of the statements,"
    },
    {
      "id": 145,
      "start": 958.6599731445312,
      "end": 960.719970703125,
      "text": " the declarations that He made,"
    },
    {
      "id": 146,
      "start": 960.719970703125,
      "end": 963.9999694824219,
      "text": " and so we find not only does the Bible tell us here"
    },
    {
      "id": 147,
      "start": 963.9999694824219,
      "end": 965.6799621582031,
      "text": " in Colossians 1 and 15"
    },
    {
      "id": 148,
      "start": 965.6799621582031,
      "end": 967.9999694824219,
      "text": " that He is the image of the invisible God,"
    },
    {
      "id": 149,
      "start": 967.9999694824219,
      "end": 971.47998046875,
      "text": " I want you to notice what is said in verse number 19,"
    },
    {
      "id": 150,
      "start": 971.47998046875,
      "end": 973.7399597167969,
      "text": " we'll read the rest of verse 15 here in just a moment,"
    },
    {
      "id": 151,
      "start": 973.7599792480469,
      "end": 976.719970703125,
      "text": " but look and skip down to verse number 19."
    },
    {
      "id": 152,
      "start": 976.719970703125,
      "end": 978.1999816894531,
      "text": " Notice what it says,"
    },
    {
      "id": 153,
      "start": 978.1999816894531,
      "end": 980.8599853515625,
      "text": " for it pleased the Father."
    },
    {
      "id": 154,
      "start": 980.8599853515625,
      "end": 984.0799560546875,
      "text": " Now, you understand that as we look here"
    },
    {
      "id": 155,
      "start": 984.0799560546875,
      "end": 985.4399719238281,
      "text": " at this passage of Scripture,"
    },
    {
      "id": 156,
      "start": 985.4399719238281,
      "end": 989.0799560546875,
      "text": " and we begin to see the Trinity or the triunity,"
    },
    {
      "id": 157,
      "start": 989.0799560546875,
      "end": 990.4399719238281,
      "text": " and we see that the Bible says"
    },
    {
      "id": 158,
      "start": 990.4399719238281,
      "end": 991.8399658203125,
      "text": " that it pleased the Father,"
    },
    {
      "id": 159,
      "start": 991.8399658203125,
      "end": 995.5599670410156,
      "text": " that in Him, speaking of Jesus Christ,"
    },
    {
      "id": 160,
      "start": 995.5599670410156,
      "end": 999.2399597167969,
      "text": " His Son, as He mentions in verse number 13,"
    },
    {
      "id": 161,
      "start": 999.2399597167969,
      "end": 1001.5199584960938,
      "text": " when it talks about the kingdom of His dear Son,"
    },
    {
      "id": 162,
      "start": 1001.5199584960938,
      "end": 1003.8599853515625,
      "text": " we see that the Bible says that it pleased the Father,"
    },
    {
      "id": 163,
      "start": 1003.8599853515625,
      "end": 1006.6799621582031,
      "text": " that in Him, notice this phrase,"
    },
    {
      "id": 164,
      "start": 1006.6799621582031,
      "end": 1011.0599670410156,
      "text": " should all fullness dwell."
    },
    {
      "id": 165,
      "start": 1011.0599670410156,
      "end": 1016.0599670410156,
      "text": " Now, Paul, again, without attacking the false teachers"
    },
    {
      "id": 166,
      "start": 1016.0999755859375,
      "end": 1017.2999572753906,
      "text": " and saying here's where they're wrong,"
    },
    {
      "id": 167,
      "start": 1017.2999572753906,
      "end": 1018.7399597167969,
      "text": " here's where they're wrong,"
    },
    {
      "id": 168,
      "start": 1018.7399597167969,
      "end": 1020.5599670410156,
      "text": " he's exalting Christ,"
    },
    {
      "id": 169,
      "start": 1020.5599670410156,
      "end": 1025.0199584960938,
      "text": " but in so doing, he's exposing the false teachers"
    },
    {
      "id": 170,
      "start": 1025.0199584960938,
      "end": 1029.0599670410156,
      "text": " because they had this idea of these angels"
    },
    {
      "id": 171,
      "start": 1029.0599670410156,
      "end": 1031.3399658203125,
      "text": " and various created beings and so on and so forth"
    },
    {
      "id": 172,
      "start": 1031.3399658203125,
      "end": 1033.5599670410156,
      "text": " that there would be aspects"
    },
    {
      "id": 173,
      "start": 1033.5599670410156,
      "end": 1036.1199645996094,
      "text": " in which there would be certain amounts of divinity"
    },
    {
      "id": 174,
      "start": 1036.1199645996094,
      "end": 1038.1999816894531,
      "text": " and power and so on and so forth,"
    },
    {
      "id": 175,
      "start": 1038.1999816894531,
      "end": 1040.47998046875,
      "text": " and here, the Apostle Paul says,"
    },
    {
      "id": 176,
      "start": 1040.47998046875,
      "end": 1043.2399597167969,
      "text": " in Him, in Jesus Christ,"
    },
    {
      "id": 177,
      "start": 1043.2399597167969,
      "end": 1045.9599609375,
      "text": " it pleased the Father that in Him"
    },
    {
      "id": 178,
      "start": 1045.9599609375,
      "end": 1049.7399597167969,
      "text": " should all fullness dwell."
    },
    {
      "id": 179,
      "start": 1050.6199645996094,
      "end": 1052.0799560546875,
      "text": " The entirety of it."
    },
    {
      "id": 180,
      "start": 1052.0799560546875,
      "end": 1053.9999694824219,
      "text": " The whole sum of it."
    },
    {
      "id": 181,
      "start": 1053.9999694824219,
      "end": 1058.5999755859375,
      "text": " The total of all divine power and attributes"
    },
    {
      "id": 182,
      "start": 1058.5999755859375,
      "end": 1060.7999572753906,
      "text": " are in Jesus Christ."
    },
    {
      "id": 183,
      "start": 1060.7999572753906,
      "end": 1064.6199645996094,
      "text": " All fullness, and then it says dwell."
    },
    {
      "id": 184,
      "start": 1064.6199645996094,
      "end": 1066.6599731445312,
      "text": " The idea of that word dwell,"
    },
    {
      "id": 185,
      "start": 1066.6599731445312,
      "end": 1068.3599853515625,
      "text": " not only does it mean to be present,"
    },
    {
      "id": 186,
      "start": 1068.3599853515625,
      "end": 1069.8399658203125,
      "text": " but it carries with it the idea"
    },
    {
      "id": 187,
      "start": 1069.8399658203125,
      "end": 1072.7599792480469,
      "text": " of being at home permanently."
    },
    {
      "id": 188,
      "start": 1072.7599792480469,
      "end": 1074.4599609375,
      "text": " In other words, He always has been"
    },
    {
      "id": 189,
      "start": 1074.4599609375,
      "end": 1076.8399658203125,
      "text": " and He always will be God."
    },
    {
      "id": 190,
      "start": 1076.8399658203125,
      "end": 1079.2799682617188,
      "text": " The truth that we find, again,"
    },
    {
      "id": 191,
      "start": 1079.2799682617188,
      "end": 1082.5799560546875,
      "text": " this passage of Scripture is exalting the Lord Jesus Christ"
    },
    {
      "id": 192,
      "start": 1082.5799560546875,
      "end": 1085.2999572753906,
      "text": " and we find the way in which He is described"
    },
    {
      "id": 193,
      "start": 1085.2999572753906,
      "end": 1087.5999755859375,
      "text": " in John 1, we looked at a few verses,"
    },
    {
      "id": 194,
      "start": 1087.5999755859375,
      "end": 1089.5399780273438,
      "text": " but in verse number 16,"
    },
    {
      "id": 195,
      "start": 1089.5399780273438,
      "end": 1092.2599792480469,
      "text": " the Bible in that passage of Scripture"
    },
    {
      "id": 196,
      "start": 1092.2599792480469,
      "end": 1094.1799621582031,
      "text": " tells us this truth,"
    },
    {
      "id": 197,
      "start": 1094.1799621582031,
      "end": 1097.4999694824219,
      "text": " and of His fullness have all we received"
    },
    {
      "id": 198,
      "start": 1097.4999694824219,
      "end": 1100.1799621582031,
      "text": " and grace for grace."
    },
    {
      "id": 199,
      "start": 1100.1799621582031,
      "end": 1103.5399780273438,
      "text": " And so Paul is telling these believers in Colossae,"
    },
    {
      "id": 200,
      "start": 1103.5399780273438,
      "end": 1106.7799682617188,
      "text": " let me help you understand a little bit more"
    },
    {
      "id": 201,
      "start": 1106.7799682617188,
      "end": 1108.2599792480469,
      "text": " about Jesus Christ."
    },
    {
      "id": 202,
      "start": 1108.2599792480469,
      "end": 1111.2999572753906,
      "text": " Let me help you understand who He is"
    },
    {
      "id": 203,
      "start": 1111.2999572753906,
      "end": 1115.8599853515625,
      "text": " in a very distinct and a very powerful"
    },
    {
      "id": 204,
      "start": 1115.8799438476562,
      "end": 1116.9199829101562,
      "text": " and concise way."
    },
    {
      "id": 205,
      "start": 1116.9199829101562,
      "end": 1119.8399658203125,
      "text": " Number one, He is the image of the invisible God."
    },
    {
      "id": 206,
      "start": 1119.8399658203125,
      "end": 1122.8799438476562,
      "text": " Number two, He is the Creator."
    },
    {
      "id": 207,
      "start": 1122.8799438476562,
      "end": 1124.199951171875,
      "text": " At the end of verse number 15,"
    },
    {
      "id": 208,
      "start": 1124.199951171875,
      "end": 1126.8799438476562,
      "text": " the Bible says the firstborn of every creature."
    },
    {
      "id": 209,
      "start": 1126.8799438476562,
      "end": 1130.0,
      "text": " Now, we need to be careful as understanding"
    },
    {
      "id": 210,
      "start": 1130.0,
      "end": 1131.8799438476562,
      "text": " what is meant by this phraseology,"
    },
    {
      "id": 211,
      "start": 1131.8799438476562,
      "end": 1133.6799926757812,
      "text": " the firstborn of every creature."
    },
    {
      "id": 212,
      "start": 1133.6799926757812,
      "end": 1136.2799682617188,
      "text": " The false teachers will tell you"
    },
    {
      "id": 213,
      "start": 1136.2799682617188,
      "end": 1139.3199462890625,
      "text": " that that means Jesus was created."
    },
    {
      "id": 214,
      "start": 1139.3199462890625,
      "end": 1140.47998046875,
      "text": " That's what they'll tell you."
    },
    {
      "id": 215,
      "start": 1140.47998046875,
      "end": 1143.2799682617188,
      "text": " He was the firstborn, so therefore He was created."
    },
    {
      "id": 216,
      "start": 1143.2799682617188,
      "end": 1145.6799926757812,
      "text": " Well, that's in violation of Scripture."
    },
    {
      "id": 217,
      "start": 1146.3599853515625,
      "end": 1147.2799682617188,
      "text": " Scripture does not support that"
    },
    {
      "id": 218,
      "start": 1147.2799682617188,
      "end": 1149.2599487304688,
      "text": " when you compare Scripture with Scripture."
    },
    {
      "id": 219,
      "start": 1149.2599487304688,
      "end": 1152.2599487304688,
      "text": " Also, we find that that word firstborn"
    },
    {
      "id": 220,
      "start": 1152.2599487304688,
      "end": 1155.5799560546875,
      "text": " not only carries with it maybe the firstborn"
    },
    {
      "id": 221,
      "start": 1155.5799560546875,
      "end": 1159.97998046875,
      "text": " as a child, but you think about the distinction"
    },
    {
      "id": 222,
      "start": 1159.97998046875,
      "end": 1163.5399780273438,
      "text": " in the Old Testament of the heir, the firstborn,"
    },
    {
      "id": 223,
      "start": 1163.5399780273438,
      "end": 1165.7799682617188,
      "text": " the one that has supremacy,"
    },
    {
      "id": 224,
      "start": 1165.7799682617188,
      "end": 1169.3399658203125,
      "text": " that receives the inheritance, that owns the things,"
    },
    {
      "id": 225,
      "start": 1169.3399658203125,
      "end": 1172.3399658203125,
      "text": " and you find that here in speaking of Jesus Christ,"
    },
    {
      "id": 226,
      "start": 1172.3399658203125,
      "end": 1174.739990234375,
      "text": " when He says that He's the firstborn of every creature,"
    },
    {
      "id": 227,
      "start": 1174.7599487304688,
      "end": 1177.0399780273438,
      "text": " it does not mean that He was created."
    },
    {
      "id": 228,
      "start": 1177.0399780273438,
      "end": 1180.199951171875,
      "text": " He is the Creator, and that is what we find here,"
    },
    {
      "id": 229,
      "start": 1180.199951171875,
      "end": 1182.5199584960938,
      "text": " not only the way that Christ is described,"
    },
    {
      "id": 230,
      "start": 1182.5199584960938,
      "end": 1184.2799682617188,
      "text": " that He is the image of the invisible God,"
    },
    {
      "id": 231,
      "start": 1184.2799682617188,
      "end": 1186.5599975585938,
      "text": " but number two, He is the Creator,"
    },
    {
      "id": 232,
      "start": 1186.5599975585938,
      "end": 1189.8399658203125,
      "text": " and we find that here as we look in verse number 15"
    },
    {
      "id": 233,
      "start": 1189.8399658203125,
      "end": 1192.2799682617188,
      "text": " down through verse number 17"
    },
    {
      "id": 234,
      "start": 1192.2799682617188,
      "end": 1195.0,
      "text": " in understanding the work of creation,"
    },
    {
      "id": 235,
      "start": 1195.0,
      "end": 1197.0799560546875,
      "text": " that the Bible says that He is the firstborn"
    },
    {
      "id": 236,
      "start": 1197.0799560546875,
      "end": 1202.0799560546875,
      "text": " of every creature, for by Him were all things made."
    },
    {
      "id": 0,
      "start": 1202.0799560546875,
      "end": 1207.8799562454224,
      "text": " created, that are in heaven and that are in earth, visible and invisible, whether"
    },
    {
      "id": 1,
      "start": 1207.8799562454224,
      "end": 1212.4799556732178,
      "text": " they be thrones or dominions or principalities or powers. All things were"
    },
    {
      "id": 2,
      "start": 1212.4799556732178,
      "end": 1219.719955444336,
      "text": " created by Him and for Him. And He is before all things, and by Him all things"
    },
    {
      "id": 3,
      "start": 1219.719955444336,
      "end": 1225.3199558258057,
      "text": " consist.\" Now we'd have to understand and make this note that the truth of John"
    },
    {
      "id": 4,
      "start": 1225.3199558258057,
      "end": 1229.8399562835693,
      "text": " chapter number one, coupled with the truth of Colossians chapter number one,"
    },
    {
      "id": 5,
      "start": 1229.8399562835693,
      "end": 1236.5199546813965,
      "text": " these passages of Scripture do not contradict the record of Genesis 1."
    },
    {
      "id": 6,
      "start": 1236.5199546813965,
      "end": 1243.6399574279785,
      "text": " Rather, we would find that these passages of Scripture complement what we find in"
    },
    {
      "id": 7,
      "start": 1243.6399574279785,
      "end": 1248.1599578857422,
      "text": " Genesis chapter number one and provide further details. When you read Genesis"
    },
    {
      "id": 8,
      "start": 1248.1599578857422,
      "end": 1252.439956665039,
      "text": " chapter number one, you find very simply where the Bible says, in the beginning"
    },
    {
      "id": 9,
      "start": 1252.439956665039,
      "end": 1259.3599548339844,
      "text": " God created the heaven and the earth, a passage in which we're familiar with. We"
    },
    {
      "id": 10,
      "start": 1259.3999557495117,
      "end": 1264.1599578857422,
      "text": " find that in John chapter number one and Colossians chapter number one, that God"
    },
    {
      "id": 11,
      "start": 1264.1599578857422,
      "end": 1269.5199584960938,
      "text": " is going to, through revelation, the divine revelation of the Word of God, He"
    },
    {
      "id": 12,
      "start": 1269.5199584960938,
      "end": 1276.6999588012695,
      "text": " is going to give us further details with regard to the work of Jesus Christ in"
    },
    {
      "id": 13,
      "start": 1276.6999588012695,
      "end": 1280.9999542236328,
      "text": " creation. He's the Creator. And we find that in John chapter number one, the"
    },
    {
      "id": 14,
      "start": 1280.9999542236328,
      "end": 1284.439956665039,
      "text": " Bible says, in the beginning was the Word, and the Word was with God, and the Word"
    },
    {
      "id": 15,
      "start": 1284.559959411621,
      "end": 1290.0799560546875,
      "text": " was God. The same was in the beginning with God. All things were made by Him, and"
    },
    {
      "id": 16,
      "start": 1290.0799560546875,
      "end": 1295.3999557495117,
      "text": " without Him was not anything made that was made. It's obvious in"
    },
    {
      "id": 17,
      "start": 1295.3999557495117,
      "end": 1299.1599578857422,
      "text": " John 1, as well as Colossians 1, that he's speaking about the Lord Jesus Christ."
    },
    {
      "id": 18,
      "start": 1299.1599578857422,
      "end": 1306.5399551391602,
      "text": " And it says, for by Him, in verse number 16, were all things created. I'm thankful"
    },
    {
      "id": 19,
      "start": 1306.5399551391602,
      "end": 1311.7599563598633,
      "text": " that God gives us the truth of creation. I've made known, especially as we were"
    },
    {
      "id": 20,
      "start": 1311.7599563598633,
      "end": 1316.9599533081055,
      "text": " studying the book of Genesis, that the truth of creation is not isolated to the"
    },
    {
      "id": 21,
      "start": 1316.9599533081055,
      "end": 1322.8799591064453,
      "text": " first few chapters of the book of Genesis. The truth of creation is dealt"
    },
    {
      "id": 22,
      "start": 1322.8799591064453,
      "end": 1326.9199523925781,
      "text": " with throughout the whole of God's Word. You will find various passages of"
    },
    {
      "id": 23,
      "start": 1326.9199523925781,
      "end": 1331.2799530029297,
      "text": " Scripture throughout the Old and New Testament that declare to us the"
    },
    {
      "id": 24,
      "start": 1331.2799530029297,
      "end": 1337.0399627685547,
      "text": " creation of the universe, and the fact that our God is the Creator. And here, as"
    },
    {
      "id": 25,
      "start": 1337.0399627685547,
      "end": 1341.3199615478516,
      "text": " we would think about the truth that is given to us, for by Him were all things"
    },
    {
      "id": 26,
      "start": 1341.3999633789062,
      "end": 1346.0799560546875,
      "text": " created that are in heaven, that are in earth, that we would understand that this"
    },
    {
      "id": 27,
      "start": 1346.0799560546875,
      "end": 1353.9599609375,
      "text": " truth of creation is not arrived to by reasoning, but rather through revelation."
    },
    {
      "id": 28,
      "start": 1353.9599609375,
      "end": 1361.2799530029297,
      "text": " Many have tried to reason. Many have offered various ideas as to how the"
    },
    {
      "id": 29,
      "start": 1361.2799530029297,
      "end": 1366.8799591064453,
      "text": " cosmos began, and all of those things. And science has offered its theories, no"
    },
    {
      "id": 30,
      "start": 1366.8799591064453,
      "end": 1370.8799591064453,
      "text": " doubt. And we understand that we're living in the midst of a generation that"
    },
    {
      "id": 31,
      "start": 1370.8799591064453,
      "end": 1375.1199493408203,
      "text": " are dealing with a number of false teachers that have denied the Creator"
    },
    {
      "id": 32,
      "start": 1375.1199493408203,
      "end": 1382.0399627685547,
      "text": " God, and they have offered some other theory as to the universe in which"
    },
    {
      "id": 33,
      "start": 1382.0399627685547,
      "end": 1388.439956665039,
      "text": " we live in, where we came from. But we find that the truth is not arrived to by"
    },
    {
      "id": 34,
      "start": 1388.439956665039,
      "end": 1398.0399627685547,
      "text": " reasoning, but by revelation. One who was there, God, reveals to us how He did what"
    },
    {
      "id": 35,
      "start": 1398.0799560546875,
      "end": 1405.3599548339844,
      "text": " He did. You could enter into a room, and you could have some observation of"
    },
    {
      "id": 36,
      "start": 1405.3599548339844,
      "end": 1411.4799499511719,
      "text": " something that took place, and as you would look at that particular example"
    },
    {
      "id": 37,
      "start": 1411.4799499511719,
      "end": 1418.2799530029297,
      "text": " that would be before you, you could try to, through using reason, conclude what"
    },
    {
      "id": 38,
      "start": 1418.2799530029297,
      "end": 1422.7999572753906,
      "text": " was going on, and how things started there. And maybe you're looking at some"
    },
    {
      "id": 39,
      "start": 1422.7999572753906,
      "end": 1427.9199523925781,
      "text": " sophisticated type of machinery, and you go in, and you begin to evaluate, and you"
    },
    {
      "id": 40,
      "start": 1427.9199523925781,
      "end": 1433.199951171875,
      "text": " make all kinds of calculations, and you begin to try to give an explanation"
    },
    {
      "id": 41,
      "start": 1433.199951171875,
      "end": 1440.1199493408203,
      "text": " through reason as to how this process started. And then somebody comes in that"
    },
    {
      "id": 42,
      "start": 1440.1199493408203,
      "end": 1446.5999603271484,
      "text": " was there, that started the process, and says, let me explain to you exactly what"
    },
    {
      "id": 43,
      "start": 1446.5999603271484,
      "end": 1452.3999633789062,
      "text": " happened here. Because through your theory, you're not going to reach the"
    },
    {
      "id": 44,
      "start": 1452.3999633789062,
      "end": 1457.8799591064453,
      "text": " proper conclusion, because it cannot be reached through reasoning. In fact, if you"
    },
    {
      "id": 45,
      "start": 1457.8799591064453,
      "end": 1462.7999572753906,
      "text": " were to go and see a pendulum swinging back and forth, and you could make some"
    },
    {
      "id": 46,
      "start": 1462.7999572753906,
      "end": 1467.2399597167969,
      "text": " measurements as to the distance in which that pendulum is traveling in each"
    },
    {
      "id": 47,
      "start": 1467.2399597167969,
      "end": 1473.9999694824219,
      "text": " direction, if you were, you know, up to speed with physics and mathematics and"
    },
    {
      "id": 48,
      "start": 1473.9999694824219,
      "end": 1477.3599548339844,
      "text": " all of those types of things, you could work all sorts of calculations, and"
    },
    {
      "id": 49,
      "start": 1477.3599548339844,
      "end": 1482.9199523925781,
      "text": " through all of your calculations, you may be able to determine when that pendulum"
    },
    {
      "id": 50,
      "start": 1482.9199523925781,
      "end": 1489.1199645996094,
      "text": " will stop swinging. But if you use the same calculations, and you try to go"
    },
    {
      "id": 51,
      "start": 1489.1199645996094,
      "end": 1493.1599426269531,
      "text": " backwards, and try to find when it started swinging, you're gonna find"
    },
    {
      "id": 52,
      "start": 1493.1599426269531,
      "end": 1497.8399658203125,
      "text": " yourself in a mess. The reason why is because you would eventually get to the"
    },
    {
      "id": 53,
      "start": 1497.8399658203125,
      "end": 1501.3599548339844,
      "text": " place that your calculations would really have said that that thing would"
    },
    {
      "id": 54,
      "start": 1501.3599548339844,
      "end": 1504.7599487304688,
      "text": " have to be spinning all the way around in order for it to still be spinning at"
    },
    {
      "id": 55,
      "start": 1504.7599487304688,
      "end": 1508.2799682617188,
      "text": " the distance, or still going back and forth in the distance in which it was"
    },
    {
      "id": 56,
      "start": 1508.2799682617188,
      "end": 1513.0799560546875,
      "text": " currently moving. And so somebody comes in and says, no, actually this is what we"
    },
    {
      "id": 57,
      "start": 1513.0799560546875,
      "end": 1518.2799682617188,
      "text": " did, this is how we started the process. And so we find that the truth of"
    },
    {
      "id": 58,
      "start": 1518.2799682617188,
      "end": 1523.6399536132812,
      "text": " creation is a truth that is revealed to us through the Creator, through God."
    },
    {
      "id": 59,
      "start": 1523.6399536132812,
      "end": 1528.9999694824219,
      "text": " All Scripture is given by inspiration of God, and it's profitable, not only for"
    },
    {
      "id": 60,
      "start": 1528.9999694824219,
      "end": 1533.8799438476562,
      "text": " doctrine, but we find that Paul says there in 2 Timothy"
    },
    {
      "id": 61,
      "start": 1533.8799438476562,
      "end": 1537.7999572753906,
      "text": " chapter number 3, that it's profitable for doctrine, for reproof, for correction,"
    },
    {
      "id": 62,
      "start": 1537.7999572753906,
      "end": 1542.1199645996094,
      "text": " for instruction in righteousness, that the man of God might be perfect, throughly"
    },
    {
      "id": 63,
      "start": 1542.1199645996094,
      "end": 1547.199951171875,
      "text": " furnished unto all good works. And so God has given us His Word, He's given us"
    },
    {
      "id": 64,
      "start": 1547.199951171875,
      "end": 1551.4799499511719,
      "text": " the account of creation. Notice, as we would begin to think about God being the"
    },
    {
      "id": 65,
      "start": 1551.4799499511719,
      "end": 1556.5599670410156,
      "text": " Creator, that He is the one who was there, and He is the one that gives us the"
    },
    {
      "id": 66,
      "start": 1556.5599670410156,
      "end": 1560.9599609375,
      "text": " record. He created everything, and He controls everything. The Bible says in"
    },
    {
      "id": 67,
      "start": 1560.9599609375,
      "end": 1566.43994140625,
      "text": " verse number 16, notice it says, all things were created by Him. It tells us"
    },
    {
      "id": 68,
      "start": 1566.43994140625,
      "end": 1571.7999572753906,
      "text": " that are in heaven and that are in earth, visible and invisible. I heard a"
    },
    {
      "id": 69,
      "start": 1571.7999572753906,
      "end": 1576.2799682617188,
      "text": " story, not really a story, it was an account yesterday, I heard an account of"
    },
    {
      "id": 70,
      "start": 1576.2799682617188,
      "end": 1583.3599548339844,
      "text": " someone in some desert over in Africa found the smallest species of some type"
    },
    {
      "id": 71,
      "start": 1583.3599548339844,
      "end": 1588.0399475097656,
      "text": " of a land animal. And they're going through all this sort of thing, and they"
    },
    {
      "id": 72,
      "start": 1588.0399475097656,
      "end": 1592.719970703125,
      "text": " were giving the measurements, and it was microscopic, the size of this thing, and"
    },
    {
      "id": 73,
      "start": 1592.719970703125,
      "end": 1596.4799499511719,
      "text": " some people had discovered this thing. Listen, God created all things, visible"
    },
    {
      "id": 74,
      "start": 1596.4799499511719,
      "end": 1601.3199462890625,
      "text": " and invisible. The Bible says here this, whether they be thrones or dominions or"
    },
    {
      "id": 75,
      "start": 1601.3199462890625,
      "end": 1604.2799682617188,
      "text": " principalities or powers. It's interesting, because here in verse"
    },
    {
      "id": 76,
      "start": 1604.2799682617188,
      "end": 1608.6799621582031,
      "text": " number 16, when He begins to deal with that thrones, dominions, principalities,"
    },
    {
      "id": 77,
      "start": 1608.6799621582031,
      "end": 1612.0399475097656,
      "text": " and powers, you will see that He's speaking of the angel world. You know,"
    },
    {
      "id": 78,
      "start": 1612.0399475097656,
      "end": 1619.5199584960938,
      "text": " angels are created beings. God created the angels. In the book of Ephesians, in"
    },
    {
      "id": 79,
      "start": 1619.5199584960938,
      "end": 1624.0799560546875,
      "text": " chapter number 6, as you would begin to deal with the whole armor of God and the"
    },
    {
      "id": 80,
      "start": 1624.0799560546875,
      "end": 1628.5199584960938,
      "text": " the battle that we're engaged in, you would find that Paul says in Ephesians"
    },
    {
      "id": 81,
      "start": 1628.5199584960938,
      "end": 1632.1599426269531,
      "text": " 6 and verse number 12, we wrestle not against flesh and blood, but against"
    },
    {
      "id": 82,
      "start": 1632.1599426269531,
      "end": 1636.2799682617188,
      "text": " principalities, against powers, against the rulers of the darkness of this world,"
    },
    {
      "id": 83,
      "start": 1636.2799682617188,
      "end": 1641.5599670410156,
      "text": " against spiritual wickedness in high places. See, these false teachers in"
    },
    {
      "id": 84,
      "start": 1641.5599670410156,
      "end": 1646.2399597167969,
      "text": " Colossae, they were dealing with some things with regard to angels, and they"
    },
    {
      "id": 85,
      "start": 1646.2799682617188,
      "end": 1650.7599487304688,
      "text": " were dealing with some angel worship. We'll find that later, near the end of"
    },
    {
      "id": 86,
      "start": 1650.7599487304688,
      "end": 1655.1599426269531,
      "text": " chapter number 2, in particular, where that's dealt with. But you find here, as"
    },
    {
      "id": 87,
      "start": 1655.1599426269531,
      "end": 1660.6399536132812,
      "text": " Paul is exalting the Lord Jesus Christ, that he says, listen, he created"
    },
    {
      "id": 88,
      "start": 1660.6399536132812,
      "end": 1667.4799499511719,
      "text": " everything, including the angels. Some people would like to think that Jesus is"
    },
    {
      "id": 89,
      "start": 1667.4799499511719,
      "end": 1673.5999450683594,
      "text": " actually lower than an angel in his power and so on and so forth, because he"
    },
    {
      "id": 90,
      "start": 1673.6399536132812,
      "end": 1679.4799499511719,
      "text": " came as a man. But as we studied the book of Hebrews, we understood that he came in"
    },
    {
      "id": 91,
      "start": 1679.4799499511719,
      "end": 1685.2399597167969,
      "text": " that fashion so that he could die and redeem mankind. He had to come in the"
    },
    {
      "id": 92,
      "start": 1685.2399597167969,
      "end": 1691.6799621582031,
      "text": " form of a man. This is God's plan. By the way, I'm so thankful for God's plan. We"
    },
    {
      "id": 93,
      "start": 1691.6799621582031,
      "end": 1696.6799621582031,
      "text": " find that the Bible continues and says this, all things were created by him and"
    },
    {
      "id": 94,
      "start": 1696.7999572753906,
      "end": 1705.7999572753906,
      "text": " for him. Not only that, he is before all things, and by him all things consist."
    },
    {
      "id": 95,
      "start": 1705.7999572753906,
      "end": 1711.7999572753906,
      "text": " Hebrews 1 and verse number 3 gives us truth with regard, again, to this subject"
    },
    {
      "id": 96,
      "start": 1711.7999572753906,
      "end": 1716.3599853515625,
      "text": " matter of the creation. It tells us in Hebrews 1 and verse number 3, who being"
    },
    {
      "id": 97,
      "start": 1716.3599853515625,
      "end": 1721.3199462890625,
      "text": " the brightness of his glory and the express image of his person, it sounds"
    },
    {
      "id": 98,
      "start": 1721.3199462890625,
      "end": 1725.7599487304688,
      "text": " similar to what we're studying in here in Colossians 1, upholding all things by"
    },
    {
      "id": 99,
      "start": 1725.7599487304688,
      "end": 1730.6399536132812,
      "text": " the word of his power. When he had by himself purged our sins, sat down on the"
    },
    {
      "id": 100,
      "start": 1730.6399536132812,
      "end": 1736.7999267578125,
      "text": " right hand of the majesty on high. And then it tells us being made so much"
    },
    {
      "id": 101,
      "start": 1736.7999267578125,
      "end": 1741.6399536132812,
      "text": " better than the angels. And what we find in verse number 3, not only the fact"
    },
    {
      "id": 102,
      "start": 1741.6399536132812,
      "end": 1745.6399536132812,
      "text": " that it says he's the express image of his person, upholding all things by the"
    },
    {
      "id": 103,
      "start": 1745.6399536132812,
      "end": 1750.3599853515625,
      "text": " word of his power. Not only did he create all things, but he is the keeper of all"
    },
    {
      "id": 104,
      "start": 1750.3599853515625,
      "end": 1755.1599731445312,
      "text": " things. If you remove God, the whole universe is gonna fall apart. It really"
    },
    {
      "id": 105,
      "start": 1755.1599731445312,
      "end": 1762.8399658203125,
      "text": " is. Because by him all things consist. He holds it all together. And we find that"
    },
    {
      "id": 106,
      "start": 1762.8399658203125,
      "end": 1767.679931640625,
      "text": " here, the believers in Colossians, by preservation for us this morning, when"
    },
    {
      "id": 107,
      "start": 1767.679931640625,
      "end": 1772.5199584960938,
      "text": " we're looking at this exalted Christ, we find that he is the image of the"
    },
    {
      "id": 108,
      "start": 1772.5199584960938,
      "end": 1778.7999267578125,
      "text": " invisible God that he manifested, made known, made visible God to man. We find"
    },
    {
      "id": 109,
      "start": 1778.7999267578125,
      "end": 1784.3199462890625,
      "text": " that he is the creator. We find, number three, that he is the redeemer. I'm so"
    },
    {
      "id": 110,
      "start": 1784.3199462890625,
      "end": 1789.0399780273438,
      "text": " thankful that he is the creator. But I'm telling you, the truth that he is the"
    },
    {
      "id": 111,
      "start": 1789.0399780273438,
      "end": 1795.7599487304688,
      "text": " redeemer causes me to rejoice greatly. Because without his redeeming work, if he"
    },
    {
      "id": 112,
      "start": 1795.7599487304688,
      "end": 1802.0799560546875,
      "text": " was the creator but not the redeemer, we'd all have a destination in Lake"
    },
    {
      "id": 113,
      "start": 1802.0799560546875,
      "end": 1804.0799560546875,
      "text": " Idaho."
    },
    {
      "id": 0,
      "start": 1804.0799560546875,
      "end": 1815.1199560165405,
      "text": " a fire. Right? He is the Creator. He is the Redeemer. We looked at those verses of Scripture"
    },
    {
      "id": 1,
      "start": 1815.1199560165405,
      "end": 1820.799955368042,
      "text": " last week in verses 12-14. And as we looked at that passage of Scripture last week, we"
    },
    {
      "id": 2,
      "start": 1820.799955368042,
      "end": 1826.3999557495117,
      "text": " noted the four powerful statements that were made. And just to quickly review, in verse"
    },
    {
      "id": 3,
      "start": 1826.3999557495117,
      "end": 1831.9999561309814,
      "text": " number 12, the Bible says that He hath made us meat to be partakers. And what a great"
    },
    {
      "id": 4,
      "start": 1831.9999561309814,
      "end": 1839.1199569702148,
      "text": " word that word meat. It means to make qualified. The reality that we could not qualify ourselves"
    },
    {
      "id": 5,
      "start": 1839.1199569702148,
      "end": 1847.1599578857422,
      "text": " for heaven, but He qualified us. He made us meat to be partakers of the inheritance of"
    },
    {
      "id": 6,
      "start": 1847.1599578857422,
      "end": 1854.1599578857422,
      "text": " the saints in light. You can't qualify yourself and I can't qualify myself for heaven. But"
    },
    {
      "id": 7,
      "start": 1854.1599578857422,
      "end": 1858.9999542236328,
      "text": " through the imputed righteousness of the Lord Jesus Christ, He hath made us meat. He hath"
    },
    {
      "id": 8,
      "start": 1858.9999542236328,
      "end": 1864.5599555969238,
      "text": " made us qualified. Isn't that awesome? It says this in verse number 13, that He delivered"
    },
    {
      "id": 9,
      "start": 1864.5599555969238,
      "end": 1873.439956665039,
      "text": " us from the power of darkness. Hallelujah. Not only that, but He translated us into the"
    },
    {
      "id": 10,
      "start": 1873.439956665039,
      "end": 1879.7799530029297,
      "text": " kingdom of His dear Son. And then we find in verse number 14, He spoke about the truth"
    },
    {
      "id": 11,
      "start": 1879.7799530029297,
      "end": 1886.3999557495117,
      "text": " of redemption, the forgiveness through His precious blood. And now, once again, the Apostle"
    },
    {
      "id": 12,
      "start": 1886.3999557495117,
      "end": 1894.1199569702148,
      "text": " Paul is going to exalt the Lord Jesus Christ by speaking about His work of redemption."
    },
    {
      "id": 13,
      "start": 1894.1199569702148,
      "end": 1899.2399597167969,
      "text": " Notice in verse number 20, and we'll get back to verse number 18 here in just a moment,"
    },
    {
      "id": 14,
      "start": 1899.2399597167969,
      "end": 1904.599952697754,
      "text": " but notice in verse number 20, the Bible says this, and having made peace through the blood"
    },
    {
      "id": 15,
      "start": 1904.599952697754,
      "end": 1912.3999557495117,
      "text": " of His cross by Him to reconcile all things unto Himself. By Him, I say, whether they"
    },
    {
      "id": 16,
      "start": 1912.3999557495117,
      "end": 1918.559959411621,
      "text": " be things on earth or things in heaven. And you that were sometime alienated and enemies"
    },
    {
      "id": 17,
      "start": 1918.559959411621,
      "end": 1926.4799575805664,
      "text": " in your mind by wicked works, yet now hath He reconciled. Now just think here for a moment"
    },
    {
      "id": 18,
      "start": 1926.4799575805664,
      "end": 1929.6599578857422,
      "text": " as we think about these great truths that have already been revealed to us in verse"
    },
    {
      "id": 19,
      "start": 1929.6599578857422,
      "end": 1936.3199615478516,
      "text": " number 20, the peace that we can have with God through the blood of His cross. In Romans"
    },
    {
      "id": 20,
      "start": 1936.3199615478516,
      "end": 1941.9599609375,
      "text": " chapter number 5, the Bible speaks about peace with God. Often as the people of God, we speak"
    },
    {
      "id": 21,
      "start": 1941.9599609375,
      "end": 1947.5199584960938,
      "text": " about the peace of God, and I'm so thankful for the peace of God, which passeth all understanding."
    },
    {
      "id": 22,
      "start": 1947.5199584960938,
      "end": 1951.5599517822266,
      "text": " I've often heard people over the years make a statement near the end of their life and"
    },
    {
      "id": 23,
      "start": 1951.5599517822266,
      "end": 1955.6599578857422,
      "text": " they'll say something like this, if I've asked them if they're sure of heaven, I've made"
    },
    {
      "id": 24,
      "start": 1955.6599578857422,
      "end": 1962.1599578857422,
      "text": " my peace with God. Have you ever heard anyone say that, use that terminology? The question"
    },
    {
      "id": 25,
      "start": 1962.1599578857422,
      "end": 1967.9199523925781,
      "text": " is this, how did you do that? Because biblically speaking, there's only one way to make peace"
    },
    {
      "id": 26,
      "start": 1967.9199523925781,
      "end": 1975.3999633789062,
      "text": " with God. Romans 5 and verse number 1, therefore being justified by faith, we have peace with"
    },
    {
      "id": 27,
      "start": 1975.3999633789062,
      "end": 1982.6799621582031,
      "text": " God through our Lord Jesus Christ. And here in Colossians 1 and verse number 20, it says,"
    },
    {
      "id": 28,
      "start": 1982.6799621582031,
      "end": 1988.5999603271484,
      "text": " and having made peace through the blood of His cross, we were at enmity with God. The"
    },
    {
      "id": 29,
      "start": 1988.5999603271484,
      "end": 1993.9999542236328,
      "text": " Bible says that God, but God commendeth His love toward us and that while we're yet sinners,"
    },
    {
      "id": 30,
      "start": 1993.9999542236328,
      "end": 1999.8399505615234,
      "text": " Christ died for us. We were at enmity with God because of our sin nature, because of"
    },
    {
      "id": 31,
      "start": 1999.8399505615234,
      "end": 2005.3599548339844,
      "text": " the transgression that's recorded in Genesis 3, when Adam and Eve sinned and sin entered"
    },
    {
      "id": 32,
      "start": 2005.3599548339844,
      "end": 2010.3199615478516,
      "text": " into the world and death passed upon all men for that all have sinned. And we find that"
    },
    {
      "id": 33,
      "start": 2010.3199615478516,
      "end": 2020.1399536132812,
      "text": " we were able now, or we are able to have peace with God through the blood of His cross. Wow."
    },
    {
      "id": 34,
      "start": 2020.1399536132812,
      "end": 2025.5799560546875,
      "text": " He mentions about the fact that of this truth in verse number 21, when he says in you that"
    },
    {
      "id": 35,
      "start": 2025.5799560546875,
      "end": 2033.699951171875,
      "text": " were sometime alienated and enemies in your mind by wicked works, yet now hath He reconciled."
    },
    {
      "id": 36,
      "start": 2033.699951171875,
      "end": 2039.9799499511719,
      "text": " So he speaks about this peace and then he speaks about the truth of reconciliation."
    },
    {
      "id": 37,
      "start": 2039.9799499511719,
      "end": 2046.4599609375,
      "text": " I'm so thankful for this word reconciled, the truth of reconciliation. It's through his"
    },
    {
      "id": 38,
      "start": 2046.4599609375,
      "end": 2053.1399536132812,
      "text": " substitutionary atonement that we can be reconciled to God. You ever had two parties"
    },
    {
      "id": 39,
      "start": 2053.1399536132812,
      "end": 2057.6199493408203,
      "text": " of people that were at odds at variance one with the other and they need to have a mediator"
    },
    {
      "id": 40,
      "start": 2057.6199493408203,
      "end": 2063.179962158203,
      "text": " so that they can be reconciled. Well, we were at enmity with God. We were separated from"
    },
    {
      "id": 41,
      "start": 2063.179962158203,
      "end": 2069.3399658203125,
      "text": " God because He is holy and we are sinful. Jesus Christ, through His work on the cross"
    },
    {
      "id": 42,
      "start": 2069.3399658203125,
      "end": 2074.419952392578,
      "text": " of Calvary, through the substitutionary atonement, He made it possible that we could be reconciled"
    },
    {
      "id": 43,
      "start": 2074.419952392578,
      "end": 2082.3399658203125,
      "text": " to God. It's a precious truth of the word of God. And then we see in verse number 22,"
    },
    {
      "id": 44,
      "start": 2082.3399658203125,
      "end": 2086.8199462890625,
      "text": " the Bible continues with this idea about the reconciliation, that it was in the body of"
    },
    {
      "id": 45,
      "start": 2086.8199462890625,
      "end": 2091.179962158203,
      "text": " His flesh through death. It was through the substitutionary death that we can be reconciled."
    },
    {
      "id": 46,
      "start": 2091.179962158203,
      "end": 2098.499969482422,
      "text": " But notice this last phrase of verse number 22, to present you holy and unblameable and"
    },
    {
      "id": 47,
      "start": 2098.499969482422,
      "end": 2105.0999450683594,
      "text": " unreprovable in His sight. Now think about that truth. The reality is that there in verse"
    },
    {
      "id": 48,
      "start": 2105.0999450683594,
      "end": 2110.93994140625,
      "text": " number 22 when He says to present you, we find in verse number 13 it says, who hath"
    },
    {
      "id": 49,
      "start": 2110.93994140625,
      "end": 2116.2599487304688,
      "text": " delivered us from the power of darkness and hath translated us into the kingdom of His"
    },
    {
      "id": 50,
      "start": 2116.2599487304688,
      "end": 2121.6199645996094,
      "text": " dear Son. I mentioned the song last Sunday morning. The old account was settled long"
    },
    {
      "id": 51,
      "start": 2121.6199645996094,
      "end": 2126.499969482422,
      "text": " ago. I mean, the reality is that the day in which you were saved, you were delivered from"
    },
    {
      "id": 52,
      "start": 2126.499969482422,
      "end": 2130.659942626953,
      "text": " the power of darkness, and you were translated into the kingdom of His dear Son. It was a"
    },
    {
      "id": 53,
      "start": 2130.659942626953,
      "end": 2136.3399658203125,
      "text": " great miracle that took place on that day. And we find that here the Bible reveals to"
    },
    {
      "id": 54,
      "start": 2136.3399658203125,
      "end": 2143.2599487304688,
      "text": " us that it was so that, or one of the workings of our salvation is that He would present"
    },
    {
      "id": 55,
      "start": 2143.2599487304688,
      "end": 2151.1399536132812,
      "text": " us holy, unblameable, and unreprovable. Now in of ourselves, we're not holy, unblameable,"
    },
    {
      "id": 56,
      "start": 2151.1399536132812,
      "end": 2157.93994140625,
      "text": " and unreprovable. But in as we're clothed in His righteousness, the imputed righteousness"
    },
    {
      "id": 57,
      "start": 2157.93994140625,
      "end": 2163.3799438476562,
      "text": " of Christ that we mention in 2 Corinthians 5 and verse number 21, and we see here that"
    },
    {
      "id": 58,
      "start": 2163.3799438476562,
      "end": 2169.0199584960938,
      "text": " the Bible says that He's done these things, He is the Redeemer, this is the work of redemption,"
    },
    {
      "id": 59,
      "start": 2169.0199584960938,
      "end": 2174.6199645996094,
      "text": " and therefore He is going to present us. Think about this truth of our theme for this year."
    },
    {
      "id": 60,
      "start": 2174.6199645996094,
      "end": 2179.5799560546875,
      "text": " Complete in Christ. In Colossians 2, in verse number 10, is the verse of Scripture in which"
    },
    {
      "id": 61,
      "start": 2179.5799560546875,
      "end": 2184.3399658203125,
      "text": " we find that it says, and you are complete in Him, which is the head of all principality"
    },
    {
      "id": 62,
      "start": 2184.3399658203125,
      "end": 2189.6199645996094,
      "text": " and power. I don't need anything else. I'm complete in Christ, and because of the work"
    },
    {
      "id": 63,
      "start": 2189.6199645996094,
      "end": 2197.219970703125,
      "text": " of redemption, He is going to present you, He's going to present His children holy, unblameable,"
    },
    {
      "id": 64,
      "start": 2197.219970703125,
      "end": 2205.8199462890625,
      "text": " and unreprovable. Clothed in His holiness. Unblameable and unreprovable are similar words,"
    },
    {
      "id": 65,
      "start": 2205.8199462890625,
      "end": 2212.0599670410156,
      "text": " one meaning without blemish and the other meaning blameless. Now think about that. That's"
    },
    {
      "id": 66,
      "start": 2212.0599670410156,
      "end": 2216.2999572753906,
      "text": " how He's going to present us. Someone said this, every time that God the Father looks"
    },
    {
      "id": 67,
      "start": 2216.2999572753906,
      "end": 2222.4599609375,
      "text": " at you, He has the son, S-O-N, in His sight. Because we're clothed in the righteousness"
    },
    {
      "id": 68,
      "start": 2222.4599609375,
      "end": 2227.0999450683594,
      "text": " of Christ. And you think about the accuser of the brethren, as the book of Revelation"
    },
    {
      "id": 69,
      "start": 2227.0999450683594,
      "end": 2231.419952392578,
      "text": " would deal with our enemy being the accuser of the brethren, that He would seek to cause"
    },
    {
      "id": 70,
      "start": 2231.419952392578,
      "end": 2236.7799682617188,
      "text": " us to, He'd like to bring up our past and talk about our sin, but we're able to say,"
    },
    {
      "id": 71,
      "start": 2236.7799682617188,
      "end": 2244.3399658203125,
      "text": " it's under the blood. Julianna sang that song this morning, I am forgiven forever. Not because"
    },
    {
      "id": 72,
      "start": 2244.3399658203125,
      "end": 2249.8599548339844,
      "text": " I deserved it, but because God who is rich in mercy, because of His great love wherewith"
    },
    {
      "id": 73,
      "start": 2249.8599548339844,
      "end": 2255.6199645996094,
      "text": " He has loved us, because of His work of redemption, He has saved us, He's offered to us the gift"
    },
    {
      "id": 74,
      "start": 2255.6199645996094,
      "end": 2261.5799560546875,
      "text": " of salvation, and as we receive that free gift of eternal life, He makes it so that"
    },
    {
      "id": 75,
      "start": 2261.5799560546875,
      "end": 2269.2999572753906,
      "text": " He is going to present us holy, unblameable, and unreprovable in His sight. It's amazing."
    },
    {
      "id": 76,
      "start": 2269.2999572753906,
      "end": 2273.699951171875,
      "text": " Remember the truth that God gave to the children of Israel in the Old Testament, the book of"
    },
    {
      "id": 77,
      "start": 2273.699951171875,
      "end": 2280.3799438476562,
      "text": " Psalms, He speaks about the sins being as far removed as the east is from the west."
    },
    {
      "id": 78,
      "start": 2280.3799438476562,
      "end": 2285.3799438476562,
      "text": " That's in Psalm 103 and verse number 12. And it's a great truth, and you understand that"
    },
    {
      "id": 79,
      "start": 2285.3799438476562,
      "end": 2292.499969482422,
      "text": " if you travel east, you can just keep on, there's no point in which east and west are"
    },
    {
      "id": 80,
      "start": 2292.499969482422,
      "end": 2297.0999450683594,
      "text": " really divisible one from the other. We find that He did not say as far as the north is"
    },
    {
      "id": 81,
      "start": 2297.0999450683594,
      "end": 2302.179962158203,
      "text": " from the south, but as far as the east is from the west. In Psalm 103 and verse 12,"
    },
    {
      "id": 82,
      "start": 2302.179962158203,
      "end": 2308.1399536132812,
      "text": " as far as the east is from the west, so far hath He removed our transgressions from us."
    },
    {
      "id": 83,
      "start": 2308.1399536132812,
      "end": 2314.2999572753906,
      "text": " Aren't you thankful for that? We think about redemption. We think about His work of being"
    },
    {
      "id": 84,
      "start": 2314.2999572753906,
      "end": 2318.8999633789062,
      "text": " the Redeemer. Listen, it's a wonderful thing to be forgiven. It's a wonderful thing to"
    },
    {
      "id": 85,
      "start": 2318.8999633789062,
      "end": 2326.8599853515625,
      "text": " know that we have been forgiven by the Lord and that we have this forgiveness. There are"
    },
    {
      "id": 86,
      "start": 2326.8599853515625,
      "end": 2334.0599365234375,
      "text": " many today that do not know that forgiveness is even available. In Micah 7 and verse number"
    },
    {
      "id": 87,
      "start": 2334.0599365234375,
      "end": 2339.3799438476562,
      "text": " 19, it says, He will turn again, He will have compassion upon us, He will subdue our iniquities,"
    },
    {
      "id": 88,
      "start": 2339.3799438476562,
      "end": 2346.8199462890625,
      "text": " and Thou wilt cast all their sins into the depths of the sea. We sing a song, gone, gone,"
    },
    {
      "id": 89,
      "start": 2346.8199462890625,
      "end": 2354.8199462890625,
      "text": " gone. Yes, my sins are gone. What a great truth. And here we find one of the impacts"
    },
    {
      "id": 90,
      "start": 2354.8199462890625,
      "end": 2361.1399536132812,
      "text": " or results, if you will, of redemption, that He will present us wholly, unblameable and"
    },
    {
      "id": 91,
      "start": 2361.1399536132812,
      "end": 2364.7399291992188,
      "text": " unreprovable in His sight. We'll deal with it as we get through the rest of Colossians"
    },
    {
      "id": 92,
      "start": 2364.7399291992188,
      "end": 2369.6199340820312,
      "text": " chapter number 1, but let me just give you a quick preview. In verse number 28, and again,"
    },
    {
      "id": 93,
      "start": 2369.6199340820312,
      "end": 2373.219970703125,
      "text": " I'm jumping into next week's message, but in verse number 28, the Bible says, Whom we"
    },
    {
      "id": 94,
      "start": 2373.219970703125,
      "end": 2378.0999755859375,
      "text": " preach, warning every man and teaching every man in all wisdom that we may present every"
    },
    {
      "id": 95,
      "start": 2378.0999755859375,
      "end": 2383.3399658203125,
      "text": " man perfect in Christ Jesus. Why is Paul preaching the gospel? Why are they out doing these missionary"
    },
    {
      "id": 96,
      "start": 2383.3399658203125,
      "end": 2388.7799682617188,
      "text": " journeys and going and preaching the gospel? Because he understands the power of the gospel"
    },
    {
      "id": 97,
      "start": 2388.7799682617188,
      "end": 2394.2999267578125,
      "text": " to transform people, but also that we might be presented wholly and unblameable and unreprovable"
    },
    {
      "id": 98,
      "start": 2394.2999267578125,
      "end": 2401.4199829101562,
      "text": " in His sight, and therefore, Paul is preaching that message. What joy to know that he is"
    },
    {
      "id": 99,
      "start": 2401.4199829101562,
      "end": 2403.4599609375,
      "text": " the Redeemer. He's the Redeemer."
    },
    {
      "id": 0,
      "start": 2403.4599609375,
      "end": 2406.999960899353,
      "text": " Number four, how Christ is described."
    },
    {
      "id": 1,
      "start": 2406.999960899353,
      "end": 2409.039960861206,
      "text": " Notice with me that He is the head"
    },
    {
      "id": 2,
      "start": 2409.039960861206,
      "end": 2410.5599608421326,
      "text": " of the body, the church."
    },
    {
      "id": 3,
      "start": 2410.5599608421326,
      "end": 2414.419960975647,
      "text": " In v. 18, the Bible says this,"
    },
    {
      "id": 4,
      "start": 2414.419960975647,
      "end": 2418.379961013794,
      "text": " and He is the head of the body, the church."
    },
    {
      "id": 5,
      "start": 2418.379961013794,
      "end": 2419.4599609375,
      "text": " Who is the beginning,"
    },
    {
      "id": 6,
      "start": 2419.4599609375,
      "end": 2420.799961090088,
      "text": " the firstborn from the dead,"
    },
    {
      "id": 7,
      "start": 2420.799961090088,
      "end": 2422.9199600219727,
      "text": " that in all things He might have"
    },
    {
      "id": 8,
      "start": 2422.9199600219727,
      "end": 2425.0999603271484,
      "text": " the preeminence."
    },
    {
      "id": 9,
      "start": 2425.0999603271484,
      "end": 2426.8399600982666,
      "text": " As we look at v. 18,"
    },
    {
      "id": 10,
      "start": 2426.8399600982666,
      "end": 2428.5999603271484,
      "text": " we find that that word head"
    },
    {
      "id": 11,
      "start": 2428.5999603271484,
      "end": 2430.9199600219727,
      "text": " carries with it the idea of the originator"
    },
    {
      "id": 12,
      "start": 2430.9199600219727,
      "end": 2432.8399600982666,
      "text": " or the source."
    },
    {
      "id": 13,
      "start": 2432.8399600982666,
      "end": 2434.1799602508545,
      "text": " It helps us to understand"
    },
    {
      "id": 14,
      "start": 2434.1799602508545,
      "end": 2436.2599601745605,
      "text": " that He is the leader or the ruler,"
    },
    {
      "id": 15,
      "start": 2436.2599601745605,
      "end": 2440.4799613952637,
      "text": " that He is the head of the church."
    },
    {
      "id": 16,
      "start": 2440.4799613952637,
      "end": 2444.019962310791,
      "text": " I'm so thankful that it is His church."
    },
    {
      "id": 17,
      "start": 2444.019962310791,
      "end": 2446.9399604797363,
      "text": " You know, the church was not man's idea."
    },
    {
      "id": 18,
      "start": 2446.9399604797363,
      "end": 2449.3399620056152,
      "text": " It was God's idea."
    },
    {
      "id": 19,
      "start": 2449.3399620056152,
      "end": 2450.639961242676,
      "text": " God designed the church."
    },
    {
      "id": 20,
      "start": 2450.639961242676,
      "end": 2451.9799613952637,
      "text": " God empowers the church."
    },
    {
      "id": 21,
      "start": 2451.9799613952637,
      "end": 2454.2599601745605,
      "text": " The Lord Jesus Christ said in Matthew 16"
    },
    {
      "id": 22,
      "start": 2454.2599601745605,
      "end": 2455.179962158203,
      "text": " and v. 18,"
    },
    {
      "id": 23,
      "start": 2455.179962158203,
      "end": 2456.7599601745605,
      "text": " I will build My church"
    },
    {
      "id": 24,
      "start": 2456.7599601745605,
      "end": 2459.299961090088,
      "text": " and the gates of hell shall not prevail against it."
    },
    {
      "id": 25,
      "start": 2459.299961090088,
      "end": 2460.799961090088,
      "text": " We find that Paul tells Timothy"
    },
    {
      "id": 26,
      "start": 2460.799961090088,
      "end": 2462.5999603271484,
      "text": " in 1 Timothy 3 and v. 15"
    },
    {
      "id": 27,
      "start": 2462.859962463379,
      "end": 2465.059959411621,
      "text": " that thou oughtest to know how to obey thyself"
    },
    {
      "id": 28,
      "start": 2465.059959411621,
      "end": 2466.019962310791,
      "text": " in the house of God,"
    },
    {
      "id": 29,
      "start": 2466.019962310791,
      "end": 2468.859962463379,
      "text": " which is the church of the living God."
    },
    {
      "id": 30,
      "start": 2468.859962463379,
      "end": 2470.559959411621,
      "text": " It's God's church."
    },
    {
      "id": 31,
      "start": 2470.559959411621,
      "end": 2472.559959411621,
      "text": " He's the head of the church."
    },
    {
      "id": 32,
      "start": 2472.559959411621,
      "end": 2476.0999603271484,
      "text": " Oftentimes, we'll speak about the polity,"
    },
    {
      "id": 33,
      "start": 2476.0999603271484,
      "end": 2477.559959411621,
      "text": " if you will, for a local church,"
    },
    {
      "id": 34,
      "start": 2477.559959411621,
      "end": 2480.4799575805664,
      "text": " and we'll speak about the office of pastor and deacon"
    },
    {
      "id": 35,
      "start": 2480.4799575805664,
      "end": 2482.5199584960938,
      "text": " and the role in which I play as the pastor."
    },
    {
      "id": 36,
      "start": 2482.5199584960938,
      "end": 2484.3999633789062,
      "text": " I am the under-shepherd."
    },
    {
      "id": 37,
      "start": 2484.3999633789062,
      "end": 2486.239959716797,
      "text": " But we have a chief shepherd."
    },
    {
      "id": 38,
      "start": 2486.239959716797,
      "end": 2488.4799575805664,
      "text": " And I'm so thankful that it's His church"
    },
    {
      "id": 39,
      "start": 2488.4799575805664,
      "end": 2491.4799575805664,
      "text": " and that He is the head of the church."
    },
    {
      "id": 40,
      "start": 2491.4799575805664,
      "end": 2494.3999633789062,
      "text": " What a joy. What a blessing."
    },
    {
      "id": 41,
      "start": 2494.3999633789062,
      "end": 2496.739959716797,
      "text": " I want you to think about the ownership"
    },
    {
      "id": 42,
      "start": 2496.739959716797,
      "end": 2499.3799591064453,
      "text": " that He has of the church just for a moment"
    },
    {
      "id": 43,
      "start": 2499.3799591064453,
      "end": 2501.159957885742,
      "text": " and this position that He has"
    },
    {
      "id": 44,
      "start": 2501.159957885742,
      "end": 2503.559959411621,
      "text": " as being the head of the body, the church."
    },
    {
      "id": 45,
      "start": 2503.559959411621,
      "end": 2505.5199584960938,
      "text": " Not only is He the originator, the source,"
    },
    {
      "id": 46,
      "start": 2505.5199584960938,
      "end": 2506.9199600219727,
      "text": " the leader, and ruler,"
    },
    {
      "id": 47,
      "start": 2506.9199600219727,
      "end": 2509.9399642944336,
      "text": " but notice what is said in Acts 20."
    },
    {
      "id": 48,
      "start": 2509.9399642944336,
      "end": 2514.4199600219727,
      "text": " This is just a precious passage of Scripture to me"
    },
    {
      "id": 49,
      "start": 2514.4199600219727,
      "end": 2516.9799575805664,
      "text": " as I study through the entirety of this passage."
    },
    {
      "id": 50,
      "start": 2516.9799575805664,
      "end": 2519.4799575805664,
      "text": " It's one in which I find great encouragement."
    },
    {
      "id": 51,
      "start": 2519.5199584960938,
      "end": 2523.339958190918,
      "text": " I find that Paul is here speaking to these"
    },
    {
      "id": 52,
      "start": 2523.339958190918,
      "end": 2526.839958190918,
      "text": " Ephesian elders, the leaders of the church at Ephesus,"
    },
    {
      "id": 53,
      "start": 2526.839958190918,
      "end": 2528.7999572753906,
      "text": " and he's rehearsing for them"
    },
    {
      "id": 54,
      "start": 2528.7999572753906,
      "end": 2530.579963684082,
      "text": " some of his work in ministry,"
    },
    {
      "id": 55,
      "start": 2530.579963684082,
      "end": 2532.979965209961,
      "text": " and then he's giving them some good counsel"
    },
    {
      "id": 56,
      "start": 2532.979965209961,
      "end": 2534.8399658203125,
      "text": " and instruction with regard to the work"
    },
    {
      "id": 57,
      "start": 2534.8399658203125,
      "end": 2536.199966430664,
      "text": " that is before them."
    },
    {
      "id": 58,
      "start": 2536.199966430664,
      "end": 2541.2799682617188,
      "text": " And it says this in Acts 20, 28,"
    },
    {
      "id": 59,
      "start": 2541.2799682617188,
      "end": 2544.5199584960938,
      "text": " \"'Take heed, therefore, unto yourselves,"
    },
    {
      "id": 60,
      "start": 2544.5199584960938,
      "end": 2547.239959716797,
      "text": " into all the flock over which the Holy Ghost"
    },
    {
      "id": 61,
      "start": 2547.239959716797,
      "end": 2549.6199645996094,
      "text": " hath made you overseers,"
    },
    {
      "id": 62,
      "start": 2549.6199645996094,
      "end": 2553.179962158203,
      "text": " to feed the church of God,"
    },
    {
      "id": 63,
      "start": 2553.179962158203,
      "end": 2558.0399627685547,
      "text": " which He hath purchased with His own blood.'\""
    },
    {
      "id": 64,
      "start": 2558.0399627685547,
      "end": 2559.659957885742,
      "text": " Feed the church of God,"
    },
    {
      "id": 65,
      "start": 2559.659957885742,
      "end": 2564.1199645996094,
      "text": " which He hath purchased with His own blood."
    },
    {
      "id": 66,
      "start": 2564.1199645996094,
      "end": 2567.5799560546875,
      "text": " This exalted position of the Lord Jesus Christ"
    },
    {
      "id": 67,
      "start": 2567.5799560546875,
      "end": 2569.3199615478516,
      "text": " as being the head of the church,"
    },
    {
      "id": 68,
      "start": 2569.3199615478516,
      "end": 2571.239959716797,
      "text": " this was important for these believers"
    },
    {
      "id": 69,
      "start": 2571.239959716797,
      "end": 2572.719955444336,
      "text": " in Colossae to understand."
    },
    {
      "id": 70,
      "start": 2572.719955444336,
      "end": 2574.759963989258,
      "text": " Not only was it important for the believers"
    },
    {
      "id": 71,
      "start": 2574.759963989258,
      "end": 2576.0399627685547,
      "text": " in Colossae to understand,"
    },
    {
      "id": 72,
      "start": 2576.0399627685547,
      "end": 2577.6399536132812,
      "text": " but it's important for us today"
    },
    {
      "id": 73,
      "start": 2577.6399536132812,
      "end": 2579.7999572753906,
      "text": " to continue to understand that Jesus"
    },
    {
      "id": 74,
      "start": 2579.7999572753906,
      "end": 2582.719955444336,
      "text": " is the head of the church."
    },
    {
      "id": 75,
      "start": 2582.719955444336,
      "end": 2585.5999603271484,
      "text": " And oh, how powerful that truth is."
    },
    {
      "id": 76,
      "start": 2585.5999603271484,
      "end": 2587.5999603271484,
      "text": " And how mindful we must be"
    },
    {
      "id": 77,
      "start": 2587.5999603271484,
      "end": 2590.8999633789062,
      "text": " of this reality that is before us."
    },
    {
      "id": 78,
      "start": 2590.8999633789062,
      "end": 2593.0199584960938,
      "text": " This is not my church."
    },
    {
      "id": 79,
      "start": 2593.0199584960938,
      "end": 2597.939956665039,
      "text": " It's God's church."
    },
    {
      "id": 80,
      "start": 2597.939956665039,
      "end": 2600.499954223633,
      "text": " We understand that He is God in flesh."
    },
    {
      "id": 81,
      "start": 2600.499954223633,
      "end": 2603.179962158203,
      "text": " Paul in these verses of Scripture"
    },
    {
      "id": 82,
      "start": 2603.179962158203,
      "end": 2607.3399658203125,
      "text": " will present to these believers in Colossae"
    },
    {
      "id": 83,
      "start": 2607.3399658203125,
      "end": 2608.6199645996094,
      "text": " the Lord Jesus Christ."
    },
    {
      "id": 84,
      "start": 2608.6199645996094,
      "end": 2610.5399627685547,
      "text": " The exalted Christ."
    },
    {
      "id": 85,
      "start": 2610.5399627685547,
      "end": 2613.0599670410156,
      "text": " He will give for them the truth"
    },
    {
      "id": 86,
      "start": 2613.0599670410156,
      "end": 2617.5599670410156,
      "text": " that He is the image of the invisible God."
    },
    {
      "id": 87,
      "start": 2617.5599670410156,
      "end": 2619.4599609375,
      "text": " That He is the Creator."
    },
    {
      "id": 88,
      "start": 2619.4599609375,
      "end": 2621.199966430664,
      "text": " That He is the Redeemer."
    },
    {
      "id": 89,
      "start": 2621.199966430664,
      "end": 2624.3999633789062,
      "text": " That He is the head of the body, the church."
    },
    {
      "id": 90,
      "start": 2624.3999633789062,
      "end": 2626.179962158203,
      "text": " What is Paul saying?"
    },
    {
      "id": 91,
      "start": 2626.179962158203,
      "end": 2628.1399536132812,
      "text": " He's saying that He's God."
    },
    {
      "id": 92,
      "start": 2628.1399536132812,
      "end": 2630.3399658203125,
      "text": " That Jesus is God."
    },
    {
      "id": 93,
      "start": 2630.3399658203125,
      "end": 2632.259963989258,
      "text": " Paul in Acts 17,"
    },
    {
      "id": 94,
      "start": 2632.3399658203125,
      "end": 2636.419967651367,
      "text": " when he arrives in the city of Thessalonica,"
    },
    {
      "id": 95,
      "start": 2636.419967651367,
      "end": 2638.219955444336,
      "text": " there was a synagogue of the Jews"
    },
    {
      "id": 96,
      "start": 2638.219955444336,
      "end": 2640.6399536132812,
      "text": " and Paul goes to meet with them"
    },
    {
      "id": 97,
      "start": 2640.6399536132812,
      "end": 2642.3599548339844,
      "text": " and to give them truth."
    },
    {
      "id": 98,
      "start": 2642.3599548339844,
      "end": 2645.8999633789062,
      "text": " And the Bible tells us in v. 2 of Acts 17,"
    },
    {
      "id": 99,
      "start": 2645.8999633789062,
      "end": 2647.5799560546875,
      "text": " and Paul, as his manner was,"
    },
    {
      "id": 100,
      "start": 2647.5799560546875,
      "end": 2649.439956665039,
      "text": " went in unto them,"
    },
    {
      "id": 101,
      "start": 2649.439956665039,
      "end": 2651.7799682617188,
      "text": " and three Sabbath days reasoned with them"
    },
    {
      "id": 102,
      "start": 2651.7799682617188,
      "end": 2654.0199584960938,
      "text": " out of the Scriptures,"
    },
    {
      "id": 103,
      "start": 2654.0199584960938,
      "end": 2656.7799682617188,
      "text": " opening and alleging that Christ's most needs"
    },
    {
      "id": 104,
      "start": 2656.7799682617188,
      "end": 2658.199966430664,
      "text": " have suffered,"
    },
    {
      "id": 105,
      "start": 2658.199966430664,
      "end": 2660.0199584960938,
      "text": " and risen again from the dead,"
    },
    {
      "id": 106,
      "start": 2660.0599670410156,
      "end": 2663.939971923828,
      "text": " and that this Jesus whom I preach unto you"
    },
    {
      "id": 107,
      "start": 2663.939971923828,
      "end": 2666.8999633789062,
      "text": " is Christ."
    },
    {
      "id": 108,
      "start": 2666.8999633789062,
      "end": 2668.7799682617188,
      "text": " They knew who this Jesus was."
    },
    {
      "id": 109,
      "start": 2668.7799682617188,
      "end": 2671.219970703125,
      "text": " They knew who the man Jesus was."
    },
    {
      "id": 110,
      "start": 2671.219970703125,
      "end": 2673.0999755859375,
      "text": " These individuals, these Jews"
    },
    {
      "id": 111,
      "start": 2673.0999755859375,
      "end": 2675.3799743652344,
      "text": " that are in the synagogue there in Thessalonica,"
    },
    {
      "id": 112,
      "start": 2675.3799743652344,
      "end": 2678.2599487304688,
      "text": " they would have understood who Jesus was as a man."
    },
    {
      "id": 113,
      "start": 2678.2599487304688,
      "end": 2681.0999755859375,
      "text": " They would have understood His crucifixion."
    },
    {
      "id": 114,
      "start": 2681.0999755859375,
      "end": 2682.8599548339844,
      "text": " They would have been aware of these things."
    },
    {
      "id": 115,
      "start": 2682.8599548339844,
      "end": 2687.0999755859375,
      "text": " And Paul says this Jesus whom I preach unto you"
    },
    {
      "id": 116,
      "start": 2687.0999755859375,
      "end": 2689.8599548339844,
      "text": " is Christ, the Anointed One,"
    },
    {
      "id": 117,
      "start": 2689.8599548339844,
      "end": 2694.0199584960938,
      "text": " the Messiah, the Son of God."
    },
    {
      "id": 118,
      "start": 2694.0199584960938,
      "end": 2695.739959716797,
      "text": " And here in the book of Colossians,"
    },
    {
      "id": 119,
      "start": 2695.739959716797,
      "end": 2699.219970703125,
      "text": " he presents Jesus Christ"
    },
    {
      "id": 120,
      "start": 2699.219970703125,
      "end": 2701.0599670410156,
      "text": " to these believers."
    },
    {
      "id": 121,
      "start": 2701.0599670410156,
      "end": 2703.0199584960938,
      "text": " Now, obviously, they've already understood"
    },
    {
      "id": 122,
      "start": 2703.0199584960938,
      "end": 2704.179962158203,
      "text": " who Jesus Christ was."
    },
    {
      "id": 123,
      "start": 2704.179962158203,
      "end": 2706.5399475097656,
      "text": " They'd placed their faith and trust in Him"
    },
    {
      "id": 124,
      "start": 2706.5399475097656,
      "end": 2708.5399475097656,
      "text": " when they received the Gospel."
    },
    {
      "id": 125,
      "start": 2708.5399475097656,
      "end": 2710.0199584960938,
      "text": " But Paul is beginning to..."
    },
    {
      "id": 126,
      "start": 2710.0199584960938,
      "end": 2713.179962158203,
      "text": " You know, we sing the song more about Jesus."
    },
    {
      "id": 127,
      "start": 2713.179962158203,
      "end": 2715.0999755859375,
      "text": " I hope that you know more about Jesus today"
    },
    {
      "id": 128,
      "start": 2715.0999755859375,
      "end": 2717.3799743652344,
      "text": " than you did when you first got saved."
    },
    {
      "id": 129,
      "start": 2717.3799743652344,
      "end": 2718.8599548339844,
      "text": " That you understand more of the working"
    },
    {
      "id": 130,
      "start": 2718.8599548339844,
      "end": 2722.939971923828,
      "text": " of redemption today than the day you first got saved."
    },
    {
      "id": 131,
      "start": 2722.939971923828,
      "end": 2724.979949951172,
      "text": " And so Paul, because of these false teachers"
    },
    {
      "id": 132,
      "start": 2724.979949951172,
      "end": 2726.8999633789062,
      "text": " coming in and saying various things,"
    },
    {
      "id": 133,
      "start": 2726.8999633789062,
      "end": 2728.7799682617188,
      "text": " and there are certain people groups"
    },
    {
      "id": 134,
      "start": 2728.7799682617188,
      "end": 2731.0599670410156,
      "text": " around the world that they're okay"
    },
    {
      "id": 135,
      "start": 2731.0599670410156,
      "end": 2732.8999633789062,
      "text": " if you believe in Jesus as just being"
    },
    {
      "id": 136,
      "start": 2732.8999633789062,
      "end": 2735.0999755859375,
      "text": " another small G-O-D."
    },
    {
      "id": 137,
      "start": 2735.0999755859375,
      "end": 2736.6199645996094,
      "text": " They don't mind that you serve"
    },
    {
      "id": 138,
      "start": 2736.6199645996094,
      "end": 2738.219970703125,
      "text": " a multiplicity of gods"
    },
    {
      "id": 139,
      "start": 2738.219970703125,
      "end": 2740.2999572753906,
      "text": " and have all of these different deities"
    },
    {
      "id": 140,
      "start": 2740.2999572753906,
      "end": 2742.0199584960938,
      "text": " in which you would worship"
    },
    {
      "id": 141,
      "start": 2742.0199584960938,
      "end": 2743.979949951172,
      "text": " because they do not mind you"
    },
    {
      "id": 142,
      "start": 2743.979949951172,
      "end": 2747.8599548339844,
      "text": " believing that Jesus existed."
    },
    {
      "id": 143,
      "start": 2747.8999633789062,
      "end": 2750.8199462890625,
      "text": " They're attacking who He really is"
    },
    {
      "id": 144,
      "start": 2750.8199462890625,
      "end": 2753.2599487304688,
      "text": " and His work that He completed."
    },
    {
      "id": 145,
      "start": 2753.2599487304688,
      "end": 2755.6599731445312,
      "text": " And so Paul makes this presentation"
    },
    {
      "id": 146,
      "start": 2755.6599731445312,
      "end": 2758.3399658203125,
      "text": " to these believers in Colossae."
    },
    {
      "id": 147,
      "start": 2758.3399658203125,
      "end": 2760.179962158203,
      "text": " How do we respond?"
    },
    {
      "id": 148,
      "start": 2760.179962158203,
      "end": 2761.8599548339844,
      "text": " Number two, I've simply said this,"
    },
    {
      "id": 149,
      "start": 2761.8599548339844,
      "end": 2764.419952392578,
      "text": " the appropriate response."
    },
    {
      "id": 150,
      "start": 2764.419952392578,
      "end": 2766.1399536132812,
      "text": " The appropriate response."
    },
    {
      "id": 151,
      "start": 2766.1399536132812,
      "end": 2767.739959716797,
      "text": " When you read all of these things,"
    },
    {
      "id": 152,
      "start": 2767.739959716797,
      "end": 2769.3799743652344,
      "text": " when you receive this great truth"
    },
    {
      "id": 153,
      "start": 2769.3799743652344,
      "end": 2772.3799743652344,
      "text": " that Paul reveals to these believers in Colossae,"
    },
    {
      "id": 154,
      "start": 2772.3799743652344,
      "end": 2774.0999755859375,
      "text": " when you see the Lord Jesus Christ"
    },
    {
      "id": 155,
      "start": 2774.0999755859375,
      "end": 2775.5799560546875,
      "text": " exalted in this position,"
    },
    {
      "id": 156,
      "start": 2775.5799560546875,
      "end": 2777.8199462890625,
      "text": " when you understand that He is the image"
    },
    {
      "id": 157,
      "start": 2777.8199462890625,
      "end": 2778.979949951172,
      "text": " of the invisible God,"
    },
    {
      "id": 158,
      "start": 2778.979949951172,
      "end": 2780.179962158203,
      "text": " that He is the Creator,"
    },
    {
      "id": 159,
      "start": 2780.179962158203,
      "end": 2781.219970703125,
      "text": " He is the Redeemer,"
    },
    {
      "id": 160,
      "start": 2781.219970703125,
      "end": 2783.5399475097656,
      "text": " He is the head of the body of the church,"
    },
    {
      "id": 161,
      "start": 2783.5399475097656,
      "end": 2784.8199462890625,
      "text": " what's the proper response?"
    },
    {
      "id": 162,
      "start": 2784.8199462890625,
      "end": 2787.979949951172,
      "text": " Well, notice in verse 18."
    },
    {
      "id": 163,
      "start": 2787.979949951172,
      "end": 2790.8199462890625,
      "text": " The Bible says this at the end of verse 18."
    },
    {
      "id": 164,
      "start": 2790.8199462890625,
      "end": 2793.0599670410156,
      "text": " That in all things,"
    },
    {
      "id": 165,
      "start": 2793.0599670410156,
      "end": 2797.8999633789062,
      "text": " He might have the preeminence."
    },
    {
      "id": 166,
      "start": 2797.8999633789062,
      "end": 2799.3399658203125,
      "text": " That in all things,"
    },
    {
      "id": 167,
      "start": 2799.3399658203125,
      "end": 2802.4599609375,
      "text": " He might have the preeminence."
    },
    {
      "id": 168,
      "start": 2802.4599609375,
      "end": 2805.2999572753906,
      "text": " Wouldn't that simply be"
    },
    {
      "id": 169,
      "start": 2805.2999572753906,
      "end": 2807.979949951172,
      "text": " the logical conclusion that we would reach?"
    },
    {
      "id": 170,
      "start": 2807.979949951172,
      "end": 2810.0999755859375,
      "text": " When we understand who He is."
    },
    {
      "id": 171,
      "start": 2810.0999755859375,
      "end": 2811.6199645996094,
      "text": " When He's presented in the fashion"
    },
    {
      "id": 172,
      "start": 2811.6199645996094,
      "end": 2813.3399658203125,
      "text": " in which He has been."
    },
    {
      "id": 173,
      "start": 2813.3399658203125,
      "end": 2815.219970703125,
      "text": " And we understand who Jesus is,"
    },
    {
      "id": 174,
      "start": 2815.219970703125,
      "end": 2817.0599670410156,
      "text": " it would only seem logical to me"
    },
    {
      "id": 175,
      "start": 2817.0599670410156,
      "end": 2818.219970703125,
      "text": " that we would say,"
    },
    {
      "id": 176,
      "start": 2818.219970703125,
      "end": 2820.5399475097656,
      "text": " yes, He deserves the preeminence"
    },
    {
      "id": 177,
      "start": 2820.5399475097656,
      "end": 2822.0599670410156,
      "text": " in every area of my life."
    },
    {
      "id": 178,
      "start": 2822.0599670410156,
      "end": 2824.0599670410156,
      "text": " That word preeminence is the only place"
    },
    {
      "id": 179,
      "start": 2824.0599670410156,
      "end": 2825.979949951172,
      "text": " in the New Testament in which it's found."
    },
    {
      "id": 180,
      "start": 2825.979949951172,
      "end": 2827.5799560546875,
      "text": " And that word means to be first"
    },
    {
      "id": 181,
      "start": 2827.5799560546875,
      "end": 2830.8199462890625,
      "text": " or to hold the first place."
    },
    {
      "id": 182,
      "start": 2830.8199462890625,
      "end": 2833.4599609375,
      "text": " Doesn't He deserve that position?"
    },
    {
      "id": 183,
      "start": 2833.499969482422,
      "end": 2836.0199584960938,
      "text": " Isn't our appropriate response"
    },
    {
      "id": 184,
      "start": 2836.0199584960938,
      "end": 2838.8599548339844,
      "text": " to the truth that is before us this morning"
    },
    {
      "id": 185,
      "start": 2838.8599548339844,
      "end": 2842.5399475097656,
      "text": " to say it's all about Jesus?"
    },
    {
      "id": 186,
      "start": 2842.5399475097656,
      "end": 2843.5799560546875,
      "text": " It should be this,"
    },
    {
      "id": 187,
      "start": 2843.5799560546875,
      "end": 2845.3799743652344,
      "text": " that we say like John the Baptist said"
    },
    {
      "id": 188,
      "start": 2845.3799743652344,
      "end": 2847.219970703125,
      "text": " in John 3 and verse 30,"
    },
    {
      "id": 189,
      "start": 2847.219970703125,
      "end": 2851.979949951172,
      "text": " He must increase, I must decrease."
    },
    {
      "id": 190,
      "start": 2851.979949951172,
      "end": 2853.5799560546875,
      "text": " That in all things,"
    },
    {
      "id": 191,
      "start": 2853.5799560546875,
      "end": 2858.1399536132812,
      "text": " He might have the preeminence."
    },
    {
      "id": 192,
      "start": 2858.1399536132812,
      "end": 2861.8599548339844,
      "text": " Oh, that we would live our lives in that fashion."
    },
    {
      "id": 193,
      "start": 2861.8599548339844,
      "end": 2863.0599670410156,
      "text": " It's not about what I want,"
    },
    {
      "id": 194,
      "start": 2863.0599670410156,
      "end": 2865.0199584960938,
      "text": " it's about what God wants."
    },
    {
      "id": 195,
      "start": 2865.0199584960938,
      "end": 2867.0199584960938,
      "text": " Paul says it this way in 1 Corinthians 6"
    },
    {
      "id": 196,
      "start": 2867.0199584960938,
      "end": 2868.1399536132812,
      "text": " and verses 19 and 20."
    },
    {
      "id": 197,
      "start": 2868.1399536132812,
      "end": 2869.0599670410156,
      "text": " What?"
    },
    {
      "id": 198,
      "start": 2869.0599670410156,
      "end": 2871.419952392578,
      "text": " Know ye not?"
    },
    {
      "id": 199,
      "start": 2871.419952392578,
      "end": 2872.219970703125,
      "text": " Right?"
    },
    {
      "id": 200,
      "start": 2872.219970703125,
      "end": 2874.2599487304688,
      "text": " I think about the way in which"
    },
    {
      "id": 201,
      "start": 2874.2599487304688,
      "end": 2875.8599548339844,
      "text": " he starts that passage of Scripture"
    },
    {
      "id": 202,
      "start": 2875.8599548339844,
      "end": 2876.8599548339844,
      "text": " as if he's saying,"
    },
    {
      "id": 203,
      "start": 2876.8599548339844,
      "end": 2878.0599670410156,
      "text": " are you ignorant to this?"
    },
    {
      "id": 204,
      "start": 2878.0599670410156,
      "end": 2880.0199584960938,
      "text": " You know not this truth?"
    },
    {
      "id": 205,
      "start": 2880.0199584960938,
      "end": 2880.8599548339844,
      "text": " What's this truth?"
    },
    {
      "id": 206,
      "start": 2880.8599548339844,
      "end": 2883.8599548339844,
      "text": " That you've been bought with a price."
    },
    {
      "id": 207,
      "start": 2883.8599548339844,
      "end": 2886.179962158203,
      "text": " Therefore, the natural conclusion"
    },
    {
      "id": 208,
      "start": 2886.179962158203,
      "end": 2887.5799560546875,
      "text": " of being bought with a price"
    },
    {
      "id": 209,
      "start": 2887.5799560546875,
      "end": 2889.0599670410156,
      "text": " is that you're to glorify God"
    },
    {
      "id": 210,
      "start": 2889.0599670410156,
      "end": 2890.2599487304688,
      "text": " in your body and your spirit,"
    },
    {
      "id": 211,
      "start": 2890.2599487304688,
      "end": 2891.739959716797,
      "text": " which are His."
    },
    {
      "id": 212,
      "start": 2891.739959716797,
      "end": 2893.6199645996094,
      "text": " He owns us."
    },
    {
      "id": 213,
      "start": 2893.6199645996094,
      "end": 2895.3399658203125,
      "text": " When we understand that without Him"
    },
    {
      "id": 214,
      "start": 2895.3399658203125,
      "end": 2896.3399658203125,
      "text": " we can do nothing,"
    },
    {
      "id": 215,
      "start": 2896.3399658203125,
      "end": 2898.2999572753906,
      "text": " when we understand that He has done for us"
    },
    {
      "id": 216,
      "start": 2898.2999572753906,
      "end": 2900.8999633789062,
      "text": " what I could not do for myself"
    },
    {
      "id": 217,
      "start": 2900.8999633789062,
      "end": 2902.7799682617188,
      "text": " and what no one else could do for me,"
    },
    {
      "id": 218,
      "start": 2902.7799682617188,
      "end": 2904.6199645996094,
      "text": " that I say, yes,"
    },
    {
      "id": 219,
      "start": 2904.6199645996094,
      "end": 2906.3799743652344,
      "text": " I want to give Him the preeminence."
    },
    {
      "id": 220,
      "start": 2906.3799743652344,
      "end": 2910.0599670410156,
      "text": " I want to crown Him Lord of lords"
    },
    {
      "id": 221,
      "start": 2910.0599670410156,
      "end": 2911.419952392578,
      "text": " in my life."
    },
    {
      "id": 222,
      "start": 2911.419952392578,
      "end": 2914.179962158203,
      "text": " See, the reality is that He is Lord."
    },
    {
      "id": 223,
      "start": 2914.179962158203,
      "end": 2916.219970703125,
      "text": " He is King."
    },
    {
      "id": 224,
      "start": 2916.219970703125,
      "end": 2917.3799438476562,
      "text": " There are times in which"
    },
    {
      "id": 225,
      "start": 2917.3799438476562,
      "end": 2919.0999755859375,
      "text": " in our lives individually,"
    },
    {
      "id": 226,
      "start": 2919.1399536132812,
      "end": 2923.0199584960938,
      "text": " He may not be the Lord and King of my life."
    },
    {
      "id": 227,
      "start": 2923.0199584960938,
      "end": 2925.3799438476562,
      "text": " Who sits upon that throne"
    },
    {
      "id": 228,
      "start": 2925.3799438476562,
      "end": 2929.0599365234375,
      "text": " of your heart, of your life?"
    },
    {
      "id": 229,
      "start": 2929.0599365234375,
      "end": 2933.699951171875,
      "text": " You know who wants to sit on that throne is self."
    },
    {
      "id": 230,
      "start": 2933.699951171875,
      "end": 2935.4999389648438,
      "text": " And it's a constant battle."
    },
    {
      "id": 231,
      "start": 2935.4999389648438,
      "end": 2936.6599731445312,
      "text": " That's why Paul said,"
    },
    {
      "id": 232,
      "start": 2936.6599731445312,
      "end": 2939.5799560546875,
      "text": " I am crucified with Christ."
    },
    {
      "id": 233,
      "start": 2939.5799560546875,
      "end": 2940.8599853515625,
      "text": " Because the constant battle"
    },
    {
      "id": 234,
      "start": 2940.8599853515625,
      "end": 2945.0599365234375,
      "text": " is that self wants to be first."
    },
    {
      "id": 235,
      "start": 2945.0599365234375,
      "end": 2946.4999389648438,
      "text": " I think it was D.L. Moody that said"
    },
    {
      "id": 236,
      "start": 2946.4999389648438,
      "end": 2948.4599609375,
      "text": " if He is not Lord of all,"
    },
    {
      "id": 237,
      "start": 2948.4599609375,
      "end": 2951.3799438476562,
      "text": " He is not Lord at all."
    },
    {
      "id": 238,
      "start": 2951.3799438476562,
      "end": 2953.4599609375,
      "text": " What powerful statement"
    },
    {
      "id": 239,
      "start": 2953.4599609375,
      "end": 2957.7799682617188,
      "text": " that old preacher of yesteryear made."
    },
    {
      "id": 240,
      "start": 2957.7799682617188,
      "end": 2960.0199584960938,
      "text": " This morning as we look at this appropriate response,"
    },
    {
      "id": 241,
      "start": 2960.0199584960938,
      "end": 2961.6599731445312,
      "text": " we'd say first of all,"
    },
    {
      "id": 242,
      "start": 2961.6599731445312,
      "end": 2964.0199584960938,
      "text": " that we should crown Him Lord of our lives."
    },
    {
      "id": 243,
      "start": 2964.0199584960938,
      "end": 2967.6199340820312,
      "text": " That He would be the Master in our lives."
    },
    {
      "id": 244,
      "start": 2967.6199340820312,
      "end": 2970.2999877929688,
      "text": " That He would have the preeminence."
    },
    {
      "id": 245,
      "start": 2970.2999877929688,
      "end": 2971.97998046875,
      "text": " I believe that many times today,"
    },
    {
      "id": 246,
      "start": 2971.97998046875,
      "end": 2973.739990234375,
      "text": " unfortunately, there are people"
    },
    {
      "id": 247,
      "start": 2973.739990234375,
      "end": 2974.97998046875,
      "text": " that are looking for a Savior,"
    },
    {
      "id": 248,
      "start": 2974.97998046875,
      "end": 2977.179931640625,
      "text": " but not for a Master."
    },
    {
      "id": 249,
      "start": 2977.219970703125,
      "end": 2978.699951171875,
      "text": " What do I mean by that?"
    },
    {
      "id": 250,
      "start": 2978.699951171875,
      "end": 2980.4999389648438,
      "text": " Well, they want somebody to deliver them"
    },
    {
      "id": 251,
      "start": 2980.4999389648438,
      "end": 2982.219970703125,
      "text": " from the penalty of sin,"
    },
    {
      "id": 252,
      "start": 2982.219970703125,
      "end": 2985.8599853515625,
      "text": " but they're not interested in that same somebody"
    },
    {
      "id": 253,
      "start": 2985.8599853515625,
      "end": 2988.8999633789062,
      "text": " controlling their life."
    },
    {
      "id": 254,
      "start": 2988.8999633789062,
      "end": 2990.4599609375,
      "text": " Why? Because I have my ambitions."
    },
    {
      "id": 255,
      "start": 2990.4599609375,
      "end": 2991.4999389648438,
      "text": " I have my desires."
    },
    {
      "id": 256,
      "start": 2991.4999389648438,
      "end": 2993.699951171875,
      "text": " I have my..."
    },
    {
      "id": 257,
      "start": 2993.699951171875,
      "end": 2995.6599731445312,
      "text": " But we've been bought with a price."
    },
    {
      "id": 258,
      "start": 2995.6599731445312,
      "end": 2997.0599365234375,
      "text": " We're not our own."
    },
    {
      "id": 259,
      "start": 2997.0599365234375,
      "end": 2999.3799438476562,
      "text": " Number two, how we should respond,"
    },
    {
      "id": 260,
      "start": 2999.3799438476562,
      "end": 3000.5399780273438,
      "text": " the appropriate response,"
    },
    {
      "id": 261,
      "start": 3000.5399780273438,
      "end": 3002.3799438476562,
      "text": " is that we would continue."
    },
    {
      "id": 262,
      "start": 3002.3799438476562,
      "end": 3003.739990234375,
      "text": " Notice in verse number 23,"
    },
    {
      "id": 0,
      "start": 3003.739990234375,
      "end": 3010.2599902153015,
      "text": " The Bible says this, if you continue in the faith, grounded and settled, and be not moved"
    },
    {
      "id": 1,
      "start": 3010.2599902153015,
      "end": 3014.479990005493,
      "text": " away from the hope of the gospel, which ye have heard, and which was preached to every"
    },
    {
      "id": 2,
      "start": 3014.479990005493,
      "end": 3018.859990119934,
      "text": " creature which is under heaven, whereof I, Paul, am made a minister.\""
    },
    {
      "id": 3,
      "start": 3018.859990119934,
      "end": 3024.0999908447266,
      "text": " When you're speaking about this idea of continuing, you remember as we were studying the passage"
    },
    {
      "id": 4,
      "start": 3024.0999908447266,
      "end": 3029.4599895477295,
      "text": " of Scripture with the prayer of Paul, and we talked about the truth in verse number"
    },
    {
      "id": 5,
      "start": 3029.4599895477295,
      "end": 3033.899990081787,
      "text": " 11, that he said, strengthened with all might, according to his glorious power, unto all"
    },
    {
      "id": 6,
      "start": 3033.899990081787,
      "end": 3037.299991607666,
      "text": " patience and longsuffering, with joyfulness."
    },
    {
      "id": 7,
      "start": 3037.299991607666,
      "end": 3041.9399909973145,
      "text": " As we looked at that passage of Scripture and we understood the truth that what Paul"
    },
    {
      "id": 8,
      "start": 3041.9399909973145,
      "end": 3048.419990539551,
      "text": " was giving for these believers to understand that what was produced was that spiritual"
    },
    {
      "id": 9,
      "start": 3048.419990539551,
      "end": 3055.019989013672,
      "text": " maturity, that endurance, that steadfastness, that continuing, if you will, to do the will"
    },
    {
      "id": 10,
      "start": 3055.019989013672,
      "end": 3056.019989013672,
      "text": " of God."
    },
    {
      "id": 11,
      "start": 3056.019989013672,
      "end": 3061.339988708496,
      "text": " And we see here in verse number 23 that he says, if you continue in the faith, grounded"
    },
    {
      "id": 12,
      "start": 3061.339988708496,
      "end": 3067.3799896240234,
      "text": " and settled, and be not moved away from the hope of the gospel, which ye have heard, and"
    },
    {
      "id": 13,
      "start": 3067.3799896240234,
      "end": 3070.459991455078,
      "text": " which was preached to every creature which is under heaven, whereof I, Paul, am made"
    },
    {
      "id": 14,
      "start": 3070.459991455078,
      "end": 3071.459991455078,
      "text": " a minister."
    },
    {
      "id": 15,
      "start": 3071.459991455078,
      "end": 3075.8999938964844,
      "text": " So notice with me and consider with me the danger that is present that they would be"
    },
    {
      "id": 16,
      "start": 3075.8999938964844,
      "end": 3076.9799880981445,
      "text": " moved away."
    },
    {
      "id": 17,
      "start": 3076.9799880981445,
      "end": 3079.619987487793,
      "text": " How are they going to be moved away?"
    },
    {
      "id": 18,
      "start": 3079.619987487793,
      "end": 3081.739990234375,
      "text": " False teachers."
    },
    {
      "id": 19,
      "start": 3081.739990234375,
      "end": 3082.739990234375,
      "text": " False teachers."
    },
    {
      "id": 20,
      "start": 3083.459991455078,
      "end": 3089.059989929199,
      "text": " Now, we'd understand here that he says that you would continue in the faith grounded and"
    },
    {
      "id": 21,
      "start": 3089.059989929199,
      "end": 3090.059989929199,
      "text": " settled."
    },
    {
      "id": 22,
      "start": 3090.059989929199,
      "end": 3095.7799911499023,
      "text": " Again, we see the importance, the significance of discipleship and spiritual maturity through"
    },
    {
      "id": 23,
      "start": 3095.7799911499023,
      "end": 3098.4999923706055,
      "text": " this phraseology of being grounded and settled."
    },
    {
      "id": 24,
      "start": 3098.4999923706055,
      "end": 3103.459991455078,
      "text": " I would say this, that if we're grounded and settled, it will go a long way to keep us"
    },
    {
      "id": 25,
      "start": 3103.459991455078,
      "end": 3106.6599884033203,
      "text": " from being moved away."
    },
    {
      "id": 26,
      "start": 3106.6599884033203,
      "end": 3108.859992980957,
      "text": " Because we're grounded and settled."
    },
    {
      "id": 27,
      "start": 3109.1799926757812,
      "end": 3116.8999938964844,
      "text": " Listen, I hope that no one could come to you and say that you could get to heaven by your"
    },
    {
      "id": 28,
      "start": 3116.8999938964844,
      "end": 3118.7799911499023,
      "text": " own works."
    },
    {
      "id": 29,
      "start": 3118.7799911499023,
      "end": 3124.6999893188477,
      "text": " I hope that you're grounded and settled enough to know that's a false teaching."
    },
    {
      "id": 30,
      "start": 3124.6999893188477,
      "end": 3126.059989929199,
      "text": " And here's why that's a false teaching."
    },
    {
      "id": 31,
      "start": 3126.059989929199,
      "end": 3128.419990539551,
      "text": " You have some verses that you can go to."
    },
    {
      "id": 32,
      "start": 3128.419990539551,
      "end": 3131.519989013672,
      "text": " And you can say, well, the Bible says this, and here's a passage of Scripture that deals"
    },
    {
      "id": 33,
      "start": 3131.519989013672,
      "end": 3132.519989013672,
      "text": " with this."
    },
    {
      "id": 34,
      "start": 3132.519989013672,
      "end": 3136.8999938964844,
      "text": " It's not of our own works, not of the works of our own righteousness that we have done."
    },
    {
      "id": 35,
      "start": 3136.8999938964844,
      "end": 3138.499984741211,
      "text": " We're not clothed in our righteousness."
    },
    {
      "id": 36,
      "start": 3138.499984741211,
      "end": 3141.3799896240234,
      "text": " We're clothed in the righteousness of Christ."
    },
    {
      "id": 37,
      "start": 3141.3799896240234,
      "end": 3145.5799865722656,
      "text": " The Bible says that it's a gift of God, not of works, lest any man should boast."
    },
    {
      "id": 38,
      "start": 3145.5799865722656,
      "end": 3150.2999877929688,
      "text": " Just to use one example, if we're grounded and settled, it will go a long way to keep"
    },
    {
      "id": 39,
      "start": 3150.2999877929688,
      "end": 3152.8599853515625,
      "text": " us from being moved away."
    },
    {
      "id": 40,
      "start": 3152.8599853515625,
      "end": 3158.1399841308594,
      "text": " You know, the believers in the region of Galatia, as Paul is ministering to those believers"
    },
    {
      "id": 41,
      "start": 3158.1399841308594,
      "end": 3162.0999908447266,
      "text": " in Galatians chapter number one, of course, we know that it's a number of churches there"
    },
    {
      "id": 42,
      "start": 3162.0999908447266,
      "end": 3167.439987182617,
      "text": " in Galatia, a church in Antioch and Pisidia and Iconium, Lystra, and Derbe."
    },
    {
      "id": 43,
      "start": 3167.439987182617,
      "end": 3170.039993286133,
      "text": " And it says in verse number two, that the church is in Galatia."
    },
    {
      "id": 44,
      "start": 3170.039993286133,
      "end": 3174.019989013672,
      "text": " But notice with me, the Bible says this in verse number six."
    },
    {
      "id": 45,
      "start": 3174.019989013672,
      "end": 3176.519989013672,
      "text": " He says in Galatians 1 verse number six,"
    },
    {
      "id": 46,
      "start": 3176.519989013672,
      "end": 3183.5599975585938,
      "text": " I marvel that ye are so soon removed from him that called you into the grace of Christ"
    },
    {
      "id": 47,
      "start": 3183.5599975585938,
      "end": 3186.3399963378906,
      "text": " unto another gospel."
    },
    {
      "id": 48,
      "start": 3186.3399963378906,
      "end": 3191.5599975585938,
      "text": " And then he says this, which is not another, but there be some that trouble you and would"
    },
    {
      "id": 49,
      "start": 3191.5599975585938,
      "end": 3194.8799896240234,
      "text": " pervert the gospel of Christ."
    },
    {
      "id": 50,
      "start": 3194.8799896240234,
      "end": 3199.6399841308594,
      "text": " But though we are an angel from heaven, preach any other gospel unto you that, that which"
    },
    {
      "id": 51,
      "start": 3199.6399841308594,
      "end": 3205.999984741211,
      "text": " we have preached unto you, let him be accursed, strong language."
    },
    {
      "id": 52,
      "start": 3205.999984741211,
      "end": 3209.8599853515625,
      "text": " But what happened in these churches in Galatia, there are some false teachers there, the Judaizers"
    },
    {
      "id": 53,
      "start": 3209.8599853515625,
      "end": 3214.5999908447266,
      "text": " in particular, and those false teachers were teaching something other."
    },
    {
      "id": 54,
      "start": 3214.5999908447266,
      "end": 3219.6799926757812,
      "text": " And Paul says, I am, I marvel that you're so soon removed from him that called you into"
    },
    {
      "id": 55,
      "start": 3219.6799926757812,
      "end": 3221.8799896240234,
      "text": " the grace of Christ unto another gospel."
    },
    {
      "id": 56,
      "start": 3221.8799896240234,
      "end": 3225.3399963378906,
      "text": " Notice that phraseology, that they were so soon removed."
    },
    {
      "id": 57,
      "start": 3225.3399963378906,
      "end": 3227.239990234375,
      "text": " What does he say in Colossians 1?"
    },
    {
      "id": 58,
      "start": 3227.239990234375,
      "end": 3235.1599884033203,
      "text": " He says this, if you continue in the faith, grounded and settled, and be not moved away."
    },
    {
      "id": 59,
      "start": 3235.1599884033203,
      "end": 3237.3199920654297,
      "text": " Now let me say this."
    },
    {
      "id": 60,
      "start": 3237.3199920654297,
      "end": 3243.3599853515625,
      "text": " These people in Colossae that are being written to in Colossians in this book, they are referred"
    },
    {
      "id": 61,
      "start": 3243.3599853515625,
      "end": 3249.0799865722656,
      "text": " to in verse number two as the saints and faithful brethren in Christ, which are at Colossae."
    },
    {
      "id": 62,
      "start": 3249.0799865722656,
      "end": 3250.539993286133,
      "text": " They're saved people."
    },
    {
      "id": 63,
      "start": 3250.539993286133,
      "end": 3252.219985961914,
      "text": " We believe in eternal security."
    },
    {
      "id": 64,
      "start": 3252.219985961914,
      "end": 3254.459991455078,
      "text": " We are kept by the power of God."
    },
    {
      "id": 65,
      "start": 3254.459991455078,
      "end": 3259.699996948242,
      "text": " Jesus said in John chapter number 10, that my sheep hear my voice and I know them and"
    },
    {
      "id": 66,
      "start": 3259.699996948242,
      "end": 3263.779998779297,
      "text": " I give unto them eternal life and they shall never perish."
    },
    {
      "id": 67,
      "start": 3263.779998779297,
      "end": 3267.8999938964844,
      "text": " I'm so thankful for the truth of eternal security."
    },
    {
      "id": 68,
      "start": 3267.8999938964844,
      "end": 3273.5799865722656,
      "text": " Here in verse number 23, he's not teaching that they would lose their salvation."
    },
    {
      "id": 69,
      "start": 3273.5799865722656,
      "end": 3277.4199829101562,
      "text": " If they've been saved, they are secure in Christ."
    },
    {
      "id": 70,
      "start": 3277.4199829101562,
      "end": 3278.4199829101562,
      "text": " So what is he teaching?"
    },
    {
      "id": 71,
      "start": 3278.4199829101562,
      "end": 3279.4199829101562,
      "text": " What are the false teachers?"
    },
    {
      "id": 72,
      "start": 3279.4199829101562,
      "end": 3285.6600036621094,
      "text": " Why do the false teachers come after saved people if they can't cause you to be lost?"
    },
    {
      "id": 73,
      "start": 3285.6600036621094,
      "end": 3289.5799865722656,
      "text": " Because they can attack your effectiveness."
    },
    {
      "id": 74,
      "start": 3289.5799865722656,
      "end": 3293.759979248047,
      "text": " You think about the work of a false teacher, bringing in confusion and chaos and all sorts"
    },
    {
      "id": 75,
      "start": 3293.759979248047,
      "end": 3294.759979248047,
      "text": " of things."
    },
    {
      "id": 76,
      "start": 3294.759979248047,
      "end": 3298.8199768066406,
      "text": " And it begins that you're not going to continue to preach the same message that you receive"
    },
    {
      "id": 77,
      "start": 3298.8199768066406,
      "end": 3302.97998046875,
      "text": " because you're so messed up and you're so confused about what the real truth is."
    },
    {
      "id": 78,
      "start": 3302.97998046875,
      "end": 3308.259979248047,
      "text": " And now what's happening is your effectiveness on reaching other people with that powerful"
    },
    {
      "id": 79,
      "start": 3308.259979248047,
      "end": 3313.8199768066406,
      "text": " gospel that's able to save souls, your effectiveness is hindered."
    },
    {
      "id": 80,
      "start": 3313.8199768066406,
      "end": 3317.459991455078,
      "text": " If you don't know the truth of eternal security, how are you going to help somebody with eternal"
    },
    {
      "id": 81,
      "start": 3317.459991455078,
      "end": 3319.259979248047,
      "text": " security?"
    },
    {
      "id": 82,
      "start": 3319.259979248047,
      "end": 3324.3800048828125,
      "text": " If you don't know the truth that Jesus is the only Savior, that Jesus Christ himself"
    },
    {
      "id": 83,
      "start": 3324.3800048828125,
      "end": 3329.459991455078,
      "text": " said, I am the way, the truth, and the life, no man cometh unto the Father but by me."
    },
    {
      "id": 84,
      "start": 3329.459991455078,
      "end": 3333.699981689453,
      "text": " If Peter stood with great power and said, neither is there salvation in any other for"
    },
    {
      "id": 85,
      "start": 3333.699981689453,
      "end": 3337.5799865722656,
      "text": " there's no other name under heaven given among men whereby we must be saved."
    },
    {
      "id": 86,
      "start": 3337.5799865722656,
      "end": 3342.1399841308594,
      "text": " If we don't know those truths, because some false teachers have gotten us all kinds of"
    },
    {
      "id": 87,
      "start": 3342.1399841308594,
      "end": 3347.6199951171875,
      "text": " sideways and we've been moved away, I'm still secure in Christ, but my effectiveness on"
    },
    {
      "id": 88,
      "start": 3347.6199951171875,
      "end": 3351.5799865722656,
      "text": " reaching the world with the gospel is greatly hindered."
    },
    {
      "id": 89,
      "start": 3351.5799865722656,
      "end": 3357.3800048828125,
      "text": " And that's what the false teacher wants to do."
    },
    {
      "id": 90,
      "start": 3357.3800048828125,
      "end": 3359.8599853515625,
      "text": " He wants to keep people from being saved."
    },
    {
      "id": 91,
      "start": 3360.8599853515625,
      "end": 3367.6600036621094,
      "text": " And so the attack upon the church that the enemy brings on introducing false teaching,"
    },
    {
      "id": 92,
      "start": 3367.6600036621094,
      "end": 3374.459991455078,
      "text": " these men that are referenced in Jude, verse number 3 and 4, that had crept in unawares,"
    },
    {
      "id": 93,
      "start": 3374.459991455078,
      "end": 3379.5399780273438,
      "text": " that turned the grace of God into lasciviousness."
    },
    {
      "id": 94,
      "start": 3379.5399780273438,
      "end": 3383.5,
      "text": " Jude says, it was needful that I write unto you."
    },
    {
      "id": 95,
      "start": 3383.5,
      "end": 3384.5,
      "text": " It was necessary."
    },
    {
      "id": 96,
      "start": 3384.5,
      "end": 3386.2999877929688,
      "text": " It was of utmost importance."
    },
    {
      "id": 97,
      "start": 3386.2999877929688,
      "end": 3387.2999877929688,
      "text": " Why?"
    },
    {
      "id": 98,
      "start": 3387.2999877929688,
      "end": 3388.8599853515625,
      "text": " Because these false teachers are coming in."
    },
    {
      "id": 99,
      "start": 3388.8599853515625,
      "end": 3393.3399963378906,
      "text": " I'm thankful for my security in Christ, but I want to continue in this and I want to be"
    },
    {
      "id": 100,
      "start": 3393.3399963378906,
      "end": 3394.3399963378906,
      "text": " grounded and settled."
    },
    {
      "id": 101,
      "start": 3394.3399963378906,
      "end": 3398.5799865722656,
      "text": " And it's not the idea that if I get all kinds of sideways because of a false teacher that"
    },
    {
      "id": 102,
      "start": 3398.5799865722656,
      "end": 3399.5799865722656,
      "text": " I'm going to lose my salvation."
    },
    {
      "id": 103,
      "start": 3399.5799865722656,
      "end": 3406.3800048828125,
      "text": " No, but I'm going to lose my effectiveness."
    },
    {
      "id": 104,
      "start": 3406.3800048828125,
      "end": 3412.2999877929688,
      "text": " There's a lot of people today in our world that kind of carry that idea, you just be"
    },
    {
      "id": 105,
      "start": 3412.2999877929688,
      "end": 3416.8999938964844,
      "text": " sincere about what you believe and at the end everything's going to be okay."
    },
    {
      "id": 106,
      "start": 3416.8999938964844,
      "end": 3421.1799926757812,
      "text": " Just sincerely embrace and believe what you believe."
    },
    {
      "id": 107,
      "start": 3421.1799926757812,
      "end": 3422.739990234375,
      "text": " All roads lead to heaven."
    },
    {
      "id": 108,
      "start": 3422.739990234375,
      "end": 3425.3800048828125,
      "text": " I've heard it so many times."
    },
    {
      "id": 109,
      "start": 3425.3800048828125,
      "end": 3428.6600036621094,
      "text": " It's just not true."
    },
    {
      "id": 110,
      "start": 3428.6600036621094,
      "end": 3431.6600036621094,
      "text": " It's just not true."
    },
    {
      "id": 111,
      "start": 3431.6600036621094,
      "end": 3433.779998779297,
      "text": " But the false teachers, the enemy, right?"
    },
    {
      "id": 112,
      "start": 3433.779998779297,
      "end": 3437.4199829101562,
      "text": " The God of this world has blinded the minds of them which believe not, lest the light"
    },
    {
      "id": 113,
      "start": 3437.4199829101562,
      "end": 3441.459991455078,
      "text": " of the glorious gospel should shine unto them, according to 2 Corinthians, chapter number"
    },
    {
      "id": 114,
      "start": 3441.459991455078,
      "end": 3442.459991455078,
      "text": " 4."
    },
    {
      "id": 115,
      "start": 3442.459991455078,
      "end": 3447.0999755859375,
      "text": " And so we find that these false teachers, they're going to continue to attack and to"
    },
    {
      "id": 116,
      "start": 3447.0999755859375,
      "end": 3449.1399841308594,
      "text": " continue to try to tear down."
    },
    {
      "id": 117,
      "start": 3449.1399841308594,
      "end": 3456.0999755859375,
      "text": " And when you or when I stand up and I say, Jesus is the only way, oh man, they don't"
    },
    {
      "id": 118,
      "start": 3456.0999755859375,
      "end": 3457.0999755859375,
      "text": " like that."
    },
    {
      "id": 119,
      "start": 3457.0999755859375,
      "end": 3459.3399963378906,
      "text": " They don't like that."
    },
    {
      "id": 120,
      "start": 3459.3399963378906,
      "end": 3463.0599975585938,
      "text": " In fact, I preached a message several years ago about that very subject, Jesus is the"
    },
    {
      "id": 121,
      "start": 3463.0599975585938,
      "end": 3465.019989013672,
      "text": " only way."
    },
    {
      "id": 122,
      "start": 3465.019989013672,
      "end": 3472.0599975585938,
      "text": " There was a large, large church, a Baptist church, unfortunately, in New York City."
    },
    {
      "id": 123,
      "start": 3472.0599975585938,
      "end": 3477.5799865722656,
      "text": " The pastor stood up and he preached a message, and in his message, he said, this thinking"
    },
    {
      "id": 124,
      "start": 3477.5799865722656,
      "end": 3483.3399963378906,
      "text": " that Jesus is the only way is outdated, and it's just not true, and you can't support"
    },
    {
      "id": 125,
      "start": 3483.3399963378906,
      "end": 3485.459991455078,
      "text": " it biblically."
    },
    {
      "id": 126,
      "start": 3485.459991455078,
      "end": 3492.1399841308594,
      "text": " And when he made that statement in a church of 10 or 15,000 people, you could hear in"
    },
    {
      "id": 127,
      "start": 3492.1399841308594,
      "end": 3500.0999755859375,
      "text": " the background applause and hooting and hollering at the support of the statement that was made."
    },
    {
      "id": 128,
      "start": 3500.1399841308594,
      "end": 3502.6600036621094,
      "text": " How sad."
    },
    {
      "id": 129,
      "start": 3502.6600036621094,
      "end": 3506.5399780273438,
      "text": " People are being, listen, they're condemned already."
    },
    {
      "id": 130,
      "start": 3506.5399780273438,
      "end": 3513.47998046875,
      "text": " And if we would, if the false teachers get their way and they subvert and they come in"
    },
    {
      "id": 131,
      "start": 3513.47998046875,
      "end": 3519.97998046875,
      "text": " and they undermine the truth of the Word of God, then we find that people will continue"
    },
    {
      "id": 132,
      "start": 3519.97998046875,
      "end": 3523.1199951171875,
      "text": " to be lost in their sins."
    },
    {
      "id": 133,
      "start": 3523.1199951171875,
      "end": 3526.8999633789062,
      "text": " And so Paul says, let me exalt the Lord Jesus Christ."
    },
    {
      "id": 134,
      "start": 3527.6199951171875,
      "end": 3529.0999755859375,
      "text": " Let me help you."
    },
    {
      "id": 135,
      "start": 3529.0999755859375,
      "end": 3534.8200073242188,
      "text": " Let me remind you, and let me help you understand that He is the image of the invisible God."
    },
    {
      "id": 136,
      "start": 3534.8200073242188,
      "end": 3536.1799926757812,
      "text": " He's the Creator."
    },
    {
      "id": 137,
      "start": 3536.1799926757812,
      "end": 3537.47998046875,
      "text": " He's the Redeemer."
    },
    {
      "id": 138,
      "start": 3537.47998046875,
      "end": 3539.760009765625,
      "text": " He's the head of the body of the church."
    },
    {
      "id": 139,
      "start": 3539.760009765625,
      "end": 3545.5,
      "text": " And here's your appropriate response to such truth, that you would crown Him Lord and King"
    },
    {
      "id": 140,
      "start": 3545.5,
      "end": 3550.7000122070312,
      "text": " of your life, that in all things He would have the preeminence, and that you would continue."
    },
    {
      "id": 141,
      "start": 3550.7000122070312,
      "end": 3554.0599975585938,
      "text": " Don't be tossed to and fro with every wind of doctrine."
    },
    {
      "id": 142,
      "start": 3554.0599975585938,
      "end": 3557.0999755859375,
      "text": " No, be grounded and settled."
    },
    {
      "id": 143,
      "start": 3557.0999755859375,
      "end": 3562.7000122070312,
      "text": " You understand this morning that the right way is not always the popular way."
    },
    {
      "id": 144,
      "start": 3562.7000122070312,
      "end": 3567.5399780273438,
      "text": " I'd still rather be right with just a few people than be wrong with the multitudes."
    },
    {
      "id": 145,
      "start": 3567.5399780273438,
      "end": 3568.5399780273438,
      "text": " Amen."
    },
    {
      "id": 146,
      "start": 3568.5399780273438,
      "end": 3569.5399780273438,
      "text": " Let's pray."
    },
    {
      "id": 147,
      "start": 3569.5399780273438,
      "end": 3570.5399780273438,
      "text": " Father, we love You."
    },
    {
      "id": 148,
      "start": 3570.5399780273438,
      "end": 3572.0599975585938,
      "text": " We thank You for loving us."
    },
    {
      "id": 149,
      "start": 3572.0599975585938,
      "end": 3574.739990234375,
      "text": " We thank You for this passage of Scripture."
    },
    {
      "id": 150,
      "start": 3574.739990234375,
      "end": 3581.1799926757812,
      "text": " What great truth that You give us in Your Word."
    },
    {
      "id": 151,
      "start": 3581.1799926757812,
      "end": 3584.5,
      "text": " We thank You for our Savior."
    },
    {
      "id": 152,
      "start": 3584.5,
      "end": 3587.6599731445312,
      "text": " We thank You for who He is, God in flesh."
    },
    {
      "id": 153,
      "start": 3587.6599731445312,
      "end": 3588.8200073242188,
      "text": " We thank You for what He has done."
    },
    {
      "id": 154,
      "start": 3588.8200073242188,
      "end": 3595.2999877929688,
      "text": " We thank You for the redeeming work at Calvary, His substitutionary atonement, His death,"
    },
    {
      "id": 155,
      "start": 3595.2999877929688,
      "end": 3597.8200073242188,
      "text": " burial, and glorious resurrection."
    },
    {
      "id": 156,
      "start": 3597.8200073242188,
      "end": 3603.1400146484375,
      "text": " I pray this morning that You would help Your people."
    },
    {
      "id": 157,
      "start": 3603.1400146484375,
      "end": 3603.7799682617188,
      "text": " We know this is Your church."
    },
    {
      "id": 0,
      "start": 3603.7799682617188,
      "end": 3612.219967842102,
      "text": " church, God help us to be grounded and settled. Help us Lord to stand for truth,"
    },
    {
      "id": 1,
      "start": 3612.219967842102,
      "end": 3618.6999683380127,
      "text": " to contend for the faith. I pray that if there's one that's not sure of heaven,"
    },
    {
      "id": 2,
      "start": 3618.6999683380127,
      "end": 3623.939968109131,
      "text": " maybe they've been influenced by some false teachers, some false doctrine, maybe"
    },
    {
      "id": 3,
      "start": 3623.939968109131,
      "end": 3631.099967956543,
      "text": " they've been told that there's some other way to get to heaven. I pray that"
    },
    {
      "id": 4,
      "start": 3631.099967956543,
      "end": 3634.4999675750732,
      "text": " this morning the truth of your word, the Holy Spirit would take it and minister as"
    },
    {
      "id": 5,
      "start": 3634.4999675750732,
      "end": 3639.2999687194824,
      "text": " only he can. Would you be exalted in our midst during these few moments of"
    },
    {
      "id": 6,
      "start": 3639.2999687194824,
      "end": 3642.8599700927734,
      "text": " invitation? We'll thank you for all that you'll do for it's in Christ's name we"
    },
    {
      "id": 7,
      "start": 3642.8599700927734,
      "end": 3646.659969329834,
      "text": " pray. Would you stand with me? Kimberly's gonna play quietly on the piano. We will"
    },
    {
      "id": 8,
      "start": 3646.659969329834,
      "end": 3652.1399688720703,
      "text": " have a moment of invitation here and I encourage you at home to allow the Lord"
    },
    {
      "id": 9,
      "start": 3652.1399688720703,
      "end": 3655.2999687194824,
      "text": " to have his way in your life as you consider these truths from the Word of"
    },
    {
      "id": 10,
      "start": 3655.2999687194824,
      "end": 3660.37996673584,
      "text": " God. As Kimberly plays we'll have a moment of invitation."
    }
  ],
  "processed_at": "2025-04-17T08:40:54.167841"
}