{
  "video_id": "EP6z-pS8q5k",
  "text": "or 12 this evening, Genesis chapter number 12. You'll be looking at verses one through nine this evening. You notice in verse number four, as you're turning there in Genesis 12 and verse number four, the verse begins with these three words. So Abram departed, and that's the title for the message this evening. So Abram departed. I mentioned this in our last study in the latter part of Genesis chapter number 11, that at times I may refer to Abram as Abraham and please forgive me, I know that his name is not changed yet, but so often we refer to him as Abraham, and so if I slip, you'll understand why. And we see here throughout the text of scripture that his name at this particular time is still Abram. As we have previously discussed, in fact, in our very last lesson at the end of chapter number 11, we mentioned how the lens of scripture has now focused upon Abram and his descendants, the Hebrew people, the nation of Israel, as we often refer to them as. And we find that as we entered into the latter part of Genesis chapter 11, once again, there in the middle section of Genesis chapter 11, God gave us another record of the descendants of Shem to show us the lineage to Abram. And we find that as you enter into the last section in verses 27 down through verse number 32 of Genesis chapter 11, that God gives us an introduction to Abram and he describes the departure from the Ur of the Chaldees to Haran. We understand that he left the land of his nativity according to verse number 28. The land of his nativity was the Ur of the Chaldees and we find that it was there at the mouth of the Euphrates River. And at the end of chapter number 11, we find that they're still there in Haran. In fact, at the end of verse number 31, it says, and they came unto Haran and dwelt there. And we went through and studied this in our last message on Sunday evening a couple of weeks ago with regard to that subject matter. In the first section of Genesis chapter number 12, as we look at these first nine verses, we are now provided with the record of the journey from Haran to Canaan. And we find here that the word of God begins in verse number one. If you're taking notes this evening, number one, the instruction received. The instruction received, and really we find this in verse number one. I'm so thankful that our God would provide us with direction, with instruction. We understand the word of God is profitable. 2 Timothy 3 and verse number 16 speaks about the fact that God's word is profitable for doctrine, for instruction, right? We see reproof and so on and so forth is listed there, but we understand that God's word contains instruction for God's people. At this particular time, Abram did not have a Bible like we have a Bible. And so therefore the Lord spoke to him. And you notice the Bible begins in verse number one. It says, now the Lord, now just stop there just for a moment and consider that the Lord God of the universe, the Lord God almighty, that he is going to speak and he's going to give instruction. This instruction will be received by Abram. And we find that here it says had said unto Abram. Had said, we understand that this would indicate that God had given Abram some direction when he was back in the Ur of the Chaldees. In fact, as you begin to study scripture and compare scripture with scripture, in our last study, we referenced Acts 7, verses one through four. And you'll find there in that text of scripture as Stephen is preaching that he references about the call of God to Abram. And in the text of scripture in verse number two, Stephen says this, and he said, men, brethren and fathers hearken. The God of glory appeared unto our father Abraham when he was in Mesopotamia before he dwelt in Haran and said unto him, get thee out of thy country and from thy kindred and come into the land, which I will show thee. And so we find here that the Lord is speaking to Abram, that he's giving this direction, this instruction to this man. And it says that he had said again, if you go back to the latter part of Genesis chapter 11, this instruction has been given. It is now further repeated because he had been in Haran. Now understand that Haran was not the final destination for Abraham. This was not the place in which he was to dwell and the land in which God said that he would give them. As we mentioned, as you understand the landscape of the region of the world there that they're in, you would find that as they were at the mouth of the Euphrates, they went Northwest and really kind of followed the path of the Euphrates River until they came to Haran. And then they would now travel in chapter number 12, Southwest and eventually come to the land of Canaan, the place in which God would show him. Notice the Bible says, get thee out of thy country and from thy kindred and from thy father's house unto a land that I will show thee. We understand again that this instruction has been provided and as God is giving this instruction, it is important that Abraham would understand that it was time to leave Haran. He was not to dwell there any longer. We dealt with last week some of the reasons in which they may have stopped at Haran. We understand, the Bible tells us the end of verse number 32, that it was there that his father Terah died. And so we don't know exactly all of the specifics that were going on with regard to the health of Terah as they arrived to Haran and if perhaps that was part of the reason for stopping there and dwelling there for that period of time. But then when Terah died, the Lord reminds Abraham that this is not his final place, that it's time to continue on his journey and the instruction is given. I'm so thankful that God provides that instruction and that it has been received. Notice with me as we continue through the passage, in verses two and three, we see the promises rehearsed. The instruction received, the promises rehearsed. It's important that we note here in these two verses of Scripture, the phrase, I will, I will. God is giving Abraham some promises that we often would refer to as unconditional promises. There are, we find within the Word of God, there are unconditional promises and then there are some promises that are conditional promises. Typically, the conditional promises of Scripture are promises that we would describe as being if-then promises. In other words, God says, if you do this, then I will do this. That's a conditional promise. In fact, if you were to study the first half of Proverbs chapter number two and you go through those verses of Scripture in Proverbs chapter number two, you see multiple if-then, if-then, if-then. What's God saying? I'm not gonna do these things, but it's based upon you doing these things. Here we find that God says to Abram, I will. The promises are rehearsed. The promises that Almighty God would make. We mentioned this morning from Hebrews chapter number 10 how that we are to have no wavering. Why? Because we understand that our God, the one who has promised that He is faithful. And what a blessing that is. We've often referred to the Abrahamic covenant earlier. In our study in the book of Genesis, we dealt with the Noahic covenant. And as we dealt with the Noahic covenant, we mentioned several of the aspects of that covenant. And here we find in verses two and three, several aspects with regard to the Abrahamic covenant. Notice what he says in verse number two. And I will make of thee a great nation. I will make of thee a great nation. We find that God is giving this promise to Abram and he tells them he's gonna make them a great nation, the Hebrew people, the people of Israel. You understand that during the time, during the reign of David and Solomon, that the nation of Israel had possessed such vast levels of territory and they were so powerful in the prominence that they had in the world at that particular time. But we also understand prophetically many things about the Abrahamic covenant. We'll get into some of those things this evening even as we get into verse number three. But we find here that prophetically speaking that the Lord Jesus Christ will rule and reign for a thousand years during the millennial reign of Christ. And what a blessing it is for us to understand that and to see how that even here in the beginning portions of this 12th chapter of the book of Genesis is begin to see these promises that are rehearsed, how that we understand, yes, there was some fulfillment of this during the time of Israel as a nation historically we can read of, but then when you have prophecy in view and you understand the millennial reign of Christ, notice he continues in verse number two, not only will I make of thee a great nation, notice he says, and I will bless thee and make thy name great and thou shalt be a blessing. Isn't that wonderful? We see a little bit as we end verse number two and then get into verse number three, how that blessing is going to work at the end of verse number three, it says, and in thee shall all families of the earth be blessed and we'll touch on that in just a moment. But notice in verse number two that he says, I will bless thee and make thy name great and thou shalt be a blessing. I want you to think about this and kind of break it up. Notice if you hold your hand here and turn over to Genesis chapter 24. And in Genesis chapter number 24, we find that the servants. of Abraham. Abraham is stricken in age and Eleazar most likely is the servant that was going to be given this task. It's the eldest servant of his house according to verse number two. And the task was to go and find a bride for Isaac. And it's interesting as this servant would go, and we'll study chapter number 24 in I don't know how many months by the time we get there, but we eventually will get there to chapter number 24 in our study of the book of Genesis. But we find that the servant of Abraham says this in verse number 35. Notice where he says, and the Lord hath blessed my master greatly. What did God say in verse number two? I will bless thee. And the servant, Eleazar most likely, is the one that is here speaking. He says in verse 34, I am Abraham's servant. And he says that the Lord hath blessed my master greatly, and he has become great. And he hath given him flocks, and herds, and silver, and gold, and menservants, and maidservants, and camels, and asses. And you see how that God blessed Abraham. And his servant recognizes that it's the Lord that had blessed his master. You know this evening as a side note, it is important for us to recognize the blessing of the Lord in our lives. Far too often people, especially in the culture in which we live, there's this idea in this thought in which we're self-made people. The reality is that God's hand of blessing has been upon us. We begin to consider the blessing of God and begin to consider the things that we have. We say, well I worked hard for that. Who gave you the ability to work? Amen. And if we ever come to the place where we forget the blessing of God, we're in a very dangerous place. The children of Israel were warned in Deuteronomy chapter number 6 when he said, beware lest thou forget the Lord. When you enter into a land and you possess homes that you did not build, and you partake of the vineyards that you did not plant, and so on and so forth, beware lest thou forget the Lord. And there are times in which we find in Israel's history that they were guilty of that very thing. They forgot the source of blessing and how important it is that we recognize the source of blessing and the servant. He does not say, he does not come in. Now, I want you to understand this. I believe it's significant. I'll deal with this again in several months. Most of you will forget what I said now. I might forget what I said now, so we'll be able to repeat it. Amen. But the reality is that the servant has a perspective that no doubt Abraham contributed to that perspective, right? Abraham did not portray to his servant, look at me, look at what I've done, look at what I have, look at all of my possessions. No, no, I believe that Abraham was careful to let his servant understand, God has blessed me. And that's important for us to understand because it is the blessing of God. Often, I understand as we would think about maybe our roles and responsibilities and as a husband and father, oftentimes we think of our responsibility to provide for our family and certainly that is a responsibility that we have, but I regularly remind our children that yes, God has been so good to us and he has provided for us and he's given us the opportunity to have these things. God's hand a blessing upon us. We see it in the the life of Abraham. We see here this promise that God makes to Abram and we find that he says, I will bless thee, and he did. He said, I'll make thy name great. You know, Abraham is still the patriarch for the Jewish people. Father Abraham. Many of the Jewish people will refer to Abraham in that manner. In fact, many, not only Jewish descendants, but many Islamic descendants will also hold Abraham in high regard. They have a misunderstanding, from my perspective, biblically speaking, as to the role of Ishmael versus Isaac and so on and so forth, and we'll get to that in a few months as we continue through the book of Genesis, but we find there's a grave misunderstanding there with regard to the blessing and the descendant and so on and so forth, but many of them will also refer to Father Abraham. Abraham's held in high regard. He said, I will bless thee and I will make thy name great. We spoke often, even as we looked at the book of Hebrews, how that so many things in which the writer will present and show how that Christ is superior, and you'll remember that even during the life and ministry of the Lord Jesus Christ, that there were times in which the people would say, well, we're the disciples of Moses, and we find that they would make statements such as that, and we find that there was some discussion in John chapter number 8 with regard to Abraham and so on and so forth, and Jesus is speaking there and speaking to them about Abraham, and he says, your father Abraham, in verse number 56 of John 8, your father Abraham rejoiced to see my day, and he saw it and was glad. And of course, those Jews, they had no understanding. They said to him, thou art not yet 50 years old. They can still say that about me for a little while, amen? And hast thou seen Abraham? And what did Jesus say? Verily, verily, I say unto you, before Abraham was, I am. We find that Abraham was held, is continued to be held in high regard. God said, I will bless thee. He said that I will make thy name great. He says, thou shalt be a blessing. We're gonna hold that thought as we go into verse number 3. Notice in verse number 3, as it continues, the first aspect of verse number 3, he says this, and I will bless them that bless thee, and curse him that curseth thee. You know, the reality is that this aspect of this promise, we could find not only in biblical history, but in modern history as well, many examples of this truth right here. Those that are the friends, the allies of the nation of Israel, historically, biblically speaking, they have been blessed, and those that are the adversaries, they have been cursed. You can see it. You can look at biblical history, you can look at the modern history, you can see it throughout this case of what God is saying here. I will bless them that bless thee, and curse him that curseth thee. By the way, it's a good thing for us to be friends of Israel, amen? And it's important for us to understand that truth, even as we find here in Genesis 12, in verse number 3. Notice he continues and ends this level of the promises being rehearsed. In verse number 3, it says, and in thee shall all families of the earth be blessed. And in thee shall all families of the earth be blessed. He said at the end of verse number 2, and thou shalt be a blessing. Notice, if you turn over to Genesis chapter 22, in verse number 18, we'll be mindful of the fact that Genesis 22 records for us the time in which the Lord gave instruction to Abraham to offer Isaac, his son, upon the altar. And we find that in Genesis 22, in verse number 18, notice what God says, and in thy seed shall all the nations of the earth be blessed, because thou hast obeyed my voice. Now, we understand this truth in Genesis, and it's important that we follow it through, and go over to the book of Galatians, if you will, in the third chapter. I mentioned to you this morning that we would reference this passage of Scripture this evening. In Galatians chapter number 3, really, if you're taking notes, write down verses 6 through 18, because you need to read all of it, and you need to reference all of it. This evening, I won't have time to read all of it, I'm just gonna pick some verses out of it and give you the truth that is here, but it's such a rich passage of Scripture that provides us with great truth with regard to how all the families of the earth would be blessed. Remember, as we looked at Hebrews chapter number 6 many weeks ago, and referenced it this morning, we said that more of the promise, the aspect of the promise that was in view in Hebrews chapter number 6, was the promise of a seed, not so much the promise of a land. And we find here that that seed is mentioned here in Galatians 3. Notice in verse number 6, even as Abraham believed God, and it was accounted to him for righteousness, know you therefore that they which are of faith, the same are the children of Abraham. In the Scripture, foreseeing that God would justify the heathen through faith, preached before the gospel unto Abraham, saying, notice what it says, and thee shall all nations be blessed. So then they which be of faith are blessed with faithful Abraham. But how is that? How did this promise that was given, how would that come to pass? Skip down and look at verse number 15, verse number 14, that the blessing of Abraham might come on the Gentiles through who? Through Jesus Christ. That we might receive the promise of the Spirit through faith. Brethren, I speak after the manner of men, though it be but a man's covenant, yet if it be confirmed, no man disannulleth or addeth thereunto, or thereto. Now to Abraham and his, what does it say? Seed. Were the promises made, he saith not, and to seeds as of many, but as one. And to thy seed, which is Christ. And this I say, that the covenant that was confirmed before of God and Christ, the law which was four hundred and thirty years after, cannot disannul, that it should make the promise of none effect. For if the inheritance be of the law, it is no more of promise, but God gave it to Abraham by promise.\" And it's so important that we understand the truth that is being given here, as God would be giving these promises, and these promises are rehearsed here in Genesis 12, verses 2 and 3, and he says, \"...and these shall all families of the earth be blessed.\" And we study and compare Scripture with Scripture, and we find that here, the seed that is being spoken of, the blessing that would come is through Jesus Christ. Thus, the reason that the lens of Scripture focuses in, at the end of Genesis chapter number 11, upon Abram. And we find that beginning here in chapter number 12, and going forward, we see how that Abraham and the people of Israel become the central focus of Scripture. Yes, there are other people, groups, and other nations that are dealt with throughout Scripture, but primarily as they interacted with the people of God. We find that what he's saying here at the end of verse number 3, when he says, \"...and in thee shall all families of the earth be blessed,\" is he's speaking about our Savior who would come. Remember the Messianic line, the Semitic line, and that's why it was important that we trace in chapter number 10, the descendants of Shem, and how it goes to Terah and then Abram. And we see that line in the fulfillment of the promise in which Noah made back in chapter number 9, when he talked about the blessing of the God of Shem. And you begin to look at Scripture and see how everything fits together, and how God has given us these wonderful truths. We see in the first few verses that the instruction is received, the promises are rehearsed. In verses 4-9, we see Abram's obedience is recorded. It's only three words to begin verse number 4, and it's the title by which we're using for our study this evening, but I want you to think about the significance of these three words. So, Abram departed. He obeyed the Lord. Aren't you thankful that he departed? Aren't you thankful as you begin to understand all that we've just dealt with, and you begin to understand all of the implications of those simple three words, that simple action that Abram took in obeying the voice of the Lord? So, Abram departed. We understand that as we look at that phraseology, that it would be faith and obedience. And it says here that Abram departed, notice this, as the Lord had spoken unto him. He was obedient to the Lord. You'll never go wrong obeying God. Amen? God will never lead you in a wrong way. We ought to be careful that we're following the Lord's direction. Amen? We ought to be absolutely assured that we're following the Lord's direction, that we're not just looking at it from some temporal human perspective of how we make decisions on what we're going to do and so on and so forth, but know that we're following the direction that God has given us in our lives. And we find here that Abram departed as the Lord had spoken unto him. Notice as we look here, the Bible says this, and Lot went with him, and Abram was seventy and five years old when he departed out of Haran. It tells us in verse number five, and Abram took Sarai, his wife, and Lot, his brother's son, and all their substance that they had gathered, and the souls that they had gotten in Haran, and they went forth to go into the land of Canaan. And it says at the end of verse number five, and into the land of Canaan they came. They left Haran, we see at the end of verse number four, it says that they departed out of Haran at the end of verse number six, and they came, and into the land of Canaan they came. And God gave them the provision for the journey that they needed. We see that Abram took his wife, Sarai, he took his nephew, Lot, they took all of their substance, according to what we read in verse number five, the servants that they've been able to gather, and so on and so forth. And we find that they took that journey, and God, no doubt, went before them and provided along the way. What a blessing. You know, I think about Abram, and I think about his faith, and his obedience, and how God said to go unto a land that I will show thee. It was just simple obedience and faith, following the direction of the Lord, trusting God. We read in verse six how the Bible would review for us the places in which they came, and we see in verse number eight, again, the references that are provided. It says in verse six, and Abram passed through the land unto the place of Shechem, under the plain of Morah, and the Canaanite was then in the land. And so we see that they come first to this place that often referred to as Shechem throughout the scriptures, and it says under the plain of Morah. It does reveal to us at the end of verse number six that the Canaanite was then in the land. We're familiar with the truth that we mentioned back in chapter number nine with regard to the Canaanites, and we had referenced during that particular message and dealing with that subject matter, how the Canaanites would initially inhabit the land that we would refer to as the land of promise. Of course, the Canaanites would be in that land for a lengthy period of time, hundreds of years that they would be in that place. And we find that they go to Shechem, they come to the plain of Morah. Notice in verse number seven what significance this holds. Again, the Bible says, and the Lord appeared unto Abram. Isn't that exciting? Can you imagine? As Abram was following the leadership of God, as Abraham was obedient to follow the direction that had been received, we find that the Bible tells us that the Lord appeared unto him. And notice what he says, unto thy seed will I give this land. It says, and there built he an altar unto the Lord who appeared unto him. I want you to think about the significance of the appearance when God appeared to Abram and how wonderful that must have been. I want you to think about the significance of what the Lord said to Abram when He said, unto thy seed will I give this land. This has been something that has been debated for centuries with regard to the ownership of the land. And we understand that God not only made this promise here to Abram, but we find that the promise would be oft repeated throughout the Pentateuch and even into the book of Joshua. And as you continue through the Scriptures, you begin to understand this promise that has been given to Abram and to his descendants, to his seed. He says, well, I give this land. Notice how Abram responded. We see how that Abram worshiped the Lord. Isn't that a natural response, by the way? The Lord appeared unto Abram and said unto Abram, unto thy seed will I give this land. And the Bible tells us that in that place, Abram built an altar unto the Lord who appeared unto him. The purpose of building an altar is to worship. Amen. And we find that Abram was a man that often would build an altar. In fact, in verse number eight, we'll read again how he built an altar unto the Lord. And we can begin to understand the way in which he would worship the Lord. And by the way, this evening, we understand that our God is worthy of our worship. He alone is to be worshiped. Amen. And we find here that it says in verse number eight, and he removed from thence unto a mountain on the east of Bethel and pitched his tent, having Bethel on the west and Ai on the east. And so we find that as he begins to travel and remove from that place in which he found himself there in Shechem in the plain of Morah, according to verse number six, that they're going to continue to travel. And the Bible tells us that now he comes to this place where he has Bethel on the west and Ai on the east. And the Bible tells us there that he built an altar unto the Lord. And notice this phrase and the significance of this phrase, and called upon the name of the Lord. See, often we begin to see throughout the scriptures how that the people of God would worship the Lord and how that he is worthy of our worship. And what a blessing it is for us to understand how that Abraham, as he's here in Genesis chapter number 12, as he's received this instruction, as he's heard the promises rehearsed, and we now have the opportunity to see the record of his obedience. And as we read of the record of his obedience, we are told here that Abraham not only had gone into the place where God told him to go, but we find that he's worshiping the Lord. John 4 talks about the truth that they that worship him must worship him in spirit and in truth. It's interesting at the end of the book of Matthew, if you turn over there, if you will, to Matthew chapter number 28. And I want you to see after the resurrection of our Lord and Savior, Jesus Christ. And we understand that they went there early to the tomb. Remember, they found it empty because he had risen from the dead, as he said. And what a glorious morning that was. But we come to Matthew chapter 28 and verse number 17. And when they saw Him, they worshiped Him. Today, our God is worthy of worship. They that worship Him, to repeat what I said a moment ago from John 4, they that worship Him must worship Him in spirit and in truth. By the way, not all that is called worship is worship. God defines what worship is. Amen? And we're to worship God on His terms, not on man's terms. And we find that the Scriptures are full of truth with regard to how we as the people of God are to worship the Lord. We see there at the end of verse number 8 that not only did Abraham build another altar unto the Lord, but he called upon the name of the Lord. Again, often as we study through the life of Abraham over these next several chapters, you'll have the opportunity to see the faith and obedience of Abraham and to see his worship of God and what a blessing that is. We find as we conclude in verse number 9, and we'll get into the latter part of Genesis 12 next Sunday evening, but I want you to see that the Bible says, And Abram journeyed going on still toward the south. I want you to consider as Abram would journey and as the Scriptures tell us that he continued on still toward the south, that Abram had the opportunity to see this land that God had promised to his seed. We find that as they would journey and as they would travel, they have this group of people. And we know that at this particular time that Abram and Sarai, they have no children, they've not yet had Isaac. We know that there in chapter number 11 and verse number 30, the Bible told us that Sarai was barren and she had no child. The significance of that truth and the importance of understanding the promise that God would give with regard to a seed, and even as we read it here in Genesis chapter number 12, and we go through the next several chapters and we see how that God would provide and bless and what He would do. And Abram is now at the place where God has directed him to go. We find that even in that place there would be trouble. The very next verse of Scripture tells us that there was a famine in the land. It will be the subject matter in which we discuss next Sunday evening in understanding what happens. I want you to realize this evening that Abram, though there are many things that we can look at in the life of Abram and we can look at as being exemplary and certainly noteworthy, that he is not a perfect man. Only the Lord Jesus Christ is the perfect example. But no doubt as we begin to look at the life of Abram and see this text of Scripture in Genesis chapter number 12, how we ought to be impacted as we think about and consider the faith and obedience of this man. Notice what the writer of Hebrews says. Turn to Hebrews 11 if you will, and we'll conclude with this passage of Scripture this evening in Hebrews chapter number 11. I want you to notice what the Word of God says. In verse number 8 of Hebrews 11, the Bible says, By faith Abraham, when he was called to go out into a place which he should after receive for an inheritance, what's it say? Obeyed. And he went out not knowing whither he went. He didn't know exactly where he was going. He was just following God. Amen? He got to Haran. Haran wasn't the final destination. That was a place in which they dwelt and it was a place in which they stayed for a period of time. But when Terah died, God said this isn't the final place. You need to continue journeying. And we find the Bible says that he obeyed and that he went out not knowing whither he went. By faith, notice verse number 9 of Hebrews 11, he sojourned in the land of promise. I think we see that a little bit in verse number 9 in Genesis 12 where he continued traveling still towards the south. He sojourned in the land of promise as in a strange country dwelling in tabernacles with Isaac and Jacob, the heirs with him of the same promise. You think about how the lens of Scripture looks down future speaking of Isaac and Jacob and how that would come to pass and they would live in that land. For he looked for a city which hath foundations, whose builder and maker is God. There are more things that are said about Abraham and Sarah here in the passage of Scripture in Hebrews 11, but I want you to just notice and consider this evening the faith and obedience. So Abram departed. See, when the Lord speaks in this evening, we know that he's given us a perfect book, a complete canon of Scripture. Sixty-six books. Precious Bible. It's profitable. And God speaks to us through His Word. Amen? God gives us direction in His Word. He provides us with the direction that we need. And it is vital that we as the people of God, that we simply trust Him, that in faith and obedience we respond to the voice of God. Abraham had a different experience than we did in the fact that the Lord appeared to him and spoke to him audibly, but we have the written Word of God. What a joy to be able to go to the Word of God and feast upon what thus saith the Lord. And we can go to the Scriptures every day of our lives and receive the direction that God has for us. The question is what do we do with it? So Abram departed. He heard the direction of God. He heard the instruction and received it. And he responded in obedience. And what a blessing. See, this morning we made note of the way in which God has made a new and living way, the access that is available, and how silly it would be for us to know that we have access, but yet decide not to enter in. Right? Let us draw near. Since we have access, we draw near. And so Abram receives the direction, the instruction from God Almighty. How silly to not obey. But we say the same things to ourselves this evening. God gives us direction. God gives us instruction. And yet we find that there's this constant struggle that we have as human beings to simply trust Him, to simply obey Him and follow Him. We have so many influences in our lives and so many things that are going on and swirling around that at times we struggle with the simple truth of simply trusting, just taking God at His word. I'm so thankful this evening that Abram departed. I'm thankful this evening that we have the opportunity to read of these promises, often we refer to as the Abrahamic Covenant, and begin to see how the lens of Scripture will focus upon Abram and his descendants, of course leading us to Messiah Himself. I'm so thankful for the blessings that we have received and that we, as we look at Galatians 3, that we have received that promise, that blessing, through who? Through Jesus Christ. And this evening, if you've trusted Christ as your Savior, as we see in Galatians 3, He says this truth, and I don't want to misquote it, so let me just turn there real quick. In Galatians 3, you don't need to turn there, but He says that, Know ye therefore that they which are of faith, the same are the children of Abraham. I'm not a child of Abraham because of my lineage bloodline being Jewish, but I am part of that being a child of Abraham through faith, which are of faith. And what a blessing to understand that seed that was promised. Amen? So Abram departed. Oh, that God would help us obey Him. We love You. We thank You for loving us. We thank You for the opportunity to have Your Word. Thank You for giving us the complete canon of Scripture and for the opportunity this evening to see how that Your servant, Abraham, how he obeyed You. Thank You for the promises that You gave him. Thank You for how You blessed him. I thank You for his perspective of his blessing, understanding that God, it was Your hand of blessing upon him. We see that even through the testimony of his servant when he mentions about how the Lord hath greatly blessed His Master. God, this evening I believe that each of us could stand and testify of Your goodness in our lives. I pray that we'd never be in a place, a position of being deceived and thinking that somehow we have gotten these things or added these things to ourselves. But God, that we would be mindful of Your good hand of blessing. Father, I pray that as we have rejoiced to see the obedience and faith of Abraham, how that he departed and followed, that we would be challenged this evening to be obedient to Thy Word. That God, we would simply trust You. That we would rest in You. That You would give us that peace that passeth all understanding as we trust You and follow You. I pray God that You would use us in our community, in our society. I pray, Father, that You would be glorified in our lives. Help us to worship You as we should. We see how that Abraham, how he built these altars and he worshipped and he called upon the name of the Lord. God, help us to see you in all of your glory, high, holy, and lifted up. As we read of the disciples there in Matthew 28, that they saw him and they worshipped him. God, help us to worship you as we should, in spirit and in truth. I pray that you would guide and direct during this time of invitation if there's one that's not sure of heaven, they've never received the gift of God, which is eternal life through Jesus Christ our Lord. They've not yet received that promise that's been mentioned in Galatians 3, and they've not received that promise from Genesis 12 on how all the families of the earth would be blessed through the seed through the Lord Jesus Christ. I pray that this evening they would understand that they're a sinner in need of a savior, that Jesus Christ is the only savior, that he came to seek and to save that which was lost. I pray that the Holy Spirit of God would convict them of their sin, of Christ's righteousness, of judgment to come. They would not leave this place nor log off of the live stream without knowing for sure that heaven is their home. I pray that you'd work as only you can and we'll give you the glory for all that you'll do. For it's in Christ's name we pray. Would you stand with me?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.1600000858306885,
      "text": " or 12 this evening, Genesis chapter number 12."
    },
    {
      "id": 1,
      "start": 3.1600000858306885,
      "end": 5.320000171661377,
      "text": " You'll be looking at verses one through nine this evening."
    },
    {
      "id": 2,
      "start": 5.320000171661377,
      "end": 7.519999980926514,
      "text": " You notice in verse number four,"
    },
    {
      "id": 3,
      "start": 7.519999980926514,
      "end": 10.520000457763672,
      "text": " as you're turning there in Genesis 12 and verse number four,"
    },
    {
      "id": 4,
      "start": 10.520000457763672,
      "end": 13.239999771118164,
      "text": " the verse begins with these three words."
    },
    {
      "id": 5,
      "start": 13.239999771118164,
      "end": 15.880000114440918,
      "text": " So Abram departed,"
    },
    {
      "id": 6,
      "start": 15.880000114440918,
      "end": 18.360000610351562,
      "text": " and that's the title for the message this evening."
    },
    {
      "id": 7,
      "start": 18.360000610351562,
      "end": 20.799999237060547,
      "text": " So Abram departed."
    },
    {
      "id": 8,
      "start": 20.799999237060547,
      "end": 22.84000015258789,
      "text": " I mentioned this in our last study"
    },
    {
      "id": 9,
      "start": 22.84000015258789,
      "end": 26.040000915527344,
      "text": " in the latter part of Genesis chapter number 11,"
    },
    {
      "id": 10,
      "start": 26.040000915527344,
      "end": 29.0,
      "text": " that at times I may refer to Abram as Abraham"
    },
    {
      "id": 11,
      "start": 29.0,
      "end": 30.040000915527344,
      "text": " and please forgive me,"
    },
    {
      "id": 12,
      "start": 30.040000915527344,
      "end": 32.400001525878906,
      "text": " I know that his name is not changed yet,"
    },
    {
      "id": 13,
      "start": 32.400001525878906,
      "end": 34.68000030517578,
      "text": " but so often we refer to him as Abraham,"
    },
    {
      "id": 14,
      "start": 34.68000030517578,
      "end": 37.31999969482422,
      "text": " and so if I slip, you'll understand why."
    },
    {
      "id": 15,
      "start": 37.31999969482422,
      "end": 39.79999923706055,
      "text": " And we see here throughout the text of scripture"
    },
    {
      "id": 16,
      "start": 39.79999923706055,
      "end": 42.880001068115234,
      "text": " that his name at this particular time is still Abram."
    },
    {
      "id": 17,
      "start": 42.880001068115234,
      "end": 44.7599983215332,
      "text": " As we have previously discussed,"
    },
    {
      "id": 18,
      "start": 44.7599983215332,
      "end": 46.400001525878906,
      "text": " in fact, in our very last lesson"
    },
    {
      "id": 19,
      "start": 46.400001525878906,
      "end": 48.08000183105469,
      "text": " at the end of chapter number 11,"
    },
    {
      "id": 20,
      "start": 48.08000183105469,
      "end": 50.20000076293945,
      "text": " we mentioned how the lens of scripture"
    },
    {
      "id": 21,
      "start": 50.20000076293945,
      "end": 53.439998626708984,
      "text": " has now focused upon Abram and his descendants,"
    },
    {
      "id": 22,
      "start": 53.439998626708984,
      "end": 55.439998626708984,
      "text": " the Hebrew people, the nation of Israel,"
    },
    {
      "id": 23,
      "start": 55.439998626708984,
      "end": 57.31999969482422,
      "text": " as we often refer to them as."
    },
    {
      "id": 24,
      "start": 57.400001525878906,
      "end": 58.84000015258789,
      "text": " And we find that as we entered"
    },
    {
      "id": 25,
      "start": 58.84000015258789,
      "end": 61.79999923706055,
      "text": " into the latter part of Genesis chapter 11,"
    },
    {
      "id": 26,
      "start": 61.79999923706055,
      "end": 64.19999694824219,
      "text": " once again, there in the middle section"
    },
    {
      "id": 27,
      "start": 64.19999694824219,
      "end": 65.5999984741211,
      "text": " of Genesis chapter 11,"
    },
    {
      "id": 28,
      "start": 65.5999984741211,
      "end": 69.16000366210938,
      "text": " God gave us another record of the descendants of Shem"
    },
    {
      "id": 29,
      "start": 69.16000366210938,
      "end": 73.4000015258789,
      "text": " to show us the lineage to Abram."
    },
    {
      "id": 30,
      "start": 73.4000015258789,
      "end": 76.68000030517578,
      "text": " And we find that as you enter into the last section"
    },
    {
      "id": 31,
      "start": 76.68000030517578,
      "end": 79.08000183105469,
      "text": " in verses 27 down through verse number 32"
    },
    {
      "id": 32,
      "start": 79.08000183105469,
      "end": 80.91999816894531,
      "text": " of Genesis chapter 11,"
    },
    {
      "id": 33,
      "start": 80.91999816894531,
      "end": 84.12000274658203,
      "text": " that God gives us an introduction to Abram"
    },
    {
      "id": 34,
      "start": 84.16000366210938,
      "end": 86.0,
      "text": " and he describes the departure"
    },
    {
      "id": 35,
      "start": 86.0,
      "end": 89.0,
      "text": " from the Ur of the Chaldees to Haran."
    },
    {
      "id": 36,
      "start": 89.0,
      "end": 92.36000061035156,
      "text": " We understand that he left the land of his nativity"
    },
    {
      "id": 37,
      "start": 92.36000061035156,
      "end": 94.08000183105469,
      "text": " according to verse number 28."
    },
    {
      "id": 38,
      "start": 94.08000183105469,
      "end": 96.5999984741211,
      "text": " The land of his nativity was the Ur of the Chaldees"
    },
    {
      "id": 39,
      "start": 96.5999984741211,
      "end": 98.55999755859375,
      "text": " and we find that it was there"
    },
    {
      "id": 40,
      "start": 98.55999755859375,
      "end": 100.5199966430664,
      "text": " at the mouth of the Euphrates River."
    },
    {
      "id": 41,
      "start": 100.5199966430664,
      "end": 103.44000244140625,
      "text": " And at the end of chapter number 11,"
    },
    {
      "id": 42,
      "start": 103.44000244140625,
      "end": 106.23999786376953,
      "text": " we find that they're still there in Haran."
    },
    {
      "id": 43,
      "start": 106.23999786376953,
      "end": 108.08000183105469,
      "text": " In fact, at the end of verse number 31,"
    },
    {
      "id": 44,
      "start": 108.08000183105469,
      "end": 111.31999969482422,
      "text": " it says, and they came unto Haran and dwelt there."
    },
    {
      "id": 45,
      "start": 111.31999969482422,
      "end": 112.76000213623047,
      "text": " And we went through and studied this"
    },
    {
      "id": 46,
      "start": 112.76000213623047,
      "end": 117.04000091552734,
      "text": " in our last message on Sunday evening a couple of weeks ago"
    },
    {
      "id": 47,
      "start": 117.04000091552734,
      "end": 119.55999755859375,
      "text": " with regard to that subject matter."
    },
    {
      "id": 48,
      "start": 119.55999755859375,
      "end": 121.76000213623047,
      "text": " In the first section of Genesis chapter number 12,"
    },
    {
      "id": 49,
      "start": 121.76000213623047,
      "end": 124.0,
      "text": " as we look at these first nine verses,"
    },
    {
      "id": 50,
      "start": 124.0,
      "end": 127.44000244140625,
      "text": " we are now provided with the record of the journey"
    },
    {
      "id": 51,
      "start": 127.44000244140625,
      "end": 129.72000122070312,
      "text": " from Haran to Canaan."
    },
    {
      "id": 52,
      "start": 129.72000122070312,
      "end": 133.1199951171875,
      "text": " And we find here that the word of God begins"
    },
    {
      "id": 53,
      "start": 133.1199951171875,
      "end": 134.1199951171875,
      "text": " in verse number one."
    },
    {
      "id": 54,
      "start": 134.1199951171875,
      "end": 135.8800048828125,
      "text": " If you're taking notes this evening,"
    },
    {
      "id": 55,
      "start": 135.8800048828125,
      "end": 138.72000122070312,
      "text": " number one, the instruction received."
    },
    {
      "id": 56,
      "start": 138.72000122070312,
      "end": 140.52000427246094,
      "text": " The instruction received,"
    },
    {
      "id": 57,
      "start": 140.52000427246094,
      "end": 142.63999938964844,
      "text": " and really we find this in verse number one."
    },
    {
      "id": 58,
      "start": 142.63999938964844,
      "end": 145.0,
      "text": " I'm so thankful that our God would provide us"
    },
    {
      "id": 59,
      "start": 145.0,
      "end": 147.36000061035156,
      "text": " with direction, with instruction."
    },
    {
      "id": 60,
      "start": 147.36000061035156,
      "end": 149.72000122070312,
      "text": " We understand the word of God is profitable."
    },
    {
      "id": 61,
      "start": 149.72000122070312,
      "end": 151.9199981689453,
      "text": " 2 Timothy 3 and verse number 16"
    },
    {
      "id": 62,
      "start": 151.9199981689453,
      "end": 154.39999389648438,
      "text": " speaks about the fact that God's word is profitable"
    },
    {
      "id": 63,
      "start": 154.39999389648438,
      "end": 156.36000061035156,
      "text": " for doctrine, for instruction, right?"
    },
    {
      "id": 64,
      "start": 156.36000061035156,
      "end": 159.8000030517578,
      "text": " We see reproof and so on and so forth is listed there,"
    },
    {
      "id": 65,
      "start": 159.8000030517578,
      "end": 162.72000122070312,
      "text": " but we understand that God's word"
    },
    {
      "id": 66,
      "start": 162.72000122070312,
      "end": 165.36000061035156,
      "text": " contains instruction for God's people."
    },
    {
      "id": 67,
      "start": 165.36000061035156,
      "end": 167.63999938964844,
      "text": " At this particular time,"
    },
    {
      "id": 68,
      "start": 167.63999938964844,
      "end": 170.47999572753906,
      "text": " Abram did not have a Bible like we have a Bible."
    },
    {
      "id": 69,
      "start": 170.47999572753906,
      "end": 172.16000366210938,
      "text": " And so therefore the Lord spoke to him."
    },
    {
      "id": 70,
      "start": 172.67999267578125,
      "end": 175.16000366210938,
      "text": " And you notice the Bible begins in verse number one."
    },
    {
      "id": 71,
      "start": 175.16000366210938,
      "end": 177.1199951171875,
      "text": " It says, now the Lord,"
    },
    {
      "id": 72,
      "start": 177.1199951171875,
      "end": 178.67999267578125,
      "text": " now just stop there just for a moment"
    },
    {
      "id": 73,
      "start": 178.67999267578125,
      "end": 182.0,
      "text": " and consider that the Lord God of the universe,"
    },
    {
      "id": 74,
      "start": 182.0,
      "end": 183.36000061035156,
      "text": " the Lord God almighty,"
    },
    {
      "id": 75,
      "start": 183.36000061035156,
      "end": 185.16000366210938,
      "text": " that he is going to speak"
    },
    {
      "id": 76,
      "start": 185.16000366210938,
      "end": 187.55999755859375,
      "text": " and he's going to give instruction."
    },
    {
      "id": 77,
      "start": 187.55999755859375,
      "end": 190.1999969482422,
      "text": " This instruction will be received by Abram."
    },
    {
      "id": 78,
      "start": 190.1999969482422,
      "end": 195.0800018310547,
      "text": " And we find that here it says had said unto Abram."
    },
    {
      "id": 79,
      "start": 195.0800018310547,
      "end": 198.39999389648438,
      "text": " Had said, we understand that this would indicate"
    },
    {
      "id": 80,
      "start": 198.39999389648438,
      "end": 201.55999755859375,
      "text": " that God had given Abram some direction"
    },
    {
      "id": 81,
      "start": 201.9600067138672,
      "end": 203.60000610351562,
      "text": " when he was back in the Ur of the Chaldees."
    },
    {
      "id": 82,
      "start": 203.60000610351562,
      "end": 206.16000366210938,
      "text": " In fact, as you begin to study scripture"
    },
    {
      "id": 83,
      "start": 206.16000366210938,
      "end": 207.63999938964844,
      "text": " and compare scripture with scripture,"
    },
    {
      "id": 84,
      "start": 207.63999938964844,
      "end": 210.0800018310547,
      "text": " in our last study, we referenced Acts 7,"
    },
    {
      "id": 85,
      "start": 210.0800018310547,
      "end": 211.24000549316406,
      "text": " verses one through four."
    },
    {
      "id": 86,
      "start": 211.24000549316406,
      "end": 213.60000610351562,
      "text": " And you'll find there in that text of scripture"
    },
    {
      "id": 87,
      "start": 213.60000610351562,
      "end": 216.16000366210938,
      "text": " as Stephen is preaching"
    },
    {
      "id": 88,
      "start": 216.16000366210938,
      "end": 220.52000427246094,
      "text": " that he references about the call of God to Abram."
    },
    {
      "id": 89,
      "start": 220.52000427246094,
      "end": 223.72000122070312,
      "text": " And in the text of scripture in verse number two,"
    },
    {
      "id": 90,
      "start": 223.72000122070312,
      "end": 225.24000549316406,
      "text": " Stephen says this, and he said,"
    },
    {
      "id": 91,
      "start": 225.24000549316406,
      "end": 228.55999755859375,
      "text": " men, brethren and fathers hearken."
    },
    {
      "id": 92,
      "start": 228.60000610351562,
      "end": 233.60000610351562,
      "text": " The God of glory appeared unto our father Abraham"
    },
    {
      "id": 93,
      "start": 233.8800048828125,
      "end": 238.8800048828125,
      "text": " when he was in Mesopotamia before he dwelt in Haran"
    },
    {
      "id": 94,
      "start": 239.1199951171875,
      "end": 241.39999389648438,
      "text": " and said unto him, get thee out of thy country"
    },
    {
      "id": 95,
      "start": 241.39999389648438,
      "end": 243.75999450683594,
      "text": " and from thy kindred and come into the land,"
    },
    {
      "id": 96,
      "start": 243.75999450683594,
      "end": 245.52000427246094,
      "text": " which I will show thee."
    },
    {
      "id": 97,
      "start": 245.52000427246094,
      "end": 248.8000030517578,
      "text": " And so we find here that the Lord is speaking to Abram,"
    },
    {
      "id": 98,
      "start": 248.8000030517578,
      "end": 250.47999572753906,
      "text": " that he's giving this direction,"
    },
    {
      "id": 99,
      "start": 250.47999572753906,
      "end": 252.9600067138672,
      "text": " this instruction to this man."
    },
    {
      "id": 100,
      "start": 252.9600067138672,
      "end": 255.0800018310547,
      "text": " And it says that he had said again,"
    },
    {
      "id": 101,
      "start": 255.0800018310547,
      "end": 258.1199951171875,
      "text": " if you go back to the latter part of Genesis chapter 11,"
    },
    {
      "id": 102,
      "start": 258.8800048828125,
      "end": 260.32000732421875,
      "text": " this instruction has been given."
    },
    {
      "id": 103,
      "start": 260.32000732421875,
      "end": 264.0,
      "text": " It is now further repeated because he had been in Haran."
    },
    {
      "id": 104,
      "start": 264.0,
      "end": 266.20001220703125,
      "text": " Now understand that Haran"
    },
    {
      "id": 105,
      "start": 266.20001220703125,
      "end": 269.239990234375,
      "text": " was not the final destination for Abraham."
    },
    {
      "id": 106,
      "start": 269.239990234375,
      "end": 271.7200012207031,
      "text": " This was not the place in which he was to dwell"
    },
    {
      "id": 107,
      "start": 271.7200012207031,
      "end": 274.760009765625,
      "text": " and the land in which God said that he would give them."
    },
    {
      "id": 108,
      "start": 274.760009765625,
      "end": 277.44000244140625,
      "text": " As we mentioned, as you understand the landscape"
    },
    {
      "id": 109,
      "start": 277.44000244140625,
      "end": 280.9200134277344,
      "text": " of the region of the world there that they're in,"
    },
    {
      "id": 110,
      "start": 280.9200134277344,
      "end": 282.6000061035156,
      "text": " you would find that as they were"
    },
    {
      "id": 111,
      "start": 282.6000061035156,
      "end": 284.2799987792969,
      "text": " at the mouth of the Euphrates,"
    },
    {
      "id": 112,
      "start": 284.44000244140625,
      "end": 288.3999938964844,
      "text": " they went Northwest and really kind of followed the path"
    },
    {
      "id": 113,
      "start": 288.3999938964844,
      "end": 291.3599853515625,
      "text": " of the Euphrates River until they came to Haran."
    },
    {
      "id": 114,
      "start": 291.3599853515625,
      "end": 294.4800109863281,
      "text": " And then they would now travel in chapter number 12,"
    },
    {
      "id": 115,
      "start": 294.4800109863281,
      "end": 297.6400146484375,
      "text": " Southwest and eventually come to the land of Canaan,"
    },
    {
      "id": 116,
      "start": 297.6400146484375,
      "end": 299.9599914550781,
      "text": " the place in which God would show him."
    },
    {
      "id": 117,
      "start": 299.9599914550781,
      "end": 303.0799865722656,
      "text": " Notice the Bible says, get thee out of thy country"
    },
    {
      "id": 118,
      "start": 303.0799865722656,
      "end": 305.6400146484375,
      "text": " and from thy kindred and from thy father's house"
    },
    {
      "id": 119,
      "start": 305.6400146484375,
      "end": 308.8800048828125,
      "text": " unto a land that I will show thee."
    },
    {
      "id": 120,
      "start": 308.8800048828125,
      "end": 311.79998779296875,
      "text": " We understand again that this instruction"
    },
    {
      "id": 121,
      "start": 311.79998779296875,
      "end": 316.1600036621094,
      "text": " has been provided and as God is giving this instruction,"
    },
    {
      "id": 122,
      "start": 316.1600036621094,
      "end": 320.0,
      "text": " it is important that Abraham would understand"
    },
    {
      "id": 123,
      "start": 320.0,
      "end": 322.2799987792969,
      "text": " that it was time to leave Haran."
    },
    {
      "id": 124,
      "start": 322.2799987792969,
      "end": 324.8399963378906,
      "text": " He was not to dwell there any longer."
    },
    {
      "id": 125,
      "start": 324.8399963378906,
      "end": 327.55999755859375,
      "text": " We dealt with last week some of the reasons"
    },
    {
      "id": 126,
      "start": 327.55999755859375,
      "end": 330.32000732421875,
      "text": " in which they may have stopped at Haran."
    },
    {
      "id": 127,
      "start": 330.32000732421875,
      "end": 331.8800048828125,
      "text": " We understand, the Bible tells us"
    },
    {
      "id": 128,
      "start": 331.8800048828125,
      "end": 335.1600036621094,
      "text": " the end of verse number 32, that it was there"
    },
    {
      "id": 129,
      "start": 335.1600036621094,
      "end": 337.6400146484375,
      "text": " that his father Terah died."
    },
    {
      "id": 130,
      "start": 337.6400146484375,
      "end": 340.5199890136719,
      "text": " And so we don't know exactly all of the specifics"
    },
    {
      "id": 131,
      "start": 340.5199890136719,
      "end": 344.6400146484375,
      "text": " that were going on with regard to the health of Terah"
    },
    {
      "id": 132,
      "start": 344.6400146484375,
      "end": 346.79998779296875,
      "text": " as they arrived to Haran and if perhaps"
    },
    {
      "id": 133,
      "start": 346.79998779296875,
      "end": 349.9599914550781,
      "text": " that was part of the reason for stopping there"
    },
    {
      "id": 134,
      "start": 349.9599914550781,
      "end": 352.3599853515625,
      "text": " and dwelling there for that period of time."
    },
    {
      "id": 135,
      "start": 352.3599853515625,
      "end": 355.7200012207031,
      "text": " But then when Terah died, the Lord reminds Abraham"
    },
    {
      "id": 136,
      "start": 355.7200012207031,
      "end": 357.8800048828125,
      "text": " that this is not his final place,"
    },
    {
      "id": 137,
      "start": 357.8800048828125,
      "end": 361.239990234375,
      "text": " that it's time to continue on his journey"
    },
    {
      "id": 138,
      "start": 361.239990234375,
      "end": 362.9599914550781,
      "text": " and the instruction is given."
    },
    {
      "id": 139,
      "start": 362.9599914550781,
      "end": 366.6400146484375,
      "text": " I'm so thankful that God provides that instruction"
    },
    {
      "id": 140,
      "start": 366.6400146484375,
      "end": 367.8599853515625,
      "text": " and that it has been received."
    },
    {
      "id": 141,
      "start": 367.8599853515625,
      "end": 370.7799987792969,
      "text": " Notice with me as we continue through the passage,"
    },
    {
      "id": 142,
      "start": 370.7799987792969,
      "end": 374.8999938964844,
      "text": " in verses two and three, we see the promises rehearsed."
    },
    {
      "id": 143,
      "start": 374.8999938964844,
      "end": 378.0199890136719,
      "text": " The instruction received, the promises rehearsed."
    },
    {
      "id": 144,
      "start": 378.0199890136719,
      "end": 379.4200134277344,
      "text": " It's important that we note here"
    },
    {
      "id": 145,
      "start": 379.4200134277344,
      "end": 382.6199951171875,
      "text": " in these two verses of Scripture,"
    },
    {
      "id": 146,
      "start": 382.6199951171875,
      "end": 385.82000732421875,
      "text": " the phrase, I will, I will."
    },
    {
      "id": 147,
      "start": 385.82000732421875,
      "end": 388.5,
      "text": " God is giving Abraham some promises"
    },
    {
      "id": 148,
      "start": 388.5,
      "end": 393.0199890136719,
      "text": " that we often would refer to as unconditional promises."
    },
    {
      "id": 149,
      "start": 393.0199890136719,
      "end": 395.5,
      "text": " There are, we find within the Word of God,"
    },
    {
      "id": 150,
      "start": 395.5,
      "end": 397.4599914550781,
      "text": " there are unconditional promises"
    },
    {
      "id": 151,
      "start": 397.9800109863281,
      "end": 398.82000732421875,
      "text": " and then there are some promises"
    },
    {
      "id": 152,
      "start": 398.82000732421875,
      "end": 400.7799987792969,
      "text": " that are conditional promises."
    },
    {
      "id": 153,
      "start": 400.7799987792969,
      "end": 404.05999755859375,
      "text": " Typically, the conditional promises of Scripture"
    },
    {
      "id": 154,
      "start": 404.05999755859375,
      "end": 405.8599853515625,
      "text": " are promises that we would describe"
    },
    {
      "id": 155,
      "start": 405.8599853515625,
      "end": 408.5400085449219,
      "text": " as being if-then promises."
    },
    {
      "id": 156,
      "start": 408.5400085449219,
      "end": 411.4200134277344,
      "text": " In other words, God says, if you do this,"
    },
    {
      "id": 157,
      "start": 411.4200134277344,
      "end": 413.1000061035156,
      "text": " then I will do this."
    },
    {
      "id": 158,
      "start": 413.1000061035156,
      "end": 414.7799987792969,
      "text": " That's a conditional promise."
    },
    {
      "id": 159,
      "start": 414.7799987792969,
      "end": 416.6600036621094,
      "text": " In fact, if you were to study the first half"
    },
    {
      "id": 160,
      "start": 416.6600036621094,
      "end": 419.17999267578125,
      "text": " of Proverbs chapter number two and you go through"
    },
    {
      "id": 161,
      "start": 419.17999267578125,
      "end": 421.5,
      "text": " those verses of Scripture in Proverbs chapter number two,"
    },
    {
      "id": 162,
      "start": 421.5,
      "end": 425.5400085449219,
      "text": " you see multiple if-then, if-then, if-then."
    },
    {
      "id": 163,
      "start": 425.5400085449219,
      "end": 426.3599853515625,
      "text": " What's God saying?"
    },
    {
      "id": 164,
      "start": 426.3599853515625,
      "end": 427.44000244140625,
      "text": " I'm not gonna do these things,"
    },
    {
      "id": 165,
      "start": 427.44000244140625,
      "end": 430.6000061035156,
      "text": " but it's based upon you doing these things."
    },
    {
      "id": 166,
      "start": 430.6000061035156,
      "end": 434.6000061035156,
      "text": " Here we find that God says to Abram, I will."
    },
    {
      "id": 167,
      "start": 434.6000061035156,
      "end": 436.5199890136719,
      "text": " The promises are rehearsed."
    },
    {
      "id": 168,
      "start": 436.5199890136719,
      "end": 440.2799987792969,
      "text": " The promises that Almighty God would make."
    },
    {
      "id": 169,
      "start": 440.2799987792969,
      "end": 443.1199951171875,
      "text": " We mentioned this morning from Hebrews chapter number 10"
    },
    {
      "id": 170,
      "start": 443.1199951171875,
      "end": 446.1600036621094,
      "text": " how that we are to have no wavering."
    },
    {
      "id": 171,
      "start": 446.1600036621094,
      "end": 447.0,
      "text": " Why?"
    },
    {
      "id": 172,
      "start": 447.0,
      "end": 449.0400085449219,
      "text": " Because we understand that our God,"
    },
    {
      "id": 173,
      "start": 449.0400085449219,
      "end": 452.0799865722656,
      "text": " the one who has promised that He is faithful."
    },
    {
      "id": 174,
      "start": 452.0799865722656,
      "end": 454.0400085449219,
      "text": " And what a blessing that is."
    },
    {
      "id": 175,
      "start": 454.0400085449219,
      "end": 458.0199890136719,
      "text": " We've often referred to the Abrahamic covenant earlier."
    },
    {
      "id": 176,
      "start": 458.0199890136719,
      "end": 459.7200012207031,
      "text": " In our study in the book of Genesis,"
    },
    {
      "id": 177,
      "start": 459.7200012207031,
      "end": 462.0799865722656,
      "text": " we dealt with the Noahic covenant."
    },
    {
      "id": 178,
      "start": 462.0799865722656,
      "end": 463.67999267578125,
      "text": " And as we dealt with the Noahic covenant,"
    },
    {
      "id": 179,
      "start": 463.67999267578125,
      "end": 466.4800109863281,
      "text": " we mentioned several of the aspects of that covenant."
    },
    {
      "id": 180,
      "start": 466.4800109863281,
      "end": 468.79998779296875,
      "text": " And here we find in verses two and three,"
    },
    {
      "id": 181,
      "start": 468.79998779296875,
      "end": 472.32000732421875,
      "text": " several aspects with regard to the Abrahamic covenant."
    },
    {
      "id": 182,
      "start": 472.32000732421875,
      "end": 475.760009765625,
      "text": " Notice what he says in verse number two."
    },
    {
      "id": 183,
      "start": 475.760009765625,
      "end": 479.8800048828125,
      "text": " And I will make of thee a great nation."
    },
    {
      "id": 184,
      "start": 479.8800048828125,
      "end": 483.0400085449219,
      "text": " I will make of thee a great nation."
    },
    {
      "id": 185,
      "start": 483.0799865722656,
      "end": 486.8399963378906,
      "text": " We find that God is giving this promise to Abram"
    },
    {
      "id": 186,
      "start": 486.8399963378906,
      "end": 489.760009765625,
      "text": " and he tells them he's gonna make them a great nation,"
    },
    {
      "id": 187,
      "start": 489.760009765625,
      "end": 492.1600036621094,
      "text": " the Hebrew people, the people of Israel."
    },
    {
      "id": 188,
      "start": 492.1600036621094,
      "end": 495.0400085449219,
      "text": " You understand that during the time,"
    },
    {
      "id": 189,
      "start": 495.0400085449219,
      "end": 497.82000732421875,
      "text": " during the reign of David and Solomon,"
    },
    {
      "id": 190,
      "start": 497.82000732421875,
      "end": 501.4800109863281,
      "text": " that the nation of Israel had possessed"
    },
    {
      "id": 191,
      "start": 501.4800109863281,
      "end": 505.79998779296875,
      "text": " such vast levels of territory and they were so powerful"
    },
    {
      "id": 192,
      "start": 505.79998779296875,
      "end": 509.20001220703125,
      "text": " in the prominence that they had in the world"
    },
    {
      "id": 193,
      "start": 509.20001220703125,
      "end": 510.8800048828125,
      "text": " at that particular time."
    },
    {
      "id": 194,
      "start": 510.8800048828125,
      "end": 513.280029296875,
      "text": " But we also understand prophetically"
    },
    {
      "id": 195,
      "start": 513.280029296875,
      "end": 516.3200073242188,
      "text": " many things about the Abrahamic covenant."
    },
    {
      "id": 196,
      "start": 516.3200073242188,
      "end": 518.280029296875,
      "text": " We'll get into some of those things this evening"
    },
    {
      "id": 197,
      "start": 518.280029296875,
      "end": 520.280029296875,
      "text": " even as we get into verse number three."
    },
    {
      "id": 198,
      "start": 520.280029296875,
      "end": 523.739990234375,
      "text": " But we find here that prophetically speaking"
    },
    {
      "id": 199,
      "start": 523.739990234375,
      "end": 526.47998046875,
      "text": " that the Lord Jesus Christ will rule and reign"
    },
    {
      "id": 200,
      "start": 526.47998046875,
      "end": 530.6799926757812,
      "text": " for a thousand years during the millennial reign of Christ."
    },
    {
      "id": 201,
      "start": 530.6799926757812,
      "end": 534.239990234375,
      "text": " And what a blessing it is for us to understand that"
    },
    {
      "id": 202,
      "start": 534.239990234375,
      "end": 537.7999877929688,
      "text": " and to see how that even here in the beginning portions"
    },
    {
      "id": 203,
      "start": 537.7999877929688,
      "end": 540.0399780273438,
      "text": " of this 12th chapter of the book of Genesis"
    },
    {
      "id": 204,
      "start": 540.0399780273438,
      "end": 542.6799926757812,
      "text": " is begin to see these promises that are rehearsed,"
    },
    {
      "id": 205,
      "start": 542.6799926757812,
      "end": 545.47998046875,
      "text": " how that we understand, yes, there was some fulfillment"
    },
    {
      "id": 206,
      "start": 545.47998046875,
      "end": 549.239990234375,
      "text": " of this during the time of Israel as a nation"
    },
    {
      "id": 207,
      "start": 549.239990234375,
      "end": 550.719970703125,
      "text": " historically we can read of,"
    },
    {
      "id": 208,
      "start": 550.719970703125,
      "end": 553.719970703125,
      "text": " but then when you have prophecy in view"
    },
    {
      "id": 209,
      "start": 553.719970703125,
      "end": 557.1199951171875,
      "text": " and you understand the millennial reign of Christ,"
    },
    {
      "id": 210,
      "start": 557.1199951171875,
      "end": 559.3599853515625,
      "text": " notice he continues in verse number two,"
    },
    {
      "id": 211,
      "start": 559.3599853515625,
      "end": 561.47998046875,
      "text": " not only will I make of thee a great nation,"
    },
    {
      "id": 212,
      "start": 561.47998046875,
      "end": 563.8800048828125,
      "text": " notice he says, and I will bless thee"
    },
    {
      "id": 213,
      "start": 563.8800048828125,
      "end": 568.8800048828125,
      "text": " and make thy name great and thou shalt be a blessing."
    },
    {
      "id": 214,
      "start": 570.47998046875,
      "end": 571.719970703125,
      "text": " Isn't that wonderful?"
    },
    {
      "id": 215,
      "start": 571.719970703125,
      "end": 574.52001953125,
      "text": " We see a little bit as we end verse number two"
    },
    {
      "id": 216,
      "start": 574.52001953125,
      "end": 575.8400268554688,
      "text": " and then get into verse number three,"
    },
    {
      "id": 217,
      "start": 575.8400268554688,
      "end": 578.5399780273438,
      "text": " how that blessing is going to work"
    },
    {
      "id": 218,
      "start": 578.5399780273438,
      "end": 579.47998046875,
      "text": " at the end of verse number three,"
    },
    {
      "id": 219,
      "start": 579.47998046875,
      "end": 581.47998046875,
      "text": " it says, and in thee shall all families of the earth"
    },
    {
      "id": 220,
      "start": 581.47998046875,
      "end": 583.6400146484375,
      "text": " be blessed and we'll touch on that in just a moment."
    },
    {
      "id": 221,
      "start": 583.6400146484375,
      "end": 585.6799926757812,
      "text": " But notice in verse number two that he says,"
    },
    {
      "id": 222,
      "start": 585.6799926757812,
      "end": 588.719970703125,
      "text": " I will bless thee and make thy name great"
    },
    {
      "id": 223,
      "start": 588.719970703125,
      "end": 590.0399780273438,
      "text": " and thou shalt be a blessing."
    },
    {
      "id": 224,
      "start": 590.0399780273438,
      "end": 592.4400024414062,
      "text": " I want you to think about this and kind of break it up."
    },
    {
      "id": 225,
      "start": 592.4400024414062,
      "end": 593.8400268554688,
      "text": " Notice if you hold your hand here"
    },
    {
      "id": 226,
      "start": 593.8400268554688,
      "end": 596.1199951171875,
      "text": " and turn over to Genesis chapter 24."
    },
    {
      "id": 227,
      "start": 596.1199951171875,
      "end": 598.5999755859375,
      "text": " And in Genesis chapter number 24,"
    },
    {
      "id": 228,
      "start": 598.5999755859375,
      "end": 600.52001953125,
      "text": " we find that the servants."
    },
    {
      "id": 0,
      "start": 600.52001953125,
      "end": 607.3200197219849,
      "text": " of Abraham. Abraham is stricken in age and Eleazar most likely is the servant"
    },
    {
      "id": 1,
      "start": 607.3200197219849,
      "end": 610.9200191497803,
      "text": " that was going to be given this task. It's the eldest servant of his house"
    },
    {
      "id": 2,
      "start": 610.9200191497803,
      "end": 617.02001953125,
      "text": " according to verse number two. And the task was to go and find a bride for"
    },
    {
      "id": 3,
      "start": 617.02001953125,
      "end": 622.8400192260742,
      "text": " Isaac. And it's interesting as this servant would go, and we'll study chapter"
    },
    {
      "id": 4,
      "start": 622.8400192260742,
      "end": 626.2400188446045,
      "text": " number 24 in I don't know how many months by the time we get there, but we"
    },
    {
      "id": 5,
      "start": 626.2400188446045,
      "end": 629.2800197601318,
      "text": " eventually will get there to chapter number 24 in our study of the book of"
    },
    {
      "id": 6,
      "start": 629.2800197601318,
      "end": 635.2400207519531,
      "text": " Genesis. But we find that the servant of Abraham says this in verse number 35."
    },
    {
      "id": 7,
      "start": 635.2400207519531,
      "end": 644.3600196838379,
      "text": " Notice where he says, and the Lord hath blessed my master greatly. What did God"
    },
    {
      "id": 8,
      "start": 644.3600196838379,
      "end": 652.0000190734863,
      "text": " say in verse number two? I will bless thee. And the servant, Eleazar most likely, is"
    },
    {
      "id": 9,
      "start": 652.0000190734863,
      "end": 657.52001953125,
      "text": " the one that is here speaking. He says in verse 34, I am Abraham's servant. And he"
    },
    {
      "id": 10,
      "start": 657.52001953125,
      "end": 663.0400199890137,
      "text": " says that the Lord hath blessed my master greatly, and he has become great."
    },
    {
      "id": 11,
      "start": 663.0400199890137,
      "end": 667.7200164794922,
      "text": " And he hath given him flocks, and herds, and silver, and gold, and menservants, and"
    },
    {
      "id": 12,
      "start": 667.7200164794922,
      "end": 673.4400177001953,
      "text": " maidservants, and camels, and asses. And you see how that God blessed Abraham. And"
    },
    {
      "id": 13,
      "start": 673.4400177001953,
      "end": 680.3600158691406,
      "text": " his servant recognizes that it's the Lord that had blessed his master. You"
    },
    {
      "id": 14,
      "start": 680.3600158691406,
      "end": 685.4400177001953,
      "text": " know this evening as a side note, it is important for us to recognize the"
    },
    {
      "id": 15,
      "start": 685.4400177001953,
      "end": 691.7600173950195,
      "text": " blessing of the Lord in our lives. Far too often people, especially in the"
    },
    {
      "id": 16,
      "start": 691.7600173950195,
      "end": 696.2800216674805,
      "text": " culture in which we live, there's this idea in this thought in which we're"
    },
    {
      "id": 17,
      "start": 696.2800216674805,
      "end": 701.8400192260742,
      "text": " self-made people. The reality is that God's hand of blessing has been upon us."
    },
    {
      "id": 18,
      "start": 701.8400192260742,
      "end": 706.8400192260742,
      "text": " We begin to consider the blessing of God and begin to consider the things that we"
    },
    {
      "id": 19,
      "start": 706.8400192260742,
      "end": 712.9600219726562,
      "text": " have. We say, well I worked hard for that. Who gave you the ability to work? Amen."
    },
    {
      "id": 20,
      "start": 712.9600219726562,
      "end": 717.7600173950195,
      "text": " And if we ever come to the place where we forget the blessing of God, we're in a"
    },
    {
      "id": 21,
      "start": 717.7600173950195,
      "end": 722.3200225830078,
      "text": " very dangerous place. The children of Israel were warned in Deuteronomy"
    },
    {
      "id": 22,
      "start": 722.3200225830078,
      "end": 726.4400177001953,
      "text": " chapter number 6 when he said, beware lest thou forget the Lord. When you enter"
    },
    {
      "id": 23,
      "start": 726.4400177001953,
      "end": 731.4800262451172,
      "text": " into a land and you possess homes that you did not build, and you partake"
    },
    {
      "id": 24,
      "start": 731.4800262451172,
      "end": 736.3600158691406,
      "text": " of the vineyards that you did not plant, and so on and so forth, beware lest thou"
    },
    {
      "id": 25,
      "start": 736.3600158691406,
      "end": 740.2800140380859,
      "text": " forget the Lord. And there are times in which we find in Israel's history that"
    },
    {
      "id": 26,
      "start": 740.2800140380859,
      "end": 744.4400177001953,
      "text": " they were guilty of that very thing. They forgot the source of blessing and"
    },
    {
      "id": 27,
      "start": 744.4400177001953,
      "end": 749.6400146484375,
      "text": " how important it is that we recognize the source of blessing and the servant."
    },
    {
      "id": 28,
      "start": 749.6400146484375,
      "end": 753.6000213623047,
      "text": " He does not say, he does not come in. Now, I want you to understand this. I believe"
    },
    {
      "id": 29,
      "start": 753.6000213623047,
      "end": 756.7200164794922,
      "text": " it's significant. I'll deal with this again in several months. Most of you will"
    },
    {
      "id": 30,
      "start": 756.7200164794922,
      "end": 760.2000122070312,
      "text": " forget what I said now. I might forget what I said now, so we'll be able to"
    },
    {
      "id": 31,
      "start": 760.2000122070312,
      "end": 767.4800262451172,
      "text": " repeat it. Amen. But the reality is that the servant has a perspective that no"
    },
    {
      "id": 32,
      "start": 768.1200256347656,
      "end": 774.7200164794922,
      "text": " doubt Abraham contributed to that perspective, right? Abraham did not"
    },
    {
      "id": 33,
      "start": 774.7200164794922,
      "end": 780.9600219726562,
      "text": " portray to his servant, look at me, look at what I've done, look at what I have,"
    },
    {
      "id": 34,
      "start": 780.9600219726562,
      "end": 786.3200225830078,
      "text": " look at all of my possessions. No, no, I believe that Abraham was careful to let"
    },
    {
      "id": 35,
      "start": 786.3200225830078,
      "end": 792.8000183105469,
      "text": " his servant understand, God has blessed me. And that's important for us to"
    },
    {
      "id": 36,
      "start": 792.8000183105469,
      "end": 799.6800231933594,
      "text": " understand because it is the blessing of God. Often, I understand as we would"
    },
    {
      "id": 37,
      "start": 799.6800231933594,
      "end": 803.1200256347656,
      "text": " think about maybe our roles and responsibilities and as a husband and"
    },
    {
      "id": 38,
      "start": 803.1200256347656,
      "end": 807.2800140380859,
      "text": " father, oftentimes we think of our responsibility to provide for our family"
    },
    {
      "id": 39,
      "start": 807.2800140380859,
      "end": 812.5600128173828,
      "text": " and certainly that is a responsibility that we have, but I regularly remind our"
    },
    {
      "id": 40,
      "start": 812.5600128173828,
      "end": 819.4000244140625,
      "text": " children that yes, God has been so good to us and he has provided for us and he's"
    },
    {
      "id": 41,
      "start": 819.4000244140625,
      "end": 824.9600219726562,
      "text": " given us the opportunity to have these things. God's hand a blessing upon us. We"
    },
    {
      "id": 42,
      "start": 824.9600219726562,
      "end": 829.6400146484375,
      "text": " see it in the the life of Abraham. We see here this promise that God makes to"
    },
    {
      "id": 43,
      "start": 829.6400146484375,
      "end": 833.0000152587891,
      "text": " Abram and we find that he says, I will bless thee, and he did. He said, I'll make"
    },
    {
      "id": 44,
      "start": 833.0000152587891,
      "end": 839.1600189208984,
      "text": " thy name great. You know, Abraham is still the patriarch for the Jewish people."
    },
    {
      "id": 45,
      "start": 839.1600189208984,
      "end": 844.4800262451172,
      "text": " Father Abraham. Many of the Jewish people will refer to Abraham in that manner. In"
    },
    {
      "id": 46,
      "start": 844.5600128173828,
      "end": 852.0000152587891,
      "text": " fact, many, not only Jewish descendants, but many Islamic descendants will also"
    },
    {
      "id": 47,
      "start": 852.0000152587891,
      "end": 857.6800231933594,
      "text": " hold Abraham in high regard. They have a misunderstanding, from my perspective,"
    },
    {
      "id": 48,
      "start": 857.6800231933594,
      "end": 863.0400085449219,
      "text": " biblically speaking, as to the role of Ishmael versus Isaac and so on and so"
    },
    {
      "id": 49,
      "start": 863.0400085449219,
      "end": 866.52001953125,
      "text": " forth, and we'll get to that in a few months as we continue through the book"
    },
    {
      "id": 50,
      "start": 866.52001953125,
      "end": 871.4400329589844,
      "text": " of Genesis, but we find there's a grave misunderstanding there with regard to"
    },
    {
      "id": 51,
      "start": 871.4400329589844,
      "end": 875.280029296875,
      "text": " the blessing and the descendant and so on and so forth, but many of them will"
    },
    {
      "id": 52,
      "start": 875.280029296875,
      "end": 880.0400085449219,
      "text": " also refer to Father Abraham. Abraham's held in high regard. He said, I will bless"
    },
    {
      "id": 53,
      "start": 880.0400085449219,
      "end": 885.1600341796875,
      "text": " thee and I will make thy name great. We spoke often, even as we looked at the"
    },
    {
      "id": 54,
      "start": 885.1600341796875,
      "end": 889.2400207519531,
      "text": " book of Hebrews, how that so many things in which the writer will present and"
    },
    {
      "id": 55,
      "start": 889.2400207519531,
      "end": 893.5600280761719,
      "text": " show how that Christ is superior, and you'll remember that even during the"
    },
    {
      "id": 56,
      "start": 893.5600280761719,
      "end": 897.280029296875,
      "text": " life and ministry of the Lord Jesus Christ, that there were times in which"
    },
    {
      "id": 57,
      "start": 897.4000244140625,
      "end": 902.7200317382812,
      "text": " the people would say, well, we're the disciples of Moses, and we find that they"
    },
    {
      "id": 58,
      "start": 902.7200317382812,
      "end": 906.7200317382812,
      "text": " would make statements such as that, and we find that there was some discussion"
    },
    {
      "id": 59,
      "start": 906.7200317382812,
      "end": 912.0400085449219,
      "text": " in John chapter number 8 with regard to Abraham and so on and so forth, and"
    },
    {
      "id": 60,
      "start": 912.0400085449219,
      "end": 917.760009765625,
      "text": " Jesus is speaking there and speaking to them about Abraham, and he says, your"
    },
    {
      "id": 61,
      "start": 917.760009765625,
      "end": 923.9600219726562,
      "text": " father Abraham, in verse number 56 of John 8, your father Abraham rejoiced"
    },
    {
      "id": 62,
      "start": 923.9600219726562,
      "end": 930.2000122070312,
      "text": " to see my day, and he saw it and was glad. And of course, those Jews, they had no"
    },
    {
      "id": 63,
      "start": 930.2000122070312,
      "end": 934.280029296875,
      "text": " understanding. They said to him, thou art not yet 50 years old. They can still say"
    },
    {
      "id": 64,
      "start": 934.280029296875,
      "end": 939.0800170898438,
      "text": " that about me for a little while, amen? And hast thou seen Abraham? And what did"
    },
    {
      "id": 65,
      "start": 939.0800170898438,
      "end": 946.2400207519531,
      "text": " Jesus say? Verily, verily, I say unto you, before Abraham was, I am. We find that"
    },
    {
      "id": 66,
      "start": 946.2400207519531,
      "end": 952.52001953125,
      "text": " Abraham was held, is continued to be held in high regard. God said, I will bless"
    },
    {
      "id": 67,
      "start": 952.52001953125,
      "end": 957.5600280761719,
      "text": " thee. He said that I will make thy name great. He says, thou shalt be a blessing."
    },
    {
      "id": 68,
      "start": 957.5600280761719,
      "end": 961.1600341796875,
      "text": " We're gonna hold that thought as we go into verse number 3. Notice in verse"
    },
    {
      "id": 69,
      "start": 961.1600341796875,
      "end": 965.1600341796875,
      "text": " number 3, as it continues, the first aspect of verse number 3, he says this,"
    },
    {
      "id": 70,
      "start": 965.1600341796875,
      "end": 973.1600341796875,
      "text": " and I will bless them that bless thee, and curse him that curseth thee. You know,"
    },
    {
      "id": 71,
      "start": 973.1600341796875,
      "end": 977.6800231933594,
      "text": " the reality is that this aspect of this promise, we could find not only in"
    },
    {
      "id": 72,
      "start": 977.6800231933594,
      "end": 982.7200317382812,
      "text": " biblical history, but in modern history as well, many examples of this truth"
    },
    {
      "id": 73,
      "start": 982.7200317382812,
      "end": 987.280029296875,
      "text": " right here. Those that are the friends, the allies of the nation of Israel,"
    },
    {
      "id": 74,
      "start": 987.280029296875,
      "end": 992.3200073242188,
      "text": " historically, biblically speaking, they have been blessed, and those that are the"
    },
    {
      "id": 75,
      "start": 992.3200073242188,
      "end": 997.1200256347656,
      "text": " adversaries, they have been cursed. You can see it. You can look at biblical"
    },
    {
      "id": 76,
      "start": 997.1200256347656,
      "end": 1001.760009765625,
      "text": " history, you can look at the modern history, you can see it throughout this"
    },
    {
      "id": 77,
      "start": 1001.760009765625,
      "end": 1006.3200073242188,
      "text": " case of what God is saying here. I will bless them that bless thee, and curse him"
    },
    {
      "id": 78,
      "start": 1006.3200073242188,
      "end": 1010.4000244140625,
      "text": " that curseth thee. By the way, it's a good thing for us to be friends of"
    },
    {
      "id": 79,
      "start": 1010.4000244140625,
      "end": 1016.1600341796875,
      "text": " Israel, amen? And it's important for us to understand that truth, even as"
    },
    {
      "id": 80,
      "start": 1016.1600341796875,
      "end": 1021.4000244140625,
      "text": " we find here in Genesis 12, in verse number 3. Notice he continues and ends"
    },
    {
      "id": 81,
      "start": 1021.4000244140625,
      "end": 1025.4000244140625,
      "text": " this level of the promises being rehearsed. In verse number 3, it says,"
    },
    {
      "id": 82,
      "start": 1025.4000244140625,
      "end": 1034.5600280761719,
      "text": " and in thee shall all families of the earth be blessed. And in thee shall all"
    },
    {
      "id": 83,
      "start": 1034.6400146484375,
      "end": 1038.3200073242188,
      "text": " families of the earth be blessed. He said at the end of verse number 2, and thou"
    },
    {
      "id": 84,
      "start": 1038.3200073242188,
      "end": 1042.280029296875,
      "text": " shalt be a blessing. Notice, if you turn over to Genesis chapter 22, in verse"
    },
    {
      "id": 85,
      "start": 1042.280029296875,
      "end": 1046.6000061035156,
      "text": " number 18, we'll be mindful of the fact that Genesis 22 records for us the time"
    },
    {
      "id": 86,
      "start": 1046.6000061035156,
      "end": 1051.3200073242188,
      "text": " in which the Lord gave instruction to Abraham to offer Isaac, his son, upon the"
    },
    {
      "id": 87,
      "start": 1051.3200073242188,
      "end": 1056.8400268554688,
      "text": " altar. And we find that in Genesis 22, in verse number 18, notice what God says, and"
    },
    {
      "id": 88,
      "start": 1056.8400268554688,
      "end": 1063.0000305175781,
      "text": " in thy seed shall all the nations of the earth be blessed, because thou hast"
    },
    {
      "id": 89,
      "start": 1063.0000305175781,
      "end": 1069.0800170898438,
      "text": " obeyed my voice. Now, we understand this truth in Genesis, and it's important that"
    },
    {
      "id": 90,
      "start": 1069.0800170898438,
      "end": 1072.8800048828125,
      "text": " we follow it through, and go over to the book of Galatians, if you will, in the"
    },
    {
      "id": 91,
      "start": 1072.8800048828125,
      "end": 1076.9600219726562,
      "text": " third chapter. I mentioned to you this morning that we would reference this"
    },
    {
      "id": 92,
      "start": 1076.9600219726562,
      "end": 1081.2400207519531,
      "text": " passage of Scripture this evening. In Galatians chapter number"
    },
    {
      "id": 93,
      "start": 1081.2400207519531,
      "end": 1085.3600158691406,
      "text": " 3, really, if you're taking notes, write down verses 6 through 18, because you"
    },
    {
      "id": 94,
      "start": 1085.3600158691406,
      "end": 1089.6800231933594,
      "text": " need to read all of it, and you need to reference all of it. This evening, I won't"
    },
    {
      "id": 95,
      "start": 1089.760009765625,
      "end": 1093.3200073242188,
      "text": " have time to read all of it, I'm just gonna pick some verses out of it and"
    },
    {
      "id": 96,
      "start": 1093.3200073242188,
      "end": 1097.9600219726562,
      "text": " give you the truth that is here, but it's such a rich passage of Scripture that"
    },
    {
      "id": 97,
      "start": 1097.9600219726562,
      "end": 1103.0000305175781,
      "text": " provides us with great truth with regard to how all the families of the earth"
    },
    {
      "id": 98,
      "start": 1103.0000305175781,
      "end": 1107.3200073242188,
      "text": " would be blessed. Remember, as we looked at Hebrews chapter number 6 many weeks"
    },
    {
      "id": 99,
      "start": 1107.3200073242188,
      "end": 1111.9600219726562,
      "text": " ago, and referenced it this morning, we said that more of the promise, the aspect"
    },
    {
      "id": 100,
      "start": 1111.9600219726562,
      "end": 1115.8800048828125,
      "text": " of the promise that was in view in Hebrews chapter number 6, was the"
    },
    {
      "id": 101,
      "start": 1115.8800048828125,
      "end": 1120.9200439453125,
      "text": " promise of a seed, not so much the promise of a land. And we find here that"
    },
    {
      "id": 102,
      "start": 1120.9200439453125,
      "end": 1124.6000366210938,
      "text": " that seed is mentioned here in Galatians 3. Notice in verse number 6,"
    },
    {
      "id": 103,
      "start": 1124.6000366210938,
      "end": 1129.780029296875,
      "text": " even as Abraham believed God, and it was accounted to him for righteousness, know"
    },
    {
      "id": 104,
      "start": 1129.780029296875,
      "end": 1135.0,
      "text": " you therefore that they which are of faith, the same are the children of"
    },
    {
      "id": 105,
      "start": 1135.0,
      "end": 1139.7200317382812,
      "text": " Abraham. In the Scripture, foreseeing that God would justify the heathen through"
    },
    {
      "id": 106,
      "start": 1139.7200317382812,
      "end": 1144.6000366210938,
      "text": " faith, preached before the gospel unto Abraham, saying, notice what it says,"
    },
    {
      "id": 107,
      "start": 1144.6000366210938,
      "end": 1150.4800415039062,
      "text": " and thee shall all nations be blessed. So then they which be of faith are"
    },
    {
      "id": 108,
      "start": 1150.4800415039062,
      "end": 1157.0800170898438,
      "text": " blessed with faithful Abraham. But how is that? How did this promise that was given,"
    },
    {
      "id": 109,
      "start": 1157.0800170898438,
      "end": 1161.0800170898438,
      "text": " how would that come to pass? Skip down and look at verse number 15, verse"
    },
    {
      "id": 110,
      "start": 1161.0800170898438,
      "end": 1165.4000244140625,
      "text": " number 14, that the blessing of Abraham might come on the Gentiles through who?"
    },
    {
      "id": 111,
      "start": 1165.4000244140625,
      "end": 1172.280029296875,
      "text": " Through Jesus Christ. That we might receive the promise of the Spirit"
    },
    {
      "id": 112,
      "start": 1172.280029296875,
      "end": 1176.800048828125,
      "text": " through faith. Brethren, I speak after the manner of men, though it be but a"
    },
    {
      "id": 113,
      "start": 1176.800048828125,
      "end": 1180.760009765625,
      "text": " man's covenant, yet if it be confirmed, no man disannulleth or addeth thereunto,"
    },
    {
      "id": 114,
      "start": 1180.760009765625,
      "end": 1188.6000366210938,
      "text": " or thereto. Now to Abraham and his, what does it say? Seed. Were the promises made,"
    },
    {
      "id": 115,
      "start": 1188.6000366210938,
      "end": 1201.239990234375,
      "text": " he saith not, and to seeds as of many, but as one. And to thy seed, which is Christ."
    },
    {
      "id": 0,
      "start": 1201.239990234375,
      "end": 1205.239990234375,
      "text": " And this I say, that the covenant that was confirmed before of God and Christ,"
    },
    {
      "id": 1,
      "start": 1205.239990234375,
      "end": 1208.159990310669,
      "text": " the law which was four hundred and thirty years after,"
    },
    {
      "id": 2,
      "start": 1208.159990310669,
      "end": 1211.659990310669,
      "text": " cannot disannul, that it should make the promise of none effect."
    },
    {
      "id": 3,
      "start": 1211.659990310669,
      "end": 1215.0399904251099,
      "text": " For if the inheritance be of the law, it is no more of promise,"
    },
    {
      "id": 4,
      "start": 1215.0399904251099,
      "end": 1219.079990386963,
      "text": " but God gave it to Abraham by promise.\""
    },
    {
      "id": 5,
      "start": 1219.079990386963,
      "end": 1223.4599895477295,
      "text": " And it's so important that we understand the truth that is being given here,"
    },
    {
      "id": 6,
      "start": 1223.4599895477295,
      "end": 1225.7599906921387,
      "text": " as God would be giving these promises,"
    },
    {
      "id": 7,
      "start": 1225.7599906921387,
      "end": 1229.4599895477295,
      "text": " and these promises are rehearsed here in Genesis 12, verses 2 and 3,"
    },
    {
      "id": 8,
      "start": 1229.5199909210205,
      "end": 1232.0199909210205,
      "text": " and he says, \"...and these shall all families of the earth be blessed.\""
    },
    {
      "id": 9,
      "start": 1232.0199909210205,
      "end": 1234.5999908447266,
      "text": " And we study and compare Scripture with Scripture,"
    },
    {
      "id": 10,
      "start": 1234.5999908447266,
      "end": 1238.7199897766113,
      "text": " and we find that here, the seed that is being spoken of,"
    },
    {
      "id": 11,
      "start": 1238.7199897766113,
      "end": 1242.4799919128418,
      "text": " the blessing that would come is through Jesus Christ."
    },
    {
      "id": 12,
      "start": 1242.4799919128418,
      "end": 1246.8199920654297,
      "text": " Thus, the reason that the lens of Scripture focuses in,"
    },
    {
      "id": 13,
      "start": 1246.8199920654297,
      "end": 1250.6599884033203,
      "text": " at the end of Genesis chapter number 11, upon Abram."
    },
    {
      "id": 14,
      "start": 1250.6599884033203,
      "end": 1253.4999885559082,
      "text": " And we find that beginning here in chapter number 12,"
    },
    {
      "id": 15,
      "start": 1253.4999885559082,
      "end": 1257.3199920654297,
      "text": " and going forward, we see how that Abraham and the people of Israel"
    },
    {
      "id": 16,
      "start": 1257.3599891662598,
      "end": 1260.0999908447266,
      "text": " become the central focus of Scripture."
    },
    {
      "id": 17,
      "start": 1260.0999908447266,
      "end": 1262.8599891662598,
      "text": " Yes, there are other people, groups, and other nations"
    },
    {
      "id": 18,
      "start": 1262.8599891662598,
      "end": 1264.8599891662598,
      "text": " that are dealt with throughout Scripture,"
    },
    {
      "id": 19,
      "start": 1264.8599891662598,
      "end": 1270.119987487793,
      "text": " but primarily as they interacted with the people of God."
    },
    {
      "id": 20,
      "start": 1270.119987487793,
      "end": 1273.2799911499023,
      "text": " We find that what he's saying here at the end of verse number 3,"
    },
    {
      "id": 21,
      "start": 1273.2799911499023,
      "end": 1276.7799911499023,
      "text": " when he says, \"...and in thee shall all families of the earth be blessed,\""
    },
    {
      "id": 22,
      "start": 1276.7799911499023,
      "end": 1279.4999923706055,
      "text": " is he's speaking about our Savior who would come."
    },
    {
      "id": 23,
      "start": 1279.4999923706055,
      "end": 1282.6599884033203,
      "text": " Remember the Messianic line, the Semitic line,"
    },
    {
      "id": 24,
      "start": 1282.6599884033203,
      "end": 1287.0799865722656,
      "text": " and that's why it was important that we trace in chapter number 10,"
    },
    {
      "id": 25,
      "start": 1287.0799865722656,
      "end": 1291.4599914550781,
      "text": " the descendants of Shem, and how it goes to Terah and then Abram."
    },
    {
      "id": 26,
      "start": 1291.4599914550781,
      "end": 1295.1799926757812,
      "text": " And we see that line in the fulfillment of the promise"
    },
    {
      "id": 27,
      "start": 1295.1799926757812,
      "end": 1299.2999877929688,
      "text": " in which Noah made back in chapter number 9,"
    },
    {
      "id": 28,
      "start": 1299.2999877929688,
      "end": 1303.2599868774414,
      "text": " when he talked about the blessing of the God of Shem."
    },
    {
      "id": 29,
      "start": 1303.2599868774414,
      "end": 1309.8999938964844,
      "text": " And you begin to look at Scripture and see how everything fits together,"
    },
    {
      "id": 30,
      "start": 1309.8999938964844,
      "end": 1313.5599899291992,
      "text": " and how God has given us these wonderful truths."
    },
    {
      "id": 31,
      "start": 1313.5799865722656,
      "end": 1317.2999877929688,
      "text": " We see in the first few verses that the instruction is received,"
    },
    {
      "id": 32,
      "start": 1317.2999877929688,
      "end": 1319.339988708496,
      "text": " the promises are rehearsed."
    },
    {
      "id": 33,
      "start": 1319.339988708496,
      "end": 1325.5199890136719,
      "text": " In verses 4-9, we see Abram's obedience is recorded."
    },
    {
      "id": 34,
      "start": 1325.5199890136719,
      "end": 1327.8999938964844,
      "text": " It's only three words to begin verse number 4,"
    },
    {
      "id": 35,
      "start": 1327.8999938964844,
      "end": 1331.7799835205078,
      "text": " and it's the title by which we're using for our study this evening,"
    },
    {
      "id": 36,
      "start": 1331.7799835205078,
      "end": 1336.0799865722656,
      "text": " but I want you to think about the significance of these three words."
    },
    {
      "id": 37,
      "start": 1336.0799865722656,
      "end": 1339.5799865722656,
      "text": " So, Abram departed."
    },
    {
      "id": 38,
      "start": 1339.5799865722656,
      "end": 1341.1599884033203,
      "text": " He obeyed the Lord."
    },
    {
      "id": 39,
      "start": 1341.1799926757812,
      "end": 1343.5999908447266,
      "text": " Aren't you thankful that he departed?"
    },
    {
      "id": 40,
      "start": 1343.5999908447266,
      "end": 1347.479995727539,
      "text": " Aren't you thankful as you begin to understand all that we've just dealt with,"
    },
    {
      "id": 41,
      "start": 1347.479995727539,
      "end": 1352.5999908447266,
      "text": " and you begin to understand all of the implications of those simple three words,"
    },
    {
      "id": 42,
      "start": 1352.5999908447266,
      "end": 1358.0199890136719,
      "text": " that simple action that Abram took in obeying the voice of the Lord?"
    },
    {
      "id": 43,
      "start": 1358.0199890136719,
      "end": 1359.479995727539,
      "text": " So, Abram departed."
    },
    {
      "id": 44,
      "start": 1359.479995727539,
      "end": 1363.239990234375,
      "text": " We understand that as we look at that phraseology,"
    },
    {
      "id": 45,
      "start": 1363.239990234375,
      "end": 1365.6999969482422,
      "text": " that it would be faith and obedience."
    },
    {
      "id": 46,
      "start": 1365.6999969482422,
      "end": 1369.3599853515625,
      "text": " And it says here that Abram departed, notice this,"
    },
    {
      "id": 47,
      "start": 1369.3599853515625,
      "end": 1374.0399932861328,
      "text": " as the Lord had spoken unto him."
    },
    {
      "id": 48,
      "start": 1374.0399932861328,
      "end": 1376.0799865722656,
      "text": " He was obedient to the Lord."
    },
    {
      "id": 49,
      "start": 1376.0799865722656,
      "end": 1379.1999969482422,
      "text": " You'll never go wrong obeying God."
    },
    {
      "id": 50,
      "start": 1379.1999969482422,
      "end": 1380.739990234375,
      "text": " Amen?"
    },
    {
      "id": 51,
      "start": 1380.739990234375,
      "end": 1384.4599914550781,
      "text": " God will never lead you in a wrong way."
    },
    {
      "id": 52,
      "start": 1384.4599914550781,
      "end": 1387.5399932861328,
      "text": " We ought to be careful that we're following the Lord's direction."
    },
    {
      "id": 53,
      "start": 1387.5399932861328,
      "end": 1388.2999877929688,
      "text": " Amen?"
    },
    {
      "id": 54,
      "start": 1388.2999877929688,
      "end": 1392.6799926757812,
      "text": " We ought to be absolutely assured that we're following the Lord's direction,"
    },
    {
      "id": 55,
      "start": 1392.6799926757812,
      "end": 1396.7999877929688,
      "text": " that we're not just looking at it from some temporal human perspective"
    },
    {
      "id": 56,
      "start": 1396.7999877929688,
      "end": 1400.239990234375,
      "text": " of how we make decisions on what we're going to do and so on and so forth,"
    },
    {
      "id": 57,
      "start": 1400.239990234375,
      "end": 1403.9199829101562,
      "text": " but know that we're following the direction that God has given us in our lives."
    },
    {
      "id": 58,
      "start": 1403.9199829101562,
      "end": 1408.0399932861328,
      "text": " And we find here that Abram departed as the Lord had spoken unto him."
    },
    {
      "id": 59,
      "start": 1408.0399932861328,
      "end": 1410.2999877929688,
      "text": " Notice as we look here, the Bible says this,"
    },
    {
      "id": 60,
      "start": 1410.2999877929688,
      "end": 1414.1399841308594,
      "text": " and Lot went with him, and Abram was seventy and five years old"
    },
    {
      "id": 61,
      "start": 1414.1399841308594,
      "end": 1417.5999908447266,
      "text": " when he departed out of Haran."
    },
    {
      "id": 62,
      "start": 1417.5999908447266,
      "end": 1419.759994506836,
      "text": " It tells us in verse number five,"
    },
    {
      "id": 63,
      "start": 1419.759994506836,
      "end": 1424.3199920654297,
      "text": " and Abram took Sarai, his wife, and Lot, his brother's son,"
    },
    {
      "id": 64,
      "start": 1424.4199829101562,
      "end": 1426.8799896240234,
      "text": " and all their substance that they had gathered,"
    },
    {
      "id": 65,
      "start": 1426.8799896240234,
      "end": 1429.5599975585938,
      "text": " and the souls that they had gotten in Haran,"
    },
    {
      "id": 66,
      "start": 1429.5599975585938,
      "end": 1432.6399841308594,
      "text": " and they went forth to go into the land of Canaan."
    },
    {
      "id": 67,
      "start": 1432.6399841308594,
      "end": 1434.6399841308594,
      "text": " And it says at the end of verse number five,"
    },
    {
      "id": 68,
      "start": 1434.6399841308594,
      "end": 1439.0999908447266,
      "text": " and into the land of Canaan they came."
    },
    {
      "id": 69,
      "start": 1439.0999908447266,
      "end": 1442.3199920654297,
      "text": " They left Haran, we see at the end of verse number four,"
    },
    {
      "id": 70,
      "start": 1442.3199920654297,
      "end": 1446.5599975585938,
      "text": " it says that they departed out of Haran at the end of verse number six,"
    },
    {
      "id": 71,
      "start": 1446.5599975585938,
      "end": 1451.5199890136719,
      "text": " and they came, and into the land of Canaan they came."
    },
    {
      "id": 72,
      "start": 1451.5199890136719,
      "end": 1454.1599884033203,
      "text": " And God gave them the provision for the journey that they needed."
    },
    {
      "id": 73,
      "start": 1454.1599884033203,
      "end": 1458.1600036621094,
      "text": " We see that Abram took his wife, Sarai, he took his nephew, Lot,"
    },
    {
      "id": 74,
      "start": 1458.1600036621094,
      "end": 1461.2799987792969,
      "text": " they took all of their substance, according to what we read in verse number five,"
    },
    {
      "id": 75,
      "start": 1461.2799987792969,
      "end": 1464.8800048828125,
      "text": " the servants that they've been able to gather, and so on and so forth."
    },
    {
      "id": 76,
      "start": 1464.8800048828125,
      "end": 1467.5999755859375,
      "text": " And we find that they took that journey,"
    },
    {
      "id": 77,
      "start": 1467.5999755859375,
      "end": 1472.8800048828125,
      "text": " and God, no doubt, went before them and provided along the way."
    },
    {
      "id": 78,
      "start": 1472.8800048828125,
      "end": 1474.5599975585938,
      "text": " What a blessing."
    },
    {
      "id": 79,
      "start": 1474.5599975585938,
      "end": 1478.3199768066406,
      "text": " You know, I think about Abram, and I think about his faith,"
    },
    {
      "id": 80,
      "start": 1478.3199768066406,
      "end": 1485.6799926757812,
      "text": " and his obedience, and how God said to go unto a land that I will show thee."
    },
    {
      "id": 81,
      "start": 1485.6799926757812,
      "end": 1487.5999755859375,
      "text": " It was just simple obedience and faith,"
    },
    {
      "id": 82,
      "start": 1487.5999755859375,
      "end": 1491.1199951171875,
      "text": " following the direction of the Lord, trusting God."
    },
    {
      "id": 83,
      "start": 1491.1199951171875,
      "end": 1495.1999816894531,
      "text": " We read in verse six how the Bible would review for us"
    },
    {
      "id": 84,
      "start": 1495.1999816894531,
      "end": 1497.1999816894531,
      "text": " the places in which they came,"
    },
    {
      "id": 85,
      "start": 1497.1999816894531,
      "end": 1501.1199951171875,
      "text": " and we see in verse number eight, again, the references that are provided."
    },
    {
      "id": 86,
      "start": 1501.1199951171875,
      "end": 1502.0,
      "text": " It says in verse six,"
    },
    {
      "id": 87,
      "start": 1502.0,
      "end": 1505.0399780273438,
      "text": " and Abram passed through the land unto the place of Shechem,"
    },
    {
      "id": 88,
      "start": 1505.0399780273438,
      "end": 1508.8800048828125,
      "text": " under the plain of Morah, and the Canaanite was then in the land."
    },
    {
      "id": 89,
      "start": 1508.8800048828125,
      "end": 1511.8399963378906,
      "text": " And so we see that they come first to this place"
    },
    {
      "id": 90,
      "start": 1511.8399963378906,
      "end": 1514.8800048828125,
      "text": " that often referred to as Shechem throughout the scriptures,"
    },
    {
      "id": 91,
      "start": 1514.8800048828125,
      "end": 1517.3599853515625,
      "text": " and it says under the plain of Morah."
    },
    {
      "id": 92,
      "start": 1517.3599853515625,
      "end": 1520.239990234375,
      "text": " It does reveal to us at the end of verse number six"
    },
    {
      "id": 93,
      "start": 1520.239990234375,
      "end": 1522.3999938964844,
      "text": " that the Canaanite was then in the land."
    },
    {
      "id": 94,
      "start": 1522.3999938964844,
      "end": 1526.47998046875,
      "text": " We're familiar with the truth that we mentioned back in chapter number nine"
    },
    {
      "id": 95,
      "start": 1526.47998046875,
      "end": 1528.1600036621094,
      "text": " with regard to the Canaanites,"
    },
    {
      "id": 96,
      "start": 1528.1600036621094,
      "end": 1531.6799926757812,
      "text": " and we had referenced during that particular message"
    },
    {
      "id": 97,
      "start": 1531.6799926757812,
      "end": 1533.3599853515625,
      "text": " and dealing with that subject matter,"
    },
    {
      "id": 98,
      "start": 1534.0,
      "end": 1537.3599853515625,
      "text": " how the Canaanites would initially inhabit the land"
    },
    {
      "id": 99,
      "start": 1537.3599853515625,
      "end": 1540.0799865722656,
      "text": " that we would refer to as the land of promise."
    },
    {
      "id": 100,
      "start": 1540.0799865722656,
      "end": 1542.3199768066406,
      "text": " Of course, the Canaanites would be in that land"
    },
    {
      "id": 101,
      "start": 1542.3199768066406,
      "end": 1544.0,
      "text": " for a lengthy period of time,"
    },
    {
      "id": 102,
      "start": 1544.0,
      "end": 1547.8399963378906,
      "text": " hundreds of years that they would be in that place."
    },
    {
      "id": 103,
      "start": 1547.8399963378906,
      "end": 1550.239990234375,
      "text": " And we find that they go to Shechem,"
    },
    {
      "id": 104,
      "start": 1550.239990234375,
      "end": 1551.3599853515625,
      "text": " they come to the plain of Morah."
    },
    {
      "id": 105,
      "start": 1551.3599853515625,
      "end": 1554.7999877929688,
      "text": " Notice in verse number seven what significance this holds."
    },
    {
      "id": 106,
      "start": 1554.7999877929688,
      "end": 1556.6399841308594,
      "text": " Again, the Bible says,"
    },
    {
      "id": 107,
      "start": 1556.6399841308594,
      "end": 1560.1600036621094,
      "text": " and the Lord appeared unto Abram."
    },
    {
      "id": 108,
      "start": 1560.7200012207031,
      "end": 1561.5999755859375,
      "text": " Isn't that exciting?"
    },
    {
      "id": 109,
      "start": 1562.0,
      "end": 1562.7999877929688,
      "text": " Can you imagine?"
    },
    {
      "id": 110,
      "start": 1563.7599792480469,
      "end": 1566.5599975585938,
      "text": " As Abram was following the leadership of God,"
    },
    {
      "id": 111,
      "start": 1566.5599975585938,
      "end": 1571.5999755859375,
      "text": " as Abraham was obedient to follow the direction that had been received,"
    },
    {
      "id": 112,
      "start": 1571.5999755859375,
      "end": 1575.5199890136719,
      "text": " we find that the Bible tells us that the Lord appeared unto him."
    },
    {
      "id": 113,
      "start": 1575.5199890136719,
      "end": 1576.9599914550781,
      "text": " And notice what he says,"
    },
    {
      "id": 114,
      "start": 1576.9599914550781,
      "end": 1581.7599792480469,
      "text": " unto thy seed will I give this land."
    },
    {
      "id": 115,
      "start": 1582.8800048828125,
      "end": 1587.8399963378906,
      "text": " It says, and there built he an altar unto the Lord who appeared unto him."
    },
    {
      "id": 116,
      "start": 1588.6399841308594,
      "end": 1590.8800048828125,
      "text": " I want you to think about the significance"
    },
    {
      "id": 117,
      "start": 1591.8399963378906,
      "end": 1594.8800048828125,
      "text": " of the appearance when God appeared to Abram"
    },
    {
      "id": 118,
      "start": 1595.5999755859375,
      "end": 1597.9199829101562,
      "text": " and how wonderful that must have been."
    },
    {
      "id": 119,
      "start": 1598.5599975585938,
      "end": 1600.5599975585938,
      "text": " I want you to think about the significance"
    },
    {
      "id": 120,
      "start": 1600.5599975585938,
      "end": 1603.2799987792969,
      "text": " of what the Lord said to Abram when He said,"
    },
    {
      "id": 121,
      "start": 1603.2799987792969,
      "end": 1607.5199890136719,
      "text": " unto thy seed will I give this land."
    },
    {
      "id": 122,
      "start": 1607.5199890136719,
      "end": 1610.7999877929688,
      "text": " This has been something that has been debated for centuries"
    },
    {
      "id": 123,
      "start": 1610.7999877929688,
      "end": 1612.6399841308594,
      "text": " with regard to the ownership of the land."
    },
    {
      "id": 124,
      "start": 1612.6399841308594,
      "end": 1616.3999938964844,
      "text": " And we understand that God not only made this promise here to Abram,"
    },
    {
      "id": 125,
      "start": 1616.3999938964844,
      "end": 1619.0399780273438,
      "text": " but we find that the promise would be oft repeated"
    },
    {
      "id": 126,
      "start": 1619.0399780273438,
      "end": 1622.47998046875,
      "text": " throughout the Pentateuch and even into the book of Joshua."
    },
    {
      "id": 127,
      "start": 1622.47998046875,
      "end": 1624.0,
      "text": " And as you continue through the Scriptures,"
    },
    {
      "id": 128,
      "start": 1624.0,
      "end": 1628.7200012207031,
      "text": " you begin to understand this promise that has been given to Abram"
    },
    {
      "id": 129,
      "start": 1628.7200012207031,
      "end": 1630.3999938964844,
      "text": " and to his descendants, to his seed."
    },
    {
      "id": 130,
      "start": 1630.3999938964844,
      "end": 1631.8399963378906,
      "text": " He says, well, I give this land."
    },
    {
      "id": 131,
      "start": 1631.8399963378906,
      "end": 1635.1199951171875,
      "text": " Notice how Abram responded."
    },
    {
      "id": 132,
      "start": 1635.1199951171875,
      "end": 1637.7599792480469,
      "text": " We see how that Abram worshiped the Lord."
    },
    {
      "id": 133,
      "start": 1639.1199951171875,
      "end": 1641.1999816894531,
      "text": " Isn't that a natural response, by the way?"
    },
    {
      "id": 134,
      "start": 1641.6799926757812,
      "end": 1647.8399963378906,
      "text": " The Lord appeared unto Abram and said unto Abram,"
    },
    {
      "id": 135,
      "start": 1648.3999938964844,
      "end": 1650.47998046875,
      "text": " unto thy seed will I give this land."
    },
    {
      "id": 136,
      "start": 1651.0399780273438,
      "end": 1653.6799926757812,
      "text": " And the Bible tells us that in that place,"
    },
    {
      "id": 137,
      "start": 1654.5599975585938,
      "end": 1658.7999877929688,
      "text": " Abram built an altar unto the Lord who appeared unto him."
    },
    {
      "id": 138,
      "start": 1658.7999877929688,
      "end": 1661.2799987792969,
      "text": " The purpose of building an altar is to worship."
    },
    {
      "id": 139,
      "start": 1661.8399963378906,
      "end": 1662.3399963378906,
      "text": " Amen."
    },
    {
      "id": 140,
      "start": 1663.0399780273438,
      "end": 1666.3199768066406,
      "text": " And we find that Abram was a man that often would build an altar."
    },
    {
      "id": 141,
      "start": 1666.3199768066406,
      "end": 1668.7200012207031,
      "text": " In fact, in verse number eight, we'll read again"
    },
    {
      "id": 142,
      "start": 1668.7200012207031,
      "end": 1671.0399780273438,
      "text": " how he built an altar unto the Lord."
    },
    {
      "id": 143,
      "start": 1671.0399780273438,
      "end": 1672.9599914550781,
      "text": " And we can begin to understand"
    },
    {
      "id": 144,
      "start": 1672.9599914550781,
      "end": 1675.4400024414062,
      "text": " the way in which he would worship the Lord."
    },
    {
      "id": 145,
      "start": 1675.4400024414062,
      "end": 1677.5199890136719,
      "text": " And by the way, this evening,"
    },
    {
      "id": 146,
      "start": 1677.5199890136719,
      "end": 1680.3999938964844,
      "text": " we understand that our God is worthy of our worship."
    },
    {
      "id": 147,
      "start": 1681.5199890136719,
      "end": 1683.2799987792969,
      "text": " He alone is to be worshiped."
    },
    {
      "id": 148,
      "start": 1683.2799987792969,
      "end": 1684.1600036621094,
      "text": " Amen."
    },
    {
      "id": 149,
      "start": 1684.1600036621094,
      "end": 1686.6399841308594,
      "text": " And we find here that it says in verse number eight,"
    },
    {
      "id": 150,
      "start": 1686.6399841308594,
      "end": 1690.0,
      "text": " and he removed from thence unto a mountain on the east of Bethel"
    },
    {
      "id": 151,
      "start": 1690.0,
      "end": 1694.3199768066406,
      "text": " and pitched his tent, having Bethel on the west and Ai on the east."
    },
    {
      "id": 152,
      "start": 1694.3199768066406,
      "end": 1697.4400024414062,
      "text": " And so we find that as he begins to travel"
    },
    {
      "id": 153,
      "start": 1697.4400024414062,
      "end": 1700.239990234375,
      "text": " and remove from that place in which he found himself there"
    },
    {
      "id": 154,
      "start": 1700.239990234375,
      "end": 1702.239990234375,
      "text": " in Shechem in the plain of Morah,"
    },
    {
      "id": 155,
      "start": 1702.239990234375,
      "end": 1703.4400024414062,
      "text": " according to verse number six,"
    },
    {
      "id": 156,
      "start": 1703.4400024414062,
      "end": 1706.0,
      "text": " that they're going to continue to travel."
    },
    {
      "id": 157,
      "start": 1706.0,
      "end": 1708.7200012207031,
      "text": " And the Bible tells us that now he comes to this place"
    },
    {
      "id": 158,
      "start": 1708.7200012207031,
      "end": 1712.239990234375,
      "text": " where he has Bethel on the west and Ai on the east."
    },
    {
      "id": 159,
      "start": 1712.239990234375,
      "end": 1716.8800048828125,
      "text": " And the Bible tells us there that he built an altar unto the Lord."
    },
    {
      "id": 160,
      "start": 1718.0800170898438,
      "end": 1722.239990234375,
      "text": " And notice this phrase and the significance of this phrase,"
    },
    {
      "id": 161,
      "start": 1722.239990234375,
      "end": 1726.0800170898438,
      "text": " and called upon the name of the Lord."
    },
    {
      "id": 162,
      "start": 1726.3999633789062,
      "end": 1729.5999755859375,
      "text": " See, often we begin to see throughout the scriptures"
    },
    {
      "id": 163,
      "start": 1729.5999755859375,
      "end": 1733.0399780273438,
      "text": " how that the people of God would worship the Lord"
    },
    {
      "id": 164,
      "start": 1733.0399780273438,
      "end": 1736.1599731445312,
      "text": " and how that he is worthy of our worship."
    },
    {
      "id": 165,
      "start": 1736.1599731445312,
      "end": 1739.6799926757812,
      "text": " And what a blessing it is for us to understand"
    },
    {
      "id": 166,
      "start": 1739.6799926757812,
      "end": 1743.8399658203125,
      "text": " how that Abraham, as he's here in Genesis chapter number 12,"
    },
    {
      "id": 167,
      "start": 1743.8399658203125,
      "end": 1746.0,
      "text": " as he's received this instruction,"
    },
    {
      "id": 168,
      "start": 1746.0,
      "end": 1749.1199951171875,
      "text": " as he's heard the promises rehearsed,"
    },
    {
      "id": 169,
      "start": 1749.1199951171875,
      "end": 1753.5999755859375,
      "text": " and we now have the opportunity to see the record of his obedience."
    },
    {
      "id": 170,
      "start": 1754.5599975585938,
      "end": 1757.760009765625,
      "text": " And as we read of the record of his obedience,"
    },
    {
      "id": 171,
      "start": 1757.760009765625,
      "end": 1760.47998046875,
      "text": " we are told here that Abraham"
    },
    {
      "id": 172,
      "start": 1760.47998046875,
      "end": 1764.1599731445312,
      "text": " not only had gone into the place where God told him to go,"
    },
    {
      "id": 173,
      "start": 1764.1599731445312,
      "end": 1766.6400146484375,
      "text": " but we find that he's worshiping the Lord."
    },
    {
      "id": 174,
      "start": 1767.8399658203125,
      "end": 1771.2799682617188,
      "text": " John 4 talks about the truth that they that worship him"
    },
    {
      "id": 175,
      "start": 1771.2799682617188,
      "end": 1774.719970703125,
      "text": " must worship him in spirit and in truth."
    },
    {
      "id": 176,
      "start": 1775.3599853515625,
      "end": 1777.52001953125,
      "text": " It's interesting at the end of the book of Matthew,"
    },
    {
      "id": 177,
      "start": 1777.52001953125,
      "end": 1781.0399780273438,
      "text": " if you turn over there, if you will, to Matthew chapter number 28."
    },
    {
      "id": 178,
      "start": 1781.0399780273438,
      "end": 1785.8399658203125,
      "text": " And I want you to see after the resurrection of our Lord and Savior, Jesus Christ."
    },
    {
      "id": 179,
      "start": 1786.5599975585938,
      "end": 1789.760009765625,
      "text": " And we understand that they went there early to the tomb."
    },
    {
      "id": 180,
      "start": 1789.760009765625,
      "end": 1794.1599731445312,
      "text": " Remember, they found it empty because he had risen from the dead, as he said."
    },
    {
      "id": 181,
      "start": 1794.1599731445312,
      "end": 1796.9599609375,
      "text": " And what a glorious morning that was."
    },
    {
      "id": 182,
      "start": 1796.9599609375,
      "end": 1800.6400146484375,
      "text": " But we come to Matthew chapter 28 and verse number 17."
    },
    {
      "id": 0,
      "start": 1800.6400146484375,
      "end": 1807.6400146484375,
      "text": " And when they saw Him, they worshiped Him."
    },
    {
      "id": 1,
      "start": 1807.6400146484375,
      "end": 1811.6400146484375,
      "text": " Today, our God is worthy of worship."
    },
    {
      "id": 2,
      "start": 1811.6400146484375,
      "end": 1815.6400146484375,
      "text": " They that worship Him, to repeat what I said a moment ago from John 4,"
    },
    {
      "id": 3,
      "start": 1815.6400146484375,
      "end": 1818.6400146484375,
      "text": " they that worship Him must worship Him in spirit and in truth."
    },
    {
      "id": 4,
      "start": 1818.6400146484375,
      "end": 1823.6400146484375,
      "text": " By the way, not all that is called worship is worship."
    },
    {
      "id": 5,
      "start": 1823.6400146484375,
      "end": 1826.6400146484375,
      "text": " God defines what worship is. Amen?"
    },
    {
      "id": 6,
      "start": 1826.6400146484375,
      "end": 1830.6400146484375,
      "text": " And we're to worship God on His terms, not on man's terms."
    },
    {
      "id": 7,
      "start": 1830.6400146484375,
      "end": 1834.6400146484375,
      "text": " And we find that the Scriptures are full of truth"
    },
    {
      "id": 8,
      "start": 1834.6400146484375,
      "end": 1840.6400146484375,
      "text": " with regard to how we as the people of God are to worship the Lord."
    },
    {
      "id": 9,
      "start": 1840.6400146484375,
      "end": 1842.6400146484375,
      "text": " We see there at the end of verse number 8"
    },
    {
      "id": 10,
      "start": 1842.6400146484375,
      "end": 1846.6400146484375,
      "text": " that not only did Abraham build another altar unto the Lord,"
    },
    {
      "id": 11,
      "start": 1846.6400146484375,
      "end": 1848.6400146484375,
      "text": " but he called upon the name of the Lord."
    },
    {
      "id": 12,
      "start": 1848.6400146484375,
      "end": 1851.6400146484375,
      "text": " Again, often as we study through the life of Abraham"
    },
    {
      "id": 13,
      "start": 1851.6400146484375,
      "end": 1853.6400146484375,
      "text": " over these next several chapters,"
    },
    {
      "id": 14,
      "start": 1853.6400146484375,
      "end": 1857.6400146484375,
      "text": " you'll have the opportunity to see the faith and obedience of Abraham"
    },
    {
      "id": 15,
      "start": 1857.6400146484375,
      "end": 1862.6400146484375,
      "text": " and to see his worship of God and what a blessing that is."
    },
    {
      "id": 16,
      "start": 1862.6400146484375,
      "end": 1864.6400146484375,
      "text": " We find as we conclude in verse number 9,"
    },
    {
      "id": 17,
      "start": 1864.6400146484375,
      "end": 1868.6400146484375,
      "text": " and we'll get into the latter part of Genesis 12 next Sunday evening,"
    },
    {
      "id": 18,
      "start": 1868.6400146484375,
      "end": 1870.6400146484375,
      "text": " but I want you to see that the Bible says,"
    },
    {
      "id": 19,
      "start": 1870.6400146484375,
      "end": 1875.6400146484375,
      "text": " And Abram journeyed going on still toward the south."
    },
    {
      "id": 20,
      "start": 1875.6400146484375,
      "end": 1878.6400146484375,
      "text": " I want you to consider as Abram would journey"
    },
    {
      "id": 21,
      "start": 1878.6400146484375,
      "end": 1882.6400146484375,
      "text": " and as the Scriptures tell us that he continued on still toward the south,"
    },
    {
      "id": 22,
      "start": 1882.6400146484375,
      "end": 1889.6400146484375,
      "text": " that Abram had the opportunity to see this land that God had promised to his seed."
    },
    {
      "id": 23,
      "start": 1889.6400146484375,
      "end": 1892.6400146484375,
      "text": " We find that as they would journey and as they would travel,"
    },
    {
      "id": 24,
      "start": 1892.6400146484375,
      "end": 1894.6400146484375,
      "text": " they have this group of people."
    },
    {
      "id": 25,
      "start": 1894.6400146484375,
      "end": 1897.6400146484375,
      "text": " And we know that at this particular time that Abram and Sarai,"
    },
    {
      "id": 26,
      "start": 1897.6400146484375,
      "end": 1901.6400146484375,
      "text": " they have no children, they've not yet had Isaac."
    },
    {
      "id": 27,
      "start": 1901.6400146484375,
      "end": 1904.6400146484375,
      "text": " We know that there in chapter number 11 and verse number 30,"
    },
    {
      "id": 28,
      "start": 1904.6400146484375,
      "end": 1909.6400146484375,
      "text": " the Bible told us that Sarai was barren and she had no child."
    },
    {
      "id": 29,
      "start": 1909.6400146484375,
      "end": 1913.6400146484375,
      "text": " The significance of that truth and the importance of understanding"
    },
    {
      "id": 30,
      "start": 1913.6400146484375,
      "end": 1916.6400146484375,
      "text": " the promise that God would give with regard to a seed,"
    },
    {
      "id": 31,
      "start": 1916.6400146484375,
      "end": 1919.6400146484375,
      "text": " and even as we read it here in Genesis chapter number 12,"
    },
    {
      "id": 32,
      "start": 1919.6400146484375,
      "end": 1921.6400146484375,
      "text": " and we go through the next several chapters"
    },
    {
      "id": 33,
      "start": 1921.6400146484375,
      "end": 1927.6400146484375,
      "text": " and we see how that God would provide and bless and what He would do."
    },
    {
      "id": 34,
      "start": 1927.6400146484375,
      "end": 1932.6400146484375,
      "text": " And Abram is now at the place where God has directed him to go."
    },
    {
      "id": 35,
      "start": 1932.6400146484375,
      "end": 1935.6400146484375,
      "text": " We find that even in that place there would be trouble."
    },
    {
      "id": 36,
      "start": 1935.6400146484375,
      "end": 1940.6400146484375,
      "text": " The very next verse of Scripture tells us that there was a famine in the land."
    },
    {
      "id": 37,
      "start": 1940.6400146484375,
      "end": 1943.6400146484375,
      "text": " It will be the subject matter in which we discuss next Sunday evening"
    },
    {
      "id": 38,
      "start": 1943.6400146484375,
      "end": 1945.6400146484375,
      "text": " in understanding what happens."
    },
    {
      "id": 39,
      "start": 1945.6400146484375,
      "end": 1948.6400146484375,
      "text": " I want you to realize this evening that Abram,"
    },
    {
      "id": 40,
      "start": 1948.6400146484375,
      "end": 1952.6400146484375,
      "text": " though there are many things that we can look at in the life of Abram"
    },
    {
      "id": 41,
      "start": 1952.6400146484375,
      "end": 1957.6400146484375,
      "text": " and we can look at as being exemplary and certainly noteworthy,"
    },
    {
      "id": 42,
      "start": 1957.6400146484375,
      "end": 1960.6400146484375,
      "text": " that he is not a perfect man."
    },
    {
      "id": 43,
      "start": 1960.6400146484375,
      "end": 1963.6400146484375,
      "text": " Only the Lord Jesus Christ is the perfect example."
    },
    {
      "id": 44,
      "start": 1963.6400146484375,
      "end": 1966.6400146484375,
      "text": " But no doubt as we begin to look at the life of Abram"
    },
    {
      "id": 45,
      "start": 1966.6400146484375,
      "end": 1969.6400146484375,
      "text": " and see this text of Scripture in Genesis chapter number 12,"
    },
    {
      "id": 46,
      "start": 1969.6400146484375,
      "end": 1973.6400146484375,
      "text": " how we ought to be impacted as we think about"
    },
    {
      "id": 47,
      "start": 1973.6400146484375,
      "end": 1977.6400146484375,
      "text": " and consider the faith and obedience of this man."
    },
    {
      "id": 48,
      "start": 1977.6400146484375,
      "end": 1979.6400146484375,
      "text": " Notice what the writer of Hebrews says."
    },
    {
      "id": 49,
      "start": 1979.6400146484375,
      "end": 1981.6400146484375,
      "text": " Turn to Hebrews 11 if you will,"
    },
    {
      "id": 50,
      "start": 1981.6400146484375,
      "end": 1984.6400146484375,
      "text": " and we'll conclude with this passage of Scripture this evening"
    },
    {
      "id": 51,
      "start": 1984.6400146484375,
      "end": 1986.6400146484375,
      "text": " in Hebrews chapter number 11."
    },
    {
      "id": 52,
      "start": 1986.6400146484375,
      "end": 1991.6400146484375,
      "text": " I want you to notice what the Word of God says."
    },
    {
      "id": 53,
      "start": 1991.6400146484375,
      "end": 1994.6400146484375,
      "text": " In verse number 8 of Hebrews 11, the Bible says,"
    },
    {
      "id": 54,
      "start": 1994.6400146484375,
      "end": 2000.6400146484375,
      "text": " By faith Abraham, when he was called to go out into a place"
    },
    {
      "id": 55,
      "start": 2000.6400146484375,
      "end": 2004.6400146484375,
      "text": " which he should after receive for an inheritance,"
    },
    {
      "id": 56,
      "start": 2004.6400146484375,
      "end": 2006.6400146484375,
      "text": " what's it say?"
    },
    {
      "id": 57,
      "start": 2006.6400146484375,
      "end": 2008.6400146484375,
      "text": " Obeyed."
    },
    {
      "id": 58,
      "start": 2008.6400146484375,
      "end": 2013.6400146484375,
      "text": " And he went out not knowing whither he went."
    },
    {
      "id": 59,
      "start": 2013.6400146484375,
      "end": 2015.6400146484375,
      "text": " He didn't know exactly where he was going."
    },
    {
      "id": 60,
      "start": 2015.6400146484375,
      "end": 2017.6400146484375,
      "text": " He was just following God. Amen?"
    },
    {
      "id": 61,
      "start": 2017.6400146484375,
      "end": 2018.6400146484375,
      "text": " He got to Haran."
    },
    {
      "id": 62,
      "start": 2018.6400146484375,
      "end": 2022.6400146484375,
      "text": " Haran wasn't the final destination."
    },
    {
      "id": 63,
      "start": 2022.6400146484375,
      "end": 2024.6400146484375,
      "text": " That was a place in which they dwelt"
    },
    {
      "id": 64,
      "start": 2024.6400146484375,
      "end": 2026.6400146484375,
      "text": " and it was a place in which they stayed for a period of time."
    },
    {
      "id": 65,
      "start": 2026.6400146484375,
      "end": 2029.6400146484375,
      "text": " But when Terah died, God said this isn't the final place."
    },
    {
      "id": 66,
      "start": 2029.6400146484375,
      "end": 2031.6400146484375,
      "text": " You need to continue journeying."
    },
    {
      "id": 67,
      "start": 2031.6400146484375,
      "end": 2034.6400146484375,
      "text": " And we find the Bible says that he obeyed"
    },
    {
      "id": 68,
      "start": 2034.6400146484375,
      "end": 2036.6400146484375,
      "text": " and that he went out not knowing whither he went."
    },
    {
      "id": 69,
      "start": 2036.6400146484375,
      "end": 2039.6400146484375,
      "text": " By faith, notice verse number 9 of Hebrews 11,"
    },
    {
      "id": 70,
      "start": 2039.6400146484375,
      "end": 2043.6400146484375,
      "text": " he sojourned in the land of promise."
    },
    {
      "id": 71,
      "start": 2043.6400146484375,
      "end": 2046.6400146484375,
      "text": " I think we see that a little bit in verse number 9"
    },
    {
      "id": 72,
      "start": 2046.6400146484375,
      "end": 2048.6400146484375,
      "text": " in Genesis 12 where he continued traveling"
    },
    {
      "id": 73,
      "start": 2048.6400146484375,
      "end": 2050.6400146484375,
      "text": " still towards the south."
    },
    {
      "id": 74,
      "start": 2050.6400146484375,
      "end": 2052.6400146484375,
      "text": " He sojourned in the land of promise"
    },
    {
      "id": 75,
      "start": 2052.6400146484375,
      "end": 2055.6400146484375,
      "text": " as in a strange country dwelling in tabernacles"
    },
    {
      "id": 76,
      "start": 2055.6400146484375,
      "end": 2058.6400146484375,
      "text": " with Isaac and Jacob, the heirs with him"
    },
    {
      "id": 77,
      "start": 2058.6400146484375,
      "end": 2060.6400146484375,
      "text": " of the same promise."
    },
    {
      "id": 78,
      "start": 2060.6400146484375,
      "end": 2062.6400146484375,
      "text": " You think about how the lens of Scripture"
    },
    {
      "id": 79,
      "start": 2062.6400146484375,
      "end": 2065.6400146484375,
      "text": " looks down future speaking of Isaac and Jacob"
    },
    {
      "id": 80,
      "start": 2065.6400146484375,
      "end": 2068.6400146484375,
      "text": " and how that would come to pass"
    },
    {
      "id": 81,
      "start": 2068.6400146484375,
      "end": 2071.6400146484375,
      "text": " and they would live in that land."
    },
    {
      "id": 82,
      "start": 2071.6400146484375,
      "end": 2074.6400146484375,
      "text": " For he looked for a city which hath foundations,"
    },
    {
      "id": 83,
      "start": 2074.6400146484375,
      "end": 2077.6400146484375,
      "text": " whose builder and maker is God."
    },
    {
      "id": 84,
      "start": 2077.6400146484375,
      "end": 2079.6400146484375,
      "text": " There are more things that are said"
    },
    {
      "id": 85,
      "start": 2079.6400146484375,
      "end": 2082.6400146484375,
      "text": " about Abraham and Sarah here in the passage of Scripture"
    },
    {
      "id": 86,
      "start": 2082.6400146484375,
      "end": 2085.6400146484375,
      "text": " in Hebrews 11, but I want you to just notice"
    },
    {
      "id": 87,
      "start": 2085.6400146484375,
      "end": 2088.6400146484375,
      "text": " and consider this evening the faith and obedience."
    },
    {
      "id": 88,
      "start": 2088.6400146484375,
      "end": 2091.6400146484375,
      "text": " So Abram departed."
    },
    {
      "id": 89,
      "start": 2091.6400146484375,
      "end": 2095.6400146484375,
      "text": " See, when the Lord speaks in this evening,"
    },
    {
      "id": 90,
      "start": 2095.6400146484375,
      "end": 2099.6400146484375,
      "text": " we know that he's given us a perfect book,"
    },
    {
      "id": 91,
      "start": 2099.6400146484375,
      "end": 2101.6400146484375,
      "text": " a complete canon of Scripture."
    },
    {
      "id": 92,
      "start": 2101.6400146484375,
      "end": 2103.6400146484375,
      "text": " Sixty-six books."
    },
    {
      "id": 93,
      "start": 2103.6400146484375,
      "end": 2105.6400146484375,
      "text": " Precious Bible."
    },
    {
      "id": 94,
      "start": 2105.6400146484375,
      "end": 2107.6400146484375,
      "text": " It's profitable."
    },
    {
      "id": 95,
      "start": 2107.6400146484375,
      "end": 2109.6400146484375,
      "text": " And God speaks to us through His Word."
    },
    {
      "id": 96,
      "start": 2109.6400146484375,
      "end": 2110.6400146484375,
      "text": " Amen?"
    },
    {
      "id": 97,
      "start": 2110.6400146484375,
      "end": 2113.6400146484375,
      "text": " God gives us direction in His Word."
    },
    {
      "id": 98,
      "start": 2113.6400146484375,
      "end": 2116.6400146484375,
      "text": " He provides us with the direction that we need."
    },
    {
      "id": 99,
      "start": 2116.6400146484375,
      "end": 2121.6400146484375,
      "text": " And it is vital that we as the people of God,"
    },
    {
      "id": 100,
      "start": 2121.6400146484375,
      "end": 2123.6400146484375,
      "text": " that we simply trust Him,"
    },
    {
      "id": 101,
      "start": 2123.6400146484375,
      "end": 2126.6400146484375,
      "text": " that in faith and obedience we respond"
    },
    {
      "id": 102,
      "start": 2126.6400146484375,
      "end": 2128.6400146484375,
      "text": " to the voice of God."
    },
    {
      "id": 103,
      "start": 2128.6400146484375,
      "end": 2131.6400146484375,
      "text": " Abraham had a different experience than we did"
    },
    {
      "id": 104,
      "start": 2131.6400146484375,
      "end": 2133.6400146484375,
      "text": " in the fact that the Lord appeared to him"
    },
    {
      "id": 105,
      "start": 2133.6400146484375,
      "end": 2135.6400146484375,
      "text": " and spoke to him audibly,"
    },
    {
      "id": 106,
      "start": 2135.6400146484375,
      "end": 2137.6400146484375,
      "text": " but we have the written Word of God."
    },
    {
      "id": 107,
      "start": 2137.6400146484375,
      "end": 2140.6400146484375,
      "text": " What a joy to be able to go to the Word of God"
    },
    {
      "id": 108,
      "start": 2140.6400146484375,
      "end": 2144.6400146484375,
      "text": " and feast upon what thus saith the Lord."
    },
    {
      "id": 109,
      "start": 2144.6400146484375,
      "end": 2146.6400146484375,
      "text": " And we can go to the Scriptures"
    },
    {
      "id": 110,
      "start": 2146.6400146484375,
      "end": 2149.6400146484375,
      "text": " every day of our lives and receive the direction"
    },
    {
      "id": 111,
      "start": 2149.6400146484375,
      "end": 2151.6400146484375,
      "text": " that God has for us."
    },
    {
      "id": 112,
      "start": 2151.6400146484375,
      "end": 2154.6400146484375,
      "text": " The question is what do we do with it?"
    },
    {
      "id": 113,
      "start": 2154.6400146484375,
      "end": 2156.6400146484375,
      "text": " So Abram departed."
    },
    {
      "id": 114,
      "start": 2156.6400146484375,
      "end": 2157.6400146484375,
      "text": " He heard the direction of God."
    },
    {
      "id": 115,
      "start": 2157.6400146484375,
      "end": 2160.6400146484375,
      "text": " He heard the instruction and received it."
    },
    {
      "id": 116,
      "start": 2160.6400146484375,
      "end": 2162.6400146484375,
      "text": " And he responded in obedience."
    },
    {
      "id": 117,
      "start": 2162.6400146484375,
      "end": 2164.6400146484375,
      "text": " And what a blessing."
    },
    {
      "id": 118,
      "start": 2164.6400146484375,
      "end": 2166.6400146484375,
      "text": " See, this morning we made note of the way"
    },
    {
      "id": 119,
      "start": 2166.6400146484375,
      "end": 2169.6400146484375,
      "text": " in which God has made a new and living way,"
    },
    {
      "id": 120,
      "start": 2169.6400146484375,
      "end": 2171.6400146484375,
      "text": " the access that is available,"
    },
    {
      "id": 121,
      "start": 2171.6400146484375,
      "end": 2175.6400146484375,
      "text": " and how silly it would be for us to know"
    },
    {
      "id": 122,
      "start": 2175.6400146484375,
      "end": 2177.6400146484375,
      "text": " that we have access,"
    },
    {
      "id": 123,
      "start": 2177.6400146484375,
      "end": 2180.6400146484375,
      "text": " but yet decide not to enter in."
    },
    {
      "id": 124,
      "start": 2180.6400146484375,
      "end": 2181.6400146484375,
      "text": " Right?"
    },
    {
      "id": 125,
      "start": 2181.6400146484375,
      "end": 2182.6400146484375,
      "text": " Let us draw near."
    },
    {
      "id": 126,
      "start": 2182.6400146484375,
      "end": 2184.6400146484375,
      "text": " Since we have access, we draw near."
    },
    {
      "id": 127,
      "start": 2184.6400146484375,
      "end": 2186.6400146484375,
      "text": " And so Abram receives the direction,"
    },
    {
      "id": 128,
      "start": 2186.6400146484375,
      "end": 2189.6400146484375,
      "text": " the instruction from God Almighty."
    },
    {
      "id": 129,
      "start": 2189.6400146484375,
      "end": 2192.6400146484375,
      "text": " How silly to not obey."
    },
    {
      "id": 130,
      "start": 2192.6400146484375,
      "end": 2195.6400146484375,
      "text": " But we say the same things to ourselves this evening."
    },
    {
      "id": 131,
      "start": 2195.6400146484375,
      "end": 2197.6400146484375,
      "text": " God gives us direction."
    },
    {
      "id": 132,
      "start": 2197.6400146484375,
      "end": 2199.6400146484375,
      "text": " God gives us instruction."
    },
    {
      "id": 133,
      "start": 2199.6400146484375,
      "end": 2202.6400146484375,
      "text": " And yet we find that there's this constant struggle"
    },
    {
      "id": 134,
      "start": 2202.6400146484375,
      "end": 2204.6400146484375,
      "text": " that we have as human beings"
    },
    {
      "id": 135,
      "start": 2204.6400146484375,
      "end": 2206.6400146484375,
      "text": " to simply trust Him,"
    },
    {
      "id": 136,
      "start": 2206.6400146484375,
      "end": 2210.6400146484375,
      "text": " to simply obey Him and follow Him."
    },
    {
      "id": 137,
      "start": 2210.6400146484375,
      "end": 2212.6400146484375,
      "text": " We have so many influences in our lives"
    },
    {
      "id": 138,
      "start": 2212.6400146484375,
      "end": 2214.6400146484375,
      "text": " and so many things that are going on"
    },
    {
      "id": 139,
      "start": 2214.6400146484375,
      "end": 2215.6400146484375,
      "text": " and swirling around"
    },
    {
      "id": 140,
      "start": 2215.6400146484375,
      "end": 2218.6400146484375,
      "text": " that at times we struggle with the simple truth"
    },
    {
      "id": 141,
      "start": 2218.6400146484375,
      "end": 2220.6400146484375,
      "text": " of simply trusting,"
    },
    {
      "id": 142,
      "start": 2220.6400146484375,
      "end": 2222.6400146484375,
      "text": " just taking God at His word."
    },
    {
      "id": 143,
      "start": 2222.6400146484375,
      "end": 2225.6400146484375,
      "text": " I'm so thankful this evening that Abram departed."
    },
    {
      "id": 144,
      "start": 2225.6400146484375,
      "end": 2227.6400146484375,
      "text": " I'm thankful this evening that we have the opportunity"
    },
    {
      "id": 145,
      "start": 2227.6400146484375,
      "end": 2229.6400146484375,
      "text": " to read of these promises,"
    },
    {
      "id": 146,
      "start": 2229.6400146484375,
      "end": 2232.6400146484375,
      "text": " often we refer to as the Abrahamic Covenant,"
    },
    {
      "id": 147,
      "start": 2232.6400146484375,
      "end": 2235.6400146484375,
      "text": " and begin to see how the lens of Scripture"
    },
    {
      "id": 148,
      "start": 2235.6400146484375,
      "end": 2237.6400146484375,
      "text": " will focus upon Abram and his descendants,"
    },
    {
      "id": 149,
      "start": 2237.6400146484375,
      "end": 2241.6400146484375,
      "text": " of course leading us to Messiah Himself."
    },
    {
      "id": 150,
      "start": 2241.6400146484375,
      "end": 2244.6400146484375,
      "text": " I'm so thankful for the blessings"
    },
    {
      "id": 151,
      "start": 2244.6400146484375,
      "end": 2246.6400146484375,
      "text": " that we have received"
    },
    {
      "id": 152,
      "start": 2246.6400146484375,
      "end": 2248.6400146484375,
      "text": " and that we, as we look at Galatians 3,"
    },
    {
      "id": 153,
      "start": 2248.6400146484375,
      "end": 2250.6400146484375,
      "text": " that we have received that promise,"
    },
    {
      "id": 154,
      "start": 2250.6400146484375,
      "end": 2252.6400146484375,
      "text": " that blessing,"
    },
    {
      "id": 155,
      "start": 2252.6400146484375,
      "end": 2254.6400146484375,
      "text": " through who? Through Jesus Christ."
    },
    {
      "id": 156,
      "start": 2254.6400146484375,
      "end": 2258.6400146484375,
      "text": " And this evening, if you've trusted Christ as your Savior,"
    },
    {
      "id": 157,
      "start": 2258.6400146484375,
      "end": 2261.6400146484375,
      "text": " as we see in Galatians 3,"
    },
    {
      "id": 158,
      "start": 2261.6400146484375,
      "end": 2263.6400146484375,
      "text": " He says this truth,"
    },
    {
      "id": 159,
      "start": 2263.6400146484375,
      "end": 2264.6400146484375,
      "text": " and I don't want to misquote it,"
    },
    {
      "id": 160,
      "start": 2264.6400146484375,
      "end": 2266.6400146484375,
      "text": " so let me just turn there real quick."
    },
    {
      "id": 161,
      "start": 2266.6400146484375,
      "end": 2268.6400146484375,
      "text": " In Galatians 3, you don't need to turn there,"
    },
    {
      "id": 162,
      "start": 2268.6400146484375,
      "end": 2270.6400146484375,
      "text": " but He says that,"
    },
    {
      "id": 163,
      "start": 2270.6400146484375,
      "end": 2272.6400146484375,
      "text": " Know ye therefore that they which are of faith,"
    },
    {
      "id": 164,
      "start": 2272.6400146484375,
      "end": 2276.6400146484375,
      "text": " the same are the children of Abraham."
    },
    {
      "id": 165,
      "start": 2276.6400146484375,
      "end": 2278.6400146484375,
      "text": " I'm not a child of Abraham"
    },
    {
      "id": 166,
      "start": 2278.6400146484375,
      "end": 2282.6400146484375,
      "text": " because of my lineage bloodline being Jewish,"
    },
    {
      "id": 167,
      "start": 2282.6400146484375,
      "end": 2287.6400146484375,
      "text": " but I am part of that being a child of Abraham"
    },
    {
      "id": 168,
      "start": 2287.6400146484375,
      "end": 2289.6400146484375,
      "text": " through faith, which are of faith."
    },
    {
      "id": 169,
      "start": 2289.6400146484375,
      "end": 2292.6400146484375,
      "text": " And what a blessing to understand"
    },
    {
      "id": 170,
      "start": 2292.6400146484375,
      "end": 2295.6400146484375,
      "text": " that seed that was promised. Amen?"
    },
    {
      "id": 171,
      "start": 2295.6400146484375,
      "end": 2297.6400146484375,
      "text": " So Abram departed."
    },
    {
      "id": 172,
      "start": 2297.6400146484375,
      "end": 2299.6400146484375,
      "text": " Oh, that God would help us obey Him."
    },
    {
      "id": 173,
      "start": 2299.6400146484375,
      "end": 2301.6400146484375,
      "text": " We love You. We thank You for loving us."
    },
    {
      "id": 174,
      "start": 2301.6400146484375,
      "end": 2303.6400146484375,
      "text": " We thank You for the opportunity"
    },
    {
      "id": 175,
      "start": 2303.6400146484375,
      "end": 2305.6400146484375,
      "text": " to have Your Word."
    },
    {
      "id": 176,
      "start": 2305.6400146484375,
      "end": 2308.6400146484375,
      "text": " Thank You for giving us the complete canon of Scripture"
    },
    {
      "id": 177,
      "start": 2308.6400146484375,
      "end": 2310.6400146484375,
      "text": " and for the opportunity this evening"
    },
    {
      "id": 178,
      "start": 2310.6400146484375,
      "end": 2313.6400146484375,
      "text": " to see how that Your servant, Abraham,"
    },
    {
      "id": 179,
      "start": 2313.6400146484375,
      "end": 2315.6400146484375,
      "text": " how he obeyed You."
    },
    {
      "id": 180,
      "start": 2315.6400146484375,
      "end": 2317.6400146484375,
      "text": " Thank You for the promises that You gave him."
    },
    {
      "id": 181,
      "start": 2317.6400146484375,
      "end": 2319.6400146484375,
      "text": " Thank You for how You blessed him."
    },
    {
      "id": 182,
      "start": 2319.6400146484375,
      "end": 2321.6400146484375,
      "text": " I thank You for his perspective"
    },
    {
      "id": 183,
      "start": 2321.6400146484375,
      "end": 2324.6400146484375,
      "text": " of his blessing, understanding"
    },
    {
      "id": 184,
      "start": 2324.6400146484375,
      "end": 2327.6400146484375,
      "text": " that God, it was Your hand of blessing upon him."
    },
    {
      "id": 185,
      "start": 2327.6400146484375,
      "end": 2331.6400146484375,
      "text": " We see that even through the testimony of his servant"
    },
    {
      "id": 186,
      "start": 2331.6400146484375,
      "end": 2334.6400146484375,
      "text": " when he mentions about how the Lord"
    },
    {
      "id": 187,
      "start": 2334.6400146484375,
      "end": 2337.6400146484375,
      "text": " hath greatly blessed His Master."
    },
    {
      "id": 188,
      "start": 2337.6400146484375,
      "end": 2339.6400146484375,
      "text": " God, this evening I believe that"
    },
    {
      "id": 189,
      "start": 2339.6400146484375,
      "end": 2341.6400146484375,
      "text": " each of us could stand and testify"
    },
    {
      "id": 190,
      "start": 2341.6400146484375,
      "end": 2343.6400146484375,
      "text": " of Your goodness in our lives."
    },
    {
      "id": 191,
      "start": 2343.6400146484375,
      "end": 2345.6400146484375,
      "text": " I pray that we'd never be in a place,"
    },
    {
      "id": 192,
      "start": 2345.6400146484375,
      "end": 2347.6400146484375,
      "text": " a position of being deceived"
    },
    {
      "id": 193,
      "start": 2347.6400146484375,
      "end": 2349.6400146484375,
      "text": " and thinking that somehow"
    },
    {
      "id": 194,
      "start": 2349.6400146484375,
      "end": 2351.6400146484375,
      "text": " we have gotten these things"
    },
    {
      "id": 195,
      "start": 2351.6400146484375,
      "end": 2353.6400146484375,
      "text": " or added these things to ourselves."
    },
    {
      "id": 196,
      "start": 2353.6400146484375,
      "end": 2355.6400146484375,
      "text": " But God, that we would be mindful"
    },
    {
      "id": 197,
      "start": 2355.6400146484375,
      "end": 2357.6400146484375,
      "text": " of Your good hand of blessing."
    },
    {
      "id": 198,
      "start": 2357.6400146484375,
      "end": 2359.6400146484375,
      "text": " Father, I pray"
    },
    {
      "id": 199,
      "start": 2359.6400146484375,
      "end": 2361.6400146484375,
      "text": " that as we have rejoiced"
    },
    {
      "id": 200,
      "start": 2361.6400146484375,
      "end": 2364.6400146484375,
      "text": " to see the obedience and faith of Abraham,"
    },
    {
      "id": 201,
      "start": 2364.6400146484375,
      "end": 2366.6400146484375,
      "text": " how that he departed and followed,"
    },
    {
      "id": 202,
      "start": 2366.6400146484375,
      "end": 2368.6400146484375,
      "text": " that we would be challenged this evening"
    },
    {
      "id": 203,
      "start": 2368.6400146484375,
      "end": 2371.6400146484375,
      "text": " to be obedient to Thy Word."
    },
    {
      "id": 204,
      "start": 2371.6400146484375,
      "end": 2373.6400146484375,
      "text": " That God, we would simply trust You."
    },
    {
      "id": 205,
      "start": 2373.6400146484375,
      "end": 2375.6400146484375,
      "text": " That we would rest in You."
    },
    {
      "id": 206,
      "start": 2375.6400146484375,
      "end": 2377.6400146484375,
      "text": " That You would give us that peace"
    },
    {
      "id": 207,
      "start": 2377.6400146484375,
      "end": 2379.6400146484375,
      "text": " that passeth all understanding"
    },
    {
      "id": 208,
      "start": 2379.6400146484375,
      "end": 2381.6400146484375,
      "text": " as we trust You and follow You."
    },
    {
      "id": 209,
      "start": 2381.6400146484375,
      "end": 2383.6400146484375,
      "text": " I pray God that You would use us"
    },
    {
      "id": 210,
      "start": 2383.6400146484375,
      "end": 2385.6400146484375,
      "text": " in our community, in our society."
    },
    {
      "id": 211,
      "start": 2385.6400146484375,
      "end": 2387.6400146484375,
      "text": " I pray, Father, that You would be"
    },
    {
      "id": 212,
      "start": 2387.6400146484375,
      "end": 2389.6400146484375,
      "text": " glorified in our lives."
    },
    {
      "id": 213,
      "start": 2389.6400146484375,
      "end": 2392.6400146484375,
      "text": " Help us to worship You as we should."
    },
    {
      "id": 214,
      "start": 2392.6400146484375,
      "end": 2395.6400146484375,
      "text": " We see how that Abraham,"
    },
    {
      "id": 215,
      "start": 2395.6400146484375,
      "end": 2397.6400146484375,
      "text": " how he built these altars"
    },
    {
      "id": 216,
      "start": 2397.6400146484375,
      "end": 2399.6400146484375,
      "text": " and he worshipped and he called"
    },
    {
      "id": 217,
      "start": 2399.6400146484375,
      "end": 2401.6400146484375,
      "text": " upon the name of the Lord."
    },
    {
      "id": 0,
      "start": 2401.6400146484375,
      "end": 2408.960014820099,
      "text": " God, help us to see you in all of your glory, high, holy, and lifted up."
    },
    {
      "id": 1,
      "start": 2408.960014820099,
      "end": 2414.080014228821,
      "text": " As we read of the disciples there in Matthew 28, that they saw him and they worshipped"
    },
    {
      "id": 2,
      "start": 2414.080014228821,
      "end": 2415.080014228821,
      "text": " him."
    },
    {
      "id": 3,
      "start": 2415.080014228821,
      "end": 2420.840015411377,
      "text": " God, help us to worship you as we should, in spirit and in truth."
    },
    {
      "id": 4,
      "start": 2420.840015411377,
      "end": 2424.840015411377,
      "text": " I pray that you would guide and direct during this time of invitation if there's one that's"
    },
    {
      "id": 5,
      "start": 2424.840015411377,
      "end": 2430.520013809204,
      "text": " not sure of heaven, they've never received the gift of God, which is eternal life through"
    },
    {
      "id": 6,
      "start": 2430.520013809204,
      "end": 2432.8800144195557,
      "text": " Jesus Christ our Lord."
    },
    {
      "id": 7,
      "start": 2432.8800144195557,
      "end": 2437.000015258789,
      "text": " They've not yet received that promise that's been mentioned in Galatians 3, and they've"
    },
    {
      "id": 8,
      "start": 2437.000015258789,
      "end": 2441.5200157165527,
      "text": " not received that promise from Genesis 12 on how all the families of the earth would"
    },
    {
      "id": 9,
      "start": 2441.5200157165527,
      "end": 2445.2400131225586,
      "text": " be blessed through the seed through the Lord Jesus Christ."
    },
    {
      "id": 10,
      "start": 2445.2400131225586,
      "end": 2451.8000144958496,
      "text": " I pray that this evening they would understand that they're a sinner in need of a savior,"
    },
    {
      "id": 11,
      "start": 2451.8000144958496,
      "end": 2455.4000129699707,
      "text": " that Jesus Christ is the only savior, that he came to seek and to save that which was"
    },
    {
      "id": 12,
      "start": 2455.4000129699707,
      "end": 2456.4000129699707,
      "text": " lost."
    },
    {
      "id": 13,
      "start": 2457.0400161743164,
      "end": 2460.560012817383,
      "text": " I pray that the Holy Spirit of God would convict them of their sin, of Christ's righteousness,"
    },
    {
      "id": 14,
      "start": 2460.560012817383,
      "end": 2462.3600158691406,
      "text": " of judgment to come."
    },
    {
      "id": 15,
      "start": 2462.3600158691406,
      "end": 2468.3600158691406,
      "text": " They would not leave this place nor log off of the live stream without knowing for sure"
    },
    {
      "id": 16,
      "start": 2468.3600158691406,
      "end": 2471.0800170898438,
      "text": " that heaven is their home."
    },
    {
      "id": 17,
      "start": 2471.0800170898438,
      "end": 2474.3600158691406,
      "text": " I pray that you'd work as only you can and we'll give you the glory for all that you'll"
    },
    {
      "id": 18,
      "start": 2474.3600158691406,
      "end": 2475.3600158691406,
      "text": " do."
    },
    {
      "id": 19,
      "start": 2475.3600158691406,
      "end": 2476.3600158691406,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 20,
      "start": 2476.3600158691406,
      "end": 2476.8600158691406,
      "text": " Would you stand with me?"
    }
  ],
  "processed_at": "2025-04-17T14:35:20.433057"
}