{
  "video_id": "FZYKQS7fq1w",
  "text": "through 1st and 2nd Timothy on Sunday mornings. Our theme is continue, but for Mother's Day, we're gonna take a break from 1st and 2nd Timothy, head over here to 2 Kings chapter number four this morning. Mother's Day, of course, is a special day that is celebrated on this, the 2nd May annually here in the United States of America. Anna Jarvis is credited as celebrating the 1st Mother's Day, and that was back on May 10th, 1908. And prior to then, there were some times in which various pockets of populations in the United States would celebrate or acknowledge mothers on a special day. But really, she is credited with celebrating the 1st Mother's Day there on May 10th, 1908. It was about five years later, on May 10th, 1913, that the U.S. House of Representatives passed a resolution, and that resolution, they called for all federal employees, government officials, to wear a white carnation. And they made that decree, or that resolution, if you will, on May the 10th, 1913, and they said that they were to wear the white carnation on May 11th, 1913 in honor of Mother's Day. It was the following year, on May 8th, 1914. I give you all this information just to let you know the importance of it, but Congress passed a law designating the second Sunday of May would be Mother's Day. In that law, they also made a request for a proclamation, and the very next day, then President Woodrow Wilson issued a proclamation declaring the first national Mother's Day. And so that goes all the way back to 1914. Of course, this is 2024, so 110 years ago when it was made law. The decree, if you will, the proclamation by President Woodrow Wilson after the law passed Congress. Today, there are over 50 nations in the world that have a day in which they have on their calendars an observance, a special day for observing Mother's Day. It's not always on this same day that we celebrate here in the United States of America. There are a number of countries that do have their calendar mirrored to our calendar based on that proclamation, but there are many other nations that have some other time during the year. But I'm thankful this morning, early this morning, I sent my mom a text. Of course, not able to see her today. They're down in South Carolina. I sent her a card in the mail, and then I sent her a text this morning, let her know that I love her and appreciate her and all that she's done for me over the years. And I am thankful for Holly, and also let her know the appreciation that I have. I hope that you, if your mother is still alive, have had the opportunity to thank her today. And if not, if you would do that, many, no doubt, their mothers have passed on into eternity, and that makes for a difficult day. But the remembrance of all of those wonderful memories, we certainly can rejoice in that and thank God for the time that we're able to have. As we come to 2 Kings chapter number four, we're looking at the ministry of Elisha. The ministry of Elisha is an exciting ministry, one in which many of us are familiar with. And as you begin the fourth chapter of the book of 2 Kings, we find that God gives us in the first seven verses, it's not our text of scripture, but God provides for us the record of the miracle of the pot of oil. Remember the widow woman, she had a debt and her husband had died and she had two sons. And she went to the man of God, to Elisha. She said, he asked this question, what have you, what hast thou in the house? And she said, not anything in the house save a pot of oil. And God did a great miracle and they gathered up all the vessels and they filled from that pot of oil, every vessel they could possibly find. Elisha gave the instruction to sell, pay off the debt, live on the rest. What a wonderful miracle. As we come to verse number eight, the text of scripture in which we're looking at this morning we are introduced to a family, a husband and wife in the city of Shunem. We do not know the name of this woman. She simply introduced to us as a great woman. In fact, often as we look at this text of scripture in verses eight down through verse number 37, she is often simply referred to as the Shunemite woman. This morning, we'll take an opportunity to review her life as it's revealed in this passage of scripture. And I wanna note a number of characteristics about this lady that would give us reason as to why the Bible tells us that it was in this place where was a great woman. Notice with me in verse number eight, the Bible says, and it fell on a day that Elisha passed to Shunem where was a great woman and she constrained him to eat bread. And so it was that as off as he passed by, he turned in thither to eat bread. And she said unto her husband, behold now, I perceive that this is an holy man of God which passeth by us continually. And I praise God for her perception and her spirituality. The Bible says that she then makes this request to her husband, she says, let us make a little chamber. I pray thee on the wall and let us set for him there a bed and a table and a stool and a candlestick. And it shall be when he cometh to us that he shall turn in thither. At this point, they have no children. We'll go through the text of scripture and see the miraculous birth of their son. But I want you to skip down, if you will, to verse number 19. I'll give you the title for the message and we'll jump into the thoughts this morning. In verse 18, it says, and when the child was grown, it fell on a day that he went out to his father, to the reapers, and he said unto his father, my head, my head. And he said to Elad, notice this, carry him to his mother. And I've titled the message this morning, carry him to his mother. There's been many times in our lives when our children would get injured. I remember as a child, if I would get injured, it was always mom that provided more care and compassion than dad. If I was injured as a child and I went to my dad, he'd try to move the limb or move whatever and say, it's not broken, son. It moves just fine, just carry on, right? And mom was the one that you would go to to have compassion and some care and concern. And in our home, it's the same way. Oftentimes, I'll say, I'm not sure what to do about that. Go see mom. And here, this man says, carry him to his mother. As we think about this passage of scripture, we're gonna make our way through the entirety of it. I wanna give you six thoughts this morning, and I'm gonna be brief with each one. Don't get overwhelmed with having six thoughts this morning. But six thoughts this morning of characteristics of this lady, this Shunammite woman, as we refer to her as in this text of scripture, that are great characteristics that lead to God telling us that she is a great woman. Number one, if you're taking notes, I want you to note that she was caring. She was a caring individual. And I'm thankful for the care that we see in this text of scripture. The Bible says that Elisha would pass by this particular place, and in verse number eight, the Bible says that, so it was that as oft as he passed by, he turned in thither to eat bread. Why? Because this Shunammite woman, that's introduced to us in verse number eight, that she constrained him to eat bread. She was an individual that demonstrated care. She was a caring individual. In fact, Elisha says this in verse number 13. Notice the Bible says, and he said unto him, to Gehazi, his servant, he says to say unto her, this Shunammite woman, behold, thou hast been careful for us with all this care. Begin to think about caring and being a caring individual, and we find here in the passage of scripture that no doubt the evidence is given to us that she cared about Elisha. Though the text of scripture does not tell us, I believe that she cared for her husband. As you look at verses eight through 11, eight through 10, excuse me, you find the interaction between this woman and her husband, and I think that she had care for her husband, and it then leads to having care for Elisha, the man of God, and eventually would have care for her own son. She has no son at the beginning of the text of scripture. We're introduced to her as being this great woman, this couple with no children, but we find that Elisha makes the statement in verse number 16 that thou shalt embrace a son. We find that she did indeed have a child, and that child was grown, as we read already in verses 18 and 19. We find that in verse number 20, the Bible says that after the servant had received the instruction to carry him to his mother, after he's in the field there with his father, and he says, my head, my head, that it says that when he had taken him and brought him to his mother, he sat on her knees till noon and then died. It's a sad verse of scripture as it ends, but I see her care for her son as he would come in from the field, and he's got this perhaps something, maybe heat stroke, some other injury maybe that took place, and he's cried out for his head while he's in the field, and he goes to the mom. The servant brings him to his mother, and she, the Bible says, that he, that son, was there with his mother and sat on her knees till noon. Maybe some of you here this morning, you can remember as a child receiving the care on the knees. of your mother. And the reality is that God many times, and I know this morning that this is not, the statements that I'll make this morning are not necessarily statements that are applicable in every case, and I understand that. But many times God has equipped mothers to have that caring heart and to demonstrate that care, and we see it here in this Shunammite woman. Not only do we see that she was caring, but number two, I note that she was generous. She was generous. You know, in our text of scripture, we see some evidence of this, but on the bulletin this morning, the Bible says who can find a virtuous woman for her price is far above rubies from Proverbs 31 and verse number 10. The only woman called virtuous throughout all of the scripture is actually Ruth. You find it in the book of Ruth. But you'll find here that as we look through Proverbs 31 with regard to generosity that is described in that text of scripture, that you'll see in 2 Kings chapter number 4 a lady that was generous. The Bible tells us, we've noted already in verse number 8 with regard to the provision for the man of God, that she constrained him to eat bread. The Bible says, so it was that as oft as he passed by, he turned in thither to eat bread. Now we find that the Bible tells us that he passed that way regularly, and so this was not just a one-time occurrence. This was a regular occurrence, and she constrained him. She was generous with her resources, constrained him to eat bread, and as oft as he passed by, he turned in thither to eat bread. Her generosity does not stop there. We find that as we've read in verses 9 and 10, that she has this perception. She's a spiritual lady. She has this perception, and she says to her husband, this is a holy man of God. And she has this understanding of who the prophet of God is, Elisha, and notice what she makes this request in verse number 10, let us make a little chamber. We find that really the idea of a prophet's chamber, we refer to that still to this very day of using that phraseology. When we built the parsonage, we put in the basement a prophet's chamber area so that those that are traveling, missionaries and evangelists, would have the opportunity to have a place where they could stay and have some refreshment time and what have you. And so we find that she makes this request with regard to putting this prophet's chamber, this little chamber. She says, let us set for him there a bed, and a table, and a stool, and a candlestick. And it shall be, notice the end of the verse, when he cometh to us, that he shall turn in thither. She was generous. It wasn't an opportunity that she was going to allow to pass by. She wanted to seize the opportunity that was before her, and though there's, as we look at this text of scripture, this desire to be a blessing to the man of God, we find that because of this, it resulted in the fact that Elisha would stay there. That Elisha, as often as he would pass through that region, as he would travel throughout the land of Israel, that he would come through and he would have a place where he could rest. He would have a place of provision. It was because of the generosity of this woman in Shunem. We find that the Bible would tell us with regard to opportunities and the reality that we're to do good as we have opportunity to do so. In Galatians chapter number six, hold your place there, and I want you to see what the Bible tells us. In Galatians chapter number six, God gives us instruction, and we ought to be looking for opportunities. We ought to be looking for opportunities to do good, to be generous, to be giving. We find that the Bible tells us in Galatians six and verse number nine, and let us not be weary in well-doing, for in due season we shall reap if we faint not. Then notice verse number 10, as we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith. Though Galatians six was not written at the time of the ministry of Elisha, this lady in Shunem did not have a copy of the book of Galatians, the opportunity presented itself to her, and she seized the opportunity. She had the opportunity to do something for the man of God, and she goes to her husband and she says, let us do this, let's be generous, let's be hospitable. And what a blessing, again, as we think about the man of God, Elisha, traveling, and I want you to understand that not only would it be a blessing to Elisha because of her generosity, but understand the way in which it would return to her and her family, because why? Well, the man of God is there, and to have the privilege of having the man of God as he would travel through to be at their place, at their residence, would be a tremendous blessing and opportunity. We've had the privilege, and I know that some of you have as well, over your time of serving the Lord, to have meals with servants of the Lord, to have opportunities, perhaps, to have servants of the Lord stay in your home. Of course, with the Prophets Chamber, we have opportunity regularly to have missionaries and evangelists stay in our home, and the opportunities of fellowship and the opportunities of being able to be a blessing, I mean, they just abound, and it's such a privilege and such a blessing. I remember, I think back to the opportunity when we first connected with Brother Dan Hummel, and of course, you know, our church is familiar with Beacon of Truth, and we do a lot with them, and we had the opportunity at this point, about 15 years ago, to first meet Brother Hummel, and it was at our church when we were in Pennsylvania, we were members of the church, working a full-time job, had three little kids, and two, four, and six, I mean, we understand what it was to be busy and to have schedules and all over the place and what have you, but our church had a scripture assembly ministry, and it was in the evenings, and I remember Dan Hummel standing up, we'd never heard about it before, and he stood up and he tore one of the scriptures apart and showed how it gets assembled and showed the whole process, and he said this, he said, anybody that's here can do something with this scripture assembly. It was the first time our church had ever done it. He said, from the youngest to the oldest, somebody can do some job during the scripture assembly, and so we had three little kids, as I mentioned already, and Joseph was just about two years old, just a little tot of a kid, and we thought, well, I guess he said everyone can do it, and so Holly and I talked, and we said, we're gonna go, and we went. We were there each night of that assembly, and our kids did serve, they got involved, but God allowed us, and Holly and I had the opportunity to chat, and we were able to take Brother Hummel out and his wife and the team that was with them, it was a different group, it wasn't Dan and Donna Stroop, it was a different couple, and we were able to take them out for dinner after one of the assemblies, and we were just able to go out to pizza, it was late, of course, work and school the next morning and all those things, it was gonna be a late night, but at that place, through having that opportunity, God allowed our hearts to be knit together, and we had such a blessed opportunity, and now I think about all these years later, and to see the blessing of that, listen, as God would give you opportunity, just as God gave this lady, this Shunammite woman is referred to her as this opportunity, she seized it, she was generous, and God blessed. I want you to notice, as we continue to read, in verse number 11, it says, and it fell on a day that he, Elisha, came thither, and he turned into the chamber and lay there. So he took advantage of the prophet's chamber that was made available as he traveled through. The Bible says in verse number 12 that he said to Gehazi, his servant, call the Shunammite. When he had called her, she stood before him. Number three, if you're taking notes this morning, we notice not only that she was caring and generous, but we notice number three, she was content. She was content. Notice what the Bible says. She stood before him at the end of verse number 12, and in verse 13, it says that he said unto him, so Elisha says to Gehazi, say now unto her, behold, thou hast been careful for us with all this care, and then notice this question, what is to be done for thee? What is thou be spoken for to the king or to the captain of the host? What a great opportunity that is given to her as Elisha says to Gehazi, I will speak on your behalf. You have been so caring for us. What is it to be done for thee? Would you like us to stand before the king and speak for you or to the captain, the host? And notice her answer, I dwell among mine own people. She was content. She was content. She said, I dwell among my own people, and he said, what then is to be done for her? You see the heart of... Elisha desiring to give and to be a blessing to this lady that had been so caring for him and provided not only the bread, but also the dwelling place in that prophet's chamber. And Gehazi answered in verse number 14, and he said, Verily she hath no child, and her husband is old. We find that though she was in this particular place of barrenness, that she did not seem to be bitter by it. She was content. In fact, it says that he said, call her, and when he had called her, she stood in the door. In verse 16, he said, About this season, according to the time of life, thou shalt embrace a son. Can you imagine her hearing these words? She knew, the Bible tells us already, that she said to her husband in verse number nine, I perceive that this is an holy man of God. His ministry is going forth and he's traveling to and fro, and no doubt as we understand and we're familiar with the life and ministry of Elisha, there's miracles that are taking place and we find that on that day that he's there and he says to her, she's called back into the presence, about this season, according to the time of life, thou shalt embrace a son. She had no child. Not only had no child, but her husband was old, according to verse number 14. And she says in verse number 16, at the end of the verse, Nay, my Lord, thou man of God, do not lie unto thine handmaid. It was almost beyond her ability to believe what had just been declared because she'd known the circumstances that she had dealt with, but I believe that she was content not only by her answer when it was asked, what is to be done for thee, that she says, I dwell among mine own people, but even in the situation there with having no children, it seems as if this Sunamite woman was a content individual. She did not serve so that she could get something. She did not perceive that Elisha was a man of God and that Elisha was a prophet of God and that we're going to be generous and we're going to have him here so that we can get something. See, that's not the motive for giving and for serving. We're content in what God has given to us and the opportunities that he has given to us and the blessings that he will allow in our lives. See if our motive for serving, God knows our motives, by the way, if our motive for serving is so that I might get something out of it, then we have a wrong motive. We have a selfish motive and we find that God does not bless that. We live in a society today, in fact, many times, though it's not publicly known because of legal ramifications and what have you, but many people say, well, I'll do this for you if you do this for me. And that's the way often things work in a society. But here, this Sunamite woman, she was content. She did not serve so that she could get something. She was content. You know, contentment is a great thing. Many people in our society today are living lives of discontentment. We think of the society in which we live in and we think that if I could just have more, if I could just have this, if I could just, then I would be content. The reality is that there were surveys done at this point, they're years ago when these surveys were done, but they surveyed a group of people across every spectrum of income level. From the lowest income level to the highest, they just went through, they started, I think, at $25,000 a year and they went up to like $250,000 a year and just looked at that category of people and that income area. And they went through and they gave, and they said, how much more would you need to be content? You know, it was consistent that each earner in each of those categories said, you know, if I could just have $10,000 more, I'd be, I'd be okay. And that's what the one in the lowest income said and the one in the $250,000 income, they all said the same thing. There were options for them to select and it's, it's interesting. We live in a society that, that really is designed to make you discontent. We live in a midst of a generation of marketing and all sorts of things that, that really the enemy wants you to be discontent. But I want you to look at Philippians chapter number four. As I think about the, the Shunammite woman and I think about her contentment as we see in this passage of Scripture, I want to encourage you this morning to be content. We find that in Philippians chapter number four, Paul is writing, and many of us would be familiar with the fact that he's writing this church in Philippi and he's writing from prison. It was in the church, it was there in Philippi, in the city of Philippi where he was imprisoned really when that church got a great start and he was ministering there. Now many years later, he's writing back to this church under the inspiration of the Holy Spirit of God from prison. And he says in verse number 10, but I rejoiced in the Lord greatly that now at the last your care of me hath flourished again, wherein ye were also careful, but you lacked opportunity. And we understand even as we've looked at some of these thoughts already of being caring and generous and content, we see some of this here even in this verse of Scripture. In verse number 11, notice what Paul says, not that I speak in respect of want, then notice the statement, for I have learned in whatsoever state I am therewith to be content. I know both how to, how to be abased and I know how to abound everywhere and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. I can do all things through Christ which strengtheneth me. I've often said to individuals and I've said publicly from this pulpit that I cannot say as Paul said in verse number 11 that I have learned in whatsoever state I am therewith to be content. I'm trying to learn, I am learning in whatsoever state I am therewith to be content. Maybe you're here this morning and you have the ability to say as Paul said, I have learned, I am content no matter what the circumstances are. But the reality is that as we grow in Christ, as we draw closer to the Lord, that we're learning that subject of contentment, that disposition, that understanding that my God shall supply all our need. And he says that later on in this text of Scripture in verse number 19, and what a blessing to consider that God is the one that can supply everything and he teaches us to be content, to be content. So many people today, they're not content with where they are in life. They're chasing this and they're chasing that and they think if they could have that, that it would just allow them to be content. I'm going to tell you this morning that you need to learn to be content where you are. Learning contentment. God is in control. God has a plan. God has a purpose and God gives us exactly what it is that we need. She was caring, she was generous, she was content back in 2 Kings chapter number 4, number 4. She was blessed. She was blessed. The Bible tells us in verse number 16 that she hears Elisha make that declaration about this season according to the time of life, thou shalt embrace a son. In verse number 17, the Bible says, and the woman conceived and bear a son the season that Elisha had said unto her according to the time of life. What a tremendous blessing and she had been barren, but now she would be blessed with a son and what a tremendous truth that we find in God's word with regard to the sanctity of life and the preciousness of life. We live in a society today in which they do not value human life and it's unfortunate. We have just the progressive mindset with regard to abortion and a lack of understanding of the sanctity of life. In fact, there are many today that are being surveyed that are young aged people in their 20s and 30s and they will make statements such as this, I don't want to be inconvenienced with children. For anyone that's barren, that's a tragic statement to hear somebody say. Children are not a burden, children are a blessing. Children are work, amen? Children are a blessing, not a burden. We have this society that's grown up, this very, you know, the selfie generation, it's all about them and it's all about their, what they want in life and they don't want to be inconvenienced. They don't want their life to be restricted in any way, shape or form because of children. The birth rate in America has declined greatly. If you look at it globally, you see that there's some other nations around the world that their birth rate is way higher than what the birth rate of American citizens is and we see that change that's going on in our society. But this lady, she was blessed, she conceived and she bear a son and the Bible says in verse 18, when the child was grown, and I think about those formative years, we don't know how old he is because we know that he's old enough that he goes out into the field and he's there as his father is working in the field with the reapers and again, we don't know the age of the son, we can make speculation. And the Bible says that it has grown and I think about those formative years and I think about that opportunity and about this Shunammite woman and the blessing of having a child. Notice if you will, Psalm 113, we'll look at two Psalms, verses in the book of Psalms. Look at first with me at Psalm 113. God is the giver of life. God is the sustainer of life. I'm thankful that God is the author of eternal life. Life is precious, but more important than being alive and breathing here this morning, the most important thing is the spiritual life that is offered through the Lord Jesus Christ. The Bible tells us that there's a time to be born and a time to die. The Bible tells us as an appointed unto man wants to die, but after this, the judgment. And we understand the life and some people have the idea that life here on earth, this physical life, is really all there is to it. I mean, just live the best you can and get the most toys and I mean, just live it up because this is all there is. I'm sorry, but God tells us that there is eternity. And the most precious thing is that God is the author of eternal salvation. We find that He offers that eternal life. You're here living this morning. You have breath and life and none of us know how long we will have to live, but I hope this morning you're sure of heaven. You've trusted the Lord Jesus Christ, your personal savior and received the gift of life, which is eternal life, or the gift of God, which is eternal life. Notice here, as we think about the blessing of this Shunammite woman in Psalm 113 and verse number nine, the Bible says, He, speaking of God, He maketh the barren woman to keep her house, and to be a joyful mother of children, praise ye the Lord. What a blessing. In Psalm 127, in verse number three, a verse of Scripture that's familiar to many of us, the Bible says, Lo, children are an heritage of the Lord, and the fruit of the womb is His reward. The Bible continues in verses four and five and says, As arrows are in the hand of a mighty man, so are children of the youth. Happy is the man that hath his quiver full of them. They shall not be ashamed, but they shall speak with the enemies in the gate. As we think about the children being an heritage of the Lord and speaking within the context this morning of Christian families and Christian homes and understanding the blessing that God would give to any of us to have children. And understanding that God lends them to us, loans them to us for a season. We have an opportunity to invest in them and to influence them and to instruct them and to bring them up in the nurture and admonition of the Lord. The Bible says, As arrows are in the hand of a mighty man, so are children of the youth. And you think about an arrow, and I'm not in archery whatsoever, I don't do well with that sort of thing, but I do know a little bit about it, and that is that the arrow flies in the direction in which you point it. Is that accurate this morning? The arrow is going to fly in the direction in which you point it or aim it. Doesn't mean you're going to hit the target necessarily, especially speaking of me, but the reality is that it's going to go in that direction as you aim it. You know, we need to bring our children up in the nurture and admonition of the Lord. We need to guide them and direct them. Children have decisions ahead of them that are difficult decisions that are lifelong decisions with regard to the decisions they make with regard to career, with regard to family and all of those things, and how God has given parents an opportunity to invest in them and to instruct them and to show them the way that they ought to go. I mentioned this on Wednesday evening, but recently I have been confronted by a couple of churches that have no pastors, and I've had some conversation over the last few days with some other folks about trying to find, look, there's some churches that are ready to just basically close down because there's no pastors, and there's some churches that have been without pastors for extended periods of time that are just kind of hanging on by a thread, if you will, and what do we do? And I got correspondence yesterday from one individual that said, preacher, you know, the problem is that there's a lot more churches looking for pastors than are our pastors looking for churches. It's a sad situation, what's going on in America. It might be that God will allow us to have children and that God would call our children to the ministry, not only pastoring, but missionaries. We have, if you look at our board of missionaries, I'm thankful for the young families that we have, but we have a lot of older families of missionaries as well. They need to, we need to be raising up the next generation of servants. We need to be praying to the Lord of the harvest that He would send forth laborers, children, our inheritance of the Lord. We need to rejoice in the blessing that we see here in this passage of Scripture. She was blessed. I want you to see that it turns, from a human perspective, in our text of Scripture in 2 Kings chapter 4, really to a tragic situation. The Bible tells us, as we've read already, that He's there in the field with His Father, that He went out to His Father, to the reapers, in verse 18, verse 19, it says that He said unto His Father, My head, My head. He said to the lad, carry him to his mother. When He had taken him and brought him to his mother, He sat on her knees till noon and then died. Those are sad words. I would say that as she was blessed, number five, she was broken. There are periods of time in our lives of brokenness, periods of times in which we have hearts that are heavy, that are overwhelmed, and verse 27, we'll get there in a moment, but it says that her soul is vexed within her. I don't know all that you're going through, I don't know the brokenness that anyone specifically is dealing with, but understand that many people in our society today, many people in our churches today, they're broken, they're broken. I'm thankful that we serve a great God. We serve a God who tells us that we can cast our burden upon the Lord, that we can bring our care to the Lord, knowing that He cares for us. I think about that song that we sang this morning, it's just like His great love, and when we sang that song this morning, we had the opportunity to think about the words of one of those, the third, I believe it was the third verse of that particular song and understanding of His great love. And it says, when life seems more than useless and I were better dead, I take my grief to Jesus then, nor do I go in vain, for heavenly hope He gives, that cheers like sunshine after rain. There's some people that are broken, and here I believe that this circumstance in the life of this Shunammite woman brought her to a place of brokenness, but I want you to see what she does in her brokenness, because I believe that as we look and examine what she does in her brokenness, what is revealed to us is her faith. Her faith is evidenced through this period of brokenness. Someone said this, a faith that cannot be tested cannot be trusted. A faith that cannot be tested is a faith that cannot be trusted. Listen, we serve the God of the universe. You may be facing some situation, this Shunammite woman, she was facing a situation where her son died. In verse 21, the Bible says that she went up and laid him on the bed of the man of God, and shut the door upon him and went out. I want you to consider verse 21. I'm assuming that this lad probably had his own bed. I'm assuming that the boy, the son, had his own bed, but she does not take and lay her son on his own bed. I believe that she's rejoicing at this very moment in the fact that she said to her husband, let's make this prophet's chamber. And in that prophet's chamber, she calls it a little chamber, but she says, let us put there, set there for him a bed and a table and a stool and a candlestick. And we find that now when her son dies there upon her knees in verse number 20, that in verse 21, she takes this body of her son and she lays him on the bed of the man of God. The Bible tells us that she shut the door upon him and went out and she called unto her husband and notice what she says in verse 22, send me, I pray thee, one of the young men and one of the asses that I may run to the man of God, but then notice this and come again. I believe that she had every expectation. Where was she going to run to in the moment of her crisis? In the moment of her brokenness, what was she going to do? She says, I need to get to the man of God. I want you to understand in Israel's history at this particular time and the ministry of the prophets, this was the place for her to run. I'm thankful today with New Testament understanding and what Jesus Christ did on the cross of Calvary and how he rent the veil and twain and he provided direct access for every child of God. If you're saved by the blood of Christ this morning, you have direct access to God almighty and you can run to God. In the moment of your brokenness, in the moment of your despair, in your heaviness, and the Bible says that she ran She desired to run to the man of God and said I'll come again in verse 23 And he said notice what the husband says wherefore will thou go to him today? It is neither new moon nor Sabbath, and she said it shall be well It did not matter what the timing was there was an urgent circumstance There was a need that she had in her life and though it was not a new moon though It was not a Sabbath. She needed to get to the man of God It's about a 25 mile journey 25 miles for us today well in northern, Virginia could take a while but 25 miles on a donkey And notice what she says She sat on an ass then she sat on an ass and said to the servant drive and go forward then notice this Slack not thy writing for me except I bid thee. That's why she asked for one of the young men Amen because some of the old men couldn't go as fast as she wanted to go and so she called for one of those young men and She said do not slack Thy writing for me in other words there was urgency we need to get to the man of God Verse 25 so she went and came into the man of God to Mount Carmel It came to pass when the man of God saw her afar off that he said to cause a a servant behold yonder is that Shunammite You know he recognized her Because she provided a place for him to dwell and he was there so often And when she's coming even from a distance. He says to his servant Gehazi. He says the Shunammite Shunammite He then tells Gehazi run now I pray thee to meet her and say unto her is it well with thee is it well with thy husband as well with the child Notice the three questions is it well with thee is it well with thy husband is it well with the child? Why was she running to the man of God? Because in verse number 20 her son died And Elisha says To Gehazi Run to her and ask her three specific questions number one is it well with thee number two is it? Well with your husband number three is it well? with the child and I want you to see her response it is Well It is well Is that what you would expect It is well We sing the song What a wonderful song it is Almost always when we have favorites someone is going to pick it as well with my soul and we know the story that Really led to the writing of that song and the tragic fire of Chicago and the descending ahead of a family in a disaster on the seas where the the daughters are killed they drown and Correspondences received back in Chicago Saved alone Just the wife made it across And Horatio Spafford sat down as he took that journey across the sea and he asked The captain of the ship as they got to around the area where the tragedy took place If he could let him know where it was And he sat down and he wrote the words of that song it is well with my soul It's amazing, you know what that is it's the grace of God It is the grace of God That would allow for us to say it's faith that we have in the God of the universe the one Who spoke it all into existence the one who controls everything? And we have the privilege of knowing him and serving him and because we know that he's a great God And he do with all things well and because we've experienced the grace of God We can say it is well it is well When she came to the man of God to the hill she caught him according to verse number 27 by the feet and Look at what Gahazi does but Gahazi came near to thrust her away and the man of God Elisha. He said let her alone For her soul is vexed within her and then notice this and the Lord hath hid it from me and hath not told me Elisha did not know Many times the prophet of God would know ahead of time and God would reveal it supernaturally But here Elisha does not know and then in verse 28. She said did I desire a son of my Lord? Did I not say do not deceive me? She did not even say in verse 28 that the son had died but notice in verse number 29 Then he Elisha said to Gahazi Gird up my loins and take my staff in thine hand and go thy way if thou meet any man salute him not and if they any salute thee answer him not again and lay my staff upon the face of the child and the mother of the child said as the Lord liveth and as thy soul liveth Notice this I will not leave thee and he arose and followed her She was gonna stay with the man of God How long do you need to stay in the presence of God? When you're broken, you know what the wonderful thing is you can stay as long as you need to You can stay in the presence of God And he can help you He can heal that broken heart. He can give you the grace Remember he said to Paul my grace is sufficient for thee. Have you found it to be so in your life? See we find it to be so when we go through that difficulty Many times in life. There's there's very little growth without any Adversity or difficulty many times in life. It's through that period of hardship that that God is developing us Mary and Martha believed with all of their heart that Jesus could heal Lazarus They sent to Jesus to say he whom thou lovest is sick Why did they send for Jesus? Well because Jesus healed it the power over disease and they knew that but Jesus tarried his Departure and both of those sisters when Jesus arrives They say this if thou hath been here My brother would not have died. He still be alive. In fact the Jews that were there mourning as Their custom would be when they heard Jesus wept. They said could not he Who who made the man see that was blind they refer back to a miracle of a couple of chapters earlier Could not he have healed him the answer is yes But you know what? They didn't believe they didn't believe that he could bring him back from the dead So Lazarus had to die The morning the brokenness took place so that Lazarus Would be in that tomb for four days and Jesus would say Lazarus come forth He said to his disciples, I'm glad for your sakes that I was not there to the extent that you might believe Brokenness oftentimes leads to great growth be in the presence of God the Bible tells the verse 31 that Gehazi passed on before them and laid the staff upon the face of the child and there was Neither voice nor hearing wherefore he went again to meet him and told him saying the child is not awake He put the staff there But there's no power in that the Bible says in verse 32 when Elisha was coming to the house behold the child was dead and laid upon his bed he went in therefore and Shut the door upon them twain Notice this he prayed unto the Lord Is your first response to difficulty prayer You know why Elisha prayed he saw Elijah pray, you know some of the power of prayer He prayed unto the Lord And he went up and lay upon the child and put his mouth upon his mouth and his eyes upon his eyes his hand upon His hands and he stretched himself upon the child and the flesh of the child waxed warm Then he returned and walked in the house to and fro and went up and stretched himself upon him in the Child sneezed seven times and then notice this the child opened his eyes number six this morning finally This Shunammite woman had the privilege to see God work She had the privilege to see God work What a unique privilege She saw God work and giving her a son in the first place But now we see that she she has the opportunity personally to experience the miracle working power of God Almighty The Bible says that the child opened his eyes and he saw the Son of God The Bible says that the child opened his eyes. So what happens Elisha calls Gehazi in verse 36 and said call the Shunammite So he called her And when she was coming unto him notice these words He said take up thy son Then she went in and fell at his feet and bowed herself to the ground and took up her son and went out We don't have time this morning but chapter number eight We don't know the exact timing with all of these events in second Kings, but chapter number eight Talks about the Shunammite Woman and her son there was a seven-year famine. So at least seven years passes and the Shunammite This giant woman and her son are referenced in chapter number 8. God gave her opportunity to see her son grow and live. I don't know how long, there's no more reference with regard to either one of them after chapter number 8, but I find this morning, this great woman in Shunem, she was caring, she was generous, she was content. I find that she was blessed, she was broken, and then she was privileged to see God work. I think about that last point this morning, you know it's a privilege for us to see God work. It's a privilege, unique privilege. Do you long to see God work in your life? Do you long to see God work in the lives of those that He's given you opportunity to, if you're parents, to raise, if you're church members, to minister to, you want to see God work in their lives. It's a privilege to see God work. We've got to be in the right place if we're going to see God work. You know what led to this Shunemite woman seeing God work in all the circumstances in which she did? It started out by her being caring and saying, constrained him to eat some bread, and then perceiving that this was a holy man of God and said, we need to build a place for him to be able to stay so that when he passes through here, he'll stay here. He could have stayed somewhere else, someone else could, but no, she had the opportunity and she seized it. And because of that single decision, her generosity, her service, her care, she got to see God work miraculously. I hope this morning that we would not allow opportunities to pass us by, that we would seize them, that we'd be used of the Lord, that we would see God do great and mighty things. It's God who said to Jeremiah, call unto me and I will answer thee and show thee great and mighty things which thou knowest not. If you're broken today, can I give you hope in Christ? Can I tell you that Jesus, He heals the brokenhearted. What a wonderful, wonderful Savior we have. If you don't know Him as your personal Lord and Savior today, today is the day of salvation. This morning you say, I'm a Christian, I'm saved by the grace of God, but I got this burden, I'm broken over this situation. Tell it to Jesus. Tell it to Jesus. What a privilege we have. What a friend we have in Jesus that we can go to Him knowing that He cares for us. Let's pray together. Father, we love you. We thank you for loving us. Thank you for the opportunity today to celebrate mothers. Thank you for this Shunammite woman. Lord, thank you for the characteristics that we could look at of her life. Thank you for what you revealed to us. I pray, God, that you'd meet needs this morning. Maybe there's someone that's broken. God, would you just help them to run to you, to get into your presence, to not leave your presence, to abide in you. Lord, I pray that you would work miraculously in our lives, that we would seize the opportunities to serve you. Not for something that we might be able to get, but Lord, that we would serve you because you are worthy of our service. I pray that you'd move and work in hearts and lives as only you can. If there's one that's not sure of heaven, it's our prayer that today would be the day of their salvation. Well, thank you for all that you'll do, for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano. If you're not sure of heaven, we'd love to take a Bible and show you how you can know for sure that heaven is your home. If you're saved, then maybe you just need to come and talk to the Lord this morning. Maybe there's something that's on your heart, you're broken, you're in need of God's care and God's grace. Maybe God spoke to you through some other way this morning. As Kimberly plays, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.8399999141693115,
      "text": " through 1st and 2nd Timothy on Sunday mornings."
    },
    {
      "id": 1,
      "start": 2.8399999141693115,
      "end": 5.599999904632568,
      "text": " Our theme is continue, but for Mother's Day,"
    },
    {
      "id": 2,
      "start": 5.599999904632568,
      "end": 8.119999885559082,
      "text": " we're gonna take a break from 1st and 2nd Timothy,"
    },
    {
      "id": 3,
      "start": 8.119999885559082,
      "end": 11.119999885559082,
      "text": " head over here to 2 Kings chapter number four this morning."
    },
    {
      "id": 4,
      "start": 11.119999885559082,
      "end": 13.239999771118164,
      "text": " Mother's Day, of course, is a special day"
    },
    {
      "id": 5,
      "start": 13.239999771118164,
      "end": 17.440000534057617,
      "text": " that is celebrated on this, the 2nd May annually"
    },
    {
      "id": 6,
      "start": 17.440000534057617,
      "end": 19.959999084472656,
      "text": " here in the United States of America."
    },
    {
      "id": 7,
      "start": 19.959999084472656,
      "end": 22.959999084472656,
      "text": " Anna Jarvis is credited as celebrating"
    },
    {
      "id": 8,
      "start": 22.959999084472656,
      "end": 27.600000381469727,
      "text": " the 1st Mother's Day, and that was back on May 10th, 1908."
    },
    {
      "id": 9,
      "start": 27.600000381469727,
      "end": 31.31999969482422,
      "text": " And prior to then, there were some times"
    },
    {
      "id": 10,
      "start": 31.31999969482422,
      "end": 33.91999816894531,
      "text": " in which various pockets of populations"
    },
    {
      "id": 11,
      "start": 33.91999816894531,
      "end": 36.2400016784668,
      "text": " in the United States would celebrate"
    },
    {
      "id": 12,
      "start": 36.2400016784668,
      "end": 39.7599983215332,
      "text": " or acknowledge mothers on a special day."
    },
    {
      "id": 13,
      "start": 39.7599983215332,
      "end": 42.08000183105469,
      "text": " But really, she is credited with celebrating"
    },
    {
      "id": 14,
      "start": 42.08000183105469,
      "end": 44.400001525878906,
      "text": " the 1st Mother's Day there on May 10th, 1908."
    },
    {
      "id": 15,
      "start": 44.400001525878906,
      "end": 48.08000183105469,
      "text": " It was about five years later, on May 10th, 1913,"
    },
    {
      "id": 16,
      "start": 48.08000183105469,
      "end": 52.2599983215332,
      "text": " that the U.S. House of Representatives passed a resolution,"
    },
    {
      "id": 17,
      "start": 52.2599983215332,
      "end": 56.279998779296875,
      "text": " and that resolution, they called for all federal employees,"
    },
    {
      "id": 18,
      "start": 56.279998779296875,
      "end": 60.720001220703125,
      "text": " government officials, to wear a white carnation."
    },
    {
      "id": 19,
      "start": 60.720001220703125,
      "end": 63.560001373291016,
      "text": " And they made that decree, or that resolution,"
    },
    {
      "id": 20,
      "start": 63.560001373291016,
      "end": 66.83999633789062,
      "text": " if you will, on May the 10th, 1913,"
    },
    {
      "id": 21,
      "start": 66.83999633789062,
      "end": 68.87999725341797,
      "text": " and they said that they were to wear the white carnation"
    },
    {
      "id": 22,
      "start": 68.87999725341797,
      "end": 72.83999633789062,
      "text": " on May 11th, 1913 in honor of Mother's Day."
    },
    {
      "id": 23,
      "start": 72.83999633789062,
      "end": 76.63999938964844,
      "text": " It was the following year, on May 8th, 1914."
    },
    {
      "id": 24,
      "start": 76.63999938964844,
      "end": 78.31999969482422,
      "text": " I give you all this information"
    },
    {
      "id": 25,
      "start": 78.31999969482422,
      "end": 80.4000015258789,
      "text": " just to let you know the importance of it,"
    },
    {
      "id": 26,
      "start": 80.4000015258789,
      "end": 83.44000244140625,
      "text": " but Congress passed a law designating"
    },
    {
      "id": 27,
      "start": 83.55999755859375,
      "end": 87.80000305175781,
      "text": " the second Sunday of May would be Mother's Day."
    },
    {
      "id": 28,
      "start": 87.80000305175781,
      "end": 92.27999877929688,
      "text": " In that law, they also made a request for a proclamation,"
    },
    {
      "id": 29,
      "start": 92.27999877929688,
      "end": 95.5999984741211,
      "text": " and the very next day, then President Woodrow Wilson"
    },
    {
      "id": 30,
      "start": 95.5999984741211,
      "end": 98.44000244140625,
      "text": " issued a proclamation declaring"
    },
    {
      "id": 31,
      "start": 98.44000244140625,
      "end": 101.44000244140625,
      "text": " the first national Mother's Day."
    },
    {
      "id": 32,
      "start": 101.44000244140625,
      "end": 103.95999908447266,
      "text": " And so that goes all the way back to 1914."
    },
    {
      "id": 33,
      "start": 103.95999908447266,
      "end": 106.87999725341797,
      "text": " Of course, this is 2024, so 110 years ago"
    },
    {
      "id": 34,
      "start": 106.87999725341797,
      "end": 109.08000183105469,
      "text": " when it was made law."
    },
    {
      "id": 35,
      "start": 109.08000183105469,
      "end": 112.04000091552734,
      "text": " The decree, if you will, the proclamation"
    },
    {
      "id": 36,
      "start": 112.04000091552734,
      "end": 116.5999984741211,
      "text": " by President Woodrow Wilson after the law passed Congress."
    },
    {
      "id": 37,
      "start": 116.5999984741211,
      "end": 120.4000015258789,
      "text": " Today, there are over 50 nations in the world"
    },
    {
      "id": 38,
      "start": 120.4000015258789,
      "end": 124.76000213623047,
      "text": " that have a day in which they have on their calendars"
    },
    {
      "id": 39,
      "start": 124.76000213623047,
      "end": 128.0800018310547,
      "text": " an observance, a special day for observing Mother's Day."
    },
    {
      "id": 40,
      "start": 128.0800018310547,
      "end": 130.16000366210938,
      "text": " It's not always on this same day"
    },
    {
      "id": 41,
      "start": 130.16000366210938,
      "end": 132.55999755859375,
      "text": " that we celebrate here in the United States of America."
    },
    {
      "id": 42,
      "start": 132.55999755859375,
      "end": 133.83999633789062,
      "text": " There are a number of countries"
    },
    {
      "id": 43,
      "start": 133.83999633789062,
      "end": 137.55999755859375,
      "text": " that do have their calendar mirrored to our calendar"
    },
    {
      "id": 44,
      "start": 137.55999755859375,
      "end": 139.32000732421875,
      "text": " based on that proclamation,"
    },
    {
      "id": 45,
      "start": 139.32000732421875,
      "end": 140.8800048828125,
      "text": " but there are many other nations"
    },
    {
      "id": 46,
      "start": 140.8800048828125,
      "end": 143.36000061035156,
      "text": " that have some other time during the year."
    },
    {
      "id": 47,
      "start": 143.36000061035156,
      "end": 146.39999389648438,
      "text": " But I'm thankful this morning, early this morning,"
    },
    {
      "id": 48,
      "start": 146.39999389648438,
      "end": 147.9600067138672,
      "text": " I sent my mom a text."
    },
    {
      "id": 49,
      "start": 147.9600067138672,
      "end": 150.0,
      "text": " Of course, not able to see her today."
    },
    {
      "id": 50,
      "start": 150.0,
      "end": 152.0,
      "text": " They're down in South Carolina."
    },
    {
      "id": 51,
      "start": 152.0,
      "end": 153.8800048828125,
      "text": " I sent her a card in the mail,"
    },
    {
      "id": 52,
      "start": 153.8800048828125,
      "end": 155.27999877929688,
      "text": " and then I sent her a text this morning,"
    },
    {
      "id": 53,
      "start": 155.27999877929688,
      "end": 157.24000549316406,
      "text": " let her know that I love her and appreciate her"
    },
    {
      "id": 54,
      "start": 157.24000549316406,
      "end": 160.1999969482422,
      "text": " and all that she's done for me over the years."
    },
    {
      "id": 55,
      "start": 160.1999969482422,
      "end": 162.52000427246094,
      "text": " And I am thankful for Holly,"
    },
    {
      "id": 56,
      "start": 162.52000427246094,
      "end": 165.67999267578125,
      "text": " and also let her know the appreciation that I have."
    },
    {
      "id": 57,
      "start": 165.67999267578125,
      "end": 167.8800048828125,
      "text": " I hope that you, if your mother is still alive,"
    },
    {
      "id": 58,
      "start": 167.8800048828125,
      "end": 171.16000366210938,
      "text": " have had the opportunity to thank her today."
    },
    {
      "id": 59,
      "start": 171.16000366210938,
      "end": 172.72000122070312,
      "text": " And if not, if you would do that,"
    },
    {
      "id": 60,
      "start": 172.72000122070312,
      "end": 175.8800048828125,
      "text": " many, no doubt, their mothers have passed on into eternity,"
    },
    {
      "id": 61,
      "start": 175.8800048828125,
      "end": 178.44000244140625,
      "text": " and that makes for a difficult day."
    },
    {
      "id": 62,
      "start": 178.44000244140625,
      "end": 181.60000610351562,
      "text": " But the remembrance of all of those wonderful memories,"
    },
    {
      "id": 63,
      "start": 181.60000610351562,
      "end": 183.39999389648438,
      "text": " we certainly can rejoice in that"
    },
    {
      "id": 64,
      "start": 183.39999389648438,
      "end": 186.32000732421875,
      "text": " and thank God for the time that we're able to have."
    },
    {
      "id": 65,
      "start": 186.32000732421875,
      "end": 188.83999633789062,
      "text": " As we come to 2 Kings chapter number four,"
    },
    {
      "id": 66,
      "start": 188.83999633789062,
      "end": 191.8000030517578,
      "text": " we're looking at the ministry of Elisha."
    },
    {
      "id": 67,
      "start": 191.8000030517578,
      "end": 195.0800018310547,
      "text": " The ministry of Elisha is an exciting ministry,"
    },
    {
      "id": 68,
      "start": 195.0800018310547,
      "end": 197.1999969482422,
      "text": " one in which many of us are familiar with."
    },
    {
      "id": 69,
      "start": 197.1999969482422,
      "end": 199.0800018310547,
      "text": " And as you begin the fourth chapter"
    },
    {
      "id": 70,
      "start": 199.0800018310547,
      "end": 200.1199951171875,
      "text": " of the book of 2 Kings,"
    },
    {
      "id": 71,
      "start": 200.1199951171875,
      "end": 203.47999572753906,
      "text": " we find that God gives us in the first seven verses,"
    },
    {
      "id": 72,
      "start": 203.47999572753906,
      "end": 205.0,
      "text": " it's not our text of scripture,"
    },
    {
      "id": 73,
      "start": 205.0,
      "end": 208.52000427246094,
      "text": " but God provides for us the record of the miracle"
    },
    {
      "id": 74,
      "start": 208.52000427246094,
      "end": 209.9600067138672,
      "text": " of the pot of oil."
    },
    {
      "id": 75,
      "start": 209.9600067138672,
      "end": 211.0800018310547,
      "text": " Remember the widow woman,"
    },
    {
      "id": 76,
      "start": 211.0800018310547,
      "end": 213.32000732421875,
      "text": " she had a debt and her husband had died"
    },
    {
      "id": 77,
      "start": 213.32000732421875,
      "end": 214.36000061035156,
      "text": " and she had two sons."
    },
    {
      "id": 78,
      "start": 214.36000061035156,
      "end": 217.47999572753906,
      "text": " And she went to the man of God, to Elisha."
    },
    {
      "id": 79,
      "start": 217.47999572753906,
      "end": 219.60000610351562,
      "text": " She said, he asked this question,"
    },
    {
      "id": 80,
      "start": 219.60000610351562,
      "end": 222.72000122070312,
      "text": " what have you, what hast thou in the house?"
    },
    {
      "id": 81,
      "start": 222.72000122070312,
      "end": 227.0800018310547,
      "text": " And she said, not anything in the house save a pot of oil."
    },
    {
      "id": 82,
      "start": 227.9600067138672,
      "end": 229.0399932861328,
      "text": " And God did a great miracle"
    },
    {
      "id": 83,
      "start": 229.0399932861328,
      "end": 231.67999267578125,
      "text": " and they gathered up all the vessels"
    },
    {
      "id": 84,
      "start": 231.67999267578125,
      "end": 233.39999389648438,
      "text": " and they filled from that pot of oil,"
    },
    {
      "id": 85,
      "start": 233.39999389648438,
      "end": 235.67999267578125,
      "text": " every vessel they could possibly find."
    },
    {
      "id": 86,
      "start": 235.67999267578125,
      "end": 237.52000427246094,
      "text": " Elisha gave the instruction to sell,"
    },
    {
      "id": 87,
      "start": 237.52000427246094,
      "end": 239.24000549316406,
      "text": " pay off the debt, live on the rest."
    },
    {
      "id": 88,
      "start": 239.24000549316406,
      "end": 241.0,
      "text": " What a wonderful miracle."
    },
    {
      "id": 89,
      "start": 241.0,
      "end": 242.27999877929688,
      "text": " As we come to verse number eight,"
    },
    {
      "id": 90,
      "start": 242.27999877929688,
      "end": 245.0399932861328,
      "text": " the text of scripture in which we're looking at this morning"
    },
    {
      "id": 91,
      "start": 245.0399932861328,
      "end": 247.24000549316406,
      "text": " we are introduced to a family,"
    },
    {
      "id": 92,
      "start": 247.24000549316406,
      "end": 250.0800018310547,
      "text": " a husband and wife in the city of Shunem."
    },
    {
      "id": 93,
      "start": 250.0800018310547,
      "end": 251.83999633789062,
      "text": " We do not know the name of this woman."
    },
    {
      "id": 94,
      "start": 251.83999633789062,
      "end": 256.0799865722656,
      "text": " She simply introduced to us as a great woman."
    },
    {
      "id": 95,
      "start": 256.0799865722656,
      "end": 258.760009765625,
      "text": " In fact, often as we look at this text of scripture"
    },
    {
      "id": 96,
      "start": 258.760009765625,
      "end": 262.3999938964844,
      "text": " in verses eight down through verse number 37,"
    },
    {
      "id": 97,
      "start": 262.3999938964844,
      "end": 267.3999938964844,
      "text": " she is often simply referred to as the Shunemite woman."
    },
    {
      "id": 98,
      "start": 267.55999755859375,
      "end": 271.0,
      "text": " This morning, we'll take an opportunity to review her life"
    },
    {
      "id": 99,
      "start": 271.0,
      "end": 273.5199890136719,
      "text": " as it's revealed in this passage of scripture."
    },
    {
      "id": 100,
      "start": 273.5199890136719,
      "end": 276.239990234375,
      "text": " And I wanna note a number of characteristics"
    },
    {
      "id": 101,
      "start": 276.239990234375,
      "end": 279.9200134277344,
      "text": " about this lady that would give us reason"
    },
    {
      "id": 102,
      "start": 279.9200134277344,
      "end": 283.9200134277344,
      "text": " as to why the Bible tells us that it was in this place"
    },
    {
      "id": 103,
      "start": 283.9599914550781,
      "end": 286.5199890136719,
      "text": " where was a great woman."
    },
    {
      "id": 104,
      "start": 286.5199890136719,
      "end": 287.760009765625,
      "text": " Notice with me in verse number eight,"
    },
    {
      "id": 105,
      "start": 287.760009765625,
      "end": 289.1199951171875,
      "text": " the Bible says, and it fell on a day"
    },
    {
      "id": 106,
      "start": 289.1199951171875,
      "end": 292.7200012207031,
      "text": " that Elisha passed to Shunem where was a great woman"
    },
    {
      "id": 107,
      "start": 292.7200012207031,
      "end": 295.7200012207031,
      "text": " and she constrained him to eat bread."
    },
    {
      "id": 108,
      "start": 295.7200012207031,
      "end": 298.3999938964844,
      "text": " And so it was that as off as he passed by,"
    },
    {
      "id": 109,
      "start": 298.3999938964844,
      "end": 301.2799987792969,
      "text": " he turned in thither to eat bread."
    },
    {
      "id": 110,
      "start": 301.2799987792969,
      "end": 303.44000244140625,
      "text": " And she said unto her husband,"
    },
    {
      "id": 111,
      "start": 303.44000244140625,
      "end": 308.44000244140625,
      "text": " behold now, I perceive that this is an holy man of God"
    },
    {
      "id": 112,
      "start": 310.239990234375,
      "end": 313.7200012207031,
      "text": " which passeth by us continually."
    },
    {
      "id": 113,
      "start": 314.55999755859375,
      "end": 317.44000244140625,
      "text": " And I praise God for her perception and her spirituality."
    },
    {
      "id": 114,
      "start": 317.44000244140625,
      "end": 319.8399963378906,
      "text": " The Bible says that she then makes this request"
    },
    {
      "id": 115,
      "start": 319.8399963378906,
      "end": 322.9200134277344,
      "text": " to her husband, she says, let us make a little chamber."
    },
    {
      "id": 116,
      "start": 322.9200134277344,
      "end": 327.3999938964844,
      "text": " I pray thee on the wall and let us set for him there a bed"
    },
    {
      "id": 117,
      "start": 327.3999938964844,
      "end": 330.9599914550781,
      "text": " and a table and a stool and a candlestick."
    },
    {
      "id": 118,
      "start": 330.9599914550781,
      "end": 334.1199951171875,
      "text": " And it shall be when he cometh to us"
    },
    {
      "id": 119,
      "start": 334.1199951171875,
      "end": 338.4800109863281,
      "text": " that he shall turn in thither."
    },
    {
      "id": 120,
      "start": 338.4800109863281,
      "end": 339.9599914550781,
      "text": " At this point, they have no children."
    },
    {
      "id": 121,
      "start": 339.9599914550781,
      "end": 341.32000732421875,
      "text": " We'll go through the text of scripture"
    },
    {
      "id": 122,
      "start": 341.32000732421875,
      "end": 343.55999755859375,
      "text": " and see the miraculous birth of their son."
    },
    {
      "id": 123,
      "start": 344.3999938964844,
      "end": 345.5199890136719,
      "text": " But I want you to skip down, if you will,"
    },
    {
      "id": 124,
      "start": 345.5199890136719,
      "end": 347.44000244140625,
      "text": " to verse number 19."
    },
    {
      "id": 125,
      "start": 347.44000244140625,
      "end": 348.79998779296875,
      "text": " I'll give you the title for the message"
    },
    {
      "id": 126,
      "start": 348.79998779296875,
      "end": 351.7200012207031,
      "text": " and we'll jump into the thoughts this morning."
    },
    {
      "id": 127,
      "start": 351.7200012207031,
      "end": 353.9200134277344,
      "text": " In verse 18, it says, and when the child was grown,"
    },
    {
      "id": 128,
      "start": 353.9200134277344,
      "end": 356.0400085449219,
      "text": " it fell on a day that he went out to his father,"
    },
    {
      "id": 129,
      "start": 356.0400085449219,
      "end": 358.55999755859375,
      "text": " to the reapers, and he said unto his father,"
    },
    {
      "id": 130,
      "start": 358.55999755859375,
      "end": 361.32000732421875,
      "text": " my head, my head."
    },
    {
      "id": 131,
      "start": 361.32000732421875,
      "end": 366.239990234375,
      "text": " And he said to Elad, notice this, carry him to his mother."
    },
    {
      "id": 132,
      "start": 366.239990234375,
      "end": 367.7200012207031,
      "text": " And I've titled the message this morning,"
    },
    {
      "id": 133,
      "start": 367.7200012207031,
      "end": 370.0400085449219,
      "text": " carry him to his mother."
    },
    {
      "id": 134,
      "start": 370.0400085449219,
      "end": 371.67999267578125,
      "text": " There's been many times in our lives"
    },
    {
      "id": 135,
      "start": 371.67999267578125,
      "end": 373.55999755859375,
      "text": " when our children would get injured."
    },
    {
      "id": 136,
      "start": 373.55999755859375,
      "end": 375.8399963378906,
      "text": " I remember as a child, if I would get injured,"
    },
    {
      "id": 137,
      "start": 375.8399963378906,
      "end": 378.0,
      "text": " it was always mom that provided more care"
    },
    {
      "id": 138,
      "start": 378.0,
      "end": 379.8399963378906,
      "text": " and compassion than dad."
    },
    {
      "id": 139,
      "start": 379.8399963378906,
      "end": 383.0799865722656,
      "text": " If I was injured as a child and I went to my dad,"
    },
    {
      "id": 140,
      "start": 383.0799865722656,
      "end": 385.1600036621094,
      "text": " he'd try to move the limb or move whatever"
    },
    {
      "id": 141,
      "start": 385.1600036621094,
      "end": 386.44000244140625,
      "text": " and say, it's not broken, son."
    },
    {
      "id": 142,
      "start": 386.44000244140625,
      "end": 388.760009765625,
      "text": " It moves just fine, just carry on, right?"
    },
    {
      "id": 143,
      "start": 388.760009765625,
      "end": 390.8800048828125,
      "text": " And mom was the one that you would go to"
    },
    {
      "id": 144,
      "start": 390.8800048828125,
      "end": 393.9200134277344,
      "text": " to have compassion and some care and concern."
    },
    {
      "id": 145,
      "start": 393.9200134277344,
      "end": 396.1600036621094,
      "text": " And in our home, it's the same way."
    },
    {
      "id": 146,
      "start": 396.1600036621094,
      "end": 399.1199951171875,
      "text": " Oftentimes, I'll say, I'm not sure what to do about that."
    },
    {
      "id": 147,
      "start": 399.1199951171875,
      "end": 400.0799865722656,
      "text": " Go see mom."
    },
    {
      "id": 148,
      "start": 400.1199951171875,
      "end": 404.5199890136719,
      "text": " And here, this man says, carry him to his mother."
    },
    {
      "id": 149,
      "start": 404.5199890136719,
      "end": 406.20001220703125,
      "text": " As we think about this passage of scripture,"
    },
    {
      "id": 150,
      "start": 406.20001220703125,
      "end": 408.0799865722656,
      "text": " we're gonna make our way through the entirety of it."
    },
    {
      "id": 151,
      "start": 408.0799865722656,
      "end": 410.0799865722656,
      "text": " I wanna give you six thoughts this morning,"
    },
    {
      "id": 152,
      "start": 410.0799865722656,
      "end": 411.79998779296875,
      "text": " and I'm gonna be brief with each one."
    },
    {
      "id": 153,
      "start": 411.79998779296875,
      "end": 415.2799987792969,
      "text": " Don't get overwhelmed with having six thoughts this morning."
    },
    {
      "id": 154,
      "start": 415.2799987792969,
      "end": 417.94000244140625,
      "text": " But six thoughts this morning of characteristics"
    },
    {
      "id": 155,
      "start": 417.94000244140625,
      "end": 420.44000244140625,
      "text": " of this lady, this Shunammite woman,"
    },
    {
      "id": 156,
      "start": 420.44000244140625,
      "end": 423.239990234375,
      "text": " as we refer to her as in this text of scripture,"
    },
    {
      "id": 157,
      "start": 423.239990234375,
      "end": 428.239990234375,
      "text": " that are great characteristics that lead to God telling us"
    },
    {
      "id": 158,
      "start": 428.6000061035156,
      "end": 432.239990234375,
      "text": " that she is a great woman."
    },
    {
      "id": 159,
      "start": 432.239990234375,
      "end": 434.1600036621094,
      "text": " Number one, if you're taking notes,"
    },
    {
      "id": 160,
      "start": 434.1600036621094,
      "end": 436.5,
      "text": " I want you to note that she was caring."
    },
    {
      "id": 161,
      "start": 436.5,
      "end": 438.5,
      "text": " She was a caring individual."
    },
    {
      "id": 162,
      "start": 438.5,
      "end": 441.6000061035156,
      "text": " And I'm thankful for the care that we see"
    },
    {
      "id": 163,
      "start": 441.6000061035156,
      "end": 443.20001220703125,
      "text": " in this text of scripture."
    },
    {
      "id": 164,
      "start": 443.20001220703125,
      "end": 445.9200134277344,
      "text": " The Bible says that Elisha would pass by"
    },
    {
      "id": 165,
      "start": 445.9200134277344,
      "end": 448.20001220703125,
      "text": " this particular place, and in verse number eight,"
    },
    {
      "id": 166,
      "start": 448.20001220703125,
      "end": 452.44000244140625,
      "text": " the Bible says that, so it was that as oft as he passed by,"
    },
    {
      "id": 167,
      "start": 452.44000244140625,
      "end": 455.05999755859375,
      "text": " he turned in thither to eat bread."
    },
    {
      "id": 168,
      "start": 455.05999755859375,
      "end": 455.8999938964844,
      "text": " Why?"
    },
    {
      "id": 169,
      "start": 455.8999938964844,
      "end": 457.4599914550781,
      "text": " Because this Shunammite woman,"
    },
    {
      "id": 170,
      "start": 457.4599914550781,
      "end": 459.3800048828125,
      "text": " that's introduced to us in verse number eight,"
    },
    {
      "id": 171,
      "start": 459.3800048828125,
      "end": 463.0199890136719,
      "text": " that she constrained him to eat bread."
    },
    {
      "id": 172,
      "start": 463.0199890136719,
      "end": 466.20001220703125,
      "text": " She was an individual that demonstrated care."
    },
    {
      "id": 173,
      "start": 466.20001220703125,
      "end": 467.9800109863281,
      "text": " She was a caring individual."
    },
    {
      "id": 174,
      "start": 467.9800109863281,
      "end": 471.17999267578125,
      "text": " In fact, Elisha says this in verse number 13."
    },
    {
      "id": 175,
      "start": 471.17999267578125,
      "end": 473.3800048828125,
      "text": " Notice the Bible says, and he said unto him,"
    },
    {
      "id": 176,
      "start": 473.3800048828125,
      "end": 477.5799865722656,
      "text": " to Gehazi, his servant, he says to say unto her,"
    },
    {
      "id": 177,
      "start": 477.5799865722656,
      "end": 482.5799865722656,
      "text": " this Shunammite woman, behold, thou hast been careful for us"
    },
    {
      "id": 178,
      "start": 483.4200134277344,
      "end": 487.6600036621094,
      "text": " with all this care."
    },
    {
      "id": 179,
      "start": 487.6600036621094,
      "end": 490.4800109863281,
      "text": " Begin to think about caring and being a caring individual,"
    },
    {
      "id": 180,
      "start": 490.4800109863281,
      "end": 492.739990234375,
      "text": " and we find here in the passage of scripture"
    },
    {
      "id": 181,
      "start": 492.739990234375,
      "end": 496.1600036621094,
      "text": " that no doubt the evidence is given to us"
    },
    {
      "id": 182,
      "start": 496.1600036621094,
      "end": 499.1600036621094,
      "text": " that she cared about Elisha."
    },
    {
      "id": 183,
      "start": 499.1600036621094,
      "end": 501.32000732421875,
      "text": " Though the text of scripture does not tell us,"
    },
    {
      "id": 184,
      "start": 501.32000732421875,
      "end": 503.8399963378906,
      "text": " I believe that she cared for her husband."
    },
    {
      "id": 185,
      "start": 503.8399963378906,
      "end": 506.1600036621094,
      "text": " As you look at verses eight through 11,"
    },
    {
      "id": 186,
      "start": 506.1600036621094,
      "end": 507.32000732421875,
      "text": " eight through 10, excuse me,"
    },
    {
      "id": 187,
      "start": 507.32000732421875,
      "end": 510.8399963378906,
      "text": " you find the interaction between this woman and her husband,"
    },
    {
      "id": 188,
      "start": 510.8599853515625,
      "end": 513.7000122070312,
      "text": " and I think that she had care for her husband,"
    },
    {
      "id": 189,
      "start": 513.7000122070312,
      "end": 518.0599975585938,
      "text": " and it then leads to having care for Elisha, the man of God,"
    },
    {
      "id": 190,
      "start": 518.0599975585938,
      "end": 521.9400024414062,
      "text": " and eventually would have care for her own son."
    },
    {
      "id": 191,
      "start": 521.9400024414062,
      "end": 524.5999755859375,
      "text": " She has no son at the beginning of the text of scripture."
    },
    {
      "id": 192,
      "start": 524.5999755859375,
      "end": 528.0999755859375,
      "text": " We're introduced to her as being this great woman,"
    },
    {
      "id": 193,
      "start": 528.0999755859375,
      "end": 530.4199829101562,
      "text": " this couple with no children,"
    },
    {
      "id": 194,
      "start": 530.4199829101562,
      "end": 532.6599731445312,
      "text": " but we find that Elisha makes the statement"
    },
    {
      "id": 195,
      "start": 532.6599731445312,
      "end": 537.0999755859375,
      "text": " in verse number 16 that thou shalt embrace a son."
    },
    {
      "id": 196,
      "start": 537.0999755859375,
      "end": 541.239990234375,
      "text": " We find that she did indeed have a child,"
    },
    {
      "id": 197,
      "start": 541.239990234375,
      "end": 542.6799926757812,
      "text": " and that child was grown,"
    },
    {
      "id": 198,
      "start": 542.6799926757812,
      "end": 545.2000122070312,
      "text": " as we read already in verses 18 and 19."
    },
    {
      "id": 199,
      "start": 546.3200073242188,
      "end": 547.7999877929688,
      "text": " We find that in verse number 20,"
    },
    {
      "id": 200,
      "start": 547.7999877929688,
      "end": 550.47998046875,
      "text": " the Bible says that after the servant"
    },
    {
      "id": 201,
      "start": 550.47998046875,
      "end": 553.9000244140625,
      "text": " had received the instruction to carry him to his mother,"
    },
    {
      "id": 202,
      "start": 553.9000244140625,
      "end": 555.8800048828125,
      "text": " after he's in the field there with his father,"
    },
    {
      "id": 203,
      "start": 555.8800048828125,
      "end": 557.5800170898438,
      "text": " and he says, my head, my head,"
    },
    {
      "id": 204,
      "start": 557.5800170898438,
      "end": 559.3200073242188,
      "text": " that it says that when he had taken him"
    },
    {
      "id": 205,
      "start": 559.3200073242188,
      "end": 561.280029296875,
      "text": " and brought him to his mother,"
    },
    {
      "id": 206,
      "start": 561.280029296875,
      "end": 566.280029296875,
      "text": " he sat on her knees till noon and then died."
    },
    {
      "id": 207,
      "start": 566.4199829101562,
      "end": 568.5800170898438,
      "text": " It's a sad verse of scripture as it ends,"
    },
    {
      "id": 208,
      "start": 568.5800170898438,
      "end": 570.739990234375,
      "text": " but I see her care for her son"
    },
    {
      "id": 209,
      "start": 570.739990234375,
      "end": 572.780029296875,
      "text": " as he would come in from the field,"
    },
    {
      "id": 210,
      "start": 572.780029296875,
      "end": 575.219970703125,
      "text": " and he's got this perhaps something,"
    },
    {
      "id": 211,
      "start": 575.219970703125,
      "end": 578.0800170898438,
      "text": " maybe heat stroke, some other injury maybe that took place,"
    },
    {
      "id": 212,
      "start": 578.0800170898438,
      "end": 582.02001953125,
      "text": " and he's cried out for his head while he's in the field,"
    },
    {
      "id": 213,
      "start": 582.02001953125,
      "end": 583.6199951171875,
      "text": " and he goes to the mom."
    },
    {
      "id": 214,
      "start": 583.6199951171875,
      "end": 586.3800048828125,
      "text": " The servant brings him to his mother,"
    },
    {
      "id": 215,
      "start": 586.3800048828125,
      "end": 589.9000244140625,
      "text": " and she, the Bible says, that he, that son,"
    },
    {
      "id": 216,
      "start": 589.9000244140625,
      "end": 594.02001953125,
      "text": " was there with his mother and sat on her knees till noon."
    },
    {
      "id": 217,
      "start": 594.02001953125,
      "end": 596.02001953125,
      "text": " Maybe some of you here this morning,"
    },
    {
      "id": 218,
      "start": 596.02001953125,
      "end": 600.5599975585938,
      "text": " you can remember as a child receiving the care on the knees."
    },
    {
      "id": 0,
      "start": 600.5599975585938,
      "end": 602.0599975585938,
      "text": " of your mother."
    },
    {
      "id": 1,
      "start": 602.0599975585938,
      "end": 607.8399977684021,
      "text": " And the reality is that God many times, and I know this morning that this is not, the"
    },
    {
      "id": 2,
      "start": 607.8399977684021,
      "end": 611.4799976348877,
      "text": " statements that I'll make this morning are not necessarily statements that are applicable"
    },
    {
      "id": 3,
      "start": 611.4799976348877,
      "end": 614.1399974822998,
      "text": " in every case, and I understand that."
    },
    {
      "id": 4,
      "start": 614.1399974822998,
      "end": 621.1999969482422,
      "text": " But many times God has equipped mothers to have that caring heart and to demonstrate"
    },
    {
      "id": 5,
      "start": 621.1999969482422,
      "end": 625.9199981689453,
      "text": " that care, and we see it here in this Shunammite woman."
    },
    {
      "id": 6,
      "start": 625.9199981689453,
      "end": 630.4799976348877,
      "text": " Not only do we see that she was caring, but number two, I note that she was generous."
    },
    {
      "id": 7,
      "start": 630.4799976348877,
      "end": 632.1199970245361,
      "text": " She was generous."
    },
    {
      "id": 8,
      "start": 632.1199970245361,
      "end": 635.9199981689453,
      "text": " You know, in our text of scripture, we see some evidence of this, but on the bulletin"
    },
    {
      "id": 9,
      "start": 635.9199981689453,
      "end": 640.439998626709,
      "text": " this morning, the Bible says who can find a virtuous woman for her price is far above"
    },
    {
      "id": 10,
      "start": 640.439998626709,
      "end": 643.9599990844727,
      "text": " rubies from Proverbs 31 and verse number 10."
    },
    {
      "id": 11,
      "start": 643.9599990844727,
      "end": 647.7599983215332,
      "text": " The only woman called virtuous throughout all of the scripture is actually Ruth."
    },
    {
      "id": 12,
      "start": 647.7599983215332,
      "end": 649.9999961853027,
      "text": " You find it in the book of Ruth."
    },
    {
      "id": 13,
      "start": 649.9999961853027,
      "end": 655.879997253418,
      "text": " But you'll find here that as we look through Proverbs 31 with regard to generosity that"
    },
    {
      "id": 14,
      "start": 655.879997253418,
      "end": 661.6399993896484,
      "text": " is described in that text of scripture, that you'll see in 2 Kings chapter number 4 a lady"
    },
    {
      "id": 15,
      "start": 661.6399993896484,
      "end": 663.5199966430664,
      "text": " that was generous."
    },
    {
      "id": 16,
      "start": 663.5199966430664,
      "end": 668.2399978637695,
      "text": " The Bible tells us, we've noted already in verse number 8 with regard to the provision"
    },
    {
      "id": 17,
      "start": 668.2399978637695,
      "end": 673.3600006103516,
      "text": " for the man of God, that she constrained him to eat bread."
    },
    {
      "id": 18,
      "start": 673.3600006103516,
      "end": 679.4799957275391,
      "text": " The Bible says, so it was that as oft as he passed by, he turned in thither to eat bread."
    },
    {
      "id": 19,
      "start": 679.4799957275391,
      "end": 684.5199966430664,
      "text": " Now we find that the Bible tells us that he passed that way regularly, and so this was"
    },
    {
      "id": 20,
      "start": 684.5199966430664,
      "end": 686.4199981689453,
      "text": " not just a one-time occurrence."
    },
    {
      "id": 21,
      "start": 686.4199981689453,
      "end": 689.879997253418,
      "text": " This was a regular occurrence, and she constrained him."
    },
    {
      "id": 22,
      "start": 689.879997253418,
      "end": 695.1999969482422,
      "text": " She was generous with her resources, constrained him to eat bread, and as oft as he passed"
    },
    {
      "id": 23,
      "start": 695.1999969482422,
      "end": 698.5199966430664,
      "text": " by, he turned in thither to eat bread."
    },
    {
      "id": 24,
      "start": 698.5199966430664,
      "end": 700.4399948120117,
      "text": " Her generosity does not stop there."
    },
    {
      "id": 25,
      "start": 700.4399948120117,
      "end": 705.1199951171875,
      "text": " We find that as we've read in verses 9 and 10, that she has this perception."
    },
    {
      "id": 26,
      "start": 705.1199951171875,
      "end": 706.6399993896484,
      "text": " She's a spiritual lady."
    },
    {
      "id": 27,
      "start": 706.6399993896484,
      "end": 714.5599975585938,
      "text": " She has this perception, and she says to her husband, this is a holy man of God."
    },
    {
      "id": 28,
      "start": 714.5599975585938,
      "end": 719.5599975585938,
      "text": " And she has this understanding of who the prophet of God is, Elisha, and notice what"
    },
    {
      "id": 29,
      "start": 719.5599975585938,
      "end": 724.879997253418,
      "text": " she makes this request in verse number 10, let us make a little chamber."
    },
    {
      "id": 30,
      "start": 724.879997253418,
      "end": 730.239990234375,
      "text": " We find that really the idea of a prophet's chamber, we refer to that still to this very"
    },
    {
      "id": 31,
      "start": 730.239990234375,
      "end": 732.6199951171875,
      "text": " day of using that phraseology."
    },
    {
      "id": 32,
      "start": 732.6199951171875,
      "end": 737.739990234375,
      "text": " When we built the parsonage, we put in the basement a prophet's chamber area so that"
    },
    {
      "id": 33,
      "start": 737.739990234375,
      "end": 742.0599975585938,
      "text": " those that are traveling, missionaries and evangelists, would have the opportunity to"
    },
    {
      "id": 34,
      "start": 742.0599975585938,
      "end": 747.8999938964844,
      "text": " have a place where they could stay and have some refreshment time and what have you."
    },
    {
      "id": 35,
      "start": 747.8999938964844,
      "end": 753.7799987792969,
      "text": " And so we find that she makes this request with regard to putting this prophet's chamber,"
    },
    {
      "id": 36,
      "start": 753.7799987792969,
      "end": 755.0800018310547,
      "text": " this little chamber."
    },
    {
      "id": 37,
      "start": 755.0800018310547,
      "end": 762.9199981689453,
      "text": " She says, let us set for him there a bed, and a table, and a stool, and a candlestick."
    },
    {
      "id": 38,
      "start": 762.9199981689453,
      "end": 769.3600006103516,
      "text": " And it shall be, notice the end of the verse, when he cometh to us, that he shall turn in"
    },
    {
      "id": 39,
      "start": 769.3600006103516,
      "end": 771.239990234375,
      "text": " thither."
    },
    {
      "id": 40,
      "start": 771.239990234375,
      "end": 772.239990234375,
      "text": " She was generous."
    },
    {
      "id": 41,
      "start": 772.239990234375,
      "end": 776.9199981689453,
      "text": " It wasn't an opportunity that she was going to allow to pass by."
    },
    {
      "id": 42,
      "start": 776.9199981689453,
      "end": 782.8800048828125,
      "text": " She wanted to seize the opportunity that was before her, and though there's, as we look"
    },
    {
      "id": 43,
      "start": 782.8800048828125,
      "end": 789.239990234375,
      "text": " at this text of scripture, this desire to be a blessing to the man of God, we find that"
    },
    {
      "id": 44,
      "start": 789.239990234375,
      "end": 794.4799957275391,
      "text": " because of this, it resulted in the fact that Elisha would stay there."
    },
    {
      "id": 45,
      "start": 794.4799957275391,
      "end": 800.5200042724609,
      "text": " That Elisha, as often as he would pass through that region, as he would travel throughout"
    },
    {
      "id": 46,
      "start": 800.5200042724609,
      "end": 807.3199920654297,
      "text": " the land of Israel, that he would come through and he would have a place where he could rest."
    },
    {
      "id": 47,
      "start": 807.3199920654297,
      "end": 809.6799926757812,
      "text": " He would have a place of provision."
    },
    {
      "id": 48,
      "start": 809.6799926757812,
      "end": 814.5999908447266,
      "text": " It was because of the generosity of this woman in Shunem."
    },
    {
      "id": 49,
      "start": 814.5999908447266,
      "end": 819.7200012207031,
      "text": " We find that the Bible would tell us with regard to opportunities and the reality that"
    },
    {
      "id": 50,
      "start": 819.7200012207031,
      "end": 823.8800048828125,
      "text": " we're to do good as we have opportunity to do so."
    },
    {
      "id": 51,
      "start": 823.8800048828125,
      "end": 827.0,
      "text": " In Galatians chapter number six, hold your place there, and I want you to see what the"
    },
    {
      "id": 52,
      "start": 827.0,
      "end": 828.3600006103516,
      "text": " Bible tells us."
    },
    {
      "id": 53,
      "start": 828.3600006103516,
      "end": 834.1600036621094,
      "text": " In Galatians chapter number six, God gives us instruction, and we ought to be looking"
    },
    {
      "id": 54,
      "start": 834.1600036621094,
      "end": 835.1600036621094,
      "text": " for opportunities."
    },
    {
      "id": 55,
      "start": 835.1600036621094,
      "end": 842.3999938964844,
      "text": " We ought to be looking for opportunities to do good, to be generous, to be giving."
    },
    {
      "id": 56,
      "start": 842.3999938964844,
      "end": 847.8000030517578,
      "text": " We find that the Bible tells us in Galatians six and verse number nine, and let us not"
    },
    {
      "id": 57,
      "start": 847.8000030517578,
      "end": 854.8000030517578,
      "text": " be weary in well-doing, for in due season we shall reap if we faint not."
    },
    {
      "id": 58,
      "start": 854.8000030517578,
      "end": 864.0,
      "text": " Then notice verse number 10, as we have therefore opportunity, let us do good unto all men,"
    },
    {
      "id": 59,
      "start": 864.0,
      "end": 870.5199890136719,
      "text": " especially unto them who are of the household of faith."
    },
    {
      "id": 60,
      "start": 870.5199890136719,
      "end": 877.1199951171875,
      "text": " Though Galatians six was not written at the time of the ministry of Elisha, this lady"
    },
    {
      "id": 61,
      "start": 877.1199951171875,
      "end": 883.1600036621094,
      "text": " in Shunem did not have a copy of the book of Galatians, the opportunity presented itself"
    },
    {
      "id": 62,
      "start": 883.1600036621094,
      "end": 886.760009765625,
      "text": " to her, and she seized the opportunity."
    },
    {
      "id": 63,
      "start": 886.760009765625,
      "end": 892.2000122070312,
      "text": " She had the opportunity to do something for the man of God, and she goes to her husband"
    },
    {
      "id": 64,
      "start": 892.2000122070312,
      "end": 898.0599975585938,
      "text": " and she says, let us do this, let's be generous, let's be hospitable."
    },
    {
      "id": 65,
      "start": 898.0599975585938,
      "end": 903.3599853515625,
      "text": " And what a blessing, again, as we think about the man of God, Elisha, traveling, and I want"
    },
    {
      "id": 66,
      "start": 903.3599853515625,
      "end": 908.6799926757812,
      "text": " you to understand that not only would it be a blessing to Elisha because of her generosity,"
    },
    {
      "id": 67,
      "start": 908.6799926757812,
      "end": 913.6799926757812,
      "text": " but understand the way in which it would return to her and her family, because why?"
    },
    {
      "id": 68,
      "start": 913.6799926757812,
      "end": 920.8399963378906,
      "text": " Well, the man of God is there, and to have the privilege of having the man of God as"
    },
    {
      "id": 69,
      "start": 920.8800048828125,
      "end": 926.3999938964844,
      "text": " he would travel through to be at their place, at their residence, would be a tremendous"
    },
    {
      "id": 70,
      "start": 926.3999938964844,
      "end": 928.3599853515625,
      "text": " blessing and opportunity."
    },
    {
      "id": 71,
      "start": 928.3599853515625,
      "end": 933.5599975585938,
      "text": " We've had the privilege, and I know that some of you have as well, over your time of serving"
    },
    {
      "id": 72,
      "start": 933.5599975585938,
      "end": 939.3200073242188,
      "text": " the Lord, to have meals with servants of the Lord, to have opportunities, perhaps, to have"
    },
    {
      "id": 73,
      "start": 939.3200073242188,
      "end": 941.8399963378906,
      "text": " servants of the Lord stay in your home."
    },
    {
      "id": 74,
      "start": 941.8399963378906,
      "end": 946.4599914550781,
      "text": " Of course, with the Prophets Chamber, we have opportunity regularly to have missionaries"
    },
    {
      "id": 75,
      "start": 946.4599914550781,
      "end": 951.739990234375,
      "text": " and evangelists stay in our home, and the opportunities of fellowship and the opportunities"
    },
    {
      "id": 76,
      "start": 951.739990234375,
      "end": 958.3399963378906,
      "text": " of being able to be a blessing, I mean, they just abound, and it's such a privilege and"
    },
    {
      "id": 77,
      "start": 958.3399963378906,
      "end": 959.6199951171875,
      "text": " such a blessing."
    },
    {
      "id": 78,
      "start": 959.6199951171875,
      "end": 965.9400024414062,
      "text": " I remember, I think back to the opportunity when we first connected with Brother Dan Hummel,"
    },
    {
      "id": 79,
      "start": 965.9400024414062,
      "end": 970.9800109863281,
      "text": " and of course, you know, our church is familiar with Beacon of Truth, and we do a lot with"
    },
    {
      "id": 80,
      "start": 970.9800109863281,
      "end": 977.1799926757812,
      "text": " them, and we had the opportunity at this point, about 15 years ago, to first meet Brother"
    },
    {
      "id": 81,
      "start": 977.1799926757812,
      "end": 982.0599975585938,
      "text": " Hummel, and it was at our church when we were in Pennsylvania, we were members of the church,"
    },
    {
      "id": 82,
      "start": 982.0599975585938,
      "end": 987.8200073242188,
      "text": " working a full-time job, had three little kids, and two, four, and six, I mean, we understand"
    },
    {
      "id": 83,
      "start": 987.8200073242188,
      "end": 992.0599975585938,
      "text": " what it was to be busy and to have schedules and all over the place and what have you,"
    },
    {
      "id": 84,
      "start": 992.0599975585938,
      "end": 997.0199890136719,
      "text": " but our church had a scripture assembly ministry, and it was in the evenings, and I remember"
    },
    {
      "id": 85,
      "start": 997.0199890136719,
      "end": 1001.4199829101562,
      "text": " Dan Hummel standing up, we'd never heard about it before, and he stood up and he tore"
    },
    {
      "id": 86,
      "start": 1001.4199829101562,
      "end": 1006.8599853515625,
      "text": " one of the scriptures apart and showed how it gets assembled and showed the whole process,"
    },
    {
      "id": 87,
      "start": 1006.8599853515625,
      "end": 1012.0199890136719,
      "text": " and he said this, he said, anybody that's here can do something with this scripture"
    },
    {
      "id": 88,
      "start": 1012.0199890136719,
      "end": 1013.0199890136719,
      "text": " assembly."
    },
    {
      "id": 89,
      "start": 1013.0199890136719,
      "end": 1014.9800109863281,
      "text": " It was the first time our church had ever done it."
    },
    {
      "id": 90,
      "start": 1014.9800109863281,
      "end": 1021.5,
      "text": " He said, from the youngest to the oldest, somebody can do some job during the scripture"
    },
    {
      "id": 91,
      "start": 1021.5,
      "end": 1026.1000061035156,
      "text": " assembly, and so we had three little kids, as I mentioned already, and Joseph was just"
    },
    {
      "id": 92,
      "start": 1026.1799926757812,
      "end": 1032.2200012207031,
      "text": " about two years old, just a little tot of a kid, and we thought, well, I guess he said"
    },
    {
      "id": 93,
      "start": 1032.2200012207031,
      "end": 1036.260009765625,
      "text": " everyone can do it, and so Holly and I talked, and we said, we're gonna go, and we went."
    },
    {
      "id": 94,
      "start": 1036.260009765625,
      "end": 1040.5799865722656,
      "text": " We were there each night of that assembly, and our kids did serve, they got involved,"
    },
    {
      "id": 95,
      "start": 1040.5799865722656,
      "end": 1045.5799865722656,
      "text": " but God allowed us, and Holly and I had the opportunity to chat, and we were able to take"
    },
    {
      "id": 96,
      "start": 1045.5799865722656,
      "end": 1050.2200012207031,
      "text": " Brother Hummel out and his wife and the team that was with them, it was a different group,"
    },
    {
      "id": 97,
      "start": 1050.2200012207031,
      "end": 1053.9400024414062,
      "text": " it wasn't Dan and Donna Stroop, it was a different couple, and we were able to take them out"
    },
    {
      "id": 98,
      "start": 1053.9400024414062,
      "end": 1058.9400024414062,
      "text": " for dinner after one of the assemblies, and we were just able to go out to pizza, it was"
    },
    {
      "id": 99,
      "start": 1058.9400024414062,
      "end": 1063.260009765625,
      "text": " late, of course, work and school the next morning and all those things, it was gonna"
    },
    {
      "id": 100,
      "start": 1063.260009765625,
      "end": 1069.7000122070312,
      "text": " be a late night, but at that place, through having that opportunity, God allowed our hearts"
    },
    {
      "id": 101,
      "start": 1069.7000122070312,
      "end": 1075.6000061035156,
      "text": " to be knit together, and we had such a blessed opportunity, and now I think about all these"
    },
    {
      "id": 102,
      "start": 1075.6000061035156,
      "end": 1081.8200073242188,
      "text": " years later, and to see the blessing of that, listen, as God would give you opportunity,"
    },
    {
      "id": 103,
      "start": 1081.8200073242188,
      "end": 1087.3399963378906,
      "text": " just as God gave this lady, this Shunammite woman is referred to her as this opportunity,"
    },
    {
      "id": 104,
      "start": 1087.3399963378906,
      "end": 1091.5400085449219,
      "text": " she seized it, she was generous, and God blessed."
    },
    {
      "id": 105,
      "start": 1091.5400085449219,
      "end": 1097.1000061035156,
      "text": " I want you to notice, as we continue to read, in verse number 11, it says, and it fell on"
    },
    {
      "id": 106,
      "start": 1097.1000061035156,
      "end": 1105.0400085449219,
      "text": " a day that he, Elisha, came thither, and he turned into the chamber and lay there."
    },
    {
      "id": 107,
      "start": 1105.0400085449219,
      "end": 1110.739990234375,
      "text": " So he took advantage of the prophet's chamber that was made available as he traveled through."
    },
    {
      "id": 108,
      "start": 1110.739990234375,
      "end": 1116.260009765625,
      "text": " The Bible says in verse number 12 that he said to Gehazi, his servant, call the Shunammite."
    },
    {
      "id": 109,
      "start": 1116.260009765625,
      "end": 1119.5,
      "text": " When he had called her, she stood before him."
    },
    {
      "id": 110,
      "start": 1119.5,
      "end": 1123.97998046875,
      "text": " Number three, if you're taking notes this morning, we notice not only that she was caring"
    },
    {
      "id": 111,
      "start": 1123.97998046875,
      "end": 1128.719970703125,
      "text": " and generous, but we notice number three, she was content."
    },
    {
      "id": 112,
      "start": 1128.719970703125,
      "end": 1129.719970703125,
      "text": " She was content."
    },
    {
      "id": 113,
      "start": 1129.719970703125,
      "end": 1131.3800048828125,
      "text": " Notice what the Bible says."
    },
    {
      "id": 114,
      "start": 1131.3800048828125,
      "end": 1134.9400024414062,
      "text": " She stood before him at the end of verse number 12, and in verse 13, it says that he said"
    },
    {
      "id": 115,
      "start": 1134.9400024414062,
      "end": 1144.7000122070312,
      "text": " unto him, so Elisha says to Gehazi, say now unto her, behold, thou hast been careful for"
    },
    {
      "id": 116,
      "start": 1144.7000122070312,
      "end": 1156.2999877929688,
      "text": " us with all this care, and then notice this question, what is to be done for thee?"
    },
    {
      "id": 117,
      "start": 1156.2999877929688,
      "end": 1164.4199829101562,
      "text": " What is thou be spoken for to the king or to the captain of the host?"
    },
    {
      "id": 118,
      "start": 1164.4199829101562,
      "end": 1172.739990234375,
      "text": " What a great opportunity that is given to her as Elisha says to Gehazi, I will speak"
    },
    {
      "id": 119,
      "start": 1172.739990234375,
      "end": 1173.739990234375,
      "text": " on your behalf."
    },
    {
      "id": 120,
      "start": 1173.739990234375,
      "end": 1176.6400146484375,
      "text": " You have been so caring for us."
    },
    {
      "id": 121,
      "start": 1176.6400146484375,
      "end": 1179.6599731445312,
      "text": " What is it to be done for thee?"
    },
    {
      "id": 122,
      "start": 1179.6599731445312,
      "end": 1186.1400146484375,
      "text": " Would you like us to stand before the king and speak for you or to the captain, the host?"
    },
    {
      "id": 123,
      "start": 1186.1400146484375,
      "end": 1190.739990234375,
      "text": " And notice her answer, I dwell among mine own people."
    },
    {
      "id": 124,
      "start": 1190.739990234375,
      "end": 1191.739990234375,
      "text": " She was content."
    },
    {
      "id": 125,
      "start": 1191.739990234375,
      "end": 1192.739990234375,
      "text": " She was content."
    },
    {
      "id": 126,
      "start": 1193.4600219726562,
      "end": 1199.219970703125,
      "text": " She said, I dwell among my own people, and he said, what then is to be done for her?"
    },
    {
      "id": 127,
      "start": 1199.219970703125,
      "end": 1200.1799926757812,
      "text": " You see the heart of..."
    },
    {
      "id": 0,
      "start": 1200.1799926757812,
      "end": 1206.5199928283691,
      "text": " Elisha desiring to give and to be a blessing to this lady that had been so caring for him"
    },
    {
      "id": 1,
      "start": 1206.5199928283691,
      "end": 1212.1199922561646,
      "text": " and provided not only the bread, but also the dwelling place in that prophet's chamber."
    },
    {
      "id": 2,
      "start": 1212.1199922561646,
      "end": 1215.3799924850464,
      "text": " And Gehazi answered in verse number 14, and he said,"
    },
    {
      "id": 3,
      "start": 1215.3799924850464,
      "end": 1221.3799934387207,
      "text": " Verily she hath no child, and her husband is old."
    },
    {
      "id": 4,
      "start": 1221.3799934387207,
      "end": 1226.5399932861328,
      "text": " We find that though she was in this particular place of barrenness, that she did not seem"
    },
    {
      "id": 5,
      "start": 1226.5399932861328,
      "end": 1227.859992980957,
      "text": " to be bitter by it."
    },
    {
      "id": 6,
      "start": 1227.859992980957,
      "end": 1228.859992980957,
      "text": " She was content."
    },
    {
      "id": 7,
      "start": 1229.3399925231934,
      "end": 1233.9399909973145,
      "text": " In fact, it says that he said, call her, and when he had called her, she stood in the door."
    },
    {
      "id": 8,
      "start": 1233.9399909973145,
      "end": 1234.9399909973145,
      "text": " In verse 16, he said,"
    },
    {
      "id": 9,
      "start": 1234.9399909973145,
      "end": 1243.0599937438965,
      "text": " About this season, according to the time of life, thou shalt embrace a son."
    },
    {
      "id": 10,
      "start": 1243.0599937438965,
      "end": 1244.9399909973145,
      "text": " Can you imagine her hearing these words?"
    },
    {
      "id": 11,
      "start": 1244.9399909973145,
      "end": 1248.9399909973145,
      "text": " She knew, the Bible tells us already, that she said to her husband in verse number nine,"
    },
    {
      "id": 12,
      "start": 1248.9399909973145,
      "end": 1253.3399925231934,
      "text": " I perceive that this is an holy man of God."
    },
    {
      "id": 13,
      "start": 1253.3399925231934,
      "end": 1259.5399932861328,
      "text": " His ministry is going forth and he's traveling to and fro, and no doubt as we understand"
    },
    {
      "id": 14,
      "start": 1259.5399932861328,
      "end": 1264.0199928283691,
      "text": " and we're familiar with the life and ministry of Elisha, there's miracles that are taking"
    },
    {
      "id": 15,
      "start": 1264.0199928283691,
      "end": 1270.739990234375,
      "text": " place and we find that on that day that he's there and he says to her, she's called back"
    },
    {
      "id": 16,
      "start": 1270.739990234375,
      "end": 1277.739990234375,
      "text": " into the presence, about this season, according to the time of life, thou shalt embrace a"
    },
    {
      "id": 17,
      "start": 1277.739990234375,
      "end": 1279.859992980957,
      "text": " son."
    },
    {
      "id": 18,
      "start": 1279.859992980957,
      "end": 1281.9199905395508,
      "text": " She had no child."
    },
    {
      "id": 19,
      "start": 1281.9199905395508,
      "end": 1286.9599914550781,
      "text": " Not only had no child, but her husband was old, according to verse number 14."
    },
    {
      "id": 20,
      "start": 1286.9599914550781,
      "end": 1289.9599914550781,
      "text": " And she says in verse number 16, at the end of the verse,"
    },
    {
      "id": 21,
      "start": 1289.9599914550781,
      "end": 1294.7999954223633,
      "text": " Nay, my Lord, thou man of God, do not lie unto thine handmaid."
    },
    {
      "id": 22,
      "start": 1294.7999954223633,
      "end": 1299.5599899291992,
      "text": " It was almost beyond her ability to believe what had just been declared because she'd"
    },
    {
      "id": 23,
      "start": 1299.5599899291992,
      "end": 1304.7999954223633,
      "text": " known the circumstances that she had dealt with, but I believe that she was content not"
    },
    {
      "id": 24,
      "start": 1304.7999954223633,
      "end": 1310.1599960327148,
      "text": " only by her answer when it was asked, what is to be done for thee, that she says, I dwell"
    },
    {
      "id": 25,
      "start": 1310.1599960327148,
      "end": 1316.1199951171875,
      "text": " among mine own people, but even in the situation there with having no children, it seems as"
    },
    {
      "id": 26,
      "start": 1316.1199951171875,
      "end": 1320.6999893188477,
      "text": " if this Sunamite woman was a content individual."
    },
    {
      "id": 27,
      "start": 1320.6999893188477,
      "end": 1325.639991760254,
      "text": " She did not serve so that she could get something."
    },
    {
      "id": 28,
      "start": 1325.639991760254,
      "end": 1331.759994506836,
      "text": " She did not perceive that Elisha was a man of God and that Elisha was a prophet of God"
    },
    {
      "id": 29,
      "start": 1331.759994506836,
      "end": 1335.4399871826172,
      "text": " and that we're going to be generous and we're going to have him here so that we can get"
    },
    {
      "id": 30,
      "start": 1335.4399871826172,
      "end": 1336.4399871826172,
      "text": " something."
    },
    {
      "id": 31,
      "start": 1337.0399932861328,
      "end": 1341.239990234375,
      "text": " See, that's not the motive for giving and for serving."
    },
    {
      "id": 32,
      "start": 1341.239990234375,
      "end": 1345.4399871826172,
      "text": " We're content in what God has given to us and the opportunities that he has given to"
    },
    {
      "id": 33,
      "start": 1345.4399871826172,
      "end": 1349.8799896240234,
      "text": " us and the blessings that he will allow in our lives."
    },
    {
      "id": 34,
      "start": 1349.8799896240234,
      "end": 1354.1999969482422,
      "text": " See if our motive for serving, God knows our motives, by the way, if our motive for serving"
    },
    {
      "id": 35,
      "start": 1354.1999969482422,
      "end": 1358.4399871826172,
      "text": " is so that I might get something out of it, then we have a wrong motive."
    },
    {
      "id": 36,
      "start": 1358.4399871826172,
      "end": 1363.3599853515625,
      "text": " We have a selfish motive and we find that God does not bless that."
    },
    {
      "id": 37,
      "start": 1363.3599853515625,
      "end": 1368.3399963378906,
      "text": " We live in a society today, in fact, many times, though it's not publicly known because"
    },
    {
      "id": 38,
      "start": 1368.3399963378906,
      "end": 1373.0,
      "text": " of legal ramifications and what have you, but many people say, well, I'll do this for"
    },
    {
      "id": 39,
      "start": 1373.0,
      "end": 1375.479995727539,
      "text": " you if you do this for me."
    },
    {
      "id": 40,
      "start": 1375.479995727539,
      "end": 1379.7999877929688,
      "text": " And that's the way often things work in a society."
    },
    {
      "id": 41,
      "start": 1379.7999877929688,
      "end": 1384.1599884033203,
      "text": " But here, this Sunamite woman, she was content."
    },
    {
      "id": 42,
      "start": 1384.1599884033203,
      "end": 1386.4399871826172,
      "text": " She did not serve so that she could get something."
    },
    {
      "id": 43,
      "start": 1386.4399871826172,
      "end": 1387.4399871826172,
      "text": " She was content."
    },
    {
      "id": 44,
      "start": 1387.4399871826172,
      "end": 1390.3599853515625,
      "text": " You know, contentment is a great thing."
    },
    {
      "id": 45,
      "start": 1390.3599853515625,
      "end": 1395.5999908447266,
      "text": " Many people in our society today are living lives of discontentment."
    },
    {
      "id": 46,
      "start": 1395.5999908447266,
      "end": 1399.9599914550781,
      "text": " We think of the society in which we live in and we think that if I could just have more,"
    },
    {
      "id": 47,
      "start": 1399.9599914550781,
      "end": 1405.0399932861328,
      "text": " if I could just have this, if I could just, then I would be content."
    },
    {
      "id": 48,
      "start": 1405.0399932861328,
      "end": 1409.219985961914,
      "text": " The reality is that there were surveys done at this point, they're years ago when these"
    },
    {
      "id": 49,
      "start": 1409.219985961914,
      "end": 1415.4399871826172,
      "text": " surveys were done, but they surveyed a group of people across every spectrum of income"
    },
    {
      "id": 50,
      "start": 1415.4399871826172,
      "end": 1417.1199951171875,
      "text": " level."
    },
    {
      "id": 51,
      "start": 1417.1199951171875,
      "end": 1423.0,
      "text": " From the lowest income level to the highest, they just went through, they started, I think,"
    },
    {
      "id": 52,
      "start": 1423.0,
      "end": 1427.759994506836,
      "text": " at $25,000 a year and they went up to like $250,000 a year and just looked at that category"
    },
    {
      "id": 53,
      "start": 1427.759994506836,
      "end": 1430.3999938964844,
      "text": " of people and that income area."
    },
    {
      "id": 54,
      "start": 1430.3999938964844,
      "end": 1437.1999969482422,
      "text": " And they went through and they gave, and they said, how much more would you need to be content?"
    },
    {
      "id": 55,
      "start": 1437.1999969482422,
      "end": 1441.8399963378906,
      "text": " You know, it was consistent that each earner in each of those categories said, you know,"
    },
    {
      "id": 56,
      "start": 1441.8399963378906,
      "end": 1446.239990234375,
      "text": " if I could just have $10,000 more, I'd be, I'd be okay."
    },
    {
      "id": 57,
      "start": 1446.3599853515625,
      "end": 1450.8799896240234,
      "text": " And that's what the one in the lowest income said and the one in the $250,000 income, they"
    },
    {
      "id": 58,
      "start": 1450.8799896240234,
      "end": 1452.6799926757812,
      "text": " all said the same thing."
    },
    {
      "id": 59,
      "start": 1452.6799926757812,
      "end": 1456.0,
      "text": " There were options for them to select and it's, it's interesting."
    },
    {
      "id": 60,
      "start": 1456.0,
      "end": 1463.3599853515625,
      "text": " We live in a society that, that really is designed to make you discontent."
    },
    {
      "id": 61,
      "start": 1463.3599853515625,
      "end": 1468.6000061035156,
      "text": " We live in a midst of a generation of marketing and all sorts of things that, that really"
    },
    {
      "id": 62,
      "start": 1468.6000061035156,
      "end": 1472.239990234375,
      "text": " the enemy wants you to be discontent."
    },
    {
      "id": 63,
      "start": 1472.239990234375,
      "end": 1475.5599975585938,
      "text": " But I want you to look at Philippians chapter number four."
    },
    {
      "id": 64,
      "start": 1475.5599975585938,
      "end": 1480.3999938964844,
      "text": " As I think about the, the Shunammite woman and I think about her contentment as we see"
    },
    {
      "id": 65,
      "start": 1480.3999938964844,
      "end": 1485.5599975585938,
      "text": " in this passage of Scripture, I want to encourage you this morning to be content."
    },
    {
      "id": 66,
      "start": 1485.5599975585938,
      "end": 1489.6399841308594,
      "text": " We find that in Philippians chapter number four, Paul is writing, and many of us would"
    },
    {
      "id": 67,
      "start": 1489.6399841308594,
      "end": 1492.8800048828125,
      "text": " be familiar with the fact that he's writing this church in Philippi and he's writing from"
    },
    {
      "id": 68,
      "start": 1492.8800048828125,
      "end": 1493.8800048828125,
      "text": " prison."
    },
    {
      "id": 69,
      "start": 1493.8800048828125,
      "end": 1499.5199890136719,
      "text": " It was in the church, it was there in Philippi, in the city of Philippi where he was imprisoned"
    },
    {
      "id": 70,
      "start": 1499.5199890136719,
      "end": 1505.7999877929688,
      "text": " really when that church got a great start and he was ministering there."
    },
    {
      "id": 71,
      "start": 1505.7999877929688,
      "end": 1509.4400024414062,
      "text": " Now many years later, he's writing back to this church under the inspiration of the Holy"
    },
    {
      "id": 72,
      "start": 1509.4400024414062,
      "end": 1511.5599975585938,
      "text": " Spirit of God from prison."
    },
    {
      "id": 73,
      "start": 1511.5599975585938,
      "end": 1517.7599792480469,
      "text": " And he says in verse number 10, but I rejoiced in the Lord greatly that now at the last your"
    },
    {
      "id": 74,
      "start": 1517.7599792480469,
      "end": 1526.9199829101562,
      "text": " care of me hath flourished again, wherein ye were also careful, but you lacked opportunity."
    },
    {
      "id": 75,
      "start": 1526.9199829101562,
      "end": 1530.7200012207031,
      "text": " And we understand even as we've looked at some of these thoughts already of being caring"
    },
    {
      "id": 76,
      "start": 1530.7200012207031,
      "end": 1535.1999816894531,
      "text": " and generous and content, we see some of this here even in this verse of Scripture."
    },
    {
      "id": 77,
      "start": 1535.1999816894531,
      "end": 1539.6399841308594,
      "text": " In verse number 11, notice what Paul says, not that I speak in respect of want, then"
    },
    {
      "id": 78,
      "start": 1539.6399841308594,
      "end": 1548.5599975585938,
      "text": " notice the statement, for I have learned in whatsoever state I am therewith to be content."
    },
    {
      "id": 79,
      "start": 1548.5599975585938,
      "end": 1554.7599792480469,
      "text": " I know both how to, how to be abased and I know how to abound everywhere and in all things"
    },
    {
      "id": 80,
      "start": 1554.7599792480469,
      "end": 1559.6399841308594,
      "text": " I am instructed both to be full and to be hungry, both to abound and to suffer need."
    },
    {
      "id": 81,
      "start": 1559.6399841308594,
      "end": 1565.6799926757812,
      "text": " I can do all things through Christ which strengtheneth me."
    },
    {
      "id": 82,
      "start": 1565.6799926757812,
      "end": 1571.0,
      "text": " I've often said to individuals and I've said publicly from this pulpit that I cannot say"
    },
    {
      "id": 83,
      "start": 1571.0,
      "end": 1575.7999877929688,
      "text": " as Paul said in verse number 11 that I have learned in whatsoever state I am therewith"
    },
    {
      "id": 84,
      "start": 1575.7999877929688,
      "end": 1577.7200012207031,
      "text": " to be content."
    },
    {
      "id": 85,
      "start": 1577.7200012207031,
      "end": 1584.7200012207031,
      "text": " I'm trying to learn, I am learning in whatsoever state I am therewith to be content."
    },
    {
      "id": 86,
      "start": 1584.7200012207031,
      "end": 1588.9199829101562,
      "text": " Maybe you're here this morning and you have the ability to say as Paul said, I have learned,"
    },
    {
      "id": 87,
      "start": 1588.9199829101562,
      "end": 1592.7200012207031,
      "text": " I am content no matter what the circumstances are."
    },
    {
      "id": 88,
      "start": 1592.7200012207031,
      "end": 1597.9199829101562,
      "text": " But the reality is that as we grow in Christ, as we draw closer to the Lord, that we're"
    },
    {
      "id": 89,
      "start": 1597.9199829101562,
      "end": 1604.7200012207031,
      "text": " learning that subject of contentment, that disposition, that understanding that my God"
    },
    {
      "id": 90,
      "start": 1604.7200012207031,
      "end": 1607.6000061035156,
      "text": " shall supply all our need."
    },
    {
      "id": 91,
      "start": 1607.6000061035156,
      "end": 1613.0599975585938,
      "text": " And he says that later on in this text of Scripture in verse number 19, and what a blessing"
    },
    {
      "id": 92,
      "start": 1613.1000061035156,
      "end": 1620.1000061035156,
      "text": " to consider that God is the one that can supply everything and he teaches us to be content,"
    },
    {
      "id": 93,
      "start": 1620.9400024414062,
      "end": 1622.4199829101562,
      "text": " to be content."
    },
    {
      "id": 94,
      "start": 1622.4199829101562,
      "end": 1625.97998046875,
      "text": " So many people today, they're not content with where they are in life."
    },
    {
      "id": 95,
      "start": 1625.97998046875,
      "end": 1630.4199829101562,
      "text": " They're chasing this and they're chasing that and they think if they could have that, that"
    },
    {
      "id": 96,
      "start": 1630.4199829101562,
      "end": 1631.8999938964844,
      "text": " it would just allow them to be content."
    },
    {
      "id": 97,
      "start": 1631.8999938964844,
      "end": 1637.6600036621094,
      "text": " I'm going to tell you this morning that you need to learn to be content where you are."
    },
    {
      "id": 98,
      "start": 1637.6600036621094,
      "end": 1639.3800048828125,
      "text": " Learning contentment."
    },
    {
      "id": 99,
      "start": 1639.3800048828125,
      "end": 1640.4199829101562,
      "text": " God is in control."
    },
    {
      "id": 100,
      "start": 1640.4199829101562,
      "end": 1641.3800048828125,
      "text": " God has a plan."
    },
    {
      "id": 101,
      "start": 1641.4199829101562,
      "end": 1646.3800048828125,
      "text": " God has a purpose and God gives us exactly what it is that we need."
    },
    {
      "id": 102,
      "start": 1646.3800048828125,
      "end": 1650.2599792480469,
      "text": " She was caring, she was generous, she was content back in 2 Kings chapter number 4,"
    },
    {
      "id": 103,
      "start": 1650.2599792480469,
      "end": 1651.6999816894531,
      "text": " number 4."
    },
    {
      "id": 104,
      "start": 1651.6999816894531,
      "end": 1654.0599975585938,
      "text": " She was blessed."
    },
    {
      "id": 105,
      "start": 1654.0599975585938,
      "end": 1655.5399780273438,
      "text": " She was blessed."
    },
    {
      "id": 106,
      "start": 1655.5399780273438,
      "end": 1660.6600036621094,
      "text": " The Bible tells us in verse number 16 that she hears Elisha make that declaration about"
    },
    {
      "id": 107,
      "start": 1660.6600036621094,
      "end": 1665.8999938964844,
      "text": " this season according to the time of life, thou shalt embrace a son."
    },
    {
      "id": 108,
      "start": 1666.1000061035156,
      "end": 1673.1000061035156,
      "text": " In verse number 17, the Bible says, and the woman conceived and bear a son the season"
    },
    {
      "id": 109,
      "start": 1673.1000061035156,
      "end": 1678.739990234375,
      "text": " that Elisha had said unto her according to the time of life."
    },
    {
      "id": 110,
      "start": 1678.739990234375,
      "end": 1683.6600036621094,
      "text": " What a tremendous blessing and she had been barren, but now she would be blessed with"
    },
    {
      "id": 111,
      "start": 1683.6600036621094,
      "end": 1690.0199890136719,
      "text": " a son and what a tremendous truth that we find in God's word with regard to the sanctity"
    },
    {
      "id": 112,
      "start": 1690.0199890136719,
      "end": 1692.5399780273438,
      "text": " of life and the preciousness of life."
    },
    {
      "id": 113,
      "start": 1692.5399780273438,
      "end": 1698.0599975585938,
      "text": " We live in a society today in which they do not value human life and it's unfortunate."
    },
    {
      "id": 114,
      "start": 1698.0599975585938,
      "end": 1705.3399963378906,
      "text": " We have just the progressive mindset with regard to abortion and a lack of understanding"
    },
    {
      "id": 115,
      "start": 1705.3399963378906,
      "end": 1708.1399841308594,
      "text": " of the sanctity of life."
    },
    {
      "id": 116,
      "start": 1708.1399841308594,
      "end": 1714.8599853515625,
      "text": " In fact, there are many today that are being surveyed that are young aged people in their"
    },
    {
      "id": 117,
      "start": 1714.8599853515625,
      "end": 1721.1799926757812,
      "text": " 20s and 30s and they will make statements such as this, I don't want to be inconvenienced"
    },
    {
      "id": 118,
      "start": 1721.3800048828125,
      "end": 1724.1400146484375,
      "text": " with children."
    },
    {
      "id": 119,
      "start": 1724.1400146484375,
      "end": 1731.5800170898438,
      "text": " For anyone that's barren, that's a tragic statement to hear somebody say."
    },
    {
      "id": 120,
      "start": 1731.5800170898438,
      "end": 1736.3800048828125,
      "text": " Children are not a burden, children are a blessing."
    },
    {
      "id": 121,
      "start": 1736.3800048828125,
      "end": 1739.3800048828125,
      "text": " Children are work, amen?"
    },
    {
      "id": 122,
      "start": 1739.3800048828125,
      "end": 1741.5,
      "text": " Children are a blessing, not a burden."
    },
    {
      "id": 123,
      "start": 1741.5,
      "end": 1746.4199829101562,
      "text": " We have this society that's grown up, this very, you know, the selfie generation, it's"
    },
    {
      "id": 124,
      "start": 1746.4199829101562,
      "end": 1750.8999633789062,
      "text": " all about them and it's all about their, what they want in life and they don't want"
    },
    {
      "id": 125,
      "start": 1750.8999633789062,
      "end": 1752.260009765625,
      "text": " to be inconvenienced."
    },
    {
      "id": 126,
      "start": 1752.260009765625,
      "end": 1760.3800048828125,
      "text": " They don't want their life to be restricted in any way, shape or form because of children."
    },
    {
      "id": 127,
      "start": 1760.3800048828125,
      "end": 1763.1400146484375,
      "text": " The birth rate in America has declined greatly."
    },
    {
      "id": 128,
      "start": 1763.1400146484375,
      "end": 1767.97998046875,
      "text": " If you look at it globally, you see that there's some other nations around the world that their"
    },
    {
      "id": 129,
      "start": 1767.97998046875,
      "end": 1775.8200073242188,
      "text": " birth rate is way higher than what the birth rate of American citizens is and we see that"
    },
    {
      "id": 130,
      "start": 1775.8200073242188,
      "end": 1778.5399780273438,
      "text": " change that's going on in our society."
    },
    {
      "id": 131,
      "start": 1778.5399780273438,
      "end": 1783.7799682617188,
      "text": " But this lady, she was blessed, she conceived and she bear a son and the Bible says in verse"
    },
    {
      "id": 132,
      "start": 1783.7799682617188,
      "end": 1788.0999755859375,
      "text": " 18, when the child was grown, and I think about those formative years, we don't know"
    },
    {
      "id": 133,
      "start": 1788.0999755859375,
      "end": 1792.6599731445312,
      "text": " how old he is because we know that he's old enough that he goes out into the field and"
    },
    {
      "id": 134,
      "start": 1792.6599731445312,
      "end": 1797.02001953125,
      "text": " he's there as his father is working in the field with the reapers and again, we don't"
    },
    {
      "id": 135,
      "start": 1797.02001953125,
      "end": 1800.1400146484375,
      "text": " know the age of the son, we can make speculation."
    },
    {
      "id": 0,
      "start": 1800.1400146484375,
      "end": 1803.8800146579742,
      "text": " And the Bible says that it has grown and I think about those formative years and I think"
    },
    {
      "id": 1,
      "start": 1803.8800146579742,
      "end": 1810.6800146102905,
      "text": " about that opportunity and about this Shunammite woman and the blessing of having a child."
    },
    {
      "id": 2,
      "start": 1810.6800146102905,
      "end": 1816.1200141906738,
      "text": " Notice if you will, Psalm 113, we'll look at two Psalms, verses in the book of Psalms."
    },
    {
      "id": 3,
      "start": 1816.1200141906738,
      "end": 1821.6000137329102,
      "text": " Look at first with me at Psalm 113."
    },
    {
      "id": 4,
      "start": 1821.6000137329102,
      "end": 1825.360013961792,
      "text": " God is the giver of life."
    },
    {
      "id": 5,
      "start": 1825.360013961792,
      "end": 1828.440013885498,
      "text": " God is the sustainer of life."
    },
    {
      "id": 6,
      "start": 1828.440013885498,
      "end": 1833.4000129699707,
      "text": " I'm thankful that God is the author of eternal life."
    },
    {
      "id": 7,
      "start": 1833.4000129699707,
      "end": 1839.0800132751465,
      "text": " Life is precious, but more important than being alive and breathing here this morning,"
    },
    {
      "id": 8,
      "start": 1839.0800132751465,
      "end": 1843.9600143432617,
      "text": " the most important thing is the spiritual life that is offered through the Lord Jesus"
    },
    {
      "id": 9,
      "start": 1843.9600143432617,
      "end": 1845.3200149536133,
      "text": " Christ."
    },
    {
      "id": 10,
      "start": 1845.3200149536133,
      "end": 1849.2000160217285,
      "text": " The Bible tells us that there's a time to be born and a time to die."
    },
    {
      "id": 11,
      "start": 1849.2000160217285,
      "end": 1854.7200164794922,
      "text": " The Bible tells us as an appointed unto man wants to die, but after this, the judgment."
    },
    {
      "id": 12,
      "start": 1854.7200164794922,
      "end": 1860.5600128173828,
      "text": " And we understand the life and some people have the idea that life here on earth, this"
    },
    {
      "id": 13,
      "start": 1860.5600128173828,
      "end": 1863.4000129699707,
      "text": " physical life, is really all there is to it."
    },
    {
      "id": 14,
      "start": 1863.4000129699707,
      "end": 1868.160011291504,
      "text": " I mean, just live the best you can and get the most toys and I mean, just live it up"
    },
    {
      "id": 15,
      "start": 1868.160011291504,
      "end": 1870.0400161743164,
      "text": " because this is all there is."
    },
    {
      "id": 16,
      "start": 1870.0400161743164,
      "end": 1874.0400161743164,
      "text": " I'm sorry, but God tells us that there is eternity."
    },
    {
      "id": 17,
      "start": 1874.0400161743164,
      "end": 1879.7600173950195,
      "text": " And the most precious thing is that God is the author of eternal salvation."
    },
    {
      "id": 18,
      "start": 1879.7600173950195,
      "end": 1882.2400131225586,
      "text": " We find that He offers that eternal life."
    },
    {
      "id": 19,
      "start": 1882.2400131225586,
      "end": 1883.8000183105469,
      "text": " You're here living this morning."
    },
    {
      "id": 20,
      "start": 1883.8000183105469,
      "end": 1889.5200119018555,
      "text": " You have breath and life and none of us know how long we will have to live, but I hope"
    },
    {
      "id": 21,
      "start": 1889.5200119018555,
      "end": 1891.7200164794922,
      "text": " this morning you're sure of heaven."
    },
    {
      "id": 22,
      "start": 1891.7200164794922,
      "end": 1895.8400115966797,
      "text": " You've trusted the Lord Jesus Christ, your personal savior and received the gift of life,"
    },
    {
      "id": 23,
      "start": 1895.8400115966797,
      "end": 1899.8000183105469,
      "text": " which is eternal life, or the gift of God, which is eternal life."
    },
    {
      "id": 24,
      "start": 1899.8000183105469,
      "end": 1903.9200134277344,
      "text": " Notice here, as we think about the blessing of this Shunammite woman in Psalm 113 and"
    },
    {
      "id": 25,
      "start": 1903.9200134277344,
      "end": 1908.880012512207,
      "text": " verse number nine, the Bible says, He, speaking of God, He maketh the barren woman to keep"
    },
    {
      "id": 26,
      "start": 1908.880012512207,
      "end": 1916.160011291504,
      "text": " her house, and to be a joyful mother of children, praise ye the Lord."
    },
    {
      "id": 27,
      "start": 1916.160011291504,
      "end": 1917.7200164794922,
      "text": " What a blessing."
    },
    {
      "id": 28,
      "start": 1917.7200164794922,
      "end": 1926.0800170898438,
      "text": " In Psalm 127, in verse number three, a verse of Scripture that's familiar to many of us,"
    },
    {
      "id": 29,
      "start": 1926.0800170898438,
      "end": 1932.9600219726562,
      "text": " the Bible says, Lo, children are an heritage of the Lord, and the fruit of the womb is"
    },
    {
      "id": 30,
      "start": 1932.9600219726562,
      "end": 1935.52001953125,
      "text": " His reward."
    },
    {
      "id": 31,
      "start": 1935.52001953125,
      "end": 1940.6400146484375,
      "text": " The Bible continues in verses four and five and says, As arrows are in the hand of a mighty"
    },
    {
      "id": 32,
      "start": 1940.6400146484375,
      "end": 1944.1600189208984,
      "text": " man, so are children of the youth."
    },
    {
      "id": 33,
      "start": 1944.1600189208984,
      "end": 1946.760009765625,
      "text": " Happy is the man that hath his quiver full of them."
    },
    {
      "id": 34,
      "start": 1946.760009765625,
      "end": 1951.2400207519531,
      "text": " They shall not be ashamed, but they shall speak with the enemies in the gate."
    },
    {
      "id": 35,
      "start": 1951.2400207519531,
      "end": 1956.000015258789,
      "text": " As we think about the children being an heritage of the Lord and speaking within the context"
    },
    {
      "id": 36,
      "start": 1956.000015258789,
      "end": 1961.000015258789,
      "text": " this morning of Christian families and Christian homes and understanding the blessing that"
    },
    {
      "id": 37,
      "start": 1961.000015258789,
      "end": 1965.4400177001953,
      "text": " God would give to any of us to have children."
    },
    {
      "id": 38,
      "start": 1965.4400177001953,
      "end": 1970.3200073242188,
      "text": " And understanding that God lends them to us, loans them to us for a season."
    },
    {
      "id": 39,
      "start": 1970.3200073242188,
      "end": 1974.1600189208984,
      "text": " We have an opportunity to invest in them and to influence them and to instruct them and"
    },
    {
      "id": 40,
      "start": 1974.1600189208984,
      "end": 1977.760009765625,
      "text": " to bring them up in the nurture and admonition of the Lord."
    },
    {
      "id": 41,
      "start": 1977.760009765625,
      "end": 1981.8000183105469,
      "text": " The Bible says, As arrows are in the hand of a mighty man, so are children of the youth."
    },
    {
      "id": 42,
      "start": 1981.8000183105469,
      "end": 1987.1200103759766,
      "text": " And you think about an arrow, and I'm not in archery whatsoever, I don't do well with"
    },
    {
      "id": 43,
      "start": 1987.1200103759766,
      "end": 1991.3600158691406,
      "text": " that sort of thing, but I do know a little bit about it, and that is that the arrow flies"
    },
    {
      "id": 44,
      "start": 1991.3600158691406,
      "end": 1995.2400207519531,
      "text": " in the direction in which you point it."
    },
    {
      "id": 45,
      "start": 1995.2400207519531,
      "end": 1997.4800109863281,
      "text": " Is that accurate this morning?"
    },
    {
      "id": 46,
      "start": 1997.4800109863281,
      "end": 2003.0800170898438,
      "text": " The arrow is going to fly in the direction in which you point it or aim it."
    },
    {
      "id": 47,
      "start": 2003.0800170898438,
      "end": 2007.6400146484375,
      "text": " Doesn't mean you're going to hit the target necessarily, especially speaking of me, but"
    },
    {
      "id": 48,
      "start": 2007.6400146484375,
      "end": 2012.5600128173828,
      "text": " the reality is that it's going to go in that direction as you aim it."
    },
    {
      "id": 49,
      "start": 2012.5600128173828,
      "end": 2015.4800109863281,
      "text": " You know, we need to bring our children up in the nurture and admonition of the Lord."
    },
    {
      "id": 50,
      "start": 2015.4800109863281,
      "end": 2017.8600158691406,
      "text": " We need to guide them and direct them."
    },
    {
      "id": 51,
      "start": 2017.8600158691406,
      "end": 2022.4800109863281,
      "text": " Children have decisions ahead of them that are difficult decisions that are lifelong"
    },
    {
      "id": 52,
      "start": 2022.52001953125,
      "end": 2029.52001953125,
      "text": " decisions with regard to the decisions they make with regard to career, with regard to"
    },
    {
      "id": 53,
      "start": 2029.9600219726562,
      "end": 2036.0800170898438,
      "text": " family and all of those things, and how God has given parents an opportunity to invest"
    },
    {
      "id": 54,
      "start": 2036.0800170898438,
      "end": 2041.8800201416016,
      "text": " in them and to instruct them and to show them the way that they ought to go."
    },
    {
      "id": 55,
      "start": 2041.8800201416016,
      "end": 2047.760009765625,
      "text": " I mentioned this on Wednesday evening, but recently I have been confronted by a couple"
    },
    {
      "id": 56,
      "start": 2047.760009765625,
      "end": 2053.1600189208984,
      "text": " of churches that have no pastors, and I've had some conversation over the last few days"
    },
    {
      "id": 57,
      "start": 2053.1600189208984,
      "end": 2057.760009765625,
      "text": " with some other folks about trying to find, look, there's some churches that are ready"
    },
    {
      "id": 58,
      "start": 2057.760009765625,
      "end": 2062.3200073242188,
      "text": " to just basically close down because there's no pastors, and there's some churches that"
    },
    {
      "id": 59,
      "start": 2062.3200073242188,
      "end": 2066.0800170898438,
      "text": " have been without pastors for extended periods of time that are just kind of hanging on by"
    },
    {
      "id": 60,
      "start": 2066.0800170898438,
      "end": 2069.9200134277344,
      "text": " a thread, if you will, and what do we do?"
    },
    {
      "id": 61,
      "start": 2069.9200134277344,
      "end": 2074.1600036621094,
      "text": " And I got correspondence yesterday from one individual that said, preacher, you know,"
    },
    {
      "id": 62,
      "start": 2074.1600036621094,
      "end": 2077.8600158691406,
      "text": " the problem is that there's a lot more churches looking for pastors than are our pastors"
    },
    {
      "id": 63,
      "start": 2077.8600158691406,
      "end": 2079.8400268554688,
      "text": " looking for churches."
    },
    {
      "id": 64,
      "start": 2079.8400268554688,
      "end": 2083.800018310547,
      "text": " It's a sad situation, what's going on in America."
    },
    {
      "id": 65,
      "start": 2083.800018310547,
      "end": 2087.6800231933594,
      "text": " It might be that God will allow us to have children and that God would call our children"
    },
    {
      "id": 66,
      "start": 2087.6800231933594,
      "end": 2091.1200256347656,
      "text": " to the ministry, not only pastoring, but missionaries."
    },
    {
      "id": 67,
      "start": 2091.1200256347656,
      "end": 2095.0800170898438,
      "text": " We have, if you look at our board of missionaries, I'm thankful for the young families that we"
    },
    {
      "id": 68,
      "start": 2095.0800170898438,
      "end": 2100.0800170898438,
      "text": " have, but we have a lot of older families of missionaries as well."
    },
    {
      "id": 69,
      "start": 2100.0800170898438,
      "end": 2103.760009765625,
      "text": " They need to, we need to be raising up the next generation of servants."
    },
    {
      "id": 70,
      "start": 2104.3600158691406,
      "end": 2108.9600219726562,
      "text": " We need to be praying to the Lord of the harvest that He would send forth laborers, children,"
    },
    {
      "id": 71,
      "start": 2108.9600219726562,
      "end": 2111.0,
      "text": " our inheritance of the Lord."
    },
    {
      "id": 72,
      "start": 2111.0,
      "end": 2115.0800170898438,
      "text": " We need to rejoice in the blessing that we see here in this passage of Scripture."
    },
    {
      "id": 73,
      "start": 2115.0800170898438,
      "end": 2116.0800170898438,
      "text": " She was blessed."
    },
    {
      "id": 74,
      "start": 2116.0800170898438,
      "end": 2121.8400268554688,
      "text": " I want you to see that it turns, from a human perspective, in our text of Scripture in 2"
    },
    {
      "id": 75,
      "start": 2121.8400268554688,
      "end": 2126.6800231933594,
      "text": " Kings chapter 4, really to a tragic situation."
    },
    {
      "id": 76,
      "start": 2126.6800231933594,
      "end": 2132.480010986328,
      "text": " The Bible tells us, as we've read already, that He's there in the field with His Father,"
    },
    {
      "id": 77,
      "start": 2132.480010986328,
      "end": 2136.280029296875,
      "text": " that He went out to His Father, to the reapers, in verse 18, verse 19, it says that He said"
    },
    {
      "id": 78,
      "start": 2136.280029296875,
      "end": 2138.720001220703,
      "text": " unto His Father, My head, My head."
    },
    {
      "id": 79,
      "start": 2138.720001220703,
      "end": 2143.52001953125,
      "text": " He said to the lad, carry him to his mother."
    },
    {
      "id": 80,
      "start": 2143.52001953125,
      "end": 2149.480010986328,
      "text": " When He had taken him and brought him to his mother, He sat on her knees till noon and"
    },
    {
      "id": 81,
      "start": 2149.480010986328,
      "end": 2151.9600219726562,
      "text": " then died."
    },
    {
      "id": 82,
      "start": 2151.9600219726562,
      "end": 2154.4000244140625,
      "text": " Those are sad words."
    },
    {
      "id": 83,
      "start": 2154.4000244140625,
      "end": 2157.52001953125,
      "text": " I would say that as she was blessed, number five, she was broken."
    },
    {
      "id": 84,
      "start": 2158.52001953125,
      "end": 2164.6400146484375,
      "text": " There are periods of time in our lives of brokenness, periods of times in which we have"
    },
    {
      "id": 85,
      "start": 2164.6400146484375,
      "end": 2170.760009765625,
      "text": " hearts that are heavy, that are overwhelmed, and verse 27, we'll get there in a moment,"
    },
    {
      "id": 86,
      "start": 2170.760009765625,
      "end": 2176.0,
      "text": " but it says that her soul is vexed within her."
    },
    {
      "id": 87,
      "start": 2176.0,
      "end": 2180.3600158691406,
      "text": " I don't know all that you're going through, I don't know the brokenness that anyone specifically"
    },
    {
      "id": 88,
      "start": 2180.3600158691406,
      "end": 2186.3200073242188,
      "text": " is dealing with, but understand that many people in our society today, many people in"
    },
    {
      "id": 89,
      "start": 2186.3200073242188,
      "end": 2190.52001953125,
      "text": " our churches today, they're broken, they're broken."
    },
    {
      "id": 90,
      "start": 2190.52001953125,
      "end": 2194.240020751953,
      "text": " I'm thankful that we serve a great God."
    },
    {
      "id": 91,
      "start": 2194.240020751953,
      "end": 2200.1200256347656,
      "text": " We serve a God who tells us that we can cast our burden upon the Lord, that we can bring"
    },
    {
      "id": 92,
      "start": 2200.1200256347656,
      "end": 2204.2000122070312,
      "text": " our care to the Lord, knowing that He cares for us."
    },
    {
      "id": 93,
      "start": 2204.2000122070312,
      "end": 2208.8800048828125,
      "text": " I think about that song that we sang this morning, it's just like His great love, and"
    },
    {
      "id": 94,
      "start": 2208.8800048828125,
      "end": 2215.0,
      "text": " when we sang that song this morning, we had the opportunity to think about the words of"
    },
    {
      "id": 95,
      "start": 2215.1600036621094,
      "end": 2220.760009765625,
      "text": " one of those, the third, I believe it was the third verse of that particular song and"
    },
    {
      "id": 96,
      "start": 2220.760009765625,
      "end": 2223.3200073242188,
      "text": " understanding of His great love."
    },
    {
      "id": 97,
      "start": 2223.3200073242188,
      "end": 2229.9200134277344,
      "text": " And it says, when life seems more than useless and I were better dead, I take my grief to"
    },
    {
      "id": 98,
      "start": 2229.9200134277344,
      "end": 2238.8400268554688,
      "text": " Jesus then, nor do I go in vain, for heavenly hope He gives, that cheers like sunshine after"
    },
    {
      "id": 99,
      "start": 2238.8400268554688,
      "end": 2239.8400268554688,
      "text": " rain."
    },
    {
      "id": 100,
      "start": 2239.8400268554688,
      "end": 2244.800018310547,
      "text": " There's some people that are broken, and here I believe that this circumstance in the"
    },
    {
      "id": 101,
      "start": 2245.6000061035156,
      "end": 2248.9600219726562,
      "text": " life of this Shunammite woman brought her to a place of brokenness, but I want you to"
    },
    {
      "id": 102,
      "start": 2248.9600219726562,
      "end": 2254.760009765625,
      "text": " see what she does in her brokenness, because I believe that as we look and examine what"
    },
    {
      "id": 103,
      "start": 2254.760009765625,
      "end": 2259.9200134277344,
      "text": " she does in her brokenness, what is revealed to us is her faith."
    },
    {
      "id": 104,
      "start": 2259.9200134277344,
      "end": 2264.2000122070312,
      "text": " Her faith is evidenced through this period of brokenness."
    },
    {
      "id": 105,
      "start": 2264.2000122070312,
      "end": 2271.6800231933594,
      "text": " Someone said this, a faith that cannot be tested cannot be trusted."
    },
    {
      "id": 106,
      "start": 2271.6800231933594,
      "end": 2275.9600219726562,
      "text": " A faith that cannot be tested is a faith that cannot be trusted."
    },
    {
      "id": 107,
      "start": 2275.9600219726562,
      "end": 2279.3200073242188,
      "text": " Listen, we serve the God of the universe."
    },
    {
      "id": 108,
      "start": 2279.3200073242188,
      "end": 2284.6400146484375,
      "text": " You may be facing some situation, this Shunammite woman, she was facing a situation where her"
    },
    {
      "id": 109,
      "start": 2284.6400146484375,
      "end": 2287.0,
      "text": " son died."
    },
    {
      "id": 110,
      "start": 2287.0,
      "end": 2293.1600036621094,
      "text": " In verse 21, the Bible says that she went up and laid him on the bed of the man of God,"
    },
    {
      "id": 111,
      "start": 2293.1600036621094,
      "end": 2295.6000061035156,
      "text": " and shut the door upon him and went out."
    },
    {
      "id": 112,
      "start": 2295.6000061035156,
      "end": 2297.760009765625,
      "text": " I want you to consider verse 21."
    },
    {
      "id": 113,
      "start": 2297.760009765625,
      "end": 2301.1600036621094,
      "text": " I'm assuming that this lad probably had his own bed."
    },
    {
      "id": 114,
      "start": 2301.1600036621094,
      "end": 2305.52001953125,
      "text": " I'm assuming that the boy, the son, had his own bed, but she does not take and lay her"
    },
    {
      "id": 115,
      "start": 2305.52001953125,
      "end": 2307.6800231933594,
      "text": " son on his own bed."
    },
    {
      "id": 116,
      "start": 2307.6800231933594,
      "end": 2313.52001953125,
      "text": " I believe that she's rejoicing at this very moment in the fact that she said to her husband,"
    },
    {
      "id": 117,
      "start": 2313.52001953125,
      "end": 2316.0,
      "text": " let's make this prophet's chamber."
    },
    {
      "id": 118,
      "start": 2316.0,
      "end": 2320.3200073242188,
      "text": " And in that prophet's chamber, she calls it a little chamber, but she says, let us put"
    },
    {
      "id": 119,
      "start": 2320.3200073242188,
      "end": 2325.52001953125,
      "text": " there, set there for him a bed and a table and a stool and a candlestick."
    },
    {
      "id": 120,
      "start": 2325.52001953125,
      "end": 2331.6400146484375,
      "text": " And we find that now when her son dies there upon her knees in verse number 20, that in"
    },
    {
      "id": 121,
      "start": 2331.6400146484375,
      "end": 2341.239990234375,
      "text": " verse 21, she takes this body of her son and she lays him on the bed of the man of God."
    },
    {
      "id": 122,
      "start": 2341.239990234375,
      "end": 2345.8800048828125,
      "text": " The Bible tells us that she shut the door upon him and went out and she called unto"
    },
    {
      "id": 123,
      "start": 2345.8800048828125,
      "end": 2351.1199951171875,
      "text": " her husband and notice what she says in verse 22, send me, I pray thee, one of the young"
    },
    {
      "id": 124,
      "start": 2351.1199951171875,
      "end": 2358.280029296875,
      "text": " men and one of the asses that I may run to the man of God, but then notice this and"
    },
    {
      "id": 125,
      "start": 2358.280029296875,
      "end": 2360.0400390625,
      "text": " come again."
    },
    {
      "id": 126,
      "start": 2360.0400390625,
      "end": 2361.8400268554688,
      "text": " I believe that she had every expectation."
    },
    {
      "id": 127,
      "start": 2361.8400268554688,
      "end": 2364.4400024414062,
      "text": " Where was she going to run to in the moment of her crisis?"
    },
    {
      "id": 128,
      "start": 2364.4400024414062,
      "end": 2366.9600219726562,
      "text": " In the moment of her brokenness, what was she going to do?"
    },
    {
      "id": 129,
      "start": 2366.9600219726562,
      "end": 2370.4000244140625,
      "text": " She says, I need to get to the man of God."
    },
    {
      "id": 130,
      "start": 2370.4000244140625,
      "end": 2375.4000244140625,
      "text": " I want you to understand in Israel's history at this particular time and the ministry of"
    },
    {
      "id": 131,
      "start": 2375.4000244140625,
      "end": 2378.9600219726562,
      "text": " the prophets, this was the place for her to run."
    },
    {
      "id": 132,
      "start": 2378.9600219726562,
      "end": 2385.4000244140625,
      "text": " I'm thankful today with New Testament understanding and what Jesus Christ did on the cross of"
    },
    {
      "id": 133,
      "start": 2385.4000244140625,
      "end": 2392.4800415039062,
      "text": " Calvary and how he rent the veil and twain and he provided direct access for every child"
    },
    {
      "id": 134,
      "start": 2392.4800415039062,
      "end": 2393.4800415039062,
      "text": " of God."
    },
    {
      "id": 135,
      "start": 2393.4800415039062,
      "end": 2398.1199951171875,
      "text": " If you're saved by the blood of Christ this morning, you have direct access to God almighty"
    },
    {
      "id": 136,
      "start": 2398.1199951171875,
      "end": 2400.2000122070312,
      "text": " and you can run to God."
    },
    {
      "id": 0,
      "start": 2400.2000122070312,
      "end": 2406.3200120925903,
      "text": " In the moment of your brokenness, in the moment of your despair, in your heaviness, and the Bible says that she ran"
    },
    {
      "id": 1,
      "start": 2406.7000122070312,
      "end": 2411.000012397766,
      "text": " She desired to run to the man of God and said I'll come again in verse 23"
    },
    {
      "id": 2,
      "start": 2411.000012397766,
      "end": 2415.800012588501,
      "text": " And he said notice what the husband says wherefore will thou go to him today?"
    },
    {
      "id": 3,
      "start": 2415.800012588501,
      "end": 2420.620012283325,
      "text": " It is neither new moon nor Sabbath, and she said it shall be well"
    },
    {
      "id": 4,
      "start": 2420.7000122070312,
      "end": 2425.3400115966797,
      "text": " It did not matter what the timing was there was an urgent circumstance"
    },
    {
      "id": 5,
      "start": 2425.3400115966797,
      "end": 2429.8600120544434,
      "text": " There was a need that she had in her life and though it was not a new moon though"
    },
    {
      "id": 6,
      "start": 2429.8600120544434,
      "end": 2433.480010986328,
      "text": " It was not a Sabbath. She needed to get to the man of God"
    },
    {
      "id": 7,
      "start": 2435.8600120544434,
      "end": 2437.8600120544434,
      "text": " It's about a 25 mile journey"
    },
    {
      "id": 8,
      "start": 2439.3400115966797,
      "end": 2442.540012359619,
      "text": " 25 miles for us today well in northern, Virginia could take a while"
    },
    {
      "id": 9,
      "start": 2443.820011138916,
      "end": 2445.820011138916,
      "text": " but 25 miles"
    },
    {
      "id": 10,
      "start": 2446.780014038086,
      "end": 2448.780014038086,
      "text": " on a donkey"
    },
    {
      "id": 11,
      "start": 2449.9000129699707,
      "end": 2451.9000129699707,
      "text": " And notice what she says"
    },
    {
      "id": 12,
      "start": 2451.9000129699707,
      "end": 2457.7000122070312,
      "text": " She sat on an ass then she sat on an ass and said to the servant drive and go forward then notice this"
    },
    {
      "id": 13,
      "start": 2457.940013885498,
      "end": 2463.7000122070312,
      "text": " Slack not thy writing for me except I bid thee. That's why she asked for one of the young men"
    },
    {
      "id": 14,
      "start": 2464.440010070801,
      "end": 2465.6200103759766,
      "text": " Amen"
    },
    {
      "id": 15,
      "start": 2465.6200103759766,
      "end": 2470.580009460449,
      "text": " because some of the old men couldn't go as fast as she wanted to go and so she called for one of those young men and"
    },
    {
      "id": 16,
      "start": 2470.980010986328,
      "end": 2472.980010986328,
      "text": " She said do not slack"
    },
    {
      "id": 17,
      "start": 2474.060012817383,
      "end": 2480.5200119018555,
      "text": " Thy writing for me in other words there was urgency we need to get to the man of God"
    },
    {
      "id": 18,
      "start": 2482.10001373291,
      "end": 2484.10001373291,
      "text": " Verse"
    },
    {
      "id": 19,
      "start": 2484.540008544922,
      "end": 2487.7000122070312,
      "text": " 25 so she went and came into the man of God to Mount Carmel"
    },
    {
      "id": 20,
      "start": 2487.980010986328,
      "end": 2492.940010070801,
      "text": " It came to pass when the man of God saw her afar off that he said to cause a a servant behold"
    },
    {
      "id": 21,
      "start": 2493.8200149536133,
      "end": 2495.8200149536133,
      "text": " yonder is that Shunammite"
    },
    {
      "id": 22,
      "start": 2496.380012512207,
      "end": 2498.380012512207,
      "text": " You know he recognized her"
    },
    {
      "id": 23,
      "start": 2499.10001373291,
      "end": 2503.1400146484375,
      "text": " Because she provided a place for him to dwell and he was there so often"
    },
    {
      "id": 24,
      "start": 2503.780014038086,
      "end": 2509.3000106811523,
      "text": " And when she's coming even from a distance. He says to his servant Gehazi. He says the Shunammite"
    },
    {
      "id": 25,
      "start": 2510.260009765625,
      "end": 2511.780014038086,
      "text": " Shunammite"
    },
    {
      "id": 26,
      "start": 2511.780014038086,
      "end": 2513.660011291504,
      "text": " He then tells Gehazi run now"
    },
    {
      "id": 27,
      "start": 2513.660011291504,
      "end": 2519.2200088500977,
      "text": " I pray thee to meet her and say unto her is it well with thee is it well with thy husband as well with the child"
    },
    {
      "id": 28,
      "start": 2519.2200088500977,
      "end": 2526.580009460449,
      "text": " Notice the three questions is it well with thee is it well with thy husband is it well with the child?"
    },
    {
      "id": 29,
      "start": 2527.0200119018555,
      "end": 2529.02001953125,
      "text": " Why was she running to the man of God?"
    },
    {
      "id": 30,
      "start": 2529.3800048828125,
      "end": 2531.9000091552734,
      "text": " Because in verse number 20 her son died"
    },
    {
      "id": 31,
      "start": 2535.1400146484375,
      "end": 2537.1400146484375,
      "text": " And Elisha says"
    },
    {
      "id": 32,
      "start": 2537.540008544922,
      "end": 2539.1400146484375,
      "text": " To Gehazi"
    },
    {
      "id": 33,
      "start": 2539.1400146484375,
      "end": 2544.780014038086,
      "text": " Run to her and ask her three specific questions number one is it well with thee number two is it?"
    },
    {
      "id": 34,
      "start": 2544.780014038086,
      "end": 2546.780014038086,
      "text": " Well with your husband number three is it well?"
    },
    {
      "id": 35,
      "start": 2546.9400177001953,
      "end": 2552.300018310547,
      "text": " with the child and I want you to see her response it is"
    },
    {
      "id": 36,
      "start": 2553.6200103759766,
      "end": 2555.6200103759766,
      "text": " Well"
    },
    {
      "id": 37,
      "start": 2555.780014038086,
      "end": 2557.780014038086,
      "text": " It is well"
    },
    {
      "id": 38,
      "start": 2558.1400146484375,
      "end": 2560.1400146484375,
      "text": " Is that what you would expect"
    },
    {
      "id": 39,
      "start": 2560.460006713867,
      "end": 2562.1400146484375,
      "text": " It is well"
    },
    {
      "id": 40,
      "start": 2562.1400146484375,
      "end": 2564.1400146484375,
      "text": " We sing the song"
    },
    {
      "id": 41,
      "start": 2564.300018310547,
      "end": 2566.300018310547,
      "text": " What a wonderful song it is"
    },
    {
      "id": 42,
      "start": 2566.6200103759766,
      "end": 2571.260009765625,
      "text": " Almost always when we have favorites someone is going to pick it as well with my soul"
    },
    {
      "id": 43,
      "start": 2572.6600189208984,
      "end": 2574.740005493164,
      "text": " and we know the story that"
    },
    {
      "id": 44,
      "start": 2576.3400115966797,
      "end": 2580.8600158691406,
      "text": " Really led to the writing of that song and the tragic fire of Chicago and the"
    },
    {
      "id": 45,
      "start": 2581.6200103759766,
      "end": 2583.6200103759766,
      "text": " descending ahead of a family in a"
    },
    {
      "id": 46,
      "start": 2584.540008544922,
      "end": 2589.500015258789,
      "text": " disaster on the seas where the the daughters are killed they drown and"
    },
    {
      "id": 47,
      "start": 2592.300018310547,
      "end": 2594.300018310547,
      "text": " Correspondences received back in Chicago"
    },
    {
      "id": 48,
      "start": 2595.300018310547,
      "end": 2597.300018310547,
      "text": " Saved alone"
    },
    {
      "id": 49,
      "start": 2597.500015258789,
      "end": 2599.500015258789,
      "text": " Just the wife made it across"
    },
    {
      "id": 50,
      "start": 2600.9000091552734,
      "end": 2606.780014038086,
      "text": " And Horatio Spafford sat down as he took that journey across the sea and he asked"
    },
    {
      "id": 51,
      "start": 2608.02001953125,
      "end": 2612.8200073242188,
      "text": " The captain of the ship as they got to around the area where the tragedy took place"
    },
    {
      "id": 52,
      "start": 2613.3400115966797,
      "end": 2615.3400115966797,
      "text": " If he could let him know where it was"
    },
    {
      "id": 53,
      "start": 2616.300018310547,
      "end": 2619.8200073242188,
      "text": " And he sat down and he wrote the words of that song it is well"
    },
    {
      "id": 54,
      "start": 2620.460006713867,
      "end": 2622.1800079345703,
      "text": " with my soul"
    },
    {
      "id": 55,
      "start": 2622.220016479492,
      "end": 2626.1000061035156,
      "text": " It's amazing, you know what that is it's the grace of God"
    },
    {
      "id": 56,
      "start": 2627.4200134277344,
      "end": 2629.4200134277344,
      "text": " It is the grace of God"
    },
    {
      "id": 57,
      "start": 2629.6200103759766,
      "end": 2635.1000061035156,
      "text": " That would allow for us to say it's faith that we have in the God of the universe the one"
    },
    {
      "id": 58,
      "start": 2635.540008544922,
      "end": 2639.02001953125,
      "text": " Who spoke it all into existence the one who controls everything?"
    },
    {
      "id": 59,
      "start": 2639.3800048828125,
      "end": 2645.540008544922,
      "text": " And we have the privilege of knowing him and serving him and because we know that he's a great God"
    },
    {
      "id": 60,
      "start": 2645.540008544922,
      "end": 2650.060012817383,
      "text": " And he do with all things well and because we've experienced the grace of God"
    },
    {
      "id": 61,
      "start": 2650.9000091552734,
      "end": 2655.460006713867,
      "text": " We can say it is well it is well"
    },
    {
      "id": 62,
      "start": 2657.1800231933594,
      "end": 2662.9400024414062,
      "text": " When she came to the man of God to the hill she caught him according to verse number 27 by the feet and"
    },
    {
      "id": 63,
      "start": 2663.740020751953,
      "end": 2669.220001220703,
      "text": " Look at what Gahazi does but Gahazi came near to thrust her away and the man of God Elisha. He said let her alone"
    },
    {
      "id": 64,
      "start": 2669.9400024414062,
      "end": 2677.6800231933594,
      "text": " For her soul is vexed within her and then notice this and the Lord hath hid it from me and hath not told me"
    },
    {
      "id": 65,
      "start": 2678.279998779297,
      "end": 2680.0800170898438,
      "text": " Elisha did not know"
    },
    {
      "id": 66,
      "start": 2680.0800170898438,
      "end": 2685.760009765625,
      "text": " Many times the prophet of God would know ahead of time and God would reveal it supernaturally"
    },
    {
      "id": 67,
      "start": 2685.760009765625,
      "end": 2690.9600219726562,
      "text": " But here Elisha does not know and then in verse 28. She said did I desire a son of my Lord?"
    },
    {
      "id": 68,
      "start": 2690.9600219726562,
      "end": 2692.720001220703,
      "text": " Did I not say do not deceive me?"
    },
    {
      "id": 69,
      "start": 2692.720001220703,
      "end": 2697.5599975585938,
      "text": " She did not even say in verse 28 that the son had died but notice in verse number 29"
    },
    {
      "id": 70,
      "start": 2697.5599975585938,
      "end": 2699.5599975585938,
      "text": " Then he Elisha said to Gahazi"
    },
    {
      "id": 71,
      "start": 2699.760009765625,
      "end": 2706.040008544922,
      "text": " Gird up my loins and take my staff in thine hand and go thy way if thou meet any man salute him not and if they"
    },
    {
      "id": 72,
      "start": 2706.040008544922,
      "end": 2708.52001953125,
      "text": " any salute thee answer him not again and"
    },
    {
      "id": 73,
      "start": 2708.9600219726562,
      "end": 2715.4000244140625,
      "text": " lay my staff upon the face of the child and the mother of the child said as the Lord liveth and as thy soul liveth"
    },
    {
      "id": 74,
      "start": 2715.4000244140625,
      "end": 2719.760009765625,
      "text": " Notice this I will not leave thee and he arose and followed her"
    },
    {
      "id": 75,
      "start": 2720.3600158691406,
      "end": 2722.3600158691406,
      "text": " She was gonna stay with the man of God"
    },
    {
      "id": 76,
      "start": 2722.8800048828125,
      "end": 2724.8800048828125,
      "text": " How long do you need to stay in the presence of God?"
    },
    {
      "id": 77,
      "start": 2727.6400146484375,
      "end": 2731.6800231933594,
      "text": " When you're broken, you know what the wonderful thing is you can stay as long as you need to"
    },
    {
      "id": 78,
      "start": 2733.1200256347656,
      "end": 2735.1200256347656,
      "text": " You can stay in the presence of God"
    },
    {
      "id": 79,
      "start": 2736.279998779297,
      "end": 2738.279998779297,
      "text": " And he can help you"
    },
    {
      "id": 80,
      "start": 2738.760009765625,
      "end": 2742.0,
      "text": " He can heal that broken heart. He can give you the grace"
    },
    {
      "id": 81,
      "start": 2743.52001953125,
      "end": 2750.52001953125,
      "text": " Remember he said to Paul my grace is sufficient for thee. Have you found it to be so in your life?"
    },
    {
      "id": 82,
      "start": 2751.8400268554688,
      "end": 2756.1600036621094,
      "text": " See we find it to be so when we go through that difficulty"
    },
    {
      "id": 83,
      "start": 2757.480010986328,
      "end": 2761.720001220703,
      "text": " Many times in life. There's there's very little growth without any"
    },
    {
      "id": 84,
      "start": 2762.6000061035156,
      "end": 2770.2000122070312,
      "text": " Adversity or difficulty many times in life. It's through that period of hardship that that God is developing us"
    },
    {
      "id": 85,
      "start": 2771.5599975585938,
      "end": 2776.5599975585938,
      "text": " Mary and Martha believed with all of their heart that Jesus could heal Lazarus"
    },
    {
      "id": 86,
      "start": 2778.4400024414062,
      "end": 2782.8400268554688,
      "text": " They sent to Jesus to say he whom thou lovest is sick"
    },
    {
      "id": 87,
      "start": 2783.800018310547,
      "end": 2791.2000122070312,
      "text": " Why did they send for Jesus? Well because Jesus healed it the power over disease and they knew that"
    },
    {
      "id": 88,
      "start": 2792.4000244140625,
      "end": 2794.4000244140625,
      "text": " but Jesus tarried his"
    },
    {
      "id": 89,
      "start": 2795.720001220703,
      "end": 2797.720001220703,
      "text": " Departure and"
    },
    {
      "id": 90,
      "start": 2797.760009765625,
      "end": 2799.760009765625,
      "text": " both of those sisters"
    },
    {
      "id": 91,
      "start": 2799.9600219726562,
      "end": 2801.9600219726562,
      "text": " when Jesus arrives"
    },
    {
      "id": 92,
      "start": 2802.0,
      "end": 2805.8400268554688,
      "text": " They say this if thou hath been here"
    },
    {
      "id": 93,
      "start": 2807.3600158691406,
      "end": 2812.279998779297,
      "text": " My brother would not have died. He still be alive. In fact the Jews that were there mourning as"
    },
    {
      "id": 94,
      "start": 2813.800018310547,
      "end": 2819.1600036621094,
      "text": " Their custom would be when they heard Jesus wept. They said could not he"
    },
    {
      "id": 95,
      "start": 2819.9200134277344,
      "end": 2825.480010986328,
      "text": " Who who made the man see that was blind they refer back to a miracle of a couple of chapters earlier"
    },
    {
      "id": 96,
      "start": 2825.8800048828125,
      "end": 2829.2000122070312,
      "text": " Could not he have healed him the answer is yes"
    },
    {
      "id": 97,
      "start": 2830.0800170898438,
      "end": 2834.540008544922,
      "text": " But you know what? They didn't believe they didn't believe that he could bring him back from the dead"
    },
    {
      "id": 98,
      "start": 2837.040008544922,
      "end": 2839.040008544922,
      "text": " So Lazarus had to die"
    },
    {
      "id": 99,
      "start": 2840.3200073242188,
      "end": 2845.480010986328,
      "text": " The morning the brokenness took place so that Lazarus"
    },
    {
      "id": 100,
      "start": 2846.480010986328,
      "end": 2852.9600219726562,
      "text": " Would be in that tomb for four days and Jesus would say Lazarus come forth"
    },
    {
      "id": 101,
      "start": 2854.8400268554688,
      "end": 2861.4400024414062,
      "text": " He said to his disciples, I'm glad for your sakes that I was not there to the extent that you might believe"
    },
    {
      "id": 102,
      "start": 2863.2000122070312,
      "end": 2865.040008544922,
      "text": " Brokenness"
    },
    {
      "id": 103,
      "start": 2865.040008544922,
      "end": 2867.040008544922,
      "text": " oftentimes leads to great growth"
    },
    {
      "id": 104,
      "start": 2867.800018310547,
      "end": 2869.800018310547,
      "text": " be in the presence of God"
    },
    {
      "id": 105,
      "start": 2869.8800048828125,
      "end": 2875.4000244140625,
      "text": " the Bible tells the verse 31 that Gehazi passed on before them and laid the staff upon the face of the child and there was"
    },
    {
      "id": 106,
      "start": 2875.4000244140625,
      "end": 2879.760009765625,
      "text": " Neither voice nor hearing wherefore he went again to meet him and told him saying the child is not awake"
    },
    {
      "id": 107,
      "start": 2879.760009765625,
      "end": 2880.9200134277344,
      "text": " He put the staff there"
    },
    {
      "id": 108,
      "start": 2880.9200134277344,
      "end": 2887.1600036621094,
      "text": " But there's no power in that the Bible says in verse 32 when Elisha was coming to the house behold the child was dead and laid"
    },
    {
      "id": 109,
      "start": 2887.1600036621094,
      "end": 2889.040008544922,
      "text": " upon his bed"
    },
    {
      "id": 110,
      "start": 2889.040008544922,
      "end": 2891.040008544922,
      "text": " he went in therefore and"
    },
    {
      "id": 111,
      "start": 2891.3200073242188,
      "end": 2893.3200073242188,
      "text": " Shut the door upon them twain"
    },
    {
      "id": 112,
      "start": 2893.800018310547,
      "end": 2895.800018310547,
      "text": " Notice this he prayed unto the Lord"
    },
    {
      "id": 113,
      "start": 2897.800018310547,
      "end": 2901.1000061035156,
      "text": " Is your first response to difficulty prayer"
    },
    {
      "id": 114,
      "start": 2901.1000061035156,
      "end": 2906.5,
      "text": " You know why Elisha prayed he saw Elijah pray, you know some of the power of prayer"
    },
    {
      "id": 115,
      "start": 2907.02001953125,
      "end": 2908.540008544922,
      "text": " He prayed unto the Lord"
    },
    {
      "id": 116,
      "start": 2908.540008544922,
      "end": 2913.1400146484375,
      "text": " And he went up and lay upon the child and put his mouth upon his mouth and his eyes upon his eyes his hand upon"
    },
    {
      "id": 117,
      "start": 2913.1400146484375,
      "end": 2917.02001953125,
      "text": " His hands and he stretched himself upon the child and the flesh of the child waxed warm"
    },
    {
      "id": 118,
      "start": 2917.260009765625,
      "end": 2921.6600341796875,
      "text": " Then he returned and walked in the house to and fro and went up and stretched himself upon him in the"
    },
    {
      "id": 119,
      "start": 2921.8200073242188,
      "end": 2928.0599975585938,
      "text": " Child sneezed seven times and then notice this the child opened his eyes number six this morning finally"
    },
    {
      "id": 120,
      "start": 2928.1799926757812,
      "end": 2931.8599853515625,
      "text": " This Shunammite woman had the privilege to see God work"
    },
    {
      "id": 121,
      "start": 2932.8599853515625,
      "end": 2934.8599853515625,
      "text": " She had the privilege to see God work"
    },
    {
      "id": 122,
      "start": 2935.3800048828125,
      "end": 2937.3800048828125,
      "text": " What a unique privilege"
    },
    {
      "id": 123,
      "start": 2938.5,
      "end": 2941.7000122070312,
      "text": " She saw God work and giving her a son in the first place"
    },
    {
      "id": 124,
      "start": 2942.5,
      "end": 2945.9000244140625,
      "text": " But now we see that she she has the opportunity"
    },
    {
      "id": 125,
      "start": 2946.5,
      "end": 2948.5,
      "text": " personally to experience"
    },
    {
      "id": 126,
      "start": 2948.8599853515625,
      "end": 2952.02001953125,
      "text": " the miracle working power of God Almighty"
    },
    {
      "id": 127,
      "start": 2952.5400390625,
      "end": 2956.9400024414062,
      "text": " The Bible says that the child opened his eyes and he saw the Son of God"
    },
    {
      "id": 128,
      "start": 2956.9400024414062,
      "end": 2963.6600341796875,
      "text": " The Bible says that the child opened his eyes. So what happens Elisha calls Gehazi in verse 36 and said call the Shunammite"
    },
    {
      "id": 129,
      "start": 2964.7000122070312,
      "end": 2966.7000122070312,
      "text": " So he called her"
    },
    {
      "id": 130,
      "start": 2966.7000122070312,
      "end": 2969.9800415039062,
      "text": " And when she was coming unto him notice these words"
    },
    {
      "id": 131,
      "start": 2970.780029296875,
      "end": 2972.780029296875,
      "text": " He said take up"
    },
    {
      "id": 132,
      "start": 2973.0599975585938,
      "end": 2974.8200073242188,
      "text": " thy son"
    },
    {
      "id": 133,
      "start": 2974.8200073242188,
      "end": 2981.3800048828125,
      "text": " Then she went in and fell at his feet and bowed herself to the ground and took up her son and went out"
    },
    {
      "id": 134,
      "start": 2982.1400146484375,
      "end": 2984.780029296875,
      "text": " We don't have time this morning but chapter number eight"
    },
    {
      "id": 135,
      "start": 2985.2200317382812,
      "end": 2989.8200073242188,
      "text": " We don't know the exact timing with all of these events in second Kings, but chapter number eight"
    },
    {
      "id": 136,
      "start": 2991.6600341796875,
      "end": 2993.6600341796875,
      "text": " Talks about the Shunammite"
    },
    {
      "id": 137,
      "start": 2994.1000366210938,
      "end": 3000.2999877929688,
      "text": " Woman and her son there was a seven-year famine. So at least seven years passes and the Shunammite"
    },
    {
      "id": 0,
      "start": 3000.2999877929688,
      "end": 3005.1399879455566,
      "text": " This giant woman and her son are referenced in chapter number 8."
    },
    {
      "id": 1,
      "start": 3005.1399879455566,
      "end": 3010.4399881362915,
      "text": " God gave her opportunity to see her son grow and live."
    },
    {
      "id": 2,
      "start": 3010.4399881362915,
      "end": 3016.5599880218506,
      "text": " I don't know how long, there's no more reference with regard to either one of them after chapter number 8,"
    },
    {
      "id": 3,
      "start": 3016.5599880218506,
      "end": 3026.999988555908,
      "text": " but I find this morning, this great woman in Shunem, she was caring, she was generous, she was content."
    },
    {
      "id": 4,
      "start": 3026.999988555908,
      "end": 3034.7999877929688,
      "text": " I find that she was blessed, she was broken, and then she was privileged to see God work."
    },
    {
      "id": 5,
      "start": 3034.7999877929688,
      "end": 3040.339988708496,
      "text": " I think about that last point this morning, you know it's a privilege for us to see God work."
    },
    {
      "id": 6,
      "start": 3040.339988708496,
      "end": 3043.1399879455566,
      "text": " It's a privilege, unique privilege."
    },
    {
      "id": 7,
      "start": 3043.1399879455566,
      "end": 3045.719985961914,
      "text": " Do you long to see God work in your life?"
    },
    {
      "id": 8,
      "start": 3045.719985961914,
      "end": 3050.179988861084,
      "text": " Do you long to see God work in the lives of those that He's given you opportunity to,"
    },
    {
      "id": 9,
      "start": 3050.179988861084,
      "end": 3057.679988861084,
      "text": " if you're parents, to raise, if you're church members, to minister to, you want to see God work in their lives."
    },
    {
      "id": 10,
      "start": 3057.679988861084,
      "end": 3060.4199867248535,
      "text": " It's a privilege to see God work."
    },
    {
      "id": 11,
      "start": 3060.4199867248535,
      "end": 3064.7599868774414,
      "text": " We've got to be in the right place if we're going to see God work."
    },
    {
      "id": 12,
      "start": 3064.7599868774414,
      "end": 3070.559989929199,
      "text": " You know what led to this Shunemite woman seeing God work in all the circumstances in which she did?"
    },
    {
      "id": 13,
      "start": 3070.559989929199,
      "end": 3077.839988708496,
      "text": " It started out by her being caring and saying, constrained him to eat some bread,"
    },
    {
      "id": 14,
      "start": 3077.839988708496,
      "end": 3081.1999893188477,
      "text": " and then perceiving that this was a holy man of God and said,"
    },
    {
      "id": 15,
      "start": 3081.1999893188477,
      "end": 3087.5799865722656,
      "text": " we need to build a place for him to be able to stay so that when he passes through here, he'll stay here."
    },
    {
      "id": 16,
      "start": 3087.5799865722656,
      "end": 3093.1799850463867,
      "text": " He could have stayed somewhere else, someone else could, but no, she had the opportunity and she seized it."
    },
    {
      "id": 17,
      "start": 3093.1799850463867,
      "end": 3103.019989013672,
      "text": " And because of that single decision, her generosity, her service, her care, she got to see God work miraculously."
    },
    {
      "id": 18,
      "start": 3103.0399856567383,
      "end": 3108.6799850463867,
      "text": " I hope this morning that we would not allow opportunities to pass us by, that we would seize them,"
    },
    {
      "id": 19,
      "start": 3108.6799850463867,
      "end": 3114.3599853515625,
      "text": " that we'd be used of the Lord, that we would see God do great and mighty things."
    },
    {
      "id": 20,
      "start": 3114.3599853515625,
      "end": 3124.6399841308594,
      "text": " It's God who said to Jeremiah, call unto me and I will answer thee and show thee great and mighty things which thou knowest not."
    },
    {
      "id": 21,
      "start": 3124.6399841308594,
      "end": 3127.999984741211,
      "text": " If you're broken today, can I give you hope in Christ?"
    },
    {
      "id": 22,
      "start": 3127.999984741211,
      "end": 3132.039993286133,
      "text": " Can I tell you that Jesus, He heals the brokenhearted."
    },
    {
      "id": 23,
      "start": 3132.0599822998047,
      "end": 3133.999984741211,
      "text": " What a wonderful, wonderful Savior we have."
    },
    {
      "id": 24,
      "start": 3133.999984741211,
      "end": 3139.239990234375,
      "text": " If you don't know Him as your personal Lord and Savior today, today is the day of salvation."
    },
    {
      "id": 25,
      "start": 3139.239990234375,
      "end": 3148.019989013672,
      "text": " This morning you say, I'm a Christian, I'm saved by the grace of God, but I got this burden, I'm broken over this situation."
    },
    {
      "id": 26,
      "start": 3148.019989013672,
      "end": 3151.3199920654297,
      "text": " Tell it to Jesus. Tell it to Jesus."
    },
    {
      "id": 27,
      "start": 3151.3199920654297,
      "end": 3153.779983520508,
      "text": " What a privilege we have."
    },
    {
      "id": 28,
      "start": 3153.779983520508,
      "end": 3159.0599822998047,
      "text": " What a friend we have in Jesus that we can go to Him knowing that He cares for us."
    },
    {
      "id": 29,
      "start": 3159.0599822998047,
      "end": 3159.699981689453,
      "text": " Let's pray together."
    },
    {
      "id": 30,
      "start": 3159.699981689453,
      "end": 3160.499984741211,
      "text": " Father, we love you."
    },
    {
      "id": 31,
      "start": 3160.499984741211,
      "end": 3161.5999908447266,
      "text": " We thank you for loving us."
    },
    {
      "id": 32,
      "start": 3161.6199951171875,
      "end": 3166.759994506836,
      "text": " Thank you for the opportunity today to celebrate mothers."
    },
    {
      "id": 33,
      "start": 3166.759994506836,
      "end": 3171.1599884033203,
      "text": " Thank you for this Shunammite woman."
    },
    {
      "id": 34,
      "start": 3171.1599884033203,
      "end": 3174.739990234375,
      "text": " Lord, thank you for the characteristics that we could look at of her life."
    },
    {
      "id": 35,
      "start": 3174.739990234375,
      "end": 3176.239990234375,
      "text": " Thank you for what you revealed to us."
    },
    {
      "id": 36,
      "start": 3176.239990234375,
      "end": 3179.2999877929688,
      "text": " I pray, God, that you'd meet needs this morning."
    },
    {
      "id": 37,
      "start": 3179.2999877929688,
      "end": 3180.739990234375,
      "text": " Maybe there's someone that's broken."
    },
    {
      "id": 38,
      "start": 3180.739990234375,
      "end": 3190.759994506836,
      "text": " God, would you just help them to run to you, to get into your presence, to not leave your presence, to abide in you."
    },
    {
      "id": 39,
      "start": 3190.779983520508,
      "end": 3197.6199951171875,
      "text": " Lord, I pray that you would work miraculously in our lives, that we would seize the opportunities to serve you."
    },
    {
      "id": 40,
      "start": 3197.6199951171875,
      "end": 3205.2999877929688,
      "text": " Not for something that we might be able to get, but Lord, that we would serve you because you are worthy of our service."
    },
    {
      "id": 41,
      "start": 3205.2999877929688,
      "end": 3208.699981689453,
      "text": " I pray that you'd move and work in hearts and lives as only you can."
    },
    {
      "id": 42,
      "start": 3208.699981689453,
      "end": 3214.199981689453,
      "text": " If there's one that's not sure of heaven, it's our prayer that today would be the day of their salvation."
    },
    {
      "id": 43,
      "start": 3214.199981689453,
      "end": 3217.0999908447266,
      "text": " Well, thank you for all that you'll do, for it's in Christ's name we pray."
    },
    {
      "id": 44,
      "start": 3217.0999908447266,
      "end": 3217.939987182617,
      "text": " Would you stand with me?"
    },
    {
      "id": 45,
      "start": 3217.939987182617,
      "end": 3219.779983520508,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 46,
      "start": 3219.779983520508,
      "end": 3222.5999908447266,
      "text": " Kimberly's going to play quietly on the piano."
    },
    {
      "id": 47,
      "start": 3222.5999908447266,
      "end": 3226.6799926757812,
      "text": " If you're not sure of heaven, we'd love to take a Bible and show you how you can know for sure that heaven is your home."
    },
    {
      "id": 48,
      "start": 3226.6799926757812,
      "end": 3229.9199829101562,
      "text": " If you're saved, then maybe you just need to come and talk to the Lord this morning."
    },
    {
      "id": 49,
      "start": 3229.9199829101562,
      "end": 3237.3999938964844,
      "text": " Maybe there's something that's on your heart, you're broken, you're in need of God's care and God's grace."
    },
    {
      "id": 50,
      "start": 3237.3999938964844,
      "end": 3239.6399841308594,
      "text": " Maybe God spoke to you through some other way this morning."
    },
    {
      "id": 51,
      "start": 3239.6399841308594,
      "end": 3241.6399841308594,
      "text": " As Kimberly plays, the altar is open."
    }
  ],
  "processed_at": "2025-04-15T07:10:34.055798"
}