{
  "video_id": "G50UWUcArHE",
  "text": "text this morning, 2 Corinthians chapter number 5. We'll be looking at verses 14 through 21, 2 Corinthians 5, verses 14 through 21. When you found your place there in 2 Corinthians 5, I'd like for you to hold your place there and also turn to the book of Acts in the ninth chapter. As we think about the passage of scripture that is before us and we find the apostle Paul is writing to the church in Corinth, and we understand that Paul was used of the Lord to write much of the New Testament. I'm so thankful the Bible tells us that the word of God is given by inspiration, for all scripture is given by inspiration of God. And we understand that truth. We also understand that the Bible tells us that holy men of God spake as they were moved by the Holy Ghost. And so we find that God used human penmen, and the apostle Paul is used to write this letter to the church in Corinth. Of course, he wrote the first letter that bears that name, 1 Corinthians, and then here in 2 Corinthians. When we come to the fifth chapter, we'll be looking at verses 14 through 21 this morning. The Bible says this, for the love of Christ constraineth us, because we thus judge that if one died for all, then we're all dead, and that he died for all that they which live should not henceforth live unto themselves, but unto him which died for them and rose again. Wherefore, henceforth, know we no man after the flesh, yea? Though we have known Christ after the flesh, yet now henceforth know we Him no more. Therefore, if any man be in Christ, he is a new creature. Old things are passed away. Behold, all things are become new. And all things are of God, who hath reconciled us to Himself by Jesus Christ, and hath given to us the ministry of reconciliation. To wit, that God was in Christ reconciling the world unto Himself, not imputing their trespasses unto them, and hath committed unto us the word of reconciliation. Now then, we are ambassadors for Christ. As though God did beseech you by us, we pray you in Christ's stead, be ye reconciled to God. For He hath made Him to be sin for us who knew no sin, that we might be made the righteousness of God in Him. I'd like to preach a message that I've entitled this morning, Be Ye Reconciled to God. You see that as the last phrase of verse number 20. Be ye reconciled to God. If you trace the steps of the Apostle Paul, you find there in the passage where I asked you to hold your spot in Acts 9, you have the opportunity to read of his conversion in that passage of Scripture. Of course, we first find the man Saul at the end of Acts 7, at the stoning of Stephen, when the Bible tells us that they laid down his garments there at someone's feet. Whose feet? The one was Saul. He was consenting unto his death according to chapter 8 and verse 1. And at that time was a great persecution against the church. And you find that Saul made havoc of the church according to Acts 8 and verse 3. But in Acts 9, we find that Saul had those letters that he had desired and he was going to Damascus to the synagogues. The Bible tells us that he was going to see if he found any of this way, whether they were men or women, that he might bring them bound unto Jerusalem. But he was on the way to Damascus and suddenly, the Bible tells us that there shined round about him a light from heaven. We find that Saul, as he is there on the road to Damascus, he's going with the intent of taking and binding these Christians and bringing them back to Jerusalem and imprisoning them. And we find here that Saul is asked this question as he hears this voice, Saul, Saul, why persecutest thou me? And Saul responds with this wonderful question, who art thou, Lord? And we find that Jesus replies and He says, I am Jesus whom thou persecutest. It is hard for thee to kick against the pricks. So we find that the Holy Spirit of God had been working in conviction in the life of this man Saul and His response to this conviction was to intensify his persecution and to go with greater zeal. He made havoc of the church, as I mentioned already. And it would just be as the one would use the pricks to prod the livestock. He said it's hard for thee to kick against the pricks. And we find that Saul responds and says, Lord, what wilt thou have me to do? And it's interesting that you find that the answer that Jesus gives is to arise and go into the city and it shall be told thee what thou must do. And we find that the Lord gave Adonais the privilege, the ministry of going to Saul and to giving him some instruction. And it's interesting that we find the Bible tells us in v. 20 of Acts 9, in straightway he, speaking of Saul, preached Christ in the synagogues that he is the Son of God. Why do I use this passage of Scripture in Acts 9 as we're studying 2 Corinthians 5 this morning? Because I want you to understand the testimony of the life of the Apostle Paul. I want you to understand that in Acts 9, his conversion is recorded and I believe that as you continue to trace the steps of Paul through the book of Acts, I believe that as you read the letters that God allowed him to write to the churches and that which is contained within our New Testament, I believe that you will find that in the life of this one Paul, that he regularly rejoiced in his salvation. He never got over the fact that he was saved by the grace of God. He understood that he had been redeemed. He understood that he was reconciled to God. And we find that Paul never got over it. He rejoiced greatly. We find that on many occasions as you read through the book of Acts that Paul took the opportunity to share his personal salvation testimony and to speak of his conversion and all that Christ did for him. And I wonder this morning that as we look at the example of Paul and we begin to dig into this passage of Scripture that is before us in 2 Corinthians 5, and we find that Paul understood the miracle of salvation and the privilege that he had to know the Lord Jesus Christ, I wonder this morning if we live every day with an appreciation of our salvation. I wonder this morning if when you woke up this morning at some time during your devotions, if you thank the Lord for your salvation. God, I just want to thank You that I'm saved. I thank God for my family, but I thank God for their salvation. Not just for who they are individually and what they do and that sort of thing, but I'm thankful to God on a daily basis that they're saved. That they know the Lord Jesus Christ as their personal Savior. I thank God for my salvation and I don't ever want to get over the fact that He saved me. I don't ever want it to just become commonplace. Oh yeah, I'm saved. Oh yeah. No, no, no. I hope that we would understand and as we would have and be mindful of the price that was paid by the Lord Jesus Christ on the cross of Calvary for my sin, that it would have me regularly appreciate my salvation. We sing a song, Hallelujah, What a Savior. It's a great song. And we find that often as we think about our salvation that we would conclude with that very statement, Hallelujah, what a Savior. We have a wonderful Savior. And I'm so thankful this morning for my salvation. And as we think about this truth, be reconciled to God, it might be important for us to give a definition of what it means to be reconciled or what the truth of reconciliation is. And really it carries with it the idea of a return to favor with someone in the biblical context and what we're dealing with this morning. You find that it says be reconciled to God. And so we find that the someone is God Almighty. That's who we're to be reconciled to. We'll get into the reason that we need to be reconciled here in just a moment. We find that another definition that is given of reconciliation is the restoration of the favor of God to sinners that repent and put their trust in the substitutionary death of Christ. Be ye reconciled to God. And some of you might be watching online and say, well, I've already been saved. I've been reconciled. Well, hold on and stay with me through the entirety of the message this morning because that's a good thing and that's a wonderful thing, but there's an important impact of our reconciliation that we'll get to at the end of the message this morning. If you're taking notes, be reconciled to God. Notice number one with me, the miracle of reconciliation. The miracle of reconciliation. See, there's a problem and the problem is called sin. I got a text message from a preacher last night. He's a pastor that has retired and he Travels and he seeks to come to churches and not really in the capacity of an evangelist though He does do some evangelist type ministry But he just seeks to come alongside churches and just encourage them He and his wife stopped by our church about three or four years ago, and they called us and said hey We're gonna be in your area on a Tuesday night I believe it was and I know that you don't have service But but we'd like to just take you and your family out to dinner We just want to be a blessing and encouragement to you and he pastored for a number of years and He just wants to be a blessing to pastors and what a blessing he is and he's added me to his list and he sends Out a text every week and just seeking to encourage pastors and he said this in his text the question What can wash away my sins is? Much more important than the question. What can wash away my germs? And I thought that was kind of interesting as we deal with all that we're dealing with this morning in our world in this pandemic that's going on and the reality is that the Blood of Jesus Christ is the only thing that can cleanse us of our sin. The Bible tells us That or let me say this we sing that song what can wash away my sin? Nothing but the blood of Jesus and I'm so thankful for the blood of Christ when we think about the miracle of reconciliation We find that there's a problem. We find that that there the problem is sin. This is a problem that is certainly affecting every human being this problem of sin and this results in being at Enmity with God and we find that the Bible tells us notice in our passage of Scripture in 2nd Corinthians chapter number 5 He says this at the end of verse number 14 that if one died for all Then we're all dead Obviously you speaking about the Lord Jesus Christ dying for all why because we were dead we were dead in our sins and our trespasses We were dead spiritually We had to be quickened being made alive through that process of regeneration Being reconciled to God and we find here that he says in verse number 15 and that he died For all aren't you thankful for that? For God so loved the world But he gave his only begotten Son that whosoever believeth in him should not perish but have everlasting life We find that the question could be asked as we look at that truth in John chapter number 3 with regard to that verse of Scripture that so commonly understood in verse number 16 and often quoted we find at the End of John chapter number 3 the Bible says in verse number 35 the father loveth the Son and hath given all things into his hand He that believeth on the Son hath everlasting life And he that believeth not the Son shall not see life, but the wrath of God abideth on him Paul says this that one died for all that's the Lord Jesus Christ his substitutionary death Then we're all dead and that he died for all that they which live Should not henceforth live unto themselves, but unto him which died for them and rose again We find the miracle of reconciliation. See there's a problem The problem is sin notice what Paul says in Romans chapter number 5 That sin causes us to be at enmity with God and if we find that we're dead in our sins and our trespasses in Romans chapter number 5 a wonderful passage of Scripture dealing with Justification we find that the only way to be justified To have peace with God is through our Lord Jesus Christ. It tells us that in Romans 5 in verse number 1 Therefore being justified by faith. We have peace with God through our Lord Jesus Christ notice verse number a Eight it says this but God commendeth his love toward us and that while we were yet sinners Christ died for us much more than being now Justified how by his blood we shall be saved from wrath through him for if when we were enemies we were Reconciled to God by the death of his son much more being Reconciled we shall be saved by his life and not only so but we also joy in God through our Lord Jesus Christ by whom we have now received The atonement this is a miracle the miracle of reconciliation see the problem was sin The fact that we were born sinners. We find that in verse number 12 of the same passage of Scripture That's before us in Romans 5. The Bible says wherefore as by one man sin entered into the world We find that Paul is giving reference back to the event that is recorded in Genesis chapter number 3 when sin Entered into the world in the Garden of Eden with Adam and Eve taking of that forbidden fruit and the Bible says and death by sin and so death passed upon all men for that all Have sinned the miracle of reconciliation it starts with a problem The problem is sin, but then we see the provision. The provision is that substitutionary death of our Lord and Savior Jesus Christ on the cross of Calvary his precious blood was shed so that mankind could be redeemed and thus Reconciled to God be brought back into that to favor the restoration of favor See, we're at enmity because of our sin, but Jesus Christ died on the cross of Calvary He was buried in a borrowed tomb. He rose in victory on the third day Conquering sin death in the grave and as you trust the Lord Jesus Christ the finished work of Christ at Calvary You're redeemed and thus reconciled to God It's a wonderful truth of the Word of God And we find that this truth of reconciliation Notice he says in verse number 17 of 2nd Corinthians 5 therefore if any man be in Christ What is he? He's a new creature Old things are passed away. Behold all things are become new And all things are of God who hath reconciled us to himself by Jesus Christ The only way to be reconciled to God is through the atonement of Jesus Christ on the cross of Calvary There's no other way to have reconciliation There's no other way for that that enmity that division that separation that exists because of our sin There's no other way for reconciliation to happen except for the fact that Jesus Christ Took your place and took my place on the cross of Calvary Thus making reconciliation possible. Thus we find the miracle of reconciliation Turn back with me if you will to the book of Daniel I know that we spent the last couple of weeks on Sunday morning in the book of Daniel I had mentioned to you that we might finish up chapter number two this morning last Sunday In fact, we'll do that in two more weeks and we'll look at the remaining portion of Daniel chapter number two but this morning I want you to look at Daniel chapter number nine, I referenced this portion of Scripture Last Sunday evening as we dealt with the passage there in Jeremiah When the Bible spoke about the importance of acknowledged thine Iniquity and we find here in Daniel chapter 9 the prayer of Daniel after he understood The years and dates and what have you there's a prophecy that is recorded at the end of the book of Daniel really beginning in verse Number 20 down through the end of verse number 27 that prophecy helps us to understand Much of what's taking place during the tribulation and all of those things and we're not getting into all of that this morning But I want you to notice something that is given to us here in Daniel chapter number 9 notice in verse number 24 the Bible says this 70 weeks are determined upon thy people and upon thy holy city to finish the transgression And to make an end of sins notice this and to make reconciliation for iniquity and to bring in Everlasting righteousness and to seal up the vision and prophecy and to anoint the most holy So we find that 70 weeks we speak about the 70 weeks. We have often dealt with that We find that there's a gap between week number 69 and week number 70 in prophecy And we find that that 70th week is the week of tribulation again not to get into all of the prophecy this morning But I want you to understand that he speaks about these 70 weeks and some of that which he says that's going to take place Is that to finish the transgression and to make an end of sins and to make? Reconciliation for iniquity notice verse number 26 the Bible says and after three score and two weeks shall Messiah be cut off but not for himself and the people of the Prince that shall come shall destroy the city and the Sanctuary and the end thereof shall be with a flood and unto the end of the war desolations are determined But notice the first portion of verse number 26 and after three score and two weeks shall Messiah be cut off but not for himself We find in this verse of Scripture this prophecy that's given to Daniel that it would be after that period of time of three score and two weeks that Messiah would be cut off and Dealing with the fact of his crucifixion Notice this is but not for himself See it was a substitutionary Atonement we understand that the truth that we find in the Word of God remember That Paul says in this passage that we're studying in 2nd Corinthians chapter number five this morning, that He died for all. See, He died for us and we find that we understand in the book of 1st Peter that the Bible tells us that Jesus died, that it was for Christ also in 1st Peter 3 and verse number 18, also hath once suffered for sins, the just for the unjust. Remember in 2nd Corinthians 5 and verse number 21, for He, speaking of God, hath made Him, speaking of Jesus, to be sin for us, who knew no sin, that we might be made the righteousness of God in Him. And so you find that He says after three score and two weeks shall Messiah be cut off, but not for Himself. And we find this substitutionary death of the Lord Jesus Christ, the miracle of reconciliation. Remember I told you that Paul was the one that as he went out and he began to preach after his conversion, that he would go and he would preach Christ in the synagogues and he would say that He is the Son of God, that He is the Messiah. You find that this was his manner throughout his ministry, that you would find that he would speak about Jesus and many of those in that day knew who that person Jesus was. They understood his ministry, they were aware of his crucifixion, but he would preach to them and he would say this, specifically I'll reference one of the passages here in Acts 17 in verse number 3, opening and alleging that Christ must needs have suffered and risen again from the dead, and that this Jesus whom I preach unto you is Christ. See, Jesus, He is God incarnate, right? Jehovah is salvation is what the name means. Christ is the Messiah, the Son of God, the Anointed One. And we find that throughout the Scriptures, that as we look at Paul preaching, he says this Jesus is the Christ. Remember when the truth was given to Mary with regard to the announcement of the birth of Christ, it says that you shall call His name Jesus. Why? For He shall save His people from their sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we studied this several weeks ago, but I want you to look at two verses of Scripture in the book of Hebrews and see the fulfillment of this prophecy and see this understanding really of the miracle of reconciliation. See, this morning, the miracle that is before us as we consider that which God has done in our lives for saving our souls that we now are reconciled to God, it's a miracle. In Hebrews 2, in verse number 17, it says, wherefore in all things that behooved Him to be made like unto His brethren. Notice this, that He might be a merciful and faithful high priest in things pertaining to God to make reconciliation for the sins of the people. But how does He do that? Well, we know Hebrews 9 in verse number 22, though you won't see the word reconciliation there, you find the by or reconciled or any form of the word, but you find in Hebrews 9 in verse 22, it says, and almost all things are by the law purged with blood, and without shedding of blood is no remission. And we find this miracle of reconciliation. See, Paul, as he's writing to the believers in Corinth, and he comes to this section that we're studying this morning in 2 Corinthians chapter number 5, he's speaking about this miracle of reconciliation. Consider how he says in verse number 17, therefore if any man be in Christ, that's being saved, being born again, understanding that there's only one way to be saved, and that's through the blood of Jesus Christ. It says, He is a new creature. Old things are passed away, behold all things are become new. You see that in the life of the Apostle Paul, don't you? We read the portion in Acts 9 at his conversion. He's going out and he's seeking to persecute, he's making havoc of the church, and then he's saved and he begins to preach Christ. There's a change in his life. There is a miracle that had taken place. It's the miracle of the new birth, the miracle of reconciliation. Let me share with you one other passage of Scripture in the book of Ephesians, if you will. Turn over there and look at a few verses of Scripture in Ephesians chapter number 2, and find here how the Apostle Paul deals with the subject of reconciliation to the believers in Ephesus. Remember, if any man be in Christ and we find that in the first three chapters of the book of Ephesians that the Apostle Paul is dealing with the fact that you are in Christ, your position. Remember, as we studied the book of Genesis and we dealt with the flood of Noah's day, and we spoke about the importance of being in the ark. See, if you were outside of the ark, you were destroyed. You had to be in the ark. That was the place of refuge, the place of safety. We find that it was only Noah, his wife, his three sons, and their wives, and of course the animals, but we find that the only eight human beings were saved. Why? Because they were in the ark, and we need to be in Christ. We need to be saved this morning. We find in Ephesians 2, in verse number 12, it says this, that at that time you are without Christ, being aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hope, and without God in the world. See, that's before salvation. That's the condition of all people prior to coming to Christ. We understand, if you were to read the first few verses of the second chapter of the book of Ephesians, how that Paul has already laid that truth, that this is a universal condition for all mankind, that we are at enmity with God. We are separated from God. We are without God in the world, but notice verse 13, but now in Christ Jesus, ye who sometimes were far off are made nigh by the blood of Christ, for he is our peace, who hath made both one and hath broken down the middle wall of partition between us, having abolished in his flesh the enmity, even the law of commandments contained in ordinances, for to make in himself of twain one new man, so making peace. Notice verse 16 of Ephesians 2, and that he might reconcile both unto God in one body by the cross, having slain the enmity thereby. Remember, we speak about the miracle of reconciliation. We spoke about the problem. It's sin. It causes us to be at enmity with God. What can wash away my sin? Nothing but the blood of Jesus. Your works are not sufficient. The Bible tells us, in fact, in this same passage of Scripture, for by grace are you saved through faith, and that not of yourselves. It is the gift of God, not of works, lest any man should boast. There are people that today, I've had opportunity to speak to people throughout the years, and often as I've asked some, how is it, are you sure this morning or this evening or whatever time of day it is, that if you were to die today, that heaven would be your home? I hope so, I think so, maybe. Some that would reply with, yes, I've been saved. My sins have been washed in the blood of Jesus Christ. But most of those that would answer with the uncertainty, if I were to ask them what it was that they were trusting in, no doubt they say my works. I'm trying to be a good person. I'm doing the best I can. In that song that Juliana and Brianna sang this morning, part of that song referenced the truth in the book of Isaiah, that all of our good works are as filthy rags. There's nothing that you can do to earn your way to heaven. Jesus paid it all. Notice as you look through the verses that we've already referenced this morning, when we think about the miracle of reconciliation, it's that Jesus, God in flesh, that he took my place, that he took your place, that he paid it all. It's a miracle that the God of the universe took my place on the cross of Calvary and said, it is finished. I've paid for your sin. Isn't that a miracle? It's a wonderful, wonderful miracle. And this morning, those that have been reconciled to God, you say I've been saved, I'm so thankful, and I hope that you recognize the miracle of reconciliation. This morning, if you've never been saved, you do not have that assurance of heaven being your home. If you were to die today, there's a level of uncertainty as to what would happen. Can I tell you that Jesus died for you, that he was buried, and he rose again, and he paid for your sin, and you trust him as your personal Savior and receive the gift of God, which is eternal life through Jesus Christ our Lord, and be reconciled to God. For those of us that have been reconciled to God, I want you to understand that not only did Paul have this truth and have this understanding concerning the miracle of reconciliation, but he also understood if you're taking notes number two this morning, the ministry of reconciliation. There's the miracle... of reconciliation, but then there's the ministry of reconciliation. Notice at the end of v. 18, the Bible says this, \"...hath and hath given to us the ministry of reconciliation.\" Who's us? Those that have been reconciled. Those that have been redeemed. He's speaking here about the fact that God has given us this ministry of reconciliation so Paul had an understanding of the miracle of reconciliation. What Christ did for him so that he could be saved. And he says, based upon my understanding of the miracle of reconciliation, I'm not going to live for myself. I'm not going to live to meet my own desires and to follow my own agenda. No, I'm going to live for Christ because He died for me and He rose again. And my life, Lord, is Yours to control for me to live is Christ and to die is gain is what he says in the book of Philippians 1 and v. 21. And we find here that he understood the miracle, but he also understood the ministry. He understood that he had been entrusted with the ministry of reconciliation this morning. If you've been redeemed, if you've been reconciled to God, you're part of the us. The ministry of reconciliation. It says, \"...and hath given to us the ministry of reconciliation.\" We need to take this truth of the ministry of reconciliation, we need to take it personally. We need to understand that we personally are to be engaged in what he's dealing with here, this ministry of reconciliation. Notice in v. 19, to wit, he says this, as he's dealing with this truth of the ministry of reconciliation, he says that God was in Christ reconciling the world unto Himself, not imputing their trespasses unto them. See, the sin and the iniquity was poured upon Christ at His death on the cross. And it says here at the end of v. 19, \"...and hath committed...\" There's that word again. \"...unto us the word of reconciliation.\" So we find in v. 18, \"...he hath given to us the ministry of reconciliation.\" At the end of v. 19, \"...that he hath committed unto us the word of reconciliation.\" Remember what Jesus said right before He would go to the cross of Calvary as He's praying to His Father in John 17. And we find that He's praying there. And He says this, \"...sanctify them through Thy truth. Thy word is truth.\" But then He says in John 17, in v. 18, \"...as Thou hast sent Me into the world, even so have I also sent them into the world.\" What do you send us to do? To preach the Gospel. The ministry of reconciliation. Notice v. 20, \"...now then...\" Here's the understanding as to what's been given to us through the ministry of reconciliation, the word of reconciliation. He says, \"...now then, we are ambassadors for Christ.\" Isn't that a wonderful truth? That we're His ambassadors. What's an ambassador? It's a representative. One who goes on the behalf of another. Typically when we think about ambassadors, we think about it in the context of global, national things where we have an ambassador from the United States to a particular country and what have you. And what are they doing? They're in that country representing on the behalf of the country that they represent. And so they're in some other country representing the country of their origin. And we find here that my citizenship is no longer here upon the earth. We sing a song, \"...this world is not my home, just a passing through. My treasures are laid up somewhere beyond the blue.\" We find that there in the book of Philippians in the third chapter, the Bible speaks about our citizenship being in heaven. And what a joy that is. See, because we've experienced the miracle of reconciliation, but we understand the ministry of reconciliation. Paul put it this way in Philippians 3 in verse number 20, \"...for our conversation is in heaven. From whence also we look for the Savior, the Lord Jesus Christ.\" What a blessing to know that my citizenship is in heaven. That I'm a child of the King. This world is not my home. I'm looking forward to the day that I get to meet my Savior face to face. And forever and ever and ever spend eternity with Him in heaven. What a blessing that is. That's the miracle of reconciliation. But while we're here on earth, we're to be engaged in the ministry of reconciliation. We are His ambassadors. Notice how he continues the verse there in 2 Corinthians 5 in verse number 20, as though God did beseech you by us. We pray you in Christ's stead, be ye reconciled to God. Notice, as we're engaged in this ministry of reconciliation, that we're to go, we understand that mankind apart from Christ, that they're without God. They have no hope in the world. They have no peace. And the only way to have peace with God is through the atonement of Jesus Christ on the cross of Calvary. And only then can they be reconciled to God. It's interesting that in the preceding text of Scripture in verses 10 through 13 of 2 Corinthians 5, really Paul's dealing with a completely different subject. That of the judgment seat of Christ or the behemoth seat of Christ. And we find that he makes an interesting statement in verse number 11 of that text of Scripture that I believe is pertinent to our study this morning with regard to the ministry of reconciliation. He says, knowing therefore the terror of the Lord, we persuade men. We persuade men. But we remain manifest unto God, and I trust also remain manifest in your conscience. And I think about this truth there of 2 Corinthians 5 and verse number 11, that we have an understanding, we know therefore the terror of the Lord, that we persuade men. Have you ever read Revelation 20? You read in verses 11 through 15 of the great white throne judgment. It will happen. Listen, it's a sad thing that people are dying from this COVID-19. We find that we're praying and we're asking God to work and to have doctors with wisdom with regard to how to treat patients and all of those things. And you think about all of the efforts that are going forth in order to preserve, to save life. And we're applauding them and we're thankful for their efforts and their attempts. But we understand that there is, as of the point of end to man, wants to die. But after this, the judgment. You know that every day globally, 150,000 people die. Every day, globally. That's about the number as you look at it on an annual basis and you divide it out. It's about 150,000 people every day that die. And the reality is that if they die apart from Christ, whether someone, one of the things, let me back up and say this. One of the truths that I've mentioned during this entire pandemic is that it's going to help people to have an understanding of their mortality. And as we think about people having an understanding of their mortality, it gives us an opportunity to be able to speak to them about Christ. I said to someone not long ago, you may die of COVID-19. You may not, you may never even be infected. You could be infected and you could die. But the certainty of the scripture is that one day you will die. Whether you die from this particular virus, COVID-19, or you die from some other means, we find that death is certain. We find that Solomon says this, there's a time to be born and there's a time to die. And I'm not trying to minimize death. I'm simply saying that it's something that we face. We face this thing of death and there are many that have a fear of death. That's why we're called, as we've experienced the miracle of reconciliation, to be engaged in the ministry of reconciliation. That we would say to people, be reconciled to God. To quote, once again, the text that I received from the retired pastor last evening, the question, what can wash away my sins, is so much more important than what can wash away my germs. Again, I'm not trying to diminish or to dismiss the situation we're dealing with with COVID-19, but can I tell you that for someone that experiences healing, for someone that never deals with the exposure to this particular virus, they still have a problem, it's called sin. It is a universal condition that affects all mankind. And we find that as we would look at the passage of scripture that is before us, and many of you know that 2 Corinthians 5 in verse number 15 is my life verse, where the Bible says that He died for all, that they which live should not henceforth live unto themselves, but unto Him which died for them and rose again. And we find that the apostle Paul, as we would look at this passage of scripture, I believe that the truths that we find in this passage that Paul was sharing of the miracle of reconciliation and the ministry of reconciliation, that these two truths result. Paul did, in the Apostle Paul saying, I'm living for Christ. As I've quoted already, Philippians 1 and verse 21, for me to live is Christ, and to die is gain. See, I believe, as we trace the steps of Paul, that you see Paul recognized the miracle of reconciliation. He never got over the fact that he was reconciled to God. And he understood what salvation was as he grew, and he understood this truth of, yes, being redeemed and being justified, but being reconciled to God. That I was at enmity with God because of my sin, but now that relationship has been restored. I've been reconciled. It's a miracle. But not only did he recognize the miracle of reconciliation, I believe that Paul embraced the ministry of reconciliation. Why do we say that? Traces steps. Everywhere he goes, he's preaching Christ. Everywhere he goes, he's calling people to accept the Lord Jesus Christ as their personal Savior. When he stood there before Agrippa, and Agrippa is there and he hears the message, and in that particular passage of Scripture, we find that Paul, once again, shared his testimony of what we looked at in Acts 9 of his conversion, and he shared for those that were there, Agrippa in particular, that day in his life when he was saved. That Agrippa says, almost thou persuadest me to be a Christian. And Paul said, I would to God that not only thou, but also all that hear me this day were both almost and altogether such as I am, accept these bonds. We find that in Acts, that Paul often, excuse me, in the book of Romans, that Paul often mentions his heart's desire. You find that he says in chapter 10, in verse number 1, brethren, my heart's desire and prayer to God for Israel is that they might be saved. See, Paul embraced this ministry of reconciliation. After our first point, I kind of addressed those that maybe had never trusted the Lord Jesus Christ as their personal Savior. They never personally experienced the miracle of the new birth, the miracle of reconciliation. But as we conclude this second point this morning, I'll speak to those that have experienced the miracle of reconciliation. You recognize and rejoice in your salvation, what Christ did for you, and how that now because of that, you now are reconciled to God. But my question for you is, are you embracing the ministry of reconciliation? Are you embracing it? Remember, he says in verse 18 of our text of Scripture, he hath given to us the ministry of reconciliation. In verse 19, and hath committed unto us the word of reconciliation. In verse number 20, we are ambassadors for Christ. Again, in verse number 20, we pray you in Christ's stead, be ye reconciled to God. This morning, if you've never been saved, if you do not know the Lord Jesus Christ as your personal Savior, can I say to you, be reconciled to God. Recognize that you're a sinner, recognize that there's a penalty for sin. The Bible says the wage of sin is death. The wrath of God abideth upon you. You're at enmity with God because of your sin, and there's absolutely nothing that can atone for your sin outside of the blood of Jesus Christ. But he loved you so much that he died for you so that you could be redeemed, so that you could be reconciled to God. You understand that you're a sinner. You understand there's a penalty. You understand that the price has been paid. The Lord Jesus Christ paid it all. The Bible says the wage of sin is death, but the gift of God is eternal life through Jesus Christ our Lord. If you had to work for it, it's not a gift. It's a gift because Jesus paid for it with his own precious blood. Would you this morning be reconciled to God? Would you trust Christ as your personal Savior? For those of us that have already been saved, we can look back and point on a time in our life, maybe a specific day in our lives, when we trust that the Lord Jesus Christ is our personal Savior. We've experienced the miracle of reconciliation, but I wonder this morning, how are we doing with embracing the ministry of reconciliation? Understand that it's been entrusted to us that we have…what a privilege, by the way, to go and to speak to people and say, listen, the Lord Jesus Christ loved you so much that he died for you. What a joy to be engaged in the ministry of reconciliation, and at this particular time in our history, I believe that there's a greater awareness of the mortality of mankind. There is a level of fear. I mentioned this morning, a moment ago, how that many fear death, and one of the truths of being reconciled is the truth that we find in Hebrews 2 and verse number 15, where the Bible says, and deliver them who through fear of death were all their lifetime subject to bondage. See, I no longer have to fear death, why? Because I've trusted the one who's conquered death. What a joy. This morning, be ye reconciled to God. The miracle of reconciliation, the ministry of reconciliation. Father, we love you. We thank you for loving us. We thank you for the privilege of studying thy Word. We thank you for the truth that is contained therein. Father, we've been very specific this morning with regard to the passage of Scripture that is before us, and Lord, I pray that if there's one that does not know you as their personal Lord and Savior, that they would not allow another moment of time to pass before they place their faith and trust in the finished work of Christ at Calvary, understanding that the only way to be reconciled to God is through the Lord Jesus Christ. He paid for that sin, the sin of mankind. Lord, I pray for many believers that are watching, many of our church family that's watching this morning. God, I think of my own life, and I pray, God, that you would help me, help us to embrace the ministry of reconciliation, that we would be good ambassadors, good representatives of our Lord and Savior Jesus Christ, that we would go into a lost and dying world and lift up the Lord Jesus Christ and preach, you must be born again. I pray that we do it with passion, with compassion, and with urgency. I pray that you'd have your will and way. Lord, as we have a moment of invitation here, I pray that those at home would spend some time allowing you to speak to their hearts and search their hearts, Lord, help us to allow you to have your way in our lives, for it's in Christ's name we pray, amen. We'll have a moment of invitation here.",
  "processed_at": "2025-04-14T15:39:50.953103"
}