{
  "video_id": "gDoMZMw9sRM",
  "text": "Chapter number six this evening, and we will continue our study here through the life of Elisha, and it's been a tremendous blessing. You'll recall from last Wednesday evening that we looked at the first seven verses of 2 Kings 6, and I preached a message that I simply entitled, The Iron Did Swim. What an amazing miracle that was. I could imagine being there and being the guy that's cutting down the tree, and the axe head falls in the water. Everybody cries out for the man of God, and they throw in a stick, and the iron did swim. Amen. And what a blessing. As we continue looking and tracing the steps of Elisha, we come to the eighth verse of 2 Kings 6. We'll be looking at verses eight through 23 this evening, and I do trust that it'll be a blessing to you, and no doubt part of this passage of Scripture, if not the entirety of it, but at least part of it would be very familiar to most of you. And we'll get into that in the midst of our lesson this evening, but we know as we study this era of Israel's history over these past several chapters, and even back to the reign of Ahab and the end of his life, and the life and ministry of Elijah, we've had the opportunity to really read some of the historical setting with the Syrians going to battle against the children of Israel. And you see these things taking place. You'll recall with me the name Ben-Hadad, he's the king of Syria. And as we look at our text of Scripture this evening, we see another one of those times in which the Syrians are going to war against the nation of Israel. And the Bible tells us in verse 8, then the king of Syria warred against Israel and took counsel with his servant, saying, And such and such a place shall be my camp. And we'll get through the entirety of the text down to verse number 23 this evening, but I want to read to you verse number 16. I'll share with you the title. We'll get right into the message this evening so that we can get to that video. And verse number 16 says, And he answered, this is Elisha speaking back to his servant, and the servant here is not named. We do not believe that it's Gehazi any longer. Of course, we trace the steps of Gehazi in chapter number 5 with the miracle with Naaman and what have you. And now we find that there's a servant. The servant of the man of God is given to us here in this passage of Scripture. And Elisha says to him in verse 16, Fear not, for they that be with us are more than they that be with them. I'm going to preach a message this evening that I've simply entitled, More With Us Than With Them. More with us than with them. As we look at the text of Scripture and we see what's taking place, we find that the king of Syria, Ben-Hadad, no doubt he was perplexed as to all that was going on. As a military leader, his strategy was being put on display and he's developing his plan of attack and yet it seems as if it just keeps falling apart on him and it's not producing the results that he's expecting to produce. In fact, it seems as if those plans are spoiled on more than one occasion and Ben-Hadad comes to the conclusion that there must be a traitor in their midst. Notice with me in verses 8 through 12, as we're taking notes this evening, I want you to see that the king is informed. When I speak about the king here in this passage of Scripture being informed, I'm speaking about the king of Israel and that of course at this time is Jehoram. We notice in verse number 8, the Bible says, Then the king of Syria warred against Israel and took counsel with his servants, saying, In such and such a place shall be my camp. He's making his plans. The Bible says in verse number 9, And the man of God sent unto the king of Israel, saying, Beware that they'll pass not such a place, for thither the Syrians are come down. Now you understand the man of God in verse number 9 that's being referred to as none other than Elisha, the prophet that we have been studying. I do have a bottle of water somewhere. Thank you. Jared, leading those songs, you know I need some water. I remember you the other night, you know. And give me just a moment. For those of you that are worried on live stream, I'm not sick, amen. Got me leading songs and right into the preaching, amen. But this man of God, this is Elisha, and it tells us in verse number 9 that he sent unto the king of Israel. And this is Jehoram. He is the king of Israel. And notice what here the man of God, Elisha, says to Jehoram. He says this, Beware that thou pass not such a place, for thither the Syrians are come down. Now in verse number 8, it was Ben-Hadad, the king of Syria, that took counsel with his servants and he said, In such a such a place shall be my camp. And now Elisha is informing King Jehoram as to the plans of Ben-Hadad. These plans have been made known to Elisha by the Lord God Omnipotent, and he is not only omnipotent, but he's omniscient, and he knows all things, and he reveals the plans of Ben-Hadad to Elisha. And now Elisha informs the king of Israel, and the Bible says in verse number 10, And the king of Israel sent to the place which the man of God told him, and warned him of, and saved himself there. Notice what it says at the end of verse number 10, Not once nor twice. So this happened several times. Now can you imagine Ben-Hadad, I mean, in his military campaigns, his military career, and all the strategy that he had developed over the years, and all of the military advancements that he made, and all of these things that took place, and he's strategizing, he's developing his plan of attack, and multiple times it's thwarted. The plan seems as if it's spoiled, and he's scratching his head. I believe that there's a level of perplexity. I believe that he's troubled and frustrated at those things that are taking place. As we see in verse number 11, it says, Therefore the heart of the king of Syria, notice, was sore troubled for this thing. Can you imagine Ben-Hadad? I mean, he's wondering, how does he know? Who's telling him? I mean, what's going on? And we find that the Bible says that he was sore troubled for this thing, and he calls his servants. Now, it's interesting as we find that he calls his servants together, and he says to these servants the same ones that are mentioned in verse number 8, that he had taken counsel with them and gave them in such and such place shall be my camp, and now he calls these servants and says, will ye not show me which of us is for the king of Israel? In other words, there's a traitor amongst us. I'm sharing the plan, and somebody's taking it and giving it to the king of Israel. Who's doing it? He's troubled. He's perplexed. He's frustrated. He is absolutely confident. There's a traitor amongst them. I notice that as we come to verse number 12 that one of the servants speaks up, and notice what the servant says, none, my lord, O king. No, there's not a traitor, but notice the next words, but Elisha. But Elisha, the prophet that is in Israel, telleth the king of Israel the words that thou speakest in thy bedchamber. Now, that's got to make Ben-Hadad feel very uncomfortable. We find that Ben-Hadad has taken all of the steps necessary to ensure that his plan is good from a military perspective and the strategy and all of these things, and we find that Elisha knows the secrets that this one is speaking, even in his bedchamber. That's got to be unnerving. We find that the king of Israel is informed by Elisha, and here we find that Ben-Hadad, the king of Syria, he finds out about really what's going on and how it's Elisha that is telling the secrets, how it's Elisha that is informing, giving the information to the king of Israel, and therefore his plan is being spoiled on multiple occasions. We find that as we move through the text of Scripture, not only do we find that the king is informed by Elisha, but number two, the Syrians invade Dothan. The Bible tells us in verses 13 through 15 that now the Syrians will invade the city of Dothan. You understand why as the Bible tells us in verse number 13, and he, Ben-Hadad, said, go and spy where he is. He's heard about Elisha and he's heard that Elisha is telling his secrets, he's telling that he knows the words that he, Ben-Hadad, speaks in his own bedchamber, and he says, go and spy where he is that I may send and fetch him. And it was told him, saying, behold, he is in Dothan. And so what does Ben-Hadad do, the king of Syria, after he learns of Elisha's location? The Bible tells us that he sends a... great host, and they compassed the city.\" Notice what it says here in verse number 14, it says here, \"...therefore sent he thither horses and chariots and a great host, and they came by night and compassed the city about.\" It's interesting that he says that he sent hither, thither, excuse me, horses and chariots, and then says this, a great host, a great host. It says that they came by night and they compassed the city about. We find that the city is now surrounded. In verse number 15 it tells us, \"...when the servant of the man of God was risen early and gone forth,\" notice, \"...behold and host compassed the city both with horses and chariots.\" Elisha's servant now observes this great host of Syrians that have compassed the city, and the horses and chariots that are there, and we see that he cries out to Elisha. He says this, \"...alas, my master, how shall we do?\" Can you imagine being the servant of Elisha? The Bible says that he rose early in the morning. We don't know at what time it was, but we know that whenever, as we look at the text of Scripture, it would seem that when they retired for the evening, the Syrians were not there. Why? They came by night. When this one rises early, he goes out and he sees that there's a great host, the horses, the chariots, the Syrians compassed the city, and we find that he cries out to Elisha, and he asks this question, \"...how shall we do?\" Why were they there? For Elisha. Because Ben Hadad said, I want this guy. Remember, he said, find out where he is, go and spy where he is that I may send and fetch him. He didn't necessarily want to kill Elisha, according to what we can see here. He desired for Elisha to be returned to where he was, and we find that now Elisha is called on the scene to his servant at the end of verse number 15. Early on that morning, when he sees the host that's there, he cries out, \"...alas, my master, how shall we do?\" Notice not only that the king is informed by Elisha that the Syrians invade Dothan, but as we look at verses 16 through 23, we find that Elisha instructs his servant. I'm so thankful for the instruction that God gives us in His Word. I'm thankful that God regularly instructs His people. We've been studying the book of Joshua, and we've mentioned multiple times how God would instruct Joshua, and God was giving the information. We spoke on Sunday evening, life after the flood. As we look at those first seven verses of Genesis 9, and we consider life after the flood, and how there was some instruction that was needed by Noah and his wife, and his three sons, and their wives. They needed to be instructed. They needed some direction for life after the flood, for that which they were required and responsible for doing, and we find that God was faithful to give that instruction. And oh, even still today, as we mentioned on Sunday evening at the conclusion of the message, that God has given us instruction. The Word of God is profitable. The Bible tells us that all Scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness. Why? That the man of God may be perfect, throughly furnished unto all good works. And we find that God gives instruction, and here in this text of Scripture, we find that Elisha is the one instructing the servant. This is his servant. Again, there's no name that's ascribed to this man, but we find that Elisha is going to instruct him and give him valuable lessons, valuable truth. The truth that Elisha would give to his servant on this day is truth that we need to be aware of and hold dear to our hearts, even still to this very day. I'm so thankful that our God is immutable. It's the theological word that we use to describe the fact that our God never changes, that He is the same yesterday and today and forever. He said there in Malachi, I am the Lord, I change not. There are things changing all around us, but God never changes. He's the same. And what a joy that is. And when we consider the instruction that Elisha would give to his servant on this particular day, when the servant sees, he observes the great host that's compassed the city and he cries out and he says, how shall we do? And Elisha says, let me give you some instruction. Let me give you some instruction. Number one, we find in verse number 16 that he tells him, we've used it for our title this evening, notice he says, fear not, fear not, for they that be with us are more than they that be with them. Now there are times in our lives where we struggle with the emotion of fear. We find that here, it would seem obvious to me that Elisha says fear not, because he understands that the servant was fearful. The servant, as he observed the great host of people that compassed the city, he comes and he cries, how shall we do? And Elisha immediately responds and says, first of all, fear not. I'm so thankful that God has not given us the spirit of fear. There's a lot of fear going on in our society, in our world today. God's not giving us the spirit of fear. We know who holds tomorrow. We know that our God is in control, that He is the Lord God omnipotent, that He reigns and He rules and He has a purpose and a plan. And the reality this evening is that it does not mean that we go through life haphazardly. It does not mean that we tempt the Lord our God, but we do not have to fear. Remember, the Lord is my helper. He's the one that made heaven and earth. He is the Creator God, and I'm mindful of what Hebrews says. In Hebrews chapter 13, and it's interesting, it's the same, in the same vein of Scripture where we find that the truth is given of the immutability of God in Hebrews 13 and verse number 8, where it says, Jesus Christ, the same yesterday and today and forever. But back in verse number 5, the Bible says, let your conversation be without covetousness and be content with such things as you have. For He has said, I will never leave thee nor forsake thee, so that we may boldly say, the Lord is my helper and I will not fear what man shall do unto me. He says, fear not. Fear not. And then He tells them this, what great instruction. He says, for they that be with us are more than they that be with them. Hold on, Elisha. It's just two. Did you see all of them? Can you see? Get yourself in the mind of the servant, right? The servant's the one that went outside. The servant's the one that saw the Syrians compass the city. He's seen the great host. He's seen the horses and the chariots, and he runs into Elisha and says, alas, my master. He says, how shall we do? And Elisha says, fear not. There's more with us than with them. Elisha, I know it's early. You haven't had your coffee yet. I don't think they drank coffee. Maybe they did. But the reality is that Elisha, there's but two. Have you seen them? See, Elisha had vision that this man did not have. Elisha understood something about God and about God's plan that this man could not see, and he needed some instruction. He needed some enlightenment. He needed his eyes to be open, and that's exactly what Elisha prays in verse number 17, when the Bible says that Elisha prayed and said, Lord, I pray thee, open his eyes that he may see. Open his eyes that he may see, and the Lord opened the eyes of the young man, and he saw. And the Bible says this, behold, the mountain was full of horses and chariots of fire round about Elisha. Now, I'm wondering how this servant must have felt at this particular moment. He saw the host of the Syrians. He saw that they compassed the city. He saw the horses and the chariots, and Elisha prays and says, Lord, open his eyes that he would see. And the Bible says that God answered that prayer, and he opened the eyes of this man, and he saw. And what does he see? He sees that the mountain is full of horses and chariots of fire round about Elisha. That had to be encouraging. Amen? The perspective of this servant is changed in a hurry. Why? Because he understands something that Elisha had understood. He has this spiritual awareness that prior to his eyes being open, he was just not aware of. He now has this spiritual awareness. Last year, as we taught and preached through the book of Ephesians during our Sunday morning series, Be Strong in the Lord, I often dealt with the fact that we are engaged in a spiritual battle, spiritual warfare. We're not dealing with a cultural war. I understand that people in the media and people in our society want to speak about culture wars and various class wars and what have you. We're dealing with a spiritual battle. We're dealing with spiritual wickedness in high places, and when we understand this spiritual battle, when we understand that it's a battle between good and evil, the enemy of God, Satan himself, is doing all that he can to attack the plan of God and the purpose of God, and he hates the people of God. He wants to destroy you. He wants to destroy us. He wants to destroy the church. But we know that God says that He is greater. We know that God has said, I will build My church, and the gates of hell shall not prevail against it. We have great promises from God Almighty, and here we find that the man's eyes are open, and he's made aware through the instruction of Elisha of the protection of God. We find that throughout the Word of God, there's truth given to us with regard to the power of God and the work of God. In Psalm 118 v. 6, I'll read just a few verses for you quickly this evening, and I'll give you the reference. Psalm 118 v. 6, the psalmist says, The Lord is on my side. I will not fear what can man do unto me. The Lord is on my side. I will not fear what can man do unto me. Consider with me a couple of verses of Scripture in the book of Romans in the New Testament. In Romans 8, we find that the Apostle Paul is giving great truth here to these believers, and we find in v. 31 of Romans 8, he says, what shall we then say to these things? If God be for us, who can be against us? V. 37, Nay, in all these things we are more than conquerors through Him that loved us. In 1 Corinthians 15 and v. 57, a passage of Scripture that we often go to and speak about the resurrection of our Savior, and it is the great chapter dealing with the resurrection. It's about Christ's victory and the impact of His victory and the truth that we too will rise. And what a blessing that is. But we notice in v. 57 that he says, But thanks be to God, which giveth us the victory through our Lord Jesus Christ. Therefore, my beloved brethren, be you steadfast, unmovable, always abounding in the work of the Lord, for as much as you know that your labor is not in vain in the Lord. We sing victory in Jesus. What a great song. Old Curtis Hudson with the Lord now. He was with the Lord before I was ever saved. And I have read some of his things and I've understood that often when he'd preach, he would sing that song. I'm on the winning side. And what a joy to know that we are more than conquerors. See, this servant is receiving some instruction from Elisha. He's being informed with regard to the plan of God and the power of God. We notice that here in v. 18 that Elisha prays a bold prayer and we find that this thing comes to pass. And we find that he, the servant, would understand the fact that God hears and answers prayer. Notice in v. 18, And when they came down to him, Elisha prayed unto the Lord and said, Smite this people, I pray thee, with blindness. And he smote them with blindness according to the word of Elisha. That's good instruction, right? The servant sees that God hears and answers prayer. What a joy to know that we have a God that hears and answers prayer. To understand that the effectual, fervent prayer of a righteous man availeth much, the Bible tells us in James 5. We find that there are prayer promises throughout the Word of God, many of which we've quoted, we've committed to memory. Jeremiah 33 v. 3, Call unto Me and I will answer thee and show thee great and mighty things which thou knowest not. We find in the book of Ephesians in v. 20 of chapter 3, unto Him which is able to do exceeding abundantly above all that we ask or think. We have this confidence that if we pray according to His will, He heareth us. We find that in 1 John 5. What a joy. What great instruction that this servant receives with regard to the power of prayer. Elisha prays and it's done. It says in v. 19, And Elisha said unto them, Notice, it's interesting what happens. Elisha prays that this great host that comes, he says, Lord, smite him with blindness. God smites him with blindness. And then Elisha says to them in v. 19, This is not the way, neither is this the city. Follow me and I will bring you to the man whom you seek. This is comical. This is hilarious. Elisha says you're in the wrong place. Let me lead you to where you need to go. After God had smitten them with blindness, and answering the prayer of Elisha, and Elisha leads them to Samaria, the Bible says that they came to Samaria in v. 20, when they were coming to Samaria, that Elisha said, Lord, open the eyes of these men that they may see. And the Lord opened their eyes. Again, answered prayer. And they saw. And behold, they were in the midst of Samaria. Notice in v. 21, the Bible says, The king of Israel said unto Elisha, when he saw them, My father, shall I smite them? Shall I smite them? Elisha says, thou shalt not smite them. What dost thou smite those whom thou hast taken captive with thy sword and with thy bow? Set bread and water before them, that they may eat and drink and go to their master. And he prepared great provision for them. When they had eaten and drunk, he sent them away. And they went to their master. The Bible doesn't tell us what happens when they get back to their master. But I'd love to have been there. Right? Wouldn't you? They come back and Elisha's not with them. Why is the whole purpose that Ben-Hadad sent them? He knew where Elisha was. He's in Dothan. The spies told him they were aware of his location. Go and fetch him. Bring him to me. They come back. What's he expecting? Where's Elisha? He's not here. What happened? Well, let me tell you what happened. Can you imagine these servants telling the story of what happened? I mean, they were smitten with blindness. They were led to Samaria. Their eyes were opened. They now could see. They were fed by the King of Israel. Then they go back to their master empty-handed. The Bible says at the end of v. 23, so the bands of Syria came no more into the land of Israel. This obviously didn't last a lengthy period of time with the conflict ended between the Syrians and the Israelites, for we see that as we continue moving through the passage of Scripture, there's a period of time between v. 23 and 24. We don't know how long. But then we find that there's another event that is given to us with regard to the Syrians besieging the city of Samaria. But we find that these Syrians are led to Samaria. Their blindness is miraculously healed. And then they are fed and returned to Ben-Hadad empty-handed, all the while Elisha's protected. He's protected miraculously. This is wonderful instruction for this servant. See, Elisha understood many of these things obviously in his life. He'd experienced the mighty power of God in his life. He'd experienced the miracles and the answered prayer. But now this servant, when he first goes out on that early morning, and he sees the great hosts, the horses and the chariots, and he says, the city is compassed about with these Syrians. There's a great host. Alas, my master, how shall we do? Fear not. There are more with us than with them. All he needed to do was be able to see properly. To be enlightened. Elisha was aware of the presence of God and of the power of God. And this servant that is given to us here in 2 Kings 6, he was instructed, and the instruction that he received is the instruction that we still need today. Our God is in control. Our God is able to protect us. He is able to do exceeding abundantly above all that we ask or think. He has a plan and His plan is perfect. He makes no mistakes whatsoever. And we can rejoice in understanding that He hears and answers prayer. He extends to us that invitation to call unto Him. And this evening, we find that Elisha says to this servant, there are more with us than with them. If God be for us, who can be against us? We are more than conquerors. More than conquerors. I'm so thankful for victory through the Lord Jesus Christ. And that we can sing with Curtis Hudson, I am on the winning side. Don't leave us. We're going to pray and then we're going to watch the update video. And let's pray. Father, we love You. Thank You for loving us. Thank You for this account that You gave us in Your Word. We thank You for the historical truth of the record. Just the miraculous events that transpire and how through these circumstances, You were allowing this servant to be instructed. You were allowing this servant to learn truth about Your plan and Your power and Your protection. About the privilege and answer to prayer. What a joy. God, I pray this evening that as we've observed some of the instruction that this servant has received, that we too would be instructed and that we would be encouraged and strengthened in our walk with Thee. We thank You for the missionaries that You've given us the opportunity to support. I pray that as we watch this update video that You'd help us to be encouraged and strengthened. I pray that You would just continue to use us to be a blessing to these missionaries around the world. And we'll thank You for it. In Christ's name we pray. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.71999979019165,
      "text": " Chapter number six this evening, and we will continue our study here through the life of"
    },
    {
      "id": 1,
      "start": 5.71999979019165,
      "end": 8.600000381469727,
      "text": " Elisha, and it's been a tremendous blessing."
    },
    {
      "id": 2,
      "start": 8.600000381469727,
      "end": 12.880000114440918,
      "text": " You'll recall from last Wednesday evening that we looked at the first seven verses of"
    },
    {
      "id": 3,
      "start": 12.880000114440918,
      "end": 18.559999465942383,
      "text": " 2 Kings 6, and I preached a message that I simply entitled, The Iron Did Swim."
    },
    {
      "id": 4,
      "start": 18.559999465942383,
      "end": 20.31999969482422,
      "text": " What an amazing miracle that was."
    },
    {
      "id": 5,
      "start": 20.31999969482422,
      "end": 24.920000076293945,
      "text": " I could imagine being there and being the guy that's cutting down the tree, and the"
    },
    {
      "id": 6,
      "start": 24.920000076293945,
      "end": 26.440000534057617,
      "text": " axe head falls in the water."
    },
    {
      "id": 7,
      "start": 26.440000534057617,
      "end": 31.68000030517578,
      "text": " Everybody cries out for the man of God, and they throw in a stick, and the iron did swim."
    },
    {
      "id": 8,
      "start": 31.68000030517578,
      "end": 32.68000030517578,
      "text": " Amen."
    },
    {
      "id": 9,
      "start": 32.68000030517578,
      "end": 33.68000030517578,
      "text": " And what a blessing."
    },
    {
      "id": 10,
      "start": 33.68000030517578,
      "end": 39.08000183105469,
      "text": " As we continue looking and tracing the steps of Elisha, we come to the eighth verse of"
    },
    {
      "id": 11,
      "start": 39.08000183105469,
      "end": 40.08000183105469,
      "text": " 2 Kings 6."
    },
    {
      "id": 12,
      "start": 40.08000183105469,
      "end": 44.91999816894531,
      "text": " We'll be looking at verses eight through 23 this evening, and I do trust that it'll be"
    },
    {
      "id": 13,
      "start": 44.91999816894531,
      "end": 50.15999984741211,
      "text": " a blessing to you, and no doubt part of this passage of Scripture, if not the entirety"
    },
    {
      "id": 14,
      "start": 50.15999984741211,
      "end": 53.79999923706055,
      "text": " of it, but at least part of it would be very familiar to most of you."
    },
    {
      "id": 15,
      "start": 54.15999984741211,
      "end": 60.84000015258789,
      "text": " And we'll get into that in the midst of our lesson this evening, but we know as we study"
    },
    {
      "id": 16,
      "start": 60.84000015258789,
      "end": 68.68000030517578,
      "text": " this era of Israel's history over these past several chapters, and even back to the reign"
    },
    {
      "id": 17,
      "start": 68.68000030517578,
      "end": 77.23999786376953,
      "text": " of Ahab and the end of his life, and the life and ministry of Elijah, we've had the opportunity"
    },
    {
      "id": 18,
      "start": 77.23999786376953,
      "end": 82.77999877929688,
      "text": " to really read some of the historical setting with the Syrians going to battle against the"
    },
    {
      "id": 19,
      "start": 82.77999877929688,
      "end": 83.77999877929688,
      "text": " children of Israel."
    },
    {
      "id": 20,
      "start": 83.77999877929688,
      "end": 86.62000274658203,
      "text": " And you see these things taking place."
    },
    {
      "id": 21,
      "start": 86.62000274658203,
      "end": 90.9800033569336,
      "text": " You'll recall with me the name Ben-Hadad, he's the king of Syria."
    },
    {
      "id": 22,
      "start": 90.9800033569336,
      "end": 96.62000274658203,
      "text": " And as we look at our text of Scripture this evening, we see another one of those times"
    },
    {
      "id": 23,
      "start": 96.62000274658203,
      "end": 102.18000030517578,
      "text": " in which the Syrians are going to war against the nation of Israel."
    },
    {
      "id": 24,
      "start": 102.18000030517578,
      "end": 107.5,
      "text": " And the Bible tells us in verse 8, then the king of Syria warred against Israel and took"
    },
    {
      "id": 25,
      "start": 107.5,
      "end": 114.30000305175781,
      "text": " counsel with his servant, saying, And such and such a place shall be my camp."
    },
    {
      "id": 26,
      "start": 114.30000305175781,
      "end": 119.05999755859375,
      "text": " And we'll get through the entirety of the text down to verse number 23 this evening,"
    },
    {
      "id": 27,
      "start": 119.05999755859375,
      "end": 121.45999908447266,
      "text": " but I want to read to you verse number 16."
    },
    {
      "id": 28,
      "start": 121.45999908447266,
      "end": 122.45999908447266,
      "text": " I'll share with you the title."
    },
    {
      "id": 29,
      "start": 122.45999908447266,
      "end": 126.5,
      "text": " We'll get right into the message this evening so that we can get to that video."
    },
    {
      "id": 30,
      "start": 126.5,
      "end": 132.77999877929688,
      "text": " And verse number 16 says, And he answered, this is Elisha speaking back to his servant,"
    },
    {
      "id": 31,
      "start": 132.77999877929688,
      "end": 135.16000366210938,
      "text": " and the servant here is not named."
    },
    {
      "id": 32,
      "start": 135.16000366210938,
      "end": 138.0800018310547,
      "text": " We do not believe that it's Gehazi any longer."
    },
    {
      "id": 33,
      "start": 138.0800018310547,
      "end": 143.36000061035156,
      "text": " Of course, we trace the steps of Gehazi in chapter number 5 with the miracle with Naaman"
    },
    {
      "id": 34,
      "start": 143.36000061035156,
      "end": 144.36000061035156,
      "text": " and what have you."
    },
    {
      "id": 35,
      "start": 144.36000061035156,
      "end": 146.32000732421875,
      "text": " And now we find that there's a servant."
    },
    {
      "id": 36,
      "start": 146.32000732421875,
      "end": 151.0800018310547,
      "text": " The servant of the man of God is given to us here in this passage of Scripture."
    },
    {
      "id": 37,
      "start": 151.0800018310547,
      "end": 159.67999267578125,
      "text": " And Elisha says to him in verse 16, Fear not, for they that be with us are more than they"
    },
    {
      "id": 38,
      "start": 159.67999267578125,
      "end": 161.8800048828125,
      "text": " that be with them."
    },
    {
      "id": 39,
      "start": 161.8800048828125,
      "end": 167.60000610351562,
      "text": " I'm going to preach a message this evening that I've simply entitled, More With Us Than"
    },
    {
      "id": 40,
      "start": 167.60000610351562,
      "end": 169.16000366210938,
      "text": " With Them."
    },
    {
      "id": 41,
      "start": 169.16000366210938,
      "end": 172.0,
      "text": " More with us than with them."
    },
    {
      "id": 42,
      "start": 172.0,
      "end": 176.36000061035156,
      "text": " As we look at the text of Scripture and we see what's taking place, we find that the"
    },
    {
      "id": 43,
      "start": 176.36000061035156,
      "end": 182.86000061035156,
      "text": " king of Syria, Ben-Hadad, no doubt he was perplexed as to all that was going on."
    },
    {
      "id": 44,
      "start": 182.86000061035156,
      "end": 190.52000427246094,
      "text": " As a military leader, his strategy was being put on display and he's developing his plan"
    },
    {
      "id": 45,
      "start": 190.52000427246094,
      "end": 197.32000732421875,
      "text": " of attack and yet it seems as if it just keeps falling apart on him and it's not producing"
    },
    {
      "id": 46,
      "start": 197.32000732421875,
      "end": 199.67999267578125,
      "text": " the results that he's expecting to produce."
    },
    {
      "id": 47,
      "start": 199.67999267578125,
      "end": 205.77999877929688,
      "text": " In fact, it seems as if those plans are spoiled on more than one occasion and Ben-Hadad comes"
    },
    {
      "id": 48,
      "start": 205.77999877929688,
      "end": 210.27999877929688,
      "text": " to the conclusion that there must be a traitor in their midst."
    },
    {
      "id": 49,
      "start": 210.27999877929688,
      "end": 216.44000244140625,
      "text": " Notice with me in verses 8 through 12, as we're taking notes this evening, I want you"
    },
    {
      "id": 50,
      "start": 216.44000244140625,
      "end": 219.72000122070312,
      "text": " to see that the king is informed."
    },
    {
      "id": 51,
      "start": 219.72000122070312,
      "end": 224.0800018310547,
      "text": " When I speak about the king here in this passage of Scripture being informed, I'm speaking"
    },
    {
      "id": 52,
      "start": 224.0800018310547,
      "end": 230.16000366210938,
      "text": " about the king of Israel and that of course at this time is Jehoram."
    },
    {
      "id": 53,
      "start": 230.16000366210938,
      "end": 235.0800018310547,
      "text": " We notice in verse number 8, the Bible says, Then the king of Syria warred against Israel"
    },
    {
      "id": 54,
      "start": 235.0800018310547,
      "end": 244.0399932861328,
      "text": " and took counsel with his servants, saying, In such and such a place shall be my camp."
    },
    {
      "id": 55,
      "start": 244.0399932861328,
      "end": 246.47999572753906,
      "text": " He's making his plans."
    },
    {
      "id": 56,
      "start": 246.47999572753906,
      "end": 252.9199981689453,
      "text": " The Bible says in verse number 9, And the man of God sent unto the king of Israel, saying,"
    },
    {
      "id": 57,
      "start": 252.9199981689453,
      "end": 259.67999267578125,
      "text": " Beware that they'll pass not such a place, for thither the Syrians are come down."
    },
    {
      "id": 58,
      "start": 259.67999267578125,
      "end": 263.79998779296875,
      "text": " Now you understand the man of God in verse number 9 that's being referred to as none"
    },
    {
      "id": 59,
      "start": 263.79998779296875,
      "end": 268.760009765625,
      "text": " other than Elisha, the prophet that we have been studying."
    },
    {
      "id": 60,
      "start": 268.760009765625,
      "end": 271.6400146484375,
      "text": " I do have a bottle of water somewhere."
    },
    {
      "id": 61,
      "start": 271.6400146484375,
      "end": 272.6400146484375,
      "text": " Thank you."
    },
    {
      "id": 62,
      "start": 272.6400146484375,
      "end": 274.6000061035156,
      "text": " Jared, leading those songs, you know I need some water."
    },
    {
      "id": 63,
      "start": 274.6000061035156,
      "end": 276.760009765625,
      "text": " I remember you the other night, you know."
    },
    {
      "id": 64,
      "start": 276.760009765625,
      "end": 280.1199951171875,
      "text": " And give me just a moment."
    },
    {
      "id": 65,
      "start": 280.1199951171875,
      "end": 285.1600036621094,
      "text": " For those of you that are worried on live stream, I'm not sick, amen."
    },
    {
      "id": 66,
      "start": 285.1600036621094,
      "end": 289.8800048828125,
      "text": " Got me leading songs and right into the preaching, amen."
    },
    {
      "id": 67,
      "start": 289.8800048828125,
      "end": 298.6400146484375,
      "text": " But this man of God, this is Elisha, and it tells us in verse number 9 that he sent unto"
    },
    {
      "id": 68,
      "start": 298.6400146484375,
      "end": 300.55999755859375,
      "text": " the king of Israel."
    },
    {
      "id": 69,
      "start": 300.55999755859375,
      "end": 301.67999267578125,
      "text": " And this is Jehoram."
    },
    {
      "id": 70,
      "start": 301.67999267578125,
      "end": 303.4800109863281,
      "text": " He is the king of Israel."
    },
    {
      "id": 71,
      "start": 303.4800109863281,
      "end": 308.44000244140625,
      "text": " And notice what here the man of God, Elisha, says to Jehoram."
    },
    {
      "id": 72,
      "start": 308.44000244140625,
      "end": 317.3999938964844,
      "text": " He says this, Beware that thou pass not such a place, for thither the Syrians are come"
    },
    {
      "id": 73,
      "start": 317.3999938964844,
      "end": 318.3999938964844,
      "text": " down."
    },
    {
      "id": 74,
      "start": 318.3999938964844,
      "end": 323.8399963378906,
      "text": " Now in verse number 8, it was Ben-Hadad, the king of Syria, that took counsel with his"
    },
    {
      "id": 75,
      "start": 323.8399963378906,
      "end": 330.0400085449219,
      "text": " servants and he said, In such a such a place shall be my camp."
    },
    {
      "id": 76,
      "start": 330.0400085449219,
      "end": 336.9200134277344,
      "text": " And now Elisha is informing King Jehoram as to the plans of Ben-Hadad."
    },
    {
      "id": 77,
      "start": 336.9200134277344,
      "end": 343.44000244140625,
      "text": " These plans have been made known to Elisha by the Lord God Omnipotent, and he is not"
    },
    {
      "id": 78,
      "start": 343.44000244140625,
      "end": 348.3999938964844,
      "text": " only omnipotent, but he's omniscient, and he knows all things, and he reveals the plans"
    },
    {
      "id": 79,
      "start": 348.3999938964844,
      "end": 350.3999938964844,
      "text": " of Ben-Hadad to Elisha."
    },
    {
      "id": 80,
      "start": 350.3999938964844,
      "end": 356.5199890136719,
      "text": " And now Elisha informs the king of Israel, and the Bible says in verse number 10, And"
    },
    {
      "id": 81,
      "start": 356.5199890136719,
      "end": 362.6000061035156,
      "text": " the king of Israel sent to the place which the man of God told him, and warned him of,"
    },
    {
      "id": 82,
      "start": 362.6000061035156,
      "end": 364.3999938964844,
      "text": " and saved himself there."
    },
    {
      "id": 83,
      "start": 364.3999938964844,
      "end": 369.3399963378906,
      "text": " Notice what it says at the end of verse number 10, Not once nor twice."
    },
    {
      "id": 84,
      "start": 369.3399963378906,
      "end": 371.67999267578125,
      "text": " So this happened several times."
    },
    {
      "id": 85,
      "start": 371.67999267578125,
      "end": 377.44000244140625,
      "text": " Now can you imagine Ben-Hadad, I mean, in his military campaigns, his military career,"
    },
    {
      "id": 86,
      "start": 377.44000244140625,
      "end": 384.0400085449219,
      "text": " and all the strategy that he had developed over the years, and all of the military advancements"
    },
    {
      "id": 87,
      "start": 384.0799865722656,
      "end": 389.0400085449219,
      "text": " that he made, and all of these things that took place, and he's strategizing, he's developing"
    },
    {
      "id": 88,
      "start": 389.0400085449219,
      "end": 394.20001220703125,
      "text": " his plan of attack, and multiple times it's thwarted."
    },
    {
      "id": 89,
      "start": 394.20001220703125,
      "end": 399.67999267578125,
      "text": " The plan seems as if it's spoiled, and he's scratching his head."
    },
    {
      "id": 90,
      "start": 399.67999267578125,
      "end": 402.1199951171875,
      "text": " I believe that there's a level of perplexity."
    },
    {
      "id": 91,
      "start": 402.1199951171875,
      "end": 406.44000244140625,
      "text": " I believe that he's troubled and frustrated at those things that are taking place."
    },
    {
      "id": 92,
      "start": 406.44000244140625,
      "end": 412.1600036621094,
      "text": " As we see in verse number 11, it says, Therefore the heart of the king of Syria, notice, was"
    },
    {
      "id": 93,
      "start": 412.1600036621094,
      "end": 416.0,
      "text": " sore troubled for this thing."
    },
    {
      "id": 94,
      "start": 416.0,
      "end": 417.0,
      "text": " Can you imagine Ben-Hadad?"
    },
    {
      "id": 95,
      "start": 417.0,
      "end": 420.7200012207031,
      "text": " I mean, he's wondering, how does he know?"
    },
    {
      "id": 96,
      "start": 420.7200012207031,
      "end": 421.8800048828125,
      "text": " Who's telling him?"
    },
    {
      "id": 97,
      "start": 421.8800048828125,
      "end": 424.0400085449219,
      "text": " I mean, what's going on?"
    },
    {
      "id": 98,
      "start": 424.0400085449219,
      "end": 428.7200012207031,
      "text": " And we find that the Bible says that he was sore troubled for this thing, and he calls"
    },
    {
      "id": 99,
      "start": 428.7200012207031,
      "end": 429.7200012207031,
      "text": " his servants."
    },
    {
      "id": 100,
      "start": 429.7200012207031,
      "end": 433.9200134277344,
      "text": " Now, it's interesting as we find that he calls his servants together, and he says to these"
    },
    {
      "id": 101,
      "start": 433.9200134277344,
      "end": 437.9800109863281,
      "text": " servants the same ones that are mentioned in verse number 8, that he had taken counsel"
    },
    {
      "id": 102,
      "start": 437.9800109863281,
      "end": 443.8599853515625,
      "text": " with them and gave them in such and such place shall be my camp, and now he calls these"
    },
    {
      "id": 103,
      "start": 443.8599853515625,
      "end": 450.94000244140625,
      "text": " servants and says, will ye not show me which of us is for the king of Israel?"
    },
    {
      "id": 104,
      "start": 450.94000244140625,
      "end": 454.6199951171875,
      "text": " In other words, there's a traitor amongst us."
    },
    {
      "id": 105,
      "start": 454.6199951171875,
      "end": 460.29998779296875,
      "text": " I'm sharing the plan, and somebody's taking it and giving it to the king of Israel."
    },
    {
      "id": 106,
      "start": 460.29998779296875,
      "end": 461.29998779296875,
      "text": " Who's doing it?"
    },
    {
      "id": 107,
      "start": 461.29998779296875,
      "end": 462.7799987792969,
      "text": " He's troubled."
    },
    {
      "id": 108,
      "start": 462.7799987792969,
      "end": 464.5400085449219,
      "text": " He's perplexed."
    },
    {
      "id": 109,
      "start": 464.5400085449219,
      "end": 466.29998779296875,
      "text": " He's frustrated."
    },
    {
      "id": 110,
      "start": 466.29998779296875,
      "end": 467.7799987792969,
      "text": " He is absolutely confident."
    },
    {
      "id": 111,
      "start": 468.5799865722656,
      "end": 469.5799865722656,
      "text": " There's a traitor amongst them."
    },
    {
      "id": 112,
      "start": 469.5799865722656,
      "end": 475.17999267578125,
      "text": " I notice that as we come to verse number 12 that one of the servants speaks up, and notice"
    },
    {
      "id": 113,
      "start": 475.17999267578125,
      "end": 479.29998779296875,
      "text": " what the servant says, none, my lord, O king."
    },
    {
      "id": 114,
      "start": 479.29998779296875,
      "end": 486.6600036621094,
      "text": " No, there's not a traitor, but notice the next words, but Elisha."
    },
    {
      "id": 115,
      "start": 486.6600036621094,
      "end": 494.0199890136719,
      "text": " But Elisha, the prophet that is in Israel, telleth the king of Israel the words that"
    },
    {
      "id": 116,
      "start": 494.0199890136719,
      "end": 497.6199951171875,
      "text": " thou speakest in thy bedchamber."
    },
    {
      "id": 117,
      "start": 498.4599914550781,
      "end": 501.4599914550781,
      "text": " Now, that's got to make Ben-Hadad feel very uncomfortable."
    },
    {
      "id": 118,
      "start": 501.4599914550781,
      "end": 507.4200134277344,
      "text": " We find that Ben-Hadad has taken all of the steps necessary to ensure that his plan is"
    },
    {
      "id": 119,
      "start": 507.4200134277344,
      "end": 511.94000244140625,
      "text": " good from a military perspective and the strategy and all of these things, and we find that"
    },
    {
      "id": 120,
      "start": 511.94000244140625,
      "end": 518.6199951171875,
      "text": " Elisha knows the secrets that this one is speaking, even in his bedchamber."
    },
    {
      "id": 121,
      "start": 518.6199951171875,
      "end": 520.6199951171875,
      "text": " That's got to be unnerving."
    },
    {
      "id": 122,
      "start": 520.6199951171875,
      "end": 528.6199951171875,
      "text": " We find that the king of Israel is informed by Elisha, and here we find that Ben-Hadad,"
    },
    {
      "id": 123,
      "start": 528.6199951171875,
      "end": 535.0599975585938,
      "text": " the king of Syria, he finds out about really what's going on and how it's Elisha that is"
    },
    {
      "id": 124,
      "start": 535.0599975585938,
      "end": 539.3800048828125,
      "text": " telling the secrets, how it's Elisha that is informing, giving the information to the"
    },
    {
      "id": 125,
      "start": 539.3800048828125,
      "end": 544.97998046875,
      "text": " king of Israel, and therefore his plan is being spoiled on multiple occasions."
    },
    {
      "id": 126,
      "start": 544.97998046875,
      "end": 549.0999755859375,
      "text": " We find that as we move through the text of Scripture, not only do we find that the king"
    },
    {
      "id": 127,
      "start": 549.0999755859375,
      "end": 555.7000122070312,
      "text": " is informed by Elisha, but number two, the Syrians invade Dothan."
    },
    {
      "id": 128,
      "start": 555.7000122070312,
      "end": 560.3400268554688,
      "text": " The Bible tells us in verses 13 through 15 that now the Syrians will invade the city"
    },
    {
      "id": 129,
      "start": 560.3400268554688,
      "end": 561.5800170898438,
      "text": " of Dothan."
    },
    {
      "id": 130,
      "start": 561.5800170898438,
      "end": 567.1799926757812,
      "text": " You understand why as the Bible tells us in verse number 13, and he, Ben-Hadad, said,"
    },
    {
      "id": 131,
      "start": 567.1799926757812,
      "end": 571.0599975585938,
      "text": " go and spy where he is."
    },
    {
      "id": 132,
      "start": 571.0599975585938,
      "end": 575.7000122070312,
      "text": " He's heard about Elisha and he's heard that Elisha is telling his secrets, he's telling"
    },
    {
      "id": 133,
      "start": 575.780029296875,
      "end": 581.1799926757812,
      "text": " that he knows the words that he, Ben-Hadad, speaks in his own bedchamber, and he says,"
    },
    {
      "id": 134,
      "start": 581.1799926757812,
      "end": 586.5399780273438,
      "text": " go and spy where he is that I may send and fetch him."
    },
    {
      "id": 135,
      "start": 586.5399780273438,
      "end": 591.0999755859375,
      "text": " And it was told him, saying, behold, he is in Dothan."
    },
    {
      "id": 136,
      "start": 591.0999755859375,
      "end": 598.5399780273438,
      "text": " And so what does Ben-Hadad do, the king of Syria, after he learns of Elisha's location?"
    },
    {
      "id": 137,
      "start": 598.5399780273438,
      "end": 600.02001953125,
      "text": " The Bible tells us that he sends a..."
    },
    {
      "id": 0,
      "start": 600.02001953125,
      "end": 605.3800196647644,
      "text": " great host, and they compassed the city.\" Notice what it says here in verse"
    },
    {
      "id": 1,
      "start": 605.3800196647644,
      "end": 610.8600196838379,
      "text": " number 14, it says here, \"...therefore sent he thither horses and chariots and a great"
    },
    {
      "id": 2,
      "start": 610.8600196838379,
      "end": 619.2600193023682,
      "text": " host, and they came by night and compassed the city about.\" It's interesting"
    },
    {
      "id": 3,
      "start": 619.2600193023682,
      "end": 625.3000202178955,
      "text": " that he says that he sent hither, thither, excuse me, horses and chariots, and then"
    },
    {
      "id": 4,
      "start": 625.3000202178955,
      "end": 631.8600196838379,
      "text": " says this, a great host, a great host. It says that they came by night and they"
    },
    {
      "id": 5,
      "start": 631.8600196838379,
      "end": 639.1400184631348,
      "text": " compassed the city about. We find that the city is now surrounded. In verse"
    },
    {
      "id": 6,
      "start": 639.1400184631348,
      "end": 642.9400177001953,
      "text": " number 15 it tells us, \"...when the servant of the man of God was risen early and"
    },
    {
      "id": 7,
      "start": 642.9400177001953,
      "end": 649.7000198364258,
      "text": " gone forth,\" notice, \"...behold and host compassed the city both with horses and"
    },
    {
      "id": 8,
      "start": 649.7000198364258,
      "end": 657.0600204467773,
      "text": " chariots.\" Elisha's servant now observes this great host of Syrians that have"
    },
    {
      "id": 9,
      "start": 657.0600204467773,
      "end": 662.02001953125,
      "text": " compassed the city, and the horses and chariots that are there, and we see that"
    },
    {
      "id": 10,
      "start": 662.02001953125,
      "end": 670.6600189208984,
      "text": " he cries out to Elisha. He says this, \"...alas, my master, how shall we do?\" Can you"
    },
    {
      "id": 11,
      "start": 670.6600189208984,
      "end": 675.02001953125,
      "text": " imagine being the servant of Elisha? The Bible says that he rose early in the"
    },
    {
      "id": 12,
      "start": 675.02001953125,
      "end": 679.8200225830078,
      "text": " morning. We don't know at what time it was, but we know that whenever, as we look"
    },
    {
      "id": 13,
      "start": 679.8200225830078,
      "end": 684.7000198364258,
      "text": " at the text of Scripture, it would seem that when they retired for the evening,"
    },
    {
      "id": 14,
      "start": 684.7000198364258,
      "end": 690.9800186157227,
      "text": " the Syrians were not there. Why? They came by night. When this one rises early, he"
    },
    {
      "id": 15,
      "start": 690.9800186157227,
      "end": 695.8600158691406,
      "text": " goes out and he sees that there's a great host, the horses, the chariots, the"
    },
    {
      "id": 16,
      "start": 695.8600158691406,
      "end": 702.2600173950195,
      "text": " Syrians compassed the city, and we find that he cries out to Elisha, and he asks"
    },
    {
      "id": 17,
      "start": 702.2600173950195,
      "end": 709.8600158691406,
      "text": " this question, \"...how shall we do?\" Why were they there? For Elisha. Because Ben"
    },
    {
      "id": 18,
      "start": 709.8600158691406,
      "end": 715.2600173950195,
      "text": " Hadad said, I want this guy. Remember, he said, find out where he is, go and spy"
    },
    {
      "id": 19,
      "start": 715.2600173950195,
      "end": 719.140022277832,
      "text": " where he is that I may send and fetch him. He didn't necessarily want to kill"
    },
    {
      "id": 20,
      "start": 719.140022277832,
      "end": 723.6600189208984,
      "text": " Elisha, according to what we can see here. He desired for Elisha to be returned to"
    },
    {
      "id": 21,
      "start": 723.6600189208984,
      "end": 730.3400268554688,
      "text": " where he was, and we find that now Elisha is called on the scene to his"
    },
    {
      "id": 22,
      "start": 730.3800201416016,
      "end": 735.8600158691406,
      "text": " servant at the end of verse number 15. Early on that morning, when he sees the"
    },
    {
      "id": 23,
      "start": 735.8600158691406,
      "end": 743.7800140380859,
      "text": " host that's there, he cries out, \"...alas, my master, how shall we do?\" Notice not only"
    },
    {
      "id": 24,
      "start": 743.7800140380859,
      "end": 750.02001953125,
      "text": " that the king is informed by Elisha that the Syrians invade Dothan, but as we"
    },
    {
      "id": 25,
      "start": 750.02001953125,
      "end": 756.4600219726562,
      "text": " look at verses 16 through 23, we find that Elisha instructs his servant. I'm so"
    },
    {
      "id": 26,
      "start": 756.4600219726562,
      "end": 760.2200164794922,
      "text": " thankful for the instruction that God gives us in His Word. I'm thankful that"
    },
    {
      "id": 27,
      "start": 760.3000183105469,
      "end": 765.3400268554688,
      "text": " God regularly instructs His people. We've been studying the book of Joshua, and"
    },
    {
      "id": 28,
      "start": 765.3400268554688,
      "end": 770.5000152587891,
      "text": " we've mentioned multiple times how God would instruct Joshua, and God was giving"
    },
    {
      "id": 29,
      "start": 770.5000152587891,
      "end": 776.7800140380859,
      "text": " the information. We spoke on Sunday evening, life after the flood. As we look"
    },
    {
      "id": 30,
      "start": 776.7800140380859,
      "end": 781.5400238037109,
      "text": " at those first seven verses of Genesis 9, and we consider life after the flood, and"
    },
    {
      "id": 31,
      "start": 781.5400238037109,
      "end": 786.6600189208984,
      "text": " how there was some instruction that was needed by Noah and his"
    },
    {
      "id": 32,
      "start": 786.6600189208984,
      "end": 791.02001953125,
      "text": " wife, and his three sons, and their wives. They needed to be instructed. They needed"
    },
    {
      "id": 33,
      "start": 791.02001953125,
      "end": 795.4200134277344,
      "text": " some direction for life after the flood, for that which they were required and"
    },
    {
      "id": 34,
      "start": 795.4200134277344,
      "end": 799.5800170898438,
      "text": " responsible for doing, and we find that God was faithful to give that"
    },
    {
      "id": 35,
      "start": 799.5800170898438,
      "end": 804.2200164794922,
      "text": " instruction. And oh, even still today, as we mentioned on Sunday evening at the"
    },
    {
      "id": 36,
      "start": 804.2200164794922,
      "end": 809.7400207519531,
      "text": " conclusion of the message, that God has given us instruction. The Word of God is"
    },
    {
      "id": 37,
      "start": 809.7400207519531,
      "end": 814.3800201416016,
      "text": " profitable. The Bible tells us that all Scripture is given by inspiration of God,"
    },
    {
      "id": 38,
      "start": 814.3800201416016,
      "end": 819.6200256347656,
      "text": " and is profitable for doctrine, for reproof, for correction, for instruction"
    },
    {
      "id": 39,
      "start": 819.6200256347656,
      "end": 826.0600128173828,
      "text": " in righteousness. Why? That the man of God may be perfect, throughly furnished unto"
    },
    {
      "id": 40,
      "start": 826.0600128173828,
      "end": 831.9800262451172,
      "text": " all good works. And we find that God gives instruction, and here in this text"
    },
    {
      "id": 41,
      "start": 831.9800262451172,
      "end": 838.0600128173828,
      "text": " of Scripture, we find that Elisha is the one instructing the servant. This is his"
    },
    {
      "id": 42,
      "start": 838.0600128173828,
      "end": 842.02001953125,
      "text": " servant. Again, there's no name that's ascribed to this man, but we find that"
    },
    {
      "id": 43,
      "start": 842.0600128173828,
      "end": 849.3400268554688,
      "text": " Elisha is going to instruct him and give him valuable lessons, valuable truth. The"
    },
    {
      "id": 44,
      "start": 849.3400268554688,
      "end": 855.7400207519531,
      "text": " truth that Elisha would give to his servant on this day is truth that we"
    },
    {
      "id": 45,
      "start": 855.7400207519531,
      "end": 860.5400085449219,
      "text": " need to be aware of and hold dear to our hearts, even still to this very day. I'm"
    },
    {
      "id": 46,
      "start": 860.5400085449219,
      "end": 866.1800231933594,
      "text": " so thankful that our God is immutable. It's the theological word that we use to"
    },
    {
      "id": 47,
      "start": 866.1800231933594,
      "end": 870.9800109863281,
      "text": " describe the fact that our God never changes, that He is the same yesterday"
    },
    {
      "id": 48,
      "start": 870.9800109863281,
      "end": 878.7000122070312,
      "text": " and today and forever. He said there in Malachi, I am the Lord, I change not. There"
    },
    {
      "id": 49,
      "start": 878.7000122070312,
      "end": 884.0600280761719,
      "text": " are things changing all around us, but God never changes. He's the same. And what"
    },
    {
      "id": 50,
      "start": 884.0600280761719,
      "end": 888.9000244140625,
      "text": " a joy that is. And when we consider the instruction that Elisha would give to"
    },
    {
      "id": 51,
      "start": 888.9000244140625,
      "end": 895.9000244140625,
      "text": " his servant on this particular day, when the servant sees, he observes the"
    },
    {
      "id": 52,
      "start": 895.9000244140625,
      "end": 900.9400329589844,
      "text": " great host that's compassed the city and he cries out and he says, how shall"
    },
    {
      "id": 53,
      "start": 900.9400329589844,
      "end": 905.8600158691406,
      "text": " we do? And Elisha says, let me give you some instruction. Let me give you some"
    },
    {
      "id": 54,
      "start": 905.8600158691406,
      "end": 910.6600341796875,
      "text": " instruction. Number one, we find in verse number 16 that he tells him, we've used"
    },
    {
      "id": 55,
      "start": 910.6600341796875,
      "end": 916.9000244140625,
      "text": " it for our title this evening, notice he says, fear not, fear not, for they that be"
    },
    {
      "id": 56,
      "start": 916.9000244140625,
      "end": 922.3400268554688,
      "text": " with us are more than they that be with them. Now there are times in our lives"
    },
    {
      "id": 57,
      "start": 922.5400085449219,
      "end": 929.2200317382812,
      "text": " where we struggle with the emotion of fear. We find that here, it would seem"
    },
    {
      "id": 58,
      "start": 929.2200317382812,
      "end": 934.2200317382812,
      "text": " obvious to me that Elisha says fear not, because he understands that the servant"
    },
    {
      "id": 59,
      "start": 934.2200317382812,
      "end": 938.8200073242188,
      "text": " was fearful. The servant, as he observed the great host of people that compassed"
    },
    {
      "id": 60,
      "start": 938.8200073242188,
      "end": 944.3400268554688,
      "text": " the city, he comes and he cries, how shall we do? And Elisha immediately responds"
    },
    {
      "id": 61,
      "start": 944.3400268554688,
      "end": 948.3400268554688,
      "text": " and says, first of all, fear not. I'm so thankful that God has not given us the"
    },
    {
      "id": 62,
      "start": 948.3400268554688,
      "end": 952.3400268554688,
      "text": " spirit of fear. There's a lot of fear going on in our society, in our world"
    },
    {
      "id": 63,
      "start": 952.3400268554688,
      "end": 957.6600341796875,
      "text": " today. God's not giving us the spirit of fear. We know who holds tomorrow. We know"
    },
    {
      "id": 64,
      "start": 957.6600341796875,
      "end": 962.0600280761719,
      "text": " that our God is in control, that He is the Lord God omnipotent, that He reigns"
    },
    {
      "id": 65,
      "start": 962.0600280761719,
      "end": 966.3400268554688,
      "text": " and He rules and He has a purpose and a plan. And the reality this evening is"
    },
    {
      "id": 66,
      "start": 966.3400268554688,
      "end": 971.7400207519531,
      "text": " that it does not mean that we go through life haphazardly. It does not mean that"
    },
    {
      "id": 67,
      "start": 971.7400207519531,
      "end": 977.260009765625,
      "text": " we tempt the Lord our God, but we do not have to fear. Remember, the Lord is my"
    },
    {
      "id": 68,
      "start": 977.260009765625,
      "end": 982.1000061035156,
      "text": " helper. He's the one that made heaven and earth. He is the Creator God, and I'm"
    },
    {
      "id": 69,
      "start": 982.1000061035156,
      "end": 987.1000061035156,
      "text": " mindful of what Hebrews says. In Hebrews chapter 13, and it's interesting,"
    },
    {
      "id": 70,
      "start": 987.1000061035156,
      "end": 991.8600158691406,
      "text": " it's the same, in the same vein of Scripture where we find that the truth"
    },
    {
      "id": 71,
      "start": 991.8600158691406,
      "end": 995.5800170898438,
      "text": " is given of the immutability of God in Hebrews 13 and verse number 8, where it"
    },
    {
      "id": 72,
      "start": 995.5800170898438,
      "end": 999.5800170898438,
      "text": " says, Jesus Christ, the same yesterday and today and forever. But back in verse"
    },
    {
      "id": 73,
      "start": 999.5800170898438,
      "end": 1003.5400085449219,
      "text": " number 5, the Bible says, let your conversation be without covetousness and"
    },
    {
      "id": 74,
      "start": 1003.5400085449219,
      "end": 1007.6200256347656,
      "text": " be content with such things as you have. For He has said, I will never leave thee"
    },
    {
      "id": 75,
      "start": 1007.6200256347656,
      "end": 1013.4600219726562,
      "text": " nor forsake thee, so that we may boldly say, the Lord is my helper and I will not"
    },
    {
      "id": 76,
      "start": 1013.4600219726562,
      "end": 1022.6200256347656,
      "text": " fear what man shall do unto me. He says, fear not. Fear not. And then He tells them"
    },
    {
      "id": 77,
      "start": 1022.6200256347656,
      "end": 1030.2200317382812,
      "text": " this, what great instruction. He says, for they that be with us are more than they"
    },
    {
      "id": 78,
      "start": 1030.260009765625,
      "end": 1035.6600341796875,
      "text": " that be with them. Hold on, Elisha. It's just two. Did you see all of them? Can you"
    },
    {
      "id": 79,
      "start": 1035.6600341796875,
      "end": 1040.0600280761719,
      "text": " see? Get yourself in the mind of the servant, right? The servant's the one that"
    },
    {
      "id": 80,
      "start": 1040.0600280761719,
      "end": 1044.6200256347656,
      "text": " went outside. The servant's the one that saw the Syrians compass the city. He's"
    },
    {
      "id": 81,
      "start": 1044.6200256347656,
      "end": 1048.7400207519531,
      "text": " seen the great host. He's seen the horses and the chariots, and he runs into"
    },
    {
      "id": 82,
      "start": 1048.7400207519531,
      "end": 1054.6200256347656,
      "text": " Elisha and says, alas, my master. He says, how shall we do? And Elisha says, fear not."
    },
    {
      "id": 83,
      "start": 1054.6200256347656,
      "end": 1059.6600341796875,
      "text": " There's more with us than with them. Elisha, I know it's early. You haven't"
    },
    {
      "id": 84,
      "start": 1059.6600341796875,
      "end": 1063.3800048828125,
      "text": " had your coffee yet. I don't think they drank coffee. Maybe they did. But the"
    },
    {
      "id": 85,
      "start": 1063.3800048828125,
      "end": 1069.8200073242188,
      "text": " reality is that Elisha, there's but two. Have you seen them? See, Elisha had vision"
    },
    {
      "id": 86,
      "start": 1069.8200073242188,
      "end": 1075.4200134277344,
      "text": " that this man did not have. Elisha understood something about God and about"
    },
    {
      "id": 87,
      "start": 1075.4200134277344,
      "end": 1080.4200134277344,
      "text": " God's plan that this man could not see, and he needed some instruction. He needed"
    },
    {
      "id": 88,
      "start": 1080.4200134277344,
      "end": 1085.02001953125,
      "text": " some enlightenment. He needed his eyes to be open, and that's exactly what Elisha"
    },
    {
      "id": 89,
      "start": 1085.2200317382812,
      "end": 1089.6200256347656,
      "text": " prays in verse number 17, when the Bible says that Elisha prayed and said, Lord, I"
    },
    {
      "id": 90,
      "start": 1089.6200256347656,
      "end": 1098.4200134277344,
      "text": " pray thee, open his eyes that he may see. Open his eyes that he may see, and the"
    },
    {
      "id": 91,
      "start": 1098.4200134277344,
      "end": 1104.5400085449219,
      "text": " Lord opened the eyes of the young man, and he saw. And the Bible says this,"
    },
    {
      "id": 92,
      "start": 1104.5400085449219,
      "end": 1113.4600219726562,
      "text": " behold, the mountain was full of horses and chariots of fire round about Elisha."
    },
    {
      "id": 93,
      "start": 1113.4600219726562,
      "end": 1120.1000366210938,
      "text": " Now, I'm wondering how this servant must have felt at this particular moment. He"
    },
    {
      "id": 94,
      "start": 1120.1000366210938,
      "end": 1125.1000366210938,
      "text": " saw the host of the Syrians. He saw that they compassed the city. He saw the"
    },
    {
      "id": 95,
      "start": 1125.1000366210938,
      "end": 1129.7000122070312,
      "text": " horses and the chariots, and Elisha prays and says, Lord, open his eyes that he"
    },
    {
      "id": 96,
      "start": 1129.7000122070312,
      "end": 1133.8600463867188,
      "text": " would see. And the Bible says that God answered that prayer, and he opened the"
    },
    {
      "id": 97,
      "start": 1133.8600463867188,
      "end": 1138.02001953125,
      "text": " eyes of this man, and he saw. And what does he see? He sees that the mountain is"
    },
    {
      "id": 98,
      "start": 1138.02001953125,
      "end": 1144.5800170898438,
      "text": " full of horses and chariots of fire round about Elisha. That had to be"
    },
    {
      "id": 99,
      "start": 1144.5800170898438,
      "end": 1151.1000366210938,
      "text": " encouraging. Amen? The perspective of this servant is changed in a hurry. Why?"
    },
    {
      "id": 100,
      "start": 1151.1000366210938,
      "end": 1155.780029296875,
      "text": " Because he understands something that Elisha had understood. He has this"
    },
    {
      "id": 101,
      "start": 1155.780029296875,
      "end": 1162.9800415039062,
      "text": " spiritual awareness that prior to his eyes being open, he was just not aware of."
    },
    {
      "id": 102,
      "start": 1162.9800415039062,
      "end": 1167.5400390625,
      "text": " He now has this spiritual awareness. Last year, as we taught and preached through"
    },
    {
      "id": 103,
      "start": 1167.5400390625,
      "end": 1171.6199951171875,
      "text": " the book of Ephesians during our Sunday morning series, Be Strong in the Lord, I"
    },
    {
      "id": 104,
      "start": 1171.6199951171875,
      "end": 1175.4600219726562,
      "text": " often dealt with the fact that we are engaged in a spiritual battle, spiritual"
    },
    {
      "id": 105,
      "start": 1175.4600219726562,
      "end": 1180.1000366210938,
      "text": " warfare. We're not dealing with a cultural war. I understand that people in"
    },
    {
      "id": 106,
      "start": 1180.1000366210938,
      "end": 1184.7000122070312,
      "text": " the media and people in our society want to speak about culture wars and various"
    },
    {
      "id": 107,
      "start": 1184.7000122070312,
      "end": 1189.1400146484375,
      "text": " class wars and what have you. We're dealing with a spiritual battle. We're"
    },
    {
      "id": 108,
      "start": 1189.1400146484375,
      "end": 1193.9400024414062,
      "text": " dealing with spiritual wickedness in high places, and when we understand this"
    },
    {
      "id": 109,
      "start": 1193.9800415039062,
      "end": 1198.3400268554688,
      "text": " spiritual battle, when we understand that it's a battle between good and evil, the"
    },
    {
      "id": 110,
      "start": 1198.3400268554688,
      "end": 1202.1000366210938,
      "text": " enemy of God, Satan himself,"
    },
    {
      "id": 0,
      "start": 1202.1000366210938,
      "end": 1205.90003657341,
      "text": " is doing all that he can to attack the plan of God"
    },
    {
      "id": 1,
      "start": 1205.90003657341,
      "end": 1207.4000368118286,
      "text": " and the purpose of God,"
    },
    {
      "id": 2,
      "start": 1207.4000368118286,
      "end": 1209.4000368118286,
      "text": " and he hates the people of God."
    },
    {
      "id": 3,
      "start": 1209.4000368118286,
      "end": 1210.9000368118286,
      "text": " He wants to destroy you."
    },
    {
      "id": 4,
      "start": 1210.9000368118286,
      "end": 1212.2000370025635,
      "text": " He wants to destroy us."
    },
    {
      "id": 5,
      "start": 1212.2000370025635,
      "end": 1213.9000368118286,
      "text": " He wants to destroy the church."
    },
    {
      "id": 6,
      "start": 1213.9000368118286,
      "end": 1216.9000368118286,
      "text": " But we know that God says that He is greater."
    },
    {
      "id": 7,
      "start": 1216.9000368118286,
      "end": 1218.4000358581543,
      "text": " We know that God has said,"
    },
    {
      "id": 8,
      "start": 1218.4000358581543,
      "end": 1219.9000358581543,
      "text": " I will build My church,"
    },
    {
      "id": 9,
      "start": 1219.9000358581543,
      "end": 1222.7000370025635,
      "text": " and the gates of hell shall not prevail against it."
    },
    {
      "id": 10,
      "start": 1222.7000370025635,
      "end": 1225.7000370025635,
      "text": " We have great promises from God Almighty,"
    },
    {
      "id": 11,
      "start": 1225.7000370025635,
      "end": 1228.7000370025635,
      "text": " and here we find that the man's eyes are open,"
    },
    {
      "id": 12,
      "start": 1228.7000370025635,
      "end": 1231.9000358581543,
      "text": " and he's made aware through the instruction of Elisha"
    },
    {
      "id": 13,
      "start": 1231.9000358581543,
      "end": 1235.9000358581543,
      "text": " of the protection of God."
    },
    {
      "id": 14,
      "start": 1235.9000358581543,
      "end": 1237.9000358581543,
      "text": " We find that throughout the Word of God,"
    },
    {
      "id": 15,
      "start": 1237.9000358581543,
      "end": 1239.4000358581543,
      "text": " there's truth given to us"
    },
    {
      "id": 16,
      "start": 1239.4000358581543,
      "end": 1242.4000358581543,
      "text": " with regard to the power of God"
    },
    {
      "id": 17,
      "start": 1242.4000358581543,
      "end": 1243.9000358581543,
      "text": " and the work of God."
    },
    {
      "id": 18,
      "start": 1243.9000358581543,
      "end": 1245.9000358581543,
      "text": " In Psalm 118 v. 6,"
    },
    {
      "id": 19,
      "start": 1245.9000358581543,
      "end": 1248.9000358581543,
      "text": " I'll read just a few verses for you quickly this evening,"
    },
    {
      "id": 20,
      "start": 1248.9000358581543,
      "end": 1250.9000358581543,
      "text": " and I'll give you the reference."
    },
    {
      "id": 21,
      "start": 1250.9000358581543,
      "end": 1253.9000358581543,
      "text": " Psalm 118 v. 6, the psalmist says,"
    },
    {
      "id": 22,
      "start": 1253.9000358581543,
      "end": 1256.9000358581543,
      "text": " The Lord is on my side."
    },
    {
      "id": 23,
      "start": 1256.9000358581543,
      "end": 1262.4000358581543,
      "text": " I will not fear what can man do unto me."
    },
    {
      "id": 24,
      "start": 1262.4000358581543,
      "end": 1264.9000358581543,
      "text": " The Lord is on my side."
    },
    {
      "id": 25,
      "start": 1264.9000358581543,
      "end": 1268.9000396728516,
      "text": " I will not fear what can man do unto me."
    },
    {
      "id": 26,
      "start": 1268.9000396728516,
      "end": 1271.4000396728516,
      "text": " Consider with me a couple of verses of Scripture"
    },
    {
      "id": 27,
      "start": 1271.4000396728516,
      "end": 1273.4000396728516,
      "text": " in the book of Romans in the New Testament."
    },
    {
      "id": 28,
      "start": 1273.4000396728516,
      "end": 1276.9000396728516,
      "text": " In Romans 8, we find that the Apostle Paul"
    },
    {
      "id": 29,
      "start": 1276.9000396728516,
      "end": 1279.9000396728516,
      "text": " is giving great truth here to these believers,"
    },
    {
      "id": 30,
      "start": 1279.9000396728516,
      "end": 1282.9000396728516,
      "text": " and we find in v. 31 of Romans 8,"
    },
    {
      "id": 31,
      "start": 1282.9000396728516,
      "end": 1285.4000396728516,
      "text": " he says, what shall we then say to these things?"
    },
    {
      "id": 32,
      "start": 1285.4000396728516,
      "end": 1288.4000396728516,
      "text": " If God be for us,"
    },
    {
      "id": 33,
      "start": 1288.4000396728516,
      "end": 1290.9000396728516,
      "text": " who can be against us?"
    },
    {
      "id": 34,
      "start": 1290.9000396728516,
      "end": 1293.4000396728516,
      "text": " V. 37, Nay, in all these things"
    },
    {
      "id": 35,
      "start": 1293.4000396728516,
      "end": 1295.4000396728516,
      "text": " we are more than conquerors"
    },
    {
      "id": 36,
      "start": 1295.4000396728516,
      "end": 1298.4000396728516,
      "text": " through Him that loved us."
    },
    {
      "id": 37,
      "start": 1298.4000396728516,
      "end": 1301.9000396728516,
      "text": " In 1 Corinthians 15 and v. 57,"
    },
    {
      "id": 38,
      "start": 1301.9000396728516,
      "end": 1305.9000396728516,
      "text": " a passage of Scripture that we often go to"
    },
    {
      "id": 39,
      "start": 1305.9000396728516,
      "end": 1308.4000396728516,
      "text": " and speak about the resurrection of our Savior,"
    },
    {
      "id": 40,
      "start": 1308.4000396728516,
      "end": 1309.9000396728516,
      "text": " and it is the great chapter"
    },
    {
      "id": 41,
      "start": 1309.9000396728516,
      "end": 1311.4000396728516,
      "text": " dealing with the resurrection."
    },
    {
      "id": 42,
      "start": 1311.4000396728516,
      "end": 1312.9000396728516,
      "text": " It's about Christ's victory"
    },
    {
      "id": 43,
      "start": 1312.9000396728516,
      "end": 1314.9000396728516,
      "text": " and the impact of His victory"
    },
    {
      "id": 44,
      "start": 1314.9000396728516,
      "end": 1319.4000396728516,
      "text": " and the truth that we too will rise."
    },
    {
      "id": 45,
      "start": 1319.4000396728516,
      "end": 1320.9000396728516,
      "text": " And what a blessing that is."
    },
    {
      "id": 46,
      "start": 1320.9000396728516,
      "end": 1323.4000396728516,
      "text": " But we notice in v. 57 that he says,"
    },
    {
      "id": 47,
      "start": 1323.4000396728516,
      "end": 1324.9000396728516,
      "text": " But thanks be to God,"
    },
    {
      "id": 48,
      "start": 1324.9000396728516,
      "end": 1326.4000396728516,
      "text": " which giveth us the victory"
    },
    {
      "id": 49,
      "start": 1326.4000396728516,
      "end": 1328.4000396728516,
      "text": " through our Lord Jesus Christ."
    },
    {
      "id": 50,
      "start": 1328.4000396728516,
      "end": 1329.9000396728516,
      "text": " Therefore, my beloved brethren,"
    },
    {
      "id": 51,
      "start": 1329.9000396728516,
      "end": 1331.4000396728516,
      "text": " be you steadfast, unmovable,"
    },
    {
      "id": 52,
      "start": 1331.4000396728516,
      "end": 1333.4000396728516,
      "text": " always abounding in the work of the Lord,"
    },
    {
      "id": 53,
      "start": 1333.4000396728516,
      "end": 1334.9000396728516,
      "text": " for as much as you know"
    },
    {
      "id": 54,
      "start": 1334.9000396728516,
      "end": 1339.4000396728516,
      "text": " that your labor is not in vain in the Lord."
    },
    {
      "id": 55,
      "start": 1339.4000396728516,
      "end": 1340.9000396728516,
      "text": " We sing victory in Jesus."
    },
    {
      "id": 56,
      "start": 1340.9000396728516,
      "end": 1342.9000396728516,
      "text": " What a great song."
    },
    {
      "id": 57,
      "start": 1342.9000396728516,
      "end": 1345.9000396728516,
      "text": " Old Curtis Hudson with the Lord now."
    },
    {
      "id": 58,
      "start": 1345.9000396728516,
      "end": 1349.9000396728516,
      "text": " He was with the Lord before I was ever saved."
    },
    {
      "id": 59,
      "start": 1349.9000396728516,
      "end": 1352.4000396728516,
      "text": " And I have read some of his things"
    },
    {
      "id": 60,
      "start": 1352.4000396728516,
      "end": 1353.9000396728516,
      "text": " and I've understood that often"
    },
    {
      "id": 61,
      "start": 1353.9000396728516,
      "end": 1356.9000396728516,
      "text": " when he'd preach, he would sing that song."
    },
    {
      "id": 62,
      "start": 1356.9000396728516,
      "end": 1359.4000396728516,
      "text": " I'm on the winning side."
    },
    {
      "id": 63,
      "start": 1359.4000396728516,
      "end": 1360.9000396728516,
      "text": " And what a joy to know"
    },
    {
      "id": 64,
      "start": 1360.9000396728516,
      "end": 1362.9000396728516,
      "text": " that we are more than conquerors."
    },
    {
      "id": 65,
      "start": 1362.9000396728516,
      "end": 1364.9000396728516,
      "text": " See, this servant is receiving"
    },
    {
      "id": 66,
      "start": 1364.9000396728516,
      "end": 1366.9000396728516,
      "text": " some instruction from Elisha."
    },
    {
      "id": 67,
      "start": 1366.9000396728516,
      "end": 1368.9000396728516,
      "text": " He's being informed with regard"
    },
    {
      "id": 68,
      "start": 1368.9000396728516,
      "end": 1371.4000396728516,
      "text": " to the plan of God and the power of God."
    },
    {
      "id": 69,
      "start": 1371.4000396728516,
      "end": 1373.4000396728516,
      "text": " We notice that here in v. 18"
    },
    {
      "id": 70,
      "start": 1373.4000396728516,
      "end": 1375.9000396728516,
      "text": " that Elisha prays a bold prayer"
    },
    {
      "id": 71,
      "start": 1375.9000396728516,
      "end": 1379.4000396728516,
      "text": " and we find that this thing comes to pass."
    },
    {
      "id": 72,
      "start": 1379.4000396728516,
      "end": 1381.4000396728516,
      "text": " And we find that he, the servant,"
    },
    {
      "id": 73,
      "start": 1381.4000396728516,
      "end": 1383.4000396728516,
      "text": " would understand the fact that God hears"
    },
    {
      "id": 74,
      "start": 1383.4000396728516,
      "end": 1384.4000396728516,
      "text": " and answers prayer."
    },
    {
      "id": 75,
      "start": 1384.4000396728516,
      "end": 1385.4000396728516,
      "text": " Notice in v. 18,"
    },
    {
      "id": 76,
      "start": 1385.4000396728516,
      "end": 1386.9000396728516,
      "text": " And when they came down to him,"
    },
    {
      "id": 77,
      "start": 1386.9000396728516,
      "end": 1388.9000396728516,
      "text": " Elisha prayed unto the Lord and said,"
    },
    {
      "id": 78,
      "start": 1388.9000396728516,
      "end": 1390.9000396728516,
      "text": " Smite this people, I pray thee,"
    },
    {
      "id": 79,
      "start": 1390.9000396728516,
      "end": 1392.9000396728516,
      "text": " with blindness."
    },
    {
      "id": 80,
      "start": 1392.9000396728516,
      "end": 1394.9000396728516,
      "text": " And he smote them with blindness"
    },
    {
      "id": 81,
      "start": 1394.9000396728516,
      "end": 1396.9000396728516,
      "text": " according to the word of Elisha."
    },
    {
      "id": 82,
      "start": 1396.9000396728516,
      "end": 1398.4000396728516,
      "text": " That's good instruction, right?"
    },
    {
      "id": 83,
      "start": 1398.4000396728516,
      "end": 1399.9000396728516,
      "text": " The servant sees that God hears"
    },
    {
      "id": 84,
      "start": 1399.9000396728516,
      "end": 1401.4000396728516,
      "text": " and answers prayer."
    },
    {
      "id": 85,
      "start": 1401.4000396728516,
      "end": 1403.4000396728516,
      "text": " What a joy to know that we have a God"
    },
    {
      "id": 86,
      "start": 1403.4000396728516,
      "end": 1405.4000396728516,
      "text": " that hears and answers prayer."
    },
    {
      "id": 87,
      "start": 1405.4000396728516,
      "end": 1407.4000396728516,
      "text": " To understand that the effectual,"
    },
    {
      "id": 88,
      "start": 1407.4000396728516,
      "end": 1409.4000396728516,
      "text": " fervent prayer of a righteous man"
    },
    {
      "id": 89,
      "start": 1409.4000396728516,
      "end": 1412.4000396728516,
      "text": " availeth much, the Bible tells us in James 5."
    },
    {
      "id": 90,
      "start": 1412.4000396728516,
      "end": 1414.4000396728516,
      "text": " We find that there are prayer promises"
    },
    {
      "id": 91,
      "start": 1414.4000396728516,
      "end": 1415.9000396728516,
      "text": " throughout the Word of God,"
    },
    {
      "id": 92,
      "start": 1415.9000396728516,
      "end": 1417.4000396728516,
      "text": " many of which we've quoted,"
    },
    {
      "id": 93,
      "start": 1417.4000396728516,
      "end": 1418.9000396728516,
      "text": " we've committed to memory."
    },
    {
      "id": 94,
      "start": 1418.9000396728516,
      "end": 1420.4000396728516,
      "text": " Jeremiah 33 v. 3,"
    },
    {
      "id": 95,
      "start": 1420.4000396728516,
      "end": 1422.4000396728516,
      "text": " Call unto Me and I will answer thee"
    },
    {
      "id": 96,
      "start": 1422.4000396728516,
      "end": 1424.4000396728516,
      "text": " and show thee great and mighty things"
    },
    {
      "id": 97,
      "start": 1424.4000396728516,
      "end": 1425.9000396728516,
      "text": " which thou knowest not."
    },
    {
      "id": 98,
      "start": 1425.9000396728516,
      "end": 1427.9000396728516,
      "text": " We find in the book of Ephesians"
    },
    {
      "id": 99,
      "start": 1427.9000396728516,
      "end": 1429.4000396728516,
      "text": " in v. 20 of chapter 3,"
    },
    {
      "id": 100,
      "start": 1429.4000396728516,
      "end": 1431.9000396728516,
      "text": " unto Him which is able to do exceeding"
    },
    {
      "id": 101,
      "start": 1431.9000396728516,
      "end": 1434.4000396728516,
      "text": " abundantly above all that we ask or think."
    },
    {
      "id": 102,
      "start": 1434.4000396728516,
      "end": 1436.4000396728516,
      "text": " We have this confidence"
    },
    {
      "id": 103,
      "start": 1436.4000396728516,
      "end": 1438.4000396728516,
      "text": " that if we pray according to His will,"
    },
    {
      "id": 104,
      "start": 1438.4000396728516,
      "end": 1440.9000396728516,
      "text": " He heareth us."
    },
    {
      "id": 105,
      "start": 1440.9000396728516,
      "end": 1443.4000396728516,
      "text": " We find that in 1 John 5."
    },
    {
      "id": 106,
      "start": 1443.4000396728516,
      "end": 1444.9000396728516,
      "text": " What a joy."
    },
    {
      "id": 107,
      "start": 1444.9000396728516,
      "end": 1446.4000396728516,
      "text": " What great instruction"
    },
    {
      "id": 108,
      "start": 1446.4000396728516,
      "end": 1448.4000396728516,
      "text": " that this servant receives"
    },
    {
      "id": 109,
      "start": 1448.4000396728516,
      "end": 1451.4000396728516,
      "text": " with regard to the power of prayer."
    },
    {
      "id": 110,
      "start": 1451.4000396728516,
      "end": 1452.9000396728516,
      "text": " Elisha prays and it's done."
    },
    {
      "id": 111,
      "start": 1452.9000396728516,
      "end": 1453.9000396728516,
      "text": " It says in v. 19,"
    },
    {
      "id": 112,
      "start": 1453.9000396728516,
      "end": 1455.4000396728516,
      "text": " And Elisha said unto them,"
    },
    {
      "id": 113,
      "start": 1455.4000396728516,
      "end": 1457.4000396728516,
      "text": " Notice, it's interesting what happens."
    },
    {
      "id": 114,
      "start": 1457.4000396728516,
      "end": 1459.9000244140625,
      "text": " Elisha prays that this great host that comes,"
    },
    {
      "id": 115,
      "start": 1459.9000244140625,
      "end": 1463.9000244140625,
      "text": " he says, Lord, smite him with blindness."
    },
    {
      "id": 116,
      "start": 1463.9000244140625,
      "end": 1465.9000244140625,
      "text": " God smites him with blindness."
    },
    {
      "id": 117,
      "start": 1465.9000244140625,
      "end": 1468.4000244140625,
      "text": " And then Elisha says to them in v. 19,"
    },
    {
      "id": 118,
      "start": 1468.4000244140625,
      "end": 1470.4000244140625,
      "text": " This is not the way,"
    },
    {
      "id": 119,
      "start": 1470.4000244140625,
      "end": 1472.4000244140625,
      "text": " neither is this the city."
    },
    {
      "id": 120,
      "start": 1472.4000244140625,
      "end": 1473.9000244140625,
      "text": " Follow me and I will bring you"
    },
    {
      "id": 121,
      "start": 1473.9000244140625,
      "end": 1475.9000244140625,
      "text": " to the man whom you seek."
    },
    {
      "id": 122,
      "start": 1475.9000244140625,
      "end": 1478.4000244140625,
      "text": " This is comical."
    },
    {
      "id": 123,
      "start": 1478.4000244140625,
      "end": 1480.4000244140625,
      "text": " This is hilarious."
    },
    {
      "id": 124,
      "start": 1480.4000244140625,
      "end": 1482.4000244140625,
      "text": " Elisha says you're in the wrong place."
    },
    {
      "id": 125,
      "start": 1482.4000244140625,
      "end": 1484.4000244140625,
      "text": " Let me lead you to where you need to go."
    },
    {
      "id": 126,
      "start": 1484.4000244140625,
      "end": 1486.9000244140625,
      "text": " After God had smitten them with blindness,"
    },
    {
      "id": 127,
      "start": 1486.9000244140625,
      "end": 1489.4000244140625,
      "text": " and answering the prayer of Elisha,"
    },
    {
      "id": 128,
      "start": 1489.4000244140625,
      "end": 1491.4000244140625,
      "text": " and Elisha leads them to Samaria,"
    },
    {
      "id": 129,
      "start": 1491.4000244140625,
      "end": 1493.4000244140625,
      "text": " the Bible says that they came to Samaria"
    },
    {
      "id": 130,
      "start": 1493.4000244140625,
      "end": 1495.4000244140625,
      "text": " in v. 20, when they were coming to Samaria,"
    },
    {
      "id": 131,
      "start": 1495.4000244140625,
      "end": 1496.4000244140625,
      "text": " that Elisha said,"
    },
    {
      "id": 132,
      "start": 1496.4000244140625,
      "end": 1498.4000244140625,
      "text": " Lord, open the eyes of these men"
    },
    {
      "id": 133,
      "start": 1498.4000244140625,
      "end": 1500.4000244140625,
      "text": " that they may see."
    },
    {
      "id": 134,
      "start": 1500.4000244140625,
      "end": 1502.9000244140625,
      "text": " And the Lord opened their eyes."
    },
    {
      "id": 135,
      "start": 1502.9000244140625,
      "end": 1506.4000244140625,
      "text": " Again, answered prayer."
    },
    {
      "id": 136,
      "start": 1506.4000244140625,
      "end": 1507.9000244140625,
      "text": " And they saw."
    },
    {
      "id": 137,
      "start": 1507.9000244140625,
      "end": 1512.4000244140625,
      "text": " And behold, they were in the midst of Samaria."
    },
    {
      "id": 138,
      "start": 1512.4000244140625,
      "end": 1513.9000244140625,
      "text": " Notice in v. 21, the Bible says,"
    },
    {
      "id": 139,
      "start": 1513.9000244140625,
      "end": 1515.9000244140625,
      "text": " The king of Israel said unto Elisha,"
    },
    {
      "id": 140,
      "start": 1515.9000244140625,
      "end": 1517.4000244140625,
      "text": " when he saw them,"
    },
    {
      "id": 141,
      "start": 1517.4000244140625,
      "end": 1519.4000244140625,
      "text": " My father, shall I smite them?"
    },
    {
      "id": 142,
      "start": 1519.4000244140625,
      "end": 1520.9000244140625,
      "text": " Shall I smite them?"
    },
    {
      "id": 143,
      "start": 1520.9000244140625,
      "end": 1523.9000244140625,
      "text": " Elisha says, thou shalt not smite them."
    },
    {
      "id": 144,
      "start": 1523.9000244140625,
      "end": 1525.4000244140625,
      "text": " What dost thou smite those"
    },
    {
      "id": 145,
      "start": 1525.4000244140625,
      "end": 1526.9000244140625,
      "text": " whom thou hast taken captive"
    },
    {
      "id": 146,
      "start": 1526.9000244140625,
      "end": 1528.9000244140625,
      "text": " with thy sword and with thy bow?"
    },
    {
      "id": 147,
      "start": 1528.9000244140625,
      "end": 1531.4000244140625,
      "text": " Set bread and water before them,"
    },
    {
      "id": 148,
      "start": 1531.4000244140625,
      "end": 1532.9000244140625,
      "text": " that they may eat and drink"
    },
    {
      "id": 149,
      "start": 1532.9000244140625,
      "end": 1534.9000244140625,
      "text": " and go to their master."
    },
    {
      "id": 150,
      "start": 1534.9000244140625,
      "end": 1537.4000244140625,
      "text": " And he prepared great provision for them."
    },
    {
      "id": 151,
      "start": 1537.4000244140625,
      "end": 1538.9000244140625,
      "text": " When they had eaten and drunk,"
    },
    {
      "id": 152,
      "start": 1538.9000244140625,
      "end": 1540.9000244140625,
      "text": " he sent them away."
    },
    {
      "id": 153,
      "start": 1540.9000244140625,
      "end": 1543.4000244140625,
      "text": " And they went to their master."
    },
    {
      "id": 154,
      "start": 1543.4000244140625,
      "end": 1544.9000244140625,
      "text": " The Bible doesn't tell us"
    },
    {
      "id": 155,
      "start": 1544.9000244140625,
      "end": 1547.9000244140625,
      "text": " what happens when they get back to their master."
    },
    {
      "id": 156,
      "start": 1547.9000244140625,
      "end": 1550.4000244140625,
      "text": " But I'd love to have been there."
    },
    {
      "id": 157,
      "start": 1550.4000244140625,
      "end": 1552.9000244140625,
      "text": " Right? Wouldn't you?"
    },
    {
      "id": 158,
      "start": 1552.9000244140625,
      "end": 1555.9000244140625,
      "text": " They come back and Elisha's not with them."
    },
    {
      "id": 159,
      "start": 1555.9000244140625,
      "end": 1557.9000244140625,
      "text": " Why is the whole purpose"
    },
    {
      "id": 160,
      "start": 1557.9000244140625,
      "end": 1559.9000244140625,
      "text": " that Ben-Hadad sent them?"
    },
    {
      "id": 161,
      "start": 1559.9000244140625,
      "end": 1561.4000244140625,
      "text": " He knew where Elisha was."
    },
    {
      "id": 162,
      "start": 1561.4000244140625,
      "end": 1562.4000244140625,
      "text": " He's in Dothan."
    },
    {
      "id": 163,
      "start": 1562.4000244140625,
      "end": 1564.9000244140625,
      "text": " The spies told him they were aware of his location."
    },
    {
      "id": 164,
      "start": 1564.9000244140625,
      "end": 1566.9000244140625,
      "text": " Go and fetch him. Bring him to me."
    },
    {
      "id": 165,
      "start": 1566.9000244140625,
      "end": 1567.9000244140625,
      "text": " They come back."
    },
    {
      "id": 166,
      "start": 1567.9000244140625,
      "end": 1569.4000244140625,
      "text": " What's he expecting?"
    },
    {
      "id": 167,
      "start": 1569.4000244140625,
      "end": 1570.9000244140625,
      "text": " Where's Elisha?"
    },
    {
      "id": 168,
      "start": 1570.9000244140625,
      "end": 1572.4000244140625,
      "text": " He's not here."
    },
    {
      "id": 169,
      "start": 1572.4000244140625,
      "end": 1573.4000244140625,
      "text": " What happened?"
    },
    {
      "id": 170,
      "start": 1573.4000244140625,
      "end": 1574.4000244140625,
      "text": " Well, let me tell you what happened."
    },
    {
      "id": 171,
      "start": 1574.4000244140625,
      "end": 1575.9000244140625,
      "text": " Can you imagine these servants"
    },
    {
      "id": 172,
      "start": 1575.9000244140625,
      "end": 1578.4000244140625,
      "text": " telling the story of what happened?"
    },
    {
      "id": 173,
      "start": 1578.4000244140625,
      "end": 1580.9000244140625,
      "text": " I mean, they were smitten with blindness."
    },
    {
      "id": 174,
      "start": 1580.9000244140625,
      "end": 1582.4000244140625,
      "text": " They were led to Samaria."
    },
    {
      "id": 175,
      "start": 1582.4000244140625,
      "end": 1583.9000244140625,
      "text": " Their eyes were opened."
    },
    {
      "id": 176,
      "start": 1583.9000244140625,
      "end": 1585.4000244140625,
      "text": " They now could see."
    },
    {
      "id": 177,
      "start": 1585.4000244140625,
      "end": 1587.9000244140625,
      "text": " They were fed by the King of Israel."
    },
    {
      "id": 178,
      "start": 1587.9000244140625,
      "end": 1589.9000244140625,
      "text": " Then they go back to their master"
    },
    {
      "id": 179,
      "start": 1589.9000244140625,
      "end": 1591.4000244140625,
      "text": " empty-handed."
    },
    {
      "id": 180,
      "start": 1591.4000244140625,
      "end": 1593.4000244140625,
      "text": " The Bible says at the end of v. 23,"
    },
    {
      "id": 181,
      "start": 1593.4000244140625,
      "end": 1594.9000244140625,
      "text": " so the bands of Syria"
    },
    {
      "id": 182,
      "start": 1594.9000244140625,
      "end": 1598.9000244140625,
      "text": " came no more into the land of Israel."
    },
    {
      "id": 183,
      "start": 1598.9000244140625,
      "end": 1600.4000244140625,
      "text": " This obviously didn't last"
    },
    {
      "id": 184,
      "start": 1600.4000244140625,
      "end": 1601.9000244140625,
      "text": " a lengthy period of time"
    },
    {
      "id": 185,
      "start": 1601.9000244140625,
      "end": 1603.4000244140625,
      "text": " with the conflict ended"
    },
    {
      "id": 186,
      "start": 1603.4000244140625,
      "end": 1605.4000244140625,
      "text": " between the Syrians and the Israelites,"
    },
    {
      "id": 187,
      "start": 1605.4000244140625,
      "end": 1606.9000244140625,
      "text": " for we see that as we continue"
    },
    {
      "id": 188,
      "start": 1606.9000244140625,
      "end": 1608.4000244140625,
      "text": " moving through the passage of Scripture,"
    },
    {
      "id": 189,
      "start": 1608.4000244140625,
      "end": 1610.4000244140625,
      "text": " there's a period of time between v. 23 and 24."
    },
    {
      "id": 190,
      "start": 1610.4000244140625,
      "end": 1611.4000244140625,
      "text": " We don't know how long."
    },
    {
      "id": 191,
      "start": 1611.4000244140625,
      "end": 1613.4000244140625,
      "text": " But then we find that there's another event"
    },
    {
      "id": 192,
      "start": 1613.4000244140625,
      "end": 1614.9000244140625,
      "text": " that is given to us"
    },
    {
      "id": 193,
      "start": 1614.9000244140625,
      "end": 1617.4000244140625,
      "text": " with regard to the Syrians"
    },
    {
      "id": 194,
      "start": 1617.4000244140625,
      "end": 1619.9000244140625,
      "text": " besieging the city of Samaria."
    },
    {
      "id": 195,
      "start": 1619.9000244140625,
      "end": 1621.4000244140625,
      "text": " But we find that these Syrians"
    },
    {
      "id": 196,
      "start": 1621.4000244140625,
      "end": 1622.4000244140625,
      "text": " are led to Samaria."
    },
    {
      "id": 197,
      "start": 1622.4000244140625,
      "end": 1624.9000244140625,
      "text": " Their blindness is miraculously healed."
    },
    {
      "id": 198,
      "start": 1624.9000244140625,
      "end": 1626.9000244140625,
      "text": " And then they are fed and returned"
    },
    {
      "id": 199,
      "start": 1626.9000244140625,
      "end": 1628.4000244140625,
      "text": " to Ben-Hadad empty-handed,"
    },
    {
      "id": 200,
      "start": 1628.4000244140625,
      "end": 1631.4000244140625,
      "text": " all the while Elisha's protected."
    },
    {
      "id": 201,
      "start": 1631.4000244140625,
      "end": 1633.9000244140625,
      "text": " He's protected miraculously."
    },
    {
      "id": 202,
      "start": 1633.9000244140625,
      "end": 1635.4000244140625,
      "text": " This is wonderful instruction"
    },
    {
      "id": 203,
      "start": 1635.4000244140625,
      "end": 1637.4000244140625,
      "text": " for this servant."
    },
    {
      "id": 204,
      "start": 1637.4000244140625,
      "end": 1639.9000244140625,
      "text": " See, Elisha understood many of these things"
    },
    {
      "id": 205,
      "start": 1639.9000244140625,
      "end": 1641.4000244140625,
      "text": " obviously in his life."
    },
    {
      "id": 206,
      "start": 1641.4000244140625,
      "end": 1643.4000244140625,
      "text": " He'd experienced the mighty power"
    },
    {
      "id": 207,
      "start": 1643.4000244140625,
      "end": 1644.4000244140625,
      "text": " of God in his life."
    },
    {
      "id": 208,
      "start": 1644.4000244140625,
      "end": 1646.9000244140625,
      "text": " He'd experienced the miracles"
    },
    {
      "id": 209,
      "start": 1646.9000244140625,
      "end": 1649.4000244140625,
      "text": " and the answered prayer."
    },
    {
      "id": 210,
      "start": 1649.4000244140625,
      "end": 1651.4000244140625,
      "text": " But now this servant,"
    },
    {
      "id": 211,
      "start": 1651.4000244140625,
      "end": 1654.4000244140625,
      "text": " when he first goes out on that early morning,"
    },
    {
      "id": 212,
      "start": 1654.4000244140625,
      "end": 1656.4000244140625,
      "text": " and he sees the great hosts,"
    },
    {
      "id": 213,
      "start": 1656.4000244140625,
      "end": 1657.9000244140625,
      "text": " the horses and the chariots,"
    },
    {
      "id": 214,
      "start": 1657.9000244140625,
      "end": 1658.9000244140625,
      "text": " and he says,"
    },
    {
      "id": 215,
      "start": 1658.9000244140625,
      "end": 1660.4000244140625,
      "text": " the city is compassed about"
    },
    {
      "id": 216,
      "start": 1660.4000244140625,
      "end": 1661.4000244140625,
      "text": " with these Syrians."
    },
    {
      "id": 217,
      "start": 1661.4000244140625,
      "end": 1662.4000244140625,
      "text": " There's a great host."
    },
    {
      "id": 218,
      "start": 1662.4000244140625,
      "end": 1666.4000244140625,
      "text": " Alas, my master, how shall we do?"
    },
    {
      "id": 219,
      "start": 1666.4000244140625,
      "end": 1667.9000244140625,
      "text": " Fear not."
    },
    {
      "id": 220,
      "start": 1667.9000244140625,
      "end": 1671.4000244140625,
      "text": " There are more with us than with them."
    },
    {
      "id": 221,
      "start": 1671.4000244140625,
      "end": 1672.4000244140625,
      "text": " All he needed to do"
    },
    {
      "id": 222,
      "start": 1672.4000244140625,
      "end": 1674.9000244140625,
      "text": " was be able to see properly."
    },
    {
      "id": 223,
      "start": 1674.9000244140625,
      "end": 1676.4000244140625,
      "text": " To be enlightened."
    },
    {
      "id": 224,
      "start": 1676.4000244140625,
      "end": 1679.4000244140625,
      "text": " Elisha was aware of the presence of God"
    },
    {
      "id": 225,
      "start": 1679.4000244140625,
      "end": 1680.9000244140625,
      "text": " and of the power of God."
    },
    {
      "id": 226,
      "start": 1680.9000244140625,
      "end": 1683.4000244140625,
      "text": " And this servant that is given to us"
    },
    {
      "id": 227,
      "start": 1683.4000244140625,
      "end": 1685.4000244140625,
      "text": " here in 2 Kings 6,"
    },
    {
      "id": 228,
      "start": 1685.4000244140625,
      "end": 1686.9000244140625,
      "text": " he was instructed,"
    },
    {
      "id": 229,
      "start": 1686.9000244140625,
      "end": 1688.4000244140625,
      "text": " and the instruction that he received"
    },
    {
      "id": 230,
      "start": 1688.4000244140625,
      "end": 1690.4000244140625,
      "text": " is the instruction that we still need today."
    },
    {
      "id": 231,
      "start": 1690.4000244140625,
      "end": 1692.9000244140625,
      "text": " Our God is in control."
    },
    {
      "id": 232,
      "start": 1692.9000244140625,
      "end": 1694.9000244140625,
      "text": " Our God is able to protect us."
    },
    {
      "id": 233,
      "start": 1694.9000244140625,
      "end": 1696.9000244140625,
      "text": " He is able to do exceeding abundantly"
    },
    {
      "id": 234,
      "start": 1696.9000244140625,
      "end": 1698.4000244140625,
      "text": " above all that we ask or think."
    },
    {
      "id": 235,
      "start": 1698.4000244140625,
      "end": 1700.4000244140625,
      "text": " He has a plan and His plan is perfect."
    },
    {
      "id": 236,
      "start": 1700.4000244140625,
      "end": 1702.4000244140625,
      "text": " He makes no mistakes whatsoever."
    },
    {
      "id": 237,
      "start": 1702.4000244140625,
      "end": 1704.4000244140625,
      "text": " And we can rejoice in understanding"
    },
    {
      "id": 238,
      "start": 1704.4000244140625,
      "end": 1706.9000244140625,
      "text": " that He hears and answers prayer."
    },
    {
      "id": 239,
      "start": 1706.9000244140625,
      "end": 1708.9000244140625,
      "text": " He extends to us that invitation"
    },
    {
      "id": 240,
      "start": 1708.9000244140625,
      "end": 1710.9000244140625,
      "text": " to call unto Him."
    },
    {
      "id": 241,
      "start": 1710.9000244140625,
      "end": 1712.4000244140625,
      "text": " And this evening,"
    },
    {
      "id": 242,
      "start": 1712.4000244140625,
      "end": 1714.9000244140625,
      "text": " we find that Elisha says to this servant,"
    },
    {
      "id": 243,
      "start": 1714.9000244140625,
      "end": 1717.9000244140625,
      "text": " there are more with us than with them."
    },
    {
      "id": 244,
      "start": 1717.9000244140625,
      "end": 1719.9000244140625,
      "text": " If God be for us,"
    },
    {
      "id": 245,
      "start": 1719.9000244140625,
      "end": 1721.9000244140625,
      "text": " who can be against us?"
    },
    {
      "id": 246,
      "start": 1721.9000244140625,
      "end": 1724.4000244140625,
      "text": " We are more than conquerors."
    },
    {
      "id": 247,
      "start": 1724.4000244140625,
      "end": 1725.9000244140625,
      "text": " More than conquerors."
    },
    {
      "id": 248,
      "start": 1725.9000244140625,
      "end": 1727.9000244140625,
      "text": " I'm so thankful for victory"
    },
    {
      "id": 249,
      "start": 1727.9000244140625,
      "end": 1729.9000244140625,
      "text": " through the Lord Jesus Christ."
    },
    {
      "id": 250,
      "start": 1729.9000244140625,
      "end": 1732.9000244140625,
      "text": " And that we can sing with Curtis Hudson,"
    },
    {
      "id": 251,
      "start": 1732.9000244140625,
      "end": 1734.9000244140625,
      "text": " I am on the winning side."
    },
    {
      "id": 252,
      "start": 1734.9000244140625,
      "end": 1735.9000244140625,
      "text": " Don't leave us."
    },
    {
      "id": 253,
      "start": 1735.9000244140625,
      "end": 1736.9000244140625,
      "text": " We're going to pray"
    },
    {
      "id": 254,
      "start": 1736.9000244140625,
      "end": 1738.9000244140625,
      "text": " and then we're going to watch the update video."
    },
    {
      "id": 255,
      "start": 1738.9000244140625,
      "end": 1739.9000244140625,
      "text": " And let's pray."
    },
    {
      "id": 256,
      "start": 1739.9000244140625,
      "end": 1741.4000244140625,
      "text": " Father, we love You."
    },
    {
      "id": 257,
      "start": 1741.4000244140625,
      "end": 1742.9000244140625,
      "text": " Thank You for loving us."
    },
    {
      "id": 258,
      "start": 1742.9000244140625,
      "end": 1743.9000244140625,
      "text": " Thank You for this account"
    },
    {
      "id": 259,
      "start": 1743.9000244140625,
      "end": 1745.4000244140625,
      "text": " that You gave us in Your Word."
    },
    {
      "id": 260,
      "start": 1745.4000244140625,
      "end": 1747.9000244140625,
      "text": " We thank You for the historical truth"
    },
    {
      "id": 261,
      "start": 1747.9000244140625,
      "end": 1749.4000244140625,
      "text": " of the record."
    },
    {
      "id": 262,
      "start": 1749.4000244140625,
      "end": 1751.9000244140625,
      "text": " Just the miraculous events that transpire"
    },
    {
      "id": 263,
      "start": 1751.9000244140625,
      "end": 1755.4000244140625,
      "text": " and how through these circumstances,"
    },
    {
      "id": 264,
      "start": 1755.4000244140625,
      "end": 1757.4000244140625,
      "text": " You were allowing this servant"
    },
    {
      "id": 265,
      "start": 1757.4000244140625,
      "end": 1758.9000244140625,
      "text": " to be instructed."
    },
    {
      "id": 266,
      "start": 1758.9000244140625,
      "end": 1760.4000244140625,
      "text": " You were allowing this servant"
    },
    {
      "id": 267,
      "start": 1760.4000244140625,
      "end": 1762.9000244140625,
      "text": " to learn truth about Your plan"
    },
    {
      "id": 268,
      "start": 1762.9000244140625,
      "end": 1765.4000244140625,
      "text": " and Your power and Your protection."
    },
    {
      "id": 269,
      "start": 1765.4000244140625,
      "end": 1769.4000244140625,
      "text": " About the privilege and answer to prayer."
    },
    {
      "id": 270,
      "start": 1769.4000244140625,
      "end": 1770.9000244140625,
      "text": " What a joy."
    },
    {
      "id": 271,
      "start": 1770.9000244140625,
      "end": 1772.4000244140625,
      "text": " God, I pray this evening"
    },
    {
      "id": 272,
      "start": 1772.4000244140625,
      "end": 1774.4000244140625,
      "text": " that as we've observed some of the instruction"
    },
    {
      "id": 273,
      "start": 1774.4000244140625,
      "end": 1775.9000244140625,
      "text": " that this servant has received,"
    },
    {
      "id": 274,
      "start": 1775.9000244140625,
      "end": 1777.4000244140625,
      "text": " that we too would be instructed"
    },
    {
      "id": 275,
      "start": 1777.4000244140625,
      "end": 1778.9000244140625,
      "text": " and that we would be encouraged"
    },
    {
      "id": 276,
      "start": 1778.9000244140625,
      "end": 1780.9000244140625,
      "text": " and strengthened in our walk with Thee."
    },
    {
      "id": 277,
      "start": 1780.9000244140625,
      "end": 1782.4000244140625,
      "text": " We thank You for the missionaries"
    },
    {
      "id": 278,
      "start": 1782.4000244140625,
      "end": 1784.4000244140625,
      "text": " that You've given us the opportunity to support."
    },
    {
      "id": 279,
      "start": 1784.4000244140625,
      "end": 1786.4000244140625,
      "text": " I pray that as we watch this update video"
    },
    {
      "id": 280,
      "start": 1786.4000244140625,
      "end": 1788.9000244140625,
      "text": " that You'd help us to be encouraged and strengthened."
    },
    {
      "id": 281,
      "start": 1788.9000244140625,
      "end": 1791.4000244140625,
      "text": " I pray that You would just continue to use us"
    },
    {
      "id": 282,
      "start": 1791.4000244140625,
      "end": 1793.4000244140625,
      "text": " to be a blessing to these missionaries"
    },
    {
      "id": 283,
      "start": 1793.4000244140625,
      "end": 1794.4000244140625,
      "text": " around the world."
    },
    {
      "id": 284,
      "start": 1794.4000244140625,
      "end": 1795.4000244140625,
      "text": " And we'll thank You for it."
    },
    {
      "id": 285,
      "start": 1795.4000244140625,
      "end": 1796.4000244140625,
      "text": " In Christ's name we pray."
    },
    {
      "id": 286,
      "start": 1796.4000244140625,
      "end": 1797.4000244140625,
      "text": " Amen."
    }
  ],
  "processed_at": "2025-04-17T20:37:46.313172"
}