{
  "video_id": "GOhUNz1pDM0",
  "text": "7. We'll be looking here at a familiar passage of Scripture and Matthew chapter 7 looking at verses 7 through 11. And as you have your Bible in turn there, I'll begin reading in verse number 7. I'll read the entirety of the text and we'll get into the message this evening. Notice as the Lord Jesus Christ is teaching, he says this, ask and it shall be given unto you. Seek and ye shall find. Knock and it shall be opened unto you. For everyone that asketh receiveth, and he that seeketh findeth. And to him that knocketh it shall be opened. Or what man is there of you, whom if his son ask bread, will he give him a stone? Or if he ask a fish, will he give him a serpent? If ye then, being evil, know how to give good gifts unto your children, how much more shall your Father which is in heaven give good things to them that ask him? Isn't that a wonderful passage of Scripture? So rich. I'm thankful for the Bible. The subject of prayer is a familiar and often discussed subject. However, I find and I think I've discovered both through experience personally and also through counseling over the years that consistent prayer in the life of a believer is challenging. And it seems as if one of the hardest disciplines in a Christian life is consistent, fervent prayer. Someone asked me the question years ago as we were having a Timothy Fellowship meeting. They said, what's more important, Bible reading or prayer? And I said, yes, because you really can't put one as a priority over the other. But I will say to you, and I've said it over the years from this pulpit, extremely transparent, it is a lot easier for me to spend an hour reading God's Word than it is for me to spend an hour praying. It doesn't mean that I don't pray. I'm just simply saying to you it's easier for me to spend that hour reading than to spend that hour praying. Someone asked this question. I read it this week in an article that I was reading and looking through, and it asked this question. It said, sweet hour of prayer. And then it asked this, how long does it take you to have a sweet hour of prayer? Does it take you a day? Does it take you a week? Does it take you a month? And I thought, wow, how convicting is that? But the reality is that prayer is something that is spoken of throughout the Bible. We find that in the Old Testament, there's wonderful references and records that God has provided to us with men and women that prayed, that poured their heart out before God, that were fervent in prayer and how God moved and how God worked. And we come to the New Testament, we begin to look at the example of the Lord Jesus Christ, a man who often, we understand he's the God-man, but often during his earthly ministry, he would go and he would go into a desert place. He would separate himself, for what purpose? For prayer. We find that the disciples of John, according to the Scriptures, he had taught them some things about prayer, and one of the disciples of Jesus says, teach us to pray. Throughout the Bible, we have many promises that God has given to us, and for a few minutes this evening, I want to look at this familiar text of Scripture. I've just simply titled the message, Ask, Seek, and Knock. Ask, Seek, and Knock. As we dig into the passage in verse number seven, number one, I want you to recognize the privilege. The Bible, as begins to speak here in this passage with regard to prayer, the Bible says, ask, and it shall be given unto you, or given you. Seek, and ye shall find. Knock, and it shall be opened unto you. We find that Jesus Christ, as he begins teaching in this portion of his earthly ministry with regard to the subject of prayer, we recognize immediately at the onset of this text that it's a privilege, and we must recognize the privilege that God has given to us as his people to pray. In fact, back in chapter number six, if you turn back a page, maybe it's on the same page for you, but we find that he's teaching on prayer there as well, and we find that it's in that passage in Matthew 6 that he provides for us that record of what we would refer to as the model prayer. In verse number five, the Bible says, and when thou prayest, thou shalt not be as the hypocrites are, for they love to pray standing in the synagogues and in the corners of the streets, that they may be seen of men. Verily I say unto you that they have their reward, but thou, when thou prayest, you see how he says, when thou prayest, as if it's expected that we would pray. Why? There's a privilege. He says, when thou prayest, enter into thy closet, and when thou hast shut thy door, pray to thy father which is in secret, and thy father which seeth in secret shall reward thee openly. But again, he says in verse number seven, but when ye pray, use not vain repetitions as the heathen do, for they think that they shall be heard for their much speaking. You know, we sometimes, as Baptist people, we may criticize some of maybe other denominations or religious backgrounds that have what we may refer to as memorized prayers, rote religion, but you know what I found is that sometimes we too have memorized prayers, rote religion. It can become very mundane. It can come very methodical. We can have in our minds where it's just almost like an autopilot kind of thing, and the reality is that we find that as we look at these passages of scripture in Matthew six and verse number seven and then also in chapter seven and verse number seven, we see and we must recognize the privilege that God has given to us to pray. We, of course, are familiar with many of the wonderful promises that God has given with regard to prayer, but I find that even prior to the promise that we read in Jeremiah 33-3, it starts out by saying, call unto me. Call unto me. This invitation that is extended, this privilege that would be Jeremiah's, that he could call unto the Almighty God, the one who is the creator of heaven and earth, the one who does all things well, God Almighty says to Jeremiah, call unto me. What a privilege. Reminded of the great truth of the book of Hebrews in chapter four and verse 16, again, a promise associated with it, but we think about that privilege where the Bible says, come boldly unto the throne of grace. I'm reminded not only of that truth in Hebrews chapter four, but I'm reminded as you continue to read through the book of Hebrews that we read of this wonderful truth that is given to us in chapter number 10 in verse number 19 and 20, where the Bible says this in Hebrews 10 verse 19 and 20, speaking about in desiring this evening that we would recognize the privilege. The Bible says, having therefore, brethren, boldness to enter into the holiest by the blood of Jesus, notice, by a new and living way, which he hath consecrated for us through the veil, that is to say, his flesh. Aren't you thankful that God provided for us access? Jesus Christ, the son of God, God in flesh, he gave to us, he provided for us access that we can come boldly to the throne of grace, that we have this privilege as the people of God. We must not view prayer as some religious duty or some requirement that's placed upon us. No, I get to spend time with the God of the universe, my savior, my God. I get to enter into his presence and I get to pour my heart out to him. What a privilege. This evening, as we're reminded from this familiar passage of scripture with regard to prayer, that we must recognize the privilege that God has given to us to pray. Number two, I want you to notice as we continue reading here in verses seven and eight and looking at these two verses together, we must resolve to be persistent. Resolve to be persistent. Notice in verse number eight, the Bible says, for everyone that asketh receiveth and he that seeketh findeth and to him that knocketh it shall be open. And so we find that he says in verse seven, ask and it shall be given. Seek and you shall find. Knock and it shall be opened unto you. And then he says, everyone that asketh, everyone that seeketh, everyone that knocketh. And we understand this evening that there's something about persistent prayer. Resolve to be persistent. See, it's easy for us to do something for a short period of time, but to labor in prayer. I'm talking about laboring in prayer, being persistent in prayer. We find that in verse seven, it's these words are in present tense, thus implying an ongoing action. Many of you would be familiar with the name George Mueller. George Mueller is a hero of the faith. George Mueller is a man that has written, we have so many written testimonies about the life and ministry of George Mueller, a man that prayed, a man that saw God work in miraculous ways. And here's a statement that George Mueller made. He says this, the great fault of the children of God is they do not continue in prayer. They do not go on praying. They do not persevere. If they desire anything for God's glory, they should pray until they get it. That's what George Mueller said. He said the fault, the great fault is that there's not this persistent perseverance in prayer. Reminded of the truth in Luke 11 in verse number eight, we won't turn there, but where the Bible talks about the one that would answer the friend, the neighbor because of his importunity. And we find this evening that we must resolve to be persistent again, that we're mindful of the fact that we are to continue to labor in prayer. We understand this evening that prayer is work. Have you found it to be so? The enemy doesn't like it when we pray. Why is that so? Because the enemy knows that God answers prayer. The enemy knows the power of prayer. And no doubt this evening, as we look at this passage, we're reminded about the privilege that is ours. And we recognize that privilege this evening, that we can go to our God at any time for any reason. But we must also resolve that we would be persistent in prayer, that we would persevere in prayer, that we would not get weary in well-doing, not to the sense of vain repetitions and understand biblically the difference with that. And we understand that we're pleading with God, we're persistent, seeking as even as George Mueller pointed out, if they desire anything for God's glory. So we're praying for God to be honored, for God to be glorified. We're praying as the Bible says, according to his will. We have this promise that if we ask anything according to his will, he hears us. Isn't that a blessing? And we understand this evening that there must be some resolve on the part of God's people to be persistent in prayer, to persevere in prayer. I want you to notice as we look at the remainder of the passage and look at this wonderful thought here that we must rest in the promise, rest in the promise. See, God has given, there's connections made throughout the Scripture with the subject of prayer. There are so many promises that are associated with prayer. And we find this evening that as we look at this text of Scripture that we're reminded that we must rest in the promise, we must rest. There are times in which we struggle to rest in our Christian lives. There are times in which we struggle with stress and care and worry and etc. But we must learn to rest and rest on the promises that God has provided to us. We find that it says in verse 7, ask, notice what it says, and it shall be given. Seek and ye shall find. Knock and it shall be opened unto you. Isn't that a wonderful promise that God gives us here? We find that beginning in verse number 9 and through the end of our text this evening in verses 9 through 11 that God provides us with a physical or temporal illustration, example, if you will, in order to drive home a spiritual truth. In fact, the Lord Jesus Christ during His earthly ministry, He often taught this way. Often He would use, we often talk about the parables of Jesus and how He would use an earthly example. He'd use something temporal, something that the people could relate to, and He would teach a lesson, and He would use that example, that illustration, in order to drive home a spiritual truth. And we find this evening that our God is holy. He's good. He alone is good. And we find that He begins, as He looks here in verses 9 and 10, and He begins to approach these individuals on the basis of their own behavior. And He says to them, or what man is there of you? So you understand He's making it very personal to them as they're gathered there, as they're having and listening to this discourse, the preaching of the Lord. We find that He says, or what man is there of you whom if his son ask bread will he give him a stone? Now God doesn't provide for us any type of reaction from the crowd. There's no dialogue that is provided here, but we understand that the question is asked, and Jesus is giving this example. And I believe that as you look at verse number 9, and even if we were to look at our own lives tonight and say, if our child, if our son were to ask us of bread, would we give him a stone? No. Which one of us would do that? I don't know how many were gathered at this particular time when Jesus is teaching, but many times there are multitudes of people that follow Jesus. And as He's teaching, and as He's speaking about this, He says, which one of you, if your son were to come and ask you for bread, which one of you would give him a stone? Look around the crowd. I mean, yeah, no, I wouldn't do that. Why would I do that? And then He says this, He's driving at home, or if he ask a fish, will He give him a serpent? Again, if you look around the crowd, no. My son asked me for a fish, I'm not going to give him a serpent. No way. And then notice what Jesus says, the master teacher. He says this in verse number 11, if ye then, notice what the Bible says, being evil. Why does He use that phraseology? Well, because if you compare us to God and our behaviors, and you look at this crowd that He's speaking to, God is good, God is holy, and He's saying that you, you're evil, you're not at that same level as who God is and what His attributes and character is, but yet you know how to give good things to your children. And so He says, if ye then, being evil, know how to give good gifts unto your children, and then I want you to see these three words, how much more? How much more shall your Father, which is in heaven, give good things to them that ask Him? Isn't that wonderful? We just rest in the promise this evening. We recognize the privilege. We must resolve to be persistent, but we must rest in the promise that God has provided to us with regard to prayer. We find that He, God, is perfect, He's holy, He's a good God, and we find that He doeth all things well, and He says this, that He will give us good things. How much more shall your Father, which is in heaven, give good things to them that ask Him? Do you remember what James says? You have not because ye ask not. Now, there's another truth in the book of James. He says you have not because you ask amiss. There are times in which we may be praying for something that's not for God's glory, and He would say that you're asking amiss, but the reality is that we understand. He says you have not because you ask not. The Bible says this in James 1, in verse number 5, if any man lack wisdom, let him ask of God, who giveth to all men liberally and upbraideth not. The issue is that our God has all wisdom. He is omniscient. He is the all-wise God, and He promises that He would give it to them that ask. The problem is sometimes in our lives we don't acknowledge our need, and we don't ask, and then we don't have the wisdom that God has promised to give us. It's available to us, but we've not asked for it. With each of those truths that I mentioned in the beginning of the message this evening with regard to recognizing the privilege associated with each of those verses that I shared in Jeremiah 33 and in Hebrews 4, we find that there's a promise that's associated with that invitation, if you will, or that privilege. God says this to Jeremiah in Jeremiah 33, 3, calling to me, and then He says this, and I will answer thee and show thee great and mighty things which thou knowest not. Isn't that a wonderful promise? Jeremiah was able to hear those words. If you read the book of Lamentations, you find that Jeremiah did call out to God. If you read the entirety of the book of Jeremiah, you see how God graciously and mercifully blessed Jeremiah, even though the Babylonians came in and Nebuchadnezzar led that campaign about taking the nation captive and destroying, and yet he says to one of his captains, his men here to go and to take care of Jeremiah. Whatever he says, that's what you do. It's amazing. Our God has given us wonderful promises. We read in Hebrews 4 and verse 16 where the Bible says that we're to come boldly under the throne of grace, but we understand that that verse of Scripture gives us again a promise that's associated with it. Notice the Bible says, let us therefore come boldly unto the throne of grace. Why? Notice that we may obtain mercy and find grace to help in time of need. Isn't that a wonderful promise? That we would obtain mercy and that we would find grace to help in time of need. The reality this evening is that prayer is a great privilege for the people of God. We need to recognize it. Prayer, someone noted, should not be treated as a spare tire. What do they mean by that? I believe this is what they mean by it. How many of you regularly check your spare tire? Anyone? Regularly check it. How many of you even know if you have a spare tire? I mean, how many of you know that you have a spare tire? Okay, some of you. You know, I thought I had a spare tire and I found out I didn't. Mark, you know when I found out I didn't? When I got a flat tire. That's a bad time to find out you don't have a spare tire. I mean, it was a brand new vehicle, but you know what they do with some of these brand new vehicles? They don't put spare tires in them. You know why? Does anyone know why? No, it has nothing to do with buying it. It's weight. They want the weight of the vehicle to be lower. The efficiency of fuel and so on and so forth, and so some of these new vehicles, they don't have spare tires in them. And then all of a sudden, you break down with a flat tire. What do you do? You go look for the spare tire and you find out it's not there. See, most of us, you're going to go check to see if you've got a spare tire tonight. You're going to check this week. I understand. All right, but most of us, we don't ever think about our spare tire until we need it. Right? We don't think about it. Prayer shouldn't be treated that way. Prayer is not just something we have as a resource when we have an emergency. No, it's communing with God. It's entering into the presence of our Savior. It's having that sweet fellowship with Him. I preached a few Sunday nights ago, pouring out our heart before Him. And this evening, I hope that we'd just be reminded tonight with this thought of prayer. What a privilege it is. Oh, that God would help us to be persistent, to persevere in prayer, that we would be known as men and women of prayer. We're reminded of Elijah. James mentions this, that the effectual fervent prayer of a righteous man availeth much. And then rest in the promise. Listen, when we take it to God, we trust that God's going to work as only He can. And God has a plan that's better than our plan. And He doeth all things well. And we just rest in His promise this evening. Ask, seek, knock. We see those simple thoughts in Matthew 7, verses 7 through 11. We're reminded of how good our God is. And He says to those that are gathered, if you're evil, and you know how to give good gifts to your children, how much more? How much more? So your heavenly Father, give good things unto them that ask Him. This evening, I hope that we would evaluate, I hope that we would evaluate, just for a moment, our prayer lives. And let God have His will and way. Let's have some honest and humble evaluation of our own prayer lives. And understand this evening that one of the greatest privileges for a child of God is so often neglected by the people of God. Let's pray together. Father, we love You. We thank You for loving us. We thank You tonight. Just for a few moments, we've had the opportunity to look at this familiar passage. And I pray the Holy Spirit of God would move and work in hearts and lives as only He can. God, would You help us in just these short moments to have an honest evaluation of our own personal prayer lives? Lord, I pray that You'd help us to rest in the promises that You've given to us associated with prayer. Help us, Lord, to resolve to be persistent in prayer, to persevere. And God, help us to recognize it's a privilege, it's an absolute privilege to enter into Your presence, that at any moment, at any time, we can come boldly to Your throne. We can enter into Your presence knowing that You hear us and knowing that You're able. I pray that You'd work in this moment of invitation as only You can. For it's in Christ's name we pray. Would You stand with me, heads",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.639999866485596,
      "text": " 7. We'll be looking here at a familiar passage of Scripture and Matthew chapter 7 looking at verses"
    },
    {
      "id": 1,
      "start": 6.639999866485596,
      "end": 12.15999984741211,
      "text": " 7 through 11. And as you have your Bible in turn there, I'll begin reading in verse number 7."
    },
    {
      "id": 2,
      "start": 12.15999984741211,
      "end": 16.719999313354492,
      "text": " I'll read the entirety of the text and we'll get into the message this evening. Notice as the Lord"
    },
    {
      "id": 3,
      "start": 16.719999313354492,
      "end": 24.239999771118164,
      "text": " Jesus Christ is teaching, he says this, ask and it shall be given unto you. Seek and ye shall find."
    },
    {
      "id": 4,
      "start": 24.239999771118164,
      "end": 30.799999237060547,
      "text": " Knock and it shall be opened unto you. For everyone that asketh receiveth, and he that"
    },
    {
      "id": 5,
      "start": 30.799999237060547,
      "end": 38.31999969482422,
      "text": " seeketh findeth. And to him that knocketh it shall be opened. Or what man is there of you,"
    },
    {
      "id": 6,
      "start": 38.31999969482422,
      "end": 48.400001525878906,
      "text": " whom if his son ask bread, will he give him a stone? Or if he ask a fish, will he give him a"
    },
    {
      "id": 7,
      "start": 48.400001525878906,
      "end": 59.040000915527344,
      "text": " serpent? If ye then, being evil, know how to give good gifts unto your children, how much more"
    },
    {
      "id": 8,
      "start": 59.91999816894531,
      "end": 67.5999984741211,
      "text": " shall your Father which is in heaven give good things to them that ask him? Isn't that a wonderful"
    },
    {
      "id": 9,
      "start": 67.5999984741211,
      "end": 73.27999877929688,
      "text": " passage of Scripture? So rich. I'm thankful for the Bible. The subject of prayer is a familiar"
    },
    {
      "id": 10,
      "start": 73.27999877929688,
      "end": 79.19999694824219,
      "text": " and often discussed subject. However, I find and I think I've discovered both through experience"
    },
    {
      "id": 11,
      "start": 79.19999694824219,
      "end": 85.12000274658203,
      "text": " personally and also through counseling over the years that consistent prayer in the life of a"
    },
    {
      "id": 12,
      "start": 85.12000274658203,
      "end": 91.36000061035156,
      "text": " believer is challenging. And it seems as if one of the hardest disciplines in a Christian life"
    },
    {
      "id": 13,
      "start": 91.36000061035156,
      "end": 96.4000015258789,
      "text": " is consistent, fervent prayer. Someone asked me the question years ago as we were having a Timothy"
    },
    {
      "id": 14,
      "start": 96.4000015258789,
      "end": 100.63999938964844,
      "text": " Fellowship meeting. They said, what's more important, Bible reading or prayer? And I said,"
    },
    {
      "id": 15,
      "start": 100.63999938964844,
      "end": 107.19999694824219,
      "text": " yes, because you really can't put one as a priority over the other. But I will say to you,"
    },
    {
      "id": 16,
      "start": 107.19999694824219,
      "end": 112.23999786376953,
      "text": " and I've said it over the years from this pulpit, extremely transparent, it is a lot easier for me"
    },
    {
      "id": 17,
      "start": 112.23999786376953,
      "end": 116.87999725341797,
      "text": " to spend an hour reading God's Word than it is for me to spend an hour praying. It doesn't mean that"
    },
    {
      "id": 18,
      "start": 116.87999725341797,
      "end": 122.72000122070312,
      "text": " I don't pray. I'm just simply saying to you it's easier for me to spend that hour reading than to"
    },
    {
      "id": 19,
      "start": 122.72000122070312,
      "end": 128.55999755859375,
      "text": " spend that hour praying. Someone asked this question. I read it this week in an article"
    },
    {
      "id": 20,
      "start": 128.55999755859375,
      "end": 134.24000549316406,
      "text": " that I was reading and looking through, and it asked this question. It said, sweet hour of prayer."
    },
    {
      "id": 21,
      "start": 134.24000549316406,
      "end": 140.8800048828125,
      "text": " And then it asked this, how long does it take you to have a sweet hour of prayer? Does it take you"
    },
    {
      "id": 22,
      "start": 140.8800048828125,
      "end": 147.1999969482422,
      "text": " a day? Does it take you a week? Does it take you a month? And I thought, wow, how convicting is that?"
    },
    {
      "id": 23,
      "start": 147.83999633789062,
      "end": 154.32000732421875,
      "text": " But the reality is that prayer is something that is spoken of throughout the Bible. We find that"
    },
    {
      "id": 24,
      "start": 154.39999389648438,
      "end": 161.0399932861328,
      "text": " in the Old Testament, there's wonderful references and records that God has provided to us with"
    },
    {
      "id": 25,
      "start": 161.0399932861328,
      "end": 168.32000732421875,
      "text": " men and women that prayed, that poured their heart out before God, that were fervent in prayer and"
    },
    {
      "id": 26,
      "start": 168.32000732421875,
      "end": 174.32000732421875,
      "text": " how God moved and how God worked. And we come to the New Testament, we begin to look at the"
    },
    {
      "id": 27,
      "start": 174.32000732421875,
      "end": 180.8000030517578,
      "text": " example of the Lord Jesus Christ, a man who often, we understand he's the God-man, but often during"
    },
    {
      "id": 28,
      "start": 180.8000030517578,
      "end": 186.16000366210938,
      "text": " his earthly ministry, he would go and he would go into a desert place. He would separate himself,"
    },
    {
      "id": 29,
      "start": 186.16000366210938,
      "end": 193.36000061035156,
      "text": " for what purpose? For prayer. We find that the disciples of John, according to the Scriptures,"
    },
    {
      "id": 30,
      "start": 193.36000061035156,
      "end": 198.0,
      "text": " he had taught them some things about prayer, and one of the disciples of Jesus says,"
    },
    {
      "id": 31,
      "start": 198.0,
      "end": 205.60000610351562,
      "text": " teach us to pray. Throughout the Bible, we have many promises that God has given to us, and"
    },
    {
      "id": 32,
      "start": 205.60000610351562,
      "end": 209.60000610351562,
      "text": " for a few minutes this evening, I want to look at this familiar text of Scripture. I've just simply"
    },
    {
      "id": 33,
      "start": 209.60000610351562,
      "end": 218.16000366210938,
      "text": " titled the message, Ask, Seek, and Knock. Ask, Seek, and Knock. As we dig into the passage in verse number"
    },
    {
      "id": 34,
      "start": 218.16000366210938,
      "end": 225.1199951171875,
      "text": " seven, number one, I want you to recognize the privilege. The Bible, as begins to speak here in"
    },
    {
      "id": 35,
      "start": 225.1199951171875,
      "end": 231.75999450683594,
      "text": " this passage with regard to prayer, the Bible says, ask, and it shall be given unto you, or given you."
    },
    {
      "id": 36,
      "start": 231.75999450683594,
      "end": 238.16000366210938,
      "text": " Seek, and ye shall find. Knock, and it shall be opened unto you. We find that Jesus Christ, as he"
    },
    {
      "id": 37,
      "start": 238.16000366210938,
      "end": 243.60000610351562,
      "text": " begins teaching in this portion of his earthly ministry with regard to the subject of prayer,"
    },
    {
      "id": 38,
      "start": 243.60000610351562,
      "end": 250.32000732421875,
      "text": " we recognize immediately at the onset of this text that it's a privilege, and we must recognize the"
    },
    {
      "id": 39,
      "start": 250.32000732421875,
      "end": 256.1600036621094,
      "text": " privilege that God has given to us as his people to pray. In fact, back in chapter number six,"
    },
    {
      "id": 40,
      "start": 256.1600036621094,
      "end": 260.4800109863281,
      "text": " if you turn back a page, maybe it's on the same page for you, but we find that he's teaching on"
    },
    {
      "id": 41,
      "start": 260.4800109863281,
      "end": 265.760009765625,
      "text": " prayer there as well, and we find that it's in that passage in Matthew 6 that he provides for"
    },
    {
      "id": 42,
      "start": 265.760009765625,
      "end": 271.44000244140625,
      "text": " us that record of what we would refer to as the model prayer. In verse number five, the Bible says,"
    },
    {
      "id": 43,
      "start": 271.44000244140625,
      "end": 276.55999755859375,
      "text": " and when thou prayest, thou shalt not be as the hypocrites are, for they love to pray standing in"
    },
    {
      "id": 44,
      "start": 276.55999755859375,
      "end": 281.2799987792969,
      "text": " the synagogues and in the corners of the streets, that they may be seen of men. Verily I say unto you"
    },
    {
      "id": 45,
      "start": 281.2799987792969,
      "end": 288.0799865722656,
      "text": " that they have their reward, but thou, when thou prayest, you see how he says, when thou prayest,"
    },
    {
      "id": 46,
      "start": 288.0799865722656,
      "end": 293.9200134277344,
      "text": " as if it's expected that we would pray. Why? There's a privilege. He says, when thou prayest,"
    },
    {
      "id": 47,
      "start": 293.9200134277344,
      "end": 298.79998779296875,
      "text": " enter into thy closet, and when thou hast shut thy door, pray to thy father which is in secret,"
    },
    {
      "id": 48,
      "start": 298.79998779296875,
      "end": 303.8399963378906,
      "text": " and thy father which seeth in secret shall reward thee openly. But again, he says in verse number"
    },
    {
      "id": 49,
      "start": 303.8399963378906,
      "end": 310.9599914550781,
      "text": " seven, but when ye pray, use not vain repetitions as the heathen do, for they think that they shall"
    },
    {
      "id": 50,
      "start": 310.9599914550781,
      "end": 317.44000244140625,
      "text": " be heard for their much speaking. You know, we sometimes, as Baptist people, we may criticize"
    },
    {
      "id": 51,
      "start": 317.44000244140625,
      "end": 322.9599914550781,
      "text": " some of maybe other denominations or religious backgrounds that have what we may refer to as"
    },
    {
      "id": 52,
      "start": 322.9599914550781,
      "end": 329.5199890136719,
      "text": " memorized prayers, rote religion, but you know what I found is that sometimes we too have memorized"
    },
    {
      "id": 53,
      "start": 329.5199890136719,
      "end": 336.55999755859375,
      "text": " prayers, rote religion. It can become very mundane. It can come very methodical. We can have in our"
    },
    {
      "id": 54,
      "start": 336.55999755859375,
      "end": 342.4800109863281,
      "text": " minds where it's just almost like an autopilot kind of thing, and the reality is that we find"
    },
    {
      "id": 55,
      "start": 342.4800109863281,
      "end": 347.760009765625,
      "text": " that as we look at these passages of scripture in Matthew six and verse number seven and then"
    },
    {
      "id": 56,
      "start": 347.760009765625,
      "end": 354.0,
      "text": " also in chapter seven and verse number seven, we see and we must recognize the privilege that God"
    },
    {
      "id": 57,
      "start": 354.0,
      "end": 360.4800109863281,
      "text": " has given to us to pray. We, of course, are familiar with many of the wonderful promises that God has"
    },
    {
      "id": 58,
      "start": 360.4800109863281,
      "end": 367.44000244140625,
      "text": " given with regard to prayer, but I find that even prior to the promise that we read in Jeremiah 33-3,"
    },
    {
      "id": 59,
      "start": 367.44000244140625,
      "end": 375.44000244140625,
      "text": " it starts out by saying, call unto me. Call unto me. This invitation that is extended, this privilege"
    },
    {
      "id": 60,
      "start": 375.44000244140625,
      "end": 381.44000244140625,
      "text": " that would be Jeremiah's, that he could call unto the Almighty God, the one who is the creator of"
    },
    {
      "id": 61,
      "start": 381.44000244140625,
      "end": 389.3599853515625,
      "text": " heaven and earth, the one who does all things well, God Almighty says to Jeremiah, call unto me."
    },
    {
      "id": 62,
      "start": 389.3599853515625,
      "end": 396.7200012207031,
      "text": " What a privilege. Reminded of the great truth of the book of Hebrews in chapter four and verse 16,"
    },
    {
      "id": 63,
      "start": 396.7200012207031,
      "end": 402.0799865722656,
      "text": " again, a promise associated with it, but we think about that privilege where the Bible says, come"
    },
    {
      "id": 64,
      "start": 402.0799865722656,
      "end": 407.8399963378906,
      "text": " boldly unto the throne of grace. I'm reminded not only of that truth in Hebrews chapter four,"
    },
    {
      "id": 65,
      "start": 407.8399963378906,
      "end": 412.0,
      "text": " but I'm reminded as you continue to read through the book of Hebrews that we"
    },
    {
      "id": 66,
      "start": 412.0,
      "end": 419.0400085449219,
      "text": " read of this wonderful truth that is given to us in chapter number 10 in verse number 19 and 20,"
    },
    {
      "id": 67,
      "start": 419.0400085449219,
      "end": 425.3599853515625,
      "text": " where the Bible says this in Hebrews 10 verse 19 and 20, speaking about in desiring this evening"
    },
    {
      "id": 68,
      "start": 425.3599853515625,
      "end": 431.44000244140625,
      "text": " that we would recognize the privilege. The Bible says, having therefore, brethren, boldness to enter"
    },
    {
      "id": 69,
      "start": 431.44000244140625,
      "end": 439.0400085449219,
      "text": " into the holiest by the blood of Jesus, notice, by a new and living way, which he hath consecrated"
    },
    {
      "id": 70,
      "start": 439.0400085449219,
      "end": 446.0799865722656,
      "text": " for us through the veil, that is to say, his flesh. Aren't you thankful that God provided for us"
    },
    {
      "id": 71,
      "start": 446.0799865722656,
      "end": 454.6400146484375,
      "text": " access? Jesus Christ, the son of God, God in flesh, he gave to us, he provided for us access that we"
    },
    {
      "id": 72,
      "start": 454.6400146484375,
      "end": 461.44000244140625,
      "text": " can come boldly to the throne of grace, that we have this privilege as the people of God. We must"
    },
    {
      "id": 73,
      "start": 461.44000244140625,
      "end": 469.20001220703125,
      "text": " not view prayer as some religious duty or some requirement that's placed upon us. No, I get to"
    },
    {
      "id": 74,
      "start": 469.20001220703125,
      "end": 475.8399963378906,
      "text": " spend time with the God of the universe, my savior, my God. I get to enter into his presence and I get"
    },
    {
      "id": 75,
      "start": 475.8399963378906,
      "end": 483.0400085449219,
      "text": " to pour my heart out to him. What a privilege. This evening, as we're reminded from this familiar"
    },
    {
      "id": 76,
      "start": 483.1199951171875,
      "end": 490.0799865722656,
      "text": " passage of scripture with regard to prayer, that we must recognize the privilege that God has given"
    },
    {
      "id": 77,
      "start": 490.0799865722656,
      "end": 496.8800048828125,
      "text": " to us to pray. Number two, I want you to notice as we continue reading here in verses seven and eight"
    },
    {
      "id": 78,
      "start": 496.8800048828125,
      "end": 504.1600036621094,
      "text": " and looking at these two verses together, we must resolve to be persistent. Resolve to be persistent."
    },
    {
      "id": 79,
      "start": 504.1600036621094,
      "end": 510.32000732421875,
      "text": " Notice in verse number eight, the Bible says, for everyone that asketh receiveth and he that seeketh"
    },
    {
      "id": 80,
      "start": 510.32000732421875,
      "end": 516.0800170898438,
      "text": " findeth and to him that knocketh it shall be open. And so we find that he says in verse seven,"
    },
    {
      "id": 81,
      "start": 516.0800170898438,
      "end": 520.6400146484375,
      "text": " ask and it shall be given. Seek and you shall find. Knock and it shall be opened unto you. And then he"
    },
    {
      "id": 82,
      "start": 520.6400146484375,
      "end": 526.0,
      "text": " says, everyone that asketh, everyone that seeketh, everyone that knocketh. And we understand this"
    },
    {
      "id": 83,
      "start": 526.0,
      "end": 534.0800170898438,
      "text": " evening that there's something about persistent prayer. Resolve to be persistent. See, it's easy"
    },
    {
      "id": 84,
      "start": 534.0800170898438,
      "end": 541.280029296875,
      "text": " for us to do something for a short period of time, but to labor in prayer. I'm talking about"
    },
    {
      "id": 85,
      "start": 541.280029296875,
      "end": 548.9600219726562,
      "text": " laboring in prayer, being persistent in prayer. We find that in verse seven, it's these words are in"
    },
    {
      "id": 86,
      "start": 548.9600219726562,
      "end": 554.9600219726562,
      "text": " present tense, thus implying an ongoing action. Many of you would be familiar with the name George"
    },
    {
      "id": 87,
      "start": 554.9600219726562,
      "end": 561.3599853515625,
      "text": " Mueller. George Mueller is a hero of the faith. George Mueller is a man that has written, we have"
    },
    {
      "id": 88,
      "start": 561.3599853515625,
      "end": 567.760009765625,
      "text": " so many written testimonies about the life and ministry of George Mueller, a man that prayed,"
    },
    {
      "id": 89,
      "start": 568.4000244140625,
      "end": 577.5999755859375,
      "text": " a man that saw God work in miraculous ways. And here's a statement that George Mueller made. He"
    },
    {
      "id": 90,
      "start": 577.5999755859375,
      "end": 587.280029296875,
      "text": " says this, the great fault of the children of God is they do not continue in prayer. They do not go"
    },
    {
      "id": 91,
      "start": 587.280029296875,
      "end": 595.8400268554688,
      "text": " on praying. They do not persevere. If they desire anything for God's glory, they should pray until"
    },
    {
      "id": 92,
      "start": 595.8400268554688,
      "end": 602.0,
      "text": " they get it. That's what George Mueller said. He said the fault, the great fault is that there's"
    },
    {
      "id": 93,
      "start": 602.0,
      "end": 609.760009765625,
      "text": " not this persistent perseverance in prayer. Reminded of the truth in Luke 11 in verse number"
    },
    {
      "id": 94,
      "start": 609.760009765625,
      "end": 614.719970703125,
      "text": " eight, we won't turn there, but where the Bible talks about the one that would answer the friend,"
    },
    {
      "id": 95,
      "start": 614.719970703125,
      "end": 621.1199951171875,
      "text": " the neighbor because of his importunity. And we find this evening that we must resolve to"
    },
    {
      "id": 96,
      "start": 621.1199951171875,
      "end": 627.1199951171875,
      "text": " be persistent again, that we're mindful of the fact that we are to continue to labor in prayer."
    },
    {
      "id": 97,
      "start": 627.1199951171875,
      "end": 633.280029296875,
      "text": " We understand this evening that prayer is work. Have you found it to be so? The enemy doesn't"
    },
    {
      "id": 98,
      "start": 633.280029296875,
      "end": 638.719970703125,
      "text": " like it when we pray. Why is that so? Because the enemy knows that God answers prayer."
    },
    {
      "id": 99,
      "start": 639.6799926757812,
      "end": 646.239990234375,
      "text": " The enemy knows the power of prayer. And no doubt this evening, as we look at this passage,"
    },
    {
      "id": 100,
      "start": 646.239990234375,
      "end": 653.760009765625,
      "text": " we're reminded about the privilege that is ours. And we recognize that privilege this evening,"
    },
    {
      "id": 101,
      "start": 653.760009765625,
      "end": 659.8400268554688,
      "text": " that we can go to our God at any time for any reason. But we must also resolve that we would"
    },
    {
      "id": 102,
      "start": 659.8400268554688,
      "end": 666.9600219726562,
      "text": " be persistent in prayer, that we would persevere in prayer, that we would not get weary in well-doing,"
    },
    {
      "id": 103,
      "start": 666.9600219726562,
      "end": 673.2000122070312,
      "text": " not to the sense of vain repetitions and understand biblically the difference with that."
    },
    {
      "id": 104,
      "start": 673.2000122070312,
      "end": 679.6799926757812,
      "text": " And we understand that we're pleading with God, we're persistent, seeking as even as George"
    },
    {
      "id": 105,
      "start": 679.6799926757812,
      "end": 685.2000122070312,
      "text": " Mueller pointed out, if they desire anything for God's glory. So we're praying for God to be"
    },
    {
      "id": 106,
      "start": 685.2000122070312,
      "end": 690.239990234375,
      "text": " honored, for God to be glorified. We're praying as the Bible says, according to his will."
    },
    {
      "id": 107,
      "start": 691.2000122070312,
      "end": 696.8800048828125,
      "text": " We have this promise that if we ask anything according to his will, he hears us. Isn't that"
    },
    {
      "id": 108,
      "start": 696.8800048828125,
      "end": 702.8800048828125,
      "text": " a blessing? And we understand this evening that there must be some resolve on the part of God's"
    },
    {
      "id": 109,
      "start": 702.8800048828125,
      "end": 710.719970703125,
      "text": " people to be persistent in prayer, to persevere in prayer. I want you to notice as we look at"
    },
    {
      "id": 110,
      "start": 710.719970703125,
      "end": 716.6400146484375,
      "text": " the remainder of the passage and look at this wonderful thought here that we must rest in the"
    },
    {
      "id": 111,
      "start": 716.6400146484375,
      "end": 724.3200073242188,
      "text": " promise, rest in the promise. See, God has given, there's connections made throughout the Scripture"
    },
    {
      "id": 112,
      "start": 724.3200073242188,
      "end": 729.2000122070312,
      "text": " with the subject of prayer. There are so many promises that are associated with prayer."
    },
    {
      "id": 113,
      "start": 730.4000244140625,
      "end": 734.7999877929688,
      "text": " And we find this evening that as we look at this text of Scripture that we're reminded"
    },
    {
      "id": 114,
      "start": 734.7999877929688,
      "end": 743.2000122070312,
      "text": " that we must rest in the promise, we must rest. There are times in which we struggle to rest in"
    },
    {
      "id": 115,
      "start": 743.2000122070312,
      "end": 749.2000122070312,
      "text": " our Christian lives. There are times in which we struggle with stress and care and worry and"
    },
    {
      "id": 116,
      "start": 749.2000122070312,
      "end": 754.9600219726562,
      "text": " etc. But we must learn to rest and rest on the promises that God has provided to us."
    },
    {
      "id": 117,
      "start": 754.9600219726562,
      "end": 760.3200073242188,
      "text": " We find that it says in verse 7, ask, notice what it says, and it shall be given."
    },
    {
      "id": 118,
      "start": 763.3599853515625,
      "end": 771.0399780273438,
      "text": " Seek and ye shall find. Knock and it shall be opened unto you. Isn't that a wonderful promise that God"
    },
    {
      "id": 119,
      "start": 771.0399780273438,
      "end": 775.6799926757812,
      "text": " gives us here? We find that beginning in verse number 9 and through the end of our text this"
    },
    {
      "id": 120,
      "start": 775.6799926757812,
      "end": 782.719970703125,
      "text": " evening in verses 9 through 11 that God provides us with a physical or temporal illustration, example,"
    },
    {
      "id": 121,
      "start": 782.719970703125,
      "end": 787.9199829101562,
      "text": " if you will, in order to drive home a spiritual truth. In fact, the Lord Jesus Christ during His"
    },
    {
      "id": 122,
      "start": 787.9199829101562,
      "end": 793.0399780273438,
      "text": " earthly ministry, He often taught this way. Often He would use, we often talk about the parables of"
    },
    {
      "id": 123,
      "start": 793.0399780273438,
      "end": 798.6400146484375,
      "text": " Jesus and how He would use an earthly example. He'd use something temporal, something that the people"
    },
    {
      "id": 124,
      "start": 798.6400146484375,
      "end": 803.760009765625,
      "text": " could relate to, and He would teach a lesson, and He would use that example, that illustration,"
    },
    {
      "id": 125,
      "start": 803.760009765625,
      "end": 811.52001953125,
      "text": " in order to drive home a spiritual truth. And we find this evening that our God is holy. He's good."
    },
    {
      "id": 126,
      "start": 811.52001953125,
      "end": 816.7999877929688,
      "text": " He alone is good. And we find that He begins, as He looks here in verses 9 and 10, and He begins to"
    },
    {
      "id": 127,
      "start": 818.239990234375,
      "end": 825.1199951171875,
      "text": " approach these individuals on the basis of their own behavior. And He says to them,"
    },
    {
      "id": 128,
      "start": 825.1199951171875,
      "end": 831.3599853515625,
      "text": " or what man is there of you? So you understand He's making it very personal to them as they're"
    },
    {
      "id": 129,
      "start": 831.3599853515625,
      "end": 836.6400146484375,
      "text": " gathered there, as they're having and listening to this discourse, the preaching of the Lord."
    },
    {
      "id": 130,
      "start": 836.6400146484375,
      "end": 844.6400146484375,
      "text": " We find that He says, or what man is there of you whom if his son ask bread will he give him"
    },
    {
      "id": 131,
      "start": 845.280029296875,
      "end": 852.0,
      "text": " a stone? Now God doesn't provide for us any type of reaction from the crowd. There's no"
    },
    {
      "id": 132,
      "start": 852.0,
      "end": 859.0399780273438,
      "text": " dialogue that is provided here, but we understand that the question is asked, and Jesus is giving"
    },
    {
      "id": 133,
      "start": 859.0399780273438,
      "end": 864.0800170898438,
      "text": " this example. And I believe that as you look at verse number 9, and even if we were to look at"
    },
    {
      "id": 134,
      "start": 864.0800170898438,
      "end": 870.0800170898438,
      "text": " our own lives tonight and say, if our child, if our son were to ask us of bread, would we give"
    },
    {
      "id": 135,
      "start": 870.0800170898438,
      "end": 879.0399780273438,
      "text": " him a stone? No. Which one of us would do that? I don't know how many were gathered at this particular"
    },
    {
      "id": 136,
      "start": 879.1199951171875,
      "end": 884.0800170898438,
      "text": " time when Jesus is teaching, but many times there are multitudes of people that follow"
    },
    {
      "id": 137,
      "start": 884.0800170898438,
      "end": 888.8800048828125,
      "text": " Jesus. And as He's teaching, and as He's speaking about this, He says, which one of you,"
    },
    {
      "id": 138,
      "start": 889.760009765625,
      "end": 895.3599853515625,
      "text": " if your son were to come and ask you for bread, which one of you would give him a stone?"
    },
    {
      "id": 139,
      "start": 897.280029296875,
      "end": 903.3599853515625,
      "text": " Look around the crowd. I mean, yeah, no, I wouldn't do that. Why would I do that?"
    },
    {
      "id": 140,
      "start": 904.239990234375,
      "end": 911.4400024414062,
      "text": " And then He says this, He's driving at home, or if he ask a fish, will He give him a serpent?"
    },
    {
      "id": 141,
      "start": 912.7999877929688,
      "end": 919.9199829101562,
      "text": " Again, if you look around the crowd, no. My son asked me for a fish, I'm not going to give him"
    },
    {
      "id": 142,
      "start": 919.9199829101562,
      "end": 927.4400024414062,
      "text": " a serpent. No way. And then notice what Jesus says, the master teacher. He says this in verse"
    },
    {
      "id": 143,
      "start": 927.52001953125,
      "end": 934.7999877929688,
      "text": " number 11, if ye then, notice what the Bible says, being evil. Why does He use that phraseology?"
    },
    {
      "id": 144,
      "start": 934.7999877929688,
      "end": 941.8400268554688,
      "text": " Well, because if you compare us to God and our behaviors, and you look at this crowd that He's"
    },
    {
      "id": 145,
      "start": 941.8400268554688,
      "end": 949.0399780273438,
      "text": " speaking to, God is good, God is holy, and He's saying that you, you're evil, you're not at that"
    },
    {
      "id": 146,
      "start": 949.0399780273438,
      "end": 954.9600219726562,
      "text": " same level as who God is and what His attributes and character is, but yet you know how to give"
    },
    {
      "id": 147,
      "start": 954.9600219726562,
      "end": 962.1599731445312,
      "text": " good things to your children. And so He says, if ye then, being evil, know how to give good"
    },
    {
      "id": 148,
      "start": 962.1599731445312,
      "end": 969.9199829101562,
      "text": " gifts unto your children, and then I want you to see these three words, how much more? How much more"
    },
    {
      "id": 149,
      "start": 971.8400268554688,
      "end": 980.7999877929688,
      "text": " shall your Father, which is in heaven, give good things to them that ask Him?"
    },
    {
      "id": 150,
      "start": 981.760009765625,
      "end": 988.1599731445312,
      "text": " Isn't that wonderful? We just rest in the promise this evening. We recognize the privilege. We must"
    },
    {
      "id": 151,
      "start": 988.1599731445312,
      "end": 993.8400268554688,
      "text": " resolve to be persistent, but we must rest in the promise that God has provided to us"
    },
    {
      "id": 152,
      "start": 993.8400268554688,
      "end": 1002.5599975585938,
      "text": " with regard to prayer. We find that He, God, is perfect, He's holy, He's a good God, and we find"
    },
    {
      "id": 153,
      "start": 1002.5599975585938,
      "end": 1008.0,
      "text": " that He doeth all things well, and He says this, that He will give us good things. How much more"
    },
    {
      "id": 154,
      "start": 1008.0,
      "end": 1015.0399780273438,
      "text": " shall your Father, which is in heaven, give good things to them that ask Him? Do you remember what"
    },
    {
      "id": 155,
      "start": 1015.0399780273438,
      "end": 1024.4000244140625,
      "text": " James says? You have not because ye ask not. Now, there's another truth in the book of James. He"
    },
    {
      "id": 156,
      "start": 1024.4000244140625,
      "end": 1030.8800048828125,
      "text": " says you have not because you ask amiss. There are times in which we may be praying for something"
    },
    {
      "id": 157,
      "start": 1030.8800048828125,
      "end": 1036.47998046875,
      "text": " that's not for God's glory, and He would say that you're asking amiss, but the reality is that we"
    },
    {
      "id": 158,
      "start": 1036.47998046875,
      "end": 1044.0799560546875,
      "text": " understand. He says you have not because you ask not. The Bible says this in James 1, in verse"
    },
    {
      "id": 159,
      "start": 1044.0799560546875,
      "end": 1050.719970703125,
      "text": " number 5, if any man lack wisdom, let him ask of God, who giveth to all men liberally and upbraideth"
    },
    {
      "id": 160,
      "start": 1050.719970703125,
      "end": 1057.6800537109375,
      "text": " not. The issue is that our God has all wisdom. He is omniscient. He is the all-wise God, and He"
    },
    {
      "id": 161,
      "start": 1057.6800537109375,
      "end": 1065.280029296875,
      "text": " promises that He would give it to them that ask. The problem is sometimes in our lives we don't"
    },
    {
      "id": 162,
      "start": 1065.280029296875,
      "end": 1072.4000244140625,
      "text": " acknowledge our need, and we don't ask, and then we don't have the wisdom that God has promised to"
    },
    {
      "id": 163,
      "start": 1072.4000244140625,
      "end": 1083.43994140625,
      "text": " give us. It's available to us, but we've not asked for it. With each of those truths that I mentioned"
    },
    {
      "id": 164,
      "start": 1083.43994140625,
      "end": 1089.43994140625,
      "text": " in the beginning of the message this evening with regard to recognizing the privilege associated"
    },
    {
      "id": 165,
      "start": 1089.43994140625,
      "end": 1096.3199462890625,
      "text": " with each of those verses that I shared in Jeremiah 33 and in Hebrews 4, we find that"
    },
    {
      "id": 166,
      "start": 1096.3199462890625,
      "end": 1102.719970703125,
      "text": " there's a promise that's associated with that invitation, if you will, or that privilege."
    },
    {
      "id": 167,
      "start": 1102.719970703125,
      "end": 1108.8800048828125,
      "text": " God says this to Jeremiah in Jeremiah 33, 3, calling to me, and then He says this, and I will answer thee"
    },
    {
      "id": 168,
      "start": 1110.1600341796875,
      "end": 1117.5999755859375,
      "text": " and show thee great and mighty things which thou knowest not. Isn't that a wonderful promise?"
    },
    {
      "id": 169,
      "start": 1118.56005859375,
      "end": 1124.0,
      "text": " Jeremiah was able to hear those words. If you read the book of Lamentations, you find that"
    },
    {
      "id": 170,
      "start": 1124.0,
      "end": 1130.0,
      "text": " Jeremiah did call out to God. If you read the entirety of the book of Jeremiah, you see how God"
    },
    {
      "id": 171,
      "start": 1130.0,
      "end": 1137.9200439453125,
      "text": " graciously and mercifully blessed Jeremiah, even though the Babylonians came in and Nebuchadnezzar"
    },
    {
      "id": 172,
      "start": 1137.9200439453125,
      "end": 1145.0400390625,
      "text": " led that campaign about taking the nation captive and destroying, and yet he says to one of his"
    },
    {
      "id": 173,
      "start": 1145.9200439453125,
      "end": 1153.9200439453125,
      "text": " captains, his men here to go and to take care of Jeremiah. Whatever he says, that's what you do."
    },
    {
      "id": 174,
      "start": 1154.47998046875,
      "end": 1163.52001953125,
      "text": " It's amazing. Our God has given us wonderful promises. We read in Hebrews 4 and verse 16"
    },
    {
      "id": 175,
      "start": 1163.52001953125,
      "end": 1167.6800537109375,
      "text": " where the Bible says that we're to come boldly under the throne of grace, but we understand that"
    },
    {
      "id": 176,
      "start": 1167.6800537109375,
      "end": 1172.8800048828125,
      "text": " that verse of Scripture gives us again a promise that's associated with it. Notice the Bible says,"
    },
    {
      "id": 177,
      "start": 1172.8800048828125,
      "end": 1180.8800048828125,
      "text": " let us therefore come boldly unto the throne of grace. Why? Notice that we may obtain mercy"
    },
    {
      "id": 178,
      "start": 1180.8800048828125,
      "end": 1189.760009765625,
      "text": " and find grace to help in time of need. Isn't that a wonderful promise? That we would obtain"
    },
    {
      "id": 179,
      "start": 1189.760009765625,
      "end": 1199.1199951171875,
      "text": " mercy and that we would find grace to help in time of need. The reality this evening is that prayer"
    },
    {
      "id": 180,
      "start": 1199.9200439453125,
      "end": 1205.5999755859375,
      "text": " is a great privilege for the people of God. We need to recognize it. Prayer, someone noted,"
    },
    {
      "id": 181,
      "start": 1206.4000244140625,
      "end": 1209.760009765625,
      "text": " should not be treated as a spare tire. What do they mean by that?"
    },
    {
      "id": 182,
      "start": 1210.9599609375,
      "end": 1215.52001953125,
      "text": " I believe this is what they mean by it. How many of you regularly check your spare tire?"
    },
    {
      "id": 183,
      "start": 1218.4000244140625,
      "end": 1223.199951171875,
      "text": " Anyone? Regularly check it. How many of you even know if you have a spare tire?"
    },
    {
      "id": 184,
      "start": 1223.9200439453125,
      "end": 1226.6400146484375,
      "text": " I mean, how many of you know that you have a spare tire?"
    },
    {
      "id": 185,
      "start": 1228.0799560546875,
      "end": 1233.43994140625,
      "text": " Okay, some of you. You know, I thought I had a spare tire and I found out I didn't."
    },
    {
      "id": 186,
      "start": 1235.8399658203125,
      "end": 1238.4000244140625,
      "text": " Mark, you know when I found out I didn't? When I got a flat tire."
    },
    {
      "id": 187,
      "start": 1240.0,
      "end": 1244.1600341796875,
      "text": " That's a bad time to find out you don't have a spare tire. I mean, it was a brand new vehicle,"
    },
    {
      "id": 188,
      "start": 1245.199951171875,
      "end": 1248.4000244140625,
      "text": " but you know what they do with some of these brand new vehicles? They don't put spare tires"
    },
    {
      "id": 189,
      "start": 1248.4000244140625,
      "end": 1254.3199462890625,
      "text": " in them. You know why? Does anyone know why? No, it has nothing to do with buying it. It's weight."
    },
    {
      "id": 190,
      "start": 1255.0400390625,
      "end": 1261.1199951171875,
      "text": " They want the weight of the vehicle to be lower. The efficiency of fuel and so on and so forth,"
    },
    {
      "id": 191,
      "start": 1261.1199951171875,
      "end": 1263.3599853515625,
      "text": " and so some of these new vehicles, they don't have spare tires in them."
    },
    {
      "id": 192,
      "start": 1264.719970703125,
      "end": 1267.9200439453125,
      "text": " And then all of a sudden, you break down with a flat tire."
    },
    {
      "id": 193,
      "start": 1269.280029296875,
      "end": 1272.800048828125,
      "text": " What do you do? You go look for the spare tire and you find out it's not there."
    },
    {
      "id": 194,
      "start": 1273.3599853515625,
      "end": 1278.56005859375,
      "text": " See, most of us, you're going to go check to see if you've got a spare tire tonight. You're going"
    },
    {
      "id": 195,
      "start": 1278.56005859375,
      "end": 1283.760009765625,
      "text": " to check this week. I understand. All right, but most of us, we don't ever think about our spare"
    },
    {
      "id": 196,
      "start": 1283.760009765625,
      "end": 1291.5999755859375,
      "text": " tire until we need it. Right? We don't think about it."
    },
    {
      "id": 197,
      "start": 1293.199951171875,
      "end": 1300.47998046875,
      "text": " Prayer shouldn't be treated that way. Prayer is not just something we have as a resource when we"
    },
    {
      "id": 198,
      "start": 1301.43994140625,
      "end": 1309.9200439453125,
      "text": " have an emergency. No, it's communing with God. It's entering into the presence of our Savior."
    },
    {
      "id": 199,
      "start": 1311.3599853515625,
      "end": 1316.3199462890625,
      "text": " It's having that sweet fellowship with Him. I preached a few Sunday nights ago,"
    },
    {
      "id": 200,
      "start": 1316.3199462890625,
      "end": 1325.1199951171875,
      "text": " pouring out our heart before Him. And this evening, I hope that we'd just be reminded tonight"
    },
    {
      "id": 201,
      "start": 1325.8399658203125,
      "end": 1329.9200439453125,
      "text": " with this thought of prayer. What a privilege it is."
    },
    {
      "id": 202,
      "start": 1332.1600341796875,
      "end": 1336.47998046875,
      "text": " Oh, that God would help us to be persistent, to persevere in prayer,"
    },
    {
      "id": 203,
      "start": 1337.280029296875,
      "end": 1340.3199462890625,
      "text": " that we would be known as men and women of prayer."
    },
    {
      "id": 204,
      "start": 1342.47998046875,
      "end": 1345.8399658203125,
      "text": " We're reminded of Elijah. James mentions this, that"
    },
    {
      "id": 205,
      "start": 1345.8399658203125,
      "end": 1349.52001953125,
      "text": " the effectual fervent prayer of a righteous man availeth much."
    },
    {
      "id": 206,
      "start": 1350.1600341796875,
      "end": 1355.8399658203125,
      "text": " And then rest in the promise. Listen, when we take it to God, we trust that God's going to work"
    },
    {
      "id": 207,
      "start": 1355.8399658203125,
      "end": 1362.56005859375,
      "text": " as only He can. And God has a plan that's better than our plan. And He doeth all things well."
    },
    {
      "id": 208,
      "start": 1362.56005859375,
      "end": 1371.8399658203125,
      "text": " And we just rest in His promise this evening. Ask, seek, knock. We see those simple thoughts"
    },
    {
      "id": 209,
      "start": 1371.8399658203125,
      "end": 1377.3599853515625,
      "text": " in Matthew 7, verses 7 through 11. We're reminded of how good our God is."
    },
    {
      "id": 210,
      "start": 1377.5999755859375,
      "end": 1384.9599609375,
      "text": " And He says to those that are gathered, if you're evil, and you know how to give good"
    },
    {
      "id": 211,
      "start": 1384.9599609375,
      "end": 1391.6800537109375,
      "text": " gifts to your children, how much more? How much more? So your heavenly Father,"
    },
    {
      "id": 212,
      "start": 1392.8800048828125,
      "end": 1400.800048828125,
      "text": " give good things unto them that ask Him. This evening, I hope that we would evaluate,"
    },
    {
      "id": 213,
      "start": 1400.800048828125,
      "end": 1407.1199951171875,
      "text": " I hope that we would evaluate, just for a moment, our prayer lives. And let God have"
    },
    {
      "id": 214,
      "start": 1407.1199951171875,
      "end": 1414.239990234375,
      "text": " His will and way. Let's have some honest and humble evaluation of our own prayer lives."
    },
    {
      "id": 215,
      "start": 1415.3599853515625,
      "end": 1420.1600341796875,
      "text": " And understand this evening that one of the greatest privileges for a child of God"
    },
    {
      "id": 216,
      "start": 1421.3599853515625,
      "end": 1427.5999755859375,
      "text": " is so often neglected by the people of God. Let's pray together. Father, we love You."
    },
    {
      "id": 217,
      "start": 1428.3199462890625,
      "end": 1430.800048828125,
      "text": " We thank You for loving us. We thank You tonight."
    },
    {
      "id": 218,
      "start": 1432.800048828125,
      "end": 1438.0799560546875,
      "text": " Just for a few moments, we've had the opportunity to look at this familiar passage. And I pray the"
    },
    {
      "id": 219,
      "start": 1438.0799560546875,
      "end": 1444.800048828125,
      "text": " Holy Spirit of God would move and work in hearts and lives as only He can. God, would You help us"
    },
    {
      "id": 220,
      "start": 1444.800048828125,
      "end": 1452.1600341796875,
      "text": " in just these short moments to have an honest evaluation of our own personal prayer lives?"
    },
    {
      "id": 221,
      "start": 1453.0400390625,
      "end": 1458.800048828125,
      "text": " Lord, I pray that You'd help us to rest in the promises that You've given to us associated with"
    },
    {
      "id": 222,
      "start": 1458.800048828125,
      "end": 1469.3599853515625,
      "text": " prayer. Help us, Lord, to resolve to be persistent in prayer, to persevere. And God, help us to"
    },
    {
      "id": 223,
      "start": 1469.3599853515625,
      "end": 1474.47998046875,
      "text": " recognize it's a privilege, it's an absolute privilege to enter into Your presence, that at"
    },
    {
      "id": 224,
      "start": 1475.43994140625,
      "end": 1484.719970703125,
      "text": " any moment, at any time, we can come boldly to Your throne. We can enter into Your presence"
    },
    {
      "id": 225,
      "start": 1485.52001953125,
      "end": 1490.239990234375,
      "text": " knowing that You hear us and knowing that You're able. I pray that You'd work in this moment of"
    },
    {
      "id": 226,
      "start": 1490.239990234375,
      "end": 1494.6400146484375,
      "text": " invitation as only You can. For it's in Christ's name we pray. Would You stand with me, heads"
    }
  ],
  "processed_at": "2025-05-12T15:38:36.719623"
}