{
  "video_id": "hFDkabxW6cU",
  "text": "if you would, and turn with me to Luke chapter 18. Luke chapter 18. I'll read the scripture in just a moment. Let me start off with just a few comments and it'll be a little bit of a different message. I'm going to preach a topical message instead of just from one passage tonight. But I want to say, and I believe what I'm about to say is true for all of us in this room and true for those who are listening by live stream, I think we could say that all of us want to have power with God. We want to have the power of God on our lives. But I've used that phrase so often and I hear it so much that sometimes it becomes a phrase that we use that we don't know exactly what is meant by it. So when I say I want to have the power of God, power with God, let me say what I mean. Just a few things. Number one, I mean that I want to have people drawn to me because they see Christ in my life and then have influence in their lives to see them trust Jesus as their Savior. When I say I want power, the power of God, I mean that I want to have the strength to say no to sin, to say no to habits, and have victory over them instead of them having victory over me. When I say I want the power of God, I mean that I want to open this word and read it and understand it and be able to communicate it and have a rich life in the word of God. When I say I want the power of God, I want to have children that grow up not only knowing the Lord, and I'd be glad if they knew the Lord, but I want them to love the Lord, and I want them to serve the Lord. Whatever God calls them to vocation in their life is fine, but I want them to serve the Lord. When I say I want power with God, I mean I want the grace of God on my life so that even in the deepest trials, my life is a testimony of deep and settled trust and joy that God knows where I am, and God knows what I need, and God will meet my need. When I say that's what I mean by the power of God, I think most believers would say, yes, that's what I want. That's what I want my life to be. Well, I'll say this, if we are ever to have that kind of power with our Lord, if we're ever going to have that kind of real revival spirit in our homes, in our churches, in our communities, it will only come when we from committed hearts have a consistent time of prayer, both private and community, with our God. The missing element in our lives today, the weakest element in our lives today, if we were absolutely transparent, is our prayer lives. We know how to go to church. We know how to give. We know how to go through the motions. We know how to do church stuff. We're very good at it. And please do not hear me denigrating, diminishing, minimizing anyone's service to the Lord. I just know a truth. I know that in each of our hearts, that deep there really beats this desire for it not just to be outward form, but for it to be vital and vibrant and real. And the only way it will happen, as I said, is if we will find our ways back to our prayer closets. Most people don't even know what that term means anymore, but to find that time of consistent, committed prayer, both meditating upon His Word and communing with Him, listening to Him, asking Him, and communicating with Him. So the purpose of my message tonight is simply this. If that's the key to power with God, and prayer is the answer, I just want to give you three simple glimpses of why you and I ought to dedicate ourselves to a consistent and committed life of prayer. Now to do that, I'm going to go to three different sets of scripture. We're going to start here in Luke chapter 18, and let's begin our reading in verse 1. And He spake a parable unto them to this end. I'll stop there just a moment. We're going to read a parable, and a parable usually expresses one great truth. Now here's the great truth that this parable expresses. He's giving it to this end, that men ought always to pray and not to faint. And now He's going to give us the illustration in the parable. The point is that men ought always to pray and not to faint. They ought to be committed to it. They ought to be consistent with it. They ought to pray. It's a command. Now notice the illustration, verse 2, saying, There was in a city a judge which feared not God, neither regarded man. And there was a widow in that city, and she came unto him, saying, Avenge me of mine adversary. And he would not for a while. But afterward he said within himself, Though I fear not God, nor regard man, yet because this widow troubleth me, I will avenge her, lest by her continual coming she weary me. Now that's the illustration of the truth, men ought always to pray and not to faint. The story tells us that this woman, who was a widow, and let's understand that a widow was perhaps one of the most helpless people in the culture in Bible times. She had no means of support unless she had children, and they were supporting her. It was a, it was a very precarious thing to be, a widow. And she had a need, she had a real need, and she understood that the only way that her need could be met was for her to appeal to this certain judge, this man of prominence. And so because she knew her need, and knew that her need could only be met this way, she went to that man. Perhaps when she first went, she had an audience with him, and he didn't respond to her, but maybe she made a second appointment, and he didn't respond to her. I don't think it's out of the question that maybe he finally told her, stop coming here, I'm not going to do anything. And maybe she stood outside of his window, and just continued to call upon him, and to call upon him, and to call upon him. And the great end of the story is, is that with fervor, and constancy, and perseverance, she finally had her need met by this man because of her perseverance. Now you say, preacher, I get that, what's so deep about that? Well let me, let me say this, did you know that no one had to coach that woman on what to ask for? She did not have to attend a seminar so that she would understand how she should ask for this thing. Nobody had to coach her on who to go to, nobody had to coach her on what days of the week, or what hours of the day. She had a need, and there was only one person, one place that that need could be met, and she went over, and over, and over again until that need was met. Did you know that no one had to coach blind Bartimaeus on what to pray for? He had a need. He knew what his need was. He was blind, and he needed to see. No one had to have a seminar for women with issues of blood. The woman that had the issue of the blood knew some things. She knew that she had gone to all the physicians, and expended all that she had trying to get this disease healed, and there were none that could heal her, and there was nothing she had else to offer. But she knew there was one man that if she could get to him, even touching the hem of his garment, no one had to tell her who to get to, or what to say, or what to do. Did you know that no one had to tell Jairus when his daughter lay dying that he needed to appeal to this one named Jesus? You say, preacher, does all of this have a point? Yes. All of these people who we saw successfully ask the Lord for something and get an answer had one great thing in common. It wasn't that they had the same issue, wasn't that they had the same background, wasn't that they had the same means. It was that they knew they had a need that no one else could answer. Now what I just said is incredibly profound. Not because I said it, but because I think therein lies the reason that the weakest part of our Christian lives is our prayer life. You know why? Our problem is we don't know how needy we are, and we don't understand that only God can give to us and supply for us what we need in our lives as believers. We don't pray as we should because we think we can get by without it. Let that sink in for just a moment. I don't mean to sound scolding or harsh, but I believe it's true. You see, praying is very hard work, and it's not work that anyone truly sees. I've learned over the years it's a whole lot easier to preach than it is to pray. Hey, I've gone to Bible college. What's that mean, preacher? It means I've learned where to find good outlines. No, it means I've learned how to outline Scripture. It means I've learned laws of hermeneutics. It means I've learned where great resources, reference resources are. It means that I've learned how homiletically to put an outline together and hermeneutically that is sound and correct. And I want to tell you, that's hard work, but I know how to do that, and I can do that. But all of my homiletics and all of my hermeneutics that are a work of my intellect are just exactly that, without the power and the Spirit of God. And here's the truth, and again I don't mean to be mean-spirited in what I say. Folks, there are thousands of pulpits in America every Sunday morning that has a man walk to that pulpit and lay his notes down and preach a sermon that may be biblically correct, but has not had one ounce of prayer asking God to take his word and apply it to the hearts of men. You know why? Because it's easier to preach than to pray, and it's more rewarding in the short term to preach than to pray. Did you know it's easier to go visiting than to pray that God will lead you to a soul? I'm just saying to you that prayer is hard work, and yet how can we expect to have God's power if He sees in our lives what we know to be true in our lives, that our work for Him is religious work? It's work that we put together. It's work that our intellect created. I'm not saying that there's not a part for our talent, our gift, our intellect, but my friend, no revival will come through anything that Mike Edwards does without the imprint and the power of God on it. I don't understand how Sunday school teachers teach Sunday school lessons without prayer. I don't understand how junior church workers, well they're just kids, yeah they're just kids with an immortal soul. They're just kids that need the gospel, and they need the entrance of the gospel into our heart, and we take it so lightly, we are so flippant about it, we think that a flannel graph and a story that we present is what's necessary and what is vital for eternity, and I'm just simply saying to you that our work can accomplish some things, but it can never accomplish what God's power on that presentation can accomplish, and yet millions of Sunday school classes are taught without a moment's prayer. Many junior churches are preached, business meetings, out in the secular world, job interviews, family time, family things. I'm just telling you that on and on and on we have come to the place where we think we can do it on our own, where we think that what we bring to it is enough. Hey, we want revival, we want to have revival, and we schedule a meeting, and we preach the sermons, and we put out the brochures, but revival has never come from a pulpit. Revival has never come from a preacher where first there was not prayer, bathing, preparing, begging God to work. And by our lifestyle, by how we operate in our lives, do you know the message we send to God? I've got this. I've got this. Well, of course we pray. We pray gratefully over our food, and I'm glad of that. Hey, we love our children, and we pray for our children, and we pray for family and parents, but I'm telling you, it is so much bigger than the three-foot circle that surrounds us. There is a world that needs believers to find the time and the discipline of life to beg God to do what none of us can do without Him. And we say we want that, but the manner in which we live says, I've got this. I'll come to you when I really need you. And unlike this little woman, we don't understand that we are just as desperate, just as destitute, just as unable by ourselves to accomplish spiritually what we need to accomplish without pleading and knowing and walking with God and having His power. Men are always to pray. Turn with me to James chapter 5 and verse 16. James chapter 5 and verse 16. Very familiar passage. There the scripture says this, confess your faults one to another and pray one for another that you may be healed. Here's the phrase I want to concentrate on, the effectual fervent prayer of a righteous man availeth much. I don't suppose there's any more motivating verse in my mind in the Word of God for right living in prayer than that phrase in that verse right there. That if I will pray and my life is in a place where it is walking with the Lord that I can pray fervently and my prayer can impact what I pray about. Is that what God is saying? I want to say it again, I didn't say it well. I can pray and because God is working through my prayer, I can impact what needs to be changed or impacted. That's what the Bible says. That is a promise of God that says, hey, you see a hurt? Did you know that if you can pray about that hurt, I can work in that hurt? Hey, you see something that you're fearful about in someone's life? Hey, pray about that and I can impact that. Hey, you have a need? Hey, you have a fear? Hey, you have a hurt in your heart? Pray! Pray! Pray! I can work in that, but it's hard work to pray, and it takes time to pray. There's a word called intercession, and the truth is we rejoice in the fact that Jesus stands in the presence of the Father as our advocate, and when the accuser of the brethren, Satan, comes before the Lord, and by the way, in our lives there is plenty to accuse, wouldn't you say? we rejoice in the fact that our Advocate, Jesus, stands up for us and intercedes for us, and pleads the blood for us, and God sees the blood of His Son in us, forgives us, restores us. Hey, I am glad that in me, you don't see it, I don't see it in you, I see the effect, we have the Holy Spirit within us, and I rejoice in the fact that the Holy Spirit intercedes for me, that He pleads to God with me in groanings that I can't utter, can't understand, but He pleads for me, thank God He intercedes for me. But we never catch the view that as Christ and as the Holy Spirit intercede for us, we ought to be an Advocate and intercede for others. Let me walk through the scripture just a moment, don't turn to these for the sake of time. I love in Numbers chapter 11 verse 1, just listen as I read, it's about Moses. It says, And when the people complained, it displeased the Lord. And the Lord heard it, and His anger was kindled, and the fire of the Lord burnt among them, and consumed them that were in the uttermost parts of the camp. And the people cried unto Moses. And when Moses prayed unto the Lord, the fire was quenched. Well, we're not Moses. Hey, Moses was created out of the same dust that you and I are created. Stop letting ourselves off because our name doesn't appear in the Bible. Moses was a meek man, Moses was a flawed man, Moses was a man that God had to put on the backside of the desert for 40 years to teach him this, but Moses got it and became a man who walked with God, who was able to offer an effectual, fervent prayer, and he interceded for his people, and the fire stopped. Every pastor ought to have a burning in his soul to be able to pray for the fire to stop in the families that he pastors, in the lives of those teens that he pastors, in the attacks upon the church. He ought to be an intercessor. It ought to be a vital part of every ministry. Yet, we don't have time for it. Every parent ought to be an intercessor, ought to be praying for that fire to stop, for that to stop before it gets to that child, before it gets to that home. Every parent ought to have time because he needs to intercede for his children, for his home, and he ought to understand that no matter how loudly he cheers on the soccer sideline, or how cool a dad he is when he does this or that, or how many activities they have, the devil doesn't care about that! He is after your home! And I don't care how many activities you schedule, and how sweet you are, and how many gifts you buy, only the effectual, fervent prayer and God's intervention will stop that work. Hey folks, we need to wake up. Hey God, how do I got three kids? I got this, going to the soccer game. Hey God, I got this! We got a program at church that'll take care of that. God looks at us and says, well, we'll see if you got it. I read about Elijah, 1 Kings chapter 18, Lord God of Abraham, he begins to pray, and of Israel, let it be known this day that thou art God in Israel, and that I am thy servant, and that I have done all these things at thy word. And when he prayed that brief prayer, you know what happened? Fire fell. And you know what the purpose of that fire falling was? So that Israel would know who the real God was. For hours and hours, the prophets of Baal had danced around that sacrifice, cut themselves, and plead for their God to throw fire. Baal is not real. He couldn't throw fire down. But in that prayer, Elijah showed the world who was God. I don't want to be true dramatic in this, but I want to be able to demonstrate to this world who God is. Our churches ought to be places where people find God. Our living rooms ought to be places where people find God. When somebody fellowships with us, they ought to be able to find God, because we make God known through the way we live and through what we are. I got it, God. We've got a visitation program. That'll work. And it will work. I'm glad for it. But I'm telling you, all the distribution, letterboxing, all the programs and all the seminars, without the power of God to make Himself known, we work so hard at all the stuff, and we forget the most vital aspect, God's power. I think of Hezekiah. Hezekiah received the letter of the hand of the messengers and read it. Hezekiah went up into the house of the Lord, spread it before the Lord, and Hezekiah prayed before the Lord and said, O Lord God of Israel. And he went on and read that letter of how they were going to destroy the city. And God's answer came just a few verses later. God answers and says, Therefore, thus saith the Lord concerning the king of Assyria, he shall not come into this city, nor shoot an arrow there, nor come before it with shield, nor cast a bank against it. Would to God we could stop Satan in his tracks. Every father and mother needs the power to pray Satan away from the walls of their home and the hearts of their children. I don't want to over dramatize this, but I'm 70 years old, and I'm telling you, I ain't never seen it like this. There's always been sin, but it has never been so obvious. And our teenagers, our children, I'm not saying they can't succeed. They can. They can have marvelous testimonies, but it's not by saying, I got this. Taking them to Disney, that'll do it. Hey, I'm not against that, but if you think being a cool dad, being a cool mom will stop Satan from their hearts, you're wrong. And you and I need to be intercessors. Well, I pray for my children. Well, how long do you pray? What do you pray for? How often do you pray? You pray when the test? You pray when the crisis? Or is it a part of your life where every day, significant time in intercessory prayer for each and every one of your children, for your spouse, for your extended family, for your church? Are you an intercessor? And I'm saying to you, we read the effectual, fervent prayer of a righteous man availeth much, and never put it into practice. We're glad it's there. We hope the preacher's doing it, but we never put it into practice. It takes time. You see, power with God is not microwavable. Power with God isn't something we shake up and pour out and cook. Power with God is commitment of time, commitment of energy, not just physical, mental energy. And saying, I'm going to do this. Power with God requires not only the discipline of time, but the discipline of thought. We've got to write things down. We've got to know what we're praying for. We've got to know when we prayed for it last, and when we're going to pray for it again. We've got to be specific about it. It takes time, but if we can't put it in a microwave, I gotta work, oh we gotta... this activity oh we got I got a God I'll get with I'll catch up with you and we think we can do it by ourselves one last scripture would you look with me at Matthew 26 Matthew 26 and verse 36 I'll be quick Matthew 26 and verse 36 and we begin reading we're going to read about 10 verses then cometh Jesus with them unto a place called Gethsemane and sayeth unto the disciples sit ye here while I go and pray yonder and he took with him Peter and the two sons of Zebedee and began to be sorrowful and very heavy then saith he unto them my soul is exciting sorrowful even unto death tarry ye here and watch with me pray with me others passages will reveal and he went a little further and fell on his face and prayed saying oh my father if it be possible let this cup pass from me nevertheless not as I will but as thou wilt and he cometh unto his disciples and findeth them asleep and saith unto Peter what could could could you not watch with me one hour watch and pray that you enter not into temptation the spirit indeed is willing but the flesh is weak he went away again the second time and prayed saying oh my father if this cup may not pass away from me except I drink it thy will be done and he came and found them asleep again for their eyes were heavy and he left them and went again and prayed the third time saying the same words I just give me a moment and I'll be done Jesus brought his inner disciple his inner circle those that he felt he was closest to those he felt that would truly understand and and they come to the garden of Gethsemane and understand what night this is this is the night of his passion he is only hours away from arrest hours away from the cross and as they come to this place his soul is heavy and he looks to his disciples and he says I want you to watch with me in other words be aware with me and pray with me and and I'm gonna go over here and pray but I want you to pray here and they looked at him and they could tell that it was heavy he was sorrowing he was really deeply distressed over what he was talking about he went over and we know the story prayed and he prayed and he prayed he looked into the cup of our sin and and knew that he had to drink that cup if we were ever to be made one again with God and and to be honest with you it was a decision point is he going to go to the cross or is he going to say no it's it's too heavy I don't want to carry it and he comes back to his disciples and he finds them asleep and he says to them and I'm going to put some words in his mouth what you saw how heavy this was you saw how in distress I was you saw me fall down you may have even heard the cry of my heart and and what you're asleep could you could you not give me an hour the greatest spiritual battle the world has ever known is going on 20 feet from those disciples and in that proximity of the greatest spiritual battle the world has ever known the disciples slept I think there's a lesson there for us we have come to this place in our nation in our culture in our world folks I don't know I don't know that it's ever been more serious certainly sin is abounding and hearts are getting colder certainly the need is greater and and we think that this is the time to say I got it I'll pray when I need to you know what I'm fearing I'm fearing that a great spiritual battle is right outside our office door and we don't have time to pray I'm afraid that a great spiritual battle or maybe a great spiritual opportunity is afoot in this community but we don't have time to pray I fear that that there are teenagers who are moments from an onslaught from the devil and his hordes and there's dads who don't have time to pray and moms who think it's time to take a nap and I think the Lord looks at us and says in our vernacular dude don't you get it it's time to pray the spiritual battle of your life surrounds you and you can't find time to plead with God to work through you to work in the hearts of those you love hey I'd say it's time that Christians have to stop messing with it and have to say if there's gonna be revival in my heart if there's gonna be revival in my marriage if there's gonna be revival in my home in my church in my community I've got to stop saying I've got this I've got to stop thinking that our program is all we need I've got to stop thinking that my intellect my activity my gift that's all we need now and I'll ask God to bless it but folks I'm telling you the missing ingredient is not a better program it's not better music it's not new carpet or a bigger building it's prayer and begging God to do what we cannot do but he could do through us men ought always to pray and not quit because the effectual fervent prayer of a righteous man availeth much and the greatest spiritual battle that our world our lives have ever seen or known is raging around us can't you pray can't you watch with me can't you be serious about this can't you intercede can't you can't you call upon me to work I'm simply saying it is time for us to pray say preacher what do you mean I mean dedicated committed disciplined prayer times of praise times of thanksgiving times of confession of sin interceding for others making petition for ourselves praising again and and coming with decision from it it is time to pray and this I finish if revival is a set of meetings and it's done on Wednesday night revivals not coming but when a believer will say I'm going to watch and pray with him and I'm going to plead with my God to work through my life and they become disciplined and committed to pray then revival would you pray with me father we thank you tonight for your blessing and for your help or I pray that you would create a first hunger we've become so accustomed to doing church how we do church that we think the powers and how we do church We've become so accustomed to think that it's what we do that makes a difference, and it really never is. But at our fingertips is the greatest power the universe knows, the power of God. And Satan really can be stopped. People really can be helped. Families really can succeed. Teens really can honor you. All of these things can be true. And it's not happenstance. It's not accident. But when we don't sense the need, when we think what we do is enough, Lord, we will never ever know what you can do. And so I pray tonight that you would speak to the hearts of your people and plant in their hearts a desire, a thirst, to have your power. Your power. Power to influence others for the gospel. Power to have victory in their own hearts over sin. Power to see their children honor, love, and serve you. Power, God, to read your Word and be able to communicate it. Power in the midst of the most difficult times to be a testimony of joy. Lord, please put in our hearts that desire. Wherever you are tonight, whether in this room or listening to us by live stream, I pray that you understand that you're not enough. I'm not enough. But with God, we can see great things that honor Him accomplished through our lives. But it takes commitment. And my prayer for you is at this moment, you will allow God and you will make the commitment to God, God teach me to pray. Help me to be disciplined. Start disciplining your prayer life. I'm sure a pastor could help you with perhaps helps to get that done. But make the commitment tonight. Prayer will become real and vital in my life. Let's stand together, our heads about, our eyes are closed.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 11.600000381469727,
      "text": " if you would, and turn with me to Luke chapter 18. Luke chapter 18. I'll read the"
    },
    {
      "id": 1,
      "start": 11.600000381469727,
      "end": 17.360000610351562,
      "text": " scripture in just a moment. Let me start off with just a few comments and it'll"
    },
    {
      "id": 2,
      "start": 17.360000610351562,
      "end": 21.040000915527344,
      "text": " be a little bit of a different message. I'm going to preach a topical message"
    },
    {
      "id": 3,
      "start": 21.040000915527344,
      "end": 26.68000030517578,
      "text": " instead of just from one passage tonight. But I want to say, and I believe what I'm"
    },
    {
      "id": 4,
      "start": 26.68000030517578,
      "end": 31.959999084472656,
      "text": " about to say is true for all of us in this room and true for those who are"
    },
    {
      "id": 5,
      "start": 31.959999084472656,
      "end": 38.040000915527344,
      "text": " listening by live stream, I think we could say that all of us want to have"
    },
    {
      "id": 6,
      "start": 38.040000915527344,
      "end": 47.36000061035156,
      "text": " power with God. We want to have the power of God on our lives. But I've used that"
    },
    {
      "id": 7,
      "start": 47.36000061035156,
      "end": 53.31999969482422,
      "text": " phrase so often and I hear it so much that sometimes it becomes a phrase"
    },
    {
      "id": 8,
      "start": 53.31999969482422,
      "end": 60.439998626708984,
      "text": " that we use that we don't know exactly what is meant by it. So when I say I"
    },
    {
      "id": 9,
      "start": 60.439998626708984,
      "end": 66.4000015258789,
      "text": " want to have the power of God, power with God, let me say what I mean. Just a few"
    },
    {
      "id": 10,
      "start": 66.4000015258789,
      "end": 74.55999755859375,
      "text": " things. Number one, I mean that I want to have people drawn to me because they see"
    },
    {
      "id": 11,
      "start": 74.55999755859375,
      "end": 81.72000122070312,
      "text": " Christ in my life and then have influence in their lives to see them"
    },
    {
      "id": 12,
      "start": 81.72000122070312,
      "end": 90.63999938964844,
      "text": " trust Jesus as their Savior. When I say I want power, the power of God, I mean"
    },
    {
      "id": 13,
      "start": 90.63999938964844,
      "end": 99.19999694824219,
      "text": " that I want to have the strength to say no to sin, to say no to habits, and have"
    },
    {
      "id": 14,
      "start": 99.19999694824219,
      "end": 107.76000213623047,
      "text": " victory over them instead of them having victory over me. When I say I want the"
    },
    {
      "id": 15,
      "start": 107.76000213623047,
      "end": 115.08000183105469,
      "text": " power of God, I mean that I want to open this word and read it and understand it"
    },
    {
      "id": 16,
      "start": 115.08000183105469,
      "end": 123.0,
      "text": " and be able to communicate it and have a rich life in the word of God. When I say"
    },
    {
      "id": 17,
      "start": 123.0,
      "end": 129.63999938964844,
      "text": " I want the power of God, I want to have children that grow up not only knowing"
    },
    {
      "id": 18,
      "start": 129.63999938964844,
      "end": 135.55999755859375,
      "text": " the Lord, and I'd be glad if they knew the Lord, but I want them to love the"
    },
    {
      "id": 19,
      "start": 135.55999755859375,
      "end": 141.63999938964844,
      "text": " Lord, and I want them to serve the Lord. Whatever God calls them to vocation in"
    },
    {
      "id": 20,
      "start": 141.63999938964844,
      "end": 148.16000366210938,
      "text": " their life is fine, but I want them to serve the Lord. When I say I want power"
    },
    {
      "id": 21,
      "start": 148.16000366210938,
      "end": 156.52000427246094,
      "text": " with God, I mean I want the grace of God on my life so that even in the deepest"
    },
    {
      "id": 22,
      "start": 156.52000427246094,
      "end": 165.75999450683594,
      "text": " trials, my life is a testimony of deep and settled trust and joy that God"
    },
    {
      "id": 23,
      "start": 165.75999450683594,
      "end": 173.55999755859375,
      "text": " knows where I am, and God knows what I need, and God will meet my need. When I"
    },
    {
      "id": 24,
      "start": 173.55999755859375,
      "end": 179.1999969482422,
      "text": " say that's what I mean by the power of God, I think most believers would say,"
    },
    {
      "id": 25,
      "start": 179.1999969482422,
      "end": 187.16000366210938,
      "text": " yes, that's what I want. That's what I want my life to be. Well, I'll say this, if"
    },
    {
      "id": 26,
      "start": 187.16000366210938,
      "end": 194.8000030517578,
      "text": " we are ever to have that kind of power with our Lord, if we're ever going to"
    },
    {
      "id": 27,
      "start": 194.8000030517578,
      "end": 200.63999938964844,
      "text": " have that kind of real revival spirit in our homes, in our churches, in our"
    },
    {
      "id": 28,
      "start": 200.63999938964844,
      "end": 210.63999938964844,
      "text": " communities, it will only come when we from committed hearts have a consistent"
    },
    {
      "id": 29,
      "start": 210.63999938964844,
      "end": 221.47999572753906,
      "text": " time of prayer, both private and community, with our God. The missing"
    },
    {
      "id": 30,
      "start": 221.47999572753906,
      "end": 228.83999633789062,
      "text": " element in our lives today, the weakest element in our lives today, if we were"
    },
    {
      "id": 31,
      "start": 228.83999633789062,
      "end": 236.24000549316406,
      "text": " absolutely transparent, is our prayer lives. We know how to go to church. We"
    },
    {
      "id": 32,
      "start": 236.24000549316406,
      "end": 239.9600067138672,
      "text": " know how to give. We know how to go through the motions. We know how to do"
    },
    {
      "id": 33,
      "start": 239.9600067138672,
      "end": 247.16000366210938,
      "text": " church stuff. We're very good at it. And please do not hear me denigrating,"
    },
    {
      "id": 34,
      "start": 247.16000366210938,
      "end": 252.83999633789062,
      "text": " diminishing, minimizing anyone's service to the Lord. I just know a truth. I know"
    },
    {
      "id": 35,
      "start": 253.32000732421875,
      "end": 259.8399963378906,
      "text": " that in each of our hearts, that deep there really beats this desire for it"
    },
    {
      "id": 36,
      "start": 259.8399963378906,
      "end": 268.32000732421875,
      "text": " not just to be outward form, but for it to be vital and vibrant and real. And the"
    },
    {
      "id": 37,
      "start": 268.32000732421875,
      "end": 275.70001220703125,
      "text": " only way it will happen, as I said, is if we will find our ways back to our prayer"
    },
    {
      "id": 38,
      "start": 275.70001220703125,
      "end": 281.0,
      "text": " closets. Most people don't even know what that term means anymore, but to"
    },
    {
      "id": 39,
      "start": 281.0,
      "end": 288.9599914550781,
      "text": " find that time of consistent, committed prayer, both meditating upon His Word and"
    },
    {
      "id": 40,
      "start": 288.9599914550781,
      "end": 296.9599914550781,
      "text": " communing with Him, listening to Him, asking Him, and communicating with Him. So"
    },
    {
      "id": 41,
      "start": 296.9599914550781,
      "end": 303.239990234375,
      "text": " the purpose of my message tonight is simply this. If that's the key to power"
    },
    {
      "id": 42,
      "start": 303.239990234375,
      "end": 309.67999267578125,
      "text": " with God, and prayer is the answer, I just want to give you three simple glimpses"
    },
    {
      "id": 43,
      "start": 309.67999267578125,
      "end": 317.67999267578125,
      "text": " of why you and I ought to dedicate ourselves to a consistent and committed"
    },
    {
      "id": 44,
      "start": 317.67999267578125,
      "end": 322.8800048828125,
      "text": " life of prayer. Now to do that, I'm going to go to three different sets of"
    },
    {
      "id": 45,
      "start": 322.8800048828125,
      "end": 327.2799987792969,
      "text": " scripture. We're going to start here in Luke chapter 18, and let's begin our"
    },
    {
      "id": 46,
      "start": 327.2799987792969,
      "end": 337.239990234375,
      "text": " reading in verse 1. And He spake a parable unto them to this end. I'll stop"
    },
    {
      "id": 47,
      "start": 337.239990234375,
      "end": 343.4800109863281,
      "text": " there just a moment. We're going to read a parable, and a parable usually"
    },
    {
      "id": 48,
      "start": 343.4800109863281,
      "end": 350.4800109863281,
      "text": " expresses one great truth. Now here's the great truth that this parable"
    },
    {
      "id": 49,
      "start": 350.4800109863281,
      "end": 358.760009765625,
      "text": " expresses. He's giving it to this end, that men ought always to pray and not to"
    },
    {
      "id": 50,
      "start": 358.760009765625,
      "end": 363.6400146484375,
      "text": " faint. And now He's going to give us the illustration in the parable. The point is"
    },
    {
      "id": 51,
      "start": 363.79998779296875,
      "end": 369.67999267578125,
      "text": " that men ought always to pray and not to faint. They ought to be committed to it."
    },
    {
      "id": 52,
      "start": 369.67999267578125,
      "end": 375.2799987792969,
      "text": " They ought to be consistent with it. They ought to pray. It's a command. Now notice"
    },
    {
      "id": 53,
      "start": 375.2799987792969,
      "end": 382.0400085449219,
      "text": " the illustration, verse 2, saying, There was in a city a judge which feared not"
    },
    {
      "id": 54,
      "start": 382.0400085449219,
      "end": 388.7200012207031,
      "text": " God, neither regarded man. And there was a widow in that city, and she came unto"
    },
    {
      "id": 55,
      "start": 388.7200012207031,
      "end": 395.79998779296875,
      "text": " him, saying, Avenge me of mine adversary. And he would not for a while. But"
    },
    {
      "id": 56,
      "start": 395.79998779296875,
      "end": 402.8800048828125,
      "text": " afterward he said within himself, Though I fear not God, nor regard man, yet"
    },
    {
      "id": 57,
      "start": 402.8800048828125,
      "end": 410.3599853515625,
      "text": " because this widow troubleth me, I will avenge her, lest by her continual coming"
    },
    {
      "id": 58,
      "start": 410.3599853515625,
      "end": 418.44000244140625,
      "text": " she weary me. Now that's the illustration of the truth, men ought always to pray"
    },
    {
      "id": 59,
      "start": 418.55999755859375,
      "end": 427.2799987792969,
      "text": " and not to faint. The story tells us that this woman, who was a widow, and let's"
    },
    {
      "id": 60,
      "start": 427.2799987792969,
      "end": 433.0799865722656,
      "text": " understand that a widow was perhaps one of the most helpless people in the"
    },
    {
      "id": 61,
      "start": 433.0799865722656,
      "end": 439.32000732421875,
      "text": " culture in Bible times. She had no means of support unless she had children, and"
    },
    {
      "id": 62,
      "start": 439.32000732421875,
      "end": 444.9599914550781,
      "text": " they were supporting her. It was a, it was a very precarious thing to be, a widow."
    },
    {
      "id": 63,
      "start": 444.9599914550781,
      "end": 452.0400085449219,
      "text": " And she had a need, she had a real need, and she understood that the only way"
    },
    {
      "id": 64,
      "start": 452.0400085449219,
      "end": 459.3599853515625,
      "text": " that her need could be met was for her to appeal to this certain judge, this"
    },
    {
      "id": 65,
      "start": 459.3599853515625,
      "end": 466.239990234375,
      "text": " man of prominence. And so because she knew her need, and knew that her"
    },
    {
      "id": 66,
      "start": 466.239990234375,
      "end": 472.67999267578125,
      "text": " need could only be met this way, she went to that man. Perhaps when she first went,"
    },
    {
      "id": 67,
      "start": 472.760009765625,
      "end": 477.1600036621094,
      "text": " she had an audience with him, and he didn't respond to her, but maybe she made"
    },
    {
      "id": 68,
      "start": 477.1600036621094,
      "end": 480.8399963378906,
      "text": " a second appointment, and he didn't respond to her. I don't think it's out of"
    },
    {
      "id": 69,
      "start": 480.8399963378906,
      "end": 485.44000244140625,
      "text": " the question that maybe he finally told her, stop coming here, I'm not going to do"
    },
    {
      "id": 70,
      "start": 485.44000244140625,
      "end": 490.7200012207031,
      "text": " anything. And maybe she stood outside of his window, and just continued to call"
    },
    {
      "id": 71,
      "start": 490.7200012207031,
      "end": 496.79998779296875,
      "text": " upon him, and to call upon him, and to call upon him. And the great end of the"
    },
    {
      "id": 72,
      "start": 496.79998779296875,
      "end": 503.3999938964844,
      "text": " story is, is that with fervor, and constancy, and perseverance, she finally"
    },
    {
      "id": 73,
      "start": 503.3999938964844,
      "end": 513.5599975585938,
      "text": " had her need met by this man because of her perseverance. Now you say, preacher, I"
    },
    {
      "id": 74,
      "start": 513.5599975585938,
      "end": 520.4400024414062,
      "text": " get that, what's so deep about that? Well let me, let me say this, did you know that"
    },
    {
      "id": 75,
      "start": 520.4400024414062,
      "end": 528.3200073242188,
      "text": " no one had to coach that woman on what to ask for? She did not have to attend a"
    },
    {
      "id": 76,
      "start": 528.3200073242188,
      "end": 534.47998046875,
      "text": " seminar so that she would understand how she should ask for this thing. Nobody had"
    },
    {
      "id": 77,
      "start": 534.47998046875,
      "end": 540.2000122070312,
      "text": " to coach her on who to go to, nobody had to coach her on what days of the week, or"
    },
    {
      "id": 78,
      "start": 540.2000122070312,
      "end": 548.0399780273438,
      "text": " what hours of the day. She had a need, and there was only one person, one place that"
    },
    {
      "id": 79,
      "start": 548.239990234375,
      "end": 555.9199829101562,
      "text": " that need could be met, and she went over, and over, and over again until that need"
    },
    {
      "id": 80,
      "start": 555.9199829101562,
      "end": 562.5999755859375,
      "text": " was met. Did you know that no one had to coach blind Bartimaeus on what to pray"
    },
    {
      "id": 81,
      "start": 562.5999755859375,
      "end": 572.0399780273438,
      "text": " for? He had a need. He knew what his need was. He was blind, and he needed to see. No"
    },
    {
      "id": 82,
      "start": 572.0399780273438,
      "end": 577.760009765625,
      "text": " one had to have a seminar for women with issues of blood. The woman that had the"
    },
    {
      "id": 83,
      "start": 577.760009765625,
      "end": 581.6799926757812,
      "text": " issue of the blood knew some things. She knew that she had gone to all the"
    },
    {
      "id": 84,
      "start": 581.6799926757812,
      "end": 587.2000122070312,
      "text": " physicians, and expended all that she had trying to get this disease healed, and"
    },
    {
      "id": 85,
      "start": 587.2000122070312,
      "end": 591.6799926757812,
      "text": " there were none that could heal her, and there was nothing she had else to offer."
    },
    {
      "id": 86,
      "start": 591.6799926757812,
      "end": 597.8800048828125,
      "text": " But she knew there was one man that if she could get to him, even touching the"
    },
    {
      "id": 87,
      "start": 597.8800048828125,
      "end": 601.7999877929688,
      "text": " hem of his garment, no one"
    },
    {
      "id": 0,
      "start": 601.7999877929688,
      "end": 607.9999876022339,
      "text": " had to tell her who to get to, or what to say, or what to do. Did you know that no"
    },
    {
      "id": 1,
      "start": 607.9999876022339,
      "end": 614.5199880599976,
      "text": " one had to tell Jairus when his daughter lay dying that he needed to appeal to"
    },
    {
      "id": 2,
      "start": 614.5199880599976,
      "end": 622.7999877929688,
      "text": " this one named Jesus? You say, preacher, does all of this have a point? Yes. All of"
    },
    {
      "id": 3,
      "start": 622.7999877929688,
      "end": 629.9199886322021,
      "text": " these people who we saw successfully ask the Lord for something and get an answer"
    },
    {
      "id": 4,
      "start": 629.9199886322021,
      "end": 636.1999893188477,
      "text": " had one great thing in common. It wasn't that they had the same issue, wasn't that"
    },
    {
      "id": 5,
      "start": 636.1999893188477,
      "end": 641.1999893188477,
      "text": " they had the same background, wasn't that they had the same means. It was that they"
    },
    {
      "id": 6,
      "start": 641.1999893188477,
      "end": 650.9199867248535,
      "text": " knew they had a need that no one else could answer. Now what I just said is"
    },
    {
      "id": 7,
      "start": 650.9199867248535,
      "end": 659.0399894714355,
      "text": " incredibly profound. Not because I said it, but because I think therein lies the"
    },
    {
      "id": 8,
      "start": 659.0399894714355,
      "end": 665.4399871826172,
      "text": " reason that the weakest part of our Christian lives is our prayer life. You"
    },
    {
      "id": 9,
      "start": 665.4399871826172,
      "end": 673.9199905395508,
      "text": " know why? Our problem is we don't know how needy we are, and we don't understand"
    },
    {
      "id": 10,
      "start": 673.9199905395508,
      "end": 681.619987487793,
      "text": " that only God can give to us and supply for us what we need in our lives as"
    },
    {
      "id": 11,
      "start": 681.619987487793,
      "end": 692.4199905395508,
      "text": " believers. We don't pray as we should because we think we can get by without"
    },
    {
      "id": 12,
      "start": 692.4199905395508,
      "end": 700.2199859619141,
      "text": " it. Let that sink in for just a moment. I don't mean to sound scolding or harsh,"
    },
    {
      "id": 13,
      "start": 700.2199859619141,
      "end": 708.5399856567383,
      "text": " but I believe it's true. You see, praying is very hard work, and it's not work that"
    },
    {
      "id": 14,
      "start": 708.5399856567383,
      "end": 713.6999893188477,
      "text": " anyone truly sees. I've learned over the years it's a whole lot easier to preach"
    },
    {
      "id": 15,
      "start": 713.6999893188477,
      "end": 720.1799850463867,
      "text": " than it is to pray. Hey, I've gone to Bible college. What's that mean, preacher? It"
    },
    {
      "id": 16,
      "start": 720.1799850463867,
      "end": 726.1399841308594,
      "text": " means I've learned where to find good outlines. No, it means I've learned how"
    },
    {
      "id": 17,
      "start": 726.1399841308594,
      "end": 730.739990234375,
      "text": " to outline Scripture. It means I've learned laws of hermeneutics. It means"
    },
    {
      "id": 18,
      "start": 730.739990234375,
      "end": 735.9399871826172,
      "text": " I've learned where great resources, reference resources are. It means that"
    },
    {
      "id": 19,
      "start": 735.9399871826172,
      "end": 741.0999908447266,
      "text": " I've learned how homiletically to put an outline together and hermeneutically"
    },
    {
      "id": 20,
      "start": 741.0999908447266,
      "end": 747.0199890136719,
      "text": " that is sound and correct. And I want to tell you, that's hard work, but I know how"
    },
    {
      "id": 21,
      "start": 747.0199890136719,
      "end": 755.4999847412109,
      "text": " to do that, and I can do that. But all of my homiletics and all of my hermeneutics"
    },
    {
      "id": 22,
      "start": 755.4999847412109,
      "end": 764.97998046875,
      "text": " that are a work of my intellect are just exactly that, without the power and the"
    },
    {
      "id": 23,
      "start": 764.97998046875,
      "end": 772.1399841308594,
      "text": " Spirit of God. And here's the truth, and again I don't mean to be mean-spirited"
    },
    {
      "id": 24,
      "start": 772.1399841308594,
      "end": 778.6999816894531,
      "text": " in what I say. Folks, there are thousands of pulpits in America every Sunday"
    },
    {
      "id": 25,
      "start": 778.6999816894531,
      "end": 785.4199829101562,
      "text": " morning that has a man walk to that pulpit and lay his notes down and preach"
    },
    {
      "id": 26,
      "start": 785.4199829101562,
      "end": 794.6999816894531,
      "text": " a sermon that may be biblically correct, but has not had one ounce of prayer"
    },
    {
      "id": 27,
      "start": 794.6999816894531,
      "end": 801.4999847412109,
      "text": " asking God to take his word and apply it to the hearts of men. You know why?"
    },
    {
      "id": 28,
      "start": 801.4999847412109,
      "end": 807.97998046875,
      "text": " Because it's easier to preach than to pray, and it's more rewarding in the"
    },
    {
      "id": 29,
      "start": 807.97998046875,
      "end": 814.8599853515625,
      "text": " short term to preach than to pray. Did you know it's easier to go visiting than"
    },
    {
      "id": 30,
      "start": 814.8599853515625,
      "end": 823.1399841308594,
      "text": " to pray that God will lead you to a soul? I'm just saying to you that prayer"
    },
    {
      "id": 31,
      "start": 823.1399841308594,
      "end": 831.1399841308594,
      "text": " is hard work, and yet how can we expect to have God's power if He sees in our"
    },
    {
      "id": 32,
      "start": 831.1399841308594,
      "end": 838.7799835205078,
      "text": " lives what we know to be true in our lives, that our work for Him is religious"
    },
    {
      "id": 33,
      "start": 838.8199920654297,
      "end": 846.1399841308594,
      "text": " work? It's work that we put together. It's work that our intellect created. I'm not"
    },
    {
      "id": 34,
      "start": 846.1399841308594,
      "end": 851.1399841308594,
      "text": " saying that there's not a part for our talent, our gift, our intellect, but my"
    },
    {
      "id": 35,
      "start": 851.1399841308594,
      "end": 858.6199951171875,
      "text": " friend, no revival will come through anything that Mike Edwards does without"
    },
    {
      "id": 36,
      "start": 858.6199951171875,
      "end": 866.5799865722656,
      "text": " the imprint and the power of God on it. I don't understand how Sunday school"
    },
    {
      "id": 37,
      "start": 866.6199951171875,
      "end": 872.2999877929688,
      "text": " teachers teach Sunday school lessons without prayer. I don't understand how"
    },
    {
      "id": 38,
      "start": 872.2999877929688,
      "end": 877.0199890136719,
      "text": " junior church workers, well they're just kids, yeah they're just kids with an"
    },
    {
      "id": 39,
      "start": 877.0199890136719,
      "end": 883.2200012207031,
      "text": " immortal soul. They're just kids that need the gospel, and they need the"
    },
    {
      "id": 40,
      "start": 883.2200012207031,
      "end": 887.8599853515625,
      "text": " entrance of the gospel into our heart, and we take it so lightly, we are so"
    },
    {
      "id": 41,
      "start": 887.8599853515625,
      "end": 892.9400024414062,
      "text": " flippant about it, we think that a flannel graph and a story that we"
    },
    {
      "id": 42,
      "start": 892.9400024414062,
      "end": 897.8999938964844,
      "text": " present is what's necessary and what is vital for eternity, and I'm just simply"
    },
    {
      "id": 43,
      "start": 897.8999938964844,
      "end": 903.1799926757812,
      "text": " saying to you that our work can accomplish some things, but it can never"
    },
    {
      "id": 44,
      "start": 903.1799926757812,
      "end": 910.2599792480469,
      "text": " accomplish what God's power on that presentation can accomplish, and yet"
    },
    {
      "id": 45,
      "start": 910.2599792480469,
      "end": 916.5399780273438,
      "text": " millions of Sunday school classes are taught without a moment's prayer. Many"
    },
    {
      "id": 46,
      "start": 916.5399780273438,
      "end": 923.4199829101562,
      "text": " junior churches are preached, business meetings, out in the secular world, job"
    },
    {
      "id": 47,
      "start": 923.4199829101562,
      "end": 931.0999755859375,
      "text": " interviews, family time, family things. I'm just telling you that on and on and on we"
    },
    {
      "id": 48,
      "start": 931.0999755859375,
      "end": 938.1399841308594,
      "text": " have come to the place where we think we can do it on our own, where we think that"
    },
    {
      "id": 49,
      "start": 938.1399841308594,
      "end": 944.5399780273438,
      "text": " what we bring to it is enough. Hey, we want revival, we want to have revival, and"
    },
    {
      "id": 50,
      "start": 944.5399780273438,
      "end": 951.4599914550781,
      "text": " we schedule a meeting, and we preach the sermons, and we put out the brochures, but"
    },
    {
      "id": 51,
      "start": 951.4599914550781,
      "end": 958.1799926757812,
      "text": " revival has never come from a pulpit."
    },
    {
      "id": 52,
      "start": 958.3399963378906,
      "end": 967.8199768066406,
      "text": " Revival has never come from a preacher where first there was not prayer, bathing,"
    },
    {
      "id": 53,
      "start": 967.8199768066406,
      "end": 978.0599975585938,
      "text": " preparing, begging God to work. And by our lifestyle, by how we operate in our"
    },
    {
      "id": 54,
      "start": 978.0599975585938,
      "end": 985.6999816894531,
      "text": " lives, do you know the message we send to God? I've got this. I've got this. Well, of"
    },
    {
      "id": 55,
      "start": 985.6999816894531,
      "end": 991.9400024414062,
      "text": " course we pray. We pray gratefully over our food, and I'm glad of that. Hey, we"
    },
    {
      "id": 56,
      "start": 991.97998046875,
      "end": 998.4199829101562,
      "text": " love our children, and we pray for our children, and we pray for family and parents, but"
    },
    {
      "id": 57,
      "start": 998.4199829101562,
      "end": 1004.2999877929688,
      "text": " I'm telling you, it is so much bigger than the three-foot circle that surrounds us."
    },
    {
      "id": 58,
      "start": 1004.2999877929688,
      "end": 1011.0599975585938,
      "text": " There is a world that needs believers to find the time and the discipline of life"
    },
    {
      "id": 59,
      "start": 1011.0599975585938,
      "end": 1021.6199951171875,
      "text": " to beg God to do what none of us can do without Him. And we say we want that, but"
    },
    {
      "id": 60,
      "start": 1021.6199951171875,
      "end": 1030.739990234375,
      "text": " the manner in which we live says, I've got this. I'll come to you when I really"
    },
    {
      "id": 61,
      "start": 1030.739990234375,
      "end": 1036.97998046875,
      "text": " need you. And unlike this little woman, we don't understand that we are just as"
    },
    {
      "id": 62,
      "start": 1036.97998046875,
      "end": 1047.2200012207031,
      "text": " desperate, just as destitute, just as unable by ourselves to accomplish spiritually what"
    },
    {
      "id": 63,
      "start": 1047.2200012207031,
      "end": 1054.0999755859375,
      "text": " we need to accomplish without pleading and knowing and walking with God and"
    },
    {
      "id": 64,
      "start": 1054.0999755859375,
      "end": 1060.2999877929688,
      "text": " having His power. Men are always to pray. Turn with me to James chapter 5 and verse"
    },
    {
      "id": 65,
      "start": 1060.2999877929688,
      "end": 1073.8199768066406,
      "text": " 16. James chapter 5 and verse 16. Very familiar passage. There the scripture says"
    },
    {
      "id": 66,
      "start": 1073.8199768066406,
      "end": 1081.6999816894531,
      "text": " this, confess your faults one to another and pray one for another that you may be"
    },
    {
      "id": 67,
      "start": 1081.6999816894531,
      "end": 1087.6999816894531,
      "text": " healed. Here's the phrase I want to concentrate on, the effectual fervent"
    },
    {
      "id": 68,
      "start": 1087.6999816894531,
      "end": 1096.0599975585938,
      "text": " prayer of a righteous man availeth much. I don't suppose there's any more motivating"
    },
    {
      "id": 69,
      "start": 1096.0599975585938,
      "end": 1102.6599731445312,
      "text": " verse in my mind in the Word of God for right living in prayer than that phrase"
    },
    {
      "id": 70,
      "start": 1102.6599731445312,
      "end": 1109.97998046875,
      "text": " in that verse right there. That if I will pray and my life is in a place"
    },
    {
      "id": 71,
      "start": 1110.1399841308594,
      "end": 1119.0999755859375,
      "text": " where it is walking with the Lord that I can pray fervently and my prayer can"
    },
    {
      "id": 72,
      "start": 1119.0999755859375,
      "end": 1131.4599609375,
      "text": " impact what I pray about. Is that what God is saying? I want to say it again, I didn't say it well. I can pray and because God is"
    },
    {
      "id": 73,
      "start": 1131.4599609375,
      "end": 1161.3800048828125,
      "text": " working through my prayer, I can impact what needs to be changed or impacted. That's what the Bible says. That is a promise of God that says, hey, you see a hurt? Did you know that if you can pray about that hurt, I can work in that hurt? Hey, you see something that you're fearful about in someone's life? Hey, pray about that and I can impact that. Hey, you have"
    },
    {
      "id": 74,
      "start": 1161.3800048828125,
      "end": 1179.219970703125,
      "text": " a need? Hey, you have a fear? Hey, you have a hurt in your heart? Pray! Pray! Pray! I can work in that, but it's hard work to pray, and it takes time to pray. There's a word called"
    },
    {
      "id": 75,
      "start": 1179.219970703125,
      "end": 1188.1799926757812,
      "text": " intercession, and the truth is we rejoice in the fact that Jesus stands in the"
    },
    {
      "id": 76,
      "start": 1188.1799926757812,
      "end": 1193.0599975585938,
      "text": " presence of the Father as our advocate, and when the accuser of the brethren,"
    },
    {
      "id": 77,
      "start": 1193.0599975585938,
      "end": 1198.9400024414062,
      "text": " Satan, comes before the Lord, and by the way, in our lives there is plenty to"
    },
    {
      "id": 78,
      "start": 1198.9400024414062,
      "end": 1202.1400146484375,
      "text": " accuse, wouldn't you say?"
    },
    {
      "id": 0,
      "start": 1202.1400146484375,
      "end": 1208.2600145339966,
      "text": " we rejoice in the fact that our Advocate, Jesus, stands up for us and intercedes"
    },
    {
      "id": 1,
      "start": 1208.2600145339966,
      "end": 1215.0200147628784,
      "text": " for us, and pleads the blood for us, and God sees the blood of His Son in us,"
    },
    {
      "id": 2,
      "start": 1215.0200147628784,
      "end": 1222.6600151062012,
      "text": " forgives us, restores us. Hey, I am glad that in me, you don't see it, I don't see"
    },
    {
      "id": 3,
      "start": 1222.6600151062012,
      "end": 1228.780014038086,
      "text": " it in you, I see the effect, we have the Holy Spirit within us, and I rejoice in"
    },
    {
      "id": 4,
      "start": 1228.780014038086,
      "end": 1233.020013809204,
      "text": " the fact that the Holy Spirit intercedes for me, that He"
    },
    {
      "id": 5,
      "start": 1233.020013809204,
      "end": 1238.9000129699707,
      "text": " pleads to God with me in groanings that I can't utter, can't understand, but He"
    },
    {
      "id": 6,
      "start": 1238.9000129699707,
      "end": 1247.7400131225586,
      "text": " pleads for me, thank God He intercedes for me. But we never catch the view that"
    },
    {
      "id": 7,
      "start": 1247.7400131225586,
      "end": 1252.5800132751465,
      "text": " as Christ and as the Holy Spirit intercede for us, we ought to be an"
    },
    {
      "id": 8,
      "start": 1252.5800132751465,
      "end": 1259.4200134277344,
      "text": " Advocate and intercede for others. Let me walk through the scripture just a"
    },
    {
      "id": 9,
      "start": 1259.4200134277344,
      "end": 1264.5400161743164,
      "text": " moment, don't turn to these for the sake of time. I love in Numbers chapter 11"
    },
    {
      "id": 10,
      "start": 1264.5400161743164,
      "end": 1271.1800155639648,
      "text": " verse 1, just listen as I read, it's about Moses. It says, And when the people"
    },
    {
      "id": 11,
      "start": 1271.1800155639648,
      "end": 1278.7400131225586,
      "text": " complained, it displeased the Lord. And the Lord heard it, and His anger was"
    },
    {
      "id": 12,
      "start": 1278.7400131225586,
      "end": 1284.7000122070312,
      "text": " kindled, and the fire of the Lord burnt among them, and consumed them that were"
    },
    {
      "id": 13,
      "start": 1284.7000122070312,
      "end": 1291.9400177001953,
      "text": " in the uttermost parts of the camp. And the people cried unto Moses. And when"
    },
    {
      "id": 14,
      "start": 1291.9400177001953,
      "end": 1305.9800109863281,
      "text": " Moses prayed unto the Lord, the fire was quenched. Well, we're not Moses. Hey, Moses"
    },
    {
      "id": 15,
      "start": 1305.9800109863281,
      "end": 1312.1800155639648,
      "text": " was created out of the same dust that you and I are created. Stop letting"
    },
    {
      "id": 16,
      "start": 1312.1800155639648,
      "end": 1319.8600158691406,
      "text": " ourselves off because our name doesn't appear in the Bible. Moses was a meek man,"
    },
    {
      "id": 17,
      "start": 1319.8600158691406,
      "end": 1326.0200119018555,
      "text": " Moses was a flawed man, Moses was a man that God had to put on the backside of"
    },
    {
      "id": 18,
      "start": 1326.0200119018555,
      "end": 1332.260009765625,
      "text": " the desert for 40 years to teach him this, but Moses got it and became a man"
    },
    {
      "id": 19,
      "start": 1332.260009765625,
      "end": 1339.0600128173828,
      "text": " who walked with God, who was able to offer an effectual, fervent prayer, and he"
    },
    {
      "id": 20,
      "start": 1339.0600128173828,
      "end": 1348.2200164794922,
      "text": " interceded for his people, and the fire stopped. Every pastor ought to have a"
    },
    {
      "id": 21,
      "start": 1348.2200164794922,
      "end": 1354.9400177001953,
      "text": " burning in his soul to be able to pray for the fire to stop in the families"
    },
    {
      "id": 22,
      "start": 1354.9400177001953,
      "end": 1360.4200134277344,
      "text": " that he pastors, in the lives of those teens that he pastors, in the attacks"
    },
    {
      "id": 23,
      "start": 1360.4200134277344,
      "end": 1364.7400207519531,
      "text": " upon the church. He ought to be an intercessor. It ought to be a vital part"
    },
    {
      "id": 24,
      "start": 1364.7400207519531,
      "end": 1375.4200134277344,
      "text": " of every ministry. Yet, we don't have time for it. Every parent ought to be an"
    },
    {
      "id": 25,
      "start": 1375.4200134277344,
      "end": 1383.2200164794922,
      "text": " intercessor, ought to be praying for that fire to stop, for that to stop before it"
    },
    {
      "id": 26,
      "start": 1383.2200164794922,
      "end": 1388.5400085449219,
      "text": " gets to that child, before it gets to that home. Every parent ought to have"
    },
    {
      "id": 27,
      "start": 1388.5400085449219,
      "end": 1394.1800079345703,
      "text": " time because he needs to intercede for his children, for his home, and he"
    },
    {
      "id": 28,
      "start": 1394.1800079345703,
      "end": 1399.500015258789,
      "text": " ought to understand that no matter how loudly he cheers on the soccer sideline,"
    },
    {
      "id": 29,
      "start": 1399.500015258789,
      "end": 1405.500015258789,
      "text": " or how cool a dad he is when he does this or that, or how many activities they"
    },
    {
      "id": 30,
      "start": 1405.500015258789,
      "end": 1411.9400177001953,
      "text": " have, the devil doesn't care about that! He is after your home! And I don't care"
    },
    {
      "id": 31,
      "start": 1411.9400177001953,
      "end": 1416.7000122070312,
      "text": " how many activities you schedule, and how sweet you are, and how many gifts you buy,"
    },
    {
      "id": 32,
      "start": 1416.7000122070312,
      "end": 1428.3000183105469,
      "text": " only the effectual, fervent prayer and God's intervention will stop that work."
    },
    {
      "id": 33,
      "start": 1428.3000183105469,
      "end": 1438.3000183105469,
      "text": " Hey folks, we need to wake up. Hey God, how do I got three kids? I got this, going to"
    },
    {
      "id": 34,
      "start": 1438.3000183105469,
      "end": 1445.6200103759766,
      "text": " the soccer game. Hey God, I got this! We got a program at church that'll take"
    },
    {
      "id": 35,
      "start": 1445.6200103759766,
      "end": 1458.9400024414062,
      "text": " care of that. God looks at us and says, well, we'll see if you got it. I read"
    },
    {
      "id": 36,
      "start": 1458.9400024414062,
      "end": 1469.3000183105469,
      "text": " about Elijah, 1 Kings chapter 18, Lord God of Abraham, he begins to pray, and of"
    },
    {
      "id": 37,
      "start": 1469.3000183105469,
      "end": 1478.5400085449219,
      "text": " Israel, let it be known this day that thou art God in Israel, and that I am"
    },
    {
      "id": 38,
      "start": 1478.5400085449219,
      "end": 1484.3400268554688,
      "text": " thy servant, and that I have done all these things at thy word. And when he"
    },
    {
      "id": 39,
      "start": 1484.3400268554688,
      "end": 1489.4200134277344,
      "text": " prayed that brief prayer, you know what happened? Fire fell. And you know what"
    },
    {
      "id": 40,
      "start": 1489.4200134277344,
      "end": 1494.8200073242188,
      "text": " the purpose of that fire falling was? So that Israel would know who the real God"
    },
    {
      "id": 41,
      "start": 1494.8600158691406,
      "end": 1503.5400085449219,
      "text": " was. For hours and hours, the prophets of Baal had danced around that sacrifice, cut"
    },
    {
      "id": 42,
      "start": 1503.5400085449219,
      "end": 1509.8200073242188,
      "text": " themselves, and plead for their God to throw fire. Baal is not real. He couldn't"
    },
    {
      "id": 43,
      "start": 1509.8200073242188,
      "end": 1518.4200134277344,
      "text": " throw fire down. But in that prayer, Elijah showed the world who was God. I"
    },
    {
      "id": 44,
      "start": 1518.5800170898438,
      "end": 1525.5400085449219,
      "text": " don't want to be true dramatic in this, but I want to be able to demonstrate to"
    },
    {
      "id": 45,
      "start": 1525.5400085449219,
      "end": 1534.02001953125,
      "text": " this world who God is. Our churches ought to be places where people find God. Our"
    },
    {
      "id": 46,
      "start": 1534.02001953125,
      "end": 1539.5,
      "text": " living rooms ought to be places where people find God. When somebody"
    },
    {
      "id": 47,
      "start": 1539.5,
      "end": 1545.02001953125,
      "text": " fellowships with us, they ought to be able to find God, because we make God"
    },
    {
      "id": 48,
      "start": 1545.4600219726562,
      "end": 1556.8600158691406,
      "text": " known through the way we live and through what we are. I got it, God. We've"
    },
    {
      "id": 49,
      "start": 1556.8600158691406,
      "end": 1564.9400024414062,
      "text": " got a visitation program. That'll work. And it will work. I'm glad for it. But I'm"
    },
    {
      "id": 50,
      "start": 1564.9400024414062,
      "end": 1571.1400146484375,
      "text": " telling you, all the distribution, letterboxing, all the programs and all"
    },
    {
      "id": 51,
      "start": 1571.3800048828125,
      "end": 1581.2200012207031,
      "text": " the seminars, without the power of God to make Himself known, we work so hard at"
    },
    {
      "id": 52,
      "start": 1581.2200012207031,
      "end": 1591.3400268554688,
      "text": " all the stuff, and we forget the most vital aspect, God's power. I think of"
    },
    {
      "id": 53,
      "start": 1591.3400268554688,
      "end": 1598.5400085449219,
      "text": " Hezekiah. Hezekiah received the letter of the hand of the messengers and read it."
    },
    {
      "id": 54,
      "start": 1598.5400085449219,
      "end": 1603.260009765625,
      "text": " Hezekiah went up into the house of the Lord, spread it before the Lord, and"
    },
    {
      "id": 55,
      "start": 1603.260009765625,
      "end": 1610.1800231933594,
      "text": " Hezekiah prayed before the Lord and said, O Lord God of Israel. And he went on and"
    },
    {
      "id": 56,
      "start": 1610.1800231933594,
      "end": 1615.3000183105469,
      "text": " read that letter of how they were going to destroy the city. And God's"
    },
    {
      "id": 57,
      "start": 1615.3000183105469,
      "end": 1620.9000244140625,
      "text": " answer came just a few verses later. God answers and says, Therefore, thus saith"
    },
    {
      "id": 58,
      "start": 1620.9000244140625,
      "end": 1626.3800048828125,
      "text": " the Lord concerning the king of Assyria, he shall not come into this city, nor"
    },
    {
      "id": 59,
      "start": 1626.3800048828125,
      "end": 1632.1000061035156,
      "text": " shoot an arrow there, nor come before it with shield, nor cast a bank against it."
    },
    {
      "id": 60,
      "start": 1632.1000061035156,
      "end": 1640.5800170898438,
      "text": " Would to God we could stop Satan in his tracks. Every father and mother needs the"
    },
    {
      "id": 61,
      "start": 1640.5800170898438,
      "end": 1646.9000244140625,
      "text": " power to pray Satan away from the walls of their home and the hearts of their"
    },
    {
      "id": 62,
      "start": 1646.9000244140625,
      "end": 1653.5400085449219,
      "text": " children. I don't want to over dramatize this, but I'm 70 years old, and I'm"
    },
    {
      "id": 63,
      "start": 1653.5400085449219,
      "end": 1659.9000244140625,
      "text": " telling you, I ain't never seen it like this. There's always been sin, but it has"
    },
    {
      "id": 64,
      "start": 1659.9000244140625,
      "end": 1666.02001953125,
      "text": " never been so obvious. And our teenagers, our children, I'm not saying they can't"
    },
    {
      "id": 65,
      "start": 1666.02001953125,
      "end": 1671.7000122070312,
      "text": " succeed. They can. They can have marvelous testimonies, but it's not by saying, I got"
    },
    {
      "id": 66,
      "start": 1671.7000122070312,
      "end": 1682.260009765625,
      "text": " this. Taking them to Disney, that'll do it. Hey, I'm not against that, but if you"
    },
    {
      "id": 67,
      "start": 1682.260009765625,
      "end": 1692.3800048828125,
      "text": " think being a cool dad, being a cool mom will stop Satan from their hearts, you're"
    },
    {
      "id": 68,
      "start": 1692.3800048828125,
      "end": 1700.7400207519531,
      "text": " wrong. And you and I need to be intercessors. Well, I pray for my children."
    },
    {
      "id": 69,
      "start": 1700.7400207519531,
      "end": 1711.5800170898438,
      "text": " Well, how long do you pray? What do you pray for? How often do you pray? You pray"
    },
    {
      "id": 70,
      "start": 1711.5800170898438,
      "end": 1717.3800048828125,
      "text": " when the test? You pray when the crisis? Or is it a part of your life where every"
    },
    {
      "id": 71,
      "start": 1717.3800048828125,
      "end": 1723.4600219726562,
      "text": " day, significant time in intercessory prayer for each and every one of your"
    },
    {
      "id": 72,
      "start": 1723.4600219726562,
      "end": 1727.9000244140625,
      "text": " children, for your spouse, for your extended family, for your church? Are you"
    },
    {
      "id": 73,
      "start": 1727.9000244140625,
      "end": 1737.5,
      "text": " an intercessor? And I'm saying to you, we read the effectual, fervent prayer of a"
    },
    {
      "id": 74,
      "start": 1737.5,
      "end": 1744.9800415039062,
      "text": " righteous man availeth much, and never put it into practice. We're glad it's"
    },
    {
      "id": 75,
      "start": 1744.9800415039062,
      "end": 1756.3800048828125,
      "text": " there. We hope the preacher's doing it, but we never put it into practice. It takes"
    },
    {
      "id": 76,
      "start": 1756.3800048828125,
      "end": 1766.1400146484375,
      "text": " time. You see, power with God is not microwavable. Power with God isn't"
    },
    {
      "id": 77,
      "start": 1766.1400146484375,
      "end": 1771.9000244140625,
      "text": " something we shake up and pour out and cook. Power with God is commitment of"
    },
    {
      "id": 78,
      "start": 1771.9000244140625,
      "end": 1779.02001953125,
      "text": " time, commitment of energy, not just physical, mental energy. And saying, I'm"
    },
    {
      "id": 79,
      "start": 1779.02001953125,
      "end": 1783.5800170898438,
      "text": " going to do this. Power with God requires not only the discipline of time, but the"
    },
    {
      "id": 80,
      "start": 1783.5800170898438,
      "end": 1788.1400146484375,
      "text": " discipline of thought. We've got to write things down. We've got to"
    },
    {
      "id": 81,
      "start": 1788.1400146484375,
      "end": 1792.2999877929688,
      "text": " know what we're praying for. We've got to know when we prayed for it last, and when"
    },
    {
      "id": 82,
      "start": 1792.2999877929688,
      "end": 1796.2200317382812,
      "text": " we're going to pray for it again. We've got to be specific about it. It takes"
    },
    {
      "id": 83,
      "start": 1796.2200317382812,
      "end": 1804.1000366210938,
      "text": " time, but if we can't put it in a microwave, I gotta work, oh we gotta..."
    },
    {
      "id": 0,
      "start": 1804.1000366210938,
      "end": 1811.1800365447998,
      "text": " this activity oh we got I got a God I'll get with I'll catch up with you and we"
    },
    {
      "id": 1,
      "start": 1811.1800365447998,
      "end": 1818.5600366592407,
      "text": " think we can do it by ourselves one last scripture would you look with me at"
    },
    {
      "id": 2,
      "start": 1818.5600366592407,
      "end": 1835.7600364685059,
      "text": " Matthew 26 Matthew 26 and verse 36 I'll be quick Matthew 26 and verse 36 and we"
    },
    {
      "id": 3,
      "start": 1835.7600364685059,
      "end": 1841.3200378417969,
      "text": " begin reading we're going to read about 10 verses then cometh Jesus with them"
    },
    {
      "id": 4,
      "start": 1841.3200378417969,
      "end": 1847.0400352478027,
      "text": " unto a place called Gethsemane and sayeth unto the disciples sit ye here"
    },
    {
      "id": 5,
      "start": 1847.0400352478027,
      "end": 1853.2800369262695,
      "text": " while I go and pray yonder and he took with him Peter and the two sons of"
    },
    {
      "id": 6,
      "start": 1853.2800369262695,
      "end": 1858.2000350952148,
      "text": " Zebedee and began to be sorrowful and very heavy then saith he unto them my"
    },
    {
      "id": 7,
      "start": 1858.2000350952148,
      "end": 1865.8800354003906,
      "text": " soul is exciting sorrowful even unto death tarry ye here and watch with me"
    },
    {
      "id": 8,
      "start": 1865.8800354003906,
      "end": 1871.9800338745117,
      "text": " pray with me others passages will reveal and he went a little further and fell on"
    },
    {
      "id": 9,
      "start": 1871.9800338745117,
      "end": 1877.6200332641602,
      "text": " his face and prayed saying oh my father if it be possible let this cup pass from"
    },
    {
      "id": 10,
      "start": 1877.6200332641602,
      "end": 1882.7000350952148,
      "text": " me nevertheless not as I will but as thou wilt and he cometh unto his"
    },
    {
      "id": 11,
      "start": 1882.7000350952148,
      "end": 1894.5400390625,
      "text": " disciples and findeth them asleep and saith unto Peter what could could could"
    },
    {
      "id": 12,
      "start": 1894.5400390625,
      "end": 1905.140037536621,
      "text": " you not watch with me one hour watch and pray that you enter not into"
    },
    {
      "id": 13,
      "start": 1905.140037536621,
      "end": 1910.9800338745117,
      "text": " temptation the spirit indeed is willing but the flesh is weak he went away again"
    },
    {
      "id": 14,
      "start": 1910.9800338745117,
      "end": 1916.6600341796875,
      "text": " the second time and prayed saying oh my father if this cup may not pass away"
    },
    {
      "id": 15,
      "start": 1916.6600341796875,
      "end": 1922.3800354003906,
      "text": " from me except I drink it thy will be done and he came and found them asleep"
    },
    {
      "id": 16,
      "start": 1922.3800354003906,
      "end": 1930.2200393676758,
      "text": " again for their eyes were heavy and he left them and went again and prayed the"
    },
    {
      "id": 17,
      "start": 1930.2200393676758,
      "end": 1940.3800354003906,
      "text": " third time saying the same words I just give me a moment and I'll be done Jesus"
    },
    {
      "id": 18,
      "start": 1940.3800354003906,
      "end": 1945.9800415039062,
      "text": " brought his inner disciple his inner circle those that he felt he was closest"
    },
    {
      "id": 19,
      "start": 1945.9800415039062,
      "end": 1951.2600402832031,
      "text": " to those he felt that would truly understand and and they come to the"
    },
    {
      "id": 20,
      "start": 1951.2600402832031,
      "end": 1956.060043334961,
      "text": " garden of Gethsemane and understand what night this is this is the night of"
    },
    {
      "id": 21,
      "start": 1956.060043334961,
      "end": 1963.6200408935547,
      "text": " his passion he is only hours away from arrest hours away from the cross and as"
    },
    {
      "id": 22,
      "start": 1963.6200408935547,
      "end": 1969.7000427246094,
      "text": " they come to this place his soul is heavy and he looks to his disciples and"
    },
    {
      "id": 23,
      "start": 1969.7000427246094,
      "end": 1976.3400421142578,
      "text": " he says I want you to watch with me in other words be aware with me and pray"
    },
    {
      "id": 24,
      "start": 1976.3400421142578,
      "end": 1981.060043334961,
      "text": " with me and and I'm gonna go over here and pray but I want you to pray here and"
    },
    {
      "id": 25,
      "start": 1981.060043334961,
      "end": 1985.780029296875,
      "text": " they looked at him and they could tell that it was heavy he was sorrowing he"
    },
    {
      "id": 26,
      "start": 1985.780029296875,
      "end": 1991.9400329589844,
      "text": " was really deeply distressed over what he was talking about he went over and we"
    },
    {
      "id": 27,
      "start": 1991.9400329589844,
      "end": 1996.9000396728516,
      "text": " know the story prayed and he prayed and he prayed he looked into the cup of our"
    },
    {
      "id": 28,
      "start": 1996.9000396728516,
      "end": 2003.4200439453125,
      "text": " sin and and knew that he had to drink that cup if we were ever to be made one"
    },
    {
      "id": 29,
      "start": 2003.5000305175781,
      "end": 2009.1800384521484,
      "text": " again with God and and to be honest with you it was a decision point is he going"
    },
    {
      "id": 30,
      "start": 2009.1800384521484,
      "end": 2014.020034790039,
      "text": " to go to the cross or is he going to say no it's it's too heavy I don't want to"
    },
    {
      "id": 31,
      "start": 2014.020034790039,
      "end": 2027.2200317382812,
      "text": " carry it and he comes back to his disciples and he finds them asleep and"
    },
    {
      "id": 32,
      "start": 2027.2200317382812,
      "end": 2038.4200439453125,
      "text": " he says to them and I'm going to put some words in his mouth what you saw how"
    },
    {
      "id": 33,
      "start": 2038.4200439453125,
      "end": 2047.4200439453125,
      "text": " heavy this was you saw how in distress I was you saw me fall down you may have"
    },
    {
      "id": 34,
      "start": 2047.4200439453125,
      "end": 2055.9000396728516,
      "text": " even heard the cry of my heart and and what you're asleep could you could you"
    },
    {
      "id": 35,
      "start": 2055.9000396728516,
      "end": 2066.3400268554688,
      "text": " not give me an hour the greatest spiritual battle the world has ever"
    },
    {
      "id": 36,
      "start": 2066.3400268554688,
      "end": 2077.7000427246094,
      "text": " known is going on 20 feet from those disciples and in that proximity of the"
    },
    {
      "id": 37,
      "start": 2077.7000427246094,
      "end": 2087.6200256347656,
      "text": " greatest spiritual battle the world has ever known the disciples slept I think"
    },
    {
      "id": 38,
      "start": 2087.6200256347656,
      "end": 2094.020050048828,
      "text": " there's a lesson there for us we have come to this place in our nation in our"
    },
    {
      "id": 39,
      "start": 2094.020050048828,
      "end": 2100.1800231933594,
      "text": " culture in our world folks I don't know I don't know that it's ever been more"
    },
    {
      "id": 40,
      "start": 2100.1800231933594,
      "end": 2110.3400268554688,
      "text": " serious certainly sin is abounding and hearts are getting colder certainly the"
    },
    {
      "id": 41,
      "start": 2110.3400268554688,
      "end": 2122.7400512695312,
      "text": " need is greater and and we think that this is the time to say I got it I'll"
    },
    {
      "id": 42,
      "start": 2122.7400512695312,
      "end": 2128.6200256347656,
      "text": " pray when I need to you know what I'm fearing I'm fearing that a great"
    },
    {
      "id": 43,
      "start": 2128.6200256347656,
      "end": 2133.7400512695312,
      "text": " spiritual battle is right outside our office door and we don't have time to"
    },
    {
      "id": 44,
      "start": 2133.7400512695312,
      "end": 2139.2200317382812,
      "text": " pray I'm afraid that a great spiritual battle or maybe a great spiritual"
    },
    {
      "id": 45,
      "start": 2139.2200317382812,
      "end": 2145.8600463867188,
      "text": " opportunity is afoot in this community but we don't have time to pray I fear"
    },
    {
      "id": 46,
      "start": 2145.8600463867188,
      "end": 2152.1800231933594,
      "text": " that that there are teenagers who are moments from an onslaught from the devil"
    },
    {
      "id": 47,
      "start": 2152.1800231933594,
      "end": 2159.1400451660156,
      "text": " and his hordes and there's dads who don't have time to pray and moms who"
    },
    {
      "id": 48,
      "start": 2159.1400451660156,
      "end": 2167.9800415039062,
      "text": " think it's time to take a nap and I think the Lord looks at us and says in"
    },
    {
      "id": 49,
      "start": 2167.9800415039062,
      "end": 2179.5400390625,
      "text": " our vernacular dude don't you get it it's time to pray the spiritual battle"
    },
    {
      "id": 50,
      "start": 2179.5400390625,
      "end": 2190.1800231933594,
      "text": " of your life surrounds you and you can't find time to plead with God to"
    },
    {
      "id": 51,
      "start": 2190.1800231933594,
      "end": 2200.020050048828,
      "text": " work through you to work in the hearts of those you love hey I'd say it's time"
    },
    {
      "id": 52,
      "start": 2200.020050048828,
      "end": 2206.9400329589844,
      "text": " that Christians have to stop messing with it and have to say if there's gonna"
    },
    {
      "id": 53,
      "start": 2206.9400329589844,
      "end": 2216.3400268554688,
      "text": " be revival in my heart if there's gonna be revival in my marriage if there's"
    },
    {
      "id": 54,
      "start": 2216.3400268554688,
      "end": 2226.020050048828,
      "text": " gonna be revival in my home in my church in my community I've got to stop saying"
    },
    {
      "id": 55,
      "start": 2226.020050048828,
      "end": 2233.9800415039062,
      "text": " I've got this I've got to stop thinking that our program is all we need I've"
    },
    {
      "id": 56,
      "start": 2233.9800415039062,
      "end": 2239.6200256347656,
      "text": " got to stop thinking that my intellect my activity my gift that's all we need"
    },
    {
      "id": 57,
      "start": 2239.6200256347656,
      "end": 2246.300048828125,
      "text": " now and I'll ask God to bless it but folks I'm telling you the missing"
    },
    {
      "id": 58,
      "start": 2246.300048828125,
      "end": 2254.820037841797,
      "text": " ingredient is not a better program it's not better music it's not new carpet or"
    },
    {
      "id": 59,
      "start": 2254.820037841797,
      "end": 2263.260040283203,
      "text": " a bigger building it's prayer and begging God to do what we cannot do but"
    },
    {
      "id": 60,
      "start": 2263.260040283203,
      "end": 2278.1800231933594,
      "text": " he could do through us men ought always to pray and not quit because the"
    },
    {
      "id": 61,
      "start": 2278.1800231933594,
      "end": 2285.7000427246094,
      "text": " effectual fervent prayer of a righteous man availeth much and the greatest"
    },
    {
      "id": 62,
      "start": 2285.7000427246094,
      "end": 2290.580047607422,
      "text": " spiritual battle that our world our lives have ever seen or known is raging"
    },
    {
      "id": 63,
      "start": 2290.580047607422,
      "end": 2300.1400451660156,
      "text": " around us can't you pray can't you watch with me can't you be serious about this"
    },
    {
      "id": 64,
      "start": 2300.1400451660156,
      "end": 2309.2200317382812,
      "text": " can't you intercede can't you can't you call upon me to work I'm simply saying"
    },
    {
      "id": 65,
      "start": 2309.2200317382812,
      "end": 2318.6600341796875,
      "text": " it is time for us to pray say preacher what do you mean I mean dedicated"
    },
    {
      "id": 66,
      "start": 2318.6600341796875,
      "end": 2327.1400146484375,
      "text": " committed disciplined prayer times of praise times of thanksgiving times of"
    },
    {
      "id": 67,
      "start": 2327.1400146484375,
      "end": 2335.9000244140625,
      "text": " confession of sin interceding for others making petition for ourselves praising"
    },
    {
      "id": 68,
      "start": 2335.9000244140625,
      "end": 2343.260009765625,
      "text": " again and and coming with decision from it it is time to pray and this I finish"
    },
    {
      "id": 69,
      "start": 2343.260009765625,
      "end": 2351.6200561523438,
      "text": " if revival is a set of meetings and it's done on Wednesday night revivals not"
    },
    {
      "id": 70,
      "start": 2351.6200561523438,
      "end": 2362.02001953125,
      "text": " coming but when a believer will say I'm going to watch and pray with him and I'm"
    },
    {
      "id": 71,
      "start": 2362.02001953125,
      "end": 2367.3400268554688,
      "text": " going to plead with my God to work through my life and they become"
    },
    {
      "id": 72,
      "start": 2367.3400268554688,
      "end": 2378.5400390625,
      "text": " disciplined and committed to pray then revival would you pray with me father we"
    },
    {
      "id": 73,
      "start": 2378.5400390625,
      "end": 2386.6600341796875,
      "text": " thank you tonight for your blessing and for your help or I pray that you would"
    },
    {
      "id": 74,
      "start": 2386.6600341796875,
      "end": 2397.02001953125,
      "text": " create a first hunger we've become so accustomed to doing church how we do"
    },
    {
      "id": 75,
      "start": 2397.02001953125,
      "end": 2401.5400390625,
      "text": " church that we think the powers and how we do church"
    },
    {
      "id": 0,
      "start": 2401.5400390625,
      "end": 2406.460039138794,
      "text": " We've become so accustomed to think that it's what we do that makes a difference,"
    },
    {
      "id": 1,
      "start": 2406.460039138794,
      "end": 2416.4400386810303,
      "text": " and it really never is. But at our fingertips is the greatest power the"
    },
    {
      "id": 2,
      "start": 2416.4400386810303,
      "end": 2423.300039291382,
      "text": " universe knows, the power of God. And Satan really can be stopped. People"
    },
    {
      "id": 3,
      "start": 2423.300039291382,
      "end": 2430.9800395965576,
      "text": " really can be helped. Families really can succeed. Teens really can honor you. All"
    },
    {
      "id": 4,
      "start": 2430.9800395965576,
      "end": 2438.300037384033,
      "text": " of these things can be true. And it's not happenstance. It's not accident. But"
    },
    {
      "id": 5,
      "start": 2438.300037384033,
      "end": 2446.780040740967,
      "text": " when we don't sense the need, when we think what we do is enough, Lord, we will"
    },
    {
      "id": 6,
      "start": 2446.780040740967,
      "end": 2454.980037689209,
      "text": " never ever know what you can do. And so I pray tonight that you would speak to the"
    },
    {
      "id": 7,
      "start": 2454.980037689209,
      "end": 2464.260040283203,
      "text": " hearts of your people and plant in their hearts a desire, a thirst, to have"
    },
    {
      "id": 8,
      "start": 2464.260040283203,
      "end": 2473.1800384521484,
      "text": " your power. Your power. Power to influence others for the gospel. Power to have"
    },
    {
      "id": 9,
      "start": 2473.1800384521484,
      "end": 2480.4600372314453,
      "text": " victory in their own hearts over sin. Power to see their children honor, love,"
    },
    {
      "id": 10,
      "start": 2480.4600372314453,
      "end": 2489.0200424194336,
      "text": " and serve you. Power, God, to read your Word and be able to communicate it. Power"
    },
    {
      "id": 11,
      "start": 2489.0200424194336,
      "end": 2501.3800354003906,
      "text": " in the midst of the most difficult times to be a testimony of joy. Lord, please put"
    },
    {
      "id": 12,
      "start": 2501.3800354003906,
      "end": 2507.7800369262695,
      "text": " in our hearts that desire. Wherever you are tonight, whether in this room or"
    },
    {
      "id": 13,
      "start": 2507.7800369262695,
      "end": 2514.140037536621,
      "text": " listening to us by live stream, I pray that you understand that you're not"
    },
    {
      "id": 14,
      "start": 2514.140037536621,
      "end": 2522.9800415039062,
      "text": " enough. I'm not enough. But with God, we can see great things that honor Him"
    },
    {
      "id": 15,
      "start": 2522.9800415039062,
      "end": 2529.340042114258,
      "text": " accomplished through our lives. But it takes commitment. And my prayer for you"
    },
    {
      "id": 16,
      "start": 2529.340042114258,
      "end": 2535.6200408935547,
      "text": " is at this moment, you will allow God and you will make the commitment to God, God"
    },
    {
      "id": 17,
      "start": 2535.6200408935547,
      "end": 2541.3800354003906,
      "text": " teach me to pray. Help me to be disciplined. Start disciplining your"
    },
    {
      "id": 18,
      "start": 2541.3800354003906,
      "end": 2547.6200408935547,
      "text": " prayer life. I'm sure a pastor could help you with perhaps helps to get that done."
    },
    {
      "id": 19,
      "start": 2547.6200408935547,
      "end": 2556.3800354003906,
      "text": " But make the commitment tonight. Prayer will become real and vital in my life."
    },
    {
      "id": 20,
      "start": 2556.3800354003906,
      "end": 2561.8600463867188,
      "text": " Let's stand together, our heads about, our eyes are closed."
    }
  ],
  "processed_at": "2025-04-17T03:31:05.190997"
}