{
  "video_id": "HiFapKk4nG4",
  "text": "through 16, and a very familiar passage of Scripture, and I hope this evening as we study through this portion that we would have a renewed commitment to be what God has called us to be. I believe that each one of us this evening could readily admit and acknowledge that we're living in a very dark world. We're living in a time, as Paul described it when he was writing to Timothy, that we're living in those last days and that perilous times would come. We understand that he further gave instruction to Timothy in the last book that he wrote, 2 Timothy, in the fourth chapter, about the importance of preaching the Word of God and sharing with Timothy that the time would come when men will not endure sound doctrine. And indeed, we're living in a time that was described even of Judah and Israel in the Old Testament as a time in which they call evil good and good evil, a time in which they legislate wickedness, but it is a time in which we have the unique privilege of embracing the responsibility that has been entrusted to us and being the light that God has called us to be. As you walk into our auditorium each and every time that you walk in, and I know for those of us that maybe have just kind of gotten accustomed to it, we've been here for a length of time, that we see as you walk in on the right-hand side, send the light, and there are two lighthouses up there with the imagery that would be desiring to send the light to the entire globe, to the entire world, that the light of the gospel of Jesus Christ would go forth and shine forth brightly. As you look as you walk in on the left of our auditorium, you have this missions map that back in 2012 we put that together, and it's interesting as you would begin to understand the concepts behind this map and really the reasoning for why we laid it out the way that we did, but you push one of those tiles and that light will light up to show the region in which that particular missionary serves God and is seeking to take the gospel to that part of the earth. And as we think about the light on the map and as you would push an individual tile and you would see that little LED that travels through a fiber optic cable light up on that map, that you would be reminded of not only the location but really the purpose in which that missionary has been sent there. We do not send missionaries to go to various countries around the world to enjoy the climate and to enjoy the beauty of the particular countries and to live a life of pleasure and ease and vacation. No, we send them there, though they may enjoy some of those things, we send them there with the express purpose of preaching the gospel of Jesus Christ to be the light that we are called to be. Obviously, God will call some to go to a specific location, to go and to give their lives in that particular arena and to be a full-time, if you will, Christian servant, but we find that the Bible speaks of individual believers as being the light of the world. And as we would begin to look at this familiar passage of Scripture and we would acknowledge the fact that we're living in a very dark world, we would also come to the conclusion that it is absolutely imperative that at this moment we let our light shine. It's a dark world that we're living in and the light needs to shine brightly. If you've ever gone into a room that was dark, have you ever tried to navigate some steps or some particular terrain and it's dark, what do you look for? You want to have a light. And we give out those flashlight, the keychain flashlights, and we have those that we give out regularly. And man, I was somewhere just the other day before we went on vacation, so a couple of weeks ago, and I needed a light. It was dark in the room and I went to push that button to turn on the light and it was dead. Man, that was unfortunate. I could not complete the task that I set out to complete because I could not see what was before me. It was just too dark. I just couldn't navigate. I couldn't get to where I wanted to get to without a light. And as we think about the darkness in which we are living in and we think about the particular culture and society in which we're faced with, we understand that God is not surprised by any of these things. He knows. He knew. He's all-knowing. He transcends time. And so He provided a solution for this dark world, and that is that we are the light of the world. Notice what it says in Matthew 5, verses 14 through 16. The Bible says this, Ye are the light of the world. A city that is set on a hill cannot be hid. Neither do men light a candle and put it under a bushel, but on a candlestick. And it giveth light unto all that are in the house. Let your light so shine before men that they may see your good works and glorify your Father which is in heaven. I've titled the message this evening, You Are the Light of the World. We begin to think about these pictures and this imagery that we have on the walls of our auditorium this evening, and as I think about those lighthouses to my left, to your right, and I think about the lighthouse, and obviously we were in contact with lighthouses when we were on vacation, and I began to think about and just kind of meditate upon and do a little research about lighthouses. And I looked up what the roles and responsibilities were of the lighthouse keepers. Now we understand today, with the technological advancements that have been made, that the roles and responsibilities have changed drastically over the years. But you understand the significant role that lighthouse keepers played in providing navigational assistance to those that were traveling very difficult seas. And we find that these lighthouse keepers, they had the responsibilities to trim the wicks, to replenish the fuel. Some of them, in fact, their fuel source, way back at the end of the 19th century, the middle of the 19th century, many of the fuel sources were whale oil, and they would use various things, and they would have the responsibility of going and getting that fuel and ensuring that the fuel was replenished, that they did not run out of fuel at the wrong time. We find that they had the responsibility of winding the clockworks. We find that they had the responsibility of cleaning the lenses and the windows. So you think about the lens and the window of those lights, and you think about the way in which it could get dirty from the environment, from those things that are going to affect it. You could understand how that a dirty lens or a dirty window would not allow for the light to shine in the manner in which it's supposed to shine. And so these were some of the roles and responsibilities of these lighthouse keepers. I did some further research to think about some of those lighthouses that are down in the Outer Banks region of North Carolina, and the Cape Hatteras Lighthouse, they say that you can see it 20 miles out to sea. That's a long, long distance, but if you know anything about the sea and the topography, if you will, of the sea on the coast of that part of North Carolina, many, many ships found a fateful end because of those sandbars and the currents and all of the things that were out there. So Cape Hatteras is a lighthouse there. It could be seen 20 miles out to sea. Ocracoke Lighthouse, 14 miles. Body Island Lighthouse, 19 miles. And Kuratuk, 18 miles. Those are long distances. You think about the light, and you think about the truth that God has given us, and we look at some of those things in our world, and we see that I would use that as an illustration this evening, because in our text, Jesus uses some basic logic with the disciples. He's speaking to the disciples, and He says to them in verse number 14, Ye are the light of the world. Now that's a pretty simple statement, is it not? I mean, there's not a whole lot of difficulty on the part of the reader to understand, on the part of the recipient, to understand what Jesus was saying. Ye are the light of the world. But then notice the logic that Jesus uses when He's explaining to the disciples this responsibility that they have. The Bible says this, a city that is set on a hill cannot be hid. Have you ever driven at night through maybe some part of the country, whether here in the United States of America or some other place, and you were traveling through just a remote area of the country, and as you would drive through at night, it seems like it's just dark in any direction you could look, and you travel a little while, and maybe up on a hill, you'll see that there's some lights, and as you get closer and closer, there are more and more lights. As we traveled in Nevada back when I was a teenager, living there for a couple of years, often, you'll see some lights, and as you get closer and closer, there are more and  And you could travel just, I mean, miles and miles and miles and not see anyone or anything, but you would always, if you were traveling at night, you could see those little towns or cities. And Jesus says to the disciples, a city that is set on a hill cannot be hid because of its location and because of the light that would come from that particular city and the inhabitants of the city. Notice what he says in verse 15. I mean, this is simple logic that is getting conveyed to the disciples here. He says, neither do men light a candle and put it under a bushel, but on a candlestick. Why is it that you would light a candle? Now you say, well, I light a candle for fragrance. Well, that's because you have electricity. Amen. And if you don't have electricity, you light a candle for what purpose? Light. That's the purpose of lighting a candle. We find that there are times in which maybe we're dealing with some storm, maybe a particular hurricane or tornadoes enter to a particular region, and there are people that will get supplies so that they can deal with life without electricity. We're not very used to dealing with life without electricity, but we find that candles are a source of light. Someone said that crayons will burn. If you light them, they'll burn just like a candle, and they'll provide light. Now some of you are going to go home and test that and see if it works. And I've never tested it, but I've just been told that it works that way, that a crayon will burn like a candle. But you understand, if you're using a candle, think about the time in which Jesus is speaking to the disciples in the first century. He says this, neither do men light a candle and put it under a bushel, but on a candlestick. Why? Because the very purpose of lighting that candle is to give light. Not to cover it, but to give light. We sing with the kids, this little light of mine, I'm going to let it shine, let it shine, let it shine, let it shine, hide it under a bushel. No! Right? We understand as we would look at the logic here and the explanation that Jesus is giving. He says this, and it giveth light unto all that are in the house. What did it do? It fulfilled its purpose, right? You light the candle so that you can have light. You don't put it under a bushel, but you put it on a candlestick, and as you light that candle that is then placed on a candlestick, it gives light to those that are in that house, fulfilling the purpose. We find that Jesus then says in verse number 16, Let your light so shine. Notice what he says. How or where before men, why that they may see your good works and glorify your Father which is in heaven. What a great truth that we have in this portion of Scripture. This evening if I were to submit to you some points or thoughts with regard to this passage, I would say, first of all, that we have a role. Ye are the light of the world. That's a settled truth, amen? Jesus said to the disciples as he's speaking to them, ye are the light of the world. He did not say to the disciples, do you want to be the light of the world? He didn't say, would you like to sign up for this job to be the light of the world? No, he declared to them, ye are the light of the world. This is a role that we have. This is something that we must understand biblically and scripturally that Jesus has said to the disciples and I believe that as we have the preserved word of God, that we as the believers here in 2021, that Jesus would still say to us as his followers, as followers of Jesus Christ, that ye are the light of the world. He's not asking us to volunteer to be the light of the world. He's telling them that they are the light of the world. Now understanding your role does not mean that you're going to fulfill your role, right? We see that he declares to them what their role is. He says ye are the light of the world. He uses that logic and explanation that we just went over in those verses of scripture to help them understand what he means by this. And we understand this evening that as we would look at this truth that he says, you're the light of the world, therefore let your light so shine, he says, before men that they may see your good works and glorify your father, which is in heaven. This is the role that we have. The role that we have. I want you to hold your place here and turn to the book of Ephesians, if you will. To me, it seems like time gets blurred. I don't know how it is for you, but there are times in which I will make a statement in Ephesians chapter number five. I'll make a statement in which I'll say just a few months ago, such and such happened. And then I begin to look back at a calendar and find out that that was a couple of years ago. And I'm not sure how that works for you, but sometimes things just kind of get blurred in our minds. So it was a couple of years ago, I don't remember, I think it was in 2019, I might be wrong, but I preached through the book of Ephesians. As I preached through the book of Ephesians, the book of Ephesians is just a great book. I mean, obviously all of the Bible is just so wonderful, it's given to us, it's profitable for us. But the book of Ephesians is a book in which the apostle Paul is writing to these believers in this city and he's sharing with them and establishing for them their position in Christ in the first few chapters. And what a blessing to understand in those first few chapters of the book of Ephesians, chapters one, two and three, how that we have this position in Christ, that we are saved. We've been redeemed. In the first chapter, he goes through the truth with regard to the plan of redemption and the price of redemption and the proof of redemption. And he goes through and he just gives such powerful truth that is so precious to us today to help us understand our position in Christ. And I'm so thankful to be a child of the King, to be saved, to be redeemed. We then look at the last three chapters of the book of Ephesians and we find that it's here in these last few chapters that Paul is really saying to the believers at Ephesus, because of your position, this is how you should behave. The behavior that is detailed in chapters four, five and six of the book of Ephesians is not how to be saved or how to stay saved, it's the way that we live because we are saved. And that's what Paul deals with in this great book. I mentioned this morning about the roses. Somebody came in this morning and said, or this evening, and said, what roses are you talking about, pastor? And they said, are they white? I said, no, they're pink or red and they're over here. And I showed them this, oh, they are, they're so beautiful. But those roses, as I mentioned this morning, are the fruit, those roses are the evidence of life, right? They prove that there's life. The roots are providing the sustenance and the fruit is that rose. And so we find that as we come to Ephesians four, five and six, and looking here in chapter number five, that this is written to believers and saying to these believers that because you're saved, because we've established your position in Christ, this is how you should live your life. Notice in Ephesians five and verse number eight, he says, for ye were sometimes darkness. See, we were dead in our sins and our trespasses. We were in darkness, amen? But notice the next words, but now, but now, why? Because they had been saved. They had been converted. They had been redeemed. He says, but now are ye light in the Lord. And then notice what he tells them to do, walk as children of light. Walk as children of light. And so we notice that in the book of Ephesians, there are a number of references with regard to our walk in chapters four, five and six. And as we look at this particular one here in five, eight, we find that he says that we're to walk as children of light. There's a distinct difference between a child of darkness and a child of light, amen? We find that it was in Ephesians two, I read the portion this morning, but you find there was an Ephesians two, but he talked about the fact that we were fulfilling the desires of the flesh and of the mind. You understand the desires of the flesh are quite different than the desires of the spirit. And you understand that walking as a child of darkness is drastically different than walking as a child of light. And so Jesus says to his disciples, ye are the light of the world. For us, as we look to the book of Ephesians, we find that Paul now says to these believers in Ephesus that ye are, because you've been redeemed now, though you were in darkness, you've been redeemed. And so now ye are light in the Lord, therefore walk as children of light. light. Notice in the book of Philippians in chapter number 2, writing to another group of believers, the church at Philippi, we find here in Philippians chapter number 2 that Paul is encouraging these believers with regard to their role as being the light of the world. In Philippians 2 in verse number 15, notice what he says, that ye may be blameless and harmless. Notice what he says, the sons of God without rebuke in the midst of a crooked and perverse nation among whom ye shine as lights in the world. Oh yeah, we're in the midst of a crooked and perverse nation, are we not? I do not need to spend any time this evening to prove that point. I believe that we each here tonight, just by knowing a little bit of what's going on in our society, in our culture, we would readily acknowledge that we are living in the midst of a crooked and perverse nation. If you're not sure on that, see me afterwards and I'll help you. But the reality is that I want you to see the focus here that Paul says even though you're in the midst of a crooked and perverse nation, or maybe I should say it this way, not even though you are, but because you are, you're to shine as lights in the world. You're to shine as lights in the world. See this evening as we understand this truth from Matthew chapter number five when Jesus says to the disciples, ye are the light of the world, and then he says let your light so shine before men, we'd understand number one that we have a role. You have a role. He didn't ask you if you want it to be the light of the world. He simply told you that you are the light of the world. Number two, I would say this, we have a region. We have a region, an area, a sphere of influence, a place in which we let our light shine. What I mean by that is that when we come here collectively as a group of believers, as a body of saints that assemble in this particular church, we all come together within this building that God has graciously blessed us with, but then we leave this place, and as we leave this place, you have a region, you have an area, you have a place where you are to shine as a light. And we understand this evening that even as we would illustrate it with our map over here, and as we would think about the particular missionaries going to particular regions, one of the reasons specifically that I asked Brother Cook to put on there a button that would light up every one of those lights at the same time is really a twofold purpose. Number one, so that we could see where we have representation, but number two, so that we can see where we do not have representation. See, because there are some places that are represented on that map where we have, sometimes we have multiple missionaries in the same country, and that's not a bad thing. It's not to say that, well, that missionary or that country has one missionary they don't need anymore. I would never suggest that. What I'm saying is that there are some regions that don't have any light. And so when we think about this truth of having a role but then having a region, there are places in which you go that I don't go. There's a sphere of influence that you have that I don't have. There's a sphere of influence that I have that you don't have. I mentioned all of those lighthouses a moment ago, and the distances in which they shine. You think about the roles and responsibilities of the lighthouse keeper, and you go through that whole process, but you understand that they're placed where they are to shine in that region. The lighthouse in Hatteras isn't going to help a sailor in Rhode Island or, excuse me, in Connecticut or wherever up north, right? Maine. It's not going to help them. So there's got to be a lighthouse there. In fact, if you travel the eastern seaboard, you'll have the opportunity to see scores of lighthouses. Why? Because along the eastern seaboard, there were a lot of people that were traveling by ship back in the day coming to this country, and as they would come, they would need to have help with the terrain as they would navigate those waters. And so that lighthouse has a particular region. It has a particular area in which it is to serve, in which it is to provide those navigators, those sailors, with the information that were needed. In fact, we would find that as we think about this truth that we have a region, we'd be mindful of the disciples. Go to Acts 8, if you will, and I want you to see what the Word of God says about the disciples here in Acts chapter number 8. Now, we're familiar with the fact that persecution began for the first century saints right after the day of Pentecost, and after they had the privilege of being able to see so many saved, of course the enemy was ready to attack and ready to cause all sorts of problems, and the persecution began, the disciples were threatened, they were beaten, they were imprisoned, and all sorts of things took place. But we find that Jesus had given the responsibility to His disciples, His followers, to go into all the world and preach the gospel to every creature. In Acts, the Bible records it for us in Acts 1 and verse number 8, He says, after you receive power that you're to go, and He tells them that as they would go in the power of the Holy Spirit, that they were to go to Jerusalem, Judea, Samaria, and the uttermost part. They weren't supposed to just stay in Jerusalem. We find that here in Acts chapter number 8, the persecution against the church that was there in Jerusalem began to intensify, and really, as you look at the way in which it was intensifying, you find in verse number 3, the Bible says that as for Saul, he made havoc of the church, entering into every house and hailing men and women, committed them to prison. You see the persecution. But I want you to notice verse number 4. It says, therefore, they that were scattered abroad went, what are those next words, everywhere preaching the word. So effectively, you know what happened here in Acts chapter number 8? All of those lights that were in Jerusalem, those individual believers, right? You're the light of the world. We're using that this evening. We're understanding that truth. And so all of those believers that are individually, you're the light of the world, they were there in Jerusalem, and they were scattered abroad because of the persecution, and they went from Jerusalem, and they went out, and they went everywhere preaching the word, the particular region in which they were going to. And we find that here it says in verse number 5, then Philip went down to the city of Samaria and preached Christ unto them. The Bible tells us that there was great joy in that city in verse number 8. Why? Because the gospel came. People were getting saved. I mean, how wonderful and amazing this is. But we find that as some commentators have said, theologians of yesteryear, that Satan, the enemy, sought to stamp out the fire of the church in Jerusalem, and all that happened where the embers were spread across the globe. And really, that's what happened. Remember in just a few chapters into some of the missionary journeys here in the book of Acts, you'll find that they say of Paul that these have come here also that have turned the world upside down because they went everywhere preaching the word. So we understand this evening that we have a region. Look at Romans chapter number 15, if you will. Romans chapter 15. Notice what Paul says here. Paul's sharing here with these believers some truth with regard to his ministry and that which the Lord had called him to. But I want you to notice specifically what he says here in Romans 15 verses 19 and 20. He says this, \"...through mighty signs and wonders by the power of the Spirit of God, so that from Jerusalem and round about unto Illyricum I have fully preached the gospel of Christ. Yea, so have I strived to preach the gospel, not where Christ was named, lest I should build upon another man's foundation.\" So in other words, Paul didn't want to go pull up into this new town or this town where the gospel was and plant a church right next door to a church that was already there preaching the gospel. We've often talked about, I had a man call me a number of years ago, I don't remember exactly the year, I think it was 2013, and he got my name somehow. There was some contact that knew me and knew this guy. I didn't know the guy, but he gave me my name and he knew that we're living in Manassas at the time and knew that I pastored here in Oakton. He calls me all excited and tells me how he wants to pastor a church in Manassas. And he's going to go to Manassas and start a church. I said, man, I think that's wonderful. I said, but here's a list of pastors in Manassas that are faithfully preaching the gospel and I would recommend that you contact them. And also there are two churches in Manassas that I know of that don't have pastors. Perhaps you'd like to check one of those out. I wasn't trying to discourage the man from starting a church in Manassas if that's what God wanted him to do, but I was simply trying to help him understand that there were some churches already in Manassas doing what they're supposed to do. And yet we have other regions in America where there are no churches. And so it's just a matter of understanding logistically where we are and who's here and who's not here and how many. people are preaching the gospel and what have you, and so you understand here that Paul was saying that he went from Jerusalem into Illyricum and that he fully preached the gospel, but you see his heart and his mind was that he wanted to go where Christ was not named, lest he should build upon another man's foundation. And you think about the Apostle Paul and you think about his missionary journeys and you understand as he would go and be just a pioneer, if you will, and I understand some people aren't pioneers and they're not up for all of that, but you understand that Paul went and he preached the gospel and people were saved and it was amazing what God did in and through him. And this evening, we understand that we have a region, you have an area. See, when we think about this teaching that Jesus gave to the disciples in Matthew chapter number five, and he says you're the light of the world, and we understand that he would through the course of history, that he would allow the gospel to go around the globe through individual believers, followers of Jesus Christ, understanding and embracing their role that they are the light of the world. Understanding it and saying, that's my job, that's my role, that's my responsibility. And they would find that there was a particular region in which they were placed or located and they would say this is where I'm going to serve God and be a light. You hear all the time people say various places are hard. And what they mean by that is people, you know, there's a question that typically gets asked of missionaries. Brother Jared, I'm sure that as you were traveling with your family you probably heard your dad have this question asked a number of times, are the people receptive to the gospel? It seems like everybody wants to ask a missionary, are the people receptive to the gospel? And I understand the purpose of asking the question, I understand the reasoning, the logic, what we're trying to find out and discover, but you understand the gospel is confrontational. And you understand that as you would go, and some people say, oh that's a hard area, do you suggest that we don't need a light there because it's a hard area? Or perhaps we need more of a light there because it's a hard area. You know what we've done in America? If you do some some research, in fact there's a website, I don't even know if it's still up and running, I haven't checked it in a number of years, but it was called saltandlight.org, and on that particular website they would list cities around the United States of America along with their population and with the number of gospel preaching churches that were in those areas. You know what's an unfortunate reality in America is that gospel preaching churches, by the just scores of them, left the cities years ago. Now you still can find gospel preaching churches and cities, but lots of them left. And they left the cities because it was hard, because it was dangerous, because it was fill-in-the-blank, whatever it was. Brother Mershon, who many of you know, we find that Deborah gave a testimony about Mrs. Mershon at the ladies meeting there, and Brother Mershon tried for years to find someone that would go to San Diego and plant a church. He offered to help him, he offered all sorts of assistance to fill in and also go so many with him, so on and so forth, and it was years and years and years before he could find somebody that was willing to go to the city of San Diego to plant a church. In the city. Well, we're outside the city and we reach into the city. No, no, get in the city and be a light there. And so we find that God's plan through the course of history has been that his people are the light of the world. And were to go to our particular region for us here, it's northern Virginia. You know how many people tell me over the years, I've been here for almost 10 years, I can't even tell you how many times I've had somebody say to me, oh that's a hard area. People tell me that all the time. What does that mean? Does it mean that we just say, well, you know, us four are no more, we're gonna just hold on until Jesus comes back? No. This is where God's put us. Amen? And you're saying, I can't wait to leave. I hope that's not your hard attitude. If God moves you, that's one thing. But the reality is that God has placed us where he's placed us, and we're the light in this area. And this area needs the light. Amen? I said this, you have a role, we have a role, we have a region. And I would ask this question as a final thought this evening. It's a very direct question, and is this, are you fulfilling your responsibility? Am I fulfilling my responsibility? Individually, are we fulfilling the responsibility that we have been given? Collectively, as a church, are we fulfilling the responsibility that we have been given? This month is, apart from last year, has been the month in which every year we've had our missions conference. We kind of have a, obviously, missions emphasis year-round, but highlight and have as a big date on our calendar in the month of May, a missions conference. And we've often understood, and I've often preached over the years, that as we have the privilege of sending missionaries all around the globe, we must understand that we are the missionaries here in this community. The Bible says, as I referenced a moment ago, that truth in Acts 1 and verse number 8, and it's important to understand this, he says, but you shall receive power after that the Holy Ghost has come upon you, and you shall be witnesses unto me both in Jerusalem and in Judea and in Samaria and unto the uttermost part of the earth. The idea, when he says that you shall be witnesses unto me both in Jerusalem, Judea, Samaria, and the uttermost, is really what he's saying is at the same time. And so we're giving of our resources financially to send missionaries across the globe, and I'm so thankful for that, and it's a privilege to be able to give to missions. We, as a family, we give to missions regularly every month, missions giving, missions giving. Why? Because I believe it's important. I believe God blesses it, and I feel a great privilege to be able to support the work of missions. But you understand that it's more than just putting missions dollars in the plate to send a missionary to another country. It's you and it's me going across the street and being a missionary to our neighbor, being a missionary to the region, right? We have a role, but we have a region, we have an area. There's a place where God has planted us. There's a place in which God has given us a place to dwell, a home. There's a place in which God has put us to work and to fulfill that role. But we understand that God has us in that place, not just as fulfilling a duty and obligation as a worker, but understanding that we're a light. And oh, we must be careful and creative as to how we would share the gospel with those that we come into contact with, and especially when we're on the job and what have you, but what a great opportunity that God has given us. And we understand this evening, this role in this region, but the question is how are we doing with it? Are we fulfilling our responsibility? Are we letting our light so shine? As Jesus gave this command to his disciples in Matthew chapter 5, ye are the light of the world, verse 14, let your light so shine, verse 16. So if this is what you are, this is what you do. A light shines. Amen? If you come in here, we have 50 light bulbs in these chandeliers, and it's amazing. I'm going to make this statement, and this week I'll have to replace a light bulb, but it has been weeks, excuse me, it's been months. I mean, it's probably been a year and a half. I haven't had to replace one light bulb. Absolutely amazing. When I first got here, I was changing light bulbs every week, 50 of them. Dean walked in, I'm standing on top of the pew because I can reach him from standing on the pew. Why don't you have a ladder? Too much work, man. I got to just get this thing done. Don't get nervous. I don't do it anymore. I'm getting old. But the reality is that when the light is out, what do we do with it? Why do we replace it? Because a light is supposed to shine. Amen? And I'm not saying to you, I'm not suggesting that God's going to get rid of us, but I'm saying that we need to shine. That's what we're called to do. Ye are the light of the world, let your light so shine. What is it that would maybe prevent us from being the light that God has called us to be or he's told us that we are? I think about those roles that I mentioned of the lighthouse keeper and a couple of them in particular, the one of cleaning the lenses and the windows, and I think about the way in which our lens can become dirty. The way in which we can be affected and influenced by the world. You think about this truth, turn to the book of James, if you will, chapter number one. James chapter number one. I want you to notice what is said here. Here in v. 27, really the end of the verse, we'll read the entirety of the verse, but focus there with this thought on how it is that our lens can become dirty and our lens needs to be cleaned. It says in v. 27 of James 1, pure religion undefiled before God and the Father is this, to visit the fatherless and widows in their affliction, and to keep himself unspotted from the world. To keep himself unspotted from the world. I don't wear glasses, but I know some that wear glasses, and I've actually wore some sunglasses recently, and I put those sunglasses on, and I said, man, these lenses are filthy. They were dirty. I hadn't worn them in a long time. Man, they just had smudges all over them. It was hard to see through them. For those of you that wear glasses, you understand it can be annoying to have something on the lens. You want to clean that lens, right? And so you think about us as the light of the world and to let your light so shine. If we get spotted from the world, maybe our light's not shining like it should. If that lighthouse that we mentioned in the beginning there at Hatteras, it's to shine 20 miles out to sea, I would submit to you this evening that if there's dirt and debris and all sorts of things all over the lens and all over the glass there, it's not going to shine as far. It's just not going to work. You ever had a headlight on your automobile get frosted on the inside and it doesn't shine like it's supposed to? It needs to be clean. It needs to be taken care of so that it will shine like it's designed to shine. Not only here, but notice in 1 John 3. In John 3, and really, I believe, obviously, the chapter divisions and verses were added later, but really if you look at chapter 2 and verse 28 all the way down through chapter 3 and verse number 3, it's just a great portion of Scripture with regard to the coming of Christ. And let's read that entirety beginning in verse 28 of 1 John 2. It says, And now little children abide in Him, that when He shall appear, we may have confidence and not be ashamed before Him at His coming. If you know that He is righteous, so that everyone that doeth righteousness is born of Him, behold, what manner of love the Father hath bestowed upon us that we should be called the sons of God. Therefore the world knoweth us not, because it knew Him not. Beloved, now are we the sons of God, and it doth not yet appear what we shall be, but we know that when He shall appear, we shall be like Him, for we shall see Him as He is. And every man that hath this hope in him...\" That's what it says. \"...purifies himself even as he is pure.\" Desiring to stay clean. Desiring to live right. To walk as children of light as Paul said there in Ephesians 5 in verse number 8. We understand that we go in the power of the Holy Spirit filled with the Holy Spirit of God. We talked about the role of the lighthouse keeper to replenish the fuel. The reality is that we understand that we can grieve and quench the Holy Spirit of God. The children of Israel were said of this in Psalm 78 that the Bible says that they limited the Holy One of Israel. Have you ever considered how the limitless God can be limited? That's what the Bible says. The children of Israel, they limited the Holy One of Israel. How? Because of their unbelief. Their doubt. We think this evening of the way in which we would be filled with the Holy Spirit of God. Not quenching the Spirit. Not grieving the Spirit. Walking in the Spirit and having the power of the Holy Spirit that is mentioned in Acts chapter number 1 and verse number 8 that we'd be endued with that power being filled with the Holy Spirit of God. What a blessing as we go in the power of God and shine as lights in this dark world. I ask the question as our final point, are you fulfilling your responsibility? And I would say this on a very positive note that we'll use the example of John the Baptist and say that he fulfilled his responsibility. Turn to John 5 and verse number 35. John the Baptist is a man in which had a powerful ministry, a powerful impact. And I'm always and I say it not very often, but regularly I'll make the statement from John 3 and verse 30. He must increase and I must decrease. And that's one of those statements that John the Baptist makes that just sticks with you. And it's so appropriate for us, a motto, if you will, for our lives that we'd understand that even as Jesus said in Matthew chapter number 5 and verse number 16, let your light so shine before men that they may see your good works and do what glorify your father, which is in heaven. It's not so that we could be acknowledged or recognized and look at what this person. No, it's so that Jesus would be recognized and exalted so that the Lord would receive the glory that is due unto his name. And John said he must increase. I must decrease. But notice what Jesus says of John. John the Baptist, the Bible says this in verse number 33, it says he sent unto John and he bear witness unto the truth. But I receive not testimony from man, but these things I say that you might be saved. He, speaking of John the Baptist, was a burning and a shining light. And you're willing for a season to rejoice in his light. I just want you to think about that first phrase of verse number 35 and how the Lord Jesus Christ described John the Baptist. A burning and a shining light. And I want to be described that way. A burning and a shining light. This morning we spoke about Phoebe, our sister. We spoke about the particular qualities or observations that we made of of this servant of the Lord. She was converted and she was committed and she was compassionate. But the verse started with, I commend unto you, Phoebe, our sister, and I said that she was commended by Paul. I mean, how wonderful that Paul would rank that under the inspiration of the Holy Spirit of God. But we look here that God in flesh, the Lord Jesus Christ, when speaking about John the Baptist, he says of him that he was a burning and a shining light. Did John the Baptist have an easy ministry? No. I mean, did everyone like him? Say, man, come on over here, let's John the Baptist. No, he was beheaded. Right, and that's what happened. But Jesus said he was a burning and a shining light. Oh, this evening, this familiar passage of scripture in Matthew five, you're the light of the world. It's a familiar passage. We sing about it. But I wonder this evening. How are we doing on fulfilling the responsibility? See, I made the statement a few times already, but Jesus didn't say but Jesus didn't ask the disciples, would you like to be the light of the world? He simply said to the disciples, ye are the light of the world. And as such, we need to walk as children of light in the midst of a crooked and perverse generation. We shine as lights. And what a great privilege and opportunity that we have in this dark, dark day to shine as lights. Because we are the children of light. Let's pray, Father. This evening, we've looked at a familiar passage. But I pray that we've examined it with fresh eyes and a fresh heart. That we would. Have an honest evaluation. Of this role that has been assigned to us as your children. As we honestly evaluate our lives. That we would. Desire to have that testimony that John the Baptist had of being a burning and shining light. God, we cannot do it on our own, we readily acknowledge that we need you. I pray that you'd help us to be emptied of self. Filled with thy spirit. As we leave this place and enter into our region this week. Would you help us to be mindful of our role? Fulfill our responsibility. We'll give you the glory for all that you'll do. For it's in Christ's name we pray. Would you stand with us?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.039999961853027,
      "text": " through 16, and a very familiar passage of Scripture, and I hope this evening as we study"
    },
    {
      "id": 1,
      "start": 6.039999961853027,
      "end": 13.079999923706055,
      "text": " through this portion that we would have a renewed commitment to be what God has called"
    },
    {
      "id": 2,
      "start": 13.079999923706055,
      "end": 14.239999771118164,
      "text": " us to be."
    },
    {
      "id": 3,
      "start": 14.239999771118164,
      "end": 19.399999618530273,
      "text": " I believe that each one of us this evening could readily admit and acknowledge that we're"
    },
    {
      "id": 4,
      "start": 19.399999618530273,
      "end": 21.280000686645508,
      "text": " living in a very dark world."
    },
    {
      "id": 5,
      "start": 21.280000686645508,
      "end": 25.600000381469727,
      "text": " We're living in a time, as Paul described it when he was writing to Timothy, that we're"
    },
    {
      "id": 6,
      "start": 25.600000381469727,
      "end": 29.760000228881836,
      "text": " living in those last days and that perilous times would come."
    },
    {
      "id": 7,
      "start": 29.760000228881836,
      "end": 35.119998931884766,
      "text": " We understand that he further gave instruction to Timothy in the last book that he wrote,"
    },
    {
      "id": 8,
      "start": 35.119998931884766,
      "end": 40.040000915527344,
      "text": " 2 Timothy, in the fourth chapter, about the importance of preaching the Word of God and"
    },
    {
      "id": 9,
      "start": 40.040000915527344,
      "end": 44.20000076293945,
      "text": " sharing with Timothy that the time would come when men will not endure sound doctrine."
    },
    {
      "id": 10,
      "start": 44.20000076293945,
      "end": 50.439998626708984,
      "text": " And indeed, we're living in a time that was described even of Judah and Israel in the"
    },
    {
      "id": 11,
      "start": 50.439998626708984,
      "end": 55.720001220703125,
      "text": " Old Testament as a time in which they call evil good and good evil, a time in which they"
    },
    {
      "id": 12,
      "start": 55.720001220703125,
      "end": 62.119998931884766,
      "text": " legislate wickedness, but it is a time in which we have the unique privilege of embracing"
    },
    {
      "id": 13,
      "start": 62.119998931884766,
      "end": 68.0,
      "text": " the responsibility that has been entrusted to us and being the light that God has called"
    },
    {
      "id": 14,
      "start": 68.0,
      "end": 69.12000274658203,
      "text": " us to be."
    },
    {
      "id": 15,
      "start": 69.12000274658203,
      "end": 74.08000183105469,
      "text": " As you walk into our auditorium each and every time that you walk in, and I know for those"
    },
    {
      "id": 16,
      "start": 74.08000183105469,
      "end": 78.72000122070312,
      "text": " of us that maybe have just kind of gotten accustomed to it, we've been here for a length"
    },
    {
      "id": 17,
      "start": 78.72000122070312,
      "end": 83.5199966430664,
      "text": " of time, that we see as you walk in on the right-hand side, send the light, and there"
    },
    {
      "id": 18,
      "start": 83.5199966430664,
      "end": 89.36000061035156,
      "text": " are two lighthouses up there with the imagery that would be desiring to send the light to"
    },
    {
      "id": 19,
      "start": 89.36000061035156,
      "end": 95.5199966430664,
      "text": " the entire globe, to the entire world, that the light of the gospel of Jesus Christ would"
    },
    {
      "id": 20,
      "start": 95.5199966430664,
      "end": 99.27999877929688,
      "text": " go forth and shine forth brightly."
    },
    {
      "id": 21,
      "start": 99.27999877929688,
      "end": 104.04000091552734,
      "text": " As you look as you walk in on the left of our auditorium, you have this missions map"
    },
    {
      "id": 22,
      "start": 104.04000091552734,
      "end": 111.44000244140625,
      "text": " that back in 2012 we put that together, and it's interesting as you would begin to understand"
    },
    {
      "id": 23,
      "start": 111.44000244140625,
      "end": 117.08000183105469,
      "text": " the concepts behind this map and really the reasoning for why we laid it out the way that"
    },
    {
      "id": 24,
      "start": 117.08000183105469,
      "end": 123.12000274658203,
      "text": " we did, but you push one of those tiles and that light will light up to show the region"
    },
    {
      "id": 25,
      "start": 123.12000274658203,
      "end": 128.8800048828125,
      "text": " in which that particular missionary serves God and is seeking to take the gospel to that"
    },
    {
      "id": 26,
      "start": 128.8800048828125,
      "end": 130.9600067138672,
      "text": " part of the earth."
    },
    {
      "id": 27,
      "start": 130.9600067138672,
      "end": 136.39999389648438,
      "text": " And as we think about the light on the map and as you would push an individual tile and"
    },
    {
      "id": 28,
      "start": 136.39999389648438,
      "end": 142.16000366210938,
      "text": " you would see that little LED that travels through a fiber optic cable light up on that"
    },
    {
      "id": 29,
      "start": 142.16000366210938,
      "end": 148.0,
      "text": " map, that you would be reminded of not only the location but really the purpose in which"
    },
    {
      "id": 30,
      "start": 148.0,
      "end": 150.0,
      "text": " that missionary has been sent there."
    },
    {
      "id": 31,
      "start": 150.0,
      "end": 156.67999267578125,
      "text": " We do not send missionaries to go to various countries around the world to enjoy the climate"
    },
    {
      "id": 32,
      "start": 156.67999267578125,
      "end": 162.8800048828125,
      "text": " and to enjoy the beauty of the particular countries and to live a life of pleasure and"
    },
    {
      "id": 33,
      "start": 162.8800048828125,
      "end": 164.39999389648438,
      "text": " ease and vacation."
    },
    {
      "id": 34,
      "start": 164.39999389648438,
      "end": 170.44000244140625,
      "text": " No, we send them there, though they may enjoy some of those things, we send them there with"
    },
    {
      "id": 35,
      "start": 170.44000244140625,
      "end": 177.1199951171875,
      "text": " the express purpose of preaching the gospel of Jesus Christ to be the light that we are"
    },
    {
      "id": 36,
      "start": 177.1199951171875,
      "end": 178.36000061035156,
      "text": " called to be."
    },
    {
      "id": 37,
      "start": 178.36000061035156,
      "end": 185.60000610351562,
      "text": " Obviously, God will call some to go to a specific location, to go and to give their lives in"
    },
    {
      "id": 38,
      "start": 185.60000610351562,
      "end": 192.32000732421875,
      "text": " that particular arena and to be a full-time, if you will, Christian servant, but we find"
    },
    {
      "id": 39,
      "start": 192.32000732421875,
      "end": 198.0,
      "text": " that the Bible speaks of individual believers as being the light of the world."
    },
    {
      "id": 40,
      "start": 198.0,
      "end": 203.24000549316406,
      "text": " And as we would begin to look at this familiar passage of Scripture and we would acknowledge"
    },
    {
      "id": 41,
      "start": 203.24000549316406,
      "end": 208.36000061035156,
      "text": " the fact that we're living in a very dark world, we would also come to the conclusion"
    },
    {
      "id": 42,
      "start": 208.36000061035156,
      "end": 215.1999969482422,
      "text": " that it is absolutely imperative that at this moment we let our light shine."
    },
    {
      "id": 43,
      "start": 215.1999969482422,
      "end": 220.36000061035156,
      "text": " It's a dark world that we're living in and the light needs to shine brightly."
    },
    {
      "id": 44,
      "start": 220.39999389648438,
      "end": 226.1999969482422,
      "text": " If you've ever gone into a room that was dark, have you ever tried to navigate some steps"
    },
    {
      "id": 45,
      "start": 226.1999969482422,
      "end": 230.9600067138672,
      "text": " or some particular terrain and it's dark, what do you look for?"
    },
    {
      "id": 46,
      "start": 230.9600067138672,
      "end": 232.8000030517578,
      "text": " You want to have a light."
    },
    {
      "id": 47,
      "start": 232.8000030517578,
      "end": 237.72000122070312,
      "text": " And we give out those flashlight, the keychain flashlights, and we have those that we give"
    },
    {
      "id": 48,
      "start": 237.72000122070312,
      "end": 239.55999755859375,
      "text": " out regularly."
    },
    {
      "id": 49,
      "start": 239.55999755859375,
      "end": 244.16000366210938,
      "text": " And man, I was somewhere just the other day before we went on vacation, so a couple of"
    },
    {
      "id": 50,
      "start": 244.16000366210938,
      "end": 247.32000732421875,
      "text": " weeks ago, and I needed a light."
    },
    {
      "id": 51,
      "start": 247.32000732421875,
      "end": 251.47999572753906,
      "text": " It was dark in the room and I went to push that button to turn on the light and it was"
    },
    {
      "id": 52,
      "start": 251.47999572753906,
      "end": 252.47999572753906,
      "text": " dead."
    },
    {
      "id": 53,
      "start": 252.47999572753906,
      "end": 255.9199981689453,
      "text": " Man, that was unfortunate."
    },
    {
      "id": 54,
      "start": 255.9199981689453,
      "end": 262.760009765625,
      "text": " I could not complete the task that I set out to complete because I could not see what was"
    },
    {
      "id": 55,
      "start": 262.760009765625,
      "end": 263.760009765625,
      "text": " before me."
    },
    {
      "id": 56,
      "start": 263.760009765625,
      "end": 265.0,
      "text": " It was just too dark."
    },
    {
      "id": 57,
      "start": 265.0,
      "end": 266.55999755859375,
      "text": " I just couldn't navigate."
    },
    {
      "id": 58,
      "start": 266.55999755859375,
      "end": 270.7200012207031,
      "text": " I couldn't get to where I wanted to get to without a light."
    },
    {
      "id": 59,
      "start": 270.7200012207031,
      "end": 276.8399963378906,
      "text": " And as we think about the darkness in which we are living in and we think about the particular"
    },
    {
      "id": 60,
      "start": 276.8399963378906,
      "end": 282.4800109863281,
      "text": " culture and society in which we're faced with, we understand that God is not surprised"
    },
    {
      "id": 61,
      "start": 282.4800109863281,
      "end": 283.4800109863281,
      "text": " by any of these things."
    },
    {
      "id": 62,
      "start": 283.4800109863281,
      "end": 284.4800109863281,
      "text": " He knows."
    },
    {
      "id": 63,
      "start": 284.4800109863281,
      "end": 285.4800109863281,
      "text": " He knew."
    },
    {
      "id": 64,
      "start": 285.4800109863281,
      "end": 286.4800109863281,
      "text": " He's all-knowing."
    },
    {
      "id": 65,
      "start": 286.4800109863281,
      "end": 288.239990234375,
      "text": " He transcends time."
    },
    {
      "id": 66,
      "start": 288.239990234375,
      "end": 293.8399963378906,
      "text": " And so He provided a solution for this dark world, and that is that we are the light of"
    },
    {
      "id": 67,
      "start": 293.8399963378906,
      "end": 294.8399963378906,
      "text": " the world."
    },
    {
      "id": 68,
      "start": 294.8399963378906,
      "end": 299.7200012207031,
      "text": " Notice what it says in Matthew 5, verses 14 through 16."
    },
    {
      "id": 69,
      "start": 299.7200012207031,
      "end": 300.9200134277344,
      "text": " The Bible says this,"
    },
    {
      "id": 70,
      "start": 300.9200134277344,
      "end": 303.32000732421875,
      "text": " Ye are the light of the world."
    },
    {
      "id": 71,
      "start": 303.32000732421875,
      "end": 307.55999755859375,
      "text": " A city that is set on a hill cannot be hid."
    },
    {
      "id": 72,
      "start": 307.55999755859375,
      "end": 314.44000244140625,
      "text": " Neither do men light a candle and put it under a bushel, but on a candlestick."
    },
    {
      "id": 73,
      "start": 314.44000244140625,
      "end": 318.8800048828125,
      "text": " And it giveth light unto all that are in the house."
    },
    {
      "id": 74,
      "start": 318.8800048828125,
      "end": 326.1600036621094,
      "text": " Let your light so shine before men that they may see your good works and glorify your Father"
    },
    {
      "id": 75,
      "start": 326.1600036621094,
      "end": 327.739990234375,
      "text": " which is in heaven."
    },
    {
      "id": 76,
      "start": 327.7799987792969,
      "end": 332.0199890136719,
      "text": " I've titled the message this evening, You Are the Light of the World."
    },
    {
      "id": 77,
      "start": 332.0199890136719,
      "end": 338.6199951171875,
      "text": " We begin to think about these pictures and this imagery that we have on the walls of"
    },
    {
      "id": 78,
      "start": 338.6199951171875,
      "end": 343.82000732421875,
      "text": " our auditorium this evening, and as I think about those lighthouses to my left, to your"
    },
    {
      "id": 79,
      "start": 343.82000732421875,
      "end": 350.2200012207031,
      "text": " right, and I think about the lighthouse, and obviously we were in contact with lighthouses"
    },
    {
      "id": 80,
      "start": 350.2200012207031,
      "end": 354.7799987792969,
      "text": " when we were on vacation, and I began to think about and just kind of meditate upon and do"
    },
    {
      "id": 81,
      "start": 354.7799987792969,
      "end": 358.05999755859375,
      "text": " a little research about lighthouses."
    },
    {
      "id": 82,
      "start": 358.05999755859375,
      "end": 362.9800109863281,
      "text": " And I looked up what the roles and responsibilities were of the lighthouse keepers."
    },
    {
      "id": 83,
      "start": 362.9800109863281,
      "end": 367.260009765625,
      "text": " Now we understand today, with the technological advancements that have been made, that the"
    },
    {
      "id": 84,
      "start": 367.260009765625,
      "end": 372.5400085449219,
      "text": " roles and responsibilities have changed drastically over the years."
    },
    {
      "id": 85,
      "start": 372.5400085449219,
      "end": 382.3399963378906,
      "text": " But you understand the significant role that lighthouse keepers played in providing navigational"
    },
    {
      "id": 86,
      "start": 382.4200134277344,
      "end": 387.7799987792969,
      "text": " assistance to those that were traveling very difficult seas."
    },
    {
      "id": 87,
      "start": 387.7799987792969,
      "end": 393.17999267578125,
      "text": " And we find that these lighthouse keepers, they had the responsibilities to trim the"
    },
    {
      "id": 88,
      "start": 393.17999267578125,
      "end": 396.29998779296875,
      "text": " wicks, to replenish the fuel."
    },
    {
      "id": 89,
      "start": 396.29998779296875,
      "end": 402.6199951171875,
      "text": " Some of them, in fact, their fuel source, way back at the end of the 19th century, the"
    },
    {
      "id": 90,
      "start": 402.6199951171875,
      "end": 410.29998779296875,
      "text": " middle of the 19th century, many of the fuel sources were whale oil, and they would use"
    },
    {
      "id": 91,
      "start": 410.29998779296875,
      "end": 416.739990234375,
      "text": " various things, and they would have the responsibility of going and getting that fuel and ensuring"
    },
    {
      "id": 92,
      "start": 416.739990234375,
      "end": 423.5400085449219,
      "text": " that the fuel was replenished, that they did not run out of fuel at the wrong time."
    },
    {
      "id": 93,
      "start": 423.5400085449219,
      "end": 427.8800048828125,
      "text": " We find that they had the responsibility of winding the clockworks."
    },
    {
      "id": 94,
      "start": 427.8800048828125,
      "end": 434.6600036621094,
      "text": " We find that they had the responsibility of cleaning the lenses and the windows."
    },
    {
      "id": 95,
      "start": 434.6600036621094,
      "end": 439.739990234375,
      "text": " So you think about the lens and the window of those lights, and you think about the way"
    },
    {
      "id": 96,
      "start": 439.739990234375,
      "end": 445.7799987792969,
      "text": " in which it could get dirty from the environment, from those things that are going to affect it."
    },
    {
      "id": 97,
      "start": 445.7799987792969,
      "end": 452.5,
      "text": " You could understand how that a dirty lens or a dirty window would not allow for the"
    },
    {
      "id": 98,
      "start": 452.5,
      "end": 457.0199890136719,
      "text": " light to shine in the manner in which it's supposed to shine."
    },
    {
      "id": 99,
      "start": 457.0199890136719,
      "end": 460.7799987792969,
      "text": " And so these were some of the roles and responsibilities of these lighthouse keepers."
    },
    {
      "id": 100,
      "start": 460.7799987792969,
      "end": 465.3800048828125,
      "text": " I did some further research to think about some of those lighthouses that are down in"
    },
    {
      "id": 101,
      "start": 465.3800048828125,
      "end": 469.7799987792969,
      "text": " the Outer Banks region of North Carolina, and the Cape Hatteras Lighthouse, they say"
    },
    {
      "id": 102,
      "start": 469.7799987792969,
      "end": 474.1000061035156,
      "text": " that you can see it 20 miles out to sea."
    },
    {
      "id": 103,
      "start": 474.1000061035156,
      "end": 480.6600036621094,
      "text": " That's a long, long distance, but if you know anything about the sea and the topography,"
    },
    {
      "id": 104,
      "start": 480.6600036621094,
      "end": 489.1400146484375,
      "text": " if you will, of the sea on the coast of that part of North Carolina, many, many ships found"
    },
    {
      "id": 105,
      "start": 489.1400146484375,
      "end": 495.05999755859375,
      "text": " a fateful end because of those sandbars and the currents and all of the things that were"
    },
    {
      "id": 106,
      "start": 495.05999755859375,
      "end": 496.05999755859375,
      "text": " out there."
    },
    {
      "id": 107,
      "start": 496.05999755859375,
      "end": 497.94000244140625,
      "text": " So Cape Hatteras is a lighthouse there."
    },
    {
      "id": 108,
      "start": 497.94000244140625,
      "end": 500.17999267578125,
      "text": " It could be seen 20 miles out to sea."
    },
    {
      "id": 109,
      "start": 500.17999267578125,
      "end": 503.6199951171875,
      "text": " Ocracoke Lighthouse, 14 miles."
    },
    {
      "id": 110,
      "start": 503.6199951171875,
      "end": 505.94000244140625,
      "text": " Body Island Lighthouse, 19 miles."
    },
    {
      "id": 111,
      "start": 505.94000244140625,
      "end": 509.1000061035156,
      "text": " And Kuratuk, 18 miles."
    },
    {
      "id": 112,
      "start": 509.1000061035156,
      "end": 511.5,
      "text": " Those are long distances."
    },
    {
      "id": 113,
      "start": 511.5,
      "end": 516.8200073242188,
      "text": " You think about the light, and you think about the truth that God has given us, and we look"
    },
    {
      "id": 114,
      "start": 516.8200073242188,
      "end": 521.4199829101562,
      "text": " at some of those things in our world, and we see that I would use that as an illustration"
    },
    {
      "id": 115,
      "start": 521.4199829101562,
      "end": 528.9400024414062,
      "text": " this evening, because in our text, Jesus uses some basic logic with the disciples."
    },
    {
      "id": 116,
      "start": 528.9400024414062,
      "end": 533.5,
      "text": " He's speaking to the disciples, and He says to them in verse number 14,"
    },
    {
      "id": 117,
      "start": 533.5,
      "end": 536.02001953125,
      "text": " Ye are the light of the world."
    },
    {
      "id": 118,
      "start": 536.02001953125,
      "end": 538.5,
      "text": " Now that's a pretty simple statement, is it not?"
    },
    {
      "id": 119,
      "start": 538.5,
      "end": 544.5399780273438,
      "text": " I mean, there's not a whole lot of difficulty on the part of the reader to understand, on"
    },
    {
      "id": 120,
      "start": 544.5399780273438,
      "end": 548.8599853515625,
      "text": " the part of the recipient, to understand what Jesus was saying."
    },
    {
      "id": 121,
      "start": 548.8599853515625,
      "end": 550.9600219726562,
      "text": " Ye are the light of the world."
    },
    {
      "id": 122,
      "start": 551.0,
      "end": 557.5999755859375,
      "text": " But then notice the logic that Jesus uses when He's explaining to the disciples this"
    },
    {
      "id": 123,
      "start": 557.5999755859375,
      "end": 560.0,
      "text": " responsibility that they have."
    },
    {
      "id": 124,
      "start": 560.0,
      "end": 568.0800170898438,
      "text": " The Bible says this, a city that is set on a hill cannot be hid."
    },
    {
      "id": 125,
      "start": 568.0800170898438,
      "end": 574.1599731445312,
      "text": " Have you ever driven at night through maybe some part of the country, whether here in"
    },
    {
      "id": 126,
      "start": 574.1599731445312,
      "end": 578.6400146484375,
      "text": " the United States of America or some other place, and you were traveling through just"
    },
    {
      "id": 127,
      "start": 578.6400146484375,
      "end": 583.6799926757812,
      "text": " a remote area of the country, and as you would drive through at night, it seems like"
    },
    {
      "id": 128,
      "start": 583.6799926757812,
      "end": 588.2000122070312,
      "text": " it's just dark in any direction you could look, and you travel a little while, and maybe"
    },
    {
      "id": 129,
      "start": 588.2000122070312,
      "end": 592.2000122070312,
      "text": " up on a hill, you'll see that there's some lights, and as you get closer and closer,"
    },
    {
      "id": 130,
      "start": 592.2000122070312,
      "end": 593.760009765625,
      "text": " there are more and more lights."
    },
    {
      "id": 131,
      "start": 593.760009765625,
      "end": 599.47998046875,
      "text": " As we traveled in Nevada back when I was a teenager, living there for a couple of years,"
    },
    {
      "id": 132,
      "start": 599.47998046875,
      "end": 600.47998046875,
      "text": " often, you'll see some lights, and as you get closer and closer, there are more and"
    },
    {
      "id": 133,
      "start": 600.47998046875,
      "end": 600.47998046875,
      "text": ""
    },
    {
      "id": 0,
      "start": 600.47998046875,
      "end": 606.8399806022644,
      "text": " And you could travel just, I mean, miles and miles and miles and not see anyone or anything,"
    },
    {
      "id": 1,
      "start": 606.8399806022644,
      "end": 611.019980430603,
      "text": " but you would always, if you were traveling at night, you could see those little towns"
    },
    {
      "id": 2,
      "start": 611.019980430603,
      "end": 612.519980430603,
      "text": " or cities."
    },
    {
      "id": 3,
      "start": 612.519980430603,
      "end": 620.5999813079834,
      "text": " And Jesus says to the disciples, a city that is set on a hill cannot be hid because of"
    },
    {
      "id": 4,
      "start": 620.5999813079834,
      "end": 625.9599800109863,
      "text": " its location and because of the light that would come from that particular city and the"
    },
    {
      "id": 5,
      "start": 625.9599800109863,
      "end": 627.5999813079834,
      "text": " inhabitants of the city."
    },
    {
      "id": 6,
      "start": 627.5999813079834,
      "end": 628.5999813079834,
      "text": " Notice what he says in verse 15."
    },
    {
      "id": 7,
      "start": 628.7199802398682,
      "end": 635.6799812316895,
      "text": " I mean, this is simple logic that is getting conveyed to the disciples here."
    },
    {
      "id": 8,
      "start": 635.6799812316895,
      "end": 643.5199813842773,
      "text": " He says, neither do men light a candle and put it under a bushel, but on a candlestick."
    },
    {
      "id": 9,
      "start": 643.5199813842773,
      "end": 645.3599815368652,
      "text": " Why is it that you would light a candle?"
    },
    {
      "id": 10,
      "start": 645.3599815368652,
      "end": 647.3199806213379,
      "text": " Now you say, well, I light a candle for fragrance."
    },
    {
      "id": 11,
      "start": 647.3199806213379,
      "end": 649.2799797058105,
      "text": " Well, that's because you have electricity."
    },
    {
      "id": 12,
      "start": 649.2799797058105,
      "end": 650.2799797058105,
      "text": " Amen."
    },
    {
      "id": 13,
      "start": 650.2799797058105,
      "end": 654.4399795532227,
      "text": " And if you don't have electricity, you light a candle for what purpose?"
    },
    {
      "id": 14,
      "start": 654.4399795532227,
      "end": 655.8799819946289,
      "text": " Light."
    },
    {
      "id": 15,
      "start": 655.8799819946289,
      "end": 658.7199821472168,
      "text": " That's the purpose of lighting a candle."
    },
    {
      "id": 16,
      "start": 658.7199821472168,
      "end": 666.6399841308594,
      "text": " We find that there are times in which maybe we're dealing with some storm, maybe a particular"
    },
    {
      "id": 17,
      "start": 666.6399841308594,
      "end": 671.0799789428711,
      "text": " hurricane or tornadoes enter to a particular region, and there are people that will get"
    },
    {
      "id": 18,
      "start": 671.0799789428711,
      "end": 675.6399841308594,
      "text": " supplies so that they can deal with life without electricity."
    },
    {
      "id": 19,
      "start": 675.6399841308594,
      "end": 680.5199813842773,
      "text": " We're not very used to dealing with life without electricity, but we find that candles are"
    },
    {
      "id": 20,
      "start": 680.5199813842773,
      "end": 682.1399841308594,
      "text": " a source of light."
    },
    {
      "id": 21,
      "start": 682.1399841308594,
      "end": 684.859977722168,
      "text": " Someone said that crayons will burn."
    },
    {
      "id": 22,
      "start": 684.859977722168,
      "end": 688.2599792480469,
      "text": " If you light them, they'll burn just like a candle, and they'll provide light."
    },
    {
      "id": 23,
      "start": 688.2599792480469,
      "end": 691.6599807739258,
      "text": " Now some of you are going to go home and test that and see if it works."
    },
    {
      "id": 24,
      "start": 691.6599807739258,
      "end": 696.5799789428711,
      "text": " And I've never tested it, but I've just been told that it works that way, that a crayon"
    },
    {
      "id": 25,
      "start": 696.5799789428711,
      "end": 698.3399810791016,
      "text": " will burn like a candle."
    },
    {
      "id": 26,
      "start": 698.3399810791016,
      "end": 702.5799789428711,
      "text": " But you understand, if you're using a candle, think about the time in which Jesus is speaking"
    },
    {
      "id": 27,
      "start": 702.5799789428711,
      "end": 704.6199798583984,
      "text": " to the disciples in the first century."
    },
    {
      "id": 28,
      "start": 704.6199798583984,
      "end": 709.8999786376953,
      "text": " He says this, neither do men light a candle and put it under a bushel, but on a candlestick."
    },
    {
      "id": 29,
      "start": 709.8999786376953,
      "end": 710.8999786376953,
      "text": " Why?"
    },
    {
      "id": 30,
      "start": 710.8999786376953,
      "end": 714.5799789428711,
      "text": " Because the very purpose of lighting that candle is to give light."
    },
    {
      "id": 31,
      "start": 714.5799789428711,
      "end": 718.3799819946289,
      "text": " Not to cover it, but to give light."
    },
    {
      "id": 32,
      "start": 718.3799819946289,
      "end": 722.3399810791016,
      "text": " We sing with the kids, this little light of mine, I'm going to let it shine, let it shine,"
    },
    {
      "id": 33,
      "start": 722.3399810791016,
      "end": 725.9399795532227,
      "text": " let it shine, let it shine, hide it under a bushel."
    },
    {
      "id": 34,
      "start": 725.9399795532227,
      "end": 727.3399810791016,
      "text": " No!"
    },
    {
      "id": 35,
      "start": 727.3399810791016,
      "end": 728.8599853515625,
      "text": " Right?"
    },
    {
      "id": 36,
      "start": 728.8599853515625,
      "end": 734.0199737548828,
      "text": " We understand as we would look at the logic here and the explanation that Jesus is giving."
    },
    {
      "id": 37,
      "start": 734.0199737548828,
      "end": 740.4999847412109,
      "text": " He says this, and it giveth light unto all that are in the house."
    },
    {
      "id": 38,
      "start": 740.4999847412109,
      "end": 741.7799835205078,
      "text": " What did it do?"
    },
    {
      "id": 39,
      "start": 741.7799835205078,
      "end": 744.8599853515625,
      "text": " It fulfilled its purpose, right?"
    },
    {
      "id": 40,
      "start": 744.8599853515625,
      "end": 747.6599731445312,
      "text": " You light the candle so that you can have light."
    },
    {
      "id": 41,
      "start": 747.6599731445312,
      "end": 752.97998046875,
      "text": " You don't put it under a bushel, but you put it on a candlestick, and as you light that"
    },
    {
      "id": 42,
      "start": 752.97998046875,
      "end": 760.4599761962891,
      "text": " candle that is then placed on a candlestick, it gives light to those that are in that house,"
    },
    {
      "id": 43,
      "start": 760.4599761962891,
      "end": 762.5999755859375,
      "text": " fulfilling the purpose."
    },
    {
      "id": 44,
      "start": 762.5999755859375,
      "end": 766.9199829101562,
      "text": " We find that Jesus then says in verse number 16,"
    },
    {
      "id": 45,
      "start": 766.9199829101562,
      "end": 770.6799774169922,
      "text": " Let your light so shine."
    },
    {
      "id": 46,
      "start": 770.6799774169922,
      "end": 772.7599792480469,
      "text": " Notice what he says."
    },
    {
      "id": 47,
      "start": 772.7599792480469,
      "end": 783.2399749755859,
      "text": " How or where before men, why that they may see your good works and glorify your Father"
    },
    {
      "id": 48,
      "start": 783.2399749755859,
      "end": 785.5599822998047,
      "text": " which is in heaven."
    },
    {
      "id": 49,
      "start": 785.5599822998047,
      "end": 791.2799835205078,
      "text": " What a great truth that we have in this portion of Scripture."
    },
    {
      "id": 50,
      "start": 791.2799835205078,
      "end": 796.5599822998047,
      "text": " This evening if I were to submit to you some points or thoughts with regard to this passage,"
    },
    {
      "id": 51,
      "start": 796.5599822998047,
      "end": 800.1999816894531,
      "text": " I would say, first of all, that we have a role."
    },
    {
      "id": 52,
      "start": 800.1999816894531,
      "end": 802.9599761962891,
      "text": " Ye are the light of the world."
    },
    {
      "id": 53,
      "start": 802.9599761962891,
      "end": 805.7599792480469,
      "text": " That's a settled truth, amen?"
    },
    {
      "id": 54,
      "start": 805.7599792480469,
      "end": 809.9999847412109,
      "text": " Jesus said to the disciples as he's speaking to them, ye are the light of the world."
    },
    {
      "id": 55,
      "start": 809.9999847412109,
      "end": 815.6399841308594,
      "text": " He did not say to the disciples, do you want to be the light of the world?"
    },
    {
      "id": 56,
      "start": 815.6399841308594,
      "end": 820.9999847412109,
      "text": " He didn't say, would you like to sign up for this job to be the light of the world?"
    },
    {
      "id": 57,
      "start": 820.9999847412109,
      "end": 829.0399780273438,
      "text": " No, he declared to them, ye are the light of the world."
    },
    {
      "id": 58,
      "start": 829.0399780273438,
      "end": 830.6399841308594,
      "text": " This is a role that we have."
    },
    {
      "id": 59,
      "start": 830.6399841308594,
      "end": 836.4399871826172,
      "text": " This is something that we must understand biblically and scripturally that Jesus has"
    },
    {
      "id": 60,
      "start": 836.4399871826172,
      "end": 840.9599761962891,
      "text": " said to the disciples and I believe that as we have the preserved word of God, that we"
    },
    {
      "id": 61,
      "start": 840.9599761962891,
      "end": 848.0399780273438,
      "text": " as the believers here in 2021, that Jesus would still say to us as his followers, as"
    },
    {
      "id": 62,
      "start": 848.0399780273438,
      "end": 853.7199859619141,
      "text": " followers of Jesus Christ, that ye are the light of the world."
    },
    {
      "id": 63,
      "start": 853.7199859619141,
      "end": 857.5599670410156,
      "text": " He's not asking us to volunteer to be the light of the world."
    },
    {
      "id": 64,
      "start": 857.5599670410156,
      "end": 861.6799926757812,
      "text": " He's telling them that they are the light of the world."
    },
    {
      "id": 65,
      "start": 861.6799926757812,
      "end": 871.3199768066406,
      "text": " Now understanding your role does not mean that you're going to fulfill your role, right?"
    },
    {
      "id": 66,
      "start": 871.3199768066406,
      "end": 875.8799743652344,
      "text": " We see that he declares to them what their role is."
    },
    {
      "id": 67,
      "start": 875.8799743652344,
      "end": 877.4399719238281,
      "text": " He says ye are the light of the world."
    },
    {
      "id": 68,
      "start": 877.4399719238281,
      "end": 883.2799682617188,
      "text": " He uses that logic and explanation that we just went over in those verses of scripture"
    },
    {
      "id": 69,
      "start": 883.2799682617188,
      "end": 886.5199890136719,
      "text": " to help them understand what he means by this."
    },
    {
      "id": 70,
      "start": 886.5199890136719,
      "end": 890.5999755859375,
      "text": " And we understand this evening that as we would look at this truth that he says, you're"
    },
    {
      "id": 71,
      "start": 890.5999755859375,
      "end": 897.9199829101562,
      "text": " the light of the world, therefore let your light so shine, he says, before men that they"
    },
    {
      "id": 72,
      "start": 897.9199829101562,
      "end": 903.3999938964844,
      "text": " may see your good works and glorify your father, which is in heaven."
    },
    {
      "id": 73,
      "start": 903.3999938964844,
      "end": 906.3999938964844,
      "text": " This is the role that we have."
    },
    {
      "id": 74,
      "start": 906.3999938964844,
      "end": 907.3999938964844,
      "text": " The role that we have."
    },
    {
      "id": 75,
      "start": 907.3999938964844,
      "end": 914.3199768066406,
      "text": " I want you to hold your place here and turn to the book of Ephesians, if you will."
    },
    {
      "id": 76,
      "start": 914.3199768066406,
      "end": 920.0399780273438,
      "text": " To me, it seems like time gets blurred."
    },
    {
      "id": 77,
      "start": 920.0399780273438,
      "end": 924.8799743652344,
      "text": " I don't know how it is for you, but there are times in which I will make a statement"
    },
    {
      "id": 78,
      "start": 924.8799743652344,
      "end": 926.5999755859375,
      "text": " in Ephesians chapter number five."
    },
    {
      "id": 79,
      "start": 926.5999755859375,
      "end": 932.1999816894531,
      "text": " I'll make a statement in which I'll say just a few months ago, such and such happened."
    },
    {
      "id": 80,
      "start": 932.1999816894531,
      "end": 935.4399719238281,
      "text": " And then I begin to look back at a calendar and find out that that was a couple of years"
    },
    {
      "id": 81,
      "start": 935.4399719238281,
      "end": 936.6799926757812,
      "text": " ago."
    },
    {
      "id": 82,
      "start": 936.6799926757812,
      "end": 940.8399658203125,
      "text": " And I'm not sure how that works for you, but sometimes things just kind of get blurred"
    },
    {
      "id": 83,
      "start": 940.8399658203125,
      "end": 942.8399658203125,
      "text": " in our minds."
    },
    {
      "id": 84,
      "start": 942.8399658203125,
      "end": 947.3999938964844,
      "text": " So it was a couple of years ago, I don't remember, I think it was in 2019, I might"
    },
    {
      "id": 85,
      "start": 947.3999938964844,
      "end": 951.5199890136719,
      "text": " be wrong, but I preached through the book of Ephesians."
    },
    {
      "id": 86,
      "start": 951.5199890136719,
      "end": 955.1999816894531,
      "text": " As I preached through the book of Ephesians, the book of Ephesians is just a great book."
    },
    {
      "id": 87,
      "start": 955.1999816894531,
      "end": 959.9999694824219,
      "text": " I mean, obviously all of the Bible is just so wonderful, it's given to us, it's profitable"
    },
    {
      "id": 88,
      "start": 959.9999694824219,
      "end": 960.9999694824219,
      "text": " for us."
    },
    {
      "id": 89,
      "start": 960.9999694824219,
      "end": 966.6799926757812,
      "text": " But the book of Ephesians is a book in which the apostle Paul is writing to these believers"
    },
    {
      "id": 90,
      "start": 966.6799926757812,
      "end": 974.5199890136719,
      "text": " in this city and he's sharing with them and establishing for them their position in Christ"
    },
    {
      "id": 91,
      "start": 974.5199890136719,
      "end": 976.239990234375,
      "text": " in the first few chapters."
    },
    {
      "id": 92,
      "start": 976.239990234375,
      "end": 982.9199829101562,
      "text": " And what a blessing to understand in those first few chapters of the book of Ephesians,"
    },
    {
      "id": 93,
      "start": 982.9199829101562,
      "end": 990.2799682617188,
      "text": " chapters one, two and three, how that we have this position in Christ, that we are saved."
    },
    {
      "id": 94,
      "start": 990.5599670410156,
      "end": 991.5599670410156,
      "text": " We've been redeemed."
    },
    {
      "id": 95,
      "start": 991.5599670410156,
      "end": 997.2799682617188,
      "text": " In the first chapter, he goes through the truth with regard to the plan of redemption"
    },
    {
      "id": 96,
      "start": 997.2799682617188,
      "end": 1001.0399780273438,
      "text": " and the price of redemption and the proof of redemption."
    },
    {
      "id": 97,
      "start": 1001.0399780273438,
      "end": 1006.9599914550781,
      "text": " And he goes through and he just gives such powerful truth that is so precious to us today"
    },
    {
      "id": 98,
      "start": 1006.9599914550781,
      "end": 1011.239990234375,
      "text": " to help us understand our position in Christ."
    },
    {
      "id": 99,
      "start": 1011.239990234375,
      "end": 1017.3799743652344,
      "text": " And I'm so thankful to be a child of the King, to be saved, to be redeemed."
    },
    {
      "id": 100,
      "start": 1017.3799743652344,
      "end": 1022.0599670410156,
      "text": " We then look at the last three chapters of the book of Ephesians and we find that it's"
    },
    {
      "id": 101,
      "start": 1022.0599670410156,
      "end": 1027.8599853515625,
      "text": " here in these last few chapters that Paul is really saying to the believers at Ephesus,"
    },
    {
      "id": 102,
      "start": 1027.8599853515625,
      "end": 1033.3799743652344,
      "text": " because of your position, this is how you should behave."
    },
    {
      "id": 103,
      "start": 1033.3799743652344,
      "end": 1038.2999877929688,
      "text": " The behavior that is detailed in chapters four, five and six of the book of Ephesians"
    },
    {
      "id": 104,
      "start": 1038.2999877929688,
      "end": 1046.7999877929688,
      "text": " is not how to be saved or how to stay saved, it's the way that we live because we are saved."
    },
    {
      "id": 105,
      "start": 1046.7999877929688,
      "end": 1048.6399841308594,
      "text": " And that's what Paul deals with in this great book."
    },
    {
      "id": 106,
      "start": 1048.6399841308594,
      "end": 1050.3999938964844,
      "text": " I mentioned this morning about the roses."
    },
    {
      "id": 107,
      "start": 1050.3999938964844,
      "end": 1053.5199890136719,
      "text": " Somebody came in this morning and said, or this evening, and said, what roses are you"
    },
    {
      "id": 108,
      "start": 1053.5199890136719,
      "end": 1055.2799682617188,
      "text": " talking about, pastor?"
    },
    {
      "id": 109,
      "start": 1055.2799682617188,
      "end": 1056.9599914550781,
      "text": " And they said, are they white?"
    },
    {
      "id": 110,
      "start": 1056.9599914550781,
      "end": 1059.5199890136719,
      "text": " I said, no, they're pink or red and they're over here."
    },
    {
      "id": 111,
      "start": 1059.5199890136719,
      "end": 1062.6799926757812,
      "text": " And I showed them this, oh, they are, they're so beautiful."
    },
    {
      "id": 112,
      "start": 1062.6799926757812,
      "end": 1068.9199829101562,
      "text": " But those roses, as I mentioned this morning, are the fruit, those roses are the evidence"
    },
    {
      "id": 113,
      "start": 1068.9199829101562,
      "end": 1072.0399780273438,
      "text": " of life, right?"
    },
    {
      "id": 114,
      "start": 1072.0399780273438,
      "end": 1074.2799682617188,
      "text": " They prove that there's life."
    },
    {
      "id": 115,
      "start": 1074.2799682617188,
      "end": 1078.1999816894531,
      "text": " The roots are providing the sustenance and the fruit is that rose."
    },
    {
      "id": 116,
      "start": 1078.1999816894531,
      "end": 1082.3599853515625,
      "text": " And so we find that as we come to Ephesians four, five and six, and looking here in chapter"
    },
    {
      "id": 117,
      "start": 1082.3599853515625,
      "end": 1089.6399841308594,
      "text": " number five, that this is written to believers and saying to these believers that because"
    },
    {
      "id": 118,
      "start": 1089.6399841308594,
      "end": 1093.9199829101562,
      "text": " you're saved, because we've established your position in Christ, this is how you should"
    },
    {
      "id": 119,
      "start": 1093.9199829101562,
      "end": 1095.8399658203125,
      "text": " live your life."
    },
    {
      "id": 120,
      "start": 1096.1999816894531,
      "end": 1103.6399841308594,
      "text": " Notice in Ephesians five and verse number eight, he says, for ye were sometimes darkness."
    },
    {
      "id": 121,
      "start": 1103.6399841308594,
      "end": 1106.8399658203125,
      "text": " See, we were dead in our sins and our trespasses."
    },
    {
      "id": 122,
      "start": 1106.8399658203125,
      "end": 1110.4599914550781,
      "text": " We were in darkness, amen?"
    },
    {
      "id": 123,
      "start": 1110.4599914550781,
      "end": 1115.9199829101562,
      "text": " But notice the next words, but now, but now, why?"
    },
    {
      "id": 124,
      "start": 1115.9199829101562,
      "end": 1116.9199829101562,
      "text": " Because they had been saved."
    },
    {
      "id": 125,
      "start": 1116.9199829101562,
      "end": 1117.9199829101562,
      "text": " They had been converted."
    },
    {
      "id": 126,
      "start": 1117.9199829101562,
      "end": 1119.8399658203125,
      "text": " They had been redeemed."
    },
    {
      "id": 127,
      "start": 1119.8399658203125,
      "end": 1125.5599975585938,
      "text": " He says, but now are ye light in the Lord."
    },
    {
      "id": 128,
      "start": 1125.5599975585938,
      "end": 1131.47998046875,
      "text": " And then notice what he tells them to do, walk as children of light."
    },
    {
      "id": 129,
      "start": 1131.47998046875,
      "end": 1133.3599853515625,
      "text": " Walk as children of light."
    },
    {
      "id": 130,
      "start": 1133.3599853515625,
      "end": 1138.3200073242188,
      "text": " And so we notice that in the book of Ephesians, there are a number of references with regard"
    },
    {
      "id": 131,
      "start": 1138.3200073242188,
      "end": 1141.6799926757812,
      "text": " to our walk in chapters four, five and six."
    },
    {
      "id": 132,
      "start": 1141.6799926757812,
      "end": 1145.760009765625,
      "text": " And as we look at this particular one here in five, eight, we find that he says that"
    },
    {
      "id": 133,
      "start": 1145.760009765625,
      "end": 1148.9199829101562,
      "text": " we're to walk as children of light."
    },
    {
      "id": 134,
      "start": 1148.9199829101562,
      "end": 1154.6399536132812,
      "text": " There's a distinct difference between a child of darkness and a child of light, amen?"
    },
    {
      "id": 135,
      "start": 1154.6399536132812,
      "end": 1158.6399536132812,
      "text": " We find that it was in Ephesians two, I read the portion this morning, but you find there"
    },
    {
      "id": 136,
      "start": 1158.6399536132812,
      "end": 1164.199951171875,
      "text": " was an Ephesians two, but he talked about the fact that we were fulfilling the desires"
    },
    {
      "id": 137,
      "start": 1164.199951171875,
      "end": 1166.1199951171875,
      "text": " of the flesh and of the mind."
    },
    {
      "id": 138,
      "start": 1166.1199951171875,
      "end": 1171.6399536132812,
      "text": " You understand the desires of the flesh are quite different than the desires of the spirit."
    },
    {
      "id": 139,
      "start": 1171.6399536132812,
      "end": 1176.5599975585938,
      "text": " And you understand that walking as a child of darkness is drastically different than"
    },
    {
      "id": 140,
      "start": 1176.5599975585938,
      "end": 1178.3999633789062,
      "text": " walking as a child of light."
    },
    {
      "id": 141,
      "start": 1178.3999633789062,
      "end": 1182.9599609375,
      "text": " And so Jesus says to his disciples, ye are the light of the world."
    },
    {
      "id": 142,
      "start": 1182.9599609375,
      "end": 1187.760009765625,
      "text": " For us, as we look to the book of Ephesians, we find that Paul now says to these believers"
    },
    {
      "id": 143,
      "start": 1187.760009765625,
      "end": 1194.5199584960938,
      "text": " in Ephesus that ye are, because you've been redeemed now, though you were in darkness,"
    },
    {
      "id": 144,
      "start": 1194.5199584960938,
      "end": 1195.5999755859375,
      "text": " you've been redeemed."
    },
    {
      "id": 145,
      "start": 1195.5999755859375,
      "end": 1200.47998046875,
      "text": " And so now ye are light in the Lord, therefore walk as children of light."
    },
    {
      "id": 0,
      "start": 1200.47998046875,
      "end": 1205.819980621338,
      "text": " light. Notice in the book of Philippians in chapter number 2, writing to another"
    },
    {
      "id": 1,
      "start": 1205.819980621338,
      "end": 1210.1999807357788,
      "text": " group of believers, the church at Philippi, we find here in Philippians"
    },
    {
      "id": 2,
      "start": 1210.1999807357788,
      "end": 1215.359980583191,
      "text": " chapter number 2 that Paul is encouraging these believers with regard"
    },
    {
      "id": 3,
      "start": 1215.359980583191,
      "end": 1220.4399795532227,
      "text": " to their role as being the light of the world. In Philippians 2 in verse number"
    },
    {
      "id": 4,
      "start": 1220.4399795532227,
      "end": 1226.7999801635742,
      "text": " 15, notice what he says, that ye may be blameless and harmless. Notice what he"
    },
    {
      "id": 5,
      "start": 1226.7999801635742,
      "end": 1233.819980621338,
      "text": " says, the sons of God without rebuke in the midst of a crooked and perverse"
    },
    {
      "id": 6,
      "start": 1233.819980621338,
      "end": 1242.4599800109863,
      "text": " nation among whom ye shine as lights in the world. Oh yeah, we're in the midst of"
    },
    {
      "id": 7,
      "start": 1242.4599800109863,
      "end": 1248.4599800109863,
      "text": " a crooked and perverse nation, are we not? I do not need to spend any time this"
    },
    {
      "id": 8,
      "start": 1248.4599800109863,
      "end": 1253.579978942871,
      "text": " evening to prove that point. I believe that we each here tonight, just by"
    },
    {
      "id": 9,
      "start": 1253.579978942871,
      "end": 1256.6999816894531,
      "text": " knowing a little bit of what's going on in our society, in our culture, we would"
    },
    {
      "id": 10,
      "start": 1256.6999816894531,
      "end": 1260.819980621338,
      "text": " readily acknowledge that we are living in the midst of a crooked and perverse"
    },
    {
      "id": 11,
      "start": 1260.819980621338,
      "end": 1266.1799774169922,
      "text": " nation. If you're not sure on that, see me afterwards and I'll help you. But the"
    },
    {
      "id": 12,
      "start": 1266.1799774169922,
      "end": 1271.7399826049805,
      "text": " reality is that I want you to see the focus here that Paul says even though"
    },
    {
      "id": 13,
      "start": 1271.7399826049805,
      "end": 1276.4199829101562,
      "text": " you're in the midst of a crooked and perverse nation, or maybe I should say it"
    },
    {
      "id": 14,
      "start": 1276.4199829101562,
      "end": 1281.9399795532227,
      "text": " this way, not even though you are, but because you are, you're to shine as"
    },
    {
      "id": 15,
      "start": 1282.2599792480469,
      "end": 1289.1799774169922,
      "text": " lights in the world. You're to shine as lights in the world. See this evening as we"
    },
    {
      "id": 16,
      "start": 1289.1799774169922,
      "end": 1293.6999816894531,
      "text": " understand this truth from Matthew chapter number five when Jesus says to"
    },
    {
      "id": 17,
      "start": 1293.6999816894531,
      "end": 1297.97998046875,
      "text": " the disciples, ye are the light of the world, and then he says let your light so"
    },
    {
      "id": 18,
      "start": 1297.97998046875,
      "end": 1304.7799835205078,
      "text": " shine before men, we'd understand number one that we have a role. You have a role."
    },
    {
      "id": 19,
      "start": 1304.97998046875,
      "end": 1309.4599838256836,
      "text": " He didn't ask you if you want it to be the light of the world. He simply told"
    },
    {
      "id": 20,
      "start": 1309.4599838256836,
      "end": 1315.379981994629,
      "text": " you that you are the light of the world. Number two, I would say this, we have a"
    },
    {
      "id": 21,
      "start": 1315.379981994629,
      "end": 1324.1799774169922,
      "text": " region. We have a region, an area, a sphere of influence, a place in which we let our"
    },
    {
      "id": 22,
      "start": 1324.1799774169922,
      "end": 1330.1799774169922,
      "text": " light shine. What I mean by that is that when we come here collectively as a"
    },
    {
      "id": 23,
      "start": 1330.1799774169922,
      "end": 1337.2999877929688,
      "text": " group of believers, as a body of saints that assemble in this particular church,"
    },
    {
      "id": 24,
      "start": 1337.2999877929688,
      "end": 1341.7799835205078,
      "text": " we all come together within this building that God has graciously blessed"
    },
    {
      "id": 25,
      "start": 1341.7799835205078,
      "end": 1346.1799774169922,
      "text": " us with, but then we leave this place, and as we leave this place, you have a"
    },
    {
      "id": 26,
      "start": 1346.1799774169922,
      "end": 1353.5399780273438,
      "text": " region, you have an area, you have a place where you are to shine as a light. And we"
    },
    {
      "id": 27,
      "start": 1353.5399780273438,
      "end": 1358.0199737548828,
      "text": " understand this evening that even as we would illustrate it with our map over"
    },
    {
      "id": 28,
      "start": 1358.0199737548828,
      "end": 1362.0199737548828,
      "text": " here, and as we would think about the particular missionaries going to"
    },
    {
      "id": 29,
      "start": 1362.0199737548828,
      "end": 1366.5799865722656,
      "text": " particular regions, one of the reasons specifically that I asked Brother Cook"
    },
    {
      "id": 30,
      "start": 1366.5799865722656,
      "end": 1371.6199798583984,
      "text": " to put on there a button that would light up every one of those lights at"
    },
    {
      "id": 31,
      "start": 1371.6199798583984,
      "end": 1376.0999755859375,
      "text": " the same time is really a twofold purpose. Number one, so that we could see"
    },
    {
      "id": 32,
      "start": 1376.0999755859375,
      "end": 1380.8999786376953,
      "text": " where we have representation, but number two, so that we can see where we do not"
    },
    {
      "id": 33,
      "start": 1380.8999786376953,
      "end": 1389.6199798583984,
      "text": " have representation. See, because there are some places that are represented on"
    },
    {
      "id": 34,
      "start": 1389.6199798583984,
      "end": 1392.97998046875,
      "text": " that map where we have, sometimes we have multiple missionaries in the same"
    },
    {
      "id": 35,
      "start": 1392.97998046875,
      "end": 1395.7799835205078,
      "text": " country, and that's not a bad thing. It's not to say that, well, that missionary"
    },
    {
      "id": 36,
      "start": 1396.3399810791016,
      "end": 1399.6199798583984,
      "text": " or that country has one missionary they don't need anymore. I would never suggest"
    },
    {
      "id": 37,
      "start": 1399.6199798583984,
      "end": 1404.739974975586,
      "text": " that. What I'm saying is that there are some regions that don't have any light."
    },
    {
      "id": 38,
      "start": 1407.219985961914,
      "end": 1411.9399871826172,
      "text": " And so when we think about this truth of having a role but then having a region,"
    },
    {
      "id": 39,
      "start": 1411.9399871826172,
      "end": 1415.6999816894531,
      "text": " there are places in which you go that I don't go. There's a sphere of influence"
    },
    {
      "id": 40,
      "start": 1415.6999816894531,
      "end": 1418.499984741211,
      "text": " that you have that I don't have. There's a sphere of influence that I have that"
    },
    {
      "id": 41,
      "start": 1418.499984741211,
      "end": 1422.8999786376953,
      "text": " you don't have. I mentioned all of those lighthouses a moment ago, and the"
    },
    {
      "id": 42,
      "start": 1422.8999786376953,
      "end": 1426.97998046875,
      "text": " distances in which they shine. You think about the roles and responsibilities of"
    },
    {
      "id": 43,
      "start": 1426.97998046875,
      "end": 1430.3399810791016,
      "text": " the lighthouse keeper, and you go through that whole process, but you understand"
    },
    {
      "id": 44,
      "start": 1430.3399810791016,
      "end": 1437.1399841308594,
      "text": " that they're placed where they are to shine in that region. The lighthouse in"
    },
    {
      "id": 45,
      "start": 1437.1399841308594,
      "end": 1442.3399810791016,
      "text": " Hatteras isn't going to help a sailor in Rhode Island or, excuse me, in"
    },
    {
      "id": 46,
      "start": 1442.3399810791016,
      "end": 1447.7799835205078,
      "text": " Connecticut or wherever up north, right? Maine. It's not going to help them. So"
    },
    {
      "id": 47,
      "start": 1447.7799835205078,
      "end": 1451.219985961914,
      "text": " there's got to be a lighthouse there. In fact, if you travel the eastern seaboard,"
    },
    {
      "id": 48,
      "start": 1451.219985961914,
      "end": 1455.8599853515625,
      "text": " you'll have the opportunity to see scores of lighthouses. Why? Because along"
    },
    {
      "id": 49,
      "start": 1455.8599853515625,
      "end": 1460.0199890136719,
      "text": " the eastern seaboard, there were a lot of people that were traveling by ship back"
    },
    {
      "id": 50,
      "start": 1460.0199890136719,
      "end": 1465.3799743652344,
      "text": " in the day coming to this country, and as they would come, they would need to have"
    },
    {
      "id": 51,
      "start": 1465.3799743652344,
      "end": 1471.4599914550781,
      "text": " help with the terrain as they would navigate those waters. And so that"
    },
    {
      "id": 52,
      "start": 1471.4599914550781,
      "end": 1476.0199890136719,
      "text": " lighthouse has a particular region. It has a particular area in which it is to"
    },
    {
      "id": 53,
      "start": 1476.0199890136719,
      "end": 1481.219970703125,
      "text": " serve, in which it is to provide those navigators, those sailors, with the"
    },
    {
      "id": 54,
      "start": 1481.219970703125,
      "end": 1485.4599914550781,
      "text": " information that were needed. In fact, we would find that as we think about this"
    },
    {
      "id": 55,
      "start": 1485.4599914550781,
      "end": 1489.5399780273438,
      "text": " truth that we have a region, we'd be mindful of the disciples. Go to Acts 8, if"
    },
    {
      "id": 56,
      "start": 1489.5399780273438,
      "end": 1493.219970703125,
      "text": " you will, and I want you to see what the Word of God says about the disciples"
    },
    {
      "id": 57,
      "start": 1493.219970703125,
      "end": 1497.1399841308594,
      "text": " here in Acts chapter number 8. Now, we're familiar with the fact that persecution"
    },
    {
      "id": 58,
      "start": 1497.1399841308594,
      "end": 1502.1799926757812,
      "text": " began for the first century saints right after the day of Pentecost, and"
    },
    {
      "id": 59,
      "start": 1502.5799865722656,
      "end": 1508.4999694824219,
      "text": " after they had the privilege of being able to see so many saved, of course the"
    },
    {
      "id": 60,
      "start": 1508.4999694824219,
      "end": 1514.0999755859375,
      "text": " enemy was ready to attack and ready to cause all sorts of problems, and the"
    },
    {
      "id": 61,
      "start": 1514.0999755859375,
      "end": 1518.0999755859375,
      "text": " persecution began, the disciples were threatened, they were beaten, they were"
    },
    {
      "id": 62,
      "start": 1518.0999755859375,
      "end": 1522.4999694824219,
      "text": " imprisoned, and all sorts of things took place. But we find that Jesus had given"
    },
    {
      "id": 63,
      "start": 1522.4999694824219,
      "end": 1528.4199829101562,
      "text": " the responsibility to His disciples, His followers, to go into all the world and"
    },
    {
      "id": 64,
      "start": 1528.4999694824219,
      "end": 1533.2999877929688,
      "text": " preach the gospel to every creature. In Acts, the Bible records it for us in Acts"
    },
    {
      "id": 65,
      "start": 1533.2999877929688,
      "end": 1538.0999755859375,
      "text": " 1 and verse number 8, He says, after you receive power that you're to go, and He"
    },
    {
      "id": 66,
      "start": 1538.0999755859375,
      "end": 1542.0199890136719,
      "text": " tells them that as they would go in the power of the Holy Spirit, that they were"
    },
    {
      "id": 67,
      "start": 1542.0199890136719,
      "end": 1545.9399719238281,
      "text": " to go to Jerusalem, Judea, Samaria, and the uttermost part. They weren't supposed"
    },
    {
      "id": 68,
      "start": 1545.9399719238281,
      "end": 1551.1399841308594,
      "text": " to just stay in Jerusalem. We find that here in Acts chapter number 8, the"
    },
    {
      "id": 69,
      "start": 1551.1399841308594,
      "end": 1556.3399658203125,
      "text": " persecution against the church that was there in Jerusalem began to intensify,"
    },
    {
      "id": 70,
      "start": 1556.3399658203125,
      "end": 1560.1799926757812,
      "text": " and really, as you look at the way in which it was intensifying, you find in"
    },
    {
      "id": 71,
      "start": 1560.1799926757812,
      "end": 1564.5799865722656,
      "text": " verse number 3, the Bible says that as for Saul, he made havoc of the church,"
    },
    {
      "id": 72,
      "start": 1565.2999877929688,
      "end": 1569.7799682617188,
      "text": " entering into every house and hailing men and women, committed them to prison."
    },
    {
      "id": 73,
      "start": 1569.7799682617188,
      "end": 1575.6999816894531,
      "text": " You see the persecution. But I want you to notice verse number 4. It says,"
    },
    {
      "id": 74,
      "start": 1575.6999816894531,
      "end": 1582.6599731445312,
      "text": " therefore, they that were scattered abroad went, what are those next words,"
    },
    {
      "id": 75,
      "start": 1583.6199951171875,
      "end": 1590.3399658203125,
      "text": " everywhere preaching the word. So effectively, you know what happened here"
    },
    {
      "id": 76,
      "start": 1590.3399658203125,
      "end": 1594.3399658203125,
      "text": " in Acts chapter number 8? All of those lights that were in Jerusalem, those"
    },
    {
      "id": 77,
      "start": 1594.3399658203125,
      "end": 1599.6999816894531,
      "text": " individual believers, right? You're the light of the world. We're using that this"
    },
    {
      "id": 78,
      "start": 1599.6999816894531,
      "end": 1602.8999938964844,
      "text": " evening. We're understanding that truth. And so all of those believers that are"
    },
    {
      "id": 79,
      "start": 1602.8999938964844,
      "end": 1606.8199768066406,
      "text": " individually, you're the light of the world, they were there in Jerusalem, and"
    },
    {
      "id": 80,
      "start": 1606.8199768066406,
      "end": 1610.97998046875,
      "text": " they were scattered abroad because of the persecution, and they went from"
    },
    {
      "id": 81,
      "start": 1610.97998046875,
      "end": 1616.4999694824219,
      "text": " Jerusalem, and they went out, and they went everywhere preaching the word,"
    },
    {
      "id": 82,
      "start": 1617.219970703125,
      "end": 1621.1399841308594,
      "text": " the particular region in which they were going to. And we find that here it says"
    },
    {
      "id": 83,
      "start": 1621.1399841308594,
      "end": 1625.2999877929688,
      "text": " in verse number 5, then Philip went down to the city of Samaria and preached"
    },
    {
      "id": 84,
      "start": 1625.2999877929688,
      "end": 1629.0599670410156,
      "text": " Christ unto them. The Bible tells us that there was great joy in that city in"
    },
    {
      "id": 85,
      "start": 1629.0599670410156,
      "end": 1632.2599792480469,
      "text": " verse number 8. Why? Because the gospel came. People were getting saved. I mean,"
    },
    {
      "id": 86,
      "start": 1632.2599792480469,
      "end": 1637.2999877929688,
      "text": " how wonderful and amazing this is. But we find that as some commentators have"
    },
    {
      "id": 87,
      "start": 1637.2999877929688,
      "end": 1643.1399841308594,
      "text": " said, theologians of yesteryear, that Satan, the enemy, sought to stamp out the"
    },
    {
      "id": 88,
      "start": 1643.1399841308594,
      "end": 1647.5399780273438,
      "text": " fire of the church in Jerusalem, and all that happened where the embers were"
    },
    {
      "id": 89,
      "start": 1647.5399780273438,
      "end": 1653.3799743652344,
      "text": " spread across the globe. And really, that's what happened. Remember in just a"
    },
    {
      "id": 90,
      "start": 1653.3799743652344,
      "end": 1656.5799865722656,
      "text": " few chapters into some of the missionary journeys here in the book of Acts, you'll"
    },
    {
      "id": 91,
      "start": 1656.5799865722656,
      "end": 1662.1799926757812,
      "text": " find that they say of Paul that these have come here also that have turned the"
    },
    {
      "id": 92,
      "start": 1662.1799926757812,
      "end": 1667.2999877929688,
      "text": " world upside down because they went everywhere preaching the word. So we"
    },
    {
      "id": 93,
      "start": 1667.2999877929688,
      "end": 1670.97998046875,
      "text": " understand this evening that we have a region. Look at Romans chapter number 15,"
    },
    {
      "id": 94,
      "start": 1670.97998046875,
      "end": 1674.6599731445312,
      "text": " if you will. Romans chapter 15. Notice what Paul says here."
    },
    {
      "id": 95,
      "start": 1677.5399780273438,
      "end": 1685.8599853515625,
      "text": " Paul's sharing here with these believers some truth with regard to his ministry"
    },
    {
      "id": 96,
      "start": 1685.8599853515625,
      "end": 1690.4199829101562,
      "text": " and that which the Lord had called him to. But I want you to notice specifically"
    },
    {
      "id": 97,
      "start": 1690.4199829101562,
      "end": 1696.0999755859375,
      "text": " what he says here in Romans 15 verses 19 and 20. He says this,"
    },
    {
      "id": 98,
      "start": 1696.0999755859375,
      "end": 1699.5399780273438,
      "text": " \"...through mighty signs and wonders by the power of the Spirit of God,"
    },
    {
      "id": 99,
      "start": 1701.8599853515625,
      "end": 1708.6599731445312,
      "text": " so that from Jerusalem and round about unto Illyricum I have fully preached the gospel"
    },
    {
      "id": 100,
      "start": 1708.6599731445312,
      "end": 1716.5799560546875,
      "text": " of Christ. Yea, so have I strived to preach the gospel, not where Christ was named,"
    },
    {
      "id": 101,
      "start": 1717.1399536132812,
      "end": 1722.0999755859375,
      "text": " lest I should build upon another man's foundation.\" So in other words, Paul didn't"
    },
    {
      "id": 102,
      "start": 1722.0999755859375,
      "end": 1728.8999633789062,
      "text": " want to go pull up into this new town or this town where the gospel was and plant a church"
    },
    {
      "id": 103,
      "start": 1728.8999633789062,
      "end": 1735.1399536132812,
      "text": " right next door to a church that was already there preaching the gospel. We've often talked"
    },
    {
      "id": 104,
      "start": 1735.1399536132812,
      "end": 1741.7799682617188,
      "text": " about, I had a man call me a number of years ago, I don't remember exactly the year, I think"
    },
    {
      "id": 105,
      "start": 1741.7799682617188,
      "end": 1748.6599731445312,
      "text": " it was 2013, and he got my name somehow. There was some contact that knew me and knew this guy."
    },
    {
      "id": 106,
      "start": 1748.6599731445312,
      "end": 1753.6199951171875,
      "text": " I didn't know the guy, but he gave me my name and he knew that we're living in Manassas at the time"
    },
    {
      "id": 107,
      "start": 1753.6199951171875,
      "end": 1757.6199951171875,
      "text": " and knew that I pastored here in Oakton. He calls me all excited and tells me how he wants to"
    },
    {
      "id": 108,
      "start": 1757.6199951171875,
      "end": 1762.1799926757812,
      "text": " pastor a church in Manassas. And he's going to go to Manassas and start a church. I said,"
    },
    {
      "id": 109,
      "start": 1762.1799926757812,
      "end": 1766.8999633789062,
      "text": " man, I think that's wonderful. I said, but here's a list of pastors in Manassas that are faithfully"
    },
    {
      "id": 110,
      "start": 1766.8999633789062,
      "end": 1771.4599609375,
      "text": " preaching the gospel and I would recommend that you contact them. And also there are two churches"
    },
    {
      "id": 111,
      "start": 1771.4599609375,
      "end": 1776.3399658203125,
      "text": " in Manassas that I know of that don't have pastors. Perhaps you'd like to check one of those"
    },
    {
      "id": 112,
      "start": 1776.3399658203125,
      "end": 1780.5799560546875,
      "text": " out. I wasn't trying to discourage the man from starting a church in Manassas if that's what God"
    },
    {
      "id": 113,
      "start": 1780.5799560546875,
      "end": 1785.3800048828125,
      "text": " wanted him to do, but I was simply trying to help him understand that there were some churches"
    },
    {
      "id": 114,
      "start": 1785.3800048828125,
      "end": 1791.6199951171875,
      "text": " already in Manassas doing what they're supposed to do. And yet we have other regions in America"
    },
    {
      "id": 115,
      "start": 1791.6199951171875,
      "end": 1797.4599609375,
      "text": " where there are no churches. And so it's just a matter of understanding logistically where we are"
    },
    {
      "id": 116,
      "start": 1797.4599609375,
      "end": 1800.260009765625,
      "text": " and who's here and who's not here and how many."
    },
    {
      "id": 0,
      "start": 1800.260009765625,
      "end": 1804.380009651184,
      "text": " people are preaching the gospel and what have you, and so you understand here that"
    },
    {
      "id": 1,
      "start": 1804.380009651184,
      "end": 1808.9000101089478,
      "text": " Paul was saying that he went from Jerusalem into Illyricum and that he"
    },
    {
      "id": 2,
      "start": 1808.9000101089478,
      "end": 1812.8600101470947,
      "text": " fully preached the gospel, but you see his heart and his mind was that he"
    },
    {
      "id": 3,
      "start": 1812.8600101470947,
      "end": 1816.4600105285645,
      "text": " wanted to go where Christ was not named, lest he should build upon another"
    },
    {
      "id": 4,
      "start": 1816.4600105285645,
      "end": 1820.0600090026855,
      "text": " man's foundation. And you think about the Apostle Paul and you think about his"
    },
    {
      "id": 5,
      "start": 1820.0600090026855,
      "end": 1825.9400100708008,
      "text": " missionary journeys and you understand as he would go and be just a pioneer, if"
    },
    {
      "id": 6,
      "start": 1825.9400100708008,
      "end": 1829.8200092315674,
      "text": " you will, and I understand some people aren't pioneers and they're not up for"
    },
    {
      "id": 7,
      "start": 1829.8200092315674,
      "end": 1833.420009613037,
      "text": " all of that, but you understand that Paul went and he preached the gospel and"
    },
    {
      "id": 8,
      "start": 1833.420009613037,
      "end": 1839.2200088500977,
      "text": " people were saved and it was amazing what God did in and through him. And this"
    },
    {
      "id": 9,
      "start": 1839.2200088500977,
      "end": 1846.3000106811523,
      "text": " evening, we understand that we have a region, you have an area. See, when we think"
    },
    {
      "id": 10,
      "start": 1846.3000106811523,
      "end": 1851.5400085449219,
      "text": " about this teaching that Jesus gave to the disciples in Matthew chapter number"
    },
    {
      "id": 11,
      "start": 1851.5400085449219,
      "end": 1858.0600090026855,
      "text": " five, and he says you're the light of the world, and we understand that he would"
    },
    {
      "id": 12,
      "start": 1858.0600090026855,
      "end": 1865.0600128173828,
      "text": " through the course of history, that he would allow the gospel to go around the"
    },
    {
      "id": 13,
      "start": 1865.0600128173828,
      "end": 1872.2200088500977,
      "text": " globe through individual believers, followers of Jesus Christ, understanding"
    },
    {
      "id": 14,
      "start": 1872.2200088500977,
      "end": 1877.6200103759766,
      "text": " and embracing their role that they are the light of the world. Understanding it"
    },
    {
      "id": 15,
      "start": 1877.6200103759766,
      "end": 1884.3400115966797,
      "text": " and saying, that's my job, that's my role, that's my responsibility. And they would"
    },
    {
      "id": 16,
      "start": 1884.3400115966797,
      "end": 1887.5800094604492,
      "text": " find that there was a particular region in which they were placed or located and"
    },
    {
      "id": 17,
      "start": 1887.5800094604492,
      "end": 1893.0200119018555,
      "text": " they would say this is where I'm going to serve God and be a light. You hear all"
    },
    {
      "id": 18,
      "start": 1893.0200119018555,
      "end": 1898.380012512207,
      "text": " the time people say various places are hard. And what they mean by that is"
    },
    {
      "id": 19,
      "start": 1898.380012512207,
      "end": 1902.9400100708008,
      "text": " people, you know, there's a question that typically gets asked of"
    },
    {
      "id": 20,
      "start": 1902.9400100708008,
      "end": 1907.0600128173828,
      "text": " missionaries. Brother Jared, I'm sure that as you were traveling with your family"
    },
    {
      "id": 21,
      "start": 1907.0600128173828,
      "end": 1910.5800094604492,
      "text": " you probably heard your dad have this question asked a number of times, are the"
    },
    {
      "id": 22,
      "start": 1910.5800094604492,
      "end": 1914.260009765625,
      "text": " people receptive to the gospel? It seems like everybody wants to ask a"
    },
    {
      "id": 23,
      "start": 1914.260009765625,
      "end": 1918.0600128173828,
      "text": " missionary, are the people receptive to the gospel? And I understand the purpose of"
    },
    {
      "id": 24,
      "start": 1918.0600128173828,
      "end": 1921.4600067138672,
      "text": " asking the question, I understand the reasoning, the logic, what we're trying to"
    },
    {
      "id": 25,
      "start": 1921.4600067138672,
      "end": 1927.260009765625,
      "text": " find out and discover, but you understand the gospel is confrontational. And you"
    },
    {
      "id": 26,
      "start": 1927.260009765625,
      "end": 1931.740005493164,
      "text": " understand that as you would go, and some people say, oh that's a hard area, do you"
    },
    {
      "id": 27,
      "start": 1931.740005493164,
      "end": 1937.1000061035156,
      "text": " suggest that we don't need a light there because it's a hard area? Or perhaps we"
    },
    {
      "id": 28,
      "start": 1937.1000061035156,
      "end": 1941.3000030517578,
      "text": " need more of a light there because it's a hard area. You know what we've done in"
    },
    {
      "id": 29,
      "start": 1941.3000030517578,
      "end": 1945.6200103759766,
      "text": " America? If you do some some research, in fact there's a website, I don't even know"
    },
    {
      "id": 30,
      "start": 1945.6200103759766,
      "end": 1949.740005493164,
      "text": " if it's still up and running, I haven't checked it in a number of years, but it"
    },
    {
      "id": 31,
      "start": 1949.740005493164,
      "end": 1954.4600067138672,
      "text": " was called saltandlight.org, and on that particular website they would list"
    },
    {
      "id": 32,
      "start": 1954.4600067138672,
      "end": 1959.7000122070312,
      "text": " cities around the United States of America along with their population and"
    },
    {
      "id": 33,
      "start": 1959.7000122070312,
      "end": 1963.8200073242188,
      "text": " with the number of gospel preaching churches that were in those areas."
    },
    {
      "id": 34,
      "start": 1963.8200073242188,
      "end": 1968.9000091552734,
      "text": " You know what's an unfortunate reality in America is that gospel preaching"
    },
    {
      "id": 35,
      "start": 1968.9400024414062,
      "end": 1977.1400146484375,
      "text": " churches, by the just scores of them, left the cities years ago. Now you still can"
    },
    {
      "id": 36,
      "start": 1977.1400146484375,
      "end": 1983.0600128173828,
      "text": " find gospel preaching churches and cities, but lots of them left. And they"
    },
    {
      "id": 37,
      "start": 1983.0600128173828,
      "end": 1986.780014038086,
      "text": " left the cities because it was hard, because it was dangerous, because it was"
    },
    {
      "id": 38,
      "start": 1986.780014038086,
      "end": 1991.740005493164,
      "text": " fill-in-the-blank, whatever it was. Brother Mershon, who many of you know, we"
    },
    {
      "id": 39,
      "start": 1991.740005493164,
      "end": 1994.740005493164,
      "text": " find that Deborah gave a testimony about Mrs. Mershon at the ladies meeting"
    },
    {
      "id": 40,
      "start": 1994.740005493164,
      "end": 2000.8600158691406,
      "text": " there, and Brother Mershon tried for years to find someone that would go to"
    },
    {
      "id": 41,
      "start": 2000.8600158691406,
      "end": 2005.740005493164,
      "text": " San Diego and plant a church. He offered to help him, he offered all sorts of"
    },
    {
      "id": 42,
      "start": 2005.740005493164,
      "end": 2010.1400146484375,
      "text": " assistance to fill in and also go so many with him, so on and so forth, and it"
    },
    {
      "id": 43,
      "start": 2010.1400146484375,
      "end": 2012.9400024414062,
      "text": " was years and years and years before he could find somebody that was willing to"
    },
    {
      "id": 44,
      "start": 2012.9400024414062,
      "end": 2018.500015258789,
      "text": " go to the city of San Diego to plant a church. In the city. Well, we're"
    },
    {
      "id": 45,
      "start": 2018.500015258789,
      "end": 2022.6200103759766,
      "text": " outside the city and we reach into the city. No, no, get in the city and be a"
    },
    {
      "id": 46,
      "start": 2022.6200103759766,
      "end": 2030.5400085449219,
      "text": " light there. And so we find that God's plan through the course of history has"
    },
    {
      "id": 47,
      "start": 2030.5400085449219,
      "end": 2035.0600128173828,
      "text": " been that his people are the light of the world. And were to go to our"
    },
    {
      "id": 48,
      "start": 2035.0600128173828,
      "end": 2039.7000122070312,
      "text": " particular region for us here, it's northern Virginia. You know how many"
    },
    {
      "id": 49,
      "start": 2039.7000122070312,
      "end": 2042.4200134277344,
      "text": " people tell me over the years, I've been here for almost 10 years, I can't even"
    },
    {
      "id": 50,
      "start": 2042.4200134277344,
      "end": 2046.7000122070312,
      "text": " tell you how many times I've had somebody say to me, oh that's a hard area."
    },
    {
      "id": 51,
      "start": 2046.740005493164,
      "end": 2053.260009765625,
      "text": " People tell me that all the time. What does that mean? Does it mean that we just"
    },
    {
      "id": 52,
      "start": 2053.260009765625,
      "end": 2058.1800231933594,
      "text": " say, well, you know, us four are no more, we're gonna just hold on until Jesus"
    },
    {
      "id": 53,
      "start": 2058.1800231933594,
      "end": 2064.6600036621094,
      "text": " comes back? No. This is where God's put us. Amen? And you're saying, I can't wait to"
    },
    {
      "id": 54,
      "start": 2064.6600036621094,
      "end": 2068.9400024414062,
      "text": " leave. I hope that's not your hard attitude. If God moves you, that's one"
    },
    {
      "id": 55,
      "start": 2068.9400024414062,
      "end": 2073.1800231933594,
      "text": " thing. But the reality is that God has placed us where he's placed us, and we're"
    },
    {
      "id": 56,
      "start": 2073.1800231933594,
      "end": 2080.02001953125,
      "text": " the light in this area. And this area needs the light. Amen? I said this, you"
    },
    {
      "id": 57,
      "start": 2080.02001953125,
      "end": 2083.9000244140625,
      "text": " have a role, we have a role, we have a region. And I would ask this question as"
    },
    {
      "id": 58,
      "start": 2083.9000244140625,
      "end": 2089.740020751953,
      "text": " a final thought this evening. It's a very direct question, and is this, are you"
    },
    {
      "id": 59,
      "start": 2089.740020751953,
      "end": 2096.1000061035156,
      "text": " fulfilling your responsibility? Am I fulfilling my responsibility?"
    },
    {
      "id": 60,
      "start": 2096.1000061035156,
      "end": 2101.9400024414062,
      "text": " Individually, are we fulfilling the responsibility that we have been given?"
    },
    {
      "id": 61,
      "start": 2101.980010986328,
      "end": 2106.260009765625,
      "text": " Collectively, as a church, are we fulfilling the responsibility that we"
    },
    {
      "id": 62,
      "start": 2106.260009765625,
      "end": 2113.7000122070312,
      "text": " have been given? This month is, apart from last year, has been the month in which"
    },
    {
      "id": 63,
      "start": 2113.7000122070312,
      "end": 2119.5,
      "text": " every year we've had our missions conference. We kind of have a, obviously,"
    },
    {
      "id": 64,
      "start": 2119.5,
      "end": 2125.1400146484375,
      "text": " missions emphasis year-round, but highlight and have as a big date on our"
    },
    {
      "id": 65,
      "start": 2125.1400146484375,
      "end": 2130.980010986328,
      "text": " calendar in the month of May, a missions conference. And we've often understood,"
    },
    {
      "id": 66,
      "start": 2130.980010986328,
      "end": 2135.4200134277344,
      "text": " and I've often preached over the years, that as we have the privilege of sending"
    },
    {
      "id": 67,
      "start": 2135.4200134277344,
      "end": 2139.260009765625,
      "text": " missionaries all around the globe, we must understand that we are the"
    },
    {
      "id": 68,
      "start": 2139.260009765625,
      "end": 2146.3800048828125,
      "text": " missionaries here in this community. The Bible says, as I referenced a moment ago,"
    },
    {
      "id": 69,
      "start": 2146.3800048828125,
      "end": 2151.6199951171875,
      "text": " that truth in Acts 1 and verse number 8, and it's important to understand this, he"
    },
    {
      "id": 70,
      "start": 2151.6199951171875,
      "end": 2155.3800048828125,
      "text": " says, but you shall receive power after that the Holy Ghost has come upon you,"
    },
    {
      "id": 71,
      "start": 2155.3800048828125,
      "end": 2160.4200134277344,
      "text": " and you shall be witnesses unto me both in Jerusalem and in Judea and in"
    },
    {
      "id": 72,
      "start": 2160.4200134277344,
      "end": 2166.1800231933594,
      "text": " Samaria and unto the uttermost part of the earth. The idea, when he says that you"
    },
    {
      "id": 73,
      "start": 2166.1800231933594,
      "end": 2169.7000122070312,
      "text": " shall be witnesses unto me both in Jerusalem, Judea, Samaria, and the"
    },
    {
      "id": 74,
      "start": 2169.7000122070312,
      "end": 2175.3399963378906,
      "text": " uttermost, is really what he's saying is at the same time. And so we're giving of"
    },
    {
      "id": 75,
      "start": 2175.3399963378906,
      "end": 2179.9400024414062,
      "text": " our resources financially to send missionaries across the globe, and I'm so"
    },
    {
      "id": 76,
      "start": 2179.9400024414062,
      "end": 2188.4200134277344,
      "text": " thankful for that, and it's a privilege to be able to give to missions. We, as a"
    },
    {
      "id": 77,
      "start": 2188.5,
      "end": 2193.540008544922,
      "text": " family, we give to missions regularly every month, missions giving, missions"
    },
    {
      "id": 78,
      "start": 2193.540008544922,
      "end": 2199.220001220703,
      "text": " giving. Why? Because I believe it's important. I believe God blesses it, and I"
    },
    {
      "id": 79,
      "start": 2199.220001220703,
      "end": 2205.8200073242188,
      "text": " feel a great privilege to be able to support the work of missions. But you"
    },
    {
      "id": 80,
      "start": 2205.8200073242188,
      "end": 2210.3399963378906,
      "text": " understand that it's more than just putting missions dollars in the plate to"
    },
    {
      "id": 81,
      "start": 2210.3399963378906,
      "end": 2215.779998779297,
      "text": " send a missionary to another country. It's you and it's me going across the"
    },
    {
      "id": 82,
      "start": 2215.779998779297,
      "end": 2222.740020751953,
      "text": " street and being a missionary to our neighbor, being a missionary to the"
    },
    {
      "id": 83,
      "start": 2222.740020751953,
      "end": 2226.8600158691406,
      "text": " region, right? We have a role, but we have a region, we have an area. There's a place"
    },
    {
      "id": 84,
      "start": 2226.8600158691406,
      "end": 2233.6199951171875,
      "text": " where God has planted us. There's a place in which God has given us a place to"
    },
    {
      "id": 85,
      "start": 2233.6199951171875,
      "end": 2239.300018310547,
      "text": " dwell, a home. There's a place in which God has put us to work and to fulfill"
    },
    {
      "id": 86,
      "start": 2239.300018310547,
      "end": 2245.5,
      "text": " that role. But we understand that God has us in that place, not just as fulfilling"
    },
    {
      "id": 87,
      "start": 2245.5,
      "end": 2250.9000244140625,
      "text": " a duty and obligation as a worker, but understanding that we're a light."
    },
    {
      "id": 88,
      "start": 2250.9000244140625,
      "end": 2256.779998779297,
      "text": " And oh, we must be careful and creative as to how we would share the gospel with"
    },
    {
      "id": 89,
      "start": 2256.779998779297,
      "end": 2260.9400024414062,
      "text": " those that we come into contact with, and especially when we're on the job and"
    },
    {
      "id": 90,
      "start": 2260.9400024414062,
      "end": 2266.1400146484375,
      "text": " what have you, but what a great opportunity that God has given us. And we"
    },
    {
      "id": 91,
      "start": 2266.1400146484375,
      "end": 2273.4600219726562,
      "text": " understand this evening, this role in this region, but the question is how are"
    },
    {
      "id": 92,
      "start": 2273.4600219726562,
      "end": 2279.4600219726562,
      "text": " we doing with it? Are we fulfilling our responsibility? Are we letting our light"
    },
    {
      "id": 93,
      "start": 2279.4600219726562,
      "end": 2285.9400024414062,
      "text": " so shine? As Jesus gave this command to his disciples in Matthew chapter 5,"
    },
    {
      "id": 94,
      "start": 2285.9400024414062,
      "end": 2292.7000122070312,
      "text": " ye are the light of the world, verse 14, let your light so shine, verse 16. So if"
    },
    {
      "id": 95,
      "start": 2292.7000122070312,
      "end": 2299.300018310547,
      "text": " this is what you are, this is what you do. A light shines. Amen? If you come in here,"
    },
    {
      "id": 96,
      "start": 2299.300018310547,
      "end": 2303.7000122070312,
      "text": " we have 50 light bulbs in these chandeliers, and it's amazing. I'm going to"
    },
    {
      "id": 97,
      "start": 2303.7000122070312,
      "end": 2307.540008544922,
      "text": " make this statement, and this week I'll have to replace a light bulb, but it has"
    },
    {
      "id": 98,
      "start": 2307.540008544922,
      "end": 2311.3800048828125,
      "text": " been weeks, excuse me, it's been months. I mean, it's probably been a year and a"
    },
    {
      "id": 99,
      "start": 2311.3800048828125,
      "end": 2318.5800170898438,
      "text": " half. I haven't had to replace one light bulb. Absolutely amazing. When I first got"
    },
    {
      "id": 100,
      "start": 2318.5800170898438,
      "end": 2324.3800048828125,
      "text": " here, I was changing light bulbs every week, 50 of them. Dean walked in, I'm"
    },
    {
      "id": 101,
      "start": 2324.3800048828125,
      "end": 2327.2999877929688,
      "text": " standing on top of the pew because I can reach him from standing on the pew. Why don't"
    },
    {
      "id": 102,
      "start": 2327.2999877929688,
      "end": 2332.739990234375,
      "text": " you have a ladder? Too much work, man. I got to just get this thing done. Don't"
    },
    {
      "id": 103,
      "start": 2332.739990234375,
      "end": 2339.1799926757812,
      "text": " get nervous. I don't do it anymore. I'm getting old. But the reality is that when"
    },
    {
      "id": 104,
      "start": 2339.1799926757812,
      "end": 2345.6199951171875,
      "text": " the light is out, what do we do with it? Why do we replace it? Because a light is"
    },
    {
      "id": 105,
      "start": 2345.6199951171875,
      "end": 2350.8599853515625,
      "text": " supposed to shine. Amen? And I'm not saying to you, I'm not suggesting that"
    },
    {
      "id": 106,
      "start": 2350.8599853515625,
      "end": 2355.7000122070312,
      "text": " God's going to get rid of us, but I'm saying that we need to shine."
    },
    {
      "id": 107,
      "start": 2355.7000122070312,
      "end": 2361.1400146484375,
      "text": " That's what we're called to do. Ye are the light of the world, let your light so"
    },
    {
      "id": 108,
      "start": 2361.1400146484375,
      "end": 2368.6199951171875,
      "text": " shine. What is it that would maybe prevent us from being the light that God"
    },
    {
      "id": 109,
      "start": 2368.6199951171875,
      "end": 2374.2999877929688,
      "text": " has called us to be or he's told us that we are? I think about those roles that I"
    },
    {
      "id": 110,
      "start": 2374.2999877929688,
      "end": 2378.780029296875,
      "text": " mentioned of the lighthouse keeper and a couple of them in particular, the one of"
    },
    {
      "id": 111,
      "start": 2378.780029296875,
      "end": 2383.97998046875,
      "text": " cleaning the lenses and the windows, and I think about the way in which our"
    },
    {
      "id": 112,
      "start": 2384.02001953125,
      "end": 2390.2200317382812,
      "text": " lens can become dirty. The way in which we can be affected and influenced by the"
    },
    {
      "id": 113,
      "start": 2390.2200317382812,
      "end": 2394.9000244140625,
      "text": " world. You think about this truth, turn to the book of James, if you will, chapter"
    },
    {
      "id": 114,
      "start": 2394.9000244140625,
      "end": 2402.2200317382812,
      "text": " number one. James chapter number one. I want you to notice what is said here."
    },
    {
      "id": 0,
      "start": 2402.2200317382812,
      "end": 2405.4000318050385,
      "text": " Here in v. 27, really the end of the verse,"
    },
    {
      "id": 1,
      "start": 2405.4000318050385,
      "end": 2407.280031681061,
      "text": " we'll read the entirety of the verse,"
    },
    {
      "id": 2,
      "start": 2407.280031681061,
      "end": 2410.520031929016,
      "text": " but focus there with this thought"
    },
    {
      "id": 3,
      "start": 2410.520031929016,
      "end": 2414.2000312805176,
      "text": " on how it is that our lens can become dirty"
    },
    {
      "id": 4,
      "start": 2414.2000312805176,
      "end": 2418.3800315856934,
      "text": " and our lens needs to be cleaned."
    },
    {
      "id": 5,
      "start": 2418.3800315856934,
      "end": 2420.100030899048,
      "text": " It says in v. 27 of James 1,"
    },
    {
      "id": 6,
      "start": 2420.100030899048,
      "end": 2422.8600311279297,
      "text": " pure religion undefiled before God and the Father is this,"
    },
    {
      "id": 7,
      "start": 2422.8600311279297,
      "end": 2424.560031890869,
      "text": " to visit the fatherless and widows"
    },
    {
      "id": 8,
      "start": 2424.560031890869,
      "end": 2425.8600311279297,
      "text": " in their affliction,"
    },
    {
      "id": 9,
      "start": 2425.8600311279297,
      "end": 2430.600030899048,
      "text": " and to keep himself unspotted from the world."
    },
    {
      "id": 10,
      "start": 2430.600030899048,
      "end": 2434.060031890869,
      "text": " To keep himself unspotted from the world."
    },
    {
      "id": 11,
      "start": 2434.060031890869,
      "end": 2435.9400329589844,
      "text": " I don't wear glasses,"
    },
    {
      "id": 12,
      "start": 2435.9400329589844,
      "end": 2438.0400314331055,
      "text": " but I know some that wear glasses,"
    },
    {
      "id": 13,
      "start": 2438.0400314331055,
      "end": 2441.460033416748,
      "text": " and I've actually wore some sunglasses recently,"
    },
    {
      "id": 14,
      "start": 2441.460033416748,
      "end": 2442.840030670166,
      "text": " and I put those sunglasses on,"
    },
    {
      "id": 15,
      "start": 2442.840030670166,
      "end": 2445.3600311279297,
      "text": " and I said, man, these lenses are filthy."
    },
    {
      "id": 16,
      "start": 2445.3600311279297,
      "end": 2446.740032196045,
      "text": " They were dirty."
    },
    {
      "id": 17,
      "start": 2446.740032196045,
      "end": 2448.7800331115723,
      "text": " I hadn't worn them in a long time."
    },
    {
      "id": 18,
      "start": 2448.7800331115723,
      "end": 2450.4400329589844,
      "text": " Man, they just had smudges all over them."
    },
    {
      "id": 19,
      "start": 2450.4400329589844,
      "end": 2452.300033569336,
      "text": " It was hard to see through them."
    },
    {
      "id": 20,
      "start": 2452.300033569336,
      "end": 2453.680030822754,
      "text": " For those of you that wear glasses,"
    },
    {
      "id": 21,
      "start": 2453.680030822754,
      "end": 2455.1000328063965,
      "text": " you understand it can be annoying"
    },
    {
      "id": 22,
      "start": 2455.1000328063965,
      "end": 2457.180030822754,
      "text": " to have something on the lens."
    },
    {
      "id": 23,
      "start": 2457.180030822754,
      "end": 2460.7200317382812,
      "text": " You want to clean that lens, right?"
    },
    {
      "id": 24,
      "start": 2460.7200317382812,
      "end": 2462.8800315856934,
      "text": " And so you think about us as the light of the world"
    },
    {
      "id": 25,
      "start": 2462.8800315856934,
      "end": 2464.3200302124023,
      "text": " and to let your light so shine."
    },
    {
      "id": 26,
      "start": 2464.3200302124023,
      "end": 2468.520034790039,
      "text": " If we get spotted from the world,"
    },
    {
      "id": 27,
      "start": 2468.520034790039,
      "end": 2471.8800354003906,
      "text": " maybe our light's not shining like it should."
    },
    {
      "id": 28,
      "start": 2471.8800354003906,
      "end": 2474.200035095215,
      "text": " If that lighthouse that we mentioned in the beginning"
    },
    {
      "id": 29,
      "start": 2474.200035095215,
      "end": 2475.700035095215,
      "text": " there at Hatteras,"
    },
    {
      "id": 30,
      "start": 2475.700035095215,
      "end": 2478.560028076172,
      "text": " it's to shine 20 miles out to sea,"
    },
    {
      "id": 31,
      "start": 2478.560028076172,
      "end": 2480.1600341796875,
      "text": " I would submit to you this evening"
    },
    {
      "id": 32,
      "start": 2480.1600341796875,
      "end": 2481.7200317382812,
      "text": " that if there's dirt and debris"
    },
    {
      "id": 33,
      "start": 2481.7200317382812,
      "end": 2483.520034790039,
      "text": " and all sorts of things all over the lens"
    },
    {
      "id": 34,
      "start": 2483.520034790039,
      "end": 2484.7200317382812,
      "text": " and all over the glass there,"
    },
    {
      "id": 35,
      "start": 2484.7200317382812,
      "end": 2486.8200302124023,
      "text": " it's not going to shine as far."
    },
    {
      "id": 36,
      "start": 2486.8200302124023,
      "end": 2489.400032043457,
      "text": " It's just not going to work."
    },
    {
      "id": 37,
      "start": 2489.400032043457,
      "end": 2491.6400299072266,
      "text": " You ever had a headlight on your automobile"
    },
    {
      "id": 38,
      "start": 2491.6400299072266,
      "end": 2493.1400299072266,
      "text": " get frosted on the inside"
    },
    {
      "id": 39,
      "start": 2493.1400299072266,
      "end": 2496.200035095215,
      "text": " and it doesn't shine like it's supposed to?"
    },
    {
      "id": 40,
      "start": 2496.200035095215,
      "end": 2497.1400299072266,
      "text": " It needs to be clean."
    },
    {
      "id": 41,
      "start": 2497.1400299072266,
      "end": 2499.200035095215,
      "text": " It needs to be taken care of"
    },
    {
      "id": 42,
      "start": 2499.200035095215,
      "end": 2503.4400329589844,
      "text": " so that it will shine like it's designed to shine."
    },
    {
      "id": 43,
      "start": 2503.4400329589844,
      "end": 2512.100028991699,
      "text": " Not only here, but notice in 1 John 3."
    },
    {
      "id": 44,
      "start": 2512.100028991699,
      "end": 2515.9400329589844,
      "text": " In John 3,"
    },
    {
      "id": 45,
      "start": 2515.9400329589844,
      "end": 2517.4200286865234,
      "text": " and really, I believe, obviously,"
    },
    {
      "id": 46,
      "start": 2517.4200286865234,
      "end": 2522.060028076172,
      "text": " the chapter divisions and verses were added later,"
    },
    {
      "id": 47,
      "start": 2522.060028076172,
      "end": 2524.580032348633,
      "text": " but really if you look at chapter 2 and verse 28"
    },
    {
      "id": 48,
      "start": 2524.580032348633,
      "end": 2526.8600311279297,
      "text": " all the way down through chapter 3 and verse number 3,"
    },
    {
      "id": 49,
      "start": 2526.8600311279297,
      "end": 2528.460029602051,
      "text": " it's just a great portion of Scripture"
    },
    {
      "id": 50,
      "start": 2528.460029602051,
      "end": 2531.260025024414,
      "text": " with regard to the coming of Christ."
    },
    {
      "id": 51,
      "start": 2531.260025024414,
      "end": 2532.6600341796875,
      "text": " And let's read that entirety"
    },
    {
      "id": 52,
      "start": 2532.6600341796875,
      "end": 2534.3400268554688,
      "text": " beginning in verse 28 of 1 John 2."
    },
    {
      "id": 53,
      "start": 2534.3400268554688,
      "end": 2534.8600311279297,
      "text": " It says,"
    },
    {
      "id": 54,
      "start": 2534.8600311279297,
      "end": 2537.4600372314453,
      "text": " And now little children abide in Him,"
    },
    {
      "id": 55,
      "start": 2537.4600372314453,
      "end": 2539.580032348633,
      "text": " that when He shall appear,"
    },
    {
      "id": 56,
      "start": 2539.580032348633,
      "end": 2540.580032348633,
      "text": " we may have confidence"
    },
    {
      "id": 57,
      "start": 2540.580032348633,
      "end": 2543.260025024414,
      "text": " and not be ashamed before Him at His coming."
    },
    {
      "id": 58,
      "start": 2543.260025024414,
      "end": 2544.4600372314453,
      "text": " If you know that He is righteous,"
    },
    {
      "id": 59,
      "start": 2544.4600372314453,
      "end": 2546.1800384521484,
      "text": " so that everyone that doeth righteousness"
    },
    {
      "id": 60,
      "start": 2546.1800384521484,
      "end": 2546.980026245117,
      "text": " is born of Him,"
    },
    {
      "id": 61,
      "start": 2546.980026245117,
      "end": 2549.020034790039,
      "text": " behold, what manner of love"
    },
    {
      "id": 62,
      "start": 2549.020034790039,
      "end": 2550.740036010742,
      "text": " the Father hath bestowed upon us"
    },
    {
      "id": 63,
      "start": 2550.740036010742,
      "end": 2554.2200317382812,
      "text": " that we should be called the sons of God."
    },
    {
      "id": 64,
      "start": 2554.2200317382812,
      "end": 2555.5400390625,
      "text": " Therefore the world knoweth us not,"
    },
    {
      "id": 65,
      "start": 2555.5400390625,
      "end": 2556.9400329589844,
      "text": " because it knew Him not."
    },
    {
      "id": 66,
      "start": 2556.9400329589844,
      "end": 2559.300033569336,
      "text": " Beloved, now are we the sons of God,"
    },
    {
      "id": 67,
      "start": 2559.300033569336,
      "end": 2562.7000274658203,
      "text": " and it doth not yet appear what we shall be,"
    },
    {
      "id": 68,
      "start": 2562.7000274658203,
      "end": 2565.1800384521484,
      "text": " but we know that when He shall appear,"
    },
    {
      "id": 69,
      "start": 2565.1800384521484,
      "end": 2566.780029296875,
      "text": " we shall be like Him,"
    },
    {
      "id": 70,
      "start": 2566.780029296875,
      "end": 2569.9400329589844,
      "text": " for we shall see Him as He is."
    },
    {
      "id": 71,
      "start": 2569.9400329589844,
      "end": 2573.7000274658203,
      "text": " And every man that hath this hope in him...\""
    },
    {
      "id": 72,
      "start": 2573.7000274658203,
      "end": 2574.500030517578,
      "text": " That's what it says."
    },
    {
      "id": 73,
      "start": 2574.500030517578,
      "end": 2579.1800384521484,
      "text": " \"...purifies himself even as he is pure.\""
    },
    {
      "id": 74,
      "start": 2579.1800384521484,
      "end": 2581.7000274658203,
      "text": " Desiring to stay clean."
    },
    {
      "id": 75,
      "start": 2581.7000274658203,
      "end": 2584.4600372314453,
      "text": " Desiring to live right."
    },
    {
      "id": 76,
      "start": 2584.4600372314453,
      "end": 2586.4600372314453,
      "text": " To walk as children of light"
    },
    {
      "id": 77,
      "start": 2586.4600372314453,
      "end": 2588.1400299072266,
      "text": " as Paul said there in Ephesians 5"
    },
    {
      "id": 78,
      "start": 2588.1400299072266,
      "end": 2589.740036010742,
      "text": " in verse number 8."
    },
    {
      "id": 79,
      "start": 2589.740036010742,
      "end": 2590.740036010742,
      "text": " We understand that we go"
    },
    {
      "id": 80,
      "start": 2590.740036010742,
      "end": 2592.300033569336,
      "text": " in the power of the Holy Spirit"
    },
    {
      "id": 81,
      "start": 2592.300033569336,
      "end": 2594.300033569336,
      "text": " filled with the Holy Spirit of God."
    },
    {
      "id": 82,
      "start": 2594.300033569336,
      "end": 2596.060028076172,
      "text": " We talked about the role"
    },
    {
      "id": 83,
      "start": 2596.060028076172,
      "end": 2597.6600341796875,
      "text": " of the lighthouse keeper"
    },
    {
      "id": 84,
      "start": 2597.6600341796875,
      "end": 2599.1800384521484,
      "text": " to replenish the fuel."
    },
    {
      "id": 85,
      "start": 2599.1800384521484,
      "end": 2601.5400390625,
      "text": " The reality is that we understand"
    },
    {
      "id": 86,
      "start": 2601.5400390625,
      "end": 2602.980026245117,
      "text": " that we can grieve and quench"
    },
    {
      "id": 87,
      "start": 2602.980026245117,
      "end": 2605.020034790039,
      "text": " the Holy Spirit of God."
    },
    {
      "id": 88,
      "start": 2605.020034790039,
      "end": 2606.9400329589844,
      "text": " The children of Israel were said of this"
    },
    {
      "id": 89,
      "start": 2606.9400329589844,
      "end": 2609.6600341796875,
      "text": " in Psalm 78 that the Bible says"
    },
    {
      "id": 90,
      "start": 2609.6600341796875,
      "end": 2612.580032348633,
      "text": " that they limited the Holy One of Israel."
    },
    {
      "id": 91,
      "start": 2612.580032348633,
      "end": 2614.060028076172,
      "text": " Have you ever considered"
    },
    {
      "id": 92,
      "start": 2614.060028076172,
      "end": 2618.9000244140625,
      "text": " how the limitless God can be limited?"
    },
    {
      "id": 93,
      "start": 2618.9000244140625,
      "end": 2619.780029296875,
      "text": " That's what the Bible says."
    },
    {
      "id": 94,
      "start": 2619.780029296875,
      "end": 2620.5400390625,
      "text": " The children of Israel,"
    },
    {
      "id": 95,
      "start": 2620.5400390625,
      "end": 2623.1800384521484,
      "text": " they limited the Holy One of Israel."
    },
    {
      "id": 96,
      "start": 2623.1800384521484,
      "end": 2624.5400390625,
      "text": " How? Because of their unbelief."
    },
    {
      "id": 97,
      "start": 2624.5400390625,
      "end": 2627.1800384521484,
      "text": " Their doubt."
    },
    {
      "id": 98,
      "start": 2627.1800384521484,
      "end": 2629.060028076172,
      "text": " We think this evening"
    },
    {
      "id": 99,
      "start": 2629.060028076172,
      "end": 2630.5400390625,
      "text": " of the way in which we would be filled"
    },
    {
      "id": 100,
      "start": 2630.5400390625,
      "end": 2631.4600372314453,
      "text": " with the Holy Spirit of God."
    },
    {
      "id": 101,
      "start": 2631.4600372314453,
      "end": 2632.6600341796875,
      "text": " Not quenching the Spirit."
    },
    {
      "id": 102,
      "start": 2632.6600341796875,
      "end": 2634.260025024414,
      "text": " Not grieving the Spirit."
    },
    {
      "id": 103,
      "start": 2634.260025024414,
      "end": 2635.5400390625,
      "text": " Walking in the Spirit"
    },
    {
      "id": 104,
      "start": 2635.5400390625,
      "end": 2638.9000244140625,
      "text": " and having the power of the Holy Spirit"
    },
    {
      "id": 105,
      "start": 2638.9000244140625,
      "end": 2641.780029296875,
      "text": " that is mentioned in Acts chapter number 1"
    },
    {
      "id": 106,
      "start": 2641.780029296875,
      "end": 2642.6600341796875,
      "text": " and verse number 8"
    },
    {
      "id": 107,
      "start": 2642.6600341796875,
      "end": 2644.8600311279297,
      "text": " that we'd be endued with that power"
    },
    {
      "id": 108,
      "start": 2644.8600311279297,
      "end": 2646.6600341796875,
      "text": " being filled with the Holy Spirit of God."
    },
    {
      "id": 109,
      "start": 2646.6600341796875,
      "end": 2647.7000274658203,
      "text": " What a blessing as we go"
    },
    {
      "id": 110,
      "start": 2647.7000274658203,
      "end": 2649.8600311279297,
      "text": " in the power of God and shine"
    },
    {
      "id": 111,
      "start": 2649.8600311279297,
      "end": 2653.580032348633,
      "text": " as lights in this dark world."
    },
    {
      "id": 112,
      "start": 2653.580032348633,
      "end": 2655.5400390625,
      "text": " I ask the question as our final point,"
    },
    {
      "id": 113,
      "start": 2655.5400390625,
      "end": 2657.500030517578,
      "text": " are you fulfilling your responsibility?"
    },
    {
      "id": 114,
      "start": 2657.500030517578,
      "end": 2658.4200439453125,
      "text": " And I would say this"
    },
    {
      "id": 115,
      "start": 2658.4200439453125,
      "end": 2659.5800170898438,
      "text": " on a very positive note"
    },
    {
      "id": 116,
      "start": 2659.5800170898438,
      "end": 2660.820037841797,
      "text": " that we'll use the example"
    },
    {
      "id": 117,
      "start": 2660.820037841797,
      "end": 2662.1800231933594,
      "text": " of John the Baptist"
    },
    {
      "id": 118,
      "start": 2662.1800231933594,
      "end": 2664.9000244140625,
      "text": " and say that he fulfilled his responsibility."
    },
    {
      "id": 119,
      "start": 2664.9000244140625,
      "end": 2669.3800354003906,
      "text": " Turn to John 5 and verse number 35."
    },
    {
      "id": 120,
      "start": 2669.3800354003906,
      "end": 2671.1800231933594,
      "text": " John the Baptist is a man"
    },
    {
      "id": 121,
      "start": 2671.1800231933594,
      "end": 2674.780029296875,
      "text": " in which had a powerful ministry,"
    },
    {
      "id": 122,
      "start": 2674.780029296875,
      "end": 2675.9800415039062,
      "text": " a powerful impact."
    },
    {
      "id": 123,
      "start": 2675.9800415039062,
      "end": 2678.8600463867188,
      "text": " And I'm always and I say it"
    },
    {
      "id": 124,
      "start": 2678.8600463867188,
      "end": 2680.9800415039062,
      "text": " not very often, but regularly"
    },
    {
      "id": 125,
      "start": 2680.9800415039062,
      "end": 2682.02001953125,
      "text": " I'll make the statement"
    },
    {
      "id": 126,
      "start": 2682.02001953125,
      "end": 2683.780029296875,
      "text": " from John 3 and verse 30."
    },
    {
      "id": 127,
      "start": 2683.780029296875,
      "end": 2686.740020751953,
      "text": " He must increase and I must decrease."
    },
    {
      "id": 128,
      "start": 2686.740020751953,
      "end": 2688.060028076172,
      "text": " And that's one of those statements"
    },
    {
      "id": 129,
      "start": 2688.060028076172,
      "end": 2689.3400268554688,
      "text": " that John the Baptist makes"
    },
    {
      "id": 130,
      "start": 2689.3400268554688,
      "end": 2690.6200256347656,
      "text": " that just sticks with you."
    },
    {
      "id": 131,
      "start": 2690.6200256347656,
      "end": 2693.5400390625,
      "text": " And it's so appropriate for us,"
    },
    {
      "id": 132,
      "start": 2693.5400390625,
      "end": 2695.5800170898438,
      "text": " a motto, if you will, for our lives"
    },
    {
      "id": 133,
      "start": 2695.5800170898438,
      "end": 2697.060028076172,
      "text": " that we'd understand that"
    },
    {
      "id": 134,
      "start": 2697.060028076172,
      "end": 2698.260040283203,
      "text": " even as Jesus said"
    },
    {
      "id": 135,
      "start": 2698.260040283203,
      "end": 2699.7000427246094,
      "text": " in Matthew chapter number 5"
    },
    {
      "id": 136,
      "start": 2699.7000427246094,
      "end": 2700.7000427246094,
      "text": " and verse number 16,"
    },
    {
      "id": 137,
      "start": 2700.7000427246094,
      "end": 2702.1800231933594,
      "text": " let your light so shine before men"
    },
    {
      "id": 138,
      "start": 2702.1800231933594,
      "end": 2703.6600341796875,
      "text": " that they may see your good works"
    },
    {
      "id": 139,
      "start": 2703.6600341796875,
      "end": 2705.4200439453125,
      "text": " and do what glorify your father,"
    },
    {
      "id": 140,
      "start": 2705.4200439453125,
      "end": 2707.02001953125,
      "text": " which is in heaven."
    },
    {
      "id": 141,
      "start": 2707.02001953125,
      "end": 2708.9400329589844,
      "text": " It's not so that we could be acknowledged"
    },
    {
      "id": 142,
      "start": 2708.9400329589844,
      "end": 2710.060028076172,
      "text": " or recognized and look"
    },
    {
      "id": 143,
      "start": 2710.060028076172,
      "end": 2710.820037841797,
      "text": " at what this person."
    },
    {
      "id": 144,
      "start": 2710.820037841797,
      "end": 2712.500030517578,
      "text": " No, it's so that Jesus"
    },
    {
      "id": 145,
      "start": 2712.500030517578,
      "end": 2714.7000427246094,
      "text": " would be recognized and exalted"
    },
    {
      "id": 146,
      "start": 2714.7000427246094,
      "end": 2716.1400451660156,
      "text": " so that the Lord would receive"
    },
    {
      "id": 147,
      "start": 2716.1400451660156,
      "end": 2717.7000427246094,
      "text": " the glory that is due unto his name."
    },
    {
      "id": 148,
      "start": 2717.7000427246094,
      "end": 2719.780029296875,
      "text": " And John said he must increase."
    },
    {
      "id": 149,
      "start": 2719.820037841797,
      "end": 2721.3400268554688,
      "text": " I must decrease."
    },
    {
      "id": 150,
      "start": 2721.820037841797,
      "end": 2724.1000366210938,
      "text": " But notice what Jesus says of John."
    },
    {
      "id": 151,
      "start": 2726.300018310547,
      "end": 2728.4200439453125,
      "text": " John the Baptist, the Bible says this"
    },
    {
      "id": 152,
      "start": 2728.4200439453125,
      "end": 2730.3400268554688,
      "text": " in verse number 33,"
    },
    {
      "id": 153,
      "start": 2730.5400390625,
      "end": 2732.02001953125,
      "text": " it says he sent unto John"
    },
    {
      "id": 154,
      "start": 2732.02001953125,
      "end": 2733.7000427246094,
      "text": " and he bear witness unto the truth."
    },
    {
      "id": 155,
      "start": 2733.7000427246094,
      "end": 2735.8600463867188,
      "text": " But I receive not testimony from man,"
    },
    {
      "id": 156,
      "start": 2736.2200317382812,
      "end": 2737.300018310547,
      "text": " but these things I say"
    },
    {
      "id": 157,
      "start": 2737.300018310547,
      "end": 2738.5800170898438,
      "text": " that you might be saved."
    },
    {
      "id": 158,
      "start": 2738.9400329589844,
      "end": 2740.9000244140625,
      "text": " He, speaking of John the Baptist,"
    },
    {
      "id": 159,
      "start": 2741.1800231933594,
      "end": 2744.300018310547,
      "text": " was a burning and a shining light."
    },
    {
      "id": 160,
      "start": 2744.9800415039062,
      "end": 2746.3400268554688,
      "text": " And you're willing for a season"
    },
    {
      "id": 161,
      "start": 2746.3400268554688,
      "end": 2747.9400329589844,
      "text": " to rejoice in his light."
    },
    {
      "id": 162,
      "start": 2748.5400390625,
      "end": 2749.820037841797,
      "text": " I just want you to think about"
    },
    {
      "id": 163,
      "start": 2749.820037841797,
      "end": 2752.780029296875,
      "text": " that first phrase of verse number 35"
    },
    {
      "id": 164,
      "start": 2753.060028076172,
      "end": 2754.780029296875,
      "text": " and how the Lord Jesus Christ"
    },
    {
      "id": 165,
      "start": 2754.780029296875,
      "end": 2756.740020751953,
      "text": " described John the Baptist."
    },
    {
      "id": 166,
      "start": 2757.9400329589844,
      "end": 2760.5800170898438,
      "text": " A burning and a shining light."
    },
    {
      "id": 167,
      "start": 2761.5400390625,
      "end": 2763.060028076172,
      "text": " And I want to be described that way."
    },
    {
      "id": 168,
      "start": 2764.1400451660156,
      "end": 2766.500030517578,
      "text": " A burning and a shining light."
    },
    {
      "id": 169,
      "start": 2767.060028076172,
      "end": 2768.5400390625,
      "text": " This morning we spoke about Phoebe,"
    },
    {
      "id": 170,
      "start": 2768.5400390625,
      "end": 2769.260040283203,
      "text": " our sister."
    },
    {
      "id": 171,
      "start": 2770.2200317382812,
      "end": 2774.2200317382812,
      "text": " We spoke about the particular qualities"
    },
    {
      "id": 172,
      "start": 2774.2200317382812,
      "end": 2776.6600341796875,
      "text": " or observations that we made of"
    },
    {
      "id": 173,
      "start": 2777.1000366210938,
      "end": 2779.1400451660156,
      "text": " of this servant of the Lord."
    },
    {
      "id": 174,
      "start": 2779.9400329589844,
      "end": 2782.1800231933594,
      "text": " She was converted and she was committed"
    },
    {
      "id": 175,
      "start": 2782.1800231933594,
      "end": 2783.500030517578,
      "text": " and she was compassionate."
    },
    {
      "id": 176,
      "start": 2785.6200256347656,
      "end": 2787.02001953125,
      "text": " But the verse started with,"
    },
    {
      "id": 177,
      "start": 2787.02001953125,
      "end": 2789.02001953125,
      "text": " I commend unto you, Phoebe, our sister,"
    },
    {
      "id": 178,
      "start": 2789.02001953125,
      "end": 2792.3400268554688,
      "text": " and I said that she was commended by Paul."
    },
    {
      "id": 179,
      "start": 2793.1400451660156,
      "end": 2794.4600219726562,
      "text": " I mean, how wonderful"
    },
    {
      "id": 180,
      "start": 2794.4600219726562,
      "end": 2795.3400268554688,
      "text": " that Paul would rank that"
    },
    {
      "id": 181,
      "start": 2795.3400268554688,
      "end": 2796.1000366210938,
      "text": " under the inspiration"
    },
    {
      "id": 182,
      "start": 2796.1000366210938,
      "end": 2797.060028076172,
      "text": " of the Holy Spirit of God."
    },
    {
      "id": 183,
      "start": 2798.4200439453125,
      "end": 2800.820037841797,
      "text": " But we look here that God in flesh,"
    },
    {
      "id": 184,
      "start": 2800.820037841797,
      "end": 2801.9000244140625,
      "text": " the Lord Jesus Christ,"
    },
    {
      "id": 185,
      "start": 2801.9000244140625,
      "end": 2803.7000427246094,
      "text": " when speaking about John the Baptist,"
    },
    {
      "id": 186,
      "start": 2804.5400390625,
      "end": 2806.02001953125,
      "text": " he says of him"
    },
    {
      "id": 187,
      "start": 2806.8600463867188,
      "end": 2808.4600219726562,
      "text": " that he was a burning"
    },
    {
      "id": 188,
      "start": 2809.060028076172,
      "end": 2811.1800231933594,
      "text": " and a shining light."
    },
    {
      "id": 189,
      "start": 2814.2200317382812,
      "end": 2815.060028076172,
      "text": " Did John the Baptist"
    },
    {
      "id": 190,
      "start": 2815.060028076172,
      "end": 2816.02001953125,
      "text": " have an easy ministry?"
    },
    {
      "id": 191,
      "start": 2817.740020751953,
      "end": 2818.300018310547,
      "text": " No."
    },
    {
      "id": 192,
      "start": 2820.02001953125,
      "end": 2821.500030517578,
      "text": " I mean, did everyone like him?"
    },
    {
      "id": 193,
      "start": 2822.4200439453125,
      "end": 2824.6600341796875,
      "text": " Say, man, come on over here,"
    },
    {
      "id": 194,
      "start": 2824.6600341796875,
      "end": 2825.4600219726562,
      "text": " let's John the Baptist."
    },
    {
      "id": 195,
      "start": 2825.4600219726562,
      "end": 2827.7000427246094,
      "text": " No, he was beheaded."
    },
    {
      "id": 196,
      "start": 2829.3800354003906,
      "end": 2831.300018310547,
      "text": " Right, and that's what happened."
    },
    {
      "id": 197,
      "start": 2831.4600219726562,
      "end": 2833.500030517578,
      "text": " But Jesus said he was a burning"
    },
    {
      "id": 198,
      "start": 2834.060028076172,
      "end": 2835.060028076172,
      "text": " and a shining light."
    },
    {
      "id": 199,
      "start": 2835.740020751953,
      "end": 2836.820037841797,
      "text": " Oh, this evening,"
    },
    {
      "id": 200,
      "start": 2837.5400390625,
      "end": 2839.5800170898438,
      "text": " this familiar passage of scripture"
    },
    {
      "id": 201,
      "start": 2839.5800170898438,
      "end": 2840.4600219726562,
      "text": " in Matthew five,"
    },
    {
      "id": 202,
      "start": 2840.9400329589844,
      "end": 2841.9800415039062,
      "text": " you're the light of the world."
    },
    {
      "id": 203,
      "start": 2843.1800231933594,
      "end": 2844.5800170898438,
      "text": " It's a familiar passage."
    },
    {
      "id": 204,
      "start": 2845.1000366210938,
      "end": 2846.2200317382812,
      "text": " We sing about it."
    },
    {
      "id": 205,
      "start": 2849.060028076172,
      "end": 2850.260040283203,
      "text": " But I wonder this evening."
    },
    {
      "id": 206,
      "start": 2851.4600219726562,
      "end": 2852.4600219726562,
      "text": " How are we doing on"
    },
    {
      "id": 207,
      "start": 2852.4600219726562,
      "end": 2854.1400451660156,
      "text": " fulfilling the responsibility?"
    },
    {
      "id": 208,
      "start": 2855.2200317382812,
      "end": 2857.300018310547,
      "text": " See, I made the statement"
    },
    {
      "id": 209,
      "start": 2857.300018310547,
      "end": 2858.300018310547,
      "text": " a few times already,"
    },
    {
      "id": 210,
      "start": 2858.9400329589844,
      "end": 2860.1800231933594,
      "text": " but Jesus didn't say"
    },
    {
      "id": 211,
      "start": 2860.500030517578,
      "end": 2862.740020751953,
      "text": " but Jesus didn't ask the disciples,"
    },
    {
      "id": 212,
      "start": 2863.4600219726562,
      "end": 2864.260040283203,
      "text": " would you like to be"
    },
    {
      "id": 213,
      "start": 2864.260040283203,
      "end": 2865.02001953125,
      "text": " the light of the world?"
    },
    {
      "id": 214,
      "start": 2866.300018310547,
      "end": 2868.1000366210938,
      "text": " He simply said to the disciples,"
    },
    {
      "id": 215,
      "start": 2868.6600341796875,
      "end": 2870.6600341796875,
      "text": " ye are the light of the world."
    },
    {
      "id": 216,
      "start": 2871.500030517578,
      "end": 2872.5400390625,
      "text": " And as such,"
    },
    {
      "id": 217,
      "start": 2873.3400268554688,
      "end": 2874.9800415039062,
      "text": " we need to walk as children of light"
    },
    {
      "id": 218,
      "start": 2875.8600463867188,
      "end": 2877.3800354003906,
      "text": " in the midst of a crooked"
    },
    {
      "id": 219,
      "start": 2877.3800354003906,
      "end": 2878.9000244140625,
      "text": " and perverse generation."
    },
    {
      "id": 220,
      "start": 2880.260040283203,
      "end": 2881.6200256347656,
      "text": " We shine as lights."
    },
    {
      "id": 221,
      "start": 2882.5800170898438,
      "end": 2883.8600463867188,
      "text": " And what a great privilege"
    },
    {
      "id": 222,
      "start": 2884.300018310547,
      "end": 2885.8600463867188,
      "text": " and opportunity that we have"
    },
    {
      "id": 223,
      "start": 2886.300018310547,
      "end": 2887.9800415039062,
      "text": " in this dark, dark day"
    },
    {
      "id": 224,
      "start": 2888.5400390625,
      "end": 2889.780029296875,
      "text": " to shine as lights."
    },
    {
      "id": 225,
      "start": 2891.1800231933594,
      "end": 2892.5800170898438,
      "text": " Because we are the children of light."
    },
    {
      "id": 226,
      "start": 2893.1800231933594,
      "end": 2894.1000366210938,
      "text": " Let's pray, Father."
    },
    {
      "id": 227,
      "start": 2895.1400451660156,
      "end": 2896.1800231933594,
      "text": " This evening, we've looked"
    },
    {
      "id": 228,
      "start": 2896.1800231933594,
      "end": 2897.3400268554688,
      "text": " at a familiar passage."
    },
    {
      "id": 229,
      "start": 2898.3400268554688,
      "end": 2900.1000366210938,
      "text": " But I pray that we've examined it"
    },
    {
      "id": 230,
      "start": 2900.1000366210938,
      "end": 2902.1800231933594,
      "text": " with fresh eyes and a fresh heart."
    },
    {
      "id": 231,
      "start": 2903.6200256347656,
      "end": 2904.3800354003906,
      "text": " That we would."
    },
    {
      "id": 232,
      "start": 2907.060028076172,
      "end": 2908.6200256347656,
      "text": " Have an honest evaluation."
    },
    {
      "id": 233,
      "start": 2913.300018310547,
      "end": 2915.1800537109375,
      "text": " Of this role that has been assigned"
    },
    {
      "id": 234,
      "start": 2915.1800537109375,
      "end": 2916.6600341796875,
      "text": " to us as your children."
    },
    {
      "id": 235,
      "start": 2920.9800415039062,
      "end": 2923.300048828125,
      "text": " As we honestly evaluate our lives."
    },
    {
      "id": 236,
      "start": 2925.06005859375,
      "end": 2925.9000244140625,
      "text": " That we would."
    },
    {
      "id": 237,
      "start": 2927.8600463867188,
      "end": 2929.7000122070312,
      "text": " Desire to have that testimony"
    },
    {
      "id": 238,
      "start": 2929.7000122070312,
      "end": 2930.9800415039062,
      "text": " that John the Baptist had"
    },
    {
      "id": 239,
      "start": 2931.7000122070312,
      "end": 2933.3400268554688,
      "text": " of being a burning and shining light."
    },
    {
      "id": 240,
      "start": 2934.7400512695312,
      "end": 2936.1800537109375,
      "text": " God, we cannot do it on our own,"
    },
    {
      "id": 241,
      "start": 2936.1800537109375,
      "end": 2938.5400390625,
      "text": " we readily acknowledge that we need you."
    },
    {
      "id": 242,
      "start": 2941.8600463867188,
      "end": 2942.9400024414062,
      "text": " I pray that you'd help us"
    },
    {
      "id": 243,
      "start": 2942.9400024414062,
      "end": 2944.1000366210938,
      "text": " to be emptied of self."
    },
    {
      "id": 244,
      "start": 2945.300048828125,
      "end": 2946.3800048828125,
      "text": " Filled with thy spirit."
    },
    {
      "id": 245,
      "start": 2948.06005859375,
      "end": 2949.300048828125,
      "text": " As we leave this place"
    },
    {
      "id": 246,
      "start": 2949.300048828125,
      "end": 2951.4200439453125,
      "text": " and enter into our region this week."
    },
    {
      "id": 247,
      "start": 2953.3400268554688,
      "end": 2955.260009765625,
      "text": " Would you help us to be mindful of our role?"
    },
    {
      "id": 248,
      "start": 2956.260009765625,
      "end": 2957.6200561523438,
      "text": " Fulfill our responsibility."
    },
    {
      "id": 249,
      "start": 2959.9800415039062,
      "end": 2960.7400512695312,
      "text": " We'll give you the glory"
    },
    {
      "id": 250,
      "start": 2960.7400512695312,
      "end": 2961.5400390625,
      "text": " for all that you'll do."
    },
    {
      "id": 251,
      "start": 2961.5400390625,
      "end": 2963.02001953125,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 252,
      "start": 2963.7000122070312,
      "end": 2964.2200317382812,
      "text": " Would you stand with us?"
    }
  ],
  "processed_at": "2025-04-17T06:26:44.707098"
}