{
  "video_id": "Hoso3B9I6nQ",
  "text": "Chapter number 13, we looked at the first few verses of Acts 13, actually went down through verse number 12 and then scattered our way through Acts 13 and 14 as we looked at that first missionary journey and dealt with the subject matter sent forth. Of course, we started in Matthew in chapter number 9 when the Lord Jesus Christ, the Scriptures tell us that He was moved with compassion on them because they had been scattered as sheep without a shepherd. He had said to pray there for the Lord of the harvest that He would send forth laborers into His harvest. Of course, we know that the harvest is plenteous, the laborers are few, and God moved in the church at Antioch and sent forth these first group of missionaries, and it's amazing as they went into the region of Galatia and the churches that were established and the way in which God worked. And as you near the end of chapter number 14, you have the privilege of being able to read about their follow-up work, and beginning in verse number 21 down through verse number 25, you really see how that they revisited these particular places in which God had led them to. And notice what the Bible says in verse number 21, and when they had preached the gospel to that city and had taught many, they returned again to Lystra and to Iconium and Antioch, confirming the souls of the disciples and exhorting them to continue in the faith and that we must, through much tribulation, enter into the kingdom of God. And when they had ordained them elders in every church and had prayed with fasting, they commended them to the Lord on whom they believed. And what great verses that provide for us, really, the practice and discipline of follow-up and the way in which they wanted to ensure that the local church was established and had leadership. And we come to verse number 27, and the Bible says this, and when they were come and had gathered the church together, they rehearsed all that God had done with them and how He had opened the door of faith unto the Gentiles. I like to use that phrase, if you will, from verse number 27 as our title this evening, they rehearsed all that God had done. They rehearsed all that God had done. God is working. God is always working. Amen? He's always at work. And there are times in which we may not see God at work, we may not understand how God is working, but we understand that God is always at work. And it's a unique privilege that we have as the people of God to be used of God for His honor and for His glory, to be engaged in the work that God is doing. And it is exciting, and there are times in which we're able to see very clearly during the process how God is working and seeing God's hand at work. And there are other times in which after the fact, perhaps days, weeks, or even months or years later, we look back and we hear testimony of how God was at work. And it's a unique privilege of ours to be partners together, co-laborers with the Lord to see what He's doing, how He's working. And here, as these missionaries would fulfill the work that God had called them to, we find that they rehearsed all that God had done with them. We read down through verse number 23, I want you to notice in verse 24 and 25, the Bible says, And after they had passed throughout Pisidia, they came to Pamphylia. And when they had preached the word in Perga, they went down unto Athaliah, and thence sailed to Antioch. Notice what it says, From whence they had been recommended to the grace of God for the work which they fulfilled. You notice, and you'll remember if you were with us last Wednesday evening, that it was there in Acts 13, that they were ministering there at the church at Antioch. And the Holy Ghost, the Lord came and said, Separate me Barnabas and Saul for the work whereunto I have called them. What a joy to read the last words of verse 26, that they fulfilled the work. They completed the task that God had assigned them to, and they returned to Antioch, according to verse number 26. And so, as you look at the text this evening, and really just sharing a few thoughts as we prepare for our missions conference that will begin on Saturday and go through Wednesday, I want you to notice first of all, according to verse number 26, the missionaries returned. The work was fulfilled that was given to them, and they now are going to return to their sending church. You remember that the church at Antioch, as they were ministering and as they were serving, that the Bible said in verse number 3 of Acts 13, that when they had fasted and prayed and laid their hands on them, they sent them away. Now you understand that the technology that exists today did not exist in the first century. The opportunity for instant communication and instant access and updates and phone calls and instant messengers and all of that sort of thing did not exist. And so as the believers at the church at Antioch, as they followed the plan that God had revealed to them, and they sent forth Paul and Barnabas, and John obviously helped them as well for a period of that time, and as they sent them forth, I believe that the people of the church at Antioch, they were praying for them. They did not know specifically what was happening. They did not know all that they would encounter. They did not know the blessings nor the adversity that they would face. But yet, I believe they were engaged in prayer. They were invested in the work. They were co-laborers. Yes, it was true that God would send forth Paul and Barnabas to go and take this first missionary journey, but there were a group of believers that were invested in the work and they were praying for these servants of the Lord. And so as we begin to understand that they're returning to Antioch, and in my mind's eye, if I can just for a moment this evening understand what's happening here in Acts 14 and the excitement that must be brewing, if you will, when word comes that they're returning. Paul and Barnabas, they've been gone and they've been on this journey and now they're returning. There's a level of excitement in my mind on the part of the believers of the church at Antioch. Why? Because they've been praying for these men. They want to know, what is God doing? How has God been working? I've often looked at this portion of Scripture in Acts 14 and often looked at it as being the first missions conference, a time in which these missionaries come back and they return to the sending church. And we understand that today, when we have a missions conference, things are slightly different than they were here in the book of Acts, and it's not that these individual missionaries that were having to come back to us or come to be with us, even for the first time, they're not necessarily sent out from our group, from our midst, as Paul and Barnabas were. But can you imagine the excitement? I mean, listen, there might be some within the church at Antioch there, when they had heard that Paul and Barnabas were returning, that they spread the word, hey, they're coming back and they're going to give us some information. And we notice that they return in verse number 26, but then we notice that the missionaries report. The missionaries return, but then the missionaries report. And what is it that they report? Well, it's interesting, the Bible says, and when they were come, notice this in verse 27, and had gathered the church together. The missionaries return, Paul and Barnabas return to the church at Antioch, and it says that they gathered the church together. And I think it's interesting that you note that in verse number 27, the church, as we know, is an assembly. And we are to assemble, and we come together, and we find here, there's no indication that this particular time of returning was a normal scheduled service, if you will. They had returned, and they were going to report, and the churches gathered, and no doubt there's a level of excitement on the part of these believers, and the Bible then tells us in verse 27, they rehearsed all that God had done with them. And I begin to think about that phrase. I know that we've used it this evening as our title for our message, and the Bible says they rehearsed all that God had done with them. And it says this, and how He, God, had opened the door of faith unto the Gentiles. And I begin to note how that they rehearsed all, and I begin to think about the timing of the journey and the various aspects, and we know that we have some information here in the Word of God with regard to this missionary journey, and we can read Acts 13 and Acts 14, and we can read about the cities and the work that was done, but no doubt every detail isn't provided here for us. And I believe that as they begin to share all that God has done, and they're rehearsing this, can you just for a moment think about the excitement? The individual believers of that church that were co-laborers, they had partnered together, no, we're not going with you, but we're staying here and we're praying for you. And as the missionaries would return and they begin to report, and they would begin to share what God has done, and we find that the Bible says that they rehearsed all that God had done with them. What a joy that God would use us. We understand that even by looking at the way in which the words are used here in this verse of Scripture, that they did not return and say, listen to what we did, listen to how we accomplished, no, this is how the Lord used us. This is what the Lord did in and through us. And as we would begin to consider this period of time, I believe that it was not an hour service. Get in, get out. You understand what I'm saying? Why was it that perhaps, I mean, the Bible doesn't tell us, but if they rehearsed all that God did, I think they were there for a little while. And in my mind, and as I look at the Scriptures, I don't think that people were worried about what time it was, and when we're getting out, and when we're going to get home, and when we can get back to our schedule, our routine. No, they were hearing how God was working. They were hearing how they went into the city, and how the Gospel was preached, and people were saved. I mean, that's exciting. And I believe this evening that as these missionaries reported, and as they gave updates, and as they provided what it was that God was doing, I believe that there's this level of excitement that just continues to brew amongst the believers. Perhaps, as Paul begins to share a specific story, maybe talking about some of the opposition in which they face, but how that God delivered, and how God worked, and how God gave open doors and opportunities. How that there are believers that are sitting there that are listening and hearing what is being rehearsed, and they're mindful of how the Holy Spirit of God had prompted them to pray at specific times for specific things, and they didn't even know all that was going on, but yet they were engaged in prayer. See, the work of God is a work that we have the unique privilege of being in on. We get to serve God. We get to serve alongside one another. We know that Paul would say, as he would write back to the church in Corinth, and of course there was much division and difficulty there, but we're mindful of this, that Paul says this in 1 Corinthians 3 and verse number 5, Who then is Paul? And who is Apollos? But ministers by whom ye believed, even as the Lord gave to every man. Paul says this in verse 6 of 1 Corinthians 3, I have planted, Apollos watered, but God gave the increase. So then neither is he that planteth anything, neither he that watereth, but God that giveth the increase. Now he that planteth and he that watereth are one, and every man shall receive his own reward according to his own labor. Notice this in verse number 9 of 1 Corinthians 3, For we are laborers together with God. Ye are God's husbandry, ye are God's building. I mean, what a joy to understand that God would allow us to serve him. And as we think about this work of missions, and we think about this missions conference that we're going to have, and these three missionary families that are going to be with us, they've never been here before, so it really wouldn't be fair for us to say they're returning because they're just coming for the first time. But as these missionaries come, they're going to give report. They're going to begin to share how God has worked in their lives, how God has brought them to the place of surrender to go to the field in which they're serving, and we'll have the opportunity to hear from missionaries that have been on the field for a lengthy period of time, and then from a missionary family that's just a young family on deputation. They've not been to Uganda yet, but oh, how God has blessed and worked even as they've been on deputation, and to consider what God has done and how God has prepared them and how God has used them. And we believe that as we have the privilege of hearing the reports from the missionaries, I just yesterday was speaking with Brother Maldoff, and I'll give you a little bit of a preview. One of the things, because he's the Southeast Asia director for BIMI, and Papua New Guinea is in the region in which he is the director, and we had the privilege a couple of years ago as a church to give money specifically for Bibles to be distributed in Papua New Guinea. And we took the whole month of June in 2018 to collect money. It was $3 a Bible. We challenged you, and you responded, and I don't remember the exact number now. I think it was, it doesn't matter, it was a good amount of money that we're able to send to the Papua New Guinea Bible Project, and we've received some updates, and I was speaking with Brother Maldoff yesterday, and I said, hey, Brother, I know that you're not leading that project, but it's in your region. On Wednesday night, would you give us an update on that? He said, oh, man, it'd be so exciting to share what God is doing and how God is working. I'm looking forward to hearing that. I'm looking forward to hearing about the work that's taking place and how souls have been saved and lives have been changed. Why? Because the entrance of thy work giveth light, and we had a part in that. Amen? There's going to be somebody that you might meet one day in heaven that you put that $3 to a plate so that a Bible could be purchased, and they got the Word of God, and it changed their life the same way it changed your life. And when we get to hear the report, listen, it's not just, man, when's it going to be done? When are we going to get out? Sometimes we can be like that. Somebody said this, a friend of mine, he said, I don't come to church to get out, I come in to get something. I think it's good. And here we see that the missionaries return, the missionaries report. You don't see it here in these words, but if I were to give a final point to the message this evening, I'd say the people rejoice. The people rejoice. The Bible says that there in verse number 27, and when they were come and had gathered the church together, they rehearsed all that God had done with them and how He, God, had opened the door of faith unto the Gentiles, and there they abode long time with the disciples. I believe there was some rejoicing that was going on. I believe that as they were hearing these reports and hearing these testimonies of how God was working and what God was doing, there were people rejoicing, excited. Perhaps there were times during the report as it was given that maybe one would interrupt and say, can you tell us a little bit more about that? I mean, maybe after the formal part of the meeting, if you will, was completed, that just as we have opportunities, I'm trying to think about it in the light of how we operate when we have a missions conference and how we get to greet the missionaries individually and chat with them and how we can, hey, you shared this in your update and you mentioned this while you were preaching, can you tell me a little bit more about that? How does that work there? What is it that we, how can we pray more effectively for you as you serve in that capacity? And we begin to rejoice in what God is doing, and ultimately we're giving honor and glory to the Lord because He's the one that's done the work. And we're saying to God be the glory. Great things He hath done, but you know what's exciting to be part of it? I've often said over the years for us to be involved in world missions is for us to be involved in what God is doing globally. And God is working globally. It is absolutely exciting. I know sometimes we can get the perspective of how bad things are in America and how the church scene is here in America. I got a periodical across my desk today that said 43% of millennials said they don't know and they don't care whether God exists. That's a high percentage. But we begin to read some things about what God is doing in other parts of the world and how God is working. God is at work. God's at work here too. He's working in America. I know that the things that are on the mainstream media and all that we're being told, it seems so dark and so terrible and so just, and there's a lot of problems, but you know God's working. God's working in the hearts of people. We'll share an update here in just a moment on the back of our bulletin this evening from Brother Deal and he shares how that while they were nearing some door-to-door outreach and what have you and they were in a particular area, community, and they just were met with great levels of opposition. And then COVID came and lockdowns and they had to leave and all sorts of things and they've gotten back to the field and that's one of the neighborhoods that they first went back to and he said, you know, the attitude is completely different. People are open. People are receptive. Why is it that we seek to have updates from our missionaries on a regular basis? Why is it that we take the time to put them on the back of a bulletin every Wednesday evening? Why is it that we take time in our service on Sunday morning to get an update? Because I don't want to hear what God's doing. I have the privilege of being the pastor and reading every letter that comes across my desk. But if we don't share it with you, you don't know what's going on and you have no reason to rejoice. So as we think about this missions conference, and I hope that you'd purpose to be here, I understand schedules and work and all that sort of thing, but when we really understand what's happening and how the missionaries are coming and they're reporting that people are going to rejoice, we see this model here in Acts 14, man, I don't want to miss it. I mean, could you imagine if somebody there, I don't know what was going on in Antioch at this time. I know there's some things going on in our world at this time that can take our attention. A junior has baseball practice, this one has that, this one has that. We can't make it to missions conference because we got this going on. And then they begin to hear what was reported, man, I missed it. I missed it. I don't want to miss it. I'm not saying that because I want to have some level of great attendance or something for the mission. I'm being sincere. I don't want to miss it. I want to know what God's doing and how God's working. I want to know what God has for me. These guys are going to preach messages. What does God have for me? How is he going to work in my heart, in my life? And so this evening as we look at this passage of Scripture and really one final preparation message if you will, as we then turn to our missions conference, they rehearsed all that God had done. God is working. And I am very excited about the opportunity to have a missions conference. I tried to share with someone just in the last few days about missions conference, and they don't go to church. I don't think they're saved. And they just had asked if we had anything busy going on, anything on the schedule, and I shared a little bit about the missions conference. And I mean, they had no concept, no idea whatsoever. And I really didn't expect them to, but they asked a question. I provided an answer. But for us as the people of God, when we think about these missionaries, and man, as I personally and you personally have given dollars to support missions, don't you want to hear how God's working? Don't you want to hear what God's doing? They rehearsed. The missionaries returned, they reported, and the people rejoiced because God was working. Let's pray. Father, we love you. We thank you for loving us. Thank you for your word. Lord, I pray that as we, as a local church, prepare for our missions conference, I pray that our hearts will be soft and tender, receptive. I pray, God, that you would work in our midst, help us as individuals to purpose to be here. Lord, I pray for the missionaries and their families as they travel, that you would give safety and give clarity and wisdom with regard to messages, and Lord, I pray that through all that would be said and done, that you alone would be glorified, that we as thy people would rejoice greatly as we have the privilege of hearing all that you're doing. We're excited. We have a great level of anticipation of how you'd work in our midst. I pray that you'd bless our time of prayer. We thank you for the privilege of prayer. We thank you for the confidence that we have that you hear and answer prayer. I pray that you'd be glorified through the remainder of our service. For it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.039999961853027,
      "text": " Chapter number 13, we looked at the first few verses of Acts 13, actually went down"
    },
    {
      "id": 1,
      "start": 5.039999961853027,
      "end": 9.800000190734863,
      "text": " through verse number 12 and then scattered our way through Acts 13 and 14 as we looked"
    },
    {
      "id": 2,
      "start": 9.800000190734863,
      "end": 14.720000267028809,
      "text": " at that first missionary journey and dealt with the subject matter sent forth."
    },
    {
      "id": 3,
      "start": 14.720000267028809,
      "end": 20.239999771118164,
      "text": " Of course, we started in Matthew in chapter number 9 when the Lord Jesus Christ, the Scriptures"
    },
    {
      "id": 4,
      "start": 20.239999771118164,
      "end": 24.68000030517578,
      "text": " tell us that He was moved with compassion on them because they had been scattered as"
    },
    {
      "id": 5,
      "start": 24.68000030517578,
      "end": 25.959999084472656,
      "text": " sheep without a shepherd."
    },
    {
      "id": 6,
      "start": 25.959999084472656,
      "end": 29.760000228881836,
      "text": " He had said to pray there for the Lord of the harvest that He would send forth laborers"
    },
    {
      "id": 7,
      "start": 29.760000228881836,
      "end": 31.559999465942383,
      "text": " into His harvest."
    },
    {
      "id": 8,
      "start": 31.559999465942383,
      "end": 39.08000183105469,
      "text": " Of course, we know that the harvest is plenteous, the laborers are few, and God moved in the"
    },
    {
      "id": 9,
      "start": 39.08000183105469,
      "end": 44.599998474121094,
      "text": " church at Antioch and sent forth these first group of missionaries, and it's amazing as"
    },
    {
      "id": 10,
      "start": 44.599998474121094,
      "end": 48.119998931884766,
      "text": " they went into the region of Galatia and the churches that were established and the way"
    },
    {
      "id": 11,
      "start": 48.119998931884766,
      "end": 49.31999969482422,
      "text": " in which God worked."
    },
    {
      "id": 12,
      "start": 49.31999969482422,
      "end": 53.599998474121094,
      "text": " And as you near the end of chapter number 14, you have the privilege of being able to"
    },
    {
      "id": 13,
      "start": 53.599998474121094,
      "end": 58.599998474121094,
      "text": " read about their follow-up work, and beginning in verse number 21 down through verse number"
    },
    {
      "id": 14,
      "start": 58.599998474121094,
      "end": 63.7599983215332,
      "text": " 25, you really see how that they revisited these particular places in which God had led"
    },
    {
      "id": 15,
      "start": 63.7599983215332,
      "end": 64.76000213623047,
      "text": " them to."
    },
    {
      "id": 16,
      "start": 64.76000213623047,
      "end": 68.23999786376953,
      "text": " And notice what the Bible says in verse number 21, and when they had preached the gospel"
    },
    {
      "id": 17,
      "start": 68.23999786376953,
      "end": 76.80000305175781,
      "text": " to that city and had taught many, they returned again to Lystra and to Iconium and Antioch,"
    },
    {
      "id": 18,
      "start": 76.80000305175781,
      "end": 82.91999816894531,
      "text": " confirming the souls of the disciples and exhorting them to continue in the faith and"
    },
    {
      "id": 19,
      "start": 82.91999816894531,
      "end": 86.08000183105469,
      "text": " that we must, through much tribulation, enter into the kingdom of God."
    },
    {
      "id": 20,
      "start": 86.08000183105469,
      "end": 91.4000015258789,
      "text": " And when they had ordained them elders in every church and had prayed with fasting,"
    },
    {
      "id": 21,
      "start": 91.4000015258789,
      "end": 96.36000061035156,
      "text": " they commended them to the Lord on whom they believed."
    },
    {
      "id": 22,
      "start": 96.36000061035156,
      "end": 102.16000366210938,
      "text": " And what great verses that provide for us, really, the practice and discipline of follow-up"
    },
    {
      "id": 23,
      "start": 102.16000366210938,
      "end": 106.86000061035156,
      "text": " and the way in which they wanted to ensure that the local church was established and"
    },
    {
      "id": 24,
      "start": 106.86000061035156,
      "end": 107.86000061035156,
      "text": " had leadership."
    },
    {
      "id": 25,
      "start": 107.86000061035156,
      "end": 112.9000015258789,
      "text": " And we come to verse number 27, and the Bible says this, and when they were come and had"
    },
    {
      "id": 26,
      "start": 112.9000015258789,
      "end": 117.73999786376953,
      "text": " gathered the church together, they rehearsed all that God had done with them and how He"
    },
    {
      "id": 27,
      "start": 117.73999786376953,
      "end": 120.41999816894531,
      "text": " had opened the door of faith unto the Gentiles."
    },
    {
      "id": 28,
      "start": 120.41999816894531,
      "end": 126.0999984741211,
      "text": " I like to use that phrase, if you will, from verse number 27 as our title this evening,"
    },
    {
      "id": 29,
      "start": 126.0999984741211,
      "end": 130.6199951171875,
      "text": " they rehearsed all that God had done."
    },
    {
      "id": 30,
      "start": 130.6199951171875,
      "end": 135.05999755859375,
      "text": " They rehearsed all that God had done."
    },
    {
      "id": 31,
      "start": 135.05999755859375,
      "end": 136.05999755859375,
      "text": " God is working."
    },
    {
      "id": 32,
      "start": 136.05999755859375,
      "end": 137.74000549316406,
      "text": " God is always working."
    },
    {
      "id": 33,
      "start": 137.74000549316406,
      "end": 138.74000549316406,
      "text": " Amen?"
    },
    {
      "id": 34,
      "start": 138.74000549316406,
      "end": 140.82000732421875,
      "text": " He's always at work."
    },
    {
      "id": 35,
      "start": 140.82000732421875,
      "end": 147.02000427246094,
      "text": " And there are times in which we may not see God at work, we may not understand how God"
    },
    {
      "id": 36,
      "start": 147.02000427246094,
      "end": 151.97999572753906,
      "text": " is working, but we understand that God is always at work."
    },
    {
      "id": 37,
      "start": 151.97999572753906,
      "end": 157.5800018310547,
      "text": " And it's a unique privilege that we have as the people of God to be used of God for His"
    },
    {
      "id": 38,
      "start": 157.5800018310547,
      "end": 163.66000366210938,
      "text": " honor and for His glory, to be engaged in the work that God is doing."
    },
    {
      "id": 39,
      "start": 163.66000366210938,
      "end": 169.63999938964844,
      "text": " And it is exciting, and there are times in which we're able to see very clearly during"
    },
    {
      "id": 40,
      "start": 169.63999938964844,
      "end": 174.05999755859375,
      "text": " the process how God is working and seeing God's hand at work."
    },
    {
      "id": 41,
      "start": 174.05999755859375,
      "end": 178.94000244140625,
      "text": " And there are other times in which after the fact, perhaps days, weeks, or even months"
    },
    {
      "id": 42,
      "start": 178.94000244140625,
      "end": 186.4199981689453,
      "text": " or years later, we look back and we hear testimony of how God was at work."
    },
    {
      "id": 43,
      "start": 186.4199981689453,
      "end": 192.3800048828125,
      "text": " And it's a unique privilege of ours to be partners together, co-laborers with the Lord"
    },
    {
      "id": 44,
      "start": 192.3800048828125,
      "end": 195.17999267578125,
      "text": " to see what He's doing, how He's working."
    },
    {
      "id": 45,
      "start": 195.17999267578125,
      "end": 201.4199981689453,
      "text": " And here, as these missionaries would fulfill the work that God had called them to, we find"
    },
    {
      "id": 46,
      "start": 201.4199981689453,
      "end": 204.94000244140625,
      "text": " that they rehearsed all that God had done with them."
    },
    {
      "id": 47,
      "start": 204.94000244140625,
      "end": 210.05999755859375,
      "text": " We read down through verse number 23, I want you to notice in verse 24 and 25, the Bible"
    },
    {
      "id": 48,
      "start": 210.05999755859375,
      "end": 213.6999969482422,
      "text": " says, And after they had passed throughout Pisidia, they came to Pamphylia."
    },
    {
      "id": 49,
      "start": 213.6999969482422,
      "end": 219.05999755859375,
      "text": " And when they had preached the word in Perga, they went down unto Athaliah, and thence sailed"
    },
    {
      "id": 50,
      "start": 219.05999755859375,
      "end": 220.94000244140625,
      "text": " to Antioch."
    },
    {
      "id": 51,
      "start": 220.94000244140625,
      "end": 225.74000549316406,
      "text": " Notice what it says, From whence they had been recommended to the grace of God for the"
    },
    {
      "id": 52,
      "start": 225.74000549316406,
      "end": 228.33999633789062,
      "text": " work which they fulfilled."
    },
    {
      "id": 53,
      "start": 228.33999633789062,
      "end": 231.5800018310547,
      "text": " You notice, and you'll remember if you were with us last Wednesday evening, that it was"
    },
    {
      "id": 54,
      "start": 231.5800018310547,
      "end": 235.82000732421875,
      "text": " there in Acts 13, that they were ministering there at the church at Antioch."
    },
    {
      "id": 55,
      "start": 235.82000732421875,
      "end": 240.86000061035156,
      "text": " And the Holy Ghost, the Lord came and said, Separate me Barnabas and Saul for the work"
    },
    {
      "id": 56,
      "start": 240.86000061035156,
      "end": 243.5,
      "text": " whereunto I have called them."
    },
    {
      "id": 57,
      "start": 243.5,
      "end": 251.17999267578125,
      "text": " What a joy to read the last words of verse 26, that they fulfilled the work."
    },
    {
      "id": 58,
      "start": 251.17999267578125,
      "end": 256.7200012207031,
      "text": " They completed the task that God had assigned them to, and they returned to Antioch, according"
    },
    {
      "id": 59,
      "start": 256.7200012207031,
      "end": 258.3800048828125,
      "text": " to verse number 26."
    },
    {
      "id": 60,
      "start": 258.3800048828125,
      "end": 262.3399963378906,
      "text": " And so, as you look at the text this evening, and really just sharing a few thoughts as"
    },
    {
      "id": 61,
      "start": 262.3399963378906,
      "end": 267.1400146484375,
      "text": " we prepare for our missions conference that will begin on Saturday and go through Wednesday,"
    },
    {
      "id": 62,
      "start": 267.1400146484375,
      "end": 271.94000244140625,
      "text": " I want you to notice first of all, according to verse number 26, the missionaries returned."
    },
    {
      "id": 63,
      "start": 271.94000244140625,
      "end": 276.17999267578125,
      "text": " The work was fulfilled that was given to them, and they now are going to return to"
    },
    {
      "id": 64,
      "start": 276.17999267578125,
      "end": 277.4200134277344,
      "text": " their sending church."
    },
    {
      "id": 65,
      "start": 277.4200134277344,
      "end": 282.5,
      "text": " You remember that the church at Antioch, as they were ministering and as they were serving,"
    },
    {
      "id": 66,
      "start": 282.5,
      "end": 286.5799865722656,
      "text": " that the Bible said in verse number 3 of Acts 13, that when they had fasted and prayed and"
    },
    {
      "id": 67,
      "start": 286.5799865722656,
      "end": 291.0799865722656,
      "text": " laid their hands on them, they sent them away."
    },
    {
      "id": 68,
      "start": 291.0799865722656,
      "end": 297.1000061035156,
      "text": " Now you understand that the technology that exists today did not exist in the first century."
    },
    {
      "id": 69,
      "start": 297.1000061035156,
      "end": 303.6199951171875,
      "text": " The opportunity for instant communication and instant access and updates and phone calls"
    },
    {
      "id": 70,
      "start": 303.6199951171875,
      "end": 307.67999267578125,
      "text": " and instant messengers and all of that sort of thing did not exist."
    },
    {
      "id": 71,
      "start": 307.67999267578125,
      "end": 314.1400146484375,
      "text": " And so as the believers at the church at Antioch, as they followed the plan that God had revealed"
    },
    {
      "id": 72,
      "start": 314.1400146484375,
      "end": 319.9800109863281,
      "text": " to them, and they sent forth Paul and Barnabas, and John obviously helped them as well for"
    },
    {
      "id": 73,
      "start": 319.9800109863281,
      "end": 325.29998779296875,
      "text": " a period of that time, and as they sent them forth, I believe that the people of the church"
    },
    {
      "id": 74,
      "start": 325.29998779296875,
      "end": 327.70001220703125,
      "text": " at Antioch, they were praying for them."
    },
    {
      "id": 75,
      "start": 327.70001220703125,
      "end": 330.3800048828125,
      "text": " They did not know specifically what was happening."
    },
    {
      "id": 76,
      "start": 330.3800048828125,
      "end": 333.1000061035156,
      "text": " They did not know all that they would encounter."
    },
    {
      "id": 77,
      "start": 333.1000061035156,
      "end": 337.260009765625,
      "text": " They did not know the blessings nor the adversity that they would face."
    },
    {
      "id": 78,
      "start": 337.260009765625,
      "end": 340.5799865722656,
      "text": " But yet, I believe they were engaged in prayer."
    },
    {
      "id": 79,
      "start": 340.5799865722656,
      "end": 342.3399963378906,
      "text": " They were invested in the work."
    },
    {
      "id": 80,
      "start": 342.3399963378906,
      "end": 343.3399963378906,
      "text": " They were co-laborers."
    },
    {
      "id": 81,
      "start": 343.3399963378906,
      "end": 348.1400146484375,
      "text": " Yes, it was true that God would send forth Paul and Barnabas to go and take this first"
    },
    {
      "id": 82,
      "start": 348.1400146484375,
      "end": 352.6199951171875,
      "text": " missionary journey, but there were a group of believers that were invested in the work"
    },
    {
      "id": 83,
      "start": 352.6199951171875,
      "end": 356.739990234375,
      "text": " and they were praying for these servants of the Lord."
    },
    {
      "id": 84,
      "start": 356.739990234375,
      "end": 361.5799865722656,
      "text": " And so as we begin to understand that they're returning to Antioch, and in my mind's eye,"
    },
    {
      "id": 85,
      "start": 361.5799865722656,
      "end": 367.4599914550781,
      "text": " if I can just for a moment this evening understand what's happening here in Acts 14 and the excitement"
    },
    {
      "id": 86,
      "start": 367.4599914550781,
      "end": 372.739990234375,
      "text": " that must be brewing, if you will, when word comes that they're returning."
    },
    {
      "id": 87,
      "start": 372.739990234375,
      "end": 377.7799987792969,
      "text": " Paul and Barnabas, they've been gone and they've been on this journey and now they're returning."
    },
    {
      "id": 88,
      "start": 377.7799987792969,
      "end": 382.0199890136719,
      "text": " There's a level of excitement in my mind on the part of the believers of the church"
    },
    {
      "id": 89,
      "start": 382.0199890136719,
      "end": 383.0199890136719,
      "text": " at Antioch."
    },
    {
      "id": 90,
      "start": 383.0199890136719,
      "end": 384.0199890136719,
      "text": " Why?"
    },
    {
      "id": 91,
      "start": 384.0199890136719,
      "end": 385.4599914550781,
      "text": " Because they've been praying for these men."
    },
    {
      "id": 92,
      "start": 385.4599914550781,
      "end": 387.260009765625,
      "text": " They want to know, what is God doing?"
    },
    {
      "id": 93,
      "start": 387.260009765625,
      "end": 388.7799987792969,
      "text": " How has God been working?"
    },
    {
      "id": 94,
      "start": 388.7799987792969,
      "end": 392.70001220703125,
      "text": " I've often looked at this portion of Scripture in Acts 14 and often looked at it as being"
    },
    {
      "id": 95,
      "start": 392.70001220703125,
      "end": 397.5799865722656,
      "text": " the first missions conference, a time in which these missionaries come back and they return"
    },
    {
      "id": 96,
      "start": 397.5799865722656,
      "end": 398.94000244140625,
      "text": " to the sending church."
    },
    {
      "id": 97,
      "start": 398.94000244140625,
      "end": 403.7799987792969,
      "text": " And we understand that today, when we have a missions conference, things are slightly"
    },
    {
      "id": 98,
      "start": 403.7799987792969,
      "end": 409.1600036621094,
      "text": " different than they were here in the book of Acts, and it's not that these individual"
    },
    {
      "id": 99,
      "start": 409.1600036621094,
      "end": 414.0199890136719,
      "text": " missionaries that were having to come back to us or come to be with us, even for the"
    },
    {
      "id": 100,
      "start": 414.0199890136719,
      "end": 419.5,
      "text": " first time, they're not necessarily sent out from our group, from our midst, as Paul and"
    },
    {
      "id": 101,
      "start": 419.5,
      "end": 421.1000061035156,
      "text": " Barnabas were."
    },
    {
      "id": 102,
      "start": 421.1000061035156,
      "end": 423.05999755859375,
      "text": " But can you imagine the excitement?"
    },
    {
      "id": 103,
      "start": 423.05999755859375,
      "end": 429.5799865722656,
      "text": " I mean, listen, there might be some within the church at Antioch there, when they had"
    },
    {
      "id": 104,
      "start": 429.5799865722656,
      "end": 435.17999267578125,
      "text": " heard that Paul and Barnabas were returning, that they spread the word, hey, they're coming"
    },
    {
      "id": 105,
      "start": 435.17999267578125,
      "end": 438.5,
      "text": " back and they're going to give us some information."
    },
    {
      "id": 106,
      "start": 438.5,
      "end": 442.82000732421875,
      "text": " And we notice that they return in verse number 26, but then we notice that the missionaries"
    },
    {
      "id": 107,
      "start": 442.82000732421875,
      "end": 443.82000732421875,
      "text": " report."
    },
    {
      "id": 108,
      "start": 443.82000732421875,
      "end": 447.94000244140625,
      "text": " The missionaries return, but then the missionaries report."
    },
    {
      "id": 109,
      "start": 447.94000244140625,
      "end": 449.5,
      "text": " And what is it that they report?"
    },
    {
      "id": 110,
      "start": 449.5,
      "end": 453.5799865722656,
      "text": " Well, it's interesting, the Bible says, and when they were come, notice this in verse"
    },
    {
      "id": 111,
      "start": 453.5799865722656,
      "end": 459.4599914550781,
      "text": " 27, and had gathered the church together."
    },
    {
      "id": 112,
      "start": 459.4599914550781,
      "end": 463.70001220703125,
      "text": " The missionaries return, Paul and Barnabas return to the church at Antioch, and it says"
    },
    {
      "id": 113,
      "start": 463.70001220703125,
      "end": 466.29998779296875,
      "text": " that they gathered the church together."
    },
    {
      "id": 114,
      "start": 466.29998779296875,
      "end": 470.5799865722656,
      "text": " And I think it's interesting that you note that in verse number 27, the church, as we"
    },
    {
      "id": 115,
      "start": 470.5799865722656,
      "end": 472.739990234375,
      "text": " know, is an assembly."
    },
    {
      "id": 116,
      "start": 472.739990234375,
      "end": 478.8599853515625,
      "text": " And we are to assemble, and we come together, and we find here, there's no indication that"
    },
    {
      "id": 117,
      "start": 478.8599853515625,
      "end": 484.6199951171875,
      "text": " this particular time of returning was a normal scheduled service, if you will."
    },
    {
      "id": 118,
      "start": 484.6199951171875,
      "end": 489.70001220703125,
      "text": " They had returned, and they were going to report, and the churches gathered, and no"
    },
    {
      "id": 119,
      "start": 489.70001220703125,
      "end": 494.4200134277344,
      "text": " doubt there's a level of excitement on the part of these believers, and the Bible then"
    },
    {
      "id": 120,
      "start": 494.4200134277344,
      "end": 500.5,
      "text": " tells us in verse 27, they rehearsed all that God had done with them."
    },
    {
      "id": 121,
      "start": 500.5,
      "end": 503.17999267578125,
      "text": " And I begin to think about that phrase."
    },
    {
      "id": 122,
      "start": 503.17999267578125,
      "end": 507.9800109863281,
      "text": " I know that we've used it this evening as our title for our message, and the Bible says"
    },
    {
      "id": 123,
      "start": 507.9800109863281,
      "end": 514.3200073242188,
      "text": " they rehearsed all that God had done with them."
    },
    {
      "id": 124,
      "start": 514.3200073242188,
      "end": 522.47998046875,
      "text": " And it says this, and how He, God, had opened the door of faith unto the Gentiles."
    },
    {
      "id": 125,
      "start": 522.47998046875,
      "end": 528.760009765625,
      "text": " And I begin to note how that they rehearsed all, and I begin to think about the timing"
    },
    {
      "id": 126,
      "start": 528.760009765625,
      "end": 533.6199951171875,
      "text": " of the journey and the various aspects, and we know that we have some information here"
    },
    {
      "id": 127,
      "start": 533.6199951171875,
      "end": 538.4400024414062,
      "text": " in the Word of God with regard to this missionary journey, and we can read Acts 13 and Acts"
    },
    {
      "id": 128,
      "start": 538.4400024414062,
      "end": 543.8800048828125,
      "text": " 14, and we can read about the cities and the work that was done, but no doubt every detail"
    },
    {
      "id": 129,
      "start": 543.9400024414062,
      "end": 545.760009765625,
      "text": " isn't provided here for us."
    },
    {
      "id": 130,
      "start": 545.760009765625,
      "end": 551.3599853515625,
      "text": " And I believe that as they begin to share all that God has done, and they're rehearsing"
    },
    {
      "id": 131,
      "start": 551.3599853515625,
      "end": 557.7999877929688,
      "text": " this, can you just for a moment think about the excitement?"
    },
    {
      "id": 132,
      "start": 557.7999877929688,
      "end": 562.280029296875,
      "text": " The individual believers of that church that were co-laborers, they had partnered together,"
    },
    {
      "id": 133,
      "start": 562.280029296875,
      "end": 566.2999877929688,
      "text": " no, we're not going with you, but we're staying here and we're praying for you."
    },
    {
      "id": 134,
      "start": 566.2999877929688,
      "end": 570.7999877929688,
      "text": " And as the missionaries would return and they begin to report, and they would begin to share"
    },
    {
      "id": 135,
      "start": 570.8400268554688,
      "end": 575.9600219726562,
      "text": " what God has done, and we find that the Bible says that they rehearsed all that God had"
    },
    {
      "id": 136,
      "start": 575.9600219726562,
      "end": 577.9000244140625,
      "text": " done with them."
    },
    {
      "id": 137,
      "start": 577.9000244140625,
      "end": 582.2000122070312,
      "text": " What a joy that God would use us."
    },
    {
      "id": 138,
      "start": 582.2000122070312,
      "end": 586.8800048828125,
      "text": " We understand that even by looking at the way in which the words are used here in this"
    },
    {
      "id": 139,
      "start": 586.8800048828125,
      "end": 591.280029296875,
      "text": " verse of Scripture, that they did not return and say, listen to what we did, listen to"
    },
    {
      "id": 140,
      "start": 591.280029296875,
      "end": 595.47998046875,
      "text": " how we accomplished, no, this is how the Lord used us."
    },
    {
      "id": 141,
      "start": 595.47998046875,
      "end": 597.9199829101562,
      "text": " This is what the Lord did in and through us."
    },
    {
      "id": 142,
      "start": 598.0399780273438,
      "end": 605.3599853515625,
      "text": " And as we would begin to consider this period of time, I believe that it was not an hour"
    },
    {
      "id": 143,
      "start": 605.3599853515625,
      "end": 606.3599853515625,
      "text": " service."
    },
    {
      "id": 144,
      "start": 606.3599853515625,
      "end": 609.8800048828125,
      "text": " Get in, get out."
    },
    {
      "id": 145,
      "start": 609.8800048828125,
      "end": 612.4199829101562,
      "text": " You understand what I'm saying?"
    },
    {
      "id": 146,
      "start": 612.4199829101562,
      "end": 617.2000122070312,
      "text": " Why was it that perhaps, I mean, the Bible doesn't tell us, but if they rehearsed all"
    },
    {
      "id": 147,
      "start": 617.2000122070312,
      "end": 621.9199829101562,
      "text": " that God did, I think they were there for a little while."
    },
    {
      "id": 148,
      "start": 621.9199829101562,
      "end": 626.9199829101562,
      "text": " And in my mind, and as I look at the Scriptures, I don't think that people were worried about"
    },
    {
      "id": 149,
      "start": 626.9199829101562,
      "end": 630.2000122070312,
      "text": " what time it was, and when we're getting out, and when we're going to get home, and"
    },
    {
      "id": 150,
      "start": 630.2000122070312,
      "end": 633.2000122070312,
      "text": " when we can get back to our schedule, our routine."
    },
    {
      "id": 151,
      "start": 633.2000122070312,
      "end": 636.6400146484375,
      "text": " No, they were hearing how God was working."
    },
    {
      "id": 152,
      "start": 636.6400146484375,
      "end": 642.8800048828125,
      "text": " They were hearing how they went into the city, and how the Gospel was preached, and people"
    },
    {
      "id": 153,
      "start": 642.8800048828125,
      "end": 643.8800048828125,
      "text": " were saved."
    },
    {
      "id": 154,
      "start": 643.8800048828125,
      "end": 647.9600219726562,
      "text": " I mean, that's exciting."
    },
    {
      "id": 155,
      "start": 647.9600219726562,
      "end": 654.0800170898438,
      "text": " And I believe this evening that as these missionaries reported, and as they gave updates, and as"
    },
    {
      "id": 156,
      "start": 654.0800170898438,
      "end": 660.0,
      "text": " they provided what it was that God was doing, I believe that there's this level of excitement"
    },
    {
      "id": 157,
      "start": 660.0,
      "end": 665.7999877929688,
      "text": " that just continues to brew amongst the believers."
    },
    {
      "id": 158,
      "start": 665.7999877929688,
      "end": 673.239990234375,
      "text": " Perhaps, as Paul begins to share a specific story, maybe talking about some of the opposition"
    },
    {
      "id": 159,
      "start": 673.239990234375,
      "end": 678.3200073242188,
      "text": " in which they face, but how that God delivered, and how God worked, and how God gave open"
    },
    {
      "id": 160,
      "start": 678.3200073242188,
      "end": 680.0399780273438,
      "text": " doors and opportunities."
    },
    {
      "id": 161,
      "start": 680.0399780273438,
      "end": 683.6799926757812,
      "text": " How that there are believers that are sitting there that are listening and hearing what"
    },
    {
      "id": 162,
      "start": 683.6799926757812,
      "end": 688.8800048828125,
      "text": " is being rehearsed, and they're mindful of how the Holy Spirit of God had prompted them"
    },
    {
      "id": 163,
      "start": 688.8800048828125,
      "end": 694.8800048828125,
      "text": " to pray at specific times for specific things, and they didn't even know all that was going"
    },
    {
      "id": 164,
      "start": 694.8800048828125,
      "end": 698.52001953125,
      "text": " on, but yet they were engaged in prayer."
    },
    {
      "id": 165,
      "start": 698.52001953125,
      "end": 706.52001953125,
      "text": " See, the work of God is a work that we have the unique privilege of being in on."
    },
    {
      "id": 166,
      "start": 706.52001953125,
      "end": 707.6199951171875,
      "text": " We get to serve God."
    },
    {
      "id": 167,
      "start": 707.6199951171875,
      "end": 711.2000122070312,
      "text": " We get to serve alongside one another."
    },
    {
      "id": 168,
      "start": 711.239990234375,
      "end": 716.0399780273438,
      "text": " We know that Paul would say, as he would write back to the church in Corinth, and of course"
    },
    {
      "id": 169,
      "start": 716.0399780273438,
      "end": 722.1199951171875,
      "text": " there was much division and difficulty there, but we're mindful of this, that Paul says"
    },
    {
      "id": 170,
      "start": 722.1199951171875,
      "end": 725.4000244140625,
      "text": " this in 1 Corinthians 3 and verse number 5,"
    },
    {
      "id": 171,
      "start": 725.4000244140625,
      "end": 727.0800170898438,
      "text": " Who then is Paul?"
    },
    {
      "id": 172,
      "start": 727.0800170898438,
      "end": 729.219970703125,
      "text": " And who is Apollos?"
    },
    {
      "id": 173,
      "start": 729.219970703125,
      "end": 734.9600219726562,
      "text": " But ministers by whom ye believed, even as the Lord gave to every man."
    },
    {
      "id": 174,
      "start": 734.9600219726562,
      "end": 737.47998046875,
      "text": " Paul says this in verse 6 of 1 Corinthians 3,"
    },
    {
      "id": 175,
      "start": 737.47998046875,
      "end": 743.4000244140625,
      "text": " I have planted, Apollos watered, but God gave the increase."
    },
    {
      "id": 176,
      "start": 743.4000244140625,
      "end": 748.719970703125,
      "text": " So then neither is he that planteth anything, neither he that watereth, but God that giveth"
    },
    {
      "id": 177,
      "start": 748.719970703125,
      "end": 750.47998046875,
      "text": " the increase."
    },
    {
      "id": 178,
      "start": 750.47998046875,
      "end": 754.5999755859375,
      "text": " Now he that planteth and he that watereth are one, and every man shall receive his own"
    },
    {
      "id": 179,
      "start": 754.5999755859375,
      "end": 757.2000122070312,
      "text": " reward according to his own labor."
    },
    {
      "id": 180,
      "start": 757.2000122070312,
      "end": 760.239990234375,
      "text": " Notice this in verse number 9 of 1 Corinthians 3,"
    },
    {
      "id": 181,
      "start": 760.239990234375,
      "end": 765.5599975585938,
      "text": " For we are laborers together with God."
    },
    {
      "id": 182,
      "start": 765.5599975585938,
      "end": 770.280029296875,
      "text": " Ye are God's husbandry, ye are God's building."
    },
    {
      "id": 183,
      "start": 770.280029296875,
      "end": 775.3200073242188,
      "text": " I mean, what a joy to understand that God would allow us to serve him."
    },
    {
      "id": 184,
      "start": 775.3200073242188,
      "end": 779.219970703125,
      "text": " And as we think about this work of missions, and we think about this missions conference"
    },
    {
      "id": 185,
      "start": 779.219970703125,
      "end": 782.8400268554688,
      "text": " that we're going to have, and these three missionary families that are going to be with"
    },
    {
      "id": 186,
      "start": 782.8400268554688,
      "end": 786.47998046875,
      "text": " us, they've never been here before, so it really wouldn't be fair for us to say they're"
    },
    {
      "id": 187,
      "start": 786.47998046875,
      "end": 789.8599853515625,
      "text": " returning because they're just coming for the first time."
    },
    {
      "id": 188,
      "start": 789.8599853515625,
      "end": 793.0399780273438,
      "text": " But as these missionaries come, they're going to give report."
    },
    {
      "id": 189,
      "start": 793.0399780273438,
      "end": 798.0,
      "text": " They're going to begin to share how God has worked in their lives, how God has brought"
    },
    {
      "id": 190,
      "start": 798.0,
      "end": 802.47998046875,
      "text": " them to the place of surrender to go to the field in which they're serving, and we'll"
    },
    {
      "id": 191,
      "start": 802.47998046875,
      "end": 806.6199951171875,
      "text": " have the opportunity to hear from missionaries that have been on the field for a lengthy"
    },
    {
      "id": 192,
      "start": 806.6199951171875,
      "end": 812.0,
      "text": " period of time, and then from a missionary family that's just a young family on deputation."
    },
    {
      "id": 193,
      "start": 812.0,
      "end": 816.97998046875,
      "text": " They've not been to Uganda yet, but oh, how God has blessed and worked even as they've"
    },
    {
      "id": 194,
      "start": 816.97998046875,
      "end": 821.9600219726562,
      "text": " been on deputation, and to consider what God has done and how God has prepared them and"
    },
    {
      "id": 195,
      "start": 821.9600219726562,
      "end": 824.719970703125,
      "text": " how God has used them."
    },
    {
      "id": 196,
      "start": 824.719970703125,
      "end": 828.760009765625,
      "text": " And we believe that as we have the privilege of hearing the reports from the missionaries,"
    },
    {
      "id": 197,
      "start": 828.760009765625,
      "end": 832.6400146484375,
      "text": " I just yesterday was speaking with Brother Maldoff, and I'll give you a little bit of"
    },
    {
      "id": 198,
      "start": 832.6400146484375,
      "end": 833.9600219726562,
      "text": " a preview."
    },
    {
      "id": 199,
      "start": 833.9600219726562,
      "end": 839.719970703125,
      "text": " One of the things, because he's the Southeast Asia director for BIMI, and Papua New Guinea"
    },
    {
      "id": 200,
      "start": 839.719970703125,
      "end": 845.1599731445312,
      "text": " is in the region in which he is the director, and we had the privilege a couple of years"
    },
    {
      "id": 201,
      "start": 845.1599731445312,
      "end": 851.8400268554688,
      "text": " ago as a church to give money specifically for Bibles to be distributed in Papua New Guinea."
    },
    {
      "id": 202,
      "start": 852.719970703125,
      "end": 855.5999755859375,
      "text": " And we took the whole month of June in 2018 to collect money."
    },
    {
      "id": 203,
      "start": 855.5999755859375,
      "end": 856.7999877929688,
      "text": " It was $3 a Bible."
    },
    {
      "id": 204,
      "start": 856.7999877929688,
      "end": 860.8400268554688,
      "text": " We challenged you, and you responded, and I don't remember the exact number now."
    },
    {
      "id": 205,
      "start": 860.8400268554688,
      "end": 864.8800048828125,
      "text": " I think it was, it doesn't matter, it was a good amount of money that we're able to"
    },
    {
      "id": 206,
      "start": 864.8800048828125,
      "end": 869.9199829101562,
      "text": " send to the Papua New Guinea Bible Project, and we've received some updates, and I was"
    },
    {
      "id": 207,
      "start": 869.9199829101562,
      "end": 873.5599975585938,
      "text": " speaking with Brother Maldoff yesterday, and I said, hey, Brother, I know that you're not"
    },
    {
      "id": 208,
      "start": 873.5599975585938,
      "end": 876.3599853515625,
      "text": " leading that project, but it's in your region."
    },
    {
      "id": 209,
      "start": 876.3599853515625,
      "end": 878.4400024414062,
      "text": " On Wednesday night, would you give us an update on that?"
    },
    {
      "id": 210,
      "start": 878.4400024414062,
      "end": 882.8400268554688,
      "text": " He said, oh, man, it'd be so exciting to share what God is doing and how God is working."
    },
    {
      "id": 211,
      "start": 882.8400268554688,
      "end": 885.5999755859375,
      "text": " I'm looking forward to hearing that."
    },
    {
      "id": 212,
      "start": 885.5999755859375,
      "end": 891.760009765625,
      "text": " I'm looking forward to hearing about the work that's taking place and how souls have been"
    },
    {
      "id": 213,
      "start": 891.760009765625,
      "end": 893.7999877929688,
      "text": " saved and lives have been changed."
    },
    {
      "id": 214,
      "start": 893.7999877929688,
      "end": 894.7999877929688,
      "text": " Why?"
    },
    {
      "id": 215,
      "start": 894.7999877929688,
      "end": 899.47998046875,
      "text": " Because the entrance of thy work giveth light, and we had a part in that."
    },
    {
      "id": 216,
      "start": 899.47998046875,
      "end": 900.47998046875,
      "text": " Amen?"
    },
    {
      "id": 217,
      "start": 900.47998046875,
      "end": 906.47998046875,
      "text": " There's going to be somebody that you might meet one day in heaven that you put that $3"
    },
    {
      "id": 218,
      "start": 906.47998046875,
      "end": 913.0,
      "text": " to a plate so that a Bible could be purchased, and they got the Word of God, and it changed"
    },
    {
      "id": 219,
      "start": 913.0,
      "end": 916.4400024414062,
      "text": " their life the same way it changed your life."
    },
    {
      "id": 220,
      "start": 916.4400024414062,
      "end": 920.5999755859375,
      "text": " And when we get to hear the report, listen, it's not just, man, when's it going to be"
    },
    {
      "id": 221,
      "start": 920.5999755859375,
      "end": 921.5999755859375,
      "text": " done?"
    },
    {
      "id": 222,
      "start": 921.5999755859375,
      "end": 923.5999755859375,
      "text": " When are we going to get out?"
    },
    {
      "id": 223,
      "start": 923.5999755859375,
      "end": 926.8400268554688,
      "text": " Sometimes we can be like that."
    },
    {
      "id": 224,
      "start": 926.8400268554688,
      "end": 929.9199829101562,
      "text": " Somebody said this, a friend of mine, he said, I don't come to church to get out, I come"
    },
    {
      "id": 225,
      "start": 929.9199829101562,
      "end": 932.1199951171875,
      "text": " in to get something."
    },
    {
      "id": 226,
      "start": 932.1199951171875,
      "end": 935.280029296875,
      "text": " I think it's good."
    },
    {
      "id": 227,
      "start": 935.280029296875,
      "end": 941.5999755859375,
      "text": " And here we see that the missionaries return, the missionaries report."
    },
    {
      "id": 228,
      "start": 941.5999755859375,
      "end": 946.1599731445312,
      "text": " You don't see it here in these words, but if I were to give a final point to the message"
    },
    {
      "id": 229,
      "start": 946.1599731445312,
      "end": 949.1199951171875,
      "text": " this evening, I'd say the people rejoice."
    },
    {
      "id": 230,
      "start": 949.1199951171875,
      "end": 950.47998046875,
      "text": " The people rejoice."
    },
    {
      "id": 231,
      "start": 950.47998046875,
      "end": 954.280029296875,
      "text": " The Bible says that there in verse number 27, and when they were come and had gathered"
    },
    {
      "id": 232,
      "start": 954.280029296875,
      "end": 960.0,
      "text": " the church together, they rehearsed all that God had done with them and how He, God, had"
    },
    {
      "id": 233,
      "start": 960.0,
      "end": 966.760009765625,
      "text": " opened the door of faith unto the Gentiles, and there they abode long time with the disciples."
    },
    {
      "id": 234,
      "start": 966.760009765625,
      "end": 969.6400146484375,
      "text": " I believe there was some rejoicing that was going on."
    },
    {
      "id": 235,
      "start": 969.6400146484375,
      "end": 974.7999877929688,
      "text": " I believe that as they were hearing these reports and hearing these testimonies of how"
    },
    {
      "id": 236,
      "start": 974.7999877929688,
      "end": 980.3200073242188,
      "text": " God was working and what God was doing, there were people rejoicing, excited."
    },
    {
      "id": 237,
      "start": 980.3200073242188,
      "end": 985.280029296875,
      "text": " Perhaps there were times during the report as it was given that maybe one would interrupt"
    },
    {
      "id": 238,
      "start": 985.280029296875,
      "end": 988.3200073242188,
      "text": " and say, can you tell us a little bit more about that?"
    },
    {
      "id": 239,
      "start": 988.3200073242188,
      "end": 993.5999755859375,
      "text": " I mean, maybe after the formal part of the meeting, if you will, was completed, that"
    },
    {
      "id": 240,
      "start": 993.5999755859375,
      "end": 998.3599853515625,
      "text": " just as we have opportunities, I'm trying to think about it in the light of how we operate"
    },
    {
      "id": 241,
      "start": 998.3599853515625,
      "end": 1002.7999877929688,
      "text": " when we have a missions conference and how we get to greet the missionaries individually"
    },
    {
      "id": 242,
      "start": 1002.7999877929688,
      "end": 1007.52001953125,
      "text": " and chat with them and how we can, hey, you shared this in your update and you mentioned"
    },
    {
      "id": 243,
      "start": 1007.52001953125,
      "end": 1010.3200073242188,
      "text": " this while you were preaching, can you tell me a little bit more about that?"
    },
    {
      "id": 244,
      "start": 1010.3200073242188,
      "end": 1011.4000244140625,
      "text": " How does that work there?"
    },
    {
      "id": 245,
      "start": 1011.4000244140625,
      "end": 1016.6400146484375,
      "text": " What is it that we, how can we pray more effectively for you as you serve in that capacity?"
    },
    {
      "id": 246,
      "start": 1016.6400146484375,
      "end": 1024.199951171875,
      "text": " And we begin to rejoice in what God is doing, and ultimately we're giving honor and glory"
    },
    {
      "id": 247,
      "start": 1024.199951171875,
      "end": 1027.9599609375,
      "text": " to the Lord because He's the one that's done the work."
    },
    {
      "id": 248,
      "start": 1027.9599609375,
      "end": 1033.3199462890625,
      "text": " And we're saying to God be the glory."
    },
    {
      "id": 249,
      "start": 1033.3199462890625,
      "end": 1038.9599609375,
      "text": " Great things He hath done, but you know what's exciting to be part of it?"
    },
    {
      "id": 250,
      "start": 1038.9599609375,
      "end": 1043.52001953125,
      "text": " I've often said over the years for us to be involved in world missions is for us to be"
    },
    {
      "id": 251,
      "start": 1043.52001953125,
      "end": 1046.47998046875,
      "text": " involved in what God is doing globally."
    },
    {
      "id": 252,
      "start": 1046.47998046875,
      "end": 1048.52001953125,
      "text": " And God is working globally."
    },
    {
      "id": 253,
      "start": 1048.52001953125,
      "end": 1050.0,
      "text": " It is absolutely exciting."
    },
    {
      "id": 254,
      "start": 1050.0,
      "end": 1056.6400146484375,
      "text": " I know sometimes we can get the perspective of how bad things are in America and how the"
    },
    {
      "id": 255,
      "start": 1056.6400146484375,
      "end": 1058.0400390625,
      "text": " church scene is here in America."
    },
    {
      "id": 256,
      "start": 1058.0400390625,
      "end": 1063.1400146484375,
      "text": " I got a periodical across my desk today that said 43% of millennials said they don't know"
    },
    {
      "id": 257,
      "start": 1063.1400146484375,
      "end": 1066.760009765625,
      "text": " and they don't care whether God exists."
    },
    {
      "id": 258,
      "start": 1066.760009765625,
      "end": 1069.719970703125,
      "text": " That's a high percentage."
    },
    {
      "id": 259,
      "start": 1069.719970703125,
      "end": 1072.9599609375,
      "text": " But we begin to read some things about what God is doing in other parts of the world and"
    },
    {
      "id": 260,
      "start": 1072.9599609375,
      "end": 1074.4000244140625,
      "text": " how God is working."
    },
    {
      "id": 261,
      "start": 1074.4000244140625,
      "end": 1076.6800537109375,
      "text": " God is at work."
    },
    {
      "id": 262,
      "start": 1076.6800537109375,
      "end": 1079.239990234375,
      "text": " God's at work here too."
    },
    {
      "id": 263,
      "start": 1079.239990234375,
      "end": 1081.280029296875,
      "text": " He's working in America."
    },
    {
      "id": 264,
      "start": 1081.280029296875,
      "end": 1086.43994140625,
      "text": " I know that the things that are on the mainstream media and all that we're being told, it seems"
    },
    {
      "id": 265,
      "start": 1086.43994140625,
      "end": 1093.8800048828125,
      "text": " so dark and so terrible and so just, and there's a lot of problems, but you know God's working."
    },
    {
      "id": 266,
      "start": 1093.8800048828125,
      "end": 1096.52001953125,
      "text": " God's working in the hearts of people."
    },
    {
      "id": 267,
      "start": 1096.52001953125,
      "end": 1099.6800537109375,
      "text": " We'll share an update here in just a moment on the back of our bulletin this evening from"
    },
    {
      "id": 268,
      "start": 1099.6800537109375,
      "end": 1105.9599609375,
      "text": " Brother Deal and he shares how that while they were nearing some door-to-door outreach"
    },
    {
      "id": 269,
      "start": 1105.9599609375,
      "end": 1109.9200439453125,
      "text": " and what have you and they were in a particular area, community, and they just were met with"
    },
    {
      "id": 270,
      "start": 1109.9200439453125,
      "end": 1112.56005859375,
      "text": " great levels of opposition."
    },
    {
      "id": 271,
      "start": 1112.56005859375,
      "end": 1116.800048828125,
      "text": " And then COVID came and lockdowns and they had to leave and all sorts of things and they've"
    },
    {
      "id": 272,
      "start": 1116.800048828125,
      "end": 1119.9599609375,
      "text": " gotten back to the field and that's one of the neighborhoods that they first went back"
    },
    {
      "id": 273,
      "start": 1119.9599609375,
      "end": 1125.47998046875,
      "text": " to and he said, you know, the attitude is completely different."
    },
    {
      "id": 274,
      "start": 1125.47998046875,
      "end": 1126.6400146484375,
      "text": " People are open."
    },
    {
      "id": 275,
      "start": 1126.6400146484375,
      "end": 1128.280029296875,
      "text": " People are receptive."
    },
    {
      "id": 276,
      "start": 1128.280029296875,
      "end": 1132.719970703125,
      "text": " Why is it that we seek to have updates from our missionaries on a regular basis?"
    },
    {
      "id": 277,
      "start": 1132.719970703125,
      "end": 1137.4000244140625,
      "text": " Why is it that we take the time to put them on the back of a bulletin every Wednesday"
    },
    {
      "id": 278,
      "start": 1137.4000244140625,
      "end": 1138.4000244140625,
      "text": " evening?"
    },
    {
      "id": 279,
      "start": 1138.4000244140625,
      "end": 1141.56005859375,
      "text": " Why is it that we take time in our service on Sunday morning to get an update?"
    },
    {
      "id": 280,
      "start": 1141.56005859375,
      "end": 1144.800048828125,
      "text": " Because I don't want to hear what God's doing."
    },
    {
      "id": 281,
      "start": 1144.800048828125,
      "end": 1148.280029296875,
      "text": " I have the privilege of being the pastor and reading every letter that comes across my"
    },
    {
      "id": 282,
      "start": 1148.280029296875,
      "end": 1149.5999755859375,
      "text": " desk."
    },
    {
      "id": 283,
      "start": 1149.5999755859375,
      "end": 1153.0400390625,
      "text": " But if we don't share it with you, you don't know what's going on and you have no reason"
    },
    {
      "id": 284,
      "start": 1153.0400390625,
      "end": 1155.6800537109375,
      "text": " to rejoice."
    },
    {
      "id": 285,
      "start": 1155.760009765625,
      "end": 1160.8399658203125,
      "text": " So as we think about this missions conference, and I hope that you'd purpose to be here,"
    },
    {
      "id": 286,
      "start": 1160.8399658203125,
      "end": 1165.47998046875,
      "text": " I understand schedules and work and all that sort of thing, but when we really understand"
    },
    {
      "id": 287,
      "start": 1165.47998046875,
      "end": 1170.719970703125,
      "text": " what's happening and how the missionaries are coming and they're reporting that people"
    },
    {
      "id": 288,
      "start": 1170.719970703125,
      "end": 1177.199951171875,
      "text": " are going to rejoice, we see this model here in Acts 14, man, I don't want to miss it."
    },
    {
      "id": 289,
      "start": 1177.199951171875,
      "end": 1181.56005859375,
      "text": " I mean, could you imagine if somebody there, I don't know what was going on in Antioch"
    },
    {
      "id": 290,
      "start": 1181.56005859375,
      "end": 1182.9200439453125,
      "text": " at this time."
    },
    {
      "id": 291,
      "start": 1182.9200439453125,
      "end": 1188.5999755859375,
      "text": " I know there's some things going on in our world at this time that can take our attention."
    },
    {
      "id": 292,
      "start": 1188.5999755859375,
      "end": 1192.9200439453125,
      "text": " A junior has baseball practice, this one has that, this one has that."
    },
    {
      "id": 293,
      "start": 1192.9200439453125,
      "end": 1196.3599853515625,
      "text": " We can't make it to missions conference because we got this going on."
    },
    {
      "id": 294,
      "start": 1196.3599853515625,
      "end": 1200.47998046875,
      "text": " And then they begin to hear what was reported, man, I missed it."
    },
    {
      "id": 295,
      "start": 1200.47998046875,
      "end": 1202.0999755859375,
      "text": " I missed it."
    },
    {
      "id": 296,
      "start": 1202.0999755859375,
      "end": 1204.06005859375,
      "text": " I don't want to miss it."
    },
    {
      "id": 297,
      "start": 1204.06005859375,
      "end": 1208.9000244140625,
      "text": " I'm not saying that because I want to have some level of great attendance or something"
    },
    {
      "id": 298,
      "start": 1208.9000244140625,
      "end": 1209.9000244140625,
      "text": " for the mission."
    },
    {
      "id": 299,
      "start": 1209.9000244140625,
      "end": 1210.9000244140625,
      "text": " I'm being sincere."
    },
    {
      "id": 300,
      "start": 1210.9000244140625,
      "end": 1212.1600341796875,
      "text": " I don't want to miss it."
    },
    {
      "id": 301,
      "start": 1212.1600341796875,
      "end": 1214.800048828125,
      "text": " I want to know what God's doing and how God's working."
    },
    {
      "id": 302,
      "start": 1214.800048828125,
      "end": 1216.3599853515625,
      "text": " I want to know what God has for me."
    },
    {
      "id": 303,
      "start": 1216.3599853515625,
      "end": 1217.800048828125,
      "text": " These guys are going to preach messages."
    },
    {
      "id": 304,
      "start": 1217.800048828125,
      "end": 1219.0,
      "text": " What does God have for me?"
    },
    {
      "id": 305,
      "start": 1219.0,
      "end": 1222.780029296875,
      "text": " How is he going to work in my heart, in my life?"
    },
    {
      "id": 306,
      "start": 1222.780029296875,
      "end": 1228.4000244140625,
      "text": " And so this evening as we look at this passage of Scripture and really one final preparation"
    },
    {
      "id": 307,
      "start": 1228.4000244140625,
      "end": 1232.52001953125,
      "text": " message if you will, as we then turn to our missions conference, they rehearsed all that"
    },
    {
      "id": 308,
      "start": 1232.52001953125,
      "end": 1234.3800048828125,
      "text": " God had done."
    },
    {
      "id": 309,
      "start": 1234.3800048828125,
      "end": 1235.9599609375,
      "text": " God is working."
    },
    {
      "id": 310,
      "start": 1235.9599609375,
      "end": 1240.8800048828125,
      "text": " And I am very excited about the opportunity to have a missions conference."
    },
    {
      "id": 311,
      "start": 1240.8800048828125,
      "end": 1245.8399658203125,
      "text": " I tried to share with someone just in the last few days about missions conference, and"
    },
    {
      "id": 312,
      "start": 1245.8399658203125,
      "end": 1246.8399658203125,
      "text": " they don't go to church."
    },
    {
      "id": 313,
      "start": 1246.8399658203125,
      "end": 1247.8399658203125,
      "text": " I don't think they're saved."
    },
    {
      "id": 314,
      "start": 1247.8399658203125,
      "end": 1251.8399658203125,
      "text": " And they just had asked if we had anything busy going on, anything on the schedule, and"
    },
    {
      "id": 315,
      "start": 1251.8399658203125,
      "end": 1253.6400146484375,
      "text": " I shared a little bit about the missions conference."
    },
    {
      "id": 316,
      "start": 1253.6400146484375,
      "end": 1257.0,
      "text": " And I mean, they had no concept, no idea whatsoever."
    },
    {
      "id": 317,
      "start": 1257.0,
      "end": 1259.43994140625,
      "text": " And I really didn't expect them to, but they asked a question."
    },
    {
      "id": 318,
      "start": 1259.43994140625,
      "end": 1261.6400146484375,
      "text": " I provided an answer."
    },
    {
      "id": 319,
      "start": 1261.6400146484375,
      "end": 1266.97998046875,
      "text": " But for us as the people of God, when we think about these missionaries, and man, as I personally"
    },
    {
      "id": 320,
      "start": 1267.0999755859375,
      "end": 1272.0999755859375,
      "text": " and you personally have given dollars to support missions, don't you want to hear how God's"
    },
    {
      "id": 321,
      "start": 1272.0999755859375,
      "end": 1273.0999755859375,
      "text": " working?"
    },
    {
      "id": 322,
      "start": 1273.0999755859375,
      "end": 1276.260009765625,
      "text": " Don't you want to hear what God's doing?"
    },
    {
      "id": 323,
      "start": 1276.260009765625,
      "end": 1277.260009765625,
      "text": " They rehearsed."
    },
    {
      "id": 324,
      "start": 1277.260009765625,
      "end": 1284.3800048828125,
      "text": " The missionaries returned, they reported, and the people rejoiced because God was working."
    },
    {
      "id": 325,
      "start": 1284.3800048828125,
      "end": 1285.3800048828125,
      "text": " Let's pray."
    },
    {
      "id": 326,
      "start": 1285.3800048828125,
      "end": 1286.4599609375,
      "text": " Father, we love you."
    },
    {
      "id": 327,
      "start": 1286.4599609375,
      "end": 1288.5799560546875,
      "text": " We thank you for loving us."
    },
    {
      "id": 328,
      "start": 1288.5799560546875,
      "end": 1289.97998046875,
      "text": " Thank you for your word."
    },
    {
      "id": 329,
      "start": 1290.97998046875,
      "end": 1297.1400146484375,
      "text": " Lord, I pray that as we, as a local church, prepare for our missions conference, I pray"
    },
    {
      "id": 330,
      "start": 1297.1400146484375,
      "end": 1304.5799560546875,
      "text": " that our hearts will be soft and tender, receptive."
    },
    {
      "id": 331,
      "start": 1304.5799560546875,
      "end": 1313.739990234375,
      "text": " I pray, God, that you would work in our midst, help us as individuals to purpose to be here."
    },
    {
      "id": 332,
      "start": 1313.739990234375,
      "end": 1318.8599853515625,
      "text": " Lord, I pray for the missionaries and their families as they travel, that you would give"
    },
    {
      "id": 333,
      "start": 1318.8599853515625,
      "end": 1326.260009765625,
      "text": " safety and give clarity and wisdom with regard to messages, and Lord, I pray that through"
    },
    {
      "id": 334,
      "start": 1326.260009765625,
      "end": 1333.02001953125,
      "text": " all that would be said and done, that you alone would be glorified, that we as thy people"
    },
    {
      "id": 335,
      "start": 1333.02001953125,
      "end": 1339.3399658203125,
      "text": " would rejoice greatly as we have the privilege of hearing all that you're doing."
    },
    {
      "id": 336,
      "start": 1339.3399658203125,
      "end": 1342.4200439453125,
      "text": " We're excited."
    },
    {
      "id": 337,
      "start": 1342.4200439453125,
      "end": 1346.4599609375,
      "text": " We have a great level of anticipation of how you'd work in our midst."
    },
    {
      "id": 338,
      "start": 1346.4599609375,
      "end": 1349.4599609375,
      "text": " I pray that you'd bless our time of prayer."
    },
    {
      "id": 339,
      "start": 1349.4599609375,
      "end": 1351.1400146484375,
      "text": " We thank you for the privilege of prayer."
    },
    {
      "id": 340,
      "start": 1351.1400146484375,
      "end": 1359.1800537109375,
      "text": " We thank you for the confidence that we have that you hear and answer prayer."
    },
    {
      "id": 341,
      "start": 1359.1800537109375,
      "end": 1362.1800537109375,
      "text": " I pray that you'd be glorified through the remainder of our service."
    },
    {
      "id": 342,
      "start": 1362.1800537109375,
      "end": 1364.739990234375,
      "text": " For it's in Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T06:09:05.749424"
}