{
  "video_id": "I5J2NuNIO5w",
  "text": "7 and we're looking at the entirety of this passage of scripture this morning Hebrews chapter number 7 looking at verses 1 through 28 and You'll recall with us several chapters ago Several lessons ago really through the book in chapter number 5. We were introduced to the superiority of the priesthood of Jesus Christ It was in that chapter chapter number 5 That we saw the pattern of the Old Testament priesthood We also saw the prophecy of a greater priesthood. Remember it was in Hebrews chapter number 5 Where we read that quote from Psalm 110 Psalm 110 verse number 4 that art thou art my son today I've begotten thee excuse me verse number 6 of chapter 5 Thou art a priest forever after the order of Melchizedek and that's Psalm 110 in verse number 4 and we find that that Psalm had Obviously regularly been accepted as being a messianic psalm prophecy and it was properly applied to the person of Jesus Christ and we found that in chapter number 5 we read about the pattern of the Old Testament priesthood the Prophecy of a greater priest and then as we went through chapter number 5 we find that the writer presents the Lord Jesus Christ as The and proves that he is the fulfillment of that prophecy in Psalm 110 and that he indeed is Superior and really what what was given to us in chapter number 5 as a preview Now in chapter number 7 will be fully presented Remember it was in chapter number 5 that he said this the writer says in verse number 10 called of God and high priest after the order of Melchizedek and then in verse number 11 of whom we have many things to say and We find that in chapter number 7 is where we begin to see those many things which he had to say he took in a Parenthesis if you will he said and hard to be uttered seeing you're dull of hearing and dealt with that Warning section at the end of chapter number 5 all the way through chapter number 6 we end chapter number 6 Speaking again about the Lord Jesus Christ in verse number 20 Whether the forerunner is for us entered even Jesus and then notice The way that the writer goes back to the subject that he was dealing with in chapter number 5 and will fully present it now In chapter 7 made in high priest forever After the order of Melchizedek and then he says for this Melchizedek chapter 7 verse number 1 King of Salem priest of the Most High God Who met Abraham returning from the slaughter of the kings and blessed him to whom also Abraham gave a tenth part of all First being by interpretation king of righteousness and after that also king of Salem, which is king of peace Without father without mother without descent having neither beginning of days nor end of life But made like unto the Son of God abideth a priest Continually skip down if you will and look at verse 24 and 25 with me It says but this man speaking of Jesus because he continueth ever half an unchangeable priesthood Wherefore he is able also to save them to the uttermost that come unto God by him Seeing he ever liveth to make intercession for them. We'll look at the entirety of the chapter if you're taking notes I have adopted the title from the end of verse number 24 an Unchangeable priesthood an Unchangeable priesthood. It's interesting as we look at the text of Scripture If you're taking notes notice number one the description of Melchizedek Really in verses 1 through 10 of chapter number 7 the writer of Hebrews is giving us a description of Melchizedek In fact, you'd have to travel all the way back to Genesis chapter number 14 And you would see just a couple of verses of Scripture in Genesis chapter number 14 about this one Melchizedek There's a couple of verses in Genesis 14, there's one verse in Psalm 110 That's a prophecy concerning the Lord Jesus Christ. And that's all you read in the Old Testament about Melchizedek In fact, if Hebrews did not give us the truth that is provided here in chapter 5 7 8 and in dealing with The order of Melchizedek. The reality is that many of us probably would not even remember the name Melchizedek It's just so quickly in chapter number 14 the book of Genesis and it Amazes me when you think about the book that we hold in our hand you think about the divine author the God of heaven that gave us this book and how he uses the truth of Genesis 14 to prove to provide a type of the Lord Jesus Christ and we see here in Hebrews that The writer takes these These believers that he's writing to Back to Genesis 14 now, we mentioned this as we studied the end of chapter number 6 these Jewish believers that are being written to in the book of Hebrews, they obviously held Abraham in high regard and Abraham I mean he was the one that was given the promise father Abraham. I mean a dear person Patriarch within their culture within their understanding and we found that in chapter number 6 the writer begins to deal with some things with regard to Abraham and then we get into chapter number 7 and God is going to use this brief interaction between Melchizedek and Abraham to show the superiority of the priesthood of Jesus Christ. It's an amazing truth It's a technical passage of Scripture and I'm gonna try to get through it and trust it to be a blessing to you this morning We find that back in Genesis 14 In fact go back there if you will and I want you to see the verses that are given we have so much more Information in the book of Hebrews about Melchizedek than we do in the book of Genesis Because we find that in the book of Hebrews the truth that is given to us in Genesis this brief interaction is Given to us in the fulfillment there in the book of Hebrews In fact, it's interesting that as Abraham would return back. Remember he heard that Lot had been taken captive He took all of the trained servants from his house and he went and he delivered Lot and the others And we find that there were actually two kings that met him upon his return. One was the king of Melchizedek Melchizedek we see that the king of Salem But we also see that the king of Sodom was there as well Not much dealt with with the king of Sodom Because that's not a type of the the priesthood of Melchizedek the fulfillment of Jesus Christ in that typology But notice here in verse number 18 of Genesis 14 The Bible says and Melchizedek king of Salem brought forth bread and wine and he was the priest of the Most High God and He blessed him and said blessed be Abram of the Most High God possessor of heaven and earth and blessed be the Most High God which hath delivered thine enemies into thy hand and He Abram or Abraham as we often refer to him as gave him Melchizedek tithes of all It says and the king of Sodom said unto Abram Give me the persons and take the goods to thyself and Abram said to the king of Sodom I have lift up mine hand unto the Lord the Most High God the possessor of heaven and earth That I will not take from from a thread even to a shoelatch it and that I will not take anything That is thine lest thou should have say I have made Abram rich. It's interesting the king of Salem Melchizedek this type of Jesus Christ that we see the fulfillment here in the book of Hebrews Abraham gives him tithes The king of Sodom Offers to pay Abraham some money and Abraham says no I'm not gonna take anything from you and it's interesting because look we there's very little given to us in Genesis about Melchizedek, but look at how the writer of Hebrews Expands this truth and gives us this typology again as we've mentioned with many characters throughout the Word of God this Melchizedek just steps on the pages of Scripture and Just as quickly as he steps on he steps off. There's just a couple of verses Remember as we've studied the life of Elijah, it's as if he just appears out of nowhere in first Kings 17 I mean BAM there's Elijah standing before Ahab and you just see him and You see his life and his ministry and all of those things in here with this Melchizedek He just appears notice what the Bible tells us about the description of this one Melchizedek the Bible tells us look at the names that are given the titles if you will verse number one king of Salem verse number one priest of the Most High God notice in verse number two king of righteousness Then it says this and after that also king of Salem, which is king of peace The Bible gives us this information in verse number three now It's interesting because as I mentioned as we looked at Genesis chapter number 14, there's no real record this this Melchizedek just appears and Here in verse number three, we find that there's no lineage that is provided for this one Melchizedek The Bible says without father without mother without descent having neither beginning of days nor end of life But made like unto the Son of God abideth a priest Continually as we look at verse number three and we notice that there's no lineage that's provided It does not mean that he did not have mother or father We just find that it's not provided for us in the account in the book of Genesis It's very interesting that it's not provided for us in the book of Genesis because Genesis is a book of genealogies Genesis is a book where you see all of these things about the the family tribes and who begat who and so on and so forth and you see these genealogies throughout the book of Genesis and yet for this one this Melchizedek He's a king and a priest, which is, of course, our Lord is prophet, priest, and king, and we understand that, but we find that as a priest, being able to provide your lineage was of significant importance. I won't ask you to turn back there, but if you jot down in Nehemiah chapter number seven, it's also recorded in the book of Ezra, but in Nehemiah seven, verses 63 and 64, the Bible says this, and of the priests, the children of Habeiah, the children of Chaz, the children of Barzillia, which took one of the daughters of Barzillia, the Gileadite, to wife, and was called after their name. These sought their register among those that were reckoned by genealogy, but it was not found. What happened? Therefore were they, as polluted, put from the priesthood. They could not be called and counted amongst the priests because they could not provide their genealogy, their lineage. And so we find here that it's very interesting that there's no lineage that is provided. The Bible tells us there in verse number three, but made like unto the Son of God. We see that this is an Old Testament type of the Lord Jesus Christ. We know that the Lord Jesus Christ, He is eternal, amen? He has always been, He is, He was, and He will be, and what a joy to understand that He is alpha and omega, the beginning and the end, the first and the last. There's never a time, I mean, because He transcends time, you never can find a time when He did not exist or that He will not exist. Our God is eternal. We find that it's interesting as we continue to look at this description of Melchizedek that the Bible tells us, and I mentioned it back in there in Genesis 14, that Abraham gave tithes to Melchizedek. Notice it says here in verse number four, now consider how great this man was unto whom, notice this phrase, even the patriarch Abraham gave the tenth of the spoils. Now think about this, for us this morning, perhaps it's a little bit challenging, but think about putting your mind in the mindset of these Jewish believers, the regard that they had for Abraham, and then telling these believers, now consider how great this man was, speaking of Melchizedek, unto whom even the patriarch Abraham gave the tenth of the spoils. See, they held Abraham at a high place, and they're saying, but he, Abraham, gave tithes to Melchizedek. What does that show? Well, certainly it shows who is the greater in the minds of these Jewish believers for them to begin thinking about this which is being presented, and to understand the application by which this passage will lead to in dealing with the superiority of the priesthood of Jesus Christ, we find that he's setting the scene for them to understand, you hold Abraham in high regard, but he paid tithes to Melchizedek. Notice, verse number five, as it continues, it says, and verily, they that are of the sons of Levi, now what is he doing? He's dealing with the priesthood that they would be familiar with, right? We often refer to it as the Aaronic priesthood. The Levitical priesthood will be the terminology that will be used here in the book of Hebrews. And look what he says, and verily, they that are of the sons of Levi who receive the office of the priesthood have a commandment to take tithes of the people according to the law. That is, of their brethren, though they come out of the loins of Abraham. Now follow the thought, skip down if you will, we'll look at verse six and seven in just a minute, but look at verses eight through 10. And here, men that die receive tithes, but there he receiveth them of whom it is witnessed that he liveth. And as I may so say, Levi also who receiveth tithes, notice this, paid tithes in Abraham. How? Well, he explains it in verse number 10. For he, speaking of Levi, was yet in the loins of his father when Melchizedek met him. Now, again, we often refer to Father Abraham, right? And we understand the mindset of the Jewish believer and how they would be wrapping their mind around this truth that is presented, and they're being given this obscure passage of scripture in the book of Genesis, many times we would just maybe rush right through it, not even remember the details. And the writer of Hebrews says, and I wanna call your attention to this interaction between Abraham and Melchizedek, and we take the prophecy, the messianic prophecy of Psalm 110, and we're gonna properly apply it to the person of Jesus Christ, God in flesh, and we're going to prove this to you. And he deals with the subject of these tithes that are paid. See, the Bible tells us in verse number 10 that he, speaking of Levi, was yet in the loins of his father. Levi is well after Abraham. Abraham and Sarah didn't give birth to Levi, right? Who was the promised son? Isaac. And then who? Then Jacob. Then who? Then you get to Levi. And by the way, then you eventually get to Amram, who was the father of Aaron, right? And you understand the Aaronic priesthood as we often refer to it, but you understand that as he, Abraham, is the father of the nation, if you will, we find that what the writer is saying is that if Abraham paid tithes to Melchizedek, and Levi is through the loins of Abraham, then in essence, Levi paid tithes to Melchizedek. Now, think about the mind of these Jewish believers, I mean, kind of scratching their head and trying to wrap their mind around this truth that is being presented to them. Again, the temple is still standing, the offerings are still being made, the idea of some of these believers going back to Judaism, and we find that the writer of Hebrews is saying, no, continue to walk with the Lord Jesus Christ. He's better, he's superior, and I'm gonna prove it to you. And he's been proving it chapter by chapter, and he's been giving them the admonition to continue. Remember, as we dealt with the latter part of chapter number six about the promises, Abraham received a promise, but he didn't obtain the promise until he endured with patience. We find that there's this challenge that is given to continue. We find that Melchizedek, not only did Abraham pay tithes or give tithes to Melchizedek, but we read in the book of Genesis, in chapter 14 and verse number 19, how Melchizedek blessed Abraham. Notice it's recorded for us here in verses six and seven of Hebrews chapter number seven. But he whose descent is not counted from them received tithes of Abraham. What is he saying? His lineage isn't through that line, right? He's not of the Levitical priesthood. He's not of the Aaronic priesthood. This is a different priesthood altogether, and he says that he received tithes of Abraham, but then notice, and blessed him that had the promises. God had given promises to Abraham, and we find that Melchizedek blessed Abraham, and it says in verse number seven, without all contradiction, the less is blessed of the better. What is he saying? Well, Melchizedek actually is greater than Abraham. Now that's kind of a mind-blowing thought for the Jewish people. And we find that as he's applying this truth, he's dealing with the description here of Melchizedek, and then, if you're taking notes, number two, he's gonna deal with the insufficiency of the Levitical priesthood. So he presents the description of Melchizedek. He presents this priesthood. Remember, he's used the phraseology beginning in chapter number five. He gives, he referenced back again to this truth, this prophecy of the order of Melchizedek, the order of Melchizedek. So he gives the description. Now, he provides this truth, the insufficiency of the Levitical priesthood. Now, we understand that the Old Testament is full of typologies. And as we would think about Old Testament types, we understand that they represent something that is far greater that will one day come. Now, on this side of history, we know that Jesus has already come. And so we can look at the type and we can see the fulfillment, we can preach it from this perspective, and no doubt that's exactly what's happening as the writer of Hebrews is trying to present these Jewish believers with the understanding that Jesus is the fulfillment of this Old Testament type, of this prophecy, this messianic psalm that we read, that we know, that we've put in the category of being messianic, Psalm 110, that's Jesus Christ. He is the one after the order of Melchizedek. And so he provides this insufficiency. Notice in verse number 11, he says, if therefore perfection were by the Levitical priesthood, for under it the people received the law. Notice what he asks, what further need was there that another priest should rise after the order of Melchizedek and not be called after the order of Aaron? He's asking a question to provoke thought. Many times we do that. We find as we read various... whether it's the Bible or some other type of literature, as we have discussions with individuals, there are times that we'll ask a question to provoke thought. And here he's saying this, if therefore perfection were by the Levitical priesthood, we know the Levitical priesthood, we're familiar with the Levitical priesthood, the Aaronic priesthood as we've often referred to it as, he says then if that brought perfection, why is there this Messianic prophecy about the order of Melchizedek? What would be the need, what further need was there for another priest that should rise after the order of Melchizedek? Well the answer is obvious, if the Levitical priesthood, if the Aaronic priesthood could bring perfection, there would be no need for another priesthood, another order. But it couldn't bring perfection, it was a type. And therefore this Messianic prophecy is given with regard to the order of Melchizedek, that Jesus would be a priest forever after the order of Melchizedek, and we find that he begins there in verse number 11 by dealing with the insufficiency of the Levitical priesthood and proving that another priesthood, an order of priesthood, was absolutely essential, and it was after the order of Melchizedek. Notice, the priesthood required the law, we see in verse number 11, it says for under it the people received the law, and notice something that the Bible gives us here about the law in verse number 19, excuse me, the Bible tells us this, for the law made nothing perfect, amen? It says, but the bringing in of a better hope did, by the which we draw nigh unto God. So he deals with the fact that just as the priesthood could not bring perfection, neither could the law. Hold your place here and go back, if you will, to the book of Galatians, and then we're gonna deal with the passage of the book of Romans, but I want you to look at Galatians first, and notice what is being told to us here in Galatians chapter number 3. Again, we'll be back to Hebrews 7 here in just a moment, but look here in Galatians chapter number 3. Last week we took a lengthy period of time to look at verses 6 down through verse number 18, and to deal with that promise that was given to Abraham, the promise was of a seed. Remember, we mentioned that last week, and the fulfillment of that, which is Christ, and how that we are the heirs of promise, that we, in fact, would be called the children of Abraham, how? By faith. What a blessing. But as the passage of Scripture continues, and it's so interesting to see how Galatians 3, so similar to what we read at the end of Hebrews 6 and into Hebrews chapter number 7, such great parallel passages of Scripture, but in verse number 21 of Galatians 3, the Bible says, is the law then against the promises of God? God forbid! For if there had been a law given which could have given life, verily righteousness should have been by the law. That makes sense. But he says this in verse 22, but the Scripture hath concluded, all under sin, that the promise by faith of Jesus Christ might be given to them that believe. Verse 23, but before faith came, we were kept under the law, shut up unto the faith, which should afterwards be revealed. Wherefore the law was our schoolmaster to bring us unto Christ, that we might be justified by faith. The law could not do what Christ did. The law condemns. The law doesn't give life. The law says, guilty! Amen? Thou shalt not, thou shalt not, thou shalt not, right? I'm guilty. And James says if we offend in one, we're guilty of all. And the reality here is when we think about this idea of a schoolmaster, many people have the idea that this is a teacher. It really isn't a teacher. A schoolmaster was one who was a guardian at this particular time in history. It would be used this way, a guardian or a guide who would accompany privileged boys to be instructed. Now here's the interesting thing. They themselves could not give the instruction, but they would take them, those privileged boys, to the one who could give the instruction. So therefore, we look at this usage of what Paul says, the believers in Galatia here, the region of Galatia, wherefore the law was our schoolmaster. The law cannot give life, but here's what it does. It leads to the one who does, Jesus Christ. And as we look here in Galatians and couple that with what we've seen there already in Hebrews 7, the insufficiency of the Levitical priesthood, not only could the priesthood not bring perfection, but nor could the law. Notice what Paul says in Romans. Turn over, if you will, to Romans chapter number 10. In Romans chapter number 10, often we refer to, in this passage, several verses near the middle and end of the passage, but I want to draw your attention to the beginning of the tenth chapter of the book of Romans, and look at what the Apostle Paul says here, and something that is so important for these Jewish believers to understand, as the book of Hebrews is showing the insufficiency of the Levitical priesthood. Notice in verse number one of Romans 10. Brethren, my heart's desire and prayer to God for Israel is that they might be saved. You see the heart of the Apostle Paul. He says, for I bear them record that they have a zeal of God, but not according to knowledge. Look at verses 3 and 4. The Bible says this, for they, being ignorant of God's righteousness and going about to establish their own righteousness, have not submitted themselves unto the righteousness of God. For Christ is the end of the law for righteousness to every one that believeth. And as we understand, he says, listen, these, my brethren, he's speaking specifically about these Jewish people. He says, my heart's desire for them and my prayer to God for them is that they would be saved. But here's the problem. They're ignorant of God's righteousness. There's been this blindness. He deals with that, and here in the book of Romans, the blindness that has happened unto Israel. In fact, if you were to read the book of John and you look at the great miracle when Jesus healed that man that was born blind, and he stood before the religious leaders, and they were questioning him, and they were just doubtful, and so on and so forth, and he finally, after giving answer after answer, he says, I've told you before. All I know is I was blind, and now I can see. If I tell you again, are you gonna be his disciples also? Well, that didn't make him very happy. That just angered them. And then we find that at the end of the passage, those religious leaders come and say this, are we blind also? They weren't blind physically, but they were blind spiritually. And as we think about this ignorance that Paul is referring to here in Romans 10 and verse number 3, they're ignorant of God's righteousness. They've been blinded. We find that they're going about to establish their own righteousness. Listen, they have to submit to the truth of God's Word that Christ came to fulfill, and that he is the end of the law, and we find that through him comes grace and truth. Back to Hebrews chapter number 7, we find here that he's dealing with the insufficiency. Notice, let's go back to verse number 12 of Hebrews 7. For the priesthood being changed, there is made of necessity a change also of the law. So he's saying, listen, the priesthood is gonna change. It's not after the order of Levitical priesthood or Aaronic priesthood, it's now gonna be after the order of Melchizedek. He speaks about this change. Notice in verse number 13, for he of whom these things are spoken pertaineth to another tribe of which no man gave attendance at the altar. Now this is awesome, because here's what's happening. He's dealing with the Lord Jesus Christ as being the fulfillment of this order of Melchizedek, this greater priesthood, and he says, listen, the one by which we're speaking of, he comes from another tribe. He doesn't even come from the tribe of Levi. From our perspective, speaking to the Jews that are there, these Jewish believers, he's not even qualified to be a priest. Why? Because he's not from the right tribe, right? He's of a higher order. Notice verse number 14, for it is evident that our Lord sprang out of Judah, of which tribe Moses spake nothing concerning priesthood. See, if you were the tribe of Judah, you couldn't be a priest. See, in the Old Testament, outside of Melchizedek, he's a king and a priest, right? Outside of Melchizedek, you were either a king or you were a priest, but you weren't both. You guys remember Uzziah? He is king, right? You remember the famous passage of Scripture that we deal with with Uzziah in the year that King Uzziah died, right? Isaiah saw the Lord high, holy, lifted up, so on and so forth. Isaiah chapter number 6. Well, Uzziah, he was a king, and he served as a king for a lengthy period of time. The Lord helped him, and man, God blessed, and things were going well, but then he got a little prideful. And guess what happens? Old Uzziah decides that he can go into the holy place and he can offer incense. There were some priests that came in to try to get him out, to withstand him. Thank God for those men. See, Uzziah, you're the king, but you can't be a priest, because you're not of the right tribe. What happened to Uzziah? He became a leper. He became a leper. See, Jesus Christ is of the tribe of Judah. From their perspective, humanly speaking, he could not be a priest. And so what is the writer doing? He's proving he's from a higher order of priesthood, he's after the order of Melchizedek. He's of the tribe of Judah. We know that, but that does not disqualify him from being a priest, for he's after the order of Melchizedek. Notice verse number 15, and it is yet far more evident, for that after the similitude of Melchizedek, notice, there ariseth another priest, who is made not after the law of a carnal commandment, but after the power of an endless life. Verse 17, for he testifieth, thou art a priest forever after the order of Melchizedek. I'm so thankful for the book of Hebrews, because I'll be honest with you, if all we had were the couple of verses in Genesis 14 and the Messianic Psalm of Psalm 110, we'd be scratching our heads trying to figure out what this means. But we find that here in Hebrews chapter number 17, it's like the peel is coming open and we're seeing this revealed to us, and we're seeing the beauty of God's Word and the fulfillment of this Messianic Psalm, this prophecy, and we find that it says in verse number 18, for there is barely a disannulling of the commandment going before, for the weakness and unprofitableness thereof. For the law made nothing perfect, but the bringing in of a better hope did, by the which we draw nigh unto God. And inasmuch as not without an oath he was made priest, for those priests which were made without an oath. But this, with an oath, by him that said unto him, the Lord swear and will not repent, thou art a priest forever after the order of Melchizedek. How did you become a priest in the Old Testament? Did you volunteer? Say, hey, I want to be a priest. No, you were born into the Levitical line, I mean, it was your lineage. There was no situation, no oath, like we find it says that they were made without an oath, they were born into it. Remember that to Aaron, right, was given the tribe of Levi. If you're with me through the study of the book of Joshua, we'll get to it in another couple of lessons, but we've already made reference to it in some of our previous lessons, the way in which the tribe of Levi, they didn't receive an inheritance. And they did not have a possessed land, there were cities of the Levites that are detailed for us in Joshua 21, but they did not receive a particular lot. And we find here that they had been given to Aaron. It says here, verse 22, by so much was Jesus made a surety of a better testament. It leads us here. Let me mention one more thing about the insufficiency of the Levitical priesthood and then we'll get into our final point. Look at verse number 27. The Bible says this, well, let me look at verse 23, sorry, two more things, I'm ready to get to the last point. It's exciting. Verse 23, and they truly were many priests because they were not suffered to continue by reason of death. You know why the Old Testament priesthood, the Levitical priesthood was insufficient? Because they died. They died. And then there was another one. It says, and they truly were many priests, right, because they would die and then there'd be another one and it was, that's how it worked, right? Verse 27, notice another reason that the Old Testament priesthood, the Levitical priesthood was not perfect, was insufficient. It says, who need it not daily as those high priests to offer up sacrifice, notice this, first for his own sins. The high priest would go in on the Day of Atonement once a year to the Holy of Holies. He had to go in first making an atonement for his own sin, then for the sin of the people. Jesus Christ is sinless. So what was insufficient? I've mentioned this many times that the, we finished up actually last Sunday morning dealing with the fact that our forerunner, Jesus Christ, that he went, he passed through the veil, that he's entered into heaven. And what a joy, what a blessing to understand the truth. If you go back to Hebrews chapter 4 and notice this declaration that is given in verse 14, seeing then that we have a great high priest, notice this, that has passed into the heavens. Jesus, the Son of God, let us hold fast our profession. We find in the passage of Scripture here in Hebrews chapter number 7, number 1, the description of Melchizedek, number 2, the insufficiency of the Levitical priesthood, and then finally notice the superiority of Jesus Christ. First we notice that he is eternal. We find that the prophecy is mentioned, Psalm 110 in verse number 4, it's mentioned twice in chapter number 5, it's given at the end of chapter number 6, it's mentioned twice again here in chapter number 7. And what is that prophecy of Psalm 110 in verse number 4? We read it in verse 17 of chapter 7, and at the end of verse number 21, thou art a priest, what does it say, forever after the order of Melchizedek. We find that it said in verse number 16, the power of an endless life. Notice with me in verse number 24, but this man, because he continueth ever. It says this hath an unchangeable priesthood. Tells us in verse number 25, wherefore he is able also to save them to the uttermost that come unto God by him, seeing he ever liveth to make intercession for them. He ever liveth. Verse 28, the last part of the verse says, who is consecrated forevermore. You know, we serve a risen Savior. I mean, we have to understand, yes, the beauty, the wonder of Calvary and the price that was paid on the cross of Calvary for your sin and for my sin and for the sin of the world, and we understand that he was buried in that borrowed tomb, but we serve a risen Savior. We speak about it and we sing about it during the time in which we celebrate the resurrection on Easter Sunday, if you will, and we mention many things about that, and we're very careful to understand that every Sunday is the Lord's day. Why? Because we serve a risen Savior. The Apostle Paul made it abundantly clear in chapter number 15 of the book of 1 Corinthians that if he did not raise from the dead, then our faith is vain, our preaching is vain. I mean, it's just, it's hopeless, but we serve a risen Savior. Notice what the Bible says in Revelation. You don't need to turn there. In chapter number one, in verse number 17, and when I saw him, I fell at his feet as dead and he laid his right hand upon me, saying unto me, fear not. I am the first and the last. I am he that liveth and was dead, and behold, I am alive forevermore, amen, and have the keys of hell and of death. Man, we serve a risen Savior. Every day of our lives, we must be mindful of the fact that he lives and he reigns and he rules, and as we live this life, as we walk this journey, we're mindful of the fact that we serve a risen Savior, that he ever liveth to make intercession for us. We'll get to that in just a moment, but we understand his eternality. Notice his character in the text of Scripture here. We see his immutability mentioned as it speaks about he hath an unchangeable priesthood. We mentioned a little bit about his immutability at the end of chapter number six in our last week study, and we understand as we speak about the character, the attributes of God, we often refer to his omnipotence and his omniscience and his omnipresence, and we should. He's holy and he's just and he's righteous, and what a blessing to understand how God has revealed himself to us in this precious book. He's immutable. He never changes. He's the same yesterday and today and forever. We find that in just a little while, that the writer of Hebrews in chapter number 13 is going to declare that very truth to us. In verse number eight of that passage, it says, Jesus Christ, the same yesterday and today and forever. He said in Malachi, I am the Lord, I change not. But notice his character as it's given to us here in verse number 26, for such an high priest became us. Notice who is holy, who is holy. Our God is holy. I mentioned Isaiah 6, the year that Uzziah died. Isaiah saw the Lord. The Bible says that his train filled the temple. The Bible says that they were crying out, those angels that were crying out, holy, holy, holy. Our God is holy. You know, he made it abundantly clear to his people in the Old Testament, if you look and study the book of Leviticus, he says to them over and over that he's holy. In fact, when we find in the New Testament that Peter references that truth, that we're to be obedient children, not fashioning ourselves according to our former conversation, that we're to be holy as he is holy. He says he's referencing back to the truth of the book of Leviticus. If we were to give a brief description, in my opinion, of the books of Exodus and Leviticus, we find that the book of Exodus is God bringing his people out of Egypt. Amen? He's bringing them out of Egypt. Egypt is a picture of the world. He's bringing him out of Egypt, but then the book of Leviticus is getting Egypt out of his people. Giving him all the instruction. I'm a holy God. Here's how you approach me. Here's how you worship me. By the way, He tells us that we're to worship Him in spirit and in truth. Amen? John 4. The reality is that whatever we call worship doesn't necessarily mean it's worship. It's what God has prescribed as being worship. But what a joy it is to worship Him. He is worthy of our worship. And we find that the Bible begins in giving us this description of His character that He is holy. Oh, we better never get over the fact that our God is holy. I'm thankful that our God is love and gracious. We can go through all the attributes, but we find His holiness. And all of these other things really kind of emanate out of the truth that He's holy. He's in perfect character, in perfect unity within all of these character traits, but the reality is that our God is holy. We must be mindful of that. Notice it says harmless. Undefiled. Separate from sinners. I think that's interesting, that phraseology separate from sinners, because so often, during the earthly ministry of the Lord Jesus Christ, He's accused of going in and eating with the sinners. Right? He came to seek and to save that which was lost. And we find that as you look at the truth of the character that is revealed to us, that He's made, at the end of v. 26, higher than the heavens. See, as the author is presenting the Lord Jesus Christ, He's showing that He is superior. He's better. He's greater. He's dealt with the description of Melchizedek. He's dealt with the insufficiency of the Levitical order, the Aaronic order, the priesthood order that they would be familiar with. And He's now presenting the Lord Jesus Christ as the fulfillment. We find that He's sinless. Notice in v. 27, who needeth not daily as those high priests to offer up sacrifice, notice first for His own sins, and then for the people's. For this He did once when He offered up Himself. See, there was no need for Him to offer up any offering for His own sins, for He was sinless. 2 Corinthians 5.21, for He, speaking of God the Father, hath made Him, speaking of Jesus Christ, to be sin for us, who knew no sin, that we might be made the righteousness of God in Him. Peter declares it this way in 1 Peter 3 and v. 18. What a great truth. It says, for Christ also hath once suffered for sins, the just for the unjust, that He might bring us to God, being put to death in the flesh, but quickened by the Spirit. See, He did this once. It leads right into, as we think about the superiority of Christ, it leads into the substitutionary atonement. What He did for us. These priests, this Old Testament order, man, they were regularly making these offerings. I mean, every day. In fact, as we will soon get into the 10th chapter of the book of Hebrews, we find that He talks about the way in which they are continually making these offerings and day by day by day. But this man, because it's a substitutionary atonement, because he's sinless, because he's God in flesh, after he'd made one sin for sacrifice forever, excuse me, one sacrifice for sin forever, he sat down at the right hand of the throne of God. And what a blessing to understand that he only made one sacrifice, one offering. And what did he offer? He offered himself. He offered himself. We notice at the end of verse number 27, it says, for this He did once when He offered up Himself. It's interesting if we could go just a few verses into the eighth chapter. We'll deal with this in more detail next week. But notice in verse number three of chapter eight of the book of Hebrews, it says, for every high priest who is ordained to offer gifts and sacrifices. We know that. If you read the Old Testament, you read all of the sacrificial system and all those things, you understand that they were ordained to offer gifts and sacrifices. Notice it says this at the end of verse number three, wherefore, it is of necessity that this man have someone also to offer. What was his offering? Himself. And it was for sin forever. Now as we begin to think about the truth that he made this sacrifice as we refer to it as the substitutionary atonement. Yes, what did it accomplish? Salvation, reconciliation. We see in verse number 25, it says, wherefore, he is able also to save them to the uttermost that come unto God by him. Isn't that a contrast to what we read in verse number 11? A great contrast when it says, if therefore perfection were by the Levitical priesthood. No, it's not. It can't be. Verse 19, the law made nothing perfect. But we find that here, speaking of the superiority of Jesus Christ, he says that what his offering, what his sacrifice accomplished was that he is able to save them to the uttermost that come unto God by him. Reconciliation. The Bible says that he's our intercessor. Notice it says that he ever liveth to make intercession for us. An intercessor is a mediator, one who really interposes between two parties that are at variance one with another. What's the purpose? To bring reconciliation. That's the purpose. And we see that's exactly what Jesus Christ did. You know what those Old Testament sacrifices reminded the people of every day? That what they offered yesterday was not sufficient because they had to come back today. They had to bring another offering. They had to bring another offering. They had to bring another offering. They had to bring another offering. Why? Because it's insufficient. The blood of bulls and goats can never, the Bible tells us, it can never take away sins. But the power of Christ's blood. We sing there's power in the blood. We understand the truth when Peter says that we're not redeemed with corruptible things received from our vain conversation or received by tradition from our fathers. How are we saved? We're not with the gold and silver and all of those things. No, we're saved with the precious blood of Christ. What a blessing. We find that here in the book of Hebrews in chapter number 7, as he began dealing with this subject in chapter number 5 and he previews it, I want you to understand there's a pattern for the Old Testament priesthood and you're familiar with it. Jewish people he's speaking to. Very familiar with the Old Testament priesthood. He says, I want you to understand though that there's a prophecy that deals with a greater, a higher order of priesthood. The order of Melchizedek. I have a whole lot of things to say, but you're not ready for it yet. You're dull of hearing. And he gives them this warning and then he gets right back to it. And here's all the things that he wants to say. And oh, how he unwraps it and presents it. What was given in chapter number 5 as a preview is now fully presented in chapter number 7. And he says, listen, here's the description of Melchizedek. Here's the insufficiency of that which we're familiar with, the Aaronic priesthood, the Levitical priesthood. We understand these things, but it's insufficient. And let me show you the superiority of Jesus Christ and his priesthood. He is the fulfillment. He is that Messiah that was spoken of in Psalm 110 that he would come and he would be a priest forever after the order of Melchizedek. See, we serve a great God. We really do. And we understand what he's, how he's working, how he's interceding on our behalf, the salvation that he offers, the work that was accomplished at the cross of Calvary and how he ever liveth to make intercession. They could look at some of these patriarchs. They could look at some of the priests and they could see that they died. And then there was another one and so on and so forth. But our great high priest, he ever liveth. The writer of Hebrews is saying to these Jewish believers who are contemplating, because of all that they're dealing with, the thought of returning to Judaism. He says, why would you ever do it? Don't do it. Let me show you that we have a higher priest, a greater priest. See, you see the temple over there. And of course, we can read during the time in which the Lord Jesus Christ, Caiaphas, right? And you can read of those things that are going on and how the religious leaders, not only the priest and Caiaphas being there, you can read about the Pharisees and the Sadducees and all of those people. What are they crying out? Crucify Him. Right? Now, these Jewish believers, they see the temple. They see that there's a priest over there. They're making sacrifices. He's saying don't go back because we have a great high priest. He's our great high priest. He's after. the order of Melchizedek and what a great presentation in Hebrews chapter number seven so we need to be mindful this morning just as these Jewish believers of what we have in Christ what we have in Christ we need to live each day understanding that he lives understanding that I have a great high priest that that liveth and he makes intercession for me and and we understand what he accomplished and perhaps as we begin to live with the knowledge that he lives will have a great impact on the society in which we live see because we live in a society who is I mean the the we see him all around us we've known it for a long time but oh how the makeup is coming off so to speak amen I mean it's it's bad sin is bad it's wicked it's evil and the answer is Jesus and as we understand who we are in Christ and who he is to us it enables us to live a life before the world that can make an impact see Jesus said you're the salt of the earth he said you are the light of the world if the salt hath lost its savor it's good for nothing we find that we are to live in this sin-cursed world we're to live in this world of people that we understand as Paul says in the book of Philippians that there are many that are the enemies of the cross of Christ but we're to live as salt and as light and say let me tell you about my Savior let me tell you how great my God is let me through the way that I live my life let it show how great our God is I preached a message a few weeks ago on a Wednesday evening from the book of Nehemiah and excuse me from the book of Ezra and as we look at that passage of Scripture and we deal with the subject matter as to what we were dealing with we find that there Ezra understood that the hand of his God was upon him some of you were here on that Wednesday night some of you were tuning in via livestream but let me just summarize quickly what I dealt with on that night and hopefully make application through what we're dealing with even here in Hebrews 7 because we serve a God who lives and and see here's what Ezra was dealing with and we look at the passage of Scripture and we understand he had gone and he had declared how great his God was he had talked to the king I have a great God here's what my God's able to do he'll bless those that are for him he'll curse those that are against him I mean we have a great God and then he had to take a journey to Jerusalem and that journey that he'd have to take to Jerusalem was a dangerous journey there were enemies in the way so here's the thought I can go to the king and request what I've called a military escort but you know what you know he said I was ashamed I was ashamed to ask for this military escort why because I'd already told him how great my God is and now I'm gonna go and say to the king actually we got this dangerous journey that we're gonna go on and I know I told you all this stuff about my God and what he's able to do but I really need your soldiers to accompany me so that we can make it safely Ezra says I was ashamed I couldn't do it so you know what Ezra did fasted and prayed so he did and he besought the Lord God I know that you're able I the prayers not recorded for us I'm just using my imagination my imagination as to what he would have prayed think about Psalms I will lift up mine eyes unto the hills from whence cometh my help my help cometh from the Lord which made heaven and earth God if you spoke all of this into existence and I know you did I believe your record then God this journey is nothing for you it's easy for you to protect me and if you read the passage of Scripture you read in verse number 32 of that passage that the Bible says and we came to Jerusalem see in Hebrews chapter number seven these Jewish believers were struggling the thought of returning to Judaism it just seemed to them it would make things so much easier and the writer of Hebrew says no we have a greater high priest God in flesh the Lord Jesus Christ he is our God he is our priest he's prophet priest and King and he's after the order of Melchizedek and let me show you what he accomplished for us that this Levitical priesthood could never accomplish so why would you want to go back remember what it was that Peter said disciples left Jesus looks to the twelve returns to them and he says will you go away also Peter says to whom shall we go we know that now art the Christ and that thou hast the words of eternal life see we serve a great God and we take the truth of God's Word and apply in our lives and let a world see how great our God is we're speaking recently as a family I think was Holly actually that made the statement speaking about how great our God is and some of what she has been reading in her personal devotions she said it's a shame that the world doesn't know how great our God is you know whose job it is it's our job it's our job to declare his greatness the Lord is great Psalm 48 great is the Lord and greatly to be praised amen the psalmist says I know that my God is great I know he is but then he says this I'm gonna declare his greatness why because there's a generation that needs to know just how great our God is we have a great high priest his name is Jesus and he's our Savior if you've trusted him you understand what he is to you we have a responsibility to take that message to a lost and dying world an unchangeable priesthood the writer presents what had been previewed fully the superiority of Jesus Christ let us pray father we love you we thank you for loving us we thank you so much for your word the truth contained therein thank you for this passage of Scripture in which it so adequately presents the Lord Jesus Christ is our great high priest not after the Levitical priesthood or the Aaronic priesthood but after the order of Melchizedek and God help us to rejoice in who you are your character but also to rejoice in what you've done for us the fact that you live and that you ever live to make intercession for us father if there's one that's present one that's tuned in via livestream that's not yet trusted the Lord Jesus Christ of their personal Savior it's our prayer that today would be the day of their salvation but they would understand that Jesus is the way the truth in the life no man cometh unto the father but by him not by works of righteousness which we have done but according to his mercy hath begotten us Lord help us those of us that are saved to go and live our lives as the salt of the earth in the light of the world showing the greatness of our God help us Lord I pray in Christ's name would you stand with me heads",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.480000019073486,
      "text": " 7 and we're looking at the entirety of this passage of scripture this morning Hebrews chapter number 7 looking at verses 1 through 28 and"
    },
    {
      "id": 1,
      "start": 8.319999694824219,
      "end": 11.039999961853027,
      "text": " You'll recall with us several chapters ago"
    },
    {
      "id": 2,
      "start": 11.84000015258789,
      "end": 19.479999542236328,
      "text": " Several lessons ago really through the book in chapter number 5. We were introduced to the superiority of the priesthood of Jesus Christ"
    },
    {
      "id": 3,
      "start": 19.600000381469727,
      "end": 21.860000610351562,
      "text": " It was in that chapter chapter number 5"
    },
    {
      "id": 4,
      "start": 22.479999542236328,
      "end": 25.579999923706055,
      "text": " That we saw the pattern of the Old Testament priesthood"
    },
    {
      "id": 5,
      "start": 25.6200008392334,
      "end": 30.719999313354492,
      "text": " We also saw the prophecy of a greater priesthood. Remember it was in Hebrews chapter number 5"
    },
    {
      "id": 6,
      "start": 31.5,
      "end": 35.02000045776367,
      "text": " Where we read that quote from Psalm 110"
    },
    {
      "id": 7,
      "start": 35.7400016784668,
      "end": 39.5,
      "text": " Psalm 110 verse number 4 that art thou art my son today"
    },
    {
      "id": 8,
      "start": 39.5,
      "end": 42.619998931884766,
      "text": " I've begotten thee excuse me verse number 6 of chapter 5"
    },
    {
      "id": 9,
      "start": 42.7599983215332,
      "end": 50.400001525878906,
      "text": " Thou art a priest forever after the order of Melchizedek and that's Psalm 110 in verse number 4 and we find that that Psalm had"
    },
    {
      "id": 10,
      "start": 51.119998931884766,
      "end": 58.08000183105469,
      "text": " Obviously regularly been accepted as being a messianic psalm prophecy and it was properly applied to the person of Jesus Christ"
    },
    {
      "id": 11,
      "start": 58.20000076293945,
      "end": 63.84000015258789,
      "text": " and we found that in chapter number 5 we read about the pattern of the Old Testament priesthood the"
    },
    {
      "id": 12,
      "start": 64.05999755859375,
      "end": 68.5199966430664,
      "text": " Prophecy of a greater priest and then as we went through chapter number 5"
    },
    {
      "id": 13,
      "start": 68.68000030517578,
      "end": 72.4000015258789,
      "text": " we find that the writer presents the Lord Jesus Christ as"
    },
    {
      "id": 14,
      "start": 73.4000015258789,
      "end": 81.16000366210938,
      "text": " The and proves that he is the fulfillment of that prophecy in Psalm 110 and that he indeed is"
    },
    {
      "id": 15,
      "start": 81.36000061035156,
      "end": 86.91999816894531,
      "text": " Superior and really what what was given to us in chapter number 5 as a preview"
    },
    {
      "id": 16,
      "start": 87.5199966430664,
      "end": 90.72000122070312,
      "text": " Now in chapter number 7 will be fully presented"
    },
    {
      "id": 17,
      "start": 91.63999938964844,
      "end": 98.44000244140625,
      "text": " Remember it was in chapter number 5 that he said this the writer says in verse number 10 called of God and high priest after"
    },
    {
      "id": 18,
      "start": 98.44000244140625,
      "end": 103.91999816894531,
      "text": " the order of Melchizedek and then in verse number 11 of whom we have many things to say and"
    },
    {
      "id": 19,
      "start": 104.72000122070312,
      "end": 109.5199966430664,
      "text": " We find that in chapter number 7 is where we begin to see those many things which he had to say"
    },
    {
      "id": 20,
      "start": 109.68000030517578,
      "end": 111.63999938964844,
      "text": " he took in a"
    },
    {
      "id": 21,
      "start": 111.63999938964844,
      "end": 116.16000366210938,
      "text": " Parenthesis if you will he said and hard to be uttered seeing you're dull of hearing and dealt with that"
    },
    {
      "id": 22,
      "start": 116.31999969482422,
      "end": 122.91999816894531,
      "text": " Warning section at the end of chapter number 5 all the way through chapter number 6 we end chapter number 6"
    },
    {
      "id": 23,
      "start": 123.31999969482422,
      "end": 126.44000244140625,
      "text": " Speaking again about the Lord Jesus Christ in verse number 20"
    },
    {
      "id": 24,
      "start": 126.55999755859375,
      "end": 131.0800018310547,
      "text": " Whether the forerunner is for us entered even Jesus and then notice"
    },
    {
      "id": 25,
      "start": 131.1199951171875,
      "end": 137.0800018310547,
      "text": " The way that the writer goes back to the subject that he was dealing with in chapter number 5 and will fully present it now"
    },
    {
      "id": 26,
      "start": 137.0800018310547,
      "end": 140.1199951171875,
      "text": " In chapter 7 made in high priest forever"
    },
    {
      "id": 27,
      "start": 140.60000610351562,
      "end": 146.36000061035156,
      "text": " After the order of Melchizedek and then he says for this Melchizedek chapter 7 verse number 1"
    },
    {
      "id": 28,
      "start": 147.0,
      "end": 148.44000244140625,
      "text": " King of Salem"
    },
    {
      "id": 29,
      "start": 148.44000244140625,
      "end": 150.36000061035156,
      "text": " priest of the Most High God"
    },
    {
      "id": 30,
      "start": 150.36000061035156,
      "end": 157.3000030517578,
      "text": " Who met Abraham returning from the slaughter of the kings and blessed him to whom also Abraham gave a tenth part of all"
    },
    {
      "id": 31,
      "start": 157.55999755859375,
      "end": 163.17999267578125,
      "text": " First being by interpretation king of righteousness and after that also king of Salem, which is king of peace"
    },
    {
      "id": 32,
      "start": 163.6999969482422,
      "end": 168.13999938964844,
      "text": " Without father without mother without descent having neither beginning of days nor end of life"
    },
    {
      "id": 33,
      "start": 168.39999389648438,
      "end": 172.47999572753906,
      "text": " But made like unto the Son of God abideth a priest"
    },
    {
      "id": 34,
      "start": 173.0800018310547,
      "end": 177.52000427246094,
      "text": " Continually skip down if you will and look at verse 24 and 25 with me"
    },
    {
      "id": 35,
      "start": 177.52000427246094,
      "end": 181.32000732421875,
      "text": " It says but this man speaking of Jesus because he continueth ever"
    },
    {
      "id": 36,
      "start": 182.0,
      "end": 183.47999572753906,
      "text": " half an"
    },
    {
      "id": 37,
      "start": 183.47999572753906,
      "end": 185.47999572753906,
      "text": " unchangeable priesthood"
    },
    {
      "id": 38,
      "start": 185.47999572753906,
      "end": 190.0800018310547,
      "text": " Wherefore he is able also to save them to the uttermost that come unto God by him"
    },
    {
      "id": 39,
      "start": 190.47999572753906,
      "end": 197.9600067138672,
      "text": " Seeing he ever liveth to make intercession for them. We'll look at the entirety of the chapter if you're taking notes"
    },
    {
      "id": 40,
      "start": 197.9600067138672,
      "end": 201.0800018310547,
      "text": " I have adopted the title from the end of verse number 24 an"
    },
    {
      "id": 41,
      "start": 201.8800048828125,
      "end": 203.8800048828125,
      "text": " Unchangeable priesthood an"
    },
    {
      "id": 42,
      "start": 204.0800018310547,
      "end": 208.22000122070312,
      "text": " Unchangeable priesthood. It's interesting as we look at the text of Scripture"
    },
    {
      "id": 43,
      "start": 208.22000122070312,
      "end": 211.0800018310547,
      "text": " If you're taking notes notice number one the description of Melchizedek"
    },
    {
      "id": 44,
      "start": 211.1999969482422,
      "end": 216.9600067138672,
      "text": " Really in verses 1 through 10 of chapter number 7 the writer of Hebrews is giving us a description of Melchizedek"
    },
    {
      "id": 45,
      "start": 216.9600067138672,
      "end": 220.24000549316406,
      "text": " In fact, you'd have to travel all the way back to Genesis chapter number 14"
    },
    {
      "id": 46,
      "start": 220.24000549316406,
      "end": 226.8800048828125,
      "text": " And you would see just a couple of verses of Scripture in Genesis chapter number 14 about this one Melchizedek"
    },
    {
      "id": 47,
      "start": 226.9199981689453,
      "end": 231.16000366210938,
      "text": " There's a couple of verses in Genesis 14, there's one verse in Psalm 110"
    },
    {
      "id": 48,
      "start": 231.60000610351562,
      "end": 237.0399932861328,
      "text": " That's a prophecy concerning the Lord Jesus Christ. And that's all you read in the Old Testament about Melchizedek"
    },
    {
      "id": 49,
      "start": 237.0399932861328,
      "end": 245.44000244140625,
      "text": " In fact, if Hebrews did not give us the truth that is provided here in chapter 5 7 8 and in dealing with"
    },
    {
      "id": 50,
      "start": 245.44000244140625,
      "end": 252.0,
      "text": " The order of Melchizedek. The reality is that many of us probably would not even remember the name Melchizedek"
    },
    {
      "id": 51,
      "start": 252.63999938964844,
      "end": 256.6000061035156,
      "text": " It's just so quickly in chapter number 14 the book of Genesis and it"
    },
    {
      "id": 52,
      "start": 257.0,
      "end": 263.05999755859375,
      "text": " Amazes me when you think about the book that we hold in our hand you think about the divine author the"
    },
    {
      "id": 53,
      "start": 263.3999938964844,
      "end": 267.55999755859375,
      "text": " God of heaven that gave us this book and how he uses"
    },
    {
      "id": 54,
      "start": 268.0,
      "end": 275.9599914550781,
      "text": " the truth of Genesis 14 to prove to provide a type of the Lord Jesus Christ and we see here in Hebrews that"
    },
    {
      "id": 55,
      "start": 276.1199951171875,
      "end": 278.1199951171875,
      "text": " The writer takes these"
    },
    {
      "id": 56,
      "start": 278.2799987792969,
      "end": 280.2799987792969,
      "text": " These believers that he's writing to"
    },
    {
      "id": 57,
      "start": 280.79998779296875,
      "end": 285.32000732421875,
      "text": " Back to Genesis 14 now, we mentioned this as we studied the end of chapter number 6"
    },
    {
      "id": 58,
      "start": 285.8399963378906,
      "end": 293.3599853515625,
      "text": " these Jewish believers that are being written to in the book of Hebrews, they obviously held Abraham in high regard and"
    },
    {
      "id": 59,
      "start": 294.5199890136719,
      "end": 300.2799987792969,
      "text": " Abraham I mean he was the one that was given the promise father Abraham. I mean a dear"
    },
    {
      "id": 60,
      "start": 301.0799865722656,
      "end": 302.3999938964844,
      "text": " person"
    },
    {
      "id": 61,
      "start": 302.3999938964844,
      "end": 309.4800109863281,
      "text": " Patriarch within their culture within their understanding and we found that in chapter number 6 the writer begins to deal with some things with"
    },
    {
      "id": 62,
      "start": 309.55999755859375,
      "end": 317.2799987792969,
      "text": " regard to Abraham and then we get into chapter number 7 and God is going to use this brief interaction"
    },
    {
      "id": 63,
      "start": 317.6000061035156,
      "end": 318.760009765625,
      "text": " between"
    },
    {
      "id": 64,
      "start": 318.760009765625,
      "end": 326.8399963378906,
      "text": " Melchizedek and Abraham to show the superiority of the priesthood of Jesus Christ. It's an amazing truth"
    },
    {
      "id": 65,
      "start": 326.8399963378906,
      "end": 333.55999755859375,
      "text": " It's a technical passage of Scripture and I'm gonna try to get through it and trust it to be a blessing to you this morning"
    },
    {
      "id": 66,
      "start": 333.7200012207031,
      "end": 335.8399963378906,
      "text": " We find that back in Genesis 14"
    },
    {
      "id": 67,
      "start": 335.8399963378906,
      "end": 340.8800048828125,
      "text": " In fact go back there if you will and I want you to see the verses that are given we have so much more"
    },
    {
      "id": 68,
      "start": 341.32000732421875,
      "end": 345.9599914550781,
      "text": " Information in the book of Hebrews about Melchizedek than we do in the book of Genesis"
    },
    {
      "id": 69,
      "start": 347.55999755859375,
      "end": 353.44000244140625,
      "text": " Because we find that in the book of Hebrews the truth that is given to us in Genesis this brief interaction is"
    },
    {
      "id": 70,
      "start": 354.1199951171875,
      "end": 358.67999267578125,
      "text": " Given to us in the fulfillment there in the book of Hebrews"
    },
    {
      "id": 71,
      "start": 358.67999267578125,
      "end": 365.1199951171875,
      "text": " In fact, it's interesting that as Abraham would return back. Remember he heard that Lot had been taken captive"
    },
    {
      "id": 72,
      "start": 365.1199951171875,
      "end": 370.05999755859375,
      "text": " He took all of the trained servants from his house and he went and he delivered Lot and the others"
    },
    {
      "id": 73,
      "start": 370.3999938964844,
      "end": 376.760009765625,
      "text": " And we find that there were actually two kings that met him upon his return. One was the king of Melchizedek"
    },
    {
      "id": 74,
      "start": 377.9200134277344,
      "end": 379.9200134277344,
      "text": " Melchizedek we see that the king of Salem"
    },
    {
      "id": 75,
      "start": 380.3599853515625,
      "end": 384.4800109863281,
      "text": " But we also see that the king of Sodom was there as well"
    },
    {
      "id": 76,
      "start": 385.1600036621094,
      "end": 387.1600036621094,
      "text": " Not much dealt with with the king of Sodom"
    },
    {
      "id": 77,
      "start": 387.67999267578125,
      "end": 394.760009765625,
      "text": " Because that's not a type of the the priesthood of Melchizedek the fulfillment of Jesus Christ in that typology"
    },
    {
      "id": 78,
      "start": 395.1199951171875,
      "end": 398.5199890136719,
      "text": " But notice here in verse number 18 of Genesis 14"
    },
    {
      "id": 79,
      "start": 398.5199890136719,
      "end": 406.1600036621094,
      "text": " The Bible says and Melchizedek king of Salem brought forth bread and wine and he was the priest of"
    },
    {
      "id": 80,
      "start": 406.32000732421875,
      "end": 408.32000732421875,
      "text": " the Most High God and"
    },
    {
      "id": 81,
      "start": 408.79998779296875,
      "end": 413.1199951171875,
      "text": " He blessed him and said blessed be Abram of the Most High God"
    },
    {
      "id": 82,
      "start": 413.9200134277344,
      "end": 416.3999938964844,
      "text": " possessor of heaven and earth and"
    },
    {
      "id": 83,
      "start": 416.9200134277344,
      "end": 421.0,
      "text": " blessed be the Most High God which hath delivered thine enemies into thy hand and"
    },
    {
      "id": 84,
      "start": 421.3599853515625,
      "end": 428.1199951171875,
      "text": " He Abram or Abraham as we often refer to him as gave him Melchizedek tithes of all"
    },
    {
      "id": 85,
      "start": 428.3599853515625,
      "end": 431.0400085449219,
      "text": " It says and the king of Sodom said unto Abram"
    },
    {
      "id": 86,
      "start": 431.0400085449219,
      "end": 434.5199890136719,
      "text": " Give me the persons and take the goods to thyself and Abram said to the king of Sodom"
    },
    {
      "id": 87,
      "start": 434.5199890136719,
      "end": 438.8399963378906,
      "text": " I have lift up mine hand unto the Lord the Most High God the possessor of heaven and earth"
    },
    {
      "id": 88,
      "start": 439.1600036621094,
      "end": 446.55999755859375,
      "text": " That I will not take from from a thread even to a shoelatch it and that I will not take anything"
    },
    {
      "id": 89,
      "start": 446.55999755859375,
      "end": 453.760009765625,
      "text": " That is thine lest thou should have say I have made Abram rich. It's interesting the king of Salem"
    },
    {
      "id": 90,
      "start": 454.2799987792969,
      "end": 459.55999755859375,
      "text": " Melchizedek this type of Jesus Christ that we see the fulfillment here in the book of Hebrews"
    },
    {
      "id": 91,
      "start": 460.1600036621094,
      "end": 462.1600036621094,
      "text": " Abraham gives him tithes"
    },
    {
      "id": 92,
      "start": 462.6400146484375,
      "end": 464.6400146484375,
      "text": " The king of Sodom"
    },
    {
      "id": 93,
      "start": 464.8800048828125,
      "end": 468.55999755859375,
      "text": " Offers to pay Abraham some money and Abraham says no"
    },
    {
      "id": 94,
      "start": 468.55999755859375,
      "end": 475.32000732421875,
      "text": " I'm not gonna take anything from you and it's interesting because look we there's very little given to us in Genesis about"
    },
    {
      "id": 95,
      "start": 475.6000061035156,
      "end": 477.79998779296875,
      "text": " Melchizedek, but look at how the writer of Hebrews"
    },
    {
      "id": 96,
      "start": 478.67999267578125,
      "end": 485.0400085449219,
      "text": " Expands this truth and gives us this typology again as we've mentioned with many characters throughout the Word of God"
    },
    {
      "id": 97,
      "start": 485.32000732421875,
      "end": 489.0799865722656,
      "text": " this Melchizedek just steps on the pages of Scripture and"
    },
    {
      "id": 98,
      "start": 489.4800109863281,
      "end": 494.6000061035156,
      "text": " Just as quickly as he steps on he steps off. There's just a couple of verses"
    },
    {
      "id": 99,
      "start": 495.3599853515625,
      "end": 501.2799987792969,
      "text": " Remember as we've studied the life of Elijah, it's as if he just appears out of nowhere in first Kings 17"
    },
    {
      "id": 100,
      "start": 501.2799987792969,
      "end": 501.79998779296875,
      "text": " I mean BAM"
    },
    {
      "id": 101,
      "start": 501.79998779296875,
      "end": 504.9599914550781,
      "text": " there's Elijah standing before Ahab and you just see him and"
    },
    {
      "id": 102,
      "start": 505.32000732421875,
      "end": 509.55999755859375,
      "text": " You see his life and his ministry and all of those things in here with this Melchizedek"
    },
    {
      "id": 103,
      "start": 509.55999755859375,
      "end": 513.9600219726562,
      "text": " He just appears notice what the Bible tells us about the description of this one"
    },
    {
      "id": 104,
      "start": 514.2000122070312,
      "end": 518.4000244140625,
      "text": " Melchizedek the Bible tells us look at the names that are given the titles if you will"
    },
    {
      "id": 105,
      "start": 518.8800048828125,
      "end": 521.47998046875,
      "text": " verse number one king of Salem"
    },
    {
      "id": 106,
      "start": 522.6799926757812,
      "end": 525.239990234375,
      "text": " verse number one priest of the Most High God"
    },
    {
      "id": 107,
      "start": 526.1599731445312,
      "end": 528.9600219726562,
      "text": " notice in verse number two king of righteousness"
    },
    {
      "id": 108,
      "start": 530.4000244140625,
      "end": 533.5999755859375,
      "text": " Then it says this and after that also king of Salem, which is"
    },
    {
      "id": 109,
      "start": 534.280029296875,
      "end": 536.280029296875,
      "text": " king of peace"
    },
    {
      "id": 110,
      "start": 536.4000244140625,
      "end": 539.9600219726562,
      "text": " The Bible gives us this information in verse number three now"
    },
    {
      "id": 111,
      "start": 539.9600219726562,
      "end": 547.3200073242188,
      "text": " It's interesting because as I mentioned as we looked at Genesis chapter number 14, there's no real record this this Melchizedek just appears"
    },
    {
      "id": 112,
      "start": 547.8400268554688,
      "end": 549.1199951171875,
      "text": " and"
    },
    {
      "id": 113,
      "start": 549.1199951171875,
      "end": 555.239990234375,
      "text": " Here in verse number three, we find that there's no lineage that is provided for this one Melchizedek"
    },
    {
      "id": 114,
      "start": 555.8800048828125,
      "end": 561.3200073242188,
      "text": " The Bible says without father without mother without descent having neither beginning of days nor end of life"
    },
    {
      "id": 115,
      "start": 561.4400024414062,
      "end": 565.6400146484375,
      "text": " But made like unto the Son of God abideth a priest"
    },
    {
      "id": 116,
      "start": 566.7999877929688,
      "end": 571.2000122070312,
      "text": " Continually as we look at verse number three and we notice that there's no lineage that's provided"
    },
    {
      "id": 117,
      "start": 571.2000122070312,
      "end": 574.4000244140625,
      "text": " It does not mean that he did not have mother or father"
    },
    {
      "id": 118,
      "start": 574.47998046875,
      "end": 578.4400024414062,
      "text": " We just find that it's not provided for us in the account in the book of Genesis"
    },
    {
      "id": 119,
      "start": 578.5599975585938,
      "end": 584.3599853515625,
      "text": " It's very interesting that it's not provided for us in the book of Genesis because Genesis is a book of genealogies"
    },
    {
      "id": 120,
      "start": 585.0800170898438,
      "end": 591.4400024414062,
      "text": " Genesis is a book where you see all of these things about the the family tribes and who begat who and so on and so"
    },
    {
      "id": 121,
      "start": 591.4400024414062,
      "end": 593.4400024414062,
      "text": " forth and you see these genealogies"
    },
    {
      "id": 122,
      "start": 593.8400268554688,
      "end": 597.239990234375,
      "text": " throughout the book of Genesis and yet for this one"
    },
    {
      "id": 123,
      "start": 598.0800170898438,
      "end": 600.0800170898438,
      "text": " this Melchizedek"
    },
    {
      "id": 0,
      "start": 600.0800170898438,
      "end": 603.2000169754028,
      "text": " He's a king and a priest, which is, of course,"
    },
    {
      "id": 1,
      "start": 603.2000169754028,
      "end": 605.8000168800354,
      "text": " our Lord is prophet, priest, and king,"
    },
    {
      "id": 2,
      "start": 605.8000168800354,
      "end": 609.7200174331665,
      "text": " and we understand that, but we find that as a priest,"
    },
    {
      "id": 3,
      "start": 609.7200174331665,
      "end": 612.2400169372559,
      "text": " being able to provide your lineage"
    },
    {
      "id": 4,
      "start": 612.2400169372559,
      "end": 614.8800172805786,
      "text": " was of significant importance."
    },
    {
      "id": 5,
      "start": 614.8800172805786,
      "end": 616.3200168609619,
      "text": " I won't ask you to turn back there,"
    },
    {
      "id": 6,
      "start": 616.3200168609619,
      "end": 619.9600162506104,
      "text": " but if you jot down in Nehemiah chapter number seven,"
    },
    {
      "id": 7,
      "start": 619.9600162506104,
      "end": 622.1400165557861,
      "text": " it's also recorded in the book of Ezra,"
    },
    {
      "id": 8,
      "start": 622.1400165557861,
      "end": 625.9400177001953,
      "text": " but in Nehemiah seven, verses 63 and 64,"
    },
    {
      "id": 9,
      "start": 625.9400177001953,
      "end": 628.2400169372559,
      "text": " the Bible says this, and of the priests,"
    },
    {
      "id": 10,
      "start": 628.2400169372559,
      "end": 631.1000175476074,
      "text": " the children of Habeiah, the children of Chaz,"
    },
    {
      "id": 11,
      "start": 631.1000175476074,
      "end": 632.5000152587891,
      "text": " the children of Barzillia,"
    },
    {
      "id": 12,
      "start": 632.5000152587891,
      "end": 634.5400161743164,
      "text": " which took one of the daughters of Barzillia,"
    },
    {
      "id": 13,
      "start": 634.5400161743164,
      "end": 638.1800155639648,
      "text": " the Gileadite, to wife, and was called after their name."
    },
    {
      "id": 14,
      "start": 638.1800155639648,
      "end": 641.460018157959,
      "text": " These sought their register among those"
    },
    {
      "id": 15,
      "start": 641.460018157959,
      "end": 645.8600158691406,
      "text": " that were reckoned by genealogy, but it was not found."
    },
    {
      "id": 16,
      "start": 645.8600158691406,
      "end": 647.1400184631348,
      "text": " What happened?"
    },
    {
      "id": 17,
      "start": 647.1400184631348,
      "end": 652.1400184631348,
      "text": " Therefore were they, as polluted, put from the priesthood."
    },
    {
      "id": 18,
      "start": 653.7800178527832,
      "end": 657.6600189208984,
      "text": " They could not be called and counted"
    },
    {
      "id": 19,
      "start": 657.6600189208984,
      "end": 660.900016784668,
      "text": " amongst the priests because they could not provide"
    },
    {
      "id": 20,
      "start": 660.900016784668,
      "end": 663.5000152587891,
      "text": " their genealogy, their lineage."
    },
    {
      "id": 21,
      "start": 663.5000152587891,
      "end": 665.9800186157227,
      "text": " And so we find here that it's very interesting"
    },
    {
      "id": 22,
      "start": 665.9800186157227,
      "end": 668.1400146484375,
      "text": " that there's no lineage that is provided."
    },
    {
      "id": 23,
      "start": 668.1400146484375,
      "end": 670.4200134277344,
      "text": " The Bible tells us there in verse number three,"
    },
    {
      "id": 24,
      "start": 670.4200134277344,
      "end": 674.1400146484375,
      "text": " but made like unto the Son of God."
    },
    {
      "id": 25,
      "start": 674.1400146484375,
      "end": 676.6600189208984,
      "text": " We see that this is an Old Testament type"
    },
    {
      "id": 26,
      "start": 676.6600189208984,
      "end": 678.5400161743164,
      "text": " of the Lord Jesus Christ."
    },
    {
      "id": 27,
      "start": 678.5400161743164,
      "end": 683.3000183105469,
      "text": " We know that the Lord Jesus Christ, He is eternal, amen?"
    },
    {
      "id": 28,
      "start": 683.3000183105469,
      "end": 687.5800170898438,
      "text": " He has always been, He is, He was, and He will be,"
    },
    {
      "id": 29,
      "start": 688.5000152587891,
      "end": 691.5000152587891,
      "text": " and what a joy to understand that He is alpha and omega,"
    },
    {
      "id": 30,
      "start": 691.5000152587891,
      "end": 694.3000183105469,
      "text": " the beginning and the end, the first and the last."
    },
    {
      "id": 31,
      "start": 694.3000183105469,
      "end": 698.3800201416016,
      "text": " There's never a time, I mean, because He transcends time,"
    },
    {
      "id": 32,
      "start": 698.3800201416016,
      "end": 700.8200149536133,
      "text": " you never can find a time when He did not exist"
    },
    {
      "id": 33,
      "start": 700.8200149536133,
      "end": 702.7400207519531,
      "text": " or that He will not exist."
    },
    {
      "id": 34,
      "start": 702.7400207519531,
      "end": 705.1000137329102,
      "text": " Our God is eternal."
    },
    {
      "id": 35,
      "start": 705.1000137329102,
      "end": 707.0600204467773,
      "text": " We find that it's interesting as we continue"
    },
    {
      "id": 36,
      "start": 707.0600204467773,
      "end": 708.9800186157227,
      "text": " to look at this description of Melchizedek"
    },
    {
      "id": 37,
      "start": 708.9800186157227,
      "end": 711.7800140380859,
      "text": " that the Bible tells us, and I mentioned it back in there"
    },
    {
      "id": 38,
      "start": 711.7800140380859,
      "end": 716.7800140380859,
      "text": " in Genesis 14, that Abraham gave tithes to Melchizedek."
    },
    {
      "id": 39,
      "start": 716.7800140380859,
      "end": 718.8600158691406,
      "text": " Notice it says here in verse number four,"
    },
    {
      "id": 40,
      "start": 718.8600158691406,
      "end": 722.2200164794922,
      "text": " now consider how great this man was"
    },
    {
      "id": 41,
      "start": 722.2200164794922,
      "end": 724.3400192260742,
      "text": " unto whom, notice this phrase,"
    },
    {
      "id": 42,
      "start": 724.3400192260742,
      "end": 729.3400115966797,
      "text": " even the patriarch Abraham gave the tenth of the spoils."
    },
    {
      "id": 43,
      "start": 730.6000213623047,
      "end": 732.6600189208984,
      "text": " Now think about this, for us this morning,"
    },
    {
      "id": 44,
      "start": 732.6600189208984,
      "end": 734.5800170898438,
      "text": " perhaps it's a little bit challenging,"
    },
    {
      "id": 45,
      "start": 734.5800170898438,
      "end": 736.2200164794922,
      "text": " but think about putting your mind"
    },
    {
      "id": 46,
      "start": 736.2200164794922,
      "end": 739.8200225830078,
      "text": " in the mindset of these Jewish believers,"
    },
    {
      "id": 47,
      "start": 739.8200225830078,
      "end": 742.7400207519531,
      "text": " the regard that they had for Abraham,"
    },
    {
      "id": 48,
      "start": 742.7400207519531,
      "end": 745.5400238037109,
      "text": " and then telling these believers,"
    },
    {
      "id": 49,
      "start": 745.5400238037109,
      "end": 748.0600128173828,
      "text": " now consider how great this man was,"
    },
    {
      "id": 50,
      "start": 748.0600128173828,
      "end": 749.9000244140625,
      "text": " speaking of Melchizedek,"
    },
    {
      "id": 51,
      "start": 749.9000244140625,
      "end": 753.7400207519531,
      "text": " unto whom even the patriarch Abraham"
    },
    {
      "id": 52,
      "start": 753.7400207519531,
      "end": 756.3800201416016,
      "text": " gave the tenth of the spoils."
    },
    {
      "id": 53,
      "start": 756.3800201416016,
      "end": 758.7800140380859,
      "text": " See, they held Abraham at a high place,"
    },
    {
      "id": 54,
      "start": 758.7800140380859,
      "end": 761.02001953125,
      "text": " and they're saying, but he, Abraham,"
    },
    {
      "id": 55,
      "start": 761.02001953125,
      "end": 764.02001953125,
      "text": " gave tithes to Melchizedek."
    },
    {
      "id": 56,
      "start": 764.02001953125,
      "end": 765.7400207519531,
      "text": " What does that show?"
    },
    {
      "id": 57,
      "start": 765.7400207519531,
      "end": 769.7000122070312,
      "text": " Well, certainly it shows who is the greater"
    },
    {
      "id": 58,
      "start": 769.7000122070312,
      "end": 772.6200103759766,
      "text": " in the minds of these Jewish believers"
    },
    {
      "id": 59,
      "start": 772.6200103759766,
      "end": 775.0600128173828,
      "text": " for them to begin thinking about this"
    },
    {
      "id": 60,
      "start": 775.0600128173828,
      "end": 776.3400115966797,
      "text": " which is being presented,"
    },
    {
      "id": 61,
      "start": 776.3400115966797,
      "end": 778.7400207519531,
      "text": " and to understand the application"
    },
    {
      "id": 62,
      "start": 778.7400207519531,
      "end": 781.5800170898438,
      "text": " by which this passage will lead to"
    },
    {
      "id": 63,
      "start": 781.5800170898438,
      "end": 783.3400115966797,
      "text": " in dealing with the superiority"
    },
    {
      "id": 64,
      "start": 783.3400115966797,
      "end": 785.3400115966797,
      "text": " of the priesthood of Jesus Christ,"
    },
    {
      "id": 65,
      "start": 785.3400115966797,
      "end": 788.3000183105469,
      "text": " we find that he's setting the scene"
    },
    {
      "id": 66,
      "start": 788.3000183105469,
      "end": 790.1000213623047,
      "text": " for them to understand,"
    },
    {
      "id": 67,
      "start": 790.1000213623047,
      "end": 792.5000152587891,
      "text": " you hold Abraham in high regard,"
    },
    {
      "id": 68,
      "start": 792.5000152587891,
      "end": 795.6600189208984,
      "text": " but he paid tithes to Melchizedek."
    },
    {
      "id": 69,
      "start": 795.6600189208984,
      "end": 798.7000122070312,
      "text": " Notice, verse number five, as it continues,"
    },
    {
      "id": 70,
      "start": 798.7000122070312,
      "end": 802.1400146484375,
      "text": " it says, and verily, they that are of the sons of Levi,"
    },
    {
      "id": 71,
      "start": 802.1400146484375,
      "end": 803.9800109863281,
      "text": " now what is he doing?"
    },
    {
      "id": 72,
      "start": 803.9800109863281,
      "end": 805.1000213623047,
      "text": " He's dealing with the priesthood"
    },
    {
      "id": 73,
      "start": 805.1000213623047,
      "end": 806.9400177001953,
      "text": " that they would be familiar with, right?"
    },
    {
      "id": 74,
      "start": 806.9400177001953,
      "end": 809.3400115966797,
      "text": " We often refer to it as the Aaronic priesthood."
    },
    {
      "id": 75,
      "start": 809.3400115966797,
      "end": 811.5800170898438,
      "text": " The Levitical priesthood will be the terminology"
    },
    {
      "id": 76,
      "start": 811.5800170898438,
      "end": 814.1800231933594,
      "text": " that will be used here in the book of Hebrews."
    },
    {
      "id": 77,
      "start": 814.1800231933594,
      "end": 816.4200134277344,
      "text": " And look what he says, and verily,"
    },
    {
      "id": 78,
      "start": 816.4200134277344,
      "end": 818.3800201416016,
      "text": " they that are of the sons of Levi"
    },
    {
      "id": 79,
      "start": 818.3800201416016,
      "end": 821.7400207519531,
      "text": " who receive the office of the priesthood"
    },
    {
      "id": 80,
      "start": 821.7400207519531,
      "end": 825.7000122070312,
      "text": " have a commandment to take tithes of the people"
    },
    {
      "id": 81,
      "start": 825.7000122070312,
      "end": 827.5400238037109,
      "text": " according to the law."
    },
    {
      "id": 82,
      "start": 827.5400238037109,
      "end": 829.3400115966797,
      "text": " That is, of their brethren,"
    },
    {
      "id": 83,
      "start": 829.3400115966797,
      "end": 833.260009765625,
      "text": " though they come out of the loins of Abraham."
    },
    {
      "id": 84,
      "start": 833.260009765625,
      "end": 835.5000152587891,
      "text": " Now follow the thought, skip down if you will,"
    },
    {
      "id": 85,
      "start": 835.5000152587891,
      "end": 837.0600128173828,
      "text": " we'll look at verse six and seven in just a minute,"
    },
    {
      "id": 86,
      "start": 837.0600128173828,
      "end": 839.1400146484375,
      "text": " but look at verses eight through 10."
    },
    {
      "id": 87,
      "start": 839.1400146484375,
      "end": 843.3800201416016,
      "text": " And here, men that die receive tithes,"
    },
    {
      "id": 88,
      "start": 843.3800201416016,
      "end": 845.8600158691406,
      "text": " but there he receiveth them"
    },
    {
      "id": 89,
      "start": 845.8600158691406,
      "end": 848.6200103759766,
      "text": " of whom it is witnessed that he liveth."
    },
    {
      "id": 90,
      "start": 848.6200103759766,
      "end": 853.6200103759766,
      "text": " And as I may so say, Levi also who receiveth tithes,"
    },
    {
      "id": 91,
      "start": 854.3400115966797,
      "end": 857.8200073242188,
      "text": " notice this, paid tithes in Abraham."
    },
    {
      "id": 92,
      "start": 857.8200073242188,
      "end": 858.6600036621094,
      "text": " How?"
    },
    {
      "id": 93,
      "start": 858.6600036621094,
      "end": 860.0600280761719,
      "text": " Well, he explains it in verse number 10."
    },
    {
      "id": 94,
      "start": 860.0600280761719,
      "end": 862.1800231933594,
      "text": " For he, speaking of Levi,"
    },
    {
      "id": 95,
      "start": 862.1800231933594,
      "end": 865.8600158691406,
      "text": " was yet in the loins of his father"
    },
    {
      "id": 96,
      "start": 865.8600158691406,
      "end": 868.6200256347656,
      "text": " when Melchizedek met him."
    },
    {
      "id": 97,
      "start": 868.6200256347656,
      "end": 871.7000122070312,
      "text": " Now, again, we often refer to Father Abraham, right?"
    },
    {
      "id": 98,
      "start": 871.7000122070312,
      "end": 874.8600158691406,
      "text": " And we understand the mindset of the Jewish believer"
    },
    {
      "id": 99,
      "start": 874.8600158691406,
      "end": 876.8600158691406,
      "text": " and how they would be wrapping their mind"
    },
    {
      "id": 100,
      "start": 876.8600158691406,
      "end": 879.02001953125,
      "text": " around this truth that is presented,"
    },
    {
      "id": 101,
      "start": 879.02001953125,
      "end": 881.8200073242188,
      "text": " and they're being given this obscure passage of scripture"
    },
    {
      "id": 102,
      "start": 881.8200073242188,
      "end": 883.3400268554688,
      "text": " in the book of Genesis,"
    },
    {
      "id": 103,
      "start": 883.3400268554688,
      "end": 886.5000305175781,
      "text": " many times we would just maybe rush right through it,"
    },
    {
      "id": 104,
      "start": 886.5000305175781,
      "end": 888.4600219726562,
      "text": " not even remember the details."
    },
    {
      "id": 105,
      "start": 888.4600219726562,
      "end": 890.0600280761719,
      "text": " And the writer of Hebrews says,"
    },
    {
      "id": 106,
      "start": 890.1000061035156,
      "end": 892.1800231933594,
      "text": " and I wanna call your attention"
    },
    {
      "id": 107,
      "start": 892.1800231933594,
      "end": 896.9400024414062,
      "text": " to this interaction between Abraham and Melchizedek,"
    },
    {
      "id": 108,
      "start": 896.9400024414062,
      "end": 898.9400024414062,
      "text": " and we take the prophecy,"
    },
    {
      "id": 109,
      "start": 898.9400024414062,
      "end": 901.4600219726562,
      "text": " the messianic prophecy of Psalm 110,"
    },
    {
      "id": 110,
      "start": 901.4600219726562,
      "end": 903.4600219726562,
      "text": " and we're gonna properly apply it"
    },
    {
      "id": 111,
      "start": 903.4600219726562,
      "end": 906.5400085449219,
      "text": " to the person of Jesus Christ, God in flesh,"
    },
    {
      "id": 112,
      "start": 906.5400085449219,
      "end": 908.260009765625,
      "text": " and we're going to prove this to you."
    },
    {
      "id": 113,
      "start": 908.260009765625,
      "end": 911.8600158691406,
      "text": " And he deals with the subject of these tithes that are paid."
    },
    {
      "id": 114,
      "start": 911.8600158691406,
      "end": 914.7000122070312,
      "text": " See, the Bible tells us in verse number 10"
    },
    {
      "id": 115,
      "start": 914.7000122070312,
      "end": 916.4600219726562,
      "text": " that he, speaking of Levi,"
    },
    {
      "id": 116,
      "start": 916.4600219726562,
      "end": 919.3000183105469,
      "text": " was yet in the loins of his father."
    },
    {
      "id": 117,
      "start": 919.3000183105469,
      "end": 922.3000183105469,
      "text": " Levi is well after Abraham."
    },
    {
      "id": 118,
      "start": 922.3000183105469,
      "end": 927.260009765625,
      "text": " Abraham and Sarah didn't give birth to Levi, right?"
    },
    {
      "id": 119,
      "start": 927.260009765625,
      "end": 928.3400268554688,
      "text": " Who was the promised son?"
    },
    {
      "id": 120,
      "start": 928.3400268554688,
      "end": 929.6200256347656,
      "text": " Isaac."
    },
    {
      "id": 121,
      "start": 929.6200256347656,
      "end": 930.5400085449219,
      "text": " And then who?"
    },
    {
      "id": 122,
      "start": 930.5400085449219,
      "end": 931.8600158691406,
      "text": " Then Jacob."
    },
    {
      "id": 123,
      "start": 931.8600158691406,
      "end": 932.7000122070312,
      "text": " Then who?"
    },
    {
      "id": 124,
      "start": 932.7000122070312,
      "end": 933.9800109863281,
      "text": " Then you get to Levi."
    },
    {
      "id": 125,
      "start": 933.9800109863281,
      "end": 937.8200073242188,
      "text": " And by the way, then you eventually get to Amram,"
    },
    {
      "id": 126,
      "start": 937.8200073242188,
      "end": 940.6200256347656,
      "text": " who was the father of Aaron, right?"
    },
    {
      "id": 127,
      "start": 940.6200256347656,
      "end": 943.2200317382812,
      "text": " And you understand the Aaronic priesthood"
    },
    {
      "id": 128,
      "start": 943.2200317382812,
      "end": 944.8600158691406,
      "text": " as we often refer to it,"
    },
    {
      "id": 129,
      "start": 944.8600158691406,
      "end": 947.6200256347656,
      "text": " but you understand that as he, Abraham,"
    },
    {
      "id": 130,
      "start": 947.9800109863281,
      "end": 951.6200256347656,
      "text": " is the father of the nation, if you will,"
    },
    {
      "id": 131,
      "start": 951.6200256347656,
      "end": 954.1400146484375,
      "text": " we find that what the writer is saying"
    },
    {
      "id": 132,
      "start": 954.1400146484375,
      "end": 958.0600280761719,
      "text": " is that if Abraham paid tithes to Melchizedek,"
    },
    {
      "id": 133,
      "start": 958.0600280761719,
      "end": 961.9400024414062,
      "text": " and Levi is through the loins of Abraham,"
    },
    {
      "id": 134,
      "start": 961.9400024414062,
      "end": 966.260009765625,
      "text": " then in essence, Levi paid tithes to Melchizedek."
    },
    {
      "id": 135,
      "start": 966.260009765625,
      "end": 968.5400085449219,
      "text": " Now, think about the mind of these Jewish believers,"
    },
    {
      "id": 136,
      "start": 968.5400085449219,
      "end": 969.8600158691406,
      "text": " I mean, kind of scratching their head"
    },
    {
      "id": 137,
      "start": 969.8600158691406,
      "end": 972.4600219726562,
      "text": " and trying to wrap their mind around this truth"
    },
    {
      "id": 138,
      "start": 972.4600219726562,
      "end": 974.3400268554688,
      "text": " that is being presented to them."
    },
    {
      "id": 139,
      "start": 974.3400268554688,
      "end": 976.780029296875,
      "text": " Again, the temple is still standing,"
    },
    {
      "id": 140,
      "start": 976.780029296875,
      "end": 978.7000122070312,
      "text": " the offerings are still being made,"
    },
    {
      "id": 141,
      "start": 978.7000122070312,
      "end": 982.9800109863281,
      "text": " the idea of some of these believers going back to Judaism,"
    },
    {
      "id": 142,
      "start": 982.9800109863281,
      "end": 985.02001953125,
      "text": " and we find that the writer of Hebrews is saying,"
    },
    {
      "id": 143,
      "start": 985.02001953125,
      "end": 988.260009765625,
      "text": " no, continue to walk with the Lord Jesus Christ."
    },
    {
      "id": 144,
      "start": 988.260009765625,
      "end": 992.4200134277344,
      "text": " He's better, he's superior, and I'm gonna prove it to you."
    },
    {
      "id": 145,
      "start": 992.4200134277344,
      "end": 995.8200073242188,
      "text": " And he's been proving it chapter by chapter,"
    },
    {
      "id": 146,
      "start": 995.8200073242188,
      "end": 998.9400024414062,
      "text": " and he's been giving them the admonition to continue."
    },
    {
      "id": 147,
      "start": 998.9400024414062,
      "end": 1000.9400024414062,
      "text": " Remember, as we dealt with the latter part"
    },
    {
      "id": 148,
      "start": 1000.9400024414062,
      "end": 1003.4600219726562,
      "text": " of chapter number six about the promises,"
    },
    {
      "id": 149,
      "start": 1003.4600219726562,
      "end": 1005.02001953125,
      "text": " Abraham received a promise,"
    },
    {
      "id": 150,
      "start": 1005.02001953125,
      "end": 1006.8200073242188,
      "text": " but he didn't obtain the promise"
    },
    {
      "id": 151,
      "start": 1006.8200073242188,
      "end": 1009.7400207519531,
      "text": " until he endured with patience."
    },
    {
      "id": 152,
      "start": 1009.7400207519531,
      "end": 1011.8200073242188,
      "text": " We find that there's this challenge"
    },
    {
      "id": 153,
      "start": 1011.8200073242188,
      "end": 1013.5800170898438,
      "text": " that is given to continue."
    },
    {
      "id": 154,
      "start": 1013.5800170898438,
      "end": 1017.8200073242188,
      "text": " We find that Melchizedek, not only did Abraham pay tithes"
    },
    {
      "id": 155,
      "start": 1017.8200073242188,
      "end": 1019.3000183105469,
      "text": " or give tithes to Melchizedek,"
    },
    {
      "id": 156,
      "start": 1019.3000183105469,
      "end": 1021.6200256347656,
      "text": " but we read in the book of Genesis,"
    },
    {
      "id": 157,
      "start": 1021.6200256347656,
      "end": 1023.3800048828125,
      "text": " in chapter 14 and verse number 19,"
    },
    {
      "id": 158,
      "start": 1023.3800048828125,
      "end": 1025.9800109863281,
      "text": " how Melchizedek blessed Abraham."
    },
    {
      "id": 159,
      "start": 1025.9800109863281,
      "end": 1029.3400268554688,
      "text": " Notice it's recorded for us here in verses six and seven"
    },
    {
      "id": 160,
      "start": 1029.3400268554688,
      "end": 1031.8600158691406,
      "text": " of Hebrews chapter number seven."
    },
    {
      "id": 161,
      "start": 1031.8600158691406,
      "end": 1035.7000122070312,
      "text": " But he whose descent is not counted from them"
    },
    {
      "id": 162,
      "start": 1035.7000122070312,
      "end": 1037.260009765625,
      "text": " received tithes of Abraham."
    },
    {
      "id": 163,
      "start": 1037.260009765625,
      "end": 1038.1000061035156,
      "text": " What is he saying?"
    },
    {
      "id": 164,
      "start": 1038.1000061035156,
      "end": 1041.3400268554688,
      "text": " His lineage isn't through that line, right?"
    },
    {
      "id": 165,
      "start": 1041.3400268554688,
      "end": 1043.3400268554688,
      "text": " He's not of the Levitical priesthood."
    },
    {
      "id": 166,
      "start": 1043.3400268554688,
      "end": 1044.9800109863281,
      "text": " He's not of the Aaronic priesthood."
    },
    {
      "id": 167,
      "start": 1044.9800109863281,
      "end": 1048.4600219726562,
      "text": " This is a different priesthood altogether,"
    },
    {
      "id": 168,
      "start": 1048.4600219726562,
      "end": 1051.6600036621094,
      "text": " and he says that he received tithes of Abraham,"
    },
    {
      "id": 169,
      "start": 1051.6600036621094,
      "end": 1055.9600219726562,
      "text": " but then notice, and blessed him that had the promises."
    },
    {
      "id": 170,
      "start": 1055.9600219726562,
      "end": 1058.260009765625,
      "text": " God had given promises to Abraham,"
    },
    {
      "id": 171,
      "start": 1058.260009765625,
      "end": 1062.5000305175781,
      "text": " and we find that Melchizedek blessed Abraham,"
    },
    {
      "id": 172,
      "start": 1062.5000305175781,
      "end": 1064.02001953125,
      "text": " and it says in verse number seven,"
    },
    {
      "id": 173,
      "start": 1064.02001953125,
      "end": 1066.1400146484375,
      "text": " without all contradiction,"
    },
    {
      "id": 174,
      "start": 1066.1400146484375,
      "end": 1070.1800231933594,
      "text": " the less is blessed of the better."
    },
    {
      "id": 175,
      "start": 1070.1800231933594,
      "end": 1071.2200317382812,
      "text": " What is he saying?"
    },
    {
      "id": 176,
      "start": 1071.2200317382812,
      "end": 1073.9000244140625,
      "text": " Well, Melchizedek actually is greater than Abraham."
    },
    {
      "id": 177,
      "start": 1074.780029296875,
      "end": 1077.780029296875,
      "text": " Now that's kind of a mind-blowing thought"
    },
    {
      "id": 178,
      "start": 1077.780029296875,
      "end": 1079.4200134277344,
      "text": " for the Jewish people."
    },
    {
      "id": 179,
      "start": 1080.4000244140625,
      "end": 1083.1800231933594,
      "text": " And we find that as he's applying this truth,"
    },
    {
      "id": 180,
      "start": 1083.1800231933594,
      "end": 1087.0600280761719,
      "text": " he's dealing with the description here of Melchizedek,"
    },
    {
      "id": 181,
      "start": 1087.0600280761719,
      "end": 1089.1800231933594,
      "text": " and then, if you're taking notes, number two,"
    },
    {
      "id": 182,
      "start": 1089.1800231933594,
      "end": 1091.260009765625,
      "text": " he's gonna deal with the insufficiency"
    },
    {
      "id": 183,
      "start": 1091.260009765625,
      "end": 1093.1800231933594,
      "text": " of the Levitical priesthood."
    },
    {
      "id": 184,
      "start": 1093.1800231933594,
      "end": 1096.9800109863281,
      "text": " So he presents the description of Melchizedek."
    },
    {
      "id": 185,
      "start": 1096.9800109863281,
      "end": 1098.3400268554688,
      "text": " He presents this priesthood."
    },
    {
      "id": 186,
      "start": 1098.3400268554688,
      "end": 1100.8200073242188,
      "text": " Remember, he's used the phraseology"
    },
    {
      "id": 187,
      "start": 1100.8200073242188,
      "end": 1102.7400207519531,
      "text": " beginning in chapter number five."
    },
    {
      "id": 188,
      "start": 1102.7400207519531,
      "end": 1106.8200073242188,
      "text": " He gives, he referenced back again to this truth,"
    },
    {
      "id": 189,
      "start": 1106.8200073242188,
      "end": 1110.4200134277344,
      "text": " this prophecy of the order of Melchizedek,"
    },
    {
      "id": 190,
      "start": 1110.4200134277344,
      "end": 1112.260009765625,
      "text": " the order of Melchizedek."
    },
    {
      "id": 191,
      "start": 1112.260009765625,
      "end": 1114.1199951171875,
      "text": " So he gives the description."
    },
    {
      "id": 192,
      "start": 1114.1199951171875,
      "end": 1116.7200317382812,
      "text": " Now, he provides this truth,"
    },
    {
      "id": 193,
      "start": 1116.7200317382812,
      "end": 1119.4000244140625,
      "text": " the insufficiency of the Levitical priesthood."
    },
    {
      "id": 194,
      "start": 1119.4000244140625,
      "end": 1122.4000244140625,
      "text": " Now, we understand that the Old Testament"
    },
    {
      "id": 195,
      "start": 1122.4000244140625,
      "end": 1124.7999877929688,
      "text": " is full of typologies."
    },
    {
      "id": 196,
      "start": 1124.7999877929688,
      "end": 1127.4000244140625,
      "text": " And as we would think about Old Testament types,"
    },
    {
      "id": 197,
      "start": 1127.4000244140625,
      "end": 1130.6799926757812,
      "text": " we understand that they represent something"
    },
    {
      "id": 198,
      "start": 1130.6799926757812,
      "end": 1134.0800170898438,
      "text": " that is far greater that will one day come."
    },
    {
      "id": 199,
      "start": 1134.0800170898438,
      "end": 1135.6400146484375,
      "text": " Now, on this side of history,"
    },
    {
      "id": 200,
      "start": 1135.6400146484375,
      "end": 1137.6799926757812,
      "text": " we know that Jesus has already come."
    },
    {
      "id": 201,
      "start": 1137.6799926757812,
      "end": 1139.8400268554688,
      "text": " And so we can look at the type"
    },
    {
      "id": 202,
      "start": 1139.8400268554688,
      "end": 1141.280029296875,
      "text": " and we can see the fulfillment,"
    },
    {
      "id": 203,
      "start": 1141.280029296875,
      "end": 1143.3200073242188,
      "text": " we can preach it from this perspective,"
    },
    {
      "id": 204,
      "start": 1143.3200073242188,
      "end": 1145.739990234375,
      "text": " and no doubt that's exactly what's happening"
    },
    {
      "id": 205,
      "start": 1145.739990234375,
      "end": 1149.0,
      "text": " as the writer of Hebrews is trying to present"
    },
    {
      "id": 206,
      "start": 1149.0,
      "end": 1151.760009765625,
      "text": " these Jewish believers with the understanding"
    },
    {
      "id": 207,
      "start": 1151.760009765625,
      "end": 1155.8800048828125,
      "text": " that Jesus is the fulfillment of this Old Testament type,"
    },
    {
      "id": 208,
      "start": 1155.8800048828125,
      "end": 1159.7200317382812,
      "text": " of this prophecy, this messianic psalm that we read,"
    },
    {
      "id": 209,
      "start": 1159.7200317382812,
      "end": 1162.4800415039062,
      "text": " that we know, that we've put in the category"
    },
    {
      "id": 210,
      "start": 1162.4800415039062,
      "end": 1167.0800170898438,
      "text": " of being messianic, Psalm 110, that's Jesus Christ."
    },
    {
      "id": 211,
      "start": 1167.0800170898438,
      "end": 1170.3600463867188,
      "text": " He is the one after the order of Melchizedek."
    },
    {
      "id": 212,
      "start": 1170.3600463867188,
      "end": 1172.7999877929688,
      "text": " And so he provides this insufficiency."
    },
    {
      "id": 213,
      "start": 1172.7999877929688,
      "end": 1174.8800048828125,
      "text": " Notice in verse number 11, he says,"
    },
    {
      "id": 214,
      "start": 1174.8800048828125,
      "end": 1179.1600341796875,
      "text": " if therefore perfection were by the Levitical priesthood,"
    },
    {
      "id": 215,
      "start": 1179.1600341796875,
      "end": 1182.0800170898438,
      "text": " for under it the people received the law."
    },
    {
      "id": 216,
      "start": 1182.0800170898438,
      "end": 1185.0,
      "text": " Notice what he asks, what further need was there"
    },
    {
      "id": 217,
      "start": 1185.0,
      "end": 1186.5599975585938,
      "text": " that another priest should rise"
    },
    {
      "id": 218,
      "start": 1186.5599975585938,
      "end": 1188.6400146484375,
      "text": " after the order of Melchizedek"
    },
    {
      "id": 219,
      "start": 1188.6400146484375,
      "end": 1191.760009765625,
      "text": " and not be called after the order of Aaron?"
    },
    {
      "id": 220,
      "start": 1191.760009765625,
      "end": 1193.9200439453125,
      "text": " He's asking a question to provoke thought."
    },
    {
      "id": 221,
      "start": 1195.280029296875,
      "end": 1197.3200073242188,
      "text": " Many times we do that."
    },
    {
      "id": 222,
      "start": 1197.3200073242188,
      "end": 1200.3600463867188,
      "text": " We find as we read various..."
    },
    {
      "id": 0,
      "start": 1200.3600463867188,
      "end": 1204.6600465774536,
      "text": " whether it's the Bible or some other type of literature, as we have discussions"
    },
    {
      "id": 1,
      "start": 1204.6600465774536,
      "end": 1209.6600465774536,
      "text": " with individuals, there are times that we'll ask a question to provoke thought."
    },
    {
      "id": 2,
      "start": 1209.6600465774536,
      "end": 1215.220046043396,
      "text": " And here he's saying this, if therefore perfection were by the Levitical"
    },
    {
      "id": 3,
      "start": 1215.220046043396,
      "end": 1218.2400455474854,
      "text": " priesthood, we know the Levitical priesthood, we're familiar with the"
    },
    {
      "id": 4,
      "start": 1218.2400455474854,
      "end": 1222.0200462341309,
      "text": " Levitical priesthood, the Aaronic priesthood as we've often referred to it"
    },
    {
      "id": 5,
      "start": 1222.0200462341309,
      "end": 1227.100046157837,
      "text": " as, he says then if that brought perfection, why is there this Messianic"
    },
    {
      "id": 6,
      "start": 1227.100046157837,
      "end": 1233.2600479125977,
      "text": " prophecy about the order of Melchizedek? What would be the need, what further need"
    },
    {
      "id": 7,
      "start": 1233.2600479125977,
      "end": 1237.2600479125977,
      "text": " was there for another priest that should rise after the order of Melchizedek?"
    },
    {
      "id": 8,
      "start": 1237.2600479125977,
      "end": 1241.5000457763672,
      "text": " Well the answer is obvious, if the Levitical priesthood, if the Aaronic"
    },
    {
      "id": 9,
      "start": 1241.5000457763672,
      "end": 1246.620044708252,
      "text": " priesthood could bring perfection, there would be no need for another priesthood,"
    },
    {
      "id": 10,
      "start": 1246.620044708252,
      "end": 1255.3000450134277,
      "text": " another order. But it couldn't bring perfection, it was a type. And therefore"
    },
    {
      "id": 11,
      "start": 1255.3000450134277,
      "end": 1261.900047302246,
      "text": " this Messianic prophecy is given with regard to the order of Melchizedek, that"
    },
    {
      "id": 12,
      "start": 1261.900047302246,
      "end": 1267.780044555664,
      "text": " Jesus would be a priest forever after the order of Melchizedek, and we find"
    },
    {
      "id": 13,
      "start": 1267.780044555664,
      "end": 1273.8200454711914,
      "text": " that he begins there in verse number 11 by dealing with the insufficiency of the"
    },
    {
      "id": 14,
      "start": 1273.8200454711914,
      "end": 1278.5800476074219,
      "text": " Levitical priesthood and proving that another priesthood, an order of"
    },
    {
      "id": 15,
      "start": 1278.5800476074219,
      "end": 1283.4600448608398,
      "text": " priesthood, was absolutely essential, and it was after the order of Melchizedek."
    },
    {
      "id": 16,
      "start": 1283.4600448608398,
      "end": 1288.5000457763672,
      "text": " Notice, the priesthood required the law, we see in verse number 11, it says for"
    },
    {
      "id": 17,
      "start": 1288.5000457763672,
      "end": 1293.2600479125977,
      "text": " under it the people received the law, and notice something that the Bible gives us"
    },
    {
      "id": 18,
      "start": 1293.2600479125977,
      "end": 1298.180046081543,
      "text": " here about the law in verse number 19, excuse me, the Bible tells us this,"
    },
    {
      "id": 19,
      "start": 1298.180046081543,
      "end": 1304.9800491333008,
      "text": " for the law made nothing perfect, amen? It says, but the bringing in of a better"
    },
    {
      "id": 20,
      "start": 1304.9800491333008,
      "end": 1312.5000457763672,
      "text": " hope did, by the which we draw nigh unto God. So he deals with the fact that just"
    },
    {
      "id": 21,
      "start": 1312.5000457763672,
      "end": 1318.7400436401367,
      "text": " as the priesthood could not bring perfection, neither could the law. Hold"
    },
    {
      "id": 22,
      "start": 1318.7400436401367,
      "end": 1322.4200439453125,
      "text": " your place here and go back, if you will, to the book of Galatians, and then we're"
    },
    {
      "id": 23,
      "start": 1322.4200439453125,
      "end": 1324.8600463867188,
      "text": " gonna deal with the passage of the book of Romans, but I want you to look at"
    },
    {
      "id": 24,
      "start": 1324.8600463867188,
      "end": 1329.3800506591797,
      "text": " Galatians first, and notice what is being told to us here in Galatians chapter"
    },
    {
      "id": 25,
      "start": 1329.3800506591797,
      "end": 1334.1000518798828,
      "text": " number 3. Again, we'll be back to Hebrews 7 here in just a moment, but look here in"
    },
    {
      "id": 26,
      "start": 1334.1000518798828,
      "end": 1339.6200408935547,
      "text": " Galatians chapter number 3. Last week we took a lengthy period of time to look at"
    },
    {
      "id": 27,
      "start": 1339.6200408935547,
      "end": 1343.9800415039062,
      "text": " verses 6 down through verse number 18, and to deal with that promise that was"
    },
    {
      "id": 28,
      "start": 1343.9800415039062,
      "end": 1348.8600463867188,
      "text": " given to Abraham, the promise was of a seed. Remember, we mentioned that last"
    },
    {
      "id": 29,
      "start": 1348.8600463867188,
      "end": 1354.9000396728516,
      "text": " week, and the fulfillment of that, which is Christ, and how that we are the"
    },
    {
      "id": 30,
      "start": 1354.9000396728516,
      "end": 1361.9000396728516,
      "text": " heirs of promise, that we, in fact, would be called the children of Abraham, how? By"
    },
    {
      "id": 31,
      "start": 1361.9000396728516,
      "end": 1367.2200469970703,
      "text": " faith. What a blessing. But as the passage of Scripture continues, and it's so"
    },
    {
      "id": 32,
      "start": 1367.2200469970703,
      "end": 1373.2600402832031,
      "text": " interesting to see how Galatians 3, so similar to what we read at the end of"
    },
    {
      "id": 33,
      "start": 1373.2600402832031,
      "end": 1377.4200439453125,
      "text": " Hebrews 6 and into Hebrews chapter number 7, such great parallel passages of"
    },
    {
      "id": 34,
      "start": 1377.4200439453125,
      "end": 1381.300048828125,
      "text": " Scripture, but in verse number 21 of Galatians 3, the Bible says,"
    },
    {
      "id": 35,
      "start": 1381.300048828125,
      "end": 1387.1800537109375,
      "text": " is the law then against the promises of God? God forbid! For if there had been a"
    },
    {
      "id": 36,
      "start": 1387.1800537109375,
      "end": 1392.4600524902344,
      "text": " law given which could have given life, verily righteousness should have been by"
    },
    {
      "id": 37,
      "start": 1392.4600524902344,
      "end": 1396.9800415039062,
      "text": " the law. That makes sense. But he says this in verse 22, but the Scripture hath"
    },
    {
      "id": 38,
      "start": 1396.9800415039062,
      "end": 1401.9400482177734,
      "text": " concluded, all under sin, that the promise by faith of Jesus Christ might"
    },
    {
      "id": 39,
      "start": 1401.9400482177734,
      "end": 1409.1400451660156,
      "text": " be given to them that believe. Verse 23, but before faith came, we were kept under"
    },
    {
      "id": 40,
      "start": 1409.1400451660156,
      "end": 1414.5000457763672,
      "text": " the law, shut up unto the faith, which should afterwards be revealed. Wherefore"
    },
    {
      "id": 41,
      "start": 1414.5000457763672,
      "end": 1421.060043334961,
      "text": " the law was our schoolmaster to bring us unto Christ, that we might be justified"
    },
    {
      "id": 42,
      "start": 1421.1800537109375,
      "end": 1430.1000518798828,
      "text": " by faith. The law could not do what Christ did. The law condemns. The law"
    },
    {
      "id": 43,
      "start": 1430.1000518798828,
      "end": 1437.060043334961,
      "text": " doesn't give life. The law says, guilty! Amen? Thou shalt not, thou shalt not, thou"
    },
    {
      "id": 44,
      "start": 1437.060043334961,
      "end": 1443.780044555664,
      "text": " shalt not, right? I'm guilty. And James says if we offend in one, we're guilty of"
    },
    {
      "id": 45,
      "start": 1443.780044555664,
      "end": 1448.3400421142578,
      "text": " all. And the reality here is when we think about this idea of a schoolmaster, many"
    },
    {
      "id": 46,
      "start": 1448.3800506591797,
      "end": 1451.820053100586,
      "text": " people have the idea that this is a teacher. It really isn't a teacher. A"
    },
    {
      "id": 47,
      "start": 1451.820053100586,
      "end": 1457.0200500488281,
      "text": " schoolmaster was one who was a guardian at this particular time in history. It"
    },
    {
      "id": 48,
      "start": 1457.0200500488281,
      "end": 1461.6600341796875,
      "text": " would be used this way, a guardian or a guide who would accompany privileged"
    },
    {
      "id": 49,
      "start": 1461.6600341796875,
      "end": 1466.9000549316406,
      "text": " boys to be instructed. Now here's the interesting thing. They themselves could"
    },
    {
      "id": 50,
      "start": 1466.9000549316406,
      "end": 1473.5400390625,
      "text": " not give the instruction, but they would take them, those privileged boys, to the"
    },
    {
      "id": 51,
      "start": 1473.7000427246094,
      "end": 1480.3400573730469,
      "text": " one who could give the instruction. So therefore, we look at this usage of what"
    },
    {
      "id": 52,
      "start": 1480.3400573730469,
      "end": 1484.5800476074219,
      "text": " Paul says, the believers in Galatia here, the region of Galatia, wherefore the law"
    },
    {
      "id": 53,
      "start": 1484.5800476074219,
      "end": 1490.0200500488281,
      "text": " was our schoolmaster. The law cannot give life, but here's what it does. It leads to"
    },
    {
      "id": 54,
      "start": 1490.0200500488281,
      "end": 1498.4200439453125,
      "text": " the one who does, Jesus Christ. And as we look here in Galatians and couple that"
    },
    {
      "id": 55,
      "start": 1498.4200439453125,
      "end": 1502.5800476074219,
      "text": " with what we've seen there already in Hebrews 7, the insufficiency of the"
    },
    {
      "id": 56,
      "start": 1502.7400512695312,
      "end": 1507.3800354003906,
      "text": " Levitical priesthood, not only could the priesthood not bring perfection, but nor"
    },
    {
      "id": 57,
      "start": 1507.3800354003906,
      "end": 1511.1400451660156,
      "text": " could the law. Notice what Paul says in Romans. Turn over, if you will, to Romans"
    },
    {
      "id": 58,
      "start": 1511.1400451660156,
      "end": 1516.1800537109375,
      "text": " chapter number 10. In Romans chapter number 10, often we refer to, in this"
    },
    {
      "id": 59,
      "start": 1516.1800537109375,
      "end": 1520.3400573730469,
      "text": " passage, several verses near the middle and end of the passage, but I want to"
    },
    {
      "id": 60,
      "start": 1520.3400573730469,
      "end": 1524.0200500488281,
      "text": " draw your attention to the beginning of the tenth chapter of the book of Romans,"
    },
    {
      "id": 61,
      "start": 1524.0200500488281,
      "end": 1529.2600402832031,
      "text": " and look at what the Apostle Paul says here, and something that is so important"
    },
    {
      "id": 62,
      "start": 1529.2600402832031,
      "end": 1534.300048828125,
      "text": " for these Jewish believers to understand, as the book of Hebrews is"
    },
    {
      "id": 63,
      "start": 1534.300048828125,
      "end": 1538.1400451660156,
      "text": " showing the insufficiency of the Levitical priesthood. Notice in"
    },
    {
      "id": 64,
      "start": 1538.1400451660156,
      "end": 1543.5000610351562,
      "text": " verse number one of Romans 10. Brethren, my heart's desire and prayer to God for"
    },
    {
      "id": 65,
      "start": 1543.5000610351562,
      "end": 1549.4200439453125,
      "text": " Israel is that they might be saved. You see the heart of the Apostle Paul. He"
    },
    {
      "id": 66,
      "start": 1549.4200439453125,
      "end": 1554.3800354003906,
      "text": " says, for I bear them record that they have a zeal of God, but not according to"
    },
    {
      "id": 67,
      "start": 1554.3800354003906,
      "end": 1560.4600524902344,
      "text": " knowledge. Look at verses 3 and 4. The Bible says this, for they, being ignorant"
    },
    {
      "id": 68,
      "start": 1560.4600524902344,
      "end": 1565.9800415039062,
      "text": " of God's righteousness and going about to establish their own righteousness,"
    },
    {
      "id": 69,
      "start": 1565.9800415039062,
      "end": 1572.3800354003906,
      "text": " have not submitted themselves unto the righteousness of God. For Christ is the"
    },
    {
      "id": 70,
      "start": 1572.3800354003906,
      "end": 1578.7800598144531,
      "text": " end of the law for righteousness to every one that believeth. And as we"
    },
    {
      "id": 71,
      "start": 1578.7800598144531,
      "end": 1583.5000610351562,
      "text": " understand, he says, listen, these, my brethren, he's speaking specifically"
    },
    {
      "id": 72,
      "start": 1583.5000610351562,
      "end": 1587.8600463867188,
      "text": " about these Jewish people. He says, my heart's desire for them and my prayer to"
    },
    {
      "id": 73,
      "start": 1587.8600463867188,
      "end": 1592.06005859375,
      "text": " God for them is that they would be saved. But here's the problem. They're ignorant"
    },
    {
      "id": 74,
      "start": 1592.06005859375,
      "end": 1596.7400512695312,
      "text": " of God's righteousness. There's been this blindness. He deals with that, and here"
    },
    {
      "id": 75,
      "start": 1596.7400512695312,
      "end": 1600.8600463867188,
      "text": " in the book of Romans, the blindness that has happened unto Israel. In fact, if"
    },
    {
      "id": 76,
      "start": 1600.8600463867188,
      "end": 1605.1000366210938,
      "text": " you were to read the book of John and you look at the great miracle when Jesus"
    },
    {
      "id": 77,
      "start": 1605.1000366210938,
      "end": 1609.5000610351562,
      "text": " healed that man that was born blind, and he stood before the religious leaders,"
    },
    {
      "id": 78,
      "start": 1609.5000610351562,
      "end": 1613.1400451660156,
      "text": " and they were questioning him, and they were just doubtful, and so on and so"
    },
    {
      "id": 79,
      "start": 1613.1800537109375,
      "end": 1617.9000549316406,
      "text": " forth, and he finally, after giving answer after answer, he says, I've told you"
    },
    {
      "id": 80,
      "start": 1617.9000549316406,
      "end": 1622.4200439453125,
      "text": " before. All I know is I was blind, and now I can see. If I tell you again, are you"
    },
    {
      "id": 81,
      "start": 1622.4200439453125,
      "end": 1626.06005859375,
      "text": " gonna be his disciples also? Well, that didn't make him very happy. That just"
    },
    {
      "id": 82,
      "start": 1626.06005859375,
      "end": 1631.5000610351562,
      "text": " angered them. And then we find that at the end of the passage, those religious"
    },
    {
      "id": 83,
      "start": 1631.5000610351562,
      "end": 1636.6600341796875,
      "text": " leaders come and say this, are we blind also? They weren't blind physically, but"
    },
    {
      "id": 84,
      "start": 1636.6600341796875,
      "end": 1641.5400390625,
      "text": " they were blind spiritually. And as we think about this ignorance that Paul is"
    },
    {
      "id": 85,
      "start": 1641.5400390625,
      "end": 1645.5400390625,
      "text": " referring to here in Romans 10 and verse number 3, they're ignorant of God's"
    },
    {
      "id": 86,
      "start": 1645.5400390625,
      "end": 1650.3800354003906,
      "text": " righteousness. They've been blinded. We find that they're going about to"
    },
    {
      "id": 87,
      "start": 1650.3800354003906,
      "end": 1655.9400329589844,
      "text": " establish their own righteousness. Listen, they have to submit to the truth of"
    },
    {
      "id": 88,
      "start": 1655.9400329589844,
      "end": 1662.1400451660156,
      "text": " God's Word that Christ came to fulfill, and that he is the end of the law, and we"
    },
    {
      "id": 89,
      "start": 1662.1400451660156,
      "end": 1667.1400451660156,
      "text": " find that through him comes grace and truth. Back to Hebrews chapter number 7,"
    },
    {
      "id": 90,
      "start": 1667.1400451660156,
      "end": 1672.3600463867188,
      "text": " we find here that he's dealing with the insufficiency. Notice, let's go back to"
    },
    {
      "id": 91,
      "start": 1672.3600463867188,
      "end": 1676.6600341796875,
      "text": " verse number 12 of Hebrews 7. For the priesthood being changed, there is made"
    },
    {
      "id": 92,
      "start": 1676.6600341796875,
      "end": 1680.9000549316406,
      "text": " of necessity a change also of the law. So he's saying, listen, the priesthood is"
    },
    {
      "id": 93,
      "start": 1680.9000549316406,
      "end": 1684.4200439453125,
      "text": " gonna change. It's not after the order of Levitical priesthood or Aaronic"
    },
    {
      "id": 94,
      "start": 1684.4200439453125,
      "end": 1687.4200439453125,
      "text": " priesthood, it's now gonna be after the order of Melchizedek. He speaks about"
    },
    {
      "id": 95,
      "start": 1687.4200439453125,
      "end": 1691.9800415039062,
      "text": " this change. Notice in verse number 13, for he of whom these things are spoken"
    },
    {
      "id": 96,
      "start": 1691.9800415039062,
      "end": 1698.6200561523438,
      "text": " pertaineth to another tribe of which no man gave attendance at the altar. Now"
    },
    {
      "id": 97,
      "start": 1698.6200561523438,
      "end": 1702.5400390625,
      "text": " this is awesome, because here's what's happening. He's dealing with"
    },
    {
      "id": 98,
      "start": 1702.5400390625,
      "end": 1707.7400512695312,
      "text": " the Lord Jesus Christ as being the fulfillment of this order of"
    },
    {
      "id": 99,
      "start": 1707.7400512695312,
      "end": 1712.820068359375,
      "text": " Melchizedek, this greater priesthood, and he says, listen, the one by which we're"
    },
    {
      "id": 100,
      "start": 1712.820068359375,
      "end": 1717.5800170898438,
      "text": " speaking of, he comes from another tribe. He doesn't even come from the tribe of Levi."
    },
    {
      "id": 101,
      "start": 1717.5800170898438,
      "end": 1722.5800170898438,
      "text": " From our perspective, speaking to the Jews that are there, these Jewish"
    },
    {
      "id": 102,
      "start": 1722.5800170898438,
      "end": 1726.780029296875,
      "text": " believers, he's not even qualified to be a priest. Why? Because he's not from the"
    },
    {
      "id": 103,
      "start": 1726.780029296875,
      "end": 1734.4600219726562,
      "text": " right tribe, right? He's of a higher order. Notice verse number 14, for it is evident"
    },
    {
      "id": 104,
      "start": 1734.4600219726562,
      "end": 1741.4600219726562,
      "text": " that our Lord sprang out of Judah, of which tribe Moses spake nothing"
    },
    {
      "id": 105,
      "start": 1741.5000610351562,
      "end": 1746.8600463867188,
      "text": " concerning priesthood. See, if you were the tribe of Judah, you couldn't be a"
    },
    {
      "id": 106,
      "start": 1746.8600463867188,
      "end": 1752.02001953125,
      "text": " priest. See, in the Old Testament, outside of Melchizedek, he's a king and a"
    },
    {
      "id": 107,
      "start": 1752.02001953125,
      "end": 1758.06005859375,
      "text": " priest, right? Outside of Melchizedek, you were either a king or you were a priest,"
    },
    {
      "id": 108,
      "start": 1758.06005859375,
      "end": 1764.7000732421875,
      "text": " but you weren't both. You guys remember Uzziah? He is king, right? You"
    },
    {
      "id": 109,
      "start": 1764.7000732421875,
      "end": 1768.8600463867188,
      "text": " remember the famous passage of Scripture that we deal with with Uzziah in the year"
    },
    {
      "id": 110,
      "start": 1768.8600463867188,
      "end": 1772.1400756835938,
      "text": " that King Uzziah died, right? Isaiah saw the Lord high, holy, lifted up, so on and"
    },
    {
      "id": 111,
      "start": 1772.1400756835938,
      "end": 1776.5000610351562,
      "text": " so forth. Isaiah chapter number 6. Well, Uzziah, he was a king, and he served as a"
    },
    {
      "id": 112,
      "start": 1776.5000610351562,
      "end": 1780.1400756835938,
      "text": " king for a lengthy period of time. The Lord helped him, and man, God blessed, and"
    },
    {
      "id": 113,
      "start": 1780.1400756835938,
      "end": 1785.5400390625,
      "text": " things were going well, but then he got a little prideful. And guess what happens?"
    },
    {
      "id": 114,
      "start": 1785.5400390625,
      "end": 1791.300048828125,
      "text": " Old Uzziah decides that he can go into the holy place and he can offer incense."
    },
    {
      "id": 115,
      "start": 1791.300048828125,
      "end": 1797.9400634765625,
      "text": " There were some priests that came in to try to get him out, to withstand him."
    },
    {
      "id": 116,
      "start": 1797.9400634765625,
      "end": 1801.1800537109375,
      "text": " Thank God for those men."
    },
    {
      "id": 0,
      "start": 1801.1800537109375,
      "end": 1807.2200536727905,
      "text": " See, Uzziah, you're the king, but you can't be a priest, because you're not of the right"
    },
    {
      "id": 1,
      "start": 1807.2200536727905,
      "end": 1808.700053691864,
      "text": " tribe."
    },
    {
      "id": 2,
      "start": 1808.700053691864,
      "end": 1809.7000541687012,
      "text": " What happened to Uzziah?"
    },
    {
      "id": 3,
      "start": 1809.7000541687012,
      "end": 1810.7000541687012,
      "text": " He became a leper."
    },
    {
      "id": 4,
      "start": 1810.7000541687012,
      "end": 1813.7000541687012,
      "text": " He became a leper."
    },
    {
      "id": 5,
      "start": 1813.7000541687012,
      "end": 1817.380054473877,
      "text": " See, Jesus Christ is of the tribe of Judah."
    },
    {
      "id": 6,
      "start": 1817.380054473877,
      "end": 1821.7000541687012,
      "text": " From their perspective, humanly speaking, he could not be a priest."
    },
    {
      "id": 7,
      "start": 1821.7000541687012,
      "end": 1823.1800537109375,
      "text": " And so what is the writer doing?"
    },
    {
      "id": 8,
      "start": 1823.1800537109375,
      "end": 1829.1800537109375,
      "text": " He's proving he's from a higher order of priesthood, he's after the order of Melchizedek."
    },
    {
      "id": 9,
      "start": 1829.1800537109375,
      "end": 1830.2200546264648,
      "text": " He's of the tribe of Judah."
    },
    {
      "id": 10,
      "start": 1830.2200546264648,
      "end": 1835.0600547790527,
      "text": " We know that, but that does not disqualify him from being a priest, for he's after the"
    },
    {
      "id": 11,
      "start": 1835.0600547790527,
      "end": 1836.6600532531738,
      "text": " order of Melchizedek."
    },
    {
      "id": 12,
      "start": 1836.6600532531738,
      "end": 1841.9400520324707,
      "text": " Notice verse number 15, and it is yet far more evident, for that after the similitude"
    },
    {
      "id": 13,
      "start": 1841.9400520324707,
      "end": 1849.2600555419922,
      "text": " of Melchizedek, notice, there ariseth another priest, who is made not after the law of a"
    },
    {
      "id": 14,
      "start": 1849.2600555419922,
      "end": 1853.1800537109375,
      "text": " carnal commandment, but after the power of an endless life."
    },
    {
      "id": 15,
      "start": 1853.1800537109375,
      "end": 1861.820053100586,
      "text": " Verse 17, for he testifieth, thou art a priest forever after the order of Melchizedek."
    },
    {
      "id": 16,
      "start": 1861.820053100586,
      "end": 1866.0200500488281,
      "text": " I'm so thankful for the book of Hebrews, because I'll be honest with you, if all we had were"
    },
    {
      "id": 17,
      "start": 1866.0200500488281,
      "end": 1871.1400527954102,
      "text": " the couple of verses in Genesis 14 and the Messianic Psalm of Psalm 110, we'd be scratching"
    },
    {
      "id": 18,
      "start": 1871.1400527954102,
      "end": 1874.0600509643555,
      "text": " our heads trying to figure out what this means."
    },
    {
      "id": 19,
      "start": 1874.0600509643555,
      "end": 1878.8600540161133,
      "text": " But we find that here in Hebrews chapter number 17, it's like the peel is coming open and"
    },
    {
      "id": 20,
      "start": 1878.8600540161133,
      "end": 1884.820053100586,
      "text": " we're seeing this revealed to us, and we're seeing the beauty of God's Word and the fulfillment"
    },
    {
      "id": 21,
      "start": 1884.820053100586,
      "end": 1889.5800552368164,
      "text": " of this Messianic Psalm, this prophecy, and we find that it says in verse number 18, for"
    },
    {
      "id": 22,
      "start": 1889.5800552368164,
      "end": 1897.3000564575195,
      "text": " there is barely a disannulling of the commandment going before, for the weakness and unprofitableness"
    },
    {
      "id": 23,
      "start": 1897.3000564575195,
      "end": 1898.3000564575195,
      "text": " thereof."
    },
    {
      "id": 24,
      "start": 1898.3000564575195,
      "end": 1904.5000534057617,
      "text": " For the law made nothing perfect, but the bringing in of a better hope did, by the which"
    },
    {
      "id": 25,
      "start": 1904.5000534057617,
      "end": 1906.6200561523438,
      "text": " we draw nigh unto God."
    },
    {
      "id": 26,
      "start": 1906.6200561523438,
      "end": 1912.5000534057617,
      "text": " And inasmuch as not without an oath he was made priest, for those priests which were"
    },
    {
      "id": 27,
      "start": 1912.5000534057617,
      "end": 1914.5800552368164,
      "text": " made without an oath."
    },
    {
      "id": 28,
      "start": 1914.5800552368164,
      "end": 1920.4600524902344,
      "text": " But this, with an oath, by him that said unto him, the Lord swear and will not repent, thou"
    },
    {
      "id": 29,
      "start": 1920.4600524902344,
      "end": 1924.2600555419922,
      "text": " art a priest forever after the order of Melchizedek."
    },
    {
      "id": 30,
      "start": 1924.2600555419922,
      "end": 1925.7400512695312,
      "text": " How did you become a priest in the Old Testament?"
    },
    {
      "id": 31,
      "start": 1925.7400512695312,
      "end": 1926.7400512695312,
      "text": " Did you volunteer?"
    },
    {
      "id": 32,
      "start": 1926.7400512695312,
      "end": 1928.420051574707,
      "text": " Say, hey, I want to be a priest."
    },
    {
      "id": 33,
      "start": 1928.420051574707,
      "end": 1933.6600494384766,
      "text": " No, you were born into the Levitical line, I mean, it was your lineage."
    },
    {
      "id": 34,
      "start": 1933.820053100586,
      "end": 1939.4600524902344,
      "text": " There was no situation, no oath, like we find it says that they were made without an oath,"
    },
    {
      "id": 35,
      "start": 1939.4600524902344,
      "end": 1941.5800476074219,
      "text": " they were born into it."
    },
    {
      "id": 36,
      "start": 1941.5800476074219,
      "end": 1946.0200500488281,
      "text": " Remember that to Aaron, right, was given the tribe of Levi."
    },
    {
      "id": 37,
      "start": 1946.0200500488281,
      "end": 1949.7200469970703,
      "text": " If you're with me through the study of the book of Joshua, we'll get to it in another"
    },
    {
      "id": 38,
      "start": 1949.7200469970703,
      "end": 1954.1800537109375,
      "text": " couple of lessons, but we've already made reference to it in some of our previous lessons,"
    },
    {
      "id": 39,
      "start": 1954.1800537109375,
      "end": 1958.800048828125,
      "text": " the way in which the tribe of Levi, they didn't receive an inheritance."
    },
    {
      "id": 40,
      "start": 1958.800048828125,
      "end": 1963.56005859375,
      "text": " And they did not have a possessed land, there were cities of the Levites that are detailed"
    },
    {
      "id": 41,
      "start": 1963.56005859375,
      "end": 1969.1200561523438,
      "text": " for us in Joshua 21, but they did not receive a particular lot."
    },
    {
      "id": 42,
      "start": 1969.1200561523438,
      "end": 1973.4800567626953,
      "text": " And we find here that they had been given to Aaron."
    },
    {
      "id": 43,
      "start": 1973.4800567626953,
      "end": 1981.2400512695312,
      "text": " It says here, verse 22, by so much was Jesus made a surety of a better testament."
    },
    {
      "id": 44,
      "start": 1981.2400512695312,
      "end": 1982.2400512695312,
      "text": " It leads us here."
    },
    {
      "id": 45,
      "start": 1982.2400512695312,
      "end": 1985.2400512695312,
      "text": " Let me mention one more thing about the insufficiency of the Levitical priesthood and then we'll"
    },
    {
      "id": 46,
      "start": 1985.2400512695312,
      "end": 1986.2400512695312,
      "text": " get into our final point."
    },
    {
      "id": 47,
      "start": 1986.2400512695312,
      "end": 1989.2000579833984,
      "text": " Look at verse number 27."
    },
    {
      "id": 48,
      "start": 1989.2000579833984,
      "end": 1992.56005859375,
      "text": " The Bible says this, well, let me look at verse 23, sorry, two more things, I'm ready"
    },
    {
      "id": 49,
      "start": 1992.56005859375,
      "end": 1993.9600524902344,
      "text": " to get to the last point."
    },
    {
      "id": 50,
      "start": 1993.9600524902344,
      "end": 1995.0200500488281,
      "text": " It's exciting."
    },
    {
      "id": 51,
      "start": 1995.0200500488281,
      "end": 1999.0800476074219,
      "text": " Verse 23, and they truly were many priests because they were not suffered to continue"
    },
    {
      "id": 52,
      "start": 1999.0800476074219,
      "end": 2001.6400604248047,
      "text": " by reason of death."
    },
    {
      "id": 53,
      "start": 2001.6400604248047,
      "end": 2004.7600555419922,
      "text": " You know why the Old Testament priesthood, the Levitical priesthood was insufficient?"
    },
    {
      "id": 54,
      "start": 2004.7600555419922,
      "end": 2007.0000610351562,
      "text": " Because they died."
    },
    {
      "id": 55,
      "start": 2007.0000610351562,
      "end": 2008.0000610351562,
      "text": " They died."
    },
    {
      "id": 56,
      "start": 2008.0000610351562,
      "end": 2009.320053100586,
      "text": " And then there was another one."
    },
    {
      "id": 57,
      "start": 2009.320053100586,
      "end": 2014.0000610351562,
      "text": " It says, and they truly were many priests, right, because they would die and then there'd"
    },
    {
      "id": 58,
      "start": 2014.0000610351562,
      "end": 2016.4400482177734,
      "text": " be another one and it was, that's how it worked, right?"
    },
    {
      "id": 59,
      "start": 2016.4400482177734,
      "end": 2020.800048828125,
      "text": " Verse 27, notice another reason that the Old Testament priesthood, the Levitical priesthood"
    },
    {
      "id": 60,
      "start": 2020.800048828125,
      "end": 2023.4000549316406,
      "text": " was not perfect, was insufficient."
    },
    {
      "id": 61,
      "start": 2023.4000549316406,
      "end": 2029.3600463867188,
      "text": " It says, who need it not daily as those high priests to offer up sacrifice, notice this,"
    },
    {
      "id": 62,
      "start": 2029.3600463867188,
      "end": 2032.7200469970703,
      "text": " first for his own sins."
    },
    {
      "id": 63,
      "start": 2032.7200469970703,
      "end": 2038.2800598144531,
      "text": " The high priest would go in on the Day of Atonement once a year to the Holy of Holies."
    },
    {
      "id": 64,
      "start": 2038.2800598144531,
      "end": 2042.56005859375,
      "text": " He had to go in first making an atonement for his own sin, then for the sin of the people."
    },
    {
      "id": 65,
      "start": 2042.56005859375,
      "end": 2045.2800598144531,
      "text": " Jesus Christ is sinless."
    },
    {
      "id": 66,
      "start": 2045.2800598144531,
      "end": 2046.5200500488281,
      "text": " So what was insufficient?"
    },
    {
      "id": 67,
      "start": 2046.5200500488281,
      "end": 2051.9600524902344,
      "text": " I've mentioned this many times that the, we finished up actually last Sunday morning"
    },
    {
      "id": 68,
      "start": 2051.9600524902344,
      "end": 2056.840057373047,
      "text": " dealing with the fact that our forerunner, Jesus Christ, that he went, he passed through"
    },
    {
      "id": 69,
      "start": 2056.840057373047,
      "end": 2060.6400451660156,
      "text": " the veil, that he's entered into heaven."
    },
    {
      "id": 70,
      "start": 2060.6400451660156,
      "end": 2065.1200561523438,
      "text": " And what a joy, what a blessing to understand the truth."
    },
    {
      "id": 71,
      "start": 2065.1200561523438,
      "end": 2071.8800659179688,
      "text": " If you go back to Hebrews chapter 4 and notice this declaration that is given in verse 14,"
    },
    {
      "id": 72,
      "start": 2071.8800659179688,
      "end": 2077.9200439453125,
      "text": " seeing then that we have a great high priest, notice this, that has passed into the heavens."
    },
    {
      "id": 73,
      "start": 2077.9200439453125,
      "end": 2084.0000610351562,
      "text": " Jesus, the Son of God, let us hold fast our profession."
    },
    {
      "id": 74,
      "start": 2084.0000610351562,
      "end": 2088.100067138672,
      "text": " We find in the passage of Scripture here in Hebrews chapter number 7, number 1, the description"
    },
    {
      "id": 75,
      "start": 2088.100067138672,
      "end": 2092.800048828125,
      "text": " of Melchizedek, number 2, the insufficiency of the Levitical priesthood, and then finally"
    },
    {
      "id": 76,
      "start": 2092.800048828125,
      "end": 2098.320068359375,
      "text": " notice the superiority of Jesus Christ."
    },
    {
      "id": 77,
      "start": 2098.320068359375,
      "end": 2102.100067138672,
      "text": " First we notice that he is eternal."
    },
    {
      "id": 78,
      "start": 2102.100067138672,
      "end": 2108.0000610351562,
      "text": " We find that the prophecy is mentioned, Psalm 110 in verse number 4, it's mentioned twice"
    },
    {
      "id": 79,
      "start": 2108.0000610351562,
      "end": 2112.1200561523438,
      "text": " in chapter number 5, it's given at the end of chapter number 6, it's mentioned twice"
    },
    {
      "id": 80,
      "start": 2112.1200561523438,
      "end": 2114.4800415039062,
      "text": " again here in chapter number 7."
    },
    {
      "id": 81,
      "start": 2114.4800415039062,
      "end": 2117.7200622558594,
      "text": " And what is that prophecy of Psalm 110 in verse number 4?"
    },
    {
      "id": 82,
      "start": 2117.7200622558594,
      "end": 2123.840057373047,
      "text": " We read it in verse 17 of chapter 7, and at the end of verse number 21, thou art a priest,"
    },
    {
      "id": 83,
      "start": 2123.840057373047,
      "end": 2130.2000427246094,
      "text": " what does it say, forever after the order of Melchizedek."
    },
    {
      "id": 84,
      "start": 2130.2000427246094,
      "end": 2136.4800415039062,
      "text": " We find that it said in verse number 16, the power of an endless life."
    },
    {
      "id": 85,
      "start": 2136.4800415039062,
      "end": 2144.320068359375,
      "text": " Notice with me in verse number 24, but this man, because he continueth ever."
    },
    {
      "id": 86,
      "start": 2144.320068359375,
      "end": 2148.3600463867188,
      "text": " It says this hath an unchangeable priesthood."
    },
    {
      "id": 87,
      "start": 2148.56005859375,
      "end": 2154.1200561523438,
      "text": " Tells us in verse number 25, wherefore he is able also to save them to the uttermost"
    },
    {
      "id": 88,
      "start": 2154.1200561523438,
      "end": 2160.4400634765625,
      "text": " that come unto God by him, seeing he ever liveth to make intercession for them."
    },
    {
      "id": 89,
      "start": 2160.4400634765625,
      "end": 2162.340057373047,
      "text": " He ever liveth."
    },
    {
      "id": 90,
      "start": 2162.340057373047,
      "end": 2167.760040283203,
      "text": " Verse 28, the last part of the verse says, who is consecrated forevermore."
    },
    {
      "id": 91,
      "start": 2167.760040283203,
      "end": 2170.4400634765625,
      "text": " You know, we serve a risen Savior."
    },
    {
      "id": 92,
      "start": 2170.4400634765625,
      "end": 2177.2400512695312,
      "text": " I mean, we have to understand, yes, the beauty, the wonder of Calvary and the price that was"
    },
    {
      "id": 93,
      "start": 2177.2400512695312,
      "end": 2181.600067138672,
      "text": " paid on the cross of Calvary for your sin and for my sin and for the sin of the world,"
    },
    {
      "id": 94,
      "start": 2181.600067138672,
      "end": 2187.2200622558594,
      "text": " and we understand that he was buried in that borrowed tomb, but we serve a risen Savior."
    },
    {
      "id": 95,
      "start": 2187.2200622558594,
      "end": 2192.4800415039062,
      "text": " We speak about it and we sing about it during the time in which we celebrate the resurrection"
    },
    {
      "id": 96,
      "start": 2192.4800415039062,
      "end": 2197.7400512695312,
      "text": " on Easter Sunday, if you will, and we mention many things about that, and we're very careful"
    },
    {
      "id": 97,
      "start": 2197.7400512695312,
      "end": 2201.840057373047,
      "text": " to understand that every Sunday is the Lord's day."
    },
    {
      "id": 98,
      "start": 2201.840057373047,
      "end": 2202.840057373047,
      "text": " Why?"
    },
    {
      "id": 99,
      "start": 2202.840057373047,
      "end": 2205.100067138672,
      "text": " Because we serve a risen Savior."
    },
    {
      "id": 100,
      "start": 2205.100067138672,
      "end": 2209.280059814453,
      "text": " The Apostle Paul made it abundantly clear in chapter number 15 of the book of 1 Corinthians"
    },
    {
      "id": 101,
      "start": 2209.280059814453,
      "end": 2214.6200561523438,
      "text": " that if he did not raise from the dead, then our faith is vain, our preaching is vain."
    },
    {
      "id": 102,
      "start": 2214.6200561523438,
      "end": 2219.7000427246094,
      "text": " I mean, it's just, it's hopeless, but we serve a risen Savior."
    },
    {
      "id": 103,
      "start": 2219.7000427246094,
      "end": 2221.1800537109375,
      "text": " Notice what the Bible says in Revelation."
    },
    {
      "id": 104,
      "start": 2221.1800537109375,
      "end": 2222.3800659179688,
      "text": " You don't need to turn there."
    },
    {
      "id": 105,
      "start": 2222.3800659179688,
      "end": 2226.580047607422,
      "text": " In chapter number one, in verse number 17, and when I saw him, I fell at his feet as"
    },
    {
      "id": 106,
      "start": 2226.580047607422,
      "end": 2231.1200561523438,
      "text": " dead and he laid his right hand upon me, saying unto me, fear not."
    },
    {
      "id": 107,
      "start": 2231.1200561523438,
      "end": 2233.1800537109375,
      "text": " I am the first and the last."
    },
    {
      "id": 108,
      "start": 2233.1800537109375,
      "end": 2241.9800415039062,
      "text": " I am he that liveth and was dead, and behold, I am alive forevermore, amen, and have the"
    },
    {
      "id": 109,
      "start": 2241.9800415039062,
      "end": 2244.340057373047,
      "text": " keys of hell and of death."
    },
    {
      "id": 110,
      "start": 2244.340057373047,
      "end": 2246.9800415039062,
      "text": " Man, we serve a risen Savior."
    },
    {
      "id": 111,
      "start": 2246.9800415039062,
      "end": 2251.820068359375,
      "text": " Every day of our lives, we must be mindful of the fact that he lives and he reigns and"
    },
    {
      "id": 112,
      "start": 2251.820068359375,
      "end": 2258.56005859375,
      "text": " he rules, and as we live this life, as we walk this journey, we're mindful of the fact"
    },
    {
      "id": 113,
      "start": 2258.56005859375,
      "end": 2264.760040283203,
      "text": " that we serve a risen Savior, that he ever liveth to make intercession for us."
    },
    {
      "id": 114,
      "start": 2264.760040283203,
      "end": 2267.6400451660156,
      "text": " We'll get to that in just a moment, but we understand his eternality."
    },
    {
      "id": 115,
      "start": 2267.6400451660156,
      "end": 2271.2000427246094,
      "text": " Notice his character in the text of Scripture here."
    },
    {
      "id": 116,
      "start": 2271.2000427246094,
      "end": 2276.7200622558594,
      "text": " We see his immutability mentioned as it speaks about he hath an unchangeable priesthood."
    },
    {
      "id": 117,
      "start": 2276.7200622558594,
      "end": 2281.2400512695312,
      "text": " We mentioned a little bit about his immutability at the end of chapter number six in our last"
    },
    {
      "id": 118,
      "start": 2281.2400512695312,
      "end": 2286.6600646972656,
      "text": " week study, and we understand as we speak about the character, the attributes of God,"
    },
    {
      "id": 119,
      "start": 2286.6600646972656,
      "end": 2291.820068359375,
      "text": " we often refer to his omnipotence and his omniscience and his omnipresence, and we should."
    },
    {
      "id": 120,
      "start": 2291.820068359375,
      "end": 2296.580047607422,
      "text": " He's holy and he's just and he's righteous, and what a blessing to understand how God"
    },
    {
      "id": 121,
      "start": 2296.580047607422,
      "end": 2300.4600524902344,
      "text": " has revealed himself to us in this precious book."
    },
    {
      "id": 122,
      "start": 2300.4600524902344,
      "end": 2301.520050048828,
      "text": " He's immutable."
    },
    {
      "id": 123,
      "start": 2301.520050048828,
      "end": 2302.7000427246094,
      "text": " He never changes."
    },
    {
      "id": 124,
      "start": 2302.7000427246094,
      "end": 2305.600067138672,
      "text": " He's the same yesterday and today and forever."
    },
    {
      "id": 125,
      "start": 2305.600067138672,
      "end": 2310.06005859375,
      "text": " We find that in just a little while, that the writer of Hebrews in chapter number 13"
    },
    {
      "id": 126,
      "start": 2310.06005859375,
      "end": 2312.7000427246094,
      "text": " is going to declare that very truth to us."
    },
    {
      "id": 127,
      "start": 2312.7000427246094,
      "end": 2317.4200439453125,
      "text": " In verse number eight of that passage, it says, Jesus Christ, the same yesterday and"
    },
    {
      "id": 128,
      "start": 2317.4200439453125,
      "end": 2320.0200805664062,
      "text": " today and forever."
    },
    {
      "id": 129,
      "start": 2320.0200805664062,
      "end": 2325.3400268554688,
      "text": " He said in Malachi, I am the Lord, I change not."
    },
    {
      "id": 130,
      "start": 2325.3400268554688,
      "end": 2331.8600463867188,
      "text": " But notice his character as it's given to us here in verse number 26, for such an high"
    },
    {
      "id": 131,
      "start": 2331.8600463867188,
      "end": 2333.3800659179688,
      "text": " priest became us."
    },
    {
      "id": 132,
      "start": 2333.3800659179688,
      "end": 2337.4600830078125,
      "text": " Notice who is holy, who is holy."
    },
    {
      "id": 133,
      "start": 2337.4600830078125,
      "end": 2339.9800415039062,
      "text": " Our God is holy."
    },
    {
      "id": 134,
      "start": 2339.9800415039062,
      "end": 2345.3800659179688,
      "text": " I mentioned Isaiah 6, the year that Uzziah died."
    },
    {
      "id": 135,
      "start": 2345.3800659179688,
      "end": 2348.2600708007812,
      "text": " Isaiah saw the Lord."
    },
    {
      "id": 136,
      "start": 2348.2600708007812,
      "end": 2351.4200439453125,
      "text": " The Bible says that his train filled the temple."
    },
    {
      "id": 137,
      "start": 2351.4200439453125,
      "end": 2357.4200439453125,
      "text": " The Bible says that they were crying out, those angels that were crying out, holy, holy,"
    },
    {
      "id": 138,
      "start": 2357.4200439453125,
      "end": 2358.4200439453125,
      "text": " holy."
    },
    {
      "id": 139,
      "start": 2358.4200439453125,
      "end": 2360.5400390625,
      "text": " Our God is holy."
    },
    {
      "id": 140,
      "start": 2360.5400390625,
      "end": 2364.3400268554688,
      "text": " You know, he made it abundantly clear to his people in the Old Testament, if you look and"
    },
    {
      "id": 141,
      "start": 2364.3400268554688,
      "end": 2370.06005859375,
      "text": " study the book of Leviticus, he says to them over and over that he's holy."
    },
    {
      "id": 142,
      "start": 2370.06005859375,
      "end": 2374.9400634765625,
      "text": " In fact, when we find in the New Testament that Peter references that truth, that we're"
    },
    {
      "id": 143,
      "start": 2374.9400634765625,
      "end": 2379.5400390625,
      "text": " to be obedient children, not fashioning ourselves according to our former conversation, that"
    },
    {
      "id": 144,
      "start": 2379.5400390625,
      "end": 2382.1800537109375,
      "text": " we're to be holy as he is holy."
    },
    {
      "id": 145,
      "start": 2382.1800537109375,
      "end": 2386.780029296875,
      "text": " He says he's referencing back to the truth of the book of Leviticus."
    },
    {
      "id": 146,
      "start": 2386.780029296875,
      "end": 2393.1200561523438,
      "text": " If we were to give a brief description, in my opinion, of the books of Exodus and Leviticus,"
    },
    {
      "id": 147,
      "start": 2393.1200561523438,
      "end": 2397.0000610351562,
      "text": " we find that the book of Exodus is God bringing his people out of Egypt."
    },
    {
      "id": 148,
      "start": 2397.0000610351562,
      "end": 2398.0000610351562,
      "text": " Amen?"
    },
    {
      "id": 149,
      "start": 2398.0000610351562,
      "end": 2399.0000610351562,
      "text": " He's bringing them out of Egypt."
    },
    {
      "id": 150,
      "start": 2399.0000610351562,
      "end": 2401.2000732421875,
      "text": " Egypt is a picture of the world."
    },
    {
      "id": 0,
      "start": 2401.2000732421875,
      "end": 2402.620073199272,
      "text": " He's bringing him out of Egypt,"
    },
    {
      "id": 1,
      "start": 2402.620073199272,
      "end": 2404.000073194504,
      "text": " but then the book of Leviticus"
    },
    {
      "id": 2,
      "start": 2404.000073194504,
      "end": 2406.560073375702,
      "text": " is getting Egypt out of his people."
    },
    {
      "id": 3,
      "start": 2406.560073375702,
      "end": 2408.220073223114,
      "text": " Giving him all the instruction."
    },
    {
      "id": 4,
      "start": 2408.220073223114,
      "end": 2409.4000730514526,
      "text": " I'm a holy God."
    },
    {
      "id": 5,
      "start": 2409.4000730514526,
      "end": 2411.1200733184814,
      "text": " Here's how you approach me."
    },
    {
      "id": 6,
      "start": 2411.1200733184814,
      "end": 2412.9600734710693,
      "text": " Here's how you worship me."
    },
    {
      "id": 7,
      "start": 2412.9600734710693,
      "end": 2415.3600730895996,
      "text": " By the way, He tells us"
    },
    {
      "id": 8,
      "start": 2415.3600730895996,
      "end": 2418.900074005127,
      "text": " that we're to worship Him in spirit and in truth."
    },
    {
      "id": 9,
      "start": 2418.900074005127,
      "end": 2420.5200729370117,
      "text": " Amen? John 4."
    },
    {
      "id": 10,
      "start": 2420.5200729370117,
      "end": 2423.320074081421,
      "text": " The reality is that whatever we call worship"
    },
    {
      "id": 11,
      "start": 2423.320074081421,
      "end": 2425.480073928833,
      "text": " doesn't necessarily mean it's worship."
    },
    {
      "id": 12,
      "start": 2425.480073928833,
      "end": 2430.080072402954,
      "text": " It's what God has prescribed as being worship."
    },
    {
      "id": 13,
      "start": 2430.080072402954,
      "end": 2431.9600734710693,
      "text": " But what a joy it is to worship Him."
    },
    {
      "id": 14,
      "start": 2431.9600734710693,
      "end": 2434.4400749206543,
      "text": " He is worthy of our worship."
    },
    {
      "id": 15,
      "start": 2434.4400749206543,
      "end": 2436.280075073242,
      "text": " And we find that the Bible begins"
    },
    {
      "id": 16,
      "start": 2436.280075073242,
      "end": 2438.8000717163086,
      "text": " in giving us this description of His character"
    },
    {
      "id": 17,
      "start": 2438.8000717163086,
      "end": 2441.8000717163086,
      "text": " that He is holy."
    },
    {
      "id": 18,
      "start": 2441.8000717163086,
      "end": 2443.5400733947754,
      "text": " Oh, we better never get over the fact"
    },
    {
      "id": 19,
      "start": 2443.5400733947754,
      "end": 2445.4400749206543,
      "text": " that our God is holy."
    },
    {
      "id": 20,
      "start": 2445.4400749206543,
      "end": 2447.8800735473633,
      "text": " I'm thankful that our God is love and gracious."
    },
    {
      "id": 21,
      "start": 2447.8800735473633,
      "end": 2450.8800735473633,
      "text": " We can go through all the attributes,"
    },
    {
      "id": 22,
      "start": 2450.8800735473633,
      "end": 2453.5400733947754,
      "text": " but we find His holiness."
    },
    {
      "id": 23,
      "start": 2453.5400733947754,
      "end": 2455.6400718688965,
      "text": " And all of these other things really kind of emanate"
    },
    {
      "id": 24,
      "start": 2455.6400718688965,
      "end": 2457.3200721740723,
      "text": " out of the truth that He's holy."
    },
    {
      "id": 25,
      "start": 2457.3200721740723,
      "end": 2458.6400718688965,
      "text": " He's in perfect character,"
    },
    {
      "id": 26,
      "start": 2458.6400718688965,
      "end": 2461.3600730895996,
      "text": " in perfect unity within all of these character traits,"
    },
    {
      "id": 27,
      "start": 2461.3600730895996,
      "end": 2463.9600715637207,
      "text": " but the reality is that our God is holy."
    },
    {
      "id": 28,
      "start": 2463.9600715637207,
      "end": 2465.9200744628906,
      "text": " We must be mindful of that."
    },
    {
      "id": 29,
      "start": 2465.9200744628906,
      "end": 2469.560073852539,
      "text": " Notice it says harmless."
    },
    {
      "id": 30,
      "start": 2469.560073852539,
      "end": 2473.560073852539,
      "text": " Undefiled."
    },
    {
      "id": 31,
      "start": 2473.560073852539,
      "end": 2477.440071105957,
      "text": " Separate from sinners."
    },
    {
      "id": 32,
      "start": 2477.440071105957,
      "end": 2479.680076599121,
      "text": " I think that's interesting,"
    },
    {
      "id": 33,
      "start": 2479.680076599121,
      "end": 2481.7600708007812,
      "text": " that phraseology separate from sinners,"
    },
    {
      "id": 34,
      "start": 2481.7600708007812,
      "end": 2483.6400756835938,
      "text": " because so often,"
    },
    {
      "id": 35,
      "start": 2483.6400756835938,
      "end": 2485.840072631836,
      "text": " during the earthly ministry of the Lord Jesus Christ,"
    },
    {
      "id": 36,
      "start": 2485.840072631836,
      "end": 2489.240074157715,
      "text": " He's accused of going in and eating with the sinners."
    },
    {
      "id": 37,
      "start": 2489.240074157715,
      "end": 2491.5200729370117,
      "text": " Right?"
    },
    {
      "id": 38,
      "start": 2491.5200729370117,
      "end": 2495.6000747680664,
      "text": " He came to seek and to save that which was lost."
    },
    {
      "id": 39,
      "start": 2495.6000747680664,
      "end": 2499.120071411133,
      "text": " And we find that as you look at the truth"
    },
    {
      "id": 40,
      "start": 2499.120071411133,
      "end": 2501.3200759887695,
      "text": " of the character that is revealed to us,"
    },
    {
      "id": 41,
      "start": 2501.3200759887695,
      "end": 2503.680076599121,
      "text": " that He's made, at the end of v. 26,"
    },
    {
      "id": 42,
      "start": 2503.680076599121,
      "end": 2506.840072631836,
      "text": " higher than the heavens."
    },
    {
      "id": 43,
      "start": 2506.840072631836,
      "end": 2509.6000747680664,
      "text": " See, as the author is presenting"
    },
    {
      "id": 44,
      "start": 2509.6000747680664,
      "end": 2512.040069580078,
      "text": " the Lord Jesus Christ,"
    },
    {
      "id": 45,
      "start": 2512.040069580078,
      "end": 2514.720069885254,
      "text": " He's showing that He is superior."
    },
    {
      "id": 46,
      "start": 2514.720069885254,
      "end": 2516.7600708007812,
      "text": " He's better. He's greater."
    },
    {
      "id": 47,
      "start": 2516.7600708007812,
      "end": 2519.440071105957,
      "text": " He's dealt with the description of Melchizedek."
    },
    {
      "id": 48,
      "start": 2519.440071105957,
      "end": 2521.4800720214844,
      "text": " He's dealt with the insufficiency"
    },
    {
      "id": 49,
      "start": 2521.4800720214844,
      "end": 2523.2000732421875,
      "text": " of the Levitical order,"
    },
    {
      "id": 50,
      "start": 2523.2000732421875,
      "end": 2524.2000732421875,
      "text": " the Aaronic order,"
    },
    {
      "id": 51,
      "start": 2524.2000732421875,
      "end": 2528.360076904297,
      "text": " the priesthood order that they would be familiar with."
    },
    {
      "id": 52,
      "start": 2528.360076904297,
      "end": 2532.2400665283203,
      "text": " And He's now presenting the Lord Jesus Christ"
    },
    {
      "id": 53,
      "start": 2532.2400665283203,
      "end": 2534.2400665283203,
      "text": " as the fulfillment."
    },
    {
      "id": 54,
      "start": 2534.2400665283203,
      "end": 2535.8800659179688,
      "text": " We find that He's sinless."
    },
    {
      "id": 55,
      "start": 2535.8800659179688,
      "end": 2537.2000732421875,
      "text": " Notice in v. 27,"
    },
    {
      "id": 56,
      "start": 2537.2000732421875,
      "end": 2539.7600708007812,
      "text": " who needeth not daily as those high priests"
    },
    {
      "id": 57,
      "start": 2539.7600708007812,
      "end": 2541.080078125,
      "text": " to offer up sacrifice,"
    },
    {
      "id": 58,
      "start": 2541.080078125,
      "end": 2543.5200805664062,
      "text": " notice first for His own sins,"
    },
    {
      "id": 59,
      "start": 2543.560073852539,
      "end": 2546.560073852539,
      "text": " and then for the people's."
    },
    {
      "id": 60,
      "start": 2546.560073852539,
      "end": 2549.8800659179688,
      "text": " For this He did once when He offered up Himself."
    },
    {
      "id": 61,
      "start": 2549.8800659179688,
      "end": 2552.120071411133,
      "text": " See, there was no need for Him to offer up"
    },
    {
      "id": 62,
      "start": 2552.120071411133,
      "end": 2554.1600799560547,
      "text": " any offering for His own sins,"
    },
    {
      "id": 63,
      "start": 2554.1600799560547,
      "end": 2556.7600708007812,
      "text": " for He was sinless."
    },
    {
      "id": 64,
      "start": 2556.7600708007812,
      "end": 2558.5200805664062,
      "text": " 2 Corinthians 5.21,"
    },
    {
      "id": 65,
      "start": 2558.5200805664062,
      "end": 2560.080078125,
      "text": " for He, speaking of God the Father,"
    },
    {
      "id": 66,
      "start": 2560.080078125,
      "end": 2562.120071411133,
      "text": " hath made Him, speaking of Jesus Christ,"
    },
    {
      "id": 67,
      "start": 2562.120071411133,
      "end": 2563.800079345703,
      "text": " to be sin for us,"
    },
    {
      "id": 68,
      "start": 2563.800079345703,
      "end": 2565.600067138672,
      "text": " who knew no sin,"
    },
    {
      "id": 69,
      "start": 2565.600067138672,
      "end": 2571.2400665283203,
      "text": " that we might be made the righteousness of God in Him."
    },
    {
      "id": 70,
      "start": 2571.2400665283203,
      "end": 2572.9200744628906,
      "text": " Peter declares it this way"
    },
    {
      "id": 71,
      "start": 2572.9200744628906,
      "end": 2575.560073852539,
      "text": " in 1 Peter 3 and v. 18."
    },
    {
      "id": 72,
      "start": 2575.560073852539,
      "end": 2577.4400787353516,
      "text": " What a great truth."
    },
    {
      "id": 73,
      "start": 2577.4400787353516,
      "end": 2578.0000762939453,
      "text": " It says,"
    },
    {
      "id": 74,
      "start": 2578.0000762939453,
      "end": 2581.6800689697266,
      "text": " for Christ also hath once suffered for sins,"
    },
    {
      "id": 75,
      "start": 2581.6800689697266,
      "end": 2583.2000732421875,
      "text": " the just for the unjust,"
    },
    {
      "id": 76,
      "start": 2583.2000732421875,
      "end": 2585.280075073242,
      "text": " that He might bring us to God,"
    },
    {
      "id": 77,
      "start": 2585.280075073242,
      "end": 2586.8800659179688,
      "text": " being put to death in the flesh,"
    },
    {
      "id": 78,
      "start": 2586.8800659179688,
      "end": 2590.800079345703,
      "text": " but quickened by the Spirit."
    },
    {
      "id": 79,
      "start": 2590.800079345703,
      "end": 2592.6400756835938,
      "text": " See, He did this once."
    },
    {
      "id": 80,
      "start": 2592.6400756835938,
      "end": 2594.280075073242,
      "text": " It leads right into,"
    },
    {
      "id": 81,
      "start": 2594.280075073242,
      "end": 2596.280075073242,
      "text": " as we think about the superiority of Christ,"
    },
    {
      "id": 82,
      "start": 2596.280075073242,
      "end": 2598.9600677490234,
      "text": " it leads into the substitutionary atonement."
    },
    {
      "id": 83,
      "start": 2598.9600677490234,
      "end": 2600.7600708007812,
      "text": " What He did for us."
    },
    {
      "id": 84,
      "start": 2600.9600677490234,
      "end": 2602.6400756835938,
      "text": " These priests,"
    },
    {
      "id": 85,
      "start": 2602.6400756835938,
      "end": 2604.7200775146484,
      "text": " this Old Testament order,"
    },
    {
      "id": 86,
      "start": 2604.7200775146484,
      "end": 2607.800079345703,
      "text": " man, they were regularly making these offerings."
    },
    {
      "id": 87,
      "start": 2607.800079345703,
      "end": 2609.4800720214844,
      "text": " I mean, every day."
    },
    {
      "id": 88,
      "start": 2609.4800720214844,
      "end": 2612.7200775146484,
      "text": " In fact, as we will soon get into the 10th chapter"
    },
    {
      "id": 89,
      "start": 2612.7200775146484,
      "end": 2614.080078125,
      "text": " of the book of Hebrews,"
    },
    {
      "id": 90,
      "start": 2614.080078125,
      "end": 2616.7200775146484,
      "text": " we find that He talks about the way in which"
    },
    {
      "id": 91,
      "start": 2616.7200775146484,
      "end": 2620.2000732421875,
      "text": " they are continually making these offerings"
    },
    {
      "id": 92,
      "start": 2620.2000732421875,
      "end": 2623.4000701904297,
      "text": " and day by day by day."
    },
    {
      "id": 93,
      "start": 2623.4000701904297,
      "end": 2624.4800720214844,
      "text": " But this man,"
    },
    {
      "id": 94,
      "start": 2624.4800720214844,
      "end": 2626.280075073242,
      "text": " because it's a substitutionary atonement,"
    },
    {
      "id": 95,
      "start": 2626.280075073242,
      "end": 2627.6800689697266,
      "text": " because he's sinless,"
    },
    {
      "id": 96,
      "start": 2627.6800689697266,
      "end": 2629.7200775146484,
      "text": " because he's God in flesh,"
    },
    {
      "id": 97,
      "start": 2629.7600708007812,
      "end": 2633.4000701904297,
      "text": " after he'd made one sin for sacrifice forever,"
    },
    {
      "id": 98,
      "start": 2633.4000701904297,
      "end": 2635.840072631836,
      "text": " excuse me, one sacrifice for sin forever,"
    },
    {
      "id": 99,
      "start": 2635.840072631836,
      "end": 2638.9600677490234,
      "text": " he sat down at the right hand of the throne of God."
    },
    {
      "id": 100,
      "start": 2638.9600677490234,
      "end": 2641.4400787353516,
      "text": " And what a blessing to understand"
    },
    {
      "id": 101,
      "start": 2641.4400787353516,
      "end": 2644.320068359375,
      "text": " that he only made one sacrifice,"
    },
    {
      "id": 102,
      "start": 2644.320068359375,
      "end": 2645.840072631836,
      "text": " one offering."
    },
    {
      "id": 103,
      "start": 2645.840072631836,
      "end": 2646.7600708007812,
      "text": " And what did he offer?"
    },
    {
      "id": 104,
      "start": 2646.7600708007812,
      "end": 2649.0000762939453,
      "text": " He offered himself."
    },
    {
      "id": 105,
      "start": 2649.0000762939453,
      "end": 2651.040069580078,
      "text": " He offered himself."
    },
    {
      "id": 106,
      "start": 2651.040069580078,
      "end": 2653.040069580078,
      "text": " We notice at the end of verse number 27,"
    },
    {
      "id": 107,
      "start": 2653.040069580078,
      "end": 2654.2000732421875,
      "text": " it says,"
    },
    {
      "id": 108,
      "start": 2654.2000732421875,
      "end": 2656.080078125,
      "text": " for this He did once"
    },
    {
      "id": 109,
      "start": 2656.120071411133,
      "end": 2660.080078125,
      "text": " when He offered up Himself."
    },
    {
      "id": 110,
      "start": 2660.080078125,
      "end": 2661.6800842285156,
      "text": " It's interesting if we could go"
    },
    {
      "id": 111,
      "start": 2661.6800842285156,
      "end": 2663.360076904297,
      "text": " just a few verses into the eighth chapter."
    },
    {
      "id": 112,
      "start": 2663.360076904297,
      "end": 2665.320068359375,
      "text": " We'll deal with this in more detail next week."
    },
    {
      "id": 113,
      "start": 2665.320068359375,
      "end": 2666.6400756835938,
      "text": " But notice in verse number three"
    },
    {
      "id": 114,
      "start": 2666.6400756835938,
      "end": 2668.040069580078,
      "text": " of chapter eight of the book of Hebrews,"
    },
    {
      "id": 115,
      "start": 2668.040069580078,
      "end": 2669.9600830078125,
      "text": " it says, for every high priest"
    },
    {
      "id": 116,
      "start": 2669.9600830078125,
      "end": 2673.600067138672,
      "text": " who is ordained to offer gifts and sacrifices."
    },
    {
      "id": 117,
      "start": 2673.600067138672,
      "end": 2674.4400634765625,
      "text": " We know that."
    },
    {
      "id": 118,
      "start": 2674.4400634765625,
      "end": 2675.9200744628906,
      "text": " If you read the Old Testament,"
    },
    {
      "id": 119,
      "start": 2675.9200744628906,
      "end": 2678.320068359375,
      "text": " you read all of the sacrificial system"
    },
    {
      "id": 120,
      "start": 2678.320068359375,
      "end": 2679.5200805664062,
      "text": " and all those things,"
    },
    {
      "id": 121,
      "start": 2679.5200805664062,
      "end": 2681.2400817871094,
      "text": " you understand that they were ordained"
    },
    {
      "id": 122,
      "start": 2681.2400817871094,
      "end": 2682.840087890625,
      "text": " to offer gifts and sacrifices."
    },
    {
      "id": 123,
      "start": 2682.840087890625,
      "end": 2685.040069580078,
      "text": " Notice it says this at the end of verse number three,"
    },
    {
      "id": 124,
      "start": 2685.120086669922,
      "end": 2689.280059814453,
      "text": " wherefore, it is of necessity"
    },
    {
      "id": 125,
      "start": 2689.280059814453,
      "end": 2693.2400817871094,
      "text": " that this man have someone also to offer."
    },
    {
      "id": 126,
      "start": 2693.2400817871094,
      "end": 2694.4000854492188,
      "text": " What was his offering?"
    },
    {
      "id": 127,
      "start": 2694.4000854492188,
      "end": 2695.2400817871094,
      "text": " Himself."
    },
    {
      "id": 128,
      "start": 2696.2000732421875,
      "end": 2698.600067138672,
      "text": " And it was for sin forever."
    },
    {
      "id": 129,
      "start": 2699.6800842285156,
      "end": 2702.2400817871094,
      "text": " Now as we begin to think about the truth"
    },
    {
      "id": 130,
      "start": 2702.2400817871094,
      "end": 2705.800079345703,
      "text": " that he made this sacrifice"
    },
    {
      "id": 131,
      "start": 2705.800079345703,
      "end": 2708.600067138672,
      "text": " as we refer to it as the substitutionary atonement."
    },
    {
      "id": 132,
      "start": 2708.600067138672,
      "end": 2709.9600830078125,
      "text": " Yes, what did it accomplish?"
    },
    {
      "id": 133,
      "start": 2709.9600830078125,
      "end": 2712.1600646972656,
      "text": " Salvation, reconciliation."
    },
    {
      "id": 134,
      "start": 2712.1600646972656,
      "end": 2713.56005859375,
      "text": " We see in verse number 25,"
    },
    {
      "id": 135,
      "start": 2713.56005859375,
      "end": 2716.8800659179688,
      "text": " it says, wherefore, he is able also"
    },
    {
      "id": 136,
      "start": 2716.8800659179688,
      "end": 2719.840087890625,
      "text": " to save them to the uttermost"
    },
    {
      "id": 137,
      "start": 2719.840087890625,
      "end": 2722.080078125,
      "text": " that come unto God by him."
    },
    {
      "id": 138,
      "start": 2722.080078125,
      "end": 2725.2400817871094,
      "text": " Isn't that a contrast to what we read"
    },
    {
      "id": 139,
      "start": 2725.2400817871094,
      "end": 2726.2400817871094,
      "text": " in verse number 11?"
    },
    {
      "id": 140,
      "start": 2726.2400817871094,
      "end": 2727.9600830078125,
      "text": " A great contrast when it says,"
    },
    {
      "id": 141,
      "start": 2727.9600830078125,
      "end": 2731.0000610351562,
      "text": " if therefore perfection were by the Levitical priesthood."
    },
    {
      "id": 142,
      "start": 2731.0000610351562,
      "end": 2732.600067138672,
      "text": " No, it's not."
    },
    {
      "id": 143,
      "start": 2732.600067138672,
      "end": 2733.800079345703,
      "text": " It can't be."
    },
    {
      "id": 144,
      "start": 2733.800079345703,
      "end": 2736.56005859375,
      "text": " Verse 19, the law made nothing perfect."
    },
    {
      "id": 145,
      "start": 2736.56005859375,
      "end": 2738.040069580078,
      "text": " But we find that here,"
    },
    {
      "id": 146,
      "start": 2738.040069580078,
      "end": 2740.600067138672,
      "text": " speaking of the superiority of Jesus Christ,"
    },
    {
      "id": 147,
      "start": 2740.600067138672,
      "end": 2743.2400817871094,
      "text": " he says that what his offering,"
    },
    {
      "id": 148,
      "start": 2743.2400817871094,
      "end": 2745.840087890625,
      "text": " what his sacrifice accomplished"
    },
    {
      "id": 149,
      "start": 2745.840087890625,
      "end": 2747.840087890625,
      "text": " was that he is able to save them"
    },
    {
      "id": 150,
      "start": 2747.840087890625,
      "end": 2750.6400756835938,
      "text": " to the uttermost that come unto God by him."
    },
    {
      "id": 151,
      "start": 2751.8800659179688,
      "end": 2753.360076904297,
      "text": " Reconciliation."
    },
    {
      "id": 152,
      "start": 2753.360076904297,
      "end": 2755.320068359375,
      "text": " The Bible says that he's our intercessor."
    },
    {
      "id": 153,
      "start": 2755.320068359375,
      "end": 2756.9200744628906,
      "text": " Notice it says that he ever liveth"
    },
    {
      "id": 154,
      "start": 2756.9200744628906,
      "end": 2758.4400634765625,
      "text": " to make intercession for us."
    },
    {
      "id": 155,
      "start": 2758.4400634765625,
      "end": 2759.9200744628906,
      "text": " An intercessor is a mediator,"
    },
    {
      "id": 156,
      "start": 2759.9200744628906,
      "end": 2763.840087890625,
      "text": " one who really interposes between two parties"
    },
    {
      "id": 157,
      "start": 2763.840087890625,
      "end": 2766.2000732421875,
      "text": " that are at variance one with another."
    },
    {
      "id": 158,
      "start": 2766.2000732421875,
      "end": 2768.4000854492188,
      "text": " What's the purpose?"
    },
    {
      "id": 159,
      "start": 2768.4000854492188,
      "end": 2770.4000854492188,
      "text": " To bring reconciliation."
    },
    {
      "id": 160,
      "start": 2770.4000854492188,
      "end": 2772.1600646972656,
      "text": " That's the purpose."
    },
    {
      "id": 161,
      "start": 2772.1600646972656,
      "end": 2775.0000610351562,
      "text": " And we see that's exactly what Jesus Christ did."
    },
    {
      "id": 162,
      "start": 2775.0000610351562,
      "end": 2777.5200805664062,
      "text": " You know what those Old Testament sacrifices"
    },
    {
      "id": 163,
      "start": 2777.5200805664062,
      "end": 2779.7200622558594,
      "text": " reminded the people of every day?"
    },
    {
      "id": 164,
      "start": 2779.7200622558594,
      "end": 2782.600067138672,
      "text": " That what they offered yesterday was not sufficient"
    },
    {
      "id": 165,
      "start": 2782.600067138672,
      "end": 2784.7200622558594,
      "text": " because they had to come back today."
    },
    {
      "id": 166,
      "start": 2784.7200622558594,
      "end": 2786.2000732421875,
      "text": " They had to bring another offering."
    },
    {
      "id": 167,
      "start": 2786.2000732421875,
      "end": 2787.4800720214844,
      "text": " They had to bring another offering."
    },
    {
      "id": 168,
      "start": 2787.4800720214844,
      "end": 2788.800079345703,
      "text": " They had to bring another offering."
    },
    {
      "id": 169,
      "start": 2788.800079345703,
      "end": 2790.9600830078125,
      "text": " They had to bring another offering."
    },
    {
      "id": 170,
      "start": 2790.9600830078125,
      "end": 2791.800079345703,
      "text": " Why?"
    },
    {
      "id": 171,
      "start": 2791.800079345703,
      "end": 2792.6400756835938,
      "text": " Because it's insufficient."
    },
    {
      "id": 172,
      "start": 2792.6400756835938,
      "end": 2795.2400817871094,
      "text": " The blood of bulls and goats can never,"
    },
    {
      "id": 173,
      "start": 2795.2400817871094,
      "end": 2797.0000610351562,
      "text": " the Bible tells us,"
    },
    {
      "id": 174,
      "start": 2797.0000610351562,
      "end": 2800.0000610351562,
      "text": " it can never take away sins."
    },
    {
      "id": 175,
      "start": 2801.0000610351562,
      "end": 2803.6800842285156,
      "text": " But the power of Christ's blood."
    },
    {
      "id": 176,
      "start": 2803.6800842285156,
      "end": 2807.1600646972656,
      "text": " We sing there's power in the blood."
    },
    {
      "id": 177,
      "start": 2807.1600646972656,
      "end": 2810.1600646972656,
      "text": " We understand the truth when Peter says"
    },
    {
      "id": 178,
      "start": 2810.1600646972656,
      "end": 2813.0000610351562,
      "text": " that we're not redeemed with corruptible things"
    },
    {
      "id": 179,
      "start": 2813.0000610351562,
      "end": 2816.320068359375,
      "text": " received from our vain conversation"
    },
    {
      "id": 180,
      "start": 2816.320068359375,
      "end": 2818.4400634765625,
      "text": " or received by tradition from our fathers."
    },
    {
      "id": 181,
      "start": 2818.4400634765625,
      "end": 2819.280059814453,
      "text": " How are we saved?"
    },
    {
      "id": 182,
      "start": 2819.280059814453,
      "end": 2822.800079345703,
      "text": " We're not with the gold and silver"
    },
    {
      "id": 183,
      "start": 2822.800079345703,
      "end": 2823.7600708007812,
      "text": " and all of those things."
    },
    {
      "id": 184,
      "start": 2823.7600708007812,
      "end": 2826.6800842285156,
      "text": " No, we're saved with the precious blood of Christ."
    },
    {
      "id": 185,
      "start": 2827.800079345703,
      "end": 2829.56005859375,
      "text": " What a blessing."
    },
    {
      "id": 186,
      "start": 2829.840087890625,
      "end": 2833.4400634765625,
      "text": " We find that here in the book of Hebrews"
    },
    {
      "id": 187,
      "start": 2833.4400634765625,
      "end": 2834.8800659179688,
      "text": " in chapter number 7,"
    },
    {
      "id": 188,
      "start": 2834.8800659179688,
      "end": 2837.7200622558594,
      "text": " as he began dealing with this subject"
    },
    {
      "id": 189,
      "start": 2837.7200622558594,
      "end": 2840.7200622558594,
      "text": " in chapter number 5 and he previews it,"
    },
    {
      "id": 190,
      "start": 2840.7200622558594,
      "end": 2842.9200744628906,
      "text": " I want you to understand there's a pattern"
    },
    {
      "id": 191,
      "start": 2842.9200744628906,
      "end": 2844.800079345703,
      "text": " for the Old Testament priesthood"
    },
    {
      "id": 192,
      "start": 2844.800079345703,
      "end": 2847.360076904297,
      "text": " and you're familiar with it."
    },
    {
      "id": 193,
      "start": 2847.360076904297,
      "end": 2849.120086669922,
      "text": " Jewish people he's speaking to."
    },
    {
      "id": 194,
      "start": 2849.120086669922,
      "end": 2852.1600646972656,
      "text": " Very familiar with the Old Testament priesthood."
    },
    {
      "id": 195,
      "start": 2852.1600646972656,
      "end": 2854.1600646972656,
      "text": " He says, I want you to understand though"
    },
    {
      "id": 196,
      "start": 2854.1600646972656,
      "end": 2856.0000610351562,
      "text": " that there's a prophecy"
    },
    {
      "id": 197,
      "start": 2857.0000610351562,
      "end": 2858.360076904297,
      "text": " that deals with a greater,"
    },
    {
      "id": 198,
      "start": 2858.360076904297,
      "end": 2860.600067138672,
      "text": " a higher order of priesthood."
    },
    {
      "id": 199,
      "start": 2860.600067138672,
      "end": 2862.2400817871094,
      "text": " The order of Melchizedek."
    },
    {
      "id": 200,
      "start": 2862.2400817871094,
      "end": 2864.4000854492188,
      "text": " I have a whole lot of things to say,"
    },
    {
      "id": 201,
      "start": 2864.4000854492188,
      "end": 2865.4800720214844,
      "text": " but you're not ready for it yet."
    },
    {
      "id": 202,
      "start": 2865.4800720214844,
      "end": 2867.0000610351562,
      "text": " You're dull of hearing."
    },
    {
      "id": 203,
      "start": 2867.0000610351562,
      "end": 2868.8800659179688,
      "text": " And he gives them this warning"
    },
    {
      "id": 204,
      "start": 2868.8800659179688,
      "end": 2870.320068359375,
      "text": " and then he gets right back to it."
    },
    {
      "id": 205,
      "start": 2870.320068359375,
      "end": 2872.600067138672,
      "text": " And here's all the things that he wants to say."
    },
    {
      "id": 206,
      "start": 2872.600067138672,
      "end": 2876.6400756835938,
      "text": " And oh, how he unwraps it and presents it."
    },
    {
      "id": 207,
      "start": 2876.6400756835938,
      "end": 2878.2400817871094,
      "text": " What was given in chapter number 5"
    },
    {
      "id": 208,
      "start": 2878.2400817871094,
      "end": 2880.2000732421875,
      "text": " as a preview is now fully presented"
    },
    {
      "id": 209,
      "start": 2880.2000732421875,
      "end": 2881.4400634765625,
      "text": " in chapter number 7."
    },
    {
      "id": 210,
      "start": 2881.4400634765625,
      "end": 2882.9600830078125,
      "text": " And he says, listen,"
    },
    {
      "id": 211,
      "start": 2882.9600830078125,
      "end": 2884.9600830078125,
      "text": " here's the description of Melchizedek."
    },
    {
      "id": 212,
      "start": 2885.2400817871094,
      "end": 2887.4400634765625,
      "text": " Here's the insufficiency of that"
    },
    {
      "id": 213,
      "start": 2887.4400634765625,
      "end": 2888.7600708007812,
      "text": " which we're familiar with,"
    },
    {
      "id": 214,
      "start": 2888.7600708007812,
      "end": 2890.4000854492188,
      "text": " the Aaronic priesthood,"
    },
    {
      "id": 215,
      "start": 2890.4000854492188,
      "end": 2891.800079345703,
      "text": " the Levitical priesthood."
    },
    {
      "id": 216,
      "start": 2891.800079345703,
      "end": 2893.360076904297,
      "text": " We understand these things,"
    },
    {
      "id": 217,
      "start": 2893.360076904297,
      "end": 2896.040069580078,
      "text": " but it's insufficient."
    },
    {
      "id": 218,
      "start": 2896.040069580078,
      "end": 2899.4800720214844,
      "text": " And let me show you the superiority"
    },
    {
      "id": 219,
      "start": 2899.4800720214844,
      "end": 2902.6400756835938,
      "text": " of Jesus Christ and his priesthood."
    },
    {
      "id": 220,
      "start": 2902.6400756835938,
      "end": 2904.9200744628906,
      "text": " He is the fulfillment."
    },
    {
      "id": 221,
      "start": 2904.9200744628906,
      "end": 2909.9200744628906,
      "text": " He is that Messiah that was spoken of in Psalm 110"
    },
    {
      "id": 222,
      "start": 2910.4000854492188,
      "end": 2912.9600830078125,
      "text": " that he would come and he would be a priest forever"
    },
    {
      "id": 223,
      "start": 2912.9600830078125,
      "end": 2915.6400756835938,
      "text": " after the order of Melchizedek."
    },
    {
      "id": 224,
      "start": 2915.6400756835938,
      "end": 2917.56005859375,
      "text": " See, we serve a great God."
    },
    {
      "id": 225,
      "start": 2917.56005859375,
      "end": 2918.9200439453125,
      "text": " We really do."
    },
    {
      "id": 226,
      "start": 2918.9200439453125,
      "end": 2920.3600463867188,
      "text": " And we understand what he's,"
    },
    {
      "id": 227,
      "start": 2920.3600463867188,
      "end": 2921.4400634765625,
      "text": " how he's working,"
    },
    {
      "id": 228,
      "start": 2921.4400634765625,
      "end": 2923.56005859375,
      "text": " how he's interceding on our behalf,"
    },
    {
      "id": 229,
      "start": 2923.56005859375,
      "end": 2925.080078125,
      "text": " the salvation that he offers,"
    },
    {
      "id": 230,
      "start": 2925.080078125,
      "end": 2926.5200805664062,
      "text": " the work that was accomplished"
    },
    {
      "id": 231,
      "start": 2926.5200805664062,
      "end": 2927.9600830078125,
      "text": " at the cross of Calvary"
    },
    {
      "id": 232,
      "start": 2927.9600830078125,
      "end": 2930.4000854492188,
      "text": " and how he ever liveth to make intercession."
    },
    {
      "id": 233,
      "start": 2930.4000854492188,
      "end": 2932.7600708007812,
      "text": " They could look at some of these patriarchs."
    },
    {
      "id": 234,
      "start": 2932.7600708007812,
      "end": 2934.9200439453125,
      "text": " They could look at some of the priests"
    },
    {
      "id": 235,
      "start": 2934.9200439453125,
      "end": 2936.4801025390625,
      "text": " and they could see that they died."
    },
    {
      "id": 236,
      "start": 2936.4801025390625,
      "end": 2937.60009765625,
      "text": " And then there was another one"
    },
    {
      "id": 237,
      "start": 2937.60009765625,
      "end": 2938.60009765625,
      "text": " and so on and so forth."
    },
    {
      "id": 238,
      "start": 2938.60009765625,
      "end": 2940.56005859375,
      "text": " But our great high priest,"
    },
    {
      "id": 239,
      "start": 2940.56005859375,
      "end": 2943.080078125,
      "text": " he ever liveth."
    },
    {
      "id": 240,
      "start": 2943.080078125,
      "end": 2947.7600708007812,
      "text": " The writer of Hebrews is saying to these Jewish believers"
    },
    {
      "id": 241,
      "start": 2947.7600708007812,
      "end": 2949.4000854492188,
      "text": " who are contemplating,"
    },
    {
      "id": 242,
      "start": 2949.4000854492188,
      "end": 2951.60009765625,
      "text": " because of all that they're dealing with,"
    },
    {
      "id": 243,
      "start": 2951.60009765625,
      "end": 2954.2800903320312,
      "text": " the thought of returning to Judaism."
    },
    {
      "id": 244,
      "start": 2954.2800903320312,
      "end": 2956.840087890625,
      "text": " He says, why would you ever do it?"
    },
    {
      "id": 245,
      "start": 2956.840087890625,
      "end": 2958.080078125,
      "text": " Don't do it."
    },
    {
      "id": 246,
      "start": 2958.080078125,
      "end": 2962.080078125,
      "text": " Let me show you that we have a higher priest,"
    },
    {
      "id": 247,
      "start": 2962.080078125,
      "end": 2964.0401000976562,
      "text": " a greater priest."
    },
    {
      "id": 248,
      "start": 2964.0401000976562,
      "end": 2966.60009765625,
      "text": " See, you see the temple over there."
    },
    {
      "id": 249,
      "start": 2966.60009765625,
      "end": 2969.4400634765625,
      "text": " And of course, we can read during the time"
    },
    {
      "id": 250,
      "start": 2969.4801025390625,
      "end": 2971.840087890625,
      "text": " in which the Lord Jesus Christ, Caiaphas, right?"
    },
    {
      "id": 251,
      "start": 2971.840087890625,
      "end": 2974.4400634765625,
      "text": " And you can read of those things that are going on"
    },
    {
      "id": 252,
      "start": 2974.4400634765625,
      "end": 2976.1200561523438,
      "text": " and how the religious leaders,"
    },
    {
      "id": 253,
      "start": 2976.1200561523438,
      "end": 2979.080078125,
      "text": " not only the priest and Caiaphas being there,"
    },
    {
      "id": 254,
      "start": 2979.080078125,
      "end": 2982.0401000976562,
      "text": " you can read about the Pharisees"
    },
    {
      "id": 255,
      "start": 2982.0401000976562,
      "end": 2983.840087890625,
      "text": " and the Sadducees and all of those people."
    },
    {
      "id": 256,
      "start": 2983.840087890625,
      "end": 2984.840087890625,
      "text": " What are they crying out?"
    },
    {
      "id": 257,
      "start": 2984.840087890625,
      "end": 2987.60009765625,
      "text": " Crucify Him."
    },
    {
      "id": 258,
      "start": 2987.60009765625,
      "end": 2989.5200805664062,
      "text": " Right? Now, these Jewish believers,"
    },
    {
      "id": 259,
      "start": 2989.5200805664062,
      "end": 2990.9600830078125,
      "text": " they see the temple."
    },
    {
      "id": 260,
      "start": 2990.9600830078125,
      "end": 2992.7600708007812,
      "text": " They see that there's a priest over there."
    },
    {
      "id": 261,
      "start": 2992.7600708007812,
      "end": 2994.5200805664062,
      "text": " They're making sacrifices."
    },
    {
      "id": 262,
      "start": 2994.5200805664062,
      "end": 2996.6400756835938,
      "text": " He's saying don't go back"
    },
    {
      "id": 263,
      "start": 2996.6400756835938,
      "end": 2999.4000854492188,
      "text": " because we have a great high priest."
    },
    {
      "id": 264,
      "start": 2999.4000854492188,
      "end": 3000.7600708007812,
      "text": " He's our great high priest."
    },
    {
      "id": 265,
      "start": 3000.7600708007812,
      "end": 3001.60009765625,
      "text": " He's after."
    },
    {
      "id": 0,
      "start": 3001.60009765625,
      "end": 3007.2400975227356,
      "text": " the order of Melchizedek and what a great presentation in Hebrews chapter"
    },
    {
      "id": 1,
      "start": 3007.2400975227356,
      "end": 3011.440097808838,
      "text": " number seven so we need to be mindful this morning just as these Jewish"
    },
    {
      "id": 2,
      "start": 3011.440097808838,
      "end": 3017.400097846985,
      "text": " believers of what we have in Christ what we have in Christ we need to live each"
    },
    {
      "id": 3,
      "start": 3017.400097846985,
      "end": 3023.020097732544,
      "text": " day understanding that he lives understanding that I have a great high"
    },
    {
      "id": 4,
      "start": 3023.020097732544,
      "end": 3027.9600982666016,
      "text": " priest that that liveth and he makes intercession for me and and we"
    },
    {
      "id": 5,
      "start": 3027.9600982666016,
      "end": 3036.9600982666016,
      "text": " understand what he accomplished and perhaps as we begin to live with the"
    },
    {
      "id": 6,
      "start": 3036.9600982666016,
      "end": 3042.5200958251953,
      "text": " knowledge that he lives will have a great impact on the society in which we"
    },
    {
      "id": 7,
      "start": 3042.5200958251953,
      "end": 3049.200096130371,
      "text": " live see because we live in a society who is I mean the the we see him all"
    },
    {
      "id": 8,
      "start": 3049.200096130371,
      "end": 3054.6400985717773,
      "text": " around us we've known it for a long time but oh how the makeup is coming off so"
    },
    {
      "id": 9,
      "start": 3054.6400985717773,
      "end": 3064.7200965881348,
      "text": " to speak amen I mean it's it's bad sin is bad it's wicked it's evil and the"
    },
    {
      "id": 10,
      "start": 3064.7200965881348,
      "end": 3072.5200958251953,
      "text": " answer is Jesus and as we understand who we are in Christ and who he is to us it"
    },
    {
      "id": 11,
      "start": 3072.5200958251953,
      "end": 3079.720100402832,
      "text": " enables us to live a life before the world that can make an impact see Jesus"
    },
    {
      "id": 12,
      "start": 3079.720100402832,
      "end": 3088.2400970458984,
      "text": " said you're the salt of the earth he said you are the light of the world if"
    },
    {
      "id": 13,
      "start": 3088.2400970458984,
      "end": 3097.2400970458984,
      "text": " the salt hath lost its savor it's good for nothing we find that we are to live"
    },
    {
      "id": 14,
      "start": 3097.2400970458984,
      "end": 3103.220100402832,
      "text": " in this sin-cursed world we're to live in this world of people that we"
    },
    {
      "id": 15,
      "start": 3103.220100402832,
      "end": 3106.400100708008,
      "text": " understand as Paul says in the book of Philippians that there are many that are"
    },
    {
      "id": 16,
      "start": 3106.400100708008,
      "end": 3112.480094909668,
      "text": " the enemies of the cross of Christ but we're to live as salt and as light and"
    },
    {
      "id": 17,
      "start": 3112.480094909668,
      "end": 3119.480094909668,
      "text": " say let me tell you about my Savior let me tell you how great my God is let me"
    },
    {
      "id": 18,
      "start": 3119.480094909668,
      "end": 3125.7601013183594,
      "text": " through the way that I live my life let it show how great our God is I preached"
    },
    {
      "id": 19,
      "start": 3125.7601013183594,
      "end": 3130.800094604492,
      "text": " a message a few weeks ago on a Wednesday evening from the book of Nehemiah and"
    },
    {
      "id": 20,
      "start": 3130.800094604492,
      "end": 3136.7200927734375,
      "text": " excuse me from the book of Ezra and as we look at that passage of Scripture and"
    },
    {
      "id": 21,
      "start": 3136.7200927734375,
      "end": 3142.0000915527344,
      "text": " we deal with the subject matter as to what we were dealing with we find that"
    },
    {
      "id": 22,
      "start": 3142.0000915527344,
      "end": 3148.840103149414,
      "text": " there Ezra understood that the hand of his God was upon him some of you were"
    },
    {
      "id": 23,
      "start": 3148.840103149414,
      "end": 3152.840103149414,
      "text": " here on that Wednesday night some of you were tuning in via livestream but let me"
    },
    {
      "id": 24,
      "start": 3152.840103149414,
      "end": 3158.60009765625,
      "text": " just summarize quickly what I dealt with on that night and hopefully make"
    },
    {
      "id": 25,
      "start": 3158.60009765625,
      "end": 3162.120101928711,
      "text": " application through what we're dealing with even here in Hebrews 7 because we"
    },
    {
      "id": 26,
      "start": 3162.120101928711,
      "end": 3169.6800994873047,
      "text": " serve a God who lives and and see here's what Ezra was dealing with and we look"
    },
    {
      "id": 27,
      "start": 3169.6800994873047,
      "end": 3173.5200958251953,
      "text": " at the passage of Scripture and we understand he had gone and he had"
    },
    {
      "id": 28,
      "start": 3173.5200958251953,
      "end": 3182.080093383789,
      "text": " declared how great his God was he had talked to the king I have a great God"
    },
    {
      "id": 29,
      "start": 3182.080093383789,
      "end": 3186.7601013183594,
      "text": " here's what my God's able to do he'll bless those that are for him he'll curse"
    },
    {
      "id": 30,
      "start": 3186.7601013183594,
      "end": 3190.7200927734375,
      "text": " those that are against him I mean we have a great God and then he had to take"
    },
    {
      "id": 31,
      "start": 3190.7200927734375,
      "end": 3196.1600952148438,
      "text": " a journey to Jerusalem and that journey that he'd have to take to Jerusalem was"
    },
    {
      "id": 32,
      "start": 3196.1600952148438,
      "end": 3204.2200927734375,
      "text": " a dangerous journey there were enemies in the way so here's the thought I can"
    },
    {
      "id": 33,
      "start": 3204.2200927734375,
      "end": 3209.840103149414,
      "text": " go to the king and request what I've called a military escort but you know"
    },
    {
      "id": 34,
      "start": 3209.840103149414,
      "end": 3216.4801025390625,
      "text": " what you know he said I was ashamed I was ashamed to ask for this military"
    },
    {
      "id": 35,
      "start": 3216.560104370117,
      "end": 3221.7601013183594,
      "text": " escort why because I'd already told him how great my God is and now I'm gonna go"
    },
    {
      "id": 36,
      "start": 3221.7601013183594,
      "end": 3225.2800903320312,
      "text": " and say to the king actually we got this dangerous journey that we're gonna go on"
    },
    {
      "id": 37,
      "start": 3225.2800903320312,
      "end": 3227.60009765625,
      "text": " and I know I told you all this stuff about my God and what he's able to do"
    },
    {
      "id": 38,
      "start": 3227.60009765625,
      "end": 3230.2800903320312,
      "text": " but I really need your soldiers to accompany me so that we can make it"
    },
    {
      "id": 39,
      "start": 3230.2800903320312,
      "end": 3236.080093383789,
      "text": " safely Ezra says I was ashamed I couldn't do it so you know what Ezra did"
    },
    {
      "id": 40,
      "start": 3236.080093383789,
      "end": 3245.360092163086,
      "text": " fasted and prayed so he did and he besought the Lord God I know that"
    },
    {
      "id": 41,
      "start": 3245.360092163086,
      "end": 3253.2400970458984,
      "text": " you're able I the prayers not recorded for us I'm just using my imagination my"
    },
    {
      "id": 42,
      "start": 3253.2400970458984,
      "end": 3260.4000854492188,
      "text": " imagination as to what he would have prayed think about Psalms I will lift up"
    },
    {
      "id": 43,
      "start": 3260.4000854492188,
      "end": 3265.4000854492188,
      "text": " mine eyes unto the hills from whence cometh my help my help cometh from the"
    },
    {
      "id": 44,
      "start": 3265.4000854492188,
      "end": 3272.360107421875,
      "text": " Lord which made heaven and earth God if you spoke all of this into existence and"
    },
    {
      "id": 45,
      "start": 3272.360107421875,
      "end": 3279.7601013183594,
      "text": " I know you did I believe your record then God this journey is nothing for you"
    },
    {
      "id": 46,
      "start": 3279.7601013183594,
      "end": 3286.6800842285156,
      "text": " it's easy for you to protect me and if you read the passage of Scripture you"
    },
    {
      "id": 47,
      "start": 3286.6800842285156,
      "end": 3292.2001037597656,
      "text": " read in verse number 32 of that passage that the Bible says and we came to"
    },
    {
      "id": 48,
      "start": 3292.2001037597656,
      "end": 3300.120086669922,
      "text": " Jerusalem see in Hebrews chapter number seven these Jewish believers were"
    },
    {
      "id": 49,
      "start": 3300.120086669922,
      "end": 3305.560089111328,
      "text": " struggling the thought of returning to Judaism it just seemed to them it would"
    },
    {
      "id": 50,
      "start": 3305.560089111328,
      "end": 3311.860107421875,
      "text": " make things so much easier and the writer of Hebrew says no we have a"
    },
    {
      "id": 51,
      "start": 3311.860107421875,
      "end": 3321.9600830078125,
      "text": " greater high priest God in flesh the Lord Jesus Christ he is our God he is"
    },
    {
      "id": 52,
      "start": 3321.9600830078125,
      "end": 3327.4801025390625,
      "text": " our priest he's prophet priest and King and he's after the order of Melchizedek"
    },
    {
      "id": 53,
      "start": 3327.4801025390625,
      "end": 3333.0000915527344,
      "text": " and let me show you what he accomplished for us that this Levitical priesthood"
    },
    {
      "id": 54,
      "start": 3333.0000915527344,
      "end": 3338.7601013183594,
      "text": " could never accomplish so why would you want to go back remember what it was"
    },
    {
      "id": 55,
      "start": 3338.7601013183594,
      "end": 3346.2401123046875,
      "text": " that Peter said disciples left Jesus looks to the twelve returns to them and"
    },
    {
      "id": 56,
      "start": 3346.2401123046875,
      "end": 3354.4000854492188,
      "text": " he says will you go away also Peter says to whom shall we go we know that now"
    },
    {
      "id": 57,
      "start": 3354.4000854492188,
      "end": 3360.9201049804688,
      "text": " art the Christ and that thou hast the words of eternal life see we serve a"
    },
    {
      "id": 58,
      "start": 3360.9201049804688,
      "end": 3368.080108642578,
      "text": " great God and we take the truth of God's Word and apply in our lives and let a"
    },
    {
      "id": 59,
      "start": 3368.080108642578,
      "end": 3375.5201110839844,
      "text": " world see how great our God is we're speaking recently as a family I think"
    },
    {
      "id": 60,
      "start": 3375.5201110839844,
      "end": 3380.080108642578,
      "text": " was Holly actually that made the statement speaking about how great our"
    },
    {
      "id": 61,
      "start": 3380.080108642578,
      "end": 3386.0401000976562,
      "text": " God is and some of what she has been reading in her personal devotions she"
    },
    {
      "id": 62,
      "start": 3386.0401000976562,
      "end": 3391.880096435547,
      "text": " said it's a shame that the world doesn't know how great our God is you know whose"
    },
    {
      "id": 63,
      "start": 3391.880096435547,
      "end": 3400.360107421875,
      "text": " job it is it's our job it's our job to declare his greatness the Lord is great"
    },
    {
      "id": 64,
      "start": 3400.360107421875,
      "end": 3406.6800842285156,
      "text": " Psalm 48 great is the Lord and greatly to be praised amen the psalmist says I"
    },
    {
      "id": 65,
      "start": 3406.6800842285156,
      "end": 3414.120086669922,
      "text": " know that my God is great I know he is but then he says this I'm gonna declare"
    },
    {
      "id": 66,
      "start": 3414.120086669922,
      "end": 3419.4400939941406,
      "text": " his greatness why because there's a generation that needs to know just how"
    },
    {
      "id": 67,
      "start": 3419.4400939941406,
      "end": 3425.7200927734375,
      "text": " great our God is we have a great high priest his name is Jesus and he's our"
    },
    {
      "id": 68,
      "start": 3425.7200927734375,
      "end": 3432.360107421875,
      "text": " Savior if you've trusted him you understand what he is to you we have a"
    },
    {
      "id": 69,
      "start": 3432.360107421875,
      "end": 3437.0401000976562,
      "text": " responsibility to take that message to a lost and dying world an unchangeable"
    },
    {
      "id": 70,
      "start": 3437.0401000976562,
      "end": 3444.120086669922,
      "text": " priesthood the writer presents what had been previewed fully the superiority of"
    },
    {
      "id": 71,
      "start": 3444.120086669922,
      "end": 3449.8001098632812,
      "text": " Jesus Christ let us pray father we love you we thank you for loving us we thank"
    },
    {
      "id": 72,
      "start": 3449.8001098632812,
      "end": 3454.2001037597656,
      "text": " you so much for your word the truth contained therein thank you for this"
    },
    {
      "id": 73,
      "start": 3454.2001037597656,
      "end": 3459.7200927734375,
      "text": " passage of Scripture in which it so adequately presents the Lord Jesus"
    },
    {
      "id": 74,
      "start": 3459.7200927734375,
      "end": 3465.0000915527344,
      "text": " Christ is our great high priest not after the Levitical priesthood or the"
    },
    {
      "id": 75,
      "start": 3465.0000915527344,
      "end": 3470.2800903320312,
      "text": " Aaronic priesthood but after the order of Melchizedek and God help us to"
    },
    {
      "id": 76,
      "start": 3470.2800903320312,
      "end": 3476.840087890625,
      "text": " rejoice in who you are your character but also to rejoice in what you've done"
    },
    {
      "id": 77,
      "start": 3476.840087890625,
      "end": 3481.840087890625,
      "text": " for us the fact that you live and that you ever live to make intercession for"
    },
    {
      "id": 78,
      "start": 3481.840087890625,
      "end": 3489.4801025390625,
      "text": " us father if there's one that's present one that's tuned in via livestream"
    },
    {
      "id": 79,
      "start": 3489.4801025390625,
      "end": 3492.60009765625,
      "text": " that's not yet trusted the Lord Jesus Christ of their personal Savior it's"
    },
    {
      "id": 80,
      "start": 3492.60009765625,
      "end": 3497.0401000976562,
      "text": " our prayer that today would be the day of their salvation but they would"
    },
    {
      "id": 81,
      "start": 3497.0401000976562,
      "end": 3503.4000854492188,
      "text": " understand that Jesus is the way the truth in the life no man cometh unto the"
    },
    {
      "id": 82,
      "start": 3503.4000854492188,
      "end": 3510.840087890625,
      "text": " father but by him not by works of righteousness which we have done but"
    },
    {
      "id": 83,
      "start": 3510.840087890625,
      "end": 3517.4401245117188,
      "text": " according to his mercy hath begotten us Lord help us those of us that are saved"
    },
    {
      "id": 84,
      "start": 3517.4401245117188,
      "end": 3523.6801147460938,
      "text": " to go and live our lives as the salt of the earth in the light of the world"
    },
    {
      "id": 85,
      "start": 3523.6801147460938,
      "end": 3531.1201171875,
      "text": " showing the greatness of our God help us Lord I pray in Christ's name would you"
    },
    {
      "id": 86,
      "start": 3531.1201171875,
      "end": 3534.0001220703125,
      "text": " stand with me heads"
    }
  ],
  "processed_at": "2025-04-17T16:45:50.452063"
}