{
  "video_id": "IEGhT2j43Rg",
  "text": "Now for this calendar year, last week was the last Sunday of the first quarter, so today the first Sunday of the second quarter, and we're making way through the book of 2 Corinthians. Our theme for this year, as you see on the banners, God's grace is sufficient. Aren't you thankful for the grace of God? And what a blessing to know that God's grace is sufficient. In the present tense, when you need God's grace, it is sufficient. We have that promise. Of course, as we've gone through the book of 2 Corinthians, we've made progress now in the fifth chapter. We've been in this chapter for several weeks. We find that starting the chapter, the apostle Paul is rejoicing with regard to the certainty of heaven, having confidence that knowing to be absent from the body is to be present with the Lord, and sharing with the church in Corinth that reality and that excitement, but then also the desire that Paul had to labor, to strive, to live a life that was pleasing in the sight of God, knowing that he would one day stand before the Lord Jesus Christ. The reality is that every human being will stand before Christ one day. There are two judgments that God speaks of in His Word. One, for those that have placed their faith and trust in the Lord Jesus Christ, and that is the bema seat of Christ, the judgment seat of Christ, and that's what Paul references here in 2 Corinthians chapter 5. We dealt with it a couple of weeks ago. And then we find that there's the great white throne judgment that is referenced in Revelation chapter number 20, I am thankful because I've been saved by the blood of Christ, not by any works that I could do. It's a gift. It's the gift of God, which is eternal life. It's not temporary life. It's not probationary life. It is eternal life, and He saved my soul. I was undeserving, but because of His grace and because of His love, He saved me, and I will not stand at the great white throne judgment as a subject of that judgment. We find that those that would stand at the great white throne judgment are those that have never trusted the Lord Jesus Christ as their personal Savior. The book of Philippians tells us that every tongue will confess, that every knee will bow that Jesus Christ is Lord, and I've often said about that passage of Scripture that it's not a matter of if, it's a matter of when. Because every tongue is gonna confess, and every knee is going to bow, it's not a matter of if, it's a matter of when, and when makes all the difference. Because if you confess that Jesus is Lord this side of eternity, you will spend eternity with Christ as your Lord and Savior, but if you do not confess Christ as your personal Lord and Savior on this side of eternity, you will spend forever separated from God in a place called the Lake of Fire. Last week we talked about who are we living for? Because of all that He's done for us, who am I living for? The Apostle Paul begins to evaluate his life, and he talks about the love of Christ that constraineth us, and just understanding His love for us, and His sacrifice for us, and what He did on the cross of Calvary, His, of course, death, burial, and resurrection. And Paul says that we should not live for ourselves, but that we should live for Him. And I talked about the struggle, I talked about the conflict that each of us have on a day-by-day basis, and maybe as you went through this past week, day-by-day you had that struggle of who am I living for? Why am I doing the things that I'm doing? Am I living for myself, for pleasure, for whatever it might be that's temporal, or am I living for Jesus? We then come to the verse of Scripture that's our text for this morning, 2 Corinthians 5 and verse number 17, and we're gonna analyze this familiar verse of Scripture. I believe this morning that if we were to go around the room that many of us this morning could probably recite 2 Corinthians 5 and verse number 17, at some point many of us have committed this verse of Scripture to memory. The Bible says, therefore, if any man be in Christ, he is a new creature. Old things are passed away, behold, all things are become new. What a great verse of Scripture. As we think about this verse of Scripture, we find that it summarizes, and I would say beautifully summarizes, what happened on the day that you trusted the Lord Jesus Christ as your personal Savior. On that day, He did a miraculous work in your life. Understand this morning that salvation is the miracle of a moment. Sanctification, on the other hand, is the process of a lifetime. We're positionally sanctified, but practically speaking, the Lord's still working on me. To make me what I ought to be, and it's that process of a lifetime. But the truth of salvation, I'm not becoming saved, I am saved. It's the new birth, it's the miracle of a moment on that day. For me personally, remember, God has no grandchildren, He only has children. You're not going to heaven because your mom and dad are going to heaven, because your grandfather was a preacher, because of any other thing. No, it's a personal relationship that you have with the Lord Jesus Christ, and for me it was on August 31st, 1997, as a 17-year-old senior in high school, I recognized that I was lost, that I was a sinner. It didn't take a lot for me to recognize I'm a sinner. In fact, many people that I talk to today, if I ask them, hey, have you ever sinned? Yes. I've not met many people over the years that have said, no, I'm not a sinner. They acknowledge that they're a sinner. Now many times they'll try to put some type of level on it, well, I've never murdered anyone, something like that, and I say, well, that's a great thing that you've not murdered someone, but the reality is that we're all sinners, and I recognize on that day that it was my sin that separated me from God. The Bible says that we've all come short of the glory of God. The Bible tells us that all have sinned and come short of the glory of God, and I recognize that I was a sinner, but I recognize there was a consequence for my sin, and that's death. For the wages of sin is death, but it's not just physical death, it's spiritual death. It's separation from God for all of eternity in the lake of fire, and I recognize that I needed a Savior, and there was only one Savior, and His name is Jesus. And I recognized, as Jesus said in John 14, I am the way, the truth, and the life. No man cometh unto the Father but by me. Jesus made a great declaration on that day. He did not say, I am a way, He said, I am the way, and it gives to us a great amount of clarity with regard to the way of salvation, that Jesus is the way. Peter and John, who would have heard Jesus make that declaration, are then standing and they're being questioned in the book of Acts because of a great miracle that took place at the gate beautiful and at the temple and all that had transpired, and Peter after spending a night in prison, he stands before the religious leaders and he says this to them, there's no other name under heaven given among men whereby we must be saved. What's he talking about being saved? What's he talking about, what's this idea for whosoever shall call upon the name of the Lord shall be saved? See I recognize on that day, August 31st, 1997, that I was not saved, I was lost, I was dead spiritually. I was very alive physically, but I was dead spiritually. And Jesus was the only Savior, and Jesus offered to me a gift, you know what's interesting about a gift? A gift is something that you can receive or you can reject. A gift is something that can only be given to you as a gift because someone else paid for it, amen? It wouldn't be called a gift if I had to earn it, if I had to work for it, it's called a gift because Jesus, as He hung upon the cross of Calvary, said it is finished. Paid in full literally is what the Greek word means. We find that as Jesus made that declaration that it is finished, paid in full, that He paid with His precious blood for my salvation. Therefore He offers this gift. John chapter 1 says, He came to His own, but His own received Him not. But as many as received Him, to them gave He power to become the sons of God. And I had to recognize on that day in my life personally that I was either going to receive the gift of God, which was eternal life, and He is going to be my Lord and Savior, or I was going to reject that gift, and the reality is that on that day there was great spiritual battle that took place, but thank God we sang the song, Ring the Bells of Heaven. What's the purpose of that song? Well there's rejoicing, why? Because a soul was saved, a soul was converted, and on that day in my life there was rejoicing in heaven, there's rejoicing on earth because I was born again. Jesus said to Nicodemus, when Nicodemus came as a representative of all those religious leaders and he came to Jesus by night and he made his declaration with regard to what they had concluded based on seeing what they had seen at that point, and Jesus said, marvel not that I say unto thee, singularly to Nicodemus, that ye all people must be born again. And Nicodemus says, I don't understand what this thing means to be born again. Can I enter into my mother's womb a second time? I mean it's kind of comical to think about that passage of Scripture and what Nicodemus, he's not understanding. Understanding, but Jesus speaks about a physical birth and a spiritual birth See, I was born July 15th 1980 But I was born again on August 31st 1997 I titled the message this morning Transformation because on that day for me personally and I think that most of us here this morning could stand and give a similar Testimony as to the day that you got saved It was a miracle Work that God did in me. He quickened me. He made me alive Now he's been working on me since that day so that I would be conformed to the image of his dear son So that I would be like Christ, but the reality is that on that day. He saved me. He changed my life It was radical What happened on that day see this morning we think about the gospel the gospel has the power to save Do you believe that this morning? I believe the gospel has the power to say. What is the gospel? Well, very simply from 1st Corinthians 15. It's the death barrel and resurrection That's the gospel the good news of Jesus Christ. We go bearing good news Are there people that don't want it you bet there are I had encounters yesterday. So man, that guy is just grumpy I just said good morning. How are you? I don't want it and I'm like man You don't even know what I'm offering right like come on. I Get it I understand not everyone wants it, but man the gospel has the power to save For I am NOT ashamed of the gospel of Christ For it is the power of God unto salvation to everyone that believeth to the Jew first and also the Greek Oh praise the Lord for the power. He is able Hebrew 7 chapter chapter 7 verse 25 He is able to save them to the uttermost that come to God Listen, he the gospel is powerful. It can save a life It can save a sinner, but I want you to understand that I believe in a gospel that transforms an individual as well Listen, we're not talking about Reformation We're not talking about trying to clean ourselves up We're not talking about trying to do better and I'm gonna it's not by mine own righteousness Here's what Isaiah says. All of our good works are as filthy rags It's not by works of righteousness, which we have done but according to his mercy that he had saved us for by grace We have saved through faith and that not of yourselves It is the gift of God not of works lest any man should boast in fact in the book of Romans as Paul as Paul is speaking there and Giving the illustration in the example going back to history of Abraham He talks about Abraham being justified not by works, but by faith. He says if it's by works, then it's a debt It's something that Abraham was owed God doesn't know us anything But in his great love He wanted to reconcile us to redeem us Listen this morning if you're not here if you're here this morning and you're not saved you've never trusted Christ as your Savior Can I tell you this morning? Today is the day of salvation. In fact in the very next chapter in 2nd Corinthians 6 and verse number 2 the Bible says for he has saith I have heard thee in a time accepted in the day Of salvation have I suckered thee behold now is the accepted time behold now is the day of Salvation If you're not saved this morning if you do not have 100% assurance that heaven is your home today Is the day of your salvation would you trust Christ today? But as we examine this verse of Scripture, I want you to consider with me three thoughts number one the experience of Paul The experience of Paul as Paul is writing these words as he's speaking about therefore if any man be in Christ He is a new creature He says that that behold all he says all old things are passed away Behold all things are become new begin to think about the Apostle Paul under the inspiration of the Holy Spirit of God penning these words and I Believe that as Paul was writing these very words that that his mind would rush back to the day in Which he trusts that Christ is his personal Savior Just as I've had the opportunity to recount for you my experience of trusting Christ as my Savior We find that the Apostle Paul he experienced the trance Transformation in his life. He experienced the power of the gospel personally not to just simply reform but to transform We find that in Paul's life It's Acts chapter number nine turn back if you will and I want you to look at Paul in Acts chapter number nine And as we look at this chapter we really could spend the entirety in Acts 9 this morning and just looking at this experience of Paul and what a great experience it Is and we find that it rehearses for us. It gives us the the account of Paul Traveling on the road to Damascus. He's going according to verses 1 & 2 his name at this point is Saul But notice what the Bible says in Acts 9 in verse number 1 and Saul Yet breathing out threatenings and slaughter against the disciples of the Lord Went unto the high priest and desired of him letters to Damascus to the synagogues But if he found any notice this phrase of this way whether they were men or women he might bring them bound Unto Jerusalem and we find that Saul at this point He was dealing with all that had transpired at the end of chapter 7 We find that a man by the name of Stephen the first martyr of the local church or of the church if you will Was martyred there and he stoned and the Bible tells us that they laid The garments his garments at the feet of Saul and we find that Saul I believe he was dealing with great level of conviction why because he saw Stephen as It were his countenance as an angel He heard Stephen utter similar words to what Jesus had uttered when he was on the cross Jesus said father forgive them for they know not what they do We find that Stephen uttered similar words We find that that Saul was under great conviction and what do we do when we're under conviction? well, we either submit or we really get angry about it and Saul is angry and I mean his level of Attacking the church and all that was going on with the persecution reaches its highest point at the start of Acts chapter number 9 And we find that he's on the way to Damascus then verse number 4 The Bible says that he was journeying in verse 3 in verse 4 He had heard this this light this let me read verse 3 and as he journeyed he came near Damascus and suddenly there shined round about him a light from heaven and He saw fell to the earth and heard a voice saying unto him Saul Why persecute us thou me? And he saw said who art thou Lord? The Lord said I am Jesus whom thou persecute est It is hard for thee to kick against the pricks that conviction that he was dealing with That that imagery that is used here of kicking against the pricks and how they would use them to move Livestock and all that they would do and he says listen God saying you're under great conviction It's hard for thee to kick against the pricks in verse number 6 The the Bible says that he was trembling and astonished and said Lord What wilt thou have me to do and the Lord said unto him arise and go into the city and it shall be told thee What thou must do in this passage of Scripture we find that Paul Experienced what we're speaking of in 2nd Corinthians 5 in verse number 17. He was radically changed He was not the same man. He no longer was the same he had experienced the power of the gospel He'd experienced not only now was he gonna go to heaven when he died because he had accepted the Lord as a Savior But we find that his life would forever be changed We find that as the Apostle Paul as we refer to him as here he's he's blinded and of course we understand as you go through the passage that there was a Disciple by the name of Ananias that God directed to go and speak to to him to Saul and he comes and he says brother Saul what a great What a great reference To now this man who had been known as the persecutor that Ananias is now saying brother Saul And I want you to notice in verse number 20 of Acts chapter number 9 I'll read verse 19 with it The Bible says in verse 19 of Acts 9 and when he'd received me He was strengthened then with Saul certain days with the disciples, which were at Damascus and notice verse 20 and straightway He preached Christ in the synagogues that he is the Son of God What a transformation. I mean what an experience that Paul had I understand his name is still Saul here in Acts 9 but I want you to see in his life if you were to read verse 1 and verse 2 and you were to skip verse 3 Through verse 18 and just pick it up in verse 19. It would make zero sense Because the purpose of him going to the synagogue was so that he could arrest people and bind them and take them to Jerusalem He was persecuting but in verse number 20 He's now preaching in the synagogue that Jesus is the Christ the Messiah the promised one God in flesh If you don't read the middle verses you have no idea what happened to this guy but when you read the middle verses you find out he met Jesus and Jesus changed his life He experienced in his life what he's writing about to the church in Corinth Therefore if any man be in Christ, he is a new creature and I think Think about Paul thinking back to his life before he was a Christian. I wonder this morning, I think about my life. I was 17 when I got saved by the grace of God, and I can remember prior to being 17 years old, I can remember what my goals and ambitions and desires were. I can remember how God changed me. The power of the gospel. Praise the Lord. That's what Paul experienced. Notice in the book of Galatians, if you will, and Paul is writing, Galatians chapter 1, he's writing back to the churches in the region of Galatia. And as he's writing back, and it's an interesting thing because this is the first region that Paul went to on that first missionary journey. God saved him, and God called him, and then God used him, and Paul ends up in the region of Galatia. He's preaching. There are churches, four of them, that are, as he goes into these four cities in the region of Galatia, these churches that are established, and now he's writing back to them. And I want you to notice the end of chapter 1, the Bible says this, in verse number 23, verse 22, it says, and was unknown by face unto the churches of Judea which were in Christ. Paul was unknown to them, but notice in verse 23, but they had heard only, listen to what they heard, that he which persecuted us in times past now preacheth the faith which once he destroyed, and they glorified God in me. You know what they heard? They heard that that man got saved. And he once persecuted, but now he's preaching. Praise the Lord. And because of what they heard, the Bible says they glorified God in me. You know what they were doing? They were thanking God for the power of the gospel. They were thanking God for the conversion of this individual. We begin to think about in our own lives those that God might allow us the opportunity to see saved and to see how their lives have been changed, and yes, their eternal destination is changed in a moment, but their lives are radically changed by the gospel. We believe a gospel that saves a sinner, but we believe a gospel that transforms a man. This morning as we look at the text, we note the experience of Paul, but back in 2 Corinthians chapter number 5, I want you to notice number 2, the expectation of Paul. I believe that Paul had an expectation. He had experienced personally, but I believe that he had an expectation. You know what that expectation was? He expected that those that got saved were radically different. He expected that those that trust at Christ as their personal Savior had that same transformation that he had experienced. He believed, he expected that these individuals, because he says, therefore, if any man, Paul's not just saying that this was my experience because I was something special, because I received some special grace. No, the gospel that saved me is the same gospel that saves you, and the gospel that transformed me is the gospel that I expect to transform you. Does that make sense? We find that as the Apostle Paul is writing this church in Corinth, we know some things about the church in Corinth. They're a church that's carnal. They're a church that's divided. They're a church that they're dealing with some of this, you know, yes, we're going to keep some of those old ways, if you will, but Paul says old things are passed away, and behold, all things are become new. And Paul had this expectation that the same God who transformed my life is the same God that's going to transform your life. You ever hear somebody say something like this? They see somebody that got saved, and they say, now, they really got saved. And some of the old preachers would kind of talk that way. They'd get real deep in their voice, and they kind of lean over the pulpit and say, man, they got saved. Listen, what were they trying to communicate by saying that? Well, man, look at their life. Look at what... But I want you to understand that every single person that gets saved ought to have that same level of experience that they got saved. Why? Because I'm a new creature. I'm a new creature. I have a new identity. After that day in my life on August 31st, 1997, I was no longer my own. I was bought with a price. By the way, I was never really my own. I was a child of the devil, according to John chapter number eight. Now, I didn't think I was. I didn't know what that meant. It's not like I worshiped the devil, but I was lost. And the reality is that as we look at this truth this morning that Paul had this expectation, because I had a new identity, I think about our identity in Christ, I think about us as individuals. What do we say? How do we do? Hey, I'm a Christian. That's the first thing that identifies us. Why? Because I'm in Christ. I'm a new creature. I've been radically changed. And Paul had this expectation as Paul went forth and preached the gospel, as Paul went to new regions, and he would use that phrase, to the regions beyond you, as Paul would go into a new city as he would preach the gospel, he expected that the gospel would have an impact on individuals. He expected that they would not be the same. Listen, can I explain to you this morning maybe this way? The truth of salvation is not just taking Jesus and adding him to your shelf. No. It's not salvation. Salvation is not, okay, yeah, I'll just believe Jesus, that's great. Oh, you know what? I'm going to go to heaven when I die. No, no, no. No, no, no. It's transformation. I don't work for it. There's nothing I could do to earn it. But when a man is saved, he is radically different. We sing the song with the young people. The things I used to do, I don't do them anymore. Why? There's been a great change since I've been born again. The places I used to go, I don't go there anymore. I mean, you can go on different verse after different verse after different verse that we sing with the kids in Sunday school and junior church and vacation Bible school, and the reality is we try to teach those little kids and the reality is that we need to be reminded this morning that I am a new creature. I shouldn't think the same way. Be not conformed to this world, but be transformed by the renewing of your mind that you may prove what is that good and acceptable and perfect will of God. Listen, I'm a new creature. I'm not the same. If you've ever read our website bio, I put on there that God turned my life right side up. It was radical. All of a sudden as a senior in high school, having various plans and ideas of what I would do with my life, all of a sudden it was more about what God wanted with my life than what I wanted with my life. Why? Because there's a radical change. And I don't know this morning what your experience was, but I understand the expectation that Paul has. He expected that those that were born again, those that were in Christ were transformed by the power of the gospel, that they were new creatures, that those old things were passed away, that all things are become new. Does it mean that we become perfect at the day of salvation? No, not even close, because we understand that Ephesians and Colossians, both of those letters deal with that process of what we would call in the book of Galatians of walking in the Spirit. And what do they explain in Ephesians and in Colossians? There's some things that we're to put off, and there's some things we're to put on. And we're to walk in the Spirit so that we would not fulfill the lust of the flesh. It doesn't mean that my flesh or your flesh doesn't have those desires anymore. It simply means that there's a greater one that lives within us, the Holy Spirit of God now indwells me. And we find that there's this expectation that Paul has. And I wonder this morning, as we look at this verse, and I wonder about these folks in Corinth that as they receive this, and they begin to evaluate their own lives, because no doubt the Apostle Paul, when he's penning the words, would be reminded of his own personal experience. But he expected that this would be the case for those that have been saved. I don't know about you, but for me, the Holy Spirit, and I know for everyone that's truly born again, the Bible tells us the Holy Spirit lives within us. Amen? Is that what the Bible teaches us? At the moment of salvation, the Holy Spirit is the earnest of our inheritance. We are sealed in the day of redemption with the Holy Spirit. So the Holy Spirit of God lives within me. On that day that I got saved, He indwelled me. And you know what the Holy Spirit does? Man, He convicts us. Yes, He comforts us as well, but the Holy Spirit of God, He convicts us. And there were things that maybe I didn't even know a Bible verse yet. I had not heard the preaching yet. I was a babe in Christ. I desired to grow, but the Holy Spirit of God would convict me about certain things. You shouldn't be doing these things anymore. Why? Because you're a Christian. You're saved. You're a new creature. And it's amazing the work of the Holy Spirit, but here's the problem. For some, as we grow in our faith, as we kind of, I hate to even use the expression, but I think it's valid, there are times in which sometimes we get over our salvation. We ought never get over our salvation. We ought never get over the fact that God saved us. But I fear for some, it's as if they just kind of get over it. And they've learned how to quench and to grieve the Holy Spirit of God. They no longer are hearing the still small voice. See, Paul had this expectation. He writes about it in the book of Philemon. Turn over, if you will, quickly. It's only one chapter in the book of Philemon, but we find in the book of Philemon the Apostle Paul is writing about an individual. The individual that he's writing about is a man by the name of Onesimus. Onesimus has this testimony as you read in the book of Philemon, and it's only 25 verses. It's a short book, just one chapter. And Paul is writing to Philemon, and specifically about Onesimus. And I want you to notice what Paul says. Beginning in verse number 10, the Bible says this, I beseech thee for my son Onesimus. Now, was this guy Onesimus Paul's biological son? No. Paul refers to Timothy as his son in the faith. He refers to Titus as his son in the faith. And here he refers to Onesimus as my son. Was he referring to someone that God allowed him, Paul, to lead to Christ that was born again? And we find that Paul is writing to Philemon. See, Philemon, Onesimus had been a slave, and Onesimus had fled. Philemon was his master. Paul writes to Philemon, and he says, I beseech thee for my son Onesimus, notice, whom I have begotten in my bonds. Paul was in prison, but he was still preaching the gospel. Why? Because he knew the power of the gospel. He knew he'd have been saved by the grace of God, and he knew he'd have been given to him the ministry of reconciliation. And he's preaching the gospel, and he says that this man, Onesimus, he got saved while I was in bonds. And notice in verse number 11, which, notice these words, in time past was to thee, Philemon, unprofitable, but now profitable to thee, Philemon, and to me, Paul. Now, notice these two phrases. I highlighted them as I read verse number 11. I have them underlined in my Bible. But notice the contrast between in time past, but now. In time past, he's unprofitable, but now he's profitable. What happened? Did he go to school? Did he get an education? No, what happened was he got saved by the grace of God. He'd been born again. He was a new creature. And Paul says, this guy, Onesimus, my son, Onesimus, he was begotten. He was born again while I was in bonds, and he was to thee unprofitable, but now he's profitable. Why? Because he's been saved. He's not the same guy anymore. He's been transformed. Amen? So Paul has an experience. Paul has an expectation. This morning, as we look at this verse of Scripture, 2 Corinthians 5 and verse 17, Therefore, if any man be in Christ, he is a new creature. All things are passed away. Behold, all things are become new. Often as I share the gospel with individuals, I will say something to them like this when I come to Romans 10 and verse 13. For whosoever, and I'll say this, Ron, I'll say you can put your name right there. For whosoever, that means anyone. So maybe we can read the verse this way. For if Tim shall call upon the name of the Lord, Tim shall be saved. Because Tim is a whosoever. Amen? And I'm a whosoever. And you're a whosoever. And for whosoever shall call upon the name of the Lord shall be saved. Hallelujah. As we wrap up the message this morning, we see the experience of Paul. We see the expectation of Paul. Number three, I want you to consider this thought, the evidence in my life. The evidence in my life. I want you to put your name there where it says, if any man be in Christ. The same way we would do with Romans 10 and verse 13. We're trying to lead somebody to Christ and tell them that Christ will save them. He is able. If any man be in Christ. And put your name right there where it says any man. And if you've trusted Christ as your Savior, if you were that whosoever in Romans 10, 13 that recognized, I can't get to heaven on my own. I recognize that Jesus is the only way. Maybe you're here this morning and you've been trying to live some type of religious life. You've been like Nicodemus. He was a ruler of the Jews. He was religious. But religion never saved a man. You say, but I'm seeking to keep the law. I had a conversation with someone about two months ago. They said, well, you know, we're just working to keep the law. In the very moment that they were telling me they were working to keep the law, you know what they were doing? Breaking the law. They didn't even know it. But they were breaking the law. When they were telling me that they're seeking to keep the law. You know what the law does? It condemns. The law can't save you. You know what the law does? It points you to the only one that can. Jesus Christ. And this morning, if you're not saved, you need to insert your name in that Romans 10, 13. For whosoever shall call upon the name of the Lord shall be saved. Religion won't save you. Good works won't save you. They can't. In fact, in the same book, in the book of Galatians, Paul said it this way. If righteousness were obtained by the law, then Christ is dead and vain. Listen, my Jesus did not die in vain. He died because it was the only way for humanity to be saved. There's no other way. No other way. Jesus had to go to that cross. And I'm glad he did. He went willingly. He said it this way. I lay down my life for the sheep. And I taketh it up again. Hallelujah, we serve a risen Savior. But this morning, if you've been saved, and you've already trusted Christ as your Savior, I want you to think about the evidence in your life from Romans, or from 2 Corinthians 5 and verse 17. And I want you to put your name there. Therefore, if Chris, that's my name, because it says if any man, any individual, if Chris be in Christ, if I've been saved, he is a new creature. Old things are passed away. Behold, all things are become new. What's the evidence of salvation in my life? What's the evidence of salvation in your life? See, because the gospel not only saves a man, but the gospel transforms a man. And we find that Paul is giving his experience. He's sharing what his expectation is. But then for the recipients of this verse of Scripture, for us today, as we would evaluate or examine, what's the evidence point to? What does the evidence point to? Because if you're in Christ, if you're saved this morning, you're a new creature. That's what the Bible says. It's not just adding another little G-O-D, God, to your list of, no, Jesus Christ is the only Savior. How has it changed our lives, the gospel? What transformation has taken place in your life, in my life? Has it changed our behavior? The things I used to do, I don't do them anymore. Has it changed our thoughts? Has it changed our attitude? Has it changed our perspective? Has it changed our speech? Has it changed my pursuits in life? Has it changed... Listen, I understand that it's on the inside, but what's on the inside comes out on the outside. Amen? Has it changed what I value? Has it changed how I live my life? Listen, this morning, before I was ever a pastor, I've been pastor now for almost 14 years here at this church, and I thank God for it. But I've been saved for a lot longer than 14 years. I've been pastoring here for 14 years, but you know what? From the time I got saved, you know what? I was in church all the time after I got saved. Before I got saved, Ron, I never went to church. I didn't want to go to church. Why? There was nothing for me there. I was lost. I was dead. There was no desire in me to be in church as a lost person. But after I got saved, man, Sunday school, Sunday morning, Sunday night, Wednesday night, revival meetings, missions conference, bring it on. Amen? And so much the more, as you see the day approaching, I love to be with the people of God. But that's not just because I'm a pastor. It's because I'm a Christian. Because long before I ever became a pastor, you know what I did? I went to church. Because we're the saints of God gathered together. The church is a body of believers. Listen, what do I value in life? How do I spend my time? How do I spend my treasure? How do I use my talents? It's all changed because I've been saved and I'm a new creature. And I wonder this morning, have you had that same experience that Paul had? Can you evaluate your life? Can you see evidence? in your life of this change. If any man be in Christ, he is a new creature. I can look at my life pre-salvation and post-salvation and I can see a radical change. I'm not perfect. God's still working on me. And by the way, before you get too holy, you're not perfect either. Amen? Right? Can I get an amen? Come on. None of us are. But one day, this mortal shall put on immortality. This corruption shall put on incorruption. Amen? That's going to be a radical change when I get to heaven. And what a day that will be. It's on the front of our bulletin this week. What a day that will be when my Jesus I shall see. But I'm asking you this morning, how's your life? Has it been radically changed because of the gospel? You're just kind of like, you know what? I'm saved. I'm going to heaven. I'm still living for myself. I'm still doing my own thing. I still… No, listen. The gospel transforms an individual. I'm not trying to talk anybody out of being saved this morning. But if I could talk you out of being saved, you better examine yourself. I'm not kept by my works. I'm kept by God. I'm not kept by my works. But according to Ephesians 2, 8, 9, and then 10, we are His workmanship in Christ Jesus and we are ordained to good works. Titus talks about, many times, about good works. These works don't save me. These works don't keep me saved. But they are a result of this transformation that's in Christ. Paul says, therefore, if any man be in Christ, he is a new creature. Old things are passed away. Behold, all things are become new. Have you experienced the transformation of the gospel? I hope this morning that you can look at your life the same way I could look at my life, the same way Paul could look at his life. And so, you know what? Prior to that day that I was traveling to Damascus with those letters giving me the ability to take captive those that were Christians, to imprison them, prior to that day and after that day, my life was radically different because Jesus changed my life. If you're not saved this morning, today is the day of salvation. He wants to save you. And after He saves us, He wants us to be conformed to the image of His dear Son. That we be like Jesus. Amen? Romans 8, verse 29, it speaks about that. That we are to be like Christ. It's a great work that God does in our lives. This morning, evaluate your life. Has there been a great change in my life? Could people see it? You meet somebody that you knew prior to being saved and then you run into them now and they're like, whoa, what happened to you? I got saved. God changed my life. I'm a new creature. Praise the Lord. Let's pray together. Father, we love You. We thank You for loving us. We thank You for the power of the Gospel. Thank You for saving my soul. Thank You for changing my life. Thank You for the testimony of the Apostle Paul. Lord, I pray that You would help us this morning. If there's one that's not saved, God, I pray they'd come to this old-fashioned altar. We'd have an opportunity to share the Gospel with them. They'd be saved by the grace of God. For every child of God in this building today, Lord, I pray that we'd evaluate our lives. I pray that not one of us have gotten over our salvation, but maybe it'd be true of someone here. They're just kind of going through the motions, so to speak. God, I pray that You'd help us to allow You to have Your will in way, that those changes would be evidenced in our lives, proofs of salvation, proofs of being a new creature. In this time of invitation, would You have Your will in way? We give You the glory for all that You'll do. For it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.0,
      "text": " Now for this calendar year, last week was the last Sunday of the first quarter, so today"
    },
    {
      "id": 1,
      "start": 7.0,
      "end": 11.079999923706055,
      "text": " the first Sunday of the second quarter, and we're making way through the book of 2 Corinthians."
    },
    {
      "id": 2,
      "start": 11.079999923706055,
      "end": 15.640000343322754,
      "text": " Our theme for this year, as you see on the banners, God's grace is sufficient."
    },
    {
      "id": 3,
      "start": 15.640000343322754,
      "end": 18.68000030517578,
      "text": " Aren't you thankful for the grace of God?"
    },
    {
      "id": 4,
      "start": 18.68000030517578,
      "end": 22.84000015258789,
      "text": " And what a blessing to know that God's grace is sufficient."
    },
    {
      "id": 5,
      "start": 22.84000015258789,
      "end": 25.920000076293945,
      "text": " In the present tense, when you need God's grace, it is sufficient."
    },
    {
      "id": 6,
      "start": 25.920000076293945,
      "end": 26.920000076293945,
      "text": " We have that promise."
    },
    {
      "id": 7,
      "start": 27.600000381469727,
      "end": 32.08000183105469,
      "text": " Of course, as we've gone through the book of 2 Corinthians, we've made progress now"
    },
    {
      "id": 8,
      "start": 32.08000183105469,
      "end": 33.36000061035156,
      "text": " in the fifth chapter."
    },
    {
      "id": 9,
      "start": 33.36000061035156,
      "end": 35.02000045776367,
      "text": " We've been in this chapter for several weeks."
    },
    {
      "id": 10,
      "start": 35.02000045776367,
      "end": 41.0,
      "text": " We find that starting the chapter, the apostle Paul is rejoicing with regard to the certainty"
    },
    {
      "id": 11,
      "start": 41.0,
      "end": 46.720001220703125,
      "text": " of heaven, having confidence that knowing to be absent from the body is to be present"
    },
    {
      "id": 12,
      "start": 46.720001220703125,
      "end": 53.31999969482422,
      "text": " with the Lord, and sharing with the church in Corinth that reality and that excitement,"
    },
    {
      "id": 13,
      "start": 53.31999969482422,
      "end": 60.400001525878906,
      "text": " but then also the desire that Paul had to labor, to strive, to live a life that was"
    },
    {
      "id": 14,
      "start": 60.400001525878906,
      "end": 66.36000061035156,
      "text": " pleasing in the sight of God, knowing that he would one day stand before the Lord Jesus"
    },
    {
      "id": 15,
      "start": 66.36000061035156,
      "end": 67.36000061035156,
      "text": " Christ."
    },
    {
      "id": 16,
      "start": 67.36000061035156,
      "end": 72.77999877929688,
      "text": " The reality is that every human being will stand before Christ one day."
    },
    {
      "id": 17,
      "start": 72.77999877929688,
      "end": 77.5199966430664,
      "text": " There are two judgments that God speaks of in His Word."
    },
    {
      "id": 18,
      "start": 77.5199966430664,
      "end": 82.31999969482422,
      "text": " One, for those that have placed their faith and trust in the Lord Jesus Christ, and that"
    },
    {
      "id": 19,
      "start": 82.31999969482422,
      "end": 86.83999633789062,
      "text": " is the bema seat of Christ, the judgment seat of Christ, and that's what Paul references"
    },
    {
      "id": 20,
      "start": 86.83999633789062,
      "end": 89.44000244140625,
      "text": " here in 2 Corinthians chapter 5."
    },
    {
      "id": 21,
      "start": 89.44000244140625,
      "end": 91.5199966430664,
      "text": " We dealt with it a couple of weeks ago."
    },
    {
      "id": 22,
      "start": 91.5199966430664,
      "end": 96.04000091552734,
      "text": " And then we find that there's the great white throne judgment that is referenced in Revelation"
    },
    {
      "id": 23,
      "start": 96.04000091552734,
      "end": 101.4000015258789,
      "text": " chapter number 20, I am thankful because I've been saved by the blood of Christ, not by"
    },
    {
      "id": 24,
      "start": 101.4000015258789,
      "end": 103.73999786376953,
      "text": " any works that I could do."
    },
    {
      "id": 25,
      "start": 103.73999786376953,
      "end": 104.73999786376953,
      "text": " It's a gift."
    },
    {
      "id": 26,
      "start": 104.73999786376953,
      "end": 107.04000091552734,
      "text": " It's the gift of God, which is eternal life."
    },
    {
      "id": 27,
      "start": 107.04000091552734,
      "end": 108.26000213623047,
      "text": " It's not temporary life."
    },
    {
      "id": 28,
      "start": 108.26000213623047,
      "end": 109.91999816894531,
      "text": " It's not probationary life."
    },
    {
      "id": 29,
      "start": 109.91999816894531,
      "end": 112.87999725341797,
      "text": " It is eternal life, and He saved my soul."
    },
    {
      "id": 30,
      "start": 112.87999725341797,
      "end": 118.27999877929688,
      "text": " I was undeserving, but because of His grace and because of His love, He saved me, and"
    },
    {
      "id": 31,
      "start": 118.27999877929688,
      "end": 123.66000366210938,
      "text": " I will not stand at the great white throne judgment as a subject of that judgment."
    },
    {
      "id": 32,
      "start": 123.66000366210938,
      "end": 127.04000091552734,
      "text": " We find that those that would stand at the great white throne judgment are those that"
    },
    {
      "id": 33,
      "start": 127.04000091552734,
      "end": 131.39999389648438,
      "text": " have never trusted the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 34,
      "start": 131.39999389648438,
      "end": 136.13999938964844,
      "text": " The book of Philippians tells us that every tongue will confess, that every knee will"
    },
    {
      "id": 35,
      "start": 136.13999938964844,
      "end": 142.33999633789062,
      "text": " bow that Jesus Christ is Lord, and I've often said about that passage of Scripture that"
    },
    {
      "id": 36,
      "start": 142.33999633789062,
      "end": 147.3800048828125,
      "text": " it's not a matter of if, it's a matter of when."
    },
    {
      "id": 37,
      "start": 147.3800048828125,
      "end": 151.22000122070312,
      "text": " Because every tongue is gonna confess, and every knee is going to bow, it's not a matter"
    },
    {
      "id": 38,
      "start": 151.22000122070312,
      "end": 156.25999450683594,
      "text": " of if, it's a matter of when, and when makes all the difference."
    },
    {
      "id": 39,
      "start": 156.25999450683594,
      "end": 161.97999572753906,
      "text": " Because if you confess that Jesus is Lord this side of eternity, you will spend eternity"
    },
    {
      "id": 40,
      "start": 162.13999938964844,
      "end": 167.33999633789062,
      "text": " with Christ as your Lord and Savior, but if you do not confess Christ as your personal"
    },
    {
      "id": 41,
      "start": 167.33999633789062,
      "end": 172.22000122070312,
      "text": " Lord and Savior on this side of eternity, you will spend forever separated from God"
    },
    {
      "id": 42,
      "start": 172.22000122070312,
      "end": 174.94000244140625,
      "text": " in a place called the Lake of Fire."
    },
    {
      "id": 43,
      "start": 174.94000244140625,
      "end": 177.0399932861328,
      "text": " Last week we talked about who are we living for?"
    },
    {
      "id": 44,
      "start": 177.0399932861328,
      "end": 181.5399932861328,
      "text": " Because of all that He's done for us, who am I living for?"
    },
    {
      "id": 45,
      "start": 181.5399932861328,
      "end": 186.82000732421875,
      "text": " The Apostle Paul begins to evaluate his life, and he talks about the love of Christ that"
    },
    {
      "id": 46,
      "start": 186.82000732421875,
      "end": 192.17999267578125,
      "text": " constraineth us, and just understanding His love for us, and His sacrifice for us, and"
    },
    {
      "id": 47,
      "start": 192.17999267578125,
      "end": 197.13999938964844,
      "text": " what He did on the cross of Calvary, His, of course, death, burial, and resurrection."
    },
    {
      "id": 48,
      "start": 197.13999938964844,
      "end": 202.27999877929688,
      "text": " And Paul says that we should not live for ourselves, but that we should live for Him."
    },
    {
      "id": 49,
      "start": 202.27999877929688,
      "end": 206.66000366210938,
      "text": " And I talked about the struggle, I talked about the conflict that each of us have on"
    },
    {
      "id": 50,
      "start": 206.66000366210938,
      "end": 211.89999389648438,
      "text": " a day-by-day basis, and maybe as you went through this past week, day-by-day you had"
    },
    {
      "id": 51,
      "start": 211.89999389648438,
      "end": 214.74000549316406,
      "text": " that struggle of who am I living for?"
    },
    {
      "id": 52,
      "start": 214.74000549316406,
      "end": 217.22000122070312,
      "text": " Why am I doing the things that I'm doing?"
    },
    {
      "id": 53,
      "start": 217.22000122070312,
      "end": 223.13999938964844,
      "text": " Am I living for myself, for pleasure, for whatever it might be that's temporal, or am"
    },
    {
      "id": 54,
      "start": 223.13999938964844,
      "end": 226.02000427246094,
      "text": " I living for Jesus?"
    },
    {
      "id": 55,
      "start": 226.02000427246094,
      "end": 230.89999389648438,
      "text": " We then come to the verse of Scripture that's our text for this morning, 2 Corinthians 5"
    },
    {
      "id": 56,
      "start": 230.89999389648438,
      "end": 234.94000244140625,
      "text": " and verse number 17, and we're gonna analyze this familiar verse of Scripture."
    },
    {
      "id": 57,
      "start": 234.94000244140625,
      "end": 238.5800018310547,
      "text": " I believe this morning that if we were to go around the room that many of us this morning"
    },
    {
      "id": 58,
      "start": 238.5800018310547,
      "end": 244.94000244140625,
      "text": " could probably recite 2 Corinthians 5 and verse number 17, at some point many of us"
    },
    {
      "id": 59,
      "start": 244.94000244140625,
      "end": 248.6199951171875,
      "text": " have committed this verse of Scripture to memory."
    },
    {
      "id": 60,
      "start": 248.6199951171875,
      "end": 256.29998779296875,
      "text": " The Bible says, therefore, if any man be in Christ, he is a new creature."
    },
    {
      "id": 61,
      "start": 256.29998779296875,
      "end": 262.5799865722656,
      "text": " Old things are passed away, behold, all things are become new."
    },
    {
      "id": 62,
      "start": 262.5799865722656,
      "end": 264.79998779296875,
      "text": " What a great verse of Scripture."
    },
    {
      "id": 63,
      "start": 264.79998779296875,
      "end": 269.239990234375,
      "text": " As we think about this verse of Scripture, we find that it summarizes, and I would say"
    },
    {
      "id": 64,
      "start": 269.239990234375,
      "end": 274.760009765625,
      "text": " beautifully summarizes, what happened on the day that you trusted the Lord Jesus Christ"
    },
    {
      "id": 65,
      "start": 274.760009765625,
      "end": 276.3599853515625,
      "text": " as your personal Savior."
    },
    {
      "id": 66,
      "start": 276.3599853515625,
      "end": 280.9200134277344,
      "text": " On that day, He did a miraculous work in your life."
    },
    {
      "id": 67,
      "start": 280.9200134277344,
      "end": 283.9200134277344,
      "text": " Understand this morning that salvation is the miracle of a moment."
    },
    {
      "id": 68,
      "start": 283.9200134277344,
      "end": 288.7200012207031,
      "text": " Sanctification, on the other hand, is the process of a lifetime."
    },
    {
      "id": 69,
      "start": 288.7200012207031,
      "end": 294.6000061035156,
      "text": " We're positionally sanctified, but practically speaking, the Lord's still working on me."
    },
    {
      "id": 70,
      "start": 294.6000061035156,
      "end": 299.0799865722656,
      "text": " To make me what I ought to be, and it's that process of a lifetime."
    },
    {
      "id": 71,
      "start": 299.0799865722656,
      "end": 303.8800048828125,
      "text": " But the truth of salvation, I'm not becoming saved, I am saved."
    },
    {
      "id": 72,
      "start": 303.8800048828125,
      "end": 308.0,
      "text": " It's the new birth, it's the miracle of a moment on that day."
    },
    {
      "id": 73,
      "start": 308.0,
      "end": 313.20001220703125,
      "text": " For me personally, remember, God has no grandchildren, He only has children."
    },
    {
      "id": 74,
      "start": 313.20001220703125,
      "end": 316.6400146484375,
      "text": " You're not going to heaven because your mom and dad are going to heaven, because your"
    },
    {
      "id": 75,
      "start": 316.6400146484375,
      "end": 319.239990234375,
      "text": " grandfather was a preacher, because of any other thing."
    },
    {
      "id": 76,
      "start": 319.239990234375,
      "end": 324.0,
      "text": " No, it's a personal relationship that you have with the Lord Jesus Christ, and for me"
    },
    {
      "id": 77,
      "start": 324.3999938964844,
      "end": 331.0799865722656,
      "text": " it was on August 31st, 1997, as a 17-year-old senior in high school, I recognized that I"
    },
    {
      "id": 78,
      "start": 331.0799865722656,
      "end": 333.2799987792969,
      "text": " was lost, that I was a sinner."
    },
    {
      "id": 79,
      "start": 333.2799987792969,
      "end": 335.760009765625,
      "text": " It didn't take a lot for me to recognize I'm a sinner."
    },
    {
      "id": 80,
      "start": 335.760009765625,
      "end": 341.0,
      "text": " In fact, many people that I talk to today, if I ask them, hey, have you ever sinned?"
    },
    {
      "id": 81,
      "start": 341.0,
      "end": 342.3599853515625,
      "text": " Yes."
    },
    {
      "id": 82,
      "start": 342.3599853515625,
      "end": 347.1600036621094,
      "text": " I've not met many people over the years that have said, no, I'm not a sinner."
    },
    {
      "id": 83,
      "start": 347.1600036621094,
      "end": 348.55999755859375,
      "text": " They acknowledge that they're a sinner."
    },
    {
      "id": 84,
      "start": 348.55999755859375,
      "end": 352.8800048828125,
      "text": " Now many times they'll try to put some type of level on it, well, I've never murdered"
    },
    {
      "id": 85,
      "start": 352.8800048828125,
      "end": 356.32000732421875,
      "text": " anyone, something like that, and I say, well, that's a great thing that you've not murdered"
    },
    {
      "id": 86,
      "start": 356.32000732421875,
      "end": 361.6400146484375,
      "text": " someone, but the reality is that we're all sinners, and I recognize on that day that"
    },
    {
      "id": 87,
      "start": 361.6400146484375,
      "end": 365.7200012207031,
      "text": " it was my sin that separated me from God."
    },
    {
      "id": 88,
      "start": 365.7200012207031,
      "end": 368.3599853515625,
      "text": " The Bible says that we've all come short of the glory of God."
    },
    {
      "id": 89,
      "start": 368.3599853515625,
      "end": 372.9200134277344,
      "text": " The Bible tells us that all have sinned and come short of the glory of God, and I recognize"
    },
    {
      "id": 90,
      "start": 372.9200134277344,
      "end": 378.2799987792969,
      "text": " that I was a sinner, but I recognize there was a consequence for my sin, and that's death."
    },
    {
      "id": 91,
      "start": 378.2799987792969,
      "end": 383.6400146484375,
      "text": " For the wages of sin is death, but it's not just physical death, it's spiritual death."
    },
    {
      "id": 92,
      "start": 383.6400146484375,
      "end": 389.3599853515625,
      "text": " It's separation from God for all of eternity in the lake of fire, and I recognize that"
    },
    {
      "id": 93,
      "start": 389.3599853515625,
      "end": 394.8800048828125,
      "text": " I needed a Savior, and there was only one Savior, and His name is Jesus."
    },
    {
      "id": 94,
      "start": 394.8800048828125,
      "end": 401.3599853515625,
      "text": " And I recognized, as Jesus said in John 14, I am the way, the truth, and the life."
    },
    {
      "id": 95,
      "start": 401.3599853515625,
      "end": 404.6400146484375,
      "text": " No man cometh unto the Father but by me."
    },
    {
      "id": 96,
      "start": 404.6400146484375,
      "end": 407.3999938964844,
      "text": " Jesus made a great declaration on that day."
    },
    {
      "id": 97,
      "start": 407.5199890136719,
      "end": 413.6400146484375,
      "text": " He did not say, I am a way, He said, I am the way, and it gives to us a great amount"
    },
    {
      "id": 98,
      "start": 413.6400146484375,
      "end": 419.20001220703125,
      "text": " of clarity with regard to the way of salvation, that Jesus is the way."
    },
    {
      "id": 99,
      "start": 419.20001220703125,
      "end": 424.0400085449219,
      "text": " Peter and John, who would have heard Jesus make that declaration, are then standing and"
    },
    {
      "id": 100,
      "start": 424.0400085449219,
      "end": 428.0400085449219,
      "text": " they're being questioned in the book of Acts because of a great miracle that took place"
    },
    {
      "id": 101,
      "start": 428.0400085449219,
      "end": 433.8800048828125,
      "text": " at the gate beautiful and at the temple and all that had transpired, and Peter after spending"
    },
    {
      "id": 102,
      "start": 433.8800048828125,
      "end": 438.8800048828125,
      "text": " a night in prison, he stands before the religious leaders and he says this to them, there's"
    },
    {
      "id": 103,
      "start": 438.8800048828125,
      "end": 444.55999755859375,
      "text": " no other name under heaven given among men whereby we must be saved."
    },
    {
      "id": 104,
      "start": 444.55999755859375,
      "end": 447.3599853515625,
      "text": " What's he talking about being saved?"
    },
    {
      "id": 105,
      "start": 447.3599853515625,
      "end": 451.0400085449219,
      "text": " What's he talking about, what's this idea for whosoever shall call upon the name of"
    },
    {
      "id": 106,
      "start": 451.0400085449219,
      "end": 452.6000061035156,
      "text": " the Lord shall be saved?"
    },
    {
      "id": 107,
      "start": 452.6000061035156,
      "end": 458.2799987792969,
      "text": " See I recognize on that day, August 31st, 1997, that I was not saved, I was lost, I"
    },
    {
      "id": 108,
      "start": 458.2799987792969,
      "end": 460.9200134277344,
      "text": " was dead spiritually."
    },
    {
      "id": 109,
      "start": 460.9599914550781,
      "end": 466.0,
      "text": " I was very alive physically, but I was dead spiritually."
    },
    {
      "id": 110,
      "start": 466.0,
      "end": 471.0799865722656,
      "text": " And Jesus was the only Savior, and Jesus offered to me a gift, you know what's interesting"
    },
    {
      "id": 111,
      "start": 471.0799865722656,
      "end": 472.0799865722656,
      "text": " about a gift?"
    },
    {
      "id": 112,
      "start": 472.0799865722656,
      "end": 476.239990234375,
      "text": " A gift is something that you can receive or you can reject."
    },
    {
      "id": 113,
      "start": 476.239990234375,
      "end": 480.3999938964844,
      "text": " A gift is something that can only be given to you as a gift because someone else paid"
    },
    {
      "id": 114,
      "start": 480.3999938964844,
      "end": 483.20001220703125,
      "text": " for it, amen?"
    },
    {
      "id": 115,
      "start": 483.20001220703125,
      "end": 488.2799987792969,
      "text": " It wouldn't be called a gift if I had to earn it, if I had to work for it, it's called a"
    },
    {
      "id": 116,
      "start": 488.2799987792969,
      "end": 498.0400085449219,
      "text": " gift because Jesus, as He hung upon the cross of Calvary, said it is finished."
    },
    {
      "id": 117,
      "start": 498.0400085449219,
      "end": 502.9200134277344,
      "text": " Paid in full literally is what the Greek word means."
    },
    {
      "id": 118,
      "start": 502.9200134277344,
      "end": 509.3399963378906,
      "text": " We find that as Jesus made that declaration that it is finished, paid in full, that He"
    },
    {
      "id": 119,
      "start": 509.3399963378906,
      "end": 515.0,
      "text": " paid with His precious blood for my salvation."
    },
    {
      "id": 120,
      "start": 515.47998046875,
      "end": 518.3599853515625,
      "text": " Therefore He offers this gift."
    },
    {
      "id": 121,
      "start": 518.3599853515625,
      "end": 524.219970703125,
      "text": " John chapter 1 says, He came to His own, but His own received Him not."
    },
    {
      "id": 122,
      "start": 524.219970703125,
      "end": 529.1199951171875,
      "text": " But as many as received Him, to them gave He power to become the sons of God."
    },
    {
      "id": 123,
      "start": 529.1199951171875,
      "end": 534.4000244140625,
      "text": " And I had to recognize on that day in my life personally that I was either going to receive"
    },
    {
      "id": 124,
      "start": 534.4000244140625,
      "end": 539.239990234375,
      "text": " the gift of God, which was eternal life, and He is going to be my Lord and Savior, or I"
    },
    {
      "id": 125,
      "start": 539.239990234375,
      "end": 544.8400268554688,
      "text": " was going to reject that gift, and the reality is that on that day there was great spiritual"
    },
    {
      "id": 126,
      "start": 544.8400268554688,
      "end": 550.5999755859375,
      "text": " battle that took place, but thank God we sang the song, Ring the Bells of Heaven."
    },
    {
      "id": 127,
      "start": 550.5999755859375,
      "end": 552.0800170898438,
      "text": " What's the purpose of that song?"
    },
    {
      "id": 128,
      "start": 552.0800170898438,
      "end": 553.6799926757812,
      "text": " Well there's rejoicing, why?"
    },
    {
      "id": 129,
      "start": 553.6799926757812,
      "end": 559.47998046875,
      "text": " Because a soul was saved, a soul was converted, and on that day in my life there was rejoicing"
    },
    {
      "id": 130,
      "start": 559.47998046875,
      "end": 564.6799926757812,
      "text": " in heaven, there's rejoicing on earth because I was born again."
    },
    {
      "id": 131,
      "start": 564.6799926757812,
      "end": 569.4000244140625,
      "text": " Jesus said to Nicodemus, when Nicodemus came as a representative of all those religious"
    },
    {
      "id": 132,
      "start": 569.4000244140625,
      "end": 573.8400268554688,
      "text": " leaders and he came to Jesus by night and he made his declaration with regard to what"
    },
    {
      "id": 133,
      "start": 573.8400268554688,
      "end": 579.5999755859375,
      "text": " they had concluded based on seeing what they had seen at that point, and Jesus said, marvel"
    },
    {
      "id": 134,
      "start": 579.5999755859375,
      "end": 589.0399780273438,
      "text": " not that I say unto thee, singularly to Nicodemus, that ye all people must be born again."
    },
    {
      "id": 135,
      "start": 589.0399780273438,
      "end": 592.5800170898438,
      "text": " And Nicodemus says, I don't understand what this thing means to be born again."
    },
    {
      "id": 136,
      "start": 592.5800170898438,
      "end": 594.9199829101562,
      "text": " Can I enter into my mother's womb a second time?"
    },
    {
      "id": 137,
      "start": 594.9199829101562,
      "end": 599.2000122070312,
      "text": " I mean it's kind of comical to think about that passage of Scripture and what Nicodemus,"
    },
    {
      "id": 138,
      "start": 599.2000122070312,
      "end": 600.0800170898438,
      "text": " he's not understanding."
    },
    {
      "id": 0,
      "start": 600.0800170898438,
      "end": 605.2400169372559,
      "text": " Understanding, but Jesus speaks about a physical birth and a spiritual birth"
    },
    {
      "id": 1,
      "start": 606.0000171661377,
      "end": 608.2400169372559,
      "text": " See, I was born July 15th"
    },
    {
      "id": 2,
      "start": 608.7600173950195,
      "end": 609.7600173950195,
      "text": " 1980"
    },
    {
      "id": 3,
      "start": 609.7600173950195,
      "end": 612.5600166320801,
      "text": " But I was born again on August 31st"
    },
    {
      "id": 4,
      "start": 613.2400169372559,
      "end": 615.6800174713135,
      "text": " 1997 I titled the message this morning"
    },
    {
      "id": 5,
      "start": 616.2800178527832,
      "end": 623.1200180053711,
      "text": " Transformation because on that day for me personally and I think that most of us here this morning could stand and give a similar"
    },
    {
      "id": 6,
      "start": 623.4400177001953,
      "end": 626.0800170898438,
      "text": " Testimony as to the day that you got saved"
    },
    {
      "id": 7,
      "start": 627.9200172424316,
      "end": 629.9200172424316,
      "text": " It was a miracle"
    },
    {
      "id": 8,
      "start": 630.2000179290771,
      "end": 635.1600189208984,
      "text": " Work that God did in me. He quickened me. He made me alive"
    },
    {
      "id": 9,
      "start": 635.840015411377,
      "end": 641.9200172424316,
      "text": " Now he's been working on me since that day so that I would be conformed to the image of his dear son"
    },
    {
      "id": 10,
      "start": 641.9200172424316,
      "end": 648.340015411377,
      "text": " So that I would be like Christ, but the reality is that on that day. He saved me. He changed my life"
    },
    {
      "id": 11,
      "start": 650.2800178527832,
      "end": 652.2400169372559,
      "text": " It was radical"
    },
    {
      "id": 12,
      "start": 652.2400169372559,
      "end": 659.2000160217285,
      "text": " What happened on that day see this morning we think about the gospel the gospel has the power to save"
    },
    {
      "id": 13,
      "start": 659.2000160217285,
      "end": 663.6800155639648,
      "text": " Do you believe that this morning? I believe the gospel has the power to say. What is the gospel?"
    },
    {
      "id": 14,
      "start": 663.6800155639648,
      "end": 667.3200149536133,
      "text": " Well, very simply from 1st Corinthians 15. It's the death barrel and resurrection"
    },
    {
      "id": 15,
      "start": 668.0000152587891,
      "end": 672.1200180053711,
      "text": " That's the gospel the good news of Jesus Christ. We go bearing good news"
    },
    {
      "id": 16,
      "start": 672.1200180053711,
      "end": 678.2400207519531,
      "text": " Are there people that don't want it you bet there are I had encounters yesterday. So man, that guy is just grumpy"
    },
    {
      "id": 17,
      "start": 678.2400207519531,
      "end": 681.8800201416016,
      "text": " I just said good morning. How are you? I don't want it and I'm like man"
    },
    {
      "id": 18,
      "start": 681.8800201416016,
      "end": 685.1200180053711,
      "text": " You don't even know what I'm offering right like come on. I"
    },
    {
      "id": 19,
      "start": 685.5600204467773,
      "end": 689.7600173950195,
      "text": " Get it I understand not everyone wants it, but man the gospel has the power to save"
    },
    {
      "id": 20,
      "start": 690.2800140380859,
      "end": 692.2800140380859,
      "text": " For I am NOT ashamed of the gospel of Christ"
    },
    {
      "id": 21,
      "start": 692.8000183105469,
      "end": 698.9200134277344,
      "text": " For it is the power of God unto salvation to everyone that believeth to the Jew first and also the Greek"
    },
    {
      "id": 22,
      "start": 698.9200134277344,
      "end": 704.52001953125,
      "text": " Oh praise the Lord for the power. He is able Hebrew 7 chapter chapter 7 verse 25"
    },
    {
      "id": 23,
      "start": 704.52001953125,
      "end": 708.2400207519531,
      "text": " He is able to save them to the uttermost that come to God"
    },
    {
      "id": 24,
      "start": 708.8000183105469,
      "end": 713.52001953125,
      "text": " Listen, he the gospel is powerful. It can save a life"
    },
    {
      "id": 25,
      "start": 713.52001953125,
      "end": 720.7600173950195,
      "text": " It can save a sinner, but I want you to understand that I believe in a gospel that transforms an individual as well"
    },
    {
      "id": 26,
      "start": 721.6800155639648,
      "end": 723.6800155639648,
      "text": " Listen, we're not talking about Reformation"
    },
    {
      "id": 27,
      "start": 724.400016784668,
      "end": 726.4800186157227,
      "text": " We're not talking about trying to clean ourselves up"
    },
    {
      "id": 28,
      "start": 726.4800186157227,
      "end": 732.2400207519531,
      "text": " We're not talking about trying to do better and I'm gonna it's not by mine own righteousness"
    },
    {
      "id": 29,
      "start": 732.2400207519531,
      "end": 735.6000213623047,
      "text": " Here's what Isaiah says. All of our good works are as filthy rags"
    },
    {
      "id": 30,
      "start": 737.0400238037109,
      "end": 742.5800170898438,
      "text": " It's not by works of righteousness, which we have done but according to his mercy that he had saved us for by grace"
    },
    {
      "id": 31,
      "start": 742.5800170898438,
      "end": 745.1000213623047,
      "text": " We have saved through faith and that not of yourselves"
    },
    {
      "id": 32,
      "start": 745.1000213623047,
      "end": 747.1000213623047,
      "text": " It is the gift of God not of works"
    },
    {
      "id": 33,
      "start": 747.3400115966797,
      "end": 752.7800140380859,
      "text": " lest any man should boast in fact in the book of Romans as Paul as Paul is speaking there and"
    },
    {
      "id": 34,
      "start": 753.1400146484375,
      "end": 756.7400207519531,
      "text": " Giving the illustration in the example going back to history of Abraham"
    },
    {
      "id": 35,
      "start": 756.7400207519531,
      "end": 762.8200225830078,
      "text": " He talks about Abraham being justified not by works, but by faith. He says if it's by works, then it's a debt"
    },
    {
      "id": 36,
      "start": 762.8200225830078,
      "end": 764.8200225830078,
      "text": " It's something that Abraham was owed"
    },
    {
      "id": 37,
      "start": 767.4600219726562,
      "end": 769.4600219726562,
      "text": " God doesn't know us anything"
    },
    {
      "id": 38,
      "start": 769.7800140380859,
      "end": 771.7800140380859,
      "text": " But in his great love"
    },
    {
      "id": 39,
      "start": 771.9800109863281,
      "end": 773.9800109863281,
      "text": " He wanted to reconcile us"
    },
    {
      "id": 40,
      "start": 774.5400238037109,
      "end": 776.4600219726562,
      "text": " to redeem us"
    },
    {
      "id": 41,
      "start": 776.4600219726562,
      "end": 781.7000122070312,
      "text": " Listen this morning if you're not here if you're here this morning and you're not saved you've never trusted Christ as your Savior"
    },
    {
      "id": 42,
      "start": 781.7000122070312,
      "end": 783.02001953125,
      "text": " Can I tell you this morning?"
    },
    {
      "id": 43,
      "start": 783.02001953125,
      "end": 787.2200164794922,
      "text": " Today is the day of salvation. In fact in the very next chapter in"
    },
    {
      "id": 44,
      "start": 787.9800109863281,
      "end": 793.7800140380859,
      "text": " 2nd Corinthians 6 and verse number 2 the Bible says for he has saith I have heard thee in a time accepted in the day"
    },
    {
      "id": 45,
      "start": 793.7800140380859,
      "end": 800.02001953125,
      "text": " Of salvation have I suckered thee behold now is the accepted time behold now is the day of"
    },
    {
      "id": 46,
      "start": 800.8600158691406,
      "end": 802.260009765625,
      "text": " Salvation"
    },
    {
      "id": 47,
      "start": 802.260009765625,
      "end": 808.3400115966797,
      "text": " If you're not saved this morning if you do not have 100% assurance that heaven is your home today"
    },
    {
      "id": 48,
      "start": 809.02001953125,
      "end": 811.9800109863281,
      "text": " Is the day of your salvation would you trust Christ today?"
    },
    {
      "id": 49,
      "start": 812.5400238037109,
      "end": 819.9000244140625,
      "text": " But as we examine this verse of Scripture, I want you to consider with me three thoughts number one the experience of Paul"
    },
    {
      "id": 50,
      "start": 820.3000183105469,
      "end": 827.0600128173828,
      "text": " The experience of Paul as Paul is writing these words as he's speaking about therefore if any man be in Christ"
    },
    {
      "id": 51,
      "start": 827.0600128173828,
      "end": 828.9000244140625,
      "text": " He is a new creature"
    },
    {
      "id": 52,
      "start": 828.9000244140625,
      "end": 833.0600128173828,
      "text": " He says that that behold all he says all old things are passed away"
    },
    {
      "id": 53,
      "start": 833.0600128173828,
      "end": 835.260009765625,
      "text": " Behold all things are become new"
    },
    {
      "id": 54,
      "start": 835.7000122070312,
      "end": 840.260009765625,
      "text": " begin to think about the Apostle Paul under the inspiration of the Holy Spirit of God penning these words and I"
    },
    {
      "id": 55,
      "start": 840.3800201416016,
      "end": 847.0600128173828,
      "text": " Believe that as Paul was writing these very words that that his mind would rush back to the day in"
    },
    {
      "id": 56,
      "start": 847.4600219726562,
      "end": 850.02001953125,
      "text": " Which he trusts that Christ is his personal Savior"
    },
    {
      "id": 57,
      "start": 850.7400207519531,
      "end": 856.8200073242188,
      "text": " Just as I've had the opportunity to recount for you my experience of trusting Christ as my Savior"
    },
    {
      "id": 58,
      "start": 856.8200073242188,
      "end": 860.3800048828125,
      "text": " We find that the Apostle Paul he experienced the trance"
    },
    {
      "id": 59,
      "start": 861.4600219726562,
      "end": 866.1400146484375,
      "text": " Transformation in his life. He experienced the power of the gospel"
    },
    {
      "id": 60,
      "start": 866.8600158691406,
      "end": 871.5400085449219,
      "text": " personally not to just simply reform but to transform"
    },
    {
      "id": 61,
      "start": 872.6200256347656,
      "end": 875.1800231933594,
      "text": " We find that in Paul's life"
    },
    {
      "id": 62,
      "start": 875.1800231933594,
      "end": 880.7000122070312,
      "text": " It's Acts chapter number nine turn back if you will and I want you to look at Paul in Acts chapter number nine"
    },
    {
      "id": 63,
      "start": 880.7000122070312,
      "end": 881.9800109863281,
      "text": " And as we look at this chapter"
    },
    {
      "id": 64,
      "start": 881.9800109863281,
      "end": 888.9000244140625,
      "text": " we really could spend the entirety in Acts 9 this morning and just looking at this experience of Paul and what a great experience it"
    },
    {
      "id": 65,
      "start": 888.9000244140625,
      "end": 894.260009765625,
      "text": " Is and we find that it rehearses for us. It gives us the the account of Paul"
    },
    {
      "id": 66,
      "start": 894.8200073242188,
      "end": 900.7000122070312,
      "text": " Traveling on the road to Damascus. He's going according to verses 1 & 2 his name at this point is Saul"
    },
    {
      "id": 67,
      "start": 902.5800170898438,
      "end": 906.7400207519531,
      "text": " But notice what the Bible says in Acts 9 in verse number 1 and Saul"
    },
    {
      "id": 68,
      "start": 907.0600280761719,
      "end": 910.9400024414062,
      "text": " Yet breathing out threatenings and slaughter against the disciples of the Lord"
    },
    {
      "id": 69,
      "start": 911.4600219726562,
      "end": 916.6600036621094,
      "text": " Went unto the high priest and desired of him letters to Damascus to the synagogues"
    },
    {
      "id": 70,
      "start": 916.8200073242188,
      "end": 923.8200073242188,
      "text": " But if he found any notice this phrase of this way whether they were men or women he might bring them bound"
    },
    {
      "id": 71,
      "start": 924.5400085449219,
      "end": 928.2200317382812,
      "text": " Unto Jerusalem and we find that Saul at this point"
    },
    {
      "id": 72,
      "start": 928.2200317382812,
      "end": 933.1000061035156,
      "text": " He was dealing with all that had transpired at the end of chapter 7"
    },
    {
      "id": 73,
      "start": 933.1000061035156,
      "end": 938.7400207519531,
      "text": " We find that a man by the name of Stephen the first martyr of the local church or of the church if you will"
    },
    {
      "id": 74,
      "start": 938.8200073242188,
      "end": 943.6600036621094,
      "text": " Was martyred there and he stoned and the Bible tells us that they laid"
    },
    {
      "id": 75,
      "start": 944.0600280761719,
      "end": 951.3800048828125,
      "text": " The garments his garments at the feet of Saul and we find that Saul I believe he was dealing with great"
    },
    {
      "id": 76,
      "start": 951.6600036621094,
      "end": 953.3400268554688,
      "text": " level of"
    },
    {
      "id": 77,
      "start": 953.3400268554688,
      "end": 955.1400146484375,
      "text": " conviction why"
    },
    {
      "id": 78,
      "start": 955.1400146484375,
      "end": 957.1400146484375,
      "text": " because he saw Stephen as"
    },
    {
      "id": 79,
      "start": 957.4600219726562,
      "end": 960.0600280761719,
      "text": " It were his countenance as an angel"
    },
    {
      "id": 80,
      "start": 960.5000305175781,
      "end": 965.5000305175781,
      "text": " He heard Stephen utter similar words to what Jesus had uttered when he was on the cross"
    },
    {
      "id": 81,
      "start": 965.5000305175781,
      "end": 969.260009765625,
      "text": " Jesus said father forgive them for they know not what they do"
    },
    {
      "id": 82,
      "start": 969.780029296875,
      "end": 972.7000122070312,
      "text": " We find that Stephen uttered similar words"
    },
    {
      "id": 83,
      "start": 972.7000122070312,
      "end": 977.6600036621094,
      "text": " We find that that Saul was under great conviction and what do we do when we're under conviction?"
    },
    {
      "id": 84,
      "start": 977.6600036621094,
      "end": 984.3000183105469,
      "text": " well, we either submit or we really get angry about it and Saul is angry and I mean his"
    },
    {
      "id": 85,
      "start": 984.9000244140625,
      "end": 986.9000244140625,
      "text": " level of"
    },
    {
      "id": 86,
      "start": 987.260009765625,
      "end": 991.4600219726562,
      "text": " Attacking the church and all that was going on with the persecution reaches"
    },
    {
      "id": 87,
      "start": 991.780029296875,
      "end": 995.02001953125,
      "text": " its highest point at the start of Acts chapter number 9"
    },
    {
      "id": 88,
      "start": 995.4600219726562,
      "end": 998.9800109863281,
      "text": " And we find that he's on the way to Damascus then verse number 4"
    },
    {
      "id": 89,
      "start": 998.9800109863281,
      "end": 1001.7000122070312,
      "text": " The Bible says that he was journeying in verse 3 in verse 4"
    },
    {
      "id": 90,
      "start": 1001.9000244140625,
      "end": 1006.6600036621094,
      "text": " He had heard this this light this let me read verse 3 and as he journeyed"
    },
    {
      "id": 91,
      "start": 1006.6600036621094,
      "end": 1011.6200256347656,
      "text": " he came near Damascus and suddenly there shined round about him a light from heaven and"
    },
    {
      "id": 92,
      "start": 1012.3000183105469,
      "end": 1016.1400146484375,
      "text": " He saw fell to the earth and heard a voice saying unto him Saul"
    },
    {
      "id": 93,
      "start": 1017.8600158691406,
      "end": 1020.1000061035156,
      "text": " Why persecute us thou me?"
    },
    {
      "id": 94,
      "start": 1020.9800109863281,
      "end": 1024.02001953125,
      "text": " And he saw said who art thou Lord?"
    },
    {
      "id": 95,
      "start": 1025.02001953125,
      "end": 1028.1000061035156,
      "text": " The Lord said I am Jesus whom thou persecute est"
    },
    {
      "id": 96,
      "start": 1028.4200134277344,
      "end": 1032.5400085449219,
      "text": " It is hard for thee to kick against the pricks that conviction that he was dealing with"
    },
    {
      "id": 97,
      "start": 1032.7000122070312,
      "end": 1038.1800231933594,
      "text": " That that imagery that is used here of kicking against the pricks and how they would use them to move"
    },
    {
      "id": 98,
      "start": 1038.5000305175781,
      "end": 1043.1000061035156,
      "text": " Livestock and all that they would do and he says listen God saying you're under great conviction"
    },
    {
      "id": 99,
      "start": 1043.1000061035156,
      "end": 1046.5800170898438,
      "text": " It's hard for thee to kick against the pricks in verse number 6"
    },
    {
      "id": 100,
      "start": 1046.5800170898438,
      "end": 1049.9400024414062,
      "text": " The the Bible says that he was trembling and astonished and said Lord"
    },
    {
      "id": 101,
      "start": 1050.260009765625,
      "end": 1055.6600036621094,
      "text": " What wilt thou have me to do and the Lord said unto him arise and go into the city and it shall be told thee"
    },
    {
      "id": 102,
      "start": 1056.3800048828125,
      "end": 1062.9400024414062,
      "text": " What thou must do in this passage of Scripture we find that Paul"
    },
    {
      "id": 103,
      "start": 1063.5800170898438,
      "end": 1068.6600036621094,
      "text": " Experienced what we're speaking of in 2nd Corinthians 5 in verse number 17. He was radically changed"
    },
    {
      "id": 104,
      "start": 1068.6600036621094,
      "end": 1072.9800109863281,
      "text": " He was not the same man. He no longer was the same he had experienced"
    },
    {
      "id": 105,
      "start": 1073.260009765625,
      "end": 1074.9800109863281,
      "text": " the power of the gospel"
    },
    {
      "id": 106,
      "start": 1074.9800109863281,
      "end": 1081.5000305175781,
      "text": " He'd experienced not only now was he gonna go to heaven when he died because he had accepted the Lord as a Savior"
    },
    {
      "id": 107,
      "start": 1081.5000305175781,
      "end": 1085.0600280761719,
      "text": " But we find that his life would forever be changed"
    },
    {
      "id": 108,
      "start": 1085.1000061035156,
      "end": 1089.4200134277344,
      "text": " We find that as the Apostle Paul as we refer to him as here"
    },
    {
      "id": 109,
      "start": 1089.4200134277344,
      "end": 1093.8600158691406,
      "text": " he's he's blinded and of course we understand as you go through the passage that there was a"
    },
    {
      "id": 110,
      "start": 1094.4200134277344,
      "end": 1101.2200317382812,
      "text": " Disciple by the name of Ananias that God directed to go and speak to to him to Saul and he comes and he says brother"
    },
    {
      "id": 111,
      "start": 1101.7000122070312,
      "end": 1103.7000122070312,
      "text": " Saul what a great"
    },
    {
      "id": 112,
      "start": 1104.7400207519531,
      "end": 1106.7400207519531,
      "text": " What a great reference"
    },
    {
      "id": 113,
      "start": 1107.02001953125,
      "end": 1113.2200317382812,
      "text": " To now this man who had been known as the persecutor that Ananias is now saying brother Saul"
    },
    {
      "id": 114,
      "start": 1113.2200317382812,
      "end": 1117.3800048828125,
      "text": " And I want you to notice in verse number 20 of Acts chapter number 9"
    },
    {
      "id": 115,
      "start": 1117.5400390625,
      "end": 1119.3800048828125,
      "text": " I'll read verse 19 with it"
    },
    {
      "id": 116,
      "start": 1119.3800048828125,
      "end": 1123.1000366210938,
      "text": " The Bible says in verse 19 of Acts 9 and when he'd received me"
    },
    {
      "id": 117,
      "start": 1123.1000366210938,
      "end": 1130.6199951171875,
      "text": " He was strengthened then with Saul certain days with the disciples, which were at Damascus and notice verse 20 and straightway"
    },
    {
      "id": 118,
      "start": 1131.2200317382812,
      "end": 1136.1000366210938,
      "text": " He preached Christ in the synagogues that he is the Son of God"
    },
    {
      "id": 119,
      "start": 1136.9000244140625,
      "end": 1144.2200317382812,
      "text": " What a transformation. I mean what an experience that Paul had I understand his name is still Saul here in Acts 9"
    },
    {
      "id": 120,
      "start": 1144.2200317382812,
      "end": 1150.6199951171875,
      "text": " but I want you to see in his life if you were to read verse 1 and verse 2 and you were to skip verse 3"
    },
    {
      "id": 121,
      "start": 1150.6199951171875,
      "end": 1154.5800170898438,
      "text": " Through verse 18 and just pick it up in verse 19. It would make zero sense"
    },
    {
      "id": 122,
      "start": 1155.4600219726562,
      "end": 1162.1799926757812,
      "text": " Because the purpose of him going to the synagogue was so that he could arrest people and bind them and take them to Jerusalem"
    },
    {
      "id": 123,
      "start": 1162.5800170898438,
      "end": 1165.8200073242188,
      "text": " He was persecuting but in verse number 20"
    },
    {
      "id": 124,
      "start": 1165.8200073242188,
      "end": 1174.1000366210938,
      "text": " He's now preaching in the synagogue that Jesus is the Christ the Messiah the promised one God in flesh"
    },
    {
      "id": 125,
      "start": 1177.739990234375,
      "end": 1181.5599975585938,
      "text": " If you don't read the middle verses you have no idea what happened to this guy"
    },
    {
      "id": 126,
      "start": 1182.1600341796875,
      "end": 1186.0400390625,
      "text": " but when you read the middle verses you find out he met Jesus and"
    },
    {
      "id": 127,
      "start": 1187.5599975585938,
      "end": 1189.5599975585938,
      "text": " Jesus changed his life"
    },
    {
      "id": 128,
      "start": 1190.2000122070312,
      "end": 1195.7999877929688,
      "text": " He experienced in his life what he's writing about to the church in Corinth"
    },
    {
      "id": 129,
      "start": 1196.2000122070312,
      "end": 1200.1600341796875,
      "text": " Therefore if any man be in Christ, he is a new creature and I think"
    },
    {
      "id": 0,
      "start": 1200.1600341796875,
      "end": 1204.76003408432,
      "text": " Think about Paul thinking back to his life before he was a Christian."
    },
    {
      "id": 1,
      "start": 1204.76003408432,
      "end": 1207.1600341796875,
      "text": " I wonder this morning, I think about my life."
    },
    {
      "id": 2,
      "start": 1207.1600341796875,
      "end": 1212.9200344085693,
      "text": " I was 17 when I got saved by the grace of God, and I can remember prior to being 17"
    },
    {
      "id": 3,
      "start": 1212.9200344085693,
      "end": 1217.3200340270996,
      "text": " years old, I can remember what my goals and ambitions and desires were."
    },
    {
      "id": 4,
      "start": 1217.3200340270996,
      "end": 1221.1200332641602,
      "text": " I can remember how God changed me."
    },
    {
      "id": 5,
      "start": 1221.1200332641602,
      "end": 1222.8400344848633,
      "text": " The power of the gospel."
    },
    {
      "id": 6,
      "start": 1222.8400344848633,
      "end": 1223.8400344848633,
      "text": " Praise the Lord."
    },
    {
      "id": 7,
      "start": 1223.8400344848633,
      "end": 1225.960033416748,
      "text": " That's what Paul experienced."
    },
    {
      "id": 8,
      "start": 1225.960033416748,
      "end": 1229.9200344085693,
      "text": " Notice in the book of Galatians, if you will, and Paul is writing, Galatians chapter 1,"
    },
    {
      "id": 9,
      "start": 1229.9200344085693,
      "end": 1233.6000328063965,
      "text": " he's writing back to the churches in the region of Galatia."
    },
    {
      "id": 10,
      "start": 1233.6000328063965,
      "end": 1239.0800323486328,
      "text": " And as he's writing back, and it's an interesting thing because this is the first region that"
    },
    {
      "id": 11,
      "start": 1239.0800323486328,
      "end": 1243.0400352478027,
      "text": " Paul went to on that first missionary journey."
    },
    {
      "id": 12,
      "start": 1243.0400352478027,
      "end": 1248.6000328063965,
      "text": " God saved him, and God called him, and then God used him, and Paul ends up in the region"
    },
    {
      "id": 13,
      "start": 1248.6000328063965,
      "end": 1249.8400344848633,
      "text": " of Galatia."
    },
    {
      "id": 14,
      "start": 1249.8400344848633,
      "end": 1250.8400344848633,
      "text": " He's preaching."
    },
    {
      "id": 15,
      "start": 1250.8400344848633,
      "end": 1255.9200325012207,
      "text": " There are churches, four of them, that are, as he goes into these four cities in the region"
    },
    {
      "id": 16,
      "start": 1255.9200325012207,
      "end": 1259.8800354003906,
      "text": " of Galatia, these churches that are established, and now he's writing back to them."
    },
    {
      "id": 17,
      "start": 1260.8400344848633,
      "end": 1265.400032043457,
      "text": " And I want you to notice the end of chapter 1, the Bible says this, in verse number 23,"
    },
    {
      "id": 18,
      "start": 1265.400032043457,
      "end": 1272.0400314331055,
      "text": " verse 22, it says, and was unknown by face unto the churches of Judea which were in Christ."
    },
    {
      "id": 19,
      "start": 1272.0400314331055,
      "end": 1277.920036315918,
      "text": " Paul was unknown to them, but notice in verse 23, but they had heard only, listen to what"
    },
    {
      "id": 20,
      "start": 1277.920036315918,
      "end": 1286.520034790039,
      "text": " they heard, that he which persecuted us in times past now preacheth the faith which once"
    },
    {
      "id": 21,
      "start": 1286.520034790039,
      "end": 1292.800033569336,
      "text": " he destroyed, and they glorified God in me."
    },
    {
      "id": 22,
      "start": 1292.800033569336,
      "end": 1295.5400314331055,
      "text": " You know what they heard?"
    },
    {
      "id": 23,
      "start": 1295.5400314331055,
      "end": 1298.920036315918,
      "text": " They heard that that man got saved."
    },
    {
      "id": 24,
      "start": 1298.920036315918,
      "end": 1302.6000366210938,
      "text": " And he once persecuted, but now he's preaching."
    },
    {
      "id": 25,
      "start": 1302.6000366210938,
      "end": 1304.1600341796875,
      "text": " Praise the Lord."
    },
    {
      "id": 26,
      "start": 1304.1600341796875,
      "end": 1307.920036315918,
      "text": " And because of what they heard, the Bible says they glorified God in me."
    },
    {
      "id": 27,
      "start": 1307.920036315918,
      "end": 1309.3200378417969,
      "text": " You know what they were doing?"
    },
    {
      "id": 28,
      "start": 1309.3200378417969,
      "end": 1312.520034790039,
      "text": " They were thanking God for the power of the gospel."
    },
    {
      "id": 29,
      "start": 1312.520034790039,
      "end": 1316.4400329589844,
      "text": " They were thanking God for the conversion of this individual."
    },
    {
      "id": 30,
      "start": 1316.4400329589844,
      "end": 1320.520034790039,
      "text": " We begin to think about in our own lives those that God might allow us the opportunity to"
    },
    {
      "id": 31,
      "start": 1320.520034790039,
      "end": 1326.5600357055664,
      "text": " see saved and to see how their lives have been changed, and yes, their eternal destination"
    },
    {
      "id": 32,
      "start": 1326.5600357055664,
      "end": 1333.2000274658203,
      "text": " is changed in a moment, but their lives are radically changed by the gospel."
    },
    {
      "id": 33,
      "start": 1333.2000274658203,
      "end": 1339.9200286865234,
      "text": " We believe a gospel that saves a sinner, but we believe a gospel that transforms a man."
    },
    {
      "id": 34,
      "start": 1339.9200286865234,
      "end": 1345.2000274658203,
      "text": " This morning as we look at the text, we note the experience of Paul, but back in 2 Corinthians"
    },
    {
      "id": 35,
      "start": 1345.2000274658203,
      "end": 1349.0400390625,
      "text": " chapter number 5, I want you to notice number 2, the expectation of Paul."
    },
    {
      "id": 36,
      "start": 1349.0400390625,
      "end": 1351.800033569336,
      "text": " I believe that Paul had an expectation."
    },
    {
      "id": 37,
      "start": 1351.800033569336,
      "end": 1356.3600311279297,
      "text": " He had experienced personally, but I believe that he had an expectation."
    },
    {
      "id": 38,
      "start": 1356.3600311279297,
      "end": 1358.0400390625,
      "text": " You know what that expectation was?"
    },
    {
      "id": 39,
      "start": 1358.0400390625,
      "end": 1362.5400390625,
      "text": " He expected that those that got saved were radically different."
    },
    {
      "id": 40,
      "start": 1362.5400390625,
      "end": 1368.4400329589844,
      "text": " He expected that those that trust at Christ as their personal Savior had that same transformation"
    },
    {
      "id": 41,
      "start": 1368.4400329589844,
      "end": 1370.4400329589844,
      "text": " that he had experienced."
    },
    {
      "id": 42,
      "start": 1370.4400329589844,
      "end": 1376.4800415039062,
      "text": " He believed, he expected that these individuals, because he says, therefore, if any man, Paul's"
    },
    {
      "id": 43,
      "start": 1376.4800415039062,
      "end": 1380.7400360107422,
      "text": " not just saying that this was my experience because I was something special, because I"
    },
    {
      "id": 44,
      "start": 1380.7400360107422,
      "end": 1383.0000305175781,
      "text": " received some special grace."
    },
    {
      "id": 45,
      "start": 1383.0000305175781,
      "end": 1387.9200286865234,
      "text": " No, the gospel that saved me is the same gospel that saves you, and the gospel that transformed"
    },
    {
      "id": 46,
      "start": 1387.9200286865234,
      "end": 1391.0000305175781,
      "text": " me is the gospel that I expect to transform you."
    },
    {
      "id": 47,
      "start": 1391.0000305175781,
      "end": 1392.800033569336,
      "text": " Does that make sense?"
    },
    {
      "id": 48,
      "start": 1392.800033569336,
      "end": 1396.520034790039,
      "text": " We find that as the Apostle Paul is writing this church in Corinth, we know some things"
    },
    {
      "id": 49,
      "start": 1396.520034790039,
      "end": 1397.9200286865234,
      "text": " about the church in Corinth."
    },
    {
      "id": 50,
      "start": 1397.9200286865234,
      "end": 1400.2000274658203,
      "text": " They're a church that's carnal."
    },
    {
      "id": 51,
      "start": 1400.2000274658203,
      "end": 1401.9200286865234,
      "text": " They're a church that's divided."
    },
    {
      "id": 52,
      "start": 1401.9200286865234,
      "end": 1408.4000396728516,
      "text": " They're a church that they're dealing with some of this, you know, yes, we're going to"
    },
    {
      "id": 53,
      "start": 1408.4000396728516,
      "end": 1414.520034790039,
      "text": " keep some of those old ways, if you will, but Paul says old things are passed away,"
    },
    {
      "id": 54,
      "start": 1414.520034790039,
      "end": 1417.2000274658203,
      "text": " and behold, all things are become new."
    },
    {
      "id": 55,
      "start": 1417.2000274658203,
      "end": 1423.6000366210938,
      "text": " And Paul had this expectation that the same God who transformed my life is the same God"
    },
    {
      "id": 56,
      "start": 1423.6000366210938,
      "end": 1425.6400299072266,
      "text": " that's going to transform your life."
    },
    {
      "id": 57,
      "start": 1426.3600311279297,
      "end": 1428.1600341796875,
      "text": " You ever hear somebody say something like this?"
    },
    {
      "id": 58,
      "start": 1428.1600341796875,
      "end": 1433.1200408935547,
      "text": " They see somebody that got saved, and they say, now, they really got saved."
    },
    {
      "id": 59,
      "start": 1433.1200408935547,
      "end": 1435.1600341796875,
      "text": " And some of the old preachers would kind of talk that way."
    },
    {
      "id": 60,
      "start": 1435.1600341796875,
      "end": 1438.800033569336,
      "text": " They'd get real deep in their voice, and they kind of lean over the pulpit and say, man,"
    },
    {
      "id": 61,
      "start": 1438.800033569336,
      "end": 1439.800033569336,
      "text": " they got saved."
    },
    {
      "id": 62,
      "start": 1439.800033569336,
      "end": 1443.7600402832031,
      "text": " Listen, what were they trying to communicate by saying that?"
    },
    {
      "id": 63,
      "start": 1443.7600402832031,
      "end": 1445.520034790039,
      "text": " Well, man, look at their life."
    },
    {
      "id": 64,
      "start": 1445.520034790039,
      "end": 1446.520034790039,
      "text": " Look at what..."
    },
    {
      "id": 65,
      "start": 1446.520034790039,
      "end": 1450.2000274658203,
      "text": " But I want you to understand that every single person that gets saved ought to have that"
    },
    {
      "id": 66,
      "start": 1450.2000274658203,
      "end": 1453.4800415039062,
      "text": " same level of experience that they got saved."
    },
    {
      "id": 67,
      "start": 1453.4800415039062,
      "end": 1454.4800415039062,
      "text": " Why?"
    },
    {
      "id": 68,
      "start": 1455.3200378417969,
      "end": 1456.9600219726562,
      "text": " Because I'm a new creature."
    },
    {
      "id": 69,
      "start": 1456.9600219726562,
      "end": 1458.1200256347656,
      "text": " I'm a new creature."
    },
    {
      "id": 70,
      "start": 1458.1200256347656,
      "end": 1462.3200378417969,
      "text": " I have a new identity."
    },
    {
      "id": 71,
      "start": 1462.3200378417969,
      "end": 1467.4000244140625,
      "text": " After that day in my life on August 31st, 1997, I was no longer my own."
    },
    {
      "id": 72,
      "start": 1467.4000244140625,
      "end": 1469.4000244140625,
      "text": " I was bought with a price."
    },
    {
      "id": 73,
      "start": 1469.4000244140625,
      "end": 1471.6000366210938,
      "text": " By the way, I was never really my own."
    },
    {
      "id": 74,
      "start": 1471.6000366210938,
      "end": 1475.6000366210938,
      "text": " I was a child of the devil, according to John chapter number eight."
    },
    {
      "id": 75,
      "start": 1475.6000366210938,
      "end": 1477.2000427246094,
      "text": " Now, I didn't think I was."
    },
    {
      "id": 76,
      "start": 1477.2000427246094,
      "end": 1478.4400329589844,
      "text": " I didn't know what that meant."
    },
    {
      "id": 77,
      "start": 1478.4400329589844,
      "end": 1483.4800415039062,
      "text": " It's not like I worshiped the devil, but I was lost."
    },
    {
      "id": 78,
      "start": 1483.4800415039062,
      "end": 1488.5600280761719,
      "text": " And the reality is that as we look at this truth this morning that Paul had this expectation,"
    },
    {
      "id": 79,
      "start": 1488.5600280761719,
      "end": 1492.5600280761719,
      "text": " because I had a new identity, I think about our identity in Christ, I think about us as"
    },
    {
      "id": 80,
      "start": 1492.5600280761719,
      "end": 1493.5600280761719,
      "text": " individuals."
    },
    {
      "id": 81,
      "start": 1493.5600280761719,
      "end": 1494.5600280761719,
      "text": " What do we say?"
    },
    {
      "id": 82,
      "start": 1494.5600280761719,
      "end": 1495.5600280761719,
      "text": " How do we do?"
    },
    {
      "id": 83,
      "start": 1495.5600280761719,
      "end": 1496.5600280761719,
      "text": " Hey, I'm a Christian."
    },
    {
      "id": 84,
      "start": 1496.5600280761719,
      "end": 1498.4800415039062,
      "text": " That's the first thing that identifies us."
    },
    {
      "id": 85,
      "start": 1498.4800415039062,
      "end": 1499.4800415039062,
      "text": " Why?"
    },
    {
      "id": 86,
      "start": 1499.4800415039062,
      "end": 1500.4800415039062,
      "text": " Because I'm in Christ."
    },
    {
      "id": 87,
      "start": 1500.4800415039062,
      "end": 1501.4800415039062,
      "text": " I'm a new creature."
    },
    {
      "id": 88,
      "start": 1501.4800415039062,
      "end": 1503.6800231933594,
      "text": " I've been radically changed."
    },
    {
      "id": 89,
      "start": 1503.6800231933594,
      "end": 1508.9600219726562,
      "text": " And Paul had this expectation as Paul went forth and preached the gospel, as Paul went"
    },
    {
      "id": 90,
      "start": 1508.9600219726562,
      "end": 1514.0400390625,
      "text": " to new regions, and he would use that phrase, to the regions beyond you, as Paul would go"
    },
    {
      "id": 91,
      "start": 1514.0400390625,
      "end": 1519.7200317382812,
      "text": " into a new city as he would preach the gospel, he expected that the gospel would have an"
    },
    {
      "id": 92,
      "start": 1519.7200317382812,
      "end": 1522.0800476074219,
      "text": " impact on individuals."
    },
    {
      "id": 93,
      "start": 1522.0800476074219,
      "end": 1524.9600219726562,
      "text": " He expected that they would not be the same."
    },
    {
      "id": 94,
      "start": 1524.9600219726562,
      "end": 1528.2000427246094,
      "text": " Listen, can I explain to you this morning maybe this way?"
    },
    {
      "id": 95,
      "start": 1528.2000427246094,
      "end": 1534.6400451660156,
      "text": " The truth of salvation is not just taking Jesus and adding him to your shelf."
    },
    {
      "id": 96,
      "start": 1534.6400451660156,
      "end": 1538.1200256347656,
      "text": " No."
    },
    {
      "id": 97,
      "start": 1538.280029296875,
      "end": 1541.7600402832031,
      "text": " It's not salvation."
    },
    {
      "id": 98,
      "start": 1541.7600402832031,
      "end": 1543.800048828125,
      "text": " Salvation is not, okay, yeah, I'll just believe Jesus, that's great."
    },
    {
      "id": 99,
      "start": 1543.800048828125,
      "end": 1544.800048828125,
      "text": " Oh, you know what?"
    },
    {
      "id": 100,
      "start": 1544.800048828125,
      "end": 1545.800048828125,
      "text": " I'm going to go to heaven when I die."
    },
    {
      "id": 101,
      "start": 1545.800048828125,
      "end": 1546.800048828125,
      "text": " No, no, no."
    },
    {
      "id": 102,
      "start": 1546.800048828125,
      "end": 1548.4800415039062,
      "text": " No, no, no."
    },
    {
      "id": 103,
      "start": 1548.4800415039062,
      "end": 1551.1200256347656,
      "text": " It's transformation."
    },
    {
      "id": 104,
      "start": 1551.1200256347656,
      "end": 1552.52001953125,
      "text": " I don't work for it."
    },
    {
      "id": 105,
      "start": 1552.52001953125,
      "end": 1555.3600463867188,
      "text": " There's nothing I could do to earn it."
    },
    {
      "id": 106,
      "start": 1555.3600463867188,
      "end": 1560.0400390625,
      "text": " But when a man is saved, he is radically different."
    },
    {
      "id": 107,
      "start": 1560.0400390625,
      "end": 1563.1600341796875,
      "text": " We sing the song with the young people."
    },
    {
      "id": 108,
      "start": 1563.1600341796875,
      "end": 1566.2000427246094,
      "text": " The things I used to do, I don't do them anymore."
    },
    {
      "id": 109,
      "start": 1566.2000427246094,
      "end": 1567.2000427246094,
      "text": " Why?"
    },
    {
      "id": 110,
      "start": 1567.280029296875,
      "end": 1571.3200378417969,
      "text": " There's been a great change since I've been born again."
    },
    {
      "id": 111,
      "start": 1571.3200378417969,
      "end": 1573.3200378417969,
      "text": " The places I used to go, I don't go there anymore."
    },
    {
      "id": 112,
      "start": 1573.3200378417969,
      "end": 1577.8400268554688,
      "text": " I mean, you can go on different verse after different verse after different verse that"
    },
    {
      "id": 113,
      "start": 1577.8400268554688,
      "end": 1582.2000427246094,
      "text": " we sing with the kids in Sunday school and junior church and vacation Bible school, and"
    },
    {
      "id": 114,
      "start": 1582.2000427246094,
      "end": 1586.5600280761719,
      "text": " the reality is we try to teach those little kids and the reality is that we need to be"
    },
    {
      "id": 115,
      "start": 1586.5600280761719,
      "end": 1590.6800231933594,
      "text": " reminded this morning that I am a new creature."
    },
    {
      "id": 116,
      "start": 1590.6800231933594,
      "end": 1594.2000427246094,
      "text": " I shouldn't think the same way."
    },
    {
      "id": 117,
      "start": 1594.2000427246094,
      "end": 1598.2000427246094,
      "text": " Be not conformed to this world, but be transformed by the renewing of your mind that you may"
    },
    {
      "id": 118,
      "start": 1598.2000427246094,
      "end": 1601.800048828125,
      "text": " prove what is that good and acceptable and perfect will of God."
    },
    {
      "id": 119,
      "start": 1601.800048828125,
      "end": 1605.2400207519531,
      "text": " Listen, I'm a new creature."
    },
    {
      "id": 120,
      "start": 1605.2400207519531,
      "end": 1608.1200256347656,
      "text": " I'm not the same."
    },
    {
      "id": 121,
      "start": 1608.1200256347656,
      "end": 1613.0000305175781,
      "text": " If you've ever read our website bio, I put on there that God turned my life right side"
    },
    {
      "id": 122,
      "start": 1613.0000305175781,
      "end": 1615.3200378417969,
      "text": " up."
    },
    {
      "id": 123,
      "start": 1615.3200378417969,
      "end": 1617.280029296875,
      "text": " It was radical."
    },
    {
      "id": 124,
      "start": 1617.280029296875,
      "end": 1622.8800354003906,
      "text": " All of a sudden as a senior in high school, having various plans and ideas of what I would"
    },
    {
      "id": 125,
      "start": 1622.8800354003906,
      "end": 1626.5600280761719,
      "text": " do with my life, all of a sudden it was more about what God wanted with my life than what"
    },
    {
      "id": 126,
      "start": 1626.5600280761719,
      "end": 1628.5600280761719,
      "text": " I wanted with my life."
    },
    {
      "id": 127,
      "start": 1628.5600280761719,
      "end": 1629.5600280761719,
      "text": " Why?"
    },
    {
      "id": 128,
      "start": 1629.5600280761719,
      "end": 1632.8400268554688,
      "text": " Because there's a radical change."
    },
    {
      "id": 129,
      "start": 1632.8400268554688,
      "end": 1637.9200439453125,
      "text": " And I don't know this morning what your experience was, but I understand the expectation that"
    },
    {
      "id": 130,
      "start": 1637.9200439453125,
      "end": 1639.7200317382812,
      "text": " Paul has."
    },
    {
      "id": 131,
      "start": 1639.7200317382812,
      "end": 1645.280029296875,
      "text": " He expected that those that were born again, those that were in Christ were transformed"
    },
    {
      "id": 132,
      "start": 1645.280029296875,
      "end": 1649.280029296875,
      "text": " by the power of the gospel, that they were new creatures, that those old things were"
    },
    {
      "id": 133,
      "start": 1649.280029296875,
      "end": 1653.3200378417969,
      "text": " passed away, that all things are become new."
    },
    {
      "id": 134,
      "start": 1653.3200378417969,
      "end": 1656.2400207519531,
      "text": " Does it mean that we become perfect at the day of salvation?"
    },
    {
      "id": 135,
      "start": 1656.2400207519531,
      "end": 1661.2400207519531,
      "text": " No, not even close, because we understand that Ephesians and Colossians, both of those"
    },
    {
      "id": 136,
      "start": 1661.2400207519531,
      "end": 1665.8600463867188,
      "text": " letters deal with that process of what we would call in the book of Galatians of walking"
    },
    {
      "id": 137,
      "start": 1665.8600463867188,
      "end": 1667.0400390625,
      "text": " in the Spirit."
    },
    {
      "id": 138,
      "start": 1667.0400390625,
      "end": 1669.6600341796875,
      "text": " And what do they explain in Ephesians and in Colossians?"
    },
    {
      "id": 139,
      "start": 1669.6600341796875,
      "end": 1673.4600219726562,
      "text": " There's some things that we're to put off, and there's some things we're to put on."
    },
    {
      "id": 140,
      "start": 1673.4600219726562,
      "end": 1677.0800476074219,
      "text": " And we're to walk in the Spirit so that we would not fulfill the lust of the flesh."
    },
    {
      "id": 141,
      "start": 1677.0800476074219,
      "end": 1681.8800354003906,
      "text": " It doesn't mean that my flesh or your flesh doesn't have those desires anymore."
    },
    {
      "id": 142,
      "start": 1681.8800354003906,
      "end": 1686.52001953125,
      "text": " It simply means that there's a greater one that lives within us, the Holy Spirit of God"
    },
    {
      "id": 143,
      "start": 1686.52001953125,
      "end": 1689.1200256347656,
      "text": " now indwells me."
    },
    {
      "id": 144,
      "start": 1689.1200256347656,
      "end": 1693.2000427246094,
      "text": " And we find that there's this expectation that Paul has."
    },
    {
      "id": 145,
      "start": 1693.2000427246094,
      "end": 1697.9200439453125,
      "text": " And I wonder this morning, as we look at this verse, and I wonder about these folks in Corinth"
    },
    {
      "id": 146,
      "start": 1697.9200439453125,
      "end": 1703.2400207519531,
      "text": " that as they receive this, and they begin to evaluate their own lives, because no doubt"
    },
    {
      "id": 147,
      "start": 1703.3200378417969,
      "end": 1707.800048828125,
      "text": " the Apostle Paul, when he's penning the words, would be reminded of his own personal experience."
    },
    {
      "id": 148,
      "start": 1707.800048828125,
      "end": 1714.800048828125,
      "text": " But he expected that this would be the case for those that have been saved."
    },
    {
      "id": 149,
      "start": 1714.800048828125,
      "end": 1720.6800537109375,
      "text": " I don't know about you, but for me, the Holy Spirit, and I know for everyone that's truly"
    },
    {
      "id": 150,
      "start": 1720.6800537109375,
      "end": 1723.9200439453125,
      "text": " born again, the Bible tells us the Holy Spirit lives within us."
    },
    {
      "id": 151,
      "start": 1723.9200439453125,
      "end": 1724.9200439453125,
      "text": " Amen?"
    },
    {
      "id": 152,
      "start": 1724.9200439453125,
      "end": 1726.0000610351562,
      "text": " Is that what the Bible teaches us?"
    },
    {
      "id": 153,
      "start": 1726.0000610351562,
      "end": 1730.0000610351562,
      "text": " At the moment of salvation, the Holy Spirit is the earnest of our inheritance."
    },
    {
      "id": 154,
      "start": 1730.0000610351562,
      "end": 1732.7400512695312,
      "text": " We are sealed in the day of redemption with the Holy Spirit."
    },
    {
      "id": 155,
      "start": 1732.7400512695312,
      "end": 1735.4200439453125,
      "text": " So the Holy Spirit of God lives within me."
    },
    {
      "id": 156,
      "start": 1735.4200439453125,
      "end": 1738.260009765625,
      "text": " On that day that I got saved, He indwelled me."
    },
    {
      "id": 157,
      "start": 1738.260009765625,
      "end": 1739.5000610351562,
      "text": " And you know what the Holy Spirit does?"
    },
    {
      "id": 158,
      "start": 1739.5000610351562,
      "end": 1740.7400512695312,
      "text": " Man, He convicts us."
    },
    {
      "id": 159,
      "start": 1740.7400512695312,
      "end": 1745.2200317382812,
      "text": " Yes, He comforts us as well, but the Holy Spirit of God, He convicts us."
    },
    {
      "id": 160,
      "start": 1745.2200317382812,
      "end": 1747.9400634765625,
      "text": " And there were things that maybe I didn't even know a Bible verse yet."
    },
    {
      "id": 161,
      "start": 1747.9400634765625,
      "end": 1749.4600219726562,
      "text": " I had not heard the preaching yet."
    },
    {
      "id": 162,
      "start": 1749.4600219726562,
      "end": 1750.780029296875,
      "text": " I was a babe in Christ."
    },
    {
      "id": 163,
      "start": 1750.780029296875,
      "end": 1755.8200073242188,
      "text": " I desired to grow, but the Holy Spirit of God would convict me about certain things."
    },
    {
      "id": 164,
      "start": 1755.8200073242188,
      "end": 1757.4600219726562,
      "text": " You shouldn't be doing these things anymore."
    },
    {
      "id": 165,
      "start": 1757.4600219726562,
      "end": 1758.4600219726562,
      "text": " Why?"
    },
    {
      "id": 166,
      "start": 1758.4600219726562,
      "end": 1759.4600219726562,
      "text": " Because you're a Christian."
    },
    {
      "id": 167,
      "start": 1759.4600219726562,
      "end": 1760.4600219726562,
      "text": " You're saved."
    },
    {
      "id": 168,
      "start": 1760.4600219726562,
      "end": 1762.5400390625,
      "text": " You're a new creature."
    },
    {
      "id": 169,
      "start": 1762.5400390625,
      "end": 1767.7400512695312,
      "text": " And it's amazing the work of the Holy Spirit, but here's the problem."
    },
    {
      "id": 170,
      "start": 1767.7400512695312,
      "end": 1773.5400390625,
      "text": " For some, as we grow in our faith, as we kind of, I hate to even use the expression, but"
    },
    {
      "id": 171,
      "start": 1773.5400390625,
      "end": 1780.4600219726562,
      "text": " I think it's valid, there are times in which sometimes we get over our salvation."
    },
    {
      "id": 172,
      "start": 1780.4600219726562,
      "end": 1783.0400390625,
      "text": " We ought never get over our salvation."
    },
    {
      "id": 173,
      "start": 1783.0400390625,
      "end": 1786.4600219726562,
      "text": " We ought never get over the fact that God saved us."
    },
    {
      "id": 174,
      "start": 1786.4600219726562,
      "end": 1791.1000366210938,
      "text": " But I fear for some, it's as if they just kind of get over it."
    },
    {
      "id": 175,
      "start": 1791.1000366210938,
      "end": 1795.9000244140625,
      "text": " And they've learned how to quench and to grieve the Holy Spirit of God."
    },
    {
      "id": 176,
      "start": 1795.9000244140625,
      "end": 1798.6600341796875,
      "text": " They no longer are hearing the still small voice."
    },
    {
      "id": 0,
      "start": 1798.6600341796875,
      "end": 1804.6600341796875,
      "text": " See, Paul had this expectation. He writes about it in the book of Philemon."
    },
    {
      "id": 1,
      "start": 1804.6600341796875,
      "end": 1808.6600341796875,
      "text": " Turn over, if you will, quickly. It's only one chapter in the book of Philemon,"
    },
    {
      "id": 2,
      "start": 1808.6600341796875,
      "end": 1814.6600341796875,
      "text": " but we find in the book of Philemon the Apostle Paul is writing about an individual."
    },
    {
      "id": 3,
      "start": 1814.6600341796875,
      "end": 1818.6600341796875,
      "text": " The individual that he's writing about is a man by the name of Onesimus."
    },
    {
      "id": 4,
      "start": 1818.6600341796875,
      "end": 1823.6600341796875,
      "text": " Onesimus has this testimony as you read in the book of Philemon, and it's only 25 verses."
    },
    {
      "id": 5,
      "start": 1823.6600341796875,
      "end": 1825.6600341796875,
      "text": " It's a short book, just one chapter."
    },
    {
      "id": 6,
      "start": 1825.6600341796875,
      "end": 1834.6600341796875,
      "text": " And Paul is writing to Philemon, and specifically about Onesimus."
    },
    {
      "id": 7,
      "start": 1834.6600341796875,
      "end": 1838.6600341796875,
      "text": " And I want you to notice what Paul says."
    },
    {
      "id": 8,
      "start": 1838.6600341796875,
      "end": 1841.6600341796875,
      "text": " Beginning in verse number 10, the Bible says this,"
    },
    {
      "id": 9,
      "start": 1841.6600341796875,
      "end": 1846.6600341796875,
      "text": " I beseech thee for my son Onesimus."
    },
    {
      "id": 10,
      "start": 1846.6600341796875,
      "end": 1851.6600341796875,
      "text": " Now, was this guy Onesimus Paul's biological son? No."
    },
    {
      "id": 11,
      "start": 1851.6600341796875,
      "end": 1856.6600341796875,
      "text": " Paul refers to Timothy as his son in the faith. He refers to Titus as his son in the faith."
    },
    {
      "id": 12,
      "start": 1856.6600341796875,
      "end": 1859.6600341796875,
      "text": " And here he refers to Onesimus as my son."
    },
    {
      "id": 13,
      "start": 1859.6600341796875,
      "end": 1865.6600341796875,
      "text": " Was he referring to someone that God allowed him, Paul, to lead to Christ that was born again?"
    },
    {
      "id": 14,
      "start": 1865.6600341796875,
      "end": 1868.6600341796875,
      "text": " And we find that Paul is writing to Philemon."
    },
    {
      "id": 15,
      "start": 1868.6600341796875,
      "end": 1874.6600341796875,
      "text": " See, Philemon, Onesimus had been a slave, and Onesimus had fled."
    },
    {
      "id": 16,
      "start": 1874.6600341796875,
      "end": 1877.6600341796875,
      "text": " Philemon was his master."
    },
    {
      "id": 17,
      "start": 1877.6600341796875,
      "end": 1881.6600341796875,
      "text": " Paul writes to Philemon, and he says, I beseech thee for my son Onesimus,"
    },
    {
      "id": 18,
      "start": 1881.6600341796875,
      "end": 1885.6600341796875,
      "text": " notice, whom I have begotten in my bonds."
    },
    {
      "id": 19,
      "start": 1885.6600341796875,
      "end": 1890.6600341796875,
      "text": " Paul was in prison, but he was still preaching the gospel."
    },
    {
      "id": 20,
      "start": 1890.6600341796875,
      "end": 1895.6600341796875,
      "text": " Why? Because he knew the power of the gospel."
    },
    {
      "id": 21,
      "start": 1895.6600341796875,
      "end": 1897.6600341796875,
      "text": " He knew he'd have been saved by the grace of God,"
    },
    {
      "id": 22,
      "start": 1897.6600341796875,
      "end": 1900.6600341796875,
      "text": " and he knew he'd have been given to him the ministry of reconciliation."
    },
    {
      "id": 23,
      "start": 1900.6600341796875,
      "end": 1906.6600341796875,
      "text": " And he's preaching the gospel, and he says that this man, Onesimus, he got saved while I was in bonds."
    },
    {
      "id": 24,
      "start": 1906.6600341796875,
      "end": 1910.6600341796875,
      "text": " And notice in verse number 11, which, notice these words,"
    },
    {
      "id": 25,
      "start": 1910.6600341796875,
      "end": 1920.6600341796875,
      "text": " in time past was to thee, Philemon, unprofitable,"
    },
    {
      "id": 26,
      "start": 1920.6600341796875,
      "end": 1927.6600341796875,
      "text": " but now profitable to thee, Philemon, and to me, Paul."
    },
    {
      "id": 27,
      "start": 1927.6600341796875,
      "end": 1930.6600341796875,
      "text": " Now, notice these two phrases."
    },
    {
      "id": 28,
      "start": 1930.6600341796875,
      "end": 1932.6600341796875,
      "text": " I highlighted them as I read verse number 11."
    },
    {
      "id": 29,
      "start": 1932.6600341796875,
      "end": 1934.6600341796875,
      "text": " I have them underlined in my Bible."
    },
    {
      "id": 30,
      "start": 1934.6600341796875,
      "end": 1941.6600341796875,
      "text": " But notice the contrast between in time past, but now."
    },
    {
      "id": 31,
      "start": 1941.6600341796875,
      "end": 1944.6600341796875,
      "text": " In time past, he's unprofitable, but now he's profitable."
    },
    {
      "id": 32,
      "start": 1944.6600341796875,
      "end": 1947.6600341796875,
      "text": " What happened? Did he go to school? Did he get an education?"
    },
    {
      "id": 33,
      "start": 1947.6600341796875,
      "end": 1952.6600341796875,
      "text": " No, what happened was he got saved by the grace of God."
    },
    {
      "id": 34,
      "start": 1952.6600341796875,
      "end": 1955.6600341796875,
      "text": " He'd been born again. He was a new creature."
    },
    {
      "id": 35,
      "start": 1955.6600341796875,
      "end": 1960.6600341796875,
      "text": " And Paul says, this guy, Onesimus, my son, Onesimus, he was begotten."
    },
    {
      "id": 36,
      "start": 1960.6600341796875,
      "end": 1967.6600341796875,
      "text": " He was born again while I was in bonds, and he was to thee unprofitable, but now he's profitable."
    },
    {
      "id": 37,
      "start": 1967.6600341796875,
      "end": 1969.6600341796875,
      "text": " Why? Because he's been saved."
    },
    {
      "id": 38,
      "start": 1969.6600341796875,
      "end": 1972.6600341796875,
      "text": " He's not the same guy anymore."
    },
    {
      "id": 39,
      "start": 1972.6600341796875,
      "end": 1976.6600341796875,
      "text": " He's been transformed. Amen?"
    },
    {
      "id": 40,
      "start": 1976.6600341796875,
      "end": 1981.6600341796875,
      "text": " So Paul has an experience. Paul has an expectation."
    },
    {
      "id": 41,
      "start": 1981.6600341796875,
      "end": 1986.6600341796875,
      "text": " This morning, as we look at this verse of Scripture, 2 Corinthians 5 and verse 17,"
    },
    {
      "id": 42,
      "start": 1987.6600341796875,
      "end": 1993.6600341796875,
      "text": " Therefore, if any man be in Christ, he is a new creature."
    },
    {
      "id": 43,
      "start": 1993.6600341796875,
      "end": 1998.6600341796875,
      "text": " All things are passed away. Behold, all things are become new."
    },
    {
      "id": 44,
      "start": 1998.6600341796875,
      "end": 2006.6600341796875,
      "text": " Often as I share the gospel with individuals, I will say something to them like this when I come to Romans 10 and verse 13."
    },
    {
      "id": 45,
      "start": 2006.6600341796875,
      "end": 2011.6600341796875,
      "text": " For whosoever, and I'll say this, Ron, I'll say you can put your name right there."
    },
    {
      "id": 46,
      "start": 2011.6600341796875,
      "end": 2015.6600341796875,
      "text": " For whosoever, that means anyone."
    },
    {
      "id": 47,
      "start": 2015.6600341796875,
      "end": 2017.6600341796875,
      "text": " So maybe we can read the verse this way."
    },
    {
      "id": 48,
      "start": 2017.6600341796875,
      "end": 2022.6600341796875,
      "text": " For if Tim shall call upon the name of the Lord, Tim shall be saved."
    },
    {
      "id": 49,
      "start": 2022.6600341796875,
      "end": 2025.6600341796875,
      "text": " Because Tim is a whosoever. Amen?"
    },
    {
      "id": 50,
      "start": 2025.6600341796875,
      "end": 2028.6600341796875,
      "text": " And I'm a whosoever. And you're a whosoever."
    },
    {
      "id": 51,
      "start": 2028.6600341796875,
      "end": 2035.6600341796875,
      "text": " And for whosoever shall call upon the name of the Lord shall be saved. Hallelujah."
    },
    {
      "id": 52,
      "start": 2035.6600341796875,
      "end": 2039.6600341796875,
      "text": " As we wrap up the message this morning, we see the experience of Paul."
    },
    {
      "id": 53,
      "start": 2039.6600341796875,
      "end": 2041.6600341796875,
      "text": " We see the expectation of Paul."
    },
    {
      "id": 54,
      "start": 2041.6600341796875,
      "end": 2046.6600341796875,
      "text": " Number three, I want you to consider this thought, the evidence in my life."
    },
    {
      "id": 55,
      "start": 2046.6600341796875,
      "end": 2048.6600341796875,
      "text": " The evidence in my life."
    },
    {
      "id": 56,
      "start": 2048.6600341796875,
      "end": 2053.6600341796875,
      "text": " I want you to put your name there where it says, if any man be in Christ."
    },
    {
      "id": 57,
      "start": 2053.6600341796875,
      "end": 2055.6600341796875,
      "text": " The same way we would do with Romans 10 and verse 13."
    },
    {
      "id": 58,
      "start": 2055.6600341796875,
      "end": 2059.6600341796875,
      "text": " We're trying to lead somebody to Christ and tell them that Christ will save them."
    },
    {
      "id": 59,
      "start": 2059.6600341796875,
      "end": 2062.6600341796875,
      "text": " He is able. If any man be in Christ."
    },
    {
      "id": 60,
      "start": 2062.6600341796875,
      "end": 2065.6600341796875,
      "text": " And put your name right there where it says any man."
    },
    {
      "id": 61,
      "start": 2065.6600341796875,
      "end": 2068.6600341796875,
      "text": " And if you've trusted Christ as your Savior,"
    },
    {
      "id": 62,
      "start": 2068.6600341796875,
      "end": 2072.6600341796875,
      "text": " if you were that whosoever in Romans 10, 13 that recognized,"
    },
    {
      "id": 63,
      "start": 2072.6600341796875,
      "end": 2074.6600341796875,
      "text": " I can't get to heaven on my own."
    },
    {
      "id": 64,
      "start": 2074.6600341796875,
      "end": 2077.6600341796875,
      "text": " I recognize that Jesus is the only way."
    },
    {
      "id": 65,
      "start": 2077.6600341796875,
      "end": 2082.6600341796875,
      "text": " Maybe you're here this morning and you've been trying to live some type of religious life."
    },
    {
      "id": 66,
      "start": 2082.6600341796875,
      "end": 2085.6600341796875,
      "text": " You've been like Nicodemus. He was a ruler of the Jews."
    },
    {
      "id": 67,
      "start": 2085.6600341796875,
      "end": 2087.6600341796875,
      "text": " He was religious."
    },
    {
      "id": 68,
      "start": 2087.6600341796875,
      "end": 2092.6600341796875,
      "text": " But religion never saved a man."
    },
    {
      "id": 69,
      "start": 2092.6600341796875,
      "end": 2096.6600341796875,
      "text": " You say, but I'm seeking to keep the law."
    },
    {
      "id": 70,
      "start": 2096.6600341796875,
      "end": 2099.6600341796875,
      "text": " I had a conversation with someone about two months ago."
    },
    {
      "id": 71,
      "start": 2099.6600341796875,
      "end": 2103.6600341796875,
      "text": " They said, well, you know, we're just working to keep the law."
    },
    {
      "id": 72,
      "start": 2103.6600341796875,
      "end": 2106.6600341796875,
      "text": " In the very moment that they were telling me they were working to keep the law,"
    },
    {
      "id": 73,
      "start": 2106.6600341796875,
      "end": 2109.6600341796875,
      "text": " you know what they were doing? Breaking the law."
    },
    {
      "id": 74,
      "start": 2109.6600341796875,
      "end": 2112.6600341796875,
      "text": " They didn't even know it."
    },
    {
      "id": 75,
      "start": 2112.6600341796875,
      "end": 2114.6600341796875,
      "text": " But they were breaking the law."
    },
    {
      "id": 76,
      "start": 2114.6600341796875,
      "end": 2117.6600341796875,
      "text": " When they were telling me that they're seeking to keep the law."
    },
    {
      "id": 77,
      "start": 2117.6600341796875,
      "end": 2120.6600341796875,
      "text": " You know what the law does? It condemns."
    },
    {
      "id": 78,
      "start": 2120.6600341796875,
      "end": 2122.6600341796875,
      "text": " The law can't save you."
    },
    {
      "id": 79,
      "start": 2122.6600341796875,
      "end": 2125.6600341796875,
      "text": " You know what the law does? It points you to the only one that can."
    },
    {
      "id": 80,
      "start": 2125.6600341796875,
      "end": 2128.6600341796875,
      "text": " Jesus Christ."
    },
    {
      "id": 81,
      "start": 2128.6600341796875,
      "end": 2131.6600341796875,
      "text": " And this morning, if you're not saved,"
    },
    {
      "id": 82,
      "start": 2131.6600341796875,
      "end": 2135.6600341796875,
      "text": " you need to insert your name in that Romans 10, 13."
    },
    {
      "id": 83,
      "start": 2135.6600341796875,
      "end": 2139.6600341796875,
      "text": " For whosoever shall call upon the name of the Lord shall be saved."
    },
    {
      "id": 84,
      "start": 2139.6600341796875,
      "end": 2142.6600341796875,
      "text": " Religion won't save you."
    },
    {
      "id": 85,
      "start": 2142.6600341796875,
      "end": 2144.6600341796875,
      "text": " Good works won't save you."
    },
    {
      "id": 86,
      "start": 2144.6600341796875,
      "end": 2146.6600341796875,
      "text": " They can't."
    },
    {
      "id": 87,
      "start": 2146.6600341796875,
      "end": 2149.6600341796875,
      "text": " In fact, in the same book, in the book of Galatians, Paul said it this way."
    },
    {
      "id": 88,
      "start": 2149.6600341796875,
      "end": 2154.6600341796875,
      "text": " If righteousness were obtained by the law, then Christ is dead and vain."
    },
    {
      "id": 89,
      "start": 2154.6600341796875,
      "end": 2157.6600341796875,
      "text": " Listen, my Jesus did not die in vain."
    },
    {
      "id": 90,
      "start": 2157.6600341796875,
      "end": 2162.6600341796875,
      "text": " He died because it was the only way for humanity to be saved."
    },
    {
      "id": 91,
      "start": 2162.6600341796875,
      "end": 2164.6600341796875,
      "text": " There's no other way."
    },
    {
      "id": 92,
      "start": 2164.6600341796875,
      "end": 2166.6600341796875,
      "text": " No other way."
    },
    {
      "id": 93,
      "start": 2166.6600341796875,
      "end": 2168.6600341796875,
      "text": " Jesus had to go to that cross."
    },
    {
      "id": 94,
      "start": 2168.6600341796875,
      "end": 2170.6600341796875,
      "text": " And I'm glad he did."
    },
    {
      "id": 95,
      "start": 2170.6600341796875,
      "end": 2172.6600341796875,
      "text": " He went willingly. He said it this way."
    },
    {
      "id": 96,
      "start": 2172.6600341796875,
      "end": 2177.6600341796875,
      "text": " I lay down my life for the sheep."
    },
    {
      "id": 97,
      "start": 2177.6600341796875,
      "end": 2179.6600341796875,
      "text": " And I taketh it up again."
    },
    {
      "id": 98,
      "start": 2179.6600341796875,
      "end": 2182.6600341796875,
      "text": " Hallelujah, we serve a risen Savior."
    },
    {
      "id": 99,
      "start": 2183.6600341796875,
      "end": 2186.6600341796875,
      "text": " But this morning, if you've been saved,"
    },
    {
      "id": 100,
      "start": 2186.6600341796875,
      "end": 2188.6600341796875,
      "text": " and you've already trusted Christ as your Savior,"
    },
    {
      "id": 101,
      "start": 2188.6600341796875,
      "end": 2191.6600341796875,
      "text": " I want you to think about the evidence in your life from Romans,"
    },
    {
      "id": 102,
      "start": 2191.6600341796875,
      "end": 2193.6600341796875,
      "text": " or from 2 Corinthians 5 and verse 17."
    },
    {
      "id": 103,
      "start": 2193.6600341796875,
      "end": 2196.6600341796875,
      "text": " And I want you to put your name there."
    },
    {
      "id": 104,
      "start": 2196.6600341796875,
      "end": 2199.6600341796875,
      "text": " Therefore, if Chris, that's my name,"
    },
    {
      "id": 105,
      "start": 2199.6600341796875,
      "end": 2203.6600341796875,
      "text": " because it says if any man, any individual,"
    },
    {
      "id": 106,
      "start": 2203.6600341796875,
      "end": 2209.6600341796875,
      "text": " if Chris be in Christ, if I've been saved,"
    },
    {
      "id": 107,
      "start": 2209.6600341796875,
      "end": 2212.6600341796875,
      "text": " he is a new creature."
    },
    {
      "id": 108,
      "start": 2212.6600341796875,
      "end": 2214.6600341796875,
      "text": " Old things are passed away."
    },
    {
      "id": 109,
      "start": 2214.6600341796875,
      "end": 2216.6600341796875,
      "text": " Behold, all things are become new."
    },
    {
      "id": 110,
      "start": 2216.6600341796875,
      "end": 2219.6600341796875,
      "text": " What's the evidence of salvation in my life?"
    },
    {
      "id": 111,
      "start": 2219.6600341796875,
      "end": 2223.6600341796875,
      "text": " What's the evidence of salvation in your life?"
    },
    {
      "id": 112,
      "start": 2223.6600341796875,
      "end": 2227.6600341796875,
      "text": " See, because the gospel not only saves a man,"
    },
    {
      "id": 113,
      "start": 2227.6600341796875,
      "end": 2230.6600341796875,
      "text": " but the gospel transforms a man."
    },
    {
      "id": 114,
      "start": 2230.6600341796875,
      "end": 2235.6600341796875,
      "text": " And we find that Paul is giving his experience."
    },
    {
      "id": 115,
      "start": 2235.6600341796875,
      "end": 2237.6600341796875,
      "text": " He's sharing what his expectation is."
    },
    {
      "id": 116,
      "start": 2237.6600341796875,
      "end": 2241.6600341796875,
      "text": " But then for the recipients of this verse of Scripture,"
    },
    {
      "id": 117,
      "start": 2241.6600341796875,
      "end": 2246.6600341796875,
      "text": " for us today, as we would evaluate or examine,"
    },
    {
      "id": 118,
      "start": 2246.6600341796875,
      "end": 2249.6600341796875,
      "text": " what's the evidence point to?"
    },
    {
      "id": 119,
      "start": 2249.6600341796875,
      "end": 2253.6600341796875,
      "text": " What does the evidence point to?"
    },
    {
      "id": 120,
      "start": 2253.6600341796875,
      "end": 2256.6600341796875,
      "text": " Because if you're in Christ, if you're saved this morning,"
    },
    {
      "id": 121,
      "start": 2256.6600341796875,
      "end": 2258.6600341796875,
      "text": " you're a new creature."
    },
    {
      "id": 122,
      "start": 2258.6600341796875,
      "end": 2260.6600341796875,
      "text": " That's what the Bible says."
    },
    {
      "id": 123,
      "start": 2260.6600341796875,
      "end": 2265.6600341796875,
      "text": " It's not just adding another little G-O-D, God,"
    },
    {
      "id": 124,
      "start": 2265.6600341796875,
      "end": 2273.6600341796875,
      "text": " to your list of, no, Jesus Christ is the only Savior."
    },
    {
      "id": 125,
      "start": 2273.6600341796875,
      "end": 2276.6600341796875,
      "text": " How has it changed our lives, the gospel?"
    },
    {
      "id": 126,
      "start": 2276.6600341796875,
      "end": 2281.6600341796875,
      "text": " What transformation has taken place in your life, in my life?"
    },
    {
      "id": 127,
      "start": 2281.6600341796875,
      "end": 2284.6600341796875,
      "text": " Has it changed our behavior?"
    },
    {
      "id": 128,
      "start": 2284.6600341796875,
      "end": 2287.6600341796875,
      "text": " The things I used to do, I don't do them anymore."
    },
    {
      "id": 129,
      "start": 2287.6600341796875,
      "end": 2290.6600341796875,
      "text": " Has it changed our thoughts?"
    },
    {
      "id": 130,
      "start": 2290.6600341796875,
      "end": 2292.6600341796875,
      "text": " Has it changed our attitude?"
    },
    {
      "id": 131,
      "start": 2292.6600341796875,
      "end": 2294.6600341796875,
      "text": " Has it changed our perspective?"
    },
    {
      "id": 132,
      "start": 2294.6600341796875,
      "end": 2297.6600341796875,
      "text": " Has it changed our speech?"
    },
    {
      "id": 133,
      "start": 2297.6600341796875,
      "end": 2299.6600341796875,
      "text": " Has it changed my pursuits in life?"
    },
    {
      "id": 134,
      "start": 2299.6600341796875,
      "end": 2300.6600341796875,
      "text": " Has it changed..."
    },
    {
      "id": 135,
      "start": 2300.6600341796875,
      "end": 2303.6600341796875,
      "text": " Listen, I understand that it's on the inside,"
    },
    {
      "id": 136,
      "start": 2303.6600341796875,
      "end": 2306.6600341796875,
      "text": " but what's on the inside comes out on the outside."
    },
    {
      "id": 137,
      "start": 2306.6600341796875,
      "end": 2307.6600341796875,
      "text": " Amen?"
    },
    {
      "id": 138,
      "start": 2307.6600341796875,
      "end": 2308.6600341796875,
      "text": " Has it changed what I value?"
    },
    {
      "id": 139,
      "start": 2308.6600341796875,
      "end": 2310.6600341796875,
      "text": " Has it changed how I live my life?"
    },
    {
      "id": 140,
      "start": 2310.6600341796875,
      "end": 2313.6600341796875,
      "text": " Listen, this morning, before I was ever a pastor,"
    },
    {
      "id": 141,
      "start": 2313.6600341796875,
      "end": 2316.6600341796875,
      "text": " I've been pastor now for almost 14 years here at this church,"
    },
    {
      "id": 142,
      "start": 2316.6600341796875,
      "end": 2318.6600341796875,
      "text": " and I thank God for it."
    },
    {
      "id": 143,
      "start": 2318.6600341796875,
      "end": 2322.6600341796875,
      "text": " But I've been saved for a lot longer than 14 years."
    },
    {
      "id": 144,
      "start": 2322.6600341796875,
      "end": 2324.6600341796875,
      "text": " I've been pastoring here for 14 years, but you know what?"
    },
    {
      "id": 145,
      "start": 2324.6600341796875,
      "end": 2326.6600341796875,
      "text": " From the time I got saved, you know what?"
    },
    {
      "id": 146,
      "start": 2326.6600341796875,
      "end": 2330.6600341796875,
      "text": " I was in church all the time after I got saved."
    },
    {
      "id": 147,
      "start": 2330.6600341796875,
      "end": 2333.6600341796875,
      "text": " Before I got saved, Ron, I never went to church."
    },
    {
      "id": 148,
      "start": 2333.6600341796875,
      "end": 2335.6600341796875,
      "text": " I didn't want to go to church."
    },
    {
      "id": 149,
      "start": 2335.6600341796875,
      "end": 2336.6600341796875,
      "text": " Why?"
    },
    {
      "id": 150,
      "start": 2336.6600341796875,
      "end": 2337.6600341796875,
      "text": " There was nothing for me there."
    },
    {
      "id": 151,
      "start": 2337.6600341796875,
      "end": 2338.6600341796875,
      "text": " I was lost."
    },
    {
      "id": 152,
      "start": 2338.6600341796875,
      "end": 2340.6600341796875,
      "text": " I was dead."
    },
    {
      "id": 153,
      "start": 2340.6600341796875,
      "end": 2346.6600341796875,
      "text": " There was no desire in me to be in church as a lost person."
    },
    {
      "id": 154,
      "start": 2346.6600341796875,
      "end": 2349.6600341796875,
      "text": " But after I got saved, man, Sunday school, Sunday morning,"
    },
    {
      "id": 155,
      "start": 2349.6600341796875,
      "end": 2352.6600341796875,
      "text": " Sunday night, Wednesday night, revival meetings, missions conference,"
    },
    {
      "id": 156,
      "start": 2352.6600341796875,
      "end": 2353.6600341796875,
      "text": " bring it on."
    },
    {
      "id": 157,
      "start": 2353.6600341796875,
      "end": 2354.6600341796875,
      "text": " Amen?"
    },
    {
      "id": 158,
      "start": 2354.6600341796875,
      "end": 2357.6600341796875,
      "text": " And so much the more, as you see the day approaching,"
    },
    {
      "id": 159,
      "start": 2357.6600341796875,
      "end": 2360.6600341796875,
      "text": " I love to be with the people of God."
    },
    {
      "id": 160,
      "start": 2360.6600341796875,
      "end": 2362.6600341796875,
      "text": " But that's not just because I'm a pastor."
    },
    {
      "id": 161,
      "start": 2362.6600341796875,
      "end": 2364.6600341796875,
      "text": " It's because I'm a Christian."
    },
    {
      "id": 162,
      "start": 2364.6600341796875,
      "end": 2367.6600341796875,
      "text": " Because long before I ever became a pastor, you know what I did?"
    },
    {
      "id": 163,
      "start": 2367.6600341796875,
      "end": 2369.6600341796875,
      "text": " I went to church."
    },
    {
      "id": 164,
      "start": 2369.6600341796875,
      "end": 2372.6600341796875,
      "text": " Because we're the saints of God gathered together."
    },
    {
      "id": 165,
      "start": 2372.6600341796875,
      "end": 2375.6600341796875,
      "text": " The church is a body of believers."
    },
    {
      "id": 166,
      "start": 2375.6600341796875,
      "end": 2377.6600341796875,
      "text": " Listen, what do I value in life?"
    },
    {
      "id": 167,
      "start": 2377.6600341796875,
      "end": 2378.6600341796875,
      "text": " How do I spend my time?"
    },
    {
      "id": 168,
      "start": 2378.6600341796875,
      "end": 2380.6600341796875,
      "text": " How do I spend my treasure?"
    },
    {
      "id": 169,
      "start": 2380.6600341796875,
      "end": 2382.6600341796875,
      "text": " How do I use my talents?"
    },
    {
      "id": 170,
      "start": 2382.6600341796875,
      "end": 2389.6600341796875,
      "text": " It's all changed because I've been saved and I'm a new creature."
    },
    {
      "id": 171,
      "start": 2389.6600341796875,
      "end": 2395.6600341796875,
      "text": " And I wonder this morning, have you had that same experience that Paul had?"
    },
    {
      "id": 172,
      "start": 2395.6600341796875,
      "end": 2397.6600341796875,
      "text": " Can you evaluate your life?"
    },
    {
      "id": 173,
      "start": 2397.6600341796875,
      "end": 2398.6600341796875,
      "text": " Can you see evidence?"
    },
    {
      "id": 0,
      "start": 2398.6600341796875,
      "end": 2408.060033798218,
      "text": " in your life of this change. If any man be in Christ, he is a new creature. I can look"
    },
    {
      "id": 1,
      "start": 2408.060033798218,
      "end": 2418.7400341033936,
      "text": " at my life pre-salvation and post-salvation and I can see a radical change. I'm not perfect."
    },
    {
      "id": 2,
      "start": 2418.7400341033936,
      "end": 2423.860034942627,
      "text": " God's still working on me. And by the way, before you get too holy, you're not perfect"
    },
    {
      "id": 3,
      "start": 2423.860034942627,
      "end": 2433.700035095215,
      "text": " either. Amen? Right? Can I get an amen? Come on. None of us are. But one day, this mortal"
    },
    {
      "id": 4,
      "start": 2433.700035095215,
      "end": 2441.8200340270996,
      "text": " shall put on immortality. This corruption shall put on incorruption. Amen? That's going"
    },
    {
      "id": 5,
      "start": 2441.8200340270996,
      "end": 2447.580032348633,
      "text": " to be a radical change when I get to heaven. And what a day that will be. It's on the front"
    },
    {
      "id": 6,
      "start": 2447.580032348633,
      "end": 2454.5000343322754,
      "text": " of our bulletin this week. What a day that will be when my Jesus I shall see. But I'm"
    },
    {
      "id": 7,
      "start": 2454.5000343322754,
      "end": 2462.700035095215,
      "text": " asking you this morning, how's your life? Has it been radically changed because of the"
    },
    {
      "id": 8,
      "start": 2462.700035095215,
      "end": 2469.020034790039,
      "text": " gospel? You're just kind of like, you know what? I'm saved. I'm going to heaven. I'm"
    },
    {
      "id": 9,
      "start": 2469.020034790039,
      "end": 2474.0600357055664,
      "text": " still living for myself. I'm still doing my own thing. I still… No, listen. The gospel"
    },
    {
      "id": 10,
      "start": 2474.0600357055664,
      "end": 2483.2600326538086,
      "text": " transforms an individual. I'm not trying to talk anybody out of being saved this morning."
    },
    {
      "id": 11,
      "start": 2483.2600326538086,
      "end": 2490.0600357055664,
      "text": " But if I could talk you out of being saved, you better examine yourself. I'm not kept"
    },
    {
      "id": 12,
      "start": 2490.0600357055664,
      "end": 2498.5400314331055,
      "text": " by my works. I'm kept by God. I'm not kept by my works. But according to Ephesians 2,"
    },
    {
      "id": 13,
      "start": 2498.5400314331055,
      "end": 2505.2200317382812,
      "text": " 8, 9, and then 10, we are His workmanship in Christ Jesus and we are ordained to good"
    },
    {
      "id": 14,
      "start": 2505.2200317382812,
      "end": 2511.9600372314453,
      "text": " works. Titus talks about, many times, about good works. These works don't save me. These"
    },
    {
      "id": 15,
      "start": 2511.9600372314453,
      "end": 2520.2200317382812,
      "text": " works don't keep me saved. But they are a result of this transformation that's in Christ."
    },
    {
      "id": 16,
      "start": 2520.2200317382812,
      "end": 2528.6200408935547,
      "text": " Paul says, therefore, if any man be in Christ, he is a new creature. Old things are passed"
    },
    {
      "id": 17,
      "start": 2528.6200408935547,
      "end": 2536.9000396728516,
      "text": " away. Behold, all things are become new. Have you experienced the transformation of the"
    },
    {
      "id": 18,
      "start": 2536.9000396728516,
      "end": 2541.820037841797,
      "text": " gospel? I hope this morning that you can look at your life the same way I could look at"
    },
    {
      "id": 19,
      "start": 2541.820037841797,
      "end": 2547.9000396728516,
      "text": " my life, the same way Paul could look at his life. And so, you know what? Prior to that"
    },
    {
      "id": 20,
      "start": 2547.9000396728516,
      "end": 2555.260040283203,
      "text": " day that I was traveling to Damascus with those letters giving me the ability to take"
    },
    {
      "id": 21,
      "start": 2555.260040283203,
      "end": 2563.3800354003906,
      "text": " captive those that were Christians, to imprison them, prior to that day and after that day,"
    },
    {
      "id": 22,
      "start": 2563.3800354003906,
      "end": 2572.060028076172,
      "text": " my life was radically different because Jesus changed my life. If you're not saved this"
    },
    {
      "id": 23,
      "start": 2572.060028076172,
      "end": 2581.1400299072266,
      "text": " morning, today is the day of salvation. He wants to save you. And after He saves us,"
    },
    {
      "id": 24,
      "start": 2581.1400299072266,
      "end": 2589.020034790039,
      "text": " He wants us to be conformed to the image of His dear Son. That we be like Jesus. Amen?"
    },
    {
      "id": 25,
      "start": 2589.020034790039,
      "end": 2596.260040283203,
      "text": " Romans 8, verse 29, it speaks about that. That we are to be like Christ. It's a great"
    },
    {
      "id": 26,
      "start": 2596.260040283203,
      "end": 2602.1400299072266,
      "text": " work that God does in our lives. This morning, evaluate your life. Has there been a great"
    },
    {
      "id": 27,
      "start": 2602.1400299072266,
      "end": 2608.9800415039062,
      "text": " change in my life? Could people see it? You meet somebody that you knew prior to being"
    },
    {
      "id": 28,
      "start": 2608.9800415039062,
      "end": 2616.2200317382812,
      "text": " saved and then you run into them now and they're like, whoa, what happened to you? I got saved."
    },
    {
      "id": 29,
      "start": 2616.2200317382812,
      "end": 2623.4200286865234,
      "text": " God changed my life. I'm a new creature. Praise the Lord. Let's pray together. Father, we"
    },
    {
      "id": 30,
      "start": 2623.4200286865234,
      "end": 2629.4200286865234,
      "text": " love You. We thank You for loving us. We thank You for the power of the Gospel. Thank"
    },
    {
      "id": 31,
      "start": 2629.4200286865234,
      "end": 2637.1400299072266,
      "text": " You for saving my soul. Thank You for changing my life. Thank You for the testimony of the"
    },
    {
      "id": 32,
      "start": 2637.1400299072266,
      "end": 2643.3400268554688,
      "text": " Apostle Paul. Lord, I pray that You would help us this morning. If there's one that's"
    },
    {
      "id": 33,
      "start": 2643.3400268554688,
      "end": 2646.8600311279297,
      "text": " not saved, God, I pray they'd come to this old-fashioned altar. We'd have an opportunity"
    },
    {
      "id": 34,
      "start": 2646.8600311279297,
      "end": 2652.9800415039062,
      "text": " to share the Gospel with them. They'd be saved by the grace of God. For every child of God"
    },
    {
      "id": 35,
      "start": 2652.9800415039062,
      "end": 2661.7200317382812,
      "text": " in this building today, Lord, I pray that we'd evaluate our lives. I pray that not one"
    },
    {
      "id": 36,
      "start": 2661.7200317382812,
      "end": 2667.820037841797,
      "text": " of us have gotten over our salvation, but maybe it'd be true of someone here. They're"
    },
    {
      "id": 37,
      "start": 2667.820037841797,
      "end": 2673.6200256347656,
      "text": " just kind of going through the motions, so to speak. God, I pray that You'd help us to"
    },
    {
      "id": 38,
      "start": 2673.6200256347656,
      "end": 2681.260040283203,
      "text": " allow You to have Your will in way, that those changes would be evidenced in our lives, proofs"
    },
    {
      "id": 39,
      "start": 2681.260040283203,
      "end": 2687.820037841797,
      "text": " of salvation, proofs of being a new creature. In this time of invitation, would You have"
    },
    {
      "id": 40,
      "start": 2687.820037841797,
      "end": 2691.7000427246094,
      "text": " Your will in way? We give You the glory for all that You'll do. For it's in Christ's name"
    },
    {
      "id": 41,
      "start": 2691.7000427246094,
      "end": 2694.740020751953,
      "text": " we pray. Would you stand with me? Heads are bowed, eyes are closed."
    }
  ],
  "processed_at": "2025-04-14T19:04:03.581450"
}