{
  "video_id": "IgF7S1e9tQM",
  "text": "We're going to be looking at verses 5 through 11 this morning, 1 Timothy 1, verses 5 through 11. I'm thankful for God's Word, aren't you? And what a blessing to have the Bible and so thankful for the content and for the instruction that God gives us. We understand that all Scripture is given by inspiration of God and it's profitable for what? For doctrine is the first thing that's mentioned in 2 Timothy 3 and verse 16 when you look at that verse of Scripture. And so thankful for God's Word, the teaching of God's Word. We look at this portion of Scripture in 1 Timothy 1. We'll be looking this morning at verses 5 through 11. Last week as we looked at the beginning of this portion of Scripture, we concluded that we have each been equipped for the task of continuing. We know, we understand this morning as we'll study throughout this calendar year, the charge that is received that we continue. And I said this last week, it's not enough to just understand the charge, it's not even enough to accept the challenge, the call to continue. We must be equipped to continue. I'm thankful that God's given us all that we need and we understand that His equipping of His saints and what a blessing to understand this morning that He's given us all things that pertain unto life and godliness and we dealt with His provision for us and what He provides us with, but also the plan that He has for each of us and as we are mindful of God's plan for us, even as we noted the plan that God had for Timothy, the plan that God had for Paul, that God also has a plan for us and that enables us to continue and what a blessing. As we move through the text of Scripture, we note the importance of doctrine and we receive instruction for how we are to continue and we understand as we look here and we look to the Scriptures, there's a right way and there's a wrong way. I believe this morning that we must strive to continue in the right doctrine, thus pleasing the Lord. In verse number five, the Bible says, Now the end of the commandment is charity out of a pure heart, and of a good conscience, and of faith unfeigned, from which some, having swerved, have turned aside unto vain jangling, desiring to be teachers of the law, understanding neither what they say nor whereof they affirm. But we know that the law is good, if a man use it lawfully, knowing this, that the law is not made for a righteous man, but for the lawless and disobedient, for the ungodly and for sinners, for unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for whoremongers, for them that defile themselves with mankind, for men-stealers, for liars, for perjured persons, and if there be any other thing that is contrary to sound doctrine. According to the glorious gospel of the blessed God, which was committed to my trust. As we look here, and again as I made the statement already, we must strive to continue in the right direction, thus pleasing the Lord, and as we continue, we must acknowledge the biblical truth that doctrine matters. That doctrine matters. Making good time going in the wrong direction is no good. Amen? You say, man, I'm making great time, but you're going the wrong way. No one cares. It's not, you're not going to, you're just going to reach the wrong destination sooner. And so we find this morning that doctrine matters. That's the title for the message. I will not take the time this morning to look at all the verses in 1st and 2nd Timothy. There are twelve verses within these chapters of Scripture, ten chapters, that reference in some way doctrine. And using the word specifically, and we'll study through those as we get through the calendar year as we come to each of those portions of Scripture. But what I want you to do this morning by way of introduction is hold your place here in 1st Timothy, but turn on the book of Titus, if you will, and just so that we can understand and kind of wrap our minds around this thought as we enter into the message this morning that doctrine matters. Again, we live in a time, I mentioned this last week, that the society in which we're living, they're becoming less and less concerned about doctrine. If you think about Christendom, very broadly speaking, and Christianity, people will use that terminology. And there are many that are saying, don't worry about doctrine. Don't let doctrine divide. Well, doctrine will divide. Doctrine matters. And as we look at the Scriptures, we find in one reference before we look here in Titus, that we understand that Paul had told Timothy that the time will come when they will not endure sound doctrine. So therefore, change your message to accommodate them so that they'll keep coming. Is that what Paul told Timothy? No, that's not what Paul told Timothy. Paul told Timothy, preach the word. Be instant in season, out of season. Reprove, rebuke, exhort with all longsuffering and doctrine. And then he tells them, but they're not going to endure sound doctrine. But it doesn't change the charge to continue to preach the word and to preach doctrine. Why? Because doctrine matters. In the book of Titus, Paul is writing to Titus, again, another that he would refer to as his son of the faith, a man that he was investing in, understanding the course that he would run, just as he's invested in Timothy. But I want you to notice, in Titus 1 and verse number 5, the Bible says this, for this cause left I thee in Crete. And so we find, just like he gave the charge to Timothy in 1 Timothy chapter 1 that we looked at last week with what Paul's charge was to him to, as Paul was going to leave to go to Macedonia, that he stays in Ephesus, remember, that he charged them not to teach anything that's contrary to the doctrine, and he left him there for that purpose. Remember, as we look back at Acts 20 last week, Paul knew that after his departure there would be some grievous wolves that would come in, not sparing the flock of God. He also knew of their own selves there would be men that would rise up. And so Paul, God gave Paul the direction, God in his infinite wisdom says, Timothy is going to stay here, and he's going to help preserve this doctrine, this teaching, that I want to be preserved. Well, for Titus here, Paul says, for this cause left I thee in Crete, that thou shouldest set in order things that are wanting. There were some problems. And he says, and ordain elders in every city as I had appointed thee. So we see the responsibility of Titus, but then I want you to notice in the next few verses, as we kind of pick our way through here by way of introduction, the emphasis even here on doctrine. In verse number 9 of Titus 1, the Bible says, speaking about these qualifications for those that he would set in order, ordaining these elders in every city, it says in verse 9, holding fast the faithful word as he hath been taught, that he may be able, notice, by sound doctrine, both to exhort and to convince the gainsayers. Why? For there are many unruly and vain talkers and deceivers, especially they of the circumcision. We know that when he uses that terminology, the circumcision, he's speaking about Jews, and we find that he's saying, listen, there's going to be some people that are coming in with some false teaching. Guess what? We're going to deal with that in 1st Timothy this morning as well. And we find that he talks about being sound in doctrine, that they're holding fast the faithful word as he hath been taught. In verse number 13, this witness is true, wherefore rebuke them sharply, that they may be sound in the faith. Verse 16, they profess that they know God, but in works they deny Him. Being abominable and disobedient and unto every good work reprobate, but speak, chapter 2 and verse number 1, thou the things which become sound doctrine. We find that as soon as the church is established and the church is moving forward for the cause of Christ, we understand that there are false teachers that would show up on the scene. The reality is that those false teachers were there then, and they continue to be here still to this day. And we find that as we look back in 1st Timothy chapter number 1 and begin to dissect this portion of scripture this morning, notice with me first of all the exposure of false teachers. I'm thankful that God is able to expose false teaching. I'm thankful that He has given us His word so that we too might be able to expose false teaching. Not everything that you listen, not every eloquent speaker, because of their eloquence means that what they're saying is true. Amen? There are some people, listen, not the person that has the most follows, the most likes, the most people that are going and liking their post and following them, it doesn't mean that they're right. Amen? How do we determine what's right and what's wrong? Right here, the Bible. He says in 1st John that we're to try the spirits. Amen? We understand, and we'll mention at the end of the message this morning in Jude, that we're to earnestly contend for the faith that was once delivered unto the saints, and we find the exposure of false teachers here in this portion of scripture. Notice in verse number 6 where He begins to introduce us to these false teachers, He's already spoken about the call that He gave Him, that He would charge some, according to verse number 3, that they teach no other doctrine, neither would they give heed to fables and endless genealogies. But in verse number 6, notice He says, from which some, having, do you see that word swerved? It's kind of an interesting word. It says that from some having swerved have turned aside unto vain jangling.\" As God is giving His Word here and as Paul is speaking to Timothy, we find that he is exposing these false teachers, their exposure is noted, where they are being exposed for their false teaching. He says that these are described as being those that have swerved. It means to deviate from, it means to miss the mark. In my mind, it really has the exact opposite of continue. They've swerved. They've turned aside. They've deviated from the path that has been established and they've swerved. The Bible tells us that they've swerved and notice they've turned aside unto vain jangling. That's kind of interesting phraseology, isn't it? You know what it means? Useless talk. Useless talk. You ever listen to somebody that talks for a long time and they don't really say anything? You know what I mean? You hear somebody give a presentation, a speech, and you're kind of like, what in the world? There's no real meat to the message. And here he talks about this vain jangling, this useless talk, and really when we look at verse number 6 and see how these false teachers are being exposed and we see that they have swerved, they've deviated from the path, they've missed the mark, they've turned to vain jangling, this useless talk, we find that really what's happening in verse number 4, which we studied last week, it gives us some insight into this useless talk. It was that they were dealing with these fables and these endless genealogies and you know what the result was? The result was questions, not godly edifying. And we see that in verse number 4. And so we find that as we look here and we see how these false teachers are being exposed, that Paul says they've swerved, they've turned to vain jangling. But then as we come to verse number 7, we see that these false teachers, they're really not qualified. Notice the Bible says, desiring to be teachers of the law. Now if we just stopped right there, we'd say that's a commendable desire, to be a teacher of the law. That's a commendable desire, but notice what Paul says, understanding neither what they say nor whereof they affirm. So they have a desire but they're not qualified. They simply don't know what they're talking about, if we could put it in very basic English this morning. And so we find that here, as Paul is saying that they're not qualified, it's very interesting when we look at how these false teachers are being exposed in the first chapter, that later on, a couple of chapters later in chapter 3, and we'll look at it in great detail as we move through the book, but turn over just for a moment to chapter 3, and notice what the Bible says in verse number 1 of chapter number 3 of this book. This is a true saying. If a man desire the office of a bishop, he desireth a good work. And so we see here that thought of desire, we see it in verse number 7 of chapter 1, these that were false teachers, they had a desire to teach the law, but they weren't qualified, and so we find that in chapter number 3, God gives a list of qualifications for those that would desire the office of a bishop. You know one of them at the end of verse number 2? Apt to teach. Apt to teach. In chapter number 1 in verse number 7, he says they desire to be teachers of the law, but they understand neither what they say nor whereof they affirm. In the 1828 Noah Webster's Dictionary, one of the definitions that is given for the word apt is qualified or fit. And so we find that these false teachers that are being mentioned here, that are being exposed in this portion of Scripture, in the very introduction to this letter, we find that these false teachers are being exposed and God is giving instruction to Timothy on how to deal with this. We'll look at it in just a moment. But we understand the way that these folks, they've swerved, they've turned to vain jangling, they're not qualified. What are they doing? Well, they did not properly understand or apply the Old Testament law. Really, as we look at the text of Scripture, we see exactly that's what's being dealt with. And they did not properly understand it, nor did they properly apply the Old Testament law. In fact, in Acts chapter 15, if you were to look there in that portion of Scripture and see the council at Jerusalem and what's taking place, in Acts 15.1, there were people that were coming, these Judaizers, and they were saying, except a man be circumcised after the manner of Moses, you cannot be saved. Now Paul, he was having none of that. No, no, no. That is not true. And there was a big conversation, a council that's recorded for us in Acts 15 in Jerusalem of all that took place with that. And you know what they concluded? That they're saved just like we're saved by grace through faith because it's the blood of Jesus Christ, His death barrel and glorious resurrection that allows for a man, woman, boy, girl to be saved. Amen? Has nothing to do with circumcision, has nothing to do with baptism, has nothing to do with any other religious rite or ritual. It's through the blood of Jesus Christ. Amen? And we find that as we look at this portion of Scripture that they did not notice understanding in verse number 7, neither what they say nor whereof they affirm. Paul then immediately gets into the subject of the law. Why would Paul deal with the subject of the law? Well, that's because that's where they've erred. That's where they've gone astray. That's where they've swore from. That's where they've turned to vain jangling. And we find that Paul is going to set the record straight. He's going to help them to understand the sound doctrine. And so we see that they did not properly understand. We find that their teaching, as I mentioned a moment ago, it resulted in questions, not in godly edifying. Now understand this morning that it's certainly appropriate and applicable that even still today that teaching may result in questions, but those questions can be answered by God's Word. The idea of what's being given here in verse number 4 about these false teachers that it generates these questions which minister questions is that it just leaves people at a dead end. You know, a lot of religion today leaves people at a dead end. They're confused. No hope, no peace, no direction, confusion. By the way, who's the author of confusion? Not my God. Satan is the author of confusion. And we find that, I'm thankful, listen, we say it often, that the Bible has the answer. Aren't you thankful for that? I was reading this morning the book of Numbers. Somebody shared with me a testimony about reading Leviticus. I just finished Leviticus just a couple of days ago. Man, I love the book of Leviticus. I know so many people say, man, the book of Leviticus. Man, it is a great book that really shows the work and ministry of the Lord Jesus Christ and His offering that He made for us. I mean, it's a precious book. But I was in the book of Numbers this morning and there's a unique thing that happened in the life and ministry of Moses. There was a circumstance that came up that had not been given direction from God yet. You know what Moses did? He said, hold on, let me go ask God. And he went to the Lord and guess what God did? He gave him an answer. Praise God. We have a Bible. God's given us this book. And in this book, the Bible, we often sing the B-I-B-L-E. Yes, that's the book for me. And I'm thankful that our doctrine is based on the Bible, the Bible teaching. And we go to the Bible. We have a question. We say, Lord, you've given us this book. Provide us with the answer. Help us to have an understanding. Illumine the scriptures to us so that we might understand what you desire, what your plan is. And we go to the Bible and we understand that God's given us principles. And those principles are applicable in life. And we see that what was happening with these false teachers is that it was leaving them, those followers at this dead end, these questions that could not be answered, no hope and no peace. And Paul is exposing, God is exposing the false teachers. Now, here's something for us to be mindful of this morning, that false teachers were present and active in the beginning of the church and they're present and active in this day of the church age. We find that the scriptures say this, Paul exposes false teaching. God uses Paul to expose false teaching. God uses Peter to expose false teaching. Of course, there's a number of other portions of scripture that we could go to, but each of them have portions of scripture in their books that deal with the characteristics of false teaching. Jude deals with it as well, but you see, you can just go through those characteristics. But Peter says this, he says, as there were false prophets, even so there will be false teachers. Now, understand what Peter is communicating there as he says that. The people of God could understand, you and I this morning can understand as we go to the Old Testament and read the Old Testament that there are many references that God has recorded for us of false prophets that existed in the Old Testament. And so Peter says, under the inspiration of the Holy Spirit of God, just as there were false prophets then, there will be false teachers today. So God's Word exposes false teaching. And I'm thankful for that. When we look here at this portion of Scripture, we find not only the exposure of false teaching, but number two, we find the emphasis on sound doctrine. The emphasis on sound doctrine. I mentioned already that these false teachers were mishandling the law, and therefore, what does Paul do? He addresses the law. Notice in verse number eight, as we continue, we'll get to verse number five at the end of the message, but notice in verse number eight, the Bible says, but we know. Now that's a level of confidence, is it not? He says, we don't think, he's not saying, no, we know that the law is good. If a man use it lawfully, do you know what that word lawfully means? It means properly. It means properly. So what was happening with the false teachers, I mentioned that they did not properly understand or apply the Old Testament law. We can talk about the idea of legalism, and we can talk about the idea of obtaining some level of grace and favor, merit from God because of this outward obedience to the law. That's not the purpose of the law. That's not properly understanding or applying the law, and we find, we'll end ourselves in the book of Galatians at some point this morning, but we find that he says that the law is good, but it must be used lawfully, properly. This in verse number 10, we'll go back to verse nine in just a moment. At the end of verse number 10, it says, and if there be any other thing that is contrary to sound doctrine. Now as we look at the word lawfully in verse number eight, we see that that means properly. As we come to verse number 10, and we see the phrase of sound doctrine, the word sound means to be healthy. It means this, to be free from any mixture of error, to be free from any mixture of error. You know, one of the things and one of the reasons that we're going to have in our Sunday school class for the next several weeks, a study on why we use the King James Bible, you understand why, how the enemy is seeking to introduce error, to mix truth with error is through so many of the modern translations. So many of the modern translations today, all of a sudden there's this mixture of error, there's this confusion, there's this contradiction that you'll find in a number of these new modern translations, and we're just going to go ahead and study through a bunch of them and just let it be said, here's what these modern translations say, and here's where they're wrong, and here's how it changes doctrine. Doctrine matters. The enemy is behind that, for the enemy is the one in Genesis chapter number three that said, yea, hath God said, ye shall not surely die, no, in the day that ye eat thereof you'll be like gods. That's what Satan said in Genesis three. By the way, he's a liar, he's the father of it, amen? We find here that as Paul would use these words, every word of God is pure, God gave him these words lawfully to have a proper understanding and application of the law. Sound doctrine, that which is healthy, that which is free from any mixture of error, obviously when you look at the teaching of these false teachers, it's nothing, it's not sound. It's infiltrated with error, it's diseased, if you will, if we could look at the use of that word sound and looking at the contradiction between that which is appropriate and to be taught versus that which these false teachers were teaching, and so when we look at the emphasis on sound doctrine, let me say this, proper interpretation and application of Scripture is absolutely essential. Proper interpretation and application of Scripture. Peter says in 2 Peter 1 verse 20 and 21 that no prophecy is of any private interpretation. So often, and I'm going to make a number of statements here with regard to proper interpretation and application of Scripture, we talk about the interpretation of Scripture, a theological word that's used as hermeneutics, right, the hermeneutical approach to interpreting Scripture, hermeneutics, and we find here that when we deal with the proper interpretation and application of Scripture, the context is key. You know how a lot of false teachings have been raised? Through taking Scripture out of context. You take one verse of Scripture and you just remove it from its context and you build some teaching on this singular verse of Scripture, giving no mind to the context in which that truth was given. It's a very dangerous thing. Every once in a while I'll preach a topical message. Exegetical messages are enjoyable to preach, no doubt. Primarily I preach exegetical messages. I like to preach within the context of what the Scriptures… I love preaching through books of the Bible. If you've been here since I've been here, I don't know, there's like 24, 26 books of the Bible that I have preached or taught through in the 12 years that I've been here, and we go verse by verse through those books of Scripture, and that helps… What is it saying in the Old Testament? Line upon line, precept upon precept. And so many false teachings have been made just so available to people by taking a verse out of context. Let me say this, there must be an understanding of whether the verse of Scripture is to be interpreted literally or figuratively. We must be careful not to over-spiritualize or under-spiritualize. We must keep it within context, and sometimes there's literal, sometimes there's figurative. We understand that. When we talk about some of the figurative, we'd understand some of these manners of writing. And the Bible… Listen, there are times in which the Bible uses metaphors. There are times in which the Bible uses allegories. In fact, Paul says in Galatians, this is an allegory, right? He's giving us an understanding of a passage of Scripture in the book of Genesis when he refers to it as being an allegory, so metaphors, allegories, similes. We think about parables. Jesus often taught with parables, right? And so we have to understand that as we take and look at the Scriptures and we desire to understand that doctrine matters, that when we build our faith, our doctrine, our teaching, that proper interpretation and application of Scripture is key. As you look in this portion of Scripture, Timothy is being given this charge. He's received the charge already in verse number three, as I besought thee. This is something that happened before, and now Paul is writing back to him. As you would understand the way in which this is being given to Timothy, Paul had given him this charge. He says, as I besought thee to abide. And as Timothy had this responsibility, the understanding God's plan for his life, it began to get hard, because there's false teachers. You know what's interesting? It seems as if a lot of false teachers can get a great following of people. You ever notice that? They wax eloquent, they say all these things, and man, all of a sudden people just start following me. You're like, hey, what in the world? At one point, I don't know that it's true any longer, I've not seen statistics on this for probably at least a decade, but statistics a couple of decades ago would indicate that a number of cults in America, that one of the number one quote-unquote convert that they received was from Baptist churches. You say, what in the world? How does somebody that's sitting in a Baptist church hearing the teaching of God's word, if it's being done appropriately, if the pastor is teaching and preaching and placing the emphasis on sound doctrine, how does a cult member show up at your door or my door and get me to turn my back on what God says and follow them? But you see the evidence of it. Timothy is in a situation where the false teachers are teaching, and no doubt they're influencing some, and maybe there's some, as it says, of which some having swerved in verse number six, and these false teachers, they're teaching what they do not understand, they're not qualified to do so, but yet they're gathering, they get a following. You know, that can be discouraging for Timothy, can be discouraging for the man of God. So what does God do? God has Paul write him a letter. Let me encourage you to continue. Let me encourage you to understand that doctrine matters. Because sometimes, if you're not careful, and I believe you've seen this in our churches around America, even in the last generation, where churches just little by little change. To accommodate, to be able to keep a crowd, to be able to pay a mortgage, yeah, they build a big building, and they get a big mortgage, and all of a sudden, you can't afford to lose people. You understand what I'm saying? I'm not advocating that you be unkind and try to lose people just by being unkind. But what I'm saying is that doctrine matters. And God is using Paul to write this letter to encourage Timothy and to help him understand there's this emphasis that's placed on sound doctrine. We've exposed the false teachers, they're not, listen, they've swerved, they've turned their vein jangling. They're not qualified. They're teaching results. They're not qualified.  It's in questions, not godly edifying. And so Timothy understand the emphasis on doctrine. We have to understand the importance of proper interpretation and application of scripture. He says that the law in verse number eight is good if a man use it lawfully. He then says in verses nine and 10, knowing this, that the law is not made for a righteous man, but for the lawless and disobedient, for the ungodly and for sinners, for unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for whoremongers, for them that defile themselves with mankind, for men stealers, for liars, for perjured persons. And then he puts this clause in there. And if there be any other thing that is contrary to sound doctrine, I like the last clause, amen. Anything that's contrary to sound doctrine. But we find that he lists a number of things here and provides us with that detail. But really what he's giving us is helping us to understand, if we could say it this way, the purpose of the law. What's the purpose of the law? Well, the purpose of the law is very simply, again, why would Paul deal with this? Well, because the false teachers were mishandling the law and therefore Paul begins right there with the law. He says, let me help you understand the law is good if a man use it lawfully. And then he shares with and helps Timothy, helps us understand the purpose of the law in these few verses of scripture. It's interesting because he speaks about sound doctrine at the end of verse number 10. And then as you go into verse number 11, it says according to the glorious gospel of the blessed God, which was committed to my trust. So Paul understands that it was committed to him, the gospel. He says, I'm not ashamed of the gospel of Christ. It's the power of God unto salvation, to everyone that believe it, to the Jew first and also to the Greek. In Romans chapter number one, and Paul understood the responsibility that had been given to him for it's been committed to him. But it's interesting how he takes a direct line from dealing with the law to the glorious gospel. And really in these couple of verses of scripture, and as we look at the book of Galatians, we see that that's exactly the purpose of the law. It exposes sin and points us to Jesus. If we could boil it down to a simple statement, the purpose of the law is to expose sin and point us to Jesus. Look in Galatians three, if you will. As you're turning to Galatians three, I'm going to read a verse of scripture to you from the book of Romans. Romans chapter seven and verse number seven. And then I will meet you over in Galatians chapter number three. So Galatians chapter three, we're gonna look at verses 21 through 24. Give you a moment to turn there. And then I want you to listen as I read Romans seven and verse number seven. In Romans seven, Paul says this in verse number seven. What shall we say then? Is the law sin? God forbid. Nay. Notice what Paul says. I had not known sin, but by the law. For I had not known lust, except the law had said, thou shall not covet. So Paul is saying plainly his own testimony in Romans 7.7. This is the purpose of the law. He expounds on this in Galatians three. Now understand the book of Galatians is a book that is written to four churches in the region of Galatia. These four churches were established during the first missionary journey. And as these churches were established, something happened in the region of Galatia. And that was that these Judaizers came in. And these Judaizers came in, they're very disappointed. They're upset about the fact that people are being saved and not following Judaism and so on and so forth. And so they come in, they try to bring in this false teaching, this mixture. It really gives us what happens in Acts 15 that I mentioned earlier. There were some that said you had to be circumcised after the matter of Moses in order to be saved. And so that's dealt with here in Galatians. But in Galatians chapter number three in verse 24, notice what Paul says. Verse 21, we'll start in verse 21. Is the law then against the promises of God? God forbid. For if there had been a law given which could have given life, verily righteousness should have been by the law. But guess what? The law can't give life. All the law does is expose sin. You know what the law does? It condemns. The law tells you that you're guilty. And someone says, well, I'm not really that bad. No, no, you're guilty. And you're condemned. And it's just the reality of the Bible. And he says that the law, if there had been a law given which could have given life, verily righteousness should have been by the law. But, verse 22, the Scripture hath concluded all under sin that the promise by faith of Jesus Christ might be given to them that believe. But before faith came, we were kept under the law, shut up under the faith which should afterwards be revealed. Wherefore, notice verse 24, the law was our schoolmaster for what purpose? To bring us unto Christ. That we might be justified not by the law, for no flesh can be justified by the law, but by faith. That word schoolmaster is an interesting word. The word schoolmaster does not mean a teacher. A lot of people think it means teacher. It's not what it means. The word schoolmaster is really within the context of understanding the era of history in the society. It was a guardian or a guide who would accompany really privileged boys to be instructed. They could not give the instruction, but they took them to the one who could. Now think about that just for a moment. That's why he says the law's a schoolmaster. It can't give you life, but it can point you to the one that can. By the way, let me say it this way, the only one that can. In him was life. Amen. And we find that as we look at this portion of Scripture in 1 Timothy, as Paul is writing and he's understanding, again, God has given the word. It's by inspiration that God understands the circumstances, all that's taking place. And Timothy is in Ephesus and he's supposed to be standing and he's supposed to be teaching and he's supposed to be charging others that they teach no other doctrine. But man, there's these false teachers that they've come in and they've swerved from the truth and they've turned into vain jangling and they're teaching what they don't understand. They're not qualified to do it, but yet it seems as if there's some people that are following them. And Paul says, Timothy, doctrine matters. Let me help you understand as we look in 1 Timothy 1, the purpose of the law. Timothy, don't be afraid of the law. Just understand the purpose of the law. Listen, if we know the truth, we don't have to be afraid of any false teaching. I don't have to be afraid of any other cult or any other denomination or any other world religion. I don't have to be afraid of it. And by the way, I don't have to be a master of what any of those particular religions would teach. I have to be a master of this book. And as I master this book, as I understand the truth of this book, then I simply am able to expose the error because I know the truth. You know, truth always exposes error. Always. Truth always exposes error. That's why he said, sanctify them by thy word. Thy word is truth. The truth of God's word. Timothy, don't be afraid of the law. Understand the purpose of the law. Understand the purpose of the law. Then we see the product of the law because the law, it can't produce life, but it points us to the one. And as it points us to Jesus Christ, it brings us to Christ. And we find that as the law would bring us to Christ, we look at verse number five. Now the end of the commandment is charity out of a pure heart and of a good conscience and of faith unfeigned. If I could summarize love, righteousness, and faith. But those things don't come by the law. They come through Christ because we understand the purpose of the law is to expose and to condemn, but really to point us to the one who gives life, the one who is love, the one who is righteous. And he allows us to have that love and that righteousness and that faith. It enables us to be able to please him. Listen, the law has a purpose. The law points us to the Lord Jesus Christ. And we see in verse number five, the result of that. Now I'm thankful this morning. Again, we don't have to be intimidated by the law. We don't have to be intimidated by the Old Testament. We don't have to be intimidated by somebody coming and saying, well, you know that the... No, no, just study the Bible. Interpret scripture with scripture. Keep it within its context. Amen. I found so often what happens is people wanna grab a verse of scripture out of context. You say, hold on a minute, let's read that in its context. Let's read the whole chapter. Let's maybe read the chapter before and the chapter after, right? Let's look at some other verses of scripture that God gives us, a parallel passage that God gives us. I've said this, we should never build a doctrine on a... an obscurity when it's in opposition to an obvious. There are some times that you go to the scripture and say, well, at the surface level it might sound like this. No, no, dig in. In Hebrews chapter number six, so many people love to run to Hebrews chapter number six and say you can lose your salvation. The Bible all over the place calls it eternal security, eternal, or excuse me, eternal life, everlasting life, right? That's the gift of God. And by the way, if you study Hebrews, you find in chapter number six, as they want to go and run to that passage, that before and after chapter number six, you know what the Bible talks about? How that God is the author of eternal life, eternal salvation. So you're going to tell me that prior to he tells us that he's the author of eternal salvation and then he's going to tell you that you could lose it, it doesn't even make sense. You can find that over and over and over. Can I tell you this morning, false teachers are prevalent all over the place. You know where they are very prevalent today? On the internet. On the internet. On the internet. Man, they get a lot of followers, get a lot of, you know, so often what happens it seems as you can type in a question in Google, seems like Google knows everything. Be careful. Be careful. You know, this AI stuff that's come out, be careful. Be careful. They're rewriting the Bible, be careful. We've seen it in modern translations, but you see it, I read an article not long ago in China. Listen, China, they don't let you have a Bible in China, but all of a sudden they're rewriting John chapter number 8. John chapter number 8 deals with people bringing someone to Christ, a lady, that said she was caught in the very act of adultery. She should be stoned. The law condemns her. Well, actually, if you go back to the law, it condemns both he and she. Amen? Leviticus. Just go back and read it. But they want to see her stoned. Jesus, as only He can, He just bends down as if He's not even listening to them. He just starts writing. I think He's writing their sin. That's just what I believe. I have no idea what He's writing. It doesn't tell us. But He's just writing, and He says, let him that hath no sin cast the first stone. And then He says to her, hey, where are these nine accusers? They're all gone, because they were guilty too. And then Jesus said to her, go and sin no more. Amen? John 8. You know what they're saying in China? After the accusers left, Jesus stoned her. Yeah. Yeah. Do you understand what kind of picture that paints of Jesus? Think about the ramifications. Listen, false teaching is so prevalent today. You type something in Google and you think the first results that pop up must be the right ones. That's not always true. Those algorithms are not always in our best interest. It's beyond my ability how they can process nine million websites as quickly as they can and all that they do to provide you with the results that they provide you with. But I would tell you that they're not, the first one that pops up isn't always the right one. You can't believe everything you see on the Internet. You can't believe every YouTube preacher. I don't care how many followers they have. God's Word exposes false teaching. You can't believe the guy that has the biggest church. And I'm not saying that all of those people are false teachers. I'm simply saying we must be careful. We must be careful, because false teachers, they exist, they're exposed by God's Word. And then the emphasis is placed on sound doctrine. As we continue, we must continue with the knowledge that doctrine matters. Because we have to continue in a manner in which is pleasing to God. God didn't just say continue and continue however you want. No, continue and here's the path to continue on. Continue carries with it in my mind the concept, if you will, of making progress. But that progress is the right direction. You ever find somebody that's busy, but they're not busy doing what they're supposed to be doing? You know what I'm saying? You find some people on the work site that seem like they work harder to get out of work than if they just work. No, no. He says we're to continue and he says doctrine matters. Turn over to Jude and we'll end there. Jude has one chapter. And I want you to see what Jude writes of. There is a great exposure of false teaching in this short letter, the short book of Jude. Jude begins in verse number one. Jude the servant of Jesus Christ, by the way, it's a good title, to be the servant of Jesus Christ. And brother of James, to them that are sanctified by God the Father and preserved in Jesus Christ and called. Mercy unto you and peace and love be multiplied. Beloved, when I gave all diligence to write unto you of the common salvation. This is not common as in just it's a low quality or of little value. No, it's that they had common salvation amongst them. They were saved by the grace of God. He says, notice in verse number three, it was needful for me to write unto you and exhort you that you should earnestly contend for the faith which was once delivered unto the saints. So really, God allows Jude to express his heart in this book and say, I was planning to write to you on this, but God said, no, this is needed. You know, as a pastor, I can relate to that. There are sometimes there's some messages I'd like to preach that are just kind of exhorting kind of messages, and sometimes God says, no, we need this today, and I want to follow the leadership of the Holy Spirit of God. I shared with you a study that we did on Wednesday evening on Psalm 143 at the end of last year. I didn't know why God led me there. I was desiring to go a completely different way. It was amazing after that study, actually in the midst of that study, there were a number of people that came and said, I needed this. God knows that. I'm not smart enough to figure that out. But God knows, and Jude says, I was desiring to write on this. This is what I planned to write on, but it was needful for me to write unto you and to exhort you that you should earnestly contend for the faith which was once delivered on the saints. Why? Verse four, for there are certain men crept in. Do you notice that word unawares? You know what's interesting about false teachers? They don't come in and say, hey, I'm a false teacher. They don't have a banner that they carry, there's no sign on their forehead or on their back that says, I'm a false teacher. No, they come in unawares. You know what happens often with these false teachers? They try to use the same kind of terminology that you'll use. I've said this before, that false teachers use our vocabulary but not our dictionary. They'll use the same words. You talk to somebody about being born again, they'll need something totally different. Oh yeah, I was born again, I was baptized. No, no, no, that's not being born again. Amen? That's not the Bible definition of being born again. And so we see that it says that they've crept in unawares who were before of old ordained to the condemnation, ungodly men, turning the grace of our God into lasciviousness and denying the only Lord God and our Lord Jesus Christ. So Jude writes that these brethren would earnestly contend for the faith. Why? Because doctrine matters. Faith that's mentioned here is really, it would encompass, if you will, that doctrine, right? All of that teaching. And he says that we would earnestly contend for the faith. Not today as we look at the truth, not all men love the Lord. There are some that are the enemies of the cross. Now some are easy to identify, but some are not. And Paul says, Timothy, continue. God has equipped you, but here is the manner in which you must continue. Doctrine matters. We must remember that. As we go through this study this year, we must remember that in our own lives. We do not bend, we do not fold on what thus saith the Lord. You say, it's not popular anymore, Pastor. God's Word endures. God's Word stands. We want to have the right position. We want to have the right disposition. We want to love people to Jesus. But the reality is that God's Word is plain and doctrine matters. Let's pray. Father, we love you. We thank you for loving us. We thank you for the charge that was given to Timothy, and we thank you that after receiving that charge and understanding how he'd been equipped, that there's an... exposure of these false teachers. There's an emphasis on sound doctrine. God, I pray that you would help us to be students of the Word, that we would study to show ourselves approved. We'll see that as Paul writes to Timothy. I pray that you'd help us to know how we ought to behave ourselves. We see that again as Paul writes to Timothy in the house of God, understanding that it's the pillar and ground of the truth. God, help us to understand that doctrine matters. Help us to know thy Word. Help us, Lord, not to be alarmed by or worried about false teaching. Help us to simply be ground in the faith. Help us to be students of your Word. God, I pray that as we, as individuals, seek to live our lives to please you and to continue, Lord, I pray that you'd help us to understand that doctrine matters. Help us to be careful of the books that we read, of the websites that we visit, of the messages that we listen to. Lord, help us to prove, to try the spirits, to prove all things, Lord, to understand that doctrine matters. I pray that you would move and work in hearts and lives, Lord. We spoke about the purpose of the law, to expose sin. It condemns. It cannot give life. It simply reveals that we're guilty. But it points us to the one, the only one, the Lord Jesus Christ that can give life. God, I pray that if there's one present this morning that's never been saved, God, I pray that you'd move and work in their heart, Lord. Draw them to yourself. I pray the Holy Spirit of God would convince them of their sin of Christ's righteousness and of judgment to come. I pray that in a moment of invitation, Lord, this morning that we would be doers of the word and not hearers only. Help us, Lord, to make that commitment to be students of the word, to know doctrine, to be settled and grounded in the faith. Well, thank you for each decision that's made. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.9600000381469727,
      "text": " We're going to be looking at verses 5 through 11 this morning, 1 Timothy 1,"
    },
    {
      "id": 1,
      "start": 3.9600000381469727,
      "end": 7.71999979019165,
      "text": " verses 5 through 11. I'm thankful for God's Word, aren't you?"
    },
    {
      "id": 2,
      "start": 7.71999979019165,
      "end": 12.199999809265137,
      "text": " And what a blessing to have the Bible and so thankful for"
    },
    {
      "id": 3,
      "start": 12.199999809265137,
      "end": 15.640000343322754,
      "text": " the content and for the instruction that God gives us. We understand that all"
    },
    {
      "id": 4,
      "start": 15.640000343322754,
      "end": 19.040000915527344,
      "text": " Scripture is given by inspiration of God and it's profitable"
    },
    {
      "id": 5,
      "start": 19.040000915527344,
      "end": 22.479999542236328,
      "text": " for what? For doctrine is the first thing that's mentioned in 2 Timothy 3"
    },
    {
      "id": 6,
      "start": 22.479999542236328,
      "end": 25.15999984741211,
      "text": " and verse 16 when you look at that verse of Scripture."
    },
    {
      "id": 7,
      "start": 25.15999984741211,
      "end": 31.079999923706055,
      "text": " And so thankful for God's Word, the teaching of God's Word."
    },
    {
      "id": 8,
      "start": 31.079999923706055,
      "end": 34.2400016784668,
      "text": " We look at this portion of Scripture in 1 Timothy 1."
    },
    {
      "id": 9,
      "start": 34.2400016784668,
      "end": 37.79999923706055,
      "text": " We'll be looking this morning at verses 5 through 11. Last week as we looked at the"
    },
    {
      "id": 10,
      "start": 37.79999923706055,
      "end": 38.720001220703125,
      "text": " beginning"
    },
    {
      "id": 11,
      "start": 38.720001220703125,
      "end": 41.959999084472656,
      "text": " of this portion of Scripture, we concluded"
    },
    {
      "id": 12,
      "start": 41.959999084472656,
      "end": 46.52000045776367,
      "text": " that we have each been equipped for the task of continuing. We know, we"
    },
    {
      "id": 13,
      "start": 46.52000045776367,
      "end": 48.279998779296875,
      "text": " understand this morning"
    },
    {
      "id": 14,
      "start": 48.279998779296875,
      "end": 52.08000183105469,
      "text": " as we'll study throughout this calendar year, the charge that is received that we"
    },
    {
      "id": 15,
      "start": 52.08000183105469,
      "end": 53.20000076293945,
      "text": " continue."
    },
    {
      "id": 16,
      "start": 53.20000076293945,
      "end": 56.959999084472656,
      "text": " And I said this last week, it's not enough to just understand the charge,"
    },
    {
      "id": 17,
      "start": 56.959999084472656,
      "end": 60.47999954223633,
      "text": " it's not even enough to accept the challenge, the call to continue."
    },
    {
      "id": 18,
      "start": 60.47999954223633,
      "end": 64.5999984741211,
      "text": " We must be equipped to continue. I'm thankful that God's given us all that we"
    },
    {
      "id": 19,
      "start": 64.5999984741211,
      "end": 65.36000061035156,
      "text": " need"
    },
    {
      "id": 20,
      "start": 65.36000061035156,
      "end": 68.68000030517578,
      "text": " and we understand that His"
    },
    {
      "id": 21,
      "start": 68.68000030517578,
      "end": 73.76000213623047,
      "text": " equipping of His saints and what a blessing to understand this morning"
    },
    {
      "id": 22,
      "start": 73.76000213623047,
      "end": 77.4000015258789,
      "text": " that He's given us all things that pertain unto life and godliness"
    },
    {
      "id": 23,
      "start": 77.4000015258789,
      "end": 82.5199966430664,
      "text": " and we dealt with His provision for us and what He provides us with, but"
    },
    {
      "id": 24,
      "start": 82.5199966430664,
      "end": 83.91999816894531,
      "text": " also the plan"
    },
    {
      "id": 25,
      "start": 83.91999816894531,
      "end": 88.31999969482422,
      "text": " that He has for each of us and as we are mindful of God's plan for us, even as we"
    },
    {
      "id": 26,
      "start": 88.31999969482422,
      "end": 89.0,
      "text": " noted"
    },
    {
      "id": 27,
      "start": 89.0,
      "end": 92.4800033569336,
      "text": " the plan that God had for Timothy, the plan that God had for Paul,"
    },
    {
      "id": 28,
      "start": 92.4800033569336,
      "end": 96.16000366210938,
      "text": " that God also has a plan for us and that enables us to continue"
    },
    {
      "id": 29,
      "start": 96.16000366210938,
      "end": 99.23999786376953,
      "text": " and what a blessing. As we move through the text of Scripture,"
    },
    {
      "id": 30,
      "start": 99.23999786376953,
      "end": 104.4000015258789,
      "text": " we note the importance of doctrine and we receive instruction for how we are to"
    },
    {
      "id": 31,
      "start": 104.4000015258789,
      "end": 105.4000015258789,
      "text": " continue"
    },
    {
      "id": 32,
      "start": 105.4000015258789,
      "end": 109.31999969482422,
      "text": " and we understand as we look here and we look to"
    },
    {
      "id": 33,
      "start": 109.31999969482422,
      "end": 113.55999755859375,
      "text": " the Scriptures, there's a right way and there's a wrong way. I believe this"
    },
    {
      "id": 34,
      "start": 113.55999755859375,
      "end": 115.76000213623047,
      "text": " morning that we must strive to continue"
    },
    {
      "id": 35,
      "start": 115.76000213623047,
      "end": 118.83999633789062,
      "text": " in the right doctrine, thus pleasing"
    },
    {
      "id": 36,
      "start": 118.83999633789062,
      "end": 122.44000244140625,
      "text": " the Lord. In verse number five, the Bible says, Now the end of the commandment is"
    },
    {
      "id": 37,
      "start": 122.44000244140625,
      "end": 124.16000366210938,
      "text": " charity out of a pure heart,"
    },
    {
      "id": 38,
      "start": 124.16000366210938,
      "end": 129.0,
      "text": " and of a good conscience, and of faith unfeigned, from which some, having swerved, have"
    },
    {
      "id": 39,
      "start": 129.0,
      "end": 131.60000610351562,
      "text": " turned aside unto vain jangling,"
    },
    {
      "id": 40,
      "start": 131.60000610351562,
      "end": 135.60000610351562,
      "text": " desiring to be teachers of the law, understanding neither what they say nor"
    },
    {
      "id": 41,
      "start": 135.60000610351562,
      "end": 137.0800018310547,
      "text": " whereof they affirm."
    },
    {
      "id": 42,
      "start": 137.27999877929688,
      "end": 140.8000030517578,
      "text": " But we know that the law is good, if a man use it lawfully,"
    },
    {
      "id": 43,
      "start": 140.8000030517578,
      "end": 145.0800018310547,
      "text": " knowing this, that the law is not made for a righteous man, but for the lawless"
    },
    {
      "id": 44,
      "start": 145.0800018310547,
      "end": 146.24000549316406,
      "text": " and disobedient,"
    },
    {
      "id": 45,
      "start": 146.24000549316406,
      "end": 149.9199981689453,
      "text": " for the ungodly and for sinners, for unholy and profane, for murderers of"
    },
    {
      "id": 46,
      "start": 149.9199981689453,
      "end": 151.63999938964844,
      "text": " fathers and murderers of mothers,"
    },
    {
      "id": 47,
      "start": 151.63999938964844,
      "end": 155.9600067138672,
      "text": " for manslayers, for whoremongers, for them that defile themselves with mankind,"
    },
    {
      "id": 48,
      "start": 155.9600067138672,
      "end": 159.47999572753906,
      "text": " for men-stealers, for liars, for perjured persons,"
    },
    {
      "id": 49,
      "start": 159.47999572753906,
      "end": 164.27999877929688,
      "text": " and if there be any other thing that is contrary to sound doctrine."
    },
    {
      "id": 50,
      "start": 164.55999755859375,
      "end": 167.83999633789062,
      "text": " According to the glorious gospel of the blessed God,"
    },
    {
      "id": 51,
      "start": 167.83999633789062,
      "end": 170.8800048828125,
      "text": " which was committed to my trust."
    },
    {
      "id": 52,
      "start": 170.8800048828125,
      "end": 173.9600067138672,
      "text": " As we look here, and again as I made the statement already, we must strive to"
    },
    {
      "id": 53,
      "start": 173.9600067138672,
      "end": 176.9600067138672,
      "text": " continue in the right direction,"
    },
    {
      "id": 54,
      "start": 176.9600067138672,
      "end": 182.1199951171875,
      "text": " thus pleasing the Lord, and as we continue, we must acknowledge the"
    },
    {
      "id": 55,
      "start": 182.1199951171875,
      "end": 183.67999267578125,
      "text": " biblical truth"
    },
    {
      "id": 56,
      "start": 183.67999267578125,
      "end": 187.72000122070312,
      "text": " that doctrine matters. That doctrine matters."
    },
    {
      "id": 57,
      "start": 187.72000122070312,
      "end": 191.36000061035156,
      "text": " Making good time going in the wrong direction"
    },
    {
      "id": 58,
      "start": 191.36000061035156,
      "end": 197.47999572753906,
      "text": " is no good. Amen? You say, man, I'm making great time, but you're going the wrong way."
    },
    {
      "id": 59,
      "start": 197.47999572753906,
      "end": 200.8000030517578,
      "text": " No one cares. It's not, you're not going to, you're just going to reach the wrong"
    },
    {
      "id": 60,
      "start": 200.8000030517578,
      "end": 202.60000610351562,
      "text": " destination sooner."
    },
    {
      "id": 61,
      "start": 202.60000610351562,
      "end": 207.16000366210938,
      "text": " And so we find this morning that doctrine matters. That's the title for the message."
    },
    {
      "id": 62,
      "start": 207.16000366210938,
      "end": 210.63999938964844,
      "text": " I will not take the time this morning to look at all the verses in 1st and"
    },
    {
      "id": 63,
      "start": 210.63999938964844,
      "end": 211.8000030517578,
      "text": " 2nd Timothy."
    },
    {
      "id": 64,
      "start": 211.8000030517578,
      "end": 215.8800048828125,
      "text": " There are twelve verses within these chapters of Scripture, ten chapters,"
    },
    {
      "id": 65,
      "start": 215.8800048828125,
      "end": 219.36000061035156,
      "text": " that reference in some way doctrine."
    },
    {
      "id": 66,
      "start": 219.36000061035156,
      "end": 223.63999938964844,
      "text": " And using the word specifically, and we'll study through those as we get"
    },
    {
      "id": 67,
      "start": 223.63999938964844,
      "end": 225.27999877929688,
      "text": " through the calendar year"
    },
    {
      "id": 68,
      "start": 225.27999877929688,
      "end": 229.39999389648438,
      "text": " as we come to each of those portions of Scripture. But what I want you to do this"
    },
    {
      "id": 69,
      "start": 229.39999389648438,
      "end": 232.55999755859375,
      "text": " morning by way of introduction is hold your place here in 1st Timothy, but turn on the"
    },
    {
      "id": 70,
      "start": 232.55999755859375,
      "end": 234.27999877929688,
      "text": " book of Titus, if you will,"
    },
    {
      "id": 71,
      "start": 234.27999877929688,
      "end": 237.67999267578125,
      "text": " and just so that we can understand and kind of wrap our minds around this"
    },
    {
      "id": 72,
      "start": 237.67999267578125,
      "end": 240.39999389648438,
      "text": " thought as we enter into the message this morning"
    },
    {
      "id": 73,
      "start": 240.39999389648438,
      "end": 245.83999633789062,
      "text": " that doctrine matters. Again, we live in a time, I mentioned this last week,"
    },
    {
      "id": 74,
      "start": 245.83999633789062,
      "end": 249.1199951171875,
      "text": " that the society in which we're living,"
    },
    {
      "id": 75,
      "start": 249.1199951171875,
      "end": 253.52000427246094,
      "text": " they're becoming less and less concerned about doctrine. If you"
    },
    {
      "id": 76,
      "start": 253.52000427246094,
      "end": 255.1199951171875,
      "text": " think about Christendom,"
    },
    {
      "id": 77,
      "start": 255.1199951171875,
      "end": 259.9200134277344,
      "text": " very broadly speaking, and Christianity, people will use that terminology."
    },
    {
      "id": 78,
      "start": 259.9200134277344,
      "end": 263.1199951171875,
      "text": " And there are many that are saying, don't worry about doctrine."
    },
    {
      "id": 79,
      "start": 263.1199951171875,
      "end": 268.8800048828125,
      "text": " Don't let doctrine divide. Well, doctrine will divide. Doctrine matters."
    },
    {
      "id": 80,
      "start": 268.8800048828125,
      "end": 273.55999755859375,
      "text": " And as we look at the Scriptures, we find in one reference before we look"
    },
    {
      "id": 81,
      "start": 273.55999755859375,
      "end": 274.4800109863281,
      "text": " here in Titus,"
    },
    {
      "id": 82,
      "start": 274.4800109863281,
      "end": 278.2799987792969,
      "text": " that we understand that Paul had told Timothy"
    },
    {
      "id": 83,
      "start": 278.2799987792969,
      "end": 282.4800109863281,
      "text": " that the time will come when they will not endure"
    },
    {
      "id": 84,
      "start": 282.4800109863281,
      "end": 288.1600036621094,
      "text": " sound doctrine. So therefore, change your message to accommodate them so that"
    },
    {
      "id": 85,
      "start": 288.1600036621094,
      "end": 289.4800109863281,
      "text": " they'll keep coming."
    },
    {
      "id": 86,
      "start": 289.4800109863281,
      "end": 293.0799865722656,
      "text": " Is that what Paul told Timothy? No, that's not what Paul told Timothy."
    },
    {
      "id": 87,
      "start": 293.0799865722656,
      "end": 297.67999267578125,
      "text": " Paul told Timothy, preach the word. Be instant in season, out of season. Reprove,"
    },
    {
      "id": 88,
      "start": 297.67999267578125,
      "end": 298.8800048828125,
      "text": " rebuke, exhort"
    },
    {
      "id": 89,
      "start": 298.8800048828125,
      "end": 302.79998779296875,
      "text": " with all longsuffering and doctrine."
    },
    {
      "id": 90,
      "start": 302.79998779296875,
      "end": 305.8800048828125,
      "text": " And then he tells them, but they're not going to endure sound doctrine."
    },
    {
      "id": 91,
      "start": 305.8800048828125,
      "end": 309.1199951171875,
      "text": " But it doesn't change the charge to continue to preach the word and to"
    },
    {
      "id": 92,
      "start": 309.1199951171875,
      "end": 310.3599853515625,
      "text": " preach doctrine."
    },
    {
      "id": 93,
      "start": 310.3599853515625,
      "end": 313.44000244140625,
      "text": " Why? Because doctrine matters. In the book of Titus,"
    },
    {
      "id": 94,
      "start": 313.44000244140625,
      "end": 316.760009765625,
      "text": " Paul is writing to Titus, again,"
    },
    {
      "id": 95,
      "start": 316.760009765625,
      "end": 320.239990234375,
      "text": " another that he would refer to as his son of the faith, a man"
    },
    {
      "id": 96,
      "start": 320.239990234375,
      "end": 325.5199890136719,
      "text": " that he was investing in, understanding the course that he would run, just as"
    },
    {
      "id": 97,
      "start": 325.5199890136719,
      "end": 327.1600036621094,
      "text": " he's invested in Timothy."
    },
    {
      "id": 98,
      "start": 327.1600036621094,
      "end": 330.9599914550781,
      "text": " But I want you to notice, in Titus 1 and verse number 5, the Bible says this,"
    },
    {
      "id": 99,
      "start": 330.9599914550781,
      "end": 333.8399963378906,
      "text": " for this cause left I thee in Crete."
    },
    {
      "id": 100,
      "start": 333.8399963378906,
      "end": 337.0400085449219,
      "text": " And so we find, just like he gave the charge to Timothy in 1 Timothy"
    },
    {
      "id": 101,
      "start": 337.0400085449219,
      "end": 339.55999755859375,
      "text": " chapter 1 that we looked at last week with what"
    },
    {
      "id": 102,
      "start": 339.55999755859375,
      "end": 344.1199951171875,
      "text": " Paul's charge was to him to, as Paul was going to leave to go to Macedonia, that"
    },
    {
      "id": 103,
      "start": 344.1199951171875,
      "end": 346.6400146484375,
      "text": " he stays in Ephesus, remember,"
    },
    {
      "id": 104,
      "start": 346.6400146484375,
      "end": 351.6400146484375,
      "text": " that he charged them not to teach anything that's contrary to the doctrine,"
    },
    {
      "id": 105,
      "start": 351.6400146484375,
      "end": 356.0400085449219,
      "text": " and he left him there for that purpose. Remember, as we look back at Acts 20 last"
    },
    {
      "id": 106,
      "start": 356.0400085449219,
      "end": 356.6000061035156,
      "text": " week,"
    },
    {
      "id": 107,
      "start": 356.6000061035156,
      "end": 360.7200012207031,
      "text": " Paul knew that after his departure there would be some grievous wolves that would"
    },
    {
      "id": 108,
      "start": 360.7200012207031,
      "end": 363.1199951171875,
      "text": " come in, not sparing the flock of God."
    },
    {
      "id": 109,
      "start": 363.1199951171875,
      "end": 366.760009765625,
      "text": " He also knew of their own selves there would be men that would rise up."
    },
    {
      "id": 110,
      "start": 366.760009765625,
      "end": 371.6400146484375,
      "text": " And so Paul, God gave Paul the direction, God in his infinite wisdom"
    },
    {
      "id": 111,
      "start": 371.6400146484375,
      "end": 376.6000061035156,
      "text": " says, Timothy is going to stay here, and he's going to help preserve this doctrine,"
    },
    {
      "id": 112,
      "start": 376.6000061035156,
      "end": 377.79998779296875,
      "text": " this teaching,"
    },
    {
      "id": 113,
      "start": 377.79998779296875,
      "end": 382.67999267578125,
      "text": " that I want to be preserved. Well, for Titus here, Paul says, for this cause left"
    },
    {
      "id": 114,
      "start": 382.67999267578125,
      "end": 384.0400085449219,
      "text": " I thee in Crete,"
    },
    {
      "id": 115,
      "start": 384.0400085449219,
      "end": 388.4800109863281,
      "text": " that thou shouldest set in order things that are wanting. There were some"
    },
    {
      "id": 116,
      "start": 388.4800109863281,
      "end": 389.6000061035156,
      "text": " problems."
    },
    {
      "id": 117,
      "start": 389.6000061035156,
      "end": 393.239990234375,
      "text": " And he says, and ordain elders in every city"
    },
    {
      "id": 118,
      "start": 393.239990234375,
      "end": 397.8399963378906,
      "text": " as I had appointed thee. So we see the responsibility of Titus,"
    },
    {
      "id": 119,
      "start": 397.8399963378906,
      "end": 401.9599914550781,
      "text": " but then I want you to notice in the next few verses, as we kind of pick our"
    },
    {
      "id": 120,
      "start": 401.9599914550781,
      "end": 404.20001220703125,
      "text": " way through here by way of introduction,"
    },
    {
      "id": 121,
      "start": 404.20001220703125,
      "end": 410.0,
      "text": " the emphasis even here on doctrine. In verse number 9 of Titus 1,"
    },
    {
      "id": 122,
      "start": 410.0,
      "end": 413.3599853515625,
      "text": " the Bible says, speaking about these qualifications for those that he would"
    },
    {
      "id": 123,
      "start": 413.3599853515625,
      "end": 414.760009765625,
      "text": " set in order,"
    },
    {
      "id": 124,
      "start": 414.760009765625,
      "end": 418.7200012207031,
      "text": " ordaining these elders in every city, it says in verse 9,"
    },
    {
      "id": 125,
      "start": 418.7200012207031,
      "end": 422.3999938964844,
      "text": " holding fast the faithful word as he hath been taught,"
    },
    {
      "id": 126,
      "start": 422.3999938964844,
      "end": 425.55999755859375,
      "text": " that he may be able, notice, by sound"
    },
    {
      "id": 127,
      "start": 425.55999755859375,
      "end": 429.6400146484375,
      "text": " doctrine, both to exhort and to convince"
    },
    {
      "id": 128,
      "start": 429.6400146484375,
      "end": 435.760009765625,
      "text": " the gainsayers. Why? For there are many unruly and vain talkers and deceivers,"
    },
    {
      "id": 129,
      "start": 435.760009765625,
      "end": 440.44000244140625,
      "text": " especially they of the circumcision. We know that when he uses that terminology,"
    },
    {
      "id": 130,
      "start": 440.44000244140625,
      "end": 443.0,
      "text": " the circumcision, he's speaking about Jews,"
    },
    {
      "id": 131,
      "start": 443.0,
      "end": 446.0799865722656,
      "text": " and we find that he's saying, listen, there's going to be some people that are coming in"
    },
    {
      "id": 132,
      "start": 446.0799865722656,
      "end": 449.0799865722656,
      "text": " with some false teaching. Guess what? We're going to deal with that in 1st Timothy"
    },
    {
      "id": 133,
      "start": 449.0799865722656,
      "end": 450.32000732421875,
      "text": " this morning as well."
    },
    {
      "id": 134,
      "start": 450.32000732421875,
      "end": 454.1600036621094,
      "text": " And we find that he talks about being sound in doctrine,"
    },
    {
      "id": 135,
      "start": 454.1600036621094,
      "end": 457.4800109863281,
      "text": " that they're holding fast the faithful word"
    },
    {
      "id": 136,
      "start": 457.4800109863281,
      "end": 461.5199890136719,
      "text": " as he hath been taught. In verse number 13, this witness is true,"
    },
    {
      "id": 137,
      "start": 461.5199890136719,
      "end": 466.7200012207031,
      "text": " wherefore rebuke them sharply, that they may be sound"
    },
    {
      "id": 138,
      "start": 466.7200012207031,
      "end": 471.6000061035156,
      "text": " in the faith. Verse 16, they profess that they know God,"
    },
    {
      "id": 139,
      "start": 471.6000061035156,
      "end": 475.0,
      "text": " but in works they deny Him. Being abominable"
    },
    {
      "id": 140,
      "start": 475.0,
      "end": 478.239990234375,
      "text": " and disobedient and unto every good"
    },
    {
      "id": 141,
      "start": 478.239990234375,
      "end": 482.6000061035156,
      "text": " work reprobate, but speak, chapter 2 and verse number 1,"
    },
    {
      "id": 142,
      "start": 482.6000061035156,
      "end": 485.67999267578125,
      "text": " thou the things which become"
    },
    {
      "id": 143,
      "start": 485.67999267578125,
      "end": 492.1199951171875,
      "text": " sound doctrine. We find that as soon as the church is established"
    },
    {
      "id": 144,
      "start": 492.1199951171875,
      "end": 495.6400146484375,
      "text": " and the church is moving forward for the cause of Christ,"
    },
    {
      "id": 145,
      "start": 495.6400146484375,
      "end": 499.7200012207031,
      "text": " we understand that there are false teachers that would show up on the scene."
    },
    {
      "id": 146,
      "start": 499.7200012207031,
      "end": 503.8399963378906,
      "text": " The reality is that those false teachers were there then, and they continue to be"
    },
    {
      "id": 147,
      "start": 503.9599914550781,
      "end": 505.67999267578125,
      "text": " here still to this day."
    },
    {
      "id": 148,
      "start": 505.67999267578125,
      "end": 510.32000732421875,
      "text": " And we find that as we look back in 1st Timothy chapter number 1 and begin to"
    },
    {
      "id": 149,
      "start": 510.32000732421875,
      "end": 512.7999877929688,
      "text": " dissect this portion of scripture this morning,"
    },
    {
      "id": 150,
      "start": 512.7999877929688,
      "end": 515.8400268554688,
      "text": " notice with me first of all the exposure"
    },
    {
      "id": 151,
      "start": 515.8400268554688,
      "end": 520.8400268554688,
      "text": " of false teachers. I'm thankful that God is able to expose false teaching."
    },
    {
      "id": 152,
      "start": 520.8400268554688,
      "end": 525.4400024414062,
      "text": " I'm thankful that He has given us His word so that we too might be able to"
    },
    {
      "id": 153,
      "start": 525.4400024414062,
      "end": 527.280029296875,
      "text": " expose false teaching."
    },
    {
      "id": 154,
      "start": 527.280029296875,
      "end": 531.280029296875,
      "text": " Not everything that you listen, not every eloquent speaker, because of their"
    },
    {
      "id": 155,
      "start": 531.3599853515625,
      "end": 534.5999755859375,
      "text": " eloquence means that what they're saying is true."
    },
    {
      "id": 156,
      "start": 534.5999755859375,
      "end": 538.760009765625,
      "text": " Amen? There are some people, listen, not the person that has the most follows,"
    },
    {
      "id": 157,
      "start": 538.760009765625,
      "end": 541.0,
      "text": " the most likes, the most people that are"
    },
    {
      "id": 158,
      "start": 541.0,
      "end": 545.0399780273438,
      "text": " going and liking their post and following them, it doesn't mean that"
    },
    {
      "id": 159,
      "start": 545.0399780273438,
      "end": 546.47998046875,
      "text": " they're right."
    },
    {
      "id": 160,
      "start": 546.47998046875,
      "end": 550.8400268554688,
      "text": " Amen? How do we determine what's right and what's wrong?"
    },
    {
      "id": 161,
      "start": 550.8400268554688,
      "end": 555.9600219726562,
      "text": " Right here, the Bible. He says in 1st John that we're to try the"
    },
    {
      "id": 162,
      "start": 555.9600219726562,
      "end": 557.4400024414062,
      "text": " spirits."
    },
    {
      "id": 163,
      "start": 557.4400024414062,
      "end": 561.0,
      "text": " Amen? We understand, and we'll mention at the end of the message this morning in"
    },
    {
      "id": 164,
      "start": 561.0,
      "end": 563.3200073242188,
      "text": " Jude, that we're to earnestly contend"
    },
    {
      "id": 165,
      "start": 563.3200073242188,
      "end": 568.0,
      "text": " for the faith that was once delivered unto the saints, and we find the exposure"
    },
    {
      "id": 166,
      "start": 568.0,
      "end": 573.4400024414062,
      "text": " of false teachers here in this portion of scripture. Notice in verse number 6"
    },
    {
      "id": 167,
      "start": 573.4400024414062,
      "end": 577.7999877929688,
      "text": " where He begins to introduce us to these false teachers, He's already spoken"
    },
    {
      "id": 168,
      "start": 577.7999877929688,
      "end": 578.6799926757812,
      "text": " about the"
    },
    {
      "id": 169,
      "start": 578.6799926757812,
      "end": 583.3599853515625,
      "text": " call that He gave Him, that He would charge some, according to verse number 3,"
    },
    {
      "id": 170,
      "start": 583.3599853515625,
      "end": 585.2000122070312,
      "text": " that they teach no other doctrine,"
    },
    {
      "id": 171,
      "start": 585.2000122070312,
      "end": 588.52001953125,
      "text": " neither would they give heed to fables and endless genealogies. But in verse"
    },
    {
      "id": 172,
      "start": 588.52001953125,
      "end": 589.4400024414062,
      "text": " number 6,"
    },
    {
      "id": 173,
      "start": 589.47998046875,
      "end": 590.760009765625,
      "text": " notice He says,"
    },
    {
      "id": 174,
      "start": 590.760009765625,
      "end": 592.719970703125,
      "text": " from which some,"
    },
    {
      "id": 175,
      "start": 592.719970703125,
      "end": 595.5999755859375,
      "text": " having, do you see that word swerved?"
    },
    {
      "id": 176,
      "start": 595.5999755859375,
      "end": 599.9600219726562,
      "text": " It's kind of an interesting word. It says that from some having swerved have turned"
    },
    {
      "id": 0,
      "start": 599.9600219726562,
      "end": 608.7600221633911,
      "text": " aside unto vain jangling.\" As God is giving His Word here and as Paul is speaking to Timothy,"
    },
    {
      "id": 1,
      "start": 608.7600221633911,
      "end": 614.8400220870972,
      "text": " we find that he is exposing these false teachers, their exposure is noted, where they are being"
    },
    {
      "id": 2,
      "start": 614.8400220870972,
      "end": 619.9200210571289,
      "text": " exposed for their false teaching. He says that these are described as being those that"
    },
    {
      "id": 3,
      "start": 619.9200210571289,
      "end": 627.4800224304199,
      "text": " have swerved. It means to deviate from, it means to miss the mark. In my mind, it really"
    },
    {
      "id": 4,
      "start": 627.4800224304199,
      "end": 635.6200218200684,
      "text": " has the exact opposite of continue. They've swerved. They've turned aside. They've deviated"
    },
    {
      "id": 5,
      "start": 635.6200218200684,
      "end": 642.2400207519531,
      "text": " from the path that has been established and they've swerved. The Bible tells us that they've"
    },
    {
      "id": 6,
      "start": 642.2400207519531,
      "end": 649.0600204467773,
      "text": " swerved and notice they've turned aside unto vain jangling. That's kind of interesting"
    },
    {
      "id": 7,
      "start": 649.0600204467773,
      "end": 654.8400230407715,
      "text": " phraseology, isn't it? You know what it means? Useless talk. Useless talk. You ever listen"
    },
    {
      "id": 8,
      "start": 654.8400230407715,
      "end": 659.2800216674805,
      "text": " to somebody that talks for a long time and they don't really say anything? You know what"
    },
    {
      "id": 9,
      "start": 659.2800216674805,
      "end": 663.3600234985352,
      "text": " I mean? You hear somebody give a presentation, a speech, and you're kind of like, what in"
    },
    {
      "id": 10,
      "start": 663.3600234985352,
      "end": 671.9200210571289,
      "text": " the world? There's no real meat to the message. And here he talks about this vain jangling,"
    },
    {
      "id": 11,
      "start": 671.9200210571289,
      "end": 677.4400253295898,
      "text": " this useless talk, and really when we look at verse number 6 and see how these false"
    },
    {
      "id": 12,
      "start": 677.4400253295898,
      "end": 682.2400207519531,
      "text": " teachers are being exposed and we see that they have swerved, they've deviated from the"
    },
    {
      "id": 13,
      "start": 682.2400207519531,
      "end": 689.0000228881836,
      "text": " path, they've missed the mark, they've turned to vain jangling, this useless talk, we find"
    },
    {
      "id": 14,
      "start": 689.0000228881836,
      "end": 694.9200210571289,
      "text": " that really what's happening in verse number 4, which we studied last week, it gives us"
    },
    {
      "id": 15,
      "start": 694.9200210571289,
      "end": 700.2800216674805,
      "text": " some insight into this useless talk. It was that they were dealing with these fables and"
    },
    {
      "id": 16,
      "start": 700.2800216674805,
      "end": 706.8800201416016,
      "text": " these endless genealogies and you know what the result was? The result was questions,"
    },
    {
      "id": 17,
      "start": 706.8800201416016,
      "end": 712.5600204467773,
      "text": " not godly edifying. And we see that in verse number 4. And so we find that as we look here"
    },
    {
      "id": 18,
      "start": 712.5600204467773,
      "end": 717.8000183105469,
      "text": " and we see how these false teachers are being exposed, that Paul says they've swerved, they've"
    },
    {
      "id": 19,
      "start": 717.8000183105469,
      "end": 721.9200210571289,
      "text": " turned to vain jangling. But then as we come to verse number 7, we see that these false"
    },
    {
      "id": 20,
      "start": 721.9200210571289,
      "end": 727.0400238037109,
      "text": " teachers, they're really not qualified. Notice the Bible says, desiring to be teachers of"
    },
    {
      "id": 21,
      "start": 727.0400238037109,
      "end": 731.8000183105469,
      "text": " the law. Now if we just stopped right there, we'd say that's a commendable desire, to be"
    },
    {
      "id": 22,
      "start": 731.8000183105469,
      "end": 736.8800201416016,
      "text": " a teacher of the law. That's a commendable desire, but notice what Paul says, understanding"
    },
    {
      "id": 23,
      "start": 736.8800201416016,
      "end": 746.1800231933594,
      "text": " neither what they say nor whereof they affirm. So they have a desire but they're not qualified."
    },
    {
      "id": 24,
      "start": 746.1800231933594,
      "end": 750.9000244140625,
      "text": " They simply don't know what they're talking about, if we could put it in very basic English"
    },
    {
      "id": 25,
      "start": 750.9000244140625,
      "end": 756.1600189208984,
      "text": " this morning. And so we find that here, as Paul is saying that they're not qualified,"
    },
    {
      "id": 26,
      "start": 756.1600189208984,
      "end": 760.0000152587891,
      "text": " it's very interesting when we look at how these false teachers are being exposed in"
    },
    {
      "id": 27,
      "start": 760.0000152587891,
      "end": 764.2000274658203,
      "text": " the first chapter, that later on, a couple of chapters later in chapter 3, and we'll"
    },
    {
      "id": 28,
      "start": 764.2000274658203,
      "end": 767.4800262451172,
      "text": " look at it in great detail as we move through the book, but turn over just for a moment"
    },
    {
      "id": 29,
      "start": 767.4800262451172,
      "end": 772.4800262451172,
      "text": " to chapter 3, and notice what the Bible says in verse number 1 of chapter number 3 of this"
    },
    {
      "id": 30,
      "start": 772.4800262451172,
      "end": 778.7600250244141,
      "text": " book. This is a true saying. If a man desire the office of a bishop, he desireth a good"
    },
    {
      "id": 31,
      "start": 778.7600250244141,
      "end": 785.4800262451172,
      "text": " work. And so we see here that thought of desire, we see it in verse number 7 of chapter 1,"
    },
    {
      "id": 32,
      "start": 785.4800262451172,
      "end": 789.52001953125,
      "text": " these that were false teachers, they had a desire to teach the law, but they weren't"
    },
    {
      "id": 33,
      "start": 789.52001953125,
      "end": 795.2400207519531,
      "text": " qualified, and so we find that in chapter number 3, God gives a list of qualifications"
    },
    {
      "id": 34,
      "start": 795.2400207519531,
      "end": 802.6400146484375,
      "text": " for those that would desire the office of a bishop. You know one of them at the end"
    },
    {
      "id": 35,
      "start": 802.6400146484375,
      "end": 812.0800170898438,
      "text": " of verse number 2? Apt to teach. Apt to teach. In chapter number 1 in verse number 7, he"
    },
    {
      "id": 36,
      "start": 812.0800170898438,
      "end": 817.4800262451172,
      "text": " says they desire to be teachers of the law, but they understand neither what they say"
    },
    {
      "id": 37,
      "start": 817.4800262451172,
      "end": 825.0800170898438,
      "text": " nor whereof they affirm. In the 1828 Noah Webster's Dictionary, one of the definitions"
    },
    {
      "id": 38,
      "start": 825.0800170898438,
      "end": 834.5600280761719,
      "text": " that is given for the word apt is qualified or fit. And so we find that these false teachers"
    },
    {
      "id": 39,
      "start": 834.5600280761719,
      "end": 838.280029296875,
      "text": " that are being mentioned here, that are being exposed in this portion of Scripture, in the"
    },
    {
      "id": 40,
      "start": 838.280029296875,
      "end": 844.6400146484375,
      "text": " very introduction to this letter, we find that these false teachers are being exposed"
    },
    {
      "id": 41,
      "start": 844.6400146484375,
      "end": 848.9200286865234,
      "text": " and God is giving instruction to Timothy on how to deal with this. We'll look at it in"
    },
    {
      "id": 42,
      "start": 848.9200286865234,
      "end": 854.7600250244141,
      "text": " just a moment. But we understand the way that these folks, they've swerved, they've turned"
    },
    {
      "id": 43,
      "start": 854.7600250244141,
      "end": 862.0800170898438,
      "text": " to vain jangling, they're not qualified. What are they doing? Well, they did not properly"
    },
    {
      "id": 44,
      "start": 862.0800170898438,
      "end": 867.6000366210938,
      "text": " understand or apply the Old Testament law. Really, as we look at the text of Scripture,"
    },
    {
      "id": 45,
      "start": 867.6000366210938,
      "end": 871.9600219726562,
      "text": " we see exactly that's what's being dealt with. And they did not properly understand"
    },
    {
      "id": 46,
      "start": 871.9600219726562,
      "end": 878.2000122070312,
      "text": " it, nor did they properly apply the Old Testament law. In fact, in Acts chapter 15, if you were"
    },
    {
      "id": 47,
      "start": 878.2000122070312,
      "end": 882.0800170898438,
      "text": " to look there in that portion of Scripture and see the council at Jerusalem and what's"
    },
    {
      "id": 48,
      "start": 882.0800170898438,
      "end": 887.3200073242188,
      "text": " taking place, in Acts 15.1, there were people that were coming, these Judaizers, and they"
    },
    {
      "id": 49,
      "start": 887.3200073242188,
      "end": 893.8400268554688,
      "text": " were saying, except a man be circumcised after the manner of Moses, you cannot be saved."
    },
    {
      "id": 50,
      "start": 893.8400268554688,
      "end": 900.4000244140625,
      "text": " Now Paul, he was having none of that. No, no, no. That is not true. And there was a"
    },
    {
      "id": 51,
      "start": 900.4000244140625,
      "end": 907.280029296875,
      "text": " big conversation, a council that's recorded for us in Acts 15 in Jerusalem of all that"
    },
    {
      "id": 52,
      "start": 907.280029296875,
      "end": 911.280029296875,
      "text": " took place with that. And you know what they concluded? That they're saved just like we're"
    },
    {
      "id": 53,
      "start": 911.280029296875,
      "end": 916.6800231933594,
      "text": " saved by grace through faith because it's the blood of Jesus Christ, His death barrel"
    },
    {
      "id": 54,
      "start": 916.6800231933594,
      "end": 923.760009765625,
      "text": " and glorious resurrection that allows for a man, woman, boy, girl to be saved. Amen?"
    },
    {
      "id": 55,
      "start": 923.760009765625,
      "end": 928.1400146484375,
      "text": " Has nothing to do with circumcision, has nothing to do with baptism, has nothing to"
    },
    {
      "id": 56,
      "start": 928.1400146484375,
      "end": 935.6400146484375,
      "text": " do with any other religious rite or ritual. It's through the blood of Jesus Christ. Amen?"
    },
    {
      "id": 57,
      "start": 935.6400146484375,
      "end": 942.0000305175781,
      "text": " And we find that as we look at this portion of Scripture that they did not notice understanding"
    },
    {
      "id": 58,
      "start": 942.0000305175781,
      "end": 949.1200256347656,
      "text": " in verse number 7, neither what they say nor whereof they affirm. Paul then immediately"
    },
    {
      "id": 59,
      "start": 949.1200256347656,
      "end": 953.6400146484375,
      "text": " gets into the subject of the law. Why would Paul deal with the subject of the law? Well,"
    },
    {
      "id": 60,
      "start": 953.6400146484375,
      "end": 957.9600219726562,
      "text": " that's because that's where they've erred. That's where they've gone astray. That's where"
    },
    {
      "id": 61,
      "start": 957.9600219726562,
      "end": 963.1600341796875,
      "text": " they've swore from. That's where they've turned to vain jangling. And we find that Paul is"
    },
    {
      "id": 62,
      "start": 963.1600341796875,
      "end": 969.1200256347656,
      "text": " going to set the record straight. He's going to help them to understand the sound doctrine."
    },
    {
      "id": 63,
      "start": 969.1200256347656,
      "end": 973.6400146484375,
      "text": " And so we see that they did not properly understand. We find that their teaching, as I mentioned"
    },
    {
      "id": 64,
      "start": 973.6400146484375,
      "end": 979.2400207519531,
      "text": " a moment ago, it resulted in questions, not in godly edifying."
    },
    {
      "id": 65,
      "start": 979.2400207519531,
      "end": 984.2000122070312,
      "text": " Now understand this morning that it's certainly appropriate and applicable that even still"
    },
    {
      "id": 66,
      "start": 984.2000122070312,
      "end": 990.8800354003906,
      "text": " today that teaching may result in questions, but those questions can be answered by God's"
    },
    {
      "id": 67,
      "start": 990.8800354003906,
      "end": 999.6400146484375,
      "text": " Word. The idea of what's being given here in verse number 4 about these false teachers"
    },
    {
      "id": 68,
      "start": 999.6400146484375,
      "end": 1004.3200073242188,
      "text": " that it generates these questions which minister questions is that it just leaves people at"
    },
    {
      "id": 69,
      "start": 1004.3200073242188,
      "end": 1012.6800231933594,
      "text": " a dead end. You know, a lot of religion today leaves people at a dead end. They're confused."
    },
    {
      "id": 70,
      "start": 1012.6800231933594,
      "end": 1021.4800109863281,
      "text": " No hope, no peace, no direction, confusion. By the way, who's the author of confusion?"
    },
    {
      "id": 71,
      "start": 1021.4800109863281,
      "end": 1027.6400146484375,
      "text": " Not my God. Satan is the author of confusion. And we find that, I'm thankful, listen, we"
    },
    {
      "id": 72,
      "start": 1027.6400146484375,
      "end": 1032.4800109863281,
      "text": " say it often, that the Bible has the answer. Aren't you thankful for that? I was reading"
    },
    {
      "id": 73,
      "start": 1032.4800109863281,
      "end": 1035.8400268554688,
      "text": " this morning the book of Numbers. Somebody shared with me a testimony about reading Leviticus."
    },
    {
      "id": 74,
      "start": 1035.8400268554688,
      "end": 1039.5600280761719,
      "text": " I just finished Leviticus just a couple of days ago. Man, I love the book of Leviticus."
    },
    {
      "id": 75,
      "start": 1039.5600280761719,
      "end": 1044.2000122070312,
      "text": " I know so many people say, man, the book of Leviticus. Man, it is a great book that really"
    },
    {
      "id": 76,
      "start": 1044.2000122070312,
      "end": 1049.4800109863281,
      "text": " shows the work and ministry of the Lord Jesus Christ and His offering that He made for us."
    },
    {
      "id": 77,
      "start": 1049.4800109863281,
      "end": 1052.4000244140625,
      "text": " I mean, it's a precious book. But I was in the book of Numbers this morning and there's"
    },
    {
      "id": 78,
      "start": 1052.4000244140625,
      "end": 1056.280029296875,
      "text": " a unique thing that happened in the life and ministry of Moses. There was a circumstance"
    },
    {
      "id": 79,
      "start": 1056.280029296875,
      "end": 1062.2400207519531,
      "text": " that came up that had not been given direction from God yet. You know what Moses did? He"
    },
    {
      "id": 80,
      "start": 1062.280029296875,
      "end": 1066.6000366210938,
      "text": " said, hold on, let me go ask God. And he went to the Lord and guess what God did? He gave"
    },
    {
      "id": 81,
      "start": 1066.6000366210938,
      "end": 1073.6400146484375,
      "text": " him an answer. Praise God. We have a Bible. God's given us this book. And in this book,"
    },
    {
      "id": 82,
      "start": 1073.6400146484375,
      "end": 1079.260009765625,
      "text": " the Bible, we often sing the B-I-B-L-E. Yes, that's the book for me. And I'm thankful that"
    },
    {
      "id": 83,
      "start": 1079.260009765625,
      "end": 1085.0400085449219,
      "text": " our doctrine is based on the Bible, the Bible teaching. And we go to the Bible. We have"
    },
    {
      "id": 84,
      "start": 1085.0400085449219,
      "end": 1090.0800170898438,
      "text": " a question. We say, Lord, you've given us this book. Provide us with the answer. Help"
    },
    {
      "id": 85,
      "start": 1090.0800170898438,
      "end": 1095.8800354003906,
      "text": " us to have an understanding. Illumine the scriptures to us so that we might understand"
    },
    {
      "id": 86,
      "start": 1095.8800354003906,
      "end": 1101.9200134277344,
      "text": " what you desire, what your plan is. And we go to the Bible and we understand that God's"
    },
    {
      "id": 87,
      "start": 1101.9200134277344,
      "end": 1107.6000366210938,
      "text": " given us principles. And those principles are applicable in life. And we see that what"
    },
    {
      "id": 88,
      "start": 1107.6000366210938,
      "end": 1112.3600463867188,
      "text": " was happening with these false teachers is that it was leaving them, those followers"
    },
    {
      "id": 89,
      "start": 1112.3600463867188,
      "end": 1118.1600341796875,
      "text": " at this dead end, these questions that could not be answered, no hope and no peace. And"
    },
    {
      "id": 90,
      "start": 1118.2000122070312,
      "end": 1124.2400512695312,
      "text": " Paul is exposing, God is exposing the false teachers. Now, here's something for us to"
    },
    {
      "id": 91,
      "start": 1124.2400512695312,
      "end": 1129.0400390625,
      "text": " be mindful of this morning, that false teachers were present and active in the beginning of"
    },
    {
      "id": 92,
      "start": 1129.0400390625,
      "end": 1136.0400390625,
      "text": " the church and they're present and active in this day of the church age. We find that"
    },
    {
      "id": 93,
      "start": 1136.0400390625,
      "end": 1142.2000122070312,
      "text": " the scriptures say this, Paul exposes false teaching. God uses Paul to expose false teaching."
    },
    {
      "id": 94,
      "start": 1142.2000122070312,
      "end": 1146.52001953125,
      "text": " God uses Peter to expose false teaching. Of course, there's a number of other portions"
    },
    {
      "id": 95,
      "start": 1146.52001953125,
      "end": 1151.1600341796875,
      "text": " of scripture that we could go to, but each of them have portions of scripture in their"
    },
    {
      "id": 96,
      "start": 1151.1600341796875,
      "end": 1156.4800415039062,
      "text": " books that deal with the characteristics of false teaching. Jude deals with it as well,"
    },
    {
      "id": 97,
      "start": 1156.4800415039062,
      "end": 1160.3200073242188,
      "text": " but you see, you can just go through those characteristics. But Peter says this, he says,"
    },
    {
      "id": 98,
      "start": 1160.3200073242188,
      "end": 1166.4800415039062,
      "text": " as there were false prophets, even so there will be false teachers. Now, understand what"
    },
    {
      "id": 99,
      "start": 1166.4800415039062,
      "end": 1172.2400512695312,
      "text": " Peter is communicating there as he says that. The people of God could understand, you and"
    },
    {
      "id": 100,
      "start": 1172.2400512695312,
      "end": 1176.6000366210938,
      "text": " I this morning can understand as we go to the Old Testament and read the Old Testament"
    },
    {
      "id": 101,
      "start": 1176.6000366210938,
      "end": 1183.1199951171875,
      "text": " that there are many references that God has recorded for us of false prophets that existed"
    },
    {
      "id": 102,
      "start": 1183.1199951171875,
      "end": 1187.8800048828125,
      "text": " in the Old Testament. And so Peter says, under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 103,
      "start": 1187.8800048828125,
      "end": 1195.0400390625,
      "text": " just as there were false prophets then, there will be false teachers today. So God's Word"
    },
    {
      "id": 104,
      "start": 1195.0400390625,
      "end": 1199.8800048828125,
      "text": " exposes false teaching. And I'm thankful for that."
    },
    {
      "id": 0,
      "start": 1199.8800048828125,
      "end": 1205.1600050926208,
      "text": " When we look here at this portion of Scripture, we find not only the exposure of false teaching,"
    },
    {
      "id": 1,
      "start": 1205.1600050926208,
      "end": 1208.9200048446655,
      "text": " but number two, we find the emphasis on sound doctrine."
    },
    {
      "id": 2,
      "start": 1208.9200048446655,
      "end": 1211.0000047683716,
      "text": " The emphasis on sound doctrine."
    },
    {
      "id": 3,
      "start": 1211.0000047683716,
      "end": 1216.2000045776367,
      "text": " I mentioned already that these false teachers were mishandling the law, and therefore, what"
    },
    {
      "id": 4,
      "start": 1216.2000045776367,
      "end": 1217.2000045776367,
      "text": " does Paul do?"
    },
    {
      "id": 5,
      "start": 1217.2000045776367,
      "end": 1220.4800052642822,
      "text": " He addresses the law."
    },
    {
      "id": 6,
      "start": 1220.4800052642822,
      "end": 1223.5600051879883,
      "text": " Notice in verse number eight, as we continue, we'll get to verse number five at the end"
    },
    {
      "id": 7,
      "start": 1223.5600051879883,
      "end": 1227.4200057983398,
      "text": " of the message, but notice in verse number eight, the Bible says, but we know."
    },
    {
      "id": 8,
      "start": 1227.4200057983398,
      "end": 1229.7000045776367,
      "text": " Now that's a level of confidence, is it not?"
    },
    {
      "id": 9,
      "start": 1229.7000045776367,
      "end": 1236.240005493164,
      "text": " He says, we don't think, he's not saying, no, we know that the law is good."
    },
    {
      "id": 10,
      "start": 1236.240005493164,
      "end": 1243.1600036621094,
      "text": " If a man use it lawfully, do you know what that word lawfully means?"
    },
    {
      "id": 11,
      "start": 1243.1600036621094,
      "end": 1245.3600044250488,
      "text": " It means properly."
    },
    {
      "id": 12,
      "start": 1245.3600044250488,
      "end": 1246.6000061035156,
      "text": " It means properly."
    },
    {
      "id": 13,
      "start": 1246.6000061035156,
      "end": 1253.3600044250488,
      "text": " So what was happening with the false teachers, I mentioned that they did not properly understand"
    },
    {
      "id": 14,
      "start": 1253.3600044250488,
      "end": 1257.520004272461,
      "text": " or apply the Old Testament law."
    },
    {
      "id": 15,
      "start": 1257.520004272461,
      "end": 1263.2600059509277,
      "text": " We can talk about the idea of legalism, and we can talk about the idea of obtaining some"
    },
    {
      "id": 16,
      "start": 1263.2600059509277,
      "end": 1269.860008239746,
      "text": " level of grace and favor, merit from God because of this outward obedience to the law."
    },
    {
      "id": 17,
      "start": 1269.860008239746,
      "end": 1271.8000030517578,
      "text": " That's not the purpose of the law."
    },
    {
      "id": 18,
      "start": 1271.8000030517578,
      "end": 1276.900001525879,
      "text": " That's not properly understanding or applying the law, and we find, we'll end ourselves"
    },
    {
      "id": 19,
      "start": 1276.900001525879,
      "end": 1280.7800064086914,
      "text": " in the book of Galatians at some point this morning, but we find that he says that the"
    },
    {
      "id": 20,
      "start": 1280.7800064086914,
      "end": 1285.860008239746,
      "text": " law is good, but it must be used lawfully, properly."
    },
    {
      "id": 21,
      "start": 1285.860008239746,
      "end": 1288.640007019043,
      "text": " This in verse number 10, we'll go back to verse nine in just a moment."
    },
    {
      "id": 22,
      "start": 1288.640007019043,
      "end": 1294.7200012207031,
      "text": " At the end of verse number 10, it says, and if there be any other thing that is contrary"
    },
    {
      "id": 23,
      "start": 1294.7200012207031,
      "end": 1297.4400024414062,
      "text": " to sound doctrine."
    },
    {
      "id": 24,
      "start": 1297.4400024414062,
      "end": 1303.2000045776367,
      "text": " Now as we look at the word lawfully in verse number eight, we see that that means properly."
    },
    {
      "id": 25,
      "start": 1303.2000045776367,
      "end": 1308.0400085449219,
      "text": " As we come to verse number 10, and we see the phrase of sound doctrine, the word sound"
    },
    {
      "id": 26,
      "start": 1308.0400085449219,
      "end": 1309.400001525879,
      "text": " means to be healthy."
    },
    {
      "id": 27,
      "start": 1309.400001525879,
      "end": 1317.8000030517578,
      "text": " It means this, to be free from any mixture of error, to be free from any mixture of error."
    },
    {
      "id": 28,
      "start": 1317.8000030517578,
      "end": 1321.900001525879,
      "text": " You know, one of the things and one of the reasons that we're going to have in our Sunday"
    },
    {
      "id": 29,
      "start": 1321.900001525879,
      "end": 1326.0000076293945,
      "text": " school class for the next several weeks, a study on why we use the King James Bible,"
    },
    {
      "id": 30,
      "start": 1326.0000076293945,
      "end": 1333.2799987792969,
      "text": " you understand why, how the enemy is seeking to introduce error, to mix truth with error"
    },
    {
      "id": 31,
      "start": 1333.2799987792969,
      "end": 1336.5599975585938,
      "text": " is through so many of the modern translations."
    },
    {
      "id": 32,
      "start": 1336.5599975585938,
      "end": 1341.5599975585938,
      "text": " So many of the modern translations today, all of a sudden there's this mixture of error,"
    },
    {
      "id": 33,
      "start": 1341.5599975585938,
      "end": 1346.3800048828125,
      "text": " there's this confusion, there's this contradiction that you'll find in a number of these new"
    },
    {
      "id": 34,
      "start": 1346.3800048828125,
      "end": 1350.7200012207031,
      "text": " modern translations, and we're just going to go ahead and study through a bunch of them"
    },
    {
      "id": 35,
      "start": 1350.7200012207031,
      "end": 1355.520004272461,
      "text": " and just let it be said, here's what these modern translations say, and here's where"
    },
    {
      "id": 36,
      "start": 1355.520004272461,
      "end": 1360.0400085449219,
      "text": " they're wrong, and here's how it changes doctrine."
    },
    {
      "id": 37,
      "start": 1360.0400085449219,
      "end": 1361.3800048828125,
      "text": " Doctrine matters."
    },
    {
      "id": 38,
      "start": 1361.3800048828125,
      "end": 1365.7200012207031,
      "text": " The enemy is behind that, for the enemy is the one in Genesis chapter number three that"
    },
    {
      "id": 39,
      "start": 1365.7200012207031,
      "end": 1372.760009765625,
      "text": " said, yea, hath God said, ye shall not surely die, no, in the day that ye eat thereof you'll"
    },
    {
      "id": 40,
      "start": 1372.760009765625,
      "end": 1375.6399993896484,
      "text": " be like gods."
    },
    {
      "id": 41,
      "start": 1375.6399993896484,
      "end": 1378.6800079345703,
      "text": " That's what Satan said in Genesis three."
    },
    {
      "id": 42,
      "start": 1378.6800079345703,
      "end": 1383.9000091552734,
      "text": " By the way, he's a liar, he's the father of it, amen?"
    },
    {
      "id": 43,
      "start": 1383.9000091552734,
      "end": 1391.6000061035156,
      "text": " We find here that as Paul would use these words, every word of God is pure, God gave"
    },
    {
      "id": 44,
      "start": 1391.6000061035156,
      "end": 1399.3200073242188,
      "text": " him these words lawfully to have a proper understanding and application of the law."
    },
    {
      "id": 45,
      "start": 1399.3200073242188,
      "end": 1404.3000030517578,
      "text": " Sound doctrine, that which is healthy, that which is free from any mixture of error, obviously"
    },
    {
      "id": 46,
      "start": 1404.3000030517578,
      "end": 1411.0400085449219,
      "text": " when you look at the teaching of these false teachers, it's nothing, it's not sound."
    },
    {
      "id": 47,
      "start": 1411.0400085449219,
      "end": 1415.8400115966797,
      "text": " It's infiltrated with error, it's diseased, if you will, if we could look at the use of"
    },
    {
      "id": 48,
      "start": 1415.8400115966797,
      "end": 1422.3200073242188,
      "text": " that word sound and looking at the contradiction between that which is appropriate and to be"
    },
    {
      "id": 49,
      "start": 1422.3200073242188,
      "end": 1426.240005493164,
      "text": " taught versus that which these false teachers were teaching, and so when we look at the"
    },
    {
      "id": 50,
      "start": 1426.240005493164,
      "end": 1432.7200012207031,
      "text": " emphasis on sound doctrine, let me say this, proper interpretation and application of Scripture"
    },
    {
      "id": 51,
      "start": 1432.7200012207031,
      "end": 1436.1600036621094,
      "text": " is absolutely essential."
    },
    {
      "id": 52,
      "start": 1436.1600036621094,
      "end": 1440.6000061035156,
      "text": " Proper interpretation and application of Scripture."
    },
    {
      "id": 53,
      "start": 1440.6000061035156,
      "end": 1448.0400085449219,
      "text": " Peter says in 2 Peter 1 verse 20 and 21 that no prophecy is of any private interpretation."
    },
    {
      "id": 54,
      "start": 1448.0400085449219,
      "end": 1452.4400024414062,
      "text": " So often, and I'm going to make a number of statements here with regard to proper interpretation"
    },
    {
      "id": 55,
      "start": 1452.4400024414062,
      "end": 1456.8600158691406,
      "text": " and application of Scripture, we talk about the interpretation of Scripture, a theological"
    },
    {
      "id": 56,
      "start": 1456.8600158691406,
      "end": 1461.4800109863281,
      "text": " word that's used as hermeneutics, right, the hermeneutical approach to interpreting Scripture,"
    },
    {
      "id": 57,
      "start": 1461.4800109863281,
      "end": 1466.9800109863281,
      "text": " hermeneutics, and we find here that when we deal with the proper interpretation and application"
    },
    {
      "id": 58,
      "start": 1466.9800109863281,
      "end": 1470.760009765625,
      "text": " of Scripture, the context is key."
    },
    {
      "id": 59,
      "start": 1470.760009765625,
      "end": 1474.7200012207031,
      "text": " You know how a lot of false teachings have been raised?"
    },
    {
      "id": 60,
      "start": 1474.7200012207031,
      "end": 1478.6000061035156,
      "text": " Through taking Scripture out of context."
    },
    {
      "id": 61,
      "start": 1478.6000061035156,
      "end": 1482.1199951171875,
      "text": " You take one verse of Scripture and you just remove it from its context and you build some"
    },
    {
      "id": 62,
      "start": 1482.1199951171875,
      "end": 1489.5599975585938,
      "text": " teaching on this singular verse of Scripture, giving no mind to the context in which that"
    },
    {
      "id": 63,
      "start": 1489.5599975585938,
      "end": 1490.5599975585938,
      "text": " truth was given."
    },
    {
      "id": 64,
      "start": 1490.5599975585938,
      "end": 1493.3600158691406,
      "text": " It's a very dangerous thing."
    },
    {
      "id": 65,
      "start": 1493.3600158691406,
      "end": 1496.5400085449219,
      "text": " Every once in a while I'll preach a topical message."
    },
    {
      "id": 66,
      "start": 1497.1000061035156,
      "end": 1499.260009765625,
      "text": " Exegetical messages are enjoyable to preach, no doubt."
    },
    {
      "id": 67,
      "start": 1499.260009765625,
      "end": 1502.4800109863281,
      "text": " Primarily I preach exegetical messages."
    },
    {
      "id": 68,
      "start": 1502.4800109863281,
      "end": 1506.6400146484375,
      "text": " I like to preach within the context of what the Scriptures…"
    },
    {
      "id": 69,
      "start": 1506.6400146484375,
      "end": 1509.739990234375,
      "text": " I love preaching through books of the Bible."
    },
    {
      "id": 70,
      "start": 1509.739990234375,
      "end": 1515.1799926757812,
      "text": " If you've been here since I've been here, I don't know, there's like 24, 26 books"
    },
    {
      "id": 71,
      "start": 1515.1799926757812,
      "end": 1519.5,
      "text": " of the Bible that I have preached or taught through in the 12 years that I've been here,"
    },
    {
      "id": 72,
      "start": 1519.5,
      "end": 1523.6600036621094,
      "text": " and we go verse by verse through those books of Scripture, and that helps…"
    },
    {
      "id": 73,
      "start": 1523.6600036621094,
      "end": 1525.1000061035156,
      "text": " What is it saying in the Old Testament?"
    },
    {
      "id": 74,
      "start": 1525.1000061035156,
      "end": 1528.5800170898438,
      "text": " Line upon line, precept upon precept."
    },
    {
      "id": 75,
      "start": 1528.5800170898438,
      "end": 1536.6600036621094,
      "text": " And so many false teachings have been made just so available to people by taking a verse"
    },
    {
      "id": 76,
      "start": 1536.6600036621094,
      "end": 1537.8600158691406,
      "text": " out of context."
    },
    {
      "id": 77,
      "start": 1537.8600158691406,
      "end": 1542.4200134277344,
      "text": " Let me say this, there must be an understanding of whether the verse of Scripture is to be"
    },
    {
      "id": 78,
      "start": 1542.4200134277344,
      "end": 1546.739990234375,
      "text": " interpreted literally or figuratively."
    },
    {
      "id": 79,
      "start": 1546.739990234375,
      "end": 1553.02001953125,
      "text": " We must be careful not to over-spiritualize or under-spiritualize."
    },
    {
      "id": 80,
      "start": 1553.02001953125,
      "end": 1558.1799926757812,
      "text": " We must keep it within context, and sometimes there's literal, sometimes there's figurative."
    },
    {
      "id": 81,
      "start": 1558.1799926757812,
      "end": 1559.1799926757812,
      "text": " We understand that."
    },
    {
      "id": 82,
      "start": 1559.1799926757812,
      "end": 1563.4200134277344,
      "text": " When we talk about some of the figurative, we'd understand some of these manners of"
    },
    {
      "id": 83,
      "start": 1563.4200134277344,
      "end": 1564.8200073242188,
      "text": " writing."
    },
    {
      "id": 84,
      "start": 1564.8200073242188,
      "end": 1565.8200073242188,
      "text": " And the Bible…"
    },
    {
      "id": 85,
      "start": 1565.8200073242188,
      "end": 1569.739990234375,
      "text": " Listen, there are times in which the Bible uses metaphors."
    },
    {
      "id": 86,
      "start": 1569.739990234375,
      "end": 1572.6199951171875,
      "text": " There are times in which the Bible uses allegories."
    },
    {
      "id": 87,
      "start": 1572.6199951171875,
      "end": 1579.260009765625,
      "text": " In fact, Paul says in Galatians, this is an allegory, right?"
    },
    {
      "id": 88,
      "start": 1579.260009765625,
      "end": 1584.0599975585938,
      "text": " He's giving us an understanding of a passage of Scripture in the book of Genesis when he"
    },
    {
      "id": 89,
      "start": 1584.0599975585938,
      "end": 1589.1000061035156,
      "text": " refers to it as being an allegory, so metaphors, allegories, similes."
    },
    {
      "id": 90,
      "start": 1589.1000061035156,
      "end": 1590.8200073242188,
      "text": " We think about parables."
    },
    {
      "id": 91,
      "start": 1590.8200073242188,
      "end": 1593.4200134277344,
      "text": " Jesus often taught with parables, right?"
    },
    {
      "id": 92,
      "start": 1593.4200134277344,
      "end": 1598.6600036621094,
      "text": " And so we have to understand that as we take and look at the Scriptures and we desire to"
    },
    {
      "id": 93,
      "start": 1598.6600036621094,
      "end": 1606.4599914550781,
      "text": " understand that doctrine matters, that when we build our faith, our doctrine, our teaching,"
    },
    {
      "id": 94,
      "start": 1606.4599914550781,
      "end": 1612.0599975585938,
      "text": " that proper interpretation and application of Scripture is key."
    },
    {
      "id": 95,
      "start": 1612.0599975585938,
      "end": 1616.8200073242188,
      "text": " As you look in this portion of Scripture, Timothy is being given this charge."
    },
    {
      "id": 96,
      "start": 1616.8200073242188,
      "end": 1621.3000183105469,
      "text": " He's received the charge already in verse number three, as I besought thee."
    },
    {
      "id": 97,
      "start": 1621.3000183105469,
      "end": 1625.0,
      "text": " This is something that happened before, and now Paul is writing back to him."
    },
    {
      "id": 98,
      "start": 1625.0,
      "end": 1630.6199951171875,
      "text": " As you would understand the way in which this is being given to Timothy, Paul had given"
    },
    {
      "id": 99,
      "start": 1630.6199951171875,
      "end": 1631.6199951171875,
      "text": " him this charge."
    },
    {
      "id": 100,
      "start": 1631.6199951171875,
      "end": 1633.9400024414062,
      "text": " He says, as I besought thee to abide."
    },
    {
      "id": 101,
      "start": 1633.9400024414062,
      "end": 1638.8600158691406,
      "text": " And as Timothy had this responsibility, the understanding God's plan for his life, it"
    },
    {
      "id": 102,
      "start": 1638.8600158691406,
      "end": 1643.02001953125,
      "text": " began to get hard, because there's false teachers."
    },
    {
      "id": 103,
      "start": 1643.02001953125,
      "end": 1644.260009765625,
      "text": " You know what's interesting?"
    },
    {
      "id": 104,
      "start": 1644.260009765625,
      "end": 1649.7000122070312,
      "text": " It seems as if a lot of false teachers can get a great following of people."
    },
    {
      "id": 105,
      "start": 1649.7000122070312,
      "end": 1652.6199951171875,
      "text": " You ever notice that?"
    },
    {
      "id": 106,
      "start": 1652.6199951171875,
      "end": 1655.9400024414062,
      "text": " They wax eloquent, they say all these things, and man, all of a sudden people just start"
    },
    {
      "id": 107,
      "start": 1655.9400024414062,
      "end": 1656.9400024414062,
      "text": " following me."
    },
    {
      "id": 108,
      "start": 1656.9400024414062,
      "end": 1658.9800109863281,
      "text": " You're like, hey, what in the world?"
    },
    {
      "id": 109,
      "start": 1658.9800109863281,
      "end": 1663.6600036621094,
      "text": " At one point, I don't know that it's true any longer, I've not seen statistics on this"
    },
    {
      "id": 110,
      "start": 1663.6600036621094,
      "end": 1670.1400146484375,
      "text": " for probably at least a decade, but statistics a couple of decades ago would indicate that"
    },
    {
      "id": 111,
      "start": 1670.1400146484375,
      "end": 1677.1000061035156,
      "text": " a number of cults in America, that one of the number one quote-unquote convert that"
    },
    {
      "id": 112,
      "start": 1677.1000061035156,
      "end": 1679.6199951171875,
      "text": " they received was from Baptist churches."
    },
    {
      "id": 113,
      "start": 1679.6199951171875,
      "end": 1681.8999938964844,
      "text": " You say, what in the world?"
    },
    {
      "id": 114,
      "start": 1681.8999938964844,
      "end": 1685.7000122070312,
      "text": " How does somebody that's sitting in a Baptist church hearing the teaching of God's word,"
    },
    {
      "id": 115,
      "start": 1685.7000122070312,
      "end": 1689.9400024414062,
      "text": " if it's being done appropriately, if the pastor is teaching and preaching and placing the"
    },
    {
      "id": 116,
      "start": 1689.9400024414062,
      "end": 1695.739990234375,
      "text": " emphasis on sound doctrine, how does a cult member show up at your door or my door and"
    },
    {
      "id": 117,
      "start": 1695.739990234375,
      "end": 1700.2200012207031,
      "text": " get me to turn my back on what God says and follow them?"
    },
    {
      "id": 118,
      "start": 1700.2200012207031,
      "end": 1705.9400024414062,
      "text": " But you see the evidence of it."
    },
    {
      "id": 119,
      "start": 1705.9400024414062,
      "end": 1710.5400085449219,
      "text": " Timothy is in a situation where the false teachers are teaching, and no doubt they're"
    },
    {
      "id": 120,
      "start": 1710.5400085449219,
      "end": 1716.0999755859375,
      "text": " influencing some, and maybe there's some, as it says, of which some having swerved in"
    },
    {
      "id": 121,
      "start": 1716.0999755859375,
      "end": 1721.2999877929688,
      "text": " verse number six, and these false teachers, they're teaching what they do not understand,"
    },
    {
      "id": 122,
      "start": 1721.2999877929688,
      "end": 1726.780029296875,
      "text": " they're not qualified to do so, but yet they're gathering, they get a following."
    },
    {
      "id": 123,
      "start": 1726.780029296875,
      "end": 1734.2200317382812,
      "text": " You know, that can be discouraging for Timothy, can be discouraging for the man of God."
    },
    {
      "id": 124,
      "start": 1734.2200317382812,
      "end": 1735.9400024414062,
      "text": " So what does God do?"
    },
    {
      "id": 125,
      "start": 1735.9400024414062,
      "end": 1738.1400146484375,
      "text": " God has Paul write him a letter."
    },
    {
      "id": 126,
      "start": 1738.1400146484375,
      "end": 1741.260009765625,
      "text": " Let me encourage you to continue."
    },
    {
      "id": 127,
      "start": 1741.260009765625,
      "end": 1744.9000244140625,
      "text": " Let me encourage you to understand that doctrine matters."
    },
    {
      "id": 128,
      "start": 1744.9000244140625,
      "end": 1749.780029296875,
      "text": " Because sometimes, if you're not careful, and I believe you've seen this in our churches"
    },
    {
      "id": 129,
      "start": 1749.780029296875,
      "end": 1758.0999755859375,
      "text": " around America, even in the last generation, where churches just little by little change."
    },
    {
      "id": 130,
      "start": 1758.0999755859375,
      "end": 1767.9000244140625,
      "text": " To accommodate, to be able to keep a crowd, to be able to pay a mortgage, yeah, they build"
    },
    {
      "id": 131,
      "start": 1767.9000244140625,
      "end": 1771.780029296875,
      "text": " a big building, and they get a big mortgage, and all of a sudden, you can't afford to lose"
    },
    {
      "id": 132,
      "start": 1771.780029296875,
      "end": 1772.780029296875,
      "text": " people."
    },
    {
      "id": 133,
      "start": 1772.780029296875,
      "end": 1774.3800048828125,
      "text": " You understand what I'm saying?"
    },
    {
      "id": 134,
      "start": 1774.3800048828125,
      "end": 1779.6199951171875,
      "text": " I'm not advocating that you be unkind and try to lose people just by being unkind."
    },
    {
      "id": 135,
      "start": 1779.6199951171875,
      "end": 1783.0599975585938,
      "text": " But what I'm saying is that doctrine matters."
    },
    {
      "id": 136,
      "start": 1783.0599975585938,
      "end": 1789.1400146484375,
      "text": " And God is using Paul to write this letter to encourage Timothy and to help him understand"
    },
    {
      "id": 137,
      "start": 1789.1400146484375,
      "end": 1791.9000244140625,
      "text": " there's this emphasis that's placed on sound doctrine."
    },
    {
      "id": 138,
      "start": 1791.9000244140625,
      "end": 1796.3400268554688,
      "text": " We've exposed the false teachers, they're not, listen, they've swerved, they've turned"
    },
    {
      "id": 139,
      "start": 1796.3400268554688,
      "end": 1797.3400268554688,
      "text": " their vein jangling."
    },
    {
      "id": 140,
      "start": 1797.3400268554688,
      "end": 1798.3400268554688,
      "text": " They're not qualified."
    },
    {
      "id": 141,
      "start": 1798.3400268554688,
      "end": 1799.3400268554688,
      "text": " They're teaching results."
    },
    {
      "id": 142,
      "start": 1799.3400268554688,
      "end": 1800.3400268554688,
      "text": " They're not qualified."
    },
    {
      "id": 143,
      "start": 1800.3400268554688,
      "end": 1800.3400268554688,
      "text": ""
    },
    {
      "id": 0,
      "start": 1800.3400268554688,
      "end": 1802.3800268173218,
      "text": " It's in questions, not godly edifying."
    },
    {
      "id": 1,
      "start": 1802.3800268173218,
      "end": 1806.1000270843506,
      "text": " And so Timothy understand the emphasis on doctrine."
    },
    {
      "id": 2,
      "start": 1806.1000270843506,
      "end": 1808.4800271987915,
      "text": " We have to understand the importance"
    },
    {
      "id": 3,
      "start": 1808.4800271987915,
      "end": 1812.820026397705,
      "text": " of proper interpretation and application of scripture."
    },
    {
      "id": 4,
      "start": 1812.820026397705,
      "end": 1815.820026397705,
      "text": " He says that the law in verse number eight is good"
    },
    {
      "id": 5,
      "start": 1815.820026397705,
      "end": 1817.5400276184082,
      "text": " if a man use it lawfully."
    },
    {
      "id": 6,
      "start": 1817.5400276184082,
      "end": 1819.320026397705,
      "text": " He then says in verses nine and 10,"
    },
    {
      "id": 7,
      "start": 1819.320026397705,
      "end": 1823.7800273895264,
      "text": " knowing this, that the law is not made for a righteous man,"
    },
    {
      "id": 8,
      "start": 1823.7800273895264,
      "end": 1826.1200275421143,
      "text": " but for the lawless and disobedient,"
    },
    {
      "id": 9,
      "start": 1826.1200275421143,
      "end": 1827.820026397705,
      "text": " for the ungodly and for sinners,"
    },
    {
      "id": 10,
      "start": 1827.820026397705,
      "end": 1829.5200271606445,
      "text": " for unholy and profane,"
    },
    {
      "id": 11,
      "start": 1829.5200271606445,
      "end": 1832.320026397705,
      "text": " for murderers of fathers and murderers of mothers,"
    },
    {
      "id": 12,
      "start": 1832.320026397705,
      "end": 1834.8000259399414,
      "text": " for manslayers, for whoremongers,"
    },
    {
      "id": 13,
      "start": 1834.8000259399414,
      "end": 1838.0200271606445,
      "text": " for them that defile themselves with mankind,"
    },
    {
      "id": 14,
      "start": 1838.0200271606445,
      "end": 1841.760025024414,
      "text": " for men stealers, for liars, for perjured persons."
    },
    {
      "id": 15,
      "start": 1841.760025024414,
      "end": 1844.1400260925293,
      "text": " And then he puts this clause in there."
    },
    {
      "id": 16,
      "start": 1844.1400260925293,
      "end": 1845.600025177002,
      "text": " And if there be any other thing"
    },
    {
      "id": 17,
      "start": 1845.600025177002,
      "end": 1848.320026397705,
      "text": " that is contrary to sound doctrine,"
    },
    {
      "id": 18,
      "start": 1848.320026397705,
      "end": 1851.0200271606445,
      "text": " I like the last clause, amen."
    },
    {
      "id": 19,
      "start": 1851.0200271606445,
      "end": 1853.9200286865234,
      "text": " Anything that's contrary to sound doctrine."
    },
    {
      "id": 20,
      "start": 1853.9200286865234,
      "end": 1856.3400268554688,
      "text": " But we find that he lists a number of things here"
    },
    {
      "id": 21,
      "start": 1856.3400268554688,
      "end": 1858.5000267028809,
      "text": " and provides us with that detail."
    },
    {
      "id": 22,
      "start": 1858.5000267028809,
      "end": 1861.660026550293,
      "text": " But really what he's giving us is helping us to understand,"
    },
    {
      "id": 23,
      "start": 1861.660026550293,
      "end": 1865.4200286865234,
      "text": " if we could say it this way, the purpose of the law."
    },
    {
      "id": 24,
      "start": 1865.4200286865234,
      "end": 1867.3000259399414,
      "text": " What's the purpose of the law?"
    },
    {
      "id": 25,
      "start": 1867.3000259399414,
      "end": 1868.780029296875,
      "text": " Well, the purpose of the law is very simply,"
    },
    {
      "id": 26,
      "start": 1868.780029296875,
      "end": 1870.8000259399414,
      "text": " again, why would Paul deal with this?"
    },
    {
      "id": 27,
      "start": 1870.8000259399414,
      "end": 1874.3000259399414,
      "text": " Well, because the false teachers were mishandling the law"
    },
    {
      "id": 28,
      "start": 1874.3000259399414,
      "end": 1877.0200271606445,
      "text": " and therefore Paul begins right there with the law."
    },
    {
      "id": 29,
      "start": 1877.0200271606445,
      "end": 1880.1000289916992,
      "text": " He says, let me help you understand the law is good"
    },
    {
      "id": 30,
      "start": 1880.1000289916992,
      "end": 1882.0600280761719,
      "text": " if a man use it lawfully."
    },
    {
      "id": 31,
      "start": 1882.0600280761719,
      "end": 1884.7400283813477,
      "text": " And then he shares with and helps Timothy,"
    },
    {
      "id": 32,
      "start": 1884.7400283813477,
      "end": 1888.0600280761719,
      "text": " helps us understand the purpose of the law"
    },
    {
      "id": 33,
      "start": 1888.0600280761719,
      "end": 1889.540023803711,
      "text": " in these few verses of scripture."
    },
    {
      "id": 34,
      "start": 1889.540023803711,
      "end": 1892.380027770996,
      "text": " It's interesting because he speaks about sound doctrine"
    },
    {
      "id": 35,
      "start": 1892.380027770996,
      "end": 1893.3000259399414,
      "text": " at the end of verse number 10."
    },
    {
      "id": 36,
      "start": 1893.3000259399414,
      "end": 1894.7000274658203,
      "text": " And then as you go into verse number 11,"
    },
    {
      "id": 37,
      "start": 1894.7000274658203,
      "end": 1898.540023803711,
      "text": " it says according to the glorious gospel"
    },
    {
      "id": 38,
      "start": 1899.5800247192383,
      "end": 1904.260025024414,
      "text": " of the blessed God, which was committed to my trust."
    },
    {
      "id": 39,
      "start": 1904.260025024414,
      "end": 1906.660026550293,
      "text": " So Paul understands that it was committed to him,"
    },
    {
      "id": 40,
      "start": 1906.660026550293,
      "end": 1907.5000305175781,
      "text": " the gospel."
    },
    {
      "id": 41,
      "start": 1907.5000305175781,
      "end": 1909.5000305175781,
      "text": " He says, I'm not ashamed of the gospel of Christ."
    },
    {
      "id": 42,
      "start": 1909.5000305175781,
      "end": 1911.0200271606445,
      "text": " It's the power of God unto salvation,"
    },
    {
      "id": 43,
      "start": 1911.0200271606445,
      "end": 1911.9000244140625,
      "text": " to everyone that believe it,"
    },
    {
      "id": 44,
      "start": 1911.9000244140625,
      "end": 1913.6200256347656,
      "text": " to the Jew first and also to the Greek."
    },
    {
      "id": 45,
      "start": 1913.6200256347656,
      "end": 1915.0600280761719,
      "text": " In Romans chapter number one,"
    },
    {
      "id": 46,
      "start": 1915.0600280761719,
      "end": 1917.2200241088867,
      "text": " and Paul understood the responsibility"
    },
    {
      "id": 47,
      "start": 1917.2200241088867,
      "end": 1920.0600280761719,
      "text": " that had been given to him for it's been committed to him."
    },
    {
      "id": 48,
      "start": 1920.0600280761719,
      "end": 1923.1800231933594,
      "text": " But it's interesting how he takes a direct line"
    },
    {
      "id": 49,
      "start": 1923.1800231933594,
      "end": 1927.0200271606445,
      "text": " from dealing with the law to the glorious gospel."
    },
    {
      "id": 50,
      "start": 1927.0200271606445,
      "end": 1929.7400207519531,
      "text": " And really in these couple of verses of scripture,"
    },
    {
      "id": 51,
      "start": 1929.7400207519531,
      "end": 1931.5600280761719,
      "text": " and as we look at the book of Galatians,"
    },
    {
      "id": 52,
      "start": 1931.5600280761719,
      "end": 1934.3800201416016,
      "text": " we see that that's exactly the purpose of the law."
    },
    {
      "id": 53,
      "start": 1934.3800201416016,
      "end": 1938.5800323486328,
      "text": " It exposes sin and points us to Jesus."
    },
    {
      "id": 54,
      "start": 1939.7400207519531,
      "end": 1942.8600311279297,
      "text": " If we could boil it down to a simple statement,"
    },
    {
      "id": 55,
      "start": 1942.8600311279297,
      "end": 1945.9800262451172,
      "text": " the purpose of the law is to expose sin"
    },
    {
      "id": 56,
      "start": 1945.9800262451172,
      "end": 1947.5800323486328,
      "text": " and point us to Jesus."
    },
    {
      "id": 57,
      "start": 1947.5800323486328,
      "end": 1950.300033569336,
      "text": " Look in Galatians three, if you will."
    },
    {
      "id": 58,
      "start": 1950.300033569336,
      "end": 1952.2200317382812,
      "text": " As you're turning to Galatians three,"
    },
    {
      "id": 59,
      "start": 1952.2200317382812,
      "end": 1954.3200225830078,
      "text": " I'm going to read a verse of scripture to you"
    },
    {
      "id": 60,
      "start": 1954.3200225830078,
      "end": 1955.7400207519531,
      "text": " from the book of Romans."
    },
    {
      "id": 61,
      "start": 1955.7400207519531,
      "end": 1958.300033569336,
      "text": " Romans chapter seven and verse number seven."
    },
    {
      "id": 62,
      "start": 1958.300033569336,
      "end": 1959.5000305175781,
      "text": " And then I will meet you"
    },
    {
      "id": 63,
      "start": 1959.5000305175781,
      "end": 1961.9000244140625,
      "text": " over in Galatians chapter number three."
    },
    {
      "id": 64,
      "start": 1961.9000244140625,
      "end": 1963.0600280761719,
      "text": " So Galatians chapter three,"
    },
    {
      "id": 65,
      "start": 1963.0600280761719,
      "end": 1965.4600219726562,
      "text": " we're gonna look at verses 21 through 24."
    },
    {
      "id": 66,
      "start": 1967.0600280761719,
      "end": 1968.4600219726562,
      "text": " Give you a moment to turn there."
    },
    {
      "id": 67,
      "start": 1968.4600219726562,
      "end": 1969.6600341796875,
      "text": " And then I want you to listen"
    },
    {
      "id": 68,
      "start": 1969.6600341796875,
      "end": 1972.260025024414,
      "text": " as I read Romans seven and verse number seven."
    },
    {
      "id": 69,
      "start": 1973.0600280761719,
      "end": 1976.6600341796875,
      "text": " In Romans seven, Paul says this in verse number seven."
    },
    {
      "id": 70,
      "start": 1976.6600341796875,
      "end": 1978.5800323486328,
      "text": " What shall we say then?"
    },
    {
      "id": 71,
      "start": 1978.5800323486328,
      "end": 1980.4600219726562,
      "text": " Is the law sin?"
    },
    {
      "id": 72,
      "start": 1980.4600219726562,
      "end": 1982.1000213623047,
      "text": " God forbid."
    },
    {
      "id": 73,
      "start": 1982.1000213623047,
      "end": 1983.540023803711,
      "text": " Nay."
    },
    {
      "id": 74,
      "start": 1983.540023803711,
      "end": 1984.6200256347656,
      "text": " Notice what Paul says."
    },
    {
      "id": 75,
      "start": 1984.6200256347656,
      "end": 1989.260025024414,
      "text": " I had not known sin, but by the law."
    },
    {
      "id": 76,
      "start": 1990.300033569336,
      "end": 1992.3800201416016,
      "text": " For I had not known lust,"
    },
    {
      "id": 77,
      "start": 1992.3800201416016,
      "end": 1996.5800323486328,
      "text": " except the law had said, thou shall not covet."
    },
    {
      "id": 78,
      "start": 1997.5800323486328,
      "end": 2001.1200256347656,
      "text": " So Paul is saying plainly his own testimony in Romans 7.7."
    },
    {
      "id": 79,
      "start": 2001.1200256347656,
      "end": 2002.5800323486328,
      "text": " This is the purpose of the law."
    },
    {
      "id": 80,
      "start": 2003.300033569336,
      "end": 2004.9800262451172,
      "text": " He expounds on this in Galatians three."
    },
    {
      "id": 81,
      "start": 2004.9800262451172,
      "end": 2006.8600311279297,
      "text": " Now understand the book of Galatians"
    },
    {
      "id": 82,
      "start": 2006.8600311279297,
      "end": 2009.4600219726562,
      "text": " is a book that is written to four churches"
    },
    {
      "id": 83,
      "start": 2009.4600219726562,
      "end": 2011.5800323486328,
      "text": " in the region of Galatia."
    },
    {
      "id": 84,
      "start": 2011.5800323486328,
      "end": 2013.4600219726562,
      "text": " These four churches were established"
    },
    {
      "id": 85,
      "start": 2013.4600219726562,
      "end": 2015.260025024414,
      "text": " during the first missionary journey."
    },
    {
      "id": 86,
      "start": 2015.260025024414,
      "end": 2017.3600311279297,
      "text": " And as these churches were established,"
    },
    {
      "id": 87,
      "start": 2017.3600311279297,
      "end": 2020.0600280761719,
      "text": " something happened in the region of Galatia."
    },
    {
      "id": 88,
      "start": 2020.0600280761719,
      "end": 2022.7000274658203,
      "text": " And that was that these Judaizers came in."
    },
    {
      "id": 89,
      "start": 2022.7000274658203,
      "end": 2025.4600219726562,
      "text": " And these Judaizers came in, they're very disappointed."
    },
    {
      "id": 90,
      "start": 2025.4600219726562,
      "end": 2028.02001953125,
      "text": " They're upset about the fact that people are being saved"
    },
    {
      "id": 91,
      "start": 2028.02001953125,
      "end": 2030.6200256347656,
      "text": " and not following Judaism and so on and so forth."
    },
    {
      "id": 92,
      "start": 2030.6200256347656,
      "end": 2031.4800262451172,
      "text": " And so they come in,"
    },
    {
      "id": 93,
      "start": 2031.4800262451172,
      "end": 2034.040023803711,
      "text": " they try to bring in this false teaching, this mixture."
    },
    {
      "id": 94,
      "start": 2034.040023803711,
      "end": 2036.8400268554688,
      "text": " It really gives us what happens in Acts 15"
    },
    {
      "id": 95,
      "start": 2036.8400268554688,
      "end": 2038.0800323486328,
      "text": " that I mentioned earlier."
    },
    {
      "id": 96,
      "start": 2038.0800323486328,
      "end": 2040.540023803711,
      "text": " There were some that said you had to be circumcised"
    },
    {
      "id": 97,
      "start": 2040.540023803711,
      "end": 2043.4000244140625,
      "text": " after the matter of Moses in order to be saved."
    },
    {
      "id": 98,
      "start": 2043.4000244140625,
      "end": 2046.300033569336,
      "text": " And so that's dealt with here in Galatians."
    },
    {
      "id": 99,
      "start": 2046.300033569336,
      "end": 2049.4400329589844,
      "text": " But in Galatians chapter number three in verse 24,"
    },
    {
      "id": 100,
      "start": 2049.4400329589844,
      "end": 2051.040023803711,
      "text": " notice what Paul says."
    },
    {
      "id": 101,
      "start": 2052.1600341796875,
      "end": 2053.8400268554688,
      "text": " Verse 21, we'll start in verse 21."
    },
    {
      "id": 102,
      "start": 2053.8400268554688,
      "end": 2057.800018310547,
      "text": " Is the law then against the promises of God?"
    },
    {
      "id": 103,
      "start": 2057.800018310547,
      "end": 2059.52001953125,
      "text": " God forbid."
    },
    {
      "id": 104,
      "start": 2059.52001953125,
      "end": 2061.1200256347656,
      "text": " For if there had been a law given"
    },
    {
      "id": 105,
      "start": 2061.560028076172,
      "end": 2063.280029296875,
      "text": " which could have given life,"
    },
    {
      "id": 106,
      "start": 2063.280029296875,
      "end": 2066.800018310547,
      "text": " verily righteousness should have been by the law."
    },
    {
      "id": 107,
      "start": 2067.7200317382812,
      "end": 2069.000030517578,
      "text": " But guess what?"
    },
    {
      "id": 108,
      "start": 2069.000030517578,
      "end": 2071.3600158691406,
      "text": " The law can't give life."
    },
    {
      "id": 109,
      "start": 2071.3600158691406,
      "end": 2073.0800170898438,
      "text": " All the law does is expose sin."
    },
    {
      "id": 110,
      "start": 2073.0800170898438,
      "end": 2073.9200134277344,
      "text": " You know what the law does?"
    },
    {
      "id": 111,
      "start": 2073.9200134277344,
      "end": 2074.800018310547,
      "text": " It condemns."
    },
    {
      "id": 112,
      "start": 2075.6800231933594,
      "end": 2077.5800170898438,
      "text": " The law tells you that you're guilty."
    },
    {
      "id": 113,
      "start": 2079.280029296875,
      "end": 2081.2000122070312,
      "text": " And someone says, well, I'm not really that bad."
    },
    {
      "id": 114,
      "start": 2081.2000122070312,
      "end": 2082.3800354003906,
      "text": " No, no, you're guilty."
    },
    {
      "id": 115,
      "start": 2083.760040283203,
      "end": 2085.4000244140625,
      "text": " And you're condemned."
    },
    {
      "id": 116,
      "start": 2085.4000244140625,
      "end": 2087.8400268554688,
      "text": " And it's just the reality of the Bible."
    },
    {
      "id": 117,
      "start": 2088.6800231933594,
      "end": 2091.3600158691406,
      "text": " And he says that the law,"
    },
    {
      "id": 118,
      "start": 2091.3600158691406,
      "end": 2094.1200256347656,
      "text": " if there had been a law given"
    },
    {
      "id": 119,
      "start": 2094.1200256347656,
      "end": 2095.1600341796875,
      "text": " which could have given life,"
    },
    {
      "id": 120,
      "start": 2095.1600341796875,
      "end": 2096.8400268554688,
      "text": " verily righteousness should have been by the law."
    },
    {
      "id": 121,
      "start": 2096.8400268554688,
      "end": 2101.2000122070312,
      "text": " But, verse 22, the Scripture hath concluded all under sin"
    },
    {
      "id": 122,
      "start": 2101.2000122070312,
      "end": 2104.0800170898438,
      "text": " that the promise by faith of Jesus Christ"
    },
    {
      "id": 123,
      "start": 2104.0800170898438,
      "end": 2106.7200317382812,
      "text": " might be given to them that believe."
    },
    {
      "id": 124,
      "start": 2106.7200317382812,
      "end": 2109.740020751953,
      "text": " But before faith came, we were kept under the law,"
    },
    {
      "id": 125,
      "start": 2109.740020751953,
      "end": 2113.000030517578,
      "text": " shut up under the faith which should afterwards be revealed."
    },
    {
      "id": 126,
      "start": 2113.000030517578,
      "end": 2115.000030517578,
      "text": " Wherefore, notice verse 24,"
    },
    {
      "id": 127,
      "start": 2115.000030517578,
      "end": 2117.9200134277344,
      "text": " the law was our schoolmaster for what purpose?"
    },
    {
      "id": 128,
      "start": 2117.9200134277344,
      "end": 2121.52001953125,
      "text": " To bring us unto Christ."
    },
    {
      "id": 129,
      "start": 2121.52001953125,
      "end": 2125.8800354003906,
      "text": " That we might be justified not by the law,"
    },
    {
      "id": 130,
      "start": 2125.8800354003906,
      "end": 2130.1400146484375,
      "text": " for no flesh can be justified by the law, but by faith."
    },
    {
      "id": 131,
      "start": 2132.1800231933594,
      "end": 2135.52001953125,
      "text": " That word schoolmaster is an interesting word."
    },
    {
      "id": 132,
      "start": 2135.52001953125,
      "end": 2138.4400329589844,
      "text": " The word schoolmaster does not mean a teacher."
    },
    {
      "id": 133,
      "start": 2138.4400329589844,
      "end": 2139.560028076172,
      "text": " A lot of people think it means teacher."
    },
    {
      "id": 134,
      "start": 2139.560028076172,
      "end": 2141.02001953125,
      "text": " It's not what it means."
    },
    {
      "id": 135,
      "start": 2141.02001953125,
      "end": 2144.1200256347656,
      "text": " The word schoolmaster is really within the context"
    },
    {
      "id": 136,
      "start": 2144.1200256347656,
      "end": 2147.7200317382812,
      "text": " of understanding the era of history in the society."
    },
    {
      "id": 137,
      "start": 2147.7200317382812,
      "end": 2151.3600158691406,
      "text": " It was a guardian or a guide who would accompany"
    },
    {
      "id": 138,
      "start": 2151.3600158691406,
      "end": 2154.320037841797,
      "text": " really privileged boys to be instructed."
    },
    {
      "id": 139,
      "start": 2154.320037841797,
      "end": 2156.9600219726562,
      "text": " They could not give the instruction,"
    },
    {
      "id": 140,
      "start": 2156.9600219726562,
      "end": 2160.1400146484375,
      "text": " but they took them to the one who could."
    },
    {
      "id": 141,
      "start": 2160.1400146484375,
      "end": 2162.0800170898438,
      "text": " Now think about that just for a moment."
    },
    {
      "id": 142,
      "start": 2163.000030517578,
      "end": 2164.6800231933594,
      "text": " That's why he says the law's a schoolmaster."
    },
    {
      "id": 143,
      "start": 2164.6800231933594,
      "end": 2166.3800354003906,
      "text": " It can't give you life,"
    },
    {
      "id": 144,
      "start": 2166.3800354003906,
      "end": 2169.1000366210938,
      "text": " but it can point you to the one that can."
    },
    {
      "id": 145,
      "start": 2169.1000366210938,
      "end": 2172.52001953125,
      "text": " By the way, let me say it this way, the only one that can."
    },
    {
      "id": 146,
      "start": 2173.3600158691406,
      "end": 2176.6000366210938,
      "text": " In him was life."
    },
    {
      "id": 147,
      "start": 2176.6000366210938,
      "end": 2177.6400146484375,
      "text": " Amen."
    },
    {
      "id": 148,
      "start": 2177.6400146484375,
      "end": 2180.760040283203,
      "text": " And we find that as we look at this portion of Scripture"
    },
    {
      "id": 149,
      "start": 2180.760040283203,
      "end": 2184.1200256347656,
      "text": " in 1 Timothy, as Paul is writing and he's understanding,"
    },
    {
      "id": 150,
      "start": 2184.1200256347656,
      "end": 2186.4400329589844,
      "text": " again, God has given the word."
    },
    {
      "id": 151,
      "start": 2186.4400329589844,
      "end": 2190.0400390625,
      "text": " It's by inspiration that God understands the circumstances,"
    },
    {
      "id": 152,
      "start": 2190.0400390625,
      "end": 2191.060028076172,
      "text": " all that's taking place."
    },
    {
      "id": 153,
      "start": 2191.060028076172,
      "end": 2195.0800170898438,
      "text": " And Timothy is in Ephesus and he's supposed to be standing"
    },
    {
      "id": 154,
      "start": 2195.0800170898438,
      "end": 2197.1200256347656,
      "text": " and he's supposed to be teaching"
    },
    {
      "id": 155,
      "start": 2197.1200256347656,
      "end": 2198.9600219726562,
      "text": " and he's supposed to be charging others"
    },
    {
      "id": 156,
      "start": 2198.9600219726562,
      "end": 2200.4800415039062,
      "text": " that they teach no other doctrine."
    },
    {
      "id": 157,
      "start": 2200.4800415039062,
      "end": 2202.3600158691406,
      "text": " But man, there's these false teachers"
    },
    {
      "id": 158,
      "start": 2203.2000122070312,
      "end": 2206.9200134277344,
      "text": " that they've come in and they've swerved from the truth"
    },
    {
      "id": 159,
      "start": 2206.9200134277344,
      "end": 2208.8800354003906,
      "text": " and they've turned into vain jangling"
    },
    {
      "id": 160,
      "start": 2208.8800354003906,
      "end": 2211.7200317382812,
      "text": " and they're teaching what they don't understand."
    },
    {
      "id": 161,
      "start": 2211.7200317382812,
      "end": 2213.280029296875,
      "text": " They're not qualified to do it,"
    },
    {
      "id": 162,
      "start": 2213.280029296875,
      "end": 2215.52001953125,
      "text": " but yet it seems as if there's some people"
    },
    {
      "id": 163,
      "start": 2215.52001953125,
      "end": 2216.760040283203,
      "text": " that are following them."
    },
    {
      "id": 164,
      "start": 2219.0400390625,
      "end": 2222.8800354003906,
      "text": " And Paul says, Timothy, doctrine matters."
    },
    {
      "id": 165,
      "start": 2222.8800354003906,
      "end": 2224.4000244140625,
      "text": " Let me help you understand"
    },
    {
      "id": 166,
      "start": 2225.4400329589844,
      "end": 2230.4400329589844,
      "text": " as we look in 1 Timothy 1, the purpose of the law."
    },
    {
      "id": 167,
      "start": 2230.4800415039062,
      "end": 2233.7200317382812,
      "text": " Timothy, don't be afraid of the law."
    },
    {
      "id": 168,
      "start": 2233.7200317382812,
      "end": 2237.2000122070312,
      "text": " Just understand the purpose of the law."
    },
    {
      "id": 169,
      "start": 2237.2000122070312,
      "end": 2238.7200317382812,
      "text": " Listen, if we know the truth,"
    },
    {
      "id": 170,
      "start": 2238.7200317382812,
      "end": 2241.2000122070312,
      "text": " we don't have to be afraid of any false teaching."
    },
    {
      "id": 171,
      "start": 2242.240020751953,
      "end": 2245.2000122070312,
      "text": " I don't have to be afraid of any other cult"
    },
    {
      "id": 172,
      "start": 2245.2000122070312,
      "end": 2249.6400146484375,
      "text": " or any other denomination or any other world religion."
    },
    {
      "id": 173,
      "start": 2249.6400146484375,
      "end": 2251.320037841797,
      "text": " I don't have to be afraid of it."
    },
    {
      "id": 174,
      "start": 2251.320037841797,
      "end": 2253.52001953125,
      "text": " And by the way, I don't have to be a master"
    },
    {
      "id": 175,
      "start": 2253.52001953125,
      "end": 2257.52001953125,
      "text": " of what any of those particular religions would teach."
    },
    {
      "id": 176,
      "start": 2257.52001953125,
      "end": 2260.0400390625,
      "text": " I have to be a master of this book."
    },
    {
      "id": 177,
      "start": 2260.6400146484375,
      "end": 2261.560028076172,
      "text": " And as I master this book,"
    },
    {
      "id": 178,
      "start": 2261.560028076172,
      "end": 2263.6800231933594,
      "text": " as I understand the truth of this book,"
    },
    {
      "id": 179,
      "start": 2263.6800231933594,
      "end": 2267.6000366210938,
      "text": " then I simply am able to expose the error"
    },
    {
      "id": 180,
      "start": 2267.6000366210938,
      "end": 2269.3600158691406,
      "text": " because I know the truth."
    },
    {
      "id": 181,
      "start": 2269.3600158691406,
      "end": 2272.6000366210938,
      "text": " You know, truth always exposes error."
    },
    {
      "id": 182,
      "start": 2273.6000366210938,
      "end": 2275.1200256347656,
      "text": " Always."
    },
    {
      "id": 183,
      "start": 2275.1200256347656,
      "end": 2278.6800231933594,
      "text": " Truth always exposes error."
    },
    {
      "id": 184,
      "start": 2279.52001953125,
      "end": 2282.8800354003906,
      "text": " That's why he said, sanctify them by thy word."
    },
    {
      "id": 185,
      "start": 2282.8800354003906,
      "end": 2285.3600158691406,
      "text": " Thy word is truth."
    },
    {
      "id": 186,
      "start": 2286.280029296875,
      "end": 2288.1600341796875,
      "text": " The truth of God's word."
    },
    {
      "id": 187,
      "start": 2288.1600341796875,
      "end": 2291.4400329589844,
      "text": " Timothy, don't be afraid of the law."
    },
    {
      "id": 188,
      "start": 2291.4400329589844,
      "end": 2294.1200256347656,
      "text": " Understand the purpose of the law."
    },
    {
      "id": 189,
      "start": 2294.1200256347656,
      "end": 2296.1600341796875,
      "text": " Understand the purpose of the law."
    },
    {
      "id": 190,
      "start": 2296.1600341796875,
      "end": 2297.4800415039062,
      "text": " Then we see the product of the law"
    },
    {
      "id": 191,
      "start": 2297.4800415039062,
      "end": 2299.800018310547,
      "text": " because the law, it can't produce life,"
    },
    {
      "id": 192,
      "start": 2299.800018310547,
      "end": 2301.9600219726562,
      "text": " but it points us to the one."
    },
    {
      "id": 193,
      "start": 2301.9600219726562,
      "end": 2304.240020751953,
      "text": " And as it points us to Jesus Christ,"
    },
    {
      "id": 194,
      "start": 2304.240020751953,
      "end": 2305.6800231933594,
      "text": " it brings us to Christ."
    },
    {
      "id": 195,
      "start": 2305.6800231933594,
      "end": 2308.800018310547,
      "text": " And we find that as the law would bring us to Christ,"
    },
    {
      "id": 196,
      "start": 2308.800018310547,
      "end": 2309.9600219726562,
      "text": " we look at verse number five."
    },
    {
      "id": 197,
      "start": 2309.9600219726562,
      "end": 2312.7200317382812,
      "text": " Now the end of the commandment is charity"
    },
    {
      "id": 198,
      "start": 2312.7200317382812,
      "end": 2315.0,
      "text": " out of a pure heart and of a good conscience"
    },
    {
      "id": 199,
      "start": 2315.0,
      "end": 2316.9600219726562,
      "text": " and of faith unfeigned."
    },
    {
      "id": 200,
      "start": 2316.9600219726562,
      "end": 2321.4000244140625,
      "text": " If I could summarize love, righteousness, and faith."
    },
    {
      "id": 201,
      "start": 2321.4000244140625,
      "end": 2323.8400268554688,
      "text": " But those things don't come by the law."
    },
    {
      "id": 202,
      "start": 2323.8400268554688,
      "end": 2325.9600219726562,
      "text": " They come through Christ"
    },
    {
      "id": 203,
      "start": 2325.9600219726562,
      "end": 2328.52001953125,
      "text": " because we understand the purpose of the law"
    },
    {
      "id": 204,
      "start": 2328.52001953125,
      "end": 2331.0800170898438,
      "text": " is to expose and to condemn,"
    },
    {
      "id": 205,
      "start": 2331.0800170898438,
      "end": 2333.8400268554688,
      "text": " but really to point us to the one who gives life,"
    },
    {
      "id": 206,
      "start": 2333.8400268554688,
      "end": 2338.5599975585938,
      "text": " the one who is love, the one who is righteous."
    },
    {
      "id": 207,
      "start": 2338.5599975585938,
      "end": 2340.6400146484375,
      "text": " And he allows us to have that love"
    },
    {
      "id": 208,
      "start": 2340.6400146484375,
      "end": 2342.7200317382812,
      "text": " and that righteousness and that faith."
    },
    {
      "id": 209,
      "start": 2342.7200317382812,
      "end": 2344.4400024414062,
      "text": " It enables us to be able to please him."
    },
    {
      "id": 210,
      "start": 2344.4400024414062,
      "end": 2347.6400146484375,
      "text": " Listen, the law has a purpose."
    },
    {
      "id": 211,
      "start": 2347.6400146484375,
      "end": 2350.800048828125,
      "text": " The law points us to the Lord Jesus Christ."
    },
    {
      "id": 212,
      "start": 2350.800048828125,
      "end": 2355.0,
      "text": " And we see in verse number five, the result of that."
    },
    {
      "id": 213,
      "start": 2355.0,
      "end": 2356.6000366210938,
      "text": " Now I'm thankful this morning."
    },
    {
      "id": 214,
      "start": 2356.6000366210938,
      "end": 2359.800048828125,
      "text": " Again, we don't have to be intimidated by the law."
    },
    {
      "id": 215,
      "start": 2359.800048828125,
      "end": 2362.4000244140625,
      "text": " We don't have to be intimidated by the Old Testament."
    },
    {
      "id": 216,
      "start": 2362.4000244140625,
      "end": 2364.2000122070312,
      "text": " We don't have to be intimidated by somebody coming"
    },
    {
      "id": 217,
      "start": 2364.2000122070312,
      "end": 2365.760009765625,
      "text": " and saying, well, you know that the..."
    },
    {
      "id": 218,
      "start": 2365.760009765625,
      "end": 2367.52001953125,
      "text": " No, no, just study the Bible."
    },
    {
      "id": 219,
      "start": 2368.5599975585938,
      "end": 2370.6400146484375,
      "text": " Interpret scripture with scripture."
    },
    {
      "id": 220,
      "start": 2370.6400146484375,
      "end": 2372.800048828125,
      "text": " Keep it within its context."
    },
    {
      "id": 221,
      "start": 2372.800048828125,
      "end": 2373.760009765625,
      "text": " Amen."
    },
    {
      "id": 222,
      "start": 2374.0,
      "end": 2376.7200317382812,
      "text": " I found so often what happens is people wanna grab"
    },
    {
      "id": 223,
      "start": 2376.7200317382812,
      "end": 2379.6000366210938,
      "text": " a verse of scripture out of context."
    },
    {
      "id": 224,
      "start": 2379.6000366210938,
      "end": 2382.800048828125,
      "text": " You say, hold on a minute, let's read that in its context."
    },
    {
      "id": 225,
      "start": 2382.800048828125,
      "end": 2384.1200561523438,
      "text": " Let's read the whole chapter."
    },
    {
      "id": 226,
      "start": 2384.1200561523438,
      "end": 2385.7200317382812,
      "text": " Let's maybe read the chapter before"
    },
    {
      "id": 227,
      "start": 2385.7200317382812,
      "end": 2388.1600341796875,
      "text": " and the chapter after, right?"
    },
    {
      "id": 228,
      "start": 2388.1600341796875,
      "end": 2390.8800048828125,
      "text": " Let's look at some other verses of scripture"
    },
    {
      "id": 229,
      "start": 2390.8800048828125,
      "end": 2395.8800048828125,
      "text": " that God gives us, a parallel passage that God gives us."
    },
    {
      "id": 230,
      "start": 2396.2000122070312,
      "end": 2399.7200317382812,
      "text": " I've said this, we should never build a doctrine"
    },
    {
      "id": 231,
      "start": 2399.7200317382812,
      "end": 2400.5599975585938,
      "text": " on a..."
    },
    {
      "id": 0,
      "start": 2400.5599975585938,
      "end": 2407.599997520447,
      "text": " an obscurity when it's in opposition to an obvious."
    },
    {
      "id": 1,
      "start": 2407.599997520447,
      "end": 2411.2399978637695,
      "text": " There are some times that you go to the scripture and say, well, at the surface level it might"
    },
    {
      "id": 2,
      "start": 2411.2399978637695,
      "end": 2412.2399978637695,
      "text": " sound like this."
    },
    {
      "id": 3,
      "start": 2412.2399978637695,
      "end": 2414.4399976730347,
      "text": " No, no, dig in."
    },
    {
      "id": 4,
      "start": 2414.4399976730347,
      "end": 2417.5199966430664,
      "text": " In Hebrews chapter number six, so many people love to run to Hebrews chapter number six"
    },
    {
      "id": 5,
      "start": 2417.5199966430664,
      "end": 2421.259998321533,
      "text": " and say you can lose your salvation."
    },
    {
      "id": 6,
      "start": 2421.259998321533,
      "end": 2426.4799976348877,
      "text": " The Bible all over the place calls it eternal security, eternal, or excuse me, eternal life,"
    },
    {
      "id": 7,
      "start": 2426.4799976348877,
      "end": 2428.8399982452393,
      "text": " everlasting life, right?"
    },
    {
      "id": 8,
      "start": 2428.8399982452393,
      "end": 2430.619997024536,
      "text": " That's the gift of God."
    },
    {
      "id": 9,
      "start": 2430.619997024536,
      "end": 2434.719997406006,
      "text": " And by the way, if you study Hebrews, you find in chapter number six, as they want to"
    },
    {
      "id": 10,
      "start": 2434.719997406006,
      "end": 2441.1199989318848,
      "text": " go and run to that passage, that before and after chapter number six, you know what the"
    },
    {
      "id": 11,
      "start": 2441.1199989318848,
      "end": 2442.1799964904785,
      "text": " Bible talks about?"
    },
    {
      "id": 12,
      "start": 2442.1799964904785,
      "end": 2448.319995880127,
      "text": " How that God is the author of eternal life, eternal salvation."
    },
    {
      "id": 13,
      "start": 2448.319995880127,
      "end": 2452.3599967956543,
      "text": " So you're going to tell me that prior to he tells us that he's the author of eternal salvation"
    },
    {
      "id": 14,
      "start": 2452.3599967956543,
      "end": 2457.3999977111816,
      "text": " and then he's going to tell you that you could lose it, it doesn't even make sense."
    },
    {
      "id": 15,
      "start": 2457.3999977111816,
      "end": 2460.7999992370605,
      "text": " You can find that over and over and over."
    },
    {
      "id": 16,
      "start": 2460.7999992370605,
      "end": 2467.3600006103516,
      "text": " Can I tell you this morning, false teachers are prevalent all over the place."
    },
    {
      "id": 17,
      "start": 2467.3600006103516,
      "end": 2470.720001220703,
      "text": " You know where they are very prevalent today?"
    },
    {
      "id": 18,
      "start": 2470.720001220703,
      "end": 2473.3600006103516,
      "text": " On the internet."
    },
    {
      "id": 19,
      "start": 2473.3600006103516,
      "end": 2475.9399948120117,
      "text": " On the internet."
    },
    {
      "id": 20,
      "start": 2475.9399948120117,
      "end": 2476.9399948120117,
      "text": " On the internet."
    },
    {
      "id": 21,
      "start": 2476.9399948120117,
      "end": 2485.7999954223633,
      "text": " Man, they get a lot of followers, get a lot of, you know, so often what happens it seems"
    },
    {
      "id": 22,
      "start": 2485.7999954223633,
      "end": 2490.5199966430664,
      "text": " as you can type in a question in Google, seems like Google knows everything."
    },
    {
      "id": 23,
      "start": 2490.5199966430664,
      "end": 2492.879997253418,
      "text": " Be careful."
    },
    {
      "id": 24,
      "start": 2492.879997253418,
      "end": 2494.4399948120117,
      "text": " Be careful."
    },
    {
      "id": 25,
      "start": 2494.4399948120117,
      "end": 2498.599998474121,
      "text": " You know, this AI stuff that's come out, be careful."
    },
    {
      "id": 26,
      "start": 2498.599998474121,
      "end": 2501.479995727539,
      "text": " Be careful."
    },
    {
      "id": 27,
      "start": 2501.479995727539,
      "end": 2505.279998779297,
      "text": " They're rewriting the Bible, be careful."
    },
    {
      "id": 28,
      "start": 2505.279998779297,
      "end": 2509.5199966430664,
      "text": " We've seen it in modern translations, but you see it, I read an article not long ago"
    },
    {
      "id": 29,
      "start": 2509.5199966430664,
      "end": 2510.5199966430664,
      "text": " in China."
    },
    {
      "id": 30,
      "start": 2510.5199966430664,
      "end": 2515.3999938964844,
      "text": " Listen, China, they don't let you have a Bible in China, but all of a sudden they're rewriting"
    },
    {
      "id": 31,
      "start": 2515.3999938964844,
      "end": 2518.199996948242,
      "text": " John chapter number 8."
    },
    {
      "id": 32,
      "start": 2518.199996948242,
      "end": 2524.5599975585938,
      "text": " John chapter number 8 deals with people bringing someone to Christ, a lady, that said she was"
    },
    {
      "id": 33,
      "start": 2524.5599975585938,
      "end": 2526.879997253418,
      "text": " caught in the very act of adultery."
    },
    {
      "id": 34,
      "start": 2526.879997253418,
      "end": 2527.879997253418,
      "text": " She should be stoned."
    },
    {
      "id": 35,
      "start": 2527.879997253418,
      "end": 2528.8800048828125,
      "text": " The law condemns her."
    },
    {
      "id": 36,
      "start": 2528.8800048828125,
      "end": 2532.6799926757812,
      "text": " Well, actually, if you go back to the law, it condemns both he and she."
    },
    {
      "id": 37,
      "start": 2532.6799926757812,
      "end": 2533.6799926757812,
      "text": " Amen?"
    },
    {
      "id": 38,
      "start": 2533.6799926757812,
      "end": 2534.6799926757812,
      "text": " Leviticus."
    },
    {
      "id": 39,
      "start": 2534.6799926757812,
      "end": 2538.0800018310547,
      "text": " Just go back and read it."
    },
    {
      "id": 40,
      "start": 2538.0800018310547,
      "end": 2540.4400024414062,
      "text": " But they want to see her stoned."
    },
    {
      "id": 41,
      "start": 2540.4400024414062,
      "end": 2545.720001220703,
      "text": " Jesus, as only He can, He just bends down as if He's not even listening to them."
    },
    {
      "id": 42,
      "start": 2545.720001220703,
      "end": 2546.720001220703,
      "text": " He just starts writing."
    },
    {
      "id": 43,
      "start": 2546.720001220703,
      "end": 2548.239990234375,
      "text": " I think He's writing their sin."
    },
    {
      "id": 44,
      "start": 2548.239990234375,
      "end": 2549.239990234375,
      "text": " That's just what I believe."
    },
    {
      "id": 45,
      "start": 2549.239990234375,
      "end": 2550.239990234375,
      "text": " I have no idea what He's writing."
    },
    {
      "id": 46,
      "start": 2550.239990234375,
      "end": 2551.239990234375,
      "text": " It doesn't tell us."
    },
    {
      "id": 47,
      "start": 2551.239990234375,
      "end": 2557.239990234375,
      "text": " But He's just writing, and He says, let him that hath no sin cast the first stone."
    },
    {
      "id": 48,
      "start": 2557.239990234375,
      "end": 2561.479995727539,
      "text": " And then He says to her, hey, where are these nine accusers?"
    },
    {
      "id": 49,
      "start": 2561.479995727539,
      "end": 2568.0,
      "text": " They're all gone, because they were guilty too."
    },
    {
      "id": 50,
      "start": 2568.0,
      "end": 2573.479995727539,
      "text": " And then Jesus said to her, go and sin no more."
    },
    {
      "id": 51,
      "start": 2573.479995727539,
      "end": 2574.479995727539,
      "text": " Amen?"
    },
    {
      "id": 52,
      "start": 2574.479995727539,
      "end": 2575.479995727539,
      "text": " John 8."
    },
    {
      "id": 53,
      "start": 2575.479995727539,
      "end": 2581.1199951171875,
      "text": " You know what they're saying in China?"
    },
    {
      "id": 54,
      "start": 2581.1199951171875,
      "end": 2584.479995727539,
      "text": " After the accusers left, Jesus stoned her."
    },
    {
      "id": 55,
      "start": 2584.479995727539,
      "end": 2586.479995727539,
      "text": " Yeah."
    },
    {
      "id": 56,
      "start": 2586.479995727539,
      "end": 2588.479995727539,
      "text": " Yeah."
    },
    {
      "id": 57,
      "start": 2588.479995727539,
      "end": 2594.4400024414062,
      "text": " Do you understand what kind of picture that paints of Jesus?"
    },
    {
      "id": 58,
      "start": 2594.4400024414062,
      "end": 2595.9199981689453,
      "text": " Think about the ramifications."
    },
    {
      "id": 59,
      "start": 2595.9199981689453,
      "end": 2599.6799926757812,
      "text": " Listen, false teaching is so prevalent today."
    },
    {
      "id": 60,
      "start": 2599.6799926757812,
      "end": 2603.3600006103516,
      "text": " You type something in Google and you think the first results that pop up must be the"
    },
    {
      "id": 61,
      "start": 2603.3600006103516,
      "end": 2604.5999908447266,
      "text": " right ones."
    },
    {
      "id": 62,
      "start": 2604.5999908447266,
      "end": 2605.759994506836,
      "text": " That's not always true."
    },
    {
      "id": 63,
      "start": 2605.759994506836,
      "end": 2610.199996948242,
      "text": " Those algorithms are not always in our best interest."
    },
    {
      "id": 64,
      "start": 2610.199996948242,
      "end": 2615.8800048828125,
      "text": " It's beyond my ability how they can process nine million websites as quickly as they can"
    },
    {
      "id": 65,
      "start": 2615.8800048828125,
      "end": 2620.4400024414062,
      "text": " and all that they do to provide you with the results that they provide you with."
    },
    {
      "id": 66,
      "start": 2620.4400024414062,
      "end": 2623.800003051758,
      "text": " But I would tell you that they're not, the first one that pops up isn't always the right"
    },
    {
      "id": 67,
      "start": 2623.800003051758,
      "end": 2625.800003051758,
      "text": " one."
    },
    {
      "id": 68,
      "start": 2625.800003051758,
      "end": 2628.1600036621094,
      "text": " You can't believe everything you see on the Internet."
    },
    {
      "id": 69,
      "start": 2628.1600036621094,
      "end": 2631.0,
      "text": " You can't believe every YouTube preacher."
    },
    {
      "id": 70,
      "start": 2631.0,
      "end": 2635.0,
      "text": " I don't care how many followers they have."
    },
    {
      "id": 71,
      "start": 2635.0,
      "end": 2638.0,
      "text": " God's Word exposes false teaching."
    },
    {
      "id": 72,
      "start": 2638.0,
      "end": 2641.1600036621094,
      "text": " You can't believe the guy that has the biggest church."
    },
    {
      "id": 73,
      "start": 2641.1600036621094,
      "end": 2643.3600006103516,
      "text": " And I'm not saying that all of those people are false teachers."
    },
    {
      "id": 74,
      "start": 2643.3600006103516,
      "end": 2646.279998779297,
      "text": " I'm simply saying we must be careful."
    },
    {
      "id": 75,
      "start": 2646.279998779297,
      "end": 2652.1199951171875,
      "text": " We must be careful, because false teachers, they exist, they're exposed by God's Word."
    },
    {
      "id": 76,
      "start": 2652.1199951171875,
      "end": 2655.479995727539,
      "text": " And then the emphasis is placed on sound doctrine."
    },
    {
      "id": 77,
      "start": 2655.479995727539,
      "end": 2664.519989013672,
      "text": " As we continue, we must continue with the knowledge that doctrine matters."
    },
    {
      "id": 78,
      "start": 2664.519989013672,
      "end": 2670.040008544922,
      "text": " Because we have to continue in a manner in which is pleasing to God."
    },
    {
      "id": 79,
      "start": 2670.040008544922,
      "end": 2672.6799926757812,
      "text": " God didn't just say continue and continue however you want."
    },
    {
      "id": 80,
      "start": 2672.6799926757812,
      "end": 2677.0,
      "text": " No, continue and here's the path to continue on."
    },
    {
      "id": 81,
      "start": 2677.0,
      "end": 2682.1600036621094,
      "text": " Continue carries with it in my mind the concept, if you will, of making progress."
    },
    {
      "id": 82,
      "start": 2682.1600036621094,
      "end": 2684.6000061035156,
      "text": " But that progress is the right direction."
    },
    {
      "id": 83,
      "start": 2684.6000061035156,
      "end": 2687.7999877929688,
      "text": " You ever find somebody that's busy, but they're not busy doing what they're supposed to be"
    },
    {
      "id": 84,
      "start": 2687.7999877929688,
      "end": 2689.5599975585938,
      "text": " doing?"
    },
    {
      "id": 85,
      "start": 2689.5599975585938,
      "end": 2691.040008544922,
      "text": " You know what I'm saying?"
    },
    {
      "id": 86,
      "start": 2691.040008544922,
      "end": 2696.9199829101562,
      "text": " You find some people on the work site that seem like they work harder to get out of work"
    },
    {
      "id": 87,
      "start": 2696.9199829101562,
      "end": 2698.9199829101562,
      "text": " than if they just work."
    },
    {
      "id": 88,
      "start": 2698.9199829101562,
      "end": 2701.3200073242188,
      "text": " No, no."
    },
    {
      "id": 89,
      "start": 2701.3200073242188,
      "end": 2706.040008544922,
      "text": " He says we're to continue and he says doctrine matters."
    },
    {
      "id": 90,
      "start": 2706.040008544922,
      "end": 2707.9199829101562,
      "text": " Turn over to Jude and we'll end there."
    },
    {
      "id": 91,
      "start": 2707.9199829101562,
      "end": 2710.720001220703,
      "text": " Jude has one chapter."
    },
    {
      "id": 92,
      "start": 2710.720001220703,
      "end": 2717.6000061035156,
      "text": " And I want you to see what Jude writes of."
    },
    {
      "id": 93,
      "start": 2717.6000061035156,
      "end": 2727.519989013672,
      "text": " There is a great exposure of false teaching in this short letter, the short book of Jude."
    },
    {
      "id": 94,
      "start": 2727.519989013672,
      "end": 2732.4400024414062,
      "text": " Jude begins in verse number one."
    },
    {
      "id": 95,
      "start": 2732.4400024414062,
      "end": 2737.760009765625,
      "text": " Jude the servant of Jesus Christ, by the way, it's a good title, to be the servant of Jesus"
    },
    {
      "id": 96,
      "start": 2737.760009765625,
      "end": 2739.7999877929688,
      "text": " Christ."
    },
    {
      "id": 97,
      "start": 2739.7999877929688,
      "end": 2744.959991455078,
      "text": " And brother of James, to them that are sanctified by God the Father and preserved in Jesus Christ"
    },
    {
      "id": 98,
      "start": 2744.959991455078,
      "end": 2746.6399841308594,
      "text": " and called."
    },
    {
      "id": 99,
      "start": 2746.6399841308594,
      "end": 2749.519989013672,
      "text": " Mercy unto you and peace and love be multiplied."
    },
    {
      "id": 100,
      "start": 2749.519989013672,
      "end": 2755.0,
      "text": " Beloved, when I gave all diligence to write unto you of the common salvation."
    },
    {
      "id": 101,
      "start": 2755.0,
      "end": 2761.480010986328,
      "text": " This is not common as in just it's a low quality or of little value."
    },
    {
      "id": 102,
      "start": 2761.480010986328,
      "end": 2765.480010986328,
      "text": " No, it's that they had common salvation amongst them."
    },
    {
      "id": 103,
      "start": 2765.480010986328,
      "end": 2767.6000061035156,
      "text": " They were saved by the grace of God."
    },
    {
      "id": 104,
      "start": 2767.6000061035156,
      "end": 2773.040008544922,
      "text": " He says, notice in verse number three, it was needful for me to write unto you and exhort"
    },
    {
      "id": 105,
      "start": 2773.040008544922,
      "end": 2778.480010986328,
      "text": " you that you should earnestly contend for the faith which was once delivered unto the"
    },
    {
      "id": 106,
      "start": 2778.480010986328,
      "end": 2779.480010986328,
      "text": " saints."
    },
    {
      "id": 107,
      "start": 2779.480010986328,
      "end": 2785.480010986328,
      "text": " So really, God allows Jude to express his heart in this book and say, I was planning"
    },
    {
      "id": 108,
      "start": 2785.480010986328,
      "end": 2790.0,
      "text": " to write to you on this, but God said, no, this is needed."
    },
    {
      "id": 109,
      "start": 2790.0,
      "end": 2792.239990234375,
      "text": " You know, as a pastor, I can relate to that."
    },
    {
      "id": 110,
      "start": 2792.239990234375,
      "end": 2796.040008544922,
      "text": " There are sometimes there's some messages I'd like to preach that are just kind of exhorting"
    },
    {
      "id": 111,
      "start": 2796.040008544922,
      "end": 2801.279998779297,
      "text": " kind of messages, and sometimes God says, no, we need this today, and I want to follow"
    },
    {
      "id": 112,
      "start": 2801.279998779297,
      "end": 2803.3999938964844,
      "text": " the leadership of the Holy Spirit of God."
    },
    {
      "id": 113,
      "start": 2803.3999938964844,
      "end": 2809.6000061035156,
      "text": " I shared with you a study that we did on Wednesday evening on Psalm 143 at the end of last year."
    },
    {
      "id": 114,
      "start": 2809.6000061035156,
      "end": 2811.040008544922,
      "text": " I didn't know why God led me there."
    },
    {
      "id": 115,
      "start": 2811.040008544922,
      "end": 2813.6799926757812,
      "text": " I was desiring to go a completely different way."
    },
    {
      "id": 116,
      "start": 2813.6799926757812,
      "end": 2818.040008544922,
      "text": " It was amazing after that study, actually in the midst of that study, there were a number"
    },
    {
      "id": 117,
      "start": 2818.040008544922,
      "end": 2821.0799865722656,
      "text": " of people that came and said, I needed this."
    },
    {
      "id": 118,
      "start": 2821.0799865722656,
      "end": 2822.279998779297,
      "text": " God knows that."
    },
    {
      "id": 119,
      "start": 2822.279998779297,
      "end": 2825.2000122070312,
      "text": " I'm not smart enough to figure that out."
    },
    {
      "id": 120,
      "start": 2825.3599853515625,
      "end": 2829.959991455078,
      "text": " But God knows, and Jude says, I was desiring to write on this."
    },
    {
      "id": 121,
      "start": 2829.959991455078,
      "end": 2834.0,
      "text": " This is what I planned to write on, but it was needful for me to write unto you and to"
    },
    {
      "id": 122,
      "start": 2834.0,
      "end": 2839.279998779297,
      "text": " exhort you that you should earnestly contend for the faith which was once delivered on"
    },
    {
      "id": 123,
      "start": 2839.279998779297,
      "end": 2840.279998779297,
      "text": " the saints."
    },
    {
      "id": 124,
      "start": 2840.279998779297,
      "end": 2841.279998779297,
      "text": " Why?"
    },
    {
      "id": 125,
      "start": 2841.279998779297,
      "end": 2844.5599975585938,
      "text": " Verse four, for there are certain men crept in."
    },
    {
      "id": 126,
      "start": 2844.5599975585938,
      "end": 2847.2000122070312,
      "text": " Do you notice that word unawares?"
    },
    {
      "id": 127,
      "start": 2847.2000122070312,
      "end": 2848.6000061035156,
      "text": " You know what's interesting about false teachers?"
    },
    {
      "id": 128,
      "start": 2848.6000061035156,
      "end": 2852.4400024414062,
      "text": " They don't come in and say, hey, I'm a false teacher."
    },
    {
      "id": 129,
      "start": 2852.4400024414062,
      "end": 2857.1600036621094,
      "text": " They don't have a banner that they carry, there's no sign on their forehead or on their"
    },
    {
      "id": 130,
      "start": 2857.1600036621094,
      "end": 2859.0799865722656,
      "text": " back that says, I'm a false teacher."
    },
    {
      "id": 131,
      "start": 2859.0799865722656,
      "end": 2861.7999877929688,
      "text": " No, they come in unawares."
    },
    {
      "id": 132,
      "start": 2861.7999877929688,
      "end": 2863.5799865722656,
      "text": " You know what happens often with these false teachers?"
    },
    {
      "id": 133,
      "start": 2863.5799865722656,
      "end": 2867.3599853515625,
      "text": " They try to use the same kind of terminology that you'll use."
    },
    {
      "id": 134,
      "start": 2867.3599853515625,
      "end": 2873.9199829101562,
      "text": " I've said this before, that false teachers use our vocabulary but not our dictionary."
    },
    {
      "id": 135,
      "start": 2873.9199829101562,
      "end": 2875.1000061035156,
      "text": " They'll use the same words."
    },
    {
      "id": 136,
      "start": 2875.1000061035156,
      "end": 2877.9199829101562,
      "text": " You talk to somebody about being born again, they'll need something totally different."
    },
    {
      "id": 137,
      "start": 2877.9199829101562,
      "end": 2879.480010986328,
      "text": " Oh yeah, I was born again, I was baptized."
    },
    {
      "id": 138,
      "start": 2879.480010986328,
      "end": 2881.6799926757812,
      "text": " No, no, no, that's not being born again."
    },
    {
      "id": 139,
      "start": 2881.6799926757812,
      "end": 2882.6799926757812,
      "text": " Amen?"
    },
    {
      "id": 140,
      "start": 2882.6799926757812,
      "end": 2885.6000061035156,
      "text": " That's not the Bible definition of being born again."
    },
    {
      "id": 141,
      "start": 2885.6000061035156,
      "end": 2890.9199829101562,
      "text": " And so we see that it says that they've crept in unawares who were before of old ordained"
    },
    {
      "id": 142,
      "start": 2890.9199829101562,
      "end": 2896.239990234375,
      "text": " to the condemnation, ungodly men, turning the grace of our God into lasciviousness and"
    },
    {
      "id": 143,
      "start": 2896.239990234375,
      "end": 2902.7999877929688,
      "text": " denying the only Lord God and our Lord Jesus Christ."
    },
    {
      "id": 144,
      "start": 2902.7999877929688,
      "end": 2909.8800048828125,
      "text": " So Jude writes that these brethren would earnestly contend for the faith."
    },
    {
      "id": 145,
      "start": 2909.8800048828125,
      "end": 2910.8800048828125,
      "text": " Why?"
    },
    {
      "id": 146,
      "start": 2911.0799865722656,
      "end": 2913.5599975585938,
      "text": " Because doctrine matters."
    },
    {
      "id": 147,
      "start": 2913.5599975585938,
      "end": 2918.52001953125,
      "text": " Faith that's mentioned here is really, it would encompass, if you will, that doctrine,"
    },
    {
      "id": 148,
      "start": 2918.52001953125,
      "end": 2919.52001953125,
      "text": " right?"
    },
    {
      "id": 149,
      "start": 2919.52001953125,
      "end": 2920.52001953125,
      "text": " All of that teaching."
    },
    {
      "id": 150,
      "start": 2920.52001953125,
      "end": 2924.9199829101562,
      "text": " And he says that we would earnestly contend for the faith."
    },
    {
      "id": 151,
      "start": 2924.9199829101562,
      "end": 2933.3599853515625,
      "text": " Not today as we look at the truth, not all men love the Lord."
    },
    {
      "id": 152,
      "start": 2933.3599853515625,
      "end": 2936.0,
      "text": " There are some that are the enemies of the cross."
    },
    {
      "id": 153,
      "start": 2936.0,
      "end": 2942.0,
      "text": " Now some are easy to identify, but some are not."
    },
    {
      "id": 154,
      "start": 2942.0,
      "end": 2945.1599731445312,
      "text": " And Paul says, Timothy, continue."
    },
    {
      "id": 155,
      "start": 2945.1599731445312,
      "end": 2951.4000244140625,
      "text": " God has equipped you, but here is the manner in which you must continue."
    },
    {
      "id": 156,
      "start": 2951.4000244140625,
      "end": 2953.4000244140625,
      "text": " Doctrine matters."
    },
    {
      "id": 157,
      "start": 2953.4000244140625,
      "end": 2955.760009765625,
      "text": " We must remember that."
    },
    {
      "id": 158,
      "start": 2955.760009765625,
      "end": 2959.7999877929688,
      "text": " As we go through this study this year, we must remember that in our own lives."
    },
    {
      "id": 159,
      "start": 2959.7999877929688,
      "end": 2965.239990234375,
      "text": " We do not bend, we do not fold on what thus saith the Lord."
    },
    {
      "id": 160,
      "start": 2965.47998046875,
      "end": 2968.8800048828125,
      "text": " You say, it's not popular anymore, Pastor."
    },
    {
      "id": 161,
      "start": 2968.8800048828125,
      "end": 2972.2799682617188,
      "text": " God's Word endures."
    },
    {
      "id": 162,
      "start": 2972.2799682617188,
      "end": 2975.1599731445312,
      "text": " God's Word stands."
    },
    {
      "id": 163,
      "start": 2975.1599731445312,
      "end": 2976.719970703125,
      "text": " We want to have the right position."
    },
    {
      "id": 164,
      "start": 2976.719970703125,
      "end": 2978.5999755859375,
      "text": " We want to have the right disposition."
    },
    {
      "id": 165,
      "start": 2978.5999755859375,
      "end": 2981.6599731445312,
      "text": " We want to love people to Jesus."
    },
    {
      "id": 166,
      "start": 2981.6599731445312,
      "end": 2988.0399780273438,
      "text": " But the reality is that God's Word is plain and doctrine matters."
    },
    {
      "id": 167,
      "start": 2988.0399780273438,
      "end": 2989.0399780273438,
      "text": " Let's pray."
    },
    {
      "id": 168,
      "start": 2989.0399780273438,
      "end": 2990.0399780273438,
      "text": " Father, we love you."
    },
    {
      "id": 169,
      "start": 2990.0399780273438,
      "end": 2991.1199951171875,
      "text": " We thank you for loving us."
    },
    {
      "id": 170,
      "start": 2991.1199951171875,
      "end": 2996.2000122070312,
      "text": " We thank you for the charge that was given to Timothy, and we thank you that after receiving"
    },
    {
      "id": 171,
      "start": 2996.2000122070312,
      "end": 3000.5999755859375,
      "text": " that charge and understanding how he'd been equipped, that there's an..."
    },
    {
      "id": 0,
      "start": 3000.5999755859375,
      "end": 3006.039975643158,
      "text": " exposure of these false teachers. There's an emphasis on sound doctrine. God, I pray"
    },
    {
      "id": 1,
      "start": 3006.039975643158,
      "end": 3013.119976043701,
      "text": " that you would help us to be students of the Word, that we would study to show ourselves"
    },
    {
      "id": 2,
      "start": 3013.119976043701,
      "end": 3017.539976119995,
      "text": " approved. We'll see that as Paul writes to Timothy. I pray that you'd help us to know"
    },
    {
      "id": 3,
      "start": 3017.539976119995,
      "end": 3022.639976501465,
      "text": " how we ought to behave ourselves. We see that again as Paul writes to Timothy in the house"
    },
    {
      "id": 4,
      "start": 3022.639976501465,
      "end": 3029.239974975586,
      "text": " of God, understanding that it's the pillar and ground of the truth. God, help us to understand"
    },
    {
      "id": 5,
      "start": 3029.239974975586,
      "end": 3038.4799766540527,
      "text": " that doctrine matters. Help us to know thy Word. Help us, Lord, not to be alarmed by"
    },
    {
      "id": 6,
      "start": 3038.4799766540527,
      "end": 3048.519973754883,
      "text": " or worried about false teaching. Help us to simply be ground in the faith. Help us to"
    },
    {
      "id": 7,
      "start": 3048.519973754883,
      "end": 3056.7199745178223,
      "text": " be students of your Word. God, I pray that as we, as individuals, seek to live our lives"
    },
    {
      "id": 8,
      "start": 3056.7199745178223,
      "end": 3061.5999755859375,
      "text": " to please you and to continue, Lord, I pray that you'd help us to understand that doctrine"
    },
    {
      "id": 9,
      "start": 3061.5999755859375,
      "end": 3069.079978942871,
      "text": " matters. Help us to be careful of the books that we read, of the websites that we visit,"
    },
    {
      "id": 10,
      "start": 3069.079978942871,
      "end": 3077.55997467041,
      "text": " of the messages that we listen to. Lord, help us to prove, to try the spirits, to prove"
    },
    {
      "id": 11,
      "start": 3077.55997467041,
      "end": 3086.3999786376953,
      "text": " all things, Lord, to understand that doctrine matters. I pray that you would move and work"
    },
    {
      "id": 12,
      "start": 3086.3999786376953,
      "end": 3091.759979248047,
      "text": " in hearts and lives, Lord. We spoke about the purpose of the law, to expose sin. It"
    },
    {
      "id": 13,
      "start": 3091.759979248047,
      "end": 3097.4799728393555,
      "text": " condemns. It cannot give life. It simply reveals that we're guilty. But it points us to the"
    },
    {
      "id": 14,
      "start": 3097.4799728393555,
      "end": 3103.9199752807617,
      "text": " one, the only one, the Lord Jesus Christ that can give life. God, I pray that if there's"
    },
    {
      "id": 15,
      "start": 3103.9199752807617,
      "end": 3108.239974975586,
      "text": " one present this morning that's never been saved, God, I pray that you'd move and work"
    },
    {
      "id": 16,
      "start": 3108.239974975586,
      "end": 3113.55997467041,
      "text": " in their heart, Lord. Draw them to yourself. I pray the Holy Spirit of God would convince"
    },
    {
      "id": 17,
      "start": 3113.55997467041,
      "end": 3118.1599731445312,
      "text": " them of their sin of Christ's righteousness and of judgment to come. I pray that in a"
    },
    {
      "id": 18,
      "start": 3118.1599731445312,
      "end": 3121.7999725341797,
      "text": " moment of invitation, Lord, this morning that we would be doers of the word and not hearers"
    },
    {
      "id": 19,
      "start": 3121.7999725341797,
      "end": 3129.1199798583984,
      "text": " only. Help us, Lord, to make that commitment to be students of the word, to know doctrine,"
    },
    {
      "id": 20,
      "start": 3129.1199798583984,
      "end": 3135.3199768066406,
      "text": " to be settled and grounded in the faith. Well, thank you for each decision that's made. For"
    },
    {
      "id": 21,
      "start": 3135.3199768066406,
      "end": 3136.5599822998047,
      "text": " it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-15T09:58:40.413621"
}