{
  "video_id": "IMtCrSMeE_8",
  "text": "number 29 this evening, Genesis chapter number 29, and I mentioned last week as we were taking our path through the first section of Genesis 29, really looking at verses 1 through 30, and in that study we traced the steps of Jacob as he arrived to Haran, and it's interesting because we noted in verse number 1 of Genesis 29, the Bible says, then Jacob went on his journey, and I made the statement that the journey continues, and what a blessing to read about the experience that Jacob had at the end of Genesis 28, and the Lord appearing to him, and the Lord speaking to him, and his commitments to God, and setting up the altar there at Bethel, and what a blessing to read about that experience, and the impact of that experience that he had, but the journey continues, and I kind of likened it to our own lives, and how we can think about that day of our salvation when we recognized our need for Christ, and he saved our soul, and then we continue our journey, and we know that Jacob's journey ends as we read of his death later on here in the book of Genesis, and our journey, too, will end one day, but as we journey with the Lord, that we'd be mindful of the importance of keeping our eyes on him, and keeping our eyes on Jesus. Hebrews chapter number 12 says, looking unto Jesus, the author and finisher of our faith, and I'm so thankful this evening that he has provided us with instruction. Just as Jacob would deal with adversity, and hardships, and interactions with people that were kind, and people that were not so kind, and all of the things that he would deal with, we, too, have a variety of interactions that we face in life. As we wrapped up Genesis 29, the first section, verses 1-30 last week, we left off where Jacob ended the text of Scripture with two brides, Leah and Rachel, and as we think about the word of God, and we think about what God has provided us with, really, as we've studied through the book of Genesis, it's been a long time, this is message number 67, in fact, of preaching through the book of Genesis, and I've thoroughly enjoyed it, I trust that you have as well, and as we look here at these next several, really, I'm probably going to split this into two weeks of lessons of messages, but as we begin this evening looking at the sons of Jacob, we will begin to navigate through this section of Scripture, and read of how God blessed, and God built this family, and we understand there's many just discussions that take place in this passage of Scripture, and you begin to think about the carnality that's present, you think about the competition that is evidenced, and you see all of these things, but I believe that as we study through this passage of Scripture, and we trace through this passage, I believe that there's a lesson for us to learn here. I believe that as you go through and study the names, in particular, of the sons of Jacob, you will be able to note, not only through the names of the sons, but through the dialogue that is given, that there is a real conflict between Leah and Rachel, and we've mentioned in previous messages of having dysfunctional families, and looking at the dysfunctional families here in Genesis already that we've looked to, and mentioning how that in our society, still today, there are many dysfunctional families, and I'm thankful that God has given us a book that gives us instruction with regard to the home, and how a family is supposed to operate, and what God's design is for the home. But as we note, as you go through the passage of Scripture, you see the conflict, and I believe that the conflict is most easily evidenced and really traced through the names of the sons, and the significance of their names, and really the dialogue, and what takes place. And so, of course, you know that there are twelve sons, and that's why I think it's going to take us two weeks to get through it. There are twelve sons, and of course, they would become the twelve tribes of Israel, and we're mindful of that, and we understand as you begin to look at the whole of the history that God provides us with in the Old Testament, with regard to His people, the children of Israel, and you think about the tribes, and obviously you look here to the fulfillment of what God said to Abraham with regard to the promise of a seed and a land, and then of course that promise was given to Isaac, and then reiterated to Jacob as we studied in a previous message, where God had given him the instruction with regard to the blessing of a large family. As we begin reading in verse number 31 of Genesis 29, and we look at this first section or this first of two messages on the sons of Jacob, notice the Bible says this in verse 31, and when the Lord saw that Leah was hated, He opened her womb, but Rachel was barren, and Leah conceived and bare a son, and she called His name Reuben, and she said, Surely the Lord hath looked upon my affliction, now therefore my husband will love me. And she conceived again and bare a son, and said, Because the Lord hath heard that I was hated, He hath therefore given me this son also. And she called His name Simeon, and she conceived again, verse 34, and bare a son, and said, Now this time will my husband be joined unto me, because I have borne him three sons, therefore was his name called Levi. And she conceived again and bare a son, and she said, Now will I praise the Lord, therefore she called His name Judah, and left bearing. As we look at the sons of Jacob, I want you to see in verse number 32, the first of these sons is Reuben. The Bible tells us that she conceived in verse number 32, and that she bare a son, and she called his name Reuben. The name Reuben really, it carries with it the idea of this, behold a son. You think about the significance of the families and understanding in the culture, the significance of having a son, and the importance of having a son, and you find here that right at the beginning, when we find that Reuben is born, that Leah would name Reuben, behold a son. That's what the name means. And when you think about the phraseology and understanding the significance of having a son, and I want you to see what she says here in this text of Scripture, it says this in verse number 32, for she said, Surely the Lord hath looked upon my affliction. And so she was acknowledging that the Lord had looked upon her affliction. What is the affliction that she's referring to? Well, it's in verse number 31, where the Bible says that the Lord saw that Leah was hated. You'll remember that the Bible tells us of Jacob and his marriage in the previous text of Scripture, and we dealt with that two weeks ago in looking at the deception and what have you, and the Bible tells us that the Lord saw that Leah was hated, and he opened her womb, but Rachel was barren. You'll remember that the Bible told us in verse number 30 that he went also unto Rachel, and he loved also Rachel more than Leah. And so we find that Leah, in naming her first son, she uses this name, behold a son, the significance of having a son, but she also mentions that the Lord hath looked upon her affliction. Again, it gives us evidence to this conflict that was brewing between Leah and Rachel, and we'll continue to see this as we trace through the names of these sons and through this text of Scripture. And then I want you to notice the end of verse number 32. Notice what she says, now therefore my husband will love me. She had the belief, she had the expectation that because she had had a son and because she had given in her mind this son to Jacob and the significance of having a son, that this would change the dynamic in the family and that the circumstances would be more favorable for her, and now she would be loved by Jacob. You see that she has high expectations. She has full anticipation that this would be the case, and we see the significance and the confidence that she has. We note here a couple of very important truths. Number one, I would say this, understand that God sees everything. Notice what she says, she called his name Reuben. Why? Surely the Lord hath looked upon my affliction. You know that God sees everything. He knows everything, and even as she makes that statement, and even though there's some conflict and some animosity that will continue to grow and develop here between Leah and Rachel, we can rejoice in knowing that God sees everything. Sometimes we can get down and we can get discouraged and we can begin to think, no one understands, no one sees what I'm dealing with. God understands, God sees, and that ought to cause us to rejoice because it says in verse 31 that the Lord saw that Leah was hated, and we should rejoice in understanding here this evening that truth that is revealed to us. We also would note her recognition. Notice what Leah says, her recognition of Jehovah God. Notice here the Bible says that Leah conceived and bear a son, she called his name Reuben. Well, she said this, surely the Lord, it's all caps in your Bible referring to Jehovah God, and I want you to consider the fact that she says the Lord hath looked upon my affliction, and she is acknowledging, she is recognizing Jehovah God. In every event in our life, we need to recognize the hand of Almighty God. As we trace through the steps of these passages of Scripture and begin to see the birth of the sons of Jacob, we will be able to note with ease the times of carnality and the lack of recognition of God Almighty. It's extremely evident throughout the text of Scripture. And this evening when we look at... this passage and see what's taking place and we begin to observe the carnality that will brew and develop here, it's important that we recognize that there is a struggle that is taking place between walking in the Spirit as a New Testament application of walking in the Spirit and walking in the flesh. And oh, how necessary it is that we'd walk in the Spirit so that we do not fulfill the lust of the flesh. Note with me in our text of Scripture, moving on into verse number 33, the second son is born, Simeon is his name. The Bible says that she conceived again in verse number 33, and she bare a son. Notice she says, because the Lord hath heard that I was hated, he hath therefore given me this son also, and she called his name Simeon. Isn't it good to know that God sees but God hears? He sees and he hears. She says here in this text of Scripture, the Lord hath heard that I was hated, and we see that the name Simeon means hearing or heard, and she's acknowledging the fact that God had heard about her circumstances. Now, I want you to think just for a moment because she had high expectations in verse 32, did she not? She thought that because of having that first son, that it would change the dynamics and that Jacob would now love her, and that's what she desired, and that's what she wanted, but yet the Bible tells us in verse number 33, as you begin to see the progress and what's taking place, that evidently her expectations were not met. It did not pan out the way that she expected it to, and she says that the Lord hath heard that I was hated. She says this as we think about the second birth, and she says, therefore, because of this, the Lord hath given me this son. Once again, her acknowledgement of Jehovah God is evident to us, for it says, because the Lord, again in all caps, hath heard that I was hated. And she's continuing to understand and to recognize Jehovah God. Not only do we rejoice in knowing that the Lord sees, but also that the Lord hears. And these truths that are revealed to us through the first two sons of Jacob should cause us to rejoice this evening, and we should find great comfort in knowing that God sees and God hears. Verse 34, the Bible tells us that she conceived again. Here we'll see the birth of Levi, the third son of Jacob, and notice what she says, and again, there's a measure of confidence on the part of Leah. She conceived and bear a son, and now notice what she says, now this time will my husband be joined unto me, because I have born him three sons. Therefore was his name called Levi. Levi, of course, the tribe of the Levites, as we'd be familiar with and understand all of the significance of that tribe, but you look at that name Levi, and it carries with it the idea of being joined to, and you see that in the verse of Scripture, associated with or attached to. And the anticipation, the expectation of Leah was that now, because of this, now my husband will be joined unto me. You see that that's what she's longing for, that's what she's desiring. She recognizes here, but notice what she says in verse 34 at the end of the verse, because I have born him three sons. There's an obvious omission here in verse number 34 with regard to the birth of Levi, the third son. The obvious omission in the text of Scripture is that there's no recognition whatsoever of God. It's missing altogether. You begin to think in our lives of how we go through life, and there are times in which we have expectations, and sometimes our expectations aren't met. Making a little application here, we understand the context and the interpretation of what's happening in the sons of Jacob being born, and the expectation of Leah with regard to her husband, but the reality is that in life we have expectations. We have certain things that we're expecting to happen, and at times in our lives when those expectations are not met, when we're disappointed because of what we thought would happen, it can cause us to revert in our spiritual walk. It can cause us to not recognize the hand of God. It can cause us to become carnal, if you will. And we notice here in the text of Scripture that there's no reference to God, and in fact what she says is, I have born Him three sons. Now, we understand that children are an heritage of the Lord. In fact, Jacob will note that in the first couple of verses of chapter number 13. But there's an obvious change in perspective here, and we understand what Leah's dealing with. We can look at the text, and we can see just the turmoil within the family, and the conflict that's there, and we don't read much of Rachel yet, but really, as we look at the text of Scripture and we see that the Bible tells us that Rachel was loved, and Leah was not loved as much, and in fact it says that the Lord saw that she was hated, and we find that Leah is in this position where she's longing for what Rachel has. But you know what's interesting? Rachel is longing for what Leah has in chapter number 30 in the first couple of verses. And how applicable in our lives that we long for what somebody else has, and someone else is longing for what we have. And here we find that she begins to be so consumed for this longing that she's having, that now she's failing to recognize the Lord. She's in this position now where she's saying, I have born Him three sons, and there's no reference at all. She goes from referencing God as Jehovah, His proper name, the self-existent One, understanding this highest title, proper name of God, and now there's no reference, no acknowledgement whatsoever. But as we move into verse number 35, it's kind of interesting as to the dynamics and what changes, and I think it's exciting for us to look at this application and to be helped. It says in verse 35 that she conceived again and bear a son, and notice what she says, now will I praise the Lord. I like the change in perspective, right? Because in the first three sons, in the birth of Reuben, in the birth of Simeon, in the birth of Levi, she has this expectation that now because of behold a son, this firstborn, this son, that now my husband, he's going to love me and I'm going to have this relationship that I long for, and she has that expectation. She says of Levi when he's born that my husband will be joined unto me, but now at the birth of Judah, the fourth son, the Bible says that she says this, now will I praise the Lord. Again, the name is Jehovah. Jehovah. She says, therefore, she called his name Judah and left bearing. The name Judah literally means praise. You think about the change and events that's taking place, and she says this, now will I praise the Lord. Her joy and her praise would now be in the Lord. It seems as if she would no longer be focused upon the conflict with Rachel. It seems as if no longer is she's going to seek to have that joy or that satisfaction or that fulfillment in something that's changing and ever-changing, but no, my joy, my praise is going to be in the Lord Jehovah. Oh man, that's good for us because we sang tonight, yesterday, today, and forever, Jesus Christ the same. By the way, I didn't pick the song, Dean did, and I love how it just fits so perfectly. We begin to focus upon the Lord and focus upon Him being our joy. The joy of the Lord is your strength, and He is our joy. He's our peace, and we can rejoice in Him, and we find that her focus for just a moment, it's going to change, but at this particular moment in her life, her focus is upon, I'm going to praise the Lord. I'm going to praise God, and I believe that it's extremely impactful as she acknowledges again Jehovah God. Of course, we know from the tribe of Judah would come the kings of Israel. We know that it's our Lord Jesus Christ that came from the tribe of Judah, and He is King of Kings. Amen? And we can rejoice in that. We can begin to see what's happening, and so at this particular juncture in the life of Jacob and his family, and how God is giving him sons, we see that there's this situation where Leah now has born four sons, and as we move into chapter number 30, we now are given the introduction, if you will, the discussion with regard to Rachel and Jacob that takes place in these first two verses. Notice in chapter 30 and verse number one, the Bible says, and when Rachel saw that she bared Jacob no children, notice this, Rachel envied her sister. Let me tell you that envy is never a good thing. Amen? It's never a good thing, and she envied her sister, and notice what she says unto Jacob, give me children or else I die. Yeah. Jacob says, it says in verse number two, that his anger was kindled against Rachel. He said, am I in God's stead who hath withheld from thee the fruit of the womb? In other words, he's acknowledging here in this text of Scripture that the fruit of the womb is his reward. That it's beyond my ability. It is God that blesses with conception. And we acknowledge that in the Word of God. We we see that that's why life is precious. Amen. We think about the discussion in our society today with regard to when does life begin and the subject matters that are so prevalent in our society. And we believe that life matters. We believe that life has value. Why? Because life is a gift of God. And it is God that has given that life. And we understand the gift of God. The life that he gives. And we understand the value of life because of the giver of life. And to understand in an even greater significance of why life matters and why life is valuable is the very truth that the Bible tells us. That the same God that gives life. That that same God died so that we could have eternal life. Now that adds a level of value beyond anything that we can fully comprehend. Amen. And we find this evening that when Jacob is confronted by Rachel and she says give me children or else I die. He acknowledges that it's God that gives children. That the fruit of the womb is his reward. I've mentioned it a moment ago but it's important for us to know that Rachel is envying and she's desiring what Leah had. And Leah all along has been envying and desiring what Rachel had. So we find in our text of Scripture, and we'll skip a few verses and you can read those later if you'd like to, but for sake of the families that are here this evening I'll skip down to verse number six. And as you look at verse number six you see the fifth son, Dan is his name. You see the level of carnality, the fleshly behavior that has interjected itself into the text of Scripture. And Rachel said in verse number six, because it was Bilhah that had conceived and bared Jacob, this son number five, according to verse number five. And it says that Rachel said God hath judged me and hath also heard my voice and hath given me a son. Therefore called she his name Dan. The name Dan means judge or vindicator. And really as Rachel makes this declaration and following some legal legalities, if you will, that were accepted in this particular time and culture. She says God hath judged me, he hath heard me, and he hath given me a son. I believe that as you look at the name of Dan, the son of Bilhah, and see that his name means judge or vindicator, there's no doubt in my mind that really she's naming her son Dan and making sure that Leah knows all about it. Because God has vindicated me, is really her idea. And as you think about the the truth here of what's taking place, and again if we could think about the carnality and the fleshly behavior of Rachel and all that's taking place, we can begin to see how things will very quickly erode. And how that all of a sudden, where Leah at the end of chapter number 29 is focused wholly and completely on, now will I praise the Lord. And it seems as if at that point that no longer would Leah be concerned or focused with the conflict that was brewing there with Rachel, but now as Rachel will give in to some carnal, fleshly approach, all of a sudden it's going to have an impact on Leah. You know what Leah is going to do? She's going to respond in like manner. Can we not see application for our own lives? Someone treats us inappropriately, they're in the flesh, they're carnal, and we sometimes feel like that gives us a right to be in the flesh. Right? Does it not? Well they said that, so I'm gonna say this, I'm gonna give them a piece of my mind. Somebody said be careful, it might be the last piece. But the reality is that we can very quickly get into the flesh when someone else is in the flesh. We can very easily become carnally minded when we're interacting with people that are carnally minded. And here Rachel is going to become carnal and fleshly and going to a place where she's relying on some different approach to receive the reward that she desires, and it's going to have a great impact upon Leah. Judge, vindicator, son number five. I want you to notice that Rachel acknowledges God in our text of Scripture. In verse number six she says this, and Rachel said, God hath judged me. You notice that it's not Lord. It's not the all-caps Lord. It's God. It's Elohim is the name, and of course that's a name of God. It means strong one, but she's not acknowledging Him as Jehovah. At one point she will, but right now she's not. Why is she not acknowledging Him as Jehovah? Well, I can only assume there's some carnal behavior that's taking place, and therefore she's not able to be in the place where she's recognizing that He is Jehovah God. As you continue down through the text of Scripture, the Bible tells us of son number six that is born. In verse number eight it says that Rachel said, with great wrestlings have I wrestled with my sister, and I have prevailed, and she called his name Naphtali. Son number six is Naphtali. His name literally means wrestling, and I want you to think about this and what we've already hinted at throughout the message this evening with regard to this struggle and this conflict and this strife between these two sisters, between the wives of Jacob, is fully revealed to us in verse number eight of Genesis chapter number 30, because notice what she says, I have wrestled with my sister, and I have prevailed. You see the focus on the part of Rachel again as she's leaning on these fleshly and carnal way of dealing with things, we see that she's acknowledging this conflict with her sister. It's a terrible family dynamic, wouldn't you agree? It's crazy what takes place in the passage of Scripture and the family dynamic, but as we begin to note the historical truth that's given to us in the interpretation and understanding the sons of Jacob, but we make some application in our lives, we can find that we too can go to a place in our lives where we resort to some carnal fleshly approach to life. And all of a sudden we can think that my struggles and my wrestling are with some other human being, when in all reality, as we think about the spiritual warfare that we're engaged in, we have misplaced efforts on the part of Rachel, misplaced priorities. She's so desiring for this end result that she's going to employ anything that she can in order to win. I've wrestled and I've prevailed. That's what she says. Is it interesting to you in verse number 8 that there's no reference to God? Do you see it again? We noted it with Leah in verse number 34 of Genesis chapter 29, and now in Genesis 30, in verse number 8, where the son of, when Dan, the sixth, excuse me, fifth son is born, she acknowledges God as Elohim, but as the carnality continues, as that fleshly desire is revealed to us, that now when she names son number six, there's no reference to God. What a sad position to be in, isn't it? We just get so fleshly and so carnal that we're not even acknowledging God. Unfortunately, Leah has observed what has happened, what has transpired. She's heard about Dan. Vindicated. Judge. She's heard here about Naphtali. Wrestling. I've prevailed. According to verse number 35 of Genesis 29, the Bible ends with these three words in left bearing, and all of a sudden, Leah is in a position, remember she's the older sister, and she's in a position where she's not had any children, and now she's seeing Rachel in this fleshly and carnal approach, and she's observed what has transpired, and so now she would employ the same carnal approach. She goes from the height of, really, if I could call it this evening, spirituality in verse number 35, when she says, now will I praise the Lord Jehovah. I'm focused upon God Almighty, and His name shall be called Judah, praised. And she leaves that place, that height of spirituality, to get into a mud fight. Someone said this, you can't throw mud without getting your hands dirty. It's very sad if you read verse 9 and 10, and all of a sudden in our text of Scripture, we read now of sons that would be born of Jacob, employing the same approach that Rachel had previously employed, now being employed by Leah. It tells us in verse number 11 of son number 7, Leah said, a troop cometh. She called his name Gad. Gad means troop. A troop cometh, that word troop in the beginning of verse number 11, carries with it the idea, if you look at the Hebrew word of fortune, or good fortune. And so again, as I made mention throughout the beginning of our message in giving some introductory statements, I believe that through the names of the sons that you can see the fight that's taking place between the sisters. Gad, a troop, but when she says a troop cometh, this fortune or this good fortune, and no doubt this name was intended as an insult toward Rachel. It tells us that the second son of Zilpah would be born in verse number 13, his name is Asher, son number 8. We'll end here this evening, but I want you to see in verse number 13 that the Bible says this, and Leah said, happy am I, for the daughters will call me blessed. And she called his name Asher. Jacob, son number 8, the daughter, excuse me, the son of Zilpah, his name means happy. Happy. She says, happy am I. You know there's a difference between being happy and being blessed. Some have sought to give some explanation between the differences. I think the greatest definition or example that I've heard is happiness is based on our happenings. But joy and being blessed is based upon Jesus. My joy is in Him. My praise will be in Him and of Him. And we find this evening that when Asher is born, she says, happy am I. But what was it that would bring Leah a measure of happiness that she refers to? It is this, the daughters will call me blessed. She called his name Asher. Again, obvious omission in verse number 13 of Genesis 30 is that there's no reference to God. There's no reference to God. She's simply coming to this place and she's now more concerned, not about what God would think, not about God and praising Him, but she's more concerned now with what others would say about her. The daughters will call me blessed. But I'm going to find happiness in that. Isn't that sad? And we note here about her condition, about the carnal battle that is taking place, and it now reaches a pinnacle, if you will, and it's on full display of what's taking place and the measure of carnality. And again, we understand the historical context. We understand the literal interpretation. I believe that as we look at the Word of God, that it's important for us to draw application. It's important for us to look at the text of Scripture and say, listen, God could have simply told us, here are the twelve sons of Jacob. Could He not? But He provided all of this detail, some of which I've skipped this evening. But He provided all of this detail, and we get this view into the life of Jacob and his family and just all the craziness that takes place and the dysfunction that is there. But at the root of so many of those things is the carnality. The carnality. The battle between Rachel and Leah. The competition between them. Naming their sons. It's meant to be an insult against the sister. It's a sad condition. And if we're not careful as the people of God, we too can be carnal. We can operate in a realm in which God does not intend for us to operate. And we can be fleshly. And we can be carnal. How many of you know that you have the flesh? Amen? We have the flesh. You know what Paul said about the flesh? He said, I am crucified with Christ. Why? Because he understood the flesh and the battle that rages. He says that in Galatians 2 in verse number 20. You understand that Paul says of the flesh, I know that in me that is in my flesh dwelleth no good thing. We read about the conflict where he says the things that I would, I do not. The things that I would not, that I do. We read in Galatians 5 where the Bible talks about the fact that the spirit and the flesh are in unity one with the other. And the reality this evening is that if we're not careful in our lives, that we can allow other things, external factors, to impact our walk with God. To cause us to get into the flesh. You know the devil will use anything to get you into the flesh. He will. You know the devil delights in you walking in the flesh and fulfilling the lust of the flesh. But I'm thankful this evening that God Almighty told us that we can walk in the spirit. And if we walk in the spirit, we do not fulfill the lust of the flesh. We're not in competition one with another. It's not that we would go to this extreme and get into this position of carnality and fleshly living. No. That we come to the place where we keep our eyes on the Lord. And our journey with the Lord. See, I'm not going to allow external influences to impact my walk with God. I understand that there are challenges that we face. There are people that will purposefully... You ever felt like somebody was purposefully trying to get you in the flesh? Somebody knew you were a Christian? My dad uses the phraseology, they push my buttons. My mom says, I didn't think you had buttons. And if they're watching tonight, my dad says, you know what my buttons are. But the reality is this. Sometimes it seems like someone is purposefully trying to get us in the flesh. But we can have victory. We don't need to go as Leah did. From that mountaintop. When Judah is born. The fourth son. And saying, now will I praise the Lord. It seems to me that in verse number 35 of Genesis 29. She is not concerned whatsoever with what Rachel thinks. With what the daughters would say of her that she references in verse number 13. She is completely fixed upon my praise is going to be of Jehovah. And in just a period of time that passes. The behavior of her sister, the carnal fleshly behavior. Causes Leah to say something like this, two can play this game. And I'm going to employ the same carnal approach. Because I haven't handmade as well. And she ends in verse number 13. By calling his name Asher. And saying, happy am I. For the daughters will call me blessed. I hope this evening that we would not be content. With just saying, happy am I. And not be content with what somebody else would say about us. But that we'd have our attention and our focus fixed upon our God. And pleasing Him. Look at the next four sons next week. I'd tell you it's going to be a little bit more brief. But it probably won't be. I really believe that as you look at these sons of Jacob. There is rich truth for us to take away. this battle, that bruise, and we can say, God, help me, help me to walk in the Spirit so that I would not fulfill the lust of the flesh. That I'd be in a place where no external force or influence would cause me to operate at the same level. I'm gonna just set my affection on things above. I'm gonna keep my focus upon my Lord. Let's pray. Father, we love you. We thank you for loving us. How blessed we are. God, we know this evening that as we look at this passage of Scripture, that you have preserved for us, that there's lesson for us. And I pray that just in some way this evening, as we've made some application about the conflict and the carnality, that God, you would help us to walk in the Spirit. Help us to trust you, to follow you, to obey you. I pray that we would be more concerned with our praise of you than we would be of the praise that we might receive from others. Lord, I pray that you would take the message tonight and help us to be able to identify in our lives when these situations arise. And that we would be better equipped and prepared to give no place to the devil, daily to crucify our flesh and to walk in the Spirit. Would you move and work in these few moments of invitation as only you can. We'll be sure to give you the honor and glory for each decision that's made, for it's in Christ's name we pray. Would you stand with us?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.880000114440918,
      "text": " number 29 this evening, Genesis chapter number 29, and I mentioned last week as we were taking"
    },
    {
      "id": 1,
      "start": 6.880000114440918,
      "end": 12.479999542236328,
      "text": " our path through the first section of Genesis 29, really looking at verses 1 through 30,"
    },
    {
      "id": 2,
      "start": 12.479999542236328,
      "end": 17.520000457763672,
      "text": " and in that study we traced the steps of Jacob as he arrived to Haran, and it's interesting"
    },
    {
      "id": 3,
      "start": 17.520000457763672,
      "end": 23.280000686645508,
      "text": " because we noted in verse number 1 of Genesis 29, the Bible says, then Jacob went on his journey,"
    },
    {
      "id": 4,
      "start": 23.280000686645508,
      "end": 27.440000534057617,
      "text": " and I made the statement that the journey continues, and what a blessing to read about"
    },
    {
      "id": 5,
      "start": 27.440000534057617,
      "end": 33.119998931884766,
      "text": " the experience that Jacob had at the end of Genesis 28, and the Lord appearing to him,"
    },
    {
      "id": 6,
      "start": 33.119998931884766,
      "end": 39.119998931884766,
      "text": " and the Lord speaking to him, and his commitments to God, and setting up the altar there at Bethel,"
    },
    {
      "id": 7,
      "start": 39.119998931884766,
      "end": 45.439998626708984,
      "text": " and what a blessing to read about that experience, and the impact of that experience that he had,"
    },
    {
      "id": 8,
      "start": 45.439998626708984,
      "end": 49.439998626708984,
      "text": " but the journey continues, and I kind of likened it to our own lives, and how"
    },
    {
      "id": 9,
      "start": 49.439998626708984,
      "end": 54.400001525878906,
      "text": " we can think about that day of our salvation when we recognized our need for Christ,"
    },
    {
      "id": 10,
      "start": 54.400001525878906,
      "end": 61.119998931884766,
      "text": " and he saved our soul, and then we continue our journey, and we know that Jacob's journey"
    },
    {
      "id": 11,
      "start": 61.119998931884766,
      "end": 66.08000183105469,
      "text": " ends as we read of his death later on here in the book of Genesis, and our journey, too,"
    },
    {
      "id": 12,
      "start": 66.08000183105469,
      "end": 71.27999877929688,
      "text": " will end one day, but as we journey with the Lord, that we'd be mindful of the importance"
    },
    {
      "id": 13,
      "start": 71.27999877929688,
      "end": 76.80000305175781,
      "text": " of keeping our eyes on him, and keeping our eyes on Jesus. Hebrews chapter number 12 says,"
    },
    {
      "id": 14,
      "start": 76.80000305175781,
      "end": 84.16000366210938,
      "text": " looking unto Jesus, the author and finisher of our faith, and I'm so thankful this evening that"
    },
    {
      "id": 15,
      "start": 84.16000366210938,
      "end": 90.08000183105469,
      "text": " he has provided us with instruction. Just as Jacob would deal with adversity, and hardships,"
    },
    {
      "id": 16,
      "start": 90.08000183105469,
      "end": 94.87999725341797,
      "text": " and interactions with people that were kind, and people that were not so kind, and all of"
    },
    {
      "id": 17,
      "start": 94.87999725341797,
      "end": 100.0,
      "text": " the things that he would deal with, we, too, have a variety of interactions that we face in life."
    },
    {
      "id": 18,
      "start": 100.95999908447266,
      "end": 108.0,
      "text": " As we wrapped up Genesis 29, the first section, verses 1-30 last week, we left off where Jacob"
    },
    {
      "id": 19,
      "start": 108.0,
      "end": 113.68000030517578,
      "text": " ended the text of Scripture with two brides, Leah and Rachel, and as we think about the"
    },
    {
      "id": 20,
      "start": 113.68000030517578,
      "end": 117.76000213623047,
      "text": " word of God, and we think about what God has provided us with, really, as we've studied"
    },
    {
      "id": 21,
      "start": 117.76000213623047,
      "end": 122.0,
      "text": " through the book of Genesis, it's been a long time, this is message number 67, in fact, of"
    },
    {
      "id": 22,
      "start": 122.0,
      "end": 127.27999877929688,
      "text": " preaching through the book of Genesis, and I've thoroughly enjoyed it, I trust that you have as"
    },
    {
      "id": 23,
      "start": 127.27999877929688,
      "end": 132.55999755859375,
      "text": " well, and as we look here at these next several, really, I'm probably going to split this into two"
    },
    {
      "id": 24,
      "start": 132.55999755859375,
      "end": 137.52000427246094,
      "text": " weeks of lessons of messages, but as we begin this evening looking at the sons of Jacob,"
    },
    {
      "id": 25,
      "start": 137.52000427246094,
      "end": 143.1999969482422,
      "text": " we will begin to navigate through this section of Scripture, and read of how God blessed,"
    },
    {
      "id": 26,
      "start": 143.1999969482422,
      "end": 151.27999877929688,
      "text": " and God built this family, and we understand there's many just discussions that take place"
    },
    {
      "id": 27,
      "start": 151.27999877929688,
      "end": 155.52000427246094,
      "text": " in this passage of Scripture, and you begin to think about the carnality that's present,"
    },
    {
      "id": 28,
      "start": 155.52000427246094,
      "end": 160.24000549316406,
      "text": " you think about the competition that is evidenced, and you see all of these things,"
    },
    {
      "id": 29,
      "start": 160.24000549316406,
      "end": 163.9199981689453,
      "text": " but I believe that as we study through this passage of Scripture, and we trace"
    },
    {
      "id": 30,
      "start": 165.1199951171875,
      "end": 168.8800048828125,
      "text": " through this passage, I believe that there's a lesson for us to learn here."
    },
    {
      "id": 31,
      "start": 169.67999267578125,
      "end": 176.8800048828125,
      "text": " I believe that as you go through and study the names, in particular, of the sons of Jacob,"
    },
    {
      "id": 32,
      "start": 176.8800048828125,
      "end": 181.44000244140625,
      "text": " you will be able to note, not only through the names of the sons, but through the dialogue that"
    },
    {
      "id": 33,
      "start": 181.44000244140625,
      "end": 187.83999633789062,
      "text": " is given, that there is a real conflict between Leah and Rachel, and we've mentioned in previous"
    },
    {
      "id": 34,
      "start": 187.83999633789062,
      "end": 193.0399932861328,
      "text": " messages of having dysfunctional families, and looking at the dysfunctional families here in"
    },
    {
      "id": 35,
      "start": 193.0399932861328,
      "end": 198.47999572753906,
      "text": " Genesis already that we've looked to, and mentioning how that in our society, still today, there are"
    },
    {
      "id": 36,
      "start": 198.47999572753906,
      "end": 205.1199951171875,
      "text": " many dysfunctional families, and I'm thankful that God has given us a book that gives us instruction"
    },
    {
      "id": 37,
      "start": 205.1199951171875,
      "end": 209.83999633789062,
      "text": " with regard to the home, and how a family is supposed to operate, and what God's design"
    },
    {
      "id": 38,
      "start": 210.39999389648438,
      "end": 215.75999450683594,
      "text": " is for the home. But as we note, as you go through the passage of Scripture, you see the conflict,"
    },
    {
      "id": 39,
      "start": 215.75999450683594,
      "end": 221.44000244140625,
      "text": " and I believe that the conflict is most easily evidenced and really traced through the names of"
    },
    {
      "id": 40,
      "start": 221.44000244140625,
      "end": 226.32000732421875,
      "text": " the sons, and the significance of their names, and really the dialogue, and what takes place."
    },
    {
      "id": 41,
      "start": 226.32000732421875,
      "end": 231.36000061035156,
      "text": " And so, of course, you know that there are twelve sons, and that's why I think it's going to take"
    },
    {
      "id": 42,
      "start": 231.36000061035156,
      "end": 235.52000427246094,
      "text": " us two weeks to get through it. There are twelve sons, and of course, they would become the twelve"
    },
    {
      "id": 43,
      "start": 235.52000427246094,
      "end": 239.9199981689453,
      "text": " tribes of Israel, and we're mindful of that, and we understand as you begin to look at the"
    },
    {
      "id": 44,
      "start": 239.9199981689453,
      "end": 245.52000427246094,
      "text": " whole of the history that God provides us with in the Old Testament, with regard to His people,"
    },
    {
      "id": 45,
      "start": 245.52000427246094,
      "end": 249.83999633789062,
      "text": " the children of Israel, and you think about the tribes, and obviously you look here to the"
    },
    {
      "id": 46,
      "start": 249.83999633789062,
      "end": 255.83999633789062,
      "text": " fulfillment of what God said to Abraham with regard to the promise of a seed and a land,"
    },
    {
      "id": 47,
      "start": 255.83999633789062,
      "end": 261.44000244140625,
      "text": " and then of course that promise was given to Isaac, and then reiterated to Jacob as we studied"
    },
    {
      "id": 48,
      "start": 261.44000244140625,
      "end": 268.32000732421875,
      "text": " in a previous message, where God had given him the instruction with regard to the blessing of a"
    },
    {
      "id": 49,
      "start": 268.32000732421875,
      "end": 274.239990234375,
      "text": " large family. As we begin reading in verse number 31 of Genesis 29, and we look at this first section"
    },
    {
      "id": 50,
      "start": 274.239990234375,
      "end": 280.239990234375,
      "text": " or this first of two messages on the sons of Jacob, notice the Bible says this in verse 31,"
    },
    {
      "id": 51,
      "start": 280.239990234375,
      "end": 284.6400146484375,
      "text": " and when the Lord saw that Leah was hated, He opened her womb, but Rachel was barren,"
    },
    {
      "id": 52,
      "start": 285.44000244140625,
      "end": 290.3999938964844,
      "text": " and Leah conceived and bare a son, and she called His name Reuben, and she said,"
    },
    {
      "id": 53,
      "start": 290.3999938964844,
      "end": 296.0799865722656,
      "text": " Surely the Lord hath looked upon my affliction, now therefore my husband will love me. And she"
    },
    {
      "id": 54,
      "start": 296.0799865722656,
      "end": 301.0400085449219,
      "text": " conceived again and bare a son, and said, Because the Lord hath heard that I was hated, He hath"
    },
    {
      "id": 55,
      "start": 301.0400085449219,
      "end": 307.5199890136719,
      "text": " therefore given me this son also. And she called His name Simeon, and she conceived again, verse 34,"
    },
    {
      "id": 56,
      "start": 307.5199890136719,
      "end": 313.44000244140625,
      "text": " and bare a son, and said, Now this time will my husband be joined unto me, because I have"
    },
    {
      "id": 57,
      "start": 313.44000244140625,
      "end": 319.20001220703125,
      "text": " borne him three sons, therefore was his name called Levi. And she conceived again and bare a"
    },
    {
      "id": 58,
      "start": 319.20001220703125,
      "end": 326.55999755859375,
      "text": " son, and she said, Now will I praise the Lord, therefore she called His name Judah, and left"
    },
    {
      "id": 59,
      "start": 326.55999755859375,
      "end": 331.3599853515625,
      "text": " bearing. As we look at the sons of Jacob, I want you to see in verse number 32,"
    },
    {
      "id": 60,
      "start": 331.3599853515625,
      "end": 336.7200012207031,
      "text": " the first of these sons is Reuben. The Bible tells us that she conceived in verse number 32,"
    },
    {
      "id": 61,
      "start": 336.7200012207031,
      "end": 340.9599914550781,
      "text": " and that she bare a son, and she called his name Reuben. The name Reuben really,"
    },
    {
      "id": 62,
      "start": 340.9599914550781,
      "end": 347.8399963378906,
      "text": " it carries with it the idea of this, behold a son. You think about the significance of the"
    },
    {
      "id": 63,
      "start": 347.8399963378906,
      "end": 354.7200012207031,
      "text": " families and understanding in the culture, the significance of having a son, and the importance"
    },
    {
      "id": 64,
      "start": 354.7200012207031,
      "end": 361.20001220703125,
      "text": " of having a son, and you find here that right at the beginning, when we find that Reuben is born,"
    },
    {
      "id": 65,
      "start": 361.20001220703125,
      "end": 368.55999755859375,
      "text": " that Leah would name Reuben, behold a son. That's what the name means. And when you think about the"
    },
    {
      "id": 66,
      "start": 369.20001220703125,
      "end": 374.32000732421875,
      "text": " phraseology and understanding the significance of having a son, and I want you to see what she says"
    },
    {
      "id": 67,
      "start": 375.0400085449219,
      "end": 378.32000732421875,
      "text": " here in this text of Scripture, it says this in verse number 32,"
    },
    {
      "id": 68,
      "start": 379.20001220703125,
      "end": 386.1600036621094,
      "text": " for she said, Surely the Lord hath looked upon my affliction. And so she was acknowledging that the"
    },
    {
      "id": 69,
      "start": 386.1600036621094,
      "end": 390.6400146484375,
      "text": " Lord had looked upon her affliction. What is the affliction that she's referring to? Well,"
    },
    {
      "id": 70,
      "start": 390.6400146484375,
      "end": 397.5199890136719,
      "text": " it's in verse number 31, where the Bible says that the Lord saw that Leah was hated. You'll"
    },
    {
      "id": 71,
      "start": 397.5199890136719,
      "end": 403.3599853515625,
      "text": " remember that the Bible tells us of Jacob and his marriage in the previous text of Scripture,"
    },
    {
      "id": 72,
      "start": 403.3599853515625,
      "end": 408.0,
      "text": " and we dealt with that two weeks ago in looking at the deception and what have you,"
    },
    {
      "id": 73,
      "start": 408.0,
      "end": 414.9599914550781,
      "text": " and the Bible tells us that the Lord saw that Leah was hated, and he opened her womb, but Rachel was"
    },
    {
      "id": 74,
      "start": 414.9599914550781,
      "end": 419.9200134277344,
      "text": " barren. You'll remember that the Bible told us in verse number 30 that he went also unto Rachel,"
    },
    {
      "id": 75,
      "start": 419.9200134277344,
      "end": 428.32000732421875,
      "text": " and he loved also Rachel more than Leah. And so we find that Leah, in naming her first son,"
    },
    {
      "id": 76,
      "start": 428.32000732421875,
      "end": 436.0,
      "text": " she uses this name, behold a son, the significance of having a son, but she also mentions that the"
    },
    {
      "id": 77,
      "start": 436.0,
      "end": 441.5199890136719,
      "text": " Lord hath looked upon her affliction. Again, it gives us evidence to this conflict that was brewing"
    },
    {
      "id": 78,
      "start": 441.5199890136719,
      "end": 446.79998779296875,
      "text": " between Leah and Rachel, and we'll continue to see this as we trace through the names of"
    },
    {
      "id": 79,
      "start": 446.79998779296875,
      "end": 450.8800048828125,
      "text": " these sons and through this text of Scripture. And then I want you to notice the end of verse"
    },
    {
      "id": 80,
      "start": 450.8800048828125,
      "end": 458.3999938964844,
      "text": " number 32. Notice what she says, now therefore my husband will love me. She had the belief,"
    },
    {
      "id": 81,
      "start": 458.3999938964844,
      "end": 466.8800048828125,
      "text": " she had the expectation that because she had had a son and because she had given in her mind this"
    },
    {
      "id": 82,
      "start": 466.8800048828125,
      "end": 473.67999267578125,
      "text": " son to Jacob and the significance of having a son, that this would change the dynamic in the family"
    },
    {
      "id": 83,
      "start": 473.67999267578125,
      "end": 479.760009765625,
      "text": " and that the circumstances would be more favorable for her, and now she would be loved by Jacob."
    },
    {
      "id": 84,
      "start": 479.760009765625,
      "end": 485.1199951171875,
      "text": " You see that she has high expectations. She has full anticipation that this would be the case,"
    },
    {
      "id": 85,
      "start": 485.760009765625,
      "end": 492.6400146484375,
      "text": " and we see the significance and the confidence that she has. We note here a couple of very"
    },
    {
      "id": 86,
      "start": 492.6400146484375,
      "end": 497.8399963378906,
      "text": " important truths. Number one, I would say this, understand that God sees everything. Notice what"
    },
    {
      "id": 87,
      "start": 497.8399963378906,
      "end": 504.1600036621094,
      "text": " she says, she called his name Reuben. Why? Surely the Lord hath looked upon my affliction. You know"
    },
    {
      "id": 88,
      "start": 504.1600036621094,
      "end": 510.3999938964844,
      "text": " that God sees everything. He knows everything, and even as she makes that statement, and even"
    },
    {
      "id": 89,
      "start": 510.3999938964844,
      "end": 516.9600219726562,
      "text": " though there's some conflict and some animosity that will continue to grow and develop here"
    },
    {
      "id": 90,
      "start": 516.9600219726562,
      "end": 522.8800048828125,
      "text": " between Leah and Rachel, we can rejoice in knowing that God sees everything. Sometimes we can get"
    },
    {
      "id": 91,
      "start": 522.8800048828125,
      "end": 528.239990234375,
      "text": " down and we can get discouraged and we can begin to think, no one understands, no one sees what I'm"
    },
    {
      "id": 92,
      "start": 528.239990234375,
      "end": 534.7999877929688,
      "text": " dealing with. God understands, God sees, and that ought to cause us to rejoice because it says in"
    },
    {
      "id": 93,
      "start": 534.7999877929688,
      "end": 541.5999755859375,
      "text": " verse 31 that the Lord saw that Leah was hated, and we should rejoice in understanding here this"
    },
    {
      "id": 94,
      "start": 541.5999755859375,
      "end": 548.47998046875,
      "text": " evening that truth that is revealed to us. We also would note her recognition. Notice what Leah says,"
    },
    {
      "id": 95,
      "start": 548.47998046875,
      "end": 553.760009765625,
      "text": " her recognition of Jehovah God. Notice here the Bible says that Leah conceived and bear a son,"
    },
    {
      "id": 96,
      "start": 553.760009765625,
      "end": 559.9199829101562,
      "text": " she called his name Reuben. Well, she said this, surely the Lord, it's all caps in your Bible"
    },
    {
      "id": 97,
      "start": 559.9199829101562,
      "end": 564.9600219726562,
      "text": " referring to Jehovah God, and I want you to consider the fact that she says the Lord hath"
    },
    {
      "id": 98,
      "start": 564.9600219726562,
      "end": 573.8400268554688,
      "text": " looked upon my affliction, and she is acknowledging, she is recognizing Jehovah God. In every event in"
    },
    {
      "id": 99,
      "start": 573.8400268554688,
      "end": 580.239990234375,
      "text": " our life, we need to recognize the hand of Almighty God. As we trace through the steps of"
    },
    {
      "id": 100,
      "start": 580.7999877929688,
      "end": 586.7999877929688,
      "text": " these passages of Scripture and begin to see the birth of the sons of Jacob, we will be able to"
    },
    {
      "id": 101,
      "start": 586.7999877929688,
      "end": 595.5999755859375,
      "text": " note with ease the times of carnality and the lack of recognition of God Almighty. It's extremely"
    },
    {
      "id": 102,
      "start": 595.5999755859375,
      "end": 599.9199829101562,
      "text": " evident throughout the text of Scripture. And this evening when we look at..."
    },
    {
      "id": 0,
      "start": 599.9199829101562,
      "end": 605.5999827384949,
      "text": " this passage and see what's taking place and we begin to observe the carnality that will brew and"
    },
    {
      "id": 1,
      "start": 605.5999827384949,
      "end": 611.8399829864502,
      "text": " develop here, it's important that we recognize that there is a struggle that is taking place"
    },
    {
      "id": 2,
      "start": 611.8399829864502,
      "end": 617.519983291626,
      "text": " between walking in the Spirit as a New Testament application of walking in the Spirit and walking"
    },
    {
      "id": 3,
      "start": 617.519983291626,
      "end": 625.4399833679199,
      "text": " in the flesh. And oh, how necessary it is that we'd walk in the Spirit so that we do not fulfill"
    },
    {
      "id": 4,
      "start": 625.4399833679199,
      "end": 631.4399833679199,
      "text": " the lust of the flesh. Note with me in our text of Scripture, moving on into verse number 33,"
    },
    {
      "id": 5,
      "start": 631.4399833679199,
      "end": 636.0799827575684,
      "text": " the second son is born, Simeon is his name. The Bible says that she conceived again in verse"
    },
    {
      "id": 6,
      "start": 636.0799827575684,
      "end": 643.2799835205078,
      "text": " number 33, and she bare a son. Notice she says, because the Lord hath heard that I was hated,"
    },
    {
      "id": 7,
      "start": 643.2799835205078,
      "end": 650.6399841308594,
      "text": " he hath therefore given me this son also, and she called his name Simeon. Isn't it good to know that"
    },
    {
      "id": 8,
      "start": 650.6399841308594,
      "end": 657.4399833679199,
      "text": " God sees but God hears? He sees and he hears. She says here in this text of Scripture, the Lord hath"
    },
    {
      "id": 9,
      "start": 657.4399833679199,
      "end": 664.1599807739258,
      "text": " heard that I was hated, and we see that the name Simeon means hearing or heard, and she's"
    },
    {
      "id": 10,
      "start": 664.1599807739258,
      "end": 669.5199813842773,
      "text": " acknowledging the fact that God had heard about her circumstances. Now, I want you to think just"
    },
    {
      "id": 11,
      "start": 669.5199813842773,
      "end": 675.4399795532227,
      "text": " for a moment because she had high expectations in verse 32, did she not? She thought that because"
    },
    {
      "id": 12,
      "start": 675.5199813842773,
      "end": 681.1999816894531,
      "text": " of having that first son, that it would change the dynamics and that Jacob would now love her,"
    },
    {
      "id": 13,
      "start": 681.1999816894531,
      "end": 686.3199844360352,
      "text": " and that's what she desired, and that's what she wanted, but yet the Bible tells us in verse number"
    },
    {
      "id": 14,
      "start": 686.3199844360352,
      "end": 692.7199859619141,
      "text": " 33, as you begin to see the progress and what's taking place, that evidently her expectations were"
    },
    {
      "id": 15,
      "start": 692.7199859619141,
      "end": 698.5599822998047,
      "text": " not met. It did not pan out the way that she expected it to, and she says that the Lord hath"
    },
    {
      "id": 16,
      "start": 698.5599822998047,
      "end": 705.2799835205078,
      "text": " heard that I was hated. She says this as we think about the second birth, and she says,"
    },
    {
      "id": 17,
      "start": 705.2799835205078,
      "end": 712.5599822998047,
      "text": " therefore, because of this, the Lord hath given me this son. Once again, her acknowledgement of"
    },
    {
      "id": 18,
      "start": 712.5599822998047,
      "end": 720.3199844360352,
      "text": " Jehovah God is evident to us, for it says, because the Lord, again in all caps, hath heard that I was"
    },
    {
      "id": 19,
      "start": 720.3199844360352,
      "end": 729.0399780273438,
      "text": " hated. And she's continuing to understand and to recognize Jehovah God. Not only do we rejoice in"
    },
    {
      "id": 20,
      "start": 729.0399780273438,
      "end": 735.9999847412109,
      "text": " knowing that the Lord sees, but also that the Lord hears. And these truths that are revealed to us"
    },
    {
      "id": 21,
      "start": 735.9999847412109,
      "end": 741.5199890136719,
      "text": " through the first two sons of Jacob should cause us to rejoice this evening, and we should find"
    },
    {
      "id": 22,
      "start": 742.3199768066406,
      "end": 751.3599853515625,
      "text": " great comfort in knowing that God sees and God hears. Verse 34, the Bible tells us that she"
    },
    {
      "id": 23,
      "start": 751.3599853515625,
      "end": 757.9199829101562,
      "text": " conceived again. Here we'll see the birth of Levi, the third son of Jacob, and notice what she says,"
    },
    {
      "id": 24,
      "start": 757.9199829101562,
      "end": 763.0399780273438,
      "text": " and again, there's a measure of confidence on the part of Leah. She conceived and bear a son,"
    },
    {
      "id": 25,
      "start": 763.0399780273438,
      "end": 770.47998046875,
      "text": " and now notice what she says, now this time will my husband be joined unto me, because I have born"
    },
    {
      "id": 26,
      "start": 770.47998046875,
      "end": 779.2799835205078,
      "text": " him three sons. Therefore was his name called Levi. Levi, of course, the tribe of the Levites,"
    },
    {
      "id": 27,
      "start": 779.2799835205078,
      "end": 784.7199859619141,
      "text": " as we'd be familiar with and understand all of the significance of that tribe, but you look at"
    },
    {
      "id": 28,
      "start": 784.7199859619141,
      "end": 789.5199890136719,
      "text": " that name Levi, and it carries with it the idea of being joined to, and you see that in the verse"
    },
    {
      "id": 29,
      "start": 789.5199890136719,
      "end": 798.239990234375,
      "text": " of Scripture, associated with or attached to. And the anticipation, the expectation of Leah"
    },
    {
      "id": 30,
      "start": 798.239990234375,
      "end": 804.239990234375,
      "text": " was that now, because of this, now my husband will be joined unto me. You see that that's what"
    },
    {
      "id": 31,
      "start": 804.239990234375,
      "end": 810.0799865722656,
      "text": " she's longing for, that's what she's desiring. She recognizes here, but notice what she says"
    },
    {
      "id": 32,
      "start": 810.0799865722656,
      "end": 817.5999755859375,
      "text": " in verse 34 at the end of the verse, because I have born him three sons. There's an obvious"
    },
    {
      "id": 33,
      "start": 817.5999755859375,
      "end": 825.1999816894531,
      "text": " omission here in verse number 34 with regard to the birth of Levi, the third son. The obvious"
    },
    {
      "id": 34,
      "start": 825.1999816894531,
      "end": 829.9199829101562,
      "text": " omission in the text of Scripture is that there's no recognition whatsoever of God."
    },
    {
      "id": 35,
      "start": 831.1199798583984,
      "end": 838.0799865722656,
      "text": " It's missing altogether. You begin to think in our lives of how we go through life, and there"
    },
    {
      "id": 36,
      "start": 838.0799865722656,
      "end": 843.1199798583984,
      "text": " are times in which we have expectations, and sometimes our expectations aren't met."
    },
    {
      "id": 37,
      "start": 843.7599792480469,
      "end": 848.5599822998047,
      "text": " Making a little application here, we understand the context and the interpretation of what's"
    },
    {
      "id": 38,
      "start": 848.5599822998047,
      "end": 853.2799835205078,
      "text": " happening in the sons of Jacob being born, and the expectation of Leah with regard to her husband,"
    },
    {
      "id": 39,
      "start": 853.3599853515625,
      "end": 857.9199829101562,
      "text": " but the reality is that in life we have expectations. We have certain things that"
    },
    {
      "id": 40,
      "start": 857.9199829101562,
      "end": 862.7999877929688,
      "text": " we're expecting to happen, and at times in our lives when those expectations are not met,"
    },
    {
      "id": 41,
      "start": 862.7999877929688,
      "end": 868.8799743652344,
      "text": " when we're disappointed because of what we thought would happen, it can cause us to revert"
    },
    {
      "id": 42,
      "start": 868.8799743652344,
      "end": 875.7599792480469,
      "text": " in our spiritual walk. It can cause us to not recognize the hand of God. It can cause us to"
    },
    {
      "id": 43,
      "start": 875.7599792480469,
      "end": 881.5199890136719,
      "text": " become carnal, if you will. And we notice here in the text of Scripture that there's no reference"
    },
    {
      "id": 44,
      "start": 881.5199890136719,
      "end": 888.0799865722656,
      "text": " to God, and in fact what she says is, I have born Him three sons. Now, we understand that"
    },
    {
      "id": 45,
      "start": 888.719970703125,
      "end": 895.3599853515625,
      "text": " children are an heritage of the Lord. In fact, Jacob will note that in the first couple of"
    },
    {
      "id": 46,
      "start": 895.3599853515625,
      "end": 903.9999694824219,
      "text": " verses of chapter number 13. But there's an obvious change in perspective here, and we"
    },
    {
      "id": 47,
      "start": 903.9999694824219,
      "end": 909.1999816894531,
      "text": " understand what Leah's dealing with. We can look at the text, and we can see just the turmoil within"
    },
    {
      "id": 48,
      "start": 909.1999816894531,
      "end": 915.1199951171875,
      "text": " the family, and the conflict that's there, and we don't read much of Rachel yet, but really,"
    },
    {
      "id": 49,
      "start": 915.1199951171875,
      "end": 919.7599792480469,
      "text": " as we look at the text of Scripture and we see that the Bible tells us that Rachel was loved,"
    },
    {
      "id": 50,
      "start": 919.7599792480469,
      "end": 925.6799926757812,
      "text": " and Leah was not loved as much, and in fact it says that the Lord saw that she was hated,"
    },
    {
      "id": 51,
      "start": 925.6799926757812,
      "end": 930.47998046875,
      "text": " and we find that Leah is in this position where she's longing for what Rachel has."
    },
    {
      "id": 52,
      "start": 931.4399719238281,
      "end": 934.3999938964844,
      "text": " But you know what's interesting? Rachel is longing for what Leah has"
    },
    {
      "id": 53,
      "start": 934.9599914550781,
      "end": 942.3999938964844,
      "text": " in chapter number 30 in the first couple of verses. And how applicable in our lives"
    },
    {
      "id": 54,
      "start": 943.3599853515625,
      "end": 948.3199768066406,
      "text": " that we long for what somebody else has, and someone else is longing for what we have."
    },
    {
      "id": 55,
      "start": 949.9199829101562,
      "end": 955.5999755859375,
      "text": " And here we find that she begins to be so consumed for this longing that she's having,"
    },
    {
      "id": 56,
      "start": 955.5999755859375,
      "end": 962.9599914550781,
      "text": " that now she's failing to recognize the Lord. She's in this position now where she's saying,"
    },
    {
      "id": 57,
      "start": 962.9599914550781,
      "end": 968.719970703125,
      "text": " I have born Him three sons, and there's no reference at all. She goes from referencing"
    },
    {
      "id": 58,
      "start": 968.719970703125,
      "end": 976.5599975585938,
      "text": " God as Jehovah, His proper name, the self-existent One, understanding this highest title,"
    },
    {
      "id": 59,
      "start": 977.5199890136719,
      "end": 982.719970703125,
      "text": " proper name of God, and now there's no reference, no acknowledgement whatsoever."
    },
    {
      "id": 60,
      "start": 984.3199768066406,
      "end": 990.0799865722656,
      "text": " But as we move into verse number 35, it's kind of interesting as to the dynamics and what changes,"
    },
    {
      "id": 61,
      "start": 990.0799865722656,
      "end": 995.6799926757812,
      "text": " and I think it's exciting for us to look at this application and to be helped. It says in verse 35"
    },
    {
      "id": 62,
      "start": 995.6799926757812,
      "end": 1001.7599792480469,
      "text": " that she conceived again and bear a son, and notice what she says, now will I praise the Lord."
    },
    {
      "id": 63,
      "start": 1001.7599792480469,
      "end": 1009.2799682617188,
      "text": " I like the change in perspective, right? Because in the first three sons, in the birth of Reuben,"
    },
    {
      "id": 64,
      "start": 1009.2799682617188,
      "end": 1015.1999816894531,
      "text": " in the birth of Simeon, in the birth of Levi, she has this expectation that now because of"
    },
    {
      "id": 65,
      "start": 1015.1999816894531,
      "end": 1021.9999694824219,
      "text": " behold a son, this firstborn, this son, that now my husband, he's going to love me and I'm going to"
    },
    {
      "id": 66,
      "start": 1022.6399841308594,
      "end": 1028.47998046875,
      "text": " have this relationship that I long for, and she has that expectation. She says of Levi when he's"
    },
    {
      "id": 67,
      "start": 1028.47998046875,
      "end": 1034.239990234375,
      "text": " born that my husband will be joined unto me, but now at the birth of Judah, the fourth son,"
    },
    {
      "id": 68,
      "start": 1034.239990234375,
      "end": 1042.8799743652344,
      "text": " the Bible says that she says this, now will I praise the Lord. Again, the name is Jehovah."
    },
    {
      "id": 69,
      "start": 1042.8799743652344,
      "end": 1054.0799865722656,
      "text": " Jehovah. She says, therefore, she called his name Judah and left bearing. The name Judah literally means"
    },
    {
      "id": 70,
      "start": 1054.0799865722656,
      "end": 1063.2799682617188,
      "text": " praise. You think about the change and events that's taking place, and she says this, now will I"
    },
    {
      "id": 71,
      "start": 1063.2799682617188,
      "end": 1070.5599975585938,
      "text": " praise the Lord. Her joy and her praise would now be in the Lord. It seems as if she would no longer"
    },
    {
      "id": 72,
      "start": 1070.5599975585938,
      "end": 1076.6399841308594,
      "text": " be focused upon the conflict with Rachel. It seems as if no longer is she's going to seek to"
    },
    {
      "id": 73,
      "start": 1076.6399841308594,
      "end": 1082.0799865722656,
      "text": " have that joy or that satisfaction or that fulfillment in something that's changing"
    },
    {
      "id": 74,
      "start": 1082.0799865722656,
      "end": 1089.5199890136719,
      "text": " and ever-changing, but no, my joy, my praise is going to be in the Lord Jehovah. Oh man, that's good for us"
    },
    {
      "id": 75,
      "start": 1090.6399841308594,
      "end": 1098.0799865722656,
      "text": " because we sang tonight, yesterday, today, and forever, Jesus Christ the same. By the way, I didn't pick"
    },
    {
      "id": 76,
      "start": 1098.0799865722656,
      "end": 1104.3199768066406,
      "text": " the song, Dean did, and I love how it just fits so perfectly. We begin to focus upon the Lord and"
    },
    {
      "id": 77,
      "start": 1104.3199768066406,
      "end": 1110.7999877929688,
      "text": " focus upon Him being our joy. The joy of the Lord is your strength, and He is our joy. He's our peace,"
    },
    {
      "id": 78,
      "start": 1110.7999877929688,
      "end": 1117.2799682617188,
      "text": " and we can rejoice in Him, and we find that her focus for just a moment, it's going to change,"
    },
    {
      "id": 79,
      "start": 1118.0799560546875,
      "end": 1124.47998046875,
      "text": " but at this particular moment in her life, her focus is upon, I'm going to praise the Lord."
    },
    {
      "id": 80,
      "start": 1125.4400024414062,
      "end": 1133.5999755859375,
      "text": " I'm going to praise God, and I believe that it's extremely impactful as she acknowledges"
    },
    {
      "id": 81,
      "start": 1134.47998046875,
      "end": 1141.760009765625,
      "text": " again Jehovah God. Of course, we know from the tribe of Judah would come the kings of Israel."
    },
    {
      "id": 82,
      "start": 1141.760009765625,
      "end": 1147.9199829101562,
      "text": " We know that it's our Lord Jesus Christ that came from the tribe of Judah, and He is King of Kings."
    },
    {
      "id": 83,
      "start": 1147.9199829101562,
      "end": 1153.1199951171875,
      "text": " Amen? And we can rejoice in that. We can begin to see what's happening, and so at this particular"
    },
    {
      "id": 84,
      "start": 1153.2000122070312,
      "end": 1158.6399536132812,
      "text": " juncture in the life of Jacob and his family, and how God is giving him sons, we see that there's"
    },
    {
      "id": 85,
      "start": 1159.2000122070312,
      "end": 1166.9599609375,
      "text": " this situation where Leah now has born four sons, and as we move into chapter number 30, we now are"
    },
    {
      "id": 86,
      "start": 1166.9599609375,
      "end": 1173.6799926757812,
      "text": " given the introduction, if you will, the discussion with regard to Rachel and Jacob that takes place"
    },
    {
      "id": 87,
      "start": 1173.6799926757812,
      "end": 1177.760009765625,
      "text": " in these first two verses. Notice in chapter 30 and verse number one, the Bible says,"
    },
    {
      "id": 88,
      "start": 1177.760009765625,
      "end": 1186.47998046875,
      "text": " and when Rachel saw that she bared Jacob no children, notice this, Rachel envied her sister."
    },
    {
      "id": 89,
      "start": 1187.2000122070312,
      "end": 1194.719970703125,
      "text": " Let me tell you that envy is never a good thing. Amen? It's never a good thing, and she envied"
    },
    {
      "id": 90,
      "start": 1194.719970703125,
      "end": 1199.8399658203125,
      "text": " her sister, and notice what she says unto Jacob, give me children or else I die."
    },
    {
      "id": 0,
      "start": 1199.8399658203125,
      "end": 1208.5199661254883,
      "text": " Yeah. Jacob says, it says in verse number two, that his anger was kindled against"
    },
    {
      "id": 1,
      "start": 1208.5199661254883,
      "end": 1212.6799659729004,
      "text": " Rachel. He said, am I in God's stead who hath withheld from thee the fruit of the"
    },
    {
      "id": 2,
      "start": 1212.6799659729004,
      "end": 1216.559965133667,
      "text": " womb? In other words, he's acknowledging here in this text of Scripture that the"
    },
    {
      "id": 3,
      "start": 1216.559965133667,
      "end": 1222.9199657440186,
      "text": " fruit of the womb is his reward. That it's beyond my ability. It is God"
    },
    {
      "id": 4,
      "start": 1222.9199657440186,
      "end": 1228.2399654388428,
      "text": " that blesses with conception. And we acknowledge that in the Word of God. We"
    },
    {
      "id": 5,
      "start": 1228.2399654388428,
      "end": 1234.5999641418457,
      "text": " we see that that's why life is precious. Amen. We think about the discussion in"
    },
    {
      "id": 6,
      "start": 1234.5999641418457,
      "end": 1239.479965209961,
      "text": " our society today with regard to when does life begin and the subject matters"
    },
    {
      "id": 7,
      "start": 1239.479965209961,
      "end": 1243.3999671936035,
      "text": " that are so prevalent in our society. And we believe that life matters. We believe"
    },
    {
      "id": 8,
      "start": 1243.3999671936035,
      "end": 1250.2399673461914,
      "text": " that life has value. Why? Because life is a gift of God. And it is God that has"
    },
    {
      "id": 9,
      "start": 1250.2399673461914,
      "end": 1256.1199645996094,
      "text": " given that life. And we understand the gift of God. The life that he gives. And"
    },
    {
      "id": 10,
      "start": 1256.1199645996094,
      "end": 1263.9199676513672,
      "text": " we understand the value of life because of the giver of life. And to understand"
    },
    {
      "id": 11,
      "start": 1263.9199676513672,
      "end": 1269.7199630737305,
      "text": " in an even greater significance of why life matters and why life is valuable is"
    },
    {
      "id": 12,
      "start": 1269.7199630737305,
      "end": 1275.199966430664,
      "text": " the very truth that the Bible tells us. That the same God that gives life. That"
    },
    {
      "id": 13,
      "start": 1275.199966430664,
      "end": 1281.8799667358398,
      "text": " that same God died so that we could have eternal life. Now that adds a level of"
    },
    {
      "id": 14,
      "start": 1281.9999694824219,
      "end": 1288.319969177246,
      "text": " value beyond anything that we can fully comprehend. Amen. And we find this evening"
    },
    {
      "id": 15,
      "start": 1288.319969177246,
      "end": 1293.7599639892578,
      "text": " that when Jacob is confronted by Rachel and she says give me children or else I"
    },
    {
      "id": 16,
      "start": 1293.7599639892578,
      "end": 1298.7999649047852,
      "text": " die. He acknowledges that it's God that gives children. That the fruit of the"
    },
    {
      "id": 17,
      "start": 1298.7999649047852,
      "end": 1303.479965209961,
      "text": " womb is his reward. I've mentioned it a moment ago but it's important for us to"
    },
    {
      "id": 18,
      "start": 1303.479965209961,
      "end": 1309.079963684082,
      "text": " know that Rachel is envying and she's desiring what Leah had. And Leah all"
    },
    {
      "id": 19,
      "start": 1309.079963684082,
      "end": 1316.8399658203125,
      "text": " along has been envying and desiring what Rachel had. So we find in our text of"
    },
    {
      "id": 20,
      "start": 1316.8399658203125,
      "end": 1321.319969177246,
      "text": " Scripture, and we'll skip a few verses and you can read those later if you'd"
    },
    {
      "id": 21,
      "start": 1321.319969177246,
      "end": 1325.6799621582031,
      "text": " like to, but for sake of the families that are here this evening I'll skip"
    },
    {
      "id": 22,
      "start": 1325.6799621582031,
      "end": 1331.8799591064453,
      "text": " down to verse number six. And as you look at verse number six you see the fifth"
    },
    {
      "id": 23,
      "start": 1331.8799591064453,
      "end": 1341.199966430664,
      "text": " son, Dan is his name. You see the level of carnality, the fleshly behavior that"
    },
    {
      "id": 24,
      "start": 1341.199966430664,
      "end": 1347.3199615478516,
      "text": " has interjected itself into the text of Scripture. And Rachel said in verse"
    },
    {
      "id": 25,
      "start": 1347.3199615478516,
      "end": 1352.6799621582031,
      "text": " number six, because it was Bilhah that had conceived and bared Jacob, this son"
    },
    {
      "id": 26,
      "start": 1352.6799621582031,
      "end": 1356.7999725341797,
      "text": " number five, according to verse number five. And it says that Rachel said God"
    },
    {
      "id": 27,
      "start": 1356.7999725341797,
      "end": 1363.3599700927734,
      "text": " hath judged me and hath also heard my voice and hath given me a son. Therefore"
    },
    {
      "id": 28,
      "start": 1363.3599700927734,
      "end": 1373.9599609375,
      "text": " called she his name Dan. The name Dan means judge or vindicator. And really as"
    },
    {
      "id": 29,
      "start": 1373.9599609375,
      "end": 1380.2399597167969,
      "text": " Rachel makes this declaration and following some legal legalities, if you"
    },
    {
      "id": 30,
      "start": 1380.2399597167969,
      "end": 1386.1199645996094,
      "text": " will, that were accepted in this particular time and culture. She says God"
    },
    {
      "id": 31,
      "start": 1386.1199645996094,
      "end": 1391.479965209961,
      "text": " hath judged me, he hath heard me, and he hath given me a son. I believe that as"
    },
    {
      "id": 32,
      "start": 1391.479965209961,
      "end": 1397.5999603271484,
      "text": " you look at the name of Dan, the son of Bilhah, and see that his name means"
    },
    {
      "id": 33,
      "start": 1397.5999603271484,
      "end": 1402.6399688720703,
      "text": " judge or vindicator, there's no doubt in my mind that really she's naming her son"
    },
    {
      "id": 34,
      "start": 1402.6399688720703,
      "end": 1408.8399658203125,
      "text": " Dan and making sure that Leah knows all about it. Because God has vindicated me,"
    },
    {
      "id": 35,
      "start": 1408.8399658203125,
      "end": 1413.7599639892578,
      "text": " is really her idea. And as you think about the the truth here of what's"
    },
    {
      "id": 36,
      "start": 1413.7599639892578,
      "end": 1417.2799682617188,
      "text": " taking place, and again if we could think about the carnality and the"
    },
    {
      "id": 37,
      "start": 1417.2799682617188,
      "end": 1421.9999694824219,
      "text": " fleshly behavior of Rachel and all that's taking place, we can begin to see"
    },
    {
      "id": 38,
      "start": 1421.9999694824219,
      "end": 1428.7599639892578,
      "text": " how things will very quickly erode. And how that all of a sudden, where Leah"
    },
    {
      "id": 39,
      "start": 1428.7599639892578,
      "end": 1434.3599700927734,
      "text": " at the end of chapter number 29 is focused wholly and completely on, now"
    },
    {
      "id": 40,
      "start": 1434.3599700927734,
      "end": 1439.3199615478516,
      "text": " will I praise the Lord. And it seems as if at that point that no longer would"
    },
    {
      "id": 41,
      "start": 1439.3199615478516,
      "end": 1443.719970703125,
      "text": " Leah be concerned or focused with the conflict that was brewing there with"
    },
    {
      "id": 42,
      "start": 1443.719970703125,
      "end": 1450.2799682617188,
      "text": " Rachel, but now as Rachel will give in to some carnal, fleshly approach, all of a"
    },
    {
      "id": 43,
      "start": 1450.2799682617188,
      "end": 1454.199966430664,
      "text": " sudden it's going to have an impact on Leah. You know what Leah is going to do?"
    },
    {
      "id": 44,
      "start": 1454.199966430664,
      "end": 1461.9599609375,
      "text": " She's going to respond in like manner. Can we not see application for our own"
    },
    {
      "id": 45,
      "start": 1461.9599609375,
      "end": 1471.3599548339844,
      "text": " lives? Someone treats us inappropriately, they're in the flesh, they're carnal, and we"
    },
    {
      "id": 46,
      "start": 1471.3599548339844,
      "end": 1476.5999755859375,
      "text": " sometimes feel like that gives us a right to be in the flesh. Right? Does it"
    },
    {
      "id": 47,
      "start": 1476.5999755859375,
      "end": 1480.7999572753906,
      "text": " not? Well they said that, so I'm gonna say this, I'm gonna give them a piece of my"
    },
    {
      "id": 48,
      "start": 1480.7999572753906,
      "end": 1486.1599731445312,
      "text": " mind. Somebody said be careful, it might be the last piece. But the reality is"
    },
    {
      "id": 49,
      "start": 1486.1599731445312,
      "end": 1492.0399780273438,
      "text": " that we can very quickly get into the flesh when someone else is in the"
    },
    {
      "id": 50,
      "start": 1492.0399780273438,
      "end": 1497.7599792480469,
      "text": " flesh. We can very easily become carnally minded when we're interacting with"
    },
    {
      "id": 51,
      "start": 1497.7599792480469,
      "end": 1503.2799682617188,
      "text": " people that are carnally minded. And here Rachel is going to become carnal and"
    },
    {
      "id": 52,
      "start": 1503.2799682617188,
      "end": 1509.2799682617188,
      "text": " fleshly and going to a place where she's relying on some"
    },
    {
      "id": 53,
      "start": 1509.2799682617188,
      "end": 1514.7599792480469,
      "text": " different approach to receive the reward that she desires, and it's going to"
    },
    {
      "id": 54,
      "start": 1514.7599792480469,
      "end": 1523.0399780273438,
      "text": " have a great impact upon Leah. Judge, vindicator, son number five. I want you"
    },
    {
      "id": 55,
      "start": 1523.0399780273438,
      "end": 1527.47998046875,
      "text": " to notice that Rachel acknowledges God in our text of Scripture. In verse"
    },
    {
      "id": 56,
      "start": 1527.47998046875,
      "end": 1533.4399719238281,
      "text": " number six she says this, and Rachel said, God hath judged me. You notice that it's"
    },
    {
      "id": 57,
      "start": 1533.4399719238281,
      "end": 1539.4399719238281,
      "text": " not Lord. It's not the all-caps Lord. It's God. It's Elohim is the name, and of"
    },
    {
      "id": 58,
      "start": 1539.4399719238281,
      "end": 1544.3999633789062,
      "text": " course that's a name of God. It means strong one, but she's not acknowledging"
    },
    {
      "id": 59,
      "start": 1544.4399719238281,
      "end": 1551.7599792480469,
      "text": " Him as Jehovah. At one point she will, but right now she's not. Why is she not"
    },
    {
      "id": 60,
      "start": 1551.7599792480469,
      "end": 1556.719970703125,
      "text": " acknowledging Him as Jehovah? Well, I can only assume there's some carnal behavior"
    },
    {
      "id": 61,
      "start": 1556.719970703125,
      "end": 1561.1199645996094,
      "text": " that's taking place, and therefore she's not able to be in the place where she's"
    },
    {
      "id": 62,
      "start": 1561.1199645996094,
      "end": 1568.719970703125,
      "text": " recognizing that He is Jehovah God. As you continue down through the text of"
    },
    {
      "id": 63,
      "start": 1568.719970703125,
      "end": 1574.1199645996094,
      "text": " Scripture, the Bible tells us of son number six that is born. In verse number"
    },
    {
      "id": 64,
      "start": 1574.1199645996094,
      "end": 1577.5999755859375,
      "text": " eight it says that Rachel said, with great wrestlings have I wrestled with my"
    },
    {
      "id": 65,
      "start": 1577.5999755859375,
      "end": 1583.3999633789062,
      "text": " sister, and I have prevailed, and she called his name Naphtali. Son number six"
    },
    {
      "id": 66,
      "start": 1583.3999633789062,
      "end": 1588.5599670410156,
      "text": " is Naphtali. His name literally means wrestling, and I want you to think about"
    },
    {
      "id": 67,
      "start": 1588.5599670410156,
      "end": 1593.7599792480469,
      "text": " this and what we've already hinted at throughout the message this evening with"
    },
    {
      "id": 68,
      "start": 1593.7599792480469,
      "end": 1598.3999633789062,
      "text": " regard to this struggle and this conflict and this strife between these"
    },
    {
      "id": 69,
      "start": 1598.3999633789062,
      "end": 1603.7599792480469,
      "text": " two sisters, between the wives of Jacob, is fully revealed to us in verse number"
    },
    {
      "id": 70,
      "start": 1603.7599792480469,
      "end": 1608.1599731445312,
      "text": " eight of Genesis chapter number 30, because notice what she says, I have"
    },
    {
      "id": 71,
      "start": 1608.1599731445312,
      "end": 1623.5199584960938,
      "text": " wrestled with my sister, and I have prevailed. You see the focus on the part"
    },
    {
      "id": 72,
      "start": 1623.5199584960938,
      "end": 1629.5199584960938,
      "text": " of Rachel again as she's leaning on these fleshly and carnal way of dealing"
    },
    {
      "id": 73,
      "start": 1629.5199584960938,
      "end": 1634.7599792480469,
      "text": " with things, we see that she's acknowledging this conflict with her"
    },
    {
      "id": 74,
      "start": 1634.7599792480469,
      "end": 1642.2399597167969,
      "text": " sister. It's a terrible family dynamic, wouldn't you agree? It's crazy what takes"
    },
    {
      "id": 75,
      "start": 1642.2399597167969,
      "end": 1646.9999694824219,
      "text": " place in the passage of Scripture and the family dynamic, but as we begin to"
    },
    {
      "id": 76,
      "start": 1646.9999694824219,
      "end": 1650.9599609375,
      "text": " note the historical truth that's given to us in the interpretation"
    },
    {
      "id": 77,
      "start": 1650.9599609375,
      "end": 1654.6799621582031,
      "text": " and understanding the sons of Jacob, but we make some application in our lives, we"
    },
    {
      "id": 78,
      "start": 1654.6799621582031,
      "end": 1659.8799743652344,
      "text": " can find that we too can go to a place in our lives where we resort to some"
    },
    {
      "id": 79,
      "start": 1659.8799743652344,
      "end": 1666.4399719238281,
      "text": " carnal fleshly approach to life. And all of a sudden we can think that my"
    },
    {
      "id": 80,
      "start": 1666.4399719238281,
      "end": 1673.3599548339844,
      "text": " struggles and my wrestling are with some other human being, when in all reality, as"
    },
    {
      "id": 81,
      "start": 1673.3599548339844,
      "end": 1680.3599548339844,
      "text": " we think about the spiritual warfare that we're engaged in, we have misplaced"
    },
    {
      "id": 82,
      "start": 1680.3599548339844,
      "end": 1689.2799682617188,
      "text": " efforts on the part of Rachel, misplaced priorities. She's so desiring for this"
    },
    {
      "id": 83,
      "start": 1689.2799682617188,
      "end": 1697.3199768066406,
      "text": " end result that she's going to employ anything that she can in order to win."
    },
    {
      "id": 84,
      "start": 1697.3199768066406,
      "end": 1705.0199584960938,
      "text": " I've wrestled and I've prevailed. That's what she says. Is it interesting to you in"
    },
    {
      "id": 85,
      "start": 1705.0199584960938,
      "end": 1710.6199645996094,
      "text": " verse number 8 that there's no reference to God? Do you see it again? We noted it"
    },
    {
      "id": 86,
      "start": 1710.6199645996094,
      "end": 1714.6199951171875,
      "text": " with Leah in verse number 34 of Genesis chapter 29, and now in Genesis 30, in"
    },
    {
      "id": 87,
      "start": 1714.6199951171875,
      "end": 1720.219970703125,
      "text": " verse number 8, where the son of, when Dan, the sixth, excuse me, fifth son is born,"
    },
    {
      "id": 88,
      "start": 1720.219970703125,
      "end": 1726.1399536132812,
      "text": " she acknowledges God as Elohim, but as the carnality continues, as that fleshly"
    },
    {
      "id": 89,
      "start": 1726.1399536132812,
      "end": 1730.7799682617188,
      "text": " desire is revealed to us, that now when she names son number six,"
    },
    {
      "id": 90,
      "start": 1731.7799682617188,
      "end": 1743.219970703125,
      "text": " there's no reference to God. What a sad position to be in, isn't it? We just get so fleshly"
    },
    {
      "id": 91,
      "start": 1743.219970703125,
      "end": 1757.0199584960938,
      "text": " and so carnal that we're not even acknowledging God. Unfortunately, Leah has observed what"
    },
    {
      "id": 92,
      "start": 1757.0599365234375,
      "end": 1767.3399658203125,
      "text": " has happened, what has transpired. She's heard about Dan. Vindicated. Judge. She's"
    },
    {
      "id": 93,
      "start": 1767.3399658203125,
      "end": 1775.3399658203125,
      "text": " heard here about Naphtali. Wrestling. I've prevailed. According to verse number 35 of"
    },
    {
      "id": 94,
      "start": 1775.3399658203125,
      "end": 1781.5799560546875,
      "text": " Genesis 29, the Bible ends with these three words in left bearing, and all of a"
    },
    {
      "id": 95,
      "start": 1781.5799560546875,
      "end": 1785.1399536132812,
      "text": " sudden, Leah is in a position, remember she's the older sister, and she's in a"
    },
    {
      "id": 96,
      "start": 1785.1399536132812,
      "end": 1789.0999755859375,
      "text": " position where she's not had any children, and now she's seeing Rachel in"
    },
    {
      "id": 97,
      "start": 1789.0999755859375,
      "end": 1793.5399780273438,
      "text": " this fleshly and carnal approach, and she's observed what has"
    },
    {
      "id": 98,
      "start": 1793.5399780273438,
      "end": 1799.97998046875,
      "text": " transpired, and so now she would employ the same carnal approach."
    },
    {
      "id": 0,
      "start": 1799.97998046875,
      "end": 1804.1799802780151,
      "text": " She goes from the height of, really, if I could call it this evening,"
    },
    {
      "id": 1,
      "start": 1804.1799802780151,
      "end": 1807.1799802780151,
      "text": " spirituality in verse number 35, when she says,"
    },
    {
      "id": 2,
      "start": 1807.1799802780151,
      "end": 1810.2799806594849,
      "text": " now will I praise the Lord Jehovah."
    },
    {
      "id": 3,
      "start": 1810.2799806594849,
      "end": 1819.6799812316895,
      "text": " I'm focused upon God Almighty, and His name shall be called Judah, praised."
    },
    {
      "id": 4,
      "start": 1819.6799812316895,
      "end": 1829.97998046875,
      "text": " And she leaves that place, that height of spirituality, to get into a mud fight."
    },
    {
      "id": 5,
      "start": 1829.97998046875,
      "end": 1839.6799812316895,
      "text": " Someone said this, you can't throw mud without getting your hands dirty."
    },
    {
      "id": 6,
      "start": 1839.6799812316895,
      "end": 1846.1799812316895,
      "text": " It's very sad if you read verse 9 and 10,"
    },
    {
      "id": 7,
      "start": 1846.1799812316895,
      "end": 1849.1799812316895,
      "text": " and all of a sudden in our text of Scripture,"
    },
    {
      "id": 8,
      "start": 1849.1799812316895,
      "end": 1856.1799812316895,
      "text": " we read now of sons that would be born of Jacob,"
    },
    {
      "id": 9,
      "start": 1856.1799812316895,
      "end": 1861.47998046875,
      "text": " employing the same approach that Rachel had previously employed,"
    },
    {
      "id": 10,
      "start": 1861.47998046875,
      "end": 1864.7799835205078,
      "text": " now being employed by Leah."
    },
    {
      "id": 11,
      "start": 1864.7799835205078,
      "end": 1874.1799774169922,
      "text": " It tells us in verse number 11 of son number 7,"
    },
    {
      "id": 12,
      "start": 1874.1799774169922,
      "end": 1876.6799774169922,
      "text": " Leah said, a troop cometh."
    },
    {
      "id": 13,
      "start": 1876.6799774169922,
      "end": 1880.1799774169922,
      "text": " She called his name Gad."
    },
    {
      "id": 14,
      "start": 1880.1799774169922,
      "end": 1882.6799774169922,
      "text": " Gad means troop."
    },
    {
      "id": 15,
      "start": 1882.6799774169922,
      "end": 1887.1799774169922,
      "text": " A troop cometh, that word troop in the beginning of verse number 11,"
    },
    {
      "id": 16,
      "start": 1887.1799774169922,
      "end": 1892.879981994629,
      "text": " carries with it the idea, if you look at the Hebrew word of fortune, or good fortune."
    },
    {
      "id": 17,
      "start": 1892.879981994629,
      "end": 1896.879981994629,
      "text": " And so again, as I made mention throughout the beginning of our message"
    },
    {
      "id": 18,
      "start": 1896.879981994629,
      "end": 1898.879981994629,
      "text": " in giving some introductory statements,"
    },
    {
      "id": 19,
      "start": 1898.879981994629,
      "end": 1903.879981994629,
      "text": " I believe that through the names of the sons that you can see the fight that's taking place"
    },
    {
      "id": 20,
      "start": 1903.879981994629,
      "end": 1907.379981994629,
      "text": " between the sisters."
    },
    {
      "id": 21,
      "start": 1907.379981994629,
      "end": 1912.879981994629,
      "text": " Gad, a troop, but when she says a troop cometh, this fortune or this good fortune,"
    },
    {
      "id": 22,
      "start": 1912.879981994629,
      "end": 1921.379981994629,
      "text": " and no doubt this name was intended as an insult toward Rachel."
    },
    {
      "id": 23,
      "start": 1921.379981994629,
      "end": 1925.379981994629,
      "text": " It tells us that the second son of Zilpah would be born in verse number 13,"
    },
    {
      "id": 24,
      "start": 1925.379981994629,
      "end": 1930.8799743652344,
      "text": " his name is Asher, son number 8."
    },
    {
      "id": 25,
      "start": 1930.8799743652344,
      "end": 1935.8799743652344,
      "text": " We'll end here this evening, but I want you to see in verse number 13 that the Bible says this,"
    },
    {
      "id": 26,
      "start": 1935.8799743652344,
      "end": 1941.8799743652344,
      "text": " and Leah said, happy am I, for the daughters will call me blessed."
    },
    {
      "id": 27,
      "start": 1941.8799743652344,
      "end": 1945.3799743652344,
      "text": " And she called his name Asher."
    },
    {
      "id": 28,
      "start": 1945.3799743652344,
      "end": 1954.8799743652344,
      "text": " Jacob, son number 8, the daughter, excuse me, the son of Zilpah,"
    },
    {
      "id": 29,
      "start": 1954.8799743652344,
      "end": 1957.8799743652344,
      "text": " his name means happy."
    },
    {
      "id": 30,
      "start": 1957.8799743652344,
      "end": 1960.3799743652344,
      "text": " Happy."
    },
    {
      "id": 31,
      "start": 1960.3799743652344,
      "end": 1961.8799743652344,
      "text": " She says, happy am I."
    },
    {
      "id": 32,
      "start": 1961.8799743652344,
      "end": 1966.8799743652344,
      "text": " You know there's a difference between being happy and being blessed."
    },
    {
      "id": 33,
      "start": 1966.8799743652344,
      "end": 1975.3799743652344,
      "text": " Some have sought to give some explanation between the differences."
    },
    {
      "id": 34,
      "start": 1975.3799743652344,
      "end": 1982.3799743652344,
      "text": " I think the greatest definition or example that I've heard is happiness is based on our happenings."
    },
    {
      "id": 35,
      "start": 1982.3799743652344,
      "end": 1986.3799743652344,
      "text": " But joy and being blessed is based upon Jesus."
    },
    {
      "id": 36,
      "start": 1986.3799743652344,
      "end": 1988.3799743652344,
      "text": " My joy is in Him."
    },
    {
      "id": 37,
      "start": 1988.3799743652344,
      "end": 1992.3799743652344,
      "text": " My praise will be in Him and of Him."
    },
    {
      "id": 38,
      "start": 1992.3799743652344,
      "end": 2001.3799743652344,
      "text": " And we find this evening that when Asher is born, she says, happy am I."
    },
    {
      "id": 39,
      "start": 2001.3799743652344,
      "end": 2006.3799743652344,
      "text": " But what was it that would bring Leah a measure of happiness that she refers to?"
    },
    {
      "id": 40,
      "start": 2006.3799743652344,
      "end": 2012.8799743652344,
      "text": " It is this, the daughters will call me blessed."
    },
    {
      "id": 41,
      "start": 2012.8799743652344,
      "end": 2014.8799743652344,
      "text": " She called his name Asher."
    },
    {
      "id": 42,
      "start": 2014.8799743652344,
      "end": 2021.8799743652344,
      "text": " Again, obvious omission in verse number 13 of Genesis 30 is that there's no reference to God."
    },
    {
      "id": 43,
      "start": 2021.8799743652344,
      "end": 2023.8799743652344,
      "text": " There's no reference to God."
    },
    {
      "id": 44,
      "start": 2023.8799743652344,
      "end": 2028.8799743652344,
      "text": " She's simply coming to this place and she's now more concerned,"
    },
    {
      "id": 45,
      "start": 2028.8799743652344,
      "end": 2031.8799743652344,
      "text": " not about what God would think, not about God and praising Him,"
    },
    {
      "id": 46,
      "start": 2031.8799743652344,
      "end": 2038.8799743652344,
      "text": " but she's more concerned now with what others would say about her."
    },
    {
      "id": 47,
      "start": 2038.8799743652344,
      "end": 2041.8799743652344,
      "text": " The daughters will call me blessed."
    },
    {
      "id": 48,
      "start": 2041.8799743652344,
      "end": 2044.8799743652344,
      "text": " But I'm going to find happiness in that."
    },
    {
      "id": 49,
      "start": 2044.8799743652344,
      "end": 2047.8799743652344,
      "text": " Isn't that sad?"
    },
    {
      "id": 50,
      "start": 2047.8799743652344,
      "end": 2054.8799743652344,
      "text": " And we note here about her condition, about the carnal battle that is taking place,"
    },
    {
      "id": 51,
      "start": 2054.8799743652344,
      "end": 2057.8799743652344,
      "text": " and it now reaches a pinnacle, if you will,"
    },
    {
      "id": 52,
      "start": 2057.8799743652344,
      "end": 2062.8799743652344,
      "text": " and it's on full display of what's taking place and the measure of carnality."
    },
    {
      "id": 53,
      "start": 2062.8799743652344,
      "end": 2065.8799743652344,
      "text": " And again, we understand the historical context."
    },
    {
      "id": 54,
      "start": 2065.8799743652344,
      "end": 2068.8799743652344,
      "text": " We understand the literal interpretation."
    },
    {
      "id": 55,
      "start": 2068.8799743652344,
      "end": 2072.8799743652344,
      "text": " I believe that as we look at the Word of God, that it's important for us to draw application."
    },
    {
      "id": 56,
      "start": 2072.8799743652344,
      "end": 2075.8799743652344,
      "text": " It's important for us to look at the text of Scripture and say,"
    },
    {
      "id": 57,
      "start": 2075.8799743652344,
      "end": 2080.8799743652344,
      "text": " listen, God could have simply told us, here are the twelve sons of Jacob."
    },
    {
      "id": 58,
      "start": 2080.8799743652344,
      "end": 2082.8799743652344,
      "text": " Could He not?"
    },
    {
      "id": 59,
      "start": 2082.8799743652344,
      "end": 2086.8799743652344,
      "text": " But He provided all of this detail, some of which I've skipped this evening."
    },
    {
      "id": 60,
      "start": 2086.8799743652344,
      "end": 2093.8799743652344,
      "text": " But He provided all of this detail, and we get this view into the life of Jacob and his family"
    },
    {
      "id": 61,
      "start": 2093.8799743652344,
      "end": 2099.8799743652344,
      "text": " and just all the craziness that takes place and the dysfunction that is there."
    },
    {
      "id": 62,
      "start": 2099.8799743652344,
      "end": 2104.8799743652344,
      "text": " But at the root of so many of those things is the carnality."
    },
    {
      "id": 63,
      "start": 2104.8799743652344,
      "end": 2108.8799743652344,
      "text": " The carnality."
    },
    {
      "id": 64,
      "start": 2108.8799743652344,
      "end": 2112.8799743652344,
      "text": " The battle between Rachel and Leah."
    },
    {
      "id": 65,
      "start": 2112.8799743652344,
      "end": 2116.8799743652344,
      "text": " The competition between them."
    },
    {
      "id": 66,
      "start": 2116.8799743652344,
      "end": 2121.8799743652344,
      "text": " Naming their sons."
    },
    {
      "id": 67,
      "start": 2121.8799743652344,
      "end": 2126.8799743652344,
      "text": " It's meant to be an insult against the sister."
    },
    {
      "id": 68,
      "start": 2126.8799743652344,
      "end": 2128.8799743652344,
      "text": " It's a sad condition."
    },
    {
      "id": 69,
      "start": 2128.8799743652344,
      "end": 2135.8799743652344,
      "text": " And if we're not careful as the people of God, we too can be carnal."
    },
    {
      "id": 70,
      "start": 2135.8799743652344,
      "end": 2140.8799743652344,
      "text": " We can operate in a realm in which God does not intend for us to operate."
    },
    {
      "id": 71,
      "start": 2140.8799743652344,
      "end": 2142.8799743652344,
      "text": " And we can be fleshly."
    },
    {
      "id": 72,
      "start": 2142.8799743652344,
      "end": 2144.8799743652344,
      "text": " And we can be carnal."
    },
    {
      "id": 73,
      "start": 2144.8799743652344,
      "end": 2147.8799743652344,
      "text": " How many of you know that you have the flesh?"
    },
    {
      "id": 74,
      "start": 2147.8799743652344,
      "end": 2148.8799743652344,
      "text": " Amen?"
    },
    {
      "id": 75,
      "start": 2148.8799743652344,
      "end": 2150.8799743652344,
      "text": " We have the flesh."
    },
    {
      "id": 76,
      "start": 2150.8799743652344,
      "end": 2152.8799743652344,
      "text": " You know what Paul said about the flesh?"
    },
    {
      "id": 77,
      "start": 2152.8799743652344,
      "end": 2155.8799743652344,
      "text": " He said, I am crucified with Christ."
    },
    {
      "id": 78,
      "start": 2155.8799743652344,
      "end": 2156.8799743652344,
      "text": " Why?"
    },
    {
      "id": 79,
      "start": 2156.8799743652344,
      "end": 2159.8799743652344,
      "text": " Because he understood the flesh and the battle that rages."
    },
    {
      "id": 80,
      "start": 2159.8799743652344,
      "end": 2161.8799743652344,
      "text": " He says that in Galatians 2 in verse number 20."
    },
    {
      "id": 81,
      "start": 2161.8799743652344,
      "end": 2163.8799743652344,
      "text": " You understand that Paul says of the flesh,"
    },
    {
      "id": 82,
      "start": 2163.8799743652344,
      "end": 2167.8799743652344,
      "text": " I know that in me that is in my flesh dwelleth no good thing."
    },
    {
      "id": 83,
      "start": 2167.8799743652344,
      "end": 2171.8799743652344,
      "text": " We read about the conflict where he says the things that I would, I do not."
    },
    {
      "id": 84,
      "start": 2171.8799743652344,
      "end": 2174.8799743652344,
      "text": " The things that I would not, that I do."
    },
    {
      "id": 85,
      "start": 2174.8799743652344,
      "end": 2179.8799743652344,
      "text": " We read in Galatians 5 where the Bible talks about the fact that the spirit and the flesh"
    },
    {
      "id": 86,
      "start": 2179.8799743652344,
      "end": 2182.8799743652344,
      "text": " are in unity one with the other."
    },
    {
      "id": 87,
      "start": 2182.8799743652344,
      "end": 2185.8799743652344,
      "text": " And the reality this evening is that if we're not careful in our lives,"
    },
    {
      "id": 88,
      "start": 2185.8799743652344,
      "end": 2193.8799743652344,
      "text": " that we can allow other things, external factors, to impact our walk with God."
    },
    {
      "id": 89,
      "start": 2193.8799743652344,
      "end": 2198.8799743652344,
      "text": " To cause us to get into the flesh."
    },
    {
      "id": 90,
      "start": 2198.8799743652344,
      "end": 2202.8799743652344,
      "text": " You know the devil will use anything to get you into the flesh."
    },
    {
      "id": 91,
      "start": 2202.8799743652344,
      "end": 2204.8799743652344,
      "text": " He will."
    },
    {
      "id": 92,
      "start": 2204.8799743652344,
      "end": 2207.8799743652344,
      "text": " You know the devil delights in you walking in the flesh"
    },
    {
      "id": 93,
      "start": 2207.8799743652344,
      "end": 2210.8799743652344,
      "text": " and fulfilling the lust of the flesh."
    },
    {
      "id": 94,
      "start": 2210.8799743652344,
      "end": 2216.8799743652344,
      "text": " But I'm thankful this evening that God Almighty told us that we can walk in the spirit."
    },
    {
      "id": 95,
      "start": 2216.8799743652344,
      "end": 2220.8799743652344,
      "text": " And if we walk in the spirit, we do not fulfill the lust of the flesh."
    },
    {
      "id": 96,
      "start": 2220.8799743652344,
      "end": 2224.8799743652344,
      "text": " We're not in competition one with another."
    },
    {
      "id": 97,
      "start": 2224.8799743652344,
      "end": 2233.8799743652344,
      "text": " It's not that we would go to this extreme and get into this position of carnality and fleshly living."
    },
    {
      "id": 98,
      "start": 2233.8799743652344,
      "end": 2234.8799743652344,
      "text": " No."
    },
    {
      "id": 99,
      "start": 2234.8799743652344,
      "end": 2237.8799743652344,
      "text": " That we come to the place where we keep our eyes on the Lord."
    },
    {
      "id": 100,
      "start": 2237.8799743652344,
      "end": 2239.8799743652344,
      "text": " And our journey with the Lord."
    },
    {
      "id": 101,
      "start": 2239.8799743652344,
      "end": 2245.8799743652344,
      "text": " See, I'm not going to allow external influences to impact my walk with God."
    },
    {
      "id": 102,
      "start": 2245.8799743652344,
      "end": 2250.8799743652344,
      "text": " I understand that there are challenges that we face."
    },
    {
      "id": 103,
      "start": 2250.8799743652344,
      "end": 2252.8799743652344,
      "text": " There are people that will purposefully..."
    },
    {
      "id": 104,
      "start": 2252.8799743652344,
      "end": 2257.8799743652344,
      "text": " You ever felt like somebody was purposefully trying to get you in the flesh?"
    },
    {
      "id": 105,
      "start": 2257.8799743652344,
      "end": 2260.8799743652344,
      "text": " Somebody knew you were a Christian?"
    },
    {
      "id": 106,
      "start": 2260.8799743652344,
      "end": 2264.8799743652344,
      "text": " My dad uses the phraseology, they push my buttons."
    },
    {
      "id": 107,
      "start": 2264.8799743652344,
      "end": 2266.8799743652344,
      "text": " My mom says, I didn't think you had buttons."
    },
    {
      "id": 108,
      "start": 2266.8799743652344,
      "end": 2271.8799743652344,
      "text": " And if they're watching tonight, my dad says, you know what my buttons are."
    },
    {
      "id": 109,
      "start": 2271.8799743652344,
      "end": 2273.8799743652344,
      "text": " But the reality is this."
    },
    {
      "id": 110,
      "start": 2273.8799743652344,
      "end": 2280.8799743652344,
      "text": " Sometimes it seems like someone is purposefully trying to get us in the flesh."
    },
    {
      "id": 111,
      "start": 2280.8799743652344,
      "end": 2282.8799743652344,
      "text": " But we can have victory."
    },
    {
      "id": 112,
      "start": 2282.8799743652344,
      "end": 2285.8799743652344,
      "text": " We don't need to go as Leah did."
    },
    {
      "id": 113,
      "start": 2285.8799743652344,
      "end": 2288.8799743652344,
      "text": " From that mountaintop."
    },
    {
      "id": 114,
      "start": 2288.8799743652344,
      "end": 2290.8799743652344,
      "text": " When Judah is born."
    },
    {
      "id": 115,
      "start": 2290.8799743652344,
      "end": 2292.8799743652344,
      "text": " The fourth son."
    },
    {
      "id": 116,
      "start": 2292.8799743652344,
      "end": 2298.8799743652344,
      "text": " And saying, now will I praise the Lord."
    },
    {
      "id": 117,
      "start": 2298.8799743652344,
      "end": 2303.8799743652344,
      "text": " It seems to me that in verse number 35 of Genesis 29."
    },
    {
      "id": 118,
      "start": 2303.8799743652344,
      "end": 2308.8799743652344,
      "text": " She is not concerned whatsoever with what Rachel thinks."
    },
    {
      "id": 119,
      "start": 2308.8799743652344,
      "end": 2313.8800048828125,
      "text": " With what the daughters would say of her that she references in verse number 13."
    },
    {
      "id": 120,
      "start": 2313.8800048828125,
      "end": 2321.8800048828125,
      "text": " She is completely fixed upon my praise is going to be of Jehovah."
    },
    {
      "id": 121,
      "start": 2321.8800048828125,
      "end": 2326.8800048828125,
      "text": " And in just a period of time that passes."
    },
    {
      "id": 122,
      "start": 2326.8800048828125,
      "end": 2331.8800048828125,
      "text": " The behavior of her sister, the carnal fleshly behavior."
    },
    {
      "id": 123,
      "start": 2331.8800048828125,
      "end": 2337.8800048828125,
      "text": " Causes Leah to say something like this, two can play this game."
    },
    {
      "id": 124,
      "start": 2337.8800048828125,
      "end": 2342.8800048828125,
      "text": " And I'm going to employ the same carnal approach."
    },
    {
      "id": 125,
      "start": 2342.8800048828125,
      "end": 2346.8800048828125,
      "text": " Because I haven't handmade as well."
    },
    {
      "id": 126,
      "start": 2346.8800048828125,
      "end": 2350.8800048828125,
      "text": " And she ends in verse number 13."
    },
    {
      "id": 127,
      "start": 2350.8800048828125,
      "end": 2352.8800048828125,
      "text": " By calling his name Asher."
    },
    {
      "id": 128,
      "start": 2352.8800048828125,
      "end": 2355.8800048828125,
      "text": " And saying, happy am I."
    },
    {
      "id": 129,
      "start": 2355.8800048828125,
      "end": 2358.8800048828125,
      "text": " For the daughters will call me blessed."
    },
    {
      "id": 130,
      "start": 2358.8800048828125,
      "end": 2362.8800048828125,
      "text": " I hope this evening that we would not be content."
    },
    {
      "id": 131,
      "start": 2362.8800048828125,
      "end": 2366.8800048828125,
      "text": " With just saying, happy am I."
    },
    {
      "id": 132,
      "start": 2366.8800048828125,
      "end": 2373.8800048828125,
      "text": " And not be content with what somebody else would say about us."
    },
    {
      "id": 133,
      "start": 2373.8800048828125,
      "end": 2379.8800048828125,
      "text": " But that we'd have our attention and our focus fixed upon our God."
    },
    {
      "id": 134,
      "start": 2379.8800048828125,
      "end": 2381.8800048828125,
      "text": " And pleasing Him."
    },
    {
      "id": 135,
      "start": 2381.8800048828125,
      "end": 2384.8800048828125,
      "text": " Look at the next four sons next week."
    },
    {
      "id": 136,
      "start": 2384.8800048828125,
      "end": 2386.8800048828125,
      "text": " I'd tell you it's going to be a little bit more brief."
    },
    {
      "id": 137,
      "start": 2386.8800048828125,
      "end": 2389.8800048828125,
      "text": " But it probably won't be."
    },
    {
      "id": 138,
      "start": 2389.8800048828125,
      "end": 2393.8800048828125,
      "text": " I really believe that as you look at these sons of Jacob."
    },
    {
      "id": 139,
      "start": 2393.8800048828125,
      "end": 2397.8800048828125,
      "text": " There is rich truth for us to take away."
    },
    {
      "id": 0,
      "start": 2397.8800048828125,
      "end": 2399.8800048828125,
      "text": " this battle, that bruise, and we can say,"
    },
    {
      "id": 1,
      "start": 2399.8800048828125,
      "end": 2404.240005016327,
      "text": " God, help me, help me to walk in the Spirit"
    },
    {
      "id": 2,
      "start": 2404.240005016327,
      "end": 2407.2400045394897,
      "text": " so that I would not fulfill the lust of the flesh."
    },
    {
      "id": 3,
      "start": 2407.2400045394897,
      "end": 2410.2400045394897,
      "text": " That I'd be in a place where no external force"
    },
    {
      "id": 4,
      "start": 2410.2400045394897,
      "end": 2415.240005493164,
      "text": " or influence would cause me to operate at the same level."
    },
    {
      "id": 5,
      "start": 2417.8000049591064,
      "end": 2420.080005645752,
      "text": " I'm gonna just set my affection on things above."
    },
    {
      "id": 6,
      "start": 2420.080005645752,
      "end": 2423.160005569458,
      "text": " I'm gonna keep my focus upon my Lord."
    },
    {
      "id": 7,
      "start": 2423.160005569458,
      "end": 2424.000005722046,
      "text": " Let's pray."
    },
    {
      "id": 8,
      "start": 2424.000005722046,
      "end": 2425.180004119873,
      "text": " Father, we love you."
    },
    {
      "id": 9,
      "start": 2425.180004119873,
      "end": 2427.32000541687,
      "text": " We thank you for loving us."
    },
    {
      "id": 10,
      "start": 2427.32000541687,
      "end": 2428.940004348755,
      "text": " How blessed we are."
    },
    {
      "id": 11,
      "start": 2432.180004119873,
      "end": 2434.1000061035156,
      "text": " God, we know this evening that as we look"
    },
    {
      "id": 12,
      "start": 2434.1000061035156,
      "end": 2435.5000038146973,
      "text": " at this passage of Scripture,"
    },
    {
      "id": 13,
      "start": 2435.5000038146973,
      "end": 2438.8200035095215,
      "text": " that you have preserved for us,"
    },
    {
      "id": 14,
      "start": 2438.8200035095215,
      "end": 2440.6000061035156,
      "text": " that there's lesson for us."
    },
    {
      "id": 15,
      "start": 2442.5000038146973,
      "end": 2445.080005645752,
      "text": " And I pray that just in some way this evening,"
    },
    {
      "id": 16,
      "start": 2445.080005645752,
      "end": 2447.740005493164,
      "text": " as we've made some application about the conflict"
    },
    {
      "id": 17,
      "start": 2447.740005493164,
      "end": 2452.740005493164,
      "text": " and the carnality, that God, you would help us"
    },
    {
      "id": 18,
      "start": 2453.6000061035156,
      "end": 2457.2000045776367,
      "text": " to walk in the Spirit."
    },
    {
      "id": 19,
      "start": 2459.960006713867,
      "end": 2464.960006713867,
      "text": " Help us to trust you, to follow you, to obey you."
    },
    {
      "id": 20,
      "start": 2469.6600036621094,
      "end": 2472.0000076293945,
      "text": " I pray that we would be more concerned"
    },
    {
      "id": 21,
      "start": 2474.400001525879,
      "end": 2476.0800018310547,
      "text": " with our praise of you"
    },
    {
      "id": 22,
      "start": 2476.0800018310547,
      "end": 2481.0800018310547,
      "text": " than we would be of the praise"
    },
    {
      "id": 23,
      "start": 2482.1000061035156,
      "end": 2483.900001525879,
      "text": " that we might receive from others."
    },
    {
      "id": 24,
      "start": 2486.540008544922,
      "end": 2489.140007019043,
      "text": " Lord, I pray that you would take the message tonight"
    },
    {
      "id": 25,
      "start": 2490.7000045776367,
      "end": 2495.520004272461,
      "text": " and help us to be able to identify in our lives"
    },
    {
      "id": 26,
      "start": 2495.520004272461,
      "end": 2499.1000061035156,
      "text": " when these situations arise."
    },
    {
      "id": 27,
      "start": 2500.42000579834,
      "end": 2503.2600021362305,
      "text": " And that we would be better equipped and prepared"
    },
    {
      "id": 28,
      "start": 2504.0800018310547,
      "end": 2506.5600051879883,
      "text": " to give no place to the devil,"
    },
    {
      "id": 29,
      "start": 2509.6800079345703,
      "end": 2514.6800079345703,
      "text": " daily to crucify our flesh and to walk in the Spirit."
    },
    {
      "id": 30,
      "start": 2515.040008544922,
      "end": 2518.2000045776367,
      "text": " Would you move and work in these few moments of invitation"
    },
    {
      "id": 31,
      "start": 2518.2000045776367,
      "end": 2519.840003967285,
      "text": " as only you can."
    },
    {
      "id": 32,
      "start": 2519.840003967285,
      "end": 2521.4800033569336,
      "text": " We'll be sure to give you the honor and glory"
    },
    {
      "id": 33,
      "start": 2521.4800033569336,
      "end": 2522.6800079345703,
      "text": " for each decision that's made,"
    },
    {
      "id": 34,
      "start": 2522.6800079345703,
      "end": 2525.0000076293945,
      "text": " for it's in Christ's name we pray."
    },
    {
      "id": 35,
      "start": 2525.0000076293945,
      "end": 2526.1600036621094,
      "text": " Would you stand with us?"
    }
  ],
  "processed_at": "2025-04-16T15:46:30.261055"
}