{
  "video_id": "iQq15jU_zqs",
  "text": "written 39, and it's interesting that we would sing that song that we just sang about our all being on the altar, and I hope when you sing, what a privilege it is to sing, but the ministry of music, the place that music has in worship, and as we sing songs, it's not just some kind of filler, and it's an opportunity to worship the Lord and how the the Spirit of God speaks to our hearts through the words of these wonderful hymns, and I'm so thankful for the old hymns of the faith, and praise the Lord for it. Psalm 139, be looking at verses 23 and 24 this evening. I intend that the message will be a little shorter this evening, and we'll spend an extended amount of time in prayer this evening, and Psalm 139, I want to draw your attention to these two verses of Scripture. The Bible says, Search me, O God, and know my heart. Try me and know my thoughts, and see if there be any wicked way in me, and lead me in the way everlasting. Many of us are familiar with this text of Scripture. In fact, we often sing the song that is titled, Cleanse Me, and it's interesting, that song that is in our hymnal, number 57, J. Edwin Orr penned the words of that hymn in 1936, and his testimony is that he penned those words during an intense movement of the Holy Spirit at the Easter Revival Convention in New Zealand. He goes on to say, for some time it was in 1936 that the words to that song were penned, he said, for some time prior to this Easter campaign, an attitude of unusual expectancy had been prevalent among those people. Prayer meetings spread throughout the city with much fervency, and intercession led to widespread confession and reconciliation among the believers. Great numbers of unconverted students professed faith in Christ. The next night was given over to testimony with singing such as one expects in heaven. The revival news soon spread throughout all of New Zealand. Dr. Orr reports that as he was leaving New Zealand, four Aborigine girls approached and they sang a beautiful song for him. It was a Morai song of farewell, and he heard the tune of that particular song and loved the tune, and he was so impressed with the beauty of this Polynesian melody that soon afterward he wrote new verses to the tune on the back of an envelope. The text was based on the familiar words of Scripture that we just read this evening. Search me, O God, and know my heart. Try me, and know my thoughts, and see if there be any wicked way in me, and lead me in the way everlasting. If you're taking notes and you'd like a title this evening, I've simply entitled the message, Search Me, O God. As we look at this and dig right in this evening, I want you to notice with me that the psalm is a psalm that is ascribed to David, and so the sweet psalmist of Israel has been used of the Lord to write this psalm, and we see that as we note the the verses that end this psalm, I believe, number one this evening, that it was a personal plea. I'm impressed by the personal nature of what we find here in the text of Scripture, and it's important for us to understand the personal nature of these verses of Scripture, in that we are aware of the importance of us also having a personal desire, such as what is expressed by David here in this prayer. We notice the use of pronouns. In fact, in two verses of Scripture, he uses the word me four times. He uses the word me four times. That personal nature of this prayer, this plea, he says, search me, O God, and know my heart. We see the personal nature of it, and this evening, as we think about the aspect of these familiar words of Scripture, and we think about the prayer of the psalmist, and the understanding of the personal nature of what we're dealing with this evening, I would like, as I've approached the passage, and as I would seek to share some thoughts with you this evening, that we, too, would take a personal approach to the subject matter that is before us. In just a short period of time, we were planning to have a revival meeting, and what a joy to be able to have a special meeting on our calendar on an annual basis. And obviously, this year, many things have been adjusted on the calendar, and many things have been removed from the calendar, and we're not having the evangelist that we intended to have that was originally scheduled, actually, a couple of years ago. But the Lord knows, and the Lord's in control of those things, and I'm looking forward to those that will be with us. And I find this evening, this personal aspect of approaching and entering into church services regularly, or even as we have special revival meetings, that we'd understand that I'm desiring that God would work in my life, that God would search me, that God would show me, that I understand that it's important if we could figuratively, this evening, have in our minds this idea that we stand and we draw a circle around ourselves and say, God, work within the circle. Work in my life. Do something in my life. And we see the personal nature. He says, search me, O God, and know my heart. We're familiar with Jeremiah 17, but I remind you what Jeremiah records for us here in this familiar passage of Scripture. In Jeremiah 17, in verse number 9, the Bible says, the heart is deceitful above all things, and desperately wicked. Who can know it? In verse number 10 of Jeremiah 17 says, I, the Lord, search the heart. I try the reins, even to give every man according to his ways, and according to the fruit of his doings. We understand that the Bible teaches that the heart is deceitful. We understand this evening many things with regard to deceit. We understand that the enemy of the brethren is a deceiver, right? And we understand the nature of those that would try to deceive us, but the reality is that at times in our lives we can be deceived. We can deceive ourselves. Self-deception. We find here that the Lord answers the question when the verse ends, who can know it? I, the Lord, search the heart. And that's what we see here, that the plea of the psalmist, the plea of David, is search me, O God, and know my heart. Notice what he says, try me and know my thoughts. And we understand this evening the importance of bringing into captivity every thought to the obedience of Christ. We see that truth in 2nd Corinthians 10 and verse number 5, and Paul gives the admonition to those that he's writing to in Philippi, there in Philippians 4 and verse number 8, with regard to the things that were to think on. And he says, finally, brethren, what sort of things are true, what sort of things are honest, what sort of things are just, what sort of things are pure, what sort of things are lovely, what sort of things are of good report, if there be any virtue, if there be any praise, think on these things. Now, we understand this evening as we approach this passage of Scripture and we take this familiar passage of Scripture, that the psalmist is taking this personal approach. I remember, I don't know all the words to the song, but there was a little chorus that we sang with kids years ago in a junior church, children's church type of a setting. It's me, it's me, it's me, O Lord, standing in the need of prayer. I think it goes something like, not my brother, not my sister, but it's me, O Lord. And I think about that little chorus and that little song that we'd sing, and I think about the words of the psalmist here in understanding that David is saying, God, I'm interested in you searching my heart, I'm interested in you knowing my heart and trying me and knowing my thoughts. See, there's a danger that we face in not really accepting the personal nature of these particular verses of Scripture. What I mean by that is there are times in which we think that we're really praying and really hoping that God works in somebody else's heart and life, that God really shows them the error of their ways. We get kind of concerned about that. The Pharisees, they were really good at that, were they not? I'm going to read to you what the Pharisee says in Luke 18, jot it down if you will, in Luke 18 verses 10 through 12. The Bible records for us about two men that went up into the temple to pray. The Bible tells us that the one was a Pharisee and the other was a publican. The Pharisee begins to pray in verse number 11 of Luke 18, and it says, the Pharisee stood and prayed thus with himself, God I thank thee that I am not as other men are. Extortioners, unjust, adulterers, or even as this publican. I fast twice in the week, I give tithes of all that I possess. The publican, according to verse number 13, sending afar off would not lift up so much as his eyes into heaven, but smote upon his breast saying, God be merciful to me a sinner. It says this in verse 14, I tell you this man went down to his house justified rather than the other. For every one that exalteth himself shall be abased, and he that humbleth himself shall be exalted. I believe there's interesting insight to us in verse number 14 with regard to the importance of humility. What is going to lead me? What is it that led the psalmist David to say what he says in Psalm 139 verses 23 and 24, to say search me O God and know my heart, try me and know my thoughts, that personal plea. What was it? I believe that there's a level of humility, a level of humility. And there's a recognition of I'm desiring that God works in my heart, in my life. We find that Peter, if you'll recall with me at the end of the book of John, in chapter number 21 after they go fishing, and we find that the Lord shows up on the shore and he says, have you caught anything? Do you have any meat? And they say, no we've caught nothing. And Jesus tells them to cast the net and they would find and they have a great host of multitude of fish that they bring in. And Peter then after they come to the shore and they come and dine and they enjoy fellowship with the Lord, the Lord Jesus Christ begins to interact personally with Peter. Begins to ask him a series of questions. Do you love me? And we recognize those truths that are there and we find that the Lord then gives some instruction and revelation with regard to the end of Peter's life and the death that he would die. And Jesus says this, Peter follow me. You'll probably recall that John was there as well. And Peter says to the Lord Jesus Christ after he hears those words, follow me, in verse number 21 he says, well what about this guy? He says, Lord and what shall this man do? What's he concerned about? He's concerned about John, right? And Jesus says, if I will that he tarry till I come, what is that to thee? Follow thou me. Really learn about that. Learn about some personal responsibility. One day we're gonna stand before the Lord Jesus Christ. And you're not gonna stand, you're gonna stand by yourself, amen? You're gonna give an account. And we find the personal nature of this and the importance. The Bible tells us that there in Corinth there was some problems that were going on. Part of, I mean obviously there's a whole list of problems are going on in Corinth, but in 2nd Corinthians the Bible reveals to us that they were comparing themselves among themselves. And the Bible says that this is not wise. See there's a danger in us being able to look at other people and looking at how I'm maybe comparing myself among ourselves, but the standard is not some other believer. The standard is the Lord Jesus Christ and the Word of God. And so we find that the personal nature of this plea is revealed to us in the use of the pronouns and the fact that he says, search me, know my heart, try me, know my thoughts. And this evening this is a prayer that we need to pray. This is a place in which we need to get alone with the Lord and say, God we want you to search us, me personally. Yes, I want God to work collectively, but I must be careful to understand the importance of the personal nature of this plea from David here in Psalm 139 verses 23 and 24. Notice I believe not only was it personal, I believe it was passionate. I believe that David really desired for God to search him. I believe that David was passionate in his prayer. We see many things about David. There are much that we could discuss with regard to his life and we could go through a whole host of things and see some passion in the way that he rejoiced, the way that he sought the Lord. I believe here as he's praying, I believe that there's a level of passion. It's interesting to me as you read the entirety of Psalm 139 that the psalmist had an awareness of God's omniscience and omnipresence. Notice how he begins the psalm in verse number one of Psalm 139. It says, O Lord, thou hast searched me and known me. He begins the psalm with the acknowledgement of God's omniscience, that God knows everything, but yet he concludes the psalm by saying, Search me, O God, and know my heart. Try me and know my thoughts. Amen? But he starts the psalm by saying, Thou hast searched me. In understanding, knowing, recognizing the fact that our God is omniscient, you understand this evening that as we consider the prayer of David at the end of the psalm, it was not only that he had an awareness that God knew these things, but we see in this prayer, in these words, that he desired for the Lord to search him and to know him and to try him and to see if there be any wicked way in him. That desire on the part of the psalmist to say, God, I want you to search me. See, it's one thing for us to recognize that God knows everything. He does. When Adam and Eve were hiding in the garden, did God know where they were? Of course he did. When David thought that he did everything that he could within his power to cover his tracks, did God know what he had committed? Surely he did. That's why he sends Nathan and says, Thou art the man. Right? We can't hide anything from God. But there's something interesting to me about the prayer of the psalmist here, is that the knowledge of God knowing everything, but then the invitation to that all-knowing God to come and search me. See, it's one thing for a child to know that their parents have the ability to go in and to search the bedroom and to search under the bed and in the closet and wherever they want to search to be able to find whatever it is that they want to find, but it's another thing for the child to say, I invite you in to look. Do you understand the difference? See, God knows everything and He knows our hearts. He knows if there's wickedness in us. He knows our thoughts, but yet we find that the psalmist is inviting God in. He's desiring, I believe, with passion for God to do this work in his life. I think it's very encouraging to see the perspective of David and also for us to understand the importance this evening of having a similar heart attitude. How many times throughout the Gospels do we read of the interactions of the Lord Jesus Christ with those to whom he ministered, and yet Jesus would say that he knew their thoughts, and they marveled. I mean, they didn't know. How does he know what we were thinking? He knows your thoughts. He knows my thoughts, but it's a different thing when we say, Lord, we want you to search us and we want you to know and try, and that invitation that we extend, I believe that we only are going to extend that invitation when we have that measure of humility. I believe that we'll only extend that invitation when we have that process of self-examination. When we go through the process of what we read of in 1 Corinthians 11 that we often read and reference during the time of observing the Lord's Supper, and we understand that it's a table of examination, but let a man examine himself. We find that because the heart is deceitful, that we say, Lord, now we want you to search me in case I have deceived myself. I find that it's a personal plea, it's a passionate plea. I believe it's a purposed plea. There's a purpose in this plea, in this prayer, and it's exciting. Notice what he says in verse number 24, and see if there be any wicked way in me, and lead me in the way everlasting. You know what I believe the purpose is? The purpose is to be right with God. Amen? And lead me in the way everlasting. Lord, I want you to search me, I want you to try me, I want you to know me, I want you to see if there's any wicked way in me. Reveal that to me so that you then lead me in the way everlasting so that I can be right with you. The idea of nothing between my soul and my Savior. The idea of having that sweet communion with our Lord and Savior. The purpose of David praying the prayer, the purpose of the plea that we read, is that I want to be right with my Savior. I want to be right with God. God, if there's anything wicked in me. See, we look at verse number 21 and 22. It's interesting, the verses leading directly into the prayer that finishes the psalm. He says, do not I hate them, O Lord, that hate Thee, and am not I grieve with those that rise up against Thee. I hate them with perfect hatred. I count them mine enemies. Then he says, search me, O God, and know my heart. Try me and know my thoughts. See if there be any wicked way in me and lead me in the way everlasting. In the very context of what he's saying in verses 21 and 22, he's saying, but God, I want it to be a righteous thing. I don't want it to be a carnal thing. The reality this evening is that there are times in our lives when we think, well, and in fact, even as you speak with lost people and you confront them with their need for the Savior, on many occasion I've had people say, well, I've never murdered anybody. Well, I mean, that's a good thing that you never murdered anybody, right? I've never committed, and they might list something that they think is a big sin in their minds. You know, it's interesting that when the Lord in the epistles, and you can read various portions of Scripture, when He's giving instruction to His people about the importance of our walk, I think of Ephesians specifically, and you think about the latter half of the book and really dealing with chapters 4 and 5 and looking at all of the things with regard to our walk with the Lord and how we walk, how we behave. You know what He deals with? He doesn't deal with don't murder people. He doesn't deal with don't commit adultery. He doesn't deal, no, He says, tell the truth. Don't lie. He says, be angry and sin not. Right? He says, let not the sun go down upon your wrath. The things that He says in Ephesians 4 and 5, the instruction that He's given, the importance of our walk, see, sometimes we overlook some of those things in our own lives because we're so concerned about some bigger things. We fail to realize that they're causing my walk with my Savior to be hindered. And sometimes we're too busy looking at someone else and looking at someone else's problem, someone else's sin, someone else's... and if I can find someone that's doing something worse than I am, it can somehow make me feel okay. But the psalmist says, search me. Search me, O God, and know my heart. Try me and know my thoughts and see if there be any wicked way in me and lead me in the way everlasting. Why? Because I want to be right with God. I want to have that proper fellowship with God that is possible. It's going to require some humility to pray a prayer like this. It's going to help us to recognize the importance of taking that personal approach. God work in my life. As we prepare for revival, I honestly don't have many times to preach between now and then with regard to messages of preparation. We have an outdoor service on Sunday evening. We have an Awana ceremony awards on Wednesday evening a week from now. And I want to encourage you that as we prepare spiritually for this revival meeting, yes, we pray broadly, corporately, that God would work in the midst of his people. But I wonder this evening how many of us will say, as the psalmist said here in Psalm 139, God, I'm the one that needs you to work in my life. Lord, I want to be thoroughly right with you. I'm not concerned about what somebody else is doing and how somebody else is behaving and how somebody else is acting. I just, God, I want you to work in my life. You know what the beautiful thing is? If everyone takes that approach, God works amazing ways, right? But if everybody's taking the approach of, man, I hope you work in that guy's life, I hope you work in that person's life, and then we miss what God has for us. Search me, oh God. Let's pray. Father, we love you. We thank you for loving us. We thank you for this brief thought this evening. From this familiar passage of Scripture, it is my prayer tonight, personally, you'd work in my life. Lord, I pray that somehow this evening this familiar passage of Scripture has helped someone. I know that you helped me. Lord, I pray it is my desire that you'd work corporately in our midst. God, I long to have you work in my life personally. God, I repeat these words of the psalmist and desire that you would work in my life. Thank you for the privilege of prayer. We thank you for the power of prayer. And I pray as we gather here at the church house and pray together, you'd bless and work. I pray for our families that are tuned in via livestream. Oh Lord, I pray they would not hustle to some other activity, but they spend time in prayer, understanding the importance and the power of prayer. We thank you, even as we began our service this evening, that you're a God who does answer prayer. We pray that you would be honored and glorified and we'll thank you for it. In Christ's name we pray, amen. Let me share some updates with you in our prayer bulletin. I want to start first with the insert.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.360000133514404,
      "text": " written 39, and it's interesting that we would sing that song that we just sang"
    },
    {
      "id": 1,
      "start": 7.360000133514404,
      "end": 12.079999923706055,
      "text": " about our all being on the altar, and I hope when you sing, what a privilege it"
    },
    {
      "id": 2,
      "start": 12.079999923706055,
      "end": 18.84000015258789,
      "text": " is to sing, but the ministry of music, the place that music has in worship, and as"
    },
    {
      "id": 3,
      "start": 18.84000015258789,
      "end": 23.399999618530273,
      "text": " we sing songs, it's not just some kind of filler, and it's an opportunity to"
    },
    {
      "id": 4,
      "start": 23.399999618530273,
      "end": 27.920000076293945,
      "text": " worship the Lord and how the the Spirit of God speaks to our hearts through the"
    },
    {
      "id": 5,
      "start": 27.920000076293945,
      "end": 33.720001220703125,
      "text": " words of these wonderful hymns, and I'm so thankful for the old hymns of the"
    },
    {
      "id": 6,
      "start": 33.720001220703125,
      "end": 40.040000915527344,
      "text": " faith, and praise the Lord for it. Psalm 139, be looking at verses 23 and 24 this"
    },
    {
      "id": 7,
      "start": 40.040000915527344,
      "end": 44.439998626708984,
      "text": " evening. I intend that the message will be a little shorter this evening, and"
    },
    {
      "id": 8,
      "start": 44.439998626708984,
      "end": 50.119998931884766,
      "text": " we'll spend an extended amount of time in prayer this evening, and Psalm 139, I"
    },
    {
      "id": 9,
      "start": 50.119998931884766,
      "end": 53.20000076293945,
      "text": " want to draw your attention to these two verses of Scripture. The Bible says,"
    },
    {
      "id": 10,
      "start": 53.20000076293945,
      "end": 60.31999969482422,
      "text": " Search me, O God, and know my heart. Try me and know my thoughts, and see if"
    },
    {
      "id": 11,
      "start": 60.31999969482422,
      "end": 68.44000244140625,
      "text": " there be any wicked way in me, and lead me in the way everlasting. Many of us are"
    },
    {
      "id": 12,
      "start": 68.44000244140625,
      "end": 73.87999725341797,
      "text": " familiar with this text of Scripture. In fact, we often sing the song that is"
    },
    {
      "id": 13,
      "start": 73.87999725341797,
      "end": 80.16000366210938,
      "text": " titled, Cleanse Me, and it's interesting, that song that is in our hymnal, number"
    },
    {
      "id": 14,
      "start": 80.16000366210938,
      "end": 87.87999725341797,
      "text": " 57, J. Edwin Orr penned the words of that hymn in 1936, and his testimony is that"
    },
    {
      "id": 15,
      "start": 87.87999725341797,
      "end": 91.87999725341797,
      "text": " he penned those words during an intense movement of the Holy Spirit at the"
    },
    {
      "id": 16,
      "start": 91.87999725341797,
      "end": 97.5999984741211,
      "text": " Easter Revival Convention in New Zealand. He goes on to say, for some time it was"
    },
    {
      "id": 17,
      "start": 97.5999984741211,
      "end": 102.36000061035156,
      "text": " in 1936 that the words to that song were penned, he said, for some time prior to"
    },
    {
      "id": 18,
      "start": 102.36000061035156,
      "end": 107.12000274658203,
      "text": " this Easter campaign, an attitude of unusual expectancy had been prevalent"
    },
    {
      "id": 19,
      "start": 107.12000274658203,
      "end": 110.87999725341797,
      "text": " among those people. Prayer meetings spread throughout the city with much"
    },
    {
      "id": 20,
      "start": 110.87999725341797,
      "end": 116.95999908447266,
      "text": " fervency, and intercession led to widespread confession and reconciliation"
    },
    {
      "id": 21,
      "start": 116.95999908447266,
      "end": 121.83999633789062,
      "text": " among the believers. Great numbers of unconverted students professed faith in"
    },
    {
      "id": 22,
      "start": 121.83999633789062,
      "end": 127.72000122070312,
      "text": " Christ. The next night was given over to testimony with singing such as one"
    },
    {
      "id": 23,
      "start": 127.72000122070312,
      "end": 133.0399932861328,
      "text": " expects in heaven. The revival news soon spread throughout all of New Zealand. Dr."
    },
    {
      "id": 24,
      "start": 133.0399932861328,
      "end": 138.24000549316406,
      "text": " Orr reports that as he was leaving New Zealand, four Aborigine girls approached"
    },
    {
      "id": 25,
      "start": 138.24000549316406,
      "end": 143.32000732421875,
      "text": " and they sang a beautiful song for him. It was a Morai song of farewell, and he"
    },
    {
      "id": 26,
      "start": 143.32000732421875,
      "end": 149.67999267578125,
      "text": " heard the tune of that particular song and loved the tune, and he was so"
    },
    {
      "id": 27,
      "start": 149.67999267578125,
      "end": 153.55999755859375,
      "text": " impressed with the beauty of this Polynesian melody that soon afterward he"
    },
    {
      "id": 28,
      "start": 153.55999755859375,
      "end": 158.60000610351562,
      "text": " wrote new verses to the tune on the back of an envelope. The text was based on the"
    },
    {
      "id": 29,
      "start": 158.60000610351562,
      "end": 163.9600067138672,
      "text": " familiar words of Scripture that we just read this evening. Search me, O God,"
    },
    {
      "id": 30,
      "start": 163.9600067138672,
      "end": 170.44000244140625,
      "text": " and know my heart. Try me, and know my thoughts, and see if there be any wicked"
    },
    {
      "id": 31,
      "start": 170.44000244140625,
      "end": 176.1199951171875,
      "text": " way in me, and lead me in the way everlasting. If you're taking notes and"
    },
    {
      "id": 32,
      "start": 176.1199951171875,
      "end": 179.8800048828125,
      "text": " you'd like a title this evening, I've simply entitled the message, Search Me, O"
    },
    {
      "id": 33,
      "start": 179.8800048828125,
      "end": 185.0800018310547,
      "text": " God. As we look at this and dig right in this evening, I want you to notice with"
    },
    {
      "id": 34,
      "start": 185.0800018310547,
      "end": 189.67999267578125,
      "text": " me that the psalm is a psalm that is ascribed to David, and so the sweet"
    },
    {
      "id": 35,
      "start": 189.67999267578125,
      "end": 194.32000732421875,
      "text": " psalmist of Israel has been used of the Lord to write this psalm, and we see that"
    },
    {
      "id": 36,
      "start": 194.32000732421875,
      "end": 200.60000610351562,
      "text": " as we note the the verses that end this psalm, I believe, number one this evening,"
    },
    {
      "id": 37,
      "start": 200.60000610351562,
      "end": 206.1199951171875,
      "text": " that it was a personal plea. I'm impressed by the personal nature of what"
    },
    {
      "id": 38,
      "start": 206.1199951171875,
      "end": 210.44000244140625,
      "text": " we find here in the text of Scripture, and it's important for us to understand"
    },
    {
      "id": 39,
      "start": 210.52000427246094,
      "end": 215.1199951171875,
      "text": " the personal nature of these verses of Scripture, in that we are aware of the"
    },
    {
      "id": 40,
      "start": 215.1199951171875,
      "end": 221.60000610351562,
      "text": " importance of us also having a personal desire, such as what is expressed by"
    },
    {
      "id": 41,
      "start": 221.60000610351562,
      "end": 227.39999389648438,
      "text": " David here in this prayer. We notice the use of pronouns. In fact, in two"
    },
    {
      "id": 42,
      "start": 227.39999389648438,
      "end": 233.9600067138672,
      "text": " verses of Scripture, he uses the word me four times. He uses the word me four times."
    },
    {
      "id": 43,
      "start": 233.9600067138672,
      "end": 242.44000244140625,
      "text": " That personal nature of this prayer, this plea, he says, search me, O God, and"
    },
    {
      "id": 44,
      "start": 242.44000244140625,
      "end": 250.1999969482422,
      "text": " know my heart. We see the personal nature of it, and this evening, as we think about"
    },
    {
      "id": 45,
      "start": 250.1999969482422,
      "end": 255.39999389648438,
      "text": " the aspect of these familiar words of Scripture, and we think about the"
    },
    {
      "id": 46,
      "start": 255.39999389648438,
      "end": 260.4800109863281,
      "text": " prayer of the psalmist, and the understanding of the personal nature of"
    },
    {
      "id": 47,
      "start": 260.4800109863281,
      "end": 264.3599853515625,
      "text": " what we're dealing with this evening, I would like, as I've approached the"
    },
    {
      "id": 48,
      "start": 264.3599853515625,
      "end": 268.6400146484375,
      "text": " passage, and as I would seek to share some thoughts with you this evening, that"
    },
    {
      "id": 49,
      "start": 268.6400146484375,
      "end": 273.55999755859375,
      "text": " we, too, would take a personal approach to the subject matter that is before us. In"
    },
    {
      "id": 50,
      "start": 273.55999755859375,
      "end": 277.4800109863281,
      "text": " just a short period of time, we were planning to have a revival meeting, and"
    },
    {
      "id": 51,
      "start": 277.4800109863281,
      "end": 282.9200134277344,
      "text": " what a joy to be able to have a special meeting on our calendar on an annual"
    },
    {
      "id": 52,
      "start": 282.9200134277344,
      "end": 287.760009765625,
      "text": " basis. And obviously, this year, many things have been adjusted on the calendar,"
    },
    {
      "id": 53,
      "start": 287.760009765625,
      "end": 293.44000244140625,
      "text": " and many things have been removed from the calendar, and we're not having the"
    },
    {
      "id": 54,
      "start": 293.44000244140625,
      "end": 297.3599853515625,
      "text": " evangelist that we intended to have that was originally scheduled, actually, a"
    },
    {
      "id": 55,
      "start": 297.3599853515625,
      "end": 301.44000244140625,
      "text": " couple of years ago. But the Lord knows, and the Lord's in control of those"
    },
    {
      "id": 56,
      "start": 301.44000244140625,
      "end": 305.5199890136719,
      "text": " things, and I'm looking forward to those that will be with us. And I find this"
    },
    {
      "id": 57,
      "start": 305.5199890136719,
      "end": 311.8800048828125,
      "text": " evening, this personal aspect of approaching and entering into church"
    },
    {
      "id": 58,
      "start": 311.8800048828125,
      "end": 316.8399963378906,
      "text": " services regularly, or even as we have special revival meetings, that we'd"
    },
    {
      "id": 59,
      "start": 316.8399963378906,
      "end": 321.44000244140625,
      "text": " understand that I'm desiring that God would work in my life, that God would"
    },
    {
      "id": 60,
      "start": 321.44000244140625,
      "end": 326.1199951171875,
      "text": " search me, that God would show me, that I understand that it's important if we"
    },
    {
      "id": 61,
      "start": 326.1199951171875,
      "end": 331.3599853515625,
      "text": " could figuratively, this evening, have in our minds this idea that we stand and we"
    },
    {
      "id": 62,
      "start": 331.3599853515625,
      "end": 336.9200134277344,
      "text": " draw a circle around ourselves and say, God, work within the circle. Work in my"
    },
    {
      "id": 63,
      "start": 336.9200134277344,
      "end": 342.4800109863281,
      "text": " life. Do something in my life. And we see the personal nature. He says, search me, O"
    },
    {
      "id": 64,
      "start": 342.4800109863281,
      "end": 350.0,
      "text": " God, and know my heart. We're familiar with Jeremiah 17, but I remind you what"
    },
    {
      "id": 65,
      "start": 350.0,
      "end": 354.9200134277344,
      "text": " Jeremiah records for us here in this familiar passage of Scripture. In"
    },
    {
      "id": 66,
      "start": 354.9200134277344,
      "end": 360.3599853515625,
      "text": " Jeremiah 17, in verse number 9, the Bible says, the heart is deceitful above all"
    },
    {
      "id": 67,
      "start": 360.3599853515625,
      "end": 368.4800109863281,
      "text": " things, and desperately wicked. Who can know it? In verse number 10 of Jeremiah"
    },
    {
      "id": 68,
      "start": 368.5199890136719,
      "end": 376.8800048828125,
      "text": " 17 says, I, the Lord, search the heart. I try the reins, even to give every man"
    },
    {
      "id": 69,
      "start": 376.8800048828125,
      "end": 384.55999755859375,
      "text": " according to his ways, and according to the fruit of his doings. We understand"
    },
    {
      "id": 70,
      "start": 384.55999755859375,
      "end": 388.9599914550781,
      "text": " that the Bible teaches that the heart is deceitful. We understand this evening"
    },
    {
      "id": 71,
      "start": 388.9599914550781,
      "end": 393.8800048828125,
      "text": " many things with regard to deceit. We understand that the enemy of the"
    },
    {
      "id": 72,
      "start": 393.8800048828125,
      "end": 398.760009765625,
      "text": " brethren is a deceiver, right? And we understand the nature of those that"
    },
    {
      "id": 73,
      "start": 398.760009765625,
      "end": 402.7200012207031,
      "text": " would try to deceive us, but the reality is that at times in our lives we can be"
    },
    {
      "id": 74,
      "start": 402.7200012207031,
      "end": 409.20001220703125,
      "text": " deceived. We can deceive ourselves. Self-deception. We find here that the"
    },
    {
      "id": 75,
      "start": 409.20001220703125,
      "end": 415.4800109863281,
      "text": " Lord answers the question when the verse ends, who can know it? I, the Lord,"
    },
    {
      "id": 76,
      "start": 415.4800109863281,
      "end": 420.5199890136719,
      "text": " search the heart. And that's what we see here, that the plea of the psalmist, the"
    },
    {
      "id": 77,
      "start": 420.5199890136719,
      "end": 431.20001220703125,
      "text": " plea of David, is search me, O God, and know my heart. Notice what he says, try me"
    },
    {
      "id": 78,
      "start": 431.20001220703125,
      "end": 441.44000244140625,
      "text": " and know my thoughts. And we understand this evening the importance of bringing"
    },
    {
      "id": 79,
      "start": 441.44000244140625,
      "end": 445.6000061035156,
      "text": " into captivity every thought to the obedience of Christ. We see that truth in"
    },
    {
      "id": 80,
      "start": 445.6000061035156,
      "end": 450.4800109863281,
      "text": " 2nd Corinthians 10 and verse number 5, and Paul gives the admonition to those"
    },
    {
      "id": 81,
      "start": 450.4800109863281,
      "end": 455.0400085449219,
      "text": " that he's writing to in Philippi, there in Philippians 4 and verse number 8, with"
    },
    {
      "id": 82,
      "start": 455.0400085449219,
      "end": 459.239990234375,
      "text": " regard to the things that were to think on. And he says, finally, brethren, what"
    },
    {
      "id": 83,
      "start": 459.239990234375,
      "end": 461.9200134277344,
      "text": " sort of things are true, what sort of things are honest, what sort of things are just,"
    },
    {
      "id": 84,
      "start": 461.9200134277344,
      "end": 465.0799865722656,
      "text": " what sort of things are pure, what sort of things are lovely, what sort of things are"
    },
    {
      "id": 85,
      "start": 465.0799865722656,
      "end": 470.7200012207031,
      "text": " of good report, if there be any virtue, if there be any praise, think on these things."
    },
    {
      "id": 86,
      "start": 470.7200012207031,
      "end": 475.9599914550781,
      "text": " Now, we understand this evening as we approach this passage of Scripture and"
    },
    {
      "id": 87,
      "start": 475.9599914550781,
      "end": 481.2799987792969,
      "text": " we take this familiar passage of Scripture, that the psalmist is taking"
    },
    {
      "id": 88,
      "start": 481.2799987792969,
      "end": 485.2799987792969,
      "text": " this personal approach. I remember, I don't know all the words to the song, but"
    },
    {
      "id": 89,
      "start": 485.2799987792969,
      "end": 490.5199890136719,
      "text": " there was a little chorus that we sang with kids years ago in a junior church,"
    },
    {
      "id": 90,
      "start": 490.5199890136719,
      "end": 496.5199890136719,
      "text": " children's church type of a setting. It's me, it's me, it's me, O Lord, standing in"
    },
    {
      "id": 91,
      "start": 496.5199890136719,
      "end": 500.8399963378906,
      "text": " the need of prayer. I think it goes something like, not my brother, not my"
    },
    {
      "id": 92,
      "start": 500.8800048828125,
      "end": 506.239990234375,
      "text": " sister, but it's me, O Lord. And I think about that little chorus and that little"
    },
    {
      "id": 93,
      "start": 506.239990234375,
      "end": 510.2799987792969,
      "text": " song that we'd sing, and I think about the words of the psalmist here in"
    },
    {
      "id": 94,
      "start": 510.2799987792969,
      "end": 515.4400024414062,
      "text": " understanding that David is saying, God, I'm interested in you searching my heart,"
    },
    {
      "id": 95,
      "start": 515.4400024414062,
      "end": 522.4000244140625,
      "text": " I'm interested in you knowing my heart and trying me and knowing my thoughts."
    },
    {
      "id": 96,
      "start": 522.4000244140625,
      "end": 530.4000244140625,
      "text": " See, there's a danger that we face in not really accepting the personal nature of"
    },
    {
      "id": 97,
      "start": 530.4000244140625,
      "end": 535.4000244140625,
      "text": " these particular verses of Scripture. What I mean by that is there are times"
    },
    {
      "id": 98,
      "start": 535.4000244140625,
      "end": 539.6799926757812,
      "text": " in which we think that we're really praying and really hoping that God works"
    },
    {
      "id": 99,
      "start": 539.6799926757812,
      "end": 543.4000244140625,
      "text": " in somebody else's heart and life, that God really shows them the error of their"
    },
    {
      "id": 100,
      "start": 543.4000244140625,
      "end": 550.760009765625,
      "text": " ways. We get kind of concerned about that. The Pharisees, they were really good at"
    },
    {
      "id": 101,
      "start": 550.760009765625,
      "end": 555.8800048828125,
      "text": " that, were they not? I'm going to read to you what the Pharisee says in Luke 18,"
    },
    {
      "id": 102,
      "start": 555.8800048828125,
      "end": 561.6799926757812,
      "text": " jot it down if you will, in Luke 18 verses 10 through 12. The Bible records"
    },
    {
      "id": 103,
      "start": 561.6799926757812,
      "end": 566.52001953125,
      "text": " for us about two men that went up into the temple to pray. The Bible tells us"
    },
    {
      "id": 104,
      "start": 566.52001953125,
      "end": 572.3200073242188,
      "text": " that the one was a Pharisee and the other was a publican. The Pharisee begins"
    },
    {
      "id": 105,
      "start": 572.3200073242188,
      "end": 578.2000122070312,
      "text": " to pray in verse number 11 of Luke 18, and it says, the Pharisee stood and prayed"
    },
    {
      "id": 106,
      "start": 578.2000122070312,
      "end": 585.52001953125,
      "text": " thus with himself, God I thank thee that I am not as other men are. Extortioners,"
    },
    {
      "id": 107,
      "start": 585.760009765625,
      "end": 596.1199951171875,
      "text": " unjust, adulterers, or even as this publican. I fast twice in the week, I give tithes"
    },
    {
      "id": 108,
      "start": 596.1199951171875,
      "end": 601.52001953125,
      "text": " of all that I possess. The publican, according to verse number 13, sending afar"
    },
    {
      "id": 109,
      "start": 601.52001953125,
      "end": 605.719970703125,
      "text": " off would not lift up so much as his eyes into heaven, but smote upon his"
    },
    {
      "id": 110,
      "start": 605.719970703125,
      "end": 613.3200073242188,
      "text": " breast saying, God be merciful to me a sinner. It says this in verse 14, I tell you"
    },
    {
      "id": 111,
      "start": 613.3200073242188,
      "end": 618.0800170898438,
      "text": " this man went down to his house justified rather than the other. For"
    },
    {
      "id": 112,
      "start": 618.0800170898438,
      "end": 622.2000122070312,
      "text": " every one that exalteth himself shall be abased, and he that humbleth himself"
    },
    {
      "id": 113,
      "start": 622.2000122070312,
      "end": 626.760009765625,
      "text": " shall be exalted. I believe there's interesting insight to us in verse"
    },
    {
      "id": 114,
      "start": 626.760009765625,
      "end": 632.1199951171875,
      "text": " number 14 with regard to the importance of humility. What is going to lead me?"
    },
    {
      "id": 115,
      "start": 632.1199951171875,
      "end": 638.239990234375,
      "text": " What is it that led the psalmist David to say what he says in Psalm 139 verses"
    },
    {
      "id": 116,
      "start": 638.239990234375,
      "end": 643.3599853515625,
      "text": " 23 and 24, to say search me O God and know my heart, try me and know my"
    },
    {
      "id": 117,
      "start": 643.3599853515625,
      "end": 647.4400024414062,
      "text": " thoughts, that personal plea. What was it? I believe that there's a level of"
    },
    {
      "id": 118,
      "start": 647.4400024414062,
      "end": 654.7999877929688,
      "text": " humility, a level of humility. And there's a recognition of I'm desiring that God"
    },
    {
      "id": 119,
      "start": 654.7999877929688,
      "end": 660.9199829101562,
      "text": " works in my heart, in my life. We find that Peter, if you'll recall with me at"
    },
    {
      "id": 120,
      "start": 660.9199829101562,
      "end": 665.9199829101562,
      "text": " the end of the book of John, in chapter number 21 after they go fishing, and we"
    },
    {
      "id": 121,
      "start": 665.9199829101562,
      "end": 670.1599731445312,
      "text": " find that the Lord shows up on the shore and he says, have you caught"
    },
    {
      "id": 122,
      "start": 670.1599731445312,
      "end": 675.7999877929688,
      "text": " anything? Do you have any meat? And they say, no we've caught nothing. And Jesus tells"
    },
    {
      "id": 123,
      "start": 675.7999877929688,
      "end": 679.5599975585938,
      "text": " them to cast the net and they would find and they have a great host of multitude"
    },
    {
      "id": 124,
      "start": 679.5599975585938,
      "end": 684.4000244140625,
      "text": " of fish that they bring in. And Peter then after they come to the shore and"
    },
    {
      "id": 125,
      "start": 684.4000244140625,
      "end": 688.9199829101562,
      "text": " they come and dine and they enjoy fellowship with the Lord, the Lord Jesus"
    },
    {
      "id": 126,
      "start": 688.9199829101562,
      "end": 693.7999877929688,
      "text": " Christ begins to interact personally with Peter. Begins to ask him a series of"
    },
    {
      "id": 127,
      "start": 693.7999877929688,
      "end": 698.9600219726562,
      "text": " questions. Do you love me? And we recognize those truths that are there"
    },
    {
      "id": 128,
      "start": 698.9600219726562,
      "end": 704.7999877929688,
      "text": " and we find that the Lord then gives some instruction and revelation with"
    },
    {
      "id": 129,
      "start": 704.7999877929688,
      "end": 709.280029296875,
      "text": " regard to the end of Peter's life and the death that he would die. And Jesus"
    },
    {
      "id": 130,
      "start": 709.280029296875,
      "end": 716.0399780273438,
      "text": " says this, Peter follow me. You'll probably recall that John was there as"
    },
    {
      "id": 131,
      "start": 716.0399780273438,
      "end": 722.4000244140625,
      "text": " well. And Peter says to the Lord Jesus Christ after he hears those words, follow"
    },
    {
      "id": 132,
      "start": 722.5599975585938,
      "end": 728.0,
      "text": " me, in verse number 21 he says, well what about this guy? He says, Lord and what"
    },
    {
      "id": 133,
      "start": 728.0,
      "end": 733.7999877929688,
      "text": " shall this man do? What's he concerned about? He's concerned about John, right?"
    },
    {
      "id": 134,
      "start": 733.7999877929688,
      "end": 743.4000244140625,
      "text": " And Jesus says, if I will that he tarry till I come, what is that to thee? Follow"
    },
    {
      "id": 135,
      "start": 743.4000244140625,
      "end": 750.1199951171875,
      "text": " thou me. Really learn about that. Learn about some personal responsibility. One"
    },
    {
      "id": 136,
      "start": 750.1199951171875,
      "end": 754.4000244140625,
      "text": " day we're gonna stand before the Lord Jesus Christ. And you're not gonna stand,"
    },
    {
      "id": 137,
      "start": 754.4000244140625,
      "end": 759.5599975585938,
      "text": " you're gonna stand by yourself, amen? You're gonna give an account. And we find"
    },
    {
      "id": 138,
      "start": 759.5599975585938,
      "end": 762.7999877929688,
      "text": " the personal nature of this and the importance. The Bible tells us that"
    },
    {
      "id": 139,
      "start": 762.7999877929688,
      "end": 766.760009765625,
      "text": " there in Corinth there was some problems that were going on. Part of, I mean"
    },
    {
      "id": 140,
      "start": 766.760009765625,
      "end": 769.52001953125,
      "text": " obviously there's a whole list of problems are going on in Corinth, but in"
    },
    {
      "id": 141,
      "start": 769.52001953125,
      "end": 772.3200073242188,
      "text": " 2nd Corinthians the Bible reveals to us that they were comparing themselves"
    },
    {
      "id": 142,
      "start": 772.3200073242188,
      "end": 779.3200073242188,
      "text": " among themselves. And the Bible says that this is not wise. See there's a danger in"
    },
    {
      "id": 143,
      "start": 779.3200073242188,
      "end": 784.9600219726562,
      "text": " us being able to look at other people and looking at how I'm maybe comparing"
    },
    {
      "id": 144,
      "start": 784.9600219726562,
      "end": 790.7999877929688,
      "text": " myself among ourselves, but the standard is not some other believer. The standard"
    },
    {
      "id": 145,
      "start": 790.7999877929688,
      "end": 796.0800170898438,
      "text": " is the Lord Jesus Christ and the Word of God. And so we find that the personal"
    },
    {
      "id": 146,
      "start": 796.0800170898438,
      "end": 801.0,
      "text": " nature of this plea is revealed to us in the use of the pronouns and the fact"
    },
    {
      "id": 147,
      "start": 801.0,
      "end": 808.5599975585938,
      "text": " that he says, search me, know my heart, try me, know my thoughts. And this evening"
    },
    {
      "id": 148,
      "start": 808.5599975585938,
      "end": 813.239990234375,
      "text": " this is a prayer that we need to pray. This is a place in which we need to get"
    },
    {
      "id": 149,
      "start": 813.239990234375,
      "end": 822.2000122070312,
      "text": " alone with the Lord and say, God we want you to search us, me personally. Yes, I"
    },
    {
      "id": 150,
      "start": 822.2000122070312,
      "end": 827.760009765625,
      "text": " want God to work collectively, but I must be careful to understand the importance"
    },
    {
      "id": 151,
      "start": 827.760009765625,
      "end": 833.5999755859375,
      "text": " of the personal nature of this plea from David here in Psalm 139 verses 23 and 24."
    },
    {
      "id": 152,
      "start": 833.6400146484375,
      "end": 838.6799926757812,
      "text": " Notice I believe not only was it personal, I believe it was passionate. I believe"
    },
    {
      "id": 153,
      "start": 838.6799926757812,
      "end": 845.4400024414062,
      "text": " that David really desired for God to search him. I believe that David was"
    },
    {
      "id": 154,
      "start": 845.4400024414062,
      "end": 849.1199951171875,
      "text": " passionate in his prayer. We see many things about David. There are much that"
    },
    {
      "id": 155,
      "start": 849.1199951171875,
      "end": 853.0399780273438,
      "text": " we could discuss with regard to his life and we could go through a whole host of"
    },
    {
      "id": 156,
      "start": 853.0399780273438,
      "end": 857.5599975585938,
      "text": " things and see some passion in the way that he rejoiced, the way that he sought"
    },
    {
      "id": 157,
      "start": 857.5599975585938,
      "end": 861.6799926757812,
      "text": " the Lord. I believe here as he's praying, I believe that there's a level of"
    },
    {
      "id": 158,
      "start": 861.6799926757812,
      "end": 866.719970703125,
      "text": " passion. It's interesting to me as you read the entirety of Psalm 139 that the"
    },
    {
      "id": 159,
      "start": 866.719970703125,
      "end": 871.7999877929688,
      "text": " psalmist had an awareness of God's omniscience and omnipresence. Notice how"
    },
    {
      "id": 160,
      "start": 871.7999877929688,
      "end": 877.1599731445312,
      "text": " he begins the psalm in verse number one of Psalm 139. It says, O Lord, thou hast"
    },
    {
      "id": 161,
      "start": 877.1599731445312,
      "end": 884.760009765625,
      "text": " searched me and known me. He begins the psalm with the acknowledgement of God's"
    },
    {
      "id": 162,
      "start": 884.9199829101562,
      "end": 891.9600219726562,
      "text": " omniscience, that God knows everything, but yet he concludes the psalm by saying,"
    },
    {
      "id": 163,
      "start": 891.9600219726562,
      "end": 903.1199951171875,
      "text": " Search me, O God, and know my heart. Try me and know my thoughts. Amen? But he starts"
    },
    {
      "id": 164,
      "start": 903.1199951171875,
      "end": 909.5599975585938,
      "text": " the psalm by saying, Thou hast searched me. In understanding, knowing, recognizing"
    },
    {
      "id": 165,
      "start": 909.5599975585938,
      "end": 914.2000122070312,
      "text": " the fact that our God is omniscient, you understand this evening that as we"
    },
    {
      "id": 166,
      "start": 914.2000122070312,
      "end": 919.4000244140625,
      "text": " consider the prayer of David at the end of the psalm, it was not only that he had"
    },
    {
      "id": 167,
      "start": 919.4000244140625,
      "end": 924.6400146484375,
      "text": " an awareness that God knew these things, but we see in this prayer, in these words,"
    },
    {
      "id": 168,
      "start": 924.6400146484375,
      "end": 930.52001953125,
      "text": " that he desired for the Lord to search him and to know him and to try him and"
    },
    {
      "id": 169,
      "start": 930.52001953125,
      "end": 937.0399780273438,
      "text": " to see if there be any wicked way in him. That desire on the part of the"
    },
    {
      "id": 170,
      "start": 937.0399780273438,
      "end": 940.9199829101562,
      "text": " psalmist to say, God, I want you to search me. See, it's one thing for us to"
    },
    {
      "id": 171,
      "start": 940.9199829101562,
      "end": 948.9199829101562,
      "text": " recognize that God knows everything. He does. When Adam and Eve were hiding in"
    },
    {
      "id": 172,
      "start": 948.9199829101562,
      "end": 955.2000122070312,
      "text": " the garden, did God know where they were? Of course he did. When David thought that"
    },
    {
      "id": 173,
      "start": 955.2000122070312,
      "end": 959.9199829101562,
      "text": " he did everything that he could within his power to cover his tracks, did God"
    },
    {
      "id": 174,
      "start": 959.9199829101562,
      "end": 965.4400024414062,
      "text": " know what he had committed? Surely he did. That's why he sends Nathan and says, Thou"
    },
    {
      "id": 175,
      "start": 965.4400024414062,
      "end": 971.0,
      "text": " art the man. Right? We can't hide anything from God. But there's something"
    },
    {
      "id": 176,
      "start": 971.0,
      "end": 977.0,
      "text": " interesting to me about the prayer of the psalmist here, is that the"
    },
    {
      "id": 177,
      "start": 977.0,
      "end": 984.47998046875,
      "text": " knowledge of God knowing everything, but then the invitation to that all-knowing"
    },
    {
      "id": 178,
      "start": 984.47998046875,
      "end": 991.0800170898438,
      "text": " God to come and search me. See, it's one thing for a child to know that their"
    },
    {
      "id": 179,
      "start": 991.1199951171875,
      "end": 996.6799926757812,
      "text": " parents have the ability to go in and to search the bedroom and to search under"
    },
    {
      "id": 180,
      "start": 996.6799926757812,
      "end": 1000.4400024414062,
      "text": " the bed and in the closet and wherever they want to search to be able to find"
    },
    {
      "id": 181,
      "start": 1000.4400024414062,
      "end": 1004.239990234375,
      "text": " whatever it is that they want to find, but it's another thing for the child to"
    },
    {
      "id": 182,
      "start": 1004.239990234375,
      "end": 1012.0399780273438,
      "text": " say, I invite you in to look. Do you understand the difference? See, God knows"
    },
    {
      "id": 183,
      "start": 1012.0399780273438,
      "end": 1016.4000244140625,
      "text": " everything and He knows our hearts. He knows if there's wickedness in us. He"
    },
    {
      "id": 184,
      "start": 1016.52001953125,
      "end": 1021.719970703125,
      "text": " knows our thoughts, but yet we find that the psalmist is inviting God in. He's"
    },
    {
      "id": 185,
      "start": 1021.719970703125,
      "end": 1029.56005859375,
      "text": " desiring, I believe, with passion for God to do this work in his life. I think it's"
    },
    {
      "id": 186,
      "start": 1029.56005859375,
      "end": 1036.719970703125,
      "text": " very encouraging to see the perspective of David and also for us to understand"
    },
    {
      "id": 187,
      "start": 1036.719970703125,
      "end": 1043.280029296875,
      "text": " the importance this evening of having a similar heart attitude. How many times"
    },
    {
      "id": 188,
      "start": 1043.4000244140625,
      "end": 1046.760009765625,
      "text": " throughout the Gospels do we read of the interactions of the Lord Jesus Christ"
    },
    {
      "id": 189,
      "start": 1046.760009765625,
      "end": 1051.9200439453125,
      "text": " with those to whom he ministered, and yet Jesus would say that he knew their"
    },
    {
      "id": 190,
      "start": 1051.9200439453125,
      "end": 1056.56005859375,
      "text": " thoughts, and they marveled. I mean, they didn't know. How does he know what we were"
    },
    {
      "id": 191,
      "start": 1056.56005859375,
      "end": 1062.43994140625,
      "text": " thinking? He knows your thoughts. He knows my thoughts, but it's a different thing"
    },
    {
      "id": 192,
      "start": 1062.43994140625,
      "end": 1067.0,
      "text": " when we say, Lord, we want you to search us and we want you to know and try, and"
    },
    {
      "id": 193,
      "start": 1067.0,
      "end": 1073.260009765625,
      "text": " that invitation that we extend, I believe that we only are going to extend that"
    },
    {
      "id": 194,
      "start": 1073.260009765625,
      "end": 1078.300048828125,
      "text": " invitation when we have that measure of humility. I believe that we'll only"
    },
    {
      "id": 195,
      "start": 1078.300048828125,
      "end": 1084.8199462890625,
      "text": " extend that invitation when we have that process of self-examination. When we go"
    },
    {
      "id": 196,
      "start": 1084.8199462890625,
      "end": 1089.260009765625,
      "text": " through the process of what we read of in 1 Corinthians 11 that we often read"
    },
    {
      "id": 197,
      "start": 1089.260009765625,
      "end": 1095.300048828125,
      "text": " and reference during the time of observing the Lord's Supper, and we"
    },
    {
      "id": 198,
      "start": 1095.300048828125,
      "end": 1099.02001953125,
      "text": " understand that it's a table of examination, but let a man examine"
    },
    {
      "id": 199,
      "start": 1099.0999755859375,
      "end": 1107.6199951171875,
      "text": " himself. We find that because the heart is deceitful, that we say, Lord, now we"
    },
    {
      "id": 200,
      "start": 1107.6199951171875,
      "end": 1114.93994140625,
      "text": " want you to search me in case I have deceived myself. I find that it's a"
    },
    {
      "id": 201,
      "start": 1114.93994140625,
      "end": 1122.5400390625,
      "text": " personal plea, it's a passionate plea. I believe it's a purposed plea. There's a"
    },
    {
      "id": 202,
      "start": 1122.5400390625,
      "end": 1129.3800048828125,
      "text": " purpose in this plea, in this prayer, and it's exciting. Notice what he says in"
    },
    {
      "id": 203,
      "start": 1129.3800048828125,
      "end": 1137.8199462890625,
      "text": " verse number 24, and see if there be any wicked way in me, and lead me in the way"
    },
    {
      "id": 204,
      "start": 1137.8199462890625,
      "end": 1143.93994140625,
      "text": " everlasting. You know what I believe the purpose is? The purpose is to be right with God."
    },
    {
      "id": 205,
      "start": 1143.93994140625,
      "end": 1152.219970703125,
      "text": " Amen? And lead me in the way everlasting. Lord, I want you to search me, I want you"
    },
    {
      "id": 206,
      "start": 1152.219970703125,
      "end": 1157.02001953125,
      "text": " to try me, I want you to know me, I want you to see if there's any wicked way in"
    },
    {
      "id": 207,
      "start": 1157.02001953125,
      "end": 1162.1400146484375,
      "text": " me. Reveal that to me so that you then lead me in the way everlasting so that I"
    },
    {
      "id": 208,
      "start": 1162.1400146484375,
      "end": 1169.1400146484375,
      "text": " can be right with you. The idea of nothing between my soul and my Savior. The idea"
    },
    {
      "id": 209,
      "start": 1169.1400146484375,
      "end": 1175.97998046875,
      "text": " of having that sweet communion with our Lord and Savior. The purpose of"
    },
    {
      "id": 210,
      "start": 1175.97998046875,
      "end": 1181.6199951171875,
      "text": " David praying the prayer, the purpose of the plea that we read, is that I want to"
    },
    {
      "id": 211,
      "start": 1181.6199951171875,
      "end": 1187.4599609375,
      "text": " be right with my Savior. I want to be right with God. God, if there's anything wicked"
    },
    {
      "id": 212,
      "start": 1187.4599609375,
      "end": 1195.4599609375,
      "text": " in me. See, we look at verse number 21 and 22. It's interesting, the verses leading"
    },
    {
      "id": 213,
      "start": 1195.4599609375,
      "end": 1200.3800048828125,
      "text": " directly into the prayer that finishes the psalm. He says, do not I hate them, O"
    },
    {
      "id": 214,
      "start": 1200.3800048828125,
      "end": 1205.8199462890625,
      "text": " Lord, that hate Thee, and am not I grieve with those that rise up against Thee. I"
    },
    {
      "id": 215,
      "start": 1205.8199462890625,
      "end": 1210.97998046875,
      "text": " hate them with perfect hatred. I count them mine enemies. Then he says, search me, O"
    },
    {
      "id": 216,
      "start": 1210.97998046875,
      "end": 1214.4200439453125,
      "text": " God, and know my heart. Try me and know my thoughts. See if there be any wicked way"
    },
    {
      "id": 217,
      "start": 1214.4200439453125,
      "end": 1218.4200439453125,
      "text": " in me and lead me in the way everlasting. In the very context of what he's saying"
    },
    {
      "id": 218,
      "start": 1218.4200439453125,
      "end": 1223.4599609375,
      "text": " in verses 21 and 22, he's saying, but God, I want it to be a righteous thing. I don't"
    },
    {
      "id": 219,
      "start": 1223.4599609375,
      "end": 1231.6600341796875,
      "text": " want it to be a carnal thing. The reality this evening is that there are times in"
    },
    {
      "id": 220,
      "start": 1231.6600341796875,
      "end": 1237.219970703125,
      "text": " our lives when we think, well, and in fact, even as you speak with lost people and"
    },
    {
      "id": 221,
      "start": 1237.219970703125,
      "end": 1240.9000244140625,
      "text": " you confront them with their need for the Savior, on many occasion I've had"
    },
    {
      "id": 222,
      "start": 1240.9000244140625,
      "end": 1244.219970703125,
      "text": " people say, well, I've never murdered anybody. Well, I mean, that's a good thing"
    },
    {
      "id": 223,
      "start": 1244.219970703125,
      "end": 1248.97998046875,
      "text": " that you never murdered anybody, right? I've never committed, and they might list"
    },
    {
      "id": 224,
      "start": 1248.97998046875,
      "end": 1255.5,
      "text": " something that they think is a big sin in their minds. You know, it's interesting"
    },
    {
      "id": 225,
      "start": 1256.780029296875,
      "end": 1262.97998046875,
      "text": " that when the Lord in the epistles, and you can read various portions of"
    },
    {
      "id": 226,
      "start": 1262.97998046875,
      "end": 1268.219970703125,
      "text": " Scripture, when He's giving instruction to His people about the importance of"
    },
    {
      "id": 227,
      "start": 1268.219970703125,
      "end": 1271.739990234375,
      "text": " our walk, I think of Ephesians specifically, and you think about the"
    },
    {
      "id": 228,
      "start": 1271.739990234375,
      "end": 1276.06005859375,
      "text": " latter half of the book and really dealing with chapters 4 and 5 and"
    },
    {
      "id": 229,
      "start": 1276.06005859375,
      "end": 1280.260009765625,
      "text": " looking at all of the things with regard to our walk with the Lord and how we"
    },
    {
      "id": 230,
      "start": 1280.260009765625,
      "end": 1284.0999755859375,
      "text": " walk, how we behave. You know what He deals with? He doesn't deal with don't"
    },
    {
      "id": 231,
      "start": 1284.0999755859375,
      "end": 1289.8599853515625,
      "text": " murder people. He doesn't deal with don't commit adultery. He doesn't deal, no, He"
    },
    {
      "id": 232,
      "start": 1289.9000244140625,
      "end": 1301.9000244140625,
      "text": " says, tell the truth. Don't lie. He says, be angry and sin not. Right? He says, let"
    },
    {
      "id": 233,
      "start": 1301.9000244140625,
      "end": 1307.8199462890625,
      "text": " not the sun go down upon your wrath. The things that He says in Ephesians 4 and"
    },
    {
      "id": 234,
      "start": 1307.8199462890625,
      "end": 1312.5799560546875,
      "text": " 5, the instruction that He's given, the importance of our walk, see, sometimes we"
    },
    {
      "id": 235,
      "start": 1312.5799560546875,
      "end": 1316.3800048828125,
      "text": " overlook some of those things in our own lives because we're so concerned about"
    },
    {
      "id": 236,
      "start": 1316.4200439453125,
      "end": 1324.0999755859375,
      "text": " some bigger things. We fail to realize that they're causing my walk with my"
    },
    {
      "id": 237,
      "start": 1324.0999755859375,
      "end": 1331.260009765625,
      "text": " Savior to be hindered. And sometimes we're too busy looking at someone else"
    },
    {
      "id": 238,
      "start": 1331.260009765625,
      "end": 1339.3800048828125,
      "text": " and looking at someone else's problem, someone else's sin, someone else's... and if"
    },
    {
      "id": 239,
      "start": 1339.3800048828125,
      "end": 1343.1800537109375,
      "text": " I can find someone that's doing something worse than I am, it can somehow"
    },
    {
      "id": 240,
      "start": 1343.3800048828125,
      "end": 1354.4599609375,
      "text": " make me feel okay. But the psalmist says, search me. Search me, O God, and know my"
    },
    {
      "id": 241,
      "start": 1354.4599609375,
      "end": 1363.1800537109375,
      "text": " heart. Try me and know my thoughts and see if there be any wicked way in me and"
    },
    {
      "id": 242,
      "start": 1363.1800537109375,
      "end": 1369.739990234375,
      "text": " lead me in the way everlasting. Why? Because I want to be right with God. I"
    },
    {
      "id": 243,
      "start": 1369.739990234375,
      "end": 1376.3800048828125,
      "text": " want to have that proper fellowship with God that is possible. It's"
    },
    {
      "id": 244,
      "start": 1376.3800048828125,
      "end": 1380.97998046875,
      "text": " going to require some humility to pray a prayer like this. It's going to help us"
    },
    {
      "id": 245,
      "start": 1380.97998046875,
      "end": 1388.4599609375,
      "text": " to recognize the importance of taking that personal approach. God work in my"
    },
    {
      "id": 246,
      "start": 1388.4599609375,
      "end": 1396.4200439453125,
      "text": " life. As we prepare for revival, I honestly don't have many times to"
    },
    {
      "id": 247,
      "start": 1396.4200439453125,
      "end": 1403.1400146484375,
      "text": " preach between now and then with regard to messages of preparation. We have an"
    },
    {
      "id": 248,
      "start": 1403.1400146484375,
      "end": 1407.300048828125,
      "text": " outdoor service on Sunday evening. We have an Awana ceremony awards on"
    },
    {
      "id": 249,
      "start": 1407.300048828125,
      "end": 1413.780029296875,
      "text": " Wednesday evening a week from now. And I want to encourage you that as we prepare"
    },
    {
      "id": 250,
      "start": 1413.780029296875,
      "end": 1420.3800048828125,
      "text": " spiritually for this revival meeting, yes, we pray broadly, corporately, that God"
    },
    {
      "id": 251,
      "start": 1420.3800048828125,
      "end": 1424.97998046875,
      "text": " would work in the midst of his people. But I wonder this evening how many of us"
    },
    {
      "id": 252,
      "start": 1424.97998046875,
      "end": 1430.5,
      "text": " will say, as the psalmist said here in Psalm 139, God, I'm the one that needs"
    },
    {
      "id": 253,
      "start": 1430.5,
      "end": 1437.219970703125,
      "text": " you to work in my life. Lord, I want to be thoroughly right with you. I'm"
    },
    {
      "id": 254,
      "start": 1437.219970703125,
      "end": 1440.699951171875,
      "text": " not concerned about what somebody else is doing and how somebody else is"
    },
    {
      "id": 255,
      "start": 1440.699951171875,
      "end": 1445.5400390625,
      "text": " behaving and how somebody else is acting. I just, God, I want you to work in my life."
    },
    {
      "id": 256,
      "start": 1445.5400390625,
      "end": 1451.219970703125,
      "text": " You know what the beautiful thing is? If everyone takes that approach, God works"
    },
    {
      "id": 257,
      "start": 1451.219970703125,
      "end": 1456.6199951171875,
      "text": " amazing ways, right? But if everybody's taking the approach of, man, I hope you"
    },
    {
      "id": 258,
      "start": 1456.6199951171875,
      "end": 1460.260009765625,
      "text": " work in that guy's life, I hope you work in that person's life, and then we miss"
    },
    {
      "id": 259,
      "start": 1460.260009765625,
      "end": 1466.93994140625,
      "text": " what God has for us. Search me, oh God. Let's pray. Father, we love you. We thank"
    },
    {
      "id": 260,
      "start": 1466.93994140625,
      "end": 1472.9000244140625,
      "text": " you for loving us. We thank you for this brief thought this evening. From this"
    },
    {
      "id": 261,
      "start": 1472.9000244140625,
      "end": 1480.93994140625,
      "text": " familiar passage of Scripture, it is my prayer tonight, personally, you'd work in"
    },
    {
      "id": 262,
      "start": 1480.93994140625,
      "end": 1489.260009765625,
      "text": " my life. Lord, I pray that somehow this evening this familiar passage of"
    },
    {
      "id": 263,
      "start": 1489.260009765625,
      "end": 1498.4599609375,
      "text": " Scripture has helped someone. I know that you helped me. Lord, I pray it is my"
    },
    {
      "id": 264,
      "start": 1498.4599609375,
      "end": 1506.4599609375,
      "text": " desire that you'd work corporately in our midst. God, I long to have you work"
    },
    {
      "id": 265,
      "start": 1506.4599609375,
      "end": 1514.02001953125,
      "text": " in my life personally. God, I repeat these words of the psalmist and desire that"
    },
    {
      "id": 266,
      "start": 1514.02001953125,
      "end": 1519.780029296875,
      "text": " you would work in my life. Thank you for the privilege of prayer. We thank you for"
    },
    {
      "id": 267,
      "start": 1519.780029296875,
      "end": 1526.5,
      "text": " the power of prayer. And I pray as we gather here at the church house and pray"
    },
    {
      "id": 268,
      "start": 1526.5,
      "end": 1531.5,
      "text": " together, you'd bless and work. I pray for our families that are tuned in via"
    },
    {
      "id": 269,
      "start": 1531.5,
      "end": 1537.5799560546875,
      "text": " livestream. Oh Lord, I pray they would not hustle to some other activity, but"
    },
    {
      "id": 270,
      "start": 1537.5799560546875,
      "end": 1543.739990234375,
      "text": " they spend time in prayer, understanding the importance and the power of prayer."
    },
    {
      "id": 271,
      "start": 1543.739990234375,
      "end": 1549.8599853515625,
      "text": " We thank you, even as we began our service this evening, that you're a God"
    },
    {
      "id": 272,
      "start": 1549.8599853515625,
      "end": 1554.6199951171875,
      "text": " who does answer prayer. We pray that you would be honored and glorified and we'll"
    },
    {
      "id": 273,
      "start": 1554.6199951171875,
      "end": 1560.02001953125,
      "text": " thank you for it. In Christ's name we pray, amen. Let me share some updates with"
    },
    {
      "id": 274,
      "start": 1560.02001953125,
      "end": 1565.1800537109375,
      "text": " you in our prayer bulletin. I want to start first with the insert."
    }
  ],
  "processed_at": "2025-04-17T14:17:56.445040"
}