{
  "video_id": "iwVXkDtclDU",
  "text": "In verse number 1, Titus is given the admonition from the Apostle Paul to speak now the things which become sound doctrine. And so from that verse of Scripture, we have taken the opportunity to deal with some doctrinal truth and to deal with sound doctrine. And we studied for a few weeks the doctrine of the Scriptures, Bibliology. And last week we began, we had our first lesson on the subject matter of theology. We examined the book of Jeremiah, the 10th chapter, verses 1 through 18. And we emphasized the importance of theology and we said that there are many today that have questions about who God is, what God's like, and how you can have a relationship with God, how you relate to God. And all of those answers must be found within the pages of Scripture. We understand that there are people today that are seeking to give answers and explanations and describe who God is and how God works, but they're giving answers that are void of this book, and therefore they're erroneous. And so we must understand the source of our doctrine. All Scripture is given by inspiration of God, is profitable for doctrine. And we established those points last week. As we studied that portion in Jeremiah 10, I mentioned to you that in verse number 6, it would serve as the basic outline for our study of theology. That verse says this, for as much as there is none like unto thee, O Lord, thou art great and thy name is great. Last week we looked at the first section of that verse of Scripture, for as much as there is none like unto thee, O Lord, there's no one like our God, amen? And what a blessing that is. And this evening, the second phrase of that verse of Scripture in Jeremiah 10 in verse number 6 says this, thou art great. And so if you're taking notes this evening, I've simply entitled the lesson tonight, The Greatness of God, Part 1. And I've already planned that we'll have a Part 2, and so we'll have Part 1 this evening. And as we focus on that phrase, thou art great, and take these couple of weeks to examine the greatness of God and really looking at the attributes of God. Attributes have been defined as being qualities or characteristics that are inherent in or ascribed to someone. So we begin to look at the attributes of God, and this evening we're going to look at the natural attributes of God. Next Wednesday evening, we'll look at the moral attributes of God and seek to understand that indeed, as the Scriptures say, our God is great. Psalm 48 says, great is the Lord and greatly to be praised. When we understand how great He is, it causes us to stand in awe of who He is. Notice in Psalm 135, in verse number 1, the Bible says, Praise ye the Lord, praise ye the name of the Lord. Praise Him, O ye servants of the Lord, ye that stand in the house of the Lord and the courts of the house of our God. Praise the Lord, for the Lord is good. Sing praises unto His name, for it is pleasant. For the Lord hath chosen Jacob unto Himself in Israel for His peculiar treasure. Notice this in verse number 5, for I know that the Lord is great, and that our Lord is above all gods. And remember, in the Old Testament, you deal with many references with the idolatrous worship of the inhabitants of the land and then even of the people of the Lord. And so we find that here the psalmist is declaring, I know that the Lord is great. You look here and then look over at what the psalmist says in Psalm 145, and I want to just share this thought with you and then get into the natural attributes of God this evening. In Psalm 145, again in verse number 1, the Bible says, I will extol Thee, my God, O King, and I will bless Thy name forever and ever. Every day will I bless Thee, and I will praise Thy name forever and ever. Great is the Lord, and greatly to be praised, and His greatness is unsearchable. But I want you to notice what it continues to say here in verse number 4. It says, one generation shall praise Thy works to another, and shall declare Thy mighty acts. I will speak of the glorious honor of Thy majesty and of Thy wondrous works, and men shall speak of the might of Thy terrible acts. Notice the last phrase of verse number 6, and I will declare Thy greatness. I notice the statement that is made in verse number 4 when it says, one generation shall praise Thy works to another, and shall declare Thy mighty acts. God has established within His Word the principle of generational influence. That one generation is to influence and impact the next generation. We understand that Jude says that we're to earnestly contend for the faith that was once delivered unto the saints. There were a generation before us that were faithful to deliver the body of doctrine that we hold dear, and now our responsibility is to give that truth to another generation. I believe that as you examine and do a little research in our particular era in which we're living, you will find that there are a number of places in which this principle has broken down. We have a generation that's gone before us that did not properly influence a future generation, and you have a generation of people, sometimes even brought up in church, that do not know the greatness of God. And that's sad, and it shouldn't be that way. It's our responsibility. The church is the pillar and ground of the truth, and we have a great responsibility—listen, the young people in our church, they ought to know that our God is great, not just because we sing about it, but because we declare it and we show it from the precious pages of this book. Let me show you why we have come to the proper conclusion that the psalmist came to in saying, I know that the Lord is great. And our young people need to understand that, and what a great opportunity we have. As we think about the greatness of God and we think about the attributes, as I mentioned, we'll deal with the natural attributes this evening, the moral attributes next Wednesday evening. The natural attributes of God, it's been said this way, that they manifest the greatness of God. Now, many of these things, no doubt, we could just list them off, and we have heard it before, we kind of have known these things, but I hope this evening that as we just take a few moments to examine these five attributes that we're going to look at, that it would cause us to rejoice and to praise our God and to stand in awe of Him, and then to make the decision that because I know that He's great, I'm going to seek to share that with someone else. Because there's a world that is in darkness. If our gospel be hid, according to what Paul said in 2 Corinthians 4, it is hid to them that are lost. And so we have a great opportunity to declare the greatness of God. If you were to go and take a little survey of people that you come in contact with, I would venture to say that most of them that you encounter on a daily basis, they do not know the greatness of God. They don't know. They're unaware. And we have the privilege of being able to share with them the truth of the Scripture. Number one, the first attribute that we'll deal with is that God is omniscient. God is omniscient. We often speak about the omniscience of God, that He's all-knowing, that He has perfect knowledge, that He has all wisdom. And we believe that, we can say that, but let's look at a few verses of Scripture. I will say this at the very beginning. We're going to go to a number of passages this evening, but as we do, you understand that in no place are we using an exhaustive list of Scriptures to prove these attributes of God. We'd be here for many weeks if we were going to do that, and so I've just taken a sampling of verses of Scripture this evening to prove each of these attributes biblically. And so Job chapter number 42, if you would, go over to Job chapter number 42, and we'll go through a number of verses here with each of these points dealing with the attributes of God, again, the natural attributes of God. In Job 42, Job answered the Lord. In verse number one, the Bible tells us that Job is speaking here and answering the Lord. Take notice here of what Job says. He says, I know that thou canst do everything, and that no thought can be withholden from thee. By the way, that's a good realization for us as the people of God to make, to understand that God knows all things, that God knows even our thoughts. As we would study the Scriptures in the New Testament gospel records of the life and ministry of the Lord Jesus Christ, you will find on a number of occasions where the Bible will tell us that the Lord knew their thoughts. Before they ever made any comments, as they just reasoned amongst themselves, Jesus knew their thoughts and answered their questions, and on many occasions left them speechless. And here we find that Job rightly concludes that God can do anything. Everything is what he says. I know that thou canst do everything, and really that's some revelation with regard to the omnipotence of God, which will be our next point. And then he says this, and that no thought can be withholden from thee. Turn to Psalm 139, if you will. Look again at a number of verses, and I just selected a handful for each of these points this evening. In Psalm 139, the psalmist says this. The psalmist has been a scribe. to David in verse number one. Oh Lord thou hast searched me and known me. Thou knowest my down sitting and mine uprising. Thou understandest my thought afar off. Thou understandest my thought afar off. Look at verse chapter 147 here in the book of Psalms and look at verses four and five. I love looking at Psalm 147 verse number four when you couple it with the truth of the the record of creation that God gives us in Genesis 1 and verse 16 where the last several words of that verse say he made the stars also and we know that there's a great number of stars and here it tells us in Psalm 147 in verse number four he telleth the number of the stars and then it says this he calleth them all by their names. Verse five great is our Lord and of great power again the omnipotence of God but notice the last phrase of verse number five his understanding is infinite. His understanding is infinite. Paul says this in Romans chapter 11 as he's writing here about this very subject of the wisdom of God and we again understand that our God is omniscient. He has all knowledge perfect knowledge and here as as Paul would rightly conclude and obviously it's it's the Word of God but notice what is said here it's such a beautiful portion of Scripture in verse number 33 of Romans 11. Oh the depth of the riches both of the wisdom and knowledge of God how unsearchable are his judgments and his ways past finding out for who hath known the mind of the Lord or who hath been his counselor or who hath first given to him and it shall be recompensed unto him again for of him and through him and to him are all things notice to whom be glory forever amen. We understand this evening that our God is omniscient he has all knowledge all wisdom that ought to cause us to rejoice when we understand listen I don't have all wisdom and all knowledge and neither do you there are times in which we wish we did there are times in which we knew we could figure out all of the problems of life but the reality this evening is that as we begin to look at these attributes and understand who God is that we stand in all of him but we also rejoice and praise him and recognize that that we're his children and so when I lack wisdom I know the one who possesses all wisdom that I can go to him in prayer and seek his face and ask him for that wisdom that he promises to give and what a blessing that is number two not only that God is omniscient God is omnipotent and in this reveals to us that he has all power he has perfect power Job 9 4 is a great verse really that kind of several of these already have dealt with both the omniscience and the omnipotence of God but I love what Job 9 4 reveals to us about both of these first two attributes that we deal with and in here Job is replying to one of those that have been referenced as being his friends and of course they're miserable comforters but he says in verse number four of Job 9 he speaking of God is wise in heart and mighty in strength who hath hardened himself against him and hath prospered but I want you to notice the first portion of verse number four that he's wise in heart and mighty in strength I'm thankful that God is omniscient but I'm also thankful that he's omnipotent he has all wisdom all perfect knowledge but he also has all power so he knows what has to be done and he has the power to do it there are times in which we could look at different circumstances in which we have in life and we say I'm not sure how to do it but maybe I have the the power the strength to do whatever the task is and maybe we lean on somebody else's wisdom and we say you tell me how to do this and I'll do it I don't have the knowledge to do it but I have the strength to be able to do it in in reverse form there are some that have the knowledge to know how to do it but they no longer have the physical abilities to do it and we understand that as human beings in life but we understand that our God he has all wisdom and he has all power he knows what to do and he has the power to do it and that ought to cause us to rejoice this evening he says to to Abraham we won't turn there for sake of time but in Genesis 18 14 he asked that question is anything too hard for the Lord and really we understand what he's saying when he asked that question of Abraham he's saying to Abraham he's already introduced himself and revealed himself as being El Shaddai the Lord God Almighty in that same text of Scripture and he's saying this to Abraham there's nothing too hard for me I have all power Jeremiah recognized that we find that Jesus says this in Matthew 28 a portion of Scripture that we often reference when we speak about the Great Commission and these are the words of Jesus as he would ascend to heaven and of course we see the the truth in all of the Gospels with regard to the Great Commission and here Jesus says this and as it's recorded by Matthew in verse 18 of Matthew 28 he came and spake unto them saying all power is given unto me in heaven and in earth aren't you thankful that God has all power in fact Revelation 19 in verse number 6 reveals this truth to us I'll give you a moment to turn there Revelation 19 and verse number 6 the Bible says this and I heard as it were the voice of a great multitude and as the voice of many waters and as the voice of mighty thundering saying hallelujah for the Lord God omnipotent raineth you understand this evening that our God has all power and that he still reigns he's in control and he has all power and we begin to think about the greatness of God and we look at these first two attributes and say okay what why do we come to this conclusion that God is great why do we make this declaration that God is great why do we sing songs about the greatness of God well because we can say as the psalmist said I know the Lord is great number one he's got all knowledge all wisdom number two he's got all power number three he is omnipresent he's omnipresent what do you mean by that well he's everywhere present God is a spirit they that worship him must worship him in spirit and truth John 4 and verse 24 we understand that and we begin to think about the omnipresence of God and how it would cause us as the people of God to rejoice in understanding this go back to the book of Psalms if you will and we'll look at a few verses of Scripture here with regard to the the truth before us of the omnipresence of God the psalmist here in Psalm 139 we mentioned the first two verses we looked at the omniscience of God and as you look at verse number 7 down through verse number 12 you see the psalmist is referencing here and his understanding of the omnipresence of God it says this wither shall I go from thy spirit or wither shall I flee from thy presence if I ascend up into heaven thou art there if I make my bed in hell behold thou art there if I take the wings of the morning and dwell in the uttermost parts of the sea even there shall thy hand lead me and the right hand shall hold me if I say surely the darkness shall cover me even the night shall be light about me yea the darkness hideth not from thee but the night shineth as the day the darkness and the light are both alike to thee and the psalmist is revealing to us in these verses of Scripture this truth with regard to the omnipresence of God that is everywhere present no doubt there have been times in our lives that we wish we could be at two places at the same time you know I wish I could be over here taking care of that I wish I could be over here doing this but we can't we're limited we can be at one place at one time and it doesn't matter how many people are vying for our attention it doesn't matter how many things need to be addressed we are limited of being in one place at one time but our God is omnipresent he's everywhere present it would begin to think about that truth and obviously that truth would bring comfort to the people of God as his children as we would be mindful of verses of Scripture like Matthew 28 and verse number 20 he gave in verse number 18 that he has all power given unto him in verse number 20 at the end of the Great Commission he says in lo I am with you always and you think about that comfort that the child of God will receive by understanding that God has promised to be with us in Hebrews 13 in verse number 5 he said I will never leave thee nor forsake thing and as the the people of God to know even as the psalmist in that very familiar portion of Scripture in Psalm 23 yea though I walk through the valley of the shadow of death I will fear no evil why for thou art with me and what joy and comfort that brings to the child of God and when you're in the place where you are and I'm in the place where I am and we're not in the presence of one another we can have this confidence that God is with you just as he's with me and that's amazing the greatness of God that he's omnipresent notice not only does it bring comfort to to the child of God, but I believe that it also can bring some conviction to the child of God, for God is in every place. In Proverbs 15, if you want to jot down just a couple of verses of Scripture, notice what the Bible says in Proverbs 15, and we'll look at a verse over in the book of Jeremiah as well. In Proverbs 15, in verse number 3, the Bible says this, the eyes of the Lord are in every place, beholding the evil and the good. Man, don't you wish sometimes you had eyes in all the places that you thought you need to have eyes? How many of you moms ever said that you had mom eyes? Holly calls them back eyes, and what does she mean by that? Well, the kids do something and she sees them, quote unquote, and they're like, how did you see me do that? She said, I have mom eyes. Well, she's just kidding, and she noticed something that they were doing that they, of course, didn't know she was watching, but the reality is that God sees everything. The eyes of the Lord are in every place, beholding the good and the evil, and we see that, and we, the evil and the good, I quote it in reverse order, but we find that God is omnipresent and that He sees all things. Notice what Jeremiah says in Jeremiah chapter 23. Jeremiah is, of course, prophesying to rebellious Judah, and you can look through and see much of the prophecies that are given in dealing with these folks that are not repentant. And here, notice with me in verse number 21 of Jeremiah 23, I have not sent these prophets, yea, they ran, I have not spoken to them, yet they prophesied, but if they had stood in my counsel and had caused my people to hear my words, then they should have turned them from their evil way and from the evil of their doings. Am I a God at hand, saith the Lord, and not a God afar off? Notice what he says in verse 24, can any hide himself in secret places that I shall not see him, saith the Lord? Do not I fill heaven and earth, saith the Lord? Ezekiel, in particular, we don't take time to go over there and look at the portion of Scripture, but Ezekiel is prophesying and he's dealing with those that have been taken into captivity, and there are some that have that idea that, well, no one sees what I'm doing, but God is aware of it because God is omnipresent, he's everywhere. So we see this evening he's omniscient, he's omnipotent, he's omnipresent. Number four, God is immutable. He's immutable. What do we mean by that? Well, he's always the same, he never changes. I've often said, and I'll repeat it again this evening, that I believe that this is really, quote-unquote, the glue of Bible doctrine. And the reason that I say that is because if God was not immutable, how would we know how to approach him from generation to generation, from era to era? We would have a lack of knowledge as to how to approach him because he changes. But the reality is that God has revealed to us in his Word that he is immutable, that he does not change, and therefore, because he does not change, we can take the truth of the Word of God that was given to us and we can say he's the same because he said he didn't change. And so God is just as holy today as he's ever been. He's just as powerful today as he's ever been. He's just as wise today as he's ever been. Why? Because he doesn't change. And we understand that people are saved today the same way they were saved when Paul was preaching, right? Salvation is through the finished work of the Lord Jesus Christ on the cross of Calvary. And we can rejoice in understanding that God has given us the Word of God. He's given us the plan of redemption. He's revealed to us what pleases him, what does not please him, and we can have this confidence in this book because he doesn't change. He's the same. Malachi says this, speaking of the attribute of God. He says in Malachi chapter number 3 and verse number 6, he says, I am the Lord, I change not. Therefore, ye sons of Jacob are not consumed. Hebrews 13 and verse number 8 says, Jesus Christ, the same yesterday and today and forever. Now we have relationships with people in life. You know, the people that we have relationships with, we'd say that people change, right? Do you agree with that? People change. In fact, sometimes people change kind of their countenance and their dealings might change even in a single day. And sometimes we can struggle with how we approach individuals because we don't know how we're going to find them and what spirit or attitude they will be in, right? We understand that in life. But God changes not. He's the same. He says, I am the Lord, I change not. Therefore, ye sons of Jacob are not consumed. And I'm so thankful this evening that God has revealed to us in his word that he's immutable. He doesn't change. Now we finish with this thought with regard to the attributes of God that we're looking at this evening, the natural attributes, and that is number five, that God is eternal. He's eternal. Our God has no beginning and no end. I said last week as we started our series on this doctrine of theology that the Bible does not seek to prove the existence of God, it simply declares the existence of God. In the beginning, God. We find that the Bible tells us that the heavens declare the glory of God, the firmament showeth forth as handiwork. There are the truth of the word of God, there are many references to declare to us the existence of God, and the Bible tells us that God is eternal. He has no beginning and no end. He is alpha and omega. And people, I had somebody on the driveway of the parking lot not long ago, just a couple of weeks ago, when I spoke to them and I was sharing truth with them about the Lord, and I mentioned about God being the creator, and they said, yeah, and who created God? Just kind of like that, shaking their head at me. And so the reality is that no one created God. God is God. He has always existed, and He's declared this truth to us in His word. We find this night, as we look at this last thought with regard to God being eternal, notice what the psalmist says in Psalm 90, in verse number 2, in Psalm 90, in verse number 2, the Bible says this, Psalm 90, verse 2, Before the mountains were brought forth, or ever thou hadst formed the earth and the world, Then from everlasting to everlasting thou art God. We think about the eternality of God, we understand in Revelation chapter 1, I'll just give you the reference, I want to look at a passage over to Exodus here as we conclude, but in Revelation 1, verse number 4, and then again in verse number 8, the Bible talks about the fact that our God is eternal, He is, He was, He is to come, I am alpha and omega, the beginning and the end, the first and the last, He's the Almighty, according to verse number 8 of Revelation 1, and how we can rejoice in understanding the truth of the eternality of God, remember it was when Jesus, there in John chapter 1, John the Baptist is speaking about Jesus, and he says, there comes one after me who is preferred above me because He was before me, and when you think about that whole context of what John the Baptist is speaking of, he's speaking of the coming of the Lord Jesus Christ, and the reality is that John the Baptist, physically speaking, was older, Elizabeth gave birth before Mary did, but how was Jesus before him? Well, because He's eternal. In John 17, we find that as Jesus is praying, He says, He speaks about the glory that He had with God in eternity past. And I want you to notice in Exodus chapter 3, we'll finish up with this tonight, as we think about the eternality of God, we'll be familiar with the passage of Scripture as here God is speaking to Moses, and the call of Moses, the instruction of Moses here, that we hear those words when God says to Moses, I am that I am, remember when Moses said whom shall I say sent me? What name should I give them? What shall I say unto them? And they say, what is His name? And He says, I am that I am. Remember Jesus said in John 8, in verse number 58, when He's speaking to the religious leaders of the day, He's speaking about Abraham rejoices to see his day. And they said, man, you're not even 50 years old, what are you talking about? And He says, before Abraham was, I am. And we find here that in this text of Scripture in Exodus chapter 3, that the children of Israel are currently in Egyptian bondage. They're dealing with great difficulty. And God is going to appear to Moses, and He appears to him in this flame of fire out of the midst of a bush, and Moses in verse number 3, he says this, I will now turn aside and see this great sight, why the bush is not burnt. And God called unto him, and Moses said, here am I, and God says, the place whereon thou standest is holy ground. But notice the content of the message in which God will give to Moses. In verse number 6, moreover, He said, God is speaking. He says, I am the God of thy father, the God of Abraham, the God of Isaac, and the God of Jacob. So understand that he is the God of the past. He's eternal. He's speaking to Moses. He says, I am the God of thy father, the God of Abraham, the God of Isaac, the God of Jacob. Moses hid his face for he was afraid to look upon God. Notice what the Lord says in verse number seven, I have surely seen the affliction of my people, which are in Egypt, and have heard their cry by reason of their taskmasters for I know their sorrows. And I am come down to deliver them out of the hand of the Egyptians and to bring them up out of the land into a good land and a large into a land flowing with milk and honey into the place of the Canaanites and the Hittites, the Amorites and the Perizzites and the Hivites and the Jebusites. So we see in verses seven and eight that not only is God the God of the past, according to verse number six, but he's the God of the present, according to verse seven and eight. He knew what they were actively going through. He knew what they were dealing with. He knew that by reason of the taskmasters, he said, I know their sorrows. I hear their cry. Notice he's the God of the future. He tells Moses this in verse number 10. He says, come now, therefore, and I will send thee unto Pharaoh that thou mayest bring forth my people, the children of Israel, out of Egypt. Is that what happened? Absolutely, it's what happened. Why? Because he's eternal. And so he can speak God as he's revealing himself to Moses. He speaks about the past, the God of Abraham, Isaac, and Jacob, about the present, the current affliction of the people of God in Egyptian bondage, and about the future that they were going to be delivered out of Egyptian bondage. Our God is eternal. And we look this evening at these five natural attributes of God, the omniscience of God, the omnipotence of God, the omnipresence of God, the immutability of God, and the eternality of God, and we stand in awe of who he is. Apart from this book, you'd never come to this conclusion. We find, again, as I mentioned last week, that there are tribes all around the globe where they do not have a written revelation. They worship some deity, they have some knowledge of there being some God, but we, because of the revelation of the nature, yes, we understand there's a God, but then the revelation contained within this book reveals to us who he is, his attributes. And when we read these attributes, we stand in awe of him, and we conclude, as the Bible told us in Jeremiah 10 and verse number 6, for as much as there is none like unto thee, O Lord, there's none like him, for thou art great. This evening, we've just, for a little while, scratched the surface of the greatness of God, and I hope this evening that we would stand in awe of him, that we would, as we look at these attributes, praise him and rejoice that we have the privilege of being called his children. Isn't that amazing? That this God, that's, if you read, I'll give you a homework assignment, quote-unquote, go and read Psalm 48 before you go to bed this evening. It's not, it's only 15 verses or something like that, it's not very long, but Psalm 48 starts out with a song that we sing, Psalm 48, 1 and 2, great is the Lord, right? We sing it, greatly to be praised, right? We sing about the greatness of God, and the last verse of that passage says this, for this God is our God, and oh, how that ought to cause us to rejoice, and really to be humbled that we have the privilege of knowing him, that he's revealed himself to us, he's taken an interest in us, and we can say with the psalmist, I know the Lord is great. But just as the psalmist said in Psalm 145, one generation has to declare his greatness to another generation, and the psalmist stands up and says, I will speak of thy greatness. And this evening, we need to, in like fashion, stand up with the psalmist and say, I know the Lord is great, and I will speak of thy greatness, I will declare thy greatness. Let's pray together. Father, we love you, and we thank you for loving us. We stand in awe of who you are, as we look at these verses of Scripture, as we see how you have revealed yourself to us, Lord, we are humbled. We're privileged to know you. We are aware this evening that we live in the midst of a generation of people that do not know you. They do not know the God of the Bible. God, I pray that you'd help us tonight to not only praise you and stand in awe of you, but Lord, help us tonight to make a commitment to declare thy greatness, that we'd seize the opportunities that you would give us, to let others know how great you are. I pray that you'd bless our time of prayer. We thank you so much for the privilege of prayer, to know that we can enter into your presence to bring these petitions before thy throne, understanding that you are aware, you are able. I pray that you would do exceeding abundantly above all that we could ask or think. God, you would work in a distinct way in which you alone would be glorified, and we'll thank you for it. In Christ's name we pray, amen. Let me take your prayer bulletin.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.21999979019165,
      "text": " In verse number 1, Titus is given the admonition from the Apostle Paul to speak now the things"
    },
    {
      "id": 1,
      "start": 5.21999979019165,
      "end": 7.760000228881836,
      "text": " which become sound doctrine."
    },
    {
      "id": 2,
      "start": 7.760000228881836,
      "end": 14.260000228881836,
      "text": " And so from that verse of Scripture, we have taken the opportunity to deal with some doctrinal"
    },
    {
      "id": 3,
      "start": 14.260000228881836,
      "end": 17.479999542236328,
      "text": " truth and to deal with sound doctrine."
    },
    {
      "id": 4,
      "start": 17.479999542236328,
      "end": 22.020000457763672,
      "text": " And we studied for a few weeks the doctrine of the Scriptures, Bibliology."
    },
    {
      "id": 5,
      "start": 22.020000457763672,
      "end": 26.540000915527344,
      "text": " And last week we began, we had our first lesson on the subject matter of theology."
    },
    {
      "id": 6,
      "start": 26.540000915527344,
      "end": 30.940000534057617,
      "text": " We examined the book of Jeremiah, the 10th chapter, verses 1 through 18."
    },
    {
      "id": 7,
      "start": 30.940000534057617,
      "end": 35.20000076293945,
      "text": " And we emphasized the importance of theology and we said that there are many today that"
    },
    {
      "id": 8,
      "start": 35.20000076293945,
      "end": 40.08000183105469,
      "text": " have questions about who God is, what God's like, and how you can have a relationship"
    },
    {
      "id": 9,
      "start": 40.08000183105469,
      "end": 42.08000183105469,
      "text": " with God, how you relate to God."
    },
    {
      "id": 10,
      "start": 42.08000183105469,
      "end": 45.47999954223633,
      "text": " And all of those answers must be found within the pages of Scripture."
    },
    {
      "id": 11,
      "start": 45.47999954223633,
      "end": 50.380001068115234,
      "text": " We understand that there are people today that are seeking to give answers and explanations"
    },
    {
      "id": 12,
      "start": 50.380001068115234,
      "end": 55.63999938964844,
      "text": " and describe who God is and how God works, but they're giving answers that are void of"
    },
    {
      "id": 13,
      "start": 55.7400016784668,
      "end": 58.36000061035156,
      "text": " this book, and therefore they're erroneous."
    },
    {
      "id": 14,
      "start": 58.36000061035156,
      "end": 61.720001220703125,
      "text": " And so we must understand the source of our doctrine."
    },
    {
      "id": 15,
      "start": 61.720001220703125,
      "end": 66.4800033569336,
      "text": " All Scripture is given by inspiration of God, is profitable for doctrine."
    },
    {
      "id": 16,
      "start": 66.4800033569336,
      "end": 69.4000015258789,
      "text": " And we established those points last week."
    },
    {
      "id": 17,
      "start": 69.4000015258789,
      "end": 74.08000183105469,
      "text": " As we studied that portion in Jeremiah 10, I mentioned to you that in verse number 6,"
    },
    {
      "id": 18,
      "start": 74.08000183105469,
      "end": 78.80000305175781,
      "text": " it would serve as the basic outline for our study of theology."
    },
    {
      "id": 19,
      "start": 78.80000305175781,
      "end": 86.94000244140625,
      "text": " That verse says this, for as much as there is none like unto thee, O Lord, thou art great"
    },
    {
      "id": 20,
      "start": 86.94000244140625,
      "end": 89.86000061035156,
      "text": " and thy name is great."
    },
    {
      "id": 21,
      "start": 89.86000061035156,
      "end": 93.87999725341797,
      "text": " Last week we looked at the first section of that verse of Scripture, for as much as there"
    },
    {
      "id": 22,
      "start": 93.87999725341797,
      "end": 99.5199966430664,
      "text": " is none like unto thee, O Lord, there's no one like our God, amen?"
    },
    {
      "id": 23,
      "start": 99.5199966430664,
      "end": 101.4800033569336,
      "text": " And what a blessing that is."
    },
    {
      "id": 24,
      "start": 101.4800033569336,
      "end": 105.5,
      "text": " And this evening, the second phrase of that verse of Scripture in Jeremiah 10 in verse"
    },
    {
      "id": 25,
      "start": 105.5,
      "end": 108.72000122070312,
      "text": " number 6 says this, thou art great."
    },
    {
      "id": 26,
      "start": 108.76000213623047,
      "end": 113.4800033569336,
      "text": " And so if you're taking notes this evening, I've simply entitled the lesson tonight,"
    },
    {
      "id": 27,
      "start": 113.4800033569336,
      "end": 116.36000061035156,
      "text": " The Greatness of God, Part 1."
    },
    {
      "id": 28,
      "start": 116.36000061035156,
      "end": 122.55999755859375,
      "text": " And I've already planned that we'll have a Part 2, and so we'll have Part 1 this evening."
    },
    {
      "id": 29,
      "start": 122.55999755859375,
      "end": 127.62000274658203,
      "text": " And as we focus on that phrase, thou art great, and take these couple of weeks to examine"
    },
    {
      "id": 30,
      "start": 127.62000274658203,
      "end": 132.67999267578125,
      "text": " the greatness of God and really looking at the attributes of God."
    },
    {
      "id": 31,
      "start": 132.67999267578125,
      "end": 136.8000030517578,
      "text": " Attributes have been defined as being qualities or characteristics that are inherent in or"
    },
    {
      "id": 32,
      "start": 136.8000030517578,
      "end": 139.44000244140625,
      "text": " ascribed to someone."
    },
    {
      "id": 33,
      "start": 139.44000244140625,
      "end": 143.72000122070312,
      "text": " So we begin to look at the attributes of God, and this evening we're going to look at the"
    },
    {
      "id": 34,
      "start": 143.72000122070312,
      "end": 146.1999969482422,
      "text": " natural attributes of God."
    },
    {
      "id": 35,
      "start": 146.1999969482422,
      "end": 151.55999755859375,
      "text": " Next Wednesday evening, we'll look at the moral attributes of God and seek to understand"
    },
    {
      "id": 36,
      "start": 151.55999755859375,
      "end": 156.0399932861328,
      "text": " that indeed, as the Scriptures say, our God is great."
    },
    {
      "id": 37,
      "start": 156.0399932861328,
      "end": 158.9600067138672,
      "text": " Psalm 48 says, great is the Lord and greatly to be praised."
    },
    {
      "id": 38,
      "start": 158.9600067138672,
      "end": 165.9600067138672,
      "text": " When we understand how great He is, it causes us to stand in awe of who He is."
    },
    {
      "id": 39,
      "start": 166.0,
      "end": 168.8800048828125,
      "text": " Notice in Psalm 135, in verse number 1, the Bible says,"
    },
    {
      "id": 40,
      "start": 168.8800048828125,
      "end": 172.1199951171875,
      "text": " Praise ye the Lord, praise ye the name of the Lord."
    },
    {
      "id": 41,
      "start": 172.1199951171875,
      "end": 178.0,
      "text": " Praise Him, O ye servants of the Lord, ye that stand in the house of the Lord and the"
    },
    {
      "id": 42,
      "start": 178.0,
      "end": 180.60000610351562,
      "text": " courts of the house of our God."
    },
    {
      "id": 43,
      "start": 180.60000610351562,
      "end": 183.1199951171875,
      "text": " Praise the Lord, for the Lord is good."
    },
    {
      "id": 44,
      "start": 183.1199951171875,
      "end": 186.1199951171875,
      "text": " Sing praises unto His name, for it is pleasant."
    },
    {
      "id": 45,
      "start": 186.1199951171875,
      "end": 192.22000122070312,
      "text": " For the Lord hath chosen Jacob unto Himself in Israel for His peculiar treasure."
    },
    {
      "id": 46,
      "start": 192.22000122070312,
      "end": 199.5399932861328,
      "text": " Notice this in verse number 5, for I know that the Lord is great, and that our Lord"
    },
    {
      "id": 47,
      "start": 199.5399932861328,
      "end": 201.82000732421875,
      "text": " is above all gods."
    },
    {
      "id": 48,
      "start": 201.82000732421875,
      "end": 207.66000366210938,
      "text": " And remember, in the Old Testament, you deal with many references with the idolatrous worship"
    },
    {
      "id": 49,
      "start": 207.66000366210938,
      "end": 211.94000244140625,
      "text": " of the inhabitants of the land and then even of the people of the Lord."
    },
    {
      "id": 50,
      "start": 211.94000244140625,
      "end": 219.5,
      "text": " And so we find that here the psalmist is declaring, I know that the Lord is great."
    },
    {
      "id": 51,
      "start": 219.6999969482422,
      "end": 224.4600067138672,
      "text": " You look here and then look over at what the psalmist says in Psalm 145, and I want to"
    },
    {
      "id": 52,
      "start": 224.4600067138672,
      "end": 229.86000061035156,
      "text": " just share this thought with you and then get into the natural attributes of God this"
    },
    {
      "id": 53,
      "start": 229.86000061035156,
      "end": 230.86000061035156,
      "text": " evening."
    },
    {
      "id": 54,
      "start": 230.86000061035156,
      "end": 234.74000549316406,
      "text": " In Psalm 145, again in verse number 1, the Bible says,"
    },
    {
      "id": 55,
      "start": 234.74000549316406,
      "end": 239.6999969482422,
      "text": " I will extol Thee, my God, O King, and I will bless Thy name forever and ever."
    },
    {
      "id": 56,
      "start": 239.6999969482422,
      "end": 243.66000366210938,
      "text": " Every day will I bless Thee, and I will praise Thy name forever and ever."
    },
    {
      "id": 57,
      "start": 243.66000366210938,
      "end": 248.97999572753906,
      "text": " Great is the Lord, and greatly to be praised, and His greatness is unsearchable."
    },
    {
      "id": 58,
      "start": 248.97999572753906,
      "end": 252.94000244140625,
      "text": " But I want you to notice what it continues to say here in verse number 4."
    },
    {
      "id": 59,
      "start": 252.94000244140625,
      "end": 261.05999755859375,
      "text": " It says, one generation shall praise Thy works to another, and shall declare Thy mighty acts."
    },
    {
      "id": 60,
      "start": 261.05999755859375,
      "end": 266.1600036621094,
      "text": " I will speak of the glorious honor of Thy majesty and of Thy wondrous works, and men"
    },
    {
      "id": 61,
      "start": 266.1600036621094,
      "end": 268.3399963378906,
      "text": " shall speak of the might of Thy terrible acts."
    },
    {
      "id": 62,
      "start": 268.3399963378906,
      "end": 275.6199951171875,
      "text": " Notice the last phrase of verse number 6, and I will declare Thy greatness."
    },
    {
      "id": 63,
      "start": 275.6199951171875,
      "end": 280.1000061035156,
      "text": " I notice the statement that is made in verse number 4 when it says, one generation shall"
    },
    {
      "id": 64,
      "start": 280.1000061035156,
      "end": 284.6600036621094,
      "text": " praise Thy works to another, and shall declare Thy mighty acts."
    },
    {
      "id": 65,
      "start": 284.6600036621094,
      "end": 290.4599914550781,
      "text": " God has established within His Word the principle of generational influence."
    },
    {
      "id": 66,
      "start": 290.4599914550781,
      "end": 294.739990234375,
      "text": " That one generation is to influence and impact the next generation."
    },
    {
      "id": 67,
      "start": 294.739990234375,
      "end": 299.05999755859375,
      "text": " We understand that Jude says that we're to earnestly contend for the faith that was once"
    },
    {
      "id": 68,
      "start": 299.05999755859375,
      "end": 301.260009765625,
      "text": " delivered unto the saints."
    },
    {
      "id": 69,
      "start": 301.260009765625,
      "end": 307.29998779296875,
      "text": " There were a generation before us that were faithful to deliver the body of doctrine that"
    },
    {
      "id": 70,
      "start": 307.29998779296875,
      "end": 312.0199890136719,
      "text": " we hold dear, and now our responsibility is to give that truth to another generation."
    },
    {
      "id": 71,
      "start": 312.0199890136719,
      "end": 319.4200134277344,
      "text": " I believe that as you examine and do a little research in our particular era in which we're"
    },
    {
      "id": 72,
      "start": 319.4200134277344,
      "end": 324.94000244140625,
      "text": " living, you will find that there are a number of places in which this principle has broken"
    },
    {
      "id": 73,
      "start": 324.94000244140625,
      "end": 325.94000244140625,
      "text": " down."
    },
    {
      "id": 74,
      "start": 325.94000244140625,
      "end": 332.9800109863281,
      "text": " We have a generation that's gone before us that did not properly influence a future generation,"
    },
    {
      "id": 75,
      "start": 332.9800109863281,
      "end": 340.29998779296875,
      "text": " and you have a generation of people, sometimes even brought up in church, that do not know"
    },
    {
      "id": 76,
      "start": 340.29998779296875,
      "end": 342.3399963378906,
      "text": " the greatness of God."
    },
    {
      "id": 77,
      "start": 342.3399963378906,
      "end": 345.8599853515625,
      "text": " And that's sad, and it shouldn't be that way."
    },
    {
      "id": 78,
      "start": 345.8599853515625,
      "end": 347.1400146484375,
      "text": " It's our responsibility."
    },
    {
      "id": 79,
      "start": 347.1400146484375,
      "end": 352.4200134277344,
      "text": " The church is the pillar and ground of the truth, and we have a great responsibility—listen,"
    },
    {
      "id": 80,
      "start": 352.4200134277344,
      "end": 356.5,
      "text": " the young people in our church, they ought to know that our God is great, not just because"
    },
    {
      "id": 81,
      "start": 356.5,
      "end": 361.8599853515625,
      "text": " we sing about it, but because we declare it and we show it from the precious pages of"
    },
    {
      "id": 82,
      "start": 361.8599853515625,
      "end": 362.8599853515625,
      "text": " this book."
    },
    {
      "id": 83,
      "start": 362.8599853515625,
      "end": 369.1000061035156,
      "text": " Let me show you why we have come to the proper conclusion that the psalmist came to in saying,"
    },
    {
      "id": 84,
      "start": 369.1000061035156,
      "end": 373.3399963378906,
      "text": " I know that the Lord is great."
    },
    {
      "id": 85,
      "start": 373.3399963378906,
      "end": 377.9800109863281,
      "text": " And our young people need to understand that, and what a great opportunity we have."
    },
    {
      "id": 86,
      "start": 377.9800109863281,
      "end": 381.7799987792969,
      "text": " As we think about the greatness of God and we think about the attributes, as I mentioned,"
    },
    {
      "id": 87,
      "start": 382.1400146484375,
      "end": 385.70001220703125,
      "text": " we'll deal with the natural attributes this evening, the moral attributes next Wednesday"
    },
    {
      "id": 88,
      "start": 385.70001220703125,
      "end": 386.70001220703125,
      "text": " evening."
    },
    {
      "id": 89,
      "start": 386.70001220703125,
      "end": 392.5400085449219,
      "text": " The natural attributes of God, it's been said this way, that they manifest the greatness"
    },
    {
      "id": 90,
      "start": 392.5400085449219,
      "end": 393.5400085449219,
      "text": " of God."
    },
    {
      "id": 91,
      "start": 393.5400085449219,
      "end": 401.3800048828125,
      "text": " Now, many of these things, no doubt, we could just list them off, and we have heard it before,"
    },
    {
      "id": 92,
      "start": 401.3800048828125,
      "end": 405.4200134277344,
      "text": " we kind of have known these things, but I hope this evening that as we just take a few"
    },
    {
      "id": 93,
      "start": 405.4200134277344,
      "end": 410.8999938964844,
      "text": " moments to examine these five attributes that we're going to look at, that it would cause"
    },
    {
      "id": 94,
      "start": 411.0199890136719,
      "end": 418.3399963378906,
      "text": " us to rejoice and to praise our God and to stand in awe of Him, and then to make the"
    },
    {
      "id": 95,
      "start": 418.3399963378906,
      "end": 423.3800048828125,
      "text": " decision that because I know that He's great, I'm going to seek to share that with someone"
    },
    {
      "id": 96,
      "start": 423.3800048828125,
      "end": 425.3399963378906,
      "text": " else."
    },
    {
      "id": 97,
      "start": 425.3399963378906,
      "end": 428.260009765625,
      "text": " Because there's a world that is in darkness."
    },
    {
      "id": 98,
      "start": 428.260009765625,
      "end": 432.8599853515625,
      "text": " If our gospel be hid, according to what Paul said in 2 Corinthians 4, it is hid to them"
    },
    {
      "id": 99,
      "start": 432.8599853515625,
      "end": 433.8599853515625,
      "text": " that are lost."
    },
    {
      "id": 100,
      "start": 433.8599853515625,
      "end": 438.1000061035156,
      "text": " And so we have a great opportunity to declare the greatness of God."
    },
    {
      "id": 101,
      "start": 438.1000061035156,
      "end": 442.739990234375,
      "text": " If you were to go and take a little survey of people that you come in contact with, I"
    },
    {
      "id": 102,
      "start": 442.739990234375,
      "end": 447.4599914550781,
      "text": " would venture to say that most of them that you encounter on a daily basis, they do not"
    },
    {
      "id": 103,
      "start": 447.4599914550781,
      "end": 450.5,
      "text": " know the greatness of God."
    },
    {
      "id": 104,
      "start": 450.5,
      "end": 451.5,
      "text": " They don't know."
    },
    {
      "id": 105,
      "start": 451.5,
      "end": 453.0199890136719,
      "text": " They're unaware."
    },
    {
      "id": 106,
      "start": 453.0199890136719,
      "end": 457.29998779296875,
      "text": " And we have the privilege of being able to share with them the truth of the Scripture."
    },
    {
      "id": 107,
      "start": 457.29998779296875,
      "end": 462.70001220703125,
      "text": " Number one, the first attribute that we'll deal with is that God is omniscient."
    },
    {
      "id": 108,
      "start": 462.70001220703125,
      "end": 463.70001220703125,
      "text": " God is omniscient."
    },
    {
      "id": 109,
      "start": 463.70001220703125,
      "end": 466.94000244140625,
      "text": " We often speak about the omniscience of God, that He's all-knowing, that He has perfect"
    },
    {
      "id": 110,
      "start": 466.9800109863281,
      "end": 470.2200012207031,
      "text": " knowledge, that He has all wisdom."
    },
    {
      "id": 111,
      "start": 470.2200012207031,
      "end": 475.2200012207031,
      "text": " And we believe that, we can say that, but let's look at a few verses of Scripture."
    },
    {
      "id": 112,
      "start": 475.2200012207031,
      "end": 476.82000732421875,
      "text": " I will say this at the very beginning."
    },
    {
      "id": 113,
      "start": 476.82000732421875,
      "end": 481.82000732421875,
      "text": " We're going to go to a number of passages this evening, but as we do, you understand"
    },
    {
      "id": 114,
      "start": 481.82000732421875,
      "end": 488.82000732421875,
      "text": " that in no place are we using an exhaustive list of Scriptures to prove these attributes"
    },
    {
      "id": 115,
      "start": 488.82000732421875,
      "end": 489.82000732421875,
      "text": " of God."
    },
    {
      "id": 116,
      "start": 489.82000732421875,
      "end": 493.6199951171875,
      "text": " We'd be here for many weeks if we were going to do that, and so I've just taken a sampling"
    },
    {
      "id": 117,
      "start": 493.6199951171875,
      "end": 498.5199890136719,
      "text": " of verses of Scripture this evening to prove each of these attributes biblically."
    },
    {
      "id": 118,
      "start": 498.5199890136719,
      "end": 503.9800109863281,
      "text": " And so Job chapter number 42, if you would, go over to Job chapter number 42, and we'll"
    },
    {
      "id": 119,
      "start": 503.9800109863281,
      "end": 508.2200012207031,
      "text": " go through a number of verses here with each of these points dealing with the attributes"
    },
    {
      "id": 120,
      "start": 508.2200012207031,
      "end": 511.5,
      "text": " of God, again, the natural attributes of God."
    },
    {
      "id": 121,
      "start": 511.5,
      "end": 516.5399780273438,
      "text": " In Job 42, Job answered the Lord."
    },
    {
      "id": 122,
      "start": 516.5399780273438,
      "end": 521.6599731445312,
      "text": " In verse number one, the Bible tells us that Job is speaking here and answering the Lord."
    },
    {
      "id": 123,
      "start": 521.6599731445312,
      "end": 524.3800048828125,
      "text": " Take notice here of what Job says."
    },
    {
      "id": 124,
      "start": 524.3800048828125,
      "end": 532.7000122070312,
      "text": " He says, I know that thou canst do everything, and that no thought can be withholden from"
    },
    {
      "id": 125,
      "start": 532.7000122070312,
      "end": 533.7000122070312,
      "text": " thee."
    },
    {
      "id": 126,
      "start": 533.7000122070312,
      "end": 538.5,
      "text": " By the way, that's a good realization for us as the people of God to make, to understand"
    },
    {
      "id": 127,
      "start": 538.5,
      "end": 542.5399780273438,
      "text": " that God knows all things, that God knows even our thoughts."
    },
    {
      "id": 128,
      "start": 542.5399780273438,
      "end": 548.1799926757812,
      "text": " As we would study the Scriptures in the New Testament gospel records of the life and ministry"
    },
    {
      "id": 129,
      "start": 548.1799926757812,
      "end": 551.260009765625,
      "text": " of the Lord Jesus Christ, you will find on a number of occasions where the Bible will"
    },
    {
      "id": 130,
      "start": 551.260009765625,
      "end": 554.02001953125,
      "text": " tell us that the Lord knew their thoughts."
    },
    {
      "id": 131,
      "start": 554.02001953125,
      "end": 560.4400024414062,
      "text": " Before they ever made any comments, as they just reasoned amongst themselves, Jesus knew"
    },
    {
      "id": 132,
      "start": 560.4400024414062,
      "end": 566.739990234375,
      "text": " their thoughts and answered their questions, and on many occasions left them speechless."
    },
    {
      "id": 133,
      "start": 566.739990234375,
      "end": 572.3400268554688,
      "text": " And here we find that Job rightly concludes that God can do anything."
    },
    {
      "id": 134,
      "start": 572.3400268554688,
      "end": 573.3400268554688,
      "text": " Everything is what he says."
    },
    {
      "id": 135,
      "start": 573.3400268554688,
      "end": 578.9000244140625,
      "text": " I know that thou canst do everything, and really that's some revelation with regard"
    },
    {
      "id": 136,
      "start": 578.9000244140625,
      "end": 582.219970703125,
      "text": " to the omnipotence of God, which will be our next point."
    },
    {
      "id": 137,
      "start": 582.219970703125,
      "end": 585.5399780273438,
      "text": " And then he says this, and that no thought can be withholden from thee."
    },
    {
      "id": 138,
      "start": 585.5399780273438,
      "end": 589.0599975585938,
      "text": " Turn to Psalm 139, if you will."
    },
    {
      "id": 139,
      "start": 589.0599975585938,
      "end": 594.1799926757812,
      "text": " Look again at a number of verses, and I just selected a handful for each of these points"
    },
    {
      "id": 140,
      "start": 594.1799926757812,
      "end": 595.3400268554688,
      "text": " this evening."
    },
    {
      "id": 141,
      "start": 595.3400268554688,
      "end": 599.260009765625,
      "text": " In Psalm 139, the psalmist says this."
    },
    {
      "id": 142,
      "start": 599.260009765625,
      "end": 600.0999755859375,
      "text": " The psalmist has been a scribe."
    },
    {
      "id": 0,
      "start": 600.0999755859375,
      "end": 607.0599756240845,
      "text": " to David in verse number one. Oh Lord thou hast searched me and known me. Thou"
    },
    {
      "id": 1,
      "start": 607.0599756240845,
      "end": 612.7399759292603,
      "text": " knowest my down sitting and mine uprising. Thou understandest my thought"
    },
    {
      "id": 2,
      "start": 612.7399759292603,
      "end": 621.2599754333496,
      "text": " afar off. Thou understandest my thought afar off. Look at verse chapter 147 here"
    },
    {
      "id": 3,
      "start": 621.2599754333496,
      "end": 629.3399753570557,
      "text": " in the book of Psalms and look at verses four and five. I love looking at Psalm"
    },
    {
      "id": 4,
      "start": 629.3399753570557,
      "end": 634.2199745178223,
      "text": " 147 verse number four when you couple it with the truth of the the record of"
    },
    {
      "id": 5,
      "start": 634.2199745178223,
      "end": 638.8599739074707,
      "text": " creation that God gives us in Genesis 1 and verse 16 where the last several"
    },
    {
      "id": 6,
      "start": 638.8599739074707,
      "end": 643.5799751281738,
      "text": " words of that verse say he made the stars also and we know that there's a"
    },
    {
      "id": 7,
      "start": 643.5799751281738,
      "end": 648.5799751281738,
      "text": " great number of stars and here it tells us in Psalm 147 in verse number four he"
    },
    {
      "id": 8,
      "start": 648.5799751281738,
      "end": 655.0599746704102,
      "text": " telleth the number of the stars and then it says this he calleth them all by"
    },
    {
      "id": 9,
      "start": 655.0599746704102,
      "end": 662.1399765014648,
      "text": " their names. Verse five great is our Lord and of great power again the"
    },
    {
      "id": 10,
      "start": 662.1399765014648,
      "end": 666.2999725341797,
      "text": " omnipotence of God but notice the last phrase of verse number five his"
    },
    {
      "id": 11,
      "start": 666.2999725341797,
      "end": 672.2999725341797,
      "text": " understanding is infinite. His understanding is infinite. Paul says this"
    },
    {
      "id": 12,
      "start": 672.2999725341797,
      "end": 677.1799774169922,
      "text": " in Romans chapter 11 as he's writing here about this very subject of the"
    },
    {
      "id": 13,
      "start": 677.1799774169922,
      "end": 682.5799789428711,
      "text": " wisdom of God and we again understand that our God is omniscient. He has all"
    },
    {
      "id": 14,
      "start": 682.5799789428711,
      "end": 688.8199768066406,
      "text": " knowledge perfect knowledge and here as as Paul would rightly conclude and"
    },
    {
      "id": 15,
      "start": 688.8199768066406,
      "end": 693.1799774169922,
      "text": " obviously it's it's the Word of God but notice what is said here it's such a"
    },
    {
      "id": 16,
      "start": 693.1799774169922,
      "end": 700.2599792480469,
      "text": " beautiful portion of Scripture in verse number 33 of Romans 11. Oh the depth of"
    },
    {
      "id": 17,
      "start": 700.4199752807617,
      "end": 708.1799774169922,
      "text": " the riches both of the wisdom and knowledge of God how unsearchable are"
    },
    {
      "id": 18,
      "start": 708.1799774169922,
      "end": 715.5399780273438,
      "text": " his judgments and his ways past finding out for who hath known the mind of the"
    },
    {
      "id": 19,
      "start": 715.5399780273438,
      "end": 722.2599792480469,
      "text": " Lord or who hath been his counselor or who hath first given to him and it shall"
    },
    {
      "id": 20,
      "start": 722.2599792480469,
      "end": 727.0199737548828,
      "text": " be recompensed unto him again for of him and through him and to him are all"
    },
    {
      "id": 21,
      "start": 727.0199737548828,
      "end": 734.0199737548828,
      "text": " things notice to whom be glory forever amen. We understand this evening that our"
    },
    {
      "id": 22,
      "start": 734.0199737548828,
      "end": 739.4599761962891,
      "text": " God is omniscient he has all knowledge all wisdom that ought to cause us to"
    },
    {
      "id": 23,
      "start": 739.4599761962891,
      "end": 744.6999816894531,
      "text": " rejoice when we understand listen I don't have all wisdom and all knowledge"
    },
    {
      "id": 24,
      "start": 744.6999816894531,
      "end": 748.2599792480469,
      "text": " and neither do you there are times in which we wish we did there are times in"
    },
    {
      "id": 25,
      "start": 748.2599792480469,
      "end": 752.7399749755859,
      "text": " which we knew we could figure out all of the problems of life but the reality"
    },
    {
      "id": 26,
      "start": 752.7399749755859,
      "end": 756.1399688720703,
      "text": " this evening is that as we begin to look at these attributes and understand who"
    },
    {
      "id": 27,
      "start": 756.1399688720703,
      "end": 761.0599822998047,
      "text": " God is that we stand in all of him but we also rejoice and praise him and"
    },
    {
      "id": 28,
      "start": 761.0599822998047,
      "end": 766.9399719238281,
      "text": " recognize that that we're his children and so when I lack wisdom I know the one"
    },
    {
      "id": 29,
      "start": 766.9399719238281,
      "end": 772.3799743652344,
      "text": " who possesses all wisdom that I can go to him in prayer and seek his face and"
    },
    {
      "id": 30,
      "start": 772.3799743652344,
      "end": 777.7399749755859,
      "text": " ask him for that wisdom that he promises to give and what a blessing that is"
    },
    {
      "id": 31,
      "start": 777.7399749755859,
      "end": 782.5799713134766,
      "text": " number two not only that God is omniscient God is omnipotent and in this"
    },
    {
      "id": 32,
      "start": 782.5799713134766,
      "end": 788.3799743652344,
      "text": " reveals to us that he has all power he has perfect power Job 9 4 is a great"
    },
    {
      "id": 33,
      "start": 788.3799743652344,
      "end": 792.7799682617188,
      "text": " verse really that kind of several of these already have dealt with both the"
    },
    {
      "id": 34,
      "start": 792.7799682617188,
      "end": 798.4599761962891,
      "text": " omniscience and the omnipotence of God but I love what Job 9 4 reveals to us"
    },
    {
      "id": 35,
      "start": 798.4599761962891,
      "end": 804.4999694824219,
      "text": " about both of these first two attributes that we deal with and in here Job is"
    },
    {
      "id": 36,
      "start": 804.4999694824219,
      "end": 808.4199829101562,
      "text": " replying to one of those that have been referenced as being his friends and of"
    },
    {
      "id": 37,
      "start": 808.4199829101562,
      "end": 813.4199829101562,
      "text": " course they're miserable comforters but he says in verse number four of Job 9 he"
    },
    {
      "id": 38,
      "start": 813.4199829101562,
      "end": 820.1799774169922,
      "text": " speaking of God is wise in heart and mighty in strength who hath hardened"
    },
    {
      "id": 39,
      "start": 820.1799774169922,
      "end": 822.7799682617188,
      "text": " himself against him and hath prospered but I want you to notice the first"
    },
    {
      "id": 40,
      "start": 822.7799682617188,
      "end": 827.2599792480469,
      "text": " portion of verse number four that he's wise in heart and mighty in strength I'm"
    },
    {
      "id": 41,
      "start": 827.2599792480469,
      "end": 831.5799713134766,
      "text": " thankful that God is omniscient but I'm also thankful that he's omnipotent he"
    },
    {
      "id": 42,
      "start": 831.5799713134766,
      "end": 838.2599792480469,
      "text": " has all wisdom all perfect knowledge but he also has all power so he knows what"
    },
    {
      "id": 43,
      "start": 838.5799713134766,
      "end": 843.8599700927734,
      "text": " has to be done and he has the power to do it there are times in which we could"
    },
    {
      "id": 44,
      "start": 843.8599700927734,
      "end": 847.6999816894531,
      "text": " look at different circumstances in which we have in life and we say I'm not sure"
    },
    {
      "id": 45,
      "start": 847.6999816894531,
      "end": 853.7399749755859,
      "text": " how to do it but maybe I have the the power the strength to do whatever the"
    },
    {
      "id": 46,
      "start": 853.7399749755859,
      "end": 858.2599792480469,
      "text": " task is and maybe we lean on somebody else's wisdom and we say you tell me how"
    },
    {
      "id": 47,
      "start": 858.2599792480469,
      "end": 863.0999755859375,
      "text": " to do this and I'll do it I don't have the knowledge to do it but I have the"
    },
    {
      "id": 48,
      "start": 863.0999755859375,
      "end": 867.3799743652344,
      "text": " strength to be able to do it in in reverse form there are some that have"
    },
    {
      "id": 49,
      "start": 867.3799743652344,
      "end": 870.4199829101562,
      "text": " the knowledge to know how to do it but they no longer have the physical"
    },
    {
      "id": 50,
      "start": 870.4199829101562,
      "end": 875.9399719238281,
      "text": " abilities to do it and we understand that as human beings in life but we"
    },
    {
      "id": 51,
      "start": 875.9399719238281,
      "end": 881.0199890136719,
      "text": " understand that our God he has all wisdom and he has all power he knows"
    },
    {
      "id": 52,
      "start": 881.0199890136719,
      "end": 885.5399780273438,
      "text": " what to do and he has the power to do it and that ought to cause us to rejoice"
    },
    {
      "id": 53,
      "start": 885.5399780273438,
      "end": 890.8199768066406,
      "text": " this evening he says to to Abraham we won't turn there for sake of time but in"
    },
    {
      "id": 54,
      "start": 890.8199768066406,
      "end": 896.4999694824219,
      "text": " Genesis 18 14 he asked that question is anything too hard for the Lord and"
    },
    {
      "id": 55,
      "start": 896.5799865722656,
      "end": 900.2599792480469,
      "text": " really we understand what he's saying when he asked that question of Abraham"
    },
    {
      "id": 56,
      "start": 900.2599792480469,
      "end": 903.7799682617188,
      "text": " he's saying to Abraham he's already introduced himself and revealed himself"
    },
    {
      "id": 57,
      "start": 903.7799682617188,
      "end": 908.1399841308594,
      "text": " as being El Shaddai the Lord God Almighty in that same text of Scripture"
    },
    {
      "id": 58,
      "start": 908.1399841308594,
      "end": 913.8999633789062,
      "text": " and he's saying this to Abraham there's nothing too hard for me I have all power"
    },
    {
      "id": 59,
      "start": 913.8999633789062,
      "end": 920.1399841308594,
      "text": " Jeremiah recognized that we find that Jesus says this in Matthew 28 a portion"
    },
    {
      "id": 60,
      "start": 920.1399841308594,
      "end": 923.219970703125,
      "text": " of Scripture that we often reference when we speak about the Great Commission"
    },
    {
      "id": 61,
      "start": 923.219970703125,
      "end": 929.0199890136719,
      "text": " and these are the words of Jesus as he would ascend to heaven and of course we"
    },
    {
      "id": 62,
      "start": 929.0199890136719,
      "end": 935.4199829101562,
      "text": " see the the truth in all of the Gospels with regard to the Great Commission and"
    },
    {
      "id": 63,
      "start": 935.4199829101562,
      "end": 939.8999633789062,
      "text": " here Jesus says this and as it's recorded by Matthew in verse 18 of"
    },
    {
      "id": 64,
      "start": 939.8999633789062,
      "end": 944.6999816894531,
      "text": " Matthew 28 he came and spake unto them saying all power is given unto me in"
    },
    {
      "id": 65,
      "start": 944.6999816894531,
      "end": 952.6199645996094,
      "text": " heaven and in earth aren't you thankful that God has all power in fact Revelation"
    },
    {
      "id": 66,
      "start": 952.6199645996094,
      "end": 959.3399658203125,
      "text": " 19 in verse number 6 reveals this truth to us I'll give you a moment to turn"
    },
    {
      "id": 67,
      "start": 959.3399658203125,
      "end": 965.4199829101562,
      "text": " there Revelation 19 and verse number 6 the Bible says this and I heard as it"
    },
    {
      "id": 68,
      "start": 965.4199829101562,
      "end": 969.97998046875,
      "text": " were the voice of a great multitude and as the voice of many waters and as the"
    },
    {
      "id": 69,
      "start": 969.97998046875,
      "end": 975.739990234375,
      "text": " voice of mighty thundering saying hallelujah for the Lord God omnipotent"
    },
    {
      "id": 70,
      "start": 975.739990234375,
      "end": 980.6199645996094,
      "text": " raineth you understand this evening that our God has all power and that he still"
    },
    {
      "id": 71,
      "start": 980.6199645996094,
      "end": 985.5399780273438,
      "text": " reigns he's in control and he has all power and we begin to think about the"
    },
    {
      "id": 72,
      "start": 985.5399780273438,
      "end": 989.6199645996094,
      "text": " greatness of God and we look at these first two attributes and say okay what"
    },
    {
      "id": 73,
      "start": 989.6199645996094,
      "end": 993.8599853515625,
      "text": " why do we come to this conclusion that God is great why do we make this"
    },
    {
      "id": 74,
      "start": 993.8599853515625,
      "end": 998.9399719238281,
      "text": " declaration that God is great why do we sing songs about the greatness of God"
    },
    {
      "id": 75,
      "start": 998.9399719238281,
      "end": 1003.739990234375,
      "text": " well because we can say as the psalmist said I know the Lord is great number one"
    },
    {
      "id": 76,
      "start": 1003.739990234375,
      "end": 1010.3399658203125,
      "text": " he's got all knowledge all wisdom number two he's got all power number three he"
    },
    {
      "id": 77,
      "start": 1010.6999816894531,
      "end": 1016.4599609375,
      "text": " is omnipresent he's omnipresent what do you mean by that well he's everywhere"
    },
    {
      "id": 78,
      "start": 1016.4599609375,
      "end": 1020.4999694824219,
      "text": " present God is a spirit they that worship him must worship him in spirit"
    },
    {
      "id": 79,
      "start": 1020.4999694824219,
      "end": 1025.0999755859375,
      "text": " and truth John 4 and verse 24 we understand that and we begin to think"
    },
    {
      "id": 80,
      "start": 1025.0999755859375,
      "end": 1030.8199768066406,
      "text": " about the omnipresence of God and how it would cause us as the people of God to"
    },
    {
      "id": 81,
      "start": 1030.8199768066406,
      "end": 1034.7799682617188,
      "text": " rejoice in understanding this go back to the book of Psalms if you will and we'll"
    },
    {
      "id": 82,
      "start": 1034.7799682617188,
      "end": 1039.9399719238281,
      "text": " look at a few verses of Scripture here with regard to the the truth before us"
    },
    {
      "id": 83,
      "start": 1039.9399719238281,
      "end": 1048.3399658203125,
      "text": " of the omnipresence of God the psalmist here in Psalm 139 we mentioned the"
    },
    {
      "id": 84,
      "start": 1048.3399658203125,
      "end": 1051.5399780273438,
      "text": " first two verses we looked at the omniscience of God and as you look at"
    },
    {
      "id": 85,
      "start": 1051.5399780273438,
      "end": 1056.1799621582031,
      "text": " verse number 7 down through verse number 12 you see the psalmist is referencing"
    },
    {
      "id": 86,
      "start": 1056.1799621582031,
      "end": 1060.6599731445312,
      "text": " here and his understanding of the omnipresence of God it says this wither"
    },
    {
      "id": 87,
      "start": 1060.6599731445312,
      "end": 1067.0999755859375,
      "text": " shall I go from thy spirit or wither shall I flee from thy presence if I"
    },
    {
      "id": 88,
      "start": 1067.0999755859375,
      "end": 1071.9399719238281,
      "text": " ascend up into heaven thou art there if I make my bed in hell behold thou art"
    },
    {
      "id": 89,
      "start": 1071.9399719238281,
      "end": 1075.6599731445312,
      "text": " there if I take the wings of the morning and dwell in the uttermost parts of the"
    },
    {
      "id": 90,
      "start": 1075.6599731445312,
      "end": 1080.8599853515625,
      "text": " sea even there shall thy hand lead me and the right hand shall hold me if I"
    },
    {
      "id": 91,
      "start": 1080.8599853515625,
      "end": 1084.9399719238281,
      "text": " say surely the darkness shall cover me even the night shall be light about me"
    },
    {
      "id": 92,
      "start": 1084.9399719238281,
      "end": 1089.219970703125,
      "text": " yea the darkness hideth not from thee but the night shineth as the day the"
    },
    {
      "id": 93,
      "start": 1089.219970703125,
      "end": 1095.0999755859375,
      "text": " darkness and the light are both alike to thee and the psalmist is revealing to us"
    },
    {
      "id": 94,
      "start": 1095.0999755859375,
      "end": 1099.6199645996094,
      "text": " in these verses of Scripture this truth with regard to the omnipresence of God"
    },
    {
      "id": 95,
      "start": 1099.6199645996094,
      "end": 1103.4999694824219,
      "text": " that is everywhere present no doubt there have been times in our lives that"
    },
    {
      "id": 96,
      "start": 1103.4999694824219,
      "end": 1108.8199768066406,
      "text": " we wish we could be at two places at the same time you know I wish I could be"
    },
    {
      "id": 97,
      "start": 1108.8199768066406,
      "end": 1111.8599853515625,
      "text": " over here taking care of that I wish I could be over here doing this but we"
    },
    {
      "id": 98,
      "start": 1111.8599853515625,
      "end": 1116.8599853515625,
      "text": " can't we're limited we can be at one place at one time and it doesn't matter"
    },
    {
      "id": 99,
      "start": 1116.8599853515625,
      "end": 1120.1799926757812,
      "text": " how many people are vying for our attention it doesn't matter how many"
    },
    {
      "id": 100,
      "start": 1120.3399658203125,
      "end": 1125.4599609375,
      "text": " things need to be addressed we are limited of being in one place at one"
    },
    {
      "id": 101,
      "start": 1125.4599609375,
      "end": 1129.699951171875,
      "text": " time but our God is omnipresent he's everywhere present it would begin to"
    },
    {
      "id": 102,
      "start": 1129.699951171875,
      "end": 1134.0999755859375,
      "text": " think about that truth and obviously that truth would bring comfort to the"
    },
    {
      "id": 103,
      "start": 1134.0999755859375,
      "end": 1139.2599487304688,
      "text": " people of God as his children as we would be mindful of verses of Scripture"
    },
    {
      "id": 104,
      "start": 1139.2599487304688,
      "end": 1143.3399658203125,
      "text": " like Matthew 28 and verse number 20 he gave in verse number 18 that he has all"
    },
    {
      "id": 105,
      "start": 1143.3399658203125,
      "end": 1148.2599487304688,
      "text": " power given unto him in verse number 20 at the end of the Great Commission he"
    },
    {
      "id": 106,
      "start": 1148.2999877929688,
      "end": 1153.6199951171875,
      "text": " says in lo I am with you always and you think about that comfort that the child"
    },
    {
      "id": 107,
      "start": 1153.6199951171875,
      "end": 1158.0199584960938,
      "text": " of God will receive by understanding that God has promised to be with us in"
    },
    {
      "id": 108,
      "start": 1158.0199584960938,
      "end": 1162.8999633789062,
      "text": " Hebrews 13 in verse number 5 he said I will never leave thee nor forsake thing"
    },
    {
      "id": 109,
      "start": 1162.8999633789062,
      "end": 1168.5399780273438,
      "text": " and as the the people of God to know even as the psalmist in that very"
    },
    {
      "id": 110,
      "start": 1168.5399780273438,
      "end": 1172.0999755859375,
      "text": " familiar portion of Scripture in Psalm 23 yea though I walk through the valley"
    },
    {
      "id": 111,
      "start": 1172.0999755859375,
      "end": 1178.0999755859375,
      "text": " of the shadow of death I will fear no evil why for thou art with me and what"
    },
    {
      "id": 112,
      "start": 1178.5399780273438,
      "end": 1183.2599487304688,
      "text": " joy and comfort that brings to the child of God and when you're in the place"
    },
    {
      "id": 113,
      "start": 1183.2599487304688,
      "end": 1187.1399536132812,
      "text": " where you are and I'm in the place where I am and we're not in the presence of"
    },
    {
      "id": 114,
      "start": 1187.1399536132812,
      "end": 1191.97998046875,
      "text": " one another we can have this confidence that God is with you just as he's with"
    },
    {
      "id": 115,
      "start": 1191.97998046875,
      "end": 1198.7799682617188,
      "text": " me and that's amazing the greatness of God that he's omnipresent notice not"
    },
    {
      "id": 116,
      "start": 1198.7799682617188,
      "end": 1202.4199829101562,
      "text": " only does it bring comfort to"
    },
    {
      "id": 0,
      "start": 1202.4199829101562,
      "end": 1206.0599830150604,
      "text": " to the child of God, but I believe that it also can bring some conviction to the child"
    },
    {
      "id": 1,
      "start": 1206.0599830150604,
      "end": 1208.8999829292297,
      "text": " of God, for God is in every place."
    },
    {
      "id": 2,
      "start": 1208.8999829292297,
      "end": 1213.2999830245972,
      "text": " In Proverbs 15, if you want to jot down just a couple of verses of Scripture, notice what"
    },
    {
      "id": 3,
      "start": 1213.2999830245972,
      "end": 1217.3399829864502,
      "text": " the Bible says in Proverbs 15, and we'll look at a verse over in the book of Jeremiah as"
    },
    {
      "id": 4,
      "start": 1217.3399829864502,
      "end": 1218.8599834442139,
      "text": " well."
    },
    {
      "id": 5,
      "start": 1218.8599834442139,
      "end": 1224.179983139038,
      "text": " In Proverbs 15, in verse number 3, the Bible says this, the eyes of the Lord are in every"
    },
    {
      "id": 6,
      "start": 1224.179983139038,
      "end": 1227.8999824523926,
      "text": " place, beholding the evil and the good."
    },
    {
      "id": 7,
      "start": 1227.8999824523926,
      "end": 1231.93998336792,
      "text": " Man, don't you wish sometimes you had eyes in all the places that you thought you need"
    },
    {
      "id": 8,
      "start": 1231.93998336792,
      "end": 1233.6599826812744,
      "text": " to have eyes?"
    },
    {
      "id": 9,
      "start": 1233.6599826812744,
      "end": 1236.93998336792,
      "text": " How many of you moms ever said that you had mom eyes?"
    },
    {
      "id": 10,
      "start": 1236.93998336792,
      "end": 1240.93998336792,
      "text": " Holly calls them back eyes, and what does she mean by that?"
    },
    {
      "id": 11,
      "start": 1240.93998336792,
      "end": 1244.8199844360352,
      "text": " Well, the kids do something and she sees them, quote unquote, and they're like, how did you"
    },
    {
      "id": 12,
      "start": 1244.8199844360352,
      "end": 1245.8199844360352,
      "text": " see me do that?"
    },
    {
      "id": 13,
      "start": 1245.8199844360352,
      "end": 1247.2999839782715,
      "text": " She said, I have mom eyes."
    },
    {
      "id": 14,
      "start": 1247.2999839782715,
      "end": 1251.2999839782715,
      "text": " Well, she's just kidding, and she noticed something that they were doing that they,"
    },
    {
      "id": 15,
      "start": 1251.2999839782715,
      "end": 1256.8599815368652,
      "text": " of course, didn't know she was watching, but the reality is that God sees everything."
    },
    {
      "id": 16,
      "start": 1256.8599815368652,
      "end": 1261.659984588623,
      "text": " The eyes of the Lord are in every place, beholding the good and the evil, and we see"
    },
    {
      "id": 17,
      "start": 1261.659984588623,
      "end": 1267.9399795532227,
      "text": " that, and we, the evil and the good, I quote it in reverse order, but we find that God"
    },
    {
      "id": 18,
      "start": 1267.9399795532227,
      "end": 1270.2599792480469,
      "text": " is omnipresent and that He sees all things."
    },
    {
      "id": 19,
      "start": 1270.2599792480469,
      "end": 1274.9399795532227,
      "text": " Notice what Jeremiah says in Jeremiah chapter 23."
    },
    {
      "id": 20,
      "start": 1274.9399795532227,
      "end": 1282.8199844360352,
      "text": " Jeremiah is, of course, prophesying to rebellious Judah, and you can look through and see much"
    },
    {
      "id": 21,
      "start": 1282.8199844360352,
      "end": 1288.97998046875,
      "text": " of the prophecies that are given in dealing with these folks that are not repentant."
    },
    {
      "id": 22,
      "start": 1288.97998046875,
      "end": 1295.6999816894531,
      "text": " And here, notice with me in verse number 21 of Jeremiah 23, I have not sent these prophets,"
    },
    {
      "id": 23,
      "start": 1295.6999816894531,
      "end": 1300.6999816894531,
      "text": " yea, they ran, I have not spoken to them, yet they prophesied, but if they had stood"
    },
    {
      "id": 24,
      "start": 1300.6999816894531,
      "end": 1305.099983215332,
      "text": " in my counsel and had caused my people to hear my words, then they should have turned"
    },
    {
      "id": 25,
      "start": 1305.099983215332,
      "end": 1308.0199813842773,
      "text": " them from their evil way and from the evil of their doings."
    },
    {
      "id": 26,
      "start": 1308.0199813842773,
      "end": 1313.1399841308594,
      "text": " Am I a God at hand, saith the Lord, and not a God afar off?"
    },
    {
      "id": 27,
      "start": 1313.1399841308594,
      "end": 1316.8999862670898,
      "text": " Notice what he says in verse 24, can any hide himself in secret places that I shall not"
    },
    {
      "id": 28,
      "start": 1316.8999862670898,
      "end": 1319.6599807739258,
      "text": " see him, saith the Lord?"
    },
    {
      "id": 29,
      "start": 1319.6599807739258,
      "end": 1324.2599792480469,
      "text": " Do not I fill heaven and earth, saith the Lord?"
    },
    {
      "id": 30,
      "start": 1324.2599792480469,
      "end": 1328.5799865722656,
      "text": " Ezekiel, in particular, we don't take time to go over there and look at the portion of"
    },
    {
      "id": 31,
      "start": 1328.5799865722656,
      "end": 1332.739990234375,
      "text": " Scripture, but Ezekiel is prophesying and he's dealing with those that have been taken"
    },
    {
      "id": 32,
      "start": 1332.739990234375,
      "end": 1338.459976196289,
      "text": " into captivity, and there are some that have that idea that, well, no one sees what I'm"
    },
    {
      "id": 33,
      "start": 1338.459976196289,
      "end": 1344.3399810791016,
      "text": " doing, but God is aware of it because God is omnipresent, he's everywhere."
    },
    {
      "id": 34,
      "start": 1344.3399810791016,
      "end": 1348.97998046875,
      "text": " So we see this evening he's omniscient, he's omnipotent, he's omnipresent."
    },
    {
      "id": 35,
      "start": 1348.97998046875,
      "end": 1352.2599792480469,
      "text": " Number four, God is immutable."
    },
    {
      "id": 36,
      "start": 1352.2599792480469,
      "end": 1353.2599792480469,
      "text": " He's immutable."
    },
    {
      "id": 37,
      "start": 1353.2599792480469,
      "end": 1354.2599792480469,
      "text": " What do we mean by that?"
    },
    {
      "id": 38,
      "start": 1354.2599792480469,
      "end": 1357.3399810791016,
      "text": " Well, he's always the same, he never changes."
    },
    {
      "id": 39,
      "start": 1357.3399810791016,
      "end": 1361.8599853515625,
      "text": " I've often said, and I'll repeat it again this evening, that I believe that this is"
    },
    {
      "id": 40,
      "start": 1361.97998046875,
      "end": 1366.1399841308594,
      "text": " really, quote-unquote, the glue of Bible doctrine."
    },
    {
      "id": 41,
      "start": 1366.1399841308594,
      "end": 1371.2999877929688,
      "text": " And the reason that I say that is because if God was not immutable, how would we know"
    },
    {
      "id": 42,
      "start": 1371.2999877929688,
      "end": 1376.0599822998047,
      "text": " how to approach him from generation to generation, from era to era?"
    },
    {
      "id": 43,
      "start": 1376.0599822998047,
      "end": 1381.7799835205078,
      "text": " We would have a lack of knowledge as to how to approach him because he changes."
    },
    {
      "id": 44,
      "start": 1381.7799835205078,
      "end": 1388.8599853515625,
      "text": " But the reality is that God has revealed to us in his Word that he is immutable, that"
    },
    {
      "id": 45,
      "start": 1388.8599853515625,
      "end": 1394.6599884033203,
      "text": " he does not change, and therefore, because he does not change, we can take the truth"
    },
    {
      "id": 46,
      "start": 1394.6599884033203,
      "end": 1399.8599853515625,
      "text": " of the Word of God that was given to us and we can say he's the same because he said"
    },
    {
      "id": 47,
      "start": 1399.8599853515625,
      "end": 1400.8599853515625,
      "text": " he didn't change."
    },
    {
      "id": 48,
      "start": 1400.8599853515625,
      "end": 1403.6199798583984,
      "text": " And so God is just as holy today as he's ever been."
    },
    {
      "id": 49,
      "start": 1403.6199798583984,
      "end": 1405.7999877929688,
      "text": " He's just as powerful today as he's ever been."
    },
    {
      "id": 50,
      "start": 1405.7999877929688,
      "end": 1408.0599822998047,
      "text": " He's just as wise today as he's ever been."
    },
    {
      "id": 51,
      "start": 1408.0599822998047,
      "end": 1409.0599822998047,
      "text": " Why?"
    },
    {
      "id": 52,
      "start": 1409.0599822998047,
      "end": 1411.0599822998047,
      "text": " Because he doesn't change."
    },
    {
      "id": 53,
      "start": 1411.0599822998047,
      "end": 1416.3799896240234,
      "text": " And we understand that people are saved today the same way they were saved when Paul was"
    },
    {
      "id": 54,
      "start": 1416.3799896240234,
      "end": 1418.3799896240234,
      "text": " preaching, right?"
    },
    {
      "id": 55,
      "start": 1418.3799896240234,
      "end": 1423.4199829101562,
      "text": " Salvation is through the finished work of the Lord Jesus Christ on the cross of Calvary."
    },
    {
      "id": 56,
      "start": 1423.4199829101562,
      "end": 1429.8599853515625,
      "text": " And we can rejoice in understanding that God has given us the Word of God."
    },
    {
      "id": 57,
      "start": 1429.8599853515625,
      "end": 1431.8199768066406,
      "text": " He's given us the plan of redemption."
    },
    {
      "id": 58,
      "start": 1431.8199768066406,
      "end": 1436.5799865722656,
      "text": " He's revealed to us what pleases him, what does not please him, and we can have this"
    },
    {
      "id": 59,
      "start": 1436.5799865722656,
      "end": 1439.97998046875,
      "text": " confidence in this book because he doesn't change."
    },
    {
      "id": 60,
      "start": 1439.97998046875,
      "end": 1440.97998046875,
      "text": " He's the same."
    },
    {
      "id": 61,
      "start": 1440.97998046875,
      "end": 1444.8999786376953,
      "text": " Malachi says this, speaking of the attribute of God."
    },
    {
      "id": 62,
      "start": 1444.8999786376953,
      "end": 1455.0999755859375,
      "text": " He says in Malachi chapter number 3 and verse number 6, he says, I am the Lord, I change"
    },
    {
      "id": 63,
      "start": 1455.0999755859375,
      "end": 1456.0999755859375,
      "text": " not."
    },
    {
      "id": 64,
      "start": 1456.0999755859375,
      "end": 1463.6999816894531,
      "text": " Therefore, ye sons of Jacob are not consumed."
    },
    {
      "id": 65,
      "start": 1463.6999816894531,
      "end": 1471.5399780273438,
      "text": " Hebrews 13 and verse number 8 says, Jesus Christ, the same yesterday and today and forever."
    },
    {
      "id": 66,
      "start": 1471.5399780273438,
      "end": 1475.6599731445312,
      "text": " Now we have relationships with people in life."
    },
    {
      "id": 67,
      "start": 1475.6599731445312,
      "end": 1480.6999816894531,
      "text": " You know, the people that we have relationships with, we'd say that people change, right?"
    },
    {
      "id": 68,
      "start": 1480.6999816894531,
      "end": 1482.0999755859375,
      "text": " Do you agree with that?"
    },
    {
      "id": 69,
      "start": 1482.0999755859375,
      "end": 1483.0999755859375,
      "text": " People change."
    },
    {
      "id": 70,
      "start": 1483.0999755859375,
      "end": 1491.8599853515625,
      "text": " In fact, sometimes people change kind of their countenance and their dealings might change"
    },
    {
      "id": 71,
      "start": 1491.8599853515625,
      "end": 1494.6599731445312,
      "text": " even in a single day."
    },
    {
      "id": 72,
      "start": 1494.6599731445312,
      "end": 1498.3599853515625,
      "text": " And sometimes we can struggle with how we approach individuals because we don't know"
    },
    {
      "id": 73,
      "start": 1498.3599853515625,
      "end": 1504.5199890136719,
      "text": " how we're going to find them and what spirit or attitude they will be in, right?"
    },
    {
      "id": 74,
      "start": 1504.5199890136719,
      "end": 1506.6399841308594,
      "text": " We understand that in life."
    },
    {
      "id": 75,
      "start": 1506.6399841308594,
      "end": 1508.47998046875,
      "text": " But God changes not."
    },
    {
      "id": 76,
      "start": 1508.47998046875,
      "end": 1509.47998046875,
      "text": " He's the same."
    },
    {
      "id": 77,
      "start": 1509.47998046875,
      "end": 1512.2799682617188,
      "text": " He says, I am the Lord, I change not."
    },
    {
      "id": 78,
      "start": 1512.2799682617188,
      "end": 1515.2799682617188,
      "text": " Therefore, ye sons of Jacob are not consumed."
    },
    {
      "id": 79,
      "start": 1515.2799682617188,
      "end": 1521.3199768066406,
      "text": " And I'm so thankful this evening that God has revealed to us in his word that he's immutable."
    },
    {
      "id": 80,
      "start": 1521.3199768066406,
      "end": 1523.0399780273438,
      "text": " He doesn't change."
    },
    {
      "id": 81,
      "start": 1523.0399780273438,
      "end": 1527.3799743652344,
      "text": " Now we finish with this thought with regard to the attributes of God that we're looking"
    },
    {
      "id": 82,
      "start": 1527.3799743652344,
      "end": 1534.0199890136719,
      "text": " at this evening, the natural attributes, and that is number five, that God is eternal."
    },
    {
      "id": 83,
      "start": 1534.0199890136719,
      "end": 1535.1399841308594,
      "text": " He's eternal."
    },
    {
      "id": 84,
      "start": 1535.1399841308594,
      "end": 1536.739990234375,
      "text": " Our God has no beginning and no end."
    },
    {
      "id": 85,
      "start": 1536.739990234375,
      "end": 1541.739990234375,
      "text": " I said last week as we started our series on this doctrine of theology that the Bible"
    },
    {
      "id": 86,
      "start": 1541.739990234375,
      "end": 1547.739990234375,
      "text": " does not seek to prove the existence of God, it simply declares the existence of God."
    },
    {
      "id": 87,
      "start": 1547.739990234375,
      "end": 1549.6599731445312,
      "text": " In the beginning, God."
    },
    {
      "id": 88,
      "start": 1549.6599731445312,
      "end": 1553.9399719238281,
      "text": " We find that the Bible tells us that the heavens declare the glory of God, the firmament showeth"
    },
    {
      "id": 89,
      "start": 1553.9399719238281,
      "end": 1555.97998046875,
      "text": " forth as handiwork."
    },
    {
      "id": 90,
      "start": 1556.3399963378906,
      "end": 1562.8999938964844,
      "text": " There are the truth of the word of God, there are many references to declare to us the existence"
    },
    {
      "id": 91,
      "start": 1562.8999938964844,
      "end": 1565.97998046875,
      "text": " of God, and the Bible tells us that God is eternal."
    },
    {
      "id": 92,
      "start": 1565.97998046875,
      "end": 1568.4599914550781,
      "text": " He has no beginning and no end."
    },
    {
      "id": 93,
      "start": 1568.4599914550781,
      "end": 1571.1799926757812,
      "text": " He is alpha and omega."
    },
    {
      "id": 94,
      "start": 1571.1799926757812,
      "end": 1575.3399963378906,
      "text": " And people, I had somebody on the driveway of the parking lot not long ago, just a couple"
    },
    {
      "id": 95,
      "start": 1575.3399963378906,
      "end": 1579.8599853515625,
      "text": " of weeks ago, when I spoke to them and I was sharing truth with them about the Lord, and"
    },
    {
      "id": 96,
      "start": 1579.8599853515625,
      "end": 1585.1399841308594,
      "text": " I mentioned about God being the creator, and they said, yeah, and who created God?"
    },
    {
      "id": 97,
      "start": 1585.1399841308594,
      "end": 1587.7799682617188,
      "text": " Just kind of like that, shaking their head at me."
    },
    {
      "id": 98,
      "start": 1587.7799682617188,
      "end": 1590.8999938964844,
      "text": " And so the reality is that no one created God."
    },
    {
      "id": 99,
      "start": 1590.8999938964844,
      "end": 1591.8999938964844,
      "text": " God is God."
    },
    {
      "id": 100,
      "start": 1591.8999938964844,
      "end": 1598.4599914550781,
      "text": " He has always existed, and He's declared this truth to us in His word."
    },
    {
      "id": 101,
      "start": 1598.4599914550781,
      "end": 1606.219970703125,
      "text": " We find this night, as we look at this last thought with regard to God being eternal,"
    },
    {
      "id": 102,
      "start": 1606.219970703125,
      "end": 1611.0199890136719,
      "text": " notice what the psalmist says in Psalm 90, in verse number 2, in Psalm 90, in verse"
    },
    {
      "id": 103,
      "start": 1611.0199890136719,
      "end": 1623.2599792480469,
      "text": " number 2, the Bible says this, Psalm 90, verse 2,"
    },
    {
      "id": 104,
      "start": 1623.2599792480469,
      "end": 1630.3799743652344,
      "text": " Before the mountains were brought forth, or ever thou hadst formed the earth and the world,"
    },
    {
      "id": 105,
      "start": 1630.3799743652344,
      "end": 1639.6199951171875,
      "text": " Then from everlasting to everlasting thou art God."
    },
    {
      "id": 106,
      "start": 1639.6199951171875,
      "end": 1644.5399780273438,
      "text": " We think about the eternality of God, we understand in Revelation chapter 1, I'll just give you"
    },
    {
      "id": 107,
      "start": 1644.5399780273438,
      "end": 1648.6999816894531,
      "text": " the reference, I want to look at a passage over to Exodus here as we conclude, but in"
    },
    {
      "id": 108,
      "start": 1648.6999816894531,
      "end": 1653.4999694824219,
      "text": " Revelation 1, verse number 4, and then again in verse number 8, the Bible talks about the"
    },
    {
      "id": 109,
      "start": 1653.4999694824219,
      "end": 1659.3799743652344,
      "text": " fact that our God is eternal, He is, He was, He is to come, I am alpha and omega, the beginning"
    },
    {
      "id": 110,
      "start": 1659.3799743652344,
      "end": 1663.739990234375,
      "text": " and the end, the first and the last, He's the Almighty, according to verse number 8"
    },
    {
      "id": 111,
      "start": 1663.739990234375,
      "end": 1670.0999755859375,
      "text": " of Revelation 1, and how we can rejoice in understanding the truth of the eternality"
    },
    {
      "id": 112,
      "start": 1670.0999755859375,
      "end": 1676.4999694824219,
      "text": " of God, remember it was when Jesus, there in John chapter 1, John the Baptist is speaking"
    },
    {
      "id": 113,
      "start": 1676.4999694824219,
      "end": 1680.9399719238281,
      "text": " about Jesus, and he says, there comes one after me who is preferred above me because"
    },
    {
      "id": 114,
      "start": 1680.9399719238281,
      "end": 1686.2999877929688,
      "text": " He was before me, and when you think about that whole context of what John the Baptist"
    },
    {
      "id": 115,
      "start": 1686.2999877929688,
      "end": 1691.3799743652344,
      "text": " is speaking of, he's speaking of the coming of the Lord Jesus Christ, and the reality"
    },
    {
      "id": 116,
      "start": 1691.3799743652344,
      "end": 1697.8199768066406,
      "text": " is that John the Baptist, physically speaking, was older, Elizabeth gave birth before Mary"
    },
    {
      "id": 117,
      "start": 1697.8199768066406,
      "end": 1700.9399719238281,
      "text": " did, but how was Jesus before him?"
    },
    {
      "id": 118,
      "start": 1700.9399719238281,
      "end": 1704.1399841308594,
      "text": " Well, because He's eternal."
    },
    {
      "id": 119,
      "start": 1704.1399841308594,
      "end": 1709.7799682617188,
      "text": " In John 17, we find that as Jesus is praying, He says, He speaks about the glory that He"
    },
    {
      "id": 120,
      "start": 1709.7799682617188,
      "end": 1714.5799560546875,
      "text": " had with God in eternity past."
    },
    {
      "id": 121,
      "start": 1714.5799560546875,
      "end": 1719.5799560546875,
      "text": " And I want you to notice in Exodus chapter 3, we'll finish up with this tonight, as we"
    },
    {
      "id": 122,
      "start": 1719.5799560546875,
      "end": 1724.6199951171875,
      "text": " think about the eternality of God, we'll be familiar with the passage of Scripture as"
    },
    {
      "id": 123,
      "start": 1724.6199951171875,
      "end": 1730.9400024414062,
      "text": " here God is speaking to Moses, and the call of Moses, the instruction of Moses here, that"
    },
    {
      "id": 124,
      "start": 1730.9400024414062,
      "end": 1737.4199829101562,
      "text": " we hear those words when God says to Moses, I am that I am, remember when Moses said whom"
    },
    {
      "id": 125,
      "start": 1737.4199829101562,
      "end": 1740.1799926757812,
      "text": " shall I say sent me?"
    },
    {
      "id": 126,
      "start": 1740.1799926757812,
      "end": 1741.5399780273438,
      "text": " What name should I give them?"
    },
    {
      "id": 127,
      "start": 1741.5399780273438,
      "end": 1742.6199951171875,
      "text": " What shall I say unto them?"
    },
    {
      "id": 128,
      "start": 1742.6199951171875,
      "end": 1743.6199951171875,
      "text": " And they say, what is His name?"
    },
    {
      "id": 129,
      "start": 1743.6199951171875,
      "end": 1746.0199584960938,
      "text": " And He says, I am that I am."
    },
    {
      "id": 130,
      "start": 1746.0199584960938,
      "end": 1749.7000122070312,
      "text": " Remember Jesus said in John 8, in verse number 58, when He's speaking to the religious leaders"
    },
    {
      "id": 131,
      "start": 1749.7000122070312,
      "end": 1753.8200073242188,
      "text": " of the day, He's speaking about Abraham rejoices to see his day."
    },
    {
      "id": 132,
      "start": 1753.8200073242188,
      "end": 1756.8599853515625,
      "text": " And they said, man, you're not even 50 years old, what are you talking about?"
    },
    {
      "id": 133,
      "start": 1756.8599853515625,
      "end": 1761.1799926757812,
      "text": " And He says, before Abraham was, I am."
    },
    {
      "id": 134,
      "start": 1761.1799926757812,
      "end": 1766.2999877929688,
      "text": " And we find here that in this text of Scripture in Exodus chapter 3, that the children of"
    },
    {
      "id": 135,
      "start": 1766.2999877929688,
      "end": 1769.5799560546875,
      "text": " Israel are currently in Egyptian bondage."
    },
    {
      "id": 136,
      "start": 1769.5799560546875,
      "end": 1772.0999755859375,
      "text": " They're dealing with great difficulty."
    },
    {
      "id": 137,
      "start": 1772.5799560546875,
      "end": 1778.7799682617188,
      "text": " And God is going to appear to Moses, and He appears to him in this flame of fire out of"
    },
    {
      "id": 138,
      "start": 1778.7799682617188,
      "end": 1783.6199951171875,
      "text": " the midst of a bush, and Moses in verse number 3, he says this, I will now turn aside and"
    },
    {
      "id": 139,
      "start": 1783.6199951171875,
      "end": 1786.5,
      "text": " see this great sight, why the bush is not burnt."
    },
    {
      "id": 140,
      "start": 1786.5,
      "end": 1791.97998046875,
      "text": " And God called unto him, and Moses said, here am I, and God says, the place whereon thou"
    },
    {
      "id": 141,
      "start": 1791.97998046875,
      "end": 1793.6199951171875,
      "text": " standest is holy ground."
    },
    {
      "id": 142,
      "start": 1793.6199951171875,
      "end": 1799.3800048828125,
      "text": " But notice the content of the message in which God will give to Moses."
    },
    {
      "id": 143,
      "start": 1799.3800048828125,
      "end": 1802.5799560546875,
      "text": " In verse number 6, moreover, He said, God is speaking."
    },
    {
      "id": 0,
      "start": 1802.5799560546875,
      "end": 1809.1599559783936,
      "text": " He says, I am the God of thy father, the God of Abraham, the God of Isaac, and the God"
    },
    {
      "id": 1,
      "start": 1809.1599559783936,
      "end": 1810.8999557495117,
      "text": " of Jacob."
    },
    {
      "id": 2,
      "start": 1810.8999557495117,
      "end": 1815.1199560165405,
      "text": " So understand that he is the God of the past."
    },
    {
      "id": 3,
      "start": 1815.1199560165405,
      "end": 1816.4399557113647,
      "text": " He's eternal."
    },
    {
      "id": 4,
      "start": 1816.4399557113647,
      "end": 1817.6799564361572,
      "text": " He's speaking to Moses."
    },
    {
      "id": 5,
      "start": 1817.6799564361572,
      "end": 1823.6799564361572,
      "text": " He says, I am the God of thy father, the God of Abraham, the God of Isaac, the God of Jacob."
    },
    {
      "id": 6,
      "start": 1823.6799564361572,
      "end": 1828.0599555969238,
      "text": " Moses hid his face for he was afraid to look upon God."
    },
    {
      "id": 7,
      "start": 1828.0599555969238,
      "end": 1833.3999557495117,
      "text": " Notice what the Lord says in verse number seven, I have surely seen the affliction of"
    },
    {
      "id": 8,
      "start": 1833.3999557495117,
      "end": 1838.4799575805664,
      "text": " my people, which are in Egypt, and have heard their cry by reason of their taskmasters for"
    },
    {
      "id": 9,
      "start": 1838.4799575805664,
      "end": 1841.3599548339844,
      "text": " I know their sorrows."
    },
    {
      "id": 10,
      "start": 1841.3599548339844,
      "end": 1846.0399551391602,
      "text": " And I am come down to deliver them out of the hand of the Egyptians and to bring them"
    },
    {
      "id": 11,
      "start": 1846.0399551391602,
      "end": 1849.9799575805664,
      "text": " up out of the land into a good land and a large into a land flowing with milk and honey"
    },
    {
      "id": 12,
      "start": 1849.9799575805664,
      "end": 1854.0799560546875,
      "text": " into the place of the Canaanites and the Hittites, the Amorites and the Perizzites and the Hivites"
    },
    {
      "id": 13,
      "start": 1854.0799560546875,
      "end": 1855.3999557495117,
      "text": " and the Jebusites."
    },
    {
      "id": 14,
      "start": 1855.4599571228027,
      "end": 1860.4599571228027,
      "text": " So we see in verses seven and eight that not only is God the God of the past, according"
    },
    {
      "id": 15,
      "start": 1860.4599571228027,
      "end": 1864.0599555969238,
      "text": " to verse number six, but he's the God of the present, according to verse seven and eight."
    },
    {
      "id": 16,
      "start": 1864.0599555969238,
      "end": 1866.9599533081055,
      "text": " He knew what they were actively going through."
    },
    {
      "id": 17,
      "start": 1866.9599533081055,
      "end": 1868.4599533081055,
      "text": " He knew what they were dealing with."
    },
    {
      "id": 18,
      "start": 1868.4599533081055,
      "end": 1872.6999588012695,
      "text": " He knew that by reason of the taskmasters, he said, I know their sorrows."
    },
    {
      "id": 19,
      "start": 1872.6999588012695,
      "end": 1875.5399551391602,
      "text": " I hear their cry."
    },
    {
      "id": 20,
      "start": 1875.5399551391602,
      "end": 1876.7399597167969,
      "text": " Notice he's the God of the future."
    },
    {
      "id": 21,
      "start": 1876.7399597167969,
      "end": 1880.1399536132812,
      "text": " He tells Moses this in verse number 10."
    },
    {
      "id": 22,
      "start": 1880.1399536132812,
      "end": 1886.439956665039,
      "text": " He says, come now, therefore, and I will send thee unto Pharaoh that thou mayest bring"
    },
    {
      "id": 23,
      "start": 1886.439956665039,
      "end": 1891.559959411621,
      "text": " forth my people, the children of Israel, out of Egypt."
    },
    {
      "id": 24,
      "start": 1891.559959411621,
      "end": 1892.9599533081055,
      "text": " Is that what happened?"
    },
    {
      "id": 25,
      "start": 1892.9599533081055,
      "end": 1894.9199523925781,
      "text": " Absolutely, it's what happened."
    },
    {
      "id": 26,
      "start": 1894.9199523925781,
      "end": 1895.9199523925781,
      "text": " Why?"
    },
    {
      "id": 27,
      "start": 1895.9199523925781,
      "end": 1896.9199523925781,
      "text": " Because he's eternal."
    },
    {
      "id": 28,
      "start": 1896.9199523925781,
      "end": 1901.6599578857422,
      "text": " And so he can speak God as he's revealing himself to Moses."
    },
    {
      "id": 29,
      "start": 1901.6599578857422,
      "end": 1907.4799575805664,
      "text": " He speaks about the past, the God of Abraham, Isaac, and Jacob, about the present, the current"
    },
    {
      "id": 30,
      "start": 1907.4799575805664,
      "end": 1912.0199584960938,
      "text": " affliction of the people of God in Egyptian bondage, and about the future that they were"
    },
    {
      "id": 31,
      "start": 1912.0199584960938,
      "end": 1915.1799545288086,
      "text": " going to be delivered out of Egyptian bondage."
    },
    {
      "id": 32,
      "start": 1915.1799545288086,
      "end": 1918.4599533081055,
      "text": " Our God is eternal."
    },
    {
      "id": 33,
      "start": 1918.4599533081055,
      "end": 1923.8599548339844,
      "text": " And we look this evening at these five natural attributes of God, the omniscience of God,"
    },
    {
      "id": 34,
      "start": 1923.8599548339844,
      "end": 1929.4599533081055,
      "text": " the omnipotence of God, the omnipresence of God, the immutability of God, and the eternality"
    },
    {
      "id": 35,
      "start": 1929.4599533081055,
      "end": 1934.0199584960938,
      "text": " of God, and we stand in awe of who he is."
    },
    {
      "id": 36,
      "start": 1934.8799591064453,
      "end": 1940.719955444336,
      "text": " Apart from this book, you'd never come to this conclusion."
    },
    {
      "id": 37,
      "start": 1940.719955444336,
      "end": 1946.0399627685547,
      "text": " We find, again, as I mentioned last week, that there are tribes all around the globe"
    },
    {
      "id": 38,
      "start": 1946.0399627685547,
      "end": 1948.4599609375,
      "text": " where they do not have a written revelation."
    },
    {
      "id": 39,
      "start": 1948.4599609375,
      "end": 1954.5999603271484,
      "text": " They worship some deity, they have some knowledge of there being some God, but we, because of"
    },
    {
      "id": 40,
      "start": 1954.5999603271484,
      "end": 1960.3999633789062,
      "text": " the revelation of the nature, yes, we understand there's a God, but then the revelation contained"
    },
    {
      "id": 41,
      "start": 1960.3999633789062,
      "end": 1966.2399597167969,
      "text": " within this book reveals to us who he is, his attributes."
    },
    {
      "id": 42,
      "start": 1966.2399597167969,
      "end": 1972.939956665039,
      "text": " And when we read these attributes, we stand in awe of him, and we conclude, as the Bible"
    },
    {
      "id": 43,
      "start": 1972.939956665039,
      "end": 1979.4199523925781,
      "text": " told us in Jeremiah 10 and verse number 6, for as much as there is none like unto thee,"
    },
    {
      "id": 44,
      "start": 1979.4199523925781,
      "end": 1986.4999542236328,
      "text": " O Lord, there's none like him, for thou art great."
    },
    {
      "id": 45,
      "start": 1986.4999542236328,
      "end": 1992.6399536132812,
      "text": " This evening, we've just, for a little while, scratched the surface of the greatness of"
    },
    {
      "id": 46,
      "start": 1992.6399536132812,
      "end": 2000.6799621582031,
      "text": " God, and I hope this evening that we would stand in awe of him, that we would, as we"
    },
    {
      "id": 47,
      "start": 2000.6799621582031,
      "end": 2009.0399627685547,
      "text": " look at these attributes, praise him and rejoice that we have the privilege of being called"
    },
    {
      "id": 48,
      "start": 2009.0399627685547,
      "end": 2010.0399627685547,
      "text": " his children."
    },
    {
      "id": 49,
      "start": 2010.0399627685547,
      "end": 2012.5199584960938,
      "text": " Isn't that amazing?"
    },
    {
      "id": 50,
      "start": 2012.5199584960938,
      "end": 2017.1399536132812,
      "text": " That this God, that's, if you read, I'll give you a homework assignment, quote-unquote,"
    },
    {
      "id": 51,
      "start": 2017.1399536132812,
      "end": 2020.5399627685547,
      "text": " go and read Psalm 48 before you go to bed this evening."
    },
    {
      "id": 52,
      "start": 2020.5399627685547,
      "end": 2024.4999542236328,
      "text": " It's not, it's only 15 verses or something like that, it's not very long, but Psalm 48"
    },
    {
      "id": 53,
      "start": 2024.4999542236328,
      "end": 2029.2599487304688,
      "text": " starts out with a song that we sing, Psalm 48, 1 and 2, great is the Lord, right?"
    },
    {
      "id": 54,
      "start": 2029.2599487304688,
      "end": 2030.8199615478516,
      "text": " We sing it, greatly to be praised, right?"
    },
    {
      "id": 55,
      "start": 2030.8199615478516,
      "end": 2036.0199584960938,
      "text": " We sing about the greatness of God, and the last verse of that passage says this, for"
    },
    {
      "id": 56,
      "start": 2036.0199584960938,
      "end": 2046.1599578857422,
      "text": " this God is our God, and oh, how that ought to cause us to rejoice, and really to be humbled"
    },
    {
      "id": 57,
      "start": 2046.1599578857422,
      "end": 2051.3599548339844,
      "text": " that we have the privilege of knowing him, that he's revealed himself to us, he's taken"
    },
    {
      "id": 58,
      "start": 2051.3599548339844,
      "end": 2058.699951171875,
      "text": " an interest in us, and we can say with the psalmist, I know the Lord is great."
    },
    {
      "id": 59,
      "start": 2058.699951171875,
      "end": 2063.5999450683594,
      "text": " But just as the psalmist said in Psalm 145, one generation has to declare his greatness"
    },
    {
      "id": 60,
      "start": 2063.5999450683594,
      "end": 2071.0199584960938,
      "text": " to another generation, and the psalmist stands up and says, I will speak of thy greatness."
    },
    {
      "id": 61,
      "start": 2071.0199584960938,
      "end": 2077.219970703125,
      "text": " And this evening, we need to, in like fashion, stand up with the psalmist and say, I know"
    },
    {
      "id": 62,
      "start": 2077.219970703125,
      "end": 2085.2599487304688,
      "text": " the Lord is great, and I will speak of thy greatness, I will declare thy greatness."
    },
    {
      "id": 63,
      "start": 2085.2599487304688,
      "end": 2086.2599487304688,
      "text": " Let's pray together."
    },
    {
      "id": 64,
      "start": 2086.2599487304688,
      "end": 2089.0199584960938,
      "text": " Father, we love you, and we thank you for loving us."
    },
    {
      "id": 65,
      "start": 2089.0199584960938,
      "end": 2098.179962158203,
      "text": " We stand in awe of who you are, as we look at these verses of Scripture, as we see how"
    },
    {
      "id": 66,
      "start": 2098.179962158203,
      "end": 2107.499969482422,
      "text": " you have revealed yourself to us, Lord, we are humbled."
    },
    {
      "id": 67,
      "start": 2107.499969482422,
      "end": 2113.5399475097656,
      "text": " We're privileged to know you."
    },
    {
      "id": 68,
      "start": 2113.5399475097656,
      "end": 2118.8599548339844,
      "text": " We are aware this evening that we live in the midst of a generation of people that do"
    },
    {
      "id": 69,
      "start": 2118.8599548339844,
      "end": 2119.8599548339844,
      "text": " not know you."
    },
    {
      "id": 70,
      "start": 2119.8599548339844,
      "end": 2122.739959716797,
      "text": " They do not know the God of the Bible."
    },
    {
      "id": 71,
      "start": 2122.739959716797,
      "end": 2130.659942626953,
      "text": " God, I pray that you'd help us tonight to not only praise you and stand in awe of you,"
    },
    {
      "id": 72,
      "start": 2130.659942626953,
      "end": 2138.2599487304688,
      "text": " but Lord, help us tonight to make a commitment to declare thy greatness, that we'd seize"
    },
    {
      "id": 73,
      "start": 2138.2599487304688,
      "end": 2145.219970703125,
      "text": " the opportunities that you would give us, to let others know how great you are."
    },
    {
      "id": 74,
      "start": 2145.219970703125,
      "end": 2148.5399475097656,
      "text": " I pray that you'd bless our time of prayer."
    },
    {
      "id": 75,
      "start": 2148.5399475097656,
      "end": 2153.2999572753906,
      "text": " We thank you so much for the privilege of prayer, to know that we can enter into your"
    },
    {
      "id": 76,
      "start": 2153.2999572753906,
      "end": 2161.499969482422,
      "text": " presence to bring these petitions before thy throne, understanding that you are aware,"
    },
    {
      "id": 77,
      "start": 2161.499969482422,
      "end": 2163.699951171875,
      "text": " you are able."
    },
    {
      "id": 78,
      "start": 2163.699951171875,
      "end": 2168.3399658203125,
      "text": " I pray that you would do exceeding abundantly above all that we could ask or think."
    },
    {
      "id": 79,
      "start": 2168.3399658203125,
      "end": 2173.7799682617188,
      "text": " God, you would work in a distinct way in which you alone would be glorified, and we'll thank"
    },
    {
      "id": 80,
      "start": 2173.7799682617188,
      "end": 2174.7799682617188,
      "text": " you for it."
    },
    {
      "id": 81,
      "start": 2174.7799682617188,
      "end": 2176.7799682617188,
      "text": " In Christ's name we pray, amen."
    },
    {
      "id": 82,
      "start": 2176.7799682617188,
      "end": 2179.2599487304688,
      "text": " Let me take your prayer bulletin."
    }
  ],
  "processed_at": "2025-04-17T13:23:39.071500"
}