{
  "video_id": "J-kYeBGCnXc",
  "text": "the righteous to be moved and what a blessing. Thank you, Deborah, Pierre and Kimberly. Greatly appreciate your assistance with the special music this morning. And thanks to Jared for leading. And did you know that second song or you learned it this morning? Learned it this morning, amen. Just along with me, I'm happy I didn't mess you up too much. And I'm thankful that we have a savior. I'm thankful that we have an anchor. I'm thankful as we sang that last congregational hymn and then being mindful of our savior has invited us to cast all of our care on him. Why? Because he cares, careth for us. And we know that, we understand that truth. And thank you. What a blessing to see how those songs all fit together. Hebrews chapter number five this morning. Hebrews chapter number five. We'll be looking at the first 10 verses of Hebrews chapter number five. And let me just mention this as we even, before we get into the message this morning, the passage of scripture that is before us. Of course, we've been studying through the book of Hebrews here in 2020. We've taken the last several weeks off because of the pandemic and all that's been going on. And of course, preaching some various portions of scripture. But as we make our way back to the book of Hebrews and come to this fifth chapter, these 10 verses in Hebrews chapter number five are so important. We find that they are foundational for that which will be further developed in Hebrews seven, eight, nine, and 10. And you think about 10 verses and just the importance of these 10 verses. Of course, we understand that all of God's word is important, but as we look at the foundation that will be laid here in these 10 verses and then further developed in chapter seven through 10, it is extremely important that we understand the content of what we are given here in Hebrews five verses one through 10. If you're like my children, you say, well, what about the rest of chapter five and chapter six? And you'll remember as we've studied through the book of Hebrews, I was chatting with them this morning before the service, and you'll remember that as we've studied through the book of Hebrews, that there have been warning passages. And we will find that there's instruction given and then there's a warning passage, instruction giving a warning passage. Well, beginning in verse number 11 of chapter five and going through the sixth chapter is such a passage of a warning type of a passage. And so this foundational truth in Hebrews five verses one through 10 is of significant importance as we would understand that which is given in chapter seven through 10. Now, if you have been with us as we've studied the book of Hebrews, we understand that the writer is presenting the Lord Jesus Christ as being superior. And he is, he's superior for a whole list of reasons and we've gone through several of those as we've studied the book of Hebrews. We found that in Hebrews chapter number one, that Christ is superior to the prophets. Remember, he's writing to those that have trusted Christ as their savior, but these Jewish people that he's writing to, this book of Hebrews, the initial recipients of this book, very familiar with, of course, because of their culture and their lineage, their heritage, he's speaking to them on matters in which they would easily, quickly be able to identify with the prophets. Of course, they'd be very familiar with the prophets and he says, but Christ is superior to the prophets. We find that he then moves into the fact that Christ is superior to the angels and they would have had a level of knowledge with regard to various portions of scripture regarding the work of angels and what have you, but Christ is superior to the angels. We found in Hebrews chapter number three, that Christ is superior to Moses. Now, really kind of hitting home, if you will, because Moses was held in high regard between Moses and Abraham, two of the probably most highly regarded folks in the Old Testament. Of course, David would be in there as well, but we find that there were many references during the life and ministry of the Lord Jesus Christ where they would speak about the religious leaders, about Moses, about Abraham, and so we find here that Christ is superior to Moses. There have been a few glimpses of the truth that will be given to us in chapter number five. In chapter number two, again in chapter number four, there's been some glimpses of what will be developed here in these 10 verses and then further explained in chapter seven through 10, and that truth is that Jesus Christ in his priesthood, he is the superiority of the priesthood of Jesus Christ, and really that's what we begin to see in these 10 verses of Hebrews five. Just to remind you of what we've seen glimpses of in chapter number two, we found that in verse number 17, the Bible says, wherefore in all things it behooved him, speaking of Christ, to be made like unto his brethren, that he might be a merciful and faithful high priest in things pertaining to God, to make reconciliation for the sins of the people, for in that he himself hath suffered being tempted, he is able to succor them that are tempted. Again, in chapter number four in verses 14 and 15, we find the Bible says, seeing then that we have a great high priest that is passed into the heavens, Jesus, the son of God, let us hold fast our profession, for we have not an high priest which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are, yet without sin. Let us therefore come boldly under the thorn of grace that we may obtain mercy and find grace to help in time of need. These two passages in Hebrews two and in Hebrews chapter number four are giving us some glimpses as to what is being developed here in chapter number five. If you're taking notes, I've simply titled the message this morning, our great high priest, our great high priest. Notice with me in verse number one, the Bible says for every high priest, taken from among men is ordained for men in things pertaining to God, that he may offer both gifts and sacrifices for sins. Who can have compassion on the ignorant and on them that are out of the way, for that he himself also is compassed with infirmity. And by reason hereof, he ought as for the people, so also for himself to offer for sins. And no man taketh this honor unto himself, but he that is called of God, as was Aaron. So also Christ glorified not himself to be made an high priest, but he that said unto him, thou art my son, this today have I begotten thee. As he said also in another place, thou art a priest forever after the order of Melchizedek, who in the days of his flesh, when he had offered up prayers and supplications with strong crying and tears unto him that was able to save him from death and was heard in that he feared. Though he were a son yet learned the obedience by the things which he suffered and being made perfect, he became the author of eternal salvation to all them that obey him, called of God and high priest after the order of Melchizedek, our great high priest. We've discussed before that Jesus Christ is prophet, priest, and king. And we understand that he fills those roles. And we find here specifically the role of priests being given to us. The important factor as we get into the lesson, the message this morning, is that these recipients, these Jewish believers, they would have had a solid understanding of the Old Testament and would have understood many aspects regarding the priesthood. They're very familiar with it. In fact, as we've mentioned, through the study of the book of Hebrews, the temple is still in operation at this time historically. There are sacrifices that are still being made. All of the Jewish tradition, if you will, if we could use that terminology, but all of that Old Testament sacrificial system, it was still going on. They were suffering under persecution. There was the thought of returning to Judaism. And we find that here, throughout the book of Hebrews, the call to the people that are being addressed is not to return. Why? Because Christ is superior, that He is better, and that we need to go on. We need to go on to spiritual maturity. And really we see that in the next section, the warning section of the conclusion of chapter five and all of chapter number six on that truth of going on to spiritual maturity. And so as we understand some of these things and have an understanding of what they, as the initial recipients, would have understood, we must make note of this truth that the Old Testament was only a shadow of good things to come. We find that in Hebrews chapter number 10 laid out extensively for us. And what a joy to know that the types and all of the prophecies of the Old Testament, how they point to Messiah, the Lord Jesus Christ who would come. And of course, from our vantage point now, He has come and He's fulfilled the will of the Father. And we understand that He was crucified. He was buried. He rose in victory. He ascended to heaven. He ever liveth to make intercession for us. And one day, and I pray one day soon, He is coming back to receive us unto Himself. We've discussed thoroughly throughout the first four chapters of the book of Hebrews, the incarnation of Christ, that Jesus Christ became man, but He never gave up His deity. He is the God, man. He's a hundred percent God, a hundred. man, we've dealt with his deity, we've addressed the incarnation, we've addressed those many subjects that are given to us. We've spoken because of the passage of Scripture at the end of chapter 1 and much of chapter number 2 with regard to Christ being superior to the angels. There were some that say, yeah, but he was made a little lower than the angels, and the answers are given to us as to why that is, because he had to come not in that manner as an angel. See, an angel could not die for the sins of mankind, and he says specifically in chapter 2 and verse number 1, excuse me, verse 16, for verily he took not on him the nature of angels, but he took on him the seed of Abraham. Why? So that he could make reconciliation for the sins of the people. And what a joy to understand that which has been accomplished through the incarnation of our Lord and Savior Jesus Christ. He is God, a hundred percent God, but for that period of time he took on humanity, he took on human flesh. Why? So that he could die in our place, but pertaining to that which we see with regard to the priesthood, we find that there are other indications with regard to that which he was able to, as we find in chapter number 4 in verse 15, that he was tempted in all points yet without sin, but we have not a high priest which cannot be touched with the feeling of our infirmities. See, he took on that human form, yes, so that he could die for our sins, but we find that he also suffered through those things that he suffered. He then accomplished what nothing, what no other could ever accomplish. As we get into the passage of Scripture, I want you to notice, first of all, the pattern of the Old Testament priest. In the first four verses of Hebrews 5, we see that there's a pattern that is established in really giving the Old Testament truth with regard to what they would have been familiar with. Many of us, as we have studied the Bible and read the Bible, we've read about the priest in the Old Testament, we have a level of understanding of the priesthood and what-have-you, and so in these first four verses there's a pattern that is discussed, and really we understand, as we look at the passage, their role. It's mentioned to us in verse number 1, they are to represent man to God. It says here, in verse number 1 of chapter 5, for every high priest taken from among men is ordained for men in things pertaining to God. Notice this, as we consider their role, that he may offer both gifts and sacrifices for sins, and we'd understand, as we think about the pattern in the Old Testament, and understand he's speaking about the high priest, obviously Aaron as the first high priest, and he's mentioned in verse number 4, that they would go into the Holy of Holies on the Day of Atonement, and they would make an offering, and that was not only an offering for the sins of the people, but for their own sins, as we find in verse number 3, but we find that this was their role. You could read the Old Testament, you could read the system that's given to us in the book of Leviticus, with all of the offerings and sacrifices and what-have-you, and there were gifts, there were offerings that were brought, that were gifts, there were sacrifices that were made, and we see that it's mentioned here in verse number 1, the role of this priest. Notice in verse number 2, we see that their demeanor is mentioned. It says, who can have compassion on the ignorant and on them that are out of the way, for that he himself also is compassed with infirmity? We think about their demeanor, that they were to be compassionate. It's interesting as you would look at verse number 2 and see where it says, who can have compassion on the ignorant and on them that are out of the way? In other words, those that would be bringing the offerings, those that would be bringing the sacrifices, that they would be able to be compassionate to them, to the ones that are bringing, and then of course they would process the offering and make the offering, but they had this demeanor. They were not to be judgmental. They were to be able to be compassionate and to relate to these individuals. It's interesting as you study the Old Testament that not all were compassionate. Amen? Eli was very judgmental towards Hannah when she was praying, was he not? He says that she's drunken, right? I mean, that was his immediate understanding. There were some corrupt priests within the Old Testament system. We understand that, and we see that taking place, but we find that the pattern that was established, that what God's intent was, is that these men, notice in verse number one, that their for every high peace taken from among men is ordained for men, and they would be that representative to represent man to God, to offer gifts and sacrifice, but to do it with compassion. See, it's easy for us sometimes to be judgmental towards others that are dealing with sin and difficulty in their lives, and yet we need to be with compassion, be able to bring them along and help them to see that victory is possible through the Lord Jesus Christ. It's interesting as we make a parallel, and we'll get to it at the end of the message today, but you understand this demeanor that it's mentioned in verse number two, and it would be appropriate for us to once again reference chapter number four and verse number 15, where the Bible says that we have not, and a high priest which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are, yet without sin. And I'm so thankful that our God is compassionate. The Bible declares to us that he is a compassionate God. During the life and ministry of the Lord Jesus Christ, you find many references where the Bible says that he, Jesus, was moved with compassion, and what a joy to know that our Savior is a compassionate Savior, and we think about this pattern that is being established as these things are being set forth. Again, the foundation, the groundwork for which will be developed in a greater sense in the next several chapters, we see their role, their demeanor, notice also their call. In verse number three, it says, and by reason hereof, he all asked for the people, so also for himself, to offer for sins, dealing with those sacrifices that are mentioned in verse number one. It's important that we know, before we get to the call in verse number four, that they, when they went in to make an atonement, they had to atone for their own sins, then for the sins of the people. And we find in verse number four, it says, and no man taketh this honor unto himself, but he that is called of God as was Aaron. And it's important that we understand this pattern. Why? Because we see how that Jesus in his priesthood is superior, and we'll get to that in just a few moments, but we notice the pattern that is established, and you see that it says, no man taketh this honor unto himself, but he that is called of God. It wasn't as if somebody could come and say, hey, I volunteered to be a priest, let's have a vote, who's gonna be the high priest, okay? You put your name on the ballot there, you put... it's not how it worked. In fact, if you were to go back, and we don't have the time really to develop all of this this morning, but if you go back to the book of Exodus and you read chapters 28 and 29, you see specifically where God gave the direction to Moses to go to his brother Aaron and to establish him as the high priest. We find the consecration in chapter number 29 from the head to the feet, right? I mean, fully consecrated to the work that God would give him. We find that later in the Word of God, you see that in Exodus 28 and 29, with Aaron specifically being selected or chosen, that you then come to Numbers chapters 3 and 4, and you see that it's the tribe of Levi that is established as the tribe in which the priest would come from. If you are not from the tribe of Levi, you weren't going to be a priest. And even if you were from the tribe of Levi, but one of the other sons was your lineage, then you weren't going to be a priest, you would serve in some other capacity. And it's interesting to note, because there are references in the Old Testament, I'll just use two this morning, to reference those that sought to fulfill the office of priest when they weren't supposed to. The first reference would be in Numbers chapter 17 with Korah. Many of us are familiar with that. Numbers chapter 16, excuse me. And you see in Numbers chapter 16 there with Korah, and they were of the tribe of Levi, but they had been given specific roles to fulfill. The Kohathites there, the sons of Korah, but they wanted to do the work of the priest. And there was some rebellion that took place in Numbers 16, and something amazing happens. The earth opens up and swallows them up. The judgment of God, right? Why? Because Korah was not ordained of God to be a priest, to serve in that capacity. In the book of 2 Chronicles, in chapter number 26, the Bible tells us about Uzziah. Now Uzziah was a king. Kings didn't come from the tribe of Levi, the tribe of Judah. We find that Uzziah was a king, and as a king he could not fulfill the office of priest. Again, we're looking at glimpses of our Savior being superior, and we'll deal with that as we move forward through the Scriptures this morning. But we find that Uzziah, remember, God had blessed him, and God had helped him, and he was marvelously helped, the Bible tells us, until he was strong and pride came in. And remember, he goes in to offer. He tries to go in and do the work of a priest. The priest, they came in and they withstood him. It's not for you, Uzziah. And what happened? Leprosy. God's judgment. So we see that here, as it says, this was not a situation where men would volunteer, individuals would volunteer. No, no man taketh this honor unto himself, but he that is called of God. Then it says, as was Aaron. It's interesting, after the situation in Numbers 16, with the Korah and the sons of Korah and all of that that takes place, in Numbers 17, God records for us how the Aaron's rod budded. Do you guys remember? You remember the text of Scripture, and you remember the proof, the evidence, if you will, when they took and they took all of those rods, and it was going to be a sign from God that the one whose rod would bud was the one that would fill that office, and it was Aaron's rod that budded. And we find that as this pattern is established, this pattern in the Old Testament of the priests, the Levitical priesthood, that these recipients would have had a knowledge and understanding of these things. We find that there's a, number two if you're taking notes, the prophecy of a greater priest. So there's a pattern of the priesthood, the Levitical priesthood, but then there's a prophecy of a greater priest. We find that as we have on many occasion already through the book of Hebrews, we have found that the writer of Hebrews will use Old Testament passages and then properly apply those to the person of Jesus Christ. We find that that's exactly what he's going to do here once again. Again, these individuals would have had a good working knowledge of the Old Testament. They would have understood many of these things. Most of them would have understood many of these things, and as the writer has gone through this process, and we understand all Scripture is given by inspiration of God, and how appropriate to see how God would use these Old Testament prophecies and show, here's the proper fulfillment in the Lord Jesus Christ. These prophecies are properly applied to the Lord Jesus Christ, and we find the first one given to us in Hebrews 5, in verse number 5. Notice, so also Christ glorified not himself to be made in high priest. You see the continuation of verse number 4. These guys didn't volunteer for it, and it's saying that what he's looking at is this call, the plan of the Father. He says, but he that said unto him, notice the end of verse number 5, thou art my son, today have I begotten thee. This is a verse that was used back in Hebrews chapter number 1 as well, in verse number 5 when the Bible promises for unto which of the angels said he at any time, thou art my son, this day have I begotten thee. And again, I will be to him a father and he shall be to me a son, and we find that this verse from the Old Testament is none other than the book of Psalms, Psalm chapter number 2 and verse number 7. As we would consider the Old Testament passage of Scripture in Psalm 2 and verse number 7, we must be mindful of the fact that when the Scripture says, thou art my son, today or this day have I begotten thee, that he was not referring to the birth of Christ. Many people inappropriately or wrongfully interpret that to think that he's speaking of the birth of Christ as incarnation. No, the Scriptures as you study Scripture with Scripture, you compare Scripture with Scripture, you find that what he's speaking about is not the birth of Christ, but the resurrection of Christ. In Acts chapter number 13, notice as the Apostle Paul is preaching, in Acts chapter number 13, turn over there with me quickly if you will, and this is the first missionary journey he's going. The Apostle Paul's been sent out of the church at Antioch and he's preaching, and they're on this first missionary journey in the regions of Galatia, and he's preaching the Word of God. You'll remember that as he first arrives to Antioch and Pisidia, as it's given to us in verse number 14, that they go there on the Sabbath day to the synagogue, and as they are there, they say this at the end of verse 15, \"...Ye men and brethren, if you have any word of exhortation for the people, say on.\" And Paul says, here's my opportunity, I'm going to preach, and he does. He preaches the Word of God. Notice verse 16, \"...Then Paul stood up, and beckoning with his hand...\" That's why I use my hands when I preach, amen? He said, \"...Men of Israel, and ye that fear God, give audience.\" And he begins to go through this message. I want you to notice, we don't have time to look at all of it, but go down to verse number 33. He had gone through in verses 28, down through verse number 32, he's dealing with the death, burial, and resurrection of our Lord and Savior, Jesus Christ, and he says in verse number 33, \"...God hath fulfilled the same unto us, their children, in that he raised up Jesus again, as it is also written in the second psalm, Thou art my Son, this day have I begotten thee.\" So obviously the prophecy of Psalm 2 is with regard to the resurrection, not the birth. And we find that as we go back to the book of Hebrews, and we deal with Hebrews 5, in verse number 5, we find that the writer of Hebrews, he's referring back to a prophecy in the Old Testament, and he's appropriately applying it to the Lord Jesus Christ. Now, he's got, now think about as we're reading this, we look at the pattern of the priesthood, then we look at this prophecy, we come to Psalm 2 in verse number 7, that's referenced here in Hebrews 5 in verse number 5, oh yes, speaking about the Lord Jesus Christ. And then he goes to verse number 6, and he's going to reference another Old Testament prophecy. As he saith also in another place, that other place is Psalm 110 in verse number 4. Let me just make a note on Psalm 110, it was commonly understood and agreed to by the religious leaders, the Jewish folks, that Psalm 110 was categorized as a messianic psalm. Why is that important? Because the truth of Psalm 110 in verse number 4 is being applied here in Hebrews 5, 6, to the Lord Jesus Christ. It's a messianic psalm, it points to Messiah, Christ is the Messiah, right? Jesus is the Christ, that's what Paul preached, and proving that this man Jesus that you've seen, that you've heard about, that you observed his life and you were aware of his death and his burial and his resurrection, he is the Christ, he is the Messiah, and this messianic psalm in Psalm 110 will now be applied to the Lord Jesus Christ when he says, thou art a priest forever after the order of Melchizedek. Now, we're familiar with the priesthood of Aaron, of the Levitical priesthood, and we've just mentioned several of those things, but we find that there's an obvious change in direction that is given to us here with regard to the priesthood of the Lord Jesus Christ. Now, this is significant. Why is it significant? Because the Lord Jesus Christ, well, let me say this, as I mentioned a moment ago, priests came from the tribe of Levi. Jesus was not of the tribe of Levi. He was of the tribe of Judah. So, he could not be a priest under the Levitical priesthood. It's not possible. But he is prophet, priest, and king. By the way, the priest couldn't be a king and the king couldn't be a priest under the Levitical priesthood, but our Savior is God. He is the Lord God Omnipotent. He is prophet, priest, and king, and he's not under the order of the Levitical priesthood, but he's under the order of the Melchizedek priesthood. Now, this would go back to Genesis chapter number 14 and deal with those things that are mentioned there in verses 18 through 20. We will develop this a whole lot more in chapter number 7, and I'm not going to get into it a whole bunch this morning just because of the fact that chapter number 7 details it. Remember, this is the foundation that will be built upon in chapters 7, 8, 9, and 10. And so, what is said here is that this messianic psalm, the prophecy of a greater priest, is now, they say, listen, you're familiar with the pattern of the priesthood, but let me remind you of the prophecy of a greater priest, and he gives them the prophecy from Psalm 2, then from Psalm 110, referencing that Jesus is the fulfillment and that he would be a priest forever after the order of Melchizedek. It's mentioned again in verse number 10, called of God and high priest after the order of Melchizedek. By the way, if you read Genesis chapter number 14 and you read the interaction that is recorded there between Abraham and this one Melchizedek, he comes on the pages of Scripture and he departs the pages of Scripture in obscurity. There are just a few verses of Scripture that are mentioned about this one Melchizedek. In fact, the references in Hebrews give us far more information than what you even see in the book of Genesis. And what we find is that this man Melchizedek, he was both priest and king. And Jesus, his priesthood would be after the order of Melchizedek. Again, this is significant because of the understanding of these individuals, and now we're taking not only the pattern of the priesthood  but now we're establishing the priesthood through the prophecy that was given in the Old Testament. It's interesting, as we look at the passage of Scripture, and we find that the author, the writer of Hebrews, as he systematically goes through this process, he has given them the pattern and the prophecy. And once those two things are understood, he then presents the Lord Jesus Christ as the fulfillment of the prophecy and proves that He is superior. It's awesome. He takes and he says, let me give you the pattern, let me give you the prophecy, now let me present to you the Lord Jesus Christ and let me prove to you that He is superior. It says in verse number seven, who in the days of His flesh, you understand that in verse number seven, He'd begin to speak about His earthly ministry. And we can read in the Gospel records about the life of the Lord Jesus Christ. And it says, when He had offered up prayers and supplications with strong crying and tears unto Him that was able to save Him from death and was heard and that He feared. Let me make a note on verse number seven. There are many references in the Gospel record, excuse me, to the prayer ministry of the Lord Jesus Christ. And some have asked the question, if He's God, why does He have to pray? Because He is God. The reality is that He is God, He never ceased to be God, but He also left us an example that we should follow His steps. The Bible tells us that in the book of Peter, 1 Peter, and we find that Jesus was the perfect example. And He gave us an example. It's interesting to know that it were the disciples that came to Jesus after they had observed Him praying and said this, Lord, teach us to pray. They would not ask to be taught to pray if Jesus Himself was not engaged in prayer. Yes, He is one with the Father. He is God, but He left an example that we should follow His steps. There are a few occasions in which you find in the Word of God, three in fact, in which Jesus is praying and He cries. He weeps at the grave of Lazarus. You see the compassion of the heart of Jesus. He knew what He was going to do, but He has that compassion for Mary and Martha. And of course, He weeps there. The Bible says Jesus wept. We find that He wept over Jerusalem. He wept over the city. And then we find that He wept in the garden of Gethsemane. I believe the reference here in verse number seven would be to that time in which He prayed in the garden of Gethsemane. I want you to understand that the Bible says that with tears unto Him that was able to save Him from death and was heard and that He feared. Understand as we look at the passage of Scripture that Jesus was not praying in the garden as you read the records in the Gospels. He was not praying that He would have to avoid death. No, no, Jesus knew that's why He came. He was born to die. Remember, He says as He makes the great declaration in John chapter number 10, I am the Good Shepherd. And as the Good Shepherd, I laid down my life for the sheep. He says in chapter number 17 of the book of John, the hour is come. He knew that He was going to the cross of Calvary and He went willingly because He loved us and He understood that it required that sacrifice to be made so that mankind could be redeemed. And we find that He was not praying that death would pass from Him in the sense that He did not want to go to the cross of Calvary, but we find that I believe as you find many, many prophecies in the Old Testament, the greatest one is Psalm 22 with regard to the crucifixion. See, Jesus had to die on a cross. It's the fulfillment of prophecy. And we find that I believe as He was there in the garden, as He was sweating those great drops of blood and all that was taking place, I believe that there was a great spiritual battle that was taking place. Saint was trying to kill Jesus before He'd ever get to the cross. Not only would He be spared death in the garden so that He could go to the cross, but then on the third day as we celebrate it last week, He's gonna rise in victory, conquering sin, death, and the grave. We find that it says here, though He were a son in verse number eight, yet learned the obedience by the things which He suffered. And it's interesting as you would understand verse number eight in light of what we've been told already in chapter number four and verses 14 and 15 in understanding the way in which He's able to help us and the things that He understands. Remember in chapter number two, as we mentioned in verses 17 and 18, He came, it behooved Him to be made like unto His brethren, yes, so that He could make reconciliation for the sins of the people, but also He suffered being tempted, He's able to succor them that are tempted. We find that there were lessons that He learned through the experience of humanity that He understood in His deity. He understood because He is God, He has all knowledge, but yet in His experience in that human flesh, He's able to, or He did I should say, learn things that He's then able to succor us, help us. He is touched with the feeling of our infirmities. This is amazing, He's God, but yet there were things that experientially He learned through His earthly ministry and the things that He suffered so that He could be our great high priest. Verse number nine, notice it says, in being made perfect, you understand that this does not in any way, shape, or form lead anyone to come to the conclusion that He was not perfect, He is God. The word means complete, meaning in other words that He fulfilled that which He was sent to do. He said, I have finished the work in John 17. He completed what He was sent here to do, the mission that He had upon the earth, He completed, and it says that He became the author of eternal salvation unto all them that obey Him. I'm thankful for eternal salvation. By the way, in a few weeks, we'll get to chapter number six where people like to say that you can lose your salvation. It'd be interesting that at the end of chapter five, He would say that He's the author of eternal salvation, and then in the very next section say, you can lose your salvation. It doesn't make a whole lot of sense, and I'll develop that in greater detail as we get to chapter number six, but we find here that He became the author of eternal salvation unto all them that obey Him. What does it mean by obeying Him? Obeying the gospel, believing that what He said is true. We sang this morning, trust and obey, obeying the gospel that Christ is indeed God, that He died according to the scriptures, that He was buried according to the scriptures, that He rose again according to the scriptures, and what a blessing to have that eternal salvation, the gift of God's eternal life, through Jesus Christ our Lord. He's called of God and high priest after the order of Melchizedek. Now, I don't have much time, but you're at home, most of you, and so we have a little extra time, amen, and I hope that you'll bear with me, why? Because I wanna share with you, as I mentioned a moment ago, that He gives the pattern and the prophecy, then He presents the Lord Jesus Christ as being the fulfillment of the prophecy, but then proves that He's superior. I wanna give you five reasons this morning that Christ's priesthood is superior to that of the Levitical priesthood, and as we think about these five truths this morning that would reveal to us His superiority, understand that as you stay with us over the next several weeks, these truths will be further developed as we find in chapter seven, eight, nine, and 10, the development of these truths. In fact, as we go through these five points this morning, we will make reference to several verses within those chapters, and so let me say this, number one, five reasons that Christ's priesthood is superior. Number one, He passed through the heavens, not simply through the veil. In the Old Testament, what happened with the priest, remember, he had to go and he made to go into the Holy of Holies, he had to pass through the veil, right, that separated the holy place from the Holy of Holies, but we find that Jesus Christ, He passed through the heavens. Notice in chapter number four, in verse number 14, seeing then that we have a great high priest. Now, let me make a statement, I didn't say this earlier, but no high priest in the Old Testament was ever referred to as a great high priest. High priest, yes, but never great high priest. Jesus Christ is our great high priest. Notice it says this, that is passed into the heavens. Jesus, the Son of God, let us hold fast our profession. And so we see here in chapter number four, in verse number 14, that He's passed through the heavens. Notice in chapter number 10, in verse number 12, where the Bible tells us there with regard, and we'll mention this verse a couple of times through this list, but in Hebrews 10, in verse number 12, the Bible says, but this man, after he'd offered one sacrifice for sins forever, sat down on the right hand of God. He passed through the heavens and He's in the throne room of God, even at this very moment. See, in the Old Testament, the Levitical priesthood, they could not pass through the heavens. They were not in the throne room of God. Yes, they were in that earthly place where God chose to show His presence, to manifest His presence in the Old Testament. Yes, in the tabernacle first, but then in the temple. But we find that in Hebrews chapter nine, is we would make a contrast. The Bible says this. Speaking of the priest that went always, look in verse number six, now when these things were thus ordained, the priest went always into the first tabernacle, accomplishing the service of God. That was in the holy place. They would go in there, and they would do the service of God. But notice in verse number seven, but into the second, what is he referring to? The Holy of Holies. Where the Ark of the Covenant was, the mercy seat, right? He says that he goes into the second, look, it says this, but into the second went the high priest alone, once every year, not without blood, which he offered for himself and for the errors of the people. So we find, number one, why is Christ's priesthood superior? Well, he passed through the heavens, not simply through the veil. Number two, his offering was for the sin of the world, but not for his own. His offering was for the sin of the world, but not for his own. See, he had no sin. He did not have to make an atonement for his sin first, and then for the sin of the people. No, he could never be our Savior if he was sinful. He had no sin, and therefore his offering was an offering for the sin of the world. We notice here, again, in chapter number four and verse number 15 of Hebrews, where the Bible says, for we have not an high priest which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are yet without sin. 2 Corinthians 5 and verse number 21, for he hath made him to be sin for us who knew no sin, that we might be made the righteousness of God in him. 1 Peter chapter 3 and verse number 18, where Peter says this about the Lord Jesus Christ, for Christ also hath once suffered for sins the just for the unjust, that he might bring us to God, being put to death in the flesh, but quickened by the Spirit. See, this was in contrast to the Levitical priesthood. We found, as we mentioned in verse number 3 of Hebrews chapter number 5, that when they would go in to make these sacrifices for sins, notice in verse number 3, and by reason hereof he ought as for the people, so also for himself to offer for sins. We read already in Hebrews 9 and verse number 7, where the Bible says that he could only go into the Holy of Holies once every year, not without blood, which he offered for himself and for the errors of the people. See, Christ's priesthood is superior because his offering was for the sin of the world, but not for his own sin, because he had no sin. Number 3, why is Christ's priesthood superior? Because he conquered death and lives forever. The duration of his priesthood we mentioned in verse number 6 of Hebrews 5, where the Bible tells us that thou art a priest forever, after the order of Melchizedek. We found in verse number 9 that the Bible says that he became the author of eternal salvation. In chapter number 7, in verse number 25, speaking of our Lord and Savior Jesus Christ, our great High Priest, the Bible says in that verse of Scripture, wherefore he is able also to save them to the uttermost that come unto God by him, seeing he ever liveth to make intercession for them. Remember, as we read the passage of Scripture from the book of Revelation last week on Sunday morning to begin our message, and we noticed in Revelation 1, in verse number 18, where Jesus said, I am he that liveth and was dead, and behold, I am alive forevermore. We find that this is not the case for the Old Testament Levitical priesthood. If we think about the order of the Levitical priesthood, we understand that they died, right? Chapter number 7, in verse number 23, and they truly were many priests because they were not suffered to continue by reason of death. It's interesting, side note, if you study the Old Testament, and we'll get there eventually in the book of Joshua, if you're with us for our Joshua series on Monday, Tuesday, Thursday, and Friday. But as we go through that series, eventually, and I don't know how long from now, but eventually we'll get to the cities of refuge. It's interesting about the cities of refuge, I'll make a reference to it this evening as I preach through Genesis chapter number 9, the first seven verses tonight of that passage of Scripture, and I'll make a reference to the cities of refuge, though we won't deal with it in entirety, but we do find that the cities of refuge, when someone went to a city of refuge, he had to stay there until the death of a high priest. Then he could return. See, but our priest, our great high priest, he conquered death. He lives forever. His priesthood is superior. Number four, he made one offering for sin forever. See, the Bible tells us as we would consider this truth, and I mentioned already in Hebrews 10 and verse number 12 where the Bible says, but this man, after he made one sacrifice for sin forever, sat down on the right hand of God. See, that's the priesthood of our great high priest, the Lord Jesus Christ after the order of Melchizedek, as we'll mention here in just a moment, but we find that he made one offering for sin forever. That was not the case under the Levitical order. The Bible actually begins in chapter number 10 and verse number 1, as I referenced this verse of Scripture in the very beginning of the message this morning, for the law having a shadow of good things to come, and not the very image of the things, can never with those sacrifices, notice this phrase, which they offered year by year continually, to make the comers thereunto perfect. For then would they not have ceased to be offered? In other words, if they could accomplish in their offering what Christ accomplished in one offering, why'd they have to keep bringing it every year? Because the blood of bulls and goats, notice, as we continue here in the passage of Scripture in verse number 4, it is not possible that the blood of bulls and goats should take away sins. We find that Jesus Christ, one sacrifice for sin forever. His priesthood is superior, number one, because he passed through the heavens, not simply through the veil. Number two, his offering was for the sin of the world, but not for his own, because he had no sin. Number three, he conquered death and lives forever. Number four, he made one offering for sin forever. And number five, his priesthood is after the order of Melchizedek. Again, I mentioned several things about that during the message this morning, as we dealt with the prophecy that is given in verses 6 and verse number 10. And we find that the truths of this passage of Scripture will be developed in great detail as we come to chapter number 7. And really, much of the passage in chapter number 7 of the book of Hebrews deals with that very truth of the priesthood of Melchizedek after the order of Melchizedek. Jesus is not of the tribe of Levi. He's of the tribe of Judah. He could not be a Levitical priest, but he's of a higher, greater priesthood. That's the order of Melchizedek. And for those five reasons, and there's probably more that we could give, but for five reasons to prove that Christ's priesthood is superior. Now, as we take all of this truth and understand that it's foundational for what we will study in weeks to come, in chapters 7 through 10, I want you to be encouraged this morning by the very truth that we have a great high priest. Jesus, the Son of God, and He is our Savior. And this morning, as we understand the passage of Scripture and understand what Jesus did and how He is superior to that Old Testament priesthood. Now, for really all of us, unless there are some watching that I'm not sure of your background, we've not been in any type of a situation where we've had the same type of experience as these initial recipients to the book of Hebrews. But I want you to think about the impact upon these individuals. They see the temple. They see everything that's taking place. They see the offerings. They see the priest there. Remember, there were some wicked high priests during the time of Christ's day. In fact, they were ones that condemned Him to death. We find that here, as we come to these recipients that would initially have received this letter that we call in our canon of Scripture the book of Hebrews, can you imagine how encouraging this truth would have been to them? So you don't have a high priest over there. You have a great high priest that is far superior to any of that Levitical priesthood. That Levitical priesthood was there for a purpose and it served its purpose. But now we have a greater priest. We have a great high priest. And I believe that these initial recipients, those that initially received this letter, the book of Hebrews, oh, how encouraged they must have been as they came to the truth that we're studying this morning. Our great high priest. What a joy to know that he indeed is our great high priest, that he's the fulfillment of the prophecy, that he follows the pattern as far as the truth that he was called of God. He is compassionate towards us. And he made the sacrifice that we could never make, the sacrifice for sin of his own body, his own blood. And what a joy to know that he is superior. Let's pray. Father, we love you. We thank you for loving us. We thank you for our wonderful Savior, the Lord Jesus Christ. He is our great high priest. We thank you that he ever liveth to make intercession for us. We thank you that his sacrifice on the cross of Calvary was accepted and sufficient, satisfying and fulfilling for us. the demands for man to be redeemed and reconciled to God. We thank You for Thy Word. How we're encouraged this morning. Father, if there'd be one listening who's never trusted the Lord Jesus Christ as their personal Savior, I pray that today, the Holy Spirit of God would work in their heart, draw them to Himself, help them understand that their sin brings with it a penalty. That penalty is death. Not speaking of physical, but spiritual death. Separation from God for all of eternity in the lake of fire. Oh, I pray that You would convict them of their sin, of Christ's righteousness, of judgment to come. We thank You that the Lord Jesus Christ is our great High Priest. I pray that we'd be encouraged by that truth this day. We'll thank You for the work that You'll do. For it's in Christ's name we pray. We have a moment of invitation here. For those that are watching at home, wherever you may be, we'd ask you to reflect upon what you've heard this morning. As we have a time of invitation here, would you also take some time there at your home or your place and reflect on what you've heard this morning from the Word of God. Kimberly will play quietly on the piano here.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.680000066757202,
      "text": " the righteous to be moved and what a blessing."
    },
    {
      "id": 1,
      "start": 3.680000066757202,
      "end": 6.039999961853027,
      "text": " Thank you, Deborah, Pierre and Kimberly."
    },
    {
      "id": 2,
      "start": 6.039999961853027,
      "end": 7.739999771118164,
      "text": " Greatly appreciate your assistance"
    },
    {
      "id": 3,
      "start": 7.739999771118164,
      "end": 10.039999961853027,
      "text": " with the special music this morning."
    },
    {
      "id": 4,
      "start": 10.039999961853027,
      "end": 12.279999732971191,
      "text": " And thanks to Jared for leading."
    },
    {
      "id": 5,
      "start": 12.279999732971191,
      "end": 14.220000267028809,
      "text": " And did you know that second song"
    },
    {
      "id": 6,
      "start": 14.220000267028809,
      "end": 15.779999732971191,
      "text": " or you learned it this morning?"
    },
    {
      "id": 7,
      "start": 15.779999732971191,
      "end": 17.3799991607666,
      "text": " Learned it this morning, amen."
    },
    {
      "id": 8,
      "start": 17.3799991607666,
      "end": 20.420000076293945,
      "text": " Just along with me, I'm happy I didn't mess you up too much."
    },
    {
      "id": 9,
      "start": 20.420000076293945,
      "end": 23.860000610351562,
      "text": " And I'm thankful that we have a savior."
    },
    {
      "id": 10,
      "start": 23.860000610351562,
      "end": 25.920000076293945,
      "text": " I'm thankful that we have an anchor."
    },
    {
      "id": 11,
      "start": 25.979999542236328,
      "end": 30.5,
      "text": " I'm thankful as we sang that last congregational hymn"
    },
    {
      "id": 12,
      "start": 30.5,
      "end": 33.540000915527344,
      "text": " and then being mindful of our savior"
    },
    {
      "id": 13,
      "start": 33.540000915527344,
      "end": 37.65999984741211,
      "text": " has invited us to cast all of our care on him."
    },
    {
      "id": 14,
      "start": 37.65999984741211,
      "end": 38.5,
      "text": " Why?"
    },
    {
      "id": 15,
      "start": 38.5,
      "end": 40.2599983215332,
      "text": " Because he cares, careth for us."
    },
    {
      "id": 16,
      "start": 40.2599983215332,
      "end": 42.779998779296875,
      "text": " And we know that, we understand that truth."
    },
    {
      "id": 17,
      "start": 42.779998779296875,
      "end": 43.7400016784668,
      "text": " And thank you."
    },
    {
      "id": 18,
      "start": 43.7400016784668,
      "end": 46.540000915527344,
      "text": " What a blessing to see how those songs all fit together."
    },
    {
      "id": 19,
      "start": 46.540000915527344,
      "end": 48.70000076293945,
      "text": " Hebrews chapter number five this morning."
    },
    {
      "id": 20,
      "start": 48.70000076293945,
      "end": 50.58000183105469,
      "text": " Hebrews chapter number five."
    },
    {
      "id": 21,
      "start": 50.58000183105469,
      "end": 52.2599983215332,
      "text": " We'll be looking at the first 10 verses"
    },
    {
      "id": 22,
      "start": 52.2599983215332,
      "end": 54.060001373291016,
      "text": " of Hebrews chapter number five."
    },
    {
      "id": 23,
      "start": 54.060001373291016,
      "end": 56.91999816894531,
      "text": " And let me just mention this as we even,"
    },
    {
      "id": 24,
      "start": 56.91999816894531,
      "end": 59.880001068115234,
      "text": " before we get into the message this morning,"
    },
    {
      "id": 25,
      "start": 59.880001068115234,
      "end": 62.20000076293945,
      "text": " the passage of scripture that is before us."
    },
    {
      "id": 26,
      "start": 62.20000076293945,
      "end": 63.560001373291016,
      "text": " Of course, we've been studying"
    },
    {
      "id": 27,
      "start": 63.560001373291016,
      "end": 65.68000030517578,
      "text": " through the book of Hebrews here in 2020."
    },
    {
      "id": 28,
      "start": 65.68000030517578,
      "end": 67.76000213623047,
      "text": " We've taken the last several weeks off"
    },
    {
      "id": 29,
      "start": 67.76000213623047,
      "end": 70.83999633789062,
      "text": " because of the pandemic and all that's been going on."
    },
    {
      "id": 30,
      "start": 70.83999633789062,
      "end": 75.16000366210938,
      "text": " And of course, preaching some various portions of scripture."
    },
    {
      "id": 31,
      "start": 75.16000366210938,
      "end": 77.05999755859375,
      "text": " But as we make our way back to the book of Hebrews"
    },
    {
      "id": 32,
      "start": 77.05999755859375,
      "end": 78.76000213623047,
      "text": " and come to this fifth chapter,"
    },
    {
      "id": 33,
      "start": 78.76000213623047,
      "end": 82.0,
      "text": " these 10 verses in Hebrews chapter number five"
    },
    {
      "id": 34,
      "start": 82.0,
      "end": 83.76000213623047,
      "text": " are so important."
    },
    {
      "id": 35,
      "start": 84.45999908447266,
      "end": 86.54000091552734,
      "text": " We find that they are foundational"
    },
    {
      "id": 36,
      "start": 86.54000091552734,
      "end": 89.73999786376953,
      "text": " for that which will be further developed"
    },
    {
      "id": 37,
      "start": 89.73999786376953,
      "end": 93.33999633789062,
      "text": " in Hebrews seven, eight, nine, and 10."
    },
    {
      "id": 38,
      "start": 93.33999633789062,
      "end": 94.94000244140625,
      "text": " And you think about 10 verses"
    },
    {
      "id": 39,
      "start": 94.94000244140625,
      "end": 97.69999694824219,
      "text": " and just the importance of these 10 verses."
    },
    {
      "id": 40,
      "start": 97.69999694824219,
      "end": 99.73999786376953,
      "text": " Of course, we understand that all of God's word"
    },
    {
      "id": 41,
      "start": 99.73999786376953,
      "end": 102.0999984741211,
      "text": " is important, but as we look at the foundation"
    },
    {
      "id": 42,
      "start": 102.0999984741211,
      "end": 104.66000366210938,
      "text": " that will be laid here in these 10 verses"
    },
    {
      "id": 43,
      "start": 104.66000366210938,
      "end": 107.58000183105469,
      "text": " and then further developed in chapter seven through 10,"
    },
    {
      "id": 44,
      "start": 107.58000183105469,
      "end": 111.13999938964844,
      "text": " it is extremely important that we understand"
    },
    {
      "id": 45,
      "start": 111.13999938964844,
      "end": 113.63999938964844,
      "text": " the content of what we are given here"
    },
    {
      "id": 46,
      "start": 113.63999938964844,
      "end": 115.87999725341797,
      "text": " in Hebrews five verses one through 10."
    },
    {
      "id": 47,
      "start": 115.87999725341797,
      "end": 117.36000061035156,
      "text": " If you're like my children, you say,"
    },
    {
      "id": 48,
      "start": 117.36000061035156,
      "end": 120.31999969482422,
      "text": " well, what about the rest of chapter five and chapter six?"
    },
    {
      "id": 49,
      "start": 120.31999969482422,
      "end": 122.31999969482422,
      "text": " And you'll remember as we've studied"
    },
    {
      "id": 50,
      "start": 122.31999969482422,
      "end": 123.31999969482422,
      "text": " through the book of Hebrews,"
    },
    {
      "id": 51,
      "start": 123.31999969482422,
      "end": 125.72000122070312,
      "text": " I was chatting with them this morning before the service,"
    },
    {
      "id": 52,
      "start": 125.72000122070312,
      "end": 127.44000244140625,
      "text": " and you'll remember that as we've studied"
    },
    {
      "id": 53,
      "start": 127.44000244140625,
      "end": 128.44000244140625,
      "text": " through the book of Hebrews,"
    },
    {
      "id": 54,
      "start": 128.44000244140625,
      "end": 130.8000030517578,
      "text": " that there have been warning passages."
    },
    {
      "id": 55,
      "start": 130.8000030517578,
      "end": 133.52000427246094,
      "text": " And we will find that there's instruction given"
    },
    {
      "id": 56,
      "start": 133.52000427246094,
      "end": 134.8000030517578,
      "text": " and then there's a warning passage,"
    },
    {
      "id": 57,
      "start": 134.8000030517578,
      "end": 136.5,
      "text": " instruction giving a warning passage."
    },
    {
      "id": 58,
      "start": 136.5,
      "end": 139.24000549316406,
      "text": " Well, beginning in verse number 11 of chapter five"
    },
    {
      "id": 59,
      "start": 139.24000549316406,
      "end": 140.66000366210938,
      "text": " and going through the sixth chapter"
    },
    {
      "id": 60,
      "start": 140.66000366210938,
      "end": 144.74000549316406,
      "text": " is such a passage of a warning type of a passage."
    },
    {
      "id": 61,
      "start": 144.74000549316406,
      "end": 147.97999572753906,
      "text": " And so this foundational truth in Hebrews five"
    },
    {
      "id": 62,
      "start": 147.97999572753906,
      "end": 151.82000732421875,
      "text": " verses one through 10 is of significant importance"
    },
    {
      "id": 63,
      "start": 151.82000732421875,
      "end": 154.3800048828125,
      "text": " as we would understand that which is given"
    },
    {
      "id": 64,
      "start": 154.3800048828125,
      "end": 155.86000061035156,
      "text": " in chapter seven through 10."
    },
    {
      "id": 65,
      "start": 155.86000061035156,
      "end": 158.3000030517578,
      "text": " Now, if you have been with us"
    },
    {
      "id": 66,
      "start": 158.3000030517578,
      "end": 159.89999389648438,
      "text": " as we've studied the book of Hebrews,"
    },
    {
      "id": 67,
      "start": 159.89999389648438,
      "end": 162.27999877929688,
      "text": " we understand that the writer is presenting"
    },
    {
      "id": 68,
      "start": 162.27999877929688,
      "end": 164.97999572753906,
      "text": " the Lord Jesus Christ as being superior."
    },
    {
      "id": 69,
      "start": 164.97999572753906,
      "end": 168.77999877929688,
      "text": " And he is, he's superior for a whole list of reasons"
    },
    {
      "id": 70,
      "start": 169.32000732421875,
      "end": 170.39999389648438,
      "text": " and we've gone through several of those"
    },
    {
      "id": 71,
      "start": 170.39999389648438,
      "end": 172.1999969482422,
      "text": " as we've studied the book of Hebrews."
    },
    {
      "id": 72,
      "start": 172.1999969482422,
      "end": 174.25999450683594,
      "text": " We found that in Hebrews chapter number one,"
    },
    {
      "id": 73,
      "start": 174.25999450683594,
      "end": 177.0,
      "text": " that Christ is superior to the prophets."
    },
    {
      "id": 74,
      "start": 177.0,
      "end": 179.1999969482422,
      "text": " Remember, he's writing to those"
    },
    {
      "id": 75,
      "start": 179.1999969482422,
      "end": 181.36000061035156,
      "text": " that have trusted Christ as their savior,"
    },
    {
      "id": 76,
      "start": 181.36000061035156,
      "end": 184.27999877929688,
      "text": " but these Jewish people that he's writing to,"
    },
    {
      "id": 77,
      "start": 184.27999877929688,
      "end": 188.55999755859375,
      "text": " this book of Hebrews, the initial recipients of this book,"
    },
    {
      "id": 78,
      "start": 188.55999755859375,
      "end": 191.24000549316406,
      "text": " very familiar with, of course, because of their culture"
    },
    {
      "id": 79,
      "start": 191.24000549316406,
      "end": 193.32000732421875,
      "text": " and their lineage, their heritage,"
    },
    {
      "id": 80,
      "start": 193.32000732421875,
      "end": 195.72000122070312,
      "text": " he's speaking to them on matters"
    },
    {
      "id": 81,
      "start": 195.72000122070312,
      "end": 197.9199981689453,
      "text": " in which they would easily, quickly be able"
    },
    {
      "id": 82,
      "start": 197.97999572753906,
      "end": 200.22000122070312,
      "text": " to identify with the prophets."
    },
    {
      "id": 83,
      "start": 200.22000122070312,
      "end": 202.17999267578125,
      "text": " Of course, they'd be very familiar with the prophets"
    },
    {
      "id": 84,
      "start": 202.17999267578125,
      "end": 205.4600067138672,
      "text": " and he says, but Christ is superior to the prophets."
    },
    {
      "id": 85,
      "start": 205.4600067138672,
      "end": 207.32000732421875,
      "text": " We find that he then moves into the fact"
    },
    {
      "id": 86,
      "start": 207.32000732421875,
      "end": 209.89999389648438,
      "text": " that Christ is superior to the angels"
    },
    {
      "id": 87,
      "start": 209.89999389648438,
      "end": 211.97999572753906,
      "text": " and they would have had a level of knowledge"
    },
    {
      "id": 88,
      "start": 211.97999572753906,
      "end": 215.86000061035156,
      "text": " with regard to various portions of scripture"
    },
    {
      "id": 89,
      "start": 215.86000061035156,
      "end": 218.6199951171875,
      "text": " regarding the work of angels and what have you,"
    },
    {
      "id": 90,
      "start": 218.6199951171875,
      "end": 222.60000610351562,
      "text": " but Christ is superior to the angels."
    },
    {
      "id": 91,
      "start": 222.60000610351562,
      "end": 224.5399932861328,
      "text": " We found in Hebrews chapter number three,"
    },
    {
      "id": 92,
      "start": 224.5399932861328,
      "end": 226.89999389648438,
      "text": " that Christ is superior to Moses."
    },
    {
      "id": 93,
      "start": 226.9199981689453,
      "end": 229.36000061035156,
      "text": " Now, really kind of hitting home, if you will,"
    },
    {
      "id": 94,
      "start": 229.36000061035156,
      "end": 231.9600067138672,
      "text": " because Moses was held in high regard"
    },
    {
      "id": 95,
      "start": 231.9600067138672,
      "end": 233.86000061035156,
      "text": " between Moses and Abraham,"
    },
    {
      "id": 96,
      "start": 233.86000061035156,
      "end": 237.0,
      "text": " two of the probably most highly regarded folks"
    },
    {
      "id": 97,
      "start": 237.0,
      "end": 237.83999633789062,
      "text": " in the Old Testament."
    },
    {
      "id": 98,
      "start": 237.83999633789062,
      "end": 239.8800048828125,
      "text": " Of course, David would be in there as well,"
    },
    {
      "id": 99,
      "start": 239.8800048828125,
      "end": 244.47999572753906,
      "text": " but we find that there were many references"
    },
    {
      "id": 100,
      "start": 244.47999572753906,
      "end": 246.9199981689453,
      "text": " during the life and ministry of the Lord Jesus Christ"
    },
    {
      "id": 101,
      "start": 246.9199981689453,
      "end": 249.13999938964844,
      "text": " where they would speak about the religious leaders,"
    },
    {
      "id": 102,
      "start": 249.13999938964844,
      "end": 250.8000030517578,
      "text": " about Moses, about Abraham,"
    },
    {
      "id": 103,
      "start": 250.8000030517578,
      "end": 255.52000427246094,
      "text": " and so we find here that Christ is superior to Moses."
    },
    {
      "id": 104,
      "start": 255.52000427246094,
      "end": 258.2799987792969,
      "text": " There have been a few glimpses of the truth"
    },
    {
      "id": 105,
      "start": 258.2799987792969,
      "end": 261.0400085449219,
      "text": " that will be given to us in chapter number five."
    },
    {
      "id": 106,
      "start": 261.0400085449219,
      "end": 263.44000244140625,
      "text": " In chapter number two, again in chapter number four,"
    },
    {
      "id": 107,
      "start": 263.44000244140625,
      "end": 266.3599853515625,
      "text": " there's been some glimpses of what will be developed here"
    },
    {
      "id": 108,
      "start": 266.3599853515625,
      "end": 269.55999755859375,
      "text": " in these 10 verses and then further explained"
    },
    {
      "id": 109,
      "start": 269.55999755859375,
      "end": 271.29998779296875,
      "text": " in chapter seven through 10,"
    },
    {
      "id": 110,
      "start": 271.29998779296875,
      "end": 276.239990234375,
      "text": " and that truth is that Jesus Christ in his priesthood,"
    },
    {
      "id": 111,
      "start": 276.239990234375,
      "end": 280.739990234375,
      "text": " he is the superiority of the priesthood of Jesus Christ,"
    },
    {
      "id": 112,
      "start": 280.739990234375,
      "end": 282.70001220703125,
      "text": " and really that's what we begin to see"
    },
    {
      "id": 113,
      "start": 282.70001220703125,
      "end": 285.1000061035156,
      "text": " in these 10 verses of Hebrews five."
    },
    {
      "id": 114,
      "start": 285.1000061035156,
      "end": 287.82000732421875,
      "text": " Just to remind you of what we've seen glimpses of"
    },
    {
      "id": 115,
      "start": 287.82000732421875,
      "end": 289.7799987792969,
      "text": " in chapter number two,"
    },
    {
      "id": 116,
      "start": 289.7799987792969,
      "end": 292.05999755859375,
      "text": " we found that in verse number 17,"
    },
    {
      "id": 117,
      "start": 292.05999755859375,
      "end": 292.8999938964844,
      "text": " the Bible says,"
    },
    {
      "id": 118,
      "start": 292.8999938964844,
      "end": 295.17999267578125,
      "text": " wherefore in all things it behooved him,"
    },
    {
      "id": 119,
      "start": 295.17999267578125,
      "end": 296.29998779296875,
      "text": " speaking of Christ,"
    },
    {
      "id": 120,
      "start": 296.29998779296875,
      "end": 298.739990234375,
      "text": " to be made like unto his brethren,"
    },
    {
      "id": 121,
      "start": 298.739990234375,
      "end": 303.260009765625,
      "text": " that he might be a merciful and faithful high priest"
    },
    {
      "id": 122,
      "start": 303.260009765625,
      "end": 305.29998779296875,
      "text": " in things pertaining to God,"
    },
    {
      "id": 123,
      "start": 305.29998779296875,
      "end": 308.8999938964844,
      "text": " to make reconciliation for the sins of the people,"
    },
    {
      "id": 124,
      "start": 308.8999938964844,
      "end": 312.6199951171875,
      "text": " for in that he himself hath suffered being tempted,"
    },
    {
      "id": 125,
      "start": 312.6199951171875,
      "end": 316.17999267578125,
      "text": " he is able to succor them that are tempted."
    },
    {
      "id": 126,
      "start": 316.17999267578125,
      "end": 320.1400146484375,
      "text": " Again, in chapter number four in verses 14 and 15,"
    },
    {
      "id": 127,
      "start": 320.1400146484375,
      "end": 321.2200012207031,
      "text": " we find the Bible says,"
    },
    {
      "id": 128,
      "start": 321.2200012207031,
      "end": 324.9800109863281,
      "text": " seeing then that we have a great high priest"
    },
    {
      "id": 129,
      "start": 324.9800109863281,
      "end": 327.05999755859375,
      "text": " that is passed into the heavens,"
    },
    {
      "id": 130,
      "start": 327.05999755859375,
      "end": 328.82000732421875,
      "text": " Jesus, the son of God,"
    },
    {
      "id": 131,
      "start": 328.82000732421875,
      "end": 331.1600036621094,
      "text": " let us hold fast our profession,"
    },
    {
      "id": 132,
      "start": 331.1600036621094,
      "end": 332.8399963378906,
      "text": " for we have not an high priest"
    },
    {
      "id": 133,
      "start": 332.8399963378906,
      "end": 335.9200134277344,
      "text": " which cannot be touched with the feeling of our infirmities,"
    },
    {
      "id": 134,
      "start": 335.9200134277344,
      "end": 338.5,
      "text": " but was in all points tempted like as we are,"
    },
    {
      "id": 135,
      "start": 338.5,
      "end": 340.260009765625,
      "text": " yet without sin."
    },
    {
      "id": 136,
      "start": 340.260009765625,
      "end": 343.0199890136719,
      "text": " Let us therefore come boldly under the thorn of grace"
    },
    {
      "id": 137,
      "start": 343.0199890136719,
      "end": 345.0199890136719,
      "text": " that we may obtain mercy"
    },
    {
      "id": 138,
      "start": 345.0199890136719,
      "end": 348.94000244140625,
      "text": " and find grace to help in time of need."
    },
    {
      "id": 139,
      "start": 348.94000244140625,
      "end": 350.94000244140625,
      "text": " These two passages in Hebrews two"
    },
    {
      "id": 140,
      "start": 350.94000244140625,
      "end": 352.5400085449219,
      "text": " and in Hebrews chapter number four"
    },
    {
      "id": 141,
      "start": 352.5400085449219,
      "end": 354.6600036621094,
      "text": " are giving us some glimpses"
    },
    {
      "id": 142,
      "start": 354.6600036621094,
      "end": 358.1000061035156,
      "text": " as to what is being developed here in chapter number five."
    },
    {
      "id": 143,
      "start": 358.1000061035156,
      "end": 359.05999755859375,
      "text": " If you're taking notes,"
    },
    {
      "id": 144,
      "start": 359.05999755859375,
      "end": 361.4599914550781,
      "text": " I've simply titled the message this morning,"
    },
    {
      "id": 145,
      "start": 361.4599914550781,
      "end": 364.3399963378906,
      "text": " our great high priest,"
    },
    {
      "id": 146,
      "start": 364.3399963378906,
      "end": 366.29998779296875,
      "text": " our great high priest."
    },
    {
      "id": 147,
      "start": 366.29998779296875,
      "end": 368.3399963378906,
      "text": " Notice with me in verse number one,"
    },
    {
      "id": 148,
      "start": 368.3399963378906,
      "end": 370.05999755859375,
      "text": " the Bible says for every high priest,"
    },
    {
      "id": 149,
      "start": 370.05999755859375,
      "end": 372.6199951171875,
      "text": " taken from among men is ordained for men"
    },
    {
      "id": 150,
      "start": 372.6199951171875,
      "end": 374.70001220703125,
      "text": " in things pertaining to God,"
    },
    {
      "id": 151,
      "start": 374.70001220703125,
      "end": 378.29998779296875,
      "text": " that he may offer both gifts and sacrifices for sins."
    },
    {
      "id": 152,
      "start": 378.29998779296875,
      "end": 380.29998779296875,
      "text": " Who can have compassion on the ignorant"
    },
    {
      "id": 153,
      "start": 380.29998779296875,
      "end": 382.4200134277344,
      "text": " and on them that are out of the way,"
    },
    {
      "id": 154,
      "start": 382.4200134277344,
      "end": 386.1400146484375,
      "text": " for that he himself also is compassed with infirmity."
    },
    {
      "id": 155,
      "start": 386.1400146484375,
      "end": 388.4200134277344,
      "text": " And by reason hereof,"
    },
    {
      "id": 156,
      "start": 388.4200134277344,
      "end": 390.70001220703125,
      "text": " he ought as for the people,"
    },
    {
      "id": 157,
      "start": 390.70001220703125,
      "end": 394.8999938964844,
      "text": " so also for himself to offer for sins."
    },
    {
      "id": 158,
      "start": 394.8999938964844,
      "end": 397.8999938964844,
      "text": " And no man taketh this honor unto himself,"
    },
    {
      "id": 159,
      "start": 397.8999938964844,
      "end": 401.5,
      "text": " but he that is called of God, as was Aaron."
    },
    {
      "id": 160,
      "start": 401.5,
      "end": 404.3399963378906,
      "text": " So also Christ glorified not himself"
    },
    {
      "id": 161,
      "start": 404.3399963378906,
      "end": 405.6600036621094,
      "text": " to be made an high priest,"
    },
    {
      "id": 162,
      "start": 405.6600036621094,
      "end": 407.6199951171875,
      "text": " but he that said unto him,"
    },
    {
      "id": 163,
      "start": 407.6199951171875,
      "end": 410.4200134277344,
      "text": " thou art my son,"
    },
    {
      "id": 164,
      "start": 410.4200134277344,
      "end": 413.3800048828125,
      "text": " this today have I begotten thee."
    },
    {
      "id": 165,
      "start": 413.3800048828125,
      "end": 415.2200012207031,
      "text": " As he said also in another place,"
    },
    {
      "id": 166,
      "start": 415.2200012207031,
      "end": 418.0199890136719,
      "text": " thou art a priest forever"
    },
    {
      "id": 167,
      "start": 418.0199890136719,
      "end": 420.1000061035156,
      "text": " after the order of Melchizedek,"
    },
    {
      "id": 168,
      "start": 420.1000061035156,
      "end": 421.6600036621094,
      "text": " who in the days of his flesh,"
    },
    {
      "id": 169,
      "start": 421.6600036621094,
      "end": 423.94000244140625,
      "text": " when he had offered up prayers and supplications"
    },
    {
      "id": 170,
      "start": 423.94000244140625,
      "end": 426.0199890136719,
      "text": " with strong crying and tears"
    },
    {
      "id": 171,
      "start": 426.0199890136719,
      "end": 428.5799865722656,
      "text": " unto him that was able to save him from death"
    },
    {
      "id": 172,
      "start": 428.5799865722656,
      "end": 431.29998779296875,
      "text": " and was heard in that he feared."
    },
    {
      "id": 173,
      "start": 431.29998779296875,
      "end": 433.7799987792969,
      "text": " Though he were a son yet learned the obedience"
    },
    {
      "id": 174,
      "start": 433.7799987792969,
      "end": 435.8599853515625,
      "text": " by the things which he suffered"
    },
    {
      "id": 175,
      "start": 435.8599853515625,
      "end": 437.4599914550781,
      "text": " and being made perfect,"
    },
    {
      "id": 176,
      "start": 437.4599914550781,
      "end": 439.4200134277344,
      "text": " he became the author of eternal salvation"
    },
    {
      "id": 177,
      "start": 439.4200134277344,
      "end": 441.4599914550781,
      "text": " to all them that obey him,"
    },
    {
      "id": 178,
      "start": 441.4599914550781,
      "end": 443.82000732421875,
      "text": " called of God and high priest"
    },
    {
      "id": 179,
      "start": 443.82000732421875,
      "end": 447.1400146484375,
      "text": " after the order of Melchizedek,"
    },
    {
      "id": 180,
      "start": 447.1400146484375,
      "end": 448.8999938964844,
      "text": " our great high priest."
    },
    {
      "id": 181,
      "start": 448.8999938964844,
      "end": 450.2200012207031,
      "text": " We've discussed before"
    },
    {
      "id": 182,
      "start": 450.2200012207031,
      "end": 454.1000061035156,
      "text": " that Jesus Christ is prophet, priest, and king."
    },
    {
      "id": 183,
      "start": 454.1000061035156,
      "end": 457.8999938964844,
      "text": " And we understand that he fills those roles."
    },
    {
      "id": 184,
      "start": 457.8999938964844,
      "end": 459.82000732421875,
      "text": " And we find here specifically"
    },
    {
      "id": 185,
      "start": 459.82000732421875,
      "end": 462.5799865722656,
      "text": " the role of priests being given to us."
    },
    {
      "id": 186,
      "start": 462.5799865722656,
      "end": 465.6199951171875,
      "text": " The important factor as we get into the lesson,"
    },
    {
      "id": 187,
      "start": 465.6199951171875,
      "end": 467.05999755859375,
      "text": " the message this morning,"
    },
    {
      "id": 188,
      "start": 467.05999755859375,
      "end": 468.6199951171875,
      "text": " is that these recipients,"
    },
    {
      "id": 189,
      "start": 468.6199951171875,
      "end": 470.4599914550781,
      "text": " these Jewish believers,"
    },
    {
      "id": 190,
      "start": 470.4599914550781,
      "end": 473.94000244140625,
      "text": " they would have had a solid understanding"
    },
    {
      "id": 191,
      "start": 473.94000244140625,
      "end": 475.4599914550781,
      "text": " of the Old Testament"
    },
    {
      "id": 192,
      "start": 475.4599914550781,
      "end": 478.260009765625,
      "text": " and would have understood many aspects"
    },
    {
      "id": 193,
      "start": 478.260009765625,
      "end": 480.1400146484375,
      "text": " regarding the priesthood."
    },
    {
      "id": 194,
      "start": 480.1400146484375,
      "end": 481.3399963378906,
      "text": " They're very familiar with it."
    },
    {
      "id": 195,
      "start": 481.3399963378906,
      "end": 482.739990234375,
      "text": " In fact, as we've mentioned,"
    },
    {
      "id": 196,
      "start": 482.739990234375,
      "end": 484.4200134277344,
      "text": " through the study of the book of Hebrews,"
    },
    {
      "id": 197,
      "start": 484.4200134277344,
      "end": 486.82000732421875,
      "text": " the temple is still in operation"
    },
    {
      "id": 198,
      "start": 486.82000732421875,
      "end": 488.739990234375,
      "text": " at this time historically."
    },
    {
      "id": 199,
      "start": 488.739990234375,
      "end": 491.3800048828125,
      "text": " There are sacrifices that are still being made."
    },
    {
      "id": 200,
      "start": 491.3800048828125,
      "end": 494.05999755859375,
      "text": " All of the Jewish tradition, if you will,"
    },
    {
      "id": 201,
      "start": 494.05999755859375,
      "end": 495.6600036621094,
      "text": " if we could use that terminology,"
    },
    {
      "id": 202,
      "start": 495.6600036621094,
      "end": 498.5,
      "text": " but all of that Old Testament sacrificial system,"
    },
    {
      "id": 203,
      "start": 498.5,
      "end": 499.739990234375,
      "text": " it was still going on."
    },
    {
      "id": 204,
      "start": 499.739990234375,
      "end": 502.17999267578125,
      "text": " They were suffering under persecution."
    },
    {
      "id": 205,
      "start": 502.17999267578125,
      "end": 505.3399963378906,
      "text": " There was the thought of returning to Judaism."
    },
    {
      "id": 206,
      "start": 505.3399963378906,
      "end": 507.17999267578125,
      "text": " And we find that here,"
    },
    {
      "id": 207,
      "start": 507.17999267578125,
      "end": 508.8599853515625,
      "text": " throughout the book of Hebrews,"
    },
    {
      "id": 208,
      "start": 508.8599853515625,
      "end": 511.2200012207031,
      "text": " the call to the people"
    },
    {
      "id": 209,
      "start": 511.2200012207031,
      "end": 513.6599731445312,
      "text": " that are being addressed is not to return."
    },
    {
      "id": 210,
      "start": 513.6599731445312,
      "end": 514.5,
      "text": " Why?"
    },
    {
      "id": 211,
      "start": 514.5,
      "end": 516.260009765625,
      "text": " Because Christ is superior,"
    },
    {
      "id": 212,
      "start": 516.260009765625,
      "end": 517.8200073242188,
      "text": " that He is better,"
    },
    {
      "id": 213,
      "start": 517.8200073242188,
      "end": 519.7000122070312,
      "text": " and that we need to go on."
    },
    {
      "id": 214,
      "start": 519.7000122070312,
      "end": 523.1799926757812,
      "text": " We need to go on to spiritual maturity."
    },
    {
      "id": 215,
      "start": 523.1799926757812,
      "end": 525.4600219726562,
      "text": " And really we see that in the next section,"
    },
    {
      "id": 216,
      "start": 525.4600219726562,
      "end": 528.5399780273438,
      "text": " the warning section of the conclusion of chapter five"
    },
    {
      "id": 217,
      "start": 528.5399780273438,
      "end": 529.9400024414062,
      "text": " and all of chapter number six"
    },
    {
      "id": 218,
      "start": 529.9400024414062,
      "end": 533.02001953125,
      "text": " on that truth of going on to spiritual maturity."
    },
    {
      "id": 219,
      "start": 533.02001953125,
      "end": 536.0599975585938,
      "text": " And so as we understand some of these things"
    },
    {
      "id": 220,
      "start": 536.0599975585938,
      "end": 538.260009765625,
      "text": " and have an understanding of what they,"
    },
    {
      "id": 221,
      "start": 538.260009765625,
      "end": 539.8599853515625,
      "text": " as the initial recipients,"
    },
    {
      "id": 222,
      "start": 539.8599853515625,
      "end": 541.1599731445312,
      "text": " would have understood,"
    },
    {
      "id": 223,
      "start": 542.0999755859375,
      "end": 543.760009765625,
      "text": " we must make note of this truth"
    },
    {
      "id": 224,
      "start": 543.760009765625,
      "end": 546.7999877929688,
      "text": " that the Old Testament was only a shadow"
    },
    {
      "id": 225,
      "start": 546.7999877929688,
      "end": 548.280029296875,
      "text": " of good things to come."
    },
    {
      "id": 226,
      "start": 548.280029296875,
      "end": 550.0,
      "text": " We find that in Hebrews chapter number 10"
    },
    {
      "id": 227,
      "start": 550.0,
      "end": 552.5999755859375,
      "text": " laid out extensively for us."
    },
    {
      "id": 228,
      "start": 552.5999755859375,
      "end": 555.3599853515625,
      "text": " And what a joy to know that the types"
    },
    {
      "id": 229,
      "start": 555.3599853515625,
      "end": 558.719970703125,
      "text": " and all of the prophecies of the Old Testament,"
    },
    {
      "id": 230,
      "start": 558.719970703125,
      "end": 561.1199951171875,
      "text": " how they point to Messiah,"
    },
    {
      "id": 231,
      "start": 561.1199951171875,
      "end": 563.0399780273438,
      "text": " the Lord Jesus Christ who would come."
    },
    {
      "id": 232,
      "start": 563.0399780273438,
      "end": 565.280029296875,
      "text": " And of course, from our vantage point now,"
    },
    {
      "id": 233,
      "start": 565.280029296875,
      "end": 569.47998046875,
      "text": " He has come and He's fulfilled the will of the Father."
    },
    {
      "id": 234,
      "start": 569.47998046875,
      "end": 572.5599975585938,
      "text": " And we understand that He was crucified."
    },
    {
      "id": 235,
      "start": 572.5599975585938,
      "end": 573.4000244140625,
      "text": " He was buried."
    },
    {
      "id": 236,
      "start": 573.4000244140625,
      "end": 574.719970703125,
      "text": " He rose in victory."
    },
    {
      "id": 237,
      "start": 574.719970703125,
      "end": 576.0399780273438,
      "text": " He ascended to heaven."
    },
    {
      "id": 238,
      "start": 576.0399780273438,
      "end": 578.3200073242188,
      "text": " He ever liveth to make intercession for us."
    },
    {
      "id": 239,
      "start": 578.3200073242188,
      "end": 580.8800048828125,
      "text": " And one day, and I pray one day soon,"
    },
    {
      "id": 240,
      "start": 580.8800048828125,
      "end": 584.6400146484375,
      "text": " He is coming back to receive us unto Himself."
    },
    {
      "id": 241,
      "start": 584.6400146484375,
      "end": 586.52001953125,
      "text": " We've discussed thoroughly throughout"
    },
    {
      "id": 242,
      "start": 586.52001953125,
      "end": 588.760009765625,
      "text": " the first four chapters of the book of Hebrews,"
    },
    {
      "id": 243,
      "start": 588.760009765625,
      "end": 590.5599975585938,
      "text": " the incarnation of Christ,"
    },
    {
      "id": 244,
      "start": 590.5599975585938,
      "end": 593.5599975585938,
      "text": " that Jesus Christ became man,"
    },
    {
      "id": 245,
      "start": 593.5599975585938,
      "end": 596.3200073242188,
      "text": " but He never gave up His deity."
    },
    {
      "id": 246,
      "start": 596.3200073242188,
      "end": 597.9199829101562,
      "text": " He is the God, man."
    },
    {
      "id": 247,
      "start": 597.9199829101562,
      "end": 600.1599731445312,
      "text": " He's a hundred percent God, a hundred."
    },
    {
      "id": 0,
      "start": 600.1599731445312,
      "end": 605.2399730682373,
      "text": " man, we've dealt with his deity, we've addressed the incarnation, we've addressed"
    },
    {
      "id": 1,
      "start": 605.2399730682373,
      "end": 610.759973526001,
      "text": " those many subjects that are given to us. We've spoken because of the passage of"
    },
    {
      "id": 2,
      "start": 610.759973526001,
      "end": 614.4799728393555,
      "text": " Scripture at the end of chapter 1 and much of chapter number 2 with regard to"
    },
    {
      "id": 3,
      "start": 614.4799728393555,
      "end": 618.1199722290039,
      "text": " Christ being superior to the angels. There were some that say, yeah, but he was"
    },
    {
      "id": 4,
      "start": 618.1199722290039,
      "end": 622.6599731445312,
      "text": " made a little lower than the angels, and the answers are given to us as to why"
    },
    {
      "id": 5,
      "start": 622.6599731445312,
      "end": 628.9999732971191,
      "text": " that is, because he had to come not in that manner as an angel. See, an angel"
    },
    {
      "id": 6,
      "start": 628.9999732971191,
      "end": 633.7999725341797,
      "text": " could not die for the sins of mankind, and he says specifically in chapter 2 and"
    },
    {
      "id": 7,
      "start": 633.7999725341797,
      "end": 638.1599731445312,
      "text": " verse number 1, excuse me, verse 16, for verily he took not on him the nature of"
    },
    {
      "id": 8,
      "start": 638.1599731445312,
      "end": 643.1599731445312,
      "text": " angels, but he took on him the seed of Abraham. Why? So that he could make"
    },
    {
      "id": 9,
      "start": 643.1599731445312,
      "end": 649.2399749755859,
      "text": " reconciliation for the sins of the people. And what a joy to understand that"
    },
    {
      "id": 10,
      "start": 649.2399749755859,
      "end": 654.0799713134766,
      "text": " which has been accomplished through the incarnation of our Lord and Savior Jesus"
    },
    {
      "id": 11,
      "start": 654.0799713134766,
      "end": 659.6399726867676,
      "text": " Christ. He is God, a hundred percent God, but for that period of time he took on"
    },
    {
      "id": 12,
      "start": 659.6399726867676,
      "end": 664.6799697875977,
      "text": " humanity, he took on human flesh. Why? So that he could die in our place, but"
    },
    {
      "id": 13,
      "start": 664.6799697875977,
      "end": 669.2799758911133,
      "text": " pertaining to that which we see with regard to the priesthood, we find that"
    },
    {
      "id": 14,
      "start": 669.2799758911133,
      "end": 675.0799713134766,
      "text": " there are other indications with regard to that which he was able to, as we find"
    },
    {
      "id": 15,
      "start": 675.0799713134766,
      "end": 679.7999725341797,
      "text": " in chapter number 4 in verse 15, that he was tempted in all points yet without"
    },
    {
      "id": 16,
      "start": 679.7999725341797,
      "end": 683.719970703125,
      "text": " sin, but we have not a high priest which cannot be touched with the feeling of"
    },
    {
      "id": 17,
      "start": 683.719970703125,
      "end": 688.2399749755859,
      "text": " our infirmities. See, he took on that human form, yes, so that he could die for"
    },
    {
      "id": 18,
      "start": 688.2399749755859,
      "end": 694.2799758911133,
      "text": " our sins, but we find that he also suffered through those things that he"
    },
    {
      "id": 19,
      "start": 694.2799758911133,
      "end": 699.1999740600586,
      "text": " suffered. He then accomplished what nothing, what no other could ever"
    },
    {
      "id": 20,
      "start": 699.1999740600586,
      "end": 703.5599746704102,
      "text": " accomplish. As we get into the passage of Scripture, I want you to notice, first of"
    },
    {
      "id": 21,
      "start": 703.5599746704102,
      "end": 707.2799758911133,
      "text": " all, the pattern of the Old Testament priest. In the first four verses of"
    },
    {
      "id": 22,
      "start": 707.2799758911133,
      "end": 712.3199768066406,
      "text": " Hebrews 5, we see that there's a pattern that is established in really giving the"
    },
    {
      "id": 23,
      "start": 712.5599746704102,
      "end": 716.9199752807617,
      "text": " Old Testament truth with regard to what they would have been familiar with. Many"
    },
    {
      "id": 24,
      "start": 716.9199752807617,
      "end": 721.4999694824219,
      "text": " of us, as we have studied the Bible and read the Bible, we've read about the"
    },
    {
      "id": 25,
      "start": 721.4999694824219,
      "end": 725.5599746704102,
      "text": " priest in the Old Testament, we have a level of understanding of the priesthood"
    },
    {
      "id": 26,
      "start": 725.5599746704102,
      "end": 729.3999786376953,
      "text": " and what-have-you, and so in these first four verses there's a pattern that is"
    },
    {
      "id": 27,
      "start": 729.3999786376953,
      "end": 735.3199768066406,
      "text": " discussed, and really we understand, as we look at the passage, their role. It's"
    },
    {
      "id": 28,
      "start": 735.3199768066406,
      "end": 739.6799774169922,
      "text": " mentioned to us in verse number 1, they are to represent man to God. It says"
    },
    {
      "id": 29,
      "start": 739.6799774169922,
      "end": 743.9999694824219,
      "text": " here, in verse number 1 of chapter 5, for every high priest taken from among men"
    },
    {
      "id": 30,
      "start": 743.9999694824219,
      "end": 750.47998046875,
      "text": " is ordained for men in things pertaining to God. Notice this, as we consider their"
    },
    {
      "id": 31,
      "start": 750.47998046875,
      "end": 757.7599792480469,
      "text": " role, that he may offer both gifts and sacrifices for sins, and we'd understand,"
    },
    {
      "id": 32,
      "start": 757.7599792480469,
      "end": 760.9999694824219,
      "text": " as we think about the pattern in the Old Testament, and understand he's speaking"
    },
    {
      "id": 33,
      "start": 760.9999694824219,
      "end": 765.1199798583984,
      "text": " about the high priest, obviously Aaron as the first high priest, and he's mentioned"
    },
    {
      "id": 34,
      "start": 765.1199798583984,
      "end": 769.7599792480469,
      "text": " in verse number 4, that they would go into the Holy of Holies on the Day of"
    },
    {
      "id": 35,
      "start": 769.7599792480469,
      "end": 774.0799713134766,
      "text": " Atonement, and they would make an offering, and that was not only an"
    },
    {
      "id": 36,
      "start": 774.0799713134766,
      "end": 777.9999694824219,
      "text": " offering for the sins of the people, but for their own sins, as we find in verse"
    },
    {
      "id": 37,
      "start": 777.9999694824219,
      "end": 782.3999786376953,
      "text": " number 3, but we find that this was their role. You could read the Old Testament,"
    },
    {
      "id": 38,
      "start": 782.3999786376953,
      "end": 786.7599792480469,
      "text": " you could read the system that's given to us in the book of Leviticus, with all"
    },
    {
      "id": 39,
      "start": 786.7599792480469,
      "end": 790.8799743652344,
      "text": " of the offerings and sacrifices and what-have-you, and there were gifts, there"
    },
    {
      "id": 40,
      "start": 790.8799743652344,
      "end": 794.47998046875,
      "text": " were offerings that were brought, that were gifts, there were"
    },
    {
      "id": 41,
      "start": 794.47998046875,
      "end": 798.7999725341797,
      "text": " sacrifices that were made, and we see that it's mentioned here in verse number"
    },
    {
      "id": 42,
      "start": 798.7999725341797,
      "end": 804.6399688720703,
      "text": " 1, the role of this priest. Notice in verse number 2, we see that their"
    },
    {
      "id": 43,
      "start": 804.6399688720703,
      "end": 809.9199676513672,
      "text": " demeanor is mentioned. It says, who can have compassion on the ignorant and on"
    },
    {
      "id": 44,
      "start": 809.9199676513672,
      "end": 815.0399780273438,
      "text": " them that are out of the way, for that he himself also is compassed with infirmity?"
    },
    {
      "id": 45,
      "start": 815.0399780273438,
      "end": 819.0399780273438,
      "text": " We think about their demeanor, that they were to be compassionate. It's"
    },
    {
      "id": 46,
      "start": 819.0799713134766,
      "end": 821.9599761962891,
      "text": " interesting as you would look at verse number 2 and see where it says, who can"
    },
    {
      "id": 47,
      "start": 821.9599761962891,
      "end": 826.0399780273438,
      "text": " have compassion on the ignorant and on them that are out of the way? In other"
    },
    {
      "id": 48,
      "start": 826.0399780273438,
      "end": 829.5599670410156,
      "text": " words, those that would be bringing the offerings, those that would be bringing"
    },
    {
      "id": 49,
      "start": 829.5599670410156,
      "end": 835.4399719238281,
      "text": " the sacrifices, that they would be able to be compassionate to them, to the"
    },
    {
      "id": 50,
      "start": 835.4399719238281,
      "end": 839.1999664306641,
      "text": " ones that are bringing, and then of course they would process the offering"
    },
    {
      "id": 51,
      "start": 839.1999664306641,
      "end": 843.6799774169922,
      "text": " and make the offering, but they had this demeanor. They were not to be judgmental."
    },
    {
      "id": 52,
      "start": 843.6799774169922,
      "end": 848.2799682617188,
      "text": " They were to be able to be compassionate and to relate to these individuals. It's"
    },
    {
      "id": 53,
      "start": 848.2799682617188,
      "end": 851.9999694824219,
      "text": " interesting as you study the Old Testament that not all were compassionate."
    },
    {
      "id": 54,
      "start": 851.9999694824219,
      "end": 857.3999633789062,
      "text": " Amen? Eli was very judgmental towards Hannah when she was praying, was he not?"
    },
    {
      "id": 55,
      "start": 857.3999633789062,
      "end": 861.9999694824219,
      "text": " He says that she's drunken, right? I mean, that was his immediate understanding."
    },
    {
      "id": 56,
      "start": 861.9999694824219,
      "end": 866.2799682617188,
      "text": " There were some corrupt priests within the Old Testament system. We understand"
    },
    {
      "id": 57,
      "start": 866.2799682617188,
      "end": 870.1199645996094,
      "text": " that, and we see that taking place, but we find that the pattern that was"
    },
    {
      "id": 58,
      "start": 870.1199645996094,
      "end": 875.2399597167969,
      "text": " established, that what God's intent was, is that these men, notice in verse"
    },
    {
      "id": 59,
      "start": 875.2399597167969,
      "end": 880.4399719238281,
      "text": " number one, that their for every high peace taken from among men is"
    },
    {
      "id": 60,
      "start": 880.4399719238281,
      "end": 885.3199768066406,
      "text": " ordained for men, and they would be that representative to represent man to God,"
    },
    {
      "id": 61,
      "start": 885.3199768066406,
      "end": 889.8399658203125,
      "text": " to offer gifts and sacrifice, but to do it with compassion. See, it's easy for us"
    },
    {
      "id": 62,
      "start": 889.8399658203125,
      "end": 892.9999694824219,
      "text": " sometimes to be judgmental towards others that are dealing with sin and"
    },
    {
      "id": 63,
      "start": 892.9999694824219,
      "end": 898.7999877929688,
      "text": " difficulty in their lives, and yet we need to be with compassion, be able to bring"
    },
    {
      "id": 64,
      "start": 898.7999877929688,
      "end": 902.9599609375,
      "text": " them along and help them to see that victory is possible through the Lord"
    },
    {
      "id": 65,
      "start": 902.9599609375,
      "end": 906.5199584960938,
      "text": " Jesus Christ. It's interesting as we make a parallel, and we'll get to it at"
    },
    {
      "id": 66,
      "start": 906.5199584960938,
      "end": 911.3199768066406,
      "text": " the end of the message today, but you understand this demeanor that it's"
    },
    {
      "id": 67,
      "start": 911.3199768066406,
      "end": 914.3599853515625,
      "text": " mentioned in verse number two, and it would be appropriate for us to once"
    },
    {
      "id": 68,
      "start": 914.3599853515625,
      "end": 918.0799865722656,
      "text": " again reference chapter number four and verse number 15, where the Bible says"
    },
    {
      "id": 69,
      "start": 918.0799865722656,
      "end": 923.0399780273438,
      "text": " that we have not, and a high priest which cannot be touched with the feeling of"
    },
    {
      "id": 70,
      "start": 923.0399780273438,
      "end": 928.9599609375,
      "text": " our infirmities, but was in all points tempted like as we are, yet without sin."
    },
    {
      "id": 71,
      "start": 929.0799865722656,
      "end": 933.719970703125,
      "text": " And I'm so thankful that our God is compassionate. The Bible declares to us"
    },
    {
      "id": 72,
      "start": 933.719970703125,
      "end": 938.5599670410156,
      "text": " that he is a compassionate God. During the life and ministry of the Lord Jesus"
    },
    {
      "id": 73,
      "start": 938.5599670410156,
      "end": 943.1999816894531,
      "text": " Christ, you find many references where the Bible says that he, Jesus, was moved"
    },
    {
      "id": 74,
      "start": 943.1999816894531,
      "end": 949.3599853515625,
      "text": " with compassion, and what a joy to know that our Savior is a compassionate"
    },
    {
      "id": 75,
      "start": 949.3599853515625,
      "end": 953.2799682617188,
      "text": " Savior, and we think about this pattern that is being established as these"
    },
    {
      "id": 76,
      "start": 953.2799682617188,
      "end": 957.0799865722656,
      "text": " things are being set forth. Again, the foundation, the groundwork for which will"
    },
    {
      "id": 77,
      "start": 957.0799865722656,
      "end": 961.719970703125,
      "text": " be developed in a greater sense in the next several chapters, we see their role,"
    },
    {
      "id": 78,
      "start": 961.719970703125,
      "end": 967.1999816894531,
      "text": " their demeanor, notice also their call. In verse number three, it says, and by reason"
    },
    {
      "id": 79,
      "start": 967.1999816894531,
      "end": 970.7999877929688,
      "text": " hereof, he all asked for the people, so also for himself, to offer for sins,"
    },
    {
      "id": 80,
      "start": 970.7999877929688,
      "end": 974.719970703125,
      "text": " dealing with those sacrifices that are mentioned in verse number one. It's"
    },
    {
      "id": 81,
      "start": 974.719970703125,
      "end": 978.9599609375,
      "text": " important that we know, before we get to the call in verse number four, that they,"
    },
    {
      "id": 82,
      "start": 978.9599609375,
      "end": 982.1599731445312,
      "text": " when they went in to make an atonement, they had to atone for their own sins,"
    },
    {
      "id": 83,
      "start": 982.1599731445312,
      "end": 988.2799682617188,
      "text": " then for the sins of the people. And we find in verse number four, it says, and no"
    },
    {
      "id": 84,
      "start": 988.2799682617188,
      "end": 997.3599853515625,
      "text": " man taketh this honor unto himself, but he that is called of God as was Aaron."
    },
    {
      "id": 85,
      "start": 997.3599853515625,
      "end": 1002.0799865722656,
      "text": " And it's important that we understand this pattern. Why? Because we see how that"
    },
    {
      "id": 86,
      "start": 1002.0799865722656,
      "end": 1006.8799743652344,
      "text": " Jesus in his priesthood is superior, and we'll get to that in just a few moments,"
    },
    {
      "id": 87,
      "start": 1006.8799743652344,
      "end": 1010.9599609375,
      "text": " but we notice the pattern that is established, and you see that it says, no"
    },
    {
      "id": 88,
      "start": 1010.9999694824219,
      "end": 1014.719970703125,
      "text": " man taketh this honor unto himself, but he that is called of God. It wasn't as if"
    },
    {
      "id": 89,
      "start": 1014.719970703125,
      "end": 1017.9999694824219,
      "text": " somebody could come and say, hey, I volunteered to be a priest, let's have a"
    },
    {
      "id": 90,
      "start": 1017.9999694824219,
      "end": 1020.9599609375,
      "text": " vote, who's gonna be the high priest, okay? You put your name on the"
    },
    {
      "id": 91,
      "start": 1020.9599609375,
      "end": 1025.5999755859375,
      "text": " ballot there, you put... it's not how it worked. In fact, if you were to go back,"
    },
    {
      "id": 92,
      "start": 1025.5999755859375,
      "end": 1029.5399780273438,
      "text": " and we don't have the time really to develop all of this this morning, but if"
    },
    {
      "id": 93,
      "start": 1029.5399780273438,
      "end": 1034.2799682617188,
      "text": " you go back to the book of Exodus and you read chapters 28 and 29, you see"
    },
    {
      "id": 94,
      "start": 1034.2799682617188,
      "end": 1039.47998046875,
      "text": " specifically where God gave the direction to Moses to go to his brother"
    },
    {
      "id": 95,
      "start": 1039.47998046875,
      "end": 1044.47998046875,
      "text": " Aaron and to establish him as the high priest. We find the consecration in"
    },
    {
      "id": 96,
      "start": 1044.47998046875,
      "end": 1049.5999755859375,
      "text": " chapter number 29 from the head to the feet, right? I mean, fully"
    },
    {
      "id": 97,
      "start": 1049.5999755859375,
      "end": 1056.1199645996094,
      "text": " consecrated to the work that God would give him. We find that later in the Word"
    },
    {
      "id": 98,
      "start": 1056.1199645996094,
      "end": 1060.7599792480469,
      "text": " of God, you see that in Exodus 28 and 29, with Aaron specifically being selected or"
    },
    {
      "id": 99,
      "start": 1060.7599792480469,
      "end": 1066.9599609375,
      "text": " chosen, that you then come to Numbers chapters 3 and 4, and you see that it's"
    },
    {
      "id": 100,
      "start": 1066.9599609375,
      "end": 1072.6399841308594,
      "text": " the tribe of Levi that is established as the tribe in which the priest would"
    },
    {
      "id": 101,
      "start": 1072.6399841308594,
      "end": 1076.8799743652344,
      "text": " come from. If you are not from the tribe of Levi, you weren't going to be a"
    },
    {
      "id": 102,
      "start": 1076.8799743652344,
      "end": 1081.8399658203125,
      "text": " priest. And even if you were from the tribe of Levi, but one of the"
    },
    {
      "id": 103,
      "start": 1081.8399658203125,
      "end": 1086.1999816894531,
      "text": " other sons was your lineage, then you weren't going to be a priest, you would"
    },
    {
      "id": 104,
      "start": 1086.1999816894531,
      "end": 1090.2799682617188,
      "text": " serve in some other capacity. And it's interesting to note, because there are"
    },
    {
      "id": 105,
      "start": 1090.2799682617188,
      "end": 1095.5599670410156,
      "text": " references in the Old Testament, I'll just use two this morning, to reference"
    },
    {
      "id": 106,
      "start": 1095.5599670410156,
      "end": 1102.0799865722656,
      "text": " those that sought to fulfill the office of priest when they weren't supposed to."
    },
    {
      "id": 107,
      "start": 1102.0799865722656,
      "end": 1108.0799865722656,
      "text": " The first reference would be in Numbers chapter 17 with Korah. Many of us are"
    },
    {
      "id": 108,
      "start": 1108.0799865722656,
      "end": 1111.7999877929688,
      "text": " familiar with that. Numbers chapter 16, excuse me. And you see in Numbers chapter"
    },
    {
      "id": 109,
      "start": 1111.7999877929688,
      "end": 1119.1599731445312,
      "text": " 16 there with Korah, and they were of the tribe of Levi, but they had been given"
    },
    {
      "id": 110,
      "start": 1119.1599731445312,
      "end": 1125.1599731445312,
      "text": " specific roles to fulfill. The Kohathites there, the sons of Korah, but they"
    },
    {
      "id": 111,
      "start": 1125.1599731445312,
      "end": 1129.6799926757812,
      "text": " wanted to do the work of the priest. And there was some rebellion that took place"
    },
    {
      "id": 112,
      "start": 1129.6799926757812,
      "end": 1135.1199951171875,
      "text": " in Numbers 16, and something amazing happens. The earth opens up and swallows"
    },
    {
      "id": 113,
      "start": 1135.1199951171875,
      "end": 1142.6199951171875,
      "text": " them up. The judgment of God, right? Why? Because Korah was not ordained of God to"
    },
    {
      "id": 114,
      "start": 1142.6199951171875,
      "end": 1147.7999877929688,
      "text": " be a priest, to serve in that capacity. In the book of 2 Chronicles, in chapter"
    },
    {
      "id": 115,
      "start": 1147.7999877929688,
      "end": 1153.7999877929688,
      "text": " number 26, the Bible tells us about Uzziah. Now Uzziah was a king. Kings didn't"
    },
    {
      "id": 116,
      "start": 1153.7999877929688,
      "end": 1158.199951171875,
      "text": " come from the tribe of Levi, the tribe of Judah. We find that Uzziah was a king,"
    },
    {
      "id": 117,
      "start": 1158.199951171875,
      "end": 1164.9599609375,
      "text": " and as a king he could not fulfill the office of priest. Again, we're looking at"
    },
    {
      "id": 118,
      "start": 1164.9599609375,
      "end": 1169.199951171875,
      "text": " glimpses of our Savior being superior, and we'll deal with that as we move"
    },
    {
      "id": 119,
      "start": 1169.199951171875,
      "end": 1172.5599975585938,
      "text": " forward through the Scriptures this morning. But we find that Uzziah,"
    },
    {
      "id": 120,
      "start": 1172.5599975585938,
      "end": 1178.6399536132812,
      "text": " remember, God had blessed him, and God had helped him, and he was marvelously"
    },
    {
      "id": 121,
      "start": 1178.7599487304688,
      "end": 1184.3599853515625,
      "text": " helped, the Bible tells us, until he was strong and pride came in. And remember, he"
    },
    {
      "id": 122,
      "start": 1184.3599853515625,
      "end": 1190.2999877929688,
      "text": " goes in to offer. He tries to go in and do the work of a priest. The"
    },
    {
      "id": 123,
      "start": 1190.2999877929688,
      "end": 1195.719970703125,
      "text": " priest, they came in and they withstood him. It's not for you, Uzziah. And what"
    },
    {
      "id": 124,
      "start": 1195.719970703125,
      "end": 1200.9599609375,
      "text": " happened? Leprosy. God's judgment."
    },
    {
      "id": 0,
      "start": 1200.9599609375,
      "end": 1207.119960784912,
      "text": " So we see that here, as it says, this was not a situation where men would volunteer,"
    },
    {
      "id": 1,
      "start": 1207.119960784912,
      "end": 1212.079960823059,
      "text": " individuals would volunteer. No, no man taketh this honor unto himself, but he that is called"
    },
    {
      "id": 2,
      "start": 1212.079960823059,
      "end": 1218.799961090088,
      "text": " of God. Then it says, as was Aaron. It's interesting, after the situation in Numbers 16,"
    },
    {
      "id": 3,
      "start": 1218.799961090088,
      "end": 1225.4399604797363,
      "text": " with the Korah and the sons of Korah and all of that that takes place, in Numbers 17, God"
    },
    {
      "id": 4,
      "start": 1225.4399604797363,
      "end": 1230.879961013794,
      "text": " records for us how the Aaron's rod budded. Do you guys remember? You remember the text"
    },
    {
      "id": 5,
      "start": 1230.879961013794,
      "end": 1234.9999618530273,
      "text": " of Scripture, and you remember the proof, the evidence, if you will, when they took"
    },
    {
      "id": 6,
      "start": 1234.9999618530273,
      "end": 1241.2399597167969,
      "text": " and they took all of those rods, and it was going to be a sign from God that the one whose"
    },
    {
      "id": 7,
      "start": 1241.2399597167969,
      "end": 1246.9199600219727,
      "text": " rod would bud was the one that would fill that office, and it was Aaron's rod that budded."
    },
    {
      "id": 8,
      "start": 1246.9199600219727,
      "end": 1252.9999618530273,
      "text": " And we find that as this pattern is established, this pattern in the Old Testament of the priests,"
    },
    {
      "id": 9,
      "start": 1252.9999618530273,
      "end": 1258.5999603271484,
      "text": " the Levitical priesthood, that these recipients would have had a knowledge and understanding"
    },
    {
      "id": 10,
      "start": 1258.5999603271484,
      "end": 1265.0399627685547,
      "text": " of these things. We find that there's a, number two if you're taking notes, the prophecy"
    },
    {
      "id": 11,
      "start": 1265.0399627685547,
      "end": 1270.1199645996094,
      "text": " of a greater priest. So there's a pattern of the priesthood, the Levitical priesthood,"
    },
    {
      "id": 12,
      "start": 1270.1199645996094,
      "end": 1276.9799575805664,
      "text": " but then there's a prophecy of a greater priest. We find that as we have on many occasion already"
    },
    {
      "id": 13,
      "start": 1276.9799575805664,
      "end": 1283.8999633789062,
      "text": " through the book of Hebrews, we have found that the writer of Hebrews will use Old Testament"
    },
    {
      "id": 14,
      "start": 1283.8999633789062,
      "end": 1289.9799575805664,
      "text": " passages and then properly apply those to the person of Jesus Christ. We find that that's"
    },
    {
      "id": 15,
      "start": 1289.9799575805664,
      "end": 1294.9799575805664,
      "text": " exactly what he's going to do here once again. Again, these individuals would have had a"
    },
    {
      "id": 16,
      "start": 1294.9799575805664,
      "end": 1300.4399642944336,
      "text": " good working knowledge of the Old Testament. They would have understood many of these things."
    },
    {
      "id": 17,
      "start": 1300.4399642944336,
      "end": 1305.1799621582031,
      "text": " Most of them would have understood many of these things, and as the writer has gone through"
    },
    {
      "id": 18,
      "start": 1305.1799621582031,
      "end": 1310.0999603271484,
      "text": " this process, and we understand all Scripture is given by inspiration of God, and how appropriate"
    },
    {
      "id": 19,
      "start": 1310.0999603271484,
      "end": 1316.9399642944336,
      "text": " to see how God would use these Old Testament prophecies and show, here's the proper fulfillment"
    },
    {
      "id": 20,
      "start": 1316.9399642944336,
      "end": 1323.9799575805664,
      "text": " in the Lord Jesus Christ. These prophecies are properly applied to the Lord Jesus Christ,"
    },
    {
      "id": 21,
      "start": 1323.9799575805664,
      "end": 1331.4999542236328,
      "text": " and we find the first one given to us in Hebrews 5, in verse number 5. Notice, so also Christ"
    },
    {
      "id": 22,
      "start": 1331.4999542236328,
      "end": 1336.3399658203125,
      "text": " glorified not himself to be made in high priest. You see the continuation of verse"
    },
    {
      "id": 23,
      "start": 1336.3399658203125,
      "end": 1340.8599548339844,
      "text": " number 4. These guys didn't volunteer for it, and it's saying that what he's looking"
    },
    {
      "id": 24,
      "start": 1340.8599548339844,
      "end": 1346.1399536132812,
      "text": " at is this call, the plan of the Father. He says, but he that said unto him, notice the"
    },
    {
      "id": 25,
      "start": 1346.1399536132812,
      "end": 1354.0999603271484,
      "text": " end of verse number 5, thou art my son, today have I begotten thee. This is a verse that"
    },
    {
      "id": 26,
      "start": 1354.0999603271484,
      "end": 1358.5799560546875,
      "text": " was used back in Hebrews chapter number 1 as well, in verse number 5 when the Bible"
    },
    {
      "id": 27,
      "start": 1358.5799560546875,
      "end": 1363.3399658203125,
      "text": " promises for unto which of the angels said he at any time, thou art my son, this day"
    },
    {
      "id": 28,
      "start": 1363.3399658203125,
      "end": 1368.4199676513672,
      "text": " have I begotten thee. And again, I will be to him a father and he shall be to me a son,"
    },
    {
      "id": 29,
      "start": 1368.4199676513672,
      "end": 1373.2599639892578,
      "text": " and we find that this verse from the Old Testament is none other than the book of Psalms, Psalm"
    },
    {
      "id": 30,
      "start": 1373.2599639892578,
      "end": 1378.219955444336,
      "text": " chapter number 2 and verse number 7. As we would consider the Old Testament passage of"
    },
    {
      "id": 31,
      "start": 1378.219955444336,
      "end": 1384.1399536132812,
      "text": " Scripture in Psalm 2 and verse number 7, we must be mindful of the fact that when the"
    },
    {
      "id": 32,
      "start": 1384.1399536132812,
      "end": 1390.7399597167969,
      "text": " Scripture says, thou art my son, today or this day have I begotten thee, that he was"
    },
    {
      "id": 33,
      "start": 1390.7399597167969,
      "end": 1399.3399658203125,
      "text": " not referring to the birth of Christ. Many people inappropriately or wrongfully interpret"
    },
    {
      "id": 34,
      "start": 1399.3399658203125,
      "end": 1404.7799682617188,
      "text": " that to think that he's speaking of the birth of Christ as incarnation. No, the Scriptures"
    },
    {
      "id": 35,
      "start": 1404.7799682617188,
      "end": 1408.939956665039,
      "text": " as you study Scripture with Scripture, you compare Scripture with Scripture, you find"
    },
    {
      "id": 36,
      "start": 1408.939956665039,
      "end": 1415.1399536132812,
      "text": " that what he's speaking about is not the birth of Christ, but the resurrection of Christ."
    },
    {
      "id": 37,
      "start": 1415.1399536132812,
      "end": 1420.4199676513672,
      "text": " In Acts chapter number 13, notice as the Apostle Paul is preaching, in Acts chapter number"
    },
    {
      "id": 38,
      "start": 1420.4199676513672,
      "end": 1425.4999542236328,
      "text": " 13, turn over there with me quickly if you will, and this is the first missionary journey"
    },
    {
      "id": 39,
      "start": 1425.4999542236328,
      "end": 1430.699966430664,
      "text": " he's going. The Apostle Paul's been sent out of the church at Antioch and he's preaching,"
    },
    {
      "id": 40,
      "start": 1430.699966430664,
      "end": 1434.4199676513672,
      "text": " and they're on this first missionary journey in the regions of Galatia, and he's preaching"
    },
    {
      "id": 41,
      "start": 1434.4199676513672,
      "end": 1440.1799621582031,
      "text": " the Word of God. You'll remember that as he first arrives to Antioch and Pisidia, as"
    },
    {
      "id": 42,
      "start": 1440.1799621582031,
      "end": 1446.8199615478516,
      "text": " it's given to us in verse number 14, that they go there on the Sabbath day to the synagogue,"
    },
    {
      "id": 43,
      "start": 1446.8199615478516,
      "end": 1451.1799621582031,
      "text": " and as they are there, they say this at the end of verse 15,"
    },
    {
      "id": 44,
      "start": 1451.1799621582031,
      "end": 1456.3799591064453,
      "text": " \"...Ye men and brethren, if you have any word of exhortation for the people, say on.\""
    },
    {
      "id": 45,
      "start": 1456.3799591064453,
      "end": 1460.5399475097656,
      "text": " And Paul says, here's my opportunity, I'm going to preach, and he does. He preaches"
    },
    {
      "id": 46,
      "start": 1460.5399475097656,
      "end": 1465.4599609375,
      "text": " the Word of God. Notice verse 16, \"...Then Paul stood up, and beckoning with his hand...\""
    },
    {
      "id": 47,
      "start": 1465.4599609375,
      "end": 1469.4199523925781,
      "text": " That's why I use my hands when I preach, amen? He said, \"...Men of Israel, and ye that fear"
    },
    {
      "id": 48,
      "start": 1469.4199523925781,
      "end": 1474.7399597167969,
      "text": " God, give audience.\" And he begins to go through this message. I want you to notice, we don't"
    },
    {
      "id": 49,
      "start": 1474.7399597167969,
      "end": 1479.8599548339844,
      "text": " have time to look at all of it, but go down to verse number 33. He had gone through in"
    },
    {
      "id": 50,
      "start": 1479.8599548339844,
      "end": 1487.0999755859375,
      "text": " verses 28, down through verse number 32, he's dealing with the death, burial, and resurrection"
    },
    {
      "id": 51,
      "start": 1487.0999755859375,
      "end": 1493.6599731445312,
      "text": " of our Lord and Savior, Jesus Christ, and he says in verse number 33, \"...God hath fulfilled"
    },
    {
      "id": 52,
      "start": 1493.6599731445312,
      "end": 1502.6599731445312,
      "text": " the same unto us, their children, in that he raised up Jesus again, as it is also written"
    },
    {
      "id": 53,
      "start": 1502.6599731445312,
      "end": 1509.6599731445312,
      "text": " in the second psalm, Thou art my Son, this day have I begotten thee.\" So obviously the"
    },
    {
      "id": 54,
      "start": 1509.6599731445312,
      "end": 1516.4199523925781,
      "text": " prophecy of Psalm 2 is with regard to the resurrection, not the birth. And we find that"
    },
    {
      "id": 55,
      "start": 1516.4199523925781,
      "end": 1521.1399536132812,
      "text": " as we go back to the book of Hebrews, and we deal with Hebrews 5, in verse number 5,"
    },
    {
      "id": 56,
      "start": 1521.1399536132812,
      "end": 1527.5399475097656,
      "text": " we find that the writer of Hebrews, he's referring back to a prophecy in the Old Testament, and"
    },
    {
      "id": 57,
      "start": 1527.5399475097656,
      "end": 1533.5399475097656,
      "text": " he's appropriately applying it to the Lord Jesus Christ. Now, he's got, now think about"
    },
    {
      "id": 58,
      "start": 1533.5399475097656,
      "end": 1540.2999572753906,
      "text": " as we're reading this, we look at the pattern of the priesthood, then we look at this prophecy,"
    },
    {
      "id": 59,
      "start": 1540.2999572753906,
      "end": 1544.6199645996094,
      "text": " we come to Psalm 2 in verse number 7, that's referenced here in Hebrews 5 in verse number"
    },
    {
      "id": 60,
      "start": 1544.6199645996094,
      "end": 1550.219970703125,
      "text": " 5, oh yes, speaking about the Lord Jesus Christ. And then he goes to verse number 6,"
    },
    {
      "id": 61,
      "start": 1550.219970703125,
      "end": 1557.6599731445312,
      "text": " and he's going to reference another Old Testament prophecy. As he saith also in another place,"
    },
    {
      "id": 62,
      "start": 1557.6599731445312,
      "end": 1565.8999633789062,
      "text": " that other place is Psalm 110 in verse number 4. Let me just make a note on Psalm 110, it"
    },
    {
      "id": 63,
      "start": 1565.8999633789062,
      "end": 1574.2599487304688,
      "text": " was commonly understood and agreed to by the religious leaders, the Jewish folks, that"
    },
    {
      "id": 64,
      "start": 1574.2599487304688,
      "end": 1581.9799499511719,
      "text": " Psalm 110 was categorized as a messianic psalm. Why is that important? Because the"
    },
    {
      "id": 65,
      "start": 1581.9799499511719,
      "end": 1588.1799621582031,
      "text": " truth of Psalm 110 in verse number 4 is being applied here in Hebrews 5, 6, to the Lord"
    },
    {
      "id": 66,
      "start": 1588.1799621582031,
      "end": 1594.7799682617188,
      "text": " Jesus Christ. It's a messianic psalm, it points to Messiah, Christ is the Messiah, right?"
    },
    {
      "id": 67,
      "start": 1594.7799682617188,
      "end": 1600.8999633789062,
      "text": " Jesus is the Christ, that's what Paul preached, and proving that this man Jesus that you've"
    },
    {
      "id": 68,
      "start": 1600.8999633789062,
      "end": 1606.1799621582031,
      "text": " seen, that you've heard about, that you observed his life and you were aware of his death and"
    },
    {
      "id": 69,
      "start": 1606.1799621582031,
      "end": 1612.4199523925781,
      "text": " his burial and his resurrection, he is the Christ, he is the Messiah, and this messianic"
    },
    {
      "id": 70,
      "start": 1612.4199523925781,
      "end": 1619.699951171875,
      "text": " psalm in Psalm 110 will now be applied to the Lord Jesus Christ when he says, thou art"
    },
    {
      "id": 71,
      "start": 1619.699951171875,
      "end": 1629.4599609375,
      "text": " a priest forever after the order of Melchizedek. Now, we're familiar with the priesthood of"
    },
    {
      "id": 72,
      "start": 1629.4599609375,
      "end": 1635.1399536132812,
      "text": " Aaron, of the Levitical priesthood, and we've just mentioned several of those things, but"
    },
    {
      "id": 73,
      "start": 1635.1399536132812,
      "end": 1640.7799682617188,
      "text": " we find that there's an obvious change in direction that is given to us here with regard"
    },
    {
      "id": 74,
      "start": 1640.7799682617188,
      "end": 1647.9399719238281,
      "text": " to the priesthood of the Lord Jesus Christ. Now, this is significant. Why is it significant?"
    },
    {
      "id": 75,
      "start": 1647.9399719238281,
      "end": 1651.9399719238281,
      "text": " Because the Lord Jesus Christ, well, let me say this, as I mentioned a moment ago, priests"
    },
    {
      "id": 76,
      "start": 1651.9399719238281,
      "end": 1658.4199523925781,
      "text": " came from the tribe of Levi. Jesus was not of the tribe of Levi. He was of the tribe"
    },
    {
      "id": 77,
      "start": 1658.4199523925781,
      "end": 1668.4199523925781,
      "text": " of Judah. So, he could not be a priest under the Levitical priesthood. It's not possible."
    },
    {
      "id": 78,
      "start": 1668.4199523925781,
      "end": 1674.699951171875,
      "text": " But he is prophet, priest, and king. By the way, the priest couldn't be a king and the"
    },
    {
      "id": 79,
      "start": 1674.699951171875,
      "end": 1682.0199584960938,
      "text": " king couldn't be a priest under the Levitical priesthood, but our Savior is God. He is the"
    },
    {
      "id": 80,
      "start": 1682.0199584960938,
      "end": 1688.7799682617188,
      "text": " Lord God Omnipotent. He is prophet, priest, and king, and he's not under the order of"
    },
    {
      "id": 81,
      "start": 1688.7799682617188,
      "end": 1695.4799499511719,
      "text": " the Levitical priesthood, but he's under the order of the Melchizedek priesthood. Now,"
    },
    {
      "id": 82,
      "start": 1695.4799499511719,
      "end": 1701.2599487304688,
      "text": " this would go back to Genesis chapter number 14 and deal with those things that are mentioned"
    },
    {
      "id": 83,
      "start": 1701.2599487304688,
      "end": 1707.3399658203125,
      "text": " there in verses 18 through 20. We will develop this a whole lot more in chapter number 7,"
    },
    {
      "id": 84,
      "start": 1707.3399658203125,
      "end": 1712.0999755859375,
      "text": " and I'm not going to get into it a whole bunch this morning just because of the fact that"
    },
    {
      "id": 85,
      "start": 1712.0999755859375,
      "end": 1717.3399658203125,
      "text": " chapter number 7 details it. Remember, this is the foundation that will be built upon"
    },
    {
      "id": 86,
      "start": 1717.3399658203125,
      "end": 1723.8599853515625,
      "text": " in chapters 7, 8, 9, and 10. And so, what is said here is that this messianic psalm,"
    },
    {
      "id": 87,
      "start": 1723.8599853515625,
      "end": 1729.3799438476562,
      "text": " the prophecy of a greater priest, is now, they say, listen, you're familiar with the"
    },
    {
      "id": 88,
      "start": 1729.3799438476562,
      "end": 1734.8599853515625,
      "text": " pattern of the priesthood, but let me remind you of the prophecy of a greater priest, and"
    },
    {
      "id": 89,
      "start": 1734.8599853515625,
      "end": 1741.8999633789062,
      "text": " he gives them the prophecy from Psalm 2, then from Psalm 110, referencing that Jesus is"
    },
    {
      "id": 90,
      "start": 1741.8999633789062,
      "end": 1746.97998046875,
      "text": " the fulfillment and that he would be a priest forever after the order of Melchizedek. It's"
    },
    {
      "id": 91,
      "start": 1746.97998046875,
      "end": 1754.1399536132812,
      "text": " mentioned again in verse number 10, called of God and high priest after the order of"
    },
    {
      "id": 92,
      "start": 1754.1399536132812,
      "end": 1759.179931640625,
      "text": " Melchizedek. By the way, if you read Genesis chapter number 14 and you read the interaction"
    },
    {
      "id": 93,
      "start": 1759.179931640625,
      "end": 1764.679931640625,
      "text": " that is recorded there between Abraham and this one Melchizedek, he comes on the pages"
    },
    {
      "id": 94,
      "start": 1764.679931640625,
      "end": 1770.2999877929688,
      "text": " of Scripture and he departs the pages of Scripture in obscurity. There are just a few verses"
    },
    {
      "id": 95,
      "start": 1770.2999877929688,
      "end": 1774.7799682617188,
      "text": " of Scripture that are mentioned about this one Melchizedek. In fact, the references in"
    },
    {
      "id": 96,
      "start": 1774.7799682617188,
      "end": 1779.9599609375,
      "text": " Hebrews give us far more information than what you even see in the book of Genesis."
    },
    {
      "id": 97,
      "start": 1779.9599609375,
      "end": 1789.9599609375,
      "text": " And what we find is that this man Melchizedek, he was both priest and king. And Jesus, his"
    },
    {
      "id": 98,
      "start": 1789.9599609375,
      "end": 1797.1599731445312,
      "text": " priesthood would be after the order of Melchizedek. Again, this is significant because of the"
    },
    {
      "id": 99,
      "start": 1797.1599731445312,
      "end": 1801.1599731445312,
      "text": " understanding of these individuals, and now we're taking not only the pattern of the priesthood"
    },
    {
      "id": 100,
      "start": 1801.1599731445312,
      "end": 1801.1599731445312,
      "text": ""
    },
    {
      "id": 0,
      "start": 1801.1599731445312,
      "end": 1803.899973154068,
      "text": " but now we're establishing the priesthood"
    },
    {
      "id": 1,
      "start": 1803.899973154068,
      "end": 1806.8999729156494,
      "text": " through the prophecy that was given in the Old Testament."
    },
    {
      "id": 2,
      "start": 1806.8999729156494,
      "end": 1810.3599729537964,
      "text": " It's interesting, as we look at the passage of Scripture,"
    },
    {
      "id": 3,
      "start": 1810.3599729537964,
      "end": 1814.1599731445312,
      "text": " and we find that the author, the writer of Hebrews,"
    },
    {
      "id": 4,
      "start": 1814.1599731445312,
      "end": 1816.6599731445312,
      "text": " as he systematically goes through this process,"
    },
    {
      "id": 5,
      "start": 1816.6599731445312,
      "end": 1820.3999729156494,
      "text": " he has given them the pattern and the prophecy."
    },
    {
      "id": 6,
      "start": 1820.3999729156494,
      "end": 1823.5399723052979,
      "text": " And once those two things are understood,"
    },
    {
      "id": 7,
      "start": 1823.5399723052979,
      "end": 1826.7399730682373,
      "text": " he then presents the Lord Jesus Christ"
    },
    {
      "id": 8,
      "start": 1826.7399730682373,
      "end": 1829.0399723052979,
      "text": " as the fulfillment of the prophecy"
    },
    {
      "id": 9,
      "start": 1829.2399730682373,
      "end": 1832.3599739074707,
      "text": " and proves that He is superior."
    },
    {
      "id": 10,
      "start": 1832.3599739074707,
      "end": 1833.1999740600586,
      "text": " It's awesome."
    },
    {
      "id": 11,
      "start": 1834.779972076416,
      "end": 1837.239974975586,
      "text": " He takes and he says, let me give you the pattern,"
    },
    {
      "id": 12,
      "start": 1837.239974975586,
      "end": 1838.7199745178223,
      "text": " let me give you the prophecy,"
    },
    {
      "id": 13,
      "start": 1838.7199745178223,
      "end": 1841.1999740600586,
      "text": " now let me present to you the Lord Jesus Christ"
    },
    {
      "id": 14,
      "start": 1841.1999740600586,
      "end": 1845.4399719238281,
      "text": " and let me prove to you that He is superior."
    },
    {
      "id": 15,
      "start": 1845.4399719238281,
      "end": 1846.9199714660645,
      "text": " It says in verse number seven,"
    },
    {
      "id": 16,
      "start": 1846.9199714660645,
      "end": 1849.0799713134766,
      "text": " who in the days of His flesh,"
    },
    {
      "id": 17,
      "start": 1849.0799713134766,
      "end": 1850.7999725341797,
      "text": " you understand that in verse number seven,"
    },
    {
      "id": 18,
      "start": 1850.7999725341797,
      "end": 1853.4199714660645,
      "text": " He'd begin to speak about His earthly ministry."
    },
    {
      "id": 19,
      "start": 1853.4199714660645,
      "end": 1855.4199714660645,
      "text": " And we can read in the Gospel records"
    },
    {
      "id": 20,
      "start": 1855.4199714660645,
      "end": 1858.5599746704102,
      "text": " about the life of the Lord Jesus Christ."
    },
    {
      "id": 21,
      "start": 1859.0799713134766,
      "end": 1861.119972229004,
      "text": " And it says, when He had offered up prayers"
    },
    {
      "id": 22,
      "start": 1861.119972229004,
      "end": 1864.279972076416,
      "text": " and supplications with strong crying and tears"
    },
    {
      "id": 23,
      "start": 1864.279972076416,
      "end": 1866.9999694824219,
      "text": " unto Him that was able to save Him from death"
    },
    {
      "id": 24,
      "start": 1866.9999694824219,
      "end": 1869.459976196289,
      "text": " and was heard and that He feared."
    },
    {
      "id": 25,
      "start": 1869.459976196289,
      "end": 1871.2999725341797,
      "text": " Let me make a note on verse number seven."
    },
    {
      "id": 26,
      "start": 1871.2999725341797,
      "end": 1874.9199752807617,
      "text": " There are many references in the Gospel record, excuse me,"
    },
    {
      "id": 27,
      "start": 1874.9199752807617,
      "end": 1878.3999710083008,
      "text": " to the prayer ministry of the Lord Jesus Christ."
    },
    {
      "id": 28,
      "start": 1878.3999710083008,
      "end": 1880.3199768066406,
      "text": " And some have asked the question, if He's God,"
    },
    {
      "id": 29,
      "start": 1880.3199768066406,
      "end": 1881.959976196289,
      "text": " why does He have to pray?"
    },
    {
      "id": 30,
      "start": 1881.959976196289,
      "end": 1884.0399703979492,
      "text": " Because He is God."
    },
    {
      "id": 31,
      "start": 1884.0399703979492,
      "end": 1886.119972229004,
      "text": " The reality is that He is God,"
    },
    {
      "id": 32,
      "start": 1886.119972229004,
      "end": 1887.9199752807617,
      "text": " He never ceased to be God,"
    },
    {
      "id": 33,
      "start": 1887.9199752807617,
      "end": 1890.119972229004,
      "text": " but He also left us an example"
    },
    {
      "id": 34,
      "start": 1890.119972229004,
      "end": 1891.9999694824219,
      "text": " that we should follow His steps."
    },
    {
      "id": 35,
      "start": 1891.9999694824219,
      "end": 1894.959976196289,
      "text": " The Bible tells us that in the book of Peter, 1 Peter,"
    },
    {
      "id": 36,
      "start": 1894.959976196289,
      "end": 1898.3599700927734,
      "text": " and we find that Jesus was the perfect example."
    },
    {
      "id": 37,
      "start": 1898.3599700927734,
      "end": 1899.7599716186523,
      "text": " And He gave us an example."
    },
    {
      "id": 38,
      "start": 1899.7599716186523,
      "end": 1902.6799697875977,
      "text": " It's interesting to know that it were the disciples"
    },
    {
      "id": 39,
      "start": 1902.6799697875977,
      "end": 1905.9799728393555,
      "text": " that came to Jesus after they had observed Him praying"
    },
    {
      "id": 40,
      "start": 1905.9799728393555,
      "end": 1910.5999755859375,
      "text": " and said this, Lord, teach us to pray."
    },
    {
      "id": 41,
      "start": 1910.5999755859375,
      "end": 1913.1999740600586,
      "text": " They would not ask to be taught to pray"
    },
    {
      "id": 42,
      "start": 1913.1999740600586,
      "end": 1916.5799713134766,
      "text": " if Jesus Himself was not engaged in prayer."
    },
    {
      "id": 43,
      "start": 1916.5799713134766,
      "end": 1918.339973449707,
      "text": " Yes, He is one with the Father."
    },
    {
      "id": 44,
      "start": 1918.339973449707,
      "end": 1921.3199768066406,
      "text": " He is God, but He left an example"
    },
    {
      "id": 45,
      "start": 1921.3199768066406,
      "end": 1922.6799697875977,
      "text": " that we should follow His steps."
    },
    {
      "id": 46,
      "start": 1922.6799697875977,
      "end": 1924.459976196289,
      "text": " There are a few occasions in which you find"
    },
    {
      "id": 47,
      "start": 1924.459976196289,
      "end": 1926.339973449707,
      "text": " in the Word of God, three in fact,"
    },
    {
      "id": 48,
      "start": 1926.339973449707,
      "end": 1929.0199737548828,
      "text": " in which Jesus is praying and He cries."
    },
    {
      "id": 49,
      "start": 1929.0199737548828,
      "end": 1932.1399688720703,
      "text": " He weeps at the grave of Lazarus."
    },
    {
      "id": 50,
      "start": 1932.1399688720703,
      "end": 1935.5399780273438,
      "text": " You see the compassion of the heart of Jesus."
    },
    {
      "id": 51,
      "start": 1935.5399780273438,
      "end": 1937.1799774169922,
      "text": " He knew what He was going to do,"
    },
    {
      "id": 52,
      "start": 1937.1799774169922,
      "end": 1940.1399688720703,
      "text": " but He has that compassion for Mary and Martha."
    },
    {
      "id": 53,
      "start": 1940.1399688720703,
      "end": 1941.739974975586,
      "text": " And of course, He weeps there."
    },
    {
      "id": 54,
      "start": 1941.739974975586,
      "end": 1944.7799682617188,
      "text": " The Bible says Jesus wept."
    },
    {
      "id": 55,
      "start": 1944.7799682617188,
      "end": 1947.8999786376953,
      "text": " We find that He wept over Jerusalem."
    },
    {
      "id": 56,
      "start": 1947.8999786376953,
      "end": 1950.0199737548828,
      "text": " He wept over the city."
    },
    {
      "id": 57,
      "start": 1950.0199737548828,
      "end": 1953.2599792480469,
      "text": " And then we find that He wept in the garden of Gethsemane."
    },
    {
      "id": 58,
      "start": 1953.2599792480469,
      "end": 1955.239974975586,
      "text": " I believe the reference here in verse number seven"
    },
    {
      "id": 59,
      "start": 1955.239974975586,
      "end": 1957.6599731445312,
      "text": " would be to that time in which He prayed"
    },
    {
      "id": 60,
      "start": 1957.6599731445312,
      "end": 1959.1199798583984,
      "text": " in the garden of Gethsemane."
    },
    {
      "id": 61,
      "start": 1959.1199798583984,
      "end": 1961.0599670410156,
      "text": " I want you to understand that the Bible says"
    },
    {
      "id": 62,
      "start": 1961.0599670410156,
      "end": 1963.739974975586,
      "text": " that with tears unto Him that was able to save Him"
    },
    {
      "id": 63,
      "start": 1963.739974975586,
      "end": 1967.0199737548828,
      "text": " from death and was heard and that He feared."
    },
    {
      "id": 64,
      "start": 1967.0199737548828,
      "end": 1969.97998046875,
      "text": " Understand as we look at the passage of Scripture"
    },
    {
      "id": 65,
      "start": 1969.97998046875,
      "end": 1972.7799682617188,
      "text": " that Jesus was not praying in the garden"
    },
    {
      "id": 66,
      "start": 1972.7799682617188,
      "end": 1976.219970703125,
      "text": " as you read the records in the Gospels."
    },
    {
      "id": 67,
      "start": 1976.219970703125,
      "end": 1980.3799743652344,
      "text": " He was not praying that He would have to avoid death."
    },
    {
      "id": 68,
      "start": 1980.3799743652344,
      "end": 1982.8999786376953,
      "text": " No, no, Jesus knew that's why He came."
    },
    {
      "id": 69,
      "start": 1983.7799682617188,
      "end": 1984.97998046875,
      "text": " He was born to die."
    },
    {
      "id": 70,
      "start": 1984.97998046875,
      "end": 1987.5399780273438,
      "text": " Remember, He says as He makes the great declaration"
    },
    {
      "id": 71,
      "start": 1987.5399780273438,
      "end": 1988.7799682617188,
      "text": " in John chapter number 10,"
    },
    {
      "id": 72,
      "start": 1988.7799682617188,
      "end": 1990.219970703125,
      "text": " I am the Good Shepherd."
    },
    {
      "id": 73,
      "start": 1990.219970703125,
      "end": 1991.4199676513672,
      "text": " And as the Good Shepherd,"
    },
    {
      "id": 74,
      "start": 1991.4199676513672,
      "end": 1994.8999786376953,
      "text": " I laid down my life for the sheep."
    },
    {
      "id": 75,
      "start": 1994.8999786376953,
      "end": 1997.6599731445312,
      "text": " He says in chapter number 17 of the book of John,"
    },
    {
      "id": 76,
      "start": 1997.6599731445312,
      "end": 1999.6199798583984,
      "text": " the hour is come."
    },
    {
      "id": 77,
      "start": 1999.6599731445312,
      "end": 2002.7799682617188,
      "text": " He knew that He was going to the cross of Calvary"
    },
    {
      "id": 78,
      "start": 2002.7799682617188,
      "end": 2006.4999694824219,
      "text": " and He went willingly because He loved us"
    },
    {
      "id": 79,
      "start": 2006.4999694824219,
      "end": 2009.2599792480469,
      "text": " and He understood that it required that sacrifice"
    },
    {
      "id": 80,
      "start": 2009.2599792480469,
      "end": 2013.2999725341797,
      "text": " to be made so that mankind could be redeemed."
    },
    {
      "id": 81,
      "start": 2013.2999725341797,
      "end": 2015.0199737548828,
      "text": " And we find that He was not praying"
    },
    {
      "id": 82,
      "start": 2015.0199737548828,
      "end": 2017.0599670410156,
      "text": " that death would pass from Him"
    },
    {
      "id": 83,
      "start": 2017.0599670410156,
      "end": 2018.959976196289,
      "text": " in the sense that He did not want to go"
    },
    {
      "id": 84,
      "start": 2018.959976196289,
      "end": 2020.5799713134766,
      "text": " to the cross of Calvary,"
    },
    {
      "id": 85,
      "start": 2020.5799713134766,
      "end": 2024.1399688720703,
      "text": " but we find that I believe as you find many,"
    },
    {
      "id": 86,
      "start": 2024.1399688720703,
      "end": 2025.6399688720703,
      "text": " many prophecies in the Old Testament,"
    },
    {
      "id": 87,
      "start": 2025.6399688720703,
      "end": 2027.1399688720703,
      "text": " the greatest one is Psalm 22"
    },
    {
      "id": 88,
      "start": 2027.1399688720703,
      "end": 2028.9399719238281,
      "text": " with regard to the crucifixion."
    },
    {
      "id": 89,
      "start": 2028.9399719238281,
      "end": 2031.699966430664,
      "text": " See, Jesus had to die on a cross."
    },
    {
      "id": 90,
      "start": 2031.699966430664,
      "end": 2034.1799774169922,
      "text": " It's the fulfillment of prophecy."
    },
    {
      "id": 91,
      "start": 2034.1799774169922,
      "end": 2037.1799774169922,
      "text": " And we find that I believe as He was there in the garden,"
    },
    {
      "id": 92,
      "start": 2037.1799774169922,
      "end": 2041.3799743652344,
      "text": " as He was sweating those great drops of blood"
    },
    {
      "id": 93,
      "start": 2041.3799743652344,
      "end": 2042.699966430664,
      "text": " and all that was taking place,"
    },
    {
      "id": 94,
      "start": 2042.699966430664,
      "end": 2045.4199676513672,
      "text": " I believe that there was a great spiritual battle"
    },
    {
      "id": 95,
      "start": 2045.4199676513672,
      "end": 2047.0999755859375,
      "text": " that was taking place."
    },
    {
      "id": 96,
      "start": 2047.0999755859375,
      "end": 2048.8599700927734,
      "text": " Saint was trying to kill Jesus"
    },
    {
      "id": 97,
      "start": 2048.8599700927734,
      "end": 2051.8199768066406,
      "text": " before He'd ever get to the cross."
    },
    {
      "id": 98,
      "start": 2051.8199768066406,
      "end": 2054.8199768066406,
      "text": " Not only would He be spared death in the garden"
    },
    {
      "id": 99,
      "start": 2054.8199768066406,
      "end": 2056.419967651367,
      "text": " so that He could go to the cross,"
    },
    {
      "id": 100,
      "start": 2056.419967651367,
      "end": 2059.0599670410156,
      "text": " but then on the third day as we celebrate it last week,"
    },
    {
      "id": 101,
      "start": 2059.0599670410156,
      "end": 2060.6199645996094,
      "text": " He's gonna rise in victory,"
    },
    {
      "id": 102,
      "start": 2060.6199645996094,
      "end": 2064.179962158203,
      "text": " conquering sin, death, and the grave."
    },
    {
      "id": 103,
      "start": 2064.179962158203,
      "end": 2065.3399658203125,
      "text": " We find that it says here,"
    },
    {
      "id": 104,
      "start": 2065.3399658203125,
      "end": 2067.739959716797,
      "text": " though He were a son in verse number eight,"
    },
    {
      "id": 105,
      "start": 2067.739959716797,
      "end": 2071.5399780273438,
      "text": " yet learned the obedience by the things which He suffered."
    },
    {
      "id": 106,
      "start": 2071.5399780273438,
      "end": 2073.259979248047,
      "text": " And it's interesting as you would understand"
    },
    {
      "id": 107,
      "start": 2073.259979248047,
      "end": 2076.5799865722656,
      "text": " verse number eight in light of what we've been told already"
    },
    {
      "id": 108,
      "start": 2076.5799865722656,
      "end": 2079.3399658203125,
      "text": " in chapter number four and verses 14 and 15"
    },
    {
      "id": 109,
      "start": 2079.3399658203125,
      "end": 2083.1399841308594,
      "text": " in understanding the way in which He's able to help us"
    },
    {
      "id": 110,
      "start": 2083.1399841308594,
      "end": 2084.259979248047,
      "text": " and the things that He understands."
    },
    {
      "id": 111,
      "start": 2084.259979248047,
      "end": 2086.8199768066406,
      "text": " Remember in chapter number two,"
    },
    {
      "id": 112,
      "start": 2086.8199768066406,
      "end": 2089.0199584960938,
      "text": " as we mentioned in verses 17 and 18,"
    },
    {
      "id": 113,
      "start": 2089.0199584960938,
      "end": 2092.3799743652344,
      "text": " He came, it behooved Him to be made like unto His brethren,"
    },
    {
      "id": 114,
      "start": 2092.3799743652344,
      "end": 2093.97998046875,
      "text": " yes, so that He could make reconciliation"
    },
    {
      "id": 115,
      "start": 2093.97998046875,
      "end": 2095.259979248047,
      "text": " for the sins of the people,"
    },
    {
      "id": 116,
      "start": 2095.259979248047,
      "end": 2097.5599670410156,
      "text": " but also He suffered being tempted,"
    },
    {
      "id": 117,
      "start": 2097.5599670410156,
      "end": 2101.219970703125,
      "text": " He's able to succor them that are tempted."
    },
    {
      "id": 118,
      "start": 2101.219970703125,
      "end": 2104.1399841308594,
      "text": " We find that there were lessons that He learned"
    },
    {
      "id": 119,
      "start": 2104.1399841308594,
      "end": 2106.7799682617188,
      "text": " through the experience of humanity"
    },
    {
      "id": 120,
      "start": 2106.7799682617188,
      "end": 2109.7799682617188,
      "text": " that He understood in His deity."
    },
    {
      "id": 121,
      "start": 2109.7799682617188,
      "end": 2112.4199829101562,
      "text": " He understood because He is God,"
    },
    {
      "id": 122,
      "start": 2112.4199829101562,
      "end": 2114.1199645996094,
      "text": " He has all knowledge,"
    },
    {
      "id": 123,
      "start": 2114.97998046875,
      "end": 2118.439971923828,
      "text": " but yet in His experience in that human flesh,"
    },
    {
      "id": 124,
      "start": 2118.439971923828,
      "end": 2121.3999633789062,
      "text": " He's able to, or He did I should say,"
    },
    {
      "id": 125,
      "start": 2121.3999633789062,
      "end": 2126.239959716797,
      "text": " learn things that He's then able to succor us, help us."
    },
    {
      "id": 126,
      "start": 2126.239959716797,
      "end": 2129.0799865722656,
      "text": " He is touched with the feeling of our infirmities."
    },
    {
      "id": 127,
      "start": 2129.0799865722656,
      "end": 2132.239959716797,
      "text": " This is amazing, He's God,"
    },
    {
      "id": 128,
      "start": 2132.239959716797,
      "end": 2136.3199768066406,
      "text": " but yet there were things that experientially He learned"
    },
    {
      "id": 129,
      "start": 2136.3199768066406,
      "end": 2137.679962158203,
      "text": " through His earthly ministry"
    },
    {
      "id": 130,
      "start": 2137.679962158203,
      "end": 2139.439971923828,
      "text": " and the things that He suffered"
    },
    {
      "id": 131,
      "start": 2139.439971923828,
      "end": 2142.7799682617188,
      "text": " so that He could be our great high priest."
    },
    {
      "id": 132,
      "start": 2142.7799682617188,
      "end": 2144.6199645996094,
      "text": " Verse number nine, notice it says,"
    },
    {
      "id": 133,
      "start": 2144.6199645996094,
      "end": 2145.939971923828,
      "text": " in being made perfect,"
    },
    {
      "id": 134,
      "start": 2145.939971923828,
      "end": 2149.179962158203,
      "text": " you understand that this does not in any way, shape,"
    },
    {
      "id": 135,
      "start": 2149.179962158203,
      "end": 2152.199981689453,
      "text": " or form lead anyone to come to the conclusion"
    },
    {
      "id": 136,
      "start": 2152.199981689453,
      "end": 2155.939971923828,
      "text": " that He was not perfect, He is God."
    },
    {
      "id": 137,
      "start": 2155.939971923828,
      "end": 2157.499969482422,
      "text": " The word means complete,"
    },
    {
      "id": 138,
      "start": 2157.499969482422,
      "end": 2160.739959716797,
      "text": " meaning in other words that He fulfilled"
    },
    {
      "id": 139,
      "start": 2160.739959716797,
      "end": 2162.8999633789062,
      "text": " that which He was sent to do."
    },
    {
      "id": 140,
      "start": 2162.8999633789062,
      "end": 2167.5399780273438,
      "text": " He said, I have finished the work in John 17."
    },
    {
      "id": 141,
      "start": 2167.5399780273438,
      "end": 2170.5599670410156,
      "text": " He completed what He was sent here to do,"
    },
    {
      "id": 142,
      "start": 2170.5599670410156,
      "end": 2173.9199829101562,
      "text": " the mission that He had upon the earth,"
    },
    {
      "id": 143,
      "start": 2173.9199829101562,
      "end": 2176.6399841308594,
      "text": " He completed, and it says that He became"
    },
    {
      "id": 144,
      "start": 2176.6399841308594,
      "end": 2180.8399658203125,
      "text": " the author of eternal salvation"
    },
    {
      "id": 145,
      "start": 2180.8399658203125,
      "end": 2182.97998046875,
      "text": " unto all them that obey Him."
    },
    {
      "id": 146,
      "start": 2184.1199645996094,
      "end": 2186.679962158203,
      "text": " I'm thankful for eternal salvation."
    },
    {
      "id": 147,
      "start": 2186.679962158203,
      "end": 2188.97998046875,
      "text": " By the way, in a few weeks, we'll get to chapter number six"
    },
    {
      "id": 148,
      "start": 2188.97998046875,
      "end": 2191.9599609375,
      "text": " where people like to say that you can lose your salvation."
    },
    {
      "id": 149,
      "start": 2191.9599609375,
      "end": 2193.999969482422,
      "text": " It'd be interesting that at the end of chapter five,"
    },
    {
      "id": 150,
      "start": 2193.999969482422,
      "end": 2196.5999755859375,
      "text": " He would say that He's the author of eternal salvation,"
    },
    {
      "id": 151,
      "start": 2196.5999755859375,
      "end": 2198.199981689453,
      "text": " and then in the very next section say,"
    },
    {
      "id": 152,
      "start": 2198.199981689453,
      "end": 2199.999969482422,
      "text": " you can lose your salvation."
    },
    {
      "id": 153,
      "start": 2200.3999633789062,
      "end": 2201.9199829101562,
      "text": " It doesn't make a whole lot of sense,"
    },
    {
      "id": 154,
      "start": 2201.9199829101562,
      "end": 2203.8799743652344,
      "text": " and I'll develop that in greater detail"
    },
    {
      "id": 155,
      "start": 2203.8799743652344,
      "end": 2205.5999755859375,
      "text": " as we get to chapter number six,"
    },
    {
      "id": 156,
      "start": 2205.5999755859375,
      "end": 2208.3999633789062,
      "text": " but we find here that He became the author"
    },
    {
      "id": 157,
      "start": 2208.3999633789062,
      "end": 2210.8399658203125,
      "text": " of eternal salvation unto all them that obey Him."
    },
    {
      "id": 158,
      "start": 2210.8399658203125,
      "end": 2212.239959716797,
      "text": " What does it mean by obeying Him?"
    },
    {
      "id": 159,
      "start": 2212.239959716797,
      "end": 2215.3999633789062,
      "text": " Obeying the gospel, believing that what He said is true."
    },
    {
      "id": 160,
      "start": 2215.3999633789062,
      "end": 2217.5999755859375,
      "text": " We sang this morning, trust and obey,"
    },
    {
      "id": 161,
      "start": 2217.5999755859375,
      "end": 2221.8799743652344,
      "text": " obeying the gospel that Christ is indeed God,"
    },
    {
      "id": 162,
      "start": 2221.8799743652344,
      "end": 2223.719970703125,
      "text": " that He died according to the scriptures,"
    },
    {
      "id": 163,
      "start": 2223.719970703125,
      "end": 2225.239959716797,
      "text": " that He was buried according to the scriptures,"
    },
    {
      "id": 164,
      "start": 2225.239959716797,
      "end": 2228.3199768066406,
      "text": " that He rose again according to the scriptures,"
    },
    {
      "id": 165,
      "start": 2228.3199768066406,
      "end": 2232.0799865722656,
      "text": " and what a blessing to have that eternal salvation,"
    },
    {
      "id": 166,
      "start": 2232.0799865722656,
      "end": 2234.3599853515625,
      "text": " the gift of God's eternal life,"
    },
    {
      "id": 167,
      "start": 2234.3599853515625,
      "end": 2236.3999633789062,
      "text": " through Jesus Christ our Lord."
    },
    {
      "id": 168,
      "start": 2236.3999633789062,
      "end": 2238.0799865722656,
      "text": " He's called of God and high priest"
    },
    {
      "id": 169,
      "start": 2238.0799865722656,
      "end": 2239.3599853515625,
      "text": " after the order of Melchizedek."
    },
    {
      "id": 170,
      "start": 2239.3599853515625,
      "end": 2242.199981689453,
      "text": " Now, I don't have much time, but you're at home, most of you,"
    },
    {
      "id": 171,
      "start": 2242.199981689453,
      "end": 2244.439971923828,
      "text": " and so we have a little extra time, amen,"
    },
    {
      "id": 172,
      "start": 2244.439971923828,
      "end": 2246.0399780273438,
      "text": " and I hope that you'll bear with me, why?"
    },
    {
      "id": 173,
      "start": 2246.0399780273438,
      "end": 2248.739959716797,
      "text": " Because I wanna share with you, as I mentioned a moment ago,"
    },
    {
      "id": 174,
      "start": 2248.739959716797,
      "end": 2251.2799682617188,
      "text": " that He gives the pattern and the prophecy,"
    },
    {
      "id": 175,
      "start": 2251.2799682617188,
      "end": 2253.5999755859375,
      "text": " then He presents the Lord Jesus Christ"
    },
    {
      "id": 176,
      "start": 2253.5999755859375,
      "end": 2255.6599731445312,
      "text": " as being the fulfillment of the prophecy,"
    },
    {
      "id": 177,
      "start": 2255.6599731445312,
      "end": 2257.939971923828,
      "text": " but then proves that He's superior."
    },
    {
      "id": 178,
      "start": 2258.5599670410156,
      "end": 2259.939971923828,
      "text": " I wanna give you five reasons this morning"
    },
    {
      "id": 179,
      "start": 2259.939971923828,
      "end": 2263.2799682617188,
      "text": " that Christ's priesthood is superior"
    },
    {
      "id": 180,
      "start": 2263.2799682617188,
      "end": 2265.2999877929688,
      "text": " to that of the Levitical priesthood,"
    },
    {
      "id": 181,
      "start": 2265.2999877929688,
      "end": 2268.8599853515625,
      "text": " and as we think about these five truths this morning"
    },
    {
      "id": 182,
      "start": 2268.8599853515625,
      "end": 2271.7799682617188,
      "text": " that would reveal to us His superiority,"
    },
    {
      "id": 183,
      "start": 2271.7799682617188,
      "end": 2273.97998046875,
      "text": " understand that as you stay with us"
    },
    {
      "id": 184,
      "start": 2273.97998046875,
      "end": 2275.7799682617188,
      "text": " over the next several weeks,"
    },
    {
      "id": 185,
      "start": 2275.7799682617188,
      "end": 2279.0999755859375,
      "text": " these truths will be further developed"
    },
    {
      "id": 186,
      "start": 2279.0999755859375,
      "end": 2282.1399841308594,
      "text": " as we find in chapter seven, eight, nine, and 10,"
    },
    {
      "id": 187,
      "start": 2282.1399841308594,
      "end": 2283.6199645996094,
      "text": " the development of these truths."
    },
    {
      "id": 188,
      "start": 2283.6199645996094,
      "end": 2286.8199768066406,
      "text": " In fact, as we go through these five points this morning,"
    },
    {
      "id": 189,
      "start": 2286.8199768066406,
      "end": 2289.1399841308594,
      "text": " we will make reference to several verses"
    },
    {
      "id": 190,
      "start": 2289.1399841308594,
      "end": 2293.4599609375,
      "text": " within those chapters, and so let me say this, number one,"
    },
    {
      "id": 191,
      "start": 2293.4599609375,
      "end": 2297.1399841308594,
      "text": " five reasons that Christ's priesthood is superior."
    },
    {
      "id": 192,
      "start": 2297.1399841308594,
      "end": 2300.6199645996094,
      "text": " Number one, He passed through the heavens,"
    },
    {
      "id": 193,
      "start": 2300.6199645996094,
      "end": 2302.4199829101562,
      "text": " not simply through the veil."
    },
    {
      "id": 194,
      "start": 2303.759979248047,
      "end": 2306.2999877929688,
      "text": " In the Old Testament, what happened with the priest,"
    },
    {
      "id": 195,
      "start": 2306.2999877929688,
      "end": 2308.499969482422,
      "text": " remember, he had to go and he made to go"
    },
    {
      "id": 196,
      "start": 2308.499969482422,
      "end": 2311.219970703125,
      "text": " into the Holy of Holies, he had to pass through the veil,"
    },
    {
      "id": 197,
      "start": 2311.219970703125,
      "end": 2313.699951171875,
      "text": " right, that separated the holy place"
    },
    {
      "id": 198,
      "start": 2313.699951171875,
      "end": 2315.6199951171875,
      "text": " from the Holy of Holies,"
    },
    {
      "id": 199,
      "start": 2315.6199951171875,
      "end": 2317.6199951171875,
      "text": " but we find that Jesus Christ,"
    },
    {
      "id": 200,
      "start": 2317.6199951171875,
      "end": 2320.1799926757812,
      "text": " He passed through the heavens."
    },
    {
      "id": 201,
      "start": 2320.1799926757812,
      "end": 2323.1799926757812,
      "text": " Notice in chapter number four, in verse number 14,"
    },
    {
      "id": 202,
      "start": 2323.1799926757812,
      "end": 2326.219970703125,
      "text": " seeing then that we have a great high priest."
    },
    {
      "id": 203,
      "start": 2326.219970703125,
      "end": 2328.6199951171875,
      "text": " Now, let me make a statement, I didn't say this earlier,"
    },
    {
      "id": 204,
      "start": 2328.6199951171875,
      "end": 2330.4199829101562,
      "text": " but no high priest in the Old Testament"
    },
    {
      "id": 205,
      "start": 2330.4199829101562,
      "end": 2333.5,
      "text": " was ever referred to as a great high priest."
    },
    {
      "id": 206,
      "start": 2333.5,
      "end": 2336.5399780273438,
      "text": " High priest, yes, but never great high priest."
    },
    {
      "id": 207,
      "start": 2336.5399780273438,
      "end": 2339.1799926757812,
      "text": " Jesus Christ is our great high priest."
    },
    {
      "id": 208,
      "start": 2339.1799926757812,
      "end": 2343.8199462890625,
      "text": " Notice it says this, that is passed into the heavens."
    },
    {
      "id": 209,
      "start": 2343.8599853515625,
      "end": 2348.4599609375,
      "text": " Jesus, the Son of God, let us hold fast our profession."
    },
    {
      "id": 210,
      "start": 2348.4599609375,
      "end": 2350.3399658203125,
      "text": " And so we see here in chapter number four,"
    },
    {
      "id": 211,
      "start": 2350.3399658203125,
      "end": 2352.739990234375,
      "text": " in verse number 14, that He's passed through the heavens."
    },
    {
      "id": 212,
      "start": 2352.739990234375,
      "end": 2355.3399658203125,
      "text": " Notice in chapter number 10, in verse number 12,"
    },
    {
      "id": 213,
      "start": 2355.3399658203125,
      "end": 2358.0199584960938,
      "text": " where the Bible tells us there with regard,"
    },
    {
      "id": 214,
      "start": 2358.0199584960938,
      "end": 2359.8199462890625,
      "text": " and we'll mention this verse a couple of times"
    },
    {
      "id": 215,
      "start": 2359.8199462890625,
      "end": 2362.4599609375,
      "text": " through this list, but in Hebrews 10, in verse number 12,"
    },
    {
      "id": 216,
      "start": 2362.4599609375,
      "end": 2364.0199584960938,
      "text": " the Bible says, but this man,"
    },
    {
      "id": 217,
      "start": 2364.0199584960938,
      "end": 2367.0599975585938,
      "text": " after he'd offered one sacrifice for sins forever,"
    },
    {
      "id": 218,
      "start": 2367.0599975585938,
      "end": 2370.239990234375,
      "text": " sat down on the right hand of God."
    },
    {
      "id": 219,
      "start": 2370.239990234375,
      "end": 2371.4199829101562,
      "text": " He passed through the heavens"
    },
    {
      "id": 220,
      "start": 2371.4199829101562,
      "end": 2373.0199584960938,
      "text": " and He's in the throne room of God,"
    },
    {
      "id": 221,
      "start": 2373.0199584960938,
      "end": 2374.8599853515625,
      "text": " even at this very moment."
    },
    {
      "id": 222,
      "start": 2375.97998046875,
      "end": 2379.6599731445312,
      "text": " See, in the Old Testament, the Levitical priesthood,"
    },
    {
      "id": 223,
      "start": 2379.6599731445312,
      "end": 2381.5399780273438,
      "text": " they could not pass through the heavens."
    },
    {
      "id": 224,
      "start": 2381.5399780273438,
      "end": 2384.3399658203125,
      "text": " They were not in the throne room of God."
    },
    {
      "id": 225,
      "start": 2384.3399658203125,
      "end": 2386.2999877929688,
      "text": " Yes, they were in that earthly place"
    },
    {
      "id": 226,
      "start": 2386.2999877929688,
      "end": 2389.8399658203125,
      "text": " where God chose to show His presence,"
    },
    {
      "id": 227,
      "start": 2389.8399658203125,
      "end": 2392.739990234375,
      "text": " to manifest His presence in the Old Testament."
    },
    {
      "id": 228,
      "start": 2392.739990234375,
      "end": 2395.8999633789062,
      "text": " Yes, in the tabernacle first, but then in the temple."
    },
    {
      "id": 229,
      "start": 2395.8999633789062,
      "end": 2397.8599853515625,
      "text": " But we find that in Hebrews chapter nine,"
    },
    {
      "id": 230,
      "start": 2397.8599853515625,
      "end": 2399.699951171875,
      "text": " is we would make a contrast."
    },
    {
      "id": 231,
      "start": 2399.699951171875,
      "end": 2401.2999877929688,
      "text": " The Bible says this."
    },
    {
      "id": 0,
      "start": 2401.2999877929688,
      "end": 2404.2999877929688,
      "text": " Speaking of the priest that went always, look in verse number six,"
    },
    {
      "id": 1,
      "start": 2404.2999877929688,
      "end": 2406.6799879074097,
      "text": " now when these things were thus ordained,"
    },
    {
      "id": 2,
      "start": 2406.6799879074097,
      "end": 2412.1399879455566,
      "text": " the priest went always into the first tabernacle, accomplishing the service of God."
    },
    {
      "id": 3,
      "start": 2412.1399879455566,
      "end": 2413.9399881362915,
      "text": " That was in the holy place."
    },
    {
      "id": 4,
      "start": 2413.9399881362915,
      "end": 2417.699987411499,
      "text": " They would go in there, and they would do the service of God."
    },
    {
      "id": 5,
      "start": 2417.699987411499,
      "end": 2419.279987335205,
      "text": " But notice in verse number seven,"
    },
    {
      "id": 6,
      "start": 2419.279987335205,
      "end": 2423.699987411499,
      "text": " but into the second, what is he referring to? The Holy of Holies."
    },
    {
      "id": 7,
      "start": 2423.699987411499,
      "end": 2426.039987564087,
      "text": " Where the Ark of the Covenant was, the mercy seat, right?"
    },
    {
      "id": 8,
      "start": 2426.039987564087,
      "end": 2428.499988555908,
      "text": " He says that he goes into the second, look, it says this,"
    },
    {
      "id": 9,
      "start": 2428.499988555908,
      "end": 2431.0799884796143,
      "text": " but into the second went the high priest alone,"
    },
    {
      "id": 10,
      "start": 2431.0799884796143,
      "end": 2434.959987640381,
      "text": " once every year, not without blood,"
    },
    {
      "id": 11,
      "start": 2434.959987640381,
      "end": 2439.3799896240234,
      "text": " which he offered for himself and for the errors of the people."
    },
    {
      "id": 12,
      "start": 2439.3799896240234,
      "end": 2442.2599868774414,
      "text": " So we find, number one, why is Christ's priesthood superior?"
    },
    {
      "id": 13,
      "start": 2442.2599868774414,
      "end": 2444.8799896240234,
      "text": " Well, he passed through the heavens, not simply through the veil."
    },
    {
      "id": 14,
      "start": 2444.8799896240234,
      "end": 2451.219985961914,
      "text": " Number two, his offering was for the sin of the world, but not for his own."
    },
    {
      "id": 15,
      "start": 2451.219985961914,
      "end": 2454.519989013672,
      "text": " His offering was for the sin of the world, but not for his own."
    },
    {
      "id": 16,
      "start": 2454.519989013672,
      "end": 2456.4799880981445,
      "text": " See, he had no sin."
    },
    {
      "id": 17,
      "start": 2456.4799880981445,
      "end": 2460.3199882507324,
      "text": " He did not have to make an atonement for his sin first,"
    },
    {
      "id": 18,
      "start": 2460.339988708496,
      "end": 2461.939987182617,
      "text": " and then for the sin of the people."
    },
    {
      "id": 19,
      "start": 2461.939987182617,
      "end": 2465.5999908447266,
      "text": " No, he could never be our Savior if he was sinful."
    },
    {
      "id": 20,
      "start": 2465.5999908447266,
      "end": 2471.6399841308594,
      "text": " He had no sin, and therefore his offering was an offering for the sin of the world."
    },
    {
      "id": 21,
      "start": 2471.6399841308594,
      "end": 2476.7799911499023,
      "text": " We notice here, again, in chapter number four and verse number 15 of Hebrews,"
    },
    {
      "id": 22,
      "start": 2476.7799911499023,
      "end": 2477.5799865722656,
      "text": " where the Bible says,"
    },
    {
      "id": 23,
      "start": 2477.5799865722656,
      "end": 2482.1599884033203,
      "text": " for we have not an high priest which cannot be touched with the feeling of our infirmities,"
    },
    {
      "id": 24,
      "start": 2482.1599884033203,
      "end": 2488.999984741211,
      "text": " but was in all points tempted like as we are yet without sin."
    },
    {
      "id": 25,
      "start": 2489.0999908447266,
      "end": 2491.559989929199,
      "text": " 2 Corinthians 5 and verse number 21,"
    },
    {
      "id": 26,
      "start": 2491.559989929199,
      "end": 2495.559989929199,
      "text": " for he hath made him to be sin for us who knew no sin,"
    },
    {
      "id": 27,
      "start": 2495.559989929199,
      "end": 2499.239990234375,
      "text": " that we might be made the righteousness of God in him."
    },
    {
      "id": 28,
      "start": 2499.239990234375,
      "end": 2501.9799880981445,
      "text": " 1 Peter chapter 3 and verse number 18,"
    },
    {
      "id": 29,
      "start": 2501.9799880981445,
      "end": 2504.819984436035,
      "text": " where Peter says this about the Lord Jesus Christ,"
    },
    {
      "id": 30,
      "start": 2504.819984436035,
      "end": 2510.5799865722656,
      "text": " for Christ also hath once suffered for sins the just for the unjust,"
    },
    {
      "id": 31,
      "start": 2510.5799865722656,
      "end": 2513.959991455078,
      "text": " that he might bring us to God, being put to death in the flesh,"
    },
    {
      "id": 32,
      "start": 2513.959991455078,
      "end": 2516.999984741211,
      "text": " but quickened by the Spirit."
    },
    {
      "id": 33,
      "start": 2516.999984741211,
      "end": 2520.459991455078,
      "text": " See, this was in contrast to the Levitical priesthood."
    },
    {
      "id": 34,
      "start": 2520.459991455078,
      "end": 2524.439987182617,
      "text": " We found, as we mentioned in verse number 3 of Hebrews chapter number 5,"
    },
    {
      "id": 35,
      "start": 2524.439987182617,
      "end": 2527.819984436035,
      "text": " that when they would go in to make these sacrifices for sins,"
    },
    {
      "id": 36,
      "start": 2527.819984436035,
      "end": 2529.019989013672,
      "text": " notice in verse number 3,"
    },
    {
      "id": 37,
      "start": 2529.019989013672,
      "end": 2532.7999877929688,
      "text": " and by reason hereof he ought as for the people,"
    },
    {
      "id": 38,
      "start": 2532.7999877929688,
      "end": 2537.3999938964844,
      "text": " so also for himself to offer for sins."
    },
    {
      "id": 39,
      "start": 2537.3999938964844,
      "end": 2540.239990234375,
      "text": " We read already in Hebrews 9 and verse number 7,"
    },
    {
      "id": 40,
      "start": 2540.239990234375,
      "end": 2543.8199920654297,
      "text": " where the Bible says that he could only go into the Holy of Holies once every year,"
    },
    {
      "id": 41,
      "start": 2543.8199920654297,
      "end": 2547.699981689453,
      "text": " not without blood, which he offered for himself"
    },
    {
      "id": 42,
      "start": 2547.699981689453,
      "end": 2550.1399841308594,
      "text": " and for the errors of the people."
    },
    {
      "id": 43,
      "start": 2550.1399841308594,
      "end": 2554.739990234375,
      "text": " See, Christ's priesthood is superior because his offering was for the sin of the world,"
    },
    {
      "id": 44,
      "start": 2554.739990234375,
      "end": 2557.939987182617,
      "text": " but not for his own sin, because he had no sin."
    },
    {
      "id": 45,
      "start": 2557.939987182617,
      "end": 2560.5799865722656,
      "text": " Number 3, why is Christ's priesthood superior?"
    },
    {
      "id": 46,
      "start": 2560.5799865722656,
      "end": 2564.3799896240234,
      "text": " Because he conquered death and lives forever."
    },
    {
      "id": 47,
      "start": 2564.3799896240234,
      "end": 2569.0599822998047,
      "text": " The duration of his priesthood we mentioned in verse number 6 of Hebrews 5,"
    },
    {
      "id": 48,
      "start": 2569.0599822998047,
      "end": 2573.459991455078,
      "text": " where the Bible tells us that thou art a priest forever,"
    },
    {
      "id": 49,
      "start": 2573.499984741211,
      "end": 2575.259994506836,
      "text": " after the order of Melchizedek."
    },
    {
      "id": 50,
      "start": 2575.259994506836,
      "end": 2577.3399810791016,
      "text": " We found in verse number 9 that the Bible says"
    },
    {
      "id": 51,
      "start": 2577.3399810791016,
      "end": 2582.499984741211,
      "text": " that he became the author of eternal salvation."
    },
    {
      "id": 52,
      "start": 2582.499984741211,
      "end": 2584.939987182617,
      "text": " In chapter number 7, in verse number 25,"
    },
    {
      "id": 53,
      "start": 2584.939987182617,
      "end": 2588.779983520508,
      "text": " speaking of our Lord and Savior Jesus Christ, our great High Priest,"
    },
    {
      "id": 54,
      "start": 2588.779983520508,
      "end": 2591.0599822998047,
      "text": " the Bible says in that verse of Scripture,"
    },
    {
      "id": 55,
      "start": 2591.0599822998047,
      "end": 2594.4199829101562,
      "text": " wherefore he is able also to save them to the uttermost"
    },
    {
      "id": 56,
      "start": 2594.4199829101562,
      "end": 2596.1399841308594,
      "text": " that come unto God by him,"
    },
    {
      "id": 57,
      "start": 2596.1399841308594,
      "end": 2600.939987182617,
      "text": " seeing he ever liveth to make intercession for them."
    },
    {
      "id": 58,
      "start": 2600.939987182617,
      "end": 2604.3399810791016,
      "text": " Remember, as we read the passage of Scripture from the book of Revelation"
    },
    {
      "id": 59,
      "start": 2604.3399810791016,
      "end": 2606.779983520508,
      "text": " last week on Sunday morning to begin our message,"
    },
    {
      "id": 60,
      "start": 2606.779983520508,
      "end": 2609.5799865722656,
      "text": " and we noticed in Revelation 1, in verse number 18,"
    },
    {
      "id": 61,
      "start": 2609.5799865722656,
      "end": 2613.6599884033203,
      "text": " where Jesus said, I am he that liveth and was dead,"
    },
    {
      "id": 62,
      "start": 2613.6599884033203,
      "end": 2618.2999877929688,
      "text": " and behold, I am alive forevermore."
    },
    {
      "id": 63,
      "start": 2618.2999877929688,
      "end": 2622.8199920654297,
      "text": " We find that this is not the case for the Old Testament Levitical priesthood."
    },
    {
      "id": 64,
      "start": 2622.8199920654297,
      "end": 2625.6599884033203,
      "text": " If we think about the order of the Levitical priesthood,"
    },
    {
      "id": 65,
      "start": 2625.6599884033203,
      "end": 2628.4199829101562,
      "text": " we understand that they died, right?"
    },
    {
      "id": 66,
      "start": 2628.4199829101562,
      "end": 2630.2999877929688,
      "text": " Chapter number 7, in verse number 23,"
    },
    {
      "id": 67,
      "start": 2630.3399810791016,
      "end": 2632.019989013672,
      "text": " and they truly were many priests"
    },
    {
      "id": 68,
      "start": 2632.019989013672,
      "end": 2637.0999908447266,
      "text": " because they were not suffered to continue by reason of death."
    },
    {
      "id": 69,
      "start": 2637.0999908447266,
      "end": 2639.6599884033203,
      "text": " It's interesting, side note, if you study the Old Testament,"
    },
    {
      "id": 70,
      "start": 2639.6599884033203,
      "end": 2641.499984741211,
      "text": " and we'll get there eventually in the book of Joshua,"
    },
    {
      "id": 71,
      "start": 2641.499984741211,
      "end": 2645.8599853515625,
      "text": " if you're with us for our Joshua series on Monday, Tuesday, Thursday, and Friday."
    },
    {
      "id": 72,
      "start": 2645.8599853515625,
      "end": 2647.97998046875,
      "text": " But as we go through that series, eventually,"
    },
    {
      "id": 73,
      "start": 2647.97998046875,
      "end": 2649.779983520508,
      "text": " and I don't know how long from now,"
    },
    {
      "id": 74,
      "start": 2649.779983520508,
      "end": 2652.459991455078,
      "text": " but eventually we'll get to the cities of refuge."
    },
    {
      "id": 75,
      "start": 2652.459991455078,
      "end": 2653.97998046875,
      "text": " It's interesting about the cities of refuge,"
    },
    {
      "id": 76,
      "start": 2653.97998046875,
      "end": 2655.539993286133,
      "text": " I'll make a reference to it this evening"
    },
    {
      "id": 77,
      "start": 2655.539993286133,
      "end": 2657.6199951171875,
      "text": " as I preach through Genesis chapter number 9,"
    },
    {
      "id": 78,
      "start": 2657.6199951171875,
      "end": 2660.739990234375,
      "text": " the first seven verses tonight of that passage of Scripture,"
    },
    {
      "id": 79,
      "start": 2660.739990234375,
      "end": 2662.699981689453,
      "text": " and I'll make a reference to the cities of refuge,"
    },
    {
      "id": 80,
      "start": 2662.699981689453,
      "end": 2666.9400024414062,
      "text": " though we won't deal with it in entirety,"
    },
    {
      "id": 81,
      "start": 2666.9400024414062,
      "end": 2668.6599731445312,
      "text": " but we do find that the cities of refuge,"
    },
    {
      "id": 82,
      "start": 2668.6599731445312,
      "end": 2670.3399963378906,
      "text": " when someone went to a city of refuge,"
    },
    {
      "id": 83,
      "start": 2670.3399963378906,
      "end": 2673.259979248047,
      "text": " he had to stay there until the death of a high priest."
    },
    {
      "id": 84,
      "start": 2673.259979248047,
      "end": 2675.0599975585938,
      "text": " Then he could return."
    },
    {
      "id": 85,
      "start": 2675.0599975585938,
      "end": 2679.0999755859375,
      "text": " See, but our priest, our great high priest, he conquered death."
    },
    {
      "id": 86,
      "start": 2679.0999755859375,
      "end": 2680.779998779297,
      "text": " He lives forever."
    },
    {
      "id": 87,
      "start": 2680.779998779297,
      "end": 2683.1799926757812,
      "text": " His priesthood is superior."
    },
    {
      "id": 88,
      "start": 2683.1799926757812,
      "end": 2689.8999938964844,
      "text": " Number four, he made one offering for sin forever."
    },
    {
      "id": 89,
      "start": 2689.8999938964844,
      "end": 2693.0999755859375,
      "text": " See, the Bible tells us as we would consider this truth,"
    },
    {
      "id": 90,
      "start": 2693.0999755859375,
      "end": 2696.459991455078,
      "text": " and I mentioned already in Hebrews 10 and verse number 12 where the Bible says,"
    },
    {
      "id": 91,
      "start": 2696.459991455078,
      "end": 2700.459991455078,
      "text": " but this man, after he made one sacrifice for sin forever,"
    },
    {
      "id": 92,
      "start": 2700.459991455078,
      "end": 2702.259979248047,
      "text": " sat down on the right hand of God."
    },
    {
      "id": 93,
      "start": 2702.259979248047,
      "end": 2707.0599975585938,
      "text": " See, that's the priesthood of our great high priest,"
    },
    {
      "id": 94,
      "start": 2707.0599975585938,
      "end": 2709.5,
      "text": " the Lord Jesus Christ after the order of Melchizedek,"
    },
    {
      "id": 95,
      "start": 2709.5,
      "end": 2711.0599975585938,
      "text": " as we'll mention here in just a moment,"
    },
    {
      "id": 96,
      "start": 2711.0999755859375,
      "end": 2714.1399841308594,
      "text": " but we find that he made one offering for sin forever."
    },
    {
      "id": 97,
      "start": 2714.1399841308594,
      "end": 2717.6199951171875,
      "text": " That was not the case under the Levitical order."
    },
    {
      "id": 98,
      "start": 2717.6199951171875,
      "end": 2720.739990234375,
      "text": " The Bible actually begins in chapter number 10 and verse number 1,"
    },
    {
      "id": 99,
      "start": 2720.739990234375,
      "end": 2722.8599853515625,
      "text": " as I referenced this verse of Scripture"
    },
    {
      "id": 100,
      "start": 2722.8599853515625,
      "end": 2724.8599853515625,
      "text": " in the very beginning of the message this morning,"
    },
    {
      "id": 101,
      "start": 2724.8599853515625,
      "end": 2729.0999755859375,
      "text": " for the law having a shadow of good things to come,"
    },
    {
      "id": 102,
      "start": 2729.0999755859375,
      "end": 2731.0999755859375,
      "text": " and not the very image of the things,"
    },
    {
      "id": 103,
      "start": 2731.0999755859375,
      "end": 2734.5,
      "text": " can never with those sacrifices, notice this phrase,"
    },
    {
      "id": 104,
      "start": 2734.5,
      "end": 2740.0599975585938,
      "text": " which they offered year by year continually,"
    },
    {
      "id": 105,
      "start": 2740.0599975585938,
      "end": 2742.6199951171875,
      "text": " to make the comers thereunto perfect."
    },
    {
      "id": 106,
      "start": 2742.6199951171875,
      "end": 2746.5,
      "text": " For then would they not have ceased to be offered?"
    },
    {
      "id": 107,
      "start": 2746.5,
      "end": 2749.220001220703,
      "text": " In other words, if they could accomplish in their offering"
    },
    {
      "id": 108,
      "start": 2749.220001220703,
      "end": 2751.4199829101562,
      "text": " what Christ accomplished in one offering,"
    },
    {
      "id": 109,
      "start": 2751.4199829101562,
      "end": 2753.8199768066406,
      "text": " why'd they have to keep bringing it every year?"
    },
    {
      "id": 110,
      "start": 2753.8199768066406,
      "end": 2756.019989013672,
      "text": " Because the blood of bulls and goats, notice,"
    },
    {
      "id": 111,
      "start": 2756.019989013672,
      "end": 2758.8999938964844,
      "text": " as we continue here in the passage of Scripture in verse number 4,"
    },
    {
      "id": 112,
      "start": 2758.8999938964844,
      "end": 2764.1399841308594,
      "text": " it is not possible that the blood of bulls and goats should take away sins."
    },
    {
      "id": 113,
      "start": 2764.1399841308594,
      "end": 2769.9400024414062,
      "text": " We find that Jesus Christ, one sacrifice for sin forever."
    },
    {
      "id": 114,
      "start": 2769.97998046875,
      "end": 2772.019989013672,
      "text": " His priesthood is superior, number one,"
    },
    {
      "id": 115,
      "start": 2772.019989013672,
      "end": 2774.739990234375,
      "text": " because he passed through the heavens, not simply through the veil."
    },
    {
      "id": 116,
      "start": 2774.739990234375,
      "end": 2777.3399963378906,
      "text": " Number two, his offering was for the sin of the world,"
    },
    {
      "id": 117,
      "start": 2777.3399963378906,
      "end": 2779.779998779297,
      "text": " but not for his own, because he had no sin."
    },
    {
      "id": 118,
      "start": 2779.779998779297,
      "end": 2783.1799926757812,
      "text": " Number three, he conquered death and lives forever."
    },
    {
      "id": 119,
      "start": 2783.1799926757812,
      "end": 2785.779998779297,
      "text": " Number four, he made one offering for sin forever."
    },
    {
      "id": 120,
      "start": 2785.779998779297,
      "end": 2789.9400024414062,
      "text": " And number five, his priesthood is after the order of Melchizedek."
    },
    {
      "id": 121,
      "start": 2789.9400024414062,
      "end": 2793.699981689453,
      "text": " Again, I mentioned several things about that during the message this morning,"
    },
    {
      "id": 122,
      "start": 2793.699981689453,
      "end": 2797.97998046875,
      "text": " as we dealt with the prophecy that is given in verses 6 and verse number 10."
    },
    {
      "id": 123,
      "start": 2797.97998046875,
      "end": 2801.739990234375,
      "text": " And we find that the truths of this passage of Scripture"
    },
    {
      "id": 124,
      "start": 2801.739990234375,
      "end": 2805.8999938964844,
      "text": " will be developed in great detail as we come to chapter number 7."
    },
    {
      "id": 125,
      "start": 2805.8999938964844,
      "end": 2809.9400024414062,
      "text": " And really, much of the passage in chapter number 7 of the book of Hebrews"
    },
    {
      "id": 126,
      "start": 2809.9400024414062,
      "end": 2814.2999877929688,
      "text": " deals with that very truth of the priesthood of Melchizedek"
    },
    {
      "id": 127,
      "start": 2814.2999877929688,
      "end": 2816.459991455078,
      "text": " after the order of Melchizedek."
    },
    {
      "id": 128,
      "start": 2816.459991455078,
      "end": 2819.3399963378906,
      "text": " Jesus is not of the tribe of Levi."
    },
    {
      "id": 129,
      "start": 2819.3399963378906,
      "end": 2821.259979248047,
      "text": " He's of the tribe of Judah."
    },
    {
      "id": 130,
      "start": 2821.259979248047,
      "end": 2826.8599853515625,
      "text": " He could not be a Levitical priest, but he's of a higher, greater priesthood."
    },
    {
      "id": 131,
      "start": 2826.8599853515625,
      "end": 2830.0999755859375,
      "text": " That's the order of Melchizedek."
    },
    {
      "id": 132,
      "start": 2830.0999755859375,
      "end": 2832.8599853515625,
      "text": " And for those five reasons, and there's probably more that we could give,"
    },
    {
      "id": 133,
      "start": 2832.8599853515625,
      "end": 2839.5399780273438,
      "text": " but for five reasons to prove that Christ's priesthood is superior."
    },
    {
      "id": 134,
      "start": 2839.5399780273438,
      "end": 2844.0999755859375,
      "text": " Now, as we take all of this truth and understand that it's foundational"
    },
    {
      "id": 135,
      "start": 2844.0999755859375,
      "end": 2848.019989013672,
      "text": " for what we will study in weeks to come, in chapters 7 through 10,"
    },
    {
      "id": 136,
      "start": 2848.019989013672,
      "end": 2851.9400024414062,
      "text": " I want you to be encouraged this morning by the very truth"
    },
    {
      "id": 137,
      "start": 2851.9400024414062,
      "end": 2854.9400024414062,
      "text": " that we have a great high priest."
    },
    {
      "id": 138,
      "start": 2854.9400024414062,
      "end": 2859.9400024414062,
      "text": " Jesus, the Son of God, and He is our Savior."
    },
    {
      "id": 139,
      "start": 2859.9400024414062,
      "end": 2863.220001220703,
      "text": " And this morning, as we understand the passage of Scripture"
    },
    {
      "id": 140,
      "start": 2863.220001220703,
      "end": 2865.259979248047,
      "text": " and understand what Jesus did"
    },
    {
      "id": 141,
      "start": 2865.259979248047,
      "end": 2869.97998046875,
      "text": " and how He is superior to that Old Testament priesthood."
    },
    {
      "id": 142,
      "start": 2869.97998046875,
      "end": 2873.1399841308594,
      "text": " Now, for really all of us,"
    },
    {
      "id": 143,
      "start": 2873.1399841308594,
      "end": 2877.259979248047,
      "text": " unless there are some watching that I'm not sure of your background,"
    },
    {
      "id": 144,
      "start": 2877.259979248047,
      "end": 2880.1399841308594,
      "text": " we've not been in any type of a situation"
    },
    {
      "id": 145,
      "start": 2880.1399841308594,
      "end": 2883.9400024414062,
      "text": " where we've had the same type of experience"
    },
    {
      "id": 146,
      "start": 2883.9400024414062,
      "end": 2887.459991455078,
      "text": " as these initial recipients to the book of Hebrews."
    },
    {
      "id": 147,
      "start": 2887.459991455078,
      "end": 2890.4199829101562,
      "text": " But I want you to think about the impact upon these individuals."
    },
    {
      "id": 148,
      "start": 2890.4199829101562,
      "end": 2892.1799926757812,
      "text": " They see the temple."
    },
    {
      "id": 149,
      "start": 2892.1799926757812,
      "end": 2894.779998779297,
      "text": " They see everything that's taking place."
    },
    {
      "id": 150,
      "start": 2894.779998779297,
      "end": 2897.259979248047,
      "text": " They see the offerings. They see the priest there."
    },
    {
      "id": 151,
      "start": 2897.259979248047,
      "end": 2901.3399963378906,
      "text": " Remember, there were some wicked high priests during the time of Christ's day."
    },
    {
      "id": 152,
      "start": 2901.3399963378906,
      "end": 2904.9400024414062,
      "text": " In fact, they were ones that condemned Him to death."
    },
    {
      "id": 153,
      "start": 2904.97998046875,
      "end": 2911.4199829101562,
      "text": " We find that here, as we come to these recipients"
    },
    {
      "id": 154,
      "start": 2911.4199829101562,
      "end": 2913.9400024414062,
      "text": " that would initially have received this letter"
    },
    {
      "id": 155,
      "start": 2913.9400024414062,
      "end": 2917.2999877929688,
      "text": " that we call in our canon of Scripture the book of Hebrews,"
    },
    {
      "id": 156,
      "start": 2917.2999877929688,
      "end": 2922.3800048828125,
      "text": " can you imagine how encouraging this truth would have been to them?"
    },
    {
      "id": 157,
      "start": 2922.3800048828125,
      "end": 2924.1799926757812,
      "text": " So you don't have a high priest over there."
    },
    {
      "id": 158,
      "start": 2924.1799926757812,
      "end": 2928.7000122070312,
      "text": " You have a great high priest that is far superior"
    },
    {
      "id": 159,
      "start": 2928.7000122070312,
      "end": 2931.219970703125,
      "text": " to any of that Levitical priesthood."
    },
    {
      "id": 160,
      "start": 2931.219970703125,
      "end": 2935.8200073242188,
      "text": " That Levitical priesthood was there for a purpose and it served its purpose."
    },
    {
      "id": 161,
      "start": 2935.8200073242188,
      "end": 2937.5399780273438,
      "text": " But now we have a greater priest."
    },
    {
      "id": 162,
      "start": 2937.5399780273438,
      "end": 2940.8599853515625,
      "text": " We have a great high priest."
    },
    {
      "id": 163,
      "start": 2940.8599853515625,
      "end": 2943.8200073242188,
      "text": " And I believe that these initial recipients,"
    },
    {
      "id": 164,
      "start": 2943.8200073242188,
      "end": 2947.1400146484375,
      "text": " those that initially received this letter, the book of Hebrews,"
    },
    {
      "id": 165,
      "start": 2947.1400146484375,
      "end": 2949.9400024414062,
      "text": " oh, how encouraged they must have been"
    },
    {
      "id": 166,
      "start": 2949.9400024414062,
      "end": 2953.7799682617188,
      "text": " as they came to the truth that we're studying this morning."
    },
    {
      "id": 167,
      "start": 2953.7799682617188,
      "end": 2956.0999755859375,
      "text": " Our great high priest."
    },
    {
      "id": 168,
      "start": 2956.0999755859375,
      "end": 2960.1400146484375,
      "text": " What a joy to know that he indeed is our great high priest,"
    },
    {
      "id": 169,
      "start": 2960.1400146484375,
      "end": 2962.0999755859375,
      "text": " that he's the fulfillment of the prophecy,"
    },
    {
      "id": 170,
      "start": 2962.0999755859375,
      "end": 2967.5399780273438,
      "text": " that he follows the pattern as far as the truth that he was called of God."
    },
    {
      "id": 171,
      "start": 2967.5399780273438,
      "end": 2969.9400024414062,
      "text": " He is compassionate towards us."
    },
    {
      "id": 172,
      "start": 2969.9400024414062,
      "end": 2973.6599731445312,
      "text": " And he made the sacrifice that we could never make,"
    },
    {
      "id": 173,
      "start": 2973.6599731445312,
      "end": 2977.7799682617188,
      "text": " the sacrifice for sin of his own body, his own blood."
    },
    {
      "id": 174,
      "start": 2977.7799682617188,
      "end": 2979.8999633789062,
      "text": " And what a joy to know that he is superior."
    },
    {
      "id": 175,
      "start": 2979.8999633789062,
      "end": 2982.1400146484375,
      "text": " Let's pray. Father, we love you."
    },
    {
      "id": 176,
      "start": 2982.1400146484375,
      "end": 2983.9400024414062,
      "text": " We thank you for loving us."
    },
    {
      "id": 177,
      "start": 2983.9400024414062,
      "end": 2988.0599975585938,
      "text": " We thank you for our wonderful Savior, the Lord Jesus Christ."
    },
    {
      "id": 178,
      "start": 2988.1400146484375,
      "end": 2991.2999877929688,
      "text": " He is our great high priest."
    },
    {
      "id": 179,
      "start": 2991.2999877929688,
      "end": 2994.8599853515625,
      "text": " We thank you that he ever liveth to make intercession for us."
    },
    {
      "id": 180,
      "start": 2994.8599853515625,
      "end": 2998.7000122070312,
      "text": " We thank you that his sacrifice on the cross of Calvary"
    },
    {
      "id": 181,
      "start": 2998.7000122070312,
      "end": 3000.7799682617188,
      "text": " was accepted and sufficient,"
    },
    {
      "id": 182,
      "start": 3000.7799682617188,
      "end": 3003.7799682617188,
      "text": " satisfying and fulfilling for us."
    },
    {
      "id": 0,
      "start": 3003.7799682617188,
      "end": 3009.7799682617188,
      "text": " the demands for man to be redeemed and reconciled to God."
    },
    {
      "id": 1,
      "start": 3009.7799682617188,
      "end": 3011.7799682617188,
      "text": " We thank You for Thy Word."
    },
    {
      "id": 2,
      "start": 3011.7799682617188,
      "end": 3013.7799682617188,
      "text": " How we're encouraged this morning."
    },
    {
      "id": 3,
      "start": 3013.7799682617188,
      "end": 3015.7799682617188,
      "text": " Father, if there'd be one listening"
    },
    {
      "id": 4,
      "start": 3015.7799682617188,
      "end": 3017.7799682617188,
      "text": " who's never trusted the Lord Jesus Christ"
    },
    {
      "id": 5,
      "start": 3017.7799682617188,
      "end": 3019.7799682617188,
      "text": " as their personal Savior,"
    },
    {
      "id": 6,
      "start": 3019.7799682617188,
      "end": 3021.7799682617188,
      "text": " I pray that today,"
    },
    {
      "id": 7,
      "start": 3021.7799682617188,
      "end": 3023.7799682617188,
      "text": " the Holy Spirit of God would work in their heart,"
    },
    {
      "id": 8,
      "start": 3023.7799682617188,
      "end": 3025.7799682617188,
      "text": " draw them to Himself,"
    },
    {
      "id": 9,
      "start": 3025.7799682617188,
      "end": 3029.7799682617188,
      "text": " help them understand that their sin"
    },
    {
      "id": 10,
      "start": 3029.7799682617188,
      "end": 3031.7799682617188,
      "text": " brings with it a penalty."
    },
    {
      "id": 11,
      "start": 3031.7799682617188,
      "end": 3033.7799682617188,
      "text": " That penalty is death."
    },
    {
      "id": 12,
      "start": 3033.7799682617188,
      "end": 3035.7799682617188,
      "text": " Not speaking of physical, but spiritual death."
    },
    {
      "id": 13,
      "start": 3035.7799682617188,
      "end": 3037.7799682617188,
      "text": " Separation from God for all of eternity"
    },
    {
      "id": 14,
      "start": 3037.7799682617188,
      "end": 3039.7799682617188,
      "text": " in the lake of fire."
    },
    {
      "id": 15,
      "start": 3039.7799682617188,
      "end": 3041.7799682617188,
      "text": " Oh, I pray that You would"
    },
    {
      "id": 16,
      "start": 3041.7799682617188,
      "end": 3043.7799682617188,
      "text": " convict them of their sin,"
    },
    {
      "id": 17,
      "start": 3043.7799682617188,
      "end": 3045.7799682617188,
      "text": " of Christ's righteousness,"
    },
    {
      "id": 18,
      "start": 3045.7799682617188,
      "end": 3047.7799682617188,
      "text": " of judgment to come."
    },
    {
      "id": 19,
      "start": 3047.7799682617188,
      "end": 3049.7799682617188,
      "text": " We thank You"
    },
    {
      "id": 20,
      "start": 3049.7799682617188,
      "end": 3051.7799682617188,
      "text": " that the Lord Jesus Christ is our great High Priest."
    },
    {
      "id": 21,
      "start": 3051.7799682617188,
      "end": 3053.7799682617188,
      "text": " I pray that we'd be encouraged"
    },
    {
      "id": 22,
      "start": 3053.7799682617188,
      "end": 3055.7799682617188,
      "text": " by that truth this day."
    },
    {
      "id": 23,
      "start": 3055.7799682617188,
      "end": 3057.7799682617188,
      "text": " We'll thank You for the work that You'll do."
    },
    {
      "id": 24,
      "start": 3057.7799682617188,
      "end": 3059.7799682617188,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 25,
      "start": 3059.7799682617188,
      "end": 3061.7799682617188,
      "text": " We have a moment of invitation here."
    },
    {
      "id": 26,
      "start": 3061.7799682617188,
      "end": 3063.7799682617188,
      "text": " For those that are watching at home,"
    },
    {
      "id": 27,
      "start": 3063.7799682617188,
      "end": 3065.7799682617188,
      "text": " wherever you may be, we'd ask you to reflect"
    },
    {
      "id": 28,
      "start": 3065.7799682617188,
      "end": 3067.7799682617188,
      "text": " upon what you've heard this morning."
    },
    {
      "id": 29,
      "start": 3067.7799682617188,
      "end": 3069.7799682617188,
      "text": " As we have a time of invitation here,"
    },
    {
      "id": 30,
      "start": 3069.7799682617188,
      "end": 3071.7799682617188,
      "text": " would you also take some time there"
    },
    {
      "id": 31,
      "start": 3071.7799682617188,
      "end": 3073.7799682617188,
      "text": " at your home or your place"
    },
    {
      "id": 32,
      "start": 3073.7799682617188,
      "end": 3075.7799682617188,
      "text": " and reflect on what you've heard this morning"
    },
    {
      "id": 33,
      "start": 3075.7799682617188,
      "end": 3077.7799682617188,
      "text": " from the Word of God."
    },
    {
      "id": 34,
      "start": 3077.7799682617188,
      "end": 3079.7799682617188,
      "text": " Kimberly will play quietly on the piano here."
    }
  ],
  "processed_at": "2025-04-17T20:46:48.293498"
}