{
  "video_id": "jGOucUG9qOI",
  "text": "1 Samuel this morning, and my heart was blessed. I trust that you had sweet time with the Lord this morning as well, and what a blessing it is to enter into His presence. What a joy that we have the Word of God, and God uses His Word in our hearts and our lives, amen? And there are many things that are seeking to influence the heart and mind of the people of God, and God's given us this precious book, and oh, how wonderful it is. The Bible says of itself that all Scripture is given by inspiration of God, and it tells us that it's profitable, and you know, it's profitable when we're reading it, when we're obeying it, amen? And we're to be doers of the Word and not hearers only, and I'm so thankful for this precious book. Last week, you'll remember that we finished up Colossians chapter number 1, and as we read through the last portion of this passage of Scripture and studied those verses of Scripture, we understood that Paul was giving a description of the ministry in which God had called him to. The Apostle Paul had suffered adversity, in fact, he speaks specifically about the sufferings that he was currently enduring. We understand that at the time of the writing, the Apostle Paul is in prison, and yet he remained faithful to the call of God upon his life, and he had a desire to finish his race. And we understand that Paul says to the believers, really the elders in Ephesus, as he calls them to meet him on his way to Jerusalem. It's recorded for us in Acts chapter number 20 that he had this desire, that he would finish his course with joy. And Paul understood that he had been given a stewardship, a responsibility. It's referred to in verse 25 as the dispensation of God, which is given to me for you. And what a blessing to see how the Apostle Paul desired to finish his race, to do that which God had called him to do. No doubt in my mind it is the believers in Colossae read this first chapter, and we understand the chapter divisions were added far later than when they actually received the letter. But in our study of the book of Colossians, when they've come to this point, which we are, there's no doubt in my mind that they have been able to easily tell the difference between the philosophy of the Apostle Paul and that of the false teachers. You'll remember that Paul never physically ministered in Colossae. He did not know these people personally. They did not know him personally, yet he desired to share with them truth, and he understood that the enemy using false teachers was active in the city of Colossae. And so Paul is sharing some philosophy with them. You'll recall with me that he mentions in verse number 28 of chapter number one the three aspects of ministry. If he were to give an overview of the ministry that God called him to, he says, number one, we preach Christ. He says it this way, whom we preach, but we understand contextually, as you finish verse number 27, he says, Christ in you, the hope of glory, whom we preach. First aspect of the ministry of the Apostle Paul was preaching Christ. By the way, isn't that a wonderful opportunity that we have to preach Christ? To let people know about the Lord Jesus Christ and all that he's done for us and that which he would do for them. We find that he then continues and says this, warning every man. Warning every man. And what's interesting is when we enter into the second chapter, you don't get far before you find in verse number eight that he uses the word, beware. Remember, he shared with them in chapter number one this philosophy of ministry and explaining to them the approach to ministry. He's preaching Christ, he's warning every man, and then he says this, number three, teaching every man. What a joy it is to teach the word of God. The Bible says that the entrance of thy words, it giveth light. And I'm so thankful for the power of the word of God. And we understand that we have an enemy that seeks to blind the hearts and minds of the people of the world. And we find that the word of God is that which giveth light. And I'm so thankful that we have the privilege of being able to teach the word of God. And he says this as he shares the philosophy of ministry and describes the ministry in these three ways. He gives to these believers in Colossae the goal or purpose of ministry. And we find that at the end of verse number 28, that we may present every man perfect in Christ Jesus. What a great goal. What a great desire that Paul has for these believers in Colossae. And we find that as he would share these things and give this truth to these believers, there's no doubt in my mind that as they read about the love and concern that Paul has for them, as they read about the way in which Paul was praying for them, people that he had never met, yet he's praying for them always, he says. And he exalts Christ and he explains the ministry. As we enter into chapter number 2, we find that Paul continues to express his love and concern for these believers in Colossae. You understand that Paul was not seeking to get anything from these believers. He was not seeking to increase some kingdom for himself. He was not seeking some accolades, recognition, any type of monetary gains. He was not seeking that. He was simply desiring to be a blessing to these believers. It reminds me of what Paul would say to the believers in Corinth in 2 Corinthians 12, 14 and 15. It's not the entirety of either one of those verses, but you find that Paul says this to the believers in Corinth, I seek not yours, but you. And then he says this, I will very gladly spend and be spent for you. Is that not a great contrast to the philosophy and approach of false teachers? We find that here as we enter into Colossians chapter number 2, that Paul says this, notice with me in verse number 1, for I would that ye knew what great conflict I have for you and for them at Laodicea, and for as many as have not seen my face in the flesh, that their hearts might be comforted, being knit together in love, and unto all riches of the full assurance of understanding, to the acknowledgement of the mystery of God and of the Father and of Christ, in whom are hid all the treasures of wisdom and knowledge. We'll stop there this morning. We'll just look at the first three verses of Colossians 2. If you're taking notes, I've titled the message, Paul's Great Conflict. Paul's Great Conflict. Notice with me, if you're taking notes, number 1, Paul reveals the conflict that he has for these believers. We find that as you begin reading in verse number 1, that Paul has a desire that these believers in Colossae would have a knowledge and an understanding of that which he was calling a great conflict. Really we would understand this morning that Paul was so deeply concerned for these believers that the way in which he described that deep concern was that he had a great conflict. Now we're familiar with conflicts. In fact, we live in a time and an era in which very few people understand anything about conflict resolution. We find that we live, and we have experienced, if you have lived for any length of time, you've experienced conflict. We find that Paul is describing for these believers in Colossae this conflict that he has, really it's an internal conflict that he's dealing with, and yes, there are some external things that would lend to and lead to the conflict that Paul was experiencing, but he says to these believers in Colossae, that I want you to know, for I would that ye knew what great conflict I have for you. I believe that as we begin to read this portion of Scripture and have the opportunity to kind of see the heart of the Apostle Paul a little bit here, we see other glimpses into the heart of the Apostle Paul when he says in Romans 9 and Romans 10 that his heart's desire for his kinsmen, his brethren, according to the flesh, is that they might be saved. And Paul is sharing here, he's allowing the believers in Colossae to see the heart of a spiritual leader. The heart of one that has this great concern, this great, as he describes it, conflict for these believers. We find that this concern that Paul had, this conflict that he would reveal to these believers in Colossae, you'll understand as you read the entirety of verse number one, that it was not simply for the brethren in Colossae. He says this, for I would that ye knew what great conflict I have for you, and for them at Laodicea, and for as many as have not seen my face in the flesh. I want you to consider that these two cities that are mentioned specifically, Colossae and Laodicea, we understand that Colossae is not mentioned here in verse number one, but he says for you, and we understand the book is written to the believers in Colossae, and so we'd understand that he mentions these two cities, Colossae and Laodicea. They're separated by about 11 miles, but it would seem as we'll continue our study this morning that those false teachers that were there in... Colossae have also had some level of influence there in Laodicea. He says not only is he concerned about these particular churches that are established in these regions, in these locations, but he says, and for as many as have not seen my face in the flesh. You understand that as you trace the steps of the Apostle Paul throughout the book of Acts, and then as you study the epistles that God would allow him to pen, you'll find that the Apostle Paul had much opportunity, had several areas in which he traveled and saw churches established. The first missionary journey that he took as he went into the regions of Galatia, there were no less than four churches that were started as a result of that one single missionary journey. But you understand that from these churches there were other churches that were established. When Paul would write to the church in Thessalonica, a church in which he was able to enter into that city and see a church established in short order, you would find that Paul, as he writes back to that church, he commends them in 1st Thessalonians 1, that from them went forth, sounded forth, the gospel. So the gospel's spreading. And so Paul was keenly aware of the fact that the truth of God's Word and the expansion of biblical Christianity was not just the people that he had personally ministered among. There were others that had not yet seen his face, and Paul has a concern for those believers as well. And Paul is sharing this truth, and he says, I would that ye knew what great conflict I have for you and for them at Laodicea, and for as many as have not seen my face in the flesh. Turn over if you will, hold your place here, but look over at 2nd Corinthians chapter number 11. I want you to see how Paul words it here to the church in Corinth, really a similar truth that is being revealed here to us. We find that the Apostle Paul is writing to these that he ministered among. You understand that he served in Corinth for a lengthy period of time, perhaps one of the longest durations of his ministry, and God blessed and worked, but of course we know that there was much division and contention within the church in Corinth, and he writes these letters, and we find that Paul in chapter number 11 of 2nd Corinthians is describing several things that he had endured. We find that Paul goes through, beginning in verse number 23, he says, Are they ministers of Christ? I speak as a fool, I am more. In labors more abundant, in stripes above measure, in prisons more frequent, in deaths oft of the Jews. Five times received I forty stripes, save one. Thrice was I beaten with rods, once I was stoned, thrice I suffered shipwreck. A night and a day I have been in the deep. In journeyings often, in perils of waters, in perils of robbers, in perils by my own countrymen, in perils by the heathen, in perils in the city, in perils in the wilderness, in perils in the sea, in perils among the brethren, in weariness and painfulness, in watchings often, in hunger and thirst, in fastings often, in cold and nakedness. Now when you read that list, you say, most of us have not experienced anything like that. Amen? But you know what Paul says about those things, and I'm not even to the really the climax of what I want to get to there in 2nd Corinthians 11, but if you think back to chapter number 4 of the same book, Paul says this. Now he describes in detail all of these things that I just read to you in chapter number 11. In chapter number 4, he just calls them the things. Notice here, he says, for which cause we faint not, in chapter 4 and verse number 16, but through, excuse me, but though our outward man perish, yet the inward man is renewed day by day, for our light affliction. Did you hear all of those things that he mentioned in chapter number 11? Would you describe that as light affliction? Paul says our light affliction is but for a moment, but for a moment, worketh for us a far more exceeding and eternal weight of glory, while we look not at the things which are seen, but at the things which are not seen. For the things which are seen are temporal. The things which are not seen are eternal. Paul had a good perspective on life, did he not? He says our light affliction, which is but for a moment. Paul was looking to eternity, and he suffered all these things, but I want you to notice what he says back in chapter 11 in verse number 28. He says this, beside those things that are without, that which cometh upon me daily, notice what he says, the care of all the churches. The care of all the churches. This morning as I see the heart of the Apostle Paul in Colossians chapter number 2, in saying to these believers in Colossae that I would that ye knew what great conflict I have for you, and for them at Laodicea, and for as many as have not seen my face in the flesh. He summarizes it in 2 Corinthians 11.28 and says that it's the care of all the churches. This morning as I read, as I've studied throughout the period of time as I've prepared this message and I've read the book of Colossians dozens of times last year and the last quarter just in preparation for this study, I don't know how many times I've read the book of Colossians, but I know that as I come to this first verse of chapter number 2, I once again am seeing and realizing the passion that Paul had and the sincerity, the transparency that he's sharing with those in which he seeks to minister. As a spiritual leader, the care of one church, one body of believers, it's significant. It's serious. And we find that Paul is saying, I want you to know what great conflict I have. This conflict that he has, as I mentioned already, he's so deeply concerned for them that he calls it a great conflict. As a pastor, as you study the book of Hebrews as we did last year, you find in chapter number 13 that the Bible describes one aspect of the responsibility of the pastor as one that watches for your soul. Wow. It's a serious responsibility. And this morning, a true spiritual leader will take seriously the responsibility of the call that God has placed upon their lives. We find this morning that Paul says, I want to reveal something to you. I want to reveal this great conflict that I have. As we continue and move through the passage of Scripture here in Colossians 2, we consider, number two, the reason for this conflict. What was the reason that Paul had to lead to this great conflict that he refers to in verse number 1? He says that it's for those that are in Colossae, for those that are in Laodicea, for as many as have not seen my face in the flesh. Why is it? What is the reason? What has led Paul to this great conflict? Well, I believe that as you study the entirety of the book of Colossians, as you study the whole of Scripture, that you would say very simply this, it was the fact that the enemy was active. It was the fact that false teaching was prevalent. It was the fact that Paul had gone and preached the Gospel and those that had been saved take the Gospel far and wide and they seek to reach the world with the Gospel of Jesus Christ and many have been saved. And the Bible says of those in the book of Acts and Paul and all of the missionary journeys that they that have turned the world upside down have come here. I mean, the Word of God was marching forward and God was blessing and working, but we find that the enemy is always active. The enemy is always active. And it was the activity of the enemy, it was the false teaching that was prevalent, not only in Colossae, but had affected those in Laodicea, no doubt had affected many other congregations throughout the known world at that point. And Paul says it's because of this activity, it's because of this false teaching that my heart, that I'm burdened, that I'm concerned that I have this great conflict. We find that it was there in Colossae the enemy would use deception and false teaching and we find that the enemy would seek to these Gnostics that were active there in Colossae. One of their approaches would be that of this high intellect. And they would speak often about wisdom and knowledge and they would speak about mysteries and the way in which you could attain some spiritual level of some mystery and some knowledge that was held back from others. Thus, you find so often that Paul would use those same terminologies here in the book of Colossians as he's ministering to these believers in Colossae. Colossi to help them understand that it is Christ in you, the hope of glory. Remember back in chapter 1 in verse number 27, to whom God would make known what is the riches of the glory of this mystery among the Gentiles, which is Christ in you, the hope of glory. He'll say in verse number 3 of this chapter 2, in whom, speaking of Christ, are hid all the treasures of wisdom and knowledge. These false teachers that were active in Colossi, they often would use this thing of intellect and they would speak of some wisdom or knowledge. I am thankful that Paul is writing Scripture, that all Scripture is given by inspiration of God. I'm thankful today that we have the whole of God's Word and we have the wisdom of God, the mind of Christ. And what a joy it is for us to know the truth of the Word of God and that we can take the truth of God's Word and we can, as John said in 1 John, try the spirits because we have the Word of God. You hear some teaching, you hear someone come in with some, man they sound good, they're eloquent, and they use these big words and this great vocabulary. Be careful not to be awed by that. Check them to the Scriptures. Amen? I don't care how many letters somebody has after their name, before their name, it matters not if they do not agree with what thus saith the Lord. Amen? If we're not careful, you get on some internet site, you get some YouTube something or whatever, you say, oh but this person has a doctorate in this and they have a this and a that. Be careful. Professing themselves to be wise, they became fools. Romans chapter number one. Teaching must match this book. What was the tactic of the enemy in Laodicea? You know, it actually was different than what it was in Colossae. Turn over to Revelation, if you will, chapter number three. We'll be back there to the book of Colossians in just a moment, but I want you to see that God has given us, the Bible's awesome, I love the Word of God, there's not much that we know about this church in Laodicea. However, we find that God, as He would give John the responsibility of these letters that are recorded in the book of Revelation to these seven churches in Asia, that the last of these letters is written to the church that Paul would reference here in Colossians chapter number two. He says, listen, I'm not only concerned for those, for you, those in Colossae, but those that are in Laodicea, and as many as have not seen my face. And as you come to Revelation chapter number three, beginning in verse number 14, you find that this letter to this church is written. I have referred to this church in the past as being the rich, poor church. There's a previous church that I referred to, that in Philadelphia, as the weak, strong church. And we find that it was the church in Smyrna that is the poor church, but they were rich in Christ. We find that it was just church in Laodicea that the Bible calls this church in verse number 14, and unto the angel, notice what it says, of the church of the Laodiceans. It's very interesting because each of the previous six letters that are written to these churches are all addressed to the church in whatever the city is. But here, the Bible says that it's the church of the Laodiceans. It says, write these things, saith the Amen, the faithful and true witness, the beginning of the creation of God. Verse 15, I know thy works. Thou art neither cold nor hot. I would thou work cold or hot. So then, because thou art lukewarm and neither cold nor hot, I will spew thee out of my mouth. Notice verse 17, because thou sayest, I am rich and increased with goods and have need of nothing. I am rich and increased with goods and have need of nothing. In Laodicea, they were dealing with this level of self-sufficiency, plenty, wealth. When it says here that they have need of nothing, really, as you study the entirety of this passage, you would find that they almost came to the point they didn't think they needed God either. They were self-sufficient. They had plenty. The continuation of verse number 17, it says this, and knowest not. You know, we can have our perspective, but God has His perspective. Typically, we'd like to describe ourselves in better terms than God would describe us. Is it not true? And God says in verse number 17, and knowest not that thou art wretched and miserable and poor and blind and naked. Wow, that's a different description than what they had of themselves, is it not? Because thou sayest, here's what you say, here's what God says. You find that the Bible says in verse number 19, as many as I love, I rebuke and chasten. Be zealous, therefore, and repent. Notice verse 20. Behold, I stand at the door and knock. If any man hear my voice and open the door, I will come into him and will sup with him and he with me. I know that often Revelation 3 and verse number 20, people will use that verse of Scripture as they try to share the gospel with individuals, but the true context of this verse of Scripture is written to the church of the Laodiceans. Jesus said, I will build my church, and yet this church of the Laodiceans, the picture that we see in verse number 20 is that Christ is on the outside of his church, knocking to get in. Wow. See, the enemy was active in Colossae through the Gnostics and through their level of intellect and wisdom and all of these things that they would speak of, and really causing the people to really struggle and sway back and forth, and in Laodicea, the enemy was working in a different manner. He was saying, hey, you guys, you're good, man, you have all of this wealth, you don't need this stuff. There's a danger in becoming self-sufficient, independent. The Word of God tells us that Jesus said, I am the vine, you're the branches. Without me, ye can do nothing. We need him, and here we find, as we look back to the book of Colossians and consider the reason for this conflict that Paul is describing in verse number one, we will remember that the enemy is subtle and crafty. We'd understand that Paul would warn the believers in Ephesus and instruct them to put on the whole armor of God, to go in the power and the strength of God. Why? That they may be able to stand against the wiles of the devil, his trickery, his craftiness, his deceit. We find that the approach of the enemy will vary, but I'm thankful that we're not ignorant of his devices. You read the Word of God, and you read the entirety of God's Word, and you will find many examples of how the enemy works. You will find in ways in which the enemy works in very deceitful means. He comes and speaks as if he's going to be one of you. In fact, Jude warns of that very thing, that the reason that he's writing that short but powerful epistle is that there were certain men that crept in unawares, that had turned the grace of God into lasciviousness. And Jude is writing that short epistle to the people of God to warn them about these false teachers that had crept into the church. We want to see the church grow, and it's a blessing to see the church grow, but oh, how we need to be careful that we are mindful of the fact that the enemy does work, and he works in such a way as that he'd like to infiltrate the church of God. We find that the enemy is tricky, he's crafty, he's subtle. This morning as we think about these two illustrations or examples that God gives us from His Word with regard to these two churches in particular, we find that today the enemy is still working. The enemy is working. In fact, the book of Revelation teaches us that he knows that this time is short. I believe that we're living in the last days, and I believe that it's almost kind of like that full-court press, if you could use a basketball analogy. Satan's trying to pull out all the stops, if you will, and he's working, he's active. We find that he's working today, he's seeking, I believe, to separate and divide the people of God. You see the division in the church in Corinth, and you see how that he was using various tactics there, and he was seeking to divide those individuals. We find that the enemy, he'll use all sorts of means, I mentioned a moment ago, about being careful of those false teachers that abound. It's amazing. how much information is at the fingertips of our people today. It really is, it's amazing. Can I tell you that most of that which you would find on the internet, I'd be careful of. I would be very careful. I warn you, that's what Paul said, I'm warning every man. There's a lot of false teaching out there, a lot of it. It's prevalent. And again, you understand that people will use this kind of thing, well look at how many followers they have. I mean they must be right. People think that way. Honestly, people think that way. There are many false teachers. The enemy is active, he's working. I'm thankful that God is working and that God is greater. But we understand that Paul says, here's the reason for this conflict. It really, as you look at the whole book, he doesn't lay it out in simple words in verse number one as to the real reason, but as you study the entirety of the book, you'd understand that the reason that Paul has this conflict is because of the false teachers that are active in all that is taking place and how that they're seeking to destroy, the enemy is seeking to destroy and to devour. You understand that the enemy, that he's a liar. John says this in John 8 and verse number 44 as Jesus is speaking and he's speaking to these religious leaders and he says, you're of your father the devil and the lust of your father you will do. He was a murderer from the beginning and abode not in the truth because there is no truth in him. When he speaketh a lie, he speaketh of his own for he's a liar and the father of it. I know that I've often said that false teachers, one of the things that we need to be so careful of and we need discernment, we need wisdom from God, is that they will use our vocabulary but they mean something entirely different and it just takes a little bit of digging to find out what they really mean and oh they will use terms that perhaps you've heard and you've been familiar with but they mean something entirely different and we need to be careful. We need to understand the enemy is active and Paul says this is the reason that I have this conflict. As we look at verses 2 and 3 this morning of Colossians chapter number 2, I would say this, I would consider number 3, how to resolve this conflict. I understand that the conflict will never completely be resolved until Jesus returns, until we get to be with him for all of eternity because the enemy, until he is banished, until even during the millennial reign of Christ, he's banished and he's bound for that thousand years but then he's loosed for a little season and the Bible tells us there's one final revolt but then in Revelation chapter number 20 in verse number 10 he is cast in the lake of fire and he will burn, he'll be tormented day and night forever and ever. But I believe for Paul, I would say for myself as a spiritual leader, as I try to understand the heart of Paul and I can can really relate to Paul in the conflict that he's sharing in the great concern, I can relate to understanding that which he's dealing with and understanding as being an under shepherd and having the responsibility of being a pastor and watching for the souls of those that God would entrust and feeding the flock of God and understanding the way in which the false teachers are active, I can relate to Paul. And I say as I look at verses 2 and 3 as Paul is really explaining what his desire is for these believers in Colossae, no doubt for those in Laodicea and for as many as have not seen his face as well, we'd find that it would help to resolve this conflict at least at this level. I would say to you this morning that spiritual growth is the best way to combat false teaching. Spiritual growth is the best way to combat false teaching, knowing the truth. Listen to what Peter says in 2nd Peter 3 in verses 17 and 18. Peter says this and often we quote verse number 18 but he says in 2nd Peter 3 in verse number 17 as he finishes the short epistle, writing to these believers that had been scattered abroad but he speaks to them in chapter 2 about the false teachers that were among them and he says this in 2nd Peter 3 in verse 17, ye therefore beloved, seeing ye know these things before, beware, lest ye also being led away with the error of the wicked fall from your own steadfastness. But grow in grace and in the knowledge of our Lord and Savior Jesus Christ. To Him be glory both now and forever. Amen. What is Peter saying? Those false teachers are around. They're gonna always be around and so what's the best way to combat that false teaching? To grow spiritually. We have the Word of God. We have the truth. Jesus said in John 17, sanctify them through Thy Word. Thy Word is truth. Aren't you thankful we have the Bible? I mean it gives us the truth that we need. It gives us the ability to grow. He told them in 1st Peter chapter number 2 in verse number 2, as newborn babes desire the sincere milk of the Word that ye may grow thereby. It's that spiritual growth. Notice what Paul says back in Colossians 2 in verse number 2. As he's expressing his desire for these believers that I believe would lead to the resolving of this conflict that he was dealing with, it says that their hearts, number 1 in verse number 2 there, that their hearts might be comforted. That their hearts might be comforted. This word comfort is an interesting word. We're familiar with the understand the Holy Spirit is the comforter, that our God is the God of all comfort. It means to console. It also carries with it the idea of to encourage and strengthen by consolation. I would believe that as I look at this passage of Scripture and read these words that their hearts might be comforted. That there was some level because of the activity of the false teachers that there was some level of chaos and confusion. There was perhaps some anxiety that was taking place and you understand that Paul is saying here that he is desiring that their hearts might be comforted. You think about the listen false teachers are they're persistent. We know something about our enemy he's persistent is he not? He tempted the Lord Jesus Christ, God. He tempted him in the wilderness. You read the passage of Scripture and it says that he departed for a little season. Listen the enemy is persistent. You read through the book of Nehemiah, Ezra. Read about the enemy in those books. I mean it's persistent right? The enemy is persistent and the false teachers not only they're persistent but they're persuasive. They're persistent and they're persuasive. Think about all the way back in Genesis chapter number three. The serpent, the most subtle beast. The Bible says this, yea hath God said. Do you not think that he the enemy was persuasive in the garden? To persuade Eve to partake of that fruit. He takes and he says look it's it's good for you. I mean your eyes will be open and you'll be like God. Is that it's a paraphrase but is that not what he said? He's persuasive. He's persistent. He's persuasive. The enemy is gonna try to make things look good, look appealing. That's what he does. That's how he works. That's how he operates. So Paul is saying when you think about the the false teaching that is prevalent and how they're active and you understand some of the the attributes of these false teachers that you would understand that there's some conflict. There's some some some anxiety. They've heard this truth but now they're hearing these people come in and and maybe there's some that are kind of siding with these false teachers and it's a causes anxiety. It causes this great level of difficulty within the body of believers. Why? He's seeking to divide. Paul says there in verse number two that their hearts might be comforted. I'm thankful that our God is the God of all comfort. We don't have time this morning but perhaps you'd like to write in your notes to go back to the book of 2nd Corinthians and chapter number one and read of all of the way in which Paul would describe the the fact that our God is the God of all comfort. It's in 2nd Corinthians 1 verses 3 through 6 and you'll see it there and I trust that would be a blessing to you but as we move on and look at what Paul says number two there in verse number two he says being knit together in love. I like the phrase knit together. It gives us the understanding of unity. It helps us understand this knit together in love. Remember what Jesus said in John chapter number 13 as he would give instruction to the disciples. He says a new commandment I give you that you love one another as as I have loved you. By this, by what? What? Our love one for another. Shall all men know that You are My disciples? And Paul says that we'd be knit together in love. That there would be some unity. You'd understand this morning that unity is the result of embracing truth. Unity is the result of embracing truth. It is not possible that we could have some level of unity by just simply setting aside something that would divide us. It's embracing truth that brings unity. And what is that truth? It's the Word of God. And as we would embrace the truth of the Word of God, and we'd understand this morning, listen, there's a group of people, and really it's a large group of people that would try to pretend this morning in our world that truth is relative. That's ridiculous. There's not your truth and my truth. Amen? There's truth. And truth stands. Truth endures. Thy Word is truth. Jesus said, I am the way, the truth, and the life. There's some people that would like to pretend that truth is relative. Well, that's just their truth, and you can have your truth, and you can embrace. Did that work for you in school? When you took an exam? I mean, did you ever take an exam and get a question wrong? We did, right? When you put the answer on the exam, did you think it was right? I mean, otherwise, you probably wouldn't have put that answer. Did you argue with the professor, with the teacher, and say, well, that might be your truth, but this is my truth? Ridiculous, is it not? But we pretend that that can work somehow. It can't. There's truth, and it's the Word of God. And as we embrace truth, we can have unity. The enemy seeks to divide. Notice what Paul says to the believers over in Ephesus. Turn back, if you will, to Ephesians chapter number four. Ephesians chapter number four. In verse number three, Paul says this, Endeavoring to keep the unity of the Spirit in the bond of peace. The idea of endeavoring is the idea of laboring for something, desiring it and being diligent to get it. But the reality is that when he speaks about this truth of endeavoring to keep the unity of the Spirit in the bond of peace, it's as we hold dear to the truth of this book. I've used the illustration before of the tuning fork that would be used to tune a piano. And if you use the same tuning fork, and you can travel large distances from one piano to the next piano, but if you use the same instrument, that same tuning fork, and you tune those pianos, though they're distanced apart from one another, they will have the same sound. Why? Because you use the same tuning fork. It's just the way it works. What's our quote-unquote tuning fork? The Word of God. We can have unity with believers in all sorts of different cultures and countries around the world. Why? Because we embrace the truth of God's Word, and it leads to unity. We find even there in the book of Philippians, we see here in the book of Ephesians, he speaks of it. Look in Philippians 2. In Philippians 2, in verse 1, Paul says, \"...if there be therefore any consolation in Christ, if any comfort of love, if any fellowship of the Spirit, if any bowels and mercies, fulfill ye my joy, that ye be like-minded, having the same love, being of one accord and of one mind.\" How do we accomplish that? We all come from different backgrounds. Our mind is transformed by the truth of God's Word. Paul says in Romans 12 that we're not to be conformed to this world, but that we're to be transformed by the renewing of your mind. That's how we can have unity. Though we come from various backgrounds, though we've had different influences in our life, when we allow the Word of God to do what only God's Word can do in the lives of His people, it brings unity. It allows us to be like-minded. Not that we're robots. Not that we're just a bunch of people following aimlessly and mindlessly. No, no. We've examined this book! And we hold it dear and we hold it true. And it brings unity. Some people say, oh, you guys are a bunch of puppets. No, no, no. We just have the same truth. Amen? Look at verse number three. Let nothing be done through strife or vainglory, but in lowliness of mind let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others. Notice verse number five. Let this mind be in you, which was also in Christ Jesus. We need to have the mind of Christ. He goes on to explain. We don't have time to look at all of that this morning, but we find that we can have unity as we embrace truth. Here in the book of Colossians, we find that he speaks about unity to these believers. And he says in this passage that we're studying this morning in chapter two and verse number two, being knit together in love. I like the imagery of being knit together. That bond of love as we would embrace the truth. Now you understand this morning that as the people of God, that there are some people that are a little further along in their journey with God than you may be. Amen? And as that would be the case, it's through that humility that Paul spoke of to the believers in Philippi that would enable us to be able to effectively minister to those individuals and see them grow in grace and knowledge of our Lord Jesus Christ. Colossians 2, look at the rest of verse number two. We see that Paul would mention the truth of spiritual growth and maturity. It says this, \"...and unto all riches of the full assurance of understanding to the acknowledgement of the mystery of God unto the Father and of Christ, in whom are hid all the treasures of wisdom and knowledge.\" As we look at the last phrase of verse number two in the entirety of verse number three, we find again that this spiritual growth and maturity is in full view. We find that he uses the terminology in verse number two, notice what he says, \"...the full assurance of understanding.\" I'm thankful that we have the whole Bible. The whole canon of Scripture. Listen, if there's something that you don't know that God hasn't told us, there's no person that's going to give you some extra revelation. That's what the false teachers want to say. Right? But God said, the book is finished. His Word is settled in heaven. We're not looking for any new revelation, any more revelation. We have the Word of God. And he says that you can have a full assurance of understanding. Isn't that awesome? Somebody comes and says, let me give you some enlightenment. No, no. I have the Word of God. At the entrance of Thy words, give it light. Amen? Remind that he says, \"...to the acknowledgment of the mystery of God.\" Again, he would use these terminologies that these false teachers would use. And he speaks again about this acknowledgment of the mystery of God. What is the mystery of God? We would find that he mentioned in chapter 1 that it's Christ in you, the hope of glory, and we studied the passage of Scripture even in verse 19 of chapter 1, how that we would understand that Christ is the mystery of God in the sense that it is the Lord Jesus Christ that manifests God to man. Bottom line, Christ is all I need. The songwriter said, Christ is all I need. All, all I need. We find in verse 19, it says this of chapter 1 in verse 19, \"...for it pleased the Father that in Him...\" Who is Him? It's Christ. If you go back and look at the context, you'll understand he's speaking of Christ. \"...that in Him should all fullness dwell.\" Hebrews 1 speaks of the same thing. We don't have time to go there. But we find that Paul is saying to these believers in Colossae, he's saying, listen, the way to resolve the conflict that I have is that we would have this comfort, that we would have this encouragement and this strength by consolation that our hearts would be knit together in love, that we would have unity, and that we would have spiritual growth and maturity. Why? Because then the false teachers have no chance. Honestly, if you have a group of people, if Fellowship Baptist Church, we'll use ourselves as an example this morning, if we have, if our hearts are comforted, if we're encouraging and strengthening one another through this consolation, if we have this unity because we've embraced the truth of the Word of God, if we're growing and we have spiritual growth and maturity, and some false teacher walks in these doors. He's not going to have a chance. Amen? You understand, I'm coming off the platform, Jim. You understand this morning that false teachers, they're not going to come talk to me about their false teaching. They're going to come to Samantha. They're going to come to some other young person in our church. They're going to come to you. They're going to try to have dinner with you. And they're going to try to introduce their false teaching. That's how they work. It's what they do. It's okay that the pastor has grown spiritually and has an understanding of the Word of God, but the people have to be spiritually mature. You have to be growing in your walk with God. So that when a false teacher comes in and meets with you and you say, we don't believe that. And here's why we don't believe that, because the Word of God says, and all of a sudden, they put their tail between their knees and they go running out. Why? Because they don't want to mess with you. You know the Bible. Amen. It's the way it works. And so Paul's saying, I believe. If we're going to resolve this great conflict, man, we need to have some believers that are strong spiritually. That have unity. That are comforting and strengthening one another, encouraging one another with comfort. And as we have that, those false teachers are going to go down the road and find someone else to mess with. But if we don't have that, those false teachers come in and they begin to introduce their false teaching. And they influence this family. And they find this family over here to influence. And then they influence another family. They say, don't talk to pastor about this. Right? They get this family and that family, and then all of a sudden, they have this nucleus of people in a church that's all on board with what their agenda is. Do you know that you can walk, or not walk, that you could walk, but you can travel around the United States of America and you can find churches all over our land that one day stood on truth. That today look nothing like what they once stood for. Why? Because some guy came in and took it captive. It happens. Do your research. Happens all the time. Why is it that we watch for your souls as spiritual leaders? Why is it that we're instructed to feed the flock of God so that we can be spiritually mature? So that we can be strengthened against the attack of the enemy? So that we can stand for truth? We find this morning that Paul says, I have this great conflict. I have this great conflict. And I believe this morning that if the people of God would get serious about knowing God and his word, we could see some resolution, if you will, to this great conflict. Why? Because the spiritual leader can kind of take, if you will, not that he's going to be negligent in any of his duties or responsibilities, but he can have an assurance that the people that God's called me to lead, they're solid, they know the word of God, and they're gonna be able to stand. See, this morning, we've mentioned the reason for this conflict. And we've acknowledged that the enemy's still working today. The enemy is active, he's working. And the question that I'd ask myself and I'd ask you this morning, are you growing? Are you grounded? Can you give a defense of your faith? Are you able to go to the word of God and understand, thus saith the Lord? That's what God's word says. See, that we would be growing. Why is Paul saying, I'm warning every man and teaching every man? Because he understands the false teachers are active. And as we teach the word of God, oh, God will help us to be strengthened. And we can know what God's word says. When that enemy comes, that false teacher, that email that somebody sends you, hey, look what I found online, it's great, isn't it? So actually, it's not true, and here's why. I know that's not popular. I understand that. But we better be grounded and settled on the truth of God's word. Paul's great conflict. This morning, I believe that there are many spiritual leaders all across this land that are in the same situation that Paul was in. There's a concern that we have for the people of God. Why do we teach the word of God? Desire to give truth, service after service, week after week, because we know that there are false teachers that abound. It's God's plan that we would be grounded, that we would not be tossed to and fro with any wind of doctrine, as Paul says to the leaders in Ephesus. No, no, here's what God's word says. This morning, how are you growing? Are you growing? I'm not asking you to tell me, but I'm asking you to evaluate your own life. Are you growing? How are you growing? Do you wanna grow? Is there that desire? Oh, if there is, outside of the services that we have weekly, getting active and involved in those services and hearing the teaching and preaching of the word of God. You know, I don't preach the same message tonight that I preached this morning. I preached an entirely different message. I don't preach the same message on Wednesday that I preached on Sunday. It's an entirely different message. So that we can get the truth of God's word into the hearts of God's people. So that we can be strengthened and prepared for the attack of the enemy. Amen, let's pray. Father, we love you. We thank you for loving us. Thank you for truth. I pray, God, this morning that you would help us to stand. Help us to be spiritually growing, mature believers. That the false teacher that would seek to infiltrate this congregation would meet a group of people that are settled and grounded on the truth. That know the word of God. We thank you for the Lord Jesus Christ. We thank you for the word of God. I pray that if there's one that's not sure of heaven, maybe they've been influenced by some false teaching that would deny the person of Jesus Christ as being God. Perhaps they would deny the teaching that thy word is sufficient and it's all we need. We're not looking for any new revelation, any more revelation. Perhaps they've been influenced by some other form of false teaching. They've never trusted Christ. I pray that today would be the day of their salvation. They'd understand that Jesus Christ is God. He came to this world at the appointed time when the fullness of time was come. God sent forth His Son. He was born of a virgin, lived a perfect and sinless life, bled and died to be our substitute, buried and rose in victory, conquering sin, death, and the grave. He's the Savior of the world. I pray that this morning, that individual that may not know you would trust Christ today. For each believer, Lord, help us to grow. Help us to not get comfortable. Help us to not get stagnant, self-sufficient, self-dependent. Help us, God, to be eager, to hunger and thirst for the word of God, to know you, as Paul said. I pray that you'd move and work as only you can. That's why we do these efforts in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano. Perhaps you need to come and ask the Lord to help you. Perhaps there's some that would come and pray for our church as a whole. God would protect us and strengthen us. Need some men to come and pray for our congregation. The enemy's active. As Kimberly plays, would you allow the Holy Spirit of God to have His way in your life?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.880000114440918,
      "text": " 1 Samuel this morning, and my heart was blessed."
    },
    {
      "id": 1,
      "start": 2.880000114440918,
      "end": 7.400000095367432,
      "text": " I trust that you had sweet time with the Lord this morning as well, and what a blessing"
    },
    {
      "id": 2,
      "start": 7.400000095367432,
      "end": 9.119999885559082,
      "text": " it is to enter into His presence."
    },
    {
      "id": 3,
      "start": 9.119999885559082,
      "end": 15.359999656677246,
      "text": " What a joy that we have the Word of God, and God uses His Word in our hearts and our lives,"
    },
    {
      "id": 4,
      "start": 15.359999656677246,
      "end": 16.360000610351562,
      "text": " amen?"
    },
    {
      "id": 5,
      "start": 16.360000610351562,
      "end": 20.34000015258789,
      "text": " And there are many things that are seeking to influence the heart and mind of the people"
    },
    {
      "id": 6,
      "start": 20.34000015258789,
      "end": 25.399999618530273,
      "text": " of God, and God's given us this precious book, and oh, how wonderful it is."
    },
    {
      "id": 7,
      "start": 25.399999618530273,
      "end": 29.6200008392334,
      "text": " The Bible says of itself that all Scripture is given by inspiration of God, and it tells"
    },
    {
      "id": 8,
      "start": 29.6200008392334,
      "end": 34.779998779296875,
      "text": " us that it's profitable, and you know, it's profitable when we're reading it, when we're"
    },
    {
      "id": 9,
      "start": 34.779998779296875,
      "end": 36.7400016784668,
      "text": " obeying it, amen?"
    },
    {
      "id": 10,
      "start": 36.7400016784668,
      "end": 40.41999816894531,
      "text": " And we're to be doers of the Word and not hearers only, and I'm so thankful for this"
    },
    {
      "id": 11,
      "start": 40.41999816894531,
      "end": 41.81999969482422,
      "text": " precious book."
    },
    {
      "id": 12,
      "start": 41.81999969482422,
      "end": 46.52000045776367,
      "text": " Last week, you'll remember that we finished up Colossians chapter number 1, and as we"
    },
    {
      "id": 13,
      "start": 46.52000045776367,
      "end": 52.29999923706055,
      "text": " read through the last portion of this passage of Scripture and studied those verses of Scripture,"
    },
    {
      "id": 14,
      "start": 52.29999923706055,
      "end": 57.13999938964844,
      "text": " we understood that Paul was giving a description of the ministry in which God had called him"
    },
    {
      "id": 15,
      "start": 57.13999938964844,
      "end": 58.540000915527344,
      "text": " to."
    },
    {
      "id": 16,
      "start": 58.58000183105469,
      "end": 64.30000305175781,
      "text": " The Apostle Paul had suffered adversity, in fact, he speaks specifically about the sufferings"
    },
    {
      "id": 17,
      "start": 64.30000305175781,
      "end": 65.9000015258789,
      "text": " that he was currently enduring."
    },
    {
      "id": 18,
      "start": 65.9000015258789,
      "end": 70.73999786376953,
      "text": " We understand that at the time of the writing, the Apostle Paul is in prison, and yet he"
    },
    {
      "id": 19,
      "start": 70.73999786376953,
      "end": 76.5,
      "text": " remained faithful to the call of God upon his life, and he had a desire to finish his"
    },
    {
      "id": 20,
      "start": 76.5,
      "end": 77.5,
      "text": " race."
    },
    {
      "id": 21,
      "start": 77.5,
      "end": 83.54000091552734,
      "text": " And we understand that Paul says to the believers, really the elders in Ephesus, as he calls"
    },
    {
      "id": 22,
      "start": 83.54000091552734,
      "end": 86.30000305175781,
      "text": " them to meet him on his way to Jerusalem."
    },
    {
      "id": 23,
      "start": 86.30000305175781,
      "end": 90.94000244140625,
      "text": " It's recorded for us in Acts chapter number 20 that he had this desire, that he would"
    },
    {
      "id": 24,
      "start": 90.94000244140625,
      "end": 95.0999984741211,
      "text": " finish his course with joy."
    },
    {
      "id": 25,
      "start": 95.0999984741211,
      "end": 100.69999694824219,
      "text": " And Paul understood that he had been given a stewardship, a responsibility."
    },
    {
      "id": 26,
      "start": 100.69999694824219,
      "end": 109.62000274658203,
      "text": " It's referred to in verse 25 as the dispensation of God, which is given to me for you."
    },
    {
      "id": 27,
      "start": 109.62000274658203,
      "end": 116.62000274658203,
      "text": " And what a blessing to see how the Apostle Paul desired to finish his race, to do that"
    },
    {
      "id": 28,
      "start": 116.62000274658203,
      "end": 118.9800033569336,
      "text": " which God had called him to do."
    },
    {
      "id": 29,
      "start": 118.9800033569336,
      "end": 123.81999969482422,
      "text": " No doubt in my mind it is the believers in Colossae read this first chapter, and we understand"
    },
    {
      "id": 30,
      "start": 123.81999969482422,
      "end": 129.3000030517578,
      "text": " the chapter divisions were added far later than when they actually received the letter."
    },
    {
      "id": 31,
      "start": 129.3000030517578,
      "end": 133.4199981689453,
      "text": " But in our study of the book of Colossians, when they've come to this point, which we"
    },
    {
      "id": 32,
      "start": 133.4199981689453,
      "end": 140.13999938964844,
      "text": " are, there's no doubt in my mind that they have been able to easily tell the difference"
    },
    {
      "id": 33,
      "start": 140.13999938964844,
      "end": 145.3000030517578,
      "text": " between the philosophy of the Apostle Paul and that of the false teachers."
    },
    {
      "id": 34,
      "start": 145.3000030517578,
      "end": 149.74000549316406,
      "text": " You'll remember that Paul never physically ministered in Colossae."
    },
    {
      "id": 35,
      "start": 149.74000549316406,
      "end": 152.13999938964844,
      "text": " He did not know these people personally."
    },
    {
      "id": 36,
      "start": 152.13999938964844,
      "end": 158.17999267578125,
      "text": " They did not know him personally, yet he desired to share with them truth, and he understood"
    },
    {
      "id": 37,
      "start": 158.17999267578125,
      "end": 164.74000549316406,
      "text": " that the enemy using false teachers was active in the city of Colossae."
    },
    {
      "id": 38,
      "start": 164.74000549316406,
      "end": 167.5399932861328,
      "text": " And so Paul is sharing some philosophy with them."
    },
    {
      "id": 39,
      "start": 167.5399932861328,
      "end": 172.22000122070312,
      "text": " You'll recall with me that he mentions in verse number 28 of chapter number one the"
    },
    {
      "id": 40,
      "start": 172.22000122070312,
      "end": 174.5399932861328,
      "text": " three aspects of ministry."
    },
    {
      "id": 41,
      "start": 174.5399932861328,
      "end": 179.97999572753906,
      "text": " If he were to give an overview of the ministry that God called him to, he says, number one,"
    },
    {
      "id": 42,
      "start": 179.97999572753906,
      "end": 181.52000427246094,
      "text": " we preach Christ."
    },
    {
      "id": 43,
      "start": 181.52000427246094,
      "end": 186.66000366210938,
      "text": " He says it this way, whom we preach, but we understand contextually, as you finish verse"
    },
    {
      "id": 44,
      "start": 186.66000366210938,
      "end": 192.4199981689453,
      "text": " number 27, he says, Christ in you, the hope of glory, whom we preach."
    },
    {
      "id": 45,
      "start": 192.4199981689453,
      "end": 196.5,
      "text": " First aspect of the ministry of the Apostle Paul was preaching Christ."
    },
    {
      "id": 46,
      "start": 196.5,
      "end": 201.10000610351562,
      "text": " By the way, isn't that a wonderful opportunity that we have to preach Christ?"
    },
    {
      "id": 47,
      "start": 201.10000610351562,
      "end": 205.75999450683594,
      "text": " To let people know about the Lord Jesus Christ and all that he's done for us and that which"
    },
    {
      "id": 48,
      "start": 205.75999450683594,
      "end": 207.3000030517578,
      "text": " he would do for them."
    },
    {
      "id": 49,
      "start": 207.3000030517578,
      "end": 212.86000061035156,
      "text": " We find that he then continues and says this, warning every man."
    },
    {
      "id": 50,
      "start": 212.86000061035156,
      "end": 213.86000061035156,
      "text": " Warning every man."
    },
    {
      "id": 51,
      "start": 214.05999755859375,
      "end": 217.13999938964844,
      "text": " And what's interesting is when we enter into the second chapter, you don't get far before"
    },
    {
      "id": 52,
      "start": 217.13999938964844,
      "end": 220.5800018310547,
      "text": " you find in verse number eight that he uses the word, beware."
    },
    {
      "id": 53,
      "start": 220.5800018310547,
      "end": 225.6999969482422,
      "text": " Remember, he shared with them in chapter number one this philosophy of ministry and explaining"
    },
    {
      "id": 54,
      "start": 225.6999969482422,
      "end": 228.5800018310547,
      "text": " to them the approach to ministry."
    },
    {
      "id": 55,
      "start": 228.5800018310547,
      "end": 233.05999755859375,
      "text": " He's preaching Christ, he's warning every man, and then he says this, number three,"
    },
    {
      "id": 56,
      "start": 233.05999755859375,
      "end": 234.66000366210938,
      "text": " teaching every man."
    },
    {
      "id": 57,
      "start": 234.66000366210938,
      "end": 237.05999755859375,
      "text": " What a joy it is to teach the word of God."
    },
    {
      "id": 58,
      "start": 237.05999755859375,
      "end": 240.13999938964844,
      "text": " The Bible says that the entrance of thy words, it giveth light."
    },
    {
      "id": 59,
      "start": 240.13999938964844,
      "end": 243.13999938964844,
      "text": " And I'm so thankful for the power of the word of God."
    },
    {
      "id": 60,
      "start": 243.13999938964844,
      "end": 248.10000610351562,
      "text": " And we understand that we have an enemy that seeks to blind the hearts and minds of the"
    },
    {
      "id": 61,
      "start": 248.10000610351562,
      "end": 249.3800048828125,
      "text": " people of the world."
    },
    {
      "id": 62,
      "start": 249.3800048828125,
      "end": 254.33999633789062,
      "text": " And we find that the word of God is that which giveth light."
    },
    {
      "id": 63,
      "start": 254.33999633789062,
      "end": 260.260009765625,
      "text": " And I'm so thankful that we have the privilege of being able to teach the word of God."
    },
    {
      "id": 64,
      "start": 260.260009765625,
      "end": 265.4200134277344,
      "text": " And he says this as he shares the philosophy of ministry and describes the ministry in"
    },
    {
      "id": 65,
      "start": 265.4200134277344,
      "end": 266.9800109863281,
      "text": " these three ways."
    },
    {
      "id": 66,
      "start": 266.9800109863281,
      "end": 272.7799987792969,
      "text": " He gives to these believers in Colossae the goal or purpose of ministry."
    },
    {
      "id": 67,
      "start": 272.7799987792969,
      "end": 279.1400146484375,
      "text": " And we find that at the end of verse number 28, that we may present every man perfect"
    },
    {
      "id": 68,
      "start": 279.1400146484375,
      "end": 281.0199890136719,
      "text": " in Christ Jesus."
    },
    {
      "id": 69,
      "start": 281.0199890136719,
      "end": 282.17999267578125,
      "text": " What a great goal."
    },
    {
      "id": 70,
      "start": 282.17999267578125,
      "end": 286.82000732421875,
      "text": " What a great desire that Paul has for these believers in Colossae."
    },
    {
      "id": 71,
      "start": 286.82000732421875,
      "end": 292.1400146484375,
      "text": " And we find that as he would share these things and give this truth to these believers, there's"
    },
    {
      "id": 72,
      "start": 292.1400146484375,
      "end": 297.94000244140625,
      "text": " no doubt in my mind that as they read about the love and concern that Paul has for them,"
    },
    {
      "id": 73,
      "start": 298.0199890136719,
      "end": 304.4200134277344,
      "text": " as they read about the way in which Paul was praying for them, people that he had never met,"
    },
    {
      "id": 74,
      "start": 304.4200134277344,
      "end": 308.8599853515625,
      "text": " yet he's praying for them always, he says."
    },
    {
      "id": 75,
      "start": 308.8599853515625,
      "end": 313.1000061035156,
      "text": " And he exalts Christ and he explains the ministry."
    },
    {
      "id": 76,
      "start": 313.1000061035156,
      "end": 318.70001220703125,
      "text": " As we enter into chapter number 2, we find that Paul continues to express his love and"
    },
    {
      "id": 77,
      "start": 318.70001220703125,
      "end": 322.1000061035156,
      "text": " concern for these believers in Colossae."
    },
    {
      "id": 78,
      "start": 322.1000061035156,
      "end": 327.17999267578125,
      "text": " You understand that Paul was not seeking to get anything from these believers."
    },
    {
      "id": 79,
      "start": 327.17999267578125,
      "end": 331.32000732421875,
      "text": " He was not seeking to increase some kingdom for himself."
    },
    {
      "id": 80,
      "start": 331.32000732421875,
      "end": 336.8999938964844,
      "text": " He was not seeking some accolades, recognition, any type of monetary gains."
    },
    {
      "id": 81,
      "start": 336.8999938964844,
      "end": 338.6199951171875,
      "text": " He was not seeking that."
    },
    {
      "id": 82,
      "start": 338.6199951171875,
      "end": 342.260009765625,
      "text": " He was simply desiring to be a blessing to these believers."
    },
    {
      "id": 83,
      "start": 342.260009765625,
      "end": 348.1000061035156,
      "text": " It reminds me of what Paul would say to the believers in Corinth in 2 Corinthians 12, 14 and 15."
    },
    {
      "id": 84,
      "start": 348.1000061035156,
      "end": 352.3399963378906,
      "text": " It's not the entirety of either one of those verses, but you find that Paul says this to"
    },
    {
      "id": 85,
      "start": 352.3399963378906,
      "end": 358.6600036621094,
      "text": " the believers in Corinth, I seek not yours, but you."
    },
    {
      "id": 86,
      "start": 358.6600036621094,
      "end": 368.0199890136719,
      "text": " And then he says this, I will very gladly spend and be spent for you."
    },
    {
      "id": 87,
      "start": 368.0199890136719,
      "end": 373.739990234375,
      "text": " Is that not a great contrast to the philosophy and approach of false teachers?"
    },
    {
      "id": 88,
      "start": 373.739990234375,
      "end": 379.4599914550781,
      "text": " We find that here as we enter into Colossians chapter number 2, that Paul says this, notice"
    },
    {
      "id": 89,
      "start": 379.4599914550781,
      "end": 388.17999267578125,
      "text": " with me in verse number 1, for I would that ye knew what great conflict I have for you"
    },
    {
      "id": 90,
      "start": 388.17999267578125,
      "end": 394.4599914550781,
      "text": " and for them at Laodicea, and for as many as have not seen my face in the flesh, that"
    },
    {
      "id": 91,
      "start": 394.4599914550781,
      "end": 400.8999938964844,
      "text": " their hearts might be comforted, being knit together in love, and unto all riches of the"
    },
    {
      "id": 92,
      "start": 400.8999938964844,
      "end": 406.260009765625,
      "text": " full assurance of understanding, to the acknowledgement of the mystery of God and of the Father and"
    },
    {
      "id": 93,
      "start": 406.260009765625,
      "end": 413.94000244140625,
      "text": " of Christ, in whom are hid all the treasures of wisdom and knowledge."
    },
    {
      "id": 94,
      "start": 413.94000244140625,
      "end": 415.17999267578125,
      "text": " We'll stop there this morning."
    },
    {
      "id": 95,
      "start": 415.17999267578125,
      "end": 418.1400146484375,
      "text": " We'll just look at the first three verses of Colossians 2."
    },
    {
      "id": 96,
      "start": 418.1400146484375,
      "end": 422.94000244140625,
      "text": " If you're taking notes, I've titled the message, Paul's Great Conflict."
    },
    {
      "id": 97,
      "start": 422.94000244140625,
      "end": 424.1400146484375,
      "text": " Paul's Great Conflict."
    },
    {
      "id": 98,
      "start": 424.1400146484375,
      "end": 429.3800048828125,
      "text": " Notice with me, if you're taking notes, number 1, Paul reveals the conflict that he has for"
    },
    {
      "id": 99,
      "start": 429.3800048828125,
      "end": 430.7799987792969,
      "text": " these believers."
    },
    {
      "id": 100,
      "start": 430.7799987792969,
      "end": 435.70001220703125,
      "text": " We find that as you begin reading in verse number 1, that Paul has a desire that these"
    },
    {
      "id": 101,
      "start": 435.70001220703125,
      "end": 442.5,
      "text": " believers in Colossae would have a knowledge and an understanding of that which he was"
    },
    {
      "id": 102,
      "start": 442.5,
      "end": 444.5400085449219,
      "text": " calling a great conflict."
    },
    {
      "id": 103,
      "start": 444.5400085449219,
      "end": 451.29998779296875,
      "text": " Really we would understand this morning that Paul was so deeply concerned for these believers"
    },
    {
      "id": 104,
      "start": 451.29998779296875,
      "end": 458.6600036621094,
      "text": " that the way in which he described that deep concern was that he had a great conflict."
    },
    {
      "id": 105,
      "start": 458.6600036621094,
      "end": 461.05999755859375,
      "text": " Now we're familiar with conflicts."
    },
    {
      "id": 106,
      "start": 461.05999755859375,
      "end": 466.260009765625,
      "text": " In fact, we live in a time and an era in which very few people understand anything about"
    },
    {
      "id": 107,
      "start": 466.260009765625,
      "end": 468.3399963378906,
      "text": " conflict resolution."
    },
    {
      "id": 108,
      "start": 468.3399963378906,
      "end": 473.7799987792969,
      "text": " We find that we live, and we have experienced, if you have lived for any length of time,"
    },
    {
      "id": 109,
      "start": 473.7799987792969,
      "end": 475.5799865722656,
      "text": " you've experienced conflict."
    },
    {
      "id": 110,
      "start": 475.5799865722656,
      "end": 482.260009765625,
      "text": " We find that Paul is describing for these believers in Colossae this conflict that he"
    },
    {
      "id": 111,
      "start": 482.260009765625,
      "end": 486.8999938964844,
      "text": " has, really it's an internal conflict that he's dealing with, and yes, there are some"
    },
    {
      "id": 112,
      "start": 486.8999938964844,
      "end": 493.6600036621094,
      "text": " external things that would lend to and lead to the conflict that Paul was experiencing,"
    },
    {
      "id": 113,
      "start": 493.6600036621094,
      "end": 499.05999755859375,
      "text": " but he says to these believers in Colossae, that I want you to know, for I would that"
    },
    {
      "id": 114,
      "start": 499.05999755859375,
      "end": 502.8599853515625,
      "text": " ye knew what great conflict I have for you."
    },
    {
      "id": 115,
      "start": 502.8599853515625,
      "end": 508.5,
      "text": " I believe that as we begin to read this portion of Scripture and have the opportunity to kind"
    },
    {
      "id": 116,
      "start": 508.5,
      "end": 515.5,
      "text": " of see the heart of the Apostle Paul a little bit here, we see other glimpses into the heart"
    },
    {
      "id": 117,
      "start": 515.5,
      "end": 521.0999755859375,
      "text": " of the Apostle Paul when he says in Romans 9 and Romans 10 that his heart's desire for"
    },
    {
      "id": 118,
      "start": 521.0999755859375,
      "end": 527.1400146484375,
      "text": " his kinsmen, his brethren, according to the flesh, is that they might be saved."
    },
    {
      "id": 119,
      "start": 527.1400146484375,
      "end": 534.8200073242188,
      "text": " And Paul is sharing here, he's allowing the believers in Colossae to see the heart of"
    },
    {
      "id": 120,
      "start": 534.8200073242188,
      "end": 536.8200073242188,
      "text": " a spiritual leader."
    },
    {
      "id": 121,
      "start": 536.8200073242188,
      "end": 543.0599975585938,
      "text": " The heart of one that has this great concern, this great, as he describes it, conflict for"
    },
    {
      "id": 122,
      "start": 543.0599975585938,
      "end": 544.5399780273438,
      "text": " these believers."
    },
    {
      "id": 123,
      "start": 544.5800170898438,
      "end": 550.739990234375,
      "text": " We find that this concern that Paul had, this conflict that he would reveal to these believers"
    },
    {
      "id": 124,
      "start": 550.739990234375,
      "end": 555.4600219726562,
      "text": " in Colossae, you'll understand as you read the entirety of verse number one, that it"
    },
    {
      "id": 125,
      "start": 555.4600219726562,
      "end": 559.02001953125,
      "text": " was not simply for the brethren in Colossae."
    },
    {
      "id": 126,
      "start": 559.02001953125,
      "end": 566.0599975585938,
      "text": " He says this, for I would that ye knew what great conflict I have for you, and for them"
    },
    {
      "id": 127,
      "start": 566.0599975585938,
      "end": 574.2999877929688,
      "text": " at Laodicea, and for as many as have not seen my face in the flesh."
    },
    {
      "id": 128,
      "start": 574.2999877929688,
      "end": 580.260009765625,
      "text": " I want you to consider that these two cities that are mentioned specifically, Colossae"
    },
    {
      "id": 129,
      "start": 580.260009765625,
      "end": 584.260009765625,
      "text": " and Laodicea, we understand that Colossae is not mentioned here in verse number one,"
    },
    {
      "id": 130,
      "start": 584.260009765625,
      "end": 588.4199829101562,
      "text": " but he says for you, and we understand the book is written to the believers in Colossae,"
    },
    {
      "id": 131,
      "start": 588.4199829101562,
      "end": 592.280029296875,
      "text": " and so we'd understand that he mentions these two cities, Colossae and Laodicea."
    },
    {
      "id": 132,
      "start": 592.280029296875,
      "end": 596.760009765625,
      "text": " They're separated by about 11 miles, but it would seem as we'll continue our study"
    },
    {
      "id": 133,
      "start": 596.760009765625,
      "end": 600.0399780273438,
      "text": " this morning that those false teachers that were there in..."
    },
    {
      "id": 0,
      "start": 600.0399780273438,
      "end": 605.4599781036377,
      "text": " Colossae have also had some level of influence there in Laodicea. He says not"
    },
    {
      "id": 1,
      "start": 605.4599781036377,
      "end": 610.2199783325195,
      "text": " only is he concerned about these particular churches that are established"
    },
    {
      "id": 2,
      "start": 610.2199783325195,
      "end": 614.899977684021,
      "text": " in these regions, in these locations, but he says, and for as many as have not seen"
    },
    {
      "id": 3,
      "start": 614.899977684021,
      "end": 620.6999778747559,
      "text": " my face in the flesh. You understand that as you trace the steps of the"
    },
    {
      "id": 4,
      "start": 620.6999778747559,
      "end": 623.939977645874,
      "text": " Apostle Paul throughout the book of Acts, and then as you study the epistles that"
    },
    {
      "id": 5,
      "start": 623.939977645874,
      "end": 627.8999786376953,
      "text": " God would allow him to pen, you'll find that the Apostle Paul had much"
    },
    {
      "id": 6,
      "start": 627.8999786376953,
      "end": 634.2199783325195,
      "text": " opportunity, had several areas in which he traveled and saw churches"
    },
    {
      "id": 7,
      "start": 634.2199783325195,
      "end": 638.419979095459,
      "text": " established. The first missionary journey that he took as he went into the"
    },
    {
      "id": 8,
      "start": 638.419979095459,
      "end": 642.2599792480469,
      "text": " regions of Galatia, there were no less than four churches that were started as"
    },
    {
      "id": 9,
      "start": 642.2599792480469,
      "end": 648.2199783325195,
      "text": " a result of that one single missionary journey. But you understand that from"
    },
    {
      "id": 10,
      "start": 648.2199783325195,
      "end": 652.5799789428711,
      "text": " these churches there were other churches that were established. When Paul would"
    },
    {
      "id": 11,
      "start": 652.5799789428711,
      "end": 656.7799797058105,
      "text": " write to the church in Thessalonica, a church in which he was able to enter"
    },
    {
      "id": 12,
      "start": 656.7799797058105,
      "end": 660.919979095459,
      "text": " into that city and see a church established in short order, you would"
    },
    {
      "id": 13,
      "start": 660.919979095459,
      "end": 665.8199768066406,
      "text": " find that Paul, as he writes back to that church, he commends them in 1st"
    },
    {
      "id": 14,
      "start": 665.8199768066406,
      "end": 673.6199798583984,
      "text": " Thessalonians 1, that from them went forth, sounded forth, the gospel. So the"
    },
    {
      "id": 15,
      "start": 673.6199798583984,
      "end": 679.3399810791016,
      "text": " gospel's spreading. And so Paul was keenly aware of the fact that the"
    },
    {
      "id": 16,
      "start": 679.3399810791016,
      "end": 686.2599792480469,
      "text": " truth of God's Word and the expansion of biblical Christianity was not just the"
    },
    {
      "id": 17,
      "start": 686.2599792480469,
      "end": 691.4599761962891,
      "text": " people that he had personally ministered among. There were others that"
    },
    {
      "id": 18,
      "start": 691.4599761962891,
      "end": 697.5799789428711,
      "text": " had not yet seen his face, and Paul has a concern for those believers as well. And"
    },
    {
      "id": 19,
      "start": 697.5799789428711,
      "end": 706.2999801635742,
      "text": " Paul is sharing this truth, and he says, I would that ye knew what great conflict"
    },
    {
      "id": 20,
      "start": 706.2999801635742,
      "end": 711.9399795532227,
      "text": " I have for you and for them at Laodicea, and for as many as have not seen my face"
    },
    {
      "id": 21,
      "start": 711.9399795532227,
      "end": 716.0199813842773,
      "text": " in the flesh. Turn over if you will, hold your place here, but look over at 2nd"
    },
    {
      "id": 22,
      "start": 716.0599746704102,
      "end": 719.6999816894531,
      "text": " Corinthians chapter number 11. I want you to see how Paul words it here to the"
    },
    {
      "id": 23,
      "start": 719.6999816894531,
      "end": 726.3399810791016,
      "text": " church in Corinth, really a similar truth that is being revealed here to us. We"
    },
    {
      "id": 24,
      "start": 726.3399810791016,
      "end": 730.2599792480469,
      "text": " find that the Apostle Paul is writing to these that he ministered among. You"
    },
    {
      "id": 25,
      "start": 730.2599792480469,
      "end": 735.5399780273438,
      "text": " understand that he served in Corinth for a lengthy period of time, perhaps one of"
    },
    {
      "id": 26,
      "start": 735.5399780273438,
      "end": 741.1799774169922,
      "text": " the longest durations of his ministry, and God blessed and worked, but of course"
    },
    {
      "id": 27,
      "start": 741.1799774169922,
      "end": 744.8199768066406,
      "text": " we know that there was much division and contention within the church in Corinth,"
    },
    {
      "id": 28,
      "start": 744.8199768066406,
      "end": 749.0999755859375,
      "text": " and he writes these letters, and we find that Paul in chapter number 11 of 2nd"
    },
    {
      "id": 29,
      "start": 749.0999755859375,
      "end": 755.5399780273438,
      "text": " Corinthians is describing several things that he had endured. We find that Paul"
    },
    {
      "id": 30,
      "start": 755.5399780273438,
      "end": 761.7799835205078,
      "text": " goes through, beginning in verse number 23, he says, Are they ministers of Christ? I"
    },
    {
      "id": 31,
      "start": 761.7799835205078,
      "end": 766.97998046875,
      "text": " speak as a fool, I am more. In labors more abundant, in stripes above measure, in"
    },
    {
      "id": 32,
      "start": 766.97998046875,
      "end": 772.3799743652344,
      "text": " prisons more frequent, in deaths oft of the Jews. Five times received I forty"
    },
    {
      "id": 33,
      "start": 772.3799743652344,
      "end": 776.9399719238281,
      "text": " stripes, save one. Thrice was I beaten with rods, once I was stoned, thrice I"
    },
    {
      "id": 34,
      "start": 776.9399719238281,
      "end": 782.7799835205078,
      "text": " suffered shipwreck. A night and a day I have been in the deep. In journeyings"
    },
    {
      "id": 35,
      "start": 782.7799835205078,
      "end": 788.97998046875,
      "text": " often, in perils of waters, in perils of robbers, in perils by my own countrymen,"
    },
    {
      "id": 36,
      "start": 788.97998046875,
      "end": 792.97998046875,
      "text": " in perils by the heathen, in perils in the city, in perils in the wilderness, in"
    },
    {
      "id": 37,
      "start": 792.97998046875,
      "end": 797.0599822998047,
      "text": " perils in the sea, in perils among the brethren, in weariness and painfulness,"
    },
    {
      "id": 38,
      "start": 797.1399841308594,
      "end": 802.97998046875,
      "text": " in watchings often, in hunger and thirst, in fastings often, in cold and nakedness."
    },
    {
      "id": 39,
      "start": 802.97998046875,
      "end": 808.8599853515625,
      "text": " Now when you read that list, you say, most of us have not experienced anything like"
    },
    {
      "id": 40,
      "start": 808.8599853515625,
      "end": 813.6599731445312,
      "text": " that. Amen? But you know what Paul says about those things, and I'm not even to"
    },
    {
      "id": 41,
      "start": 813.6599731445312,
      "end": 817.1799774169922,
      "text": " the really the climax of what I want to get to there in 2nd Corinthians 11, but"
    },
    {
      "id": 42,
      "start": 817.1799774169922,
      "end": 822.2999725341797,
      "text": " if you think back to chapter number 4 of the same book, Paul says this. Now he"
    },
    {
      "id": 43,
      "start": 822.2999725341797,
      "end": 826.4999847412109,
      "text": " describes in detail all of these things that I just read to you in chapter"
    },
    {
      "id": 44,
      "start": 826.4999847412109,
      "end": 831.7799835205078,
      "text": " number 11. In chapter number 4, he just calls them the things. Notice here, he"
    },
    {
      "id": 45,
      "start": 831.7799835205078,
      "end": 835.7799835205078,
      "text": " says, for which cause we faint not, in chapter 4 and verse number 16, but"
    },
    {
      "id": 46,
      "start": 835.7799835205078,
      "end": 840.2999725341797,
      "text": " through, excuse me, but though our outward man perish, yet the inward man is renewed"
    },
    {
      "id": 47,
      "start": 840.2999725341797,
      "end": 846.97998046875,
      "text": " day by day, for our light affliction. Did you hear all of those things that he"
    },
    {
      "id": 48,
      "start": 846.97998046875,
      "end": 853.4199829101562,
      "text": " mentioned in chapter number 11? Would you describe that as light affliction?"
    },
    {
      "id": 49,
      "start": 853.4199829101562,
      "end": 864.4999694824219,
      "text": " Paul says our light affliction is but for a moment, but for a moment, worketh"
    },
    {
      "id": 50,
      "start": 864.4999694824219,
      "end": 876.0199890136719,
      "text": " for us a far more exceeding and eternal weight of glory, while we look not at the"
    },
    {
      "id": 51,
      "start": 876.0199890136719,
      "end": 881.219970703125,
      "text": " things which are seen, but at the things which are not seen. For the things which"
    },
    {
      "id": 52,
      "start": 881.219970703125,
      "end": 887.0199890136719,
      "text": " are seen are temporal. The things which are not seen are eternal. Paul had a good"
    },
    {
      "id": 53,
      "start": 887.0199890136719,
      "end": 892.3799743652344,
      "text": " perspective on life, did he not? He says our light affliction, which is but for a"
    },
    {
      "id": 54,
      "start": 892.3799743652344,
      "end": 898.8999633789062,
      "text": " moment. Paul was looking to eternity, and he suffered all these things, but I want"
    },
    {
      "id": 55,
      "start": 898.8999633789062,
      "end": 904.5399780273438,
      "text": " you to notice what he says back in chapter 11 in verse number 28. He says"
    },
    {
      "id": 56,
      "start": 904.5399780273438,
      "end": 915.2999877929688,
      "text": " this, beside those things that are without, that which cometh upon me daily, notice what"
    },
    {
      "id": 57,
      "start": 915.2999877929688,
      "end": 925.4199829101562,
      "text": " he says, the care of all the churches. The care of all the churches. This morning as"
    },
    {
      "id": 58,
      "start": 925.4199829101562,
      "end": 931.5199890136719,
      "text": " I see the heart of the Apostle Paul in Colossians chapter number 2, in saying to these believers"
    },
    {
      "id": 59,
      "start": 931.5199890136719,
      "end": 938.6799926757812,
      "text": " in Colossae that I would that ye knew what great conflict I have for you, and for them"
    },
    {
      "id": 60,
      "start": 938.6799926757812,
      "end": 945.4399719238281,
      "text": " at Laodicea, and for as many as have not seen my face in the flesh. He summarizes it in"
    },
    {
      "id": 61,
      "start": 945.4399719238281,
      "end": 953.3599853515625,
      "text": " 2 Corinthians 11.28 and says that it's the care of all the churches. This morning as"
    },
    {
      "id": 62,
      "start": 953.3599853515625,
      "end": 958.719970703125,
      "text": " I read, as I've studied throughout the period of time as I've prepared this message and"
    },
    {
      "id": 63,
      "start": 958.719970703125,
      "end": 963.47998046875,
      "text": " I've read the book of Colossians dozens of times last year and the last quarter just"
    },
    {
      "id": 64,
      "start": 963.47998046875,
      "end": 968.7599792480469,
      "text": " in preparation for this study, I don't know how many times I've read the book of Colossians,"
    },
    {
      "id": 65,
      "start": 968.7599792480469,
      "end": 975.47998046875,
      "text": " but I know that as I come to this first verse of chapter number 2, I once again am seeing"
    },
    {
      "id": 66,
      "start": 975.47998046875,
      "end": 982.5599670410156,
      "text": " and realizing the passion that Paul had and the sincerity, the transparency that he's"
    },
    {
      "id": 67,
      "start": 982.5599670410156,
      "end": 993.4199829101562,
      "text": " sharing with those in which he seeks to minister. As a spiritual leader, the care of one church,"
    },
    {
      "id": 68,
      "start": 993.4199829101562,
      "end": 1000.9199829101562,
      "text": " one body of believers, it's significant. It's serious. And we find that Paul is saying,"
    },
    {
      "id": 69,
      "start": 1000.9199829101562,
      "end": 1009.0399780273438,
      "text": " I want you to know what great conflict I have. This conflict that he has, as I mentioned"
    },
    {
      "id": 70,
      "start": 1009.0399780273438,
      "end": 1017.3599853515625,
      "text": " already, he's so deeply concerned for them that he calls it a great conflict. As a pastor,"
    },
    {
      "id": 71,
      "start": 1017.3599853515625,
      "end": 1021.719970703125,
      "text": " as you study the book of Hebrews as we did last year, you find in chapter number 13 that"
    },
    {
      "id": 72,
      "start": 1021.719970703125,
      "end": 1028.6399841308594,
      "text": " the Bible describes one aspect of the responsibility of the pastor as one that watches for your"
    },
    {
      "id": 73,
      "start": 1028.6399841308594,
      "end": 1039.9599914550781,
      "text": " soul. Wow. It's a serious responsibility. And this morning, a true spiritual leader"
    },
    {
      "id": 74,
      "start": 1039.9599914550781,
      "end": 1048.0199890136719,
      "text": " will take seriously the responsibility of the call that God has placed upon their lives."
    },
    {
      "id": 75,
      "start": 1048.0199890136719,
      "end": 1053.2799682617188,
      "text": " We find this morning that Paul says, I want to reveal something to you. I want to reveal"
    },
    {
      "id": 76,
      "start": 1053.2799682617188,
      "end": 1058.239990234375,
      "text": " this great conflict that I have. As we continue and move through the passage of Scripture"
    },
    {
      "id": 77,
      "start": 1058.239990234375,
      "end": 1064.1599731445312,
      "text": " here in Colossians 2, we consider, number two, the reason for this conflict. What was"
    },
    {
      "id": 78,
      "start": 1064.1599731445312,
      "end": 1071.5599670410156,
      "text": " the reason that Paul had to lead to this great conflict that he refers to in verse number"
    },
    {
      "id": 79,
      "start": 1071.5599670410156,
      "end": 1076.3999633789062,
      "text": " 1? He says that it's for those that are in Colossae, for those that are in Laodicea,"
    },
    {
      "id": 80,
      "start": 1076.3999633789062,
      "end": 1081.6399841308594,
      "text": " for as many as have not seen my face in the flesh. Why is it? What is the reason? What"
    },
    {
      "id": 81,
      "start": 1081.6399841308594,
      "end": 1087.1599731445312,
      "text": " has led Paul to this great conflict? Well, I believe that as you study the entirety of"
    },
    {
      "id": 82,
      "start": 1087.1599731445312,
      "end": 1091.3599853515625,
      "text": " the book of Colossians, as you study the whole of Scripture, that you would say very"
    },
    {
      "id": 83,
      "start": 1091.3599853515625,
      "end": 1097.5599670410156,
      "text": " simply this, it was the fact that the enemy was active. It was the fact that false teaching"
    },
    {
      "id": 84,
      "start": 1097.5599670410156,
      "end": 1102.8599853515625,
      "text": " was prevalent. It was the fact that Paul had gone and preached the Gospel and those that"
    },
    {
      "id": 85,
      "start": 1102.8599853515625,
      "end": 1108.47998046875,
      "text": " had been saved take the Gospel far and wide and they seek to reach the world with the"
    },
    {
      "id": 86,
      "start": 1108.47998046875,
      "end": 1114.719970703125,
      "text": " Gospel of Jesus Christ and many have been saved. And the Bible says of those in the"
    },
    {
      "id": 87,
      "start": 1114.719970703125,
      "end": 1119.0,
      "text": " book of Acts and Paul and all of the missionary journeys that they that have turned the world"
    },
    {
      "id": 88,
      "start": 1119.0,
      "end": 1125.0,
      "text": " upside down have come here. I mean, the Word of God was marching forward and God was blessing"
    },
    {
      "id": 89,
      "start": 1125.0,
      "end": 1131.719970703125,
      "text": " and working, but we find that the enemy is always active. The enemy is always active."
    },
    {
      "id": 90,
      "start": 1131.719970703125,
      "end": 1136.7999877929688,
      "text": " And it was the activity of the enemy, it was the false teaching that was prevalent, not"
    },
    {
      "id": 91,
      "start": 1136.7999877929688,
      "end": 1142.5999755859375,
      "text": " only in Colossae, but had affected those in Laodicea, no doubt had affected many other"
    },
    {
      "id": 92,
      "start": 1142.6399536132812,
      "end": 1148.0,
      "text": " congregations throughout the known world at that point. And Paul says it's because of"
    },
    {
      "id": 93,
      "start": 1148.0,
      "end": 1153.9599609375,
      "text": " this activity, it's because of this false teaching that my heart, that I'm burdened,"
    },
    {
      "id": 94,
      "start": 1153.9599609375,
      "end": 1160.9599609375,
      "text": " that I'm concerned that I have this great conflict. We find that it was there in Colossae"
    },
    {
      "id": 95,
      "start": 1161.199951171875,
      "end": 1168.199951171875,
      "text": " the enemy would use deception and false teaching and we find that the enemy would seek to these"
    },
    {
      "id": 96,
      "start": 1168.8399658203125,
      "end": 1174.3200073242188,
      "text": " Gnostics that were active there in Colossae. One of their approaches would be that of this"
    },
    {
      "id": 97,
      "start": 1174.3200073242188,
      "end": 1180.1599731445312,
      "text": " high intellect. And they would speak often about wisdom and knowledge and they would"
    },
    {
      "id": 98,
      "start": 1180.1599731445312,
      "end": 1186.5599975585938,
      "text": " speak about mysteries and the way in which you could attain some spiritual level of some"
    },
    {
      "id": 99,
      "start": 1186.5599975585938,
      "end": 1192.8800048828125,
      "text": " mystery and some knowledge that was held back from others. Thus, you find so often that"
    },
    {
      "id": 100,
      "start": 1192.8800048828125,
      "end": 1199.3200073242188,
      "text": " Paul would use those same terminologies here in the book of Colossians as he's ministering"
    },
    {
      "id": 101,
      "start": 1199.3200073242188,
      "end": 1200.0799560546875,
      "text": " to these believers in Colossae."
    },
    {
      "id": 0,
      "start": 1200.0799560546875,
      "end": 1206.0799560546875,
      "text": " Colossi to help them understand that it is Christ in you, the hope of glory."
    },
    {
      "id": 1,
      "start": 1206.0799560546875,
      "end": 1210.3999557495117,
      "text": " Remember back in chapter 1 in verse number 27, to whom God would make known"
    },
    {
      "id": 2,
      "start": 1210.3999557495117,
      "end": 1215.0799560546875,
      "text": " what is the riches of the glory of this mystery among the Gentiles, which is"
    },
    {
      "id": 3,
      "start": 1215.0799560546875,
      "end": 1222.3399562835693,
      "text": " Christ in you, the hope of glory. He'll say in verse number 3 of this chapter 2,"
    },
    {
      "id": 4,
      "start": 1222.3399562835693,
      "end": 1230.5399551391602,
      "text": " in whom, speaking of Christ, are hid all the treasures of wisdom and knowledge."
    },
    {
      "id": 5,
      "start": 1230.5399551391602,
      "end": 1236.3399543762207,
      "text": " These false teachers that were active in Colossi, they often would use this thing"
    },
    {
      "id": 6,
      "start": 1236.3399543762207,
      "end": 1240.2599563598633,
      "text": " of intellect and they would speak of some wisdom or knowledge. I am thankful"
    },
    {
      "id": 7,
      "start": 1240.2599563598633,
      "end": 1244.939956665039,
      "text": " that Paul is writing Scripture, that all Scripture is given by inspiration of God."
    },
    {
      "id": 8,
      "start": 1244.939956665039,
      "end": 1250.8199577331543,
      "text": " I'm thankful today that we have the whole of God's Word and we have the"
    },
    {
      "id": 9,
      "start": 1250.8199577331543,
      "end": 1257.5399551391602,
      "text": " wisdom of God, the mind of Christ. And what a joy it is for us to know the"
    },
    {
      "id": 10,
      "start": 1257.5399551391602,
      "end": 1262.2599563598633,
      "text": " truth of the Word of God and that we can take the truth of God's Word and we can,"
    },
    {
      "id": 11,
      "start": 1262.2599563598633,
      "end": 1269.099952697754,
      "text": " as John said in 1 John, try the spirits because we have the Word of God."
    },
    {
      "id": 12,
      "start": 1269.099952697754,
      "end": 1274.2999572753906,
      "text": " You hear some teaching, you hear someone come in with some, man they sound good,"
    },
    {
      "id": 13,
      "start": 1274.2999572753906,
      "end": 1279.6799545288086,
      "text": " they're eloquent, and they use these big words and this great vocabulary. Be"
    },
    {
      "id": 14,
      "start": 1279.6799545288086,
      "end": 1287.439956665039,
      "text": " careful not to be awed by that. Check them to the Scriptures. Amen? I don't care"
    },
    {
      "id": 15,
      "start": 1287.439956665039,
      "end": 1291.4799575805664,
      "text": " how many letters somebody has after their name, before their name, it matters"
    },
    {
      "id": 16,
      "start": 1291.4799575805664,
      "end": 1298.3999557495117,
      "text": " not if they do not agree with what thus saith the Lord. Amen? If we're not careful,"
    },
    {
      "id": 17,
      "start": 1298.3999557495117,
      "end": 1303.1599578857422,
      "text": " you get on some internet site, you get some YouTube something or whatever, you"
    },
    {
      "id": 18,
      "start": 1303.1599578857422,
      "end": 1307.559959411621,
      "text": " say, oh but this person has a doctorate in this and they have a this and a that."
    },
    {
      "id": 19,
      "start": 1307.559959411621,
      "end": 1315.839958190918,
      "text": " Be careful. Professing themselves to be wise, they became fools. Romans chapter"
    },
    {
      "id": 20,
      "start": 1315.839958190918,
      "end": 1325.0399551391602,
      "text": " number one. Teaching must match this book. What was the tactic of the enemy in"
    },
    {
      "id": 21,
      "start": 1325.0399551391602,
      "end": 1328.6799621582031,
      "text": " Laodicea? You know, it actually was different than what it was in Colossae."
    },
    {
      "id": 22,
      "start": 1328.6799621582031,
      "end": 1333.6799621582031,
      "text": " Turn over to Revelation, if you will, chapter number three. We'll be back there"
    },
    {
      "id": 23,
      "start": 1333.6799621582031,
      "end": 1337.8399505615234,
      "text": " to the book of Colossians in just a moment, but I want you to see that God"
    },
    {
      "id": 24,
      "start": 1337.8399505615234,
      "end": 1342.8799591064453,
      "text": " has given us, the Bible's awesome, I love the Word of God, there's not much that we"
    },
    {
      "id": 25,
      "start": 1342.8799591064453,
      "end": 1348.8799591064453,
      "text": " know about this church in Laodicea. However, we find that God, as He would"
    },
    {
      "id": 26,
      "start": 1348.8799591064453,
      "end": 1353.1199493408203,
      "text": " give John the responsibility of these letters that are recorded in the book of"
    },
    {
      "id": 27,
      "start": 1353.1199493408203,
      "end": 1357.7599487304688,
      "text": " Revelation to these seven churches in Asia, that the last of these letters is"
    },
    {
      "id": 28,
      "start": 1357.7599487304688,
      "end": 1362.6399536132812,
      "text": " written to the church that Paul would reference here in Colossians chapter"
    },
    {
      "id": 29,
      "start": 1362.6399536132812,
      "end": 1367.4799499511719,
      "text": " number two. He says, listen, I'm not only concerned for those, for you, those in"
    },
    {
      "id": 30,
      "start": 1367.4799499511719,
      "end": 1371.6399536132812,
      "text": " Colossae, but those that are in Laodicea, and as many as have not seen my face. And"
    },
    {
      "id": 31,
      "start": 1371.6399536132812,
      "end": 1375.2799530029297,
      "text": " as you come to Revelation chapter number three, beginning in verse number 14, you"
    },
    {
      "id": 32,
      "start": 1375.2799530029297,
      "end": 1379.9599609375,
      "text": " find that this letter to this church is written. I have referred to this church"
    },
    {
      "id": 33,
      "start": 1379.9599609375,
      "end": 1386.439956665039,
      "text": " in the past as being the rich, poor church. There's a previous church that I"
    },
    {
      "id": 34,
      "start": 1386.439956665039,
      "end": 1391.1199493408203,
      "text": " referred to, that in Philadelphia, as the weak, strong church. And we find that it"
    },
    {
      "id": 35,
      "start": 1391.1199493408203,
      "end": 1396.0799560546875,
      "text": " was the church in Smyrna that is the poor church, but they were rich in Christ."
    },
    {
      "id": 36,
      "start": 1396.0799560546875,
      "end": 1401.0799560546875,
      "text": " We find that it was just church in Laodicea that the Bible calls this"
    },
    {
      "id": 37,
      "start": 1401.0799560546875,
      "end": 1407.1599578857422,
      "text": " church in verse number 14, and unto the angel, notice what it says, of the church"
    },
    {
      "id": 38,
      "start": 1407.1599578857422,
      "end": 1413.6399536132812,
      "text": " of the Laodiceans. It's very interesting because each of the previous six"
    },
    {
      "id": 39,
      "start": 1413.6399536132812,
      "end": 1418.0399627685547,
      "text": " letters that are written to these churches are all addressed to the church"
    },
    {
      "id": 40,
      "start": 1418.0399627685547,
      "end": 1424.719955444336,
      "text": " in whatever the city is. But here, the Bible says that it's the church of the"
    },
    {
      "id": 41,
      "start": 1424.719955444336,
      "end": 1431.4799499511719,
      "text": " Laodiceans. It says, write these things, saith the Amen, the faithful and true"
    },
    {
      "id": 42,
      "start": 1431.4799499511719,
      "end": 1436.5999603271484,
      "text": " witness, the beginning of the creation of God. Verse 15, I know thy works. Thou art"
    },
    {
      "id": 43,
      "start": 1436.5999603271484,
      "end": 1441.1199493408203,
      "text": " neither cold nor hot. I would thou work cold or hot. So then, because thou art"
    },
    {
      "id": 44,
      "start": 1441.1199493408203,
      "end": 1446.6799621582031,
      "text": " lukewarm and neither cold nor hot, I will spew thee out of my mouth. Notice verse"
    },
    {
      "id": 45,
      "start": 1446.6799621582031,
      "end": 1455.3199615478516,
      "text": " 17, because thou sayest, I am rich and increased with goods and have need of"
    },
    {
      "id": 46,
      "start": 1455.3199615478516,
      "end": 1464.6399536132812,
      "text": " nothing. I am rich and increased with goods and have need of nothing. In Laodicea,"
    },
    {
      "id": 47,
      "start": 1464.6399536132812,
      "end": 1471.5799560546875,
      "text": " they were dealing with this level of self-sufficiency, plenty, wealth. When it"
    },
    {
      "id": 48,
      "start": 1471.5799560546875,
      "end": 1474.9199523925781,
      "text": " says here that they have need of nothing, really, as you study the entirety of"
    },
    {
      "id": 49,
      "start": 1474.9199523925781,
      "end": 1477.6399536132812,
      "text": " this passage, you would find that they almost came to the point they didn't"
    },
    {
      "id": 50,
      "start": 1477.6399536132812,
      "end": 1485.5999450683594,
      "text": " think they needed God either. They were self-sufficient. They had plenty. The"
    },
    {
      "id": 51,
      "start": 1485.5999450683594,
      "end": 1490.9199523925781,
      "text": " continuation of verse number 17, it says this, and knowest not. You know, we can"
    },
    {
      "id": 52,
      "start": 1490.9199523925781,
      "end": 1496.43994140625,
      "text": " have our perspective, but God has His perspective. Typically, we'd like to"
    },
    {
      "id": 53,
      "start": 1496.43994140625,
      "end": 1502.1599426269531,
      "text": " describe ourselves in better terms than God would describe us. Is it not true? And"
    },
    {
      "id": 54,
      "start": 1502.3199462890625,
      "end": 1508.8799438476562,
      "text": " God says in verse number 17, and knowest not that thou art wretched and miserable"
    },
    {
      "id": 55,
      "start": 1508.8799438476562,
      "end": 1517.5199584960938,
      "text": " and poor and blind and naked. Wow, that's a different description than what they"
    },
    {
      "id": 56,
      "start": 1517.5199584960938,
      "end": 1524.1599426269531,
      "text": " had of themselves, is it not? Because thou sayest, here's what you say, here's what"
    },
    {
      "id": 57,
      "start": 1524.1599426269531,
      "end": 1530.6799621582031,
      "text": " God says. You find that the Bible says in verse number 19, as many as I love, I"
    },
    {
      "id": 58,
      "start": 1530.6799621582031,
      "end": 1536.7599487304688,
      "text": " rebuke and chasten. Be zealous, therefore, and repent. Notice verse 20. Behold, I"
    },
    {
      "id": 59,
      "start": 1536.7599487304688,
      "end": 1541.3599548339844,
      "text": " stand at the door and knock. If any man hear my voice and open the door, I will"
    },
    {
      "id": 60,
      "start": 1541.3599548339844,
      "end": 1547.0799560546875,
      "text": " come into him and will sup with him and he with me. I know that often Revelation"
    },
    {
      "id": 61,
      "start": 1547.0799560546875,
      "end": 1551.0399475097656,
      "text": " 3 and verse number 20, people will use that verse of Scripture as they try to"
    },
    {
      "id": 62,
      "start": 1551.0399475097656,
      "end": 1556.5599670410156,
      "text": " share the gospel with individuals, but the true context of this verse of"
    },
    {
      "id": 63,
      "start": 1556.5599670410156,
      "end": 1561.8399658203125,
      "text": " Scripture is written to the church of the Laodiceans. Jesus said, I will build"
    },
    {
      "id": 64,
      "start": 1561.8399658203125,
      "end": 1566.9999694824219,
      "text": " my church, and yet this church of the Laodiceans, the picture that we see in"
    },
    {
      "id": 65,
      "start": 1566.9999694824219,
      "end": 1573.5199584960938,
      "text": " verse number 20 is that Christ is on the outside of his church, knocking to get in."
    },
    {
      "id": 66,
      "start": 1573.5199584960938,
      "end": 1582.1599426269531,
      "text": " Wow. See, the enemy was active in Colossae through the Gnostics and through their"
    },
    {
      "id": 67,
      "start": 1582.199951171875,
      "end": 1586.8399658203125,
      "text": " level of intellect and wisdom and all of these things that they would speak of,"
    },
    {
      "id": 68,
      "start": 1586.8399658203125,
      "end": 1593.3199462890625,
      "text": " and really causing the people to really struggle and sway back and forth,"
    },
    {
      "id": 69,
      "start": 1593.3199462890625,
      "end": 1597.9999694824219,
      "text": " and in Laodicea, the enemy was working in a different manner. He was"
    },
    {
      "id": 70,
      "start": 1597.9999694824219,
      "end": 1601.199951171875,
      "text": " saying, hey, you guys, you're good, man, you have all of this wealth, you don't"
    },
    {
      "id": 71,
      "start": 1601.199951171875,
      "end": 1612.3199462890625,
      "text": " need this stuff. There's a danger in becoming self-sufficient, independent."
    },
    {
      "id": 72,
      "start": 1612.3199462890625,
      "end": 1618.1199645996094,
      "text": " The Word of God tells us that Jesus said, I am the vine, you're the branches."
    },
    {
      "id": 73,
      "start": 1618.1199645996094,
      "end": 1629.4799499511719,
      "text": " Without me, ye can do nothing. We need him, and here we find, as we look back to the"
    },
    {
      "id": 74,
      "start": 1629.4799499511719,
      "end": 1633.8399658203125,
      "text": " book of Colossians and consider the reason for this conflict that Paul is"
    },
    {
      "id": 75,
      "start": 1633.8399658203125,
      "end": 1638.5999450683594,
      "text": " describing in verse number one, we will remember that the enemy is subtle and"
    },
    {
      "id": 76,
      "start": 1638.5999450683594,
      "end": 1643.9199523925781,
      "text": " crafty. We'd understand that Paul would warn the believers in Ephesus and"
    },
    {
      "id": 77,
      "start": 1643.9199523925781,
      "end": 1648.2799682617188,
      "text": " instruct them to put on the whole armor of God, to go in the power and the"
    },
    {
      "id": 78,
      "start": 1648.2799682617188,
      "end": 1652.5999450683594,
      "text": " strength of God. Why? That they may be able to stand against the wiles of the"
    },
    {
      "id": 79,
      "start": 1652.5999450683594,
      "end": 1660.0799560546875,
      "text": " devil, his trickery, his craftiness, his deceit. We find that the approach of the"
    },
    {
      "id": 80,
      "start": 1660.0799560546875,
      "end": 1666.2799682617188,
      "text": " enemy will vary, but I'm thankful that we're not ignorant of his devices. You"
    },
    {
      "id": 81,
      "start": 1666.2799682617188,
      "end": 1670.5199584960938,
      "text": " read the Word of God, and you read the entirety of God's Word, and you will find"
    },
    {
      "id": 82,
      "start": 1670.5199584960938,
      "end": 1676.43994140625,
      "text": " many examples of how the enemy works. You will find in ways in which the"
    },
    {
      "id": 83,
      "start": 1676.43994140625,
      "end": 1682.9999694824219,
      "text": " enemy works in very deceitful means. He comes and speaks as if he's going to be"
    },
    {
      "id": 84,
      "start": 1682.9999694824219,
      "end": 1687.6399536132812,
      "text": " one of you. In fact, Jude warns of that very thing, that the reason that he's"
    },
    {
      "id": 85,
      "start": 1687.6399536132812,
      "end": 1693.5999450683594,
      "text": " writing that short but powerful epistle is that there were certain men that"
    },
    {
      "id": 86,
      "start": 1693.5999450683594,
      "end": 1701.6399536132812,
      "text": " crept in unawares, that had turned the grace of God into lasciviousness. And"
    },
    {
      "id": 87,
      "start": 1701.6399536132812,
      "end": 1706.2799682617188,
      "text": " Jude is writing that short epistle to the people of God to warn them about"
    },
    {
      "id": 88,
      "start": 1706.2799682617188,
      "end": 1711.199951171875,
      "text": " these false teachers that had crept into the church. We want to see the"
    },
    {
      "id": 89,
      "start": 1711.199951171875,
      "end": 1715.3199462890625,
      "text": " church grow, and it's a blessing to see the church grow, but oh, how we need to be"
    },
    {
      "id": 90,
      "start": 1715.3199462890625,
      "end": 1721.5199584960938,
      "text": " careful that we are mindful of the fact that the enemy does work, and he works in"
    },
    {
      "id": 91,
      "start": 1721.5199584960938,
      "end": 1727.8799438476562,
      "text": " such a way as that he'd like to infiltrate the church of God. We find"
    },
    {
      "id": 92,
      "start": 1727.8799438476562,
      "end": 1737.679931640625,
      "text": " that the enemy is tricky, he's crafty, he's subtle. This morning as we think"
    },
    {
      "id": 93,
      "start": 1737.679931640625,
      "end": 1741.5199584960938,
      "text": " about these two illustrations or examples that God gives us from His Word"
    },
    {
      "id": 94,
      "start": 1741.5199584960938,
      "end": 1747.3999633789062,
      "text": " with regard to these two churches in particular, we find that today the enemy"
    },
    {
      "id": 95,
      "start": 1747.3999633789062,
      "end": 1754.1199340820312,
      "text": " is still working. The enemy is working. In fact, the book of Revelation teaches us"
    },
    {
      "id": 96,
      "start": 1754.1199340820312,
      "end": 1758.2399291992188,
      "text": " that he knows that this time is short. I believe that we're living in the last"
    },
    {
      "id": 97,
      "start": 1758.2399291992188,
      "end": 1764.5599365234375,
      "text": " days, and I believe that it's almost kind of like that full-court press, if you"
    },
    {
      "id": 98,
      "start": 1764.5599365234375,
      "end": 1768.7999267578125,
      "text": " could use a basketball analogy. Satan's trying to pull out all the stops, if you"
    },
    {
      "id": 99,
      "start": 1768.7999267578125,
      "end": 1775.7599487304688,
      "text": " will, and he's working, he's active. We find that he's working today, he's seeking, I"
    },
    {
      "id": 100,
      "start": 1775.7599487304688,
      "end": 1780.9199829101562,
      "text": " believe, to separate and divide the people of God. You see the division in"
    },
    {
      "id": 101,
      "start": 1780.9199829101562,
      "end": 1785.9199829101562,
      "text": " the church in Corinth, and you see how that he was using various tactics there,"
    },
    {
      "id": 102,
      "start": 1785.9199829101562,
      "end": 1791.199951171875,
      "text": " and he was seeking to divide those individuals. We find that the enemy, he'll"
    },
    {
      "id": 103,
      "start": 1791.199951171875,
      "end": 1795.5199584960938,
      "text": " use all sorts of means, I mentioned a moment ago, about being careful of those"
    },
    {
      "id": 104,
      "start": 1795.5199584960938,
      "end": 1800.0399780273438,
      "text": " false teachers that abound. It's amazing."
    },
    {
      "id": 0,
      "start": 1800.0399780273438,
      "end": 1806.3999781608582,
      "text": " how much information is at the fingertips of our people today. It really"
    },
    {
      "id": 1,
      "start": 1806.3999781608582,
      "end": 1811.7999782562256,
      "text": " is, it's amazing. Can I tell you that most of that which you would find on the"
    },
    {
      "id": 2,
      "start": 1811.7999782562256,
      "end": 1818.439977645874,
      "text": " internet, I'd be careful of. I would be very careful. I warn you, that's what Paul"
    },
    {
      "id": 3,
      "start": 1818.439977645874,
      "end": 1825.079978942871,
      "text": " said, I'm warning every man. There's a lot of false teaching out there, a lot of it."
    },
    {
      "id": 4,
      "start": 1825.079978942871,
      "end": 1830.8399772644043,
      "text": " It's prevalent. And again, you understand that people will use this kind of thing,"
    },
    {
      "id": 5,
      "start": 1830.8399772644043,
      "end": 1838.1199798583984,
      "text": " well look at how many followers they have. I mean they must be right. People"
    },
    {
      "id": 6,
      "start": 1838.1199798583984,
      "end": 1845.4399795532227,
      "text": " think that way. Honestly, people think that way. There are many false teachers."
    },
    {
      "id": 7,
      "start": 1845.4399795532227,
      "end": 1850.8799781799316,
      "text": " The enemy is active, he's working. I'm thankful that God is working and that"
    },
    {
      "id": 8,
      "start": 1850.8799781799316,
      "end": 1855.51997756958,
      "text": " God is greater. But we understand that Paul says, here's the reason for this"
    },
    {
      "id": 9,
      "start": 1855.51997756958,
      "end": 1858.959976196289,
      "text": " conflict. It really, as you look at the whole book, he doesn't lay it out in"
    },
    {
      "id": 10,
      "start": 1858.959976196289,
      "end": 1862.8399772644043,
      "text": " simple words in verse number one as to the real reason, but as you study the"
    },
    {
      "id": 11,
      "start": 1862.8399772644043,
      "end": 1866.5599746704102,
      "text": " entirety of the book, you'd understand that the reason that Paul has this"
    },
    {
      "id": 12,
      "start": 1866.5599746704102,
      "end": 1870.3999786376953,
      "text": " conflict is because of the false teachers that are active in all that is"
    },
    {
      "id": 13,
      "start": 1870.3999786376953,
      "end": 1874.3199768066406,
      "text": " taking place and how that they're seeking to destroy, the enemy is seeking"
    },
    {
      "id": 14,
      "start": 1874.3199768066406,
      "end": 1878.9999771118164,
      "text": " to destroy and to devour. You understand that the enemy, that he's a liar. John"
    },
    {
      "id": 15,
      "start": 1879.0399780273438,
      "end": 1883.7199783325195,
      "text": " says this in John 8 and verse number 44 as Jesus is speaking and he's speaking"
    },
    {
      "id": 16,
      "start": 1883.7199783325195,
      "end": 1889.4399795532227,
      "text": " to these religious leaders and he says, you're of your father the devil and the"
    },
    {
      "id": 17,
      "start": 1889.4399795532227,
      "end": 1893.1599807739258,
      "text": " lust of your father you will do. He was a murderer from the beginning and abode"
    },
    {
      "id": 18,
      "start": 1893.1599807739258,
      "end": 1897.8799743652344,
      "text": " not in the truth because there is no truth in him. When he speaketh a lie, he"
    },
    {
      "id": 19,
      "start": 1897.8799743652344,
      "end": 1903.47998046875,
      "text": " speaketh of his own for he's a liar and the father of it. I know that I've often"
    },
    {
      "id": 20,
      "start": 1903.47998046875,
      "end": 1907.47998046875,
      "text": " said that false teachers, one of the things that we need to be so careful of"
    },
    {
      "id": 21,
      "start": 1907.47998046875,
      "end": 1913.079978942871,
      "text": " and we need discernment, we need wisdom from God, is that they will use our"
    },
    {
      "id": 22,
      "start": 1913.079978942871,
      "end": 1918.7999801635742,
      "text": " vocabulary but they mean something entirely different and it just takes a"
    },
    {
      "id": 23,
      "start": 1918.7999801635742,
      "end": 1925.5599746704102,
      "text": " little bit of digging to find out what they really mean and oh they will use"
    },
    {
      "id": 24,
      "start": 1925.5599746704102,
      "end": 1929.8799743652344,
      "text": " terms that perhaps you've heard and you've been familiar with but they mean"
    },
    {
      "id": 25,
      "start": 1929.8799743652344,
      "end": 1934.7599792480469,
      "text": " something entirely different and we need to be careful. We need to understand the"
    },
    {
      "id": 26,
      "start": 1934.7599792480469,
      "end": 1938.5199737548828,
      "text": " enemy is active and Paul says this is the reason that I have this conflict. As"
    },
    {
      "id": 27,
      "start": 1938.5199737548828,
      "end": 1942.5999755859375,
      "text": " we look at verses 2 and 3 this morning of Colossians chapter number 2, I would"
    },
    {
      "id": 28,
      "start": 1942.5999755859375,
      "end": 1949.2799835205078,
      "text": " say this, I would consider number 3, how to resolve this conflict. I understand"
    },
    {
      "id": 29,
      "start": 1949.2799835205078,
      "end": 1953.7999725341797,
      "text": " that the conflict will never completely be resolved until Jesus returns, until we"
    },
    {
      "id": 30,
      "start": 1953.7999725341797,
      "end": 1958.719970703125,
      "text": " get to be with him for all of eternity because the enemy, until he is banished,"
    },
    {
      "id": 31,
      "start": 1958.719970703125,
      "end": 1962.2799835205078,
      "text": " until even during the millennial reign of Christ, he's banished and he's bound"
    },
    {
      "id": 32,
      "start": 1962.2799835205078,
      "end": 1965.719970703125,
      "text": " for that thousand years but then he's loosed for a little season and the Bible"
    },
    {
      "id": 33,
      "start": 1965.719970703125,
      "end": 1969.3599853515625,
      "text": " tells us there's one final revolt but then in Revelation chapter number 20 in"
    },
    {
      "id": 34,
      "start": 1969.3599853515625,
      "end": 1972.5999755859375,
      "text": " verse number 10 he is cast in the lake of fire and he will burn, he'll be"
    },
    {
      "id": 35,
      "start": 1972.5999755859375,
      "end": 1982.3199768066406,
      "text": " tormented day and night forever and ever. But I believe for Paul, I would say for"
    },
    {
      "id": 36,
      "start": 1982.3199768066406,
      "end": 1987.8799743652344,
      "text": " myself as a spiritual leader, as I try to understand the heart of Paul and I can"
    },
    {
      "id": 37,
      "start": 1987.8799743652344,
      "end": 1991.7599792480469,
      "text": " can really relate to Paul in the conflict that he's sharing in the great"
    },
    {
      "id": 38,
      "start": 1991.7599792480469,
      "end": 1996.6799774169922,
      "text": " concern, I can relate to understanding that which he's dealing with and"
    },
    {
      "id": 39,
      "start": 1996.6799774169922,
      "end": 2001.7599792480469,
      "text": " understanding as being an under shepherd and having the responsibility of being a"
    },
    {
      "id": 40,
      "start": 2001.7599792480469,
      "end": 2006.1599731445312,
      "text": " pastor and watching for the souls of those that God would entrust and feeding"
    },
    {
      "id": 41,
      "start": 2006.1599731445312,
      "end": 2010.1199798583984,
      "text": " the flock of God and understanding the way in which the false teachers are"
    },
    {
      "id": 42,
      "start": 2010.1199798583984,
      "end": 2016.0799713134766,
      "text": " active, I can relate to Paul. And I say as I look at verses 2 and 3 as Paul is"
    },
    {
      "id": 43,
      "start": 2016.0799713134766,
      "end": 2021.1599731445312,
      "text": " really explaining what his desire is for these believers in Colossae, no"
    },
    {
      "id": 44,
      "start": 2021.1599731445312,
      "end": 2025.7999725341797,
      "text": " doubt for those in Laodicea and for as many as have not seen his face as well,"
    },
    {
      "id": 45,
      "start": 2025.7999725341797,
      "end": 2032.3199768066406,
      "text": " we'd find that it would help to resolve this conflict at least at this level. I"
    },
    {
      "id": 46,
      "start": 2032.3199768066406,
      "end": 2036.7999725341797,
      "text": " would say to you this morning that spiritual growth is the best way to"
    },
    {
      "id": 47,
      "start": 2036.7999725341797,
      "end": 2042.9199829101562,
      "text": " combat false teaching. Spiritual growth is the best way to combat false teaching,"
    },
    {
      "id": 48,
      "start": 2042.9199829101562,
      "end": 2049.7999725341797,
      "text": " knowing the truth. Listen to what Peter says in 2nd Peter 3 in verses 17 and 18."
    },
    {
      "id": 49,
      "start": 2049.9199829101562,
      "end": 2054.999984741211,
      "text": " Peter says this and often we quote verse number 18 but he says in 2nd Peter 3"
    },
    {
      "id": 50,
      "start": 2054.999984741211,
      "end": 2058.7999877929688,
      "text": " in verse number 17 as he finishes the short epistle, writing to these"
    },
    {
      "id": 51,
      "start": 2058.7999877929688,
      "end": 2063.1199645996094,
      "text": " believers that had been scattered abroad but he speaks to them in chapter 2 about"
    },
    {
      "id": 52,
      "start": 2063.1199645996094,
      "end": 2067.199981689453,
      "text": " the false teachers that were among them and he says this in 2nd Peter 3 in"
    },
    {
      "id": 53,
      "start": 2067.199981689453,
      "end": 2076.8799743652344,
      "text": " verse 17, ye therefore beloved, seeing ye know these things before, beware, lest ye"
    },
    {
      "id": 54,
      "start": 2076.8799743652344,
      "end": 2081.3599853515625,
      "text": " also being led away with the error of the wicked fall from your own"
    },
    {
      "id": 55,
      "start": 2081.3599853515625,
      "end": 2088.759979248047,
      "text": " steadfastness. But grow in grace and in the knowledge of our Lord and Savior"
    },
    {
      "id": 56,
      "start": 2088.759979248047,
      "end": 2096.199981689453,
      "text": " Jesus Christ. To Him be glory both now and forever. Amen. What is Peter saying?"
    },
    {
      "id": 57,
      "start": 2096.199981689453,
      "end": 2100.9199829101562,
      "text": " Those false teachers are around. They're gonna always be around and so what's the"
    },
    {
      "id": 58,
      "start": 2100.9199829101562,
      "end": 2105.5599670410156,
      "text": " best way to combat that false teaching? To grow spiritually. We have the Word of"
    },
    {
      "id": 59,
      "start": 2105.5599670410156,
      "end": 2110.1599731445312,
      "text": " God. We have the truth. Jesus said in John 17, sanctify them through Thy Word."
    },
    {
      "id": 60,
      "start": 2110.1599731445312,
      "end": 2116.519989013672,
      "text": " Thy Word is truth. Aren't you thankful we have the Bible? I mean it gives us the"
    },
    {
      "id": 61,
      "start": 2116.519989013672,
      "end": 2120.6399841308594,
      "text": " truth that we need. It gives us the ability to grow. He told them in 1st"
    },
    {
      "id": 62,
      "start": 2120.6399841308594,
      "end": 2125.6799926757812,
      "text": " Peter chapter number 2 in verse number 2, as newborn babes desire the sincere"
    },
    {
      "id": 63,
      "start": 2125.6799926757812,
      "end": 2131.8799743652344,
      "text": " milk of the Word that ye may grow thereby. It's that spiritual growth. Notice what Paul"
    },
    {
      "id": 64,
      "start": 2131.999969482422,
      "end": 2138.8399658203125,
      "text": " says back in Colossians 2 in verse number 2. As he's expressing his desire"
    },
    {
      "id": 65,
      "start": 2138.8399658203125,
      "end": 2145.6799926757812,
      "text": " for these believers that I believe would lead to the resolving of this conflict"
    },
    {
      "id": 66,
      "start": 2145.6799926757812,
      "end": 2149.959991455078,
      "text": " that he was dealing with, it says that their hearts, number 1 in verse number 2"
    },
    {
      "id": 67,
      "start": 2149.959991455078,
      "end": 2154.7999877929688,
      "text": " there, that their hearts might be comforted. That their hearts might be"
    },
    {
      "id": 68,
      "start": 2154.7999877929688,
      "end": 2158.6799926757812,
      "text": " comforted. This word comfort is an interesting word. We're familiar with the"
    },
    {
      "id": 69,
      "start": 2158.999969482422,
      "end": 2163.3599853515625,
      "text": " understand the Holy Spirit is the comforter, that our God is the God of all"
    },
    {
      "id": 70,
      "start": 2163.3599853515625,
      "end": 2167.5999755859375,
      "text": " comfort. It means to console. It also carries with it the idea of to encourage"
    },
    {
      "id": 71,
      "start": 2167.5999755859375,
      "end": 2173.5599670410156,
      "text": " and strengthen by consolation. I would believe that as I look at this passage"
    },
    {
      "id": 72,
      "start": 2173.5599670410156,
      "end": 2177.3199768066406,
      "text": " of Scripture and read these words that their hearts might be comforted. That"
    },
    {
      "id": 73,
      "start": 2177.3199768066406,
      "end": 2182.3199768066406,
      "text": " there was some level because of the activity of the false teachers that"
    },
    {
      "id": 74,
      "start": 2182.3199768066406,
      "end": 2187.199981689453,
      "text": " there was some level of chaos and confusion. There was perhaps some anxiety"
    },
    {
      "id": 75,
      "start": 2187.199981689453,
      "end": 2190.9199829101562,
      "text": " that was taking place and you understand that Paul is saying here"
    },
    {
      "id": 76,
      "start": 2190.9199829101562,
      "end": 2198.5999755859375,
      "text": " that he is desiring that their hearts might be comforted. You think about the"
    },
    {
      "id": 77,
      "start": 2198.5999755859375,
      "end": 2206.8399658203125,
      "text": " listen false teachers are they're persistent. We know something about our"
    },
    {
      "id": 78,
      "start": 2206.8399658203125,
      "end": 2218.1199645996094,
      "text": " enemy he's persistent is he not? He tempted the Lord Jesus Christ, God. He"
    },
    {
      "id": 79,
      "start": 2218.1199645996094,
      "end": 2222.7999877929688,
      "text": " tempted him in the wilderness. You read the passage of Scripture and it says"
    },
    {
      "id": 80,
      "start": 2222.7999877929688,
      "end": 2230.47998046875,
      "text": " that he departed for a little season. Listen the enemy is persistent. You read"
    },
    {
      "id": 81,
      "start": 2230.47998046875,
      "end": 2237.1599731445312,
      "text": " through the book of Nehemiah, Ezra. Read about the enemy in those books. I mean"
    },
    {
      "id": 82,
      "start": 2237.1599731445312,
      "end": 2243.0399780273438,
      "text": " it's persistent right? The enemy is persistent and the false teachers not"
    },
    {
      "id": 83,
      "start": 2243.0399780273438,
      "end": 2246.999969482422,
      "text": " only they're persistent but they're persuasive. They're persistent and"
    },
    {
      "id": 84,
      "start": 2246.999969482422,
      "end": 2252.0799865722656,
      "text": " they're persuasive. Think about all the way back in Genesis chapter number three."
    },
    {
      "id": 85,
      "start": 2252.1599731445312,
      "end": 2263.0399780273438,
      "text": " The serpent, the most subtle beast. The Bible says this, yea hath God said. Do you"
    },
    {
      "id": 86,
      "start": 2263.0399780273438,
      "end": 2270.0399780273438,
      "text": " not think that he the enemy was persuasive in the garden? To persuade Eve"
    },
    {
      "id": 87,
      "start": 2270.0399780273438,
      "end": 2277.999969482422,
      "text": " to partake of that fruit. He takes and he says look it's it's good for you. I mean"
    },
    {
      "id": 88,
      "start": 2277.999969482422,
      "end": 2284.8799743652344,
      "text": " your eyes will be open and you'll be like God. Is that it's a paraphrase but"
    },
    {
      "id": 89,
      "start": 2284.8799743652344,
      "end": 2291.9199829101562,
      "text": " is that not what he said? He's persuasive. He's persistent. He's persuasive. The"
    },
    {
      "id": 90,
      "start": 2291.9199829101562,
      "end": 2297.0799865722656,
      "text": " enemy is gonna try to make things look good, look appealing. That's what he does."
    },
    {
      "id": 91,
      "start": 2297.0799865722656,
      "end": 2302.5999755859375,
      "text": " That's how he works. That's how he operates. So Paul is saying when you think about the"
    },
    {
      "id": 92,
      "start": 2302.5999755859375,
      "end": 2306.719970703125,
      "text": " the false teaching that is prevalent and how they're active and you understand"
    },
    {
      "id": 93,
      "start": 2306.719970703125,
      "end": 2310.3999633789062,
      "text": " some of the the attributes of these false teachers that you would understand"
    },
    {
      "id": 94,
      "start": 2310.3999633789062,
      "end": 2315.0799560546875,
      "text": " that there's some conflict. There's some some some anxiety. They've heard"
    },
    {
      "id": 95,
      "start": 2315.0799560546875,
      "end": 2319.4400024414062,
      "text": " this truth but now they're hearing these people come in and and maybe there's"
    },
    {
      "id": 96,
      "start": 2319.4400024414062,
      "end": 2323.6799926757812,
      "text": " some that are kind of siding with these false teachers and it's a causes"
    },
    {
      "id": 97,
      "start": 2323.6799926757812,
      "end": 2330.6799926757812,
      "text": " anxiety. It causes this great level of difficulty within the body of believers."
    },
    {
      "id": 98,
      "start": 2330.719970703125,
      "end": 2338.719970703125,
      "text": " Why? He's seeking to divide. Paul says there in verse number two that their"
    },
    {
      "id": 99,
      "start": 2338.719970703125,
      "end": 2344.199951171875,
      "text": " hearts might be comforted. I'm thankful that our God is the God of all comfort."
    },
    {
      "id": 100,
      "start": 2344.199951171875,
      "end": 2347.9199829101562,
      "text": " We don't have time this morning but perhaps you'd like to write in your"
    },
    {
      "id": 101,
      "start": 2347.9199829101562,
      "end": 2352.3599853515625,
      "text": " notes to go back to the book of 2nd Corinthians and chapter number one and"
    },
    {
      "id": 102,
      "start": 2352.3599853515625,
      "end": 2358.3200073242188,
      "text": " read of all of the way in which Paul would describe the the fact that our God"
    },
    {
      "id": 103,
      "start": 2358.3599853515625,
      "end": 2362.3999633789062,
      "text": " is the God of all comfort. It's in 2nd Corinthians 1 verses 3 through 6 and"
    },
    {
      "id": 104,
      "start": 2362.3999633789062,
      "end": 2366.0399780273438,
      "text": " you'll see it there and I trust that would be a blessing to you but as we"
    },
    {
      "id": 105,
      "start": 2366.0399780273438,
      "end": 2370.5599975585938,
      "text": " move on and look at what Paul says number two there in verse number two he"
    },
    {
      "id": 106,
      "start": 2370.5599975585938,
      "end": 2380.239990234375,
      "text": " says being knit together in love. I like the phrase knit together. It gives us the"
    },
    {
      "id": 107,
      "start": 2380.239990234375,
      "end": 2386.0,
      "text": " understanding of unity. It helps us understand this knit together in love."
    },
    {
      "id": 108,
      "start": 2386.0,
      "end": 2390.7599487304688,
      "text": " Remember what Jesus said in John chapter number 13 as he would give"
    },
    {
      "id": 109,
      "start": 2390.7599487304688,
      "end": 2394.8399658203125,
      "text": " instruction to the disciples. He says a new commandment I give you that you love"
    },
    {
      "id": 110,
      "start": 2394.8399658203125,
      "end": 2402.0399780273438,
      "text": " one another as as I have loved you. By this, by what?"
    },
    {
      "id": 0,
      "start": 2402.0399780273438,
      "end": 2403.6799780130386,
      "text": " What? Our love one for another."
    },
    {
      "id": 1,
      "start": 2403.6799780130386,
      "end": 2407.0399780273438,
      "text": " Shall all men know that You are My disciples?"
    },
    {
      "id": 2,
      "start": 2407.0399780273438,
      "end": 2410.6399784088135,
      "text": " And Paul says that we'd be knit together in love."
    },
    {
      "id": 3,
      "start": 2410.6399784088135,
      "end": 2413.739977836609,
      "text": " That there would be some unity."
    },
    {
      "id": 4,
      "start": 2413.739977836609,
      "end": 2415.0399780273438,
      "text": " You'd understand this morning"
    },
    {
      "id": 5,
      "start": 2415.0399780273438,
      "end": 2420.359977722168,
      "text": " that unity is the result of embracing truth."
    },
    {
      "id": 6,
      "start": 2420.359977722168,
      "end": 2423.859977722168,
      "text": " Unity is the result of embracing truth."
    },
    {
      "id": 7,
      "start": 2423.859977722168,
      "end": 2426.3199787139893,
      "text": " It is not possible that we could have"
    },
    {
      "id": 8,
      "start": 2426.3199787139893,
      "end": 2428.659978866577,
      "text": " some level of unity by just simply"
    },
    {
      "id": 9,
      "start": 2428.659978866577,
      "end": 2433.199977874756,
      "text": " setting aside something that would divide us."
    },
    {
      "id": 10,
      "start": 2433.199977874756,
      "end": 2436.8199768066406,
      "text": " It's embracing truth that brings unity."
    },
    {
      "id": 11,
      "start": 2436.8199768066406,
      "end": 2440.01997756958,
      "text": " And what is that truth? It's the Word of God."
    },
    {
      "id": 12,
      "start": 2440.01997756958,
      "end": 2442.579978942871,
      "text": " And as we would embrace the truth of the Word of God,"
    },
    {
      "id": 13,
      "start": 2442.579978942871,
      "end": 2444.299976348877,
      "text": " and we'd understand this morning,"
    },
    {
      "id": 14,
      "start": 2444.299976348877,
      "end": 2446.6599769592285,
      "text": " listen, there's a group of people,"
    },
    {
      "id": 15,
      "start": 2446.6599769592285,
      "end": 2448.579978942871,
      "text": " and really it's a large group of people"
    },
    {
      "id": 16,
      "start": 2448.579978942871,
      "end": 2451.4999771118164,
      "text": " that would try to pretend this morning"
    },
    {
      "id": 17,
      "start": 2451.4999771118164,
      "end": 2457.459976196289,
      "text": " in our world that truth is relative."
    },
    {
      "id": 18,
      "start": 2457.459976196289,
      "end": 2459.7799797058105,
      "text": " That's ridiculous."
    },
    {
      "id": 19,
      "start": 2459.7799797058105,
      "end": 2462.8999786376953,
      "text": " There's not your truth and my truth."
    },
    {
      "id": 20,
      "start": 2462.8999786376953,
      "end": 2463.9399795532227,
      "text": " Amen?"
    },
    {
      "id": 21,
      "start": 2463.9399795532227,
      "end": 2465.8199768066406,
      "text": " There's truth."
    },
    {
      "id": 22,
      "start": 2465.8199768066406,
      "end": 2467.5399780273438,
      "text": " And truth stands."
    },
    {
      "id": 23,
      "start": 2467.5399780273438,
      "end": 2470.0999755859375,
      "text": " Truth endures."
    },
    {
      "id": 24,
      "start": 2470.0999755859375,
      "end": 2471.3399810791016,
      "text": " Thy Word is truth."
    },
    {
      "id": 25,
      "start": 2471.3399810791016,
      "end": 2476.3999786376953,
      "text": " Jesus said, I am the way, the truth, and the life."
    },
    {
      "id": 26,
      "start": 2476.3999786376953,
      "end": 2479.2199783325195,
      "text": " There's some people that would like"
    },
    {
      "id": 27,
      "start": 2479.2199783325195,
      "end": 2482.299980163574,
      "text": " to pretend that truth is relative."
    },
    {
      "id": 28,
      "start": 2482.299980163574,
      "end": 2483.699981689453,
      "text": " Well, that's just their truth,"
    },
    {
      "id": 29,
      "start": 2483.699981689453,
      "end": 2485.859977722168,
      "text": " and you can have your truth, and you can embrace."
    },
    {
      "id": 30,
      "start": 2485.859977722168,
      "end": 2488.6199798583984,
      "text": " Did that work for you in school?"
    },
    {
      "id": 31,
      "start": 2488.6199798583984,
      "end": 2490.05997467041,
      "text": " When you took an exam?"
    },
    {
      "id": 32,
      "start": 2490.05997467041,
      "end": 2491.8999786376953,
      "text": " I mean, did you ever take an exam"
    },
    {
      "id": 33,
      "start": 2491.8999786376953,
      "end": 2495.579978942871,
      "text": " and get a question wrong?"
    },
    {
      "id": 34,
      "start": 2495.579978942871,
      "end": 2498.0199813842773,
      "text": " We did, right?"
    },
    {
      "id": 35,
      "start": 2498.0199813842773,
      "end": 2500.0999755859375,
      "text": " When you put the answer on the exam,"
    },
    {
      "id": 36,
      "start": 2500.0999755859375,
      "end": 2502.859977722168,
      "text": " did you think it was right?"
    },
    {
      "id": 37,
      "start": 2502.859977722168,
      "end": 2504.259979248047,
      "text": " I mean, otherwise, you probably"
    },
    {
      "id": 38,
      "start": 2504.259979248047,
      "end": 2506.579978942871,
      "text": " wouldn't have put that answer."
    },
    {
      "id": 39,
      "start": 2506.579978942871,
      "end": 2508.139976501465,
      "text": " Did you argue with the professor,"
    },
    {
      "id": 40,
      "start": 2508.139976501465,
      "end": 2509.2199783325195,
      "text": " with the teacher, and say,"
    },
    {
      "id": 41,
      "start": 2509.2199783325195,
      "end": 2510.4999771118164,
      "text": " well, that might be your truth,"
    },
    {
      "id": 42,
      "start": 2510.4999771118164,
      "end": 2514.259979248047,
      "text": " but this is my truth?"
    },
    {
      "id": 43,
      "start": 2514.259979248047,
      "end": 2517.699981689453,
      "text": " Ridiculous, is it not?"
    },
    {
      "id": 44,
      "start": 2517.699981689453,
      "end": 2520.259979248047,
      "text": " But we pretend that that can work somehow."
    },
    {
      "id": 45,
      "start": 2520.259979248047,
      "end": 2522.5399780273438,
      "text": " It can't."
    },
    {
      "id": 46,
      "start": 2522.5399780273438,
      "end": 2525.9399795532227,
      "text": " There's truth, and it's the Word of God."
    },
    {
      "id": 47,
      "start": 2525.9399795532227,
      "end": 2530.8999786376953,
      "text": " And as we embrace truth, we can have unity."
    },
    {
      "id": 48,
      "start": 2530.8999786376953,
      "end": 2534.4199829101562,
      "text": " The enemy seeks to divide."
    },
    {
      "id": 49,
      "start": 2534.4199829101562,
      "end": 2536.259979248047,
      "text": " Notice what Paul says to the believers"
    },
    {
      "id": 50,
      "start": 2536.259979248047,
      "end": 2537.1399841308594,
      "text": " over in Ephesus."
    },
    {
      "id": 51,
      "start": 2537.1399841308594,
      "end": 2541.5399780273438,
      "text": " Turn back, if you will, to Ephesians chapter number four."
    },
    {
      "id": 52,
      "start": 2541.5399780273438,
      "end": 2545.6199798583984,
      "text": " Ephesians chapter number four."
    },
    {
      "id": 53,
      "start": 2545.6199798583984,
      "end": 2550.2999725341797,
      "text": " In verse number three, Paul says this,"
    },
    {
      "id": 54,
      "start": 2550.2999725341797,
      "end": 2555.6199798583984,
      "text": " Endeavoring to keep the unity of the Spirit"
    },
    {
      "id": 55,
      "start": 2555.6199798583984,
      "end": 2559.8599853515625,
      "text": " in the bond of peace."
    },
    {
      "id": 56,
      "start": 2559.8599853515625,
      "end": 2562.0599822998047,
      "text": " The idea of endeavoring is the idea"
    },
    {
      "id": 57,
      "start": 2562.0599822998047,
      "end": 2563.6199798583984,
      "text": " of laboring for something,"
    },
    {
      "id": 58,
      "start": 2563.6199798583984,
      "end": 2567.3399810791016,
      "text": " desiring it and being diligent to get it."
    },
    {
      "id": 59,
      "start": 2567.3399810791016,
      "end": 2569.019973754883,
      "text": " But the reality is that when he speaks"
    },
    {
      "id": 60,
      "start": 2569.019973754883,
      "end": 2570.8999786376953,
      "text": " about this truth of endeavoring"
    },
    {
      "id": 61,
      "start": 2570.97998046875,
      "end": 2573.1399841308594,
      "text": " to keep the unity of the Spirit"
    },
    {
      "id": 62,
      "start": 2573.1399841308594,
      "end": 2574.2999725341797,
      "text": " in the bond of peace,"
    },
    {
      "id": 63,
      "start": 2574.2999725341797,
      "end": 2578.699981689453,
      "text": " it's as we hold dear to the truth of this book."
    },
    {
      "id": 64,
      "start": 2578.699981689453,
      "end": 2580.3399810791016,
      "text": " I've used the illustration before"
    },
    {
      "id": 65,
      "start": 2580.3399810791016,
      "end": 2581.97998046875,
      "text": " of the tuning fork that would be used"
    },
    {
      "id": 66,
      "start": 2581.97998046875,
      "end": 2584.1399841308594,
      "text": " to tune a piano."
    },
    {
      "id": 67,
      "start": 2584.1399841308594,
      "end": 2586.1399841308594,
      "text": " And if you use the same tuning fork,"
    },
    {
      "id": 68,
      "start": 2586.1399841308594,
      "end": 2588.0599822998047,
      "text": " and you can travel large distances"
    },
    {
      "id": 69,
      "start": 2588.0599822998047,
      "end": 2590.179977416992,
      "text": " from one piano to the next piano,"
    },
    {
      "id": 70,
      "start": 2590.179977416992,
      "end": 2591.97998046875,
      "text": " but if you use the same instrument,"
    },
    {
      "id": 71,
      "start": 2591.97998046875,
      "end": 2593.5399780273438,
      "text": " that same tuning fork,"
    },
    {
      "id": 72,
      "start": 2593.5399780273438,
      "end": 2595.179977416992,
      "text": " and you tune those pianos,"
    },
    {
      "id": 73,
      "start": 2595.179977416992,
      "end": 2598.0999755859375,
      "text": " though they're distanced apart from one another,"
    },
    {
      "id": 74,
      "start": 2598.0999755859375,
      "end": 2600.3399810791016,
      "text": " they will have the same sound."
    },
    {
      "id": 75,
      "start": 2600.3399810791016,
      "end": 2603.8599853515625,
      "text": " Why? Because you use the same tuning fork."
    },
    {
      "id": 76,
      "start": 2603.8599853515625,
      "end": 2605.6599731445312,
      "text": " It's just the way it works."
    },
    {
      "id": 77,
      "start": 2605.6599731445312,
      "end": 2608.0999755859375,
      "text": " What's our quote-unquote tuning fork?"
    },
    {
      "id": 78,
      "start": 2608.0999755859375,
      "end": 2610.4199829101562,
      "text": " The Word of God."
    },
    {
      "id": 79,
      "start": 2610.4199829101562,
      "end": 2611.8199768066406,
      "text": " We can have unity with believers"
    },
    {
      "id": 80,
      "start": 2611.8199768066406,
      "end": 2613.6199798583984,
      "text": " in all sorts of different cultures"
    },
    {
      "id": 81,
      "start": 2613.6199798583984,
      "end": 2615.4199829101562,
      "text": " and countries around the world."
    },
    {
      "id": 82,
      "start": 2615.4199829101562,
      "end": 2617.459976196289,
      "text": " Why? Because we embrace the truth"
    },
    {
      "id": 83,
      "start": 2617.459976196289,
      "end": 2621.2999725341797,
      "text": " of God's Word, and it leads to unity."
    },
    {
      "id": 84,
      "start": 2621.2999725341797,
      "end": 2624.219970703125,
      "text": " We find even there in the book of Philippians,"
    },
    {
      "id": 85,
      "start": 2624.219970703125,
      "end": 2625.5799713134766,
      "text": " we see here in the book of Ephesians,"
    },
    {
      "id": 86,
      "start": 2625.5799713134766,
      "end": 2626.1399841308594,
      "text": " he speaks of it."
    },
    {
      "id": 87,
      "start": 2626.259979248047,
      "end": 2631.179977416992,
      "text": " Look in Philippians 2."
    },
    {
      "id": 88,
      "start": 2631.179977416992,
      "end": 2638.1399841308594,
      "text": " In Philippians 2, in verse 1,"
    },
    {
      "id": 89,
      "start": 2638.1399841308594,
      "end": 2638.5799713134766,
      "text": " Paul says,"
    },
    {
      "id": 90,
      "start": 2638.5799713134766,
      "end": 2641.3799743652344,
      "text": " \"...if there be therefore any consolation in Christ,"
    },
    {
      "id": 91,
      "start": 2641.3799743652344,
      "end": 2642.459976196289,
      "text": " if any comfort of love,"
    },
    {
      "id": 92,
      "start": 2642.459976196289,
      "end": 2643.6599731445312,
      "text": " if any fellowship of the Spirit,"
    },
    {
      "id": 93,
      "start": 2643.6599731445312,
      "end": 2644.8999786376953,
      "text": " if any bowels and mercies,"
    },
    {
      "id": 94,
      "start": 2644.8999786376953,
      "end": 2647.3799743652344,
      "text": " fulfill ye my joy,"
    },
    {
      "id": 95,
      "start": 2647.3799743652344,
      "end": 2649.939971923828,
      "text": " that ye be like-minded,"
    },
    {
      "id": 96,
      "start": 2649.939971923828,
      "end": 2651.0599822998047,
      "text": " having the same love,"
    },
    {
      "id": 97,
      "start": 2651.0599822998047,
      "end": 2653.499984741211,
      "text": " being of one accord and of one mind.\""
    },
    {
      "id": 98,
      "start": 2653.499984741211,
      "end": 2654.779983520508,
      "text": " How do we accomplish that?"
    },
    {
      "id": 99,
      "start": 2654.8199768066406,
      "end": 2659.0999755859375,
      "text": " We all come from different backgrounds."
    },
    {
      "id": 100,
      "start": 2659.0999755859375,
      "end": 2660.459991455078,
      "text": " Our mind is transformed"
    },
    {
      "id": 101,
      "start": 2660.459991455078,
      "end": 2663.97998046875,
      "text": " by the truth of God's Word."
    },
    {
      "id": 102,
      "start": 2663.97998046875,
      "end": 2665.6599731445312,
      "text": " Paul says in Romans 12"
    },
    {
      "id": 103,
      "start": 2665.6599731445312,
      "end": 2667.019989013672,
      "text": " that we're not to be conformed to this world,"
    },
    {
      "id": 104,
      "start": 2667.019989013672,
      "end": 2668.3399658203125,
      "text": " but that we're to be transformed"
    },
    {
      "id": 105,
      "start": 2668.3399658203125,
      "end": 2671.499969482422,
      "text": " by the renewing of your mind."
    },
    {
      "id": 106,
      "start": 2671.499969482422,
      "end": 2673.739990234375,
      "text": " That's how we can have unity."
    },
    {
      "id": 107,
      "start": 2673.739990234375,
      "end": 2675.7799682617188,
      "text": " Though we come from various backgrounds,"
    },
    {
      "id": 108,
      "start": 2675.7799682617188,
      "end": 2678.219970703125,
      "text": " though we've had different influences in our life,"
    },
    {
      "id": 109,
      "start": 2678.219970703125,
      "end": 2680.219970703125,
      "text": " when we allow the Word of God"
    },
    {
      "id": 110,
      "start": 2680.219970703125,
      "end": 2682.8999633789062,
      "text": " to do what only God's Word can do"
    },
    {
      "id": 111,
      "start": 2682.939971923828,
      "end": 2685.019989013672,
      "text": " in the lives of His people,"
    },
    {
      "id": 112,
      "start": 2685.019989013672,
      "end": 2686.0599670410156,
      "text": " it brings unity."
    },
    {
      "id": 113,
      "start": 2686.0599670410156,
      "end": 2689.1799926757812,
      "text": " It allows us to be like-minded."
    },
    {
      "id": 114,
      "start": 2689.1799926757812,
      "end": 2690.5399780273438,
      "text": " Not that we're robots."
    },
    {
      "id": 115,
      "start": 2690.5399780273438,
      "end": 2692.6199645996094,
      "text": " Not that we're just a bunch of people"
    },
    {
      "id": 116,
      "start": 2692.6199645996094,
      "end": 2696.939971923828,
      "text": " following aimlessly and mindlessly."
    },
    {
      "id": 117,
      "start": 2696.939971923828,
      "end": 2698.1399841308594,
      "text": " No, no."
    },
    {
      "id": 118,
      "start": 2698.1399841308594,
      "end": 2700.739990234375,
      "text": " We've examined this book!"
    },
    {
      "id": 119,
      "start": 2700.739990234375,
      "end": 2703.8199768066406,
      "text": " And we hold it dear and we hold it true."
    },
    {
      "id": 120,
      "start": 2703.8199768066406,
      "end": 2706.5399780273438,
      "text": " And it brings unity."
    },
    {
      "id": 121,
      "start": 2706.5399780273438,
      "end": 2707.0599670410156,
      "text": " Some people say,"
    },
    {
      "id": 122,
      "start": 2707.0599670410156,
      "end": 2709.3399658203125,
      "text": " oh, you guys are a bunch of puppets."
    },
    {
      "id": 123,
      "start": 2709.3399658203125,
      "end": 2709.8999633789062,
      "text": " No, no, no."
    },
    {
      "id": 124,
      "start": 2709.8999633789062,
      "end": 2712.5799865722656,
      "text": " We just have the same truth."
    },
    {
      "id": 125,
      "start": 2712.5799865722656,
      "end": 2714.019989013672,
      "text": " Amen?"
    },
    {
      "id": 126,
      "start": 2714.019989013672,
      "end": 2716.8599853515625,
      "text": " Look at verse number three."
    },
    {
      "id": 127,
      "start": 2716.8599853515625,
      "end": 2719.5799865722656,
      "text": " Let nothing be done"
    },
    {
      "id": 128,
      "start": 2719.5799865722656,
      "end": 2721.259979248047,
      "text": " through strife or vainglory,"
    },
    {
      "id": 129,
      "start": 2721.259979248047,
      "end": 2722.6199645996094,
      "text": " but in lowliness of mind"
    },
    {
      "id": 130,
      "start": 2722.6199645996094,
      "end": 2724.3799743652344,
      "text": " let each esteem other better than themselves."
    },
    {
      "id": 131,
      "start": 2724.3799743652344,
      "end": 2725.8599853515625,
      "text": " Look not every man on his own things,"
    },
    {
      "id": 132,
      "start": 2725.8599853515625,
      "end": 2727.5799865722656,
      "text": " but every man also on the things of others."
    },
    {
      "id": 133,
      "start": 2727.5799865722656,
      "end": 2729.259979248047,
      "text": " Notice verse number five."
    },
    {
      "id": 134,
      "start": 2729.259979248047,
      "end": 2731.2999877929688,
      "text": " Let this mind be in you,"
    },
    {
      "id": 135,
      "start": 2731.2999877929688,
      "end": 2733.019989013672,
      "text": " which was also in Christ Jesus."
    },
    {
      "id": 136,
      "start": 2733.019989013672,
      "end": 2734.3799743652344,
      "text": " We need to have the mind of Christ."
    },
    {
      "id": 137,
      "start": 2734.3799743652344,
      "end": 2735.6599731445312,
      "text": " He goes on to explain."
    },
    {
      "id": 138,
      "start": 2735.6599731445312,
      "end": 2738.0999755859375,
      "text": " We don't have time to look at all of that this morning,"
    },
    {
      "id": 139,
      "start": 2738.0999755859375,
      "end": 2740.259979248047,
      "text": " but we find that we can have unity"
    },
    {
      "id": 140,
      "start": 2740.259979248047,
      "end": 2741.97998046875,
      "text": " as we embrace truth."
    },
    {
      "id": 141,
      "start": 2741.97998046875,
      "end": 2743.4199829101562,
      "text": " Here in the book of Colossians,"
    },
    {
      "id": 142,
      "start": 2743.4199829101562,
      "end": 2745.8999633789062,
      "text": " we find that he speaks about unity"
    },
    {
      "id": 143,
      "start": 2745.8999633789062,
      "end": 2746.8599853515625,
      "text": " to these believers."
    },
    {
      "id": 144,
      "start": 2746.8599853515625,
      "end": 2748.739990234375,
      "text": " And he says in this passage"
    },
    {
      "id": 145,
      "start": 2748.739990234375,
      "end": 2749.7799682617188,
      "text": " that we're studying this morning"
    },
    {
      "id": 146,
      "start": 2749.7799682617188,
      "end": 2750.939971923828,
      "text": " in chapter two and verse number two,"
    },
    {
      "id": 147,
      "start": 2750.939971923828,
      "end": 2754.7799682617188,
      "text": " being knit together in love."
    },
    {
      "id": 148,
      "start": 2754.7799682617188,
      "end": 2759.2999877929688,
      "text": " I like the imagery of being knit together."
    },
    {
      "id": 149,
      "start": 2759.2999877929688,
      "end": 2760.699981689453,
      "text": " That bond of love"
    },
    {
      "id": 150,
      "start": 2760.699981689453,
      "end": 2763.0999755859375,
      "text": " as we would embrace the truth."
    },
    {
      "id": 151,
      "start": 2763.0999755859375,
      "end": 2764.4199829101562,
      "text": " Now you understand this morning"
    },
    {
      "id": 152,
      "start": 2764.4199829101562,
      "end": 2766.3399658203125,
      "text": " that as the people of God,"
    },
    {
      "id": 153,
      "start": 2766.3399658203125,
      "end": 2767.4199829101562,
      "text": " that there are some people"
    },
    {
      "id": 154,
      "start": 2767.4199829101562,
      "end": 2769.1399841308594,
      "text": " that are a little further along"
    },
    {
      "id": 155,
      "start": 2769.259979248047,
      "end": 2773.3799743652344,
      "text": " in their journey with God than you may be."
    },
    {
      "id": 156,
      "start": 2773.3799743652344,
      "end": 2775.699981689453,
      "text": " Amen?"
    },
    {
      "id": 157,
      "start": 2775.699981689453,
      "end": 2778.0999755859375,
      "text": " And as that would be the case,"
    },
    {
      "id": 158,
      "start": 2778.0999755859375,
      "end": 2779.7799682617188,
      "text": " it's through that humility"
    },
    {
      "id": 159,
      "start": 2779.7799682617188,
      "end": 2782.0999755859375,
      "text": " that Paul spoke of to the believers in Philippi"
    },
    {
      "id": 160,
      "start": 2782.0999755859375,
      "end": 2783.5799865722656,
      "text": " that would enable us to be able"
    },
    {
      "id": 161,
      "start": 2783.5799865722656,
      "end": 2786.019989013672,
      "text": " to effectively minister to those individuals"
    },
    {
      "id": 162,
      "start": 2786.019989013672,
      "end": 2789.259979248047,
      "text": " and see them grow in grace and knowledge"
    },
    {
      "id": 163,
      "start": 2789.259979248047,
      "end": 2792.0599670410156,
      "text": " of our Lord Jesus Christ."
    },
    {
      "id": 164,
      "start": 2792.0599670410156,
      "end": 2796.259979248047,
      "text": " Colossians 2, look at the rest of verse number two."
    },
    {
      "id": 165,
      "start": 2796.259979248047,
      "end": 2797.739990234375,
      "text": " We see that Paul would mention"
    },
    {
      "id": 166,
      "start": 2797.739990234375,
      "end": 2800.97998046875,
      "text": " the truth of spiritual growth and maturity."
    },
    {
      "id": 167,
      "start": 2800.97998046875,
      "end": 2802.259979248047,
      "text": " It says this,"
    },
    {
      "id": 168,
      "start": 2802.259979248047,
      "end": 2804.259979248047,
      "text": " \"...and unto all riches"
    },
    {
      "id": 169,
      "start": 2804.259979248047,
      "end": 2806.97998046875,
      "text": " of the full assurance of understanding"
    },
    {
      "id": 170,
      "start": 2806.97998046875,
      "end": 2809.3399658203125,
      "text": " to the acknowledgement of the mystery of God"
    },
    {
      "id": 171,
      "start": 2809.3399658203125,
      "end": 2811.1799926757812,
      "text": " unto the Father and of Christ,"
    },
    {
      "id": 172,
      "start": 2811.1799926757812,
      "end": 2813.6199645996094,
      "text": " in whom are hid all the treasures"
    },
    {
      "id": 173,
      "start": 2813.6199645996094,
      "end": 2816.5799865722656,
      "text": " of wisdom and knowledge.\""
    },
    {
      "id": 174,
      "start": 2816.5799865722656,
      "end": 2818.6199645996094,
      "text": " As we look at the last phrase of verse number two"
    },
    {
      "id": 175,
      "start": 2818.6199645996094,
      "end": 2821.8599853515625,
      "text": " in the entirety of verse number three,"
    },
    {
      "id": 176,
      "start": 2821.8599853515625,
      "end": 2824.0999755859375,
      "text": " we find again that this spiritual growth"
    },
    {
      "id": 177,
      "start": 2824.0999755859375,
      "end": 2826.2999877929688,
      "text": " and maturity is in full view."
    },
    {
      "id": 178,
      "start": 2826.3399658203125,
      "end": 2828.3799743652344,
      "text": " We find that he uses the terminology"
    },
    {
      "id": 179,
      "start": 2828.3799743652344,
      "end": 2829.5799865722656,
      "text": " in verse number two,"
    },
    {
      "id": 180,
      "start": 2829.5799865722656,
      "end": 2831.019989013672,
      "text": " notice what he says,"
    },
    {
      "id": 181,
      "start": 2831.019989013672,
      "end": 2834.8999633789062,
      "text": " \"...the full assurance of understanding.\""
    },
    {
      "id": 182,
      "start": 2834.8999633789062,
      "end": 2837.8999633789062,
      "text": " I'm thankful that we have the whole Bible."
    },
    {
      "id": 183,
      "start": 2837.8999633789062,
      "end": 2839.499969482422,
      "text": " The whole canon of Scripture."
    },
    {
      "id": 184,
      "start": 2839.499969482422,
      "end": 2842.8999633789062,
      "text": " Listen, if there's something that you don't know"
    },
    {
      "id": 185,
      "start": 2842.8999633789062,
      "end": 2844.8599853515625,
      "text": " that God hasn't told us,"
    },
    {
      "id": 186,
      "start": 2844.8599853515625,
      "end": 2846.6599731445312,
      "text": " there's no person that's going to give you"
    },
    {
      "id": 187,
      "start": 2846.6599731445312,
      "end": 2849.499969482422,
      "text": " some extra revelation."
    },
    {
      "id": 188,
      "start": 2849.499969482422,
      "end": 2851.8199768066406,
      "text": " That's what the false teachers want to say."
    },
    {
      "id": 189,
      "start": 2851.8199768066406,
      "end": 2852.6199645996094,
      "text": " Right?"
    },
    {
      "id": 190,
      "start": 2852.6199645996094,
      "end": 2855.5799865722656,
      "text": " But God said, the book is finished."
    },
    {
      "id": 191,
      "start": 2855.6199645996094,
      "end": 2858.1799926757812,
      "text": " His Word is settled in heaven."
    },
    {
      "id": 192,
      "start": 2858.1799926757812,
      "end": 2859.97998046875,
      "text": " We're not looking for any new revelation,"
    },
    {
      "id": 193,
      "start": 2859.97998046875,
      "end": 2861.3399658203125,
      "text": " any more revelation."
    },
    {
      "id": 194,
      "start": 2861.3399658203125,
      "end": 2864.019989013672,
      "text": " We have the Word of God."
    },
    {
      "id": 195,
      "start": 2864.019989013672,
      "end": 2867.6599731445312,
      "text": " And he says that you can have a full assurance"
    },
    {
      "id": 196,
      "start": 2867.6599731445312,
      "end": 2869.2999877929688,
      "text": " of understanding."
    },
    {
      "id": 197,
      "start": 2869.2999877929688,
      "end": 2871.739990234375,
      "text": " Isn't that awesome?"
    },
    {
      "id": 198,
      "start": 2871.739990234375,
      "end": 2872.5799865722656,
      "text": " Somebody comes and says,"
    },
    {
      "id": 199,
      "start": 2872.5799865722656,
      "end": 2877.259979248047,
      "text": " let me give you some enlightenment."
    },
    {
      "id": 200,
      "start": 2877.259979248047,
      "end": 2878.219970703125,
      "text": " No, no."
    },
    {
      "id": 201,
      "start": 2878.219970703125,
      "end": 2879.499969482422,
      "text": " I have the Word of God."
    },
    {
      "id": 202,
      "start": 2879.499969482422,
      "end": 2880.8999633789062,
      "text": " At the entrance of Thy words,"
    },
    {
      "id": 203,
      "start": 2880.8999633789062,
      "end": 2882.1799926757812,
      "text": " give it light."
    },
    {
      "id": 204,
      "start": 2882.1799926757812,
      "end": 2884.0599670410156,
      "text": " Amen?"
    },
    {
      "id": 205,
      "start": 2884.0599670410156,
      "end": 2886.699981689453,
      "text": " Remind that he says,"
    },
    {
      "id": 206,
      "start": 2886.699981689453,
      "end": 2889.019989013672,
      "text": " \"...to the acknowledgment of the mystery of God.\""
    },
    {
      "id": 207,
      "start": 2889.019989013672,
      "end": 2891.0599670410156,
      "text": " Again, he would use these terminologies"
    },
    {
      "id": 208,
      "start": 2891.0599670410156,
      "end": 2892.8199768066406,
      "text": " that these false teachers would use."
    },
    {
      "id": 209,
      "start": 2892.8199768066406,
      "end": 2894.6199645996094,
      "text": " And he speaks again about this acknowledgment"
    },
    {
      "id": 210,
      "start": 2894.6199645996094,
      "end": 2895.6199645996094,
      "text": " of the mystery of God."
    },
    {
      "id": 211,
      "start": 2895.6199645996094,
      "end": 2896.8599853515625,
      "text": " What is the mystery of God?"
    },
    {
      "id": 212,
      "start": 2896.8599853515625,
      "end": 2898.259979248047,
      "text": " We would find that he mentioned"
    },
    {
      "id": 213,
      "start": 2898.259979248047,
      "end": 2900.8599853515625,
      "text": " in chapter 1 that it's Christ in you,"
    },
    {
      "id": 214,
      "start": 2900.8599853515625,
      "end": 2902.019989013672,
      "text": " the hope of glory,"
    },
    {
      "id": 215,
      "start": 2902.019989013672,
      "end": 2903.8599853515625,
      "text": " and we studied the passage of Scripture"
    },
    {
      "id": 216,
      "start": 2903.8599853515625,
      "end": 2906.019989013672,
      "text": " even in verse 19 of chapter 1,"
    },
    {
      "id": 217,
      "start": 2906.019989013672,
      "end": 2907.459991455078,
      "text": " how that we would understand"
    },
    {
      "id": 218,
      "start": 2907.459991455078,
      "end": 2909.499969482422,
      "text": " that Christ is the mystery of God"
    },
    {
      "id": 219,
      "start": 2909.499969482422,
      "end": 2912.4199829101562,
      "text": " in the sense that it is the Lord Jesus Christ"
    },
    {
      "id": 220,
      "start": 2912.459991455078,
      "end": 2918.6199951171875,
      "text": " that manifests God to man."
    },
    {
      "id": 221,
      "start": 2918.6199951171875,
      "end": 2922.3399658203125,
      "text": " Bottom line, Christ is all I need."
    },
    {
      "id": 222,
      "start": 2922.3399658203125,
      "end": 2923.3399658203125,
      "text": " The songwriter said,"
    },
    {
      "id": 223,
      "start": 2923.3399658203125,
      "end": 2924.3800048828125,
      "text": " Christ is all I need."
    },
    {
      "id": 224,
      "start": 2924.3800048828125,
      "end": 2928.4599609375,
      "text": " All, all I need."
    },
    {
      "id": 225,
      "start": 2928.4599609375,
      "end": 2930.2599487304688,
      "text": " We find in verse 19,"
    },
    {
      "id": 226,
      "start": 2930.2599487304688,
      "end": 2932.739990234375,
      "text": " it says this of chapter 1 in verse 19,"
    },
    {
      "id": 227,
      "start": 2932.739990234375,
      "end": 2935.0199584960938,
      "text": " \"...for it pleased the Father"
    },
    {
      "id": 228,
      "start": 2935.0199584960938,
      "end": 2936.1399536132812,
      "text": " that in Him...\""
    },
    {
      "id": 229,
      "start": 2936.1399536132812,
      "end": 2937.8999633789062,
      "text": " Who is Him? It's Christ."
    },
    {
      "id": 230,
      "start": 2937.8999633789062,
      "end": 2939.9400024414062,
      "text": " If you go back and look at the context,"
    },
    {
      "id": 231,
      "start": 2939.9400024414062,
      "end": 2941.8200073242188,
      "text": " you'll understand he's speaking of Christ."
    },
    {
      "id": 232,
      "start": 2941.8599853515625,
      "end": 2947.6199951171875,
      "text": " \"...that in Him should all fullness dwell.\""
    },
    {
      "id": 233,
      "start": 2947.6199951171875,
      "end": 2949.5799560546875,
      "text": " Hebrews 1 speaks of the same thing."
    },
    {
      "id": 234,
      "start": 2949.5799560546875,
      "end": 2951.0999755859375,
      "text": " We don't have time to go there."
    },
    {
      "id": 235,
      "start": 2951.0999755859375,
      "end": 2952.7799682617188,
      "text": " But we find that Paul is saying"
    },
    {
      "id": 236,
      "start": 2952.7799682617188,
      "end": 2954.5399780273438,
      "text": " to these believers in Colossae,"
    },
    {
      "id": 237,
      "start": 2954.5399780273438,
      "end": 2955.699951171875,
      "text": " he's saying, listen,"
    },
    {
      "id": 238,
      "start": 2955.699951171875,
      "end": 2958.6199951171875,
      "text": " the way to resolve the conflict that I have"
    },
    {
      "id": 239,
      "start": 2958.6199951171875,
      "end": 2960.8999633789062,
      "text": " is that we would have this comfort,"
    },
    {
      "id": 240,
      "start": 2960.8999633789062,
      "end": 2962.739990234375,
      "text": " that we would have this encouragement"
    },
    {
      "id": 241,
      "start": 2962.739990234375,
      "end": 2964.9400024414062,
      "text": " and this strength by consolation"
    },
    {
      "id": 242,
      "start": 2964.9400024414062,
      "end": 2967.2599487304688,
      "text": " that our hearts would be knit together in love,"
    },
    {
      "id": 243,
      "start": 2967.2599487304688,
      "end": 2968.5,
      "text": " that we would have unity,"
    },
    {
      "id": 244,
      "start": 2968.5,
      "end": 2970.5799560546875,
      "text": " and that we would have spiritual growth"
    },
    {
      "id": 245,
      "start": 2970.6199951171875,
      "end": 2972.0199584960938,
      "text": " and maturity."
    },
    {
      "id": 246,
      "start": 2972.0199584960938,
      "end": 2972.8599853515625,
      "text": " Why?"
    },
    {
      "id": 247,
      "start": 2972.8599853515625,
      "end": 2976.0999755859375,
      "text": " Because then the false teachers have no chance."
    },
    {
      "id": 248,
      "start": 2976.0999755859375,
      "end": 2979.6599731445312,
      "text": " Honestly, if you have a group of people,"
    },
    {
      "id": 249,
      "start": 2979.6599731445312,
      "end": 2981.1799926757812,
      "text": " if Fellowship Baptist Church,"
    },
    {
      "id": 250,
      "start": 2981.1799926757812,
      "end": 2983.4599609375,
      "text": " we'll use ourselves as an example this morning,"
    },
    {
      "id": 251,
      "start": 2983.4599609375,
      "end": 2987.219970703125,
      "text": " if we have, if our hearts are comforted,"
    },
    {
      "id": 252,
      "start": 2987.219970703125,
      "end": 2989.6599731445312,
      "text": " if we're encouraging and strengthening one another"
    },
    {
      "id": 253,
      "start": 2989.6599731445312,
      "end": 2990.8200073242188,
      "text": " through this consolation,"
    },
    {
      "id": 254,
      "start": 2990.8200073242188,
      "end": 2992.699951171875,
      "text": " if we have this unity"
    },
    {
      "id": 255,
      "start": 2992.699951171875,
      "end": 2995.5,
      "text": " because we've embraced the truth of the Word of God,"
    },
    {
      "id": 256,
      "start": 2995.5,
      "end": 2998.1399536132812,
      "text": " if we're growing and we have spiritual growth"
    },
    {
      "id": 257,
      "start": 2998.1799926757812,
      "end": 2999.3399658203125,
      "text": " and maturity,"
    },
    {
      "id": 258,
      "start": 2999.3399658203125,
      "end": 3001.97998046875,
      "text": " and some false teacher walks in these doors."
    },
    {
      "id": 0,
      "start": 3001.97998046875,
      "end": 3004.6399805545807,
      "text": " He's not going to have a chance."
    },
    {
      "id": 1,
      "start": 3004.6399805545807,
      "end": 3005.7599804401398,
      "text": " Amen?"
    },
    {
      "id": 2,
      "start": 3005.7599804401398,
      "end": 3007.9199805259705,
      "text": " You understand, I'm coming off the platform, Jim."
    },
    {
      "id": 3,
      "start": 3007.9199805259705,
      "end": 3010.8399801254272,
      "text": " You understand this morning that false teachers,"
    },
    {
      "id": 4,
      "start": 3010.8399801254272,
      "end": 3012.599980354309,
      "text": " they're not going to come talk to me"
    },
    {
      "id": 5,
      "start": 3012.599980354309,
      "end": 3015.47998046875,
      "text": " about their false teaching."
    },
    {
      "id": 6,
      "start": 3015.47998046875,
      "end": 3018.319980621338,
      "text": " They're going to come to Samantha."
    },
    {
      "id": 7,
      "start": 3018.319980621338,
      "end": 3020.47998046875,
      "text": " They're going to come to some other young person"
    },
    {
      "id": 8,
      "start": 3020.47998046875,
      "end": 3021.559980392456,
      "text": " in our church."
    },
    {
      "id": 9,
      "start": 3021.559980392456,
      "end": 3022.799980163574,
      "text": " They're going to come to you."
    },
    {
      "id": 10,
      "start": 3022.799980163574,
      "end": 3024.6799812316895,
      "text": " They're going to try to have dinner with you."
    },
    {
      "id": 11,
      "start": 3024.6799812316895,
      "end": 3026.219980239868,
      "text": " And they're going to try to introduce"
    },
    {
      "id": 12,
      "start": 3026.219980239868,
      "end": 3027.719980239868,
      "text": " their false teaching."
    },
    {
      "id": 13,
      "start": 3027.719980239868,
      "end": 3029.7599811553955,
      "text": " That's how they work."
    },
    {
      "id": 14,
      "start": 3029.8399810791016,
      "end": 3031.3399810791016,
      "text": " It's what they do."
    },
    {
      "id": 15,
      "start": 3034.719982147217,
      "end": 3038.239978790283,
      "text": " It's okay that the pastor has grown spiritually"
    },
    {
      "id": 16,
      "start": 3038.239978790283,
      "end": 3040.4599800109863,
      "text": " and has an understanding of the Word of God,"
    },
    {
      "id": 17,
      "start": 3040.4599800109863,
      "end": 3045.159980773926,
      "text": " but the people have to be spiritually mature."
    },
    {
      "id": 18,
      "start": 3045.159980773926,
      "end": 3048.299980163574,
      "text": " You have to be growing in your walk with God."
    },
    {
      "id": 19,
      "start": 3048.299980163574,
      "end": 3049.8999786376953,
      "text": " So that when a false teacher comes in"
    },
    {
      "id": 20,
      "start": 3049.8999786376953,
      "end": 3051.4999809265137,
      "text": " and meets with you and you say,"
    },
    {
      "id": 21,
      "start": 3051.4999809265137,
      "end": 3053.419979095459,
      "text": " we don't believe that."
    },
    {
      "id": 22,
      "start": 3053.419979095459,
      "end": 3055.0199813842773,
      "text": " And here's why we don't believe that,"
    },
    {
      "id": 23,
      "start": 3055.0199813842773,
      "end": 3057.259979248047,
      "text": " because the Word of God says,"
    },
    {
      "id": 24,
      "start": 3057.259979248047,
      "end": 3058.719982147217,
      "text": " and all of a sudden, they put their tail"
    },
    {
      "id": 25,
      "start": 3058.719982147217,
      "end": 3061.239978790283,
      "text": " between their knees and they go running out."
    },
    {
      "id": 26,
      "start": 3061.239978790283,
      "end": 3062.079978942871,
      "text": " Why?"
    },
    {
      "id": 27,
      "start": 3062.079978942871,
      "end": 3064.0599822998047,
      "text": " Because they don't want to mess with you."
    },
    {
      "id": 28,
      "start": 3064.0599822998047,
      "end": 3065.639980316162,
      "text": " You know the Bible."
    },
    {
      "id": 29,
      "start": 3067.3399810791016,
      "end": 3068.299980163574,
      "text": " Amen."
    },
    {
      "id": 30,
      "start": 3068.299980163574,
      "end": 3070.679977416992,
      "text": " It's the way it works."
    },
    {
      "id": 31,
      "start": 3070.679977416992,
      "end": 3074.0399780273438,
      "text": " And so Paul's saying, I believe."
    },
    {
      "id": 32,
      "start": 3074.0399780273438,
      "end": 3076.779983520508,
      "text": " If we're going to resolve this great conflict,"
    },
    {
      "id": 33,
      "start": 3076.779983520508,
      "end": 3078.97998046875,
      "text": " man, we need to have some believers"
    },
    {
      "id": 34,
      "start": 3078.97998046875,
      "end": 3082.0199813842773,
      "text": " that are strong spiritually."
    },
    {
      "id": 35,
      "start": 3082.0199813842773,
      "end": 3084.0199813842773,
      "text": " That have unity."
    },
    {
      "id": 36,
      "start": 3084.0199813842773,
      "end": 3086.8199768066406,
      "text": " That are comforting and strengthening one another,"
    },
    {
      "id": 37,
      "start": 3086.8399810791016,
      "end": 3089.6399841308594,
      "text": " encouraging one another with comfort."
    },
    {
      "id": 38,
      "start": 3089.6399841308594,
      "end": 3091.8199768066406,
      "text": " And as we have that,"
    },
    {
      "id": 39,
      "start": 3091.8199768066406,
      "end": 3093.4399795532227,
      "text": " those false teachers are going to go down the road"
    },
    {
      "id": 40,
      "start": 3093.4399795532227,
      "end": 3095.199981689453,
      "text": " and find someone else to mess with."
    },
    {
      "id": 41,
      "start": 3097.579978942871,
      "end": 3098.9999771118164,
      "text": " But if we don't have that,"
    },
    {
      "id": 42,
      "start": 3100.2399826049805,
      "end": 3101.6399841308594,
      "text": " those false teachers come in"
    },
    {
      "id": 43,
      "start": 3102.759979248047,
      "end": 3105.4999771118164,
      "text": " and they begin to introduce their false teaching."
    },
    {
      "id": 44,
      "start": 3106.3999786376953,
      "end": 3107.9599838256836,
      "text": " And they influence this family."
    },
    {
      "id": 45,
      "start": 3109.4399795532227,
      "end": 3112.4399795532227,
      "text": " And they find this family over here to influence."
    },
    {
      "id": 46,
      "start": 3112.4399795532227,
      "end": 3114.7199783325195,
      "text": " And then they influence another family."
    },
    {
      "id": 47,
      "start": 3114.7199783325195,
      "end": 3117.0199813842773,
      "text": " They say, don't talk to pastor about this."
    },
    {
      "id": 48,
      "start": 3120.0599822998047,
      "end": 3120.8999786376953,
      "text": " Right?"
    },
    {
      "id": 49,
      "start": 3121.859977722168,
      "end": 3123.3399810791016,
      "text": " They get this family and that family,"
    },
    {
      "id": 50,
      "start": 3123.3399810791016,
      "end": 3124.859977722168,
      "text": " and then all of a sudden,"
    },
    {
      "id": 51,
      "start": 3124.859977722168,
      "end": 3127.9199829101562,
      "text": " they have this nucleus of people in a church"
    },
    {
      "id": 52,
      "start": 3129.179977416992,
      "end": 3131.5399780273438,
      "text": " that's all on board with what their agenda is."
    },
    {
      "id": 53,
      "start": 3132.679977416992,
      "end": 3133.939987182617,
      "text": " Do you know that you can walk,"
    },
    {
      "id": 54,
      "start": 3133.939987182617,
      "end": 3135.779983520508,
      "text": " or not walk, that you could walk,"
    },
    {
      "id": 55,
      "start": 3135.779983520508,
      "end": 3138.1399841308594,
      "text": " but you can travel around the United States of America"
    },
    {
      "id": 56,
      "start": 3138.1399841308594,
      "end": 3140.7999877929688,
      "text": " and you can find churches all over our land"
    },
    {
      "id": 57,
      "start": 3140.7999877929688,
      "end": 3143.199981689453,
      "text": " that one day stood on truth."
    },
    {
      "id": 58,
      "start": 3144.199981689453,
      "end": 3148.739974975586,
      "text": " That today look nothing like what they once stood for."
    },
    {
      "id": 59,
      "start": 3148.739974975586,
      "end": 3149.699981689453,
      "text": " Why?"
    },
    {
      "id": 60,
      "start": 3149.699981689453,
      "end": 3152.3199768066406,
      "text": " Because some guy came in and took it captive."
    },
    {
      "id": 61,
      "start": 3153.779983520508,
      "end": 3155.5799865722656,
      "text": " It happens."
    },
    {
      "id": 62,
      "start": 3155.5799865722656,
      "end": 3157.699981689453,
      "text": " Do your research."
    },
    {
      "id": 63,
      "start": 3157.699981689453,
      "end": 3159.019973754883,
      "text": " Happens all the time."
    },
    {
      "id": 64,
      "start": 3160.5799865722656,
      "end": 3164.499984741211,
      "text": " Why is it that we watch for your souls as spiritual leaders?"
    },
    {
      "id": 65,
      "start": 3164.499984741211,
      "end": 3167.8599853515625,
      "text": " Why is it that we're instructed to feed the flock of God"
    },
    {
      "id": 66,
      "start": 3168.97998046875,
      "end": 3170.8199768066406,
      "text": " so that we can be spiritually mature?"
    },
    {
      "id": 67,
      "start": 3171.8199768066406,
      "end": 3173.1199798583984,
      "text": " So that we can be strengthened"
    },
    {
      "id": 68,
      "start": 3173.1199798583984,
      "end": 3175.239974975586,
      "text": " against the attack of the enemy?"
    },
    {
      "id": 69,
      "start": 3175.239974975586,
      "end": 3177.5599822998047,
      "text": " So that we can stand for truth?"
    },
    {
      "id": 70,
      "start": 3179.239974975586,
      "end": 3181.6399841308594,
      "text": " We find this morning that Paul says,"
    },
    {
      "id": 71,
      "start": 3181.6399841308594,
      "end": 3183.3599853515625,
      "text": " I have this great conflict."
    },
    {
      "id": 72,
      "start": 3184.519973754883,
      "end": 3186.259979248047,
      "text": " I have this great conflict."
    },
    {
      "id": 73,
      "start": 3187.1199798583984,
      "end": 3189.239974975586,
      "text": " And I believe this morning that"
    },
    {
      "id": 74,
      "start": 3189.239974975586,
      "end": 3192.0399780273438,
      "text": " if the people of God would get serious"
    },
    {
      "id": 75,
      "start": 3192.0399780273438,
      "end": 3194.3599853515625,
      "text": " about knowing God and his word,"
    },
    {
      "id": 76,
      "start": 3195.519973754883,
      "end": 3197.9199829101562,
      "text": " we could see some resolution, if you will,"
    },
    {
      "id": 77,
      "start": 3197.9199829101562,
      "end": 3200.0399780273438,
      "text": " to this great conflict."
    },
    {
      "id": 78,
      "start": 3200.0599822998047,
      "end": 3200.8799743652344,
      "text": " Why?"
    },
    {
      "id": 79,
      "start": 3200.8799743652344,
      "end": 3203.4199829101562,
      "text": " Because the spiritual leader can kind of take,"
    },
    {
      "id": 80,
      "start": 3203.4199829101562,
      "end": 3207.0599822998047,
      "text": " if you will, not that he's going to be negligent"
    },
    {
      "id": 81,
      "start": 3207.0599822998047,
      "end": 3209.2999877929688,
      "text": " in any of his duties or responsibilities,"
    },
    {
      "id": 82,
      "start": 3210.1399841308594,
      "end": 3212.0999755859375,
      "text": " but he can have an assurance that"
    },
    {
      "id": 83,
      "start": 3213.3399810791016,
      "end": 3215.459976196289,
      "text": " the people that God's called me to lead,"
    },
    {
      "id": 84,
      "start": 3217.6599731445312,
      "end": 3221.4199829101562,
      "text": " they're solid, they know the word of God,"
    },
    {
      "id": 85,
      "start": 3221.4199829101562,
      "end": 3223.179977416992,
      "text": " and they're gonna be able to stand."
    },
    {
      "id": 86,
      "start": 3224.1399841308594,
      "end": 3229.1399841308594,
      "text": " See, this morning, we've mentioned the reason"
    },
    {
      "id": 87,
      "start": 3229.5599822998047,
      "end": 3230.8399810791016,
      "text": " for this conflict."
    },
    {
      "id": 88,
      "start": 3231.959976196289,
      "end": 3236.279983520508,
      "text": " And we've acknowledged that the enemy's still working today."
    },
    {
      "id": 89,
      "start": 3236.279983520508,
      "end": 3238.0399780273438,
      "text": " The enemy is active, he's working."
    },
    {
      "id": 90,
      "start": 3238.999984741211,
      "end": 3241.199981689453,
      "text": " And the question that I'd ask myself"
    },
    {
      "id": 91,
      "start": 3241.199981689453,
      "end": 3243.679977416992,
      "text": " and I'd ask you this morning,"
    },
    {
      "id": 92,
      "start": 3243.679977416992,
      "end": 3245.179977416992,
      "text": " are you growing?"
    },
    {
      "id": 93,
      "start": 3245.179977416992,
      "end": 3246.259979248047,
      "text": " Are you grounded?"
    },
    {
      "id": 94,
      "start": 3247.6399841308594,
      "end": 3250.5999755859375,
      "text": " Can you give a defense of your faith?"
    },
    {
      "id": 95,
      "start": 3252.1399841308594,
      "end": 3254.1199798583984,
      "text": " Are you able to go to the word of God"
    },
    {
      "id": 96,
      "start": 3254.1199798583984,
      "end": 3257.519973754883,
      "text": " and understand, thus saith the Lord?"
    },
    {
      "id": 97,
      "start": 3257.519973754883,
      "end": 3259.199981689453,
      "text": " That's what God's word says."
    },
    {
      "id": 98,
      "start": 3260.699981689453,
      "end": 3261.8599853515625,
      "text": " See, that we would be growing."
    },
    {
      "id": 99,
      "start": 3261.8599853515625,
      "end": 3263.5799865722656,
      "text": " Why is Paul saying, I'm warning every man"
    },
    {
      "id": 100,
      "start": 3263.5799865722656,
      "end": 3265.5399780273438,
      "text": " and teaching every man?"
    },
    {
      "id": 101,
      "start": 3265.5399780273438,
      "end": 3268.4199829101562,
      "text": " Because he understands the false teachers are active."
    },
    {
      "id": 102,
      "start": 3268.4199829101562,
      "end": 3270.5799865722656,
      "text": " And as we teach the word of God,"
    },
    {
      "id": 103,
      "start": 3271.759979248047,
      "end": 3274.97998046875,
      "text": " oh, God will help us to be strengthened."
    },
    {
      "id": 104,
      "start": 3274.97998046875,
      "end": 3277.739990234375,
      "text": " And we can know what God's word says."
    },
    {
      "id": 105,
      "start": 3277.739990234375,
      "end": 3279.5799865722656,
      "text": " When that enemy comes, that false teacher,"
    },
    {
      "id": 106,
      "start": 3279.5799865722656,
      "end": 3281.0599670410156,
      "text": " that email that somebody sends you,"
    },
    {
      "id": 107,
      "start": 3281.0599670410156,
      "end": 3284.1399841308594,
      "text": " hey, look what I found online, it's great, isn't it?"
    },
    {
      "id": 108,
      "start": 3284.1399841308594,
      "end": 3286.3399658203125,
      "text": " So actually, it's not true, and here's why."
    },
    {
      "id": 109,
      "start": 3287.5799865722656,
      "end": 3289.8999938964844,
      "text": " I know that's not popular."
    },
    {
      "id": 110,
      "start": 3289.8999938964844,
      "end": 3291.5799865722656,
      "text": " I understand that."
    },
    {
      "id": 111,
      "start": 3291.5799865722656,
      "end": 3294.5799865722656,
      "text": " But we better be grounded and settled"
    },
    {
      "id": 112,
      "start": 3294.5799865722656,
      "end": 3296.8199768066406,
      "text": " on the truth of God's word."
    },
    {
      "id": 113,
      "start": 3296.8199768066406,
      "end": 3298.8999938964844,
      "text": " Paul's great conflict."
    },
    {
      "id": 114,
      "start": 3298.8999938964844,
      "end": 3300.4199829101562,
      "text": " This morning, I believe that there are many"
    },
    {
      "id": 115,
      "start": 3300.4199829101562,
      "end": 3302.3399658203125,
      "text": " spiritual leaders all across this land"
    },
    {
      "id": 116,
      "start": 3303.219970703125,
      "end": 3305.6199951171875,
      "text": " that are in the same situation that Paul was in."
    },
    {
      "id": 117,
      "start": 3306.6599731445312,
      "end": 3309.2999877929688,
      "text": " There's a concern that we have for the people of God."
    },
    {
      "id": 118,
      "start": 3311.1399841308594,
      "end": 3313.1799926757812,
      "text": " Why do we teach the word of God?"
    },
    {
      "id": 119,
      "start": 3313.1799926757812,
      "end": 3316.1399841308594,
      "text": " Desire to give truth, service after service,"
    },
    {
      "id": 120,
      "start": 3316.1599731445312,
      "end": 3318.7999877929688,
      "text": " week after week, because we know"
    },
    {
      "id": 121,
      "start": 3318.7999877929688,
      "end": 3320.959991455078,
      "text": " that there are false teachers that abound."
    },
    {
      "id": 122,
      "start": 3321.959991455078,
      "end": 3325.8399658203125,
      "text": " It's God's plan that we would be grounded,"
    },
    {
      "id": 123,
      "start": 3325.8399658203125,
      "end": 3327.8399658203125,
      "text": " that we would not be tossed to and fro"
    },
    {
      "id": 124,
      "start": 3327.8399658203125,
      "end": 3329.759979248047,
      "text": " with any wind of doctrine, as Paul says"
    },
    {
      "id": 125,
      "start": 3329.759979248047,
      "end": 3331.719970703125,
      "text": " to the leaders in Ephesus."
    },
    {
      "id": 126,
      "start": 3331.719970703125,
      "end": 3334.1199951171875,
      "text": " No, no, here's what God's word says."
    },
    {
      "id": 127,
      "start": 3334.1199951171875,
      "end": 3336.239990234375,
      "text": " This morning, how are you growing?"
    },
    {
      "id": 128,
      "start": 3337.2799682617188,
      "end": 3338.9199829101562,
      "text": " Are you growing?"
    },
    {
      "id": 129,
      "start": 3338.9199829101562,
      "end": 3341.199981689453,
      "text": " I'm not asking you to tell me,"
    },
    {
      "id": 130,
      "start": 3341.199981689453,
      "end": 3342.759979248047,
      "text": " but I'm asking you to evaluate your own life."
    },
    {
      "id": 131,
      "start": 3342.759979248047,
      "end": 3344.3599853515625,
      "text": " Are you growing?"
    },
    {
      "id": 132,
      "start": 3344.3799743652344,
      "end": 3346.3799743652344,
      "text": " How are you growing?"
    },
    {
      "id": 133,
      "start": 3346.3799743652344,
      "end": 3347.939971923828,
      "text": " Do you wanna grow?"
    },
    {
      "id": 134,
      "start": 3347.939971923828,
      "end": 3349.739990234375,
      "text": " Is there that desire?"
    },
    {
      "id": 135,
      "start": 3350.5799865722656,
      "end": 3355.5799865722656,
      "text": " Oh, if there is, outside of the services"
    },
    {
      "id": 136,
      "start": 3355.6199951171875,
      "end": 3358.1799926757812,
      "text": " that we have weekly, getting active and involved"
    },
    {
      "id": 137,
      "start": 3358.1799926757812,
      "end": 3360.019989013672,
      "text": " in those services and hearing the teaching"
    },
    {
      "id": 138,
      "start": 3360.019989013672,
      "end": 3361.1399841308594,
      "text": " and preaching of the word of God."
    },
    {
      "id": 139,
      "start": 3361.1399841308594,
      "end": 3362.8999938964844,
      "text": " You know, I don't preach the same message tonight"
    },
    {
      "id": 140,
      "start": 3362.8999938964844,
      "end": 3364.6599731445312,
      "text": " that I preached this morning."
    },
    {
      "id": 141,
      "start": 3364.6599731445312,
      "end": 3366.939971923828,
      "text": " I preached an entirely different message."
    },
    {
      "id": 142,
      "start": 3366.939971923828,
      "end": 3368.3799743652344,
      "text": " I don't preach the same message on Wednesday"
    },
    {
      "id": 143,
      "start": 3368.3799743652344,
      "end": 3369.219970703125,
      "text": " that I preached on Sunday."
    },
    {
      "id": 144,
      "start": 3369.219970703125,
      "end": 3370.939971923828,
      "text": " It's an entirely different message."
    },
    {
      "id": 145,
      "start": 3371.759979248047,
      "end": 3374.8399658203125,
      "text": " So that we can get the truth of God's word"
    },
    {
      "id": 146,
      "start": 3374.8399658203125,
      "end": 3376.8599853515625,
      "text": " into the hearts of God's people."
    },
    {
      "id": 147,
      "start": 3377.719970703125,
      "end": 3380.1199951171875,
      "text": " So that we can be strengthened and prepared"
    },
    {
      "id": 148,
      "start": 3380.1199951171875,
      "end": 3382.239990234375,
      "text": " for the attack of the enemy."
    },
    {
      "id": 149,
      "start": 3382.239990234375,
      "end": 3383.0799865722656,
      "text": " Amen, let's pray."
    },
    {
      "id": 150,
      "start": 3383.0799865722656,
      "end": 3383.959991455078,
      "text": " Father, we love you."
    },
    {
      "id": 151,
      "start": 3384.8799743652344,
      "end": 3386.3399658203125,
      "text": " We thank you for loving us."
    },
    {
      "id": 152,
      "start": 3387.47998046875,
      "end": 3388.7999877929688,
      "text": " Thank you for truth."
    },
    {
      "id": 153,
      "start": 3390.759979248047,
      "end": 3394.8999938964844,
      "text": " I pray, God, this morning that you would help us to stand."
    },
    {
      "id": 154,
      "start": 3395.8999938964844,
      "end": 3400.8999938964844,
      "text": " Help us to be spiritually growing, mature believers."
    },
    {
      "id": 155,
      "start": 3407.959991455078,
      "end": 3409.759979248047,
      "text": " That the false teacher that would seek"
    },
    {
      "id": 156,
      "start": 3409.759979248047,
      "end": 3412.5599670410156,
      "text": " to infiltrate this congregation"
    },
    {
      "id": 157,
      "start": 3413.999969482422,
      "end": 3418.6799926757812,
      "text": " would meet a group of people that are settled"
    },
    {
      "id": 158,
      "start": 3418.6799926757812,
      "end": 3420.7999877929688,
      "text": " and grounded on the truth."
    },
    {
      "id": 159,
      "start": 3420.7999877929688,
      "end": 3423.1599731445312,
      "text": " That know the word of God."
    },
    {
      "id": 160,
      "start": 3425.719970703125,
      "end": 3430.239990234375,
      "text": " We thank you for the Lord Jesus Christ."
    },
    {
      "id": 161,
      "start": 3431.199981689453,
      "end": 3433.219970703125,
      "text": " We thank you for the word of God."
    },
    {
      "id": 162,
      "start": 3434.47998046875,
      "end": 3437.0799865722656,
      "text": " I pray that if there's one that's not sure of heaven,"
    },
    {
      "id": 163,
      "start": 3438.719970703125,
      "end": 3442.8799743652344,
      "text": " maybe they've been influenced by some false teaching"
    },
    {
      "id": 164,
      "start": 3444.8599853515625,
      "end": 3449.199981689453,
      "text": " that would deny the person of Jesus Christ as being God."
    },
    {
      "id": 165,
      "start": 3449.199981689453,
      "end": 3451.8999938964844,
      "text": " Perhaps they would deny the teaching"
    },
    {
      "id": 166,
      "start": 3451.8999938964844,
      "end": 3456.0799865722656,
      "text": " that thy word is sufficient and it's all we need."
    },
    {
      "id": 167,
      "start": 3456.0799865722656,
      "end": 3458.1599731445312,
      "text": " We're not looking for any new revelation,"
    },
    {
      "id": 168,
      "start": 3458.1599731445312,
      "end": 3459.6799926757812,
      "text": " any more revelation."
    },
    {
      "id": 169,
      "start": 3461.8799743652344,
      "end": 3463.2799682617188,
      "text": " Perhaps they've been influenced"
    },
    {
      "id": 170,
      "start": 3463.2799682617188,
      "end": 3465.699981689453,
      "text": " by some other form of false teaching."
    },
    {
      "id": 171,
      "start": 3468.1399841308594,
      "end": 3469.499969482422,
      "text": " They've never trusted Christ."
    },
    {
      "id": 172,
      "start": 3469.499969482422,
      "end": 3472.719970703125,
      "text": " I pray that today would be the day of their salvation."
    },
    {
      "id": 173,
      "start": 3472.719970703125,
      "end": 3475.1799926757812,
      "text": " They'd understand that Jesus Christ is God."
    },
    {
      "id": 174,
      "start": 3477.3599853515625,
      "end": 3480.9199829101562,
      "text": " He came to this world at the appointed time"
    },
    {
      "id": 175,
      "start": 3480.939971923828,
      "end": 3482.4199829101562,
      "text": " when the fullness of time was come."
    },
    {
      "id": 176,
      "start": 3482.4199829101562,
      "end": 3483.939971923828,
      "text": " God sent forth His Son."
    },
    {
      "id": 177,
      "start": 3486.1799926757812,
      "end": 3489.6599731445312,
      "text": " He was born of a virgin, lived a perfect and sinless life,"
    },
    {
      "id": 178,
      "start": 3489.6599731445312,
      "end": 3492.499969482422,
      "text": " bled and died to be our substitute,"
    },
    {
      "id": 179,
      "start": 3493.4199829101562,
      "end": 3496.959991455078,
      "text": " buried and rose in victory,"
    },
    {
      "id": 180,
      "start": 3496.959991455078,
      "end": 3498.8599853515625,
      "text": " conquering sin, death, and the grave."
    },
    {
      "id": 181,
      "start": 3500.1799926757812,
      "end": 3501.6599731445312,
      "text": " He's the Savior of the world."
    },
    {
      "id": 182,
      "start": 3503.3599853515625,
      "end": 3505.459991455078,
      "text": " I pray that this morning,"
    },
    {
      "id": 183,
      "start": 3505.459991455078,
      "end": 3507.8599853515625,
      "text": " that individual that may not know you"
    },
    {
      "id": 184,
      "start": 3507.8599853515625,
      "end": 3510.8599853515625,
      "text": " would trust Christ today."
    },
    {
      "id": 185,
      "start": 3512.0399780273438,
      "end": 3515.1199951171875,
      "text": " For each believer, Lord, help us to grow."
    },
    {
      "id": 186,
      "start": 3515.1199951171875,
      "end": 3517.239990234375,
      "text": " Help us to not get comfortable."
    },
    {
      "id": 187,
      "start": 3518.1599731445312,
      "end": 3520.0,
      "text": " Help us to not get stagnant,"
    },
    {
      "id": 188,
      "start": 3521.0799560546875,
      "end": 3524.0199584960938,
      "text": " self-sufficient, self-dependent."
    },
    {
      "id": 189,
      "start": 3524.0199584960938,
      "end": 3525.8800048828125,
      "text": " Help us, God, to be eager,"
    },
    {
      "id": 190,
      "start": 3527.9599609375,
      "end": 3531.0399780273438,
      "text": " to hunger and thirst for the word of God,"
    },
    {
      "id": 191,
      "start": 3532.7999877929688,
      "end": 3534.719970703125,
      "text": " to know you, as Paul said."
    },
    {
      "id": 192,
      "start": 3535.5999755859375,
      "end": 3537.5999755859375,
      "text": " I pray that you'd move and work as only you can."
    },
    {
      "id": 193,
      "start": 3538.1199951171875,
      "end": 3540.3200073242188,
      "text": " That's why we do these efforts in Christ's name we pray."
    },
    {
      "id": 194,
      "start": 3540.3200073242188,
      "end": 3541.3800048828125,
      "text": " Would you stand with me?"
    },
    {
      "id": 195,
      "start": 3541.3800048828125,
      "end": 3543.239990234375,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 196,
      "start": 3543.239990234375,
      "end": 3545.739990234375,
      "text": " Kimberly's gonna play quietly on the piano."
    },
    {
      "id": 197,
      "start": 3545.739990234375,
      "end": 3548.8200073242188,
      "text": " Perhaps you need to come and ask the Lord to help you."
    },
    {
      "id": 198,
      "start": 3548.8200073242188,
      "end": 3550.260009765625,
      "text": " Perhaps there's some that would come"
    },
    {
      "id": 199,
      "start": 3550.260009765625,
      "end": 3553.0199584960938,
      "text": " and pray for our church as a whole."
    },
    {
      "id": 200,
      "start": 3553.0199584960938,
      "end": 3556.3800048828125,
      "text": " God would protect us and strengthen us."
    },
    {
      "id": 201,
      "start": 3556.3800048828125,
      "end": 3559.8999633789062,
      "text": " Need some men to come and pray for our congregation."
    },
    {
      "id": 202,
      "start": 3559.8999633789062,
      "end": 3561.8599853515625,
      "text": " The enemy's active."
    },
    {
      "id": 203,
      "start": 3561.8599853515625,
      "end": 3564.7799682617188,
      "text": " As Kimberly plays, would you allow the Holy Spirit of God"
    },
    {
      "id": 204,
      "start": 3564.7799682617188,
      "end": 3566.239990234375,
      "text": " to have His way in your life?"
    }
  ],
  "processed_at": "2025-04-17T08:16:20.090658"
}