{
  "video_id": "jIT6eZVTo_c",
  "text": "Wednesday evening as well, and I'll be looking at a passage of Scripture here in Leviticus chapter number 25. And I do trust that the study in the Word of God this evening will be an encouragement to you. I also pray that God would use it to challenge us in our walk with Him, and I'm so thankful the Word of God tells us that all Scripture is given by inspiration of God and is profitable. And what a blessing to know that the Word of God helps us, and it gives us encouragement when we need encouragement, it comforts our hearts when we're troubled, it gives us challenge and conviction, and what a blessing to have the Bible. And I know that for many of us this evening, as soon as I say take your Bible and turn the book of Leviticus, you have a Bible with you. And what a great privilege that is for us to have the Word of God. There are many people groups around the world today that do not have a Bible, and I'm so thankful for the Word of God. Leviticus chapter 25, I'll read a few verses of Scripture, and then we'll get into the message this evening, beginning in verse number 1 of Leviticus 25. The Bible says this, And the Lord spake unto Moses in Mount Sinai, saying, Speak unto the children of Israel, and say unto them, When ye come into the land which I give you, then shall the land keep a sabbath unto the Lord. We'll read down through verse number 7 as we study this evening, but we'll also be looking at verses 18 through 22, and I want to draw your attention to verse number 20. The Bible says this, And if ye shall say, What shall we eat the seventh year? Behold, we shall not sow nor gather in our increase. I'd like to preach a message this evening that I've simply entitled from verse number 20, What shall we eat the seventh year? What shall we eat the seventh year? As you study the Word of God, it will not take you long to recognize that there is an emphasis within God's Word placed upon faith and obedience. We understand that our God has given us valuable instruction. He's given us a perfect, precious book that we hold dear, and contained within this book, the pages of this book, are instructions for our daily living. It is in our best interest to take heed to what thus saith the Lord. We understand that He has provided great detail, not only in the Old Testament, even as we'll look here this evening, with regard to some things for the children of Israel, but for the people of God as we begin to look at principles and study commands that are given to us in the New Testament as the church. We understand this evening that God has given us His Word, and He's placed a premium upon obedience. We understand that Moses would say, obviously, the Lord is speaking to the children of Israel, but in the book of Deuteronomy, as God would use Moses to pen that book, the Bible says that I lay before you today a blessing and a curse, a blessing if you obey, a curse if you disobey. And so we find that God has placed a premium on obedience. But we also find that as we study the Word of God, that we as God's people are to live by faith. We're to live by faith. And we understand that that statement is used repeatedly throughout the Word of God. We find it in the Old Testament, the book of Habakkuk. We find it in the book of Romans, the book of Galatians, and then also in the book of Hebrews, where God says that we are to live by faith. We understand that the writer of Hebrews says in Hebrews 11 and verse number 6 that without faith it is impossible to please Him, to please God, for he that cometh to God must believe that he is and a rewarder of them that diligently seek him. So we find that this subject matter of faith is of serious importance. And we understand that as God is speaking to Moses in the book of Numbers in chapter 14 and verse number 11, if you want the reference, but God is speaking to Moses and that passage of Scripture is dealing with the return of the spies. Do you remember the 12 spies were sent out and they're returning? And of course the 10 bring an evil report. The people don't obey the Lord. They don't have any faith in God giving them the land. And God says this to Moses. He says, how long will it be ere they believe me? For all the signs which I have showed among them. How long will it be ere they believe me? God wants his people to believe him. He wants his people to live by faith. Listen, our God is trustworthy. He is dependable. Great is thy faithfulness. And we understand that our God is faithful, that all of his, he's given us so many promises and Peter refers to them as being exceeding great and precious promises. And we find that all that God has promised he is able to fulfill. Amen? And as we look at this passage of Scripture here in Leviticus chapter number 25, we obviously understand that the specifics of this chapter were given to the children of Israel in preparation for their entrance into the land. However, as the emphasis in this passage I believe would be upon faith and obedience as we've been discussing by way of introduction, I believe that these are principles that remain applicable in our lives today. And as we look at this Old Testament example and we understand some of what God was giving his people, we understand for us this evening that there is still a need for us to obey God and to live by faith, to trust him, to trust him. Notice what the Scriptures say if you're taking notes in verses 1-7 of Leviticus 25, I want you to consider the plan of God. Now you understand that God's plan is not always your plan. Amen? God has given a plan for the children of Israel in preparation for entrance into the land, and his plan is the way it's supposed to work. Amen? His plan doesn't need to be improved upon. His plan doesn't need to be upgraded or updated. No, his plan is his plan, and he is the eternal God, and he has given a plan, and in this plan, in these first seven verses, as we dig in, we will find that there is for the children of Israel this aspect of faith and obedience is quite obvious. What's in light here, what we're dealing with is obviously the instruction concerning the Sabbath year. Notice with me again in verse number 2, God is speaking in verse number 1, he's speaking to Moses and says, say this to the children of Israel, and notice in verse number 2, speak unto the children of Israel and say unto them, when ye come into the land which I give you. Don't you like how that's phrased? This wasn't a question of if you're going to come into the land, but when you come into the land that I give you. God had made that promise all the way back to Abraham, and he had repeated that promise many times through the patriarchs, and he says here that when ye come into the land which I give you, then shall the land keep a Sabbath unto the Lord. Now notice in verse number 3, six years thou shalt sow thy field, and six years thou shalt prune thy vineyard, and gather in the fruit thereof. As we begin to look at the plan of God, we find that God will give specific instruction with regard to his plan for his people with regard to the land. During these first six years, as you would look at a calendar of time, if you will, they had the responsibility of cultivating the land, planting, sowing the seed, and then reaping a harvest. And we find that God gives them the instruction of gathering the fruit thereof in verse number 3 during that six year period of time, but then you find in verse number 4 that he says, In the seventh year shall be a Sabbath of rest unto the land, a Sabbath for the Lord. Thou shalt neither sow thy field, nor prune thy vineyard. That which groweth of its own accord of thy harvest thou shalt not reap, neither gather the grapes of thy vine undressed, for it is a year of rest unto the land. And the Sabbath of the land shall be meet for you, for thee, and for thy servant, and for thy maid, and for thy hired servant, and for thy stranger that sojourneth with thee. And for thy cattle and for the beasts that are in thy land shall all the increase thereof be meet. As you begin to look at this plan that God is revealing to his people, and you find that here God is giving them this instruction with regard to for six years, here's what you do. But on the seventh year, things are going to change. It's very similar to what you see with the manna, with the gathering of the manna, remember? God had promised that he would give them bread from heaven, and he gave specific instruction that for six days you go out and you gather, and you gather a certain amount, and you better be careful though not to store any up, because if you do and you leave it until morning it's going to stink and it's going to breed worms, and so there was specific instruction that was given. But even in that, on day number six, what were they supposed to do? Well, they were supposed to gather twice as much on day number six. But on day number four, if they gathered twice as much, it's going to stink and breed worms. But on day number six, if they gathered twice as much, in obedience to God and by faith in what God has said, it didn't spoil. It didn't stink. it didn't breed worms and there were some people on day number seven maybe some of those same guys that gathered twice as much on day two or three and said I don't like that stench and I don't like those worms and so on day number seven they went out looking to gather some manna what happened there's no manna because God says I'm gonna come on day seven you know for 40 years they had manna in that fashion it's building their faith and now when we come to this instruction with regard to the Sabbath year for six years you're going to take care of your land you're gonna cultivate it you're gonna sow the seed you're going to to reap the harvest but in year number seven it's a it's a year of rest for the land for the animals and for you and for the servants now you can go a day without eating right if you fail to obey the instruction with regard to the the manna in a in a week and you just mess it all up and you can go a day without eating I don't think you can go a year without eating I know some people that have fasted for a week or a couple of weeks and in the New Testament speaks about Jesus for 40 days in the wilderness but 365 days without eating that's a long time you're not you're gonna die but this is the plan that God gave in that seventh year it's a year of rest now when you think about that you consider the plan I I believe this evening and I don't want to get into it but this plan certainly had a purpose agriculturally there were benefits and so on and so forth agriculturally for the land and all of that but I believe that the most significant purpose was in proving or in developing his people and giving them this instruction and saying are you gonna obey me are you going to have faith that I am able and so we consider the plan and as I look at the plan in these first seven verses and then in verse number eight it goes into the year of Jubilee and the 50th year and I don't intend in any way shape or form to to skim over those verses to to give you the impression that they're not important because they are but sticking within this seventh year this year of rest we'll skip down to verse number 18 and kind of follow in with the the dialogue if you will with regard to this seventh year this Sabbath year and notice in verse number 18 the Bible says wherefore you shall do my statutes and keep my judgments and do them and you shall dwell in the land and safety and the land shall yield her fruit and you shall eat your fill and dwell there and in safety now look in verse number 20 our God is so gracious he really is in verse number 20 God in his omniscience he says in verse number 20 and if you shall say what shall we eat the seventh year now God knows us he made us he knows that we're but dust he knows our frame and by the way I probably would have been one of those people saying what are we gonna eat in the seventh year and if you'd be honest maybe you would be too it's a valid question is it not and here's the beautiful thing about the Word of God and the the grace of our God and just the the way in which he's given us his word and he's provided us with all that we need the Bible says that as far as New Testament believers are concerned we look in the New Testament that he has given us all things that pertain unto life and godliness he has given us everything that we need we are seated in the heavenlies and we find here that God says that if ye shall say what shall we eat the seventh year behold we shall not sow nor gather in our increase and if you're a analytical kind of a person as I would be I would look at that in that fashion I'd say okay so we're not supposed to sow we're not supposed to gather for an entire year what are we gonna do what are we gonna do and we consider the plan of God but then we note if you're taking notes number two consider the promise of God now this is an amazing truth as I look at this passage of scripture and I begin to just meditate upon the truth of the Word of God the reality is that God does not owe us an explanation amen he really doesn't he could simply say listen for six years this is what you do on the seventh year this is what you do period end of story obey me he's God but God knows our frame he knows that we're but dust and here in this passage of scripture he's going to give the children of Israel a promise that is amazing in verse number 21 I love just the verbiage in verse 21 it says then I will command my blessing upon you in the sixth year now can you can you get your mind around that statement we'll read the rest of the verse in just a moment but get your mind around the statement that God is making that he the Lord God omnipotent Jehovah is going to command his blessing upon you in the sixth year the God that spoke everything into existence the God who said let there be light and there was light the God who as the record is given to us in Genesis said and he made the stars also but they're beyond our ability to even come close to numbering the God that created all things the God who is the the Redeemer of mankind he says that he will command his blessing upon you that's encouraging I mean when you begin to to look at this and you begin to think about the fact of okay we're gonna do this for six years and then this what we're supposed to do in the seventh year and you're thinking to yourself we're not supposed to so we're not supposed to gather so what is it that we're going to eat and God says I will command my blessing upon you I will command my blessing upon you and my mind's eye and my sanctified imagination I begin to think about the Lord God Almighty and how he would command you know nature obeys God the only thing in God's creation that does not automatically obey him is mankind aren't you thankful that the whale obeyed God I know Jonah was amen after right God told the whale to spew him out I'm pretty sure that Jonah was happy that that whale obeyed better than he did right because how did Jonah obey he didn't do so good in Jonah chapter number one right he went the opposite way he paid the fare to get away from doing what God had caught him to do but when God spoke to that whale it obeyed when God says he's gonna command his blessing in the fashion in the manner in which he says he's going to command it you can rest assured that it's going to happen and the Bible says here here's what he's gonna do I'm gonna command my blessing upon you in the sixth year it's a promise of provision the details are provided the Bible says this and it shall bring forth fruit for three years it shall he didn't say it might he said it shall it shall bring forth fruit for three years now what does that mean well he gives further detail in verse number 22 to how this is going to work and ye shall sow the eighth year and eat yet of old fruit until the ninth year until her fruits come in ye shall eat of the old store so in the sixth year God says he's going to command his blessing upon them and the land would bring forth fruit for three years so they would eat that fruit in year number six and year number seven and year number eight and year number seven they're not sowing they're not cultivating they're not reaping but in year number eight they now can plant again they can they can sow the seed again in year number eight but as you know when you plant the seed you don't reap a harvest immediately there's a period of time that must take place and so God says I'm going to give you three years worth so that in that eighth year when you're able to start cultivating and planting but it's not producing yet you still have sustenance and then as that crop begins to come in then that which I commanded my blessing will go away now think about that this is powerful truth that God is giving again yes there's some agricultural impacts and certainly as God the Creator he understood what those benefits would be to the land but you see how God is proving his people how he's seeking to develop his people that for six years you're going to do this but in the seventh year you're not going to do anything because here's what I'm going to do as we think about this passage of scripture When we think about those two statements that I made in the beginning by way of introduction, that the emphasis throughout the Word of God that is placed upon those two themes or those two topics, one of obedience and another of faith. Do you not see it in the passage of Scripture? It would require obedience to the plan of God in the first seven verses, but that obedience requires faith that God's going to do what God said He's going to do. Sometimes, we struggle in the area of our faith. Is God really going to do what God said He was going to do? Do we really have faith to live by faith? Jesus said multiple times and I actually preached some messages on this last year, there were times during His earthly ministry when He said, how is it that you have no faith? Right? And then there were other times where He said, I found so great faith in all of Israel. You know what the Bible says about the return of Christ? The Son of Man find faith. The reality is that we're to live by faith. We're to trust God, believe Him. Now, as we keep in mind this passage of Scripture, the context of the Scripture, and of course, understanding the truth for the children of Israel for preparation as they would enter the land, I want you to consider that during the wilderness wanderings, during that period of time in which they were going through after their disobedience, you understand that at this point, they had not yet sent the spies. That whole thing of the disobedience has not taken place yet and they're going to wander and God is going to provide food for them for that entire duration. And turn over to Joshua 5, if you will. And I want you to notice what the Word of God says in Joshua 5. Of course, that generation that did not believe God, they died and Joshua and Caleb are going to enter the land. Of course, Joshua will be the human leader of the nation of Israel. And in Joshua 5, the Bible gives us the record of when that manna would cease to produce. And I want you to see what God did. Now, as you understand the wilderness wanderings and you understand as you would trace the steps of the wilderness wanderings, that they just wandered around. I mean, it almost, if you were to draw it all out on a map, they're crisscrossing and they're all over the place. When is it that they left? Well, remember when that pillar of cloud that was by day and the pillar of fire that was by night on the tabernacle, when it would remove, what'd they do? They would move and they would follow it. So they didn't have any time to be planting and cultivating and reaping a harvest. They were constantly moving. And so God gave them manna. When they get into the land, the Bible tells us in verse number 10 of Joshua 5, the children of Israel encamped in Gilgal and kept the Passover on the 14th day of the month at even in the plains of Jericho. And they did eat of the old corn of the land on the morrow after the Passover, unleavened cakes and parts corn in the self same day. Notice this, the manna ceased on the morrow after they had eaten of the old corn of the land. Neither had the children of Israel manna anymore, but they did eat of the fruit of the land of Canaan that year. God provided for them. God took care. Listen, does God know what we need? Absolutely. You know, Matthew 6 says, turn over there very quickly, if you would, Matthew chapter number six. And you look in this passage and you find great promises and great truth that would encourage the people of God. But think of this one statement in verse number eight of Matthew chapter number six. The Bible says this, be not ye therefore like unto them. He's speaking about those Pharisees and those religious leaders that were praying as hypocrites and using vain repetition and so on and so forth. He says this, for your father knoweth what things you have need of before you ask him. Isn't that encouraging? Isn't it comforting? Juliana told me this afternoon, she said, daddy, I have a question for you. And before she could get two words of her question out, I gave her the answer. And she says, how did you know what I was gonna ask? Well, it's not because I'm omniscient. I just knew some things that were going on. But the reality is that our heavenly father is omniscient. He knows everything. He knows what we need. He made us and in making us, he made us need food, right? The end of Matthew chapter number six, when it speaks about the food and the water and the rain and so on and so forth, he says, listen, God knows that you have need of these things. He's gonna provide them for you. The thing that's sad for me, and I won't focus upon it for the intent of the message this evening is really to encourage us to have faith in God and to obey His plan. Unfortunately, as you would study the history of Israel from all that we can gather, you would find that the children of Israel never consistently obeyed the instruction that we read in Leviticus 25. I find two sad results of that. Number one, they missed out on seeing God work. They missed out on seeing what God could do because they didn't obey and they didn't have faith. You know, when we lack faith in our lives, we miss out on seeing what God can do. Why did He not do many mighty works there? Because of their unbelief. Because of their unbelief, their lack of faith. That's what the Bible says of Jesus during His earthly ministry. He did not many mighty works there. Why? Because of their unbelief. I don't wanna miss out on what God is able to do in my life. I wanna have faith in what God said that He is going to do because our God is able. Not only did they miss out on seeing what God was able to do but the reality is they face judgment for their disobedience. In obedience, we get to see what God is able to do. In disobedience, not only do we miss out on seeing what God's gonna do but then we have to face judgment. And a couple of passages later in Leviticus chapter number 26, we are in 25, it's a lengthy passage but in Leviticus 26 in verses 33 and 34, I want you to see what God says and really if you look at all of the chapter 26, you'll see just the obedience. If you walk in my statutes and keep them, then here's what I'm going to do. If you don't hearken unto me, then here's what's going to happen. If then kind of statements, if you will. And if you look in verse 33 of Leviticus 26, the Bible says this, and I will scatter you among the heathen and will draw out a sword after you and your land shall be desolate and your cities waste. Then shall the land enjoy her Sabbaths as long as it lieth desolate and ye be in your enemy's land. Even then shall the land rest and enjoy her Sabbaths. That's exactly what happened during the Babylonian captivity. It was 70 years because of a lack of obedience to this particular instruction that we're reading of in Leviticus 25. If you look over at 2 Chronicles 36, notice, and we'll finish up here in just a few moments, but I want you to notice what the Bible says in 2 Chronicles 36 and verse 21. Remember, God gave them the instruction, the emphasis upon faith and obedience. We do not see anywhere historically where they consistently obeyed the Lord with regard to this instruction. God said, if you disobey, here's what's gonna happen because my land will get its Sabbaths. In 2 Chronicles 36 and verse number 21, the Bible says to fulfill the word of the Lord by the mouth of Jeremiah until the land had enjoyed her Sabbaths. For as long as she lay desolate, she kept Sabbath to fulfill threescore and 10 years. We know that a remnant would return. This evening, I understand we're not the children of Israel and we're not entering into a land. I understand that we're not planting and reaping for six years and then letting it sit for a rest for a seventh year. I understand that. But there are principles in the word of God with regard to God's instruction, God's commandments for us as the people of God. The question that I would ask is, how are we doing in the area of obedience? In the area of faith? If we were to be alive during this time, during the time of the Exodus, this great host of people that left the land of Egypt and saw the mighty hand of God, would we have asked, as we use for our title this evening, what shall we eat the seventh year? Perhaps we would. But when we receive that promise of God, would we embrace that promise? Would we have faith and believe that God is able to do? See, our God is able to provide water from a rock. Amen? He's able to bring meat by a raven. Right? He's able. And as we begin to think about our lives and the instruction of the word of God, oh, that we would just determine that we're going to obey him. faith that God is able to do what he's promised to do. He's gonna take care of us because he's a good God. He's promised to do so. All of his promises are yay. Amen? There's times, no doubt in your life, that you made a promise to someone. Anyone ever make a promise to someone and then you couldn't fulfill it? I learned my lesson when Juliana was about two years old as a parent. I was working and I told her, I know I've told the story before, I told her that on Saturday we would go to the park and do X Y & Z and blah blah blah and so on and so forth. She had been wanting to do it and it was kind of that time of year where it gets dark early. You know when you go to work it's dark, when you come home it's dark. That kind of almost what we're looking at right now. And I told her on Saturday we'll do these things. And on Saturday it just poured and poured and poured. It was just a terrible day. We couldn't go to the park. But I had told Juliana I promise on Saturday we'll do it. And as a two, two and a half year old girl she just said, but daddy you promised. I don't have any control over the weather though. I mean like I can't I can't make it stop raining. But I learned a lesson then not to say I promise to do things that I can't make good on that promise. But you understand that when God has promised to do something, he's able. He is able. We say as we look to this night, obviously Wednesday night's our prayer time. We think about our prayer time here in just a moment. He is able to do exceeding abundantly above all that we ask or think. Ephesians 3 and verse number 20. That's our God. We just need to trust him and obey him. We sing the song trust and obey. There's no other way to be happy in Jesus but to trust and obey. Let's pray. Father we love you. We thank you for loving us. We thank you for the opportunity to study your Word. This Old Testament passage has specifics with regard to their preparation for entering the land. But the principles of faith and obedience are so clear in this passage. I pray God that you would help us to obey you, to trust you, to have faith in what only you could do. We thank you for the many promises that you've given us in your Word. We pray God that you'd bless our time of prayer. We pray that you would encourage us and strengthen us and we'll thank you for it. In Christ's name we pray. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.559999942779541,
      "text": " Wednesday evening as well, and I'll be looking at a passage of Scripture here in Leviticus"
    },
    {
      "id": 1,
      "start": 4.559999942779541,
      "end": 6.440000057220459,
      "text": " chapter number 25."
    },
    {
      "id": 2,
      "start": 6.440000057220459,
      "end": 10.84000015258789,
      "text": " And I do trust that the study in the Word of God this evening will be an encouragement"
    },
    {
      "id": 3,
      "start": 10.84000015258789,
      "end": 11.84000015258789,
      "text": " to you."
    },
    {
      "id": 4,
      "start": 11.84000015258789,
      "end": 17.559999465942383,
      "text": " I also pray that God would use it to challenge us in our walk with Him, and I'm so thankful"
    },
    {
      "id": 5,
      "start": 17.559999465942383,
      "end": 24.360000610351562,
      "text": " the Word of God tells us that all Scripture is given by inspiration of God and is profitable."
    },
    {
      "id": 6,
      "start": 24.360000610351562,
      "end": 30.280000686645508,
      "text": " And what a blessing to know that the Word of God helps us, and it gives us encouragement"
    },
    {
      "id": 7,
      "start": 30.280000686645508,
      "end": 34.599998474121094,
      "text": " when we need encouragement, it comforts our hearts when we're troubled, it gives us challenge"
    },
    {
      "id": 8,
      "start": 34.599998474121094,
      "end": 39.119998931884766,
      "text": " and conviction, and what a blessing to have the Bible."
    },
    {
      "id": 9,
      "start": 39.119998931884766,
      "end": 43.7599983215332,
      "text": " And I know that for many of us this evening, as soon as I say take your Bible and turn"
    },
    {
      "id": 10,
      "start": 43.7599983215332,
      "end": 46.720001220703125,
      "text": " the book of Leviticus, you have a Bible with you."
    },
    {
      "id": 11,
      "start": 46.720001220703125,
      "end": 51.7599983215332,
      "text": " And what a great privilege that is for us to have the Word of God."
    },
    {
      "id": 12,
      "start": 51.7599983215332,
      "end": 56.439998626708984,
      "text": " There are many people groups around the world today that do not have a Bible, and I'm so"
    },
    {
      "id": 13,
      "start": 56.439998626708984,
      "end": 57.91999816894531,
      "text": " thankful for the Word of God."
    },
    {
      "id": 14,
      "start": 57.91999816894531,
      "end": 62.08000183105469,
      "text": " Leviticus chapter 25, I'll read a few verses of Scripture, and then we'll get into the"
    },
    {
      "id": 15,
      "start": 62.08000183105469,
      "end": 66.23999786376953,
      "text": " message this evening, beginning in verse number 1 of Leviticus 25."
    },
    {
      "id": 16,
      "start": 66.23999786376953,
      "end": 67.23999786376953,
      "text": " The Bible says this,"
    },
    {
      "id": 17,
      "start": 67.23999786376953,
      "end": 75.04000091552734,
      "text": " And the Lord spake unto Moses in Mount Sinai, saying, Speak unto the children of Israel,"
    },
    {
      "id": 18,
      "start": 75.04000091552734,
      "end": 81.04000091552734,
      "text": " and say unto them, When ye come into the land which I give you, then shall the land keep"
    },
    {
      "id": 19,
      "start": 81.04000091552734,
      "end": 83.91999816894531,
      "text": " a sabbath unto the Lord."
    },
    {
      "id": 20,
      "start": 83.91999816894531,
      "end": 87.31999969482422,
      "text": " We'll read down through verse number 7 as we study this evening, but we'll also be looking"
    },
    {
      "id": 21,
      "start": 87.31999969482422,
      "end": 91.27999877929688,
      "text": " at verses 18 through 22, and I want to draw your attention to verse number 20."
    },
    {
      "id": 22,
      "start": 91.27999877929688,
      "end": 92.91999816894531,
      "text": " The Bible says this,"
    },
    {
      "id": 23,
      "start": 92.91999816894531,
      "end": 97.44000244140625,
      "text": " And if ye shall say, What shall we eat the seventh year?"
    },
    {
      "id": 24,
      "start": 97.44000244140625,
      "end": 101.91999816894531,
      "text": " Behold, we shall not sow nor gather in our increase."
    },
    {
      "id": 25,
      "start": 101.91999816894531,
      "end": 105.72000122070312,
      "text": " I'd like to preach a message this evening that I've simply entitled from verse number"
    },
    {
      "id": 26,
      "start": 105.72000122070312,
      "end": 109.68000030517578,
      "text": " 20, What shall we eat the seventh year?"
    },
    {
      "id": 27,
      "start": 109.68000030517578,
      "end": 112.22000122070312,
      "text": " What shall we eat the seventh year?"
    },
    {
      "id": 28,
      "start": 112.22000122070312,
      "end": 116.95999908447266,
      "text": " As you study the Word of God, it will not take you long to recognize that there is an"
    },
    {
      "id": 29,
      "start": 116.95999908447266,
      "end": 121.87999725341797,
      "text": " emphasis within God's Word placed upon faith and obedience."
    },
    {
      "id": 30,
      "start": 121.87999725341797,
      "end": 125.0,
      "text": " We understand that our God has given us valuable instruction."
    },
    {
      "id": 31,
      "start": 125.0,
      "end": 132.0800018310547,
      "text": " He's given us a perfect, precious book that we hold dear, and contained within this book,"
    },
    {
      "id": 32,
      "start": 132.0800018310547,
      "end": 136.0,
      "text": " the pages of this book, are instructions for our daily living."
    },
    {
      "id": 33,
      "start": 136.32000732421875,
      "end": 140.63999938964844,
      "text": " It is in our best interest to take heed to what thus saith the Lord."
    },
    {
      "id": 34,
      "start": 140.63999938964844,
      "end": 146.24000549316406,
      "text": " We understand that He has provided great detail, not only in the Old Testament, even as we'll"
    },
    {
      "id": 35,
      "start": 146.24000549316406,
      "end": 150.0,
      "text": " look here this evening, with regard to some things for the children of Israel, but for"
    },
    {
      "id": 36,
      "start": 150.0,
      "end": 155.63999938964844,
      "text": " the people of God as we begin to look at principles and study commands that are given to us in"
    },
    {
      "id": 37,
      "start": 155.63999938964844,
      "end": 158.24000549316406,
      "text": " the New Testament as the church."
    },
    {
      "id": 38,
      "start": 158.24000549316406,
      "end": 164.39999389648438,
      "text": " We understand this evening that God has given us His Word, and He's placed a premium upon"
    },
    {
      "id": 39,
      "start": 164.39999389648438,
      "end": 165.8000030517578,
      "text": " obedience."
    },
    {
      "id": 40,
      "start": 165.8000030517578,
      "end": 172.0800018310547,
      "text": " We understand that Moses would say, obviously, the Lord is speaking to the children of Israel,"
    },
    {
      "id": 41,
      "start": 172.0800018310547,
      "end": 176.24000549316406,
      "text": " but in the book of Deuteronomy, as God would use Moses to pen that book, the Bible says"
    },
    {
      "id": 42,
      "start": 176.24000549316406,
      "end": 183.16000366210938,
      "text": " that I lay before you today a blessing and a curse, a blessing if you obey, a curse if"
    },
    {
      "id": 43,
      "start": 183.16000366210938,
      "end": 184.16000366210938,
      "text": " you disobey."
    },
    {
      "id": 44,
      "start": 184.16000366210938,
      "end": 188.36000061035156,
      "text": " And so we find that God has placed a premium on obedience."
    },
    {
      "id": 45,
      "start": 188.36000061035156,
      "end": 194.36000061035156,
      "text": " But we also find that as we study the Word of God, that we as God's people are to live"
    },
    {
      "id": 46,
      "start": 194.36000061035156,
      "end": 195.36000061035156,
      "text": " by faith."
    },
    {
      "id": 47,
      "start": 195.9199981689453,
      "end": 197.55999755859375,
      "text": " We're to live by faith."
    },
    {
      "id": 48,
      "start": 197.55999755859375,
      "end": 202.47999572753906,
      "text": " And we understand that that statement is used repeatedly throughout the Word of God."
    },
    {
      "id": 49,
      "start": 202.47999572753906,
      "end": 204.63999938964844,
      "text": " We find it in the Old Testament, the book of Habakkuk."
    },
    {
      "id": 50,
      "start": 204.63999938964844,
      "end": 208.36000061035156,
      "text": " We find it in the book of Romans, the book of Galatians, and then also in the book of"
    },
    {
      "id": 51,
      "start": 208.36000061035156,
      "end": 213.36000061035156,
      "text": " Hebrews, where God says that we are to live by faith."
    },
    {
      "id": 52,
      "start": 213.36000061035156,
      "end": 217.9600067138672,
      "text": " We understand that the writer of Hebrews says in Hebrews 11 and verse number 6 that without"
    },
    {
      "id": 53,
      "start": 217.9600067138672,
      "end": 224.0,
      "text": " faith it is impossible to please Him, to please God, for he that cometh to God must believe"
    },
    {
      "id": 54,
      "start": 224.0,
      "end": 228.52000427246094,
      "text": " that he is and a rewarder of them that diligently seek him."
    },
    {
      "id": 55,
      "start": 228.52000427246094,
      "end": 234.27999877929688,
      "text": " So we find that this subject matter of faith is of serious importance."
    },
    {
      "id": 56,
      "start": 234.27999877929688,
      "end": 240.8800048828125,
      "text": " And we understand that as God is speaking to Moses in the book of Numbers in chapter"
    },
    {
      "id": 57,
      "start": 240.8800048828125,
      "end": 247.1199951171875,
      "text": " 14 and verse number 11, if you want the reference, but God is speaking to Moses and that passage"
    },
    {
      "id": 58,
      "start": 247.1199951171875,
      "end": 250.9600067138672,
      "text": " of Scripture is dealing with the return of the spies."
    },
    {
      "id": 59,
      "start": 250.9600067138672,
      "end": 254.27999877929688,
      "text": " Do you remember the 12 spies were sent out and they're returning?"
    },
    {
      "id": 60,
      "start": 254.27999877929688,
      "end": 256.44000244140625,
      "text": " And of course the 10 bring an evil report."
    },
    {
      "id": 61,
      "start": 256.44000244140625,
      "end": 258.3999938964844,
      "text": " The people don't obey the Lord."
    },
    {
      "id": 62,
      "start": 258.3999938964844,
      "end": 261.67999267578125,
      "text": " They don't have any faith in God giving them the land."
    },
    {
      "id": 63,
      "start": 261.67999267578125,
      "end": 263.9200134277344,
      "text": " And God says this to Moses."
    },
    {
      "id": 64,
      "start": 263.9200134277344,
      "end": 269.7200012207031,
      "text": " He says, how long will it be ere they believe me?"
    },
    {
      "id": 65,
      "start": 269.7200012207031,
      "end": 273.9200134277344,
      "text": " For all the signs which I have showed among them."
    },
    {
      "id": 66,
      "start": 273.9200134277344,
      "end": 279.5199890136719,
      "text": " How long will it be ere they believe me?"
    },
    {
      "id": 67,
      "start": 279.5199890136719,
      "end": 281.67999267578125,
      "text": " God wants his people to believe him."
    },
    {
      "id": 68,
      "start": 281.67999267578125,
      "end": 283.5199890136719,
      "text": " He wants his people to live by faith."
    },
    {
      "id": 69,
      "start": 283.5199890136719,
      "end": 286.2799987792969,
      "text": " Listen, our God is trustworthy."
    },
    {
      "id": 70,
      "start": 286.2799987792969,
      "end": 288.2799987792969,
      "text": " He is dependable."
    },
    {
      "id": 71,
      "start": 288.2799987792969,
      "end": 290.79998779296875,
      "text": " Great is thy faithfulness."
    },
    {
      "id": 72,
      "start": 290.79998779296875,
      "end": 296.0400085449219,
      "text": " And we understand that our God is faithful, that all of his, he's given us so many promises"
    },
    {
      "id": 73,
      "start": 296.0400085449219,
      "end": 300.4800109863281,
      "text": " and Peter refers to them as being exceeding great and precious promises."
    },
    {
      "id": 74,
      "start": 300.4800109863281,
      "end": 304.9599914550781,
      "text": " And we find that all that God has promised he is able to fulfill."
    },
    {
      "id": 75,
      "start": 304.9599914550781,
      "end": 305.9599914550781,
      "text": " Amen?"
    },
    {
      "id": 76,
      "start": 306.3999938964844,
      "end": 311.55999755859375,
      "text": " And as we look at this passage of Scripture here in Leviticus chapter number 25, we obviously"
    },
    {
      "id": 77,
      "start": 311.55999755859375,
      "end": 319.239990234375,
      "text": " understand that the specifics of this chapter were given to the children of Israel in preparation"
    },
    {
      "id": 78,
      "start": 319.239990234375,
      "end": 321.7200012207031,
      "text": " for their entrance into the land."
    },
    {
      "id": 79,
      "start": 321.7200012207031,
      "end": 327.2799987792969,
      "text": " However, as the emphasis in this passage I believe would be upon faith and obedience"
    },
    {
      "id": 80,
      "start": 327.2799987792969,
      "end": 331.6000061035156,
      "text": " as we've been discussing by way of introduction, I believe that these are principles that remain"
    },
    {
      "id": 81,
      "start": 331.6000061035156,
      "end": 333.8399963378906,
      "text": " applicable in our lives today."
    },
    {
      "id": 82,
      "start": 333.8399963378906,
      "end": 339.0400085449219,
      "text": " And as we look at this Old Testament example and we understand some of what God was giving"
    },
    {
      "id": 83,
      "start": 339.0400085449219,
      "end": 345.5199890136719,
      "text": " his people, we understand for us this evening that there is still a need for us to obey"
    },
    {
      "id": 84,
      "start": 345.5199890136719,
      "end": 351.239990234375,
      "text": " God and to live by faith, to trust him, to trust him."
    },
    {
      "id": 85,
      "start": 351.239990234375,
      "end": 356.2799987792969,
      "text": " Notice what the Scriptures say if you're taking notes in verses 1-7 of Leviticus 25, I want"
    },
    {
      "id": 86,
      "start": 356.2799987792969,
      "end": 358.4599914550781,
      "text": " you to consider the plan of God."
    },
    {
      "id": 87,
      "start": 358.4599914550781,
      "end": 361.9200134277344,
      "text": " Now you understand that God's plan is not always your plan."
    },
    {
      "id": 88,
      "start": 361.9200134277344,
      "end": 363.239990234375,
      "text": " Amen?"
    },
    {
      "id": 89,
      "start": 363.239990234375,
      "end": 369.760009765625,
      "text": " God has given a plan for the children of Israel in preparation for entrance into the land,"
    },
    {
      "id": 90,
      "start": 369.760009765625,
      "end": 373.0799865722656,
      "text": " and his plan is the way it's supposed to work."
    },
    {
      "id": 91,
      "start": 373.0799865722656,
      "end": 374.0799865722656,
      "text": " Amen?"
    },
    {
      "id": 92,
      "start": 374.0799865722656,
      "end": 376.1600036621094,
      "text": " His plan doesn't need to be improved upon."
    },
    {
      "id": 93,
      "start": 376.1600036621094,
      "end": 378.8399963378906,
      "text": " His plan doesn't need to be upgraded or updated."
    },
    {
      "id": 94,
      "start": 378.8399963378906,
      "end": 386.1600036621094,
      "text": " No, his plan is his plan, and he is the eternal God, and he has given a plan, and in this"
    },
    {
      "id": 95,
      "start": 386.1600036621094,
      "end": 392.79998779296875,
      "text": " plan, in these first seven verses, as we dig in, we will find that there is for the children"
    },
    {
      "id": 96,
      "start": 393.3599853515625,
      "end": 398.6000061035156,
      "text": " of Israel this aspect of faith and obedience is quite obvious."
    },
    {
      "id": 97,
      "start": 398.6000061035156,
      "end": 402.8999938964844,
      "text": " What's in light here, what we're dealing with is obviously the instruction concerning the"
    },
    {
      "id": 98,
      "start": 402.8999938964844,
      "end": 404.44000244140625,
      "text": " Sabbath year."
    },
    {
      "id": 99,
      "start": 404.44000244140625,
      "end": 407.9200134277344,
      "text": " Notice with me again in verse number 2, God is speaking in verse number 1, he's speaking"
    },
    {
      "id": 100,
      "start": 407.9200134277344,
      "end": 413.1600036621094,
      "text": " to Moses and says, say this to the children of Israel, and notice in verse number 2, speak"
    },
    {
      "id": 101,
      "start": 413.1600036621094,
      "end": 419.760009765625,
      "text": " unto the children of Israel and say unto them, when ye come into the land which I give you."
    },
    {
      "id": 102,
      "start": 419.760009765625,
      "end": 421.9200134277344,
      "text": " Don't you like how that's phrased?"
    },
    {
      "id": 103,
      "start": 422.0400085449219,
      "end": 425.9200134277344,
      "text": " This wasn't a question of if you're going to come into the land, but when you come into"
    },
    {
      "id": 104,
      "start": 425.9200134277344,
      "end": 427.5199890136719,
      "text": " the land that I give you."
    },
    {
      "id": 105,
      "start": 427.5199890136719,
      "end": 432.8800048828125,
      "text": " God had made that promise all the way back to Abraham, and he had repeated that promise"
    },
    {
      "id": 106,
      "start": 432.8800048828125,
      "end": 438.8399963378906,
      "text": " many times through the patriarchs, and he says here that when ye come into the land"
    },
    {
      "id": 107,
      "start": 438.8399963378906,
      "end": 445.239990234375,
      "text": " which I give you, then shall the land keep a Sabbath unto the Lord."
    },
    {
      "id": 108,
      "start": 445.239990234375,
      "end": 452.239990234375,
      "text": " Now notice in verse number 3, six years thou shalt sow thy field, and six years thou shalt"
    },
    {
      "id": 109,
      "start": 452.239990234375,
      "end": 457.67999267578125,
      "text": " prune thy vineyard, and gather in the fruit thereof."
    },
    {
      "id": 110,
      "start": 457.67999267578125,
      "end": 463.760009765625,
      "text": " As we begin to look at the plan of God, we find that God will give specific instruction"
    },
    {
      "id": 111,
      "start": 463.760009765625,
      "end": 469.67999267578125,
      "text": " with regard to his plan for his people with regard to the land."
    },
    {
      "id": 112,
      "start": 469.67999267578125,
      "end": 475.2799987792969,
      "text": " During these first six years, as you would look at a calendar of time, if you will, they"
    },
    {
      "id": 113,
      "start": 475.2799987792969,
      "end": 482.0,
      "text": " had the responsibility of cultivating the land, planting, sowing the seed, and then"
    },
    {
      "id": 114,
      "start": 482.0,
      "end": 484.2799987792969,
      "text": " reaping a harvest."
    },
    {
      "id": 115,
      "start": 484.2799987792969,
      "end": 489.3999938964844,
      "text": " And we find that God gives them the instruction of gathering the fruit thereof in verse number"
    },
    {
      "id": 116,
      "start": 489.3999938964844,
      "end": 495.9200134277344,
      "text": " 3 during that six year period of time, but then you find in verse number 4 that he says,"
    },
    {
      "id": 117,
      "start": 496.67999267578125,
      "end": 505.0,
      "text": " In the seventh year shall be a Sabbath of rest unto the land, a Sabbath for the Lord."
    },
    {
      "id": 118,
      "start": 505.0,
      "end": 510.6000061035156,
      "text": " Thou shalt neither sow thy field, nor prune thy vineyard."
    },
    {
      "id": 119,
      "start": 510.6000061035156,
      "end": 515.3599853515625,
      "text": " That which groweth of its own accord of thy harvest thou shalt not reap, neither gather"
    },
    {
      "id": 120,
      "start": 515.3599853515625,
      "end": 520.760009765625,
      "text": " the grapes of thy vine undressed, for it is a year of rest unto the land."
    },
    {
      "id": 121,
      "start": 520.760009765625,
      "end": 525.0399780273438,
      "text": " And the Sabbath of the land shall be meet for you, for thee, and for thy servant, and"
    },
    {
      "id": 122,
      "start": 525.0399780273438,
      "end": 529.2000122070312,
      "text": " for thy maid, and for thy hired servant, and for thy stranger that sojourneth with"
    },
    {
      "id": 123,
      "start": 529.2000122070312,
      "end": 530.2000122070312,
      "text": " thee."
    },
    {
      "id": 124,
      "start": 530.2000122070312,
      "end": 535.5999755859375,
      "text": " And for thy cattle and for the beasts that are in thy land shall all the increase thereof"
    },
    {
      "id": 125,
      "start": 535.5999755859375,
      "end": 536.5999755859375,
      "text": " be meet."
    },
    {
      "id": 126,
      "start": 536.5999755859375,
      "end": 541.9199829101562,
      "text": " As you begin to look at this plan that God is revealing to his people, and you find that"
    },
    {
      "id": 127,
      "start": 541.9199829101562,
      "end": 547.52001953125,
      "text": " here God is giving them this instruction with regard to for six years, here's what you do."
    },
    {
      "id": 128,
      "start": 547.52001953125,
      "end": 550.52001953125,
      "text": " But on the seventh year, things are going to change."
    },
    {
      "id": 129,
      "start": 550.52001953125,
      "end": 556.1599731445312,
      "text": " It's very similar to what you see with the manna, with the gathering of the manna, remember?"
    },
    {
      "id": 130,
      "start": 556.1599731445312,
      "end": 560.739990234375,
      "text": " God had promised that he would give them bread from heaven, and he gave specific instruction"
    },
    {
      "id": 131,
      "start": 560.739990234375,
      "end": 565.6400146484375,
      "text": " that for six days you go out and you gather, and you gather a certain amount, and you better"
    },
    {
      "id": 132,
      "start": 565.6400146484375,
      "end": 570.9600219726562,
      "text": " be careful though not to store any up, because if you do and you leave it until morning it's"
    },
    {
      "id": 133,
      "start": 570.9600219726562,
      "end": 574.760009765625,
      "text": " going to stink and it's going to breed worms, and so there was specific instruction that"
    },
    {
      "id": 134,
      "start": 574.760009765625,
      "end": 576.4400024414062,
      "text": " was given."
    },
    {
      "id": 135,
      "start": 576.4400024414062,
      "end": 580.47998046875,
      "text": " But even in that, on day number six, what were they supposed to do?"
    },
    {
      "id": 136,
      "start": 580.47998046875,
      "end": 584.47998046875,
      "text": " Well, they were supposed to gather twice as much on day number six."
    },
    {
      "id": 137,
      "start": 584.47998046875,
      "end": 588.719970703125,
      "text": " But on day number four, if they gathered twice as much, it's going to stink and breed worms."
    },
    {
      "id": 138,
      "start": 588.719970703125,
      "end": 595.47998046875,
      "text": " But on day number six, if they gathered twice as much, in obedience to God and by faith"
    },
    {
      "id": 139,
      "start": 595.47998046875,
      "end": 599.5599975585938,
      "text": " in what God has said, it didn't spoil."
    },
    {
      "id": 140,
      "start": 599.5599975585938,
      "end": 600.0800170898438,
      "text": " It didn't stink."
    },
    {
      "id": 0,
      "start": 600.0800170898438,
      "end": 605.6800169944763,
      "text": " it didn't breed worms and there were some people on day number seven maybe"
    },
    {
      "id": 1,
      "start": 605.6800169944763,
      "end": 609.520016670227,
      "text": " some of those same guys that gathered twice as much on day two or three and"
    },
    {
      "id": 2,
      "start": 609.520016670227,
      "end": 613.3600168228149,
      "text": " said I don't like that stench and I don't like those worms and so on day"
    },
    {
      "id": 3,
      "start": 613.3600168228149,
      "end": 617.5200176239014,
      "text": " number seven they went out looking to gather some manna what happened there's"
    },
    {
      "id": 4,
      "start": 617.5200176239014,
      "end": 623.6400165557861,
      "text": " no manna because God says I'm gonna come on day seven you know for 40 years they"
    },
    {
      "id": 5,
      "start": 623.6400165557861,
      "end": 629.6800174713135,
      "text": " had manna in that fashion it's building their faith and now when we come to this"
    },
    {
      "id": 6,
      "start": 629.6800174713135,
      "end": 637.0800170898438,
      "text": " instruction with regard to the Sabbath year for six years you're going to take"
    },
    {
      "id": 7,
      "start": 637.0800170898438,
      "end": 641.1200180053711,
      "text": " care of your land you're gonna cultivate it you're gonna sow the seed you're"
    },
    {
      "id": 8,
      "start": 641.1200180053711,
      "end": 649.0000152587891,
      "text": " going to to reap the harvest but in year number seven it's a it's a year of rest"
    },
    {
      "id": 9,
      "start": 649.0000152587891,
      "end": 658.2400169372559,
      "text": " for the land for the animals and for you and for the servants now you can go a"
    },
    {
      "id": 10,
      "start": 658.2400169372559,
      "end": 664.6000137329102,
      "text": " day without eating right if you fail to obey the instruction with regard to the"
    },
    {
      "id": 11,
      "start": 664.6000137329102,
      "end": 670.0000152587891,
      "text": " the manna in a in a week and you just mess it all up and you can go a day"
    },
    {
      "id": 12,
      "start": 670.0000152587891,
      "end": 678.0000152587891,
      "text": " without eating I don't think you can go a year without eating I know some people"
    },
    {
      "id": 13,
      "start": 678.0000152587891,
      "end": 683.0400161743164,
      "text": " that have fasted for a week or a couple of weeks and in the New Testament speaks"
    },
    {
      "id": 14,
      "start": 683.0400161743164,
      "end": 688.7200164794922,
      "text": " about Jesus for 40 days in the wilderness but 365 days without eating"
    },
    {
      "id": 15,
      "start": 688.7200164794922,
      "end": 693.7600173950195,
      "text": " that's a long time you're not you're gonna die but this is the plan that God"
    },
    {
      "id": 16,
      "start": 693.7600173950195,
      "end": 700.5600204467773,
      "text": " gave in that seventh year it's a year of rest now when you think about that you"
    },
    {
      "id": 17,
      "start": 700.5600204467773,
      "end": 704.2400207519531,
      "text": " consider the plan I I believe this evening and I don't want to get into it"
    },
    {
      "id": 18,
      "start": 704.2400207519531,
      "end": 710.8800201416016,
      "text": " but this plan certainly had a purpose agriculturally there were benefits and"
    },
    {
      "id": 19,
      "start": 710.8800201416016,
      "end": 716.2000198364258,
      "text": " so on and so forth agriculturally for the land and all of that but I believe"
    },
    {
      "id": 20,
      "start": 716.2000198364258,
      "end": 725.6000137329102,
      "text": " that the most significant purpose was in proving or in developing his people and"
    },
    {
      "id": 21,
      "start": 725.6000137329102,
      "end": 732.1200103759766,
      "text": " giving them this instruction and saying are you gonna obey me are you going to"
    },
    {
      "id": 22,
      "start": 732.1200103759766,
      "end": 738.760009765625,
      "text": " have faith that I am able and so we consider the plan and as I look at the"
    },
    {
      "id": 23,
      "start": 738.760009765625,
      "end": 742.4000244140625,
      "text": " plan in these first seven verses and then in verse number eight it goes into"
    },
    {
      "id": 24,
      "start": 742.4000244140625,
      "end": 747.6800231933594,
      "text": " the year of Jubilee and the 50th year and I don't intend in any way shape or"
    },
    {
      "id": 25,
      "start": 747.6800231933594,
      "end": 751.8400115966797,
      "text": " form to to skim over those verses to to give you the impression that they're not"
    },
    {
      "id": 26,
      "start": 751.8400115966797,
      "end": 756.52001953125,
      "text": " important because they are but sticking within this seventh year this year of"
    },
    {
      "id": 27,
      "start": 756.52001953125,
      "end": 762.0800170898438,
      "text": " rest we'll skip down to verse number 18 and kind of follow in with the the"
    },
    {
      "id": 28,
      "start": 762.0800170898438,
      "end": 765.8800201416016,
      "text": " dialogue if you will with regard to this seventh year this Sabbath year and"
    },
    {
      "id": 29,
      "start": 765.8800201416016,
      "end": 770.8000183105469,
      "text": " notice in verse number 18 the Bible says wherefore you shall do my statutes"
    },
    {
      "id": 30,
      "start": 770.8000183105469,
      "end": 776.0800170898438,
      "text": " and keep my judgments and do them and you shall dwell in the land and safety"
    },
    {
      "id": 31,
      "start": 776.0800170898438,
      "end": 781.2400207519531,
      "text": " and the land shall yield her fruit and you shall eat your fill and dwell there"
    },
    {
      "id": 32,
      "start": 781.2400207519531,
      "end": 787.7200164794922,
      "text": " and in safety now look in verse number 20 our God is so gracious he really is"
    },
    {
      "id": 33,
      "start": 787.7200164794922,
      "end": 794.8800201416016,
      "text": " in verse number 20 God in his omniscience he says in verse number 20"
    },
    {
      "id": 34,
      "start": 794.8800201416016,
      "end": 800.52001953125,
      "text": " and if you shall say what shall we eat the seventh year now God knows us he"
    },
    {
      "id": 35,
      "start": 800.52001953125,
      "end": 806.6800231933594,
      "text": " made us he knows that we're but dust he knows our frame and by the way I"
    },
    {
      "id": 36,
      "start": 806.6800231933594,
      "end": 809.9200134277344,
      "text": " probably would have been one of those people saying what are we gonna eat in"
    },
    {
      "id": 37,
      "start": 809.9200134277344,
      "end": 816.4200134277344,
      "text": " the seventh year and if you'd be honest maybe you would be too it's a valid"
    },
    {
      "id": 38,
      "start": 816.4200134277344,
      "end": 821.9200134277344,
      "text": " question is it not and here's the beautiful thing about the Word of God"
    },
    {
      "id": 39,
      "start": 821.9200134277344,
      "end": 827.3600158691406,
      "text": " and the the grace of our God and just the the way in which he's given us his"
    },
    {
      "id": 40,
      "start": 827.3600158691406,
      "end": 832.0000152587891,
      "text": " word and he's provided us with all that we need the Bible says that as far as"
    },
    {
      "id": 41,
      "start": 832.0000152587891,
      "end": 835.0400238037109,
      "text": " New Testament believers are concerned we look in the New Testament that he has"
    },
    {
      "id": 42,
      "start": 835.0400238037109,
      "end": 840.2400207519531,
      "text": " given us all things that pertain unto life and godliness he has given us"
    },
    {
      "id": 43,
      "start": 840.2400207519531,
      "end": 845.2400207519531,
      "text": " everything that we need we are seated in the heavenlies and we find here that God"
    },
    {
      "id": 44,
      "start": 845.2400207519531,
      "end": 851.4400177001953,
      "text": " says that if ye shall say what shall we eat the seventh year behold we shall not"
    },
    {
      "id": 45,
      "start": 851.4400177001953,
      "end": 857.8000183105469,
      "text": " sow nor gather in our increase and if you're a analytical kind of a person as"
    },
    {
      "id": 46,
      "start": 857.8000183105469,
      "end": 861.760009765625,
      "text": " I would be I would look at that in that fashion I'd say okay so we're not"
    },
    {
      "id": 47,
      "start": 861.760009765625,
      "end": 865.8000183105469,
      "text": " supposed to sow we're not supposed to gather for an entire year what are we"
    },
    {
      "id": 48,
      "start": 865.8000183105469,
      "end": 872.0400085449219,
      "text": " gonna do what are we gonna do and we consider the plan of God but then we"
    },
    {
      "id": 49,
      "start": 872.0400085449219,
      "end": 877.0400085449219,
      "text": " note if you're taking notes number two consider the promise of God now this is"
    },
    {
      "id": 50,
      "start": 877.0400085449219,
      "end": 881.52001953125,
      "text": " an amazing truth as I look at this passage of scripture and I begin to"
    },
    {
      "id": 51,
      "start": 881.52001953125,
      "end": 886.1200256347656,
      "text": " just meditate upon the truth of the Word of God the reality is that God does"
    },
    {
      "id": 52,
      "start": 886.1200256347656,
      "end": 893.1600036621094,
      "text": " not owe us an explanation amen he really doesn't he could simply say listen for"
    },
    {
      "id": 53,
      "start": 893.1600036621094,
      "end": 895.9600219726562,
      "text": " six years this is what you do on the seventh year this is what you do period"
    },
    {
      "id": 54,
      "start": 895.9600219726562,
      "end": 903.6000061035156,
      "text": " end of story obey me he's God but God knows our frame he knows that we're but"
    },
    {
      "id": 55,
      "start": 903.6000061035156,
      "end": 909.0400085449219,
      "text": " dust and here in this passage of scripture he's going to give the"
    },
    {
      "id": 56,
      "start": 909.0400085449219,
      "end": 917.6400146484375,
      "text": " children of Israel a promise that is amazing in verse number 21 I love just"
    },
    {
      "id": 57,
      "start": 917.6400146484375,
      "end": 927.3200073242188,
      "text": " the verbiage in verse 21 it says then I will command my blessing upon you in the"
    },
    {
      "id": 58,
      "start": 927.3200073242188,
      "end": 931.8800048828125,
      "text": " sixth year now can you can you get your mind around that statement we'll read"
    },
    {
      "id": 59,
      "start": 931.8800048828125,
      "end": 936.2400207519531,
      "text": " the rest of the verse in just a moment but get your mind around the statement"
    },
    {
      "id": 60,
      "start": 936.2400207519531,
      "end": 944.0400085449219,
      "text": " that God is making that he the Lord God omnipotent Jehovah is going to command"
    },
    {
      "id": 61,
      "start": 944.0400085449219,
      "end": 950.9600219726562,
      "text": " his blessing upon you in the sixth year the God that spoke everything into"
    },
    {
      "id": 62,
      "start": 950.9600219726562,
      "end": 955.4800109863281,
      "text": " existence the God who said let there be light and there was light the God who as"
    },
    {
      "id": 63,
      "start": 955.4800109863281,
      "end": 960.52001953125,
      "text": " the record is given to us in Genesis said and he made the stars also but"
    },
    {
      "id": 64,
      "start": 960.52001953125,
      "end": 966.1200256347656,
      "text": " they're beyond our ability to even come close to numbering the God that created"
    },
    {
      "id": 65,
      "start": 966.1200256347656,
      "end": 972.280029296875,
      "text": " all things the God who is the the Redeemer of mankind he says that he will"
    },
    {
      "id": 66,
      "start": 972.280029296875,
      "end": 979.2400207519531,
      "text": " command his blessing upon you that's encouraging I mean when you begin to to"
    },
    {
      "id": 67,
      "start": 979.2400207519531,
      "end": 983.0000305175781,
      "text": " look at this and you begin to think about the fact of okay we're gonna do"
    },
    {
      "id": 68,
      "start": 983.0000305175781,
      "end": 985.3200073242188,
      "text": " this for six years and then this what we're supposed to do in the seventh year"
    },
    {
      "id": 69,
      "start": 985.3200073242188,
      "end": 989.3200073242188,
      "text": " and you're thinking to yourself we're not supposed to so we're not supposed to"
    },
    {
      "id": 70,
      "start": 989.3200073242188,
      "end": 995.0000305175781,
      "text": " gather so what is it that we're going to eat and God says I will command my"
    },
    {
      "id": 71,
      "start": 995.0000305175781,
      "end": 1002.52001953125,
      "text": " blessing upon you I will command my blessing upon you and my mind's eye and"
    },
    {
      "id": 72,
      "start": 1002.52001953125,
      "end": 1007.0000305175781,
      "text": " my sanctified imagination I begin to think about the Lord God Almighty and"
    },
    {
      "id": 73,
      "start": 1007.0000305175781,
      "end": 1012.9600219726562,
      "text": " how he would command you know nature obeys God the only thing in God's"
    },
    {
      "id": 74,
      "start": 1013.0800170898438,
      "end": 1019.9200134277344,
      "text": " creation that does not automatically obey him is mankind aren't you thankful"
    },
    {
      "id": 75,
      "start": 1019.9200134277344,
      "end": 1028.5600280761719,
      "text": " that the whale obeyed God I know Jonah was amen after right God told the whale"
    },
    {
      "id": 76,
      "start": 1028.5600280761719,
      "end": 1035.52001953125,
      "text": " to spew him out I'm pretty sure that Jonah was happy that that whale obeyed"
    },
    {
      "id": 77,
      "start": 1035.52001953125,
      "end": 1041.52001953125,
      "text": " better than he did right because how did Jonah obey he didn't do so good in Jonah"
    },
    {
      "id": 78,
      "start": 1041.52001953125,
      "end": 1045.9200134277344,
      "text": " chapter number one right he went the opposite way he paid the fare to get"
    },
    {
      "id": 79,
      "start": 1045.9200134277344,
      "end": 1049.9200134277344,
      "text": " away from doing what God had caught him to do but when God spoke to that whale"
    },
    {
      "id": 80,
      "start": 1049.9200134277344,
      "end": 1056.3200073242188,
      "text": " it obeyed when God says he's gonna command his blessing in the fashion in"
    },
    {
      "id": 81,
      "start": 1056.3200073242188,
      "end": 1060.8000183105469,
      "text": " the manner in which he says he's going to command it you can rest assured that"
    },
    {
      "id": 82,
      "start": 1060.8000183105469,
      "end": 1066.1200256347656,
      "text": " it's going to happen and the Bible says here here's what he's gonna do I'm gonna"
    },
    {
      "id": 83,
      "start": 1066.1200256347656,
      "end": 1071.0800170898438,
      "text": " command my blessing upon you in the sixth year it's a promise of provision"
    },
    {
      "id": 84,
      "start": 1071.0800170898438,
      "end": 1078.8800048828125,
      "text": " the details are provided the Bible says this and it shall bring forth fruit for"
    },
    {
      "id": 85,
      "start": 1078.8800048828125,
      "end": 1088.0800170898438,
      "text": " three years it shall he didn't say it might he said it shall it shall bring"
    },
    {
      "id": 86,
      "start": 1088.0800170898438,
      "end": 1094.6000061035156,
      "text": " forth fruit for three years now what does that mean well he gives further"
    },
    {
      "id": 87,
      "start": 1094.760009765625,
      "end": 1101.6400146484375,
      "text": " detail in verse number 22 to how this is going to work and ye shall sow the"
    },
    {
      "id": 88,
      "start": 1101.6400146484375,
      "end": 1107.5600280761719,
      "text": " eighth year and eat yet of old fruit until the ninth year until her fruits"
    },
    {
      "id": 89,
      "start": 1107.5600280761719,
      "end": 1114.5599975585938,
      "text": " come in ye shall eat of the old store so in the sixth year God says he's going to"
    },
    {
      "id": 90,
      "start": 1114.5599975585938,
      "end": 1120.3600463867188,
      "text": " command his blessing upon them and the land would bring forth fruit for three"
    },
    {
      "id": 91,
      "start": 1120.3600463867188,
      "end": 1125.0400390625,
      "text": " years so they would eat that fruit in year number six and year number seven"
    },
    {
      "id": 92,
      "start": 1125.0400390625,
      "end": 1128.9200439453125,
      "text": " and year number eight and year number seven they're not sowing they're not"
    },
    {
      "id": 93,
      "start": 1128.9200439453125,
      "end": 1133.9200439453125,
      "text": " cultivating they're not reaping but in year number eight they now can plant"
    },
    {
      "id": 94,
      "start": 1133.9200439453125,
      "end": 1138.7999877929688,
      "text": " again they can they can sow the seed again in year number eight but as you"
    },
    {
      "id": 95,
      "start": 1138.7999877929688,
      "end": 1143.0,
      "text": " know when you plant the seed you don't reap a harvest immediately there's a"
    },
    {
      "id": 96,
      "start": 1143.0,
      "end": 1149.3200073242188,
      "text": " period of time that must take place and so God says I'm going to give you three"
    },
    {
      "id": 97,
      "start": 1149.3200073242188,
      "end": 1153.5599975585938,
      "text": " years worth so that in that eighth year when you're able to start cultivating"
    },
    {
      "id": 98,
      "start": 1153.5599975585938,
      "end": 1161.0800170898438,
      "text": " and planting but it's not producing yet you still have sustenance and then as"
    },
    {
      "id": 99,
      "start": 1161.0800170898438,
      "end": 1168.0800170898438,
      "text": " that crop begins to come in then that which I commanded my blessing will go"
    },
    {
      "id": 100,
      "start": 1168.0800170898438,
      "end": 1174.3600463867188,
      "text": " away now think about that this is powerful truth that God is giving again"
    },
    {
      "id": 101,
      "start": 1174.4000244140625,
      "end": 1180.7200317382812,
      "text": " yes there's some agricultural impacts and certainly as God the Creator he"
    },
    {
      "id": 102,
      "start": 1180.7200317382812,
      "end": 1185.0,
      "text": " understood what those benefits would be to the land but you see how God is"
    },
    {
      "id": 103,
      "start": 1185.0,
      "end": 1190.8800048828125,
      "text": " proving his people how he's seeking to develop his people that for six years"
    },
    {
      "id": 104,
      "start": 1190.8800048828125,
      "end": 1193.5599975585938,
      "text": " you're going to do this but in the seventh year you're not going to do"
    },
    {
      "id": 105,
      "start": 1193.5599975585938,
      "end": 1199.8800048828125,
      "text": " anything because here's what I'm going to do as we think about this passage of"
    },
    {
      "id": 106,
      "start": 1199.8800048828125,
      "end": 1202.4000244140625,
      "text": " scripture"
    },
    {
      "id": 0,
      "start": 1202.4000244140625,
      "end": 1204.240024447441,
      "text": " When we think about those two statements"
    },
    {
      "id": 1,
      "start": 1204.240024447441,
      "end": 1205.6600244045258,
      "text": " that I made in the beginning"
    },
    {
      "id": 2,
      "start": 1205.6600244045258,
      "end": 1206.880024433136,
      "text": " by way of introduction,"
    },
    {
      "id": 3,
      "start": 1206.880024433136,
      "end": 1209.2400245666504,
      "text": " that the emphasis throughout the Word of God"
    },
    {
      "id": 4,
      "start": 1209.2400245666504,
      "end": 1212.9200248718262,
      "text": " that is placed upon those two themes"
    },
    {
      "id": 5,
      "start": 1212.9200248718262,
      "end": 1214.3600244522095,
      "text": " or those two topics,"
    },
    {
      "id": 6,
      "start": 1214.3600244522095,
      "end": 1217.4200248718262,
      "text": " one of obedience and another of faith."
    },
    {
      "id": 7,
      "start": 1217.4200248718262,
      "end": 1219.7200241088867,
      "text": " Do you not see it in the passage of Scripture?"
    },
    {
      "id": 8,
      "start": 1219.7200241088867,
      "end": 1221.5600242614746,
      "text": " It would require obedience"
    },
    {
      "id": 9,
      "start": 1221.5600242614746,
      "end": 1224.3200244903564,
      "text": " to the plan of God in the first seven verses,"
    },
    {
      "id": 10,
      "start": 1224.3200244903564,
      "end": 1226.9200248718262,
      "text": " but that obedience requires faith"
    },
    {
      "id": 11,
      "start": 1226.9200248718262,
      "end": 1231.4800243377686,
      "text": " that God's going to do what God said He's going to do."
    },
    {
      "id": 12,
      "start": 1231.4800243377686,
      "end": 1238.1200256347656,
      "text": " Sometimes, we struggle in the area of our faith."
    },
    {
      "id": 13,
      "start": 1238.1200256347656,
      "end": 1242.0800247192383,
      "text": " Is God really going to do what God said He was going to do?"
    },
    {
      "id": 14,
      "start": 1242.0800247192383,
      "end": 1247.600025177002,
      "text": " Do we really have faith to live by faith?"
    },
    {
      "id": 15,
      "start": 1247.600025177002,
      "end": 1250.1600227355957,
      "text": " Jesus said multiple times"
    },
    {
      "id": 16,
      "start": 1250.1600227355957,
      "end": 1252.9600257873535,
      "text": " and I actually preached some messages on this last year,"
    },
    {
      "id": 17,
      "start": 1252.9600257873535,
      "end": 1255.0800247192383,
      "text": " there were times during His earthly ministry"
    },
    {
      "id": 18,
      "start": 1255.0800247192383,
      "end": 1258.5600242614746,
      "text": " when He said, how is it that you have no faith?"
    },
    {
      "id": 19,
      "start": 1258.5600242614746,
      "end": 1259.9200248718262,
      "text": " Right?"
    },
    {
      "id": 20,
      "start": 1259.9200248718262,
      "end": 1261.4600257873535,
      "text": " And then there were other times where He said,"
    },
    {
      "id": 21,
      "start": 1261.4600257873535,
      "end": 1266.5800247192383,
      "text": " I found so great faith in all of Israel."
    },
    {
      "id": 22,
      "start": 1266.5800247192383,
      "end": 1269.380027770996,
      "text": " You know what the Bible says about the return of Christ?"
    },
    {
      "id": 23,
      "start": 1269.380027770996,
      "end": 1273.3400268554688,
      "text": " The Son of Man find faith."
    },
    {
      "id": 24,
      "start": 1273.3400268554688,
      "end": 1276.140022277832,
      "text": " The reality is that we're to live by faith."
    },
    {
      "id": 25,
      "start": 1276.140022277832,
      "end": 1278.4600219726562,
      "text": " We're to trust God, believe Him."
    },
    {
      "id": 26,
      "start": 1278.4600219726562,
      "end": 1282.5000228881836,
      "text": " Now, as we keep in mind this passage of Scripture,"
    },
    {
      "id": 27,
      "start": 1282.5000228881836,
      "end": 1284.8200225830078,
      "text": " the context of the Scripture,"
    },
    {
      "id": 28,
      "start": 1284.8200225830078,
      "end": 1287.9400253295898,
      "text": " and of course, understanding the truth"
    },
    {
      "id": 29,
      "start": 1287.9400253295898,
      "end": 1289.9000244140625,
      "text": " for the children of Israel for preparation"
    },
    {
      "id": 30,
      "start": 1289.9000244140625,
      "end": 1291.5800247192383,
      "text": " as they would enter the land,"
    },
    {
      "id": 31,
      "start": 1291.5800247192383,
      "end": 1295.0600280761719,
      "text": " I want you to consider that during the wilderness wanderings,"
    },
    {
      "id": 32,
      "start": 1295.0600280761719,
      "end": 1296.4000244140625,
      "text": " during that period of time"
    },
    {
      "id": 33,
      "start": 1296.4000244140625,
      "end": 1299.660026550293,
      "text": " in which they were going through after their disobedience,"
    },
    {
      "id": 34,
      "start": 1299.660026550293,
      "end": 1301.6200256347656,
      "text": " you understand that at this point,"
    },
    {
      "id": 35,
      "start": 1301.6200256347656,
      "end": 1303.9000244140625,
      "text": " they had not yet sent the spies."
    },
    {
      "id": 36,
      "start": 1303.9000244140625,
      "end": 1305.6200256347656,
      "text": " That whole thing of the disobedience"
    },
    {
      "id": 37,
      "start": 1305.6200256347656,
      "end": 1308.140022277832,
      "text": " has not taken place yet and they're going to wander"
    },
    {
      "id": 38,
      "start": 1308.140022277832,
      "end": 1311.0200271606445,
      "text": " and God is going to provide food for them"
    },
    {
      "id": 39,
      "start": 1311.0200271606445,
      "end": 1312.7000274658203,
      "text": " for that entire duration."
    },
    {
      "id": 40,
      "start": 1312.7000274658203,
      "end": 1315.140022277832,
      "text": " And turn over to Joshua 5, if you will."
    },
    {
      "id": 41,
      "start": 1315.140022277832,
      "end": 1317.540023803711,
      "text": " And I want you to notice what the Word of God says"
    },
    {
      "id": 42,
      "start": 1317.540023803711,
      "end": 1318.380027770996,
      "text": " in Joshua 5."
    },
    {
      "id": 43,
      "start": 1318.380027770996,
      "end": 1320.6200256347656,
      "text": " Of course, that generation that did not believe God,"
    },
    {
      "id": 44,
      "start": 1320.6200256347656,
      "end": 1323.380027770996,
      "text": " they died and Joshua and Caleb"
    },
    {
      "id": 45,
      "start": 1323.380027770996,
      "end": 1325.380027770996,
      "text": " are going to enter the land."
    },
    {
      "id": 46,
      "start": 1325.380027770996,
      "end": 1327.540023803711,
      "text": " Of course, Joshua will be the human leader"
    },
    {
      "id": 47,
      "start": 1327.540023803711,
      "end": 1328.540023803711,
      "text": " of the nation of Israel."
    },
    {
      "id": 48,
      "start": 1328.540023803711,
      "end": 1333.1800231933594,
      "text": " And in Joshua 5, the Bible gives us the record"
    },
    {
      "id": 49,
      "start": 1333.1800231933594,
      "end": 1335.8400268554688,
      "text": " of when that manna would cease to produce."
    },
    {
      "id": 50,
      "start": 1335.8400268554688,
      "end": 1338.1000213623047,
      "text": " And I want you to see what God did."
    },
    {
      "id": 51,
      "start": 1338.1000213623047,
      "end": 1340.2200317382812,
      "text": " Now, as you understand the wilderness wanderings"
    },
    {
      "id": 52,
      "start": 1340.2200317382812,
      "end": 1341.9800262451172,
      "text": " and you understand as you would trace"
    },
    {
      "id": 53,
      "start": 1341.9800262451172,
      "end": 1344.9800262451172,
      "text": " the steps of the wilderness wanderings,"
    },
    {
      "id": 54,
      "start": 1344.9800262451172,
      "end": 1346.4600219726562,
      "text": " that they just wandered around."
    },
    {
      "id": 55,
      "start": 1346.4600219726562,
      "end": 1348.3400268554688,
      "text": " I mean, it almost, if you were to draw it all out"
    },
    {
      "id": 56,
      "start": 1349.1800231933594,
      "end": 1350.2200317382812,
      "text": " on a map, they're crisscrossing"
    },
    {
      "id": 57,
      "start": 1350.2200317382812,
      "end": 1351.6600189208984,
      "text": " and they're all over the place."
    },
    {
      "id": 58,
      "start": 1351.6600189208984,
      "end": 1352.9400177001953,
      "text": " When is it that they left?"
    },
    {
      "id": 59,
      "start": 1352.9400177001953,
      "end": 1355.3400268554688,
      "text": " Well, remember when that pillar of cloud"
    },
    {
      "id": 60,
      "start": 1355.3400268554688,
      "end": 1357.4200286865234,
      "text": " that was by day and the pillar of fire"
    },
    {
      "id": 61,
      "start": 1357.4200286865234,
      "end": 1359.1800231933594,
      "text": " that was by night on the tabernacle,"
    },
    {
      "id": 62,
      "start": 1359.1800231933594,
      "end": 1360.6600189208984,
      "text": " when it would remove, what'd they do?"
    },
    {
      "id": 63,
      "start": 1360.6600189208984,
      "end": 1362.8600311279297,
      "text": " They would move and they would follow it."
    },
    {
      "id": 64,
      "start": 1362.8600311279297,
      "end": 1365.3000183105469,
      "text": " So they didn't have any time to be planting"
    },
    {
      "id": 65,
      "start": 1365.3000183105469,
      "end": 1368.540023803711,
      "text": " and cultivating and reaping a harvest."
    },
    {
      "id": 66,
      "start": 1368.540023803711,
      "end": 1369.8200225830078,
      "text": " They were constantly moving."
    },
    {
      "id": 67,
      "start": 1369.8200225830078,
      "end": 1372.1400299072266,
      "text": " And so God gave them manna."
    },
    {
      "id": 68,
      "start": 1372.1400299072266,
      "end": 1374.8200225830078,
      "text": " When they get into the land,"
    },
    {
      "id": 69,
      "start": 1374.8200225830078,
      "end": 1377.3400268554688,
      "text": " the Bible tells us in verse number 10 of Joshua 5,"
    },
    {
      "id": 70,
      "start": 1377.3400268554688,
      "end": 1380.1000213623047,
      "text": " the children of Israel encamped in Gilgal"
    },
    {
      "id": 71,
      "start": 1380.1000213623047,
      "end": 1383.3000183105469,
      "text": " and kept the Passover on the 14th day of the month"
    },
    {
      "id": 72,
      "start": 1383.3000183105469,
      "end": 1385.7000274658203,
      "text": " at even in the plains of Jericho."
    },
    {
      "id": 73,
      "start": 1385.7000274658203,
      "end": 1388.260025024414,
      "text": " And they did eat of the old corn of the land"
    },
    {
      "id": 74,
      "start": 1388.260025024414,
      "end": 1389.9800262451172,
      "text": " on the morrow after the Passover,"
    },
    {
      "id": 75,
      "start": 1389.9800262451172,
      "end": 1394.1000213623047,
      "text": " unleavened cakes and parts corn in the self same day."
    },
    {
      "id": 76,
      "start": 1394.1000213623047,
      "end": 1396.4200286865234,
      "text": " Notice this, the manna ceased on the morrow"
    },
    {
      "id": 77,
      "start": 1396.4200286865234,
      "end": 1398.8600311279297,
      "text": " after they had eaten of the old corn of the land."
    },
    {
      "id": 78,
      "start": 1398.8600311279297,
      "end": 1401.02001953125,
      "text": " Neither had the children of Israel manna anymore,"
    },
    {
      "id": 79,
      "start": 1401.02001953125,
      "end": 1404.5000305175781,
      "text": " but they did eat of the fruit of the land of Canaan"
    },
    {
      "id": 80,
      "start": 1404.5000305175781,
      "end": 1405.6200256347656,
      "text": " that year."
    },
    {
      "id": 81,
      "start": 1405.6200256347656,
      "end": 1406.9800262451172,
      "text": " God provided for them."
    },
    {
      "id": 82,
      "start": 1408.3000183105469,
      "end": 1409.3400268554688,
      "text": " God took care."
    },
    {
      "id": 83,
      "start": 1409.3400268554688,
      "end": 1412.1800231933594,
      "text": " Listen, does God know what we need?"
    },
    {
      "id": 84,
      "start": 1412.1800231933594,
      "end": 1413.2200317382812,
      "text": " Absolutely."
    },
    {
      "id": 85,
      "start": 1413.2200317382812,
      "end": 1414.4200286865234,
      "text": " You know, Matthew 6 says,"
    },
    {
      "id": 86,
      "start": 1414.4200286865234,
      "end": 1416.02001953125,
      "text": " turn over there very quickly, if you would,"
    },
    {
      "id": 87,
      "start": 1416.02001953125,
      "end": 1418.1400299072266,
      "text": " Matthew chapter number six."
    },
    {
      "id": 88,
      "start": 1418.1400299072266,
      "end": 1420.1000213623047,
      "text": " And you look in this passage"
    },
    {
      "id": 89,
      "start": 1420.1000213623047,
      "end": 1423.3400268554688,
      "text": " and you find great promises and great truth"
    },
    {
      "id": 90,
      "start": 1423.3400268554688,
      "end": 1425.780029296875,
      "text": " that would encourage the people of God."
    },
    {
      "id": 91,
      "start": 1425.780029296875,
      "end": 1427.4600219726562,
      "text": " But think of this one statement"
    },
    {
      "id": 92,
      "start": 1427.4600219726562,
      "end": 1430.9800262451172,
      "text": " in verse number eight of Matthew chapter number six."
    },
    {
      "id": 93,
      "start": 1430.9800262451172,
      "end": 1431.9000244140625,
      "text": " The Bible says this,"
    },
    {
      "id": 94,
      "start": 1432.02001953125,
      "end": 1434.02001953125,
      "text": " be not ye therefore like unto them."
    },
    {
      "id": 95,
      "start": 1434.02001953125,
      "end": 1436.260025024414,
      "text": " He's speaking about those Pharisees"
    },
    {
      "id": 96,
      "start": 1436.260025024414,
      "end": 1438.8600311279297,
      "text": " and those religious leaders that were praying"
    },
    {
      "id": 97,
      "start": 1438.8600311279297,
      "end": 1441.02001953125,
      "text": " as hypocrites and using vain repetition"
    },
    {
      "id": 98,
      "start": 1441.02001953125,
      "end": 1441.9000244140625,
      "text": " and so on and so forth."
    },
    {
      "id": 99,
      "start": 1441.9000244140625,
      "end": 1442.9000244140625,
      "text": " He says this,"
    },
    {
      "id": 100,
      "start": 1442.9000244140625,
      "end": 1447.9000244140625,
      "text": " for your father knoweth what things you have need of"
    },
    {
      "id": 101,
      "start": 1448.5800170898438,
      "end": 1450.0600280761719,
      "text": " before you ask him."
    },
    {
      "id": 102,
      "start": 1450.9800262451172,
      "end": 1453.02001953125,
      "text": " Isn't that encouraging?"
    },
    {
      "id": 103,
      "start": 1453.02001953125,
      "end": 1454.8600311279297,
      "text": " Isn't it comforting?"
    },
    {
      "id": 104,
      "start": 1454.8600311279297,
      "end": 1456.260025024414,
      "text": " Juliana told me this afternoon,"
    },
    {
      "id": 105,
      "start": 1456.260025024414,
      "end": 1458.3800201416016,
      "text": " she said, daddy, I have a question for you."
    },
    {
      "id": 106,
      "start": 1458.3800201416016,
      "end": 1460.7000122070312,
      "text": " And before she could get two words of her question out,"
    },
    {
      "id": 107,
      "start": 1460.7000122070312,
      "end": 1462.5000305175781,
      "text": " I gave her the answer."
    },
    {
      "id": 108,
      "start": 1462.5000305175781,
      "end": 1465.3400268554688,
      "text": " And she says, how did you know what I was gonna ask?"
    },
    {
      "id": 109,
      "start": 1465.3400268554688,
      "end": 1467.2200317382812,
      "text": " Well, it's not because I'm omniscient."
    },
    {
      "id": 110,
      "start": 1467.2200317382812,
      "end": 1469.5000305175781,
      "text": " I just knew some things that were going on."
    },
    {
      "id": 111,
      "start": 1469.5000305175781,
      "end": 1473.3400268554688,
      "text": " But the reality is that our heavenly father is omniscient."
    },
    {
      "id": 112,
      "start": 1473.3400268554688,
      "end": 1475.3000183105469,
      "text": " He knows everything."
    },
    {
      "id": 113,
      "start": 1475.3000183105469,
      "end": 1476.4600219726562,
      "text": " He knows what we need."
    },
    {
      "id": 114,
      "start": 1477.4200134277344,
      "end": 1480.02001953125,
      "text": " He made us and in making us,"
    },
    {
      "id": 115,
      "start": 1480.02001953125,
      "end": 1483.1000366210938,
      "text": " he made us need food, right?"
    },
    {
      "id": 116,
      "start": 1483.1000366210938,
      "end": 1485.1000366210938,
      "text": " The end of Matthew chapter number six,"
    },
    {
      "id": 117,
      "start": 1485.1000366210938,
      "end": 1487.1000366210938,
      "text": " when it speaks about the food and the water"
    },
    {
      "id": 118,
      "start": 1487.1000366210938,
      "end": 1488.3800354003906,
      "text": " and the rain and so on and so forth,"
    },
    {
      "id": 119,
      "start": 1488.3800354003906,
      "end": 1490.7400207519531,
      "text": " he says, listen, God knows that you have need"
    },
    {
      "id": 120,
      "start": 1490.7400207519531,
      "end": 1492.1400146484375,
      "text": " of these things."
    },
    {
      "id": 121,
      "start": 1492.1400146484375,
      "end": 1493.7400207519531,
      "text": " He's gonna provide them for you."
    },
    {
      "id": 122,
      "start": 1495.780029296875,
      "end": 1497.2200317382812,
      "text": " The thing that's sad for me,"
    },
    {
      "id": 123,
      "start": 1497.2200317382812,
      "end": 1501.02001953125,
      "text": " and I won't focus upon it for the intent"
    },
    {
      "id": 124,
      "start": 1501.02001953125,
      "end": 1504.8200378417969,
      "text": " of the message this evening is really to encourage us"
    },
    {
      "id": 125,
      "start": 1504.8200378417969,
      "end": 1509.6600341796875,
      "text": " to have faith in God and to obey His plan."
    },
    {
      "id": 126,
      "start": 1510.5800170898438,
      "end": 1513.5800170898438,
      "text": " Unfortunately, as you would study the history of Israel"
    },
    {
      "id": 127,
      "start": 1513.5800170898438,
      "end": 1514.9400329589844,
      "text": " from all that we can gather,"
    },
    {
      "id": 128,
      "start": 1514.9400329589844,
      "end": 1517.3000183105469,
      "text": " you would find that the children of Israel"
    },
    {
      "id": 129,
      "start": 1517.3000183105469,
      "end": 1519.780029296875,
      "text": " never consistently obeyed the instruction"
    },
    {
      "id": 130,
      "start": 1519.780029296875,
      "end": 1521.7400207519531,
      "text": " that we read in Leviticus 25."
    },
    {
      "id": 131,
      "start": 1524.9800109863281,
      "end": 1528.3000183105469,
      "text": " I find two sad results of that."
    },
    {
      "id": 132,
      "start": 1528.3000183105469,
      "end": 1531.9400329589844,
      "text": " Number one, they missed out on seeing God work."
    },
    {
      "id": 133,
      "start": 1533.5400390625,
      "end": 1536.9400329589844,
      "text": " They missed out on seeing what God could do"
    },
    {
      "id": 134,
      "start": 1538.1800231933594,
      "end": 1541.260009765625,
      "text": " because they didn't obey and they didn't have faith."
    },
    {
      "id": 135,
      "start": 1542.2200317382812,
      "end": 1544.260009765625,
      "text": " You know, when we lack faith in our lives,"
    },
    {
      "id": 136,
      "start": 1544.260009765625,
      "end": 1546.8600158691406,
      "text": " we miss out on seeing what God can do."
    },
    {
      "id": 137,
      "start": 1547.9000244140625,
      "end": 1550.5800170898438,
      "text": " Why did He not do many mighty works there?"
    },
    {
      "id": 138,
      "start": 1550.5800170898438,
      "end": 1552.4200134277344,
      "text": " Because of their unbelief."
    },
    {
      "id": 139,
      "start": 1552.4200134277344,
      "end": 1555.4200134277344,
      "text": " Because of their unbelief, their lack of faith."
    },
    {
      "id": 140,
      "start": 1555.4200134277344,
      "end": 1556.780029296875,
      "text": " That's what the Bible says of Jesus"
    },
    {
      "id": 141,
      "start": 1556.780029296875,
      "end": 1557.8600158691406,
      "text": " during His earthly ministry."
    },
    {
      "id": 142,
      "start": 1557.8600158691406,
      "end": 1560.1000366210938,
      "text": " He did not many mighty works there."
    },
    {
      "id": 143,
      "start": 1560.1000366210938,
      "end": 1560.9400329589844,
      "text": " Why?"
    },
    {
      "id": 144,
      "start": 1560.9400329589844,
      "end": 1562.1800231933594,
      "text": " Because of their unbelief."
    },
    {
      "id": 145,
      "start": 1562.1800231933594,
      "end": 1565.5800170898438,
      "text": " I don't wanna miss out on what God is able to do in my life."
    },
    {
      "id": 146,
      "start": 1566.7400207519531,
      "end": 1570.3800354003906,
      "text": " I wanna have faith in what God said that He is going to do"
    },
    {
      "id": 147,
      "start": 1570.3800354003906,
      "end": 1572.3400268554688,
      "text": " because our God is able."
    },
    {
      "id": 148,
      "start": 1573.9000244140625,
      "end": 1576.9800109863281,
      "text": " Not only did they miss out on seeing what God was able to do"
    },
    {
      "id": 149,
      "start": 1577.6600341796875,
      "end": 1578.9400329589844,
      "text": " but the reality is they face judgment"
    },
    {
      "id": 150,
      "start": 1578.9400329589844,
      "end": 1580.5000305175781,
      "text": " for their disobedience."
    },
    {
      "id": 151,
      "start": 1581.8600158691406,
      "end": 1585.4200134277344,
      "text": " In obedience, we get to see what God is able to do."
    },
    {
      "id": 152,
      "start": 1585.4200134277344,
      "end": 1588.3800354003906,
      "text": " In disobedience, not only do we miss out"
    },
    {
      "id": 153,
      "start": 1588.3800354003906,
      "end": 1589.4600219726562,
      "text": " on seeing what God's gonna do"
    },
    {
      "id": 154,
      "start": 1589.4600219726562,
      "end": 1592.3000183105469,
      "text": " but then we have to face judgment."
    },
    {
      "id": 155,
      "start": 1592.3000183105469,
      "end": 1594.260009765625,
      "text": " And a couple of passages later"
    },
    {
      "id": 156,
      "start": 1594.260009765625,
      "end": 1596.8600158691406,
      "text": " in Leviticus chapter number 26,"
    },
    {
      "id": 157,
      "start": 1596.8600158691406,
      "end": 1599.4200134277344,
      "text": " we are in 25, it's a lengthy passage"
    },
    {
      "id": 158,
      "start": 1599.4200134277344,
      "end": 1603.780029296875,
      "text": " but in Leviticus 26 in verses 33 and 34,"
    },
    {
      "id": 159,
      "start": 1603.780029296875,
      "end": 1605.4600219726562,
      "text": " I want you to see what God says"
    },
    {
      "id": 160,
      "start": 1605.4600219726562,
      "end": 1609.1000366210938,
      "text": " and really if you look at all of the chapter 26,"
    },
    {
      "id": 161,
      "start": 1609.1000366210938,
      "end": 1611.3000183105469,
      "text": " you'll see just the obedience."
    },
    {
      "id": 162,
      "start": 1611.3000183105469,
      "end": 1613.1800231933594,
      "text": " If you walk in my statutes and keep them,"
    },
    {
      "id": 163,
      "start": 1613.1800231933594,
      "end": 1615.02001953125,
      "text": " then here's what I'm going to do."
    },
    {
      "id": 164,
      "start": 1615.02001953125,
      "end": 1617.0600280761719,
      "text": " If you don't hearken unto me,"
    },
    {
      "id": 165,
      "start": 1617.0600280761719,
      "end": 1618.5400390625,
      "text": " then here's what's going to happen."
    },
    {
      "id": 166,
      "start": 1618.5400390625,
      "end": 1620.7000122070312,
      "text": " If then kind of statements, if you will."
    },
    {
      "id": 167,
      "start": 1620.7000122070312,
      "end": 1623.780029296875,
      "text": " And if you look in verse 33 of Leviticus 26,"
    },
    {
      "id": 168,
      "start": 1623.780029296875,
      "end": 1624.9800109863281,
      "text": " the Bible says this,"
    },
    {
      "id": 169,
      "start": 1624.9800109863281,
      "end": 1627.1400146484375,
      "text": " and I will scatter you among the heathen"
    },
    {
      "id": 170,
      "start": 1627.1400146484375,
      "end": 1629.7000122070312,
      "text": " and will draw out a sword after you"
    },
    {
      "id": 171,
      "start": 1629.7000122070312,
      "end": 1633.4200134277344,
      "text": " and your land shall be desolate and your cities waste."
    },
    {
      "id": 172,
      "start": 1633.5800170898438,
      "end": 1637.6600341796875,
      "text": " Then shall the land enjoy her Sabbaths"
    },
    {
      "id": 173,
      "start": 1637.6600341796875,
      "end": 1640.7400207519531,
      "text": " as long as it lieth desolate"
    },
    {
      "id": 174,
      "start": 1640.7400207519531,
      "end": 1642.9800109863281,
      "text": " and ye be in your enemy's land."
    },
    {
      "id": 175,
      "start": 1642.9800109863281,
      "end": 1647.5800170898438,
      "text": " Even then shall the land rest and enjoy her Sabbaths."
    },
    {
      "id": 176,
      "start": 1647.5800170898438,
      "end": 1649.4600219726562,
      "text": " That's exactly what happened"
    },
    {
      "id": 177,
      "start": 1649.4600219726562,
      "end": 1651.7400207519531,
      "text": " during the Babylonian captivity."
    },
    {
      "id": 178,
      "start": 1651.7400207519531,
      "end": 1655.6200256347656,
      "text": " It was 70 years because of a lack of obedience"
    },
    {
      "id": 179,
      "start": 1655.6200256347656,
      "end": 1658.1000366210938,
      "text": " to this particular instruction"
    },
    {
      "id": 180,
      "start": 1658.1000366210938,
      "end": 1659.8200378417969,
      "text": " that we're reading of in Leviticus 25."
    },
    {
      "id": 181,
      "start": 1659.8600158691406,
      "end": 1663.5400390625,
      "text": " If you look over at 2 Chronicles 36,"
    },
    {
      "id": 182,
      "start": 1663.5400390625,
      "end": 1666.4600219726562,
      "text": " notice, and we'll finish up here in just a few moments,"
    },
    {
      "id": 183,
      "start": 1666.4600219726562,
      "end": 1668.7000122070312,
      "text": " but I want you to notice what the Bible says"
    },
    {
      "id": 184,
      "start": 1668.7000122070312,
      "end": 1672.4200134277344,
      "text": " in 2 Chronicles 36 and verse 21."
    },
    {
      "id": 185,
      "start": 1674.9800109863281,
      "end": 1677.8600158691406,
      "text": " Remember, God gave them the instruction,"
    },
    {
      "id": 186,
      "start": 1677.8600158691406,
      "end": 1680.9800109863281,
      "text": " the emphasis upon faith and obedience."
    },
    {
      "id": 187,
      "start": 1682.02001953125,
      "end": 1684.260009765625,
      "text": " We do not see anywhere historically"
    },
    {
      "id": 188,
      "start": 1684.260009765625,
      "end": 1686.1400146484375,
      "text": " where they consistently obeyed the Lord"
    },
    {
      "id": 189,
      "start": 1686.1400146484375,
      "end": 1688.6200256347656,
      "text": " with regard to this instruction."
    },
    {
      "id": 190,
      "start": 1688.6200256347656,
      "end": 1691.1000366210938,
      "text": " God said, if you disobey, here's what's gonna happen"
    },
    {
      "id": 191,
      "start": 1691.1000366210938,
      "end": 1694.0600280761719,
      "text": " because my land will get its Sabbaths."
    },
    {
      "id": 192,
      "start": 1694.0600280761719,
      "end": 1696.3400268554688,
      "text": " In 2 Chronicles 36 and verse number 21,"
    },
    {
      "id": 193,
      "start": 1696.3400268554688,
      "end": 1698.5800170898438,
      "text": " the Bible says to fulfill the word of the Lord"
    },
    {
      "id": 194,
      "start": 1698.5800170898438,
      "end": 1700.9400329589844,
      "text": " by the mouth of Jeremiah"
    },
    {
      "id": 195,
      "start": 1700.9400329589844,
      "end": 1705.9400329589844,
      "text": " until the land had enjoyed her Sabbaths."
    },
    {
      "id": 196,
      "start": 1706.2200317382812,
      "end": 1707.7400207519531,
      "text": " For as long as she lay desolate,"
    },
    {
      "id": 197,
      "start": 1707.7400207519531,
      "end": 1712.5400390625,
      "text": " she kept Sabbath to fulfill threescore and 10 years."
    },
    {
      "id": 198,
      "start": 1712.5400390625,
      "end": 1714.7200317382812,
      "text": " We know that a remnant would return."
    },
    {
      "id": 199,
      "start": 1714.7200317382812,
      "end": 1717.760009765625,
      "text": " This evening, I understand we're not the children of Israel"
    },
    {
      "id": 200,
      "start": 1717.760009765625,
      "end": 1720.2000122070312,
      "text": " and we're not entering into a land."
    },
    {
      "id": 201,
      "start": 1720.2000122070312,
      "end": 1721.7200317382812,
      "text": " I understand that we're not planting"
    },
    {
      "id": 202,
      "start": 1721.7200317382812,
      "end": 1723.2000122070312,
      "text": " and reaping for six years"
    },
    {
      "id": 203,
      "start": 1723.2000122070312,
      "end": 1726.1600341796875,
      "text": " and then letting it sit for a rest for a seventh year."
    },
    {
      "id": 204,
      "start": 1726.1600341796875,
      "end": 1727.6800537109375,
      "text": " I understand that."
    },
    {
      "id": 205,
      "start": 1727.6800537109375,
      "end": 1729.5599975585938,
      "text": " But there are principles in the word of God"
    },
    {
      "id": 206,
      "start": 1729.5599975585938,
      "end": 1732.4800415039062,
      "text": " with regard to God's instruction,"
    },
    {
      "id": 207,
      "start": 1732.4800415039062,
      "end": 1735.8400268554688,
      "text": " God's commandments for us as the people of God."
    },
    {
      "id": 208,
      "start": 1737.7200317382812,
      "end": 1739.0400390625,
      "text": " The question that I would ask is,"
    },
    {
      "id": 209,
      "start": 1739.0400390625,
      "end": 1742.6400146484375,
      "text": " how are we doing in the area of obedience?"
    },
    {
      "id": 210,
      "start": 1742.6400146484375,
      "end": 1744.0800170898438,
      "text": " In the area of faith?"
    },
    {
      "id": 211,
      "start": 1745.0400390625,
      "end": 1748.9600219726562,
      "text": " If we were to be alive during this time,"
    },
    {
      "id": 212,
      "start": 1748.9600219726562,
      "end": 1751.2000122070312,
      "text": " during the time of the Exodus,"
    },
    {
      "id": 213,
      "start": 1751.2000122070312,
      "end": 1755.4000244140625,
      "text": " this great host of people that left the land of Egypt"
    },
    {
      "id": 214,
      "start": 1755.4000244140625,
      "end": 1759.2000122070312,
      "text": " and saw the mighty hand of God,"
    },
    {
      "id": 215,
      "start": 1759.2000122070312,
      "end": 1760.5599975585938,
      "text": " would we have asked,"
    },
    {
      "id": 216,
      "start": 1760.5599975585938,
      "end": 1762.2000122070312,
      "text": " as we use for our title this evening,"
    },
    {
      "id": 217,
      "start": 1762.2000122070312,
      "end": 1765.280029296875,
      "text": " what shall we eat the seventh year?"
    },
    {
      "id": 218,
      "start": 1765.280029296875,
      "end": 1766.8800048828125,
      "text": " Perhaps we would."
    },
    {
      "id": 219,
      "start": 1766.8800048828125,
      "end": 1769.6800537109375,
      "text": " But when we receive that promise of God,"
    },
    {
      "id": 220,
      "start": 1769.6800537109375,
      "end": 1771.2000122070312,
      "text": " would we embrace that promise?"
    },
    {
      "id": 221,
      "start": 1771.2000122070312,
      "end": 1775.4800415039062,
      "text": " Would we have faith and believe that God is able to do?"
    },
    {
      "id": 222,
      "start": 1776.6800537109375,
      "end": 1781.6800537109375,
      "text": " See, our God is able to provide water from a rock."
    },
    {
      "id": 223,
      "start": 1782.4400024414062,
      "end": 1783.800048828125,
      "text": " Amen?"
    },
    {
      "id": 224,
      "start": 1783.800048828125,
      "end": 1786.8800048828125,
      "text": " He's able to bring meat by a raven."
    },
    {
      "id": 225,
      "start": 1788.5599975585938,
      "end": 1790.2000122070312,
      "text": " Right?"
    },
    {
      "id": 226,
      "start": 1790.2000122070312,
      "end": 1791.0800170898438,
      "text": " He's able."
    },
    {
      "id": 227,
      "start": 1792.0800170898438,
      "end": 1794.2400512695312,
      "text": " And as we begin to think about our lives"
    },
    {
      "id": 228,
      "start": 1794.2400512695312,
      "end": 1797.0400390625,
      "text": " and the instruction of the word of God,"
    },
    {
      "id": 229,
      "start": 1797.0400390625,
      "end": 1799.6400146484375,
      "text": " oh, that we would just determine"
    },
    {
      "id": 230,
      "start": 1799.6400146484375,
      "end": 1801.2400512695312,
      "text": " that we're going to obey him."
    },
    {
      "id": 0,
      "start": 1801.2400512695312,
      "end": 1808.0800514221191,
      "text": " faith that God is able to do what he's promised to do. He's gonna take care of"
    },
    {
      "id": 1,
      "start": 1808.0800514221191,
      "end": 1814.5600509643555,
      "text": " us because he's a good God. He's promised to do so. All of his promises are yay."
    },
    {
      "id": 2,
      "start": 1814.5600509643555,
      "end": 1819.6000518798828,
      "text": " Amen? There's times, no doubt in your life, that you made a promise to someone."
    },
    {
      "id": 3,
      "start": 1819.6000518798828,
      "end": 1823.3600521087646,
      "text": " Anyone ever make a promise to someone and then you couldn't fulfill it? I"
    },
    {
      "id": 4,
      "start": 1823.3600521087646,
      "end": 1830.6000518798828,
      "text": " learned my lesson when Juliana was about two years old as a parent. I was working"
    },
    {
      "id": 5,
      "start": 1830.6000518798828,
      "end": 1835.0400505065918,
      "text": " and I told her, I know I've told the story before, I told her that on"
    },
    {
      "id": 6,
      "start": 1835.0400505065918,
      "end": 1839.4400520324707,
      "text": " Saturday we would go to the park and do X Y & Z and blah blah blah and so on and"
    },
    {
      "id": 7,
      "start": 1839.4400520324707,
      "end": 1842.6000518798828,
      "text": " so forth. She had been wanting to do it and it was kind of that time of year"
    },
    {
      "id": 8,
      "start": 1842.6000518798828,
      "end": 1845.1600494384766,
      "text": " where it gets dark early. You know when you go to work it's dark, when you come"
    },
    {
      "id": 9,
      "start": 1845.1600494384766,
      "end": 1849.6800498962402,
      "text": " home it's dark. That kind of almost what we're looking at right now. And I told"
    },
    {
      "id": 10,
      "start": 1849.6800498962402,
      "end": 1854.6400527954102,
      "text": " her on Saturday we'll do these things. And on Saturday it just poured and"
    },
    {
      "id": 11,
      "start": 1854.6400527954102,
      "end": 1859.7200508117676,
      "text": " poured and poured. It was just a terrible day. We couldn't go to the park. But I had"
    },
    {
      "id": 12,
      "start": 1859.7200508117676,
      "end": 1864.6000518798828,
      "text": " told Juliana I promise on Saturday we'll do it. And as a two, two and a half"
    },
    {
      "id": 13,
      "start": 1864.6000518798828,
      "end": 1870.0800476074219,
      "text": " year old girl she just said, but daddy you promised. I don't have any control"
    },
    {
      "id": 14,
      "start": 1870.0800476074219,
      "end": 1875.8800506591797,
      "text": " over the weather though. I mean like I can't I can't make it stop raining. But I"
    },
    {
      "id": 15,
      "start": 1875.8800506591797,
      "end": 1880.320053100586,
      "text": " learned a lesson then not to say I promise to do things that I can't make"
    },
    {
      "id": 16,
      "start": 1880.320053100586,
      "end": 1885.800048828125,
      "text": " good on that promise. But you understand that when God has promised to do"
    },
    {
      "id": 17,
      "start": 1885.800048828125,
      "end": 1893.8400497436523,
      "text": " something, he's able. He is able. We say as we look to this night, obviously"
    },
    {
      "id": 18,
      "start": 1893.8400497436523,
      "end": 1897.0000534057617,
      "text": " Wednesday night's our prayer time. We think about our prayer time here in just"
    },
    {
      "id": 19,
      "start": 1897.0000534057617,
      "end": 1900.200050354004,
      "text": " a moment. He is able to do exceeding abundantly above all that we ask or"
    },
    {
      "id": 20,
      "start": 1900.200050354004,
      "end": 1905.1200485229492,
      "text": " think. Ephesians 3 and verse number 20. That's our God. We just need to trust"
    },
    {
      "id": 21,
      "start": 1905.1200485229492,
      "end": 1910.4000549316406,
      "text": " him and obey him. We sing the song trust and obey. There's no other way to be"
    },
    {
      "id": 22,
      "start": 1910.4000549316406,
      "end": 1917.7600479125977,
      "text": " happy in Jesus but to trust and obey. Let's pray. Father we love you. We thank"
    },
    {
      "id": 23,
      "start": 1917.7600479125977,
      "end": 1921.2800521850586,
      "text": " you for loving us. We thank you for the opportunity to study your Word. This Old"
    },
    {
      "id": 24,
      "start": 1921.2800521850586,
      "end": 1929.0000534057617,
      "text": " Testament passage has specifics with regard to their preparation for entering"
    },
    {
      "id": 25,
      "start": 1929.0000534057617,
      "end": 1938.0800476074219,
      "text": " the land. But the principles of faith and obedience are so clear in this passage."
    },
    {
      "id": 26,
      "start": 1938.2400512695312,
      "end": 1948.3600463867188,
      "text": " I pray God that you would help us to obey you, to trust you, to have faith in what"
    },
    {
      "id": 27,
      "start": 1948.3600463867188,
      "end": 1952.3600463867188,
      "text": " only you could do. We thank you for the many promises that you've given us in"
    },
    {
      "id": 28,
      "start": 1952.3600463867188,
      "end": 1957.0800476074219,
      "text": " your Word. We pray God that you'd bless our time of prayer. We pray that you"
    },
    {
      "id": 29,
      "start": 1957.0800476074219,
      "end": 1961.7200469970703,
      "text": " would encourage us and strengthen us and we'll thank you for it. In Christ's name"
    },
    {
      "id": 30,
      "start": 1961.7200469970703,
      "end": 1965.2000579833984,
      "text": " we pray. Amen."
    }
  ],
  "processed_at": "2025-04-17T08:44:12.603774"
}