{
  "video_id": "JwkVB_xWwdI",
  "text": "This evening mark chapter number six as you're turning there. Happy anniversary to Holly tomorrow We get to celebrate 19 years of marriage. Amen, and Praise the Lord next year is a big year 20 and so very thankful for that we celebrate at nine years of ministry here just a couple of weeks ago and very thankful for God's blessing and Whoso findeth a wife findeth a good thing Amen, and I am so thankful for Holly and for the blessing that she's been to me mark chapter number six I'm gonna read a couple of verses of Scripture and Then we're gonna dig in I'm gonna look at a number of passages here between Matthew and Mark and look at a passage in Luke and deal with the subject matter this evening gonna be more of a topical study I'll let you know that right in advance, but mark chapter number six I just want to look at verse five and six look at verse four with me It says this but Jesus said unto them a prophet is not without honor but in his own country and among his own kin and his own house this verse number five and He couldn't could there do no mighty works save that he laid his hands upon a few sick folk and healed them and then notice this statement in verse number six and He marveled because of their unbelief And he went round about the villages Teaching and He marveled Because of their unbelief This evening. I want to preach a message that I've simply entitled he marveled because of their unbelief It's interesting as you study the life and ministry of the Lord Jesus Christ through the gospel records We have the opportunity to see him interacting with a number of folks In fact, obviously as you study the Gospels you see much interaction with the disciples but you find that as Jesus traveled through the Holy Land and as he went from city to city to village to village as he During those three and a half or so years of ministry public ministry the interactions that he had and the gospel records record for us Some of those interactions and it's really interesting as you would consider what it is that the Lord said on a number of different occasions with regard to the faith of Some of those that he interacted with Hold your place here in Mark because we're gonna come back here But turn over to the book of Matthew if you will in Matthew chapter number 8 in Matthew chapter number 8 really the first several verses verse number 5 down through around verse number 13 or so We see that there's a a record here given of this miracle that took place and it's with this Centurion and in Matthew 8 in verse number 10 as Jesus is interacting with this centurion I want you to see what the Bible says in verse number 10. It says when Jesus heard it notice this he marveled We just saw that same word in Mark chapter number 6 here in Matthew chapter number 8 It says that he marveled and said unto them that followed Verily I say unto you notice where he said I Have not found so great faith No Not in Israel. Now, that's a good statement. Amen I mean, that's a statement in which we see that the Lord Jesus Christ he marveled when he heard these things and he says as response to that which he has heard to that which he's Dealing with with the centurion. He says verily of a truth. I say unto you I have not found I have found not excuse me. So great faith. No not in Israel Matthew chapter number 8 we see that with the centurion look at the latter part of Matthew chapter number 8 not all the way at the end but just skip down a couple of Passages there and come to verse number 23 through 27. I won't read all of it but in this particular passage of Scripture we see that the disciples were instructed to get into a boat and They were instructed to cross over and they encountered a great storm And I want you to see what Jesus says to them in verse number 26 after they came to him waking him up saying Lord Save us we perish. He says this in Matthew 8 in verse number 26. Why are you? fearful oh ye of little faith Why are you fearful? Oh ye of little faith in Mark chapter number 4 The record is given from Mark's perspective With regard to the same event and it's interesting for in Mark chapter number 4 The way in which Mark would record it is that he says here. Why are you so fearful? How is it that you have? no faith How is it that you have? no faith In Matthew chapter number 15, I preached this passage of Scripture on Mother's Day this year and this is a Record that God gives us of the interaction that Jesus had with this distraught mother And as we looked at this passage of Scripture We made reference to that which Jesus said concerning her faith and it's recorded in Matthew 15 in verse number 28 Then Jesus answered and said unto her. Oh woman great is thy faith Great is thy faith And so in these few examples that we've seen we see of the centurion and we see of the distraught mother That that the Lord Jesus Christ God in flesh is saying I have not found so great faith No, not in Israel with regard to the centurion when he's referring to this distraught mother He says great is thy faith to the disciples after they had seen many things and yet during the time of the storm He says how is it that you have no faith? Oh ye of little faith Reminds me of what the Lord said to Moses back in numbers chapter 14 You'll remember with me the record you don't need to turn there but in numbers 13 God instructs Moses to send the spies and We know we sing about 12 men went to spy on Canaan Right the kids do the whole hand motions 10 were bad and two were good And we know as we read that passage of Scripture that as you near the end of chapter number 13 they return from spying out the land and they bring that report and you enter into the 14th chapter and you see that Joshua and Caleb are Contending with the people because God is able And yes, they they do not deny that they're fortified cities They do not deny that there are giants in the land But they say our God is greater our God has said that he will bring us into this land and they have a faith full report But in numbers chapter 14 in verse number 11 God is speaking to Moses and he says this the Lord said unto Moses How long will this people provoke me and how long will it be air? They believe me For all the signs which I have showed Among them, you know, God wants his people to believe him Let me ask you this evening Not only those that are here, but those that are watching on live stream this evening as we consider the subject matter Do you like it when people believe you? You want to be trustworthy, right if you tell someone that you're gonna do it and they have to ask you 105 times if you're really gonna do it. Does that kind of annoy you I Told you I was gonna do it right now The reality is that sometimes we say that we're gonna do something and then we are hindered from doing it Does it ever happen to you? Maybe you have to send an email a text message a phone call and say hey listen I know that I said I was gonna be there. I said I was gonna do this but something came up and I'm sorry I can't be there. I can't do this. Whatever it might be God is the name El Shaddai the Lord God Almighty He he said is anything too hard for me? He said that he's able to do exceeding abundantly above all that we ask or think There's never a time when God is not going to do what he said. He's gonna do Amen, you believe that this evening. I believe that with all of my heart That God is going to do what he said he was going to do In fact, I believe that God has in a certain sense from a certain perspective He has bound himself to do that which is recorded within his word Amen He's bound by his word Luke says in Luke 18 in verse number 8 Nevertheless when the Son of Man cometh Shall he find faith on the earth Shall he find faith on the earth? There's a truth that's in the Old Testament is repeated in the New Testament. The just shall live by Faith right the just shall live by faith What is faith? Faith is taking God of his word That's the the most simple definition. I could give you for faith is believing God I believe that as we look at the scriptures and we see when God asked that question to to Moses when he said how long Will it be e'er they believe me that they'll have faith that I will do what I said that I will do It doesn't matter how big the the inhabitants of the land are it doesn't matter how fortified the cities are. I Said I was gonna bring you into the land And by the way, he says how long will it be e'er they believe me for all the signs which I have showed among them They had had the opportunity to see God do some mighty things Had they not in Egypt land you read of the ten plagues Not only did the children of Israel Israel have the opportunity to see that, but we see that the very servants of Pharaoh saw that and recognized and declared to Pharaoh, this is the finger of God. They said to Pharaoh, how long? I mean, do you not see all the things that are destroyed? I mean, how long are we going to endure this? I think about some of the great passages of Scripture that we have. What a joy that God has given us the complete word, the canon of Scripture, that we have the privilege of not only reading these wonderful accounts, but then even in our lives we have the opportunity to recognize how God has worked and what God has done on our behalf and how he's proven over and over to be faithful, to be trustworthy, to be dependable. And this evening, the question in Luke 18, when the Son of Man cometh, shall he find faith on the earth? We're mindful of the verse of Scripture that we often quote. In fact, here in just a few weeks in our study in the book of Hebrews on Sunday morning, we'll enter into the 11th chapter, the hall of faith chapter, as many have referred to it as. We'll read that wonderful verse of Scripture in verse number 6, but without faith it is impossible to please him. For he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him. So we think about this subject matter of faith and unbelief. I preached a series actually several years ago on Sunday morning that I entitled Increase Our Faith, and we looked at a number of passages of Scripture throughout the Word of God that God could use in our lives as being faith builders. The disciples say to the Lord in Luke 17 in verse number 5, they say, Lord, increase our faith. And we studied for an entire year on Sunday mornings various passages of Scripture on how we could have our faith increased, and I often said this during that particular series, that if faith is a flower, then doubt or unbelief is a weed. And if we want the flower to grow, we got to deal with the weeds. Amen? I don't have a garden. We have some flower beds here at church. In fact, Dean and his mom were here this afternoon pulling weeds. And Mrs. Sparks mentioned to me that I wish the flowers at my house grew as well as the weeds at church grow. How many of you have seen it to be so that the weeds seem to grow very well? But if faith is a flower, then doubt or unbelief is a weed and needs to be dealt with. Because what do the weeds do? They choke out the flowers. Do they not? I read just last week about a Canadian thistle, and they mentioned that just the depth at which the root system of this thistle can go, not only the depth in which it can go, but how far out it can spread. And in just an acre of property, if there's simply five of those thistle plants, it can reduce the yield of that acre by nearly 25%. That's amazing. That's how weeds work. So this evening we got to deal with the subject of unbelief. Back in Mark chapter number 6 and verses 5 and 6, we see that the Bible says in verse number 6, and he marveled because of their unbelief. I'll be honest with you this evening, I like the passages where it says that he marveled at their faith. Amen? I'd much rather it be that God is marveling at our faith and saying, look at how great faith they have, rather than being in a situation where he's marveling at our unbelief. This evening, number one, if you're taking notes, we must learn to recognize unbelief. Learn to recognize it in your life. Listen, you're never gonna confess it, you're never gonna deal with it, you're gonna just ignore it if you're not learning how to recognize it. Have you ever had a situation, again I don't have a garden, but if you're in a situation, there are times, in fact, even with the flower beds here at church, that you'll go over and you'll say, now is that a flower or a weed? Because maybe you're not sure. Is it a flower or is it a weed? Right? We've been in that position, we've been in that situation, we're not sure what this is. And when we look at the subject matter of faith and unbelief, we need to learn how to recognize it. I marvel at what the, just a few chapters later in Mark chapter 9, I think about this father that is referenced here, and you see about the father and how he would be distraught because of the the situation in which the son was faced with. And Jesus says to him, if thou canst believe, all things are possible to him that believeth, in verse number 23 of Mark 9. And you know what that man cries out, the father of the child cried out, Lord I believe, help thou mine unbelief. So we need to learn how to recognize unbelief. We need to learn how to recognize when I'm doubting, when I'm not trusting, when I'm not exercising faith, when I'm not living by faith. I'm not trusting God. I'm thinking somehow that God is not able to intervene in my situation. Well you just don't know how bad it is for me, or you don't know how this situation is. I recently was asked a question, I won't go into all the details because it would take way too much time, but I was asked a question about something that happened historically, not biblically, but something historically that happened back in the 20th century. And there's a question that was posed with regard to the behavior and whether it was right or wrong. And we began to have interaction, one with another, as we were discussing the particular subject matter. And I concluded this, that when we make decisions to manipulate the situation, to intervene our own way, and to try to solve the problem ourselves, that really we're limiting what God is able to do. We're limiting what God is able to do. Because we say in unbelief, well I got to do this because this is gonna happen if I don't do this. What about God? What is he able to do? I'm thankful that Shadrach, Meshach, and Abednego didn't live that way. You know why? We wouldn't have Daniel to read about that situation. I'm thankful that Daniel didn't act that way. We wouldn't have, that's Daniel 3, then you look at Daniel 6 and the den of lions. We wouldn't have it to read. We begin to look at these various, aren't you thankful that David didn't act that way? He believed God. He believed that God was able. He exercised faith. This evening we need to learn how to recognize unbelief. This evening, I believe, number two, we need to understand the results of unbelief. The results of unbelief. Notice what it said in verse number five of Mark 6, and he could there do no mighty works. Matthew records it this way in Matthew 13 and verse 58, and he did not many mighty works there because of their unbelief. You know what the people missed out on? They missed out on God working. They missed out on seeing what only God could do. Now the passage tells us here in Mark 6 and verse number 5, save that he laid his hands upon a few sick folk and healed them. Now that's amazing to me. That's almost as close as amazement as when Genesis 1 says, and he made the stars also, right? Because it's no minor thing for him to heal some folks, but what we understand by what Matthew and Mark both revealed to us in these passages of Scripture with regard to what he was able to do is that there was so much more that he could have done if they believed. If they believed. Right? So what are the results of unbelief? You know what the results were? They missed out on seeing God work. I don't want to miss out on seeing God work. I mean when you read of some of the the Bible passages and you read of some of the miraculous things, the mighty works that God has done, do you long to see God work in that fashion? When you read of the things that God has done through church history, we can read many accounts of folks that served God and lived for God and lived by faith and faced just terrible situations and yet they trusted God and God worked. God delivered. God blessed. And they could stand back and they could say, look at what God did. Not look at how we managed the situation, but look at what God did. I want to see God work. I won't ask you to show me your hands if you're reading through the devotional book that we distributed this year in 2020. Revival Today is the title of that book and it has a daily devotion and it has a passage of scripture and then some type of historical event that happened and many times as you read throughout those accounts you read of miraculous things that God has done. Do you believe that God can still work in 2020? I do. His hand is not short. He's not lost any of His power. He is still the Lord God Almighty. He still reigns. Amen? The Lord God Omnipotent reigneth. That's what Revelation tells us. Think about the results of unbelief for the children of Israel in Numbers 14. We read how that God said to Moses, how long is it going to be ere they believe Me? And then later in the passage in v. 23-24 of Numbers 14, the Bible says, \"...surely they shall not see the land which I swear unto their fathers, neither shall any of them that provoked Me see it.\" Wow. What'd they do? They wandered in the wilderness. And they died. Is that right? That's what happened. Is that a pretty high price to pay? That's bad. They didn't get to see what God had promised them. I mean, they were on the edge of entering into the land. In fact, those ten spies that did go into the land and spy it out, they never got to see it. Never got to go and enter into it with the nation of Israel. Save Joshua and Caleb. Joshua and Caleb. I think about Joshua and Caleb often. I think about how those 40 years must have been. They were delayed from seeing what God had promised because of the unbelief of the nation. But I think that Joshua and Caleb kept their focus proper. And they were yearning and longing to get back to that land to see how God would do it. How's God going to give us this land? What is He going to do? We studied the book of Joshua this year. It's amazing, is it not? They got to see God work. Understand this evening as we close tonight, not only is it important that we learn to recognize unbelief, not only should we understand the results of unbelief, but finally this evening we need to understand the remedy for unbelief. The remedy. Simple. Romans 10.17 So then faith cometh by hearing, and hearing by the Word of God. I cannot overemphasize the importance of this book in the life of every believer. It's impossible for me to overemphasize the importance of it. Because the reality is that it's by this book that God tells us that our faith is increased. So then faith cometh by hearing, and hearing by the Word of God. As we study the Scriptures, I wonder this evening, when you face a difficulty, when you face a trial in your life, how many passages of Scripture can God bring back to your memory that increases your faith because you've understood what God is able to do? Because you've read it, you've studied it, you've learned it, you're aware of it, you're interacting with it, and God is increasing your faith. There's a sad commentary in the book of Psalms in the 78th chapter. If you read Psalm 78, you really have the opportunity, we're not even gonna go there, but you have the opportunity to read through really a lot of the history of the nation of Israel. It's really just an overview, obviously. It is a lengthy psalm. It's obviously not the longest psalm, but it is a lengthy psalm. And it quickly goes through several high points of the history of the nation of Israel and several things that are contained therein. But you come to verse number 41 of that passage of Scripture, and the Bible says this, that they limited the Holy One of Israel. I'm not sure if you can wrap your mind around that this evening. It's very challenging for me, actually, to fully comprehend how you can limit a limitless God. He's the Lord God omnipotent, is He not? But you know how they limited Him? Because they doubted. Because of their unbelief. And they limited the Holy One of Israel. You can read other psalms, and you can read other portions of Scripture, and you can see how that God would share the truth of how many things He was planning to do or He was able to do for them, but they would not believe Him. They did not submit to them. They did not trust in Him, and therefore they did not, as they would not hearken to His voice, they did not see Him work in the way in which He could. I won't read it, but reference in your notes perhaps this evening Psalm 81. And read what God says that He could do for the nation of Israel for His people, but they wouldn't hearken unto His voice. It's amazing to me what God did for the nation of Judah when the Assyrians were coming to attack. We're aware of the way in which the Assyrians took captive the nation of Israel, the ten tribes of the north. In fact, the Assyrians as the world power at that particular time, they had conquered many groups of people. Sennachrab and Rabshakka, they come to Judah. And Hezekiah is the king. Rabshakka says, don't trust Hezekiah. He's telling you to trust God. What about all these other people groups that we conquered? And what about all of their gods? There's something interesting that Hezekiah recognized. They were all idols. But Hezekiah and the nation of Judah served the Lord God, Jehovah. You know what Hezekiah did? He took those letters and he laid them out before God. And he prayed. Isaiah is the prophet at the time if you look historically and you can go back and forth. In fact, you can read it in Isaiah as well, how that Isaiah brings a message back to him. He says, don't be afraid of them. God's gonna deal with them. You know, God dealt with them. They didn't even have to, they didn't have to raise a sword. God dealt with them. You say that was then. I'm the Lord, I change not. Our God is able. I understand that He's able to do exceeding abundantly above all that we ask or think. I believe that. Paul prays that. In fact, I'm mindful of what James says in James chapter number five, when he says that the effectual fervent prayer of a righteous man availeth much. And then he uses the example of Elijah praying. And he says that he's like passion. Elijah was a man like we're men, human beings. And yet he prayed and it did not rain for the space of three and a half years, right? You read it, 1 Kings 17. And then he prayed again and guess what? It rained. And James, near the end of the New Testament canon, says to us as New Testament believers that the effectual fervent prayer of a righteous man availeth much. You know what praying is? Exercising faith. Inviting God to work in the circumstances of our lives. Recognizing our own inabilities and not seeking to scheme and plan and devise and figure out how we're gonna do it. No, God, we're trusting you. We know that you're able. We know that you're sovereign. The Bible says that he marveled because of their unbelief. He marveled because of their unbelief. Yet we read of the centurion. He marveled and said, verily I say unto you, I have not found so great faith, no, not in Israel. What'd that centurion say? He said, Jesus, you don't even have to come to my house to heal. Because I know the power that I have. I say do this and do that and they do it. And I recognize that you're God and so you don't even have to come to my house and heal. It distances no matter for you. You read it in Matthew 8. That's what he deals with. We serve a great God. I wanna read to you this wonderful hymn. You're familiar with it. Tis so sweet to trust in Jesus. The songwriter said, tis so sweet to trust in Jesus. Notice this, just to take him at his word. Just to rest upon his promise. Just to know, thus saith the Lord. Oh, how sweet to trust in Jesus. Just to trust his cleansing blood. Just in simple faith to plunge me neath the healing, cleansing flood. Yes, tis sweet to trust in Jesus. Just from sin and self to cease. Just from Jesus simply taking life and rest and joy and peace. I'm so glad I learned to trust thee. Precious Jesus, Savior, friend. And I know that thou art with me, wilt be with me to the end. Jesus, Jesus, how I trust him. Notice this, how I've proved him. or and or. Jesus, Jesus, precious Jesus, oh for grace to trust Him more. This evening, I'm sure that many of us that are gathered, in fact many that are watching via live stream, have trusted the Lord Jesus Christ as their personal Savior. We're trusting Him for eternity, but for some reason we have such difficulty trusting Him for tomorrow. Isn't it true? Honestly, I believe God's trying to help somebody. I believe He's helped me. He wants to help us to trust Him. Oh for grace to trust Him more. That's the last tagline of that chorus, but I think about what it says in the beginning there, or at the end of that last verse, how I've proved Him or and or. You know what God says in Malachi? He says, prove me, prove me, and see if I won't do this. Go and read it, Malachi. God says, prove me. What's He saying? I'll do what I said I will do, but see for us as God's people, we need to learn to trust Him. We deal with this situation of unbelief. We do, all of us do. We need to learn how to recognize it. We need to understand what the results of it are, and then we need to understand what the remedy is. The remedy is getting into this book. Oh God, increase my faith. I believe that you said faith cometh by hearing and hearing by your Word, and so I want to sit under the sound of the preaching the Word of God. I want to get into the Word of God every day of my life, because I want my faith to be increased. Because without faith, it's impossible to please Him. Remember, the just shall live by faith. If Jesus were to come to your house, if Jesus were to come to our church, would He marvel because of our unbelief, or would He marvel because we have great faith? Would He marvel because of our unbelief, or would He marvel because of our great faith? I hope this evening that you want to see God work, and that you believe that He still can. He's still on His throne. Amen? Let's pray. Father, we love you. Thank you so much for loving us. Thank you for your Word. Thank you for how your Word convicts us, challenges us, changes us, comforts us. We understand this evening that you've said that your Word is profitable. God, I believe that you desire to help your people through your Word. Fathers, we have had the opportunity this evening to examine several interactions that our Lord and Savior had with people when He walked upon this earth, and statements that He made with regard to their faith. I pray tonight that we've been challenged, and that we've been helped. God, I pray that you'd help us to be a people that trust you. Help us to be a people that live by faith. Help us to run to your Word, dig in, feast upon. It's not going to work to just have a little verse here and there. You need to feast upon the Word of God so that our faith would be increased. I pray, God, that you would help us as we enter into our prayer time. We thank you for the privilege of prayer. We pray that you'd work mightily. God, that we'd have the opportunity to see you do what only you can do, that you alone would be glorified. Well, thank you for the work that you'll do. For it's in Christ's name we pray, amen. I invite you to take your prayer bulletin this evening.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.920000076293945,
      "text": " This evening mark chapter number six as you're turning there. Happy anniversary to Holly tomorrow"
    },
    {
      "id": 1,
      "start": 5.920000076293945,
      "end": 9.479999542236328,
      "text": " We get to celebrate 19 years of marriage. Amen, and"
    },
    {
      "id": 2,
      "start": 10.199999809265137,
      "end": 12.199999809265137,
      "text": " Praise the Lord next year is a big year"
    },
    {
      "id": 3,
      "start": 12.5600004196167,
      "end": 15.199999809265137,
      "text": " 20 and so very thankful for that"
    },
    {
      "id": 4,
      "start": 15.199999809265137,
      "end": 21.079999923706055,
      "text": " we celebrate at nine years of ministry here just a couple of weeks ago and very thankful for God's blessing and"
    },
    {
      "id": 5,
      "start": 22.520000457763672,
      "end": 24.84000015258789,
      "text": " Whoso findeth a wife findeth a good thing"
    },
    {
      "id": 6,
      "start": 24.84000015258789,
      "end": 31.0,
      "text": " Amen, and I am so thankful for Holly and for the blessing that she's been to me mark chapter number six"
    },
    {
      "id": 7,
      "start": 31.0,
      "end": 33.0,
      "text": " I'm gonna read a couple of verses of Scripture and"
    },
    {
      "id": 8,
      "start": 33.31999969482422,
      "end": 35.599998474121094,
      "text": " Then we're gonna dig in I'm gonna look at a number of"
    },
    {
      "id": 9,
      "start": 35.880001068115234,
      "end": 41.939998626708984,
      "text": " passages here between Matthew and Mark and look at a passage in Luke and deal with the subject matter this evening gonna be more of"
    },
    {
      "id": 10,
      "start": 41.939998626708984,
      "end": 43.599998474121094,
      "text": " a topical study"
    },
    {
      "id": 11,
      "start": 43.599998474121094,
      "end": 46.68000030517578,
      "text": " I'll let you know that right in advance, but mark chapter number six"
    },
    {
      "id": 12,
      "start": 46.68000030517578,
      "end": 50.040000915527344,
      "text": " I just want to look at verse five and six look at verse four with me"
    },
    {
      "id": 13,
      "start": 50.040000915527344,
      "end": 53.599998474121094,
      "text": " It says this but Jesus said unto them a prophet is not without honor"
    },
    {
      "id": 14,
      "start": 53.63999938964844,
      "end": 57.279998779296875,
      "text": " but in his own country and among his own kin and his own house"
    },
    {
      "id": 15,
      "start": 58.040000915527344,
      "end": 60.040000915527344,
      "text": " this verse number five and"
    },
    {
      "id": 16,
      "start": 60.47999954223633,
      "end": 64.5199966430664,
      "text": " He couldn't could there do no mighty works"
    },
    {
      "id": 17,
      "start": 65.55999755859375,
      "end": 73.19999694824219,
      "text": " save that he laid his hands upon a few sick folk and healed them and then notice this statement in verse number six and"
    },
    {
      "id": 18,
      "start": 74.76000213623047,
      "end": 78.27999877929688,
      "text": " He marveled because of their unbelief"
    },
    {
      "id": 19,
      "start": 79.83999633789062,
      "end": 82.12000274658203,
      "text": " And he went round about the villages"
    },
    {
      "id": 20,
      "start": 83.04000091552734,
      "end": 84.76000213623047,
      "text": " Teaching and"
    },
    {
      "id": 21,
      "start": 84.76000213623047,
      "end": 86.76000213623047,
      "text": " He marveled"
    },
    {
      "id": 22,
      "start": 87.16000366210938,
      "end": 89.16000366210938,
      "text": " Because of their unbelief"
    },
    {
      "id": 23,
      "start": 89.16000366210938,
      "end": 94.81999969482422,
      "text": " This evening. I want to preach a message that I've simply entitled he marveled because of their unbelief"
    },
    {
      "id": 24,
      "start": 95.4800033569336,
      "end": 100.08000183105469,
      "text": " It's interesting as you study the life and ministry of the Lord Jesus Christ through the gospel records"
    },
    {
      "id": 25,
      "start": 100.08000183105469,
      "end": 103.73999786376953,
      "text": " We have the opportunity to see him interacting with a number of folks"
    },
    {
      "id": 26,
      "start": 104.4800033569336,
      "end": 109.54000091552734,
      "text": " In fact, obviously as you study the Gospels you see much interaction with the disciples"
    },
    {
      "id": 27,
      "start": 109.62000274658203,
      "end": 117.18000030517578,
      "text": " but you find that as Jesus traveled through the Holy Land and as he went from city to city to village to village as he"
    },
    {
      "id": 28,
      "start": 117.62000274658203,
      "end": 125.12000274658203,
      "text": " During those three and a half or so years of ministry public ministry the interactions that he had and the gospel records record for us"
    },
    {
      "id": 29,
      "start": 125.66000366210938,
      "end": 130.33999633789062,
      "text": " Some of those interactions and it's really interesting as you would consider"
    },
    {
      "id": 30,
      "start": 130.94000244140625,
      "end": 136.33999633789062,
      "text": " what it is that the Lord said on a number of different occasions with regard to the faith of"
    },
    {
      "id": 31,
      "start": 136.6199951171875,
      "end": 138.6199951171875,
      "text": " Some of those that he interacted with"
    },
    {
      "id": 32,
      "start": 139.22000122070312,
      "end": 141.82000732421875,
      "text": " Hold your place here in Mark because we're gonna come back here"
    },
    {
      "id": 33,
      "start": 141.82000732421875,
      "end": 147.86000061035156,
      "text": " But turn over to the book of Matthew if you will in Matthew chapter number 8 in Matthew chapter number 8 really the first several"
    },
    {
      "id": 34,
      "start": 147.94000244140625,
      "end": 149.94000244140625,
      "text": " verses verse number 5 down through"
    },
    {
      "id": 35,
      "start": 150.6999969482422,
      "end": 152.3800048828125,
      "text": " around verse number 13 or so"
    },
    {
      "id": 36,
      "start": 152.3800048828125,
      "end": 157.5800018310547,
      "text": " We see that there's a a record here given of this miracle that took place and it's with this"
    },
    {
      "id": 37,
      "start": 158.10000610351562,
      "end": 163.66000366210938,
      "text": " Centurion and in Matthew 8 in verse number 10 as Jesus is interacting with this centurion"
    },
    {
      "id": 38,
      "start": 163.66000366210938,
      "end": 169.82000732421875,
      "text": " I want you to see what the Bible says in verse number 10. It says when Jesus heard it notice this he marveled"
    },
    {
      "id": 39,
      "start": 169.97999572753906,
      "end": 175.25999450683594,
      "text": " We just saw that same word in Mark chapter number 6 here in Matthew chapter number 8"
    },
    {
      "id": 40,
      "start": 175.25999450683594,
      "end": 177.66000366210938,
      "text": " It says that he marveled and said unto them that followed"
    },
    {
      "id": 41,
      "start": 178.4600067138672,
      "end": 180.6999969482422,
      "text": " Verily I say unto you notice where he said I"
    },
    {
      "id": 42,
      "start": 181.5399932861328,
      "end": 183.5399932861328,
      "text": " Have not found"
    },
    {
      "id": 43,
      "start": 183.5399932861328,
      "end": 185.5399932861328,
      "text": " so great faith"
    },
    {
      "id": 44,
      "start": 185.89999389648438,
      "end": 187.02000427246094,
      "text": " No"
    },
    {
      "id": 45,
      "start": 187.02000427246094,
      "end": 190.5800018310547,
      "text": " Not in Israel. Now, that's a good statement. Amen"
    },
    {
      "id": 46,
      "start": 190.5800018310547,
      "end": 194.02000427246094,
      "text": " I mean, that's a statement in which we see that the Lord Jesus Christ"
    },
    {
      "id": 47,
      "start": 194.02000427246094,
      "end": 200.74000549316406,
      "text": " he marveled when he heard these things and he says as response to that which he has heard to that which he's"
    },
    {
      "id": 48,
      "start": 201.17999267578125,
      "end": 207.5,
      "text": " Dealing with with the centurion. He says verily of a truth. I say unto you I have not found"
    },
    {
      "id": 49,
      "start": 207.6199951171875,
      "end": 213.6999969482422,
      "text": " I have found not excuse me. So great faith. No not in Israel"
    },
    {
      "id": 50,
      "start": 214.33999633789062,
      "end": 220.13999938964844,
      "text": " Matthew chapter number 8 we see that with the centurion look at the latter part of Matthew chapter number 8 not all the way at"
    },
    {
      "id": 51,
      "start": 220.17999267578125,
      "end": 222.17999267578125,
      "text": " the end but just skip down a couple of"
    },
    {
      "id": 52,
      "start": 222.17999267578125,
      "end": 226.6199951171875,
      "text": " Passages there and come to verse number 23 through 27. I won't read all of it"
    },
    {
      "id": 53,
      "start": 226.6199951171875,
      "end": 228.6199951171875,
      "text": " but in this particular passage of Scripture"
    },
    {
      "id": 54,
      "start": 228.6199951171875,
      "end": 231.66000366210938,
      "text": " we see that the disciples were instructed to get into a boat and"
    },
    {
      "id": 55,
      "start": 231.89999389648438,
      "end": 235.5,
      "text": " They were instructed to cross over and they encountered a great storm"
    },
    {
      "id": 56,
      "start": 235.5,
      "end": 242.22000122070312,
      "text": " And I want you to see what Jesus says to them in verse number 26 after they came to him waking him up saying Lord"
    },
    {
      "id": 57,
      "start": 242.22000122070312,
      "end": 249.10000610351562,
      "text": " Save us we perish. He says this in Matthew 8 in verse number 26. Why are you?"
    },
    {
      "id": 58,
      "start": 249.5399932861328,
      "end": 250.97999572753906,
      "text": " fearful oh"
    },
    {
      "id": 59,
      "start": 250.97999572753906,
      "end": 252.5,
      "text": " ye of"
    },
    {
      "id": 60,
      "start": 252.5,
      "end": 254.17999267578125,
      "text": " little faith"
    },
    {
      "id": 61,
      "start": 254.17999267578125,
      "end": 259.6199951171875,
      "text": " Why are you fearful? Oh ye of little faith in"
    },
    {
      "id": 62,
      "start": 260.6199951171875,
      "end": 262.6199951171875,
      "text": " Mark chapter number 4"
    },
    {
      "id": 63,
      "start": 263.29998779296875,
      "end": 265.6199951171875,
      "text": " The record is given from Mark's perspective"
    },
    {
      "id": 64,
      "start": 266.5400085449219,
      "end": 271.1400146484375,
      "text": " With regard to the same event and it's interesting for in Mark chapter number 4"
    },
    {
      "id": 65,
      "start": 271.3800048828125,
      "end": 277.7799987792969,
      "text": " The way in which Mark would record it is that he says here. Why are you so fearful?"
    },
    {
      "id": 66,
      "start": 277.7799987792969,
      "end": 279.7799987792969,
      "text": " How is it that you have?"
    },
    {
      "id": 67,
      "start": 279.7799987792969,
      "end": 281.29998779296875,
      "text": " no faith"
    },
    {
      "id": 68,
      "start": 281.29998779296875,
      "end": 283.29998779296875,
      "text": " How is it that you have?"
    },
    {
      "id": 69,
      "start": 283.7799987792969,
      "end": 285.7799987792969,
      "text": " no faith"
    },
    {
      "id": 70,
      "start": 286.5,
      "end": 292.4599914550781,
      "text": " In Matthew chapter number 15, I preached this passage of Scripture on Mother's Day this year and"
    },
    {
      "id": 71,
      "start": 293.82000732421875,
      "end": 295.0199890136719,
      "text": " this is a"
    },
    {
      "id": 72,
      "start": 295.0199890136719,
      "end": 299.3399963378906,
      "text": " Record that God gives us of the interaction that Jesus had with this distraught mother"
    },
    {
      "id": 73,
      "start": 299.94000244140625,
      "end": 302.6199951171875,
      "text": " And as we looked at this passage of Scripture"
    },
    {
      "id": 74,
      "start": 302.6199951171875,
      "end": 308.6600036621094,
      "text": " We made reference to that which Jesus said concerning her faith and it's recorded in Matthew 15 in verse number 28"
    },
    {
      "id": 75,
      "start": 308.739990234375,
      "end": 313.739990234375,
      "text": " Then Jesus answered and said unto her. Oh woman great is thy faith"
    },
    {
      "id": 76,
      "start": 314.4599914550781,
      "end": 315.739990234375,
      "text": " Great is thy faith"
    },
    {
      "id": 77,
      "start": 315.739990234375,
      "end": 321.4200134277344,
      "text": " And so in these few examples that we've seen we see of the centurion and we see of the distraught mother"
    },
    {
      "id": 78,
      "start": 321.6600036621094,
      "end": 327.6199951171875,
      "text": " That that the Lord Jesus Christ God in flesh is saying I have not found so great faith"
    },
    {
      "id": 79,
      "start": 327.6199951171875,
      "end": 332.3800048828125,
      "text": " No, not in Israel with regard to the centurion when he's referring to this distraught mother"
    },
    {
      "id": 80,
      "start": 332.3800048828125,
      "end": 339.6199951171875,
      "text": " He says great is thy faith to the disciples after they had seen many things and yet during the time of the storm"
    },
    {
      "id": 81,
      "start": 339.6199951171875,
      "end": 343.8599853515625,
      "text": " He says how is it that you have no faith? Oh ye of little faith"
    },
    {
      "id": 82,
      "start": 344.8599853515625,
      "end": 350.5,
      "text": " Reminds me of what the Lord said to Moses back in numbers chapter 14"
    },
    {
      "id": 83,
      "start": 350.5,
      "end": 353.739990234375,
      "text": " You'll remember with me the record you don't need to turn there"
    },
    {
      "id": 84,
      "start": 353.739990234375,
      "end": 358.1400146484375,
      "text": " but in numbers 13 God instructs Moses to send the spies and"
    },
    {
      "id": 85,
      "start": 359.0199890136719,
      "end": 362.4800109863281,
      "text": " We know we sing about 12 men went to spy on Canaan"
    },
    {
      "id": 86,
      "start": 362.6199951171875,
      "end": 366.3800048828125,
      "text": " Right the kids do the whole hand motions 10 were bad and two were good"
    },
    {
      "id": 87,
      "start": 366.7799987792969,
      "end": 372.260009765625,
      "text": " And we know as we read that passage of Scripture that as you near the end of chapter number 13"
    },
    {
      "id": 88,
      "start": 372.260009765625,
      "end": 379.0199890136719,
      "text": " they return from spying out the land and they bring that report and you enter into the 14th chapter and you see that Joshua and"
    },
    {
      "id": 89,
      "start": 379.0199890136719,
      "end": 380.2200012207031,
      "text": " Caleb are"
    },
    {
      "id": 90,
      "start": 380.2200012207031,
      "end": 382.94000244140625,
      "text": " Contending with the people because God is able"
    },
    {
      "id": 91,
      "start": 383.4200134277344,
      "end": 386.8599853515625,
      "text": " And yes, they they do not deny that they're fortified cities"
    },
    {
      "id": 92,
      "start": 386.8599853515625,
      "end": 389.29998779296875,
      "text": " They do not deny that there are giants in the land"
    },
    {
      "id": 93,
      "start": 389.29998779296875,
      "end": 395.6600036621094,
      "text": " But they say our God is greater our God has said that he will bring us into this land and they have a faith"
    },
    {
      "id": 94,
      "start": 395.94000244140625,
      "end": 397.94000244140625,
      "text": " full report"
    },
    {
      "id": 95,
      "start": 398.3800048828125,
      "end": 401.260009765625,
      "text": " But in numbers chapter 14 in verse number 11"
    },
    {
      "id": 96,
      "start": 401.260009765625,
      "end": 405.29998779296875,
      "text": " God is speaking to Moses and he says this the Lord said unto Moses"
    },
    {
      "id": 97,
      "start": 405.5400085449219,
      "end": 411.17999267578125,
      "text": " How long will this people provoke me and how long will it be air?"
    },
    {
      "id": 98,
      "start": 411.5400085449219,
      "end": 413.5400085449219,
      "text": " They believe me"
    },
    {
      "id": 99,
      "start": 413.5799865722656,
      "end": 416.05999755859375,
      "text": " For all the signs which I have showed"
    },
    {
      "id": 100,
      "start": 416.94000244140625,
      "end": 420.67999267578125,
      "text": " Among them, you know, God wants his people to believe him"
    },
    {
      "id": 101,
      "start": 421.8599853515625,
      "end": 423.70001220703125,
      "text": " Let me ask you this evening"
    },
    {
      "id": 102,
      "start": 423.70001220703125,
      "end": 429.7799987792969,
      "text": " Not only those that are here, but those that are watching on live stream this evening as we consider the subject matter"
    },
    {
      "id": 103,
      "start": 430.2200012207031,
      "end": 432.2200012207031,
      "text": " Do you like it when people believe you?"
    },
    {
      "id": 104,
      "start": 435.4800109863281,
      "end": 441.1400146484375,
      "text": " You want to be trustworthy, right if you tell someone that you're gonna do it and they have to ask you"
    },
    {
      "id": 105,
      "start": 441.2200012207031,
      "end": 444.739990234375,
      "text": " 105 times if you're really gonna do it. Does that kind of annoy you I"
    },
    {
      "id": 106,
      "start": 446.1000061035156,
      "end": 448.4599914550781,
      "text": " Told you I was gonna do it right now"
    },
    {
      "id": 107,
      "start": 448.4599914550781,
      "end": 454.70001220703125,
      "text": " The reality is that sometimes we say that we're gonna do something and then we are hindered from doing it"
    },
    {
      "id": 108,
      "start": 454.70001220703125,
      "end": 456.3800048828125,
      "text": " Does it ever happen to you?"
    },
    {
      "id": 109,
      "start": 456.3800048828125,
      "end": 459.70001220703125,
      "text": " Maybe you have to send an email a text message a phone call and say hey listen"
    },
    {
      "id": 110,
      "start": 459.70001220703125,
      "end": 464.05999755859375,
      "text": " I know that I said I was gonna be there. I said I was gonna do this but something came up and I'm sorry"
    },
    {
      "id": 111,
      "start": 464.05999755859375,
      "end": 466.3399963378906,
      "text": " I can't be there. I can't do this. Whatever it might be"
    },
    {
      "id": 112,
      "start": 467.29998779296875,
      "end": 471.5400085449219,
      "text": " God is the name El Shaddai the Lord God Almighty"
    },
    {
      "id": 113,
      "start": 472.8999938964844,
      "end": 475.5,
      "text": " He he said is anything too hard for me?"
    },
    {
      "id": 114,
      "start": 476.1000061035156,
      "end": 479.3800048828125,
      "text": " He said that he's able to do exceeding abundantly above all that we ask or think"
    },
    {
      "id": 115,
      "start": 479.5,
      "end": 484.3999938964844,
      "text": " There's never a time when God is not going to do what he said. He's gonna do"
    },
    {
      "id": 116,
      "start": 485.5,
      "end": 489.5799865722656,
      "text": " Amen, you believe that this evening. I believe that with all of my heart"
    },
    {
      "id": 117,
      "start": 490.29998779296875,
      "end": 495.3800048828125,
      "text": " That God is going to do what he said he was going to do"
    },
    {
      "id": 118,
      "start": 495.8999938964844,
      "end": 500.9800109863281,
      "text": " In fact, I believe that God has in a certain sense from a certain perspective"
    },
    {
      "id": 119,
      "start": 500.9800109863281,
      "end": 505.5,
      "text": " He has bound himself to do that which is recorded within his word"
    },
    {
      "id": 120,
      "start": 506.5400085449219,
      "end": 507.6199951171875,
      "text": " Amen"
    },
    {
      "id": 121,
      "start": 507.6199951171875,
      "end": 509.6199951171875,
      "text": " He's bound by his word"
    },
    {
      "id": 122,
      "start": 512.0999755859375,
      "end": 514.739990234375,
      "text": " Luke says in Luke 18 in verse number 8"
    },
    {
      "id": 123,
      "start": 516.1799926757812,
      "end": 518.1799926757812,
      "text": " Nevertheless when the Son of Man cometh"
    },
    {
      "id": 124,
      "start": 519.739990234375,
      "end": 524.3800048828125,
      "text": " Shall he find faith on the earth"
    },
    {
      "id": 125,
      "start": 525.5399780273438,
      "end": 529.6599731445312,
      "text": " Shall he find faith on the earth?"
    },
    {
      "id": 126,
      "start": 531.0599975585938,
      "end": 536.6599731445312,
      "text": " There's a truth that's in the Old Testament is repeated in the New Testament. The just shall live by"
    },
    {
      "id": 127,
      "start": 538.3400268554688,
      "end": 543.8200073242188,
      "text": " Faith right the just shall live by faith"
    },
    {
      "id": 128,
      "start": 544.9400024414062,
      "end": 546.6199951171875,
      "text": " What is faith?"
    },
    {
      "id": 129,
      "start": 546.6199951171875,
      "end": 548.6199951171875,
      "text": " Faith is taking God of his word"
    },
    {
      "id": 130,
      "start": 549.3400268554688,
      "end": 554.3800048828125,
      "text": " That's the the most simple definition. I could give you for faith is believing God"
    },
    {
      "id": 131,
      "start": 555.8599853515625,
      "end": 562.5,
      "text": " I believe that as we look at the scriptures and we see when God asked that question to to Moses when he said how long"
    },
    {
      "id": 132,
      "start": 562.5,
      "end": 568.1799926757812,
      "text": " Will it be e'er they believe me that they'll have faith that I will do what I said that I will do"
    },
    {
      "id": 133,
      "start": 568.1799926757812,
      "end": 575.219970703125,
      "text": " It doesn't matter how big the the inhabitants of the land are it doesn't matter how fortified the cities are. I"
    },
    {
      "id": 134,
      "start": 575.739990234375,
      "end": 578.0999755859375,
      "text": " Said I was gonna bring you into the land"
    },
    {
      "id": 135,
      "start": 579.0999755859375,
      "end": 585.97998046875,
      "text": " And by the way, he says how long will it be e'er they believe me for all the signs which I have showed"
    },
    {
      "id": 136,
      "start": 586.739990234375,
      "end": 588.739990234375,
      "text": " among them"
    },
    {
      "id": 137,
      "start": 588.739990234375,
      "end": 591.97998046875,
      "text": " They had had the opportunity to see God do some mighty things"
    },
    {
      "id": 138,
      "start": 592.8200073242188,
      "end": 597.0999755859375,
      "text": " Had they not in Egypt land you read of the ten plagues"
    },
    {
      "id": 139,
      "start": 598.739990234375,
      "end": 600.739990234375,
      "text": " Not only did the children of Israel"
    },
    {
      "id": 0,
      "start": 600.739990234375,
      "end": 606.5999903678894,
      "text": " Israel have the opportunity to see that, but we see that the very servants of"
    },
    {
      "id": 1,
      "start": 606.5999903678894,
      "end": 614.779990196228,
      "text": " Pharaoh saw that and recognized and declared to Pharaoh, this is the finger"
    },
    {
      "id": 2,
      "start": 614.779990196228,
      "end": 621.2999897003174,
      "text": " of God. They said to Pharaoh, how long? I mean, do you not see all the things that"
    },
    {
      "id": 3,
      "start": 621.2999897003174,
      "end": 626.9399909973145,
      "text": " are destroyed? I mean, how long are we going to endure this? I think about some"
    },
    {
      "id": 4,
      "start": 626.9399909973145,
      "end": 633.4599914550781,
      "text": " of the great passages of Scripture that we have. What a joy that God has given us"
    },
    {
      "id": 5,
      "start": 633.4599914550781,
      "end": 639.5399894714355,
      "text": " the complete word, the canon of Scripture, that we have the privilege of not only"
    },
    {
      "id": 6,
      "start": 639.5399894714355,
      "end": 644.0199890136719,
      "text": " reading these wonderful accounts, but then even in our lives we have the"
    },
    {
      "id": 7,
      "start": 644.0199890136719,
      "end": 648.6199913024902,
      "text": " opportunity to recognize how God has worked and what God has done on our"
    },
    {
      "id": 8,
      "start": 648.6199913024902,
      "end": 655.5399894714355,
      "text": " behalf and how he's proven over and over to be faithful, to be trustworthy, to be"
    },
    {
      "id": 9,
      "start": 655.5399894714355,
      "end": 662.4599914550781,
      "text": " dependable. And this evening, the question in Luke 18, when the Son of Man"
    },
    {
      "id": 10,
      "start": 662.4599914550781,
      "end": 669.5799865722656,
      "text": " cometh, shall he find faith on the earth? We're mindful of the verse of Scripture"
    },
    {
      "id": 11,
      "start": 669.5799865722656,
      "end": 673.0599899291992,
      "text": " that we often quote. In fact, here in just a few weeks in our study in the book of"
    },
    {
      "id": 12,
      "start": 673.0599899291992,
      "end": 677.1799926757812,
      "text": " Hebrews on Sunday morning, we'll enter into the 11th chapter, the hall of faith"
    },
    {
      "id": 13,
      "start": 677.1799926757812,
      "end": 681.6999893188477,
      "text": " chapter, as many have referred to it as. We'll read that wonderful verse of"
    },
    {
      "id": 14,
      "start": 681.6999893188477,
      "end": 688.1399917602539,
      "text": " Scripture in verse number 6, but without faith it is impossible to please him. For"
    },
    {
      "id": 15,
      "start": 688.1399917602539,
      "end": 694.0599899291992,
      "text": " he that cometh to God must believe that he is, and that he is a rewarder of them"
    },
    {
      "id": 16,
      "start": 694.0599899291992,
      "end": 699.4999923706055,
      "text": " that diligently seek him. So we think about this subject matter of faith and"
    },
    {
      "id": 17,
      "start": 699.4999923706055,
      "end": 705.3399887084961,
      "text": " unbelief. I preached a series actually several years ago on Sunday morning that"
    },
    {
      "id": 18,
      "start": 705.3399887084961,
      "end": 711.4999923706055,
      "text": " I entitled Increase Our Faith, and we looked at a number of passages of"
    },
    {
      "id": 19,
      "start": 711.4999923706055,
      "end": 715.1799926757812,
      "text": " Scripture throughout the Word of God that God could use in our lives as being"
    },
    {
      "id": 20,
      "start": 715.1799926757812,
      "end": 720.6999893188477,
      "text": " faith builders. The disciples say to the Lord in Luke 17 in verse number 5, they"
    },
    {
      "id": 21,
      "start": 720.6999893188477,
      "end": 726.8999938964844,
      "text": " say, Lord, increase our faith. And we studied for an entire year on Sunday"
    },
    {
      "id": 22,
      "start": 726.8999938964844,
      "end": 730.0199890136719,
      "text": " mornings various passages of Scripture on how we could have our faith increased,"
    },
    {
      "id": 23,
      "start": 730.0199890136719,
      "end": 734.2199859619141,
      "text": " and I often said this during that particular series, that if faith is a"
    },
    {
      "id": 24,
      "start": 734.2199859619141,
      "end": 740.6599884033203,
      "text": " flower, then doubt or unbelief is a weed. And if we want the flower to grow, we"
    },
    {
      "id": 25,
      "start": 740.6599884033203,
      "end": 748.4599914550781,
      "text": " got to deal with the weeds. Amen? I don't have a garden. We have some flower beds"
    },
    {
      "id": 26,
      "start": 748.4599914550781,
      "end": 752.5799865722656,
      "text": " here at church. In fact, Dean and his mom were here this afternoon pulling weeds."
    },
    {
      "id": 27,
      "start": 752.5799865722656,
      "end": 758.9399871826172,
      "text": " And Mrs. Sparks mentioned to me that I wish the flowers at my house grew as"
    },
    {
      "id": 28,
      "start": 758.9399871826172,
      "end": 763.6599884033203,
      "text": " well as the weeds at church grow. How many of you have seen it to be so that"
    },
    {
      "id": 29,
      "start": 763.6599884033203,
      "end": 772.8999938964844,
      "text": " the weeds seem to grow very well? But if faith is a flower, then doubt or unbelief"
    },
    {
      "id": 30,
      "start": 772.8999938964844,
      "end": 776.739990234375,
      "text": " is a weed and needs to be dealt with. Because what do the weeds do? They"
    },
    {
      "id": 31,
      "start": 776.739990234375,
      "end": 785.2199859619141,
      "text": " choke out the flowers. Do they not? I read just last week about a Canadian thistle,"
    },
    {
      "id": 32,
      "start": 785.2199859619141,
      "end": 792.3799896240234,
      "text": " and they mentioned that just the depth at which the root system of this"
    },
    {
      "id": 33,
      "start": 792.4199829101562,
      "end": 797.6599884033203,
      "text": " thistle can go, not only the depth in which it can go, but how far out it can"
    },
    {
      "id": 34,
      "start": 797.6599884033203,
      "end": 805.3399963378906,
      "text": " spread. And in just an acre of property, if there's simply five of those thistle"
    },
    {
      "id": 35,
      "start": 805.3399963378906,
      "end": 813.2999877929688,
      "text": " plants, it can reduce the yield of that acre by nearly 25%. That's amazing. That's"
    },
    {
      "id": 36,
      "start": 813.2999877929688,
      "end": 818.6999969482422,
      "text": " how weeds work. So this evening we got to deal with the subject of unbelief. Back"
    },
    {
      "id": 37,
      "start": 818.739990234375,
      "end": 823.1799926757812,
      "text": " in Mark chapter number 6 and verses 5 and 6, we see that the Bible says in"
    },
    {
      "id": 38,
      "start": 823.1799926757812,
      "end": 827.5799865722656,
      "text": " verse number 6, and he marveled because of their unbelief. I'll be honest with"
    },
    {
      "id": 39,
      "start": 827.5799865722656,
      "end": 831.6199951171875,
      "text": " you this evening, I like the passages where it says that he marveled at their"
    },
    {
      "id": 40,
      "start": 831.6199951171875,
      "end": 837.2999877929688,
      "text": " faith. Amen? I'd much rather it be that God is marveling at our faith and saying,"
    },
    {
      "id": 41,
      "start": 837.2999877929688,
      "end": 843.0599975585938,
      "text": " look at how great faith they have, rather than being in a situation where he's"
    },
    {
      "id": 42,
      "start": 843.0599975585938,
      "end": 847.8599853515625,
      "text": " marveling at our unbelief. This evening, number one, if you're taking notes, we"
    },
    {
      "id": 43,
      "start": 847.8599853515625,
      "end": 854.1399841308594,
      "text": " must learn to recognize unbelief. Learn to recognize it in your life. Listen,"
    },
    {
      "id": 44,
      "start": 854.1399841308594,
      "end": 858.1399841308594,
      "text": " you're never gonna confess it, you're never gonna deal with it, you're gonna"
    },
    {
      "id": 45,
      "start": 858.1399841308594,
      "end": 863.6600036621094,
      "text": " just ignore it if you're not learning how to recognize it. Have you ever"
    },
    {
      "id": 46,
      "start": 863.6600036621094,
      "end": 867.1399841308594,
      "text": " had a situation, again I don't have a garden, but if you're in a situation, there"
    },
    {
      "id": 47,
      "start": 867.1399841308594,
      "end": 870.8199768066406,
      "text": " are times, in fact, even with the flower beds here at church, that you'll go over"
    },
    {
      "id": 48,
      "start": 870.8199768066406,
      "end": 876.7799987792969,
      "text": " and you'll say, now is that a flower or a weed? Because maybe you're not sure. Is it a"
    },
    {
      "id": 49,
      "start": 876.7799987792969,
      "end": 881.0199890136719,
      "text": " flower or is it a weed? Right? We've been in that position, we've been in that"
    },
    {
      "id": 50,
      "start": 881.0199890136719,
      "end": 886.3399963378906,
      "text": " situation, we're not sure what this is. And when we look at the subject matter"
    },
    {
      "id": 51,
      "start": 886.3399963378906,
      "end": 891.1399841308594,
      "text": " of faith and unbelief, we need to learn how to recognize it. I marvel at what the,"
    },
    {
      "id": 52,
      "start": 891.1399841308594,
      "end": 895.9400024414062,
      "text": " just a few chapters later in Mark chapter 9, I think about this father that"
    },
    {
      "id": 53,
      "start": 895.9400024414062,
      "end": 900.2599792480469,
      "text": " is referenced here, and you see about the father and how he would be distraught"
    },
    {
      "id": 54,
      "start": 900.2599792480469,
      "end": 907.8999938964844,
      "text": " because of the the situation in which the son was faced with. And Jesus says to"
    },
    {
      "id": 55,
      "start": 907.8999938964844,
      "end": 912.7799987792969,
      "text": " him, if thou canst believe, all things are possible to him that believeth, in verse"
    },
    {
      "id": 56,
      "start": 912.7799987792969,
      "end": 917.2200012207031,
      "text": " number 23 of Mark 9. And you know what that man cries out, the father of the"
    },
    {
      "id": 57,
      "start": 917.2200012207031,
      "end": 925.97998046875,
      "text": " child cried out, Lord I believe, help thou mine unbelief. So we need to learn how to"
    },
    {
      "id": 58,
      "start": 925.97998046875,
      "end": 931.4199829101562,
      "text": " recognize unbelief. We need to learn how to recognize when I'm doubting, when I'm"
    },
    {
      "id": 59,
      "start": 931.4199829101562,
      "end": 937.6199951171875,
      "text": " not trusting, when I'm not exercising faith, when I'm not living by faith. I'm"
    },
    {
      "id": 60,
      "start": 937.6199951171875,
      "end": 945.1799926757812,
      "text": " not trusting God. I'm thinking somehow that God is not able to intervene in my"
    },
    {
      "id": 61,
      "start": 945.1799926757812,
      "end": 949.739990234375,
      "text": " situation. Well you just don't know how bad it is for me, or you don't know how"
    },
    {
      "id": 62,
      "start": 949.739990234375,
      "end": 954.2200012207031,
      "text": " this situation is. I recently was asked a question, I won't go into all the details"
    },
    {
      "id": 63,
      "start": 954.2200012207031,
      "end": 958.1399841308594,
      "text": " because it would take way too much time, but I was asked a question about"
    },
    {
      "id": 64,
      "start": 958.1399841308594,
      "end": 961.6199951171875,
      "text": " something that happened historically, not biblically, but something historically"
    },
    {
      "id": 65,
      "start": 961.6199951171875,
      "end": 964.9400024414062,
      "text": " that happened back in the 20th century. And there's a question that was posed"
    },
    {
      "id": 66,
      "start": 964.9400024414062,
      "end": 969.0999755859375,
      "text": " with regard to the behavior and whether it was right or wrong. And we began to"
    },
    {
      "id": 67,
      "start": 969.0999755859375,
      "end": 972.3800048828125,
      "text": " have interaction, one with another, as we were discussing the particular subject"
    },
    {
      "id": 68,
      "start": 972.3800048828125,
      "end": 978.739990234375,
      "text": " matter. And I concluded this, that when we make decisions to manipulate the"
    },
    {
      "id": 69,
      "start": 978.739990234375,
      "end": 984.6199951171875,
      "text": " situation, to intervene our own way, and to try to solve the problem ourselves,"
    },
    {
      "id": 70,
      "start": 984.6199951171875,
      "end": 991.4599914550781,
      "text": " that really we're limiting what God is able to do. We're limiting what God is"
    },
    {
      "id": 71,
      "start": 991.4599914550781,
      "end": 998.6999816894531,
      "text": " able to do. Because we say in unbelief, well I got to do this because this is"
    },
    {
      "id": 72,
      "start": 998.6999816894531,
      "end": 1005.2999877929688,
      "text": " gonna happen if I don't do this. What about God? What is he able to do? I'm"
    },
    {
      "id": 73,
      "start": 1005.3399963378906,
      "end": 1008.8199768066406,
      "text": " thankful that Shadrach, Meshach, and Abednego didn't live that way. You know"
    },
    {
      "id": 74,
      "start": 1008.8199768066406,
      "end": 1013.4599914550781,
      "text": " why? We wouldn't have Daniel to read about that situation. I'm thankful that"
    },
    {
      "id": 75,
      "start": 1013.4599914550781,
      "end": 1016.8999938964844,
      "text": " Daniel didn't act that way. We wouldn't have, that's Daniel 3, then you look at"
    },
    {
      "id": 76,
      "start": 1016.8999938964844,
      "end": 1021.5399780273438,
      "text": " Daniel 6 and the den of lions. We wouldn't have it to read. We begin to look at"
    },
    {
      "id": 77,
      "start": 1021.5399780273438,
      "end": 1025.3399963378906,
      "text": " these various, aren't you thankful that David didn't act that way? He believed"
    },
    {
      "id": 78,
      "start": 1025.3399963378906,
      "end": 1032.4199829101562,
      "text": " God. He believed that God was able. He exercised faith. This evening we need to"
    },
    {
      "id": 79,
      "start": 1032.4199829101562,
      "end": 1037.5399780273438,
      "text": " learn how to recognize unbelief. This evening, I believe, number two, we need to"
    },
    {
      "id": 80,
      "start": 1037.5399780273438,
      "end": 1044.2200012207031,
      "text": " understand the results of unbelief. The results of unbelief. Notice what it said"
    },
    {
      "id": 81,
      "start": 1044.2200012207031,
      "end": 1054.2200012207031,
      "text": " in verse number five of Mark 6, and he could there do no mighty works. Matthew"
    },
    {
      "id": 82,
      "start": 1054.2200012207031,
      "end": 1058.97998046875,
      "text": " records it this way in Matthew 13 and verse 58, and he did not many mighty"
    },
    {
      "id": 83,
      "start": 1059.0999755859375,
      "end": 1065.8599853515625,
      "text": " works there because of their unbelief. You know what the people missed out on?"
    },
    {
      "id": 84,
      "start": 1065.8599853515625,
      "end": 1071.739990234375,
      "text": " They missed out on God working. They missed out on seeing what only God"
    },
    {
      "id": 85,
      "start": 1071.739990234375,
      "end": 1077.4599914550781,
      "text": " could do. Now the passage tells us here in Mark 6 and verse number 5, save that"
    },
    {
      "id": 86,
      "start": 1077.4599914550781,
      "end": 1081.8599853515625,
      "text": " he laid his hands upon a few sick folk and healed them. Now that's amazing to me."
    },
    {
      "id": 87,
      "start": 1081.8599853515625,
      "end": 1086.739990234375,
      "text": " That's almost as close as amazement as when Genesis 1 says, and he made the"
    },
    {
      "id": 88,
      "start": 1086.739990234375,
      "end": 1091.6600036621094,
      "text": " stars also, right? Because it's no minor thing for him to heal some folks, but"
    },
    {
      "id": 89,
      "start": 1091.6600036621094,
      "end": 1096.8199768066406,
      "text": " what we understand by what Matthew and Mark both revealed to us in these"
    },
    {
      "id": 90,
      "start": 1096.8199768066406,
      "end": 1101.8999938964844,
      "text": " passages of Scripture with regard to what he was able to do is that there"
    },
    {
      "id": 91,
      "start": 1101.8999938964844,
      "end": 1110.8599853515625,
      "text": " was so much more that he could have done if they believed. If they believed. Right?"
    },
    {
      "id": 92,
      "start": 1110.8599853515625,
      "end": 1115.5800170898438,
      "text": " So what are the results of unbelief? You know what the results were? They missed"
    },
    {
      "id": 93,
      "start": 1115.7000122070312,
      "end": 1121.0599975585938,
      "text": " out on seeing God work. I don't want to miss out on seeing God work. I mean when"
    },
    {
      "id": 94,
      "start": 1121.0599975585938,
      "end": 1125.5399780273438,
      "text": " you read of some of the the Bible passages and you read of some of the"
    },
    {
      "id": 95,
      "start": 1125.5399780273438,
      "end": 1131.1799926757812,
      "text": " miraculous things, the mighty works that God has done, do you long to see God work"
    },
    {
      "id": 96,
      "start": 1131.1799926757812,
      "end": 1137.739990234375,
      "text": " in that fashion? When you read of the things that God has done through church"
    },
    {
      "id": 97,
      "start": 1137.739990234375,
      "end": 1143.6599731445312,
      "text": " history, we can read many accounts of folks that served God and lived for God"
    },
    {
      "id": 98,
      "start": 1143.6599731445312,
      "end": 1149.4199829101562,
      "text": " and lived by faith and faced just terrible situations and yet they trusted"
    },
    {
      "id": 99,
      "start": 1149.4199829101562,
      "end": 1157.5800170898438,
      "text": " God and God worked. God delivered. God blessed. And they could stand back and"
    },
    {
      "id": 100,
      "start": 1157.5800170898438,
      "end": 1165.5800170898438,
      "text": " they could say, look at what God did. Not look at how we managed the situation, but"
    },
    {
      "id": 101,
      "start": 1165.5800170898438,
      "end": 1172.02001953125,
      "text": " look at what God did. I want to see God work. I won't ask you to show me your"
    },
    {
      "id": 102,
      "start": 1172.02001953125,
      "end": 1175.8999633789062,
      "text": " hands if you're reading through the devotional book that we distributed"
    },
    {
      "id": 103,
      "start": 1175.8999633789062,
      "end": 1181.1400146484375,
      "text": " this year in 2020. Revival Today is the title of that book and it has a daily"
    },
    {
      "id": 104,
      "start": 1181.1400146484375,
      "end": 1185.1400146484375,
      "text": " devotion and it has a passage of scripture and then some type of"
    },
    {
      "id": 105,
      "start": 1185.1400146484375,
      "end": 1190.6199951171875,
      "text": " historical event that happened and many times as you read throughout those"
    },
    {
      "id": 106,
      "start": 1190.6199951171875,
      "end": 1196.97998046875,
      "text": " accounts you read of miraculous things that God has done. Do you believe that"
    },
    {
      "id": 107,
      "start": 1196.97998046875,
      "end": 1200.5399780273438,
      "text": " God can still work in 2020?"
    },
    {
      "id": 0,
      "start": 1200.5399780273438,
      "end": 1202.1399780511856,
      "text": " I do."
    },
    {
      "id": 1,
      "start": 1202.1399780511856,
      "end": 1204.259978055954,
      "text": " His hand is not short."
    },
    {
      "id": 2,
      "start": 1204.259978055954,
      "end": 1206.6199779510498,
      "text": " He's not lost any of His power."
    },
    {
      "id": 3,
      "start": 1206.6199779510498,
      "end": 1209.0599784851074,
      "text": " He is still the Lord God Almighty."
    },
    {
      "id": 4,
      "start": 1209.0599784851074,
      "end": 1211.0999784469604,
      "text": " He still reigns. Amen?"
    },
    {
      "id": 5,
      "start": 1211.0999784469604,
      "end": 1213.5799779891968,
      "text": " The Lord God Omnipotent reigneth."
    },
    {
      "id": 6,
      "start": 1213.5799779891968,
      "end": 1216.6599788665771,
      "text": " That's what Revelation tells us."
    },
    {
      "id": 7,
      "start": 1216.6599788665771,
      "end": 1220.6199779510498,
      "text": " Think about the results of unbelief"
    },
    {
      "id": 8,
      "start": 1220.6199779510498,
      "end": 1224.1599788665771,
      "text": " for the children of Israel in Numbers 14."
    },
    {
      "id": 9,
      "start": 1224.1599788665771,
      "end": 1226.4799785614014,
      "text": " We read how that God said to Moses,"
    },
    {
      "id": 10,
      "start": 1226.4799785614014,
      "end": 1229.0999774932861,
      "text": " how long is it going to be ere they believe Me?"
    },
    {
      "id": 11,
      "start": 1229.0999774932861,
      "end": 1232.7599792480469,
      "text": " And then later in the passage in v. 23-24 of Numbers 14,"
    },
    {
      "id": 12,
      "start": 1232.7599792480469,
      "end": 1233.5599784851074,
      "text": " the Bible says,"
    },
    {
      "id": 13,
      "start": 1233.5599784851074,
      "end": 1235.5999794006348,
      "text": " \"...surely they shall not see the land"
    },
    {
      "id": 14,
      "start": 1235.5999794006348,
      "end": 1237.1999778747559,
      "text": " which I swear unto their fathers,"
    },
    {
      "id": 15,
      "start": 1237.1999778747559,
      "end": 1240.8799781799316,
      "text": " neither shall any of them that provoked Me see it.\""
    },
    {
      "id": 16,
      "start": 1240.8799781799316,
      "end": 1242.51997756958,
      "text": " Wow."
    },
    {
      "id": 17,
      "start": 1242.51997756958,
      "end": 1243.7599792480469,
      "text": " What'd they do?"
    },
    {
      "id": 18,
      "start": 1243.7599792480469,
      "end": 1245.5599784851074,
      "text": " They wandered in the wilderness."
    },
    {
      "id": 19,
      "start": 1245.5599784851074,
      "end": 1248.1999778747559,
      "text": " And they died."
    },
    {
      "id": 20,
      "start": 1248.1999778747559,
      "end": 1250.6799774169922,
      "text": " Is that right?"
    },
    {
      "id": 21,
      "start": 1250.6799774169922,
      "end": 1252.3199768066406,
      "text": " That's what happened."
    },
    {
      "id": 22,
      "start": 1252.3199768066406,
      "end": 1257.5999794006348,
      "text": " Is that a pretty high price to pay?"
    },
    {
      "id": 23,
      "start": 1257.5999794006348,
      "end": 1259.859977722168,
      "text": " That's bad."
    },
    {
      "id": 24,
      "start": 1259.859977722168,
      "end": 1262.6599769592285,
      "text": " They didn't get to see what God had promised them."
    },
    {
      "id": 25,
      "start": 1262.6599769592285,
      "end": 1268.2599792480469,
      "text": " I mean, they were on the edge of entering into the land."
    },
    {
      "id": 26,
      "start": 1268.2599792480469,
      "end": 1270.97998046875,
      "text": " In fact, those ten spies that did go into the land"
    },
    {
      "id": 27,
      "start": 1270.97998046875,
      "end": 1272.3399810791016,
      "text": " and spy it out,"
    },
    {
      "id": 28,
      "start": 1272.3399810791016,
      "end": 1274.5199813842773,
      "text": " they never got to see it."
    },
    {
      "id": 29,
      "start": 1274.5199813842773,
      "end": 1276.859977722168,
      "text": " Never got to go and enter into it"
    },
    {
      "id": 30,
      "start": 1276.859977722168,
      "end": 1278.859977722168,
      "text": " with the nation of Israel."
    },
    {
      "id": 31,
      "start": 1278.859977722168,
      "end": 1281.0599746704102,
      "text": " Save Joshua and Caleb."
    },
    {
      "id": 32,
      "start": 1281.0599746704102,
      "end": 1282.3799743652344,
      "text": " Joshua and Caleb."
    },
    {
      "id": 33,
      "start": 1282.3799743652344,
      "end": 1285.5999755859375,
      "text": " I think about Joshua and Caleb often."
    },
    {
      "id": 34,
      "start": 1285.5999755859375,
      "end": 1290.2199783325195,
      "text": " I think about how those 40 years must have been."
    },
    {
      "id": 35,
      "start": 1290.2199783325195,
      "end": 1293.459976196289,
      "text": " They were delayed from seeing what God had promised"
    },
    {
      "id": 36,
      "start": 1293.459976196289,
      "end": 1296.5199813842773,
      "text": " because of the unbelief of the nation."
    },
    {
      "id": 37,
      "start": 1296.5199813842773,
      "end": 1300.3799743652344,
      "text": " But I think that Joshua and Caleb kept their focus proper."
    },
    {
      "id": 38,
      "start": 1300.3799743652344,
      "end": 1302.5399780273438,
      "text": " And they were yearning and longing"
    },
    {
      "id": 39,
      "start": 1302.5399780273438,
      "end": 1304.7799758911133,
      "text": " to get back to that land"
    },
    {
      "id": 40,
      "start": 1304.7799758911133,
      "end": 1308.97998046875,
      "text": " to see how God would do it."
    },
    {
      "id": 41,
      "start": 1308.97998046875,
      "end": 1311.2599792480469,
      "text": " How's God going to give us this land?"
    },
    {
      "id": 42,
      "start": 1311.2599792480469,
      "end": 1312.459976196289,
      "text": " What is He going to do?"
    },
    {
      "id": 43,
      "start": 1312.459976196289,
      "end": 1315.0999755859375,
      "text": " We studied the book of Joshua this year."
    },
    {
      "id": 44,
      "start": 1315.0999755859375,
      "end": 1316.8799743652344,
      "text": " It's amazing, is it not?"
    },
    {
      "id": 45,
      "start": 1316.8799743652344,
      "end": 1319.7199783325195,
      "text": " They got to see God work."
    },
    {
      "id": 46,
      "start": 1319.7199783325195,
      "end": 1323.3399810791016,
      "text": " Understand this evening as we close tonight,"
    },
    {
      "id": 47,
      "start": 1323.3399810791016,
      "end": 1327.079978942871,
      "text": " not only is it important that we learn to recognize unbelief,"
    },
    {
      "id": 48,
      "start": 1327.079978942871,
      "end": 1329.719970703125,
      "text": " not only should we understand the results of unbelief,"
    },
    {
      "id": 49,
      "start": 1329.719970703125,
      "end": 1332.8799743652344,
      "text": " but finally this evening we need to understand the remedy"
    },
    {
      "id": 50,
      "start": 1332.8799743652344,
      "end": 1334.1999816894531,
      "text": " for unbelief."
    },
    {
      "id": 51,
      "start": 1334.1999816894531,
      "end": 1335.8399810791016,
      "text": " The remedy."
    },
    {
      "id": 52,
      "start": 1335.8399810791016,
      "end": 1337.2799835205078,
      "text": " Simple."
    },
    {
      "id": 53,
      "start": 1337.2799835205078,
      "end": 1339.0799713134766,
      "text": " Romans 10.17"
    },
    {
      "id": 54,
      "start": 1339.0799713134766,
      "end": 1342.6799774169922,
      "text": " So then faith cometh by hearing,"
    },
    {
      "id": 55,
      "start": 1342.6799774169922,
      "end": 1348.47998046875,
      "text": " and hearing by the Word of God."
    },
    {
      "id": 56,
      "start": 1348.47998046875,
      "end": 1352.6999816894531,
      "text": " I cannot overemphasize the importance of this book"
    },
    {
      "id": 57,
      "start": 1352.6999816894531,
      "end": 1355.1799774169922,
      "text": " in the life of every believer."
    },
    {
      "id": 58,
      "start": 1355.1799774169922,
      "end": 1357.459976196289,
      "text": " It's impossible for me to overemphasize"
    },
    {
      "id": 59,
      "start": 1357.459976196289,
      "end": 1360.3399810791016,
      "text": " the importance of it."
    },
    {
      "id": 60,
      "start": 1360.3399810791016,
      "end": 1362.6999816894531,
      "text": " Because the reality is that it's by this book"
    },
    {
      "id": 61,
      "start": 1362.6999816894531,
      "end": 1365.739974975586,
      "text": " that God tells us that our faith is increased."
    },
    {
      "id": 62,
      "start": 1365.739974975586,
      "end": 1368.1399841308594,
      "text": " So then faith cometh by hearing,"
    },
    {
      "id": 63,
      "start": 1368.1399841308594,
      "end": 1372.0399780273438,
      "text": " and hearing by the Word of God."
    },
    {
      "id": 64,
      "start": 1372.0599822998047,
      "end": 1373.499984741211,
      "text": " As we study the Scriptures,"
    },
    {
      "id": 65,
      "start": 1373.499984741211,
      "end": 1374.8199768066406,
      "text": " I wonder this evening,"
    },
    {
      "id": 66,
      "start": 1374.8199768066406,
      "end": 1376.459976196289,
      "text": " when you face a difficulty,"
    },
    {
      "id": 67,
      "start": 1376.459976196289,
      "end": 1378.0599822998047,
      "text": " when you face a trial in your life,"
    },
    {
      "id": 68,
      "start": 1378.0599822998047,
      "end": 1379.8999786376953,
      "text": " how many passages of Scripture"
    },
    {
      "id": 69,
      "start": 1379.8999786376953,
      "end": 1382.3799743652344,
      "text": " can God bring back to your memory"
    },
    {
      "id": 70,
      "start": 1382.3799743652344,
      "end": 1384.8599853515625,
      "text": " that increases your faith"
    },
    {
      "id": 71,
      "start": 1384.8599853515625,
      "end": 1388.6599731445312,
      "text": " because you've understood what God is able to do?"
    },
    {
      "id": 72,
      "start": 1388.6599731445312,
      "end": 1390.219970703125,
      "text": " Because you've read it, you've studied it,"
    },
    {
      "id": 73,
      "start": 1390.219970703125,
      "end": 1391.2599792480469,
      "text": " you've learned it,"
    },
    {
      "id": 74,
      "start": 1391.2599792480469,
      "end": 1392.6199798583984,
      "text": " you're aware of it,"
    },
    {
      "id": 75,
      "start": 1392.6199798583984,
      "end": 1393.8999786376953,
      "text": " you're interacting with it,"
    },
    {
      "id": 76,
      "start": 1393.8999786376953,
      "end": 1399.1799774169922,
      "text": " and God is increasing your faith."
    },
    {
      "id": 77,
      "start": 1399.1799774169922,
      "end": 1401.219970703125,
      "text": " There's a sad commentary in the book of Psalms"
    },
    {
      "id": 78,
      "start": 1401.239974975586,
      "end": 1402.3999786376953,
      "text": " in the 78th chapter."
    },
    {
      "id": 79,
      "start": 1402.3999786376953,
      "end": 1403.8599853515625,
      "text": " If you read Psalm 78,"
    },
    {
      "id": 80,
      "start": 1403.8599853515625,
      "end": 1404.7999725341797,
      "text": " you really have the opportunity,"
    },
    {
      "id": 81,
      "start": 1404.7999725341797,
      "end": 1405.719970703125,
      "text": " we're not even gonna go there,"
    },
    {
      "id": 82,
      "start": 1405.719970703125,
      "end": 1407.5999755859375,
      "text": " but you have the opportunity to read through"
    },
    {
      "id": 83,
      "start": 1407.5999755859375,
      "end": 1410.239974975586,
      "text": " really a lot of the history of the nation of Israel."
    },
    {
      "id": 84,
      "start": 1410.239974975586,
      "end": 1412.5599822998047,
      "text": " It's really just an overview, obviously."
    },
    {
      "id": 85,
      "start": 1412.5599822998047,
      "end": 1413.999984741211,
      "text": " It is a lengthy psalm."
    },
    {
      "id": 86,
      "start": 1413.999984741211,
      "end": 1415.4399719238281,
      "text": " It's obviously not the longest psalm,"
    },
    {
      "id": 87,
      "start": 1415.4399719238281,
      "end": 1417.1599731445312,
      "text": " but it is a lengthy psalm."
    },
    {
      "id": 88,
      "start": 1417.1599731445312,
      "end": 1419.5599822998047,
      "text": " And it quickly goes through several high points"
    },
    {
      "id": 89,
      "start": 1419.5599822998047,
      "end": 1422.3999786376953,
      "text": " of the history of the nation of Israel"
    },
    {
      "id": 90,
      "start": 1422.3999786376953,
      "end": 1424.6399841308594,
      "text": " and several things that are contained therein."
    },
    {
      "id": 91,
      "start": 1424.6399841308594,
      "end": 1426.3599853515625,
      "text": " But you come to verse number 41"
    },
    {
      "id": 92,
      "start": 1426.3599853515625,
      "end": 1428.0399780273438,
      "text": " of that passage of Scripture,"
    },
    {
      "id": 93,
      "start": 1428.0399780273438,
      "end": 1429.999984741211,
      "text": " and the Bible says this,"
    },
    {
      "id": 94,
      "start": 1429.999984741211,
      "end": 1434.999984741211,
      "text": " that they limited the Holy One of Israel."
    },
    {
      "id": 95,
      "start": 1435.7799835205078,
      "end": 1437.3799743652344,
      "text": " I'm not sure if you can wrap your mind"
    },
    {
      "id": 96,
      "start": 1437.3799743652344,
      "end": 1439.5799713134766,
      "text": " around that this evening."
    },
    {
      "id": 97,
      "start": 1439.5799713134766,
      "end": 1442.0199737548828,
      "text": " It's very challenging for me, actually,"
    },
    {
      "id": 98,
      "start": 1442.0199737548828,
      "end": 1447.0199737548828,
      "text": " to fully comprehend how you can limit a limitless God."
    },
    {
      "id": 99,
      "start": 1449.5399780273438,
      "end": 1452.6199798583984,
      "text": " He's the Lord God omnipotent, is He not?"
    },
    {
      "id": 100,
      "start": 1452.6199798583984,
      "end": 1454.3799743652344,
      "text": " But you know how they limited Him?"
    },
    {
      "id": 101,
      "start": 1454.3799743652344,
      "end": 1456.3399810791016,
      "text": " Because they doubted."
    },
    {
      "id": 102,
      "start": 1456.3399810791016,
      "end": 1457.6999816894531,
      "text": " Because of their unbelief."
    },
    {
      "id": 103,
      "start": 1458.6799926757812,
      "end": 1462.1599731445312,
      "text": " And they limited the Holy One of Israel."
    },
    {
      "id": 104,
      "start": 1463.0799865722656,
      "end": 1465.3599853515625,
      "text": " You can read other psalms,"
    },
    {
      "id": 105,
      "start": 1465.3599853515625,
      "end": 1468.1599731445312,
      "text": " and you can read other portions of Scripture,"
    },
    {
      "id": 106,
      "start": 1468.1599731445312,
      "end": 1471.9599914550781,
      "text": " and you can see how that God would share the truth"
    },
    {
      "id": 107,
      "start": 1471.9599914550781,
      "end": 1474.5999755859375,
      "text": " of how many things He was planning to do"
    },
    {
      "id": 108,
      "start": 1474.5999755859375,
      "end": 1476.97998046875,
      "text": " or He was able to do for them,"
    },
    {
      "id": 109,
      "start": 1476.97998046875,
      "end": 1478.4399719238281,
      "text": " but they would not believe Him."
    },
    {
      "id": 110,
      "start": 1478.4399719238281,
      "end": 1479.9199829101562,
      "text": " They did not submit to them."
    },
    {
      "id": 111,
      "start": 1479.9199829101562,
      "end": 1482.0599670410156,
      "text": " They did not trust in Him,"
    },
    {
      "id": 112,
      "start": 1482.0599670410156,
      "end": 1484.4399719238281,
      "text": " and therefore they did not,"
    },
    {
      "id": 113,
      "start": 1484.4399719238281,
      "end": 1486.8599853515625,
      "text": " as they would not hearken to His voice,"
    },
    {
      "id": 114,
      "start": 1486.8799743652344,
      "end": 1491.1199645996094,
      "text": " they did not see Him work in the way in which He could."
    },
    {
      "id": 115,
      "start": 1491.1199645996094,
      "end": 1494.0799865722656,
      "text": " I won't read it, but reference in your notes perhaps"
    },
    {
      "id": 116,
      "start": 1494.0799865722656,
      "end": 1496.7599792480469,
      "text": " this evening Psalm 81."
    },
    {
      "id": 117,
      "start": 1497.8599853515625,
      "end": 1500.2799682617188,
      "text": " And read what God says that He could do"
    },
    {
      "id": 118,
      "start": 1500.2799682617188,
      "end": 1502.6799926757812,
      "text": " for the nation of Israel for His people,"
    },
    {
      "id": 119,
      "start": 1502.6799926757812,
      "end": 1504.7799682617188,
      "text": " but they wouldn't hearken unto His voice."
    },
    {
      "id": 120,
      "start": 1505.9999694824219,
      "end": 1510.9999694824219,
      "text": " It's amazing to me what God did for the nation of Judah"
    },
    {
      "id": 121,
      "start": 1511.4399719238281,
      "end": 1514.0399780273438,
      "text": " when the Assyrians were coming to attack."
    },
    {
      "id": 122,
      "start": 1515.0199890136719,
      "end": 1520.0199890136719,
      "text": " We're aware of the way in which the Assyrians"
    },
    {
      "id": 123,
      "start": 1520.2999877929688,
      "end": 1523.2999877929688,
      "text": " took captive the nation of Israel,"
    },
    {
      "id": 124,
      "start": 1523.2999877929688,
      "end": 1525.2599792480469,
      "text": " the ten tribes of the north."
    },
    {
      "id": 125,
      "start": 1525.2599792480469,
      "end": 1527.2599792480469,
      "text": " In fact, the Assyrians as the world power"
    },
    {
      "id": 126,
      "start": 1527.2599792480469,
      "end": 1528.4599914550781,
      "text": " at that particular time,"
    },
    {
      "id": 127,
      "start": 1528.4599914550781,
      "end": 1531.5399780273438,
      "text": " they had conquered many groups of people."
    },
    {
      "id": 128,
      "start": 1533.2599792480469,
      "end": 1537.219970703125,
      "text": " Sennachrab and Rabshakka,"
    },
    {
      "id": 129,
      "start": 1537.219970703125,
      "end": 1539.5399780273438,
      "text": " they come to Judah."
    },
    {
      "id": 130,
      "start": 1539.5399780273438,
      "end": 1541.219970703125,
      "text": " And Hezekiah is the king."
    },
    {
      "id": 131,
      "start": 1544.9399719238281,
      "end": 1549.9399719238281,
      "text": " Rabshakka says, don't trust Hezekiah."
    },
    {
      "id": 132,
      "start": 1550.5799865722656,
      "end": 1552.1999816894531,
      "text": " He's telling you to trust God."
    },
    {
      "id": 133,
      "start": 1553.0999755859375,
      "end": 1555.4599914550781,
      "text": " What about all these other people groups that we conquered?"
    },
    {
      "id": 134,
      "start": 1555.4599914550781,
      "end": 1557.2999877929688,
      "text": " And what about all of their gods?"
    },
    {
      "id": 135,
      "start": 1558.6599731445312,
      "end": 1561.3999633789062,
      "text": " There's something interesting that Hezekiah recognized."
    },
    {
      "id": 136,
      "start": 1562.6599731445312,
      "end": 1564.0199890136719,
      "text": " They were all idols."
    },
    {
      "id": 137,
      "start": 1565.9999694824219,
      "end": 1567.3399658203125,
      "text": " But Hezekiah and the nation of Judah"
    },
    {
      "id": 138,
      "start": 1567.3399658203125,
      "end": 1569.7599792480469,
      "text": " served the Lord God, Jehovah."
    },
    {
      "id": 139,
      "start": 1572.0599670410156,
      "end": 1573.219970703125,
      "text": " You know what Hezekiah did?"
    },
    {
      "id": 140,
      "start": 1573.219970703125,
      "end": 1577.0999755859375,
      "text": " He took those letters and he laid them out before God."
    },
    {
      "id": 141,
      "start": 1578.5199890136719,
      "end": 1579.4199829101562,
      "text": " And he prayed."
    },
    {
      "id": 142,
      "start": 1580.8199768066406,
      "end": 1582.5199890136719,
      "text": " Isaiah is the prophet at the time"
    },
    {
      "id": 143,
      "start": 1582.5199890136719,
      "end": 1584.5599670410156,
      "text": " if you look historically and you can go back and forth."
    },
    {
      "id": 144,
      "start": 1584.5599670410156,
      "end": 1587.8399658203125,
      "text": " In fact, you can read it in Isaiah as well,"
    },
    {
      "id": 145,
      "start": 1587.8399658203125,
      "end": 1589.9199829101562,
      "text": " how that Isaiah brings a message back to him."
    },
    {
      "id": 146,
      "start": 1589.9199829101562,
      "end": 1591.7999877929688,
      "text": " He says, don't be afraid of them."
    },
    {
      "id": 147,
      "start": 1591.7999877929688,
      "end": 1593.8999633789062,
      "text": " God's gonna deal with them."
    },
    {
      "id": 148,
      "start": 1593.8999633789062,
      "end": 1595.719970703125,
      "text": " You know, God dealt with them."
    },
    {
      "id": 149,
      "start": 1595.719970703125,
      "end": 1596.739990234375,
      "text": " They didn't even have to,"
    },
    {
      "id": 150,
      "start": 1596.739990234375,
      "end": 1599.0799865722656,
      "text": " they didn't have to raise a sword."
    },
    {
      "id": 151,
      "start": 1599.0799865722656,
      "end": 1600.0799865722656,
      "text": " God dealt with them."
    },
    {
      "id": 152,
      "start": 1600.9599914550781,
      "end": 1602.9599914550781,
      "text": " You say that was then."
    },
    {
      "id": 153,
      "start": 1603.6999816894531,
      "end": 1605.1399841308594,
      "text": " I'm the Lord, I change not."
    },
    {
      "id": 154,
      "start": 1605.1399841308594,
      "end": 1607.0199890136719,
      "text": " Our God is able."
    },
    {
      "id": 155,
      "start": 1607.0199890136719,
      "end": 1608.8599853515625,
      "text": " I understand that He's able to do exceeding abundantly"
    },
    {
      "id": 156,
      "start": 1608.8599853515625,
      "end": 1610.1799926757812,
      "text": " above all that we ask or think."
    },
    {
      "id": 157,
      "start": 1610.1799926757812,
      "end": 1611.4199829101562,
      "text": " I believe that."
    },
    {
      "id": 158,
      "start": 1611.4199829101562,
      "end": 1612.6999816894531,
      "text": " Paul prays that."
    },
    {
      "id": 159,
      "start": 1612.6999816894531,
      "end": 1615.4999694824219,
      "text": " In fact, I'm mindful of what James says"
    },
    {
      "id": 160,
      "start": 1615.4999694824219,
      "end": 1616.5399780273438,
      "text": " in James chapter number five,"
    },
    {
      "id": 161,
      "start": 1616.5399780273438,
      "end": 1618.2599792480469,
      "text": " when he says that the effectual fervent prayer"
    },
    {
      "id": 162,
      "start": 1618.2599792480469,
      "end": 1620.8999633789062,
      "text": " of a righteous man availeth much."
    },
    {
      "id": 163,
      "start": 1620.8999633789062,
      "end": 1624.739990234375,
      "text": " And then he uses the example of Elijah praying."
    },
    {
      "id": 164,
      "start": 1624.739990234375,
      "end": 1627.0199890136719,
      "text": " And he says that he's like passion."
    },
    {
      "id": 165,
      "start": 1627.0199890136719,
      "end": 1630.0999755859375,
      "text": " Elijah was a man like we're men, human beings."
    },
    {
      "id": 166,
      "start": 1631.0799865722656,
      "end": 1633.1199645996094,
      "text": " And yet he prayed and it did not rain"
    },
    {
      "id": 167,
      "start": 1633.1199645996094,
      "end": 1635.3599853515625,
      "text": " for the space of three and a half years, right?"
    },
    {
      "id": 168,
      "start": 1635.3599853515625,
      "end": 1637.3999633789062,
      "text": " You read it, 1 Kings 17."
    },
    {
      "id": 169,
      "start": 1637.3999633789062,
      "end": 1638.9199829101562,
      "text": " And then he prayed again and guess what?"
    },
    {
      "id": 170,
      "start": 1638.9199829101562,
      "end": 1639.7599792480469,
      "text": " It rained."
    },
    {
      "id": 171,
      "start": 1642.1399841308594,
      "end": 1647.1399841308594,
      "text": " And James, near the end of the New Testament canon,"
    },
    {
      "id": 172,
      "start": 1647.239990234375,
      "end": 1649.5199890136719,
      "text": " says to us as New Testament believers"
    },
    {
      "id": 173,
      "start": 1649.5199890136719,
      "end": 1651.0399780273438,
      "text": " that the effectual fervent prayer"
    },
    {
      "id": 174,
      "start": 1651.0399780273438,
      "end": 1654.5399780273438,
      "text": " of a righteous man availeth much."
    },
    {
      "id": 175,
      "start": 1654.5399780273438,
      "end": 1656.0399780273438,
      "text": " You know what praying is?"
    },
    {
      "id": 176,
      "start": 1656.0399780273438,
      "end": 1657.219970703125,
      "text": " Exercising faith."
    },
    {
      "id": 177,
      "start": 1658.1599731445312,
      "end": 1663.0799865722656,
      "text": " Inviting God to work in the circumstances of our lives."
    },
    {
      "id": 178,
      "start": 1663.0799865722656,
      "end": 1665.3999633789062,
      "text": " Recognizing our own inabilities"
    },
    {
      "id": 179,
      "start": 1665.3999633789062,
      "end": 1668.0799865722656,
      "text": " and not seeking to scheme and plan and devise"
    },
    {
      "id": 180,
      "start": 1668.0799865722656,
      "end": 1669.2799682617188,
      "text": " and figure out how we're gonna do it."
    },
    {
      "id": 181,
      "start": 1669.2799682617188,
      "end": 1672.3999633789062,
      "text": " No, God, we're trusting you."
    },
    {
      "id": 182,
      "start": 1672.3999633789062,
      "end": 1673.6399841308594,
      "text": " We know that you're able."
    },
    {
      "id": 183,
      "start": 1673.6399841308594,
      "end": 1676.0599670410156,
      "text": " We know that you're sovereign."
    },
    {
      "id": 184,
      "start": 1676.0599670410156,
      "end": 1680.7599792480469,
      "text": " The Bible says that he marveled because of their unbelief."
    },
    {
      "id": 185,
      "start": 1680.7599792480469,
      "end": 1684.6399841308594,
      "text": " He marveled because of their unbelief."
    },
    {
      "id": 186,
      "start": 1684.6599731445312,
      "end": 1688.0199890136719,
      "text": " Yet we read of the centurion."
    },
    {
      "id": 187,
      "start": 1688.0199890136719,
      "end": 1689.47998046875,
      "text": " He marveled and said,"
    },
    {
      "id": 188,
      "start": 1690.6599731445312,
      "end": 1694.0199890136719,
      "text": " verily I say unto you, I have not found so great faith,"
    },
    {
      "id": 189,
      "start": 1694.0199890136719,
      "end": 1695.3399658203125,
      "text": " no, not in Israel."
    },
    {
      "id": 190,
      "start": 1696.4399719238281,
      "end": 1698.3399658203125,
      "text": " What'd that centurion say?"
    },
    {
      "id": 191,
      "start": 1698.3399658203125,
      "end": 1701.4999694824219,
      "text": " He said, Jesus, you don't even have to come"
    },
    {
      "id": 192,
      "start": 1701.4999694824219,
      "end": 1702.7999877929688,
      "text": " to my house to heal."
    },
    {
      "id": 193,
      "start": 1704.3399658203125,
      "end": 1706.0599670410156,
      "text": " Because I know the power that I have."
    },
    {
      "id": 194,
      "start": 1706.0599670410156,
      "end": 1708.9399719238281,
      "text": " I say do this and do that and they do it."
    },
    {
      "id": 195,
      "start": 1708.9399719238281,
      "end": 1710.4599914550781,
      "text": " And I recognize that you're God"
    },
    {
      "id": 196,
      "start": 1710.4599914550781,
      "end": 1713.739990234375,
      "text": " and so you don't even have to come to my house and heal."
    },
    {
      "id": 197,
      "start": 1714.1199951171875,
      "end": 1716.2999877929688,
      "text": " It distances no matter for you."
    },
    {
      "id": 198,
      "start": 1716.2999877929688,
      "end": 1717.5599975585938,
      "text": " You read it in Matthew 8."
    },
    {
      "id": 199,
      "start": 1717.5599975585938,
      "end": 1719.6399536132812,
      "text": " That's what he deals with."
    },
    {
      "id": 200,
      "start": 1719.6399536132812,
      "end": 1720.6799926757812,
      "text": " We serve a great God."
    },
    {
      "id": 201,
      "start": 1720.6799926757812,
      "end": 1724.0199584960938,
      "text": " I wanna read to you this wonderful hymn."
    },
    {
      "id": 202,
      "start": 1725.0,
      "end": 1727.0,
      "text": " You're familiar with it."
    },
    {
      "id": 203,
      "start": 1727.0,
      "end": 1731.3999633789062,
      "text": " Tis so sweet to trust in Jesus."
    },
    {
      "id": 204,
      "start": 1731.3999633789062,
      "end": 1734.7599487304688,
      "text": " The songwriter said, tis so sweet to trust in Jesus."
    },
    {
      "id": 205,
      "start": 1734.7599487304688,
      "end": 1739.7599487304688,
      "text": " Notice this, just to take him at his word."
    },
    {
      "id": 206,
      "start": 1740.6199951171875,
      "end": 1745.1399536132812,
      "text": " Just to rest upon his promise."
    },
    {
      "id": 207,
      "start": 1745.1399536132812,
      "end": 1748.6199951171875,
      "text": " Just to know, thus saith the Lord."
    },
    {
      "id": 208,
      "start": 1749.5799560546875,
      "end": 1752.8599853515625,
      "text": " Oh, how sweet to trust in Jesus."
    },
    {
      "id": 209,
      "start": 1752.8599853515625,
      "end": 1755.699951171875,
      "text": " Just to trust his cleansing blood."
    },
    {
      "id": 210,
      "start": 1755.699951171875,
      "end": 1759.2999877929688,
      "text": " Just in simple faith to plunge me"
    },
    {
      "id": 211,
      "start": 1759.2999877929688,
      "end": 1761.97998046875,
      "text": " neath the healing, cleansing flood."
    },
    {
      "id": 212,
      "start": 1761.97998046875,
      "end": 1765.6199951171875,
      "text": " Yes, tis sweet to trust in Jesus."
    },
    {
      "id": 213,
      "start": 1765.6199951171875,
      "end": 1768.5199584960938,
      "text": " Just from sin and self to cease."
    },
    {
      "id": 214,
      "start": 1768.5399780273438,
      "end": 1771.8200073242188,
      "text": " Just from Jesus simply taking life"
    },
    {
      "id": 215,
      "start": 1771.8200073242188,
      "end": 1775.1399536132812,
      "text": " and rest and joy and peace."
    },
    {
      "id": 216,
      "start": 1776.1399536132812,
      "end": 1780.739990234375,
      "text": " I'm so glad I learned to trust thee."
    },
    {
      "id": 217,
      "start": 1780.739990234375,
      "end": 1784.8200073242188,
      "text": " Precious Jesus, Savior, friend."
    },
    {
      "id": 218,
      "start": 1784.8200073242188,
      "end": 1788.5399780273438,
      "text": " And I know that thou art with me,"
    },
    {
      "id": 219,
      "start": 1788.5399780273438,
      "end": 1792.4199829101562,
      "text": " wilt be with me to the end."
    },
    {
      "id": 220,
      "start": 1792.4199829101562,
      "end": 1796.8599853515625,
      "text": " Jesus, Jesus, how I trust him."
    },
    {
      "id": 221,
      "start": 1796.8599853515625,
      "end": 1800.6599731445312,
      "text": " Notice this, how I've proved him."
    },
    {
      "id": 0,
      "start": 1800.6599731445312,
      "end": 1815.8199729919434,
      "text": " or and or. Jesus, Jesus, precious Jesus, oh for grace to trust Him more. This"
    },
    {
      "id": 1,
      "start": 1815.8199729919434,
      "end": 1820.8199729919434,
      "text": " evening, I'm sure that many of us that are gathered, in fact many that are"
    },
    {
      "id": 2,
      "start": 1820.8199729919434,
      "end": 1825.339973449707,
      "text": " watching via live stream, have trusted the Lord Jesus Christ as their personal"
    },
    {
      "id": 3,
      "start": 1825.339973449707,
      "end": 1831.9399738311768,
      "text": " Savior. We're trusting Him for eternity, but for some reason we have such"
    },
    {
      "id": 4,
      "start": 1831.9399738311768,
      "end": 1840.6999740600586,
      "text": " difficulty trusting Him for tomorrow. Isn't it true? Honestly, I believe God's"
    },
    {
      "id": 5,
      "start": 1840.6999740600586,
      "end": 1848.9399719238281,
      "text": " trying to help somebody. I believe He's helped me. He wants to help us to trust"
    },
    {
      "id": 6,
      "start": 1848.9399719238281,
      "end": 1854.4999732971191,
      "text": " Him. Oh for grace to trust Him more. That's the last tagline of that chorus,"
    },
    {
      "id": 7,
      "start": 1854.4999732971191,
      "end": 1858.0599746704102,
      "text": " but I think about what it says in the beginning there, or at the end of that"
    },
    {
      "id": 8,
      "start": 1858.0599746704102,
      "end": 1865.1399765014648,
      "text": " last verse, how I've proved Him or and or. You know what God says in Malachi? He"
    },
    {
      "id": 9,
      "start": 1865.1399765014648,
      "end": 1872.4199752807617,
      "text": " says, prove me, prove me, and see if I won't do this. Go and read it, Malachi."
    },
    {
      "id": 10,
      "start": 1872.4199752807617,
      "end": 1879.9799728393555,
      "text": " God says, prove me. What's He saying? I'll do what I said I will do, but see for us"
    },
    {
      "id": 11,
      "start": 1879.9799728393555,
      "end": 1884.5799713134766,
      "text": " as God's people, we need to learn to trust Him. We deal with this situation of"
    },
    {
      "id": 12,
      "start": 1884.5799713134766,
      "end": 1891.5799713134766,
      "text": " unbelief. We do, all of us do. We need to learn how to recognize it. We need to"
    },
    {
      "id": 13,
      "start": 1891.5799713134766,
      "end": 1894.619972229004,
      "text": " understand what the results of it are, and then we need to understand what the"
    },
    {
      "id": 14,
      "start": 1894.619972229004,
      "end": 1902.8599700927734,
      "text": " remedy is. The remedy is getting into this book. Oh God, increase my faith. I"
    },
    {
      "id": 15,
      "start": 1902.8599700927734,
      "end": 1907.1799697875977,
      "text": " believe that you said faith cometh by hearing and hearing by your Word, and so"
    },
    {
      "id": 16,
      "start": 1907.1799697875977,
      "end": 1910.5799713134766,
      "text": " I want to sit under the sound of the preaching the Word of God. I want to get"
    },
    {
      "id": 17,
      "start": 1910.5799713134766,
      "end": 1915.339973449707,
      "text": " into the Word of God every day of my life, because I want my faith to be"
    },
    {
      "id": 18,
      "start": 1915.339973449707,
      "end": 1921.7799758911133,
      "text": " increased. Because without faith, it's impossible to please Him. Remember, the"
    },
    {
      "id": 19,
      "start": 1921.7799758911133,
      "end": 1929.1799774169922,
      "text": " just shall live by faith. If Jesus were to come to your house, if Jesus were to"
    },
    {
      "id": 20,
      "start": 1929.1799774169922,
      "end": 1937.0999755859375,
      "text": " come to our church, would He marvel because of our unbelief, or would He"
    },
    {
      "id": 21,
      "start": 1937.0999755859375,
      "end": 1945.4199676513672,
      "text": " marvel because we have great faith? Would He marvel because of our unbelief, or"
    },
    {
      "id": 22,
      "start": 1945.4199676513672,
      "end": 1950.0599670410156,
      "text": " would He marvel because of our great faith? I hope this evening that you want"
    },
    {
      "id": 23,
      "start": 1950.0599670410156,
      "end": 1955.4999694824219,
      "text": " to see God work, and that you believe that He still can. He's still on His"
    },
    {
      "id": 24,
      "start": 1955.4999694824219,
      "end": 1964.3799743652344,
      "text": " throne. Amen? Let's pray. Father, we love you. Thank you so much for loving us."
    },
    {
      "id": 25,
      "start": 1964.97998046875,
      "end": 1974.699966430664,
      "text": " Thank you for your Word. Thank you for how your Word convicts us, challenges us,"
    },
    {
      "id": 26,
      "start": 1974.739974975586,
      "end": 1982.8599700927734,
      "text": " changes us, comforts us. We understand this evening that you've said that your"
    },
    {
      "id": 27,
      "start": 1982.8599700927734,
      "end": 1991.6599731445312,
      "text": " Word is profitable. God, I believe that you desire to help your people through"
    },
    {
      "id": 28,
      "start": 1991.6599731445312,
      "end": 1999.8999786376953,
      "text": " your Word. Fathers, we have had the opportunity this evening to examine"
    },
    {
      "id": 29,
      "start": 1999.8999786376953,
      "end": 2004.219970703125,
      "text": " several interactions that our Lord and Savior had with people when He walked"
    },
    {
      "id": 30,
      "start": 2004.219970703125,
      "end": 2010.8599700927734,
      "text": " upon this earth, and statements that He made with regard to their faith. I pray"
    },
    {
      "id": 31,
      "start": 2010.8599700927734,
      "end": 2018.6199798583984,
      "text": " tonight that we've been challenged, and that we've been helped. God, I pray that"
    },
    {
      "id": 32,
      "start": 2018.6199798583984,
      "end": 2025.1799774169922,
      "text": " you'd help us to be a people that trust you. Help us to be a people that live by"
    },
    {
      "id": 33,
      "start": 2025.1799774169922,
      "end": 2039.3399658203125,
      "text": " faith. Help us to run to your Word, dig in, feast upon. It's not going to work to"
    },
    {
      "id": 34,
      "start": 2039.3399658203125,
      "end": 2046.2999725341797,
      "text": " just have a little verse here and there. You need to feast upon the Word of God"
    },
    {
      "id": 35,
      "start": 2046.2999725341797,
      "end": 2052.419967651367,
      "text": " so that our faith would be increased. I pray, God, that you would help us as we"
    },
    {
      "id": 36,
      "start": 2052.419967651367,
      "end": 2057.219970703125,
      "text": " enter into our prayer time. We thank you for the privilege of prayer. We pray that"
    },
    {
      "id": 37,
      "start": 2057.219970703125,
      "end": 2062.3399658203125,
      "text": " you'd work mightily. God, that we'd have the opportunity to see you do what only"
    },
    {
      "id": 38,
      "start": 2062.3399658203125,
      "end": 2069.5799865722656,
      "text": " you can do, that you alone would be glorified. Well, thank you for the work"
    },
    {
      "id": 39,
      "start": 2069.5799865722656,
      "end": 2074.939971923828,
      "text": " that you'll do. For it's in Christ's name we pray, amen. I invite you to take your"
    },
    {
      "id": 40,
      "start": 2074.939971923828,
      "end": 2078.179962158203,
      "text": " prayer bulletin this evening."
    }
  ],
  "processed_at": "2025-04-17T14:44:09.652103"
}