{
  "video_id": "JzHG21T_weU",
  "text": "And as you're turning to the book of 1 Thessalonians, you'll be mindful that the Lord allowed the Apostle Paul and his team to travel to the city of Thessalonica. It was during the second missionary journey in which God allowed them to go to this particular city. And we find that as they arrived to the city, we find the work that was done. And if you were to read Acts chapter number 17, you'll have an opportunity to read the record that God gives us of their entrance into that city and their preaching of the gospel. And we understand that as we read the passage in Acts chapter number 17, that the time that they were able to spend in the city of Thessalonica was brief. It was cut short from a human's perspective, if you will, due to the opposition to the gospel. We understand that on this second missionary journey, there were some that even as Paul and his team arrived in Thessalonica, there were some from other cities that did not like the message in which they were preaching that would come and cause problems for Paul and his team there in the city of Thessalonica. And we know that every time you attempt to do a work for God, there will be opposition. And they face that opposition, but it's interesting and exciting to understand that just after a brief period of time in the city of Thessalonica, that a church was established. And we find that that church was established. And as you examine the communication that God allows Paul to give to this church that's part of the canon of scripture, we understand all scripture is given by inspiration of God. As you study 1 and 2 Thessalonians, and really in particular as our focus today will be on the book of 1 Thessalonians, you have the opportunity to really see the way in which Paul and the believers in this church had a close relationship. God allowed them to have a bind, one with another to have this just tight relationship. And we find that as we look at the book of 1 Thessalonians, I'm mindful this morning, and you know as well that this book is written to a local church. It's written to a body of believers. And it is written from, understood under the inspiration of the Holy Spirit, but it is written from a church leader, from the Apostle Paul. And we find that as Paul is writing this, and he would reveal to us through various means the relationship that they held. I'd like to use an expression that he uses in 1 Thessalonians 2 and verse number 11 this morning, and really will serve as our title. Look there at 1 Thessalonians 2 and verse number 11. The Bible says, as ye know, how we exhorted and comforted and charged every one of you, then notice this phrase, as a father doth his children. As a father doth his children. As we look at that phrase and understand that again, as I mentioned during our announcement time this morning, that we'll have a part one this morning, and a part two this evening, having the same title, as a father doth his children, part one and part two. As we begin to look at this short book, we will find, and I know there's a lot more than what we'll look at today, but for sake of getting through it in one day, and two messages, I'd like to examine five principles that I believe if we would implement these five principles, that it will lead us to reaching the ultimate goal that is noted in verse number 12 of the same chapter. Paul says at the end of verse number 11, as a father doth his children, then notice what the ultimate goal is, that ye would walk worthy of God, who hath called you unto His kingdom and glory. You understand that children are not going to just by chance walk worthy of God? New believers are not going to, by chance, walk worthy of God. And as we examine the passage of Scripture both this morning and this evening, and really we're gonna look at the entire book, and kinda just look at a variety of verses throughout the book of 1 Thessalonians, take an overview if you will. As we look at this book and think of this truth this morning, I want us to look at it from two perspectives. Number one, from a father to a child. That parental relationship, we don't know and we find here that Paul, as he would use this expression, as a father doth his children, he's not explicitly giving instruction in the book of 1 Thessalonians to dads on how they are to work and minister to their children. Though the Bible contains much information about parenting and much truth is contained therein, we find that Paul is writing to a church. But he says in this same manner, as a father doth his children, this is how we were ministering. What a great truth. And I find that not only would we look at it this morning from the perspective of a father to a child, but I'd encourage you this morning to look at it from a mature believer to a growing believer. A mature believer to a growing believer. You understand this morning that you may be here and you say, I'm not a father, turn off the preacher. No, no, no, no. The word of God is applicable for all of us. And we find that the principles that we'll look at this morning, as we would examine them from these two perspectives, I believe it will help us. And as we begin to look at the passage, I just have two thoughts for you this morning, and then we'll look at three thoughts this evening. But if you're taking notes, number one, first principle that I believe we need to implement in our lives, number one, impart biblical truth. Impart biblical truth. As Paul arrives into the city of Thessalonica, as the word of God would give us the record of that in Acts chapter number 17, we find at the end of verse number two that the Bible says this, that he reasoned with them out of the Scriptures. And the importance of imparting biblical truth, oh, it's always been important, but we find in the day and age in which we're living, in the hour in which we're facing this morning, oh, it is imperative that we, as the people of God, would impart biblical truth. It was not necessary for Paul to enter into the city of Thessalonica and share his own opinions. It was not necessary for him to come there and try to make them what he was. No, he went there and he imparted biblical truth. The book that we hold in our hands this morning is the word of God. It's a living book. The Bible is quick and powerful and sharper than any two-edged sword. We understand this morning that there are some that do not like the Bible. There are some that would like to outlaw the truth of God's Word and to say that if you were to preach or teach or even just share a truth from the Word of God that it could be constituted as being hate speech. But the Word of God is truth. The Word of God is powerful. And we must impart biblical truth. Notice if you turn back to the book of Psalms, and we're gonna look at a number of verses and then make our way back to the book of 1 Thessalonians and look at what Paul is doing with these believers in Thessalonica and be mindful of the truth that he says, as a father doth his children, practically speaking, Psalm 19 as you're turning there, practically speaking as Paul is ministering to these believers in Thessalonica, it is that second of the relationships that I mentioned that we'd like to look at it from these perspectives. It's a mature believer to a growing believer. We find this morning in Psalm 19 what a powerful passage of Scripture beginning in verse number seven. The Bible says this, the law of the Lord is perfect. Converting the soul, the testimony of the Lord is sure, making wise the simple. The statutes of the Lord are right, rejoicing the heart. The commandment of the Lord is pure, enlightening the eyes. The fear of the Lord is clean, enduring forever. The judgments of the Lord are true and righteous altogether. Notice verse number 10, more to be desired are they than gold, yea, than much fine gold, sweeter also than honey in the honeycomb. I wonder this morning, how do we value the Word of God? Is it more precious to us than gold? Yea, than much fine gold? Notice in verse number 11 of the same passage, the Bible says, moreover, in addition to the truth that's already been given, moreover, by them, by the law of the Lord, by the Word of God, is thy servant warned. And in keeping of them, there is great reward. Psalm 119, on two occasions, and really, you can look at the entirety of Psalm 119 and see the value of the Word of God and the importance of imparting biblical truth, but I'll take just two verses from Psalm 119 this morning. Verse number 72, notice what the psalmist says here in Psalm 119 in verse number 72. The law of thy mouth is better unto me than thousands of gold and silver. I love the expression of the psalmist. I mean, he understood the value of the law of the Lord, of the truth that we have in our hands this morning. Verse 127, the psalmist says here, therefore, I love thy commandments above gold, yea, above fine gold. We have a society. in which their value system is different than our value system or at least it should be amen our value system should differ from the value system of the world in which we live and we think about the preciousness of the Word of God and we think about the importance of imparting biblical truth the reality this morning is that we have the opportunity to impart truth to a future generation as fathers to impart truth to your children as mature believers to impart truth to growing believers and oh how important that we're engaged in this work certainly there are people that buy gifts and we like to shower our children with gifts and show them nice things and that's wonderful but if it's in place of giving them the truth of this book it's not what we're supposed to be doing impart biblical truth the the wise man Solomon notes in Proverbs 23 and verse 23 buy the truth and sell it not I mean get understanding get wisdom you see it all throughout the book of Proverbs and oh how precious the Word of God is in Proverbs chapter number 30 the Bible speaks about the Word of God being pure oh I'm so thankful for the Word of God Jesus Christ before he went to the cross of Calvary he said sanctify them through thy word thy word is truth John 17 and verse 17 as we look back to the book of First Thessalonians I want you to notice several references in this chapter in this book with regard to the Apostle Paul's relationship in his imparting of biblical truth to these believers in Thessalonica and as he would write back to them this first letter we understand there's a second letter that we hold as well that we can read and study from but I want you to notice how that the Apostle Paul when he's writing under the inspiration of the Holy Spirit this first letter this epistle back to the church the believers in Thessalonica that he is rehearsing for us how he imparted biblical truth we understand that the record in Acts tells us that he reasoned with them out of the scriptures but here in First Thessalonians in chapter 1 look at verse number 5 the Bible says this for our gospel came not unto you in word only but also in power and in the Holy Ghost and in much assurance as ye know what manner of men we were among you for your sake and you became followers of us and of the Lord look at this having received the word in much affliction with joy of the Holy Ghost when he says that they received the word will notice as we continue to go through this book that he's very clearly referring to the Word of God to the scriptures to that which he had imparted to them and he says that they received the word in much affliction but with joy of the Holy Ghost see they were dealing with some trials and some difficulties I mentioned already by way of introduction the way that those folks came into the city of Thessalonica and they were not happy that Paul and others were going and sending forth the Word of God in fact it's in that passage of Scripture in which they make the accusation the charge that these that have turned the world upside down have come hither also they were preaching the Word of God they were imparting biblical truth in chapter 2 in verse number 2 notice the Bible says but even after that we had suffered before and were shamefully entreated notice this as you know at Philippi we know what happened at Philippi in Acts chapter 16 you can read of that and that's what happened just before they come to Thessalonica Paul and Silas remember they were imprisoned and God worked miraculously and they had suffered and they had been entreated shamefully entreated but notice where he says in verse number 2 we were bold in our God to speak unto you the gospel of God with much contention though they had suffered though they had been shamefully entreated though they dealt with opposition and difficulty Paul was absolutely 100% confident of the importance of the need of imparting biblical truth and he said though this cost me though I suffered for this when we came to this new city when we came to you in Thessalonica we were bold in our God to speak unto you the gospel of God with much contention to give the Word of God we find in verse number 9 look down of the same chapter it says for you remember brethren our labor and travail for laboring night and day because we would not be chargeable unto any of you notice we preached unto you the gospel of God verse number 13 for this cause also thank we God without ceasing because when you received the Word of God which he heard of us you received it not as the Word of men but as it is in truth the Word of God which effectually worketh also in you that believe what a great verse of Scripture Paul says to these believers he said that we thank God without ceasing by the way we ought to be thankful when people receive biblical truth yes we're thankful for the opportunity to impart impart biblical truth but when somebody receives that biblical truth we begin to see people be doers of the word and not hearers only people that begin to implement the Word of God in their lives how it should bring joy to our hearts how it should cause us to rejoice and thank God he says here because when you receive the Word of God which he heard of us see Paul understood that God was using him and others that were there on that missionary journey to impart this biblical truth and God will use you to impart biblical truth as well yes fathers to your children but what about the mature believer to the growing believer and by the way wherever you are in your walk with God there's someone that's not as far along in the journey that you can invest in and you can impart truth in you know why some people kind of get forgive me why some people kind of get cranky because they're not doing anything they just kind of get cranky you ever meet somebody that's cranky man we get to impart truth biblical truth listen you can find somebody that's not as far along on the journey as you are the importance is that you're on your journey and you're walking with God and you're making that progress and you come alongside someone else and you invest in them and you impart biblical truth Paul says that you received it listen I'm thankful that they were bold to preach the Word of God I'm thankful that even though they faced opposition they still went forth and imparted biblical truth the church at Thessalonica we've often mentioned over the years and many Bible commentators will make the same observation that this church in Thessalonica is not a perfect church because there's no such thing as a perfect church but this church in Thessalonica is a model church you can find a lot of things in this book first Thessalonians even in second Thessalonians that show how this is a model church and see Paul as we read here in verse number 13 he said you received the Word of God which you heard of us he said you received it not as it is not as the Word of men but as it is in truth the Word of God now notice the last phrase which effectually worketh also in you that believe this morning would you be able to testify that God's Word has worked in your life would you be able to stand up and say listen let me tell you how God's Word has changed me let me tell you how God's Word has helped me in fact perhaps you were reading your Bible this morning I hope you were and as you're reading your Bible this morning God was helping you as you're reading his Word and as you're getting fed and you're nourishing on the truth of God's Word this past week if someone were to come to you and I mean stand face-to-face with you and say to you today hey what did God show you from his Word this week would you have an answer see we don't do that a whole lot because we don't want to embarrass people or we don't want to be embarrassed mark you're laughing it's right though isn't it when's the last time somebody came up to you and said hey what's God teaching you in his Word how's God working in your life this week because his Word effectually worketh in you which also believe in this morning if you can testify that God's Word has has worked in you and it's made a difference in your life then guess what it will work in somebody else's life and you can look at somebody else you say oh they don't want the Word of God just look at them just whatever listen God's Word is powerful and we claim the promise of the Word of God that it will work it effectually worketh also in you that believe this morning impart biblical truth oh it's imperative we are living today in a society that could be described as being biblically ignorant but if we'd be honest you know who's responsible for that the church you know why Paul said that the church is the pillar and ground of the truth impart biblical truth it's a it's a it's a truth a principle that that spans time it was truthful for Paul and for He's a believer in Thessalonica, but it's important it's truthful for us today. Impart biblical truth. Notice chapter number four. In chapter number four, we're going to see kind of some of the specifics of biblical truth that Paul gave. Sometimes we like to speak in generalities, and sometimes the Word of God gets real specific. Further in chapter number four, notice what he says, furthermore then, we beseech you brethren and exhort you by the Lord Jesus that as you have received of us how you ought to walk and to please God, so you would abound more and more. When he speaks there in verse number one of you have received of us how you ought to walk and to please God, he's speaking of the imparting of biblical truth. They have received it. The apostle Paul and his team, they went in there and they ministered and they served and they gave the truth, and now he says, you have received of us how you ought to walk and to please God. And he says this, so you would abound more and more. Notice this in verse number two. For ye know what commandments we gave you by the Lord Jesus. For this is the will of God, even your sanctification, that ye should abstain from fornication. That every one of you should know how to possess his vessel in sanctification and honor, not in the lust of concupiscence, even of the Gentiles which know not God, or even as the Gentiles which know not God, that no man go beyond and defraud his brother in any manner, because that the Lord is the avenger of all such, as we also have forewarned you and testified. For God hath not called us unto uncleanness, but unto holiness. Be therefore that despiseth, despiseth not man, but God, who hath also given unto us his Holy Spirit. Notice in verse number 11, and that you study to be quiet and to do your own business and to work with your own hands as we commanded you. Verse 12, that you walk honestly toward them that are without, that you may have lack of nothing. Skip over to chapter number 15, or chapter 5 if you will. Look at verse number 15. Actually look back up in verse number 14, this is now we exhort you brethren, warn them that are unruly, comfort the feeble minded, support the weak, be patient toward all men, see that none render evil for evil unto any man, but even follow that which is good, both among yourselves and to all men. Rejoice evermore, pray without ceasing, in everything give thanks, for this is the will of God in Christ Jesus concerning you. Watch not the spirit, despise not prophesying, prove all things, hold fast that which is good, abstain from all appearance of evil. The very God of peace sanctify you wholly, and I pray God your whole spirit, soul and body be preserved blameless unto the coming of our Lord Jesus Christ. He says, faithful is he that calleth you, who also will do it. Brethren, pray for us. And all the brethren with an holy kiss, I charge you by the Lord that this epistle be read unto all the holy brethren, the grace of our Lord Jesus Christ be with you, amen. He got into some specifics, did he not? We don't have time to develop all of it this morning. But I want you to understand that he's imparting biblical truth. He's saying, listen, God has given us the word and he's taught us how we're to live and how we're to behave ourselves and what we're to do and what we're to avoid and he gives them biblical truth. And then he says this, in chapter number 5 and verse number 27, I charge you by the Lord that this epistle be read unto all the holy brethren. Why? Because we want to keep imparting biblical truth. Does that make sense? We just keep giving the Bible, just keep preaching the Bible, just keep teaching the Bible. I was talking to a pastor friend not long ago, and as we were talking, we were just discussing some of the different studies that we're doing and some of the different teaching and preaching and going through books and various studies and so on and so forth. And we were just chatting and the conversation came up. And for those of you that maybe somebody's watching that's an evangelist, I don't know why they'd be watching, but they would maybe take offense to this. But the pastor said something to the effect about how evangelism preaching is different than pastoral preaching. And sometimes as a pastor, you preach a passage of scripture and then someone says, hey, four years ago you preached that same text of scripture. And they'll say something to that regard and so on and so forth. And we were just chatting and having some good fellowship about it and talking about different studies and what have you. And here's what he said to me, and it was so profound, it's just a simple truth, but it was impactful. This man's been in the ministry for about 20 years longer than I've been in the ministry. And he said this. He said, when that happens in my ministry, I always just simply think this thought. When everyone sitting in the congregation obeys everything that I've preached, then I'll stop preaching it. And I said, you know what? That's pretty good. It's pretty good. Because we're to be doers of the word and not hearers only. Amen? Listen, we never stop imparting biblical truth. We got to keep giving it and keep giving it and keep giving it. Not only as fathers to our children, but as mature believers to growing believers. You say, well, I'm not a mature believer. Well, you're a growing believer somewhere further down the road than someone else. Amen? Number two this morning, not only do we impart biblical truth, but number two, we model biblical truth. We model biblical truth. Someone said, the message of your life has a far greater impact than the message of your lips. The message of your life has a far greater impact than the message of your lips. I would say this this morning, that it's absolutely necessary that the message of our lips be modeled in our lives. That as we would impart biblical truth, that we also are living biblical truth. That we're modeling that truth that we're teaching, that we're giving. It's interesting, Paul says this in Romans chapter number two, as he's really giving an indictment against the Jews in this passage of scripture. He says this in verse number 21 of Romans chapter number two. He says, what a great series of questions. Thou therefore which teachest another, teachest not thyself. It's a good question, is it not? Thou therefore, Romans 2 verse 21, which teachest another, teachest not thyself. Thou that preachest a man should not steal, dost thou steal? That would be hypocritical, would it not? Listen, don't steal, and then you're stealing. Hypocrisy. Verse 22, thou that sayest a man should not commit adultery, dost thou commit adultery? Thou that abhorrest idols, dost thou commit sacrilege? And so just in these two verses of scripture, he's giving a series of questions, and basically what he's telling us as we study here and look at these verses of scripture, listen, the message that we preach, the truth that we impart, we ought to be living that. We ought to be modeling that. How often we've heard people give testimony of someone that gave them some instruction, and as they were giving the instruction, were violating the same instruction that they were giving. How impactful do you think that instruction is? Don't do this while I'm doing it. How far do you think that's going to go? Not very far, right? And so we find that it is imperative that we impart biblical truth, but it's just as imperative that we model biblical truth. Notice here in the book of 1 Thessalonians, as we've mentioned that we're going to kind of take a survey here through this book, we looked at chapter 1 and verse number 5 earlier, but look at it again with me. In 1 Thessalonians 1 and verse number 5, Paul was faithful to impart biblical truth, but we find also that he was faithful to model biblical truth. It reminds me of the principle in Proverbs 23 and 26 when it says, my son, give me thine heart and let thine eyes observe my ways. I wonder this morning how many of us could really say to somebody, watch my life and just do what I do. Not in a prideful, arrogant way, but in a manner in which, listen, as best as we are able, through the power of the Holy Spirit, through yielding to him, through walking in the Spirit, not fulfilling the lust of the flesh, that we could say to somebody, just model my behavior. Paul said to the believers in Corinth, be followers of me, even also as I am of Christ. Paul was following the Lord Jesus Christ. Was he perfect? No. But he says, the things that you see in me do. He's modeling biblical truth. Notice in verse number 5 of 1 Thessalonians 1, it says this, for our gospel came not unto you in word only, but also in power and in the Holy Ghost and in much assurance. Notice this phrase, as ye know what manner of men we were among you for your sake. Listen, these people in Thessalonica, they saw Paul and the others. They observed what they were doing and how they were living. And as we look at the truth of this brief time that Paul was able to minister among these believers, not only was he imparting biblical truth, but he was modeling biblical truth. And you think about the impact of the ministry in Thessalonica and why, roughly, it appears as you read Acts 17, three weeks, it was three Sabbath days that they reasoned together with them. How in the world could a church be established and all of these things be done, and writing back to these believers and encouraging them, instructing them, because it was a message that was not lips only, it was a message that was modeled by the life as well. Great impact. When you look at the testimony of the Apostle Paul, you see a man that would go forth and boldly preach the Word of God, but he lived the Word of God. Here in chapter number two, look down at 1 Thessalonians 2 and verse number 7, the Bible says this, but we were gentle among you, even as a nurse cherisheth her children. Again, he's saying to these believers in Thessalonica, listen, you know how we behaved ourselves, you know how we acted, you know what we did. The reality is that in chapter number three, he talks about, you remember. Listen, he's writing to people that he ministered to. He can't pull the wool over their eyes. He's saying to them, you know how we behaved ourselves, you know how we were gentle among you, even as a nurse cherisheth her children. Look down, if you will, at verse number 10 of 1 Thessalonians 2, verse number 10. He says, ye are witnesses, and God also. Wow, that is a weighty statement. Ye, believers in Thessalonica, that's who he's writing to, right? Paul and Silvanus and Timotheus under the church of the Thessalonians, verse number 1 of chapter 1. He says, ye are witnesses, and God also. How wholly and justly and unblameably we behaved ourselves among you that believe. Wow, what a great testimony. It's on the inspiration of the Holy Ghost, right? The Word of God. And Paul says, listen, ye are witnesses, God also. God knows all things. God sees all things. He says, and you understand what our behavior was. You understand how we behaved ourselves among you that believe. He says, as the words that would be used to describe their behavior, wholly, just, and unblameable. Wow. That's a fantastic testimony. He says, not only did we impart biblical truth, but we modeled biblical truth. We didn't just tell you to not do these things or to do these things, but we lived the Word of God. We find here in verse number 11, he says, as ye know, we've used this as our title this morning, the last phrase, but notice the phrase again. He says in verse 10, ye are witnesses. He says in verse number 11, as ye know, how we exhorted and comforted and charged every one of you as a father doth his children. This morning, to the dads, do your children see you model biblical truth? Do your children observe you living a life pleasing to God, a life that matches the message of your lips? But to the mature believer, I wonder are there some growing believers that look at your life and see, this is someone that gets it. This is someone that's doing it, that they're obeying the Word of God. They're living the Word of God. I wonder this morning if we could make some of these same statements that Paul makes. See, as we begin to think about this truth this morning, these two principles, if you will, that we impart biblical truth, that we model biblical truth, and keeping in mind all the while what that goal is, the goal is that ye, those that you're ministering to, would walk worthy of God. And in order for me to achieve that goal, in order for me to see my children, in order for me to see some younger growing believers walk worthy of God, I need to be imparting truth and I need to be modeling truth, biblical truth. It's absolutely imperative. We notice the example of Paul. Of course, we're looking at it here in the book of 1 Thessalonians. But I want to remind you, if you turn back in your Bibles just a few pages to Philippians chapter number 4, I want to remind you what Paul said to the believers in Philippi. Again, Philippi is the city that he was able to enter into and minister amongst before he got to Thessalonica. And we can read of the record of this ministry in Acts chapter number 16. And as Paul, under the inspiration of the Holy Spirit of God, would write back to the church in Philippi, he gives them great instruction. He's writing from prison. He's talking about rejoicing evermore. Rejoice in the Lord, O Lord, and again I say rejoice. By the way, Paul was rejoicing, even in his circumstances, in his difficulties. I wonder this morning, as you think about the message of the book of Philippians, rejoice, rejoice, rejoice. I wonder this morning about that Philippian jailer when the book of Philippians was written and he read it. And he was the one that had put them fast in the prison. But he heard them sing praises unto God. The Philippian jailer got saved. He said, what must I do to be saved? Believe on the Lord Jesus Christ. Amen? And we find that that Philippian jailer was saved. But when Paul is saying rejoice in everything, rejoice in the Lord, O way, I believe that that Philippian jailer, he could say, you know, in the terrible circumstances that Paul was in, he was rejoicing. He's writing from prison. He says in the first chapter, the things that happened to me have happened for the furtherance of the gospel. He's rejoicing. But notice what he says in verse number nine of Philippians 4. Those things which ye have both learned and received and heard. Now those first three phrases of verse nine would be our first point this morning, impart biblical truth. Ye have received it, you've learned it, you've received it, you've heard, but notice the last phrase, and seen in me do. The God of peace shall be with you. Those things which I've imparted unto you, those things that you've learned, you've received, and you've heard, but those things that I modeled, that you've seen in me do. Have you ever been in a place where maybe you or maybe someone else that was in your presence, your company, had a child that behaved in a certain manner that was embarrassing? The parent, maybe you were in the situation, or maybe it was another parent, says, I don't know where they learned that. You ever been in a situation like that? You say, well, if I could be honest with you, I could probably help you understand where they learned that from. Amen? Because you know what children do? They model the behavior they see. I'm not saying 100% of the time, forever of their lives, but many times children model that which they see. We impart Biblical truth, but we model Biblical truth. Listen, the example of Paul is great, but we have a greater example, and that's the Lord Jesus Christ. Acts 1 says this of the Lord Jesus Christ. Notice what the Word of God says in Acts 1. We'll be finishing here in just a moment with this truth of the example of our wonderful Savior. Luke is writing here and the Bible says this in Acts 1, in verse number 1, the former treaties have I made, O Theophilus, of all that Jesus began, notice what it says, both to do and teach. This morning we acknowledge and understand that Jesus is the master teacher. Many times when we read the Gospel accounts, we don't even see all of what He was teaching, but we'll maybe just read a phrase of He was preaching or He was teaching. He's the master teacher. Nicodemus comes to Him by night. He says we know that thou art a teacher sent from God. And we find that as we look at the truth that God gives us in His Word of the Gospel records and we understand that these truths are given to us as the life and ministry of the Lord Jesus Christ, that it was both to do and teach. It was imparting truth, but it was also modeling truth. And Jesus says this, and of course we know that He is perfect and that He is the perfect example. He says in John 8, in verse number 29, for I do always those things that please Him. I do always those things that please Him. This morning Jesus is our example. Peter says that Christ left us an example that we should follow His steps. And as we examine this morning, and we'll visit again this evening, the book of 1 Thessalonians, with this thought in mind, as a father doth his children, and looking at it from really two perspectives, from fathers to children, but then from a mature believer to a growing believer. I'd ask you this question this morning in closing, or these two questions in closing this morning, to whom are you imparting biblical truth? To whom are you imparting biblical truth? If you don't have an answer for that question, I would encourage you to find someone to impart biblical truth to. I would challenge you not to be satisfied with a no one answer, because we ought to be imparting biblical truth. If you can't remember the last time that you've had an opportunity to share biblical truth and impart it to someone, I would encourage you this morning to ask God to help you to impart biblical truth. And then I wonder this morning, how are we doing in the area of modeling biblical truth? How many people do we want to see observing our lives? Can we say, as Paul said, that the things that you've seen in me do? I was teaching the teens a couple of weeks ago, and I use really as a springboard verse of Scripture by which we'll study throughout several weeks with the young people, this truth from 1 Samuel 16. And I won't get into all of it, but Saul's dealing with an issue where he has an evil spirit that's troubling him. And his counselors say, here's what we've got to do. We've got to find a man that can come in and play, and man, this is going to be great. And they just go, okay, find him. And one of the servants answered and said this in 1 Samuel 16, 18, just jot it down, and we can go back and read it later. He says, behold, I have seen a son of Jesse, the Bethlehemite, that is cunning and playing, and a mighty, valiant man, a man of war, prudent in matters, a comely person, and the Lord is with him. You know what I told the young people on Wednesday evening? Same thing I'm going to tell you now. I'm not sure that David even knew who this servant was. I'm not sure that David knew the servant was watching him, observing his behavior. You know what I told the young people? When somebody says, I'm watching you, we can behave a certain way, because we know somebody's watching us. I don't think David knew that this servant was watching him. When they said, go find a man, and that servant says, I've seen, I've seen a son of Jesse, a Bethlehemite, and here's how he describes him. Wow. People are watching you. People are watching me. A lot of people watch me. Seriously. I'm being honest, man. I'm not saying that pridefully, I'm just saying, with a position comes just certain things come along with it. But you know, people are watching you. That person at work, that person in your neighborhood, we need to find somebody to impart biblical truth to, but we need to make sure we're modeling biblical truth. First two principles. Three more tonight. Come back tonight. Challenge you to come back. I really believe this morning that as we look at this, just an overview of First Thessalonians, there's a lot more. I had a lot more in my notes that I could give you principle-wise, but five of them that I really believe will go far if we implement them in our lives to being able to see some people walk worthy of God. You know why? It's not going to happen by chance or by accident. We have the purpose to impart and then model biblical truth. Father, we love you. We thank you for loving us. We thank you so much for the opportunity to gather together, to honor fathers on this day, to rejoice in our relationship with you through the Lord Jesus Christ. I'm challenged personally through the message of First Thessalonians, the message from the perspective in which we've looked at it this morning. God, I pray that we would not soon forget that which we've heard. I pray that we'd truly allow the Holy Spirit of God to examine us. As we read in the end of First Thessalonians 5, quench not the spirit. Grieve not the spirit, Paul says in another portion of Scripture. Oh, God, I pray this morning that we'd be sensitive. We would not grieve nor quench the Holy Spirit of God, but that we would be doers of the Word, that we would understand the importance of imparting biblical truth. If we're not imparting biblical truth, God, would you help us to recognize the need and to engage in seeking earnestly to find someone that we can impart biblical truth to? God, help us always to model biblical truth, understanding that you see us at all times. There are many people that are observing us and we don't even know. As a man of yesteryear said, sometimes the only Bible a lost man will ever read is the life of a believer. How much truth, biblical truth are we modeling? Oh, God, help us. Help us to do business with thee. Well, thank you for the work that you'll do. We pray that you'd be glorified through every decision, for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed, no one's looking around. Kimberly's going to play quietly on the piano. Maybe this morning you want to come to this old-fashioned altar. Maybe you want to ask God to help you to impart biblical truth. Maybe you need to ask God to help you to model biblical truth. However it is that God may have worked in your heart and life this morning, would you allow God to have his way? The altar is open as Kimberly plays.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.159999847412109,
      "text": " And as you're turning to the book of 1 Thessalonians,"
    },
    {
      "id": 1,
      "start": 4.159999847412109,
      "end": 7.440000057220459,
      "text": " you'll be mindful that the Lord allowed the Apostle Paul"
    },
    {
      "id": 2,
      "start": 7.440000057220459,
      "end": 10.920000076293945,
      "text": " and his team to travel to the city of Thessalonica."
    },
    {
      "id": 3,
      "start": 10.920000076293945,
      "end": 12.899999618530273,
      "text": " It was during the second missionary journey"
    },
    {
      "id": 4,
      "start": 12.899999618530273,
      "end": 16.959999084472656,
      "text": " in which God allowed them to go to this particular city."
    },
    {
      "id": 5,
      "start": 16.959999084472656,
      "end": 18.8799991607666,
      "text": " And we find that as they arrived to the city,"
    },
    {
      "id": 6,
      "start": 18.8799991607666,
      "end": 20.559999465942383,
      "text": " we find the work that was done."
    },
    {
      "id": 7,
      "start": 20.559999465942383,
      "end": 24.219999313354492,
      "text": " And if you were to read Acts chapter number 17,"
    },
    {
      "id": 8,
      "start": 24.219999313354492,
      "end": 26.579999923706055,
      "text": " you'll have an opportunity to read the record"
    },
    {
      "id": 9,
      "start": 26.579999923706055,
      "end": 30.139999389648438,
      "text": " that God gives us of their entrance into that city"
    },
    {
      "id": 10,
      "start": 30.139999389648438,
      "end": 32.060001373291016,
      "text": " and their preaching of the gospel."
    },
    {
      "id": 11,
      "start": 32.060001373291016,
      "end": 34.58000183105469,
      "text": " And we understand that as we read the passage"
    },
    {
      "id": 12,
      "start": 34.58000183105469,
      "end": 35.939998626708984,
      "text": " in Acts chapter number 17,"
    },
    {
      "id": 13,
      "start": 35.939998626708984,
      "end": 38.459999084472656,
      "text": " that the time that they were able to spend"
    },
    {
      "id": 14,
      "start": 38.459999084472656,
      "end": 40.220001220703125,
      "text": " in the city of Thessalonica was brief."
    },
    {
      "id": 15,
      "start": 40.220001220703125,
      "end": 43.779998779296875,
      "text": " It was cut short from a human's perspective, if you will,"
    },
    {
      "id": 16,
      "start": 43.779998779296875,
      "end": 46.619998931884766,
      "text": " due to the opposition to the gospel."
    },
    {
      "id": 17,
      "start": 46.619998931884766,
      "end": 49.900001525878906,
      "text": " We understand that on this second missionary journey,"
    },
    {
      "id": 18,
      "start": 49.900001525878906,
      "end": 52.13999938964844,
      "text": " there were some that even as Paul and his team"
    },
    {
      "id": 19,
      "start": 52.13999938964844,
      "end": 53.380001068115234,
      "text": " arrived in Thessalonica,"
    },
    {
      "id": 20,
      "start": 53.380001068115234,
      "end": 55.439998626708984,
      "text": " there were some from other cities"
    },
    {
      "id": 21,
      "start": 55.439998626708984,
      "end": 56.91999816894531,
      "text": " that did not like the message"
    },
    {
      "id": 22,
      "start": 56.91999816894531,
      "end": 58.779998779296875,
      "text": " in which they were preaching that would come"
    },
    {
      "id": 23,
      "start": 58.779998779296875,
      "end": 61.7599983215332,
      "text": " and cause problems for Paul and his team"
    },
    {
      "id": 24,
      "start": 61.7599983215332,
      "end": 64.27999877929688,
      "text": " there in the city of Thessalonica."
    },
    {
      "id": 25,
      "start": 64.27999877929688,
      "end": 66.33999633789062,
      "text": " And we know that every time you attempt"
    },
    {
      "id": 26,
      "start": 66.33999633789062,
      "end": 69.12000274658203,
      "text": " to do a work for God, there will be opposition."
    },
    {
      "id": 27,
      "start": 69.12000274658203,
      "end": 70.58000183105469,
      "text": " And they face that opposition,"
    },
    {
      "id": 28,
      "start": 70.58000183105469,
      "end": 74.13999938964844,
      "text": " but it's interesting and exciting to understand"
    },
    {
      "id": 29,
      "start": 74.13999938964844,
      "end": 76.44000244140625,
      "text": " that just after a brief period of time"
    },
    {
      "id": 30,
      "start": 76.44000244140625,
      "end": 77.91999816894531,
      "text": " in the city of Thessalonica,"
    },
    {
      "id": 31,
      "start": 77.91999816894531,
      "end": 79.87999725341797,
      "text": " that a church was established."
    },
    {
      "id": 32,
      "start": 79.87999725341797,
      "end": 82.04000091552734,
      "text": " And we find that that church was established."
    },
    {
      "id": 33,
      "start": 82.04000091552734,
      "end": 84.0,
      "text": " And as you examine the communication"
    },
    {
      "id": 34,
      "start": 84.0,
      "end": 87.27999877929688,
      "text": " that God allows Paul to give to this church"
    },
    {
      "id": 35,
      "start": 87.27999877929688,
      "end": 88.62000274658203,
      "text": " that's part of the canon of scripture,"
    },
    {
      "id": 36,
      "start": 88.62000274658203,
      "end": 92.36000061035156,
      "text": " we understand all scripture is given by inspiration of God."
    },
    {
      "id": 37,
      "start": 92.36000061035156,
      "end": 95.0199966430664,
      "text": " As you study 1 and 2 Thessalonians,"
    },
    {
      "id": 38,
      "start": 95.0199966430664,
      "end": 97.76000213623047,
      "text": " and really in particular as our focus today"
    },
    {
      "id": 39,
      "start": 97.76000213623047,
      "end": 99.37999725341797,
      "text": " will be on the book of 1 Thessalonians,"
    },
    {
      "id": 40,
      "start": 99.37999725341797,
      "end": 102.5999984741211,
      "text": " you have the opportunity to really see"
    },
    {
      "id": 41,
      "start": 102.5999984741211,
      "end": 106.5199966430664,
      "text": " the way in which Paul and the believers in this church"
    },
    {
      "id": 42,
      "start": 106.5199966430664,
      "end": 109.31999969482422,
      "text": " had a close relationship."
    },
    {
      "id": 43,
      "start": 109.31999969482422,
      "end": 113.4000015258789,
      "text": " God allowed them to have a bind,"
    },
    {
      "id": 44,
      "start": 113.4000015258789,
      "end": 117.5199966430664,
      "text": " one with another to have this just tight relationship."
    },
    {
      "id": 45,
      "start": 117.5199966430664,
      "end": 121.0,
      "text": " And we find that as we look at the book of 1 Thessalonians,"
    },
    {
      "id": 46,
      "start": 121.0,
      "end": 124.31999969482422,
      "text": " I'm mindful this morning, and you know as well"
    },
    {
      "id": 47,
      "start": 124.31999969482422,
      "end": 126.95999908447266,
      "text": " that this book is written to a local church."
    },
    {
      "id": 48,
      "start": 126.95999908447266,
      "end": 129.16000366210938,
      "text": " It's written to a body of believers."
    },
    {
      "id": 49,
      "start": 129.16000366210938,
      "end": 130.8800048828125,
      "text": " And it is written from,"
    },
    {
      "id": 50,
      "start": 130.8800048828125,
      "end": 133.36000061035156,
      "text": " understood under the inspiration of the Holy Spirit,"
    },
    {
      "id": 51,
      "start": 133.36000061035156,
      "end": 135.47999572753906,
      "text": " but it is written from a church leader,"
    },
    {
      "id": 52,
      "start": 135.47999572753906,
      "end": 137.16000366210938,
      "text": " from the Apostle Paul."
    },
    {
      "id": 53,
      "start": 137.16000366210938,
      "end": 139.72000122070312,
      "text": " And we find that as Paul is writing this,"
    },
    {
      "id": 54,
      "start": 139.72000122070312,
      "end": 142.6199951171875,
      "text": " and he would reveal to us through various means"
    },
    {
      "id": 55,
      "start": 142.66000366210938,
      "end": 145.13999938964844,
      "text": " the relationship that they held."
    },
    {
      "id": 56,
      "start": 145.13999938964844,
      "end": 147.82000732421875,
      "text": " I'd like to use an expression that he uses"
    },
    {
      "id": 57,
      "start": 147.82000732421875,
      "end": 151.05999755859375,
      "text": " in 1 Thessalonians 2 and verse number 11 this morning,"
    },
    {
      "id": 58,
      "start": 151.05999755859375,
      "end": 153.89999389648438,
      "text": " and really will serve as our title."
    },
    {
      "id": 59,
      "start": 153.89999389648438,
      "end": 156.9600067138672,
      "text": " Look there at 1 Thessalonians 2 and verse number 11."
    },
    {
      "id": 60,
      "start": 156.9600067138672,
      "end": 159.10000610351562,
      "text": " The Bible says, as ye know,"
    },
    {
      "id": 61,
      "start": 159.10000610351562,
      "end": 163.5800018310547,
      "text": " how we exhorted and comforted and charged every one of you,"
    },
    {
      "id": 62,
      "start": 163.5800018310547,
      "end": 165.5399932861328,
      "text": " then notice this phrase,"
    },
    {
      "id": 63,
      "start": 165.5399932861328,
      "end": 169.66000366210938,
      "text": " as a father doth his children."
    },
    {
      "id": 64,
      "start": 169.66000366210938,
      "end": 173.17999267578125,
      "text": " As a father doth his children."
    },
    {
      "id": 65,
      "start": 173.17999267578125,
      "end": 176.25999450683594,
      "text": " As we look at that phrase and understand that again,"
    },
    {
      "id": 66,
      "start": 176.25999450683594,
      "end": 178.97999572753906,
      "text": " as I mentioned during our announcement time this morning,"
    },
    {
      "id": 67,
      "start": 178.97999572753906,
      "end": 181.22000122070312,
      "text": " that we'll have a part one this morning,"
    },
    {
      "id": 68,
      "start": 181.22000122070312,
      "end": 183.89999389648438,
      "text": " and a part two this evening,"
    },
    {
      "id": 69,
      "start": 183.89999389648438,
      "end": 185.3000030517578,
      "text": " having the same title,"
    },
    {
      "id": 70,
      "start": 185.3000030517578,
      "end": 188.89999389648438,
      "text": " as a father doth his children, part one and part two."
    },
    {
      "id": 71,
      "start": 188.89999389648438,
      "end": 190.94000244140625,
      "text": " As we begin to look at this short book,"
    },
    {
      "id": 72,
      "start": 190.94000244140625,
      "end": 193.52000427246094,
      "text": " we will find, and I know there's a lot more"
    },
    {
      "id": 73,
      "start": 193.52000427246094,
      "end": 195.16000366210938,
      "text": " than what we'll look at today,"
    },
    {
      "id": 74,
      "start": 195.16000366210938,
      "end": 197.72000122070312,
      "text": " but for sake of getting through it in one day,"
    },
    {
      "id": 75,
      "start": 197.75999450683594,
      "end": 199.16000366210938,
      "text": " and two messages,"
    },
    {
      "id": 76,
      "start": 199.16000366210938,
      "end": 201.63999938964844,
      "text": " I'd like to examine five principles"
    },
    {
      "id": 77,
      "start": 202.60000610351562,
      "end": 207.1199951171875,
      "text": " that I believe if we would implement these five principles,"
    },
    {
      "id": 78,
      "start": 207.1199951171875,
      "end": 211.10000610351562,
      "text": " that it will lead us to reaching the ultimate goal"
    },
    {
      "id": 79,
      "start": 211.10000610351562,
      "end": 215.0800018310547,
      "text": " that is noted in verse number 12 of the same chapter."
    },
    {
      "id": 80,
      "start": 215.0800018310547,
      "end": 217.0,
      "text": " Paul says at the end of verse number 11,"
    },
    {
      "id": 81,
      "start": 217.0,
      "end": 219.17999267578125,
      "text": " as a father doth his children,"
    },
    {
      "id": 82,
      "start": 219.17999267578125,
      "end": 222.86000061035156,
      "text": " then notice what the ultimate goal is,"
    },
    {
      "id": 83,
      "start": 222.86000061035156,
      "end": 227.60000610351562,
      "text": " that ye would walk worthy of God,"
    },
    {
      "id": 84,
      "start": 227.60000610351562,
      "end": 232.60000610351562,
      "text": " who hath called you unto His kingdom and glory."
    },
    {
      "id": 85,
      "start": 233.16000366210938,
      "end": 236.52000427246094,
      "text": " You understand that children are not going to"
    },
    {
      "id": 86,
      "start": 236.52000427246094,
      "end": 240.1999969482422,
      "text": " just by chance walk worthy of God?"
    },
    {
      "id": 87,
      "start": 241.44000244140625,
      "end": 245.75999450683594,
      "text": " New believers are not going to, by chance,"
    },
    {
      "id": 88,
      "start": 245.75999450683594,
      "end": 249.0,
      "text": " walk worthy of God."
    },
    {
      "id": 89,
      "start": 249.0,
      "end": 251.39999389648438,
      "text": " And as we examine the passage of Scripture"
    },
    {
      "id": 90,
      "start": 251.39999389648438,
      "end": 252.9600067138672,
      "text": " both this morning and this evening,"
    },
    {
      "id": 91,
      "start": 252.9600067138672,
      "end": 254.5,
      "text": " and really we're gonna look at the entire book,"
    },
    {
      "id": 92,
      "start": 254.5,
      "end": 256.8399963378906,
      "text": " and kinda just look at a variety of verses"
    },
    {
      "id": 93,
      "start": 256.8800048828125,
      "end": 258.32000732421875,
      "text": " throughout the book of 1 Thessalonians,"
    },
    {
      "id": 94,
      "start": 258.32000732421875,
      "end": 260.0,
      "text": " take an overview if you will."
    },
    {
      "id": 95,
      "start": 260.0,
      "end": 262.0400085449219,
      "text": " As we look at this book"
    },
    {
      "id": 96,
      "start": 262.0400085449219,
      "end": 264.79998779296875,
      "text": " and think of this truth this morning,"
    },
    {
      "id": 97,
      "start": 264.79998779296875,
      "end": 266.79998779296875,
      "text": " I want us to look at it from two perspectives."
    },
    {
      "id": 98,
      "start": 266.79998779296875,
      "end": 269.3800048828125,
      "text": " Number one, from a father to a child."
    },
    {
      "id": 99,
      "start": 270.739990234375,
      "end": 272.32000732421875,
      "text": " That parental relationship,"
    },
    {
      "id": 100,
      "start": 272.32000732421875,
      "end": 275.239990234375,
      "text": " we don't know and we find here that Paul,"
    },
    {
      "id": 101,
      "start": 275.239990234375,
      "end": 277.0,
      "text": " as he would use this expression,"
    },
    {
      "id": 102,
      "start": 277.0,
      "end": 278.8800048828125,
      "text": " as a father doth his children,"
    },
    {
      "id": 103,
      "start": 278.8800048828125,
      "end": 281.8399963378906,
      "text": " he's not explicitly giving instruction"
    },
    {
      "id": 104,
      "start": 281.8399963378906,
      "end": 283.8999938964844,
      "text": " in the book of 1 Thessalonians to dads"
    },
    {
      "id": 105,
      "start": 283.8999938964844,
      "end": 288.1000061035156,
      "text": " on how they are to work and minister to their children."
    },
    {
      "id": 106,
      "start": 288.1000061035156,
      "end": 292.1400146484375,
      "text": " Though the Bible contains much information about parenting"
    },
    {
      "id": 107,
      "start": 292.1400146484375,
      "end": 294.739990234375,
      "text": " and much truth is contained therein,"
    },
    {
      "id": 108,
      "start": 294.739990234375,
      "end": 297.6600036621094,
      "text": " we find that Paul is writing to a church."
    },
    {
      "id": 109,
      "start": 297.6600036621094,
      "end": 300.1199951171875,
      "text": " But he says in this same manner,"
    },
    {
      "id": 110,
      "start": 300.1199951171875,
      "end": 302.260009765625,
      "text": " as a father doth his children,"
    },
    {
      "id": 111,
      "start": 302.260009765625,
      "end": 304.6199951171875,
      "text": " this is how we were ministering."
    },
    {
      "id": 112,
      "start": 304.6199951171875,
      "end": 306.9599914550781,
      "text": " What a great truth."
    },
    {
      "id": 113,
      "start": 306.9599914550781,
      "end": 309.67999267578125,
      "text": " And I find that not only would we look at it this morning"
    },
    {
      "id": 114,
      "start": 309.67999267578125,
      "end": 313.05999755859375,
      "text": " from the perspective of a father to a child,"
    },
    {
      "id": 115,
      "start": 313.05999755859375,
      "end": 314.70001220703125,
      "text": " but I'd encourage you this morning"
    },
    {
      "id": 116,
      "start": 314.70001220703125,
      "end": 319.6000061035156,
      "text": " to look at it from a mature believer to a growing believer."
    },
    {
      "id": 117,
      "start": 319.6000061035156,
      "end": 323.0799865722656,
      "text": " A mature believer to a growing believer."
    },
    {
      "id": 118,
      "start": 323.0799865722656,
      "end": 324.8999938964844,
      "text": " You understand this morning that you may be here"
    },
    {
      "id": 119,
      "start": 324.8999938964844,
      "end": 327.4599914550781,
      "text": " and you say, I'm not a father, turn off the preacher."
    },
    {
      "id": 120,
      "start": 327.4599914550781,
      "end": 328.32000732421875,
      "text": " No, no, no, no."
    },
    {
      "id": 121,
      "start": 328.32000732421875,
      "end": 331.2200012207031,
      "text": " The word of God is applicable for all of us."
    },
    {
      "id": 122,
      "start": 331.2200012207031,
      "end": 332.79998779296875,
      "text": " And we find that the principles"
    },
    {
      "id": 123,
      "start": 332.79998779296875,
      "end": 334.3599853515625,
      "text": " that we'll look at this morning,"
    },
    {
      "id": 124,
      "start": 334.3599853515625,
      "end": 337.260009765625,
      "text": " as we would examine them from these two perspectives,"
    },
    {
      "id": 125,
      "start": 337.260009765625,
      "end": 339.5799865722656,
      "text": " I believe it will help us."
    },
    {
      "id": 126,
      "start": 339.5799865722656,
      "end": 341.2799987792969,
      "text": " And as we begin to look at the passage,"
    },
    {
      "id": 127,
      "start": 341.2799987792969,
      "end": 342.9599914550781,
      "text": " I just have two thoughts for you this morning,"
    },
    {
      "id": 128,
      "start": 342.9599914550781,
      "end": 345.0199890136719,
      "text": " and then we'll look at three thoughts this evening."
    },
    {
      "id": 129,
      "start": 345.0199890136719,
      "end": 346.2200012207031,
      "text": " But if you're taking notes,"
    },
    {
      "id": 130,
      "start": 346.2200012207031,
      "end": 348.44000244140625,
      "text": " number one, first principle"
    },
    {
      "id": 131,
      "start": 348.44000244140625,
      "end": 350.82000732421875,
      "text": " that I believe we need to implement in our lives,"
    },
    {
      "id": 132,
      "start": 350.82000732421875,
      "end": 354.55999755859375,
      "text": " number one, impart biblical truth."
    },
    {
      "id": 133,
      "start": 354.55999755859375,
      "end": 357.3999938964844,
      "text": " Impart biblical truth."
    },
    {
      "id": 134,
      "start": 357.3999938964844,
      "end": 361.0799865722656,
      "text": " As Paul arrives into the city of Thessalonica,"
    },
    {
      "id": 135,
      "start": 361.0799865722656,
      "end": 363.55999755859375,
      "text": " as the word of God would give us the record of that"
    },
    {
      "id": 136,
      "start": 363.55999755859375,
      "end": 365.0400085449219,
      "text": " in Acts chapter number 17,"
    },
    {
      "id": 137,
      "start": 365.0400085449219,
      "end": 366.55999755859375,
      "text": " we find at the end of verse number two"
    },
    {
      "id": 138,
      "start": 366.55999755859375,
      "end": 367.9599914550781,
      "text": " that the Bible says this,"
    },
    {
      "id": 139,
      "start": 367.9599914550781,
      "end": 372.9599914550781,
      "text": " that he reasoned with them out of the Scriptures."
    },
    {
      "id": 140,
      "start": 373.6600036621094,
      "end": 376.3399963378906,
      "text": " And the importance of imparting biblical truth,"
    },
    {
      "id": 141,
      "start": 376.3399963378906,
      "end": 378.9800109863281,
      "text": " oh, it's always been important,"
    },
    {
      "id": 142,
      "start": 378.9800109863281,
      "end": 381.70001220703125,
      "text": " but we find in the day and age in which we're living,"
    },
    {
      "id": 143,
      "start": 381.70001220703125,
      "end": 384.3800048828125,
      "text": " in the hour in which we're facing this morning,"
    },
    {
      "id": 144,
      "start": 384.3800048828125,
      "end": 388.29998779296875,
      "text": " oh, it is imperative that we, as the people of God,"
    },
    {
      "id": 145,
      "start": 388.29998779296875,
      "end": 390.8599853515625,
      "text": " would impart biblical truth."
    },
    {
      "id": 146,
      "start": 390.8599853515625,
      "end": 392.55999755859375,
      "text": " It was not necessary for Paul"
    },
    {
      "id": 147,
      "start": 392.55999755859375,
      "end": 394.70001220703125,
      "text": " to enter into the city of Thessalonica"
    },
    {
      "id": 148,
      "start": 394.70001220703125,
      "end": 396.4200134277344,
      "text": " and share his own opinions."
    },
    {
      "id": 149,
      "start": 396.44000244140625,
      "end": 398.32000732421875,
      "text": " It was not necessary for him to come there"
    },
    {
      "id": 150,
      "start": 398.32000732421875,
      "end": 400.5199890136719,
      "text": " and try to make them what he was."
    },
    {
      "id": 151,
      "start": 400.5199890136719,
      "end": 405.5199890136719,
      "text": " No, he went there and he imparted biblical truth."
    },
    {
      "id": 152,
      "start": 405.9599914550781,
      "end": 408.67999267578125,
      "text": " The book that we hold in our hands this morning"
    },
    {
      "id": 153,
      "start": 409.6400146484375,
      "end": 411.2799987792969,
      "text": " is the word of God."
    },
    {
      "id": 154,
      "start": 411.2799987792969,
      "end": 412.9800109863281,
      "text": " It's a living book."
    },
    {
      "id": 155,
      "start": 412.9800109863281,
      "end": 415.8800048828125,
      "text": " The Bible is quick and powerful"
    },
    {
      "id": 156,
      "start": 415.8800048828125,
      "end": 418.0,
      "text": " and sharper than any two-edged sword."
    },
    {
      "id": 157,
      "start": 418.0,
      "end": 419.1600036621094,
      "text": " We understand this morning"
    },
    {
      "id": 158,
      "start": 419.1600036621094,
      "end": 421.5400085449219,
      "text": " that there are some that do not like the Bible."
    },
    {
      "id": 159,
      "start": 421.5400085449219,
      "end": 424.1000061035156,
      "text": " There are some that would like to outlaw"
    },
    {
      "id": 160,
      "start": 424.1000061035156,
      "end": 425.55999755859375,
      "text": " the truth of God's Word"
    },
    {
      "id": 161,
      "start": 425.6199951171875,
      "end": 427.6600036621094,
      "text": " and to say that if you were to preach or teach"
    },
    {
      "id": 162,
      "start": 427.6600036621094,
      "end": 430.9800109863281,
      "text": " or even just share a truth from the Word of God"
    },
    {
      "id": 163,
      "start": 430.9800109863281,
      "end": 435.2200012207031,
      "text": " that it could be constituted as being hate speech."
    },
    {
      "id": 164,
      "start": 435.2200012207031,
      "end": 436.94000244140625,
      "text": " But the Word of God is truth."
    },
    {
      "id": 165,
      "start": 437.82000732421875,
      "end": 439.739990234375,
      "text": " The Word of God is powerful."
    },
    {
      "id": 166,
      "start": 439.739990234375,
      "end": 441.7799987792969,
      "text": " And we must impart biblical truth."
    },
    {
      "id": 167,
      "start": 441.7799987792969,
      "end": 444.3399963378906,
      "text": " Notice if you turn back to the book of Psalms,"
    },
    {
      "id": 168,
      "start": 444.3399963378906,
      "end": 445.70001220703125,
      "text": " and we're gonna look at a number of verses"
    },
    {
      "id": 169,
      "start": 445.70001220703125,
      "end": 447.94000244140625,
      "text": " and then make our way back to the book of 1 Thessalonians"
    },
    {
      "id": 170,
      "start": 447.94000244140625,
      "end": 449.70001220703125,
      "text": " and look at what Paul is doing"
    },
    {
      "id": 171,
      "start": 449.70001220703125,
      "end": 451.5400085449219,
      "text": " with these believers in Thessalonica"
    },
    {
      "id": 172,
      "start": 451.5400085449219,
      "end": 453.5799865722656,
      "text": " and be mindful of the truth that he says,"
    },
    {
      "id": 173,
      "start": 453.6400146484375,
      "end": 456.1600036621094,
      "text": " as a father doth his children,"
    },
    {
      "id": 174,
      "start": 456.1600036621094,
      "end": 457.55999755859375,
      "text": " practically speaking,"
    },
    {
      "id": 175,
      "start": 457.55999755859375,
      "end": 459.20001220703125,
      "text": " Psalm 19 as you're turning there,"
    },
    {
      "id": 176,
      "start": 459.20001220703125,
      "end": 461.7200012207031,
      "text": " practically speaking as Paul is ministering"
    },
    {
      "id": 177,
      "start": 461.7200012207031,
      "end": 463.760009765625,
      "text": " to these believers in Thessalonica,"
    },
    {
      "id": 178,
      "start": 463.760009765625,
      "end": 466.4800109863281,
      "text": " it is that second of the relationships that I mentioned"
    },
    {
      "id": 179,
      "start": 466.4800109863281,
      "end": 468.760009765625,
      "text": " that we'd like to look at it from these perspectives."
    },
    {
      "id": 180,
      "start": 468.760009765625,
      "end": 472.6000061035156,
      "text": " It's a mature believer to a growing believer."
    },
    {
      "id": 181,
      "start": 474.0,
      "end": 477.1199951171875,
      "text": " We find this morning in Psalm 19"
    },
    {
      "id": 182,
      "start": 477.1199951171875,
      "end": 479.32000732421875,
      "text": " what a powerful passage of Scripture"
    },
    {
      "id": 183,
      "start": 479.32000732421875,
      "end": 481.1199951171875,
      "text": " beginning in verse number seven."
    },
    {
      "id": 184,
      "start": 481.1400146484375,
      "end": 482.1400146484375,
      "text": " The Bible says this,"
    },
    {
      "id": 185,
      "start": 482.1400146484375,
      "end": 486.29998779296875,
      "text": " the law of the Lord is perfect."
    },
    {
      "id": 186,
      "start": 486.29998779296875,
      "end": 487.8999938964844,
      "text": " Converting the soul,"
    },
    {
      "id": 187,
      "start": 487.8999938964844,
      "end": 490.44000244140625,
      "text": " the testimony of the Lord is sure,"
    },
    {
      "id": 188,
      "start": 490.44000244140625,
      "end": 493.05999755859375,
      "text": " making wise the simple."
    },
    {
      "id": 189,
      "start": 493.05999755859375,
      "end": 495.3399963378906,
      "text": " The statutes of the Lord are right,"
    },
    {
      "id": 190,
      "start": 495.3399963378906,
      "end": 496.7799987792969,
      "text": " rejoicing the heart."
    },
    {
      "id": 191,
      "start": 496.7799987792969,
      "end": 499.05999755859375,
      "text": " The commandment of the Lord is pure,"
    },
    {
      "id": 192,
      "start": 499.05999755859375,
      "end": 500.8599853515625,
      "text": " enlightening the eyes."
    },
    {
      "id": 193,
      "start": 500.8599853515625,
      "end": 502.6199951171875,
      "text": " The fear of the Lord is clean,"
    },
    {
      "id": 194,
      "start": 502.6199951171875,
      "end": 504.260009765625,
      "text": " enduring forever."
    },
    {
      "id": 195,
      "start": 504.260009765625,
      "end": 506.0199890136719,
      "text": " The judgments of the Lord are true"
    },
    {
      "id": 196,
      "start": 506.0199890136719,
      "end": 507.94000244140625,
      "text": " and righteous altogether."
    },
    {
      "id": 197,
      "start": 507.94000244140625,
      "end": 509.260009765625,
      "text": " Notice verse number 10,"
    },
    {
      "id": 198,
      "start": 509.2799987792969,
      "end": 514.280029296875,
      "text": " more to be desired are they than gold,"
    },
    {
      "id": 199,
      "start": 514.9199829101562,
      "end": 517.7999877929688,
      "text": " yea, than much fine gold,"
    },
    {
      "id": 200,
      "start": 517.7999877929688,
      "end": 521.4400024414062,
      "text": " sweeter also than honey in the honeycomb."
    },
    {
      "id": 201,
      "start": 521.4400024414062,
      "end": 522.5999755859375,
      "text": " I wonder this morning,"
    },
    {
      "id": 202,
      "start": 522.5999755859375,
      "end": 524.260009765625,
      "text": " how do we value the Word of God?"
    },
    {
      "id": 203,
      "start": 525.5599975585938,
      "end": 529.6400146484375,
      "text": " Is it more precious to us than gold?"
    },
    {
      "id": 204,
      "start": 529.6400146484375,
      "end": 532.239990234375,
      "text": " Yea, than much fine gold?"
    },
    {
      "id": 205,
      "start": 532.239990234375,
      "end": 534.6799926757812,
      "text": " Notice in verse number 11 of the same passage,"
    },
    {
      "id": 206,
      "start": 534.6799926757812,
      "end": 535.5,
      "text": " the Bible says,"
    },
    {
      "id": 207,
      "start": 535.5,
      "end": 539.0599975585938,
      "text": " moreover, in addition to the truth"
    },
    {
      "id": 208,
      "start": 539.8800048828125,
      "end": 540.719970703125,
      "text": " that's already been given,"
    },
    {
      "id": 209,
      "start": 540.719970703125,
      "end": 543.47998046875,
      "text": " moreover, by them, by the law of the Lord,"
    },
    {
      "id": 210,
      "start": 543.47998046875,
      "end": 544.6799926757812,
      "text": " by the Word of God,"
    },
    {
      "id": 211,
      "start": 544.6799926757812,
      "end": 548.3200073242188,
      "text": " is thy servant warned."
    },
    {
      "id": 212,
      "start": 548.3200073242188,
      "end": 550.0800170898438,
      "text": " And in keeping of them,"
    },
    {
      "id": 213,
      "start": 550.0800170898438,
      "end": 551.7999877929688,
      "text": " there is great reward."
    },
    {
      "id": 214,
      "start": 551.7999877929688,
      "end": 554.8400268554688,
      "text": " Psalm 119, on two occasions,"
    },
    {
      "id": 215,
      "start": 554.8400268554688,
      "end": 557.52001953125,
      "text": " and really, you can look at the entirety of Psalm 119"
    },
    {
      "id": 216,
      "start": 557.52001953125,
      "end": 559.52001953125,
      "text": " and see the value of the Word of God"
    },
    {
      "id": 217,
      "start": 559.52001953125,
      "end": 561.47998046875,
      "text": " and the importance of imparting biblical truth,"
    },
    {
      "id": 218,
      "start": 561.47998046875,
      "end": 565.0399780273438,
      "text": " but I'll take just two verses from Psalm 119 this morning."
    },
    {
      "id": 219,
      "start": 565.0399780273438,
      "end": 566.3200073242188,
      "text": " Verse number 72,"
    },
    {
      "id": 220,
      "start": 566.3200073242188,
      "end": 568.1199951171875,
      "text": " notice what the psalmist says here"
    },
    {
      "id": 221,
      "start": 568.1400146484375,
      "end": 570.8200073242188,
      "text": " in Psalm 119 in verse number 72."
    },
    {
      "id": 222,
      "start": 570.8200073242188,
      "end": 574.1799926757812,
      "text": " The law of thy mouth is better unto me"
    },
    {
      "id": 223,
      "start": 574.1799926757812,
      "end": 577.8599853515625,
      "text": " than thousands of gold and silver."
    },
    {
      "id": 224,
      "start": 577.8599853515625,
      "end": 580.9400024414062,
      "text": " I love the expression of the psalmist."
    },
    {
      "id": 225,
      "start": 580.9400024414062,
      "end": 584.0999755859375,
      "text": " I mean, he understood the value of the law of the Lord,"
    },
    {
      "id": 226,
      "start": 584.0999755859375,
      "end": 586.9400024414062,
      "text": " of the truth that we have in our hands this morning."
    },
    {
      "id": 227,
      "start": 586.9400024414062,
      "end": 589.8400268554688,
      "text": " Verse 127, the psalmist says here,"
    },
    {
      "id": 228,
      "start": 589.8400268554688,
      "end": 593.6199951171875,
      "text": " therefore, I love thy commandments above gold,"
    },
    {
      "id": 229,
      "start": 593.6199951171875,
      "end": 595.9600219726562,
      "text": " yea, above fine gold."
    },
    {
      "id": 230,
      "start": 598.1199951171875,
      "end": 600.4600219726562,
      "text": " We have a society."
    },
    {
      "id": 0,
      "start": 600.4600219726562,
      "end": 604.7600221633911,
      "text": " in which their value system is different than our value system or at least it"
    },
    {
      "id": 1,
      "start": 604.7600221633911,
      "end": 609.8000221252441,
      "text": " should be amen our value system should differ from the value system of the"
    },
    {
      "id": 2,
      "start": 609.8000221252441,
      "end": 613.7200222015381,
      "text": " world in which we live and we think about the preciousness of the Word of"
    },
    {
      "id": 3,
      "start": 613.7200222015381,
      "end": 617.8400211334229,
      "text": " God and we think about the importance of imparting biblical truth the reality"
    },
    {
      "id": 4,
      "start": 617.8400211334229,
      "end": 623.640022277832,
      "text": " this morning is that we have the opportunity to impart truth to a future"
    },
    {
      "id": 5,
      "start": 623.640022277832,
      "end": 628.7800216674805,
      "text": " generation as fathers to impart truth to your children as mature believers to"
    },
    {
      "id": 6,
      "start": 628.7800216674805,
      "end": 634.7400207519531,
      "text": " impart truth to growing believers and oh how important that we're engaged in this"
    },
    {
      "id": 7,
      "start": 634.7400207519531,
      "end": 639.3000221252441,
      "text": " work certainly there are people that buy gifts and we like to shower our children"
    },
    {
      "id": 8,
      "start": 639.3000221252441,
      "end": 645.3400230407715,
      "text": " with gifts and show them nice things and that's wonderful but if it's in place of"
    },
    {
      "id": 9,
      "start": 645.3400230407715,
      "end": 650.7800216674805,
      "text": " giving them the truth of this book it's not what we're supposed to be doing"
    },
    {
      "id": 10,
      "start": 650.7800216674805,
      "end": 657.700023651123,
      "text": " impart biblical truth the the wise man Solomon notes in Proverbs 23 and verse"
    },
    {
      "id": 11,
      "start": 657.700023651123,
      "end": 664.2600212097168,
      "text": " 23 buy the truth and sell it not I mean get understanding get wisdom you see it"
    },
    {
      "id": 12,
      "start": 664.2600212097168,
      "end": 668.9000244140625,
      "text": " all throughout the book of Proverbs and oh how precious the Word of God is in"
    },
    {
      "id": 13,
      "start": 668.9000244140625,
      "end": 673.4600219726562,
      "text": " Proverbs chapter number 30 the Bible speaks about the Word of God being pure"
    },
    {
      "id": 14,
      "start": 673.4600219726562,
      "end": 679.3400192260742,
      "text": " oh I'm so thankful for the Word of God Jesus Christ before he went to the cross"
    },
    {
      "id": 15,
      "start": 679.3400192260742,
      "end": 687.3800201416016,
      "text": " of Calvary he said sanctify them through thy word thy word is truth John 17 and"
    },
    {
      "id": 16,
      "start": 687.3800201416016,
      "end": 692.7800216674805,
      "text": " verse 17 as we look back to the book of First Thessalonians I want you to notice"
    },
    {
      "id": 17,
      "start": 692.7800216674805,
      "end": 697.3000183105469,
      "text": " several references in this chapter in this book with regard to the Apostle"
    },
    {
      "id": 18,
      "start": 697.3000183105469,
      "end": 702.3800201416016,
      "text": " Paul's relationship in his imparting of biblical truth to these believers in"
    },
    {
      "id": 19,
      "start": 702.3800201416016,
      "end": 707.4600219726562,
      "text": " Thessalonica and as he would write back to them this first letter we understand"
    },
    {
      "id": 20,
      "start": 707.4600219726562,
      "end": 712.02001953125,
      "text": " there's a second letter that we hold as well that we can read and study from but"
    },
    {
      "id": 21,
      "start": 712.02001953125,
      "end": 715.5400238037109,
      "text": " I want you to notice how that the Apostle Paul when he's writing under the"
    },
    {
      "id": 22,
      "start": 715.5400238037109,
      "end": 719.5800247192383,
      "text": " inspiration of the Holy Spirit this first letter this epistle back to the"
    },
    {
      "id": 23,
      "start": 719.5800247192383,
      "end": 725.0600204467773,
      "text": " church the believers in Thessalonica that he is rehearsing for us how he"
    },
    {
      "id": 24,
      "start": 725.0600204467773,
      "end": 729.4200286865234,
      "text": " imparted biblical truth we understand that the record in Acts tells us that he"
    },
    {
      "id": 25,
      "start": 729.4200286865234,
      "end": 733.2600250244141,
      "text": " reasoned with them out of the scriptures but here in First Thessalonians in"
    },
    {
      "id": 26,
      "start": 733.2600250244141,
      "end": 739.1800231933594,
      "text": " chapter 1 look at verse number 5 the Bible says this for our gospel came not"
    },
    {
      "id": 27,
      "start": 739.1800231933594,
      "end": 744.1800231933594,
      "text": " unto you in word only but also in power and in the Holy Ghost and in much"
    },
    {
      "id": 28,
      "start": 744.1800231933594,
      "end": 749.7400207519531,
      "text": " assurance as ye know what manner of men we were among you for your sake and you"
    },
    {
      "id": 29,
      "start": 749.7400207519531,
      "end": 756.6600189208984,
      "text": " became followers of us and of the Lord look at this having received the word in"
    },
    {
      "id": 30,
      "start": 756.6600189208984,
      "end": 761.7000274658203,
      "text": " much affliction with joy of the Holy Ghost when he says that they received"
    },
    {
      "id": 31,
      "start": 761.7000274658203,
      "end": 766.1000213623047,
      "text": " the word will notice as we continue to go through this book that he's very"
    },
    {
      "id": 32,
      "start": 766.1000213623047,
      "end": 771.3400268554688,
      "text": " clearly referring to the Word of God to the scriptures to that which he had"
    },
    {
      "id": 33,
      "start": 771.3400268554688,
      "end": 777.4200286865234,
      "text": " imparted to them and he says that they received the word in much affliction but"
    },
    {
      "id": 34,
      "start": 777.4200286865234,
      "end": 782.1000213623047,
      "text": " with joy of the Holy Ghost see they were dealing with some trials and some"
    },
    {
      "id": 35,
      "start": 782.1000213623047,
      "end": 786.0600280761719,
      "text": " difficulties I mentioned already by way of introduction the way that those folks"
    },
    {
      "id": 36,
      "start": 786.0600280761719,
      "end": 790.2200164794922,
      "text": " came into the city of Thessalonica and they were not happy that Paul and others"
    },
    {
      "id": 37,
      "start": 790.2200164794922,
      "end": 794.1000213623047,
      "text": " were going and sending forth the Word of God in fact it's in that passage of"
    },
    {
      "id": 38,
      "start": 794.1000213623047,
      "end": 797.6600189208984,
      "text": " Scripture in which they make the accusation the charge that these that"
    },
    {
      "id": 39,
      "start": 797.6600189208984,
      "end": 802.6600189208984,
      "text": " have turned the world upside down have come hither also they were preaching the"
    },
    {
      "id": 40,
      "start": 802.6600189208984,
      "end": 809.7000274658203,
      "text": " Word of God they were imparting biblical truth in chapter 2 in verse number 2"
    },
    {
      "id": 41,
      "start": 809.7000274658203,
      "end": 814.7000274658203,
      "text": " notice the Bible says but even after that we had suffered before and were"
    },
    {
      "id": 42,
      "start": 814.7000274658203,
      "end": 819.2200164794922,
      "text": " shamefully entreated notice this as you know at Philippi we know what happened"
    },
    {
      "id": 43,
      "start": 819.2200164794922,
      "end": 822.8600158691406,
      "text": " at Philippi in Acts chapter 16 you can read of that and that's what happened"
    },
    {
      "id": 44,
      "start": 822.8600158691406,
      "end": 825.9400177001953,
      "text": " just before they come to Thessalonica Paul and Silas remember they were"
    },
    {
      "id": 45,
      "start": 825.9400177001953,
      "end": 830.6600189208984,
      "text": " imprisoned and God worked miraculously and they had suffered and they had been"
    },
    {
      "id": 46,
      "start": 830.6600189208984,
      "end": 834.3000183105469,
      "text": " entreated shamefully entreated but notice where he says in verse number 2"
    },
    {
      "id": 47,
      "start": 834.3000183105469,
      "end": 842.3800201416016,
      "text": " we were bold in our God to speak unto you the gospel of God with much"
    },
    {
      "id": 48,
      "start": 842.3800201416016,
      "end": 847.8200225830078,
      "text": " contention though they had suffered though they had been shamefully"
    },
    {
      "id": 49,
      "start": 847.8200225830078,
      "end": 852.3400268554688,
      "text": " entreated though they dealt with opposition and difficulty Paul was"
    },
    {
      "id": 50,
      "start": 852.3400268554688,
      "end": 858.5400085449219,
      "text": " absolutely 100% confident of the importance of the need of imparting"
    },
    {
      "id": 51,
      "start": 858.5400085449219,
      "end": 864.5000305175781,
      "text": " biblical truth and he said though this cost me though I suffered for this when"
    },
    {
      "id": 52,
      "start": 864.5000305175781,
      "end": 870.1800231933594,
      "text": " we came to this new city when we came to you in Thessalonica we were bold in our"
    },
    {
      "id": 53,
      "start": 870.1800231933594,
      "end": 876.780029296875,
      "text": " God to speak unto you the gospel of God with much contention to give the Word of"
    },
    {
      "id": 54,
      "start": 876.780029296875,
      "end": 883.9000244140625,
      "text": " God we find in verse number 9 look down of the same chapter it says for you"
    },
    {
      "id": 55,
      "start": 883.9000244140625,
      "end": 890.1800231933594,
      "text": " remember brethren our labor and travail for laboring night and day because we"
    },
    {
      "id": 56,
      "start": 890.1800231933594,
      "end": 895.6600341796875,
      "text": " would not be chargeable unto any of you notice we preached unto you the gospel"
    },
    {
      "id": 57,
      "start": 895.6600341796875,
      "end": 902.6200256347656,
      "text": " of God verse number 13 for this cause also thank we God without ceasing"
    },
    {
      "id": 58,
      "start": 902.6200256347656,
      "end": 908.1800231933594,
      "text": " because when you received the Word of God which he heard of us you received"
    },
    {
      "id": 59,
      "start": 908.1800231933594,
      "end": 914.1400146484375,
      "text": " it not as the Word of men but as it is in truth the Word of God which"
    },
    {
      "id": 60,
      "start": 914.1400146484375,
      "end": 919.9000244140625,
      "text": " effectually worketh also in you that believe what a great verse of Scripture"
    },
    {
      "id": 61,
      "start": 919.9000244140625,
      "end": 925.02001953125,
      "text": " Paul says to these believers he said that we thank God without ceasing by the"
    },
    {
      "id": 62,
      "start": 925.02001953125,
      "end": 929.02001953125,
      "text": " way we ought to be thankful when people receive biblical truth yes we're"
    },
    {
      "id": 63,
      "start": 929.02001953125,
      "end": 933.3000183105469,
      "text": " thankful for the opportunity to impart impart biblical truth but when somebody"
    },
    {
      "id": 64,
      "start": 933.3000183105469,
      "end": 937.9000244140625,
      "text": " receives that biblical truth we begin to see people be doers of the word and not"
    },
    {
      "id": 65,
      "start": 937.9000244140625,
      "end": 942.780029296875,
      "text": " hearers only people that begin to implement the Word of God in their lives"
    },
    {
      "id": 66,
      "start": 942.780029296875,
      "end": 947.4200134277344,
      "text": " how it should bring joy to our hearts how it should cause us to rejoice and"
    },
    {
      "id": 67,
      "start": 947.4200134277344,
      "end": 953.3000183105469,
      "text": " thank God he says here because when you receive the Word of God which he heard"
    },
    {
      "id": 68,
      "start": 953.3000183105469,
      "end": 958.7000122070312,
      "text": " of us see Paul understood that God was using him and others that were there on"
    },
    {
      "id": 69,
      "start": 958.7000122070312,
      "end": 963.7000122070312,
      "text": " that missionary journey to impart this biblical truth and God will use you to"
    },
    {
      "id": 70,
      "start": 963.7000122070312,
      "end": 969.1400146484375,
      "text": " impart biblical truth as well yes fathers to your children but what about"
    },
    {
      "id": 71,
      "start": 969.1400146484375,
      "end": 973.2200317382812,
      "text": " the mature believer to the growing believer and by the way wherever you are"
    },
    {
      "id": 72,
      "start": 973.2200317382812,
      "end": 977.5400085449219,
      "text": " in your walk with God there's someone that's not as far along in the journey"
    },
    {
      "id": 73,
      "start": 977.5400085449219,
      "end": 982.5400085449219,
      "text": " that you can invest in and you can impart truth in you know why some people"
    },
    {
      "id": 74,
      "start": 982.5400085449219,
      "end": 988.1000366210938,
      "text": " kind of get forgive me why some people kind of get cranky because they're not"
    },
    {
      "id": 75,
      "start": 988.1000366210938,
      "end": 993.0600280761719,
      "text": " doing anything they just kind of get cranky you ever meet somebody that's"
    },
    {
      "id": 76,
      "start": 993.0600280761719,
      "end": 1001.2200317382812,
      "text": " cranky man we get to impart truth biblical truth listen you can find"
    },
    {
      "id": 77,
      "start": 1001.2200317382812,
      "end": 1005.4600219726562,
      "text": " somebody that's not as far along on the journey as you are the importance is"
    },
    {
      "id": 78,
      "start": 1005.4600219726562,
      "end": 1008.4600219726562,
      "text": " that you're on your journey and you're walking with God and you're making that"
    },
    {
      "id": 79,
      "start": 1008.4600219726562,
      "end": 1012.4600219726562,
      "text": " progress and you come alongside someone else and you invest in them and you"
    },
    {
      "id": 80,
      "start": 1012.4600219726562,
      "end": 1018.4600219726562,
      "text": " impart biblical truth Paul says that you received it listen I'm thankful that"
    },
    {
      "id": 81,
      "start": 1018.4600219726562,
      "end": 1024.5400085449219,
      "text": " they were bold to preach the Word of God I'm thankful that even though they faced"
    },
    {
      "id": 82,
      "start": 1024.5400085449219,
      "end": 1030.780029296875,
      "text": " opposition they still went forth and imparted biblical truth the church at"
    },
    {
      "id": 83,
      "start": 1030.780029296875,
      "end": 1034.9000244140625,
      "text": " Thessalonica we've often mentioned over the years and many Bible commentators"
    },
    {
      "id": 84,
      "start": 1034.9000244140625,
      "end": 1040.02001953125,
      "text": " will make the same observation that this church in Thessalonica is not a perfect"
    },
    {
      "id": 85,
      "start": 1040.02001953125,
      "end": 1043.8200073242188,
      "text": " church because there's no such thing as a perfect church but this church in"
    },
    {
      "id": 86,
      "start": 1043.8200073242188,
      "end": 1048.9800109863281,
      "text": " Thessalonica is a model church you can find a lot of things in this book first"
    },
    {
      "id": 87,
      "start": 1048.9800109863281,
      "end": 1051.7400207519531,
      "text": " Thessalonians even in second Thessalonians that show how this is a"
    },
    {
      "id": 88,
      "start": 1051.7400207519531,
      "end": 1057.6600341796875,
      "text": " model church and see Paul as we read here in verse number 13 he said you"
    },
    {
      "id": 89,
      "start": 1057.6600341796875,
      "end": 1063.02001953125,
      "text": " received the Word of God which you heard of us he said you received it not as it"
    },
    {
      "id": 90,
      "start": 1063.02001953125,
      "end": 1071.1800231933594,
      "text": " is not as the Word of men but as it is in truth the Word of God now notice the"
    },
    {
      "id": 91,
      "start": 1071.1800231933594,
      "end": 1078.1000366210938,
      "text": " last phrase which effectually worketh also in you that believe this morning"
    },
    {
      "id": 92,
      "start": 1078.1000366210938,
      "end": 1083.5000305175781,
      "text": " would you be able to testify that God's Word has worked in your life would you"
    },
    {
      "id": 93,
      "start": 1083.5000305175781,
      "end": 1087.5400085449219,
      "text": " be able to stand up and say listen let me tell you how God's Word has changed"
    },
    {
      "id": 94,
      "start": 1087.5400085449219,
      "end": 1091.5000305175781,
      "text": " me let me tell you how God's Word has helped me in fact perhaps you were"
    },
    {
      "id": 95,
      "start": 1091.5000305175781,
      "end": 1094.2200317382812,
      "text": " reading your Bible this morning I hope you were and as you're reading your"
    },
    {
      "id": 96,
      "start": 1094.2200317382812,
      "end": 1097.6600341796875,
      "text": " Bible this morning God was helping you as you're reading his Word and as you're"
    },
    {
      "id": 97,
      "start": 1097.6600341796875,
      "end": 1102.1000366210938,
      "text": " getting fed and you're nourishing on the truth of God's Word this past week if"
    },
    {
      "id": 98,
      "start": 1102.1000366210938,
      "end": 1106.0600280761719,
      "text": " someone were to come to you and I mean stand face-to-face with you and say to"
    },
    {
      "id": 99,
      "start": 1106.0600280761719,
      "end": 1109.780029296875,
      "text": " you today hey what did God show you from his Word this week would you have an"
    },
    {
      "id": 100,
      "start": 1109.780029296875,
      "end": 1115.300048828125,
      "text": " answer see we don't do that a whole lot because we don't want to embarrass"
    },
    {
      "id": 101,
      "start": 1115.300048828125,
      "end": 1119.6199951171875,
      "text": " people or we don't want to be embarrassed mark you're laughing it's"
    },
    {
      "id": 102,
      "start": 1119.6199951171875,
      "end": 1122.9400024414062,
      "text": " right though isn't it when's the last time somebody came up to you and said"
    },
    {
      "id": 103,
      "start": 1122.9400024414062,
      "end": 1127.8600463867188,
      "text": " hey what's God teaching you in his Word how's God working in your life this week"
    },
    {
      "id": 104,
      "start": 1127.8600463867188,
      "end": 1134.0400390625,
      "text": " because his Word effectually worketh in you which also believe in this morning"
    },
    {
      "id": 105,
      "start": 1134.0400390625,
      "end": 1138.9000244140625,
      "text": " if you can testify that God's Word has has worked in you and it's made a"
    },
    {
      "id": 106,
      "start": 1138.9000244140625,
      "end": 1142.9800415039062,
      "text": " difference in your life then guess what it will work in somebody else's life and"
    },
    {
      "id": 107,
      "start": 1142.9800415039062,
      "end": 1146.6199951171875,
      "text": " you can look at somebody else you say oh they don't want the Word of God just"
    },
    {
      "id": 108,
      "start": 1146.6199951171875,
      "end": 1151.8200073242188,
      "text": " look at them just whatever listen God's Word is powerful and we claim the"
    },
    {
      "id": 109,
      "start": 1151.8200073242188,
      "end": 1157.780029296875,
      "text": " promise of the Word of God that it will work it effectually worketh also in you"
    },
    {
      "id": 110,
      "start": 1157.780029296875,
      "end": 1166.5,
      "text": " that believe this morning impart biblical truth oh it's imperative we are"
    },
    {
      "id": 111,
      "start": 1166.5,
      "end": 1173.5400390625,
      "text": " living today in a society that could be described as being biblically ignorant"
    },
    {
      "id": 112,
      "start": 1174.4200439453125,
      "end": 1183.1799926757812,
      "text": " but if we'd be honest you know who's responsible for that the church you know"
    },
    {
      "id": 113,
      "start": 1183.1799926757812,
      "end": 1190.2200317382812,
      "text": " why Paul said that the church is the pillar and ground of the truth impart"
    },
    {
      "id": 114,
      "start": 1190.2200317382812,
      "end": 1196.9000244140625,
      "text": " biblical truth it's a it's a it's a truth a principle that that spans time"
    },
    {
      "id": 115,
      "start": 1196.9000244140625,
      "end": 1202.300048828125,
      "text": " it was truthful for Paul and for"
    },
    {
      "id": 0,
      "start": 1202.300048828125,
      "end": 1205.9800488948822,
      "text": " He's a believer in Thessalonica, but it's important it's truthful for us today."
    },
    {
      "id": 1,
      "start": 1205.9800488948822,
      "end": 1208.260048866272,
      "text": " Impart biblical truth."
    },
    {
      "id": 2,
      "start": 1208.260048866272,
      "end": 1211.2400484085083,
      "text": " Notice chapter number four."
    },
    {
      "id": 3,
      "start": 1211.2400484085083,
      "end": 1218.0200490951538,
      "text": " In chapter number four, we're going to see kind of some of the specifics of biblical"
    },
    {
      "id": 4,
      "start": 1218.0200490951538,
      "end": 1221.5800495147705,
      "text": " truth that Paul gave."
    },
    {
      "id": 5,
      "start": 1221.5800495147705,
      "end": 1228.5400485992432,
      "text": " Sometimes we like to speak in generalities, and sometimes the Word of God gets real specific."
    },
    {
      "id": 6,
      "start": 1228.5400485992432,
      "end": 1232.2800483703613,
      "text": " Further in chapter number four, notice what he says, furthermore then, we beseech you"
    },
    {
      "id": 7,
      "start": 1232.2800483703613,
      "end": 1239.1600494384766,
      "text": " brethren and exhort you by the Lord Jesus that as you have received of us how you ought"
    },
    {
      "id": 8,
      "start": 1239.1600494384766,
      "end": 1244.700050354004,
      "text": " to walk and to please God, so you would abound more and more."
    },
    {
      "id": 9,
      "start": 1244.700050354004,
      "end": 1248.1200485229492,
      "text": " When he speaks there in verse number one of you have received of us how you ought to walk"
    },
    {
      "id": 10,
      "start": 1248.1200485229492,
      "end": 1252.0400505065918,
      "text": " and to please God, he's speaking of the imparting of biblical truth."
    },
    {
      "id": 11,
      "start": 1252.0400505065918,
      "end": 1254.1200485229492,
      "text": " They have received it."
    },
    {
      "id": 12,
      "start": 1254.1200485229492,
      "end": 1257.9400482177734,
      "text": " The apostle Paul and his team, they went in there and they ministered and they served"
    },
    {
      "id": 13,
      "start": 1257.9400482177734,
      "end": 1264.0200500488281,
      "text": " and they gave the truth, and now he says, you have received of us how you ought to"
    },
    {
      "id": 14,
      "start": 1264.0200500488281,
      "end": 1266.2200469970703,
      "text": " walk and to please God."
    },
    {
      "id": 15,
      "start": 1266.2200469970703,
      "end": 1268.1600494384766,
      "text": " And he says this, so you would abound more and more."
    },
    {
      "id": 16,
      "start": 1268.1600494384766,
      "end": 1269.5000457763672,
      "text": " Notice this in verse number two."
    },
    {
      "id": 17,
      "start": 1269.5000457763672,
      "end": 1274.2200469970703,
      "text": " For ye know what commandments we gave you by the Lord Jesus."
    },
    {
      "id": 18,
      "start": 1274.2200469970703,
      "end": 1282.200050354004,
      "text": " For this is the will of God, even your sanctification, that ye should abstain from fornication."
    },
    {
      "id": 19,
      "start": 1282.200050354004,
      "end": 1288.920051574707,
      "text": " That every one of you should know how to possess his vessel in sanctification and honor,"
    },
    {
      "id": 20,
      "start": 1288.920051574707,
      "end": 1293.3600463867188,
      "text": " not in the lust of concupiscence, even of the Gentiles which know not God, or even as"
    },
    {
      "id": 21,
      "start": 1293.3600463867188,
      "end": 1299.7200469970703,
      "text": " the Gentiles which know not God, that no man go beyond and defraud his brother in any manner,"
    },
    {
      "id": 22,
      "start": 1299.7200469970703,
      "end": 1305.6600494384766,
      "text": " because that the Lord is the avenger of all such, as we also have forewarned you and testified."
    },
    {
      "id": 23,
      "start": 1305.6600494384766,
      "end": 1310.6400451660156,
      "text": " For God hath not called us unto uncleanness, but unto holiness."
    },
    {
      "id": 24,
      "start": 1310.6400451660156,
      "end": 1316.6000518798828,
      "text": " Be therefore that despiseth, despiseth not man, but God, who hath also given unto us"
    },
    {
      "id": 25,
      "start": 1316.6000518798828,
      "end": 1318.200050354004,
      "text": " his Holy Spirit."
    },
    {
      "id": 26,
      "start": 1318.200050354004,
      "end": 1322.3200454711914,
      "text": " Notice in verse number 11, and that you study to be quiet and to do your own business and"
    },
    {
      "id": 27,
      "start": 1322.3200454711914,
      "end": 1327.0800476074219,
      "text": " to work with your own hands as we commanded you."
    },
    {
      "id": 28,
      "start": 1327.0800476074219,
      "end": 1333.4400482177734,
      "text": " Verse 12, that you walk honestly toward them that are without, that you may have lack of"
    },
    {
      "id": 29,
      "start": 1333.4400482177734,
      "end": 1334.4400482177734,
      "text": " nothing."
    },
    {
      "id": 30,
      "start": 1334.4400482177734,
      "end": 1337.4600524902344,
      "text": " Skip over to chapter number 15, or chapter 5 if you will."
    },
    {
      "id": 31,
      "start": 1337.4600524902344,
      "end": 1341.3400421142578,
      "text": " Look at verse number 15."
    },
    {
      "id": 32,
      "start": 1341.3400421142578,
      "end": 1345.2200469970703,
      "text": " Actually look back up in verse number 14, this is now we exhort you brethren, warn them"
    },
    {
      "id": 33,
      "start": 1345.2200469970703,
      "end": 1351.060043334961,
      "text": " that are unruly, comfort the feeble minded, support the weak, be patient toward all men,"
    },
    {
      "id": 34,
      "start": 1351.060043334961,
      "end": 1355.540054321289,
      "text": " see that none render evil for evil unto any man, but even follow that which is good, both"
    },
    {
      "id": 35,
      "start": 1355.540054321289,
      "end": 1357.5800476074219,
      "text": " among yourselves and to all men."
    },
    {
      "id": 36,
      "start": 1357.5800476074219,
      "end": 1361.9000549316406,
      "text": " Rejoice evermore, pray without ceasing, in everything give thanks, for this is the will"
    },
    {
      "id": 37,
      "start": 1361.9000549316406,
      "end": 1364.5000457763672,
      "text": " of God in Christ Jesus concerning you."
    },
    {
      "id": 38,
      "start": 1364.5000457763672,
      "end": 1369.1800537109375,
      "text": " Watch not the spirit, despise not prophesying, prove all things, hold fast that which is"
    },
    {
      "id": 39,
      "start": 1369.1800537109375,
      "end": 1373.3800506591797,
      "text": " good, abstain from all appearance of evil."
    },
    {
      "id": 40,
      "start": 1373.3800506591797,
      "end": 1377.7400512695312,
      "text": " The very God of peace sanctify you wholly, and I pray God your whole spirit, soul and"
    },
    {
      "id": 41,
      "start": 1377.7400512695312,
      "end": 1383.7000427246094,
      "text": " body be preserved blameless unto the coming of our Lord Jesus Christ."
    },
    {
      "id": 42,
      "start": 1383.7000427246094,
      "end": 1387.8600463867188,
      "text": " He says, faithful is he that calleth you, who also will do it."
    },
    {
      "id": 43,
      "start": 1387.8600463867188,
      "end": 1390.2200469970703,
      "text": " Brethren, pray for us."
    },
    {
      "id": 44,
      "start": 1390.2200469970703,
      "end": 1394.7400512695312,
      "text": " And all the brethren with an holy kiss, I charge you by the Lord that this epistle"
    },
    {
      "id": 45,
      "start": 1394.7400512695312,
      "end": 1400.9000549316406,
      "text": " be read unto all the holy brethren, the grace of our Lord Jesus Christ be with you, amen."
    },
    {
      "id": 46,
      "start": 1400.9000549316406,
      "end": 1402.5000457763672,
      "text": " He got into some specifics, did he not?"
    },
    {
      "id": 47,
      "start": 1402.5000457763672,
      "end": 1405.5000457763672,
      "text": " We don't have time to develop all of it this morning."
    },
    {
      "id": 48,
      "start": 1405.5000457763672,
      "end": 1408.6200561523438,
      "text": " But I want you to understand that he's imparting biblical truth."
    },
    {
      "id": 49,
      "start": 1408.6200561523438,
      "end": 1413.4600524902344,
      "text": " He's saying, listen, God has given us the word and he's taught us how we're to live"
    },
    {
      "id": 50,
      "start": 1413.4600524902344,
      "end": 1417.6400451660156,
      "text": " and how we're to behave ourselves and what we're to do and what we're to avoid and he"
    },
    {
      "id": 51,
      "start": 1418.040054321289,
      "end": 1420.2400512695312,
      "text": " gives them biblical truth."
    },
    {
      "id": 52,
      "start": 1420.2400512695312,
      "end": 1426.8400421142578,
      "text": " And then he says this, in chapter number 5 and verse number 27, I charge you by the Lord"
    },
    {
      "id": 53,
      "start": 1426.8400421142578,
      "end": 1430.2400512695312,
      "text": " that this epistle be read unto all the holy brethren."
    },
    {
      "id": 54,
      "start": 1430.2400512695312,
      "end": 1431.2400512695312,
      "text": " Why?"
    },
    {
      "id": 55,
      "start": 1431.2400512695312,
      "end": 1433.280044555664,
      "text": " Because we want to keep imparting biblical truth."
    },
    {
      "id": 56,
      "start": 1433.280044555664,
      "end": 1435.3600463867188,
      "text": " Does that make sense?"
    },
    {
      "id": 57,
      "start": 1435.3600463867188,
      "end": 1441.040054321289,
      "text": " We just keep giving the Bible, just keep preaching the Bible, just keep teaching the Bible."
    },
    {
      "id": 58,
      "start": 1441.040054321289,
      "end": 1445.6400451660156,
      "text": " I was talking to a pastor friend not long ago, and as we were talking, we were just"
    },
    {
      "id": 59,
      "start": 1445.6400451660156,
      "end": 1449.8800506591797,
      "text": " discussing some of the different studies that we're doing and some of the different"
    },
    {
      "id": 60,
      "start": 1449.8800506591797,
      "end": 1453.9600524902344,
      "text": " teaching and preaching and going through books and various studies and so on and so forth."
    },
    {
      "id": 61,
      "start": 1453.9600524902344,
      "end": 1458.2400512695312,
      "text": " And we were just chatting and the conversation came up."
    },
    {
      "id": 62,
      "start": 1458.2400512695312,
      "end": 1461.3200378417969,
      "text": " And for those of you that maybe somebody's watching that's an evangelist, I don't know"
    },
    {
      "id": 63,
      "start": 1461.3200378417969,
      "end": 1464.2000427246094,
      "text": " why they'd be watching, but they would maybe take offense to this."
    },
    {
      "id": 64,
      "start": 1464.2000427246094,
      "end": 1468.8800354003906,
      "text": " But the pastor said something to the effect about how evangelism preaching is different"
    },
    {
      "id": 65,
      "start": 1468.8800354003906,
      "end": 1470.8400573730469,
      "text": " than pastoral preaching."
    },
    {
      "id": 66,
      "start": 1470.8400573730469,
      "end": 1475.5200500488281,
      "text": " And sometimes as a pastor, you preach a passage of scripture and then someone says, hey, four"
    },
    {
      "id": 67,
      "start": 1475.5200500488281,
      "end": 1479.3200378417969,
      "text": " years ago you preached that same text of scripture."
    },
    {
      "id": 68,
      "start": 1479.3200378417969,
      "end": 1482.0000610351562,
      "text": " And they'll say something to that regard and so on and so forth."
    },
    {
      "id": 69,
      "start": 1482.0000610351562,
      "end": 1486.2400512695312,
      "text": " And we were just chatting and having some good fellowship about it and talking about"
    },
    {
      "id": 70,
      "start": 1486.2400512695312,
      "end": 1488.0000610351562,
      "text": " different studies and what have you."
    },
    {
      "id": 71,
      "start": 1488.0000610351562,
      "end": 1491.6000366210938,
      "text": " And here's what he said to me, and it was so profound, it's just a simple truth, but"
    },
    {
      "id": 72,
      "start": 1491.6000366210938,
      "end": 1492.6000366210938,
      "text": " it was impactful."
    },
    {
      "id": 73,
      "start": 1492.6000366210938,
      "end": 1496.56005859375,
      "text": " This man's been in the ministry for about 20 years longer than I've been in the ministry."
    },
    {
      "id": 74,
      "start": 1496.56005859375,
      "end": 1497.56005859375,
      "text": " And he said this."
    },
    {
      "id": 75,
      "start": 1497.56005859375,
      "end": 1502.6400451660156,
      "text": " He said, when that happens in my ministry, I always just simply think this thought."
    },
    {
      "id": 76,
      "start": 1502.6400451660156,
      "end": 1507.4000549316406,
      "text": " When everyone sitting in the congregation obeys everything that I've preached, then"
    },
    {
      "id": 77,
      "start": 1507.4000549316406,
      "end": 1508.4000549316406,
      "text": " I'll stop preaching it."
    },
    {
      "id": 78,
      "start": 1508.4000549316406,
      "end": 1509.4000549316406,
      "text": " And I said, you know what?"
    },
    {
      "id": 79,
      "start": 1509.4000549316406,
      "end": 1510.4000549316406,
      "text": " That's pretty good."
    },
    {
      "id": 80,
      "start": 1510.4000549316406,
      "end": 1511.4000549316406,
      "text": " It's pretty good."
    },
    {
      "id": 81,
      "start": 1511.4000549316406,
      "end": 1516.4800415039062,
      "text": " Because we're to be doers of the word and not hearers only."
    },
    {
      "id": 82,
      "start": 1516.4800415039062,
      "end": 1517.4800415039062,
      "text": " Amen?"
    },
    {
      "id": 83,
      "start": 1517.4800415039062,
      "end": 1521.1600341796875,
      "text": " Listen, we never stop imparting biblical truth."
    },
    {
      "id": 84,
      "start": 1521.1600341796875,
      "end": 1525.8800354003906,
      "text": " We got to keep giving it and keep giving it and keep giving it."
    },
    {
      "id": 85,
      "start": 1525.8800354003906,
      "end": 1530.800048828125,
      "text": " Not only as fathers to our children, but as mature believers to growing believers."
    },
    {
      "id": 86,
      "start": 1530.9600524902344,
      "end": 1532.9600524902344,
      "text": " You say, well, I'm not a mature believer."
    },
    {
      "id": 87,
      "start": 1532.9600524902344,
      "end": 1538.6400451660156,
      "text": " Well, you're a growing believer somewhere further down the road than someone else."
    },
    {
      "id": 88,
      "start": 1538.6400451660156,
      "end": 1541.2400512695312,
      "text": " Amen?"
    },
    {
      "id": 89,
      "start": 1541.2400512695312,
      "end": 1547.6400451660156,
      "text": " Number two this morning, not only do we impart biblical truth, but number two, we model biblical"
    },
    {
      "id": 90,
      "start": 1547.6400451660156,
      "end": 1548.9200439453125,
      "text": " truth."
    },
    {
      "id": 91,
      "start": 1548.9200439453125,
      "end": 1552.3600463867188,
      "text": " We model biblical truth."
    },
    {
      "id": 92,
      "start": 1552.3600463867188,
      "end": 1559.0800476074219,
      "text": " Someone said, the message of your life has a far greater impact than the message of your"
    },
    {
      "id": 93,
      "start": 1559.0800476074219,
      "end": 1560.9200439453125,
      "text": " lips."
    },
    {
      "id": 94,
      "start": 1560.9200439453125,
      "end": 1569.0000610351562,
      "text": " The message of your life has a far greater impact than the message of your lips."
    },
    {
      "id": 95,
      "start": 1569.0000610351562,
      "end": 1575.0400390625,
      "text": " I would say this this morning, that it's absolutely necessary that the message of our lips be"
    },
    {
      "id": 96,
      "start": 1575.0400390625,
      "end": 1578.9600524902344,
      "text": " modeled in our lives."
    },
    {
      "id": 97,
      "start": 1578.9600524902344,
      "end": 1586.2800598144531,
      "text": " That as we would impart biblical truth, that we also are living biblical truth."
    },
    {
      "id": 98,
      "start": 1586.2800598144531,
      "end": 1589.9200439453125,
      "text": " That we're modeling that truth that we're teaching, that we're giving."
    },
    {
      "id": 99,
      "start": 1589.9200439453125,
      "end": 1593.7600402832031,
      "text": " It's interesting, Paul says this in Romans chapter number two, as he's really giving"
    },
    {
      "id": 100,
      "start": 1593.7600402832031,
      "end": 1597.1600341796875,
      "text": " an indictment against the Jews in this passage of scripture."
    },
    {
      "id": 101,
      "start": 1597.1600341796875,
      "end": 1601.6800537109375,
      "text": " He says this in verse number 21 of Romans chapter number two."
    },
    {
      "id": 102,
      "start": 1601.6800537109375,
      "end": 1604.4000549316406,
      "text": " He says, what a great series of questions."
    },
    {
      "id": 103,
      "start": 1604.4000549316406,
      "end": 1610.6000366210938,
      "text": " Thou therefore which teachest another, teachest not thyself."
    },
    {
      "id": 104,
      "start": 1610.6000366210938,
      "end": 1614.7600402832031,
      "text": " It's a good question, is it not?"
    },
    {
      "id": 105,
      "start": 1614.7600402832031,
      "end": 1622.0800476074219,
      "text": " Thou therefore, Romans 2 verse 21, which teachest another, teachest not thyself."
    },
    {
      "id": 106,
      "start": 1622.0800476074219,
      "end": 1628.4000549316406,
      "text": " Thou that preachest a man should not steal, dost thou steal?"
    },
    {
      "id": 107,
      "start": 1628.4000549316406,
      "end": 1631.2000427246094,
      "text": " That would be hypocritical, would it not?"
    },
    {
      "id": 108,
      "start": 1631.2000427246094,
      "end": 1635.4000549316406,
      "text": " Listen, don't steal, and then you're stealing."
    },
    {
      "id": 109,
      "start": 1635.4000549316406,
      "end": 1637.0000610351562,
      "text": " Hypocrisy."
    },
    {
      "id": 110,
      "start": 1637.0000610351562,
      "end": 1645.4000549316406,
      "text": " Verse 22, thou that sayest a man should not commit adultery, dost thou commit adultery?"
    },
    {
      "id": 111,
      "start": 1645.4000549316406,
      "end": 1649.4000549316406,
      "text": " Thou that abhorrest idols, dost thou commit sacrilege?"
    },
    {
      "id": 112,
      "start": 1649.4000549316406,
      "end": 1654.0800476074219,
      "text": " And so just in these two verses of scripture, he's giving a series of questions, and basically"
    },
    {
      "id": 113,
      "start": 1654.0800476074219,
      "end": 1658.0400390625,
      "text": " what he's telling us as we study here and look at these verses of scripture, listen,"
    },
    {
      "id": 114,
      "start": 1658.0400390625,
      "end": 1662.1200561523438,
      "text": " the message that we preach, the truth that we impart, we ought to be living that."
    },
    {
      "id": 115,
      "start": 1662.1200561523438,
      "end": 1664.4800415039062,
      "text": " We ought to be modeling that."
    },
    {
      "id": 116,
      "start": 1664.4800415039062,
      "end": 1669.4400634765625,
      "text": " How often we've heard people give testimony of someone that gave them some instruction,"
    },
    {
      "id": 117,
      "start": 1669.4400634765625,
      "end": 1674.2000427246094,
      "text": " and as they were giving the instruction, were violating the same instruction that they were"
    },
    {
      "id": 118,
      "start": 1674.2000427246094,
      "end": 1675.4800415039062,
      "text": " giving."
    },
    {
      "id": 119,
      "start": 1675.4800415039062,
      "end": 1679.4000549316406,
      "text": " How impactful do you think that instruction is?"
    },
    {
      "id": 120,
      "start": 1679.4000549316406,
      "end": 1682.5200500488281,
      "text": " Don't do this while I'm doing it."
    },
    {
      "id": 121,
      "start": 1682.5200500488281,
      "end": 1685.1200561523438,
      "text": " How far do you think that's going to go?"
    },
    {
      "id": 122,
      "start": 1685.1200561523438,
      "end": 1688.1600341796875,
      "text": " Not very far, right?"
    },
    {
      "id": 123,
      "start": 1688.1600341796875,
      "end": 1693.1600341796875,
      "text": " And so we find that it is imperative that we impart biblical truth, but it's just as"
    },
    {
      "id": 124,
      "start": 1693.1600341796875,
      "end": 1696.0800476074219,
      "text": " imperative that we model biblical truth."
    },
    {
      "id": 125,
      "start": 1696.0800476074219,
      "end": 1699.3200378417969,
      "text": " Notice here in the book of 1 Thessalonians, as we've mentioned that we're going to kind"
    },
    {
      "id": 126,
      "start": 1699.3200378417969,
      "end": 1703.3600463867188,
      "text": " of take a survey here through this book, we looked at chapter 1 and verse number 5 earlier,"
    },
    {
      "id": 127,
      "start": 1703.3600463867188,
      "end": 1705.2800598144531,
      "text": " but look at it again with me."
    },
    {
      "id": 128,
      "start": 1705.2800598144531,
      "end": 1712.800048828125,
      "text": " In 1 Thessalonians 1 and verse number 5, Paul was faithful to impart biblical truth, but"
    },
    {
      "id": 129,
      "start": 1712.800048828125,
      "end": 1718.280029296875,
      "text": " we find also that he was faithful to model biblical truth."
    },
    {
      "id": 130,
      "start": 1718.280029296875,
      "end": 1723.080078125,
      "text": " It reminds me of the principle in Proverbs 23 and 26 when it says, my son, give me thine"
    },
    {
      "id": 131,
      "start": 1723.1600341796875,
      "end": 1727.0000610351562,
      "text": " heart and let thine eyes observe my ways."
    },
    {
      "id": 132,
      "start": 1727.0000610351562,
      "end": 1732.4400634765625,
      "text": " I wonder this morning how many of us could really say to somebody, watch my life and"
    },
    {
      "id": 133,
      "start": 1732.4400634765625,
      "end": 1735.080078125,
      "text": " just do what I do."
    },
    {
      "id": 134,
      "start": 1735.080078125,
      "end": 1740.6400756835938,
      "text": " Not in a prideful, arrogant way, but in a manner in which, listen, as best as we are"
    },
    {
      "id": 135,
      "start": 1740.6400756835938,
      "end": 1745.3600463867188,
      "text": " able, through the power of the Holy Spirit, through yielding to him, through walking in"
    },
    {
      "id": 136,
      "start": 1745.3600463867188,
      "end": 1749.9200439453125,
      "text": " the Spirit, not fulfilling the lust of the flesh, that we could say to somebody, just"
    },
    {
      "id": 137,
      "start": 1749.9200439453125,
      "end": 1754.0000610351562,
      "text": " model my behavior."
    },
    {
      "id": 138,
      "start": 1754.0000610351562,
      "end": 1760.4400634765625,
      "text": " Paul said to the believers in Corinth, be followers of me, even also as I am of Christ."
    },
    {
      "id": 139,
      "start": 1760.4400634765625,
      "end": 1761.800048828125,
      "text": " Paul was following the Lord Jesus Christ."
    },
    {
      "id": 140,
      "start": 1761.800048828125,
      "end": 1762.800048828125,
      "text": " Was he perfect?"
    },
    {
      "id": 141,
      "start": 1762.800048828125,
      "end": 1763.800048828125,
      "text": " No."
    },
    {
      "id": 142,
      "start": 1763.800048828125,
      "end": 1767.7200317382812,
      "text": " But he says, the things that you see in me do."
    },
    {
      "id": 143,
      "start": 1767.7200317382812,
      "end": 1770.0400390625,
      "text": " He's modeling biblical truth."
    },
    {
      "id": 144,
      "start": 1770.0400390625,
      "end": 1775.9600219726562,
      "text": " Notice in verse number 5 of 1 Thessalonians 1, it says this, for our gospel came not unto"
    },
    {
      "id": 145,
      "start": 1775.9600219726562,
      "end": 1781.0000610351562,
      "text": " you in word only, but also in power and in the Holy Ghost and in much assurance."
    },
    {
      "id": 146,
      "start": 1781.0000610351562,
      "end": 1788.4000244140625,
      "text": " Notice this phrase, as ye know what manner of men we were among you for your sake."
    },
    {
      "id": 147,
      "start": 1788.4000244140625,
      "end": 1793.1200561523438,
      "text": " Listen, these people in Thessalonica, they saw Paul and the others."
    },
    {
      "id": 148,
      "start": 1793.1200561523438,
      "end": 1796.7600708007812,
      "text": " They observed what they were doing and how they were living."
    },
    {
      "id": 149,
      "start": 1796.7600708007812,
      "end": 1802.3600463867188,
      "text": " And as we look at the truth of this brief time that Paul was able to minister among"
    },
    {
      "id": 0,
      "start": 1802.3600463867188,
      "end": 1805.660046339035,
      "text": " these believers, not only was he imparting biblical truth, but he was"
    },
    {
      "id": 1,
      "start": 1805.660046339035,
      "end": 1811.4800462722778,
      "text": " modeling biblical truth. And you think about the impact of the ministry"
    },
    {
      "id": 2,
      "start": 1811.4800462722778,
      "end": 1816.5800466537476,
      "text": " in Thessalonica and why, roughly, it appears as you read Acts 17, three weeks,"
    },
    {
      "id": 3,
      "start": 1816.5800466537476,
      "end": 1821.340045928955,
      "text": " it was three Sabbath days that they reasoned together with them. How in the"
    },
    {
      "id": 4,
      "start": 1821.340045928955,
      "end": 1825.8200454711914,
      "text": " world could a church be established and all of these things be done, and writing"
    },
    {
      "id": 5,
      "start": 1825.8200454711914,
      "end": 1830.900047302246,
      "text": " back to these believers and encouraging them, instructing them,"
    },
    {
      "id": 6,
      "start": 1830.900047302246,
      "end": 1835.740047454834,
      "text": " because it was a message that was not lips only, it was a message that was"
    },
    {
      "id": 7,
      "start": 1835.740047454834,
      "end": 1844.4600448608398,
      "text": " modeled by the life as well. Great impact. When you look at the testimony of the"
    },
    {
      "id": 8,
      "start": 1844.4600448608398,
      "end": 1849.5800476074219,
      "text": " Apostle Paul, you see a man that would go forth and boldly preach the Word of God,"
    },
    {
      "id": 9,
      "start": 1849.5800476074219,
      "end": 1854.620044708252,
      "text": " but he lived the Word of God. Here in chapter number two, look down at"
    },
    {
      "id": 10,
      "start": 1854.620044708252,
      "end": 1859.180046081543,
      "text": " 1 Thessalonians 2 and verse number 7, the Bible says this,"
    },
    {
      "id": 11,
      "start": 1859.180046081543,
      "end": 1866.6200485229492,
      "text": " but we were gentle among you, even as a nurse cherisheth her children. Again, he's"
    },
    {
      "id": 12,
      "start": 1866.6200485229492,
      "end": 1869.5000457763672,
      "text": " saying to these believers in Thessalonica, listen, you know how we"
    },
    {
      "id": 13,
      "start": 1869.5000457763672,
      "end": 1875.7000427246094,
      "text": " behaved ourselves, you know how we acted, you know what we did. The reality is that"
    },
    {
      "id": 14,
      "start": 1875.7000427246094,
      "end": 1879.0200500488281,
      "text": " in chapter number three, he talks about, you remember. Listen, he's writing to"
    },
    {
      "id": 15,
      "start": 1879.0200500488281,
      "end": 1883.4600448608398,
      "text": " people that he ministered to. He can't pull the wool over their eyes. He's saying"
    },
    {
      "id": 16,
      "start": 1883.4600448608398,
      "end": 1888.5800476074219,
      "text": " to them, you know how we behaved ourselves, you know how we were gentle among you, even"
    },
    {
      "id": 17,
      "start": 1888.5800476074219,
      "end": 1894.6600494384766,
      "text": " as a nurse cherisheth her children. Look down, if you will, at verse number 10 of"
    },
    {
      "id": 18,
      "start": 1894.6600494384766,
      "end": 1902.1400451660156,
      "text": " 1 Thessalonians 2, verse number 10. He says, ye are witnesses, and God also. Wow,"
    },
    {
      "id": 19,
      "start": 1902.1400451660156,
      "end": 1908.0200500488281,
      "text": " that is a weighty statement. Ye, believers in Thessalonica, that's who he's"
    },
    {
      "id": 20,
      "start": 1908.0200500488281,
      "end": 1911.3400497436523,
      "text": " writing to, right? Paul and Silvanus and Timotheus under the church of the"
    },
    {
      "id": 21,
      "start": 1911.4600448608398,
      "end": 1919.2200469970703,
      "text": " Thessalonians, verse number 1 of chapter 1. He says, ye are witnesses, and God also."
    },
    {
      "id": 22,
      "start": 1919.2200469970703,
      "end": 1928.6200485229492,
      "text": " How wholly and justly and unblameably we behaved ourselves among you that believe."
    },
    {
      "id": 23,
      "start": 1928.6200485229492,
      "end": 1935.5400390625,
      "text": " Wow, what a great testimony. It's on the inspiration of the Holy Ghost, right? The"
    },
    {
      "id": 24,
      "start": 1935.5400390625,
      "end": 1943.1400451660156,
      "text": " Word of God. And Paul says, listen, ye are witnesses, God also. God knows all things."
    },
    {
      "id": 25,
      "start": 1943.1400451660156,
      "end": 1948.4200439453125,
      "text": " God sees all things. He says, and you understand what our behavior was. You understand how"
    },
    {
      "id": 26,
      "start": 1948.4200439453125,
      "end": 1954.1000518798828,
      "text": " we behaved ourselves among you that believe. He says, as the words that would be used to"
    },
    {
      "id": 27,
      "start": 1954.1000518798828,
      "end": 1964.5000457763672,
      "text": " describe their behavior, wholly, just, and unblameable. Wow. That's a fantastic testimony."
    },
    {
      "id": 28,
      "start": 1964.5000457763672,
      "end": 1970.2600402832031,
      "text": " He says, not only did we impart biblical truth, but we modeled biblical truth. We didn't"
    },
    {
      "id": 29,
      "start": 1970.2600402832031,
      "end": 1975.300048828125,
      "text": " just tell you to not do these things or to do these things, but we lived the Word of"
    },
    {
      "id": 30,
      "start": 1975.300048828125,
      "end": 1981.820053100586,
      "text": " God. We find here in verse number 11, he says, as ye know, we've used this as our title"
    },
    {
      "id": 31,
      "start": 1981.820053100586,
      "end": 1986.4600524902344,
      "text": " this morning, the last phrase, but notice the phrase again. He says in verse 10, ye"
    },
    {
      "id": 32,
      "start": 1986.4600524902344,
      "end": 1993.6000518798828,
      "text": " are witnesses. He says in verse number 11, as ye know, how we exhorted and comforted"
    },
    {
      "id": 33,
      "start": 1993.7000427246094,
      "end": 2004.6400451660156,
      "text": " and charged every one of you as a father doth his children. This morning, to the dads, do"
    },
    {
      "id": 34,
      "start": 2004.6400451660156,
      "end": 2013.0800476074219,
      "text": " your children see you model biblical truth? Do your children observe you living a life"
    },
    {
      "id": 35,
      "start": 2013.0800476074219,
      "end": 2023.2000427246094,
      "text": " pleasing to God, a life that matches the message of your lips? But to the mature believer,"
    },
    {
      "id": 36,
      "start": 2023.2000427246094,
      "end": 2030.7200469970703,
      "text": " I wonder are there some growing believers that look at your life and see, this is someone"
    },
    {
      "id": 37,
      "start": 2030.7200469970703,
      "end": 2036.800048828125,
      "text": " that gets it. This is someone that's doing it, that they're obeying the Word of God."
    },
    {
      "id": 38,
      "start": 2036.800048828125,
      "end": 2043.4800415039062,
      "text": " They're living the Word of God. I wonder this morning if we could make some of these same"
    },
    {
      "id": 39,
      "start": 2043.4800415039062,
      "end": 2049.0400390625,
      "text": " statements that Paul makes. See, as we begin to think about this truth this morning, these"
    },
    {
      "id": 40,
      "start": 2049.0400390625,
      "end": 2054.6400451660156,
      "text": " two principles, if you will, that we impart biblical truth, that we model biblical truth,"
    },
    {
      "id": 41,
      "start": 2054.6400451660156,
      "end": 2060.800048828125,
      "text": " and keeping in mind all the while what that goal is, the goal is that ye, those that you're"
    },
    {
      "id": 42,
      "start": 2060.800048828125,
      "end": 2067.6200561523438,
      "text": " ministering to, would walk worthy of God. And in order for me to achieve that goal,"
    },
    {
      "id": 43,
      "start": 2067.6200561523438,
      "end": 2072.9600524902344,
      "text": " in order for me to see my children, in order for me to see some younger growing believers"
    },
    {
      "id": 44,
      "start": 2072.9600524902344,
      "end": 2079.6400451660156,
      "text": " walk worthy of God, I need to be imparting truth and I need to be modeling truth, biblical"
    },
    {
      "id": 45,
      "start": 2079.6400451660156,
      "end": 2085.4400329589844,
      "text": " truth. It's absolutely imperative. We notice the example of Paul. Of course, we're looking"
    },
    {
      "id": 46,
      "start": 2085.4400329589844,
      "end": 2089.080047607422,
      "text": " at it here in the book of 1 Thessalonians. But I want to remind you, if you turn back"
    },
    {
      "id": 47,
      "start": 2089.080047607422,
      "end": 2093.3600463867188,
      "text": " in your Bibles just a few pages to Philippians chapter number 4, I want to remind you what"
    },
    {
      "id": 48,
      "start": 2093.3600463867188,
      "end": 2098.56005859375,
      "text": " Paul said to the believers in Philippi. Again, Philippi is the city that he was able to enter"
    },
    {
      "id": 49,
      "start": 2098.56005859375,
      "end": 2103.3600463867188,
      "text": " into and minister amongst before he got to Thessalonica. And we can read of the record"
    },
    {
      "id": 50,
      "start": 2103.3600463867188,
      "end": 2107.4800415039062,
      "text": " of this ministry in Acts chapter number 16. And as Paul, under the inspiration of the"
    },
    {
      "id": 51,
      "start": 2107.4800415039062,
      "end": 2111.760040283203,
      "text": " Holy Spirit of God, would write back to the church in Philippi, he gives them great instruction."
    },
    {
      "id": 52,
      "start": 2111.760040283203,
      "end": 2116.4800415039062,
      "text": " He's writing from prison. He's talking about rejoicing evermore. Rejoice in the Lord,"
    },
    {
      "id": 53,
      "start": 2116.4800415039062,
      "end": 2123.760040283203,
      "text": " O Lord, and again I say rejoice. By the way, Paul was rejoicing, even in his circumstances,"
    },
    {
      "id": 54,
      "start": 2123.760040283203,
      "end": 2129.280059814453,
      "text": " in his difficulties. I wonder this morning, as you think about the message of the book"
    },
    {
      "id": 55,
      "start": 2129.280059814453,
      "end": 2136.800048828125,
      "text": " of Philippians, rejoice, rejoice, rejoice. I wonder this morning about that Philippian"
    },
    {
      "id": 56,
      "start": 2136.800048828125,
      "end": 2142.6400451660156,
      "text": " jailer when the book of Philippians was written and he read it. And he was the one that had"
    },
    {
      "id": 57,
      "start": 2142.6400451660156,
      "end": 2153.56005859375,
      "text": " put them fast in the prison. But he heard them sing praises unto God. The Philippian"
    },
    {
      "id": 58,
      "start": 2153.56005859375,
      "end": 2159.4400329589844,
      "text": " jailer got saved. He said, what must I do to be saved? Believe on the Lord Jesus Christ."
    },
    {
      "id": 59,
      "start": 2159.4400329589844,
      "end": 2164.3600463867188,
      "text": " Amen? And we find that that Philippian jailer was saved. But when Paul is saying rejoice"
    },
    {
      "id": 60,
      "start": 2164.3600463867188,
      "end": 2169.4000549316406,
      "text": " in everything, rejoice in the Lord, O way, I believe that that Philippian jailer, he"
    },
    {
      "id": 61,
      "start": 2169.4000549316406,
      "end": 2176.4800415039062,
      "text": " could say, you know, in the terrible circumstances that Paul was in, he was rejoicing. He's"
    },
    {
      "id": 62,
      "start": 2176.4800415039062,
      "end": 2179.320037841797,
      "text": " writing from prison. He says in the first chapter, the things that happened to me have"
    },
    {
      "id": 63,
      "start": 2179.320037841797,
      "end": 2184.840057373047,
      "text": " happened for the furtherance of the gospel. He's rejoicing. But notice what he says in"
    },
    {
      "id": 64,
      "start": 2184.840057373047,
      "end": 2198.080047607422,
      "text": " verse number nine of Philippians 4. Those things which ye have both learned and received"
    },
    {
      "id": 65,
      "start": 2198.080047607422,
      "end": 2203.9200439453125,
      "text": " and heard. Now those first three phrases of verse nine would be our first point this"
    },
    {
      "id": 66,
      "start": 2203.9200439453125,
      "end": 2211.320037841797,
      "text": " morning, impart biblical truth. Ye have received it, you've learned it, you've received it,"
    },
    {
      "id": 67,
      "start": 2211.320037841797,
      "end": 2222.800048828125,
      "text": " you've heard, but notice the last phrase, and seen in me do. The God of peace shall"
    },
    {
      "id": 68,
      "start": 2222.800048828125,
      "end": 2230.280059814453,
      "text": " be with you. Those things which I've imparted unto you, those things that you've learned,"
    },
    {
      "id": 69,
      "start": 2230.280059814453,
      "end": 2234.8800354003906,
      "text": " you've received, and you've heard, but those things that I modeled, that you've seen in"
    },
    {
      "id": 70,
      "start": 2234.8800354003906,
      "end": 2243.4400329589844,
      "text": " me do. Have you ever been in a place where maybe you or maybe someone else that was in"
    },
    {
      "id": 71,
      "start": 2243.4400329589844,
      "end": 2249.2000427246094,
      "text": " your presence, your company, had a child that behaved in a certain manner that was embarrassing?"
    },
    {
      "id": 72,
      "start": 2250.2000427246094,
      "end": 2254.1600341796875,
      "text": " The parent, maybe you were in the situation, or maybe it was another parent, says, I don't"
    },
    {
      "id": 73,
      "start": 2254.1600341796875,
      "end": 2259.1600341796875,
      "text": " know where they learned that. You ever been in a situation like that? You say, well, if"
    },
    {
      "id": 74,
      "start": 2259.1600341796875,
      "end": 2261.520050048828,
      "text": " I could be honest with you, I could probably help you understand where they learned that"
    },
    {
      "id": 75,
      "start": 2261.520050048828,
      "end": 2270.6800537109375,
      "text": " from. Amen? Because you know what children do? They model the behavior they see. I'm"
    },
    {
      "id": 76,
      "start": 2270.6800537109375,
      "end": 2277.0000610351562,
      "text": " not saying 100% of the time, forever of their lives, but many times children model that"
    },
    {
      "id": 77,
      "start": 2277.0400390625,
      "end": 2283.760040283203,
      "text": " which they see. We impart Biblical truth, but we model Biblical truth. Listen, the example"
    },
    {
      "id": 78,
      "start": 2283.760040283203,
      "end": 2290.320037841797,
      "text": " of Paul is great, but we have a greater example, and that's the Lord Jesus Christ. Acts 1 says"
    },
    {
      "id": 79,
      "start": 2290.320037841797,
      "end": 2295.56005859375,
      "text": " this of the Lord Jesus Christ. Notice what the Word of God says in Acts 1. We'll be finishing"
    },
    {
      "id": 80,
      "start": 2295.56005859375,
      "end": 2305.520050048828,
      "text": " here in just a moment with this truth of the example of our wonderful Savior. Luke is writing"
    },
    {
      "id": 81,
      "start": 2305.520050048828,
      "end": 2311.840057373047,
      "text": " here and the Bible says this in Acts 1, in verse number 1, the former treaties have I"
    },
    {
      "id": 82,
      "start": 2311.840057373047,
      "end": 2325.52001953125,
      "text": " made, O Theophilus, of all that Jesus began, notice what it says, both to do and teach."
    },
    {
      "id": 83,
      "start": 2325.52001953125,
      "end": 2331.52001953125,
      "text": " This morning we acknowledge and understand that Jesus is the master teacher. Many times"
    },
    {
      "id": 84,
      "start": 2331.52001953125,
      "end": 2335.800048828125,
      "text": " when we read the Gospel accounts, we don't even see all of what He was teaching, but"
    },
    {
      "id": 85,
      "start": 2335.800048828125,
      "end": 2340.9200439453125,
      "text": " we'll maybe just read a phrase of He was preaching or He was teaching. He's the master teacher."
    },
    {
      "id": 86,
      "start": 2340.9200439453125,
      "end": 2347.320068359375,
      "text": " Nicodemus comes to Him by night. He says we know that thou art a teacher sent from God."
    },
    {
      "id": 87,
      "start": 2347.320068359375,
      "end": 2352.2000732421875,
      "text": " And we find that as we look at the truth that God gives us in His Word of the Gospel records"
    },
    {
      "id": 88,
      "start": 2352.2000732421875,
      "end": 2359.2400512695312,
      "text": " and we understand that these truths are given to us as the life and ministry of the Lord"
    },
    {
      "id": 89,
      "start": 2359.2400512695312,
      "end": 2366.2000732421875,
      "text": " Jesus Christ, that it was both to do and teach. It was imparting truth, but it was"
    },
    {
      "id": 90,
      "start": 2366.2000732421875,
      "end": 2372.9200439453125,
      "text": " also modeling truth. And Jesus says this, and of course we know that He is perfect and"
    },
    {
      "id": 91,
      "start": 2372.9200439453125,
      "end": 2378.6800537109375,
      "text": " that He is the perfect example. He says in John 8, in verse number 29, for I do always"
    },
    {
      "id": 92,
      "start": 2378.6800537109375,
      "end": 2391.56005859375,
      "text": " those things that please Him. I do always those things that please Him. This morning"
    },
    {
      "id": 93,
      "start": 2391.56005859375,
      "end": 2399.6000366210938,
      "text": " Jesus is our example. Peter says that Christ left us an example that we should follow His"
    },
    {
      "id": 94,
      "start": 2399.6000366210938,
      "end": 2400.56005859375,
      "text": " steps."
    },
    {
      "id": 0,
      "start": 2400.56005859375,
      "end": 2406.720058441162,
      "text": " And as we examine this morning, and we'll visit again this evening, the book of 1 Thessalonians,"
    },
    {
      "id": 1,
      "start": 2406.720058441162,
      "end": 2413.2000589370728,
      "text": " with this thought in mind, as a father doth his children, and looking at it from really two"
    },
    {
      "id": 2,
      "start": 2413.2000589370728,
      "end": 2421.0400581359863,
      "text": " perspectives, from fathers to children, but then from a mature believer to a growing believer."
    },
    {
      "id": 3,
      "start": 2421.6800594329834,
      "end": 2426.240058898926,
      "text": " I'd ask you this question this morning in closing, or these two questions in closing this morning,"
    },
    {
      "id": 4,
      "start": 2427.2000579833984,
      "end": 2433.7600593566895,
      "text": " to whom are you imparting biblical truth? To whom are you imparting biblical truth?"
    },
    {
      "id": 5,
      "start": 2435.2000579833984,
      "end": 2439.9200592041016,
      "text": " If you don't have an answer for that question, I would encourage you to find someone to impart"
    },
    {
      "id": 6,
      "start": 2439.9200592041016,
      "end": 2447.0400581359863,
      "text": " biblical truth to. I would challenge you not to be satisfied with a no one answer,"
    },
    {
      "id": 7,
      "start": 2448.56005859375,
      "end": 2454.320056915283,
      "text": " because we ought to be imparting biblical truth. If you can't remember the last time that you've"
    },
    {
      "id": 8,
      "start": 2454.320056915283,
      "end": 2459.6800575256348,
      "text": " had an opportunity to share biblical truth and impart it to someone, I would encourage you this"
    },
    {
      "id": 9,
      "start": 2459.6800575256348,
      "end": 2467.5200576782227,
      "text": " morning to ask God to help you to impart biblical truth. And then I wonder this morning, how are we"
    },
    {
      "id": 10,
      "start": 2467.5200576782227,
      "end": 2478.240058898926,
      "text": " doing in the area of modeling biblical truth? How many people do we want to see observing our lives?"
    },
    {
      "id": 11,
      "start": 2478.56005859375,
      "end": 2488.6400604248047,
      "text": " Can we say, as Paul said, that the things that you've seen in me do? I was teaching the teens"
    },
    {
      "id": 12,
      "start": 2488.6400604248047,
      "end": 2497.760055541992,
      "text": " a couple of weeks ago, and I use really as a springboard verse of Scripture by which we'll"
    },
    {
      "id": 13,
      "start": 2497.760055541992,
      "end": 2506.240058898926,
      "text": " study throughout several weeks with the young people, this truth from 1 Samuel 16. And I won't"
    },
    {
      "id": 14,
      "start": 2507.2000579833984,
      "end": 2514.4800567626953,
      "text": " get into all of it, but Saul's dealing with an issue where he has an evil spirit that's troubling"
    },
    {
      "id": 15,
      "start": 2514.4800567626953,
      "end": 2519.440055847168,
      "text": " him. And his counselors say, here's what we've got to do. We've got to find a man that can come in"
    },
    {
      "id": 16,
      "start": 2519.440055847168,
      "end": 2524.3200607299805,
      "text": " and play, and man, this is going to be great. And they just go, okay, find him. And one of the"
    },
    {
      "id": 17,
      "start": 2524.3200607299805,
      "end": 2530.1600646972656,
      "text": " servants answered and said this in 1 Samuel 16, 18, just jot it down, and we can go back and read"
    },
    {
      "id": 18,
      "start": 2530.1600646972656,
      "end": 2540.2400512695312,
      "text": " it later. He says, behold, I have seen a son of Jesse, the Bethlehemite, that is cunning and"
    },
    {
      "id": 19,
      "start": 2540.2400512695312,
      "end": 2545.840057373047,
      "text": " playing, and a mighty, valiant man, a man of war, prudent in matters, a comely person, and the Lord"
    },
    {
      "id": 20,
      "start": 2545.840057373047,
      "end": 2551.4400634765625,
      "text": " is with him. You know what I told the young people on Wednesday evening? Same thing I'm going to tell"
    },
    {
      "id": 21,
      "start": 2551.4400634765625,
      "end": 2560.2400512695312,
      "text": " you now. I'm not sure that David even knew who this servant was. I'm not sure that David knew"
    },
    {
      "id": 22,
      "start": 2560.2400512695312,
      "end": 2566.4800567626953,
      "text": " the servant was watching him, observing his behavior. You know what I told the young people?"
    },
    {
      "id": 23,
      "start": 2567.360061645508,
      "end": 2570.320053100586,
      "text": " When somebody says, I'm watching you, we can behave a certain way,"
    },
    {
      "id": 24,
      "start": 2573.040054321289,
      "end": 2578.800064086914,
      "text": " because we know somebody's watching us. I don't think David knew that this servant was watching"
    },
    {
      "id": 25,
      "start": 2578.800064086914,
      "end": 2588.8800659179688,
      "text": " him. When they said, go find a man, and that servant says, I've seen, I've seen a son of Jesse,"
    },
    {
      "id": 26,
      "start": 2589.6800537109375,
      "end": 2597.840057373047,
      "text": " a Bethlehemite, and here's how he describes him. Wow. People are watching you. People are watching"
    },
    {
      "id": 27,
      "start": 2597.840057373047,
      "end": 2606.7200622558594,
      "text": " me. A lot of people watch me. Seriously. I'm being honest, man. I'm not saying that pridefully,"
    },
    {
      "id": 28,
      "start": 2606.7200622558594,
      "end": 2611.4400634765625,
      "text": " I'm just saying, with a position comes just certain things come along with it."
    },
    {
      "id": 29,
      "start": 2613.280059814453,
      "end": 2620.4800567626953,
      "text": " But you know, people are watching you. That person at work, that person in your neighborhood,"
    },
    {
      "id": 30,
      "start": 2622.1600646972656,
      "end": 2627.840057373047,
      "text": " we need to find somebody to impart biblical truth to, but we need to make sure we're modeling"
    },
    {
      "id": 31,
      "start": 2627.840057373047,
      "end": 2633.1200561523438,
      "text": " biblical truth. First two principles. Three more tonight. Come back tonight."
    },
    {
      "id": 32,
      "start": 2633.760055541992,
      "end": 2638.4000549316406,
      "text": " Challenge you to come back. I really believe this morning that as we look at this, just an overview"
    },
    {
      "id": 33,
      "start": 2638.4000549316406,
      "end": 2642.1600646972656,
      "text": " of First Thessalonians, there's a lot more. I had a lot more in my notes that I could give you"
    },
    {
      "id": 34,
      "start": 2642.1600646972656,
      "end": 2647.4400634765625,
      "text": " principle-wise, but five of them that I really believe will go far if we implement them in our"
    },
    {
      "id": 35,
      "start": 2647.4400634765625,
      "end": 2656.2400512695312,
      "text": " lives to being able to see some people walk worthy of God. You know why? It's not going to happen by"
    },
    {
      "id": 36,
      "start": 2656.2400512695312,
      "end": 2663.840057373047,
      "text": " chance or by accident. We have the purpose to impart and then model biblical truth."
    },
    {
      "id": 37,
      "start": 2664.4800720214844,
      "end": 2671.9200439453125,
      "text": " Father, we love you. We thank you for loving us. We thank you so much for the opportunity to gather"
    },
    {
      "id": 38,
      "start": 2671.9200439453125,
      "end": 2684.4800720214844,
      "text": " together, to honor fathers on this day, to rejoice in our relationship with you through the Lord"
    },
    {
      "id": 39,
      "start": 2684.4800720214844,
      "end": 2694.4000549316406,
      "text": " Jesus Christ. I'm challenged personally through the message of First Thessalonians,"
    },
    {
      "id": 40,
      "start": 2697.1200561523438,
      "end": 2699.840057373047,
      "text": " the message from the perspective in which we've looked at it this morning."
    },
    {
      "id": 41,
      "start": 2700.9600524902344,
      "end": 2703.9200439453125,
      "text": " God, I pray that we would not soon forget that which we've heard."
    },
    {
      "id": 42,
      "start": 2705.4400634765625,
      "end": 2712.080047607422,
      "text": " I pray that we'd truly allow the Holy Spirit of God to examine us. As we read in the end of First"
    },
    {
      "id": 43,
      "start": 2712.080047607422,
      "end": 2719.7600708007812,
      "text": " Thessalonians 5, quench not the spirit. Grieve not the spirit, Paul says in another portion of"
    },
    {
      "id": 44,
      "start": 2719.7600708007812,
      "end": 2727.3600463867188,
      "text": " Scripture. Oh, God, I pray this morning that we'd be sensitive. We would not grieve nor quench"
    },
    {
      "id": 45,
      "start": 2728.2400512695312,
      "end": 2732.9600524902344,
      "text": " the Holy Spirit of God, but that we would be doers of the Word,"
    },
    {
      "id": 46,
      "start": 2735.280059814453,
      "end": 2738.6400451660156,
      "text": " that we would understand the importance of imparting biblical truth."
    },
    {
      "id": 47,
      "start": 2739.520050048828,
      "end": 2745.1200561523438,
      "text": " If we're not imparting biblical truth, God, would you help us to recognize the need"
    },
    {
      "id": 48,
      "start": 2747.280059814453,
      "end": 2753.7600708007812,
      "text": " and to engage in seeking earnestly to find someone that we can impart biblical truth to?"
    },
    {
      "id": 49,
      "start": 2755.2000732421875,
      "end": 2759.1200561523438,
      "text": " God, help us always to model biblical truth,"
    },
    {
      "id": 50,
      "start": 2761.040069580078,
      "end": 2767.600067138672,
      "text": " understanding that you see us at all times. There are many people that are observing us"
    },
    {
      "id": 51,
      "start": 2768.4800720214844,
      "end": 2776.0000610351562,
      "text": " and we don't even know. As a man of yesteryear said, sometimes the only Bible a lost man will"
    },
    {
      "id": 52,
      "start": 2776.0000610351562,
      "end": 2783.7600708007812,
      "text": " ever read is the life of a believer. How much truth, biblical truth are we modeling? Oh, God,"
    },
    {
      "id": 53,
      "start": 2783.7600708007812,
      "end": 2792.080047607422,
      "text": " help us. Help us to do business with thee. Well, thank you for the work that you'll do. We pray"
    },
    {
      "id": 54,
      "start": 2792.080047607422,
      "end": 2796.6400451660156,
      "text": " that you'd be glorified through every decision, for it's in Christ's name we pray. Would you stand"
    },
    {
      "id": 55,
      "start": 2796.6400451660156,
      "end": 2801.600067138672,
      "text": " with me? Heads are bowed, eyes are closed, no one's looking around. Kimberly's going to play"
    },
    {
      "id": 56,
      "start": 2801.600067138672,
      "end": 2806.6400451660156,
      "text": " quietly on the piano. Maybe this morning you want to come to this old-fashioned altar. Maybe you"
    },
    {
      "id": 57,
      "start": 2806.6400451660156,
      "end": 2812.6400451660156,
      "text": " want to ask God to help you to impart biblical truth. Maybe you need to ask God to help you to"
    },
    {
      "id": 58,
      "start": 2812.6400451660156,
      "end": 2817.7600708007812,
      "text": " model biblical truth. However it is that God may have worked in your heart and life this morning,"
    },
    {
      "id": 59,
      "start": 2817.7600708007812,
      "end": 2827.9200439453125,
      "text": " would you allow God to have his way? The altar is open as Kimberly plays."
    }
  ],
  "processed_at": "2025-04-17T05:47:42.978289"
}