{
  "video_id": "Ka9pI-oYLw8",
  "text": "now for this calendar year, 2025, studying through the book of 2 Corinthians with our theme, God's Grace is Sufficient. And I'm so thankful I preached that very first Sunday, actually it was the last Sunday of December of 2024, the introduction, if you will, to this series. And there's a promise in 2 Corinthians 12 and verse number nine that God's grace is sufficient. It's a promise that needs to be embraced. It is explained there, but it needs to be embraced by God's people and experienced by God's people that God's grace is sufficient. Well, you'll recall from last week in 2 Corinthians chapter number four, we looked at verses eight down through the end of the chapter, verse number 18, and Paul was speaking with great transparency with regard to the ministry and all those things. And we said this, that when you look at the pressures, he says we faint not, we look at the pressures, but then we see the provision that God gives his grace and God gives his strength and his power and what a blessing that is. He ends the fourth chapter by really speaking about perspective. That's how we ended the message last Sunday morning. And we talked about that perspective of eternal things. He says at the end of the chapter in verse number 18, while we look not at the things which are seen, but the things which are not seen for the things which are seen are temporal, but the things which are not seen are eternal. And then immediately after Paul is challenging the people of Corinth and after we're being challenged as we read this letter, this book, to have our focus on that which is eternal instead of that which is temporal, we find that he immediately turns his attention to heaven. Why? Well, because that's eternal. And he starts talking about this perspective and as he's talking about this perspective, not looking at the things which are temporal, but the things which are eternal and he reaches this high point at the end of chapter number four and then we enter into the fifth chapter. Of course, we know that the chapter divisions were added well after and therefore our ease of being able to find portions of scripture. And we find here this morning that immediately his attention turns to heaven. Aren't you thankful for the truth of heaven? I titled the message this morning the certainty of heaven. And when we look at this passage of scripture, we find that there are many that discuss heaven in the day and age in which we live. They acknowledge most will acknowledge the existence of heaven and many would say this, they desire that they would go to heaven. It's very few people that I've ever spoken to and I ask people often as I have opportunity to share the gospel and as we go through and pass out gospel tracts and knock on doors and have interactions, divine appointments with individuals. So often when we have those conversations, I'll ask a question like this, are you 100% sure if you were to die today that heaven is your home? And most people respond to me with this kind of a phrase is I hope so, I think so, I hope so. I mean, they want to go to heaven. Very few people that I've ever met that have not had a desire to go to heaven. And heaven is a subject, a topic that is spoken of often, but we find that the subject of heaven, the authority with regard to heaven, what it is, where it is, who will go, the authority is the Bible, it's God's word. It's not your opinion, my opinion, it's not what some person wrote about, talked about what you find in some other form of literature. No, the Bible has the authority. And we find that as we look at this passage of scripture, we find that the Apostle Paul will reveal to us some of that which we are familiar with, and no doubt the importance of knowing and having confidence that heaven is not only a real place, but the certainty that we can have as individuals that heaven is our home. I'm so thankful, there was a day in my life, and I think if you're saved here this morning, if you've trusted Christ as your savior, there was a day in your life as well that you went through life not knowing if heaven was truly your home. I remember as a young child, I didn't get saved until I was 17 years old, I remember as a young child, I remember right before I got saved and as I would drive that road, I can see it in my mind's eye this morning as I would drive in Southern California to school from the military base where my dad was stationed and I could see and I could see in my mind's eye that hilly terrain and those curvy roads and I remember having the thought that if I were to get in a car accident and go off the side of the road and died, I did not have certainty that heaven was my home. I remember that. Many of us this morning, we remember that. You know, there's a whole host of people today that still are in that situation. They hope. Most people today acknowledge the reality of death. It's not something that is comfortable for most people to speak of, but you know that there's an entire industry that has made, I don't know how much money they have on selling life insurance. Do they not? They sell life insurance. I remember talking to a guy that called me about selling me life insurance. I said, you know, we kind of talk to people about the same thing. He said, really? I said, yeah, we talk to people about death, but you're trying to sell them something that will help somebody else when they die and I'm trying to talk to them so that they can know where they're gonna go when they die. And I said, as a matter of fact, you talk to people about death all the time and you sell life insurance every day of your life. What's gonna happen when you die? And he just kind of paused. A man that sold life insurance for a living, a man that talked to people about dying, that his livelihood was the result of the acknowledgement and reality that people will die, had never given thought personally what would happen to him when he died. I'd love to tell you that he got saved, but he really just wanted to make a sale. He wasn't too interested in hearing the Bible truth about heaven. This morning, when we look at the word of God, we find that we can have confidence and we can have certainty of not only the truth that heaven is a real place, but that we that have been born again, we that have been saved by the blood of Christ, will get to heaven when we die. Someone made this comment in my presence just yesterday. Here's what they said to me. They said, well, they thought I was making something up. I talked about being a grandparent, and they said, you're too young to be a grandparent. And really, they said that because Holly was with me. They didn't say that because I look young. They said that because Holly looks young. And I know the situation, right? But they said this in my presence. They said, now listen, I've been told that you can go to hell for lying. But you know the reality is that yes, all men are liars, and all liars shall have their part in the lake of fire, Revelation 21. But the reality is that the reason that someone goes to hell is not because they lied. It's because they're a sinner, and they've not trusted Jesus Christ as their personal savior. The reason that I'm going to heaven is not because I deserve it. It's not because I'm good enough. It's not because of something I did. No, it's all because of what Jesus Christ did on the cross of Calvary. It's all because of his substitutionary atonement that he took, and he paid a sin debt that he did not owe. He paid for my sin, and for your sin, and for the sin of the world. And he says, I've now offered to you this gift. What is the gift? It's eternal life through Jesus Christ, our Lord. And Paul was a recipient of that gift. Paul had an amazing experience on the road to Damascus, and Acts chapter number nine is he's there, and he's going to persecute those that are Christians, any that are of this way. And the Lord Jesus Christ appears to him, and he says, who art thou, Lord? What wilt thou have me to do? And Paul was never the same. You read Acts chapter number nine, and in fact, if you read about maybe halfway, two thirds of the way through the chapter, you start reading that Paul is preaching the gospel. He's preaching Christ. What happened in this guy's life? Well, he's a new creature. He'd been saved and born again. And now he's preaching the gospel. And then God used the apostle Paul to go to the city of Corinth. And he went to the city of Corinth. You know what he did? You read 1 Corinthians chapter number one. He went there not to have people following him. He went there to preach Christ. He went there not so that people could look at him as being this great orator and having some level of man worship. No, he went there to preach Christ. He went there, as he says in Romans chapter number one, to preach the gospel. Why? Because the gospel is the power of God unto salvation. And Paul believed that. I mean, he went everywhere preaching the gospel. You read his life, you trace his steps through the New Testament, and he's preaching the gospel, and he's preaching the gospel, and he's taking and seizing those opportunities. Why? Because he knows the truth of eternity, and he knows the power of the gospel. This morning, when we first begin reading chapter number five, notice what he says, for we know. I'm gonna pause there just for a moment. We're gonna get through the first. verses this morning. I only have two points. I told somebody that before the service this morning. I said, well, I only got two points. That doesn't mean anything, but I only have two points, amen? But it says, for we know. Who are the we? Who are the we? Well, specifically, contextually, when you think about the original writing, Paul's not only talking about himself, but he's talking about those in Corinth. Who are those in Corinth that he's speaking of? Well, he's writing to a local church. If you turn back to chapter number one, the Bible says this in 2nd Corinthians chapter 1 and verse number 1, Paul, an apostle of Jesus Christ, by the will of God, and Timothy our brother, notice, unto the church of God, which is at Corinth, with all the saints which are in all Achaia. And so we find that the apostle Paul, as he's writing, and he says, he addresses in chapter number 1 who he is writing to, and then in chapter number 5 he says, for we know. And so he's talking about himself. He didn't say, for I know, though that's true, but he's speaking and he's talking about them collectively, these people that make up the church. Now, the church is made up of believers. When we look at the truth of New Testament Christianity, when we understand church polity and all of that, we look at the epistles, we understand how does one become a member of a local church. Over the last almost 14 years now, we've had almost 50, it's almost 60 now, different family units that have joined Fellowship Baptist Church. Since I've been here as the pastor, almost 60 family units have joined the church. I'd like to say that they all still live here, but so many of them have moved away during that same period of time. And here's the reality, is that each individual, and several of you I met with you before you joined the church, you say this, I want to be a member of Fellowship Baptist Church. What's one of the first questions that I ask you? Well, tell me about when you trust that Christ is your Savior. Tell me about your salvation. Tell me about when you were baptized scripturally. Why? Because the requirements, if you will, for church membership are that you're saved and scripturally baptized, and then you join the local church. There's not, it's not a club. Church isn't a club. The church, there's one way to become a member of the church, and we find that it's through that being saved. And those that have placed their faith and trust in Jesus Christ, today there are many that would have maybe a misunderstanding of what it means to be saved, or what it means to be born again. And you ask people if they hope that they're going to heaven. What gives you that hope? Well, I was a member of a church, or I was baptized, or I was this, or I was that, and so on and so forth. But the reality is that there's only one way to be saved, and that's through accepting Jesus Christ as your personal Savior. You can't work for salvation. You're not going to earn it through your good deeds. No, it's a gift. And we find that Paul, as he's writing to these believers in Corinth, he says that we know, for we know, for we know what? Notice he says, as we're going to read the text, he says that if our earthly house of this tabernacle were dissolved, we have a building of God, a house not made with hands, eternal in the heavens. Do you see how Paul transitions? I mean, he talked about that eternal perspective at the end of chapter 4, and immediately his mind goes to eternity. Immediately his mind goes to heaven, and he says we know that if our earthly house of this tabernacle, what's he talking about? This body. Peter talks about that his tabernacle, he's gonna put it off. What is he talking about? He's gonna die. And notice Paul says we know that if our earthly house of this tabernacle were dissolved, we have a building of God, a house not made with hands, eternal in the heaven. For in this we groan, earnestly desiring to be clothed upon with our house which is from heaven. How many of you that are saved, you want to go to heaven? Amen. There are days that you say, man, I groan for it. Paul, when he's writing to the church at Philippi, right, he said I'm in a straight betwixt two, having a desire to depart to with Christ, which is far better. That's what he says. But God's left us here for a purpose, for a reason, we understand that. And he says in verse number three, if so be that being clothed we shall not be found naked, for we that are in this tabernacle do groan, being burdened. Not for that we would be unclothed, but clothed upon that mortality might be swallowed up of life. Now he that hath wrought us for the selfsame thing as God, who also hath given unto us the earnest of the Spirit. Therefore we are always confident, knowing that whilst we are at home in the body, we are absent from the Lord. For we walk by faith, not by sight. We are confident, I say, and willing, rather to be absent from the body and to be present with the Lord. This morning, if you're taking notes, number one, the expectation of every believer. Listen, if you've placed your faith and trust in the Lord Jesus Christ, you ought to have an expectation of heaven. You ought to live every day understanding that heaven is certain, that heaven is that reality, and that I expect, listen, we sing the songs and we talk about seeing our Savior face-to-face, and this is not just some wishful thinking. No, this is a confidence, this is an earnest expectation that I have. And if you're here this morning, I actually said to somebody on the back porch on Wednesday, something was being said, and I said, listen, we're going to heaven, right? Just kind of get that focus. And it's not to say that we shouldn't be concerned about anything that's going on around us. I'm not saying that we live without any awareness of what's going on around us, but the reality is that my attention and my expectation is that heaven is my home. What a joy. We find that he says in verse number one, for we know, we know. He says again in verse number one, we say that he says, we have a building of God and house not made with hands eternal in the heavens. We find that Paul is saying to these believers, and even for himself as he's taking this moment after speaking about the perspective, he's getting caught up in this expectation that he has, I'm gonna be with my Lord and Savior. We know. We know. Notice in this portion of scripture is a portion that I enjoy using at times of having a memorial service, a celebration of life, a funeral, whatever you want to call it. Why? See, when you have the opportunity to preach a funeral for somebody that you know was saved and that's in heaven, it's a totally different situation. I'm telling you, Joe Harrah, if you were here for his memorial service, it was one of the most exciting services I think we ever had. Just, man, he knows that he was going to heaven and we were celebrating. We're just worshiping the Lord. I talk with Brother Curry sometimes. He shares some things with me about, you know, at my funeral, I want blah, blah, blah, whatever. And those are good things, good conversations. But, man, it's a celebration. In 2 Corinthians chapter number five is a portion of scripture along with several others that I enjoy going to. Why? Because of the certainty. For we know, we have. He says in verse number four, notice, for we that are in this tabernacle do groan, being burdened. You can think about what he had just spoken of, the pressures in chapter number four, and you can relate with Paul as he makes that statement. But notice he says, not for that we would be unclothed, but clothed upon, notice, that mortality might be swallowed up of life. Death isn't the end. Mortality, notice it says, will be swallowed up of life. Not of death, of life. I know I've shared it before, but it's worth repeating. D.L. Moody is often referenced as saying, one day you're going to read that D.L. Moody died. And he said this, don't believe it for a second. And then he followed that up with this by saying, in that day I'll be more alive than I've ever been. He's talking about mortality being swallowed up of life. This expectation that we have, we often will speak of this and we'll look at some of the verses, but we talk about some of the truth of heaven and you read in the book of Revelation and you talk about there'll be no more pain, no more sickness, no more death, no more crying. I mean, those are wonderful realities, the certainties that we have of heaven. Notice in verse number five, the Bible says, now he that hath wrought us for the selfsame thing is God. Notice this, who also hath given unto us the earnest of the Spirit. Now, what is he speaking of here? Well, previously in chapter number one of this letter, 2 Corinthians 1 and verse 22, he says, who hath also sealed us and given the earnest of the Spirit in our hearts. And we find that at the moment of salvation, there's many things that happen at the moment of salvation, but one of them is that the Holy Spirit of God... in dwells the believer. At the moment that I got saved, at the moment that you got saved, if you placed your faith and trust in the Lord Jesus Christ, the finished work of Calvary, his death, his burial, and his glorious resurrection, and you came to him, the Bible says, for whosoever shall call upon the name of the Lord shall be saved, and you accepted that free gift of eternal life, the Bible teaches us that in that moment, not only are we quickened, we're made alive, we're translated immediately from death unto life, and we find that the Holy Spirit of God indwells us. At the moment you got saved, you got all of the Holy Spirit that you're ever gonna get. The difference is that the Holy Spirit doesn't always have all of us. That's where we talk about the filling of the Holy Spirit, Ephesians 5, and be filled with the Spirit, and we understand the difference, but he speaks here about giving to us, notice in verse number 5 again, who also hath given unto us the earnest of the Spirit. Look over at Ephesians, keep your place here in 2 Corinthians, but look at Ephesians just for a moment, because it's so important that we look at this truth in Ephesians chapter number 1 and understand this powerful truth that leads to this expectation that we have as saved people. In Ephesians chapter number 1, beginning in verse number 12, the Bible says this, that we should be to the praise of his glory. Notice this, who first trusted in Christ, and then it says in verse 13, in whom ye also trusted after that ye heard the word of truth, the gospel of your salvation. Now pause, I'm gonna come back and read the rest of the verse in just a moment, but understand that before, listen, we had to hear the gospel before we could be saved. How shall they be saved, right? You read for whoso shall call upon the name of the Lord shall be saved, Romans 10 in verse number 13, how shall they call on him in whom they've not heard? How shall they call or hear on him without a preacher and all of that? And we understand, listen, we had to hear the gospel. You had to hear the gospel. You had to hear that you're a sinner, and that your sin has a penalty, a consequence. The wages of sin is death. How to become a sinner? I was born a sinner just like everyone else other than the Lord Jesus Christ. We're born sinners. No one has to teach those kids in the nursery to be selfish, amen? You have children, you've been around children, you know they're born sinners. Even grandchildren, amen, they're born sinners. But here's the reality. We recognize that we're sinners and there's a price for sin, but God commendeth his love toward us, and that while we were yet sinners, Christ died for us. He died for me. He took my place. And I heard that truth of the gospel, for whosoever shall call upon the name of the Lord shall be saved, and I heard that message, and when I heard that message, and when these folks in Ephesus heard the message, he says, in whom ye also trusted after that ye heard the word of truth, the gospel of your salvation. You have to hear the gospel. That's why we send forth missionaries, so that the gospel will be preached. That's why we give you gospel tracts. That's why we have visitation and soul winning on Saturdays at 10 a.m. Why? Because we need to go and preach the gospel because they need to hear the truth of the gospel. Why? Second Corinthians chapter number four, if our gospel be hid, it is hid to them that are lost, in whom the God of this world, little g, God of this world, hath blinded the minds of them which believe not, lest the light of the glorious gospel should shine unto them. So these folks in Ephesus, Paul was used of the Lord to go and to preach the gospel, and he says, you trusted Christ after you heard. And then notice at the end of verse number 13, in whom also after that ye believed, ye were sealed with that Holy Spirit of promise, which is, verse number 14, the earnest of our inheritance, until the redemption of the purchased possession, unto the praise of his glory. We could kind of use the earnest money, down payment, if we could look at that illustration this morning to try to explain this. And God's given to us the Holy Spirit of promise. He is the earnest of our inheritance. Listen, we have an inheritance, if you read first Peter chapter number one, that is undefiled, it's incorrupted, it's reserved in heaven for us. Praise the Lord. And we find here that as we look at this portion of scripture and we look at the expectation of every believer, why do I, why does Paul, why should these folks in Corinth have this expectation? Is it prideful? I've been accused before of being prideful. You say, you know that you're going to heaven, that's prideful. It's not prideful at all, because it has nothing to do with me. Has everything to do with Jesus. Nothing to do with me. Nothing to do with you. Everything to do with Jesus. Now, I'm thankful that he made me a son, behold, what manner of love the Father hath bestowed upon us that we should be called the sons of God. Read John chapter number one, he came to his own, his own received him not, but as many as received him, to them gave he power to become the sons of God. John 1, 11 and 12. There were some that rejected, but there were some that received. And here, as we look at this expectation, we find that God has given to us, according to 2 Corinthians 5, in verse number five, the earnest of the spirit. Then we come to verse number eight, a verse that is very commonly quoted. We find again, notice the word, we are confident, confident. The expectation. He says, we are confident, I say, and willing rather to be absent from the body and to be present with the Lord. How often we use those words, to be absent from the body is to be present with the Lord. It's Bible truth. It's the revelation of God, God who has all authority, who knows all things, has given all scripture by inspiration of God. We understand that God gave us this truth, and he wants us to have this expectation. He wants us to know, as Paul says, and as these folks in Corinth for us this morning, that we would know, I hope this morning, that you know for sure that heaven is your home. I hope this morning that if you are not certain, if you do not have 100% confidence, if you say, I mean, I really want to go to heaven, I hope I'd go to heaven. Can I tell you this morning, you can know that heaven is your home. You don't have to go through life hoping and wishing and, no, you can know. I remember thinking as a young person, I remember thinking, I believe that there was a heaven. I had no idea how to get there, but I believe there was a heaven. And I remember thinking as a young person, I sure hope I go to heaven when I die. But it was a hoping, it was a kind of a wishful thinking. There was no confidence that I had, and on August 31st, 1997, when I placed my faith and trust in the finished work of Christ at Calvary, there's been a confidence, an expectation that God has given me. I had those thoughts as I would drive to school on that road, my senior year in high school that I shared with you earlier, and I had those thoughts of dying and the uncertainty and so on and so forth. But, you know, I drove that road the rest of my senior year, every day to school, and I never had another fear about it, because God gave me eternal life. He gave me that gift. And we have this expectation. Notice not only the expectation, but can I encourage you this morning, not only the expectation of every believer, but the excitement of every believer. Listen, our expectation, heaven with our Savior, should cause us to be excited. Listen, we're going to heaven. Amen? Somebody said it this way, on your worst day, in your worst circumstances, you're still going to heaven. Sometimes we don't live like that though, do we? Sometimes we can live under the circumstances. Sometimes we can get a real temporal focus, as we see Paul saying not to have at the end of the fourth chapter. Sometimes we can be so burdened and so heavy, laden over all the things that we're dealing with and we can lose that perspective. I would submit to you this morning, that we ought to have excitement every day of our lives. That heaven is my destiny. It's my destination. It's where I'm heading. Think about this, I would ask it maybe this way, how much joy do you have? How much joy do I have, knowing that all these trials, all these hardships, are just temporary. They're just temporary. You say, man, it's been a long time. Listen, it's nothing in light of eternity. Nothing in light of eternity. Forever and ever and ever and ever I will be with my Lord and my Savior. And that ought to cause us to have joy and speak. I mean, we ought to be the most excited, happy, joyful people on the face of the earth. Amen? And can I tell you, when we're that way, when we live that way, it has an impact on people. It really does. Because they deal with some of the same trials that you deal with, and when they see you struggling and overwhelmed and down and depressed and so on and so forth, they, why do I need what you have? But man, when you can face all those trials in life and say, heaven's my home. I mean, yeah, there's some things going on. I mean, there's chaos, there's all sorts of difficulties, but man, I'm going to heaven. I'm not home, but I'm going home. Amen? I'm not home. This world, the songwriter said, this world is not my home. I'm just passing through. My treasures are laid up somewhere beyond the blue. You know the song. What a joy. The book of Hebrews in chapter 11 and verse 13 makes it this way, that we're strangers and pilgrims. I'm not home. You're not home. But we're going home. I'm thankful this morning that this is just temporary, just temporary. And I understand that in the temporary, I mean, we live in time. I understand that. We're bound by time. But if we can just have that step back and have that eternal perspective, then I'm going to heaven, going to heaven. Joy, unspeakable and full of glory, the excitement. Let me read some verses to you. Turn to the book of 1 Corinthians, if you will. And I think that Paul is writing, I wish this morning that we could see really his countenance as he's writing these words of Scripture in 2 Corinthians chapter 5, that when he talks about this confidence and this expectation, there's great joy that's just coming from Paul that he knows that heaven is his home. He wasn't fearful whatsoever. He was looking forward with that expectation and he was living with excitement because heaven was his home in 1 Corinthians chapter 15. He's writing to the same church and it's the great chapter on the resurrection. And we find that as we get to the end of the chapter, notice in verse 51, Paul says this in 1 Corinthians 15 and verse 51, behold, I show you a mystery. We shall not all sleep, but we shall all be changed in a moment. The twinkling of an eye, the last trump for the trumpet shall sound and the dead shall be raised incorruptible and we shall be changed. Notice the truth of verse 53, for this corruptible must put on incorruption. Notice this mortal must put on immortality. Wow. This is exciting. So often when we think about the truth of heaven and we start talking about heaven, oh man, we get excited. I preached a message on heaven this morning and it ought to cause the people of God to be excited, to have joy, knowing that this is my expectation, but what's going to happen tomorrow and Tuesday and the next day and you're going to go out in the world and you're going to face all the circumstances and all the hardships and all the difficulties and all of a sudden what's going to happen is we're going to get our eyes off of heaven and we're going to get on the temporal things. And we're going to maybe lose a little bit of that joy, but could I encourage you this morning that every day of our lives we need to be heavenly focused, eternal perspective. I'm going to heaven. The songwriter said, I'm going to heaven, can't wait. Man, I hope you feel that way this morning. I mean, not that you're, you know, dreading life. No, God gives us opportunities and God gives us these days to be able to serve Him and to bring Him glory and to be able to tell others about heaven. Reminded of the truth, not only here at 1 Corinthians chapter 15, but in 1 Thessalonians chapter number 4, it's a passage of Scripture that deals with the rapture and we find that Paul is seeking to give comfort and information to these believers in Thessalonica, the church, and he wants to have them also confident of this truth with regard to the return of the Lord. He wants them to be informed. He does not want them, in fact, he says, I would not have you to be ignorant. He wants them to be informed. God wants us to know and we find this wonderful truth in verse number 17. I'm not going to read the entirety of the text, but in verse number 17, well, I'll read verse 16 with it. It says, For the Lord Himself shall descend from heaven with a shout, with the voice of the archangel and with the trump of God, and the dead in Christ shall rise first. Then we which are alive and remain shall be caught up together with them in the clouds to meet the Lord in the air. And then I want you to focus on these last words, and so shall we ever be with the Lord. Is that not exciting? I mean, this morning, Tim and Holly saying when God is near, my God is near, and yes, I'm so thankful that we can enter into His presence. I'm thankful that the Bible speaks about in the book of Psalms that there is joy in His presence and we can understand entering into the very presence of God and having that sweet communion and that sweet fellowship as we get around His word, as we enter into our prayer closet, as we worship Him in spirit and in truth. But one day, I'm going to see Him face-to-face, and one day, the Bible tells us that when we meet Him, that we will be with Him forever, forever. And that changes our perspective, gives us a joy and an excitement that far outweighs anything that you're going to face this week, anything that you faced last week. Heaven, heaven is where I'm heading, where I'm going. We find that Jesus, John 14, you're familiar with the passage of Scripture. I love these verses, and we find that Jesus is speaking to disciples that have hearts that are troubled with regard to what He has revealed to them that would happen in the days ahead. We find they have hearts that are troubled, and we find that throughout these few chapters here in the Gospel of John that Jesus is explaining to them very important truth. It's expedient for you, He'll say later in this chapter, that I go away. Why? Because I'm going to send the Spirit. We talk about the Holy Spirit, the Comforter, and we find that Jesus reveals so many wonderful promises and truths to them in these chapters. But when we begin reading chapter 14, Jesus says, let not your heart be troubled. Let not your heart be troubled. You know, it's interesting, for we find in John chapter number 16 and verse number 33, He says, these things have I spoken unto you that you might have peace. In the world you shall have tribulation, but be of good cheer, I have overcome the world. So He says, let not your heart be troubled. You believe in God, believe also in Me. Then He goes on to say this, in My Father's house are many mansions. If it were not so, I would have told you. And then He makes this statement, I go to prepare a place for you. Think about that just for a moment. I go to prepare a place for you. And if I go and prepare a place for you, I will come again. We rejoice in the truth that He's coming again. But notice what He says after that, that where I am, there ye may be also. Is that what your Bible says? That where I am, Jesus says, our Savior, that where I am, there ye may be also. And this morning, that ought to give us a great level of excitement, a great level of joy. When we go through life, we have this expectation. Paul makes it very clear as he's writing to these believers in Corinth, in 2 Corinthians chapter 5, listen, we know, we have this confidence, we're willing, and he gives all of this truth and it causes us to have this understanding and this expectation, but the reality is what we understand to be true should impact us, should give us an excitement. You ever meet someone that's living under the circumstances? What do I mean by that? You meet someone that you ask them how they're doing and then you regret it. I'm just being very transparent this morning. Have you ever had that experience? I have. Hey, how's your week? It's been a week. Hey, how are you? Let me tell you, I asked a guy once, I was, man, I was still in college, I was working my first corporate job, working as I was in college, and I asked this coworker, how are you? And for like the next hour, he just complained and complained and complained and all of these problems. And here's what I said to myself, Ron, I'm never going to ask that guy again how he's doing. I mean, he was trying to make me depressed. It was unbelievable. But then I found out that he said he was a Christian. He's just living under the circumstances. He had no joy. See, he didn't have that perspective that Paul spoke of at the end of 2 Corinthians chapter 4, that eternal perspective. He wasn't living with that. that expectancy that heaven is a real place and I'm gonna go there not because I deserve to go there but because Jesus, God in flesh died for me and he offered to me this free gift and he saved me and what a joy and because of that expectation I live now with a joy that I never had before. I never had that joy before. Why? Because the thought of death scared me. Because I had no idea what was gonna happen. Then after a little while when I had been in church and heard some preaching I knew what was going to happen and that was that I had not trust that Christ is my savior and if I died without Christ I would spend eternity in the lake of fire. I believed that to be true. And I believe that to be true still to this very day. If you die without Christ you'll spend eternity in the lake of fire. But as the man that said to me yesterday, I heard you could go to hell for lying, can I tell you that God doesn't want anyone to go to hell. The Lord is not slack concerning his promises. Some men count slackness but as longsuffering to us we're not willing that any should perish but that all should come to repentance. And this morning maybe someone's here, maybe someone's tuned in via live stream and they've never been saved. They don't have that expectation and excitement that we're speaking of this morning because they've never been saved. And we love to take a Bible and show you how you can know for sure that heaven is your home. It'd be such a wonderful thing. In fact, in just another chapter Paul will say this, that today is the day of salvation. No man knoweth, Proverbs says, what a day may bring forth. Do not delay. If you're not sure of heaven get it settled this morning. But could I talk to the Christians just for a moment? You're here this morning and you've trusted Christ as your savior. Maybe you trust at Christ decades ago. Maybe you trust at Christ just recently. But you trust at Christ as your personal savior and you know for sure that heaven is your home. You have that expectation that one day you'll see Christ face to face. And I just wanna challenge us this morning of how has that affected us? Has it given us the level of excitement? Has it given us the joy? Do those that we come in contact with, the people that we work with, the people that we have social interactions with, maybe those that we, Joseph playing basketball, we have interactions with a number of people that don't go to church, that don't know that heaven is their home. But should they see the joy? Should they see the excitement in my life, in his life, in Holly's life when they see us there? How about you and the places that you have interactions with others? Do they see that there's something different? You have an excitement. You know, there's a lot going on in our world, is there not? I mean, seriously, strangers have approached me and asked me questions about things that are going on right now in our nation. Man, what do you think about all this stuff? We live in Northern Virginia. We're gonna be impacted by a lot of these things, right? I get it. And can I tell you that, this isn't my full statement on this, there's a lot of things going on, but can I tell you that heaven's my home? You know, the economy can just be destroyed, the stock market can fall, it has in the past. Do you know what the psalmist says? My God is very present, help in trouble. Though the mountains be, I mean, that's catastrophic. Listen, no matter what happens, I'm going to heaven. On your worst day, on my worst day, I'm going to heaven. And I wonder this morning, do we have excitement? Are we living with that joy that heaven is my home? If you're not certain of heaven, we'd love to take a Bible. In fact, we'll have some folks down here this morning that they'd take a Bible if you're a lady, we'll have a lady talk with you. If you're a man, we'll have a man talk with you and have a Bible available to show you what God says in his word about being saved. If you're not sure of heaven, today is the day of salvation. But for those of us that know Christ as our savior, live with joy, live with excitement, and have a burden to tell somebody else that they too can be saved by the grace of God. Let's pray together. Father, how we love you this morning. We thank you so much for loving us. We thank you for your word, for the truth of your word. We thank you for who you are. We thank you for the plan of salvation. We thank you for the gift of God, which is eternal life. And Father, if there's one here this morning that's not sure of heaven, oh, it's our prayer that today would be the day of their salvation, that we could take a Bible and show them how they could know for sure that heaven's their home. I pray for every Christian here this morning. God, would you stir us? God, would you help us to have a burden to reach others? Would you help us to live every day with excitement and joy? Because this expectation, that which we know to be absent from the body is to be present with the Lord. We ask that you'd move and work as only you can, and we'll thank you for it. In Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. No one's looking around. We have an invitation at the end of each of our services for the purpose of allowing people to respond to the message. Mark is down here this morning. Holly's down here this morning. If you're a lady, you don't know for sure that heaven's your home, we'd invite you to come. We'd never embarrass you, but Holly would meet with you and share with you what the Bible says. Mark, if you're a man, he'll meet with you. Maybe you just want to come and pray. You don't want to thank God for the salvation that he's given you. Maybe you want to come, there's a burden on your heart for someone that needs to be saved, and you want to pray that God gives you that opportunity, that you would live. Maybe you acknowledge in your life that you've been living under the circumstances without that eternal perspective. The altar is open, as Kimberly plays. ♪♪",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.759999990463257,
      "text": " now for this calendar year, 2025,"
    },
    {
      "id": 1,
      "start": 3.759999990463257,
      "end": 5.639999866485596,
      "text": " studying through the book of 2 Corinthians"
    },
    {
      "id": 2,
      "start": 5.639999866485596,
      "end": 9.680000305175781,
      "text": " with our theme, God's Grace is Sufficient."
    },
    {
      "id": 3,
      "start": 9.680000305175781,
      "end": 12.520000457763672,
      "text": " And I'm so thankful I preached that very first Sunday,"
    },
    {
      "id": 4,
      "start": 12.520000457763672,
      "end": 15.819999694824219,
      "text": " actually it was the last Sunday of December of 2024,"
    },
    {
      "id": 5,
      "start": 15.819999694824219,
      "end": 19.0,
      "text": " the introduction, if you will, to this series."
    },
    {
      "id": 6,
      "start": 19.0,
      "end": 21.719999313354492,
      "text": " And there's a promise in 2 Corinthians 12"
    },
    {
      "id": 7,
      "start": 21.719999313354492,
      "end": 24.399999618530273,
      "text": " and verse number nine that God's grace is sufficient."
    },
    {
      "id": 8,
      "start": 24.399999618530273,
      "end": 27.31999969482422,
      "text": " It's a promise that needs to be embraced."
    },
    {
      "id": 9,
      "start": 27.31999969482422,
      "end": 29.979999542236328,
      "text": " It is explained there, but it needs to be embraced"
    },
    {
      "id": 10,
      "start": 29.979999542236328,
      "end": 33.58000183105469,
      "text": " by God's people and experienced by God's people"
    },
    {
      "id": 11,
      "start": 33.58000183105469,
      "end": 36.5,
      "text": " that God's grace is sufficient."
    },
    {
      "id": 12,
      "start": 36.5,
      "end": 37.900001525878906,
      "text": " Well, you'll recall from last week"
    },
    {
      "id": 13,
      "start": 37.900001525878906,
      "end": 39.29999923706055,
      "text": " in 2 Corinthians chapter number four,"
    },
    {
      "id": 14,
      "start": 39.29999923706055,
      "end": 41.13999938964844,
      "text": " we looked at verses eight down through"
    },
    {
      "id": 15,
      "start": 41.13999938964844,
      "end": 43.47999954223633,
      "text": " the end of the chapter, verse number 18,"
    },
    {
      "id": 16,
      "start": 43.47999954223633,
      "end": 46.540000915527344,
      "text": " and Paul was speaking with great transparency"
    },
    {
      "id": 17,
      "start": 46.540000915527344,
      "end": 50.02000045776367,
      "text": " with regard to the ministry and all those things."
    },
    {
      "id": 18,
      "start": 50.02000045776367,
      "end": 53.060001373291016,
      "text": " And we said this, that when you look at the pressures,"
    },
    {
      "id": 19,
      "start": 53.060001373291016,
      "end": 55.34000015258789,
      "text": " he says we faint not, we look at the pressures,"
    },
    {
      "id": 20,
      "start": 55.34000015258789,
      "end": 60.20000076293945,
      "text": " but then we see the provision that God gives his grace"
    },
    {
      "id": 21,
      "start": 60.20000076293945,
      "end": 62.81999969482422,
      "text": " and God gives his strength and his power"
    },
    {
      "id": 22,
      "start": 62.81999969482422,
      "end": 64.77999877929688,
      "text": " and what a blessing that is."
    },
    {
      "id": 23,
      "start": 64.77999877929688,
      "end": 67.5,
      "text": " He ends the fourth chapter by really speaking"
    },
    {
      "id": 24,
      "start": 67.5,
      "end": 69.62000274658203,
      "text": " about perspective."
    },
    {
      "id": 25,
      "start": 69.62000274658203,
      "end": 72.41999816894531,
      "text": " That's how we ended the message last Sunday morning."
    },
    {
      "id": 26,
      "start": 72.41999816894531,
      "end": 76.0999984741211,
      "text": " And we talked about that perspective of eternal things."
    },
    {
      "id": 27,
      "start": 76.0999984741211,
      "end": 78.45999908447266,
      "text": " He says at the end of the chapter in verse number 18,"
    },
    {
      "id": 28,
      "start": 78.45999908447266,
      "end": 81.30000305175781,
      "text": " while we look not at the things which are seen,"
    },
    {
      "id": 29,
      "start": 81.30000305175781,
      "end": 82.81999969482422,
      "text": " but the things which are not seen"
    },
    {
      "id": 30,
      "start": 82.81999969482422,
      "end": 84.9800033569336,
      "text": " for the things which are seen are temporal,"
    },
    {
      "id": 31,
      "start": 85.5,
      "end": 89.77999877929688,
      "text": " but the things which are not seen are eternal."
    },
    {
      "id": 32,
      "start": 89.77999877929688,
      "end": 93.54000091552734,
      "text": " And then immediately after Paul is challenging"
    },
    {
      "id": 33,
      "start": 93.54000091552734,
      "end": 96.45999908447266,
      "text": " the people of Corinth and after we're being challenged"
    },
    {
      "id": 34,
      "start": 96.45999908447266,
      "end": 99.22000122070312,
      "text": " as we read this letter, this book,"
    },
    {
      "id": 35,
      "start": 99.22000122070312,
      "end": 102.0999984741211,
      "text": " to have our focus on that which is eternal"
    },
    {
      "id": 36,
      "start": 102.0999984741211,
      "end": 104.0999984741211,
      "text": " instead of that which is temporal,"
    },
    {
      "id": 37,
      "start": 104.0999984741211,
      "end": 108.0,
      "text": " we find that he immediately turns his attention to heaven."
    },
    {
      "id": 38,
      "start": 109.80000305175781,
      "end": 111.0199966430664,
      "text": " Why?"
    },
    {
      "id": 39,
      "start": 111.0199966430664,
      "end": 113.12000274658203,
      "text": " Well, because that's eternal."
    },
    {
      "id": 40,
      "start": 113.12000274658203,
      "end": 115.27999877929688,
      "text": " And he starts talking about this perspective"
    },
    {
      "id": 41,
      "start": 115.27999877929688,
      "end": 117.08000183105469,
      "text": " and as he's talking about this perspective,"
    },
    {
      "id": 42,
      "start": 117.08000183105469,
      "end": 119.5199966430664,
      "text": " not looking at the things which are temporal,"
    },
    {
      "id": 43,
      "start": 119.5199966430664,
      "end": 121.27999877929688,
      "text": " but the things which are eternal"
    },
    {
      "id": 44,
      "start": 121.27999877929688,
      "end": 123.36000061035156,
      "text": " and he reaches this high point"
    },
    {
      "id": 45,
      "start": 123.36000061035156,
      "end": 125.0,
      "text": " at the end of chapter number four"
    },
    {
      "id": 46,
      "start": 125.0,
      "end": 126.91999816894531,
      "text": " and then we enter into the fifth chapter."
    },
    {
      "id": 47,
      "start": 126.91999816894531,
      "end": 129.0399932861328,
      "text": " Of course, we know that the chapter divisions"
    },
    {
      "id": 48,
      "start": 129.0399932861328,
      "end": 132.0399932861328,
      "text": " were added well after and therefore our ease"
    },
    {
      "id": 49,
      "start": 132.0399932861328,
      "end": 134.67999267578125,
      "text": " of being able to find portions of scripture."
    },
    {
      "id": 50,
      "start": 134.67999267578125,
      "end": 137.0,
      "text": " And we find here this morning"
    },
    {
      "id": 51,
      "start": 137.0,
      "end": 139.8000030517578,
      "text": " that immediately his attention turns to heaven."
    },
    {
      "id": 52,
      "start": 139.8000030517578,
      "end": 141.8800048828125,
      "text": " Aren't you thankful for the truth of heaven?"
    },
    {
      "id": 53,
      "start": 141.8800048828125,
      "end": 144.8000030517578,
      "text": " I titled the message this morning the certainty of heaven."
    },
    {
      "id": 54,
      "start": 144.8000030517578,
      "end": 147.63999938964844,
      "text": " And when we look at this passage of scripture,"
    },
    {
      "id": 55,
      "start": 147.63999938964844,
      "end": 150.55999755859375,
      "text": " we find that there are many that discuss heaven"
    },
    {
      "id": 56,
      "start": 150.55999755859375,
      "end": 152.10000610351562,
      "text": " in the day and age in which we live."
    },
    {
      "id": 57,
      "start": 152.10000610351562,
      "end": 154.3000030517578,
      "text": " They acknowledge most will acknowledge"
    },
    {
      "id": 58,
      "start": 154.3000030517578,
      "end": 157.60000610351562,
      "text": " the existence of heaven and many would say this,"
    },
    {
      "id": 59,
      "start": 157.60000610351562,
      "end": 161.1199951171875,
      "text": " they desire that they would go to heaven."
    },
    {
      "id": 60,
      "start": 161.1199951171875,
      "end": 163.83999633789062,
      "text": " It's very few people that I've ever spoken to"
    },
    {
      "id": 61,
      "start": 163.83999633789062,
      "end": 167.17999267578125,
      "text": " and I ask people often as I have opportunity"
    },
    {
      "id": 62,
      "start": 167.17999267578125,
      "end": 169.74000549316406,
      "text": " to share the gospel and as we go through"
    },
    {
      "id": 63,
      "start": 169.74000549316406,
      "end": 172.4199981689453,
      "text": " and pass out gospel tracts and knock on doors"
    },
    {
      "id": 64,
      "start": 172.4199981689453,
      "end": 175.77999877929688,
      "text": " and have interactions, divine appointments with individuals."
    },
    {
      "id": 65,
      "start": 175.77999877929688,
      "end": 178.55999755859375,
      "text": " So often when we have those conversations,"
    },
    {
      "id": 66,
      "start": 178.55999755859375,
      "end": 180.3800048828125,
      "text": " I'll ask a question like this,"
    },
    {
      "id": 67,
      "start": 180.3800048828125,
      "end": 182.94000244140625,
      "text": " are you 100% sure if you were to die today"
    },
    {
      "id": 68,
      "start": 182.94000244140625,
      "end": 185.6999969482422,
      "text": " that heaven is your home?"
    },
    {
      "id": 69,
      "start": 185.6999969482422,
      "end": 189.82000732421875,
      "text": " And most people respond to me with this kind of a phrase"
    },
    {
      "id": 70,
      "start": 189.82000732421875,
      "end": 193.94000244140625,
      "text": " is I hope so, I think so, I hope so."
    },
    {
      "id": 71,
      "start": 193.94000244140625,
      "end": 196.89999389648438,
      "text": " I mean, they want to go to heaven."
    },
    {
      "id": 72,
      "start": 196.89999389648438,
      "end": 198.6999969482422,
      "text": " Very few people that I've ever met"
    },
    {
      "id": 73,
      "start": 198.6999969482422,
      "end": 202.5399932861328,
      "text": " that have not had a desire to go to heaven."
    },
    {
      "id": 74,
      "start": 202.5399932861328,
      "end": 206.5,
      "text": " And heaven is a subject, a topic that is spoken of often,"
    },
    {
      "id": 75,
      "start": 206.5,
      "end": 208.97999572753906,
      "text": " but we find that the subject of heaven,"
    },
    {
      "id": 76,
      "start": 208.97999572753906,
      "end": 212.74000549316406,
      "text": " the authority with regard to heaven,"
    },
    {
      "id": 77,
      "start": 212.74000549316406,
      "end": 216.02000427246094,
      "text": " what it is, where it is, who will go,"
    },
    {
      "id": 78,
      "start": 216.02000427246094,
      "end": 220.13999938964844,
      "text": " the authority is the Bible, it's God's word."
    },
    {
      "id": 79,
      "start": 220.13999938964844,
      "end": 221.6199951171875,
      "text": " It's not your opinion, my opinion,"
    },
    {
      "id": 80,
      "start": 221.6199951171875,
      "end": 224.10000610351562,
      "text": " it's not what some person wrote about,"
    },
    {
      "id": 81,
      "start": 224.10000610351562,
      "end": 228.13999938964844,
      "text": " talked about what you find in some other form of literature."
    },
    {
      "id": 82,
      "start": 228.66000366210938,
      "end": 231.25999450683594,
      "text": " No, the Bible has the authority."
    },
    {
      "id": 83,
      "start": 231.25999450683594,
      "end": 234.22000122070312,
      "text": " And we find that as we look at this passage of scripture,"
    },
    {
      "id": 84,
      "start": 234.22000122070312,
      "end": 237.4600067138672,
      "text": " we find that the Apostle Paul will reveal to us"
    },
    {
      "id": 85,
      "start": 237.4600067138672,
      "end": 239.3000030517578,
      "text": " some of that which we are familiar with,"
    },
    {
      "id": 86,
      "start": 239.3000030517578,
      "end": 243.10000610351562,
      "text": " and no doubt the importance of knowing"
    },
    {
      "id": 87,
      "start": 243.10000610351562,
      "end": 246.89999389648438,
      "text": " and having confidence that heaven is not only a real place,"
    },
    {
      "id": 88,
      "start": 246.89999389648438,
      "end": 250.86000061035156,
      "text": " but the certainty that we can have as individuals"
    },
    {
      "id": 89,
      "start": 250.86000061035156,
      "end": 253.6199951171875,
      "text": " that heaven is our home."
    },
    {
      "id": 90,
      "start": 253.6199951171875,
      "end": 256.17999267578125,
      "text": " I'm so thankful, there was a day in my life,"
    },
    {
      "id": 91,
      "start": 256.17999267578125,
      "end": 258.29998779296875,
      "text": " and I think if you're saved here this morning,"
    },
    {
      "id": 92,
      "start": 258.29998779296875,
      "end": 260.5400085449219,
      "text": " if you've trusted Christ as your savior,"
    },
    {
      "id": 93,
      "start": 260.5400085449219,
      "end": 262.1000061035156,
      "text": " there was a day in your life as well"
    },
    {
      "id": 94,
      "start": 262.1000061035156,
      "end": 264.29998779296875,
      "text": " that you went through life not knowing"
    },
    {
      "id": 95,
      "start": 264.29998779296875,
      "end": 266.739990234375,
      "text": " if heaven was truly your home."
    },
    {
      "id": 96,
      "start": 266.739990234375,
      "end": 268.260009765625,
      "text": " I remember as a young child,"
    },
    {
      "id": 97,
      "start": 268.260009765625,
      "end": 269.9800109863281,
      "text": " I didn't get saved until I was 17 years old,"
    },
    {
      "id": 98,
      "start": 269.9800109863281,
      "end": 271.739990234375,
      "text": " I remember as a young child,"
    },
    {
      "id": 99,
      "start": 271.739990234375,
      "end": 274.0199890136719,
      "text": " I remember right before I got saved"
    },
    {
      "id": 100,
      "start": 274.0199890136719,
      "end": 275.82000732421875,
      "text": " and as I would drive that road,"
    },
    {
      "id": 101,
      "start": 275.82000732421875,
      "end": 278.7799987792969,
      "text": " I can see it in my mind's eye this morning"
    },
    {
      "id": 102,
      "start": 278.7799987792969,
      "end": 281.29998779296875,
      "text": " as I would drive in Southern California to school"
    },
    {
      "id": 103,
      "start": 281.29998779296875,
      "end": 284.29998779296875,
      "text": " from the military base where my dad was stationed"
    },
    {
      "id": 104,
      "start": 284.29998779296875,
      "end": 287.6199951171875,
      "text": " and I could see and I could see in my mind's eye"
    },
    {
      "id": 105,
      "start": 287.6199951171875,
      "end": 291.1400146484375,
      "text": " that hilly terrain and those curvy roads"
    },
    {
      "id": 106,
      "start": 291.1400146484375,
      "end": 293.29998779296875,
      "text": " and I remember having the thought"
    },
    {
      "id": 107,
      "start": 293.29998779296875,
      "end": 294.739990234375,
      "text": " that if I were to get in a car accident"
    },
    {
      "id": 108,
      "start": 294.739990234375,
      "end": 297.1000061035156,
      "text": " and go off the side of the road and died,"
    },
    {
      "id": 109,
      "start": 297.1000061035156,
      "end": 300.9800109863281,
      "text": " I did not have certainty that heaven was my home."
    },
    {
      "id": 110,
      "start": 300.9800109863281,
      "end": 301.82000732421875,
      "text": " I remember that."
    },
    {
      "id": 111,
      "start": 302.70001220703125,
      "end": 305.1000061035156,
      "text": " Many of us this morning, we remember that."
    },
    {
      "id": 112,
      "start": 305.1000061035156,
      "end": 307.1400146484375,
      "text": " You know, there's a whole host of people today"
    },
    {
      "id": 113,
      "start": 307.1400146484375,
      "end": 309.82000732421875,
      "text": " that still are in that situation."
    },
    {
      "id": 114,
      "start": 309.82000732421875,
      "end": 311.1400146484375,
      "text": " They hope."
    },
    {
      "id": 115,
      "start": 311.1400146484375,
      "end": 316.1400146484375,
      "text": " Most people today acknowledge the reality of death."
    },
    {
      "id": 116,
      "start": 317.29998779296875,
      "end": 319.5400085449219,
      "text": " It's not something that is comfortable"
    },
    {
      "id": 117,
      "start": 319.5400085449219,
      "end": 321.29998779296875,
      "text": " for most people to speak of,"
    },
    {
      "id": 118,
      "start": 321.29998779296875,
      "end": 324.29998779296875,
      "text": " but you know that there's an entire industry"
    },
    {
      "id": 119,
      "start": 324.29998779296875,
      "end": 327.3800048828125,
      "text": " that has made, I don't know how much money they have"
    },
    {
      "id": 120,
      "start": 327.3800048828125,
      "end": 329.3399963378906,
      "text": " on selling life insurance."
    },
    {
      "id": 121,
      "start": 330.4200134277344,
      "end": 332.2200012207031,
      "text": " Do they not?"
    },
    {
      "id": 122,
      "start": 332.2200012207031,
      "end": 334.260009765625,
      "text": " They sell life insurance."
    },
    {
      "id": 123,
      "start": 334.260009765625,
      "end": 335.7799987792969,
      "text": " I remember talking to a guy that called me"
    },
    {
      "id": 124,
      "start": 335.7799987792969,
      "end": 337.5799865722656,
      "text": " about selling me life insurance."
    },
    {
      "id": 125,
      "start": 337.5799865722656,
      "end": 338.94000244140625,
      "text": " I said, you know, we kind of talk to people"
    },
    {
      "id": 126,
      "start": 338.94000244140625,
      "end": 340.1000061035156,
      "text": " about the same thing."
    },
    {
      "id": 127,
      "start": 340.1000061035156,
      "end": 341.1000061035156,
      "text": " He said, really?"
    },
    {
      "id": 128,
      "start": 341.1000061035156,
      "end": 342.5400085449219,
      "text": " I said, yeah, we talk to people about death,"
    },
    {
      "id": 129,
      "start": 342.5400085449219,
      "end": 344.6199951171875,
      "text": " but you're trying to sell them something"
    },
    {
      "id": 130,
      "start": 344.6199951171875,
      "end": 347.4599914550781,
      "text": " that will help somebody else when they die"
    },
    {
      "id": 131,
      "start": 348.6199951171875,
      "end": 349.8599853515625,
      "text": " and I'm trying to talk to them"
    },
    {
      "id": 132,
      "start": 349.8599853515625,
      "end": 352.82000732421875,
      "text": " so that they can know where they're gonna go when they die."
    },
    {
      "id": 133,
      "start": 354.29998779296875,
      "end": 356.7799987792969,
      "text": " And I said, as a matter of fact,"
    },
    {
      "id": 134,
      "start": 356.7799987792969,
      "end": 358.5,
      "text": " you talk to people about death all the time"
    },
    {
      "id": 135,
      "start": 358.5,
      "end": 361.82000732421875,
      "text": " and you sell life insurance every day of your life."
    },
    {
      "id": 136,
      "start": 361.82000732421875,
      "end": 363.4599914550781,
      "text": " What's gonna happen when you die?"
    },
    {
      "id": 137,
      "start": 364.82000732421875,
      "end": 366.4599914550781,
      "text": " And he just kind of paused."
    },
    {
      "id": 138,
      "start": 366.4599914550781,
      "end": 369.6600036621094,
      "text": " A man that sold life insurance for a living,"
    },
    {
      "id": 139,
      "start": 369.6600036621094,
      "end": 371.6600036621094,
      "text": " a man that talked to people about dying,"
    },
    {
      "id": 140,
      "start": 371.6600036621094,
      "end": 376.17999267578125,
      "text": " that his livelihood was the result of the acknowledgement"
    },
    {
      "id": 141,
      "start": 376.17999267578125,
      "end": 378.94000244140625,
      "text": " and reality that people will die,"
    },
    {
      "id": 142,
      "start": 380.5400085449219,
      "end": 385.0199890136719,
      "text": " had never given thought personally"
    },
    {
      "id": 143,
      "start": 385.0199890136719,
      "end": 387.70001220703125,
      "text": " what would happen to him when he died."
    },
    {
      "id": 144,
      "start": 387.70001220703125,
      "end": 389.17999267578125,
      "text": " I'd love to tell you that he got saved,"
    },
    {
      "id": 145,
      "start": 389.17999267578125,
      "end": 391.17999267578125,
      "text": " but he really just wanted to make a sale."
    },
    {
      "id": 146,
      "start": 392.260009765625,
      "end": 394.82000732421875,
      "text": " He wasn't too interested in hearing the Bible truth"
    },
    {
      "id": 147,
      "start": 395.739990234375,
      "end": 396.6600036621094,
      "text": " about heaven."
    },
    {
      "id": 148,
      "start": 397.5400085449219,
      "end": 399.70001220703125,
      "text": " This morning, when we look at the word of God,"
    },
    {
      "id": 149,
      "start": 399.70001220703125,
      "end": 401.8599853515625,
      "text": " we find that we can have confidence"
    },
    {
      "id": 150,
      "start": 401.8599853515625,
      "end": 405.5,
      "text": " and we can have certainty of not only the truth"
    },
    {
      "id": 151,
      "start": 405.5,
      "end": 408.1400146484375,
      "text": " that heaven is a real place,"
    },
    {
      "id": 152,
      "start": 408.1400146484375,
      "end": 410.5,
      "text": " but that we that have been born again,"
    },
    {
      "id": 153,
      "start": 410.5,
      "end": 413.1000061035156,
      "text": " we that have been saved by the blood of Christ,"
    },
    {
      "id": 154,
      "start": 413.1000061035156,
      "end": 415.17999267578125,
      "text": " will get to heaven when we die."
    },
    {
      "id": 155,
      "start": 416.4200134277344,
      "end": 419.3800048828125,
      "text": " Someone made this comment in my presence just yesterday."
    },
    {
      "id": 156,
      "start": 420.70001220703125,
      "end": 421.6199951171875,
      "text": " Here's what they said to me."
    },
    {
      "id": 157,
      "start": 421.6199951171875,
      "end": 425.1000061035156,
      "text": " They said, well, they thought I was making something up."
    },
    {
      "id": 158,
      "start": 425.1000061035156,
      "end": 426.739990234375,
      "text": " I talked about being a grandparent,"
    },
    {
      "id": 159,
      "start": 426.739990234375,
      "end": 429.29998779296875,
      "text": " and they said, you're too young to be a grandparent."
    },
    {
      "id": 160,
      "start": 429.29998779296875,
      "end": 432.6199951171875,
      "text": " And really, they said that because Holly was with me."
    },
    {
      "id": 161,
      "start": 432.6199951171875,
      "end": 434.260009765625,
      "text": " They didn't say that because I look young."
    },
    {
      "id": 162,
      "start": 434.260009765625,
      "end": 436.05999755859375,
      "text": " They said that because Holly looks young."
    },
    {
      "id": 163,
      "start": 436.05999755859375,
      "end": 438.1400146484375,
      "text": " And I know the situation, right?"
    },
    {
      "id": 164,
      "start": 438.1400146484375,
      "end": 440.0199890136719,
      "text": " But they said this in my presence."
    },
    {
      "id": 165,
      "start": 440.0199890136719,
      "end": 442.1400146484375,
      "text": " They said, now listen, I've been told"
    },
    {
      "id": 166,
      "start": 442.1400146484375,
      "end": 443.82000732421875,
      "text": " that you can go to hell for lying."
    },
    {
      "id": 167,
      "start": 445.17999267578125,
      "end": 448.82000732421875,
      "text": " But you know the reality is that yes, all men are liars,"
    },
    {
      "id": 168,
      "start": 448.82000732421875,
      "end": 450.29998779296875,
      "text": " and all liars shall have their part"
    },
    {
      "id": 169,
      "start": 450.29998779296875,
      "end": 452.3399963378906,
      "text": " in the lake of fire, Revelation 21."
    },
    {
      "id": 170,
      "start": 452.3399963378906,
      "end": 455.17999267578125,
      "text": " But the reality is that the reason that someone goes to hell"
    },
    {
      "id": 171,
      "start": 455.17999267578125,
      "end": 456.4599914550781,
      "text": " is not because they lied."
    },
    {
      "id": 172,
      "start": 456.4599914550781,
      "end": 458.17999267578125,
      "text": " It's because they're a sinner,"
    },
    {
      "id": 173,
      "start": 458.17999267578125,
      "end": 460.05999755859375,
      "text": " and they've not trusted Jesus Christ"
    },
    {
      "id": 174,
      "start": 460.05999755859375,
      "end": 461.739990234375,
      "text": " as their personal savior."
    },
    {
      "id": 175,
      "start": 461.739990234375,
      "end": 463.29998779296875,
      "text": " The reason that I'm going to heaven"
    },
    {
      "id": 176,
      "start": 463.29998779296875,
      "end": 464.9800109863281,
      "text": " is not because I deserve it."
    },
    {
      "id": 177,
      "start": 464.9800109863281,
      "end": 466.4599914550781,
      "text": " It's not because I'm good enough."
    },
    {
      "id": 178,
      "start": 466.4599914550781,
      "end": 468.0199890136719,
      "text": " It's not because of something I did."
    },
    {
      "id": 179,
      "start": 468.0199890136719,
      "end": 470.94000244140625,
      "text": " No, it's all because of what Jesus Christ did"
    },
    {
      "id": 180,
      "start": 470.94000244140625,
      "end": 472.9800109863281,
      "text": " on the cross of Calvary."
    },
    {
      "id": 181,
      "start": 472.9800109863281,
      "end": 475.70001220703125,
      "text": " It's all because of his substitutionary atonement"
    },
    {
      "id": 182,
      "start": 475.70001220703125,
      "end": 479.7799987792969,
      "text": " that he took, and he paid a sin debt that he did not owe."
    },
    {
      "id": 183,
      "start": 479.7799987792969,
      "end": 482.3399963378906,
      "text": " He paid for my sin, and for your sin,"
    },
    {
      "id": 184,
      "start": 482.3399963378906,
      "end": 483.5799865722656,
      "text": " and for the sin of the world."
    },
    {
      "id": 185,
      "start": 483.5799865722656,
      "end": 487.9800109863281,
      "text": " And he says, I've now offered to you this gift."
    },
    {
      "id": 186,
      "start": 487.9800109863281,
      "end": 488.82000732421875,
      "text": " What is the gift?"
    },
    {
      "id": 187,
      "start": 488.82000732421875,
      "end": 492.5400085449219,
      "text": " It's eternal life through Jesus Christ, our Lord."
    },
    {
      "id": 188,
      "start": 492.5400085449219,
      "end": 495.17999267578125,
      "text": " And Paul was a recipient of that gift."
    },
    {
      "id": 189,
      "start": 495.17999267578125,
      "end": 498.82000732421875,
      "text": " Paul had an amazing experience on the road to Damascus,"
    },
    {
      "id": 190,
      "start": 498.82000732421875,
      "end": 500.6600036621094,
      "text": " and Acts chapter number nine is he's there,"
    },
    {
      "id": 191,
      "start": 500.6600036621094,
      "end": 504.70001220703125,
      "text": " and he's going to persecute those that are Christians,"
    },
    {
      "id": 192,
      "start": 504.70001220703125,
      "end": 506.2200012207031,
      "text": " any that are of this way."
    },
    {
      "id": 193,
      "start": 506.2200012207031,
      "end": 508.7799987792969,
      "text": " And the Lord Jesus Christ appears to him,"
    },
    {
      "id": 194,
      "start": 508.7799987792969,
      "end": 511.7799987792969,
      "text": " and he says, who art thou, Lord?"
    },
    {
      "id": 195,
      "start": 511.7799987792969,
      "end": 514.0999755859375,
      "text": " What wilt thou have me to do?"
    },
    {
      "id": 196,
      "start": 514.0999755859375,
      "end": 516.0999755859375,
      "text": " And Paul was never the same."
    },
    {
      "id": 197,
      "start": 516.0999755859375,
      "end": 517.8200073242188,
      "text": " You read Acts chapter number nine,"
    },
    {
      "id": 198,
      "start": 517.8200073242188,
      "end": 521.4600219726562,
      "text": " and in fact, if you read about maybe halfway,"
    },
    {
      "id": 199,
      "start": 521.4600219726562,
      "end": 523.2999877929688,
      "text": " two thirds of the way through the chapter,"
    },
    {
      "id": 200,
      "start": 523.2999877929688,
      "end": 527.0599975585938,
      "text": " you start reading that Paul is preaching the gospel."
    },
    {
      "id": 201,
      "start": 527.0599975585938,
      "end": 528.8200073242188,
      "text": " He's preaching Christ."
    },
    {
      "id": 202,
      "start": 528.8200073242188,
      "end": 530.8599853515625,
      "text": " What happened in this guy's life?"
    },
    {
      "id": 203,
      "start": 530.8599853515625,
      "end": 532.4199829101562,
      "text": " Well, he's a new creature."
    },
    {
      "id": 204,
      "start": 532.4199829101562,
      "end": 534.4199829101562,
      "text": " He'd been saved and born again."
    },
    {
      "id": 205,
      "start": 535.5,
      "end": 537.4199829101562,
      "text": " And now he's preaching the gospel."
    },
    {
      "id": 206,
      "start": 537.4199829101562,
      "end": 539.1799926757812,
      "text": " And then God used the apostle Paul"
    },
    {
      "id": 207,
      "start": 539.1799926757812,
      "end": 541.260009765625,
      "text": " to go to the city of Corinth."
    },
    {
      "id": 208,
      "start": 541.260009765625,
      "end": 542.4199829101562,
      "text": " And he went to the city of Corinth."
    },
    {
      "id": 209,
      "start": 542.4199829101562,
      "end": 543.260009765625,
      "text": " You know what he did?"
    },
    {
      "id": 210,
      "start": 543.260009765625,
      "end": 544.97998046875,
      "text": " You read 1 Corinthians chapter number one."
    },
    {
      "id": 211,
      "start": 544.97998046875,
      "end": 547.9000244140625,
      "text": " He went there not to have people following him."
    },
    {
      "id": 212,
      "start": 547.9000244140625,
      "end": 550.0999755859375,
      "text": " He went there to preach Christ."
    },
    {
      "id": 213,
      "start": 550.0999755859375,
      "end": 553.1799926757812,
      "text": " He went there not so that people could look at him"
    },
    {
      "id": 214,
      "start": 553.1799926757812,
      "end": 554.780029296875,
      "text": " as being this great orator"
    },
    {
      "id": 215,
      "start": 554.780029296875,
      "end": 557.6599731445312,
      "text": " and having some level of man worship."
    },
    {
      "id": 216,
      "start": 557.6599731445312,
      "end": 559.780029296875,
      "text": " No, he went there to preach Christ."
    },
    {
      "id": 217,
      "start": 559.780029296875,
      "end": 562.8599853515625,
      "text": " He went there, as he says in Romans chapter number one,"
    },
    {
      "id": 218,
      "start": 562.8599853515625,
      "end": 564.2999877929688,
      "text": " to preach the gospel."
    },
    {
      "id": 219,
      "start": 564.2999877929688,
      "end": 565.1400146484375,
      "text": " Why?"
    },
    {
      "id": 220,
      "start": 565.1400146484375,
      "end": 568.5,
      "text": " Because the gospel is the power of God unto salvation."
    },
    {
      "id": 221,
      "start": 568.5,
      "end": 569.8599853515625,
      "text": " And Paul believed that."
    },
    {
      "id": 222,
      "start": 569.8599853515625,
      "end": 573.0599975585938,
      "text": " I mean, he went everywhere preaching the gospel."
    },
    {
      "id": 223,
      "start": 573.0599975585938,
      "end": 574.0999755859375,
      "text": " You read his life,"
    },
    {
      "id": 224,
      "start": 574.0999755859375,
      "end": 576.8200073242188,
      "text": " you trace his steps through the New Testament,"
    },
    {
      "id": 225,
      "start": 576.8200073242188,
      "end": 578.0999755859375,
      "text": " and he's preaching the gospel,"
    },
    {
      "id": 226,
      "start": 578.0999755859375,
      "end": 579.5,
      "text": " and he's preaching the gospel,"
    },
    {
      "id": 227,
      "start": 579.5,
      "end": 582.1400146484375,
      "text": " and he's taking and seizing those opportunities."
    },
    {
      "id": 228,
      "start": 582.1400146484375,
      "end": 582.97998046875,
      "text": " Why?"
    },
    {
      "id": 229,
      "start": 582.97998046875,
      "end": 587.260009765625,
      "text": " Because he knows the truth of eternity,"
    },
    {
      "id": 230,
      "start": 587.260009765625,
      "end": 590.1799926757812,
      "text": " and he knows the power of the gospel."
    },
    {
      "id": 231,
      "start": 590.1799926757812,
      "end": 592.1799926757812,
      "text": " This morning, when we first begin reading"
    },
    {
      "id": 232,
      "start": 592.1799926757812,
      "end": 593.5399780273438,
      "text": " chapter number five,"
    },
    {
      "id": 233,
      "start": 593.5800170898438,
      "end": 594.7000122070312,
      "text": " notice what he says,"
    },
    {
      "id": 234,
      "start": 594.7000122070312,
      "end": 597.1799926757812,
      "text": " for we know."
    },
    {
      "id": 235,
      "start": 597.1799926757812,
      "end": 598.9400024414062,
      "text": " I'm gonna pause there just for a moment."
    },
    {
      "id": 236,
      "start": 598.9400024414062,
      "end": 600.7000122070312,
      "text": " We're gonna get through the first."
    },
    {
      "id": 0,
      "start": 600.7000122070312,
      "end": 604.4200122356415,
      "text": " verses this morning. I only have two points. I told somebody that before the"
    },
    {
      "id": 1,
      "start": 604.4200122356415,
      "end": 607.7400121688843,
      "text": " service this morning. I said, well, I only got two points. That doesn't mean"
    },
    {
      "id": 2,
      "start": 607.7400121688843,
      "end": 613.0200119018555,
      "text": " anything, but I only have two points, amen? But it says, for we know. Who are"
    },
    {
      "id": 3,
      "start": 613.0200119018555,
      "end": 619.2600116729736,
      "text": " the we? Who are the we? Well, specifically, contextually, when you think about the"
    },
    {
      "id": 4,
      "start": 619.2600116729736,
      "end": 623.1000118255615,
      "text": " original writing, Paul's not only talking about himself, but he's talking about"
    },
    {
      "id": 5,
      "start": 623.1000118255615,
      "end": 627.8600120544434,
      "text": " those in Corinth. Who are those in Corinth that he's speaking of? Well, he's writing to"
    },
    {
      "id": 6,
      "start": 627.8600120544434,
      "end": 631.6600112915039,
      "text": " a local church. If you turn back to chapter number one, the Bible says this"
    },
    {
      "id": 7,
      "start": 631.6600112915039,
      "end": 635.9800109863281,
      "text": " in 2nd Corinthians chapter 1 and verse number 1, Paul, an apostle of Jesus"
    },
    {
      "id": 8,
      "start": 635.9800109863281,
      "end": 641.1400108337402,
      "text": " Christ, by the will of God, and Timothy our brother, notice, unto the church of"
    },
    {
      "id": 9,
      "start": 641.1400108337402,
      "end": 646.2600135803223,
      "text": " God, which is at Corinth, with all the saints which are in all Achaia. And so we"
    },
    {
      "id": 10,
      "start": 646.2600135803223,
      "end": 650.820011138916,
      "text": " find that the apostle Paul, as he's writing, and he says, he addresses in"
    },
    {
      "id": 11,
      "start": 650.820011138916,
      "end": 655.0200119018555,
      "text": " chapter number 1 who he is writing to, and then in chapter number 5 he says,"
    },
    {
      "id": 12,
      "start": 655.1800117492676,
      "end": 660.1000137329102,
      "text": " for we know. And so he's talking about himself. He didn't say, for I know, though"
    },
    {
      "id": 13,
      "start": 660.1000137329102,
      "end": 664.4600105285645,
      "text": " that's true, but he's speaking and he's talking about them collectively, these"
    },
    {
      "id": 14,
      "start": 664.4600105285645,
      "end": 670.7000122070312,
      "text": " people that make up the church. Now, the church is made up of believers. When we"
    },
    {
      "id": 15,
      "start": 670.7000122070312,
      "end": 675.1400146484375,
      "text": " look at the truth of New Testament Christianity, when we understand church"
    },
    {
      "id": 16,
      "start": 675.1400146484375,
      "end": 680.1800155639648,
      "text": " polity and all of that, we look at the epistles, we understand how does one"
    },
    {
      "id": 17,
      "start": 680.2200088500977,
      "end": 686.1800155639648,
      "text": " become a member of a local church. Over the last almost 14 years now, we've had"
    },
    {
      "id": 18,
      "start": 686.1800155639648,
      "end": 691.4600143432617,
      "text": " almost 50, it's almost 60 now, different family units that have joined"
    },
    {
      "id": 19,
      "start": 691.4600143432617,
      "end": 696.260009765625,
      "text": " Fellowship Baptist Church. Since I've been here as the pastor, almost 60 family"
    },
    {
      "id": 20,
      "start": 696.260009765625,
      "end": 699.9800109863281,
      "text": " units have joined the church. I'd like to say that they all still live here, but so"
    },
    {
      "id": 21,
      "start": 699.9800109863281,
      "end": 704.380012512207,
      "text": " many of them have moved away during that same period of time. And here's the"
    },
    {
      "id": 22,
      "start": 704.380012512207,
      "end": 708.5000152587891,
      "text": " reality, is that each individual, and several of you I met with you before you"
    },
    {
      "id": 23,
      "start": 708.5000152587891,
      "end": 712.5000152587891,
      "text": " joined the church, you say this, I want to be a member of Fellowship Baptist"
    },
    {
      "id": 24,
      "start": 712.5000152587891,
      "end": 718.0600128173828,
      "text": " Church. What's one of the first questions that I ask you? Well, tell me about when"
    },
    {
      "id": 25,
      "start": 718.0600128173828,
      "end": 722.7800140380859,
      "text": " you trust that Christ is your Savior. Tell me about your salvation. Tell me"
    },
    {
      "id": 26,
      "start": 722.7800140380859,
      "end": 727.1800155639648,
      "text": " about when you were baptized scripturally. Why? Because the"
    },
    {
      "id": 27,
      "start": 727.1800155639648,
      "end": 731.9800109863281,
      "text": " requirements, if you will, for church membership are that you're saved and"
    },
    {
      "id": 28,
      "start": 731.9800109863281,
      "end": 737.6200103759766,
      "text": " scripturally baptized, and then you join the local church. There's not, it's not a"
    },
    {
      "id": 29,
      "start": 737.6200103759766,
      "end": 742.5800170898438,
      "text": " club. Church isn't a club. The church, there's one way to become a member of"
    },
    {
      "id": 30,
      "start": 742.5800170898438,
      "end": 747.260009765625,
      "text": " the church, and we find that it's through that being saved. And those that have"
    },
    {
      "id": 31,
      "start": 747.260009765625,
      "end": 751.6200103759766,
      "text": " placed their faith and trust in Jesus Christ, today there are many that would"
    },
    {
      "id": 32,
      "start": 751.6200103759766,
      "end": 754.9800109863281,
      "text": " have maybe a misunderstanding of what it means to be saved, or what it means to be"
    },
    {
      "id": 33,
      "start": 754.9800109863281,
      "end": 759.6200103759766,
      "text": " born again. And you ask people if they hope that they're going to heaven. What"
    },
    {
      "id": 34,
      "start": 759.6200103759766,
      "end": 764.02001953125,
      "text": " gives you that hope? Well, I was a member of a church, or I was baptized, or I was"
    },
    {
      "id": 35,
      "start": 764.02001953125,
      "end": 767.6600189208984,
      "text": " this, or I was that, and so on and so forth. But the reality is that there's"
    },
    {
      "id": 36,
      "start": 767.6600189208984,
      "end": 773.3800048828125,
      "text": " only one way to be saved, and that's through accepting Jesus Christ as your"
    },
    {
      "id": 37,
      "start": 773.3800048828125,
      "end": 779.3800048828125,
      "text": " personal Savior. You can't work for salvation. You're not going to earn"
    },
    {
      "id": 38,
      "start": 779.3800048828125,
      "end": 784.2200164794922,
      "text": " it through your good deeds. No, it's a gift. And we find that Paul, as he's"
    },
    {
      "id": 39,
      "start": 784.2200164794922,
      "end": 790.2200164794922,
      "text": " writing to these believers in Corinth, he says that we know, for we know, for we"
    },
    {
      "id": 40,
      "start": 790.3400115966797,
      "end": 795.3000183105469,
      "text": " know what? Notice he says, as we're going to read the text, he says that if our"
    },
    {
      "id": 41,
      "start": 795.3000183105469,
      "end": 800.8600158691406,
      "text": " earthly house of this tabernacle were dissolved, we have a building of God, a"
    },
    {
      "id": 42,
      "start": 800.8600158691406,
      "end": 806.8200073242188,
      "text": " house not made with hands, eternal in the heavens. Do you see how Paul transitions?"
    },
    {
      "id": 43,
      "start": 806.8200073242188,
      "end": 810.5800170898438,
      "text": " I mean, he talked about that eternal perspective at the end of chapter 4, and"
    },
    {
      "id": 44,
      "start": 810.5800170898438,
      "end": 815.6600189208984,
      "text": " immediately his mind goes to eternity. Immediately his mind goes to heaven, and"
    },
    {
      "id": 45,
      "start": 815.6600189208984,
      "end": 819.4600067138672,
      "text": " he says we know that if our earthly house of this tabernacle, what's he"
    },
    {
      "id": 46,
      "start": 819.4600067138672,
      "end": 824.7800140380859,
      "text": " talking about? This body. Peter talks about that his tabernacle, he's gonna put"
    },
    {
      "id": 47,
      "start": 824.7800140380859,
      "end": 829.5400085449219,
      "text": " it off. What is he talking about? He's gonna die. And notice Paul says we know"
    },
    {
      "id": 48,
      "start": 829.5400085449219,
      "end": 832.7400054931641,
      "text": " that if our earthly house of this tabernacle were dissolved, we have a"
    },
    {
      "id": 49,
      "start": 832.7400054931641,
      "end": 837.0600128173828,
      "text": " building of God, a house not made with hands, eternal in the heaven. For in this"
    },
    {
      "id": 50,
      "start": 837.0600128173828,
      "end": 843.3400115966797,
      "text": " we groan, earnestly desiring to be clothed upon with our house which is"
    },
    {
      "id": 51,
      "start": 843.3400115966797,
      "end": 848.02001953125,
      "text": " from heaven. How many of you that are saved, you want to go to heaven? Amen."
    },
    {
      "id": 52,
      "start": 848.1400146484375,
      "end": 854.1000061035156,
      "text": " There are days that you say, man, I groan for it. Paul, when he's writing to the"
    },
    {
      "id": 53,
      "start": 854.1000061035156,
      "end": 859.7799987792969,
      "text": " church at Philippi, right, he said I'm in a straight betwixt two, having a desire"
    },
    {
      "id": 54,
      "start": 859.7799987792969,
      "end": 866.6200256347656,
      "text": " to depart to with Christ, which is far better. That's what he says. But God's"
    },
    {
      "id": 55,
      "start": 866.6200256347656,
      "end": 870.4200134277344,
      "text": " left us here for a purpose, for a reason, we understand that. And he says in verse"
    },
    {
      "id": 56,
      "start": 870.4200134277344,
      "end": 874.4200134277344,
      "text": " number three, if so be that being clothed we shall not be found naked, for we that"
    },
    {
      "id": 57,
      "start": 874.4200134277344,
      "end": 880.3000183105469,
      "text": " are in this tabernacle do groan, being burdened. Not for that we would be"
    },
    {
      "id": 58,
      "start": 880.3000183105469,
      "end": 884.9800109863281,
      "text": " unclothed, but clothed upon that mortality might be swallowed up of life."
    },
    {
      "id": 59,
      "start": 884.9800109863281,
      "end": 889.9400024414062,
      "text": " Now he that hath wrought us for the selfsame thing as God, who also hath"
    },
    {
      "id": 60,
      "start": 889.9400024414062,
      "end": 895.1400146484375,
      "text": " given unto us the earnest of the Spirit. Therefore we are always confident,"
    },
    {
      "id": 61,
      "start": 895.1400146484375,
      "end": 899.5400085449219,
      "text": " knowing that whilst we are at home in the body, we are absent from the Lord. For"
    },
    {
      "id": 62,
      "start": 899.5400085449219,
      "end": 904.9400024414062,
      "text": " we walk by faith, not by sight. We are confident, I say, and willing, rather to"
    },
    {
      "id": 63,
      "start": 904.9400024414062,
      "end": 911.0599975585938,
      "text": " be absent from the body and to be present with the Lord. This morning, if"
    },
    {
      "id": 64,
      "start": 911.0599975585938,
      "end": 916.3400268554688,
      "text": " you're taking notes, number one, the expectation of every believer. Listen, if"
    },
    {
      "id": 65,
      "start": 916.3400268554688,
      "end": 919.260009765625,
      "text": " you've placed your faith and trust in the Lord Jesus Christ, you ought to have"
    },
    {
      "id": 66,
      "start": 919.260009765625,
      "end": 924.9800109863281,
      "text": " an expectation of heaven. You ought to live every day understanding that heaven"
    },
    {
      "id": 67,
      "start": 924.9800109863281,
      "end": 930.4200134277344,
      "text": " is certain, that heaven is that reality, and that I expect, listen, we sing the"
    },
    {
      "id": 68,
      "start": 930.4200134277344,
      "end": 934.7799987792969,
      "text": " songs and we talk about seeing our Savior face-to-face, and this is not just"
    },
    {
      "id": 69,
      "start": 934.7799987792969,
      "end": 939.1000061035156,
      "text": " some wishful thinking. No, this is a confidence, this is an earnest"
    },
    {
      "id": 70,
      "start": 939.1000061035156,
      "end": 943.5400085449219,
      "text": " expectation that I have. And if you're here this morning, I actually said"
    },
    {
      "id": 71,
      "start": 943.5400085449219,
      "end": 947.5,
      "text": " to somebody on the back porch on Wednesday, something was being said, and I"
    },
    {
      "id": 72,
      "start": 947.5,
      "end": 952.260009765625,
      "text": " said, listen, we're going to heaven, right? Just kind of get that focus. And it's not"
    },
    {
      "id": 73,
      "start": 952.3000183105469,
      "end": 957.1800231933594,
      "text": " to say that we shouldn't be concerned about anything that's going on around us."
    },
    {
      "id": 74,
      "start": 957.1800231933594,
      "end": 961.6400146484375,
      "text": " I'm not saying that we live without any awareness of what's going on around us,"
    },
    {
      "id": 75,
      "start": 961.6400146484375,
      "end": 967.8200073242188,
      "text": " but the reality is that my attention and my expectation is that heaven is my home."
    },
    {
      "id": 76,
      "start": 967.8200073242188,
      "end": 978.260009765625,
      "text": " What a joy. We find that he says in verse number one, for we know, we know. He says"
    },
    {
      "id": 77,
      "start": 978.260009765625,
      "end": 984.5,
      "text": " again in verse number one, we say that he says, we have a building of God and"
    },
    {
      "id": 78,
      "start": 984.5,
      "end": 990.9000244140625,
      "text": " house not made with hands eternal in the heavens."
    },
    {
      "id": 79,
      "start": 990.9000244140625,
      "end": 996.7000122070312,
      "text": " We find that Paul is saying to these believers, and even for himself as he's"
    },
    {
      "id": 80,
      "start": 996.7000122070312,
      "end": 1001.6200256347656,
      "text": " taking this moment after speaking about the perspective, he's getting caught up"
    },
    {
      "id": 81,
      "start": 1001.6200256347656,
      "end": 1007.3000183105469,
      "text": " in this expectation that he has, I'm gonna be with my Lord and Savior. We know."
    },
    {
      "id": 82,
      "start": 1008.1800231933594,
      "end": 1015.8600158691406,
      "text": " We know. Notice in this portion of scripture is a portion that I enjoy using"
    },
    {
      "id": 83,
      "start": 1015.8600158691406,
      "end": 1021.3000183105469,
      "text": " at times of having a memorial service, a celebration of life, a funeral, whatever"
    },
    {
      "id": 84,
      "start": 1021.3000183105469,
      "end": 1025.6600036621094,
      "text": " you want to call it. Why? See, when you have the opportunity to preach a funeral"
    },
    {
      "id": 85,
      "start": 1025.6600036621094,
      "end": 1029.8200073242188,
      "text": " for somebody that you know was saved and that's in heaven, it's a totally different"
    },
    {
      "id": 86,
      "start": 1029.8200073242188,
      "end": 1035.7799987792969,
      "text": " situation. I'm telling you, Joe Harrah, if you were here for his memorial service,"
    },
    {
      "id": 87,
      "start": 1035.7799987792969,
      "end": 1041.9000244140625,
      "text": " it was one of the most exciting services I think we ever had. Just, man, he knows"
    },
    {
      "id": 88,
      "start": 1041.9000244140625,
      "end": 1046.2200012207031,
      "text": " that he was going to heaven and we were celebrating. We're just worshiping the"
    },
    {
      "id": 89,
      "start": 1046.2200012207031,
      "end": 1050.8200073242188,
      "text": " Lord. I talk with Brother Curry sometimes. He shares some things with me about,"
    },
    {
      "id": 90,
      "start": 1050.8200073242188,
      "end": 1054.8600158691406,
      "text": " you know, at my funeral, I want blah, blah, blah, whatever. And those are good"
    },
    {
      "id": 91,
      "start": 1054.8600158691406,
      "end": 1059.7400207519531,
      "text": " things, good conversations. But, man, it's a celebration. In 2 Corinthians chapter"
    },
    {
      "id": 92,
      "start": 1059.7400207519531,
      "end": 1063.7799987792969,
      "text": " number five is a portion of scripture along with several others that I enjoy"
    },
    {
      "id": 93,
      "start": 1063.7799987792969,
      "end": 1070.0599975585938,
      "text": " going to. Why? Because of the certainty. For we know, we have. He says in verse"
    },
    {
      "id": 94,
      "start": 1070.0599975585938,
      "end": 1076.1000061035156,
      "text": " number four, notice, for we that are in this tabernacle do groan, being burdened."
    },
    {
      "id": 95,
      "start": 1076.1000061035156,
      "end": 1080.1400146484375,
      "text": " You can think about what he had just spoken of, the pressures in chapter"
    },
    {
      "id": 96,
      "start": 1080.1400146484375,
      "end": 1084.5800170898438,
      "text": " number four, and you can relate with Paul as he makes that statement. But notice he"
    },
    {
      "id": 97,
      "start": 1084.5800170898438,
      "end": 1090.7400207519531,
      "text": " says, not for that we would be unclothed, but clothed upon, notice, that mortality"
    },
    {
      "id": 98,
      "start": 1090.7400207519531,
      "end": 1102.6600036621094,
      "text": " might be swallowed up of life. Death isn't the end. Mortality, notice it says,"
    },
    {
      "id": 99,
      "start": 1102.6600036621094,
      "end": 1110.1400146484375,
      "text": " will be swallowed up of life. Not of death, of life. I know I've shared it before, but"
    },
    {
      "id": 100,
      "start": 1110.1400146484375,
      "end": 1116.739990234375,
      "text": " it's worth repeating. D.L. Moody is often referenced as saying, one day you're"
    },
    {
      "id": 101,
      "start": 1116.739990234375,
      "end": 1124.9400024414062,
      "text": " going to read that D.L. Moody died. And he said this, don't believe it for a second."
    },
    {
      "id": 102,
      "start": 1124.9400024414062,
      "end": 1130.0599975585938,
      "text": " And then he followed that up with this by saying, in that day I'll be more alive than"
    },
    {
      "id": 103,
      "start": 1130.0599975585938,
      "end": 1139.1000366210938,
      "text": " I've ever been. He's talking about mortality being swallowed up of life. This expectation"
    },
    {
      "id": 104,
      "start": 1139.1000366210938,
      "end": 1143.9000244140625,
      "text": " that we have, we often will speak of this and we'll look at some of the verses, but"
    },
    {
      "id": 105,
      "start": 1143.9000244140625,
      "end": 1148.5,
      "text": " we talk about some of the truth of heaven and you read in the book of Revelation and"
    },
    {
      "id": 106,
      "start": 1148.5,
      "end": 1152.6600341796875,
      "text": " you talk about there'll be no more pain, no more sickness, no more death, no more"
    },
    {
      "id": 107,
      "start": 1152.6600341796875,
      "end": 1160.9400024414062,
      "text": " crying. I mean, those are wonderful realities, the certainties that we have of heaven. Notice"
    },
    {
      "id": 108,
      "start": 1160.9400024414062,
      "end": 1167.0,
      "text": " in verse number five, the Bible says, now he that hath wrought us for the selfsame thing"
    },
    {
      "id": 109,
      "start": 1167.0,
      "end": 1177.1600341796875,
      "text": " is God. Notice this, who also hath given unto us the earnest of the Spirit. Now, what"
    },
    {
      "id": 110,
      "start": 1177.1600341796875,
      "end": 1182.3599853515625,
      "text": " is he speaking of here? Well, previously in chapter number one of this letter, 2 Corinthians"
    },
    {
      "id": 111,
      "start": 1182.3599853515625,
      "end": 1189.3200073242188,
      "text": " 1 and verse 22, he says, who hath also sealed us and given the earnest of the Spirit in"
    },
    {
      "id": 112,
      "start": 1189.3200073242188,
      "end": 1195.02001953125,
      "text": " our hearts. And we find that at the moment of salvation, there's many things that happen"
    },
    {
      "id": 113,
      "start": 1195.02001953125,
      "end": 1200.739990234375,
      "text": " at the moment of salvation, but one of them is that the Holy Spirit of God..."
    },
    {
      "id": 0,
      "start": 1200.739990234375,
      "end": 1203.3799903392792,
      "text": " in dwells the believer."
    },
    {
      "id": 1,
      "start": 1203.3799903392792,
      "end": 1207.7999901771545,
      "text": " At the moment that I got saved, at the moment that you got saved, if you placed your faith"
    },
    {
      "id": 2,
      "start": 1207.7999901771545,
      "end": 1212.739990234375,
      "text": " and trust in the Lord Jesus Christ, the finished work of Calvary, his death, his burial, and"
    },
    {
      "id": 3,
      "start": 1212.739990234375,
      "end": 1216.899990081787,
      "text": " his glorious resurrection, and you came to him, the Bible says, for whosoever shall call"
    },
    {
      "id": 4,
      "start": 1216.899990081787,
      "end": 1222.2999897003174,
      "text": " upon the name of the Lord shall be saved, and you accepted that free gift of eternal"
    },
    {
      "id": 5,
      "start": 1222.2999897003174,
      "end": 1228.1799907684326,
      "text": " life, the Bible teaches us that in that moment, not only are we quickened, we're made alive,"
    },
    {
      "id": 6,
      "start": 1228.1799907684326,
      "end": 1233.8199920654297,
      "text": " we're translated immediately from death unto life, and we find that the Holy Spirit of"
    },
    {
      "id": 7,
      "start": 1233.8199920654297,
      "end": 1237.2199897766113,
      "text": " God indwells us."
    },
    {
      "id": 8,
      "start": 1237.2199897766113,
      "end": 1245.4599914550781,
      "text": " At the moment you got saved, you got all of the Holy Spirit that you're ever gonna get."
    },
    {
      "id": 9,
      "start": 1245.4599914550781,
      "end": 1250.2199897766113,
      "text": " The difference is that the Holy Spirit doesn't always have all of us."
    },
    {
      "id": 10,
      "start": 1250.2199897766113,
      "end": 1254.7799911499023,
      "text": " That's where we talk about the filling of the Holy Spirit, Ephesians 5, and be filled"
    },
    {
      "id": 11,
      "start": 1254.7799911499023,
      "end": 1259.9399909973145,
      "text": " with the Spirit, and we understand the difference, but he speaks here about giving to us, notice"
    },
    {
      "id": 12,
      "start": 1259.9399909973145,
      "end": 1266.5799865722656,
      "text": " in verse number 5 again, who also hath given unto us the earnest of the Spirit."
    },
    {
      "id": 13,
      "start": 1266.5799865722656,
      "end": 1270.0199890136719,
      "text": " Look over at Ephesians, keep your place here in 2 Corinthians, but look at Ephesians just"
    },
    {
      "id": 14,
      "start": 1270.0199890136719,
      "end": 1273.9399871826172,
      "text": " for a moment, because it's so important that we look at this truth in Ephesians chapter"
    },
    {
      "id": 15,
      "start": 1273.9399871826172,
      "end": 1282.0799865722656,
      "text": " number 1 and understand this powerful truth that leads to this expectation that we have"
    },
    {
      "id": 16,
      "start": 1282.0799865722656,
      "end": 1285.1999893188477,
      "text": " as saved people."
    },
    {
      "id": 17,
      "start": 1285.1999893188477,
      "end": 1289.2799911499023,
      "text": " In Ephesians chapter number 1, beginning in verse number 12, the Bible says this, that"
    },
    {
      "id": 18,
      "start": 1289.2799911499023,
      "end": 1292.9999923706055,
      "text": " we should be to the praise of his glory."
    },
    {
      "id": 19,
      "start": 1292.9999923706055,
      "end": 1300.5599899291992,
      "text": " Notice this, who first trusted in Christ, and then it says in verse 13, in whom ye also"
    },
    {
      "id": 20,
      "start": 1300.5599899291992,
      "end": 1308.359992980957,
      "text": " trusted after that ye heard the word of truth, the gospel of your salvation."
    },
    {
      "id": 21,
      "start": 1308.359992980957,
      "end": 1311.5999908447266,
      "text": " Now pause, I'm gonna come back and read the rest of the verse in just a moment, but"
    },
    {
      "id": 22,
      "start": 1311.5999908447266,
      "end": 1317.7599868774414,
      "text": " understand that before, listen, we had to hear the gospel before we could be saved."
    },
    {
      "id": 23,
      "start": 1317.7599868774414,
      "end": 1319.9199905395508,
      "text": " How shall they be saved, right?"
    },
    {
      "id": 24,
      "start": 1319.9199905395508,
      "end": 1325.0399932861328,
      "text": " You read for whoso shall call upon the name of the Lord shall be saved, Romans 10 in verse"
    },
    {
      "id": 25,
      "start": 1325.0399932861328,
      "end": 1328.239990234375,
      "text": " number 13, how shall they call on him in whom they've not heard?"
    },
    {
      "id": 26,
      "start": 1328.239990234375,
      "end": 1332.759994506836,
      "text": " How shall they call or hear on him without a preacher and all of that?"
    },
    {
      "id": 27,
      "start": 1332.759994506836,
      "end": 1336.3599853515625,
      "text": " And we understand, listen, we had to hear the gospel."
    },
    {
      "id": 28,
      "start": 1336.3599853515625,
      "end": 1337.3599853515625,
      "text": " You had to hear the gospel."
    },
    {
      "id": 29,
      "start": 1338.3599853515625,
      "end": 1344.9199829101562,
      "text": " You had to hear that you're a sinner, and that your sin has a penalty, a consequence."
    },
    {
      "id": 30,
      "start": 1344.9199829101562,
      "end": 1348.999984741211,
      "text": " The wages of sin is death."
    },
    {
      "id": 31,
      "start": 1348.999984741211,
      "end": 1349.999984741211,
      "text": " How to become a sinner?"
    },
    {
      "id": 32,
      "start": 1349.999984741211,
      "end": 1354.5199890136719,
      "text": " I was born a sinner just like everyone else other than the Lord Jesus Christ."
    },
    {
      "id": 33,
      "start": 1354.5199890136719,
      "end": 1357.3999938964844,
      "text": " We're born sinners."
    },
    {
      "id": 34,
      "start": 1357.3999938964844,
      "end": 1363.8799896240234,
      "text": " No one has to teach those kids in the nursery to be selfish, amen?"
    },
    {
      "id": 35,
      "start": 1363.8799896240234,
      "end": 1368.6399841308594,
      "text": " You have children, you've been around children, you know they're born sinners."
    },
    {
      "id": 36,
      "start": 1368.6399841308594,
      "end": 1372.5999908447266,
      "text": " Even grandchildren, amen, they're born sinners."
    },
    {
      "id": 37,
      "start": 1372.5999908447266,
      "end": 1375.759994506836,
      "text": " But here's the reality."
    },
    {
      "id": 38,
      "start": 1375.759994506836,
      "end": 1381.0799865722656,
      "text": " We recognize that we're sinners and there's a price for sin, but God commendeth his love"
    },
    {
      "id": 39,
      "start": 1381.0799865722656,
      "end": 1388.0399932861328,
      "text": " toward us, and that while we were yet sinners, Christ died for us."
    },
    {
      "id": 40,
      "start": 1388.0399932861328,
      "end": 1389.0399932861328,
      "text": " He died for me."
    },
    {
      "id": 41,
      "start": 1389.0399932861328,
      "end": 1390.7999877929688,
      "text": " He took my place."
    },
    {
      "id": 42,
      "start": 1390.7999877929688,
      "end": 1394.0399932861328,
      "text": " And I heard that truth of the gospel, for whosoever shall call upon the name of the"
    },
    {
      "id": 43,
      "start": 1394.0399932861328,
      "end": 1400.9599914550781,
      "text": " Lord shall be saved, and I heard that message, and when I heard that message, and when these"
    },
    {
      "id": 44,
      "start": 1400.9599914550781,
      "end": 1407.1599884033203,
      "text": " folks in Ephesus heard the message, he says, in whom ye also trusted after that ye heard"
    },
    {
      "id": 45,
      "start": 1407.1599884033203,
      "end": 1411.999984741211,
      "text": " the word of truth, the gospel of your salvation."
    },
    {
      "id": 46,
      "start": 1411.999984741211,
      "end": 1412.999984741211,
      "text": " You have to hear the gospel."
    },
    {
      "id": 47,
      "start": 1412.999984741211,
      "end": 1417.759994506836,
      "text": " That's why we send forth missionaries, so that the gospel will be preached."
    },
    {
      "id": 48,
      "start": 1417.759994506836,
      "end": 1419.1999969482422,
      "text": " That's why we give you gospel tracts."
    },
    {
      "id": 49,
      "start": 1419.3199920654297,
      "end": 1423.0799865722656,
      "text": " That's why we have visitation and soul winning on Saturdays at 10 a.m."
    },
    {
      "id": 50,
      "start": 1423.0799865722656,
      "end": 1424.0799865722656,
      "text": " Why?"
    },
    {
      "id": 51,
      "start": 1424.0799865722656,
      "end": 1427.479995727539,
      "text": " Because we need to go and preach the gospel because they need to hear the truth of the"
    },
    {
      "id": 52,
      "start": 1427.479995727539,
      "end": 1428.479995727539,
      "text": " gospel."
    },
    {
      "id": 53,
      "start": 1428.479995727539,
      "end": 1429.479995727539,
      "text": " Why?"
    },
    {
      "id": 54,
      "start": 1429.479995727539,
      "end": 1432.999984741211,
      "text": " Second Corinthians chapter number four, if our gospel be hid, it is hid to them that"
    },
    {
      "id": 55,
      "start": 1432.999984741211,
      "end": 1438.719985961914,
      "text": " are lost, in whom the God of this world, little g, God of this world, hath blinded the minds"
    },
    {
      "id": 56,
      "start": 1438.719985961914,
      "end": 1445.1999969482422,
      "text": " of them which believe not, lest the light of the glorious gospel should shine unto them."
    },
    {
      "id": 57,
      "start": 1445.239990234375,
      "end": 1450.1999969482422,
      "text": " So these folks in Ephesus, Paul was used of the Lord to go and to preach the gospel, and"
    },
    {
      "id": 58,
      "start": 1450.1999969482422,
      "end": 1454.8799896240234,
      "text": " he says, you trusted Christ after you heard."
    },
    {
      "id": 59,
      "start": 1454.8799896240234,
      "end": 1461.0799865722656,
      "text": " And then notice at the end of verse number 13, in whom also after that ye believed, ye"
    },
    {
      "id": 60,
      "start": 1461.0799865722656,
      "end": 1470.5599975585938,
      "text": " were sealed with that Holy Spirit of promise, which is, verse number 14, the earnest of"
    },
    {
      "id": 61,
      "start": 1470.5599975585938,
      "end": 1477.4400024414062,
      "text": " our inheritance, until the redemption of the purchased possession, unto the praise"
    },
    {
      "id": 62,
      "start": 1477.4400024414062,
      "end": 1479.2799987792969,
      "text": " of his glory."
    },
    {
      "id": 63,
      "start": 1479.2799987792969,
      "end": 1484.47998046875,
      "text": " We could kind of use the earnest money, down payment, if we could look at that illustration"
    },
    {
      "id": 64,
      "start": 1484.47998046875,
      "end": 1487.1199951171875,
      "text": " this morning to try to explain this."
    },
    {
      "id": 65,
      "start": 1487.1199951171875,
      "end": 1491.1199951171875,
      "text": " And God's given to us the Holy Spirit of promise."
    },
    {
      "id": 66,
      "start": 1491.1199951171875,
      "end": 1492.8800048828125,
      "text": " He is the earnest of our inheritance."
    },
    {
      "id": 67,
      "start": 1492.8800048828125,
      "end": 1498.239990234375,
      "text": " Listen, we have an inheritance, if you read first Peter chapter number one, that is undefiled,"
    },
    {
      "id": 68,
      "start": 1498.239990234375,
      "end": 1502.6399841308594,
      "text": " it's incorrupted, it's reserved in heaven for us."
    },
    {
      "id": 69,
      "start": 1502.6399841308594,
      "end": 1504.6399841308594,
      "text": " Praise the Lord."
    },
    {
      "id": 70,
      "start": 1504.6399841308594,
      "end": 1509.9599914550781,
      "text": " And we find here that as we look at this portion of scripture and we look at the expectation"
    },
    {
      "id": 71,
      "start": 1509.9599914550781,
      "end": 1516.0,
      "text": " of every believer, why do I, why does Paul, why should these folks in Corinth have this"
    },
    {
      "id": 72,
      "start": 1516.0,
      "end": 1517.0,
      "text": " expectation?"
    },
    {
      "id": 73,
      "start": 1517.0,
      "end": 1518.0,
      "text": " Is it prideful?"
    },
    {
      "id": 74,
      "start": 1518.0,
      "end": 1521.0,
      "text": " I've been accused before of being prideful."
    },
    {
      "id": 75,
      "start": 1521.0,
      "end": 1523.9199829101562,
      "text": " You say, you know that you're going to heaven, that's prideful."
    },
    {
      "id": 76,
      "start": 1523.9199829101562,
      "end": 1526.8399963378906,
      "text": " It's not prideful at all, because it has nothing to do with me."
    },
    {
      "id": 77,
      "start": 1527.3599853515625,
      "end": 1530.6399841308594,
      "text": " Has everything to do with Jesus."
    },
    {
      "id": 78,
      "start": 1530.6399841308594,
      "end": 1531.6399841308594,
      "text": " Nothing to do with me."
    },
    {
      "id": 79,
      "start": 1531.6399841308594,
      "end": 1532.6399841308594,
      "text": " Nothing to do with you."
    },
    {
      "id": 80,
      "start": 1532.6399841308594,
      "end": 1533.6399841308594,
      "text": " Everything to do with Jesus."
    },
    {
      "id": 81,
      "start": 1533.6399841308594,
      "end": 1539.8800048828125,
      "text": " Now, I'm thankful that he made me a son, behold, what manner of love the Father hath bestowed"
    },
    {
      "id": 82,
      "start": 1539.8800048828125,
      "end": 1544.7599792480469,
      "text": " upon us that we should be called the sons of God."
    },
    {
      "id": 83,
      "start": 1544.7599792480469,
      "end": 1548.5599975585938,
      "text": " Read John chapter number one, he came to his own, his own received him not, but as many"
    },
    {
      "id": 84,
      "start": 1548.5599975585938,
      "end": 1553.1199951171875,
      "text": " as received him, to them gave he power to become the sons of God."
    },
    {
      "id": 85,
      "start": 1553.1199951171875,
      "end": 1556.0399780273438,
      "text": " John 1, 11 and 12."
    },
    {
      "id": 86,
      "start": 1556.0399780273438,
      "end": 1560.1999816894531,
      "text": " There were some that rejected, but there were some that received."
    },
    {
      "id": 87,
      "start": 1560.1999816894531,
      "end": 1567.239990234375,
      "text": " And here, as we look at this expectation, we find that God has given to us, according"
    },
    {
      "id": 88,
      "start": 1567.239990234375,
      "end": 1573.47998046875,
      "text": " to 2 Corinthians 5, in verse number five, the earnest of the spirit."
    },
    {
      "id": 89,
      "start": 1573.47998046875,
      "end": 1579.9599914550781,
      "text": " Then we come to verse number eight, a verse that is very commonly quoted."
    },
    {
      "id": 90,
      "start": 1579.9599914550781,
      "end": 1586.8800048828125,
      "text": " We find again, notice the word, we are confident, confident."
    },
    {
      "id": 91,
      "start": 1586.8800048828125,
      "end": 1587.8800048828125,
      "text": " The expectation."
    },
    {
      "id": 92,
      "start": 1587.8800048828125,
      "end": 1595.6799926757812,
      "text": " He says, we are confident, I say, and willing rather to be absent from the body and to be"
    },
    {
      "id": 93,
      "start": 1595.6799926757812,
      "end": 1598.6399841308594,
      "text": " present with the Lord."
    },
    {
      "id": 94,
      "start": 1598.6399841308594,
      "end": 1604.0399780273438,
      "text": " How often we use those words, to be absent from the body is to be present with the Lord."
    },
    {
      "id": 95,
      "start": 1604.0399780273438,
      "end": 1606.47998046875,
      "text": " It's Bible truth."
    },
    {
      "id": 96,
      "start": 1606.47998046875,
      "end": 1612.8399963378906,
      "text": " It's the revelation of God, God who has all authority, who knows all things, has given"
    },
    {
      "id": 97,
      "start": 1612.8399963378906,
      "end": 1615.2799987792969,
      "text": " all scripture by inspiration of God."
    },
    {
      "id": 98,
      "start": 1615.2799987792969,
      "end": 1621.4400024414062,
      "text": " We understand that God gave us this truth, and he wants us to have this expectation."
    },
    {
      "id": 99,
      "start": 1621.4400024414062,
      "end": 1627.8399963378906,
      "text": " He wants us to know, as Paul says, and as these folks in Corinth for us this morning,"
    },
    {
      "id": 100,
      "start": 1627.8399963378906,
      "end": 1635.0399780273438,
      "text": " that we would know, I hope this morning, that you know for sure that heaven is your home."
    },
    {
      "id": 101,
      "start": 1635.0399780273438,
      "end": 1641.6799926757812,
      "text": " I hope this morning that if you are not certain, if you do not have 100% confidence, if you"
    },
    {
      "id": 102,
      "start": 1641.6799926757812,
      "end": 1645.4400024414062,
      "text": " say, I mean, I really want to go to heaven, I hope I'd go to heaven."
    },
    {
      "id": 103,
      "start": 1645.4400024414062,
      "end": 1649.47998046875,
      "text": " Can I tell you this morning, you can know that heaven is your home."
    },
    {
      "id": 104,
      "start": 1649.47998046875,
      "end": 1653.8399963378906,
      "text": " You don't have to go through life hoping and wishing and, no, you can know."
    },
    {
      "id": 105,
      "start": 1653.8399963378906,
      "end": 1659.1199951171875,
      "text": " I remember thinking as a young person, I remember thinking, I believe that there was a heaven."
    },
    {
      "id": 106,
      "start": 1659.1199951171875,
      "end": 1662.5999755859375,
      "text": " I had no idea how to get there, but I believe there was a heaven."
    },
    {
      "id": 107,
      "start": 1662.5999755859375,
      "end": 1668.4400024414062,
      "text": " And I remember thinking as a young person, I sure hope I go to heaven when I die."
    },
    {
      "id": 108,
      "start": 1668.4400024414062,
      "end": 1671.7999877929688,
      "text": " But it was a hoping, it was a kind of a wishful thinking."
    },
    {
      "id": 109,
      "start": 1671.7999877929688,
      "end": 1677.5199890136719,
      "text": " There was no confidence that I had, and on August 31st, 1997, when I placed my faith"
    },
    {
      "id": 110,
      "start": 1677.5199890136719,
      "end": 1682.7599792480469,
      "text": " and trust in the finished work of Christ at Calvary, there's been a confidence, an expectation"
    },
    {
      "id": 111,
      "start": 1682.7599792480469,
      "end": 1685.1199951171875,
      "text": " that God has given me."
    },
    {
      "id": 112,
      "start": 1685.1199951171875,
      "end": 1690.1999816894531,
      "text": " I had those thoughts as I would drive to school on that road, my senior year in high school"
    },
    {
      "id": 113,
      "start": 1690.1999816894531,
      "end": 1694.2799987792969,
      "text": " that I shared with you earlier, and I had those thoughts of dying and the uncertainty"
    },
    {
      "id": 114,
      "start": 1694.2799987792969,
      "end": 1695.2799987792969,
      "text": " and so on and so forth."
    },
    {
      "id": 115,
      "start": 1695.2799987792969,
      "end": 1700.0799865722656,
      "text": " But, you know, I drove that road the rest of my senior year, every day to school, and"
    },
    {
      "id": 116,
      "start": 1700.0799865722656,
      "end": 1705.0799865722656,
      "text": " I never had another fear about it, because God gave me eternal life."
    },
    {
      "id": 117,
      "start": 1705.0799865722656,
      "end": 1707.4400024414062,
      "text": " He gave me that gift."
    },
    {
      "id": 118,
      "start": 1707.4400024414062,
      "end": 1709.5199890136719,
      "text": " And we have this expectation."
    },
    {
      "id": 119,
      "start": 1709.5199890136719,
      "end": 1714.5599975585938,
      "text": " Notice not only the expectation, but can I encourage you this morning, not only the expectation"
    },
    {
      "id": 120,
      "start": 1714.5599975585938,
      "end": 1717.239990234375,
      "text": " of every believer, but the excitement of every believer."
    },
    {
      "id": 121,
      "start": 1717.2799682617188,
      "end": 1721.9599609375,
      "text": " Listen, our expectation, heaven with our Savior, should cause us to be excited."
    },
    {
      "id": 122,
      "start": 1721.9599609375,
      "end": 1724.0,
      "text": " Listen, we're going to heaven."
    },
    {
      "id": 123,
      "start": 1724.0,
      "end": 1725.0,
      "text": " Amen?"
    },
    {
      "id": 124,
      "start": 1725.0,
      "end": 1730.7999877929688,
      "text": " Somebody said it this way, on your worst day, in your worst circumstances, you're still"
    },
    {
      "id": 125,
      "start": 1730.7999877929688,
      "end": 1734.6400146484375,
      "text": " going to heaven."
    },
    {
      "id": 126,
      "start": 1734.6400146484375,
      "end": 1737.3200073242188,
      "text": " Sometimes we don't live like that though, do we?"
    },
    {
      "id": 127,
      "start": 1737.3200073242188,
      "end": 1740.8399658203125,
      "text": " Sometimes we can live under the circumstances."
    },
    {
      "id": 128,
      "start": 1740.8399658203125,
      "end": 1746.8399658203125,
      "text": " Sometimes we can get a real temporal focus, as we see Paul saying not to have at the end"
    },
    {
      "id": 129,
      "start": 1746.8399658203125,
      "end": 1748.5599975585938,
      "text": " of the fourth chapter."
    },
    {
      "id": 130,
      "start": 1748.5599975585938,
      "end": 1754.47998046875,
      "text": " Sometimes we can be so burdened and so heavy, laden over all the things that we're dealing"
    },
    {
      "id": 131,
      "start": 1754.47998046875,
      "end": 1759.5999755859375,
      "text": " with and we can lose that perspective."
    },
    {
      "id": 132,
      "start": 1759.5999755859375,
      "end": 1765.6400146484375,
      "text": " I would submit to you this morning, that we ought to have excitement every day of our"
    },
    {
      "id": 133,
      "start": 1765.6400146484375,
      "end": 1766.6400146484375,
      "text": " lives."
    },
    {
      "id": 134,
      "start": 1766.6400146484375,
      "end": 1769.3200073242188,
      "text": " That heaven is my destiny."
    },
    {
      "id": 135,
      "start": 1769.3200073242188,
      "end": 1770.4400024414062,
      "text": " It's my destination."
    },
    {
      "id": 136,
      "start": 1770.4400024414062,
      "end": 1771.9599609375,
      "text": " It's where I'm heading."
    },
    {
      "id": 137,
      "start": 1771.9599609375,
      "end": 1775.719970703125,
      "text": " Think about this, I would ask it maybe this way, how much joy do you have?"
    },
    {
      "id": 138,
      "start": 1775.719970703125,
      "end": 1781.760009765625,
      "text": " How much joy do I have, knowing that all these trials, all these hardships, are just"
    },
    {
      "id": 139,
      "start": 1781.760009765625,
      "end": 1782.760009765625,
      "text": " temporary."
    },
    {
      "id": 140,
      "start": 1782.760009765625,
      "end": 1783.760009765625,
      "text": " They're just temporary."
    },
    {
      "id": 141,
      "start": 1783.760009765625,
      "end": 1786.239990234375,
      "text": " You say, man, it's been a long time."
    },
    {
      "id": 142,
      "start": 1786.239990234375,
      "end": 1789.9199829101562,
      "text": " Listen, it's nothing in light of eternity."
    },
    {
      "id": 143,
      "start": 1789.9199829101562,
      "end": 1792.2000122070312,
      "text": " Nothing in light of eternity."
    },
    {
      "id": 144,
      "start": 1792.2000122070312,
      "end": 1798.5599975585938,
      "text": " Forever and ever and ever and ever I will be with my Lord and my Savior."
    },
    {
      "id": 145,
      "start": 1798.5599975585938,
      "end": 1800.760009765625,
      "text": " And that ought to cause us to have joy and speak."
    },
    {
      "id": 0,
      "start": 1800.760009765625,
      "end": 1809.9600095748901,
      "text": " I mean, we ought to be the most excited, happy, joyful people on the face of the earth."
    },
    {
      "id": 1,
      "start": 1809.9600095748901,
      "end": 1811.9600095748901,
      "text": " Amen?"
    },
    {
      "id": 2,
      "start": 1811.9600095748901,
      "end": 1816.8200092315674,
      "text": " And can I tell you, when we're that way, when we live that way, it has an impact on people."
    },
    {
      "id": 3,
      "start": 1816.8200092315674,
      "end": 1818.5600090026855,
      "text": " It really does."
    },
    {
      "id": 4,
      "start": 1818.5600090026855,
      "end": 1822.1200103759766,
      "text": " Because they deal with some of the same trials that you deal with, and when they see you"
    },
    {
      "id": 5,
      "start": 1822.1200103759766,
      "end": 1828.0800094604492,
      "text": " struggling and overwhelmed and down and depressed and so on and so forth, they, why do I need"
    },
    {
      "id": 6,
      "start": 1828.0800094604492,
      "end": 1829.0800094604492,
      "text": " what you have?"
    },
    {
      "id": 7,
      "start": 1830.0800094604492,
      "end": 1834.0400085449219,
      "text": " But man, when you can face all those trials in life and say, heaven's my home."
    },
    {
      "id": 8,
      "start": 1834.0400085449219,
      "end": 1836.2400093078613,
      "text": " I mean, yeah, there's some things going on."
    },
    {
      "id": 9,
      "start": 1836.2400093078613,
      "end": 1842.6400108337402,
      "text": " I mean, there's chaos, there's all sorts of difficulties, but man, I'm going to heaven."
    },
    {
      "id": 10,
      "start": 1842.6400108337402,
      "end": 1846.360008239746,
      "text": " I'm not home, but I'm going home."
    },
    {
      "id": 11,
      "start": 1846.360008239746,
      "end": 1847.360008239746,
      "text": " Amen?"
    },
    {
      "id": 12,
      "start": 1847.360008239746,
      "end": 1848.760009765625,
      "text": " I'm not home."
    },
    {
      "id": 13,
      "start": 1848.760009765625,
      "end": 1852.0000114440918,
      "text": " This world, the songwriter said, this world is not my home."
    },
    {
      "id": 14,
      "start": 1852.0000114440918,
      "end": 1854.200008392334,
      "text": " I'm just passing through."
    },
    {
      "id": 15,
      "start": 1854.200008392334,
      "end": 1856.920009613037,
      "text": " My treasures are laid up somewhere beyond the blue."
    },
    {
      "id": 16,
      "start": 1856.920009613037,
      "end": 1857.920009613037,
      "text": " You know the song."
    },
    {
      "id": 17,
      "start": 1858.4800109863281,
      "end": 1860.360008239746,
      "text": " What a joy."
    },
    {
      "id": 18,
      "start": 1860.360008239746,
      "end": 1866.3200073242188,
      "text": " The book of Hebrews in chapter 11 and verse 13 makes it this way, that we're strangers"
    },
    {
      "id": 19,
      "start": 1866.3200073242188,
      "end": 1868.9000091552734,
      "text": " and pilgrims."
    },
    {
      "id": 20,
      "start": 1868.9000091552734,
      "end": 1870.4000091552734,
      "text": " I'm not home."
    },
    {
      "id": 21,
      "start": 1870.4000091552734,
      "end": 1871.4000091552734,
      "text": " You're not home."
    },
    {
      "id": 22,
      "start": 1871.4000091552734,
      "end": 1874.4400100708008,
      "text": " But we're going home."
    },
    {
      "id": 23,
      "start": 1874.4400100708008,
      "end": 1880.0400085449219,
      "text": " I'm thankful this morning that this is just temporary, just temporary."
    },
    {
      "id": 24,
      "start": 1880.0400085449219,
      "end": 1883.2800064086914,
      "text": " And I understand that in the temporary, I mean, we live in time."
    },
    {
      "id": 25,
      "start": 1883.2800064086914,
      "end": 1884.5600128173828,
      "text": " I understand that."
    },
    {
      "id": 26,
      "start": 1884.5600128173828,
      "end": 1886.860008239746,
      "text": " We're bound by time."
    },
    {
      "id": 27,
      "start": 1886.9000091552734,
      "end": 1891.4600067138672,
      "text": " But if we can just have that step back and have that eternal perspective, then I'm going"
    },
    {
      "id": 28,
      "start": 1891.4600067138672,
      "end": 1894.4600067138672,
      "text": " to heaven, going to heaven."
    },
    {
      "id": 29,
      "start": 1894.4600067138672,
      "end": 1898.660011291504,
      "text": " Joy, unspeakable and full of glory, the excitement."
    },
    {
      "id": 30,
      "start": 1898.660011291504,
      "end": 1899.660011291504,
      "text": " Let me read some verses to you."
    },
    {
      "id": 31,
      "start": 1899.660011291504,
      "end": 1902.1000061035156,
      "text": " Turn to the book of 1 Corinthians, if you will."
    },
    {
      "id": 32,
      "start": 1902.1000061035156,
      "end": 1907.0200119018555,
      "text": " And I think that Paul is writing, I wish this morning that we could see really his countenance"
    },
    {
      "id": 33,
      "start": 1907.0200119018555,
      "end": 1912.5000076293945,
      "text": " as he's writing these words of Scripture in 2 Corinthians chapter 5, that when he talks"
    },
    {
      "id": 34,
      "start": 1912.5000076293945,
      "end": 1917.7800064086914,
      "text": " about this confidence and this expectation, there's great joy that's just coming from"
    },
    {
      "id": 35,
      "start": 1917.7800064086914,
      "end": 1921.140007019043,
      "text": " Paul that he knows that heaven is his home."
    },
    {
      "id": 36,
      "start": 1921.140007019043,
      "end": 1922.9400100708008,
      "text": " He wasn't fearful whatsoever."
    },
    {
      "id": 37,
      "start": 1922.9400100708008,
      "end": 1927.3000106811523,
      "text": " He was looking forward with that expectation and he was living with excitement because"
    },
    {
      "id": 38,
      "start": 1927.3000106811523,
      "end": 1931.3800048828125,
      "text": " heaven was his home in 1 Corinthians chapter 15."
    },
    {
      "id": 39,
      "start": 1931.3800048828125,
      "end": 1936.3400115966797,
      "text": " He's writing to the same church and it's the great chapter on the resurrection."
    },
    {
      "id": 40,
      "start": 1936.3400115966797,
      "end": 1940.6400146484375,
      "text": " And we find that as we get to the end of the chapter, notice in verse 51, Paul says this"
    },
    {
      "id": 41,
      "start": 1940.6400146484375,
      "end": 1945.4200134277344,
      "text": " in 1 Corinthians 15 and verse 51, behold, I show you a mystery."
    },
    {
      "id": 42,
      "start": 1945.4200134277344,
      "end": 1949.5600128173828,
      "text": " We shall not all sleep, but we shall all be changed in a moment."
    },
    {
      "id": 43,
      "start": 1949.5600128173828,
      "end": 1953.3200073242188,
      "text": " The twinkling of an eye, the last trump for the trumpet shall sound and the dead shall"
    },
    {
      "id": 44,
      "start": 1953.3200073242188,
      "end": 1958.0400085449219,
      "text": " be raised incorruptible and we shall be changed."
    },
    {
      "id": 45,
      "start": 1958.0400085449219,
      "end": 1966.0800170898438,
      "text": " Notice the truth of verse 53, for this corruptible must put on incorruption."
    },
    {
      "id": 46,
      "start": 1966.5600128173828,
      "end": 1971.5600128173828,
      "text": " Notice this mortal must put on immortality."
    },
    {
      "id": 47,
      "start": 1971.5600128173828,
      "end": 1973.6800079345703,
      "text": " Wow."
    },
    {
      "id": 48,
      "start": 1973.6800079345703,
      "end": 1976.1200103759766,
      "text": " This is exciting."
    },
    {
      "id": 49,
      "start": 1976.1200103759766,
      "end": 1981.0400085449219,
      "text": " So often when we think about the truth of heaven and we start talking about heaven,"
    },
    {
      "id": 50,
      "start": 1981.0400085449219,
      "end": 1982.4400024414062,
      "text": " oh man, we get excited."
    },
    {
      "id": 51,
      "start": 1982.4400024414062,
      "end": 1986.5600128173828,
      "text": " I preached a message on heaven this morning and it ought to cause the people of God to"
    },
    {
      "id": 52,
      "start": 1986.5600128173828,
      "end": 1991.8800048828125,
      "text": " be excited, to have joy, knowing that this is my expectation, but what's going to happen"
    },
    {
      "id": 53,
      "start": 1991.8800048828125,
      "end": 1994.9200134277344,
      "text": " tomorrow and Tuesday and the next day and you're going to go out in the world and you're"
    },
    {
      "id": 54,
      "start": 1994.9200134277344,
      "end": 1999.9600067138672,
      "text": " going to face all the circumstances and all the hardships and all the difficulties and"
    },
    {
      "id": 55,
      "start": 1999.9600067138672,
      "end": 2004.0400085449219,
      "text": " all of a sudden what's going to happen is we're going to get our eyes off of heaven"
    },
    {
      "id": 56,
      "start": 2004.0400085449219,
      "end": 2006.520004272461,
      "text": " and we're going to get on the temporal things."
    },
    {
      "id": 57,
      "start": 2006.520004272461,
      "end": 2011.6000061035156,
      "text": " And we're going to maybe lose a little bit of that joy, but could I encourage you this"
    },
    {
      "id": 58,
      "start": 2011.6000061035156,
      "end": 2017.4000091552734,
      "text": " morning that every day of our lives we need to be heavenly focused, eternal perspective."
    },
    {
      "id": 59,
      "start": 2017.4000091552734,
      "end": 2019.520004272461,
      "text": " I'm going to heaven."
    },
    {
      "id": 60,
      "start": 2019.520004272461,
      "end": 2022.8400115966797,
      "text": " The songwriter said, I'm going to heaven, can't wait."
    },
    {
      "id": 61,
      "start": 2023.6400146484375,
      "end": 2026.1600036621094,
      "text": " Man, I hope you feel that way this morning."
    },
    {
      "id": 62,
      "start": 2026.1600036621094,
      "end": 2030.1200103759766,
      "text": " I mean, not that you're, you know, dreading life."
    },
    {
      "id": 63,
      "start": 2030.1200103759766,
      "end": 2035.000015258789,
      "text": " No, God gives us opportunities and God gives us these days to be able to serve Him and"
    },
    {
      "id": 64,
      "start": 2035.000015258789,
      "end": 2040.8800048828125,
      "text": " to bring Him glory and to be able to tell others about heaven."
    },
    {
      "id": 65,
      "start": 2040.8800048828125,
      "end": 2045.5600128173828,
      "text": " Reminded of the truth, not only here at 1 Corinthians chapter 15, but in 1 Thessalonians"
    },
    {
      "id": 66,
      "start": 2045.5600128173828,
      "end": 2050.760009765625,
      "text": " chapter number 4, it's a passage of Scripture that deals with the rapture and we find that"
    },
    {
      "id": 67,
      "start": 2050.760009765625,
      "end": 2058.0,
      "text": " Paul is seeking to give comfort and information to these believers in Thessalonica, the church,"
    },
    {
      "id": 68,
      "start": 2058.0,
      "end": 2064.4400024414062,
      "text": " and he wants to have them also confident of this truth with regard to the return of the"
    },
    {
      "id": 69,
      "start": 2064.4400024414062,
      "end": 2065.4400024414062,
      "text": " Lord."
    },
    {
      "id": 70,
      "start": 2065.4400024414062,
      "end": 2066.4400024414062,
      "text": " He wants them to be informed."
    },
    {
      "id": 71,
      "start": 2066.4400024414062,
      "end": 2070.279998779297,
      "text": " He does not want them, in fact, he says, I would not have you to be ignorant."
    },
    {
      "id": 72,
      "start": 2070.279998779297,
      "end": 2071.6400146484375,
      "text": " He wants them to be informed."
    },
    {
      "id": 73,
      "start": 2071.6400146484375,
      "end": 2075.52001953125,
      "text": " God wants us to know and we find this wonderful truth in verse number 17."
    },
    {
      "id": 74,
      "start": 2075.52001953125,
      "end": 2079.3200073242188,
      "text": " I'm not going to read the entirety of the text, but in verse number 17, well, I'll read"
    },
    {
      "id": 75,
      "start": 2079.3200073242188,
      "end": 2080.3200073242188,
      "text": " verse 16 with it."
    },
    {
      "id": 76,
      "start": 2080.3200073242188,
      "end": 2085.240020751953,
      "text": " It says, For the Lord Himself shall descend from heaven with a shout, with the voice"
    },
    {
      "id": 77,
      "start": 2085.240020751953,
      "end": 2090.040008544922,
      "text": " of the archangel and with the trump of God, and the dead in Christ shall rise first."
    },
    {
      "id": 78,
      "start": 2090.040008544922,
      "end": 2095.1199951171875,
      "text": " Then we which are alive and remain shall be caught up together with them in the clouds"
    },
    {
      "id": 79,
      "start": 2095.1199951171875,
      "end": 2096.800018310547,
      "text": " to meet the Lord in the air."
    },
    {
      "id": 80,
      "start": 2096.800018310547,
      "end": 2107.2000122070312,
      "text": " And then I want you to focus on these last words, and so shall we ever be with the Lord."
    },
    {
      "id": 81,
      "start": 2107.2000122070312,
      "end": 2109.8399963378906,
      "text": " Is that not exciting?"
    },
    {
      "id": 82,
      "start": 2110.3600158691406,
      "end": 2115.8800048828125,
      "text": " I mean, this morning, Tim and Holly saying when God is near, my God is near, and yes,"
    },
    {
      "id": 83,
      "start": 2115.8800048828125,
      "end": 2119.4400024414062,
      "text": " I'm so thankful that we can enter into His presence."
    },
    {
      "id": 84,
      "start": 2119.4400024414062,
      "end": 2124.6000061035156,
      "text": " I'm thankful that the Bible speaks about in the book of Psalms that there is joy in His"
    },
    {
      "id": 85,
      "start": 2124.6000061035156,
      "end": 2130.8800048828125,
      "text": " presence and we can understand entering into the very presence of God and having that sweet"
    },
    {
      "id": 86,
      "start": 2130.8800048828125,
      "end": 2135.6000061035156,
      "text": " communion and that sweet fellowship as we get around His word, as we enter into our"
    },
    {
      "id": 87,
      "start": 2135.6000061035156,
      "end": 2139.279998779297,
      "text": " prayer closet, as we worship Him in spirit and in truth."
    },
    {
      "id": 88,
      "start": 2139.720001220703,
      "end": 2146.6000061035156,
      "text": " But one day, I'm going to see Him face-to-face, and one day, the Bible tells us that when"
    },
    {
      "id": 89,
      "start": 2146.6000061035156,
      "end": 2154.040008544922,
      "text": " we meet Him, that we will be with Him forever, forever."
    },
    {
      "id": 90,
      "start": 2154.040008544922,
      "end": 2161.3200073242188,
      "text": " And that changes our perspective, gives us a joy and an excitement that far outweighs"
    },
    {
      "id": 91,
      "start": 2161.3200073242188,
      "end": 2166.3600158691406,
      "text": " anything that you're going to face this week, anything that you faced last week."
    },
    {
      "id": 92,
      "start": 2166.4000244140625,
      "end": 2172.480010986328,
      "text": " Heaven, heaven is where I'm heading, where I'm going."
    },
    {
      "id": 93,
      "start": 2172.480010986328,
      "end": 2181.6400146484375,
      "text": " We find that Jesus, John 14, you're familiar with the passage of Scripture."
    },
    {
      "id": 94,
      "start": 2181.6400146484375,
      "end": 2189.279998779297,
      "text": " I love these verses, and we find that Jesus is speaking to disciples that have hearts"
    },
    {
      "id": 95,
      "start": 2189.279998779297,
      "end": 2193.9600219726562,
      "text": " that are troubled with regard to what He has revealed to them that would happen in the"
    },
    {
      "id": 96,
      "start": 2193.9600219726562,
      "end": 2195.0800170898438,
      "text": " days ahead."
    },
    {
      "id": 97,
      "start": 2195.8399963378906,
      "end": 2200.720001220703,
      "text": " We find they have hearts that are troubled, and we find that throughout these few chapters"
    },
    {
      "id": 98,
      "start": 2200.720001220703,
      "end": 2206.52001953125,
      "text": " here in the Gospel of John that Jesus is explaining to them very important truth."
    },
    {
      "id": 99,
      "start": 2206.52001953125,
      "end": 2209.8399963378906,
      "text": " It's expedient for you, He'll say later in this chapter, that I go away."
    },
    {
      "id": 100,
      "start": 2209.8399963378906,
      "end": 2210.8399963378906,
      "text": " Why?"
    },
    {
      "id": 101,
      "start": 2210.8399963378906,
      "end": 2211.8399963378906,
      "text": " Because I'm going to send the Spirit."
    },
    {
      "id": 102,
      "start": 2211.8399963378906,
      "end": 2218.240020751953,
      "text": " We talk about the Holy Spirit, the Comforter, and we find that Jesus reveals so many wonderful"
    },
    {
      "id": 103,
      "start": 2218.240020751953,
      "end": 2221.1600036621094,
      "text": " promises and truths to them in these chapters."
    },
    {
      "id": 104,
      "start": 2221.1600036621094,
      "end": 2227.9600219726562,
      "text": " But when we begin reading chapter 14, Jesus says, let not your heart be troubled."
    },
    {
      "id": 105,
      "start": 2227.9600219726562,
      "end": 2230.0800170898438,
      "text": " Let not your heart be troubled."
    },
    {
      "id": 106,
      "start": 2230.0800170898438,
      "end": 2235.240020751953,
      "text": " You know, it's interesting, for we find in John chapter number 16 and verse number 33,"
    },
    {
      "id": 107,
      "start": 2235.240020751953,
      "end": 2239.8800048828125,
      "text": " He says, these things have I spoken unto you that you might have peace."
    },
    {
      "id": 108,
      "start": 2239.8800048828125,
      "end": 2245.52001953125,
      "text": " In the world you shall have tribulation, but be of good cheer, I have overcome the world."
    },
    {
      "id": 109,
      "start": 2245.52001953125,
      "end": 2248.2000122070312,
      "text": " So He says, let not your heart be troubled."
    },
    {
      "id": 110,
      "start": 2248.2000122070312,
      "end": 2251.279998779297,
      "text": " You believe in God, believe also in Me."
    },
    {
      "id": 111,
      "start": 2251.279998779297,
      "end": 2255.6000061035156,
      "text": " Then He goes on to say this, in My Father's house are many mansions."
    },
    {
      "id": 112,
      "start": 2255.6000061035156,
      "end": 2258.2000122070312,
      "text": " If it were not so, I would have told you."
    },
    {
      "id": 113,
      "start": 2258.2000122070312,
      "end": 2265.5599975585938,
      "text": " And then He makes this statement, I go to prepare a place for you."
    },
    {
      "id": 114,
      "start": 2265.5599975585938,
      "end": 2267.3200073242188,
      "text": " Think about that just for a moment."
    },
    {
      "id": 115,
      "start": 2267.3200073242188,
      "end": 2272.6400146484375,
      "text": " I go to prepare a place for you."
    },
    {
      "id": 116,
      "start": 2272.6400146484375,
      "end": 2280.1600036621094,
      "text": " And if I go and prepare a place for you, I will come again."
    },
    {
      "id": 117,
      "start": 2280.1600036621094,
      "end": 2282.4400024414062,
      "text": " We rejoice in the truth that He's coming again."
    },
    {
      "id": 118,
      "start": 2282.4400024414062,
      "end": 2289.480010986328,
      "text": " But notice what He says after that, that where I am, there ye may be also."
    },
    {
      "id": 119,
      "start": 2289.480010986328,
      "end": 2291.800018310547,
      "text": " Is that what your Bible says?"
    },
    {
      "id": 120,
      "start": 2291.800018310547,
      "end": 2297.760009765625,
      "text": " That where I am, Jesus says, our Savior, that where I am, there ye may be also."
    },
    {
      "id": 121,
      "start": 2297.760009765625,
      "end": 2302.760009765625,
      "text": " And this morning, that ought to give us a great level of excitement, a great level of"
    },
    {
      "id": 122,
      "start": 2302.760009765625,
      "end": 2303.760009765625,
      "text": " joy."
    },
    {
      "id": 123,
      "start": 2303.760009765625,
      "end": 2307.800018310547,
      "text": " When we go through life, we have this expectation."
    },
    {
      "id": 124,
      "start": 2307.800018310547,
      "end": 2312.6000061035156,
      "text": " Paul makes it very clear as he's writing to these believers in Corinth, in 2 Corinthians"
    },
    {
      "id": 125,
      "start": 2312.6000061035156,
      "end": 2320.1199951171875,
      "text": " chapter 5, listen, we know, we have this confidence, we're willing, and he gives all of this truth"
    },
    {
      "id": 126,
      "start": 2320.1199951171875,
      "end": 2326.5599975585938,
      "text": " and it causes us to have this understanding and this expectation, but the reality is what"
    },
    {
      "id": 127,
      "start": 2326.5599975585938,
      "end": 2332.6799926757812,
      "text": " we understand to be true should impact us, should give us an excitement."
    },
    {
      "id": 128,
      "start": 2332.6799926757812,
      "end": 2336.7200317382812,
      "text": " You ever meet someone that's living under the circumstances?"
    },
    {
      "id": 129,
      "start": 2336.7200317382812,
      "end": 2339.0400390625,
      "text": " What do I mean by that?"
    },
    {
      "id": 130,
      "start": 2339.0400390625,
      "end": 2345.760009765625,
      "text": " You meet someone that you ask them how they're doing and then you regret it."
    },
    {
      "id": 131,
      "start": 2345.760009765625,
      "end": 2347.7999877929688,
      "text": " I'm just being very transparent this morning."
    },
    {
      "id": 132,
      "start": 2347.7999877929688,
      "end": 2349.3200073242188,
      "text": " Have you ever had that experience?"
    },
    {
      "id": 133,
      "start": 2349.3200073242188,
      "end": 2350.3200073242188,
      "text": " I have."
    },
    {
      "id": 134,
      "start": 2350.3200073242188,
      "end": 2351.47998046875,
      "text": " Hey, how's your week?"
    },
    {
      "id": 135,
      "start": 2351.47998046875,
      "end": 2352.47998046875,
      "text": " It's been a week."
    },
    {
      "id": 136,
      "start": 2352.47998046875,
      "end": 2354.4000244140625,
      "text": " Hey, how are you?"
    },
    {
      "id": 137,
      "start": 2354.4000244140625,
      "end": 2358.0,
      "text": " Let me tell you, I asked a guy once, I was, man, I was still in college, I was working"
    },
    {
      "id": 138,
      "start": 2358.0,
      "end": 2363.0800170898438,
      "text": " my first corporate job, working as I was in college, and I asked this coworker, how are"
    },
    {
      "id": 139,
      "start": 2363.0800170898438,
      "end": 2364.47998046875,
      "text": " you?"
    },
    {
      "id": 140,
      "start": 2364.47998046875,
      "end": 2370.52001953125,
      "text": " And for like the next hour, he just complained and complained and complained and all of these"
    },
    {
      "id": 141,
      "start": 2370.52001953125,
      "end": 2371.6000366210938,
      "text": " problems."
    },
    {
      "id": 142,
      "start": 2371.6000366210938,
      "end": 2375.7999877929688,
      "text": " And here's what I said to myself, Ron, I'm never going to ask that guy again how he's"
    },
    {
      "id": 143,
      "start": 2375.7999877929688,
      "end": 2376.7999877929688,
      "text": " doing."
    },
    {
      "id": 144,
      "start": 2376.7999877929688,
      "end": 2380.6799926757812,
      "text": " I mean, he was trying to make me depressed."
    },
    {
      "id": 145,
      "start": 2380.6799926757812,
      "end": 2381.6799926757812,
      "text": " It was unbelievable."
    },
    {
      "id": 146,
      "start": 2381.8400268554688,
      "end": 2386.760009765625,
      "text": " But then I found out that he said he was a Christian."
    },
    {
      "id": 147,
      "start": 2386.760009765625,
      "end": 2388.760009765625,
      "text": " He's just living under the circumstances."
    },
    {
      "id": 148,
      "start": 2388.760009765625,
      "end": 2391.3200073242188,
      "text": " He had no joy."
    },
    {
      "id": 149,
      "start": 2391.3200073242188,
      "end": 2397.52001953125,
      "text": " See, he didn't have that perspective that Paul spoke of at the end of 2 Corinthians"
    },
    {
      "id": 150,
      "start": 2397.52001953125,
      "end": 2399.6400146484375,
      "text": " chapter 4, that eternal perspective."
    },
    {
      "id": 151,
      "start": 2399.6400146484375,
      "end": 2400.7999877929688,
      "text": " He wasn't living with that."
    },
    {
      "id": 0,
      "start": 2400.7999877929688,
      "end": 2405.0999879837036,
      "text": " that expectancy that heaven is a real place"
    },
    {
      "id": 1,
      "start": 2405.0999879837036,
      "end": 2407.8999876976013,
      "text": " and I'm gonna go there not because I deserve to go there"
    },
    {
      "id": 2,
      "start": 2407.8999876976013,
      "end": 2410.9399881362915,
      "text": " but because Jesus, God in flesh died for me"
    },
    {
      "id": 3,
      "start": 2410.9399881362915,
      "end": 2414.119987487793,
      "text": " and he offered to me this free gift and he saved me"
    },
    {
      "id": 4,
      "start": 2414.119987487793,
      "end": 2417.339988708496,
      "text": " and what a joy and because of that expectation"
    },
    {
      "id": 5,
      "start": 2417.339988708496,
      "end": 2422.339988708496,
      "text": " I live now with a joy that I never had before."
    },
    {
      "id": 6,
      "start": 2423.959987640381,
      "end": 2426.0999870300293,
      "text": " I never had that joy before."
    },
    {
      "id": 7,
      "start": 2426.0999870300293,
      "end": 2427.119987487793,
      "text": " Why?"
    },
    {
      "id": 8,
      "start": 2427.119987487793,
      "end": 2429.2399883270264,
      "text": " Because the thought of death scared me."
    },
    {
      "id": 9,
      "start": 2430.2399883270264,
      "end": 2433.1599884033203,
      "text": " Because I had no idea what was gonna happen."
    },
    {
      "id": 10,
      "start": 2433.1599884033203,
      "end": 2436.1599884033203,
      "text": " Then after a little while when I had been in church"
    },
    {
      "id": 11,
      "start": 2436.1599884033203,
      "end": 2439.3199882507324,
      "text": " and heard some preaching I knew what was going to happen"
    },
    {
      "id": 12,
      "start": 2439.3199882507324,
      "end": 2442.3799896240234,
      "text": " and that was that I had not trust that Christ is my savior"
    },
    {
      "id": 13,
      "start": 2442.3799896240234,
      "end": 2444.959987640381,
      "text": " and if I died without Christ I would spend eternity"
    },
    {
      "id": 14,
      "start": 2444.959987640381,
      "end": 2445.7999877929688,
      "text": " in the lake of fire."
    },
    {
      "id": 15,
      "start": 2445.7999877929688,
      "end": 2447.999988555908,
      "text": " I believed that to be true."
    },
    {
      "id": 16,
      "start": 2447.999988555908,
      "end": 2451.0799865722656,
      "text": " And I believe that to be true still to this very day."
    },
    {
      "id": 17,
      "start": 2451.0799865722656,
      "end": 2452.839988708496,
      "text": " If you die without Christ you'll spend eternity"
    },
    {
      "id": 18,
      "start": 2452.839988708496,
      "end": 2453.89998626709,
      "text": " in the lake of fire."
    },
    {
      "id": 19,
      "start": 2455.9199867248535,
      "end": 2458.89998626709,
      "text": " But as the man that said to me yesterday,"
    },
    {
      "id": 20,
      "start": 2459.5799865722656,
      "end": 2460.499988555908,
      "text": " I heard you could go to hell for lying,"
    },
    {
      "id": 21,
      "start": 2460.499988555908,
      "end": 2465.1399841308594,
      "text": " can I tell you that God doesn't want anyone to go to hell."
    },
    {
      "id": 22,
      "start": 2467.0799865722656,
      "end": 2469.059989929199,
      "text": " The Lord is not slack concerning his promises."
    },
    {
      "id": 23,
      "start": 2469.059989929199,
      "end": 2471.2999877929688,
      "text": " Some men count slackness but as longsuffering to us"
    },
    {
      "id": 24,
      "start": 2471.2999877929688,
      "end": 2474.739990234375,
      "text": " we're not willing that any should perish"
    },
    {
      "id": 25,
      "start": 2474.739990234375,
      "end": 2477.739990234375,
      "text": " but that all should come to repentance."
    },
    {
      "id": 26,
      "start": 2477.739990234375,
      "end": 2480.3799896240234,
      "text": " And this morning maybe someone's here,"
    },
    {
      "id": 27,
      "start": 2480.3799896240234,
      "end": 2482.1399841308594,
      "text": " maybe someone's tuned in via live stream"
    },
    {
      "id": 28,
      "start": 2482.1399841308594,
      "end": 2483.3799896240234,
      "text": " and they've never been saved."
    },
    {
      "id": 29,
      "start": 2483.3799896240234,
      "end": 2486.339988708496,
      "text": " They don't have that expectation and excitement"
    },
    {
      "id": 30,
      "start": 2486.339988708496,
      "end": 2487.619987487793,
      "text": " that we're speaking of this morning"
    },
    {
      "id": 31,
      "start": 2487.619987487793,
      "end": 2489.5399856567383,
      "text": " because they've never been saved."
    },
    {
      "id": 32,
      "start": 2489.5399856567383,
      "end": 2490.8599853515625,
      "text": " And we love to take a Bible and show you"
    },
    {
      "id": 33,
      "start": 2490.8599853515625,
      "end": 2494.019989013672,
      "text": " how you can know for sure that heaven is your home."
    },
    {
      "id": 34,
      "start": 2494.019989013672,
      "end": 2495.499984741211,
      "text": " It'd be such a wonderful thing."
    },
    {
      "id": 35,
      "start": 2495.499984741211,
      "end": 2498.6599884033203,
      "text": " In fact, in just another chapter Paul will say this,"
    },
    {
      "id": 36,
      "start": 2498.6599884033203,
      "end": 2501.939987182617,
      "text": " that today is the day of salvation."
    },
    {
      "id": 37,
      "start": 2501.939987182617,
      "end": 2505.5799865722656,
      "text": " No man knoweth, Proverbs says, what a day may bring forth."
    },
    {
      "id": 38,
      "start": 2505.5799865722656,
      "end": 2506.419990539551,
      "text": " Do not delay."
    },
    {
      "id": 39,
      "start": 2506.419990539551,
      "end": 2509.6999893188477,
      "text": " If you're not sure of heaven get it settled this morning."
    },
    {
      "id": 40,
      "start": 2509.6999893188477,
      "end": 2513.0999908447266,
      "text": " But could I talk to the Christians just for a moment?"
    },
    {
      "id": 41,
      "start": 2513.0999908447266,
      "end": 2516.219985961914,
      "text": " You're here this morning and you've trusted Christ"
    },
    {
      "id": 42,
      "start": 2516.219985961914,
      "end": 2517.059989929199,
      "text": " as your savior."
    },
    {
      "id": 43,
      "start": 2517.059989929199,
      "end": 2519.2999877929688,
      "text": " Maybe you trust at Christ decades ago."
    },
    {
      "id": 44,
      "start": 2521.059989929199,
      "end": 2523.619987487793,
      "text": " Maybe you trust at Christ just recently."
    },
    {
      "id": 45,
      "start": 2523.619987487793,
      "end": 2525.5399856567383,
      "text": " But you trust at Christ as your personal savior"
    },
    {
      "id": 46,
      "start": 2525.5399856567383,
      "end": 2527.019989013672,
      "text": " and you know for sure that heaven is your home."
    },
    {
      "id": 47,
      "start": 2527.019989013672,
      "end": 2528.619987487793,
      "text": " You have that expectation"
    },
    {
      "id": 48,
      "start": 2529.459991455078,
      "end": 2532.0599822998047,
      "text": " that one day you'll see Christ face to face."
    },
    {
      "id": 49,
      "start": 2532.0599822998047,
      "end": 2534.019989013672,
      "text": " And I just wanna challenge us this morning"
    },
    {
      "id": 50,
      "start": 2534.019989013672,
      "end": 2537.219985961914,
      "text": " of how has that affected us?"
    },
    {
      "id": 51,
      "start": 2537.219985961914,
      "end": 2539.739990234375,
      "text": " Has it given us the level of excitement?"
    },
    {
      "id": 52,
      "start": 2539.739990234375,
      "end": 2541.8999938964844,
      "text": " Has it given us the joy?"
    },
    {
      "id": 53,
      "start": 2541.8999938964844,
      "end": 2544.499984741211,
      "text": " Do those that we come in contact with,"
    },
    {
      "id": 54,
      "start": 2544.8199920654297,
      "end": 2546.1799926757812,
      "text": " the people that we work with,"
    },
    {
      "id": 55,
      "start": 2546.1799926757812,
      "end": 2549.5799865722656,
      "text": " the people that we have social interactions with,"
    },
    {
      "id": 56,
      "start": 2549.5799865722656,
      "end": 2554.0999908447266,
      "text": " maybe those that we, Joseph playing basketball,"
    },
    {
      "id": 57,
      "start": 2554.0999908447266,
      "end": 2557.459991455078,
      "text": " we have interactions with a number of people"
    },
    {
      "id": 58,
      "start": 2557.459991455078,
      "end": 2559.259994506836,
      "text": " that don't go to church,"
    },
    {
      "id": 59,
      "start": 2559.259994506836,
      "end": 2561.699981689453,
      "text": " that don't know that heaven is their home."
    },
    {
      "id": 60,
      "start": 2561.699981689453,
      "end": 2564.3799896240234,
      "text": " But should they see the joy?"
    },
    {
      "id": 61,
      "start": 2564.3799896240234,
      "end": 2567.539993286133,
      "text": " Should they see the excitement in my life,"
    },
    {
      "id": 62,
      "start": 2567.539993286133,
      "end": 2570.8999938964844,
      "text": " in his life, in Holly's life when they see us there?"
    },
    {
      "id": 63,
      "start": 2570.8999938964844,
      "end": 2573.779983520508,
      "text": " How about you and the places that you have"
    },
    {
      "id": 64,
      "start": 2573.779983520508,
      "end": 2575.1399841308594,
      "text": " interactions with others?"
    },
    {
      "id": 65,
      "start": 2575.1399841308594,
      "end": 2578.6199951171875,
      "text": " Do they see that there's something different?"
    },
    {
      "id": 66,
      "start": 2578.6199951171875,
      "end": 2580.5799865722656,
      "text": " You have an excitement."
    },
    {
      "id": 67,
      "start": 2580.5799865722656,
      "end": 2582.1399841308594,
      "text": " You know, there's a lot going on in our world,"
    },
    {
      "id": 68,
      "start": 2582.1399841308594,
      "end": 2583.3399810791016,
      "text": " is there not?"
    },
    {
      "id": 69,
      "start": 2583.3399810791016,
      "end": 2586.499984741211,
      "text": " I mean, seriously, strangers"
    },
    {
      "id": 70,
      "start": 2588.219985961914,
      "end": 2590.6199951171875,
      "text": " have approached me and asked me questions"
    },
    {
      "id": 71,
      "start": 2590.6199951171875,
      "end": 2593.5799865722656,
      "text": " about things that are going on right now in our nation."
    },
    {
      "id": 72,
      "start": 2593.5799865722656,
      "end": 2595.019989013672,
      "text": " Man, what do you think about all this stuff?"
    },
    {
      "id": 73,
      "start": 2595.019989013672,
      "end": 2596.0599822998047,
      "text": " We live in Northern Virginia."
    },
    {
      "id": 74,
      "start": 2596.0599822998047,
      "end": 2598.2999877929688,
      "text": " We're gonna be impacted by a lot of these things, right?"
    },
    {
      "id": 75,
      "start": 2598.2999877929688,
      "end": 2599.459991455078,
      "text": " I get it."
    },
    {
      "id": 76,
      "start": 2599.459991455078,
      "end": 2601.219985961914,
      "text": " And can I tell you that,"
    },
    {
      "id": 77,
      "start": 2601.219985961914,
      "end": 2603.0999908447266,
      "text": " this isn't my full statement on this,"
    },
    {
      "id": 78,
      "start": 2603.0999908447266,
      "end": 2604.739990234375,
      "text": " there's a lot of things going on,"
    },
    {
      "id": 79,
      "start": 2604.739990234375,
      "end": 2607.779983520508,
      "text": " but can I tell you that heaven's my home?"
    },
    {
      "id": 80,
      "start": 2609.6599884033203,
      "end": 2612.0599822998047,
      "text": " You know, the economy can just be destroyed,"
    },
    {
      "id": 81,
      "start": 2612.0599822998047,
      "end": 2614.779983520508,
      "text": " the stock market can fall, it has in the past."
    },
    {
      "id": 82,
      "start": 2616.8999938964844,
      "end": 2618.6199951171875,
      "text": " Do you know what the psalmist says?"
    },
    {
      "id": 83,
      "start": 2618.6199951171875,
      "end": 2621.019989013672,
      "text": " My God is very present, help in trouble."
    },
    {
      "id": 84,
      "start": 2621.019989013672,
      "end": 2625.4199829101562,
      "text": " Though the mountains be, I mean, that's catastrophic."
    },
    {
      "id": 85,
      "start": 2625.4199829101562,
      "end": 2628.1399841308594,
      "text": " Listen, no matter what happens, I'm going to heaven."
    },
    {
      "id": 86,
      "start": 2628.1399841308594,
      "end": 2631.3799896240234,
      "text": " On your worst day, on my worst day, I'm going to heaven."
    },
    {
      "id": 87,
      "start": 2632.5799865722656,
      "end": 2637.259994506836,
      "text": " And I wonder this morning, do we have excitement?"
    },
    {
      "id": 88,
      "start": 2638.219985961914,
      "end": 2642.459991455078,
      "text": " Are we living with that joy that heaven is my home?"
    },
    {
      "id": 89,
      "start": 2643.4199829101562,
      "end": 2646.6599884033203,
      "text": " If you're not certain of heaven, we'd love to take a Bible."
    },
    {
      "id": 90,
      "start": 2646.6599884033203,
      "end": 2649.539993286133,
      "text": " In fact, we'll have some folks down here this morning"
    },
    {
      "id": 91,
      "start": 2649.539993286133,
      "end": 2651.499984741211,
      "text": " that they'd take a Bible if you're a lady,"
    },
    {
      "id": 92,
      "start": 2651.499984741211,
      "end": 2652.5799865722656,
      "text": " we'll have a lady talk with you."
    },
    {
      "id": 93,
      "start": 2652.5799865722656,
      "end": 2654.0599822998047,
      "text": " If you're a man, we'll have a man talk with you"
    },
    {
      "id": 94,
      "start": 2654.0599822998047,
      "end": 2655.939987182617,
      "text": " and have a Bible available to show you"
    },
    {
      "id": 95,
      "start": 2655.939987182617,
      "end": 2659.1399841308594,
      "text": " what God says in his word about being saved."
    },
    {
      "id": 96,
      "start": 2659.1399841308594,
      "end": 2662.6199951171875,
      "text": " If you're not sure of heaven, today is the day of salvation."
    },
    {
      "id": 97,
      "start": 2662.6199951171875,
      "end": 2665.0999755859375,
      "text": " But for those of us that know Christ as our savior,"
    },
    {
      "id": 98,
      "start": 2665.0999755859375,
      "end": 2666.8999938964844,
      "text": " live with joy, live with excitement,"
    },
    {
      "id": 99,
      "start": 2666.8999938964844,
      "end": 2670.6199951171875,
      "text": " and have a burden to tell somebody else"
    },
    {
      "id": 100,
      "start": 2670.6199951171875,
      "end": 2674.0599975585938,
      "text": " that they too can be saved by the grace of God."
    },
    {
      "id": 101,
      "start": 2674.0599975585938,
      "end": 2674.8999938964844,
      "text": " Let's pray together."
    },
    {
      "id": 102,
      "start": 2674.8999938964844,
      "end": 2677.6199951171875,
      "text": " Father, how we love you this morning."
    },
    {
      "id": 103,
      "start": 2677.6199951171875,
      "end": 2679.220001220703,
      "text": " We thank you so much for loving us."
    },
    {
      "id": 104,
      "start": 2679.220001220703,
      "end": 2682.8599853515625,
      "text": " We thank you for your word, for the truth of your word."
    },
    {
      "id": 105,
      "start": 2682.8599853515625,
      "end": 2685.2999877929688,
      "text": " We thank you for who you are."
    },
    {
      "id": 106,
      "start": 2685.2999877929688,
      "end": 2688.699981689453,
      "text": " We thank you for the plan of salvation."
    },
    {
      "id": 107,
      "start": 2688.699981689453,
      "end": 2691.4199829101562,
      "text": " We thank you for the gift of God, which is eternal life."
    },
    {
      "id": 108,
      "start": 2691.4199829101562,
      "end": 2693.1399841308594,
      "text": " And Father, if there's one here this morning"
    },
    {
      "id": 109,
      "start": 2693.1399841308594,
      "end": 2694.8999938964844,
      "text": " that's not sure of heaven,"
    },
    {
      "id": 110,
      "start": 2694.8999938964844,
      "end": 2696.3399963378906,
      "text": " oh, it's our prayer that today"
    },
    {
      "id": 111,
      "start": 2696.3399963378906,
      "end": 2697.6199951171875,
      "text": " would be the day of their salvation,"
    },
    {
      "id": 112,
      "start": 2697.6199951171875,
      "end": 2698.9400024414062,
      "text": " that we could take a Bible and show them"
    },
    {
      "id": 113,
      "start": 2698.9400024414062,
      "end": 2701.6199951171875,
      "text": " how they could know for sure that heaven's their home."
    },
    {
      "id": 114,
      "start": 2701.6199951171875,
      "end": 2703.5399780273438,
      "text": " I pray for every Christian here this morning."
    },
    {
      "id": 115,
      "start": 2703.5399780273438,
      "end": 2706.2999877929688,
      "text": " God, would you stir us?"
    },
    {
      "id": 116,
      "start": 2706.2999877929688,
      "end": 2708.779998779297,
      "text": " God, would you help us to have a burden to reach others?"
    },
    {
      "id": 117,
      "start": 2708.779998779297,
      "end": 2713.739990234375,
      "text": " Would you help us to live every day with excitement and joy?"
    },
    {
      "id": 118,
      "start": 2713.739990234375,
      "end": 2715.4199829101562,
      "text": " Because this expectation,"
    },
    {
      "id": 119,
      "start": 2717.459991455078,
      "end": 2720.699981689453,
      "text": " that which we know to be absent from the body"
    },
    {
      "id": 120,
      "start": 2720.699981689453,
      "end": 2723.3799743652344,
      "text": " is to be present with the Lord."
    },
    {
      "id": 121,
      "start": 2723.3799743652344,
      "end": 2726.0599975585938,
      "text": " We ask that you'd move and work as only you can,"
    },
    {
      "id": 122,
      "start": 2726.0599975585938,
      "end": 2727.2999877929688,
      "text": " and we'll thank you for it."
    },
    {
      "id": 123,
      "start": 2727.2999877929688,
      "end": 2728.3799743652344,
      "text": " In Christ's name we pray."
    },
    {
      "id": 124,
      "start": 2728.3799743652344,
      "end": 2729.6199951171875,
      "text": " Would you stand with me?"
    },
    {
      "id": 125,
      "start": 2729.6199951171875,
      "end": 2730.8599853515625,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 126,
      "start": 2730.8599853515625,
      "end": 2731.699981689453,
      "text": " No one's looking around."
    },
    {
      "id": 127,
      "start": 2731.699981689453,
      "end": 2733.6599731445312,
      "text": " We have an invitation at the end of each of our services"
    },
    {
      "id": 128,
      "start": 2733.6599731445312,
      "end": 2735.5399780273438,
      "text": " for the purpose of allowing people"
    },
    {
      "id": 129,
      "start": 2735.5399780273438,
      "end": 2738.220001220703,
      "text": " to respond to the message."
    },
    {
      "id": 130,
      "start": 2738.220001220703,
      "end": 2739.6599731445312,
      "text": " Mark is down here this morning."
    },
    {
      "id": 131,
      "start": 2739.6599731445312,
      "end": 2740.8599853515625,
      "text": " Holly's down here this morning."
    },
    {
      "id": 132,
      "start": 2740.8599853515625,
      "end": 2742.0999755859375,
      "text": " If you're a lady, you don't know for sure"
    },
    {
      "id": 133,
      "start": 2742.0999755859375,
      "end": 2743.259979248047,
      "text": " that heaven's your home,"
    },
    {
      "id": 134,
      "start": 2743.259979248047,
      "end": 2744.220001220703,
      "text": " we'd invite you to come."
    },
    {
      "id": 135,
      "start": 2744.220001220703,
      "end": 2746.0599975585938,
      "text": " We'd never embarrass you,"
    },
    {
      "id": 136,
      "start": 2746.0599975585938,
      "end": 2747.6199951171875,
      "text": " but Holly would meet with you and share with you"
    },
    {
      "id": 137,
      "start": 2747.6199951171875,
      "end": 2748.5,
      "text": " what the Bible says."
    },
    {
      "id": 138,
      "start": 2748.5,
      "end": 2750.8999938964844,
      "text": " Mark, if you're a man, he'll meet with you."
    },
    {
      "id": 139,
      "start": 2750.8999938964844,
      "end": 2752.6599731445312,
      "text": " Maybe you just want to come and pray."
    },
    {
      "id": 140,
      "start": 2752.6599731445312,
      "end": 2753.5,
      "text": " You don't want to thank God"
    },
    {
      "id": 141,
      "start": 2753.5,
      "end": 2754.8999938964844,
      "text": " for the salvation that he's given you."
    },
    {
      "id": 142,
      "start": 2754.8999938964844,
      "end": 2755.779998779297,
      "text": " Maybe you want to come,"
    },
    {
      "id": 143,
      "start": 2755.779998779297,
      "end": 2757.8199768066406,
      "text": " there's a burden on your heart for someone"
    },
    {
      "id": 144,
      "start": 2757.8199768066406,
      "end": 2758.9400024414062,
      "text": " that needs to be saved,"
    },
    {
      "id": 145,
      "start": 2758.9400024414062,
      "end": 2761.5799865722656,
      "text": " and you want to pray that God gives you that opportunity,"
    },
    {
      "id": 146,
      "start": 2761.5799865722656,
      "end": 2762.4199829101562,
      "text": " that you would live."
    },
    {
      "id": 147,
      "start": 2762.4199829101562,
      "end": 2763.8599853515625,
      "text": " Maybe you acknowledge in your life"
    },
    {
      "id": 148,
      "start": 2763.8599853515625,
      "end": 2765.8599853515625,
      "text": " that you've been living under the circumstances"
    },
    {
      "id": 149,
      "start": 2765.8599853515625,
      "end": 2768.1399841308594,
      "text": " without that eternal perspective."
    },
    {
      "id": 150,
      "start": 2768.1399841308594,
      "end": 2770.8199768066406,
      "text": " The altar is open, as Kimberly plays."
    },
    {
      "id": 151,
      "start": 2770.8199768066406,
      "end": 2777.8999938964844,
      "text": " ♪♪"
    }
  ],
  "processed_at": "2025-04-14T19:35:01.555361"
}