{
  "video_id": "KnZFjfOQSr4",
  "text": "number 3 and be looking at verses 7 down through verse number 13 and Revelation chapter 3 tonight verses 7 through 13. The church in Philadelphia the sixth church that is addressed here in the book of Revelation was located in this city, the city of Philadelphia. It was located about 38 miles southeast of Sardis and of course that was the subject in which we studied a couple of Sunday nights ago there in verses 1 through 6 of chapter number 3 and the name Philadelphia, who knows what it means? Yeah, city of brotherly love. Not shove, if you're there it seems like it's the brother of shove, right? The brotherly shove. But it's the brotherly love and it's the same as our Philadelphia up in Pennsylvania just a few hours from here and that's what the name means. The city was intended to play an important role or part in spreading the Greek language culture in manners throughout Asia Minor, modern-day Turkey where this church was located. We mentioned back several weeks ago in chapter number 2 when we looked in the church in Smyrna we said this of the church in Smyrna that it was known as the poor rich church. Why did we say that? Well in verse number 9 of Revelation 2 the Bible says I know thy works in tribulation and poverty thy poverty but thou art rich and so we said that the church in Smyrna was known as the poor rich church. From many's perspective they had great poverty, God mentions that in the letter but they were rich and I mentioned this when we studied through that portion of scripture just to understand that we are rich in Christ. Think about the memory verse for this month, 2nd Corinthians 8 and verse 9. He left the throne room of heaven, right? He became poor so that we might be rich and what a blessing to understand what we have in Christ. You know that you have in Christ what money cannot buy. Amen? And what a blessing. And we come to this church in Philadelphia in Revelation chapter 3 and verses 7 through 13 and we could refer to this church as being the weak strong church and why would we say that? Well notice in verse 7 it says unto the angel of the church in Philadelphia write these things saith he that is holy, he that is true, he that hath the key of David he that openeth and no man shutteth and shutteth and no man openeth. Verse 8, I know thy works behold I have set before thee an open door and no man can shut it. Notice this for thou hast a little strength and has kept my word and has not denied my name. It would seem and as you study various portions of history that the church was not an extremely large church in number but I'm thankful that though they might have little strength physically or numerically that they had the power of God resting upon them as you study through this portion of scripture you find that this church like the church in Smyrna in fact the only two churches of the seven that are addressed here in Revelation we find that there are no corrections that are given to the church in Philadelphia and what a blessing to think about that. We mentioned as we've studied through these seven churches at this point number six but as we've studied on the churches that are being addressed in Revelations two and three and we find that in these two chapters these churches that are addressed that are local churches but we find that the Lord Jesus Christ who is the head of the church is writing to them and really if we could call it an evaluation, an examination and we've tried to say this and to be mindful of this truth throughout each of the studies here on Sunday nights of these churches they each end with the statement he that hath an ear let him hear what the Spirit saith unto the churches plural and the reality is that we need to have ears to hear and we need to apply truth in our lives and we need to understand this evening that just as these local churches were being evaluated by the Lord Jesus Christ who is the head of the church that the Lord it's still his church and he evaluates and by the way his evaluation is correct and there are times in which we looked at some of these and you look at Ephesus and say no no we've not left our first love no no Jesus Christ said you left your first love so guess what? It's true. They left their first love. His evaluation is true. In fact next week actually we have a missionary next week but in two weeks when we look at the church of the Laodiceans as it's called in verse number 14 though they had a perspective of their particular situation they they were wrong on their perspective. They said but then God said. We'll look at that in a couple of weeks and so as we look at this church in Philadelphia there's some things that we learned that are important for us to to consider as we look at this local church but then obviously looking at our own lives and yes we ought to examine and evaluate ourselves personally individually then corporately as a church and understand that the Lord Jesus Christ is evaluating his church. I wanna have in my life personally and in our church corporately I want God's favor upon our lives. Don't you want God's favor? In my life personally and in our church corporately I want God's blessing. I want God's favor. I wanna be in a place where God is pleased with us. That God is pleased to add people, to bring people, to know that we will be faithful to preach his word and to to carry the truth of the gospel. I want to be a church that pleases the Lord. We find that here the church in Philadelphia if you're taking notes number one Christ reminds them. Christ reminds them. Don't you notice a few things in verses seven and eight that the Lord reminds this church of and by the way there are times in which we need to be reminded. We're prone to forget. It's not maybe that we've forgotten entirely but we just need to be reminded of something brought to the forefront of our attention. In fact Peter says that he was gonna stir up the people by putting them in remembrance. He says though you know these things I'm gonna stir you up by putting you in remembrance of these things and so the Lord reminds the church really of five things in these first couple of verses, verse seven and eight. Number one he reminds them, notice, these things saith he that is holy. He that is holy. You know what God reminds the church in Philadelphia? He reminds them that he's holy. Can I tell you this evening we need to be reminded that our God is holy. He's holy. I was thanking the Lord this morning. You know the psalmist talks about that we're to give thanks at the remembrance of his holiness. I was thanking God this morning. I was sitting right there early this morning before the service. I was thanking God that he's holy. He says to his people not only in the Old Testament but again in the New Testament that we're to be holy. Why? Because he is holy. I think about Isaiah when he sees the Lord high holy and lifted up and he sees in Isaiah chapter number six and the angels are there, holy, holy, holy. In just a few verses of scripture we get into the fourth chapter. You get into the scene room of heaven and you see holy, holy, holy. You know as a church we need to be reminded that our God is holy. He's holy. He's not becoming holy, he is holy. We find this evening that he first reminds them that he's holy, second he reminds them, notice it says into the angel of the church in Philadelphia, right, these things saith he that is holy and that is true. Jesus Christ said I am the way, the truth, and the life. He has a name, you read Revelation 19, truth, and you begin to think about the fact that he is true. Let God be true and let every man be a liar, right? Our God cannot lie. Titus chapter number one talking about the hope of eternal life that God who cannot lie has promised to us. He is true. He is truth. This evening we must be reminded as the church in Philadelphia is reminded that our God is true. Listen, we have so many things that are bombarding us this evening in the world in which we live. Someone, and not to point it out in being a negative way, but someone asked a question about how things are in a certain part and they said that AI was providing an answer. How many of you have gone on Google recently and the first answers are AI generated? It's what's happening, right? Do you know that that's not always true? Do you know how the algorithms work? I don't know, I'm not real deep into it, but algorithms on Google searches, etc. work different than what you might think. Have you ever heard somebody say, well I saw it on the Internet? You know, I'm amazed. You know it used to be that if you showed somebody a picture that was evidence of something that truly happened, right? It's not true anymore. You know how easy it is to manipulate pictures today? They advertise, they market phones and one of the points of marketing the phone is on the ability to edit a photo immediately. You can see a parent throwing a child up in the air and it's only, you know, 14, 18 inches away and then all of a sudden the picture shows the kid like five feet in the air. No, no, no, no. That's not true. It didn't happen. But our God is true. Everything that you read in this Bible. is true. God has given us a pure, true record and He is truth. You remember Pilate? What is truth? Truth was standing before him and unfortunately he didn't stick around long enough to get an answer to the question that he posed. He says to the church, I'm holy, I'm true. Notice, he reminds them that he is king. He says, he that hath the key of David. You know, think about the Davidic covenant. You begin to think about the role that Christ will play as king of kings, lord of lords during the millennial reign. He is the rightful heir to the throne and he will rule and reign. He is king. He then says this in verse number 7. Notice, it says, he that openeth and no man shutteth and shutteth and no man openeth. The authority that our God has. You know, he has all authority. He has all power and all authority. Begin to think about that this evening in these reminders. There's one more that we'll look at in verse number 8. We begin to think about the authority that our God has. He says that he openeth and no man shutteth and he shutteth and no man openeth. What a great way to describe the authority that he has. We come to verse number 8. He says, I know thy works. Isn't that a phrase that we've read to each of these churches? It reminds us of the fifth truth that we find in these couple of verses of scripture. What does Christ remind them of? It reminds them that he's omniscient. I know thy works. You know, he knows everything about you. He knows everything about me. He knows everything about us. He knows why we do the things that we do. He knows the motives and all of it. He knows your heart. He knows your thoughts. He's omniscient. We begin to think about these truths that are given to us in verse 7 and 8 of what Christ reminds this church of that he's holy and true and that he's king and that he has all authority and that he's omniscient. Listen, this ought to cause us to rejoice. Why? Because that's my savior. That's the head of the church. When he is all of these things, then he reminds his people, we're not serving some man. We're not serving some dead little G-O-D. No, we're serving the living God who is holy and true and he has all power and authority. He is king and he is omniscient. It ought to cause us to rejoice because we know who he is. And here, as he begins addressing the church in Philadelphia, he reminds them of these truths. Listen, there are times in which we go through life and we face a difficulty. We face some uncertainty and we may be led to think that God doesn't understand or that God doesn't know or that God doesn't… No, he is very aware of what we're dealing with. He has a purpose and he has a plan and we trust him and we serve him and we find that it's his church. He is the head of the church. He reminds them. Number two, I would say this tonight in verse number eight, Christ commends them. He commends them. Notice immediately in verse number eight, he commends them for their work. He says, I know thy works. They were serving the Lord. They were involved in doing what God had called them to do. They were faithful. We'll look at that in just a moment, but I want you to notice this in verse number eight. He says, I know thy works. Behold, notice I have set before thee an open door and no man can shut it. I want you to think about that just for a moment. It's a little bit different than what he said in verse seven. In speaking of the authority in verse seven, he says, he that openeth and no man shutteth and shutteth and no man openeth. And that's a general truth, a statement that is given. But in verse number eight, while speaking to this church in Philadelphia, he says, I have set before thee an open door and no man can shut it. You think about an open door. You think about the picture Paul talks about that there's an open door, but there are many adversaries, right? But you begin to think about this open door. If I could use a phrase this evening to help us kind of maybe understand it, it's an opportunity. The open door is an opportunity. And the Lord Jesus Christ, the one who reminds them of who he is and he reveals all this truth and exposes them to then this truth as he commends them, that I've given to you an opportunity. Can I say to you this evening that God has given to his church an opportunity. Can I tell you this evening that we don't serve the Lord, we don't do what we do because we have a United States Constitution or a Bill of Rights or – no, no, we do what we do because we have a Bible and we serve the Lord that's omnipotent, that has given to us an open door. Listen, I'm thankful for the freedoms and the liberties and the rights that we have in America, but can I tell you that if those rights are removed, if those rights do not exist, the truth of this book stands. There are believers, there are folks on that missions map that we send dollars to and we pray for that are in places around the world that do not have the freedoms and liberties that we do. Yet God says I have given you an opportunity. I've opened a door that no man can shut. You know what's interesting about opportunities? They don't last forever. What's interesting about opportunities? Many times it's easier to see them on the other side after we've missed them. You say, man, I missed an opportunity. God's given to us as a local church, Fellowship Baptist Church, he's given to us an opportunity, an open door, an opportunity to reach a region. I've often said as people have asked me, and in fact I was sharing with somebody this afternoon after the service about some ministry things in Northern Virginia and folks that have never ministered here don't fully comprehend what this region is like, but I've often said this, you know, the reality is that God has put the world in our backyard. Literally. We have the opportunity to reach people in this region of the world that can go back to whatever country it is and go as missionaries and they know languages and cultures and it's absolutely amazing the opportunities that God has given to us. We better seize the opportunities. We better take advantage of the time that God has given to us and Christ commends them for their works and he reminds them that he's opened a door for them. He has given to them an opportunity. I find that he also commends them for their faithfulness and for their obedience. Notice it says in verse number 8, the end of the verse, For thou hast a little strength, and hast kept my word, and hast not denied my name. Again in verse number 10, this is because thou hast kept the word of my patience. Begin to think about the faithfulness and the obedience of this church and it is referenced that thou hast kept my word. Listen, God requires in us to be faithful. To be faithful. To be obedient. Trust and obey. We sing the song. And I'm thankful this evening, moreover it's required in Stuart's that a man be found faithful. God has entrusted to us and then he expects of us faithfulness. How many of you this evening, don't raise your hand, but how many of you this evening are thankful that God is faithful? God is faithful. Amen? And I'm thankful this evening that his faithfulness doesn't vary based on my faithfulness. He's faithful. But the reality is that we ought to desire to be faithful. To be faithful. Great is thy faithfulness. We sing the song. It's a favorite of many. Faithful is he that calleth you who also will do it. 1 Thessalonians 5 and verse 24. God is faithful. And then he expects of us that we too would be faithful. Notice he commends them for their testimony. It says at the end of verse number 8, And hast not denied my name. You know, our testimony matters. Our testimony matters. There are times in which we're pressed. There are times in which we're faced with difficulties and maybe we're surrounded by a number. We feel like we're in the minority and I mean maybe like all alone. Maybe we sometimes have the Elijah syndrome. Everyone else has bowed but not me and God of course says no, no, no Elijah you're not accurate on that. But there are times when we feel that way. But here he says thou hast not denied my name. They had a good testimony. This evening our testimony matters. It really does. A good name is rather to be chosen. Right? Great riches. Think about the testimony this evening. How's our testimony? You know the testimony of a church? The testimony of individuals that are within the church? I don't ever want to be in a position where someone's like, oh you go to that church? But you know there have been times that I've heard that kind of statement. Why? Because all of a sudden that church has a bad testimony in a community. I'd have read a church. church in another state that's looking for a pastor. In fact, there are churches all over looking for pastors. It's a sad, sad day in our churches. It really is all over the place. I hear about them all the time. A church in another state, the person that was telling me about it said, you know, it's going to be a really difficult thing. And I said, you know, explain that to me. What do you mean it's going to be a difficult thing? Well, the pastor's in jail for murder. And so the church has a really bad testimony. And I thought, I guess it does. Like, you got to be kidding me. And they asked me, what would you do? I have no idea. Like, close it down, change the name, do something, right? Because the testimony of that church in that community is tarnished. It's tarnished. He says, thou hast kept, thou hast not, excuse me, denied my name. Thou hast kept my word and hast not denied my name. And number three, Christ comforts them. In verses 9-12, we find not only these reminders and the way that Christ commends them, but now He comforts them. By the way, aren't you thankful that our God is the God of all comfort? He comforted us in all of our tribulation. We read that. The Holy Spirit, one of the names ascribed to the Holy Spirit is Comforter. And we find that Christ begins to comfort them. Notice in verse number 9, behold, I will make them of the synagogue of Satan, which say they are Jews and are not, but do lie. Behold, I will make them to come and worship before thy feet and to know that I have loved thee. Aren't you thankful that God loves us? I'm thankful for the security, for the comfort that He gives. We could say in verse number 9 that victory is certain. Listen, there were some difficulties that they were dealing with, with this group of people that is mentioned, and we find that God is going to work on the behalf. He's going to deal with it, and He says that they're going to know that I have loved thee. Victory is certain. Listen, we're on the winning side. Heaven, I preached about heaven this morning. I mean, we're going to heaven. We are victorious. We are more than conquerors through Christ. But thanks be to God which giveth us the victory through our Lord Jesus Christ, and this evening we are on the winning side. Victory is certain. We find that in verse number 10 there's this comfort of deliverance in the hour of temptation. Listen, verse 10, because thou has kept the word of my patience, I also will keep thee from the hour of temptation which shall come upon all the world to try them that dwell upon the earth. By the way, a great truth with regard to dealing with the pre-tribulational rapture, the fact that you look at what's going to happen as you enter into chapter 6 and all of the situation with the tribulation and so on and so forth, and we find that He speaks about deliverance from what? From the hour of temptation which shall come upon all the world for what purpose? To try them that dwell upon the earth. We begin to think about the deliverance. We begin to read in 1 and 2 Thessalonians and comparing Scripture with Scripture, and we'll get to it in greater detail as we get into chapter 4 and then again into chapter number 6. We begin to look at all of these wonderful truths and look at the promises that God has given to us, this truth of deliverance. The rewards that are mentioned in verse number 11, behold I come quickly, hold that fast which thou hast that no man take thy crown. We find that the Scriptures teach us about rewards. In fact, we read of them in the fourth chapter and how we will take and we will cast those crowns before the throne and what we will say, thou art worthy O Lord. We find that the truth of eternity is at stake or in clear view in verse number 12, him that overcometh will I make a pillar in the temple of my God and he shall go no more out and I will write upon him the name of my God and the name of the city of my God which is New Jerusalem which cometh down out of heaven from my God and I will write upon him my new name. He talks about what he's going to do for them, these comforts that God is giving to these individual believers that make up this church in Philadelphia. This evening, I'm thankful for the promises that God has given to us and the promises bring comfort. The revelation that God has given to us enables us to be comforted. We think about what he says to the church in Smyrna in chapter 2 in verse number 10, be thou faithful unto death and I will give thee a crown of life. I think about Paul as he writes in 2 Timothy chapter 4 knowing that his day of departure is at hand but he recognizes that there's a crown of righteousness that the Lord, the faithful judge is going to give him but not only him, he says all of those that love is appearing and these are comforting truths. We find that a church that's here in Philadelphia, this church is given these reminders and then it's commended and then God gives them these words of comfort. By the way, I'm thankful for what we read at the end of the passage of scripture in 1 Thessalonians chapter 4 and comfort one another with these words. You know God's words bring comfort. They really do. God brings comfort. He is the comforter. We find that his word brings comfort. Then I want you to notice finally this evening number 4, Christ counsels them. He counsels them. We think about counsel. Counsel is good. I mentioned this last week or two weeks ago when we looked at, I don't remember did I preach it last week or the week before, I guess it was two weeks ago and we noted the counsel there for the church in Sardis and by the way it was harsh counsel that was given but I said this that counsel is given and counsel is productive and it's profitable so long as we take heed to it. There have been plenty of times in your life and I know plenty of times in my life that I've given counsel to someone and they let it go in one ear and out the other and there are times that I'm guilty of doing the same thing when counsel is given. But God here gives counsel to the church and I believe that it's important for us also to note this counsel and to take heed to the counsel. First we find that he counsels them with regard to his return. In verse number 11 he says, behold I come quickly. You know that ought to give us some instruction. It ought to give us some consideration this evening with regard to how we live our lives, what we're doing and how we're redeeming the time that God has given to us. Of course no man knoweth the hour. We don't know when he's going to return but we find that he says to this church, I come quickly and we find that as we read the end of the book of Revelation that he says he's going to come quickly and we can look and we understand that 2 Peter says that the scoffers have said where is the time of his appearing? We find that a day is a thousand years, a thousand years is a day. God's right on time and he's going to come back. I don't know when but we know that he is. The counsel that he gives to this church is to expect his return. And by the way I believe that as you read the book of Acts I believe that so much happened in the first century through the people of God as the gospel went forth because they lived expecting his return. It was on their mind. Why? Well because the disciples stood there and watched him ascend up into heaven and heard that this same Jesus shall so come in like manner. Go get busy doing what he told you to do and here this evening we too have the reminder that Christ is coming back. We find that also in verse number 11 we have the responsibility, the counsel is for them to remain steadfast. Hold that fast which thou hast. To remain steadfast. We find that there are many that change, many that are trying to find something new, something different, becoming more relevant and so on and so forth but the reality is that God says to this church hold that fast which thou hast. Sometimes a church can try to be so relevant to its community that it becomes irrelevant to God. Read in the Old Testament, Ichabod. What's it mean? The glory of the Lord hath departed. We find this evening that he says hold that fast which thou hast. You know we've been given truth. We find that Paul gives to Timothy, 2 Timothy 2 and verse number 2 this charge to commit to teach faithful men to teach them what? The things that thou hast heard of me among many witnesses the same. Commit thou to faithful men who shall be able to teach others also. We find that we read in the book of Jude just one chapter in just a really a short letter but we find that the Bible says that it was needful in verse number 3 that Jude says it was needful for me to write unto you and exhort you that you should earnestly contend for the faith which was once delivered unto the saints. I'm so thankful for the purity of doctrine. I'm thankful for the truth that we have.\" And he tells the church to remain steadfast, to hold that fast which thou hast. I'm not looking for any new revelation. Canon of Scripture is closed. Amen? We interpret everything through this book. We take heed to this book. We hold fast to what God has given to us and we faithfully preach. What did Paul tell Timothy in 2 Timothy 4? Preach the word. The time is going to come when men will not endure sound doctrine, he goes on to say in the same text of Scripture, but it did not change the charge. The charge is given and then the reality of the people not enduring it is given as well, but the charge remains. Remain steadfast. Therefore, my beloved brethren, be steadfast, unmovable, always abounding in the work of the Lord. Why? For as much as you know that your labor is not in vain in the Lord. 1 Corinthians chapter 15 and verse number 58 I believe it is. And what a blessing to think about the charge that's been given to us. This counsel. Expect his return. Remain steadfast and then we find in verse number 13 this truth that's given to every church that's written to in the book of Revelation. Listen and take heed. The believers in Philadelphia were doing well. They're doing well. They're not corrected at all. They're reminded of some things. They're commended. They're comforted. They're counseled. And we find that the church in Philadelphia, they're doing well, but they too could learn and should learn from the letters written to the other churches. Much can change in just one generation. Much can change in just one generation. And it's important for a church that's doing what they're supposed to do to have that listen and take heed and to be sure that we're going to protect and seek to please and honor our Lord so that we don't get out of balance one way or the other. And though the church was doing well, they could not relax. They couldn't just say, you know, we can kind of coast now. Because we weren't really corrected for anything and so we can just kind of lay back and take it easy. No. No. They had to hear. I'm thankful that God's given to us counsel, warnings, instructions. This evening the church in Philadelphia is a good church. This evening the church is reminded of some things. I hope that we would take heed, that we too would be reminded of what God, the Lord Jesus Christ, the head of the church, says to this church about who he is, his person. That we'd be reminded that we serve God of the universe. The one who is holy, the one that is true, the one who has all power, that knows all things, he is king. That's the head of the church. And I'm so thankful for that. This evening he's called us to remain faithful. He's called us to do his work, to hold fast, to maintain a testimony that's pleasing and honoring to him. He'll comfort us in a time of our difficulty. He reminds us of eternity. He reminds us of victory. This evening those are good reminders for us. Oh, that we would have that desire to be a church that has God's favor, that God's hand of blessing is upon us corporately. It only happens if individually we have God's hand upon us. Brother Jeff mentioned the verse this morning, talking about a recap from last week, a little leaven leaveneth the whole lump. I went last week to the book of Joshua in the seventh chapter. There was sin in the camp. It was really just one man, Achan. Because of sin in the camp, God's hand of blessing was being pulled back. What did God say? Unless you deal with it, I'm not going to fight for you anymore. You've got to deal with it. So Joshua made the right choice. He followed the leadership of God. And they dealt with Achan the troubler of Israel. And then God's hand of favor and blessing was upon them again. Oh, that we would live our lives in such a way that God would be pleased, that God's favor would be upon us. Let's pray. Father, we love you.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.559999942779541,
      "text": " number 3 and be looking at verses 7 down through verse number 13"
    },
    {
      "id": 1,
      "start": 4.559999942779541,
      "end": 8.84000015258789,
      "text": " and Revelation chapter 3 tonight verses 7 through 13. The church in"
    },
    {
      "id": 2,
      "start": 8.84000015258789,
      "end": 9.920000076293945,
      "text": " Philadelphia"
    },
    {
      "id": 3,
      "start": 9.920000076293945,
      "end": 13.880000114440918,
      "text": " the sixth church that is addressed here in the book of Revelation was located in"
    },
    {
      "id": 4,
      "start": 13.880000114440918,
      "end": 15.760000228881836,
      "text": " this city, the city of Philadelphia."
    },
    {
      "id": 5,
      "start": 15.760000228881836,
      "end": 20.399999618530273,
      "text": " It was located about 38 miles southeast of Sardis and of course that was"
    },
    {
      "id": 6,
      "start": 20.399999618530273,
      "end": 24.0,
      "text": " the subject in which we studied a couple of Sunday nights ago"
    },
    {
      "id": 7,
      "start": 24.0,
      "end": 27.200000762939453,
      "text": " there in verses 1 through 6 of chapter number 3"
    },
    {
      "id": 8,
      "start": 27.200000762939453,
      "end": 30.600000381469727,
      "text": " and the name Philadelphia, who knows what it means?"
    },
    {
      "id": 9,
      "start": 30.600000381469727,
      "end": 34.31999969482422,
      "text": " Yeah, city of brotherly love."
    },
    {
      "id": 10,
      "start": 34.31999969482422,
      "end": 38.279998779296875,
      "text": " Not shove, if you're there it seems like it's the brother of shove, right? The"
    },
    {
      "id": 11,
      "start": 38.279998779296875,
      "end": 39.2400016784668,
      "text": " brotherly shove."
    },
    {
      "id": 12,
      "start": 39.2400016784668,
      "end": 42.279998779296875,
      "text": " But it's the brotherly love and it's the same"
    },
    {
      "id": 13,
      "start": 42.279998779296875,
      "end": 46.20000076293945,
      "text": " as our Philadelphia up in Pennsylvania just a few hours from here"
    },
    {
      "id": 14,
      "start": 46.20000076293945,
      "end": 51.0,
      "text": " and that's what the name means. The city was intended to play an important role"
    },
    {
      "id": 15,
      "start": 51.0,
      "end": 52.0,
      "text": " or part"
    },
    {
      "id": 16,
      "start": 52.0,
      "end": 56.400001525878906,
      "text": " in spreading the Greek language culture in manners throughout"
    },
    {
      "id": 17,
      "start": 56.400001525878906,
      "end": 61.119998931884766,
      "text": " Asia Minor, modern-day Turkey where this church was located."
    },
    {
      "id": 18,
      "start": 61.119998931884766,
      "end": 65.31999969482422,
      "text": " We mentioned back several weeks ago in chapter number 2 when we looked in the"
    },
    {
      "id": 19,
      "start": 65.31999969482422,
      "end": 66.76000213623047,
      "text": " church in Smyrna"
    },
    {
      "id": 20,
      "start": 66.76000213623047,
      "end": 71.16000366210938,
      "text": " we said this of the church in Smyrna that it was known as the"
    },
    {
      "id": 21,
      "start": 71.16000366210938,
      "end": 76.72000122070312,
      "text": " poor rich church. Why did we say that? Well in verse number 9 of Revelation 2"
    },
    {
      "id": 22,
      "start": 76.72000122070312,
      "end": 80.4800033569336,
      "text": " the Bible says I know thy works in tribulation and poverty"
    },
    {
      "id": 23,
      "start": 80.4800033569336,
      "end": 86.08000183105469,
      "text": " thy poverty but thou art rich and so we said that the church in Smyrna was known"
    },
    {
      "id": 24,
      "start": 86.12000274658203,
      "end": 87.55999755859375,
      "text": " as the poor"
    },
    {
      "id": 25,
      "start": 87.55999755859375,
      "end": 93.80000305175781,
      "text": " rich church. From many's perspective they had great poverty, God mentions that in"
    },
    {
      "id": 26,
      "start": 93.80000305175781,
      "end": 94.36000061035156,
      "text": " the letter"
    },
    {
      "id": 27,
      "start": 94.36000061035156,
      "end": 97.68000030517578,
      "text": " but they were rich and I mentioned this when we studied through that portion of"
    },
    {
      "id": 28,
      "start": 97.68000030517578,
      "end": 98.44000244140625,
      "text": " scripture"
    },
    {
      "id": 29,
      "start": 98.44000244140625,
      "end": 102.31999969482422,
      "text": " just to understand that we are rich in Christ. Think about the memory verse for"
    },
    {
      "id": 30,
      "start": 102.31999969482422,
      "end": 104.4800033569336,
      "text": " this month, 2nd Corinthians 8 and verse 9."
    },
    {
      "id": 31,
      "start": 104.4800033569336,
      "end": 109.63999938964844,
      "text": " He left the throne room of heaven, right? He became poor"
    },
    {
      "id": 32,
      "start": 109.63999938964844,
      "end": 114.95999908447266,
      "text": " so that we might be rich and what a blessing to understand what we have in"
    },
    {
      "id": 33,
      "start": 114.95999908447266,
      "end": 118.23999786376953,
      "text": " Christ. You know that you have in Christ what money cannot buy."
    },
    {
      "id": 34,
      "start": 118.23999786376953,
      "end": 121.27999877929688,
      "text": " Amen? And what a blessing."
    },
    {
      "id": 35,
      "start": 121.27999877929688,
      "end": 124.87999725341797,
      "text": " And we come to this church in Philadelphia in Revelation chapter 3"
    },
    {
      "id": 36,
      "start": 124.87999725341797,
      "end": 126.55999755859375,
      "text": " and verses 7 through 13"
    },
    {
      "id": 37,
      "start": 126.55999755859375,
      "end": 130.1999969482422,
      "text": " and we could refer to this church as being the weak"
    },
    {
      "id": 38,
      "start": 130.1999969482422,
      "end": 135.16000366210938,
      "text": " strong church and why would we say that? Well notice in verse 7 it says unto the"
    },
    {
      "id": 39,
      "start": 135.16000366210938,
      "end": 137.8800048828125,
      "text": " angel of the church in Philadelphia write"
    },
    {
      "id": 40,
      "start": 137.8800048828125,
      "end": 142.8800048828125,
      "text": " these things saith he that is holy, he that is true, he that hath the key of David"
    },
    {
      "id": 41,
      "start": 142.9199981689453,
      "end": 147.63999938964844,
      "text": " he that openeth and no man shutteth and shutteth and no man openeth. Verse 8, I know thy"
    },
    {
      "id": 42,
      "start": 147.63999938964844,
      "end": 148.60000610351562,
      "text": " works"
    },
    {
      "id": 43,
      "start": 148.60000610351562,
      "end": 153.0,
      "text": " behold I have set before thee an open door and no man can shut it. Notice this"
    },
    {
      "id": 44,
      "start": 153.0,
      "end": 158.36000061035156,
      "text": " for thou hast a little strength and has kept my word and has not denied"
    },
    {
      "id": 45,
      "start": 158.36000061035156,
      "end": 162.67999267578125,
      "text": " my name. It would seem and as you study various portions of"
    },
    {
      "id": 46,
      "start": 162.67999267578125,
      "end": 165.9600067138672,
      "text": " history that the church was not an extremely large"
    },
    {
      "id": 47,
      "start": 165.9600067138672,
      "end": 170.44000244140625,
      "text": " church in number but I'm thankful that though they might have little strength"
    },
    {
      "id": 48,
      "start": 170.44000244140625,
      "end": 172.32000732421875,
      "text": " physically or numerically"
    },
    {
      "id": 49,
      "start": 172.8000030517578,
      "end": 177.0800018310547,
      "text": " that they had the power of God resting upon them as you study through this"
    },
    {
      "id": 50,
      "start": 177.0800018310547,
      "end": 178.55999755859375,
      "text": " portion of scripture"
    },
    {
      "id": 51,
      "start": 178.55999755859375,
      "end": 183.75999450683594,
      "text": " you find that this church like the church in Smyrna in fact the only two"
    },
    {
      "id": 52,
      "start": 183.75999450683594,
      "end": 185.32000732421875,
      "text": " churches of the seven"
    },
    {
      "id": 53,
      "start": 185.32000732421875,
      "end": 190.24000549316406,
      "text": " that are addressed here in Revelation we find that there are no corrections that"
    },
    {
      "id": 54,
      "start": 190.24000549316406,
      "end": 191.36000061035156,
      "text": " are given"
    },
    {
      "id": 55,
      "start": 191.36000061035156,
      "end": 196.36000061035156,
      "text": " to the church in Philadelphia and what a blessing to think about that. We"
    },
    {
      "id": 56,
      "start": 196.36000061035156,
      "end": 200.32000732421875,
      "text": " mentioned as we've studied through these seven churches at this point number six"
    },
    {
      "id": 57,
      "start": 200.52000427246094,
      "end": 204.0800018310547,
      "text": " but as we've studied on the churches that are being addressed in Revelations"
    },
    {
      "id": 58,
      "start": 204.0800018310547,
      "end": 205.1199951171875,
      "text": " two and three"
    },
    {
      "id": 59,
      "start": 205.1199951171875,
      "end": 209.1999969482422,
      "text": " and we find that in these two chapters these churches that are addressed that"
    },
    {
      "id": 60,
      "start": 209.1999969482422,
      "end": 210.63999938964844,
      "text": " are local churches"
    },
    {
      "id": 61,
      "start": 210.63999938964844,
      "end": 214.75999450683594,
      "text": " but we find that the Lord Jesus Christ who is the head of the church is writing"
    },
    {
      "id": 62,
      "start": 214.75999450683594,
      "end": 215.63999938964844,
      "text": " to them"
    },
    {
      "id": 63,
      "start": 215.63999938964844,
      "end": 220.55999755859375,
      "text": " and really if we could call it an evaluation, an examination"
    },
    {
      "id": 64,
      "start": 220.55999755859375,
      "end": 224.63999938964844,
      "text": " and we've tried to say this and to be mindful of this truth throughout"
    },
    {
      "id": 65,
      "start": 224.63999938964844,
      "end": 228.16000366210938,
      "text": " each of the studies here on Sunday nights of these churches they"
    },
    {
      "id": 66,
      "start": 228.16000366210938,
      "end": 231.52000427246094,
      "text": " each end with the statement he that hath an ear"
    },
    {
      "id": 67,
      "start": 231.52000427246094,
      "end": 235.60000610351562,
      "text": " let him hear what the Spirit saith unto the"
    },
    {
      "id": 68,
      "start": 235.60000610351562,
      "end": 240.60000610351562,
      "text": " churches plural and the reality is that we need to have"
    },
    {
      "id": 69,
      "start": 240.60000610351562,
      "end": 244.16000366210938,
      "text": " ears to hear and we need to apply truth in our lives"
    },
    {
      "id": 70,
      "start": 244.16000366210938,
      "end": 248.0800018310547,
      "text": " and we need to understand this evening that just as these local churches were"
    },
    {
      "id": 71,
      "start": 248.0800018310547,
      "end": 249.83999633789062,
      "text": " being evaluated by"
    },
    {
      "id": 72,
      "start": 249.83999633789062,
      "end": 253.16000366210938,
      "text": " the Lord Jesus Christ who is the head of the church that the Lord"
    },
    {
      "id": 73,
      "start": 253.16000366210938,
      "end": 258.760009765625,
      "text": " it's still his church and he evaluates and by the way his evaluation is"
    },
    {
      "id": 74,
      "start": 258.760009765625,
      "end": 263.0,
      "text": " correct and there are times in which we looked at some of these and you look at"
    },
    {
      "id": 75,
      "start": 263.0,
      "end": 266.2799987792969,
      "text": " Ephesus and say no no we've not left our first love no no"
    },
    {
      "id": 76,
      "start": 266.2799987792969,
      "end": 270.0799865722656,
      "text": " Jesus Christ said you left your first love"
    },
    {
      "id": 77,
      "start": 270.0799865722656,
      "end": 274.1199951171875,
      "text": " so guess what? It's true. They left their first love."
    },
    {
      "id": 78,
      "start": 274.1199951171875,
      "end": 277.7200012207031,
      "text": " His evaluation is true. In fact next week"
    },
    {
      "id": 79,
      "start": 277.7200012207031,
      "end": 280.79998779296875,
      "text": " actually we have a missionary next week but in two weeks when we look at the church"
    },
    {
      "id": 80,
      "start": 281.3599853515625,
      "end": 284.55999755859375,
      "text": " of the Laodiceans as it's called in verse number 14"
    },
    {
      "id": 81,
      "start": 284.55999755859375,
      "end": 288.239990234375,
      "text": " though they had a perspective of their"
    },
    {
      "id": 82,
      "start": 288.239990234375,
      "end": 291.3599853515625,
      "text": " particular situation they"
    },
    {
      "id": 83,
      "start": 291.3599853515625,
      "end": 295.44000244140625,
      "text": " they were wrong on their perspective. They said"
    },
    {
      "id": 84,
      "start": 295.44000244140625,
      "end": 299.0400085449219,
      "text": " but then God said. We'll look at that in a couple of weeks and so as we look at this"
    },
    {
      "id": 85,
      "start": 299.0400085449219,
      "end": 302.0,
      "text": " church in Philadelphia there's some things that we learned that are"
    },
    {
      "id": 86,
      "start": 302.0,
      "end": 303.20001220703125,
      "text": " important for us to"
    },
    {
      "id": 87,
      "start": 303.20001220703125,
      "end": 307.0400085449219,
      "text": " to consider as we look at this local church but then obviously looking at our"
    },
    {
      "id": 88,
      "start": 307.0400085449219,
      "end": 308.0,
      "text": " own lives and"
    },
    {
      "id": 89,
      "start": 308.1600036621094,
      "end": 312.0799865722656,
      "text": " yes we ought to examine and evaluate ourselves personally individually then"
    },
    {
      "id": 90,
      "start": 312.0799865722656,
      "end": 313.3599853515625,
      "text": " corporately as a church"
    },
    {
      "id": 91,
      "start": 313.3599853515625,
      "end": 317.20001220703125,
      "text": " and understand that the Lord Jesus Christ is evaluating his church."
    },
    {
      "id": 92,
      "start": 317.20001220703125,
      "end": 322.9599914550781,
      "text": " I wanna have in my life personally and in our church corporately"
    },
    {
      "id": 93,
      "start": 322.9599914550781,
      "end": 327.0400085449219,
      "text": " I want God's favor upon our lives."
    },
    {
      "id": 94,
      "start": 327.0400085449219,
      "end": 330.44000244140625,
      "text": " Don't you want God's favor?"
    },
    {
      "id": 95,
      "start": 330.44000244140625,
      "end": 334.0,
      "text": " In my life personally and in our church corporately"
    },
    {
      "id": 96,
      "start": 334.0,
      "end": 337.239990234375,
      "text": " I want God's blessing. I want God's favor."
    },
    {
      "id": 97,
      "start": 337.8399963378906,
      "end": 341.0799865722656,
      "text": " I wanna be in a place where God is"
    },
    {
      "id": 98,
      "start": 341.0799865722656,
      "end": 345.32000732421875,
      "text": " pleased with us. That God is pleased to"
    },
    {
      "id": 99,
      "start": 345.32000732421875,
      "end": 349.4800109863281,
      "text": " add people, to bring people, to know that we will be faithful to"
    },
    {
      "id": 100,
      "start": 349.4800109863281,
      "end": 354.1199951171875,
      "text": " preach his word and to to carry the truth of the gospel. I want to be a"
    },
    {
      "id": 101,
      "start": 354.1199951171875,
      "end": 355.8800048828125,
      "text": " church that pleases the Lord."
    },
    {
      "id": 102,
      "start": 355.8800048828125,
      "end": 360.3599853515625,
      "text": " We find that here the church in Philadelphia if you're taking notes"
    },
    {
      "id": 103,
      "start": 360.3599853515625,
      "end": 361.55999755859375,
      "text": " number one Christ"
    },
    {
      "id": 104,
      "start": 361.55999755859375,
      "end": 366.239990234375,
      "text": " reminds them. Christ reminds them. Don't you notice a few things in verses seven and"
    },
    {
      "id": 105,
      "start": 366.4800109863281,
      "end": 369.5199890136719,
      "text": " eight that the Lord reminds this church of and by the way"
    },
    {
      "id": 106,
      "start": 369.5199890136719,
      "end": 373.2799987792969,
      "text": " there are times in which we need to be reminded. We're prone to forget."
    },
    {
      "id": 107,
      "start": 373.2799987792969,
      "end": 378.0400085449219,
      "text": " It's not maybe that we've forgotten entirely but we just need to be reminded"
    },
    {
      "id": 108,
      "start": 378.0400085449219,
      "end": 381.0400085449219,
      "text": " of something brought to the forefront of our attention."
    },
    {
      "id": 109,
      "start": 381.0400085449219,
      "end": 384.9200134277344,
      "text": " In fact Peter says that he was gonna stir up the people by putting them in"
    },
    {
      "id": 110,
      "start": 384.9200134277344,
      "end": 386.0799865722656,
      "text": " remembrance. He says"
    },
    {
      "id": 111,
      "start": 386.0799865722656,
      "end": 389.9599914550781,
      "text": " though you know these things I'm gonna stir you up by putting you in"
    },
    {
      "id": 112,
      "start": 389.9599914550781,
      "end": 391.79998779296875,
      "text": " remembrance of these things"
    },
    {
      "id": 113,
      "start": 391.79998779296875,
      "end": 395.79998779296875,
      "text": " and so the Lord reminds the church really of five things in these first"
    },
    {
      "id": 114,
      "start": 395.9599914550781,
      "end": 400.2799987792969,
      "text": " couple of verses, verse seven and eight. Number one he reminds them, notice, these"
    },
    {
      "id": 115,
      "start": 400.2799987792969,
      "end": 401.8399963378906,
      "text": " things saith he"
    },
    {
      "id": 116,
      "start": 401.8399963378906,
      "end": 406.6000061035156,
      "text": " that is holy. He that is holy."
    },
    {
      "id": 117,
      "start": 406.6000061035156,
      "end": 410.4800109863281,
      "text": " You know what God reminds the church in Philadelphia? He reminds them that he's holy."
    },
    {
      "id": 118,
      "start": 410.4800109863281,
      "end": 415.0799865722656,
      "text": " Can I tell you this evening we need to be reminded that our God is holy."
    },
    {
      "id": 119,
      "start": 415.0799865722656,
      "end": 420.3999938964844,
      "text": " He's holy. I was thanking the Lord this morning. You know the psalmist talks about that"
    },
    {
      "id": 120,
      "start": 420.3999938964844,
      "end": 423.3599853515625,
      "text": " we're to give thanks at the remembrance of his holiness."
    },
    {
      "id": 121,
      "start": 423.9200134277344,
      "end": 426.760009765625,
      "text": " I was thanking God this morning. I was sitting right there early this morning before the"
    },
    {
      "id": 122,
      "start": 426.760009765625,
      "end": 430.32000732421875,
      "text": " service. I was thanking God that he's holy."
    },
    {
      "id": 123,
      "start": 430.32000732421875,
      "end": 435.0,
      "text": " He says to his people not only in the Old Testament but again in the New Testament"
    },
    {
      "id": 124,
      "start": 435.0,
      "end": 436.67999267578125,
      "text": " that we're to be holy."
    },
    {
      "id": 125,
      "start": 436.67999267578125,
      "end": 441.1600036621094,
      "text": " Why? Because he is holy. I think about Isaiah when he sees the Lord"
    },
    {
      "id": 126,
      "start": 441.1600036621094,
      "end": 445.8399963378906,
      "text": " high holy and lifted up and he sees in Isaiah chapter number six"
    },
    {
      "id": 127,
      "start": 445.8399963378906,
      "end": 449.6000061035156,
      "text": " and the angels are there, holy, holy, holy. In just a few"
    },
    {
      "id": 128,
      "start": 450.0799865722656,
      "end": 453.4800109863281,
      "text": " verses of scripture we get into the fourth chapter. You get into the scene room of"
    },
    {
      "id": 129,
      "start": 453.4800109863281,
      "end": 455.20001220703125,
      "text": " heaven and you see holy,"
    },
    {
      "id": 130,
      "start": 455.20001220703125,
      "end": 460.6000061035156,
      "text": " holy, holy. You know as a church we need to be reminded that our God is holy."
    },
    {
      "id": 131,
      "start": 460.6000061035156,
      "end": 464.55999755859375,
      "text": " He's holy. He's not becoming holy, he is holy."
    },
    {
      "id": 132,
      "start": 464.55999755859375,
      "end": 469.8800048828125,
      "text": " We find this evening that he first reminds them that he's holy, second he"
    },
    {
      "id": 133,
      "start": 469.8800048828125,
      "end": 470.79998779296875,
      "text": " reminds them,"
    },
    {
      "id": 134,
      "start": 470.79998779296875,
      "end": 475.44000244140625,
      "text": " notice it says into the angel of the church in Philadelphia, right, these"
    },
    {
      "id": 135,
      "start": 475.44000244140625,
      "end": 476.6000061035156,
      "text": " things saith he that is"
    },
    {
      "id": 136,
      "start": 476.6000061035156,
      "end": 481.9599914550781,
      "text": " holy and that is true. Jesus Christ said"
    },
    {
      "id": 137,
      "start": 481.9599914550781,
      "end": 487.760009765625,
      "text": " I am the way, the truth, and the life. He has a name, you read Revelation 19, truth,"
    },
    {
      "id": 138,
      "start": 487.760009765625,
      "end": 488.1600036621094,
      "text": " and"
    },
    {
      "id": 139,
      "start": 488.1600036621094,
      "end": 492.3599853515625,
      "text": " you begin to think about the fact that he is true. Let God be true and let"
    },
    {
      "id": 140,
      "start": 492.3599853515625,
      "end": 497.0400085449219,
      "text": " every man be a liar, right? Our God cannot lie. Titus chapter number one"
    },
    {
      "id": 141,
      "start": 497.0400085449219,
      "end": 501.8399963378906,
      "text": " talking about the hope of eternal life that God who cannot lie has promised to"
    },
    {
      "id": 142,
      "start": 501.8399963378906,
      "end": 503.1199951171875,
      "text": " us. He is true."
    },
    {
      "id": 143,
      "start": 503.1600036621094,
      "end": 508.760009765625,
      "text": " He is truth. This evening we must be reminded as the church in Philadelphia"
    },
    {
      "id": 144,
      "start": 508.760009765625,
      "end": 513.239990234375,
      "text": " is reminded that our God is true. Listen, we have so many things that are"
    },
    {
      "id": 145,
      "start": 513.239990234375,
      "end": 519.5599975585938,
      "text": " bombarding us this evening in the world in which we live. Someone, and not to"
    },
    {
      "id": 146,
      "start": 519.5599975585938,
      "end": 523.47998046875,
      "text": " point it out in being a negative way, but someone asked a question about how"
    },
    {
      "id": 147,
      "start": 523.47998046875,
      "end": 527.7999877929688,
      "text": " things are in a certain part and they said that AI was providing an answer. How"
    },
    {
      "id": 148,
      "start": 527.7999877929688,
      "end": 531.760009765625,
      "text": " many of you have gone on Google recently and the first answers are AI generated?"
    },
    {
      "id": 149,
      "start": 532.1199951171875,
      "end": 537.9600219726562,
      "text": " It's what's happening, right? Do you know that that's not always true? Do you know"
    },
    {
      "id": 150,
      "start": 537.9600219726562,
      "end": 542.5999755859375,
      "text": " how the algorithms work? I don't know, I'm not real deep into it, but algorithms on"
    },
    {
      "id": 151,
      "start": 542.5999755859375,
      "end": 547.2000122070312,
      "text": " Google searches, etc. work different than what you might think. Have you ever heard"
    },
    {
      "id": 152,
      "start": 547.2000122070312,
      "end": 554.1599731445312,
      "text": " somebody say, well I saw it on the Internet? You know, I'm amazed. You know it"
    },
    {
      "id": 153,
      "start": 554.1599731445312,
      "end": 558.0,
      "text": " used to be that if you showed somebody a picture that was evidence of something"
    },
    {
      "id": 154,
      "start": 558.0,
      "end": 564.47998046875,
      "text": " that truly happened, right? It's not true anymore. You know how easy it is to"
    },
    {
      "id": 155,
      "start": 564.47998046875,
      "end": 575.3200073242188,
      "text": " manipulate pictures today? They advertise, they market phones and one of the points"
    },
    {
      "id": 156,
      "start": 575.3200073242188,
      "end": 582.8400268554688,
      "text": " of marketing the phone is on the ability to edit a photo immediately. You can see"
    },
    {
      "id": 157,
      "start": 582.8400268554688,
      "end": 587.239990234375,
      "text": " a parent throwing a child up in the air and it's only, you know, 14, 18 inches"
    },
    {
      "id": 158,
      "start": 587.239990234375,
      "end": 591.3599853515625,
      "text": " away and then all of a sudden the picture shows the kid like five feet in the air."
    },
    {
      "id": 159,
      "start": 591.3599853515625,
      "end": 598.2000122070312,
      "text": " No, no, no, no. That's not true. It didn't happen. But our God is true. Everything that"
    },
    {
      "id": 160,
      "start": 598.2000122070312,
      "end": 599.6799926757812,
      "text": " you read in this Bible."
    },
    {
      "id": 0,
      "start": 599.6799926757812,
      "end": 611.0799922943115,
      "text": " is true. God has given us a pure, true record and He is truth. You remember Pilate? What"
    },
    {
      "id": 1,
      "start": 611.0799922943115,
      "end": 618.0999927520752,
      "text": " is truth? Truth was standing before him and unfortunately he didn't stick around long"
    },
    {
      "id": 2,
      "start": 618.0999927520752,
      "end": 624.6399917602539,
      "text": " enough to get an answer to the question that he posed. He says to the church, I'm holy,"
    },
    {
      "id": 3,
      "start": 624.6399917602539,
      "end": 632.5199928283691,
      "text": " I'm true. Notice, he reminds them that he is king. He says, he that hath the key of"
    },
    {
      "id": 4,
      "start": 632.5199928283691,
      "end": 637.9599914550781,
      "text": " David. You know, think about the Davidic covenant. You begin to think about the role that Christ"
    },
    {
      "id": 5,
      "start": 637.9599914550781,
      "end": 642.7199935913086,
      "text": " will play as king of kings, lord of lords during the millennial reign. He is the rightful"
    },
    {
      "id": 6,
      "start": 642.7199935913086,
      "end": 649.3199920654297,
      "text": " heir to the throne and he will rule and reign. He is king. He then says this in verse number"
    },
    {
      "id": 7,
      "start": 649.3199920654297,
      "end": 654.5199928283691,
      "text": " 7. Notice, it says, he that openeth and no man shutteth and shutteth and no man openeth."
    },
    {
      "id": 8,
      "start": 654.5199928283691,
      "end": 660.9999923706055,
      "text": " The authority that our God has. You know, he has all authority. He has all power and"
    },
    {
      "id": 9,
      "start": 660.9999923706055,
      "end": 665.5599899291992,
      "text": " all authority. Begin to think about that this evening in these reminders. There's one more"
    },
    {
      "id": 10,
      "start": 665.5599899291992,
      "end": 669.239990234375,
      "text": " that we'll look at in verse number 8. We begin to think about the authority that our God"
    },
    {
      "id": 11,
      "start": 669.239990234375,
      "end": 678.5599899291992,
      "text": " has. He says that he openeth and no man shutteth and he shutteth and no man openeth. What a"
    },
    {
      "id": 12,
      "start": 678.5599899291992,
      "end": 683.5999908447266,
      "text": " great way to describe the authority that he has. We come to verse number 8. He says,"
    },
    {
      "id": 13,
      "start": 683.5999908447266,
      "end": 689.8399963378906,
      "text": " I know thy works. Isn't that a phrase that we've read to each of these churches? It reminds"
    },
    {
      "id": 14,
      "start": 689.8399963378906,
      "end": 694.5999908447266,
      "text": " us of the fifth truth that we find in these couple of verses of scripture. What does Christ"
    },
    {
      "id": 15,
      "start": 694.5999908447266,
      "end": 700.4799957275391,
      "text": " remind them of? It reminds them that he's omniscient. I know thy works. You know, he"
    },
    {
      "id": 16,
      "start": 700.4799957275391,
      "end": 704.6399917602539,
      "text": " knows everything about you. He knows everything about me. He knows everything about us. He"
    },
    {
      "id": 17,
      "start": 704.6399917602539,
      "end": 708.5199890136719,
      "text": " knows why we do the things that we do. He knows the motives and all of it. He knows"
    },
    {
      "id": 18,
      "start": 708.5199890136719,
      "end": 716.0799942016602,
      "text": " your heart. He knows your thoughts. He's omniscient. We begin to think about these truths that"
    },
    {
      "id": 19,
      "start": 716.0799942016602,
      "end": 720.8799896240234,
      "text": " are given to us in verse 7 and 8 of what Christ reminds this church of that he's holy and"
    },
    {
      "id": 20,
      "start": 720.8799896240234,
      "end": 724.6399917602539,
      "text": " true and that he's king and that he has all authority and that he's omniscient. Listen,"
    },
    {
      "id": 21,
      "start": 724.6399917602539,
      "end": 731.0199890136719,
      "text": " this ought to cause us to rejoice. Why? Because that's my savior. That's the head of the church."
    },
    {
      "id": 22,
      "start": 731.0199890136719,
      "end": 739.8199920654297,
      "text": " When he is all of these things, then he reminds his people, we're not serving some man. We're"
    },
    {
      "id": 23,
      "start": 739.8199920654297,
      "end": 747.5399932861328,
      "text": " not serving some dead little G-O-D. No, we're serving the living God who is holy and true"
    },
    {
      "id": 24,
      "start": 747.5399932861328,
      "end": 752.5799865722656,
      "text": " and he has all power and authority. He is king and he is omniscient. It ought to cause"
    },
    {
      "id": 25,
      "start": 752.5799865722656,
      "end": 760.5199890136719,
      "text": " us to rejoice because we know who he is. And here, as he begins addressing the church in"
    },
    {
      "id": 26,
      "start": 760.5199890136719,
      "end": 765.3199920654297,
      "text": " Philadelphia, he reminds them of these truths. Listen, there are times in which we go through"
    },
    {
      "id": 27,
      "start": 765.3199920654297,
      "end": 772.3199920654297,
      "text": " life and we face a difficulty. We face some uncertainty and we may be led to think that"
    },
    {
      "id": 28,
      "start": 772.3199920654297,
      "end": 777.4799957275391,
      "text": " God doesn't understand or that God doesn't know or that God doesn't… No, he is very"
    },
    {
      "id": 29,
      "start": 777.4799957275391,
      "end": 783.2799987792969,
      "text": " aware of what we're dealing with. He has a purpose and he has a plan and we trust him"
    },
    {
      "id": 30,
      "start": 783.2799987792969,
      "end": 789.8399963378906,
      "text": " and we serve him and we find that it's his church. He is the head of the church. He reminds"
    },
    {
      "id": 31,
      "start": 789.8399963378906,
      "end": 795.0,
      "text": " them. Number two, I would say this tonight in verse number eight, Christ commends them."
    },
    {
      "id": 32,
      "start": 795.0,
      "end": 800.6399993896484,
      "text": " He commends them. Notice immediately in verse number eight, he commends them for their work."
    },
    {
      "id": 33,
      "start": 800.6399993896484,
      "end": 805.1599884033203,
      "text": " He says, I know thy works. They were serving the Lord. They were involved in doing what"
    },
    {
      "id": 34,
      "start": 805.1599884033203,
      "end": 809.3599853515625,
      "text": " God had called them to do. They were faithful. We'll look at that in just a moment, but I"
    },
    {
      "id": 35,
      "start": 809.3599853515625,
      "end": 814.1999969482422,
      "text": " want you to notice this in verse number eight. He says, I know thy works. Behold, notice"
    },
    {
      "id": 36,
      "start": 814.9199981689453,
      "end": 821.9199981689453,
      "text": " I have set before thee an open door and no man can shut it. I want you to think about"
    },
    {
      "id": 37,
      "start": 822.9599914550781,
      "end": 825.8799896240234,
      "text": " that just for a moment. It's a little bit different than what he said in verse seven."
    },
    {
      "id": 38,
      "start": 825.8799896240234,
      "end": 829.1599884033203,
      "text": " In speaking of the authority in verse seven, he says, he that openeth and no man shutteth"
    },
    {
      "id": 39,
      "start": 829.1599884033203,
      "end": 834.5199890136719,
      "text": " and shutteth and no man openeth. And that's a general truth, a statement that is given."
    },
    {
      "id": 40,
      "start": 834.5199890136719,
      "end": 839.0,
      "text": " But in verse number eight, while speaking to this church in Philadelphia, he says, I"
    },
    {
      "id": 41,
      "start": 839.0,
      "end": 846.0,
      "text": " have set before thee an open door and no man can shut it. You think about an open door."
    },
    {
      "id": 42,
      "start": 847.2799987792969,
      "end": 852.6399993896484,
      "text": " You think about the picture Paul talks about that there's an open door, but there are many"
    },
    {
      "id": 43,
      "start": 852.6399993896484,
      "end": 857.0,
      "text": " adversaries, right? But you begin to think about this open door. If I could use a phrase"
    },
    {
      "id": 44,
      "start": 857.0,
      "end": 862.5199890136719,
      "text": " this evening to help us kind of maybe understand it, it's an opportunity. The open door is"
    },
    {
      "id": 45,
      "start": 862.5199890136719,
      "end": 868.9599914550781,
      "text": " an opportunity. And the Lord Jesus Christ, the one who reminds them of who he is and"
    },
    {
      "id": 46,
      "start": 868.9599914550781,
      "end": 874.9599914550781,
      "text": " he reveals all this truth and exposes them to then this truth as he commends them, that"
    },
    {
      "id": 47,
      "start": 874.9599914550781,
      "end": 881.3999938964844,
      "text": " I've given to you an opportunity. Can I say to you this evening that God has given to"
    },
    {
      "id": 48,
      "start": 881.3999938964844,
      "end": 888.3999938964844,
      "text": " his church an opportunity. Can I tell you this evening that we don't serve the Lord,"
    },
    {
      "id": 49,
      "start": 888.9199829101562,
      "end": 894.9199829101562,
      "text": " we don't do what we do because we have a United States Constitution or a Bill of Rights or"
    },
    {
      "id": 50,
      "start": 894.9199829101562,
      "end": 901.9199829101562,
      "text": " – no, no, we do what we do because we have a Bible and we serve the Lord that's omnipotent,"
    },
    {
      "id": 51,
      "start": 903.8800048828125,
      "end": 908.5599975585938,
      "text": " that has given to us an open door. Listen, I'm thankful for the freedoms and the liberties"
    },
    {
      "id": 52,
      "start": 908.5599975585938,
      "end": 913.2799987792969,
      "text": " and the rights that we have in America, but can I tell you that if those rights are removed,"
    },
    {
      "id": 53,
      "start": 913.2799987792969,
      "end": 920.2799987792969,
      "text": " if those rights do not exist, the truth of this book stands. There are believers, there"
    },
    {
      "id": 54,
      "start": 920.3200073242188,
      "end": 926.6999816894531,
      "text": " are folks on that missions map that we send dollars to and we pray for that are in places"
    },
    {
      "id": 55,
      "start": 926.6999816894531,
      "end": 933.6999816894531,
      "text": " around the world that do not have the freedoms and liberties that we do. Yet God says I have"
    },
    {
      "id": 56,
      "start": 934.4400024414062,
      "end": 941.4400024414062,
      "text": " given you an opportunity. I've opened a door that no man can shut. You know what's interesting"
    },
    {
      "id": 57,
      "start": 942.4400024414062,
      "end": 949.3599853515625,
      "text": " about opportunities? They don't last forever. What's interesting about opportunities? Many"
    },
    {
      "id": 58,
      "start": 949.3599853515625,
      "end": 956.3599853515625,
      "text": " times it's easier to see them on the other side after we've missed them. You say, man,"
    },
    {
      "id": 59,
      "start": 956.6000061035156,
      "end": 962.7200012207031,
      "text": " I missed an opportunity. God's given to us as a local church, Fellowship Baptist Church,"
    },
    {
      "id": 60,
      "start": 962.7200012207031,
      "end": 968.0,
      "text": " he's given to us an opportunity, an open door, an opportunity to reach a region. I've"
    },
    {
      "id": 61,
      "start": 968.0,
      "end": 971.7999877929688,
      "text": " often said as people have asked me, and in fact I was sharing with somebody this afternoon"
    },
    {
      "id": 62,
      "start": 971.7999877929688,
      "end": 976.7599792480469,
      "text": " after the service about some ministry things in Northern Virginia and folks that have never"
    },
    {
      "id": 63,
      "start": 976.7599792480469,
      "end": 981.47998046875,
      "text": " ministered here don't fully comprehend what this region is like, but I've often said this,"
    },
    {
      "id": 64,
      "start": 981.47998046875,
      "end": 988.47998046875,
      "text": " you know, the reality is that God has put the world in our backyard. Literally. We have"
    },
    {
      "id": 65,
      "start": 989.0799865722656,
      "end": 994.8800048828125,
      "text": " the opportunity to reach people in this region of the world that can go back to whatever"
    },
    {
      "id": 66,
      "start": 994.9199829101562,
      "end": 1000.5199890136719,
      "text": " country it is and go as missionaries and they know languages and cultures and it's absolutely"
    },
    {
      "id": 67,
      "start": 1000.5199890136719,
      "end": 1006.3200073242188,
      "text": " amazing the opportunities that God has given to us. We better seize the opportunities."
    },
    {
      "id": 68,
      "start": 1006.3200073242188,
      "end": 1011.8200073242188,
      "text": " We better take advantage of the time that God has given to us and Christ commends them"
    },
    {
      "id": 69,
      "start": 1011.8200073242188,
      "end": 1016.8399963378906,
      "text": " for their works and he reminds them that he's opened a door for them. He has given to them"
    },
    {
      "id": 70,
      "start": 1016.8399963378906,
      "end": 1022.3599853515625,
      "text": " an opportunity. I find that he also commends them for their faithfulness and for their"
    },
    {
      "id": 71,
      "start": 1022.5199890136719,
      "end": 1026.0399780273438,
      "text": " obedience. Notice it says in verse number 8, the end of the verse,"
    },
    {
      "id": 72,
      "start": 1026.0399780273438,
      "end": 1033.0399780273438,
      "text": " For thou hast a little strength, and hast kept my word, and hast not denied my name."
    },
    {
      "id": 73,
      "start": 1033.8399963378906,
      "end": 1037.8800048828125,
      "text": " Again in verse number 10, this is because thou hast kept the word of my patience. Begin"
    },
    {
      "id": 74,
      "start": 1037.8800048828125,
      "end": 1043.3599853515625,
      "text": " to think about the faithfulness and the obedience of this church and it is referenced that thou"
    },
    {
      "id": 75,
      "start": 1043.3599853515625,
      "end": 1050.3599853515625,
      "text": " hast kept my word. Listen, God requires in us to be faithful. To be faithful."
    },
    {
      "id": 76,
      "start": 1053.0399780273438,
      "end": 1060.0399780273438,
      "text": " To be obedient. Trust and obey. We sing the song. And I'm thankful this evening, moreover"
    },
    {
      "id": 77,
      "start": 1061.0399780273438,
      "end": 1068.0399780273438,
      "text": " it's required in Stuart's that a man be found faithful. God has entrusted to us and then"
    },
    {
      "id": 78,
      "start": 1069.7999877929688,
      "end": 1075.3999938964844,
      "text": " he expects of us faithfulness. How many of you this evening, don't raise your hand, but"
    },
    {
      "id": 79,
      "start": 1075.3999938964844,
      "end": 1082.3999938964844,
      "text": " how many of you this evening are thankful that God is faithful? God is faithful. Amen?"
    },
    {
      "id": 80,
      "start": 1084.7599792480469,
      "end": 1091.7599792480469,
      "text": " And I'm thankful this evening that his faithfulness doesn't vary based on my faithfulness. He's"
    },
    {
      "id": 81,
      "start": 1092.7999877929688,
      "end": 1099.7999877929688,
      "text": " faithful. But the reality is that we ought to desire to be faithful. To be faithful."
    },
    {
      "id": 82,
      "start": 1100.6399841308594,
      "end": 1105.9199829101562,
      "text": " Great is thy faithfulness. We sing the song. It's a favorite of many. Faithful is he that"
    },
    {
      "id": 83,
      "start": 1105.9199829101562,
      "end": 1112.9199829101562,
      "text": " calleth you who also will do it. 1 Thessalonians 5 and verse 24. God is faithful. And then"
    },
    {
      "id": 84,
      "start": 1113.5599975585938,
      "end": 1119.3200073242188,
      "text": " he expects of us that we too would be faithful. Notice he commends them for their testimony."
    },
    {
      "id": 85,
      "start": 1119.3200073242188,
      "end": 1126.3200073242188,
      "text": " It says at the end of verse number 8, And hast not denied my name. You know, our testimony"
    },
    {
      "id": 86,
      "start": 1127.3200073242188,
      "end": 1134.1199951171875,
      "text": " matters. Our testimony matters. There are times in which we're pressed. There are times"
    },
    {
      "id": 87,
      "start": 1134.1199951171875,
      "end": 1139.5999755859375,
      "text": " in which we're faced with difficulties and maybe we're surrounded by a number. We feel"
    },
    {
      "id": 88,
      "start": 1139.5999755859375,
      "end": 1146.5999755859375,
      "text": " like we're in the minority and I mean maybe like all alone. Maybe we sometimes have the"
    },
    {
      "id": 89,
      "start": 1147.239990234375,
      "end": 1153.0399780273438,
      "text": " Elijah syndrome. Everyone else has bowed but not me and God of course says no, no, no Elijah"
    },
    {
      "id": 90,
      "start": 1153.0399780273438,
      "end": 1159.239990234375,
      "text": " you're not accurate on that. But there are times when we feel that way. But here he says"
    },
    {
      "id": 91,
      "start": 1159.239990234375,
      "end": 1166.239990234375,
      "text": " thou hast not denied my name. They had a good testimony. This evening our testimony matters."
    },
    {
      "id": 92,
      "start": 1166.2799682617188,
      "end": 1173.2799682617188,
      "text": " It really does. A good name is rather to be chosen. Right? Great riches. Think about the"
    },
    {
      "id": 93,
      "start": 1174.6400146484375,
      "end": 1180.9600219726562,
      "text": " testimony this evening. How's our testimony? You know the testimony of a church? The testimony"
    },
    {
      "id": 94,
      "start": 1180.9600219726562,
      "end": 1187.0800170898438,
      "text": " of individuals that are within the church? I don't ever want to be in a position where"
    },
    {
      "id": 95,
      "start": 1187.0800170898438,
      "end": 1192.3599853515625,
      "text": " someone's like, oh you go to that church? But you know there have been times that I've heard"
    },
    {
      "id": 96,
      "start": 1192.3599853515625,
      "end": 1197.3599853515625,
      "text": " that kind of statement. Why? Because all of a sudden that church has a bad testimony in"
    },
    {
      "id": 97,
      "start": 1197.3599853515625,
      "end": 1199.760009765625,
      "text": " a community. I'd have read a church."
    },
    {
      "id": 0,
      "start": 1199.760009765625,
      "end": 1205.2000098228455,
      "text": " church in another state that's looking for a pastor. In fact, there are churches all"
    },
    {
      "id": 1,
      "start": 1205.2000098228455,
      "end": 1210.0800094604492,
      "text": " over looking for pastors. It's a sad, sad day in our churches. It really is all over"
    },
    {
      "id": 2,
      "start": 1210.0800094604492,
      "end": 1215.640009880066,
      "text": " the place. I hear about them all the time. A church in another state, the person that"
    },
    {
      "id": 3,
      "start": 1215.640009880066,
      "end": 1219.2400093078613,
      "text": " was telling me about it said, you know, it's going to be a really difficult thing. And"
    },
    {
      "id": 4,
      "start": 1219.2400093078613,
      "end": 1222.2000102996826,
      "text": " I said, you know, explain that to me. What do you mean it's going to be a difficult thing?"
    },
    {
      "id": 5,
      "start": 1222.2000102996826,
      "end": 1228.1600093841553,
      "text": " Well, the pastor's in jail for murder. And so the church has a really bad testimony."
    },
    {
      "id": 6,
      "start": 1228.1600093841553,
      "end": 1234.2400093078613,
      "text": " And I thought, I guess it does. Like, you got to be kidding me. And they asked me,"
    },
    {
      "id": 7,
      "start": 1234.2400093078613,
      "end": 1239.9000091552734,
      "text": " what would you do? I have no idea. Like, close it down, change the name, do something, right?"
    },
    {
      "id": 8,
      "start": 1239.9000091552734,
      "end": 1248.0000114440918,
      "text": " Because the testimony of that church in that community is tarnished. It's tarnished. He"
    },
    {
      "id": 9,
      "start": 1248.0000114440918,
      "end": 1252.4800109863281,
      "text": " says, thou hast kept, thou hast not, excuse me, denied my name. Thou hast kept my word"
    },
    {
      "id": 10,
      "start": 1252.4800109863281,
      "end": 1257.760009765625,
      "text": " and hast not denied my name. And number three, Christ comforts them. In verses 9-12, we find"
    },
    {
      "id": 11,
      "start": 1257.760009765625,
      "end": 1262.920009613037,
      "text": " not only these reminders and the way that Christ commends them, but now He comforts"
    },
    {
      "id": 12,
      "start": 1262.920009613037,
      "end": 1267.0800094604492,
      "text": " them. By the way, aren't you thankful that our God is the God of all comfort? He comforted"
    },
    {
      "id": 13,
      "start": 1267.0800094604492,
      "end": 1272.2000122070312,
      "text": " us in all of our tribulation. We read that. The Holy Spirit, one of the names ascribed"
    },
    {
      "id": 14,
      "start": 1272.2000122070312,
      "end": 1277.3200073242188,
      "text": " to the Holy Spirit is Comforter. And we find that Christ begins to comfort them. Notice"
    },
    {
      "id": 15,
      "start": 1277.3200073242188,
      "end": 1281.260009765625,
      "text": " in verse number 9, behold, I will make them of the synagogue of Satan, which say they"
    },
    {
      "id": 16,
      "start": 1281.260009765625,
      "end": 1285.8400115966797,
      "text": " are Jews and are not, but do lie. Behold, I will make them to come and worship before"
    },
    {
      "id": 17,
      "start": 1285.8400115966797,
      "end": 1292.5600128173828,
      "text": " thy feet and to know that I have loved thee. Aren't you thankful that God loves us? I'm"
    },
    {
      "id": 18,
      "start": 1292.5600128173828,
      "end": 1298.4800109863281,
      "text": " thankful for the security, for the comfort that He gives. We could say in verse number"
    },
    {
      "id": 19,
      "start": 1298.4800109863281,
      "end": 1302.8400115966797,
      "text": " 9 that victory is certain. Listen, there were some difficulties that they were dealing with,"
    },
    {
      "id": 20,
      "start": 1302.8400115966797,
      "end": 1307.3200073242188,
      "text": " with this group of people that is mentioned, and we find that God is going to work on the"
    },
    {
      "id": 21,
      "start": 1307.3200073242188,
      "end": 1312.9600067138672,
      "text": " behalf. He's going to deal with it, and He says that they're going to know that I have"
    },
    {
      "id": 22,
      "start": 1312.9600067138672,
      "end": 1319.4800109863281,
      "text": " loved thee. Victory is certain. Listen, we're on the winning side. Heaven, I preached about"
    },
    {
      "id": 23,
      "start": 1319.4800109863281,
      "end": 1325.160011291504,
      "text": " heaven this morning. I mean, we're going to heaven. We are victorious. We are more than"
    },
    {
      "id": 24,
      "start": 1325.160011291504,
      "end": 1330.4000091552734,
      "text": " conquerors through Christ. But thanks be to God which giveth us the victory through our"
    },
    {
      "id": 25,
      "start": 1330.4000091552734,
      "end": 1335.8800048828125,
      "text": " Lord Jesus Christ, and this evening we are on the winning side. Victory is certain. We"
    },
    {
      "id": 26,
      "start": 1335.8800048828125,
      "end": 1341.280014038086,
      "text": " find that in verse number 10 there's this comfort of deliverance in the hour of temptation."
    },
    {
      "id": 27,
      "start": 1341.280014038086,
      "end": 1345.6000061035156,
      "text": " Listen, verse 10, because thou has kept the word of my patience, I also will keep thee"
    },
    {
      "id": 28,
      "start": 1345.6000061035156,
      "end": 1351.1200103759766,
      "text": " from the hour of temptation which shall come upon all the world to try them that dwell"
    },
    {
      "id": 29,
      "start": 1351.1200103759766,
      "end": 1358.1200103759766,
      "text": " upon the earth. By the way, a great truth with regard to dealing with the pre-tribulational"
    },
    {
      "id": 30,
      "start": 1358.1200103759766,
      "end": 1363.3600158691406,
      "text": " rapture, the fact that you look at what's going to happen as you enter into chapter"
    },
    {
      "id": 31,
      "start": 1363.3600158691406,
      "end": 1369.1200103759766,
      "text": " 6 and all of the situation with the tribulation and so on and so forth, and we find that He"
    },
    {
      "id": 32,
      "start": 1369.1200103759766,
      "end": 1374.3200073242188,
      "text": " speaks about deliverance from what? From the hour of temptation which shall come upon"
    },
    {
      "id": 33,
      "start": 1374.3200073242188,
      "end": 1381.5600128173828,
      "text": " all the world for what purpose? To try them that dwell upon the earth. We begin to think"
    },
    {
      "id": 34,
      "start": 1381.5600128173828,
      "end": 1387.1200103759766,
      "text": " about the deliverance. We begin to read in 1 and 2 Thessalonians and comparing Scripture"
    },
    {
      "id": 35,
      "start": 1387.1200103759766,
      "end": 1391.260009765625,
      "text": " with Scripture, and we'll get to it in greater detail as we get into chapter 4 and then again"
    },
    {
      "id": 36,
      "start": 1391.260009765625,
      "end": 1395.4000091552734,
      "text": " into chapter number 6. We begin to look at all of these wonderful truths and look at"
    },
    {
      "id": 37,
      "start": 1395.4000091552734,
      "end": 1402.3600158691406,
      "text": " the promises that God has given to us, this truth of deliverance. The rewards that are"
    },
    {
      "id": 38,
      "start": 1402.3600158691406,
      "end": 1406.8400115966797,
      "text": " mentioned in verse number 11, behold I come quickly, hold that fast which thou hast that"
    },
    {
      "id": 39,
      "start": 1406.8400115966797,
      "end": 1414.1600036621094,
      "text": " no man take thy crown. We find that the Scriptures teach us about rewards. In fact, we read of"
    },
    {
      "id": 40,
      "start": 1414.1600036621094,
      "end": 1420.0400085449219,
      "text": " them in the fourth chapter and how we will take and we will cast those crowns before"
    },
    {
      "id": 41,
      "start": 1420.0400085449219,
      "end": 1429.000015258789,
      "text": " the throne and what we will say, thou art worthy O Lord. We find that the truth of eternity"
    },
    {
      "id": 42,
      "start": 1429.000015258789,
      "end": 1435.5600128173828,
      "text": " is at stake or in clear view in verse number 12, him that overcometh will I make a pillar"
    },
    {
      "id": 43,
      "start": 1435.5600128173828,
      "end": 1440.6000061035156,
      "text": " in the temple of my God and he shall go no more out and I will write upon him the name"
    },
    {
      "id": 44,
      "start": 1440.6000061035156,
      "end": 1445.4600067138672,
      "text": " of my God and the name of the city of my God which is New Jerusalem which cometh down out"
    },
    {
      "id": 45,
      "start": 1445.4600067138672,
      "end": 1452.260009765625,
      "text": " of heaven from my God and I will write upon him my new name. He talks about what he's"
    },
    {
      "id": 46,
      "start": 1452.260009765625,
      "end": 1459.2200012207031,
      "text": " going to do for them, these comforts that God is giving to these individual believers"
    },
    {
      "id": 47,
      "start": 1459.2200012207031,
      "end": 1465.1800231933594,
      "text": " that make up this church in Philadelphia. This evening, I'm thankful for the promises"
    },
    {
      "id": 48,
      "start": 1465.1800231933594,
      "end": 1471.8600158691406,
      "text": " that God has given to us and the promises bring comfort. The revelation that God has"
    },
    {
      "id": 49,
      "start": 1471.8600158691406,
      "end": 1477.1800231933594,
      "text": " given to us enables us to be comforted. We think about what he says to the church in"
    },
    {
      "id": 50,
      "start": 1477.1800231933594,
      "end": 1482.0599975585938,
      "text": " Smyrna in chapter 2 in verse number 10, be thou faithful unto death and I will give thee"
    },
    {
      "id": 51,
      "start": 1482.0599975585938,
      "end": 1488.3399963378906,
      "text": " a crown of life. I think about Paul as he writes in 2 Timothy chapter 4 knowing that"
    },
    {
      "id": 52,
      "start": 1488.3399963378906,
      "end": 1495.1400146484375,
      "text": " his day of departure is at hand but he recognizes that there's a crown of righteousness that"
    },
    {
      "id": 53,
      "start": 1495.1400146484375,
      "end": 1499.5800170898438,
      "text": " the Lord, the faithful judge is going to give him but not only him, he says all of those"
    },
    {
      "id": 54,
      "start": 1499.5800170898438,
      "end": 1506.3399963378906,
      "text": " that love is appearing and these are comforting truths. We find that a church that's here"
    },
    {
      "id": 55,
      "start": 1506.3399963378906,
      "end": 1513.02001953125,
      "text": " in Philadelphia, this church is given these reminders and then it's commended and then"
    },
    {
      "id": 56,
      "start": 1513.02001953125,
      "end": 1518.3000183105469,
      "text": " God gives them these words of comfort. By the way, I'm thankful for what we read at"
    },
    {
      "id": 57,
      "start": 1518.3000183105469,
      "end": 1525.6199951171875,
      "text": " the end of the passage of scripture in 1 Thessalonians chapter 4 and comfort one another with these"
    },
    {
      "id": 58,
      "start": 1525.6199951171875,
      "end": 1532.7799987792969,
      "text": " words. You know God's words bring comfort. They really do. God brings comfort. He is"
    },
    {
      "id": 59,
      "start": 1532.7799987792969,
      "end": 1538.9000244140625,
      "text": " the comforter. We find that his word brings comfort. Then I want you to notice finally"
    },
    {
      "id": 60,
      "start": 1538.9000244140625,
      "end": 1546.6600036621094,
      "text": " this evening number 4, Christ counsels them. He counsels them. We think about counsel."
    },
    {
      "id": 61,
      "start": 1546.6600036621094,
      "end": 1551.4200134277344,
      "text": " Counsel is good. I mentioned this last week or two weeks ago when we looked at, I don't"
    },
    {
      "id": 62,
      "start": 1551.4200134277344,
      "end": 1554.5400085449219,
      "text": " remember did I preach it last week or the week before, I guess it was two weeks ago"
    },
    {
      "id": 63,
      "start": 1554.5400085449219,
      "end": 1561.0599975585938,
      "text": " and we noted the counsel there for the church in Sardis and by the way it was harsh counsel"
    },
    {
      "id": 64,
      "start": 1561.0599975585938,
      "end": 1568.7000122070312,
      "text": " that was given but I said this that counsel is given and counsel is productive and it's"
    },
    {
      "id": 65,
      "start": 1568.7000122070312,
      "end": 1574.7000122070312,
      "text": " profitable so long as we take heed to it. There have been plenty of times in your life"
    },
    {
      "id": 66,
      "start": 1574.7000122070312,
      "end": 1579.7400207519531,
      "text": " and I know plenty of times in my life that I've given counsel to someone and they let"
    },
    {
      "id": 67,
      "start": 1579.7400207519531,
      "end": 1584.3399963378906,
      "text": " it go in one ear and out the other and there are times that I'm guilty of doing the same"
    },
    {
      "id": 68,
      "start": 1584.3399963378906,
      "end": 1590.1000061035156,
      "text": " thing when counsel is given. But God here gives counsel to the church and I believe"
    },
    {
      "id": 69,
      "start": 1590.1000061035156,
      "end": 1597.1000061035156,
      "text": " that it's important for us also to note this counsel and to take heed to the counsel. First"
    },
    {
      "id": 70,
      "start": 1597.1000061035156,
      "end": 1603.1800231933594,
      "text": " we find that he counsels them with regard to his return. In verse number 11 he says,"
    },
    {
      "id": 71,
      "start": 1603.1800231933594,
      "end": 1609.9000244140625,
      "text": " behold I come quickly. You know that ought to give us some instruction. It ought to give"
    },
    {
      "id": 72,
      "start": 1609.9000244140625,
      "end": 1616.7799987792969,
      "text": " us some consideration this evening with regard to how we live our lives, what we're doing"
    },
    {
      "id": 73,
      "start": 1616.7799987792969,
      "end": 1622.9400024414062,
      "text": " and how we're redeeming the time that God has given to us. Of course no man knoweth"
    },
    {
      "id": 74,
      "start": 1622.9400024414062,
      "end": 1627.5800170898438,
      "text": " the hour. We don't know when he's going to return but we find that he says to this church,"
    },
    {
      "id": 75,
      "start": 1627.5800170898438,
      "end": 1631.9400024414062,
      "text": " I come quickly and we find that as we read the end of the book of Revelation that he"
    },
    {
      "id": 76,
      "start": 1631.9400024414062,
      "end": 1636.6600036621094,
      "text": " says he's going to come quickly and we can look and we understand that 2 Peter says that"
    },
    {
      "id": 77,
      "start": 1636.6600036621094,
      "end": 1644.9000244140625,
      "text": " the scoffers have said where is the time of his appearing? We find that a day is a"
    },
    {
      "id": 78,
      "start": 1644.9000244140625,
      "end": 1651.9400024414062,
      "text": " thousand years, a thousand years is a day. God's right on time and he's going to come"
    },
    {
      "id": 79,
      "start": 1651.9400024414062,
      "end": 1658.5800170898438,
      "text": " back. I don't know when but we know that he is. The counsel that he gives to this church"
    },
    {
      "id": 80,
      "start": 1658.5800170898438,
      "end": 1662.7799987792969,
      "text": " is to expect his return. And by the way I believe that as you read the book of Acts"
    },
    {
      "id": 81,
      "start": 1662.7799987792969,
      "end": 1669.5800170898438,
      "text": " I believe that so much happened in the first century through the people of God as the gospel"
    },
    {
      "id": 82,
      "start": 1669.5800170898438,
      "end": 1678.7000122070312,
      "text": " went forth because they lived expecting his return. It was on their mind. Why? Well because"
    },
    {
      "id": 83,
      "start": 1678.7000122070312,
      "end": 1682.5800170898438,
      "text": " the disciples stood there and watched him ascend up into heaven and heard that this"
    },
    {
      "id": 84,
      "start": 1682.5800170898438,
      "end": 1689.4600219726562,
      "text": " same Jesus shall so come in like manner. Go get busy doing what he told you to do and"
    },
    {
      "id": 85,
      "start": 1689.4600219726562,
      "end": 1696.8200073242188,
      "text": " here this evening we too have the reminder that Christ is coming back. We find that"
    },
    {
      "id": 86,
      "start": 1696.8200073242188,
      "end": 1702.9400024414062,
      "text": " also in verse number 11 we have the responsibility, the counsel is for them to remain steadfast."
    },
    {
      "id": 87,
      "start": 1702.9400024414062,
      "end": 1712.9400024414062,
      "text": " Hold that fast which thou hast. To remain steadfast. We find that there are many that"
    },
    {
      "id": 88,
      "start": 1712.9400024414062,
      "end": 1718.1000366210938,
      "text": " change, many that are trying to find something new, something different, becoming more relevant"
    },
    {
      "id": 89,
      "start": 1718.1000366210938,
      "end": 1723.5400390625,
      "text": " and so on and so forth but the reality is that God says to this church hold that fast"
    },
    {
      "id": 90,
      "start": 1723.5400390625,
      "end": 1730.8200073242188,
      "text": " which thou hast. Sometimes a church can try to be so relevant to its community that it"
    },
    {
      "id": 91,
      "start": 1730.8200073242188,
      "end": 1740.5400390625,
      "text": " becomes irrelevant to God. Read in the Old Testament, Ichabod. What's it mean? The glory"
    },
    {
      "id": 92,
      "start": 1740.5400390625,
      "end": 1750.780029296875,
      "text": " of the Lord hath departed. We find this evening that he says hold that fast which thou hast."
    },
    {
      "id": 93,
      "start": 1750.780029296875,
      "end": 1758.4600219726562,
      "text": " You know we've been given truth. We find that Paul gives to Timothy, 2 Timothy 2 and verse"
    },
    {
      "id": 94,
      "start": 1758.4600219726562,
      "end": 1767.02001953125,
      "text": " number 2 this charge to commit to teach faithful men to teach them what? The things that thou"
    },
    {
      "id": 95,
      "start": 1767.02001953125,
      "end": 1774.2999877929688,
      "text": " hast heard of me among many witnesses the same. Commit thou to faithful men who shall"
    },
    {
      "id": 96,
      "start": 1774.2999877929688,
      "end": 1780.47998046875,
      "text": " be able to teach others also. We find that we read in the book of Jude just one chapter"
    },
    {
      "id": 97,
      "start": 1780.47998046875,
      "end": 1786.5,
      "text": " in just a really a short letter but we find that the Bible says that it was needful in"
    },
    {
      "id": 98,
      "start": 1786.5,
      "end": 1790.9600219726562,
      "text": " verse number 3 that Jude says it was needful for me to write unto you and exhort you that"
    },
    {
      "id": 99,
      "start": 1790.9600219726562,
      "end": 1798.1600341796875,
      "text": " you should earnestly contend for the faith which was once delivered unto the saints."
    },
    {
      "id": 100,
      "start": 1798.1600341796875,
      "end": 1799.7999877929688,
      "text": " I'm so thankful for the purity of"
    },
    {
      "id": 0,
      "start": 1799.7999877929688,
      "end": 1806.4399876594543,
      "text": " doctrine. I'm thankful for the truth that we have.\" And he tells the church to remain"
    },
    {
      "id": 1,
      "start": 1806.4399876594543,
      "end": 1814.4399881362915,
      "text": " steadfast, to hold that fast which thou hast. I'm not looking for any new revelation."
    },
    {
      "id": 2,
      "start": 1814.4399881362915,
      "end": 1821.9199886322021,
      "text": " Canon of Scripture is closed. Amen? We interpret everything through this book. We take heed"
    },
    {
      "id": 3,
      "start": 1821.9199886322021,
      "end": 1826.6399879455566,
      "text": " to this book. We hold fast to what God has given to us and we faithfully preach. What"
    },
    {
      "id": 4,
      "start": 1826.6399879455566,
      "end": 1833.339988708496,
      "text": " did Paul tell Timothy in 2 Timothy 4? Preach the word. The time is going to come when men"
    },
    {
      "id": 5,
      "start": 1833.339988708496,
      "end": 1837.5399894714355,
      "text": " will not endure sound doctrine, he goes on to say in the same text of Scripture, but"
    },
    {
      "id": 6,
      "start": 1837.5399894714355,
      "end": 1845.719985961914,
      "text": " it did not change the charge. The charge is given and then the reality of the people not"
    },
    {
      "id": 7,
      "start": 1845.719985961914,
      "end": 1854.119987487793,
      "text": " enduring it is given as well, but the charge remains. Remain steadfast. Therefore, my beloved"
    },
    {
      "id": 8,
      "start": 1854.119987487793,
      "end": 1861.0399894714355,
      "text": " brethren, be steadfast, unmovable, always abounding in the work of the Lord. Why? For"
    },
    {
      "id": 9,
      "start": 1861.0399894714355,
      "end": 1868.6799850463867,
      "text": " as much as you know that your labor is not in vain in the Lord. 1 Corinthians chapter"
    },
    {
      "id": 10,
      "start": 1868.6799850463867,
      "end": 1874.999984741211,
      "text": " 15 and verse number 58 I believe it is. And what a blessing to think about the charge"
    },
    {
      "id": 11,
      "start": 1874.999984741211,
      "end": 1882.239990234375,
      "text": " that's been given to us. This counsel. Expect his return. Remain steadfast and then we find"
    },
    {
      "id": 12,
      "start": 1882.239990234375,
      "end": 1887.0799865722656,
      "text": " in verse number 13 this truth that's given to every church that's written to in the book"
    },
    {
      "id": 13,
      "start": 1887.0799865722656,
      "end": 1895.7999877929688,
      "text": " of Revelation. Listen and take heed. The believers in Philadelphia were doing well. They're doing"
    },
    {
      "id": 14,
      "start": 1895.7999877929688,
      "end": 1903.239990234375,
      "text": " well. They're not corrected at all. They're reminded of some things. They're commended."
    },
    {
      "id": 15,
      "start": 1903.239990234375,
      "end": 1908.0399856567383,
      "text": " They're comforted. They're counseled. And we find that the church in Philadelphia, they're"
    },
    {
      "id": 16,
      "start": 1908.0399856567383,
      "end": 1913.5999908447266,
      "text": " doing well, but they too could learn and should learn from the letters written to the"
    },
    {
      "id": 17,
      "start": 1913.5999908447266,
      "end": 1922.4799880981445,
      "text": " other churches. Much can change in just one generation. Much can change in just one generation."
    },
    {
      "id": 18,
      "start": 1922.4799880981445,
      "end": 1927.8399810791016,
      "text": " And it's important for a church that's doing what they're supposed to do to have that listen"
    },
    {
      "id": 19,
      "start": 1927.8399810791016,
      "end": 1933.3199920654297,
      "text": " and take heed and to be sure that we're going to protect and seek to please and honor our"
    },
    {
      "id": 20,
      "start": 1933.3599853515625,
      "end": 1940.5199890136719,
      "text": " Lord so that we don't get out of balance one way or the other. And though the church was"
    },
    {
      "id": 21,
      "start": 1940.5199890136719,
      "end": 1949.5199890136719,
      "text": " doing well, they could not relax. They couldn't just say, you know, we can kind of coast now."
    },
    {
      "id": 22,
      "start": 1949.5199890136719,
      "end": 1954.9199829101562,
      "text": " Because we weren't really corrected for anything and so we can just kind of lay back and take"
    },
    {
      "id": 23,
      "start": 1954.9199829101562,
      "end": 1968.0399932861328,
      "text": " it easy. No. No. They had to hear. I'm thankful that God's given to us counsel, warnings,"
    },
    {
      "id": 24,
      "start": 1968.0399932861328,
      "end": 1975.0399932861328,
      "text": " instructions. This evening the church in Philadelphia is a good church. This evening the church"
    },
    {
      "id": 25,
      "start": 1975.0399932861328,
      "end": 1980.239990234375,
      "text": " is reminded of some things. I hope that we would take heed, that we too would be reminded"
    },
    {
      "id": 26,
      "start": 1980.239990234375,
      "end": 1985.0799865722656,
      "text": " of what God, the Lord Jesus Christ, the head of the church, says to this church about who"
    },
    {
      "id": 27,
      "start": 1985.0799865722656,
      "end": 1992.9199829101562,
      "text": " he is, his person. That we'd be reminded that we serve God of the universe. The one who"
    },
    {
      "id": 28,
      "start": 1992.9199829101562,
      "end": 1996.7999877929688,
      "text": " is holy, the one that is true, the one who has all power, that knows all things, he is"
    },
    {
      "id": 29,
      "start": 1996.7999877929688,
      "end": 2003.9599914550781,
      "text": " king. That's the head of the church. And I'm so thankful for that. This evening he's called"
    },
    {
      "id": 30,
      "start": 2003.9599914550781,
      "end": 2011.8799896240234,
      "text": " us to remain faithful. He's called us to do his work, to hold fast, to maintain a testimony"
    },
    {
      "id": 31,
      "start": 2011.8799896240234,
      "end": 2019.47998046875,
      "text": " that's pleasing and honoring to him. He'll comfort us in a time of our difficulty. He"
    },
    {
      "id": 32,
      "start": 2019.47998046875,
      "end": 2026.5199890136719,
      "text": " reminds us of eternity. He reminds us of victory. This evening those are good reminders for"
    },
    {
      "id": 33,
      "start": 2026.5199890136719,
      "end": 2035.759994506836,
      "text": " us. Oh, that we would have that desire to be a church that has God's favor, that God's"
    },
    {
      "id": 34,
      "start": 2035.759994506836,
      "end": 2045.3199920654297,
      "text": " hand of blessing is upon us corporately. It only happens if individually we have God's"
    },
    {
      "id": 35,
      "start": 2045.3199920654297,
      "end": 2052.8799896240234,
      "text": " hand upon us. Brother Jeff mentioned the verse this morning, talking about a recap from last"
    },
    {
      "id": 36,
      "start": 2052.8799896240234,
      "end": 2061.1199951171875,
      "text": " week, a little leaven leaveneth the whole lump. I went last week to the book of Joshua"
    },
    {
      "id": 37,
      "start": 2061.1199951171875,
      "end": 2072.239990234375,
      "text": " in the seventh chapter. There was sin in the camp. It was really just one man, Achan. Because"
    },
    {
      "id": 38,
      "start": 2072.239990234375,
      "end": 2080.6399841308594,
      "text": " of sin in the camp, God's hand of blessing was being pulled back. What did God say? Unless"
    },
    {
      "id": 39,
      "start": 2080.6399841308594,
      "end": 2086.5999755859375,
      "text": " you deal with it, I'm not going to fight for you anymore. You've got to deal with it."
    },
    {
      "id": 40,
      "start": 2086.5999755859375,
      "end": 2091.9199829101562,
      "text": " So Joshua made the right choice. He followed the leadership of God. And they dealt with"
    },
    {
      "id": 41,
      "start": 2091.9199829101562,
      "end": 2098.4400024414062,
      "text": " Achan the troubler of Israel. And then God's hand of favor and blessing was upon them again."
    },
    {
      "id": 42,
      "start": 2098.4400024414062,
      "end": 2105.1599731445312,
      "text": " Oh, that we would live our lives in such a way that God would be pleased, that God's"
    },
    {
      "id": 43,
      "start": 2105.1599731445312,
      "end": 2107.8399963378906,
      "text": " favor would be upon us. Let's pray. Father, we love you."
    }
  ],
  "processed_at": "2025-04-14T19:38:31.088872"
}