{
  "video_id": "KskHW1EZsM8",
  "text": "Five, and they left the stool up here. Joseph, I can be as tall as you, amen? Praise the Lord, glory. Could you imagine if I was this tall? Man, that's crazy. And to think about the first time, the first several times we ever sang as a family, Joseph would stand on that stool so that you could see him. Honestly, those of you that were here in the beginning, that when we got here, he had to stand on that stool and you'd be able to see him over the pulpit if he stood on the stool. And now we need to have him get on his knees and we'd all be around the same height, amen? But that's special. I appreciate that song so very much that Brianna and Lydia and Natalie sang. What a great truth, amen? First John chapter number five. First John chapter number five this morning. And be looking at verses 14 and 15 if you did notice on the back of the bulletin this morning, the title for the message, Confident Prayer. And I'm so thankful that as we study the book of First John and we've been studying this book all year and we've taken several weeks off here and there with other messages and what have you as the Lord has given leadership. But as we've studied the book of First John, several things have really stood out to us. Of course, we've used as our theme, walking in the light and the desire that we understand that God has for us to have fellowship with him, to abide in him. And what a joy to know that we are able to have fellowship with the God of the universe. That right there just should cause us to rejoice and to just be so thankful that God Almighty is interested in you as an individual. He's interested in me as an individual. Not only did he save me, but he also allows me to have fellowship with him as often as I desire. That's precious. But we know that as we study the book of First John that we've also understood that there are many things that God wants us to know. We find it as we study other portions of scripture that we find regularly that God will say something like this I would not have you be ignorant brethren. God wants his people to be informed. He wants us to have knowledge. And as we've studied through the book of First John, we've made note that this word know or to know or knowledge or knowing is a repeated word throughout the book of First John. And God wants us to know some things. As we study the fourth chapter, we found specifically and repeatedly that God wants us to know that he loves us. By the way, aren't you so thankful for the love of God? We sang this morning in Sunday school, Jesus loves me, this I know. For the Bible tells me so, amen. And God wants us to know some things. He wants us to be informed. He wants us to have that knowledge and knowledge gives us confidence. And we find that as we look at the passage of scripture that is before us this morning in verses 14 and 15, we find that God wants us to have confidence when it comes to this matter of prayer. And we find that he says this in verse 14, John under the inspiration of the Holy Spirit of God, he says, and this is the confidence that we have in him. Him is Jesus, the son of God. The exalted savior, the one who's coming back. And he says that we would have confidence in him that if we ask anything according to his will, he heareth us. And if we know that he hear us, whatsoever we ask, we know that we have the petitions that we desired of him. Confident prayer. John, the apostle, the disciple, he had the privilege of walking with the Lord Jesus Christ during his earthly ministry. He had the privilege of being an eyewitness to several of the miracles. And we find that even as John would begin writing this particular book, he says in verse number two, and let me begin in verse number one of chapter one. He says that which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked upon, and our hands have handled of the word of life. John was an eyewitness. He says in verse number two, for the life was manifested and we have seen it. And what do we do? We bear witness and show unto you that eternal life, which was with the father and was manifested unto us, that which we have seen and heard, declare we unto you that you also may have fellowship with us and truly our fellowship is with the father and with his son, Jesus Christ. And these things write we unto you, notice what he says, that your joy may be full. As you study scripture and you interpret scripture with scripture, you find that the psalmist says that in his presence is fullness of joy. And here the Bible says that ye, that your joy may be full. And we find that the importance of fellowship and understanding that John, he walked with the Lord Jesus Christ. He was really part of that inner circle, if you will. You think about the 12 disciples, but then you think often where the Bible speaks about Peter, James, and John. And the three of them had the opportunity to go in and see some miracles that others did not have the privilege of seeing, even some of the disciples as far as them being performed. We find that Peter, James, and John were the three that went with Jesus up on the Mount of Transfiguration. And we find that John had the privilege of walking with Christ. As he walked with the Lord Jesus Christ, not only did he have the privilege of hearing the teaching of Jesus, specifically with regard to our subject this morning with regard to prayer, but think about this, John had the privilege of observing the prayer life of the Lord Jesus Christ. Not only did John hear the instruction that Jesus would give with regard to prayer, remember what one question that the disciples asked Jesus, Lord, teach us, teach us to pray, teach us to pray. We find that John received that instruction, but John also observed the prayer life of Jesus. And we often understand in John 18, I referenced it when we looked at the truth of the Garden of Gethsemane, when Jesus was in Jerusalem, he oft would go to that place and that was his prayer closet, if you will, when he was in Jerusalem. You find that when he's there around the region of Galilee that he would enter and he'd go into a mountain somewhere and he'd pray, and you'd find that Jesus was giving that great example. The text that is before us this morning here in 1 John 5, verses 14 and 15 really mirrors the truth that John has stated earlier in this book. In 1 John 3, in verse number 22, you might look just a page over in your Bible and notice what he says here in 1 John 3, in verse number 22. And whatsoever we ask, we receive of him. But then notice what he says, because we keep his commandments and do those things that are pleasing in his sight. We find that as we're abiding in him and we're obeying him, that it leads to that confident prayer. And we see also here in 1 John 5 that he begins to deal with the importance of having confidence in prayer. Not only did John write that here under the inspiration of the Holy Spirit of God, but I wanna read to you what John would have heard the Lord Jesus Christ say before he went to the cross of Calvary. In John chapter number 14, oftentimes as we think about that portion of scripture or that chapter in the word of God, we think about verse number six where Jesus said, I am the way, the truth, and the life. No man cometh unto me, or no man cometh unto the Father, but by me. And it's a verse of scripture that we've often quoted and repeated and certainly an important verse of scripture. But just shortly after that, Jesus spoke these words in John 14, in verses 13 and 14, he says, and whatsoever ye shall ask in my name, that will I do that the Father may be glorified in the Son. If you shall ask anything in my name, I will do it. Begin to think about the promises that God has given us with regard to prayer. We begin to think about the privilege that God has given us as the people of God to enter into his presence, to understand the privilege of prayer. This morning as we begin to think about this confident prayer, I want you to just notice a few things. Notice with me first of all, and we've used it for the title, but also as we begin the message this morning, notice the confidence we are to have. In verse number 14 of 1 John chapter number five, he says, and this is the confidence that we have in him. Notice the confidence isn't in you, the confidence isn't necessarily in the prayer, meaning some kind of rote religion, if you could understand what I mean by that. It's not that somebody has written out some prayers and we have a prayer book or a prayer journal and there's some faith in those prayers or some confidence in those prayers. No, he says this is the confidence that we have in him, in the one that we're praying to. There are times that people say, well, I just don't know how to pray. It doesn't, I'm not sure, I'm not articulate, I'm not really good with my words. God knows that and God just wants to hear you pray. Our confidence is not in the eloquence of our prayer, our confidence is the one that we're praying to, amen. There's some times that people will hear somebody pray, by the way, think about the religious leaders of the day, they would stand and they would pray, oh, our God of Abraham, Isaac and Jacob and so on so forth, right? And what did Jesus say about those ones that prayed that way that everyone would see them? He said, they have their reward. You know what their reward was? Being seen of men. Somebody saying, oh, did you hear how he prayed? No, no. Our confidence is in him. And I'm so thankful that access to the throne room of heaven has been provided by the Lord Jesus Christ and that he desires that his children would pray, not only with confidence, but with boldness. We think about the truth of Hebrews four in verse number 16, where the Bible says that we're to enter with boldness and think about how we find it written here in Hebrews four and verse number 16, again, dealing with the fact that we have a great high priest, the Lord Jesus Christ that is ever living to make intercession for us. And he says in Hebrews four in verse number 16, let us therefore come boldly under the throne of grace, that we may obtain mercy and find grace to help in the time of need. We think about that word that he uses in Hebrews four in verse 16, that we would come boldly. And we think about this truth in verse 14, and this is the confidence. And really it's interesting, the word translated confidence and the word translated boldly are the same Greek word. God wants us to have confidence. He wants us to have that boldness as we enter into his presence. Why? Understanding that he ever lives to make intercession for us, understanding that there's one God and one mediator between man and God, the man, Christ Jesus. And I'm so thankful that we have direct access to God in prayer. I don't have to wait for someone else to be able to pray to God for. I don't have to go somewhere else. I can find any time, any place, anywhere for any reason, I can go to my God in prayer, in confidence. He says, then this is the confidence that we have in him. Paul says it this way in first Timothy chapter number two, when he talks about, first of all, that prayers and supplications will be made. He says this, I will therefore that men pray everywhere lifting up holy hands, and then he says this in verse number eight, without wrath and doubting. Without wrath and doubting. And so we find that we as the people of God, we are rejoicing and understanding that we have confidence in him. There are times in which we've had people that we've placed confidence in. The Bible talks about putting confidence in unfaithful man. It's like a foot out of joint. It's like a broken tooth. Listen, our God is faithful and it is never, as we think about in this passage of scripture, when we pray to him and we look to him and we have confidence in him that he hears us. We had testimony time on Tuesday evening for prayer, praise, and pie. There were many that were rejoicing and thanking God for hearing our prayers and for answering prayer. And Brianna made the statement that we can pray and he can hear all of us at the same time. God's never busy. It's never a situation where he doesn't hear us when we go to him in prayer, when he has that ability. You ever been in a situation where two people are talking to you at the same time? Most people say, hey listen, one at a time. God can hear all of us. And he knows exactly what we're praying. And we have confidence in him. Think about this truth. Turn to the book of Matthew, if you will. Look at what Jesus is teaching. This is during the Sermon on the Mount in Matthew 5, 6, and 7. And I want you to see what Jesus says here with regard to prayer. In Matthew chapter number 7, this ought to encourage you this morning and help us to have confidence. Notice in verse 7 of Matthew 7, Jesus begins and says this, ask and it shall be given you. Seek and ye shall find. Knock and it shall be opened unto you. For everyone that asketh receiveth, and he that seeketh findeth. And to him that knocketh it shall be opened. Notice what he says in verse number 9, or what man is there of you whom if his son ask bread, will he give him a stone? Isn't that a great example, analogy? Hey listen, if your son asks you for bread, are you going to give him a stone? Surely not. Notice in verse number 10, or if he ask a fish, will he give him a serpent? If ye then, verse number 11, being evil, know how to give good gifts unto your children. Notice these three words, how much more? How much more shall your Father which is in heaven give good things to them that ask him? Isn't that wonderful? He says listen, you, I mean compared to God and His holiness, he says you're evil and you know how to give good gifts. If your son comes and says can I have bread, you're not going to give him a stone. If he asks for a fish, you're not going to give him a serpent. And so how much more shall your Father which is in heaven give good things to them that ask him? Wow, the confidence that we're to have in knowing that He hears us. How many times, and we don't have the time this morning to look at the examples, but how many times as we read the word of God do we read where the Bible tells us that God heard their prayers. In fact, we find right here in this passage of Scripture in 1 John 5, it says that this is the confidence that we have in Him that if we ask anything according to His will, He heareth us. And if we know that He heareth us whatsoever we ask, we know that we have the petitions that we desired of Him. God wants His children to have confidence when we pray. I remember as a child, my parents aren't here, they're traveling, I don't think they're watching live stream this morning, but I don't mind if they are or if you tell them, it's not a secret. But sometimes children, and I remember being this way, sometimes children have more confidence asking mom for something than asking dad for something. Any of you ever had that experience? And I had that experience as a child, I'd go ask my mom for certain things and she'd say this, ask dad. Like, well, you know, could you do it for me? You know, that kind of thing, right? And I know even sometimes for my children, they'll ask Holly something before they might ask me. Brianna's smiling and Joseph is kind of holding back a smile back there. And I don't know why that is, why that's so standard, just a typical nature, human nature. But understand this morning that though as humans there are times that we might not have confidence asking somebody, when we think about the truth of my relationship with the God of the universe, because I've been saved, I'm His child, I'm to have absolute confidence. Notice what he says in chapter number three of this book, and then we'll get into the next point. In 1 John chapter number three, and I want this to sink in this morning when we think about this truth of having confidence in prayer, because really it all is leading up to this passage that we're looking at with this confidence in prayer. I mentioned about the fourth chapter, knowing that He loves us, but notice what He says in verse number one of 1 John chapter three. Behold, what manner of love the Father hath bestowed upon us, and then notice this, that we should be called the sons of God. Therefore the world knoweth us not, because it knew Him not. Beloved, now are we the sons of God, and it doth not yet appear what we shall be, but we know that when He shall appear, we shall be like Him, for we shall see Him as He is. He then talks about purity in the next verse of Scripture and how important that is, but I want you to understand this morning when we think about this confident prayer that we understand I'm His child. How did I become His son? By trusting the Lord Jesus Christ as my personal Savior. This morning if you know that you're a son of His, that you've trusted, you've placed your faith and trust in the Lord Jesus Christ and He is your Savior, the Bible says that you are His son. You're His child. You're His son or His daughter. You are His child and you are to have confidence that you can go to Him in prayer. Isn't that awesome? Notice as we continue looking at the passage of Scripture, we notice that there is a condition stated. Number one, we notice the confidence we are to have. Number two, we notice the condition that is stated. The Bible says this, and this is the confidence, verse 14, that we have in Him, that if we ask anything and then notice this phrase, according to His will, He heareth us. And if we know that He heareth us, what shall we ask? We know that we have the petitions that we desired of Him. Some people say, well, I said if you ask, you're going to receive. I asked Him for a million bucks and I'm waiting for my million dollars. That's not what the Bible teaches. Amen? Now God might bless you with a million dollars and that's perfectly fine if God would do that because He knows that He can entrust you with that and that you would use it for His honor and for His glory. But we understand that as we look here at the passage of Scripture that there is this condition that is stated that He says that it's according to His will. And so the believer, the child of God, the one that has that relationship with the God of Heaven that understands that they can come in confidence in Him, come in boldness through the throne of grace, we are to pray according to His will. So the big question then would be how How do we know His will? Through His Word. God has revealed to us in His Word, His will. We find that we have, Paul says in the church in Corinth, we have the mind of Christ. He says this, let this mind be in you, which was also in Christ Jesus in Philippians chapter number 2. And we find that we have the very Word of God and as we desire to know the will of God, as we desire to pray according to the will of God, we dig into the Word of God and we discover the will of God. Paul prayed that this thorn in his side would depart from him, but God said my grace is sufficient. So we find that in that passage of scripture in 2 Corinthians chapter number 12, that it was not the will of God to deliver Paul from that thorn in his side. Could God have delivered him? No. But Paul learned a great lesson in not being delivered by that thorn in his side, but understanding that God said my grace is sufficient for you. So we begin to understand how is it that we would pray according to His will. Well we understand the condition that is stated here in 1 John chapter number 5, but we also understand this is what Jesus taught. Go over to the book of Luke if you will, we'll look at a couple of verses of scripture in the book of Luke, and understand this is what Jesus taught, Luke chapter number 11. And understand that here in this passage of scripture is where we find the disciple that stands up and says, Lord teach us to pray. It was a certain place that they were, and one of His disciples said unto Him, Lord teach us to pray. I'm thankful that this disciple asked the Lord this pertinent, relevant question. We find that Jesus would give an answer, and He said to them in verse number 2, by the way this is not the Lord's prayer, this is a model prayer, and we find that Jesus says this in verse number 2, when ye pray, say, Our Father which art in heaven, hallowed be Thy name. You enter into His presence recognizing His holiness. He is holy, our God is holy, holy, holy, holy. We enter into His presence. By the way, because He is holy, He has given us the truth on how we approach Him. We don't just approach Him any old way we want. By the way, come back this evening, we'll be looking at Galatians chapter number 3, and answering a question in the Ask the Pastor series with regard to what meaneth the law. And really what we learn as we study the Old Testament with regard to our approach to God. So many people today are throwing the Old Testament out. It's not relevant, we don't need it. While God is the same yesterday and today and forever, I'm thankful that I don't have to follow the law, but the law does teach me some things, amen? And I'm thankful that Jesus fulfilled the law, glory, hallelujah, amen? But the reality is we find here that Jesus says, listen, recognize that you're entering into the presence of a thrice holy God. He says this, Thy kingdom come, notice this phrase, Thy will be done. As in heaven, so in earth. And so Jesus taught that we're to pray according to the will of God. Not only did Jesus teach that, but Jesus practiced that. Look over in Luke chapter number 22, if you will, in Luke chapter number 22, and we'll just look at one of the examples here when He's praying in the Garden of Gethsemane. The Bible tells us in verse number 39 of Luke chapter number 22, and He came out and went as He was wont to the Mount of Olives, and His disciples also followed Him, and so we find that He's there and Jesus is going to pray in the garden. He says to the disciples in verse number 40, when He was at the place, He said unto them, pray that ye enter not into temptation. And He was withdrawn from them about a stone's cast and kneeled down and prayed. Notice what He prayed. He had taught that they're to pray according to His will. He says, Father, if thou be willing, remove this cup from me, nevertheless not my will, but thine be done. By the way, I do not believe that Jesus was praying to not go to the cross. That's not what He was praying. Some people teach that. I do not believe that for one second. I believe that all of the forces of hell were trying to kill Jesus in the garden so that He could never make it to the cross. Because if He made it to the cross, that was the fulfillment of prophecy and that was what was required for man to be redeemed. Amen? And so we find that as we look here at this truth in Luke chapter number 22 and understand what He's praying, how would He pray? Why would He pray that He would not go to the cross? And Hebrews tells us that for the joy that was set before Him, He endured the cross, right? What was the joy? The fact that souls would be saved, lives would be changed. He said that He came to do the will of His Father. And He knew that from before the foundation of the world, that it was appointed that He would be the Lamb that was slain on the cross of Calvary. That was all for free, not part of the message on prayer. Amen? But I do not believe that's what Jesus was praying at all. He was praying according to the will of God and He knew that He was going to go to the cross of Calvary. And so we know that Jesus taught, Jesus not only taught, but He practiced this truth that is stated in 1 John 5 and verse number 14, the condition that we pray according to His will. We will not take the time this morning, but if you were to do a Bible study, you would find that if you go to the book of 1 Kings and chapter number 18 and then cross-reference that with James chapter number 5, you will find that Elijah prayed with confidence. Did he not? When you think about that showdown at Mount Carmel and all of those Baal worshipers came and all that was taking place there, and we find that there Elijah prayed with confidence and with boldness. Do you think that when Elijah prayed that he expected fire to fall from heaven? Hallelujah! I mean, I don't think he had one part of his being that doubted for one nanosecond that fire was not going to fall from heaven. Why? Because he said this when he prayed, I have done all of this according to Thy word. Elijah knew that he was praying according to the will of God. He was doing everything that he did was according to the will of God. And the Bible tells us in James chapter number 5 that Elijah is a man just like we're men, but the effectual fervent prayer of a righteous man availeth much. And Elijah prayed with confidence, he prayed with boldness, he prayed according to the will of God. And so we understand the confidence that we're to have, but we notice that there's a condition that is stated, and we begin to think about praying according to the will of God. Listen, as we think about praying according to the will of God, just a few thoughts this morning. Number one, it's God's will for all men to be saved. I believe that this morning. The Bible says that the Lord is not slack concerning His promises. Some men count slackness as He is not, He is long-suffering to us, we're not willing that any should perish, but that all should come to repentance. The Bible tells us in 1 Timothy chapter number 2 that His will is that all men would be saved. He says this, the Bible tells us in Romans chapter number 10, for whosoever shall call upon the name of the Lord shall be saved. So I can have confidence as the one giving the instruction when I share the gospel with someone and they understand that they're a sinner, they understand that they have violated the law of God and they are guilty, they understand that Jesus fulfilled all that was necessary for them to be saved, to be born again, and they understand that Jesus bled and died, He was buried and He rose again, and they place their faith and trust in the finished work of Christ at Calvary, that when I say to them, whosoever shall call upon the name of the Lord shall be saved, and I say something like this, how do you call upon the name of the Lord? You pray. And I can tell you that that's a prayer that is according to the will of God. Amen? Listen, let me tell you a prayer that's according to the will of God for your spiritual growth. You pray and ask God to help you grow spiritually, that's a prayer that's according to His will. God help me to grow. God, as I study Your Word, teach me Your Word, help me to understand Your Word, help me to grow in my faith. The Bible says, as newborn babes desire the sincere milk of the Word that ye may grow thereby, and as you desire to grow, as you pray, God, would you help me to grow, that is a prayer that is according to His will. That God would teach us, akin to the growing spiritually, that He would teach us, that He would guide us. The psalmist often prays, God, teach me Thy statutes, teach me Thy Word. Listen, when you go to the Word of God, you ought to be praying that God would teach you His will, and as you pray according to His will, He's teaching you the Word of God. It's amazing how this works. And we find that He would say, listen, if you would pray, God, would you be glorified in my life? Is that a prayer that's according to the will of God? Certainly it is. God, would you use me? Would you help me to be used of Thee? Would you help me to live my life in such a way that You would be glorified? So we'd say something like John the Baptist said, that he must increase, but I must decrease. God help me to glorify You. That's a prayer that's according to the will of God. That's a prayer that God desires to answer. God, would you help me to see others saved? Do you think that's a prayer that's according to the will of God? God give me opportunities. God help me to see the opportunities. By the way, I mentioned that we have some Christmas tracts that I put out. I gave out several of these yesterday. You'd see how responsive people were to receiving these. Why? Hey, Merry Christmas with a smile. By the way, don't be just a deadhead about it, but give a smile and give them a gospel tract. Tell them Merry Christmas. They're nice. They're attractive looking. Man, people took them. They appreciated it. Lord, give me opportunities. God, help me to speak to others about you. That's a prayer that's according to his will. Amen? Now, it may not be that praying, Lord, would you please relieve me of this ailment, this infirmity? The reality is that God might say that it's my will that you have that. See, we don't like that kind of thing. But Paul said this, that the things that happen to me happen for the furtherance of the gospel. There are times that we might have difficulties, and we might have health issues. We may have some other types of things going on in our lives, and God says, I can deliver you from that, but my will is for you to have that so that you can glorify me. Praying according to his will. Praying according to his will. Notice with me as we conclude in 1 John chapter 5, and I begin to think about this really cycle, if you will, and this praying and having confidence and knowing that God hears us, and then praying according to his will. I look at this passage of Scripture, and I've mentioned, number one, that we notice a confidence that we're to have. Number two, we notice the condition that is stated. But number three, if you're taking notes, we are to expect a closer walk with the Lord. Pastor, what do you mean by that? Well, I believe this is the product. We look at this wonderful promise that's given to us in 1 John 5, verses 14 and 15, and we begin to understand the privilege that we have of prayer, and we understand the promise that he's given us. I believe that the product will be a closer walk with the Lord. I've already mentioned this morning that it is the desire of God that we would abide in him. John chapter 15 deals with that quite extensively. We've looked at 1 John chapter number one already this morning, and we've understood that God's desire is that we would have fellowship with him. And so as I begin to think about this passage of Scripture, these two verses of Scripture, and this confidence that we're to have in prayer, and he says that if we know in verse number 15 that he hear us, whatsoever we ask, we know that we have the petitions that we desired of him, that we begin to understand that our God hears us, and we're to pray according to his will. And we said that in order to know his will, I spend time in his word. So think about this, if you will, with me, and I hope that I can effectively communicate this to you this morning. But as I spend time with God in his word, I'm able to determine what his will is. And as I'm determining his will, it's shaping and forming my prayer life. And as I'm praying now according to his will, I'm seeing him answer prayers in my life. And as he answers prayer in my life, as he answers prayer in your life, you know what it does? It increases your faith, but it also causes you to want to pray more. It causes you to want to know more the will of God to get into his word even more. And as we begin to see this truth that God is revealing to us in these couple of verses of Scripture this morning, and I believe that God wants us to understand this morning that not only do we have this wonderful promise that God has given us with regard to prayer, but really it is designed that we would be closer drawn to him. Understand this morning that God is not a genie. Some people have this idea, this make-believe idea that you get this genie, and you rub this bottle, and you get these wishes. And sometimes people treat God and treat prayer in that way. We don't think about praying until we need something. But as the people of God, when we understand that we're the sons of God, when we understand how much he loves us, and he wants us to abide in him, and he wants us to have fellowship with him, then I spend time in his word, and then I pray according to his will. It's interesting to me, the book of Proverbs, turn over there if you will, Proverbs chapter 22, and I want to draw a connection, and I hope that it helps you this morning. God help me with this, I was praying this morning, God help me to effectively communicate this thought this morning, because God help me with this as I prepared this message to understand how the promise and the privilege of prayer is really this product, this closer walk with God. And God desires us to be in his presence, to have this abiding walk with him. In Proverbs chapter 22, notice in verse number 17, and notice the phraseology, the Bible says this, bow down thine ear, and hear the words of the wise, and apply thine heart unto my knowledge. And I want you to think about the picture that is given there in verse number 17, as I've tried to draw the truth here of us trying to determine the will of God in the word of God. He says, bow down thine ear. Do you get the picture that I'm listening intently, that I'm listening intently, that I'm giving my attention to being able to hear, and to be able to know what God desires us to know. We find that here Solomon, of course, is speaking to his son, but I believe that the greater picture of the book of Proverbs is not just Solomon speaking to Rehoboam, but God speaking to us as his children. And we find that he says, bow down thine ear. Listen, sometimes we are so swift to speak, and slow to hear, but the reality is that we're to be slow to speak and swift to hear. That's what God tells us. Listen for the still, small voice. Be still and know that I am God. As we get into His presence, and we're bowing down our ear to understand His will, but then notice what the psalmist says, turn to the book of Psalms, if you will, in Psalm 86, I want you to see what is said here. And I hope again, that it would help you this morning, because as I am spending time in His word, as I'm bowing down mine ear to hear and to understand, and to learn what the will of God is, that will then shape my prayer life, because I am to pray according to His will. And we know that if we pray according to His will, that He's going to answer. And I see prayers answered in my life, and I'm encouraged, and I'm strengthened, and my faith is increased, and I'm drawn closer to Him, and I'm praying more, and I'm seeking Him more. And it's a wonderful result, a product of this privilege and this promise that He's given us of prayer. But I want you to notice what the psalmist says in Psalm 86. We read what the wise man said in Proverbs about us bowing down our ear to His word. But notice what the psalmist says in verse one of Psalm 86. \"'Bow down thine ear, O Lord. \"'Hear me, for I am poor and needy.'\" We want God to bow down His ear to hear our prayers, but we must first bow down our ear to understand His will. And as I bow down mine ear to understand His will, and I pray according to His will, I can have confidence that He's gonna bow down His ear to hear my prayer and to answer my prayer. For indeed, I can relate to the psalmist, I am poor and needy, amen. And we find that as God has given us this privilege and this promise of prayer, and He wants us to have confidence, but really when we dig in and we understand what He's packaging for us and how He's giving us and providing this truth for us, He's really leading us to a place where I'm developing a closer walk with Him, just a closer walk with Him. Listen, this ought to be not only the expectation, but it ought to be the desire of every child of God to be closer drawn to my Savior, that I would be in His presence. See, I don't want to just be a nominal Christian. I don't want to just be a surface flounder around, just kind of convenient Christian. I want to be all in. I want to be close to my God. And I have the promise that He's given that if we draw nigh to Him, He'll draw nigh to us. And when we understand this truth of prayer, it's not just so that we can give our whole list of wants and whatever. No, no, no, we begin to say, I'm praying according to His will. How often I would challenge myself and I would challenge you this morning to evaluate your prayer life and see how much of it is according to His will. I mentioned before about praying out loud. I mentioned also about recording yourself praying. I'm not sure if anyone's ever taken me up on that suggestion. I've done it personally. I've taken my phone and I've started record and I've prayed out loud. If I could go back and hear. Why? It helps me to be able to evaluate, am I praying according to His will? Am I rambling? Am I just all over the place? Is there some direction in my prayer? I wouldn't do it every week, personally. It was convicting, but it was helpful because we're to pray according to His will. And as we pray according to His will, we have this great promise. And as we see God answer prayer, listen, I hope it works this way in your life, it works this way in my life. When I see God answer prayer, I desire to pray more. You see God answer prayer, and you see God answer prayer, and you're drawn closer to Him, and you're studying His word, and you're learning His will, and you're praying according to His will, and you're seeing Him answer prayer, and you're just drawn closer and closer and closer to God. We find that we're to walk with Him. Enoch had this testimony. He walked with God, and he was not, for God took him. Noah was a man that walked with God. We could begin to look at other examples in the Word of God of those that walked with God. And we find this morning that we're to have confidence in prayer. There's a condition that is stated, but what thrills my soul is this product, this closer walk with God. And I hope this morning that it's not only something that we can expect to be the product, but it is something that I truly desire, that you truly desire, a closer walk with Thee. Let's pray together. Father, we love You. We thank You so much for loving us. We thank You for the privilege of being able to gather together this morning. We thank You for the truth of Your Word. God, we thank You that You're a God who hears and answers prayer. We're thankful that You're able to do exceeding abundantly above all that we ask or think. We thank You for the countless promises that You've given us in Your Word with regard to answered prayer. We thank You for the multitudes of examples that You've given us in Your Word of You answering prayer, of responding to those of Your children that have prayed with those words, I have heard Thy prayer. God, I pray that You'd help us to understand this morning the great privilege that is ours to pray. I pray, God, that You'd help us to understand this morning this promise that You've given to us and the condition that is stated with regard to the according to His will. God, I pray that as we desire to be people of prayer, men and women of prayer, boys and girls of prayer, that God, we would seek Your will through Your Word so that we would truly pray according to Your will. God, I pray that as we see You answer, see You work and move, as we pray according to Your will and You answer in mighty ways, God, it's my prayer that it would cause us to draw closer to Thee. I pray that that would be the desire of every individual that's present this morning. Lord, if there's one that's not sure of heaven, they've never trusted the Lord Jesus Christ as their personal Savior. We know that it is Your will that they would be saved. It is our prayer this morning that You would save them, Lord, that they would understand that the Holy Spirit of God would convict them of their sin and of Christ's righteousness and of judgment to come. They would understand that they're a sinner and there's only one Savior, His name is Jesus. He lived a perfect and sinless life. He went to a cruel cross. He bled and He died. He was buried in a borrowed tomb and He rose conquering sin, death, and the grave. There's one here, one on livestream that's not sure of heaven. God, would You save them today? Would You help them to call out to Thee? Would they take the promise that's been given, for whosoever shall call upon the name of the Lord shall be saved? Father for every child of God, every one that's here that's been saved, that's been born again, I pray that we desire to have a closer walk with Thee. Lord, that You'd help us to get into Your Word, dig into Your Word to know Your will and then to pray according to Thy will. In these few moments of invitation, we pray that You'd have Your will in way, that You'd work as only You can and we'll be careful to give You the honor and glory for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 1.7200000286102295,
      "text": " Five, and they left the stool up here."
    },
    {
      "id": 1,
      "start": 1.7200000286102295,
      "end": 4.760000228881836,
      "text": " Joseph, I can be as tall as you, amen?"
    },
    {
      "id": 2,
      "start": 4.760000228881836,
      "end": 7.679999828338623,
      "text": " Praise the Lord, glory."
    },
    {
      "id": 3,
      "start": 7.679999828338623,
      "end": 9.140000343322754,
      "text": " Could you imagine if I was this tall?"
    },
    {
      "id": 4,
      "start": 9.140000343322754,
      "end": 10.4399995803833,
      "text": " Man, that's crazy."
    },
    {
      "id": 5,
      "start": 10.4399995803833,
      "end": 15.4399995803833,
      "text": " And to think about the first time,"
    },
    {
      "id": 6,
      "start": 15.920000076293945,
      "end": 19.100000381469727,
      "text": " the first several times we ever sang as a family,"
    },
    {
      "id": 7,
      "start": 19.100000381469727,
      "end": 22.84000015258789,
      "text": " Joseph would stand on that stool so that you could see him."
    },
    {
      "id": 8,
      "start": 23.719999313354492,
      "end": 26.719999313354492,
      "text": " Honestly, those of you that were here in the beginning,"
    },
    {
      "id": 9,
      "start": 26.719999313354492,
      "end": 30.040000915527344,
      "text": " that when we got here, he had to stand on that stool"
    },
    {
      "id": 10,
      "start": 30.040000915527344,
      "end": 32.79999923706055,
      "text": " and you'd be able to see him over the pulpit"
    },
    {
      "id": 11,
      "start": 32.79999923706055,
      "end": 34.400001525878906,
      "text": " if he stood on the stool."
    },
    {
      "id": 12,
      "start": 34.400001525878906,
      "end": 37.959999084472656,
      "text": " And now we need to have him get on his knees"
    },
    {
      "id": 13,
      "start": 37.959999084472656,
      "end": 40.560001373291016,
      "text": " and we'd all be around the same height, amen?"
    },
    {
      "id": 14,
      "start": 40.560001373291016,
      "end": 42.2400016784668,
      "text": " But that's special."
    },
    {
      "id": 15,
      "start": 42.2400016784668,
      "end": 45.2400016784668,
      "text": " I appreciate that song so very much"
    },
    {
      "id": 16,
      "start": 45.2400016784668,
      "end": 49.099998474121094,
      "text": " that Brianna and Lydia and Natalie sang."
    },
    {
      "id": 17,
      "start": 49.099998474121094,
      "end": 51.119998931884766,
      "text": " What a great truth, amen?"
    },
    {
      "id": 18,
      "start": 51.119998931884766,
      "end": 52.599998474121094,
      "text": " First John chapter number five."
    },
    {
      "id": 19,
      "start": 52.599998474121094,
      "end": 55.0,
      "text": " First John chapter number five this morning."
    },
    {
      "id": 20,
      "start": 55.0,
      "end": 56.91999816894531,
      "text": " And be looking at verses 14 and 15"
    },
    {
      "id": 21,
      "start": 56.91999816894531,
      "end": 59.47999954223633,
      "text": " if you did notice on the back of the bulletin this morning,"
    },
    {
      "id": 22,
      "start": 59.47999954223633,
      "end": 62.52000045776367,
      "text": " the title for the message, Confident Prayer."
    },
    {
      "id": 23,
      "start": 62.52000045776367,
      "end": 64.87999725341797,
      "text": " And I'm so thankful that as we study the book of First John"
    },
    {
      "id": 24,
      "start": 64.87999725341797,
      "end": 66.83999633789062,
      "text": " and we've been studying this book all year"
    },
    {
      "id": 25,
      "start": 66.83999633789062,
      "end": 69.58000183105469,
      "text": " and we've taken several weeks off here and there"
    },
    {
      "id": 26,
      "start": 69.58000183105469,
      "end": 71.95999908447266,
      "text": " with other messages and what have you"
    },
    {
      "id": 27,
      "start": 71.95999908447266,
      "end": 73.76000213623047,
      "text": " as the Lord has given leadership."
    },
    {
      "id": 28,
      "start": 73.76000213623047,
      "end": 75.4000015258789,
      "text": " But as we've studied the book of First John,"
    },
    {
      "id": 29,
      "start": 75.4000015258789,
      "end": 77.5199966430664,
      "text": " several things have really stood out to us."
    },
    {
      "id": 30,
      "start": 77.5199966430664,
      "end": 80.16000366210938,
      "text": " Of course, we've used as our theme, walking in the light"
    },
    {
      "id": 31,
      "start": 80.16000366210938,
      "end": 83.63999938964844,
      "text": " and the desire that we understand that God has for us"
    },
    {
      "id": 32,
      "start": 83.63999938964844,
      "end": 87.04000091552734,
      "text": " to have fellowship with him, to abide in him."
    },
    {
      "id": 33,
      "start": 87.04000091552734,
      "end": 91.87999725341797,
      "text": " And what a joy to know that we are able to have fellowship"
    },
    {
      "id": 34,
      "start": 91.87999725341797,
      "end": 93.87999725341797,
      "text": " with the God of the universe."
    },
    {
      "id": 35,
      "start": 93.87999725341797,
      "end": 96.31999969482422,
      "text": " That right there just should cause us to rejoice"
    },
    {
      "id": 36,
      "start": 96.31999969482422,
      "end": 100.13999938964844,
      "text": " and to just be so thankful that God Almighty"
    },
    {
      "id": 37,
      "start": 100.13999938964844,
      "end": 102.87999725341797,
      "text": " is interested in you as an individual."
    },
    {
      "id": 38,
      "start": 102.87999725341797,
      "end": 104.62000274658203,
      "text": " He's interested in me as an individual."
    },
    {
      "id": 39,
      "start": 104.62000274658203,
      "end": 107.68000030517578,
      "text": " Not only did he save me, but he also allows me"
    },
    {
      "id": 40,
      "start": 107.68000030517578,
      "end": 112.63999938964844,
      "text": " to have fellowship with him as often as I desire."
    },
    {
      "id": 41,
      "start": 112.63999938964844,
      "end": 114.36000061035156,
      "text": " That's precious."
    },
    {
      "id": 42,
      "start": 114.36000061035156,
      "end": 116.26000213623047,
      "text": " But we know that as we study the book of First John"
    },
    {
      "id": 43,
      "start": 116.26000213623047,
      "end": 118.37999725341797,
      "text": " that we've also understood that there are many things"
    },
    {
      "id": 44,
      "start": 118.37999725341797,
      "end": 120.19999694824219,
      "text": " that God wants us to know."
    },
    {
      "id": 45,
      "start": 120.19999694824219,
      "end": 122.55999755859375,
      "text": " We find it as we study other portions of scripture"
    },
    {
      "id": 46,
      "start": 122.55999755859375,
      "end": 126.23999786376953,
      "text": " that we find regularly that God will say something like this"
    },
    {
      "id": 47,
      "start": 126.23999786376953,
      "end": 129.55999755859375,
      "text": " I would not have you be ignorant brethren."
    },
    {
      "id": 48,
      "start": 129.55999755859375,
      "end": 132.39999389648438,
      "text": " God wants his people to be informed."
    },
    {
      "id": 49,
      "start": 132.39999389648438,
      "end": 134.39999389648438,
      "text": " He wants us to have knowledge."
    },
    {
      "id": 50,
      "start": 134.39999389648438,
      "end": 137.16000366210938,
      "text": " And as we've studied through the book of First John,"
    },
    {
      "id": 51,
      "start": 137.16000366210938,
      "end": 140.8000030517578,
      "text": " we've made note that this word know or to know"
    },
    {
      "id": 52,
      "start": 140.8000030517578,
      "end": 144.55999755859375,
      "text": " or knowledge or knowing is a repeated word"
    },
    {
      "id": 53,
      "start": 144.55999755859375,
      "end": 146.44000244140625,
      "text": " throughout the book of First John."
    },
    {
      "id": 54,
      "start": 146.44000244140625,
      "end": 149.0399932861328,
      "text": " And God wants us to know some things."
    },
    {
      "id": 55,
      "start": 149.0399932861328,
      "end": 150.67999267578125,
      "text": " As we study the fourth chapter,"
    },
    {
      "id": 56,
      "start": 150.67999267578125,
      "end": 153.44000244140625,
      "text": " we found specifically and repeatedly"
    },
    {
      "id": 57,
      "start": 153.44000244140625,
      "end": 156.1999969482422,
      "text": " that God wants us to know that he loves us."
    },
    {
      "id": 58,
      "start": 156.1999969482422,
      "end": 159.0399932861328,
      "text": " By the way, aren't you so thankful for the love of God?"
    },
    {
      "id": 59,
      "start": 159.0399932861328,
      "end": 160.83999633789062,
      "text": " We sang this morning in Sunday school,"
    },
    {
      "id": 60,
      "start": 160.83999633789062,
      "end": 165.1199951171875,
      "text": " Jesus loves me, this I know."
    },
    {
      "id": 61,
      "start": 165.1199951171875,
      "end": 168.47999572753906,
      "text": " For the Bible tells me so, amen."
    },
    {
      "id": 62,
      "start": 168.47999572753906,
      "end": 170.47999572753906,
      "text": " And God wants us to know some things."
    },
    {
      "id": 63,
      "start": 171.1199951171875,
      "end": 171.9600067138672,
      "text": " He wants us to be informed."
    },
    {
      "id": 64,
      "start": 171.9600067138672,
      "end": 173.36000061035156,
      "text": " He wants us to have that knowledge"
    },
    {
      "id": 65,
      "start": 173.36000061035156,
      "end": 176.52000427246094,
      "text": " and knowledge gives us confidence."
    },
    {
      "id": 66,
      "start": 176.52000427246094,
      "end": 179.36000061035156,
      "text": " And we find that as we look at the passage of scripture"
    },
    {
      "id": 67,
      "start": 179.36000061035156,
      "end": 182.27999877929688,
      "text": " that is before us this morning in verses 14 and 15,"
    },
    {
      "id": 68,
      "start": 182.27999877929688,
      "end": 184.9600067138672,
      "text": " we find that God wants us to have confidence"
    },
    {
      "id": 69,
      "start": 184.9600067138672,
      "end": 187.36000061035156,
      "text": " when it comes to this matter of prayer."
    },
    {
      "id": 70,
      "start": 187.36000061035156,
      "end": 189.60000610351562,
      "text": " And we find that he says this in verse 14,"
    },
    {
      "id": 71,
      "start": 189.60000610351562,
      "end": 192.0,
      "text": " John under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 72,
      "start": 192.0,
      "end": 197.0,
      "text": " he says, and this is the confidence that we have in him."
    },
    {
      "id": 73,
      "start": 197.0399932861328,
      "end": 200.36000061035156,
      "text": " Him is Jesus, the son of God."
    },
    {
      "id": 74,
      "start": 201.1999969482422,
      "end": 203.83999633789062,
      "text": " The exalted savior, the one who's coming back."
    },
    {
      "id": 75,
      "start": 203.83999633789062,
      "end": 207.16000366210938,
      "text": " And he says that we would have confidence in him"
    },
    {
      "id": 76,
      "start": 207.16000366210938,
      "end": 212.16000366210938,
      "text": " that if we ask anything according to his will,"
    },
    {
      "id": 77,
      "start": 214.24000549316406,
      "end": 216.1199951171875,
      "text": " he heareth us."
    },
    {
      "id": 78,
      "start": 216.1199951171875,
      "end": 219.36000061035156,
      "text": " And if we know that he hear us,"
    },
    {
      "id": 79,
      "start": 219.36000061035156,
      "end": 224.22000122070312,
      "text": " whatsoever we ask, we know that we have the petitions"
    },
    {
      "id": 80,
      "start": 224.22000122070312,
      "end": 227.39999389648438,
      "text": " that we desired of him."
    },
    {
      "id": 81,
      "start": 227.39999389648438,
      "end": 229.0,
      "text": " Confident prayer."
    },
    {
      "id": 82,
      "start": 229.0399932861328,
      "end": 232.0,
      "text": " John, the apostle, the disciple,"
    },
    {
      "id": 83,
      "start": 232.0,
      "end": 235.9199981689453,
      "text": " he had the privilege of walking with the Lord Jesus Christ"
    },
    {
      "id": 84,
      "start": 235.9199981689453,
      "end": 237.60000610351562,
      "text": " during his earthly ministry."
    },
    {
      "id": 85,
      "start": 237.60000610351562,
      "end": 240.0,
      "text": " He had the privilege of being an eyewitness"
    },
    {
      "id": 86,
      "start": 240.0,
      "end": 241.52000427246094,
      "text": " to several of the miracles."
    },
    {
      "id": 87,
      "start": 241.52000427246094,
      "end": 244.6999969482422,
      "text": " And we find that even as John would begin writing"
    },
    {
      "id": 88,
      "start": 244.6999969482422,
      "end": 249.0,
      "text": " this particular book, he says in verse number two,"
    },
    {
      "id": 89,
      "start": 249.0,
      "end": 250.6999969482422,
      "text": " and let me begin in verse number one of chapter one."
    },
    {
      "id": 90,
      "start": 250.6999969482422,
      "end": 252.0399932861328,
      "text": " He says that which was from the beginning,"
    },
    {
      "id": 91,
      "start": 252.0399932861328,
      "end": 255.5399932861328,
      "text": " which we have heard, which we have seen with our eyes,"
    },
    {
      "id": 92,
      "start": 255.5399932861328,
      "end": 257.0400085449219,
      "text": " which we have looked upon,"
    },
    {
      "id": 93,
      "start": 257.0400085449219,
      "end": 260.760009765625,
      "text": " and our hands have handled of the word of life."
    },
    {
      "id": 94,
      "start": 260.760009765625,
      "end": 262.20001220703125,
      "text": " John was an eyewitness."
    },
    {
      "id": 95,
      "start": 262.20001220703125,
      "end": 263.1600036621094,
      "text": " He says in verse number two,"
    },
    {
      "id": 96,
      "start": 263.1600036621094,
      "end": 267.260009765625,
      "text": " for the life was manifested and we have seen it."
    },
    {
      "id": 97,
      "start": 267.260009765625,
      "end": 268.1000061035156,
      "text": " And what do we do?"
    },
    {
      "id": 98,
      "start": 268.1000061035156,
      "end": 273.0799865722656,
      "text": " We bear witness and show unto you that eternal life,"
    },
    {
      "id": 99,
      "start": 273.0799865722656,
      "end": 277.4599914550781,
      "text": " which was with the father and was manifested unto us,"
    },
    {
      "id": 100,
      "start": 277.4599914550781,
      "end": 279.8800048828125,
      "text": " that which we have seen and heard,"
    },
    {
      "id": 101,
      "start": 279.8800048828125,
      "end": 283.0799865722656,
      "text": " declare we unto you that you also may have fellowship"
    },
    {
      "id": 102,
      "start": 283.0799865722656,
      "end": 286.9599914550781,
      "text": " with us and truly our fellowship is with the father"
    },
    {
      "id": 103,
      "start": 287.760009765625,
      "end": 288.9599914550781,
      "text": " and with his son, Jesus Christ."
    },
    {
      "id": 104,
      "start": 288.9599914550781,
      "end": 292.0,
      "text": " And these things write we unto you,"
    },
    {
      "id": 105,
      "start": 292.0,
      "end": 297.0,
      "text": " notice what he says, that your joy may be full."
    },
    {
      "id": 106,
      "start": 297.7200012207031,
      "end": 299.79998779296875,
      "text": " As you study scripture and you interpret scripture"
    },
    {
      "id": 107,
      "start": 299.79998779296875,
      "end": 301.9800109863281,
      "text": " with scripture, you find that the psalmist says"
    },
    {
      "id": 108,
      "start": 301.9800109863281,
      "end": 306.0,
      "text": " that in his presence is fullness of joy."
    },
    {
      "id": 109,
      "start": 306.0,
      "end": 308.3999938964844,
      "text": " And here the Bible says that ye,"
    },
    {
      "id": 110,
      "start": 308.3999938964844,
      "end": 310.239990234375,
      "text": " that your joy may be full."
    },
    {
      "id": 111,
      "start": 310.239990234375,
      "end": 313.6400146484375,
      "text": " And we find that the importance of fellowship"
    },
    {
      "id": 112,
      "start": 313.6400146484375,
      "end": 315.2799987792969,
      "text": " and understanding that John,"
    },
    {
      "id": 113,
      "start": 315.32000732421875,
      "end": 317.4800109863281,
      "text": " he walked with the Lord Jesus Christ."
    },
    {
      "id": 114,
      "start": 317.4800109863281,
      "end": 319.8800048828125,
      "text": " He was really part of that inner circle, if you will."
    },
    {
      "id": 115,
      "start": 319.8800048828125,
      "end": 321.44000244140625,
      "text": " You think about the 12 disciples,"
    },
    {
      "id": 116,
      "start": 321.44000244140625,
      "end": 323.9200134277344,
      "text": " but then you think often where the Bible speaks"
    },
    {
      "id": 117,
      "start": 323.9200134277344,
      "end": 327.3999938964844,
      "text": " about Peter, James, and John."
    },
    {
      "id": 118,
      "start": 327.3999938964844,
      "end": 329.8999938964844,
      "text": " And the three of them had the opportunity to go in"
    },
    {
      "id": 119,
      "start": 329.8999938964844,
      "end": 332.4599914550781,
      "text": " and see some miracles that others did not have"
    },
    {
      "id": 120,
      "start": 332.4599914550781,
      "end": 335.3999938964844,
      "text": " the privilege of seeing, even some of the disciples"
    },
    {
      "id": 121,
      "start": 335.3999938964844,
      "end": 336.6000061035156,
      "text": " as far as them being performed."
    },
    {
      "id": 122,
      "start": 336.6000061035156,
      "end": 339.0,
      "text": " We find that Peter, James, and John were the three"
    },
    {
      "id": 123,
      "start": 339.0,
      "end": 342.32000732421875,
      "text": " that went with Jesus up on the Mount of Transfiguration."
    },
    {
      "id": 124,
      "start": 342.32000732421875,
      "end": 344.6400146484375,
      "text": " And we find that John had the privilege"
    },
    {
      "id": 125,
      "start": 344.6400146484375,
      "end": 346.2799987792969,
      "text": " of walking with Christ."
    },
    {
      "id": 126,
      "start": 346.2799987792969,
      "end": 348.6400146484375,
      "text": " As he walked with the Lord Jesus Christ,"
    },
    {
      "id": 127,
      "start": 348.6400146484375,
      "end": 351.0,
      "text": " not only did he have the privilege of hearing"
    },
    {
      "id": 128,
      "start": 351.0,
      "end": 354.8800048828125,
      "text": " the teaching of Jesus, specifically with regard"
    },
    {
      "id": 129,
      "start": 354.8800048828125,
      "end": 357.67999267578125,
      "text": " to our subject this morning with regard to prayer,"
    },
    {
      "id": 130,
      "start": 357.67999267578125,
      "end": 360.8800048828125,
      "text": " but think about this, John had the privilege"
    },
    {
      "id": 131,
      "start": 360.8800048828125,
      "end": 365.55999755859375,
      "text": " of observing the prayer life of the Lord Jesus Christ."
    },
    {
      "id": 132,
      "start": 366.6000061035156,
      "end": 370.7200012207031,
      "text": " Not only did John hear the instruction"
    },
    {
      "id": 133,
      "start": 370.7200012207031,
      "end": 374.1199951171875,
      "text": " that Jesus would give with regard to prayer,"
    },
    {
      "id": 134,
      "start": 374.1199951171875,
      "end": 377.7200012207031,
      "text": " remember what one question that the disciples asked Jesus,"
    },
    {
      "id": 135,
      "start": 377.7200012207031,
      "end": 382.7200012207031,
      "text": " Lord, teach us, teach us to pray, teach us to pray."
    },
    {
      "id": 136,
      "start": 384.20001220703125,
      "end": 387.1600036621094,
      "text": " We find that John received that instruction,"
    },
    {
      "id": 137,
      "start": 387.1600036621094,
      "end": 391.7200012207031,
      "text": " but John also observed the prayer life of Jesus."
    },
    {
      "id": 138,
      "start": 391.7200012207031,
      "end": 395.6000061035156,
      "text": " And we often understand in John 18, I referenced it"
    },
    {
      "id": 139,
      "start": 395.6000061035156,
      "end": 398.44000244140625,
      "text": " when we looked at the truth of the Garden of Gethsemane,"
    },
    {
      "id": 140,
      "start": 398.44000244140625,
      "end": 403.0799865722656,
      "text": " when Jesus was in Jerusalem, he oft would go to that place"
    },
    {
      "id": 141,
      "start": 403.0799865722656,
      "end": 405.9599914550781,
      "text": " and that was his prayer closet, if you will,"
    },
    {
      "id": 142,
      "start": 405.9599914550781,
      "end": 407.0400085449219,
      "text": " when he was in Jerusalem."
    },
    {
      "id": 143,
      "start": 407.0400085449219,
      "end": 410.79998779296875,
      "text": " You find that when he's there around the region of Galilee"
    },
    {
      "id": 144,
      "start": 410.79998779296875,
      "end": 413.55999755859375,
      "text": " that he would enter and he'd go into a mountain somewhere"
    },
    {
      "id": 145,
      "start": 413.55999755859375,
      "end": 416.5799865722656,
      "text": " and he'd pray, and you'd find that Jesus"
    },
    {
      "id": 146,
      "start": 416.5799865722656,
      "end": 418.70001220703125,
      "text": " was giving that great example."
    },
    {
      "id": 147,
      "start": 418.70001220703125,
      "end": 420.8399963378906,
      "text": " The text that is before us this morning here"
    },
    {
      "id": 148,
      "start": 420.8399963378906,
      "end": 424.9200134277344,
      "text": " in 1 John 5, verses 14 and 15 really mirrors the truth"
    },
    {
      "id": 149,
      "start": 424.9200134277344,
      "end": 427.5199890136719,
      "text": " that John has stated earlier in this book."
    },
    {
      "id": 150,
      "start": 428.1600036621094,
      "end": 430.55999755859375,
      "text": " In 1 John 3, in verse number 22,"
    },
    {
      "id": 151,
      "start": 430.55999755859375,
      "end": 432.67999267578125,
      "text": " you might look just a page over in your Bible"
    },
    {
      "id": 152,
      "start": 432.67999267578125,
      "end": 436.6000061035156,
      "text": " and notice what he says here in 1 John 3, in verse number 22."
    },
    {
      "id": 153,
      "start": 437.6400146484375,
      "end": 441.0799865722656,
      "text": " And whatsoever we ask, we receive of him."
    },
    {
      "id": 154,
      "start": 441.0799865722656,
      "end": 442.6600036621094,
      "text": " But then notice what he says,"
    },
    {
      "id": 155,
      "start": 442.6600036621094,
      "end": 445.6000061035156,
      "text": " because we keep his commandments and do those things"
    },
    {
      "id": 156,
      "start": 445.6000061035156,
      "end": 448.17999267578125,
      "text": " that are pleasing in his sight."
    },
    {
      "id": 157,
      "start": 448.17999267578125,
      "end": 451.67999267578125,
      "text": " We find that as we're abiding in him and we're obeying him,"
    },
    {
      "id": 158,
      "start": 451.67999267578125,
      "end": 453.9200134277344,
      "text": " that it leads to that confident prayer."
    },
    {
      "id": 159,
      "start": 453.9200134277344,
      "end": 456.20001220703125,
      "text": " And we see also here in 1 John 5"
    },
    {
      "id": 160,
      "start": 456.20001220703125,
      "end": 458.5199890136719,
      "text": " that he begins to deal with the importance"
    },
    {
      "id": 161,
      "start": 458.5199890136719,
      "end": 460.760009765625,
      "text": " of having confidence in prayer."
    },
    {
      "id": 162,
      "start": 460.760009765625,
      "end": 463.0,
      "text": " Not only did John write that here"
    },
    {
      "id": 163,
      "start": 463.0,
      "end": 464.5,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 164,
      "start": 464.5,
      "end": 467.0,
      "text": " but I wanna read to you what John would have heard"
    },
    {
      "id": 165,
      "start": 467.0,
      "end": 470.0,
      "text": " the Lord Jesus Christ say before he went"
    },
    {
      "id": 166,
      "start": 470.0,
      "end": 471.55999755859375,
      "text": " to the cross of Calvary."
    },
    {
      "id": 167,
      "start": 471.55999755859375,
      "end": 473.9599914550781,
      "text": " In John chapter number 14,"
    },
    {
      "id": 168,
      "start": 473.9599914550781,
      "end": 476.5199890136719,
      "text": " oftentimes as we think about that portion of scripture"
    },
    {
      "id": 169,
      "start": 476.5199890136719,
      "end": 478.2799987792969,
      "text": " or that chapter in the word of God,"
    },
    {
      "id": 170,
      "start": 478.2799987792969,
      "end": 480.3999938964844,
      "text": " we think about verse number six where Jesus said,"
    },
    {
      "id": 171,
      "start": 480.3999938964844,
      "end": 481.9200134277344,
      "text": " I am the way, the truth, and the life."
    },
    {
      "id": 172,
      "start": 481.9200134277344,
      "end": 485.6000061035156,
      "text": " No man cometh unto me, or no man cometh unto the Father,"
    },
    {
      "id": 173,
      "start": 485.6400146484375,
      "end": 486.4800109863281,
      "text": " but by me."
    },
    {
      "id": 174,
      "start": 486.4800109863281,
      "end": 488.67999267578125,
      "text": " And it's a verse of scripture that we've often quoted"
    },
    {
      "id": 175,
      "start": 488.67999267578125,
      "end": 491.67999267578125,
      "text": " and repeated and certainly an important verse of scripture."
    },
    {
      "id": 176,
      "start": 491.67999267578125,
      "end": 493.4800109863281,
      "text": " But just shortly after that,"
    },
    {
      "id": 177,
      "start": 493.4800109863281,
      "end": 496.79998779296875,
      "text": " Jesus spoke these words in John 14,"
    },
    {
      "id": 178,
      "start": 496.79998779296875,
      "end": 498.760009765625,
      "text": " in verses 13 and 14, he says,"
    },
    {
      "id": 179,
      "start": 498.760009765625,
      "end": 502.20001220703125,
      "text": " and whatsoever ye shall ask in my name,"
    },
    {
      "id": 180,
      "start": 502.20001220703125,
      "end": 506.1199951171875,
      "text": " that will I do that the Father may be glorified in the Son."
    },
    {
      "id": 181,
      "start": 506.1199951171875,
      "end": 509.5199890136719,
      "text": " If you shall ask anything in my name, I will do it."
    },
    {
      "id": 182,
      "start": 509.5199890136719,
      "end": 512.52001953125,
      "text": " Begin to think about the promises that God has given us"
    },
    {
      "id": 183,
      "start": 512.52001953125,
      "end": 513.8800048828125,
      "text": " with regard to prayer."
    },
    {
      "id": 184,
      "start": 513.8800048828125,
      "end": 515.3599853515625,
      "text": " We begin to think about the privilege"
    },
    {
      "id": 185,
      "start": 516.1199951171875,
      "end": 518.3599853515625,
      "text": " that God has given us as the people of God"
    },
    {
      "id": 186,
      "start": 518.3599853515625,
      "end": 521.1599731445312,
      "text": " to enter into his presence,"
    },
    {
      "id": 187,
      "start": 521.1599731445312,
      "end": 524.2999877929688,
      "text": " to understand the privilege of prayer."
    },
    {
      "id": 188,
      "start": 524.2999877929688,
      "end": 525.6400146484375,
      "text": " This morning as we begin to think about"
    },
    {
      "id": 189,
      "start": 525.6400146484375,
      "end": 526.6599731445312,
      "text": " this confident prayer,"
    },
    {
      "id": 190,
      "start": 526.6599731445312,
      "end": 528.2000122070312,
      "text": " I want you to just notice a few things."
    },
    {
      "id": 191,
      "start": 528.2000122070312,
      "end": 529.5999755859375,
      "text": " Notice with me first of all,"
    },
    {
      "id": 192,
      "start": 529.5999755859375,
      "end": 531.0,
      "text": " and we've used it for the title,"
    },
    {
      "id": 193,
      "start": 531.0,
      "end": 532.9600219726562,
      "text": " but also as we begin the message this morning,"
    },
    {
      "id": 194,
      "start": 532.9600219726562,
      "end": 535.8800048828125,
      "text": " notice the confidence we are to have."
    },
    {
      "id": 195,
      "start": 535.8800048828125,
      "end": 538.2000122070312,
      "text": " In verse number 14 of 1 John chapter number five,"
    },
    {
      "id": 196,
      "start": 538.2000122070312,
      "end": 542.3800048828125,
      "text": " he says, and this is the confidence that we have in him."
    },
    {
      "id": 197,
      "start": 542.3800048828125,
      "end": 544.7999877929688,
      "text": " Notice the confidence isn't in you,"
    },
    {
      "id": 198,
      "start": 545.2000122070312,
      "end": 548.1599731445312,
      "text": " the confidence isn't necessarily in the prayer,"
    },
    {
      "id": 199,
      "start": 548.1599731445312,
      "end": 550.4000244140625,
      "text": " meaning some kind of rote religion,"
    },
    {
      "id": 200,
      "start": 550.4000244140625,
      "end": 553.1599731445312,
      "text": " if you could understand what I mean by that."
    },
    {
      "id": 201,
      "start": 553.1599731445312,
      "end": 555.6799926757812,
      "text": " It's not that somebody has written out some prayers"
    },
    {
      "id": 202,
      "start": 555.6799926757812,
      "end": 557.719970703125,
      "text": " and we have a prayer book or a prayer journal"
    },
    {
      "id": 203,
      "start": 557.719970703125,
      "end": 560.0800170898438,
      "text": " and there's some faith in those prayers"
    },
    {
      "id": 204,
      "start": 560.0800170898438,
      "end": 562.47998046875,
      "text": " or some confidence in those prayers."
    },
    {
      "id": 205,
      "start": 562.47998046875,
      "end": 567.4400024414062,
      "text": " No, he says this is the confidence that we have in him,"
    },
    {
      "id": 206,
      "start": 567.4400024414062,
      "end": 569.219970703125,
      "text": " in the one that we're praying to."
    },
    {
      "id": 207,
      "start": 569.219970703125,
      "end": 570.5599975585938,
      "text": " There are times that people say,"
    },
    {
      "id": 208,
      "start": 570.5599975585938,
      "end": 572.9199829101562,
      "text": " well, I just don't know how to pray."
    },
    {
      "id": 209,
      "start": 573.4400024414062,
      "end": 576.280029296875,
      "text": " It doesn't, I'm not sure, I'm not articulate,"
    },
    {
      "id": 210,
      "start": 576.280029296875,
      "end": 577.8800048828125,
      "text": " I'm not really good with my words."
    },
    {
      "id": 211,
      "start": 577.8800048828125,
      "end": 581.3599853515625,
      "text": " God knows that and God just wants to hear you pray."
    },
    {
      "id": 212,
      "start": 581.3599853515625,
      "end": 585.1199951171875,
      "text": " Our confidence is not in the eloquence of our prayer,"
    },
    {
      "id": 213,
      "start": 585.1199951171875,
      "end": 590.1199951171875,
      "text": " our confidence is the one that we're praying to, amen."
    },
    {
      "id": 214,
      "start": 590.4400024414062,
      "end": 592.5999755859375,
      "text": " There's some times that people will hear somebody pray,"
    },
    {
      "id": 215,
      "start": 592.5999755859375,
      "end": 594.8800048828125,
      "text": " by the way, think about the religious leaders of the day,"
    },
    {
      "id": 216,
      "start": 594.8800048828125,
      "end": 596.0399780273438,
      "text": " they would stand and they would pray,"
    },
    {
      "id": 217,
      "start": 596.0399780273438,
      "end": 599.9600219726562,
      "text": " oh, our God of Abraham, Isaac and Jacob and so on"
    },
    {
      "id": 0,
      "start": 599.9600219726562,
      "end": 603.9200220108032,
      "text": " so forth, right? And what did Jesus say about those ones that prayed that way that everyone"
    },
    {
      "id": 1,
      "start": 603.9200220108032,
      "end": 610.0800218582153,
      "text": " would see them? He said, they have their reward. You know what their reward was? Being seen"
    },
    {
      "id": 2,
      "start": 610.0800218582153,
      "end": 618.5200214385986,
      "text": " of men. Somebody saying, oh, did you hear how he prayed? No, no. Our confidence is in"
    },
    {
      "id": 3,
      "start": 618.5200214385986,
      "end": 625.9600219726562,
      "text": " him. And I'm so thankful that access to the throne room of heaven has been provided by"
    },
    {
      "id": 4,
      "start": 625.9600219726562,
      "end": 632.080020904541,
      "text": " the Lord Jesus Christ and that he desires that his children would pray, not only with"
    },
    {
      "id": 5,
      "start": 632.080020904541,
      "end": 637.1600227355957,
      "text": " confidence, but with boldness. We think about the truth of Hebrews four in verse number"
    },
    {
      "id": 6,
      "start": 637.1600227355957,
      "end": 643.1200218200684,
      "text": " 16, where the Bible says that we're to enter with boldness and think about how we find"
    },
    {
      "id": 7,
      "start": 643.1200218200684,
      "end": 647.6000213623047,
      "text": " it written here in Hebrews four and verse number 16, again, dealing with the fact that"
    },
    {
      "id": 8,
      "start": 647.6000213623047,
      "end": 653.1800231933594,
      "text": " we have a great high priest, the Lord Jesus Christ that is ever living to make intercession"
    },
    {
      "id": 9,
      "start": 653.1800231933594,
      "end": 659.0200233459473,
      "text": " for us. And he says in Hebrews four in verse number 16, let us therefore come boldly under"
    },
    {
      "id": 10,
      "start": 659.0200233459473,
      "end": 667.2600250244141,
      "text": " the throne of grace, that we may obtain mercy and find grace to help in the time of need."
    },
    {
      "id": 11,
      "start": 667.2600250244141,
      "end": 672.6200256347656,
      "text": " We think about that word that he uses in Hebrews four in verse 16, that we would come boldly."
    },
    {
      "id": 12,
      "start": 672.6200256347656,
      "end": 677.1800231933594,
      "text": " And we think about this truth in verse 14, and this is the confidence. And really it's"
    },
    {
      "id": 13,
      "start": 677.1800231933594,
      "end": 681.4200210571289,
      "text": " interesting, the word translated confidence and the word translated boldly are the same"
    },
    {
      "id": 14,
      "start": 681.4200210571289,
      "end": 687.9800186157227,
      "text": " Greek word. God wants us to have confidence. He wants us to have that boldness as we enter"
    },
    {
      "id": 15,
      "start": 687.9800186157227,
      "end": 693.6200256347656,
      "text": " into his presence. Why? Understanding that he ever lives to make intercession for us,"
    },
    {
      "id": 16,
      "start": 693.6200256347656,
      "end": 699.3000183105469,
      "text": " understanding that there's one God and one mediator between man and God, the man, Christ"
    },
    {
      "id": 17,
      "start": 699.3000183105469,
      "end": 706.8200225830078,
      "text": " Jesus. And I'm so thankful that we have direct access to God in prayer. I don't have to wait"
    },
    {
      "id": 18,
      "start": 706.8200225830078,
      "end": 711.5800247192383,
      "text": " for someone else to be able to pray to God for. I don't have to go somewhere else. I"
    },
    {
      "id": 19,
      "start": 711.5800247192383,
      "end": 718.3400192260742,
      "text": " can find any time, any place, anywhere for any reason, I can go to my God in prayer,"
    },
    {
      "id": 20,
      "start": 718.3400192260742,
      "end": 725.3800201416016,
      "text": " in confidence. He says, then this is the confidence that we have in him. Paul says it this way"
    },
    {
      "id": 21,
      "start": 725.3800201416016,
      "end": 729.0400238037109,
      "text": " in first Timothy chapter number two, when he talks about, first of all, that prayers"
    },
    {
      "id": 22,
      "start": 729.0400238037109,
      "end": 733.8600158691406,
      "text": " and supplications will be made. He says this, I will therefore that men pray everywhere"
    },
    {
      "id": 23,
      "start": 733.8600158691406,
      "end": 741.1000213623047,
      "text": " lifting up holy hands, and then he says this in verse number eight, without wrath and doubting."
    },
    {
      "id": 24,
      "start": 741.1000213623047,
      "end": 745.9600219726562,
      "text": " Without wrath and doubting. And so we find that we as the people of God, we are rejoicing"
    },
    {
      "id": 25,
      "start": 745.9600219726562,
      "end": 750.4600219726562,
      "text": " and understanding that we have confidence in him. There are times in which we've had"
    },
    {
      "id": 26,
      "start": 750.4600219726562,
      "end": 755.2200164794922,
      "text": " people that we've placed confidence in. The Bible talks about putting confidence in unfaithful"
    },
    {
      "id": 27,
      "start": 755.2200164794922,
      "end": 760.7000274658203,
      "text": " man. It's like a foot out of joint. It's like a broken tooth. Listen, our God is faithful"
    },
    {
      "id": 28,
      "start": 760.7000274658203,
      "end": 765.3800201416016,
      "text": " and it is never, as we think about in this passage of scripture, when we pray to him"
    },
    {
      "id": 29,
      "start": 765.3800201416016,
      "end": 772.280029296875,
      "text": " and we look to him and we have confidence in him that he hears us. We had testimony"
    },
    {
      "id": 30,
      "start": 772.280029296875,
      "end": 776.5000152587891,
      "text": " time on Tuesday evening for prayer, praise, and pie. There were many that were rejoicing"
    },
    {
      "id": 31,
      "start": 776.5000152587891,
      "end": 781.7600250244141,
      "text": " and thanking God for hearing our prayers and for answering prayer. And Brianna made the"
    },
    {
      "id": 32,
      "start": 781.7600250244141,
      "end": 788.4800262451172,
      "text": " statement that we can pray and he can hear all of us at the same time. God's never busy."
    },
    {
      "id": 33,
      "start": 788.4800262451172,
      "end": 794.1600189208984,
      "text": " It's never a situation where he doesn't hear us when we go to him in prayer, when he has"
    },
    {
      "id": 34,
      "start": 794.1600189208984,
      "end": 797.7200164794922,
      "text": " that ability. You ever been in a situation where two people are talking to you at the"
    },
    {
      "id": 35,
      "start": 797.7200164794922,
      "end": 804.8800201416016,
      "text": " same time? Most people say, hey listen, one at a time. God can hear all of us. And he"
    },
    {
      "id": 36,
      "start": 804.8800201416016,
      "end": 810.280029296875,
      "text": " knows exactly what we're praying. And we have confidence in him. Think about this truth."
    },
    {
      "id": 37,
      "start": 810.280029296875,
      "end": 815.0800170898438,
      "text": " Turn to the book of Matthew, if you will. Look at what Jesus is teaching. This is during"
    },
    {
      "id": 38,
      "start": 815.0800170898438,
      "end": 820.1800231933594,
      "text": " the Sermon on the Mount in Matthew 5, 6, and 7. And I want you to see what Jesus says"
    },
    {
      "id": 39,
      "start": 820.1800231933594,
      "end": 827.6400146484375,
      "text": " here with regard to prayer. In Matthew chapter number 7, this ought to encourage you this"
    },
    {
      "id": 40,
      "start": 827.6400146484375,
      "end": 835.1200256347656,
      "text": " morning and help us to have confidence. Notice in verse 7 of Matthew 7, Jesus begins and"
    },
    {
      "id": 41,
      "start": 835.1200256347656,
      "end": 842.1600189208984,
      "text": " says this, ask and it shall be given you. Seek and ye shall find. Knock and it shall"
    },
    {
      "id": 42,
      "start": 842.1600189208984,
      "end": 848.8400268554688,
      "text": " be opened unto you. For everyone that asketh receiveth, and he that seeketh findeth. And"
    },
    {
      "id": 43,
      "start": 848.8400268554688,
      "end": 854.52001953125,
      "text": " to him that knocketh it shall be opened. Notice what he says in verse number 9, or what man"
    },
    {
      "id": 44,
      "start": 854.52001953125,
      "end": 862.4000244140625,
      "text": " is there of you whom if his son ask bread, will he give him a stone? Isn't that a great"
    },
    {
      "id": 45,
      "start": 862.4000244140625,
      "end": 868.4400329589844,
      "text": " example, analogy? Hey listen, if your son asks you for bread, are you going to give"
    },
    {
      "id": 46,
      "start": 868.4400329589844,
      "end": 877.6800231933594,
      "text": " him a stone? Surely not. Notice in verse number 10, or if he ask a fish, will he give"
    },
    {
      "id": 47,
      "start": 877.6800231933594,
      "end": 890.6400146484375,
      "text": " him a serpent? If ye then, verse number 11, being evil, know how to give good gifts unto"
    },
    {
      "id": 48,
      "start": 890.6400146484375,
      "end": 900.4800109863281,
      "text": " your children. Notice these three words, how much more? How much more shall your Father"
    },
    {
      "id": 49,
      "start": 900.4800109863281,
      "end": 908.1600341796875,
      "text": " which is in heaven give good things to them that ask him? Isn't that wonderful? He says"
    },
    {
      "id": 50,
      "start": 908.1600341796875,
      "end": 914.2400207519531,
      "text": " listen, you, I mean compared to God and His holiness, he says you're evil and you know"
    },
    {
      "id": 51,
      "start": 914.2400207519531,
      "end": 919.02001953125,
      "text": " how to give good gifts. If your son comes and says can I have bread, you're not going"
    },
    {
      "id": 52,
      "start": 919.02001953125,
      "end": 922.4200134277344,
      "text": " to give him a stone. If he asks for a fish, you're not going to give him a serpent. And"
    },
    {
      "id": 53,
      "start": 922.4200134277344,
      "end": 930.7000122070312,
      "text": " so how much more shall your Father which is in heaven give good things to them that ask"
    },
    {
      "id": 54,
      "start": 930.7000122070312,
      "end": 935.8200073242188,
      "text": " him? Wow, the confidence that we're to have in knowing that He hears us. How many times,"
    },
    {
      "id": 55,
      "start": 935.8200073242188,
      "end": 939.780029296875,
      "text": " and we don't have the time this morning to look at the examples, but how many times as"
    },
    {
      "id": 56,
      "start": 939.780029296875,
      "end": 946.7000122070312,
      "text": " we read the word of God do we read where the Bible tells us that God heard their prayers."
    },
    {
      "id": 57,
      "start": 946.7000122070312,
      "end": 953.02001953125,
      "text": " In fact, we find right here in this passage of Scripture in 1 John 5, it says that this"
    },
    {
      "id": 58,
      "start": 953.02001953125,
      "end": 957.7000122070312,
      "text": " is the confidence that we have in Him that if we ask anything according to His will,"
    },
    {
      "id": 59,
      "start": 957.7000122070312,
      "end": 964.1000366210938,
      "text": " He heareth us. And if we know that He heareth us whatsoever we ask, we know that we have"
    },
    {
      "id": 60,
      "start": 964.1000366210938,
      "end": 970.1000366210938,
      "text": " the petitions that we desired of Him. God wants His children to have confidence when"
    },
    {
      "id": 61,
      "start": 970.1000366210938,
      "end": 975.5800170898438,
      "text": " we pray. I remember as a child, my parents aren't here, they're traveling, I don't think"
    },
    {
      "id": 62,
      "start": 975.5800170898438,
      "end": 978.8200073242188,
      "text": " they're watching live stream this morning, but I don't mind if they are or if you tell"
    },
    {
      "id": 63,
      "start": 978.8200073242188,
      "end": 984.5800170898438,
      "text": " them, it's not a secret. But sometimes children, and I remember being this way, sometimes children"
    },
    {
      "id": 64,
      "start": 984.5800170898438,
      "end": 990.8200073242188,
      "text": " have more confidence asking mom for something than asking dad for something. Any of you"
    },
    {
      "id": 65,
      "start": 990.8200073242188,
      "end": 995.5000305175781,
      "text": " ever had that experience? And I had that experience as a child, I'd go ask my mom for certain"
    },
    {
      "id": 66,
      "start": 995.5000305175781,
      "end": 1002.1400146484375,
      "text": " things and she'd say this, ask dad. Like, well, you know, could you do it for me? You"
    },
    {
      "id": 67,
      "start": 1002.1400146484375,
      "end": 1006.5400085449219,
      "text": " know, that kind of thing, right? And I know even sometimes for my children, they'll ask"
    },
    {
      "id": 68,
      "start": 1006.5400085449219,
      "end": 1011.7000122070312,
      "text": " Holly something before they might ask me. Brianna's smiling and Joseph is kind of holding"
    },
    {
      "id": 69,
      "start": 1011.7000122070312,
      "end": 1016.5800170898438,
      "text": " back a smile back there. And I don't know why that is, why that's so standard, just"
    },
    {
      "id": 70,
      "start": 1016.5800170898438,
      "end": 1022.8200073242188,
      "text": " a typical nature, human nature. But understand this morning that though as humans there are"
    },
    {
      "id": 71,
      "start": 1022.8200073242188,
      "end": 1027.6200256347656,
      "text": " times that we might not have confidence asking somebody, when we think about the truth of"
    },
    {
      "id": 72,
      "start": 1027.6200256347656,
      "end": 1034.02001953125,
      "text": " my relationship with the God of the universe, because I've been saved, I'm His child, I'm"
    },
    {
      "id": 73,
      "start": 1034.02001953125,
      "end": 1040.02001953125,
      "text": " to have absolute confidence. Notice what he says in chapter number three of this book,"
    },
    {
      "id": 74,
      "start": 1040.02001953125,
      "end": 1043.3400268554688,
      "text": " and then we'll get into the next point. In 1 John chapter number three, and I want this"
    },
    {
      "id": 75,
      "start": 1043.3400268554688,
      "end": 1047.5400085449219,
      "text": " to sink in this morning when we think about this truth of having confidence in prayer,"
    },
    {
      "id": 76,
      "start": 1047.5400085449219,
      "end": 1051.4800109863281,
      "text": " because really it all is leading up to this passage that we're looking at with this confidence"
    },
    {
      "id": 77,
      "start": 1051.4800109863281,
      "end": 1055.4200134277344,
      "text": " in prayer. I mentioned about the fourth chapter, knowing that He loves us, but notice what"
    },
    {
      "id": 78,
      "start": 1055.4200134277344,
      "end": 1059.1000366210938,
      "text": " He says in verse number one of 1 John chapter three."
    },
    {
      "id": 79,
      "start": 1059.1000366210938,
      "end": 1066.7400207519531,
      "text": " Behold, what manner of love the Father hath bestowed upon us, and then notice this, that"
    },
    {
      "id": 80,
      "start": 1066.7400207519531,
      "end": 1075.1000366210938,
      "text": " we should be called the sons of God. Therefore the world knoweth us not, because it knew"
    },
    {
      "id": 81,
      "start": 1075.1000366210938,
      "end": 1081.9800109863281,
      "text": " Him not. Beloved, now are we the sons of God, and it doth not yet appear what we shall be,"
    },
    {
      "id": 82,
      "start": 1081.9800109863281,
      "end": 1088.1400146484375,
      "text": " but we know that when He shall appear, we shall be like Him, for we shall see Him as"
    },
    {
      "id": 83,
      "start": 1088.1400146484375,
      "end": 1093.2200317382812,
      "text": " He is. He then talks about purity in the next verse of Scripture and how important that"
    },
    {
      "id": 84,
      "start": 1093.2200317382812,
      "end": 1097.3800354003906,
      "text": " is, but I want you to understand this morning when we think about this confident prayer"
    },
    {
      "id": 85,
      "start": 1097.3800354003906,
      "end": 1102.6600341796875,
      "text": " that we understand I'm His child. How did I become His son? By trusting the Lord Jesus"
    },
    {
      "id": 86,
      "start": 1102.6600341796875,
      "end": 1108.0600280761719,
      "text": " Christ as my personal Savior. This morning if you know that you're a son of His, that"
    },
    {
      "id": 87,
      "start": 1108.0600280761719,
      "end": 1112.02001953125,
      "text": " you've trusted, you've placed your faith and trust in the Lord Jesus Christ and He"
    },
    {
      "id": 88,
      "start": 1112.02001953125,
      "end": 1117.4600219726562,
      "text": " is your Savior, the Bible says that you are His son. You're His child. You're His son"
    },
    {
      "id": 89,
      "start": 1117.4600219726562,
      "end": 1123.6199951171875,
      "text": " or His daughter. You are His child and you are to have confidence that you can go to"
    },
    {
      "id": 90,
      "start": 1123.6199951171875,
      "end": 1130.300048828125,
      "text": " Him in prayer. Isn't that awesome? Notice as we continue looking at the passage of Scripture,"
    },
    {
      "id": 91,
      "start": 1130.300048828125,
      "end": 1135.02001953125,
      "text": " we notice that there is a condition stated. Number one, we notice the confidence we are"
    },
    {
      "id": 92,
      "start": 1135.02001953125,
      "end": 1139.5400390625,
      "text": " to have. Number two, we notice the condition that is stated. The Bible says this, and this"
    },
    {
      "id": 93,
      "start": 1139.5400390625,
      "end": 1143.9800415039062,
      "text": " is the confidence, verse 14, that we have in Him, that if we ask anything and then notice"
    },
    {
      "id": 94,
      "start": 1143.9800415039062,
      "end": 1151.7000122070312,
      "text": " this phrase, according to His will, He heareth us. And if we know that He heareth us, what"
    },
    {
      "id": 95,
      "start": 1151.7000122070312,
      "end": 1155.6600341796875,
      "text": " shall we ask? We know that we have the petitions that we desired of Him. Some people say, well,"
    },
    {
      "id": 96,
      "start": 1155.6600341796875,
      "end": 1159.5,
      "text": " I said if you ask, you're going to receive. I asked Him for a million bucks and I'm waiting"
    },
    {
      "id": 97,
      "start": 1159.5,
      "end": 1165.5800170898438,
      "text": " for my million dollars. That's not what the Bible teaches. Amen? Now God might bless you"
    },
    {
      "id": 98,
      "start": 1165.5800170898438,
      "end": 1169.6199951171875,
      "text": " with a million dollars and that's perfectly fine if God would do that because He knows"
    },
    {
      "id": 99,
      "start": 1169.6199951171875,
      "end": 1174.02001953125,
      "text": " that He can entrust you with that and that you would use it for His honor and for His"
    },
    {
      "id": 100,
      "start": 1174.02001953125,
      "end": 1178.5400390625,
      "text": " glory. But we understand that as we look here at the passage of Scripture that there is"
    },
    {
      "id": 101,
      "start": 1178.5400390625,
      "end": 1182.9400024414062,
      "text": " this condition that is stated that He says that it's according to His will. And so the"
    },
    {
      "id": 102,
      "start": 1182.9400024414062,
      "end": 1188.260009765625,
      "text": " believer, the child of God, the one that has that relationship with the God of Heaven that"
    },
    {
      "id": 103,
      "start": 1188.260009765625,
      "end": 1193.300048828125,
      "text": " understands that they can come in confidence in Him, come in boldness through the throne"
    },
    {
      "id": 104,
      "start": 1193.300048828125,
      "end": 1199.9800415039062,
      "text": " of grace, we are to pray according to His will. So the big question then would be how"
    },
    {
      "id": 0,
      "start": 1199.9800415039062,
      "end": 1202.2000415325165,
      "text": " How do we know His will?"
    },
    {
      "id": 1,
      "start": 1202.2000415325165,
      "end": 1204.4000415802002,
      "text": " Through His Word."
    },
    {
      "id": 2,
      "start": 1204.4000415802002,
      "end": 1208.4800415039062,
      "text": " God has revealed to us in His Word, His will."
    },
    {
      "id": 3,
      "start": 1208.4800415039062,
      "end": 1215.4400415420532,
      "text": " We find that we have, Paul says in the church in Corinth, we have the mind of Christ."
    },
    {
      "id": 4,
      "start": 1215.4400415420532,
      "end": 1220.7600421905518,
      "text": " He says this, let this mind be in you, which was also in Christ Jesus in Philippians chapter"
    },
    {
      "id": 5,
      "start": 1220.7600421905518,
      "end": 1221.7600421905518,
      "text": " number 2."
    },
    {
      "id": 6,
      "start": 1221.7600421905518,
      "end": 1227.3200416564941,
      "text": " And we find that we have the very Word of God and as we desire to know the will of God,"
    },
    {
      "id": 7,
      "start": 1227.3200416564941,
      "end": 1232.100040435791,
      "text": " as we desire to pray according to the will of God, we dig into the Word of God and we"
    },
    {
      "id": 8,
      "start": 1232.100040435791,
      "end": 1234.8800430297852,
      "text": " discover the will of God."
    },
    {
      "id": 9,
      "start": 1234.8800430297852,
      "end": 1241.1200408935547,
      "text": " Paul prayed that this thorn in his side would depart from him, but God said my grace is"
    },
    {
      "id": 10,
      "start": 1241.1200408935547,
      "end": 1242.1200408935547,
      "text": " sufficient."
    },
    {
      "id": 11,
      "start": 1242.1200408935547,
      "end": 1246.4000396728516,
      "text": " So we find that in that passage of scripture in 2 Corinthians chapter number 12, that it"
    },
    {
      "id": 12,
      "start": 1246.4000396728516,
      "end": 1252.9600410461426,
      "text": " was not the will of God to deliver Paul from that thorn in his side."
    },
    {
      "id": 13,
      "start": 1252.9600410461426,
      "end": 1255.8400421142578,
      "text": " Could God have delivered him?"
    },
    {
      "id": 14,
      "start": 1255.8400421142578,
      "end": 1257.560043334961,
      "text": " No."
    },
    {
      "id": 15,
      "start": 1257.560043334961,
      "end": 1263.1400413513184,
      "text": " But Paul learned a great lesson in not being delivered by that thorn in his side, but understanding"
    },
    {
      "id": 16,
      "start": 1263.1400413513184,
      "end": 1266.0800399780273,
      "text": " that God said my grace is sufficient for you."
    },
    {
      "id": 17,
      "start": 1266.0800399780273,
      "end": 1270.8800430297852,
      "text": " So we begin to understand how is it that we would pray according to His will."
    },
    {
      "id": 18,
      "start": 1270.8800430297852,
      "end": 1274.8200378417969,
      "text": " Well we understand the condition that is stated here in 1 John chapter number 5, but we also"
    },
    {
      "id": 19,
      "start": 1274.8200378417969,
      "end": 1276.2400436401367,
      "text": " understand this is what Jesus taught."
    },
    {
      "id": 20,
      "start": 1276.2400436401367,
      "end": 1279.7200393676758,
      "text": " Go over to the book of Luke if you will, we'll look at a couple of verses of scripture in"
    },
    {
      "id": 21,
      "start": 1279.7200393676758,
      "end": 1284.4000396728516,
      "text": " the book of Luke, and understand this is what Jesus taught, Luke chapter number 11."
    },
    {
      "id": 22,
      "start": 1284.4000396728516,
      "end": 1290.3200378417969,
      "text": " And understand that here in this passage of scripture is where we find the disciple"
    },
    {
      "id": 23,
      "start": 1290.3200378417969,
      "end": 1293.2600402832031,
      "text": " that stands up and says, Lord teach us to pray."
    },
    {
      "id": 24,
      "start": 1293.2600402832031,
      "end": 1299.5000381469727,
      "text": " It was a certain place that they were, and one of His disciples said unto Him, Lord teach"
    },
    {
      "id": 25,
      "start": 1299.5000381469727,
      "end": 1301.6400451660156,
      "text": " us to pray."
    },
    {
      "id": 26,
      "start": 1301.6400451660156,
      "end": 1308.9800415039062,
      "text": " I'm thankful that this disciple asked the Lord this pertinent, relevant question."
    },
    {
      "id": 27,
      "start": 1308.9800415039062,
      "end": 1312.6000442504883,
      "text": " We find that Jesus would give an answer, and He said to them in verse number 2, by the"
    },
    {
      "id": 28,
      "start": 1312.6000442504883,
      "end": 1317.280044555664,
      "text": " way this is not the Lord's prayer, this is a model prayer, and we find that Jesus says"
    },
    {
      "id": 29,
      "start": 1317.280044555664,
      "end": 1324.160041809082,
      "text": " this in verse number 2, when ye pray, say, Our Father which art in heaven, hallowed be"
    },
    {
      "id": 30,
      "start": 1324.160041809082,
      "end": 1325.160041809082,
      "text": " Thy name."
    },
    {
      "id": 31,
      "start": 1325.160041809082,
      "end": 1330.0800476074219,
      "text": " You enter into His presence recognizing His holiness."
    },
    {
      "id": 32,
      "start": 1330.0800476074219,
      "end": 1337.5000457763672,
      "text": " He is holy, our God is holy, holy, holy, holy."
    },
    {
      "id": 33,
      "start": 1337.5000457763672,
      "end": 1338.6000366210938,
      "text": " We enter into His presence."
    },
    {
      "id": 34,
      "start": 1338.6000366210938,
      "end": 1344.3600463867188,
      "text": " By the way, because He is holy, He has given us the truth on how we approach Him."
    },
    {
      "id": 35,
      "start": 1344.3600463867188,
      "end": 1347.4400482177734,
      "text": " We don't just approach Him any old way we want."
    },
    {
      "id": 36,
      "start": 1347.4400482177734,
      "end": 1350.6800384521484,
      "text": " By the way, come back this evening, we'll be looking at Galatians chapter number 3,"
    },
    {
      "id": 37,
      "start": 1350.6800384521484,
      "end": 1356.4800415039062,
      "text": " and answering a question in the Ask the Pastor series with regard to what meaneth the law."
    },
    {
      "id": 38,
      "start": 1356.4800415039062,
      "end": 1361.800048828125,
      "text": " And really what we learn as we study the Old Testament with regard to our approach to God."
    },
    {
      "id": 39,
      "start": 1361.800048828125,
      "end": 1364.2000427246094,
      "text": " So many people today are throwing the Old Testament out."
    },
    {
      "id": 40,
      "start": 1364.2000427246094,
      "end": 1366.8400421142578,
      "text": " It's not relevant, we don't need it."
    },
    {
      "id": 41,
      "start": 1366.8400421142578,
      "end": 1369.800048828125,
      "text": " While God is the same yesterday and today and forever, I'm thankful that I don't have"
    },
    {
      "id": 42,
      "start": 1369.800048828125,
      "end": 1374.8400421142578,
      "text": " to follow the law, but the law does teach me some things, amen?"
    },
    {
      "id": 43,
      "start": 1374.8400421142578,
      "end": 1380.4800415039062,
      "text": " And I'm thankful that Jesus fulfilled the law, glory, hallelujah, amen?"
    },
    {
      "id": 44,
      "start": 1380.4800415039062,
      "end": 1384.6000366210938,
      "text": " But the reality is we find here that Jesus says, listen, recognize that you're entering"
    },
    {
      "id": 45,
      "start": 1384.6000366210938,
      "end": 1387.3600463867188,
      "text": " into the presence of a thrice holy God."
    },
    {
      "id": 46,
      "start": 1387.3600463867188,
      "end": 1394.3200378417969,
      "text": " He says this, Thy kingdom come, notice this phrase, Thy will be done."
    },
    {
      "id": 47,
      "start": 1394.3200378417969,
      "end": 1397.9200439453125,
      "text": " As in heaven, so in earth."
    },
    {
      "id": 48,
      "start": 1397.9200439453125,
      "end": 1402.0400390625,
      "text": " And so Jesus taught that we're to pray according to the will of God."
    },
    {
      "id": 49,
      "start": 1402.0400390625,
      "end": 1404.8400421142578,
      "text": " Not only did Jesus teach that, but Jesus practiced that."
    },
    {
      "id": 50,
      "start": 1404.8400421142578,
      "end": 1408.8800354003906,
      "text": " Look over in Luke chapter number 22, if you will, in Luke chapter number 22, and we'll"
    },
    {
      "id": 51,
      "start": 1408.8800354003906,
      "end": 1413.0000457763672,
      "text": " just look at one of the examples here when He's praying in the Garden of Gethsemane."
    },
    {
      "id": 52,
      "start": 1413.0000457763672,
      "end": 1419.1600341796875,
      "text": " The Bible tells us in verse number 39 of Luke chapter number 22, and He came out and went"
    },
    {
      "id": 53,
      "start": 1419.1600341796875,
      "end": 1423.800048828125,
      "text": " as He was wont to the Mount of Olives, and His disciples also followed Him, and so we"
    },
    {
      "id": 54,
      "start": 1423.800048828125,
      "end": 1427.0400390625,
      "text": " find that He's there and Jesus is going to pray in the garden."
    },
    {
      "id": 55,
      "start": 1427.0400390625,
      "end": 1431.0400390625,
      "text": " He says to the disciples in verse number 40, when He was at the place, He said unto them,"
    },
    {
      "id": 56,
      "start": 1431.0400390625,
      "end": 1433.8400421142578,
      "text": " pray that ye enter not into temptation."
    },
    {
      "id": 57,
      "start": 1433.8400421142578,
      "end": 1437.8800354003906,
      "text": " And He was withdrawn from them about a stone's cast and kneeled down and prayed."
    },
    {
      "id": 58,
      "start": 1437.8800354003906,
      "end": 1438.8800354003906,
      "text": " Notice what He prayed."
    },
    {
      "id": 59,
      "start": 1438.8800354003906,
      "end": 1441.8800354003906,
      "text": " He had taught that they're to pray according to His will."
    },
    {
      "id": 60,
      "start": 1441.8800354003906,
      "end": 1448.560043334961,
      "text": " He says, Father, if thou be willing, remove this cup from me, nevertheless not my will,"
    },
    {
      "id": 61,
      "start": 1448.560043334961,
      "end": 1451.7600402832031,
      "text": " but thine be done."
    },
    {
      "id": 62,
      "start": 1451.7600402832031,
      "end": 1457.6000366210938,
      "text": " By the way, I do not believe that Jesus was praying to not go to the cross."
    },
    {
      "id": 63,
      "start": 1457.6000366210938,
      "end": 1458.8800354003906,
      "text": " That's not what He was praying."
    },
    {
      "id": 64,
      "start": 1458.8800354003906,
      "end": 1460.0400390625,
      "text": " Some people teach that."
    },
    {
      "id": 65,
      "start": 1460.0400390625,
      "end": 1462.3200378417969,
      "text": " I do not believe that for one second."
    },
    {
      "id": 66,
      "start": 1462.3200378417969,
      "end": 1467.6000366210938,
      "text": " I believe that all of the forces of hell were trying to kill Jesus in the garden so that"
    },
    {
      "id": 67,
      "start": 1467.6000366210938,
      "end": 1471.4800415039062,
      "text": " He could never make it to the cross."
    },
    {
      "id": 68,
      "start": 1471.4800415039062,
      "end": 1475.4000549316406,
      "text": " Because if He made it to the cross, that was the fulfillment of prophecy and that was what"
    },
    {
      "id": 69,
      "start": 1475.4000549316406,
      "end": 1478.3600463867188,
      "text": " was required for man to be redeemed."
    },
    {
      "id": 70,
      "start": 1478.3600463867188,
      "end": 1479.3600463867188,
      "text": " Amen?"
    },
    {
      "id": 71,
      "start": 1479.3600463867188,
      "end": 1485.6400451660156,
      "text": " And so we find that as we look here at this truth in Luke chapter number 22 and understand"
    },
    {
      "id": 72,
      "start": 1485.6400451660156,
      "end": 1487.6000366210938,
      "text": " what He's praying, how would He pray?"
    },
    {
      "id": 73,
      "start": 1487.6000366210938,
      "end": 1490.8400268554688,
      "text": " Why would He pray that He would not go to the cross?"
    },
    {
      "id": 74,
      "start": 1490.8400268554688,
      "end": 1496.4800415039062,
      "text": " And Hebrews tells us that for the joy that was set before Him, He endured the cross,"
    },
    {
      "id": 75,
      "start": 1496.4800415039062,
      "end": 1497.4800415039062,
      "text": " right?"
    },
    {
      "id": 76,
      "start": 1497.4800415039062,
      "end": 1498.4800415039062,
      "text": " What was the joy?"
    },
    {
      "id": 77,
      "start": 1498.4800415039062,
      "end": 1500.800048828125,
      "text": " The fact that souls would be saved, lives would be changed."
    },
    {
      "id": 78,
      "start": 1500.800048828125,
      "end": 1505.2400512695312,
      "text": " He said that He came to do the will of His Father."
    },
    {
      "id": 79,
      "start": 1505.2400512695312,
      "end": 1509.8400268554688,
      "text": " And He knew that from before the foundation of the world, that it was appointed that He"
    },
    {
      "id": 80,
      "start": 1509.8400268554688,
      "end": 1513.4800415039062,
      "text": " would be the Lamb that was slain on the cross of Calvary."
    },
    {
      "id": 81,
      "start": 1513.4800415039062,
      "end": 1516.1200561523438,
      "text": " That was all for free, not part of the message on prayer."
    },
    {
      "id": 82,
      "start": 1516.1200561523438,
      "end": 1517.1200561523438,
      "text": " Amen?"
    },
    {
      "id": 83,
      "start": 1517.1200561523438,
      "end": 1519.9200439453125,
      "text": " But I do not believe that's what Jesus was praying at all."
    },
    {
      "id": 84,
      "start": 1519.9200439453125,
      "end": 1524.0000305175781,
      "text": " He was praying according to the will of God and He knew that He was going to go to the"
    },
    {
      "id": 85,
      "start": 1524.0000305175781,
      "end": 1525.0000305175781,
      "text": " cross of Calvary."
    },
    {
      "id": 86,
      "start": 1525.0000305175781,
      "end": 1531.280029296875,
      "text": " And so we know that Jesus taught, Jesus not only taught, but He practiced this truth that"
    },
    {
      "id": 87,
      "start": 1531.280029296875,
      "end": 1538.6400451660156,
      "text": " is stated in 1 John 5 and verse number 14, the condition that we pray according to His"
    },
    {
      "id": 88,
      "start": 1538.6400451660156,
      "end": 1540.0800476074219,
      "text": " will."
    },
    {
      "id": 89,
      "start": 1540.0800476074219,
      "end": 1543.4400329589844,
      "text": " We will not take the time this morning, but if you were to do a Bible study, you would"
    },
    {
      "id": 90,
      "start": 1543.4400329589844,
      "end": 1547.6000366210938,
      "text": " find that if you go to the book of 1 Kings and chapter number 18 and then cross-reference"
    },
    {
      "id": 91,
      "start": 1547.6000366210938,
      "end": 1554.0000305175781,
      "text": " that with James chapter number 5, you will find that Elijah prayed with confidence."
    },
    {
      "id": 92,
      "start": 1554.0000305175781,
      "end": 1555.0000305175781,
      "text": " Did he not?"
    },
    {
      "id": 93,
      "start": 1555.0000305175781,
      "end": 1559.6000366210938,
      "text": " When you think about that showdown at Mount Carmel and all of those Baal worshipers came"
    },
    {
      "id": 94,
      "start": 1559.6000366210938,
      "end": 1566.4400329589844,
      "text": " and all that was taking place there, and we find that there Elijah prayed with confidence"
    },
    {
      "id": 95,
      "start": 1566.4400329589844,
      "end": 1568.2400512695312,
      "text": " and with boldness."
    },
    {
      "id": 96,
      "start": 1568.2400512695312,
      "end": 1572.1200561523438,
      "text": " Do you think that when Elijah prayed that he expected fire to fall from heaven?"
    },
    {
      "id": 97,
      "start": 1572.1200561523438,
      "end": 1573.1200561523438,
      "text": " Hallelujah!"
    },
    {
      "id": 98,
      "start": 1573.1200561523438,
      "end": 1580.9400329589844,
      "text": " I mean, I don't think he had one part of his being that doubted for one nanosecond that"
    },
    {
      "id": 99,
      "start": 1580.9400329589844,
      "end": 1583.0400390625,
      "text": " fire was not going to fall from heaven."
    },
    {
      "id": 100,
      "start": 1583.0400390625,
      "end": 1584.0400390625,
      "text": " Why?"
    },
    {
      "id": 101,
      "start": 1584.0400390625,
      "end": 1590.8400268554688,
      "text": " Because he said this when he prayed, I have done all of this according to Thy word."
    },
    {
      "id": 102,
      "start": 1590.8400268554688,
      "end": 1593.1400451660156,
      "text": " Elijah knew that he was praying according to the will of God."
    },
    {
      "id": 103,
      "start": 1593.1400451660156,
      "end": 1596.9200439453125,
      "text": " He was doing everything that he did was according to the will of God."
    },
    {
      "id": 104,
      "start": 1596.9200439453125,
      "end": 1602.2400512695312,
      "text": " And the Bible tells us in James chapter number 5 that Elijah is a man just like we're men,"
    },
    {
      "id": 105,
      "start": 1602.2400512695312,
      "end": 1607.6400451660156,
      "text": " but the effectual fervent prayer of a righteous man availeth much."
    },
    {
      "id": 106,
      "start": 1607.6400451660156,
      "end": 1613.6400451660156,
      "text": " And Elijah prayed with confidence, he prayed with boldness, he prayed according to the"
    },
    {
      "id": 107,
      "start": 1613.6400451660156,
      "end": 1614.6400451660156,
      "text": " will of God."
    },
    {
      "id": 108,
      "start": 1614.6400451660156,
      "end": 1618.6000366210938,
      "text": " And so we understand the confidence that we're to have, but we notice that there's a condition"
    },
    {
      "id": 109,
      "start": 1618.6000366210938,
      "end": 1622.280029296875,
      "text": " that is stated, and we begin to think about praying according to the will of God."
    },
    {
      "id": 110,
      "start": 1622.280029296875,
      "end": 1625.9600524902344,
      "text": " Listen, as we think about praying according to the will of God, just a few thoughts this"
    },
    {
      "id": 111,
      "start": 1625.9600524902344,
      "end": 1626.9600524902344,
      "text": " morning."
    },
    {
      "id": 112,
      "start": 1626.9600524902344,
      "end": 1629.6800537109375,
      "text": " Number one, it's God's will for all men to be saved."
    },
    {
      "id": 113,
      "start": 1629.6800537109375,
      "end": 1631.5600280761719,
      "text": " I believe that this morning."
    },
    {
      "id": 114,
      "start": 1631.5600280761719,
      "end": 1635.3600463867188,
      "text": " The Bible says that the Lord is not slack concerning His promises."
    },
    {
      "id": 115,
      "start": 1635.3600463867188,
      "end": 1639.7200317382812,
      "text": " Some men count slackness as He is not, He is long-suffering to us, we're not willing"
    },
    {
      "id": 116,
      "start": 1639.7200317382812,
      "end": 1644.6800537109375,
      "text": " that any should perish, but that all should come to repentance."
    },
    {
      "id": 117,
      "start": 1644.6800537109375,
      "end": 1651.2000427246094,
      "text": " The Bible tells us in 1 Timothy chapter number 2 that His will is that all men would be saved."
    },
    {
      "id": 118,
      "start": 1651.2000427246094,
      "end": 1654.8400268554688,
      "text": " He says this, the Bible tells us in Romans chapter number 10, for whosoever shall call"
    },
    {
      "id": 119,
      "start": 1654.8400268554688,
      "end": 1658.8800354003906,
      "text": " upon the name of the Lord shall be saved."
    },
    {
      "id": 120,
      "start": 1658.8800354003906,
      "end": 1663.6800537109375,
      "text": " So I can have confidence as the one giving the instruction when I share the gospel with"
    },
    {
      "id": 121,
      "start": 1663.6800537109375,
      "end": 1668.4800415039062,
      "text": " someone and they understand that they're a sinner, they understand that they have violated"
    },
    {
      "id": 122,
      "start": 1668.4800415039062,
      "end": 1675.1600341796875,
      "text": " the law of God and they are guilty, they understand that Jesus fulfilled all that"
    },
    {
      "id": 123,
      "start": 1675.1600341796875,
      "end": 1679.8800354003906,
      "text": " was necessary for them to be saved, to be born again, and they understand that Jesus"
    },
    {
      "id": 124,
      "start": 1679.8800354003906,
      "end": 1685.7600402832031,
      "text": " bled and died, He was buried and He rose again, and they place their faith and trust in the"
    },
    {
      "id": 125,
      "start": 1685.7600402832031,
      "end": 1690.3200378417969,
      "text": " finished work of Christ at Calvary, that when I say to them, whosoever shall call upon the"
    },
    {
      "id": 126,
      "start": 1690.3200378417969,
      "end": 1695.2000427246094,
      "text": " name of the Lord shall be saved, and I say something like this, how do you call upon"
    },
    {
      "id": 127,
      "start": 1695.2000427246094,
      "end": 1696.7600402832031,
      "text": " the name of the Lord?"
    },
    {
      "id": 128,
      "start": 1696.7600402832031,
      "end": 1698.800048828125,
      "text": " You pray."
    },
    {
      "id": 129,
      "start": 1698.800048828125,
      "end": 1701.9600524902344,
      "text": " And I can tell you that that's a prayer that is according to the will of God."
    },
    {
      "id": 130,
      "start": 1701.9600524902344,
      "end": 1702.9600524902344,
      "text": " Amen?"
    },
    {
      "id": 131,
      "start": 1702.9600524902344,
      "end": 1708.7600402832031,
      "text": " Listen, let me tell you a prayer that's according to the will of God for your spiritual growth."
    },
    {
      "id": 132,
      "start": 1708.7600402832031,
      "end": 1714.9600219726562,
      "text": " You pray and ask God to help you grow spiritually, that's a prayer that's according to His will."
    },
    {
      "id": 133,
      "start": 1714.9600219726562,
      "end": 1715.9600219726562,
      "text": " God help me to grow."
    },
    {
      "id": 134,
      "start": 1715.9600219726562,
      "end": 1720.4000244140625,
      "text": " God, as I study Your Word, teach me Your Word, help me to understand Your Word, help me to"
    },
    {
      "id": 135,
      "start": 1720.4000244140625,
      "end": 1723.1600341796875,
      "text": " grow in my faith."
    },
    {
      "id": 136,
      "start": 1723.1600341796875,
      "end": 1727.3600463867188,
      "text": " The Bible says, as newborn babes desire the sincere milk of the Word that ye may grow"
    },
    {
      "id": 137,
      "start": 1727.3600463867188,
      "end": 1732.9600219726562,
      "text": " thereby, and as you desire to grow, as you pray, God, would you help me to grow, that"
    },
    {
      "id": 138,
      "start": 1732.9600219726562,
      "end": 1738.3400268554688,
      "text": " is a prayer that is according to His will."
    },
    {
      "id": 139,
      "start": 1738.3400268554688,
      "end": 1742.2400512695312,
      "text": " That God would teach us, akin to the growing spiritually, that He would teach us, that"
    },
    {
      "id": 140,
      "start": 1742.2400512695312,
      "end": 1743.2400512695312,
      "text": " He would guide us."
    },
    {
      "id": 141,
      "start": 1743.2400512695312,
      "end": 1749.6400146484375,
      "text": " The psalmist often prays, God, teach me Thy statutes, teach me Thy Word."
    },
    {
      "id": 142,
      "start": 1750.1600341796875,
      "end": 1753.2400512695312,
      "text": " Listen, when you go to the Word of God, you ought to be praying that God would teach you"
    },
    {
      "id": 143,
      "start": 1753.2400512695312,
      "end": 1758.2000122070312,
      "text": " His will, and as you pray according to His will, He's teaching you the Word of God."
    },
    {
      "id": 144,
      "start": 1758.2000122070312,
      "end": 1759.9200439453125,
      "text": " It's amazing how this works."
    },
    {
      "id": 145,
      "start": 1759.9200439453125,
      "end": 1764.4800415039062,
      "text": " And we find that He would say, listen, if you would pray, God, would you be glorified"
    },
    {
      "id": 146,
      "start": 1764.4800415039062,
      "end": 1766.1800537109375,
      "text": " in my life?"
    },
    {
      "id": 147,
      "start": 1766.1800537109375,
      "end": 1768.8800659179688,
      "text": " Is that a prayer that's according to the will of God?"
    },
    {
      "id": 148,
      "start": 1768.8800659179688,
      "end": 1769.8800659179688,
      "text": " Certainly it is."
    },
    {
      "id": 149,
      "start": 1769.8800659179688,
      "end": 1771.280029296875,
      "text": " God, would you use me?"
    },
    {
      "id": 150,
      "start": 1771.280029296875,
      "end": 1773.0800170898438,
      "text": " Would you help me to be used of Thee?"
    },
    {
      "id": 151,
      "start": 1773.0800170898438,
      "end": 1778.7600708007812,
      "text": " Would you help me to live my life in such a way that You would be glorified?"
    },
    {
      "id": 152,
      "start": 1778.8800659179688,
      "end": 1783.9200439453125,
      "text": " So we'd say something like John the Baptist said, that he must increase, but I must decrease."
    },
    {
      "id": 153,
      "start": 1783.9200439453125,
      "end": 1785.6400146484375,
      "text": " God help me to glorify You."
    },
    {
      "id": 154,
      "start": 1785.6400146484375,
      "end": 1787.9600219726562,
      "text": " That's a prayer that's according to the will of God."
    },
    {
      "id": 155,
      "start": 1787.9600219726562,
      "end": 1789.9600219726562,
      "text": " That's a prayer that God desires to answer."
    },
    {
      "id": 156,
      "start": 1789.9600219726562,
      "end": 1792.2400512695312,
      "text": " God, would you help me to see others saved?"
    },
    {
      "id": 157,
      "start": 1792.2400512695312,
      "end": 1796.320068359375,
      "text": " Do you think that's a prayer that's according to the will of God?"
    },
    {
      "id": 158,
      "start": 1796.320068359375,
      "end": 1798.1200561523438,
      "text": " God give me opportunities."
    },
    {
      "id": 159,
      "start": 1798.1200561523438,
      "end": 1799.9600219726562,
      "text": " God help me to see the opportunities."
    },
    {
      "id": 0,
      "start": 1799.9600219726562,
      "end": 1803.0800218582153,
      "text": " By the way, I mentioned that we have some Christmas tracts that I put out."
    },
    {
      "id": 1,
      "start": 1803.0800218582153,
      "end": 1804.9200220108032,
      "text": " I gave out several of these yesterday."
    },
    {
      "id": 2,
      "start": 1804.9200220108032,
      "end": 1807.720022201538,
      "text": " You'd see how responsive people were to receiving these."
    },
    {
      "id": 3,
      "start": 1807.720022201538,
      "end": 1808.1200218200684,
      "text": " Why?"
    },
    {
      "id": 4,
      "start": 1808.1200218200684,
      "end": 1809.9600219726562,
      "text": " Hey, Merry Christmas with a smile."
    },
    {
      "id": 5,
      "start": 1809.9600219726562,
      "end": 1813.640022277832,
      "text": " By the way, don't be just a deadhead about it,"
    },
    {
      "id": 6,
      "start": 1813.640022277832,
      "end": 1816.1200218200684,
      "text": " but give a smile and give them a gospel tract."
    },
    {
      "id": 7,
      "start": 1816.1200218200684,
      "end": 1817.1600227355957,
      "text": " Tell them Merry Christmas."
    },
    {
      "id": 8,
      "start": 1817.1600227355957,
      "end": 1817.8800220489502,
      "text": " They're nice."
    },
    {
      "id": 9,
      "start": 1817.8800220489502,
      "end": 1819.2400226593018,
      "text": " They're attractive looking."
    },
    {
      "id": 10,
      "start": 1819.2400226593018,
      "end": 1820.6000213623047,
      "text": " Man, people took them."
    },
    {
      "id": 11,
      "start": 1820.6000213623047,
      "end": 1821.9600219726562,
      "text": " They appreciated it."
    },
    {
      "id": 12,
      "start": 1821.9600219726562,
      "end": 1823.8000221252441,
      "text": " Lord, give me opportunities."
    },
    {
      "id": 13,
      "start": 1824.4400215148926,
      "end": 1827.48002243042,
      "text": " God, help me to speak to others about you."
    },
    {
      "id": 14,
      "start": 1828.2800216674805,
      "end": 1830.1200218200684,
      "text": " That's a prayer that's according to his will."
    },
    {
      "id": 15,
      "start": 1830.7600212097168,
      "end": 1831.2400226593018,
      "text": " Amen?"
    },
    {
      "id": 16,
      "start": 1831.8800220489502,
      "end": 1835.8800201416016,
      "text": " Now, it may not be that praying,"
    },
    {
      "id": 17,
      "start": 1835.8800201416016,
      "end": 1840.6000213623047,
      "text": " Lord, would you please relieve me of this ailment, this infirmity?"
    },
    {
      "id": 18,
      "start": 1840.6000213623047,
      "end": 1846.040023803711,
      "text": " The reality is that God might say that it's my will that you have that."
    },
    {
      "id": 19,
      "start": 1848.3600234985352,
      "end": 1849.9600219726562,
      "text": " See, we don't like that kind of thing."
    },
    {
      "id": 20,
      "start": 1851.640022277832,
      "end": 1852.8400230407715,
      "text": " But Paul said this,"
    },
    {
      "id": 21,
      "start": 1853.640022277832,
      "end": 1857.1600227355957,
      "text": " that the things that happen to me happen for the furtherance of the gospel."
    },
    {
      "id": 22,
      "start": 1858.2800216674805,
      "end": 1860.920021057129,
      "text": " There are times that we might have difficulties,"
    },
    {
      "id": 23,
      "start": 1860.920021057129,
      "end": 1864.760025024414,
      "text": " and we might have health issues."
    },
    {
      "id": 24,
      "start": 1865.3200225830078,
      "end": 1869.0800247192383,
      "text": " We may have some other types of things going on in our lives,"
    },
    {
      "id": 25,
      "start": 1869.0800247192383,
      "end": 1872.4400253295898,
      "text": " and God says, I can deliver you from that,"
    },
    {
      "id": 26,
      "start": 1872.4400253295898,
      "end": 1876.2800216674805,
      "text": " but my will is for you to have that so that you can glorify me."
    },
    {
      "id": 27,
      "start": 1878.760025024414,
      "end": 1880.040023803711,
      "text": " Praying according to his will."
    },
    {
      "id": 28,
      "start": 1881.4000244140625,
      "end": 1883.1600189208984,
      "text": " Praying according to his will."
    },
    {
      "id": 29,
      "start": 1883.1600189208984,
      "end": 1886.2000198364258,
      "text": " Notice with me as we conclude in 1 John chapter 5,"
    },
    {
      "id": 30,
      "start": 1886.2000198364258,
      "end": 1889.8000183105469,
      "text": " and I begin to think about this really cycle, if you will,"
    },
    {
      "id": 31,
      "start": 1889.8000183105469,
      "end": 1894.6800231933594,
      "text": " and this praying and having confidence and knowing that God hears us,"
    },
    {
      "id": 32,
      "start": 1894.6800231933594,
      "end": 1896.760025024414,
      "text": " and then praying according to his will."
    },
    {
      "id": 33,
      "start": 1897.4000244140625,
      "end": 1899.9600219726562,
      "text": " I look at this passage of Scripture, and I've mentioned,"
    },
    {
      "id": 34,
      "start": 1899.9600219726562,
      "end": 1902.2800216674805,
      "text": " number one, that we notice a confidence that we're to have."
    },
    {
      "id": 35,
      "start": 1902.2800216674805,
      "end": 1904.52001953125,
      "text": " Number two, we notice the condition that is stated."
    },
    {
      "id": 36,
      "start": 1904.52001953125,
      "end": 1906.2000198364258,
      "text": " But number three, if you're taking notes,"
    },
    {
      "id": 37,
      "start": 1906.2000198364258,
      "end": 1909.2400207519531,
      "text": " we are to expect a closer walk with the Lord."
    },
    {
      "id": 38,
      "start": 1910.040023803711,
      "end": 1911.5600204467773,
      "text": " Pastor, what do you mean by that?"
    },
    {
      "id": 39,
      "start": 1911.5600204467773,
      "end": 1913.1600189208984,
      "text": " Well, I believe this is the product."
    },
    {
      "id": 40,
      "start": 1913.9600219726562,
      "end": 1919.0800247192383,
      "text": " We look at this wonderful promise that's given to us in 1 John 5, verses 14 and 15,"
    },
    {
      "id": 41,
      "start": 1919.0800247192383,
      "end": 1922.6000213623047,
      "text": " and we begin to understand the privilege that we have of prayer,"
    },
    {
      "id": 42,
      "start": 1922.6000213623047,
      "end": 1925.3200225830078,
      "text": " and we understand the promise that he's given us."
    },
    {
      "id": 43,
      "start": 1925.3200225830078,
      "end": 1929.3200225830078,
      "text": " I believe that the product will be a closer walk with the Lord."
    },
    {
      "id": 44,
      "start": 1929.9600219726562,
      "end": 1933.5600280761719,
      "text": " I've already mentioned this morning that it is the desire of God"
    },
    {
      "id": 45,
      "start": 1933.5600280761719,
      "end": 1935.4000244140625,
      "text": " that we would abide in him."
    },
    {
      "id": 46,
      "start": 1935.4000244140625,
      "end": 1938.3600158691406,
      "text": " John chapter 15 deals with that quite extensively."
    },
    {
      "id": 47,
      "start": 1938.3600158691406,
      "end": 1941.4000244140625,
      "text": " We've looked at 1 John chapter number one already this morning,"
    },
    {
      "id": 48,
      "start": 1942.040023803711,
      "end": 1946.2000274658203,
      "text": " and we've understood that God's desire is that we would have fellowship with him."
    },
    {
      "id": 49,
      "start": 1946.2000274658203,
      "end": 1949.3200225830078,
      "text": " And so as I begin to think about this passage of Scripture,"
    },
    {
      "id": 50,
      "start": 1949.3200225830078,
      "end": 1951.1600189208984,
      "text": " these two verses of Scripture,"
    },
    {
      "id": 51,
      "start": 1951.1600189208984,
      "end": 1953.7200164794922,
      "text": " and this confidence that we're to have in prayer,"
    },
    {
      "id": 52,
      "start": 1953.7200164794922,
      "end": 1957.0800170898438,
      "text": " and he says that if we know in verse number 15 that he hear us,"
    },
    {
      "id": 53,
      "start": 1957.0800170898438,
      "end": 1961.6400146484375,
      "text": " whatsoever we ask, we know that we have the petitions that we desired of him,"
    },
    {
      "id": 54,
      "start": 1961.6400146484375,
      "end": 1964.8400268554688,
      "text": " that we begin to understand that our God hears us,"
    },
    {
      "id": 55,
      "start": 1964.8400268554688,
      "end": 1967.000015258789,
      "text": " and we're to pray according to his will."
    },
    {
      "id": 56,
      "start": 1967.000015258789,
      "end": 1970.52001953125,
      "text": " And we said that in order to know his will, I spend time in his word."
    },
    {
      "id": 57,
      "start": 1970.52001953125,
      "end": 1972.280029296875,
      "text": " So think about this, if you will, with me,"
    },
    {
      "id": 58,
      "start": 1972.280029296875,
      "end": 1975.8800201416016,
      "text": " and I hope that I can effectively communicate this to you this morning."
    },
    {
      "id": 59,
      "start": 1975.8800201416016,
      "end": 1982.2000274658203,
      "text": " But as I spend time with God in his word, I'm able to determine what his will is."
    },
    {
      "id": 60,
      "start": 1983.000015258789,
      "end": 1987.8800201416016,
      "text": " And as I'm determining his will, it's shaping and forming my prayer life."
    },
    {
      "id": 61,
      "start": 1989.0800170898438,
      "end": 1995.8000183105469,
      "text": " And as I'm praying now according to his will, I'm seeing him answer prayers in my life."
    },
    {
      "id": 62,
      "start": 1996.6800231933594,
      "end": 2001.1600189208984,
      "text": " And as he answers prayer in my life, as he answers prayer in your life,"
    },
    {
      "id": 63,
      "start": 2001.1600189208984,
      "end": 2003.7200164794922,
      "text": " you know what it does? It increases your faith,"
    },
    {
      "id": 64,
      "start": 2003.7200164794922,
      "end": 2006.2000274658203,
      "text": " but it also causes you to want to pray more."
    },
    {
      "id": 65,
      "start": 2007.000015258789,
      "end": 2012.2000274658203,
      "text": " It causes you to want to know more the will of God to get into his word even more."
    },
    {
      "id": 66,
      "start": 2012.2000274658203,
      "end": 2016.4400177001953,
      "text": " And as we begin to see this truth that God is revealing to us"
    },
    {
      "id": 67,
      "start": 2016.4400177001953,
      "end": 2019.4800262451172,
      "text": " in these couple of verses of Scripture this morning,"
    },
    {
      "id": 68,
      "start": 2019.4800262451172,
      "end": 2022.4400177001953,
      "text": " and I believe that God wants us to understand this morning"
    },
    {
      "id": 69,
      "start": 2022.4400177001953,
      "end": 2028.2000274658203,
      "text": " that not only do we have this wonderful promise that God has given us with regard to prayer,"
    },
    {
      "id": 70,
      "start": 2028.2000274658203,
      "end": 2033.0800170898438,
      "text": " but really it is designed that we would be closer drawn to him."
    },
    {
      "id": 71,
      "start": 2034.3600158691406,
      "end": 2036.6800231933594,
      "text": " Understand this morning that God is not a genie."
    },
    {
      "id": 72,
      "start": 2037.8800201416016,
      "end": 2043.3200225830078,
      "text": " Some people have this idea, this make-believe idea that you get this genie,"
    },
    {
      "id": 73,
      "start": 2043.3200225830078,
      "end": 2045.8800201416016,
      "text": " and you rub this bottle, and you get these wishes."
    },
    {
      "id": 74,
      "start": 2045.8800201416016,
      "end": 2049.8800201416016,
      "text": " And sometimes people treat God and treat prayer in that way."
    },
    {
      "id": 75,
      "start": 2050.760025024414,
      "end": 2053.800018310547,
      "text": " We don't think about praying until we need something."
    },
    {
      "id": 76,
      "start": 2055.0800170898438,
      "end": 2059.800018310547,
      "text": " But as the people of God, when we understand that we're the sons of God,"
    },
    {
      "id": 77,
      "start": 2059.800018310547,
      "end": 2063.6400146484375,
      "text": " when we understand how much he loves us, and he wants us to abide in him,"
    },
    {
      "id": 78,
      "start": 2063.6400146484375,
      "end": 2065.7200317382812,
      "text": " and he wants us to have fellowship with him,"
    },
    {
      "id": 79,
      "start": 2065.7200317382812,
      "end": 2069.8800354003906,
      "text": " then I spend time in his word, and then I pray according to his will."
    },
    {
      "id": 80,
      "start": 2069.8800354003906,
      "end": 2072.6000366210938,
      "text": " It's interesting to me, the book of Proverbs,"
    },
    {
      "id": 81,
      "start": 2072.6000366210938,
      "end": 2074.8400268554688,
      "text": " turn over there if you will, Proverbs chapter 22,"
    },
    {
      "id": 82,
      "start": 2074.8400268554688,
      "end": 2078.52001953125,
      "text": " and I want to draw a connection, and I hope that it helps you this morning."
    },
    {
      "id": 83,
      "start": 2079.480010986328,
      "end": 2081.7200317382812,
      "text": " God help me with this, I was praying this morning,"
    },
    {
      "id": 84,
      "start": 2081.7200317382812,
      "end": 2085.6400146484375,
      "text": " God help me to effectively communicate this thought this morning,"
    },
    {
      "id": 85,
      "start": 2085.6400146484375,
      "end": 2089.000030517578,
      "text": " because God help me with this as I prepared this message"
    },
    {
      "id": 86,
      "start": 2089.000030517578,
      "end": 2093.240020751953,
      "text": " to understand how the promise and the privilege of prayer"
    },
    {
      "id": 87,
      "start": 2093.240020751953,
      "end": 2098.2000122070312,
      "text": " is really this product, this closer walk with God."
    },
    {
      "id": 88,
      "start": 2099.9600219726562,
      "end": 2103.480010986328,
      "text": " And God desires us to be in his presence,"
    },
    {
      "id": 89,
      "start": 2104.1200256347656,
      "end": 2106.8400268554688,
      "text": " to have this abiding walk with him."
    },
    {
      "id": 90,
      "start": 2107.1600341796875,
      "end": 2110.9200134277344,
      "text": " In Proverbs chapter 22, notice in verse number 17,"
    },
    {
      "id": 91,
      "start": 2110.9200134277344,
      "end": 2113.480010986328,
      "text": " and notice the phraseology, the Bible says this,"
    },
    {
      "id": 92,
      "start": 2113.480010986328,
      "end": 2117.240020751953,
      "text": " bow down thine ear, and hear the words of the wise,"
    },
    {
      "id": 93,
      "start": 2117.240020751953,
      "end": 2119.7200317382812,
      "text": " and apply thine heart unto my knowledge."
    },
    {
      "id": 94,
      "start": 2119.7200317382812,
      "end": 2123.8800354003906,
      "text": " And I want you to think about the picture that is given there in verse number 17,"
    },
    {
      "id": 95,
      "start": 2123.8800354003906,
      "end": 2128.280029296875,
      "text": " as I've tried to draw the truth here of us trying to determine"
    },
    {
      "id": 96,
      "start": 2128.280029296875,
      "end": 2130.280029296875,
      "text": " the will of God in the word of God."
    },
    {
      "id": 97,
      "start": 2130.280029296875,
      "end": 2132.760009765625,
      "text": " He says, bow down thine ear."
    },
    {
      "id": 98,
      "start": 2132.760009765625,
      "end": 2135.9600219726562,
      "text": " Do you get the picture that I'm listening intently,"
    },
    {
      "id": 99,
      "start": 2135.9600219726562,
      "end": 2137.4000244140625,
      "text": " that I'm listening intently,"
    },
    {
      "id": 100,
      "start": 2137.4000244140625,
      "end": 2142.52001953125,
      "text": " that I'm giving my attention to being able to hear,"
    },
    {
      "id": 101,
      "start": 2142.52001953125,
      "end": 2146.8400268554688,
      "text": " and to be able to know what God desires us to know."
    },
    {
      "id": 102,
      "start": 2146.8400268554688,
      "end": 2149.6400146484375,
      "text": " We find that here Solomon, of course, is speaking to his son,"
    },
    {
      "id": 103,
      "start": 2149.6400146484375,
      "end": 2152.6800231933594,
      "text": " but I believe that the greater picture of the book of Proverbs"
    },
    {
      "id": 104,
      "start": 2152.6800231933594,
      "end": 2155.000030517578,
      "text": " is not just Solomon speaking to Rehoboam,"
    },
    {
      "id": 105,
      "start": 2155.000030517578,
      "end": 2157.7200317382812,
      "text": " but God speaking to us as his children."
    },
    {
      "id": 106,
      "start": 2157.7200317382812,
      "end": 2160.6800231933594,
      "text": " And we find that he says, bow down thine ear."
    },
    {
      "id": 107,
      "start": 2160.6800231933594,
      "end": 2164.52001953125,
      "text": " Listen, sometimes we are so swift to speak,"
    },
    {
      "id": 108,
      "start": 2165.9600219726562,
      "end": 2166.9200134277344,
      "text": " and slow to hear,"
    },
    {
      "id": 109,
      "start": 2166.9200134277344,
      "end": 2170.280029296875,
      "text": " but the reality is that we're to be slow to speak and swift to hear."
    },
    {
      "id": 110,
      "start": 2172.280029296875,
      "end": 2173.560028076172,
      "text": " That's what God tells us."
    },
    {
      "id": 111,
      "start": 2175.1600341796875,
      "end": 2178.280029296875,
      "text": " Listen for the still, small voice."
    },
    {
      "id": 112,
      "start": 2179.240020751953,
      "end": 2182.6800231933594,
      "text": " Be still and know that I am God."
    },
    {
      "id": 113,
      "start": 2183.560028076172,
      "end": 2185.1600341796875,
      "text": " As we get into His presence,"
    },
    {
      "id": 114,
      "start": 2185.7200317382812,
      "end": 2189.0800170898438,
      "text": " and we're bowing down our ear to understand His will,"
    },
    {
      "id": 115,
      "start": 2189.0800170898438,
      "end": 2190.8400268554688,
      "text": " but then notice what the psalmist says,"
    },
    {
      "id": 116,
      "start": 2190.8400268554688,
      "end": 2193.6400146484375,
      "text": " turn to the book of Psalms, if you will, in Psalm 86,"
    },
    {
      "id": 117,
      "start": 2194.2000122070312,
      "end": 2196.040008544922,
      "text": " I want you to see what is said here."
    },
    {
      "id": 118,
      "start": 2196.040008544922,
      "end": 2198.52001953125,
      "text": " And I hope again, that it would help you this morning,"
    },
    {
      "id": 119,
      "start": 2198.52001953125,
      "end": 2201.560028076172,
      "text": " because as I am spending time in His word,"
    },
    {
      "id": 120,
      "start": 2201.560028076172,
      "end": 2205.240020751953,
      "text": " as I'm bowing down mine ear to hear and to understand,"
    },
    {
      "id": 121,
      "start": 2205.800018310547,
      "end": 2207.8800354003906,
      "text": " and to learn what the will of God is,"
    },
    {
      "id": 122,
      "start": 2207.8800354003906,
      "end": 2210.3600158691406,
      "text": " that will then shape my prayer life,"
    },
    {
      "id": 123,
      "start": 2210.3600158691406,
      "end": 2213.7200317382812,
      "text": " because I am to pray according to His will."
    },
    {
      "id": 124,
      "start": 2213.7200317382812,
      "end": 2216.2000122070312,
      "text": " And we know that if we pray according to His will,"
    },
    {
      "id": 125,
      "start": 2216.2000122070312,
      "end": 2217.3200073242188,
      "text": " that He's going to answer."
    },
    {
      "id": 126,
      "start": 2217.3200073242188,
      "end": 2219.4000244140625,
      "text": " And I see prayers answered in my life,"
    },
    {
      "id": 127,
      "start": 2219.4000244140625,
      "end": 2221.7200317382812,
      "text": " and I'm encouraged, and I'm strengthened,"
    },
    {
      "id": 128,
      "start": 2221.8800354003906,
      "end": 2225.560028076172,
      "text": " and my faith is increased, and I'm drawn closer to Him,"
    },
    {
      "id": 129,
      "start": 2225.560028076172,
      "end": 2228.9200134277344,
      "text": " and I'm praying more, and I'm seeking Him more."
    },
    {
      "id": 130,
      "start": 2228.9200134277344,
      "end": 2231.1600341796875,
      "text": " And it's a wonderful result,"
    },
    {
      "id": 131,
      "start": 2231.1600341796875,
      "end": 2234.3600158691406,
      "text": " a product of this privilege and this promise"
    },
    {
      "id": 132,
      "start": 2234.3600158691406,
      "end": 2235.560028076172,
      "text": " that He's given us of prayer."
    },
    {
      "id": 133,
      "start": 2235.560028076172,
      "end": 2239.7200317382812,
      "text": " But I want you to notice what the psalmist says in Psalm 86."
    },
    {
      "id": 134,
      "start": 2239.7200317382812,
      "end": 2242.280029296875,
      "text": " We read what the wise man said in Proverbs"
    },
    {
      "id": 135,
      "start": 2242.280029296875,
      "end": 2245.1600341796875,
      "text": " about us bowing down our ear to His word."
    },
    {
      "id": 136,
      "start": 2245.1600341796875,
      "end": 2248.760009765625,
      "text": " But notice what the psalmist says in verse one of Psalm 86."
    },
    {
      "id": 137,
      "start": 2249.3200073242188,
      "end": 2253.3200073242188,
      "text": " \"'Bow down thine ear, O Lord."
    },
    {
      "id": 138,
      "start": 2254.3600158691406,
      "end": 2258.6000366210938,
      "text": " \"'Hear me, for I am poor and needy.'\""
    },
    {
      "id": 139,
      "start": 2260.6800231933594,
      "end": 2264.6000366210938,
      "text": " We want God to bow down His ear to hear our prayers,"
    },
    {
      "id": 140,
      "start": 2265.8800354003906,
      "end": 2269.6400146484375,
      "text": " but we must first bow down our ear to understand His will."
    },
    {
      "id": 141,
      "start": 2270.6800231933594,
      "end": 2273.800018310547,
      "text": " And as I bow down mine ear to understand His will,"
    },
    {
      "id": 142,
      "start": 2273.800018310547,
      "end": 2275.8800354003906,
      "text": " and I pray according to His will,"
    },
    {
      "id": 143,
      "start": 2276.280029296875,
      "end": 2281.000030517578,
      "text": " I can have confidence that He's gonna bow down His ear"
    },
    {
      "id": 144,
      "start": 2281.000030517578,
      "end": 2284.8400268554688,
      "text": " to hear my prayer and to answer my prayer."
    },
    {
      "id": 145,
      "start": 2284.8400268554688,
      "end": 2287.1600341796875,
      "text": " For indeed, I can relate to the psalmist,"
    },
    {
      "id": 146,
      "start": 2287.1600341796875,
      "end": 2291.3200073242188,
      "text": " I am poor and needy, amen."
    },
    {
      "id": 147,
      "start": 2292.280029296875,
      "end": 2297.4000244140625,
      "text": " And we find that as God has given us this privilege"
    },
    {
      "id": 148,
      "start": 2297.4000244140625,
      "end": 2299.0800170898438,
      "text": " and this promise of prayer,"
    },
    {
      "id": 149,
      "start": 2299.0800170898438,
      "end": 2300.8400268554688,
      "text": " and He wants us to have confidence,"
    },
    {
      "id": 150,
      "start": 2300.8400268554688,
      "end": 2303.800018310547,
      "text": " but really when we dig in and we understand"
    },
    {
      "id": 151,
      "start": 2303.8800354003906,
      "end": 2307.480010986328,
      "text": " what He's packaging for us and how He's giving us"
    },
    {
      "id": 152,
      "start": 2307.480010986328,
      "end": 2310.2000122070312,
      "text": " and providing this truth for us,"
    },
    {
      "id": 153,
      "start": 2310.2000122070312,
      "end": 2312.0400390625,
      "text": " He's really leading us to a place"
    },
    {
      "id": 154,
      "start": 2312.0400390625,
      "end": 2315.2400512695312,
      "text": " where I'm developing a closer walk with Him,"
    },
    {
      "id": 155,
      "start": 2316.1199951171875,
      "end": 2318.0400390625,
      "text": " just a closer walk with Him."
    },
    {
      "id": 156,
      "start": 2318.0400390625,
      "end": 2321.4800415039062,
      "text": " Listen, this ought to be not only the expectation,"
    },
    {
      "id": 157,
      "start": 2322.0400390625,
      "end": 2324.3600463867188,
      "text": " but it ought to be the desire of every child of God"
    },
    {
      "id": 158,
      "start": 2325.1600341796875,
      "end": 2327.7200317382812,
      "text": " to be closer drawn to my Savior,"
    },
    {
      "id": 159,
      "start": 2328.8400268554688,
      "end": 2331.0800170898438,
      "text": " that I would be in His presence."
    },
    {
      "id": 160,
      "start": 2332.0400390625,
      "end": 2337.2400512695312,
      "text": " See, I don't want to just be a nominal Christian."
    },
    {
      "id": 161,
      "start": 2339.0800170898438,
      "end": 2343.0,
      "text": " I don't want to just be a surface flounder around,"
    },
    {
      "id": 162,
      "start": 2344.280029296875,
      "end": 2347.0,
      "text": " just kind of convenient Christian."
    },
    {
      "id": 163,
      "start": 2349.9600219726562,
      "end": 2350.8400268554688,
      "text": " I want to be all in."
    },
    {
      "id": 164,
      "start": 2352.0400390625,
      "end": 2353.7200317382812,
      "text": " I want to be close to my God."
    },
    {
      "id": 165,
      "start": 2354.760009765625,
      "end": 2356.280029296875,
      "text": " And I have the promise that He's given"
    },
    {
      "id": 166,
      "start": 2356.280029296875,
      "end": 2358.6000366210938,
      "text": " that if we draw nigh to Him, He'll draw nigh to us."
    },
    {
      "id": 167,
      "start": 2359.4000244140625,
      "end": 2361.8800048828125,
      "text": " And when we understand this truth of prayer,"
    },
    {
      "id": 168,
      "start": 2361.8800048828125,
      "end": 2366.280029296875,
      "text": " it's not just so that we can give our whole list"
    },
    {
      "id": 169,
      "start": 2366.280029296875,
      "end": 2367.4000244140625,
      "text": " of wants and whatever."
    },
    {
      "id": 170,
      "start": 2367.4000244140625,
      "end": 2369.2400512695312,
      "text": " No, no, no, we begin to say,"
    },
    {
      "id": 171,
      "start": 2369.2400512695312,
      "end": 2370.6799926757812,
      "text": " I'm praying according to His will."
    },
    {
      "id": 172,
      "start": 2371.800048828125,
      "end": 2374.8400268554688,
      "text": " How often I would challenge myself"
    },
    {
      "id": 173,
      "start": 2374.8400268554688,
      "end": 2376.4400024414062,
      "text": " and I would challenge you this morning"
    },
    {
      "id": 174,
      "start": 2377.0800170898438,
      "end": 2378.52001953125,
      "text": " to evaluate your prayer life"
    },
    {
      "id": 175,
      "start": 2378.52001953125,
      "end": 2380.760009765625,
      "text": " and see how much of it is according to His will."
    },
    {
      "id": 176,
      "start": 2382.280029296875,
      "end": 2384.6000366210938,
      "text": " I mentioned before about praying out loud."
    },
    {
      "id": 177,
      "start": 2385.4800415039062,
      "end": 2388.1199951171875,
      "text": " I mentioned also about recording yourself praying."
    },
    {
      "id": 178,
      "start": 2389.4800415039062,
      "end": 2391.9600219726562,
      "text": " I'm not sure if anyone's ever taken me up on that suggestion."
    },
    {
      "id": 179,
      "start": 2391.9600219726562,
      "end": 2393.2400512695312,
      "text": " I've done it personally."
    },
    {
      "id": 180,
      "start": 2394.52001953125,
      "end": 2396.6000366210938,
      "text": " I've taken my phone and I've started record"
    },
    {
      "id": 181,
      "start": 2396.6000366210938,
      "end": 2397.800048828125,
      "text": " and I've prayed out loud."
    },
    {
      "id": 182,
      "start": 2398.4400024414062,
      "end": 2399.800048828125,
      "text": " If I could go back and hear."
    },
    {
      "id": 0,
      "start": 2399.800048828125,
      "end": 2400.800048828125,
      "text": " Why?"
    },
    {
      "id": 1,
      "start": 2400.800048828125,
      "end": 2408.800048828125,
      "text": " It helps me to be able to evaluate, am I praying according to His will?"
    },
    {
      "id": 2,
      "start": 2408.800048828125,
      "end": 2410.3200492858887,
      "text": " Am I rambling?"
    },
    {
      "id": 3,
      "start": 2410.3200492858887,
      "end": 2411.720048904419,
      "text": " Am I just all over the place?"
    },
    {
      "id": 4,
      "start": 2411.720048904419,
      "end": 2413.840048789978,
      "text": " Is there some direction in my prayer?"
    },
    {
      "id": 5,
      "start": 2413.840048789978,
      "end": 2417.720048904419,
      "text": " I wouldn't do it every week, personally."
    },
    {
      "id": 6,
      "start": 2417.720048904419,
      "end": 2425.6000480651855,
      "text": " It was convicting, but it was helpful because we're to pray according to His will."
    },
    {
      "id": 7,
      "start": 2425.6000480651855,
      "end": 2429.0800495147705,
      "text": " And as we pray according to His will, we have this great promise."
    },
    {
      "id": 8,
      "start": 2429.0800495147705,
      "end": 2433.080047607422,
      "text": " And as we see God answer prayer, listen, I hope it works this way in your life, it works"
    },
    {
      "id": 9,
      "start": 2433.080047607422,
      "end": 2434.080047607422,
      "text": " this way in my life."
    },
    {
      "id": 10,
      "start": 2434.080047607422,
      "end": 2437.800048828125,
      "text": " When I see God answer prayer, I desire to pray more."
    },
    {
      "id": 11,
      "start": 2437.800048828125,
      "end": 2442.240047454834,
      "text": " You see God answer prayer, and you see God answer prayer, and you're drawn closer to"
    },
    {
      "id": 12,
      "start": 2442.240047454834,
      "end": 2445.4200477600098,
      "text": " Him, and you're studying His word, and you're learning His will, and you're praying according"
    },
    {
      "id": 13,
      "start": 2445.4200477600098,
      "end": 2451.040050506592,
      "text": " to His will, and you're seeing Him answer prayer, and you're just drawn closer and closer"
    },
    {
      "id": 14,
      "start": 2451.040050506592,
      "end": 2454.2600479125977,
      "text": " and closer to God."
    },
    {
      "id": 15,
      "start": 2454.2600479125977,
      "end": 2456.540050506592,
      "text": " We find that we're to walk with Him."
    },
    {
      "id": 16,
      "start": 2456.540050506592,
      "end": 2458.9400482177734,
      "text": " Enoch had this testimony."
    },
    {
      "id": 17,
      "start": 2458.9400482177734,
      "end": 2463.060047149658,
      "text": " He walked with God, and he was not, for God took him."
    },
    {
      "id": 18,
      "start": 2463.060047149658,
      "end": 2465.7400512695312,
      "text": " Noah was a man that walked with God."
    },
    {
      "id": 19,
      "start": 2465.7400512695312,
      "end": 2469.1400451660156,
      "text": " We could begin to look at other examples in the Word of God of those that walked with"
    },
    {
      "id": 20,
      "start": 2469.1400451660156,
      "end": 2471.1400451660156,
      "text": " God."
    },
    {
      "id": 21,
      "start": 2471.1400451660156,
      "end": 2475.1400451660156,
      "text": " And we find this morning that we're to have confidence in prayer."
    },
    {
      "id": 22,
      "start": 2475.1400451660156,
      "end": 2481.4600524902344,
      "text": " There's a condition that is stated, but what thrills my soul is this product, this closer"
    },
    {
      "id": 23,
      "start": 2481.4600524902344,
      "end": 2484.0600509643555,
      "text": " walk with God."
    },
    {
      "id": 24,
      "start": 2484.0600509643555,
      "end": 2489.2200469970703,
      "text": " And I hope this morning that it's not only something that we can expect to be the product,"
    },
    {
      "id": 25,
      "start": 2489.2200469970703,
      "end": 2498.620048522949,
      "text": " but it is something that I truly desire, that you truly desire, a closer walk with Thee."
    },
    {
      "id": 26,
      "start": 2498.620048522949,
      "end": 2499.620048522949,
      "text": " Let's pray together."
    },
    {
      "id": 27,
      "start": 2499.620048522949,
      "end": 2501.300048828125,
      "text": " Father, we love You."
    },
    {
      "id": 28,
      "start": 2501.300048828125,
      "end": 2504.1600494384766,
      "text": " We thank You so much for loving us."
    },
    {
      "id": 29,
      "start": 2504.1600494384766,
      "end": 2507.700050354004,
      "text": " We thank You for the privilege of being able to gather together this morning."
    },
    {
      "id": 30,
      "start": 2507.700050354004,
      "end": 2510.0600509643555,
      "text": " We thank You for the truth of Your Word."
    },
    {
      "id": 31,
      "start": 2510.0600509643555,
      "end": 2513.580047607422,
      "text": " God, we thank You that You're a God who hears and answers prayer."
    },
    {
      "id": 32,
      "start": 2514.100051879883,
      "end": 2519.300048828125,
      "text": " We're thankful that You're able to do exceeding abundantly above all that we ask or think."
    },
    {
      "id": 33,
      "start": 2519.300048828125,
      "end": 2524.100051879883,
      "text": " We thank You for the countless promises that You've given us in Your Word with regard to"
    },
    {
      "id": 34,
      "start": 2524.100051879883,
      "end": 2525.680046081543,
      "text": " answered prayer."
    },
    {
      "id": 35,
      "start": 2525.680046081543,
      "end": 2532.3800506591797,
      "text": " We thank You for the multitudes of examples that You've given us in Your Word of You answering"
    },
    {
      "id": 36,
      "start": 2532.3800506591797,
      "end": 2539.6200561523438,
      "text": " prayer, of responding to those of Your children that have prayed with those words, I have"
    },
    {
      "id": 37,
      "start": 2539.6200561523438,
      "end": 2541.300048828125,
      "text": " heard Thy prayer."
    },
    {
      "id": 38,
      "start": 2542.020050048828,
      "end": 2547.6200561523438,
      "text": " God, I pray that You'd help us to understand this morning the great privilege that is ours"
    },
    {
      "id": 39,
      "start": 2547.6200561523438,
      "end": 2548.6200561523438,
      "text": " to pray."
    },
    {
      "id": 40,
      "start": 2548.6200561523438,
      "end": 2553.7400512695312,
      "text": " I pray, God, that You'd help us to understand this morning this promise that You've given"
    },
    {
      "id": 41,
      "start": 2553.7400512695312,
      "end": 2559.2200469970703,
      "text": " to us and the condition that is stated with regard to the according to His will."
    },
    {
      "id": 42,
      "start": 2559.2200469970703,
      "end": 2566.1800537109375,
      "text": " God, I pray that as we desire to be people of prayer, men and women of prayer, boys and"
    },
    {
      "id": 43,
      "start": 2566.1800537109375,
      "end": 2574.780044555664,
      "text": " girls of prayer, that God, we would seek Your will through Your Word so that we would"
    },
    {
      "id": 44,
      "start": 2574.780044555664,
      "end": 2577.9800415039062,
      "text": " truly pray according to Your will."
    },
    {
      "id": 45,
      "start": 2577.9800415039062,
      "end": 2587.1800537109375,
      "text": " God, I pray that as we see You answer, see You work and move, as we pray according to"
    },
    {
      "id": 46,
      "start": 2587.1800537109375,
      "end": 2593.7400512695312,
      "text": " Your will and You answer in mighty ways, God, it's my prayer that it would cause us to draw"
    },
    {
      "id": 47,
      "start": 2593.7400512695312,
      "end": 2595.6200561523438,
      "text": " closer to Thee."
    },
    {
      "id": 48,
      "start": 2595.6200561523438,
      "end": 2600.4600524902344,
      "text": " I pray that that would be the desire of every individual that's present this morning."
    },
    {
      "id": 49,
      "start": 2600.4600524902344,
      "end": 2605.9800415039062,
      "text": " Lord, if there's one that's not sure of heaven, they've never trusted the Lord Jesus Christ"
    },
    {
      "id": 50,
      "start": 2605.9800415039062,
      "end": 2607.9400482177734,
      "text": " as their personal Savior."
    },
    {
      "id": 51,
      "start": 2607.9400482177734,
      "end": 2610.3800506591797,
      "text": " We know that it is Your will that they would be saved."
    },
    {
      "id": 52,
      "start": 2610.3800506591797,
      "end": 2614.260055541992,
      "text": " It is our prayer this morning that You would save them, Lord, that they would understand"
    },
    {
      "id": 53,
      "start": 2614.260055541992,
      "end": 2618.6600494384766,
      "text": " that the Holy Spirit of God would convict them of their sin and of Christ's righteousness"
    },
    {
      "id": 54,
      "start": 2618.6600494384766,
      "end": 2621.3800506591797,
      "text": " and of judgment to come."
    },
    {
      "id": 55,
      "start": 2621.3800506591797,
      "end": 2626.100051879883,
      "text": " They would understand that they're a sinner and there's only one Savior, His name is Jesus."
    },
    {
      "id": 56,
      "start": 2626.100051879883,
      "end": 2628.020050048828,
      "text": " He lived a perfect and sinless life."
    },
    {
      "id": 57,
      "start": 2628.020050048828,
      "end": 2630.100051879883,
      "text": " He went to a cruel cross."
    },
    {
      "id": 58,
      "start": 2630.100051879883,
      "end": 2631.100051879883,
      "text": " He bled and He died."
    },
    {
      "id": 59,
      "start": 2631.100051879883,
      "end": 2636.1400451660156,
      "text": " He was buried in a borrowed tomb and He rose conquering sin, death, and the grave."
    },
    {
      "id": 60,
      "start": 2636.1400451660156,
      "end": 2638.8600463867188,
      "text": " There's one here, one on livestream that's not sure of heaven."
    },
    {
      "id": 61,
      "start": 2638.8600463867188,
      "end": 2640.100051879883,
      "text": " God, would You save them today?"
    },
    {
      "id": 62,
      "start": 2640.100051879883,
      "end": 2642.340042114258,
      "text": " Would You help them to call out to Thee?"
    },
    {
      "id": 63,
      "start": 2642.340042114258,
      "end": 2647.1800537109375,
      "text": " Would they take the promise that's been given, for whosoever shall call upon the name of"
    },
    {
      "id": 64,
      "start": 2647.1800537109375,
      "end": 2649.9800415039062,
      "text": " the Lord shall be saved?"
    },
    {
      "id": 65,
      "start": 2649.9800415039062,
      "end": 2653.020050048828,
      "text": " Father for every child of God, every one that's here that's been saved, that's been"
    },
    {
      "id": 66,
      "start": 2653.020050048828,
      "end": 2657.3800354003906,
      "text": " born again, I pray that we desire to have a closer walk with Thee."
    },
    {
      "id": 67,
      "start": 2657.3800354003906,
      "end": 2662.4200439453125,
      "text": " Lord, that You'd help us to get into Your Word, dig into Your Word to know Your will"
    },
    {
      "id": 68,
      "start": 2662.4200439453125,
      "end": 2665.4200439453125,
      "text": " and then to pray according to Thy will."
    },
    {
      "id": 69,
      "start": 2665.4200439453125,
      "end": 2668.7400512695312,
      "text": " In these few moments of invitation, we pray that You'd have Your will in way, that You'd"
    },
    {
      "id": 70,
      "start": 2668.7400512695312,
      "end": 2672.7400512695312,
      "text": " work as only You can and we'll be careful to give You the honor and glory for it's in"
    },
    {
      "id": 71,
      "start": 2672.7400512695312,
      "end": 2674.6600341796875,
      "text": " Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T11:30:23.485363"
}