{
  "video_id": "KVAB3-ajXLM",
  "text": "passage of scripture. I hope that as we examine this portion of scripture this morning that we would be challenged. I trust that we'd be encouraged as we look at this familiar passage, but also that God would challenge us. I'm mindful of some New Testament truth. If you look in, you're there in Daniel, but I consider the truth with regard to the Apostle Paul speaking to the church in Ephesus. What's funny, Steve? You're good? Okay, I thought something, Jim's taking his thing like this, so I didn't know if something was going on behind me. And in Ephesians, of course, the Apostle Paul is encouraging the believers in Ephesus with regard to their walk with God. Of course, the foundation in the first few chapters is established with regard to their relationship to God through the Lord Jesus Christ, and then he addresses their walk, and he comes to the final chapter in the book of Ephesians, and as he gets to the latter part of that chapter, he begins to talk about the spiritual warfare in which were engaged. And in so doing, he begins to challenge the believers in Ephesus to stand, and he tells them that they are to be strong in the power of the Lord, and we find that as we would examine and consider the admonition, if you will, that the Apostle Paul gives to the church at Ephesus and to the believers there, and he tells them not only be strong in the power of the Lord, but he tells them to put on the whole armor of God, and he says this, that you may be able to stand against the wiles of the devil. He then tells them we're not engaged in some sort of wrestling match, some sort of fleshly carnal battle. No, it's a spiritual battle in which we are engaged in. And we begin to think about the, really, the admonition that Paul gives to these believers as he's instructing them, and I find this morning that each generation will face unique pressures to bow or to conform to the current ideologies. We find that we're living in a particular era in which we, as this generation, we are facing certain pressures to bow, to conform to the ideologies that exist, and we find that each generation is going to face such circumstances. The believers that Paul is referencing and ministering to in Ephesus, they had their own set of circumstances that they faced, and they had to stand in the power of God, and they had to be willing to yield themselves to God. They had to be willing to walk in the Spirit so that they would not fulfill the lust of the flesh, and we find that for the passage of Scripture that we're going to look at this morning in Daniel 3, we find that these three Hebrew children that we often are familiar with, Shadrach, Meshach, and Abednego, these fellas, they faced unique circumstances with regard to the pressures of their day, and we find that they were willing to stand. If you've already looked at the bulletin on the back, the title for the message this morning is really a question, and the question is this, are you willing to stand? Am I willing to stand? Again, each generation is going to have its opportunity to face the pressures and the ideologies that exist within that particular society and culture, and the question is whether or not the people of God will stand. We find that as we look at a passage like Daniel 3, we rejoice greatly in understanding what takes place, and we're familiar with the passage of Scripture, and we say, man, this is wonderful, look at how God worked, look at what God did, but it's because there were some people of God that stood, that were willing to take a stand no matter what the pressures were, no matter what the consequences were that they would face, they were willing to take a stand, and the question is we look through history, not only biblical history, but we look at modern history and look at the church history through the ages, and you can find individuals and groups of people that stood for truth, and I wonder this morning, I wonder in our generation who among us would be written about that we were willing to stand, that we might encourage a future generation in like fashion as we have been encouraged by those who have gone before us that were willing to take a stand. As we notice in our passage of Scripture here in Daniel 3, let me just read some verses, we'll get into the message. I'm gonna try to look at all 30 verses, and notice in verse number one the Bible says this, Nebuchadnezzar the king made an image of gold whose height was three square cubits and the breadth thereof six cubits. He set it up in the plain of Dura in the province of Babylon. We understand that Nebuchadnezzar is the king of the Babylonian Empire, we understand that he has great power, we find that as you look at the history with regard to this kingdom and you'd understand the power in which this man had when he's going to put up this image of gold, this 90-foot image, and he's going to give some requirements that we'll look at in just a few moments, you understand that he had power to make happen what he said would happen. And as we look at the passage of Scripture and we consider the question, are you willing to stand? I want us to consider a few things. Number one, consider with me the circumstances these men faced. Consider the circumstances they faced. Now admittedly, right from the beginning this morning, we understand that the circumstances that are faced in Daniel 3 are different than the circumstances that you will face, they're different than the circumstances that I will face, they're different than the circumstances that Paul faced and the believers in Ephesus faced, but each generation is going to have a set of circumstances, some ideologies that are in opposition to God's Word that we're gonna face. And here in Daniel 3, we find as we've read in verse number one that this golden image is set up and in verse 2 it says then Nebuchadnezzar the king sent to gather together, notice, the princes, the governors, and the captains, the judges, the treasurers, the counselors, the sheriffs, and all the rulers of the provinces to come. For what? They were gonna have this dedication, it says, to come to the dedication of the image which Nebuchadnezzar the king had set up. Then, in response to this edict, if you will, that was made, it says the princes, the governors, and captains, the judges, the treasurers, the counselors, the sheriffs, and all the rulers of the provinces were gathered together under the dedication of the image that Nebuchadnezzar the king had set up. And they stood before the image that Nebuchadnezzar had set up. Then, and Harold cried aloud, to you, notice, it is commanded, O people, nations, and languages, that at what time you hear the sound of the cornet, flute, harp, samba, psaltery, dulcimer, and all kinds of music, you fall down and worship the golden image that Nebuchadnezzar the king hath set up. Now, here's where it gets complicated for these three Hebrew children. We find that Shadrach, Meshach, and Abednego, they've already been taken into Babylon. Of course, Nebuchadnezzar and the Babylonians would conquer Judah, and we find that these fellows, along with Daniel, they were in captivity. They're there in Babylon. If you read the first couple of chapters, you see in which the way in which they were sought to be indoctrinated. In chapter number one, you read about the indoctrination program that the Babylonians had for those that they would bring in, and you find that here, this Harold cries, listen, the instruction, the command was clear. It was not ambiguous whatsoever, but the command violated a greater command, and that was a command that God had given. And we find that as here, these men would hear this instruction, as this Harold would cry aloud and say, here's what is required of you. You're gonna hear the music play, and when that happens, you fall down and worship. Worship an image? Yes, fall down and worship. And we find that as the music would play, as they would prepare for this, that not only was the command known, but the consequences were known. We find that in verse number six, the Bible says, and whoso falleth not down and worshipeth shall the same hour be cast in the midst of a burning, fiery furnace. The stakes were high. The situation, the circumstances that they faced were serious. We find that the stakes are high. They understand the command that is given. Again, this command is not ambiguous. It's extremely clear. We've created this image. We've set up this golden image, and we're gonna have some musicians play some music, and you're going to bow and worship. And if not, in the same hour, the burning, fiery furnace. Can you imagine the predicament that these men are in? Can you imagine as they're in this situation, and we find that just as we look at the circumstances, we find that these pressures that they faced, again, different than the pressures that we would face. We understand that the pressures are varied, but we would understand also that they're certain. We will face pressures. We are facing pressures. And we find that as we look here at this passage of Scripture that says in verse number 7, \"...therefore at that time when all the people...\" heard the sound of the cornet, flute, harp, sakhba, psaltery, and all kinds of music, notice the next three words, all the people, the nations and the languages fell down and worshipped. What did they do? They worshipped the golden image that Nebuchadnezzar the king had set up. Whether it was out of this, of course, we understand as you'd look at the Babylonian Empire and look at their culture and society, an idolatrous people, a people that served a multiplicity of gods, and we find that there's some that would be bowing down in worship because it was just custom in their culture. There are others no doubt that did this out of fear. They understood the circumstances, they understood the consequences, and they said, I'm not going to a burning fiery furnace. I understand that Nebuchadnezzar has the power to fulfill that which he said would be the consequence. These people bow down and they worship, but in verses 8 through 12 we are introduced to people that we have become familiar with as New Testament believers, to these three Hebrew children that were willing to stand. The Bible says in verse number 8, Wherefore at that time certain Chaldeans came near and accused the Jews. They spake and said to the king Nebuchadnezzar, O king, live forever! Thou, O king, hast made a decree that every man that shall hear the sound of the cornet, flute, harp, sakhba, psaltery, and dulcimer, and all kinds of music, shall fall down and worship the golden image. And whoso falleth not down and worshipeth that he should be cast in the midst of a burning fiery furnace. They knew what had been commanded. They repeated to the king the edict that he had put forth, and they say, There are certain Jews, in verse number 12, whom thou hast set over the affairs of the province of Babylon. Shadrach, Meshach, and Abednego. These men, O king, have not regarded thee. They serve not thy gods, nor worship the golden image which thou hast set up. And we ought to say, Amen! They took a stand. And we find that the stand is taken in verse number 12. These certain, these Jews are accused by these that are mentioned in verse number 8, these Chaldeans that come to Nebuchadnezzar. Hey listen, there's some guys over here that they didn't bow down. They didn't follow what you told them to do. So Nebuchadnezzar, he's not real pleased with hearing this news. And the Bible tells us in verse number 13 that in his rage and fury, he commanded to bring these fellas into his presence. Can you imagine? I mean listen, I understand this morning that most all of us, you could probably tell us the account. But I just wonder this morning if you can put yourself in the shoes of these fellas. I'm talking about not understanding that they're gonna come out of the fiery furnace. I'm talking about understanding that you didn't bow. You took a stand. You stood for what was right. And then the king says, bring them here. And you're being marched into the presence of this particular time of the most powerful human being on the face of the earth. And he's furious. And he has all this power. And he says, as he approaches these men coming to his presence, he says this in verse number 14. Is it true, O Shadrach, Meshach, and Abednego, do not ye serve my gods, nor worship the golden image which I have set up? Now, if ye be ready, that at what time ye hear the sound of the cornet, flute, harp, sackbutt, psalter, and dulcimer, and all kinds of music, ye fall down and worship the image which I have made well. But if you worship not, ye should be cast the same hour into the midst of a burning fiery furnace. Notice the question that ends verse number 15. And who is that God that shall deliver you out of my hands? Do you see the pride of Nebuchadnezzar? I mean, you look and you understand what Nebuchadnezzar is saying. And he's saying, almost if I could paraphrase it, I'm gonna give you guys another chance. Maybe you didn't fully understand what I had commanded. Maybe you didn't understand the consequences, and you violated it the first time. So now I'm gonna give you another opportunity. And we're gonna play the music again. And if you bow well. You know, a lot of people are looking for well. A lot of people are looking for comfort and ease, and just kind of go with the flow. You know what I mean? How is it that we can just kind of make our way through this crazy society? I'm gonna tell you, we're gonna have to stand. We're gonna have to stand. This world has lost its mind. There's no more moral code of standard that is based on anything that is close to the Word of God which we believe and preach. We find that we're living in a really, as some have tried to coin it, a post-truth type of an era in which truth is just relative. It's your truth, and it's my truth, and it's their truth. I'm sorry to tell you, but the Word of God is truth. The Bible says, Thy Word is truth. Jesus Christ said, I am the way, the truth, and the life. And we find that we have truth. Listen, I'm not trying to be ugly with anyone. I'm not trying to cause myself to have enemies. I like people to like me. Do you like having enemies? Come on. I want people to like me. But I'm much more concerned with God being pleased with my life. Because we're gonna stand before him one day, and these guys, they hear the King. So we're gonna give you another chance. Can you imagine in that moment? Can you imagine the pressures in that moment? Three of you, the most powerful man on the earth at that particular time, humanly speaking, and he says, here's what we're gonna do. We're gonna play the music. In your sanctified imagination, can you hear the music playing and see those men stand? They just stand. Wow, what circumstances they faced. I want you to consider the confidence they displayed. We consider the circumstances really in verses 1 through 15, and the next few verses, verses 16 through 18. I want you to consider this confidence in which they displayed. I believe that they had confidence in what God was able to do. The Bible says in verse number 16, Shadrach, Meshach, and Abednego answered and said to the king, O Nebuchadnezzar, we are not careful to answer thee in this matter. If it be so, you understand what they're saying? If what you just told us is gonna be what's gonna happen, if that's gonna happen, we want you to know something. Our God, whom we serve, is able to deliver us from the burning fiery furnace. And, by the way, he will deliver us out of thine hand, O king. I wonder this morning, how much confidence do we have in what God is able to do? Honestly, how much confidence do we have in what God is able to do? We understand that Paul says to that same group of people in Ephesus, now unto him which is able to do exceeding abundantly above all that we ask or think. We know that the Scriptures are, throughout the entirety of God's Word, revealed to us. They're full of example of what God is able to do. We find that the questions are asked when God stands before Abraham, and he says to Abraham, I am the Lord God Almighty, El Shaddai. He says, Abraham, and just a little while after he reveals himself in that manner, he says, is anything too hard for me? Oh, do we have confidence in what God is able to do? Are we in a place where we're willing to exercise that faith that is revealed here in these verses of Scripture? Oh, the great confidence. Listen, if you've seen God work, if you've read this book and you've allowed this book to influence and impact your life, and you let the Word of God build your faith as it says it will, we find that we can have great confidence in what God is able to do. So I don't know how God's gonna do it. I don't think they knew how God was gonna do it either. They just believed that God was able. Notice what they say in verse number 18. But if not, I believe what they're saying here is if he doesn't deliver us out of the burning fiery furnace, they knew that he would deliver him out of the hand of the king. They knew that God was able to deliver him from the burning fiery furnace. But if not, be it known unto thee, O king, can you see them standing here? It's similar to what we read of the the disciples in the book of Acts when they're standing before the Sanhedrin and they're saying, we understand that you told us that we can't preach in his name, we understand that you've told us that you're gonna beat us and imprison us, and so on and so forth, but we must obey God. And we find here that they say that we will not serve thy gods, nor worship the golden image which thou hast set up. I mean, they were confident. They were courageous. They had purposed. They had resolved. We are not going to bow. I believe that Nebuchadnezzar could have played the music until today, and they were not gonna bow. You understand? They just, they were resolved. They were determined to obey God. See, you understand this morning that what led to their confidence, and not only do we see that they had confidence in what God could do, but we understand they had confidence in what God had said. You know, the truth is God had given command, and we find even as you look at the Ten Commandments, thou shalt have no other gods before me. We find that it's in Leviticus 26, in verse number one, that here God says, ye shall make you no idols nor graven image, neither rear you up a standing image, neither shall you set up an image of stone in your land, to bow down unto it, for I am the Lord your God. I believe that the confidence that is displayed here really reveals to us a walk that they had with God, an understanding that they had of the Word of God, and the decision that they were making was not an emotional decision. It was not a situation of like, hey, we're just not gonna stand so we could be different. No, it was a decision that was based upon biblical principle, and when you make a decision based upon biblical principle, the biblical principle isn't gonna change. It doesn't matter who's in the White House, it doesn't matter who controls the government, it doesn't matter what border we're in, what land we live in, God's Word, based upon the principles contained therein, when we make decisions in that fashion, it's just not gonna change. We are not going to bow to your God. We're not gonna do it. I believe that not only does it reveal that they had a personal walk with God, I believe the depth of the walk that they had with God, I believe it also reveals to us that there was a level of preparation. You understand that in order to stand, we better be preparing to stand, because when those pressures come, when the consequences, when the bar, the stake is raised as high as it is here, if we've not prepared to stand, we're probably gonna bow. We're gonna justify it somehow in our minds. Everybody else is doing it. You probably said that as a teenager like I did. Why can't I do that, mom? Why can't I do that? That everybody else is doing it. I think I only said that a handful of times, honestly, because each time I said that, they said, okay, tell me who's doing it, and it was just like, mmm, everybody. But you understand. Notice what the wise man says, Solomon, Proverbs 24. Notice what he says in Proverbs 24 and verse number 10. What a great truth that God gives us here in this verse of Scripture. The Bible says in Proverbs 24 and verse number 10, if thou faint in the day of adversity, thy strength is small. Can I tell you this morning that the day of adversity is gonna come? It's gonna come. It's not talking about physical strength, however. See, we wrestle not against flesh and blood, as I referenced in Ephesians 6 this morning by way of introduction. We wrestle against spiritual wickedness in high places. And here he's not speaking about our strength being small, meaning that our physical strength is small. Remember, Paul said, in my weakness, then I'm strong. Why? Because his strength is made perfect in weakness. And we find that as we would look to the Word of God and we'd understand the importance of being strengthened in the inner man, that we walk in the Spirit, that we have the boldness that only comes as a result of being filled with the Holy Spirit of God. And we find that these men, I believe that as we look at this passage and consider this example, that these men, they had had this confidence, and it's confidence in what God could do, it's confidence in what God had said. I believe that it reveals to us that they had a close walk with God, and they had prepared. They had prepared for this day. I don't know that you say, so they knew it was going to happen? I'm not saying that they knew exactly what was going to happen, just like you don't know exactly what's going to happen. But there's this preparation as we walk with God. And when that day of adversity comes, we're walking with God, our inner man has been strengthened, and we're able to stand. Not in our own power, but in the power of God. And we're able to stand. We see the confidence that was displayed. I want you to consider with me, as we continue through this passage of Scripture, I want you to consider number three, the communion they enjoyed. The communion they enjoyed. It's really interesting as you look at verses 19 through 26, and we understand again, as we're familiar with the passage of Scripture, that these men find themselves in this fiery furnace. But I want you to consider for a moment the communion that they enjoyed. The reality is that the Bible says that the stakes were so high, Nebuchadnezzar is so furious. I mean, can you imagine the embarrassment of Nebuchadnezzar? I mean, you know his pride, we've already discussed it. And now all of these people are there, and they bring these three before him, and he says, here's what's gonna happen, you're gonna bow. And they just stand. They just stand. It says that Nebuchadnezzar was full of fury in verse number 19. The form of his visage was changed. See, I believe in verse number 13, when it says that he was in his rage and fury that he brought him before him, but he's offering them another opportunity, and we're gonna play it again, and you're gonna bow, and it's gonna be well. And when they don't, he's full of fury. His visage was changed against Shadrach, Meshach, and Abednego. Therefore he spake, he commanded that they should heat the furnace one seven times more than it was wont to be heated. He commanded the most mighty men that were in his army to bind Shadrach, Meshach, and Abednego, and to cast them into the burning fiery furnace. So he heats it up seven times hotter than what it was going to be set to, and he finds the mightiest within his army to bind these men. It was so hot that the men were slain that threw these three into the fire. Notice in verse 21, then these men were bound in their coats, their hosen, their hats, their other garments, and were cast in the midst of the burning fiery furnace. Therefore, because the king's commandment was urgent, and the furnace exceeding hot, the flame of the fire slew those men that took up Shadrach, Meshach, and Abednego. And these three men, Shadrach, Meshach, and Abednego, fell down bound into the midst of the burning fiery furnace. But then Nebuchadnezzar's a stone-eyed. He's astonished as to what happens. The Bible tells us in verse number 24 that he rose up in haste, and he speaks to his counselors that are there, and he asked this question, did not we cast three men bound into the midst of the fire? They answered and said unto the king, true, O king. I mean, he's in a position where he's looking at what he's seeing, and he's saying, hey listen, wasn't it three? And weren't they bound? Yes, true, O king. You've not lost your mind. Yes, that's what we did. He answered and said, lo, I see four men loose. He says they're loose, and they're walking in the midst of the fire, and they have no hurt. And the form of the fourth is like the Son of God. I want you to consider the communion that they have. They enjoyed communion with God in a way that I don't know we can fully comprehend, because it was their obedience to God that led to the fire. It was their obedience to God that led to the fire. And they go in bound seven times hotter. The men that cast them in are killed. The king says they're walking around. I mean, can you imagine King Nebuchadnezzar looking at this like, what is going on? How is this even possible? Remember what he said in verse number 15, who is that God that shall deliver you out of my hands? See, he thought he had all this power, and he thought that if he raised the stakes high enough, you're gonna bow. I've heard people say this, everybody has a price. I hope you don't have a price. I hope that there's not some stake that the enemy could raise it to and you say, okay, enough is enough. I'm just going to do what you want me to do. I'll bow if you want me to bow. I'm not going in that furnace. It says in v. 26, then Nebuchadnezzar came near to the mouth of the burning, fiery furnace and spake. Can you imagine? In my mind's eye, the people are still there. It was in that same hour. And he's talking to these guys. Now maybe there's some that are deep in the crowd and they've not heard what was just asked of the counselors. And they see the king walk over there and he's talking. Now, if you were an observer, you saw the three men die that cast them in. Who's he talking to? Surely they're dead, right? As an observer. And it says here that he spake and he said, Shadrach, Meshach, and Abednego. Notice what he says. Ye servants of the Most High God. Come forth and come hither. Then Shadrach, Meshach, and Abednego came forth in the midst of the fire. I can't even imagine being an observer and seeing those boys walk out. What is going on? Right? And they come walking out. I don't know how long they were in the burning, fiery furnace. I don't think you do either. It doesn't seem that it was extremely long that they were there in the burning, fiery furnace. But they spent more time in that burning, fiery furnace than you did. Or than I have. And it was because they were willing to stand. That they went in that burning, fiery furnace. And the reality is that as we look at this, and we think about the communion that they enjoyed, we find that the psalmist says that in Thy presence is fullness of joy. Jeremiah, of course, he's prophesying on the eve of captivity. And in fact, Jeremiah's prophesying when the Babylonians have besieged the city and he sees them all around. He understands what's going to happen. But God gives word after word to Jeremiah. And in here, in Jeremiah 42 and v. 11, the Bible says, be not afraid of the King of Babylon, of whom you are afraid. Be not afraid of Him, saith the Lord, for I am with you to save you and to deliver you from His hand. Jeremiah 42 and v. 11. Don't be afraid of Him. The One you're afraid of, don't be afraid of Him. Why? Because I'm with you. I'm with you. Man, they had some communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I am with you always. Hebrews 13 and v. 5, a precious promise of the Word of God. He will never leave thee nor forsake thee. When we understand the truth of v. 6, He is my Helper. Therefore, who or what am I going to fear? The psalmist said in Psalm 121, I will lift up mine eyes unto the hills. From whence cometh my help? My help cometh from the Lord which made heaven and earth. He is my Helper. He's your Helper. And here, these men, they find themselves in the fiery furnace, they find themselves enjoying some communion with God. Can I tell you this morning that if you're going to stand and if I'm going to stand, we may face some consequences. But can I tell you, God will be with you. God will be with you. And you'll have seasons of communion that are sweeter than you've ever enjoyed any time before. I think about Paul and Silas when they were in prison. They were cast into the prison fast, locked away. But man, they were singing, were they not? Singing to God, they were having communion with God. See, this morning, I believe that we better prepare to stand. And I believe that as I look at a passage like Daniel 3, that I'm encouraged. This is an encouraging passage of Scripture. It's exciting. To read the account, this isn't some fairy tale. This is God's Word. This happened. And not only does it encourage us, I believe it should challenge us. Because am I willing to stand? Are you willing to stand? I mean, when the stakes are like they were for these three, are we willing to stand? In closing, I want you to consider some consequences of their stand. I want you to consider with me a few things as we look at the remainder of the passage. I want you to, just for a moment, consider how this experience impacted their own lives. Can you imagine? Listen, when you see God work, when you see God do something miraculous, it has an impact in your life. Do you think that these men talked about this experience? I mean, I do. I don't have any Bible to prove it to you. But I see these guys talking about there was a time that we were in the burning fiery furnace. Let me tell you what happened. Can you imagine the generational impact maybe to their grandchildren as they would sit and talk about what God did? Man, it had an impact in their lives. But in verse 27, I want you to notice how this experience impacted the lives of the princes, the governors, the captains, and the king's counselors. Notice what it says in verse 27. Again, to get back to the context, Nebuchadnezzar has come close to the mouth of the burning fiery furnace. He says to these men, ye servants of the Most High God, come forth, and they came hither. They came forth out of the midst of the fire. It says in verse 27, and the princes, governors, and captains, and the king's counselors, being gathered together, notice these three words, saw these men. They saw it. They were eyewitnesses of these men walking out of the burning fiery furnace. And it says, upon whose bodies the fire had no power, nor was a hair of their head singed, neither were their coats changed, nor the smell of fire had passed on them. How many of you have ever been to a bonfire? How many of you, when you got home, smelled like bonfire? How many of you have ever grilled? And you try not to touch the flame, but those little hairs get singed up. Right? These men were in the midst of the burning fiery furnace. And all these fellows that were there, the princes, the governors, the captains, the king's counselors, they see these men walk out, and they're not bound anymore. The fire had no power on them. They have not a hair singed. And they don't even smell like fire. Now that would cause those guys to kind of like, what is going on? Right? I mean, seriously. You remember back in the book of Exodus, when Pharaoh said something similar to Moses about who is your God? God, through a series of events, the plagues as we refer to them as, revealed who He was. The power that He has. So much so that the counselors of Pharaoh said this is nothing more than the finger of God. Nebuchadnezzar says, ye servants of the Most High God, come out! And all of these idol-worshiping Babylonians see these men walk out with no hurt. I don't think any of them were lining up to go in it to see if their gods could deliver. Do you? Nuh-uh. What an impact, as we think about the consequences of their stand. Listen, when you stand, there are going to be some consequences. There's going to be some impact in your life, in my life. But in the lives of others around us, they see what God is able to do. They see that it's not just a theory. You know, this book is so much more than theory. To walk with God is not just a theory kind of thing. It's real life. God is really able. God delivers. God works. And we find that this experience not only impacted these men personally, it impacted those in leadership around the king, but it also impacted Nebuchadnezzar. Verse number 28, it says... this. He spake and said, blessed be the God of Shadrach, Meshach, and Abednego who hath sent his angel and delivered his servants. Now stop there, we're gonna read the rest of it in just a moment. But you notice that this man Nebuchadnezzar, he said, who is that God that shall deliver you out of my hand? And we find that now he says, ye servants of the Most High God, and he says, blessed be the God of these men, Shadrach, Meshach, and Abednego, who has delivered his servants, but notice what he recognizes, that those servants that were delivered, that they first trusted in him. We sing trust and obey, for there's no other way to be happy in Jesus, but to trust and obey. Why is it that we should trust God? Because he's faithful, because he always does what he says he will do. We find that God, as the children of Israel are given the assignment to go into the the land of promise, and Moses sends out the spies, and they come back with the evil report, and Joshua and Caleb are seeking to influence the congregation to go and believe God, and they were ready to stone those guys. God says, how long will it be are my people believe me? Trust me, that we have confidence in God. See, it says that this man, Nebuchadnezzar, he recognized that these servants were delivered, but it was a result that they trusted in him, and then notice this, and have changed the king's word, and yielded their bodies, that they might not serve nor worship any God except their own God. It impacted Nebuchadnezzar. He said, these guys trusted in God, they yielded their bodies. It's interesting if you were to go and maybe jot it down in your notes to read Romans 6 about who we yield ourselves to. We are to yield ourselves unto the Lord, and we find that these men, they yielded themselves. It's interesting if you look in Romans 6 and you read the references with regard to the word yield or yielded, it's the same Greek word that is used in Romans 12 when he says that you would present your bodies a living sacrifice. Same exact Greek word. So, yielding and presenting our bodies to God, and see what God is able to do. He said, I'm not interested in signing up for all that. I don't want to be a martyr. Neither do I. I mean, honestly, I don't want to face, I don't want to go to prison. I don't want to do any of that stuff, but we got to stand. We got to stand. We have to be resolved. The pressures are only going to continue to increase. Listen, we have the Word of God, and the Bible says that in the last days, perilous times are going to come. They're here. Evil men and seducers are going to get better. No, they're going to wax worse and worse, deceiving and being deceived. Is that not what the Word of God says, tells us? Clearly, God gives us the instruction. We find that really as we look at the consequences and we see the impact upon these groups of people, I want you to understand that God was glorified, and that's what it's all about. It's not really about us saying, oh, look at these guys. They were so bold to stand for God. I'm thankful that they were, but God was glorified. It says in verse 29, therefore, I make a decree. Now, he started the chapter by making a decree that everybody bow down to his image, and now he makes a decree at the end of the chapter that every people, nation, and language would speak anything amiss against the God of Shadrach, Meshach, and Abednego shall be cut in pieces, and their houses shall be made a dunghill. Why? Because there is no other God that can deliver after this sort. God was glorified. Then the king promoted Shadrach, Meshach, and Abednego in the province of Babylon. God was glorified. You know, it's interesting to me. We think about the consequences. You know, it's been some 2,600 years since this event took place, and we're still talking about it. 2,600 years. That's a long time, and we're still receiving encouragement from some individuals that were willing to stand. They're willing to stand. They just simply said, listen, I can't do this. I cannot be influenced by your ideologies. I will not bow. I will not conform because I have a higher authority. I have a higher authority, the highest authority, and one day I'm gonna stand before him. So are you. The question, however, as we think about this event, we think about the title of the message this morning, are you willing to stand? Am I willing to stand? Can I fill you in? It's easy to stand in here. It is. You take a stand in here, man, we cheer you on. Amen! But we got to be willing to stand out there. Out there. In a lost and dying world, they need to see that our God is real. It's not just a theory. You know, they don't think much of our God. They really don't. They curse him. They hold their fist against him. They need to see that our God is real. Do you believe this morning that God is still able to work? I don't know that there's gonna be a burning fiery furnace. Again, the circumstances, the pressures are different for every generation, but we're facing some pressures today, and there's a movement today to cause you and to cause me to bow, to conform, to we can't talk about this, we can't talk about that, we can't go there, we can't go here. And they want a silence. They want us to be ashamed. I've said that a couple of times the last few weeks because of our theme for our missions conference. I am not ashamed. And this morning, are we willing to stand? Are we willing to stand? I'm encouraged by Daniel 3, but really more than being encouraged, I'm challenged. Because I look at these three guys, they didn't have all that we have. We got the whole book, but they had a real close walk with God that caused them to have some some strength and some resolve spiritually to say, I understand the stakes. I heard the command. Yes, I heard the music, but I'm not gonna bow. It's not gonna do it. Are you willing to stand? Let's pray. Father, we love you. We thank you for loving us. Thank you for your Word. I thank you how that we can go to your Word and be encouraged, and at the same time be challenged. I thank you for the challenge that Paul gives the believers in Ephesus, and how that we can look at this event that happened 2,600 years ago, and see some men that stood. We understand and acknowledge readily this morning that we're facing pressures in our society, in our culture, to bow and to conform to the ideologies. God, I pray that you would help us to walk in the Spirit. I pray that you'd help us to put on the armor, that we would be able to stand in the evil day. Would you help us this morning to let you have your will and way in our lives? Help us to truly yield ourselves to thee. We pray that you'd be glorified through every decision, and we'll thank you for it. Would you stand with me? Heads are bowed, eyes are closed. It's our custom to have an invitation at the end of our service in order to give you an opportunity to respond to how God may have spoken to you through His Word. Kimberly will play quietly on the piano. As she does, the altar is open. You don't want to come to this old-fashioned altar. Maybe you want to make your seat an altar, but would you let God have His way in your life? As Kimberly plays, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.400000095367432,
      "text": " passage of scripture. I hope that as we examine this portion of scripture this"
    },
    {
      "id": 1,
      "start": 4.400000095367432,
      "end": 8.279999732971191,
      "text": " morning that we would be challenged. I trust that we'd be encouraged as we look"
    },
    {
      "id": 2,
      "start": 8.279999732971191,
      "end": 13.0,
      "text": " at this familiar passage, but also that God would challenge us. I'm mindful of"
    },
    {
      "id": 3,
      "start": 13.0,
      "end": 17.079999923706055,
      "text": " some New Testament truth. If you look in, you're there in Daniel, but I consider"
    },
    {
      "id": 4,
      "start": 17.079999923706055,
      "end": 22.079999923706055,
      "text": " the truth with regard to the Apostle Paul speaking to the church in Ephesus."
    },
    {
      "id": 5,
      "start": 22.079999923706055,
      "end": 26.280000686645508,
      "text": " What's funny, Steve? You're good? Okay, I thought something, Jim's taking his thing"
    },
    {
      "id": 6,
      "start": 26.280000686645508,
      "end": 30.600000381469727,
      "text": " like this, so I didn't know if something was going on behind me. And in Ephesians, of"
    },
    {
      "id": 7,
      "start": 30.600000381469727,
      "end": 34.880001068115234,
      "text": " course, the Apostle Paul is encouraging the believers in Ephesus with regard to"
    },
    {
      "id": 8,
      "start": 34.880001068115234,
      "end": 39.720001220703125,
      "text": " their walk with God. Of course, the foundation in the first few chapters is"
    },
    {
      "id": 9,
      "start": 39.720001220703125,
      "end": 43.68000030517578,
      "text": " established with regard to their relationship to God through the Lord"
    },
    {
      "id": 10,
      "start": 43.68000030517578,
      "end": 48.040000915527344,
      "text": " Jesus Christ, and then he addresses their walk, and he comes to the final chapter"
    },
    {
      "id": 11,
      "start": 48.040000915527344,
      "end": 51.720001220703125,
      "text": " in the book of Ephesians, and as he gets to the latter part of that chapter, he"
    },
    {
      "id": 12,
      "start": 51.720001220703125,
      "end": 56.08000183105469,
      "text": " begins to talk about the spiritual warfare in which were engaged. And in so"
    },
    {
      "id": 13,
      "start": 56.08000183105469,
      "end": 61.7599983215332,
      "text": " doing, he begins to challenge the believers in Ephesus to stand, and he"
    },
    {
      "id": 14,
      "start": 61.7599983215332,
      "end": 66.83999633789062,
      "text": " tells them that they are to be strong in the power of the Lord, and we find that"
    },
    {
      "id": 15,
      "start": 66.83999633789062,
      "end": 72.12000274658203,
      "text": " as we would examine and consider the admonition, if you will, that the Apostle"
    },
    {
      "id": 16,
      "start": 72.12000274658203,
      "end": 76.95999908447266,
      "text": " Paul gives to the church at Ephesus and to the believers there, and he tells them"
    },
    {
      "id": 17,
      "start": 76.95999908447266,
      "end": 79.4800033569336,
      "text": " not only be strong in the power of the Lord, but he tells them to put on the"
    },
    {
      "id": 18,
      "start": 79.4800033569336,
      "end": 85.55999755859375,
      "text": " whole armor of God, and he says this, that you may be able to stand against"
    },
    {
      "id": 19,
      "start": 85.55999755859375,
      "end": 91.16000366210938,
      "text": " the wiles of the devil. He then tells them we're not engaged in some sort of"
    },
    {
      "id": 20,
      "start": 91.16000366210938,
      "end": 96.95999908447266,
      "text": " wrestling match, some sort of fleshly carnal battle. No, it's a spiritual battle"
    },
    {
      "id": 21,
      "start": 96.95999908447266,
      "end": 101.55999755859375,
      "text": " in which we are engaged in. And we begin to think about the, really, the admonition"
    },
    {
      "id": 22,
      "start": 101.55999755859375,
      "end": 106.31999969482422,
      "text": " that Paul gives to these believers as he's instructing them, and I find this"
    },
    {
      "id": 23,
      "start": 106.31999969482422,
      "end": 114.5199966430664,
      "text": " morning that each generation will face unique pressures to bow or to conform to"
    },
    {
      "id": 24,
      "start": 114.5199966430664,
      "end": 119.44000244140625,
      "text": " the current ideologies. We find that we're living in a particular era in"
    },
    {
      "id": 25,
      "start": 119.44000244140625,
      "end": 126.16000366210938,
      "text": " which we, as this generation, we are facing certain pressures to bow, to"
    },
    {
      "id": 26,
      "start": 126.16000366210938,
      "end": 132.0800018310547,
      "text": " conform to the ideologies that exist, and we find that each generation is going to"
    },
    {
      "id": 27,
      "start": 132.0800018310547,
      "end": 137.0800018310547,
      "text": " face such circumstances. The believers that Paul is referencing and ministering"
    },
    {
      "id": 28,
      "start": 137.0800018310547,
      "end": 142.32000732421875,
      "text": " to in Ephesus, they had their own set of circumstances that they faced, and they"
    },
    {
      "id": 29,
      "start": 142.32000732421875,
      "end": 147.1199951171875,
      "text": " had to stand in the power of God, and they had to be willing to yield"
    },
    {
      "id": 30,
      "start": 147.1199951171875,
      "end": 151.9600067138672,
      "text": " themselves to God. They had to be willing to walk in the Spirit so that they"
    },
    {
      "id": 31,
      "start": 151.9600067138672,
      "end": 157.27999877929688,
      "text": " would not fulfill the lust of the flesh, and we find that for the passage of"
    },
    {
      "id": 32,
      "start": 157.27999877929688,
      "end": 160.63999938964844,
      "text": " Scripture that we're going to look at this morning in Daniel 3, we find that"
    },
    {
      "id": 33,
      "start": 160.63999938964844,
      "end": 165.39999389648438,
      "text": " these three Hebrew children that we often are familiar with, Shadrach,"
    },
    {
      "id": 34,
      "start": 165.39999389648438,
      "end": 171.36000061035156,
      "text": " Meshach, and Abednego, these fellas, they faced unique circumstances with regard"
    },
    {
      "id": 35,
      "start": 171.36000061035156,
      "end": 177.60000610351562,
      "text": " to the pressures of their day, and we find that they were willing to stand. If"
    },
    {
      "id": 36,
      "start": 177.60000610351562,
      "end": 181.16000366210938,
      "text": " you've already looked at the bulletin on the back, the title for the message this"
    },
    {
      "id": 37,
      "start": 181.16000366210938,
      "end": 185.8800048828125,
      "text": " morning is really a question, and the question is this, are you willing to"
    },
    {
      "id": 38,
      "start": 185.8800048828125,
      "end": 191.24000549316406,
      "text": " stand? Am I willing to stand? Again, each generation is going to have its"
    },
    {
      "id": 39,
      "start": 191.24000549316406,
      "end": 196.16000366210938,
      "text": " opportunity to face the pressures and the ideologies that exist within that"
    },
    {
      "id": 40,
      "start": 196.16000366210938,
      "end": 201.55999755859375,
      "text": " particular society and culture, and the question is whether or not the people of"
    },
    {
      "id": 41,
      "start": 201.55999755859375,
      "end": 208.0800018310547,
      "text": " God will stand. We find that as we look at a passage like Daniel 3, we rejoice"
    },
    {
      "id": 42,
      "start": 208.0800018310547,
      "end": 212.39999389648438,
      "text": " greatly in understanding what takes place, and we're familiar with the"
    },
    {
      "id": 43,
      "start": 212.39999389648438,
      "end": 215.75999450683594,
      "text": " passage of Scripture, and we say, man, this is wonderful, look at how God worked,"
    },
    {
      "id": 44,
      "start": 215.75999450683594,
      "end": 220.44000244140625,
      "text": " look at what God did, but it's because there were some people of God that"
    },
    {
      "id": 45,
      "start": 220.44000244140625,
      "end": 226.0800018310547,
      "text": " stood, that were willing to take a stand no matter what the pressures were,"
    },
    {
      "id": 46,
      "start": 226.0800018310547,
      "end": 229.75999450683594,
      "text": " no matter what the consequences were that they would face, they were willing"
    },
    {
      "id": 47,
      "start": 229.75999450683594,
      "end": 234.17999267578125,
      "text": " to take a stand, and the question is we look through history, not only biblical"
    },
    {
      "id": 48,
      "start": 234.17999267578125,
      "end": 238.83999633789062,
      "text": " history, but we look at modern history and look at the church history through"
    },
    {
      "id": 49,
      "start": 238.83999633789062,
      "end": 244.63999938964844,
      "text": " the ages, and you can find individuals and groups of people that stood for"
    },
    {
      "id": 50,
      "start": 244.63999938964844,
      "end": 252.52000427246094,
      "text": " truth, and I wonder this morning, I wonder in our generation who among us would be"
    },
    {
      "id": 51,
      "start": 252.52000427246094,
      "end": 259.29998779296875,
      "text": " written about that we were willing to stand, that we might encourage a future"
    },
    {
      "id": 52,
      "start": 259.29998779296875,
      "end": 264.5199890136719,
      "text": " generation in like fashion as we have been encouraged by those who have gone"
    },
    {
      "id": 53,
      "start": 264.67999267578125,
      "end": 269.32000732421875,
      "text": " before us that were willing to take a stand. As we notice in our passage of"
    },
    {
      "id": 54,
      "start": 269.32000732421875,
      "end": 274.32000732421875,
      "text": " Scripture here in Daniel 3, let me just read some verses, we'll get into"
    },
    {
      "id": 55,
      "start": 274.32000732421875,
      "end": 278.6000061035156,
      "text": " the message. I'm gonna try to look at all 30 verses, and notice in verse number"
    },
    {
      "id": 56,
      "start": 278.6000061035156,
      "end": 283.3599853515625,
      "text": " one the Bible says this, Nebuchadnezzar the king made an image of gold whose"
    },
    {
      "id": 57,
      "start": 283.3599853515625,
      "end": 288.3599853515625,
      "text": " height was three square cubits and the breadth thereof six cubits. He set it up"
    },
    {
      "id": 58,
      "start": 288.3599853515625,
      "end": 293.4800109863281,
      "text": " in the plain of Dura in the province of Babylon. We understand that Nebuchadnezzar"
    },
    {
      "id": 59,
      "start": 293.9200134277344,
      "end": 298.32000732421875,
      "text": " is the king of the Babylonian Empire, we understand that he has great power, we"
    },
    {
      "id": 60,
      "start": 298.32000732421875,
      "end": 302.1199951171875,
      "text": " find that as you look at the history with regard to this kingdom and you'd"
    },
    {
      "id": 61,
      "start": 302.1199951171875,
      "end": 307.1600036621094,
      "text": " understand the power in which this man had when he's going to put up this image"
    },
    {
      "id": 62,
      "start": 307.1600036621094,
      "end": 311.3599853515625,
      "text": " of gold, this 90-foot image, and he's going to give some requirements that"
    },
    {
      "id": 63,
      "start": 311.3599853515625,
      "end": 315.32000732421875,
      "text": " we'll look at in just a few moments, you understand that he had power to make"
    },
    {
      "id": 64,
      "start": 315.32000732421875,
      "end": 321.1199951171875,
      "text": " happen what he said would happen. And as we look at the passage of Scripture"
    },
    {
      "id": 65,
      "start": 321.1199951171875,
      "end": 325.0400085449219,
      "text": " and we consider the question, are you willing to stand? I want us to consider a"
    },
    {
      "id": 66,
      "start": 325.0400085449219,
      "end": 330.2799987792969,
      "text": " few things. Number one, consider with me the circumstances these men faced."
    },
    {
      "id": 67,
      "start": 330.2799987792969,
      "end": 334.4800109863281,
      "text": " Consider the circumstances they faced. Now admittedly, right from the beginning"
    },
    {
      "id": 68,
      "start": 334.4800109863281,
      "end": 338.20001220703125,
      "text": " this morning, we understand that the circumstances that are faced in Daniel"
    },
    {
      "id": 69,
      "start": 338.20001220703125,
      "end": 342.1600036621094,
      "text": " 3 are different than the circumstances that you will face, they're different"
    },
    {
      "id": 70,
      "start": 342.1600036621094,
      "end": 346.0,
      "text": " than the circumstances that I will face, they're different than the circumstances"
    },
    {
      "id": 71,
      "start": 346.0,
      "end": 350.4800109863281,
      "text": " that Paul faced and the believers in Ephesus faced, but each generation is"
    },
    {
      "id": 72,
      "start": 350.4800109863281,
      "end": 355.3999938964844,
      "text": " going to have a set of circumstances, some ideologies that are in opposition"
    },
    {
      "id": 73,
      "start": 355.3999938964844,
      "end": 362.67999267578125,
      "text": " to God's Word that we're gonna face. And here in Daniel 3, we find as we've read"
    },
    {
      "id": 74,
      "start": 362.67999267578125,
      "end": 367.20001220703125,
      "text": " in verse number one that this golden image is set up and in verse 2 it says"
    },
    {
      "id": 75,
      "start": 367.20001220703125,
      "end": 373.20001220703125,
      "text": " then Nebuchadnezzar the king sent to gather together, notice, the princes, the"
    },
    {
      "id": 76,
      "start": 373.20001220703125,
      "end": 377.3999938964844,
      "text": " governors, and the captains, the judges, the treasurers, the counselors, the"
    },
    {
      "id": 77,
      "start": 377.3999938964844,
      "end": 383.6000061035156,
      "text": " sheriffs, and all the rulers of the provinces to come. For what? They were"
    },
    {
      "id": 78,
      "start": 383.6000061035156,
      "end": 387.8800048828125,
      "text": " gonna have this dedication, it says, to come to the dedication of the image"
    },
    {
      "id": 79,
      "start": 387.8800048828125,
      "end": 395.6000061035156,
      "text": " which Nebuchadnezzar the king had set up. Then, in response to this edict, if you"
    },
    {
      "id": 80,
      "start": 395.6000061035156,
      "end": 399.6000061035156,
      "text": " will, that was made, it says the princes, the governors, and captains, the judges,"
    },
    {
      "id": 81,
      "start": 399.6000061035156,
      "end": 402.8399963378906,
      "text": " the treasurers, the counselors, the sheriffs, and all the rulers of the"
    },
    {
      "id": 82,
      "start": 402.8399963378906,
      "end": 406.4800109863281,
      "text": " provinces were gathered together under the dedication of the image that"
    },
    {
      "id": 83,
      "start": 406.4800109863281,
      "end": 410.9599914550781,
      "text": " Nebuchadnezzar the king had set up. And they stood before the image that"
    },
    {
      "id": 84,
      "start": 410.9599914550781,
      "end": 417.8800048828125,
      "text": " Nebuchadnezzar had set up. Then, and Harold cried aloud, to you, notice, it is"
    },
    {
      "id": 85,
      "start": 417.8800048828125,
      "end": 425.6000061035156,
      "text": " commanded, O people, nations, and languages, that at what time you hear the sound of"
    },
    {
      "id": 86,
      "start": 425.6000061035156,
      "end": 432.0799865722656,
      "text": " the cornet, flute, harp, samba, psaltery, dulcimer, and all kinds of music, you"
    },
    {
      "id": 87,
      "start": 432.0799865722656,
      "end": 437.79998779296875,
      "text": " fall down and worship the golden image that Nebuchadnezzar the king hath set up."
    },
    {
      "id": 88,
      "start": 437.79998779296875,
      "end": 442.2799987792969,
      "text": " Now, here's where it gets complicated for these three Hebrew children. We find that"
    },
    {
      "id": 89,
      "start": 442.2799987792969,
      "end": 445.9599914550781,
      "text": " Shadrach, Meshach, and Abednego, they've already been taken into Babylon. Of"
    },
    {
      "id": 90,
      "start": 445.9599914550781,
      "end": 450.8800048828125,
      "text": " course, Nebuchadnezzar and the Babylonians would conquer Judah, and we"
    },
    {
      "id": 91,
      "start": 450.8800048828125,
      "end": 455.20001220703125,
      "text": " find that these fellows, along with Daniel, they were in captivity. They're"
    },
    {
      "id": 92,
      "start": 455.20001220703125,
      "end": 459.0,
      "text": " there in Babylon. If you read the first couple of chapters, you see in which the"
    },
    {
      "id": 93,
      "start": 459.0,
      "end": 463.4800109863281,
      "text": " way in which they were sought to be indoctrinated. In chapter number one, you"
    },
    {
      "id": 94,
      "start": 463.4800109863281,
      "end": 468.0400085449219,
      "text": " read about the indoctrination program that the Babylonians had for those that"
    },
    {
      "id": 95,
      "start": 468.0400085449219,
      "end": 474.0,
      "text": " they would bring in, and you find that here, this Harold cries, listen, the"
    },
    {
      "id": 96,
      "start": 474.0,
      "end": 480.9200134277344,
      "text": " instruction, the command was clear. It was not ambiguous whatsoever, but the command"
    },
    {
      "id": 97,
      "start": 480.9200134277344,
      "end": 486.32000732421875,
      "text": " violated a greater command, and that was a command that God had given. And we find"
    },
    {
      "id": 98,
      "start": 486.32000732421875,
      "end": 491.6000061035156,
      "text": " that as here, these men would hear this instruction, as this Harold would cry"
    },
    {
      "id": 99,
      "start": 491.6000061035156,
      "end": 497.0,
      "text": " aloud and say, here's what is required of you. You're gonna hear the music play, and"
    },
    {
      "id": 100,
      "start": 497.0,
      "end": 507.0400085449219,
      "text": " when that happens, you fall down and worship. Worship an image? Yes, fall down"
    },
    {
      "id": 101,
      "start": 507.0400085449219,
      "end": 513.4000244140625,
      "text": " and worship. And we find that as the music would play, as they would prepare"
    },
    {
      "id": 102,
      "start": 513.4000244140625,
      "end": 519.1599731445312,
      "text": " for this, that not only was the command known, but the consequences were known. We"
    },
    {
      "id": 103,
      "start": 519.1599731445312,
      "end": 523.760009765625,
      "text": " find that in verse number six, the Bible says, and whoso falleth not down and"
    },
    {
      "id": 104,
      "start": 523.760009765625,
      "end": 532.4000244140625,
      "text": " worshipeth shall the same hour be cast in the midst of a burning, fiery furnace."
    },
    {
      "id": 105,
      "start": 532.4000244140625,
      "end": 537.8400268554688,
      "text": " The stakes were high. The situation, the circumstances that they faced were"
    },
    {
      "id": 106,
      "start": 537.8400268554688,
      "end": 543.0,
      "text": " serious. We find that the stakes are high. They understand the command that is"
    },
    {
      "id": 107,
      "start": 543.0399780273438,
      "end": 548.280029296875,
      "text": " given. Again, this command is not ambiguous. It's extremely clear. We've"
    },
    {
      "id": 108,
      "start": 548.280029296875,
      "end": 552.47998046875,
      "text": " created this image. We've set up this golden image, and we're gonna have some"
    },
    {
      "id": 109,
      "start": 552.47998046875,
      "end": 559.1599731445312,
      "text": " musicians play some music, and you're going to bow and worship. And if not, in"
    },
    {
      "id": 110,
      "start": 559.1599731445312,
      "end": 566.0399780273438,
      "text": " the same hour, the burning, fiery furnace. Can you imagine the predicament that"
    },
    {
      "id": 111,
      "start": 566.0399780273438,
      "end": 571.719970703125,
      "text": " these men are in? Can you imagine as they're in this situation, and we find"
    },
    {
      "id": 112,
      "start": 571.719970703125,
      "end": 575.4000244140625,
      "text": " that just as we look at the circumstances, we find that these"
    },
    {
      "id": 113,
      "start": 575.4000244140625,
      "end": 579.3200073242188,
      "text": " pressures that they faced, again, different than the pressures that we"
    },
    {
      "id": 114,
      "start": 579.3200073242188,
      "end": 582.8800048828125,
      "text": " would face. We understand that the pressures are varied, but we would"
    },
    {
      "id": 115,
      "start": 582.8800048828125,
      "end": 589.6799926757812,
      "text": " understand also that they're certain. We will face pressures. We are facing"
    },
    {
      "id": 116,
      "start": 589.6799926757812,
      "end": 594.8800048828125,
      "text": " pressures. And we find that as we look here at this passage of Scripture that"
    },
    {
      "id": 117,
      "start": 594.9600219726562,
      "end": 599.0,
      "text": " says in verse number 7,"
    },
    {
      "id": 118,
      "start": 599.0,
      "end": 602.0,
      "text": " \"...therefore at that time when all the people...\""
    },
    {
      "id": 0,
      "start": 602.0,
      "end": 608.1199998855591,
      "text": " heard the sound of the cornet, flute, harp, sakhba, psaltery, and all kinds of music,"
    },
    {
      "id": 1,
      "start": 608.1199998855591,
      "end": 615.6400003433228,
      "text": " notice the next three words, all the people, the nations and the languages"
    },
    {
      "id": 2,
      "start": 615.6400003433228,
      "end": 622.0400009155273,
      "text": " fell down and worshipped. What did they do? They worshipped the golden image that"
    },
    {
      "id": 3,
      "start": 622.0400009155273,
      "end": 627.4799995422363,
      "text": " Nebuchadnezzar the king had set up. Whether it was out of this, of course, we"
    },
    {
      "id": 4,
      "start": 627.4799995422363,
      "end": 631.5599994659424,
      "text": " understand as you'd look at the Babylonian Empire and look at their"
    },
    {
      "id": 5,
      "start": 631.5599994659424,
      "end": 637.0200004577637,
      "text": " culture and society, an idolatrous people, a people that served a"
    },
    {
      "id": 6,
      "start": 637.0200004577637,
      "end": 642.0800018310547,
      "text": " multiplicity of gods, and we find that there's some that would be bowing"
    },
    {
      "id": 7,
      "start": 642.0800018310547,
      "end": 646.2400016784668,
      "text": " down in worship because it was just custom in their culture. There are others"
    },
    {
      "id": 8,
      "start": 646.2400016784668,
      "end": 650.2000007629395,
      "text": " no doubt that did this out of fear. They understood the circumstances, they"
    },
    {
      "id": 9,
      "start": 650.2000007629395,
      "end": 653.8400001525879,
      "text": " understood the consequences, and they said, I'm not going to a burning fiery"
    },
    {
      "id": 10,
      "start": 653.8400001525879,
      "end": 658.9599990844727,
      "text": " furnace. I understand that Nebuchadnezzar has the power to fulfill that which he"
    },
    {
      "id": 11,
      "start": 658.9599990844727,
      "end": 667.879997253418,
      "text": " said would be the consequence. These people bow down and they worship, but in"
    },
    {
      "id": 12,
      "start": 667.879997253418,
      "end": 672.4400024414062,
      "text": " verses 8 through 12 we are introduced to people that we have become familiar with"
    },
    {
      "id": 13,
      "start": 672.4400024414062,
      "end": 678.2799987792969,
      "text": " as New Testament believers, to these three Hebrew children that were willing"
    },
    {
      "id": 14,
      "start": 678.2799987792969,
      "end": 681.3600006103516,
      "text": " to stand. The Bible says in verse number 8,"
    },
    {
      "id": 15,
      "start": 681.3600006103516,
      "end": 688.9599990844727,
      "text": " Wherefore at that time certain Chaldeans came near and accused the Jews. They"
    },
    {
      "id": 16,
      "start": 688.9599990844727,
      "end": 694.9599990844727,
      "text": " spake and said to the king Nebuchadnezzar, O king, live forever! Thou, O king, hast"
    },
    {
      "id": 17,
      "start": 694.9599990844727,
      "end": 700.4000015258789,
      "text": " made a decree that every man that shall hear the sound of the cornet, flute, harp,"
    },
    {
      "id": 18,
      "start": 700.4000015258789,
      "end": 705.0400009155273,
      "text": " sakhba, psaltery, and dulcimer, and all kinds of music, shall fall down and"
    },
    {
      "id": 19,
      "start": 705.0400009155273,
      "end": 709.5199966430664,
      "text": " worship the golden image. And whoso falleth not down and worshipeth that he"
    },
    {
      "id": 20,
      "start": 709.5199966430664,
      "end": 714.1999969482422,
      "text": " should be cast in the midst of a burning fiery furnace. They knew what"
    },
    {
      "id": 21,
      "start": 714.1999969482422,
      "end": 720.3600006103516,
      "text": " had been commanded. They repeated to the king the edict that he had put forth, and"
    },
    {
      "id": 22,
      "start": 720.3600006103516,
      "end": 726.0800018310547,
      "text": " they say, There are certain Jews, in verse number 12, whom thou hast set over the"
    },
    {
      "id": 23,
      "start": 726.0800018310547,
      "end": 731.0,
      "text": " affairs of the province of Babylon. Shadrach, Meshach, and Abednego. These men,"
    },
    {
      "id": 24,
      "start": 731.0,
      "end": 739.1199951171875,
      "text": " O king, have not regarded thee. They serve not thy gods, nor worship the golden"
    },
    {
      "id": 25,
      "start": 739.1999969482422,
      "end": 746.0800018310547,
      "text": " image which thou hast set up. And we ought to say, Amen! They took a stand. And we"
    },
    {
      "id": 26,
      "start": 746.0800018310547,
      "end": 752.1199951171875,
      "text": " find that the stand is taken in verse number 12. These certain, these Jews are"
    },
    {
      "id": 27,
      "start": 752.1199951171875,
      "end": 756.1999969482422,
      "text": " accused by these that are mentioned in verse number 8, these Chaldeans that come"
    },
    {
      "id": 28,
      "start": 756.1999969482422,
      "end": 760.0399932861328,
      "text": " to Nebuchadnezzar. Hey listen, there's some guys over here that they didn't bow"
    },
    {
      "id": 29,
      "start": 760.0399932861328,
      "end": 767.0800018310547,
      "text": " down. They didn't follow what you told them to do. So Nebuchadnezzar, he's not"
    },
    {
      "id": 30,
      "start": 767.1199951171875,
      "end": 771.3200073242188,
      "text": " real pleased with hearing this news. And the Bible tells us in verse number 13"
    },
    {
      "id": 31,
      "start": 771.3200073242188,
      "end": 776.8000030517578,
      "text": " that in his rage and fury, he commanded to bring these fellas into his presence."
    },
    {
      "id": 32,
      "start": 776.8000030517578,
      "end": 781.9600067138672,
      "text": " Can you imagine? I mean listen, I understand this morning that most all of"
    },
    {
      "id": 33,
      "start": 781.9600067138672,
      "end": 786.8800048828125,
      "text": " us, you could probably tell us the account. But I just wonder this morning"
    },
    {
      "id": 34,
      "start": 786.8800048828125,
      "end": 790.8000030517578,
      "text": " if you can put yourself in the shoes of these fellas. I'm talking about not"
    },
    {
      "id": 35,
      "start": 790.8000030517578,
      "end": 794.7200012207031,
      "text": " understanding that they're gonna come out of the fiery furnace. I'm talking"
    },
    {
      "id": 36,
      "start": 794.7200012207031,
      "end": 799.5200042724609,
      "text": " about understanding that you didn't bow. You took a stand. You stood for what was"
    },
    {
      "id": 37,
      "start": 799.5200042724609,
      "end": 805.3399963378906,
      "text": " right. And then the king says, bring them here. And you're being marched into the"
    },
    {
      "id": 38,
      "start": 805.3399963378906,
      "end": 810.5599975585938,
      "text": " presence of this particular time of the most powerful human being on the face of"
    },
    {
      "id": 39,
      "start": 810.5599975585938,
      "end": 821.2799987792969,
      "text": " the earth. And he's furious. And he has all this power. And he says, as he"
    },
    {
      "id": 40,
      "start": 821.2799987792969,
      "end": 825.2400054931641,
      "text": " approaches these men coming to his presence, he says this in verse"
    },
    {
      "id": 41,
      "start": 825.2400054931641,
      "end": 832.8000030517578,
      "text": " number 14. Is it true, O Shadrach, Meshach, and Abednego, do not ye serve my gods,"
    },
    {
      "id": 42,
      "start": 832.8000030517578,
      "end": 840.3600006103516,
      "text": " nor worship the golden image which I have set up? Now, if ye be ready, that at"
    },
    {
      "id": 43,
      "start": 840.3600006103516,
      "end": 843.5200042724609,
      "text": " what time ye hear the sound of the cornet, flute, harp, sackbutt, psalter, and"
    },
    {
      "id": 44,
      "start": 843.5200042724609,
      "end": 847.7599945068359,
      "text": " dulcimer, and all kinds of music, ye fall down and worship the image which I have"
    },
    {
      "id": 45,
      "start": 847.8000030517578,
      "end": 855.2799987792969,
      "text": " made well. But if you worship not, ye should be cast the same hour into the"
    },
    {
      "id": 46,
      "start": 855.2799987792969,
      "end": 860.5199890136719,
      "text": " midst of a burning fiery furnace. Notice the question that ends verse number 15."
    },
    {
      "id": 47,
      "start": 860.5199890136719,
      "end": 869.2000122070312,
      "text": " And who is that God that shall deliver you out of my hands? Do you see the pride"
    },
    {
      "id": 48,
      "start": 869.2000122070312,
      "end": 874.1199951171875,
      "text": " of Nebuchadnezzar? I mean, you look and you understand what Nebuchadnezzar is"
    },
    {
      "id": 49,
      "start": 874.1199951171875,
      "end": 878.4800109863281,
      "text": " saying. And he's saying, almost if I could paraphrase it, I'm gonna give you"
    },
    {
      "id": 50,
      "start": 878.4800109863281,
      "end": 883.2799987792969,
      "text": " guys another chance. Maybe you didn't fully understand what I had commanded."
    },
    {
      "id": 51,
      "start": 883.2799987792969,
      "end": 887.0,
      "text": " Maybe you didn't understand the consequences, and you violated it the"
    },
    {
      "id": 52,
      "start": 887.0,
      "end": 890.1199951171875,
      "text": " first time. So now I'm gonna give you another opportunity. And we're gonna play"
    },
    {
      "id": 53,
      "start": 890.1199951171875,
      "end": 896.0400085449219,
      "text": " the music again. And if you bow well. You know, a lot of people are looking for"
    },
    {
      "id": 54,
      "start": 896.0400085449219,
      "end": 901.8800048828125,
      "text": " well. A lot of people are looking for comfort and ease, and just kind of go"
    },
    {
      "id": 55,
      "start": 901.9200134277344,
      "end": 908.5599975585938,
      "text": " with the flow. You know what I mean? How is it that we can just kind of make our"
    },
    {
      "id": 56,
      "start": 908.5599975585938,
      "end": 915.6400146484375,
      "text": " way through this crazy society? I'm gonna tell you, we're gonna have to stand. We're"
    },
    {
      "id": 57,
      "start": 915.6400146484375,
      "end": 925.3200073242188,
      "text": " gonna have to stand. This world has lost its mind. There's no more moral code of"
    },
    {
      "id": 58,
      "start": 925.3200073242188,
      "end": 931.239990234375,
      "text": " standard that is based on anything that is close to the Word of God which we"
    },
    {
      "id": 59,
      "start": 931.2799987792969,
      "end": 937.8800048828125,
      "text": " believe and preach. We find that we're living in a really, as some have tried to"
    },
    {
      "id": 60,
      "start": 937.8800048828125,
      "end": 943.3599853515625,
      "text": " coin it, a post-truth type of an era in which truth is just relative. It's your"
    },
    {
      "id": 61,
      "start": 943.3599853515625,
      "end": 947.5599975585938,
      "text": " truth, and it's my truth, and it's their truth. I'm sorry to tell you, but the Word"
    },
    {
      "id": 62,
      "start": 947.5599975585938,
      "end": 955.6799926757812,
      "text": " of God is truth. The Bible says, Thy Word is truth. Jesus Christ said, I am the way,"
    },
    {
      "id": 63,
      "start": 955.760009765625,
      "end": 961.8399963378906,
      "text": " the truth, and the life. And we find that we have truth. Listen, I'm not trying"
    },
    {
      "id": 64,
      "start": 961.8399963378906,
      "end": 966.5199890136719,
      "text": " to be ugly with anyone. I'm not trying to cause myself to have enemies. I like"
    },
    {
      "id": 65,
      "start": 966.5199890136719,
      "end": 973.7999877929688,
      "text": " people to like me. Do you like having enemies? Come on. I want people to like me."
    },
    {
      "id": 66,
      "start": 973.7999877929688,
      "end": 980.1600036621094,
      "text": " But I'm much more concerned with God being pleased with my life. Because we're"
    },
    {
      "id": 67,
      "start": 980.1600036621094,
      "end": 988.3599853515625,
      "text": " gonna stand before him one day, and these guys, they hear the King. So we're"
    },
    {
      "id": 68,
      "start": 988.3599853515625,
      "end": 993.5599975585938,
      "text": " gonna give you another chance. Can you imagine in that moment? Can you"
    },
    {
      "id": 69,
      "start": 993.5599975585938,
      "end": 1001.8399963378906,
      "text": " imagine the pressures in that moment? Three of you, the most powerful man on"
    },
    {
      "id": 70,
      "start": 1001.8399963378906,
      "end": 1007.3599853515625,
      "text": " the earth at that particular time, humanly speaking, and he says, here's what"
    },
    {
      "id": 71,
      "start": 1007.3599853515625,
      "end": 1012.8800048828125,
      "text": " we're gonna do. We're gonna play the music. In your sanctified imagination, can"
    },
    {
      "id": 72,
      "start": 1012.8800048828125,
      "end": 1023.6799926757812,
      "text": " you hear the music playing and see those men stand? They just stand. Wow,"
    },
    {
      "id": 73,
      "start": 1023.6799926757812,
      "end": 1030.1199951171875,
      "text": " what circumstances they faced. I want you to consider the confidence they"
    },
    {
      "id": 74,
      "start": 1030.1199951171875,
      "end": 1035.1400146484375,
      "text": " displayed. We consider the circumstances really in verses 1 through 15, and the"
    },
    {
      "id": 75,
      "start": 1035.1400146484375,
      "end": 1039.2999877929688,
      "text": " next few verses, verses 16 through 18. I want you to consider this confidence in"
    },
    {
      "id": 76,
      "start": 1039.2999877929688,
      "end": 1045.6600036621094,
      "text": " which they displayed. I believe that they had confidence in what God was able to"
    },
    {
      "id": 77,
      "start": 1045.6600036621094,
      "end": 1051.0199890136719,
      "text": " do. The Bible says in verse number 16, Shadrach, Meshach, and Abednego answered"
    },
    {
      "id": 78,
      "start": 1051.0199890136719,
      "end": 1055.2200012207031,
      "text": " and said to the king, O Nebuchadnezzar, we are not careful to answer thee in this"
    },
    {
      "id": 79,
      "start": 1055.2200012207031,
      "end": 1060.3399963378906,
      "text": " matter. If it be so, you understand what they're saying? If what you just told us"
    },
    {
      "id": 80,
      "start": 1060.3399963378906,
      "end": 1063.7799987792969,
      "text": " is gonna be what's gonna happen, if that's gonna happen, we want you to know"
    },
    {
      "id": 81,
      "start": 1063.7799987792969,
      "end": 1070.8599853515625,
      "text": " something. Our God, whom we serve, is able to deliver us from the burning fiery"
    },
    {
      "id": 82,
      "start": 1070.8599853515625,
      "end": 1080.9800109863281,
      "text": " furnace. And, by the way, he will deliver us out of thine hand, O king. I wonder"
    },
    {
      "id": 83,
      "start": 1080.9800109863281,
      "end": 1085.6199951171875,
      "text": " this morning, how much confidence do we have in what God is able to do? Honestly,"
    },
    {
      "id": 84,
      "start": 1085.6199951171875,
      "end": 1093.4599914550781,
      "text": " how much confidence do we have in what God is able to do? We understand that"
    },
    {
      "id": 85,
      "start": 1093.5799865722656,
      "end": 1098.5,
      "text": " Paul says to that same group of people in Ephesus, now unto him which is able to"
    },
    {
      "id": 86,
      "start": 1098.5,
      "end": 1105.6600036621094,
      "text": " do exceeding abundantly above all that we ask or think. We know that the"
    },
    {
      "id": 87,
      "start": 1105.6600036621094,
      "end": 1111.6199951171875,
      "text": " Scriptures are, throughout the entirety of God's Word, revealed to us. They're"
    },
    {
      "id": 88,
      "start": 1111.6199951171875,
      "end": 1117.0999755859375,
      "text": " full of example of what God is able to do. We find that the questions are asked"
    },
    {
      "id": 89,
      "start": 1117.0999755859375,
      "end": 1122.0999755859375,
      "text": " when God stands before Abraham, and he says to Abraham, I am the Lord God"
    },
    {
      "id": 90,
      "start": 1122.0999755859375,
      "end": 1126.97998046875,
      "text": " Almighty, El Shaddai. He says, Abraham, and just a little while after he reveals"
    },
    {
      "id": 91,
      "start": 1126.97998046875,
      "end": 1133.219970703125,
      "text": " himself in that manner, he says, is anything too hard for me? Oh, do we have"
    },
    {
      "id": 92,
      "start": 1133.219970703125,
      "end": 1138.8599853515625,
      "text": " confidence in what God is able to do? Are we in a place where we're willing to"
    },
    {
      "id": 93,
      "start": 1138.8599853515625,
      "end": 1144.6599731445312,
      "text": " exercise that faith that is revealed here in these verses of Scripture? Oh, the"
    },
    {
      "id": 94,
      "start": 1144.6599731445312,
      "end": 1150.1799926757812,
      "text": " great confidence. Listen, if you've seen God work, if you've read this book and"
    },
    {
      "id": 95,
      "start": 1150.1799926757812,
      "end": 1154.0599975585938,
      "text": " you've allowed this book to influence and impact your life, and you let the"
    },
    {
      "id": 96,
      "start": 1154.0599975585938,
      "end": 1158.2999877929688,
      "text": " Word of God build your faith as it says it will, we find that we can have great"
    },
    {
      "id": 97,
      "start": 1158.2999877929688,
      "end": 1162.6599731445312,
      "text": " confidence in what God is able to do. So I don't know how God's gonna do it."
    },
    {
      "id": 98,
      "start": 1162.6599731445312,
      "end": 1166.2999877929688,
      "text": " I don't think they knew how God was gonna do it either. They just believed"
    },
    {
      "id": 99,
      "start": 1166.2999877929688,
      "end": 1172.0599975585938,
      "text": " that God was able. Notice what they say in verse number 18. But if not, I believe"
    },
    {
      "id": 100,
      "start": 1172.0599975585938,
      "end": 1174.8200073242188,
      "text": " what they're saying here is if he doesn't deliver us out of the burning"
    },
    {
      "id": 101,
      "start": 1174.8200073242188,
      "end": 1178.8200073242188,
      "text": " fiery furnace, they knew that he would deliver him out of the hand of the king."
    },
    {
      "id": 102,
      "start": 1178.8200073242188,
      "end": 1182.6599731445312,
      "text": " They knew that God was able to deliver him from the burning fiery furnace. But"
    },
    {
      "id": 103,
      "start": 1182.6599731445312,
      "end": 1188.7000122070312,
      "text": " if not, be it known unto thee, O king, can you see them standing here? It's similar"
    },
    {
      "id": 104,
      "start": 1188.7000122070312,
      "end": 1191.9400024414062,
      "text": " to what we read of the the disciples in the book of Acts when they're standing"
    },
    {
      "id": 105,
      "start": 1191.9400024414062,
      "end": 1195.1400146484375,
      "text": " before the Sanhedrin and they're saying, we understand that you told us that we"
    },
    {
      "id": 106,
      "start": 1195.1400146484375,
      "end": 1197.739990234375,
      "text": " can't preach in his name, we understand that you've told us that you're gonna"
    },
    {
      "id": 107,
      "start": 1197.739990234375,
      "end": 1203.780029296875,
      "text": " beat us and imprison us, and so on and so forth, but we must"
    },
    {
      "id": 0,
      "start": 1203.780029296875,
      "end": 1213.3800296783447,
      "text": " obey God. And we find here that they say that we will not serve thy gods, nor"
    },
    {
      "id": 1,
      "start": 1213.3800296783447,
      "end": 1220.5400295257568,
      "text": " worship the golden image which thou hast set up. I mean, they were"
    },
    {
      "id": 2,
      "start": 1220.5400295257568,
      "end": 1229.3400287628174,
      "text": " confident. They were courageous. They had purposed. They had resolved. We are not"
    },
    {
      "id": 3,
      "start": 1229.3400287628174,
      "end": 1233.4200286865234,
      "text": " going to bow. I believe that Nebuchadnezzar could have played the"
    },
    {
      "id": 4,
      "start": 1233.4200286865234,
      "end": 1238.5800285339355,
      "text": " music until today, and they were not gonna bow. You understand? They just,"
    },
    {
      "id": 5,
      "start": 1238.5800285339355,
      "end": 1243.180030822754,
      "text": " they were resolved. They were determined to obey God. See, you"
    },
    {
      "id": 6,
      "start": 1243.180030822754,
      "end": 1247.9000282287598,
      "text": " understand this morning that what led to their confidence, and not only do we"
    },
    {
      "id": 7,
      "start": 1247.9000282287598,
      "end": 1251.2600288391113,
      "text": " see that they had confidence in what God could do, but we understand they had"
    },
    {
      "id": 8,
      "start": 1251.2600288391113,
      "end": 1257.9800300598145,
      "text": " confidence in what God had said. You know, the truth is God had given command, and"
    },
    {
      "id": 9,
      "start": 1258.0200309753418,
      "end": 1261.780029296875,
      "text": " we find even as you look at the Ten Commandments, thou shalt have no other"
    },
    {
      "id": 10,
      "start": 1261.780029296875,
      "end": 1267.0600280761719,
      "text": " gods before me. We find that it's in Leviticus 26, in verse number one, that"
    },
    {
      "id": 11,
      "start": 1267.0600280761719,
      "end": 1272.7400283813477,
      "text": " here God says, ye shall make you no idols nor graven image, neither rear you up a"
    },
    {
      "id": 12,
      "start": 1272.7400283813477,
      "end": 1277.0200271606445,
      "text": " standing image, neither shall you set up an image of stone in your land, to bow"
    },
    {
      "id": 13,
      "start": 1277.0200271606445,
      "end": 1284.4600296020508,
      "text": " down unto it, for I am the Lord your God. I believe that the confidence that is"
    },
    {
      "id": 14,
      "start": 1284.4600296020508,
      "end": 1290.780029296875,
      "text": " displayed here really reveals to us a walk that they had with God, an"
    },
    {
      "id": 15,
      "start": 1290.780029296875,
      "end": 1295.660026550293,
      "text": " understanding that they had of the Word of God, and the decision that they were"
    },
    {
      "id": 16,
      "start": 1295.660026550293,
      "end": 1300.0600280761719,
      "text": " making was not an emotional decision. It was not a situation of like, hey, we're"
    },
    {
      "id": 17,
      "start": 1300.0600280761719,
      "end": 1304.3400268554688,
      "text": " just not gonna stand so we could be different. No, it was a decision that was"
    },
    {
      "id": 18,
      "start": 1304.3400268554688,
      "end": 1309.7000274658203,
      "text": " based upon biblical principle, and when you make a decision based upon biblical"
    },
    {
      "id": 19,
      "start": 1309.7000274658203,
      "end": 1316.2200317382812,
      "text": " principle, the biblical principle isn't gonna change. It doesn't matter who's in"
    },
    {
      "id": 20,
      "start": 1316.2200317382812,
      "end": 1319.2600326538086,
      "text": " the White House, it doesn't matter who controls the government, it doesn't"
    },
    {
      "id": 21,
      "start": 1319.2600326538086,
      "end": 1325.0200271606445,
      "text": " matter what border we're in, what land we live in, God's Word, based upon the"
    },
    {
      "id": 22,
      "start": 1325.0200271606445,
      "end": 1330.2200317382812,
      "text": " principles contained therein, when we make decisions in that fashion, it's just"
    },
    {
      "id": 23,
      "start": 1330.2200317382812,
      "end": 1338.6200256347656,
      "text": " not gonna change. We are not going to bow to your God. We're not gonna do it. I"
    },
    {
      "id": 24,
      "start": 1338.6600341796875,
      "end": 1344.7000274658203,
      "text": " believe that not only does it reveal that they had a personal walk with God, I"
    },
    {
      "id": 25,
      "start": 1344.7000274658203,
      "end": 1350.1000366210938,
      "text": " believe the depth of the walk that they had with God, I believe it also reveals"
    },
    {
      "id": 26,
      "start": 1350.1000366210938,
      "end": 1355.3800354003906,
      "text": " to us that there was a level of preparation. You understand that in order"
    },
    {
      "id": 27,
      "start": 1355.3800354003906,
      "end": 1360.1800231933594,
      "text": " to stand, we better be preparing to stand, because when those"
    },
    {
      "id": 28,
      "start": 1360.1800231933594,
      "end": 1366.540023803711,
      "text": " pressures come, when the consequences, when the bar, the stake is raised as high"
    },
    {
      "id": 29,
      "start": 1366.540023803711,
      "end": 1373.3400268554688,
      "text": " as it is here, if we've not prepared to stand, we're probably gonna bow. We're"
    },
    {
      "id": 30,
      "start": 1373.3400268554688,
      "end": 1380.0600280761719,
      "text": " gonna justify it somehow in our minds. Everybody else is doing it. You probably"
    },
    {
      "id": 31,
      "start": 1380.0600280761719,
      "end": 1384.300033569336,
      "text": " said that as a teenager like I did. Why can't I do that, mom? Why can't I do that?"
    },
    {
      "id": 32,
      "start": 1384.300033569336,
      "end": 1388.5000305175781,
      "text": " That everybody else is doing it. I think I only said that a handful of times,"
    },
    {
      "id": 33,
      "start": 1388.5000305175781,
      "end": 1393.1800231933594,
      "text": " honestly, because each time I said that, they said, okay, tell me who's doing it,"
    },
    {
      "id": 34,
      "start": 1393.1800231933594,
      "end": 1401.4200286865234,
      "text": " and it was just like, mmm, everybody. But you understand. Notice what the wise man"
    },
    {
      "id": 35,
      "start": 1401.4200286865234,
      "end": 1409.260025024414,
      "text": " says, Solomon, Proverbs 24. Notice what he says in Proverbs 24 and verse number 10."
    },
    {
      "id": 36,
      "start": 1410.020034790039,
      "end": 1417.9000244140625,
      "text": " What a great truth that God gives us here in this verse of Scripture. The"
    },
    {
      "id": 37,
      "start": 1417.9000244140625,
      "end": 1423.3800354003906,
      "text": " Bible says in Proverbs 24 and verse number 10, if thou faint in the day of"
    },
    {
      "id": 38,
      "start": 1423.3800354003906,
      "end": 1431.020034790039,
      "text": " adversity, thy strength is small. Can I tell you this morning that the day of"
    },
    {
      "id": 39,
      "start": 1431.020034790039,
      "end": 1438.2200317382812,
      "text": " adversity is gonna come? It's gonna come. It's not talking about physical strength,"
    },
    {
      "id": 40,
      "start": 1438.2200317382812,
      "end": 1442.6600341796875,
      "text": " however. See, we wrestle not against flesh and blood, as I referenced in Ephesians"
    },
    {
      "id": 41,
      "start": 1442.6600341796875,
      "end": 1446.3800354003906,
      "text": " 6 this morning by way of introduction. We wrestle against spiritual wickedness in"
    },
    {
      "id": 42,
      "start": 1446.3800354003906,
      "end": 1451.540023803711,
      "text": " high places. And here he's not speaking about our strength being small, meaning"
    },
    {
      "id": 43,
      "start": 1451.540023803711,
      "end": 1455.9000244140625,
      "text": " that our physical strength is small. Remember, Paul said, in my weakness, then"
    },
    {
      "id": 44,
      "start": 1455.9000244140625,
      "end": 1461.4600219726562,
      "text": " I'm strong. Why? Because his strength is made perfect in weakness. And we find that"
    },
    {
      "id": 45,
      "start": 1461.4600219726562,
      "end": 1465.3400268554688,
      "text": " as we would look to the Word of God and we'd understand the importance of being"
    },
    {
      "id": 46,
      "start": 1465.3400268554688,
      "end": 1470.8600158691406,
      "text": " strengthened in the inner man, that we walk in the Spirit, that we have the"
    },
    {
      "id": 47,
      "start": 1470.9000244140625,
      "end": 1475.9800415039062,
      "text": " boldness that only comes as a result of being filled with the Holy Spirit of"
    },
    {
      "id": 48,
      "start": 1475.9800415039062,
      "end": 1481.8600158691406,
      "text": " God. And we find that these men, I believe that as we look at this passage and"
    },
    {
      "id": 49,
      "start": 1481.8600158691406,
      "end": 1487.1400146484375,
      "text": " consider this example, that these men, they had had this confidence, and it's"
    },
    {
      "id": 50,
      "start": 1487.1400146484375,
      "end": 1491.0600280761719,
      "text": " confidence in what God could do, it's confidence in what God had said. I"
    },
    {
      "id": 51,
      "start": 1491.0600280761719,
      "end": 1496.8600158691406,
      "text": " believe that it reveals to us that they had a close walk with God, and they had"
    },
    {
      "id": 52,
      "start": 1496.8600158691406,
      "end": 1502.3800354003906,
      "text": " prepared. They had prepared for this day. I don't know that you say, so they knew"
    },
    {
      "id": 53,
      "start": 1502.3800354003906,
      "end": 1504.8200378417969,
      "text": " it was going to happen? I'm not saying that they knew exactly what was going to"
    },
    {
      "id": 54,
      "start": 1504.8200378417969,
      "end": 1508.2600402832031,
      "text": " happen, just like you don't know exactly what's going to happen. But there's this"
    },
    {
      "id": 55,
      "start": 1508.2600402832031,
      "end": 1514.5400390625,
      "text": " preparation as we walk with God. And when that day of adversity comes, we're"
    },
    {
      "id": 56,
      "start": 1514.5400390625,
      "end": 1521.5800170898438,
      "text": " walking with God, our inner man has been strengthened, and we're able to stand. Not"
    },
    {
      "id": 57,
      "start": 1521.5800170898438,
      "end": 1526.9800415039062,
      "text": " in our own power, but in the power of God. And we're able to stand. We see the"
    },
    {
      "id": 58,
      "start": 1526.9800415039062,
      "end": 1532.2200317382812,
      "text": " confidence that was displayed. I want you to consider with me, as we continue"
    },
    {
      "id": 59,
      "start": 1532.2200317382812,
      "end": 1535.1400146484375,
      "text": " through this passage of Scripture, I want you to consider number three, the"
    },
    {
      "id": 60,
      "start": 1535.1400146484375,
      "end": 1541.6200256347656,
      "text": " communion they enjoyed. The communion they enjoyed. It's really interesting as"
    },
    {
      "id": 61,
      "start": 1541.6200256347656,
      "end": 1545.6600341796875,
      "text": " you look at verses 19 through 26, and we understand again, as we're familiar with"
    },
    {
      "id": 62,
      "start": 1545.6600341796875,
      "end": 1549.5800170898438,
      "text": " the passage of Scripture, that these men find themselves in this fiery"
    },
    {
      "id": 63,
      "start": 1549.7400207519531,
      "end": 1555.3800354003906,
      "text": " furnace. But I want you to consider for a moment the communion that they enjoyed."
    },
    {
      "id": 64,
      "start": 1555.3800354003906,
      "end": 1562.6600341796875,
      "text": " The reality is that the Bible says that the stakes were so high, Nebuchadnezzar"
    },
    {
      "id": 65,
      "start": 1562.6600341796875,
      "end": 1567.3400268554688,
      "text": " is so furious. I mean, can you imagine the embarrassment of Nebuchadnezzar? I mean,"
    },
    {
      "id": 66,
      "start": 1567.3400268554688,
      "end": 1570.8200378417969,
      "text": " you know his pride, we've already discussed it. And now all of these people"
    },
    {
      "id": 67,
      "start": 1570.8200378417969,
      "end": 1574.5800170898438,
      "text": " are there, and they bring these three before him, and he says, here's what's"
    },
    {
      "id": 68,
      "start": 1574.5800170898438,
      "end": 1582.3000183105469,
      "text": " gonna happen, you're gonna bow. And they just stand. They just stand. It says that"
    },
    {
      "id": 69,
      "start": 1582.3000183105469,
      "end": 1587.780029296875,
      "text": " Nebuchadnezzar was full of fury in verse number 19. The form of his visage was"
    },
    {
      "id": 70,
      "start": 1587.780029296875,
      "end": 1593.2600402832031,
      "text": " changed. See, I believe in verse number 13, when it says that he was in his rage"
    },
    {
      "id": 71,
      "start": 1593.2600402832031,
      "end": 1596.7000427246094,
      "text": " and fury that he brought him before him, but he's offering them another"
    },
    {
      "id": 72,
      "start": 1596.7000427246094,
      "end": 1599.780029296875,
      "text": " opportunity, and we're gonna play it again, and you're gonna bow, and it's"
    },
    {
      "id": 73,
      "start": 1599.780029296875,
      "end": 1604.3800354003906,
      "text": " gonna be well. And when they don't, he's full of fury. His visage was"
    },
    {
      "id": 74,
      "start": 1604.3800354003906,
      "end": 1608.4200439453125,
      "text": " changed against Shadrach, Meshach, and Abednego. Therefore he spake, he"
    },
    {
      "id": 75,
      "start": 1608.4200439453125,
      "end": 1612.6600341796875,
      "text": " commanded that they should heat the furnace one seven times more than it was"
    },
    {
      "id": 76,
      "start": 1612.6600341796875,
      "end": 1617.9400329589844,
      "text": " wont to be heated. He commanded the most mighty men that were in his army to bind"
    },
    {
      "id": 77,
      "start": 1617.9400329589844,
      "end": 1623.3000183105469,
      "text": " Shadrach, Meshach, and Abednego, and to cast them into the burning fiery furnace."
    },
    {
      "id": 78,
      "start": 1623.3000183105469,
      "end": 1629.02001953125,
      "text": " So he heats it up seven times hotter than what it was going to be set to, and"
    },
    {
      "id": 79,
      "start": 1629.3000183105469,
      "end": 1638.3000183105469,
      "text": " he finds the mightiest within his army to bind these men. It was so hot that the"
    },
    {
      "id": 80,
      "start": 1638.3000183105469,
      "end": 1643.4200439453125,
      "text": " men were slain that threw these three into the fire. Notice in verse 21, then"
    },
    {
      "id": 81,
      "start": 1643.4200439453125,
      "end": 1646.9800415039062,
      "text": " these men were bound in their coats, their hosen, their hats, their other"
    },
    {
      "id": 82,
      "start": 1646.9800415039062,
      "end": 1652.1800231933594,
      "text": " garments, and were cast in the midst of the burning fiery furnace. Therefore,"
    },
    {
      "id": 83,
      "start": 1652.1800231933594,
      "end": 1657.4600219726562,
      "text": " because the king's commandment was urgent, and the furnace exceeding hot, the"
    },
    {
      "id": 84,
      "start": 1657.4600219726562,
      "end": 1664.3000183105469,
      "text": " flame of the fire slew those men that took up Shadrach, Meshach, and Abednego."
    },
    {
      "id": 85,
      "start": 1664.3000183105469,
      "end": 1671.6200256347656,
      "text": " And these three men, Shadrach, Meshach, and Abednego, fell down bound into"
    },
    {
      "id": 86,
      "start": 1671.6200256347656,
      "end": 1678.5800170898438,
      "text": " the midst of the burning fiery furnace. But then Nebuchadnezzar's a stone-eyed."
    },
    {
      "id": 87,
      "start": 1678.5800170898438,
      "end": 1683.7000427246094,
      "text": " He's astonished as to what happens. The Bible tells us in verse number 24 that"
    },
    {
      "id": 88,
      "start": 1683.7000427246094,
      "end": 1688.5000305175781,
      "text": " he rose up in haste, and he speaks to his counselors that are there, and he"
    },
    {
      "id": 89,
      "start": 1688.5000305175781,
      "end": 1694.5800170898438,
      "text": " asked this question, did not we cast three men bound into the midst of the"
    },
    {
      "id": 90,
      "start": 1694.5800170898438,
      "end": 1700.8600158691406,
      "text": " fire? They answered and said unto the king, true, O king. I mean, he's in a"
    },
    {
      "id": 91,
      "start": 1700.8600158691406,
      "end": 1704.3000183105469,
      "text": " position where he's looking at what he's seeing, and he's saying, hey listen,"
    },
    {
      "id": 92,
      "start": 1704.3000183105469,
      "end": 1710.7400207519531,
      "text": " wasn't it three? And weren't they bound? Yes, true, O king. You've not lost your"
    },
    {
      "id": 93,
      "start": 1710.7400207519531,
      "end": 1723.1000366210938,
      "text": " mind. Yes, that's what we did. He answered and said, lo, I see four men loose. He"
    },
    {
      "id": 94,
      "start": 1723.1000366210938,
      "end": 1728.5,
      "text": " says they're loose, and they're walking in the midst of the fire, and they have"
    },
    {
      "id": 95,
      "start": 1728.5,
      "end": 1738.06005859375,
      "text": " no hurt. And the form of the fourth is like the Son of God. I want you to"
    },
    {
      "id": 96,
      "start": 1738.06005859375,
      "end": 1743.260009765625,
      "text": " consider the communion that they have."
    },
    {
      "id": 97,
      "start": 1745.5800170898438,
      "end": 1753.2200317382812,
      "text": " They enjoyed communion with God in a way that I don't know we can fully"
    },
    {
      "id": 98,
      "start": 1753.2200317382812,
      "end": 1760.300048828125,
      "text": " comprehend, because it was their obedience to God that led to the fire."
    },
    {
      "id": 99,
      "start": 1760.300048828125,
      "end": 1767.300048828125,
      "text": " It was their obedience to God that led to the fire. And they go in bound seven"
    },
    {
      "id": 100,
      "start": 1767.3800048828125,
      "end": 1776.260009765625,
      "text": " times hotter. The men that cast them in are killed. The king says they're walking"
    },
    {
      "id": 101,
      "start": 1776.260009765625,
      "end": 1782.300048828125,
      "text": " around. I mean, can you imagine King Nebuchadnezzar looking at this like,"
    },
    {
      "id": 102,
      "start": 1782.300048828125,
      "end": 1789.1000366210938,
      "text": " what is going on? How is this even possible? Remember what he said in verse"
    },
    {
      "id": 103,
      "start": 1789.1000366210938,
      "end": 1794.5400390625,
      "text": " number 15, who is that God that shall deliver you out of my hands? See, he"
    },
    {
      "id": 104,
      "start": 1794.5400390625,
      "end": 1800.300048828125,
      "text": " thought he had all this power, and he thought that if he raised the"
    },
    {
      "id": 105,
      "start": 1800.300048828125,
      "end": 1804.780029296875,
      "text": " stakes high enough, you're gonna bow."
    },
    {
      "id": 0,
      "start": 1804.780029296875,
      "end": 1806.0000293254852,
      "text": " I've heard people say this,"
    },
    {
      "id": 1,
      "start": 1806.0000293254852,
      "end": 1809.8000292778015,
      "text": " everybody has a price."
    },
    {
      "id": 2,
      "start": 1809.8000292778015,
      "end": 1813.320029258728,
      "text": " I hope you don't have a price."
    },
    {
      "id": 3,
      "start": 1813.320029258728,
      "end": 1816.120029449463,
      "text": " I hope that there's not some stake"
    },
    {
      "id": 4,
      "start": 1816.120029449463,
      "end": 1817.9800291061401,
      "text": " that the enemy could raise it to"
    },
    {
      "id": 5,
      "start": 1817.9800291061401,
      "end": 1821.0400295257568,
      "text": " and you say, okay, enough is enough."
    },
    {
      "id": 6,
      "start": 1821.0400295257568,
      "end": 1823.2400283813477,
      "text": " I'm just going to do what you want me to do."
    },
    {
      "id": 7,
      "start": 1823.2400283813477,
      "end": 1824.6800289154053,
      "text": " I'll bow if you want me to bow."
    },
    {
      "id": 8,
      "start": 1824.6800289154053,
      "end": 1828.860029220581,
      "text": " I'm not going in that furnace."
    },
    {
      "id": 9,
      "start": 1828.860029220581,
      "end": 1831.700029373169,
      "text": " It says in v. 26,"
    },
    {
      "id": 10,
      "start": 1831.700029373169,
      "end": 1833.8000297546387,
      "text": " then Nebuchadnezzar came near"
    },
    {
      "id": 11,
      "start": 1833.8000297546387,
      "end": 1835.7200298309326,
      "text": " to the mouth of the burning, fiery furnace"
    },
    {
      "id": 12,
      "start": 1835.7200298309326,
      "end": 1836.4600296020508,
      "text": " and spake."
    },
    {
      "id": 13,
      "start": 1836.4600296020508,
      "end": 1837.8000297546387,
      "text": " Can you imagine?"
    },
    {
      "id": 14,
      "start": 1837.8000297546387,
      "end": 1839.9800300598145,
      "text": " In my mind's eye, the people are still there."
    },
    {
      "id": 15,
      "start": 1839.9800300598145,
      "end": 1844.120029449463,
      "text": " It was in that same hour."
    },
    {
      "id": 16,
      "start": 1844.120029449463,
      "end": 1846.2400283813477,
      "text": " And he's talking to these guys."
    },
    {
      "id": 17,
      "start": 1846.2400283813477,
      "end": 1849.8000297546387,
      "text": " Now maybe there's some that are deep in the crowd"
    },
    {
      "id": 18,
      "start": 1849.8000297546387,
      "end": 1852.1600303649902,
      "text": " and they've not heard what was just asked"
    },
    {
      "id": 19,
      "start": 1852.1600303649902,
      "end": 1853.4000282287598,
      "text": " of the counselors."
    },
    {
      "id": 20,
      "start": 1853.4000282287598,
      "end": 1857.1600303649902,
      "text": " And they see the king walk over there"
    },
    {
      "id": 21,
      "start": 1857.1600303649902,
      "end": 1860.880027770996,
      "text": " and he's talking."
    },
    {
      "id": 22,
      "start": 1860.880027770996,
      "end": 1864.6600303649902,
      "text": " Now, if you were an observer,"
    },
    {
      "id": 23,
      "start": 1864.6600303649902,
      "end": 1868.380027770996,
      "text": " you saw the three men die that cast them in."
    },
    {
      "id": 24,
      "start": 1868.380027770996,
      "end": 1870.660026550293,
      "text": " Who's he talking to?"
    },
    {
      "id": 25,
      "start": 1870.660026550293,
      "end": 1874.3400268554688,
      "text": " Surely they're dead, right?"
    },
    {
      "id": 26,
      "start": 1874.3400268554688,
      "end": 1877.5000305175781,
      "text": " As an observer."
    },
    {
      "id": 27,
      "start": 1877.5000305175781,
      "end": 1879.3200302124023,
      "text": " And it says here that he spake"
    },
    {
      "id": 28,
      "start": 1879.3200302124023,
      "end": 1880.0600280761719,
      "text": " and he said,"
    },
    {
      "id": 29,
      "start": 1880.0600280761719,
      "end": 1882.2200317382812,
      "text": " Shadrach, Meshach, and Abednego."
    },
    {
      "id": 30,
      "start": 1882.2200317382812,
      "end": 1883.3200302124023,
      "text": " Notice what he says."
    },
    {
      "id": 31,
      "start": 1883.3200302124023,
      "end": 1889.160026550293,
      "text": " Ye servants of the Most High God."
    },
    {
      "id": 32,
      "start": 1889.160026550293,
      "end": 1894.2400283813477,
      "text": " Come forth and come hither."
    },
    {
      "id": 33,
      "start": 1894.2400283813477,
      "end": 1895.8200302124023,
      "text": " Then Shadrach, Meshach, and Abednego"
    },
    {
      "id": 34,
      "start": 1895.8200302124023,
      "end": 1899.280029296875,
      "text": " came forth in the midst of the fire."
    },
    {
      "id": 35,
      "start": 1899.280029296875,
      "end": 1903.6000289916992,
      "text": " I can't even imagine being an observer"
    },
    {
      "id": 36,
      "start": 1903.6000289916992,
      "end": 1906.9200286865234,
      "text": " and seeing those boys walk out."
    },
    {
      "id": 37,
      "start": 1906.9200286865234,
      "end": 1909.0800323486328,
      "text": " What is going on?"
    },
    {
      "id": 38,
      "start": 1909.0800323486328,
      "end": 1910.5600280761719,
      "text": " Right?"
    },
    {
      "id": 39,
      "start": 1910.5600280761719,
      "end": 1914.280029296875,
      "text": " And they come walking out."
    },
    {
      "id": 40,
      "start": 1914.280029296875,
      "end": 1916.5600280761719,
      "text": " I don't know how long"
    },
    {
      "id": 41,
      "start": 1916.5600280761719,
      "end": 1919.4600296020508,
      "text": " they were in the burning, fiery furnace."
    },
    {
      "id": 42,
      "start": 1919.4600296020508,
      "end": 1922.680030822754,
      "text": " I don't think you do either."
    },
    {
      "id": 43,
      "start": 1922.680030822754,
      "end": 1924.6400299072266,
      "text": " It doesn't seem that it was extremely long"
    },
    {
      "id": 44,
      "start": 1924.6400299072266,
      "end": 1927.0200271606445,
      "text": " that they were there in the burning, fiery furnace."
    },
    {
      "id": 45,
      "start": 1927.0200271606445,
      "end": 1928.8600311279297,
      "text": " But they spent more time in that burning, fiery furnace"
    },
    {
      "id": 46,
      "start": 1928.8600311279297,
      "end": 1930.3200302124023,
      "text": " than you did."
    },
    {
      "id": 47,
      "start": 1930.3200302124023,
      "end": 1933.1400299072266,
      "text": " Or than I have."
    },
    {
      "id": 48,
      "start": 1933.1400299072266,
      "end": 1936.0800323486328,
      "text": " And it was because they were willing to stand."
    },
    {
      "id": 49,
      "start": 1936.0800323486328,
      "end": 1938.7000274658203,
      "text": " That they went in that burning, fiery furnace."
    },
    {
      "id": 50,
      "start": 1938.7000274658203,
      "end": 1941.2200317382812,
      "text": " And the reality is that as we look at this,"
    },
    {
      "id": 51,
      "start": 1941.2200317382812,
      "end": 1944.7000274658203,
      "text": " and we think about the communion that they enjoyed,"
    },
    {
      "id": 52,
      "start": 1944.7200317382812,
      "end": 1946.780029296875,
      "text": " we find that the psalmist says that in Thy presence"
    },
    {
      "id": 53,
      "start": 1946.780029296875,
      "end": 1950.4000244140625,
      "text": " is fullness of joy."
    },
    {
      "id": 54,
      "start": 1950.4000244140625,
      "end": 1952.7400360107422,
      "text": " Jeremiah, of course, he's prophesying"
    },
    {
      "id": 55,
      "start": 1952.7400360107422,
      "end": 1954.4600219726562,
      "text": " on the eve of captivity."
    },
    {
      "id": 56,
      "start": 1954.4600219726562,
      "end": 1956.4400329589844,
      "text": " And in fact, Jeremiah's prophesying"
    },
    {
      "id": 57,
      "start": 1956.4400329589844,
      "end": 1959.2400360107422,
      "text": " when the Babylonians have besieged the city"
    },
    {
      "id": 58,
      "start": 1959.2400360107422,
      "end": 1960.760025024414,
      "text": " and he sees them all around."
    },
    {
      "id": 59,
      "start": 1960.760025024414,
      "end": 1962.4400329589844,
      "text": " He understands what's going to happen."
    },
    {
      "id": 60,
      "start": 1962.4400329589844,
      "end": 1965.4600219726562,
      "text": " But God gives word after word to Jeremiah."
    },
    {
      "id": 61,
      "start": 1965.4600219726562,
      "end": 1968.2000274658203,
      "text": " And in here, in Jeremiah 42 and v. 11,"
    },
    {
      "id": 62,
      "start": 1968.2000274658203,
      "end": 1969.040023803711,
      "text": " the Bible says,"
    },
    {
      "id": 63,
      "start": 1969.040023803711,
      "end": 1972.1000366210938,
      "text": " be not afraid of the King of Babylon,"
    },
    {
      "id": 64,
      "start": 1972.1000366210938,
      "end": 1974.520034790039,
      "text": " of whom you are afraid."
    },
    {
      "id": 65,
      "start": 1974.540023803711,
      "end": 1977.2400360107422,
      "text": " Be not afraid of Him, saith the Lord,"
    },
    {
      "id": 66,
      "start": 1977.2400360107422,
      "end": 1980.5800323486328,
      "text": " for I am with you to save you"
    },
    {
      "id": 67,
      "start": 1980.5800323486328,
      "end": 1983.8200225830078,
      "text": " and to deliver you from His hand."
    },
    {
      "id": 68,
      "start": 1983.8200225830078,
      "end": 1987.540023803711,
      "text": " Jeremiah 42 and v. 11."
    },
    {
      "id": 69,
      "start": 1987.540023803711,
      "end": 1990.6800231933594,
      "text": " Don't be afraid of Him."
    },
    {
      "id": 70,
      "start": 1990.6800231933594,
      "end": 1993.1400299072266,
      "text": " The One you're afraid of, don't be afraid of Him."
    },
    {
      "id": 71,
      "start": 1993.1400299072266,
      "end": 1995.9600219726562,
      "text": " Why? Because I'm with you."
    },
    {
      "id": 72,
      "start": 1995.9600219726562,
      "end": 1998.4800262451172,
      "text": " I'm with you."
    },
    {
      "id": 73,
      "start": 1998.4800262451172,
      "end": 2001.8600311279297,
      "text": " Man, they had some communion with God."
    },
    {
      "id": 74,
      "start": 2001.9000244140625,
      "end": 2005.1600341796875,
      "text": " We understand that as we look at the truth"
    },
    {
      "id": 75,
      "start": 2005.1600341796875,
      "end": 2006.260025024414,
      "text": " of the New Testament,"
    },
    {
      "id": 76,
      "start": 2006.260025024414,
      "end": 2007.8600311279297,
      "text": " Jesus said in Matthew 28"
    },
    {
      "id": 77,
      "start": 2007.8600311279297,
      "end": 2009.260025024414,
      "text": " before His ascension,"
    },
    {
      "id": 78,
      "start": 2009.260025024414,
      "end": 2011.3400268554688,
      "text": " all power is given unto Me."
    },
    {
      "id": 79,
      "start": 2011.3400268554688,
      "end": 2013.3400268554688,
      "text": " He gives the great commission."
    },
    {
      "id": 80,
      "start": 2013.3400268554688,
      "end": 2017.2200317382812,
      "text": " And He says, lo, I am with you always."
    },
    {
      "id": 81,
      "start": 2017.2200317382812,
      "end": 2018.9000244140625,
      "text": " Hebrews 13 and v. 5,"
    },
    {
      "id": 82,
      "start": 2018.9000244140625,
      "end": 2020.8600311279297,
      "text": " a precious promise of the Word of God."
    },
    {
      "id": 83,
      "start": 2020.8600311279297,
      "end": 2023.9400329589844,
      "text": " He will never leave thee nor forsake thee."
    },
    {
      "id": 84,
      "start": 2023.9400329589844,
      "end": 2026.1400299072266,
      "text": " When we understand the truth of v. 6,"
    },
    {
      "id": 85,
      "start": 2026.1400299072266,
      "end": 2029.1000366210938,
      "text": " He is my Helper."
    },
    {
      "id": 86,
      "start": 2029.1000366210938,
      "end": 2034.7000274658203,
      "text": " Therefore, who or what am I going to fear?"
    },
    {
      "id": 87,
      "start": 2034.7000274658203,
      "end": 2036.9400329589844,
      "text": " The psalmist said in Psalm 121,"
    },
    {
      "id": 88,
      "start": 2036.9400329589844,
      "end": 2039.780029296875,
      "text": " I will lift up mine eyes unto the hills."
    },
    {
      "id": 89,
      "start": 2039.780029296875,
      "end": 2042.2200317382812,
      "text": " From whence cometh my help?"
    },
    {
      "id": 90,
      "start": 2042.2200317382812,
      "end": 2044.4200286865234,
      "text": " My help cometh from the Lord"
    },
    {
      "id": 91,
      "start": 2044.4200286865234,
      "end": 2048.060028076172,
      "text": " which made heaven and earth."
    },
    {
      "id": 92,
      "start": 2048.060028076172,
      "end": 2050.1400299072266,
      "text": " He is my Helper."
    },
    {
      "id": 93,
      "start": 2050.1400299072266,
      "end": 2053.020034790039,
      "text": " He's your Helper."
    },
    {
      "id": 94,
      "start": 2053.020034790039,
      "end": 2054.980026245117,
      "text": " And here, these men,"
    },
    {
      "id": 95,
      "start": 2054.980026245117,
      "end": 2058.1400299072266,
      "text": " they find themselves in the fiery furnace,"
    },
    {
      "id": 96,
      "start": 2058.1800231933594,
      "end": 2061.820037841797,
      "text": " they find themselves enjoying some communion with God."
    },
    {
      "id": 97,
      "start": 2061.820037841797,
      "end": 2063.9400329589844,
      "text": " Can I tell you this morning that"
    },
    {
      "id": 98,
      "start": 2063.9400329589844,
      "end": 2066.5800170898438,
      "text": " if you're going to stand and if I'm going to stand,"
    },
    {
      "id": 99,
      "start": 2066.5800170898438,
      "end": 2069.6200256347656,
      "text": " we may face some consequences."
    },
    {
      "id": 100,
      "start": 2069.6200256347656,
      "end": 2070.9400329589844,
      "text": " But can I tell you,"
    },
    {
      "id": 101,
      "start": 2070.9400329589844,
      "end": 2074.02001953125,
      "text": " God will be with you."
    },
    {
      "id": 102,
      "start": 2074.02001953125,
      "end": 2076.1400146484375,
      "text": " God will be with you."
    },
    {
      "id": 103,
      "start": 2076.1400146484375,
      "end": 2080.7000427246094,
      "text": " And you'll have seasons of communion"
    },
    {
      "id": 104,
      "start": 2080.7000427246094,
      "end": 2083.1400146484375,
      "text": " that are sweeter than you've ever enjoyed"
    },
    {
      "id": 105,
      "start": 2083.1400146484375,
      "end": 2085.4200439453125,
      "text": " any time before."
    },
    {
      "id": 106,
      "start": 2085.4200439453125,
      "end": 2087.3400268554688,
      "text": " I think about Paul and Silas"
    },
    {
      "id": 107,
      "start": 2087.3400268554688,
      "end": 2089.9000244140625,
      "text": " when they were in prison."
    },
    {
      "id": 108,
      "start": 2089.9000244140625,
      "end": 2093.740020751953,
      "text": " They were cast into the prison fast,"
    },
    {
      "id": 109,
      "start": 2093.740020751953,
      "end": 2096.4600219726562,
      "text": " locked away."
    },
    {
      "id": 110,
      "start": 2096.4600219726562,
      "end": 2099.3800354003906,
      "text": " But man, they were singing, were they not?"
    },
    {
      "id": 111,
      "start": 2099.3800354003906,
      "end": 2102.6600341796875,
      "text": " Singing to God, they were having communion with God."
    },
    {
      "id": 112,
      "start": 2102.6600341796875,
      "end": 2105.02001953125,
      "text": " See, this morning,"
    },
    {
      "id": 113,
      "start": 2105.02001953125,
      "end": 2109.6200256347656,
      "text": " I believe that we better prepare to stand."
    },
    {
      "id": 114,
      "start": 2109.6200256347656,
      "end": 2113.7000427246094,
      "text": " And I believe that as I look at a passage like Daniel 3,"
    },
    {
      "id": 115,
      "start": 2113.7000427246094,
      "end": 2115.02001953125,
      "text": " that I'm encouraged."
    },
    {
      "id": 116,
      "start": 2115.02001953125,
      "end": 2117.3800354003906,
      "text": " This is an encouraging passage of Scripture."
    },
    {
      "id": 117,
      "start": 2117.3800354003906,
      "end": 2120.02001953125,
      "text": " It's exciting."
    },
    {
      "id": 118,
      "start": 2120.02001953125,
      "end": 2123.02001953125,
      "text": " To read the account, this isn't some fairy tale."
    },
    {
      "id": 119,
      "start": 2123.02001953125,
      "end": 2126.3800354003906,
      "text": " This is God's Word. This happened."
    },
    {
      "id": 120,
      "start": 2126.3800354003906,
      "end": 2128.4600219726562,
      "text": " And not only does it encourage us,"
    },
    {
      "id": 121,
      "start": 2128.4600219726562,
      "end": 2132.300018310547,
      "text": " I believe it should challenge us."
    },
    {
      "id": 122,
      "start": 2132.300018310547,
      "end": 2135.2200317382812,
      "text": " Because am I willing to stand?"
    },
    {
      "id": 123,
      "start": 2135.2200317382812,
      "end": 2137.300018310547,
      "text": " Are you willing to stand?"
    },
    {
      "id": 124,
      "start": 2137.300018310547,
      "end": 2140.5400390625,
      "text": " I mean, when the stakes are like they were for these three,"
    },
    {
      "id": 125,
      "start": 2140.5400390625,
      "end": 2143.8600158691406,
      "text": " are we willing to stand?"
    },
    {
      "id": 126,
      "start": 2143.8600158691406,
      "end": 2145.2200317382812,
      "text": " In closing, I want you to consider"
    },
    {
      "id": 127,
      "start": 2145.2200317382812,
      "end": 2147.9400329589844,
      "text": " some consequences of their stand."
    },
    {
      "id": 128,
      "start": 2147.9400329589844,
      "end": 2150.02001953125,
      "text": " I want you to consider with me a few things"
    },
    {
      "id": 129,
      "start": 2150.02001953125,
      "end": 2151.9400329589844,
      "text": " as we look at the remainder of the passage."
    },
    {
      "id": 130,
      "start": 2151.9400329589844,
      "end": 2154.3800354003906,
      "text": " I want you to, just for a moment,"
    },
    {
      "id": 131,
      "start": 2154.3800354003906,
      "end": 2156.8600158691406,
      "text": " consider how this experience"
    },
    {
      "id": 132,
      "start": 2156.8600158691406,
      "end": 2159.2200317382812,
      "text": " impacted their own lives."
    },
    {
      "id": 133,
      "start": 2159.2200317382812,
      "end": 2160.6200256347656,
      "text": " Can you imagine?"
    },
    {
      "id": 134,
      "start": 2160.6200256347656,
      "end": 2162.8600158691406,
      "text": " Listen, when you see God work,"
    },
    {
      "id": 135,
      "start": 2162.8600158691406,
      "end": 2166.3400268554688,
      "text": " when you see God do something miraculous,"
    },
    {
      "id": 136,
      "start": 2166.3400268554688,
      "end": 2170.2200317382812,
      "text": " it has an impact in your life."
    },
    {
      "id": 137,
      "start": 2170.2200317382812,
      "end": 2172.3400268554688,
      "text": " Do you think that these men"
    },
    {
      "id": 138,
      "start": 2172.3400268554688,
      "end": 2174.4200439453125,
      "text": " talked about this experience?"
    },
    {
      "id": 139,
      "start": 2174.4200439453125,
      "end": 2175.780029296875,
      "text": " I mean, I do."
    },
    {
      "id": 140,
      "start": 2175.780029296875,
      "end": 2178.9400329589844,
      "text": " I don't have any Bible to prove it to you."
    },
    {
      "id": 141,
      "start": 2178.9400329589844,
      "end": 2182.500030517578,
      "text": " But I see these guys talking about"
    },
    {
      "id": 142,
      "start": 2182.500030517578,
      "end": 2184.9800415039062,
      "text": " there was a time that we were in the burning fiery furnace."
    },
    {
      "id": 143,
      "start": 2184.9800415039062,
      "end": 2186.3400268554688,
      "text": " Let me tell you what happened."
    },
    {
      "id": 144,
      "start": 2186.3400268554688,
      "end": 2187.9400329589844,
      "text": " Can you imagine the generational impact"
    },
    {
      "id": 145,
      "start": 2187.9400329589844,
      "end": 2189.1400146484375,
      "text": " maybe to their grandchildren"
    },
    {
      "id": 146,
      "start": 2189.1400146484375,
      "end": 2192.3400268554688,
      "text": " as they would sit and talk about what God did?"
    },
    {
      "id": 147,
      "start": 2192.3400268554688,
      "end": 2195.4600219726562,
      "text": " Man, it had an impact in their lives."
    },
    {
      "id": 148,
      "start": 2195.4600219726562,
      "end": 2197.260040283203,
      "text": " But in verse 27, I want you to notice"
    },
    {
      "id": 149,
      "start": 2197.260040283203,
      "end": 2198.9800415039062,
      "text": " how this experience impacted the lives"
    },
    {
      "id": 150,
      "start": 2198.9800415039062,
      "end": 2201.6600341796875,
      "text": " of the princes, the governors, the captains,"
    },
    {
      "id": 151,
      "start": 2201.7000427246094,
      "end": 2203.500030517578,
      "text": " and the king's counselors."
    },
    {
      "id": 152,
      "start": 2203.500030517578,
      "end": 2206.1400146484375,
      "text": " Notice what it says in verse 27."
    },
    {
      "id": 153,
      "start": 2206.1400146484375,
      "end": 2207.9400329589844,
      "text": " Again, to get back to the context,"
    },
    {
      "id": 154,
      "start": 2207.9400329589844,
      "end": 2209.7000427246094,
      "text": " Nebuchadnezzar has come close to the mouth"
    },
    {
      "id": 155,
      "start": 2209.7000427246094,
      "end": 2210.780029296875,
      "text": " of the burning fiery furnace."
    },
    {
      "id": 156,
      "start": 2210.780029296875,
      "end": 2211.9000244140625,
      "text": " He says to these men,"
    },
    {
      "id": 157,
      "start": 2211.9000244140625,
      "end": 2213.260040283203,
      "text": " ye servants of the Most High God,"
    },
    {
      "id": 158,
      "start": 2213.260040283203,
      "end": 2215.5400390625,
      "text": " come forth, and they came hither."
    },
    {
      "id": 159,
      "start": 2215.5400390625,
      "end": 2217.4200439453125,
      "text": " They came forth out of the midst of the fire."
    },
    {
      "id": 160,
      "start": 2217.4200439453125,
      "end": 2218.8600158691406,
      "text": " It says in verse 27,"
    },
    {
      "id": 161,
      "start": 2218.8600158691406,
      "end": 2221.300018310547,
      "text": " and the princes, governors, and captains,"
    },
    {
      "id": 162,
      "start": 2221.300018310547,
      "end": 2222.7000427246094,
      "text": " and the king's counselors,"
    },
    {
      "id": 163,
      "start": 2222.7000427246094,
      "end": 2223.9800415039062,
      "text": " being gathered together,"
    },
    {
      "id": 164,
      "start": 2223.9800415039062,
      "end": 2225.5400390625,
      "text": " notice these three words,"
    },
    {
      "id": 165,
      "start": 2225.5400390625,
      "end": 2229.260040283203,
      "text": " saw these men."
    },
    {
      "id": 166,
      "start": 2229.260040283203,
      "end": 2230.9800415039062,
      "text": " They saw it."
    },
    {
      "id": 167,
      "start": 2230.9800415039062,
      "end": 2233.9400329589844,
      "text": " They were eyewitnesses of these men"
    },
    {
      "id": 168,
      "start": 2233.9400329589844,
      "end": 2237.820037841797,
      "text": " walking out of the burning fiery furnace."
    },
    {
      "id": 169,
      "start": 2237.820037841797,
      "end": 2239.1800231933594,
      "text": " And it says,"
    },
    {
      "id": 170,
      "start": 2239.1800231933594,
      "end": 2243.1000366210938,
      "text": " upon whose bodies the fire had no power,"
    },
    {
      "id": 171,
      "start": 2243.1000366210938,
      "end": 2246.6600341796875,
      "text": " nor was a hair of their head singed,"
    },
    {
      "id": 172,
      "start": 2246.6600341796875,
      "end": 2249.1400146484375,
      "text": " neither were their coats changed,"
    },
    {
      "id": 173,
      "start": 2249.1400146484375,
      "end": 2254.5400390625,
      "text": " nor the smell of fire had passed on them."
    },
    {
      "id": 174,
      "start": 2254.5400390625,
      "end": 2257.5800170898438,
      "text": " How many of you have ever been to a bonfire?"
    },
    {
      "id": 175,
      "start": 2257.5800170898438,
      "end": 2258.4200439453125,
      "text": " How many of you, when you got home,"
    },
    {
      "id": 176,
      "start": 2258.4200439453125,
      "end": 2262.1000366210938,
      "text": " smelled like bonfire?"
    },
    {
      "id": 177,
      "start": 2262.1000366210938,
      "end": 2263.9800415039062,
      "text": " How many of you have ever grilled?"
    },
    {
      "id": 178,
      "start": 2263.9800415039062,
      "end": 2266.02001953125,
      "text": " And you try not to touch the flame,"
    },
    {
      "id": 179,
      "start": 2266.02001953125,
      "end": 2269.2200317382812,
      "text": " but those little hairs get singed up."
    },
    {
      "id": 180,
      "start": 2269.2200317382812,
      "end": 2270.260040283203,
      "text": " Right?"
    },
    {
      "id": 181,
      "start": 2270.260040283203,
      "end": 2271.260040283203,
      "text": " These men were in the midst"
    },
    {
      "id": 182,
      "start": 2271.260040283203,
      "end": 2273.780029296875,
      "text": " of the burning fiery furnace."
    },
    {
      "id": 183,
      "start": 2273.780029296875,
      "end": 2275.6600341796875,
      "text": " And all these fellows that were there,"
    },
    {
      "id": 184,
      "start": 2275.6600341796875,
      "end": 2279.500030517578,
      "text": " the princes, the governors, the captains,"
    },
    {
      "id": 185,
      "start": 2279.500030517578,
      "end": 2280.820037841797,
      "text": " the king's counselors,"
    },
    {
      "id": 186,
      "start": 2280.820037841797,
      "end": 2282.6200256347656,
      "text": " they see these men walk out,"
    },
    {
      "id": 187,
      "start": 2282.6200256347656,
      "end": 2286.6600341796875,
      "text": " and they're not bound anymore."
    },
    {
      "id": 188,
      "start": 2286.6600341796875,
      "end": 2288.8600158691406,
      "text": " The fire had no power on them."
    },
    {
      "id": 189,
      "start": 2288.8600158691406,
      "end": 2291.6200256347656,
      "text": " They have not a hair singed."
    },
    {
      "id": 190,
      "start": 2291.6200256347656,
      "end": 2295.780029296875,
      "text": " And they don't even smell like fire."
    },
    {
      "id": 191,
      "start": 2295.780029296875,
      "end": 2296.9800415039062,
      "text": " Now that would cause those guys"
    },
    {
      "id": 192,
      "start": 2296.9800415039062,
      "end": 2299.300018310547,
      "text": " to kind of like, what is going on?"
    },
    {
      "id": 193,
      "start": 2299.300018310547,
      "end": 2301.5800170898438,
      "text": " Right? I mean, seriously."
    },
    {
      "id": 194,
      "start": 2301.5800170898438,
      "end": 2307.060028076172,
      "text": " You remember back in the book of Exodus,"
    },
    {
      "id": 195,
      "start": 2307.060028076172,
      "end": 2310.2200317382812,
      "text": " when Pharaoh said something similar"
    },
    {
      "id": 196,
      "start": 2310.2200317382812,
      "end": 2315.9000244140625,
      "text": " to Moses about who is your God?"
    },
    {
      "id": 197,
      "start": 2315.9400329589844,
      "end": 2317.7000122070312,
      "text": " God, through a series of events,"
    },
    {
      "id": 198,
      "start": 2317.7000122070312,
      "end": 2319.3800048828125,
      "text": " the plagues as we refer to them as,"
    },
    {
      "id": 199,
      "start": 2319.3800048828125,
      "end": 2321.3400268554688,
      "text": " revealed who He was."
    },
    {
      "id": 200,
      "start": 2321.3400268554688,
      "end": 2324.4600219726562,
      "text": " The power that He has."
    },
    {
      "id": 201,
      "start": 2324.4600219726562,
      "end": 2326.6600341796875,
      "text": " So much so that the counselors of Pharaoh"
    },
    {
      "id": 202,
      "start": 2326.6600341796875,
      "end": 2328.1400146484375,
      "text": " said this is nothing more than"
    },
    {
      "id": 203,
      "start": 2328.1400146484375,
      "end": 2332.3400268554688,
      "text": " the finger of God."
    },
    {
      "id": 204,
      "start": 2332.3400268554688,
      "end": 2333.5800170898438,
      "text": " Nebuchadnezzar says,"
    },
    {
      "id": 205,
      "start": 2333.5800170898438,
      "end": 2335.9000244140625,
      "text": " ye servants of the Most High God,"
    },
    {
      "id": 206,
      "start": 2335.9000244140625,
      "end": 2337.5800170898438,
      "text": " come out!"
    },
    {
      "id": 207,
      "start": 2337.5800170898438,
      "end": 2342.5800170898438,
      "text": " And all of these idol-worshiping Babylonians"
    },
    {
      "id": 208,
      "start": 2342.5800170898438,
      "end": 2345.6600341796875,
      "text": " see these men walk out with no hurt."
    },
    {
      "id": 209,
      "start": 2345.6600341796875,
      "end": 2347.1000366210938,
      "text": " I don't think any of them were lining up"
    },
    {
      "id": 210,
      "start": 2347.1000366210938,
      "end": 2350.6600341796875,
      "text": " to go in it to see if their gods could deliver."
    },
    {
      "id": 211,
      "start": 2350.6600341796875,
      "end": 2352.2200317382812,
      "text": " Do you?"
    },
    {
      "id": 212,
      "start": 2352.2200317382812,
      "end": 2356.1000366210938,
      "text": " Nuh-uh."
    },
    {
      "id": 213,
      "start": 2356.1000366210938,
      "end": 2357.5800170898438,
      "text": " What an impact,"
    },
    {
      "id": 214,
      "start": 2357.5800170898438,
      "end": 2359.06005859375,
      "text": " as we think about the consequences"
    },
    {
      "id": 215,
      "start": 2359.06005859375,
      "end": 2360.1000366210938,
      "text": " of their stand."
    },
    {
      "id": 216,
      "start": 2360.1000366210938,
      "end": 2361.300048828125,
      "text": " Listen, when you stand,"
    },
    {
      "id": 217,
      "start": 2361.300048828125,
      "end": 2362.4200439453125,
      "text": " there are going to be some consequences."
    },
    {
      "id": 218,
      "start": 2362.4200439453125,
      "end": 2363.6200561523438,
      "text": " There's going to be some impact in your life,"
    },
    {
      "id": 219,
      "start": 2363.6200561523438,
      "end": 2365.4200439453125,
      "text": " in my life."
    },
    {
      "id": 220,
      "start": 2365.4200439453125,
      "end": 2367.7400512695312,
      "text": " But in the lives of others around us,"
    },
    {
      "id": 221,
      "start": 2367.7400512695312,
      "end": 2369.4200439453125,
      "text": " they see what God is able to do."
    },
    {
      "id": 222,
      "start": 2369.4200439453125,
      "end": 2372.7400512695312,
      "text": " They see that it's not just a theory."
    },
    {
      "id": 223,
      "start": 2372.7400512695312,
      "end": 2374.8200073242188,
      "text": " You know, this book is so much more than theory."
    },
    {
      "id": 224,
      "start": 2374.8600463867188,
      "end": 2377.7000122070312,
      "text": " To walk with God is not just a theory kind of thing."
    },
    {
      "id": 225,
      "start": 2377.7000122070312,
      "end": 2379.1000366210938,
      "text": " It's real life."
    },
    {
      "id": 226,
      "start": 2379.1000366210938,
      "end": 2382.3400268554688,
      "text": " God is really able."
    },
    {
      "id": 227,
      "start": 2382.3400268554688,
      "end": 2383.780029296875,
      "text": " God delivers."
    },
    {
      "id": 228,
      "start": 2383.780029296875,
      "end": 2385.9800415039062,
      "text": " God works."
    },
    {
      "id": 229,
      "start": 2385.9800415039062,
      "end": 2390.5,
      "text": " And we find that this experience"
    },
    {
      "id": 230,
      "start": 2390.5,
      "end": 2392.5800170898438,
      "text": " not only impacted these men personally,"
    },
    {
      "id": 231,
      "start": 2392.5800170898438,
      "end": 2396.9400024414062,
      "text": " it impacted those in leadership around the king,"
    },
    {
      "id": 232,
      "start": 2396.9400024414062,
      "end": 2403.1000366210938,
      "text": " but it also impacted Nebuchadnezzar."
    },
    {
      "id": 233,
      "start": 2403.1000366210938,
      "end": 2405.1000366210938,
      "text": " Verse number 28, it says..."
    },
    {
      "id": 0,
      "start": 2405.1000366210938,
      "end": 2413.500036239624,
      "text": " this. He spake and said, blessed be the God of Shadrach, Meshach, and Abednego who"
    },
    {
      "id": 1,
      "start": 2413.500036239624,
      "end": 2418.0600366592407,
      "text": " hath sent his angel and delivered his servants. Now stop there, we're gonna read"
    },
    {
      "id": 2,
      "start": 2418.0600366592407,
      "end": 2422.5400371551514,
      "text": " the rest of it in just a moment. But you notice that this man Nebuchadnezzar, he"
    },
    {
      "id": 3,
      "start": 2422.5400371551514,
      "end": 2426.58003616333,
      "text": " said, who is that God that shall deliver you out of my hand? And we find that now"
    },
    {
      "id": 4,
      "start": 2426.58003616333,
      "end": 2431.1800365448,
      "text": " he says, ye servants of the Most High God, and he says, blessed be the God of these"
    },
    {
      "id": 5,
      "start": 2431.1800365448,
      "end": 2436.300037384033,
      "text": " men, Shadrach, Meshach, and Abednego, who has delivered his servants, but notice"
    },
    {
      "id": 6,
      "start": 2436.300037384033,
      "end": 2440.7800369262695,
      "text": " what he recognizes, that those servants that were delivered, that they first"
    },
    {
      "id": 7,
      "start": 2440.7800369262695,
      "end": 2449.6600379943848,
      "text": " trusted in him. We sing trust and obey, for there's no other way to be happy in"
    },
    {
      "id": 8,
      "start": 2449.6600379943848,
      "end": 2458.240036010742,
      "text": " Jesus, but to trust and obey. Why is it that we should trust God? Because he's"
    },
    {
      "id": 9,
      "start": 2458.240036010742,
      "end": 2465.8800354003906,
      "text": " faithful, because he always does what he says he will do. We find that God, as the"
    },
    {
      "id": 10,
      "start": 2465.8800354003906,
      "end": 2469.760040283203,
      "text": " children of Israel are given the assignment to go into the the land of"
    },
    {
      "id": 11,
      "start": 2469.760040283203,
      "end": 2474.360038757324,
      "text": " promise, and Moses sends out the spies, and they come back with the evil report,"
    },
    {
      "id": 12,
      "start": 2474.360038757324,
      "end": 2478.5600357055664,
      "text": " and Joshua and Caleb are seeking to influence the congregation to go and"
    },
    {
      "id": 13,
      "start": 2478.5600357055664,
      "end": 2484.4400329589844,
      "text": " believe God, and they were ready to stone those guys. God says, how long will it be"
    },
    {
      "id": 14,
      "start": 2484.4400329589844,
      "end": 2491.720039367676,
      "text": " are my people believe me? Trust me, that we have confidence in God. See, it says"
    },
    {
      "id": 15,
      "start": 2491.720039367676,
      "end": 2496.760040283203,
      "text": " that this man, Nebuchadnezzar, he recognized that these servants were"
    },
    {
      "id": 16,
      "start": 2496.760040283203,
      "end": 2502.0800399780273,
      "text": " delivered, but it was a result that they trusted in him, and then notice this, and"
    },
    {
      "id": 17,
      "start": 2502.0800399780273,
      "end": 2509.520034790039,
      "text": " have changed the king's word, and yielded their bodies, that they might"
    },
    {
      "id": 18,
      "start": 2509.520034790039,
      "end": 2519.800033569336,
      "text": " not serve nor worship any God except their own God. It impacted Nebuchadnezzar."
    },
    {
      "id": 19,
      "start": 2519.800033569336,
      "end": 2527.320037841797,
      "text": " He said, these guys trusted in God, they yielded their bodies. It's interesting if"
    },
    {
      "id": 20,
      "start": 2527.320037841797,
      "end": 2531.800033569336,
      "text": " you were to go and maybe jot it down in your notes to read Romans 6 about who we"
    },
    {
      "id": 21,
      "start": 2531.800033569336,
      "end": 2538.800033569336,
      "text": " yield ourselves to. We are to yield ourselves unto the Lord, and we find that"
    },
    {
      "id": 22,
      "start": 2538.800033569336,
      "end": 2543.9600372314453,
      "text": " these men, they yielded themselves. It's interesting if you look in Romans 6"
    },
    {
      "id": 23,
      "start": 2543.9600372314453,
      "end": 2548.000030517578,
      "text": " and you read the references with regard to the word yield or yielded, it's the"
    },
    {
      "id": 24,
      "start": 2548.000030517578,
      "end": 2552.3600311279297,
      "text": " same Greek word that is used in Romans 12 when he says that you would present"
    },
    {
      "id": 25,
      "start": 2552.3600311279297,
      "end": 2558.800033569336,
      "text": " your bodies a living sacrifice. Same exact Greek word. So, yielding and"
    },
    {
      "id": 26,
      "start": 2558.800033569336,
      "end": 2566.280029296875,
      "text": " presenting our bodies to God, and see what God is able to do. He said, I'm not"
    },
    {
      "id": 27,
      "start": 2566.320037841797,
      "end": 2569.4800415039062,
      "text": " interested in signing up for all that. I don't want to be a martyr. Neither do I."
    },
    {
      "id": 28,
      "start": 2569.4800415039062,
      "end": 2575.320037841797,
      "text": " I mean, honestly, I don't want to face, I don't want to go to prison. I don't want"
    },
    {
      "id": 29,
      "start": 2575.320037841797,
      "end": 2581.6000366210938,
      "text": " to do any of that stuff, but we got to stand. We got to stand. We have to be"
    },
    {
      "id": 30,
      "start": 2581.6000366210938,
      "end": 2587.4000396728516,
      "text": " resolved. The pressures are only going to continue to increase. Listen, we have the"
    },
    {
      "id": 31,
      "start": 2587.4000396728516,
      "end": 2591.800033569336,
      "text": " Word of God, and the Bible says that in the last days, perilous times are going"
    },
    {
      "id": 32,
      "start": 2591.800033569336,
      "end": 2597.760040283203,
      "text": " to come. They're here. Evil men and seducers are going to get better. No, they're"
    },
    {
      "id": 33,
      "start": 2597.760040283203,
      "end": 2603.520034790039,
      "text": " going to wax worse and worse, deceiving and being deceived. Is that not what the"
    },
    {
      "id": 34,
      "start": 2603.520034790039,
      "end": 2610.520034790039,
      "text": " Word of God says, tells us? Clearly, God gives us the instruction. We find that"
    },
    {
      "id": 35,
      "start": 2610.520034790039,
      "end": 2615.4800415039062,
      "text": " really as we look at the consequences and we see the impact upon these groups"
    },
    {
      "id": 36,
      "start": 2615.4800415039062,
      "end": 2620.6400299072266,
      "text": " of people, I want you to understand that God was glorified, and that's what it's"
    },
    {
      "id": 37,
      "start": 2620.6400299072266,
      "end": 2625.4400329589844,
      "text": " all about. It's not really about us saying, oh, look at these guys. They were"
    },
    {
      "id": 38,
      "start": 2625.4400329589844,
      "end": 2632.3600311279297,
      "text": " so bold to stand for God. I'm thankful that they were, but God was glorified. It"
    },
    {
      "id": 39,
      "start": 2632.3600311279297,
      "end": 2639.4800415039062,
      "text": " says in verse 29, therefore, I make a decree. Now, he started the chapter by"
    },
    {
      "id": 40,
      "start": 2639.4800415039062,
      "end": 2646.1200408935547,
      "text": " making a decree that everybody bow down to his image, and now he makes a decree"
    },
    {
      "id": 41,
      "start": 2646.1200408935547,
      "end": 2649.9200439453125,
      "text": " at the end of the chapter that every people, nation, and language would speak"
    },
    {
      "id": 42,
      "start": 2649.9200439453125,
      "end": 2655.520034790039,
      "text": " anything amiss against the God of Shadrach, Meshach, and Abednego shall be"
    },
    {
      "id": 43,
      "start": 2655.520034790039,
      "end": 2662.800048828125,
      "text": " cut in pieces, and their houses shall be made a dunghill. Why? Because there is no"
    },
    {
      "id": 44,
      "start": 2662.800048828125,
      "end": 2672.3600463867188,
      "text": " other God that can deliver after this sort. God was glorified. Then the king"
    },
    {
      "id": 45,
      "start": 2672.3600463867188,
      "end": 2676.760040283203,
      "text": " promoted Shadrach, Meshach, and Abednego in the province of Babylon. God was"
    },
    {
      "id": 46,
      "start": 2676.760040283203,
      "end": 2682.6400451660156,
      "text": " glorified. You know, it's interesting to me. We think about the consequences. You"
    },
    {
      "id": 47,
      "start": 2682.6400451660156,
      "end": 2690.1600341796875,
      "text": " know, it's been some 2,600 years since this event took place, and we're still"
    },
    {
      "id": 48,
      "start": 2690.1600341796875,
      "end": 2698.8400268554688,
      "text": " talking about it. 2,600 years. That's a long time, and we're still receiving"
    },
    {
      "id": 49,
      "start": 2698.8400268554688,
      "end": 2705.080047607422,
      "text": " encouragement from some individuals that were willing to stand. They're willing to"
    },
    {
      "id": 50,
      "start": 2705.080047607422,
      "end": 2713.9200439453125,
      "text": " stand. They just simply said, listen, I can't do this. I cannot be influenced by"
    },
    {
      "id": 51,
      "start": 2713.9200439453125,
      "end": 2721.9200439453125,
      "text": " your ideologies. I will not bow. I will not conform because I have a higher"
    },
    {
      "id": 52,
      "start": 2721.9200439453125,
      "end": 2730.0400390625,
      "text": " authority. I have a higher authority, the highest authority, and one day I'm gonna"
    },
    {
      "id": 53,
      "start": 2730.1200256347656,
      "end": 2737.4800415039062,
      "text": " stand before him. So are you. The question, however, as we think about this event, we"
    },
    {
      "id": 54,
      "start": 2737.4800415039062,
      "end": 2745.3600463867188,
      "text": " think about the title of the message this morning, are you willing to stand?"
    },
    {
      "id": 55,
      "start": 2745.3600463867188,
      "end": 2758.3600463867188,
      "text": " Am I willing to stand? Can I fill you in? It's easy to stand in here. It is. You"
    },
    {
      "id": 56,
      "start": 2758.3600463867188,
      "end": 2764.520050048828,
      "text": " take a stand in here, man, we cheer you on. Amen! But we got to be willing to"
    },
    {
      "id": 57,
      "start": 2764.520050048828,
      "end": 2773.9600219726562,
      "text": " stand out there. Out there. In a lost and dying world, they need to see that our"
    },
    {
      "id": 58,
      "start": 2773.9600219726562,
      "end": 2782.800048828125,
      "text": " God is real. It's not just a theory. You know, they don't think much of our God."
    },
    {
      "id": 59,
      "start": 2782.9200439453125,
      "end": 2790.8400268554688,
      "text": " They really don't. They curse him. They hold their fist against him. They need to"
    },
    {
      "id": 60,
      "start": 2790.8400268554688,
      "end": 2795.6800231933594,
      "text": " see that our God is real. Do you believe this morning that God is still able to"
    },
    {
      "id": 61,
      "start": 2795.6800231933594,
      "end": 2801.6800231933594,
      "text": " work? I don't know that there's gonna be a burning fiery furnace. Again, the"
    },
    {
      "id": 62,
      "start": 2801.6800231933594,
      "end": 2805.9200439453125,
      "text": " circumstances, the pressures are different for every generation, but we're"
    },
    {
      "id": 63,
      "start": 2805.9200439453125,
      "end": 2811.1600341796875,
      "text": " facing some pressures today, and there's a movement today to cause you and to"
    },
    {
      "id": 64,
      "start": 2811.1600341796875,
      "end": 2816.760040283203,
      "text": " cause me to bow, to conform, to we can't talk about this, we can't talk about"
    },
    {
      "id": 65,
      "start": 2816.760040283203,
      "end": 2824.8800354003906,
      "text": " that, we can't go there, we can't go here. And they want a silence. They want us to"
    },
    {
      "id": 66,
      "start": 2824.8800354003906,
      "end": 2827.7200317382812,
      "text": " be ashamed. I've said that a couple of times the last few weeks because of our"
    },
    {
      "id": 67,
      "start": 2827.7200317382812,
      "end": 2834.4800415039062,
      "text": " theme for our missions conference. I am not ashamed. And this morning, are we"
    },
    {
      "id": 68,
      "start": 2834.4800415039062,
      "end": 2843.2400512695312,
      "text": " willing to stand? Are we willing to stand? I'm encouraged by Daniel 3, but"
    },
    {
      "id": 69,
      "start": 2843.2400512695312,
      "end": 2848.1200256347656,
      "text": " really more than being encouraged, I'm challenged. Because I look at these three"
    },
    {
      "id": 70,
      "start": 2848.1200256347656,
      "end": 2854.6000366210938,
      "text": " guys, they didn't have all that we have. We got the whole book, but they had a"
    },
    {
      "id": 71,
      "start": 2854.6000366210938,
      "end": 2861.000030517578,
      "text": " real close walk with God that caused them to have some some strength and some"
    },
    {
      "id": 72,
      "start": 2861.000030517578,
      "end": 2870.4000244140625,
      "text": " resolve spiritually to say, I understand the stakes. I heard the command. Yes, I"
    },
    {
      "id": 73,
      "start": 2870.4000244140625,
      "end": 2876.9600219726562,
      "text": " heard the music, but I'm not gonna bow. It's not gonna do it. Are you willing to"
    },
    {
      "id": 74,
      "start": 2876.9600219726562,
      "end": 2883.4400329589844,
      "text": " stand? Let's pray. Father, we love you. We thank you for loving us. Thank you for"
    },
    {
      "id": 75,
      "start": 2883.4400329589844,
      "end": 2892.6000366210938,
      "text": " your Word. I thank you how that we can go to your Word and be encouraged, and at"
    },
    {
      "id": 76,
      "start": 2892.6000366210938,
      "end": 2898.8800354003906,
      "text": " the same time be challenged. I thank you for the challenge that Paul gives the"
    },
    {
      "id": 77,
      "start": 2898.8800354003906,
      "end": 2905.0400390625,
      "text": " believers in Ephesus, and how that we can look at this event that happened 2,600"
    },
    {
      "id": 78,
      "start": 2905.0400390625,
      "end": 2915.1200256347656,
      "text": " years ago, and see some men that stood. We understand and acknowledge readily"
    },
    {
      "id": 79,
      "start": 2915.1200256347656,
      "end": 2921.2000122070312,
      "text": " this morning that we're facing pressures in our society, in our culture, to bow"
    },
    {
      "id": 80,
      "start": 2921.2000122070312,
      "end": 2926.9600219726562,
      "text": " and to conform to the ideologies. God, I pray that you would help us to walk in"
    },
    {
      "id": 81,
      "start": 2926.9600219726562,
      "end": 2933.4000244140625,
      "text": " the Spirit. I pray that you'd help us to put on the armor, that we would be able"
    },
    {
      "id": 82,
      "start": 2933.4000244140625,
      "end": 2942.760009765625,
      "text": " to stand in the evil day. Would you help us this morning to let you have your"
    },
    {
      "id": 83,
      "start": 2942.760009765625,
      "end": 2951.9200439453125,
      "text": " will and way in our lives? Help us to truly yield ourselves to thee. We pray"
    },
    {
      "id": 84,
      "start": 2951.9200439453125,
      "end": 2955.8800659179688,
      "text": " that you'd be glorified through every decision, and we'll thank you for it."
    },
    {
      "id": 85,
      "start": 2955.8800659179688,
      "end": 2961.1600341796875,
      "text": " Would you stand with me? Heads are bowed, eyes are closed. It's our custom to have"
    },
    {
      "id": 86,
      "start": 2961.1600341796875,
      "end": 2965.0800170898438,
      "text": " an invitation at the end of our service in order to give you an opportunity to"
    },
    {
      "id": 87,
      "start": 2965.0800170898438,
      "end": 2969.4800415039062,
      "text": " respond to how God may have spoken to you through His Word. Kimberly will play"
    },
    {
      "id": 88,
      "start": 2969.4800415039062,
      "end": 2974.0800170898438,
      "text": " quietly on the piano. As she does, the altar is open. You don't want to come to this"
    },
    {
      "id": 89,
      "start": 2974.0800170898438,
      "end": 2978.1600341796875,
      "text": " old-fashioned altar. Maybe you want to make your seat an altar, but would"
    },
    {
      "id": 90,
      "start": 2978.1600341796875,
      "end": 2984.52001953125,
      "text": " you let God have His way in your life? As Kimberly plays, the altar is open."
    }
  ],
  "processed_at": "2025-04-17T05:52:35.625855"
}