{
  "video_id": "L3JbLyIPp5M",
  "text": "this morning, we're just looking at the first two verses, the verses that we sang this morning for our theme song and the song that, the psalm that is the, of course, source of our theme for this year. And this will be an introductory lesson message, if you will. And each year, the Lord has given me the opportunity and privilege to serve as the pastor here at Fellowship Baptist Church. I have sought Him with regard to an annual theme. It helps me and I believe it helps our church to have an annual theme. And there've been many years that the annual theme has been from a particular book of the Bible, as was the case last year. And walking in the light and I preached through the book of 1 John on Sunday mornings and went through the entire book. There've been other years that will be more like this year where it's more of a topical theme and great is the Lord will be a topical theme. I won't spend the entire year in Psalm 48 and there will be more of a topical theme throughout the year with various messages. I'll get into some of that here in just a moment, but let me just quickly review for you. In 2012, I came here in 2011, the Lord brought us in August of 2011. So the first year that we had a church theme was in 2012. And we had as our theme that year, standing on His promises. And I'm so thankful for the promises of God's word. And of course, that was a topical series where we looked at just a number of promises that are throughout the word of God and how we can rejoice in them. They're exceeding great and precious promises. In 2013, I preached from the book of Esther. Our theme was for such a time as this. And what a relevant truth from the Old Testament book of Esther and God would still use us. And we're so thankful that He used Esther and He would use us. In 2014 was the book of John, he must increase. And what a joy to be reminded of that truth in John three, where John the Baptist said he must increase, I must decrease. And we worked throughout the book of John there in 2014. In 2015 and 2016, I preached to the book of Acts. And 2015 was the first half of the book, the first 12 chapters, and it was boldness to speak thy word. And how we see the early church moving and working and following the Lord and they had faced persecution and threat and they prayed, not that God would remove the persecution, not that God would punish the persecutors, but they prayed that God would grant them boldness to speak His word. And what a great prayer. And we see that God answered that prayer and God gave them boldness and God used them mightily. The Bible says that they filled Jerusalem with their doctrine. The Bible says that they turned the world upside down and what a blessing to see the word of God spread. And then in 2016, we finished the book of Acts chapters 13 through 28 and dealt with the statement that Paul made in Acts 27. I believe God and how important it is that we have faith in God, that we believe what God says in the midst of that great storm and all that was taking place and all hope that they should be saved was gone. I mean, they're not seeing the sun or the stars and moon for days and all hope was gone. And the Lord sent an angel and spoke to Paul and Paul stands up with great confidence and says, I believe God, that it's going to be just as He said it's going to be and what a blessing to see the faith and finish the book of Acts that year. 2017, increase our faith. And as we dealt with that theme, we dealt with as we study the word of God, what in God's word increases our faith? So then faith come with my hearing and hearing by the word of God. And so we know that God uses His word to increase our faith and so throughout the year, we looked at what I referred to as faith builders and we looked at how God would take people and He would use them and I'm reminded specifically of Gideon. Remember when God first comes to Gideon and thou mighty man of valor and Gideon's kind of like, who's he talking to, right? And God had to give him some faith builders and God blessed and God developed his faith and God increases our faith. And throughout that year, we talked about the fact that if faith is a flower, then doubt is a weed and we must get the doubt away. We must trust God, we must have faith. In 2018, count your blessings. And my goal in that year was to follow the truth of Psalm 150, that everything that hath breath, that we're to praise the Lord, praise ye the Lord. And as we count our blessings, name them one by one and we will rejoice. As you study Psalm 150, you'll find that the Psalm speaks about praising God for his excellent greatness and then also praising God for his mighty acts. And we understand as we went throughout 2018 with that theme of count your blessings that when we learn to rejoice in who God is, we learn to give thanks for who He is, that we will never lack reason to rejoice. Why? God never changes. He's the same yesterday and today and forever. And so we can sing and we can rejoice that God is holy. The psalmist, in fact, says that we're to give thanks at the remembrance of His holiness and we can thank God. Listen, our life, things can seem to be falling apart, turmoil all around us, but we can rejoice in who God is and His person and He's revealed it to us in His word that He has a plan, He has a purpose and how thankful I am. And of course, we are to thank God for the things that He does, but we need to learn to thank God for who He is. In 2019, the book of Ephesians, be strong in the Lord and the power of His might and how important it is that we put on the whole armor of God. We understand that we're engaged in battle. We mentioned in 2019 how there were so many comments that were going on with regard to various things taking place in our world and cultural warfare was something that was spoken often in that particular time. And I mentioned that we're really, we are engaged in spiritual warfare and we must understand that, we must acknowledge that and we understand that our weapons are not carnal, right? Our weapons are spiritual and we dealt with be strong in the Lord. 2020, what a, thank God for His wisdom. I never could have known what was gonna happen in 2020 and it was about October 5th or so of 2019 that God led me to have as our theme in 2020, looking unto Jesus and to preach to the book of Hebrews. And we had little understanding of all that we were gonna deal with in 2020, but how God just guided and helped us to understand how we need to keep our eyes on the author and finisher of our faith. And what a great book, the book of Hebrews. 2021, complete in Christ, the book of Colossians. And I'm so thankful that who I am in Christ is the most important thing. We talk about who we are and what our identity is and so on and so forth. First and foremost, we must understand that I am a Christian, I am a believer, I'm a follower of Jesus Christ. And what a blessing to know the Lord. And then of course, last year, 2022, walking in the light, the book of 1 John. As we deal with this subject of great is the Lord, I believe that having a theme helps me, but also helps our church remain focused throughout the year. I seek to follow the leadership of the Lord and there are certain times, of course, when I do not preach on the particular theme or through the particular book or a topic that isn't aligned with the theme as God would give that leadership. But it really helps with keeping that focus. And this year, my desire, and I hope it will be our desire and we'll see the result of it, is that we will focus on the greatness of our God. The word great means to be chief, to have vast power and excellence, to be supreme. And we understand that our God is supreme. Our God is great and the Bible declares His greatness throughout the pages of scripture. And as we begin to think about the sermon series that we'll have here on Sunday mornings, really my desire is to have two parts, if you will. And it's not gonna be 50-50, it's not gonna be the first half of the year and the second half of the year. It's probably gonna be more like 1 3rd and 2 3rds, but we'll see how it goes as we get through the year. But really the first focus or emphasis is going to be this, recognizing His greatness. That we recognize that our God is great. You see, what leads us to say God is great? What is it, what is the, if you say to someone, my God is great, and they say, why do you say that? What answers do we have? How is it that we would respond to that inquiry that someone would make? And so we must recognize His greatness through the pages of scripture. And then the next section, if you will, the next part of the sermon series will be dealing with responding to His greatness. So once I recognize that God is great, what is my response to that? How do I respond to this understanding of how great my God is? And we find this morning that when I see Him in all of His greatness, when I see Him for who He really is, that it will lead me, it should lead me to stand in awe of Him. And as I stand in awe of Him and I am understanding His greatness, that will then lead us to seek and desire to tell others about how great our God is. Because truly, we have a great God. And there's a world that does not, they are unaware of the truth this morning that I'm speaking of, the truth that so many of us take for granted that we know. If you came in here this morning before you saw anything with regard to our theme, and I said to you, is God great? I am just absolutely convinced in my mind that each and every one of you. would have said, yes, God is great, we believe that this morning. But I want to dive deeper into that truth and I want to help myself and help you this morning to respond properly to that greatness of God. And as we think about the message this morning here from Psalm 48, really, it's just going to serve really as an introduction to our theme and I trust that we, each of us, will be eager to behold His greatness. In Psalm 48, in verse number one, the Bible says, great is the Lord. I mean, what a proclamation. What a way to just start the Psalm. Great is the Lord. And it says this, and greatly to be praised. Man, we ought to praise Him greatly. Why? Because He's great. He is worthy of our praise. In the city of our God, in the mountain of His holiness, beautiful for situation, the joy of the whole earth is Mount Zion, on the sides of the north, the city of the great King. This morning, if you're taking notes, number one, recognize His greatness. Recognize His greatness. Here, we find that the psalmist, it's a psalm that is here that would, no doubt, have been sang often. And you think about the declaration as we start, and really, throughout the Bible, there are many verses of scripture that we will look at throughout the year that simply declare the greatness of the Lord. Psalms like this that just start with that great statement, great is the Lord. And we think about the recognition of His greatness and understand the Bible declares His greatness in His word. Notice, if you will, what the psalmist says over in Psalm 135. And I want you to see what the psalmist says with regard to the greatness of God. And when we think about this truth this morning, when we're confronted with this and recognizing His greatness, I trust that each of us would be able to say with the psalmist what is declared here in Psalm 135. Notice in verse number one, the Bible says, praise ye the Lord. Praise ye the name of the Lord. Praise Him, O ye servants of the Lord. You think there's an emphasis on praise? We find, it says in verse two, ye that stand in the house of the Lord, in the courts of the house of our God. Praise the Lord, for the Lord is good. Sing praises unto His name, for it is pleasant. For the Lord hath chosen Jacob unto Himself, and Israel for His peculiar treasure. Notice in verse number five what the psalmist says, for I know that the Lord is great, and that our Lord is above all gods. Isn't that a wonderful statement of the psalmist in Psalm 135 in verse number five? Listen, he doesn't say, I think the Lord is great. He's saying, he's declaring with great confidence that I know that the Lord is great. And how does that greatness, how does that understanding that the psalmist have, how would it impact his life? How should it impact our lives when we understand how great our God is? Listen, this morning I think when we understand how great God is, it's going to have an impact on our prayer life. Why? Because he's able to do exceeding abundantly above all that we ask or think, because he is a great God that has all power and all ability, and so understanding, having the knowledge of the greatness of God will impact our prayer life. It's going to impact the way that we witness, it's going to impact the way that we live, it's going to impact the way that we praise Him. And we see this morning that the psalmist says, I know that the Lord is great. It's interesting as you think about Moses making this statement in the book of Deuteronomy in chapter number three, if you would turn over and notice what the word of God says here with regard to the testimony that is recorded in Deuteronomy chapter number three. Now understand that as we would look at the word of God and seek to recognize His greatness, that He has declared His greatness in His word, but I'm also thankful that He has demonstrated His greatness. You know, it's one thing to declare something, but it's quite another thing to demonstrate something. And we find this morning that as we study the word of God, just as the case with so many attributes, God declares, but then also demonstrates. We speak of God being love. Well, God declared His love, for God so loved the world, but then He demonstrated His love that He gave His only begotten son. And we find that throughout the word of God, as we understand, He declares His holiness, but then He demonstrates that He's holy. And we think about this truth of His greatness, and we think about Moses and this particular timing of the book of Deuteronomy, preparation for the children of Israel to enter into the land. And we come to verse number 22 of chapter three, and the Bible says, you shall not fear them, for the Lord your God, He shall fight for you. And I besought the Lord at that time, saying, notice what he says, O Lord God, thou hast begun to show thy servant thy greatness in thy mighty hand. Now, pause just for a moment. What had Moses seen God do? Ha! I mean, Moses had witnessed the power of God, the greatness of God over and over. We see God working on the behalf of the children of Israel. We see, of course, the exodus from the Egyptian bondage and all that takes place, and God showing His greatness through the plagues. I mean, Moses witnessed those things firsthand. He had the opportunity, a front row seat, so to speak, to see God's greatness being demonstrated. We find that after they had crossed over the Red Sea, they sang this morning about, He took them through the sea. And you think about standing there at the edge of the Red Sea and the Egyptians following in hot pursuit, ready to destroy and overcome. We find that God said, hey, you're going to go through and raise up that rod, and God parted the Red Sea. They get to the other side, and then God closes the Red Sea on the Egyptians, who were saved to go over as well. We find that they get into the land, and they're worshiping there. After they had crossed over the Red Sea, and they're worshiping the Lord, and they're praising God, but then there's no water. It's bitter water. It's not drinkable. And they begin to complain, and God works, and He tells them to take this timber, this tree, and to put in the water, and He heals the waters. And then there's no water, and God says, I'll give you water from the rock. And then there's no food, and He gives manna from, I mean, we could go on and on. We see the power of God, the greatness of God being demonstrated in the life of Moses. But notice what Moses says, thou hast begun to show thy servant thy greatness, and thy mighty hand. As much as Moses had experienced, it was just the start of God showing how great He really is. That's amazing to me, because as I read all of those things, and I study all of those things, I'm looking, I'm saying, man, look at how great our God is. Look at what He's capable of doing, and this is increasing my faith. This is encouraging my walk with God, and I am so thankful. But Moses says, it's just the start. That's how great our God is. We find that in chapter 5, notice what the Bible says in verse number 24. Deuteronomy 5, in verse number 24, Moses, in chapter 5, He called all Israel together, and He began to give them some instruction, and to help them as He does throughout the book. It says in verse number 24, And ye said, Behold, the Lord our God hath showed us His glory and His greatness. We have heard His voice out of the midst of the fire. We have seen this day that God doth talk with man, and He liveth. And I'm so thankful that God would not only declare His greatness, but demonstrate His greatness. As we begin to think about the greatness of God, and recognizing His greatness, and I know I've said this in the past, but it's so worthy of repeating in this particular message that we have the truth of God's greatness. And the psalmist in Psalm 135 said, I know that the Lord is great. Moses said, You've just begun to show us how great you really are. And the psalmist says, and you don't need to turn there, but in Psalm 145, we'll be there in just a little while, but in Psalm 145, the Bible says, Great is the Lord, and greatly to be praised. And then it says this, His greatness is unsearchable, because we cannot fully comprehend how great our God is. This morning, if we were to take some time individually, and for each of us to try to, in our own terms, express how great we think God is, and some would stand, perhaps, and wax eloquent and speak about how great they understand God to be. And as we go through the room and let each individual person say this morning, and try to articulate and express from their own heart and their own mind, this is how great God is. This is why I can say that God is great for each and every one of us. It's more. It exceeds. It's higher, because we cannot fully understand how great our God is. And this morning, we need to recognize His greatness. The psalmist begins, Great is the Lord. Not only do we recognize His greatness, number two, we rejoice. in His greatness. Great is the Lord, and greatly to be praised. Listen, this morning, when we understand, when we recognize how great He is, we ought to rejoice. That should be our response. This great God, as we look in Psalm 48, the end of the chapter in v. 14, after it goes through all of these statements with regard to our God being a refuge and so on and so forth, He tells us in v. 14, for this God is our God, forever and ever. He will be our guide even unto death. Now think about that truth. I know there's some millennial prophecies with regard to Psalm 48. I understand that as you study the beginning of the chapter in particular. But listen, after I'm in the millennium, there's no death for me. Amen? And it says He's going to be our guide even unto death. This God is our God, forever and ever. I'm thankful that He's gonna guide me until I take my final breath here upon this earth, and then I'm gonna be with Him. To be absent from the body is to be present with the Lord. And yes, He has a plan. There's going to be all those things that happen during the tribulation, the millennial reign, but then forever and ever, He's my God. This great God that has revealed to us, that has declared to us His greatness in His word, He's demonstrated it, not only in the pages of scripture, but I would say this morning, that He's demonstrated His greatness in our lives. And as we think about His greatness, and then we respond to that with rejoicing, because this God is my God. I'm always encouraged of how personal God is. You know, there's almost eight billion people on earth today. That's a lot of people. But God is a personal God. I mean, I study the pages of scripture. You begin to see how that, especially we study the miracles in our adult Sunday school class for almost, or the family Sunday school class for almost a year, and how often when we study the life of Christ and study those miracles, you will read where the Bible talks about the multitudes, but then there's a certain man, there's a certain woman, and there's a multitude of people, but God's attention is focused on the individual. And this morning, I'm so thankful that God is a personal God. You think about the nature and character of God that He can listen to each and every one of us at the same time. We just all prayed earlier this morning. We've been doing that for almost a year now, before every one of our services, except for Wednesday night, because prayer's at the end on Wednesday night, but I was convicted almost a year ago that prayer has become bookends in our services. God, would you bless? God, thank you for blessing. And we have made an effort to specifically take time as a church family to pray about the service and what God would do in our hearts. And as I am praying with Dean on Sunday mornings here and with Holly on Sunday evenings here, I can hear the mumbling of people praying. I have no idea what you're saying, but God does. You have needs in your heart that you're expressing to God, and God hears you. God knows. He is a personal God, and this God is our God, and I'm so thankful. As I begin to think about that rejoicing in the Lord, great is the Lord and greatly to be praised. Look at Psalm 145. I told you we'd be there in just a moment. Look at what the Bible says here in the first three verses. When we think about this rejoicing, because of the understanding that we have that he is great. In Psalm 145, beginning in verse number one, notice what the psalmist says. I will extol thee. Do you see the determined commitment that the psalmist has that this is something that I'm going to do because of what I understand? He's going to speak about the greatness of God in verse number three, but you understand that he's saying this is what I'm going to do. I'm going to rejoice. I will extol thee, my God, O King, and I will bless thy name forever and ever. If I could just for a moment go back to what I said with regard to verse 14 of Psalm 48, that he's my God now, but he's my God forever and ever. Listen, we will praise him forever in eternity. We ought to start praising him now. Preparation for eternity. Learning to praise God. Because we're going to praise him forever. And you notice the commitment, the determined statement of the psalmist. Notice what he says in verse number two. Every day will I bless thee, and I will praise thy name forever and ever. Is that because David's always going to have good days? Is that because David says, listen, everything's always going to be great because God is my God, and so I'm going to praise him every day because he's just going to give me this perfect life without any problems, no issues, no. No, you read the life of David. He had plenty of problems. Plenty of difficulty and adversity. But he's making this determination, why? Because he understands how great God is. Great is the Lord and greatly to be praised. I'm going to rejoice in his greatness. And he says, every day will I bless thee. Great is the Lord, verse number three, and greatly to be praised. And his greatness is unsearchable. This morning, we think about all the things going on in our world. There's a lot of stuff going on in our world. A lot of crazy stuff going on in our world. God is great. God is great. We cannot lose focus of that fundamental truth though all the world, Brother Mershon has said it for years. I've heard him say it for years. I talked to him the other night. He said it again. Collectively, we're losing our minds as a world. We really are. But God is great. He's still on his throne. The Lord God omnipotent reigneth. He makes no mistakes. Though the heathen rage and they devise plans, God laughs. He has all power. He's in control. This morning, when the psalmist says, I'm going to rejoice because I understand how great you are, it's not because he's expecting there'll be no problems in his life. It's because he understands that even in the midst of those problems, in the midst of turmoil, God is still great. I said this last week, two weeks ago, I think. It's worth repeating. You know, the world deals with problems as well. Man that is born of woman, few days and full of trouble. We got problems. Amen? But you understand as a believer, as a child of God, your outlook when you have those difficulties is greatly different than the outlook of the world if you understand the Bible. Because when you face that difficulty, you understand that God's allowed it. Right? God has a plan. He is in control. And we understand that he's, listen, he's a sovereign God. He's in control of all things. Whatever he's allowed in my life, he's permitted it, he's allowed it, and not only has he allowed it, but he has a purpose in it. And that purpose may be to develop me. That purpose, no doubt, is to glorify him. But God has a purpose in it. So we begin to live life and we deal with those. Listen, the world doesn't understand those concepts. The world doesn't understand that there's a God who loves them, that has a plan in it, that has allowed it, that is seeking to develop them, to grow them, and to glorify himself. But we, because we have this precious book, we understand that. And we can say with Joseph, ye meant it unto evil, but God meant it unto good. Because God is sovereign and God has a plan. You know, there are times in which we can look at some examples of God delivering and then we look at some other situations and say, I wonder why God didn't or doesn't heal that person or change this circumstance. Because God is going to use it to bring glory to himself in a manner in which is far beyond what would happen if he just dealt with the problem. I was thinking this morning as I was teaching the lesson in Sunday school and I kind of ran out of time, but we dealt with the miracle there in Acts 3. You know, Acts 3 is recorded to take place just 40 some days after the Lord Jesus Christ ascended or was crucified. He ascends to heaven 40 days later and then they're there and they wait for the filling of the spirit, so on and so forth. So Acts 3 is happening just a short time after the life and ministry of the Lord Jesus Christ. This man was above 40 years old. He was lame from his mother's womb and they laid him daily at the gate beautiful. You think Jesus ever went by him? I think he probably did. But Jesus never healed him. Why? He healed a lot of people. But He never healed that man. Maybe because He was going to allow it to happen when it did, because 5,000 people were going to get saved as a result. Listen, I'm not saying I know the mind of God, specifically as to why, but God did say, let this mind be in you which is also in Christ Jesus, and we have the Word of God. I'm not trying to pretend this morning that I know exactly why God did or didn't heal that man. I'm just suggesting to you that when we read the whole of Scripture and we see what's happening, that there was a result because of what happened in Acts 3 that perhaps would not have happened if Jesus would have just healed him on his way in one day. Our God, listen, He makes no mistakes. His timing is not always our timing. His ways are not our ways. His thoughts are not our thoughts. He far exceeds us. He transcends us. We recognize His greatness. We rejoice in His greatness. Number three, we report His greatness. We report His greatness. We tell others. We desire to report, to proclaim, to declare the greatness of God. We live, I mentioned by way of introduction, that we live in the midst of a generation that are simply unaware of how great our God is. They have these weird twisted ideas of who God is. They have this idea that is given to them by this culture that we live in, this worldview, these things that are going around you. Obviously, you have people groups within our nation and around the world that would claim to be atheists. They deny entirely the existence of God, and you have others that have these weird ideas about who God is, but God has given us His word, and He's told us, He's revealed to us in the pages of Scripture who He is. We don't rely on the Department of Education. We don't rely on any other department of the government. We don't rely on Hollywood or any other group of people to reveal to us who God is. God has already revealed it to us. For that, I am thankful, by the way, because not your idea of who God is versus your idea of who God is and your idea and your idea, and then let's get together and kind of figure out, well, which one makes, which one do we like the most? No, God said, this is who I am. And see, this morning, we need to report. We need to tell others about how great our God is. Notice what the psalmist continues to say in Psalm 145. He said this, and His greatness is unsearchable. He's obviously acknowledged the understanding that God is great because he says in verse 3, great is the Lord and greatly to be praised. Notice in verse number 4, one generation shall praise thy works to another and shall declare thy mighty acts. Similar to what we read in Psalm 78, that generational influence and the opportunity that we have to impact a future generation with regard to who God is, and we shall praise whose works, the works of God. We shall declare His mighty acts. Notice verse 5. Notice what the psalmist says. I will speak of the glorious honor of thy majesty and of thy wondrous works. You know, we need to talk about God. It used to be a little song, I don't know, I haven't heard it in years, let's talk about Jesus. We start talking about Jesus and start talking about who He is and what He's done and how He's worked and so on and so forth, and He says, I'm going to speak. I will speak of the glorious honor of thy majesty and of thy wondrous works and men shall speak of the might of thy terrible acts. Notice what He says, I will declare thy greatness. Isn't that a great statement? It's a statement of commitment. It's a statement of determination. I will declare thy greatness. He doesn't put any type of parameters on it with regard to, I will declare thy greatness so long as they want to hear it. I will declare thy greatness if they ask me. I will declare, no, no, there's no parameter. He just says, I will declare thy greatness. Why? Because it was in Him. He knew. The psalmist knew how great God was, is, and says, I'm going to declare thy greatness. Why? Because there's another generation that's coming up that needs to know how great God is and there's a generation that's going to follow them and a generation that's going to follow them. And if we don't declare His greatness, listen, the humanistic worldview is that they want to deny God so that in a generation or two there will be no more Christianity. I've read those quotes to you before from this pulpit. That's their idea. That's their worldview. That's their goal. So should not we as the people of God that know how great He is say with David, I will declare thy greatness. You say, pastor, you know that it's 2023, you know that we live in the midst of people that don't want to hear it. God's great. You ever experienced something that's so great that you just can't help but talk about it? Ribs. Amen. Some of y'all are hungry already, amen. I mean, you get a good something to eat somewhere, a good whatever, Mark's ready for some ribs evidently because he said ribs, but you tell somebody about, let me tell you about this meal I had, let me tell you about this experience I had, let me tell you about this place, whatever it might be. Listen, none of that even pales in comparison to how great our God is. I mean, that's a temporary meal that's going to satisfy you for just a little while and then you're going to have to eat again, right? Taste and see that the Lord is good, that's what David says, he says the Lord is great. This morning, I hope that throughout this year that we are so consumed with how great our God is that we recognize His greatness and then we respond to His greatness by praising Him and by telling others about Him because it's just so in me of how great my God is that I just have to tell somebody about how great He is. This morning, great is the Lord and greatly to be praised. I'm so thankful that God has revealed to us, He's declared it in His Word, but He's demonstrating His Word, He's demonstrating it in our own lives. This morning, we need to rejoice and then we need to report how great our God is. Let's pray together. Father, we love You. We thank You for loving us. How we thank You for the Word of God. We thank You that You're a great God. There's none like You. I pray that this year, I pray that this morning in this message that we've been encouraged about how great You are. I pray that we've been challenged to let somebody else know about how great You are. We thank You for Your great salvation. It's available through the Lord Jesus Christ, the only way for man to be saved. Lord, if there's one here that's not sure of heaven, I pray that today they'd understand their need for Christ. I pray they'd be saved before they leave this place, before they tune off of live stream. Lord, I pray for every child of God that we'd have a renewed view of just how great You are, that we'd have a determined commitment to declare Your greatness, to praise You for who You are, to talk by glorious power, by mighty acts. Lord, I pray that in these moments of invitation, as we have opportunity to respond to how Your Spirit has spoken to us through Your Word, I pray, God, that decisions would be made that would endure, that would cause us to be conformed to the image of Christ to impact eternity. Move and work as only You can, and we'll give You the honor and glory for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.640000104904175,
      "text": " this morning, we're just looking at the first two verses,"
    },
    {
      "id": 1,
      "start": 2.640000104904175,
      "end": 6.320000171661377,
      "text": " the verses that we sang this morning for our theme song"
    },
    {
      "id": 2,
      "start": 6.320000171661377,
      "end": 11.119999885559082,
      "text": " and the song that, the psalm that is the, of course,"
    },
    {
      "id": 3,
      "start": 11.119999885559082,
      "end": 13.479999542236328,
      "text": " source of our theme for this year."
    },
    {
      "id": 4,
      "start": 13.479999542236328,
      "end": 16.440000534057617,
      "text": " And this will be an introductory lesson message,"
    },
    {
      "id": 5,
      "start": 16.440000534057617,
      "end": 17.280000686645508,
      "text": " if you will."
    },
    {
      "id": 6,
      "start": 17.280000686645508,
      "end": 20.040000915527344,
      "text": " And each year, the Lord has given me the opportunity"
    },
    {
      "id": 7,
      "start": 20.040000915527344,
      "end": 22.200000762939453,
      "text": " and privilege to serve as the pastor here"
    },
    {
      "id": 8,
      "start": 22.200000762939453,
      "end": 23.360000610351562,
      "text": " at Fellowship Baptist Church."
    },
    {
      "id": 9,
      "start": 23.360000610351562,
      "end": 27.260000228881836,
      "text": " I have sought Him with regard to an annual theme."
    },
    {
      "id": 10,
      "start": 27.260000228881836,
      "end": 30.059999465942383,
      "text": " It helps me and I believe it helps our church"
    },
    {
      "id": 11,
      "start": 30.059999465942383,
      "end": 31.760000228881836,
      "text": " to have an annual theme."
    },
    {
      "id": 12,
      "start": 31.760000228881836,
      "end": 34.20000076293945,
      "text": " And there've been many years that the annual theme"
    },
    {
      "id": 13,
      "start": 34.20000076293945,
      "end": 36.58000183105469,
      "text": " has been from a particular book of the Bible,"
    },
    {
      "id": 14,
      "start": 36.58000183105469,
      "end": 38.41999816894531,
      "text": " as was the case last year."
    },
    {
      "id": 15,
      "start": 38.41999816894531,
      "end": 40.939998626708984,
      "text": " And walking in the light and I preached through"
    },
    {
      "id": 16,
      "start": 40.939998626708984,
      "end": 43.5,
      "text": " the book of 1 John on Sunday mornings"
    },
    {
      "id": 17,
      "start": 43.5,
      "end": 46.29999923706055,
      "text": " and went through the entire book."
    },
    {
      "id": 18,
      "start": 46.29999923706055,
      "end": 48.540000915527344,
      "text": " There've been other years that will be more like this year"
    },
    {
      "id": 19,
      "start": 48.540000915527344,
      "end": 50.97999954223633,
      "text": " where it's more of a topical theme"
    },
    {
      "id": 20,
      "start": 50.97999954223633,
      "end": 53.7400016784668,
      "text": " and great is the Lord will be a topical theme."
    },
    {
      "id": 21,
      "start": 53.7400016784668,
      "end": 56.86000061035156,
      "text": " I won't spend the entire year in Psalm 48"
    },
    {
      "id": 22,
      "start": 57.41999816894531,
      "end": 59.220001220703125,
      "text": " and there will be more of a topical theme"
    },
    {
      "id": 23,
      "start": 59.220001220703125,
      "end": 61.380001068115234,
      "text": " throughout the year with various messages."
    },
    {
      "id": 24,
      "start": 61.380001068115234,
      "end": 63.02000045776367,
      "text": " I'll get into some of that here in just a moment,"
    },
    {
      "id": 25,
      "start": 63.02000045776367,
      "end": 65.13999938964844,
      "text": " but let me just quickly review for you."
    },
    {
      "id": 26,
      "start": 65.13999938964844,
      "end": 67.22000122070312,
      "text": " In 2012, I came here in 2011,"
    },
    {
      "id": 27,
      "start": 67.22000122070312,
      "end": 69.77999877929688,
      "text": " the Lord brought us in August of 2011."
    },
    {
      "id": 28,
      "start": 69.77999877929688,
      "end": 72.9000015258789,
      "text": " So the first year that we had a church theme was in 2012."
    },
    {
      "id": 29,
      "start": 72.9000015258789,
      "end": 75.05999755859375,
      "text": " And we had as our theme that year,"
    },
    {
      "id": 30,
      "start": 75.05999755859375,
      "end": 77.45999908447266,
      "text": " standing on His promises."
    },
    {
      "id": 31,
      "start": 77.45999908447266,
      "end": 80.33999633789062,
      "text": " And I'm so thankful for the promises of God's word."
    },
    {
      "id": 32,
      "start": 80.33999633789062,
      "end": 82.58000183105469,
      "text": " And of course, that was a topical series"
    },
    {
      "id": 33,
      "start": 82.58000183105469,
      "end": 84.54000091552734,
      "text": " where we looked at just a number of promises"
    },
    {
      "id": 34,
      "start": 84.54000091552734,
      "end": 85.81999969482422,
      "text": " that are throughout the word of God"
    },
    {
      "id": 35,
      "start": 85.81999969482422,
      "end": 88.26000213623047,
      "text": " and how we can rejoice in them."
    },
    {
      "id": 36,
      "start": 88.26000213623047,
      "end": 90.9000015258789,
      "text": " They're exceeding great and precious promises."
    },
    {
      "id": 37,
      "start": 90.9000015258789,
      "end": 94.18000030517578,
      "text": " In 2013, I preached from the book of Esther."
    },
    {
      "id": 38,
      "start": 94.18000030517578,
      "end": 96.9000015258789,
      "text": " Our theme was for such a time as this."
    },
    {
      "id": 39,
      "start": 96.9000015258789,
      "end": 99.54000091552734,
      "text": " And what a relevant truth from the Old Testament"
    },
    {
      "id": 40,
      "start": 99.54000091552734,
      "end": 102.73999786376953,
      "text": " book of Esther and God would still use us."
    },
    {
      "id": 41,
      "start": 102.73999786376953,
      "end": 104.62000274658203,
      "text": " And we're so thankful that He used Esther"
    },
    {
      "id": 42,
      "start": 104.62000274658203,
      "end": 105.5,
      "text": " and He would use us."
    },
    {
      "id": 43,
      "start": 105.5,
      "end": 109.73999786376953,
      "text": " In 2014 was the book of John, he must increase."
    },
    {
      "id": 44,
      "start": 109.73999786376953,
      "end": 113.94000244140625,
      "text": " And what a joy to be reminded of that truth in John three,"
    },
    {
      "id": 45,
      "start": 113.94000244140625,
      "end": 115.86000061035156,
      "text": " where John the Baptist said he must increase,"
    },
    {
      "id": 46,
      "start": 115.86000061035156,
      "end": 117.26000213623047,
      "text": " I must decrease."
    },
    {
      "id": 47,
      "start": 117.26000213623047,
      "end": 120.5,
      "text": " And we worked throughout the book of John there in 2014."
    },
    {
      "id": 48,
      "start": 120.5,
      "end": 123.26000213623047,
      "text": " In 2015 and 2016, I preached to the book of Acts."
    },
    {
      "id": 49,
      "start": 123.26000213623047,
      "end": 125.80000305175781,
      "text": " And 2015 was the first half of the book,"
    },
    {
      "id": 50,
      "start": 125.80000305175781,
      "end": 127.26000213623047,
      "text": " the first 12 chapters,"
    },
    {
      "id": 51,
      "start": 127.26000213623047,
      "end": 130.17999267578125,
      "text": " and it was boldness to speak thy word."
    },
    {
      "id": 52,
      "start": 130.17999267578125,
      "end": 133.5399932861328,
      "text": " And how we see the early church moving and working"
    },
    {
      "id": 53,
      "start": 133.5399932861328,
      "end": 137.13999938964844,
      "text": " and following the Lord and they had faced persecution"
    },
    {
      "id": 54,
      "start": 137.13999938964844,
      "end": 138.94000244140625,
      "text": " and threat and they prayed,"
    },
    {
      "id": 55,
      "start": 138.94000244140625,
      "end": 141.94000244140625,
      "text": " not that God would remove the persecution,"
    },
    {
      "id": 56,
      "start": 141.94000244140625,
      "end": 145.05999755859375,
      "text": " not that God would punish the persecutors,"
    },
    {
      "id": 57,
      "start": 145.05999755859375,
      "end": 149.13999938964844,
      "text": " but they prayed that God would grant them boldness"
    },
    {
      "id": 58,
      "start": 149.13999938964844,
      "end": 150.97999572753906,
      "text": " to speak His word."
    },
    {
      "id": 59,
      "start": 150.97999572753906,
      "end": 152.5,
      "text": " And what a great prayer."
    },
    {
      "id": 60,
      "start": 152.5,
      "end": 154.3000030517578,
      "text": " And we see that God answered that prayer"
    },
    {
      "id": 61,
      "start": 154.3000030517578,
      "end": 157.5800018310547,
      "text": " and God gave them boldness and God used them mightily."
    },
    {
      "id": 62,
      "start": 157.5800018310547,
      "end": 159.17999267578125,
      "text": " The Bible says that they filled Jerusalem"
    },
    {
      "id": 63,
      "start": 159.17999267578125,
      "end": 160.02000427246094,
      "text": " with their doctrine."
    },
    {
      "id": 64,
      "start": 160.02000427246094,
      "end": 162.89999389648438,
      "text": " The Bible says that they turned the world upside down"
    },
    {
      "id": 65,
      "start": 162.89999389648438,
      "end": 166.97999572753906,
      "text": " and what a blessing to see the word of God spread."
    },
    {
      "id": 66,
      "start": 166.97999572753906,
      "end": 169.5399932861328,
      "text": " And then in 2016, we finished the book of Acts"
    },
    {
      "id": 67,
      "start": 169.5399932861328,
      "end": 172.5800018310547,
      "text": " chapters 13 through 28 and dealt with the statement"
    },
    {
      "id": 68,
      "start": 172.5800018310547,
      "end": 174.3000030517578,
      "text": " that Paul made in Acts 27."
    },
    {
      "id": 69,
      "start": 174.3000030517578,
      "end": 176.94000244140625,
      "text": " I believe God and how important it is"
    },
    {
      "id": 70,
      "start": 176.94000244140625,
      "end": 178.05999755859375,
      "text": " that we have faith in God,"
    },
    {
      "id": 71,
      "start": 178.05999755859375,
      "end": 179.82000732421875,
      "text": " that we believe what God says"
    },
    {
      "id": 72,
      "start": 179.82000732421875,
      "end": 181.86000061035156,
      "text": " in the midst of that great storm"
    },
    {
      "id": 73,
      "start": 181.86000061035156,
      "end": 183.25999450683594,
      "text": " and all that was taking place"
    },
    {
      "id": 74,
      "start": 183.25999450683594,
      "end": 186.10000610351562,
      "text": " and all hope that they should be saved was gone."
    },
    {
      "id": 75,
      "start": 186.10000610351562,
      "end": 187.9600067138672,
      "text": " I mean, they're not seeing the sun or the stars"
    },
    {
      "id": 76,
      "start": 187.9600067138672,
      "end": 190.82000732421875,
      "text": " and moon for days and all hope was gone."
    },
    {
      "id": 77,
      "start": 190.82000732421875,
      "end": 193.5399932861328,
      "text": " And the Lord sent an angel and spoke to Paul"
    },
    {
      "id": 78,
      "start": 193.5399932861328,
      "end": 195.6999969482422,
      "text": " and Paul stands up with great confidence"
    },
    {
      "id": 79,
      "start": 195.74000549316406,
      "end": 199.5399932861328,
      "text": " and says, I believe God,"
    },
    {
      "id": 80,
      "start": 199.5399932861328,
      "end": 202.5800018310547,
      "text": " that it's going to be just as He said it's going to be"
    },
    {
      "id": 81,
      "start": 202.5800018310547,
      "end": 204.3000030517578,
      "text": " and what a blessing to see the faith"
    },
    {
      "id": 82,
      "start": 204.3000030517578,
      "end": 206.33999633789062,
      "text": " and finish the book of Acts that year."
    },
    {
      "id": 83,
      "start": 206.33999633789062,
      "end": 208.77999877929688,
      "text": " 2017, increase our faith."
    },
    {
      "id": 84,
      "start": 208.77999877929688,
      "end": 210.3800048828125,
      "text": " And as we dealt with that theme,"
    },
    {
      "id": 85,
      "start": 210.3800048828125,
      "end": 213.13999938964844,
      "text": " we dealt with as we study the word of God,"
    },
    {
      "id": 86,
      "start": 213.13999938964844,
      "end": 215.94000244140625,
      "text": " what in God's word increases our faith?"
    },
    {
      "id": 87,
      "start": 215.94000244140625,
      "end": 217.1999969482422,
      "text": " So then faith come with my hearing"
    },
    {
      "id": 88,
      "start": 217.1999969482422,
      "end": 218.77999877929688,
      "text": " and hearing by the word of God."
    },
    {
      "id": 89,
      "start": 218.77999877929688,
      "end": 221.66000366210938,
      "text": " And so we know that God uses His word to increase our faith"
    },
    {
      "id": 90,
      "start": 221.66000366210938,
      "end": 223.4600067138672,
      "text": " and so throughout the year,"
    },
    {
      "id": 91,
      "start": 223.4600067138672,
      "end": 227.44000244140625,
      "text": " we looked at what I referred to as faith builders"
    },
    {
      "id": 92,
      "start": 227.44000244140625,
      "end": 231.25999450683594,
      "text": " and we looked at how God would take people"
    },
    {
      "id": 93,
      "start": 231.25999450683594,
      "end": 232.86000061035156,
      "text": " and He would use them"
    },
    {
      "id": 94,
      "start": 232.86000061035156,
      "end": 235.5399932861328,
      "text": " and I'm reminded specifically of Gideon."
    },
    {
      "id": 95,
      "start": 235.5399932861328,
      "end": 237.97999572753906,
      "text": " Remember when God first comes to Gideon"
    },
    {
      "id": 96,
      "start": 237.97999572753906,
      "end": 240.33999633789062,
      "text": " and thou mighty man of valor"
    },
    {
      "id": 97,
      "start": 240.33999633789062,
      "end": 243.13999938964844,
      "text": " and Gideon's kind of like, who's he talking to, right?"
    },
    {
      "id": 98,
      "start": 243.13999938964844,
      "end": 246.6199951171875,
      "text": " And God had to give him some faith builders"
    },
    {
      "id": 99,
      "start": 246.6199951171875,
      "end": 250.5399932861328,
      "text": " and God blessed and God developed his faith"
    },
    {
      "id": 100,
      "start": 250.5399932861328,
      "end": 252.5399932861328,
      "text": " and God increases our faith."
    },
    {
      "id": 101,
      "start": 252.5399932861328,
      "end": 253.74000549316406,
      "text": " And throughout that year,"
    },
    {
      "id": 102,
      "start": 253.74000549316406,
      "end": 256.5400085449219,
      "text": " we talked about the fact that if faith is a flower,"
    },
    {
      "id": 103,
      "start": 256.5400085449219,
      "end": 259.5799865722656,
      "text": " then doubt is a weed and we must get the doubt away."
    },
    {
      "id": 104,
      "start": 259.5799865722656,
      "end": 262.2200012207031,
      "text": " We must trust God, we must have faith."
    },
    {
      "id": 105,
      "start": 262.2200012207031,
      "end": 264.5799865722656,
      "text": " In 2018, count your blessings."
    },
    {
      "id": 106,
      "start": 264.5799865722656,
      "end": 268.70001220703125,
      "text": " And my goal in that year was to follow the truth"
    },
    {
      "id": 107,
      "start": 268.70001220703125,
      "end": 271.8599853515625,
      "text": " of Psalm 150, that everything that hath breath,"
    },
    {
      "id": 108,
      "start": 271.8599853515625,
      "end": 274.9599914550781,
      "text": " that we're to praise the Lord, praise ye the Lord."
    },
    {
      "id": 109,
      "start": 274.9599914550781,
      "end": 278.1400146484375,
      "text": " And as we count our blessings, name them one by one"
    },
    {
      "id": 110,
      "start": 278.1400146484375,
      "end": 279.6600036621094,
      "text": " and we will rejoice."
    },
    {
      "id": 111,
      "start": 279.6600036621094,
      "end": 281.0199890136719,
      "text": " As you study Psalm 150,"
    },
    {
      "id": 112,
      "start": 281.0199890136719,
      "end": 283.94000244140625,
      "text": " you'll find that the Psalm speaks about praising God"
    },
    {
      "id": 113,
      "start": 283.94000244140625,
      "end": 286.1000061035156,
      "text": " for his excellent greatness"
    },
    {
      "id": 114,
      "start": 286.1000061035156,
      "end": 288.7799987792969,
      "text": " and then also praising God for his mighty acts."
    },
    {
      "id": 115,
      "start": 288.7799987792969,
      "end": 292.1000061035156,
      "text": " And we understand as we went throughout 2018"
    },
    {
      "id": 116,
      "start": 292.1000061035156,
      "end": 293.9800109863281,
      "text": " with that theme of count your blessings"
    },
    {
      "id": 117,
      "start": 293.9800109863281,
      "end": 298.5799865722656,
      "text": " that when we learn to rejoice in who God is,"
    },
    {
      "id": 118,
      "start": 298.5799865722656,
      "end": 301.739990234375,
      "text": " we learn to give thanks for who He is,"
    },
    {
      "id": 119,
      "start": 301.739990234375,
      "end": 304.5400085449219,
      "text": " that we will never lack reason to rejoice."
    },
    {
      "id": 120,
      "start": 304.5400085449219,
      "end": 305.55999755859375,
      "text": " Why?"
    },
    {
      "id": 121,
      "start": 305.55999755859375,
      "end": 306.8999938964844,
      "text": " God never changes."
    },
    {
      "id": 122,
      "start": 306.8999938964844,
      "end": 309.05999755859375,
      "text": " He's the same yesterday and today and forever."
    },
    {
      "id": 123,
      "start": 309.05999755859375,
      "end": 312.260009765625,
      "text": " And so we can sing and we can rejoice that God is holy."
    },
    {
      "id": 124,
      "start": 312.260009765625,
      "end": 314.4599914550781,
      "text": " The psalmist, in fact, says that we're to give thanks"
    },
    {
      "id": 125,
      "start": 314.4599914550781,
      "end": 317.5,
      "text": " at the remembrance of His holiness and we can thank God."
    },
    {
      "id": 126,
      "start": 317.5,
      "end": 320.239990234375,
      "text": " Listen, our life, things can seem to be falling apart,"
    },
    {
      "id": 127,
      "start": 320.239990234375,
      "end": 325.239990234375,
      "text": " turmoil all around us, but we can rejoice in who God is"
    },
    {
      "id": 128,
      "start": 325.5799865722656,
      "end": 328.239990234375,
      "text": " and His person and He's revealed it to us in His word"
    },
    {
      "id": 129,
      "start": 328.239990234375,
      "end": 332.5799865722656,
      "text": " that He has a plan, He has a purpose and how thankful I am."
    },
    {
      "id": 130,
      "start": 332.5799865722656,
      "end": 334.1400146484375,
      "text": " And of course, we are to thank God"
    },
    {
      "id": 131,
      "start": 334.1400146484375,
      "end": 336.3399963378906,
      "text": " for the things that He does,"
    },
    {
      "id": 132,
      "start": 336.3399963378906,
      "end": 338.1000061035156,
      "text": " but we need to learn to thank God for who He is."
    },
    {
      "id": 133,
      "start": 338.1000061035156,
      "end": 340.3800048828125,
      "text": " In 2019, the book of Ephesians,"
    },
    {
      "id": 134,
      "start": 340.3800048828125,
      "end": 344.0199890136719,
      "text": " be strong in the Lord and the power of His might"
    },
    {
      "id": 135,
      "start": 344.0199890136719,
      "end": 345.5199890136719,
      "text": " and how important it is that we put on"
    },
    {
      "id": 136,
      "start": 345.5199890136719,
      "end": 347.0799865722656,
      "text": " the whole armor of God."
    },
    {
      "id": 137,
      "start": 347.0799865722656,
      "end": 349.239990234375,
      "text": " We understand that we're engaged in battle."
    },
    {
      "id": 138,
      "start": 349.239990234375,
      "end": 352.3999938964844,
      "text": " We mentioned in 2019 how there were so many comments"
    },
    {
      "id": 139,
      "start": 352.3999938964844,
      "end": 355.1600036621094,
      "text": " that were going on with regard to various things"
    },
    {
      "id": 140,
      "start": 355.1600036621094,
      "end": 358.55999755859375,
      "text": " taking place in our world and cultural warfare"
    },
    {
      "id": 141,
      "start": 358.55999755859375,
      "end": 361.67999267578125,
      "text": " was something that was spoken often in that particular time."
    },
    {
      "id": 142,
      "start": 361.67999267578125,
      "end": 363.6199951171875,
      "text": " And I mentioned that we're really,"
    },
    {
      "id": 143,
      "start": 363.6199951171875,
      "end": 366.0799865722656,
      "text": " we are engaged in spiritual warfare"
    },
    {
      "id": 144,
      "start": 366.1000061035156,
      "end": 369.29998779296875,
      "text": " and we must understand that, we must acknowledge that"
    },
    {
      "id": 145,
      "start": 369.29998779296875,
      "end": 372.260009765625,
      "text": " and we understand that our weapons are not carnal, right?"
    },
    {
      "id": 146,
      "start": 372.260009765625,
      "end": 375.70001220703125,
      "text": " Our weapons are spiritual and we dealt with"
    },
    {
      "id": 147,
      "start": 375.70001220703125,
      "end": 377.1000061035156,
      "text": " be strong in the Lord."
    },
    {
      "id": 148,
      "start": 377.1000061035156,
      "end": 380.8599853515625,
      "text": " 2020, what a, thank God for His wisdom."
    },
    {
      "id": 149,
      "start": 380.8599853515625,
      "end": 383.5400085449219,
      "text": " I never could have known what was gonna happen in 2020"
    },
    {
      "id": 150,
      "start": 383.5400085449219,
      "end": 386.8999938964844,
      "text": " and it was about October 5th or so of 2019"
    },
    {
      "id": 151,
      "start": 386.8999938964844,
      "end": 390.17999267578125,
      "text": " that God led me to have as our theme in 2020,"
    },
    {
      "id": 152,
      "start": 390.17999267578125,
      "end": 394.17999267578125,
      "text": " looking unto Jesus and to preach to the book of Hebrews."
    },
    {
      "id": 153,
      "start": 394.20001220703125,
      "end": 396.79998779296875,
      "text": " And we had little understanding of all"
    },
    {
      "id": 154,
      "start": 396.79998779296875,
      "end": 398.3599853515625,
      "text": " that we were gonna deal with in 2020,"
    },
    {
      "id": 155,
      "start": 398.3599853515625,
      "end": 402.3999938964844,
      "text": " but how God just guided and helped us to understand"
    },
    {
      "id": 156,
      "start": 402.3999938964844,
      "end": 404.67999267578125,
      "text": " how we need to keep our eyes on the author"
    },
    {
      "id": 157,
      "start": 404.67999267578125,
      "end": 406.5199890136719,
      "text": " and finisher of our faith."
    },
    {
      "id": 158,
      "start": 406.5199890136719,
      "end": 408.5199890136719,
      "text": " And what a great book, the book of Hebrews."
    },
    {
      "id": 159,
      "start": 408.5199890136719,
      "end": 412.760009765625,
      "text": " 2021, complete in Christ, the book of Colossians."
    },
    {
      "id": 160,
      "start": 412.760009765625,
      "end": 415.9200134277344,
      "text": " And I'm so thankful that who I am in Christ"
    },
    {
      "id": 161,
      "start": 415.9200134277344,
      "end": 417.7200012207031,
      "text": " is the most important thing."
    },
    {
      "id": 162,
      "start": 417.7200012207031,
      "end": 420.4800109863281,
      "text": " We talk about who we are and what our identity is"
    },
    {
      "id": 163,
      "start": 420.4800109863281,
      "end": 421.4599914550781,
      "text": " and so on and so forth."
    },
    {
      "id": 164,
      "start": 421.4599914550781,
      "end": 423.760009765625,
      "text": " First and foremost, we must understand"
    },
    {
      "id": 165,
      "start": 424.260009765625,
      "end": 426.05999755859375,
      "text": " that I am a Christian, I am a believer,"
    },
    {
      "id": 166,
      "start": 426.05999755859375,
      "end": 428.6199951171875,
      "text": " I'm a follower of Jesus Christ."
    },
    {
      "id": 167,
      "start": 428.6199951171875,
      "end": 431.6600036621094,
      "text": " And what a blessing to know the Lord."
    },
    {
      "id": 168,
      "start": 431.6600036621094,
      "end": 433.5,
      "text": " And then of course, last year, 2022,"
    },
    {
      "id": 169,
      "start": 433.5,
      "end": 435.82000732421875,
      "text": " walking in the light, the book of 1 John."
    },
    {
      "id": 170,
      "start": 435.82000732421875,
      "end": 439.3399963378906,
      "text": " As we deal with this subject of great is the Lord,"
    },
    {
      "id": 171,
      "start": 439.3399963378906,
      "end": 441.5,
      "text": " I believe that having a theme helps me,"
    },
    {
      "id": 172,
      "start": 441.5,
      "end": 444.29998779296875,
      "text": " but also helps our church remain focused"
    },
    {
      "id": 173,
      "start": 444.29998779296875,
      "end": 445.5400085449219,
      "text": " throughout the year."
    },
    {
      "id": 174,
      "start": 445.5400085449219,
      "end": 447.5,
      "text": " I seek to follow the leadership of the Lord"
    },
    {
      "id": 175,
      "start": 447.5,
      "end": 448.8999938964844,
      "text": " and there are certain times, of course,"
    },
    {
      "id": 176,
      "start": 448.8999938964844,
      "end": 451.1400146484375,
      "text": " when I do not preach on the particular theme"
    },
    {
      "id": 177,
      "start": 451.1400146484375,
      "end": 453.5,
      "text": " or through the particular book or a topic"
    },
    {
      "id": 178,
      "start": 454.239990234375,
      "end": 455.0799865722656,
      "text": " that isn't aligned with the theme"
    },
    {
      "id": 179,
      "start": 455.0799865722656,
      "end": 456.760009765625,
      "text": " as God would give that leadership."
    },
    {
      "id": 180,
      "start": 456.760009765625,
      "end": 459.94000244140625,
      "text": " But it really helps with keeping that focus."
    },
    {
      "id": 181,
      "start": 459.94000244140625,
      "end": 463.239990234375,
      "text": " And this year, my desire, and I hope it will be our desire"
    },
    {
      "id": 182,
      "start": 463.239990234375,
      "end": 464.44000244140625,
      "text": " and we'll see the result of it,"
    },
    {
      "id": 183,
      "start": 464.44000244140625,
      "end": 467.55999755859375,
      "text": " is that we will focus on the greatness of our God."
    },
    {
      "id": 184,
      "start": 467.55999755859375,
      "end": 469.3999938964844,
      "text": " The word great means to be chief,"
    },
    {
      "id": 185,
      "start": 469.3999938964844,
      "end": 473.32000732421875,
      "text": " to have vast power and excellence, to be supreme."
    },
    {
      "id": 186,
      "start": 473.32000732421875,
      "end": 476.0,
      "text": " And we understand that our God is supreme."
    },
    {
      "id": 187,
      "start": 476.0,
      "end": 480.32000732421875,
      "text": " Our God is great and the Bible declares His greatness"
    },
    {
      "id": 188,
      "start": 480.32000732421875,
      "end": 482.3599853515625,
      "text": " throughout the pages of scripture."
    },
    {
      "id": 189,
      "start": 482.4200134277344,
      "end": 484.9800109863281,
      "text": " And as we begin to think about the sermon series"
    },
    {
      "id": 190,
      "start": 484.9800109863281,
      "end": 487.3399963378906,
      "text": " that we'll have here on Sunday mornings,"
    },
    {
      "id": 191,
      "start": 487.3399963378906,
      "end": 490.82000732421875,
      "text": " really my desire is to have two parts, if you will."
    },
    {
      "id": 192,
      "start": 490.82000732421875,
      "end": 492.3399963378906,
      "text": " And it's not gonna be 50-50,"
    },
    {
      "id": 193,
      "start": 492.3399963378906,
      "end": 493.8599853515625,
      "text": " it's not gonna be the first half of the year"
    },
    {
      "id": 194,
      "start": 493.8599853515625,
      "end": 495.1000061035156,
      "text": " and the second half of the year."
    },
    {
      "id": 195,
      "start": 495.1000061035156,
      "end": 499.05999755859375,
      "text": " It's probably gonna be more like 1 3rd and 2 3rds,"
    },
    {
      "id": 196,
      "start": 499.05999755859375,
      "end": 501.5,
      "text": " but we'll see how it goes as we get through the year."
    },
    {
      "id": 197,
      "start": 501.5,
      "end": 504.05999755859375,
      "text": " But really the first focus or emphasis"
    },
    {
      "id": 198,
      "start": 504.05999755859375,
      "end": 507.6199951171875,
      "text": " is going to be this, recognizing His greatness."
    },
    {
      "id": 199,
      "start": 507.6199951171875,
      "end": 509.9800109863281,
      "text": " That we recognize that our God is great."
    },
    {
      "id": 200,
      "start": 509.9800109863281,
      "end": 514.8200073242188,
      "text": " You see, what leads us to say God is great?"
    },
    {
      "id": 201,
      "start": 514.8200073242188,
      "end": 516.0,
      "text": " What is it, what is the,"
    },
    {
      "id": 202,
      "start": 516.0,
      "end": 519.239990234375,
      "text": " if you say to someone, my God is great,"
    },
    {
      "id": 203,
      "start": 519.239990234375,
      "end": 521.280029296875,
      "text": " and they say, why do you say that?"
    },
    {
      "id": 204,
      "start": 521.280029296875,
      "end": 523.8200073242188,
      "text": " What answers do we have?"
    },
    {
      "id": 205,
      "start": 523.8200073242188,
      "end": 526.47998046875,
      "text": " How is it that we would respond to that inquiry"
    },
    {
      "id": 206,
      "start": 526.47998046875,
      "end": 527.3200073242188,
      "text": " that someone would make?"
    },
    {
      "id": 207,
      "start": 527.3200073242188,
      "end": 529.280029296875,
      "text": " And so we must recognize His greatness"
    },
    {
      "id": 208,
      "start": 529.280029296875,
      "end": 530.9199829101562,
      "text": " through the pages of scripture."
    },
    {
      "id": 209,
      "start": 530.9199829101562,
      "end": 534.0800170898438,
      "text": " And then the next section, if you will,"
    },
    {
      "id": 210,
      "start": 534.0800170898438,
      "end": 535.739990234375,
      "text": " the next part of the sermon series"
    },
    {
      "id": 211,
      "start": 535.739990234375,
      "end": 539.5399780273438,
      "text": " will be dealing with responding to His greatness."
    },
    {
      "id": 212,
      "start": 540.0399780273438,
      "end": 542.0399780273438,
      "text": " So once I recognize that God is great,"
    },
    {
      "id": 213,
      "start": 542.0399780273438,
      "end": 543.719970703125,
      "text": " what is my response to that?"
    },
    {
      "id": 214,
      "start": 543.719970703125,
      "end": 547.1599731445312,
      "text": " How do I respond to this understanding"
    },
    {
      "id": 215,
      "start": 547.1599731445312,
      "end": 549.3200073242188,
      "text": " of how great my God is?"
    },
    {
      "id": 216,
      "start": 549.3200073242188,
      "end": 552.3599853515625,
      "text": " And we find this morning that when I see Him"
    },
    {
      "id": 217,
      "start": 552.3599853515625,
      "end": 553.8800048828125,
      "text": " in all of His greatness,"
    },
    {
      "id": 218,
      "start": 553.8800048828125,
      "end": 556.6799926757812,
      "text": " when I see Him for who He really is,"
    },
    {
      "id": 219,
      "start": 556.6799926757812,
      "end": 559.280029296875,
      "text": " that it will lead me, it should lead me"
    },
    {
      "id": 220,
      "start": 559.280029296875,
      "end": 561.6400146484375,
      "text": " to stand in awe of Him."
    },
    {
      "id": 221,
      "start": 563.8400268554688,
      "end": 565.780029296875,
      "text": " And as I stand in awe of Him"
    },
    {
      "id": 222,
      "start": 565.780029296875,
      "end": 568.52001953125,
      "text": " and I am understanding His greatness,"
    },
    {
      "id": 223,
      "start": 568.5399780273438,
      "end": 572.3800048828125,
      "text": " that will then lead us to seek and desire"
    },
    {
      "id": 224,
      "start": 572.3800048828125,
      "end": 576.8200073242188,
      "text": " to tell others about how great our God is."
    },
    {
      "id": 225,
      "start": 576.8200073242188,
      "end": 578.9400024414062,
      "text": " Because truly, we have a great God."
    },
    {
      "id": 226,
      "start": 578.9400024414062,
      "end": 580.5399780273438,
      "text": " And there's a world that does not,"
    },
    {
      "id": 227,
      "start": 580.5399780273438,
      "end": 583.7000122070312,
      "text": " they are unaware of the truth this morning"
    },
    {
      "id": 228,
      "start": 583.7000122070312,
      "end": 584.5800170898438,
      "text": " that I'm speaking of,"
    },
    {
      "id": 229,
      "start": 584.5800170898438,
      "end": 587.4600219726562,
      "text": " the truth that so many of us take for granted"
    },
    {
      "id": 230,
      "start": 587.4600219726562,
      "end": 588.5800170898438,
      "text": " that we know."
    },
    {
      "id": 231,
      "start": 588.5800170898438,
      "end": 590.0999755859375,
      "text": " If you came in here this morning"
    },
    {
      "id": 232,
      "start": 590.0999755859375,
      "end": 592.6599731445312,
      "text": " before you saw anything with regard to our theme,"
    },
    {
      "id": 233,
      "start": 592.6599731445312,
      "end": 595.02001953125,
      "text": " and I said to you, is God great?"
    },
    {
      "id": 234,
      "start": 595.02001953125,
      "end": 598.2999877929688,
      "text": " I am just absolutely convinced in my mind"
    },
    {
      "id": 235,
      "start": 598.2999877929688,
      "end": 600.6400146484375,
      "text": " that each and every one of you."
    },
    {
      "id": 0,
      "start": 600.6400146484375,
      "end": 608.2400145530701,
      "text": " would have said, yes, God is great, we believe that this morning. But I want to dive deeper into"
    },
    {
      "id": 1,
      "start": 608.2400145530701,
      "end": 615.7600145339966,
      "text": " that truth and I want to help myself and help you this morning to respond properly to that"
    },
    {
      "id": 2,
      "start": 615.7600145339966,
      "end": 621.2800140380859,
      "text": " greatness of God. And as we think about the message this morning here from Psalm 48, really,"
    },
    {
      "id": 3,
      "start": 621.2800140380859,
      "end": 626.4800148010254,
      "text": " it's just going to serve really as an introduction to our theme and I trust that we, each of us,"
    },
    {
      "id": 4,
      "start": 626.4800148010254,
      "end": 632.7200164794922,
      "text": " will be eager to behold His greatness. In Psalm 48, in verse number one, the Bible says,"
    },
    {
      "id": 5,
      "start": 632.7200164794922,
      "end": 638.0000152587891,
      "text": " great is the Lord. I mean, what a proclamation. What a way to just start the Psalm. Great"
    },
    {
      "id": 6,
      "start": 638.6400146484375,
      "end": 647.440013885498,
      "text": " is the Lord. And it says this, and greatly to be praised. Man, we ought to praise Him greatly. Why?"
    },
    {
      "id": 7,
      "start": 647.440013885498,
      "end": 654.6400146484375,
      "text": " Because He's great. He is worthy of our praise. In the city of our God, in the mountain of His"
    },
    {
      "id": 8,
      "start": 654.6400146484375,
      "end": 662.6400146484375,
      "text": " holiness, beautiful for situation, the joy of the whole earth is Mount Zion, on the sides of the"
    },
    {
      "id": 9,
      "start": 662.6400146484375,
      "end": 670.0800170898438,
      "text": " north, the city of the great King. This morning, if you're taking notes, number one, recognize"
    },
    {
      "id": 10,
      "start": 670.7200164794922,
      "end": 677.4400177001953,
      "text": " His greatness. Recognize His greatness. Here, we find that the psalmist, it's a psalm that is here"
    },
    {
      "id": 11,
      "start": 677.4400177001953,
      "end": 683.1200180053711,
      "text": " that would, no doubt, have been sang often. And you think about the declaration as we start,"
    },
    {
      "id": 12,
      "start": 683.1200180053711,
      "end": 687.2000122070312,
      "text": " and really, throughout the Bible, there are many verses of scripture that we will look at"
    },
    {
      "id": 13,
      "start": 687.2000122070312,
      "end": 693.5200119018555,
      "text": " throughout the year that simply declare the greatness of the Lord. Psalms like this that"
    },
    {
      "id": 14,
      "start": 693.5200119018555,
      "end": 700.1600112915039,
      "text": " just start with that great statement, great is the Lord. And we think about the recognition of"
    },
    {
      "id": 15,
      "start": 700.1600112915039,
      "end": 705.7600173950195,
      "text": " His greatness and understand the Bible declares His greatness in His word. Notice, if you will,"
    },
    {
      "id": 16,
      "start": 705.7600173950195,
      "end": 712.0800170898438,
      "text": " what the psalmist says over in Psalm 135. And I want you to see what the psalmist says with regard"
    },
    {
      "id": 17,
      "start": 712.0800170898438,
      "end": 717.9200134277344,
      "text": " to the greatness of God. And when we think about this truth this morning, when we're confronted"
    },
    {
      "id": 18,
      "start": 717.9200134277344,
      "end": 724.4800109863281,
      "text": " with this and recognizing His greatness, I trust that each of us would be able to say with the"
    },
    {
      "id": 19,
      "start": 724.4800109863281,
      "end": 729.760009765625,
      "text": " psalmist what is declared here in Psalm 135. Notice in verse number one, the Bible says,"
    },
    {
      "id": 20,
      "start": 729.760009765625,
      "end": 735.8400115966797,
      "text": " praise ye the Lord. Praise ye the name of the Lord. Praise Him, O ye servants of the Lord. You"
    },
    {
      "id": 21,
      "start": 735.8400115966797,
      "end": 741.52001953125,
      "text": " think there's an emphasis on praise? We find, it says in verse two, ye that stand in the house of"
    },
    {
      "id": 22,
      "start": 741.52001953125,
      "end": 747.3600158691406,
      "text": " the Lord, in the courts of the house of our God. Praise the Lord, for the Lord is good. Sing praises"
    },
    {
      "id": 23,
      "start": 747.3600158691406,
      "end": 752.8800201416016,
      "text": " unto His name, for it is pleasant. For the Lord hath chosen Jacob unto Himself, and Israel for"
    },
    {
      "id": 24,
      "start": 752.8800201416016,
      "end": 759.8400115966797,
      "text": " His peculiar treasure. Notice in verse number five what the psalmist says, for I know that the Lord"
    },
    {
      "id": 25,
      "start": 760.4800109863281,
      "end": 768.8800201416016,
      "text": " is great, and that our Lord is above all gods. Isn't that a wonderful statement of the psalmist"
    },
    {
      "id": 26,
      "start": 768.8800201416016,
      "end": 775.2800140380859,
      "text": " in Psalm 135 in verse number five? Listen, he doesn't say, I think the Lord is great. He's"
    },
    {
      "id": 27,
      "start": 775.2800140380859,
      "end": 784.8800201416016,
      "text": " saying, he's declaring with great confidence that I know that the Lord is great. And how does that"
    },
    {
      "id": 28,
      "start": 784.8800201416016,
      "end": 790.4800109863281,
      "text": " greatness, how does that understanding that the psalmist have, how would it impact his life?"
    },
    {
      "id": 29,
      "start": 790.4800109863281,
      "end": 797.4400177001953,
      "text": " How should it impact our lives when we understand how great our God is? Listen, this morning I think"
    },
    {
      "id": 30,
      "start": 797.4400177001953,
      "end": 801.9200134277344,
      "text": " when we understand how great God is, it's going to have an impact on our prayer life."
    },
    {
      "id": 31,
      "start": 803.2800140380859,
      "end": 808.0000152587891,
      "text": " Why? Because he's able to do exceeding abundantly above all that we ask or think, because he is a"
    },
    {
      "id": 32,
      "start": 808.0000152587891,
      "end": 814.4800109863281,
      "text": " great God that has all power and all ability, and so understanding, having the knowledge"
    },
    {
      "id": 33,
      "start": 815.0400085449219,
      "end": 819.8400115966797,
      "text": " of the greatness of God will impact our prayer life. It's going to impact the way that we witness,"
    },
    {
      "id": 34,
      "start": 819.8400115966797,
      "end": 823.52001953125,
      "text": " it's going to impact the way that we live, it's going to impact the way that we praise Him."
    },
    {
      "id": 35,
      "start": 823.52001953125,
      "end": 830.2400207519531,
      "text": " And we see this morning that the psalmist says, I know that the Lord is great. It's interesting as"
    },
    {
      "id": 36,
      "start": 830.2400207519531,
      "end": 834.8800201416016,
      "text": " you think about Moses making this statement in the book of Deuteronomy in chapter number three,"
    },
    {
      "id": 37,
      "start": 834.8800201416016,
      "end": 841.8400115966797,
      "text": " if you would turn over and notice what the word of God says here with regard to the testimony"
    },
    {
      "id": 38,
      "start": 841.8400115966797,
      "end": 847.2000122070312,
      "text": " that is recorded in Deuteronomy chapter number three. Now understand that as we would look at"
    },
    {
      "id": 39,
      "start": 847.2000122070312,
      "end": 852.2400207519531,
      "text": " the word of God and seek to recognize His greatness, that He has declared His greatness in"
    },
    {
      "id": 40,
      "start": 852.2400207519531,
      "end": 858.9600219726562,
      "text": " His word, but I'm also thankful that He has demonstrated His greatness. You know, it's one"
    },
    {
      "id": 41,
      "start": 858.9600219726562,
      "end": 866.3200073242188,
      "text": " thing to declare something, but it's quite another thing to demonstrate something. And we find this"
    },
    {
      "id": 42,
      "start": 866.3200073242188,
      "end": 872.2400207519531,
      "text": " morning that as we study the word of God, just as the case with so many attributes, God declares,"
    },
    {
      "id": 43,
      "start": 872.2400207519531,
      "end": 878.4000244140625,
      "text": " but then also demonstrates. We speak of God being love. Well, God declared His love, for God so loved"
    },
    {
      "id": 44,
      "start": 878.4000244140625,
      "end": 885.1200256347656,
      "text": " the world, but then He demonstrated His love that He gave His only begotten son. And we find that"
    },
    {
      "id": 45,
      "start": 885.1200256347656,
      "end": 890.7200012207031,
      "text": " throughout the word of God, as we understand, He declares His holiness, but then He demonstrates"
    },
    {
      "id": 46,
      "start": 890.7200012207031,
      "end": 896.1600036621094,
      "text": " that He's holy. And we think about this truth of His greatness, and we think about Moses and this"
    },
    {
      "id": 47,
      "start": 896.1600036621094,
      "end": 901.1200256347656,
      "text": " particular timing of the book of Deuteronomy, preparation for the children of Israel to enter"
    },
    {
      "id": 48,
      "start": 901.1200256347656,
      "end": 905.6000061035156,
      "text": " into the land. And we come to verse number 22 of chapter three, and the Bible says, you shall not"
    },
    {
      "id": 49,
      "start": 905.6000061035156,
      "end": 911.3600158691406,
      "text": " fear them, for the Lord your God, He shall fight for you. And I besought the Lord at that time,"
    },
    {
      "id": 50,
      "start": 911.3600158691406,
      "end": 923.52001953125,
      "text": " saying, notice what he says, O Lord God, thou hast begun to show thy servant thy greatness"
    },
    {
      "id": 51,
      "start": 924.2400207519531,
      "end": 929.3600158691406,
      "text": " in thy mighty hand. Now, pause just for a moment. What had Moses seen God do?"
    },
    {
      "id": 52,
      "start": 930.2400207519531,
      "end": 939.6800231933594,
      "text": " Ha! I mean, Moses had witnessed the power of God, the greatness of God over and over. We see God"
    },
    {
      "id": 53,
      "start": 939.6800231933594,
      "end": 946.6400146484375,
      "text": " working on the behalf of the children of Israel. We see, of course, the exodus from the Egyptian"
    },
    {
      "id": 54,
      "start": 946.6400146484375,
      "end": 953.0400085449219,
      "text": " bondage and all that takes place, and God showing His greatness through the plagues. I mean, Moses"
    },
    {
      "id": 55,
      "start": 953.0400085449219,
      "end": 958.4000244140625,
      "text": " witnessed those things firsthand. He had the opportunity, a front row seat, so to speak,"
    },
    {
      "id": 56,
      "start": 958.4000244140625,
      "end": 965.2000122070312,
      "text": " to see God's greatness being demonstrated. We find that after they had crossed over the Red Sea,"
    },
    {
      "id": 57,
      "start": 965.2000122070312,
      "end": 971.280029296875,
      "text": " they sang this morning about, He took them through the sea. And you think about standing there at the"
    },
    {
      "id": 58,
      "start": 971.9200134277344,
      "end": 977.760009765625,
      "text": " edge of the Red Sea and the Egyptians following in hot pursuit, ready to destroy and overcome."
    },
    {
      "id": 59,
      "start": 977.760009765625,
      "end": 983.280029296875,
      "text": " We find that God said, hey, you're going to go through and raise up that rod, and God parted the"
    },
    {
      "id": 60,
      "start": 983.280029296875,
      "end": 989.280029296875,
      "text": " Red Sea. They get to the other side, and then God closes the Red Sea on the Egyptians, who were saved"
    },
    {
      "id": 61,
      "start": 989.280029296875,
      "end": 994.6400146484375,
      "text": " to go over as well. We find that they get into the land, and they're worshiping there. After they had"
    },
    {
      "id": 62,
      "start": 994.6400146484375,
      "end": 999.0400085449219,
      "text": " crossed over the Red Sea, and they're worshiping the Lord, and they're praising God, but then there's"
    },
    {
      "id": 63,
      "start": 999.0400085449219,
      "end": 1006.3200073242188,
      "text": " no water. It's bitter water. It's not drinkable. And they begin to complain, and God works, and"
    },
    {
      "id": 64,
      "start": 1006.3200073242188,
      "end": 1011.0400085449219,
      "text": " He tells them to take this timber, this tree, and to put in the water, and He heals the waters."
    },
    {
      "id": 65,
      "start": 1011.6000061035156,
      "end": 1015.6000061035156,
      "text": " And then there's no water, and God says, I'll give you water from the rock. And"
    },
    {
      "id": 66,
      "start": 1015.6000061035156,
      "end": 1019.8400268554688,
      "text": " then there's no food, and He gives manna from, I mean, we could go on and on."
    },
    {
      "id": 67,
      "start": 1021.8400268554688,
      "end": 1029.52001953125,
      "text": " We see the power of God, the greatness of God being demonstrated in the life of Moses."
    },
    {
      "id": 68,
      "start": 1029.52001953125,
      "end": 1038.9600219726562,
      "text": " But notice what Moses says, thou hast begun to show thy servant thy greatness,"
    },
    {
      "id": 69,
      "start": 1039.52001953125,
      "end": 1048.7200012207031,
      "text": " and thy mighty hand. As much as Moses had experienced, it was just the start of God"
    },
    {
      "id": 70,
      "start": 1048.7200012207031,
      "end": 1055.6800231933594,
      "text": " showing how great He really is. That's amazing to me, because as I read all of those things,"
    },
    {
      "id": 71,
      "start": 1055.6800231933594,
      "end": 1060.4800109863281,
      "text": " and I study all of those things, I'm looking, I'm saying, man, look at how great our God is. Look at"
    },
    {
      "id": 72,
      "start": 1060.4800109863281,
      "end": 1065.280029296875,
      "text": " what He's capable of doing, and this is increasing my faith. This is encouraging my walk with God,"
    },
    {
      "id": 73,
      "start": 1065.3600158691406,
      "end": 1071.52001953125,
      "text": " and I am so thankful. But Moses says, it's just the start. That's how great our God is."
    },
    {
      "id": 74,
      "start": 1073.52001953125,
      "end": 1077.760009765625,
      "text": " We find that in chapter 5, notice what the Bible says in verse number 24."
    },
    {
      "id": 75,
      "start": 1081.0400085449219,
      "end": 1086.4000244140625,
      "text": " Deuteronomy 5, in verse number 24, Moses, in chapter 5, He called all Israel together,"
    },
    {
      "id": 76,
      "start": 1086.4000244140625,
      "end": 1090.8000183105469,
      "text": " and He began to give them some instruction, and to help them as He does throughout the book. It"
    },
    {
      "id": 77,
      "start": 1090.8000183105469,
      "end": 1095.52001953125,
      "text": " says in verse number 24, And ye said, Behold, the Lord our God hath showed us His glory and His"
    },
    {
      "id": 78,
      "start": 1095.52001953125,
      "end": 1099.9200134277344,
      "text": " greatness. We have heard His voice out of the midst of the fire. We have seen this day that"
    },
    {
      "id": 79,
      "start": 1099.9200134277344,
      "end": 1107.280029296875,
      "text": " God doth talk with man, and He liveth. And I'm so thankful that God would not only declare His"
    },
    {
      "id": 80,
      "start": 1107.280029296875,
      "end": 1113.280029296875,
      "text": " greatness, but demonstrate His greatness. As we begin to think about the greatness of God,"
    },
    {
      "id": 81,
      "start": 1113.280029296875,
      "end": 1116.7999877929688,
      "text": " and recognizing His greatness, and I know I've said this in the past, but it's so"
    },
    {
      "id": 82,
      "start": 1117.52001953125,
      "end": 1120.5599975585938,
      "text": " worthy of repeating in this particular message that we have"
    },
    {
      "id": 83,
      "start": 1121.2000122070312,
      "end": 1127.2000122070312,
      "text": " the truth of God's greatness. And the psalmist in Psalm 135 said, I know that the Lord is great."
    },
    {
      "id": 84,
      "start": 1128.3200073242188,
      "end": 1133.2000122070312,
      "text": " Moses said, You've just begun to show us how great you really are. And the psalmist says,"
    },
    {
      "id": 85,
      "start": 1133.2000122070312,
      "end": 1136.4000244140625,
      "text": " and you don't need to turn there, but in Psalm 145, we'll be there in just a little while,"
    },
    {
      "id": 86,
      "start": 1136.4000244140625,
      "end": 1140.3200073242188,
      "text": " but in Psalm 145, the Bible says, Great is the Lord, and greatly to be praised. And then it"
    },
    {
      "id": 87,
      "start": 1140.3200073242188,
      "end": 1148.5599975585938,
      "text": " says this, His greatness is unsearchable, because we cannot fully comprehend how great our God is."
    },
    {
      "id": 88,
      "start": 1150.239990234375,
      "end": 1155.6000366210938,
      "text": " This morning, if we were to take some time individually, and for each of us to try to,"
    },
    {
      "id": 89,
      "start": 1155.6000366210938,
      "end": 1161.280029296875,
      "text": " in our own terms, express how great we think God is, and some would stand, perhaps,"
    },
    {
      "id": 90,
      "start": 1161.280029296875,
      "end": 1166.5599975585938,
      "text": " and wax eloquent and speak about how great they understand God to be. And as we go through the"
    },
    {
      "id": 91,
      "start": 1166.5599975585938,
      "end": 1172.8800048828125,
      "text": " room and let each individual person say this morning, and try to articulate and express from"
    },
    {
      "id": 92,
      "start": 1172.8800048828125,
      "end": 1177.9200439453125,
      "text": " their own heart and their own mind, this is how great God is. This is why I can say that God is"
    },
    {
      "id": 93,
      "start": 1177.9200439453125,
      "end": 1186.7999877929688,
      "text": " great for each and every one of us. It's more. It exceeds. It's higher, because we cannot fully"
    },
    {
      "id": 94,
      "start": 1186.7999877929688,
      "end": 1193.9200439453125,
      "text": " understand how great our God is. And this morning, we need to recognize His greatness. The psalmist"
    },
    {
      "id": 95,
      "start": 1193.9200439453125,
      "end": 1200.5599975585938,
      "text": " begins, Great is the Lord. Not only do we recognize His greatness, number two, we rejoice."
    },
    {
      "id": 0,
      "start": 1200.5599975585938,
      "end": 1202.4999976158142,
      "text": " in His greatness."
    },
    {
      "id": 1,
      "start": 1202.4999976158142,
      "end": 1203.9999976158142,
      "text": " Great is the Lord,"
    },
    {
      "id": 2,
      "start": 1203.9999976158142,
      "end": 1207.7199974060059,
      "text": " and greatly to be praised."
    },
    {
      "id": 3,
      "start": 1207.7199974060059,
      "end": 1209.879997253418,
      "text": " Listen, this morning,"
    },
    {
      "id": 4,
      "start": 1209.879997253418,
      "end": 1211.7199974060059,
      "text": " when we understand, when we recognize"
    },
    {
      "id": 5,
      "start": 1211.7199974060059,
      "end": 1213.339997291565,
      "text": " how great He is,"
    },
    {
      "id": 6,
      "start": 1213.339997291565,
      "end": 1215.3999977111816,
      "text": " we ought to rejoice."
    },
    {
      "id": 7,
      "start": 1215.3999977111816,
      "end": 1218.0799980163574,
      "text": " That should be our response."
    },
    {
      "id": 8,
      "start": 1218.0799980163574,
      "end": 1220.5599975585938,
      "text": " This great God, as we look in Psalm 48,"
    },
    {
      "id": 9,
      "start": 1220.5599975585938,
      "end": 1222.8399982452393,
      "text": " the end of the chapter in v. 14,"
    },
    {
      "id": 10,
      "start": 1222.8399982452393,
      "end": 1224.6399974822998,
      "text": " after it goes through all of these"
    },
    {
      "id": 11,
      "start": 1224.6399974822998,
      "end": 1227.1199970245361,
      "text": " statements with regard to our God"
    },
    {
      "id": 12,
      "start": 1227.1199970245361,
      "end": 1229.1599979400635,
      "text": " being a refuge and so on and so forth,"
    },
    {
      "id": 13,
      "start": 1229.1599979400635,
      "end": 1230.5599975585938,
      "text": " He tells us in v. 14,"
    },
    {
      "id": 14,
      "start": 1230.5599975585938,
      "end": 1232.9199981689453,
      "text": " for this God is our God,"
    },
    {
      "id": 15,
      "start": 1232.9199981689453,
      "end": 1234.7999992370605,
      "text": " forever and ever."
    },
    {
      "id": 16,
      "start": 1234.7999992370605,
      "end": 1238.2399978637695,
      "text": " He will be our guide even unto death."
    },
    {
      "id": 17,
      "start": 1238.2399978637695,
      "end": 1239.3599967956543,
      "text": " Now think about that truth."
    },
    {
      "id": 18,
      "start": 1239.3599967956543,
      "end": 1243.1999969482422,
      "text": " I know there's some millennial prophecies"
    },
    {
      "id": 19,
      "start": 1243.1999969482422,
      "end": 1244.439998626709,
      "text": " with regard to Psalm 48."
    },
    {
      "id": 20,
      "start": 1244.439998626709,
      "end": 1246.1599960327148,
      "text": " I understand that as you study"
    },
    {
      "id": 21,
      "start": 1246.1599960327148,
      "end": 1248.3999977111816,
      "text": " the beginning of the chapter in particular."
    },
    {
      "id": 22,
      "start": 1248.3999977111816,
      "end": 1251.319995880127,
      "text": " But listen, after I'm in the millennium,"
    },
    {
      "id": 23,
      "start": 1251.319995880127,
      "end": 1254.03999710083,
      "text": " there's no death for me."
    },
    {
      "id": 24,
      "start": 1254.03999710083,
      "end": 1255.7599983215332,
      "text": " Amen?"
    },
    {
      "id": 25,
      "start": 1255.7599983215332,
      "end": 1256.9199981689453,
      "text": " And it says He's going to be our guide"
    },
    {
      "id": 26,
      "start": 1257.03999710083,
      "end": 1259.03999710083,
      "text": " even unto death."
    },
    {
      "id": 27,
      "start": 1259.03999710083,
      "end": 1262.6399993896484,
      "text": " This God is our God,"
    },
    {
      "id": 28,
      "start": 1262.6399993896484,
      "end": 1264.5199966430664,
      "text": " forever and ever."
    },
    {
      "id": 29,
      "start": 1264.5199966430664,
      "end": 1266.0599975585938,
      "text": " I'm thankful that He's gonna guide me"
    },
    {
      "id": 30,
      "start": 1266.0599975585938,
      "end": 1268.479995727539,
      "text": " until I take my final breath here upon this earth,"
    },
    {
      "id": 31,
      "start": 1268.479995727539,
      "end": 1269.6999969482422,
      "text": " and then I'm gonna be with Him."
    },
    {
      "id": 32,
      "start": 1269.6999969482422,
      "end": 1270.5400009155273,
      "text": " To be absent from the body"
    },
    {
      "id": 33,
      "start": 1270.5400009155273,
      "end": 1271.9199981689453,
      "text": " is to be present with the Lord."
    },
    {
      "id": 34,
      "start": 1271.9199981689453,
      "end": 1273.1999969482422,
      "text": " And yes, He has a plan."
    },
    {
      "id": 35,
      "start": 1273.1999969482422,
      "end": 1274.4599990844727,
      "text": " There's going to be all those things"
    },
    {
      "id": 36,
      "start": 1274.4599990844727,
      "end": 1277.3600006103516,
      "text": " that happen during the tribulation,"
    },
    {
      "id": 37,
      "start": 1277.3600006103516,
      "end": 1278.2799987792969,
      "text": " the millennial reign,"
    },
    {
      "id": 38,
      "start": 1278.2799987792969,
      "end": 1279.759994506836,
      "text": " but then forever and ever,"
    },
    {
      "id": 39,
      "start": 1279.759994506836,
      "end": 1281.759994506836,
      "text": " He's my God."
    },
    {
      "id": 40,
      "start": 1281.759994506836,
      "end": 1284.3600006103516,
      "text": " This great God that has revealed to us,"
    },
    {
      "id": 41,
      "start": 1284.3600006103516,
      "end": 1286.7200012207031,
      "text": " that has declared to us His greatness"
    },
    {
      "id": 42,
      "start": 1287.5599975585938,
      "end": 1288.3999938964844,
      "text": " in His word,"
    },
    {
      "id": 43,
      "start": 1288.3999938964844,
      "end": 1289.2200012207031,
      "text": " He's demonstrated it,"
    },
    {
      "id": 44,
      "start": 1289.2200012207031,
      "end": 1290.0599975585938,
      "text": " not only in the pages of scripture,"
    },
    {
      "id": 45,
      "start": 1290.0599975585938,
      "end": 1291.0400009155273,
      "text": " but I would say this morning,"
    },
    {
      "id": 46,
      "start": 1291.0400009155273,
      "end": 1294.099998474121,
      "text": " that He's demonstrated His greatness in our lives."
    },
    {
      "id": 47,
      "start": 1295.1800003051758,
      "end": 1297.2399978637695,
      "text": " And as we think about His greatness,"
    },
    {
      "id": 48,
      "start": 1297.2399978637695,
      "end": 1300.3600006103516,
      "text": " and then we respond to that with rejoicing,"
    },
    {
      "id": 49,
      "start": 1301.6800003051758,
      "end": 1305.0,
      "text": " because this God is my God."
    },
    {
      "id": 50,
      "start": 1305.0,
      "end": 1308.6999969482422,
      "text": " I'm always encouraged of how personal God is."
    },
    {
      "id": 51,
      "start": 1310.5199966430664,
      "end": 1313.1199951171875,
      "text": " You know, there's almost eight billion people"
    },
    {
      "id": 52,
      "start": 1313.1199951171875,
      "end": 1314.2200012207031,
      "text": " on earth today."
    },
    {
      "id": 53,
      "start": 1315.3999938964844,
      "end": 1316.5599975585938,
      "text": " That's a lot of people."
    },
    {
      "id": 54,
      "start": 1317.6399993896484,
      "end": 1321.1199951171875,
      "text": " But God is a personal God."
    },
    {
      "id": 55,
      "start": 1321.1199951171875,
      "end": 1323.5199966430664,
      "text": " I mean, I study the pages of scripture."
    },
    {
      "id": 56,
      "start": 1323.5199966430664,
      "end": 1324.879997253418,
      "text": " You begin to see how that,"
    },
    {
      "id": 57,
      "start": 1324.879997253418,
      "end": 1326.759994506836,
      "text": " especially we study the miracles"
    },
    {
      "id": 58,
      "start": 1326.759994506836,
      "end": 1328.4399948120117,
      "text": " in our adult Sunday school class for almost,"
    },
    {
      "id": 59,
      "start": 1328.4399948120117,
      "end": 1331.479995727539,
      "text": " or the family Sunday school class for almost a year,"
    },
    {
      "id": 60,
      "start": 1331.479995727539,
      "end": 1333.9599914550781,
      "text": " and how often when we study the life of Christ"
    },
    {
      "id": 61,
      "start": 1333.9599914550781,
      "end": 1335.1999969482422,
      "text": " and study those miracles,"
    },
    {
      "id": 62,
      "start": 1335.1999969482422,
      "end": 1338.8000030517578,
      "text": " you will read where the Bible talks about the multitudes,"
    },
    {
      "id": 63,
      "start": 1338.8000030517578,
      "end": 1340.8399963378906,
      "text": " but then there's a certain man,"
    },
    {
      "id": 64,
      "start": 1340.8399963378906,
      "end": 1342.0399932861328,
      "text": " there's a certain woman,"
    },
    {
      "id": 65,
      "start": 1343.3999938964844,
      "end": 1345.6399993896484,
      "text": " and there's a multitude of people,"
    },
    {
      "id": 66,
      "start": 1346.5599975585938,
      "end": 1349.6999969482422,
      "text": " but God's attention is focused on the individual."
    },
    {
      "id": 67,
      "start": 1350.5599975585938,
      "end": 1352.0399932861328,
      "text": " And this morning, I'm so thankful"
    },
    {
      "id": 68,
      "start": 1352.0399932861328,
      "end": 1354.020004272461,
      "text": " that God is a personal God."
    },
    {
      "id": 69,
      "start": 1355.2799987792969,
      "end": 1358.6399993896484,
      "text": " You think about the nature and character of God"
    },
    {
      "id": 70,
      "start": 1358.6399993896484,
      "end": 1361.6799926757812,
      "text": " that He can listen to each and every one of us"
    },
    {
      "id": 71,
      "start": 1361.6799926757812,
      "end": 1362.6799926757812,
      "text": " at the same time."
    },
    {
      "id": 72,
      "start": 1364.0399932861328,
      "end": 1366.6799926757812,
      "text": " We just all prayed earlier this morning."
    },
    {
      "id": 73,
      "start": 1366.6799926757812,
      "end": 1369.4400024414062,
      "text": " We've been doing that for almost a year now,"
    },
    {
      "id": 74,
      "start": 1369.4400024414062,
      "end": 1370.739990234375,
      "text": " before every one of our services,"
    },
    {
      "id": 75,
      "start": 1370.739990234375,
      "end": 1371.5800018310547,
      "text": " except for Wednesday night,"
    },
    {
      "id": 76,
      "start": 1371.5800018310547,
      "end": 1373.0399932861328,
      "text": " because prayer's at the end on Wednesday night,"
    },
    {
      "id": 77,
      "start": 1373.0399932861328,
      "end": 1375.4400024414062,
      "text": " but I was convicted almost a year ago"
    },
    {
      "id": 78,
      "start": 1376.2799987792969,
      "end": 1378.6799926757812,
      "text": " that prayer has become bookends in our services."
    },
    {
      "id": 79,
      "start": 1378.6799926757812,
      "end": 1379.759994506836,
      "text": " God, would you bless?"
    },
    {
      "id": 80,
      "start": 1379.759994506836,
      "end": 1381.759994506836,
      "text": " God, thank you for blessing."
    },
    {
      "id": 81,
      "start": 1381.759994506836,
      "end": 1385.1199951171875,
      "text": " And we have made an effort to specifically take time"
    },
    {
      "id": 82,
      "start": 1385.1199951171875,
      "end": 1388.0800018310547,
      "text": " as a church family to pray about the service"
    },
    {
      "id": 83,
      "start": 1388.0800018310547,
      "end": 1390.1199951171875,
      "text": " and what God would do in our hearts."
    },
    {
      "id": 84,
      "start": 1391.0800018310547,
      "end": 1394.759994506836,
      "text": " And as I am praying with Dean on Sunday mornings here"
    },
    {
      "id": 85,
      "start": 1394.759994506836,
      "end": 1397.6999969482422,
      "text": " and with Holly on Sunday evenings here,"
    },
    {
      "id": 86,
      "start": 1397.6999969482422,
      "end": 1401.3199920654297,
      "text": " I can hear the mumbling of people praying."
    },
    {
      "id": 87,
      "start": 1401.3199920654297,
      "end": 1403.020004272461,
      "text": " I have no idea what you're saying,"
    },
    {
      "id": 88,
      "start": 1404.020004272461,
      "end": 1406.0599975585938,
      "text": " but God does."
    },
    {
      "id": 89,
      "start": 1407.5,
      "end": 1408.9400024414062,
      "text": " You have needs in your heart"
    },
    {
      "id": 90,
      "start": 1408.9400024414062,
      "end": 1410.8999938964844,
      "text": " that you're expressing to God,"
    },
    {
      "id": 91,
      "start": 1410.8999938964844,
      "end": 1412.5,
      "text": " and God hears you."
    },
    {
      "id": 92,
      "start": 1412.5,
      "end": 1413.3399963378906,
      "text": " God knows."
    },
    {
      "id": 93,
      "start": 1413.3399963378906,
      "end": 1415.0999908447266,
      "text": " He is a personal God,"
    },
    {
      "id": 94,
      "start": 1415.0999908447266,
      "end": 1417.3800048828125,
      "text": " and this God is our God,"
    },
    {
      "id": 95,
      "start": 1417.3800048828125,
      "end": 1418.739990234375,
      "text": " and I'm so thankful."
    },
    {
      "id": 96,
      "start": 1418.739990234375,
      "end": 1422.4199981689453,
      "text": " As I begin to think about that rejoicing in the Lord,"
    },
    {
      "id": 97,
      "start": 1422.4199981689453,
      "end": 1424.5800018310547,
      "text": " great is the Lord and greatly to be praised."
    },
    {
      "id": 98,
      "start": 1424.5800018310547,
      "end": 1425.6999969482422,
      "text": " Look at Psalm 145."
    },
    {
      "id": 99,
      "start": 1425.6999969482422,
      "end": 1426.9400024414062,
      "text": " I told you we'd be there in just a moment."
    },
    {
      "id": 100,
      "start": 1426.9400024414062,
      "end": 1430.259994506836,
      "text": " Look at what the Bible says here in the first three verses."
    },
    {
      "id": 101,
      "start": 1430.259994506836,
      "end": 1432.259994506836,
      "text": " When we think about this rejoicing,"
    },
    {
      "id": 102,
      "start": 1432.259994506836,
      "end": 1435.3399963378906,
      "text": " because of the understanding that we have"
    },
    {
      "id": 103,
      "start": 1435.3399963378906,
      "end": 1436.8999938964844,
      "text": " that he is great."
    },
    {
      "id": 104,
      "start": 1436.8999938964844,
      "end": 1439.6999969482422,
      "text": " In Psalm 145, beginning in verse number one,"
    },
    {
      "id": 105,
      "start": 1439.6999969482422,
      "end": 1441.4599914550781,
      "text": " notice what the psalmist says."
    },
    {
      "id": 106,
      "start": 1441.4599914550781,
      "end": 1444.0599975585938,
      "text": " I will extol thee."
    },
    {
      "id": 107,
      "start": 1444.0599975585938,
      "end": 1447.1799926757812,
      "text": " Do you see the determined commitment"
    },
    {
      "id": 108,
      "start": 1447.1799926757812,
      "end": 1448.5999908447266,
      "text": " that the psalmist has"
    },
    {
      "id": 109,
      "start": 1448.5999908447266,
      "end": 1450.5800018310547,
      "text": " that this is something that I'm going to do"
    },
    {
      "id": 110,
      "start": 1450.5800018310547,
      "end": 1453.0999908447266,
      "text": " because of what I understand?"
    },
    {
      "id": 111,
      "start": 1453.0999908447266,
      "end": 1455.259994506836,
      "text": " He's going to speak about the greatness of God"
    },
    {
      "id": 112,
      "start": 1455.259994506836,
      "end": 1456.3399963378906,
      "text": " in verse number three,"
    },
    {
      "id": 113,
      "start": 1456.3399963378906,
      "end": 1457.9800109863281,
      "text": " but you understand that he's saying"
    },
    {
      "id": 114,
      "start": 1457.9800109863281,
      "end": 1459.2999877929688,
      "text": " this is what I'm going to do."
    },
    {
      "id": 115,
      "start": 1459.2999877929688,
      "end": 1461.260009765625,
      "text": " I'm going to rejoice."
    },
    {
      "id": 116,
      "start": 1461.260009765625,
      "end": 1465.1399841308594,
      "text": " I will extol thee, my God, O King,"
    },
    {
      "id": 117,
      "start": 1465.1399841308594,
      "end": 1470.1399841308594,
      "text": " and I will bless thy name forever and ever."
    },
    {
      "id": 118,
      "start": 1470.3399963378906,
      "end": 1472.3399963378906,
      "text": " If I could just for a moment go back"
    },
    {
      "id": 119,
      "start": 1472.3399963378906,
      "end": 1474.8599853515625,
      "text": " to what I said with regard to verse 14 of Psalm 48,"
    },
    {
      "id": 120,
      "start": 1474.8599853515625,
      "end": 1478.0599975585938,
      "text": " that he's my God now, but he's my God forever and ever."
    },
    {
      "id": 121,
      "start": 1478.0599975585938,
      "end": 1481.8999938964844,
      "text": " Listen, we will praise him forever in eternity."
    },
    {
      "id": 122,
      "start": 1481.8999938964844,
      "end": 1483.7000122070312,
      "text": " We ought to start praising him now."
    },
    {
      "id": 123,
      "start": 1485.6199951171875,
      "end": 1487.5400085449219,
      "text": " Preparation for eternity."
    },
    {
      "id": 124,
      "start": 1487.5400085449219,
      "end": 1489.4599914550781,
      "text": " Learning to praise God."
    },
    {
      "id": 125,
      "start": 1489.4599914550781,
      "end": 1492.0599975585938,
      "text": " Because we're going to praise him forever."
    },
    {
      "id": 126,
      "start": 1492.0599975585938,
      "end": 1494.0400085449219,
      "text": " And you notice the commitment,"
    },
    {
      "id": 127,
      "start": 1494.0400085449219,
      "end": 1496.8999938964844,
      "text": " the determined statement of the psalmist."
    },
    {
      "id": 128,
      "start": 1496.8999938964844,
      "end": 1498.3399963378906,
      "text": " Notice what he says in verse number two."
    },
    {
      "id": 129,
      "start": 1498.3399963378906,
      "end": 1501.760009765625,
      "text": " Every day will I bless thee,"
    },
    {
      "id": 130,
      "start": 1502.7000122070312,
      "end": 1505.5199890136719,
      "text": " and I will praise thy name forever and ever."
    },
    {
      "id": 131,
      "start": 1505.5199890136719,
      "end": 1508.260009765625,
      "text": " Is that because David's always going to have good days?"
    },
    {
      "id": 132,
      "start": 1509.3200073242188,
      "end": 1510.3800048828125,
      "text": " Is that because David says,"
    },
    {
      "id": 133,
      "start": 1510.3800048828125,
      "end": 1511.9800109863281,
      "text": " listen, everything's always going to be great"
    },
    {
      "id": 134,
      "start": 1511.9800109863281,
      "end": 1514.5199890136719,
      "text": " because God is my God,"
    },
    {
      "id": 135,
      "start": 1514.5199890136719,
      "end": 1515.7200012207031,
      "text": " and so I'm going to praise him every day"
    },
    {
      "id": 136,
      "start": 1515.7200012207031,
      "end": 1518.7000122070312,
      "text": " because he's just going to give me this perfect life"
    },
    {
      "id": 137,
      "start": 1518.7799987792969,
      "end": 1521.6199951171875,
      "text": " without any problems, no issues, no."
    },
    {
      "id": 138,
      "start": 1521.6199951171875,
      "end": 1523.4199829101562,
      "text": " No, you read the life of David."
    },
    {
      "id": 139,
      "start": 1523.4199829101562,
      "end": 1525.4199829101562,
      "text": " He had plenty of problems."
    },
    {
      "id": 140,
      "start": 1526.2999877929688,
      "end": 1528.9800109863281,
      "text": " Plenty of difficulty and adversity."
    },
    {
      "id": 141,
      "start": 1528.9800109863281,
      "end": 1531.1399841308594,
      "text": " But he's making this determination, why?"
    },
    {
      "id": 142,
      "start": 1531.1399841308594,
      "end": 1534.1399841308594,
      "text": " Because he understands how great God is."
    },
    {
      "id": 143,
      "start": 1534.1399841308594,
      "end": 1536.3800048828125,
      "text": " Great is the Lord and greatly to be praised."
    },
    {
      "id": 144,
      "start": 1536.3800048828125,
      "end": 1538.739990234375,
      "text": " I'm going to rejoice in his greatness."
    },
    {
      "id": 145,
      "start": 1538.739990234375,
      "end": 1541.6799926757812,
      "text": " And he says, every day will I bless thee."
    },
    {
      "id": 146,
      "start": 1543.0599975585938,
      "end": 1545.239990234375,
      "text": " Great is the Lord, verse number three,"
    },
    {
      "id": 147,
      "start": 1545.239990234375,
      "end": 1548.4199829101562,
      "text": " and greatly to be praised."
    },
    {
      "id": 148,
      "start": 1548.4199829101562,
      "end": 1551.6399841308594,
      "text": " And his greatness is unsearchable."
    },
    {
      "id": 149,
      "start": 1552.8800048828125,
      "end": 1553.7200012207031,
      "text": " This morning,"
    },
    {
      "id": 150,
      "start": 1557.0400085449219,
      "end": 1559.5599975585938,
      "text": " we think about all the things going on in our world."
    },
    {
      "id": 151,
      "start": 1559.5599975585938,
      "end": 1561.9599914550781,
      "text": " There's a lot of stuff going on in our world."
    },
    {
      "id": 152,
      "start": 1561.9599914550781,
      "end": 1564.1199951171875,
      "text": " A lot of crazy stuff going on in our world."
    },
    {
      "id": 153,
      "start": 1566.0799865722656,
      "end": 1566.9199829101562,
      "text": " God is great."
    },
    {
      "id": 154,
      "start": 1568.1600036621094,
      "end": 1569.3999938964844,
      "text": " God is great."
    },
    {
      "id": 155,
      "start": 1569.3999938964844,
      "end": 1574.3999938964844,
      "text": " We cannot lose focus of that fundamental truth"
    },
    {
      "id": 156,
      "start": 1575.4400024414062,
      "end": 1577.239990234375,
      "text": " though all the world,"
    },
    {
      "id": 157,
      "start": 1577.239990234375,
      "end": 1578.7999877929688,
      "text": " Brother Mershon has said it for years."
    },
    {
      "id": 158,
      "start": 1578.7999877929688,
      "end": 1580.0400085449219,
      "text": " I've heard him say it for years."
    },
    {
      "id": 159,
      "start": 1580.0400085449219,
      "end": 1581.0799865722656,
      "text": " I talked to him the other night."
    },
    {
      "id": 160,
      "start": 1581.0799865722656,
      "end": 1582.3999938964844,
      "text": " He said it again."
    },
    {
      "id": 161,
      "start": 1582.3999938964844,
      "end": 1586.4400024414062,
      "text": " Collectively, we're losing our minds as a world."
    },
    {
      "id": 162,
      "start": 1587.9199829101562,
      "end": 1589.8800048828125,
      "text": " We really are."
    },
    {
      "id": 163,
      "start": 1589.8800048828125,
      "end": 1591.1600036621094,
      "text": " But God is great."
    },
    {
      "id": 164,
      "start": 1591.1600036621094,
      "end": 1592.5799865722656,
      "text": " He's still on his throne."
    },
    {
      "id": 165,
      "start": 1593.5599975585938,
      "end": 1596.6799926757812,
      "text": " The Lord God omnipotent reigneth."
    },
    {
      "id": 166,
      "start": 1596.6799926757812,
      "end": 1597.8999938964844,
      "text": " He makes no mistakes."
    },
    {
      "id": 167,
      "start": 1597.8999938964844,
      "end": 1601.8800048828125,
      "text": " Though the heathen rage and they devise plans, God laughs."
    },
    {
      "id": 168,
      "start": 1602.8800048828125,
      "end": 1605.8399963378906,
      "text": " He has all power."
    },
    {
      "id": 169,
      "start": 1605.8399963378906,
      "end": 1607.0,
      "text": " He's in control."
    },
    {
      "id": 170,
      "start": 1608.3599853515625,
      "end": 1611.9199829101562,
      "text": " This morning, when the psalmist says,"
    },
    {
      "id": 171,
      "start": 1611.9199829101562,
      "end": 1616.3599853515625,
      "text": " I'm going to rejoice because I understand how great you are,"
    },
    {
      "id": 172,
      "start": 1616.3599853515625,
      "end": 1617.9599914550781,
      "text": " it's not because he's expecting"
    },
    {
      "id": 173,
      "start": 1617.9599914550781,
      "end": 1620.2000122070312,
      "text": " there'll be no problems in his life."
    },
    {
      "id": 174,
      "start": 1620.2000122070312,
      "end": 1621.3999938964844,
      "text": " It's because he understands"
    },
    {
      "id": 175,
      "start": 1621.3999938964844,
      "end": 1623.5599975585938,
      "text": " that even in the midst of those problems,"
    },
    {
      "id": 176,
      "start": 1623.5599975585938,
      "end": 1627.8999938964844,
      "text": " in the midst of turmoil, God is still great."
    },
    {
      "id": 177,
      "start": 1628.9400024414062,
      "end": 1631.2999877929688,
      "text": " I said this last week, two weeks ago, I think."
    },
    {
      "id": 178,
      "start": 1632.2000122070312,
      "end": 1633.4800109863281,
      "text": " It's worth repeating."
    },
    {
      "id": 179,
      "start": 1634.3999938964844,
      "end": 1636.7999877929688,
      "text": " You know, the world deals with problems as well."
    },
    {
      "id": 180,
      "start": 1637.8399963378906,
      "end": 1641.8399963378906,
      "text": " Man that is born of woman, few days and full of trouble."
    },
    {
      "id": 181,
      "start": 1641.8399963378906,
      "end": 1643.9199829101562,
      "text": " We got problems."
    },
    {
      "id": 182,
      "start": 1643.9199829101562,
      "end": 1644.760009765625,
      "text": " Amen?"
    },
    {
      "id": 183,
      "start": 1646.6799926757812,
      "end": 1650.5,
      "text": " But you understand as a believer, as a child of God,"
    },
    {
      "id": 184,
      "start": 1650.5,
      "end": 1653.4800109863281,
      "text": " your outlook when you have those difficulties"
    },
    {
      "id": 185,
      "start": 1653.4800109863281,
      "end": 1657.3200073242188,
      "text": " is greatly different than the outlook of the world"
    },
    {
      "id": 186,
      "start": 1657.3200073242188,
      "end": 1659.6600036621094,
      "text": " if you understand the Bible."
    },
    {
      "id": 187,
      "start": 1659.6600036621094,
      "end": 1661.239990234375,
      "text": " Because when you face that difficulty,"
    },
    {
      "id": 188,
      "start": 1661.6000061035156,
      "end": 1663.1600036621094,
      "text": " you understand that God's allowed it."
    },
    {
      "id": 189,
      "start": 1664.1000061035156,
      "end": 1664.9400024414062,
      "text": " Right?"
    },
    {
      "id": 190,
      "start": 1664.9400024414062,
      "end": 1665.760009765625,
      "text": " God has a plan."
    },
    {
      "id": 191,
      "start": 1665.760009765625,
      "end": 1669.0400085449219,
      "text": " He is in control."
    },
    {
      "id": 192,
      "start": 1669.0400085449219,
      "end": 1672.3200073242188,
      "text": " And we understand that he's, listen, he's a sovereign God."
    },
    {
      "id": 193,
      "start": 1672.3200073242188,
      "end": 1674.5199890136719,
      "text": " He's in control of all things."
    },
    {
      "id": 194,
      "start": 1674.5199890136719,
      "end": 1677.6399841308594,
      "text": " Whatever he's allowed in my life, he's permitted it,"
    },
    {
      "id": 195,
      "start": 1677.6399841308594,
      "end": 1679.7999877929688,
      "text": " he's allowed it, and not only has he allowed it,"
    },
    {
      "id": 196,
      "start": 1679.7999877929688,
      "end": 1682.260009765625,
      "text": " but he has a purpose in it."
    },
    {
      "id": 197,
      "start": 1683.5199890136719,
      "end": 1688.3599853515625,
      "text": " And that purpose may be to develop me."
    },
    {
      "id": 198,
      "start": 1688.3599853515625,
      "end": 1692.1399841308594,
      "text": " That purpose, no doubt, is to glorify him."
    },
    {
      "id": 199,
      "start": 1693.2799987792969,
      "end": 1694.9599914550781,
      "text": " But God has a purpose in it."
    },
    {
      "id": 200,
      "start": 1694.9599914550781,
      "end": 1697.2000122070312,
      "text": " So we begin to live life and we deal with those."
    },
    {
      "id": 201,
      "start": 1697.2000122070312,
      "end": 1700.239990234375,
      "text": " Listen, the world doesn't understand those concepts."
    },
    {
      "id": 202,
      "start": 1700.239990234375,
      "end": 1702.0799865722656,
      "text": " The world doesn't understand that there's a God"
    },
    {
      "id": 203,
      "start": 1702.0799865722656,
      "end": 1704.760009765625,
      "text": " who loves them, that has a plan in it,"
    },
    {
      "id": 204,
      "start": 1704.760009765625,
      "end": 1707.5400085449219,
      "text": " that has allowed it, that is seeking to develop them,"
    },
    {
      "id": 205,
      "start": 1707.5400085449219,
      "end": 1710.0400085449219,
      "text": " to grow them, and to glorify himself."
    },
    {
      "id": 206,
      "start": 1710.0400085449219,
      "end": 1712.5800170898438,
      "text": " But we, because we have this precious book,"
    },
    {
      "id": 207,
      "start": 1712.5800170898438,
      "end": 1714.5999755859375,
      "text": " we understand that."
    },
    {
      "id": 208,
      "start": 1714.5999755859375,
      "end": 1718.8400268554688,
      "text": " And we can say with Joseph, ye meant it unto evil,"
    },
    {
      "id": 209,
      "start": 1718.8400268554688,
      "end": 1721.4400024414062,
      "text": " but God meant it unto good."
    },
    {
      "id": 210,
      "start": 1722.6599731445312,
      "end": 1725.5599975585938,
      "text": " Because God is sovereign and God has a plan."
    },
    {
      "id": 211,
      "start": 1727.47998046875,
      "end": 1729.7999877929688,
      "text": " You know, there are times in which we can look"
    },
    {
      "id": 212,
      "start": 1729.7999877929688,
      "end": 1733.6799926757812,
      "text": " at some examples of God delivering"
    },
    {
      "id": 213,
      "start": 1733.6799926757812,
      "end": 1735.760009765625,
      "text": " and then we look at some other situations and say,"
    },
    {
      "id": 214,
      "start": 1735.760009765625,
      "end": 1739.1599731445312,
      "text": " I wonder why God didn't or doesn't heal that person"
    },
    {
      "id": 215,
      "start": 1739.1599731445312,
      "end": 1740.9000244140625,
      "text": " or change this circumstance."
    },
    {
      "id": 216,
      "start": 1741.6599731445312,
      "end": 1745.9000244140625,
      "text": " Because God is going to use it to bring glory to himself"
    },
    {
      "id": 217,
      "start": 1745.9000244140625,
      "end": 1750.0399780273438,
      "text": " in a manner in which is far beyond what would happen"
    },
    {
      "id": 218,
      "start": 1750.0399780273438,
      "end": 1753.02001953125,
      "text": " if he just dealt with the problem."
    },
    {
      "id": 219,
      "start": 1753.02001953125,
      "end": 1754.8200073242188,
      "text": " I was thinking this morning as I was teaching the lesson"
    },
    {
      "id": 220,
      "start": 1754.8200073242188,
      "end": 1756.219970703125,
      "text": " in Sunday school and I kind of ran out of time,"
    },
    {
      "id": 221,
      "start": 1756.219970703125,
      "end": 1760.1400146484375,
      "text": " but we dealt with the miracle there in Acts 3."
    },
    {
      "id": 222,
      "start": 1760.1400146484375,
      "end": 1761.9000244140625,
      "text": " You know, Acts 3 is recorded to take place"
    },
    {
      "id": 223,
      "start": 1761.9000244140625,
      "end": 1765.6599731445312,
      "text": " just 40 some days after the Lord Jesus Christ"
    },
    {
      "id": 224,
      "start": 1765.6599731445312,
      "end": 1768.260009765625,
      "text": " ascended or was crucified."
    },
    {
      "id": 225,
      "start": 1768.260009765625,
      "end": 1770.260009765625,
      "text": " He ascends to heaven 40 days later"
    },
    {
      "id": 226,
      "start": 1770.260009765625,
      "end": 1772.260009765625,
      "text": " and then they're there and they wait"
    },
    {
      "id": 227,
      "start": 1772.260009765625,
      "end": 1774.1799926757812,
      "text": " for the filling of the spirit, so on and so forth."
    },
    {
      "id": 228,
      "start": 1774.1799926757812,
      "end": 1776.0999755859375,
      "text": " So Acts 3 is happening just a short time"
    },
    {
      "id": 229,
      "start": 1776.0999755859375,
      "end": 1780.1799926757812,
      "text": " after the life and ministry of the Lord Jesus Christ."
    },
    {
      "id": 230,
      "start": 1780.1799926757812,
      "end": 1782.6199951171875,
      "text": " This man was above 40 years old."
    },
    {
      "id": 231,
      "start": 1782.6199951171875,
      "end": 1784.9600219726562,
      "text": " He was lame from his mother's womb"
    },
    {
      "id": 232,
      "start": 1784.9600219726562,
      "end": 1787.260009765625,
      "text": " and they laid him daily at the gate beautiful."
    },
    {
      "id": 233,
      "start": 1788.2999877929688,
      "end": 1790.0,
      "text": " You think Jesus ever went by him?"
    },
    {
      "id": 234,
      "start": 1791.3800048828125,
      "end": 1792.5800170898438,
      "text": " I think he probably did."
    },
    {
      "id": 235,
      "start": 1794.02001953125,
      "end": 1795.3800048828125,
      "text": " But Jesus never healed him."
    },
    {
      "id": 236,
      "start": 1797.9400024414062,
      "end": 1799.4000244140625,
      "text": " Why?"
    },
    {
      "id": 237,
      "start": 1799.4000244140625,
      "end": 1800.6799926757812,
      "text": " He healed a lot of people."
    },
    {
      "id": 0,
      "start": 1800.6799926757812,
      "end": 1805.5999927520752,
      "text": " But He never healed that man."
    },
    {
      "id": 1,
      "start": 1805.5999927520752,
      "end": 1810.439992904663,
      "text": " Maybe because He was going to allow it to happen when it did, because 5,000 people were"
    },
    {
      "id": 2,
      "start": 1810.439992904663,
      "end": 1813.239993095398,
      "text": " going to get saved as a result."
    },
    {
      "id": 3,
      "start": 1813.239993095398,
      "end": 1820.4799919128418,
      "text": " Listen, I'm not saying I know the mind of God, specifically as to why, but God did say,"
    },
    {
      "id": 4,
      "start": 1820.4799919128418,
      "end": 1824.1599922180176,
      "text": " let this mind be in you which is also in Christ Jesus, and we have the Word of God."
    },
    {
      "id": 5,
      "start": 1824.1599922180176,
      "end": 1828.9999923706055,
      "text": " I'm not trying to pretend this morning that I know exactly why God did or didn't heal"
    },
    {
      "id": 6,
      "start": 1828.9999923706055,
      "end": 1829.9999923706055,
      "text": " that man."
    },
    {
      "id": 7,
      "start": 1829.9999923706055,
      "end": 1834.7199935913086,
      "text": " I'm just suggesting to you that when we read the whole of Scripture and we see what's happening,"
    },
    {
      "id": 8,
      "start": 1834.7199935913086,
      "end": 1840.5999908447266,
      "text": " that there was a result because of what happened in Acts 3 that perhaps would not have happened"
    },
    {
      "id": 9,
      "start": 1840.5999908447266,
      "end": 1844.5999908447266,
      "text": " if Jesus would have just healed him on his way in one day."
    },
    {
      "id": 10,
      "start": 1844.5999908447266,
      "end": 1847.2399940490723,
      "text": " Our God, listen, He makes no mistakes."
    },
    {
      "id": 11,
      "start": 1847.2399940490723,
      "end": 1849.299991607666,
      "text": " His timing is not always our timing."
    },
    {
      "id": 12,
      "start": 1849.299991607666,
      "end": 1850.6799926757812,
      "text": " His ways are not our ways."
    },
    {
      "id": 13,
      "start": 1850.6799926757812,
      "end": 1852.359992980957,
      "text": " His thoughts are not our thoughts."
    },
    {
      "id": 14,
      "start": 1852.359992980957,
      "end": 1855.3199920654297,
      "text": " He far exceeds us."
    },
    {
      "id": 15,
      "start": 1855.3199920654297,
      "end": 1857.4599914550781,
      "text": " He transcends us."
    },
    {
      "id": 16,
      "start": 1857.4599914550781,
      "end": 1858.7799911499023,
      "text": " We recognize His greatness."
    },
    {
      "id": 17,
      "start": 1858.7799911499023,
      "end": 1860.3399925231934,
      "text": " We rejoice in His greatness."
    },
    {
      "id": 18,
      "start": 1860.3399925231934,
      "end": 1864.419994354248,
      "text": " Number three, we report His greatness."
    },
    {
      "id": 19,
      "start": 1864.419994354248,
      "end": 1865.4199905395508,
      "text": " We report His greatness."
    },
    {
      "id": 20,
      "start": 1865.4199905395508,
      "end": 1866.4199905395508,
      "text": " We tell others."
    },
    {
      "id": 21,
      "start": 1866.4199905395508,
      "end": 1872.9399948120117,
      "text": " We desire to report, to proclaim, to declare the greatness of God."
    },
    {
      "id": 22,
      "start": 1872.9399948120117,
      "end": 1876.6599960327148,
      "text": " We live, I mentioned by way of introduction, that we live in the midst of a generation"
    },
    {
      "id": 23,
      "start": 1876.6599960327148,
      "end": 1880.0799942016602,
      "text": " that are simply unaware of how great our God is."
    },
    {
      "id": 24,
      "start": 1880.0799942016602,
      "end": 1882.9399948120117,
      "text": " They have these weird twisted ideas of who God is."
    },
    {
      "id": 25,
      "start": 1882.9399948120117,
      "end": 1889.859992980957,
      "text": " They have this idea that is given to them by this culture that we live in, this worldview,"
    },
    {
      "id": 26,
      "start": 1889.859992980957,
      "end": 1891.979995727539,
      "text": " these things that are going around you."
    },
    {
      "id": 27,
      "start": 1891.979995727539,
      "end": 1896.0199890136719,
      "text": " Obviously, you have people groups within our nation and around the world that would claim"
    },
    {
      "id": 28,
      "start": 1896.0199890136719,
      "end": 1897.0199890136719,
      "text": " to be atheists."
    },
    {
      "id": 29,
      "start": 1897.0199890136719,
      "end": 1901.8199920654297,
      "text": " They deny entirely the existence of God, and you have others that have these weird ideas"
    },
    {
      "id": 30,
      "start": 1901.8199920654297,
      "end": 1906.5799942016602,
      "text": " about who God is, but God has given us His word, and He's told us, He's revealed to us"
    },
    {
      "id": 31,
      "start": 1906.5799942016602,
      "end": 1910.6999893188477,
      "text": " in the pages of Scripture who He is."
    },
    {
      "id": 32,
      "start": 1910.6999893188477,
      "end": 1914.239990234375,
      "text": " We don't rely on the Department of Education."
    },
    {
      "id": 33,
      "start": 1914.239990234375,
      "end": 1917.0599899291992,
      "text": " We don't rely on any other department of the government."
    },
    {
      "id": 34,
      "start": 1917.0599899291992,
      "end": 1923.6199951171875,
      "text": " We don't rely on Hollywood or any other group of people to reveal to us who God is."
    },
    {
      "id": 35,
      "start": 1923.6199951171875,
      "end": 1926.7799911499023,
      "text": " God has already revealed it to us."
    },
    {
      "id": 36,
      "start": 1926.7799911499023,
      "end": 1932.479995727539,
      "text": " For that, I am thankful, by the way, because not your idea of who God is versus your idea"
    },
    {
      "id": 37,
      "start": 1932.479995727539,
      "end": 1935.7799987792969,
      "text": " of who God is and your idea and your idea, and then let's get together and kind of figure"
    },
    {
      "id": 38,
      "start": 1935.7799987792969,
      "end": 1938.739990234375,
      "text": " out, well, which one makes, which one do we like the most?"
    },
    {
      "id": 39,
      "start": 1938.7799987792969,
      "end": 1942.1799926757812,
      "text": " No, God said, this is who I am."
    },
    {
      "id": 40,
      "start": 1942.1799926757812,
      "end": 1945.5,
      "text": " And see, this morning, we need to report."
    },
    {
      "id": 41,
      "start": 1945.5,
      "end": 1950.5399932861328,
      "text": " We need to tell others about how great our God is."
    },
    {
      "id": 42,
      "start": 1950.5399932861328,
      "end": 1952.979995727539,
      "text": " Notice what the psalmist continues to say in Psalm 145."
    },
    {
      "id": 43,
      "start": 1952.979995727539,
      "end": 1956.1399993896484,
      "text": " He said this, and His greatness is unsearchable."
    },
    {
      "id": 44,
      "start": 1956.1399993896484,
      "end": 1959.5399932861328,
      "text": " He's obviously acknowledged the understanding that God is great because he says in verse"
    },
    {
      "id": 45,
      "start": 1959.5399932861328,
      "end": 1961.4599914550781,
      "text": " 3, great is the Lord and greatly to be praised."
    },
    {
      "id": 46,
      "start": 1961.4599914550781,
      "end": 1970.5399932861328,
      "text": " Notice in verse number 4, one generation shall praise thy works to another and shall"
    },
    {
      "id": 47,
      "start": 1970.5399932861328,
      "end": 1975.8999938964844,
      "text": " declare thy mighty acts."
    },
    {
      "id": 48,
      "start": 1975.8999938964844,
      "end": 1981.3399963378906,
      "text": " Similar to what we read in Psalm 78, that generational influence and the opportunity"
    },
    {
      "id": 49,
      "start": 1981.3399963378906,
      "end": 1988.1799926757812,
      "text": " that we have to impact a future generation with regard to who God is, and we shall praise"
    },
    {
      "id": 50,
      "start": 1988.1799926757812,
      "end": 1990.219985961914,
      "text": " whose works, the works of God."
    },
    {
      "id": 51,
      "start": 1990.219985961914,
      "end": 1992.2999877929688,
      "text": " We shall declare His mighty acts."
    },
    {
      "id": 52,
      "start": 1992.2999877929688,
      "end": 1993.2999877929688,
      "text": " Notice verse 5."
    },
    {
      "id": 53,
      "start": 1993.2999877929688,
      "end": 1994.2999877929688,
      "text": " Notice what the psalmist says."
    },
    {
      "id": 54,
      "start": 1994.2999877929688,
      "end": 2000.8199920654297,
      "text": " I will speak of the glorious honor of thy majesty and of thy wondrous works."
    },
    {
      "id": 55,
      "start": 2000.8199920654297,
      "end": 2002.1399993896484,
      "text": " You know, we need to talk about God."
    },
    {
      "id": 56,
      "start": 2002.1399993896484,
      "end": 2006.2999877929688,
      "text": " It used to be a little song, I don't know, I haven't heard it in years, let's talk about"
    },
    {
      "id": 57,
      "start": 2006.2999877929688,
      "end": 2007.2999877929688,
      "text": " Jesus."
    },
    {
      "id": 58,
      "start": 2007.2999877929688,
      "end": 2012.3799896240234,
      "text": " We start talking about Jesus and start talking about who He is and what He's done and how"
    },
    {
      "id": 59,
      "start": 2012.3799896240234,
      "end": 2015.7799987792969,
      "text": " He's worked and so on and so forth, and He says, I'm going to speak."
    },
    {
      "id": 60,
      "start": 2015.7799987792969,
      "end": 2020.3399963378906,
      "text": " I will speak of the glorious honor of thy majesty and of thy wondrous works and men"
    },
    {
      "id": 61,
      "start": 2020.3399963378906,
      "end": 2023.259994506836,
      "text": " shall speak of the might of thy terrible acts."
    },
    {
      "id": 62,
      "start": 2023.259994506836,
      "end": 2028.3399963378906,
      "text": " Notice what He says, I will declare thy greatness."
    },
    {
      "id": 63,
      "start": 2028.3399963378906,
      "end": 2031.9399871826172,
      "text": " Isn't that a great statement?"
    },
    {
      "id": 64,
      "start": 2031.9399871826172,
      "end": 2034.8799896240234,
      "text": " It's a statement of commitment."
    },
    {
      "id": 65,
      "start": 2034.8799896240234,
      "end": 2036.8999938964844,
      "text": " It's a statement of determination."
    },
    {
      "id": 66,
      "start": 2036.8999938964844,
      "end": 2041.6599884033203,
      "text": " I will declare thy greatness."
    },
    {
      "id": 67,
      "start": 2041.6599884033203,
      "end": 2047.1399993896484,
      "text": " He doesn't put any type of parameters on it with regard to, I will declare thy greatness"
    },
    {
      "id": 68,
      "start": 2047.1399993896484,
      "end": 2049.5,
      "text": " so long as they want to hear it."
    },
    {
      "id": 69,
      "start": 2049.5,
      "end": 2051.5799865722656,
      "text": " I will declare thy greatness if they ask me."
    },
    {
      "id": 70,
      "start": 2051.5799865722656,
      "end": 2053.8599853515625,
      "text": " I will declare, no, no, there's no parameter."
    },
    {
      "id": 71,
      "start": 2053.8599853515625,
      "end": 2057.9400024414062,
      "text": " He just says, I will declare thy greatness."
    },
    {
      "id": 72,
      "start": 2057.9400024414062,
      "end": 2059.220001220703,
      "text": " Why?"
    },
    {
      "id": 73,
      "start": 2059.220001220703,
      "end": 2060.779998779297,
      "text": " Because it was in Him."
    },
    {
      "id": 74,
      "start": 2060.779998779297,
      "end": 2062.220001220703,
      "text": " He knew."
    },
    {
      "id": 75,
      "start": 2062.220001220703,
      "end": 2070.1799926757812,
      "text": " The psalmist knew how great God was, is, and says, I'm going to declare thy greatness."
    },
    {
      "id": 76,
      "start": 2070.1799926757812,
      "end": 2071.1799926757812,
      "text": " Why?"
    },
    {
      "id": 77,
      "start": 2071.699981689453,
      "end": 2076.259979248047,
      "text": " Because there's another generation that's coming up that needs to know how great God"
    },
    {
      "id": 78,
      "start": 2076.259979248047,
      "end": 2079.6199951171875,
      "text": " is and there's a generation that's going to follow them and a generation that's going"
    },
    {
      "id": 79,
      "start": 2079.6199951171875,
      "end": 2081.5399780273438,
      "text": " to follow them."
    },
    {
      "id": 80,
      "start": 2081.5399780273438,
      "end": 2087.1399841308594,
      "text": " And if we don't declare His greatness, listen, the humanistic worldview is that they want"
    },
    {
      "id": 81,
      "start": 2087.1399841308594,
      "end": 2091.6600036621094,
      "text": " to deny God so that in a generation or two there will be no more Christianity."
    },
    {
      "id": 82,
      "start": 2091.6600036621094,
      "end": 2095.2999877929688,
      "text": " I've read those quotes to you before from this pulpit."
    },
    {
      "id": 83,
      "start": 2095.2999877929688,
      "end": 2096.2999877929688,
      "text": " That's their idea."
    },
    {
      "id": 84,
      "start": 2096.2999877929688,
      "end": 2097.2999877929688,
      "text": " That's their worldview."
    },
    {
      "id": 85,
      "start": 2097.2999877929688,
      "end": 2100.1000061035156,
      "text": " That's their goal."
    },
    {
      "id": 86,
      "start": 2100.1000061035156,
      "end": 2106.0599975585938,
      "text": " So should not we as the people of God that know how great He is say with David, I will"
    },
    {
      "id": 87,
      "start": 2106.0599975585938,
      "end": 2108.699981689453,
      "text": " declare thy greatness."
    },
    {
      "id": 88,
      "start": 2108.699981689453,
      "end": 2111.6600036621094,
      "text": " You say, pastor, you know that it's 2023, you know that we live in the midst of people"
    },
    {
      "id": 89,
      "start": 2111.6600036621094,
      "end": 2113.6199951171875,
      "text": " that don't want to hear it."
    },
    {
      "id": 90,
      "start": 2113.6199951171875,
      "end": 2116.019989013672,
      "text": " God's great."
    },
    {
      "id": 91,
      "start": 2116.019989013672,
      "end": 2120.1799926757812,
      "text": " You ever experienced something that's so great that you just can't help but talk about it?"
    },
    {
      "id": 92,
      "start": 2120.1799926757812,
      "end": 2121.1799926757812,
      "text": " Ribs."
    },
    {
      "id": 93,
      "start": 2121.1799926757812,
      "end": 2122.1799926757812,
      "text": " Amen."
    },
    {
      "id": 94,
      "start": 2122.1799926757812,
      "end": 2127.3399963378906,
      "text": " Some of y'all are hungry already, amen."
    },
    {
      "id": 95,
      "start": 2127.3399963378906,
      "end": 2132.220001220703,
      "text": " I mean, you get a good something to eat somewhere, a good whatever, Mark's ready for some ribs"
    },
    {
      "id": 96,
      "start": 2132.220001220703,
      "end": 2137.459991455078,
      "text": " evidently because he said ribs, but you tell somebody about, let me tell you about this"
    },
    {
      "id": 97,
      "start": 2137.459991455078,
      "end": 2141.0599975585938,
      "text": " meal I had, let me tell you about this experience I had, let me tell you about this place, whatever"
    },
    {
      "id": 98,
      "start": 2141.0599975585938,
      "end": 2142.459991455078,
      "text": " it might be."
    },
    {
      "id": 99,
      "start": 2142.459991455078,
      "end": 2150.1000061035156,
      "text": " Listen, none of that even pales in comparison to how great our God is."
    },
    {
      "id": 100,
      "start": 2150.1000061035156,
      "end": 2154.8999938964844,
      "text": " I mean, that's a temporary meal that's going to satisfy you for just a little while and"
    },
    {
      "id": 101,
      "start": 2154.8999938964844,
      "end": 2161.0599975585938,
      "text": " then you're going to have to eat again, right?"
    },
    {
      "id": 102,
      "start": 2161.0599975585938,
      "end": 2166.1399841308594,
      "text": " Taste and see that the Lord is good, that's what David says, he says the Lord is great."
    },
    {
      "id": 103,
      "start": 2166.1399841308594,
      "end": 2174.1799926757812,
      "text": " This morning, I hope that throughout this year that we are so consumed with how great"
    },
    {
      "id": 104,
      "start": 2174.1799926757812,
      "end": 2182.8999938964844,
      "text": " our God is that we recognize His greatness and then we respond to His greatness by praising"
    },
    {
      "id": 105,
      "start": 2182.8999938964844,
      "end": 2193.5799865722656,
      "text": " Him and by telling others about Him because it's just so in me of how great my God is"
    },
    {
      "id": 106,
      "start": 2193.5799865722656,
      "end": 2200.279998779297,
      "text": " that I just have to tell somebody about how great He is."
    },
    {
      "id": 107,
      "start": 2200.279998779297,
      "end": 2205.5399780273438,
      "text": " This morning, great is the Lord and greatly to be praised."
    },
    {
      "id": 108,
      "start": 2205.6600036621094,
      "end": 2213.8599853515625,
      "text": " I'm so thankful that God has revealed to us, He's declared it in His Word, but He's demonstrating"
    },
    {
      "id": 109,
      "start": 2213.8599853515625,
      "end": 2216.8999938964844,
      "text": " His Word, He's demonstrating it in our own lives."
    },
    {
      "id": 110,
      "start": 2216.8999938964844,
      "end": 2221.8999938964844,
      "text": " This morning, we need to rejoice and then we need to report how great our God is."
    },
    {
      "id": 111,
      "start": 2221.8999938964844,
      "end": 2222.8999938964844,
      "text": " Let's pray together."
    },
    {
      "id": 112,
      "start": 2222.8999938964844,
      "end": 2224.1000061035156,
      "text": " Father, we love You."
    },
    {
      "id": 113,
      "start": 2224.1000061035156,
      "end": 2226.699981689453,
      "text": " We thank You for loving us."
    },
    {
      "id": 114,
      "start": 2226.699981689453,
      "end": 2228.8200073242188,
      "text": " How we thank You for the Word of God."
    },
    {
      "id": 115,
      "start": 2228.8200073242188,
      "end": 2232.220001220703,
      "text": " We thank You that You're a great God."
    },
    {
      "id": 116,
      "start": 2232.220001220703,
      "end": 2236.3399963378906,
      "text": " There's none like You."
    },
    {
      "id": 117,
      "start": 2236.3399963378906,
      "end": 2244.0599975585938,
      "text": " I pray that this year, I pray that this morning in this message that we've been encouraged"
    },
    {
      "id": 118,
      "start": 2244.0599975585938,
      "end": 2246.3800048828125,
      "text": " about how great You are."
    },
    {
      "id": 119,
      "start": 2246.3800048828125,
      "end": 2255.1000061035156,
      "text": " I pray that we've been challenged to let somebody else know about how great You are."
    },
    {
      "id": 120,
      "start": 2255.1000061035156,
      "end": 2258.1000061035156,
      "text": " We thank You for Your great salvation."
    },
    {
      "id": 121,
      "start": 2258.1000061035156,
      "end": 2266.0599975585938,
      "text": " It's available through the Lord Jesus Christ, the only way for man to be saved."
    },
    {
      "id": 122,
      "start": 2266.0599975585938,
      "end": 2270.97998046875,
      "text": " Lord, if there's one here that's not sure of heaven, I pray that today they'd understand"
    },
    {
      "id": 123,
      "start": 2270.97998046875,
      "end": 2274.1799926757812,
      "text": " their need for Christ."
    },
    {
      "id": 124,
      "start": 2274.1799926757812,
      "end": 2278.6199951171875,
      "text": " I pray they'd be saved before they leave this place, before they tune off of live stream."
    },
    {
      "id": 125,
      "start": 2279.5799865722656,
      "end": 2289.3399963378906,
      "text": " Lord, I pray for every child of God that we'd have a renewed view of just how great You"
    },
    {
      "id": 126,
      "start": 2289.3399963378906,
      "end": 2298.8200073242188,
      "text": " are, that we'd have a determined commitment to declare Your greatness, to praise You for"
    },
    {
      "id": 127,
      "start": 2298.8200073242188,
      "end": 2305.779998779297,
      "text": " who You are, to talk by glorious power, by mighty acts."
    },
    {
      "id": 128,
      "start": 2305.9400024414062,
      "end": 2311.97998046875,
      "text": " Lord, I pray that in these moments of invitation, as we have opportunity to respond to how Your"
    },
    {
      "id": 129,
      "start": 2311.97998046875,
      "end": 2317.3800048828125,
      "text": " Spirit has spoken to us through Your Word, I pray, God, that decisions would be made"
    },
    {
      "id": 130,
      "start": 2317.3800048828125,
      "end": 2320.8200073242188,
      "text": " that would endure, that would cause us to be conformed to the image of Christ to impact"
    },
    {
      "id": 131,
      "start": 2320.8200073242188,
      "end": 2321.8200073242188,
      "text": " eternity."
    },
    {
      "id": 132,
      "start": 2321.8200073242188,
      "end": 2326.5800170898438,
      "text": " Move and work as only You can, and we'll give You the honor and glory for it's in Christ's"
    },
    {
      "id": 133,
      "start": 2326.5800170898438,
      "end": 2327.4199829101562,
      "text": " name we pray."
    }
  ],
  "processed_at": "2025-04-16T11:13:51.812658"
}