{
  "video_id": "L3vRRtbMBBw",
  "text": "We have not been in the book of Hebrews, but we are planning have been working through the book of Hebrews here in 2020 with our theme being looking unto Jesus. I'm so thankful. I've had so many opportunities to speak with people during this pandemic that have been fearful and concerned and all sorts of things and I've been able to share with them how in September of 2019 God led me to this theme looking unto Jesus for 2020 of course, I had no idea what 2020 was going to hold but God did and I've told people this many times You've heard me say it even during the services We can have the peace of God which passeth all understanding not because we have our head in the sand but because we have our eyes on our Savior and I'm so thankful to know that he is in control when it seems like everything is out of control It's good to know the one that is in control Amen, and what a blessing to know that he sits upon his throne. He rules and reigns. He is the Lord God Omnipotent Hebrews chapter number six. We'll be looking at verses 9 through 12 Hebrews 6 verses 9 through 12. The Bible says this but beloved We are persuaded better things of you and things that accompany salvation Though we thus speak for God is not unrighteous to forget your work and labor of love which you have showed toward his name and that you have ministered to the Saints and Do minister and we desire that every one of you do show the same diligence to the full assurance of hope Unto the end that you be not slothful but followers of them who through faith and patience Inherit the promises you notice in our text of Scripture here in Hebrews 5 verse number 11 Down through really the entirety of chapter number 6 we've been dealing with this warning passage we mentioned that the warning passage initially dealt with a a Confronting of those that were being written to they were confronted about what they were confronted about their spiritual immaturity They had not been growing in the time that you ought to be teachers You have need that one teach you is what they were told and so we find that they are confronted about their spiritual immaturity and then they are Challenged to go on to perfection to grow spiritually to become mature in Christ and what a blessing to understand the Importance of growth as a believer and obviously in the last portion of Hebrews 6 that we studied several weeks ago In fact, it was the first Sunday of the month of May We dealt with the passage of Scripture of go on to spiritual maturity We took several minutes in that message to deal with the use of pronouns throughout the passage to understand how the text of Scripture was being written and we come to the text that we're dealing with this morning and we find in verse number 9 there's that great conjunction but Beloved and so we find that the writer of Hebrews is now Addressing this group of people these believers that the warning initially was given to in chapter number 5 in verses 11 14 listen a lost person is not challenged with growing spiritually a lost person is challenged with conversion and Then as you're saved you're to go on to spiritual maturity And so as we look at the text of Scripture that is before us this morning I've titled the message from verse number 9 things that accompany Salvation things that accompany salvation I'm mindful of what the Apostle Paul said to the church in Thessalonica and we've often referenced the church in Thessalonica and we've spoken about the fact that this is a model church a church that was exhibiting spiritual character in growing Paul says this in 1st Thessalonians 1 in verse number 3 Remembering without ceasing Your work of faith and labor of love and patience of hope in our Lord Jesus Christ in the sight of God and our Father as he writes to them in the second epistle again In chapter 1 in verse number 3. He says we are bound to thank God always for you brethren as it is me Why because that your faith groweth? Exceedingly and the charity of every one of you all toward each other Aboundeth do you notice those words as he writes the second epistle? He writes the first letter He says I'm thankful for these things. But as he writes the second letter, he notes progress He notes the fact that he says that you your faith grow with Exceedingly and then he says of their love that they have one toward another that it aboundeth Those are words that describe progress that describe growth and we'd understand in the Christian life that there ought to be Progress there ought to be growth there ought to be things that accompany salvation number one if you're taking notes notice the evidence of conversion the evidence of conversion the The writer says but beloved we are persuaded of better things of you notice and things that accompany Salvation the things there's a just a couple that are listed here in in Hebrews chapter number six But we understand as we study the whole of Scripture that you could certainly develop a more robust List of what I often refer to as birthmarks of a believer. There are signs There are evidences of life. In fact, there are evidence of evidences of life in you physically speaking even now Right, you're sitting up you're breathing your eyes are open most of you but the reality is there are evidences of life right and so as a Believer there ought to be some birthmarks of the believer. There ought to be some evidences Some have said this over the years some preachers of yesteryear have noted the truth of the birthmarks of believers in the evidence of conversion and they've often asked this question if You were charged in a court of law and the crime that you were charged of was being a Christian Would there be enough evidence to convict you? That's a good thought. I like the thought I'm not a lawyer I don't want to talk to too many more lawyers Except for brother Michael. Amen, but the reality is that we wonder is there the evidence? Is it there? Does it support the claim see it's easy for somebody to say I'm a Christian It's Another thing to have evidence of conversion The Bible tells us in 2nd Corinthians 5 in verse number 17 if any man be in Christ He is a new creature old things are passed away behold All things are become new the Bible tells us in 1st Peter 2 in verse number 2 as newborn Babes desire the sincere milk of the word that you may grow thereby And we look at the passage of Scripture and deal with the specific nature of what the Evidences are that they speak of and he says the things that accompany salvation Though we thus speak notice in verse number 10 for God is not unrighteous number one to forget your work And so we notice the evidence of conversion would be their service their work for the Lord now It's important for us to understand that works cannot save you It's absolutely impossible The only thing that can save us is the blood of Jesus Christ his death burial and glorious resurrection The gospel as we often refer to it, but we understand this morning that our works or our service for Christ They reveal our Position in Christ if you study the book of Ephesians, which we did in 2019 as a church family I preached the entire book on Sunday mornings through the book of Ephesians And you find that in the first few chapters. In fact, the first three chapters of Ephesians deal with Establishing your position in Christ who we are in Christ these believers that Paul is writing to in Ephesus he had ministered there and he was Reminding them of their conversion and reminding them of their position in Christ He says this in Ephesians 2 verses 8 and 9 for by grace Are you saved through faith and that not of yourselves? It is the gift of God not of works lest any man should boast Unless we forget so many people think that Paul and James are contrary one to the other. They actually Work perfect in unity one with the other Paul is dealing with the root of salvation James is dealing with the fruit of salvation But you must understand and acknowledge this morning that though the Apostle Paul deals with the root of salvation He often speaks about the fruit of salvation in the very next verse in Ephesians 2 in verse number 10 He says for we are his workmanship Created in Christ Jesus unto good works. Oh Paul used the word good works Yeah, but he says that's what that's the evidence of salvation that helps us to understand And to reveal our position in Christ He says that we are his workmanship created in Christ Jesus unto good works What's God hath before ordained that we should walk in? Them it's interesting that in the first three chapters of the book of Ephesians Paul spends much time Helping to establish their position in Christ But if you get into chapters 4 5 & 6 you notice on five occasions What does Paul reference their walk? Their walk their behavior. I said often as we studied the book of Ephesians in 2019, that as Paul gets into the latter part, the second half of the book of Ephesians, he's not telling these people, it's important to understand this, two important truths. He's not telling them, these are the things you do to be saved, nor is he telling them, these are the things that you do to stay saved. No. He's telling them, these are the things that you do because you are saved. These are the evidences of salvation. Your work in the book of Titus, on a number of occasions, it's a short letter, just a few chapters, and we find that as Paul is writing to Titus and he's giving instruction with regard to the work at Crete and that which Titus was responsible for, you know that on a number of occasions in that book he references good works? He says this in Titus 2 in verse number 7, in all things showing thyself a pattern of good works in doctrine, showing uncorruptness, gravity, sincerity, sound speech that cannot be condemned, that he that is of the contrary part may be ashamed having no evil thing to say of you. Remember, we sing the song, there's been a great change since I've been born again. We sing it with the kids, right? We ought to sing it as adults. The things I used to say, I don't say them anymore, right? What does it say here in verse number 8? Sound speech that cannot be condemned. The things I used to say, I don't say them anymore. The things I used to do, I don't do them anymore. The place I used to go, I don't go there anymore. Why? There's been a great change since I've been born again. Praise the Lord for conversion. He says a little bit later here in the book of Titus, and look in verse number 14, who gave himself for us that he might redeem us from all iniquity and purify unto himself a peculiar people zealous of good works. But you notice in chapter number 3, in verse number 5, that Paul also says, not by works of righteousness which we have done, but according to his mercy he saved us. There's no contradiction. It's the evidence of salvation, our work, our service. He will say in verse number 14, nearing the end of the book of Titus of chapter 3 and verse 14, and let ours also learn to maintain good works for necessary uses that they be not unfruitful. It's interesting if you were to read about the seven churches in Asia in Revelation 2 and 3, in each of the letters that are written to those seven churches, you find that God says through John, I know thy works. I know thy works. Every church that's mentioned in Revelation 2 and 3, all seven of those churches in Asia, God says, the Lord Jesus Christ says, I know thy works. Notice what the writer of Hebrews says to these believers that he's writing to. He says, these things that accompany salvation, the first one he says, for God is not unrighteous to forget your work. The first evidence of salvation that is dealt with here in Hebrews 6 is our service to our God. You know, as a believer, there are many things that happen at the time of conversion, and most of us, the day in which we got saved, we probably didn't understand all of those things that happened on that day. But as we've grown in Christ, we've learned some of those things that happen. The wonderful truth of conversion and understanding that our bodies, we're the temple of the Holy Spirit which is in us, right? We've been indwelled by the Spirit of God which is the proof of our salvation according to Ephesians 1, and we find that the Bible speaks about the fact that we have been given gifts, spiritual gifts. Every believer has been equipped by God Almighty with a spiritual gift. Why? For the work, for the work of the ministry. Paul told the same group of people that we've referenced multiple times here in the church at Ephesus, he told them in chapter number 4 and verse number 11, and he gave some apostles and some prophets and some evangelists and some pastors and teachers for the perfecting of the saints' notice for the work of the ministry. Everybody doing their part. We speak about many hands make light work, but we think about the way in which the Holy Spirit of God has gifted the church, and we find that God uses the illustration of the human body. I'm thankful that I have a right hand and a left hand. My left hand's a little bit behind because I'm right-handed, and sometimes I say this hand doesn't do what I want it to do, but I'm really glad I don't have two right hands. Amen? And you can think about the way that God has designed our bodies, and we understand the illustration of the body of believers, the church, and how God has individually gifted every believer. Why? For the work. The purpose of your spiritual gift is not so you can use it for yourself, it's that you use it in the church for the glory of God. I often think about the Old Testament illustration in the book of Exodus. In fact, I'll be looking at Exodus chapter 40 this evening as what I'll be preaching from, but if you look in all of that passage at the end of the book of Exodus dealing with the construction of the tabernacle, there's a man by the name of Bezalel, and Bezalel was gifted by God for all of that work that God had instructed Moses to do. I'll be honest with you, if I was Moses receiving all of that instruction with all of those pieces of furniture, it's just going right over my head. And then God says, Bezalel, I've equipped him, I've gifted him for this purpose. Bezalel wasn't to use that which God equipped him with to go out and use it somewhere else for something else. No, for the work that God had given him to do. So we find that the writer of Hebrews' first evidence of conversion is that of our service. Notice number two, the Bible says there in verse number 10 back in Hebrews 6, for God is not unrighteous to forget your work, notice, and labor of love, and labor of love, which ye have showed toward his name, and that ye have ministered to the saints, and do minister. You know what's interesting about verse number 10? He speaks about their work, their service, he speaks about their labor of love, but then he shows us that love is an action. He says, which ye have showed toward his name, and that ye have ministered to the saints, and do minister. Your labor of love. One of those five walks that Paul gives to the church in Ephesus in chapters 4, 5, and 6 is found in Ephesians 5 in verse number 2, and here's what it is. Walk in love. Ephesians 5 in verse number 2. See, we're to love God. By the way, if you don't love God like you should, you're never gonna love others like you should. But we're to love God. Why do we love him? Well, according to 1st John 4 and verse number 19, I love him because he first loved me. What a blessing to know the love of God. The truth that God so loved the world, the truth that God commendeth his love toward us. I'm thankful that he didn't simply declare his love, but then he demonstrated his love for us, and we understand that we're to love God. You know, the thing that's interesting is, just as I mentioned, that it's easy to say, I'm a Christian, but there ought to be some evidences. It's easy to say, I love God. But there's a Bible test. It's not my test. It's God's test. If you love me, keep my commandments. Right? Now what the Bible says? That's not my test. That's God's test. So if you say, I love God, there's a way for you to understand biblically whether you really do love God. In 1st John chapter number 5, it's interesting, we see that truth in John 14 and verse number 15, if you love me, keep my commandments. But in 1st John 5 and verse number 3, the Bible says, for this is the love of God, that we keep his commandments. And then it says this, and his commandments are not grievous. We understand that the love of God is best described not as being permissive, but as being protective. And that's important for us to understand. See, I love my children, and I show my love for my children. I love my wife. I show my love for my wife. But my love for my children, if I could use that illustration specifically, is a protective love. I'm not gonna go let them do whatever they want to do. Now they're older now. They're 13, 15, and 17. And so it's not quite as easy of an illustration. But the reality is that we didn't let them go stick a fork in the outlet when they were little toddlers because they wanted to. Well, I love them, and so I'm just gonna let them do what they want to do, because love is permissive. They'd lock you up somewhere, right? I mean, you endangered your child. No, no, love is protective. Because I love you and I understand the danger, therefore I'm gonna protect you from that. You know that God knows more than you? That shouldn't be a surprise to any of us, amen? God knows more than you. He knows more than I do. He knows more than all of us collectively. And you know when God has given us His Word and He said thou shalt not? He does it because He loves us. He's trying to protect us. And what a blessing that is. We understand that God's given us this truth with regard to our love for Him. But it's interesting, I mentioned this just a moment ago, and here's the Bible verse that supports it in 1 John chapter 4, in verse number 20. Yes, we ought to first love God, but the Bible says this, if a man say I love God and hateth his brother, he is a liar. I mean, that's straight language, amen? to the point he is a liar for he that loveth not his brother whom he hath seen how can he love God whom he hath not seen and we find that when we think about our labor of love as the writer of Hebrews is dealing with this evidence of conversion not only your service and your work but your labor of love you understand it's yes first and foremost our love for God but number two our love for the brethren Jesus in John 13 he said by this shall all men know that you're my disciples by what by your love one for another by your love one for another we find as I mentioned earlier about the church in Thessalonica and the way in which you saw their progress and you saw their growth and he said in 2nd Thessalonians 1 and verse number 3 that their love aboundeth and you see that growth that is taking place there and what a blessing that is what we understand in 1st Thessalonians chapter number 4 that here's what Paul says concerning brotherly love in 1st Thessalonians 4 verse 9 and 10 it says but as touching brotherly love ye need not that I write unto you for ye yourselves are taught of God to love one another and then notice this great commendation in verse number 10 of 1st Thessalonians 4 and indeed ye do it toward all the brethren which are in all Macedonia but we beseech you brethren notice that ye increase more and more you're already loving the brethren that's good you're supposed to Jesus said that's how we're gonna know or others are gonna know that you're my disciples by your love one for another in John 13 in verses 34 and 35 and Paul says you're already doing it but I would that you would increase more and more and then he sends the second letter and says the charity of every one of you all toward each other aboundeth isn't that awesome see the model in the church in Corinth isn't the model we're trying to follow divisions and envyings and strife no that's that's immaturity that's spiritually immature he says I can't speak to you as unto spiritual but unto carnal and see we find here in the book of Hebrews the the challenge that we're dealing with is to go on to spiritual maturity and he says to them there are some things that should accompany conversion he references their work their service their labor of love I wonder this morning is there evidence in your life of being born again see I really believe that as we look at these two verses of Scripture in Hebrews 6 9 and 10 and we think about the evidence of conversion I believe that this evidence of conversion and what the the writer of Hebrews is dealing with here here leads us to an examination see I want to know as I evaluate and examine my own life are there evidences of conversion and the child of God should be interested in knowing hey is there anything in my life that would give evidence that I'm a child of God notice this exhortation to conclude the book of 2nd Corinthians you don't need to turn there I'll read it for you but in 2nd Corinthians chapter 13 in verse number 5 the the Apostle Paul says this to these believers he says examine yourselves whether ye be in the faith prove your own selves know ye not your own selves how that Jesus Christ is in you except you be reprobates the reality is that this exhortation in 2nd Corinthians 13 to examine themselves really I believe is an important exhortation in light of what we read here in Hebrews chapter number 6 is there evidence of conversion it's not for me necessarily to examine although the Bible says by their fruit you shall know them but really the admonition here is for you to examine yourself are there evidences of conversion in your life I hope that you can say yes there are I hope that these believers here that are being written to in the book of Hebrews that as they receive as they come to the sixth chapter as we have the division in our Bible that they would have this time of looking at these evidences and saying that they would do this evaluation this examination if you will the text continues in verses 11 and 12 we see first of all if you're taking notes the evidence of conversion but now I want you to see in verses 11 and 12 the expectation to continue we see that consistent throughout the Word of God we mentioned already there in the book of 1st and 2nd Thessalonians how that the Apostle Paul is encouraging those believers to press on to continue we find that in John 8 in verse number 31 Jesus said if you continue in my word then are you my disciples indeed and so there's an expectation to continue you understand this very important truth this morning that you never arrive in the Christian life we ought to always be moving forward in our growth why because we're to be like Jesus and Jesus is perfect he left us an example according to what Peter said that we should follow his steps and what a blessing to understand that progress that we make daily as we walk with God listen I don't I can't even tell you I wish I would have kept track years ago on how many times I've read through the Bible I'd never I just never kept track of it so I can't tell you how many times I've read through the Bible but it's not enough I read it every day every day I want more of it I want more of it I want more of it there are plenty of books that I've read once and I've never opened them again plenty there are some that I've opened and I've never finished maybe some of you can relate there are a handful of books that I have reread that I've said you know what this is a good book it's a good reminder this is something that I need to add to my annual reading list I have a couple of books like that but there's no book that even comes close to how often I read this book Clarence Sexton said don't get your theology from some textbook get it from the Bible that's a good truth and I'm thankful for the books that people have written I'm thankful for the information that is out there but if I spend too much time reading that and not enough time reading this I'm in trouble I need the Bible and so we're continually making that progress notice what he says in verse number 11 and we desire you see this desire on the part of the spiritual leader for the the followers to continue and to make that progress I mentioned as we started this warning passage in Hebrews 5 in verse number 11 when the writer said of whom we have many things to say and hard to be uttered seeing your dull of hearing it wasn't that the teacher had a hard time giving the truth it was that the teacher understood the student wasn't ready for it they were dull of hearing and as we understand the the heart and the concern of the spiritual leader to give truth to fulfill the Great Commission not only to preach the gospel and to baptize but to teach them all things and we understand here that he says we desire that every one of you do show notice what he says the same diligence to the full assurance of hope unto the end now that's a lot of truth in there and the reality is that we ought to as we understand this truth of continuing and this expectation to continue that we find that we're to continue notice unto the end until you're taken to glory you ought to be growing in your Christian walk amen every day you ought to be growing we never arrive we make progress day by day I've said often over the years that you're as close to God today as you really want to be the one that is the youngest spiritually in our midst could be the most spiritual in our midst we ought to be making progress every day and you notice these as we desire that anyone every one of you notice what he says do show the same diligence he says in verse number 12 that you be not slothful you put those thoughts together and you understand there's a purpose that the individual has if you read the book of Psalms and it's a wonderful encouraging thing as you read through all of the Psalms but something that you'll notice as you read through the book of Psalms that oftentimes you find these statements of the psalmist I will I will I will and they're these purposed statements of some things that the psalmist says he's going to do and the importance as we understand our lives that we have this diligence that we're not slothful that we understand listen there's some effort that we need to put into this thing of growing spiritually I remember when I was a kid and I I remember so I don't even know who it was some probably my brother because he's always trying to tell a story but somebody was talking about how you could sleep on a on a textbook and by osmosis you would just get the stuff right how like that's a really good idea you know what it's not true right I mean it just doesn't work but but the reality is that if I want to grow in my walk with Christ I gotta put some effort into it if you want any relationship to grow you've got to put effort into it. There's got to be an investment. If I want my marriage to be what it needs to be, if our relationship is going to be what it needs to be, I need to be making some investment, some purposed investment in our relationship. If I want relationship with my kids and I want that to be what it ought to be, I need to invest in it. I need to purpose in that relationship. I'm thankful that I have a relationship with God that is constant. He's my Father and I am His child and what a blessing that is. When we think about the truth of fellowship in our walk with God, we need to invest in it. We need to spend time, right? You know what the greatest investment is that you can make in your relationships with your spouse and with your children is time. One of the early presidents of the United States of America, he took a day to go and spend with his son and to go fishing. Both of them took journals. It was a daily routine in their lives to have journal and to journal through things. And the president of the United States after that day said, went fishing with my boy, a day wasted. That's what he said. On the very same day in the journal of the son, went fishing with my dad, best day of my life. Does that give you some perspective? Time. It takes time to read the Bible. It takes time to pray. It just does. My dad, years ago, I think it was in 1998, I was a senior in high school and I remember he was given a devotion in our church in California to the men at a men's prayer breakfast and I remember him using an illustration of a book that he saw. I don't think he bought it, but it was a book that he saw at a Christian bookstore and it said how to pray in nine minutes and 59 seconds or less. And it was just this idea of this fast-paced society, right? And he used his illustration, really in the negative context of the illustration. Why? Because we need to labor in prayer. The effectual fervent prayer of a righteous man availeth much, our God hears and answers prayer. And we find that there's this investment. He says, continue unto the end. I think about this truth, run your race. In Hebrews chapter number 12, we have as our theme, verse number two, looking unto Jesus, the author and finisher of our faith, but we find that in verse number one of Hebrews chapter number 12, it says, wherefore seeing also we are compassed about with so great a cloud of witnesses, let us lay aside every weight and the sin which doth so easily beset us and let us run with patience the race that is set before us. Looking unto Jesus, the author and finisher of our faith, who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God. We need to run our race. Faithful unto the end. Some have said over the years, they didn't start well, but they finished well. I like that. I wanna finish well. I wanna be able to say, as Paul said, I finished my course. But you know, that didn't happen by accident. If you study the life of Paul, and you were to look at 2 Timothy chapter number four in verses seven and eight, when he says to Timothy, his son in the faith, the time of my departure's at hand. And he says, I have finished my course. If you look back in chapter number 20 of the book of Acts, and you see as the apostle Paul is speaking to the Ephesian elders, he says to them that I might finish my course with joy. It was a desire that Paul had. He didn't just end up finishing strong or finishing well. He purposed to finish well. There's some decisions he had to make along the way to accomplish that which he set out to accomplish. So thankful that God helps us along the way. We think about this expectation to continue, and we find that it was to continue unto the end. But we also notice in verse number 12, look what he says, that ye be not slothful, notice this, but followers of them who through faith and patience inherit the promises. Now, we find that he talks about here, but be followers of them. Who's them? Who through faith and patience inherit the promises. You know, there are many examples for us to follow. In fact, as we look at this thought of faith and patience that is listed here, in just a few chapters, you're gonna come to Hebrews chapter number 11. We often speak of Hebrews chapter number 11 as being a hall of faith chapter. By faith, this one did this. By faith, this one did this, right? And you find you get to the end of the chapter, and he says, we don't have enough time. And so he just kind of wraps up quickly a number of things. The people that he's going to reference, but you find that in Hebrews chapter number 11, he said there's some examples to follow. Who through faith and patience inherit the promises. I think about the example of the Apostle Paul. We've mentioned him often today. He said to the believers in Corinth, be followers of me, even so as I am of the Lord. See, the Apostle Paul followed the Lord Jesus Christ. And therefore, he could say, be followers of me. He wasn't trying to get a group of people to follow him and start his own thing. No, he was saying, I can be an example for you. We find that he says in Philippians in chapter number four, in verse number nine, with regard to the admonition to the believers in Philippi, he says those things which you have both learned and received and heard, but then he says this, and seen in me, do. The God of peace shall be with you. It's interesting as I think about the many examples that we have to follow, and I think about this truth in Hebrews chapter number six in verse number 12. He talks about but followers of them who through faith and patience inherit the promises. The reality is that if you stay within the context of the book of Hebrews and you come to the final chapter in chapter number 13 in verse number seven, I want you to notice what is said with regard to one group, at least of folks that ought to be a good example to follow. He says in verse number seven of Hebrews 13, remember them which have the rule over you, who have spoken unto you the word of God. Notice this, whose faith follow, considering the end of their conversation, their lifestyle, their behavior, whose faith follow. The one being spoken of in Hebrews 13 in verse number seven is the spiritual leader, the pastor if you will, that they have spoken unto you the word of God and whose faith follow. You know, it ought to be that the message of the lips matches the message of the life. Or maybe I should say that the other way around, that the message of our life matches the message of our lips. Solomon said, my son, give me thine heart and let thine eyes observe my ways. Now we know that Solomon wasn't a great example. You study his life and of course many errors in his life. Though he had great wisdom. And the reality today is that we find that he speaks about this at the end of Hebrews 13 about the example and whose faith follow. It's interesting if you couple this truth with the challenge that the Apostle Paul gave to Timothy in first Timothy in verse number 12 of the fourth chapter, he says that you're to be an example of the believers. Why didn't he tell Timothy to be an example? Whose faith follow. Timothy was gonna be in that place of being a spiritual leader. And he said, Timothy, you're an example to these believers. And we think about this passage of scripture, things that accompany salvation. See, there are, there should be in your life evidences of conversion. There should be. We can examine ourselves and say, are there any evidences in my life that I belong to Christ? No, we're not gonna be perfect. We understand that. But there ought to be some signs of life spiritually. There ought to be some birthmarks of a believer. And then there's an expectation to continue. That we continue to walk with God. We see that he speaks about continuing unto the end. We see that he speaks about the example follow, to be followers of them who through faith and patience inherit the promises. And I wonder this morning as we conclude our message, we've mentioned several that are examples for us to follow. But I wonder and I would ask you, I've asked myself the question and I want you to ask yourself the question this morning as well. Who can look at your life as an example to follow? Is there someone that you could say, as Paul did, be followers of me? That you would so closely follow the Lord Jesus Christ that your life would be worth, that would be that example that would be worth following. I hope that you can say yes. Many times in life in various venues and settings, I have observed individuals, parents to be specific, who are embarrassed by some of the behavior. of their children. Have you? And sometimes the parent that's embarrassed says something like this, I have no idea where they learned that. And you just kind of chuckle and say, hmm, I got a pretty good idea where they probably learned that. What do children do? They follow the examples. Spiritually speaking, we're to be an example. There's some people, some examples that we can follow. And we ought to be an example for others to follow. And it doesn't always have to be somebody that's younger. Because spiritually speaking, the youngest again among us can be the most spiritual and can be one of the best examples. Amen? And so this morning, things that accompany salvation, are there evidences of conversion? You need to know that for yourself. Examine yourself. Am I in the faith? Yes, I've been born again. And there are evidences of conversion in my life. And then there's this expectation to continue. Don't give up. Yea, all those that live godly in Christ Jesus shall suffer persecution. There are times in which it's tough. The devil's fighting and he's attacking. So we're going to continue. We're going to be faithful until the end. Not in my own power, but in the power of Christ in me. Let's pray. Father, we love You. We thank You for loving us. Thank You for the Word of God and the truth that's contained therein. We thank You for this passage of Scripture that gives us these things that accompany salvation. The evidences specifically in the text, the labor, the service of Your people and the love, love for God, love for the brethren. God, I pray that those that are watching online, those that are gathered here at the church house, Lord, that we would be able to say there are evidences in our lives of conversion. However, we understand that there might be one among us or one that's watching that's never trusted the Lord Jesus Christ as their personal Savior. God, it's our prayer that today would be the day of their salvation. They would not leave this place without knowing for sure that heaven is their home. And Father, I pray that even as we see the expectation to continue that You would help us, Lord, to keep our eyes upon Jesus, that we would run our race, that we would be faithful unto the end, that we would consider the examples of those that have gone before us and that, God, we would be an example for those that would follow. Use us, Lord, for Your honor and for Your glory. We'll thank You for the work that You'll do in our lives. For it's in Christ's name we pray. We will have a moment of invitation. Stand with me. Kimberly's going to play on the piano. You can make your own pew, your altar. If you want to come up here, you can. Try to be careful, of course, with all of those things and at home, those that are watching, make your living room or wherever it is that you're watching your altar this morning. But if the Spirit of God spoke to your heart today, the altar is open as Kimberly plays.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.659999847412109,
      "text": " We have not been in the book of Hebrews, but we are planning have been working through the book of Hebrews here in"
    },
    {
      "id": 1,
      "start": 7.179999828338623,
      "end": 12.800000190734863,
      "text": " 2020 with our theme being looking unto Jesus. I'm so thankful. I've had so many"
    },
    {
      "id": 2,
      "start": 13.479999542236328,
      "end": 16.040000915527344,
      "text": " opportunities to speak with people during this pandemic"
    },
    {
      "id": 3,
      "start": 16.799999237060547,
      "end": 22.34000015258789,
      "text": " that have been fearful and concerned and all sorts of things and I've been able to share with them how in"
    },
    {
      "id": 4,
      "start": 22.84000015258789,
      "end": 24.360000610351562,
      "text": " September of"
    },
    {
      "id": 5,
      "start": 24.360000610351562,
      "end": 27.0,
      "text": " 2019 God led me to this theme"
    },
    {
      "id": 6,
      "start": 27.479999542236328,
      "end": 29.479999542236328,
      "text": " looking unto Jesus for"
    },
    {
      "id": 7,
      "start": 29.520000457763672,
      "end": 31.520000457763672,
      "text": " 2020 of course, I had no idea what"
    },
    {
      "id": 8,
      "start": 31.799999237060547,
      "end": 36.720001220703125,
      "text": " 2020 was going to hold but God did and I've told people this many times"
    },
    {
      "id": 9,
      "start": 36.720001220703125,
      "end": 39.52000045776367,
      "text": " You've heard me say it even during the services"
    },
    {
      "id": 10,
      "start": 39.880001068115234,
      "end": 45.08000183105469,
      "text": " We can have the peace of God which passeth all understanding not because we have our head in the sand"
    },
    {
      "id": 11,
      "start": 45.599998474121094,
      "end": 48.400001525878906,
      "text": " but because we have our eyes on our Savior and"
    },
    {
      "id": 12,
      "start": 48.599998474121094,
      "end": 54.560001373291016,
      "text": " I'm so thankful to know that he is in control when it seems like everything is out of control"
    },
    {
      "id": 13,
      "start": 54.68000030517578,
      "end": 57.220001220703125,
      "text": " It's good to know the one that is in control"
    },
    {
      "id": 14,
      "start": 57.52000045776367,
      "end": 63.880001068115234,
      "text": " Amen, and what a blessing to know that he sits upon his throne. He rules and reigns. He is the Lord God"
    },
    {
      "id": 15,
      "start": 64.4000015258789,
      "end": 67.63999938964844,
      "text": " Omnipotent Hebrews chapter number six. We'll be looking at verses 9 through 12"
    },
    {
      "id": 16,
      "start": 68.36000061035156,
      "end": 72.16000366210938,
      "text": " Hebrews 6 verses 9 through 12. The Bible says this but beloved"
    },
    {
      "id": 17,
      "start": 72.95999908447266,
      "end": 77.5,
      "text": " We are persuaded better things of you and things that accompany salvation"
    },
    {
      "id": 18,
      "start": 77.87999725341797,
      "end": 84.19999694824219,
      "text": " Though we thus speak for God is not unrighteous to forget your work and labor of love"
    },
    {
      "id": 19,
      "start": 84.36000061035156,
      "end": 88.95999908447266,
      "text": " which you have showed toward his name and that you have ministered to the Saints and"
    },
    {
      "id": 20,
      "start": 89.44000244140625,
      "end": 96.05999755859375,
      "text": " Do minister and we desire that every one of you do show the same diligence to the full assurance of hope"
    },
    {
      "id": 21,
      "start": 96.4800033569336,
      "end": 102.5199966430664,
      "text": " Unto the end that you be not slothful but followers of them who through faith and patience"
    },
    {
      "id": 22,
      "start": 103.19999694824219,
      "end": 109.80000305175781,
      "text": " Inherit the promises you notice in our text of Scripture here in Hebrews 5 verse number 11"
    },
    {
      "id": 23,
      "start": 110.12000274658203,
      "end": 114.80000305175781,
      "text": " Down through really the entirety of chapter number 6 we've been dealing with this warning passage"
    },
    {
      "id": 24,
      "start": 114.95999908447266,
      "end": 118.72000122070312,
      "text": " we mentioned that the warning passage initially dealt with a a"
    },
    {
      "id": 25,
      "start": 119.23999786376953,
      "end": 125.16000366210938,
      "text": " Confronting of those that were being written to they were confronted about what they were confronted about their spiritual immaturity"
    },
    {
      "id": 26,
      "start": 125.63999938964844,
      "end": 128.8800048828125,
      "text": " They had not been growing in the time that you ought to be teachers"
    },
    {
      "id": 27,
      "start": 128.8800048828125,
      "end": 134.55999755859375,
      "text": " You have need that one teach you is what they were told and so we find that they are confronted about their spiritual"
    },
    {
      "id": 28,
      "start": 134.9600067138672,
      "end": 136.9600067138672,
      "text": " immaturity and then they are"
    },
    {
      "id": 29,
      "start": 137.0,
      "end": 139.0,
      "text": " Challenged to go on"
    },
    {
      "id": 30,
      "start": 139.0,
      "end": 146.55999755859375,
      "text": " to perfection to grow spiritually to become mature in Christ and what a blessing to understand the"
    },
    {
      "id": 31,
      "start": 147.27999877929688,
      "end": 153.9199981689453,
      "text": " Importance of growth as a believer and obviously in the last portion of Hebrews 6 that we studied several weeks ago"
    },
    {
      "id": 32,
      "start": 154.44000244140625,
      "end": 157.60000610351562,
      "text": " In fact, it was the first Sunday of the month of May"
    },
    {
      "id": 33,
      "start": 157.9199981689453,
      "end": 161.83999633789062,
      "text": " We dealt with the passage of Scripture of go on to spiritual maturity"
    },
    {
      "id": 34,
      "start": 162.44000244140625,
      "end": 167.47999572753906,
      "text": " We took several minutes in that message to deal with the use of pronouns"
    },
    {
      "id": 35,
      "start": 168.1999969482422,
      "end": 170.72000122070312,
      "text": " throughout the passage to understand how the"
    },
    {
      "id": 36,
      "start": 171.39999389648438,
      "end": 177.8000030517578,
      "text": " text of Scripture was being written and we come to the text that we're dealing with this morning and we find in verse number 9 there's"
    },
    {
      "id": 37,
      "start": 177.8000030517578,
      "end": 179.8000030517578,
      "text": " that great conjunction but"
    },
    {
      "id": 38,
      "start": 180.72000122070312,
      "end": 184.36000061035156,
      "text": " Beloved and so we find that the writer of Hebrews is now"
    },
    {
      "id": 39,
      "start": 184.8000030517578,
      "end": 190.83999633789062,
      "text": " Addressing this group of people these believers that the warning initially was given to in"
    },
    {
      "id": 40,
      "start": 191.1199951171875,
      "end": 193.47999572753906,
      "text": " chapter number 5 in verses 11 14"
    },
    {
      "id": 41,
      "start": 194.0800018310547,
      "end": 201.9600067138672,
      "text": " listen a lost person is not challenged with growing spiritually a lost person is challenged with conversion and"
    },
    {
      "id": 42,
      "start": 202.39999389648438,
      "end": 206.32000732421875,
      "text": " Then as you're saved you're to go on to spiritual maturity"
    },
    {
      "id": 43,
      "start": 206.83999633789062,
      "end": 210.13999938964844,
      "text": " And so as we look at the text of Scripture that is before us this morning"
    },
    {
      "id": 44,
      "start": 210.32000732421875,
      "end": 215.39999389648438,
      "text": " I've titled the message from verse number 9 things that accompany"
    },
    {
      "id": 45,
      "start": 216.27999877929688,
      "end": 219.8000030517578,
      "text": " Salvation things that accompany salvation"
    },
    {
      "id": 46,
      "start": 219.8000030517578,
      "end": 224.72000122070312,
      "text": " I'm mindful of what the Apostle Paul said to the church in Thessalonica and we've often"
    },
    {
      "id": 47,
      "start": 225.0399932861328,
      "end": 231.1199951171875,
      "text": " referenced the church in Thessalonica and we've spoken about the fact that this is a model church a church that was"
    },
    {
      "id": 48,
      "start": 231.67999267578125,
      "end": 232.9199981689453,
      "text": " exhibiting"
    },
    {
      "id": 49,
      "start": 232.9199981689453,
      "end": 234.9199981689453,
      "text": " spiritual character in growing"
    },
    {
      "id": 50,
      "start": 235.27999877929688,
      "end": 238.4199981689453,
      "text": " Paul says this in 1st Thessalonians 1 in verse number 3"
    },
    {
      "id": 51,
      "start": 239.25999450683594,
      "end": 241.25999450683594,
      "text": " Remembering without ceasing"
    },
    {
      "id": 52,
      "start": 241.4600067138672,
      "end": 247.02000427246094,
      "text": " Your work of faith and labor of love and patience of hope in our Lord"
    },
    {
      "id": 53,
      "start": 247.02000427246094,
      "end": 252.6199951171875,
      "text": " Jesus Christ in the sight of God and our Father as he writes to them in the second epistle again"
    },
    {
      "id": 54,
      "start": 252.86000061035156,
      "end": 259.8599853515625,
      "text": " In chapter 1 in verse number 3. He says we are bound to thank God always for you brethren as it is me"
    },
    {
      "id": 55,
      "start": 260.0199890136719,
      "end": 262.82000732421875,
      "text": " Why because that your faith groweth?"
    },
    {
      "id": 56,
      "start": 263.5400085449219,
      "end": 268.4599914550781,
      "text": " Exceedingly and the charity of every one of you all toward each other"
    },
    {
      "id": 57,
      "start": 269.260009765625,
      "end": 274.5,
      "text": " Aboundeth do you notice those words as he writes the second epistle? He writes the first letter"
    },
    {
      "id": 58,
      "start": 274.5,
      "end": 279.82000732421875,
      "text": " He says I'm thankful for these things. But as he writes the second letter, he notes progress"
    },
    {
      "id": 59,
      "start": 280.1000061035156,
      "end": 283.94000244140625,
      "text": " He notes the fact that he says that you your faith grow with"
    },
    {
      "id": 60,
      "start": 284.7799987792969,
      "end": 290.5,
      "text": " Exceedingly and then he says of their love that they have one toward another that it aboundeth"
    },
    {
      "id": 61,
      "start": 290.739990234375,
      "end": 298.05999755859375,
      "text": " Those are words that describe progress that describe growth and we'd understand in the Christian life that there ought to be"
    },
    {
      "id": 62,
      "start": 298.29998779296875,
      "end": 303.3399963378906,
      "text": " Progress there ought to be growth there ought to be things that accompany"
    },
    {
      "id": 63,
      "start": 304.1400146484375,
      "end": 310.94000244140625,
      "text": " salvation number one if you're taking notes notice the evidence of conversion the evidence of conversion the"
    },
    {
      "id": 64,
      "start": 311.2200012207031,
      "end": 317.0199890136719,
      "text": " The writer says but beloved we are persuaded of better things of you"
    },
    {
      "id": 65,
      "start": 318.2200012207031,
      "end": 320.2200012207031,
      "text": " notice and things"
    },
    {
      "id": 66,
      "start": 320.5,
      "end": 322.5,
      "text": " that accompany"
    },
    {
      "id": 67,
      "start": 322.5400085449219,
      "end": 327.8999938964844,
      "text": " Salvation the things there's a just a couple that are listed here in in Hebrews chapter number six"
    },
    {
      "id": 68,
      "start": 328.0199890136719,
      "end": 333.7799987792969,
      "text": " But we understand as we study the whole of Scripture that you could certainly develop a more robust"
    },
    {
      "id": 69,
      "start": 334.1000061035156,
      "end": 340.17999267578125,
      "text": " List of what I often refer to as birthmarks of a believer. There are signs"
    },
    {
      "id": 70,
      "start": 340.17999267578125,
      "end": 348.4599914550781,
      "text": " There are evidences of life. In fact, there are evidence of evidences of life in you physically speaking even now"
    },
    {
      "id": 71,
      "start": 348.94000244140625,
      "end": 352.8599853515625,
      "text": " Right, you're sitting up you're breathing your eyes are open most of you"
    },
    {
      "id": 72,
      "start": 353.0199890136719,
      "end": 357.6600036621094,
      "text": " but the reality is there are evidences of life right and so as a"
    },
    {
      "id": 73,
      "start": 358.4599914550781,
      "end": 364.4599914550781,
      "text": " Believer there ought to be some birthmarks of the believer. There ought to be some evidences"
    },
    {
      "id": 74,
      "start": 364.8999938964844,
      "end": 368.29998779296875,
      "text": " Some have said this over the years some preachers of yesteryear"
    },
    {
      "id": 75,
      "start": 368.8599853515625,
      "end": 376.82000732421875,
      "text": " have noted the truth of the birthmarks of believers in the evidence of conversion and they've often asked this question if"
    },
    {
      "id": 76,
      "start": 376.82000732421875,
      "end": 382.8999938964844,
      "text": " You were charged in a court of law and the crime that you were charged of was being a Christian"
    },
    {
      "id": 77,
      "start": 383.3800048828125,
      "end": 390.5400085449219,
      "text": " Would there be enough evidence to convict you? That's a good thought. I like the thought I'm not a lawyer"
    },
    {
      "id": 78,
      "start": 390.5400085449219,
      "end": 392.5400085449219,
      "text": " I don't want to talk to too many more lawyers"
    },
    {
      "id": 79,
      "start": 392.8599853515625,
      "end": 398.4599914550781,
      "text": " Except for brother Michael. Amen, but the reality is that we wonder is there the evidence? Is it there?"
    },
    {
      "id": 80,
      "start": 398.4599914550781,
      "end": 403.0,
      "text": " Does it support the claim see it's easy for somebody to say I'm a Christian"
    },
    {
      "id": 81,
      "start": 403.1600036621094,
      "end": 405.1600036621094,
      "text": " It's"
    },
    {
      "id": 82,
      "start": 405.3999938964844,
      "end": 408.239990234375,
      "text": " Another thing to have evidence of conversion"
    },
    {
      "id": 83,
      "start": 408.7200012207031,
      "end": 412.7200012207031,
      "text": " The Bible tells us in 2nd Corinthians 5 in verse number 17 if any man be in Christ"
    },
    {
      "id": 84,
      "start": 412.8399963378906,
      "end": 415.5199890136719,
      "text": " He is a new creature old things are passed away behold"
    },
    {
      "id": 85,
      "start": 415.5199890136719,
      "end": 421.1600036621094,
      "text": " All things are become new the Bible tells us in 1st Peter 2 in verse number 2 as newborn"
    },
    {
      "id": 86,
      "start": 421.3599853515625,
      "end": 425.0,
      "text": " Babes desire the sincere milk of the word that you may grow"
    },
    {
      "id": 87,
      "start": 425.6000061035156,
      "end": 426.8800048828125,
      "text": " thereby"
    },
    {
      "id": 88,
      "start": 426.8800048828125,
      "end": 432.260009765625,
      "text": " And we look at the passage of Scripture and deal with the specific nature of what the"
    },
    {
      "id": 89,
      "start": 432.55999755859375,
      "end": 436.44000244140625,
      "text": " Evidences are that they speak of and he says the things that accompany salvation"
    },
    {
      "id": 90,
      "start": 437.0400085449219,
      "end": 444.239990234375,
      "text": " Though we thus speak notice in verse number 10 for God is not unrighteous number one to forget your work"
    },
    {
      "id": 91,
      "start": 445.0400085449219,
      "end": 451.6600036621094,
      "text": " And so we notice the evidence of conversion would be their service their work for the Lord now"
    },
    {
      "id": 92,
      "start": 451.6600036621094,
      "end": 454.8999938964844,
      "text": " It's important for us to understand that works cannot save you"
    },
    {
      "id": 93,
      "start": 455.70001220703125,
      "end": 457.3399963378906,
      "text": " It's absolutely impossible"
    },
    {
      "id": 94,
      "start": 457.3399963378906,
      "end": 462.8599853515625,
      "text": " The only thing that can save us is the blood of Jesus Christ his death burial and glorious resurrection"
    },
    {
      "id": 95,
      "start": 463.5400085449219,
      "end": 471.1400146484375,
      "text": " The gospel as we often refer to it, but we understand this morning that our works or our service for Christ"
    },
    {
      "id": 96,
      "start": 471.4200134277344,
      "end": 473.4200134277344,
      "text": " They reveal our"
    },
    {
      "id": 97,
      "start": 474.260009765625,
      "end": 480.1000061035156,
      "text": " Position in Christ if you study the book of Ephesians, which we did in 2019 as a church family"
    },
    {
      "id": 98,
      "start": 480.1000061035156,
      "end": 483.94000244140625,
      "text": " I preached the entire book on Sunday mornings through the book of Ephesians"
    },
    {
      "id": 99,
      "start": 484.29998779296875,
      "end": 490.9800109863281,
      "text": " And you find that in the first few chapters. In fact, the first three chapters of Ephesians deal with"
    },
    {
      "id": 100,
      "start": 491.6199951171875,
      "end": 498.739990234375,
      "text": " Establishing your position in Christ who we are in Christ these believers that Paul is writing to in Ephesus"
    },
    {
      "id": 101,
      "start": 498.94000244140625,
      "end": 501.0199890136719,
      "text": " he had ministered there and he was"
    },
    {
      "id": 102,
      "start": 502.0199890136719,
      "end": 506.70001220703125,
      "text": " Reminding them of their conversion and reminding them of their position in Christ"
    },
    {
      "id": 103,
      "start": 506.8999938964844,
      "end": 511.05999755859375,
      "text": " He says this in Ephesians 2 verses 8 and 9 for by grace"
    },
    {
      "id": 104,
      "start": 511.05999755859375,
      "end": 513.8200073242188,
      "text": " Are you saved through faith and that not of yourselves?"
    },
    {
      "id": 105,
      "start": 513.8200073242188,
      "end": 517.5,
      "text": " It is the gift of God not of works lest any man should boast"
    },
    {
      "id": 106,
      "start": 518.219970703125,
      "end": 524.5399780273438,
      "text": " Unless we forget so many people think that Paul and James are contrary one to the other. They actually"
    },
    {
      "id": 107,
      "start": 525.0999755859375,
      "end": 530.7000122070312,
      "text": " Work perfect in unity one with the other Paul is dealing with the root of salvation"
    },
    {
      "id": 108,
      "start": 531.3400268554688,
      "end": 534.1400146484375,
      "text": " James is dealing with the fruit of salvation"
    },
    {
      "id": 109,
      "start": 534.1400146484375,
      "end": 540.5,
      "text": " But you must understand and acknowledge this morning that though the Apostle Paul deals with the root of salvation"
    },
    {
      "id": 110,
      "start": 540.9000244140625,
      "end": 547.2999877929688,
      "text": " He often speaks about the fruit of salvation in the very next verse in Ephesians 2 in verse number 10"
    },
    {
      "id": 111,
      "start": 547.3400268554688,
      "end": 549.3400268554688,
      "text": " He says for we are"
    },
    {
      "id": 112,
      "start": 549.5,
      "end": 551.5,
      "text": " his workmanship"
    },
    {
      "id": 113,
      "start": 552.1799926757812,
      "end": 558.5399780273438,
      "text": " Created in Christ Jesus unto good works. Oh Paul used the word good works"
    },
    {
      "id": 114,
      "start": 558.8200073242188,
      "end": 564.1799926757812,
      "text": " Yeah, but he says that's what that's the evidence of salvation that helps us to understand"
    },
    {
      "id": 115,
      "start": 564.5399780273438,
      "end": 566.739990234375,
      "text": " And to reveal our position in Christ"
    },
    {
      "id": 116,
      "start": 566.739990234375,
      "end": 570.8599853515625,
      "text": " He says that we are his workmanship created in Christ Jesus unto good works"
    },
    {
      "id": 117,
      "start": 571.02001953125,
      "end": 574.780029296875,
      "text": " What's God hath before ordained that we should walk in?"
    },
    {
      "id": 118,
      "start": 575.5399780273438,
      "end": 581.5399780273438,
      "text": " Them it's interesting that in the first three chapters of the book of Ephesians Paul spends much time"
    },
    {
      "id": 119,
      "start": 582.1400146484375,
      "end": 585.5399780273438,
      "text": " Helping to establish their position in Christ"
    },
    {
      "id": 120,
      "start": 585.780029296875,
      "end": 591.0599975585938,
      "text": " But if you get into chapters 4 5 & 6 you notice on five occasions"
    },
    {
      "id": 121,
      "start": 591.1799926757812,
      "end": 593.4199829101562,
      "text": " What does Paul reference their walk?"
    },
    {
      "id": 122,
      "start": 594.1799926757812,
      "end": 600.02001953125,
      "text": " Their walk their behavior. I said often as we studied the book of Ephesians in"
    },
    {
      "id": 0,
      "start": 600.02001953125,
      "end": 604.9200196266174,
      "text": " 2019, that as Paul gets into the latter part, the second half of the book of"
    },
    {
      "id": 1,
      "start": 604.9200196266174,
      "end": 608.6800193786621,
      "text": " Ephesians, he's not telling these people, it's important to understand this, two"
    },
    {
      "id": 2,
      "start": 608.6800193786621,
      "end": 613.0800199508667,
      "text": " important truths. He's not telling them, these are the things you do to be saved,"
    },
    {
      "id": 3,
      "start": 613.0800199508667,
      "end": 619.3200187683105,
      "text": " nor is he telling them, these are the things that you do to stay saved. No. He's"
    },
    {
      "id": 4,
      "start": 619.3200187683105,
      "end": 625.7200202941895,
      "text": " telling them, these are the things that you do because you are saved. These are"
    },
    {
      "id": 5,
      "start": 625.7200202941895,
      "end": 631.4800186157227,
      "text": " the evidences of salvation. Your work in the book of Titus, on a number of"
    },
    {
      "id": 6,
      "start": 631.4800186157227,
      "end": 636.6000213623047,
      "text": " occasions, it's a short letter, just a few chapters, and we find that as"
    },
    {
      "id": 7,
      "start": 636.6000213623047,
      "end": 640.9200210571289,
      "text": " Paul is writing to Titus and he's giving instruction with regard to the work at"
    },
    {
      "id": 8,
      "start": 640.9200210571289,
      "end": 644.1200180053711,
      "text": " Crete and that which Titus was responsible for, you know that on a"
    },
    {
      "id": 9,
      "start": 644.1200180053711,
      "end": 648.5600204467773,
      "text": " number of occasions in that book he references good works? He says this in"
    },
    {
      "id": 10,
      "start": 648.5600204467773,
      "end": 654.5600204467773,
      "text": " Titus 2 in verse number 7, in all things showing thyself a pattern of good works"
    },
    {
      "id": 11,
      "start": 654.5600204467773,
      "end": 660.1600189208984,
      "text": " in doctrine, showing uncorruptness, gravity, sincerity, sound speech that"
    },
    {
      "id": 12,
      "start": 660.1600189208984,
      "end": 664.3200225830078,
      "text": " cannot be condemned, that he that is of the contrary part may be ashamed having"
    },
    {
      "id": 13,
      "start": 664.3200225830078,
      "end": 668.6600189208984,
      "text": " no evil thing to say of you. Remember, we sing the song, there's been a great"
    },
    {
      "id": 14,
      "start": 668.6600189208984,
      "end": 672.2000198364258,
      "text": " change since I've been born again. We sing it with the kids, right? We ought to"
    },
    {
      "id": 15,
      "start": 672.2000198364258,
      "end": 678.2400207519531,
      "text": " sing it as adults. The things I used to say, I don't say them anymore, right? What"
    },
    {
      "id": 16,
      "start": 678.2400207519531,
      "end": 684.52001953125,
      "text": " does it say here in verse number 8? Sound speech that cannot be condemned. The"
    },
    {
      "id": 17,
      "start": 684.52001953125,
      "end": 687.52001953125,
      "text": " things I used to say, I don't say them anymore. The things I used to do, I don't"
    },
    {
      "id": 18,
      "start": 687.52001953125,
      "end": 690.8000183105469,
      "text": " do them anymore. The place I used to go, I don't go there anymore. Why?"
    },
    {
      "id": 19,
      "start": 690.8000183105469,
      "end": 696.4800186157227,
      "text": " There's been a great change since I've been born again. Praise the Lord for"
    },
    {
      "id": 20,
      "start": 696.4800186157227,
      "end": 701.0600204467773,
      "text": " conversion. He says a little bit later here in the book of Titus, and look in"
    },
    {
      "id": 21,
      "start": 701.0600204467773,
      "end": 705.2800216674805,
      "text": " verse number 14, who gave himself for us that he might redeem us from all"
    },
    {
      "id": 22,
      "start": 705.2800216674805,
      "end": 712.3200225830078,
      "text": " iniquity and purify unto himself a peculiar people zealous of good works."
    },
    {
      "id": 23,
      "start": 712.400016784668,
      "end": 717.4400177001953,
      "text": " But you notice in chapter number 3, in verse number 5, that Paul also says, not"
    },
    {
      "id": 24,
      "start": 717.4400177001953,
      "end": 723.5600204467773,
      "text": " by works of righteousness which we have done, but according to his mercy he saved"
    },
    {
      "id": 25,
      "start": 723.5600204467773,
      "end": 729.4000244140625,
      "text": " us. There's no contradiction. It's the evidence of salvation, our work, our"
    },
    {
      "id": 26,
      "start": 729.4000244140625,
      "end": 733.8400268554688,
      "text": " service. He will say in verse number 14, nearing the end of the book of Titus of"
    },
    {
      "id": 27,
      "start": 733.8400268554688,
      "end": 739.3200225830078,
      "text": " chapter 3 and verse 14, and let ours also learn to maintain good works for"
    },
    {
      "id": 28,
      "start": 739.3200225830078,
      "end": 744.7200164794922,
      "text": " necessary uses that they be not unfruitful. It's interesting if you were"
    },
    {
      "id": 29,
      "start": 744.7200164794922,
      "end": 750.2400207519531,
      "text": " to read about the seven churches in Asia in Revelation 2 and 3, in each of the"
    },
    {
      "id": 30,
      "start": 750.2400207519531,
      "end": 755.52001953125,
      "text": " letters that are written to those seven churches, you find that God says"
    },
    {
      "id": 31,
      "start": 755.52001953125,
      "end": 764.3200225830078,
      "text": " through John, I know thy works. I know thy works. Every church that's mentioned in"
    },
    {
      "id": 32,
      "start": 764.6400146484375,
      "end": 770.1600189208984,
      "text": " Revelation 2 and 3, all seven of those churches in Asia, God says, the Lord Jesus"
    },
    {
      "id": 33,
      "start": 770.1600189208984,
      "end": 775.6000213623047,
      "text": " Christ says, I know thy works. Notice what the writer of Hebrews says to these"
    },
    {
      "id": 34,
      "start": 775.6000213623047,
      "end": 780.4000244140625,
      "text": " believers that he's writing to. He says, these things that accompany salvation,"
    },
    {
      "id": 35,
      "start": 780.4000244140625,
      "end": 787.4400177001953,
      "text": " the first one he says, for God is not unrighteous to forget your work. The"
    },
    {
      "id": 36,
      "start": 787.4400177001953,
      "end": 791.8400268554688,
      "text": " first evidence of salvation that is dealt with here in Hebrews 6 is our"
    },
    {
      "id": 37,
      "start": 791.8400268554688,
      "end": 797.2800140380859,
      "text": " service to our God. You know, as a believer, there are many things that"
    },
    {
      "id": 38,
      "start": 797.2800140380859,
      "end": 801.7200164794922,
      "text": " happen at the time of conversion, and most of us, the day in which we got saved,"
    },
    {
      "id": 39,
      "start": 801.7200164794922,
      "end": 805.7200164794922,
      "text": " we probably didn't understand all of those things that happened on that day."
    },
    {
      "id": 40,
      "start": 805.7200164794922,
      "end": 809.8000183105469,
      "text": " But as we've grown in Christ, we've learned some of those things that"
    },
    {
      "id": 41,
      "start": 809.8000183105469,
      "end": 815.6800231933594,
      "text": " happen. The wonderful truth of conversion and understanding that our"
    },
    {
      "id": 42,
      "start": 815.6800231933594,
      "end": 819.2000122070312,
      "text": " bodies, we're the temple of the Holy Spirit which is in us, right? We've been"
    },
    {
      "id": 43,
      "start": 819.2000122070312,
      "end": 823.3600158691406,
      "text": " indwelled by the Spirit of God which is the proof of our salvation according to"
    },
    {
      "id": 44,
      "start": 823.3600158691406,
      "end": 827.52001953125,
      "text": " Ephesians 1, and we find that the Bible speaks about the fact that we have been"
    },
    {
      "id": 45,
      "start": 827.52001953125,
      "end": 834.4400177001953,
      "text": " given gifts, spiritual gifts. Every believer has been equipped by God"
    },
    {
      "id": 46,
      "start": 834.4400177001953,
      "end": 842.2800140380859,
      "text": " Almighty with a spiritual gift. Why? For the work, for the work of the ministry."
    },
    {
      "id": 47,
      "start": 842.2800140380859,
      "end": 847.2400207519531,
      "text": " Paul told the same group of people that we've referenced multiple times here in"
    },
    {
      "id": 48,
      "start": 847.6000213623047,
      "end": 852.4400177001953,
      "text": " the church at Ephesus, he told them in chapter number 4 and verse number 11, and"
    },
    {
      "id": 49,
      "start": 852.4400177001953,
      "end": 856.52001953125,
      "text": " he gave some apostles and some prophets and some evangelists and some pastors"
    },
    {
      "id": 50,
      "start": 856.52001953125,
      "end": 861.52001953125,
      "text": " and teachers for the perfecting of the saints' notice for the work of the"
    },
    {
      "id": 51,
      "start": 861.52001953125,
      "end": 865.8400268554688,
      "text": " ministry. Everybody doing their part. We speak about many hands make light work,"
    },
    {
      "id": 52,
      "start": 865.8400268554688,
      "end": 870.1200256347656,
      "text": " but we think about the way in which the Holy Spirit of God has gifted the church,"
    },
    {
      "id": 53,
      "start": 870.1200256347656,
      "end": 874.4000244140625,
      "text": " and we find that God uses the illustration of the human body. I'm"
    },
    {
      "id": 54,
      "start": 874.4800109863281,
      "end": 877.6000061035156,
      "text": " thankful that I have a right hand and a left hand. My left hand's a little bit"
    },
    {
      "id": 55,
      "start": 877.6000061035156,
      "end": 881.7200317382812,
      "text": " behind because I'm right-handed, and sometimes I say this hand doesn't do what"
    },
    {
      "id": 56,
      "start": 881.7200317382812,
      "end": 887.8400268554688,
      "text": " I want it to do, but I'm really glad I don't have two right hands. Amen? And you"
    },
    {
      "id": 57,
      "start": 887.8400268554688,
      "end": 892.1600341796875,
      "text": " can think about the way that God has designed our bodies, and we"
    },
    {
      "id": 58,
      "start": 892.1600341796875,
      "end": 897.6800231933594,
      "text": " understand the illustration of the body of believers, the church, and how God has"
    },
    {
      "id": 59,
      "start": 897.6800231933594,
      "end": 903.2400207519531,
      "text": " individually gifted every believer. Why? For the work. The purpose of your"
    },
    {
      "id": 60,
      "start": 903.2400207519531,
      "end": 906.52001953125,
      "text": " spiritual gift is not so you can use it for yourself, it's that you use it in the"
    },
    {
      "id": 61,
      "start": 906.52001953125,
      "end": 910.6400146484375,
      "text": " church for the glory of God. I often think about the Old Testament"
    },
    {
      "id": 62,
      "start": 910.6400146484375,
      "end": 914.0000305175781,
      "text": " illustration in the book of Exodus. In fact, I'll be looking at Exodus chapter"
    },
    {
      "id": 63,
      "start": 914.0000305175781,
      "end": 918.1200256347656,
      "text": " 40 this evening as what I'll be preaching from, but if you look in all of"
    },
    {
      "id": 64,
      "start": 918.1200256347656,
      "end": 921.8800048828125,
      "text": " that passage at the end of the book of Exodus dealing with the construction of"
    },
    {
      "id": 65,
      "start": 921.8800048828125,
      "end": 926.9600219726562,
      "text": " the tabernacle, there's a man by the name of Bezalel, and Bezalel was gifted by"
    },
    {
      "id": 66,
      "start": 926.9600219726562,
      "end": 931.52001953125,
      "text": " God for all of that work that God had instructed Moses to do. I'll be honest"
    },
    {
      "id": 67,
      "start": 931.5600280761719,
      "end": 934.4400329589844,
      "text": " with you, if I was Moses receiving all of that instruction with all of those"
    },
    {
      "id": 68,
      "start": 934.4400329589844,
      "end": 939.6800231933594,
      "text": " pieces of furniture, it's just going right over my head. And then God says,"
    },
    {
      "id": 69,
      "start": 939.6800231933594,
      "end": 946.5600280761719,
      "text": " Bezalel, I've equipped him, I've gifted him for this purpose. Bezalel wasn't to"
    },
    {
      "id": 70,
      "start": 946.5600280761719,
      "end": 950.4400329589844,
      "text": " use that which God equipped him with to go out and use it somewhere else for"
    },
    {
      "id": 71,
      "start": 950.4400329589844,
      "end": 955.7400207519531,
      "text": " something else. No, for the work that God had given him to do. So we find that the"
    },
    {
      "id": 72,
      "start": 955.7400207519531,
      "end": 960.2400207519531,
      "text": " writer of Hebrews' first evidence of conversion is that of our service. Notice"
    },
    {
      "id": 73,
      "start": 960.2400207519531,
      "end": 964.4800109863281,
      "text": " number two, the Bible says there in verse number 10 back in Hebrews 6, for God is"
    },
    {
      "id": 74,
      "start": 964.4800109863281,
      "end": 970.4400329589844,
      "text": " not unrighteous to forget your work, notice, and labor of love, and labor of"
    },
    {
      "id": 75,
      "start": 970.4400329589844,
      "end": 974.2000122070312,
      "text": " love, which ye have showed toward his name, and that ye have ministered to the"
    },
    {
      "id": 76,
      "start": 974.2000122070312,
      "end": 979.0400085449219,
      "text": " saints, and do minister. You know what's interesting about verse number 10? He"
    },
    {
      "id": 77,
      "start": 979.0400085449219,
      "end": 983.0000305175781,
      "text": " speaks about their work, their service, he speaks about their labor of love, but then"
    },
    {
      "id": 78,
      "start": 983.0000305175781,
      "end": 989.52001953125,
      "text": " he shows us that love is an action. He says, which ye have showed toward his"
    },
    {
      "id": 79,
      "start": 989.52001953125,
      "end": 997.0400085449219,
      "text": " name, and that ye have ministered to the saints, and do minister. Your labor of"
    },
    {
      "id": 80,
      "start": 997.0400085449219,
      "end": 1003.6000061035156,
      "text": " love. One of those five walks that Paul gives to the church in Ephesus in"
    },
    {
      "id": 81,
      "start": 1003.6000061035156,
      "end": 1008.0400085449219,
      "text": " chapters 4, 5, and 6 is found in Ephesians 5 in verse number 2, and here's what it"
    },
    {
      "id": 82,
      "start": 1008.0400085449219,
      "end": 1015.7200317382812,
      "text": " is. Walk in love. Ephesians 5 in verse number 2. See, we're to love God. By the"
    },
    {
      "id": 83,
      "start": 1015.7200317382812,
      "end": 1018.8000183105469,
      "text": " way, if you don't love God like you should, you're never gonna love others"
    },
    {
      "id": 84,
      "start": 1018.8400268554688,
      "end": 1024.4400329589844,
      "text": " like you should. But we're to love God. Why do we love him? Well, according to 1st"
    },
    {
      "id": 85,
      "start": 1024.4400329589844,
      "end": 1029.760009765625,
      "text": " John 4 and verse number 19, I love him because he first loved me. What a"
    },
    {
      "id": 86,
      "start": 1029.760009765625,
      "end": 1035.8400268554688,
      "text": " blessing to know the love of God. The truth that God so loved the world, the"
    },
    {
      "id": 87,
      "start": 1035.8400268554688,
      "end": 1041.4400329589844,
      "text": " truth that God commendeth his love toward us. I'm thankful that he"
    },
    {
      "id": 88,
      "start": 1041.4400329589844,
      "end": 1047.8400268554688,
      "text": " didn't simply declare his love, but then he demonstrated his love for us, and we"
    },
    {
      "id": 89,
      "start": 1047.8400268554688,
      "end": 1051.8000183105469,
      "text": " understand that we're to love God. You know, the thing that's interesting is,"
    },
    {
      "id": 90,
      "start": 1051.8000183105469,
      "end": 1055.6800231933594,
      "text": " just as I mentioned, that it's easy to say, I'm a Christian, but there ought to"
    },
    {
      "id": 91,
      "start": 1055.6800231933594,
      "end": 1061.4000244140625,
      "text": " be some evidences. It's easy to say, I love God. But there's a Bible test. It's"
    },
    {
      "id": 92,
      "start": 1061.4000244140625,
      "end": 1068.4000244140625,
      "text": " not my test. It's God's test. If you love me, keep my commandments. Right? Now what"
    },
    {
      "id": 93,
      "start": 1068.4000244140625,
      "end": 1073.52001953125,
      "text": " the Bible says? That's not my test. That's God's test. So if you"
    },
    {
      "id": 94,
      "start": 1073.52001953125,
      "end": 1078.1200256347656,
      "text": " say, I love God, there's a way for you to understand biblically whether you"
    },
    {
      "id": 95,
      "start": 1078.1200256347656,
      "end": 1083.9200134277344,
      "text": " really do love God. In 1st John chapter number 5, it's interesting, we see"
    },
    {
      "id": 96,
      "start": 1083.9200134277344,
      "end": 1087.52001953125,
      "text": " that truth in John 14 and verse number 15, if you love me, keep my commandments."
    },
    {
      "id": 97,
      "start": 1087.52001953125,
      "end": 1091.4800109863281,
      "text": " But in 1st John 5 and verse number 3, the Bible says, for this is the love of"
    },
    {
      "id": 98,
      "start": 1091.4800109863281,
      "end": 1095.0000305175781,
      "text": " God, that we keep his commandments. And then it says this, and his commandments"
    },
    {
      "id": 99,
      "start": 1095.0000305175781,
      "end": 1103.3600158691406,
      "text": " are not grievous. We understand that the love of God is best described not as"
    },
    {
      "id": 100,
      "start": 1103.4000244140625,
      "end": 1108.4000244140625,
      "text": " being permissive, but as being protective. And that's important for us to"
    },
    {
      "id": 101,
      "start": 1108.4000244140625,
      "end": 1113.760009765625,
      "text": " understand. See, I love my children, and I show my love for my children. I love my"
    },
    {
      "id": 102,
      "start": 1113.760009765625,
      "end": 1117.9600219726562,
      "text": " wife. I show my love for my wife. But my love for my children, if I could use that"
    },
    {
      "id": 103,
      "start": 1117.9600219726562,
      "end": 1122.4000244140625,
      "text": " illustration specifically, is a protective love. I'm not gonna go let"
    },
    {
      "id": 104,
      "start": 1122.4000244140625,
      "end": 1126.0,
      "text": " them do whatever they want to do. Now they're older now. They're 13, 15, and 17."
    },
    {
      "id": 105,
      "start": 1126.0,
      "end": 1131.6799926757812,
      "text": " And so it's not quite as easy of an illustration. But the reality is that we"
    },
    {
      "id": 106,
      "start": 1131.6799926757812,
      "end": 1135.2000122070312,
      "text": " didn't let them go stick a fork in the outlet when they were little toddlers"
    },
    {
      "id": 107,
      "start": 1135.2000122070312,
      "end": 1139.6799926757812,
      "text": " because they wanted to. Well, I love them, and so I'm just gonna let them do what"
    },
    {
      "id": 108,
      "start": 1139.6799926757812,
      "end": 1143.5599975585938,
      "text": " they want to do, because love is permissive. They'd lock you up somewhere,"
    },
    {
      "id": 109,
      "start": 1143.5599975585938,
      "end": 1149.52001953125,
      "text": " right? I mean, you endangered your child. No, no, love is protective. Because I love"
    },
    {
      "id": 110,
      "start": 1149.52001953125,
      "end": 1153.9600219726562,
      "text": " you and I understand the danger, therefore I'm gonna protect you from"
    },
    {
      "id": 111,
      "start": 1153.9600219726562,
      "end": 1158.6400146484375,
      "text": " that. You know that God knows more than you? That shouldn't be a surprise to any"
    },
    {
      "id": 112,
      "start": 1158.7200317382812,
      "end": 1163.8800048828125,
      "text": " of us, amen? God knows more than you. He knows more than I do. He knows more than"
    },
    {
      "id": 113,
      "start": 1163.8800048828125,
      "end": 1168.800048828125,
      "text": " all of us collectively. And you know when God has given us His Word and He said"
    },
    {
      "id": 114,
      "start": 1168.800048828125,
      "end": 1175.4000244140625,
      "text": " thou shalt not? He does it because He loves us. He's trying to protect us. And"
    },
    {
      "id": 115,
      "start": 1175.4000244140625,
      "end": 1179.3400268554688,
      "text": " what a blessing that is. We understand that God's given us this truth with"
    },
    {
      "id": 116,
      "start": 1179.3400268554688,
      "end": 1183.0800170898438,
      "text": " regard to our love for Him. But it's interesting, I mentioned this just a"
    },
    {
      "id": 117,
      "start": 1183.0800170898438,
      "end": 1186.5599975585938,
      "text": " moment ago, and here's the Bible verse that supports it in 1 John chapter 4, in"
    },
    {
      "id": 118,
      "start": 1187.0,
      "end": 1191.280029296875,
      "text": " verse number 20. Yes, we ought to first love God, but the Bible says this, if a"
    },
    {
      "id": 119,
      "start": 1191.280029296875,
      "end": 1198.2000122070312,
      "text": " man say I love God and hateth his brother, he is a liar. I mean, that's"
    },
    {
      "id": 120,
      "start": 1198.2000122070312,
      "end": 1201.6799926757812,
      "text": " straight language, amen?"
    },
    {
      "id": 0,
      "start": 1201.6799926757812,
      "end": 1205.7199926376343,
      "text": " to the point he is a liar for he that loveth not his brother whom he hath"
    },
    {
      "id": 1,
      "start": 1205.7199926376343,
      "end": 1209.6399927139282,
      "text": " seen how can he love God whom he hath not seen and we find that when we think"
    },
    {
      "id": 2,
      "start": 1209.6399927139282,
      "end": 1214.0399923324585,
      "text": " about our labor of love as the writer of Hebrews is dealing with this evidence of"
    },
    {
      "id": 3,
      "start": 1214.0399923324585,
      "end": 1219.0399932861328,
      "text": " conversion not only your service and your work but your labor of love you"
    },
    {
      "id": 4,
      "start": 1219.0399932861328,
      "end": 1223.0399932861328,
      "text": " understand it's yes first and foremost our love for God but number two our love"
    },
    {
      "id": 5,
      "start": 1223.0399932861328,
      "end": 1229.2399921417236,
      "text": " for the brethren Jesus in John 13 he said by this shall all men know that"
    },
    {
      "id": 6,
      "start": 1229.2399921417236,
      "end": 1235.3199920654297,
      "text": " you're my disciples by what by your love one for another by your love one for"
    },
    {
      "id": 7,
      "start": 1235.3199920654297,
      "end": 1242.0799942016602,
      "text": " another we find as I mentioned earlier about the church in Thessalonica and the"
    },
    {
      "id": 8,
      "start": 1242.0799942016602,
      "end": 1246.3999938964844,
      "text": " way in which you saw their progress and you saw their growth and he said in"
    },
    {
      "id": 9,
      "start": 1246.3999938964844,
      "end": 1251.1599922180176,
      "text": " 2nd Thessalonians 1 and verse number 3 that their love aboundeth and you see"
    },
    {
      "id": 10,
      "start": 1251.1599922180176,
      "end": 1255.9999923706055,
      "text": " that growth that is taking place there and what a blessing that is what we"
    },
    {
      "id": 11,
      "start": 1255.9999923706055,
      "end": 1261.1199913024902,
      "text": " understand in 1st Thessalonians chapter number 4 that here's what Paul says"
    },
    {
      "id": 12,
      "start": 1261.1199913024902,
      "end": 1265.5999908447266,
      "text": " concerning brotherly love in 1st Thessalonians 4 verse 9 and 10 it says"
    },
    {
      "id": 13,
      "start": 1265.5999908447266,
      "end": 1270.4399948120117,
      "text": " but as touching brotherly love ye need not that I write unto you for ye"
    },
    {
      "id": 14,
      "start": 1270.4399948120117,
      "end": 1274.5999908447266,
      "text": " yourselves are taught of God to love one another and then notice this great"
    },
    {
      "id": 15,
      "start": 1274.5999908447266,
      "end": 1281.4399948120117,
      "text": " commendation in verse number 10 of 1st Thessalonians 4 and indeed ye do it"
    },
    {
      "id": 16,
      "start": 1281.4399948120117,
      "end": 1285.759994506836,
      "text": " toward all the brethren which are in all Macedonia but we beseech you brethren"
    },
    {
      "id": 17,
      "start": 1285.759994506836,
      "end": 1292.5999908447266,
      "text": " notice that ye increase more and more you're already loving the brethren"
    },
    {
      "id": 18,
      "start": 1292.5999908447266,
      "end": 1297.5999908447266,
      "text": " that's good you're supposed to Jesus said that's how we're gonna know or"
    },
    {
      "id": 19,
      "start": 1297.5999908447266,
      "end": 1300.479995727539,
      "text": " others are gonna know that you're my disciples by your love one for another"
    },
    {
      "id": 20,
      "start": 1300.479995727539,
      "end": 1306.2799911499023,
      "text": " in John 13 in verses 34 and 35 and Paul says you're already doing it but I would"
    },
    {
      "id": 21,
      "start": 1306.2799911499023,
      "end": 1310.5599899291992,
      "text": " that you would increase more and more and then he sends the second letter and"
    },
    {
      "id": 22,
      "start": 1310.5599899291992,
      "end": 1315.1199951171875,
      "text": " says the charity of every one of you all toward each other aboundeth"
    },
    {
      "id": 23,
      "start": 1315.1199951171875,
      "end": 1320.639991760254,
      "text": " isn't that awesome see the model in the church in Corinth isn't the model we're"
    },
    {
      "id": 24,
      "start": 1320.639991760254,
      "end": 1326.7999954223633,
      "text": " trying to follow divisions and envyings and strife no that's that's immaturity"
    },
    {
      "id": 25,
      "start": 1326.7999954223633,
      "end": 1332.2799987792969,
      "text": " that's spiritually immature he says I can't speak to you as unto spiritual but"
    },
    {
      "id": 26,
      "start": 1332.2799987792969,
      "end": 1338.0399932861328,
      "text": " unto carnal and see we find here in the book of Hebrews the the challenge that"
    },
    {
      "id": 27,
      "start": 1338.0399932861328,
      "end": 1342.5599975585938,
      "text": " we're dealing with is to go on to spiritual maturity and he says to them"
    },
    {
      "id": 28,
      "start": 1342.5599975585938,
      "end": 1348.8399963378906,
      "text": " there are some things that should accompany conversion he references their"
    },
    {
      "id": 29,
      "start": 1348.8399963378906,
      "end": 1355.3599853515625,
      "text": " work their service their labor of love I wonder this morning is there evidence in"
    },
    {
      "id": 30,
      "start": 1355.3599853515625,
      "end": 1362.1999969482422,
      "text": " your life of being born again see I really believe that as we look at these"
    },
    {
      "id": 31,
      "start": 1362.1999969482422,
      "end": 1367.5199890136719,
      "text": " two verses of Scripture in Hebrews 6 9 and 10 and we think about the evidence"
    },
    {
      "id": 32,
      "start": 1367.5199890136719,
      "end": 1372.5599975585938,
      "text": " of conversion I believe that this evidence of conversion and what the"
    },
    {
      "id": 33,
      "start": 1372.5599975585938,
      "end": 1379.2799987792969,
      "text": " the writer of Hebrews is dealing with here here leads us to an examination see"
    },
    {
      "id": 34,
      "start": 1379.2799987792969,
      "end": 1385.239990234375,
      "text": " I want to know as I evaluate and examine my own life are there evidences of"
    },
    {
      "id": 35,
      "start": 1385.239990234375,
      "end": 1391.5999908447266,
      "text": " conversion and the child of God should be interested in knowing hey is there"
    },
    {
      "id": 36,
      "start": 1391.5999908447266,
      "end": 1396.9199981689453,
      "text": " anything in my life that would give evidence that I'm a child of God notice"
    },
    {
      "id": 37,
      "start": 1396.9199981689453,
      "end": 1400.759994506836,
      "text": " this exhortation to conclude the book of 2nd Corinthians you don't need to"
    },
    {
      "id": 38,
      "start": 1400.759994506836,
      "end": 1404.239990234375,
      "text": " turn there I'll read it for you but in 2nd Corinthians chapter 13 in verse"
    },
    {
      "id": 39,
      "start": 1404.239990234375,
      "end": 1409.6399993896484,
      "text": " number 5 the the Apostle Paul says this to these believers he says examine"
    },
    {
      "id": 40,
      "start": 1409.6399993896484,
      "end": 1420.6399993896484,
      "text": " yourselves whether ye be in the faith prove your own selves know ye not your"
    },
    {
      "id": 41,
      "start": 1420.6399993896484,
      "end": 1426.8399963378906,
      "text": " own selves how that Jesus Christ is in you except you be reprobates the reality"
    },
    {
      "id": 42,
      "start": 1426.8399963378906,
      "end": 1431.9199981689453,
      "text": " is that this exhortation in 2nd Corinthians 13 to examine themselves"
    },
    {
      "id": 43,
      "start": 1431.9199981689453,
      "end": 1437.0799865722656,
      "text": " really I believe is an important exhortation in light of what we read"
    },
    {
      "id": 44,
      "start": 1437.0799865722656,
      "end": 1442.0399932861328,
      "text": " here in Hebrews chapter number 6 is there evidence of conversion it's not"
    },
    {
      "id": 45,
      "start": 1442.0399932861328,
      "end": 1446.239990234375,
      "text": " for me necessarily to examine although the Bible says by their fruit you shall"
    },
    {
      "id": 46,
      "start": 1446.239990234375,
      "end": 1453.5199890136719,
      "text": " know them but really the admonition here is for you to examine yourself are there"
    },
    {
      "id": 47,
      "start": 1453.5199890136719,
      "end": 1457.7200012207031,
      "text": " evidences of conversion in your life I hope that you can say yes there are I"
    },
    {
      "id": 48,
      "start": 1457.7200012207031,
      "end": 1461.7200012207031,
      "text": " hope that these believers here that are being written to in the book of Hebrews"
    },
    {
      "id": 49,
      "start": 1461.7200012207031,
      "end": 1466.5199890136719,
      "text": " that as they receive as they come to the sixth chapter as we have the division in"
    },
    {
      "id": 50,
      "start": 1466.5199890136719,
      "end": 1471.3999938964844,
      "text": " our Bible that they would have this time of looking at these evidences and saying"
    },
    {
      "id": 51,
      "start": 1471.3999938964844,
      "end": 1477.1999816894531,
      "text": " that they would do this evaluation this examination if you will the text"
    },
    {
      "id": 52,
      "start": 1477.1999816894531,
      "end": 1482.7200012207031,
      "text": " continues in verses 11 and 12 we see first of all if you're taking notes the"
    },
    {
      "id": 53,
      "start": 1482.7200012207031,
      "end": 1486.6000061035156,
      "text": " evidence of conversion but now I want you to see in verses 11 and 12 the"
    },
    {
      "id": 54,
      "start": 1486.6000061035156,
      "end": 1493.0799865722656,
      "text": " expectation to continue we see that consistent throughout the Word of God we"
    },
    {
      "id": 55,
      "start": 1493.0799865722656,
      "end": 1497.1799926757812,
      "text": " mentioned already there in the book of 1st and 2nd Thessalonians how that the"
    },
    {
      "id": 56,
      "start": 1497.1799926757812,
      "end": 1501.8399963378906,
      "text": " Apostle Paul is encouraging those believers to press on to continue we"
    },
    {
      "id": 57,
      "start": 1501.8399963378906,
      "end": 1507.8399963378906,
      "text": " find that in John 8 in verse number 31 Jesus said if you continue in my word"
    },
    {
      "id": 58,
      "start": 1507.8399963378906,
      "end": 1514.7599792480469,
      "text": " then are you my disciples indeed and so there's an expectation to continue you"
    },
    {
      "id": 59,
      "start": 1514.7599792480469,
      "end": 1517.9199829101562,
      "text": " understand this very important truth this morning that you never arrive in"
    },
    {
      "id": 60,
      "start": 1517.9199829101562,
      "end": 1523.7599792480469,
      "text": " the Christian life we ought to always be moving forward in our growth why because"
    },
    {
      "id": 61,
      "start": 1523.7599792480469,
      "end": 1528.3599853515625,
      "text": " we're to be like Jesus and Jesus is perfect he left us an example according"
    },
    {
      "id": 62,
      "start": 1528.3599853515625,
      "end": 1532.6399841308594,
      "text": " to what Peter said that we should follow his steps and what a blessing to"
    },
    {
      "id": 63,
      "start": 1532.6399841308594,
      "end": 1538.0,
      "text": " understand that progress that we make daily as we walk with God listen I don't"
    },
    {
      "id": 64,
      "start": 1538.0,
      "end": 1541.8800048828125,
      "text": " I can't even tell you I wish I would have kept track years ago on how many"
    },
    {
      "id": 65,
      "start": 1541.8800048828125,
      "end": 1545.8399963378906,
      "text": " times I've read through the Bible I'd never I just never kept track of it so I"
    },
    {
      "id": 66,
      "start": 1545.8399963378906,
      "end": 1550.6399841308594,
      "text": " can't tell you how many times I've read through the Bible but it's not enough I"
    },
    {
      "id": 67,
      "start": 1550.6399841308594,
      "end": 1555.9599914550781,
      "text": " read it every day every day I want more of it I want more of it I want more of"
    },
    {
      "id": 68,
      "start": 1555.9599914550781,
      "end": 1561.8800048828125,
      "text": " it there are plenty of books that I've read once and I've never opened them"
    },
    {
      "id": 69,
      "start": 1561.8800048828125,
      "end": 1567.5599975585938,
      "text": " again plenty there are some that I've opened and I've never finished maybe"
    },
    {
      "id": 70,
      "start": 1567.5599975585938,
      "end": 1573.1600036621094,
      "text": " some of you can relate there are a handful of books that I have reread"
    },
    {
      "id": 71,
      "start": 1573.1600036621094,
      "end": 1576.7999877929688,
      "text": " that I've said you know what this is a good book it's a good reminder this is"
    },
    {
      "id": 72,
      "start": 1576.7999877929688,
      "end": 1581.239990234375,
      "text": " something that I need to add to my annual reading list I have a couple of"
    },
    {
      "id": 73,
      "start": 1581.239990234375,
      "end": 1585.6000061035156,
      "text": " books like that but there's no book that even comes close to how often I read"
    },
    {
      "id": 74,
      "start": 1585.6000061035156,
      "end": 1591.47998046875,
      "text": " this book Clarence Sexton said don't get your theology from some textbook get it"
    },
    {
      "id": 75,
      "start": 1591.47998046875,
      "end": 1597.1199951171875,
      "text": " from the Bible that's a good truth and I'm thankful for the books that people"
    },
    {
      "id": 76,
      "start": 1597.1199951171875,
      "end": 1601.7200012207031,
      "text": " have written I'm thankful for the information that is out there but if I"
    },
    {
      "id": 77,
      "start": 1601.7200012207031,
      "end": 1605.3200073242188,
      "text": " spend too much time reading that and not enough time reading this I'm in trouble"
    },
    {
      "id": 78,
      "start": 1605.3200073242188,
      "end": 1611.3999938964844,
      "text": " I need the Bible and so we're continually making that progress notice"
    },
    {
      "id": 79,
      "start": 1611.3999938964844,
      "end": 1617.3599853515625,
      "text": " what he says in verse number 11 and we desire you see this desire on the part"
    },
    {
      "id": 80,
      "start": 1617.3599853515625,
      "end": 1622.1600036621094,
      "text": " of the spiritual leader for the the followers to continue and to make that"
    },
    {
      "id": 81,
      "start": 1622.1600036621094,
      "end": 1627.4400024414062,
      "text": " progress I mentioned as we started this warning passage in Hebrews 5 in verse"
    },
    {
      "id": 82,
      "start": 1627.4400024414062,
      "end": 1631.8399963378906,
      "text": " number 11 when the writer said of whom we have many things to say and hard to"
    },
    {
      "id": 83,
      "start": 1631.8399963378906,
      "end": 1636.6799926757812,
      "text": " be uttered seeing your dull of hearing it wasn't that the teacher had a hard"
    },
    {
      "id": 84,
      "start": 1636.6799926757812,
      "end": 1641.3200073242188,
      "text": " time giving the truth it was that the teacher understood the student wasn't"
    },
    {
      "id": 85,
      "start": 1641.47998046875,
      "end": 1647.8399963378906,
      "text": " ready for it they were dull of hearing and as we understand the the heart and"
    },
    {
      "id": 86,
      "start": 1647.8399963378906,
      "end": 1654.0399780273438,
      "text": " the concern of the spiritual leader to give truth to fulfill the Great"
    },
    {
      "id": 87,
      "start": 1654.0399780273438,
      "end": 1658.7999877929688,
      "text": " Commission not only to preach the gospel and to baptize but to teach them all"
    },
    {
      "id": 88,
      "start": 1658.7999877929688,
      "end": 1666.2799987792969,
      "text": " things and we understand here that he says we desire that every one of you do"
    },
    {
      "id": 89,
      "start": 1666.2799987792969,
      "end": 1671.8800048828125,
      "text": " show notice what he says the same diligence to the full assurance of hope"
    },
    {
      "id": 90,
      "start": 1671.8800048828125,
      "end": 1676.8800048828125,
      "text": " unto the end now that's a lot of truth in there and the reality is that we"
    },
    {
      "id": 91,
      "start": 1676.8800048828125,
      "end": 1681.6000061035156,
      "text": " ought to as we understand this truth of continuing and this expectation to"
    },
    {
      "id": 92,
      "start": 1681.6000061035156,
      "end": 1689.6000061035156,
      "text": " continue that we find that we're to continue notice unto the end until you're"
    },
    {
      "id": 93,
      "start": 1689.6000061035156,
      "end": 1696.3200073242188,
      "text": " taken to glory you ought to be growing in your Christian walk amen every day"
    },
    {
      "id": 94,
      "start": 1696.3200073242188,
      "end": 1704.8800048828125,
      "text": " you ought to be growing we never arrive we make progress day by day I've said"
    },
    {
      "id": 95,
      "start": 1704.8800048828125,
      "end": 1708.1199951171875,
      "text": " often over the years that you're as close to God today as you really want to"
    },
    {
      "id": 96,
      "start": 1708.1199951171875,
      "end": 1714.760009765625,
      "text": " be the one that is the youngest spiritually in our midst could be the"
    },
    {
      "id": 97,
      "start": 1714.760009765625,
      "end": 1721.760009765625,
      "text": " most spiritual in our midst we ought to be making progress every day and you"
    },
    {
      "id": 98,
      "start": 1721.760009765625,
      "end": 1725.719970703125,
      "text": " notice these as we desire that anyone every one of you notice what he says do"
    },
    {
      "id": 99,
      "start": 1725.719970703125,
      "end": 1730.47998046875,
      "text": " show the same diligence he says in verse number 12 that you be not slothful you"
    },
    {
      "id": 100,
      "start": 1730.47998046875,
      "end": 1734.3999633789062,
      "text": " put those thoughts together and you understand there's a purpose that the"
    },
    {
      "id": 101,
      "start": 1734.3999633789062,
      "end": 1739.0399780273438,
      "text": " individual has if you read the book of Psalms and it's a wonderful encouraging"
    },
    {
      "id": 102,
      "start": 1739.0399780273438,
      "end": 1742.2799682617188,
      "text": " thing as you read through all of the Psalms but something that you'll notice"
    },
    {
      "id": 103,
      "start": 1742.2799682617188,
      "end": 1745.760009765625,
      "text": " as you read through the book of Psalms that oftentimes you find these"
    },
    {
      "id": 104,
      "start": 1745.760009765625,
      "end": 1752.0,
      "text": " statements of the psalmist I will I will I will and they're these purposed"
    },
    {
      "id": 105,
      "start": 1752.0,
      "end": 1757.9600219726562,
      "text": " statements of some things that the psalmist says he's going to do and the"
    },
    {
      "id": 106,
      "start": 1757.9600219726562,
      "end": 1762.239990234375,
      "text": " importance as we understand our lives that we have this diligence that we're"
    },
    {
      "id": 107,
      "start": 1762.239990234375,
      "end": 1767.239990234375,
      "text": " not slothful that we understand listen there's some effort that we need to put"
    },
    {
      "id": 108,
      "start": 1767.239990234375,
      "end": 1772.52001953125,
      "text": " into this thing of growing spiritually I remember when I was a kid and I I"
    },
    {
      "id": 109,
      "start": 1772.52001953125,
      "end": 1776.0,
      "text": " remember so I don't even know who it was some probably my brother because he's"
    },
    {
      "id": 110,
      "start": 1776.0,
      "end": 1779.6799926757812,
      "text": " always trying to tell a story but somebody was talking about how you could"
    },
    {
      "id": 111,
      "start": 1779.6799926757812,
      "end": 1785.719970703125,
      "text": " sleep on a on a textbook and by osmosis you would just get the stuff right how"
    },
    {
      "id": 112,
      "start": 1785.719970703125,
      "end": 1789.6799926757812,
      "text": " like that's a really good idea you know what it's not true right I mean it just"
    },
    {
      "id": 113,
      "start": 1789.6799926757812,
      "end": 1795.3599853515625,
      "text": " doesn't work but but the reality is that if I want to grow in my walk with Christ"
    },
    {
      "id": 114,
      "start": 1795.3599853515625,
      "end": 1803.3599853515625,
      "text": " I gotta put some effort into it if you want any relationship to grow"
    },
    {
      "id": 0,
      "start": 1803.3599853515625,
      "end": 1805.9399852752686,
      "text": " you've got to put effort into it."
    },
    {
      "id": 1,
      "start": 1805.9399852752686,
      "end": 1808.1199855804443,
      "text": " There's got to be an investment."
    },
    {
      "id": 2,
      "start": 1808.1199855804443,
      "end": 1810.919985294342,
      "text": " If I want my marriage to be what it needs to be,"
    },
    {
      "id": 3,
      "start": 1810.919985294342,
      "end": 1813.4999856948853,
      "text": " if our relationship is going to be what it needs to be,"
    },
    {
      "id": 4,
      "start": 1813.4999856948853,
      "end": 1816.1399850845337,
      "text": " I need to be making some investment,"
    },
    {
      "id": 5,
      "start": 1816.1399850845337,
      "end": 1819.3799858093262,
      "text": " some purposed investment in our relationship."
    },
    {
      "id": 6,
      "start": 1819.3799858093262,
      "end": 1821.2999858856201,
      "text": " If I want relationship with my kids"
    },
    {
      "id": 7,
      "start": 1821.2999858856201,
      "end": 1823.5399856567383,
      "text": " and I want that to be what it ought to be,"
    },
    {
      "id": 8,
      "start": 1823.5399856567383,
      "end": 1824.9399852752686,
      "text": " I need to invest in it."
    },
    {
      "id": 9,
      "start": 1824.9399852752686,
      "end": 1828.5399856567383,
      "text": " I need to purpose in that relationship."
    },
    {
      "id": 10,
      "start": 1828.5399856567383,
      "end": 1830.659984588623,
      "text": " I'm thankful that I have a relationship with God"
    },
    {
      "id": 11,
      "start": 1830.659984588623,
      "end": 1831.579984664917,
      "text": " that is constant."
    },
    {
      "id": 12,
      "start": 1831.579984664917,
      "end": 1834.0199851989746,
      "text": " He's my Father and I am His child"
    },
    {
      "id": 13,
      "start": 1834.0199851989746,
      "end": 1835.659984588623,
      "text": " and what a blessing that is."
    },
    {
      "id": 14,
      "start": 1835.659984588623,
      "end": 1837.8999862670898,
      "text": " When we think about the truth of fellowship"
    },
    {
      "id": 15,
      "start": 1837.8999862670898,
      "end": 1839.6199836730957,
      "text": " in our walk with God,"
    },
    {
      "id": 16,
      "start": 1839.6199836730957,
      "end": 1842.3199844360352,
      "text": " we need to invest in it."
    },
    {
      "id": 17,
      "start": 1842.3199844360352,
      "end": 1844.8199844360352,
      "text": " We need to spend time, right?"
    },
    {
      "id": 18,
      "start": 1844.8199844360352,
      "end": 1846.659984588623,
      "text": " You know what the greatest investment is"
    },
    {
      "id": 19,
      "start": 1846.659984588623,
      "end": 1848.4399871826172,
      "text": " that you can make in your relationships"
    },
    {
      "id": 20,
      "start": 1848.4399871826172,
      "end": 1851.6799850463867,
      "text": " with your spouse and with your children is time."
    },
    {
      "id": 21,
      "start": 1853.5399856567383,
      "end": 1856.5399856567383,
      "text": " One of the early presidents of the United States of America,"
    },
    {
      "id": 22,
      "start": 1858.0999870300293,
      "end": 1860.9799842834473,
      "text": " he took a day to go and spend with his son"
    },
    {
      "id": 23,
      "start": 1860.9799842834473,
      "end": 1862.499984741211,
      "text": " and to go fishing."
    },
    {
      "id": 24,
      "start": 1862.499984741211,
      "end": 1864.7399864196777,
      "text": " Both of them took journals."
    },
    {
      "id": 25,
      "start": 1866.1799850463867,
      "end": 1868.379981994629,
      "text": " It was a daily routine in their lives"
    },
    {
      "id": 26,
      "start": 1868.379981994629,
      "end": 1871.099983215332,
      "text": " to have journal and to journal through things."
    },
    {
      "id": 27,
      "start": 1871.099983215332,
      "end": 1873.219985961914,
      "text": " And the president of the United States after that day"
    },
    {
      "id": 28,
      "start": 1873.219985961914,
      "end": 1877.6599884033203,
      "text": " said, went fishing with my boy, a day wasted."
    },
    {
      "id": 29,
      "start": 1880.4199829101562,
      "end": 1881.8999862670898,
      "text": " That's what he said."
    },
    {
      "id": 30,
      "start": 1881.8999862670898,
      "end": 1885.6999816894531,
      "text": " On the very same day in the journal of the son,"
    },
    {
      "id": 31,
      "start": 1885.6999816894531,
      "end": 1890.1599884033203,
      "text": " went fishing with my dad, best day of my life."
    },
    {
      "id": 32,
      "start": 1891.219985961914,
      "end": 1892.9799880981445,
      "text": " Does that give you some perspective?"
    },
    {
      "id": 33,
      "start": 1894.099983215332,
      "end": 1895.619987487793,
      "text": " Time."
    },
    {
      "id": 34,
      "start": 1895.619987487793,
      "end": 1897.8999862670898,
      "text": " It takes time to read the Bible."
    },
    {
      "id": 35,
      "start": 1897.8999862670898,
      "end": 1900.4199829101562,
      "text": " It takes time to pray."
    },
    {
      "id": 36,
      "start": 1900.4199829101562,
      "end": 1901.6799850463867,
      "text": " It just does."
    },
    {
      "id": 37,
      "start": 1903.1399841308594,
      "end": 1907.1799850463867,
      "text": " My dad, years ago, I think it was in 1998,"
    },
    {
      "id": 38,
      "start": 1907.1799850463867,
      "end": 1908.499984741211,
      "text": " I was a senior in high school"
    },
    {
      "id": 39,
      "start": 1908.499984741211,
      "end": 1910.5399856567383,
      "text": " and I remember he was given a devotion"
    },
    {
      "id": 40,
      "start": 1910.5399856567383,
      "end": 1912.7799835205078,
      "text": " in our church in California"
    },
    {
      "id": 41,
      "start": 1912.7799835205078,
      "end": 1914.6599884033203,
      "text": " to the men at a men's prayer breakfast"
    },
    {
      "id": 42,
      "start": 1914.6599884033203,
      "end": 1916.379981994629,
      "text": " and I remember him using an illustration"
    },
    {
      "id": 43,
      "start": 1916.379981994629,
      "end": 1918.8599853515625,
      "text": " of a book that he saw."
    },
    {
      "id": 44,
      "start": 1918.8599853515625,
      "end": 1919.9799880981445,
      "text": " I don't think he bought it,"
    },
    {
      "id": 45,
      "start": 1919.9799880981445,
      "end": 1922.099983215332,
      "text": " but it was a book that he saw at a Christian bookstore"
    },
    {
      "id": 46,
      "start": 1922.099983215332,
      "end": 1924.5799865722656,
      "text": " and it said how to pray in nine minutes"
    },
    {
      "id": 47,
      "start": 1924.5799865722656,
      "end": 1926.8999862670898,
      "text": " and 59 seconds or less."
    },
    {
      "id": 48,
      "start": 1926.8999862670898,
      "end": 1930.8199844360352,
      "text": " And it was just this idea of this fast-paced society, right?"
    },
    {
      "id": 49,
      "start": 1930.8199844360352,
      "end": 1932.4599914550781,
      "text": " And he used his illustration,"
    },
    {
      "id": 50,
      "start": 1932.4599914550781,
      "end": 1935.0599822998047,
      "text": " really in the negative context of the illustration."
    },
    {
      "id": 51,
      "start": 1935.0599822998047,
      "end": 1935.8799896240234,
      "text": " Why?"
    },
    {
      "id": 52,
      "start": 1935.8799896240234,
      "end": 1938.0199890136719,
      "text": " Because we need to labor in prayer."
    },
    {
      "id": 53,
      "start": 1938.0199890136719,
      "end": 1940.3799896240234,
      "text": " The effectual fervent prayer of a righteous man"
    },
    {
      "id": 54,
      "start": 1940.3799896240234,
      "end": 1944.8999786376953,
      "text": " availeth much, our God hears and answers prayer."
    },
    {
      "id": 55,
      "start": 1944.8999786376953,
      "end": 1946.6999816894531,
      "text": " And we find that there's this investment."
    },
    {
      "id": 56,
      "start": 1946.6999816894531,
      "end": 1948.5399780273438,
      "text": " He says, continue unto the end."
    },
    {
      "id": 57,
      "start": 1948.5399780273438,
      "end": 1952.0599822998047,
      "text": " I think about this truth, run your race."
    },
    {
      "id": 58,
      "start": 1952.0599822998047,
      "end": 1953.9399871826172,
      "text": " In Hebrews chapter number 12,"
    },
    {
      "id": 59,
      "start": 1953.9399871826172,
      "end": 1956.2999877929688,
      "text": " we have as our theme, verse number two,"
    },
    {
      "id": 60,
      "start": 1956.2999877929688,
      "end": 1958.9399871826172,
      "text": " looking unto Jesus, the author and finisher of our faith,"
    },
    {
      "id": 61,
      "start": 1958.9399871826172,
      "end": 1960.5999908447266,
      "text": " but we find that in verse number one"
    },
    {
      "id": 62,
      "start": 1960.5999908447266,
      "end": 1962.0599822998047,
      "text": " of Hebrews chapter number 12,"
    },
    {
      "id": 63,
      "start": 1962.0599822998047,
      "end": 1964.6199798583984,
      "text": " it says, wherefore seeing also we are compassed about"
    },
    {
      "id": 64,
      "start": 1964.6199798583984,
      "end": 1966.4199829101562,
      "text": " with so great a cloud of witnesses,"
    },
    {
      "id": 65,
      "start": 1966.4199829101562,
      "end": 1969.1799926757812,
      "text": " let us lay aside every weight and the sin"
    },
    {
      "id": 66,
      "start": 1969.1799926757812,
      "end": 1970.7799835205078,
      "text": " which doth so easily beset us"
    },
    {
      "id": 67,
      "start": 1970.7799835205078,
      "end": 1974.6199798583984,
      "text": " and let us run with patience the race"
    },
    {
      "id": 68,
      "start": 1974.6199798583984,
      "end": 1975.739990234375,
      "text": " that is set before us."
    },
    {
      "id": 69,
      "start": 1975.7799835205078,
      "end": 1979.219985961914,
      "text": " Looking unto Jesus, the author and finisher of our faith,"
    },
    {
      "id": 70,
      "start": 1979.219985961914,
      "end": 1981.0999908447266,
      "text": " who for the joy that was set before him"
    },
    {
      "id": 71,
      "start": 1981.0999908447266,
      "end": 1983.219985961914,
      "text": " endured the cross, despising the shame,"
    },
    {
      "id": 72,
      "start": 1983.219985961914,
      "end": 1987.9399871826172,
      "text": " and is set down at the right hand of the throne of God."
    },
    {
      "id": 73,
      "start": 1987.9399871826172,
      "end": 1989.3399810791016,
      "text": " We need to run our race."
    },
    {
      "id": 74,
      "start": 1989.3399810791016,
      "end": 1992.219985961914,
      "text": " Faithful unto the end."
    },
    {
      "id": 75,
      "start": 1992.219985961914,
      "end": 1994.4199829101562,
      "text": " Some have said over the years,"
    },
    {
      "id": 76,
      "start": 1994.4199829101562,
      "end": 1998.8999786376953,
      "text": " they didn't start well, but they finished well."
    },
    {
      "id": 77,
      "start": 1998.8999786376953,
      "end": 2000.6799926757812,
      "text": " I like that."
    },
    {
      "id": 78,
      "start": 2000.6799926757812,
      "end": 2002.1799926757812,
      "text": " I wanna finish well."
    },
    {
      "id": 79,
      "start": 2002.1799926757812,
      "end": 2004.5799865722656,
      "text": " I wanna be able to say, as Paul said,"
    },
    {
      "id": 80,
      "start": 2004.5799865722656,
      "end": 2006.6599884033203,
      "text": " I finished my course."
    },
    {
      "id": 81,
      "start": 2006.6599884033203,
      "end": 2008.8999786376953,
      "text": " But you know, that didn't happen by accident."
    },
    {
      "id": 82,
      "start": 2008.8999786376953,
      "end": 2010.739990234375,
      "text": " If you study the life of Paul,"
    },
    {
      "id": 83,
      "start": 2010.739990234375,
      "end": 2012.8199920654297,
      "text": " and you were to look at 2 Timothy chapter number four"
    },
    {
      "id": 84,
      "start": 2012.8199920654297,
      "end": 2013.739990234375,
      "text": " in verses seven and eight,"
    },
    {
      "id": 85,
      "start": 2013.739990234375,
      "end": 2016.499984741211,
      "text": " when he says to Timothy, his son in the faith,"
    },
    {
      "id": 86,
      "start": 2016.499984741211,
      "end": 2019.0199890136719,
      "text": " the time of my departure's at hand."
    },
    {
      "id": 87,
      "start": 2019.0199890136719,
      "end": 2021.8199920654297,
      "text": " And he says, I have finished my course."
    },
    {
      "id": 88,
      "start": 2021.8199920654297,
      "end": 2025.6599884033203,
      "text": " If you look back in chapter number 20 of the book of Acts,"
    },
    {
      "id": 89,
      "start": 2025.6599884033203,
      "end": 2027.2599792480469,
      "text": " and you see as the apostle Paul"
    },
    {
      "id": 90,
      "start": 2027.2599792480469,
      "end": 2029.8599853515625,
      "text": " is speaking to the Ephesian elders,"
    },
    {
      "id": 91,
      "start": 2029.9399871826172,
      "end": 2034.9399871826172,
      "text": " he says to them that I might finish my course with joy."
    },
    {
      "id": 92,
      "start": 2035.7799835205078,
      "end": 2037.7799835205078,
      "text": " It was a desire that Paul had."
    },
    {
      "id": 93,
      "start": 2038.8599853515625,
      "end": 2043.8599853515625,
      "text": " He didn't just end up finishing strong or finishing well."
    },
    {
      "id": 94,
      "start": 2043.8599853515625,
      "end": 2046.0599822998047,
      "text": " He purposed to finish well."
    },
    {
      "id": 95,
      "start": 2047.1399841308594,
      "end": 2050.499984741211,
      "text": " There's some decisions he had to make along the way"
    },
    {
      "id": 96,
      "start": 2050.499984741211,
      "end": 2054.459991455078,
      "text": " to accomplish that which he set out to accomplish."
    },
    {
      "id": 97,
      "start": 2054.459991455078,
      "end": 2059.1399841308594,
      "text": " So thankful that God helps us along the way."
    },
    {
      "id": 98,
      "start": 2059.1799926757812,
      "end": 2061.5399780273438,
      "text": " We think about this expectation to continue,"
    },
    {
      "id": 99,
      "start": 2061.5399780273438,
      "end": 2065.0599975585938,
      "text": " and we find that it was to continue unto the end."
    },
    {
      "id": 100,
      "start": 2065.0599975585938,
      "end": 2066.779998779297,
      "text": " But we also notice in verse number 12,"
    },
    {
      "id": 101,
      "start": 2066.779998779297,
      "end": 2070.219970703125,
      "text": " look what he says, that ye be not slothful, notice this,"
    },
    {
      "id": 102,
      "start": 2070.219970703125,
      "end": 2075.219970703125,
      "text": " but followers of them who through faith and patience"
    },
    {
      "id": 103,
      "start": 2075.2999877929688,
      "end": 2078.5,
      "text": " inherit the promises."
    },
    {
      "id": 104,
      "start": 2078.5,
      "end": 2081.5399780273438,
      "text": " Now, we find that he talks about here,"
    },
    {
      "id": 105,
      "start": 2081.5399780273438,
      "end": 2083.3399963378906,
      "text": " but be followers of them."
    },
    {
      "id": 106,
      "start": 2083.3399963378906,
      "end": 2084.2999877929688,
      "text": " Who's them?"
    },
    {
      "id": 107,
      "start": 2084.2999877929688,
      "end": 2087.5799865722656,
      "text": " Who through faith and patience inherit the promises."
    },
    {
      "id": 108,
      "start": 2087.5799865722656,
      "end": 2090.219970703125,
      "text": " You know, there are many examples for us to follow."
    },
    {
      "id": 109,
      "start": 2091.3799743652344,
      "end": 2095.019989013672,
      "text": " In fact, as we look at this thought of faith and patience"
    },
    {
      "id": 110,
      "start": 2095.019989013672,
      "end": 2097.459991455078,
      "text": " that is listed here, in just a few chapters,"
    },
    {
      "id": 111,
      "start": 2097.459991455078,
      "end": 2099.8999938964844,
      "text": " you're gonna come to Hebrews chapter number 11."
    },
    {
      "id": 112,
      "start": 2099.8999938964844,
      "end": 2101.8599853515625,
      "text": " We often speak of Hebrews chapter number 11"
    },
    {
      "id": 113,
      "start": 2101.8599853515625,
      "end": 2104.6199951171875,
      "text": " as being a hall of faith chapter."
    },
    {
      "id": 114,
      "start": 2104.6199951171875,
      "end": 2106.5,
      "text": " By faith, this one did this."
    },
    {
      "id": 115,
      "start": 2106.5,
      "end": 2108.5,
      "text": " By faith, this one did this, right?"
    },
    {
      "id": 116,
      "start": 2108.5,
      "end": 2111.019989013672,
      "text": " And you find you get to the end of the chapter,"
    },
    {
      "id": 117,
      "start": 2111.019989013672,
      "end": 2113.219970703125,
      "text": " and he says, we don't have enough time."
    },
    {
      "id": 118,
      "start": 2113.219970703125,
      "end": 2117.1399841308594,
      "text": " And so he just kind of wraps up quickly a number of things."
    },
    {
      "id": 119,
      "start": 2117.739990234375,
      "end": 2119.2999877929688,
      "text": " The people that he's going to reference,"
    },
    {
      "id": 120,
      "start": 2119.2999877929688,
      "end": 2122.0999755859375,
      "text": " but you find that in Hebrews chapter number 11,"
    },
    {
      "id": 121,
      "start": 2122.0999755859375,
      "end": 2124.8999938964844,
      "text": " he said there's some examples to follow."
    },
    {
      "id": 122,
      "start": 2124.8999938964844,
      "end": 2129.6199951171875,
      "text": " Who through faith and patience inherit the promises."
    },
    {
      "id": 123,
      "start": 2129.6199951171875,
      "end": 2132.0599975585938,
      "text": " I think about the example of the Apostle Paul."
    },
    {
      "id": 124,
      "start": 2132.0599975585938,
      "end": 2133.939971923828,
      "text": " We've mentioned him often today."
    },
    {
      "id": 125,
      "start": 2133.939971923828,
      "end": 2135.2999877929688,
      "text": " He said to the believers in Corinth,"
    },
    {
      "id": 126,
      "start": 2135.2999877929688,
      "end": 2139.219970703125,
      "text": " be followers of me, even so as I am of the Lord."
    },
    {
      "id": 127,
      "start": 2139.219970703125,
      "end": 2143.2999877929688,
      "text": " See, the Apostle Paul followed the Lord Jesus Christ."
    },
    {
      "id": 128,
      "start": 2143.2999877929688,
      "end": 2146.5399780273438,
      "text": " And therefore, he could say, be followers of me."
    },
    {
      "id": 129,
      "start": 2146.5399780273438,
      "end": 2148.8599853515625,
      "text": " He wasn't trying to get a group of people"
    },
    {
      "id": 130,
      "start": 2148.8599853515625,
      "end": 2151.0599975585938,
      "text": " to follow him and start his own thing."
    },
    {
      "id": 131,
      "start": 2151.0599975585938,
      "end": 2154.739990234375,
      "text": " No, he was saying, I can be an example for you."
    },
    {
      "id": 132,
      "start": 2154.739990234375,
      "end": 2158.6199951171875,
      "text": " We find that he says in Philippians in chapter number four,"
    },
    {
      "id": 133,
      "start": 2158.6199951171875,
      "end": 2162.6599731445312,
      "text": " in verse number nine, with regard to the admonition"
    },
    {
      "id": 134,
      "start": 2162.6599731445312,
      "end": 2164.779998779297,
      "text": " to the believers in Philippi,"
    },
    {
      "id": 135,
      "start": 2164.779998779297,
      "end": 2166.8199768066406,
      "text": " he says those things which you have both learned"
    },
    {
      "id": 136,
      "start": 2166.8199768066406,
      "end": 2169.939971923828,
      "text": " and received and heard, but then he says this,"
    },
    {
      "id": 137,
      "start": 2169.939971923828,
      "end": 2173.8199768066406,
      "text": " and seen in me, do."
    },
    {
      "id": 138,
      "start": 2174.6599731445312,
      "end": 2176.6599731445312,
      "text": " The God of peace shall be with you."
    },
    {
      "id": 139,
      "start": 2178.019989013672,
      "end": 2180.3399963378906,
      "text": " It's interesting as I think about the many examples"
    },
    {
      "id": 140,
      "start": 2180.3399963378906,
      "end": 2183.459991455078,
      "text": " that we have to follow, and I think about this truth"
    },
    {
      "id": 141,
      "start": 2183.459991455078,
      "end": 2186.219970703125,
      "text": " in Hebrews chapter number six in verse number 12."
    },
    {
      "id": 142,
      "start": 2186.219970703125,
      "end": 2187.939971923828,
      "text": " He talks about but followers of them"
    },
    {
      "id": 143,
      "start": 2187.939971923828,
      "end": 2190.739990234375,
      "text": " who through faith and patience inherit the promises."
    },
    {
      "id": 144,
      "start": 2190.739990234375,
      "end": 2193.1799926757812,
      "text": " The reality is that if you stay within the context"
    },
    {
      "id": 145,
      "start": 2193.1799926757812,
      "end": 2195.97998046875,
      "text": " of the book of Hebrews and you come to the final chapter"
    },
    {
      "id": 146,
      "start": 2195.97998046875,
      "end": 2198.6599731445312,
      "text": " in chapter number 13 in verse number seven,"
    },
    {
      "id": 147,
      "start": 2198.6599731445312,
      "end": 2203.6199951171875,
      "text": " I want you to notice what is said with regard to one group,"
    },
    {
      "id": 148,
      "start": 2204.459991455078,
      "end": 2206.97998046875,
      "text": " at least of folks that ought to be a good example to follow."
    },
    {
      "id": 149,
      "start": 2206.97998046875,
      "end": 2209.0599975585938,
      "text": " He says in verse number seven of Hebrews 13,"
    },
    {
      "id": 150,
      "start": 2209.0599975585938,
      "end": 2211.8199768066406,
      "text": " remember them which have the rule over you,"
    },
    {
      "id": 151,
      "start": 2211.8199768066406,
      "end": 2214.8999938964844,
      "text": " who have spoken unto you the word of God."
    },
    {
      "id": 152,
      "start": 2214.8999938964844,
      "end": 2218.3399963378906,
      "text": " Notice this, whose faith follow,"
    },
    {
      "id": 153,
      "start": 2219.459991455078,
      "end": 2222.0999755859375,
      "text": " considering the end of their conversation,"
    },
    {
      "id": 154,
      "start": 2222.0999755859375,
      "end": 2225.6199951171875,
      "text": " their lifestyle, their behavior, whose faith follow."
    },
    {
      "id": 155,
      "start": 2225.6199951171875,
      "end": 2228.4199829101562,
      "text": " The one being spoken of in Hebrews 13 in verse number seven"
    },
    {
      "id": 156,
      "start": 2228.4199829101562,
      "end": 2232.699981689453,
      "text": " is the spiritual leader, the pastor if you will,"
    },
    {
      "id": 157,
      "start": 2233.019989013672,
      "end": 2234.779998779297,
      "text": " that they have spoken unto you the word of God"
    },
    {
      "id": 158,
      "start": 2234.779998779297,
      "end": 2236.5399780273438,
      "text": " and whose faith follow."
    },
    {
      "id": 159,
      "start": 2236.5399780273438,
      "end": 2239.8599853515625,
      "text": " You know, it ought to be that the message of the lips"
    },
    {
      "id": 160,
      "start": 2239.8599853515625,
      "end": 2242.3399963378906,
      "text": " matches the message of the life."
    },
    {
      "id": 161,
      "start": 2242.3399963378906,
      "end": 2243.939971923828,
      "text": " Or maybe I should say that the other way around,"
    },
    {
      "id": 162,
      "start": 2243.939971923828,
      "end": 2245.019989013672,
      "text": " that the message of our life"
    },
    {
      "id": 163,
      "start": 2245.019989013672,
      "end": 2247.779998779297,
      "text": " matches the message of our lips."
    },
    {
      "id": 164,
      "start": 2249.019989013672,
      "end": 2252.8999938964844,
      "text": " Solomon said, my son, give me thine heart"
    },
    {
      "id": 165,
      "start": 2252.8999938964844,
      "end": 2257.219970703125,
      "text": " and let thine eyes observe my ways."
    },
    {
      "id": 166,
      "start": 2257.219970703125,
      "end": 2259.5799865722656,
      "text": " Now we know that Solomon wasn't a great example."
    },
    {
      "id": 167,
      "start": 2259.5799865722656,
      "end": 2262.6599731445312,
      "text": " You study his life and of course many errors in his life."
    },
    {
      "id": 168,
      "start": 2263.5,
      "end": 2264.8599853515625,
      "text": " Though he had great wisdom."
    },
    {
      "id": 169,
      "start": 2264.8599853515625,
      "end": 2267.3399963378906,
      "text": " And the reality today is that we find"
    },
    {
      "id": 170,
      "start": 2267.3399963378906,
      "end": 2270.2999877929688,
      "text": " that he speaks about this at the end of Hebrews 13"
    },
    {
      "id": 171,
      "start": 2270.2999877929688,
      "end": 2273.219970703125,
      "text": " about the example and whose faith follow."
    },
    {
      "id": 172,
      "start": 2273.219970703125,
      "end": 2275.8599853515625,
      "text": " It's interesting if you couple this truth"
    },
    {
      "id": 173,
      "start": 2275.8599853515625,
      "end": 2278.8999938964844,
      "text": " with the challenge that the Apostle Paul gave to Timothy"
    },
    {
      "id": 174,
      "start": 2278.8999938964844,
      "end": 2281.8999938964844,
      "text": " in first Timothy in verse number 12 of the fourth chapter,"
    },
    {
      "id": 175,
      "start": 2281.8999938964844,
      "end": 2286.019989013672,
      "text": " he says that you're to be an example of the believers."
    },
    {
      "id": 176,
      "start": 2286.97998046875,
      "end": 2289.939971923828,
      "text": " Why didn't he tell Timothy to be an example?"
    },
    {
      "id": 177,
      "start": 2289.939971923828,
      "end": 2291.459991455078,
      "text": " Whose faith follow."
    },
    {
      "id": 178,
      "start": 2291.459991455078,
      "end": 2292.8599853515625,
      "text": " Timothy was gonna be in that place"
    },
    {
      "id": 179,
      "start": 2292.8599853515625,
      "end": 2294.8599853515625,
      "text": " of being a spiritual leader."
    },
    {
      "id": 180,
      "start": 2294.8599853515625,
      "end": 2299.3799743652344,
      "text": " And he said, Timothy, you're an example to these believers."
    },
    {
      "id": 181,
      "start": 2299.3799743652344,
      "end": 2303.6199951171875,
      "text": " And we think about this passage of scripture,"
    },
    {
      "id": 182,
      "start": 2303.6199951171875,
      "end": 2306.219970703125,
      "text": " things that accompany salvation."
    },
    {
      "id": 183,
      "start": 2306.219970703125,
      "end": 2310.6199951171875,
      "text": " See, there are, there should be in your life"
    },
    {
      "id": 184,
      "start": 2310.6199951171875,
      "end": 2312.3399963378906,
      "text": " evidences of conversion."
    },
    {
      "id": 185,
      "start": 2313.699981689453,
      "end": 2314.5399780273438,
      "text": " There should be."
    },
    {
      "id": 186,
      "start": 2315.5799560546875,
      "end": 2316.8599853515625,
      "text": " We can examine ourselves and say,"
    },
    {
      "id": 187,
      "start": 2316.8599853515625,
      "end": 2320.2999877929688,
      "text": " are there any evidences in my life that I belong to Christ?"
    },
    {
      "id": 188,
      "start": 2322.0199584960938,
      "end": 2323.1799926757812,
      "text": " No, we're not gonna be perfect."
    },
    {
      "id": 189,
      "start": 2323.1799926757812,
      "end": 2324.7000122070312,
      "text": " We understand that."
    },
    {
      "id": 190,
      "start": 2324.7000122070312,
      "end": 2328.6599731445312,
      "text": " But there ought to be some signs of life spiritually."
    },
    {
      "id": 191,
      "start": 2328.6599731445312,
      "end": 2331.739990234375,
      "text": " There ought to be some birthmarks of a believer."
    },
    {
      "id": 192,
      "start": 2331.739990234375,
      "end": 2335.0199584960938,
      "text": " And then there's an expectation to continue."
    },
    {
      "id": 193,
      "start": 2335.0199584960938,
      "end": 2337.1799926757812,
      "text": " That we continue to walk with God."
    },
    {
      "id": 194,
      "start": 2337.1799926757812,
      "end": 2340.1400146484375,
      "text": " We see that he speaks about continuing unto the end."
    },
    {
      "id": 195,
      "start": 2340.1400146484375,
      "end": 2344.5799560546875,
      "text": " We see that he speaks about the example follow,"
    },
    {
      "id": 196,
      "start": 2344.5799560546875,
      "end": 2347.1400146484375,
      "text": " to be followers of them who through faith and patience"
    },
    {
      "id": 197,
      "start": 2347.1400146484375,
      "end": 2349.1400146484375,
      "text": " inherit the promises."
    },
    {
      "id": 198,
      "start": 2349.1799926757812,
      "end": 2353.1400146484375,
      "text": " And I wonder this morning as we conclude our message,"
    },
    {
      "id": 199,
      "start": 2353.1400146484375,
      "end": 2357.4199829101562,
      "text": " we've mentioned several that are examples for us to follow."
    },
    {
      "id": 200,
      "start": 2357.4199829101562,
      "end": 2358.8599853515625,
      "text": " But I wonder and I would ask you,"
    },
    {
      "id": 201,
      "start": 2358.8599853515625,
      "end": 2360.4199829101562,
      "text": " I've asked myself the question"
    },
    {
      "id": 202,
      "start": 2360.4199829101562,
      "end": 2362.0999755859375,
      "text": " and I want you to ask yourself the question"
    },
    {
      "id": 203,
      "start": 2362.0999755859375,
      "end": 2363.8999633789062,
      "text": " this morning as well."
    },
    {
      "id": 204,
      "start": 2363.8999633789062,
      "end": 2367.6199951171875,
      "text": " Who can look at your life as an example to follow?"
    },
    {
      "id": 205,
      "start": 2369.3399658203125,
      "end": 2373.3800048828125,
      "text": " Is there someone that you could say,"
    },
    {
      "id": 206,
      "start": 2373.3800048828125,
      "end": 2376.0999755859375,
      "text": " as Paul did, be followers of me?"
    },
    {
      "id": 207,
      "start": 2377.0999755859375,
      "end": 2381.260009765625,
      "text": " That you would so closely follow the Lord Jesus Christ"
    },
    {
      "id": 208,
      "start": 2382.6199951171875,
      "end": 2385.0599975585938,
      "text": " that your life would be worth,"
    },
    {
      "id": 209,
      "start": 2385.0599975585938,
      "end": 2388.4199829101562,
      "text": " that would be that example that would be worth following."
    },
    {
      "id": 210,
      "start": 2388.4199829101562,
      "end": 2390.739990234375,
      "text": " I hope that you can say yes."
    },
    {
      "id": 211,
      "start": 2392.3399658203125,
      "end": 2396.0599975585938,
      "text": " Many times in life in various venues and settings,"
    },
    {
      "id": 212,
      "start": 2396.0599975585938,
      "end": 2400.219970703125,
      "text": " I have observed individuals, parents to be specific,"
    },
    {
      "id": 213,
      "start": 2401.2999877929688,
      "end": 2403.219970703125,
      "text": " who are embarrassed by some of the behavior."
    },
    {
      "id": 0,
      "start": 2403.219970703125,
      "end": 2408.599970817566,
      "text": " of their children. Have you? And sometimes the parent that's embarrassed says something"
    },
    {
      "id": 1,
      "start": 2408.599970817566,
      "end": 2415.799970626831,
      "text": " like this, I have no idea where they learned that. And you just kind of chuckle and say,"
    },
    {
      "id": 2,
      "start": 2415.799970626831,
      "end": 2421.6999702453613,
      "text": " hmm, I got a pretty good idea where they probably learned that. What do children do? They follow"
    },
    {
      "id": 3,
      "start": 2421.6999702453613,
      "end": 2428.9399700164795,
      "text": " the examples. Spiritually speaking, we're to be an example. There's some people, some"
    },
    {
      "id": 4,
      "start": 2428.9399700164795,
      "end": 2435.2599716186523,
      "text": " examples that we can follow. And we ought to be an example for others to follow. And"
    },
    {
      "id": 5,
      "start": 2435.2599716186523,
      "end": 2439.2599716186523,
      "text": " it doesn't always have to be somebody that's younger. Because spiritually speaking, the"
    },
    {
      "id": 6,
      "start": 2439.2599716186523,
      "end": 2448.0799713134766,
      "text": " youngest again among us can be the most spiritual and can be one of the best examples. Amen?"
    },
    {
      "id": 7,
      "start": 2448.0799713134766,
      "end": 2455.5999717712402,
      "text": " And so this morning, things that accompany salvation, are there evidences of conversion?"
    },
    {
      "id": 8,
      "start": 2455.5999717712402,
      "end": 2461.439971923828,
      "text": " You need to know that for yourself. Examine yourself. Am I in the faith? Yes, I've been"
    },
    {
      "id": 9,
      "start": 2461.439971923828,
      "end": 2467.439971923828,
      "text": " born again. And there are evidences of conversion in my life. And then there's this expectation"
    },
    {
      "id": 10,
      "start": 2467.439971923828,
      "end": 2472.2399673461914,
      "text": " to continue. Don't give up. Yea, all those that live godly in Christ Jesus shall suffer"
    },
    {
      "id": 11,
      "start": 2472.2399673461914,
      "end": 2478.319969177246,
      "text": " persecution. There are times in which it's tough. The devil's fighting and he's attacking."
    },
    {
      "id": 12,
      "start": 2478.319969177246,
      "end": 2484.3599700927734,
      "text": " So we're going to continue. We're going to be faithful until the end. Not in my own power,"
    },
    {
      "id": 13,
      "start": 2484.4799728393555,
      "end": 2489.599967956543,
      "text": " but in the power of Christ in me. Let's pray. Father, we love You. We thank You for loving"
    },
    {
      "id": 14,
      "start": 2489.599967956543,
      "end": 2494.6799697875977,
      "text": " us. Thank You for the Word of God and the truth that's contained therein. We thank You"
    },
    {
      "id": 15,
      "start": 2494.6799697875977,
      "end": 2500.7999725341797,
      "text": " for this passage of Scripture that gives us these things that accompany salvation. The"
    },
    {
      "id": 16,
      "start": 2500.7999725341797,
      "end": 2507.7999725341797,
      "text": " evidences specifically in the text, the labor, the service of Your people and the love, love"
    },
    {
      "id": 17,
      "start": 2508.1599731445312,
      "end": 2513.3599700927734,
      "text": " for God, love for the brethren. God, I pray that those that are watching online, those"
    },
    {
      "id": 18,
      "start": 2513.3599700927734,
      "end": 2518.119972229004,
      "text": " that are gathered here at the church house, Lord, that we would be able to say there are"
    },
    {
      "id": 19,
      "start": 2518.119972229004,
      "end": 2524.119972229004,
      "text": " evidences in our lives of conversion. However, we understand that there might be one among"
    },
    {
      "id": 20,
      "start": 2524.119972229004,
      "end": 2529.719970703125,
      "text": " us or one that's watching that's never trusted the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 21,
      "start": 2529.719970703125,
      "end": 2534.5999755859375,
      "text": " God, it's our prayer that today would be the day of their salvation. They would not leave"
    },
    {
      "id": 22,
      "start": 2534.5999755859375,
      "end": 2541.0399780273438,
      "text": " this place without knowing for sure that heaven is their home. And Father, I pray that even"
    },
    {
      "id": 23,
      "start": 2541.0399780273438,
      "end": 2544.959976196289,
      "text": " as we see the expectation to continue that You would help us, Lord, to keep our eyes"
    },
    {
      "id": 24,
      "start": 2544.959976196289,
      "end": 2551.479965209961,
      "text": " upon Jesus, that we would run our race, that we would be faithful unto the end, that we"
    },
    {
      "id": 25,
      "start": 2551.479965209961,
      "end": 2555.0399780273438,
      "text": " would consider the examples of those that have gone before us and that, God, we would"
    },
    {
      "id": 26,
      "start": 2555.0399780273438,
      "end": 2559.679977416992,
      "text": " be an example for those that would follow. Use us, Lord, for Your honor and for Your"
    },
    {
      "id": 27,
      "start": 2559.679977416992,
      "end": 2564.479965209961,
      "text": " glory. We'll thank You for the work that You'll do in our lives. For it's in Christ's name"
    },
    {
      "id": 28,
      "start": 2564.479965209961,
      "end": 2568.679977416992,
      "text": " we pray. We will have a moment of invitation. Stand with me. Kimberly's going to play on"
    },
    {
      "id": 29,
      "start": 2568.679977416992,
      "end": 2574.719970703125,
      "text": " the piano. You can make your own pew, your altar. If you want to come up here, you can."
    },
    {
      "id": 30,
      "start": 2574.719970703125,
      "end": 2578.8399658203125,
      "text": " Try to be careful, of course, with all of those things and at home, those that are watching,"
    },
    {
      "id": 31,
      "start": 2578.8399658203125,
      "end": 2582.8399658203125,
      "text": " make your living room or wherever it is that you're watching your altar this morning. But"
    },
    {
      "id": 32,
      "start": 2582.8399658203125,
      "end": 2587.2799682617188,
      "text": " if the Spirit of God spoke to your heart today, the altar is open as Kimberly plays."
    }
  ],
  "processed_at": "2025-04-17T19:44:17.450209"
}