{
  "video_id": "ldE7ASGe8fY",
  "text": "when we think about Memorial Day, we find that throughout the Word of God, we have been given the truth in how the Lord had instructed his people on a number of occasions to set up memorials. There are several that we could look at, we could speak of. Of course, as we've studied through the book of Joshua together over the last seven weeks, we've had the opportunity to read about the memorials there to commemorate the crossing of the Red Sea, one that was in the midst of the, excuse me, the Jordan River, one that was in the midst of the Jordan River, one that was in Gilgal, the place in which they encamped that first night as they entered into the land of promise. We could look at victories that were experienced by the children of Israel and how that when Joshua fought against Amalek and Moses, remember, as he held up his hands, they were victorious. And as his hands fell, the battle went the other way and Aaron and Hur helped hold up his hands and God tells them to write these things in a book for a memorial to remember. Even as we looked at the end of chapter eight, as I mentioned in the beginning of our service today, there are some things that they're remembering, commemorating. I think about the Passover. It's interesting if you were to read the book of Exodus and look at the instruction that's given with regard to the Passover for the children of Israel, they were given the command to observe the Passover. Of course, the 10th plague is they would be delivered from Egyptian bondage and we see the death of the firstborn and all those things that take place. But it's interesting to note how that God had given specific direction with regard to the Passover. Yes, indeed, it would point to Christ, our Passover, even as Paul says to the believers in Corinth, and we're so grateful for the typology and the picture of the Passover in the Old Testament, but they were to observe it annually and they were due it for a purpose, for a memorial for the generations to come. You know, it's a sad thing when you read throughout the history of Israel and you read the pages of the Old Testament, you find that for long periods of time, the Passover was not properly observed. And you wonder why it was that they served false gods, why it was that they got caught up in all of the sin that they got caught up in and why it was that the judgment of God came upon them. God had put some things in place for them to be mindful, to remember His strong hand of deliverance and what He did for them. And when they failed to observe those things, you find that they are in a position where Jeremiah would say that they had forgot. God, of course, is speaking. Jeremiah records where the Lord says, my people have forgotten me days without number. What a sad claim. This morning, I want to preach a message that I've simply entitled, Remember. And if you look in Deuteronomy chapter number six, I'm gonna take a portion of this passage of scripture and deal with a few things this morning that I hope will be a blessing to you. In the midst of chaos and confusion, I believe it is important for us to be reminded of some biblical truth, some powerful, life-transforming biblical truth. There are times in which we see in the midst of chaos and confusion, in the midst of a world that seems to have lost its collective mind, there are times in which we need to be reminded of some biblical truth because we can forget. We are prone to wander, as the songwriter said, but we also understand that as human beings, we sometimes are guilty of forgetting things. Sometimes we forget things that are important. It's one thing if you forget something at the grocery store that probably isn't going to be a major issue, but there are times in which we forget some very important things. And look at what the Lord says. Of course, Moses is giving instruction to the children of Israel as they would prepare to enter into the land of promise. In Deuteronomy chapter number six and verse number 10, the Bible says this, and it shall be when the Lord thy God shall have brought thee into the land which he sware unto thy fathers, to Abraham, to Isaac, and to Jacob, to give thee great and goodly cities which thou buildest not, and houses full of all good things which thou fillest not, and wells digged which thou diggest not, vineyards and olive trees which thou plantest not, when thou shalt have eaten and be full. Now, if you read verses 10 and 11, you see that they're enjoying times of blessing and prosperity. God has faithfully brought them into the land that he promised to give them. They are now in a place where they're living in houses that they did not build. They're being, of course, sustained from wells and vineyards that they dig not, neither did they plant, and we find that there is a warning that is given in verse number 12. The Bible says, then beware lest thou forget the Lord which brought thee forth out of the land of Egypt from the house of bondage. Thou shalt fear the Lord thy God and serve him and shalt swear by his name. It's interesting that this warning is given in Deuteronomy chapter number six, and you read throughout the book of Deuteronomy as God is preparing his people for entrance into the land, and we find that God gave them this warning of beware lest thou forget the Lord, but then he also gave them instruction on some things to do to help them prevent forgetting. Set up these memorials. Have these things in place. Why? So that you'll always be mindful of what I've done for you. As we think about the truth here in the Old Testament for the children of Israel, I want you to look over the book of 2 Peter, and I want you to consider what Peter says to those that he's writing to here in 2 Peter chapter number one, and we find that Peter has written these two epistles. He was a man that was a disciple that we can learn much from. We find that just a character, I believe, in the word of God that we can very much relate to, and we find that as he's writing this second epistle, similar to Paul writing 2 Timothy, Peter was keenly aware of the fact that he would soon die, and he uses this phraseology that I must put off this my tabernacle, and speaking about his death that would soon come. We know that Paul understood that as he writes to Timothy in 2 Timothy. In fact, in chapter number four, he speaks about the time of his departure was at hand, and so on and so forth, and so Peter is writing this epistle understanding that he would soon be leaving the earth. He would put off this, his earthly tabernacle, and I want you to notice what Peter says in 2 Peter one in verse number 12. He says, wherefore, I will not be negligent to put you always in remembrance of these things. Now notice this phrase, though you know them and be established in the present truth. Yea, I think it meet as long as I am in this tabernacle to stir you up by putting you in remembrance, knowing that shortly I must put off this my tabernacle, even as our Lord Jesus Christ hath showed me. Moreover, I will endeavor that ye may be able after my decease to have these things always in remembrance. If you notice in just these few verses of Scripture, we find that Peter says in verse number 12 that I will put you always in remembrance of these things. He tells them, I understand that you know them. It's not that I'm giving you new truth, it's that I'm reminding you of some things that are important. He says in verse number 13, putting you in remembrance. He says in verse number 15 that these things always in remembrance. Notice what he says in verse 15. Moreover, I will endeavor that ye, the people that he's ministering to, the people that he's delivering this message to, the people, the recipients of these reminders, he's saying that I will endeavor that ye may be able after my decease, after I put off this, my earthly tabernacle, after I go to be with the Lord, that through the teaching, through the instruction, through the remembrance of these things, that after my decease, to have these things always in remembrance. See, I believe that Peter had this just goal, if you will, that the people that he had been called to minister to would continue, that they would continue to serve the Lord faithfully. Remember, the people that Peter is ministering to in 1 and 2 Peter are people that are dealing with great hardship, people that are living under the Emperor Nero and all of the persecution and all of the difficulties that they're dealing with. And we find that there are people, if you look at the first epistle, that are in need of encouragement, a people that are in need of instruction. And Peter says, I'm gonna stir you up by putting you in remembrance of these things. In that vein, I wanna share just four things with you this morning that you know, but I wanna remind you of. Remember, see, in the midst of chaos and confusion, when things seem to be on their head, so to speak, and it seems like it's challenging for us to navigate the waters, it is good for us to be reminded of some things. Now, I will readily admit to you that this morning this list could have been 50, 60, 70 things and we could have part one, part two, part. but the reality is I picked four things if you have others the Lord bless you and You can share them with me I'd be welcome to receive them But I simply picked four things that I want to remind you of this morning that I hope that we would be Even as God said to the children of Israel in the book of Deuteronomy beware lest you forget See there are times in which we must be reminded Peter says I want to remind you I'm gonna put you in remembrance of these things number one. The Lord is still on his throne The Lord is still on his throne. He is what wonderful songs that were sung today What a wonderful special during our offertory to think about the the place and position of our God He is Almighty he is the Lord God Omnipotent he reigns He's always been on his throne. No one will ever take him from his throne He's not gonna vacate his throne We can rejoice in this truth this morning, and I believe that it's important for us to remember That God's on his throne Listen the the powers that be on this world Are in subject to the power of God we must be mindful of that The reality is that he is the Lord God Almighty notice it turned back to the book of Psalms if you will We're gonna look at a number of passages of Scripture today And I hope that they'd be a blessing to you as you look at what's taking place and consider the fact and remember Today that the Lord is still on his throne. Sometimes we deal with Difficulties and opposition and it seems as if the enemy might be making progress It seems as if maybe they're winning but we must be mindful of the truth that God is on his throne Psalm 11 verse 3 and 4 the Bible says this if the foundations be destroyed. What can the righteous do? But notice what he says in verse number 4 the Lord is in His holy temple the Lord's throne is in heaven his eyes behold his eyelids try The children of men he's on his throne psalm 45 in verse number 6 Notice the psalmist says here thy throne. Oh God is forever and ever The scepter of thy kingdom is a right Scepter thou lovest righteousness and hatest wickedness Therefore God by God hath anointed thee with the oil of gladness above thy fellows Notice that his throne is forever and ever psalm 47 in verse number 8 The Bible says there the psalmist is declaring God reigneth over the heathen God sitteth upon the throne of his holiness We're mindful of the account that God gives us in the life of Isaiah as it's recorded for us in Isaiah chapter number 6 And you'll understand that it's in that time in which the King King Uzziah died In fact Isaiah 6 begins by telling us that in the year that King Uzziah died But I want you to notice the vision of Isaiah We understand and we're not dealing with the entirety of the passage here in Isaiah 6 We understand the impact that this vision had upon Isaiah We understand his call and his response and what have you but I want you to notice in verse number 1 of Isaiah 6 The Bible says in the year that King Uzziah died I saw also the Lord sitting upon a throne high and lifted up and his train filled the temple Above it stood the seraphims each one had six wings with twain He covered his face and with twain he covered his feet and with twain He did fly and one cried unto another and said holy Holy holy is the Lord of hosts the whole earth is full of his glory What Isaiah say he saw the Lord in his proper proper place He saw that the Lord was sitting upon his throne. The Lord sitteth upon a throne high and lifted up I'm thankful that our God is still on the throne these thousands of years later after the life of Isaiah after the death of Uzziah That's recorded here. We find that God is still upon his throne in Hebrews 1. We've studied the passage of Scripture. Of course, we're Making progress to the book of Hebrews. We've taken a couple of weeks off here of recent but we will get back to the book of Hebrews but in chapter number 1 and verse number 8 the Bible tells us that the Lord says notice here what God says to the Son to the Lord Jesus Christ, but unto the Son he said thy throne Oh God is forever and ever a scepter of righteousness is the scepter of thy kingdom and we understand Even as we've looked at some of those psalms that we looked at just a moment ago In the fulfillment of those we find that the Bible Tells us that our God is in control of all things in 1st Peter 3 in verse number 22 It says who has gone into heaven is on the right hand of God angels and authorities and powers being made subject unto him in Recent days Holly and Juliana have read through the book of Job and we've had conversation and discussion about some of that which Job had experienced during his earthly trial, but one of the Just precious reminders as you read the book of Job is to understand there That anything that happened to Job had to be approved by God the devil The enemy of God's people the accuser of the brethren. Oh, he has power for sure. His power is limited We serve the Lord God Almighty and he is sitting upon his throne Think of the passage of Scripture in the book of Revelation that gives us a wonderful Vision and insight into what John sees in Revelation chapter number four I believe very specifically that as you study Revelation chapters 1 through 4 you have the opportunity to see The the letters that are sent to the seven churches in Asia And how that the Lord is giving those letters and then you come into chapter number four and verse number one and The Bible says this after this I looked and behold a door was opened in heaven and the first voice which I heard was as It were of a trumpet talking with me Which said come up hither and I will show thee things which must be hereafter What a great picture of the rapture of the church at the end of the church age And of course, we don't know how long that's gonna be we do know that he's coming and we'll deal with that in just a moment But we find here that the Bible then gives us in Revelation 4 verses 8 through 11 Notice these words and the four beasts had each of them six wings about him They were full of eyes within and they rest not day and night saying holy holy holy Lord God Almighty Which was and is and is to come he's holy he's omnipotent He's eternal The Bible says in verse 9 and when those beasts give glory and honor and thanks to him that sat on the throne Who liveth forever and ever the four and twenty? elders fall down before him that sat on the throne and worship him that liveth forever and ever and Cast their crowns before the throne saying thou art Worthy O Lord to receive glory and honor and power For thou hast created all things and for thy pleasure. They are and were created In the midst of chaos and confusion One thing that we must remember is that the Lord is still on his throne Can I tell you number two the Lord is still building his church? He said but the church hasn't been able to assemble I understand but it's God's Church our church and we must understand that even in the time in which we've not been able to assemble that God is still able to work and God is still bringing forth his purpose in his plan. Does it mean that we're not interested in meeting? Absolutely not I mean I long for the day. I'm looking forward with great anticipation of next week and even as I've thought and Considered in recent hours just the the thought of next Sunday morning being able to see the brethren and worship together the Emotions that many of us will experience in that moment But we must remember that the Lord is building his church. It's his church He's the head of it and for that we rejoice He has promised us that he will build his church. He didn't say I'll build my church and here are the Points of criteria that must be met in order for me to do my work. No, he's building his church and We can rejoice in that and we find here that the Bible tells us notice in Matthew chapter number 16 As I give you a moment to turn there I want you to consider with me that as the Lord builds his church that we must understand that he builds his church According to his plan and he builds it in his time. Oh There are many over the years that have had various meeting seminars and what whatever you want to call them on church growth or church building ideas and Certainly God uses people and certainly he's gifted people to be able to do the work of the ministry But we must never Think that it's the people that build the church It's the Lord that builds the church. I'm thankful that he uses people But it's God that does the work The Bible tells us in Matthew 16. What a powerful passage of Scripture where the Lord Jesus Jesus says to His disciples, whom do men say that I am? Notice in verse 13, when Jesus came into the coast of Caesarea Philippi, He asked His disciples saying, whom do men say that I, the Son of Man, am? And they said, some say that thou art John the Baptist, some Elias, and others Jeremiah or one of the prophets. He saith unto them, notice, but whom say ye that I am? And Peter answered and said, thou art the Christ, the Son of the living God. Jesus answered and said unto him, blessed art thou, Simon Barjona, for flesh and blood hath not revealed it unto thee, but my Father which is in heaven. And I say also unto thee, thou art Peter, and upon this rock, notice what Jesus said, I will build my church, and the gates of hell shall not prevail against it. We find that throughout the history of the church age, you can start reading in the book of Acts, and you can read church history that's in divine scripture, that's recorded in part of the complete canon of scripture. You can read the church history that God has given us in His Word. You can read church history that's been recorded throughout the centuries, and you can find there's always been opposition. The enemy hates, I mean, Satan and the enemy, they hate the church. But we find that God has always built His church, and we look and we follow, this morning I was thanking the Lord for those that have faithfully gone on before us, those that were willing to pay whatever sacrifice was necessary to spend time in prison, and to be burned at the stake. I mean, we've read, even last night, if you're reading the devotional book that we distributed this year for 2020, you read about one that gave his life, he was a martyr, for the furtherance of the gospel, for the truth of God's Word. And we find that throughout the history of the church, that God has been building His church. Yes, He uses people, and for that we can rejoice. We understand in Ephesians chapter number 4, we won't take time to go there, but you can read through the passage of scripture, and you can find how the Lord has, yes, He is the head of the church, but He's established the church, and the positions, and all of the order for the church, but we understand, ultimately, that He is the head, and that He builds His church. We think about these reminders this morning, as the people of God, I believe that we must be mindful, we must remember that the Lord is still on His throne, number one. Number two, that the Lord is still building His church. Number three, the Lord is still saving sinners. For this I rejoice. The reality today is that the gospel still works. Paul said in Romans 1.16, I am not ashamed of the gospel of Christ, for it is the power of God unto salvation, to everyone that believe it, to the Jew first, and also to the Greek. And we find that as we understand the truth of the Word of God, that the Lord is still saving sinners. We've heard even during these days of global pandemic, we've heard during these days in which the church has not been able to assemble as a corporate body of believers. We've heard during these days in which many of our outreach ministries have been hindered or stopped completely, yet we've heard of souls that have been saved, lives that have been changed. We've had unique opportunities to be able to share the gospel with those that God had given us opportunities in days gone by, and perhaps we've prayed for, and we've ministered, and we've sought to encourage and share Scripture. And then after a period of time, enduring all of this situation, they come to a place where now they're ready. We've had many, several even, that we've prayed for as a local church that have trusted Christ as their personal Savior in the days of this global pandemic. I've spoken to pastors and evangelists and missionaries, and they too have reported that even in days in which we've not had the ability to minister as we have in our past, that yet people are being saved, and that's wonderful. See, the gospel still works. Romans chapter number 10, what a joy to think about the power of the gospel. I've often said, as I have preached over the years, that we have the opportunity to give the Word of God, and as we give God's Word, we understand that the Holy Spirit of God will use the Word of God in the life of that individual. I often pray that God will help those individuals that I speak to, some that do not accept the Lord Jesus Christ as their personal Savior, but they've heard the truth. I pray often that God would remind them that they would, when they pillow their head at night, remember the words of Scripture and the truth of God's Word with regard to salvation and eternity. I've prayed for people that I've shared the gospel with that God would allow them to have another gospel witness come into their life. May it be through, not so much today, someone that might sit on a plane next to them or in a metro car next to them that would be faithful to give the gospel the same message that had already been delivered. And God works that way. We can rejoice in that. Romans 10, in verse number 9, the Bible says that if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised Him from the dead, thou shalt be saved. For at the heart man believeth unto righteousness, and with the mouth confession is made unto salvation. It says in verse number 13, for whosoever shall call upon the name of the Lord shall be saved. I'm thankful that even though we've had certain aspects of ministry hindered over these days of global pandemic, and though we've dealt with changes in our routine process of propagating the gospel and going into our community and distributing tracts and all of those things, I am glad that people can still trust the Lord as their personal Savior, that Jesus saves. We sing the song and we believe the message. See, today we must be reminded of the truth that the Lord is still saving sinners. Notice in Hebrews chapter number 7, in verse number 25, the Bible is giving us truth here and we'll get to this passage here, Lord willing, in another month or so as we go through the truth, the teaching with regard to the priesthood of Christ and after the order of Melchizedek, not after that of Aaron. We find in verse 25, however, of Hebrews 7, the Bible says, wherefore He is able also to save them to the uttermost that come unto God by Him, seeing He ever liveth to make intercession for them. I'm thankful that the gospel still works. I'm thankful in the midst of all of that which we're dealing with, and I don't pretend to act like it's the worst thing that humans have ever dealt with. I know far better than that. But some of that we're dealing with, and there are times in which over these periods of weeks that we've dealt with some of the changes that we've had to implement, that I've had conversations with fellow pastors and workers, missionaries, evangelists, I've had conversations with church members, and I've heard people that have been discouraged. I've heard people that have been just confused and wondering what's going on and is God really at work? And we can rejoice and answer with absolute certainty that God is still working. Why? Because He's still on His throne. He's still the head of the church, and He's still building His church. And He's still saving sinners. Number four, if you're taking notes finally this morning, I want you to remember this truth. Be mindful of this truth. Every day of our lives, we ought to remember the fact that the Lord is still coming. We believe in the blood, the book, of course, and the blessed hope. We believe in the imminent return of the Lord Jesus Christ. And I'm so thankful that the Bible teaches us that Jesus, in fact, is coming again. In fact, as you would study the portions of Scripture that deal with the return of the Lord and, of course, the rapture that would then immediately follow, and begin to study some of those things that will come to pass and the one world order and the Antichrist and all of those things, if you were to study all of those things and be mindful of the Bible prophecy that God has given us and you begin to interpret some of those things that we see happening around our globe today, you can see that the return of the Lord draweth nigh. And how exciting it is. I spoke with a preacher friend not many days ago, and as we were chatting, we were speaking about the soon return of the Lord. Now he's older than I am by probably double almost, I don't know, I'm almost 40 now, so not too many people that are double my age anymore, but close to at least. And he said to me, he said, Brother Chris, I just want you to be aware of the fact that in the 70s, I mean almost anywhere you went, you heard Bible preaching on the return of the Lord. I wasn't even born in the 70s, yet alone saved in a church in the 70s, but the reality is that I've read books and I've heard that testimony from a number of people that there was that era in the 70s where there was a bunch of preaching on the soon return of the Lord. And I'm thankful to report that even as this brother told me, many of those that he was serving with at that time absolutely believed that it would be in their lifetime. That's one of the wonderful things about the Bible doctrine and teaching of the imminent return of Christ is it could happen at any moment. We find that in John chapter number 14, Jesus gives these precious words. The first three verses of this chapter, you'll remember that at the end of chapter 13, he had given them truth with regard to the fact that it was only a little while that he would be with them because why? He was going to go to the cross. He would be buried and he would rise in victory and then after those 40 days, he would ascend back to heaven. We find that in John 14, after he had shared those truths with his disciples, he says, let not your heart be troubled. You believe in God, believe also in me. In my Father's house are many mansions. If it were not so, I would have told you. I go to prepare a place for you. He says, and if I go and prepare a place for you, I will come again and receive you unto myself that where I am, there ye may be also. I'm so thankful for that promise of the Lord in verses two and three. He says, I go to prepare a place for you. He told us he's going to do it and then he says, and if I go, he says, I will come again. I'm looking for the soon return of our Lord and Savior Jesus Christ. We find that the book of First Thessalonians gives us great truth with regard to the rapture and the process in which Paul is giving this instruction to the believers in Thessalonica and they needed to understand some things and there had been a much confusion in that particular day with regard to the day of the Lord and we find that Paul begins the passage in verse 13 by telling them, I don't want you to be ignorant of these things. I want you to be informed. I want you to know these things. I'm speaking to you by the Word of the Lord. He uses that very phrase in verse number 15. For this we say unto you, by the Word of the Lord. See, Paul is wanting the believers in Thessalonica to understand this wasn't just Paul's interpretation or Paul's belief or his opinion. He's giving them the Word of the Lord and how we ought to rejoice in that today as well. He says in verse number 16, for the Lord Himself shall descend from heaven with a shout, with the voice of the archangel, with the trump of God, the dead in Christ shall rise first. Then we which are alive and remain shall be caught up together with them in the clouds to meet the Lord in the air and so shall we ever be with the Lord. You notice the Bible says in verse 16, for the Lord Himself shall descend. He doesn't say He might descend. It's possible that He's going to return. No, He shall. See, I believe that as you look at the early church history and you look at the book of Acts in particular, I believe that one of the things that was such a motivator for the believers in the first century was the soon return of Christ. See, I think about that passage of Scripture in Acts chapter number 1 where the ascension of Jesus Christ is recorded and we find that those disciples, they hear the instruction of the Lord and they hear that truth of the Great Commission, that we're to be witnesses after we receive power from the Holy Ghost, that we're to be witnesses unto Him. And then the Bible tells us in Acts 1 how that they see the Lord ascend up into heaven. In my mind's eye, I could stand there with those disciples along those, in that very same place, alongside these disciples and I can hear the words of Jesus as He's speaking to them and reminding them of His mission that He's leaving them with and then He's taken up out of their sight. And the Bible tells that they stand there, they're looking, gazing up into heaven. What happens? The Bible tells us that as they looked steadfastly toward heaven, as He went up, behold, two men stood by them with white apparel, in white apparel, and here's what they said, ye men of Galilee, why stand ye gazing up into heaven? This same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen Him go into heaven. Now think about that. They'd received the truth, the mission from the Lord in verse 8, but ye shall receive power after that the Holy Ghost has come upon you. And ye shall be witnesses unto me both in Jerusalem and Judea and Samaria and to the uttermost part of the earth. And then He's ascended out of their sight. They stand there gazing, these angels come and say He's coming back. We better get busy doing what He left for us to do. And you read the book of Acts and you see a group of people that were motivated to do what God told them to do. Why? They didn't know when He's coming back, but they knew He's coming back. If I tell my children, we want you to do these things and we'll be back, and I don't tell them when we're going to be back. I hope that the reminder in the confirmation to them that we're going to return, that we're going to come back and see what you've done, that it would be a motivator for them to do what we told them to do. I was a kid once and I remember waiting until the very last minute to do what it was that maybe I thought I was supposed to do. But I tell you as the people of God, we don't know when Jesus is coming back. And when He comes, there's not going to be any time for us to hurry up and do this or the other thing because the Bible says in the moment, in the twinkling of an eye, I mean just like that, He's coming back. What a joy, what a great promise. In the book of Titus, Paul tells his son in the faith, he uses that terminology for both Titus and Timothy. In fact, you see that he's writing to Philemon, he mentions that of Onesimus as well. But here in Titus 2, in verse number 13, he says, looking for that blessed hope and the glorious appearing of the great God and our Savior, Jesus Christ. I'm looking for His soon return. In the book of Hebrews, we have wonderful truth with regard to the coming of the Lord. I don't know when we're gonna get to these chapters because it's chapter 9 and 10. We might have Hebrews part 2, as far as I know. I have no idea what's gonna happen for 2021, but I want to remind you in Hebrews 9 and verse 28, the Bible says, so Christ was once offered to bear the sins of many and unto them that look for Him shall He appear the second time without sin unto salvation. Notice what he says in chapter 10 and verse number 37, for yet a little while and He that shall come will come and will not tarry. Listen, Jesus is coming right on time. We don't know the time, but there's a time that Jesus is coming. And we understand biblically speaking that He will not tarry. We, James, in chapter 5 and verse number 8, the Bible says, be also patient, establish your hearts for the coming of the Lord draweth nigh. The coming of the Lord draweth nigh. And, of course, we're familiar with the passage in 2 Peter 3. In fact, I mentioned it just on Wednesday evening with those scoffers and saying, where is the promise of His coming, you know? They believe that... the thing that's interesting is that they were aware of the promise of His coming. But they said, where is the promise of His coming? We find that as the text of Scripture goes on, we eventually get to verse number 8, and the Bible says there, but beloved, be not ignorant of this one thing, that one day is with the Lord as a thousand years, and a thousand years is one day. 2 Peter 3 and verse number 8. See, our God is eternal. He operates outside of time. We find that He then gives this wonderful truth in verse number 9 of 2 Peter 3. The Lord is not slack concerning His promise, as some men count slackness. But as longsuffering to us were, not willing that any should perish, but that all should come to repentance. Reminds me of our third point, the Lord is still saving sinners. But we can rest assured this morning that the Lord is still going to come. He's coming again. I don't know the hour. I'm not telling you it's going to be today. I'm not trying to set a time. Many that have gone before us that have done that have proven themselves to be unwise. But the Bible teaches us the imminent return of Jesus Christ. And this morning, as we are celebrating Memorial Day as a nation, tomorrow of course the official observance, there's some things no doubt that we need to remember as Americans. There are some things no doubt that have not been adequately and properly taught to a new generation about the sacrifice that was made by millions of people for us to enjoy the freedom that we have today. What a blessing that is. And I'm thankful to be American, to live in this nation. But my citizenship is in heaven. I'm a child of the King. Amen? I've been born again. We sang the song this morning since I have been redeemed. I have dual citizenship, American, but heaven is my home. The songwriter said, this road is not my home, I'm just a passing through. And oh, how we can relate to the songwriter. And as the people of God, just as the warning is given in Deuteronomy chapter number 6, when you're entered into the land that I've promised to give you, when I bring you into that land, God did it, God worked, God proved His power and He brought the children of Israel into the land. And Moses says, beware lest thou forget the Lord. So there were some things that the children of Israel were instructed to do to establish memorials so that they would not forget what God did for them. We find that Peter says, I'll put you in remembrance of some things. I want you to be mindful of some things. We understand the Lord's given us the truth as New Testament believers of baptism and the Lord's Supper. In fact, the table that is before me says, this do in remembrance of me. You can read in 1 Corinthians 11 and you can see how the Lord's table, it's a table of remembrance. It's a memorial to be mindful of what the Lord Jesus Christ did for me to remember what my salvation cost. It was free to me, but Jesus died. Yes, He was buried and He rose in victory and how we rejoice in that truth. But this morning, as the people of God living in a day of confusion and chaos, and there are people that are discouraged and confused, I want you to remember that the Lord's still on His throne. I want you to remember that the Lord's still building His church. I want you to remember the Lord's still saving sinners. And I want you to remember that the Lord is coming again. And we remember those things and I, as I admitted in the beginning of the message, there's 50 other things that we could speak about that we need to remember. Remember those four things. I believe it'll help us. It'll help us in a time of chaos and confusion. Remember, Father, we love You. We thank You for loving us. We thank You for Your Word. How we rejoice that You have given us this precious Bible. The truth that is contained therein is profitable, is life-changing. And Lord, I pray that as we have reviewed these four items today, I've sought to stir us up by putting us in remembrance. I'm so thankful that You're sitting upon Your throne, that You are the Lord God omnipotent, that You reign, that You are King of kings and Lord of lords, the great I Am. How we rejoice in that. We thank You that You're still building Your church. It's Your church, not my church, not our church. I'm thankful to belong to the local church. I'm thankful to be part of the local church. I'm thankful for the privilege of being the under-shepherd of this local church. God, we know that You're the head. We believe the promise that You gave there in Matthew, I will build my church and the gates of hell shall not prevail against it. Oh, how we rejoice that You're still saving sinners. The gospel's powerful. What a joy to know that the truth, for whosoever shall call upon the name of the Lord shall be saved, is still in operation today. If there's one that's tuned in that's not sure of heaven, God, we pray that today is the day of salvation. They would not allow for another moment to pass by before they place their faith and trust in the finished work of Christ at Calvary. Understanding that their works, their good works, cannot get them to heaven, not by works of righteousness which we have done, but according to His mercy hath He begotten us. For by grace are you saved through faith, and that not of yourselves, it is the gift of God, not of works, lest any man should boast. Our salvation is not based upon our works, it's not based upon our church membership, our baptism, any other thing. We're saved if we trust the Lord Jesus Christ as our personal Savior, receive the gift of God which is eternal life through the death, burial, and resurrection of our Savior. We thank You that You're still saving sinners, and then how we rejoice that You're still coming again. We readily admit we do not know the day nor hour, but we believe the promises that You've given us in Your Word, I will come again. That He that shall come will come, and will not tarry. God, I pray that You'd help us to redeem the time that we'd be busy about the Master's work, that we'd have that same level of urgency that we read of in the book of Acts, because we believe You're coming, and it could be at any moment. Lord, as we remember these things this morning, I pray that our hearts have been encouraged and strengthened. I pray that You'd give us a joy and a peace at the remembrance of these things. We pray that You'd work in the time of invitation, that You alone would be glorified, that decisions would be made here, would be made at the homes of those that have tuned in to watch this broadcast. Lord, that You would work in our hearts and lives, and that You alone would be glorified. We'll thank You for it, in Christ's name we pray, amen. Kimberly's going to play quietly on the piano, and as she does, hear the altars.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.0399999618530273,
      "text": " when we think about Memorial Day,"
    },
    {
      "id": 1,
      "start": 2.0399999618530273,
      "end": 4.639999866485596,
      "text": " we find that throughout the Word of God,"
    },
    {
      "id": 2,
      "start": 4.639999866485596,
      "end": 8.680000305175781,
      "text": " we have been given the truth"
    },
    {
      "id": 3,
      "start": 8.680000305175781,
      "end": 12.039999961853027,
      "text": " in how the Lord had instructed his people"
    },
    {
      "id": 4,
      "start": 12.039999961853027,
      "end": 15.0,
      "text": " on a number of occasions to set up memorials."
    },
    {
      "id": 5,
      "start": 15.960000038146973,
      "end": 17.719999313354492,
      "text": " There are several that we could look at,"
    },
    {
      "id": 6,
      "start": 17.719999313354492,
      "end": 18.959999084472656,
      "text": " we could speak of."
    },
    {
      "id": 7,
      "start": 18.959999084472656,
      "end": 21.239999771118164,
      "text": " Of course, as we've studied through the book of Joshua"
    },
    {
      "id": 8,
      "start": 21.239999771118164,
      "end": 23.68000030517578,
      "text": " together over the last seven weeks,"
    },
    {
      "id": 9,
      "start": 23.68000030517578,
      "end": 27.1200008392334,
      "text": " we've had the opportunity to read about the memorials there"
    },
    {
      "id": 10,
      "start": 27.1200008392334,
      "end": 29.360000610351562,
      "text": " to commemorate the crossing of the Red Sea,"
    },
    {
      "id": 11,
      "start": 29.360000610351562,
      "end": 31.040000915527344,
      "text": " one that was in the midst of the,"
    },
    {
      "id": 12,
      "start": 31.040000915527344,
      "end": 32.47999954223633,
      "text": " excuse me, the Jordan River,"
    },
    {
      "id": 13,
      "start": 32.47999954223633,
      "end": 34.400001525878906,
      "text": " one that was in the midst of the Jordan River,"
    },
    {
      "id": 14,
      "start": 34.400001525878906,
      "end": 35.7599983215332,
      "text": " one that was in Gilgal,"
    },
    {
      "id": 15,
      "start": 35.7599983215332,
      "end": 38.63999938964844,
      "text": " the place in which they encamped that first night"
    },
    {
      "id": 16,
      "start": 38.63999938964844,
      "end": 40.84000015258789,
      "text": " as they entered into the land of promise."
    },
    {
      "id": 17,
      "start": 40.84000015258789,
      "end": 44.79999923706055,
      "text": " We could look at victories that were experienced"
    },
    {
      "id": 18,
      "start": 44.79999923706055,
      "end": 46.36000061035156,
      "text": " by the children of Israel"
    },
    {
      "id": 19,
      "start": 46.36000061035156,
      "end": 49.84000015258789,
      "text": " and how that when Joshua fought against Amalek"
    },
    {
      "id": 20,
      "start": 49.84000015258789,
      "end": 52.47999954223633,
      "text": " and Moses, remember, as he held up his hands,"
    },
    {
      "id": 21,
      "start": 52.47999954223633,
      "end": 53.560001373291016,
      "text": " they were victorious."
    },
    {
      "id": 22,
      "start": 53.560001373291016,
      "end": 56.959999084472656,
      "text": " And as his hands fell, the battle went the other way"
    },
    {
      "id": 23,
      "start": 56.959999084472656,
      "end": 59.040000915527344,
      "text": " and Aaron and Hur helped hold up his hands"
    },
    {
      "id": 24,
      "start": 59.720001220703125,
      "end": 62.47999954223633,
      "text": " and God tells them to write these things in a book"
    },
    {
      "id": 25,
      "start": 62.47999954223633,
      "end": 64.36000061035156,
      "text": " for a memorial to remember."
    },
    {
      "id": 26,
      "start": 64.36000061035156,
      "end": 66.72000122070312,
      "text": " Even as we looked at the end of chapter eight,"
    },
    {
      "id": 27,
      "start": 66.72000122070312,
      "end": 69.68000030517578,
      "text": " as I mentioned in the beginning of our service today,"
    },
    {
      "id": 28,
      "start": 69.68000030517578,
      "end": 72.72000122070312,
      "text": " there are some things that they're remembering,"
    },
    {
      "id": 29,
      "start": 72.72000122070312,
      "end": 74.08000183105469,
      "text": " commemorating."
    },
    {
      "id": 30,
      "start": 74.08000183105469,
      "end": 76.91999816894531,
      "text": " I think about the Passover."
    },
    {
      "id": 31,
      "start": 76.91999816894531,
      "end": 79.36000061035156,
      "text": " It's interesting if you were to read the book of Exodus"
    },
    {
      "id": 32,
      "start": 79.36000061035156,
      "end": 80.83999633789062,
      "text": " and look at the instruction that's given"
    },
    {
      "id": 33,
      "start": 80.83999633789062,
      "end": 83.4800033569336,
      "text": " with regard to the Passover for the children of Israel,"
    },
    {
      "id": 34,
      "start": 83.4800033569336,
      "end": 87.68000030517578,
      "text": " they were given the command to observe the Passover."
    },
    {
      "id": 35,
      "start": 87.68000030517578,
      "end": 90.5999984741211,
      "text": " Of course, the 10th plague is they would be delivered"
    },
    {
      "id": 36,
      "start": 90.5999984741211,
      "end": 93.63999938964844,
      "text": " from Egyptian bondage and we see the death of the firstborn"
    },
    {
      "id": 37,
      "start": 93.63999938964844,
      "end": 95.63999938964844,
      "text": " and all those things that take place."
    },
    {
      "id": 38,
      "start": 95.63999938964844,
      "end": 96.83999633789062,
      "text": " But it's interesting to note"
    },
    {
      "id": 39,
      "start": 96.83999633789062,
      "end": 99.95999908447266,
      "text": " how that God had given specific direction"
    },
    {
      "id": 40,
      "start": 99.95999908447266,
      "end": 101.63999938964844,
      "text": " with regard to the Passover."
    },
    {
      "id": 41,
      "start": 101.63999938964844,
      "end": 105.44000244140625,
      "text": " Yes, indeed, it would point to Christ, our Passover,"
    },
    {
      "id": 42,
      "start": 105.44000244140625,
      "end": 107.80000305175781,
      "text": " even as Paul says to the believers in Corinth,"
    },
    {
      "id": 43,
      "start": 107.80000305175781,
      "end": 110.19999694824219,
      "text": " and we're so grateful for the typology"
    },
    {
      "id": 44,
      "start": 110.19999694824219,
      "end": 113.19999694824219,
      "text": " and the picture of the Passover in the Old Testament,"
    },
    {
      "id": 45,
      "start": 113.19999694824219,
      "end": 115.63999938964844,
      "text": " but they were to observe it annually"
    },
    {
      "id": 46,
      "start": 115.63999938964844,
      "end": 117.27999877929688,
      "text": " and they were due it for a purpose,"
    },
    {
      "id": 47,
      "start": 117.27999877929688,
      "end": 121.36000061035156,
      "text": " for a memorial for the generations to come."
    },
    {
      "id": 48,
      "start": 121.36000061035156,
      "end": 122.23999786376953,
      "text": " You know, it's a sad thing"
    },
    {
      "id": 49,
      "start": 122.23999786376953,
      "end": 124.23999786376953,
      "text": " when you read throughout the history of Israel"
    },
    {
      "id": 50,
      "start": 124.23999786376953,
      "end": 125.95999908447266,
      "text": " and you read the pages of the Old Testament,"
    },
    {
      "id": 51,
      "start": 125.95999908447266,
      "end": 128.52000427246094,
      "text": " you find that for long periods of time,"
    },
    {
      "id": 52,
      "start": 128.52000427246094,
      "end": 131.9600067138672,
      "text": " the Passover was not properly observed."
    },
    {
      "id": 53,
      "start": 131.9600067138672,
      "end": 135.36000061035156,
      "text": " And you wonder why it was that they served false gods,"
    },
    {
      "id": 54,
      "start": 135.36000061035156,
      "end": 137.0399932861328,
      "text": " why it was that they got caught up"
    },
    {
      "id": 55,
      "start": 137.0399932861328,
      "end": 139.60000610351562,
      "text": " in all of the sin that they got caught up in"
    },
    {
      "id": 56,
      "start": 139.60000610351562,
      "end": 142.9199981689453,
      "text": " and why it was that the judgment of God came upon them."
    },
    {
      "id": 57,
      "start": 142.9199981689453,
      "end": 145.8800048828125,
      "text": " God had put some things in place for them"
    },
    {
      "id": 58,
      "start": 145.8800048828125,
      "end": 150.36000061035156,
      "text": " to be mindful, to remember His strong hand of deliverance"
    },
    {
      "id": 59,
      "start": 150.36000061035156,
      "end": 152.36000061035156,
      "text": " and what He did for them."
    },
    {
      "id": 60,
      "start": 152.36000061035156,
      "end": 156.0,
      "text": " And when they failed to observe those things,"
    },
    {
      "id": 61,
      "start": 156.0,
      "end": 158.52000427246094,
      "text": " you find that they are in a position"
    },
    {
      "id": 62,
      "start": 158.52000427246094,
      "end": 160.8800048828125,
      "text": " where Jeremiah would say that they had forgot."
    },
    {
      "id": 63,
      "start": 160.8800048828125,
      "end": 162.72000122070312,
      "text": " God, of course, is speaking."
    },
    {
      "id": 64,
      "start": 162.72000122070312,
      "end": 165.16000366210938,
      "text": " Jeremiah records where the Lord says,"
    },
    {
      "id": 65,
      "start": 165.16000366210938,
      "end": 168.44000244140625,
      "text": " my people have forgotten me days without number."
    },
    {
      "id": 66,
      "start": 168.44000244140625,
      "end": 169.75999450683594,
      "text": " What a sad claim."
    },
    {
      "id": 67,
      "start": 171.1999969482422,
      "end": 172.83999633789062,
      "text": " This morning, I want to preach a message"
    },
    {
      "id": 68,
      "start": 173.63999938964844,
      "end": 175.1199951171875,
      "text": " that I've simply entitled, Remember."
    },
    {
      "id": 69,
      "start": 175.1199951171875,
      "end": 177.72000122070312,
      "text": " And if you look in Deuteronomy chapter number six,"
    },
    {
      "id": 70,
      "start": 177.72000122070312,
      "end": 180.9600067138672,
      "text": " I'm gonna take a portion of this passage of scripture"
    },
    {
      "id": 71,
      "start": 180.9600067138672,
      "end": 183.75999450683594,
      "text": " and deal with a few things this morning"
    },
    {
      "id": 72,
      "start": 183.75999450683594,
      "end": 185.72000122070312,
      "text": " that I hope will be a blessing to you."
    },
    {
      "id": 73,
      "start": 185.72000122070312,
      "end": 187.72000122070312,
      "text": " In the midst of chaos and confusion,"
    },
    {
      "id": 74,
      "start": 187.72000122070312,
      "end": 191.8000030517578,
      "text": " I believe it is important for us to be reminded"
    },
    {
      "id": 75,
      "start": 191.8000030517578,
      "end": 193.47999572753906,
      "text": " of some biblical truth,"
    },
    {
      "id": 76,
      "start": 193.47999572753906,
      "end": 197.52000427246094,
      "text": " some powerful, life-transforming biblical truth."
    },
    {
      "id": 77,
      "start": 197.52000427246094,
      "end": 199.47999572753906,
      "text": " There are times in which we see"
    },
    {
      "id": 78,
      "start": 199.47999572753906,
      "end": 201.75999450683594,
      "text": " in the midst of chaos and confusion,"
    },
    {
      "id": 79,
      "start": 201.75999450683594,
      "end": 203.27999877929688,
      "text": " in the midst of a world"
    },
    {
      "id": 80,
      "start": 203.27999877929688,
      "end": 206.0,
      "text": " that seems to have lost its collective mind,"
    },
    {
      "id": 81,
      "start": 206.0,
      "end": 210.0,
      "text": " there are times in which we need to be reminded"
    },
    {
      "id": 82,
      "start": 210.0,
      "end": 214.0399932861328,
      "text": " of some biblical truth because we can forget."
    },
    {
      "id": 83,
      "start": 214.0399932861328,
      "end": 217.52000427246094,
      "text": " We are prone to wander, as the songwriter said,"
    },
    {
      "id": 84,
      "start": 217.52000427246094,
      "end": 221.0399932861328,
      "text": " but we also understand that as human beings,"
    },
    {
      "id": 85,
      "start": 221.0399932861328,
      "end": 224.75999450683594,
      "text": " we sometimes are guilty of forgetting things."
    },
    {
      "id": 86,
      "start": 224.75999450683594,
      "end": 227.52000427246094,
      "text": " Sometimes we forget things that are important."
    },
    {
      "id": 87,
      "start": 227.52000427246094,
      "end": 230.24000549316406,
      "text": " It's one thing if you forget something at the grocery store"
    },
    {
      "id": 88,
      "start": 230.24000549316406,
      "end": 234.9600067138672,
      "text": " that probably isn't going to be a major issue,"
    },
    {
      "id": 89,
      "start": 234.9600067138672,
      "end": 236.9600067138672,
      "text": " but there are times in which we forget"
    },
    {
      "id": 90,
      "start": 236.9600067138672,
      "end": 239.0,
      "text": " some very important things."
    },
    {
      "id": 91,
      "start": 239.0,
      "end": 242.0399932861328,
      "text": " And look at what the Lord says."
    },
    {
      "id": 92,
      "start": 242.0399932861328,
      "end": 243.83999633789062,
      "text": " Of course, Moses is giving instruction"
    },
    {
      "id": 93,
      "start": 243.83999633789062,
      "end": 245.39999389648438,
      "text": " to the children of Israel as they would prepare"
    },
    {
      "id": 94,
      "start": 245.39999389648438,
      "end": 247.1999969482422,
      "text": " to enter into the land of promise."
    },
    {
      "id": 95,
      "start": 247.1999969482422,
      "end": 249.9600067138672,
      "text": " In Deuteronomy chapter number six and verse number 10,"
    },
    {
      "id": 96,
      "start": 249.9600067138672,
      "end": 250.8000030517578,
      "text": " the Bible says this,"
    },
    {
      "id": 97,
      "start": 250.8000030517578,
      "end": 252.67999267578125,
      "text": " and it shall be when the Lord thy God"
    },
    {
      "id": 98,
      "start": 252.67999267578125,
      "end": 254.39999389648438,
      "text": " shall have brought thee into the land"
    },
    {
      "id": 99,
      "start": 254.39999389648438,
      "end": 256.44000244140625,
      "text": " which he sware unto thy fathers,"
    },
    {
      "id": 100,
      "start": 256.44000244140625,
      "end": 258.2799987792969,
      "text": " to Abraham, to Isaac, and to Jacob,"
    },
    {
      "id": 101,
      "start": 258.2799987792969,
      "end": 260.3999938964844,
      "text": " to give thee great and goodly cities"
    },
    {
      "id": 102,
      "start": 260.3999938964844,
      "end": 262.3599853515625,
      "text": " which thou buildest not,"
    },
    {
      "id": 103,
      "start": 262.3599853515625,
      "end": 264.79998779296875,
      "text": " and houses full of all good things"
    },
    {
      "id": 104,
      "start": 264.79998779296875,
      "end": 266.0799865722656,
      "text": " which thou fillest not,"
    },
    {
      "id": 105,
      "start": 266.0799865722656,
      "end": 268.8399963378906,
      "text": " and wells digged which thou diggest not,"
    },
    {
      "id": 106,
      "start": 268.8399963378906,
      "end": 271.7200012207031,
      "text": " vineyards and olive trees which thou plantest not,"
    },
    {
      "id": 107,
      "start": 271.7200012207031,
      "end": 274.3999938964844,
      "text": " when thou shalt have eaten and be full."
    },
    {
      "id": 108,
      "start": 274.3999938964844,
      "end": 275.8800048828125,
      "text": " Now, if you read verses 10 and 11,"
    },
    {
      "id": 109,
      "start": 275.8800048828125,
      "end": 277.6400146484375,
      "text": " you see that they're enjoying"
    },
    {
      "id": 110,
      "start": 277.6400146484375,
      "end": 280.9599914550781,
      "text": " times of blessing and prosperity."
    },
    {
      "id": 111,
      "start": 280.9599914550781,
      "end": 283.8800048828125,
      "text": " God has faithfully brought them into the land"
    },
    {
      "id": 112,
      "start": 283.8800048828125,
      "end": 286.1600036621094,
      "text": " that he promised to give them."
    },
    {
      "id": 113,
      "start": 286.1600036621094,
      "end": 289.79998779296875,
      "text": " They are now in a place where they're living in houses"
    },
    {
      "id": 114,
      "start": 289.79998779296875,
      "end": 291.0,
      "text": " that they did not build."
    },
    {
      "id": 115,
      "start": 291.0,
      "end": 295.4800109863281,
      "text": " They're being, of course, sustained from wells"
    },
    {
      "id": 116,
      "start": 295.4800109863281,
      "end": 297.3599853515625,
      "text": " and vineyards that they dig not,"
    },
    {
      "id": 117,
      "start": 297.3599853515625,
      "end": 298.7200012207031,
      "text": " neither did they plant,"
    },
    {
      "id": 118,
      "start": 298.7200012207031,
      "end": 301.3599853515625,
      "text": " and we find that there is a warning"
    },
    {
      "id": 119,
      "start": 301.3599853515625,
      "end": 303.6000061035156,
      "text": " that is given in verse number 12."
    },
    {
      "id": 120,
      "start": 303.6000061035156,
      "end": 304.44000244140625,
      "text": " The Bible says,"
    },
    {
      "id": 121,
      "start": 304.44000244140625,
      "end": 309.3999938964844,
      "text": " then beware lest thou forget the Lord"
    },
    {
      "id": 122,
      "start": 309.3999938964844,
      "end": 311.760009765625,
      "text": " which brought thee forth out of the land of Egypt"
    },
    {
      "id": 123,
      "start": 311.760009765625,
      "end": 314.55999755859375,
      "text": " from the house of bondage."
    },
    {
      "id": 124,
      "start": 314.55999755859375,
      "end": 317.32000732421875,
      "text": " Thou shalt fear the Lord thy God and serve him"
    },
    {
      "id": 125,
      "start": 317.32000732421875,
      "end": 320.5199890136719,
      "text": " and shalt swear by his name."
    },
    {
      "id": 126,
      "start": 320.5199890136719,
      "end": 322.9200134277344,
      "text": " It's interesting that this warning is given"
    },
    {
      "id": 127,
      "start": 322.9200134277344,
      "end": 324.9599914550781,
      "text": " in Deuteronomy chapter number six,"
    },
    {
      "id": 128,
      "start": 324.9599914550781,
      "end": 327.1199951171875,
      "text": " and you read throughout the book of Deuteronomy"
    },
    {
      "id": 129,
      "start": 327.1199951171875,
      "end": 330.9599914550781,
      "text": " as God is preparing his people for entrance into the land,"
    },
    {
      "id": 130,
      "start": 330.9599914550781,
      "end": 334.2799987792969,
      "text": " and we find that God gave them this warning"
    },
    {
      "id": 131,
      "start": 334.2799987792969,
      "end": 337.8800048828125,
      "text": " of beware lest thou forget the Lord,"
    },
    {
      "id": 132,
      "start": 337.8800048828125,
      "end": 340.55999755859375,
      "text": " but then he also gave them instruction"
    },
    {
      "id": 133,
      "start": 340.55999755859375,
      "end": 342.67999267578125,
      "text": " on some things to do"
    },
    {
      "id": 134,
      "start": 342.67999267578125,
      "end": 345.79998779296875,
      "text": " to help them prevent forgetting."
    },
    {
      "id": 135,
      "start": 345.79998779296875,
      "end": 347.1600036621094,
      "text": " Set up these memorials."
    },
    {
      "id": 136,
      "start": 347.1600036621094,
      "end": 348.67999267578125,
      "text": " Have these things in place."
    },
    {
      "id": 137,
      "start": 348.67999267578125,
      "end": 349.5199890136719,
      "text": " Why?"
    },
    {
      "id": 138,
      "start": 349.5199890136719,
      "end": 354.20001220703125,
      "text": " So that you'll always be mindful of what I've done for you."
    },
    {
      "id": 139,
      "start": 354.20001220703125,
      "end": 356.55999755859375,
      "text": " As we think about the truth here in the Old Testament"
    },
    {
      "id": 140,
      "start": 356.55999755859375,
      "end": 357.3999938964844,
      "text": " for the children of Israel,"
    },
    {
      "id": 141,
      "start": 357.3999938964844,
      "end": 360.0799865722656,
      "text": " I want you to look over the book of 2 Peter,"
    },
    {
      "id": 142,
      "start": 360.0799865722656,
      "end": 362.44000244140625,
      "text": " and I want you to consider what Peter says"
    },
    {
      "id": 143,
      "start": 362.44000244140625,
      "end": 364.0400085449219,
      "text": " to those that he's writing to here"
    },
    {
      "id": 144,
      "start": 364.0400085449219,
      "end": 366.0799865722656,
      "text": " in 2 Peter chapter number one,"
    },
    {
      "id": 145,
      "start": 366.0799865722656,
      "end": 370.0799865722656,
      "text": " and we find that Peter has written these two epistles."
    },
    {
      "id": 146,
      "start": 370.0799865722656,
      "end": 372.55999755859375,
      "text": " He was a man that was a disciple"
    },
    {
      "id": 147,
      "start": 373.44000244140625,
      "end": 374.7200012207031,
      "text": " that we can learn much from."
    },
    {
      "id": 148,
      "start": 374.7200012207031,
      "end": 378.1600036621094,
      "text": " We find that just a character, I believe,"
    },
    {
      "id": 149,
      "start": 378.1600036621094,
      "end": 381.67999267578125,
      "text": " in the word of God that we can very much relate to,"
    },
    {
      "id": 150,
      "start": 381.67999267578125,
      "end": 384.3999938964844,
      "text": " and we find that as he's writing this second epistle,"
    },
    {
      "id": 151,
      "start": 384.3999938964844,
      "end": 387.239990234375,
      "text": " similar to Paul writing 2 Timothy,"
    },
    {
      "id": 152,
      "start": 387.239990234375,
      "end": 391.1199951171875,
      "text": " Peter was keenly aware of the fact that he would soon die,"
    },
    {
      "id": 153,
      "start": 391.1199951171875,
      "end": 393.0799865722656,
      "text": " and he uses this phraseology"
    },
    {
      "id": 154,
      "start": 393.0799865722656,
      "end": 395.8800048828125,
      "text": " that I must put off this my tabernacle,"
    },
    {
      "id": 155,
      "start": 395.8800048828125,
      "end": 399.5199890136719,
      "text": " and speaking about his death that would soon come."
    },
    {
      "id": 156,
      "start": 399.5199890136719,
      "end": 401.1600036621094,
      "text": " We know that Paul understood that"
    },
    {
      "id": 157,
      "start": 401.20001220703125,
      "end": 403.6000061035156,
      "text": " as he writes to Timothy in 2 Timothy."
    },
    {
      "id": 158,
      "start": 403.6000061035156,
      "end": 404.9200134277344,
      "text": " In fact, in chapter number four,"
    },
    {
      "id": 159,
      "start": 404.9200134277344,
      "end": 407.7200012207031,
      "text": " he speaks about the time of his departure was at hand,"
    },
    {
      "id": 160,
      "start": 407.7200012207031,
      "end": 408.760009765625,
      "text": " and so on and so forth,"
    },
    {
      "id": 161,
      "start": 408.760009765625,
      "end": 411.9200134277344,
      "text": " and so Peter is writing this epistle"
    },
    {
      "id": 162,
      "start": 411.9200134277344,
      "end": 415.1199951171875,
      "text": " understanding that he would soon be leaving the earth."
    },
    {
      "id": 163,
      "start": 415.1199951171875,
      "end": 417.44000244140625,
      "text": " He would put off this, his earthly tabernacle,"
    },
    {
      "id": 164,
      "start": 417.44000244140625,
      "end": 419.8800048828125,
      "text": " and I want you to notice what Peter says"
    },
    {
      "id": 165,
      "start": 419.8800048828125,
      "end": 422.1199951171875,
      "text": " in 2 Peter one in verse number 12."
    },
    {
      "id": 166,
      "start": 423.1199951171875,
      "end": 426.9200134277344,
      "text": " He says, wherefore, I will not be negligent"
    },
    {
      "id": 167,
      "start": 426.9200134277344,
      "end": 431.3599853515625,
      "text": " to put you always in remembrance of these things."
    },
    {
      "id": 168,
      "start": 431.3599853515625,
      "end": 434.6400146484375,
      "text": " Now notice this phrase, though you know them"
    },
    {
      "id": 169,
      "start": 434.6400146484375,
      "end": 437.0400085449219,
      "text": " and be established in the present truth."
    },
    {
      "id": 170,
      "start": 437.0400085449219,
      "end": 441.20001220703125,
      "text": " Yea, I think it meet as long as I am in this tabernacle"
    },
    {
      "id": 171,
      "start": 441.20001220703125,
      "end": 446.1199951171875,
      "text": " to stir you up by putting you in remembrance,"
    },
    {
      "id": 172,
      "start": 446.1199951171875,
      "end": 449.8800048828125,
      "text": " knowing that shortly I must put off this my tabernacle,"
    },
    {
      "id": 173,
      "start": 449.8800048828125,
      "end": 453.2799987792969,
      "text": " even as our Lord Jesus Christ hath showed me."
    },
    {
      "id": 174,
      "start": 453.2799987792969,
      "end": 456.9200134277344,
      "text": " Moreover, I will endeavor that ye may be able"
    },
    {
      "id": 175,
      "start": 456.9200134277344,
      "end": 460.4800109863281,
      "text": " after my decease to have these things"
    },
    {
      "id": 176,
      "start": 460.4800109863281,
      "end": 463.6400146484375,
      "text": " always in remembrance."
    },
    {
      "id": 177,
      "start": 463.6400146484375,
      "end": 466.9599914550781,
      "text": " If you notice in just these few verses of Scripture,"
    },
    {
      "id": 178,
      "start": 466.9599914550781,
      "end": 470.0,
      "text": " we find that Peter says in verse number 12"
    },
    {
      "id": 179,
      "start": 470.0,
      "end": 474.79998779296875,
      "text": " that I will put you always in remembrance of these things."
    },
    {
      "id": 180,
      "start": 474.79998779296875,
      "end": 477.70001220703125,
      "text": " He tells them, I understand that you know them."
    },
    {
      "id": 181,
      "start": 477.70001220703125,
      "end": 480.0400085449219,
      "text": " It's not that I'm giving you new truth,"
    },
    {
      "id": 182,
      "start": 480.0400085449219,
      "end": 483.1199951171875,
      "text": " it's that I'm reminding you of some things"
    },
    {
      "id": 183,
      "start": 483.9599914550781,
      "end": 485.239990234375,
      "text": " that are important."
    },
    {
      "id": 184,
      "start": 485.239990234375,
      "end": 489.3599853515625,
      "text": " He says in verse number 13, putting you in remembrance."
    },
    {
      "id": 185,
      "start": 489.3599853515625,
      "end": 491.5199890136719,
      "text": " He says in verse number 15"
    },
    {
      "id": 186,
      "start": 491.5199890136719,
      "end": 494.2799987792969,
      "text": " that these things always in remembrance."
    },
    {
      "id": 187,
      "start": 494.2799987792969,
      "end": 496.2799987792969,
      "text": " Notice what he says in verse 15."
    },
    {
      "id": 188,
      "start": 496.2799987792969,
      "end": 498.9200134277344,
      "text": " Moreover, I will endeavor that ye,"
    },
    {
      "id": 189,
      "start": 498.9200134277344,
      "end": 500.6199951171875,
      "text": " the people that he's ministering to,"
    },
    {
      "id": 190,
      "start": 500.6199951171875,
      "end": 503.5199890136719,
      "text": " the people that he's delivering this message to,"
    },
    {
      "id": 191,
      "start": 503.5199890136719,
      "end": 507.4800109863281,
      "text": " the people, the recipients of these reminders,"
    },
    {
      "id": 192,
      "start": 507.4800109863281,
      "end": 511.239990234375,
      "text": " he's saying that I will endeavor that ye may be able"
    },
    {
      "id": 193,
      "start": 511.239990234375,
      "end": 514.0,
      "text": " after my decease, after I put off this,"
    },
    {
      "id": 194,
      "start": 514.0,
      "end": 516.8800048828125,
      "text": " my earthly tabernacle, after I go to be with the Lord,"
    },
    {
      "id": 195,
      "start": 516.8800048828125,
      "end": 520.760009765625,
      "text": " that through the teaching, through the instruction,"
    },
    {
      "id": 196,
      "start": 520.760009765625,
      "end": 524.1599731445312,
      "text": " through the remembrance of these things,"
    },
    {
      "id": 197,
      "start": 524.1599731445312,
      "end": 525.3200073242188,
      "text": " that after my decease,"
    },
    {
      "id": 198,
      "start": 525.3200073242188,
      "end": 527.239990234375,
      "text": " to have these things always in remembrance."
    },
    {
      "id": 199,
      "start": 527.239990234375,
      "end": 532.239990234375,
      "text": " See, I believe that Peter had this just goal, if you will,"
    },
    {
      "id": 200,
      "start": 532.3599853515625,
      "end": 535.52001953125,
      "text": " that the people that he had been called to minister to"
    },
    {
      "id": 201,
      "start": 535.52001953125,
      "end": 536.9600219726562,
      "text": " would continue,"
    },
    {
      "id": 202,
      "start": 536.9600219726562,
      "end": 539.47998046875,
      "text": " that they would continue to serve the Lord faithfully."
    },
    {
      "id": 203,
      "start": 539.52001953125,
      "end": 541.719970703125,
      "text": " Remember, the people that Peter is ministering to"
    },
    {
      "id": 204,
      "start": 541.719970703125,
      "end": 543.9600219726562,
      "text": " in 1 and 2 Peter are people"
    },
    {
      "id": 205,
      "start": 543.9600219726562,
      "end": 547.2000122070312,
      "text": " that are dealing with great hardship,"
    },
    {
      "id": 206,
      "start": 547.2000122070312,
      "end": 551.719970703125,
      "text": " people that are living under the Emperor Nero"
    },
    {
      "id": 207,
      "start": 551.719970703125,
      "end": 553.3599853515625,
      "text": " and all of the persecution"
    },
    {
      "id": 208,
      "start": 553.3599853515625,
      "end": 555.5599975585938,
      "text": " and all of the difficulties that they're dealing with."
    },
    {
      "id": 209,
      "start": 555.5599975585938,
      "end": 557.47998046875,
      "text": " And we find that there are people,"
    },
    {
      "id": 210,
      "start": 557.47998046875,
      "end": 559.2000122070312,
      "text": " if you look at the first epistle,"
    },
    {
      "id": 211,
      "start": 559.2000122070312,
      "end": 560.8800048828125,
      "text": " that are in need of encouragement,"
    },
    {
      "id": 212,
      "start": 560.8800048828125,
      "end": 562.8400268554688,
      "text": " a people that are in need of instruction."
    },
    {
      "id": 213,
      "start": 562.8400268554688,
      "end": 564.47998046875,
      "text": " And Peter says, I'm gonna stir you up"
    },
    {
      "id": 214,
      "start": 564.47998046875,
      "end": 568.52001953125,
      "text": " by putting you in remembrance of these things."
    },
    {
      "id": 215,
      "start": 568.52001953125,
      "end": 571.6400146484375,
      "text": " In that vein, I wanna share just four things"
    },
    {
      "id": 216,
      "start": 571.6400146484375,
      "end": 574.52001953125,
      "text": " with you this morning that you know,"
    },
    {
      "id": 217,
      "start": 574.52001953125,
      "end": 576.47998046875,
      "text": " but I wanna remind you of."
    },
    {
      "id": 218,
      "start": 576.47998046875,
      "end": 579.5599975585938,
      "text": " Remember, see, in the midst of chaos and confusion,"
    },
    {
      "id": 219,
      "start": 579.5599975585938,
      "end": 583.4000244140625,
      "text": " when things seem to be on their head, so to speak,"
    },
    {
      "id": 220,
      "start": 583.4000244140625,
      "end": 586.0399780273438,
      "text": " and it seems like it's challenging"
    },
    {
      "id": 221,
      "start": 586.0399780273438,
      "end": 588.4000244140625,
      "text": " for us to navigate the waters,"
    },
    {
      "id": 222,
      "start": 588.4000244140625,
      "end": 590.9600219726562,
      "text": " it is good for us to be reminded of some things."
    },
    {
      "id": 223,
      "start": 590.9600219726562,
      "end": 593.47998046875,
      "text": " Now, I will readily admit to you"
    },
    {
      "id": 224,
      "start": 593.47998046875,
      "end": 598.0,
      "text": " that this morning this list could have been 50, 60, 70 things"
    },
    {
      "id": 225,
      "start": 598.0,
      "end": 600.9199829101562,
      "text": " and we could have part one, part two, part."
    },
    {
      "id": 0,
      "start": 600.9199829101562,
      "end": 606.9199829101562,
      "text": " but the reality is I picked four things if you have others the Lord bless you and"
    },
    {
      "id": 1,
      "start": 607.4799828529358,
      "end": 609.0799827575684,
      "text": " You can share them with me"
    },
    {
      "id": 2,
      "start": 609.0799827575684,
      "end": 610.7199831008911,
      "text": " I'd be welcome to receive them"
    },
    {
      "id": 3,
      "start": 610.7199831008911,
      "end": 616.479983329773,
      "text": " But I simply picked four things that I want to remind you of this morning that I hope that we would be"
    },
    {
      "id": 4,
      "start": 616.8399829864502,
      "end": 621.7199821472168,
      "text": " Even as God said to the children of Israel in the book of Deuteronomy beware lest you forget"
    },
    {
      "id": 5,
      "start": 622.2399826049805,
      "end": 627.9399833679199,
      "text": " See there are times in which we must be reminded Peter says I want to remind you"
    },
    {
      "id": 6,
      "start": 627.9399833679199,
      "end": 633.9799842834473,
      "text": " I'm gonna put you in remembrance of these things number one. The Lord is still on his throne"
    },
    {
      "id": 7,
      "start": 635.3799819946289,
      "end": 640.1399841308594,
      "text": " The Lord is still on his throne. He is what wonderful songs that were sung today"
    },
    {
      "id": 8,
      "start": 640.1399841308594,
      "end": 647.7399826049805,
      "text": " What a wonderful special during our offertory to think about the the place and position of our God"
    },
    {
      "id": 9,
      "start": 647.7399826049805,
      "end": 649.6199836730957,
      "text": " He is"
    },
    {
      "id": 10,
      "start": 649.6199836730957,
      "end": 651.8999824523926,
      "text": " Almighty he is the Lord God"
    },
    {
      "id": 11,
      "start": 652.4199829101562,
      "end": 654.2799835205078,
      "text": " Omnipotent he reigns"
    },
    {
      "id": 12,
      "start": 654.2799835205078,
      "end": 659.2799835205078,
      "text": " He's always been on his throne. No one will ever take him from his throne"
    },
    {
      "id": 13,
      "start": 659.2799835205078,
      "end": 661.2799835205078,
      "text": " He's not gonna vacate his throne"
    },
    {
      "id": 14,
      "start": 661.3999824523926,
      "end": 667.6799850463867,
      "text": " We can rejoice in this truth this morning, and I believe that it's important for us to remember"
    },
    {
      "id": 15,
      "start": 668.3999862670898,
      "end": 670.3999862670898,
      "text": " That God's on his throne"
    },
    {
      "id": 16,
      "start": 670.7999801635742,
      "end": 673.9199829101562,
      "text": " Listen the the powers that be on this world"
    },
    {
      "id": 17,
      "start": 674.47998046875,
      "end": 679.8799819946289,
      "text": " Are in subject to the power of God we must be mindful of that"
    },
    {
      "id": 18,
      "start": 680.3999862670898,
      "end": 686.6399841308594,
      "text": " The reality is that he is the Lord God Almighty notice it turned back to the book of Psalms if you will"
    },
    {
      "id": 19,
      "start": 686.6399841308594,
      "end": 689.7599792480469,
      "text": " We're gonna look at a number of passages of Scripture today"
    },
    {
      "id": 20,
      "start": 689.7599792480469,
      "end": 696.0399856567383,
      "text": " And I hope that they'd be a blessing to you as you look at what's taking place and consider the fact and remember"
    },
    {
      "id": 21,
      "start": 696.6399841308594,
      "end": 700.6399841308594,
      "text": " Today that the Lord is still on his throne. Sometimes we deal with"
    },
    {
      "id": 22,
      "start": 701.5599822998047,
      "end": 705.8799819946289,
      "text": " Difficulties and opposition and it seems as if the enemy might be making progress"
    },
    {
      "id": 23,
      "start": 705.8799819946289,
      "end": 711.8799819946289,
      "text": " It seems as if maybe they're winning but we must be mindful of the truth that God is on his throne"
    },
    {
      "id": 24,
      "start": 713.0399856567383,
      "end": 720.0599822998047,
      "text": " Psalm 11 verse 3 and 4 the Bible says this if the foundations be destroyed. What can the righteous do?"
    },
    {
      "id": 25,
      "start": 720.8399810791016,
      "end": 725.2799835205078,
      "text": " But notice what he says in verse number 4 the Lord is in"
    },
    {
      "id": 26,
      "start": 725.9199829101562,
      "end": 733.1599884033203,
      "text": " His holy temple the Lord's throne is in heaven his eyes behold his eyelids try"
    },
    {
      "id": 27,
      "start": 733.6799774169922,
      "end": 739.6999816894531,
      "text": " The children of men he's on his throne psalm 45 in verse number 6"
    },
    {
      "id": 28,
      "start": 741.1799774169922,
      "end": 746.5999755859375,
      "text": " Notice the psalmist says here thy throne. Oh God is forever and ever"
    },
    {
      "id": 29,
      "start": 747.1599884033203,
      "end": 750.4199829101562,
      "text": " The scepter of thy kingdom is a right"
    },
    {
      "id": 30,
      "start": 751.3199768066406,
      "end": 754.3999786376953,
      "text": " Scepter thou lovest righteousness and hatest wickedness"
    },
    {
      "id": 31,
      "start": 755.0399780273438,
      "end": 759.47998046875,
      "text": " Therefore God by God hath anointed thee with the oil of gladness above thy fellows"
    },
    {
      "id": 32,
      "start": 759.7599792480469,
      "end": 764.6799774169922,
      "text": " Notice that his throne is forever and ever psalm 47 in verse number 8"
    },
    {
      "id": 33,
      "start": 764.6799774169922,
      "end": 769.1199798583984,
      "text": " The Bible says there the psalmist is declaring God reigneth over the heathen"
    },
    {
      "id": 34,
      "start": 769.7599792480469,
      "end": 773.0799865722656,
      "text": " God sitteth upon the throne of his holiness"
    },
    {
      "id": 35,
      "start": 773.9199829101562,
      "end": 780.8399810791016,
      "text": " We're mindful of the account that God gives us in the life of Isaiah as it's recorded for us in Isaiah chapter number 6"
    },
    {
      "id": 36,
      "start": 780.8399810791016,
      "end": 785.8399810791016,
      "text": " And you'll understand that it's in that time in which the King King Uzziah died"
    },
    {
      "id": 37,
      "start": 786.4399871826172,
      "end": 790.9999847412109,
      "text": " In fact Isaiah 6 begins by telling us that in the year that King Uzziah died"
    },
    {
      "id": 38,
      "start": 791.239990234375,
      "end": 794.0799865722656,
      "text": " But I want you to notice the vision of Isaiah"
    },
    {
      "id": 39,
      "start": 794.9199829101562,
      "end": 799.7599792480469,
      "text": " We understand and we're not dealing with the entirety of the passage here in Isaiah 6"
    },
    {
      "id": 40,
      "start": 799.7599792480469,
      "end": 803.0199890136719,
      "text": " We understand the impact that this vision had upon Isaiah"
    },
    {
      "id": 41,
      "start": 803.0199890136719,
      "end": 809.1199798583984,
      "text": " We understand his call and his response and what have you but I want you to notice in verse number 1 of Isaiah 6"
    },
    {
      "id": 42,
      "start": 809.1199798583984,
      "end": 811.239990234375,
      "text": " The Bible says in the year that King Uzziah died"
    },
    {
      "id": 43,
      "start": 811.239990234375,
      "end": 818.7599792480469,
      "text": " I saw also the Lord sitting upon a throne high and lifted up and his train filled the temple"
    },
    {
      "id": 44,
      "start": 818.9999847412109,
      "end": 822.47998046875,
      "text": " Above it stood the seraphims each one had six wings with twain"
    },
    {
      "id": 45,
      "start": 822.47998046875,
      "end": 825.6799774169922,
      "text": " He covered his face and with twain he covered his feet and with twain"
    },
    {
      "id": 46,
      "start": 825.6799774169922,
      "end": 828.3599853515625,
      "text": " He did fly and one cried unto another and said holy"
    },
    {
      "id": 47,
      "start": 828.8799896240234,
      "end": 835.9599761962891,
      "text": " Holy holy is the Lord of hosts the whole earth is full of his glory"
    },
    {
      "id": 48,
      "start": 836.5999755859375,
      "end": 839.9999847412109,
      "text": " What Isaiah say he saw the Lord in his proper proper place"
    },
    {
      "id": 49,
      "start": 839.9999847412109,
      "end": 846.2999877929688,
      "text": " He saw that the Lord was sitting upon his throne. The Lord sitteth upon a throne high and lifted up"
    },
    {
      "id": 50,
      "start": 847.1199798583984,
      "end": 854.7199859619141,
      "text": " I'm thankful that our God is still on the throne these thousands of years later after the life of Isaiah after the death of Uzziah"
    },
    {
      "id": 51,
      "start": 854.7199859619141,
      "end": 862.3199768066406,
      "text": " That's recorded here. We find that God is still upon his throne in Hebrews 1. We've studied the passage of Scripture. Of course, we're"
    },
    {
      "id": 52,
      "start": 863.1599731445312,
      "end": 867.9999694824219,
      "text": " Making progress to the book of Hebrews. We've taken a couple of weeks off here of recent"
    },
    {
      "id": 53,
      "start": 867.9999694824219,
      "end": 873.4399719238281,
      "text": " but we will get back to the book of Hebrews but in chapter number 1 and verse number 8 the Bible tells us that the"
    },
    {
      "id": 54,
      "start": 873.8799743652344,
      "end": 880.3199768066406,
      "text": " Lord says notice here what God says to the Son to the Lord Jesus Christ, but unto the Son he said thy throne"
    },
    {
      "id": 55,
      "start": 880.3199768066406,
      "end": 887.4399719238281,
      "text": " Oh God is forever and ever a scepter of righteousness is the scepter of thy kingdom and we understand"
    },
    {
      "id": 56,
      "start": 887.8799743652344,
      "end": 891.5199890136719,
      "text": " Even as we've looked at some of those psalms that we looked at just a moment ago"
    },
    {
      "id": 57,
      "start": 891.9599914550781,
      "end": 895.2799682617188,
      "text": " In the fulfillment of those we find that the Bible"
    },
    {
      "id": 58,
      "start": 895.6799926757812,
      "end": 901.8999938964844,
      "text": " Tells us that our God is in control of all things in 1st Peter 3 in verse number 22"
    },
    {
      "id": 59,
      "start": 901.9199829101562,
      "end": 905.4399719238281,
      "text": " It says who has gone into heaven is on the right hand of God"
    },
    {
      "id": 60,
      "start": 906.0399780273438,
      "end": 907.47998046875,
      "text": " angels and"
    },
    {
      "id": 61,
      "start": 907.47998046875,
      "end": 909.47998046875,
      "text": " authorities and powers"
    },
    {
      "id": 62,
      "start": 909.5199890136719,
      "end": 912.1199951171875,
      "text": " being made subject unto him"
    },
    {
      "id": 63,
      "start": 912.9199829101562,
      "end": 914.0399780273438,
      "text": " in"
    },
    {
      "id": 64,
      "start": 914.0399780273438,
      "end": 920.2799682617188,
      "text": " Recent days Holly and Juliana have read through the book of Job and we've had conversation and discussion"
    },
    {
      "id": 65,
      "start": 920.5199890136719,
      "end": 926.5199890136719,
      "text": " about some of that which Job had experienced during his earthly trial, but one of the"
    },
    {
      "id": 66,
      "start": 927.0799865722656,
      "end": 932.1999816894531,
      "text": " Just precious reminders as you read the book of Job is to understand there"
    },
    {
      "id": 67,
      "start": 932.5599975585938,
      "end": 936.5199890136719,
      "text": " That anything that happened to Job had to be approved by God"
    },
    {
      "id": 68,
      "start": 937.5999755859375,
      "end": 939.0799865722656,
      "text": " the devil"
    },
    {
      "id": 69,
      "start": 939.0799865722656,
      "end": 945.8799743652344,
      "text": " The enemy of God's people the accuser of the brethren. Oh, he has power for sure. His power is limited"
    },
    {
      "id": 70,
      "start": 946.7599792480469,
      "end": 950.7599792480469,
      "text": " We serve the Lord God Almighty and he is sitting upon his throne"
    },
    {
      "id": 71,
      "start": 951.0799865722656,
      "end": 955.1999816894531,
      "text": " Think of the passage of Scripture in the book of Revelation that gives us a wonderful"
    },
    {
      "id": 72,
      "start": 955.8399963378906,
      "end": 960.2799682617188,
      "text": " Vision and insight into what John sees in Revelation chapter number four"
    },
    {
      "id": 73,
      "start": 960.2799682617188,
      "end": 967.5199890136719,
      "text": " I believe very specifically that as you study Revelation chapters 1 through 4 you have the opportunity to see"
    },
    {
      "id": 74,
      "start": 967.9199829101562,
      "end": 971.4399719238281,
      "text": " The the letters that are sent to the seven churches in Asia"
    },
    {
      "id": 75,
      "start": 971.9599914550781,
      "end": 978.719970703125,
      "text": " And how that the Lord is giving those letters and then you come into chapter number four and verse number one and"
    },
    {
      "id": 76,
      "start": 979.1999816894531,
      "end": 985.7599792480469,
      "text": " The Bible says this after this I looked and behold a door was opened in heaven and the first voice which I heard was as"
    },
    {
      "id": 77,
      "start": 985.7599792480469,
      "end": 988.47998046875,
      "text": " It were of a trumpet talking with me"
    },
    {
      "id": 78,
      "start": 988.47998046875,
      "end": 993.239990234375,
      "text": " Which said come up hither and I will show thee things which must be hereafter"
    },
    {
      "id": 79,
      "start": 993.6399841308594,
      "end": 997.5199890136719,
      "text": " What a great picture of the rapture of the church at the end of the church age"
    },
    {
      "id": 80,
      "start": 998.1999816894531,
      "end": 1003.3599853515625,
      "text": " And of course, we don't know how long that's gonna be we do know that he's coming and we'll deal with that in just a"
    },
    {
      "id": 81,
      "start": 1003.3599853515625,
      "end": 1003.9599914550781,
      "text": " moment"
    },
    {
      "id": 82,
      "start": 1003.9599914550781,
      "end": 1009.3599853515625,
      "text": " But we find here that the Bible then gives us in Revelation 4 verses 8 through 11"
    },
    {
      "id": 83,
      "start": 1009.3599853515625,
      "end": 1013.6799926757812,
      "text": " Notice these words and the four beasts had each of them six wings about him"
    },
    {
      "id": 84,
      "start": 1013.719970703125,
      "end": 1017.9599914550781,
      "text": " They were full of eyes within and they rest not day and night saying holy"
    },
    {
      "id": 85,
      "start": 1018.5599975585938,
      "end": 1020.4399719238281,
      "text": " holy holy"
    },
    {
      "id": 86,
      "start": 1020.4399719238281,
      "end": 1022.4399719238281,
      "text": " Lord God Almighty"
    },
    {
      "id": 87,
      "start": 1022.9199829101562,
      "end": 1028.9599914550781,
      "text": " Which was and is and is to come he's holy he's omnipotent"
    },
    {
      "id": 88,
      "start": 1029.47998046875,
      "end": 1030.8399963378906,
      "text": " He's eternal"
    },
    {
      "id": 89,
      "start": 1030.8399963378906,
      "end": 1036.9999694824219,
      "text": " The Bible says in verse 9 and when those beasts give glory and honor and thanks to him that sat on the throne"
    },
    {
      "id": 90,
      "start": 1037.239990234375,
      "end": 1040.0799865722656,
      "text": " Who liveth forever and ever the four and twenty?"
    },
    {
      "id": 91,
      "start": 1040.4399719238281,
      "end": 1045.7599792480469,
      "text": " elders fall down before him that sat on the throne and worship him that liveth forever and ever and"
    },
    {
      "id": 92,
      "start": 1045.9599914550781,
      "end": 1049.239990234375,
      "text": " Cast their crowns before the throne saying thou art"
    },
    {
      "id": 93,
      "start": 1049.8799743652344,
      "end": 1054.3199768066406,
      "text": " Worthy O Lord to receive glory and honor and power"
    },
    {
      "id": 94,
      "start": 1055.3599853515625,
      "end": 1060.719970703125,
      "text": " For thou hast created all things and for thy pleasure. They are and were"
    },
    {
      "id": 95,
      "start": 1061.6399841308594,
      "end": 1063.1199951171875,
      "text": " created"
    },
    {
      "id": 96,
      "start": 1063.1199951171875,
      "end": 1065.1199951171875,
      "text": " In the midst of chaos and confusion"
    },
    {
      "id": 97,
      "start": 1065.3999938964844,
      "end": 1069.1599731445312,
      "text": " One thing that we must remember is that the Lord is still on his throne"
    },
    {
      "id": 98,
      "start": 1069.4399719238281,
      "end": 1073.0399780273438,
      "text": " Can I tell you number two the Lord is still building his church?"
    },
    {
      "id": 99,
      "start": 1073.8399963378906,
      "end": 1079.8399963378906,
      "text": " He said but the church hasn't been able to assemble I understand but it's God's Church our church"
    },
    {
      "id": 100,
      "start": 1080.3599853515625,
      "end": 1087.5199890136719,
      "text": " and we must understand that even in the time in which we've not been able to assemble that God is still able to work and"
    },
    {
      "id": 101,
      "start": 1087.5199890136719,
      "end": 1094.3599853515625,
      "text": " God is still bringing forth his purpose in his plan. Does it mean that we're not interested in meeting? Absolutely not"
    },
    {
      "id": 102,
      "start": 1094.3599853515625,
      "end": 1096.9999694824219,
      "text": " I mean I long for the day. I'm looking forward with great"
    },
    {
      "id": 103,
      "start": 1097.8399963378906,
      "end": 1101.3599853515625,
      "text": " anticipation of next week and even as I've thought and"
    },
    {
      "id": 104,
      "start": 1102.239990234375,
      "end": 1104.239990234375,
      "text": " Considered in recent hours"
    },
    {
      "id": 105,
      "start": 1104.6399841308594,
      "end": 1110.6799926757812,
      "text": " just the the thought of next Sunday morning being able to see the brethren and worship together the"
    },
    {
      "id": 106,
      "start": 1110.9999694824219,
      "end": 1114.3999633789062,
      "text": " Emotions that many of us will experience in that moment"
    },
    {
      "id": 107,
      "start": 1115.1599731445312,
      "end": 1120.3599853515625,
      "text": " But we must remember that the Lord is building his church. It's his church"
    },
    {
      "id": 108,
      "start": 1120.7999877929688,
      "end": 1123.760009765625,
      "text": " He's the head of it and for that we rejoice"
    },
    {
      "id": 109,
      "start": 1124.5599975585938,
      "end": 1130.8999633789062,
      "text": " He has promised us that he will build his church. He didn't say I'll build my church and here are the"
    },
    {
      "id": 110,
      "start": 1131.3999633789062,
      "end": 1137.47998046875,
      "text": " Points of criteria that must be met in order for me to do my work. No, he's building his church and"
    },
    {
      "id": 111,
      "start": 1138.0,
      "end": 1145.1599731445312,
      "text": " We can rejoice in that and we find here that the Bible tells us notice in Matthew chapter number 16"
    },
    {
      "id": 112,
      "start": 1145.4400024414062,
      "end": 1147.719970703125,
      "text": " As I give you a moment to turn there"
    },
    {
      "id": 113,
      "start": 1147.719970703125,
      "end": 1153.9599609375,
      "text": " I want you to consider with me that as the Lord builds his church that we must understand that he builds his church"
    },
    {
      "id": 114,
      "start": 1154.3999633789062,
      "end": 1158.6799926757812,
      "text": " According to his plan and he builds it in his time. Oh"
    },
    {
      "id": 115,
      "start": 1159.6799926757812,
      "end": 1161.6799926757812,
      "text": " There are many"
    },
    {
      "id": 116,
      "start": 1161.8800048828125,
      "end": 1163.8800048828125,
      "text": " over the years that have had"
    },
    {
      "id": 117,
      "start": 1164.6399536132812,
      "end": 1172.2000122070312,
      "text": " various meeting seminars and what whatever you want to call them on church growth or church"
    },
    {
      "id": 118,
      "start": 1172.6399536132812,
      "end": 1174.6399536132812,
      "text": " building ideas and"
    },
    {
      "id": 119,
      "start": 1175.3200073242188,
      "end": 1182.5199584960938,
      "text": " Certainly God uses people and certainly he's gifted people to be able to do the work of the ministry"
    },
    {
      "id": 120,
      "start": 1182.5199584960938,
      "end": 1184.5199584960938,
      "text": " But we must never"
    },
    {
      "id": 121,
      "start": 1184.8399658203125,
      "end": 1188.219970703125,
      "text": " Think that it's the people that build the church"
    },
    {
      "id": 122,
      "start": 1188.8399658203125,
      "end": 1192.7999877929688,
      "text": " It's the Lord that builds the church. I'm thankful that he uses people"
    },
    {
      "id": 123,
      "start": 1193.3999633789062,
      "end": 1195.3999633789062,
      "text": " But it's God that does the work"
    },
    {
      "id": 124,
      "start": 1195.9199829101562,
      "end": 1200.760009765625,
      "text": " The Bible tells us in Matthew 16. What a powerful passage of Scripture where the Lord Jesus"
    },
    {
      "id": 0,
      "start": 1200.760009765625,
      "end": 1206.760009765625,
      "text": " Jesus says to His disciples, whom do men say that I am?"
    },
    {
      "id": 1,
      "start": 1206.760009765625,
      "end": 1211.8200101852417,
      "text": " Notice in verse 13, when Jesus came into the coast of Caesarea Philippi, He asked His disciples"
    },
    {
      "id": 2,
      "start": 1211.8200101852417,
      "end": 1215.7400093078613,
      "text": " saying, whom do men say that I, the Son of Man, am?"
    },
    {
      "id": 3,
      "start": 1215.7400093078613,
      "end": 1220.5400104522705,
      "text": " And they said, some say that thou art John the Baptist, some Elias, and others Jeremiah"
    },
    {
      "id": 4,
      "start": 1220.5400104522705,
      "end": 1222.6200103759766,
      "text": " or one of the prophets."
    },
    {
      "id": 5,
      "start": 1222.6200103759766,
      "end": 1228.9000091552734,
      "text": " He saith unto them, notice, but whom say ye that I am?"
    },
    {
      "id": 6,
      "start": 1228.9000091552734,
      "end": 1235.920009613037,
      "text": " And Peter answered and said, thou art the Christ, the Son of the living God."
    },
    {
      "id": 7,
      "start": 1235.920009613037,
      "end": 1240.2400093078613,
      "text": " Jesus answered and said unto him, blessed art thou, Simon Barjona, for flesh and blood"
    },
    {
      "id": 8,
      "start": 1240.2400093078613,
      "end": 1244.6800079345703,
      "text": " hath not revealed it unto thee, but my Father which is in heaven."
    },
    {
      "id": 9,
      "start": 1244.6800079345703,
      "end": 1249.4000091552734,
      "text": " And I say also unto thee, thou art Peter, and upon this rock, notice what Jesus said,"
    },
    {
      "id": 10,
      "start": 1249.4000091552734,
      "end": 1260.0600090026855,
      "text": " I will build my church, and the gates of hell shall not prevail against it."
    },
    {
      "id": 11,
      "start": 1260.0600090026855,
      "end": 1264.6200103759766,
      "text": " We find that throughout the history of the church age, you can start reading in the book"
    },
    {
      "id": 12,
      "start": 1264.6200103759766,
      "end": 1270.7800064086914,
      "text": " of Acts, and you can read church history that's in divine scripture, that's recorded in part"
    },
    {
      "id": 13,
      "start": 1270.7800064086914,
      "end": 1273.3200073242188,
      "text": " of the complete canon of scripture."
    },
    {
      "id": 14,
      "start": 1273.3200073242188,
      "end": 1276.8400115966797,
      "text": " You can read the church history that God has given us in His Word."
    },
    {
      "id": 15,
      "start": 1276.8400115966797,
      "end": 1281.860008239746,
      "text": " You can read church history that's been recorded throughout the centuries, and you can find"
    },
    {
      "id": 16,
      "start": 1281.860008239746,
      "end": 1285.2200088500977,
      "text": " there's always been opposition."
    },
    {
      "id": 17,
      "start": 1285.2200088500977,
      "end": 1290.2200088500977,
      "text": " The enemy hates, I mean, Satan and the enemy, they hate the church."
    },
    {
      "id": 18,
      "start": 1290.2200088500977,
      "end": 1296.1800079345703,
      "text": " But we find that God has always built His church, and we look and we follow, this morning"
    },
    {
      "id": 19,
      "start": 1296.1800079345703,
      "end": 1300.3200073242188,
      "text": " I was thanking the Lord for those that have faithfully gone on before us, those that were"
    },
    {
      "id": 20,
      "start": 1300.3200073242188,
      "end": 1307.1000061035156,
      "text": " willing to pay whatever sacrifice was necessary to spend time in prison, and to be burned"
    },
    {
      "id": 21,
      "start": 1307.1000061035156,
      "end": 1308.1000061035156,
      "text": " at the stake."
    },
    {
      "id": 22,
      "start": 1308.1000061035156,
      "end": 1314.0600128173828,
      "text": " I mean, we've read, even last night, if you're reading the devotional book that we distributed"
    },
    {
      "id": 23,
      "start": 1314.0600128173828,
      "end": 1322.1200103759766,
      "text": " this year for 2020, you read about one that gave his life, he was a martyr, for the furtherance"
    },
    {
      "id": 24,
      "start": 1322.1200103759766,
      "end": 1325.260009765625,
      "text": " of the gospel, for the truth of God's Word."
    },
    {
      "id": 25,
      "start": 1325.260009765625,
      "end": 1332.3400115966797,
      "text": " And we find that throughout the history of the church, that God has been building His church."
    },
    {
      "id": 26,
      "start": 1332.3400115966797,
      "end": 1335.3400115966797,
      "text": " Yes, He uses people, and for that we can rejoice."
    },
    {
      "id": 27,
      "start": 1335.3400115966797,
      "end": 1338.740005493164,
      "text": " We understand in Ephesians chapter number 4, we won't take time to go there, but you"
    },
    {
      "id": 28,
      "start": 1338.740005493164,
      "end": 1343.6600036621094,
      "text": " can read through the passage of scripture, and you can find how the Lord has, yes, He"
    },
    {
      "id": 29,
      "start": 1343.6600036621094,
      "end": 1351.7000122070312,
      "text": " is the head of the church, but He's established the church, and the positions, and all of"
    },
    {
      "id": 30,
      "start": 1351.7000122070312,
      "end": 1356.4200134277344,
      "text": " the order for the church, but we understand, ultimately, that He is the head, and that"
    },
    {
      "id": 31,
      "start": 1356.4200134277344,
      "end": 1359.740005493164,
      "text": " He builds His church."
    },
    {
      "id": 32,
      "start": 1359.740005493164,
      "end": 1366.0800170898438,
      "text": " We think about these reminders this morning, as the people of God, I believe that we must"
    },
    {
      "id": 33,
      "start": 1366.0800170898438,
      "end": 1370.1800079345703,
      "text": " be mindful, we must remember that the Lord is still on His throne, number one."
    },
    {
      "id": 34,
      "start": 1370.1800079345703,
      "end": 1372.780014038086,
      "text": " Number two, that the Lord is still building His church."
    },
    {
      "id": 35,
      "start": 1372.780014038086,
      "end": 1376.3400115966797,
      "text": " Number three, the Lord is still saving sinners."
    },
    {
      "id": 36,
      "start": 1376.3400115966797,
      "end": 1379.3800048828125,
      "text": " For this I rejoice."
    },
    {
      "id": 37,
      "start": 1379.3800048828125,
      "end": 1383.500015258789,
      "text": " The reality today is that the gospel still works."
    },
    {
      "id": 38,
      "start": 1383.500015258789,
      "end": 1388.6600036621094,
      "text": " Paul said in Romans 1.16, I am not ashamed of the gospel of Christ, for it is the power"
    },
    {
      "id": 39,
      "start": 1388.6600036621094,
      "end": 1392.9600067138672,
      "text": " of God unto salvation, to everyone that believe it, to the Jew first, and also to the Greek."
    },
    {
      "id": 40,
      "start": 1392.9600067138672,
      "end": 1398.0600128173828,
      "text": " And we find that as we understand the truth of the Word of God, that the Lord is still"
    },
    {
      "id": 41,
      "start": 1398.0600128173828,
      "end": 1401.020004272461,
      "text": " saving sinners."
    },
    {
      "id": 42,
      "start": 1401.020004272461,
      "end": 1408.260009765625,
      "text": " We've heard even during these days of global pandemic, we've heard during these days in"
    },
    {
      "id": 43,
      "start": 1408.260009765625,
      "end": 1413.5800170898438,
      "text": " which the church has not been able to assemble as a corporate body of believers."
    },
    {
      "id": 44,
      "start": 1413.5800170898438,
      "end": 1418.9000091552734,
      "text": " We've heard during these days in which many of our outreach ministries have been hindered"
    },
    {
      "id": 45,
      "start": 1418.9000091552734,
      "end": 1425.1000061035156,
      "text": " or stopped completely, yet we've heard of souls that have been saved, lives that have"
    },
    {
      "id": 46,
      "start": 1425.1000061035156,
      "end": 1426.9000091552734,
      "text": " been changed."
    },
    {
      "id": 47,
      "start": 1426.9000091552734,
      "end": 1431.4400024414062,
      "text": " We've had unique opportunities to be able to share the gospel with those that God had"
    },
    {
      "id": 48,
      "start": 1431.4400024414062,
      "end": 1436.9400024414062,
      "text": " given us opportunities in days gone by, and perhaps we've prayed for, and we've ministered,"
    },
    {
      "id": 49,
      "start": 1436.9400024414062,
      "end": 1440.260009765625,
      "text": " and we've sought to encourage and share Scripture."
    },
    {
      "id": 50,
      "start": 1440.260009765625,
      "end": 1446.500015258789,
      "text": " And then after a period of time, enduring all of this situation, they come to a place"
    },
    {
      "id": 51,
      "start": 1446.500015258789,
      "end": 1448.6200103759766,
      "text": " where now they're ready."
    },
    {
      "id": 52,
      "start": 1448.6200103759766,
      "end": 1455.4200134277344,
      "text": " We've had many, several even, that we've prayed for as a local church that have trusted Christ"
    },
    {
      "id": 53,
      "start": 1455.4200134277344,
      "end": 1459.6600036621094,
      "text": " as their personal Savior in the days of this global pandemic."
    },
    {
      "id": 54,
      "start": 1459.6600036621094,
      "end": 1465.2200012207031,
      "text": " I've spoken to pastors and evangelists and missionaries, and they too have reported that"
    },
    {
      "id": 55,
      "start": 1465.2200012207031,
      "end": 1472.3000183105469,
      "text": " even in days in which we've not had the ability to minister as we have in our past, that yet"
    },
    {
      "id": 56,
      "start": 1472.3000183105469,
      "end": 1475.7000122070312,
      "text": " people are being saved, and that's wonderful."
    },
    {
      "id": 57,
      "start": 1475.7000122070312,
      "end": 1479.2200012207031,
      "text": " See, the gospel still works."
    },
    {
      "id": 58,
      "start": 1479.2200012207031,
      "end": 1485.7799987792969,
      "text": " Romans chapter number 10, what a joy to think about the power of the gospel."
    },
    {
      "id": 59,
      "start": 1485.7799987792969,
      "end": 1490.7400207519531,
      "text": " I've often said, as I have preached over the years, that we have the opportunity to give"
    },
    {
      "id": 60,
      "start": 1490.7400207519531,
      "end": 1496.4200134277344,
      "text": " the Word of God, and as we give God's Word, we understand that the Holy Spirit of God"
    },
    {
      "id": 61,
      "start": 1496.4200134277344,
      "end": 1500.4200134277344,
      "text": " will use the Word of God in the life of that individual."
    },
    {
      "id": 62,
      "start": 1500.4200134277344,
      "end": 1506.9800109863281,
      "text": " I often pray that God will help those individuals that I speak to, some that do not accept the"
    },
    {
      "id": 63,
      "start": 1506.9800109863281,
      "end": 1510.7799987792969,
      "text": " Lord Jesus Christ as their personal Savior, but they've heard the truth."
    },
    {
      "id": 64,
      "start": 1510.7799987792969,
      "end": 1516.8200073242188,
      "text": " I pray often that God would remind them that they would, when they pillow their head at"
    },
    {
      "id": 65,
      "start": 1516.8200073242188,
      "end": 1522.9400024414062,
      "text": " night, remember the words of Scripture and the truth of God's Word with regard to salvation"
    },
    {
      "id": 66,
      "start": 1522.9400024414062,
      "end": 1523.9400024414062,
      "text": " and eternity."
    },
    {
      "id": 67,
      "start": 1523.9400024414062,
      "end": 1529.5400085449219,
      "text": " I've prayed for people that I've shared the gospel with that God would allow them to have"
    },
    {
      "id": 68,
      "start": 1529.5400085449219,
      "end": 1533.3000183105469,
      "text": " another gospel witness come into their life."
    },
    {
      "id": 69,
      "start": 1533.3000183105469,
      "end": 1539.1400146484375,
      "text": " May it be through, not so much today, someone that might sit on a plane next to them or"
    },
    {
      "id": 70,
      "start": 1539.1400146484375,
      "end": 1543.9000244140625,
      "text": " in a metro car next to them that would be faithful to give the gospel the same message"
    },
    {
      "id": 71,
      "start": 1543.9000244140625,
      "end": 1545.9800109863281,
      "text": " that had already been delivered."
    },
    {
      "id": 72,
      "start": 1546.1400146484375,
      "end": 1547.9400024414062,
      "text": " And God works that way."
    },
    {
      "id": 73,
      "start": 1547.9400024414062,
      "end": 1550.260009765625,
      "text": " We can rejoice in that."
    },
    {
      "id": 74,
      "start": 1550.260009765625,
      "end": 1555.0599975585938,
      "text": " Romans 10, in verse number 9, the Bible says that if thou shalt confess with thy mouth"
    },
    {
      "id": 75,
      "start": 1555.0599975585938,
      "end": 1561.1800231933594,
      "text": " the Lord Jesus, and shalt believe in thine heart that God hath raised Him from the dead,"
    },
    {
      "id": 76,
      "start": 1561.1800231933594,
      "end": 1564.2200012207031,
      "text": " thou shalt be saved."
    },
    {
      "id": 77,
      "start": 1564.2200012207031,
      "end": 1568.02001953125,
      "text": " For at the heart man believeth unto righteousness, and with the mouth confession is made unto"
    },
    {
      "id": 78,
      "start": 1568.02001953125,
      "end": 1569.9800109863281,
      "text": " salvation."
    },
    {
      "id": 79,
      "start": 1569.9800109863281,
      "end": 1576.5,
      "text": " It says in verse number 13, for whosoever shall call upon the name of the Lord shall"
    },
    {
      "id": 80,
      "start": 1576.5,
      "end": 1578.1400146484375,
      "text": " be saved."
    },
    {
      "id": 81,
      "start": 1578.1400146484375,
      "end": 1585.5800170898438,
      "text": " I'm thankful that even though we've had certain aspects of ministry hindered over these days"
    },
    {
      "id": 82,
      "start": 1585.5800170898438,
      "end": 1593.5,
      "text": " of global pandemic, and though we've dealt with changes in our routine process of propagating"
    },
    {
      "id": 83,
      "start": 1593.5,
      "end": 1597.3399963378906,
      "text": " the gospel and going into our community and distributing tracts and all of those things,"
    },
    {
      "id": 84,
      "start": 1597.4200134277344,
      "end": 1602.02001953125,
      "text": " I am glad that people can still trust the Lord as their personal Savior, that Jesus"
    },
    {
      "id": 85,
      "start": 1602.02001953125,
      "end": 1603.02001953125,
      "text": " saves."
    },
    {
      "id": 86,
      "start": 1603.02001953125,
      "end": 1607.1400146484375,
      "text": " We sing the song and we believe the message."
    },
    {
      "id": 87,
      "start": 1607.1400146484375,
      "end": 1612.3399963378906,
      "text": " See, today we must be reminded of the truth that the Lord is still saving sinners."
    },
    {
      "id": 88,
      "start": 1612.3399963378906,
      "end": 1623.7799987792969,
      "text": " Notice in Hebrews chapter number 7, in verse number 25, the Bible is giving us truth here"
    },
    {
      "id": 89,
      "start": 1623.7799987792969,
      "end": 1628.7400207519531,
      "text": " and we'll get to this passage here, Lord willing, in another month or so as we go through"
    },
    {
      "id": 90,
      "start": 1628.7400207519531,
      "end": 1634.4600219726562,
      "text": " the truth, the teaching with regard to the priesthood of Christ and after the order of"
    },
    {
      "id": 91,
      "start": 1634.4600219726562,
      "end": 1636.9400024414062,
      "text": " Melchizedek, not after that of Aaron."
    },
    {
      "id": 92,
      "start": 1636.9400024414062,
      "end": 1642.9400024414062,
      "text": " We find in verse 25, however, of Hebrews 7, the Bible says, wherefore He is able also"
    },
    {
      "id": 93,
      "start": 1642.9400024414062,
      "end": 1649.7400207519531,
      "text": " to save them to the uttermost that come unto God by Him, seeing He ever liveth to make"
    },
    {
      "id": 94,
      "start": 1649.7400207519531,
      "end": 1653.4200134277344,
      "text": " intercession for them."
    },
    {
      "id": 95,
      "start": 1653.4200134277344,
      "end": 1656.7400207519531,
      "text": " I'm thankful that the gospel still works."
    },
    {
      "id": 96,
      "start": 1656.7400207519531,
      "end": 1662.8600158691406,
      "text": " I'm thankful in the midst of all of that which we're dealing with, and I don't pretend to"
    },
    {
      "id": 97,
      "start": 1662.8600158691406,
      "end": 1666.2200012207031,
      "text": " act like it's the worst thing that humans have ever dealt with."
    },
    {
      "id": 98,
      "start": 1666.2200012207031,
      "end": 1668.9000244140625,
      "text": " I know far better than that."
    },
    {
      "id": 99,
      "start": 1668.9000244140625,
      "end": 1674.0599975585938,
      "text": " But some of that we're dealing with, and there are times in which over these periods of weeks"
    },
    {
      "id": 100,
      "start": 1674.0599975585938,
      "end": 1678.5,
      "text": " that we've dealt with some of the changes that we've had to implement, that I've had"
    },
    {
      "id": 101,
      "start": 1678.5,
      "end": 1685.7000122070312,
      "text": " conversations with fellow pastors and workers, missionaries, evangelists, I've had conversations"
    },
    {
      "id": 102,
      "start": 1685.7000122070312,
      "end": 1689.1000061035156,
      "text": " with church members, and I've heard people that have been discouraged."
    },
    {
      "id": 103,
      "start": 1689.1000061035156,
      "end": 1694.8600158691406,
      "text": " I've heard people that have been just confused and wondering what's going on and is God really"
    },
    {
      "id": 104,
      "start": 1694.8600158691406,
      "end": 1695.8600158691406,
      "text": " at work?"
    },
    {
      "id": 105,
      "start": 1695.8600158691406,
      "end": 1700.5400085449219,
      "text": " And we can rejoice and answer with absolute certainty that God is still working."
    },
    {
      "id": 106,
      "start": 1700.5400085449219,
      "end": 1701.5400085449219,
      "text": " Why?"
    },
    {
      "id": 107,
      "start": 1701.5400085449219,
      "end": 1703.6199951171875,
      "text": " Because He's still on His throne."
    },
    {
      "id": 108,
      "start": 1703.6199951171875,
      "end": 1708.7400207519531,
      "text": " He's still the head of the church, and He's still building His church."
    },
    {
      "id": 109,
      "start": 1708.7400207519531,
      "end": 1711.1400146484375,
      "text": " And He's still saving sinners."
    },
    {
      "id": 110,
      "start": 1711.1400146484375,
      "end": 1715.7000122070312,
      "text": " Number four, if you're taking notes finally this morning, I want you to remember this"
    },
    {
      "id": 111,
      "start": 1715.7000122070312,
      "end": 1717.1799926757812,
      "text": " truth."
    },
    {
      "id": 112,
      "start": 1717.1799926757812,
      "end": 1720.5800170898438,
      "text": " Be mindful of this truth."
    },
    {
      "id": 113,
      "start": 1720.5800170898438,
      "end": 1726.97998046875,
      "text": " Every day of our lives, we ought to remember the fact that the Lord is still coming."
    },
    {
      "id": 114,
      "start": 1726.97998046875,
      "end": 1732.7000122070312,
      "text": " We believe in the blood, the book, of course, and the blessed hope."
    },
    {
      "id": 115,
      "start": 1732.780029296875,
      "end": 1737.5400390625,
      "text": " We believe in the imminent return of the Lord Jesus Christ."
    },
    {
      "id": 116,
      "start": 1737.5400390625,
      "end": 1743.5400390625,
      "text": " And I'm so thankful that the Bible teaches us that Jesus, in fact, is coming again."
    },
    {
      "id": 117,
      "start": 1743.5400390625,
      "end": 1749.1000366210938,
      "text": " In fact, as you would study the portions of Scripture that deal with the return of the"
    },
    {
      "id": 118,
      "start": 1749.1000366210938,
      "end": 1753.6600341796875,
      "text": " Lord and, of course, the rapture that would then immediately follow, and begin to study"
    },
    {
      "id": 119,
      "start": 1753.6600341796875,
      "end": 1759.3800048828125,
      "text": " some of those things that will come to pass and the one world order and the Antichrist"
    },
    {
      "id": 120,
      "start": 1759.3800048828125,
      "end": 1763.1000366210938,
      "text": " and all of those things, if you were to study all of those things and be mindful of the"
    },
    {
      "id": 121,
      "start": 1763.1000366210938,
      "end": 1769.1400146484375,
      "text": " Bible prophecy that God has given us and you begin to interpret some of those things that"
    },
    {
      "id": 122,
      "start": 1769.1400146484375,
      "end": 1774.6600341796875,
      "text": " we see happening around our globe today, you can see that the return of the Lord draweth"
    },
    {
      "id": 123,
      "start": 1774.6600341796875,
      "end": 1775.6600341796875,
      "text": " nigh."
    },
    {
      "id": 124,
      "start": 1775.6600341796875,
      "end": 1778.2200317382812,
      "text": " And how exciting it is."
    },
    {
      "id": 125,
      "start": 1778.2200317382812,
      "end": 1784.5599975585938,
      "text": " I spoke with a preacher friend not many days ago, and as we were chatting, we were speaking"
    },
    {
      "id": 126,
      "start": 1784.5599975585938,
      "end": 1786.8599853515625,
      "text": " about the soon return of the Lord."
    },
    {
      "id": 127,
      "start": 1786.8599853515625,
      "end": 1792.02001953125,
      "text": " Now he's older than I am by probably double almost, I don't know, I'm almost 40 now, so"
    },
    {
      "id": 128,
      "start": 1792.02001953125,
      "end": 1797.5400390625,
      "text": " not too many people that are double my age anymore, but close to at least."
    },
    {
      "id": 129,
      "start": 1797.5400390625,
      "end": 1800.6600341796875,
      "text": " And he said to me, he said, Brother Chris, I just want you to be"
    },
    {
      "id": 0,
      "start": 1800.6600341796875,
      "end": 1805.9400343894958,
      "text": " aware of the fact that in the 70s, I mean almost anywhere you went, you heard"
    },
    {
      "id": 1,
      "start": 1805.9400343894958,
      "end": 1811.3800344467163,
      "text": " Bible preaching on the return of the Lord. I wasn't even born in the 70s, yet"
    },
    {
      "id": 2,
      "start": 1811.3800344467163,
      "end": 1816.780035018921,
      "text": " alone saved in a church in the 70s, but the reality is that I've read books and"
    },
    {
      "id": 3,
      "start": 1816.780035018921,
      "end": 1822.1000347137451,
      "text": " I've heard that testimony from a number of people that there was that era in the"
    },
    {
      "id": 4,
      "start": 1822.1000347137451,
      "end": 1828.2600345611572,
      "text": " 70s where there was a bunch of preaching on the soon return of the Lord. And I'm"
    },
    {
      "id": 5,
      "start": 1828.2600345611572,
      "end": 1834.1800346374512,
      "text": " thankful to report that even as this brother told me, many of those that he"
    },
    {
      "id": 6,
      "start": 1834.1800346374512,
      "end": 1838.8200340270996,
      "text": " was serving with at that time absolutely believed that it would be in"
    },
    {
      "id": 7,
      "start": 1838.8200340270996,
      "end": 1842.5800323486328,
      "text": " their lifetime. That's one of the wonderful things about the Bible"
    },
    {
      "id": 8,
      "start": 1842.5800323486328,
      "end": 1845.6200332641602,
      "text": " doctrine and teaching of the imminent return of Christ is it could happen at"
    },
    {
      "id": 9,
      "start": 1845.6200332641602,
      "end": 1852.2600326538086,
      "text": " any moment. We find that in John chapter number 14, Jesus gives these precious"
    },
    {
      "id": 10,
      "start": 1852.2600326538086,
      "end": 1858.3400344848633,
      "text": " words. The first three verses of this chapter, you'll remember that at the end"
    },
    {
      "id": 11,
      "start": 1858.3400344848633,
      "end": 1862.4200325012207,
      "text": " of chapter 13, he had given them truth with regard to the fact that it was only"
    },
    {
      "id": 12,
      "start": 1862.4200325012207,
      "end": 1865.300033569336,
      "text": " a little while that he would be with them because why? He was going to go to"
    },
    {
      "id": 13,
      "start": 1865.300033569336,
      "end": 1869.2600326538086,
      "text": " the cross. He would be buried and he would rise in victory and then after"
    },
    {
      "id": 14,
      "start": 1869.2600326538086,
      "end": 1875.180030822754,
      "text": " those 40 days, he would ascend back to heaven. We find that in John 14, after he"
    },
    {
      "id": 15,
      "start": 1875.180030822754,
      "end": 1879.900032043457,
      "text": " had shared those truths with his disciples, he says, let not your heart be"
    },
    {
      "id": 16,
      "start": 1879.900032043457,
      "end": 1883.7800369262695,
      "text": " troubled. You believe in God, believe also in me. In my Father's house are many"
    },
    {
      "id": 17,
      "start": 1883.7800369262695,
      "end": 1889.1000366210938,
      "text": " mansions. If it were not so, I would have told you. I go to prepare a place for you."
    },
    {
      "id": 18,
      "start": 1889.1000366210938,
      "end": 1896.9800338745117,
      "text": " He says, and if I go and prepare a place for you, I will come again and receive"
    },
    {
      "id": 19,
      "start": 1896.9800338745117,
      "end": 1903.180030822754,
      "text": " you unto myself that where I am, there ye may be also. I'm so thankful for that"
    },
    {
      "id": 20,
      "start": 1903.180030822754,
      "end": 1908.6200332641602,
      "text": " promise of the Lord in verses two and three. He says, I go to"
    },
    {
      "id": 21,
      "start": 1908.6200332641602,
      "end": 1912.420036315918,
      "text": " prepare a place for you. He told us he's going to do it and then he says, and if I"
    },
    {
      "id": 22,
      "start": 1912.420036315918,
      "end": 1918.7000350952148,
      "text": " go, he says, I will come again. I'm looking for the soon return of our Lord"
    },
    {
      "id": 23,
      "start": 1918.7000350952148,
      "end": 1922.900032043457,
      "text": " and Savior Jesus Christ. We find that the book of First Thessalonians gives us"
    },
    {
      "id": 24,
      "start": 1922.900032043457,
      "end": 1929.2200317382812,
      "text": " great truth with regard to the rapture and the process in which Paul"
    },
    {
      "id": 25,
      "start": 1929.2200317382812,
      "end": 1932.8600311279297,
      "text": " is giving this instruction to the believers in Thessalonica and they"
    },
    {
      "id": 26,
      "start": 1932.8600311279297,
      "end": 1936.9400329589844,
      "text": " needed to understand some things and there had been a much confusion in that"
    },
    {
      "id": 27,
      "start": 1937.020034790039,
      "end": 1941.5400390625,
      "text": " particular day with regard to the day of the Lord and we find that Paul begins"
    },
    {
      "id": 28,
      "start": 1941.5400390625,
      "end": 1945.780029296875,
      "text": " the passage in verse 13 by telling them, I don't want you to be ignorant of these"
    },
    {
      "id": 29,
      "start": 1945.780029296875,
      "end": 1949.9000396728516,
      "text": " things. I want you to be informed. I want you to know these things. I'm speaking to"
    },
    {
      "id": 30,
      "start": 1949.9000396728516,
      "end": 1954.3400268554688,
      "text": " you by the Word of the Lord. He uses that very phrase in verse number 15. For this"
    },
    {
      "id": 31,
      "start": 1954.3400268554688,
      "end": 1959.3400268554688,
      "text": " we say unto you, by the Word of the Lord. See, Paul is wanting the believers in"
    },
    {
      "id": 32,
      "start": 1959.3400268554688,
      "end": 1963.7000274658203,
      "text": " Thessalonica to understand this wasn't just Paul's interpretation or Paul's"
    },
    {
      "id": 33,
      "start": 1963.8200378417969,
      "end": 1968.2200317382812,
      "text": " belief or his opinion. He's giving them the Word of the Lord and how we ought to"
    },
    {
      "id": 34,
      "start": 1968.2200317382812,
      "end": 1972.8200378417969,
      "text": " rejoice in that today as well. He says in verse number 16, for the Lord Himself"
    },
    {
      "id": 35,
      "start": 1972.8200378417969,
      "end": 1978.9000396728516,
      "text": " shall descend from heaven with a shout, with the voice of the archangel, with the"
    },
    {
      "id": 36,
      "start": 1978.9000396728516,
      "end": 1983.5400390625,
      "text": " trump of God, the dead in Christ shall rise first. Then we which are alive and"
    },
    {
      "id": 37,
      "start": 1983.5400390625,
      "end": 1986.780029296875,
      "text": " remain shall be caught up together with them in the clouds to meet the Lord in"
    },
    {
      "id": 38,
      "start": 1986.780029296875,
      "end": 1992.6200408935547,
      "text": " the air and so shall we ever be with the Lord. You notice the Bible says in verse"
    },
    {
      "id": 39,
      "start": 1992.6200408935547,
      "end": 1998.1400299072266,
      "text": " 16, for the Lord Himself shall descend. He doesn't say He might descend. It's"
    },
    {
      "id": 40,
      "start": 1998.1400299072266,
      "end": 2003.7000274658203,
      "text": " possible that He's going to return. No, He shall. See, I believe that as you look at"
    },
    {
      "id": 41,
      "start": 2003.7000274658203,
      "end": 2007.9800415039062,
      "text": " the early church history and you look at the book of Acts in particular, I believe"
    },
    {
      "id": 42,
      "start": 2007.9800415039062,
      "end": 2012.300033569336,
      "text": " that one of the things that was such a motivator for the believers in the first"
    },
    {
      "id": 43,
      "start": 2012.300033569336,
      "end": 2017.1800384521484,
      "text": " century was the soon return of Christ. See, I think about that passage of"
    },
    {
      "id": 44,
      "start": 2017.1800384521484,
      "end": 2021.2600402832031,
      "text": " Scripture in Acts chapter number 1 where the ascension of Jesus Christ is"
    },
    {
      "id": 45,
      "start": 2021.2600402832031,
      "end": 2025.300033569336,
      "text": " recorded and we find that those disciples, they hear the instruction of"
    },
    {
      "id": 46,
      "start": 2025.300033569336,
      "end": 2029.3800354003906,
      "text": " the Lord and they hear that truth of the Great Commission, that we're to be"
    },
    {
      "id": 47,
      "start": 2029.3800354003906,
      "end": 2034.1000366210938,
      "text": " witnesses after we receive power from the Holy Ghost, that we're to be witnesses"
    },
    {
      "id": 48,
      "start": 2034.1000366210938,
      "end": 2038.9000396728516,
      "text": " unto Him. And then the Bible tells us in Acts 1 how that they see the Lord ascend"
    },
    {
      "id": 49,
      "start": 2038.9000396728516,
      "end": 2045.1800384521484,
      "text": " up into heaven. In my mind's eye, I could stand there with those disciples along"
    },
    {
      "id": 50,
      "start": 2045.1800384521484,
      "end": 2050.3800354003906,
      "text": " those, in that very same place, alongside these disciples and I can hear the words"
    },
    {
      "id": 51,
      "start": 2050.3800354003906,
      "end": 2054.8600311279297,
      "text": " of Jesus as He's speaking to them and reminding them of His mission that He's"
    },
    {
      "id": 52,
      "start": 2054.8600311279297,
      "end": 2060.060028076172,
      "text": " leaving them with and then He's taken up out of their sight. And the Bible tells"
    },
    {
      "id": 53,
      "start": 2060.060028076172,
      "end": 2066.260040283203,
      "text": " that they stand there, they're looking, gazing up into heaven. What happens? The"
    },
    {
      "id": 54,
      "start": 2066.260040283203,
      "end": 2069.9400329589844,
      "text": " Bible tells us that as they looked steadfastly toward heaven, as He went up,"
    },
    {
      "id": 55,
      "start": 2069.9400329589844,
      "end": 2073.7000427246094,
      "text": " behold, two men stood by them with white apparel, in white apparel, and here's"
    },
    {
      "id": 56,
      "start": 2073.7000427246094,
      "end": 2078.060028076172,
      "text": " what they said, ye men of Galilee, why stand ye gazing up into heaven?"
    },
    {
      "id": 57,
      "start": 2078.060028076172,
      "end": 2086.4200439453125,
      "text": " This same Jesus, which is taken up from you into heaven, shall so come in like"
    },
    {
      "id": 58,
      "start": 2086.4200439453125,
      "end": 2092.3800354003906,
      "text": " manner as ye have seen Him go into heaven. Now think about that. They'd"
    },
    {
      "id": 59,
      "start": 2092.3800354003906,
      "end": 2097.5400390625,
      "text": " received the truth, the mission from the Lord in verse 8, but ye shall receive"
    },
    {
      "id": 60,
      "start": 2097.5400390625,
      "end": 2101.260040283203,
      "text": " power after that the Holy Ghost has come upon you. And ye shall be witnesses unto"
    },
    {
      "id": 61,
      "start": 2101.260040283203,
      "end": 2104.3400268554688,
      "text": " me both in Jerusalem and Judea and Samaria and to the uttermost part of the"
    },
    {
      "id": 62,
      "start": 2104.3400268554688,
      "end": 2107.580047607422,
      "text": " earth. And then He's ascended out of their sight. They stand there gazing,"
    },
    {
      "id": 63,
      "start": 2107.580047607422,
      "end": 2113.300048828125,
      "text": " these angels come and say He's coming back. We better get busy doing what"
    },
    {
      "id": 64,
      "start": 2113.300048828125,
      "end": 2118.7000427246094,
      "text": " He left for us to do. And you read the book of Acts and you see a group of"
    },
    {
      "id": 65,
      "start": 2118.7000427246094,
      "end": 2122.6600341796875,
      "text": " people that were motivated to do what God told them to do. Why? They didn't know"
    },
    {
      "id": 66,
      "start": 2122.6600341796875,
      "end": 2129.7000427246094,
      "text": " when He's coming back, but they knew He's coming back. If I tell my children, we"
    },
    {
      "id": 67,
      "start": 2129.7000427246094,
      "end": 2133.9400329589844,
      "text": " want you to do these things and we'll be back, and I don't tell them when we're"
    },
    {
      "id": 68,
      "start": 2133.9400329589844,
      "end": 2140.3800354003906,
      "text": " going to be back. I hope that the reminder in the confirmation to them"
    },
    {
      "id": 69,
      "start": 2140.3800354003906,
      "end": 2145.1400451660156,
      "text": " that we're going to return, that we're going to come back and see what you've"
    },
    {
      "id": 70,
      "start": 2145.1400451660156,
      "end": 2149.2200317382812,
      "text": " done, that it would be a motivator for them to do what we told them to do. I was"
    },
    {
      "id": 71,
      "start": 2149.2200317382812,
      "end": 2154.820037841797,
      "text": " a kid once and I remember waiting until the very last minute to do what it was"
    },
    {
      "id": 72,
      "start": 2154.820037841797,
      "end": 2159.4600219726562,
      "text": " that maybe I thought I was supposed to do. But I tell you as the people of God,"
    },
    {
      "id": 73,
      "start": 2159.4600219726562,
      "end": 2164.740020751953,
      "text": " we don't know when Jesus is coming back. And when He comes, there's not going to"
    },
    {
      "id": 74,
      "start": 2164.740020751953,
      "end": 2168.4600219726562,
      "text": " be any time for us to hurry up and do this or the other thing because the"
    },
    {
      "id": 75,
      "start": 2168.4600219726562,
      "end": 2173.1400451660156,
      "text": " Bible says in the moment, in the twinkling of an eye, I mean just like"
    },
    {
      "id": 76,
      "start": 2173.1400451660156,
      "end": 2179.060028076172,
      "text": " that, He's coming back. What a joy, what a great promise. In the book of Titus, Paul"
    },
    {
      "id": 77,
      "start": 2179.060028076172,
      "end": 2185.2200317382812,
      "text": " tells his son in the faith, he uses that terminology for both Titus and Timothy."
    },
    {
      "id": 78,
      "start": 2185.2200317382812,
      "end": 2189.3800354003906,
      "text": " In fact, you see that he's writing to Philemon, he mentions that of Onesimus"
    },
    {
      "id": 79,
      "start": 2189.3800354003906,
      "end": 2193.9400329589844,
      "text": " as well. But here in Titus 2, in verse number 13, he says,"
    },
    {
      "id": 80,
      "start": 2193.9400329589844,
      "end": 2198.2200317382812,
      "text": " looking for that blessed hope and the glorious appearing of the great God and"
    },
    {
      "id": 81,
      "start": 2198.2200317382812,
      "end": 2206.1800231933594,
      "text": " our Savior, Jesus Christ. I'm looking for His soon return. In the book of Hebrews,"
    },
    {
      "id": 82,
      "start": 2206.1800231933594,
      "end": 2211.4600219726562,
      "text": " we have wonderful truth with regard to the coming of the Lord. I don't know when"
    },
    {
      "id": 83,
      "start": 2211.4600219726562,
      "end": 2214.9800415039062,
      "text": " we're gonna get to these chapters because it's chapter 9 and 10. We might"
    },
    {
      "id": 84,
      "start": 2214.9800415039062,
      "end": 2218.9800415039062,
      "text": " have Hebrews part 2, as far as I know. I have no idea what's gonna happen for"
    },
    {
      "id": 85,
      "start": 2218.9800415039062,
      "end": 2225.6200256347656,
      "text": " 2021, but I want to remind you in Hebrews 9 and verse 28, the Bible says,"
    },
    {
      "id": 86,
      "start": 2225.6200256347656,
      "end": 2232.4200439453125,
      "text": " so Christ was once offered to bear the sins of many and unto them that look for"
    },
    {
      "id": 87,
      "start": 2232.4200439453125,
      "end": 2238.5400390625,
      "text": " Him shall He appear the second time without sin unto salvation. Notice what"
    },
    {
      "id": 88,
      "start": 2238.5400390625,
      "end": 2244.8600463867188,
      "text": " he says in chapter 10 and verse number 37, for yet a little while and He that"
    },
    {
      "id": 89,
      "start": 2244.8600463867188,
      "end": 2254.740020751953,
      "text": " shall come will come and will not tarry. Listen, Jesus is coming right on time. We"
    },
    {
      "id": 90,
      "start": 2254.740020751953,
      "end": 2259.4200439453125,
      "text": " don't know the time, but there's a time that Jesus is coming. And we understand"
    },
    {
      "id": 91,
      "start": 2259.4200439453125,
      "end": 2267.260040283203,
      "text": " biblically speaking that He will not tarry. We, James, in chapter 5 and verse"
    },
    {
      "id": 92,
      "start": 2267.260040283203,
      "end": 2272.300048828125,
      "text": " number 8, the Bible says, be also patient, establish your hearts for the coming of"
    },
    {
      "id": 93,
      "start": 2272.300048828125,
      "end": 2278.4200439453125,
      "text": " the Lord draweth nigh. The coming of the Lord draweth nigh. And, of course, we're familiar with the"
    },
    {
      "id": 94,
      "start": 2278.4200439453125,
      "end": 2284.02001953125,
      "text": " passage in 2 Peter 3. In fact, I mentioned it just on Wednesday evening"
    },
    {
      "id": 95,
      "start": 2284.02001953125,
      "end": 2290.2200317382812,
      "text": " with those scoffers and saying, where is the promise of His coming, you know? They"
    },
    {
      "id": 96,
      "start": 2290.2200317382812,
      "end": 2294.4600219726562,
      "text": " believe that... the thing that's interesting is that they were aware of"
    },
    {
      "id": 97,
      "start": 2294.4600219726562,
      "end": 2299.260040283203,
      "text": " the promise of His coming. But they said, where is the promise of His coming? We"
    },
    {
      "id": 98,
      "start": 2299.260040283203,
      "end": 2303.060028076172,
      "text": " find that as the text of Scripture goes on, we eventually get to verse number"
    },
    {
      "id": 99,
      "start": 2303.060028076172,
      "end": 2307.3400268554688,
      "text": " 8, and the Bible says there, but beloved, be not ignorant of this one thing, that"
    },
    {
      "id": 100,
      "start": 2307.3400268554688,
      "end": 2310.9000244140625,
      "text": " one day is with the Lord as a thousand years, and a thousand years is one day."
    },
    {
      "id": 101,
      "start": 2310.9000244140625,
      "end": 2317.5000610351562,
      "text": " 2 Peter 3 and verse number 8. See, our God is eternal. He operates outside of"
    },
    {
      "id": 102,
      "start": 2317.5000610351562,
      "end": 2323.02001953125,
      "text": " time. We find that He then gives this wonderful truth in verse number 9"
    },
    {
      "id": 103,
      "start": 2323.02001953125,
      "end": 2329.8600463867188,
      "text": " of 2 Peter 3. The Lord is not slack concerning His promise, as some men"
    },
    {
      "id": 104,
      "start": 2329.8600463867188,
      "end": 2333.9400634765625,
      "text": " count slackness. But as longsuffering to us were, not willing that any should"
    },
    {
      "id": 105,
      "start": 2333.9400634765625,
      "end": 2337.9000244140625,
      "text": " perish, but that all should come to repentance. Reminds me of our third point,"
    },
    {
      "id": 106,
      "start": 2337.9000244140625,
      "end": 2344.3800048828125,
      "text": " the Lord is still saving sinners. But we can rest assured this morning that the"
    },
    {
      "id": 107,
      "start": 2344.3800048828125,
      "end": 2349.02001953125,
      "text": " Lord is still going to come. He's coming again. I don't know the hour. I'm not"
    },
    {
      "id": 108,
      "start": 2349.02001953125,
      "end": 2353.8200073242188,
      "text": " telling you it's going to be today. I'm not trying to set a time. Many that have"
    },
    {
      "id": 109,
      "start": 2353.8200073242188,
      "end": 2359.06005859375,
      "text": " gone before us that have done that have proven themselves to be unwise. But the"
    },
    {
      "id": 110,
      "start": 2359.06005859375,
      "end": 2367.8600463867188,
      "text": " Bible teaches us the imminent return of Jesus Christ. And this morning, as we are"
    },
    {
      "id": 111,
      "start": 2367.8600463867188,
      "end": 2372.8600463867188,
      "text": " celebrating Memorial Day as a nation, tomorrow of course the official"
    },
    {
      "id": 112,
      "start": 2372.8600463867188,
      "end": 2377.260009765625,
      "text": " observance, there's some things no doubt that we need to remember as Americans."
    },
    {
      "id": 113,
      "start": 2377.260009765625,
      "end": 2382.5800170898438,
      "text": " There are some things no doubt that have not been adequately and properly"
    },
    {
      "id": 114,
      "start": 2382.5800170898438,
      "end": 2390.3400268554688,
      "text": " taught to a new generation about the sacrifice that was made by millions of"
    },
    {
      "id": 115,
      "start": 2390.3400268554688,
      "end": 2396.1400146484375,
      "text": " people for us to enjoy the freedom that we have today. What a blessing that is."
    },
    {
      "id": 116,
      "start": 2396.1400146484375,
      "end": 2402.5800170898438,
      "text": " And I'm thankful to be American, to live in this nation."
    },
    {
      "id": 0,
      "start": 2402.5800170898438,
      "end": 2406.740016937256,
      "text": " But my citizenship is in heaven."
    },
    {
      "id": 1,
      "start": 2406.740016937256,
      "end": 2408.4600172042847,
      "text": " I'm a child of the King."
    },
    {
      "id": 2,
      "start": 2408.4600172042847,
      "end": 2409.4600172042847,
      "text": " Amen?"
    },
    {
      "id": 3,
      "start": 2409.4600172042847,
      "end": 2411.020016670227,
      "text": " I've been born again."
    },
    {
      "id": 4,
      "start": 2411.020016670227,
      "end": 2415.3400173187256,
      "text": " We sang the song this morning since I have been redeemed."
    },
    {
      "id": 5,
      "start": 2415.3400173187256,
      "end": 2420.3800163269043,
      "text": " I have dual citizenship, American, but heaven is my home."
    },
    {
      "id": 6,
      "start": 2420.3800163269043,
      "end": 2424.6000175476074,
      "text": " The songwriter said, this road is not my home, I'm just a passing through."
    },
    {
      "id": 7,
      "start": 2424.6000175476074,
      "end": 2428.220016479492,
      "text": " And oh, how we can relate to the songwriter."
    },
    {
      "id": 8,
      "start": 2428.220016479492,
      "end": 2434.2600173950195,
      "text": " And as the people of God, just as the warning is given in Deuteronomy chapter number 6,"
    },
    {
      "id": 9,
      "start": 2434.2600173950195,
      "end": 2439.6600189208984,
      "text": " when you're entered into the land that I've promised to give you, when I bring you into"
    },
    {
      "id": 10,
      "start": 2439.6600189208984,
      "end": 2445.220016479492,
      "text": " that land, God did it, God worked, God proved His power and He brought the children of Israel"
    },
    {
      "id": 11,
      "start": 2445.220016479492,
      "end": 2446.300018310547,
      "text": " into the land."
    },
    {
      "id": 12,
      "start": 2446.300018310547,
      "end": 2451.460018157959,
      "text": " And Moses says, beware lest thou forget the Lord."
    },
    {
      "id": 13,
      "start": 2451.460018157959,
      "end": 2456.0400161743164,
      "text": " So there were some things that the children of Israel were instructed to do to establish"
    },
    {
      "id": 14,
      "start": 2456.0400161743164,
      "end": 2462.400016784668,
      "text": " memorials so that they would not forget what God did for them."
    },
    {
      "id": 15,
      "start": 2462.400016784668,
      "end": 2465.840015411377,
      "text": " We find that Peter says, I'll put you in remembrance of some things."
    },
    {
      "id": 16,
      "start": 2465.840015411377,
      "end": 2470.200019836426,
      "text": " I want you to be mindful of some things."
    },
    {
      "id": 17,
      "start": 2470.200019836426,
      "end": 2475.720016479492,
      "text": " We understand the Lord's given us the truth as New Testament believers of baptism and"
    },
    {
      "id": 18,
      "start": 2475.720016479492,
      "end": 2476.720016479492,
      "text": " the Lord's Supper."
    },
    {
      "id": 19,
      "start": 2476.720016479492,
      "end": 2481.4800186157227,
      "text": " In fact, the table that is before me says, this do in remembrance of me."
    },
    {
      "id": 20,
      "start": 2481.4800186157227,
      "end": 2486.4800186157227,
      "text": " You can read in 1 Corinthians 11 and you can see how the Lord's table, it's a table"
    },
    {
      "id": 21,
      "start": 2486.4800186157227,
      "end": 2487.4800186157227,
      "text": " of remembrance."
    },
    {
      "id": 22,
      "start": 2487.4800186157227,
      "end": 2492.7600173950195,
      "text": " It's a memorial to be mindful of what the Lord Jesus Christ did for me to remember what"
    },
    {
      "id": 23,
      "start": 2492.7600173950195,
      "end": 2494.7600173950195,
      "text": " my salvation cost."
    },
    {
      "id": 24,
      "start": 2494.7600173950195,
      "end": 2498.0400161743164,
      "text": " It was free to me, but Jesus died."
    },
    {
      "id": 25,
      "start": 2498.0400161743164,
      "end": 2504.620018005371,
      "text": " Yes, He was buried and He rose in victory and how we rejoice in that truth."
    },
    {
      "id": 26,
      "start": 2504.620018005371,
      "end": 2510.8800201416016,
      "text": " But this morning, as the people of God living in a day of confusion and chaos, and there"
    },
    {
      "id": 27,
      "start": 2510.8800201416016,
      "end": 2517.720016479492,
      "text": " are people that are discouraged and confused, I want you to remember that the Lord's still"
    },
    {
      "id": 28,
      "start": 2517.720016479492,
      "end": 2518.720016479492,
      "text": " on His throne."
    },
    {
      "id": 29,
      "start": 2518.720016479492,
      "end": 2522.240020751953,
      "text": " I want you to remember that the Lord's still building His church."
    },
    {
      "id": 30,
      "start": 2522.240020751953,
      "end": 2526.200019836426,
      "text": " I want you to remember the Lord's still saving sinners."
    },
    {
      "id": 31,
      "start": 2526.200019836426,
      "end": 2531.000015258789,
      "text": " And I want you to remember that the Lord is coming again."
    },
    {
      "id": 32,
      "start": 2531.000015258789,
      "end": 2535.280014038086,
      "text": " And we remember those things and I, as I admitted in the beginning of the message, there's 50"
    },
    {
      "id": 33,
      "start": 2535.280014038086,
      "end": 2538.0800170898438,
      "text": " other things that we could speak about that we need to remember."
    },
    {
      "id": 34,
      "start": 2538.8800201416016,
      "end": 2539.8800201416016,
      "text": " Remember those four things."
    },
    {
      "id": 35,
      "start": 2539.8800201416016,
      "end": 2542.4000244140625,
      "text": " I believe it'll help us."
    },
    {
      "id": 36,
      "start": 2542.4000244140625,
      "end": 2545.560012817383,
      "text": " It'll help us in a time of chaos and confusion."
    },
    {
      "id": 37,
      "start": 2545.560012817383,
      "end": 2547.720016479492,
      "text": " Remember, Father, we love You."
    },
    {
      "id": 38,
      "start": 2547.720016479492,
      "end": 2549.820022583008,
      "text": " We thank You for loving us."
    },
    {
      "id": 39,
      "start": 2549.820022583008,
      "end": 2554.1600189208984,
      "text": " We thank You for Your Word."
    },
    {
      "id": 40,
      "start": 2554.1600189208984,
      "end": 2561.800018310547,
      "text": " How we rejoice that You have given us this precious Bible."
    },
    {
      "id": 41,
      "start": 2561.800018310547,
      "end": 2565.280014038086,
      "text": " The truth that is contained therein is profitable, is life-changing."
    },
    {
      "id": 42,
      "start": 2565.280014038086,
      "end": 2581.720016479492,
      "text": " And Lord, I pray that as we have reviewed these four items today, I've sought to stir"
    },
    {
      "id": 43,
      "start": 2581.720016479492,
      "end": 2586.8800201416016,
      "text": " us up by putting us in remembrance."
    },
    {
      "id": 44,
      "start": 2586.8800201416016,
      "end": 2592.9600219726562,
      "text": " I'm so thankful that You're sitting upon Your throne, that You are the Lord God omnipotent,"
    },
    {
      "id": 45,
      "start": 2592.9600219726562,
      "end": 2599.6000213623047,
      "text": " that You reign, that You are King of kings and Lord of lords, the great I Am."
    },
    {
      "id": 46,
      "start": 2599.6000213623047,
      "end": 2602.6800231933594,
      "text": " How we rejoice in that."
    },
    {
      "id": 47,
      "start": 2602.6800231933594,
      "end": 2604.8400115966797,
      "text": " We thank You that You're still building Your church."
    },
    {
      "id": 48,
      "start": 2604.8400115966797,
      "end": 2608.4000244140625,
      "text": " It's Your church, not my church, not our church."
    },
    {
      "id": 49,
      "start": 2608.4000244140625,
      "end": 2610.480010986328,
      "text": " I'm thankful to belong to the local church."
    },
    {
      "id": 50,
      "start": 2610.480010986328,
      "end": 2612.560012817383,
      "text": " I'm thankful to be part of the local church."
    },
    {
      "id": 51,
      "start": 2612.560012817383,
      "end": 2616.240020751953,
      "text": " I'm thankful for the privilege of being the under-shepherd of this local church."
    },
    {
      "id": 52,
      "start": 2616.240020751953,
      "end": 2619.6800231933594,
      "text": " God, we know that You're the head."
    },
    {
      "id": 53,
      "start": 2619.6800231933594,
      "end": 2624.4000244140625,
      "text": " We believe the promise that You gave there in Matthew, I will build my church and the"
    },
    {
      "id": 54,
      "start": 2624.4000244140625,
      "end": 2628.4000244140625,
      "text": " gates of hell shall not prevail against it."
    },
    {
      "id": 55,
      "start": 2628.4000244140625,
      "end": 2632.240020751953,
      "text": " Oh, how we rejoice that You're still saving sinners."
    },
    {
      "id": 56,
      "start": 2632.240020751953,
      "end": 2636.0800170898438,
      "text": " The gospel's powerful."
    },
    {
      "id": 57,
      "start": 2636.0800170898438,
      "end": 2641.1200103759766,
      "text": " What a joy to know that the truth, for whosoever shall call upon the name of the Lord shall"
    },
    {
      "id": 58,
      "start": 2641.1200103759766,
      "end": 2646.1200103759766,
      "text": " be saved, is still in operation today."
    },
    {
      "id": 59,
      "start": 2646.1200103759766,
      "end": 2650.1200103759766,
      "text": " If there's one that's tuned in that's not sure of heaven, God, we pray that today is"
    },
    {
      "id": 60,
      "start": 2650.1200103759766,
      "end": 2652.3800201416016,
      "text": " the day of salvation."
    },
    {
      "id": 61,
      "start": 2652.3800201416016,
      "end": 2655.6400146484375,
      "text": " They would not allow for another moment to pass by before they place their faith and"
    },
    {
      "id": 62,
      "start": 2655.6400146484375,
      "end": 2658.8800048828125,
      "text": " trust in the finished work of Christ at Calvary."
    },
    {
      "id": 63,
      "start": 2658.8800048828125,
      "end": 2663.3600158691406,
      "text": " Understanding that their works, their good works, cannot get them to heaven, not by works"
    },
    {
      "id": 64,
      "start": 2663.3600158691406,
      "end": 2669.6400146484375,
      "text": " of righteousness which we have done, but according to His mercy hath He begotten us."
    },
    {
      "id": 65,
      "start": 2669.6400146484375,
      "end": 2672.6400146484375,
      "text": " For by grace are you saved through faith, and that not of yourselves, it is the gift"
    },
    {
      "id": 66,
      "start": 2672.6400146484375,
      "end": 2675.9600219726562,
      "text": " of God, not of works, lest any man should boast."
    },
    {
      "id": 67,
      "start": 2675.9600219726562,
      "end": 2679.6400146484375,
      "text": " Our salvation is not based upon our works, it's not based upon our church membership,"
    },
    {
      "id": 68,
      "start": 2679.6400146484375,
      "end": 2685.7200317382812,
      "text": " our baptism, any other thing."
    },
    {
      "id": 69,
      "start": 2685.7200317382812,
      "end": 2690.9200134277344,
      "text": " We're saved if we trust the Lord Jesus Christ as our personal Savior, receive the gift of"
    },
    {
      "id": 70,
      "start": 2690.9200134277344,
      "end": 2698.1200256347656,
      "text": " God which is eternal life through the death, burial, and resurrection of our Savior."
    },
    {
      "id": 71,
      "start": 2698.1200256347656,
      "end": 2703.3600158691406,
      "text": " We thank You that You're still saving sinners, and then how we rejoice that You're still"
    },
    {
      "id": 72,
      "start": 2703.3600158691406,
      "end": 2706.000030517578,
      "text": " coming again."
    },
    {
      "id": 73,
      "start": 2706.000030517578,
      "end": 2711.4400024414062,
      "text": " We readily admit we do not know the day nor hour, but we believe the promises that You've"
    },
    {
      "id": 74,
      "start": 2711.4400024414062,
      "end": 2717.480010986328,
      "text": " given us in Your Word, I will come again."
    },
    {
      "id": 75,
      "start": 2717.480010986328,
      "end": 2721.7200317382812,
      "text": " That He that shall come will come, and will not tarry."
    },
    {
      "id": 76,
      "start": 2721.7200317382812,
      "end": 2726.560028076172,
      "text": " God, I pray that You'd help us to redeem the time that we'd be busy about the Master's"
    },
    {
      "id": 77,
      "start": 2726.560028076172,
      "end": 2735.1200256347656,
      "text": " work, that we'd have that same level of urgency that we read of in the book of Acts, because"
    },
    {
      "id": 78,
      "start": 2735.1200256347656,
      "end": 2737.9200134277344,
      "text": " we believe You're coming, and it could be at any moment."
    },
    {
      "id": 79,
      "start": 2737.9200134277344,
      "end": 2742.52001953125,
      "text": " Lord, as we remember these things this morning, I pray that our hearts have been encouraged"
    },
    {
      "id": 80,
      "start": 2742.52001953125,
      "end": 2744.4000244140625,
      "text": " and strengthened."
    },
    {
      "id": 81,
      "start": 2744.4000244140625,
      "end": 2751.4400024414062,
      "text": " I pray that You'd give us a joy and a peace at the remembrance of these things."
    },
    {
      "id": 82,
      "start": 2751.4400024414062,
      "end": 2755.560028076172,
      "text": " We pray that You'd work in the time of invitation, that You alone would be glorified, that decisions"
    },
    {
      "id": 83,
      "start": 2755.560028076172,
      "end": 2761.480010986328,
      "text": " would be made here, would be made at the homes of those that have tuned in to watch"
    },
    {
      "id": 84,
      "start": 2761.480010986328,
      "end": 2762.480010986328,
      "text": " this broadcast."
    },
    {
      "id": 85,
      "start": 2762.480010986328,
      "end": 2768.760009765625,
      "text": " Lord, that You would work in our hearts and lives, and that You alone would be glorified."
    },
    {
      "id": 86,
      "start": 2768.760009765625,
      "end": 2772.3200073242188,
      "text": " We'll thank You for it, in Christ's name we pray, amen."
    },
    {
      "id": 87,
      "start": 2772.3200073242188,
      "end": 2776.6400146484375,
      "text": " Kimberly's going to play quietly on the piano, and as she does, hear the altars."
    }
  ],
  "processed_at": "2025-04-17T19:55:31.404143"
}