{
  "video_id": "LFE-u6qoIJg",
  "text": "Getting back here this evening to our Ask the Pastor series in Matthew chapter 7, we'll be looking at verses 1 through 5, and then we'll be looking over in the book of 1 Corinthians as well this evening. But here in Matthew chapter 7, we'll be looking at these first five verses. If you have a bulletin today, you see that the title for the message comes from verse number 1, really the entirety of verse number 1, Judge not that ye be not judged. The question submitted is in reference, the way that the question was worded is this, it's in reference to misquoted or misunderstood Bible verses, and they provide a few examples on that particular question. And this is one of the questions, the first, or one of the verses, the first of the examples that was listed on the particular question that was submitted was Matthew 7, 1, and we'll examine this portion of Scripture this evening. Before we dive into the passage of Scripture, there's some things that I think are important for us to remember and to be aware of when we think about our approach to the Word of God as we read the Bible, as we study the Bible, we must take great care to properly interpret and apply the Bible. And we understand that no prophecy is of any private interpretation. We read that in the New Testament. We understand that we're to compare Scripture with Scripture. Someone said this, that the best commentary on the Bible is the Bible. Many times people will talk about and use commentaries, and I'm not suggesting that it's an evil thing to use commentaries, but really commentaries are what man's thoughts are on the Word of God. And there's some commentaries that are beneficial, that are helpful, that you can have as a resource, but I would always encourage, and I try to follow this pattern in my own life, is to study the Scriptures, and study the Scriptures, and study the Scriptures, and if you might go to a commentary at some point, it's not the first thing you do, let me read what this person said and then let me go back to the Bible. It's to search the Scriptures, to interpret, comparing Scripture with Scripture. And so let me just give you a few thoughts with regard to the importance of taking and properly interpreting and applying the Bible. Number one is this, context is critical. Context is critical. So often where error creeps in is when text of Scripture is taken out of its context. And we take and we talk about preaching, we talk about topical preaching, exegetical preaching, and expository preaching, and taking and using a context. Typically I preach exegetical, expository type of messages, that's my style of preaching. But to isogaze is to take a verse and to take it out of context, and it's a problem. I mentioned already, but the second thought is to interpret Scripture with Scripture. And then the third thought is this, that we must resist the temptation to over-spiritualize what the Bible says. There are people that try to over-spiritualize to read things into the Bible that aren't really there in the Bible, and so those are some important things. Someone said this, in fact I was chatting with Brianna about this just a few weeks ago, I think after one of the teen classes, Brother Jeff had mentioned something to this effect. But someone said this, if the plain sense makes common sense, then seek no other sense lest it become nonsense. And there's a lot of, it's kind of a word salad if you will, but it's an idea of understanding the importance of keeping things within the context. So as we look at this particular question, it is important that we take Matthew 7-1 within the context in what it's given. Notice what the Bible says here in Matthew 7. Judge not that ye be not judged. For with what judgment ye judge, ye shall be judged. And with what measure ye meet, it shall be measured to you again. And why beholdest thou the mote that is in thy brother's eye, but considerest not the beam that is in thine own eye? Or how wilt thou say to thy brother, let me pull out the mote out of thine eye, and behold a beam is in thine own eye? Thou hypocrite, first cast out the beam out of thine own eye, and then shalt thou see clearly to cast out the mote out of thy brother's eye. As we begin to look at this passage of Scripture and look at this subject matter this evening, a couple of thoughts for you from the passage and then we'll go over to 1 Corinthians and look at a few things. But number one, if you're taking notes, I believe that we see here a common susceptibility is exposed. A common susceptibility exposed. It is common for individuals to examine and criticize the behavior of others. It is common for people to examine and try to correct the behavior of others while they're examining, criticizing, and seeking to correct the behavior of someone else, all the while they're ignoring their own behavior. And that's common. And it's something that is exposed in our passage of Scripture and we find that as we often hear people running around and quoting verse number one of Matthew 7, in fact oftentimes not even quoting the entirety of it, but just running around saying, judge not, judge not, judge not, and that's what they went around and say. But the reality is that as we look at this passage of Scripture, we find that the Lord is exposing this human nature that is common for so many of us. I've mentioned as we've studied through the book of 1 John on Sunday mornings this year, how as you go through and you look at the tests that are provided in the book of 1 John, you've referred to some of them as being a litmus test, and you find that those tests are really to be self-prescribed tests. It's not necessarily that God is giving us this information so that we can apply it to others, though we can, but the main emphasis is that we would apply it in our own lives and we'd examine ourselves when we observe the Lord's Supper. The Bible says, but let a man examine himself. Not necessarily beginning with let a man examine the others sitting in the pew or the people that they're passing the cup or the bread to, no, let a man examine himself. And so we find here that it is a common human nature trait for us to seek to examine, criticize, and correct the behavior of others while at the same time ignoring our own behavior. And this common nature is going to be exposed in this passage of Scripture, and I believe that the Lord beautifully illustrates this truth in verses three, four, and five. Notice what he says. We find that in verse number one he says, judge not that ye be not judged, and then he says this, and we'll get to verse number two in just a few minutes with regard to, with what judgment ye judge ye shall be judged, but notice the way in which the Lord Jesus Christ beautifully illustrates this common susceptibility that is now going to be exposed, this human nature, this behavior that is so common being exposed. He gives this beautiful illustration beginning in verse number three, and he says this, and why beholdest thou the mote that is in thy brother's eye? Right? That's what we do. That's the human nature is to notice something in somebody else's life, to look at someone, why? Because I don't want to examine myself. It's much more challenging, it's just a difficulty when I'm examining myself versus examining someone else, but the reality is that here he's saying, listen, you're going through this process here, and he says, why beholdest thou the mote that is in thy brother's eye? But then he says this, but considerest not the beam that is in thine own eye. The words that are used are very important to understand. The word mote and the word beam are used in verse number three. We find again that he refers to it in verse number four, and then we find again that he refers to it in verse number five. So it's obviously important that we understand the difference between mote and beam and this exposure that is taking place by the Lord Jesus Christ. By the way, when you begin to think about the Pharisees and the Sadducees that Jesus so often was addressing and dealing with, though that's not the main audience of this text of Scripture, you would find that the Pharisees and Sadducees were individuals that were constantly judging others, but don't look at my life. That's really the way they behaved. And we find here this evening that when Jesus uses the word mote, he's speaking about, the word literally refers to a piece of straw or a fleck of debris, really a speck, a piece of sawdust, so to speak. That's what a mote is. A beam, on the other hand, is a timber that would be used for construction. Now when you begin to see the illustration that Jesus is painting here and the truth in which he's giving, he's saying, listen, judge not that ye be not judged. He then talks about how that they would be judged with the same, for with what judgment ye judge, ye shall be judged, but then he says, why do you hold us now of the mote, this speck, this piece of sawdust that is in your brother's eye, but you don't consider the construction timber that is in your own eye. Isn't that amazing? And so we find that as the Lord is exposing this human element, this nature of our human behavior to try to examine and to correct and criticize the behavior of others while ignoring our own behavior, the Lord's saying, listen, you have a beam. in your eye and you're concerned about the moat in your brother's eye. If you're gonna think about the difference between a moat and a beam, it's significant. It is a substantial difference between these two words that the Lord would use, and we know, as I said this morning and we've said often over the years, that every word of God is pure. Jesus picks his words purposefully, amen? And we find that as he chooses these words, he's exposing the hypocrisy. He's going to mention that in just a moment. Notice what he says in verse number four, or how wilt thou say to thy brother, let me pull out the moat out of thine eye, and behold a beam is in thine own eye. Now think about what he's saying. I mean physically, if we think about just our eyesight and looking at the example that he's using, this illustration that is given, there's no way that I can help get this fleck, this piece of sawdust, out of your eye if I have a timber in my eye. He said that's what you're doing, so you need to understand what he's exposing here, and then he says this in verse number five, thou hypocrite. The hypocrisy is being exposed, and then notice what he says. Notice first and then. It's very important to understand what's taking place in this passage of Scripture because Jesus says, thou hypocrite. What caused them to be a hypocrite? Well, they're worrying about somebody else's behavior while they're ignoring their own behavior. That's what would lead them to this area of hypocrisy, and Jesus says, first, cast out the beam out of thine own eye. So first matter of business is let a man examine himself, right? Let me deal with the beam that is in mine own eye. Let me deal with that. Let me address that, and honestly, if we really start understanding the truth of God's Word and begin to walk in the light as he is in the light, begin to have fellowship with him and seeking to walk in the Spirit so that we do not fulfill the lust of the flesh, we'll find that examining our own selves is almost a full-time job. I'm not gonna have as much time to try to examine other people, amen? But so long as I'm ignoring the beam in my eye and I'm running around trying to find all the moats in other people's eyes, then I'm just going to be a perfect examiner of someone else while I'm just not even worried about my own life. And that's not biblical. That's not what God tells us. So he says, first, the first order of business, the primary concern as we begin to understand what's taking place here is that the first thing that you need to do is cast out the beam out of thine own eye. By the way, I am so thankful that God in his power will enable us to identify and to deal with the beams in our lives. Aren't you? That when the Lord uses his Word in your life and in my life to expose something in our lives that doesn't belong, something that needs to change, we ought to thank God for that. We ought to thank God that he loves us enough, that he desires that fellowship with us enough, that he exposes it to us, and then that he's gracious to forgive us and to restore us. And that ought to cause us to rejoice greatly. And so even when he says, first, cast out the beam out of thine own eye, we can begin to think about the forgiveness and the restoration that God offers. And I'm thankful that the Bible says, with thee, with the Lord, there is forgiveness. Throughout the Old Testament you find that the prophets of God would refer to the Lord in speaking about his forgiveness that he's a God who is ready to pardon. He's a God who is ready to forgive. If we confess our sins, he is faithful and just to forgive us of our sins and to cleanse us from all unrighteousness. I'm thankful that our God is able to restore us to fellowship with him. Amen? What a joy. So he says, first matter of business is to deal with that beam that's in your eye. And then notice what he says, and then, and then. So that's subsequent, right? We understand the language is being used here, so first I deal with the beam in my eye, but then he says, and then shalt thou see clearly to cast the moat out of thy brother's eye. So now all of a sudden God will allow us, with that right spirit, after we've examined ourselves, he will use us to help others. Because there are some others that do need help. Amen? They need some guidance, they need some leadership. The Bible, often as we study the Word of God, we see about those that are overtaken in a fault. Let me just read to you what the Bible says. You don't need to turn there, but in Galatians chapter number 6, the Bible says, brethren, if a man be overtaken in a fault, ye which are spiritual, restore such in one in the spirit of meekness, considering thyself, lest thou also be tempted. It's not a situation where those that are there, referred to in verse number 6, that there's just a matter of judgment and casting out, and what have you. No, he says that ye which are spiritual, restore such in one, and he says in the spirit of meekness. I'm so thankful that two pillars of biblical Christianity are forgiveness and restoration. My dad was teaching last summer, this past summer, on Psalm 23, and what a great study it was through the 23rd Psalm. He took almost the entire summer until he had back surgery, and then had to kind of wait for that last lesson, but he restoreth my soul. That was a great lesson that he delivered to us from the Word of God on that truth of restoration. And we find here that God will use us, and we find this order that's provided. We do not find that he says that as he's exposing this human nature, he's giving this important truth with regard to examining our own behavior. Now, so we see that there's a common susceptibility that is exposed, but then I would say this, as we look at this passage of Scripture, number two, a consistent standard is essential. A consistent standard is essential. Pastor, what do you mean by that? Well, notice what it says in verse number two. In verse number two, the Bible says this, for with what judgment ye judge, ye shall be judged. And with what measure ye meet, it shall be measured to you again. See, we mentioned already, as he says in verse number five, thou hypocrite, the danger of hypocrisy that is here, and we find that we are to use the same standard to judge all things. There's not a standard for me and a different standard for you. So we find that a consistent standard is essential. It is absolutely imperative that we have a consistent standard when we deal with this subject matter of judgment. And what is that consistent standard? The Word of God. It's the Word of God. And we begin to take the Word of God, and we can find that we are able to judge all things as we're using the consistent standard, and we're understanding the importance of having the Word of God as that standard for judgment. Does that make sense this evening? And so it's not going to be a situation where I'm saying, well, you know, you've ever heard the situation, this is for the, but not for me. These are rules for you, but they don't apply to me. That's terrible. I said this to Breonna last night. Breonna Joseph and I, Holly was there, we were talking, and I said this, that rules without relationship breeds rebellion. And it really does. Rules without relationship will breed rebellion. But the reality is that when we go to the Word of God and we understand that we have a relationship with the God of the universe, that we serve the King of kings and Lord of lords, and He's given us a word that we're to follow, and we're to obey, and we're to take and apply the truth in our lives, there's no rebellion. His commandments are not grievous. Why? Because we understand that He loves me, and I love Him, and I want to please Him. And we find that it's absolutely imperative when we deal with this subject matter of judgment that there's this consistent standard that is absolutely essential, and that standard is the Word of God. The motive is to be pure. We find that in verse number five, as we've noticed already, where he talks about thou hypocrite, first cast out the beam out of thine own eye, and then shalt thou see clearly to cast out the mote out of thy brother's eye. What do I mean by the motive being pure? So often when you think about people that would use this terminology of judge not, and they begin to deal with that situation, typically the person that is doing the judgment is in a position of condemning and not seeking to restore. And it's not really a pure motive. What is the purpose? What is the the motive behind the judgment? There needs to be this pure motive if we are going to take and examine our own lives, and we're going to use the Scriptures the way that we're supposed to in my life, and in your life personally, and say, Lord search me, and try me, and show me, and reveal to me, and help me to walk in a way that's pleasing to you, then God will allow us to be used in the lives of others to help to expose error, to help them, why? Because we want to see them restored. We want to see them have that fellowship with God. At times, and unfortunately, we're probably guilty of it more than we'd like to admit, judgment can come from a heart of condemning, condemnation, and trying to hurt someone that's already dealing with great difficulty. And we're called by the Lord to help restore. Someone said this to me years ago, Christians are the only ones that will shoot their wounded. I thought, man, that's terrible to have that connotation with regard to believers. Why? Because as believers, listen, I understand that for by the grace of God, amen, and we rejoice and we thank God for the truth that he's given us. And so we find here that in this passage of Scripture, when we deal with this subject matter of judge not that ye be not judged, that we find within the context that a common susceptibility is exposed, and it's also revealed to us here that a consistent standard is essential. Now, as we would leave this passage of Scripture, I want you to consider with me the instruction that Paul gives to the church in Corinth. Turn to the book of 1 Corinthians chapter 5, if you will, and I'll use great discretion here in chapter 5, I'd encourage you to, the adults, to be able to, perhaps you already know what's going on here in 1 Corinthians 5, but we'll look at some things and I'll use great discretion because of the children and what have you, and then we'll jump into the 6th chapter and deal with some things here. But I want you to understand here what's going on, and I want you to understand this instruction that Paul gives. Now, understand the church in Corinth is a carnal church. The church in Corinth is a church that has many difficulties. There's divisions and contentions and all sorts of things going on. We find that Paul begins the 3rd chapter by telling them that I could not speak unto you as unto spiritual, but as unto carnal, even as unto babes in Christ. And they're carnal. He says that in verse number 3, for ye are yet carnal. And we find that as we come to the 5th chapter, that wickedness in the church is going to be exposed. And notice what the Bible says in verse number 1 of 1 Corinthians 5, it is reported commonly that there is fornication among you. Now, just think about the wording there, it's reported commonly. This was a known thing that was going on in the church in Corinth. This was not some secret thing. This was not something that just a couple, it was a common thing. It was something that was out in the open. It was wickedness. The Bible says that it's such fornication as is not so much as named among the Gentiles. Now, think about that as he would use as God is exposing this wickedness here. He's saying the situation in Corinth is so bad, the situation is so egregious that it's not even something that's named among the Gentiles. He says this in verse number 2, and ye are puffed up and have not rather mourned that he that hath done this deed might be taken away from among you. And notice what Paul says in verse number 3, for I verily as absent in body, now pause with me just for a moment, Paul's not even there. Paul was used of the Lord to minister to the church in Corinth, to see the church in Corinth established. We find that Paul was used during the missionary journey to have a great work established in the city of Corinth, and this church is established, this church is moving forward. He still has a level of influence in the believers there in Corinth, and God would use him to write this and the second letter of Corinthians that go to this church to provide them with instruction, but he's not even there in body, but notice what he says, but present in spirit, and then notice these words, have judged already. Did Paul never read Matthew 7? Judge not! Paul must not have read Matthew 7. No, Paul did read Matthew 7, he was aware of it, but he says, I've judged already. Well, how did he make judgment? Well, there was a consistent standard that was essential. Paul's using the Word of God, and Paul's saying this behavior is wicked. This behavior goes against the Word of God, and it's not hard for me to make judgment concerning this matter, because it's a violation to this standard. Does that make sense? And so, Paul says, it's not inappropriate for me to make judgment, it's not wrong, I've already judged. You guys are there, and you're puffed up, and you're not mourning that he that done this deed might be taken away, and we understand that as you go to 2 Corinthians, it seems as if as you read the two letters together, that this man, this individual that was in this sin, that there was repentance, and Paul encourages them to forgive him and to restore him. That's the biblical motto, by the way. Amen? There is restoration. Why? Because there is forgiveness. I'm so thankful that God is long-suffering. God is gracious. I'm thankful that Jonah had a second chance. Amen? How many chances have we had? How many times has God been long-suffering to us? See, sometimes in our lives, we enjoy and appreciate when God is long-suffering to us, but not when He's long-suffering to somebody else. Oh, God, judge them. You understand what I'm saying, right? And notice Paul says, I've judged already, as though I were present concerning him that hath so done this deed. Paul says, church, you need to judge this matter. There was a responsibility that they had with regard to this wicked behavior that was commonly known among them. Paul says, hey, what is wrong with you guys? I'm not even there in person, but I'm already given judgment. Because it's obvious that this is a violation to the standard of the Word of God. So we find Paul's own behavior, his own practice, that is mentioned with regard to this subject matter of judgment. Now I want you to move into chapter number six, and I want you to notice what's taking place. And really, the problem in the first several verses of 1 Corinthians chapter number six that Paul is going to address is believers taking believers to court, and that before unbelievers. The litigation amongst believers before unbelievers is what he's addressing. And notice what he says, and I'm going to read the first five verses, and then we're going to go back and we're going to point out various statements that are made with regard to the subject matter of judgment that we're dealing with this evening. Notice in verse number one, dare any of you, having a matter against another, go to law before the unjust and not before the saints? Do ye not know that the saints shall judge the world? And if the world shall be judged by you, are ye unworthy to judge the smallest matters? Know ye not that we shall judge angels? How much more things that pertain to this life? If then ye have judgments of things pertaining to this life, set them to judge who are least esteemed in the church. I speak to your shame. Is it so that there is not a wise man among you? No, not one that shall be able to judge between his brother, between his brethren. But brother goeth to law with brother, and that before the unbelievers. Now therefore there is utterly a fault among you, because ye go to law one with another. Why do you not rather take wrong? Why do you not rather suffer yourselves to be defrauded? Nay, ye do wrong and defraud, and that your brethren.\" Wow. Inspiration of the Holy Spirit of God to a local church dealing with the subject matter of judgment. And notice what he says, I know I read all eight verses but I want to go back and I want you to see and really break it down in the context of this subject matter of judgment. Notice what Paul says in verse number one, dare any of you having a matter against another go to law before the unjust and not before the saints. So what's he saying? There's a problem. There's some kind of an issue between people in the church. And so Armando has a problem with Ron and they can't sort this thing out and so they're going to take one another to court and they're going to go before the unbelievers. Paul says, are you kidding me? I mean it's not there in the English, it's somewhere in the Greek, amen, I'm just teasing. But it's not there. But notice what he says, I mean if you read this text of scripture it's almost like Paul is saying, are you guys kidding me? This is really what you're doing? And so no, he says listen, you're going before the unjust and not before the saints? Oh wait, this is a different approach. This is a different understanding. So we're supposed to bring this matter before the saints so that the saints can do what? Judge. What happened to Matthew 7.1? Is there a contradiction? No, there's no contradiction at all. He says judge not that ye be not judged and he says this, you're judging this common susceptibility. You're judging, it's exposed, you're judging others but you're not judging yourself. You're worried about some little speck in somebody's eye and you're not concerned about the beam that's in your own eye and you're a hypocrite. You're not using a consistent standard, it's exposed. But then as you study the whole of scripture, God is saying listen, the believers are to judge. But how do you judge? What do they judge? They judge with a proper standard, it's essential. And they judge righteous judgment, and the purpose, the goal, is restoration. That's the goal. So we find in verse number two, he says this, notice what he says, Do ye not know that the saints shall judge the world? You're unaware of this, the saints are going to judge the world. He's really referring to Revelation, and we can read that in Revelation 20. But he says this, and if the world shall be judged by you, are ye unworthy to judge the smallest matters? So do you not know, you're not yet been informed, you're not aware of the fact, or at least you're not considering it within the context of what's going on, that you're going to judge the world. And if you're going to judge the world, do you mean to tell me that you're unworthy to judge the smallest matters? This is blowing Paul's mind. He says in verse number three, Know ye not that we shall judge angels? Wow. Not only the world, but then the angels. And it says this in verse number three, How much more things that pertain to this life? These matters that Paul is talking about, he's saying, listen, if we're going to judge the world and we're going to judge angels, how much more things that pertain to this life? Now again, keeping it all within context and interpreting Scripture with Scripture, it's not running around that we're the Baptist police judging everybody and hitting everybody upside the head with a club and saying, you didn't do this and you didn't do that. And you have this. No, no, no. I'm first using the Bible in my own life. And by the way, if we'd all do that, it'd be a whole lot better. Amen. Honestly, maybe a whole lot better. But for those that don't, God says, listen, within the household of God, within the believers, we're to judge these matters. Notice what he says in verse number four, If then ye have judgments of things pertaining to this life, set them to judge who are least esteemed in the church. And then he says this in verse number five, I speak to your shame. Wow. You know, those are powerful words. Paul says, as we would read in 1 Corinthians 11, as you would enter into the passage of Scripture that we typically use for the Lord's Supper, on two occasions in verse 17 and verse number 22, he says, I praise you not, because of their behavior. They were doing things in an inappropriate way. He says, I praise you not. Here he says this, I speak to your shame. Now, if someone says that to you, it doesn't cause you to feel real good about yourself. I speak to your shame. Notice what he's referring to. Notice in verse number five, Is it so that there is not a wise man among you? No, not one that shall be able to judge between his brethren. Do you see what I mean when I say that it's as if Paul's mind is being blown? He's like, seriously, there's no one that can judge between these matters? That believers are taking the matter before unbelievers? Paul says, I speak this to your shame. Again, he's not offering them some level of commendation. He's saying, I'm speaking to your shame. This is unfortunate that in a local church there in Corinth, that there was not a wise man among them that could judge between the brethren. But instead, what was happening was brother was going to law with brother and that before the unbelievers. Can you imagine how messy that is and how terrible that is for the name of Christ and for the cause of Christ? Believers that are to be understanding of the importance of forgiveness and restoration and so on and so forth, they're standing before lost people who were supposed to reach with the gospel, by the way, and they're attacking each other on whatever the matter is and why they're right and they're wrong and vice versa. Can you see the picture in your mind's eye? You understand what's taking place? Haven't you been in a court? I know some of you are in court often. Not because you're, that's not a bad man. Because you're lawyers, because you're police officers, okay? Listen to the whole statement. Somebody's going to take that little excerpt from the online YouTube and they're going to just, man, it's going to be a mess. I'm just teasing. But we're familiar, right? Courtrooms typically are not pleasant places. It's ugly, right? Attacking. Notice what Paul says. Now therefore, verse 7, there is utterly a fault among you. He said, I speak to your shame. Now he says there is utterly a fault among you. Why? Because you go to law one with another. And then he says this. He gives them a different perspective. Why do you not rather take wrong? Why do you not rather suffer yourselves to be defrauded? Nay you do wrong and defraud and that your brethren, and obviously it's a perspective there in verses 7 and 8 that's really outside of the discussion this evening with regard to judgment, but taking the wrong and being defrauded for the sake of really the gospel and unity and what have you. But I want you to really focus on the first six verses of 1 Corinthians chapter number 6. And as we take what Paul says in the fifth chapter about the matter, the problem that's being exposed and explained in Corinth, and then Paul says, I've already judged. I'm not even there in person, physically, but I've heard about what's going on and I've already given judgment. Why? Because we have the standard of the Word of God. He then deals with the problem in Corinth where they're going to court one against another, brethren, amongst unbelievers, and he says, there's not a wise man among you that can judge between us. You're going to judge the world? You're going to judge angels and you can't judge these small matters? And so begin to think about the subject matter of judgment. I would say this in conclusion, we need to be careful about how we judge. Because he says, judge not that ye be not judged, and then he continues and says, with what judgment ye judge, ye shall be judged. Amen? We must understand first, in Matthew 7 and verse number 5, that we must examine ourselves. That we must ask God to help us. That we avoid that which is exposed in those verses of Scripture and perfectly, beautifully illustrated by the Lord Jesus Christ, that we would avoid that common nature of humans to judge others while ignoring our own behavior. To examine and to criticize and to seek to correct someone else while all at the same time we act as if we live above it. No, no. That's not appropriate. That's not how we should behave. And if we take the time to daily examine ourselves and ask God to search us, to reveal in us the mote, the beam that's spoken of, that would take so much of our time that we won't have the time to run around and judge everybody else. But he says, then, in verse number 5 of Matthew 7, after we've done that, God may use us to help provide guidance and restoration in the life of someone else. Listen, we don't live in a perfect world. One day we will. Isn't that awesome? One day we're going to be with the Lord for all of eternity. But right now we don't live in a perfect world. And in this world that's not perfect, there's problems. And there's divisions and schisms and there's things that happen. And he says, the spiritual one is to be able to judge. Did Moses judge? He did. Jethro said, this is no good. Why? It's consuming you. So what do they do? They got other men that would be able to judge the smaller matters. Right? That's what happened in the Old Testament, right? We don't have time to go, it's 656, we don't have time to go back there and look at all of it. But you understand, that's what happened in the Old Testament. And they got these people involved, these spiritual people involved that could take the Word of God, the truth that God had given at that particular time, and say, here, this is the standard by which we judge. Right? That's what happened. And so we find that as we come to the New Testament, and Jesus says, judge not, there in Matthew chapter number 6. 7, it's not the way that people use it today running around saying, you guys can't judge me. The Bible says judge not. Read the whole context and understand the entirety of God's Word. Now if you're running around judging people and you're not letting God judge you, and you're not using this book as a standard in your life, thou hypocrite. That's what the Bible says. And so we first use God's Word to examine ourselves. God, I want to please you with my life. How do I do that? What do I do? Oh, when the Word of God is read in your daily devotions, when the Word of God is preached, when we hear it in whatever context we hear it, we sit around a table and have fellowship and maybe there's some spiritual conversation that's taking place and the Word of God is used and God pricks our heart with regard to something that needs to be dealt with in our lives, we deal with it. And we know that with Him there's forgiveness and there's restoration. We can rejoice in that. But just as there's forgiveness and restoration for me, there's forgiveness and restoration for everyone else. Isn't that awesome? And we've got to be so thankful for that. So I hope as we look at the context of Matthew 7, 1 through 5, coupled with 1 Corinthians 5 and 6, it helps us to have a better understanding of this portion of Scripture and so often what we hear people saying to us today of judge not. I'm thankful that God's given us a standard, a standard that is perfect. See you're not perfect and neither am I. How many times even in a court of law the judge rules in a certain way and you say, how did they rule that way? This book is perfect and when we use this book we can have righteous judgment. Let's pray. Father we love You. We thank You for loving us. We thank You for the truth of Your Word, for the power of Your Word. God I pray that we'd leave here this evening not with a misunderstanding that we're to go out and judge everybody. Lord help us to have a proper understanding that there's this balance and that first Lord we would come humbly before Thy throne and ask You to examine us and that we'd examine ourselves by the right standard, the Word of God. And that we'd be honest and we'd be humble before You and before Your Word. God You'd help us to deal with any sin in our lives that needs to be dealt with. Lord that You'd help us to please You that we would not be hypocrites. Lord I pray that You would use us to help others in their spiritual journey. Not in a condemning or condescending type of a way but in a way of trying to help and to provide sweet fellowship, forgiveness and restoration. Lord I pray that You'd help us to take truth from Your Word tonight that would help us in our daily behavior. We pray that in these moments of invitation that You'd have Your will in way. We pray that decisions would be made that would please Thee and we'll thank You for it in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.639999866485596,
      "text": " Getting back here this evening to our Ask the Pastor series in Matthew chapter 7, we'll"
    },
    {
      "id": 1,
      "start": 5.639999866485596,
      "end": 9.119999885559082,
      "text": " be looking at verses 1 through 5, and then we'll be looking over in the book of 1 Corinthians"
    },
    {
      "id": 2,
      "start": 9.119999885559082,
      "end": 11.239999771118164,
      "text": " as well this evening."
    },
    {
      "id": 3,
      "start": 11.239999771118164,
      "end": 15.039999961853027,
      "text": " But here in Matthew chapter 7, we'll be looking at these first five verses."
    },
    {
      "id": 4,
      "start": 15.039999961853027,
      "end": 18.18000030517578,
      "text": " If you have a bulletin today, you see that the title for the message comes from verse"
    },
    {
      "id": 5,
      "start": 18.18000030517578,
      "end": 24.079999923706055,
      "text": " number 1, really the entirety of verse number 1, Judge not that ye be not judged."
    },
    {
      "id": 6,
      "start": 24.079999923706055,
      "end": 30.31999969482422,
      "text": " The question submitted is in reference, the way that the question was worded is this,"
    },
    {
      "id": 7,
      "start": 30.31999969482422,
      "end": 37.52000045776367,
      "text": " it's in reference to misquoted or misunderstood Bible verses, and they provide a few examples"
    },
    {
      "id": 8,
      "start": 37.52000045776367,
      "end": 39.63999938964844,
      "text": " on that particular question."
    },
    {
      "id": 9,
      "start": 39.63999938964844,
      "end": 44.400001525878906,
      "text": " And this is one of the questions, the first, or one of the verses, the first of the examples"
    },
    {
      "id": 10,
      "start": 44.400001525878906,
      "end": 49.220001220703125,
      "text": " that was listed on the particular question that was submitted was Matthew 7, 1, and we'll"
    },
    {
      "id": 11,
      "start": 49.220001220703125,
      "end": 51.720001220703125,
      "text": " examine this portion of Scripture this evening."
    },
    {
      "id": 12,
      "start": 51.720001220703125,
      "end": 56.099998474121094,
      "text": " Before we dive into the passage of Scripture, there's some things that I think are important"
    },
    {
      "id": 13,
      "start": 56.099998474121094,
      "end": 61.41999816894531,
      "text": " for us to remember and to be aware of when we think about our approach to the Word of"
    },
    {
      "id": 14,
      "start": 61.41999816894531,
      "end": 67.5,
      "text": " God as we read the Bible, as we study the Bible, we must take great care to properly"
    },
    {
      "id": 15,
      "start": 67.5,
      "end": 70.86000061035156,
      "text": " interpret and apply the Bible."
    },
    {
      "id": 16,
      "start": 70.86000061035156,
      "end": 74.86000061035156,
      "text": " And we understand that no prophecy is of any private interpretation."
    },
    {
      "id": 17,
      "start": 74.86000061035156,
      "end": 77.0999984741211,
      "text": " We read that in the New Testament."
    },
    {
      "id": 18,
      "start": 77.0999984741211,
      "end": 79.9000015258789,
      "text": " We understand that we're to compare Scripture with Scripture."
    },
    {
      "id": 19,
      "start": 79.9000015258789,
      "end": 85.0999984741211,
      "text": " Someone said this, that the best commentary on the Bible is the Bible."
    },
    {
      "id": 20,
      "start": 85.0999984741211,
      "end": 89.83999633789062,
      "text": " Many times people will talk about and use commentaries, and I'm not suggesting that"
    },
    {
      "id": 21,
      "start": 89.83999633789062,
      "end": 95.80000305175781,
      "text": " it's an evil thing to use commentaries, but really commentaries are what man's thoughts"
    },
    {
      "id": 22,
      "start": 95.80000305175781,
      "end": 98.22000122070312,
      "text": " are on the Word of God."
    },
    {
      "id": 23,
      "start": 98.22000122070312,
      "end": 102.80000305175781,
      "text": " And there's some commentaries that are beneficial, that are helpful, that you can have as a resource,"
    },
    {
      "id": 24,
      "start": 102.80000305175781,
      "end": 107.63999938964844,
      "text": " but I would always encourage, and I try to follow this pattern in my own life, is to"
    },
    {
      "id": 25,
      "start": 107.63999938964844,
      "end": 111.41999816894531,
      "text": " study the Scriptures, and study the Scriptures, and study the Scriptures, and if you might"
    },
    {
      "id": 26,
      "start": 111.41999816894531,
      "end": 115.66000366210938,
      "text": " go to a commentary at some point, it's not the first thing you do, let me read what this"
    },
    {
      "id": 27,
      "start": 115.66000366210938,
      "end": 118.72000122070312,
      "text": " person said and then let me go back to the Bible."
    },
    {
      "id": 28,
      "start": 118.72000122070312,
      "end": 123.41999816894531,
      "text": " It's to search the Scriptures, to interpret, comparing Scripture with Scripture."
    },
    {
      "id": 29,
      "start": 123.41999816894531,
      "end": 128.52000427246094,
      "text": " And so let me just give you a few thoughts with regard to the importance of taking and"
    },
    {
      "id": 30,
      "start": 128.52000427246094,
      "end": 131.24000549316406,
      "text": " properly interpreting and applying the Bible."
    },
    {
      "id": 31,
      "start": 131.24000549316406,
      "end": 135.39999389648438,
      "text": " Number one is this, context is critical."
    },
    {
      "id": 32,
      "start": 135.39999389648438,
      "end": 136.39999389648438,
      "text": " Context is critical."
    },
    {
      "id": 33,
      "start": 136.39999389648438,
      "end": 145.32000732421875,
      "text": " So often where error creeps in is when text of Scripture is taken out of its context."
    },
    {
      "id": 34,
      "start": 145.32000732421875,
      "end": 153.33999633789062,
      "text": " And we take and we talk about preaching, we talk about topical preaching, exegetical preaching,"
    },
    {
      "id": 35,
      "start": 153.33999633789062,
      "end": 156.9600067138672,
      "text": " and expository preaching, and taking and using a context."
    },
    {
      "id": 36,
      "start": 156.9600067138672,
      "end": 164.0399932861328,
      "text": " Typically I preach exegetical, expository type of messages, that's my style of preaching."
    },
    {
      "id": 37,
      "start": 164.0399932861328,
      "end": 170.67999267578125,
      "text": " But to isogaze is to take a verse and to take it out of context, and it's a problem."
    },
    {
      "id": 38,
      "start": 170.67999267578125,
      "end": 175.83999633789062,
      "text": " I mentioned already, but the second thought is to interpret Scripture with Scripture."
    },
    {
      "id": 39,
      "start": 175.83999633789062,
      "end": 181.55999755859375,
      "text": " And then the third thought is this, that we must resist the temptation to over-spiritualize"
    },
    {
      "id": 40,
      "start": 181.55999755859375,
      "end": 183.63999938964844,
      "text": " what the Bible says."
    },
    {
      "id": 41,
      "start": 183.63999938964844,
      "end": 187.83999633789062,
      "text": " There are people that try to over-spiritualize to read things into the Bible that aren't"
    },
    {
      "id": 42,
      "start": 187.83999633789062,
      "end": 191.44000244140625,
      "text": " really there in the Bible, and so those are some important things."
    },
    {
      "id": 43,
      "start": 191.44000244140625,
      "end": 195.0,
      "text": " Someone said this, in fact I was chatting with Brianna about this just a few weeks ago,"
    },
    {
      "id": 44,
      "start": 195.0,
      "end": 200.36000061035156,
      "text": " I think after one of the teen classes, Brother Jeff had mentioned something to this effect."
    },
    {
      "id": 45,
      "start": 200.36000061035156,
      "end": 205.3800048828125,
      "text": " But someone said this, if the plain sense makes common sense, then seek no other sense"
    },
    {
      "id": 46,
      "start": 205.3800048828125,
      "end": 207.8800048828125,
      "text": " lest it become nonsense."
    },
    {
      "id": 47,
      "start": 207.8800048828125,
      "end": 212.5800018310547,
      "text": " And there's a lot of, it's kind of a word salad if you will, but it's an idea of understanding"
    },
    {
      "id": 48,
      "start": 212.5800018310547,
      "end": 216.32000732421875,
      "text": " the importance of keeping things within the context."
    },
    {
      "id": 49,
      "start": 216.39999389648438,
      "end": 221.60000610351562,
      "text": " So as we look at this particular question, it is important that we take Matthew 7-1 within"
    },
    {
      "id": 50,
      "start": 221.60000610351562,
      "end": 224.16000366210938,
      "text": " the context in what it's given."
    },
    {
      "id": 51,
      "start": 224.16000366210938,
      "end": 226.9199981689453,
      "text": " Notice what the Bible says here in Matthew 7."
    },
    {
      "id": 52,
      "start": 226.9199981689453,
      "end": 230.0,
      "text": " Judge not that ye be not judged."
    },
    {
      "id": 53,
      "start": 230.0,
      "end": 234.32000732421875,
      "text": " For with what judgment ye judge, ye shall be judged."
    },
    {
      "id": 54,
      "start": 234.32000732421875,
      "end": 239.44000244140625,
      "text": " And with what measure ye meet, it shall be measured to you again."
    },
    {
      "id": 55,
      "start": 239.44000244140625,
      "end": 244.8000030517578,
      "text": " And why beholdest thou the mote that is in thy brother's eye, but considerest not the"
    },
    {
      "id": 56,
      "start": 244.8000030517578,
      "end": 248.1199951171875,
      "text": " beam that is in thine own eye?"
    },
    {
      "id": 57,
      "start": 248.1199951171875,
      "end": 254.83999633789062,
      "text": " Or how wilt thou say to thy brother, let me pull out the mote out of thine eye, and behold"
    },
    {
      "id": 58,
      "start": 254.83999633789062,
      "end": 258.0799865722656,
      "text": " a beam is in thine own eye?"
    },
    {
      "id": 59,
      "start": 258.0799865722656,
      "end": 266.8599853515625,
      "text": " Thou hypocrite, first cast out the beam out of thine own eye, and then shalt thou see"
    },
    {
      "id": 60,
      "start": 266.8599853515625,
      "end": 271.6400146484375,
      "text": " clearly to cast out the mote out of thy brother's eye."
    },
    {
      "id": 61,
      "start": 271.6400146484375,
      "end": 276.32000732421875,
      "text": " As we begin to look at this passage of Scripture and look at this subject matter this evening,"
    },
    {
      "id": 62,
      "start": 276.32000732421875,
      "end": 280.239990234375,
      "text": " a couple of thoughts for you from the passage and then we'll go over to 1 Corinthians and"
    },
    {
      "id": 63,
      "start": 280.239990234375,
      "end": 281.55999755859375,
      "text": " look at a few things."
    },
    {
      "id": 64,
      "start": 281.55999755859375,
      "end": 287.0400085449219,
      "text": " But number one, if you're taking notes, I believe that we see here a common susceptibility"
    },
    {
      "id": 65,
      "start": 287.0400085449219,
      "end": 288.6000061035156,
      "text": " is exposed."
    },
    {
      "id": 66,
      "start": 288.6000061035156,
      "end": 291.760009765625,
      "text": " A common susceptibility exposed."
    },
    {
      "id": 67,
      "start": 291.760009765625,
      "end": 298.79998779296875,
      "text": " It is common for individuals to examine and criticize the behavior of others."
    },
    {
      "id": 68,
      "start": 298.79998779296875,
      "end": 306.55999755859375,
      "text": " It is common for people to examine and try to correct the behavior of others while they're"
    },
    {
      "id": 69,
      "start": 306.55999755859375,
      "end": 312.0799865722656,
      "text": " examining, criticizing, and seeking to correct the behavior of someone else, all the while"
    },
    {
      "id": 70,
      "start": 312.0799865722656,
      "end": 315.3599853515625,
      "text": " they're ignoring their own behavior."
    },
    {
      "id": 71,
      "start": 315.3599853515625,
      "end": 316.5799865722656,
      "text": " And that's common."
    },
    {
      "id": 72,
      "start": 316.5799865722656,
      "end": 321.44000244140625,
      "text": " And it's something that is exposed in our passage of Scripture and we find that as we"
    },
    {
      "id": 73,
      "start": 321.44000244140625,
      "end": 328.2799987792969,
      "text": " often hear people running around and quoting verse number one of Matthew 7, in fact oftentimes"
    },
    {
      "id": 74,
      "start": 328.2799987792969,
      "end": 332.760009765625,
      "text": " not even quoting the entirety of it, but just running around saying, judge not, judge"
    },
    {
      "id": 75,
      "start": 332.760009765625,
      "end": 336.32000732421875,
      "text": " not, judge not, and that's what they went around and say."
    },
    {
      "id": 76,
      "start": 336.32000732421875,
      "end": 341.6000061035156,
      "text": " But the reality is that as we look at this passage of Scripture, we find that the Lord"
    },
    {
      "id": 77,
      "start": 341.6000061035156,
      "end": 347.1600036621094,
      "text": " is exposing this human nature that is common for so many of us."
    },
    {
      "id": 78,
      "start": 347.1600036621094,
      "end": 351.3999938964844,
      "text": " I've mentioned as we've studied through the book of 1 John on Sunday mornings this year,"
    },
    {
      "id": 79,
      "start": 351.3999938964844,
      "end": 356.0400085449219,
      "text": " how as you go through and you look at the tests that are provided in the book of 1 John,"
    },
    {
      "id": 80,
      "start": 356.0400085449219,
      "end": 360.6000061035156,
      "text": " you've referred to some of them as being a litmus test, and you find that those tests"
    },
    {
      "id": 81,
      "start": 360.6000061035156,
      "end": 363.6000061035156,
      "text": " are really to be self-prescribed tests."
    },
    {
      "id": 82,
      "start": 363.6000061035156,
      "end": 367.79998779296875,
      "text": " It's not necessarily that God is giving us this information so that we can apply it to"
    },
    {
      "id": 83,
      "start": 367.79998779296875,
      "end": 373.1600036621094,
      "text": " others, though we can, but the main emphasis is that we would apply it in our own lives"
    },
    {
      "id": 84,
      "start": 373.1600036621094,
      "end": 376.9599914550781,
      "text": " and we'd examine ourselves when we observe the Lord's Supper."
    },
    {
      "id": 85,
      "start": 376.9599914550781,
      "end": 381.8399963378906,
      "text": " The Bible says, but let a man examine himself."
    },
    {
      "id": 86,
      "start": 381.8399963378906,
      "end": 385.8999938964844,
      "text": " Not necessarily beginning with let a man examine the others sitting in the pew or the people"
    },
    {
      "id": 87,
      "start": 385.8999938964844,
      "end": 390.94000244140625,
      "text": " that they're passing the cup or the bread to, no, let a man examine himself."
    },
    {
      "id": 88,
      "start": 390.94000244140625,
      "end": 398.3800048828125,
      "text": " And so we find here that it is a common human nature trait for us to seek to examine, criticize,"
    },
    {
      "id": 89,
      "start": 398.3800048828125,
      "end": 404.8599853515625,
      "text": " and correct the behavior of others while at the same time ignoring our own behavior."
    },
    {
      "id": 90,
      "start": 404.8599853515625,
      "end": 410.29998779296875,
      "text": " And this common nature is going to be exposed in this passage of Scripture, and I believe"
    },
    {
      "id": 91,
      "start": 410.29998779296875,
      "end": 417.05999755859375,
      "text": " that the Lord beautifully illustrates this truth in verses three, four, and five."
    },
    {
      "id": 92,
      "start": 417.05999755859375,
      "end": 418.05999755859375,
      "text": " Notice what he says."
    },
    {
      "id": 93,
      "start": 418.05999755859375,
      "end": 421.6199951171875,
      "text": " We find that in verse number one he says, judge not that ye be not judged, and then"
    },
    {
      "id": 94,
      "start": 421.6199951171875,
      "end": 426.29998779296875,
      "text": " he says this, and we'll get to verse number two in just a few minutes with regard to,"
    },
    {
      "id": 95,
      "start": 426.29998779296875,
      "end": 431.20001220703125,
      "text": " with what judgment ye judge ye shall be judged, but notice the way in which the Lord Jesus"
    },
    {
      "id": 96,
      "start": 431.20001220703125,
      "end": 438.2200012207031,
      "text": " Christ beautifully illustrates this common susceptibility that is now going to be exposed,"
    },
    {
      "id": 97,
      "start": 438.2200012207031,
      "end": 442.94000244140625,
      "text": " this human nature, this behavior that is so common being exposed."
    },
    {
      "id": 98,
      "start": 442.94000244140625,
      "end": 447.4200134277344,
      "text": " He gives this beautiful illustration beginning in verse number three, and he says this, and"
    },
    {
      "id": 99,
      "start": 447.4200134277344,
      "end": 453.82000732421875,
      "text": " why beholdest thou the mote that is in thy brother's eye?"
    },
    {
      "id": 100,
      "start": 453.82000732421875,
      "end": 454.82000732421875,
      "text": " Right?"
    },
    {
      "id": 101,
      "start": 454.82000732421875,
      "end": 456.0199890136719,
      "text": " That's what we do."
    },
    {
      "id": 102,
      "start": 456.0199890136719,
      "end": 462.3399963378906,
      "text": " That's the human nature is to notice something in somebody else's life, to look at someone,"
    },
    {
      "id": 103,
      "start": 462.3399963378906,
      "end": 463.3399963378906,
      "text": " why?"
    },
    {
      "id": 104,
      "start": 463.3399963378906,
      "end": 464.82000732421875,
      "text": " Because I don't want to examine myself."
    },
    {
      "id": 105,
      "start": 464.82000732421875,
      "end": 473.260009765625,
      "text": " It's much more challenging, it's just a difficulty when I'm examining myself versus examining"
    },
    {
      "id": 106,
      "start": 473.260009765625,
      "end": 479.05999755859375,
      "text": " someone else, but the reality is that here he's saying, listen, you're going through"
    },
    {
      "id": 107,
      "start": 479.05999755859375,
      "end": 484.5799865722656,
      "text": " this process here, and he says, why beholdest thou the mote that is in thy brother's eye?"
    },
    {
      "id": 108,
      "start": 484.5799865722656,
      "end": 490.0199890136719,
      "text": " But then he says this, but considerest not the beam that is in thine own eye."
    },
    {
      "id": 109,
      "start": 490.0199890136719,
      "end": 493.1400146484375,
      "text": " The words that are used are very important to understand."
    },
    {
      "id": 110,
      "start": 493.1400146484375,
      "end": 496.70001220703125,
      "text": " The word mote and the word beam are used in verse number three."
    },
    {
      "id": 111,
      "start": 496.70001220703125,
      "end": 501.1000061035156,
      "text": " We find again that he refers to it in verse number four, and then we find again that he"
    },
    {
      "id": 112,
      "start": 501.1000061035156,
      "end": 502.5799865722656,
      "text": " refers to it in verse number five."
    },
    {
      "id": 113,
      "start": 502.5799865722656,
      "end": 508.0199890136719,
      "text": " So it's obviously important that we understand the difference between mote and beam and this"
    },
    {
      "id": 114,
      "start": 508.0199890136719,
      "end": 512.1400146484375,
      "text": " exposure that is taking place by the Lord Jesus Christ."
    },
    {
      "id": 115,
      "start": 512.1400146484375,
      "end": 515.739990234375,
      "text": " By the way, when you begin to think about the Pharisees and the Sadducees that Jesus"
    },
    {
      "id": 116,
      "start": 515.739990234375,
      "end": 520.3400268554688,
      "text": " so often was addressing and dealing with, though that's not the main audience of this text"
    },
    {
      "id": 117,
      "start": 520.3400268554688,
      "end": 524.9400024414062,
      "text": " of Scripture, you would find that the Pharisees and Sadducees were individuals that were constantly"
    },
    {
      "id": 118,
      "start": 524.9400024414062,
      "end": 528.5800170898438,
      "text": " judging others, but don't look at my life."
    },
    {
      "id": 119,
      "start": 528.5800170898438,
      "end": 530.4199829101562,
      "text": " That's really the way they behaved."
    },
    {
      "id": 120,
      "start": 530.4199829101562,
      "end": 535.5,
      "text": " And we find here this evening that when Jesus uses the word mote, he's speaking about, the"
    },
    {
      "id": 121,
      "start": 535.5,
      "end": 543.02001953125,
      "text": " word literally refers to a piece of straw or a fleck of debris, really a speck, a piece"
    },
    {
      "id": 122,
      "start": 543.02001953125,
      "end": 546.1799926757812,
      "text": " of sawdust, so to speak."
    },
    {
      "id": 123,
      "start": 546.1799926757812,
      "end": 547.6199951171875,
      "text": " That's what a mote is."
    },
    {
      "id": 124,
      "start": 547.6599731445312,
      "end": 554.260009765625,
      "text": " A beam, on the other hand, is a timber that would be used for construction."
    },
    {
      "id": 125,
      "start": 554.260009765625,
      "end": 558.8200073242188,
      "text": " Now when you begin to see the illustration that Jesus is painting here and the truth"
    },
    {
      "id": 126,
      "start": 558.8200073242188,
      "end": 563.3800048828125,
      "text": " in which he's giving, he's saying, listen, judge not that ye be not judged."
    },
    {
      "id": 127,
      "start": 563.3800048828125,
      "end": 568.1799926757812,
      "text": " He then talks about how that they would be judged with the same, for with what judgment"
    },
    {
      "id": 128,
      "start": 568.1799926757812,
      "end": 571.7000122070312,
      "text": " ye judge, ye shall be judged, but then he says, why do you hold us now of the mote,"
    },
    {
      "id": 129,
      "start": 571.7000122070312,
      "end": 576.7000122070312,
      "text": " this speck, this piece of sawdust that is in your brother's eye, but you don't consider"
    },
    {
      "id": 130,
      "start": 576.780029296875,
      "end": 580.4600219726562,
      "text": " the construction timber that is in your own eye."
    },
    {
      "id": 131,
      "start": 580.4600219726562,
      "end": 584.0599975585938,
      "text": " Isn't that amazing?"
    },
    {
      "id": 132,
      "start": 584.0599975585938,
      "end": 589.8599853515625,
      "text": " And so we find that as the Lord is exposing this human element, this nature of our human"
    },
    {
      "id": 133,
      "start": 589.8599853515625,
      "end": 596.0599975585938,
      "text": " behavior to try to examine and to correct and criticize the behavior of others while"
    },
    {
      "id": 134,
      "start": 596.0599975585938,
      "end": 600.0599975585938,
      "text": " ignoring our own behavior, the Lord's saying, listen, you have a beam."
    },
    {
      "id": 0,
      "start": 600.0599975585938,
      "end": 604.8199977874756,
      "text": " in your eye and you're concerned about the moat in your brother's eye. If you're"
    },
    {
      "id": 1,
      "start": 604.8199977874756,
      "end": 609.0199975967407,
      "text": " gonna think about the difference between a moat and a beam, it's significant. It is"
    },
    {
      "id": 2,
      "start": 609.0199975967407,
      "end": 613.7199974060059,
      "text": " a substantial difference between these two words that the Lord would use, and we"
    },
    {
      "id": 3,
      "start": 613.7199974060059,
      "end": 617.4199981689453,
      "text": " know, as I said this morning and we've said often over the years, that every"
    },
    {
      "id": 4,
      "start": 617.4199981689453,
      "end": 625.6999969482422,
      "text": " word of God is pure. Jesus picks his words purposefully, amen? And we find that"
    },
    {
      "id": 5,
      "start": 625.6999969482422,
      "end": 631.5399971008301,
      "text": " as he chooses these words, he's exposing the hypocrisy. He's going to mention that"
    },
    {
      "id": 6,
      "start": 631.5399971008301,
      "end": 634.2199974060059,
      "text": " in just a moment. Notice what he says in verse number four,"
    },
    {
      "id": 7,
      "start": 634.2199974060059,
      "end": 639.7799987792969,
      "text": " or how wilt thou say to thy brother, let me pull out the moat out of thine eye,"
    },
    {
      "id": 8,
      "start": 639.7799987792969,
      "end": 644.5799980163574,
      "text": " and behold a beam is in thine own eye. Now think about what he's saying. I mean"
    },
    {
      "id": 9,
      "start": 644.5799980163574,
      "end": 649.379997253418,
      "text": " physically, if we think about just our eyesight and looking at the example that"
    },
    {
      "id": 10,
      "start": 649.379997253418,
      "end": 653.819995880127,
      "text": " he's using, this illustration that is given, there's no way that I can help get"
    },
    {
      "id": 11,
      "start": 653.819995880127,
      "end": 661.3399963378906,
      "text": " this fleck, this piece of sawdust, out of your eye if I have a timber in my eye."
    },
    {
      "id": 12,
      "start": 661.4599990844727,
      "end": 665.6999969482422,
      "text": " He said that's what you're doing, so you need to understand what he's exposing"
    },
    {
      "id": 13,
      "start": 665.6999969482422,
      "end": 672.2200012207031,
      "text": " here, and then he says this in verse number five, thou hypocrite. The hypocrisy"
    },
    {
      "id": 14,
      "start": 672.2200012207031,
      "end": 678.8999938964844,
      "text": " is being exposed, and then notice what he says. Notice first and then. It's very"
    },
    {
      "id": 15,
      "start": 678.8999938964844,
      "end": 682.2200012207031,
      "text": " important to understand what's taking place in this passage of Scripture"
    },
    {
      "id": 16,
      "start": 682.2200012207031,
      "end": 688.2999954223633,
      "text": " because Jesus says, thou hypocrite. What caused them to be a hypocrite? Well,"
    },
    {
      "id": 17,
      "start": 688.2999954223633,
      "end": 691.1399993896484,
      "text": " they're worrying about somebody else's behavior while they're ignoring their"
    },
    {
      "id": 18,
      "start": 691.1399993896484,
      "end": 695.8999938964844,
      "text": " own behavior. That's what would lead them to this area of hypocrisy, and"
    },
    {
      "id": 19,
      "start": 695.8999938964844,
      "end": 705.2599945068359,
      "text": " Jesus says, first, cast out the beam out of thine own eye. So first matter of"
    },
    {
      "id": 20,
      "start": 705.2599945068359,
      "end": 712.1999969482422,
      "text": " business is let a man examine himself, right? Let me deal with the beam that is"
    },
    {
      "id": 21,
      "start": 712.1999969482422,
      "end": 717.7999954223633,
      "text": " in mine own eye. Let me deal with that. Let me address that, and honestly, if we"
    },
    {
      "id": 22,
      "start": 717.7999954223633,
      "end": 722.1599960327148,
      "text": " really start understanding the truth of God's Word and begin to walk in the"
    },
    {
      "id": 23,
      "start": 722.1599960327148,
      "end": 725.9199981689453,
      "text": " light as he is in the light, begin to have fellowship with him and seeking to"
    },
    {
      "id": 24,
      "start": 725.9199981689453,
      "end": 729.9199981689453,
      "text": " walk in the Spirit so that we do not fulfill the lust of the flesh, we'll find"
    },
    {
      "id": 25,
      "start": 729.9199981689453,
      "end": 734.5599975585938,
      "text": " that examining our own selves is almost a full-time job. I'm not gonna have as"
    },
    {
      "id": 26,
      "start": 734.5599975585938,
      "end": 740.4799957275391,
      "text": " much time to try to examine other people, amen? But so long as I'm ignoring the"
    },
    {
      "id": 27,
      "start": 740.4799957275391,
      "end": 744.9199981689453,
      "text": " beam in my eye and I'm running around trying to find all the moats in other"
    },
    {
      "id": 28,
      "start": 744.9199981689453,
      "end": 750.8000030517578,
      "text": " people's eyes, then I'm just going to be a perfect examiner of someone else while"
    },
    {
      "id": 29,
      "start": 750.8000030517578,
      "end": 755.1600036621094,
      "text": " I'm just not even worried about my own life. And that's not biblical. That's not"
    },
    {
      "id": 30,
      "start": 755.1600036621094,
      "end": 760.1999969482422,
      "text": " what God tells us. So he says, first, the first order of business, the primary"
    },
    {
      "id": 31,
      "start": 760.1999969482422,
      "end": 764.2799987792969,
      "text": " concern as we begin to understand what's taking place here is that the first"
    },
    {
      "id": 32,
      "start": 764.2799987792969,
      "end": 768.7599945068359,
      "text": " thing that you need to do is cast out the beam out of thine own eye. By the way, I"
    },
    {
      "id": 33,
      "start": 768.8800048828125,
      "end": 776.4400024414062,
      "text": " am so thankful that God in his power will enable us to identify and to deal"
    },
    {
      "id": 34,
      "start": 776.4400024414062,
      "end": 783.3999938964844,
      "text": " with the beams in our lives. Aren't you? That when the Lord uses his Word in your"
    },
    {
      "id": 35,
      "start": 783.3999938964844,
      "end": 788.3600006103516,
      "text": " life and in my life to expose something in our lives that doesn't belong,"
    },
    {
      "id": 36,
      "start": 788.3600006103516,
      "end": 793.2799987792969,
      "text": " something that needs to change, we ought to thank God for that. We ought to thank God"
    },
    {
      "id": 37,
      "start": 793.2799987792969,
      "end": 797.8000030517578,
      "text": " that he loves us enough, that he desires that fellowship with us enough, that he"
    },
    {
      "id": 38,
      "start": 797.8000030517578,
      "end": 803.2799987792969,
      "text": " exposes it to us, and then that he's gracious to forgive us and to restore"
    },
    {
      "id": 39,
      "start": 803.2799987792969,
      "end": 808.5999908447266,
      "text": " us. And that ought to cause us to rejoice greatly. And so even when he says, first,"
    },
    {
      "id": 40,
      "start": 808.5999908447266,
      "end": 812.1199951171875,
      "text": " cast out the beam out of thine own eye, we can begin to think about the"
    },
    {
      "id": 41,
      "start": 812.1199951171875,
      "end": 816.8800048828125,
      "text": " forgiveness and the restoration that God offers. And I'm thankful that the Bible"
    },
    {
      "id": 42,
      "start": 816.8800048828125,
      "end": 821.1999969482422,
      "text": " says, with thee, with the Lord, there is forgiveness. Throughout the Old Testament"
    },
    {
      "id": 43,
      "start": 821.1999969482422,
      "end": 825.8800048828125,
      "text": " you find that the prophets of God would refer to the Lord in speaking about his"
    },
    {
      "id": 44,
      "start": 825.8800048828125,
      "end": 831.2799987792969,
      "text": " forgiveness that he's a God who is ready to pardon. He's a God who is ready"
    },
    {
      "id": 45,
      "start": 831.2799987792969,
      "end": 837.8800048828125,
      "text": " to forgive. If we confess our sins, he is faithful and just to forgive us of our"
    },
    {
      "id": 46,
      "start": 837.8800048828125,
      "end": 842.239990234375,
      "text": " sins and to cleanse us from all unrighteousness. I'm thankful that our"
    },
    {
      "id": 47,
      "start": 842.239990234375,
      "end": 850.1600036621094,
      "text": " God is able to restore us to fellowship with him. Amen? What a joy. So he says,"
    },
    {
      "id": 48,
      "start": 850.1600036621094,
      "end": 854.1199951171875,
      "text": " first matter of business is to deal with that beam that's in your eye. And then"
    },
    {
      "id": 49,
      "start": 854.1199951171875,
      "end": 862.1600036621094,
      "text": " notice what he says, and then, and then. So that's subsequent, right? We understand"
    },
    {
      "id": 50,
      "start": 862.1600036621094,
      "end": 866.3999938964844,
      "text": " the language is being used here, so first I deal with the beam in my eye, but then"
    },
    {
      "id": 51,
      "start": 866.3999938964844,
      "end": 874.3200073242188,
      "text": " he says, and then shalt thou see clearly to cast the moat out of thy brother's"
    },
    {
      "id": 52,
      "start": 874.3200073242188,
      "end": 881.5599975585938,
      "text": " eye. So now all of a sudden God will allow us, with that right spirit, after"
    },
    {
      "id": 53,
      "start": 881.5599975585938,
      "end": 886.8399963378906,
      "text": " we've examined ourselves, he will use us to help others. Because there are some"
    },
    {
      "id": 54,
      "start": 886.8399963378906,
      "end": 892.9199829101562,
      "text": " others that do need help. Amen? They need some guidance, they need some leadership."
    },
    {
      "id": 55,
      "start": 892.9199829101562,
      "end": 897.6000061035156,
      "text": " The Bible, often as we study the Word of God, we see about those that are"
    },
    {
      "id": 56,
      "start": 897.6000061035156,
      "end": 901.3999938964844,
      "text": " overtaken in a fault. Let me just read to you what the Bible says. You don't need"
    },
    {
      "id": 57,
      "start": 901.3999938964844,
      "end": 905.0599975585938,
      "text": " to turn there, but in Galatians chapter number 6, the Bible says, brethren, if a"
    },
    {
      "id": 58,
      "start": 905.0599975585938,
      "end": 909.5599975585938,
      "text": " man be overtaken in a fault, ye which are spiritual, restore such in one in the"
    },
    {
      "id": 59,
      "start": 909.5599975585938,
      "end": 914.7999877929688,
      "text": " spirit of meekness, considering thyself, lest thou also be tempted. It's not a"
    },
    {
      "id": 60,
      "start": 914.7999877929688,
      "end": 919.0400085449219,
      "text": " situation where those that are there, referred to in verse number 6, that"
    },
    {
      "id": 61,
      "start": 919.0400085449219,
      "end": 924.1199951171875,
      "text": " there's just a matter of judgment and casting out, and what have you. No, he"
    },
    {
      "id": 62,
      "start": 924.1199951171875,
      "end": 929.4800109863281,
      "text": " says that ye which are spiritual, restore such in one, and he says in the spirit"
    },
    {
      "id": 63,
      "start": 929.4800109863281,
      "end": 935.3999938964844,
      "text": " of meekness. I'm so thankful that two pillars of biblical Christianity are"
    },
    {
      "id": 64,
      "start": 935.7200012207031,
      "end": 942.6000061035156,
      "text": " forgiveness and restoration. My dad was teaching last summer, this past summer, on"
    },
    {
      "id": 65,
      "start": 942.6000061035156,
      "end": 948.0400085449219,
      "text": " Psalm 23, and what a great study it was through the 23rd Psalm. He took almost"
    },
    {
      "id": 66,
      "start": 948.0400085449219,
      "end": 952.6000061035156,
      "text": " the entire summer until he had back surgery, and then had to kind of wait for"
    },
    {
      "id": 67,
      "start": 952.6000061035156,
      "end": 959.5599975585938,
      "text": " that last lesson, but he restoreth my soul. That was a great lesson that he"
    },
    {
      "id": 68,
      "start": 959.5599975585938,
      "end": 964.8800048828125,
      "text": " delivered to us from the Word of God on that truth of restoration. And we find"
    },
    {
      "id": 69,
      "start": 964.8800048828125,
      "end": 970.0,
      "text": " here that God will use us, and we find this order that's provided. We do not"
    },
    {
      "id": 70,
      "start": 970.0,
      "end": 976.1199951171875,
      "text": " find that he says that as he's exposing this human nature, he's giving this"
    },
    {
      "id": 71,
      "start": 976.1199951171875,
      "end": 982.1600036621094,
      "text": " important truth with regard to examining our own behavior. Now, so we see that"
    },
    {
      "id": 72,
      "start": 982.1600036621094,
      "end": 986.3200073242188,
      "text": " there's a common susceptibility that is exposed, but then I would say this, as we"
    },
    {
      "id": 73,
      "start": 986.3200073242188,
      "end": 992.7999877929688,
      "text": " look at this passage of Scripture, number two, a consistent standard is essential. A"
    },
    {
      "id": 74,
      "start": 992.7999877929688,
      "end": 997.6399841308594,
      "text": " consistent standard is essential. Pastor, what do you mean by that? Well, notice"
    },
    {
      "id": 75,
      "start": 997.6399841308594,
      "end": 1002.5599975585938,
      "text": " what it says in verse number two. In verse number two, the Bible says this,"
    },
    {
      "id": 76,
      "start": 1002.5599975585938,
      "end": 1014.6799926757812,
      "text": " for with what judgment ye judge, ye shall be judged. And with what measure ye meet,"
    },
    {
      "id": 77,
      "start": 1014.6799926757812,
      "end": 1022.0799865722656,
      "text": " it shall be measured to you again. See, we mentioned already, as he says in verse"
    },
    {
      "id": 78,
      "start": 1022.1199951171875,
      "end": 1027.239990234375,
      "text": " number five, thou hypocrite, the danger of hypocrisy that is here, and we find that"
    },
    {
      "id": 79,
      "start": 1027.239990234375,
      "end": 1034.0799865722656,
      "text": " we are to use the same standard to judge all things. There's not a standard for me"
    },
    {
      "id": 80,
      "start": 1034.0799865722656,
      "end": 1040.3200073242188,
      "text": " and a different standard for you. So we find that a consistent"
    },
    {
      "id": 81,
      "start": 1040.3200073242188,
      "end": 1046.1600036621094,
      "text": " standard is essential. It is absolutely imperative that we have a consistent"
    },
    {
      "id": 82,
      "start": 1046.1600036621094,
      "end": 1051.1600036621094,
      "text": " standard when we deal with this subject matter of judgment. And what is that"
    },
    {
      "id": 83,
      "start": 1051.1600036621094,
      "end": 1057.6000061035156,
      "text": " consistent standard? The Word of God. It's the Word of God. And we begin to take the"
    },
    {
      "id": 84,
      "start": 1057.6000061035156,
      "end": 1062.760009765625,
      "text": " Word of God, and we can find that we are able to judge all things as we're using"
    },
    {
      "id": 85,
      "start": 1062.760009765625,
      "end": 1068.0799865722656,
      "text": " the consistent standard, and we're understanding the importance of having"
    },
    {
      "id": 86,
      "start": 1068.0799865722656,
      "end": 1073.4800109863281,
      "text": " the Word of God as that standard for judgment. Does that make sense this"
    },
    {
      "id": 87,
      "start": 1073.4800109863281,
      "end": 1077.6000061035156,
      "text": " evening? And so it's not going to be a situation where I'm saying, well, you"
    },
    {
      "id": 88,
      "start": 1077.6000061035156,
      "end": 1082.3999938964844,
      "text": " know, you've ever heard the situation, this is for the, but not for me. These"
    },
    {
      "id": 89,
      "start": 1082.3999938964844,
      "end": 1088.239990234375,
      "text": " are rules for you, but they don't apply to me. That's terrible. I said"
    },
    {
      "id": 90,
      "start": 1088.239990234375,
      "end": 1091.239990234375,
      "text": " this to Breonna last night. Breonna Joseph and I, Holly was there, we were"
    },
    {
      "id": 91,
      "start": 1091.239990234375,
      "end": 1096.7200012207031,
      "text": " talking, and I said this, that rules without relationship breeds rebellion."
    },
    {
      "id": 92,
      "start": 1096.7200012207031,
      "end": 1102.760009765625,
      "text": " And it really does. Rules without relationship will breed rebellion. But"
    },
    {
      "id": 93,
      "start": 1102.760009765625,
      "end": 1105.6399841308594,
      "text": " the reality is that when we go to the Word of God and we understand that we"
    },
    {
      "id": 94,
      "start": 1105.6399841308594,
      "end": 1109.8399963378906,
      "text": " have a relationship with the God of the universe, that we serve the King of kings"
    },
    {
      "id": 95,
      "start": 1109.8399963378906,
      "end": 1113.8800048828125,
      "text": " and Lord of lords, and He's given us a word that we're to follow, and we're to"
    },
    {
      "id": 96,
      "start": 1113.8800048828125,
      "end": 1118.2799682617188,
      "text": " obey, and we're to take and apply the truth in our lives, there's no rebellion."
    },
    {
      "id": 97,
      "start": 1118.2799682617188,
      "end": 1122.3599853515625,
      "text": " His commandments are not grievous. Why? Because we understand that He loves"
    },
    {
      "id": 98,
      "start": 1122.3599853515625,
      "end": 1127.2000122070312,
      "text": " me, and I love Him, and I want to please Him. And we find that it's absolutely"
    },
    {
      "id": 99,
      "start": 1127.2000122070312,
      "end": 1131.3200073242188,
      "text": " imperative when we deal with this subject matter of judgment that there's"
    },
    {
      "id": 100,
      "start": 1131.3200073242188,
      "end": 1136.2000122070312,
      "text": " this consistent standard that is absolutely essential, and that standard"
    },
    {
      "id": 101,
      "start": 1136.2000122070312,
      "end": 1144.5999755859375,
      "text": " is the Word of God. The motive is to be pure. We find that in verse number five,"
    },
    {
      "id": 102,
      "start": 1144.5999755859375,
      "end": 1148.8800048828125,
      "text": " as we've noticed already, where he talks about thou hypocrite, first cast"
    },
    {
      "id": 103,
      "start": 1148.8800048828125,
      "end": 1152.719970703125,
      "text": " out the beam out of thine own eye, and then shalt thou see clearly to cast out"
    },
    {
      "id": 104,
      "start": 1152.719970703125,
      "end": 1158.52001953125,
      "text": " the mote out of thy brother's eye. What do I mean by the motive being pure? So"
    },
    {
      "id": 105,
      "start": 1158.52001953125,
      "end": 1162.5999755859375,
      "text": " often when you think about people that would use this terminology of judge not,"
    },
    {
      "id": 106,
      "start": 1162.5999755859375,
      "end": 1166.9600219726562,
      "text": " and they begin to deal with that situation, typically the person that is"
    },
    {
      "id": 107,
      "start": 1166.9600219726562,
      "end": 1172.4400024414062,
      "text": " doing the judgment is in a position of condemning and not seeking to restore."
    },
    {
      "id": 108,
      "start": 1172.4400024414062,
      "end": 1177.47998046875,
      "text": " And it's not really a pure motive. What is the purpose? What is the the motive"
    },
    {
      "id": 109,
      "start": 1177.47998046875,
      "end": 1182.9600219726562,
      "text": " behind the judgment? There needs to be this pure motive if we are going to take"
    },
    {
      "id": 110,
      "start": 1182.9600219726562,
      "end": 1188.0399780273438,
      "text": " and examine our own lives, and we're going to use the Scriptures the way that"
    },
    {
      "id": 111,
      "start": 1188.0399780273438,
      "end": 1192.1199951171875,
      "text": " we're supposed to in my life, and in your life personally, and say, Lord search"
    },
    {
      "id": 112,
      "start": 1192.1199951171875,
      "end": 1197.1199951171875,
      "text": " me, and try me, and show me, and reveal to me, and help me to walk in a way that's"
    },
    {
      "id": 113,
      "start": 1197.1199951171875,
      "end": 1201.9600219726562,
      "text": " pleasing to you, then God will allow us to"
    },
    {
      "id": 0,
      "start": 1201.9600219726562,
      "end": 1206.9200220108032,
      "text": " be used in the lives of others to help to expose error, to help them, why?"
    },
    {
      "id": 1,
      "start": 1206.9200220108032,
      "end": 1208.3200221061707,
      "text": " Because we want to see them restored."
    },
    {
      "id": 2,
      "start": 1208.3200221061707,
      "end": 1213.1600217819214,
      "text": " We want to see them have that fellowship with God."
    },
    {
      "id": 3,
      "start": 1213.1600217819214,
      "end": 1221.2800216674805,
      "text": " At times, and unfortunately, we're probably guilty of it more than we'd like to admit,"
    },
    {
      "id": 4,
      "start": 1221.2800216674805,
      "end": 1231.560022354126,
      "text": " judgment can come from a heart of condemning, condemnation, and trying to hurt someone that's"
    },
    {
      "id": 5,
      "start": 1231.560022354126,
      "end": 1235.080020904541,
      "text": " already dealing with great difficulty."
    },
    {
      "id": 6,
      "start": 1235.080020904541,
      "end": 1237.6800231933594,
      "text": " And we're called by the Lord to help restore."
    },
    {
      "id": 7,
      "start": 1237.6800231933594,
      "end": 1242.0000228881836,
      "text": " Someone said this to me years ago, Christians are the only ones that will shoot their wounded."
    },
    {
      "id": 8,
      "start": 1242.0000228881836,
      "end": 1248.200023651123,
      "text": " I thought, man, that's terrible to have that connotation with regard to believers."
    },
    {
      "id": 9,
      "start": 1248.200023651123,
      "end": 1249.2800216674805,
      "text": " Why?"
    },
    {
      "id": 10,
      "start": 1249.2800216674805,
      "end": 1256.200023651123,
      "text": " Because as believers, listen, I understand that for by the grace of God, amen, and we"
    },
    {
      "id": 11,
      "start": 1256.200023651123,
      "end": 1259.5200233459473,
      "text": " rejoice and we thank God for the truth that he's given us."
    },
    {
      "id": 12,
      "start": 1259.5200233459473,
      "end": 1263.920021057129,
      "text": " And so we find here that in this passage of Scripture, when we deal with this subject"
    },
    {
      "id": 13,
      "start": 1263.920021057129,
      "end": 1268.760025024414,
      "text": " matter of judge not that ye be not judged, that we find within the context that a common"
    },
    {
      "id": 14,
      "start": 1268.760025024414,
      "end": 1275.3200225830078,
      "text": " susceptibility is exposed, and it's also revealed to us here that a consistent standard is essential."
    },
    {
      "id": 15,
      "start": 1275.3200225830078,
      "end": 1280.52001953125,
      "text": " Now, as we would leave this passage of Scripture, I want you to consider with me the instruction"
    },
    {
      "id": 16,
      "start": 1280.52001953125,
      "end": 1282.4400253295898,
      "text": " that Paul gives to the church in Corinth."
    },
    {
      "id": 17,
      "start": 1282.4400253295898,
      "end": 1287.040023803711,
      "text": " Turn to the book of 1 Corinthians chapter 5, if you will, and I'll use great discretion"
    },
    {
      "id": 18,
      "start": 1287.040023803711,
      "end": 1292.0000228881836,
      "text": " here in chapter 5, I'd encourage you to, the adults, to be able to, perhaps you already"
    },
    {
      "id": 19,
      "start": 1292.0000228881836,
      "end": 1295.9600219726562,
      "text": " know what's going on here in 1 Corinthians 5, but we'll look at some things and I'll"
    },
    {
      "id": 20,
      "start": 1295.9600219726562,
      "end": 1300.8000183105469,
      "text": " use great discretion because of the children and what have you, and then we'll jump into"
    },
    {
      "id": 21,
      "start": 1300.8000183105469,
      "end": 1304.3600234985352,
      "text": " the 6th chapter and deal with some things here."
    },
    {
      "id": 22,
      "start": 1304.3600234985352,
      "end": 1309.8600234985352,
      "text": " But I want you to understand here what's going on, and I want you to understand this instruction"
    },
    {
      "id": 23,
      "start": 1309.8600234985352,
      "end": 1310.8600234985352,
      "text": " that Paul gives."
    },
    {
      "id": 24,
      "start": 1310.8600234985352,
      "end": 1314.2400207519531,
      "text": " Now, understand the church in Corinth is a carnal church."
    },
    {
      "id": 25,
      "start": 1314.2400207519531,
      "end": 1318.2800216674805,
      "text": " The church in Corinth is a church that has many difficulties."
    },
    {
      "id": 26,
      "start": 1318.2800216674805,
      "end": 1322.2000198364258,
      "text": " There's divisions and contentions and all sorts of things going on."
    },
    {
      "id": 27,
      "start": 1322.2000198364258,
      "end": 1327.2800216674805,
      "text": " We find that Paul begins the 3rd chapter by telling them that I could not speak unto you"
    },
    {
      "id": 28,
      "start": 1327.2800216674805,
      "end": 1331.8800201416016,
      "text": " as unto spiritual, but as unto carnal, even as unto babes in Christ."
    },
    {
      "id": 29,
      "start": 1331.8800201416016,
      "end": 1332.8800201416016,
      "text": " And they're carnal."
    },
    {
      "id": 30,
      "start": 1332.8800201416016,
      "end": 1336.280029296875,
      "text": " He says that in verse number 3, for ye are yet carnal."
    },
    {
      "id": 31,
      "start": 1336.280029296875,
      "end": 1340.8400268554688,
      "text": " And we find that as we come to the 5th chapter, that wickedness in the church is going to"
    },
    {
      "id": 32,
      "start": 1340.8400268554688,
      "end": 1341.8400268554688,
      "text": " be exposed."
    },
    {
      "id": 33,
      "start": 1341.8400268554688,
      "end": 1347.7200164794922,
      "text": " And notice what the Bible says in verse number 1 of 1 Corinthians 5, it is reported commonly"
    },
    {
      "id": 34,
      "start": 1347.7200164794922,
      "end": 1349.6800231933594,
      "text": " that there is fornication among you."
    },
    {
      "id": 35,
      "start": 1349.6800231933594,
      "end": 1352.760025024414,
      "text": " Now, just think about the wording there, it's reported commonly."
    },
    {
      "id": 36,
      "start": 1352.760025024414,
      "end": 1355.6800231933594,
      "text": " This was a known thing that was going on in the church in Corinth."
    },
    {
      "id": 37,
      "start": 1355.6800231933594,
      "end": 1357.1600189208984,
      "text": " This was not some secret thing."
    },
    {
      "id": 38,
      "start": 1357.1600189208984,
      "end": 1359.6000213623047,
      "text": " This was not something that just a couple, it was a common thing."
    },
    {
      "id": 39,
      "start": 1359.6000213623047,
      "end": 1361.500015258789,
      "text": " It was something that was out in the open."
    },
    {
      "id": 40,
      "start": 1361.500015258789,
      "end": 1362.9200286865234,
      "text": " It was wickedness."
    },
    {
      "id": 41,
      "start": 1362.9200286865234,
      "end": 1367.7200164794922,
      "text": " The Bible says that it's such fornication as is not so much as named among the Gentiles."
    },
    {
      "id": 42,
      "start": 1367.7200164794922,
      "end": 1373.3600158691406,
      "text": " Now, think about that as he would use as God is exposing this wickedness here."
    },
    {
      "id": 43,
      "start": 1373.3600158691406,
      "end": 1381.280029296875,
      "text": " He's saying the situation in Corinth is so bad, the situation is so egregious that it's"
    },
    {
      "id": 44,
      "start": 1381.280029296875,
      "end": 1385.3600158691406,
      "text": " not even something that's named among the Gentiles."
    },
    {
      "id": 45,
      "start": 1385.3600158691406,
      "end": 1390.1600189208984,
      "text": " He says this in verse number 2, and ye are puffed up and have not rather mourned that"
    },
    {
      "id": 46,
      "start": 1390.1600189208984,
      "end": 1393.6000213623047,
      "text": " he that hath done this deed might be taken away from among you."
    },
    {
      "id": 47,
      "start": 1393.6000213623047,
      "end": 1399.280029296875,
      "text": " And notice what Paul says in verse number 3, for I verily as absent in body, now pause"
    },
    {
      "id": 48,
      "start": 1399.280029296875,
      "end": 1403.6000213623047,
      "text": " with me just for a moment, Paul's not even there."
    },
    {
      "id": 49,
      "start": 1403.6000213623047,
      "end": 1408.2400207519531,
      "text": " Paul was used of the Lord to minister to the church in Corinth, to see the church in Corinth"
    },
    {
      "id": 50,
      "start": 1408.2400207519531,
      "end": 1409.4400177001953,
      "text": " established."
    },
    {
      "id": 51,
      "start": 1409.4400177001953,
      "end": 1414.3200225830078,
      "text": " We find that Paul was used during the missionary journey to have a great work established in"
    },
    {
      "id": 52,
      "start": 1414.3200225830078,
      "end": 1418.2000274658203,
      "text": " the city of Corinth, and this church is established, this church is moving forward."
    },
    {
      "id": 53,
      "start": 1418.2000274658203,
      "end": 1423.6000213623047,
      "text": " He still has a level of influence in the believers there in Corinth, and God would"
    },
    {
      "id": 54,
      "start": 1423.6000213623047,
      "end": 1428.5600280761719,
      "text": " use him to write this and the second letter of Corinthians that go to this church to provide"
    },
    {
      "id": 55,
      "start": 1428.5600280761719,
      "end": 1435.000015258789,
      "text": " them with instruction, but he's not even there in body, but notice what he says, but present"
    },
    {
      "id": 56,
      "start": 1435.000015258789,
      "end": 1441.4000244140625,
      "text": " in spirit, and then notice these words, have judged already."
    },
    {
      "id": 57,
      "start": 1441.4000244140625,
      "end": 1444.6000213623047,
      "text": " Did Paul never read Matthew 7?"
    },
    {
      "id": 58,
      "start": 1444.6000213623047,
      "end": 1446.6000213623047,
      "text": " Judge not!"
    },
    {
      "id": 59,
      "start": 1446.6000213623047,
      "end": 1449.1600189208984,
      "text": " Paul must not have read Matthew 7."
    },
    {
      "id": 60,
      "start": 1449.1600189208984,
      "end": 1456.7200164794922,
      "text": " No, Paul did read Matthew 7, he was aware of it, but he says, I've judged already."
    },
    {
      "id": 61,
      "start": 1456.7200164794922,
      "end": 1458.6000366210938,
      "text": " Well, how did he make judgment?"
    },
    {
      "id": 62,
      "start": 1458.6000366210938,
      "end": 1462.0000305175781,
      "text": " Well, there was a consistent standard that was essential."
    },
    {
      "id": 63,
      "start": 1462.0000305175781,
      "end": 1467.4400329589844,
      "text": " Paul's using the Word of God, and Paul's saying this behavior is wicked."
    },
    {
      "id": 64,
      "start": 1467.4400329589844,
      "end": 1475.3200073242188,
      "text": " This behavior goes against the Word of God, and it's not hard for me to make judgment"
    },
    {
      "id": 65,
      "start": 1475.3200073242188,
      "end": 1482.3600158691406,
      "text": " concerning this matter, because it's a violation to this standard."
    },
    {
      "id": 66,
      "start": 1482.3600158691406,
      "end": 1484.280029296875,
      "text": " Does that make sense?"
    },
    {
      "id": 67,
      "start": 1484.280029296875,
      "end": 1488.8400268554688,
      "text": " And so, Paul says, it's not inappropriate for me to make judgment, it's not wrong, I've"
    },
    {
      "id": 68,
      "start": 1488.8400268554688,
      "end": 1490.760009765625,
      "text": " already judged."
    },
    {
      "id": 69,
      "start": 1490.760009765625,
      "end": 1494.760009765625,
      "text": " You guys are there, and you're puffed up, and you're not mourning that he that done"
    },
    {
      "id": 70,
      "start": 1494.760009765625,
      "end": 1498.9200134277344,
      "text": " this deed might be taken away, and we understand that as you go to 2 Corinthians, it seems"
    },
    {
      "id": 71,
      "start": 1498.9200134277344,
      "end": 1503.6800231933594,
      "text": " as if as you read the two letters together, that this man, this individual that was in"
    },
    {
      "id": 72,
      "start": 1503.6800231933594,
      "end": 1508.1200256347656,
      "text": " this sin, that there was repentance, and Paul encourages them to forgive him and to"
    },
    {
      "id": 73,
      "start": 1508.1200256347656,
      "end": 1509.8400268554688,
      "text": " restore him."
    },
    {
      "id": 74,
      "start": 1509.8400268554688,
      "end": 1512.3600158691406,
      "text": " That's the biblical motto, by the way."
    },
    {
      "id": 75,
      "start": 1512.3600158691406,
      "end": 1513.3600158691406,
      "text": " Amen?"
    },
    {
      "id": 76,
      "start": 1513.3600158691406,
      "end": 1514.3600158691406,
      "text": " There is restoration."
    },
    {
      "id": 77,
      "start": 1514.3600158691406,
      "end": 1515.3600158691406,
      "text": " Why?"
    },
    {
      "id": 78,
      "start": 1515.3600158691406,
      "end": 1517.8000183105469,
      "text": " Because there is forgiveness."
    },
    {
      "id": 79,
      "start": 1517.8000183105469,
      "end": 1520.7400207519531,
      "text": " I'm so thankful that God is long-suffering."
    },
    {
      "id": 80,
      "start": 1520.7400207519531,
      "end": 1522.0800170898438,
      "text": " God is gracious."
    },
    {
      "id": 81,
      "start": 1522.0800170898438,
      "end": 1525.6000366210938,
      "text": " I'm thankful that Jonah had a second chance."
    },
    {
      "id": 82,
      "start": 1525.6000366210938,
      "end": 1528.3200073242188,
      "text": " Amen?"
    },
    {
      "id": 83,
      "start": 1528.3200073242188,
      "end": 1530.4800109863281,
      "text": " How many chances have we had?"
    },
    {
      "id": 84,
      "start": 1530.4800109863281,
      "end": 1532.9600219726562,
      "text": " How many times has God been long-suffering to us?"
    },
    {
      "id": 85,
      "start": 1532.9600219726562,
      "end": 1538.4800109863281,
      "text": " See, sometimes in our lives, we enjoy and appreciate when God is long-suffering to us,"
    },
    {
      "id": 86,
      "start": 1538.4800109863281,
      "end": 1540.7200317382812,
      "text": " but not when He's long-suffering to somebody else."
    },
    {
      "id": 87,
      "start": 1540.7200317382812,
      "end": 1543.8000183105469,
      "text": " Oh, God, judge them."
    },
    {
      "id": 88,
      "start": 1543.8000183105469,
      "end": 1546.3200073242188,
      "text": " You understand what I'm saying, right?"
    },
    {
      "id": 89,
      "start": 1546.3200073242188,
      "end": 1550.4000244140625,
      "text": " And notice Paul says, I've judged already, as though I were present concerning him that"
    },
    {
      "id": 90,
      "start": 1550.4000244140625,
      "end": 1553.7200317382812,
      "text": " hath so done this deed."
    },
    {
      "id": 91,
      "start": 1553.7200317382812,
      "end": 1558.0400085449219,
      "text": " Paul says, church, you need to judge this matter."
    },
    {
      "id": 92,
      "start": 1558.0400085449219,
      "end": 1563.0000305175781,
      "text": " There was a responsibility that they had with regard to this wicked behavior that was"
    },
    {
      "id": 93,
      "start": 1563.0000305175781,
      "end": 1565.1600341796875,
      "text": " commonly known among them."
    },
    {
      "id": 94,
      "start": 1565.1600341796875,
      "end": 1568.280029296875,
      "text": " Paul says, hey, what is wrong with you guys?"
    },
    {
      "id": 95,
      "start": 1568.280029296875,
      "end": 1572.1600341796875,
      "text": " I'm not even there in person, but I'm already given judgment."
    },
    {
      "id": 96,
      "start": 1572.1600341796875,
      "end": 1579.4800109863281,
      "text": " Because it's obvious that this is a violation to the standard of the Word of God."
    },
    {
      "id": 97,
      "start": 1579.4800109863281,
      "end": 1585.280029296875,
      "text": " So we find Paul's own behavior, his own practice, that is mentioned with regard to this subject"
    },
    {
      "id": 98,
      "start": 1585.280029296875,
      "end": 1587.1200256347656,
      "text": " matter of judgment."
    },
    {
      "id": 99,
      "start": 1587.2000122070312,
      "end": 1590.8400268554688,
      "text": " Now I want you to move into chapter number six, and I want you to notice what's taking"
    },
    {
      "id": 100,
      "start": 1590.8400268554688,
      "end": 1591.8400268554688,
      "text": " place."
    },
    {
      "id": 101,
      "start": 1591.8400268554688,
      "end": 1596.1200256347656,
      "text": " And really, the problem in the first several verses of 1 Corinthians chapter number six"
    },
    {
      "id": 102,
      "start": 1596.1200256347656,
      "end": 1601.6800231933594,
      "text": " that Paul is going to address is believers taking believers to court, and that before"
    },
    {
      "id": 103,
      "start": 1601.6800231933594,
      "end": 1603.0400085449219,
      "text": " unbelievers."
    },
    {
      "id": 104,
      "start": 1603.0400085449219,
      "end": 1607.4400329589844,
      "text": " The litigation amongst believers before unbelievers is what he's addressing."
    },
    {
      "id": 105,
      "start": 1607.4400329589844,
      "end": 1611.1600341796875,
      "text": " And notice what he says, and I'm going to read the first five verses, and then we're"
    },
    {
      "id": 106,
      "start": 1611.1600341796875,
      "end": 1615.1600341796875,
      "text": " going to go back and we're going to point out various statements that are made with"
    },
    {
      "id": 107,
      "start": 1615.1600341796875,
      "end": 1620.2000122070312,
      "text": " regard to the subject matter of judgment that we're dealing with this evening."
    },
    {
      "id": 108,
      "start": 1620.2000122070312,
      "end": 1626.1600341796875,
      "text": " Notice in verse number one, dare any of you, having a matter against another, go to law"
    },
    {
      "id": 109,
      "start": 1626.1600341796875,
      "end": 1630.6600341796875,
      "text": " before the unjust and not before the saints?"
    },
    {
      "id": 110,
      "start": 1630.6600341796875,
      "end": 1634.780029296875,
      "text": " Do ye not know that the saints shall judge the world?"
    },
    {
      "id": 111,
      "start": 1634.780029296875,
      "end": 1641.2400207519531,
      "text": " And if the world shall be judged by you, are ye unworthy to judge the smallest matters?"
    },
    {
      "id": 112,
      "start": 1641.2400207519531,
      "end": 1643.7200317382812,
      "text": " Know ye not that we shall judge angels?"
    },
    {
      "id": 113,
      "start": 1643.7200317382812,
      "end": 1646.6800231933594,
      "text": " How much more things that pertain to this life?"
    },
    {
      "id": 114,
      "start": 1646.6800231933594,
      "end": 1651.5600280761719,
      "text": " If then ye have judgments of things pertaining to this life, set them to judge who are least"
    },
    {
      "id": 115,
      "start": 1651.5600280761719,
      "end": 1652.8800354003906,
      "text": " esteemed in the church."
    },
    {
      "id": 116,
      "start": 1652.8800354003906,
      "end": 1655.280029296875,
      "text": " I speak to your shame."
    },
    {
      "id": 117,
      "start": 1655.280029296875,
      "end": 1658.6800231933594,
      "text": " Is it so that there is not a wise man among you?"
    },
    {
      "id": 118,
      "start": 1658.6800231933594,
      "end": 1665.0800170898438,
      "text": " No, not one that shall be able to judge between his brother, between his brethren."
    },
    {
      "id": 119,
      "start": 1665.0800170898438,
      "end": 1669.9400329589844,
      "text": " But brother goeth to law with brother, and that before the unbelievers."
    },
    {
      "id": 120,
      "start": 1669.9400329589844,
      "end": 1675.3400268554688,
      "text": " Now therefore there is utterly a fault among you, because ye go to law one with another."
    },
    {
      "id": 121,
      "start": 1675.3400268554688,
      "end": 1677.4800109863281,
      "text": " Why do you not rather take wrong?"
    },
    {
      "id": 122,
      "start": 1677.4800109863281,
      "end": 1679.9800109863281,
      "text": " Why do you not rather suffer yourselves to be defrauded?"
    },
    {
      "id": 123,
      "start": 1679.9800109863281,
      "end": 1683.4600219726562,
      "text": " Nay, ye do wrong and defraud, and that your brethren.\""
    },
    {
      "id": 124,
      "start": 1683.4600219726562,
      "end": 1688.7400207519531,
      "text": " Wow."
    },
    {
      "id": 125,
      "start": 1688.7400207519531,
      "end": 1694.1000366210938,
      "text": " Inspiration of the Holy Spirit of God to a local church dealing with the subject matter"
    },
    {
      "id": 126,
      "start": 1694.1000366210938,
      "end": 1695.9400329589844,
      "text": " of judgment."
    },
    {
      "id": 127,
      "start": 1695.9400329589844,
      "end": 1699.1800231933594,
      "text": " And notice what he says, I know I read all eight verses but I want to go back and I want"
    },
    {
      "id": 128,
      "start": 1699.1800231933594,
      "end": 1705.0600280761719,
      "text": " you to see and really break it down in the context of this subject matter of judgment."
    },
    {
      "id": 129,
      "start": 1705.0600280761719,
      "end": 1710.0600280761719,
      "text": " Notice what Paul says in verse number one, dare any of you having a matter against another"
    },
    {
      "id": 130,
      "start": 1710.0600280761719,
      "end": 1713.6200256347656,
      "text": " go to law before the unjust and not before the saints."
    },
    {
      "id": 131,
      "start": 1713.6200256347656,
      "end": 1714.6199951171875,
      "text": " So what's he saying?"
    },
    {
      "id": 132,
      "start": 1714.6199951171875,
      "end": 1715.6199951171875,
      "text": " There's a problem."
    },
    {
      "id": 133,
      "start": 1715.6199951171875,
      "end": 1718.5800170898438,
      "text": " There's some kind of an issue between people in the church."
    },
    {
      "id": 134,
      "start": 1718.5800170898438,
      "end": 1724.760009765625,
      "text": " And so Armando has a problem with Ron and they can't sort this thing out and so they're"
    },
    {
      "id": 135,
      "start": 1724.760009765625,
      "end": 1730.2400512695312,
      "text": " going to take one another to court and they're going to go before the unbelievers."
    },
    {
      "id": 136,
      "start": 1730.2400512695312,
      "end": 1732.7200317382812,
      "text": " Paul says, are you kidding me?"
    },
    {
      "id": 137,
      "start": 1732.7200317382812,
      "end": 1736.8800048828125,
      "text": " I mean it's not there in the English, it's somewhere in the Greek, amen, I'm just teasing."
    },
    {
      "id": 138,
      "start": 1736.8800048828125,
      "end": 1737.8800048828125,
      "text": " But it's not there."
    },
    {
      "id": 139,
      "start": 1737.8800048828125,
      "end": 1741.280029296875,
      "text": " But notice what he says, I mean if you read this text of scripture it's almost like Paul"
    },
    {
      "id": 140,
      "start": 1741.280029296875,
      "end": 1744.0599975585938,
      "text": " is saying, are you guys kidding me?"
    },
    {
      "id": 141,
      "start": 1744.0599975585938,
      "end": 1746.9400024414062,
      "text": " This is really what you're doing?"
    },
    {
      "id": 142,
      "start": 1746.9400024414062,
      "end": 1751.9600219726562,
      "text": " And so no, he says listen, you're going before the unjust and not before the saints?"
    },
    {
      "id": 143,
      "start": 1751.9600219726562,
      "end": 1754.4400024414062,
      "text": " Oh wait, this is a different approach."
    },
    {
      "id": 144,
      "start": 1754.4400024414062,
      "end": 1755.8400268554688,
      "text": " This is a different understanding."
    },
    {
      "id": 145,
      "start": 1755.8400268554688,
      "end": 1762.0400390625,
      "text": " So we're supposed to bring this matter before the saints so that the saints can do what?"
    },
    {
      "id": 146,
      "start": 1762.0400390625,
      "end": 1764.1400146484375,
      "text": " Judge."
    },
    {
      "id": 147,
      "start": 1764.1400146484375,
      "end": 1766.2000122070312,
      "text": " What happened to Matthew 7.1?"
    },
    {
      "id": 148,
      "start": 1766.2000122070312,
      "end": 1767.2000122070312,
      "text": " Is there a contradiction?"
    },
    {
      "id": 149,
      "start": 1767.2000122070312,
      "end": 1771.1600341796875,
      "text": " No, there's no contradiction at all."
    },
    {
      "id": 150,
      "start": 1771.1600341796875,
      "end": 1777.2000122070312,
      "text": " He says judge not that ye be not judged and he says this, you're judging this common susceptibility."
    },
    {
      "id": 151,
      "start": 1777.2000122070312,
      "end": 1781.4000244140625,
      "text": " You're judging, it's exposed, you're judging others but you're not judging yourself."
    },
    {
      "id": 152,
      "start": 1781.4000244140625,
      "end": 1785.800048828125,
      "text": " You're worried about some little speck in somebody's eye and you're not concerned about"
    },
    {
      "id": 153,
      "start": 1785.800048828125,
      "end": 1789.3600463867188,
      "text": " the beam that's in your own eye and you're a hypocrite."
    },
    {
      "id": 154,
      "start": 1789.3600463867188,
      "end": 1792.4000244140625,
      "text": " You're not using a consistent standard, it's exposed."
    },
    {
      "id": 155,
      "start": 1792.4000244140625,
      "end": 1797.3600463867188,
      "text": " But then as you study the whole of scripture, God is saying listen, the believers are to"
    },
    {
      "id": 156,
      "start": 1797.3600463867188,
      "end": 1801.6400146484375,
      "text": " judge."
    },
    {
      "id": 157,
      "start": 1801.6400146484375,
      "end": 1802.0400390625,
      "text": " But how do you judge?"
    },
    {
      "id": 0,
      "start": 1802.0400390625,
      "end": 1803.7600390911102,
      "text": " What do they judge?"
    },
    {
      "id": 1,
      "start": 1803.7600390911102,
      "end": 1809.1000390052795,
      "text": " They judge with a proper standard, it's essential."
    },
    {
      "id": 2,
      "start": 1809.1000390052795,
      "end": 1817.6400394439697,
      "text": " And they judge righteous judgment, and the purpose, the goal, is restoration."
    },
    {
      "id": 3,
      "start": 1817.6400394439697,
      "end": 1818.6400394439697,
      "text": " That's the goal."
    },
    {
      "id": 4,
      "start": 1818.6400394439697,
      "end": 1822.5600395202637,
      "text": " So we find in verse number two, he says this, notice what he says,"
    },
    {
      "id": 5,
      "start": 1822.5600395202637,
      "end": 1830.8400382995605,
      "text": " Do ye not know that the saints shall judge the world?"
    },
    {
      "id": 6,
      "start": 1830.8400382995605,
      "end": 1833.4400386810303,
      "text": " You're unaware of this, the saints are going to judge the world."
    },
    {
      "id": 7,
      "start": 1833.4400386810303,
      "end": 1837.600040435791,
      "text": " He's really referring to Revelation, and we can read that in Revelation 20."
    },
    {
      "id": 8,
      "start": 1837.600040435791,
      "end": 1844.600040435791,
      "text": " But he says this, and if the world shall be judged by you, are ye unworthy to judge the"
    },
    {
      "id": 9,
      "start": 1844.600040435791,
      "end": 1848.1600379943848,
      "text": " smallest matters?"
    },
    {
      "id": 10,
      "start": 1848.1600379943848,
      "end": 1853.5600395202637,
      "text": " So do you not know, you're not yet been informed, you're not aware of the fact, or at least"
    },
    {
      "id": 11,
      "start": 1853.5600395202637,
      "end": 1857.9600372314453,
      "text": " you're not considering it within the context of what's going on, that you're going to judge"
    },
    {
      "id": 12,
      "start": 1857.9600372314453,
      "end": 1859.1600379943848,
      "text": " the world."
    },
    {
      "id": 13,
      "start": 1859.1600379943848,
      "end": 1863.2400398254395,
      "text": " And if you're going to judge the world, do you mean to tell me that you're unworthy to"
    },
    {
      "id": 14,
      "start": 1863.2400398254395,
      "end": 1866.0000381469727,
      "text": " judge the smallest matters?"
    },
    {
      "id": 15,
      "start": 1866.0000381469727,
      "end": 1869.2800369262695,
      "text": " This is blowing Paul's mind."
    },
    {
      "id": 16,
      "start": 1869.2800369262695,
      "end": 1873.640037536621,
      "text": " He says in verse number three, Know ye not that we shall judge angels?"
    },
    {
      "id": 17,
      "start": 1873.640037536621,
      "end": 1875.2400360107422,
      "text": " Wow."
    },
    {
      "id": 18,
      "start": 1875.2400360107422,
      "end": 1877.5600357055664,
      "text": " Not only the world, but then the angels."
    },
    {
      "id": 19,
      "start": 1877.5600357055664,
      "end": 1885.3600387573242,
      "text": " And it says this in verse number three, How much more things that pertain to this life?"
    },
    {
      "id": 20,
      "start": 1885.3600387573242,
      "end": 1888.7600402832031,
      "text": " These matters that Paul is talking about, he's saying, listen, if we're going to judge"
    },
    {
      "id": 21,
      "start": 1888.7600402832031,
      "end": 1893.2000427246094,
      "text": " the world and we're going to judge angels, how much more things that pertain to this"
    },
    {
      "id": 22,
      "start": 1893.2000427246094,
      "end": 1894.2000427246094,
      "text": " life?"
    },
    {
      "id": 23,
      "start": 1894.2000427246094,
      "end": 1899.1200408935547,
      "text": " Now again, keeping it all within context and interpreting Scripture with Scripture, it's"
    },
    {
      "id": 24,
      "start": 1899.1200408935547,
      "end": 1904.440040588379,
      "text": " not running around that we're the Baptist police judging everybody and hitting everybody"
    },
    {
      "id": 25,
      "start": 1904.440040588379,
      "end": 1908.0800399780273,
      "text": " upside the head with a club and saying, you didn't do this and you didn't do that."
    },
    {
      "id": 26,
      "start": 1908.0800399780273,
      "end": 1909.0800399780273,
      "text": " And you have this."
    },
    {
      "id": 27,
      "start": 1909.0800399780273,
      "end": 1910.0800399780273,
      "text": " No, no, no."
    },
    {
      "id": 28,
      "start": 1910.0800399780273,
      "end": 1912.8400421142578,
      "text": " I'm first using the Bible in my own life."
    },
    {
      "id": 29,
      "start": 1912.8400421142578,
      "end": 1917.0000381469727,
      "text": " And by the way, if we'd all do that, it'd be a whole lot better."
    },
    {
      "id": 30,
      "start": 1917.0000381469727,
      "end": 1918.3200378417969,
      "text": " Amen."
    },
    {
      "id": 31,
      "start": 1918.3200378417969,
      "end": 1922.2000427246094,
      "text": " Honestly, maybe a whole lot better."
    },
    {
      "id": 32,
      "start": 1922.2000427246094,
      "end": 1929.640037536621,
      "text": " But for those that don't, God says, listen, within the household of God, within the believers,"
    },
    {
      "id": 33,
      "start": 1929.640037536621,
      "end": 1933.280044555664,
      "text": " we're to judge these matters."
    },
    {
      "id": 34,
      "start": 1933.280044555664,
      "end": 1939.280044555664,
      "text": " Notice what he says in verse number four, If then ye have judgments of things pertaining"
    },
    {
      "id": 35,
      "start": 1939.280044555664,
      "end": 1946.1600341796875,
      "text": " to this life, set them to judge who are least esteemed in the church."
    },
    {
      "id": 36,
      "start": 1946.1600341796875,
      "end": 1952.3600463867188,
      "text": " And then he says this in verse number five, I speak to your shame."
    },
    {
      "id": 37,
      "start": 1952.3600463867188,
      "end": 1953.3600463867188,
      "text": " Wow."
    },
    {
      "id": 38,
      "start": 1953.3600463867188,
      "end": 1958.4800415039062,
      "text": " You know, those are powerful words."
    },
    {
      "id": 39,
      "start": 1958.4800415039062,
      "end": 1965.520034790039,
      "text": " Paul says, as we would read in 1 Corinthians 11, as you would enter into the passage of"
    },
    {
      "id": 40,
      "start": 1965.520034790039,
      "end": 1971.3600463867188,
      "text": " Scripture that we typically use for the Lord's Supper, on two occasions in verse 17 and verse"
    },
    {
      "id": 41,
      "start": 1971.3600463867188,
      "end": 1975.6400451660156,
      "text": " number 22, he says, I praise you not, because of their behavior."
    },
    {
      "id": 42,
      "start": 1975.6400451660156,
      "end": 1977.6800384521484,
      "text": " They were doing things in an inappropriate way."
    },
    {
      "id": 43,
      "start": 1977.6800384521484,
      "end": 1979.4400329589844,
      "text": " He says, I praise you not."
    },
    {
      "id": 44,
      "start": 1979.4400329589844,
      "end": 1982.280044555664,
      "text": " Here he says this, I speak to your shame."
    },
    {
      "id": 45,
      "start": 1982.280044555664,
      "end": 1987.560043334961,
      "text": " Now, if someone says that to you, it doesn't cause you to feel real good about yourself."
    },
    {
      "id": 46,
      "start": 1987.6400451660156,
      "end": 1990.3600463867188,
      "text": " I speak to your shame."
    },
    {
      "id": 47,
      "start": 1990.3600463867188,
      "end": 1991.520034790039,
      "text": " Notice what he's referring to."
    },
    {
      "id": 48,
      "start": 1991.520034790039,
      "end": 1999.4000396728516,
      "text": " Notice in verse number five, Is it so that there is not a wise man among you?"
    },
    {
      "id": 49,
      "start": 1999.4000396728516,
      "end": 2006.1600341796875,
      "text": " No, not one that shall be able to judge between his brethren."
    },
    {
      "id": 50,
      "start": 2006.1600341796875,
      "end": 2010.8800354003906,
      "text": " Do you see what I mean when I say that it's as if Paul's mind is being blown?"
    },
    {
      "id": 51,
      "start": 2010.8800354003906,
      "end": 2018.520034790039,
      "text": " He's like, seriously, there's no one that can judge between these matters?"
    },
    {
      "id": 52,
      "start": 2018.520034790039,
      "end": 2024.3200378417969,
      "text": " That believers are taking the matter before unbelievers?"
    },
    {
      "id": 53,
      "start": 2024.3200378417969,
      "end": 2026.6400451660156,
      "text": " Paul says, I speak this to your shame."
    },
    {
      "id": 54,
      "start": 2026.6400451660156,
      "end": 2031.9200439453125,
      "text": " Again, he's not offering them some level of commendation."
    },
    {
      "id": 55,
      "start": 2031.9200439453125,
      "end": 2033.7600402832031,
      "text": " He's saying, I'm speaking to your shame."
    },
    {
      "id": 56,
      "start": 2033.7600402832031,
      "end": 2038.8400421142578,
      "text": " This is unfortunate that in a local church there in Corinth, that there was not a wise"
    },
    {
      "id": 57,
      "start": 2038.8400421142578,
      "end": 2042.800033569336,
      "text": " man among them that could judge between the brethren."
    },
    {
      "id": 58,
      "start": 2042.800033569336,
      "end": 2049.6800384521484,
      "text": " But instead, what was happening was brother was going to law with brother and that before"
    },
    {
      "id": 59,
      "start": 2049.6800384521484,
      "end": 2050.6800384521484,
      "text": " the unbelievers."
    },
    {
      "id": 60,
      "start": 2050.6800384521484,
      "end": 2057.6000366210938,
      "text": " Can you imagine how messy that is and how terrible that is for the name of Christ and"
    },
    {
      "id": 61,
      "start": 2057.6000366210938,
      "end": 2061.2000427246094,
      "text": " for the cause of Christ?"
    },
    {
      "id": 62,
      "start": 2061.2000427246094,
      "end": 2067.2000427246094,
      "text": " Believers that are to be understanding of the importance of forgiveness and restoration"
    },
    {
      "id": 63,
      "start": 2067.2000427246094,
      "end": 2072.8800354003906,
      "text": " and so on and so forth, they're standing before lost people who were supposed to reach"
    },
    {
      "id": 64,
      "start": 2072.8800354003906,
      "end": 2078.1200256347656,
      "text": " with the gospel, by the way, and they're attacking each other on whatever the matter is and why"
    },
    {
      "id": 65,
      "start": 2078.1200256347656,
      "end": 2082.6000366210938,
      "text": " they're right and they're wrong and vice versa."
    },
    {
      "id": 66,
      "start": 2082.6000366210938,
      "end": 2084.080047607422,
      "text": " Can you see the picture in your mind's eye?"
    },
    {
      "id": 67,
      "start": 2084.080047607422,
      "end": 2085.080047607422,
      "text": " You understand what's taking place?"
    },
    {
      "id": 68,
      "start": 2085.080047607422,
      "end": 2087.2000427246094,
      "text": " Haven't you been in a court?"
    },
    {
      "id": 69,
      "start": 2087.2000427246094,
      "end": 2090.760040283203,
      "text": " I know some of you are in court often."
    },
    {
      "id": 70,
      "start": 2090.760040283203,
      "end": 2096.0400390625,
      "text": " Not because you're, that's not a bad man."
    },
    {
      "id": 71,
      "start": 2096.0400390625,
      "end": 2100.1200256347656,
      "text": " Because you're lawyers, because you're police officers, okay?"
    },
    {
      "id": 72,
      "start": 2100.1200256347656,
      "end": 2101.1200256347656,
      "text": " Listen to the whole statement."
    },
    {
      "id": 73,
      "start": 2101.1200256347656,
      "end": 2105.4400329589844,
      "text": " Somebody's going to take that little excerpt from the online YouTube and they're going"
    },
    {
      "id": 74,
      "start": 2105.4400329589844,
      "end": 2106.8800354003906,
      "text": " to just, man, it's going to be a mess."
    },
    {
      "id": 75,
      "start": 2106.8800354003906,
      "end": 2108.760040283203,
      "text": " I'm just teasing."
    },
    {
      "id": 76,
      "start": 2108.760040283203,
      "end": 2111.2400512695312,
      "text": " But we're familiar, right?"
    },
    {
      "id": 77,
      "start": 2111.2400512695312,
      "end": 2115.280029296875,
      "text": " Courtrooms typically are not pleasant places."
    },
    {
      "id": 78,
      "start": 2115.280029296875,
      "end": 2119.0400390625,
      "text": " It's ugly, right?"
    },
    {
      "id": 79,
      "start": 2119.0400390625,
      "end": 2121.8400268554688,
      "text": " Attacking."
    },
    {
      "id": 80,
      "start": 2121.8400268554688,
      "end": 2124.760040283203,
      "text": " Notice what Paul says."
    },
    {
      "id": 81,
      "start": 2124.760040283203,
      "end": 2131.4800415039062,
      "text": " Now therefore, verse 7, there is utterly a fault among you."
    },
    {
      "id": 82,
      "start": 2131.4800415039062,
      "end": 2133.000030517578,
      "text": " He said, I speak to your shame."
    },
    {
      "id": 83,
      "start": 2133.000030517578,
      "end": 2136.4800415039062,
      "text": " Now he says there is utterly a fault among you."
    },
    {
      "id": 84,
      "start": 2136.4800415039062,
      "end": 2137.4800415039062,
      "text": " Why?"
    },
    {
      "id": 85,
      "start": 2137.4800415039062,
      "end": 2139.000030517578,
      "text": " Because you go to law one with another."
    },
    {
      "id": 86,
      "start": 2139.000030517578,
      "end": 2140.4000244140625,
      "text": " And then he says this."
    },
    {
      "id": 87,
      "start": 2140.4000244140625,
      "end": 2142.6400451660156,
      "text": " He gives them a different perspective."
    },
    {
      "id": 88,
      "start": 2142.6400451660156,
      "end": 2145.4000244140625,
      "text": " Why do you not rather take wrong?"
    },
    {
      "id": 89,
      "start": 2145.4000244140625,
      "end": 2148.7200317382812,
      "text": " Why do you not rather suffer yourselves to be defrauded?"
    },
    {
      "id": 90,
      "start": 2148.7200317382812,
      "end": 2153.1600341796875,
      "text": " Nay you do wrong and defraud and that your brethren, and obviously it's a perspective"
    },
    {
      "id": 91,
      "start": 2153.1600341796875,
      "end": 2157.1600341796875,
      "text": " there in verses 7 and 8 that's really outside of the discussion this evening with regard"
    },
    {
      "id": 92,
      "start": 2157.1600341796875,
      "end": 2164.520050048828,
      "text": " to judgment, but taking the wrong and being defrauded for the sake of really the gospel"
    },
    {
      "id": 93,
      "start": 2164.520050048828,
      "end": 2167.4400329589844,
      "text": " and unity and what have you."
    },
    {
      "id": 94,
      "start": 2167.4400329589844,
      "end": 2171.4800415039062,
      "text": " But I want you to really focus on the first six verses of 1 Corinthians chapter number"
    },
    {
      "id": 95,
      "start": 2171.4800415039062,
      "end": 2172.4800415039062,
      "text": " 6."
    },
    {
      "id": 96,
      "start": 2172.4800415039062,
      "end": 2176.9200439453125,
      "text": " And as we take what Paul says in the fifth chapter about the matter, the problem that's"
    },
    {
      "id": 97,
      "start": 2176.9200439453125,
      "end": 2182.300048828125,
      "text": " being exposed and explained in Corinth, and then Paul says, I've already judged."
    },
    {
      "id": 98,
      "start": 2182.4400329589844,
      "end": 2187.8600463867188,
      "text": " I'm not even there in person, physically, but I've heard about what's going on and I've"
    },
    {
      "id": 99,
      "start": 2187.8600463867188,
      "end": 2189.1800537109375,
      "text": " already given judgment."
    },
    {
      "id": 100,
      "start": 2189.1800537109375,
      "end": 2190.1800537109375,
      "text": " Why?"
    },
    {
      "id": 101,
      "start": 2190.1800537109375,
      "end": 2193.080047607422,
      "text": " Because we have the standard of the Word of God."
    },
    {
      "id": 102,
      "start": 2193.080047607422,
      "end": 2198.500030517578,
      "text": " He then deals with the problem in Corinth where they're going to court one against another,"
    },
    {
      "id": 103,
      "start": 2198.500030517578,
      "end": 2203.6600341796875,
      "text": " brethren, amongst unbelievers, and he says, there's not a wise man among you that can"
    },
    {
      "id": 104,
      "start": 2203.6600341796875,
      "end": 2204.6600341796875,
      "text": " judge between us."
    },
    {
      "id": 105,
      "start": 2204.6600341796875,
      "end": 2206.3800354003906,
      "text": " You're going to judge the world?"
    },
    {
      "id": 106,
      "start": 2206.3800354003906,
      "end": 2211.5400390625,
      "text": " You're going to judge angels and you can't judge these small matters?"
    },
    {
      "id": 107,
      "start": 2211.5400390625,
      "end": 2217.2200317382812,
      "text": " And so begin to think about the subject matter of judgment."
    },
    {
      "id": 108,
      "start": 2217.2200317382812,
      "end": 2223.820037841797,
      "text": " I would say this in conclusion, we need to be careful about how we judge."
    },
    {
      "id": 109,
      "start": 2223.820037841797,
      "end": 2228.020050048828,
      "text": " Because he says, judge not that ye be not judged, and then he continues and says, with"
    },
    {
      "id": 110,
      "start": 2228.020050048828,
      "end": 2234.2200317382812,
      "text": " what judgment ye judge, ye shall be judged."
    },
    {
      "id": 111,
      "start": 2234.2200317382812,
      "end": 2235.780029296875,
      "text": " Amen?"
    },
    {
      "id": 112,
      "start": 2235.780029296875,
      "end": 2243.6600341796875,
      "text": " We must understand first, in Matthew 7 and verse number 5, that we must examine ourselves."
    },
    {
      "id": 113,
      "start": 2243.6600341796875,
      "end": 2246.500030517578,
      "text": " That we must ask God to help us."
    },
    {
      "id": 114,
      "start": 2246.500030517578,
      "end": 2252.7400512695312,
      "text": " That we avoid that which is exposed in those verses of Scripture and perfectly, beautifully"
    },
    {
      "id": 115,
      "start": 2252.7400512695312,
      "end": 2259.560028076172,
      "text": " illustrated by the Lord Jesus Christ, that we would avoid that common nature of humans"
    },
    {
      "id": 116,
      "start": 2259.560028076172,
      "end": 2264.3400268554688,
      "text": " to judge others while ignoring our own behavior."
    },
    {
      "id": 117,
      "start": 2264.3400268554688,
      "end": 2269.5400390625,
      "text": " To examine and to criticize and to seek to correct someone else while all at the same"
    },
    {
      "id": 118,
      "start": 2269.5400390625,
      "end": 2272.7000427246094,
      "text": " time we act as if we live above it."
    },
    {
      "id": 119,
      "start": 2272.7000427246094,
      "end": 2274.8600463867188,
      "text": " No, no."
    },
    {
      "id": 120,
      "start": 2274.8600463867188,
      "end": 2276.4800415039062,
      "text": " That's not appropriate."
    },
    {
      "id": 121,
      "start": 2276.4800415039062,
      "end": 2278.580047607422,
      "text": " That's not how we should behave."
    },
    {
      "id": 122,
      "start": 2278.580047607422,
      "end": 2289.9400329589844,
      "text": " And if we take the time to daily examine ourselves and ask God to search us, to reveal in us"
    },
    {
      "id": 123,
      "start": 2289.9400329589844,
      "end": 2297.4200439453125,
      "text": " the mote, the beam that's spoken of, that would take so much of our time that we won't"
    },
    {
      "id": 124,
      "start": 2297.4200439453125,
      "end": 2302.060028076172,
      "text": " have the time to run around and judge everybody else."
    },
    {
      "id": 125,
      "start": 2302.060028076172,
      "end": 2310.500030517578,
      "text": " But he says, then, in verse number 5 of Matthew 7, after we've done that, God may use us to"
    },
    {
      "id": 126,
      "start": 2310.500030517578,
      "end": 2316.780029296875,
      "text": " help provide guidance and restoration in the life of someone else."
    },
    {
      "id": 127,
      "start": 2316.780029296875,
      "end": 2321.1000366210938,
      "text": " Listen, we don't live in a perfect world."
    },
    {
      "id": 128,
      "start": 2321.1000366210938,
      "end": 2322.3400268554688,
      "text": " One day we will."
    },
    {
      "id": 129,
      "start": 2322.3400268554688,
      "end": 2324.5800170898438,
      "text": " Isn't that awesome?"
    },
    {
      "id": 130,
      "start": 2324.5800170898438,
      "end": 2327.820068359375,
      "text": " One day we're going to be with the Lord for all of eternity."
    },
    {
      "id": 131,
      "start": 2327.820068359375,
      "end": 2331.6600341796875,
      "text": " But right now we don't live in a perfect world."
    },
    {
      "id": 132,
      "start": 2331.6600341796875,
      "end": 2336.4600219726562,
      "text": " And in this world that's not perfect, there's problems."
    },
    {
      "id": 133,
      "start": 2336.4600219726562,
      "end": 2341.6600341796875,
      "text": " And there's divisions and schisms and there's things that happen."
    },
    {
      "id": 134,
      "start": 2341.6600341796875,
      "end": 2348.56005859375,
      "text": " And he says, the spiritual one is to be able to judge."
    },
    {
      "id": 135,
      "start": 2348.56005859375,
      "end": 2351.1400146484375,
      "text": " Did Moses judge?"
    },
    {
      "id": 136,
      "start": 2351.1400146484375,
      "end": 2353.5800170898438,
      "text": " He did."
    },
    {
      "id": 137,
      "start": 2353.5800170898438,
      "end": 2357.8600463867188,
      "text": " Jethro said, this is no good."
    },
    {
      "id": 138,
      "start": 2357.8600463867188,
      "end": 2359.800048828125,
      "text": " Why?"
    },
    {
      "id": 139,
      "start": 2359.800048828125,
      "end": 2362.1400146484375,
      "text": " It's consuming you."
    },
    {
      "id": 140,
      "start": 2362.1400146484375,
      "end": 2364.9400634765625,
      "text": " So what do they do?"
    },
    {
      "id": 141,
      "start": 2364.9400634765625,
      "end": 2369.5400390625,
      "text": " They got other men that would be able to judge the smaller matters."
    },
    {
      "id": 142,
      "start": 2369.5400390625,
      "end": 2370.5400390625,
      "text": " Right?"
    },
    {
      "id": 143,
      "start": 2371.5400390625,
      "end": 2372.5400390625,
      "text": " That's what happened in the Old Testament, right?"
    },
    {
      "id": 144,
      "start": 2372.5400390625,
      "end": 2375.820068359375,
      "text": " We don't have time to go, it's 656, we don't have time to go back there and look at all"
    },
    {
      "id": 145,
      "start": 2375.820068359375,
      "end": 2376.820068359375,
      "text": " of it."
    },
    {
      "id": 146,
      "start": 2376.820068359375,
      "end": 2379.9000244140625,
      "text": " But you understand, that's what happened in the Old Testament."
    },
    {
      "id": 147,
      "start": 2379.9000244140625,
      "end": 2385.1800537109375,
      "text": " And they got these people involved, these spiritual people involved that could take"
    },
    {
      "id": 148,
      "start": 2385.1800537109375,
      "end": 2390.5400390625,
      "text": " the Word of God, the truth that God had given at that particular time, and say, here, this"
    },
    {
      "id": 149,
      "start": 2390.5400390625,
      "end": 2394.3800659179688,
      "text": " is the standard by which we judge."
    },
    {
      "id": 150,
      "start": 2394.3800659179688,
      "end": 2395.3800659179688,
      "text": " Right?"
    },
    {
      "id": 151,
      "start": 2395.3800659179688,
      "end": 2396.9400634765625,
      "text": " That's what happened."
    },
    {
      "id": 152,
      "start": 2396.9400634765625,
      "end": 2401.1000366210938,
      "text": " And so we find that as we come to the New Testament, and Jesus says, judge not, there"
    },
    {
      "id": 153,
      "start": 2401.1000366210938,
      "end": 2402.1000366210938,
      "text": " in Matthew chapter number 6."
    },
    {
      "id": 0,
      "start": 2402.1000366210938,
      "end": 2407.5800366401672,
      "text": " 7, it's not the way that people use it today running around saying, you guys can't judge"
    },
    {
      "id": 1,
      "start": 2407.5800366401672,
      "end": 2408.5800366401672,
      "text": " me."
    },
    {
      "id": 2,
      "start": 2408.5800366401672,
      "end": 2411.260036468506,
      "text": " The Bible says judge not."
    },
    {
      "id": 3,
      "start": 2411.260036468506,
      "end": 2416.7800369262695,
      "text": " Read the whole context and understand the entirety of God's Word."
    },
    {
      "id": 4,
      "start": 2416.7800369262695,
      "end": 2421.8600368499756,
      "text": " Now if you're running around judging people and you're not letting God judge you, and"
    },
    {
      "id": 5,
      "start": 2421.8600368499756,
      "end": 2427.1000366210938,
      "text": " you're not using this book as a standard in your life, thou hypocrite."
    },
    {
      "id": 6,
      "start": 2427.1000366210938,
      "end": 2430.6200370788574,
      "text": " That's what the Bible says."
    },
    {
      "id": 7,
      "start": 2430.6200370788574,
      "end": 2436.300037384033,
      "text": " And so we first use God's Word to examine ourselves."
    },
    {
      "id": 8,
      "start": 2436.300037384033,
      "end": 2439.260036468506,
      "text": " God, I want to please you with my life."
    },
    {
      "id": 9,
      "start": 2439.260036468506,
      "end": 2440.260036468506,
      "text": " How do I do that?"
    },
    {
      "id": 10,
      "start": 2440.260036468506,
      "end": 2441.820037841797,
      "text": " What do I do?"
    },
    {
      "id": 11,
      "start": 2441.820037841797,
      "end": 2447.6000366210938,
      "text": " Oh, when the Word of God is read in your daily devotions, when the Word of God is preached,"
    },
    {
      "id": 12,
      "start": 2447.6000366210938,
      "end": 2451.4600372314453,
      "text": " when we hear it in whatever context we hear it, we sit around a table and have fellowship"
    },
    {
      "id": 13,
      "start": 2451.4600372314453,
      "end": 2455.1800384521484,
      "text": " and maybe there's some spiritual conversation that's taking place and the Word of God is"
    },
    {
      "id": 14,
      "start": 2455.1800384521484,
      "end": 2459.300037384033,
      "text": " used and God pricks our heart with regard to something that needs to be dealt with in"
    },
    {
      "id": 15,
      "start": 2459.300037384033,
      "end": 2461.6600379943848,
      "text": " our lives, we deal with it."
    },
    {
      "id": 16,
      "start": 2461.6600379943848,
      "end": 2465.58003616333,
      "text": " And we know that with Him there's forgiveness and there's restoration."
    },
    {
      "id": 17,
      "start": 2465.58003616333,
      "end": 2467.220039367676,
      "text": " We can rejoice in that."
    },
    {
      "id": 18,
      "start": 2467.220039367676,
      "end": 2472.5800399780273,
      "text": " But just as there's forgiveness and restoration for me, there's forgiveness and restoration"
    },
    {
      "id": 19,
      "start": 2472.5800399780273,
      "end": 2473.5800399780273,
      "text": " for everyone else."
    },
    {
      "id": 20,
      "start": 2473.5800399780273,
      "end": 2474.5800399780273,
      "text": " Isn't that awesome?"
    },
    {
      "id": 21,
      "start": 2474.5800399780273,
      "end": 2478.9400329589844,
      "text": " And we've got to be so thankful for that."
    },
    {
      "id": 22,
      "start": 2478.9400329589844,
      "end": 2485.5400390625,
      "text": " So I hope as we look at the context of Matthew 7, 1 through 5, coupled with 1 Corinthians"
    },
    {
      "id": 23,
      "start": 2485.5400390625,
      "end": 2491.6600341796875,
      "text": " 5 and 6, it helps us to have a better understanding of this portion of Scripture and so often"
    },
    {
      "id": 24,
      "start": 2491.6600341796875,
      "end": 2495.920036315918,
      "text": " what we hear people saying to us today of judge not."
    },
    {
      "id": 25,
      "start": 2495.920036315918,
      "end": 2504.260040283203,
      "text": " I'm thankful that God's given us a standard, a standard that is perfect."
    },
    {
      "id": 26,
      "start": 2504.260040283203,
      "end": 2507.020034790039,
      "text": " See you're not perfect and neither am I."
    },
    {
      "id": 27,
      "start": 2507.020034790039,
      "end": 2513.6600341796875,
      "text": " How many times even in a court of law the judge rules in a certain way and you say,"
    },
    {
      "id": 28,
      "start": 2513.6600341796875,
      "end": 2518.6600341796875,
      "text": " how did they rule that way?"
    },
    {
      "id": 29,
      "start": 2518.6600341796875,
      "end": 2525.9000396728516,
      "text": " This book is perfect and when we use this book we can have righteous judgment."
    },
    {
      "id": 30,
      "start": 2525.9000396728516,
      "end": 2526.9000396728516,
      "text": " Let's pray."
    },
    {
      "id": 31,
      "start": 2526.9000396728516,
      "end": 2527.9000396728516,
      "text": " Father we love You."
    },
    {
      "id": 32,
      "start": 2527.9000396728516,
      "end": 2528.9000396728516,
      "text": " We thank You for loving us."
    },
    {
      "id": 33,
      "start": 2528.9000396728516,
      "end": 2533.1800384521484,
      "text": " We thank You for the truth of Your Word, for the power of Your Word."
    },
    {
      "id": 34,
      "start": 2533.1800384521484,
      "end": 2541.9800415039062,
      "text": " God I pray that we'd leave here this evening not with a misunderstanding that we're to"
    },
    {
      "id": 35,
      "start": 2541.9800415039062,
      "end": 2546.260040283203,
      "text": " go out and judge everybody."
    },
    {
      "id": 36,
      "start": 2546.260040283203,
      "end": 2555.080032348633,
      "text": " Lord help us to have a proper understanding that there's this balance and that first Lord"
    },
    {
      "id": 37,
      "start": 2555.080032348633,
      "end": 2561.280029296875,
      "text": " we would come humbly before Thy throne and ask You to examine us and that we'd examine"
    },
    {
      "id": 38,
      "start": 2561.280029296875,
      "end": 2569.020034790039,
      "text": " ourselves by the right standard, the Word of God."
    },
    {
      "id": 39,
      "start": 2569.020034790039,
      "end": 2575.4200439453125,
      "text": " And that we'd be honest and we'd be humble before You and before Your Word."
    },
    {
      "id": 40,
      "start": 2575.4200439453125,
      "end": 2582.3800354003906,
      "text": " God You'd help us to deal with any sin in our lives that needs to be dealt with."
    },
    {
      "id": 41,
      "start": 2582.3800354003906,
      "end": 2594.2000427246094,
      "text": " Lord that You'd help us to please You that we would not be hypocrites."
    },
    {
      "id": 42,
      "start": 2594.2000427246094,
      "end": 2600.6800384521484,
      "text": " Lord I pray that You would use us to help others in their spiritual journey."
    },
    {
      "id": 43,
      "start": 2600.6800384521484,
      "end": 2606.1200408935547,
      "text": " Not in a condemning or condescending type of a way but in a way of trying to help and"
    },
    {
      "id": 44,
      "start": 2606.1200408935547,
      "end": 2615.240036010742,
      "text": " to provide sweet fellowship, forgiveness and restoration."
    },
    {
      "id": 45,
      "start": 2615.240036010742,
      "end": 2621.6800384521484,
      "text": " Lord I pray that You'd help us to take truth from Your Word tonight that would help us"
    },
    {
      "id": 46,
      "start": 2621.760040283203,
      "end": 2624.280029296875,
      "text": " in our daily behavior."
    },
    {
      "id": 47,
      "start": 2624.280029296875,
      "end": 2628.080032348633,
      "text": " We pray that in these moments of invitation that You'd have Your will in way."
    },
    {
      "id": 48,
      "start": 2628.080032348633,
      "end": 2631.1200408935547,
      "text": " We pray that decisions would be made that would please Thee and we'll thank You for"
    },
    {
      "id": 49,
      "start": 2631.1200408935547,
      "end": 2632.800033569336,
      "text": " it in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T11:38:35.197986"
}