{
  "video_id": "lIjfy9mcNI0",
  "text": "Number 11, 1 Corinthians chapter number 11. As you see this evening, we will observe the Lord's Supper. And this is one of two ordinances for the local church. I'm thankful that God in his omniscience that he gave to the local church, the ordinance of baptism, believers baptism by immersion, and then also the ordinance of the Lord's Supper. It's important that we understand the biblical foundation that God has given us for these two ordinances. We understand that baptism cannot save you the same fashion, these elements that we will partake of at the end of the service, there's no ability within these elements to save you to as you partake of to bear upon you some level of grace. It just doesn't work that way. Salvation is through the blood of the Lord Jesus Christ and his substitutionary atonement on the cross of Calvary, his death, burial, and glorious resurrection. We understand that God has given to us as a local church, this ordinance as a memorial. And so that we would remember, so that we would have that opportunity each time that you walk into our sanctuary on the front of this table, it says this do in remembrance of me. And we find that in 1 Corinthians 11, and we observe this evening, this wonderful ordinance that's been given to the local church in this church age. Notice with me beginning in verse 23 this evening, we'll read the text of scripture. When we observe the Lord's Supper, I don't always preach from this passage of scripture. However, I seek the face of God with regard to messages, obviously each and every week. And God probably at least once a year just leads me to preach from the passage when we're going to deal with the Lord's Supper because there is confusion amongst some with regard to this ordinance. And we want to ensure that there's great clarity as we study the word of God this evening. Notice in verse number 23, the Bible says this, for I have received of the Lord that which also I delivered unto you, that the Lord Jesus, the same night in which he was betrayed, took bread. And when he had given thanks, he break it and said, take eat. This is my body, which is broken for you, this do in remembrance of me. After the same manner also he took the cup when he had supped saying, this cup is the New Testament in my blood. This do ye as oft as you drink it in remembrance of me. For as often as you eat this bread and drink this cup, you do show the Lord's death till he come. Wherefore, whosoever shall eat this bread and drink this cup of the Lord, unworthily shall be guilty of the body and blood of the Lord. But let a man examine himself. And so let him eat of that bread and drink of that cup. For he that eateth and drinketh unworthily, eateth and drinketh damnation to himself, not discerning the Lord's body. For this cause, many are weak and sickly among you and many sleep. For if we would judge ourselves, we should not be judged. This evening as we look at this familiar passage of scripture and deal with the subject matter of the Lord's Supper, let me give you three thoughts tonight with regard to the Lord's Supper that I hope would encourage and strengthen each of us. If you're taking notes this evening, number one, it's a time of reflection. We observe the Lord's Supper, first of all, it's a time of reflection. We find that as we reflect upon this ordinance that's been given to us as a local church and we reflect upon what took place, what is signified, what is it that we're to remember as we observe the Lord's Supper. Again, it's not simply a religious exercise. There's no ability for these elements to save anyone, but we find that it's a time of reflection. It's a reminder for those that have been saved by the grace of God to understand and be reminded what Christ did for us. And we begin to think about this time of reflection as a local church, as we come together for the purpose of observing the Lord's Supper. And we take that time, it's a time that's a sober time. It's a time in which it requires examination as we see in the text of scripture, but we're reflecting upon what took place at Calvary so many years ago. We think nearly 2000 years ago. Now this event that took place at Calvary, and we find in verse 24, this time of reflection, we find that his body is represented as it's spoken of here in verse 24. And we notice and we're reminded how it was beaten for us. Notice broken for you. In verse 24, the Bible says, and when he had given thanks, he break it and said, take eat, this is my body, which is broken for you. Notice this do in remembrance of me. We've often said, as we observe the Lord's Supper that it is a picture, it is a memorial. We believe this evening, the teaching of scripture where the Bible says that this is a, this do in remembrance of me. We do not believe in transubstantiation or consubstantiation, no. These elements, when we pray over them, they remain exactly what they are. They do not change into anything. They simply represent the body of the Lord Jesus Christ that was broken for us. Begin to think about, and we're not gonna turn there this evening for sake of time, but if you go back to the gospel records and you can look at any of them, and as you look at the gospel records and you read of the time in which the Lord Jesus Christ was led up to Calvary, you can think of even the evening before as he's dealing with such persecution and all that he's dealing with and how he was beaten and broken and all that he endured. Why did he do that? So that we might be saved. We understand that the scripture say, and Paul says this, that if we could be saved, he says, I do not frustrate the grace of God, for if righteousness came by the law, then Christ is dead in vain in Galatians. We find that Jesus Christ did not die in vain. No, his body was broken for us, and we can take our time this evening and reflect upon what it cost for us to be saved. We sing about being saved. We rejoice in the truth that heaven is our home, and what a wonderful blessing that is. But it cost Jesus everything. The Bible continues this time of reflection, not only with the body of Christ and the bread representing the body of Christ which was broken for us, but in verse 25, he says, after the same manner also he took the cup when he had supped, saying, this cup is the New Testament in my blood. This do ye as oft as you drink it in remembrance of me. We, as I mentioned after the first song this evening in Sunday school this morning, we dealt with the blood of Christ and the importance of Christ's blood. And I'm so thankful that God showed us in his word from the beginning in Genesis three, and we looked at so many examples this morning of the blood of Christ. And we understand that we're not redeemed with corruptible things, but we're redeemed with the precious blood of Christ. And hallelujah for that truth. And we find this evening that as we have this time of reflection, that it brings our minds back to Calvary. It causes us as the people of God, those that have been saved by the grace of God, if you're here tonight, you know that heaven is your home, you've been saved by the blood of Christ, you have been redeemed, understanding that there's no works that you can do to get to heaven on your own, there's no merit in anything that you could do, Jesus Christ paid it all, and you've trusted Christ as your savior. Well, when we observe this Lord's Supper, it causes you to reflect on what Christ did for you, and how much he loved you, and how he was willing to go to that cross. He said in John 10 that he's the good shepherd. And he said as the good shepherd that he was going to lay down his life for the sheep. Why? Because the only way for mankind to be redeemed, to be reconciled was if God in flesh, the Lord Jesus Christ, took our place on the cross of Calvary. And hallelujah that he did. If you're not sure of heaven, maybe you're here this evening, you've never been saved, maybe somebody's tuned in via live stream this evening, and they've never been saved, and they do not have that assurance that heaven is your home. Could I tell you this evening that these elements that we will partake of, really they're not for you if you're not saved, they're for saved people. But if somebody is not saved, these elements, they can't save you, there's no saving grace in them. What you need tonight is salvation. You need to be born again, to understand that you're a sinner and that Jesus is the only savior. And he said that he loved you and he died for you. He said that this, he said, I am the way, the truth, and the life. No man cometh unto the Father but by me. Peter declared in Acts 4, neither is there salvation in any other. There's no other name under heaven given among men whereby we must be saved. We find that God, the God of the universe, he offers a gift. We refer to it as God refers to it as the gift of God, which is eternal life through Jesus Christ, our Lord. And I'm so thankful that he offers that gift. I've had opportunities over the years, as many of you have, to be able to speak to someone about the gift of God, to be able to talk to them about how much God loved them and share with them the gospel of Jesus Christ. We just sang this evening about, Lord, give me a passion for souls. Why? we sing that song? Well, because we understand the grace of God, we understand the love of God, we understand the gospel. And Paul said, I am not ashamed of the gospel of Christ. Why? For it is the power of God unto salvation to everyone that believe it, to the Jew first and also to the Greek. So this evening as we observe the Lord's Supper, we find first of all that the Lord's Supper is a time of reflection. Time of reflection. I hope tonight that you never get over what Christ did so that you could be saved. I hope that you never get over it, lose the awe of it. How shall we escape if we neglect so great salvation we read in the book of Hebrews? I hope that we never get over what Christ did for us. It's a time that we can reflect on. By the way, baptism, the second ordinance, if we look at those two ordinances that were given to the local church, that too represents the fact that Jesus Christ died for us, he was buried and he rose again. So what does it remind us of? Well, it reminds us of what Christ did for us so we could be saved. So it's a time of reflection. Number two this evening, I believe that the Lord's Supper is not only a time of reflection, but I believe that it's a time of rejoicing. If you're saved tonight, observing the Lord's Supper is a time of rejoicing. And we begin to rejoice. Why? Because we understand the sacrifice that was made on the cross of Calvary. We understand as we look at this passage of Scripture here this evening that not only is it this due in remembrance of me, this reflection back at what Jesus did, but it's a time of rejoicing. Why? Because God loved me and he died for me so that I could be saved. He loved me so much I was that valuable, you were that valuable to God, that he died for you. It's a time of rejoicing that we rejoice in the sacrifice that Christ made at Calvary. Not only a time of rejoicing because of the sacrifice, the substitutionary atonement, but we find that it's a time of rejoicing. Why? Because of his glorious resurrection. You know, we take and look at the Lord's Supper here and we understand that the Bible says in verse 26, for as often as you drink this bread and, excuse me, eat this bread and drink this cup. Notice the Bible doesn't tell us how often to do it, but it simply says for as often as you eat this bread and drink this cup. Notice the Bible says ye do show the Lord's death till he come. So it doesn't capture in that verse of Scripture the resurrection, but it's obvious as you read the Scripture that it says that we're reminded of his death and we do show his death till he come. Well, he's coming back because he rose again. Amen? And so we celebrate the glorious resurrection, we think, as we have in just a few weeks, the opportunity to have Resurrection Sunday. But we understand that every Sunday is Resurrection Sunday. Why is it that we meet on Sunday? Well, because we serve a risen Savior. Up from the grave he arose. We sing that song and we rejoice in understanding that he lives, he lives, Christ Jesus lives today. But we find that the resurrection is the cornerstone of our faith. The book of 1 Corinthians, it says if Christ be not risen, then our faith is in vain, our preaching is in vain. But what separates biblical Christianity from any other religion, and it's not a religion, but if I could use that term this evening of any other religion of the world, is that we serve a risen Savior. You can go to Israel and you can go and you can walk and you can see and you're not going to find any bones of Jesus because he rose. You can argue about which place is the right place, but the reality is that it was just a borrowed place. Amen? And he rose conquering sin, death, and the grave. They came early that morning to the tomb and guess what they found? They found that the stone was rolled away. So when we celebrate, when we observe the Lord's Supper, it's a time of reflection, yes, but it's a time of rejoicing. Why? Because Jesus died for me. Because Jesus rose conquering sin, death, and the grave. We can rejoice because of his exalted position. You know, at this very moment, Jesus Christ is exalted in heaven and we can read of the account in the book of Acts in the first chapter and after the resurrection of Jesus Christ, he lived on this earth and gave instruction to his disciples, but then came the day that he would ascend to heaven. And the Bible records it at the end of the Gospel of Luke and then in Acts chapter number 1, and the Bible says that Jesus gave instruction and then as they were standing there and receiving that instruction, the Bible tells us that Jesus was ascended up into heaven. What a sight it would have been. These men, they continue to stand there looking up into heaven and then the angels come and say, you men of Galilee, why stand ye gazing up into heaven? We'll deal with the rest of that statement in just a moment, but understand that he's in an exalted position. The Bible says that he ever liveth to make intercession for us. If you're a child of God this evening, if you're saved by the grace of God, then you understand that as Jesus is in this exalted position, that he ever lives to make intercession for us. And what a blessing that is. He's at the right hand of the Father. He's in the throne room of heaven and he lives. He's alive. He's making intercession for us. Hallelujah. And it should cause us to rejoice as we observe the Lord's Supper. Yes, it's a time of reflection, but it's a time of rejoicing. We have hope and we have this peace because we serve a risen Savior because he is exalted. The Bible tells us that God has given a name which is above every name. In the name of Jesus, every tongue should confess and every knee is going to bow that Jesus Christ is Lord. The glory of the Father. What a blessing to understand the exalted position of our Savior. Notice the last three words of verse 26. The Bible says, till he come. A time of rejoicing because of his promised return. A time of rejoicing because of his promised return. As we observe the Lord's Supper, we're reminded of what Christ did for us. We're reminded of what he's currently doing for us, but we're reminded that one day he's coming back for us. Because the Bible says that as often as you eat this bread and drink this cup, you do show the Lord's death till he come. I'm looking forward to the trumpet of the Lord sounding. I'm looking forward to being with my Savior for all of eternity. And the Bible says that Jesus is coming back. He says to the disciples, let not your heart be troubled. You believe in God, believe also in me. In my Father's house are many mansions, if it were not so, I would have told you. I go to prepare a place for you. And if I go and prepare a place for you, I will come again. That where I am, there ye may be also. The Bible says in a moment, the twinkling of an eye. The Bible says the last trump. We find that that's the truth in 1 Corinthians 15. In 1 Thessalonians chapter 4, the Bible says this, for the Lord himself shall descend from heaven with a shout, with the voice of an archangel, with the trump of God and the dead in Christ shall rise first. Then we which are alive and remain shall be caught up together with them in the clouds to meet the Lord in the air and so shall we ever be with the Lord. Wherefore, comfort one another with these words. There in Acts chapter 1, when the disciples saw Jesus ascending up into heaven and those angels came and said, ye men of Galilee, why stand ye gazing up into heaven? They finish and say this, this same Jesus which you've seen go up into heaven shall come again. He shall come in like matter, is what the Bible says. And this evening when we begin to think about this promise that we read in 1 Corinthians chapter 11 and verse number 26 as we look at this truth that the Lord's Supper, it shows his death, till he come. I often think about the return of the Lord. It's an exciting truth of God's Word. It's a reality. It's going to happen. We live every day with the understanding of the imminent return of Christ. I wonder this evening, are you ready for his return? Are you ready for his return? The Bible says in 1 John, the truth with regard to the coming of Christ and the fact that we have this hope. He says, every man that hath this hope purifies himself even as he is pure. The Bible says that we could be ashamed at his appearing. I hope this evening that no one here would be ashamed at the appearing of Christ. That we'd live every moment as if it could be the last moment that Jesus is coming back. What a blessed reality of Scripture. We look at this Lord's Supper this evening and we see that it's a time of reflection, no doubt. We find it's a time of rejoicing or this evening. How are we doing with rejoicing? Wednesday evening this past week I had as our study 1 Thessalonians 5 and verse 16 as we're studying through the instructions given to the church at Thessalonica at the end of 1 Thessalonians 5 and eventually we'll get to the end of 2 Thessalonians 3. And as we look at those two passages of Scripture we find that God gives us some very practical instruction for every local church. This past Wednesday evening the simple verse of Scripture that we dealt with was rejoice evermore. Literally to rejoice at all times. And we find this evening that as we observe the Lord's Supper it should be a time of rejoicing. Time of rejoicing. I wonder as you go throughout your day, as you go throughout this week, how often are we rejoicing because of what Jesus did for us? Because of the ultimate price that was paid at Calvary? How often are we rejoicing because He rose conquering sin, death and the grave? How often do we live in that resurrection power understanding that we serve a risen Savior? How often do we rejoice knowing that He's at the right hand of the Father making intercession for us? How often do we rejoice knowing that He's coming again? I hope that you're longing for His return. But understand with me this evening that the time is short. He says that we're to redeem the time because the days are evil. When Jesus comes back, and I'm looking forward to Him coming back, but you know there's no more opportunity to share the gospel with someone. There's no more opportunity to be surrendered, to be yielded. There's no more opportunity to send a missionary to give a contribution to… all those opportunities are gone. Why? Because you will ever be with the Lord. So this evening as we think about this time of rejoicing, I hope that we would rejoice greatly as we observe the Lord's Supper this evening. I would say that not only is it a time of reflection and a time of rejoicing, but I would say this, number three, if you're taking notes, it's a time to refocus. Time to refocus. You know if we're not careful in life we can lose our focus. You ever have that happen? You ever get distracted by something? You ever see a squirrel? Seems like those squirrels, I mean they get distracted by everything, but sometimes we can be the same way. We can just get distracted by things. Some people are easily distracted, some people are oblivious. You've met both kinds, no doubt. But understand with me this evening that there are times in our lives as Christians, as followers of the Lord Jesus Christ, that we can lose our focus. We can get distracted. We can get distracted by the things of this world. We can get distracted by good things that might not be the best things. We can get distracted by being involved in something that we think is a good thing, is an honorable task, but it's not the best thing. It's not what God wants us to be doing. On any given day that God would give to any of us, we have the same amount of time. You ever hear somebody say, I need to make some time? You can't make time. All you can do is manage it. You can steward time. And how we steward time is so important because time, once it's gone, is gone. And this evening, when we think about this time to refocus, the reality is that as God's people living in the world, though we're not of the world, we can become distracted. I think about Peter in John chapter 21. He's talking with the Lord Jesus Christ, and the understanding in John 21, it starts with Peter saying, I go fishing, and he's out there, and then Jesus is on the shore, and he calls out to those that are there in the boat, and he says, have you any, did you catch anything? Now that's a bad question if you've not caught anything. Right? It's embarrassing as a fisherman if you're out fishing and you've caught nothing. By the way, this isn't the first time in Peter's ministry, or Peter's life, I should say, that he was asked this question, or should I say that he had a night where he caught nothing. You remember when he was first called to the ministry, he said they've toiled all the night and they've caught nothing, but Jesus says, go out, launch out into the deep. Let down your nets for a draft of fishes. And Peter says we've toiled all the night and we've caught nothing, nevertheless at thy word, we'll let down the net, singular. They caught so many fish, they had to have people come and help them. And now you fast forward to after the crucifixion and the resurrection, and Peter says I'm going fishing, and the others go with them, and he says, Jesus says in verse number 5 of John 21, children, have ye any meat? And they answered him, no, no. So Jesus said, cast the net on the right side of the ship, and ye shall find. They cast therefore, and now they were not able to draw it for the multitude of fishes. And then John, who refers to himself as the disciple whom Jesus loved, he simply says this, it is the Lord. It is the Lord! And Peter gets excited, he jumps off the boat, man, he's getting back to shore, amen? And he gets to shore and guess what, there's already fish on the fire. And Jesus has this conversation with Peter and he says, Peter, do you love me? He goes through that process three times and we find that in verse 19, the Bible says, this spake he signifying by what death he should glorify God. When he had spoken this, he saith unto him, follow me. The instruction was simple, it was direct, it was clear. Follow me. And Peter, the Bible says in verse 20, turning about, he seeth the disciple whom Jesus loved following. So what does he do? Well, he turns around and he sees John. He gets distracted. He sees John. He's heard the instruction from Jesus, follow me. And he sees John and he says, look, it says this, which also leaned on his breast at supper and said, Lord, which is he that betrayeth thee? So he's talking about John. You can go back to John 13 and verse 25 and see that. Verse 21, Peter seeing him, saith to Jesus, Lord, and what shall this man do? You know, for a moment there, Peter got distracted because he was wondering what's John going to do? You know, if we're not careful, we can get distracted by what somebody else is doing or what somebody else is supposed to be doing. But Jesus was clear in speaking to Peter and said, follow me. And so after Peter asked the question, Lord, what shall this man do? Jesus saith unto him, if I will that he tarry till I come, what is that to thee? Follow thou me. I love the response of Jesus. If I could say it this way, he says, it's none of your business what my plan is for John. Your job is to follow me. He says, if I will that he tarry till I come, what is that to thee? He restates what he had previously revealed to Peter, follow thou me. There's a lot of things that can distract us in life. In 1 Corinthians 11, we read this passage with regard to the Lord's Supper. We find that there's reason to rejoice, but really, I believe as a local church, God in His omniscience in giving us this ordinance, it brings us to a place, a sober place of reflecting upon what Christ did for us. It caused us to rejoice in that sacrifice, but also to rejoice in the resurrection and His soon return. But then we refocus. Why? Because we examine ourselves. The Bible says in verse 27, wherefore, whosoever shall eat this bread and drink this cup of the Lord unworthily shall be guilty of the body and blood of the Lord. But let a man examine himself, and so let him eat of that bread and drink of that cup. For he that eateth and drinketh unworthily eateth and drinketh damnation to himself, not discerning the Lord's body. For this cause, those that were eating and drinking unworthily, many are weak and sickly among you, and many sleep or have died. For if we would judge ourselves, we should not be judged. No doubt as we look at this aspect of this examination, it's so that we would be worthy of taking, partaking of the Lord's Supper. Now understand in our own person, in our own ability, we're never going to be worthy, but if you've been saved by the grace of God, and you're clean as we preached about this morning, there's no sin between me and my Savior, I've confessed whatever it is that God's pointed out in my life, then I can partake of these elements. The idea of these elements in this passage with regard to examining ourselves is not to say, well I have sin in my life, so I'm just going to pass by, I'm going to let it pass. No, it's that I would deal with it. If you're not saved this evening, the idea is not that you'd say, well I'm not saved so that's not for me. No, it's that you would be saved as we observe this Lord's Supper. But I want you to think tonight, yes this aspect of examination, but this time for us to refocus. I want you to consider tonight your position as a child of God. God. If you're saved tonight, if you've been born again, God is your Father, you're His child. You may be a lot of things. What do I mean by that? You may have titles and you may have degrees, but the greatest, most important thing is your position in Christ. If we're not careful, we get so caught up in these things and we can lose our focus, we can become distracted. You've heard people ask, no doubt, why am I here, what's my purpose? I hope as a child of God that you don't struggle with that question. I hope as a child of God that you understand that you're here to be His representative, that your purpose is to bring honor and glory to Christ. Whether therefore you eat or drink or whatsoever you do, do all to the glory of God. Is that not what your Bible says? He didn't say do some, do most, He said do all. John said, I must decrease, He, Christ, must increase, John the Baptist said. Tonight, we understand why we're here. I know there are times we say, man, I wish I was in heaven, looking forward to heaven. But if we're still here, if God's still giving us breath, He's left us here for a purpose, He has a plan for our lives. And our greatest position is our position in Christ. Again, you may be a lot of things, you may have titles, you may have degrees, but you know, what shall it profit a man if he gained the whole world and loses his own soul? The greatest title that you could have, that I could have, is I'm a child of the King. God is my Father. What a blessing. And if we understand that tonight, it's this time to refocus why. What am I doing? You ever wonder? You ever look at your life, kind of just take back and say, what am I doing? What am I doing? Is there anything that I'm doing that's eternal, or is everything that I'm doing temporal? Is there any way that I'm investing in eternity? Is there anything that I'm doing that's of eternal value? Do you understand what I'm saying? And I believe tonight it's this time when we observe the Lord's Supper to refocus because God's left us here for a purpose. God has a plan for each of our lives. And how appropriate that we sang a song tonight, give me a passion for souls, dear Lord. Because truly, that should be our passion. Have you ever seen someone driving down the road with a bumper sticker, I'd rather be, and it says, I'd rather be golfing, I'd rather be sailing, I'd rather be, you fill in the blank, I've seen them, you've seen them. I've never seen one that said, I'd rather be winning souls. But you know, as a child of God, if you've ever led somebody to Christ, there is nothing like it. There is absolutely nothing like taking a Bible and showing somebody how they could know for sure that heaven's their home. And seeing that spiritual birth, that person under the conviction of the Holy Spirit of God understands that they're a sinner, and that there's no way they could save themselves. They are guilty before God. They will spend eternity in the lake of fire because that is the wage of sin. The wage of sin is death. But they recognize that God loved them, that God will save them, that God took their place and offers them that gift of salvation. The Bible says, for whosoever shall call upon the name of the Lord shall be saved. They bow their head, their heart before God. They cry out, Lord, save me. And there's nothing like it in all the world. It's absolutely wonderful. And tonight, as we think about observing the Lord's Supper, we're going to have a time of silence and prayer here in just a moment before we distribute the elements. We'll read some of the verses again before we distribute and partake. It's a time of reflection. I hope that not only at the Lord's Supper, but regularly in your life, you think back as to what it costs for you to be saved, what Christ did for you. I hope that you rejoice, not only in what he did for you, but what he is doing for you and how he's coming back for you. And that's reason to rejoice. But I hope we take a few moments tonight to refocus. Because if we'd be honest tonight, at times in our lives, we can all get a little distracted. We all need a little recalibration, if you will, some refocus. And we say, God, why am I here? What's your plan for me? What is it I'm supposed to be doing? And we know the answers to those questions as we study God's Word. We're to live for him, we're to please him, we're to bring glory to his name. And God reveals in his Word the things that do just that. And tonight, maybe some of us need to refocus a little bit and understand the greatest title, my greatest position, is that I am a child of the King. Praise the Lord. Hallelujah. Let's pray together. Father, we love you. How we thank you for loving us. We thank you, God, for the privilege of being able to gather together this evening. We thank you for the Word of God and the truth that's contained therein. We thank you for the Lord's Supper, this ordinance that you've given to us as a local church. And God, we thank you for the opportunity that we'll have in just a moment to partake of these elements. And God, I pray that even as we've had opportunity this evening to preach from this passage of Scripture that you would help us to understand with great clarity that there's nothing within these elements that can save an individual, that salvation is through the blood of Jesus Christ. His substitutionary death, His glorious resurrection. We serve a risen Savior. Lord, if there's one that's present, whether they're here in person or tuned in via livestream, they're not sure of heaven, and I pray that tonight they would trust Christ as their Savior. I pray the Holy Spirit of God would draw them, convict them of their sin and of Christ's righteousness and of judgment to come. Lord, I pray for every child of God tonight. Lord, would you help us to rejoice as we observe this table tonight, the Lord's Supper. Help us to rejoice. God, I pray that you'd help us to refocus. God, I believe that in each of our lives there are times that we just get distracted, get off course just a little bit. God, I pray that you'd help us tonight to refocus. I pray that in these moments of invitation, these moments of examination, that God, you'd have your will in way. I pray, Lord, that if there's sin in our lives, that we'd confess it and forsake it, that we'd have forgiveness. God, we'll thank you for all that you'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.700000047683716,
      "text": " Number 11, 1 Corinthians chapter number 11."
    },
    {
      "id": 1,
      "start": 3.700000047683716,
      "end": 7.360000133514404,
      "text": " As you see this evening, we will observe the Lord's Supper."
    },
    {
      "id": 2,
      "start": 7.360000133514404,
      "end": 10.680000305175781,
      "text": " And this is one of two ordinances for the local church."
    },
    {
      "id": 3,
      "start": 10.680000305175781,
      "end": 14.15999984741211,
      "text": " I'm thankful that God in his omniscience"
    },
    {
      "id": 4,
      "start": 14.15999984741211,
      "end": 17.399999618530273,
      "text": " that he gave to the local church,"
    },
    {
      "id": 5,
      "start": 17.399999618530273,
      "end": 22.079999923706055,
      "text": " the ordinance of baptism, believers baptism by immersion,"
    },
    {
      "id": 6,
      "start": 22.079999923706055,
      "end": 25.040000915527344,
      "text": " and then also the ordinance of the Lord's Supper."
    },
    {
      "id": 7,
      "start": 25.040000915527344,
      "end": 27.639999389648438,
      "text": " It's important that we understand the biblical foundation"
    },
    {
      "id": 8,
      "start": 27.639999389648438,
      "end": 31.8799991607666,
      "text": " that God has given us for these two ordinances."
    },
    {
      "id": 9,
      "start": 31.8799991607666,
      "end": 35.58000183105469,
      "text": " We understand that baptism cannot save you"
    },
    {
      "id": 10,
      "start": 35.58000183105469,
      "end": 39.119998931884766,
      "text": " the same fashion, these elements that we will partake of"
    },
    {
      "id": 11,
      "start": 39.119998931884766,
      "end": 41.65999984741211,
      "text": " at the end of the service, there's no ability"
    },
    {
      "id": 12,
      "start": 41.65999984741211,
      "end": 43.79999923706055,
      "text": " within these elements to save you"
    },
    {
      "id": 13,
      "start": 43.79999923706055,
      "end": 48.79999923706055,
      "text": " to as you partake of to bear upon you some level of grace."
    },
    {
      "id": 14,
      "start": 50.2400016784668,
      "end": 51.880001068115234,
      "text": " It just doesn't work that way."
    },
    {
      "id": 15,
      "start": 51.880001068115234,
      "end": 55.2400016784668,
      "text": " Salvation is through the blood of the Lord Jesus Christ"
    },
    {
      "id": 16,
      "start": 55.2400016784668,
      "end": 58.68000030517578,
      "text": " and his substitutionary atonement on the cross of Calvary,"
    },
    {
      "id": 17,
      "start": 58.68000030517578,
      "end": 62.08000183105469,
      "text": " his death, burial, and glorious resurrection."
    },
    {
      "id": 18,
      "start": 62.08000183105469,
      "end": 66.4000015258789,
      "text": " We understand that God has given to us as a local church,"
    },
    {
      "id": 19,
      "start": 66.4000015258789,
      "end": 69.27999877929688,
      "text": " this ordinance as a memorial."
    },
    {
      "id": 20,
      "start": 69.27999877929688,
      "end": 71.26000213623047,
      "text": " And so that we would remember,"
    },
    {
      "id": 21,
      "start": 71.26000213623047,
      "end": 73.95999908447266,
      "text": " so that we would have that opportunity"
    },
    {
      "id": 22,
      "start": 73.95999908447266,
      "end": 77.0,
      "text": " each time that you walk into our sanctuary"
    },
    {
      "id": 23,
      "start": 77.0,
      "end": 78.31999969482422,
      "text": " on the front of this table,"
    },
    {
      "id": 24,
      "start": 78.31999969482422,
      "end": 80.80000305175781,
      "text": " it says this do in remembrance of me."
    },
    {
      "id": 25,
      "start": 80.80000305175781,
      "end": 83.44000244140625,
      "text": " And we find that in 1 Corinthians 11,"
    },
    {
      "id": 26,
      "start": 83.5199966430664,
      "end": 85.08000183105469,
      "text": " and we observe this evening,"
    },
    {
      "id": 27,
      "start": 85.08000183105469,
      "end": 87.5199966430664,
      "text": " this wonderful ordinance that's been given"
    },
    {
      "id": 28,
      "start": 87.5199966430664,
      "end": 89.76000213623047,
      "text": " to the local church in this church age."
    },
    {
      "id": 29,
      "start": 89.76000213623047,
      "end": 92.72000122070312,
      "text": " Notice with me beginning in verse 23 this evening,"
    },
    {
      "id": 30,
      "start": 92.72000122070312,
      "end": 94.19999694824219,
      "text": " we'll read the text of scripture."
    },
    {
      "id": 31,
      "start": 94.19999694824219,
      "end": 95.44000244140625,
      "text": " When we observe the Lord's Supper,"
    },
    {
      "id": 32,
      "start": 95.44000244140625,
      "end": 98.73999786376953,
      "text": " I don't always preach from this passage of scripture."
    },
    {
      "id": 33,
      "start": 98.73999786376953,
      "end": 102.08000183105469,
      "text": " However, I seek the face of God with regard to messages,"
    },
    {
      "id": 34,
      "start": 102.08000183105469,
      "end": 104.0199966430664,
      "text": " obviously each and every week."
    },
    {
      "id": 35,
      "start": 104.0199966430664,
      "end": 106.44000244140625,
      "text": " And God probably at least once a year"
    },
    {
      "id": 36,
      "start": 106.44000244140625,
      "end": 109.91999816894531,
      "text": " just leads me to preach from the passage"
    },
    {
      "id": 37,
      "start": 109.91999816894531,
      "end": 112.04000091552734,
      "text": " when we're going to deal with the Lord's Supper"
    },
    {
      "id": 38,
      "start": 112.04000091552734,
      "end": 113.95999908447266,
      "text": " because there is confusion"
    },
    {
      "id": 39,
      "start": 113.95999908447266,
      "end": 116.87999725341797,
      "text": " amongst some with regard to this ordinance."
    },
    {
      "id": 40,
      "start": 116.87999725341797,
      "end": 119.5199966430664,
      "text": " And we want to ensure that there's great clarity"
    },
    {
      "id": 41,
      "start": 119.5199966430664,
      "end": 122.72000122070312,
      "text": " as we study the word of God this evening."
    },
    {
      "id": 42,
      "start": 122.72000122070312,
      "end": 125.4800033569336,
      "text": " Notice in verse number 23, the Bible says this,"
    },
    {
      "id": 43,
      "start": 125.4800033569336,
      "end": 128.47999572753906,
      "text": " for I have received of the Lord"
    },
    {
      "id": 44,
      "start": 128.47999572753906,
      "end": 131.63999938964844,
      "text": " that which also I delivered unto you,"
    },
    {
      "id": 45,
      "start": 131.63999938964844,
      "end": 133.83999633789062,
      "text": " that the Lord Jesus, the same night"
    },
    {
      "id": 46,
      "start": 133.83999633789062,
      "end": 137.0399932861328,
      "text": " in which he was betrayed, took bread."
    },
    {
      "id": 47,
      "start": 137.0399932861328,
      "end": 138.47999572753906,
      "text": " And when he had given thanks,"
    },
    {
      "id": 48,
      "start": 138.47999572753906,
      "end": 141.27999877929688,
      "text": " he break it and said, take eat."
    },
    {
      "id": 49,
      "start": 141.27999877929688,
      "end": 144.0800018310547,
      "text": " This is my body, which is broken for you,"
    },
    {
      "id": 50,
      "start": 144.0800018310547,
      "end": 147.4600067138672,
      "text": " this do in remembrance of me."
    },
    {
      "id": 51,
      "start": 147.4600067138672,
      "end": 149.60000610351562,
      "text": " After the same manner also he took the cup"
    },
    {
      "id": 52,
      "start": 149.60000610351562,
      "end": 150.55999755859375,
      "text": " when he had supped saying,"
    },
    {
      "id": 53,
      "start": 150.55999755859375,
      "end": 153.47999572753906,
      "text": " this cup is the New Testament in my blood."
    },
    {
      "id": 54,
      "start": 153.47999572753906,
      "end": 158.47999572753906,
      "text": " This do ye as oft as you drink it in remembrance of me."
    },
    {
      "id": 55,
      "start": 158.67999267578125,
      "end": 161.32000732421875,
      "text": " For as often as you eat this bread and drink this cup,"
    },
    {
      "id": 56,
      "start": 161.32000732421875,
      "end": 165.47999572753906,
      "text": " you do show the Lord's death till he come."
    },
    {
      "id": 57,
      "start": 165.47999572753906,
      "end": 168.5,
      "text": " Wherefore, whosoever shall eat this bread"
    },
    {
      "id": 58,
      "start": 168.5,
      "end": 171.1199951171875,
      "text": " and drink this cup of the Lord,"
    },
    {
      "id": 59,
      "start": 171.83999633789062,
      "end": 174.60000610351562,
      "text": " unworthily shall be guilty of the body"
    },
    {
      "id": 60,
      "start": 174.60000610351562,
      "end": 177.24000549316406,
      "text": " and blood of the Lord."
    },
    {
      "id": 61,
      "start": 177.24000549316406,
      "end": 179.44000244140625,
      "text": " But let a man examine himself."
    },
    {
      "id": 62,
      "start": 179.44000244140625,
      "end": 182.9600067138672,
      "text": " And so let him eat of that bread and drink of that cup."
    },
    {
      "id": 63,
      "start": 182.9600067138672,
      "end": 185.52000427246094,
      "text": " For he that eateth and drinketh unworthily,"
    },
    {
      "id": 64,
      "start": 185.52000427246094,
      "end": 188.52000427246094,
      "text": " eateth and drinketh damnation to himself,"
    },
    {
      "id": 65,
      "start": 188.52000427246094,
      "end": 191.0800018310547,
      "text": " not discerning the Lord's body."
    },
    {
      "id": 66,
      "start": 191.0800018310547,
      "end": 193.89999389648438,
      "text": " For this cause, many are weak and sickly among you"
    },
    {
      "id": 67,
      "start": 193.89999389648438,
      "end": 195.63999938964844,
      "text": " and many sleep."
    },
    {
      "id": 68,
      "start": 195.63999938964844,
      "end": 200.44000244140625,
      "text": " For if we would judge ourselves, we should not be judged."
    },
    {
      "id": 69,
      "start": 200.44000244140625,
      "end": 202.52000427246094,
      "text": " This evening as we look at this familiar passage"
    },
    {
      "id": 70,
      "start": 202.52000427246094,
      "end": 204.0,
      "text": " of scripture and deal with the subject matter"
    },
    {
      "id": 71,
      "start": 204.0,
      "end": 205.32000732421875,
      "text": " of the Lord's Supper,"
    },
    {
      "id": 72,
      "start": 205.32000732421875,
      "end": 206.72000122070312,
      "text": " let me give you three thoughts tonight"
    },
    {
      "id": 73,
      "start": 206.72000122070312,
      "end": 208.9600067138672,
      "text": " with regard to the Lord's Supper"
    },
    {
      "id": 74,
      "start": 208.9600067138672,
      "end": 212.05999755859375,
      "text": " that I hope would encourage and strengthen each of us."
    },
    {
      "id": 75,
      "start": 212.05999755859375,
      "end": 213.5399932861328,
      "text": " If you're taking notes this evening,"
    },
    {
      "id": 76,
      "start": 213.5399932861328,
      "end": 216.5800018310547,
      "text": " number one, it's a time of reflection."
    },
    {
      "id": 77,
      "start": 216.5800018310547,
      "end": 218.0,
      "text": " We observe the Lord's Supper,"
    },
    {
      "id": 78,
      "start": 218.0,
      "end": 220.47999572753906,
      "text": " first of all, it's a time of reflection."
    },
    {
      "id": 79,
      "start": 220.47999572753906,
      "end": 223.67999267578125,
      "text": " We find that as we reflect upon this ordinance"
    },
    {
      "id": 80,
      "start": 223.67999267578125,
      "end": 225.6199951171875,
      "text": " that's been given to us as a local church"
    },
    {
      "id": 81,
      "start": 225.6199951171875,
      "end": 228.5399932861328,
      "text": " and we reflect upon what took place,"
    },
    {
      "id": 82,
      "start": 228.5399932861328,
      "end": 231.77999877929688,
      "text": " what is signified, what is it that we're to remember"
    },
    {
      "id": 83,
      "start": 231.77999877929688,
      "end": 234.05999755859375,
      "text": " as we observe the Lord's Supper."
    },
    {
      "id": 84,
      "start": 234.05999755859375,
      "end": 236.89999389648438,
      "text": " Again, it's not simply a religious exercise."
    },
    {
      "id": 85,
      "start": 236.89999389648438,
      "end": 240.22000122070312,
      "text": " There's no ability for these elements to save anyone,"
    },
    {
      "id": 86,
      "start": 240.22000122070312,
      "end": 242.33999633789062,
      "text": " but we find that it's a time of reflection."
    },
    {
      "id": 87,
      "start": 242.33999633789062,
      "end": 245.33999633789062,
      "text": " It's a reminder for those that have been saved"
    },
    {
      "id": 88,
      "start": 245.33999633789062,
      "end": 249.4199981689453,
      "text": " by the grace of God to understand and be reminded"
    },
    {
      "id": 89,
      "start": 249.4199981689453,
      "end": 252.02000427246094,
      "text": " what Christ did for us."
    },
    {
      "id": 90,
      "start": 252.02000427246094,
      "end": 254.3800048828125,
      "text": " And we begin to think about this time of reflection"
    },
    {
      "id": 91,
      "start": 254.3800048828125,
      "end": 257.05999755859375,
      "text": " as a local church, as we come together"
    },
    {
      "id": 92,
      "start": 257.05999755859375,
      "end": 259.5,
      "text": " for the purpose of observing the Lord's Supper."
    },
    {
      "id": 93,
      "start": 259.5,
      "end": 263.5400085449219,
      "text": " And we take that time, it's a time that's a sober time."
    },
    {
      "id": 94,
      "start": 263.5400085449219,
      "end": 267.05999755859375,
      "text": " It's a time in which it requires examination"
    },
    {
      "id": 95,
      "start": 267.05999755859375,
      "end": 268.9200134277344,
      "text": " as we see in the text of scripture,"
    },
    {
      "id": 96,
      "start": 268.9200134277344,
      "end": 272.70001220703125,
      "text": " but we're reflecting upon what took place at Calvary"
    },
    {
      "id": 97,
      "start": 272.70001220703125,
      "end": 274.2200012207031,
      "text": " so many years ago."
    },
    {
      "id": 98,
      "start": 274.2200012207031,
      "end": 277.3800048828125,
      "text": " We think nearly 2000 years ago."
    },
    {
      "id": 99,
      "start": 277.3800048828125,
      "end": 281.1400146484375,
      "text": " Now this event that took place at Calvary,"
    },
    {
      "id": 100,
      "start": 281.1400146484375,
      "end": 284.260009765625,
      "text": " and we find in verse 24, this time of reflection,"
    },
    {
      "id": 101,
      "start": 284.260009765625,
      "end": 287.4200134277344,
      "text": " we find that his body is represented"
    },
    {
      "id": 102,
      "start": 287.4200134277344,
      "end": 289.5400085449219,
      "text": " as it's spoken of here in verse 24."
    },
    {
      "id": 103,
      "start": 289.5400085449219,
      "end": 293.260009765625,
      "text": " And we notice and we're reminded how it was beaten for us."
    },
    {
      "id": 104,
      "start": 293.260009765625,
      "end": 295.4200134277344,
      "text": " Notice broken for you."
    },
    {
      "id": 105,
      "start": 295.4200134277344,
      "end": 297.260009765625,
      "text": " In verse 24, the Bible says,"
    },
    {
      "id": 106,
      "start": 297.260009765625,
      "end": 300.17999267578125,
      "text": " and when he had given thanks, he break it and said,"
    },
    {
      "id": 107,
      "start": 300.17999267578125,
      "end": 303.82000732421875,
      "text": " take eat, this is my body, which is broken for you."
    },
    {
      "id": 108,
      "start": 303.82000732421875,
      "end": 306.82000732421875,
      "text": " Notice this do in remembrance of me."
    },
    {
      "id": 109,
      "start": 306.82000732421875,
      "end": 309.1000061035156,
      "text": " We've often said, as we observe the Lord's Supper"
    },
    {
      "id": 110,
      "start": 309.1000061035156,
      "end": 313.05999755859375,
      "text": " that it is a picture, it is a memorial."
    },
    {
      "id": 111,
      "start": 313.05999755859375,
      "end": 316.1400146484375,
      "text": " We believe this evening, the teaching of scripture"
    },
    {
      "id": 112,
      "start": 316.1400146484375,
      "end": 318.17999267578125,
      "text": " where the Bible says that this is a,"
    },
    {
      "id": 113,
      "start": 318.17999267578125,
      "end": 320.6600036621094,
      "text": " this do in remembrance of me."
    },
    {
      "id": 114,
      "start": 320.6600036621094,
      "end": 323.4599914550781,
      "text": " We do not believe in transubstantiation"
    },
    {
      "id": 115,
      "start": 323.4599914550781,
      "end": 325.5,
      "text": " or consubstantiation, no."
    },
    {
      "id": 116,
      "start": 325.5,
      "end": 327.6600036621094,
      "text": " These elements, when we pray over them,"
    },
    {
      "id": 117,
      "start": 327.6600036621094,
      "end": 329.70001220703125,
      "text": " they remain exactly what they are."
    },
    {
      "id": 118,
      "start": 329.70001220703125,
      "end": 332.17999267578125,
      "text": " They do not change into anything."
    },
    {
      "id": 119,
      "start": 332.17999267578125,
      "end": 336.739990234375,
      "text": " They simply represent the body of the Lord Jesus Christ"
    },
    {
      "id": 120,
      "start": 336.739990234375,
      "end": 338.6600036621094,
      "text": " that was broken for us."
    },
    {
      "id": 121,
      "start": 338.6600036621094,
      "end": 340.5799865722656,
      "text": " Begin to think about, and we're not gonna turn there"
    },
    {
      "id": 122,
      "start": 340.5799865722656,
      "end": 341.8599853515625,
      "text": " this evening for sake of time,"
    },
    {
      "id": 123,
      "start": 341.8599853515625,
      "end": 343.5,
      "text": " but if you go back to the gospel records"
    },
    {
      "id": 124,
      "start": 343.5,
      "end": 345.0199890136719,
      "text": " and you can look at any of them,"
    },
    {
      "id": 125,
      "start": 345.0199890136719,
      "end": 347.739990234375,
      "text": " and as you look at the gospel records and you read"
    },
    {
      "id": 126,
      "start": 347.739990234375,
      "end": 349.94000244140625,
      "text": " of the time in which the Lord Jesus Christ"
    },
    {
      "id": 127,
      "start": 349.94000244140625,
      "end": 353.7799987792969,
      "text": " was led up to Calvary, you can think of even"
    },
    {
      "id": 128,
      "start": 353.7799987792969,
      "end": 356.739990234375,
      "text": " the evening before as he's dealing with such persecution"
    },
    {
      "id": 129,
      "start": 356.739990234375,
      "end": 358.3800048828125,
      "text": " and all that he's dealing with"
    },
    {
      "id": 130,
      "start": 358.3800048828125,
      "end": 363.05999755859375,
      "text": " and how he was beaten and broken and all that he endured."
    },
    {
      "id": 131,
      "start": 363.05999755859375,
      "end": 364.2200012207031,
      "text": " Why did he do that?"
    },
    {
      "id": 132,
      "start": 365.1400146484375,
      "end": 366.94000244140625,
      "text": " So that we might be saved."
    },
    {
      "id": 133,
      "start": 366.94000244140625,
      "end": 370.4599914550781,
      "text": " We understand that the scripture say, and Paul says this,"
    },
    {
      "id": 134,
      "start": 370.4599914550781,
      "end": 373.4200134277344,
      "text": " that if we could be saved, he says,"
    },
    {
      "id": 135,
      "start": 373.4200134277344,
      "end": 375.5,
      "text": " I do not frustrate the grace of God,"
    },
    {
      "id": 136,
      "start": 375.5,
      "end": 377.1000061035156,
      "text": " for if righteousness came by the law,"
    },
    {
      "id": 137,
      "start": 377.1000061035156,
      "end": 381.4200134277344,
      "text": " then Christ is dead in vain in Galatians."
    },
    {
      "id": 138,
      "start": 381.4200134277344,
      "end": 384.260009765625,
      "text": " We find that Jesus Christ did not die in vain."
    },
    {
      "id": 139,
      "start": 384.260009765625,
      "end": 386.70001220703125,
      "text": " No, his body was broken for us,"
    },
    {
      "id": 140,
      "start": 386.70001220703125,
      "end": 388.82000732421875,
      "text": " and we can take our time this evening"
    },
    {
      "id": 141,
      "start": 388.82000732421875,
      "end": 392.4599914550781,
      "text": " and reflect upon what it cost for us to be saved."
    },
    {
      "id": 142,
      "start": 392.4599914550781,
      "end": 394.29998779296875,
      "text": " We sing about being saved."
    },
    {
      "id": 143,
      "start": 394.29998779296875,
      "end": 397.1400146484375,
      "text": " We rejoice in the truth that heaven is our home,"
    },
    {
      "id": 144,
      "start": 397.1400146484375,
      "end": 400.1400146484375,
      "text": " and what a wonderful blessing that is."
    },
    {
      "id": 145,
      "start": 400.82000732421875,
      "end": 403.260009765625,
      "text": " But it cost Jesus everything."
    },
    {
      "id": 146,
      "start": 403.260009765625,
      "end": 405.7799987792969,
      "text": " The Bible continues this time of reflection,"
    },
    {
      "id": 147,
      "start": 405.7799987792969,
      "end": 409.6600036621094,
      "text": " not only with the body of Christ and the bread"
    },
    {
      "id": 148,
      "start": 409.6600036621094,
      "end": 412.82000732421875,
      "text": " representing the body of Christ which was broken for us,"
    },
    {
      "id": 149,
      "start": 412.82000732421875,
      "end": 415.6600036621094,
      "text": " but in verse 25, he says, after the same manner also"
    },
    {
      "id": 150,
      "start": 415.6600036621094,
      "end": 417.70001220703125,
      "text": " he took the cup when he had supped, saying,"
    },
    {
      "id": 151,
      "start": 417.70001220703125,
      "end": 421.17999267578125,
      "text": " this cup is the New Testament in my blood."
    },
    {
      "id": 152,
      "start": 421.17999267578125,
      "end": 425.6199951171875,
      "text": " This do ye as oft as you drink it in remembrance of me."
    },
    {
      "id": 153,
      "start": 425.6199951171875,
      "end": 428.6199951171875,
      "text": " We, as I mentioned after the first song this evening"
    },
    {
      "id": 154,
      "start": 428.6199951171875,
      "end": 429.6199951171875,
      "text": " in Sunday school this morning,"
    },
    {
      "id": 155,
      "start": 429.6199951171875,
      "end": 431.8599853515625,
      "text": " we dealt with the blood of Christ"
    },
    {
      "id": 156,
      "start": 431.8599853515625,
      "end": 434.3800048828125,
      "text": " and the importance of Christ's blood."
    },
    {
      "id": 157,
      "start": 434.3800048828125,
      "end": 438.3399963378906,
      "text": " And I'm so thankful that God showed us in his word"
    },
    {
      "id": 158,
      "start": 438.3399963378906,
      "end": 440.94000244140625,
      "text": " from the beginning in Genesis three,"
    },
    {
      "id": 159,
      "start": 440.94000244140625,
      "end": 443.2799987792969,
      "text": " and we looked at so many examples this morning"
    },
    {
      "id": 160,
      "start": 443.2799987792969,
      "end": 444.5400085449219,
      "text": " of the blood of Christ."
    },
    {
      "id": 161,
      "start": 444.5400085449219,
      "end": 446.239990234375,
      "text": " And we understand that we're not redeemed"
    },
    {
      "id": 162,
      "start": 446.239990234375,
      "end": 447.5,
      "text": " with corruptible things,"
    },
    {
      "id": 163,
      "start": 447.5,
      "end": 450.94000244140625,
      "text": " but we're redeemed with the precious blood of Christ."
    },
    {
      "id": 164,
      "start": 450.94000244140625,
      "end": 452.70001220703125,
      "text": " And hallelujah for that truth."
    },
    {
      "id": 165,
      "start": 452.70001220703125,
      "end": 455.5,
      "text": " And we find this evening that as we have"
    },
    {
      "id": 166,
      "start": 455.5,
      "end": 457.3399963378906,
      "text": " this time of reflection,"
    },
    {
      "id": 167,
      "start": 457.3399963378906,
      "end": 461.2799987792969,
      "text": " that it brings our minds back to Calvary."
    },
    {
      "id": 168,
      "start": 461.2799987792969,
      "end": 464.8999938964844,
      "text": " It causes us as the people of God,"
    },
    {
      "id": 169,
      "start": 464.8999938964844,
      "end": 467.05999755859375,
      "text": " those that have been saved by the grace of God,"
    },
    {
      "id": 170,
      "start": 467.05999755859375,
      "end": 469.4200134277344,
      "text": " if you're here tonight, you know that heaven is your home,"
    },
    {
      "id": 171,
      "start": 469.4200134277344,
      "end": 471.5199890136719,
      "text": " you've been saved by the blood of Christ,"
    },
    {
      "id": 172,
      "start": 471.5199890136719,
      "end": 472.7799987792969,
      "text": " you have been redeemed,"
    },
    {
      "id": 173,
      "start": 472.7799987792969,
      "end": 475.05999755859375,
      "text": " understanding that there's no works that you can do"
    },
    {
      "id": 174,
      "start": 475.05999755859375,
      "end": 476.29998779296875,
      "text": " to get to heaven on your own,"
    },
    {
      "id": 175,
      "start": 476.29998779296875,
      "end": 479.1000061035156,
      "text": " there's no merit in anything that you could do,"
    },
    {
      "id": 176,
      "start": 479.1000061035156,
      "end": 481.17999267578125,
      "text": " Jesus Christ paid it all,"
    },
    {
      "id": 177,
      "start": 481.17999267578125,
      "end": 483.4200134277344,
      "text": " and you've trusted Christ as your savior."
    },
    {
      "id": 178,
      "start": 483.4200134277344,
      "end": 485.8399963378906,
      "text": " Well, when we observe this Lord's Supper,"
    },
    {
      "id": 179,
      "start": 485.8399963378906,
      "end": 490.1400146484375,
      "text": " it causes you to reflect on what Christ did for you,"
    },
    {
      "id": 180,
      "start": 490.1400146484375,
      "end": 491.3800048828125,
      "text": " and how much he loved you,"
    },
    {
      "id": 181,
      "start": 491.3800048828125,
      "end": 493.8999938964844,
      "text": " and how he was willing to go to that cross."
    },
    {
      "id": 182,
      "start": 493.8999938964844,
      "end": 497.1000061035156,
      "text": " He said in John 10 that he's the good shepherd."
    },
    {
      "id": 183,
      "start": 497.1000061035156,
      "end": 498.5,
      "text": " And he said as the good shepherd"
    },
    {
      "id": 184,
      "start": 498.5,
      "end": 503.5,
      "text": " that he was going to lay down his life for the sheep."
    },
    {
      "id": 185,
      "start": 503.6600036621094,
      "end": 504.5,
      "text": " Why?"
    },
    {
      "id": 186,
      "start": 504.5,
      "end": 507.17999267578125,
      "text": " Because the only way for mankind to be redeemed,"
    },
    {
      "id": 187,
      "start": 507.17999267578125,
      "end": 509.8999938964844,
      "text": " to be reconciled was if God in flesh,"
    },
    {
      "id": 188,
      "start": 509.8999938964844,
      "end": 511.6199951171875,
      "text": " the Lord Jesus Christ,"
    },
    {
      "id": 189,
      "start": 511.6199951171875,
      "end": 514.9400024414062,
      "text": " took our place on the cross of Calvary."
    },
    {
      "id": 190,
      "start": 514.9400024414062,
      "end": 516.47998046875,
      "text": " And hallelujah that he did."
    },
    {
      "id": 191,
      "start": 516.47998046875,
      "end": 517.97998046875,
      "text": " If you're not sure of heaven,"
    },
    {
      "id": 192,
      "start": 517.97998046875,
      "end": 519.0999755859375,
      "text": " maybe you're here this evening,"
    },
    {
      "id": 193,
      "start": 519.0999755859375,
      "end": 520.02001953125,
      "text": " you've never been saved,"
    },
    {
      "id": 194,
      "start": 520.02001953125,
      "end": 522.1799926757812,
      "text": " maybe somebody's tuned in via live stream this evening,"
    },
    {
      "id": 195,
      "start": 522.1799926757812,
      "end": 523.4199829101562,
      "text": " and they've never been saved,"
    },
    {
      "id": 196,
      "start": 523.4199829101562,
      "end": 526.0999755859375,
      "text": " and they do not have that assurance"
    },
    {
      "id": 197,
      "start": 526.0999755859375,
      "end": 527.260009765625,
      "text": " that heaven is your home."
    },
    {
      "id": 198,
      "start": 527.260009765625,
      "end": 528.3400268554688,
      "text": " Could I tell you this evening"
    },
    {
      "id": 199,
      "start": 528.3400268554688,
      "end": 530.739990234375,
      "text": " that these elements that we will partake of,"
    },
    {
      "id": 200,
      "start": 530.739990234375,
      "end": 533.0599975585938,
      "text": " really they're not for you if you're not saved,"
    },
    {
      "id": 201,
      "start": 533.0599975585938,
      "end": 534.6199951171875,
      "text": " they're for saved people."
    },
    {
      "id": 202,
      "start": 534.6199951171875,
      "end": 536.219970703125,
      "text": " But if somebody is not saved,"
    },
    {
      "id": 203,
      "start": 536.219970703125,
      "end": 537.8800048828125,
      "text": " these elements, they can't save you,"
    },
    {
      "id": 204,
      "start": 537.8800048828125,
      "end": 540.239990234375,
      "text": " there's no saving grace in them."
    },
    {
      "id": 205,
      "start": 540.239990234375,
      "end": 542.4000244140625,
      "text": " What you need tonight is salvation."
    },
    {
      "id": 206,
      "start": 542.4000244140625,
      "end": 543.5599975585938,
      "text": " You need to be born again,"
    },
    {
      "id": 207,
      "start": 543.5599975585938,
      "end": 545.6400146484375,
      "text": " to understand that you're a sinner"
    },
    {
      "id": 208,
      "start": 545.6400146484375,
      "end": 547.6400146484375,
      "text": " and that Jesus is the only savior."
    },
    {
      "id": 209,
      "start": 547.6400146484375,
      "end": 549.8400268554688,
      "text": " And he said that he loved you and he died for you."
    },
    {
      "id": 210,
      "start": 549.8400268554688,
      "end": 551.3599853515625,
      "text": " He said that this, he said,"
    },
    {
      "id": 211,
      "start": 551.3599853515625,
      "end": 554.0399780273438,
      "text": " I am the way, the truth, and the life."
    },
    {
      "id": 212,
      "start": 554.0399780273438,
      "end": 557.760009765625,
      "text": " No man cometh unto the Father but by me."
    },
    {
      "id": 213,
      "start": 557.760009765625,
      "end": 560.260009765625,
      "text": " Peter declared in Acts 4,"
    },
    {
      "id": 214,
      "start": 560.260009765625,
      "end": 563.239990234375,
      "text": " neither is there salvation in any other."
    },
    {
      "id": 215,
      "start": 563.239990234375,
      "end": 566.47998046875,
      "text": " There's no other name under heaven given among men"
    },
    {
      "id": 216,
      "start": 566.47998046875,
      "end": 570.5999755859375,
      "text": " whereby we must be saved."
    },
    {
      "id": 217,
      "start": 570.5999755859375,
      "end": 573.0800170898438,
      "text": " We find that God, the God of the universe,"
    },
    {
      "id": 218,
      "start": 573.0800170898438,
      "end": 574.280029296875,
      "text": " he offers a gift."
    },
    {
      "id": 219,
      "start": 574.280029296875,
      "end": 576.7999877929688,
      "text": " We refer to it as God refers to it"
    },
    {
      "id": 220,
      "start": 576.7999877929688,
      "end": 578.0399780273438,
      "text": " as the gift of God,"
    },
    {
      "id": 221,
      "start": 578.0399780273438,
      "end": 581.5599975585938,
      "text": " which is eternal life through Jesus Christ, our Lord."
    },
    {
      "id": 222,
      "start": 581.5599975585938,
      "end": 583.6799926757812,
      "text": " And I'm so thankful that he offers that gift."
    },
    {
      "id": 223,
      "start": 583.6799926757812,
      "end": 585.3400268554688,
      "text": " I've had opportunities over the years,"
    },
    {
      "id": 224,
      "start": 585.3400268554688,
      "end": 586.5599975585938,
      "text": " as many of you have,"
    },
    {
      "id": 225,
      "start": 586.5599975585938,
      "end": 589.0599975585938,
      "text": " to be able to speak to someone about the gift of God,"
    },
    {
      "id": 226,
      "start": 589.0599975585938,
      "end": 592.02001953125,
      "text": " to be able to talk to them about how much God loved them"
    },
    {
      "id": 227,
      "start": 592.02001953125,
      "end": 595.280029296875,
      "text": " and share with them the gospel of Jesus Christ."
    },
    {
      "id": 228,
      "start": 595.280029296875,
      "end": 596.760009765625,
      "text": " We just sang this evening about,"
    },
    {
      "id": 229,
      "start": 596.760009765625,
      "end": 599.2000122070312,
      "text": " Lord, give me a passion for souls."
    },
    {
      "id": 230,
      "start": 599.2000122070312,
      "end": 600.0399780273438,
      "text": " Why?"
    },
    {
      "id": 0,
      "start": 600.0399780273438,
      "end": 604.6799778938293,
      "text": " we sing that song? Well, because we understand the grace of God, we understand the love of"
    },
    {
      "id": 1,
      "start": 604.6799778938293,
      "end": 610.1199779510498,
      "text": " God, we understand the gospel. And Paul said, I am not ashamed of the gospel of Christ."
    },
    {
      "id": 2,
      "start": 610.1199779510498,
      "end": 615.399977684021,
      "text": " Why? For it is the power of God unto salvation to everyone that believe it, to the Jew first"
    },
    {
      "id": 3,
      "start": 615.399977684021,
      "end": 620.6399784088135,
      "text": " and also to the Greek. So this evening as we observe the Lord's Supper, we find first"
    },
    {
      "id": 4,
      "start": 620.6399784088135,
      "end": 628.0399780273438,
      "text": " of all that the Lord's Supper is a time of reflection. Time of reflection. I hope tonight"
    },
    {
      "id": 5,
      "start": 628.0399780273438,
      "end": 636.9599761962891,
      "text": " that you never get over what Christ did so that you could be saved. I hope that you never"
    },
    {
      "id": 6,
      "start": 636.9599761962891,
      "end": 644.4799766540527,
      "text": " get over it, lose the awe of it. How shall we escape if we neglect so great salvation"
    },
    {
      "id": 7,
      "start": 644.4799766540527,
      "end": 650.4399795532227,
      "text": " we read in the book of Hebrews? I hope that we never get over what Christ did for us."
    },
    {
      "id": 8,
      "start": 650.4399795532227,
      "end": 656.1599769592285,
      "text": " It's a time that we can reflect on. By the way, baptism, the second ordinance, if we"
    },
    {
      "id": 9,
      "start": 656.1599769592285,
      "end": 659.8799781799316,
      "text": " look at those two ordinances that were given to the local church, that too represents the"
    },
    {
      "id": 10,
      "start": 659.8799781799316,
      "end": 664.9999771118164,
      "text": " fact that Jesus Christ died for us, he was buried and he rose again. So what does it"
    },
    {
      "id": 11,
      "start": 664.9999771118164,
      "end": 668.9199752807617,
      "text": " remind us of? Well, it reminds us of what Christ did for us so we could be saved. So"
    },
    {
      "id": 12,
      "start": 668.9199752807617,
      "end": 673.4399795532227,
      "text": " it's a time of reflection. Number two this evening, I believe that the Lord's Supper"
    },
    {
      "id": 13,
      "start": 673.4399795532227,
      "end": 678.6799774169922,
      "text": " is not only a time of reflection, but I believe that it's a time of rejoicing. If you're saved"
    },
    {
      "id": 14,
      "start": 678.6799774169922,
      "end": 683.2799758911133,
      "text": " tonight, observing the Lord's Supper is a time of rejoicing. And we begin to rejoice."
    },
    {
      "id": 15,
      "start": 683.3999786376953,
      "end": 688.359977722168,
      "text": " Why? Because we understand the sacrifice that was made on the cross of Calvary. We understand"
    },
    {
      "id": 16,
      "start": 688.359977722168,
      "end": 693.0399780273438,
      "text": " as we look at this passage of Scripture here this evening that not only is it this due"
    },
    {
      "id": 17,
      "start": 693.0399780273438,
      "end": 698.8399810791016,
      "text": " in remembrance of me, this reflection back at what Jesus did, but it's a time of rejoicing."
    },
    {
      "id": 18,
      "start": 698.8399810791016,
      "end": 705.6399765014648,
      "text": " Why? Because God loved me and he died for me so that I could be saved. He loved me so"
    },
    {
      "id": 19,
      "start": 705.6399765014648,
      "end": 712.6399765014648,
      "text": " much I was that valuable, you were that valuable to God, that he died for you. It's a time"
    },
    {
      "id": 20,
      "start": 713.359977722168,
      "end": 720.1199798583984,
      "text": " of rejoicing that we rejoice in the sacrifice that Christ made at Calvary. Not only a time"
    },
    {
      "id": 21,
      "start": 720.1199798583984,
      "end": 725.0399780273438,
      "text": " of rejoicing because of the sacrifice, the substitutionary atonement, but we find that"
    },
    {
      "id": 22,
      "start": 725.0399780273438,
      "end": 730.3399810791016,
      "text": " it's a time of rejoicing. Why? Because of his glorious resurrection. You know, we take"
    },
    {
      "id": 23,
      "start": 730.3799743652344,
      "end": 735.1799774169922,
      "text": " and look at the Lord's Supper here and we understand that the Bible says in verse 26,"
    },
    {
      "id": 24,
      "start": 735.1799774169922,
      "end": 741.7799835205078,
      "text": " for as often as you drink this bread and, excuse me, eat this bread and drink this cup."
    },
    {
      "id": 25,
      "start": 741.7799835205078,
      "end": 745.5799713134766,
      "text": " Notice the Bible doesn't tell us how often to do it, but it simply says for as often"
    },
    {
      "id": 26,
      "start": 745.5799713134766,
      "end": 750.5799713134766,
      "text": " as you eat this bread and drink this cup. Notice the Bible says ye do show the Lord's"
    },
    {
      "id": 27,
      "start": 750.5799713134766,
      "end": 757.5799713134766,
      "text": " death till he come. So it doesn't capture in that verse of Scripture the resurrection,"
    },
    {
      "id": 28,
      "start": 757.5799713134766,
      "end": 763.0999755859375,
      "text": " but it's obvious as you read the Scripture that it says that we're reminded of his death"
    },
    {
      "id": 29,
      "start": 763.0999755859375,
      "end": 770.0999755859375,
      "text": " and we do show his death till he come. Well, he's coming back because he rose again. Amen?"
    },
    {
      "id": 30,
      "start": 771.219970703125,
      "end": 776.5399780273438,
      "text": " And so we celebrate the glorious resurrection, we think, as we have in just a few weeks,"
    },
    {
      "id": 31,
      "start": 776.5399780273438,
      "end": 781.6199798583984,
      "text": " the opportunity to have Resurrection Sunday. But we understand that every Sunday is Resurrection"
    },
    {
      "id": 32,
      "start": 781.6199798583984,
      "end": 786.1399841308594,
      "text": " Sunday. Why is it that we meet on Sunday? Well, because we serve a risen Savior. Up"
    },
    {
      "id": 33,
      "start": 786.1799774169922,
      "end": 791.5799713134766,
      "text": " from the grave he arose. We sing that song and we rejoice in understanding that he lives,"
    },
    {
      "id": 34,
      "start": 791.5799713134766,
      "end": 798.1799774169922,
      "text": " he lives, Christ Jesus lives today. But we find that the resurrection is the cornerstone"
    },
    {
      "id": 35,
      "start": 798.1799774169922,
      "end": 804.2599792480469,
      "text": " of our faith. The book of 1 Corinthians, it says if Christ be not risen, then our faith"
    },
    {
      "id": 36,
      "start": 804.2599792480469,
      "end": 810.0599822998047,
      "text": " is in vain, our preaching is in vain. But what separates biblical Christianity from"
    },
    {
      "id": 37,
      "start": 810.0599822998047,
      "end": 814.5399780273438,
      "text": " any other religion, and it's not a religion, but if I could use that term this evening"
    },
    {
      "id": 38,
      "start": 814.5399780273438,
      "end": 821.5399780273438,
      "text": " of any other religion of the world, is that we serve a risen Savior. You can go to Israel"
    },
    {
      "id": 39,
      "start": 822.7799835205078,
      "end": 829.219970703125,
      "text": " and you can go and you can walk and you can see and you're not going to find any bones"
    },
    {
      "id": 40,
      "start": 829.219970703125,
      "end": 836.219970703125,
      "text": " of Jesus because he rose. You can argue about which place is the right place, but the reality"
    },
    {
      "id": 41,
      "start": 837.4999847412109,
      "end": 843.7799835205078,
      "text": " is that it was just a borrowed place. Amen? And he rose conquering sin, death, and the"
    },
    {
      "id": 42,
      "start": 844.0599822998047,
      "end": 849.6199798583984,
      "text": " grave. They came early that morning to the tomb and guess what they found? They found"
    },
    {
      "id": 43,
      "start": 849.6199798583984,
      "end": 855.4599761962891,
      "text": " that the stone was rolled away. So when we celebrate, when we observe the Lord's Supper,"
    },
    {
      "id": 44,
      "start": 855.4599761962891,
      "end": 860.3399658203125,
      "text": " it's a time of reflection, yes, but it's a time of rejoicing. Why? Because Jesus died"
    },
    {
      "id": 45,
      "start": 860.3399658203125,
      "end": 866.5799865722656,
      "text": " for me. Because Jesus rose conquering sin, death, and the grave. We can rejoice because"
    },
    {
      "id": 46,
      "start": 866.5799865722656,
      "end": 873.5799865722656,
      "text": " of his exalted position. You know, at this very moment, Jesus Christ is exalted in heaven"
    },
    {
      "id": 47,
      "start": 874.1799926757812,
      "end": 879.3799743652344,
      "text": " and we can read of the account in the book of Acts in the first chapter and after the"
    },
    {
      "id": 48,
      "start": 879.3799743652344,
      "end": 885.6999816894531,
      "text": " resurrection of Jesus Christ, he lived on this earth and gave instruction to his disciples,"
    },
    {
      "id": 49,
      "start": 885.6999816894531,
      "end": 889.9399719238281,
      "text": " but then came the day that he would ascend to heaven. And the Bible records it at the"
    },
    {
      "id": 50,
      "start": 889.9399719238281,
      "end": 893.8599853515625,
      "text": " end of the Gospel of Luke and then in Acts chapter number 1, and the Bible says that"
    },
    {
      "id": 51,
      "start": 893.8599853515625,
      "end": 898.3399658203125,
      "text": " Jesus gave instruction and then as they were standing there and receiving that instruction,"
    },
    {
      "id": 52,
      "start": 898.3399658203125,
      "end": 902.4199829101562,
      "text": " the Bible tells us that Jesus was ascended up into heaven. What a sight it would have"
    },
    {
      "id": 53,
      "start": 902.4199829101562,
      "end": 908.8599853515625,
      "text": " been. These men, they continue to stand there looking up into heaven and then the angels"
    },
    {
      "id": 54,
      "start": 908.8599853515625,
      "end": 915.2599792480469,
      "text": " come and say, you men of Galilee, why stand ye gazing up into heaven? We'll deal with"
    },
    {
      "id": 55,
      "start": 915.2599792480469,
      "end": 920.7799682617188,
      "text": " the rest of that statement in just a moment, but understand that he's in an exalted position."
    },
    {
      "id": 56,
      "start": 920.7799682617188,
      "end": 924.6199645996094,
      "text": " The Bible says that he ever liveth to make intercession for us. If you're a child of"
    },
    {
      "id": 57,
      "start": 924.6199645996094,
      "end": 928.3799743652344,
      "text": " God this evening, if you're saved by the grace of God, then you understand that as"
    },
    {
      "id": 58,
      "start": 928.3799743652344,
      "end": 934.5399780273438,
      "text": " Jesus is in this exalted position, that he ever lives to make intercession for us. And"
    },
    {
      "id": 59,
      "start": 934.5399780273438,
      "end": 939.0199890136719,
      "text": " what a blessing that is. He's at the right hand of the Father. He's in the throne room"
    },
    {
      "id": 60,
      "start": 939.0199890136719,
      "end": 946.4999694824219,
      "text": " of heaven and he lives. He's alive. He's making intercession for us. Hallelujah. And it should"
    },
    {
      "id": 61,
      "start": 946.4999694824219,
      "end": 951.6199645996094,
      "text": " cause us to rejoice as we observe the Lord's Supper. Yes, it's a time of reflection, but"
    },
    {
      "id": 62,
      "start": 951.6199645996094,
      "end": 959.2999877929688,
      "text": " it's a time of rejoicing. We have hope and we have this peace because we serve a risen"
    },
    {
      "id": 63,
      "start": 959.2999877929688,
      "end": 965.2999877929688,
      "text": " Savior because he is exalted. The Bible tells us that God has given a name which is above"
    },
    {
      "id": 64,
      "start": 965.2999877929688,
      "end": 970.7799682617188,
      "text": " every name. In the name of Jesus, every tongue should confess and every knee is going to"
    },
    {
      "id": 65,
      "start": 970.7799682617188,
      "end": 977.4599914550781,
      "text": " bow that Jesus Christ is Lord. The glory of the Father. What a blessing to understand"
    },
    {
      "id": 66,
      "start": 977.4599914550781,
      "end": 982.8199768066406,
      "text": " the exalted position of our Savior. Notice the last three words of verse 26. The Bible"
    },
    {
      "id": 67,
      "start": 982.8199768066406,
      "end": 992.1799926757812,
      "text": " says, till he come. A time of rejoicing because of his promised return. A time of rejoicing"
    },
    {
      "id": 68,
      "start": 992.1799926757812,
      "end": 996.6999816894531,
      "text": " because of his promised return. As we observe the Lord's Supper, we're reminded of what"
    },
    {
      "id": 69,
      "start": 996.6999816894531,
      "end": 1003.3799743652344,
      "text": " Christ did for us. We're reminded of what he's currently doing for us, but we're reminded"
    },
    {
      "id": 70,
      "start": 1003.3799743652344,
      "end": 1008.4999694824219,
      "text": " that one day he's coming back for us. Because the Bible says that as often as you eat this"
    },
    {
      "id": 71,
      "start": 1008.4999694824219,
      "end": 1015.6199645996094,
      "text": " bread and drink this cup, you do show the Lord's death till he come. I'm looking forward"
    },
    {
      "id": 72,
      "start": 1015.6199645996094,
      "end": 1021.5399780273438,
      "text": " to the trumpet of the Lord sounding. I'm looking forward to being with my Savior for all of"
    },
    {
      "id": 73,
      "start": 1021.5399780273438,
      "end": 1026.7799682617188,
      "text": " eternity. And the Bible says that Jesus is coming back. He says to the disciples, let"
    },
    {
      "id": 74,
      "start": 1026.7799682617188,
      "end": 1031.0999755859375,
      "text": " not your heart be troubled. You believe in God, believe also in me. In my Father's house"
    },
    {
      "id": 75,
      "start": 1031.0999755859375,
      "end": 1035.4199829101562,
      "text": " are many mansions, if it were not so, I would have told you. I go to prepare a place for"
    },
    {
      "id": 76,
      "start": 1035.4199829101562,
      "end": 1042.1399841308594,
      "text": " you. And if I go and prepare a place for you, I will come again. That where I am, there"
    },
    {
      "id": 77,
      "start": 1042.1399841308594,
      "end": 1047.0599670410156,
      "text": " ye may be also. The Bible says in a moment, the twinkling of an eye. The Bible says the"
    },
    {
      "id": 78,
      "start": 1047.0599670410156,
      "end": 1054.0199890136719,
      "text": " last trump. We find that that's the truth in 1 Corinthians 15. In 1 Thessalonians chapter"
    },
    {
      "id": 79,
      "start": 1054.0199890136719,
      "end": 1061.2599792480469,
      "text": " 4, the Bible says this, for the Lord himself shall descend from heaven with a shout, with"
    },
    {
      "id": 80,
      "start": 1061.2599792480469,
      "end": 1066.6599731445312,
      "text": " the voice of an archangel, with the trump of God and the dead in Christ shall rise first."
    },
    {
      "id": 81,
      "start": 1066.6599731445312,
      "end": 1070.4999694824219,
      "text": " Then we which are alive and remain shall be caught up together with them in the clouds"
    },
    {
      "id": 82,
      "start": 1070.4999694824219,
      "end": 1075.1799926757812,
      "text": " to meet the Lord in the air and so shall we ever be with the Lord. Wherefore, comfort"
    },
    {
      "id": 83,
      "start": 1075.1799926757812,
      "end": 1082.219970703125,
      "text": " one another with these words. There in Acts chapter 1, when the disciples saw Jesus ascending"
    },
    {
      "id": 84,
      "start": 1082.219970703125,
      "end": 1085.8199768066406,
      "text": " up into heaven and those angels came and said, ye men of Galilee, why stand ye gazing"
    },
    {
      "id": 85,
      "start": 1085.8199768066406,
      "end": 1091.2599792480469,
      "text": " up into heaven? They finish and say this, this same Jesus which you've seen go up into"
    },
    {
      "id": 86,
      "start": 1091.2599792480469,
      "end": 1098.3799743652344,
      "text": " heaven shall come again. He shall come in like matter, is what the Bible says. And this"
    },
    {
      "id": 87,
      "start": 1098.3799743652344,
      "end": 1103.6199645996094,
      "text": " evening when we begin to think about this promise that we read in 1 Corinthians chapter"
    },
    {
      "id": 88,
      "start": 1103.6199645996094,
      "end": 1109.6599731445312,
      "text": " 11 and verse number 26 as we look at this truth that the Lord's Supper, it shows his"
    },
    {
      "id": 89,
      "start": 1109.8199768066406,
      "end": 1119.8200073242188,
      "text": " death, till he come. I often think about the return of the Lord. It's an exciting truth"
    },
    {
      "id": 90,
      "start": 1119.8200073242188,
      "end": 1127.1599731445312,
      "text": " of God's Word. It's a reality. It's going to happen. We live every day with the understanding"
    },
    {
      "id": 91,
      "start": 1127.1599731445312,
      "end": 1133.219970703125,
      "text": " of the imminent return of Christ. I wonder this evening, are you ready for his return?"
    },
    {
      "id": 92,
      "start": 1133.219970703125,
      "end": 1140.5399780273438,
      "text": " Are you ready for his return? The Bible says in 1 John, the truth with regard to the coming"
    },
    {
      "id": 93,
      "start": 1140.5399780273438,
      "end": 1147.6599731445312,
      "text": " of Christ and the fact that we have this hope. He says, every man that hath this hope purifies"
    },
    {
      "id": 94,
      "start": 1147.6599731445312,
      "end": 1157.1799926757812,
      "text": " himself even as he is pure. The Bible says that we could be ashamed at his appearing."
    },
    {
      "id": 95,
      "start": 1157.1799926757812,
      "end": 1163.5,
      "text": " I hope this evening that no one here would be ashamed at the appearing of Christ. That"
    },
    {
      "id": 96,
      "start": 1163.5,
      "end": 1170.8200073242188,
      "text": " we'd live every moment as if it could be the last moment that Jesus is coming back. What"
    },
    {
      "id": 97,
      "start": 1170.8200073242188,
      "end": 1177.5199584960938,
      "text": " a blessed reality of Scripture. We look at this Lord's Supper this evening and we see"
    },
    {
      "id": 98,
      "start": 1177.5199584960938,
      "end": 1183.739990234375,
      "text": " that it's a time of reflection, no doubt. We find it's a time of rejoicing or this evening."
    },
    {
      "id": 99,
      "start": 1184.4599609375,
      "end": 1189.8200073242188,
      "text": " How are we doing with rejoicing? Wednesday evening this past week I had as our study"
    },
    {
      "id": 100,
      "start": 1189.8200073242188,
      "end": 1195.5799560546875,
      "text": " 1 Thessalonians 5 and verse 16 as we're studying through the instructions given to the church"
    },
    {
      "id": 101,
      "start": 1195.5799560546875,
      "end": 1200.0999755859375,
      "text": " at Thessalonica at the end of 1 Thessalonians 5 and eventually we'll get to the end of"
    },
    {
      "id": 0,
      "start": 1200.0999755859375,
      "end": 1205.739975452423,
      "text": " 2 Thessalonians 3. And as we look at those two passages of Scripture we find that God"
    },
    {
      "id": 1,
      "start": 1205.739975452423,
      "end": 1210.9799757003784,
      "text": " gives us some very practical instruction for every local church. This past Wednesday evening"
    },
    {
      "id": 2,
      "start": 1210.9799757003784,
      "end": 1218.819974899292,
      "text": " the simple verse of Scripture that we dealt with was rejoice evermore. Literally to rejoice"
    },
    {
      "id": 3,
      "start": 1218.819974899292,
      "end": 1224.6999759674072,
      "text": " at all times. And we find this evening that as we observe the Lord's Supper it should"
    },
    {
      "id": 4,
      "start": 1224.6999759674072,
      "end": 1231.1799755096436,
      "text": " be a time of rejoicing. Time of rejoicing. I wonder as you go throughout your day, as"
    },
    {
      "id": 5,
      "start": 1231.1799755096436,
      "end": 1235.739974975586,
      "text": " you go throughout this week, how often are we rejoicing because of what Jesus did for"
    },
    {
      "id": 6,
      "start": 1235.739974975586,
      "end": 1240.459976196289,
      "text": " us? Because of the ultimate price that was paid at Calvary? How often are we rejoicing"
    },
    {
      "id": 7,
      "start": 1240.459976196289,
      "end": 1246.5599746704102,
      "text": " because He rose conquering sin, death and the grave? How often do we live in that resurrection"
    },
    {
      "id": 8,
      "start": 1246.5599746704102,
      "end": 1254.0799751281738,
      "text": " power understanding that we serve a risen Savior? How often do we rejoice knowing that"
    },
    {
      "id": 9,
      "start": 1254.0799751281738,
      "end": 1259.959976196289,
      "text": " He's at the right hand of the Father making intercession for us? How often do we rejoice"
    },
    {
      "id": 10,
      "start": 1259.959976196289,
      "end": 1266.7199783325195,
      "text": " knowing that He's coming again? I hope that you're longing for His return. But understand"
    },
    {
      "id": 11,
      "start": 1266.7199783325195,
      "end": 1272.2799758911133,
      "text": " with me this evening that the time is short. He says that we're to redeem the time because"
    },
    {
      "id": 12,
      "start": 1272.2799758911133,
      "end": 1278.9999771118164,
      "text": " the days are evil. When Jesus comes back, and I'm looking forward to Him coming back,"
    },
    {
      "id": 13,
      "start": 1278.9999771118164,
      "end": 1285.359977722168,
      "text": " but you know there's no more opportunity to share the gospel with someone. There's no"
    },
    {
      "id": 14,
      "start": 1285.359977722168,
      "end": 1292.5199737548828,
      "text": " more opportunity to be surrendered, to be yielded. There's no more opportunity to send"
    },
    {
      "id": 15,
      "start": 1292.5199737548828,
      "end": 1299.0399780273438,
      "text": " a missionary to give a contribution to… all those opportunities are gone. Why? Because"
    },
    {
      "id": 16,
      "start": 1299.0399780273438,
      "end": 1305.6799774169922,
      "text": " you will ever be with the Lord. So this evening as we think about this time of rejoicing,"
    },
    {
      "id": 17,
      "start": 1305.6799774169922,
      "end": 1311.2799758911133,
      "text": " I hope that we would rejoice greatly as we observe the Lord's Supper this evening. I"
    },
    {
      "id": 18,
      "start": 1311.2799758911133,
      "end": 1316.839973449707,
      "text": " would say that not only is it a time of reflection and a time of rejoicing, but I would say this,"
    },
    {
      "id": 19,
      "start": 1316.839973449707,
      "end": 1321.9999771118164,
      "text": " number three, if you're taking notes, it's a time to refocus. Time to refocus. You know"
    },
    {
      "id": 20,
      "start": 1321.9999771118164,
      "end": 1327.0399780273438,
      "text": " if we're not careful in life we can lose our focus. You ever have that happen? You"
    },
    {
      "id": 21,
      "start": 1327.2799758911133,
      "end": 1332.719970703125,
      "text": " ever get distracted by something? You ever see a squirrel? Seems like those squirrels,"
    },
    {
      "id": 22,
      "start": 1332.719970703125,
      "end": 1336.0399780273438,
      "text": " I mean they get distracted by everything, but sometimes we can be the same way. We can"
    },
    {
      "id": 23,
      "start": 1336.0399780273438,
      "end": 1341.5199737548828,
      "text": " just get distracted by things. Some people are easily distracted, some people are oblivious."
    },
    {
      "id": 24,
      "start": 1341.5199737548828,
      "end": 1346.2599792480469,
      "text": " You've met both kinds, no doubt. But understand with me this evening that there are times"
    },
    {
      "id": 25,
      "start": 1346.2599792480469,
      "end": 1350.4399719238281,
      "text": " in our lives as Christians, as followers of the Lord Jesus Christ, that we can lose our"
    },
    {
      "id": 26,
      "start": 1350.4399719238281,
      "end": 1356.47998046875,
      "text": " focus. We can get distracted. We can get distracted by the things of this world. We can get distracted"
    },
    {
      "id": 27,
      "start": 1356.6399688720703,
      "end": 1363.6399688720703,
      "text": " by good things that might not be the best things. We can get distracted by being involved"
    },
    {
      "id": 28,
      "start": 1364.3999786376953,
      "end": 1370.5199737548828,
      "text": " in something that we think is a good thing, is an honorable task, but it's not the best"
    },
    {
      "id": 29,
      "start": 1370.5199737548828,
      "end": 1377.5199737548828,
      "text": " thing. It's not what God wants us to be doing. On any given day that God would give to any"
    },
    {
      "id": 30,
      "start": 1378.7599792480469,
      "end": 1383.959976196289,
      "text": " of us, we have the same amount of time. You ever hear somebody say, I need to make some"
    },
    {
      "id": 31,
      "start": 1383.959976196289,
      "end": 1390.6399688720703,
      "text": " time? You can't make time. All you can do is manage it. You can steward time. And how"
    },
    {
      "id": 32,
      "start": 1390.6399688720703,
      "end": 1397.6399688720703,
      "text": " we steward time is so important because time, once it's gone, is gone. And this evening,"
    },
    {
      "id": 33,
      "start": 1399.6399688720703,
      "end": 1406.1999816894531,
      "text": " when we think about this time to refocus, the reality is that as God's people living"
    },
    {
      "id": 34,
      "start": 1406.1999816894531,
      "end": 1412.9399719238281,
      "text": " in the world, though we're not of the world, we can become distracted. I think about Peter"
    },
    {
      "id": 35,
      "start": 1412.9399719238281,
      "end": 1419.2999725341797,
      "text": " in John chapter 21. He's talking with the Lord Jesus Christ, and the understanding in"
    },
    {
      "id": 36,
      "start": 1419.2999725341797,
      "end": 1424.9399719238281,
      "text": " John 21, it starts with Peter saying, I go fishing, and he's out there, and then Jesus"
    },
    {
      "id": 37,
      "start": 1424.9399719238281,
      "end": 1429.1799774169922,
      "text": " is on the shore, and he calls out to those that are there in the boat, and he says, have"
    },
    {
      "id": 38,
      "start": 1429.1799774169922,
      "end": 1436.1799774169922,
      "text": " you any, did you catch anything? Now that's a bad question if you've not caught anything."
    },
    {
      "id": 39,
      "start": 1436.8199768066406,
      "end": 1443.8199768066406,
      "text": " Right? It's embarrassing as a fisherman if you're out fishing and you've caught nothing."
    },
    {
      "id": 40,
      "start": 1444.1799774169922,
      "end": 1451.1799774169922,
      "text": " By the way, this isn't the first time in Peter's ministry, or Peter's life, I should say, that"
    },
    {
      "id": 41,
      "start": 1451.7799682617188,
      "end": 1455.6199798583984,
      "text": " he was asked this question, or should I say that he had a night where he caught nothing."
    },
    {
      "id": 42,
      "start": 1455.6199798583984,
      "end": 1460.4199829101562,
      "text": " You remember when he was first called to the ministry, he said they've toiled all the night"
    },
    {
      "id": 43,
      "start": 1460.4199829101562,
      "end": 1467.4199829101562,
      "text": " and they've caught nothing, but Jesus says, go out, launch out into the deep. Let down"
    },
    {
      "id": 44,
      "start": 1467.6999816894531,
      "end": 1472.6999816894531,
      "text": " your nets for a draft of fishes. And Peter says we've toiled all the night and we've"
    },
    {
      "id": 45,
      "start": 1472.6999816894531,
      "end": 1479.4599609375,
      "text": " caught nothing, nevertheless at thy word, we'll let down the net, singular. They caught"
    },
    {
      "id": 46,
      "start": 1479.4599609375,
      "end": 1485.1399841308594,
      "text": " so many fish, they had to have people come and help them. And now you fast forward to"
    },
    {
      "id": 47,
      "start": 1485.1399841308594,
      "end": 1491.1799621582031,
      "text": " after the crucifixion and the resurrection, and Peter says I'm going fishing, and the"
    },
    {
      "id": 48,
      "start": 1491.1799621582031,
      "end": 1496.4199829101562,
      "text": " others go with them, and he says, Jesus says in verse number 5 of John 21, children, have"
    },
    {
      "id": 49,
      "start": 1496.4199829101562,
      "end": 1503.4199829101562,
      "text": " ye any meat? And they answered him, no, no. So Jesus said, cast the net on the right side"
    },
    {
      "id": 50,
      "start": 1505.0199890136719,
      "end": 1510.5799865722656,
      "text": " of the ship, and ye shall find. They cast therefore, and now they were not able to draw"
    },
    {
      "id": 51,
      "start": 1510.5799865722656,
      "end": 1517.4999694824219,
      "text": " it for the multitude of fishes. And then John, who refers to himself as the disciple"
    },
    {
      "id": 52,
      "start": 1517.4999694824219,
      "end": 1524.4999694824219,
      "text": " whom Jesus loved, he simply says this, it is the Lord. It is the Lord! And Peter gets"
    },
    {
      "id": 53,
      "start": 1528.1399841308594,
      "end": 1532.6199645996094,
      "text": " excited, he jumps off the boat, man, he's getting back to shore, amen? And he gets to"
    },
    {
      "id": 54,
      "start": 1532.6199645996094,
      "end": 1538.4399719238281,
      "text": " shore and guess what, there's already fish on the fire. And Jesus has this conversation"
    },
    {
      "id": 55,
      "start": 1538.47998046875,
      "end": 1543.1199645996094,
      "text": " with Peter and he says, Peter, do you love me? He goes through that process three times"
    },
    {
      "id": 56,
      "start": 1543.1199645996094,
      "end": 1549.8799743652344,
      "text": " and we find that in verse 19, the Bible says, this spake he signifying by what death he"
    },
    {
      "id": 57,
      "start": 1549.8799743652344,
      "end": 1556.3999633789062,
      "text": " should glorify God. When he had spoken this, he saith unto him, follow me. The instruction"
    },
    {
      "id": 58,
      "start": 1556.3999633789062,
      "end": 1563.3999633789062,
      "text": " was simple, it was direct, it was clear. Follow me. And Peter, the Bible says in verse 20,"
    },
    {
      "id": 59,
      "start": 1564.3999633789062,
      "end": 1569.719970703125,
      "text": " turning about, he seeth the disciple whom Jesus loved following. So what does he do?"
    },
    {
      "id": 60,
      "start": 1569.719970703125,
      "end": 1576.719970703125,
      "text": " Well, he turns around and he sees John. He gets distracted. He sees John. He's heard"
    },
    {
      "id": 61,
      "start": 1576.9599609375,
      "end": 1583.9199829101562,
      "text": " the instruction from Jesus, follow me. And he sees John and he says, look, it says this,"
    },
    {
      "id": 62,
      "start": 1583.9199829101562,
      "end": 1589.5199890136719,
      "text": " which also leaned on his breast at supper and said, Lord, which is he that betrayeth"
    },
    {
      "id": 63,
      "start": 1589.6399841308594,
      "end": 1593.719970703125,
      "text": " thee? So he's talking about John. You can go back to John 13 and verse 25 and see that."
    },
    {
      "id": 64,
      "start": 1593.719970703125,
      "end": 1600.719970703125,
      "text": " Verse 21, Peter seeing him, saith to Jesus, Lord, and what shall this man do? You know,"
    },
    {
      "id": 65,
      "start": 1602.6799621582031,
      "end": 1608.6799621582031,
      "text": " for a moment there, Peter got distracted because he was wondering what's John going to do?"
    },
    {
      "id": 66,
      "start": 1608.6799621582031,
      "end": 1613.8799743652344,
      "text": " You know, if we're not careful, we can get distracted by what somebody else is doing"
    },
    {
      "id": 67,
      "start": 1613.9199829101562,
      "end": 1619.8399658203125,
      "text": " or what somebody else is supposed to be doing. But Jesus was clear in speaking to Peter and"
    },
    {
      "id": 68,
      "start": 1619.8399658203125,
      "end": 1626.8399658203125,
      "text": " said, follow me. And so after Peter asked the question, Lord, what shall this man do?"
    },
    {
      "id": 69,
      "start": 1628.1999816894531,
      "end": 1635.1999816894531,
      "text": " Jesus saith unto him, if I will that he tarry till I come, what is that to thee? Follow"
    },
    {
      "id": 70,
      "start": 1635.1999816894531,
      "end": 1642.1999816894531,
      "text": " thou me. I love the response of Jesus. If I could say it this way, he says, it's none"
    },
    {
      "id": 71,
      "start": 1643.1999816894531,
      "end": 1650.1999816894531,
      "text": " of your business what my plan is for John. Your job is to follow me. He says, if I will"
    },
    {
      "id": 72,
      "start": 1652.7599792480469,
      "end": 1659.7599792480469,
      "text": " that he tarry till I come, what is that to thee? He restates what he had previously revealed"
    },
    {
      "id": 73,
      "start": 1662.8799743652344,
      "end": 1669.8799743652344,
      "text": " to Peter, follow thou me. There's a lot of things that can distract us in life."
    },
    {
      "id": 74,
      "start": 1670.8799743652344,
      "end": 1677.8799743652344,
      "text": " In 1 Corinthians 11, we read this passage with regard to the Lord's Supper. We find"
    },
    {
      "id": 75,
      "start": 1677.9199829101562,
      "end": 1683.1199645996094,
      "text": " that there's reason to rejoice, but really, I believe as a local church, God in His omniscience"
    },
    {
      "id": 76,
      "start": 1683.1199645996094,
      "end": 1689.9199829101562,
      "text": " in giving us this ordinance, it brings us to a place, a sober place of reflecting upon"
    },
    {
      "id": 77,
      "start": 1689.9199829101562,
      "end": 1696.3999633789062,
      "text": " what Christ did for us. It caused us to rejoice in that sacrifice, but also to rejoice in"
    },
    {
      "id": 78,
      "start": 1696.3999633789062,
      "end": 1703.3999633789062,
      "text": " the resurrection and His soon return. But then we refocus. Why? Because we examine"
    },
    {
      "id": 79,
      "start": 1703.8799743652344,
      "end": 1710.0399780273438,
      "text": " ourselves. The Bible says in verse 27, wherefore, whosoever shall eat this bread and drink this"
    },
    {
      "id": 80,
      "start": 1710.0399780273438,
      "end": 1714.6799926757812,
      "text": " cup of the Lord unworthily shall be guilty of the body and blood of the Lord. But let"
    },
    {
      "id": 81,
      "start": 1714.6799926757812,
      "end": 1719.0,
      "text": " a man examine himself, and so let him eat of that bread and drink of that cup. For he"
    },
    {
      "id": 82,
      "start": 1719.0,
      "end": 1723.1399536132812,
      "text": " that eateth and drinketh unworthily eateth and drinketh damnation to himself, not discerning"
    },
    {
      "id": 83,
      "start": 1723.1399536132812,
      "end": 1727.3599853515625,
      "text": " the Lord's body. For this cause, those that were eating and drinking unworthily, many"
    },
    {
      "id": 84,
      "start": 1727.3599853515625,
      "end": 1733.6599731445312,
      "text": " are weak and sickly among you, and many sleep or have died. For if we would judge ourselves,"
    },
    {
      "id": 85,
      "start": 1733.6599731445312,
      "end": 1740.6599731445312,
      "text": " we should not be judged. No doubt as we look at this aspect of this examination, it's so"
    },
    {
      "id": 86,
      "start": 1741.1799926757812,
      "end": 1745.9400024414062,
      "text": " that we would be worthy of taking, partaking of the Lord's Supper. Now understand in our"
    },
    {
      "id": 87,
      "start": 1745.9400024414062,
      "end": 1750.6199951171875,
      "text": " own person, in our own ability, we're never going to be worthy, but if you've been saved"
    },
    {
      "id": 88,
      "start": 1750.6199951171875,
      "end": 1755.0199584960938,
      "text": " by the grace of God, and you're clean as we preached about this morning, there's no"
    },
    {
      "id": 89,
      "start": 1755.0199584960938,
      "end": 1759.2999877929688,
      "text": " sin between me and my Savior, I've confessed whatever it is that God's pointed out in my"
    },
    {
      "id": 90,
      "start": 1759.2999877929688,
      "end": 1766.2999877929688,
      "text": " life, then I can partake of these elements. The idea of these elements in this passage"
    },
    {
      "id": 91,
      "start": 1767.6599731445312,
      "end": 1771.199951171875,
      "text": " with regard to examining ourselves is not to say, well I have sin in my life, so I'm"
    },
    {
      "id": 92,
      "start": 1771.199951171875,
      "end": 1775.9199829101562,
      "text": " just going to pass by, I'm going to let it pass. No, it's that I would deal with it."
    },
    {
      "id": 93,
      "start": 1775.9199829101562,
      "end": 1779.5,
      "text": " If you're not saved this evening, the idea is not that you'd say, well I'm not saved"
    },
    {
      "id": 94,
      "start": 1779.5,
      "end": 1785.5,
      "text": " so that's not for me. No, it's that you would be saved as we observe this Lord's Supper."
    },
    {
      "id": 95,
      "start": 1785.5,
      "end": 1792.5,
      "text": " But I want you to think tonight, yes this aspect of examination, but this time for us"
    },
    {
      "id": 96,
      "start": 1793.5399780273438,
      "end": 1800.5399780273438,
      "text": " to refocus. I want you to consider tonight your position as a child of God."
    },
    {
      "id": 0,
      "start": 1800.5399780273438,
      "end": 1801.5399780273438,
      "text": " God."
    },
    {
      "id": 1,
      "start": 1801.5399780273438,
      "end": 1810.01997756958,
      "text": " If you're saved tonight, if you've been born again, God is your Father, you're His child."
    },
    {
      "id": 2,
      "start": 1810.01997756958,
      "end": 1811.5399780273438,
      "text": " You may be a lot of things."
    },
    {
      "id": 3,
      "start": 1811.5399780273438,
      "end": 1813.5799779891968,
      "text": " What do I mean by that?"
    },
    {
      "id": 4,
      "start": 1813.5799779891968,
      "end": 1821.1399784088135,
      "text": " You may have titles and you may have degrees, but the greatest, most important thing is"
    },
    {
      "id": 5,
      "start": 1821.1399784088135,
      "end": 1826.1799774169922,
      "text": " your position in Christ."
    },
    {
      "id": 6,
      "start": 1826.1799774169922,
      "end": 1832.7399787902832,
      "text": " If we're not careful, we get so caught up in these things and we can lose our focus,"
    },
    {
      "id": 7,
      "start": 1832.7399787902832,
      "end": 1835.6199798583984,
      "text": " we can become distracted."
    },
    {
      "id": 8,
      "start": 1835.6199798583984,
      "end": 1841.6999778747559,
      "text": " You've heard people ask, no doubt, why am I here, what's my purpose?"
    },
    {
      "id": 9,
      "start": 1841.6999778747559,
      "end": 1845.6199798583984,
      "text": " I hope as a child of God that you don't struggle with that question."
    },
    {
      "id": 10,
      "start": 1845.6199798583984,
      "end": 1850.959976196289,
      "text": " I hope as a child of God that you understand that you're here to be His representative,"
    },
    {
      "id": 11,
      "start": 1850.959976196289,
      "end": 1855.459976196289,
      "text": " that your purpose is to bring honor and glory to Christ."
    },
    {
      "id": 12,
      "start": 1855.459976196289,
      "end": 1860.919979095459,
      "text": " Whether therefore you eat or drink or whatsoever you do, do all to the glory of God."
    },
    {
      "id": 13,
      "start": 1860.919979095459,
      "end": 1864.079978942871,
      "text": " Is that not what your Bible says?"
    },
    {
      "id": 14,
      "start": 1864.079978942871,
      "end": 1866.9199752807617,
      "text": " He didn't say do some, do most, He said do all."
    },
    {
      "id": 15,
      "start": 1866.9199752807617,
      "end": 1872.959976196289,
      "text": " John said, I must decrease, He, Christ, must increase, John the Baptist said."
    },
    {
      "id": 16,
      "start": 1872.959976196289,
      "end": 1878.739974975586,
      "text": " Tonight, we understand why we're here."
    },
    {
      "id": 17,
      "start": 1878.739974975586,
      "end": 1884.97998046875,
      "text": " I know there are times we say, man, I wish I was in heaven, looking forward to heaven."
    },
    {
      "id": 18,
      "start": 1884.9999771118164,
      "end": 1889.3199768066406,
      "text": " But if we're still here, if God's still giving us breath, He's left us here for a purpose,"
    },
    {
      "id": 19,
      "start": 1889.3199768066406,
      "end": 1891.5199813842773,
      "text": " He has a plan for our lives."
    },
    {
      "id": 20,
      "start": 1891.5199813842773,
      "end": 1894.3999786376953,
      "text": " And our greatest position is our position in Christ."
    },
    {
      "id": 21,
      "start": 1894.3999786376953,
      "end": 1900.5199813842773,
      "text": " Again, you may be a lot of things, you may have titles, you may have degrees, but you"
    },
    {
      "id": 22,
      "start": 1900.5199813842773,
      "end": 1906.6399765014648,
      "text": " know, what shall it profit a man if he gained the whole world and loses his own soul?"
    },
    {
      "id": 23,
      "start": 1906.6399765014648,
      "end": 1917.459976196289,
      "text": " The greatest title that you could have, that I could have, is I'm a child of the King."
    },
    {
      "id": 24,
      "start": 1917.459976196289,
      "end": 1920.5399780273438,
      "text": " God is my Father."
    },
    {
      "id": 25,
      "start": 1920.5399780273438,
      "end": 1923.2999801635742,
      "text": " What a blessing."
    },
    {
      "id": 26,
      "start": 1923.2999801635742,
      "end": 1928.5399780273438,
      "text": " And if we understand that tonight, it's this time to refocus why."
    },
    {
      "id": 27,
      "start": 1928.5399780273438,
      "end": 1929.5399780273438,
      "text": " What am I doing?"
    },
    {
      "id": 28,
      "start": 1929.5399780273438,
      "end": 1930.5399780273438,
      "text": " You ever wonder?"
    },
    {
      "id": 29,
      "start": 1930.5399780273438,
      "end": 1935.1399841308594,
      "text": " You ever look at your life, kind of just take back and say, what am I doing?"
    },
    {
      "id": 30,
      "start": 1935.1399841308594,
      "end": 1936.999984741211,
      "text": " What am I doing?"
    },
    {
      "id": 31,
      "start": 1936.999984741211,
      "end": 1943.6799774169922,
      "text": " Is there anything that I'm doing that's eternal, or is everything that I'm doing temporal?"
    },
    {
      "id": 32,
      "start": 1943.6799774169922,
      "end": 1946.7999725341797,
      "text": " Is there any way that I'm investing in eternity?"
    },
    {
      "id": 33,
      "start": 1946.7999725341797,
      "end": 1949.7599792480469,
      "text": " Is there anything that I'm doing that's of eternal value?"
    },
    {
      "id": 34,
      "start": 1949.7599792480469,
      "end": 1952.1999816894531,
      "text": " Do you understand what I'm saying?"
    },
    {
      "id": 35,
      "start": 1952.1999816894531,
      "end": 1958.3999786376953,
      "text": " And I believe tonight it's this time when we observe the Lord's Supper to refocus because"
    },
    {
      "id": 36,
      "start": 1958.3999786376953,
      "end": 1961.3999786376953,
      "text": " God's left us here for a purpose."
    },
    {
      "id": 37,
      "start": 1961.3999786376953,
      "end": 1964.459976196289,
      "text": " God has a plan for each of our lives."
    },
    {
      "id": 38,
      "start": 1964.459976196289,
      "end": 1970.7999725341797,
      "text": " And how appropriate that we sang a song tonight, give me a passion for souls, dear Lord."
    },
    {
      "id": 39,
      "start": 1970.7999725341797,
      "end": 1975.0199737548828,
      "text": " Because truly, that should be our passion."
    },
    {
      "id": 40,
      "start": 1975.0199737548828,
      "end": 1978.97998046875,
      "text": " Have you ever seen someone driving down the road with a bumper sticker, I'd rather be,"
    },
    {
      "id": 41,
      "start": 1978.97998046875,
      "end": 1982.739974975586,
      "text": " and it says, I'd rather be golfing, I'd rather be sailing, I'd rather be, you fill in the"
    },
    {
      "id": 42,
      "start": 1982.739974975586,
      "end": 1984.97998046875,
      "text": " blank, I've seen them, you've seen them."
    },
    {
      "id": 43,
      "start": 1984.97998046875,
      "end": 1987.3799743652344,
      "text": " I've never seen one that said, I'd rather be winning souls."
    },
    {
      "id": 44,
      "start": 1988.3599853515625,
      "end": 1993.4399719238281,
      "text": " But you know, as a child of God, if you've ever led somebody to Christ, there is nothing"
    },
    {
      "id": 45,
      "start": 1993.4399719238281,
      "end": 1995.5999755859375,
      "text": " like it."
    },
    {
      "id": 46,
      "start": 1995.5999755859375,
      "end": 2000.8999786376953,
      "text": " There is absolutely nothing like taking a Bible and showing somebody how they could"
    },
    {
      "id": 47,
      "start": 2000.8999786376953,
      "end": 2004.219970703125,
      "text": " know for sure that heaven's their home."
    },
    {
      "id": 48,
      "start": 2004.219970703125,
      "end": 2010.1599731445312,
      "text": " And seeing that spiritual birth, that person under the conviction of the Holy Spirit of"
    },
    {
      "id": 49,
      "start": 2010.1599731445312,
      "end": 2015.1599731445312,
      "text": " God understands that they're a sinner, and that there's no way they could save themselves."
    },
    {
      "id": 50,
      "start": 2015.1599731445312,
      "end": 2019.0999755859375,
      "text": " They are guilty before God."
    },
    {
      "id": 51,
      "start": 2019.0999755859375,
      "end": 2022.459976196289,
      "text": " They will spend eternity in the lake of fire because that is the wage of sin."
    },
    {
      "id": 52,
      "start": 2022.459976196289,
      "end": 2024.5999755859375,
      "text": " The wage of sin is death."
    },
    {
      "id": 53,
      "start": 2024.5999755859375,
      "end": 2033.0199737548828,
      "text": " But they recognize that God loved them, that God will save them, that God took their place"
    },
    {
      "id": 54,
      "start": 2033.0199737548828,
      "end": 2035.6599731445312,
      "text": " and offers them that gift of salvation."
    },
    {
      "id": 55,
      "start": 2035.6599731445312,
      "end": 2039.6599731445312,
      "text": " The Bible says, for whosoever shall call upon the name of the Lord shall be saved."
    },
    {
      "id": 56,
      "start": 2039.6599731445312,
      "end": 2042.8599853515625,
      "text": " They bow their head, their heart before God."
    },
    {
      "id": 57,
      "start": 2042.8599853515625,
      "end": 2045.739974975586,
      "text": " They cry out, Lord, save me."
    },
    {
      "id": 58,
      "start": 2045.739974975586,
      "end": 2048.959976196289,
      "text": " And there's nothing like it in all the world."
    },
    {
      "id": 59,
      "start": 2048.959976196289,
      "end": 2051.0399780273438,
      "text": " It's absolutely wonderful."
    },
    {
      "id": 60,
      "start": 2051.0399780273438,
      "end": 2054.719970703125,
      "text": " And tonight, as we think about observing the Lord's Supper, we're going to have a time"
    },
    {
      "id": 61,
      "start": 2054.719970703125,
      "end": 2060.439971923828,
      "text": " of silence and prayer here in just a moment before we distribute the elements."
    },
    {
      "id": 62,
      "start": 2060.439971923828,
      "end": 2064.5999755859375,
      "text": " We'll read some of the verses again before we distribute and partake."
    },
    {
      "id": 63,
      "start": 2064.5999755859375,
      "end": 2066.999969482422,
      "text": " It's a time of reflection."
    },
    {
      "id": 64,
      "start": 2066.999969482422,
      "end": 2070.999969482422,
      "text": " I hope that not only at the Lord's Supper, but regularly in your life, you think back"
    },
    {
      "id": 65,
      "start": 2071.1799926757812,
      "end": 2078.1799926757812,
      "text": " as to what it costs for you to be saved, what Christ did for you."
    },
    {
      "id": 66,
      "start": 2078.1799926757812,
      "end": 2084.6599731445312,
      "text": " I hope that you rejoice, not only in what he did for you, but what he is doing for you"
    },
    {
      "id": 67,
      "start": 2084.6599731445312,
      "end": 2087.739990234375,
      "text": " and how he's coming back for you."
    },
    {
      "id": 68,
      "start": 2087.739990234375,
      "end": 2090.0599670410156,
      "text": " And that's reason to rejoice."
    },
    {
      "id": 69,
      "start": 2090.0599670410156,
      "end": 2093.699981689453,
      "text": " But I hope we take a few moments tonight to refocus."
    },
    {
      "id": 70,
      "start": 2093.699981689453,
      "end": 2099.259979248047,
      "text": " Because if we'd be honest tonight, at times in our lives, we can all get a little distracted."
    },
    {
      "id": 71,
      "start": 2099.259979248047,
      "end": 2104.239990234375,
      "text": " We all need a little recalibration, if you will, some refocus."
    },
    {
      "id": 72,
      "start": 2104.239990234375,
      "end": 2107.6399841308594,
      "text": " And we say, God, why am I here?"
    },
    {
      "id": 73,
      "start": 2107.6399841308594,
      "end": 2109.239990234375,
      "text": " What's your plan for me?"
    },
    {
      "id": 74,
      "start": 2109.239990234375,
      "end": 2112.47998046875,
      "text": " What is it I'm supposed to be doing?"
    },
    {
      "id": 75,
      "start": 2112.47998046875,
      "end": 2115.5999755859375,
      "text": " And we know the answers to those questions as we study God's Word."
    },
    {
      "id": 76,
      "start": 2115.5999755859375,
      "end": 2120.5599670410156,
      "text": " We're to live for him, we're to please him, we're to bring glory to his name."
    },
    {
      "id": 77,
      "start": 2120.5599670410156,
      "end": 2124.0399780273438,
      "text": " And God reveals in his Word the things that do just that."
    },
    {
      "id": 78,
      "start": 2124.2999877929688,
      "end": 2132.3799743652344,
      "text": " And tonight, maybe some of us need to refocus a little bit and understand the greatest title,"
    },
    {
      "id": 79,
      "start": 2132.3799743652344,
      "end": 2137.5799865722656,
      "text": " my greatest position, is that I am a child of the King."
    },
    {
      "id": 80,
      "start": 2137.5799865722656,
      "end": 2138.5799865722656,
      "text": " Praise the Lord."
    },
    {
      "id": 81,
      "start": 2138.5799865722656,
      "end": 2139.5799865722656,
      "text": " Hallelujah."
    },
    {
      "id": 82,
      "start": 2139.5799865722656,
      "end": 2140.5799865722656,
      "text": " Let's pray together."
    },
    {
      "id": 83,
      "start": 2140.5799865722656,
      "end": 2143.0599670410156,
      "text": " Father, we love you."
    },
    {
      "id": 84,
      "start": 2143.0599670410156,
      "end": 2145.3799743652344,
      "text": " How we thank you for loving us."
    },
    {
      "id": 85,
      "start": 2145.3799743652344,
      "end": 2149.7799682617188,
      "text": " We thank you, God, for the privilege of being able to gather together this evening."
    },
    {
      "id": 86,
      "start": 2149.7799682617188,
      "end": 2153.4199829101562,
      "text": " We thank you for the Word of God and the truth that's contained therein."
    },
    {
      "id": 87,
      "start": 2153.7999877929688,
      "end": 2158.999969482422,
      "text": " We thank you for the Lord's Supper, this ordinance that you've given to us as a local church."
    },
    {
      "id": 88,
      "start": 2158.999969482422,
      "end": 2162.7999877929688,
      "text": " And God, we thank you for the opportunity that we'll have in just a moment to partake"
    },
    {
      "id": 89,
      "start": 2162.7999877929688,
      "end": 2164.0399780273438,
      "text": " of these elements."
    },
    {
      "id": 90,
      "start": 2164.0399780273438,
      "end": 2169.959991455078,
      "text": " And God, I pray that even as we've had opportunity this evening to preach from this passage of"
    },
    {
      "id": 91,
      "start": 2169.959991455078,
      "end": 2176.3999633789062,
      "text": " Scripture that you would help us to understand with great clarity that there's nothing within"
    },
    {
      "id": 92,
      "start": 2176.3999633789062,
      "end": 2181.5999755859375,
      "text": " these elements that can save an individual, that salvation is through the blood of Jesus"
    },
    {
      "id": 93,
      "start": 2181.5999755859375,
      "end": 2183.0999755859375,
      "text": " Christ."
    },
    {
      "id": 94,
      "start": 2183.0999755859375,
      "end": 2187.759979248047,
      "text": " His substitutionary death, His glorious resurrection."
    },
    {
      "id": 95,
      "start": 2187.759979248047,
      "end": 2189.6799926757812,
      "text": " We serve a risen Savior."
    },
    {
      "id": 96,
      "start": 2189.6799926757812,
      "end": 2196.3199768066406,
      "text": " Lord, if there's one that's present, whether they're here in person or tuned in via livestream,"
    },
    {
      "id": 97,
      "start": 2196.3199768066406,
      "end": 2201.5999755859375,
      "text": " they're not sure of heaven, and I pray that tonight they would trust Christ as their Savior."
    },
    {
      "id": 98,
      "start": 2201.5999755859375,
      "end": 2207.0799865722656,
      "text": " I pray the Holy Spirit of God would draw them, convict them of their sin and of Christ's"
    },
    {
      "id": 99,
      "start": 2207.0799865722656,
      "end": 2209.6799926757812,
      "text": " righteousness and of judgment to come."
    },
    {
      "id": 100,
      "start": 2209.6799926757812,
      "end": 2213.0399780273438,
      "text": " Lord, I pray for every child of God tonight."
    },
    {
      "id": 101,
      "start": 2213.0399780273438,
      "end": 2219.0599670410156,
      "text": " Lord, would you help us to rejoice as we observe this table tonight, the Lord's Supper."
    },
    {
      "id": 102,
      "start": 2219.0599670410156,
      "end": 2220.0599670410156,
      "text": " Help us to rejoice."
    },
    {
      "id": 103,
      "start": 2220.0599670410156,
      "end": 2224.5799865722656,
      "text": " God, I pray that you'd help us to refocus."
    },
    {
      "id": 104,
      "start": 2224.5799865722656,
      "end": 2233.219970703125,
      "text": " God, I believe that in each of our lives there are times that we just get distracted, get"
    },
    {
      "id": 105,
      "start": 2233.219970703125,
      "end": 2234.8199768066406,
      "text": " off course just a little bit."
    },
    {
      "id": 106,
      "start": 2234.8199768066406,
      "end": 2238.6199645996094,
      "text": " God, I pray that you'd help us tonight to refocus."
    },
    {
      "id": 107,
      "start": 2238.6199645996094,
      "end": 2244.0399780273438,
      "text": " I pray that in these moments of invitation, these moments of examination, that God, you'd"
    },
    {
      "id": 108,
      "start": 2244.0399780273438,
      "end": 2245.8399658203125,
      "text": " have your will in way."
    },
    {
      "id": 109,
      "start": 2245.8399658203125,
      "end": 2249.9199829101562,
      "text": " I pray, Lord, that if there's sin in our lives, that we'd confess it and forsake it, that"
    },
    {
      "id": 110,
      "start": 2249.9199829101562,
      "end": 2252.6399841308594,
      "text": " we'd have forgiveness."
    },
    {
      "id": 111,
      "start": 2252.6399841308594,
      "end": 2255.6799926757812,
      "text": " God, we'll thank you for all that you'll do."
    },
    {
      "id": 112,
      "start": 2255.6799926757812,
      "end": 2258.239990234375,
      "text": " For it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-15T08:43:16.506905"
}