{
  "video_id": "LOzX3Aa4VcI",
  "text": "Timothy chapter number two, 1st Timothy chapter number two, and last week we had a missionary with us and the Whitfield family, they were here and they are planting a church, Lord willing, in Edinburgh, possibly over in the second work in Harrisonburg or in Winchester at the same time, and so you pray for them. But they were here last week and so it's been two weeks since we've been in the book of 1st Timothy. Of course, our theme this year, continue, and we're studying through the book of 1st and 2nd Timothy here on Sunday mornings, and so two weeks ago we were challenged as we began studying chapter number two of 1st Timothy and we were challenged with the thought of structure in our prayer lives, and in this verse, in 1st Timothy two and verse number one, we find that God gives us some instruction with regard to the priority of prayer, but we also mention the importance of having a plan. I believe that each and every one of us this morning would agree that prayer is essential. Prayer is a great privilege. It's a great honor that we can come boldly under the throne of grace and we know that we have a God who hears and answers prayer. To God be the glory for that Bible truth, and we find that I mention if we understand that prayer is essential and we understand that we ought to be engaged in prayer, the thought of the message from two weeks ago was that structure in our prayer lives will really enable us to be consistent in our prayer lives. Some of us would admit, some of us maybe would struggle to admit because we don't wanna be embarrassed by it, but if we could be honest and transparent this morning, consistency in our prayer lives is a real struggle. Prayer is work. Prayer is a spiritual, engaged battle when we get into the prayer closet, and I'm thankful that God has given us instruction. We must be reminded of the truth that James 5, 16 ends with when the Bible says this, the effectual fervent prayer of a righteous man availeth much. I'm thankful that even in that text of Scripture, the example of Elijah is used, a man that's a man just like you and I are human beings, and he prayed that it would not rain, and it did not rain. Why didn't it rain? Well, because he prayed according to the will and word of God, and we find that he prayed again, and what happened, it rained. In between those two prayers, he prayed a prayer and fire came down from heaven, and he said, I speak all this according to thy word, and we pray in confidence that God hears us and he answers. This morning, we'll focus our attention on verses two and three as we consider the thought this morning, praying for leaders. Notice with me in verse number one, the Bible says, I exhort therefore, that first of all, again, the priority on prayer, Jesus said, my house should be a house of prayer. He says this, supplications, prayers, intercessions, and giving of thanks be made for all men. I'll be honest with you this morning, as we begin looking at this portion of Scripture, and we'll get to verses two and three as our primary key passage for this morning, we find that verse number one ends by speaking about being made for all men, and quite honestly, this morning, we probably all would be very happy if there was a period there, because the Holy Spirit of God gets very specific, and the Holy Spirit of God gets very specific in the text that we're gonna look at this morning, and as he gets specific, it's an area in which many of us fail. It's an area in which many of us fail. See, when he says pray for all men, we can kinda make ourselves feel like we're obeying that, but then he says in verse number two, pray for kings and for all that are in authority. Why did the Holy Spirit of God get so specific? You know why I believe? Because these people, just like us people, I know that's not good English, we don't like to pray for kings and those that are in authority, especially when they don't believe like we do. It's one thing to pray for your brother and your sister, it's one thing to pray for your spouse, it's one thing to pray for your children and your grandchildren, it's one thing to pray for your church family, but the Holy Spirit of God gets real specific and says for kings and for all that are in authority. Notice that we may lead a quiet and peaceable life in all godliness and honesty. Literally the idea of peace from without and peace from within. He says in verse number three, for this is good and acceptable in the sight of God our Savior. Now these verses and this instruction that is contained therein, this is the word of God. This is inspired scripture, the Bible says all scripture is given by inspiration of God and these verses of scripture must not be ignored and they must not be disobeyed. I am aware this morning of the political tension that exists in the United States of America. I am aware this morning and I realize that some may be tempted to shut down the preacher so to speak when it comes to a passage like this, but I would encourage you this morning to not do that. I would encourage you this morning as some perhaps would like to ignore it. Some would like to just turn it off so to speak and some maybe would seek to justify their disregard for this instruction. Will you understand? No, no, God wrote it and He understands everything. He is eternal. He knew what was gonna happen today far before any of us had any concept of what was gonna happen and He knows what's gonna happen tomorrow and thereafter and thereafter. He is alpha and omega, the beginning and the ending, the first and the last. He is outside of time and He is the all wise God and He chose to tell us and for kings and for all that are in authority. Understand with me this morning that we are accountable for these verses of scripture. Understand this morning that we are to be doers of the word and not hearers only, James 1 and verse 22. Furthermore, when this instruction was first given, it's important for each of us to understand that the ruthless tyrant Nero was the one that was the Roman emperor and even in that time, Paul in prison, soon to be executed, God would use him to say, pray for all men but then he says for kings and for all that are in authority. Notice with me if you're taking notes, the title just simply praying for leaders. Notice with me this morning, number one, just two thoughts this morning, several sub points if you will but number one, if you're taking notes, the command to pray for leaders is clear. I mean, there's nothing confusing about these verses of scripture. The command is clear, it is crystal clear. Admittedly this morning, it is far easier for us to criticize and to complain about elected officials than it is to pray for them. In fact, if we'd be honest this morning, most of us, if we were to examine the last seven days of our lives, we probably are guilty of two things. One, criticizing and complaining about elected officials and number two, not praying for them. You say, pastor, it's getting tough today. I know, I had to prepare this all week, okay? It's God's word, it's God's word. And this morning, the reality is that when he says to pray for kings and all that are in authority, we understand this morning that this command is clear and we could ask ourselves the question, how is it that we should pray for leaders? Well, really the most primary way that we should pray for leaders is that they be saved. In fact, in our passage of scripture, if you notice in verse number four, we'll deal with it next week, it says who will have all men to be saved and to come under the knowledge of the truth. First and foremost, the way that we ought to pray for leaders is that they would be saved by the grace of God. I've had the opportunity, not with all of our elected officials, but with some of our elected officials, I've had the opportunity to personally share the gospel with them. I sat in Mr. Connolly's office, who was our US Congressman, Mr. Cain and Mr. Warner would not meet with me, but I met with Mr. Connolly and I personally shared the gospel with him. He is a lost man, but he needs to be saved. He needs to be saved. By the way, you understand why lost people behave like they do? Because they're lost. It's hard enough to get saved people to act like saved people. Is it not true? But you try to get some lost people to act like saved people. To think like and to, no, no, the Bible says that the natural man receiveth not the things of the spirit of God for their foolishness unto him, neither can he know them, why? Because they are spiritually discerned. How can we expect a lost person to vote or to legislate like a saved person? We can't. So what do we pray? We pray for their salvation. We pray that God would bring circumstances and people into their lives that would have boldness to speak the truth. truth of God. You think about the Apostle Paul, as God gave him opportunity to stand before leaders, to stand before those who had great authority, to stand before kings. You know what Paul did? He shared the gospel with them. We do not see where Paul stands before the leaders. If you study the book of Acts and say, let me plead my case, let me tell you why I'm innocent, let me tell you why I should be released. You know what Paul does? He takes and he seizes the opportunity to preach the gospel. Why? Because Festus and Felis and Agrippa, they needed to be saved. Festus, Felis, I think I said Felis, Felis and Agrippa. They needed to be saved. You know what Agrippa says? Festus, he says, you're mad. He's under such conviction. He says, get out of here. Agrippa says, almost. Now persuade us to be a Christian. Pray for their salvation. We've got a lot of leaders that are lost. A lot of leaders that are lost. The temptation for every one of us, and I hear it and I'm guilty of it myself, is the temptation is that we complain and we criticize at the same time that we're ignoring what God said that we're to do. God didn't say complain about them. He didn't say criticize them. He didn't say protest against them. He said pray for them. Now that's convicting. That steps on your toes because we're guilty this morning. We should pray for their salvation. Let me ask this question. Obviously, I'll say this. How should we pray for them? If you do have an elected official that's a saved person, you should pray that God will protect them and that God will help them to live righteously, that God will help them to have courage and boldness to stand for truth. There are some elected officials in our nation, in our state, that are saved people I have met with and I have heard personally people share their testimony of salvation. I have had the privilege of shaking the hands of some of our elected officials that stood up without any compromise whatsoever and proclaimed their faith in Jesus Christ. There are not many of them, but there are some. Well, we need to pray for them. Why? Because they're in a dead alliance, honestly. We need to pray for those to be saved that are lost, but we need to pray for those that are saved to have courage and boldness and not to quit and say, you know what, this is hard and it's difficult and every day there are challenges. No, that God would give them some strength to be able to stick in and fight the good fight. Why should we pray for leaders? Well, number one, very simply, it's a matter of obedience. Because if you don't, you're disobedient. You say, well, that's pretty direct. Yeah, that's what the Bible says. To him that knoweth to do good and doeth it not, to him it is sin. We don't like that word a whole lot. God, if I messed up. No, you sinned against a holy God. Amen? So, it's a matter of obedience. We're to be doers of the word and not hearers only. We can't take, we've been teaching in Sunday School about the King James Bible. We're not going to take a pen knife and just remove verses like so many of the modern versions do. But why is it that we say, no, we have the King James Bible, but then we just ignore certain portions of Scripture? Is it not the same thing? We find this morning, we have the King James Bible, and we say, why should we pray for leaders? Well, number one, it's a matter of obedience. Number two, it pleases God. Notice what the Bible says in verse number three, for this is good and acceptable in the sight of God our Savior. You know what? If we find something as explicit as this, that God plainly says to us, this is good and acceptable and pleasing in my sight, we ought to pay attention to that. And we're to say, well, I ought to be engaged in doing that. In like manner, when God says, this is displeasing, with many of them, 1 Corinthians 10, God was not well pleased. Let us take note and say, I don't want to do those things because God is not pleased with those things. But here, explicitly, see, Ephesians says that we're to prove what is acceptable unto the Lord. We examine the Scriptures, we dig in, what pleases God? Well, this verse is a very plain verse. You don't have to dig real deep, you don't have to be a super intelligent person to understand that the Bible says, this is good and acceptable in the sight of God our Savior. All right, well, that pleases God. Proving what is acceptable. So, if it pleases God, I ought to be doing it. Do you agree? Why would we not do something that pleases God? Can I tell you in one answer, one word? Because of our flesh. What our flesh wants to do? Wants to criticize and wants to complain. That's what our flesh wants to do. Why should we pray for leaders? Number three, not only because it's a matter of obedience and because it pleases God, but number three, because God is sovereign and He answers prayer. Because God is sovereign and He answers prayer. Hold your place here in 1 Timothy 2, but look over, if you will, to the book of Proverbs. We're going to look at a few verses of Scripture. I'm so thankful to serve a sovereign God, aren't you? I'm so thankful that our God is omnipotent. He has all power. He said, nothing is too difficult for me. And we have these wonderful promises. Listen, we quote the promises when God says to Jeremiah, call unto me and I will answer thee and show thee great mighty things which thou knowest not. We pray, understanding the promise of Ephesians 3.20, now unto him which is able to do exceeding abundantly above all that we ask or think. You say, no, God, we're not going to pray for those people because they're hopeless, they're helpless. No, we serve a sovereign God who hears and answers prayer, who is able. I don't know how He's always going to work and neither do you, but when we study the Scriptures, we find that God works in amazing, miraculous ways. No doubt that there are some accounts that we could go to this morning that we see the heroes of the faith that prayed not knowing how God was going to work, but they believed. And they prayed. And God worked. Notice Proverbs 21. In Proverbs chapter 21, God gives us this truth in verse number 1. Notice what the Bible says. Remember, we're praying for leaders, for kings and all that are in authority according to 1 Timothy 2 and verse number 2. And here in Proverbs 21 and verse number 1, the Bible says the king's heart is in the hand of who? The Lord. That's my God. That's your God. That's the one that hears your prayers and hears my prayers. That's the one that answers our prayers. The Bible says that the king's heart is in the hand of the Lord. Notice it says, as the rivers of water, He. Who is He? That's the Lord. That's God. He turneth it. What's it? Well, that's the king's heart. Amen? You follow? Withersoever He. Who's He? The Lord will. Do you notice that verse? That's a powerful verse of Scripture. The king's heart is in the hand of the Lord. And He, the Lord, as the rivers of water, and He, the Lord, turneth it withersoever He, the Lord will. Wow. Why should we pray for leaders? Well, because it's a matter of obedience, number 1. Number 2, because we find that it pleases God. But number 3, because we serve a sovereign God who is in control of all things that hears and answers prayer. Keeping in mind the truth of Proverbs 21 and verse number 1, turn back to the book of Ezra, if you will. Turn back to the book of Ezra and turn to chapter number 7. Ezra chapter number 7. If you know anything about the history of this portion of Scripture, Ezra and Nehemiah, they're post-exilic books. They're written historically recording for us the events that happen after the Babylonian captivity. And after the Babylonian captivity, 70 years as prophesied by Jeremiah, the 70 years are fulfilled. Daniel understands that as he's reading the books. We see that in the book of Daniel. And we find, in fact, we're going to look at 2 Chronicles here in just a moment. Maybe I should have looked at that one first. But let me just reference it. You stay here in Ezra. But in 2 Chronicles chapter 36, at the end of the 70 years, in 2 Chronicles 36, notice what the Bible says in verse 22. It says, now in the first year of Cyrus, king of Persia, that the word of the Lord spoken by the mouth of Jeremiah might be accomplished. Not because it was Jeremiah's word, but it was God's word spoken through Jeremiah of 70 years of captivity. Why? Because of their disobedience. And they were taken into Babylonian captivity, but God promised that a remnant would return. And we find that the Bible says, notice in the middle of verse 22 of 2 Chronicles 36, the Lord stirred up the spirit of Cyrus, king of Persia. Who started up? The Lord. What did he stir him up to do? Well, that he made a proclamation. Cyrus, he makes a proclamation. You know what he says? It's throughout all his kingdom. And put it also in writing, saying, thus saith Cyrus, king of Persia, all the kingdoms of the earth hath the Lord God of heaven given me, and he hath charged me to build him a house in Jerusalem, which is in Judah. Really? After the temple's destroyed and after the Babylonian captivity, when the Babylonians come... in and destroy and everything that happens and we find that he says God has given me a charge he puts it in writing that God charged me to build a house in Jerusalem and then he says who is there among you of all his people the Lord has God be with him and let him go up you know who did that God God did it in Ezra they're there and there's all sorts of things in fact we can look at a number of examples there in the book of Ezra in the book of Nehemiah how God was working and how God was moving and the opposition came and the opposition sent letters and said command that they stop you know what the letters came back no actually continue on and you guys give them all the resources that they need and if you refuse to do it you're put to death Wow that's pretty significant who's doing that God the Lord the Lord you say but God can't do anything with our leaders really you have a small view of God notice in Ezra 7 in verse number 27 they're rejoicing because of the letter that was received from our desert sees the king and all that was going on I wish we had time to read all of it but I just want to see what they say is the rejoicing in verse 27 blessed be the Lord God of our fathers which hath put such a thing as this where in the king's heart to beautify the house of the Lord which is where it's in Jerusalem it's in Jerusalem this is written like 500 400 BC 450 BC okay and Cyrus said all of you can return our exerts he's writes this letter all these things are happening that a house the house of God the temple to be beautified the house of the Lord which is in Jerusalem what was God doing God was working God was working it says the people of God recognized and they say blessed be the Lord God of our fathers which hath put such a thing as this in the king's heart why do we pray for leaders why does the scripture why does the Bible tell us that were to pray for all men but then say for kings and for all that are in authority well we should pray for them to be saved and if they're saying we should pray that they would stand and they would grow and they would be they would have courage as believers that they would live and act and vote and legislate like believers and we find that if we understand and answer the question why should we pray for leaders it's a matter of obedience it pleases God and we serve a God who is sovereign who is able and he answers prayer we find as I mentioned already by way of introduction that in verse number two the Bible says that we may lead a quiet and peaceable life in all godliness and honesty notice the result when we're praying for those in leadership we're praying for them we find that it says that we may lead a quiet and peaceful life in all godliness and honesty you know God gives us a peace you know the peace that he gives us is that he's in control he's in control you say did Jeremiah trust God yes did the Babylonians conquer Judah yes because God said that was going to happen but you know Jeremiah was taken well care of Jeremiah had a peace oh there are a bunch of people in Judah that hated Jeremiah because of what he preached but God took good care of them you know when Nebuchadnezzar and those guys came in they said you know what you let Jeremiah decide what he wants it's amazing it's amazing how God works God can give us a listen when we go to God in prayer the answer might not always be yes but we can have a peace that God is sovereign and God is in control and I took this to God and I'm gonna let God be God amen and we find this morning that I believe that in 1st Timothy chapter 2 when the Bible gives us this command to pray which is crystal clear the command is clear that those that would engage in obeying this verse of scripture these verses of scripture are those that would be through their actions revealing their spiritual growth and maturity notice in the book of Matthew if you will in Matthew chapter 5 I want you to notice what Jesus says Jesus is teaching in Matthew 5 we're familiar with the passage of scripture but I want to focus in just as it applies to this portion of scripture in 1st Timothy 2 in verses 43 through 48 in Matthew chapter number 5 notice what the Bible says ye have heard in fact through this portion of scripture you'll see this contrast where Jesus says ye have heard or it hath been said and then Jesus says but I say unto you so here's what you've heard here's what you've maybe had as a tradition but here's what I'm saying to you and notice in verse 43 ye have heard that it hath been said thou shalt love thy neighbor notice and hate thine enemy well that's pretty easy to do in the flesh you know you love people that love you it's easy to do is it not it's a whole nother ballgame to love somebody that hates you do you agree notice he says that this is what you've heard notice verse 44 but I say unto you love your enemies love your enemies bless them that curse you do good to them that hate you and pray for them which despitefully use you and persecute you is there anything easy about verse 44 is there anything in your flesh or in my flesh that can do verse 44 it's only with the help of God it's only with the Spirit of God enabling us to be able to bless those that curse us to love those that hate us to pray for those who persecute us that's just not normal it's not natural humanly speaking why'd you hit him you ask the kid in the nursery because he hit me how many of you heard that how many of you said that amen why'd you hit him I remember my little nephew Carter sweet little kid man he's he's older now but I remember man he was like five years old him and Michaela were fighting and my brother called him in and said Carter did you hit her yes I mean he wasn't trying to hide it he wasn't lying yes Carter why'd you hit her cuz she hit me I mean like that's just a natural thing this is not natural this is spiritual this reveals spiritual maturity this is this is spiritual growth he says in verse 45 that ye may be children of your father which is in heaven for he maketh his son to rise on the evil and on the good and sendeth rain on the just and the unjust for if ye notice verse 46 if ye love them which love you what reward have you do not even the publicans the same he's using the example of the publicans listen the people that love the publicans they loved them back he says if you salute your brethren only what do you more than others do not even the publicans so be therefore perfect complete even as your father which is in heaven is perfect Wow the command to pray for leaders is clear number two this morning the failure to pray for leaders is common the command is clear but the failure is common this week I said I had the great privilege of preparing this message all week can I tell you that I had to pray and confess my disobedience to God you know why I'm just like you it's easier to complain and criticize what our elected officials are doing than it is to pray for them I hope you don't think anything less of me I'm just being honest but I have a God who said that if I confess he forgives and I had to get on my knees and I had to say God I've failed I know what your word says and I've disobeyed it because I have not prayed for those that are in like I should you know what I did I took it a step further I went and I got all the names of the people that I need to be praying for I say all not every single congressman and senator but the ones that are in our area the Board of Supervisors here in Fairfax County the state legislators their enrichment that represent our district I went I wrote all the names down why because I'm the for you say well pastor you should add a whole lot more to that list I'm starting there amen I'm starting there why because every time you hear the news and you see something else going on it's easy to complain and criticize but God says Pray. Pray for kings and for all that are in authority. I told you already, I've had the privilege of sitting and sharing the gospel with several of these elected officials. But you know, that does not excuse me from praying for them thereafter. My job was not complete when I sat and shared the gospel with them. That was an appropriate thing to do, but my job didn't end there. I've got to still pray for them. And I hope this morning that as we look at the sad reality within our churches this morning, within our nation this morning, I think this is a common problem. I think, listen, you know what Peter says? That judgment must begin at the house of God. That's what Peter said. He said, Pastor, I didn't come to church today to hear all this. I know, but bless God. Amen. We need it. If we're going to have revival in America, we better obey God's word. And we're disobedient in this area. I'm just saying we're disobedient in this area. I can't speak for every single person, but I know I talk to a lot of people and I hear a whole lot more frequently about criticizing and complaining than I hear of anybody talking about praying for our leaders. I hear it far too often. I hear it from church members. I hear it from other pastors. I hear it from evangelists. I just hear it all the time. And judgment must begin at the house of God. There's some people today that need to do what I did this week and say, God, forgive me, and then decide I'm going to pray for leaders as you commanded me to do so. You say, but I don't like them. It doesn't matter if you like them. They're not the same party that I am. It doesn't matter. They don't think like I think. It doesn't matter. God said, pray for them. Pray for them. I said it in the beginning of the message this morning. I would have been happy if it stopped in verse number one, just pray for all men. Why? Because I could kind of make myself feel good about that. And so could you. I'm being honest this morning. But then he says the Holy Spirit of God, he brings that finger and just goes right at it for kings and for all that are in authority. Think about the original recipients of this book. Under heavy persecution, under the man Nero, the Roman emperor. And Paul says, under the inspiration of the Holy Spirit of God, you want me to pray for him? I think I would have thought that. We need to pray for the leaders. This morning, as I examine my own life, I mentioned already I've acknowledged my sin. I've asked God to help me with that. Far too often, we struggle to pray for those that are in leadership. I would say this this morning, many, and I would not put anybody on the spot, but I would say that many, even within this crowd this morning, could not name, by name, the elected officials that represent our district. You know what that means to me? You're not praying for them. If you can't name them, you're not praying for them. You say, Pastor, that's a bold statement. Tell me it's not true. Because I just prayed, God bless all of them. Give me a break. That's shallow praying. It really is. If we can't name them, we're not praying for them. I think there are three actions that we need to take, three things that I want to leave you with this morning. He says in 1 Timothy 2 and verse 1, I exhort therefore that first of all supplications, prayers, intercessions, and giving of thanks be made for all men, for kings, and for all that are in authority, that we may lead a quiet and peaceable life in all godliness and honesty, for this is good and acceptable in the sight of God our Savior. Number one this morning, we must acknowledge that God is sovereign. We must acknowledge that God is sovereign. And as our sovereign Heavenly Father, He knows all things, He's able to do all things, and He's able to work. And remember, the heart of the king is in the hand of the Lord. He, God, as the rivers of water, He turneth it withersoever He will. We must acknowledge that He is sovereign. When we understand that this morning, it will transform our prayer lives, because we're praying to a God who is able. Number two this morning, we must accept the instruction that's given to us here. We must accept this instruction. Lord, this is for me. You said that you gave us your word, and we're to be doers of the word and not hearers only. And we accept this instruction to be God's word and to be true. And then I would say this, we must analyze our prayer lives. We must analyze our prayer lives. Especially this morning with regard to how the Holy Spirit specifically deals with the subject of praying for leaders. We must analyze. We must get along with God. We might need to visit an altar. We might, God, how am I doing in this area? How am I doing? Can I encourage you this morning to be honest with God? Because God knows how you're doing. God knew how I was doing. And God's ready to pardon and ready to forgive. See sometimes we say, look at what's going on in our nation. It's all a mess. When's the last time you prayed for the leaders? When's the last time we prayed for them? I mean fervently. The effectual fervent prayer of a righteous man availeth much. When's the last time we got on our knees for our president and prayed that that man would be saved? Or our vice president, that she would be saved? You say, I don't like them. Stop. Stop. Don't justify. It's a matter of obedience. And it pleases God. And He's sovereign and He's able. Purposefully this morning I'm stopping early because I think God needs to, let me say it this way, I think God's people need to respond to God. I just really believe that. And so we're going to have a little longer invitation this morning as God leads. I'm not going to belabor it just to belabor it, but I want to do business with God. The reality this morning is that this is not the kind of message I like preaching. Man, I like preaching messages that are just, let's go after it, let's get it, man, God. This is a tough one. Why? Because it steps on my toes and I know it steps on your toes. But how do we respond? So often as I pray, I pray that God would help us to receive His Word and then that we would respond to His Word. Never do I try to be emotional and twist people's arms in invitations. I don't do that. You know that. But I really believe we need to do some business with God today. Let's pray together. Father, we love You. We thank You for loving us. I thank You that it's Your will that all men would be saved. We thank You that You hear and answer prayer. God, You've told us plainly that the instruction to pray for leaders is clear. There's nothing confusing for kings and for all that are in authority. God, I believe this morning that the failure of Your people to pray is common. It's on the list, no doubt, of the most impactful sins of this generation is a disregard of Your people to pray as You've instructed us to do so. God, I pray that in these moments of invitation, You would do a work in our hearts and lives. God, that we would confess and get right and that we'd develop a plan to pray for our leaders that You might give us peace as a result. Criticizing them and complaining about them has never brought me peace. But as we pray and leave it with You, we can have a peace that passes all understanding. I pray that You would save those elected officials that are lost. I pray, God, that You would strengthen and give courage to those elected officials that are saved. I pray that You'd move and work as only You can in these moments of invitation, which in Christ's name we pray. Would you stand with?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.559999942779541,
      "text": " Timothy chapter number two, 1st Timothy chapter number two,"
    },
    {
      "id": 1,
      "start": 3.559999942779541,
      "end": 6.039999961853027,
      "text": " and last week we had a missionary with us"
    },
    {
      "id": 2,
      "start": 6.039999961853027,
      "end": 8.5600004196167,
      "text": " and the Whitfield family, they were here"
    },
    {
      "id": 3,
      "start": 8.5600004196167,
      "end": 10.880000114440918,
      "text": " and they are planting a church, Lord willing,"
    },
    {
      "id": 4,
      "start": 10.880000114440918,
      "end": 15.020000457763672,
      "text": " in Edinburgh, possibly over in the second work"
    },
    {
      "id": 5,
      "start": 15.020000457763672,
      "end": 19.479999542236328,
      "text": " in Harrisonburg or in Winchester at the same time,"
    },
    {
      "id": 6,
      "start": 19.479999542236328,
      "end": 20.719999313354492,
      "text": " and so you pray for them."
    },
    {
      "id": 7,
      "start": 20.719999313354492,
      "end": 22.600000381469727,
      "text": " But they were here last week and so it's been two weeks"
    },
    {
      "id": 8,
      "start": 22.600000381469727,
      "end": 23.979999542236328,
      "text": " since we've been in the book of 1st Timothy."
    },
    {
      "id": 9,
      "start": 23.979999542236328,
      "end": 26.239999771118164,
      "text": " Of course, our theme this year, continue,"
    },
    {
      "id": 10,
      "start": 26.239999771118164,
      "end": 27.799999237060547,
      "text": " and we're studying through the book of 1st"
    },
    {
      "id": 11,
      "start": 27.799999237060547,
      "end": 30.559999465942383,
      "text": " and 2nd Timothy here on Sunday mornings,"
    },
    {
      "id": 12,
      "start": 30.559999465942383,
      "end": 32.959999084472656,
      "text": " and so two weeks ago we were challenged"
    },
    {
      "id": 13,
      "start": 32.959999084472656,
      "end": 36.0,
      "text": " as we began studying chapter number two of 1st Timothy"
    },
    {
      "id": 14,
      "start": 36.0,
      "end": 38.959999084472656,
      "text": " and we were challenged with the thought of structure"
    },
    {
      "id": 15,
      "start": 38.959999084472656,
      "end": 41.0,
      "text": " in our prayer lives, and in this verse,"
    },
    {
      "id": 16,
      "start": 41.0,
      "end": 43.0,
      "text": " in 1st Timothy two and verse number one,"
    },
    {
      "id": 17,
      "start": 43.0,
      "end": 45.68000030517578,
      "text": " we find that God gives us some instruction"
    },
    {
      "id": 18,
      "start": 45.68000030517578,
      "end": 48.2400016784668,
      "text": " with regard to the priority of prayer,"
    },
    {
      "id": 19,
      "start": 48.2400016784668,
      "end": 51.08000183105469,
      "text": " but we also mention the importance of having a plan."
    },
    {
      "id": 20,
      "start": 51.08000183105469,
      "end": 53.31999969482422,
      "text": " I believe that each and every one of us this morning"
    },
    {
      "id": 21,
      "start": 53.31999969482422,
      "end": 56.08000183105469,
      "text": " would agree that prayer is essential."
    },
    {
      "id": 22,
      "start": 56.08000183105469,
      "end": 57.52000045776367,
      "text": " Prayer is a great privilege."
    },
    {
      "id": 23,
      "start": 57.52000045776367,
      "end": 59.880001068115234,
      "text": " It's a great honor that we can come boldly"
    },
    {
      "id": 24,
      "start": 59.880001068115234,
      "end": 62.560001373291016,
      "text": " under the throne of grace and we know that we have a God"
    },
    {
      "id": 25,
      "start": 62.560001373291016,
      "end": 64.30000305175781,
      "text": " who hears and answers prayer."
    },
    {
      "id": 26,
      "start": 64.30000305175781,
      "end": 67.83999633789062,
      "text": " To God be the glory for that Bible truth,"
    },
    {
      "id": 27,
      "start": 67.83999633789062,
      "end": 70.27999877929688,
      "text": " and we find that I mention if we understand"
    },
    {
      "id": 28,
      "start": 70.27999877929688,
      "end": 72.19999694824219,
      "text": " that prayer is essential and we understand"
    },
    {
      "id": 29,
      "start": 72.19999694824219,
      "end": 74.27999877929688,
      "text": " that we ought to be engaged in prayer,"
    },
    {
      "id": 30,
      "start": 74.27999877929688,
      "end": 76.12000274658203,
      "text": " the thought of the message from two weeks ago"
    },
    {
      "id": 31,
      "start": 76.12000274658203,
      "end": 79.12000274658203,
      "text": " was that structure in our prayer lives"
    },
    {
      "id": 32,
      "start": 79.12000274658203,
      "end": 83.4800033569336,
      "text": " will really enable us to be consistent in our prayer lives."
    },
    {
      "id": 33,
      "start": 83.4800033569336,
      "end": 85.55999755859375,
      "text": " Some of us would admit, some of us maybe"
    },
    {
      "id": 34,
      "start": 85.55999755859375,
      "end": 87.4800033569336,
      "text": " would struggle to admit because we don't wanna"
    },
    {
      "id": 35,
      "start": 87.4800033569336,
      "end": 90.12000274658203,
      "text": " be embarrassed by it, but if we could be honest"
    },
    {
      "id": 36,
      "start": 90.12000274658203,
      "end": 91.68000030517578,
      "text": " and transparent this morning,"
    },
    {
      "id": 37,
      "start": 91.68000030517578,
      "end": 95.4800033569336,
      "text": " consistency in our prayer lives is a real struggle."
    },
    {
      "id": 38,
      "start": 95.4800033569336,
      "end": 96.44000244140625,
      "text": " Prayer is work."
    },
    {
      "id": 39,
      "start": 96.44000244140625,
      "end": 101.44000244140625,
      "text": " Prayer is a spiritual, engaged battle"
    },
    {
      "id": 40,
      "start": 101.86000061035156,
      "end": 104.27999877929688,
      "text": " when we get into the prayer closet,"
    },
    {
      "id": 41,
      "start": 104.27999877929688,
      "end": 107.27999877929688,
      "text": " and I'm thankful that God has given us instruction."
    },
    {
      "id": 42,
      "start": 107.27999877929688,
      "end": 111.44000244140625,
      "text": " We must be reminded of the truth that James 5, 16 ends with"
    },
    {
      "id": 43,
      "start": 111.44000244140625,
      "end": 112.5999984741211,
      "text": " when the Bible says this,"
    },
    {
      "id": 44,
      "start": 112.5999984741211,
      "end": 116.95999908447266,
      "text": " the effectual fervent prayer of a righteous man"
    },
    {
      "id": 45,
      "start": 116.95999908447266,
      "end": 119.12000274658203,
      "text": " availeth much."
    },
    {
      "id": 46,
      "start": 119.12000274658203,
      "end": 121.55999755859375,
      "text": " I'm thankful that even in that text of Scripture,"
    },
    {
      "id": 47,
      "start": 121.55999755859375,
      "end": 123.95999908447266,
      "text": " the example of Elijah is used,"
    },
    {
      "id": 48,
      "start": 123.95999908447266,
      "end": 127.44000244140625,
      "text": " a man that's a man just like you and I are human beings,"
    },
    {
      "id": 49,
      "start": 127.44000244140625,
      "end": 130.8000030517578,
      "text": " and he prayed that it would not rain, and it did not rain."
    },
    {
      "id": 50,
      "start": 131.75999450683594,
      "end": 132.60000610351562,
      "text": " Why didn't it rain?"
    },
    {
      "id": 51,
      "start": 132.60000610351562,
      "end": 134.75999450683594,
      "text": " Well, because he prayed according to the will"
    },
    {
      "id": 52,
      "start": 134.75999450683594,
      "end": 137.60000610351562,
      "text": " and word of God, and we find that he prayed again,"
    },
    {
      "id": 53,
      "start": 137.60000610351562,
      "end": 139.02000427246094,
      "text": " and what happened, it rained."
    },
    {
      "id": 54,
      "start": 139.02000427246094,
      "end": 141.83999633789062,
      "text": " In between those two prayers, he prayed a prayer"
    },
    {
      "id": 55,
      "start": 141.83999633789062,
      "end": 143.8800048828125,
      "text": " and fire came down from heaven,"
    },
    {
      "id": 56,
      "start": 143.8800048828125,
      "end": 148.0800018310547,
      "text": " and he said, I speak all this according to thy word,"
    },
    {
      "id": 57,
      "start": 148.0800018310547,
      "end": 153.0800018310547,
      "text": " and we pray in confidence that God hears us and he answers."
    },
    {
      "id": 58,
      "start": 153.8000030517578,
      "end": 156.39999389648438,
      "text": " This morning, we'll focus our attention on verses two"
    },
    {
      "id": 59,
      "start": 156.39999389648438,
      "end": 159.0800018310547,
      "text": " and three as we consider the thought this morning,"
    },
    {
      "id": 60,
      "start": 159.0800018310547,
      "end": 161.39999389648438,
      "text": " praying for leaders."
    },
    {
      "id": 61,
      "start": 161.39999389648438,
      "end": 163.0800018310547,
      "text": " Notice with me in verse number one,"
    },
    {
      "id": 62,
      "start": 163.0800018310547,
      "end": 167.47999572753906,
      "text": " the Bible says, I exhort therefore, that first of all,"
    },
    {
      "id": 63,
      "start": 167.47999572753906,
      "end": 169.9199981689453,
      "text": " again, the priority on prayer,"
    },
    {
      "id": 64,
      "start": 169.9199981689453,
      "end": 173.36000061035156,
      "text": " Jesus said, my house should be a house of prayer."
    },
    {
      "id": 65,
      "start": 173.36000061035156,
      "end": 176.47999572753906,
      "text": " He says this, supplications, prayers, intercessions,"
    },
    {
      "id": 66,
      "start": 176.47999572753906,
      "end": 180.24000549316406,
      "text": " and giving of thanks be made for all men."
    },
    {
      "id": 67,
      "start": 180.24000549316406,
      "end": 181.60000610351562,
      "text": " I'll be honest with you this morning,"
    },
    {
      "id": 68,
      "start": 181.60000610351562,
      "end": 184.1199951171875,
      "text": " as we begin looking at this portion of Scripture,"
    },
    {
      "id": 69,
      "start": 184.1199951171875,
      "end": 185.60000610351562,
      "text": " and we'll get to verses two and three"
    },
    {
      "id": 70,
      "start": 185.60000610351562,
      "end": 188.67999267578125,
      "text": " as our primary key passage for this morning,"
    },
    {
      "id": 71,
      "start": 188.67999267578125,
      "end": 191.39999389648438,
      "text": " we find that verse number one ends"
    },
    {
      "id": 72,
      "start": 191.39999389648438,
      "end": 194.47999572753906,
      "text": " by speaking about being made for all men,"
    },
    {
      "id": 73,
      "start": 194.47999572753906,
      "end": 196.44000244140625,
      "text": " and quite honestly, this morning,"
    },
    {
      "id": 74,
      "start": 196.44000244140625,
      "end": 198.72000122070312,
      "text": " we probably all would be very happy"
    },
    {
      "id": 75,
      "start": 198.75999450683594,
      "end": 200.63999938964844,
      "text": " if there was a period there,"
    },
    {
      "id": 76,
      "start": 200.63999938964844,
      "end": 204.83999633789062,
      "text": " because the Holy Spirit of God gets very specific,"
    },
    {
      "id": 77,
      "start": 204.83999633789062,
      "end": 207.9199981689453,
      "text": " and the Holy Spirit of God gets very specific"
    },
    {
      "id": 78,
      "start": 207.9199981689453,
      "end": 210.0399932861328,
      "text": " in the text that we're gonna look at this morning,"
    },
    {
      "id": 79,
      "start": 210.0399932861328,
      "end": 212.55999755859375,
      "text": " and as he gets specific,"
    },
    {
      "id": 80,
      "start": 213.67999267578125,
      "end": 216.44000244140625,
      "text": " it's an area in which many of us fail."
    },
    {
      "id": 81,
      "start": 216.44000244140625,
      "end": 218.44000244140625,
      "text": " It's an area in which many of us fail."
    },
    {
      "id": 82,
      "start": 218.44000244140625,
      "end": 220.16000366210938,
      "text": " See, when he says pray for all men,"
    },
    {
      "id": 83,
      "start": 220.16000366210938,
      "end": 223.1999969482422,
      "text": " we can kinda make ourselves feel like we're obeying that,"
    },
    {
      "id": 84,
      "start": 223.1999969482422,
      "end": 224.67999267578125,
      "text": " but then he says in verse number two,"
    },
    {
      "id": 85,
      "start": 224.67999267578125,
      "end": 229.67999267578125,
      "text": " pray for kings and for all that are in authority."
    },
    {
      "id": 86,
      "start": 233.60000610351562,
      "end": 238.60000610351562,
      "text": " Why did the Holy Spirit of God get so specific?"
    },
    {
      "id": 87,
      "start": 239.83999633789062,
      "end": 241.0399932861328,
      "text": " You know why I believe?"
    },
    {
      "id": 88,
      "start": 242.1199951171875,
      "end": 244.9600067138672,
      "text": " Because these people, just like us people,"
    },
    {
      "id": 89,
      "start": 244.9600067138672,
      "end": 246.52000427246094,
      "text": " I know that's not good English,"
    },
    {
      "id": 90,
      "start": 249.0,
      "end": 251.0,
      "text": " we don't like to pray for kings"
    },
    {
      "id": 91,
      "start": 251.0,
      "end": 252.9600067138672,
      "text": " and those that are in authority,"
    },
    {
      "id": 92,
      "start": 253.0,
      "end": 256.0799865722656,
      "text": " especially when they don't believe like we do."
    },
    {
      "id": 93,
      "start": 257.3999938964844,
      "end": 260.44000244140625,
      "text": " It's one thing to pray for your brother and your sister,"
    },
    {
      "id": 94,
      "start": 260.44000244140625,
      "end": 262.20001220703125,
      "text": " it's one thing to pray for your spouse,"
    },
    {
      "id": 95,
      "start": 262.20001220703125,
      "end": 263.6400146484375,
      "text": " it's one thing to pray for your children"
    },
    {
      "id": 96,
      "start": 263.6400146484375,
      "end": 264.55999755859375,
      "text": " and your grandchildren,"
    },
    {
      "id": 97,
      "start": 264.55999755859375,
      "end": 268.1199951171875,
      "text": " it's one thing to pray for your church family,"
    },
    {
      "id": 98,
      "start": 269.6000061035156,
      "end": 274.0,
      "text": " but the Holy Spirit of God gets real specific"
    },
    {
      "id": 99,
      "start": 274.0,
      "end": 279.0,
      "text": " and says for kings and for all that are in authority."
    },
    {
      "id": 100,
      "start": 279.20001220703125,
      "end": 283.79998779296875,
      "text": " Notice that we may lead a quiet and peaceable life"
    },
    {
      "id": 101,
      "start": 283.79998779296875,
      "end": 286.4800109863281,
      "text": " in all godliness and honesty."
    },
    {
      "id": 102,
      "start": 286.4800109863281,
      "end": 290.20001220703125,
      "text": " Literally the idea of peace from without"
    },
    {
      "id": 103,
      "start": 290.20001220703125,
      "end": 292.0,
      "text": " and peace from within."
    },
    {
      "id": 104,
      "start": 292.0,
      "end": 293.2799987792969,
      "text": " He says in verse number three,"
    },
    {
      "id": 105,
      "start": 293.2799987792969,
      "end": 295.9200134277344,
      "text": " for this is good and acceptable"
    },
    {
      "id": 106,
      "start": 295.9200134277344,
      "end": 298.7200012207031,
      "text": " in the sight of God our Savior."
    },
    {
      "id": 107,
      "start": 298.7200012207031,
      "end": 300.5199890136719,
      "text": " Now these verses and this instruction"
    },
    {
      "id": 108,
      "start": 300.5199890136719,
      "end": 301.760009765625,
      "text": " that is contained therein,"
    },
    {
      "id": 109,
      "start": 301.760009765625,
      "end": 304.239990234375,
      "text": " this is the word of God."
    },
    {
      "id": 110,
      "start": 304.239990234375,
      "end": 305.9599914550781,
      "text": " This is inspired scripture,"
    },
    {
      "id": 111,
      "start": 305.9599914550781,
      "end": 308.55999755859375,
      "text": " the Bible says all scripture is given by inspiration of God"
    },
    {
      "id": 112,
      "start": 308.55999755859375,
      "end": 312.6000061035156,
      "text": " and these verses of scripture must not be ignored"
    },
    {
      "id": 113,
      "start": 312.6000061035156,
      "end": 315.0799865722656,
      "text": " and they must not be disobeyed."
    },
    {
      "id": 114,
      "start": 315.0799865722656,
      "end": 318.3599853515625,
      "text": " I am aware this morning of the political tension"
    },
    {
      "id": 115,
      "start": 318.3599853515625,
      "end": 320.9599914550781,
      "text": " that exists in the United States of America."
    },
    {
      "id": 116,
      "start": 320.9599914550781,
      "end": 322.9599914550781,
      "text": " I am aware this morning and I realize"
    },
    {
      "id": 117,
      "start": 322.9599914550781,
      "end": 325.9200134277344,
      "text": " that some may be tempted to shut down the preacher"
    },
    {
      "id": 118,
      "start": 325.9200134277344,
      "end": 329.8800048828125,
      "text": " so to speak when it comes to a passage like this,"
    },
    {
      "id": 119,
      "start": 329.8800048828125,
      "end": 334.6400146484375,
      "text": " but I would encourage you this morning to not do that."
    },
    {
      "id": 120,
      "start": 334.6400146484375,
      "end": 336.1600036621094,
      "text": " I would encourage you this morning"
    },
    {
      "id": 121,
      "start": 336.20001220703125,
      "end": 339.8800048828125,
      "text": " as some perhaps would like to ignore it."
    },
    {
      "id": 122,
      "start": 339.8800048828125,
      "end": 342.20001220703125,
      "text": " Some would like to just turn it off so to speak"
    },
    {
      "id": 123,
      "start": 342.20001220703125,
      "end": 345.9200134277344,
      "text": " and some maybe would seek to justify"
    },
    {
      "id": 124,
      "start": 345.9200134277344,
      "end": 348.8800048828125,
      "text": " their disregard for this instruction."
    },
    {
      "id": 125,
      "start": 348.8800048828125,
      "end": 349.8800048828125,
      "text": " Will you understand?"
    },
    {
      "id": 126,
      "start": 349.8800048828125,
      "end": 353.3999938964844,
      "text": " No, no, God wrote it and He understands everything."
    },
    {
      "id": 127,
      "start": 354.3999938964844,
      "end": 355.9599914550781,
      "text": " He is eternal."
    },
    {
      "id": 128,
      "start": 355.9599914550781,
      "end": 357.6400146484375,
      "text": " He knew what was gonna happen today"
    },
    {
      "id": 129,
      "start": 357.6400146484375,
      "end": 360.1600036621094,
      "text": " far before any of us had any concept"
    },
    {
      "id": 130,
      "start": 360.1600036621094,
      "end": 361.20001220703125,
      "text": " of what was gonna happen"
    },
    {
      "id": 131,
      "start": 361.20001220703125,
      "end": 362.8800048828125,
      "text": " and He knows what's gonna happen tomorrow"
    },
    {
      "id": 132,
      "start": 362.8800048828125,
      "end": 364.8800048828125,
      "text": " and thereafter and thereafter."
    },
    {
      "id": 133,
      "start": 364.8800048828125,
      "end": 367.7200012207031,
      "text": " He is alpha and omega, the beginning and the ending,"
    },
    {
      "id": 134,
      "start": 367.7200012207031,
      "end": 368.760009765625,
      "text": " the first and the last."
    },
    {
      "id": 135,
      "start": 368.760009765625,
      "end": 371.9599914550781,
      "text": " He is outside of time and He is the all wise God"
    },
    {
      "id": 136,
      "start": 371.9599914550781,
      "end": 374.55999755859375,
      "text": " and He chose to tell us"
    },
    {
      "id": 137,
      "start": 376.32000732421875,
      "end": 380.79998779296875,
      "text": " and for kings and for all that are in authority."
    },
    {
      "id": 138,
      "start": 381.760009765625,
      "end": 383.55999755859375,
      "text": " Understand with me this morning"
    },
    {
      "id": 139,
      "start": 383.55999755859375,
      "end": 387.2799987792969,
      "text": " that we are accountable for these verses of scripture."
    },
    {
      "id": 140,
      "start": 389.1600036621094,
      "end": 393.9599914550781,
      "text": " Understand this morning that we are to be doers of the word"
    },
    {
      "id": 141,
      "start": 393.9599914550781,
      "end": 397.6400146484375,
      "text": " and not hearers only, James 1 and verse 22."
    },
    {
      "id": 142,
      "start": 397.6400146484375,
      "end": 401.32000732421875,
      "text": " Furthermore, when this instruction was first given,"
    },
    {
      "id": 143,
      "start": 401.32000732421875,
      "end": 403.32000732421875,
      "text": " it's important for each of us to understand"
    },
    {
      "id": 144,
      "start": 403.32000732421875,
      "end": 405.1199951171875,
      "text": " that the ruthless tyrant Nero"
    },
    {
      "id": 145,
      "start": 405.1199951171875,
      "end": 407.239990234375,
      "text": " was the one that was the Roman emperor"
    },
    {
      "id": 146,
      "start": 409.32000732421875,
      "end": 414.32000732421875,
      "text": " and even in that time, Paul in prison,"
    },
    {
      "id": 147,
      "start": 415.760009765625,
      "end": 418.4800109863281,
      "text": " soon to be executed,"
    },
    {
      "id": 148,
      "start": 418.4800109863281,
      "end": 422.8800048828125,
      "text": " God would use him to say, pray for all men"
    },
    {
      "id": 149,
      "start": 424.760009765625,
      "end": 426.9599914550781,
      "text": " but then he says for kings"
    },
    {
      "id": 150,
      "start": 426.9599914550781,
      "end": 430.20001220703125,
      "text": " and for all that are in authority."
    },
    {
      "id": 151,
      "start": 430.20001220703125,
      "end": 431.67999267578125,
      "text": " Notice with me if you're taking notes,"
    },
    {
      "id": 152,
      "start": 431.67999267578125,
      "end": 433.760009765625,
      "text": " the title just simply praying for leaders."
    },
    {
      "id": 153,
      "start": 433.760009765625,
      "end": 435.32000732421875,
      "text": " Notice with me this morning,"
    },
    {
      "id": 154,
      "start": 435.32000732421875,
      "end": 437.9200134277344,
      "text": " number one, just two thoughts this morning,"
    },
    {
      "id": 155,
      "start": 437.9200134277344,
      "end": 439.8399963378906,
      "text": " several sub points if you will"
    },
    {
      "id": 156,
      "start": 439.8399963378906,
      "end": 441.760009765625,
      "text": " but number one, if you're taking notes,"
    },
    {
      "id": 157,
      "start": 441.760009765625,
      "end": 446.0400085449219,
      "text": " the command to pray for leaders is clear."
    },
    {
      "id": 158,
      "start": 446.0400085449219,
      "end": 447.239990234375,
      "text": " I mean, there's nothing confusing"
    },
    {
      "id": 159,
      "start": 447.239990234375,
      "end": 449.1600036621094,
      "text": " about these verses of scripture."
    },
    {
      "id": 160,
      "start": 449.1600036621094,
      "end": 452.32000732421875,
      "text": " The command is clear, it is crystal clear."
    },
    {
      "id": 161,
      "start": 452.32000732421875,
      "end": 454.8800048828125,
      "text": " Admittedly this morning,"
    },
    {
      "id": 162,
      "start": 454.8800048828125,
      "end": 458.5199890136719,
      "text": " it is far easier for us to criticize"
    },
    {
      "id": 163,
      "start": 458.5199890136719,
      "end": 461.1600036621094,
      "text": " and to complain about elected officials"
    },
    {
      "id": 164,
      "start": 461.1600036621094,
      "end": 462.8800048828125,
      "text": " than it is to pray for them."
    },
    {
      "id": 165,
      "start": 462.8800048828125,
      "end": 464.9599914550781,
      "text": " In fact, if we'd be honest this morning,"
    },
    {
      "id": 166,
      "start": 464.9599914550781,
      "end": 466.7200012207031,
      "text": " most of us, if we were to examine"
    },
    {
      "id": 167,
      "start": 466.7200012207031,
      "end": 468.8399963378906,
      "text": " the last seven days of our lives,"
    },
    {
      "id": 168,
      "start": 468.8399963378906,
      "end": 472.2799987792969,
      "text": " we probably are guilty of two things."
    },
    {
      "id": 169,
      "start": 472.2799987792969,
      "end": 475.6400146484375,
      "text": " One, criticizing and complaining about elected officials"
    },
    {
      "id": 170,
      "start": 475.6400146484375,
      "end": 477.55999755859375,
      "text": " and number two, not praying for them."
    },
    {
      "id": 171,
      "start": 479.55999755859375,
      "end": 481.1199951171875,
      "text": " You say, pastor, it's getting tough today."
    },
    {
      "id": 172,
      "start": 481.1199951171875,
      "end": 484.79998779296875,
      "text": " I know, I had to prepare this all week, okay?"
    },
    {
      "id": 173,
      "start": 485.9599914550781,
      "end": 489.79998779296875,
      "text": " It's God's word, it's God's word."
    },
    {
      "id": 174,
      "start": 489.79998779296875,
      "end": 492.6000061035156,
      "text": " And this morning, the reality is that"
    },
    {
      "id": 175,
      "start": 492.6000061035156,
      "end": 495.1600036621094,
      "text": " when he says to pray for kings"
    },
    {
      "id": 176,
      "start": 495.1600036621094,
      "end": 497.1199951171875,
      "text": " and all that are in authority,"
    },
    {
      "id": 177,
      "start": 497.1199951171875,
      "end": 500.5199890136719,
      "text": " we understand this morning that this command is clear"
    },
    {
      "id": 178,
      "start": 500.5199890136719,
      "end": 502.44000244140625,
      "text": " and we could ask ourselves the question,"
    },
    {
      "id": 179,
      "start": 502.44000244140625,
      "end": 504.3599853515625,
      "text": " how is it that we should pray for leaders?"
    },
    {
      "id": 180,
      "start": 504.3599853515625,
      "end": 506.79998779296875,
      "text": " Well, really the most primary way"
    },
    {
      "id": 181,
      "start": 506.79998779296875,
      "end": 509.9200134277344,
      "text": " that we should pray for leaders is that they be saved."
    },
    {
      "id": 182,
      "start": 509.9200134277344,
      "end": 511.760009765625,
      "text": " In fact, in our passage of scripture,"
    },
    {
      "id": 183,
      "start": 511.760009765625,
      "end": 513.0,
      "text": " if you notice in verse number four,"
    },
    {
      "id": 184,
      "start": 513.0,
      "end": 514.3200073242188,
      "text": " we'll deal with it next week,"
    },
    {
      "id": 185,
      "start": 514.3200073242188,
      "end": 517.3200073242188,
      "text": " it says who will have all men to be saved"
    },
    {
      "id": 186,
      "start": 517.3200073242188,
      "end": 520.1599731445312,
      "text": " and to come under the knowledge of the truth."
    },
    {
      "id": 187,
      "start": 521.2000122070312,
      "end": 524.8800048828125,
      "text": " First and foremost, the way that we ought to pray for leaders"
    },
    {
      "id": 188,
      "start": 524.8800048828125,
      "end": 527.3200073242188,
      "text": " is that they would be saved by the grace of God."
    },
    {
      "id": 189,
      "start": 528.4000244140625,
      "end": 529.6799926757812,
      "text": " I've had the opportunity,"
    },
    {
      "id": 190,
      "start": 529.6799926757812,
      "end": 531.4000244140625,
      "text": " not with all of our elected officials,"
    },
    {
      "id": 191,
      "start": 531.4000244140625,
      "end": 533.1599731445312,
      "text": " but with some of our elected officials,"
    },
    {
      "id": 192,
      "start": 533.1599731445312,
      "end": 535.6799926757812,
      "text": " I've had the opportunity to personally"
    },
    {
      "id": 193,
      "start": 535.6799926757812,
      "end": 537.239990234375,
      "text": " share the gospel with them."
    },
    {
      "id": 194,
      "start": 538.239990234375,
      "end": 542.1199951171875,
      "text": " I sat in Mr. Connolly's office, who was our US Congressman,"
    },
    {
      "id": 195,
      "start": 542.1199951171875,
      "end": 545.4400024414062,
      "text": " Mr. Cain and Mr. Warner would not meet with me,"
    },
    {
      "id": 196,
      "start": 545.4400024414062,
      "end": 546.8400268554688,
      "text": " but I met with Mr. Connolly"
    },
    {
      "id": 197,
      "start": 546.8400268554688,
      "end": 549.5599975585938,
      "text": " and I personally shared the gospel with him."
    },
    {
      "id": 198,
      "start": 549.5599975585938,
      "end": 553.8400268554688,
      "text": " He is a lost man, but he needs to be saved."
    },
    {
      "id": 199,
      "start": 553.8400268554688,
      "end": 555.1199951171875,
      "text": " He needs to be saved."
    },
    {
      "id": 200,
      "start": 555.1199951171875,
      "end": 557.47998046875,
      "text": " By the way, you understand why lost people"
    },
    {
      "id": 201,
      "start": 557.47998046875,
      "end": 559.239990234375,
      "text": " behave like they do?"
    },
    {
      "id": 202,
      "start": 559.239990234375,
      "end": 560.47998046875,
      "text": " Because they're lost."
    },
    {
      "id": 203,
      "start": 562.8400268554688,
      "end": 564.3200073242188,
      "text": " It's hard enough to get saved people"
    },
    {
      "id": 204,
      "start": 564.3200073242188,
      "end": 565.6799926757812,
      "text": " to act like saved people."
    },
    {
      "id": 205,
      "start": 566.6799926757812,
      "end": 568.0,
      "text": " Is it not true?"
    },
    {
      "id": 206,
      "start": 569.47998046875,
      "end": 570.8400268554688,
      "text": " But you try to get some lost people"
    },
    {
      "id": 207,
      "start": 570.8400268554688,
      "end": 573.0399780273438,
      "text": " to act like saved people."
    },
    {
      "id": 208,
      "start": 573.0399780273438,
      "end": 574.5599975585938,
      "text": " To think like and to, no, no,"
    },
    {
      "id": 209,
      "start": 574.5599975585938,
      "end": 576.280029296875,
      "text": " the Bible says that the natural man receiveth"
    },
    {
      "id": 210,
      "start": 576.280029296875,
      "end": 577.47998046875,
      "text": " not the things of the spirit of God"
    },
    {
      "id": 211,
      "start": 577.47998046875,
      "end": 578.7999877929688,
      "text": " for their foolishness unto him,"
    },
    {
      "id": 212,
      "start": 578.7999877929688,
      "end": 580.2000122070312,
      "text": " neither can he know them, why?"
    },
    {
      "id": 213,
      "start": 580.2000122070312,
      "end": 582.1199951171875,
      "text": " Because they are spiritually discerned."
    },
    {
      "id": 214,
      "start": 582.1199951171875,
      "end": 586.0399780273438,
      "text": " How can we expect a lost person to vote"
    },
    {
      "id": 215,
      "start": 586.0399780273438,
      "end": 589.760009765625,
      "text": " or to legislate like a saved person?"
    },
    {
      "id": 216,
      "start": 589.760009765625,
      "end": 590.9600219726562,
      "text": " We can't."
    },
    {
      "id": 217,
      "start": 590.9600219726562,
      "end": 591.7999877929688,
      "text": " So what do we pray?"
    },
    {
      "id": 218,
      "start": 591.7999877929688,
      "end": 593.719970703125,
      "text": " We pray for their salvation."
    },
    {
      "id": 219,
      "start": 594.0800170898438,
      "end": 596.5599975585938,
      "text": " We pray that God would bring circumstances"
    },
    {
      "id": 220,
      "start": 596.5599975585938,
      "end": 598.2000122070312,
      "text": " and people into their lives"
    },
    {
      "id": 221,
      "start": 598.2000122070312,
      "end": 600.4000244140625,
      "text": " that would have boldness to speak the truth."
    },
    {
      "id": 0,
      "start": 600.4000244140625,
      "end": 605.1600246429443,
      "text": " truth of God. You think about the Apostle Paul, as God gave him opportunity to stand"
    },
    {
      "id": 1,
      "start": 605.1600246429443,
      "end": 610.4800243377686,
      "text": " before leaders, to stand before those who had great authority, to stand before kings."
    },
    {
      "id": 2,
      "start": 610.4800243377686,
      "end": 615.1000242233276,
      "text": " You know what Paul did? He shared the gospel with them. We do not see where Paul stands"
    },
    {
      "id": 3,
      "start": 615.1000242233276,
      "end": 618.5200252532959,
      "text": " before the leaders. If you study the book of Acts and say, let me plead my case, let"
    },
    {
      "id": 4,
      "start": 618.5200252532959,
      "end": 621.1600246429443,
      "text": " me tell you why I'm innocent, let me tell you why I should be released. You know what"
    },
    {
      "id": 5,
      "start": 621.1600246429443,
      "end": 628.3200244903564,
      "text": " Paul does? He takes and he seizes the opportunity to preach the gospel. Why? Because Festus"
    },
    {
      "id": 6,
      "start": 628.3200244903564,
      "end": 637.6400260925293,
      "text": " and Felis and Agrippa, they needed to be saved. Festus, Felis, I think I said Felis, Felis"
    },
    {
      "id": 7,
      "start": 637.6400260925293,
      "end": 643.2400245666504,
      "text": " and Agrippa. They needed to be saved. You know what Agrippa says? Festus, he says, you're"
    },
    {
      "id": 8,
      "start": 643.2400245666504,
      "end": 647.8000259399414,
      "text": " mad. He's under such conviction. He says, get out of here. Agrippa says, almost. Now"
    },
    {
      "id": 9,
      "start": 647.8000259399414,
      "end": 657.4400253295898,
      "text": " persuade us to be a Christian. Pray for their salvation. We've got a lot of leaders that"
    },
    {
      "id": 10,
      "start": 657.4400253295898,
      "end": 664.640022277832,
      "text": " are lost. A lot of leaders that are lost. The temptation for every one of us, and I"
    },
    {
      "id": 11,
      "start": 664.640022277832,
      "end": 671.4400253295898,
      "text": " hear it and I'm guilty of it myself, is the temptation is that we complain and we criticize"
    },
    {
      "id": 12,
      "start": 671.4400253295898,
      "end": 678.0800247192383,
      "text": " at the same time that we're ignoring what God said that we're to do. God didn't say"
    },
    {
      "id": 13,
      "start": 678.0800247192383,
      "end": 682.7200241088867,
      "text": " complain about them. He didn't say criticize them. He didn't say protest against them."
    },
    {
      "id": 14,
      "start": 682.7200241088867,
      "end": 691.2800216674805,
      "text": " He said pray for them. Now that's convicting. That steps on your toes because we're guilty"
    },
    {
      "id": 15,
      "start": 691.2800216674805,
      "end": 698.0400238037109,
      "text": " this morning. We should pray for their salvation. Let me ask this question. Obviously, I'll"
    },
    {
      "id": 16,
      "start": 698.0400238037109,
      "end": 702.5200271606445,
      "text": " say this. How should we pray for them? If you do have an elected official that's a saved"
    },
    {
      "id": 17,
      "start": 702.5200271606445,
      "end": 708.4400253295898,
      "text": " person, you should pray that God will protect them and that God will help them to live righteously,"
    },
    {
      "id": 18,
      "start": 708.4400253295898,
      "end": 712.8800277709961,
      "text": " that God will help them to have courage and boldness to stand for truth. There are some"
    },
    {
      "id": 19,
      "start": 712.8800277709961,
      "end": 718.2400207519531,
      "text": " elected officials in our nation, in our state, that are saved people I have met with and"
    },
    {
      "id": 20,
      "start": 718.2400207519531,
      "end": 724.3600234985352,
      "text": " I have heard personally people share their testimony of salvation. I have had the privilege"
    },
    {
      "id": 21,
      "start": 724.3600234985352,
      "end": 730.2400207519531,
      "text": " of shaking the hands of some of our elected officials that stood up without any compromise"
    },
    {
      "id": 22,
      "start": 730.2400207519531,
      "end": 737.0000305175781,
      "text": " whatsoever and proclaimed their faith in Jesus Christ. There are not many of them, but there"
    },
    {
      "id": 23,
      "start": 737.0400238037109,
      "end": 744.0400238037109,
      "text": " are some. Well, we need to pray for them. Why? Because they're in a dead alliance, honestly."
    },
    {
      "id": 24,
      "start": 745.4800262451172,
      "end": 748.8800201416016,
      "text": " We need to pray for those to be saved that are lost, but we need to pray for those that"
    },
    {
      "id": 25,
      "start": 748.8800201416016,
      "end": 753.0000305175781,
      "text": " are saved to have courage and boldness and not to quit and say, you know what, this is"
    },
    {
      "id": 26,
      "start": 753.0000305175781,
      "end": 757.6400299072266,
      "text": " hard and it's difficult and every day there are challenges. No, that God would give them"
    },
    {
      "id": 27,
      "start": 757.6400299072266,
      "end": 764.6400299072266,
      "text": " some strength to be able to stick in and fight the good fight."
    },
    {
      "id": 28,
      "start": 764.6400299072266,
      "end": 771.6400299072266,
      "text": " Why should we pray for leaders? Well, number one, very simply, it's a matter of obedience."
    },
    {
      "id": 29,
      "start": 772.280029296875,
      "end": 775.7200317382812,
      "text": " Because if you don't, you're disobedient. You say, well, that's pretty direct. Yeah,"
    },
    {
      "id": 30,
      "start": 775.7200317382812,
      "end": 780.4000244140625,
      "text": " that's what the Bible says. To him that knoweth to do good and doeth it not, to him it is"
    },
    {
      "id": 31,
      "start": 780.4000244140625,
      "end": 787.4000244140625,
      "text": " sin. We don't like that word a whole lot. God, if I messed up. No, you sinned against"
    },
    {
      "id": 32,
      "start": 788.3600311279297,
      "end": 795.2000274658203,
      "text": " a holy God. Amen? So, it's a matter of obedience. We're to be doers of the word and not hearers"
    },
    {
      "id": 33,
      "start": 795.2000274658203,
      "end": 800.4000244140625,
      "text": " only. We can't take, we've been teaching in Sunday School about the King James Bible."
    },
    {
      "id": 34,
      "start": 800.4000244140625,
      "end": 805.4800262451172,
      "text": " We're not going to take a pen knife and just remove verses like so many of the modern versions"
    },
    {
      "id": 35,
      "start": 805.4800262451172,
      "end": 809.6800231933594,
      "text": " do. But why is it that we say, no, we have the King James Bible, but then we just ignore"
    },
    {
      "id": 36,
      "start": 809.6800231933594,
      "end": 816.6800231933594,
      "text": " certain portions of Scripture? Is it not the same thing? We find this morning, we have"
    },
    {
      "id": 37,
      "start": 817.4000244140625,
      "end": 819.2400207519531,
      "text": " the King James Bible, and we say, why should we pray for leaders? Well, number one, it's"
    },
    {
      "id": 38,
      "start": 819.2400207519531,
      "end": 824.0000305175781,
      "text": " a matter of obedience. Number two, it pleases God. Notice what the Bible says in verse number"
    },
    {
      "id": 39,
      "start": 824.0000305175781,
      "end": 831.0000305175781,
      "text": " three, for this is good and acceptable in the sight of God our Savior. You know what?"
    },
    {
      "id": 40,
      "start": 831.6000213623047,
      "end": 837.8400268554688,
      "text": " If we find something as explicit as this, that God plainly says to us, this is good"
    },
    {
      "id": 41,
      "start": 837.8400268554688,
      "end": 843.0000305175781,
      "text": " and acceptable and pleasing in my sight, we ought to pay attention to that. And we're"
    },
    {
      "id": 42,
      "start": 843.0000305175781,
      "end": 848.3200225830078,
      "text": " to say, well, I ought to be engaged in doing that. In like manner, when God says, this"
    },
    {
      "id": 43,
      "start": 848.3200225830078,
      "end": 853.52001953125,
      "text": " is displeasing, with many of them, 1 Corinthians 10, God was not well pleased. Let us take"
    },
    {
      "id": 44,
      "start": 853.52001953125,
      "end": 858.8800354003906,
      "text": " note and say, I don't want to do those things because God is not pleased with those things."
    },
    {
      "id": 45,
      "start": 858.8800354003906,
      "end": 864.280029296875,
      "text": " But here, explicitly, see, Ephesians says that we're to prove what is acceptable unto"
    },
    {
      "id": 46,
      "start": 864.280029296875,
      "end": 870.9600219726562,
      "text": " the Lord. We examine the Scriptures, we dig in, what pleases God? Well, this verse is"
    },
    {
      "id": 47,
      "start": 870.9600219726562,
      "end": 876.9200134277344,
      "text": " a very plain verse. You don't have to dig real deep, you don't have to be a super intelligent"
    },
    {
      "id": 48,
      "start": 876.9200134277344,
      "end": 881.0800170898438,
      "text": " person to understand that the Bible says, this is good and acceptable in the sight of"
    },
    {
      "id": 49,
      "start": 881.0800170898438,
      "end": 886.8400268554688,
      "text": " God our Savior. All right, well, that pleases God. Proving what is acceptable. So, if it"
    },
    {
      "id": 50,
      "start": 886.8400268554688,
      "end": 892.9800109863281,
      "text": " pleases God, I ought to be doing it. Do you agree? Why would we not do something that"
    },
    {
      "id": 51,
      "start": 892.9800109863281,
      "end": 899.7200317382812,
      "text": " pleases God? Can I tell you in one answer, one word? Because of our flesh. What our flesh"
    },
    {
      "id": 52,
      "start": 899.760009765625,
      "end": 903.6000366210938,
      "text": " wants to do? Wants to criticize and wants to complain. That's what our flesh wants to"
    },
    {
      "id": 53,
      "start": 903.6000366210938,
      "end": 912.8000183105469,
      "text": " do. Why should we pray for leaders? Number three, not only because it's a matter of obedience"
    },
    {
      "id": 54,
      "start": 912.8000183105469,
      "end": 918.760009765625,
      "text": " and because it pleases God, but number three, because God is sovereign and He answers prayer."
    },
    {
      "id": 55,
      "start": 918.760009765625,
      "end": 923.8800354003906,
      "text": " Because God is sovereign and He answers prayer. Hold your place here in 1 Timothy 2, but look"
    },
    {
      "id": 56,
      "start": 923.8800354003906,
      "end": 927.4000244140625,
      "text": " over, if you will, to the book of Proverbs. We're going to look at a few verses of Scripture."
    },
    {
      "id": 57,
      "start": 927.4000244140625,
      "end": 931.7200317382812,
      "text": " I'm so thankful to serve a sovereign God, aren't you? I'm so thankful that our God is"
    },
    {
      "id": 58,
      "start": 931.7200317382812,
      "end": 936.8000183105469,
      "text": " omnipotent. He has all power. He said, nothing is too difficult for me. And we have these"
    },
    {
      "id": 59,
      "start": 936.8000183105469,
      "end": 942.9600219726562,
      "text": " wonderful promises. Listen, we quote the promises when God says to Jeremiah, call unto me and"
    },
    {
      "id": 60,
      "start": 942.9600219726562,
      "end": 948.8000183105469,
      "text": " I will answer thee and show thee great mighty things which thou knowest not. We pray, understanding"
    },
    {
      "id": 61,
      "start": 948.8000183105469,
      "end": 953.3600158691406,
      "text": " the promise of Ephesians 3.20, now unto him which is able to do exceeding abundantly above"
    },
    {
      "id": 62,
      "start": 953.3600158691406,
      "end": 959.2400207519531,
      "text": " all that we ask or think. You say, no, God, we're not going to pray for those people because"
    },
    {
      "id": 63,
      "start": 959.2400207519531,
      "end": 965.0000305175781,
      "text": " they're hopeless, they're helpless. No, we serve a sovereign God who hears and answers"
    },
    {
      "id": 64,
      "start": 965.0000305175781,
      "end": 971.6400146484375,
      "text": " prayer, who is able. I don't know how He's always going to work and neither do you, but"
    },
    {
      "id": 65,
      "start": 971.6400146484375,
      "end": 978.1200256347656,
      "text": " when we study the Scriptures, we find that God works in amazing, miraculous ways. No"
    },
    {
      "id": 66,
      "start": 978.1200256347656,
      "end": 982.1200256347656,
      "text": " doubt that there are some accounts that we could go to this morning that we see the heroes"
    },
    {
      "id": 67,
      "start": 982.1200256347656,
      "end": 988.5600280761719,
      "text": " of the faith that prayed not knowing how God was going to work, but they believed."
    },
    {
      "id": 68,
      "start": 988.5600280761719,
      "end": 997.6000366210938,
      "text": " And they prayed. And God worked. Notice Proverbs 21. In Proverbs chapter 21, God gives us this"
    },
    {
      "id": 69,
      "start": 997.6000366210938,
      "end": 1002.6000366210938,
      "text": " truth in verse number 1. Notice what the Bible says. Remember, we're praying for leaders,"
    },
    {
      "id": 70,
      "start": 1002.6000366210938,
      "end": 1007.6000366210938,
      "text": " for kings and all that are in authority according to 1 Timothy 2 and verse number 2. And here"
    },
    {
      "id": 71,
      "start": 1007.6000366210938,
      "end": 1016.9600219726562,
      "text": " in Proverbs 21 and verse number 1, the Bible says the king's heart is in the hand of who?"
    },
    {
      "id": 72,
      "start": 1016.9600219726562,
      "end": 1022.3600158691406,
      "text": " The Lord. That's my God. That's your God. That's the one that hears your prayers and"
    },
    {
      "id": 73,
      "start": 1022.3600158691406,
      "end": 1026.8000183105469,
      "text": " hears my prayers. That's the one that answers our prayers. The Bible says that the king's"
    },
    {
      "id": 74,
      "start": 1026.8000183105469,
      "end": 1034.0400390625,
      "text": " heart is in the hand of the Lord. Notice it says, as the rivers of water, He. Who is He?"
    },
    {
      "id": 75,
      "start": 1034.0400390625,
      "end": 1040.1200256347656,
      "text": " That's the Lord. That's God. He turneth it. What's it? Well, that's the king's heart."
    },
    {
      "id": 76,
      "start": 1040.1200256347656,
      "end": 1050.760009765625,
      "text": " Amen? You follow? Withersoever He. Who's He? The Lord will. Do you notice that verse? That's"
    },
    {
      "id": 77,
      "start": 1050.760009765625,
      "end": 1056.52001953125,
      "text": " a powerful verse of Scripture. The king's heart is in the hand of the Lord. And He,"
    },
    {
      "id": 78,
      "start": 1056.52001953125,
      "end": 1061.8000183105469,
      "text": " the Lord, as the rivers of water, and He, the Lord, turneth it withersoever He, the"
    },
    {
      "id": 79,
      "start": 1061.8000183105469,
      "end": 1068.9200134277344,
      "text": " Lord will. Wow. Why should we pray for leaders? Well, because it's a matter of obedience,"
    },
    {
      "id": 80,
      "start": 1068.9200134277344,
      "end": 1073.9600219726562,
      "text": " number 1. Number 2, because we find that it pleases God. But number 3, because we serve"
    },
    {
      "id": 81,
      "start": 1073.9600219726562,
      "end": 1079.3200378417969,
      "text": " a sovereign God who is in control of all things that hears and answers prayer. Keeping"
    },
    {
      "id": 82,
      "start": 1079.3200378417969,
      "end": 1083.9200134277344,
      "text": " in mind the truth of Proverbs 21 and verse number 1, turn back to the book of Ezra, if"
    },
    {
      "id": 83,
      "start": 1083.9200134277344,
      "end": 1089.8400268554688,
      "text": " you will. Turn back to the book of Ezra and turn to chapter number 7. Ezra chapter number"
    },
    {
      "id": 84,
      "start": 1089.8400268554688,
      "end": 1095.4800109863281,
      "text": " 7. If you know anything about the history of this portion of Scripture, Ezra and Nehemiah,"
    },
    {
      "id": 85,
      "start": 1095.4800109863281,
      "end": 1102.52001953125,
      "text": " they're post-exilic books. They're written historically recording for us the events that"
    },
    {
      "id": 86,
      "start": 1102.52001953125,
      "end": 1109.0000305175781,
      "text": " happen after the Babylonian captivity. And after the Babylonian captivity, 70 years as"
    },
    {
      "id": 87,
      "start": 1109.0000305175781,
      "end": 1114.4400024414062,
      "text": " prophesied by Jeremiah, the 70 years are fulfilled. Daniel understands that as he's reading the"
    },
    {
      "id": 88,
      "start": 1114.4400024414062,
      "end": 1117.7200317382812,
      "text": " books. We see that in the book of Daniel. And we find, in fact, we're going to look"
    },
    {
      "id": 89,
      "start": 1117.7200317382812,
      "end": 1121.1600341796875,
      "text": " at 2 Chronicles here in just a moment. Maybe I should have looked at that one first. But"
    },
    {
      "id": 90,
      "start": 1121.1600341796875,
      "end": 1125.280029296875,
      "text": " let me just reference it. You stay here in Ezra. But in 2 Chronicles chapter 36, at the"
    },
    {
      "id": 91,
      "start": 1125.280029296875,
      "end": 1131.8800048828125,
      "text": " end of the 70 years, in 2 Chronicles 36, notice what the Bible says in verse 22. It says,"
    },
    {
      "id": 92,
      "start": 1131.8800048828125,
      "end": 1136.6800537109375,
      "text": " now in the first year of Cyrus, king of Persia, that the word of the Lord spoken by the mouth"
    },
    {
      "id": 93,
      "start": 1136.6800537109375,
      "end": 1141.800048828125,
      "text": " of Jeremiah might be accomplished. Not because it was Jeremiah's word, but it was God's word"
    },
    {
      "id": 94,
      "start": 1141.8800048828125,
      "end": 1148.3600463867188,
      "text": " spoken through Jeremiah of 70 years of captivity. Why? Because of their disobedience. And they"
    },
    {
      "id": 95,
      "start": 1148.3600463867188,
      "end": 1153.1600341796875,
      "text": " were taken into Babylonian captivity, but God promised that a remnant would return."
    },
    {
      "id": 96,
      "start": 1153.1600341796875,
      "end": 1157.800048828125,
      "text": " And we find that the Bible says, notice in the middle of verse 22 of 2 Chronicles 36,"
    },
    {
      "id": 97,
      "start": 1157.800048828125,
      "end": 1170.4400024414062,
      "text": " the Lord stirred up the spirit of Cyrus, king of Persia. Who started up? The Lord."
    },
    {
      "id": 98,
      "start": 1171.0,
      "end": 1175.800048828125,
      "text": " What did he stir him up to do? Well, that he made a proclamation."
    },
    {
      "id": 99,
      "start": 1177.3200073242188,
      "end": 1182.2000122070312,
      "text": " Cyrus, he makes a proclamation. You know what he says? It's throughout all his kingdom. And put"
    },
    {
      "id": 100,
      "start": 1182.2000122070312,
      "end": 1186.4400024414062,
      "text": " it also in writing, saying, thus saith Cyrus, king of Persia, all the kingdoms of the earth"
    },
    {
      "id": 101,
      "start": 1186.4400024414062,
      "end": 1190.6800537109375,
      "text": " hath the Lord God of heaven given me, and he hath charged me to build him a house in Jerusalem,"
    },
    {
      "id": 102,
      "start": 1190.6800537109375,
      "end": 1199.3200073242188,
      "text": " which is in Judah. Really? After the temple's destroyed and after the Babylonian captivity,"
    },
    {
      "id": 103,
      "start": 1199.3200073242188,
      "end": 1200.6000366210938,
      "text": " when the Babylonians come..."
    },
    {
      "id": 0,
      "start": 1200.6000366210938,
      "end": 1204.0800366401672,
      "text": " in and destroy and everything that happens and we find that he says God has"
    },
    {
      "id": 1,
      "start": 1204.0800366401672,
      "end": 1208.2400364875793,
      "text": " given me a charge he puts it in writing that God charged me to build a house in"
    },
    {
      "id": 2,
      "start": 1208.2400364875793,
      "end": 1211.880036354065,
      "text": " Jerusalem and then he says who is there among you of all his people the Lord has"
    },
    {
      "id": 3,
      "start": 1211.880036354065,
      "end": 1217.8800373077393,
      "text": " God be with him and let him go up you know who did that God God did it in"
    },
    {
      "id": 4,
      "start": 1217.8800373077393,
      "end": 1222.2800369262695,
      "text": " Ezra they're there and there's all sorts of things in fact we can look at a"
    },
    {
      "id": 5,
      "start": 1222.2800369262695,
      "end": 1226.920036315918,
      "text": " number of examples there in the book of Ezra in the book of Nehemiah how God was"
    },
    {
      "id": 6,
      "start": 1226.920036315918,
      "end": 1230.920036315918,
      "text": " working and how God was moving and the opposition came and the opposition sent"
    },
    {
      "id": 7,
      "start": 1230.920036315918,
      "end": 1234.6800384521484,
      "text": " letters and said command that they stop you know what the letters came back no"
    },
    {
      "id": 8,
      "start": 1234.6800384521484,
      "end": 1238.08003616333,
      "text": " actually continue on and you guys give them all the resources that they need"
    },
    {
      "id": 9,
      "start": 1238.08003616333,
      "end": 1244.9600372314453,
      "text": " and if you refuse to do it you're put to death Wow that's pretty significant"
    },
    {
      "id": 10,
      "start": 1244.9600372314453,
      "end": 1252.1600379943848,
      "text": " who's doing that God the Lord the Lord you say but God can't do anything with"
    },
    {
      "id": 11,
      "start": 1252.1600379943848,
      "end": 1263.4400367736816,
      "text": " our leaders really you have a small view of God notice in Ezra 7 in verse"
    },
    {
      "id": 12,
      "start": 1263.4400367736816,
      "end": 1268.5600357055664,
      "text": " number 27 they're rejoicing because of the letter that was received from our"
    },
    {
      "id": 13,
      "start": 1268.5600357055664,
      "end": 1274.0400390625,
      "text": " desert sees the king and all that was going on I wish we had time to read all"
    },
    {
      "id": 14,
      "start": 1274.0400390625,
      "end": 1277.7200393676758,
      "text": " of it but I just want to see what they say is the rejoicing in verse 27"
    },
    {
      "id": 15,
      "start": 1277.7200393676758,
      "end": 1284.4400329589844,
      "text": " blessed be the Lord God of our fathers which hath put such a thing as this"
    },
    {
      "id": 16,
      "start": 1284.4400329589844,
      "end": 1293.3600387573242,
      "text": " where in the king's heart to beautify the house of the Lord which is where"
    },
    {
      "id": 17,
      "start": 1293.3600387573242,
      "end": 1307.4800338745117,
      "text": " it's in Jerusalem it's in Jerusalem this is written like 500 400 BC 450 BC okay"
    },
    {
      "id": 18,
      "start": 1307.4800338745117,
      "end": 1313.6800384521484,
      "text": " and Cyrus said all of you can return our exerts he's writes this letter all"
    },
    {
      "id": 19,
      "start": 1313.6800384521484,
      "end": 1317.520034790039,
      "text": " these things are happening that a house the house of God the temple to be"
    },
    {
      "id": 20,
      "start": 1317.520034790039,
      "end": 1322.520034790039,
      "text": " beautified the house of the Lord which is in Jerusalem what was God doing God"
    },
    {
      "id": 21,
      "start": 1322.520034790039,
      "end": 1328.2800369262695,
      "text": " was working God was working it says the people of God recognized and they say"
    },
    {
      "id": 22,
      "start": 1328.2800369262695,
      "end": 1332.1200408935547,
      "text": " blessed be the Lord God of our fathers which hath put such a thing as this in"
    },
    {
      "id": 23,
      "start": 1332.1200408935547,
      "end": 1341.0000305175781,
      "text": " the king's heart why do we pray for leaders why does the scripture why does"
    },
    {
      "id": 24,
      "start": 1341.0000305175781,
      "end": 1347.0000305175781,
      "text": " the Bible tell us that were to pray for all men but then say for kings and for"
    },
    {
      "id": 25,
      "start": 1347.0000305175781,
      "end": 1352.0800323486328,
      "text": " all that are in authority well we should pray for them to be saved and if they're"
    },
    {
      "id": 26,
      "start": 1352.0800323486328,
      "end": 1355.0000305175781,
      "text": " saying we should pray that they would stand and they would grow and they would"
    },
    {
      "id": 27,
      "start": 1355.0000305175781,
      "end": 1360.1600341796875,
      "text": " be they would have courage as believers that they would live and act and vote"
    },
    {
      "id": 28,
      "start": 1360.1600341796875,
      "end": 1364.6800384521484,
      "text": " and legislate like believers and we find that if we understand and answer"
    },
    {
      "id": 29,
      "start": 1364.6800384521484,
      "end": 1367.800033569336,
      "text": " the question why should we pray for leaders it's a matter of obedience it"
    },
    {
      "id": 30,
      "start": 1367.800033569336,
      "end": 1375.1200408935547,
      "text": " pleases God and we serve a God who is sovereign who is able and he answers"
    },
    {
      "id": 31,
      "start": 1375.1200408935547,
      "end": 1381.4800415039062,
      "text": " prayer we find as I mentioned already by way of introduction that in verse number"
    },
    {
      "id": 32,
      "start": 1381.4800415039062,
      "end": 1386.0800323486328,
      "text": " two the Bible says that we may lead a quiet and peaceable life in all"
    },
    {
      "id": 33,
      "start": 1386.0800323486328,
      "end": 1390.7200317382812,
      "text": " godliness and honesty notice the result when we're praying for those in"
    },
    {
      "id": 34,
      "start": 1390.7200317382812,
      "end": 1394.0400390625,
      "text": " leadership we're praying for them we find that it says that we may lead a"
    },
    {
      "id": 35,
      "start": 1394.0400390625,
      "end": 1398.0400390625,
      "text": " quiet and peaceful life in all godliness and honesty you know God gives us a"
    },
    {
      "id": 36,
      "start": 1398.0400390625,
      "end": 1404.4800415039062,
      "text": " peace you know the peace that he gives us is that he's in control he's in"
    },
    {
      "id": 37,
      "start": 1404.4800415039062,
      "end": 1409.6000366210938,
      "text": " control you say did Jeremiah trust God yes did the Babylonians conquer Judah"
    },
    {
      "id": 38,
      "start": 1409.6000366210938,
      "end": 1414.5800323486328,
      "text": " yes because God said that was going to happen but you know Jeremiah was taken"
    },
    {
      "id": 39,
      "start": 1414.5800323486328,
      "end": 1421.5000305175781,
      "text": " well care of Jeremiah had a peace oh there are a bunch of people in Judah"
    },
    {
      "id": 40,
      "start": 1421.5000305175781,
      "end": 1429.020034790039,
      "text": " that hated Jeremiah because of what he preached but God took good care of them"
    },
    {
      "id": 41,
      "start": 1429.020034790039,
      "end": 1432.9400329589844,
      "text": " you know when Nebuchadnezzar and those guys came in they said you know what you"
    },
    {
      "id": 42,
      "start": 1432.9400329589844,
      "end": 1442.8200378417969,
      "text": " let Jeremiah decide what he wants it's amazing it's amazing how God works God"
    },
    {
      "id": 43,
      "start": 1442.8200378417969,
      "end": 1447.5000305175781,
      "text": " can give us a listen when we go to God in prayer the answer might not always be"
    },
    {
      "id": 44,
      "start": 1447.5000305175781,
      "end": 1455.060043334961,
      "text": " yes but we can have a peace that God is sovereign and God is in control and I"
    },
    {
      "id": 45,
      "start": 1455.060043334961,
      "end": 1463.7400512695312,
      "text": " took this to God and I'm gonna let God be God amen and we find this morning"
    },
    {
      "id": 46,
      "start": 1463.7400512695312,
      "end": 1469.8200378417969,
      "text": " that I believe that in 1st Timothy chapter 2 when the Bible gives us this"
    },
    {
      "id": 47,
      "start": 1469.8200378417969,
      "end": 1474.7000427246094,
      "text": " command to pray which is crystal clear the command is clear that those that"
    },
    {
      "id": 48,
      "start": 1474.7000427246094,
      "end": 1479.1800231933594,
      "text": " would engage in obeying this verse of scripture these verses of scripture are"
    },
    {
      "id": 49,
      "start": 1479.1800231933594,
      "end": 1483.780029296875,
      "text": " those that would be through their actions revealing their spiritual growth"
    },
    {
      "id": 50,
      "start": 1483.780029296875,
      "end": 1488.1400451660156,
      "text": " and maturity notice in the book of Matthew if you will in Matthew chapter"
    },
    {
      "id": 51,
      "start": 1488.1400451660156,
      "end": 1494.5800476074219,
      "text": " 5 I want you to notice what Jesus says Jesus is teaching in Matthew 5 we're"
    },
    {
      "id": 52,
      "start": 1494.5800476074219,
      "end": 1498.6600341796875,
      "text": " familiar with the passage of scripture but I want to focus in just as it"
    },
    {
      "id": 53,
      "start": 1498.6600341796875,
      "end": 1503.4200439453125,
      "text": " applies to this portion of scripture in 1st Timothy 2 in verses 43 through 48 in"
    },
    {
      "id": 54,
      "start": 1503.4200439453125,
      "end": 1509.9000244140625,
      "text": " Matthew chapter number 5 notice what the Bible says ye have heard in fact through"
    },
    {
      "id": 55,
      "start": 1509.9000244140625,
      "end": 1514.2200317382812,
      "text": " this portion of scripture you'll see this contrast where Jesus says ye have"
    },
    {
      "id": 56,
      "start": 1514.2200317382812,
      "end": 1522.300048828125,
      "text": " heard or it hath been said and then Jesus says but I say unto you so here's"
    },
    {
      "id": 57,
      "start": 1522.300048828125,
      "end": 1526.9800415039062,
      "text": " what you've heard here's what you've maybe had as a tradition but here's what"
    },
    {
      "id": 58,
      "start": 1526.9800415039062,
      "end": 1532.3800354003906,
      "text": " I'm saying to you and notice in verse 43 ye have heard that it hath been said"
    },
    {
      "id": 59,
      "start": 1532.3800354003906,
      "end": 1537.5800476074219,
      "text": " thou shalt love thy neighbor notice and hate thine enemy well that's pretty easy"
    },
    {
      "id": 60,
      "start": 1537.5800476074219,
      "end": 1545.7000427246094,
      "text": " to do in the flesh you know you love people that love you it's easy to do is"
    },
    {
      "id": 61,
      "start": 1545.7000427246094,
      "end": 1551.7000427246094,
      "text": " it not it's a whole nother ballgame to love somebody that hates you do you"
    },
    {
      "id": 62,
      "start": 1551.7000427246094,
      "end": 1557.300048828125,
      "text": " agree notice he says that this is what you've heard notice verse 44 but I say"
    },
    {
      "id": 63,
      "start": 1557.300048828125,
      "end": 1571.9400329589844,
      "text": " unto you love your enemies love your enemies bless them that curse you do"
    },
    {
      "id": 64,
      "start": 1571.9400329589844,
      "end": 1583.8600463867188,
      "text": " good to them that hate you and pray for them which despitefully use you and"
    },
    {
      "id": 65,
      "start": 1583.8600463867188,
      "end": 1590.4200439453125,
      "text": " persecute you is there anything easy about verse 44 is there anything in your"
    },
    {
      "id": 66,
      "start": 1590.4200439453125,
      "end": 1598.1000366210938,
      "text": " flesh or in my flesh that can do verse 44 it's only with the help of God it's"
    },
    {
      "id": 67,
      "start": 1598.1000366210938,
      "end": 1603.0200500488281,
      "text": " only with the Spirit of God enabling us to be able to bless those that curse us"
    },
    {
      "id": 68,
      "start": 1603.0200500488281,
      "end": 1608.5800476074219,
      "text": " to love those that hate us to pray for those who persecute us that's just not"
    },
    {
      "id": 69,
      "start": 1608.5800476074219,
      "end": 1615.7000427246094,
      "text": " normal it's not natural humanly speaking why'd you hit him you ask the kid in the"
    },
    {
      "id": 70,
      "start": 1615.7000427246094,
      "end": 1621.8600463867188,
      "text": " nursery because he hit me how many of you heard that how many of you said that"
    },
    {
      "id": 71,
      "start": 1621.9000244140625,
      "end": 1628.8200378417969,
      "text": " amen why'd you hit him I remember my little nephew Carter sweet little kid"
    },
    {
      "id": 72,
      "start": 1628.8200378417969,
      "end": 1634.5800476074219,
      "text": " man he's he's older now but I remember man he was like five years old him and"
    },
    {
      "id": 73,
      "start": 1634.5800476074219,
      "end": 1638.5800476074219,
      "text": " Michaela were fighting and my brother called him in and said Carter did you"
    },
    {
      "id": 74,
      "start": 1638.5800476074219,
      "end": 1645.9000244140625,
      "text": " hit her yes I mean he wasn't trying to hide it he wasn't lying yes Carter why'd"
    },
    {
      "id": 75,
      "start": 1645.9000244140625,
      "end": 1652.3800354003906,
      "text": " you hit her cuz she hit me I mean like that's just a natural thing this is not"
    },
    {
      "id": 76,
      "start": 1652.3800354003906,
      "end": 1661.1000366210938,
      "text": " natural this is spiritual this reveals spiritual maturity this is this is"
    },
    {
      "id": 77,
      "start": 1661.1000366210938,
      "end": 1665.3400268554688,
      "text": " spiritual growth he says in verse 45 that ye may be children of your father"
    },
    {
      "id": 78,
      "start": 1665.3400268554688,
      "end": 1669.3400268554688,
      "text": " which is in heaven for he maketh his son to rise on the evil and on the good and"
    },
    {
      "id": 79,
      "start": 1669.3400268554688,
      "end": 1674.1400451660156,
      "text": " sendeth rain on the just and the unjust for if ye notice verse 46 if ye love"
    },
    {
      "id": 80,
      "start": 1674.1400451660156,
      "end": 1678.780029296875,
      "text": " them which love you what reward have you do not even the publicans the same"
    },
    {
      "id": 81,
      "start": 1678.780029296875,
      "end": 1682.2200317382812,
      "text": " he's using the example of the publicans listen the people that love the"
    },
    {
      "id": 82,
      "start": 1682.2200317382812,
      "end": 1688.7400512695312,
      "text": " publicans they loved them back he says if you salute your brethren only what do"
    },
    {
      "id": 83,
      "start": 1688.7400512695312,
      "end": 1692.7400512695312,
      "text": " you more than others do not even the publicans so be therefore perfect"
    },
    {
      "id": 84,
      "start": 1692.7400512695312,
      "end": 1698.7000427246094,
      "text": " complete even as your father which is in heaven is perfect Wow the command to"
    },
    {
      "id": 85,
      "start": 1698.7000427246094,
      "end": 1706.9000244140625,
      "text": " pray for leaders is clear number two this morning the failure to pray for"
    },
    {
      "id": 86,
      "start": 1706.9000244140625,
      "end": 1717.5800170898438,
      "text": " leaders is common the command is clear but the failure is common this week I"
    },
    {
      "id": 87,
      "start": 1717.5800170898438,
      "end": 1723.3400268554688,
      "text": " said I had the great privilege of preparing this message all week can I"
    },
    {
      "id": 88,
      "start": 1723.3400268554688,
      "end": 1728.5000610351562,
      "text": " tell you that I had to pray and confess my disobedience to God you know why I'm"
    },
    {
      "id": 89,
      "start": 1728.5000610351562,
      "end": 1732.5800170898438,
      "text": " just like you it's easier to complain and criticize what our elected officials"
    },
    {
      "id": 90,
      "start": 1732.5800170898438,
      "end": 1737.260009765625,
      "text": " are doing than it is to pray for them I hope you don't think anything less of me"
    },
    {
      "id": 91,
      "start": 1737.260009765625,
      "end": 1744.02001953125,
      "text": " I'm just being honest but I have a God who said that if I confess he forgives"
    },
    {
      "id": 92,
      "start": 1744.02001953125,
      "end": 1749.5800170898438,
      "text": " and I had to get on my knees and I had to say God I've failed I know what your"
    },
    {
      "id": 93,
      "start": 1749.5800170898438,
      "end": 1755.7000122070312,
      "text": " word says and I've disobeyed it because I have not prayed for those that are in"
    },
    {
      "id": 94,
      "start": 1756.02001953125,
      "end": 1760.4600219726562,
      "text": " like I should you know what I did I took it a step further I went and I got all"
    },
    {
      "id": 95,
      "start": 1760.4600219726562,
      "end": 1764.9800415039062,
      "text": " the names of the people that I need to be praying for I say all not every"
    },
    {
      "id": 96,
      "start": 1764.9800415039062,
      "end": 1769.8600463867188,
      "text": " single congressman and senator but the ones that are in our area the Board of"
    },
    {
      "id": 97,
      "start": 1769.8600463867188,
      "end": 1776.9400634765625,
      "text": " Supervisors here in Fairfax County the state legislators their enrichment that"
    },
    {
      "id": 98,
      "start": 1776.9400634765625,
      "end": 1782.6200561523438,
      "text": " represent our district I went I wrote all the names down why because I'm the"
    },
    {
      "id": 99,
      "start": 1782.780029296875,
      "end": 1786.5000610351562,
      "text": " for you say well pastor you should add a whole lot more to that list I'm starting"
    },
    {
      "id": 100,
      "start": 1786.5000610351562,
      "end": 1795.3800659179688,
      "text": " there amen I'm starting there why because every time you hear the news and"
    },
    {
      "id": 101,
      "start": 1795.3800659179688,
      "end": 1799.7400512695312,
      "text": " you see something else going on it's easy to complain and criticize but God"
    },
    {
      "id": 102,
      "start": 1799.7400512695312,
      "end": 1802.1000366210938,
      "text": " says"
    },
    {
      "id": 0,
      "start": 1802.1000366210938,
      "end": 1811.7000370025635,
      "text": " Pray. Pray for kings and for all that are in authority."
    },
    {
      "id": 1,
      "start": 1811.7000370025635,
      "end": 1817.8200368881226,
      "text": " I told you already, I've had the privilege of sitting and sharing the gospel with several of these elected officials."
    },
    {
      "id": 2,
      "start": 1817.8200368881226,
      "end": 1825.0600357055664,
      "text": " But you know, that does not excuse me from praying for them thereafter."
    },
    {
      "id": 3,
      "start": 1825.0600357055664,
      "end": 1829.4600372314453,
      "text": " My job was not complete when I sat and shared the gospel with them."
    },
    {
      "id": 4,
      "start": 1829.500036239624,
      "end": 1833.5400371551514,
      "text": " That was an appropriate thing to do, but my job didn't end there."
    },
    {
      "id": 5,
      "start": 1833.5400371551514,
      "end": 1836.6600379943848,
      "text": " I've got to still pray for them."
    },
    {
      "id": 6,
      "start": 1836.6600379943848,
      "end": 1842.9000358581543,
      "text": " And I hope this morning that as we look at the sad reality within our churches this morning,"
    },
    {
      "id": 7,
      "start": 1842.9000358581543,
      "end": 1847.420036315918,
      "text": " within our nation this morning, I think this is a common problem."
    },
    {
      "id": 8,
      "start": 1847.420036315918,
      "end": 1852.5400352478027,
      "text": " I think, listen, you know what Peter says? That judgment must begin at the house of God."
    },
    {
      "id": 9,
      "start": 1852.5400352478027,
      "end": 1854.980037689209,
      "text": " That's what Peter said. He said, Pastor, I didn't come to church today to hear all this."
    },
    {
      "id": 10,
      "start": 1854.980037689209,
      "end": 1857.2600364685059,
      "text": " I know, but bless God. Amen."
    },
    {
      "id": 11,
      "start": 1857.2600364685059,
      "end": 1863.7400360107422,
      "text": " We need it. If we're going to have revival in America, we better obey God's word."
    },
    {
      "id": 12,
      "start": 1863.7400360107422,
      "end": 1868.5000381469727,
      "text": " And we're disobedient in this area. I'm just saying we're disobedient in this area."
    },
    {
      "id": 13,
      "start": 1868.5000381469727,
      "end": 1873.4600372314453,
      "text": " I can't speak for every single person, but I know I talk to a lot of people"
    },
    {
      "id": 14,
      "start": 1873.4600372314453,
      "end": 1878.420036315918,
      "text": " and I hear a whole lot more frequently about criticizing and complaining"
    },
    {
      "id": 15,
      "start": 1878.420036315918,
      "end": 1882.2200393676758,
      "text": " than I hear of anybody talking about praying for our leaders."
    },
    {
      "id": 16,
      "start": 1882.2200393676758,
      "end": 1885.1000366210938,
      "text": " I hear it far too often. I hear it from church members."
    },
    {
      "id": 17,
      "start": 1885.1000366210938,
      "end": 1887.4600372314453,
      "text": " I hear it from other pastors. I hear it from evangelists."
    },
    {
      "id": 18,
      "start": 1887.4600372314453,
      "end": 1890.420036315918,
      "text": " I just hear it all the time."
    },
    {
      "id": 19,
      "start": 1890.420036315918,
      "end": 1894.5000381469727,
      "text": " And judgment must begin at the house of God."
    },
    {
      "id": 20,
      "start": 1894.5000381469727,
      "end": 1899.8200378417969,
      "text": " There's some people today that need to do what I did this week and say, God, forgive me,"
    },
    {
      "id": 21,
      "start": 1899.8200378417969,
      "end": 1904.300033569336,
      "text": " and then decide I'm going to pray for leaders as you commanded me to do so."
    },
    {
      "id": 22,
      "start": 1904.300033569336,
      "end": 1907.2200393676758,
      "text": " You say, but I don't like them. It doesn't matter if you like them."
    },
    {
      "id": 23,
      "start": 1907.2200393676758,
      "end": 1911.2200393676758,
      "text": " They're not the same party that I am. It doesn't matter."
    },
    {
      "id": 24,
      "start": 1911.2200393676758,
      "end": 1914.420036315918,
      "text": " They don't think like I think. It doesn't matter."
    },
    {
      "id": 25,
      "start": 1914.420036315918,
      "end": 1918.3400344848633,
      "text": " God said, pray for them. Pray for them."
    },
    {
      "id": 26,
      "start": 1918.3400344848633,
      "end": 1920.5400390625,
      "text": " I said it in the beginning of the message this morning."
    },
    {
      "id": 27,
      "start": 1920.5400390625,
      "end": 1924.7000350952148,
      "text": " I would have been happy if it stopped in verse number one, just pray for all men."
    },
    {
      "id": 28,
      "start": 1924.7000350952148,
      "end": 1928.4600372314453,
      "text": " Why? Because I could kind of make myself feel good about that."
    },
    {
      "id": 29,
      "start": 1928.4600372314453,
      "end": 1933.2600402832031,
      "text": " And so could you. I'm being honest this morning."
    },
    {
      "id": 30,
      "start": 1933.2600402832031,
      "end": 1940.3800354003906,
      "text": " But then he says the Holy Spirit of God, he brings that finger and just goes right at it"
    },
    {
      "id": 31,
      "start": 1940.3800354003906,
      "end": 1945.300033569336,
      "text": " for kings and for all that are in authority."
    },
    {
      "id": 32,
      "start": 1945.300033569336,
      "end": 1948.300033569336,
      "text": " Think about the original recipients of this book."
    },
    {
      "id": 33,
      "start": 1948.300033569336,
      "end": 1954.5000305175781,
      "text": " Under heavy persecution, under the man Nero, the Roman emperor."
    },
    {
      "id": 34,
      "start": 1954.5000305175781,
      "end": 1963.8200378417969,
      "text": " And Paul says, under the inspiration of the Holy Spirit of God, you want me to pray for him?"
    },
    {
      "id": 35,
      "start": 1963.8200378417969,
      "end": 1968.9000396728516,
      "text": " I think I would have thought that."
    },
    {
      "id": 36,
      "start": 1968.9000396728516,
      "end": 1971.300033569336,
      "text": " We need to pray for the leaders."
    },
    {
      "id": 37,
      "start": 1971.300033569336,
      "end": 1975.3800354003906,
      "text": " This morning, as I examine my own life, I mentioned already I've acknowledged my sin."
    },
    {
      "id": 38,
      "start": 1975.3800354003906,
      "end": 1977.2200317382812,
      "text": " I've asked God to help me with that."
    },
    {
      "id": 39,
      "start": 1977.2200317382812,
      "end": 1983.4600372314453,
      "text": " Far too often, we struggle to pray for those that are in leadership."
    },
    {
      "id": 40,
      "start": 1983.4600372314453,
      "end": 1988.9800415039062,
      "text": " I would say this this morning, many, and I would not put anybody on the spot,"
    },
    {
      "id": 41,
      "start": 1988.9800415039062,
      "end": 1991.9000396728516,
      "text": " but I would say that many, even within this crowd this morning,"
    },
    {
      "id": 42,
      "start": 1991.9000396728516,
      "end": 1998.6200408935547,
      "text": " could not name, by name, the elected officials that represent our district."
    },
    {
      "id": 43,
      "start": 1998.6200408935547,
      "end": 2000.060043334961,
      "text": " You know what that means to me?"
    },
    {
      "id": 44,
      "start": 2000.060043334961,
      "end": 2003.1000366210938,
      "text": " You're not praying for them."
    },
    {
      "id": 45,
      "start": 2003.1000366210938,
      "end": 2007.3800354003906,
      "text": " If you can't name them, you're not praying for them."
    },
    {
      "id": 46,
      "start": 2007.3800354003906,
      "end": 2010.4200439453125,
      "text": " You say, Pastor, that's a bold statement."
    },
    {
      "id": 47,
      "start": 2010.4200439453125,
      "end": 2013.6200408935547,
      "text": " Tell me it's not true."
    },
    {
      "id": 48,
      "start": 2013.6200408935547,
      "end": 2016.2200317382812,
      "text": " Because I just prayed, God bless all of them."
    },
    {
      "id": 49,
      "start": 2016.2200317382812,
      "end": 2018.9400329589844,
      "text": " Give me a break."
    },
    {
      "id": 50,
      "start": 2018.9400329589844,
      "end": 2021.8600311279297,
      "text": " That's shallow praying."
    },
    {
      "id": 51,
      "start": 2021.8600311279297,
      "end": 2025.9800415039062,
      "text": " It really is."
    },
    {
      "id": 52,
      "start": 2025.9800415039062,
      "end": 2033.020034790039,
      "text": " If we can't name them, we're not praying for them."
    },
    {
      "id": 53,
      "start": 2033.020034790039,
      "end": 2035.020034790039,
      "text": " I think there are three actions that we need to take,"
    },
    {
      "id": 54,
      "start": 2035.020034790039,
      "end": 2041.3800354003906,
      "text": " three things that I want to leave you with this morning."
    },
    {
      "id": 55,
      "start": 2041.3800354003906,
      "end": 2043.9800415039062,
      "text": " He says in 1 Timothy 2 and verse 1,"
    },
    {
      "id": 56,
      "start": 2043.9800415039062,
      "end": 2047.780029296875,
      "text": " I exhort therefore that first of all supplications, prayers, intercessions,"
    },
    {
      "id": 57,
      "start": 2047.780029296875,
      "end": 2050.340042114258,
      "text": " and giving of thanks be made for all men,"
    },
    {
      "id": 58,
      "start": 2050.340042114258,
      "end": 2054.1800384521484,
      "text": " for kings, and for all that are in authority,"
    },
    {
      "id": 59,
      "start": 2054.1800384521484,
      "end": 2058.300048828125,
      "text": " that we may lead a quiet and peaceable life in all godliness and honesty,"
    },
    {
      "id": 60,
      "start": 2058.300048828125,
      "end": 2064.1800231933594,
      "text": " for this is good and acceptable in the sight of God our Savior."
    },
    {
      "id": 61,
      "start": 2064.1800231933594,
      "end": 2070.6200256347656,
      "text": " Number one this morning, we must acknowledge that God is sovereign."
    },
    {
      "id": 62,
      "start": 2070.6200256347656,
      "end": 2073.020050048828,
      "text": " We must acknowledge that God is sovereign."
    },
    {
      "id": 63,
      "start": 2073.020050048828,
      "end": 2078.4600219726562,
      "text": " And as our sovereign Heavenly Father, He knows all things,"
    },
    {
      "id": 64,
      "start": 2078.4600219726562,
      "end": 2081.580047607422,
      "text": " He's able to do all things, and He's able to work."
    },
    {
      "id": 65,
      "start": 2081.580047607422,
      "end": 2087.6200256347656,
      "text": " And remember, the heart of the king is in the hand of the Lord."
    },
    {
      "id": 66,
      "start": 2087.6200256347656,
      "end": 2093.060028076172,
      "text": " He, God, as the rivers of water, He turneth it withersoever He will."
    },
    {
      "id": 67,
      "start": 2093.060028076172,
      "end": 2097.5400390625,
      "text": " We must acknowledge that He is sovereign."
    },
    {
      "id": 68,
      "start": 2097.5400390625,
      "end": 2101.8600463867188,
      "text": " When we understand that this morning, it will transform our prayer lives,"
    },
    {
      "id": 69,
      "start": 2101.8600463867188,
      "end": 2105.6600341796875,
      "text": " because we're praying to a God who is able."
    },
    {
      "id": 70,
      "start": 2105.6600341796875,
      "end": 2112.5400390625,
      "text": " Number two this morning, we must accept the instruction that's given to us here."
    },
    {
      "id": 71,
      "start": 2112.5400390625,
      "end": 2114.6600341796875,
      "text": " We must accept this instruction."
    },
    {
      "id": 72,
      "start": 2114.6600341796875,
      "end": 2117.5400390625,
      "text": " Lord, this is for me."
    },
    {
      "id": 73,
      "start": 2117.5400390625,
      "end": 2121.6600341796875,
      "text": " You said that you gave us your word, and we're to be doers of the word and not hearers only."
    },
    {
      "id": 74,
      "start": 2121.6600341796875,
      "end": 2126.6200256347656,
      "text": " And we accept this instruction to be God's word and to be true."
    },
    {
      "id": 75,
      "start": 2126.6200256347656,
      "end": 2130.5400390625,
      "text": " And then I would say this, we must analyze our prayer lives."
    },
    {
      "id": 76,
      "start": 2130.5400390625,
      "end": 2135.1000366210938,
      "text": " We must analyze our prayer lives."
    },
    {
      "id": 77,
      "start": 2135.1000366210938,
      "end": 2139.8600463867188,
      "text": " Especially this morning with regard to how the Holy Spirit specifically deals with the"
    },
    {
      "id": 78,
      "start": 2139.8600463867188,
      "end": 2142.500030517578,
      "text": " subject of praying for leaders."
    },
    {
      "id": 79,
      "start": 2142.500030517578,
      "end": 2144.5400390625,
      "text": " We must analyze."
    },
    {
      "id": 80,
      "start": 2144.5400390625,
      "end": 2146.6600341796875,
      "text": " We must get along with God."
    },
    {
      "id": 81,
      "start": 2146.6600341796875,
      "end": 2149.820037841797,
      "text": " We might need to visit an altar."
    },
    {
      "id": 82,
      "start": 2149.820037841797,
      "end": 2153.4200439453125,
      "text": " We might, God, how am I doing in this area?"
    },
    {
      "id": 83,
      "start": 2153.4200439453125,
      "end": 2155.2200317382812,
      "text": " How am I doing?"
    },
    {
      "id": 84,
      "start": 2155.2200317382812,
      "end": 2159.7000427246094,
      "text": " Can I encourage you this morning to be honest with God?"
    },
    {
      "id": 85,
      "start": 2159.7000427246094,
      "end": 2162.1400451660156,
      "text": " Because God knows how you're doing."
    },
    {
      "id": 86,
      "start": 2162.1400451660156,
      "end": 2165.9800415039062,
      "text": " God knew how I was doing."
    },
    {
      "id": 87,
      "start": 2165.9800415039062,
      "end": 2169.1400451660156,
      "text": " And God's ready to pardon and ready to forgive."
    },
    {
      "id": 88,
      "start": 2169.1400451660156,
      "end": 2171.8600463867188,
      "text": " See sometimes we say, look at what's going on in our nation."
    },
    {
      "id": 89,
      "start": 2171.8600463867188,
      "end": 2172.8600463867188,
      "text": " It's all a mess."
    },
    {
      "id": 90,
      "start": 2172.8600463867188,
      "end": 2175.260040283203,
      "text": " When's the last time you prayed for the leaders?"
    },
    {
      "id": 91,
      "start": 2175.260040283203,
      "end": 2179.4200439453125,
      "text": " When's the last time we prayed for them?"
    },
    {
      "id": 92,
      "start": 2179.4200439453125,
      "end": 2181.4600219726562,
      "text": " I mean fervently."
    },
    {
      "id": 93,
      "start": 2181.4600219726562,
      "end": 2186.2200317382812,
      "text": " The effectual fervent prayer of a righteous man availeth much."
    },
    {
      "id": 94,
      "start": 2186.2200317382812,
      "end": 2193.1800231933594,
      "text": " When's the last time we got on our knees for our president and prayed that that man"
    },
    {
      "id": 95,
      "start": 2193.1800231933594,
      "end": 2194.1800231933594,
      "text": " would be saved?"
    },
    {
      "id": 96,
      "start": 2194.1800231933594,
      "end": 2197.1400451660156,
      "text": " Or our vice president, that she would be saved?"
    },
    {
      "id": 97,
      "start": 2197.1400451660156,
      "end": 2200.1000366210938,
      "text": " You say, I don't like them."
    },
    {
      "id": 98,
      "start": 2200.1000366210938,
      "end": 2201.1000366210938,
      "text": " Stop."
    },
    {
      "id": 99,
      "start": 2201.1000366210938,
      "end": 2202.1000366210938,
      "text": " Stop."
    },
    {
      "id": 100,
      "start": 2202.1000366210938,
      "end": 2203.1000366210938,
      "text": " Don't justify."
    },
    {
      "id": 101,
      "start": 2203.1000366210938,
      "end": 2209.4200439453125,
      "text": " It's a matter of obedience."
    },
    {
      "id": 102,
      "start": 2209.4200439453125,
      "end": 2214.020050048828,
      "text": " And it pleases God."
    },
    {
      "id": 103,
      "start": 2214.020050048828,
      "end": 2217.020050048828,
      "text": " And He's sovereign and He's able."
    },
    {
      "id": 104,
      "start": 2217.020050048828,
      "end": 2222.300048828125,
      "text": " Purposefully this morning I'm stopping early because I think God needs to, let me say it"
    },
    {
      "id": 105,
      "start": 2222.300048828125,
      "end": 2226.8600463867188,
      "text": " this way, I think God's people need to respond to God."
    },
    {
      "id": 106,
      "start": 2226.8600463867188,
      "end": 2227.8600463867188,
      "text": " I just really believe that."
    },
    {
      "id": 107,
      "start": 2227.8600463867188,
      "end": 2234.820037841797,
      "text": " And so we're going to have a little longer invitation this morning as God leads."
    },
    {
      "id": 108,
      "start": 2234.820037841797,
      "end": 2241.300048828125,
      "text": " I'm not going to belabor it just to belabor it, but I want to do business with God."
    },
    {
      "id": 109,
      "start": 2241.300048828125,
      "end": 2248.300048828125,
      "text": " The reality this morning is that this is not the kind of message I like preaching."
    },
    {
      "id": 110,
      "start": 2248.300048828125,
      "end": 2255.300048828125,
      "text": " Man, I like preaching messages that are just, let's go after it, let's get it, man, God."
    },
    {
      "id": 111,
      "start": 2255.300048828125,
      "end": 2256.300048828125,
      "text": " This is a tough one."
    },
    {
      "id": 112,
      "start": 2256.300048828125,
      "end": 2257.300048828125,
      "text": " Why?"
    },
    {
      "id": 113,
      "start": 2257.300048828125,
      "end": 2262.020050048828,
      "text": " Because it steps on my toes and I know it steps on your toes."
    },
    {
      "id": 114,
      "start": 2262.020050048828,
      "end": 2263.7400512695312,
      "text": " But how do we respond?"
    },
    {
      "id": 115,
      "start": 2263.7400512695312,
      "end": 2271.3400268554688,
      "text": " So often as I pray, I pray that God would help us to receive His Word and then that"
    },
    {
      "id": 116,
      "start": 2271.3400268554688,
      "end": 2275.1400451660156,
      "text": " we would respond to His Word."
    },
    {
      "id": 117,
      "start": 2275.1400451660156,
      "end": 2279.580047607422,
      "text": " Never do I try to be emotional and twist people's arms in invitations."
    },
    {
      "id": 118,
      "start": 2279.580047607422,
      "end": 2280.580047607422,
      "text": " I don't do that."
    },
    {
      "id": 119,
      "start": 2280.580047607422,
      "end": 2281.580047607422,
      "text": " You know that."
    },
    {
      "id": 120,
      "start": 2281.580047607422,
      "end": 2285.300048828125,
      "text": " But I really believe we need to do some business with God today."
    },
    {
      "id": 121,
      "start": 2285.300048828125,
      "end": 2286.300048828125,
      "text": " Let's pray together."
    },
    {
      "id": 122,
      "start": 2286.300048828125,
      "end": 2288.2400512695312,
      "text": " Father, we love You."
    },
    {
      "id": 123,
      "start": 2288.2400512695312,
      "end": 2292.1000366210938,
      "text": " We thank You for loving us."
    },
    {
      "id": 124,
      "start": 2292.1000366210938,
      "end": 2297.3400268554688,
      "text": " I thank You that it's Your will that all men would be saved."
    },
    {
      "id": 125,
      "start": 2297.3400268554688,
      "end": 2299.3800354003906,
      "text": " We thank You that You hear and answer prayer."
    },
    {
      "id": 126,
      "start": 2299.3800354003906,
      "end": 2306.820037841797,
      "text": " God, You've told us plainly that the instruction to pray for leaders is clear."
    },
    {
      "id": 127,
      "start": 2306.820037841797,
      "end": 2317.2200317382812,
      "text": " There's nothing confusing for kings and for all that are in authority."
    },
    {
      "id": 128,
      "start": 2318.2200317382812,
      "end": 2329.3400268554688,
      "text": " God, I believe this morning that the failure of Your people to pray is common."
    },
    {
      "id": 129,
      "start": 2329.3400268554688,
      "end": 2341.8200073242188,
      "text": " It's on the list, no doubt, of the most impactful sins of this generation is a disregard of"
    },
    {
      "id": 130,
      "start": 2341.8200073242188,
      "end": 2346.2200317382812,
      "text": " Your people to pray as You've instructed us to do so."
    },
    {
      "id": 131,
      "start": 2346.2200317382812,
      "end": 2352.300048828125,
      "text": " God, I pray that in these moments of invitation, You would do a work in our hearts and lives."
    },
    {
      "id": 132,
      "start": 2352.300048828125,
      "end": 2359.6600341796875,
      "text": " God, that we would confess and get right and that we'd develop a plan to pray for our"
    },
    {
      "id": 133,
      "start": 2359.6600341796875,
      "end": 2366.3400268554688,
      "text": " leaders that You might give us peace as a result."
    },
    {
      "id": 134,
      "start": 2366.3400268554688,
      "end": 2370.5400390625,
      "text": " Criticizing them and complaining about them has never brought me peace."
    },
    {
      "id": 135,
      "start": 2371.5400390625,
      "end": 2380.6200561523438,
      "text": " But as we pray and leave it with You, we can have a peace that passes all understanding."
    },
    {
      "id": 136,
      "start": 2380.6200561523438,
      "end": 2388.8200073242188,
      "text": " I pray that You would save those elected officials that are lost."
    },
    {
      "id": 137,
      "start": 2388.8200073242188,
      "end": 2394.1800537109375,
      "text": " I pray, God, that You would strengthen and give courage to those elected officials that"
    },
    {
      "id": 138,
      "start": 2394.1800537109375,
      "end": 2396.1400146484375,
      "text": " are saved."
    },
    {
      "id": 139,
      "start": 2396.1400146484375,
      "end": 2401.06005859375,
      "text": " I pray that You'd move and work as only You can in these moments of invitation, which"
    },
    {
      "id": 140,
      "start": 2401.06005859375,
      "end": 2402.1400146484375,
      "text": " in Christ's name we pray."
    },
    {
      "id": 0,
      "start": 2402.1400146484375,
      "end": 2402.9400146603584,
      "text": " Would you stand with?"
    }
  ],
  "processed_at": "2025-04-15T09:04:45.648356"
}