{
  "video_id": "LtegeF3nWJo",
  "text": "and we started a series in the book of Titus back at the beginning of this year, and we made it through the ninth lesson, which was beginning Titus chapter number two in March. And then of course, COVID came and we canceled our Sunday school services and so on and so forth. And so now with having Sunday morning service, Sunday evening service, Wednesday evening service, we were able to rearrange things and have our Sunday school classes meeting on Wednesday evening. And so that's what we're doing with the young people. And so I figured that it would be appropriate for me to go back to our series through the study of the book of Titus. When we got to Titus chapter number two in verse number one, the Bible says, but speak thou the things which become sound doctrine. Now we understand that Titus had been given responsibility. According to verse number five, it says of chapter number one, for this cause left I thee in Crete, that thou should have set in order the things that are wanting and ordain elders in every city as I've appointed thee. He goes through the qualifications notice in verse number nine of chapter number one, he says, holding fast the faithful word as he has been taught that he may be able notice by sound doctrine, both to exhort and to convince the gainsayers. And so we see that there's some references in verse number 13. It says this witness is true, wherefore rebuke them sharply that they may be sound in the faith. And so when we think about sound doctrine, we think the importance of doctrine. I actually read recently where there was a pastor that was asked this question. I guess it was actually a number of pastors that were asked this question. And the question that they were asked was what role should the senior pastor, the lead pastor, what role should he play in selecting the songs for the song service? And I thought it was a simple enough question that was asked to these senior pastors and they were giving their answers. And this one particular man replied, and he said, well, you have to understand that in our culture today and in our churches today, the songs that we sing are more important than the doctrine that we teach. What? That's a problem. Amen? Because doctrine is absolutely imperative and we must be sound in the faith. Now I'm thankful to have the hymnal that we have and to sing the great hymns of the faith that reinforce Bible teaching and Bible truth. But we must understand that there is an emphasis that is placed in the Word of God with regard to doctrine. There are many today that would have the attitude that doctrine really doesn't matter. No doctrine does matter. It matters to God. It's important. And so we think about the subject matter of sound doctrine. We then took this dive from Titus 2 and verse number 1 to dive into doctrinal truth. And so the first doctrine that we began to deal with and study was the doctrine of bibliology, the study of the Scriptures. And we had two lessons back in March on that particular doctrine. And in those lessons we dealt with the subject matter of inspiration of the Scripture. We dealt with the subject matter of preservation of the Scripture. And we also dealt with the subject matter of the sufficiency of the Scripture. I'm thankful that all Scripture is given by inspiration of God. I'm thankful that He promised to preserve it. And I'm thankful that the Word of God is sufficient. And so we dealt with those subject matters in the first couple of studies on bibliology. And so this evening, as we continue with the subject matter of bibliology, I want to address the subject matter of translation and how that impacts Bible versions. And the Bible, of course, as you know, maybe all of you know, maybe not everyone knows, but the Bible was originally written in Hebrew, Aramaic, and Greek. And so it was not written in English originally. And we know that this evening I am teaching and preaching from an English Bible. And so therefore, there was a work of translation that was done. Very obvious stated fact there. When we think about the translation, though, and the work of translation, we'd have to acknowledge that it is a very critical work. And today, if you were to go online and you were to look for a Bible, or if you were to be able to go to a Bible bookstore and look for a Bible, you will find that there are scores of English versions of the Bible. There are multitudes of Bible versions that are available. And we begin to think about that subject matter, we begin to think about these various versions that are available on the market today. And when we speak about Bible versions, we must recognize that from the very beginning of human history, the enemy has attacked the Word of God. God spoke to Adam and gave Adam instruction, and we find in Genesis chapter number three and verse number one that Satan comes in his subtlety and he says, Yea, hath God said. In verse number four, he says not only does he question what God said, but then he questions the authority of what God said and actually calls God a liar by saying, Ye shall not surely die in Genesis three and verse number four. But God had said in the day that ye eat thereof, you shall surely die. And so as we begin to think about the attack upon the Word of God from the beginning of human history, we must be cautious and acknowledge the potential for corruption through the work of translation. In other words, we begin to think about the work of translation, we think about the process in which the Scriptures are translated, we have to be aware that corruption can find its way in through that work of translation. And so we have to be very careful of that, we have to be very cautious of that. So this evening, obviously, if you've been around the church for any length of time, if you've read any of our doctrinal statement, we are unashamed to be King James Bible is what we use, it's what I preach from, it's what I study from, I don't have a multitude of different versions in my office, I use the King James Bible, it's what we use, and I'm thankful for the work that God has done through the men, of course, that God used over the years. So this evening I want to look at some things with regard to the work of translation, how it impacts the Bible version discussion. If you're taking notes this evening, I want you to think about it kind of in a process of how the work took place, how does this work, what do they do, what was the process that they followed. And so first of all, if you're taking notes, I want you to consider with me the text. The text is of significant importance. When I talk about the text, I'm talking about what was the Hebrew and Greek text that was utilized that the translators would use in order to come up with a translation. The fact of the matter is that if you begin with a wrong text, it does not matter how qualified you are to do the work of translation, you're going to end up with a bad product. Why? Because you started with the wrong text. If you start with a corrupt text, you could be the most scholarly person on the face of the earth to do the work of translation, but you have a corrupt text that you start with, you're never going to end up with a good product. And so therefore it's important that we understand the foundation of Bible translation has to be the text that is utilized for that translation. We think about the King James Bible, and of course it's the Bible that we use, I've mentioned that already. But I want you to think about what Paul said. Let me look at this verse in 2 Corinthians chapter number 2, and then let me deal with the text issue. But in 2 Corinthians, the Apostle Paul is writing back to the church at Corinth and he makes a very interesting statement here with regard to those that would corrupt the Word of God. And so we understand, I've already expressed the fact that Satan has attacked the Word of God from the start of human history, but Paul says this in 2 Corinthians 2 in verse 17, \"'For we are not as many,' notice, \"'which corrupt the Word of God, but as of sincerity, but as of God, in the sight of God, speak we in Christ.'\" And so we acknowledge this evening that there are some that would corrupt the Word of God. And so we begin to think about the text, and so for the King James Bible, the Old Testament is not really that big of a discussion point when it comes to Bible translations. Most Bible translations that you would look to, they would use the traditional Masoretic Hebrew text. The King James Bible uses the traditional Masoretic Hebrew text. The discussion point is very heavily leaning on the New Testament side, and we'll deal with that in just a moment. But the traditional Masoretic Hebrew text is a text that was passed down through the Masorites, which were traditionalists. They guarded the Old Testament text and they passed it down from one generation to the next. And it would often be referred to as the authoritative Hebrew text. And we find that that's the text that underlies the King James Bible. For the New Testament, and the greater majority of the discussion point with regard to the text issue, we would look at the Greek for the New Testament, and that being the TR, or the Textus Receptus. The Textus Receptus, often referred to as well as the traditional received text, has been a text that has been accepted through the history of the Christian church and has passed from one generation to the next. It's very interesting when we begin to talk about the Greek New Testament and the New Testament text, because you'll find that there are a number of manuscripts that still exist. And a number of the manuscripts that exist, in fact, there are a little over 5,200 of those texts that still exist. exists have been preserved today and you would find that the Textus Receptus, that 99% of those preserved manuscripts point to the Textus Receptus. Only 1% of them point to the other Greek text that underlined the modern translations. So we begin to look at the foundation, the text that is used, and has it been corrupted? Has it not been corrupted? Is it a good text, is it a bad text? Most of the modern translations, and of course I mentioned that the Hebrew text is not the one that is most actively discussed and really dealt with, however, there is a corrupt Hebrew text as well. It's the Biblia Horatia, and that is a text that is based on the Leningrad manuscript and it's used for some of the modern translations, though the traditional Masoretic Hebrew text is definitely more popular. But it's interesting that in the notes that they'll use is the BHK or the BHS, those are the abbreviations for the Biblia Horatia, and it's interesting because in the footnotes of the text, they suggest 20,000 to 30,000 alterations to the Old Testament. That's a lot of alterations, 20,000 to 30,000 in the footnotes of that Hebrew text. They say it should say this or this isn't commonly accepted, so on and so forth. But I want to deal with the New Testament. The New Testament, the Greek New Testament that underlies many, many of the modern translations today is the Nestle and Allen Greek New Testament. The Nestle and Allen Greek New Testament, it's in its 28th edition. The Westcott and Hort Greek New Testament was used as a foundational tool in developing the Nestle and Allen text. It's interesting because as we get into our next point, this will make more sense as we deal with it in its entirety, but the Allen of Nestle and Allen, he had some really, really difficulty in accepting the inspiration and inerrancy of Scripture. And so you think about that just for a moment. If he's one of the leading authors of the Greek New Testament text and he doesn't believe in the inerrancy and the inspiration of the New Testament, that's problematic. How is that work of translation going to work if he's already questioning the authority, the inerrancy, the inspiration of the very text that he's beginning to work with? And so we find that there's that Nestle and Allen text, there's a lot of information that they receive from Vaticanus and Sinaticus, and they refer to those as B and Aleph are the way in which they refer to those. And here's a careful point of consideration. Those texts were widely rejected due to corruption. In fact, the Vaticanus and the Sinaticus, just in the Gospels, Matthew, Mark, Luke and John, there are 3,000 contradictions just in the first four books of the New Testament between those two texts. 3,000. That's a lot. And what we find is that some will give you this kind of line of thinking is that, well, those texts are older and therefore they're better. But older doesn't always mean better, right? And so they think that because it's older that it's better. Also, they will say that some of them are more preserved than some of the other texts that we have. Well, yeah, they're more preserved because people didn't use them. Because they rejected them. Because they said, no, that's a corrupt text and they rejected them. And we would understand that as you read the New Testament and you read about the warnings from Paul and you read about the warnings from Peter, there were false teachers right away in the first century. So what would they do? In fact, if you look at the book of 1 and 2 Thessalonians, those two books, and really in 2 Thessalonians, you find that Paul is writing to the church at Thessalonica for a second time and he's helping them to understand that somebody had sent a letter under his name to them and caused them all kinds of confusion with regard to doctrinal matters. And so Paul is seeking to set those things straight in dealing with the canon of Scripture, the inspiration of Scripture, and we find that that is a known practice in the first century early on with these corrupt, false teachers that were sending forth false letters. And so we have to be careful that we understand and begin to deal with the work of translation and how that goes into the Bible version discussion is that we have to have the right text. After we have the right text, we have to think about the translators. So who is going to be the individuals? Who are the individuals going to be that will work on the translation of the Scriptures? I would ask the question this way, are they qualified? And by the way, the qualification is not only on whether or not they know the languages. You can know the language and be lost. And if you're lost, you probably aren't the right candidate to be translating God's Holy Word. Amen? And so when you think about the translators, I want you to think about what, of course, some of these individuals, and I'll read to you a few statements that some of the translators for the King James Bible, some of the things that they said. And we understand as we look at the translators, there were 57 men that were commissioned to work on the translation of the King James Bible. They were divided into six groups. The work started in 1604 and ended in 1611. These men were all trained in the original languages of the Scriptures. Not only were they trained in the original languages of the Scriptures, but many of them were also very conversant with various cognate languages, or sister languages, such as Arabic, Persian, Syrian, and Coptic. And so these men were very qualified from a perspective of their language understanding. But more importantly than their language abilities, they understood and believed that the Bible is the Word of God. They not only believed that the Bible is the Word of God, but they understood that it has power to change lives, and they believed that it needed to be available to the common man so that it could be read and obeyed. Now that's a good perspective of a translator that is going to be qualified for the work, that's going to take the right text. They're going to take the traditional Masoretic text for the Hebrew, they're going to take the Textus Receptus for the New Testament, the Greek, and they're going to then take that right text and they have the right qualified translators. Here's some of what they said. They said this, that the original, speaking of the Word of God, thereof being from heaven, not from earth. The author being God, not man. The inditer, the Holy Spirit, not the wit of apostles or prophets. So that was the Word of God. They go on to say that the Scriptures, in the Scriptures, we are commanded to search the Scriptures. They that search the Scriptures and study the Scriptures were commended for doing so. They were reproved that were unskillful in them or slow to believe them. They then said this, take up and read, take up and read the Scriptures. Indeed, without translation into the generally used tongue, that the common people are but like children at Jacob's well without a bucket or something to draw with. A blessed thing it is and will bring us to everlasting blessedness in the end when God speaketh unto us and we hearken, we obey. And so they had this perspective that when they were going to approach the Scriptures to translate from Hebrew and Greek into English, they understood we have to have the right text, but they also understood that what they were dealing with was the Word of God. By the way, translation is not interpretation. The work of translation is to simply translate what God has said, not to interpret it, not to slant it toward your own beliefs or your own desires. You can do some study and you can see some ways in which, as I mentioned some of the things a moment ago about Nestle and Allen and some of his perspectives and his difficulty with accepting the canon of Scripture and the inerrancy and the inspiration of Scripture. You can look at some of the things of Westcott and Hort, where in many regards they were very apostate in some of the foundational doctrinal things and they just wanted to remove certain things. You are tampering with the Word of God and that's a very dangerous thing. So we find that these individuals, these 57 men that are the translators for the King James Bible, that they were commissioned to do this work, they had this proper perspective so they were going to then translate the work. I want you to think about the technique. Turn over to 1 Corinthians chapter number 14, if you will, and before I share with you this evening the technique that they employed, I want you to think about this verse in 1 Corinthians 14 and verse number 40 where God says this, let all things be done decently and in order. And that's a good verse of Scripture. that's applicable in a number of different places in our lives and in our ministries. But we understand that even when they were going to take the approach and the technique that they would employ, the methods that they would use for translation, that it was a very orderly process that they followed. We'd find that each group, I mentioned that there were 57 men that were divided into six groups, that each group was assigned a portion of Scripture. The individuals within that group, they had to translate by themselves the portion that was assigned to them. And so whatever portion was assigned to them, they had the responsibility to translate that themselves. And then the group would assemble to confer and agree on the product. So think about the amount of work that this is taking and think about the number of reviews that this process is going through. We find that after they would finish in their particular group and the portion of Scripture that they were given, that product was then sent to the other five groups for review. And so we reviewed our portion, we did all of our translation, we did all of our work, I did it personally, and then I shared it with each of the individuals in my group and we conferred and we said, yes, this is the product that we want to send forth. We send it to the other five groups and then they go through it and they say, yes, this is done appropriately. And so they review it. And then there was a final review group that was assembled that consisted of two individuals from each of those groups and they made one final review of the entire Bible. Why do I go through that process? Because that would reveal to us as they employed this technique or these methods in translation, that each portion of Scripture was reviewed at a minimum of 14 times. 14 times. That's pretty significant. And you can understand that as they took that approach, as they went through the process and the technique that they employed, they wanted to do this live because they understood what they were handling. They understood the significance of it. They understood that this was the Word of God and they wanted to get it into the common language of the common man so that they could have the Bible for themselves. We find that not only did they follow that process, but when they would take and begin to translate the Scriptures, that they would use a term that we would use to describe their work was literal equivalence. What does it mean? Well, literal equivalence can be broken down into two fragments, if you will. One is verbal equivalence and then the other is formal equivalence. And what we mean by that is in verbal equivalence that every word in the original was translated. Formal equivalence means that the part of speech remained consistent. Now, this evening, if you believe as we have taught and we looked at when we dealt with our first study of bibliology in the verbal plenary inspiration of Scripture, then it would be necessary and expected that you would use literal equivalence for the work of translation. Because you believe that every word of God is inspired, and so therefore if you're going to translate it, you translate every word. See, the opposite of literal equivalence is really what is practiced by a host of those modern English versions of the Bible that you see on the market today, and they use not that of literal equivalence, but that of dynamic equivalence. We think about dynamic equivalence in these modern translations and the translators and what they do, and this is from their own people. They say this, that they're not really concerned about the individual words. Their concern is more with the thoughts, ideas, or message of the text. Now, I have a problem with that. Why? Because the Bible says that every word of God is pure, and so I'm concerned about the very words of God. I'm concerned that every word is translated, that I'm not just given this, well, here's kind of what I think God was trying to say in this passage of Scripture, and giving me a big thought or a big idea. No, I want to know what the words are, and so let's take a look at some of these verses of Scripture. Turn to the book of Psalms, if you will, in Psalm chapter number 12. It's a passage that we're familiar with, and we've often referenced Psalm 12, dealing with the subject matter of preservation, and I'm thankful that God said that He would preserve His Word, that He would keep them forever, and what a blessing it is. We know that Psalm 119, the passage of Scripture that deals with the Bible, talks much about the words of God and that it's forever settled in heaven, but in Psalm 12 and verses 6 and 7, the Bible says this, the words of the Lord are pure words, as silver tried in a furnace of earth, purified seven times. Thou shalt keep them, O Lord, thou shalt preserve them from this generation forever. Proverbs chapter number 30, in verse number 5, in Proverbs 30, in verse number 5, notice what it said here, every word of God is pure. He is a shield unto them that put their trust in Him. It's not just the thoughts or the ideas, but it's the very words of God. By the way, Jesus said that not one jot or tittle would pass, right? And you begin to understand the importance of the words. He says that in Matthew 5 in verse number 18. I want you to look over at John 7, if you will. Let me give you an example, just real quick here, if I could, as to the importance of words, and every word of God being important. In John chapter number 7, there was a feast, the Feast of Tabernacles in Jerusalem, and of course there are many that were getting ready to go, and Jesus says in verse number 6, my time has not yet come, but your time is already ready. And of course, his brethren at that time, according to verse number 5, did not believe in him. And so they were going to go, and of course, there were several that knew that Jesus would be there. It was required, in fact, by Jewish males to attend these particular feasts during the time in Jerusalem. There were certain times of the calendar each year that they had the responsibility of doing that. But look at verse number 8 with me, if you will. Jesus says this, go ye up unto this feast. I go not up, what's the next word? Yet. That's just one word, right? But what if we remove that word? I go not up unto this feast, for my time is not yet full come. I go not up to the feast, unto this feast. So what is he saying? I'm not going. I go not up unto this feast, right? If we remove yet. Do you know that there are many modern translations that remove the word yet? In John 7 and verse number 8. It's just a three-letter word. It's a simple word. But guess what happens when he had said these words unto them, he abode still in Galilee, but when his brethren were gone up, then went he also up unto the feast in verse number 10. So if he said I'm not going, and then he went, that becomes problematic, does it not? Jesus said I go not up yet unto this feast. Just one simple example this evening of how important words are. Have you ever been taken out of context? Somebody's said something about you, or you said something, and they missed some of your words, and said, no, that's not exactly what I said. And you understand the importance of your words. God gave us his words, and he told us that his words are pure. By the way, he gave a grave warning in Revelation chapter number 22 with regard to tampering with the words of God. We find that God has given us exactly what he's given us. Every word of God is pure, and no one gave him a requirement for how many words he had to give us, and how many chapters, and so on and so forth. We find that in Revelation 22 and verse number 19, and if any man shall take away from the words of the book of this prophecy. So I want you to understand that when we begin to think about the the words of scripture, we begin to think about the process in which these men employed, the technique, the methods of translation for those that were translating the King James Bible, and understanding what they believed about the Bible, they had the text that was the right text, the traditional Masoretic text for the Hebrew, for the Old Testament, the TR for the New Testament for the Greek. We find that they end up with a product that is a superior product. It is God doing what God said he would do in preserving his word. But just for a moment, consider the thought of the Aland of Nestle and Alan with the Greek New Testament. Remember, he had concern about the inerrancy and the inspiration of scripture. He questioned many times. He wrote books. You can read some of the books that he wrote. They're still available. In fact, I read through some of it just recently, and you can read where he questions the canonicity of the scripture, and denying that certain books should be even included in the canon of scripture, and so on and so forth. And so if you wholesale, say, these books don't really belong in the Bible, and then you are writing a Greek New Testament, what then happens when you start removing words and you remove verses and you put, well, that's not really supposed to be there? It becomes very problematic. In Acts chapter number 8, another simple illustration for you this evening, and we'll end with this illustration. I'll make some concluding statements and get into our prayer time this evening, but in Acts chapter number 8, many of the modern translations will just completely skip a verse of Scripture here in this text. And I count 36, 37, 38, right? That's kind of a normal way to count. If you look in Acts 8 and verse number 36, at the end of the verse, the eunuch says to Philip, see here is water, what doth hinder me to be baptized? So that's Acts 8 36, so you would expect to see in Acts 8 37. And in Acts 8 37, it says that Philip responds to him, Philip said, if thou believest with all thine heart, thou mayest. And he answered and said, I believe that Jesus Christ is the Son of God. That's his profession. And then you see verse number 38, again 36, 37, 38, it says he commanded, Philip commanded the chariot to stand still, and they went down both in the water, both Philip and the eunuch, and he baptized him. Wouldn't it be kind of odd if you went from verse 36 to verse 38? Wouldn't you wonder where's 37? Right? So in some of the modern translations, not all of them, but in some of the modern translations, if you look at it, I did this specifically with the New International Version, I looked it up online, you see Acts 8 36, you see the text there, you see 37 and there's no words, and then you see 38 in the verse. It's completely omitted, you go down to the footnotes and it says this verse isn't commonly accepted in the manuscripts. How does that work? And my question is this, does that have any impact on doctrine? Sure it does. Here's water, what does it mean to be baptized? Oh, you want to get baptized? Let's get baptized. That's how it reads in some of the modern translations, because they remove verse number 37, that is, how do we baptize people? We say this, based upon your profession of faith, I now baptize you, right? That's what we say. Every time I baptize somebody, that's what I say. Hey, are you 100% sure if you were to die today that you'd go to heaven? Have you trusted Jesus Christ as your personal Savior? Yes, I have. That's their profession. I've already spoken to them before we ever got in the baptismal tank to understand that they are saved, because the candidate for baptism is a saved individual. And so if you remove verse number 37, here's what the people want to tell you today. Oh, it doesn't really change any doctrine. Of course it does. And this is just one simple illustration this evening. There's many that you could go to. The Bible tells us that there are going to be false teachers, just as there were false prophets. And we know that the enemy has sought to attack the Word of God from the very beginning of human history. As we claim the promises of God, as we examine the evidence of translation work, we conclude that God did in fact preserve His Word in the Masoretic Text, the traditional Masoretic Text for the Old Testament, the Textus Receptus for the New Testament, and those are the underlying texts for the King James Bible. I don't speak Hebrew, and I don't speak Greek. I know a few words in both. I know how to look them up and find out what they mean, and I learned how to say some of them, but I would never consider myself a Hebrew or Greek scholar. I'm thankful that I have an English Bible, and I'm thankful for how God used individuals over 400 years ago now to do that work of translation. Individuals that believed about the Bible the same things that we believe about the Bible. It's God's Word. It's necessary to be made available to the people in their language, so that they can read it, so that they can obey it, so they can be blessed by it. And these men, over 400 years ago, God used to do that work of translation, and I would submit to you this evening that they used the right text. That they used, or as the translators, they had the right perspective, and then they used the right techniques. And through having the right text, having the right people, and using the right techniques, you end up with a superior product. And I'm so thankful that God has given us His Word. There's so many more things that could be said on the discussion of the Bible translations. There are volumes of books that have been written on this topic, and so I've tried to kind of simmer it all down and give you one service this evening on the subject matter, but of course there is much that could be discussed on it, and I trust there's been a blessing to you. Let's go to the Lord in prayer. Father, we love you. We thank you for loving us. Thank you for your Word and the truth contained therein. We thank you that we have the Bible, and I pray God that you would help us to be students of thy Word. Help us to be doers of the Word. Lord, help us to appreciate those that have gone before us that have faithfully and diligently followed you and obeyed you to allow us to have the Bible that we hold in our hands this evening. Help us to be engaged in the work of sharing your Word with those that we come into contact with. Bless our time of prayer. We'll thank you for it. In Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.659999847412109,
      "text": " and we started a series in the book of Titus back at the beginning of this year, and we"
    },
    {
      "id": 1,
      "start": 6.659999847412109,
      "end": 13.140000343322754,
      "text": " made it through the ninth lesson, which was beginning Titus chapter number two in March."
    },
    {
      "id": 2,
      "start": 13.140000343322754,
      "end": 18.979999542236328,
      "text": " And then of course, COVID came and we canceled our Sunday school services and so on and so"
    },
    {
      "id": 3,
      "start": 18.979999542236328,
      "end": 19.979999542236328,
      "text": " forth."
    },
    {
      "id": 4,
      "start": 19.979999542236328,
      "end": 25.239999771118164,
      "text": " And so now with having Sunday morning service, Sunday evening service, Wednesday evening"
    },
    {
      "id": 5,
      "start": 25.239999771118164,
      "end": 33.2599983215332,
      "text": " service, we were able to rearrange things and have our Sunday school classes meeting"
    },
    {
      "id": 6,
      "start": 33.2599983215332,
      "end": 34.2599983215332,
      "text": " on Wednesday evening."
    },
    {
      "id": 7,
      "start": 34.2599983215332,
      "end": 35.97999954223633,
      "text": " And so that's what we're doing with the young people."
    },
    {
      "id": 8,
      "start": 35.97999954223633,
      "end": 40.939998626708984,
      "text": " And so I figured that it would be appropriate for me to go back to our series through the"
    },
    {
      "id": 9,
      "start": 40.939998626708984,
      "end": 42.099998474121094,
      "text": " study of the book of Titus."
    },
    {
      "id": 10,
      "start": 42.099998474121094,
      "end": 46.900001525878906,
      "text": " When we got to Titus chapter number two in verse number one, the Bible says, but speak"
    },
    {
      "id": 11,
      "start": 46.900001525878906,
      "end": 51.58000183105469,
      "text": " thou the things which become sound doctrine."
    },
    {
      "id": 12,
      "start": 51.58000183105469,
      "end": 56.2599983215332,
      "text": " Now we understand that Titus had been given responsibility."
    },
    {
      "id": 13,
      "start": 56.2599983215332,
      "end": 59.380001068115234,
      "text": " According to verse number five, it says of chapter number one, for this cause left I"
    },
    {
      "id": 14,
      "start": 59.380001068115234,
      "end": 63.2599983215332,
      "text": " thee in Crete, that thou should have set in order the things that are wanting and ordain"
    },
    {
      "id": 15,
      "start": 63.2599983215332,
      "end": 65.94000244140625,
      "text": " elders in every city as I've appointed thee."
    },
    {
      "id": 16,
      "start": 65.94000244140625,
      "end": 69.95999908447266,
      "text": " He goes through the qualifications notice in verse number nine of chapter number one,"
    },
    {
      "id": 17,
      "start": 69.95999908447266,
      "end": 75.5,
      "text": " he says, holding fast the faithful word as he has been taught that he may be able notice"
    },
    {
      "id": 18,
      "start": 75.5,
      "end": 81.12000274658203,
      "text": " by sound doctrine, both to exhort and to convince the gainsayers."
    },
    {
      "id": 19,
      "start": 81.16000366210938,
      "end": 84.55999755859375,
      "text": " And so we see that there's some references in verse number 13."
    },
    {
      "id": 20,
      "start": 84.55999755859375,
      "end": 90.0,
      "text": " It says this witness is true, wherefore rebuke them sharply that they may be sound in the"
    },
    {
      "id": 21,
      "start": 90.0,
      "end": 91.0,
      "text": " faith."
    },
    {
      "id": 22,
      "start": 91.0,
      "end": 93.80000305175781,
      "text": " And so when we think about sound doctrine, we think the importance of doctrine."
    },
    {
      "id": 23,
      "start": 93.80000305175781,
      "end": 98.36000061035156,
      "text": " I actually read recently where there was a pastor that was asked this question."
    },
    {
      "id": 24,
      "start": 98.36000061035156,
      "end": 101.9800033569336,
      "text": " I guess it was actually a number of pastors that were asked this question."
    },
    {
      "id": 25,
      "start": 101.9800033569336,
      "end": 106.16000366210938,
      "text": " And the question that they were asked was what role should the senior pastor, the lead"
    },
    {
      "id": 26,
      "start": 106.16000366210938,
      "end": 113.19999694824219,
      "text": " pastor, what role should he play in selecting the songs for the song service?"
    },
    {
      "id": 27,
      "start": 113.19999694824219,
      "end": 118.76000213623047,
      "text": " And I thought it was a simple enough question that was asked to these senior pastors and"
    },
    {
      "id": 28,
      "start": 118.76000213623047,
      "end": 120.44000244140625,
      "text": " they were giving their answers."
    },
    {
      "id": 29,
      "start": 120.44000244140625,
      "end": 126.16000366210938,
      "text": " And this one particular man replied, and he said, well, you have to understand that in"
    },
    {
      "id": 30,
      "start": 126.16000366210938,
      "end": 132.47999572753906,
      "text": " our culture today and in our churches today, the songs that we sing are more important"
    },
    {
      "id": 31,
      "start": 132.47999572753906,
      "end": 135.16000366210938,
      "text": " than the doctrine that we teach."
    },
    {
      "id": 32,
      "start": 135.67999267578125,
      "end": 136.67999267578125,
      "text": " What?"
    },
    {
      "id": 33,
      "start": 136.67999267578125,
      "end": 138.67999267578125,
      "text": " That's a problem."
    },
    {
      "id": 34,
      "start": 138.67999267578125,
      "end": 139.67999267578125,
      "text": " Amen?"
    },
    {
      "id": 35,
      "start": 139.67999267578125,
      "end": 146.24000549316406,
      "text": " Because doctrine is absolutely imperative and we must be sound in the faith."
    },
    {
      "id": 36,
      "start": 146.24000549316406,
      "end": 152.0,
      "text": " Now I'm thankful to have the hymnal that we have and to sing the great hymns of the faith"
    },
    {
      "id": 37,
      "start": 152.0,
      "end": 156.67999267578125,
      "text": " that reinforce Bible teaching and Bible truth."
    },
    {
      "id": 38,
      "start": 156.67999267578125,
      "end": 162.36000061035156,
      "text": " But we must understand that there is an emphasis that is placed in the Word of God with regard"
    },
    {
      "id": 39,
      "start": 162.36000061035156,
      "end": 163.8000030517578,
      "text": " to doctrine."
    },
    {
      "id": 40,
      "start": 163.8000030517578,
      "end": 169.27999877929688,
      "text": " There are many today that would have the attitude that doctrine really doesn't matter."
    },
    {
      "id": 41,
      "start": 169.27999877929688,
      "end": 170.55999755859375,
      "text": " No doctrine does matter."
    },
    {
      "id": 42,
      "start": 170.55999755859375,
      "end": 171.60000610351562,
      "text": " It matters to God."
    },
    {
      "id": 43,
      "start": 171.60000610351562,
      "end": 172.60000610351562,
      "text": " It's important."
    },
    {
      "id": 44,
      "start": 172.60000610351562,
      "end": 175.0,
      "text": " And so we think about the subject matter of sound doctrine."
    },
    {
      "id": 45,
      "start": 175.0,
      "end": 181.5,
      "text": " We then took this dive from Titus 2 and verse number 1 to dive into doctrinal truth."
    },
    {
      "id": 46,
      "start": 181.5,
      "end": 186.72000122070312,
      "text": " And so the first doctrine that we began to deal with and study was the doctrine of bibliology,"
    },
    {
      "id": 47,
      "start": 186.72000122070312,
      "end": 188.0,
      "text": " the study of the Scriptures."
    },
    {
      "id": 48,
      "start": 188.0,
      "end": 192.0800018310547,
      "text": " And we had two lessons back in March on that particular doctrine."
    },
    {
      "id": 49,
      "start": 192.0800018310547,
      "end": 196.82000732421875,
      "text": " And in those lessons we dealt with the subject matter of inspiration of the Scripture."
    },
    {
      "id": 50,
      "start": 196.82000732421875,
      "end": 200.0399932861328,
      "text": " We dealt with the subject matter of preservation of the Scripture."
    },
    {
      "id": 51,
      "start": 200.0399932861328,
      "end": 203.8000030517578,
      "text": " And we also dealt with the subject matter of the sufficiency of the Scripture."
    },
    {
      "id": 52,
      "start": 203.8000030517578,
      "end": 207.9600067138672,
      "text": " I'm thankful that all Scripture is given by inspiration of God."
    },
    {
      "id": 53,
      "start": 207.9600067138672,
      "end": 210.8000030517578,
      "text": " I'm thankful that He promised to preserve it."
    },
    {
      "id": 54,
      "start": 210.8000030517578,
      "end": 213.9600067138672,
      "text": " And I'm thankful that the Word of God is sufficient."
    },
    {
      "id": 55,
      "start": 213.9600067138672,
      "end": 217.9199981689453,
      "text": " And so we dealt with those subject matters in the first couple of studies on bibliology."
    },
    {
      "id": 56,
      "start": 217.9199981689453,
      "end": 222.16000366210938,
      "text": " And so this evening, as we continue with the subject matter of bibliology, I want to"
    },
    {
      "id": 57,
      "start": 222.16000366210938,
      "end": 230.16000366210938,
      "text": " address the subject matter of translation and how that impacts Bible versions."
    },
    {
      "id": 58,
      "start": 230.16000366210938,
      "end": 235.83999633789062,
      "text": " And the Bible, of course, as you know, maybe all of you know, maybe not everyone knows,"
    },
    {
      "id": 59,
      "start": 235.83999633789062,
      "end": 239.39999389648438,
      "text": " but the Bible was originally written in Hebrew, Aramaic, and Greek."
    },
    {
      "id": 60,
      "start": 239.39999389648438,
      "end": 242.9600067138672,
      "text": " And so it was not written in English originally."
    },
    {
      "id": 61,
      "start": 242.9600067138672,
      "end": 247.39999389648438,
      "text": " And we know that this evening I am teaching and preaching from an English Bible."
    },
    {
      "id": 62,
      "start": 247.8800048828125,
      "end": 252.0,
      "text": " And so therefore, there was a work of translation that was done."
    },
    {
      "id": 63,
      "start": 252.0,
      "end": 254.32000732421875,
      "text": " Very obvious stated fact there."
    },
    {
      "id": 64,
      "start": 254.32000732421875,
      "end": 258.20001220703125,
      "text": " When we think about the translation, though, and the work of translation, we'd have to"
    },
    {
      "id": 65,
      "start": 258.20001220703125,
      "end": 261.239990234375,
      "text": " acknowledge that it is a very critical work."
    },
    {
      "id": 66,
      "start": 261.239990234375,
      "end": 266.20001220703125,
      "text": " And today, if you were to go online and you were to look for a Bible, or if you were to"
    },
    {
      "id": 67,
      "start": 266.20001220703125,
      "end": 270.3999938964844,
      "text": " be able to go to a Bible bookstore and look for a Bible, you will find that there are"
    },
    {
      "id": 68,
      "start": 270.3999938964844,
      "end": 274.20001220703125,
      "text": " scores of English versions of the Bible."
    },
    {
      "id": 69,
      "start": 274.20001220703125,
      "end": 278.9599914550781,
      "text": " There are multitudes of Bible versions that are available."
    },
    {
      "id": 70,
      "start": 278.9599914550781,
      "end": 285.0,
      "text": " And we begin to think about that subject matter, we begin to think about these various versions"
    },
    {
      "id": 71,
      "start": 285.0,
      "end": 286.5199890136719,
      "text": " that are available on the market today."
    },
    {
      "id": 72,
      "start": 286.5199890136719,
      "end": 292.0400085449219,
      "text": " And when we speak about Bible versions, we must recognize that from the very beginning"
    },
    {
      "id": 73,
      "start": 292.0400085449219,
      "end": 298.0400085449219,
      "text": " of human history, the enemy has attacked the Word of God."
    },
    {
      "id": 74,
      "start": 298.0400085449219,
      "end": 303.0400085449219,
      "text": " God spoke to Adam and gave Adam instruction, and we find in Genesis chapter number three"
    },
    {
      "id": 75,
      "start": 303.239990234375,
      "end": 307.0400085449219,
      "text": " and verse number one that Satan comes in his subtlety and he says,"
    },
    {
      "id": 76,
      "start": 307.0400085449219,
      "end": 309.7200012207031,
      "text": " Yea, hath God said."
    },
    {
      "id": 77,
      "start": 309.7200012207031,
      "end": 314.5199890136719,
      "text": " In verse number four, he says not only does he question what God said, but then he questions"
    },
    {
      "id": 78,
      "start": 314.5199890136719,
      "end": 320.8399963378906,
      "text": " the authority of what God said and actually calls God a liar by saying, Ye shall not surely"
    },
    {
      "id": 79,
      "start": 320.8399963378906,
      "end": 323.55999755859375,
      "text": " die in Genesis three and verse number four."
    },
    {
      "id": 80,
      "start": 323.55999755859375,
      "end": 327.6000061035156,
      "text": " But God had said in the day that ye eat thereof, you shall surely die."
    },
    {
      "id": 81,
      "start": 327.6000061035156,
      "end": 330.8800048828125,
      "text": " And so as we begin to think about the attack upon the Word of God from the beginning of"
    },
    {
      "id": 82,
      "start": 330.8800048828125,
      "end": 338.0400085449219,
      "text": " human history, we must be cautious and acknowledge the potential for corruption through the work"
    },
    {
      "id": 83,
      "start": 338.0400085449219,
      "end": 339.0400085449219,
      "text": " of translation."
    },
    {
      "id": 84,
      "start": 339.0400085449219,
      "end": 344.55999755859375,
      "text": " In other words, we begin to think about the work of translation, we think about the process"
    },
    {
      "id": 85,
      "start": 344.55999755859375,
      "end": 351.0400085449219,
      "text": " in which the Scriptures are translated, we have to be aware that corruption can find"
    },
    {
      "id": 86,
      "start": 351.0400085449219,
      "end": 354.32000732421875,
      "text": " its way in through that work of translation."
    },
    {
      "id": 87,
      "start": 354.32000732421875,
      "end": 357.8399963378906,
      "text": " And so we have to be very careful of that, we have to be very cautious of that."
    },
    {
      "id": 88,
      "start": 357.8399963378906,
      "end": 361.9200134277344,
      "text": " So this evening, obviously, if you've been around the church for any length of time,"
    },
    {
      "id": 89,
      "start": 361.9200134277344,
      "end": 368.0,
      "text": " if you've read any of our doctrinal statement, we are unashamed to be King James Bible is"
    },
    {
      "id": 90,
      "start": 368.0,
      "end": 372.3599853515625,
      "text": " what we use, it's what I preach from, it's what I study from, I don't have a multitude"
    },
    {
      "id": 91,
      "start": 372.3599853515625,
      "end": 378.3599853515625,
      "text": " of different versions in my office, I use the King James Bible, it's what we use, and"
    },
    {
      "id": 92,
      "start": 378.3599853515625,
      "end": 384.4800109863281,
      "text": " I'm thankful for the work that God has done through the men, of course, that God used"
    },
    {
      "id": 93,
      "start": 384.4800109863281,
      "end": 385.4800109863281,
      "text": " over the years."
    },
    {
      "id": 94,
      "start": 385.4800109863281,
      "end": 388.9599914550781,
      "text": " So this evening I want to look at some things with regard to the work of translation, how"
    },
    {
      "id": 95,
      "start": 388.9599914550781,
      "end": 392.79998779296875,
      "text": " it impacts the Bible version discussion."
    },
    {
      "id": 96,
      "start": 392.79998779296875,
      "end": 398.3599853515625,
      "text": " If you're taking notes this evening, I want you to think about it kind of in a process"
    },
    {
      "id": 97,
      "start": 398.3599853515625,
      "end": 404.55999755859375,
      "text": " of how the work took place, how does this work, what do they do, what was the process"
    },
    {
      "id": 98,
      "start": 404.55999755859375,
      "end": 405.55999755859375,
      "text": " that they followed."
    },
    {
      "id": 99,
      "start": 405.55999755859375,
      "end": 409.3399963378906,
      "text": " And so first of all, if you're taking notes, I want you to consider with me the text."
    },
    {
      "id": 100,
      "start": 409.3399963378906,
      "end": 411.3999938964844,
      "text": " The text is of significant importance."
    },
    {
      "id": 101,
      "start": 411.8399963378906,
      "end": 416.7200012207031,
      "text": " When I talk about the text, I'm talking about what was the Hebrew and Greek text that was"
    },
    {
      "id": 102,
      "start": 416.7200012207031,
      "end": 423.9200134277344,
      "text": " utilized that the translators would use in order to come up with a translation."
    },
    {
      "id": 103,
      "start": 423.9200134277344,
      "end": 429.20001220703125,
      "text": " The fact of the matter is that if you begin with a wrong text, it does not matter how"
    },
    {
      "id": 104,
      "start": 429.20001220703125,
      "end": 435.6000061035156,
      "text": " qualified you are to do the work of translation, you're going to end up with a bad product."
    },
    {
      "id": 105,
      "start": 435.6000061035156,
      "end": 436.6000061035156,
      "text": " Why?"
    },
    {
      "id": 106,
      "start": 436.6000061035156,
      "end": 438.17999267578125,
      "text": " Because you started with the wrong text."
    },
    {
      "id": 107,
      "start": 438.17999267578125,
      "end": 445.70001220703125,
      "text": " If you start with a corrupt text, you could be the most scholarly person on the face of"
    },
    {
      "id": 108,
      "start": 445.70001220703125,
      "end": 450.17999267578125,
      "text": " the earth to do the work of translation, but you have a corrupt text that you start with,"
    },
    {
      "id": 109,
      "start": 450.17999267578125,
      "end": 453.260009765625,
      "text": " you're never going to end up with a good product."
    },
    {
      "id": 110,
      "start": 453.260009765625,
      "end": 458.6600036621094,
      "text": " And so therefore it's important that we understand the foundation of Bible translation has to"
    },
    {
      "id": 111,
      "start": 458.6600036621094,
      "end": 462.8599853515625,
      "text": " be the text that is utilized for that translation."
    },
    {
      "id": 112,
      "start": 462.8599853515625,
      "end": 466.6199951171875,
      "text": " We think about the King James Bible, and of course it's the Bible that we use, I've mentioned"
    },
    {
      "id": 113,
      "start": 466.6199951171875,
      "end": 467.6199951171875,
      "text": " that already."
    },
    {
      "id": 114,
      "start": 467.6199951171875,
      "end": 469.5400085449219,
      "text": " But I want you to think about what Paul said."
    },
    {
      "id": 115,
      "start": 469.5400085449219,
      "end": 474.260009765625,
      "text": " Let me look at this verse in 2 Corinthians chapter number 2, and then let me deal with"
    },
    {
      "id": 116,
      "start": 474.260009765625,
      "end": 475.3800048828125,
      "text": " the text issue."
    },
    {
      "id": 117,
      "start": 475.3800048828125,
      "end": 479.29998779296875,
      "text": " But in 2 Corinthians, the Apostle Paul is writing back to the church at Corinth and"
    },
    {
      "id": 118,
      "start": 479.29998779296875,
      "end": 484.7799987792969,
      "text": " he makes a very interesting statement here with regard to those that would corrupt the"
    },
    {
      "id": 119,
      "start": 484.7799987792969,
      "end": 485.94000244140625,
      "text": " Word of God."
    },
    {
      "id": 120,
      "start": 485.94000244140625,
      "end": 490.4200134277344,
      "text": " And so we understand, I've already expressed the fact that Satan has attacked the Word"
    },
    {
      "id": 121,
      "start": 490.4200134277344,
      "end": 494.739990234375,
      "text": " of God from the start of human history, but Paul says this in 2 Corinthians 2 in verse"
    },
    {
      "id": 122,
      "start": 494.739990234375,
      "end": 502.8999938964844,
      "text": " 17, \"'For we are not as many,' notice, \"'which corrupt the Word of God, but as of sincerity,"
    },
    {
      "id": 123,
      "start": 502.8999938964844,
      "end": 507.5799865722656,
      "text": " but as of God, in the sight of God, speak we in Christ.'\""
    },
    {
      "id": 124,
      "start": 507.5799865722656,
      "end": 513.219970703125,
      "text": " And so we acknowledge this evening that there are some that would corrupt the Word of God."
    },
    {
      "id": 125,
      "start": 513.219970703125,
      "end": 517.3400268554688,
      "text": " And so we begin to think about the text, and so for the King James Bible, the Old Testament"
    },
    {
      "id": 126,
      "start": 517.3400268554688,
      "end": 523.739990234375,
      "text": " is not really that big of a discussion point when it comes to Bible translations."
    },
    {
      "id": 127,
      "start": 523.739990234375,
      "end": 527.5,
      "text": " Most Bible translations that you would look to, they would use the traditional Masoretic"
    },
    {
      "id": 128,
      "start": 527.5,
      "end": 529.0599975585938,
      "text": " Hebrew text."
    },
    {
      "id": 129,
      "start": 529.0599975585938,
      "end": 533.219970703125,
      "text": " The King James Bible uses the traditional Masoretic Hebrew text."
    },
    {
      "id": 130,
      "start": 533.219970703125,
      "end": 537.4600219726562,
      "text": " The discussion point is very heavily leaning on the New Testament side, and we'll deal"
    },
    {
      "id": 131,
      "start": 537.4600219726562,
      "end": 538.8200073242188,
      "text": " with that in just a moment."
    },
    {
      "id": 132,
      "start": 538.8200073242188,
      "end": 543.0999755859375,
      "text": " But the traditional Masoretic Hebrew text is a text that was passed down through the"
    },
    {
      "id": 133,
      "start": 543.0999755859375,
      "end": 545.0800170898438,
      "text": " Masorites, which were traditionalists."
    },
    {
      "id": 134,
      "start": 545.0800170898438,
      "end": 549.3800048828125,
      "text": " They guarded the Old Testament text and they passed it down from one generation to the"
    },
    {
      "id": 135,
      "start": 549.3800048828125,
      "end": 550.3800048828125,
      "text": " next."
    },
    {
      "id": 136,
      "start": 550.3800048828125,
      "end": 555.739990234375,
      "text": " And it would often be referred to as the authoritative Hebrew text."
    },
    {
      "id": 137,
      "start": 555.739990234375,
      "end": 561.5,
      "text": " And we find that that's the text that underlies the King James Bible."
    },
    {
      "id": 138,
      "start": 561.5,
      "end": 566.8200073242188,
      "text": " For the New Testament, and the greater majority of the discussion point with regard to the"
    },
    {
      "id": 139,
      "start": 566.8200073242188,
      "end": 572.4199829101562,
      "text": " text issue, we would look at the Greek for the New Testament, and that being the TR,"
    },
    {
      "id": 140,
      "start": 572.4199829101562,
      "end": 574.5,
      "text": " or the Textus Receptus."
    },
    {
      "id": 141,
      "start": 574.5,
      "end": 579.6199951171875,
      "text": " The Textus Receptus, often referred to as well as the traditional received text, has"
    },
    {
      "id": 142,
      "start": 579.6199951171875,
      "end": 583.7000122070312,
      "text": " been a text that has been accepted through the history of the Christian church and has"
    },
    {
      "id": 143,
      "start": 583.7000122070312,
      "end": 586.1400146484375,
      "text": " passed from one generation to the next."
    },
    {
      "id": 144,
      "start": 586.1400146484375,
      "end": 589.7000122070312,
      "text": " It's very interesting when we begin to talk about the Greek New Testament and the New"
    },
    {
      "id": 145,
      "start": 589.7000122070312,
      "end": 593.97998046875,
      "text": " Testament text, because you'll find that there are a number of manuscripts that still exist."
    },
    {
      "id": 146,
      "start": 593.97998046875,
      "end": 598.9400024414062,
      "text": " And a number of the manuscripts that exist, in fact, there are a little over 5,200 of"
    },
    {
      "id": 147,
      "start": 598.9400024414062,
      "end": 600.0599975585938,
      "text": " those texts that still exist."
    },
    {
      "id": 0,
      "start": 600.0599975585938,
      "end": 607.6999974250793,
      "text": " exists have been preserved today and you would find that the Textus Receptus, that 99% of"
    },
    {
      "id": 1,
      "start": 607.6999974250793,
      "end": 612.8199977874756,
      "text": " those preserved manuscripts point to the Textus Receptus."
    },
    {
      "id": 2,
      "start": 612.8199977874756,
      "end": 619.5199966430664,
      "text": " Only 1% of them point to the other Greek text that underlined the modern translations."
    },
    {
      "id": 3,
      "start": 619.5199966430664,
      "end": 625.6599979400635,
      "text": " So we begin to look at the foundation, the text that is used, and has it been corrupted?"
    },
    {
      "id": 4,
      "start": 625.6599979400635,
      "end": 626.6599979400635,
      "text": " Has it not been corrupted?"
    },
    {
      "id": 5,
      "start": 626.6599979400635,
      "end": 629.2599983215332,
      "text": " Is it a good text, is it a bad text?"
    },
    {
      "id": 6,
      "start": 629.2599983215332,
      "end": 634.0999984741211,
      "text": " Most of the modern translations, and of course I mentioned that the Hebrew text is not the"
    },
    {
      "id": 7,
      "start": 634.0999984741211,
      "end": 641.2999992370605,
      "text": " one that is most actively discussed and really dealt with, however, there is a corrupt Hebrew"
    },
    {
      "id": 8,
      "start": 641.2999992370605,
      "end": 642.4599990844727,
      "text": " text as well."
    },
    {
      "id": 9,
      "start": 642.4599990844727,
      "end": 649.2199974060059,
      "text": " It's the Biblia Horatia, and that is a text that is based on the Leningrad manuscript"
    },
    {
      "id": 10,
      "start": 649.2199974060059,
      "end": 653.6999969482422,
      "text": " and it's used for some of the modern translations, though the traditional Masoretic Hebrew text"
    },
    {
      "id": 11,
      "start": 653.6999969482422,
      "end": 655.819995880127,
      "text": " is definitely more popular."
    },
    {
      "id": 12,
      "start": 655.819995880127,
      "end": 661.5799980163574,
      "text": " But it's interesting that in the notes that they'll use is the BHK or the BHS, those are"
    },
    {
      "id": 13,
      "start": 661.5799980163574,
      "end": 668.4599990844727,
      "text": " the abbreviations for the Biblia Horatia, and it's interesting because in the footnotes"
    },
    {
      "id": 14,
      "start": 668.4599990844727,
      "end": 675.4199981689453,
      "text": " of the text, they suggest 20,000 to 30,000 alterations to the Old Testament."
    },
    {
      "id": 15,
      "start": 675.4199981689453,
      "end": 682.6999969482422,
      "text": " That's a lot of alterations, 20,000 to 30,000 in the footnotes of that Hebrew text."
    },
    {
      "id": 16,
      "start": 682.6999969482422,
      "end": 687.8999938964844,
      "text": " They say it should say this or this isn't commonly accepted, so on and so forth."
    },
    {
      "id": 17,
      "start": 687.8999938964844,
      "end": 689.9399948120117,
      "text": " But I want to deal with the New Testament."
    },
    {
      "id": 18,
      "start": 689.9399948120117,
      "end": 696.6599960327148,
      "text": " The New Testament, the Greek New Testament that underlies many, many of the modern translations"
    },
    {
      "id": 19,
      "start": 696.6599960327148,
      "end": 700.6999969482422,
      "text": " today is the Nestle and Allen Greek New Testament."
    },
    {
      "id": 20,
      "start": 700.6999969482422,
      "end": 705.0599975585938,
      "text": " The Nestle and Allen Greek New Testament, it's in its 28th edition."
    },
    {
      "id": 21,
      "start": 705.0599975585938,
      "end": 711.5799942016602,
      "text": " The Westcott and Hort Greek New Testament was used as a foundational tool in developing"
    },
    {
      "id": 22,
      "start": 711.5799942016602,
      "end": 713.5,
      "text": " the Nestle and Allen text."
    },
    {
      "id": 23,
      "start": 713.5,
      "end": 718.6399993896484,
      "text": " It's interesting because as we get into our next point, this will make more sense as we"
    },
    {
      "id": 24,
      "start": 718.6399993896484,
      "end": 727.3399963378906,
      "text": " deal with it in its entirety, but the Allen of Nestle and Allen, he had some really, really"
    },
    {
      "id": 25,
      "start": 727.3399963378906,
      "end": 734.0999908447266,
      "text": " difficulty in accepting the inspiration and inerrancy of Scripture."
    },
    {
      "id": 26,
      "start": 734.0999908447266,
      "end": 735.8199920654297,
      "text": " And so you think about that just for a moment."
    },
    {
      "id": 27,
      "start": 735.8199920654297,
      "end": 743.6199951171875,
      "text": " If he's one of the leading authors of the Greek New Testament text and he doesn't believe"
    },
    {
      "id": 28,
      "start": 743.6199951171875,
      "end": 750.1999969482422,
      "text": " in the inerrancy and the inspiration of the New Testament, that's problematic."
    },
    {
      "id": 29,
      "start": 750.1999969482422,
      "end": 756.0599975585938,
      "text": " How is that work of translation going to work if he's already questioning the authority,"
    },
    {
      "id": 30,
      "start": 756.0599975585938,
      "end": 761.8399963378906,
      "text": " the inerrancy, the inspiration of the very text that he's beginning to work with?"
    },
    {
      "id": 31,
      "start": 761.8399963378906,
      "end": 767.5200042724609,
      "text": " And so we find that there's that Nestle and Allen text, there's a lot of information that"
    },
    {
      "id": 32,
      "start": 767.5200042724609,
      "end": 774.8399963378906,
      "text": " they receive from Vaticanus and Sinaticus, and they refer to those as B and Aleph are"
    },
    {
      "id": 33,
      "start": 774.8399963378906,
      "end": 776.9199981689453,
      "text": " the way in which they refer to those."
    },
    {
      "id": 34,
      "start": 776.9199981689453,
      "end": 780.7599945068359,
      "text": " And here's a careful point of consideration."
    },
    {
      "id": 35,
      "start": 780.7599945068359,
      "end": 786.7599945068359,
      "text": " Those texts were widely rejected due to corruption."
    },
    {
      "id": 36,
      "start": 786.7599945068359,
      "end": 792.0399932861328,
      "text": " In fact, the Vaticanus and the Sinaticus, just in the Gospels, Matthew, Mark, Luke and"
    },
    {
      "id": 37,
      "start": 792.0399932861328,
      "end": 799.0399932861328,
      "text": " John, there are 3,000 contradictions just in the first four books of the New Testament"
    },
    {
      "id": 38,
      "start": 799.0399932861328,
      "end": 800.3999938964844,
      "text": " between those two texts."
    },
    {
      "id": 39,
      "start": 800.3999938964844,
      "end": 801.3999938964844,
      "text": " 3,000."
    },
    {
      "id": 40,
      "start": 801.3999938964844,
      "end": 802.3999938964844,
      "text": " That's a lot."
    },
    {
      "id": 41,
      "start": 802.3999938964844,
      "end": 808.9599914550781,
      "text": " And what we find is that some will give you this kind of line of thinking is that, well,"
    },
    {
      "id": 42,
      "start": 808.9599914550781,
      "end": 813.8000030517578,
      "text": " those texts are older and therefore they're better."
    },
    {
      "id": 43,
      "start": 813.8399963378906,
      "end": 817.9599914550781,
      "text": " But older doesn't always mean better, right?"
    },
    {
      "id": 44,
      "start": 817.9599914550781,
      "end": 821.3199920654297,
      "text": " And so they think that because it's older that it's better."
    },
    {
      "id": 45,
      "start": 821.3199920654297,
      "end": 826.5599975585938,
      "text": " Also, they will say that some of them are more preserved than some of the other texts"
    },
    {
      "id": 46,
      "start": 826.5599975585938,
      "end": 827.5599975585938,
      "text": " that we have."
    },
    {
      "id": 47,
      "start": 827.5599975585938,
      "end": 830.0399932861328,
      "text": " Well, yeah, they're more preserved because people didn't use them."
    },
    {
      "id": 48,
      "start": 830.0399932861328,
      "end": 832.0,
      "text": " Because they rejected them."
    },
    {
      "id": 49,
      "start": 832.0,
      "end": 835.1799926757812,
      "text": " Because they said, no, that's a corrupt text and they rejected them."
    },
    {
      "id": 50,
      "start": 835.1799926757812,
      "end": 839.0399932861328,
      "text": " And we would understand that as you read the New Testament and you read about the warnings"
    },
    {
      "id": 51,
      "start": 839.0399932861328,
      "end": 843.4400024414062,
      "text": " from Paul and you read about the warnings from Peter, there were false teachers right"
    },
    {
      "id": 52,
      "start": 843.4400024414062,
      "end": 845.239990234375,
      "text": " away in the first century."
    },
    {
      "id": 53,
      "start": 845.239990234375,
      "end": 846.3199920654297,
      "text": " So what would they do?"
    },
    {
      "id": 54,
      "start": 846.3199920654297,
      "end": 850.2799987792969,
      "text": " In fact, if you look at the book of 1 and 2 Thessalonians, those two books, and really"
    },
    {
      "id": 55,
      "start": 850.2799987792969,
      "end": 855.2799987792969,
      "text": " in 2 Thessalonians, you find that Paul is writing to the church at Thessalonica for"
    },
    {
      "id": 56,
      "start": 855.2799987792969,
      "end": 860.9400024414062,
      "text": " a second time and he's helping them to understand that somebody had sent a letter under his"
    },
    {
      "id": 57,
      "start": 860.9400024414062,
      "end": 866.1600036621094,
      "text": " name to them and caused them all kinds of confusion with regard to doctrinal matters."
    },
    {
      "id": 58,
      "start": 866.2799987792969,
      "end": 871.0799865722656,
      "text": " And so Paul is seeking to set those things straight in dealing with the canon of Scripture,"
    },
    {
      "id": 59,
      "start": 871.0799865722656,
      "end": 878.9599914550781,
      "text": " the inspiration of Scripture, and we find that that is a known practice in the first"
    },
    {
      "id": 60,
      "start": 878.9599914550781,
      "end": 887.6000061035156,
      "text": " century early on with these corrupt, false teachers that were sending forth false letters."
    },
    {
      "id": 61,
      "start": 887.6000061035156,
      "end": 892.5199890136719,
      "text": " And so we have to be careful that we understand and begin to deal with the work of translation"
    },
    {
      "id": 62,
      "start": 892.5199890136719,
      "end": 898.760009765625,
      "text": " and how that goes into the Bible version discussion is that we have to have the right"
    },
    {
      "id": 63,
      "start": 898.760009765625,
      "end": 899.760009765625,
      "text": " text."
    },
    {
      "id": 64,
      "start": 899.760009765625,
      "end": 903.2999877929688,
      "text": " After we have the right text, we have to think about the translators."
    },
    {
      "id": 65,
      "start": 903.2999877929688,
      "end": 905.6799926757812,
      "text": " So who is going to be the individuals?"
    },
    {
      "id": 66,
      "start": 905.6799926757812,
      "end": 911.9599914550781,
      "text": " Who are the individuals going to be that will work on the translation of the Scriptures?"
    },
    {
      "id": 67,
      "start": 911.9599914550781,
      "end": 915.7200012207031,
      "text": " I would ask the question this way, are they qualified?"
    },
    {
      "id": 68,
      "start": 915.7200012207031,
      "end": 923.2799987792969,
      "text": " And by the way, the qualification is not only on whether or not they know the languages."
    },
    {
      "id": 69,
      "start": 923.2799987792969,
      "end": 926.8399963378906,
      "text": " You can know the language and be lost."
    },
    {
      "id": 70,
      "start": 926.8399963378906,
      "end": 931.6000061035156,
      "text": " And if you're lost, you probably aren't the right candidate to be translating God's"
    },
    {
      "id": 71,
      "start": 931.6000061035156,
      "end": 933.0,
      "text": " Holy Word."
    },
    {
      "id": 72,
      "start": 933.0,
      "end": 934.0,
      "text": " Amen?"
    },
    {
      "id": 73,
      "start": 934.0,
      "end": 939.8800048828125,
      "text": " And so when you think about the translators, I want you to think about what, of course,"
    },
    {
      "id": 74,
      "start": 939.8800048828125,
      "end": 944.7999877929688,
      "text": " some of these individuals, and I'll read to you a few statements that some of the translators"
    },
    {
      "id": 75,
      "start": 945.760009765625,
      "end": 948.8399963378906,
      "text": " for the King James Bible, some of the things that they said."
    },
    {
      "id": 76,
      "start": 948.8399963378906,
      "end": 953.6799926757812,
      "text": " And we understand as we look at the translators, there were 57 men that were commissioned to"
    },
    {
      "id": 77,
      "start": 953.6799926757812,
      "end": 956.8800048828125,
      "text": " work on the translation of the King James Bible."
    },
    {
      "id": 78,
      "start": 956.8800048828125,
      "end": 959.3599853515625,
      "text": " They were divided into six groups."
    },
    {
      "id": 79,
      "start": 959.3599853515625,
      "end": 963.3599853515625,
      "text": " The work started in 1604 and ended in 1611."
    },
    {
      "id": 80,
      "start": 963.3599853515625,
      "end": 967.2000122070312,
      "text": " These men were all trained in the original languages of the Scriptures."
    },
    {
      "id": 81,
      "start": 967.2000122070312,
      "end": 972.0,
      "text": " Not only were they trained in the original languages of the Scriptures, but many of them"
    },
    {
      "id": 82,
      "start": 972.0,
      "end": 978.3200073242188,
      "text": " were also very conversant with various cognate languages, or sister languages, such as Arabic,"
    },
    {
      "id": 83,
      "start": 978.3200073242188,
      "end": 980.3200073242188,
      "text": " Persian, Syrian, and Coptic."
    },
    {
      "id": 84,
      "start": 980.3200073242188,
      "end": 985.4400024414062,
      "text": " And so these men were very qualified from a perspective of their language understanding."
    },
    {
      "id": 85,
      "start": 985.4400024414062,
      "end": 991.9199829101562,
      "text": " But more importantly than their language abilities, they understood and believed that the Bible"
    },
    {
      "id": 86,
      "start": 991.9199829101562,
      "end": 994.4800109863281,
      "text": " is the Word of God."
    },
    {
      "id": 87,
      "start": 994.4800109863281,
      "end": 997.5199890136719,
      "text": " They not only believed that the Bible is the Word of God, but they understood that it has"
    },
    {
      "id": 88,
      "start": 997.6000061035156,
      "end": 1003.760009765625,
      "text": " power to change lives, and they believed that it needed to be available to the common man"
    },
    {
      "id": 89,
      "start": 1003.760009765625,
      "end": 1006.5599975585938,
      "text": " so that it could be read and obeyed."
    },
    {
      "id": 90,
      "start": 1006.5599975585938,
      "end": 1012.4800109863281,
      "text": " Now that's a good perspective of a translator that is going to be qualified for the work,"
    },
    {
      "id": 91,
      "start": 1012.4800109863281,
      "end": 1014.6399841308594,
      "text": " that's going to take the right text."
    },
    {
      "id": 92,
      "start": 1014.6399841308594,
      "end": 1018.4800109863281,
      "text": " They're going to take the traditional Masoretic text for the Hebrew, they're going to take"
    },
    {
      "id": 93,
      "start": 1018.4800109863281,
      "end": 1024.0,
      "text": " the Textus Receptus for the New Testament, the Greek, and they're going to then take"
    },
    {
      "id": 94,
      "start": 1024.0,
      "end": 1027.6799926757812,
      "text": " that right text and they have the right qualified translators."
    },
    {
      "id": 95,
      "start": 1027.6799926757812,
      "end": 1029.9199829101562,
      "text": " Here's some of what they said."
    },
    {
      "id": 96,
      "start": 1029.9199829101562,
      "end": 1035.8399963378906,
      "text": " They said this, that the original, speaking of the Word of God, thereof being from heaven,"
    },
    {
      "id": 97,
      "start": 1035.8399963378906,
      "end": 1036.8399963378906,
      "text": " not from earth."
    },
    {
      "id": 98,
      "start": 1036.8399963378906,
      "end": 1038.239990234375,
      "text": " The author being God, not man."
    },
    {
      "id": 99,
      "start": 1038.239990234375,
      "end": 1042.4800109863281,
      "text": " The inditer, the Holy Spirit, not the wit of apostles or prophets."
    },
    {
      "id": 100,
      "start": 1042.4800109863281,
      "end": 1045.0,
      "text": " So that was the Word of God."
    },
    {
      "id": 101,
      "start": 1045.0,
      "end": 1050.0400085449219,
      "text": " They go on to say that the Scriptures, in the Scriptures, we are commanded to search"
    },
    {
      "id": 102,
      "start": 1050.0400085449219,
      "end": 1051.5199890136719,
      "text": " the Scriptures."
    },
    {
      "id": 103,
      "start": 1051.5199890136719,
      "end": 1056.9599914550781,
      "text": " They that search the Scriptures and study the Scriptures were commended for doing so."
    },
    {
      "id": 104,
      "start": 1056.9599914550781,
      "end": 1061.6399841308594,
      "text": " They were reproved that were unskillful in them or slow to believe them."
    },
    {
      "id": 105,
      "start": 1061.6399841308594,
      "end": 1067.6799926757812,
      "text": " They then said this, take up and read, take up and read the Scriptures."
    },
    {
      "id": 106,
      "start": 1067.6799926757812,
      "end": 1074.7200012207031,
      "text": " Indeed, without translation into the generally used tongue, that the common people are but"
    },
    {
      "id": 107,
      "start": 1074.7200012207031,
      "end": 1081.4400024414062,
      "text": " like children at Jacob's well without a bucket or something to draw with."
    },
    {
      "id": 108,
      "start": 1081.4400024414062,
      "end": 1086.0799865722656,
      "text": " A blessed thing it is and will bring us to everlasting blessedness in the end when God"
    },
    {
      "id": 109,
      "start": 1086.0799865722656,
      "end": 1090.9199829101562,
      "text": " speaketh unto us and we hearken, we obey."
    },
    {
      "id": 110,
      "start": 1090.9199829101562,
      "end": 1096.0799865722656,
      "text": " And so they had this perspective that when they were going to approach the Scriptures"
    },
    {
      "id": 111,
      "start": 1096.0799865722656,
      "end": 1103.1199951171875,
      "text": " to translate from Hebrew and Greek into English, they understood we have to have the right"
    },
    {
      "id": 112,
      "start": 1103.1199951171875,
      "end": 1109.0,
      "text": " text, but they also understood that what they were dealing with was the Word of God."
    },
    {
      "id": 113,
      "start": 1109.0,
      "end": 1114.9600219726562,
      "text": " By the way, translation is not interpretation."
    },
    {
      "id": 114,
      "start": 1114.9600219726562,
      "end": 1123.0399780273438,
      "text": " The work of translation is to simply translate what God has said, not to interpret it, not"
    },
    {
      "id": 115,
      "start": 1123.0399780273438,
      "end": 1127.719970703125,
      "text": " to slant it toward your own beliefs or your own desires."
    },
    {
      "id": 116,
      "start": 1127.719970703125,
      "end": 1131.5599975585938,
      "text": " You can do some study and you can see some ways in which, as I mentioned some of the"
    },
    {
      "id": 117,
      "start": 1131.5599975585938,
      "end": 1137.47998046875,
      "text": " things a moment ago about Nestle and Allen and some of his perspectives and his difficulty"
    },
    {
      "id": 118,
      "start": 1137.47998046875,
      "end": 1142.4400024414062,
      "text": " with accepting the canon of Scripture and the inerrancy and the inspiration of Scripture."
    },
    {
      "id": 119,
      "start": 1142.4400024414062,
      "end": 1147.1199951171875,
      "text": " You can look at some of the things of Westcott and Hort, where in many regards they were"
    },
    {
      "id": 120,
      "start": 1147.1199951171875,
      "end": 1152.9600219726562,
      "text": " very apostate in some of the foundational doctrinal things and they just wanted to remove"
    },
    {
      "id": 121,
      "start": 1152.9600219726562,
      "end": 1156.5599975585938,
      "text": " certain things."
    },
    {
      "id": 122,
      "start": 1156.5599975585938,
      "end": 1160.719970703125,
      "text": " You are tampering with the Word of God and that's a very dangerous thing."
    },
    {
      "id": 123,
      "start": 1160.8800048828125,
      "end": 1165.7999877929688,
      "text": " So we find that these individuals, these 57 men that are the translators for the King"
    },
    {
      "id": 124,
      "start": 1165.7999877929688,
      "end": 1170.8400268554688,
      "text": " James Bible, that they were commissioned to do this work, they had this proper perspective"
    },
    {
      "id": 125,
      "start": 1170.8400268554688,
      "end": 1173.9600219726562,
      "text": " so they were going to then translate the work."
    },
    {
      "id": 126,
      "start": 1173.9600219726562,
      "end": 1176.0399780273438,
      "text": " I want you to think about the technique."
    },
    {
      "id": 127,
      "start": 1176.0399780273438,
      "end": 1183.760009765625,
      "text": " Turn over to 1 Corinthians chapter number 14, if you will, and before I share with you"
    },
    {
      "id": 128,
      "start": 1183.760009765625,
      "end": 1188.47998046875,
      "text": " this evening the technique that they employed, I want you to think about this verse in 1"
    },
    {
      "id": 129,
      "start": 1188.47998046875,
      "end": 1196.52001953125,
      "text": " Corinthians 14 and verse number 40 where God says this, let all things be done decently"
    },
    {
      "id": 130,
      "start": 1196.52001953125,
      "end": 1198.6400146484375,
      "text": " and in order."
    },
    {
      "id": 131,
      "start": 1198.6400146484375,
      "end": 1200.1199951171875,
      "text": " And that's a good verse of Scripture."
    },
    {
      "id": 0,
      "start": 1200.1199951171875,
      "end": 1206.2799949645996,
      "text": " that's applicable in a number of different places in our lives and in our ministries."
    },
    {
      "id": 1,
      "start": 1206.2799949645996,
      "end": 1210.9199953079224,
      "text": " But we understand that even when they were going to take the approach and the technique"
    },
    {
      "id": 2,
      "start": 1210.9199953079224,
      "end": 1215.1599950790405,
      "text": " that they would employ, the methods that they would use for translation, that it was a very"
    },
    {
      "id": 3,
      "start": 1215.1599950790405,
      "end": 1221.319995880127,
      "text": " orderly process that they followed. We'd find that each group, I mentioned that there were 57"
    },
    {
      "id": 4,
      "start": 1221.319995880127,
      "end": 1226.2799949645996,
      "text": " men that were divided into six groups, that each group was assigned a portion of Scripture."
    },
    {
      "id": 5,
      "start": 1226.839994430542,
      "end": 1233.9599952697754,
      "text": " The individuals within that group, they had to translate by themselves the portion that was"
    },
    {
      "id": 6,
      "start": 1233.9599952697754,
      "end": 1238.5999946594238,
      "text": " assigned to them. And so whatever portion was assigned to them, they had the responsibility"
    },
    {
      "id": 7,
      "start": 1238.5999946594238,
      "end": 1245.479995727539,
      "text": " to translate that themselves. And then the group would assemble to confer and agree on the product."
    },
    {
      "id": 8,
      "start": 1246.1199951171875,
      "end": 1250.6799964904785,
      "text": " So think about the amount of work that this is taking and think about the number of reviews"
    },
    {
      "id": 9,
      "start": 1250.6799964904785,
      "end": 1256.9999961853027,
      "text": " that this process is going through. We find that after they would finish in their particular group"
    },
    {
      "id": 10,
      "start": 1256.9999961853027,
      "end": 1262.3599967956543,
      "text": " and the portion of Scripture that they were given, that product was then sent to the other"
    },
    {
      "id": 11,
      "start": 1262.3599967956543,
      "end": 1268.1999969482422,
      "text": " five groups for review. And so we reviewed our portion, we did all of our translation,"
    },
    {
      "id": 12,
      "start": 1268.1999969482422,
      "end": 1272.2799987792969,
      "text": " we did all of our work, I did it personally, and then I shared it with each of the individuals in"
    },
    {
      "id": 13,
      "start": 1272.2799987792969,
      "end": 1277.0799942016602,
      "text": " my group and we conferred and we said, yes, this is the product that we want to send forth."
    },
    {
      "id": 14,
      "start": 1277.0799942016602,
      "end": 1281.7999954223633,
      "text": " We send it to the other five groups and then they go through it and they say, yes, this is"
    },
    {
      "id": 15,
      "start": 1281.7999954223633,
      "end": 1288.2799987792969,
      "text": " done appropriately. And so they review it. And then there was a final review group that was"
    },
    {
      "id": 16,
      "start": 1288.2799987792969,
      "end": 1294.359992980957,
      "text": " assembled that consisted of two individuals from each of those groups and they made one final"
    },
    {
      "id": 17,
      "start": 1294.359992980957,
      "end": 1300.6799926757812,
      "text": " review of the entire Bible. Why do I go through that process? Because that would reveal to us as"
    },
    {
      "id": 18,
      "start": 1300.6799926757812,
      "end": 1308.599998474121,
      "text": " they employed this technique or these methods in translation, that each portion of Scripture"
    },
    {
      "id": 19,
      "start": 1308.599998474121,
      "end": 1317.3199920654297,
      "text": " was reviewed at a minimum of 14 times. 14 times. That's pretty significant. And you can understand"
    },
    {
      "id": 20,
      "start": 1317.3199920654297,
      "end": 1322.599998474121,
      "text": " that as they took that approach, as they went through the process and the technique that they"
    },
    {
      "id": 21,
      "start": 1322.599998474121,
      "end": 1326.9999923706055,
      "text": " employed, they wanted to do this live because they understood what they were handling. They"
    },
    {
      "id": 22,
      "start": 1326.9999923706055,
      "end": 1331.239990234375,
      "text": " understood the significance of it. They understood that this was the Word of God and they wanted to"
    },
    {
      "id": 23,
      "start": 1331.239990234375,
      "end": 1339.0,
      "text": " get it into the common language of the common man so that they could have the Bible for themselves."
    },
    {
      "id": 24,
      "start": 1340.1999969482422,
      "end": 1345.1599884033203,
      "text": " We find that not only did they follow that process, but when they would take and begin to"
    },
    {
      "id": 25,
      "start": 1346.2799987792969,
      "end": 1352.9199981689453,
      "text": " translate the Scriptures, that they would use a term that we would use to describe their work"
    },
    {
      "id": 26,
      "start": 1353.0,
      "end": 1359.3199920654297,
      "text": " was literal equivalence. What does it mean? Well, literal equivalence can be broken down into two"
    },
    {
      "id": 27,
      "start": 1359.3199920654297,
      "end": 1364.1999969482422,
      "text": " fragments, if you will. One is verbal equivalence and then the other is formal equivalence."
    },
    {
      "id": 28,
      "start": 1364.759994506836,
      "end": 1371.0800018310547,
      "text": " And what we mean by that is in verbal equivalence that every word in the original was translated."
    },
    {
      "id": 29,
      "start": 1372.9199981689453,
      "end": 1379.239990234375,
      "text": " Formal equivalence means that the part of speech remained consistent. Now,"
    },
    {
      "id": 30,
      "start": 1380.1199951171875,
      "end": 1386.8399963378906,
      "text": " this evening, if you believe as we have taught and we looked at when we dealt with our first study"
    },
    {
      "id": 31,
      "start": 1387.5599975585938,
      "end": 1396.1199951171875,
      "text": " of bibliology in the verbal plenary inspiration of Scripture, then it would be necessary and expected"
    },
    {
      "id": 32,
      "start": 1396.1199951171875,
      "end": 1401.1599884033203,
      "text": " that you would use literal equivalence for the work of translation. Because you believe that"
    },
    {
      "id": 33,
      "start": 1401.1599884033203,
      "end": 1407.6399993896484,
      "text": " every word of God is inspired, and so therefore if you're going to translate it, you translate"
    },
    {
      "id": 34,
      "start": 1408.5199890136719,
      "end": 1416.4400024414062,
      "text": " every word. See, the opposite of literal equivalence is really what is practiced by a"
    },
    {
      "id": 35,
      "start": 1416.4400024414062,
      "end": 1422.1199951171875,
      "text": " host of those modern English versions of the Bible that you see on the market today,"
    },
    {
      "id": 36,
      "start": 1422.1199951171875,
      "end": 1429.3999938964844,
      "text": " and they use not that of literal equivalence, but that of dynamic equivalence. We think about"
    },
    {
      "id": 37,
      "start": 1429.3999938964844,
      "end": 1434.6799926757812,
      "text": " dynamic equivalence in these modern translations and the translators and what they do, and this"
    },
    {
      "id": 38,
      "start": 1434.6799926757812,
      "end": 1442.0399932861328,
      "text": " is from their own people. They say this, that they're not really concerned about the individual"
    },
    {
      "id": 39,
      "start": 1442.0399932861328,
      "end": 1451.239990234375,
      "text": " words. Their concern is more with the thoughts, ideas, or message of the text. Now, I have a"
    },
    {
      "id": 40,
      "start": 1451.239990234375,
      "end": 1459.47998046875,
      "text": " problem with that. Why? Because the Bible says that every word of God is pure, and so I'm concerned"
    },
    {
      "id": 41,
      "start": 1459.47998046875,
      "end": 1465.7200012207031,
      "text": " about the very words of God. I'm concerned that every word is translated, that I'm not just given"
    },
    {
      "id": 42,
      "start": 1465.7200012207031,
      "end": 1471.0,
      "text": " this, well, here's kind of what I think God was trying to say in this passage of Scripture,"
    },
    {
      "id": 43,
      "start": 1471.5599975585938,
      "end": 1475.7999877929688,
      "text": " and giving me a big thought or a big idea. No, I want to know what the words are,"
    },
    {
      "id": 44,
      "start": 1475.7999877929688,
      "end": 1481.47998046875,
      "text": " and so let's take a look at some of these verses of Scripture. Turn to the book of Psalms, if you"
    },
    {
      "id": 45,
      "start": 1481.47998046875,
      "end": 1487.8800048828125,
      "text": " will, in Psalm chapter number 12. It's a passage that we're familiar with, and we've often referenced"
    },
    {
      "id": 46,
      "start": 1487.8800048828125,
      "end": 1493.0799865722656,
      "text": " Psalm 12, dealing with the subject matter of preservation, and I'm thankful that God said that"
    },
    {
      "id": 47,
      "start": 1493.0799865722656,
      "end": 1498.8399963378906,
      "text": " He would preserve His Word, that He would keep them forever, and what a blessing it is. We know"
    },
    {
      "id": 48,
      "start": 1498.8399963378906,
      "end": 1504.5199890136719,
      "text": " that Psalm 119, the passage of Scripture that deals with the Bible, talks much about the words of God"
    },
    {
      "id": 49,
      "start": 1504.5199890136719,
      "end": 1510.1199951171875,
      "text": " and that it's forever settled in heaven, but in Psalm 12 and verses 6 and 7, the Bible says this,"
    },
    {
      "id": 50,
      "start": 1510.760009765625,
      "end": 1519.9599914550781,
      "text": " the words of the Lord are pure words, as silver tried in a furnace of earth, purified seven times."
    },
    {
      "id": 51,
      "start": 1520.6799926757812,
      "end": 1528.1199951171875,
      "text": " Thou shalt keep them, O Lord, thou shalt preserve them from this generation forever."
    },
    {
      "id": 52,
      "start": 1529.3200073242188,
      "end": 1533.1600036621094,
      "text": " Proverbs chapter number 30, in verse number 5,"
    },
    {
      "id": 53,
      "start": 1533.1600036621094,
      "end": 1546.2799987792969,
      "text": " in Proverbs 30, in verse number 5, notice what it said here, every word of God is pure."
    },
    {
      "id": 54,
      "start": 1548.2799987792969,
      "end": 1555.239990234375,
      "text": " He is a shield unto them that put their trust in Him. It's not just the thoughts or the ideas,"
    },
    {
      "id": 55,
      "start": 1555.239990234375,
      "end": 1560.5199890136719,
      "text": " but it's the very words of God. By the way, Jesus said that not one jot or tittle would pass, right?"
    },
    {
      "id": 56,
      "start": 1560.5199890136719,
      "end": 1565.8800048828125,
      "text": " And you begin to understand the importance of the words. He says that in Matthew 5 in verse number"
    },
    {
      "id": 57,
      "start": 1565.8800048828125,
      "end": 1570.4400024414062,
      "text": " 18. I want you to look over at John 7, if you will. Let me give you an example, just real quick"
    },
    {
      "id": 58,
      "start": 1570.4400024414062,
      "end": 1578.1199951171875,
      "text": " here, if I could, as to the importance of words, and every word of God being important. In John"
    },
    {
      "id": 59,
      "start": 1578.1199951171875,
      "end": 1582.6799926757812,
      "text": " chapter number 7, there was a feast, the Feast of Tabernacles in Jerusalem, and of course there"
    },
    {
      "id": 60,
      "start": 1582.6799926757812,
      "end": 1588.6799926757812,
      "text": " are many that were getting ready to go, and Jesus says in verse number 6, my time has not yet come,"
    },
    {
      "id": 61,
      "start": 1588.6799926757812,
      "end": 1592.6799926757812,
      "text": " but your time is already ready. And of course, his brethren at that time, according to verse"
    },
    {
      "id": 62,
      "start": 1592.6799926757812,
      "end": 1596.6799926757812,
      "text": " number 5, did not believe in him. And so they were going to go, and of course, there were several"
    },
    {
      "id": 63,
      "start": 1596.6799926757812,
      "end": 1602.1199951171875,
      "text": " that knew that Jesus would be there. It was required, in fact, by Jewish males to attend"
    },
    {
      "id": 64,
      "start": 1602.1199951171875,
      "end": 1608.760009765625,
      "text": " these particular feasts during the time in Jerusalem. There were certain times of the"
    },
    {
      "id": 65,
      "start": 1608.760009765625,
      "end": 1613.0,
      "text": " calendar each year that they had the responsibility of doing that. But look at verse number 8 with me,"
    },
    {
      "id": 66,
      "start": 1613.0,
      "end": 1621.3200073242188,
      "text": " if you will. Jesus says this, go ye up unto this feast. I go not up, what's the next word?"
    },
    {
      "id": 67,
      "start": 1622.760009765625,
      "end": 1629.7999877929688,
      "text": " Yet. That's just one word, right? But what if we remove that word? I go not up unto this feast,"
    },
    {
      "id": 68,
      "start": 1629.7999877929688,
      "end": 1637.7999877929688,
      "text": " for my time is not yet full come. I go not up to the feast, unto this feast. So what is he saying?"
    },
    {
      "id": 69,
      "start": 1637.7999877929688,
      "end": 1643.8800048828125,
      "text": " I'm not going. I go not up unto this feast, right? If we remove yet. Do you know that there are many"
    },
    {
      "id": 70,
      "start": 1643.8800048828125,
      "end": 1650.6000061035156,
      "text": " modern translations that remove the word yet? In John 7 and verse number 8. It's just a three-letter"
    },
    {
      "id": 71,
      "start": 1650.6000061035156,
      "end": 1656.760009765625,
      "text": " word. It's a simple word. But guess what happens when he had said these words unto them, he abode"
    },
    {
      "id": 72,
      "start": 1656.760009765625,
      "end": 1661.6399841308594,
      "text": " still in Galilee, but when his brethren were gone up, then went he also up unto the feast in verse"
    },
    {
      "id": 73,
      "start": 1661.6399841308594,
      "end": 1667.0799865722656,
      "text": " number 10. So if he said I'm not going, and then he went, that becomes problematic, does it not?"
    },
    {
      "id": 74,
      "start": 1668.760009765625,
      "end": 1677.1600036621094,
      "text": " Jesus said I go not up yet unto this feast. Just one simple example this evening of how important"
    },
    {
      "id": 75,
      "start": 1677.1600036621094,
      "end": 1681.0799865722656,
      "text": " words are. Have you ever been taken out of context? Somebody's said something about you,"
    },
    {
      "id": 76,
      "start": 1681.0799865722656,
      "end": 1685.7200012207031,
      "text": " or you said something, and they missed some of your words, and said, no, that's not exactly what"
    },
    {
      "id": 77,
      "start": 1685.7200012207031,
      "end": 1693.0,
      "text": " I said. And you understand the importance of your words. God gave us his words, and he told us that"
    },
    {
      "id": 78,
      "start": 1693.0,
      "end": 1699.3999938964844,
      "text": " his words are pure. By the way, he gave a grave warning in Revelation chapter number 22 with"
    },
    {
      "id": 79,
      "start": 1699.3999938964844,
      "end": 1709.3200073242188,
      "text": " regard to tampering with the words of God. We find that God has given us exactly what he's given us."
    },
    {
      "id": 80,
      "start": 1709.3200073242188,
      "end": 1714.8399658203125,
      "text": " Every word of God is pure, and no one gave him a requirement for how many words he had to give us,"
    },
    {
      "id": 81,
      "start": 1714.8399658203125,
      "end": 1720.8399658203125,
      "text": " and how many chapters, and so on and so forth. We find that in Revelation 22 and verse number 19,"
    },
    {
      "id": 82,
      "start": 1720.8399658203125,
      "end": 1726.9199829101562,
      "text": " and if any man shall take away from the words of the book of this prophecy. So I want you to"
    },
    {
      "id": 83,
      "start": 1726.9199829101562,
      "end": 1732.2799682617188,
      "text": " understand that when we begin to think about the the words of scripture, we begin to think about"
    },
    {
      "id": 84,
      "start": 1733.239990234375,
      "end": 1739.1599731445312,
      "text": " the process in which these men employed, the technique, the methods of translation for those"
    },
    {
      "id": 85,
      "start": 1740.0399780273438,
      "end": 1745.8800048828125,
      "text": " that were translating the King James Bible, and understanding what they believed about the Bible,"
    },
    {
      "id": 86,
      "start": 1746.4400024414062,
      "end": 1752.2799682617188,
      "text": " they had the text that was the right text, the traditional Masoretic text for the Hebrew,"
    },
    {
      "id": 87,
      "start": 1752.2799682617188,
      "end": 1757.0800170898438,
      "text": " for the Old Testament, the TR for the New Testament for the Greek. We find that they end up"
    },
    {
      "id": 88,
      "start": 1757.0800170898438,
      "end": 1764.9199829101562,
      "text": " with a product that is a superior product. It is God doing what God said he would do in preserving"
    },
    {
      "id": 89,
      "start": 1764.9199829101562,
      "end": 1772.8399658203125,
      "text": " his word. But just for a moment, consider the thought of the Aland of Nestle and Alan with the"
    },
    {
      "id": 90,
      "start": 1772.8399658203125,
      "end": 1779.239990234375,
      "text": " Greek New Testament. Remember, he had concern about the inerrancy and the inspiration of"
    },
    {
      "id": 91,
      "start": 1779.239990234375,
      "end": 1784.6799926757812,
      "text": " scripture. He questioned many times. He wrote books. You can read some of the books that he"
    },
    {
      "id": 92,
      "start": 1784.6799926757812,
      "end": 1789.7999877929688,
      "text": " wrote. They're still available. In fact, I read through some of it just recently, and you can"
    },
    {
      "id": 93,
      "start": 1789.7999877929688,
      "end": 1796.4400024414062,
      "text": " read where he questions the canonicity of the scripture, and denying that certain books should"
    },
    {
      "id": 94,
      "start": 1796.4400024414062,
      "end": 1800.0399780273438,
      "text": " be even included in the canon of scripture, and so on and so forth. And so if you"
    },
    {
      "id": 0,
      "start": 1800.0399780273438,
      "end": 1805.4399781227112,
      "text": " wholesale, say, these books don't really belong in the Bible, and then you are"
    },
    {
      "id": 1,
      "start": 1805.4399781227112,
      "end": 1811.0399780273438,
      "text": " writing a Greek New Testament, what then happens when you start removing words"
    },
    {
      "id": 2,
      "start": 1811.0399780273438,
      "end": 1815.279977798462,
      "text": " and you remove verses and you put, well, that's not really supposed to be there?"
    },
    {
      "id": 3,
      "start": 1815.279977798462,
      "end": 1821.6799774169922,
      "text": " It becomes very problematic. In Acts chapter number 8, another simple"
    },
    {
      "id": 4,
      "start": 1821.6799774169922,
      "end": 1825.0399780273438,
      "text": " illustration for you this evening, and we'll end with this illustration. I'll"
    },
    {
      "id": 5,
      "start": 1825.0399780273438,
      "end": 1829.6799774169922,
      "text": " make some concluding statements and get into our prayer time this evening, but in"
    },
    {
      "id": 6,
      "start": 1829.6799774169922,
      "end": 1835.2799797058105,
      "text": " Acts chapter number 8, many of the modern translations will just completely skip a"
    },
    {
      "id": 7,
      "start": 1835.2799797058105,
      "end": 1844.6799774169922,
      "text": " verse of Scripture here in this text. And I count 36, 37, 38, right? That's kind of a"
    },
    {
      "id": 8,
      "start": 1844.6799774169922,
      "end": 1849.0399780273438,
      "text": " normal way to count. If you look in Acts 8 and verse number 36, at the end of the"
    },
    {
      "id": 9,
      "start": 1849.0399780273438,
      "end": 1853.5999794006348,
      "text": " verse, the eunuch says to Philip, see here is water, what doth hinder me to be"
    },
    {
      "id": 10,
      "start": 1853.5999794006348,
      "end": 1859.4799766540527,
      "text": " baptized? So that's Acts 8 36, so you would expect to see in Acts 8 37. And in"
    },
    {
      "id": 11,
      "start": 1859.4799766540527,
      "end": 1863.1999778747559,
      "text": " Acts 8 37, it says that Philip responds to him, Philip said, if thou believest"
    },
    {
      "id": 12,
      "start": 1863.1999778747559,
      "end": 1867.1199798583984,
      "text": " with all thine heart, thou mayest. And he answered and said, I believe that Jesus"
    },
    {
      "id": 13,
      "start": 1867.1199798583984,
      "end": 1872.4399795532227,
      "text": " Christ is the Son of God. That's his profession. And then you see verse number"
    },
    {
      "id": 14,
      "start": 1872.4399795532227,
      "end": 1878.3199768066406,
      "text": " 38, again 36, 37, 38, it says he commanded, Philip commanded the chariot to stand"
    },
    {
      "id": 15,
      "start": 1878.3199768066406,
      "end": 1881.4199752807617,
      "text": " still, and they went down both in the water, both Philip and the eunuch, and he"
    },
    {
      "id": 16,
      "start": 1881.4199752807617,
      "end": 1887.1999816894531,
      "text": " baptized him. Wouldn't it be kind of odd if you went from verse 36 to verse 38?"
    },
    {
      "id": 17,
      "start": 1887.239974975586,
      "end": 1893.7599792480469,
      "text": " Wouldn't you wonder where's 37? Right? So in some of the modern translations, not"
    },
    {
      "id": 18,
      "start": 1893.7599792480469,
      "end": 1898.4399795532227,
      "text": " all of them, but in some of the modern translations, if you look at it, I did"
    },
    {
      "id": 19,
      "start": 1898.4399795532227,
      "end": 1901.5999755859375,
      "text": " this specifically with the New International Version, I looked it up"
    },
    {
      "id": 20,
      "start": 1901.5999755859375,
      "end": 1907.2799758911133,
      "text": " online, you see Acts 8 36, you see the text there, you see 37 and there's no"
    },
    {
      "id": 21,
      "start": 1907.2799758911133,
      "end": 1911.9999771118164,
      "text": " words, and then you see 38 in the verse. It's completely omitted, you go down to"
    },
    {
      "id": 22,
      "start": 1911.9999771118164,
      "end": 1914.9199752807617,
      "text": " the footnotes and it says this verse isn't commonly accepted in the"
    },
    {
      "id": 23,
      "start": 1914.9199752807617,
      "end": 1922.0399780273438,
      "text": " manuscripts. How does that work? And my question is this, does that have any"
    },
    {
      "id": 24,
      "start": 1922.0399780273438,
      "end": 1928.1999816894531,
      "text": " impact on doctrine? Sure it does. Here's water, what does it mean to be baptized?"
    },
    {
      "id": 25,
      "start": 1928.1999816894531,
      "end": 1931.5199737548828,
      "text": " Oh, you want to get baptized? Let's get baptized. That's how it reads in some of"
    },
    {
      "id": 26,
      "start": 1931.5199737548828,
      "end": 1936.3199768066406,
      "text": " the modern translations, because they remove verse number 37, that is, how"
    },
    {
      "id": 27,
      "start": 1936.3199768066406,
      "end": 1941.3599853515625,
      "text": " do we baptize people? We say this, based upon your profession of faith, I now"
    },
    {
      "id": 28,
      "start": 1941.3599853515625,
      "end": 1944.5199737548828,
      "text": " baptize you, right? That's what we say. Every time I baptize somebody, that's"
    },
    {
      "id": 29,
      "start": 1944.5199737548828,
      "end": 1947.1199798583984,
      "text": " what I say. Hey, are you 100% sure if you were to die today that you'd go to"
    },
    {
      "id": 30,
      "start": 1947.1199798583984,
      "end": 1951.1199798583984,
      "text": " heaven? Have you trusted Jesus Christ as your personal Savior? Yes, I have. That's"
    },
    {
      "id": 31,
      "start": 1951.1199798583984,
      "end": 1954.959976196289,
      "text": " their profession. I've already spoken to them before we ever got in the baptismal"
    },
    {
      "id": 32,
      "start": 1954.959976196289,
      "end": 1959.5599822998047,
      "text": " tank to understand that they are saved, because the candidate for"
    },
    {
      "id": 33,
      "start": 1959.5599822998047,
      "end": 1964.6399841308594,
      "text": " baptism is a saved individual. And so if you remove verse number 37, here's what"
    },
    {
      "id": 34,
      "start": 1964.6399841308594,
      "end": 1967.8399810791016,
      "text": " the people want to tell you today. Oh, it doesn't really change"
    },
    {
      "id": 35,
      "start": 1967.8399810791016,
      "end": 1974.1999816894531,
      "text": " any doctrine. Of course it does. And this is just one simple illustration this"
    },
    {
      "id": 36,
      "start": 1974.239974975586,
      "end": 1981.47998046875,
      "text": " evening. There's many that you could go to. The Bible tells us that there are"
    },
    {
      "id": 37,
      "start": 1981.47998046875,
      "end": 1986.1999816894531,
      "text": " going to be false teachers, just as there were false prophets. And we know that the"
    },
    {
      "id": 38,
      "start": 1986.1999816894531,
      "end": 1989.719970703125,
      "text": " enemy has sought to attack the Word of God from the very beginning of human"
    },
    {
      "id": 39,
      "start": 1989.719970703125,
      "end": 1995.8799743652344,
      "text": " history. As we claim the promises of God, as we examine the evidence of translation"
    },
    {
      "id": 40,
      "start": 1995.8799743652344,
      "end": 2001.239974975586,
      "text": " work, we conclude that God did in fact preserve His Word in the Masoretic Text,"
    },
    {
      "id": 41,
      "start": 2001.239974975586,
      "end": 2005.239974975586,
      "text": " the traditional Masoretic Text for the Old Testament, the Textus Receptus for the"
    },
    {
      "id": 42,
      "start": 2005.239974975586,
      "end": 2009.239974975586,
      "text": " New Testament, and those are the underlying texts for the King James"
    },
    {
      "id": 43,
      "start": 2009.239974975586,
      "end": 2014.5999755859375,
      "text": " Bible. I don't speak Hebrew, and I don't speak Greek. I know a few words in both. I"
    },
    {
      "id": 44,
      "start": 2014.5999755859375,
      "end": 2017.8799743652344,
      "text": " know how to look them up and find out what they mean, and I learned how to say"
    },
    {
      "id": 45,
      "start": 2017.8799743652344,
      "end": 2023.3199768066406,
      "text": " some of them, but I would never consider myself a Hebrew or Greek scholar. I'm"
    },
    {
      "id": 46,
      "start": 2023.3199768066406,
      "end": 2029.239974975586,
      "text": " thankful that I have an English Bible, and I'm thankful for how God used"
    },
    {
      "id": 47,
      "start": 2029.3599853515625,
      "end": 2036.2799835205078,
      "text": " individuals over 400 years ago now to do that work of translation. Individuals"
    },
    {
      "id": 48,
      "start": 2036.2799835205078,
      "end": 2041.5999755859375,
      "text": " that believed about the Bible the same things that we believe about the Bible."
    },
    {
      "id": 49,
      "start": 2041.5999755859375,
      "end": 2047.5999755859375,
      "text": " It's God's Word. It's necessary to be made available to the people in"
    },
    {
      "id": 50,
      "start": 2047.5999755859375,
      "end": 2052.8399810791016,
      "text": " their language, so that they can read it, so that they can obey it, so"
    },
    {
      "id": 51,
      "start": 2052.8399810791016,
      "end": 2059.8399658203125,
      "text": " they can be blessed by it. And these men, over 400 years ago, God used to do that"
    },
    {
      "id": 52,
      "start": 2059.8399658203125,
      "end": 2063.719970703125,
      "text": " work of translation, and I would submit to you this evening that they used the"
    },
    {
      "id": 53,
      "start": 2063.719970703125,
      "end": 2070.1199645996094,
      "text": " right text. That they used, or as the translators, they had the right"
    },
    {
      "id": 54,
      "start": 2070.1199645996094,
      "end": 2074.719970703125,
      "text": " perspective, and then they used the right techniques. And through having the right"
    },
    {
      "id": 55,
      "start": 2074.719970703125,
      "end": 2079.719970703125,
      "text": " text, having the right people, and using the right techniques, you end up with a"
    },
    {
      "id": 56,
      "start": 2079.7999877929688,
      "end": 2084.5999755859375,
      "text": " superior product. And I'm so thankful that God has given us His Word. There's"
    },
    {
      "id": 57,
      "start": 2084.5999755859375,
      "end": 2087.47998046875,
      "text": " so many more things that could be said on the discussion of the Bible"
    },
    {
      "id": 58,
      "start": 2087.47998046875,
      "end": 2092.1599731445312,
      "text": " translations. There are volumes of books that have been written on this topic, and"
    },
    {
      "id": 59,
      "start": 2092.1599731445312,
      "end": 2096.959991455078,
      "text": " so I've tried to kind of simmer it all down and give you one service this"
    },
    {
      "id": 60,
      "start": 2096.959991455078,
      "end": 2100.47998046875,
      "text": " evening on the subject matter, but of course there is much that could be"
    },
    {
      "id": 61,
      "start": 2100.47998046875,
      "end": 2103.959991455078,
      "text": " discussed on it, and I trust there's been a blessing to you. Let's go to the Lord"
    },
    {
      "id": 62,
      "start": 2103.959991455078,
      "end": 2107.6799926757812,
      "text": " in prayer. Father, we love you. We thank you for loving us. Thank you for your"
    },
    {
      "id": 63,
      "start": 2107.6799926757812,
      "end": 2111.719970703125,
      "text": " Word and the truth contained therein. We thank you that we have the Bible, and I"
    },
    {
      "id": 64,
      "start": 2111.719970703125,
      "end": 2116.6799926757812,
      "text": " pray God that you would help us to be students of thy Word. Help us to be doers"
    },
    {
      "id": 65,
      "start": 2116.6799926757812,
      "end": 2121.47998046875,
      "text": " of the Word. Lord, help us to appreciate those that have gone before us that"
    },
    {
      "id": 66,
      "start": 2121.47998046875,
      "end": 2128.0799865722656,
      "text": " have faithfully and diligently followed you and obeyed you to allow us to have"
    },
    {
      "id": 67,
      "start": 2128.0799865722656,
      "end": 2132.439971923828,
      "text": " the Bible that we hold in our hands this evening. Help us to be engaged in the"
    },
    {
      "id": 68,
      "start": 2132.439971923828,
      "end": 2136.999969482422,
      "text": " work of sharing your Word with those that we come into contact with. Bless our"
    },
    {
      "id": 69,
      "start": 2136.999969482422,
      "end": 2142.439971923828,
      "text": " time of prayer. We'll thank you for it. In Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T13:46:23.048467"
}