{
  "video_id": "M95WZQin3TU",
  "text": "with you this evening, Psalm 62. We'll be looking at the entirety of the psalm. This particular psalm, Psalm 62, is ascribed to David, the sweet psalmist of Israel. And we find that as we come to the book of Psalms, generally speaking, 150 of them, of course, the songbook for the nation of Israel, for the Jewish people, and what a blessing it is to be able to read through and study the psalms, to see the transparency of the psalmist, to be encouraged and strengthened. We find that God has informed us in his word that his word is powerful. Aren't you thankful for the power of God's word? He told us that it's powerful. He told us that his word is profitable. And we begin to think about how we need, personally, individually, we need to be in the word. We need to allow the word to get into us, and it will profit us. It'll be a blessing to us. It'll comfort us. It'll instruct us, and it'll correct where we're wrong, and keep us straight, amen? And all sorts of things are changing in our society, but God is immutable, and his word is settled, and we have to be people of the book. And I trust that this evening, as we understand that God has providentially preserved his word for us, to help us, that as we look at this psalm tonight, all 12 verses, I trust that God will use it to strengthen and to encourage his people. I'm gonna read the entire psalm, and then we'll dig in this evening. The psalmist says this, \"'Truly, my soul waiteth upon God. \"'From him cometh my salvation. \"'He only is my rock and my salvation. \"'He is my defense. \"'I shall not be greatly moved. \"'How long will ye imagine mischief against a man? \"'Ye shall be slain, all of you, \"'as a bowing wall shall ye be, \"'and as a tottering fence. \"'They only consult to cast him down from his excellency. \"'They delight in lies. \"'They bless with their mouth, \"'but they curse inwardly, Selah. \"'My soul, wait thou only upon God, \"'for my expectation is from him.'\" Verse six and verse two, it's amazing, repeated for us. Notice, \"'He only is my rock and my salvation. \"'He is my defense. \"'I shall not be moved. \"'In God is my salvation and my glory. \"'The rock of my strength and my refuge is in God. \"'Trust in him at all times, ye people. \"'Pour out your heart before him. \"'God is a refuge for us, Selah. \"'Surely men of low degree are vanity, \"'and men of high degree are a lie. \"'To be laid in the balance, \"'they are altogether lighter than vanity. \"'Trust not in oppression, \"'and become not vain in robbery. \"'If riches increase, set not your heart upon them. \"'God hath spoken once, twice have I heard this, \"'that power belongeth unto God. \"'Also unto thee, O Lord, belongeth mercy, \"'for thou renderest to every man according to his work.'\" As we look at this Psalm this evening, I wanna draw your attention to the middle of verse number eight. We'll use it for our title this evening. In the midst of verse number eight, the psalmist says, \"'Pour out your heart before him. \"'Pour out your heart before him.'\" On more than one occasion, the psalmist did this. On more than one occasion, we find that David facing great difficulties in his life, we find that he poured out his heart before the Lord. As we begin to look at this Psalm, I notice number one, if you're taking notes this evening, the trial of the psalmist. With many of the Psalms, we find that there's times in which you can specifically look at this must have been written during this particular event. And with some of the Psalms, there's multiple different events that it could be written at multiple different points. And we find that many times in David's life, he faced great trials. We find that he was a faithful man. He was diligent to do what God had called him to do. He was diligent and faithful as a young man doing what his earthly father had instructed him to do. We find that David was a man that after his anointing and the pages of scripture that God gives us and recording for us his life, we find that Saul made David his enemy continually. We find that, of course, the Philistines were regularly trying to attack and conquer and kill. And we find that even his own son Absalom revolted against him. We begin to look at the trial of the psalmist in this text of scripture. We find that in verse number three, notice he says, how long we imagine mischief against a man. He shall be slain all of you as a bowing wall shall you be in as a tottering fence. Notice what he says in verse number four, they only consult to cast him down from his excellency. They delight in lies. They bless with their mouth, but they curse inwardly. Selah. David is expressing to us and explaining to us the trial in which he's facing, the test, the difficulty in which he's experiencing in his life. And we find that as he's giving to us with transparency here, this trial and what he's experiencing, he's speaking about these difficulties. And I understand today that even as he mentions in verse number nine, while he's giving instruction, he says this, surely men of low degree are vanity and men of high degree are a lie to be laid in the balance. They're altogether lighter than vanity. And the reality is that as David is dealing with this trial in his life, he's having this great burden, this great experience. And he's overwhelmed because of all that's taking place. He's in the midst of this trial. But I want you to understand that in the midst of the trial, it's not something that's unique to David. Trials, though he was afflicted and though he faced many trials, we find this evening that trials are not something that were unique for David's life. You face trials, I face trials, we all face trials in life. The reality this evening is that God knows that we'll face trials. God knows that we'll deal with these times of testing and difficulty. And he provides for us instruction. And we find here in the Psalm as we'll get through the message this evening, a great example instruction for what it is that we're to do. But I want you to notice, consider with me this evening, the truth of Hebrews chapter number 11. We'll look at two verses in the New Testament and deal with this idea of trials. And we see the trial of the psalmist. I do not believe this evening that I need to go through great lengths to convince you that you have faced trials. I think that all of us would readily quickly stand up and say, not only have I faced trials, but I'm very much in the midst of a trial at this very moment. And I understand this evening that we face trials, we face testings. In Hebrews chapter 11, we come to verse number 36. Notice what the Bible says, and others had trial of cruel mockings and scourgings, yea, moreover of bonds and imprisonment. Notice they were stoned, they were sawn asunder, were tempted, were slain with the sword. The Bible says they wandered about in sheepskins and goatskins being destitute, afflicted, tormented. It says of whom the world was not worthy, they wandered in deserts and in mountains and in dens and caves of the earth. These trials that are mentioned at the end of the great faith chapter in Hebrews chapter 11, there are some specifically that we can look to and we can piece things together and begin to understand who may be spoken of in these particular trials. But we find that they face some serious, serious trials. And then I'm reminded of the people that Peter is ministering to. If you look in 1 Peter, we find that Peter is ministering to a group of people that are facing great difficulty, trials. In fact, as he's writing in the first chapter to these individuals, he's writing to those that are scattered abroad, they're strangers. He lists in verse number one of chapter one, the region in which they're located, Pontus, Galatia, Cappadocia, Asia, and Bithynia. And he talks about they're scattering, it's a result of the persecution of Nero, the wicked emperor of Rome. We find that the people, the recipients of the book of 1 Peter, they're in need of encouragement. We find that you come to verse number six and he says, when you greatly rejoice, though now for a season if need be, you're in heaviness through manifold temptations. Notice what he says in verse number seven, that the trial of your faith, being much more precious than of gold that perisheth, though it be tried with fire, might be found unto praise and honor and glory at the appearing of Jesus Christ, whom having not seen you love, and whom though now you see him not yet believing, you rejoice with joy unspeakable and full of glory, receiving the end of your faith, and receiving the salvation of your souls. He says there in the midst of verse six and seven, he says that if need be, you're in these moments of trial in this manifold. He says, the trial of your faith in verse number seven. And then I want you to notice what Peter says in chapter four with regard to this subject of trials. And we come to the fourth chapter of the book of 1 Peter, and we come to verse number 12. And I want you to notice that Peter says this, Beloved, think it not strange concerning the fiery trial which is to trial. Which is to try you, as though some strange thing happened unto you. He says, think it not strange, concerning what? The fiery trial. We begin to look at the end of the book in chapter five, and we find that Peter will say this in verse number 10, But the God of all grace, who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, establish, strengthen, settle you. To him be glory and dominion for ever and ever. Amen. The trial. I understand this evening that trials are not pleasant. Trials are not pleasant. We find that the psalmist back in Psalm 62, he's dealing with some trials. He was a man that was familiar with trials. He was a man that experienced trials in his life. We find that as believers tonight, there will be trials in our lives. There will be trials, times of testing. Some trials are greater than other trials. Sometimes it's a health trial, sometimes it's a finance trial. It's a variety. There's trials. We look at this passage of Scripture and we see the trial of the psalmist, and then I notice number two, the testimony of the psalmist. Notice with me as we begin to look at the testimony of the psalmist throughout this passage of Scripture and begin to understand how he dealt, how he responded to the trial in which he was experiencing, we find great instruction for us. This evening we find that the testimony is the result of the trial. The testimony is the result of the test in which he experienced. How often can we stand up on the other side of the storm and we can stand and we can give testimony of what God did and how God worked and what God taught us, etc., etc. But in the midst of it, sometimes it's really challenging. I want you to notice the testimony. Number one, the psalmist resolved to wait on God. The Bible says in verse number one, truly my soul waiteth upon God. In verse number five he repeats, my soul wait thou only upon God. To wait upon the Lord is not always easy. In fact, in the midst of trials, it can be one of the hardest things to do. Just wait on the Lord. Wait on God to do what only God can do. Be still, the psalmist said, be still and know that I am God. Waiting is not always easy, but it's often necessary. It's often necessary in the Christian life to wait on God. Many times in our lives we get in a hurry. You know what I found? God's never in a hurry. He's always on time. He's always on time. He works with purpose. You ever meet people that are always in a hurry? Hey man, don't look at your wife right now. Hey man. Listen, you meet people that are always in a hurry. I mean, they're just kind of always running behind. You know what I mean? Just rush, rush, rush, rush, rush. Sometimes we get in a hurry in life. You ever try to hurry the process of some of the ladies baking something or cooking something? You try to, I did that once with ribs. Brother Armando, you like to smoke some meat. Brother Ron, you like to, how does it work when you hurry the process with smoking meat? Terrible. Honestly, requires time. We had somewhere to go, something to do, and I said, well, if I just cut about 20 minutes from each step of the process, it'll save me about an hour and we'll be okay. Because smoking ribs is a long process. So I cut 20 minutes from the first step and wrapped them up and cut 20 minutes from that step. And you know what? They were tough. They were. They weren't real tasty. Because I hurried the process. Sometimes in life we get in a hurry and God just wants us to wait. In Psalmist here, we find his resolve to wait on God. Understanding in verse 1 and again in verse number 5, though he's in the midst of the trial, he says in verse number 3, how long will you imagine mischief against a man? We find he's in the midst of the trial, but he says that my soul waiteth upon God. It's almost like he's having self-talk in verse number 5 and he says, my soul wait thou only upon God. You ever got to talk to yourself? Amen. He was resolved to wait on God. Sometimes we get in a hurry and we mess things up. Make a mess of a situation that already is a mess. Just wait on God. Not only was he resolved to wait on God, but he recognized who God is. He recognized what God could do. We find in verse number 1, he says, truly my soul waiteth upon God, but then notice at the end of the verse, he says, from him, from God, cometh my salvation. David was a man of war. Was he not? I mean, David was the sweet psalmist of Israel. He could play that harp like no one else, but David was a warrior. Amen? David didn't back down to Goliath. I mean, he's like, let me go. I'll go and fight this uncircumcised Philistine. What are you all afraid of? Is there not a cause? Is that the same David? Is that what you read in 1 Samuel 17? Amen? He's not afraid of a fight. Not afraid to pick up a sword and go. But he's waiting on God. He's not taking matters into his own hands. He's saying, I understand that from him, from God, cometh my salvation. Begin to see the growth of David in his life as you study through his life. And you find that many times that David was obviously with the situation of Nabal. He's like, we're going to go and we're going to kill them all. And Abigail comes and intervenes and helps that situation. But he is ready to go kill them all. They're all going to be killed. And by the way, David could do it with his men. It was going to be accomplished. But you know, later on in his life, the Philistines rise up against him. You know what David does? He prays. God, should I go up against him? What's he doing? He's waiting on God. He's seeking counsel from God. God gives him victory. But then the Philistines, after defeat, they kind of regather. They're going to come again. And so what does David do? Well, he doesn't presume upon God. He goes and seeks God's face again. God, should I go up? And that's the account in which God says that you're going to wait and you're going to hear a rustling in the mulberry trees. God gives him direction and God gives him leadership and he's waiting. And we find here that he recognized who God is. He recognized what God is capable of doing. He says, from him cometh my salvation. Notice in verse 2 and also in verse number 6, we find this declaration. He only. Do you notice that? He only is my rock and my salvation. He is my defense. I shall not be greatly moved. Do you recognize? Do you testify that God only is your rock, is your salvation, is your defense? We find that in verse number 7 that David will make this statement, In God is my salvation and my glory. The rock of my strength and my refuge is in God. What you know to be true about God will be exposed in the midst of your trials. What you know to be true about God will be exposed in the midst of your trials. I've watched people literally crumble and almost fall apart in the midst of a trial because they knew very little about God. They knew very little about what God was capable of doing and who God was to them personally. And I've seen others sit across a table in my midst and share with me a great trial, but yet resolve in trusting God and expecting God to do what God could only do. Why? Because they knew much about their God. They knew these things to be true about their God. David had experienced this. David knew who God was. David knew what God was capable of doing. This evening, when I begin to think about the testimony of the psalmist in this chapter, and we can rejoice in understanding that in the midst of the trial, there's a testimony there, and he's waiting on the Lord, and he's expecting God to work, I notice in verse number five where he says, \"'For my expectation is from him.'\" I wonder this evening, what are we expecting God to do in our lives? I asked this question in the last week about our prayer lives, what kind of prayer, what's on our prayer list right now that is something that only God can do? I mean, a miracle, not something that we're gonna try to figure out and manipulate ourselves, but something that truly is going to be God's hand at work. And he says, my expectation is from him. What are you expecting God to do in your life? He is able to do exceeding, abundantly above all that we ask or think, is that true? Ephesians chapter number three, amen. He is able to do exceeding, abundantly above all that we ask or think, and here the psalmist says, my expectation is from him. I'm expecting God to do something great. I note, as we look at the remainder of the chapter this evening, not only the trial and the testimony, but I want you to notice number three, the teaching of the psalmist. I believe in verses eight through 12, David begins to give a lesson to those that would read this psalm. I believe that as David is writing these verses, that he is going with what he's experienced and now seeking to instruct, to teach others. We find that in verse number 80 says, trust in him at all times. Pause there just for a moment. Does all times really mean all times? Amen, right? Trust in him at all times, at all times. In your life, when it seems like things are falling apart, in your life, when it seems like there's no way, and there's just great confusion, trust in God. Blessed is the man that puts his trust in God. Who's the man that's going to trust the Lord? We've been dealing with it on Wednesday nights. Remember in Psalm 11, the psalmist said, in the Lord put I my trust, but in Psalm chapter nine, he says in verse number 10, and they that know thy name will put their trust in thee. Trust in him at all times. Why am I going to trust him? Because I know him, he's trustworthy, he's never failed. And David says as he's teaching now and seeking to give this instruction to those that would come and read this psalm, this testimony, he says trust in the Lord at all times. There's been a time in your life where you didn't trust the Lord, you trust the arm of flesh. You found as the songwriter said that the arm of flesh will fail you. Only trust him. The songwriter also said, I'm so glad, I learned to trust him. He went on to say, oh, that I'd trust him more. This evening, he says, trust in him at all times ye people. Notice the phrase that we've used tonight for our title, pour out your heart before him. Can I encourage you this evening that God knows your heart anyway? He knows your heart. Sometimes we just need to get along with God and pour our heart out to him. Pour our heart out to him. I understand sometimes we might feel in our flesh, we may feel vulnerable, we may not wanna say things to certain people and we, can I tell you that God wants us to pour our heart out to him? Can I tell you that we have a great high priest? We have a great high priest. Hebrews, notice, I'm gonna read the verses to you in Hebrews, go over if you will. I want you to see him tonight. I want you to understand how wonderful our savior is. In Hebrews chapter number three, and we'll look in chapter number four as well. I said number chapter three, sorry, chapter two. The end of chapter two, notice, verse number 17, the Bible says, wherefore in all things it behooved him to be made like unto his brethren, that he might be a merciful and faithful high priest in things pertaining to God, to make reconciliation for the sins of the people, for in that he himself hath suffered, being tempted, he is able to succor them that are tempted. You know what that word succor means? It means to help, it means to give aid. To give aid, to give help. We find that in chapter number four, in verse number 14, the Bible says this, seeing then that we have a great high priest that is passed into the heavens, Jesus, the son of God, let us hold fast our profession, for we have not an high priest, which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are, yet without sin. Let us therefore come boldly unto the throne of grace, that we may obtain mercy and find grace to help in time of need. We pour our heart out before God. We find that this evening, the psalmist is giving this instruction in Psalm 62. He's now teaching, beginning in verse number eight, to those that would come and read and be benefited by this, and he says, trust him at all times, but he says, pour out your heart before him. Be transparent with God. He knows all about it, and he cares about you. Casting how many of your cares? All. Is that what 1 Peter 5, 7 says? Casting all your care upon him. Why? For he careth for you. Isn't that a precious truth of God's word? Psalm 55, cast thy burden upon the Lord. He will sustain thee. And here, the psalmist, I love the imagery. We saw great imagery in verse number three, when he talked about the wicked as a bowing wall and as a tottering fence, and you get that imagery of something that's ready to fall and crumble. And we find here the imagery when he says, pour out your heart before him. Just get along with God. God cares. God hears. Why is it that the psalmist, other than the experience that he had himself, why is it that he would say, trust in him at all times. Pour out your heart before God. Well, we find in verse number eight at the end, he says, God is a refuge for us. He's my refuge. He's my refuge. And then we see that word again, selah. We see it throughout the Psalms. We're not real good at selah. Because we're in a hurry. And selah carries with it the exact opposite of being in a hurry. Just slow down. Just meditate. Let it sink in. God is my refuge. God wants me to trust him. He wants you to trust him at all times. He wants us to pour our hearts out before him. He is able to help us. He is able and he will succor us as we read there in Hebrews. And we find that he provides us with that help and that aid that we need. He says in verse number nine, surely men of low degree are vanity and men of high degree are a lie. To be laid in the balance, they're altogether lighter than vanity. He had experienced this. We talked about his trial, but we understand that now as he's teaching, listen, expect that these things will happen. And then he says in verse 10, notice the contrast of the instruction in verse number eight to trust in God, to trust in him at all times. But now in verse number 10, he's gonna tell us some things not to trust in. Trust not in oppression and become not vain in robbery. Notice what he says at the end of verse number 10. If riches increase, set not your heart upon them. It's kind of interesting verse of scripture because you know, it's so common for humanity to see riches increase and set their hope, their trust in them. It's so common amongst those, humanity amongst each of us as human beings to have the idea or the thought that money can fix anything. But I'm here to tell you this evening that some of the saddest situations I've ever encountered are of those that have more money than you could even think about what to do with it. Money doesn't fix problems. Sometimes it can put a Band-Aid on some things, but it doesn't fix problems. And by the way, the Bible tells us that riches increase, they make wings and they fly away. We're in Haggai this morning in Sunday school with brother Mark and there in chapter one, it talked about making wages and putting in a bag with holes. Talk about some imagery, amen. And the reality is he says, listen, if riches increase. Set not your heart upon them. We've already determined we're going to trust in Him, in God at all times. By the way, I know that as a nation we're not in this place anymore, but I'm thankful that on U.S. currency, at least all that I have seen, I know they've had times in which they're talking about removing it, it still says, to the best of my knowledge, in God we trust. What a great reminder that we're not to be trusting in the very thing that so many in our country are trusting in, the money that even says, in God we trust. Verse 11, God hath spoken once, twice have I heard this, that power belongeth unto God. I just like verse number 11. Listen, God only ever has to say something one time, but there are many times in His word that He repeats things. And the psalmist says, God hath spoken once, twice have I heard this, that power belongeth unto God. Listen, my God, your God, our God has all power. He has all power. He's the Lord God omnipotent. All power is given unto me in heaven and in earth. Who said that? Jesus, not David, not Paul, not John, not me, not you. Jesus Christ, our Savior, all power is given unto me. And then He said, but ye shall receive power after that the Holy Ghost has come upon you. Amen? Acts 1 and verse number 8. We're powerless. We need power. God promised to give us power, but it's His power working through us. Verse 12, also, unto thee, O Lord, belongeth mercy. Oh, I wish we had more time this evening. Our God is so merciful. He's so merciful. Have you experienced the God who is rich in mercy? Have you experienced that His mercies are new? Most mornings? Every morning. Amen? That's what the Bible teaches us. Our God is merciful. His mercy endureth forever. Praise the Lord. For thou renderest to every man according to his work. This evening, we see the trial, we see the testimony, we see the teaching. I wonder tonight, I know, because we're all human beings, we're not in heaven yet. I know we have trials. I know we do. I know some of you are in the midst of trials right now. Some of you, you just came through some trials. Some of us are going to, we don't even know what they are, but there are going to be some trials. God knows, and I wonder tonight, being to look at Psalm 62, will we take the instruction of the psalmist, will we just be resolved that we're going to wait on God and trust Him at all times? Will we recognize that God is the one who has all power, that God is the one that can do all things, and we'll trust Him, and we'll pour out our heart before Him? Just get along with God. We need God's help. We need God's help. And He's designed it that way, that we need Him. We need Him. And that's not anything that makes us of some, it's pride that gets in the way is what it is. Pride gets in the way, but we need God. The songwriter said, I need Thee every hour. Isn't that what the songwriter said? I know songs aren't inspired, but that's what the songwriter said, and I often say when I look at that song, I need Thee every second of every minute of every hour, and so do you, because He is the vine, and we are the branches. Without Him, we can do nothing tonight. We look at Psalm 62. I hope you spend some time meditating upon it. Pour out your heart before Him. Let's pray. God, Lord, we love You. We thank You for loving us. We thank You for Your blessings, Your provision, Your protection. We thank You, God, for the truth of Your Word. I pray that You'd bless in the time of invitation. Lord, I don't know all the trials of all the folks that are gathered here, but God, I know that You do. You know our hearts, Lord. You know what's going on in our lives, and I pray, Father, that You would have in this moment of invitation Your will and way. God, that decisions would be made that would please Thee. Well, thank You for what You'll do for us in Christ's name. We pray. We just stand in awe of You. We thank You, Lord. We thank You, Lord. We thank You, Lord. We thank You, Lord. We thank You, Lord. ",
  "processed_at": "2025-04-14T16:52:25.071207"
}