{
  "video_id": "najkOZaBPgU",
  "text": "to Revelation chapter number two. And this evening, as you see in the bulletin, as I mentioned at the close of the service this morning, we'll be dealing with the church at Thyatira, but only the first aspect of the church. And we'll look at just a couple of verses this evening. The city of Thyatira was a relatively small city, but it was wealthy. And they were well known for several different things, but most, I guess, famous, if you will. They were known for their wool and for their dyeing industry. And Acts 16 and verse 14, we're told about Lydia. And she was a seller of purple, and she was from the city of Thyatira. And we read about that in Acts 16 and verse 14. It gives us a little bit of insight with regard to some of the commercial trade and what they were very well known for. The city was located approximately 35 miles southeast of Pergamos. Of course, we dealt with, last Sunday evening, the message to the church at Pergamos. We find that the Lord, as we begin studying this particular letter to the church at Thyatira, once again, is going to emphasize a particular aspect about his nature to this church. In verse 18, the Bible says, and unto the angel of the church in Thyatira write, these things saith the Son of God, who hath his eyes like unto a flame of fire, and his feet are like fine brass. And really, that reminds us of what had been said in chapter one, verses 14 and 15. And when we see these two references, to his eyes like unto a flame of fire, and his feet are like fine brass, it reminds us that he sees all and he judges all. And there is nothing hidden from our God. There's nothing in your life, my life, or anyone else's life that is hidden from God. As much as man has tried to cover their sin, as much as man has tried to hide things from God, the reality is that God knows all things. God knows the thoughts of your heart, of my heart. And we are reminded that not only does he see all, but he judges all. He is the judge of the entire earth. We find that as we look at this letter to the church in Thyatira, it is this letter that is the longest of the seven letters that we read in Revelation 2 and Revelation 3. And we find that with the length of this letter, that's one of the reasons that we're only gonna focus tonight on just a couple of the verses, because we'll have a multi-part as we try to make our way through this particular letter. It's very interesting as we've studied through these letters up to this point, and I'll say it my way of introduction, we begin to think about a church under the evaluation, the examination of the Lord Jesus Christ, who is the head of the church. We find that he's examining, he's evaluating the ministries of these particular churches. Of course, we understand that they are literal churches that existed at the time of the writing. They are local bodies of believers. And we find that as he would go through the process of having these letters sent and evaluating the ministry, that you find many times, and it's quite interesting as we look at the church in Thyatira, that there's really almost a direct opposite with what you find here in the church at Thyatira versus the church in Ephesus. We find that the church in Ephesus was, they could not, they would not allow for any type of evil. They were very sound with regard to their doctrine and what have you, but they had left their first love. They had departed from their first works. And yet we find the church in Thyatira where they're growing in their works and they're being commended for these things, but yet doctrinal error is coming in. When we begin to think about these things as you look through these letters, we really are reminded that the goal in ministry is to be balanced. And how important it is that we're balanced in our own lives individually in our homes, but in our churches, where we have the right position and the right disposition. We believe the right thing and we behave the right way. We are doing what God's called us to do while holding firm to the truth that God has given to us. And so often, as I mentioned last week, with regard to the temptation for compromise, so often there's some area that we begin to falter in and we might keep things going well here and we're staying sound here, but we're compromising here. And there's this need for balance in ministry and that we understand that everything is important. There's not certain things to say, we're just gonna focus on these things and let all these things slide. We're gonna find ourselves in trouble. And we find here this evening that as the Lord Jesus Christ is having this letter written to the church in Thyatira, he says in verse 19, as we have noted in each of these letters, I know thy works. Notice with me the entirety of verse 19. He says, I know thy works and charity and service and faith and thy patience and thy works. He says it a second time. And notice this last phrase of verse number 19 and the last to be more than the first. As we begin to examine that phrase at the end of verse 19, it would seem as if the Lord is saying to this church in these five areas that are mentioned in verse 19 that they were growing, that they were progressing in these particular areas because he says that the last is more than the first. It's interesting because again, as I mentioned already to the church at Ephesus, in verse number five of chapter two, the Bible says, remember therefore from whence thou art fallen and repent. And notice where it says, and do the first works or else I will come unto thee quickly and will remove thy candlestick out of his place except thou repent. As we look at the church in Thyatira, he says, I know thy works and charity and service and faith and thy patience and thy works and the last to be more than the first. The reality is that God's people are to be growing. Amen? We're to grow. The Bible teaches us as newborn babes, desire the sincere milk of the word that ye may grow thereby. Is that what first Peter two verse number two says? When Peter writes in second Peter chapter three in verse 18, but grow in grace and knowledge of our Lord and savior Jesus Christ. And the Christian life is about growth. And the thing that's amazing about the Christian life is that your growth and my growth is not going to be restricted to some growth chart that somebody provides. No, we understand that we can grow as quickly as we wanna grow. We can be as close to God as we wanna be. We can be as spiritual as we wanna be. And the reality is that as Paul is writing to the believers in the book of Hebrews, he tells us for in the time that you ought to be teachers. Why does he use that phraseology in Hebrews five in verse number 12? Because they should have been growing. For in the time that you ought to be teachers, he says to them, you have need that one teach you again, which be the first principles of the oracles of God and are become such as have need of milk and not of strong meat. And so what is Paul saying to these believers that he's addressing in the book of Hebrews? He's saying to them, you ought to be growing, but you're not. And so growth is expected in the Christian life. Is that a fair statement this evening? Growth is expected in the Christian life. If the church is a body of believers, if the church, it's not the building, it's the people, the church is a called out assembly. And if the church is made up of individual saved and baptized believers who have voluntarily joined themselves together for the carrying out of the great commission, if that is a simple definition this evening of the church, the local church, and we believe that as Christians were to be growing, then we could easily say this tonight that churches should be growing. Churches should be growing. Here's one of the problems with growth. There's been such an emphasis over the last couple of generations with regard to church growth being strictly numerical. And there's this numerical focus and emphasis on church growth. Let me be quick to say this, I'm all for the church growing numerically. It means that you're reaching people. It means that you're investing in people and I'm all for the church growing numerically, but the reality is that a church needs to be growing spiritually. It's not one or the other, it should be both. A church should be growing numerically and a church should be growing spiritually. And it's so important when we understand the truth of the great commission when the Lord Jesus Christ before his ascension, he gives the great commission in its most detailed setting in Matthew chapter 28 and he lays out three aspects with regard to the great commission, not only preaching the gospel so that people could be saved, not only baptizing them in the name of the Father, the Son, and the Holy Ghost, but teaching them to observe all things whatsoever I have commanded you and we find that that third aspect of discipleship is so vital for a local church. And so a church ought to be growing. The church in Thyatira, as we look at verse number 19, it seems as if they're growing and we'll reference these five areas. Another church that we find in the New Testament that will be referenced a couple of times this evening that was a growing church is the church in Thessalonica. And that church is growing. It's quite. First thing is you study 1st and 2nd Thessalonians and you make some very obvious comparisons between the two books and you see that the Bible speaks about how they're growing. In fact, your faith groweth exceedingly. What a blessing to be hearing those words and to be the reality of a church that is growing in that regard. And so this evening as we look at this passage of Scripture we note these five areas. Note them with me quickly. Number one, they were growing in works. Now understand this evening, and it's a Sunday night so I believe that we'd all be aware of this truth already, but it's important to make it known. The reality is that works cannot save us. Amen? Works cannot save us. Not only can they not save us, but they can't keep us saved. Not by works of righteousness which we have done. For by grace are you saved through faith and that not of yourselves is the gift of God. Not of works, lest any man should boast. And we find that even as we study the Scriptures and as Brianna sang that song this morning and I referenced it from the truth from Isaiah, that all of our good works are as filthy rags. But the reality is that after we're saved, when we read Ephesians chapter 2 verses 8 and 9 which I quoted a minute ago, the Bible goes on to say that we are His workmanship created in Christ Jesus and the Bible says this, unto good works which God hath before ordained that we should walk in them. In what? In the good works. Again, as you study the book of Ephesians and that's Ephesians chapter 2 and verse number 10, it's very clear throughout the six chapters in the book of Ephesians that our works have nothing to do with our standing before God as far as being saved. Our position is secure in Christ. We're saved by the grace of God, by the shed blood of the Lord Jesus Christ, His death, burial, and resurrection. But because we are saved, we ought to do good works. We ought to be involved in this area of works. Titus chapter 2 says this, in fact if you were to study through the three chapters in the book of Titus, there's emphasis with regard to works. But notice Titus 2, the Bible says this in verse number 11, Titus chapter 2 and verse number 11, for the grace of God that bringeth salvation hath appeared to all men. Aren't you thankful for that truth? I'm thankful that God's grace and it brings salvation, that it's appeared to all men. And then notice what God's grace teaches us according to verse 12, teaching us that denying ungodliness and worldly lusts, we should live soberly, righteously, and godly in this present world. Then notice verse 13, looking for that blessed hope and the glorious appearing of the great God and our Savior Jesus Christ. Think about the summary of these three verses, that the grace of God that brings salvation appeared to all men and it teaches us how we're to live our lives. This idea in Jude where they've turned the grace of God into lasciviousness is completely contrary to what we find the Bible teaching us in Titus 2 in verse number 12. God's grace does not say go out and sin because where sin abounds, grace is more. No, it says that we're to live godly. We find that He says that we're to look for the return of our Lord and Savior Jesus Christ, and I'm so thankful that one day He's coming back. But notice with me in verse 14, who gave Himself for us that He might redeem us from all iniquity and purify unto Himself a peculiar people. Notice what they're to be zealous of, zealous of good works. The book of James is often misunderstood because in the book of James there are many references with regard to good works and our works and you say that you have faith and show me your works and all of the verses of Scripture that deal with works and I've said before and I think it's an easy understanding that what James is focusing on is not the root of salvation but he's dealing with the fruit of salvation. Because I'm saved, I am His workmanship created in Christ Jesus and here we find that the Lord says to the church in Thyatira, I know thy works and then He says again at the end after He lists the next things, He says and thy works. They're busy serving the Lord. Their service is mentioned in a moment and we'll look at that here as we go through it but we find they're growing in works. Number two, they're growing in charity. Notice it says I know thy works and charity. Oh, how important it is that we love people but you understand this evening that loving people cannot be separated from telling people the truth. So often today the idea is that if you love them or because you love them then you just kind of accept whatever and let it all be what it wants to be because well, that's just love. But the reality is that love speaks the truth. And we find in the scriptures the importance of growing in charity. We understand the importance of loving God and loving people and we understand that we're to love our brethren and we're to have that brotherly love one for another and the Bible says that God knows their works and He knows their charity and the reality is that God knows our works and He knows our charity. Look over the book of 1 Thessalonians if you will and chapter number four and 1 Thessalonians chapter number four and I want you to note with me what is said about the church in Thessalonica with regard to their love. And notice with me if you will in 1 Thessalonians chapter number four verses nine and ten the Bible says this, but as touching brotherly love ye need not that I write unto you for ye yourselves are taught of God to love one another and indeed you do it toward all the brethren which are in all Macedonia but we beseech you brethren that ye increase more and more. And so we find that the church in Thessalonica is being encouraged, they're being challenged and they're love one for another and Paul says I know that you're doing it but don't be content, don't get comfortable, increase. Notice in Romans chapter twelve, in Romans chapter number twelve in verse number nine, Romans chapter twelve in verse number nine and I want you to notice what the Bible says here and Romans twelve in verse number nine, let love be without dissimulation, let love be without dissimulation. The reality is that when we speak about our love it's to be a love that is sincere, without hypocrisy and we find that he says not only and it's interesting in the same verse of scripture let love be without dissimulation, abhor that which is evil, cleave to that which is good. Love speaks the truth and it must speak the truth. The reality is that if you're not speaking the truth to someone while at the same time saying that you're loving that person there's a disconnect between those two comments. There's a problem with that because love speaks the truth and here they're growing in their works, they're growing in their charity. Number three it says end service, end service. What a blessing it is to serve the Lord and we spoke already about their work so I won't belabor the point but look at first Peter chapter four if you will, first Peter chapter number four and I want you to notice what the Bible says here in first Peter chapter four verses ten and eleven with regard to our service. I was, had some conversations today actually with a couple of different sets of people and in both of, two of the conversations that I had I mentioned about our service for the Lord and one of them in particular I mentioned about the truth of Joshua standing up and saying as for me and my house we will what? Serve the Lord. Now listen Joshua didn't say that so that in 2025 it could be marketed all over the place to be hung in your home and my home. He said that because he was drawing a line in the sand and he was saying listen choose you this day whom you're going to serve. How are you going to go, how are you going to go forward? What are you going to do? Are you going to serve the gods of the people in the land? Are you going to serve the gods that they served before the flood? What are you going to do? As for me and my house we are going to serve the Lord. So then we ask this question, what does it mean to serve the Lord? How do we serve the Lord? Why should we serve the Lord? How do we serve the Lord together as a family? How do we serve the Lord in a time in which things are so busy and there's so many demands upon our lives and going to and fro and all that's taking place and yet we find that this church in Thyatira they're serving the Lord. Notice in 1 Peter chapter 4 and verse number 10 the Bible says as every man hath received the gift. How many have received the gift? Is anyone excluded? If you're saved.  If you're here and you're saved that means you've received a gift Amen, and it's not simply talking about the gift of salvation. Although that's a wonderful gift It's the gift of God, which is eternal life. But here he's talking about spiritual gifts He talks to the church in Corinth. He talks in Romans About the spiritual gifts and he says as every man hath received the gift notice even so minister the same one to another And then notice how he refers to this This service or this ministry. He says as good stewards of the manifold grace of God The Bible tells us in 1st Corinthians chapter 2 that it's required in stewards that a man be found faithful and the reality is that God has been faithful and God has been gracious to give to us a spiritual gift and to impart to us grace and Then he says to us as the individual believers that we are to be good stewards of the manifold grace of God What are we doing with what God has entrusted us with? How are we using our talents and our gifts for the honor and glory of God verse 11? if any man speak Let him speak as the oracles of God If any man minister let him do it as of the ability which God giveth That God and all things may be glorified through Jesus Christ to whom be praise and dominion forever and ever Amen, here's a wonderful couple of truths from verse number 11 The Bible says that we're to serve God with our spiritual gift We're not to serve in such a way that we are to receive glory No, we're to serve so that he would receive the glory He says that if any man minister let him do it as of the ability which God giveth God is going to require of us based upon the ability that he has given to us and Yes, it is our responsibility to develop that to You know try to come to that place where we are Using and developing and being the best that we can be for the glory of God but the reality is it's all for the glory of God and He says to whom be praise and dominion forever and ever Amen You know when we serve the Lord It's so that God would be glorified Because if I recognize this evening that it's God who has enabled me if you recognize this evening that it's God who has enabled You and God who has gifted you and you're using it for the honor and glory of God Then when man applauds you simply reflect or deflect and say no to God be the glory Because without him truly as John as Jesus said in John without him I can do nothing The same is true of you this evening. You say but let me tell you about all the talents that I have Listen, let me tell you about the fact that God gave them to you Amen God gave them to us And so we see that this church is growing in their works and their charity in their service Notice the Bible says back in Revelation 2 in verse 19 as he goes through this process of listing this out. He says and Faith, I want you to think about faith just for a moment this evening The reality is that the Bible tells us repeatedly that the just shall live by Faith right. So what the Bible says the just shall live by faith. The Bible says that without faith it is Impossible to please God in Hebrews 11 in verse number 6 for he that cometh to God must believe that he is and that he is a Rewarder of them that diligently seek him We have the entirety of Hebrews chapter 11 that talks about by faith This person did this and by faith this person did this and really all that's taking place is the individuals that are mentioned in Hebrews chapter 11 Believed what God said Faith is an action. They took God at his word. They stepped out by faith Abraham went to a land that he did not know why because he believed God he had faith Noah built an ark that he did not know anything about with regard to rain and so on and so forth But he believed God In this evening as we begin to look at this idea of our faith and we understand the importance of having Faith and growing in our faith. How does our faith grow? Well, you know the answer Romans chapter number 10, so then faith cometh by hearing and hearing by the Word of God You know how your faith grows, you know how my faith grows It's through getting into the Bible and getting the Bible into us and we begin to learn About the character and nature of our God we begin to see What our God has done and what he's capable of doing and all of a sudden it begins to increase our faith It grows our faith. Have you ever heard somebody say well, I don't have their kind of faith Where did they get that faith? They got the faith by being in the book This evening we read about the church and Thessalonica. I mentioned that we'd reference them twice look in second Thessalonians Chapter number one and I want you to notice what the Bible says here in second Thessalonians chapter number one What a what a statement that's made about the church in Thessalonica With regard to their faith In second Thessalonians 1 in verse 3 the Bible says we are bound To thank God always for you brethren as it is meat Notice this because that your faith groweth Exceedingly The Charity of every one of you all toward each other Aboundeth we mentioned in the second point this evening of the church in Thyatira about their charity in here We find that even in the church of Thessalonica after they were encouraged in the first Letter in chapter 4 to increase more and more that the Bible says that their charity is abounding But it says that their faith is growing exceedingly You know this evening you can have faith that's growing exceedingly as you get into the Bible There's been a read about what God has done and about what God is able to do Our God is able to exceeding abundantly above all that we ask or think Consider that simple promise of Ephesians 3 and verse 20 and allow it to sink in tonight when you begin to read throughout the The Bible and you read of these great works of God and the Demonstrations of God's power it is designed so that you Would have faith that would grow so that my faith would grow so that I would recognize my God is able How many times has God put his people in situations that were difficult that were? Challenging that seemed as if there was no way out but God You read those words in Scripture so often, but God Because something changed God showed up. God did something miraculous I begin to think about the Apostle Paul in Acts 27 as they're there and they're traveling and they're dealing with a Storm that is contrary and they're tossed to and fro They don't see stars nor Sun nor moon for days and all hope that they should be saved is gone I mean they are in a a Terrible storm But God speaks to Paul And God tells Paul that they're gonna be delivered God tells Paul that everyone on board is going to be saved God tells Paul this message and Paul stands up and simply declares I believe God I believe God This evening this church in Thyatira their faith was growing because the Bible says that there at the end that the last to be more than the first and we see that they're growing in works and Charity and service and faith and then notice finally number five. It says and thy patience and thy patience this word patience is Defined and often translated dealing with our English idea of steadfastness can constancy and Endurance. I want you to think about the the word patience with regard to that understanding of definition of being steadfast of of being constant of Enduring through trials. I Heard someone say years ago, what does it take to stop you? The reality is that as God's people We're to continue to go forward we're to continue to to do what God has called us to do and we see this steadfastness that is mentioned this patience Endurance and constancy look at first Thessalonians. Sorry, excuse me first Corinthians chapter 15 and Ronnie challenged me last week on this verse of Scripture and you know, Ronnie. He's a he's got a Way of just kind of asking you a question and saying here's what he did to him He said hey first Corinthians 1558. Do you know it tell it to me? As we did right after the service last week and I was like, okay, let me see. Yep. Got it And you know, I mean I was completely in a different gear and everything but this verse of Scripture is so powerful Therefore, my beloved brethren,\" notice what he says, be steadfast, unmovable, always abounding in the work of the Lord. And then notice what he says, for as much as you know that your labor is not in vain in the Lord. They're being steadfast, their patience is being recognized, their constancy, their endurance. And we find that as Paul writes to the church in Corinth, he says, listen brethren, I mean 1 Corinthians 15 is the great resurrection chapter. And he concludes the section dealing with this mortal shall put on immortality and this corruption shall put on incorruption. And he deals with this great climactic passage of scripture with the resurrection and how wonderful it is that we are going to be changed in a moment. And he says, therefore, my beloved brethren, be steadfast, unmovable, always abounding in the work of the Lord. For as much as you know that your labor is not in vain in the Lord. You know, there are times in which you can feel like, is it even working? Is it even doing? Listen, no, it is working. God is at work. God does use his word. I met with someone this past week, and as I was chatting with them, and they shared a, not a huge measure of discouragement, but a desire and an uncertainty whether or not they've made any difference. And I said, listen, if you've shared the word of God with them, you can rest assured that God will use his word. It may not be in your timing, it may not be in my timing, but God will use his word. And we must understand that we are to be steadfast, we're to have that patience that is spoken of in the church in Thyatira, that constancy, that endurance, that faithfulness. I'm reminded of what is said to the, in Galatians chapter 6 to those churches in the region of Galatia. By the way, that was the first missionary journey these churches are written to. I'm not going to tell you all of them, Fernando, because you're supposed to study it. But the reality is that in Galatians 6 and verse number 9, the Bible says this, and let us not be weary in what? In well-doing. For in due season we shall reap if we faint not. Listen, we like it when the reaping comes. But you know when the reaping comes? After the sowing. Amen? After the labor. I've never been a farmer. I don't think I'm ever going to be a farmer. But the reality is that there's a whole lot of work that a farmer does before he ever gets to the reaping. The reaping is kind of the enjoyable part. By the way, we enjoy it when God allows us to reap souls, when we see fruit, we have that opportunity to share the gospel and see somebody trust Christ as their Savior. What a blessing that is. But oftentimes it's breaking up the fallow ground. Oftentimes it's plowing through the hard-hearted individuals in their stony ground, so to speak, and dealing with all of that. But God says that we're not to be weary in well-doing, that we're to have that faith and that expectation of reaping and understanding that God is at work. Unfortunately, as we look at the church in Thyatira, it doesn't end here, it continues. And he says in verse number 20, and it'll be our text for next week or next time, because next week we have a missionary, but in verse number 20, notwithstanding, I have a few things against thee. And let me just say this, they're heavy things that God has against the church at Thyatira. And here's the reality. Here's the reality tonight, and I'll mention it when we finish and pick back up with this message on Thyatira, but it's important to note it this evening. God examines every part. And God sees this good, but it doesn't mean that He ignores the bad. Because He's the one, according to verse 18, that has eyes like unto a flame of fire, and His feet are like fine brass. And He says you're doing this good, these things are growing, but I have some things against you. Because you've got some problems, and they're major problems in the church at Thyatira. I mean major significant problems that God says if you don't deal with it, you're going to face serious punishment. And what is the goal this evening? The goal is to have that balanced ministry that I spoke of by way of introduction tonight. That we understand that God is going to evaluate and examine every part. That we must understand the importance of, yes, we need to do these things, but at the same time we have to maintain doctrinal integrity. At the same time of doing the works and growing in our faith and all that we're doing and seeing new people added to a church and growing and discipling, that we cannot compromise on the doctrine. It's so vitally important that there's balance. And can I say it this way? It's so challenging. That's why we see in these letters to the churches where so often there's some good things and then there's some not so good things. And you know it in your own life personally as you're seeking to walk with God and please God. There are areas you say, man, I did pretty good in this area, but man, I'm suffering over here. And then we put some attention over here, and then we're struggling over here. And it's this constant battle of consistency in the Christian life. The church in Thyatira, for the main subject that we're dealing with this evening, they are commended for their growth in these areas in which they are growing. Oh, that God would help us, even as we evaluate our own lives personally and evaluate our church corporately, we'd have to ask ourselves the question, are we growing? We know that we're supposed to be. The question is not are we supposed to be growing? The question is, are we growing? Is my faith growing? Is my service growing? My works, my charity, my patience, is it growing? Let's pray together. Father, we love You. We thank You for loving us. Thank You for the day. Thank You for the blessings. We thank You for Your Word. I pray, Father, that You would help us to evaluate and examine our own lives individually and corporately as a church. And Lord, help us to please You. We want to have balance in ministry. We want to be doing what You've called us to do, pleasing You in every area of our lives and our ministry. I pray, Father, in this moment of invitation that You'd have Your will and way. I pray, God, that You would move in hearts and lives as only You can. And Lord, I pray that You'd bless the remainder of the evening with regard to the Bible quiz and also the birthday fellowship. I pray that You'd have Your will and way through all of those things and we'll thank You for it in Christ's name we pray. Would You stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano. As she does, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.2799999713897705,
      "text": " to Revelation chapter number two."
    },
    {
      "id": 1,
      "start": 2.2799999713897705,
      "end": 5.400000095367432,
      "text": " And this evening, as you see in the bulletin,"
    },
    {
      "id": 2,
      "start": 5.400000095367432,
      "end": 7.880000114440918,
      "text": " as I mentioned at the close of the service this morning,"
    },
    {
      "id": 3,
      "start": 7.880000114440918,
      "end": 9.880000114440918,
      "text": " we'll be dealing with the church at Thyatira,"
    },
    {
      "id": 4,
      "start": 9.880000114440918,
      "end": 13.079999923706055,
      "text": " but only the first aspect of the church."
    },
    {
      "id": 5,
      "start": 13.079999923706055,
      "end": 15.640000343322754,
      "text": " And we'll look at just a couple of verses this evening."
    },
    {
      "id": 6,
      "start": 15.640000343322754,
      "end": 19.0,
      "text": " The city of Thyatira was a relatively small city,"
    },
    {
      "id": 7,
      "start": 19.0,
      "end": 20.959999084472656,
      "text": " but it was wealthy."
    },
    {
      "id": 8,
      "start": 20.959999084472656,
      "end": 24.559999465942383,
      "text": " And they were well known for several different things,"
    },
    {
      "id": 9,
      "start": 24.559999465942383,
      "end": 27.440000534057617,
      "text": " but most, I guess, famous, if you will."
    },
    {
      "id": 10,
      "start": 27.440000534057617,
      "end": 32.119998931884766,
      "text": " They were known for their wool and for their dyeing industry."
    },
    {
      "id": 11,
      "start": 32.119998931884766,
      "end": 36.08000183105469,
      "text": " And Acts 16 and verse 14, we're told about Lydia."
    },
    {
      "id": 12,
      "start": 36.08000183105469,
      "end": 38.0,
      "text": " And she was a seller of purple,"
    },
    {
      "id": 13,
      "start": 38.0,
      "end": 39.959999084472656,
      "text": " and she was from the city of Thyatira."
    },
    {
      "id": 14,
      "start": 39.959999084472656,
      "end": 42.959999084472656,
      "text": " And we read about that in Acts 16 and verse 14."
    },
    {
      "id": 15,
      "start": 42.959999084472656,
      "end": 44.720001220703125,
      "text": " It gives us a little bit of insight"
    },
    {
      "id": 16,
      "start": 44.720001220703125,
      "end": 46.779998779296875,
      "text": " with regard to some of the commercial trade"
    },
    {
      "id": 17,
      "start": 46.779998779296875,
      "end": 49.0,
      "text": " and what they were very well known for."
    },
    {
      "id": 18,
      "start": 49.0,
      "end": 51.47999954223633,
      "text": " The city was located approximately 35 miles"
    },
    {
      "id": 19,
      "start": 51.47999954223633,
      "end": 54.0,
      "text": " southeast of Pergamos."
    },
    {
      "id": 20,
      "start": 54.0,
      "end": 56.880001068115234,
      "text": " Of course, we dealt with, last Sunday evening,"
    },
    {
      "id": 21,
      "start": 57.400001525878906,
      "end": 59.400001525878906,
      "text": " the message to the church at Pergamos."
    },
    {
      "id": 22,
      "start": 59.400001525878906,
      "end": 61.7599983215332,
      "text": " We find that the Lord, as we begin studying"
    },
    {
      "id": 23,
      "start": 61.7599983215332,
      "end": 64.08000183105469,
      "text": " this particular letter to the church at Thyatira,"
    },
    {
      "id": 24,
      "start": 64.08000183105469,
      "end": 68.12000274658203,
      "text": " once again, is going to emphasize a particular aspect"
    },
    {
      "id": 25,
      "start": 68.12000274658203,
      "end": 70.19999694824219,
      "text": " about his nature to this church."
    },
    {
      "id": 26,
      "start": 70.19999694824219,
      "end": 72.12000274658203,
      "text": " In verse 18, the Bible says,"
    },
    {
      "id": 27,
      "start": 72.12000274658203,
      "end": 74.83999633789062,
      "text": " and unto the angel of the church in Thyatira write,"
    },
    {
      "id": 28,
      "start": 74.83999633789062,
      "end": 77.0,
      "text": " these things saith the Son of God,"
    },
    {
      "id": 29,
      "start": 77.0,
      "end": 79.80000305175781,
      "text": " who hath his eyes like unto a flame of fire,"
    },
    {
      "id": 30,
      "start": 79.80000305175781,
      "end": 82.95999908447266,
      "text": " and his feet are like fine brass."
    },
    {
      "id": 31,
      "start": 82.95999908447266,
      "end": 85.66000366210938,
      "text": " And really, that reminds us of what had been said"
    },
    {
      "id": 32,
      "start": 85.66000366210938,
      "end": 88.0999984741211,
      "text": " in chapter one, verses 14 and 15."
    },
    {
      "id": 33,
      "start": 88.0999984741211,
      "end": 90.86000061035156,
      "text": " And when we see these two references,"
    },
    {
      "id": 34,
      "start": 90.86000061035156,
      "end": 93.62000274658203,
      "text": " to his eyes like unto a flame of fire,"
    },
    {
      "id": 35,
      "start": 93.62000274658203,
      "end": 95.45999908447266,
      "text": " and his feet are like fine brass,"
    },
    {
      "id": 36,
      "start": 95.45999908447266,
      "end": 99.9800033569336,
      "text": " it reminds us that he sees all and he judges all."
    },
    {
      "id": 37,
      "start": 99.9800033569336,
      "end": 103.18000030517578,
      "text": " And there is nothing hidden from our God."
    },
    {
      "id": 38,
      "start": 103.18000030517578,
      "end": 105.05999755859375,
      "text": " There's nothing in your life, my life,"
    },
    {
      "id": 39,
      "start": 105.05999755859375,
      "end": 109.13999938964844,
      "text": " or anyone else's life that is hidden from God."
    },
    {
      "id": 40,
      "start": 109.13999938964844,
      "end": 112.08000183105469,
      "text": " As much as man has tried to cover their sin,"
    },
    {
      "id": 41,
      "start": 112.08000183105469,
      "end": 115.05999755859375,
      "text": " as much as man has tried to hide things from God,"
    },
    {
      "id": 42,
      "start": 115.05999755859375,
      "end": 117.33999633789062,
      "text": " the reality is that God knows all things."
    },
    {
      "id": 43,
      "start": 117.33999633789062,
      "end": 120.62000274658203,
      "text": " God knows the thoughts of your heart, of my heart."
    },
    {
      "id": 44,
      "start": 120.62000274658203,
      "end": 123.33999633789062,
      "text": " And we are reminded that not only does he see all,"
    },
    {
      "id": 45,
      "start": 123.33999633789062,
      "end": 124.77999877929688,
      "text": " but he judges all."
    },
    {
      "id": 46,
      "start": 124.77999877929688,
      "end": 127.9000015258789,
      "text": " He is the judge of the entire earth."
    },
    {
      "id": 47,
      "start": 127.9000015258789,
      "end": 129.89999389648438,
      "text": " We find that as we look at this letter"
    },
    {
      "id": 48,
      "start": 129.89999389648438,
      "end": 131.3800048828125,
      "text": " to the church in Thyatira,"
    },
    {
      "id": 49,
      "start": 131.3800048828125,
      "end": 134.10000610351562,
      "text": " it is this letter that is the longest"
    },
    {
      "id": 50,
      "start": 134.10000610351562,
      "end": 136.5800018310547,
      "text": " of the seven letters that we read"
    },
    {
      "id": 51,
      "start": 136.5800018310547,
      "end": 139.66000366210938,
      "text": " in Revelation 2 and Revelation 3."
    },
    {
      "id": 52,
      "start": 139.66000366210938,
      "end": 141.97999572753906,
      "text": " And we find that with the length of this letter,"
    },
    {
      "id": 53,
      "start": 141.97999572753906,
      "end": 143.05999755859375,
      "text": " that's one of the reasons"
    },
    {
      "id": 54,
      "start": 143.05999755859375,
      "end": 144.74000549316406,
      "text": " that we're only gonna focus tonight"
    },
    {
      "id": 55,
      "start": 145.4199981689453,
      "end": 146.89999389648438,
      "text": " on just a couple of the verses,"
    },
    {
      "id": 56,
      "start": 146.89999389648438,
      "end": 148.5399932861328,
      "text": " because we'll have a multi-part"
    },
    {
      "id": 57,
      "start": 148.5399932861328,
      "end": 152.10000610351562,
      "text": " as we try to make our way through this particular letter."
    },
    {
      "id": 58,
      "start": 152.10000610351562,
      "end": 153.94000244140625,
      "text": " It's very interesting as we've studied"
    },
    {
      "id": 59,
      "start": 153.94000244140625,
      "end": 156.5,
      "text": " through these letters up to this point,"
    },
    {
      "id": 60,
      "start": 156.5,
      "end": 158.74000549316406,
      "text": " and I'll say it my way of introduction,"
    },
    {
      "id": 61,
      "start": 158.74000549316406,
      "end": 162.83999633789062,
      "text": " we begin to think about a church under the evaluation,"
    },
    {
      "id": 62,
      "start": 162.83999633789062,
      "end": 165.25999450683594,
      "text": " the examination of the Lord Jesus Christ,"
    },
    {
      "id": 63,
      "start": 165.25999450683594,
      "end": 166.77999877929688,
      "text": " who is the head of the church."
    },
    {
      "id": 64,
      "start": 166.77999877929688,
      "end": 168.33999633789062,
      "text": " We find that he's examining,"
    },
    {
      "id": 65,
      "start": 168.33999633789062,
      "end": 170.39999389648438,
      "text": " he's evaluating the ministries"
    },
    {
      "id": 66,
      "start": 170.39999389648438,
      "end": 171.83999633789062,
      "text": " of these particular churches."
    },
    {
      "id": 67,
      "start": 171.83999633789062,
      "end": 175.0,
      "text": " Of course, we understand that they are literal churches"
    },
    {
      "id": 68,
      "start": 175.0,
      "end": 177.1199951171875,
      "text": " that existed at the time of the writing."
    },
    {
      "id": 69,
      "start": 177.1199951171875,
      "end": 181.16000366210938,
      "text": " They are local bodies of believers."
    },
    {
      "id": 70,
      "start": 181.16000366210938,
      "end": 184.8800048828125,
      "text": " And we find that as he would go through the process"
    },
    {
      "id": 71,
      "start": 184.8800048828125,
      "end": 186.8800048828125,
      "text": " of having these letters sent"
    },
    {
      "id": 72,
      "start": 186.8800048828125,
      "end": 189.0399932861328,
      "text": " and evaluating the ministry,"
    },
    {
      "id": 73,
      "start": 189.0399932861328,
      "end": 190.55999755859375,
      "text": " that you find many times,"
    },
    {
      "id": 74,
      "start": 190.55999755859375,
      "end": 191.60000610351562,
      "text": " and it's quite interesting"
    },
    {
      "id": 75,
      "start": 191.60000610351562,
      "end": 193.72000122070312,
      "text": " as we look at the church in Thyatira,"
    },
    {
      "id": 76,
      "start": 193.72000122070312,
      "end": 196.67999267578125,
      "text": " that there's really almost a direct opposite"
    },
    {
      "id": 77,
      "start": 196.67999267578125,
      "end": 199.0,
      "text": " with what you find here in the church at Thyatira"
    },
    {
      "id": 78,
      "start": 199.0,
      "end": 201.05999755859375,
      "text": " versus the church in Ephesus."
    },
    {
      "id": 79,
      "start": 201.05999755859375,
      "end": 204.6999969482422,
      "text": " We find that the church in Ephesus was,"
    },
    {
      "id": 80,
      "start": 204.6999969482422,
      "end": 209.6999969482422,
      "text": " they could not, they would not allow for any type of evil."
    },
    {
      "id": 81,
      "start": 210.89999389648438,
      "end": 213.02000427246094,
      "text": " They were very sound"
    },
    {
      "id": 82,
      "start": 213.02000427246094,
      "end": 215.77999877929688,
      "text": " with regard to their doctrine and what have you,"
    },
    {
      "id": 83,
      "start": 215.77999877929688,
      "end": 217.66000366210938,
      "text": " but they had left their first love."
    },
    {
      "id": 84,
      "start": 217.66000366210938,
      "end": 220.86000061035156,
      "text": " They had departed from their first works."
    },
    {
      "id": 85,
      "start": 220.86000061035156,
      "end": 222.82000732421875,
      "text": " And yet we find the church in Thyatira"
    },
    {
      "id": 86,
      "start": 222.82000732421875,
      "end": 224.33999633789062,
      "text": " where they're growing in their works"
    },
    {
      "id": 87,
      "start": 224.33999633789062,
      "end": 226.5399932861328,
      "text": " and they're being commended for these things,"
    },
    {
      "id": 88,
      "start": 226.5399932861328,
      "end": 229.77999877929688,
      "text": " but yet doctrinal error is coming in."
    },
    {
      "id": 89,
      "start": 229.77999877929688,
      "end": 231.22000122070312,
      "text": " When we begin to think about these things"
    },
    {
      "id": 90,
      "start": 231.22000122070312,
      "end": 232.97999572753906,
      "text": " as you look through these letters,"
    },
    {
      "id": 91,
      "start": 232.97999572753906,
      "end": 236.5399932861328,
      "text": " we really are reminded that the goal in ministry"
    },
    {
      "id": 92,
      "start": 236.5399932861328,
      "end": 238.33999633789062,
      "text": " is to be balanced."
    },
    {
      "id": 93,
      "start": 238.33999633789062,
      "end": 240.74000549316406,
      "text": " And how important it is that we're balanced"
    },
    {
      "id": 94,
      "start": 240.74000549316406,
      "end": 243.77999877929688,
      "text": " in our own lives individually in our homes,"
    },
    {
      "id": 95,
      "start": 243.77999877929688,
      "end": 245.5,
      "text": " but in our churches,"
    },
    {
      "id": 96,
      "start": 245.5,
      "end": 249.60000610351562,
      "text": " where we have the right position and the right disposition."
    },
    {
      "id": 97,
      "start": 249.60000610351562,
      "end": 253.82000732421875,
      "text": " We believe the right thing and we behave the right way."
    },
    {
      "id": 98,
      "start": 253.82000732421875,
      "end": 256.29998779296875,
      "text": " We are doing what God's called us to do"
    },
    {
      "id": 99,
      "start": 256.29998779296875,
      "end": 261.1000061035156,
      "text": " while holding firm to the truth that God has given to us."
    },
    {
      "id": 100,
      "start": 261.1000061035156,
      "end": 263.3800048828125,
      "text": " And so often, as I mentioned last week,"
    },
    {
      "id": 101,
      "start": 263.3800048828125,
      "end": 267.739990234375,
      "text": " with regard to the temptation for compromise,"
    },
    {
      "id": 102,
      "start": 267.739990234375,
      "end": 272.5,
      "text": " so often there's some area that we begin to falter in"
    },
    {
      "id": 103,
      "start": 272.5,
      "end": 274.82000732421875,
      "text": " and we might keep things going well here"
    },
    {
      "id": 104,
      "start": 274.82000732421875,
      "end": 277.739990234375,
      "text": " and we're staying sound here, but we're compromising here."
    },
    {
      "id": 105,
      "start": 277.739990234375,
      "end": 281.29998779296875,
      "text": " And there's this need for balance in ministry"
    },
    {
      "id": 106,
      "start": 281.29998779296875,
      "end": 284.3999938964844,
      "text": " and that we understand that everything is important."
    },
    {
      "id": 107,
      "start": 284.3999938964844,
      "end": 285.6600036621094,
      "text": " There's not certain things to say,"
    },
    {
      "id": 108,
      "start": 286.6199951171875,
      "end": 288.3399963378906,
      "text": " we're just gonna focus on these things"
    },
    {
      "id": 109,
      "start": 288.3399963378906,
      "end": 289.67999267578125,
      "text": " and let all these things slide."
    },
    {
      "id": 110,
      "start": 289.67999267578125,
      "end": 291.5799865722656,
      "text": " We're gonna find ourselves in trouble."
    },
    {
      "id": 111,
      "start": 291.5799865722656,
      "end": 294.8999938964844,
      "text": " And we find here this evening that as the Lord Jesus Christ"
    },
    {
      "id": 112,
      "start": 294.8999938964844,
      "end": 298.4200134277344,
      "text": " is having this letter written to the church in Thyatira,"
    },
    {
      "id": 113,
      "start": 298.4200134277344,
      "end": 301.3800048828125,
      "text": " he says in verse 19, as we have noted"
    },
    {
      "id": 114,
      "start": 301.3800048828125,
      "end": 306.2200012207031,
      "text": " in each of these letters, I know thy works."
    },
    {
      "id": 115,
      "start": 306.2200012207031,
      "end": 309.0199890136719,
      "text": " Notice with me the entirety of verse 19."
    },
    {
      "id": 116,
      "start": 309.0199890136719,
      "end": 312.44000244140625,
      "text": " He says, I know thy works and charity and service and faith"
    },
    {
      "id": 117,
      "start": 312.44000244140625,
      "end": 315.05999755859375,
      "text": " and thy patience and thy works."
    },
    {
      "id": 118,
      "start": 315.4200134277344,
      "end": 316.5,
      "text": " He says it a second time."
    },
    {
      "id": 119,
      "start": 316.5,
      "end": 319.17999267578125,
      "text": " And notice this last phrase of verse number 19"
    },
    {
      "id": 120,
      "start": 319.17999267578125,
      "end": 322.6600036621094,
      "text": " and the last to be more than the first."
    },
    {
      "id": 121,
      "start": 322.6600036621094,
      "end": 325.7799987792969,
      "text": " As we begin to examine that phrase at the end of verse 19,"
    },
    {
      "id": 122,
      "start": 325.7799987792969,
      "end": 329.3399963378906,
      "text": " it would seem as if the Lord is saying to this church"
    },
    {
      "id": 123,
      "start": 329.3399963378906,
      "end": 332.29998779296875,
      "text": " in these five areas that are mentioned in verse 19"
    },
    {
      "id": 124,
      "start": 332.29998779296875,
      "end": 335.70001220703125,
      "text": " that they were growing, that they were progressing"
    },
    {
      "id": 125,
      "start": 335.70001220703125,
      "end": 337.8999938964844,
      "text": " in these particular areas because he says"
    },
    {
      "id": 126,
      "start": 337.8999938964844,
      "end": 340.6199951171875,
      "text": " that the last is more than the first."
    },
    {
      "id": 127,
      "start": 340.6199951171875,
      "end": 342.7799987792969,
      "text": " It's interesting because again, as I mentioned already"
    },
    {
      "id": 128,
      "start": 342.7799987792969,
      "end": 345.5799865722656,
      "text": " to the church at Ephesus, in verse number five"
    },
    {
      "id": 129,
      "start": 345.5799865722656,
      "end": 348.1199951171875,
      "text": " of chapter two, the Bible says, remember therefore"
    },
    {
      "id": 130,
      "start": 348.1199951171875,
      "end": 350.94000244140625,
      "text": " from whence thou art fallen and repent."
    },
    {
      "id": 131,
      "start": 350.94000244140625,
      "end": 354.5799865722656,
      "text": " And notice where it says, and do the first works"
    },
    {
      "id": 132,
      "start": 354.5799865722656,
      "end": 356.2200012207031,
      "text": " or else I will come unto thee quickly"
    },
    {
      "id": 133,
      "start": 356.2200012207031,
      "end": 358.3999938964844,
      "text": " and will remove thy candlestick out of his place"
    },
    {
      "id": 134,
      "start": 358.3999938964844,
      "end": 361.17999267578125,
      "text": " except thou repent."
    },
    {
      "id": 135,
      "start": 361.17999267578125,
      "end": 363.6000061035156,
      "text": " As we look at the church in Thyatira, he says,"
    },
    {
      "id": 136,
      "start": 363.6000061035156,
      "end": 367.6199951171875,
      "text": " I know thy works and charity and service and faith"
    },
    {
      "id": 137,
      "start": 367.6199951171875,
      "end": 372.0,
      "text": " and thy patience and thy works and the last to be more"
    },
    {
      "id": 138,
      "start": 372.0,
      "end": 373.20001220703125,
      "text": " than the first."
    },
    {
      "id": 139,
      "start": 373.20001220703125,
      "end": 376.0400085449219,
      "text": " The reality is that God's people are to be growing."
    },
    {
      "id": 140,
      "start": 377.3599853515625,
      "end": 378.20001220703125,
      "text": " Amen?"
    },
    {
      "id": 141,
      "start": 378.20001220703125,
      "end": 379.0199890136719,
      "text": " We're to grow."
    },
    {
      "id": 142,
      "start": 379.0199890136719,
      "end": 381.20001220703125,
      "text": " The Bible teaches us as newborn babes,"
    },
    {
      "id": 143,
      "start": 381.20001220703125,
      "end": 382.9200134277344,
      "text": " desire the sincere milk of the word"
    },
    {
      "id": 144,
      "start": 382.9200134277344,
      "end": 386.3999938964844,
      "text": " that ye may grow thereby."
    },
    {
      "id": 145,
      "start": 386.3999938964844,
      "end": 388.70001220703125,
      "text": " Is that what first Peter two verse number two says?"
    },
    {
      "id": 146,
      "start": 388.70001220703125,
      "end": 390.79998779296875,
      "text": " When Peter writes in second Peter chapter three"
    },
    {
      "id": 147,
      "start": 390.79998779296875,
      "end": 394.3800048828125,
      "text": " in verse 18, but grow in grace and knowledge"
    },
    {
      "id": 148,
      "start": 394.3800048828125,
      "end": 396.3999938964844,
      "text": " of our Lord and savior Jesus Christ."
    },
    {
      "id": 149,
      "start": 396.3999938964844,
      "end": 399.67999267578125,
      "text": " And the Christian life is about growth."
    },
    {
      "id": 150,
      "start": 399.67999267578125,
      "end": 401.9599914550781,
      "text": " And the thing that's amazing about the Christian life"
    },
    {
      "id": 151,
      "start": 402.79998779296875,
      "end": 405.3999938964844,
      "text": " is that your growth and my growth is not going"
    },
    {
      "id": 152,
      "start": 405.3999938964844,
      "end": 409.7200012207031,
      "text": " to be restricted to some growth chart"
    },
    {
      "id": 153,
      "start": 409.7200012207031,
      "end": 411.239990234375,
      "text": " that somebody provides."
    },
    {
      "id": 154,
      "start": 411.239990234375,
      "end": 414.5199890136719,
      "text": " No, we understand that we can grow as quickly"
    },
    {
      "id": 155,
      "start": 414.5199890136719,
      "end": 415.3599853515625,
      "text": " as we wanna grow."
    },
    {
      "id": 156,
      "start": 415.3599853515625,
      "end": 417.9599914550781,
      "text": " We can be as close to God as we wanna be."
    },
    {
      "id": 157,
      "start": 417.9599914550781,
      "end": 420.4800109863281,
      "text": " We can be as spiritual as we wanna be."
    },
    {
      "id": 158,
      "start": 420.4800109863281,
      "end": 422.760009765625,
      "text": " And the reality is that as Paul is writing"
    },
    {
      "id": 159,
      "start": 422.760009765625,
      "end": 425.55999755859375,
      "text": " to the believers in the book of Hebrews,"
    },
    {
      "id": 160,
      "start": 425.55999755859375,
      "end": 429.0799865722656,
      "text": " he tells us for in the time that you ought to be teachers."
    },
    {
      "id": 161,
      "start": 429.0799865722656,
      "end": 432.2799987792969,
      "text": " Why does he use that phraseology in Hebrews five"
    },
    {
      "id": 162,
      "start": 432.2799987792969,
      "end": 433.4800109863281,
      "text": " in verse number 12?"
    },
    {
      "id": 163,
      "start": 433.4800109863281,
      "end": 435.79998779296875,
      "text": " Because they should have been growing."
    },
    {
      "id": 164,
      "start": 436.9200134277344,
      "end": 439.55999755859375,
      "text": " For in the time that you ought to be teachers,"
    },
    {
      "id": 165,
      "start": 439.55999755859375,
      "end": 443.1199951171875,
      "text": " he says to them, you have need that one teach you again,"
    },
    {
      "id": 166,
      "start": 443.1199951171875,
      "end": 446.55999755859375,
      "text": " which be the first principles of the oracles of God"
    },
    {
      "id": 167,
      "start": 446.55999755859375,
      "end": 449.8399963378906,
      "text": " and are become such as have need of milk"
    },
    {
      "id": 168,
      "start": 449.8399963378906,
      "end": 452.239990234375,
      "text": " and not of strong meat."
    },
    {
      "id": 169,
      "start": 452.239990234375,
      "end": 455.05999755859375,
      "text": " And so what is Paul saying to these believers"
    },
    {
      "id": 170,
      "start": 455.05999755859375,
      "end": 456.760009765625,
      "text": " that he's addressing in the book of Hebrews?"
    },
    {
      "id": 171,
      "start": 456.760009765625,
      "end": 460.32000732421875,
      "text": " He's saying to them, you ought to be growing,"
    },
    {
      "id": 172,
      "start": 460.32000732421875,
      "end": 461.4200134277344,
      "text": " but you're not."
    },
    {
      "id": 173,
      "start": 462.3999938964844,
      "end": 465.7200012207031,
      "text": " And so growth is expected in the Christian life."
    },
    {
      "id": 174,
      "start": 465.7200012207031,
      "end": 467.3999938964844,
      "text": " Is that a fair statement this evening?"
    },
    {
      "id": 175,
      "start": 467.3999938964844,
      "end": 471.4800109863281,
      "text": " Growth is expected in the Christian life."
    },
    {
      "id": 176,
      "start": 471.4800109863281,
      "end": 474.4800109863281,
      "text": " If the church is a body of believers,"
    },
    {
      "id": 177,
      "start": 474.4800109863281,
      "end": 478.0400085449219,
      "text": " if the church, it's not the building, it's the people,"
    },
    {
      "id": 178,
      "start": 478.0400085449219,
      "end": 479.79998779296875,
      "text": " the church is a called out assembly."
    },
    {
      "id": 179,
      "start": 479.79998779296875,
      "end": 483.4200134277344,
      "text": " And if the church is made up of individual saved"
    },
    {
      "id": 180,
      "start": 483.4200134277344,
      "end": 486.3999938964844,
      "text": " and baptized believers who have voluntarily"
    },
    {
      "id": 181,
      "start": 487.0,
      "end": 488.3599853515625,
      "text": " joined themselves together for the carrying out"
    },
    {
      "id": 182,
      "start": 488.3599853515625,
      "end": 491.8800048828125,
      "text": " of the great commission, if that is a simple definition"
    },
    {
      "id": 183,
      "start": 491.8800048828125,
      "end": 494.239990234375,
      "text": " this evening of the church, the local church,"
    },
    {
      "id": 184,
      "start": 494.239990234375,
      "end": 497.29998779296875,
      "text": " and we believe that as Christians were to be growing,"
    },
    {
      "id": 185,
      "start": 497.29998779296875,
      "end": 499.44000244140625,
      "text": " then we could easily say this tonight"
    },
    {
      "id": 186,
      "start": 499.44000244140625,
      "end": 501.5199890136719,
      "text": " that churches should be growing."
    },
    {
      "id": 187,
      "start": 503.70001220703125,
      "end": 505.20001220703125,
      "text": " Churches should be growing."
    },
    {
      "id": 188,
      "start": 505.20001220703125,
      "end": 507.1199951171875,
      "text": " Here's one of the problems with growth."
    },
    {
      "id": 189,
      "start": 507.1199951171875,
      "end": 510.5400085449219,
      "text": " There's been such an emphasis over the last couple"
    },
    {
      "id": 190,
      "start": 510.5400085449219,
      "end": 513.3599853515625,
      "text": " of generations with regard to church growth"
    },
    {
      "id": 191,
      "start": 513.3599853515625,
      "end": 516.52001953125,
      "text": " being strictly numerical."
    },
    {
      "id": 192,
      "start": 516.52001953125,
      "end": 519.239990234375,
      "text": " And there's this numerical focus and emphasis"
    },
    {
      "id": 193,
      "start": 519.239990234375,
      "end": 520.0800170898438,
      "text": " on church growth."
    },
    {
      "id": 194,
      "start": 520.0800170898438,
      "end": 522.3200073242188,
      "text": " Let me be quick to say this,"
    },
    {
      "id": 195,
      "start": 522.3200073242188,
      "end": 525.0399780273438,
      "text": " I'm all for the church growing numerically."
    },
    {
      "id": 196,
      "start": 525.0399780273438,
      "end": 526.719970703125,
      "text": " It means that you're reaching people."
    },
    {
      "id": 197,
      "start": 526.719970703125,
      "end": 528.47998046875,
      "text": " It means that you're investing in people"
    },
    {
      "id": 198,
      "start": 528.47998046875,
      "end": 530.8800048828125,
      "text": " and I'm all for the church growing numerically,"
    },
    {
      "id": 199,
      "start": 530.8800048828125,
      "end": 532.8800048828125,
      "text": " but the reality is that a church needs"
    },
    {
      "id": 200,
      "start": 532.8800048828125,
      "end": 535.1199951171875,
      "text": " to be growing spiritually."
    },
    {
      "id": 201,
      "start": 535.1199951171875,
      "end": 539.5599975585938,
      "text": " It's not one or the other, it should be both."
    },
    {
      "id": 202,
      "start": 539.5599975585938,
      "end": 541.8400268554688,
      "text": " A church should be growing numerically"
    },
    {
      "id": 203,
      "start": 541.8800048828125,
      "end": 544.52001953125,
      "text": " and a church should be growing spiritually."
    },
    {
      "id": 204,
      "start": 544.52001953125,
      "end": 546.7999877929688,
      "text": " And it's so important when we understand the truth"
    },
    {
      "id": 205,
      "start": 546.7999877929688,
      "end": 549.0999755859375,
      "text": " of the great commission when the Lord Jesus Christ"
    },
    {
      "id": 206,
      "start": 549.0999755859375,
      "end": 552.0,
      "text": " before his ascension, he gives the great commission"
    },
    {
      "id": 207,
      "start": 552.0,
      "end": 555.8800048828125,
      "text": " in its most detailed setting in Matthew chapter 28"
    },
    {
      "id": 208,
      "start": 555.8800048828125,
      "end": 558.3200073242188,
      "text": " and he lays out three aspects with regard"
    },
    {
      "id": 209,
      "start": 558.3200073242188,
      "end": 561.2000122070312,
      "text": " to the great commission, not only preaching the gospel"
    },
    {
      "id": 210,
      "start": 561.2000122070312,
      "end": 564.280029296875,
      "text": " so that people could be saved, not only baptizing them"
    },
    {
      "id": 211,
      "start": 564.280029296875,
      "end": 566.4400024414062,
      "text": " in the name of the Father, the Son, and the Holy Ghost,"
    },
    {
      "id": 212,
      "start": 566.4400024414062,
      "end": 570.1199951171875,
      "text": " but teaching them to observe all things whatsoever"
    },
    {
      "id": 213,
      "start": 570.1199951171875,
      "end": 574.3200073242188,
      "text": " I have commanded you and we find that that third aspect"
    },
    {
      "id": 214,
      "start": 574.3200073242188,
      "end": 579.3200073242188,
      "text": " of discipleship is so vital for a local church."
    },
    {
      "id": 215,
      "start": 579.5599975585938,
      "end": 581.47998046875,
      "text": " And so a church ought to be growing."
    },
    {
      "id": 216,
      "start": 581.47998046875,
      "end": 584.8800048828125,
      "text": " The church in Thyatira, as we look at verse number 19,"
    },
    {
      "id": 217,
      "start": 584.8800048828125,
      "end": 586.4000244140625,
      "text": " it seems as if they're growing"
    },
    {
      "id": 218,
      "start": 586.4000244140625,
      "end": 588.4000244140625,
      "text": " and we'll reference these five areas."
    },
    {
      "id": 219,
      "start": 588.4000244140625,
      "end": 591.02001953125,
      "text": " Another church that we find in the New Testament"
    },
    {
      "id": 220,
      "start": 591.02001953125,
      "end": 593.47998046875,
      "text": " that will be referenced a couple of times this evening"
    },
    {
      "id": 221,
      "start": 593.47998046875,
      "end": 597.0800170898438,
      "text": " that was a growing church is the church in Thessalonica."
    },
    {
      "id": 222,
      "start": 597.0800170898438,
      "end": 599.0399780273438,
      "text": " And that church is growing."
    },
    {
      "id": 223,
      "start": 599.0399780273438,
      "end": 599.8800048828125,
      "text": " It's quite."
    },
    {
      "id": 0,
      "start": 599.8800048828125,
      "end": 604.8400049209595,
      "text": " First thing is you study 1st and 2nd Thessalonians and you make some very obvious comparisons"
    },
    {
      "id": 1,
      "start": 604.8400049209595,
      "end": 609.2400045394897,
      "text": " between the two books and you see that the Bible speaks about how they're growing."
    },
    {
      "id": 2,
      "start": 609.2400045394897,
      "end": 613.0400047302246,
      "text": " In fact, your faith groweth exceedingly."
    },
    {
      "id": 3,
      "start": 613.0400047302246,
      "end": 619.0400047302246,
      "text": " What a blessing to be hearing those words and to be the reality of a church that is"
    },
    {
      "id": 4,
      "start": 619.0400047302246,
      "end": 622.160005569458,
      "text": " growing in that regard."
    },
    {
      "id": 5,
      "start": 622.160005569458,
      "end": 626.1200046539307,
      "text": " And so this evening as we look at this passage of Scripture we note these five areas."
    },
    {
      "id": 6,
      "start": 626.1200046539307,
      "end": 627.7000045776367,
      "text": " Note them with me quickly."
    },
    {
      "id": 7,
      "start": 627.7000045776367,
      "end": 630.9200057983398,
      "text": " Number one, they were growing in works."
    },
    {
      "id": 8,
      "start": 630.9200057983398,
      "end": 635.7400054931641,
      "text": " Now understand this evening, and it's a Sunday night so I believe that we'd all be aware"
    },
    {
      "id": 9,
      "start": 635.7400054931641,
      "end": 639.5400047302246,
      "text": " of this truth already, but it's important to make it known."
    },
    {
      "id": 10,
      "start": 639.5400047302246,
      "end": 643.5000038146973,
      "text": " The reality is that works cannot save us."
    },
    {
      "id": 11,
      "start": 643.5000038146973,
      "end": 644.8600044250488,
      "text": " Amen?"
    },
    {
      "id": 12,
      "start": 644.8600044250488,
      "end": 646.5000038146973,
      "text": " Works cannot save us."
    },
    {
      "id": 13,
      "start": 646.5000038146973,
      "end": 651.3400039672852,
      "text": " Not only can they not save us, but they can't keep us saved."
    },
    {
      "id": 14,
      "start": 651.3400039672852,
      "end": 654.0600051879883,
      "text": " Not by works of righteousness which we have done."
    },
    {
      "id": 15,
      "start": 654.0600051879883,
      "end": 658.0600051879883,
      "text": " For by grace are you saved through faith and that not of yourselves is the gift of"
    },
    {
      "id": 16,
      "start": 658.0600051879883,
      "end": 659.0600051879883,
      "text": " God."
    },
    {
      "id": 17,
      "start": 659.0600051879883,
      "end": 662.4200057983398,
      "text": " Not of works, lest any man should boast."
    },
    {
      "id": 18,
      "start": 662.4200057983398,
      "end": 668.2600021362305,
      "text": " And we find that even as we study the Scriptures and as Brianna sang that song this morning"
    },
    {
      "id": 19,
      "start": 668.2600021362305,
      "end": 674.640007019043,
      "text": " and I referenced it from the truth from Isaiah, that all of our good works are as filthy rags."
    },
    {
      "id": 20,
      "start": 674.640007019043,
      "end": 679.620002746582,
      "text": " But the reality is that after we're saved, when we read Ephesians chapter 2 verses 8"
    },
    {
      "id": 21,
      "start": 679.620002746582,
      "end": 685.4600067138672,
      "text": " and 9 which I quoted a minute ago, the Bible goes on to say that we are His workmanship"
    },
    {
      "id": 22,
      "start": 685.4600067138672,
      "end": 694.0600051879883,
      "text": " created in Christ Jesus and the Bible says this, unto good works which God hath before"
    },
    {
      "id": 23,
      "start": 694.0600051879883,
      "end": 698.5400085449219,
      "text": " ordained that we should walk in them."
    },
    {
      "id": 24,
      "start": 698.5400085449219,
      "end": 699.5400085449219,
      "text": " In what?"
    },
    {
      "id": 25,
      "start": 699.5400085449219,
      "end": 700.5400085449219,
      "text": " In the good works."
    },
    {
      "id": 26,
      "start": 700.5400085449219,
      "end": 705.0600051879883,
      "text": " Again, as you study the book of Ephesians and that's Ephesians chapter 2 and verse"
    },
    {
      "id": 27,
      "start": 705.0600051879883,
      "end": 709.9800033569336,
      "text": " number 10, it's very clear throughout the six chapters in the book of Ephesians that"
    },
    {
      "id": 28,
      "start": 709.9800033569336,
      "end": 717.3000030517578,
      "text": " our works have nothing to do with our standing before God as far as being saved."
    },
    {
      "id": 29,
      "start": 717.3000030517578,
      "end": 720.9000015258789,
      "text": " Our position is secure in Christ."
    },
    {
      "id": 30,
      "start": 720.9000015258789,
      "end": 726.140007019043,
      "text": " We're saved by the grace of God, by the shed blood of the Lord Jesus Christ, His death,"
    },
    {
      "id": 31,
      "start": 726.140007019043,
      "end": 728.3800048828125,
      "text": " burial, and resurrection."
    },
    {
      "id": 32,
      "start": 728.3800048828125,
      "end": 732.8600006103516,
      "text": " But because we are saved, we ought to do good works."
    },
    {
      "id": 33,
      "start": 732.8600006103516,
      "end": 735.7799987792969,
      "text": " We ought to be involved in this area of works."
    },
    {
      "id": 34,
      "start": 735.7799987792969,
      "end": 741.260009765625,
      "text": " Titus chapter 2 says this, in fact if you were to study through the three chapters in"
    },
    {
      "id": 35,
      "start": 741.260009765625,
      "end": 745.2200012207031,
      "text": " the book of Titus, there's emphasis with regard to works."
    },
    {
      "id": 36,
      "start": 745.2200012207031,
      "end": 751.0200042724609,
      "text": " But notice Titus 2, the Bible says this in verse number 11, Titus chapter 2 and verse"
    },
    {
      "id": 37,
      "start": 751.0200042724609,
      "end": 757.1399993896484,
      "text": " number 11, for the grace of God that bringeth salvation hath appeared to all men."
    },
    {
      "id": 38,
      "start": 757.1399993896484,
      "end": 758.9000091552734,
      "text": " Aren't you thankful for that truth?"
    },
    {
      "id": 39,
      "start": 758.9400024414062,
      "end": 764.7799987792969,
      "text": " I'm thankful that God's grace and it brings salvation, that it's appeared to all men."
    },
    {
      "id": 40,
      "start": 764.7799987792969,
      "end": 770.0200042724609,
      "text": " And then notice what God's grace teaches us according to verse 12, teaching us that denying"
    },
    {
      "id": 41,
      "start": 770.0200042724609,
      "end": 776.9800109863281,
      "text": " ungodliness and worldly lusts, we should live soberly, righteously, and godly in this present"
    },
    {
      "id": 42,
      "start": 776.9800109863281,
      "end": 778.8200073242188,
      "text": " world."
    },
    {
      "id": 43,
      "start": 778.8200073242188,
      "end": 783.8600006103516,
      "text": " Then notice verse 13, looking for that blessed hope and the glorious appearing of the great"
    },
    {
      "id": 44,
      "start": 783.8600006103516,
      "end": 786.2200012207031,
      "text": " God and our Savior Jesus Christ."
    },
    {
      "id": 45,
      "start": 786.5400085449219,
      "end": 792.1399993896484,
      "text": " Think about the summary of these three verses, that the grace of God that brings salvation"
    },
    {
      "id": 46,
      "start": 792.1399993896484,
      "end": 796.7400054931641,
      "text": " appeared to all men and it teaches us how we're to live our lives."
    },
    {
      "id": 47,
      "start": 796.7400054931641,
      "end": 801.8600006103516,
      "text": " This idea in Jude where they've turned the grace of God into lasciviousness is completely"
    },
    {
      "id": 48,
      "start": 801.8600006103516,
      "end": 807.4600067138672,
      "text": " contrary to what we find the Bible teaching us in Titus 2 in verse number 12."
    },
    {
      "id": 49,
      "start": 807.4600067138672,
      "end": 812.7799987792969,
      "text": " God's grace does not say go out and sin because where sin abounds, grace is more."
    },
    {
      "id": 50,
      "start": 812.7799987792969,
      "end": 816.3800048828125,
      "text": " No, it says that we're to live godly."
    },
    {
      "id": 51,
      "start": 816.3800048828125,
      "end": 822.1000061035156,
      "text": " We find that He says that we're to look for the return of our Lord and Savior Jesus Christ,"
    },
    {
      "id": 52,
      "start": 822.1000061035156,
      "end": 824.9800109863281,
      "text": " and I'm so thankful that one day He's coming back."
    },
    {
      "id": 53,
      "start": 824.9800109863281,
      "end": 833.1800079345703,
      "text": " But notice with me in verse 14, who gave Himself for us that He might redeem us from all iniquity"
    },
    {
      "id": 54,
      "start": 833.1800079345703,
      "end": 838.1000061035156,
      "text": " and purify unto Himself a peculiar people."
    },
    {
      "id": 55,
      "start": 838.1000061035156,
      "end": 842.3400115966797,
      "text": " Notice what they're to be zealous of, zealous of good works."
    },
    {
      "id": 56,
      "start": 842.3400115966797,
      "end": 846.5599975585938,
      "text": " The book of James is often misunderstood because in the book of James there are many"
    },
    {
      "id": 57,
      "start": 846.5599975585938,
      "end": 852.6200103759766,
      "text": " references with regard to good works and our works and you say that you have faith and"
    },
    {
      "id": 58,
      "start": 852.6200103759766,
      "end": 858.5800170898438,
      "text": " show me your works and all of the verses of Scripture that deal with works and I've said"
    },
    {
      "id": 59,
      "start": 858.5800170898438,
      "end": 864.739990234375,
      "text": " before and I think it's an easy understanding that what James is focusing on is not the"
    },
    {
      "id": 60,
      "start": 864.739990234375,
      "end": 869.9400024414062,
      "text": " root of salvation but he's dealing with the fruit of salvation."
    },
    {
      "id": 61,
      "start": 869.9400024414062,
      "end": 878.1000061035156,
      "text": " Because I'm saved, I am His workmanship created in Christ Jesus and here we find that the"
    },
    {
      "id": 62,
      "start": 878.1000061035156,
      "end": 884.260009765625,
      "text": " Lord says to the church in Thyatira, I know thy works and then He says again at the end"
    },
    {
      "id": 63,
      "start": 884.260009765625,
      "end": 888.3399963378906,
      "text": " after He lists the next things, He says and thy works."
    },
    {
      "id": 64,
      "start": 888.3399963378906,
      "end": 889.5400085449219,
      "text": " They're busy serving the Lord."
    },
    {
      "id": 65,
      "start": 889.5400085449219,
      "end": 893.4599914550781,
      "text": " Their service is mentioned in a moment and we'll look at that here as we go through it"
    },
    {
      "id": 66,
      "start": 893.4599914550781,
      "end": 896.0,
      "text": " but we find they're growing in works."
    },
    {
      "id": 67,
      "start": 896.0,
      "end": 899.3399963378906,
      "text": " Number two, they're growing in charity."
    },
    {
      "id": 68,
      "start": 899.3399963378906,
      "end": 903.4200134277344,
      "text": " Notice it says I know thy works and charity."
    },
    {
      "id": 69,
      "start": 903.4200134277344,
      "end": 909.5400085449219,
      "text": " Oh, how important it is that we love people but you understand this evening that loving"
    },
    {
      "id": 70,
      "start": 909.5400085449219,
      "end": 915.0800170898438,
      "text": " people cannot be separated from telling people the truth."
    },
    {
      "id": 71,
      "start": 915.0800170898438,
      "end": 920.3000183105469,
      "text": " So often today the idea is that if you love them or because you love them then you just"
    },
    {
      "id": 72,
      "start": 920.3000183105469,
      "end": 925.6199951171875,
      "text": " kind of accept whatever and let it all be what it wants to be because well, that's just"
    },
    {
      "id": 73,
      "start": 925.6199951171875,
      "end": 926.6199951171875,
      "text": " love."
    },
    {
      "id": 74,
      "start": 926.6199951171875,
      "end": 932.02001953125,
      "text": " But the reality is that love speaks the truth."
    },
    {
      "id": 75,
      "start": 932.02001953125,
      "end": 936.2200012207031,
      "text": " And we find in the scriptures the importance of growing in charity."
    },
    {
      "id": 76,
      "start": 936.2200012207031,
      "end": 942.02001953125,
      "text": " We understand the importance of loving God and loving people and we understand that we're"
    },
    {
      "id": 77,
      "start": 942.02001953125,
      "end": 949.02001953125,
      "text": " to love our brethren and we're to have that brotherly love one for another and the Bible"
    },
    {
      "id": 78,
      "start": 949.02001953125,
      "end": 954.5800170898438,
      "text": " says that God knows their works and He knows their charity and the reality is that God"
    },
    {
      "id": 79,
      "start": 954.5800170898438,
      "end": 958.5599975585938,
      "text": " knows our works and He knows our charity."
    },
    {
      "id": 80,
      "start": 958.5599975585938,
      "end": 963.5,
      "text": " Look over the book of 1 Thessalonians if you will and chapter number four and 1 Thessalonians"
    },
    {
      "id": 81,
      "start": 963.5,
      "end": 972.3000183105469,
      "text": " chapter number four and I want you to note with me what is said about the church in Thessalonica"
    },
    {
      "id": 82,
      "start": 972.3000183105469,
      "end": 975.6199951171875,
      "text": " with regard to their love."
    },
    {
      "id": 83,
      "start": 975.6199951171875,
      "end": 981.1400146484375,
      "text": " And notice with me if you will in 1 Thessalonians chapter number four verses nine and ten the"
    },
    {
      "id": 84,
      "start": 981.1400146484375,
      "end": 987.4200134277344,
      "text": " Bible says this, but as touching brotherly love ye need not that I write unto you for"
    },
    {
      "id": 85,
      "start": 987.4200134277344,
      "end": 992.0,
      "text": " ye yourselves are taught of God to love one another and indeed you do it toward all the"
    },
    {
      "id": 86,
      "start": 992.0,
      "end": 998.02001953125,
      "text": " brethren which are in all Macedonia but we beseech you brethren that ye increase more"
    },
    {
      "id": 87,
      "start": 998.02001953125,
      "end": 999.02001953125,
      "text": " and more."
    },
    {
      "id": 88,
      "start": 999.02001953125,
      "end": 1004.1799926757812,
      "text": " And so we find that the church in Thessalonica is being encouraged, they're being challenged"
    },
    {
      "id": 89,
      "start": 1004.1799926757812,
      "end": 1008.3800048828125,
      "text": " and they're love one for another and Paul says I know that you're doing it but don't"
    },
    {
      "id": 90,
      "start": 1008.3800048828125,
      "end": 1013.4200134277344,
      "text": " be content, don't get comfortable, increase."
    },
    {
      "id": 91,
      "start": 1013.4200134277344,
      "end": 1022.0599975585938,
      "text": " Notice in Romans chapter twelve, in Romans chapter number twelve in verse number nine,"
    },
    {
      "id": 92,
      "start": 1022.0599975585938,
      "end": 1026.4200134277344,
      "text": " Romans chapter twelve in verse number nine and I want you to notice what the Bible says"
    },
    {
      "id": 93,
      "start": 1026.4200134277344,
      "end": 1034.5400085449219,
      "text": " here and Romans twelve in verse number nine, let love be without dissimulation, let love"
    },
    {
      "id": 94,
      "start": 1034.5400085449219,
      "end": 1037.02001953125,
      "text": " be without dissimulation."
    },
    {
      "id": 95,
      "start": 1037.02001953125,
      "end": 1042.739990234375,
      "text": " The reality is that when we speak about our love it's to be a love that is sincere, without"
    },
    {
      "id": 96,
      "start": 1042.739990234375,
      "end": 1048.1799926757812,
      "text": " hypocrisy and we find that he says not only and it's interesting in the same verse of"
    },
    {
      "id": 97,
      "start": 1048.1799926757812,
      "end": 1054.7000122070312,
      "text": " scripture let love be without dissimulation, abhor that which is evil, cleave to that which"
    },
    {
      "id": 98,
      "start": 1054.7000122070312,
      "end": 1057.7000122070312,
      "text": " is good."
    },
    {
      "id": 99,
      "start": 1057.7000122070312,
      "end": 1063.2200012207031,
      "text": " Love speaks the truth and it must speak the truth."
    },
    {
      "id": 100,
      "start": 1063.2200012207031,
      "end": 1068.1799926757812,
      "text": " The reality is that if you're not speaking the truth to someone while at the same time"
    },
    {
      "id": 101,
      "start": 1068.1799926757812,
      "end": 1075.1000061035156,
      "text": " saying that you're loving that person there's a disconnect between those two comments."
    },
    {
      "id": 102,
      "start": 1075.1000061035156,
      "end": 1081.739990234375,
      "text": " There's a problem with that because love speaks the truth and here they're growing in their"
    },
    {
      "id": 103,
      "start": 1081.739990234375,
      "end": 1083.8999938964844,
      "text": " works, they're growing in their charity."
    },
    {
      "id": 104,
      "start": 1083.8999938964844,
      "end": 1088.7799987792969,
      "text": " Number three it says end service, end service."
    },
    {
      "id": 105,
      "start": 1088.7799987792969,
      "end": 1092.8200073242188,
      "text": " What a blessing it is to serve the Lord and we spoke already about their work so I won't"
    },
    {
      "id": 106,
      "start": 1092.8200073242188,
      "end": 1097.1799926757812,
      "text": " belabor the point but look at first Peter chapter four if you will, first Peter chapter"
    },
    {
      "id": 107,
      "start": 1097.1799926757812,
      "end": 1101.1799926757812,
      "text": " number four and I want you to notice what the Bible says here in first Peter chapter"
    },
    {
      "id": 108,
      "start": 1101.1799926757812,
      "end": 1106.2200012207031,
      "text": " four verses ten and eleven with regard to our service."
    },
    {
      "id": 109,
      "start": 1106.2200012207031,
      "end": 1112.2999877929688,
      "text": " I was, had some conversations today actually with a couple of different sets of people"
    },
    {
      "id": 110,
      "start": 1112.2999877929688,
      "end": 1117.9000244140625,
      "text": " and in both of, two of the conversations that I had I mentioned about our service for the"
    },
    {
      "id": 111,
      "start": 1117.9000244140625,
      "end": 1123.5399780273438,
      "text": " Lord and one of them in particular I mentioned about the truth of Joshua standing up and"
    },
    {
      "id": 112,
      "start": 1123.5399780273438,
      "end": 1128.9400024414062,
      "text": " saying as for me and my house we will what?"
    },
    {
      "id": 113,
      "start": 1128.9400024414062,
      "end": 1130.739990234375,
      "text": " Serve the Lord."
    },
    {
      "id": 114,
      "start": 1130.739990234375,
      "end": 1136.5,
      "text": " Now listen Joshua didn't say that so that in 2025 it could be marketed all over the"
    },
    {
      "id": 115,
      "start": 1136.5,
      "end": 1139.0999755859375,
      "text": " place to be hung in your home and my home."
    },
    {
      "id": 116,
      "start": 1139.0999755859375,
      "end": 1143.6600341796875,
      "text": " He said that because he was drawing a line in the sand and he was saying listen choose"
    },
    {
      "id": 117,
      "start": 1143.6600341796875,
      "end": 1147.1400146484375,
      "text": " you this day whom you're going to serve."
    },
    {
      "id": 118,
      "start": 1147.1400146484375,
      "end": 1149.2999877929688,
      "text": " How are you going to go, how are you going to go forward?"
    },
    {
      "id": 119,
      "start": 1149.2999877929688,
      "end": 1150.2999877929688,
      "text": " What are you going to do?"
    },
    {
      "id": 120,
      "start": 1150.2999877929688,
      "end": 1153.780029296875,
      "text": " Are you going to serve the gods of the people in the land?"
    },
    {
      "id": 121,
      "start": 1153.780029296875,
      "end": 1156.1400146484375,
      "text": " Are you going to serve the gods that they served before the flood?"
    },
    {
      "id": 122,
      "start": 1156.1400146484375,
      "end": 1157.8200073242188,
      "text": " What are you going to do?"
    },
    {
      "id": 123,
      "start": 1157.8200073242188,
      "end": 1162.5399780273438,
      "text": " As for me and my house we are going to serve the Lord."
    },
    {
      "id": 124,
      "start": 1162.5399780273438,
      "end": 1166.1400146484375,
      "text": " So then we ask this question, what does it mean to serve the Lord?"
    },
    {
      "id": 125,
      "start": 1166.1400146484375,
      "end": 1167.739990234375,
      "text": " How do we serve the Lord?"
    },
    {
      "id": 126,
      "start": 1167.739990234375,
      "end": 1169.47998046875,
      "text": " Why should we serve the Lord?"
    },
    {
      "id": 127,
      "start": 1169.47998046875,
      "end": 1171.97998046875,
      "text": " How do we serve the Lord together as a family?"
    },
    {
      "id": 128,
      "start": 1171.97998046875,
      "end": 1178.5599975585938,
      "text": " How do we serve the Lord in a time in which things are so busy and there's so many demands"
    },
    {
      "id": 129,
      "start": 1178.5599975585938,
      "end": 1184.2999877929688,
      "text": " upon our lives and going to and fro and all that's taking place and yet we find that this"
    },
    {
      "id": 130,
      "start": 1184.2999877929688,
      "end": 1188.1400146484375,
      "text": " church in Thyatira they're serving the Lord."
    },
    {
      "id": 131,
      "start": 1188.1400146484375,
      "end": 1193.1400146484375,
      "text": " Notice in 1 Peter chapter 4 and verse number 10 the Bible says as every man hath received"
    },
    {
      "id": 132,
      "start": 1193.1400146484375,
      "end": 1194.1400146484375,
      "text": " the gift."
    },
    {
      "id": 133,
      "start": 1194.1400146484375,
      "end": 1196.1400146484375,
      "text": " How many have received the gift?"
    },
    {
      "id": 134,
      "start": 1196.1400146484375,
      "end": 1199.3200073242188,
      "text": " Is anyone excluded?"
    },
    {
      "id": 135,
      "start": 1199.3200073242188,
      "end": 1200.3200073242188,
      "text": " If you're saved."
    },
    {
      "id": 136,
      "start": 1200.3200073242188,
      "end": 1200.3200073242188,
      "text": ""
    },
    {
      "id": 0,
      "start": 1200.3200073242188,
      "end": 1203.8800072669983,
      "text": " If you're here and you're saved that means you've received a gift"
    },
    {
      "id": 1,
      "start": 1204.3200073242188,
      "end": 1209.520007133484,
      "text": " Amen, and it's not simply talking about the gift of salvation. Although that's a wonderful gift"
    },
    {
      "id": 2,
      "start": 1209.520007133484,
      "end": 1214.4000072479248,
      "text": " It's the gift of God, which is eternal life. But here he's talking about spiritual gifts"
    },
    {
      "id": 3,
      "start": 1214.60000705719,
      "end": 1217.360008239746,
      "text": " He talks to the church in Corinth. He talks in Romans"
    },
    {
      "id": 4,
      "start": 1218.0800075531006,
      "end": 1224.220006942749,
      "text": " About the spiritual gifts and he says as every man hath received the gift notice even so"
    },
    {
      "id": 5,
      "start": 1224.720006942749,
      "end": 1226.720006942749,
      "text": " minister the same one to another"
    },
    {
      "id": 6,
      "start": 1227.6800079345703,
      "end": 1230.0000076293945,
      "text": " And then notice how he refers to this"
    },
    {
      "id": 7,
      "start": 1230.6800079345703,
      "end": 1237.9600067138672,
      "text": " This service or this ministry. He says as good stewards of the manifold grace of God"
    },
    {
      "id": 8,
      "start": 1239.640007019043,
      "end": 1244.6800079345703,
      "text": " The Bible tells us in 1st Corinthians chapter 2 that it's required in stewards that a man be found faithful"
    },
    {
      "id": 9,
      "start": 1245.4400062561035,
      "end": 1251.1200065612793,
      "text": " and the reality is that God has been faithful and God has been gracious to give to us a"
    },
    {
      "id": 10,
      "start": 1251.360008239746,
      "end": 1255.080005645752,
      "text": " spiritual gift and to impart to us grace and"
    },
    {
      "id": 11,
      "start": 1255.5600090026855,
      "end": 1262.9600067138672,
      "text": " Then he says to us as the individual believers that we are to be good stewards of the manifold grace of God"
    },
    {
      "id": 12,
      "start": 1263.4400062561035,
      "end": 1267.0800094604492,
      "text": " What are we doing with what God has entrusted us with?"
    },
    {
      "id": 13,
      "start": 1267.1600036621094,
      "end": 1274.2000045776367,
      "text": " How are we using our talents and our gifts for the honor and glory of God verse 11?"
    },
    {
      "id": 14,
      "start": 1274.2000045776367,
      "end": 1276.0800094604492,
      "text": " if any man speak"
    },
    {
      "id": 15,
      "start": 1276.0800094604492,
      "end": 1278.6800079345703,
      "text": " Let him speak as the oracles of God"
    },
    {
      "id": 16,
      "start": 1279.4800109863281,
      "end": 1284.9000091552734,
      "text": " If any man minister let him do it as of the ability which God giveth"
    },
    {
      "id": 17,
      "start": 1285.4000091552734,
      "end": 1290.8000106811523,
      "text": " That God and all things may be glorified through Jesus Christ to whom be praise and dominion"
    },
    {
      "id": 18,
      "start": 1291.4400100708008,
      "end": 1293.4400100708008,
      "text": " forever and ever"
    },
    {
      "id": 19,
      "start": 1293.8800048828125,
      "end": 1297.760009765625,
      "text": " Amen, here's a wonderful couple of truths from verse number 11"
    },
    {
      "id": 20,
      "start": 1297.8000106811523,
      "end": 1302.0000076293945,
      "text": " The Bible says that we're to serve God with our spiritual gift"
    },
    {
      "id": 21,
      "start": 1302.1600036621094,
      "end": 1306.6000061035156,
      "text": " We're not to serve in such a way that we are to receive glory"
    },
    {
      "id": 22,
      "start": 1306.6000061035156,
      "end": 1309.640007019043,
      "text": " No, we're to serve so that he would receive the glory"
    },
    {
      "id": 23,
      "start": 1309.7200088500977,
      "end": 1314.9200057983398,
      "text": " He says that if any man minister let him do it as of the ability which God giveth"
    },
    {
      "id": 24,
      "start": 1315.520004272461,
      "end": 1322.8000106811523,
      "text": " God is going to require of us based upon the ability that he has given to us and"
    },
    {
      "id": 25,
      "start": 1323.240005493164,
      "end": 1327.0800094604492,
      "text": " Yes, it is our responsibility to develop that to"
    },
    {
      "id": 26,
      "start": 1328.240005493164,
      "end": 1330.9200134277344,
      "text": " You know try to come to that place where we are"
    },
    {
      "id": 27,
      "start": 1331.6000061035156,
      "end": 1336.760009765625,
      "text": " Using and developing and being the best that we can be for the glory of God"
    },
    {
      "id": 28,
      "start": 1337.1200103759766,
      "end": 1340.0,
      "text": " but the reality is it's all for the glory of God and"
    },
    {
      "id": 29,
      "start": 1340.5600128173828,
      "end": 1344.4800109863281,
      "text": " He says to whom be praise and dominion forever and ever"
    },
    {
      "id": 30,
      "start": 1345.1200103759766,
      "end": 1346.4000091552734,
      "text": " Amen"
    },
    {
      "id": 31,
      "start": 1346.4000091552734,
      "end": 1348.0400085449219,
      "text": " You know when we serve the Lord"
    },
    {
      "id": 32,
      "start": 1348.0400085449219,
      "end": 1350.0400085449219,
      "text": " It's so that God would be glorified"
    },
    {
      "id": 33,
      "start": 1350.4000091552734,
      "end": 1357.9600067138672,
      "text": " Because if I recognize this evening that it's God who has enabled me if you recognize this evening that it's God who has enabled"
    },
    {
      "id": 34,
      "start": 1357.9600067138672,
      "end": 1362.520004272461,
      "text": " You and God who has gifted you and you're using it for the honor and glory of God"
    },
    {
      "id": 35,
      "start": 1362.6800079345703,
      "end": 1368.0400085449219,
      "text": " Then when man applauds you simply reflect or deflect and say no to God be the glory"
    },
    {
      "id": 36,
      "start": 1368.4400024414062,
      "end": 1374.6000061035156,
      "text": " Because without him truly as John as Jesus said in John without him I can do nothing"
    },
    {
      "id": 37,
      "start": 1375.280014038086,
      "end": 1380.0800018310547,
      "text": " The same is true of you this evening. You say but let me tell you about all the talents that I have"
    },
    {
      "id": 38,
      "start": 1380.8800048828125,
      "end": 1383.8800048828125,
      "text": " Listen, let me tell you about the fact that God gave them to you"
    },
    {
      "id": 39,
      "start": 1384.8400115966797,
      "end": 1386.3200073242188,
      "text": " Amen"
    },
    {
      "id": 40,
      "start": 1386.3200073242188,
      "end": 1388.0800018310547,
      "text": " God gave them to us"
    },
    {
      "id": 41,
      "start": 1388.0800018310547,
      "end": 1393.3000030517578,
      "text": " And so we see that this church is growing in their works and their charity in their service"
    },
    {
      "id": 42,
      "start": 1393.5800018310547,
      "end": 1400.740005493164,
      "text": " Notice the Bible says back in Revelation 2 in verse 19 as he goes through this process of listing this out. He says and"
    },
    {
      "id": 43,
      "start": 1401.780014038086,
      "end": 1405.9400024414062,
      "text": " Faith, I want you to think about faith just for a moment this evening"
    },
    {
      "id": 44,
      "start": 1406.6200103759766,
      "end": 1411.8600006103516,
      "text": " The reality is that the Bible tells us repeatedly that the just shall live by"
    },
    {
      "id": 45,
      "start": 1413.1800079345703,
      "end": 1421.0400085449219,
      "text": " Faith right. So what the Bible says the just shall live by faith. The Bible says that without faith it is"
    },
    {
      "id": 46,
      "start": 1421.7200012207031,
      "end": 1423.7200012207031,
      "text": " Impossible to please God in"
    },
    {
      "id": 47,
      "start": 1424.0800018310547,
      "end": 1430.1600036621094,
      "text": " Hebrews 11 in verse number 6 for he that cometh to God must believe that he is and that he is a"
    },
    {
      "id": 48,
      "start": 1430.3200073242188,
      "end": 1432.8000030517578,
      "text": " Rewarder of them that diligently seek him"
    },
    {
      "id": 49,
      "start": 1432.9600067138672,
      "end": 1438.1200103759766,
      "text": " We have the entirety of Hebrews chapter 11 that talks about by faith"
    },
    {
      "id": 50,
      "start": 1438.1200103759766,
      "end": 1445.5600128173828,
      "text": " This person did this and by faith this person did this and really all that's taking place is the individuals that are mentioned in Hebrews"
    },
    {
      "id": 51,
      "start": 1445.5600128173828,
      "end": 1446.9600067138672,
      "text": " chapter 11"
    },
    {
      "id": 52,
      "start": 1446.9600067138672,
      "end": 1448.9600067138672,
      "text": " Believed what God said"
    },
    {
      "id": 53,
      "start": 1449.4400024414062,
      "end": 1454.0400085449219,
      "text": " Faith is an action. They took God at his word. They stepped out by faith"
    },
    {
      "id": 54,
      "start": 1454.6800079345703,
      "end": 1459.3200073242188,
      "text": " Abraham went to a land that he did not know why because he believed God he had faith"
    },
    {
      "id": 55,
      "start": 1459.6400146484375,
      "end": 1465.2799987792969,
      "text": " Noah built an ark that he did not know anything about with regard to rain and so on and so forth"
    },
    {
      "id": 56,
      "start": 1465.2799987792969,
      "end": 1467.2799987792969,
      "text": " But he believed God"
    },
    {
      "id": 57,
      "start": 1467.6400146484375,
      "end": 1473.6000061035156,
      "text": " In this evening as we begin to look at this idea of our faith and we understand the importance of having"
    },
    {
      "id": 58,
      "start": 1473.9600219726562,
      "end": 1477.7200012207031,
      "text": " Faith and growing in our faith. How does our faith grow?"
    },
    {
      "id": 59,
      "start": 1479.2000122070312,
      "end": 1481.2000122070312,
      "text": " Well, you know the answer"
    },
    {
      "id": 60,
      "start": 1481.4800109863281,
      "end": 1487.3600158691406,
      "text": " Romans chapter number 10, so then faith cometh by hearing and hearing by the Word of God"
    },
    {
      "id": 61,
      "start": 1488.2000122070312,
      "end": 1490.6400146484375,
      "text": " You know how your faith grows, you know how my faith grows"
    },
    {
      "id": 62,
      "start": 1490.760009765625,
      "end": 1495.5599975585938,
      "text": " It's through getting into the Bible and getting the Bible into us and we begin to learn"
    },
    {
      "id": 63,
      "start": 1495.8399963378906,
      "end": 1499.2400207519531,
      "text": " About the character and nature of our God we begin to see"
    },
    {
      "id": 64,
      "start": 1499.6400146484375,
      "end": 1506.2400207519531,
      "text": " What our God has done and what he's capable of doing and all of a sudden it begins to increase our faith"
    },
    {
      "id": 65,
      "start": 1506.5599975585938,
      "end": 1510.9600219726562,
      "text": " It grows our faith. Have you ever heard somebody say well, I don't have their kind of faith"
    },
    {
      "id": 66,
      "start": 1511.7200012207031,
      "end": 1513.7200012207031,
      "text": " Where did they get that faith?"
    },
    {
      "id": 67,
      "start": 1514.5599975585938,
      "end": 1517.52001953125,
      "text": " They got the faith by being in the book"
    },
    {
      "id": 68,
      "start": 1518.52001953125,
      "end": 1525.0,
      "text": " This evening we read about the church and Thessalonica. I mentioned that we'd reference them twice look in second Thessalonians"
    },
    {
      "id": 69,
      "start": 1525.8399963378906,
      "end": 1531.5599975585938,
      "text": " Chapter number one and I want you to notice what the Bible says here in second Thessalonians chapter number one"
    },
    {
      "id": 70,
      "start": 1531.6000061035156,
      "end": 1536.4400024414062,
      "text": " What a what a statement that's made about the church in Thessalonica"
    },
    {
      "id": 71,
      "start": 1539.8800048828125,
      "end": 1541.8800048828125,
      "text": " With regard to their faith"
    },
    {
      "id": 72,
      "start": 1543.8800048828125,
      "end": 1547.4400024414062,
      "text": " In second Thessalonians 1 in verse 3 the Bible says we are bound"
    },
    {
      "id": 73,
      "start": 1548.3600158691406,
      "end": 1551.6400146484375,
      "text": " To thank God always for you brethren as it is meat"
    },
    {
      "id": 74,
      "start": 1552.3600158691406,
      "end": 1554.3600158691406,
      "text": " Notice this because that your faith"
    },
    {
      "id": 75,
      "start": 1555.2000122070312,
      "end": 1557.2000122070312,
      "text": " groweth"
    },
    {
      "id": 76,
      "start": 1557.2400207519531,
      "end": 1559.2400207519531,
      "text": " Exceedingly"
    },
    {
      "id": 77,
      "start": 1559.2799987792969,
      "end": 1561.2799987792969,
      "text": " The"
    },
    {
      "id": 78,
      "start": 1561.8800048828125,
      "end": 1564.4800109863281,
      "text": " Charity of every one of you all toward each other"
    },
    {
      "id": 79,
      "start": 1565.7200012207031,
      "end": 1571.3600158691406,
      "text": " Aboundeth we mentioned in the second point this evening of the church in Thyatira about their charity in here"
    },
    {
      "id": 80,
      "start": 1571.3600158691406,
      "end": 1575.6799926757812,
      "text": " We find that even in the church of Thessalonica after they were encouraged in the first"
    },
    {
      "id": 81,
      "start": 1576.2000122070312,
      "end": 1582.2000122070312,
      "text": " Letter in chapter 4 to increase more and more that the Bible says that their charity is abounding"
    },
    {
      "id": 82,
      "start": 1582.2400207519531,
      "end": 1585.4400024414062,
      "text": " But it says that their faith is growing exceedingly"
    },
    {
      "id": 83,
      "start": 1586.4400024414062,
      "end": 1592.9200134277344,
      "text": " You know this evening you can have faith that's growing exceedingly as you get into the Bible"
    },
    {
      "id": 84,
      "start": 1593.3200073242188,
      "end": 1599.1600036621094,
      "text": " There's been a read about what God has done and about what God is able to do"
    },
    {
      "id": 85,
      "start": 1599.1600036621094,
      "end": 1602.8399963378906,
      "text": " Our God is able to exceeding abundantly above all that we ask or think"
    },
    {
      "id": 86,
      "start": 1603.7200012207031,
      "end": 1610.9600219726562,
      "text": " Consider that simple promise of Ephesians 3 and verse 20 and allow it to sink in tonight when you begin to read throughout the"
    },
    {
      "id": 87,
      "start": 1611.2400207519531,
      "end": 1615.52001953125,
      "text": " The Bible and you read of these great works of God and the"
    },
    {
      "id": 88,
      "start": 1616.0,
      "end": 1619.5599975585938,
      "text": " Demonstrations of God's power it is designed so that you"
    },
    {
      "id": 89,
      "start": 1620.1199951171875,
      "end": 1626.9200134277344,
      "text": " Would have faith that would grow so that my faith would grow so that I would recognize my God is able"
    },
    {
      "id": 90,
      "start": 1627.5599975585938,
      "end": 1633.52001953125,
      "text": " How many times has God put his people in situations that were difficult that were?"
    },
    {
      "id": 91,
      "start": 1633.8000183105469,
      "end": 1636.6400146484375,
      "text": " Challenging that seemed as if there was no way out"
    },
    {
      "id": 92,
      "start": 1637.6400146484375,
      "end": 1639.0800170898438,
      "text": " but God"
    },
    {
      "id": 93,
      "start": 1639.0800170898438,
      "end": 1642.9600219726562,
      "text": " You read those words in Scripture so often, but God"
    },
    {
      "id": 94,
      "start": 1643.9200134277344,
      "end": 1648.8399963378906,
      "text": " Because something changed God showed up. God did something miraculous"
    },
    {
      "id": 95,
      "start": 1648.8399963378906,
      "end": 1655.52001953125,
      "text": " I begin to think about the Apostle Paul in Acts 27 as they're there and they're traveling and they're dealing with a"
    },
    {
      "id": 96,
      "start": 1656.5599975585938,
      "end": 1660.1600036621094,
      "text": " Storm that is contrary and they're tossed to and fro"
    },
    {
      "id": 97,
      "start": 1660.1600036621094,
      "end": 1666.2400207519531,
      "text": " They don't see stars nor Sun nor moon for days and all hope that they should be saved is gone"
    },
    {
      "id": 98,
      "start": 1666.2400207519531,
      "end": 1668.2400207519531,
      "text": " I mean they are in a a"
    },
    {
      "id": 99,
      "start": 1668.8399963378906,
      "end": 1670.8399963378906,
      "text": " Terrible storm"
    },
    {
      "id": 100,
      "start": 1672.5599975585938,
      "end": 1674.5599975585938,
      "text": " But God speaks to Paul"
    },
    {
      "id": 101,
      "start": 1675.6799926757812,
      "end": 1678.2799987792969,
      "text": " And God tells Paul that they're gonna be delivered"
    },
    {
      "id": 102,
      "start": 1679.2000122070312,
      "end": 1682.9600219726562,
      "text": " God tells Paul that everyone on board is going to be saved"
    },
    {
      "id": 103,
      "start": 1684.2799987792969,
      "end": 1686.2799987792969,
      "text": " God tells Paul"
    },
    {
      "id": 104,
      "start": 1686.6799926757812,
      "end": 1691.0,
      "text": " this message and Paul stands up and simply declares I"
    },
    {
      "id": 105,
      "start": 1691.9600219726562,
      "end": 1693.9600219726562,
      "text": " believe God I"
    },
    {
      "id": 106,
      "start": 1694.9200134277344,
      "end": 1696.6799926757812,
      "text": " believe God"
    },
    {
      "id": 107,
      "start": 1696.7200012207031,
      "end": 1703.2799987792969,
      "text": " This evening this church in Thyatira their faith was growing because the Bible says that"
    },
    {
      "id": 108,
      "start": 1703.6799926757812,
      "end": 1709.5599975585938,
      "text": " there at the end that the last to be more than the first and we see that they're growing in works and"
    },
    {
      "id": 109,
      "start": 1709.6400146484375,
      "end": 1715.3200073242188,
      "text": " Charity and service and faith and then notice finally number five. It says and thy"
    },
    {
      "id": 110,
      "start": 1716.0,
      "end": 1720.5599975585938,
      "text": " patience and thy patience this word patience is"
    },
    {
      "id": 111,
      "start": 1721.3599853515625,
      "end": 1726.6400146484375,
      "text": " Defined and often translated dealing with our English idea of steadfastness"
    },
    {
      "id": 112,
      "start": 1727.7999877929688,
      "end": 1729.3599853515625,
      "text": " can"
    },
    {
      "id": 113,
      "start": 1729.3599853515625,
      "end": 1730.8800048828125,
      "text": " constancy and"
    },
    {
      "id": 114,
      "start": 1730.8800048828125,
      "end": 1736.2000122070312,
      "text": " Endurance. I want you to think about the the word patience with regard to that"
    },
    {
      "id": 115,
      "start": 1737.3200073242188,
      "end": 1742.1199951171875,
      "text": " understanding of definition of being steadfast of of being constant of"
    },
    {
      "id": 116,
      "start": 1743.52001953125,
      "end": 1745.52001953125,
      "text": " Enduring through trials. I"
    },
    {
      "id": 117,
      "start": 1746.4400024414062,
      "end": 1750.7200317382812,
      "text": " Heard someone say years ago, what does it take to stop you?"
    },
    {
      "id": 118,
      "start": 1752.239990234375,
      "end": 1754.9600219726562,
      "text": " The reality is that as God's people"
    },
    {
      "id": 119,
      "start": 1755.2000122070312,
      "end": 1762.6400146484375,
      "text": " We're to continue to go forward we're to continue to to do what God has called us to do and we see this"
    },
    {
      "id": 120,
      "start": 1763.4000244140625,
      "end": 1766.3200073242188,
      "text": " steadfastness that is mentioned this patience"
    },
    {
      "id": 121,
      "start": 1767.2000122070312,
      "end": 1773.239990234375,
      "text": " Endurance and constancy look at first Thessalonians. Sorry, excuse me first Corinthians chapter 15 and"
    },
    {
      "id": 122,
      "start": 1773.7200317382812,
      "end": 1779.3599853515625,
      "text": " Ronnie challenged me last week on this verse of Scripture and you know, Ronnie. He's a he's got a"
    },
    {
      "id": 123,
      "start": 1780.47998046875,
      "end": 1784.6000366210938,
      "text": " Way of just kind of asking you a question and saying here's what he did to him"
    },
    {
      "id": 124,
      "start": 1784.6000366210938,
      "end": 1787.6799926757812,
      "text": " He said hey first Corinthians 1558. Do you know it tell it to me?"
    },
    {
      "id": 125,
      "start": 1788.4000244140625,
      "end": 1793.3200073242188,
      "text": " As we did right after the service last week and I was like, okay, let me see. Yep. Got it"
    },
    {
      "id": 126,
      "start": 1793.3200073242188,
      "end": 1800.1199951171875,
      "text": " And you know, I mean I was completely in a different gear and everything but this verse of Scripture is so powerful"
    },
    {
      "id": 0,
      "start": 1800.1199951171875,
      "end": 1812.5599946975708,
      "text": " Therefore, my beloved brethren,\" notice what he says, be steadfast, unmovable, always abounding"
    },
    {
      "id": 1,
      "start": 1812.5599946975708,
      "end": 1814.4199953079224,
      "text": " in the work of the Lord."
    },
    {
      "id": 2,
      "start": 1814.4199953079224,
      "end": 1822.759994506836,
      "text": " And then notice what he says, for as much as you know that your labor is not in vain"
    },
    {
      "id": 3,
      "start": 1822.759994506836,
      "end": 1826.0599956512451,
      "text": " in the Lord."
    },
    {
      "id": 4,
      "start": 1826.0599956512451,
      "end": 1833.1599960327148,
      "text": " They're being steadfast, their patience is being recognized, their constancy, their endurance."
    },
    {
      "id": 5,
      "start": 1833.1599960327148,
      "end": 1839.4999961853027,
      "text": " And we find that as Paul writes to the church in Corinth, he says, listen brethren, I mean"
    },
    {
      "id": 6,
      "start": 1839.4999961853027,
      "end": 1844.0999946594238,
      "text": " 1 Corinthians 15 is the great resurrection chapter."
    },
    {
      "id": 7,
      "start": 1844.0999946594238,
      "end": 1850.0999946594238,
      "text": " And he concludes the section dealing with this mortal shall put on immortality and this"
    },
    {
      "id": 8,
      "start": 1850.0999946594238,
      "end": 1852.6999969482422,
      "text": " corruption shall put on incorruption."
    },
    {
      "id": 9,
      "start": 1852.6999969482422,
      "end": 1858.1399955749512,
      "text": " And he deals with this great climactic passage of scripture with the resurrection and how"
    },
    {
      "id": 10,
      "start": 1858.1399955749512,
      "end": 1863.0999946594238,
      "text": " wonderful it is that we are going to be changed in a moment."
    },
    {
      "id": 11,
      "start": 1863.0999946594238,
      "end": 1870.3399963378906,
      "text": " And he says, therefore, my beloved brethren, be steadfast, unmovable, always abounding"
    },
    {
      "id": 12,
      "start": 1870.3399963378906,
      "end": 1871.379997253418,
      "text": " in the work of the Lord."
    },
    {
      "id": 13,
      "start": 1871.379997253418,
      "end": 1877.1799926757812,
      "text": " For as much as you know that your labor is not in vain in the Lord."
    },
    {
      "id": 14,
      "start": 1877.1799926757812,
      "end": 1880.8399963378906,
      "text": " You know, there are times in which you can feel like, is it even working?"
    },
    {
      "id": 15,
      "start": 1880.8399963378906,
      "end": 1881.8399963378906,
      "text": " Is it even doing?"
    },
    {
      "id": 16,
      "start": 1881.979995727539,
      "end": 1883.3999938964844,
      "text": " Listen, no, it is working."
    },
    {
      "id": 17,
      "start": 1883.3999938964844,
      "end": 1884.3999938964844,
      "text": " God is at work."
    },
    {
      "id": 18,
      "start": 1884.3999938964844,
      "end": 1886.5199966430664,
      "text": " God does use his word."
    },
    {
      "id": 19,
      "start": 1886.5199966430664,
      "end": 1890.479995727539,
      "text": " I met with someone this past week, and as I was chatting with them, and they shared"
    },
    {
      "id": 20,
      "start": 1890.479995727539,
      "end": 1898.2799987792969,
      "text": " a, not a huge measure of discouragement, but a desire and an uncertainty whether or not"
    },
    {
      "id": 21,
      "start": 1898.2799987792969,
      "end": 1899.4399948120117,
      "text": " they've made any difference."
    },
    {
      "id": 22,
      "start": 1899.4399948120117,
      "end": 1904.479995727539,
      "text": " And I said, listen, if you've shared the word of God with them, you can rest assured that"
    },
    {
      "id": 23,
      "start": 1904.479995727539,
      "end": 1907.479995727539,
      "text": " God will use his word."
    },
    {
      "id": 24,
      "start": 1907.479995727539,
      "end": 1914.259994506836,
      "text": " It may not be in your timing, it may not be in my timing, but God will use his word."
    },
    {
      "id": 25,
      "start": 1914.259994506836,
      "end": 1921.639991760254,
      "text": " And we must understand that we are to be steadfast, we're to have that patience that is spoken"
    },
    {
      "id": 26,
      "start": 1921.639991760254,
      "end": 1929.8799896240234,
      "text": " of in the church in Thyatira, that constancy, that endurance, that faithfulness."
    },
    {
      "id": 27,
      "start": 1929.8799896240234,
      "end": 1936.3399963378906,
      "text": " I'm reminded of what is said to the, in Galatians chapter 6 to those churches in the region"
    },
    {
      "id": 28,
      "start": 1936.3399963378906,
      "end": 1937.3399963378906,
      "text": " of Galatia."
    },
    {
      "id": 29,
      "start": 1938.1999969482422,
      "end": 1940.7799987792969,
      "text": " By the way, that was the first missionary journey these churches are written to."
    },
    {
      "id": 30,
      "start": 1940.7799987792969,
      "end": 1943.8799896240234,
      "text": " I'm not going to tell you all of them, Fernando, because you're supposed to study it."
    },
    {
      "id": 31,
      "start": 1943.8799896240234,
      "end": 1949.6999969482422,
      "text": " But the reality is that in Galatians 6 and verse number 9, the Bible says this, and let"
    },
    {
      "id": 32,
      "start": 1949.6999969482422,
      "end": 1955.1799926757812,
      "text": " us not be weary in what?"
    },
    {
      "id": 33,
      "start": 1955.1799926757812,
      "end": 1957.259994506836,
      "text": " In well-doing."
    },
    {
      "id": 34,
      "start": 1957.259994506836,
      "end": 1962.9400024414062,
      "text": " For in due season we shall reap if we faint not."
    },
    {
      "id": 35,
      "start": 1962.9400024414062,
      "end": 1966.7799987792969,
      "text": " Listen, we like it when the reaping comes."
    },
    {
      "id": 36,
      "start": 1967.2200012207031,
      "end": 1969.8600006103516,
      "text": " But you know when the reaping comes?"
    },
    {
      "id": 37,
      "start": 1969.8600006103516,
      "end": 1971.4599914550781,
      "text": " After the sowing."
    },
    {
      "id": 38,
      "start": 1971.4599914550781,
      "end": 1972.979995727539,
      "text": " Amen?"
    },
    {
      "id": 39,
      "start": 1972.979995727539,
      "end": 1974.3799896240234,
      "text": " After the labor."
    },
    {
      "id": 40,
      "start": 1974.3799896240234,
      "end": 1975.5,
      "text": " I've never been a farmer."
    },
    {
      "id": 41,
      "start": 1975.5,
      "end": 1977.6199951171875,
      "text": " I don't think I'm ever going to be a farmer."
    },
    {
      "id": 42,
      "start": 1977.6199951171875,
      "end": 1981.5399932861328,
      "text": " But the reality is that there's a whole lot of work that a farmer does before he ever"
    },
    {
      "id": 43,
      "start": 1981.5399932861328,
      "end": 1983.6999969482422,
      "text": " gets to the reaping."
    },
    {
      "id": 44,
      "start": 1983.6999969482422,
      "end": 1986.979995727539,
      "text": " The reaping is kind of the enjoyable part."
    },
    {
      "id": 45,
      "start": 1986.979995727539,
      "end": 1993.1399993896484,
      "text": " By the way, we enjoy it when God allows us to reap souls, when we see fruit, we have"
    },
    {
      "id": 46,
      "start": 1993.1399993896484,
      "end": 1997.4599914550781,
      "text": " that opportunity to share the gospel and see somebody trust Christ as their Savior."
    },
    {
      "id": 47,
      "start": 1997.4599914550781,
      "end": 1999.739990234375,
      "text": " What a blessing that is."
    },
    {
      "id": 48,
      "start": 1999.739990234375,
      "end": 2003.2200012207031,
      "text": " But oftentimes it's breaking up the fallow ground."
    },
    {
      "id": 49,
      "start": 2003.2200012207031,
      "end": 2011.5,
      "text": " Oftentimes it's plowing through the hard-hearted individuals in their stony ground, so to speak,"
    },
    {
      "id": 50,
      "start": 2011.5,
      "end": 2013.0199890136719,
      "text": " and dealing with all of that."
    },
    {
      "id": 51,
      "start": 2013.0199890136719,
      "end": 2021.0199890136719,
      "text": " But God says that we're not to be weary in well-doing, that we're to have that faith"
    },
    {
      "id": 52,
      "start": 2021.0199890136719,
      "end": 2028.8199920654297,
      "text": " and that expectation of reaping and understanding that God is at work."
    },
    {
      "id": 53,
      "start": 2028.8199920654297,
      "end": 2035.3399963378906,
      "text": " Unfortunately, as we look at the church in Thyatira, it doesn't end here, it continues."
    },
    {
      "id": 54,
      "start": 2035.3399963378906,
      "end": 2039.3799896240234,
      "text": " And he says in verse number 20, and it'll be our text for next week or next time, because"
    },
    {
      "id": 55,
      "start": 2039.3799896240234,
      "end": 2044.4599914550781,
      "text": " next week we have a missionary, but in verse number 20, notwithstanding, I have a few things"
    },
    {
      "id": 56,
      "start": 2044.4599914550781,
      "end": 2045.8999938964844,
      "text": " against thee."
    },
    {
      "id": 57,
      "start": 2045.8999938964844,
      "end": 2052.779998779297,
      "text": " And let me just say this, they're heavy things that God has against the church at Thyatira."
    },
    {
      "id": 58,
      "start": 2052.779998779297,
      "end": 2054.8199920654297,
      "text": " And here's the reality."
    },
    {
      "id": 59,
      "start": 2054.8199920654297,
      "end": 2059.540008544922,
      "text": " Here's the reality tonight, and I'll mention it when we finish and pick back up with this"
    },
    {
      "id": 60,
      "start": 2059.540008544922,
      "end": 2063.540008544922,
      "text": " message on Thyatira, but it's important to note it this evening."
    },
    {
      "id": 61,
      "start": 2063.540008544922,
      "end": 2068.6199951171875,
      "text": " God examines every part."
    },
    {
      "id": 62,
      "start": 2068.6199951171875,
      "end": 2078.0,
      "text": " And God sees this good, but it doesn't mean that He ignores the bad."
    },
    {
      "id": 63,
      "start": 2078.0,
      "end": 2083.3800048828125,
      "text": " Because He's the one, according to verse 18, that has eyes like unto a flame of fire, and"
    },
    {
      "id": 64,
      "start": 2083.3800048828125,
      "end": 2086.4199829101562,
      "text": " His feet are like fine brass."
    },
    {
      "id": 65,
      "start": 2086.4199829101562,
      "end": 2091.239990234375,
      "text": " And He says you're doing this good, these things are growing, but I have some things"
    },
    {
      "id": 66,
      "start": 2091.239990234375,
      "end": 2093.019989013672,
      "text": " against you."
    },
    {
      "id": 67,
      "start": 2093.019989013672,
      "end": 2097.1000061035156,
      "text": " Because you've got some problems, and they're major problems in the church at Thyatira."
    },
    {
      "id": 68,
      "start": 2097.1000061035156,
      "end": 2101.9199829101562,
      "text": " I mean major significant problems that God says if you don't deal with it, you're going"
    },
    {
      "id": 69,
      "start": 2101.9199829101562,
      "end": 2105.97998046875,
      "text": " to face serious punishment."
    },
    {
      "id": 70,
      "start": 2105.97998046875,
      "end": 2108.199981689453,
      "text": " And what is the goal this evening?"
    },
    {
      "id": 71,
      "start": 2108.199981689453,
      "end": 2114.1799926757812,
      "text": " The goal is to have that balanced ministry that I spoke of by way of introduction tonight."
    },
    {
      "id": 72,
      "start": 2114.1799926757812,
      "end": 2119.7999877929688,
      "text": " That we understand that God is going to evaluate and examine every part."
    },
    {
      "id": 73,
      "start": 2119.7999877929688,
      "end": 2123.459991455078,
      "text": " That we must understand the importance of, yes, we need to do these things, but at the"
    },
    {
      "id": 74,
      "start": 2123.459991455078,
      "end": 2127.6399841308594,
      "text": " same time we have to maintain doctrinal integrity."
    },
    {
      "id": 75,
      "start": 2127.6399841308594,
      "end": 2132.6000061035156,
      "text": " At the same time of doing the works and growing in our faith and all that we're doing and"
    },
    {
      "id": 76,
      "start": 2132.6000061035156,
      "end": 2139.0599975585938,
      "text": " seeing new people added to a church and growing and discipling, that we cannot compromise"
    },
    {
      "id": 77,
      "start": 2139.0599975585938,
      "end": 2141.6199951171875,
      "text": " on the doctrine."
    },
    {
      "id": 78,
      "start": 2141.6199951171875,
      "end": 2146.5,
      "text": " It's so vitally important that there's balance."
    },
    {
      "id": 79,
      "start": 2146.5,
      "end": 2147.7999877929688,
      "text": " And can I say it this way?"
    },
    {
      "id": 80,
      "start": 2147.7999877929688,
      "end": 2151.2999877929688,
      "text": " It's so challenging."
    },
    {
      "id": 81,
      "start": 2151.2999877929688,
      "end": 2155.97998046875,
      "text": " That's why we see in these letters to the churches where so often there's some good"
    },
    {
      "id": 82,
      "start": 2155.97998046875,
      "end": 2159.97998046875,
      "text": " things and then there's some not so good things."
    },
    {
      "id": 83,
      "start": 2159.97998046875,
      "end": 2165.0599975585938,
      "text": " And you know it in your own life personally as you're seeking to walk with God and please"
    },
    {
      "id": 84,
      "start": 2165.0599975585938,
      "end": 2166.0599975585938,
      "text": " God."
    },
    {
      "id": 85,
      "start": 2166.0599975585938,
      "end": 2169.0599975585938,
      "text": " There are areas you say, man, I did pretty good in this area, but man, I'm suffering"
    },
    {
      "id": 86,
      "start": 2169.0599975585938,
      "end": 2170.0599975585938,
      "text": " over here."
    },
    {
      "id": 87,
      "start": 2170.0599975585938,
      "end": 2172.779998779297,
      "text": " And then we put some attention over here, and then we're struggling over here."
    },
    {
      "id": 88,
      "start": 2172.779998779297,
      "end": 2180.3800048828125,
      "text": " And it's this constant battle of consistency in the Christian life."
    },
    {
      "id": 89,
      "start": 2180.459991455078,
      "end": 2185.1399841308594,
      "text": " The church in Thyatira, for the main subject that we're dealing with this evening, they"
    },
    {
      "id": 90,
      "start": 2185.1399841308594,
      "end": 2189.97998046875,
      "text": " are commended for their growth in these areas in which they are growing."
    },
    {
      "id": 91,
      "start": 2189.97998046875,
      "end": 2195.220001220703,
      "text": " Oh, that God would help us, even as we evaluate our own lives personally and evaluate our"
    },
    {
      "id": 92,
      "start": 2195.220001220703,
      "end": 2200.8200073242188,
      "text": " church corporately, we'd have to ask ourselves the question, are we growing?"
    },
    {
      "id": 93,
      "start": 2200.8200073242188,
      "end": 2203.8599853515625,
      "text": " We know that we're supposed to be."
    },
    {
      "id": 94,
      "start": 2203.8599853515625,
      "end": 2206.5,
      "text": " The question is not are we supposed to be growing?"
    },
    {
      "id": 95,
      "start": 2206.5,
      "end": 2209.260009765625,
      "text": " The question is, are we growing?"
    },
    {
      "id": 96,
      "start": 2209.260009765625,
      "end": 2210.5,
      "text": " Is my faith growing?"
    },
    {
      "id": 97,
      "start": 2210.5,
      "end": 2212.8200073242188,
      "text": " Is my service growing?"
    },
    {
      "id": 98,
      "start": 2212.8200073242188,
      "end": 2218.2999877929688,
      "text": " My works, my charity, my patience, is it growing?"
    },
    {
      "id": 99,
      "start": 2218.2999877929688,
      "end": 2219.2999877929688,
      "text": " Let's pray together."
    },
    {
      "id": 100,
      "start": 2219.2999877929688,
      "end": 2220.2999877929688,
      "text": " Father, we love You."
    },
    {
      "id": 101,
      "start": 2220.2999877929688,
      "end": 2221.2999877929688,
      "text": " We thank You for loving us."
    },
    {
      "id": 102,
      "start": 2221.2999877929688,
      "end": 2222.519989013672,
      "text": " Thank You for the day."
    },
    {
      "id": 103,
      "start": 2222.519989013672,
      "end": 2223.6199951171875,
      "text": " Thank You for the blessings."
    },
    {
      "id": 104,
      "start": 2223.6199951171875,
      "end": 2225.5799865722656,
      "text": " We thank You for Your Word."
    },
    {
      "id": 105,
      "start": 2225.5799865722656,
      "end": 2230.220001220703,
      "text": " I pray, Father, that You would help us to evaluate and examine our own lives individually"
    },
    {
      "id": 106,
      "start": 2230.220001220703,
      "end": 2231.540008544922,
      "text": " and corporately as a church."
    },
    {
      "id": 107,
      "start": 2231.540008544922,
      "end": 2233.4199829101562,
      "text": " And Lord, help us to please You."
    },
    {
      "id": 108,
      "start": 2233.4199829101562,
      "end": 2235.0,
      "text": " We want to have balance in ministry."
    },
    {
      "id": 109,
      "start": 2235.0,
      "end": 2240.4400024414062,
      "text": " We want to be doing what You've called us to do, pleasing You in every area of our lives"
    },
    {
      "id": 110,
      "start": 2240.4400024414062,
      "end": 2241.4400024414062,
      "text": " and our ministry."
    },
    {
      "id": 111,
      "start": 2241.4400024414062,
      "end": 2244.5599975585938,
      "text": " I pray, Father, in this moment of invitation that You'd have Your will and way."
    },
    {
      "id": 112,
      "start": 2244.5599975585938,
      "end": 2247.6000061035156,
      "text": " I pray, God, that You would move in hearts and lives as only You can."
    },
    {
      "id": 113,
      "start": 2247.6000061035156,
      "end": 2251.8999938964844,
      "text": " And Lord, I pray that You'd bless the remainder of the evening with regard to the Bible quiz"
    },
    {
      "id": 114,
      "start": 2251.8999938964844,
      "end": 2253.3999938964844,
      "text": " and also the birthday fellowship."
    },
    {
      "id": 115,
      "start": 2253.3999938964844,
      "end": 2257.1199951171875,
      "text": " I pray that You'd have Your will and way through all of those things and we'll thank You for"
    },
    {
      "id": 116,
      "start": 2257.1199951171875,
      "end": 2258.4400024414062,
      "text": " it in Christ's name we pray."
    },
    {
      "id": 117,
      "start": 2258.4400024414062,
      "end": 2259.6799926757812,
      "text": " Would You stand with me?"
    },
    {
      "id": 118,
      "start": 2259.6799926757812,
      "end": 2261.040008544922,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 119,
      "start": 2261.040008544922,
      "end": 2262.720001220703,
      "text": " Kimberly's gonna play quietly on the piano."
    },
    {
      "id": 120,
      "start": 2262.720001220703,
      "end": 2264.6399841308594,
      "text": " As she does, the altar is open."
    }
  ],
  "processed_at": "2025-04-14T20:30:33.549694"
}